{
  "id": 11164,
  "origin_website": "Jove",
  "title": "Quantitative Locomotion Study of Freely Swimming Micro-organisms Using Laser Diffraction",
  "procedures": [
    "1. C. elegans Preparation for Video Analysis\nMove 10-20 gravid adult nematodes to fresh NGM agar-filled Petri plates using a thin, flattened platinum wire pick. The Petri dishes filled with the NGM agar contain a small circular spot of E. coli (a growth limited strain, OP50, gives the best results) for the nematodes to eat. Allow the nematodes to lay eggs for 3-5 hr and then remove the adults, thus establishing a small, developmentally-synchronized culture of 50-150 nematodes. Allow the nematodes to grow to early adulthood by incubating the Petri plates at 20 °C for 4-5 days. These culture methods are based on established procedures (Stiernagle 2006).5\nOn the day of the video analysis, flush a plate of young adult nematodes with 1 ml of deionized, distilled water, thus collecting 50-150 worms from the synchronized culture. A buffer solution like M9 or PBS can also be used. Use a microcentrifuge to spin the worms to the bottom of the tube, or allow them to settle by gravity for about 15 min. Remove the majority of the water from the tube and replace it with 1 ml of deionized, distilled water in order to wash any adhering bacteria from the nematodes.",
    "Transfer nematodes in water or buffer to a quartz cuvette using a micropipette. It is important to work with a small number, about 5-10 nematodes in total at one time or even fewer so that one nematode at a time is likely to be illuminated by the laser. If the number of nematodes on the culture plates is too large, dilute the worms in water or buffer until a desired density is reached. It is also possible to pick individual nematodes to a drop of water or buffer on a fresh agar plate to wash them and transfer individual worms to the cuvette. In our study, we used 1 mm, 2 mm and 5 mm cuvette sizes to examine the effects of physical constraints on swimming behavior.\n2. Optical Setup for the Video Analysis",
    "Perform setup as shown in Figure 1 using a 543 nm (green) Helium-Neon (HeNe) laser, two front-surface aluminum mirrors, a cuvette holder, a projection screen, and a high-speed camera (Casio High Speed Exilim) capable of filming at ~240 fps. The two mirrors are used to steer the laser beam through the cuvette. Different sizes of cuvettes can be used depending on the nature of the study. As an example, we used cuvettes that are 5 mm thick to show the effects of spatial constraints on swimming frequencies. The laser beam must fulfill the requirements for oversampling; i.e., the organism should obstruct no more than one third of the laser beam. For C. elegans, the laser beam should be about 2 mm in diameter when it interacts with a nematode. The laser beam should not be larger than 5 mm in diameter since the diffraction pattern will be difficult to locate. The distance from the diffracting organism to the screen should be much larger than the organism itself.\nPlace parafilm over the top of the cuvette and invert it to mix the nematodes into the water column. Place the cuvette in a cuvette holder so that worms are initially near the top of the cuvette. Using the mirrors, steer the laser beam through the center of the cuvette. Because the nematodes are denser than water, they will slowly fall to the bottom of the cuvette, while at the same time swimming within the water column.",
    "On the projection screen, color the spot corresponding to the transmitted laser beam black to reduce scattering as the transmitted beam meets the projection screen (Figure 2). Alternatively put an opening in the projection screen to allow the transmitted beam to pass through the screen. Eliminating or reducing scattering from the transmitted beam will keep the CCD array of the camera from saturating due to the transmitted beam.\nTo capture a measure of the size of the diffraction pattern, draw a line of about 5 cm on the projection screen next to the transmitted laser beam spot without interfering with the diffracted light image.\nStart recording with the camera while the room light is on so that the 5 cm line is on the same footage as the diffraction images. Turn the room light off. Record diffraction images on the screen with the camera as worms pass through the laser beam.\n3. Video Data Preparation\nInstall video analysis program (Logger Pro: http://www.vernier.com/products/software/lp/[href=http://www.vernier.com/products/software/lp/]) on the computer. Import the video into video analysis program\nSet the origin to coincide with the transmitted laser spot. Set the scale using the 5 cm line on the projection screen.\nTrack the angular displacement of the diffraction image formed by each nematode using the video analysis software (Figure 3)\nTo find the angular displacement by taking the arctan (y/x), copy and paste data into a spreadsheet (Excel) and add 180 deg or π for all negative angles to produce a continuous graph (Figure. 4).\n4. Real Time Data Acquisition for Instant Observation of Swimming Frequencies\nUsing the same setup as for the video analysis, place a photodiode (DET10A from ThorLabs) with a small area (~1 mm2) off center in the diffraction pattern right in front of the projection screen.",
    "Connect the photodiode to the digital oscilloscope (PicoScope made by Pico Technology) that connects to the computer via USB port. Observe the thrashing patterns on the computer screen.\nSave acquired data sets in ASCII or text format.\n5. Data Analysis\nImport the data acquired using video or the photodiode into a data analysis program capable of fitting waveforms using chi-square minimization. The program used here is Origin (http://www.originlab.com/[href=http://www.originlab.com/]). Fit a sinusoidal curve to determine thrashing frequency (Figures 4 and 5).\nAverage swimming frequencies from various samples and determine variance. For this study, data were analyzed statistically using a single-factor ANOVA followed by the Bonferroni multiple comparisons test. A p-value of < 0.05 was considered statistically significant.\n6. Model Diffraction Patterns using Mathematica as an Example\nNote: Diffraction patterns can be modeled using many different computational tools. This procedure will differ for different computational tools such as MatLab, Excel, Origin etc.\nCreate Image: Take images of nematodes on a microscope slide using a traditional microscope.\nBinarize image: Import the worm image 'Worm' into Mathematica by dragging the image into Mathematica. Convert the image into a black and white image (binarize). This can be achieved with the 'Binarize' command in Mathematica: BlackandWhiteImage=Binarize[Worm]. The image can then be viewed as a black and white image.\n Alternatively, use the 'EdgeDetect' command to create a BlackandWhiteImage: EdgeDetect[Worm,6.0,0.035], where the two trailing numbers control the coarseness of the resulting edges.\nConvert image into a matrix of zeroes and ones: This can be achieved with the 'ImageData' command in Mathematica: Matrix=ImageData[BlackandWhiteImage].\nFourier transform matrix: Use the 'Fourier' command in Mathematica to Fourier transform the matrix using the indicated FourierParameters: FTransform = Fourier[Matrix, FourierParameters -> {0, -2}].",
    "Square modulus of matrix to obtain the diffraction matrix and improve image contrast: Square the absolute value of the matrix and view the resultant image, which is the diffraction pattern corresponding to the original image. Also, use the 'Log' function to scale the contrast of the image: ImageContrast = Image[Log[1 + (Abs[FTransform])^2]/0.5].\nResize image for easy viewing: Crop the central diffraction pattern and resize as desired: ImageResize[ImageContrast [y, 100], 500].\nCompare the modeled diffraction patterns with diffraction patterns obtained from freely swimming worms. (Figure 6)"
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}