{
  "id": 13517,
  "origin_website": "Jove",
  "title": "A Standardized Approach for Multispecies Purification of Mammalian Male Germ Cells by Mechanical Tissue Dissociation and Flow Cytometry",
  "procedures": [
    "All procedures described below complied with regulations of the Animal Studies Committee at Washington University in St. Louis.\n1. Preparations for Mechanical Dissociation Protocol\nPre-wet a 50 µm disposable tissue disaggregation cartridge for dissociation of a whole murine testis.\n\tNOTE: This disposable tissue disaggregation cartridge contains microblades designed for cutting of tissues and an immobile steel mesh with approximately 100 hexagonal holes. Different sizes of mesh for tissue disaggregation cartridge are available to adapt this protocol based on species and desired cell types. 50 µm cartridges were used for all mammalian species mentioned in this paper.\n\t\nLoad 1 mL of ice cold phenol red free 1x Dulbecco's Modified Eagle Medium (DMEM) onto the 50 µm disposable tissue disaggregation cartridge.\n\t\tNOTE: Phenol red may interfere with detection of red fluorescence during FACS.\nAspirate 1x DMEM from the tissue disaggregation cartridge with a disposable 3 mL needle-less syringe from the syringe port.\nTurn on tissue disaggregation system by pressing \"ON\" button. This system does not require \"warm up\" time.\nPre-wet three 40 µm disposable filters with ice cold 1x DMEM. Place each 40 µm disposable filter on a 50 mL conical tube. Pipette 1 mL of 1x DMEM and allow pass through of the liquid.\nPrepare a 100 mm x 15 mm Petri dish for collection of testicular tissues. Pipette 500 µL of 1x DMEM onto the Petri dish.\n2. Preparation of Testicular Tissue for Mechanical Dissociation Protocol\nDissect a male mouse to carefully remove fresh whole testes or testicular fragments (if dealing with other mammalian species) with surgical scissors and forceps.\n\tNOTE: Ensure tissues are free of fat and necrosis. Fresh testicular tissues generate superior single-cell suspension quality than frozen tissues.\n\t\nTransfer collected testes/fragments to the prepared 100 mm x 15 mm Petri dish containing 500 µL of 1x DMEM.",
    "Gently rinse the tissue in 1x DMEM to remove red blood cells (if present).\nCarefully remove tunica albuginea. Thickness of tunica albuginea will vary in different species.\nGrab one end of testis with forceps.\nPuncture the other end of testis with a scalpel while still holding the one end of testis with forceps from previous step.\nScrape testicular tubules using a scalpel while still holding the one end of testis with forceps from Step 2.2.1.\nCut testicular tubules into pieces of ~2-3 mm3 using a scalpel.\n3. Obtaining Single Cell Suspensions by Mechanical Dissociation of Testicular Tissue\nNOTE: The dissociation steps described below are for one adult mouse testis. Volumes of testicular tissues from juvenile mice or non-murine species should be adjusted accordingly. Juvenile animals may not contain all the stages of germ cells. Some mammalian species have testicular tissue composition changes during breeding seasons in comparison to non-mating season.\nTransfer the small testicular tubule pieces to the pre-wetted 50 µm tissue disaggregation cartridge using forceps and add 1 mL of 1x DMEM.\nLoad the tissue disaggregation cartridge to tissue disaggregation system and process for 5 min by turning the knob from \"standby\" to \"run\" mode.\nRemove the tissue disaggregation cartridge from tissue disaggregation system and aspirate cell suspension with a disposable 3 mL needle-less syringe from the syringe port.\nAspirate a few times to remove all liquid from tissue disaggregation cartridge. Not all of the 1 mL may be recovered from the tissue disaggregation cartridge.\nPass the aspirated cell suspension through two disposable pre-wetted 40 µm filters. Filter twice to remove any cell aggregates.\nPlace one pre-wetted 40 µm filter in a 50 mL conical tube. Directly add aspirated cells in the syringe onto the 40 µm filter. Pipette pass-through single-cell suspension with a disposable pipette.",
    "Remove the used pre-wetted 40 µm filter and place another pre-wetted 40 µm filter in the 50-mL conical tube. Pipette the collected single-cell suspension onto the clean 40 µm filter.\nCollect filtered single-cell suspension with a clean disposable pipette.\nPipette filtered cell suspension back to the 50 µm tissue disaggregation cartridge and process for another 5 min in a tissue disaggregation system.\nRecover all the liquid from the tissue disaggregation cartridge.\n4. Staining with Hoechst and Propidium Iodide (PI)\nTransfer recovered cell suspension from the 50 µm tissue disaggregation cartridge to a clean 1.5 mL tube . Approximately 1-1.5 mL of single-cell suspension will be recovered.\nDivide the recovered single-cell suspension into four 1.5 mL or 5 mL tubes.\nFor first three tubes, pipette 150 µL of single-cell suspension and pipette rest of single-cell suspension into the last of the four tubes (approximately 550 µL of single-cell suspension).\n\t\tNOTE: Amount of single-cell suspension in the last tube may vary based on the efficiency of cell suspension recovery at step 3.6.\nSet first tube of the four tubes as an unstained control for FACS session.\nPrepare single dye stained (PI or Hoechst) cell suspensions as controls. Add 2.5 µL of Hoechst or 1 µL of PI to each tube (second and third).\nPrepare a double-stained tube. This will be used for collecting germ cell subpopulations. Add 2.5 µL of Hoechst and 1 µL of PI to the last tube.\n\tNOTE: Hoechst has a shelf-life of 2-3 months. Using older stocks of dye will cause significant alterations during FACS session.\nIncubate at room temperature for 30 min in the dark. Place samples in a tube rotator or invert the 1.5 mL tubes every 5-10 minutes.",
    "Filter cell suspension with a pre-wetted 40 µm strainer and keep the filtered solution on ice and in the dark until the FACS session.\n\tNOTE: The filtration step is necessary for preventing cell clumps for FACS. Additionally, treatment with DNase (see Figure 1) or 2-Naphthol-6,8-disulfonic acid dipotassium salt (NDA20) can be used to limit cell clumping. Prolonged waiting periods will affect the fluorescent signal detected during FACS and may result increased cell death.\n5. Fluorescence Activated Cell Sorting (FACS) Setup and Purification of Testicular Cells\nPrepare FACS collecting tubes.\nCoat 5 mL polypropylene round-bottom tubes or 1.5 mL tubes with 400 µL of FBS for cell collection. Decant excess FBS after coating.\nAdd FACS collecting medium (1x DMEM + 10% Fetal Bovine Serum, FBS) to the tubes: 1 mL for 5 mL tubes or 100 µL for 1.5 mL tubes.\nSet up appropriate sorting conditions in cell sorter and software.\n\tNOTE: Other cell sorting machines and analysis software can be used with the similar setup and gating strategies described below. The conditions described here were adapted from Gaysinskaya and Bortvin 2, Geisinger and Rodriguez-Casuriaga 3, and Getun, et al.4\nLoad an ultraviolet laser with 463/25 nm band pass filter to detect Hoechst blue and 680 nm LP band pass filter to detect Hoechst red and to detect PI.\nUse a 555DLP dichroic mirror to distinguish blue from red fluorescence.\nUse a 70 µm nozzle and sort cells at a rate of 1000-2000 cells/second.\n\t\tNOTE: Sorting efficiency is directly influenced by the flow rate. High flow rates (>3500 events/s) increase the speed of sorting but result in contamination of populations. See reference 12 for further information.\nSet gates using control samples.\nLoad and run unstained sample.",
    "Exclude cell debris based on FSC vs SSC plot pattern. Cell debris will pop up in lower left quadrant of the plot. Arbitrarily set the threshold for cell debris by the user or the cell sorter technician.\nGate on single cells by adjusting threshold for FSC and pulse width. Different cell sorters have different ways to distinguish singlets. As pulse width reflects the time cells take to cross the laser, single cells have lower values when compared to multicellular aggregates. Adjusting threshold on a plot for FSC vs pulse width can be used to select for singlets.\nSet optimal photomultiplier tube (PMT) voltages.\nUse both unstained and single-dye stained cells to establish the threshold of PI or Hoechst fluorescence signal.\n\t\tNOTE: It is important to optimize the baseline PTM voltages for the cells of interest in order to establish the proper fluorescence range for each dye. This is critical for optimal signal detection and sensitivity. The unstained and single stained control cells are used to establish a range of negatively and positively stained cells with PI and/or Hoechst dyes and minimize noise in signals. For further explanations on optimization of PMT voltage using control cells, please refer to Gaysinskaya and Bortvin 2\nGate on live cells based on PI staining (PI negative) and FSC plot. Dead cells will be positive for PI fluorescence.\nSet DNA content gate by plotting a histogram of cell counts based on Hoechst blue fluorescence. 3 peaks with increasing concentrations of Hoechst blue fluorescence should appear, representing haploid (1C), diploid (2C), and tetraploid (4C) cells. Set 3 gates, one for each peak.\nObserve at least 500,000 events on FSC vs SSC plot before proceeding to gating on germ cell populations.\nGate different germ cell populations.\nLoad Hoechst/PI stained sample.",
    "Set the first 3 parent gates that are common to all populations.\n\t\t\nExclude cell debris based on the FSC vs SSC plot. Select singlets based on the FSC vs pulse-width plot. Select live cells by gating PI negative cells.\nDefine spermatogonia gate.\nPlot PI negative cells based on Hoechst blue and red fluorescence intensities. Spermatogonia appear as a side population (See Figure 1).\nDefine gates for the remaining germ cell populations. NOTE: Refer to figure 1 and supplementary figure 2 for visual details.\nPlot PI negative cells in DNA content gate.\n\t\t\nFor spermatids gate the peak with lowest Hoechst fluorescence (1C).\nFor spermatocytes II, gate the peak with intermediate Hoechst fluorescence (2C).\nFor spermatocytes I, gate the peak with highest Hoechst fluorescence (4C).\nPlot Hoechst blue and red fluorescence intensity to refine spermatocytes and spermatids populations from DNA content gates.\nCollect the selected subpopulation gates into the collection tubes previously prepared. Each testis will take an average of 45 min to 1.5 h to collect approximately 0.5-6.0 x 106 cells for each subpopulation.\n\tNOTE: Prolonged cell exposure to Hoechst may slightly shift the location of populations with time. Refresh the settings after 20-30 min of FACS. Maximum yield for each subpopulation will be contingent on efficiency of dissociation step.\n6. Microscopic Evaluation of Purified Cells\nSpin collected cells at 500-600 x g at 4 °C for 10 min.\nRe-suspend cell pellet with 1 mL of ice cold 1x phosphate buffer solution (PBS) or 1x DMEM.\n\tNOTE: The re-suspension volume can be adjusted according to the number of cells sorted and the desired final concentration.\nPipette 40 µL of washed cells onto a clean glass slide and place a coverslip.\nFix the remaining cells with 4% paraformaldehyde (PFA) and store fixed cells at 4 °C in dark for future reference.",
    "Pipette 100 µL 4% PFA directly in the collection tubes.\nBriefly vortex the tubes or pipette few times to ensure well-mixing of the cell suspension.\nVisualize the prepared slides in a microscope equipped with a UV lamp to detect Hoechst fluorescence under a 63X objective. Refer to the Results section – Morphologic evaluation of sorted germ cell populations – for further details on how to identify specific germ cell types.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}