{
  "id": 17255,
  "origin_website": "Jove",
  "title": "Vacuum-Sealed Hot Water Bath Immersion for the Preparation of Anatomical and Surgical Cadaveric Bone Models",
  "procedures": [
    "Lumbar spines were harvested from 4-year-old Merino cross adult ewes (Ovis aries) following the ethical guidelines of the Animal Care and Ethics Committee of the Surgical and Orthopaedic Research Laboratories. Following the institutionally approved method of humane euthanasia, the lumbar spines were harvested using a sharp dissection tool, first incising through the skin and subcutaneous tissues, followed by fascia and musculature prior to disarticulation at the thoracolumbar and lumbosacral junctions. A harvested sample is shown in Figure 1A.\n1. Preparation for the initial bath\nManually remove soft tissue (muscle, connective tissue, fat, etc.) using a sharp dissection tool (number 22 scalpel blade) from the bone sample before processing further.\n\tNOTE: This step is optional; however, removing as much soft tissue as possible reduces the time the water bath takes to macerate the tissues. The specimen size (~20 cm x 10 cm x 8 cm) is also reduced; therefore, more samples can be fitted into the bath.\nSeal the sample in a heat-safe sealable plastic bag after removing the air. It is recommended to use a vacuum bag using a commercial vacuum-sealing device (see Table of Materials).\n\tNOTE: No additives are required for the initial 24 h bath. If there is significant muscle covering all surfaces of the bone and if there is already minimal soft tissue and most of the bone surfaces of the sample are exposed, proceed to step 3.2 (Figure 1B).\n2. Procedure for the initial bath\nCompletely submerge the sealed sample in a 70 °C water bath for 24 h.\nAfter 24 h, remove the bag from the bath, open the bag, and allow the sample to cool until handleable.\n3. Preparation for subsequent baths\nRemove as much soft tissue from the bone as possible using a sharp scalpel and running water as needed.",
    "Disarticulate any joints using a sharp scalpel to expose the cartilaginous tissue.\n\t\nKeep the disarticulated pieces in situ using material such as orthopedic wire or cable ties (see Table of Materials) to maintain the anatomical position.\nSeal the sample in a vacuum bag along with 10 mL of dishwashing detergent (see Table of Materials) and 10 mL of tap water.\n\t​NOTE: The volume of detergent depends on the strength, concentration, and size of the sample.\n4. Procedure for subsequent baths\nCompletely submerge the sealed sample in a 70 °C water bath for 24 h.\nAfter 24 h, remove the bag from the bath, open the bag, and allow the sample to cool until handleable.\n\t\nAvoid letting the sample cool completely, as this allows softened cartilage to harden and adhere to bone, becoming more difficult to remove.\n\t\t​NOTE: The time required for sample processing may vary based on size and type, and repeated removal of subsequent baths may be unnecessary. Additionally, the sample can remain in the bath for extended periods, which may aid in the interim removal of tissues.\nRemove as much soft tissue as possible using a sharp dissection tool (number 22 scalpel blade on a dedicated scalpel handle) and running water.\nRepeat step 4 as required until the bone is free of soft tissue material. In our experience, this was required to be repeated only once.\n5. Completion of the procedure\nWash the sample with liquid detergent and rinse thoroughly with water.\n\tNOTE: Alcohol may be used to speed drying.\nAllow the sample to dry for approximately 48 h.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}