{
  "id": 7444,
  "origin_website": "Bio",
  "title": "Immunoprecipitation for Protein-Protein Interactions and for RNA Enrichment in <em>Drosophila melanogaster</em>",
  "procedures": [
    "The UAS-GAL4 system (Brand and Perrimon, 1993) allows a targeted tissue specific gene expression by crossing a GAL4-driver stock with a transgenic fly harboring your RBP protein of interest under the control of UAS activating sequences. Protein expression can be targeted to several tissues and animal compartments using different drivers such as GMR-GAL4 or Elav-GAL4, allowing the easy collection of the tissues of interest. In the design of these experiments, it is highly recommended to include a control progeny expressing an unrelated protein (e.g., UAS-GFP).Collection of headsSelect flies at the stereoscope under anesthesia [exposure to carbon dioxide (CO2)].Transfer 20 anesthetized flies at the time into an empty 1.5 ml tube.Immediately flash freeze the tube in liquid nitrogen.Vortex the tube for 10 seconds at maximum potency.Pour the contents of the tube on a glass Petri dish laid on ice.Collect the heads with a tweezer and transfer them into a 1.5 ml tube filled with the appropriate lysis buffer.During the collection, keep the tubes in ice.Note: The progeny required for an immunoprecipitation experiment is approximately 100 flies. For this reason, flies can be accumulated and stored at -80°C after flash freezing in liquid nitrogen. Aliquots of 20 flies per tube are the best solution to allow easy detachment of the heads by vortexing at the moment of collection. Preparation of beadsFor each immunoprecipitation sample, 50 μl of bead slurry must be used (approximately 1.5 mg beads). Mix the beads thoroughly by repeated inversion before use.Transfer the total beads slurry in a single 2 ml tube.Wash the beads twice with 2 ml of 0.02% Tween 20-PBS, using the magnetic stand to collect the beads and allow buffer changes.Dilute the primary antibody (a-Flag-M2 in this example) at a final concentration of 2-5 mg/ml in 0.",
    "02% Tween 20-PBS, add it to the washed beads, and incubate at room temperature (RT) for a minimum of 10 min on the rotator, to allow coating of the beads.After the incubation, aliquot the antibody-coated beads in new 1.5 ml tubes (one for each sample).Discard the buffer with primary antibody just before adding the solution with the homogenized tissue.Protein-mRNA co-immunoprecipitationPile up 100 Drosophila heads in a 1.5 ml tube filled with 200 μl of Protein-mRNA lysis buffer.Manually squeeze heads with a pestle for 2 min (work on ice).Transfer the lysate into a dounce (pre wet with lysate buffer).Collect all the homogenate by adding 500 μl of fresh lysate buffer to the 1.5 ml tube, subsequently add it to the dounce, and proceed to homogenization with 60 strokes.Mechanically squeeze for another 2 min (work on ice).Transfer the approximately 700 μl to a clean 1.5 ml tube.Centrifuge the tubes at 500 × g for 5 min at 4°C.Collect approximately 600 μl of lysate by avoiding debris, and transfer it to a new clean tube.Add heparin to the lysate to a final concentration of 5 μg/ml.Remove 100 μl of lysate and store it as input material (50 μl for protein analysis and 50 μl for RNA extraction). The 50 μl aliquot for protein analysis can be directly stored at -80°C, while 600 μl of Trizol reagent, for RNA extraction, must be added to the 50 μl aliquot before its storage at -80°C.Transfer the remaining 500 μl lysate into the 1.5 ml tube containing the antibody-coated beads for immunoprecipitation.Incubate the tubes on a circular rotator for 30 min at 4°C.After incubation, immobilize the beads on the magnet, and recover 100 μl of each supernatant as \"depleted material\" (50 μl for protein analysis and 50 μl for RNA extraction).",
    "The 50 μl for protein analysis can be stored at -80°C, while 600 μl of Trizol reagent must be added at the 50 μl for RNA extraction before its storage at -80°C.Remove and discard the remaining supernatant, always keeping the tubes anchored to the magnet to preserve the beads while removing the supernatant.Wash the beads with 1 ml of washing buffer: add the buffer, transfer the beads to the rotator for 10 min, anchor the tube to the magnet, and remove the washing buffer. Repeat five times, keeping the buffer on ice and the rotator at 4°C.At the end of the fifth wash, before attaching the tubes to the magnet, transfer 100 μl of the beads in solution to a new tube for protein analysis, and place the remaining 900 μl of the beads in solution in a fresh tube for RNA extraction.Immobilize the beads and discard the liquid.Add 50 μl of 1× Laemmli buffer to the tube designated for protein extraction, boil the tube at 95°C for 5 min, immediately transfer to the magnet, and collect the supernatant.Attach the tube designated for RNA analysis to the magnet, remove the supernatant, and add 600 μl of Trizol to the tube. Leave the tube on the rotator for 5 min at RT, and then collect the supernatant, leaving the beads in the tube (use the magnet).These materials can be stored at -80°C at this step.Protein-protein co-immunoprecipitationCollect 100 heads in a 1.5 ml tube filled with 100 μl of Protein-protein lysis buffer.Manually squeeze heads with a pestle for 2 min working on ice.Transfer the lysate into the dounce (pre-wet with lysate buffer), wash the 1.5 ml tube with a further 400 μl of buffer and add it to the lysate in the dounce. Proceed with homogenization with 60 strokes.",
    "Collect the homogenate, transfer it into a new 1.5 ml tube, wash the dounce with 500 μl of fresh Protein-protein lysis buffer, and subsequently add it to the lysate.Centrifuge the lysate at 500 × g for 5 min at 4°C, and collect the supernatant avoiding the pellet.Add 100 μl of fresh Protein-protein lysis buffer to the pellet, wash it, and repeat the centrifugation step as previously. Avoiding the pellet, add this supernatant to the lysate already collected, to a final lysate volume of approximately 1 ml.Take a 100 μl aliquot of the lysate. Use 20 μl of this to proceed with the evaluation of the protein content in the lysate. To the remaining 80 μl of lysate add 20 μl of 5× Laemmli Sample buffer, denature at 95°C for 5 min, and store at -80°C as \"Input\" for SDS-PAGE analysis.An equal amount of protein must be used for the immunoprecipitation of your samples of interest and your controls, so add to a new 1.5 ml tube a volume that corresponds to an amount of protein of approximately 1-1.4 mg. Add the protein-protein lysis buffer for equal volumes among samples.Transfer lysates to tubes with the immune-coated beads and proceed to immunoprecipitation on the rotator at 4°C for 30-60 min.After incubation, transfer the lysate and beads to a new 1.5 ml tube, anchor the tube to the magnet, and recover 80 μl of supernatant (\"depleted material\"). To this, add 20 μl of 5× Laemmli Sample buffer, denature at 95°C for 5 min, and store -80°C for the following SDS-PAGE.Always keeping the tubes anchored to the magnet, remove and discard the remaining supernatant.Detach the tubes from the magnet, add 1 ml of iced Protein-protein Lysis buffer to the beads, and transfer them to a new 1.5 ml tube.",
    "Leave this on the rotator for 10 min at 4°C, then anchor the tubes to the magnet and remove the washing buffer. Repeat to a total of five washes.At the end of the fifth wash, transfer the beads to a new tube before removing the last wash, then anchor the tube to the magnet, completely remove the liquid while avoiding contact with the beads, add 80 μl of Protein-protein Lysis buffer and 20 μl of 5× Laemmli Sample buffer, transfer to 95 °C for 5 min, then immediately anchor to the magnet and collect the eluate. Store at -80°C for further SDS-PAGE analysis.Immunoprecipitation validationNote: To confirm the immunoprecipitation, it is a good practice to run a western blot and verify the presence of your protein of interest in the immunoprecipitated sample. If possible, the best is to perform the western with another antibody that recognizes a different epitope of the immunoprecipitated protein. Run an SDS-PAGE following the instructions of the pre-cast gel supplier. All the samples collected during the immunoprecipitation procedure: Input (IN), depleted material (DEP), and immunoprecipitated material (IP) must be run on the same gel.Proceed to western blot, as usual; incubate your membrane with primary antibody, perform washes, and subsequently incubate with the secondary antibody.Develop the immunoblot following your usual protocols.If a good immunoprecipitation occurred, loading an equal volume of the IN and DEP material, the signal corresponding to your immunoprecipitated target must be reduced in the DEP fraction if compared to the IN fraction.The signal of your immunoprecipitated target must be enriched in the IP fraction compared to the mock. In Figure 1, an example of western blot validation is presented.If any problem occurred, see Table 1. It summarizes the most common problems that can occur, with their respective solutions.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4250/bioprotoc-11-23-4250-g001.jpgFigure 1. SDS-PAGE IP validation.",
    "On the left, western blot analysis of immunoprecipitation with anti FlagM2 from D. melanogaster adult heads: lanes 1, 2, and 3 w1118 (mock- no flag); lanes 4, 5, and 6 elav-GAL4>UAS-unrelated protein (flagged); lanes 7, 8, and 9 elav-GAL4>UAS-TBPHF/L (mutated and flagged); lanes 10, 11, and 12 elav-GAL4>UAS-TBPH (flagged). Respectively, lanes 1, 4, 7, and 10 represent the input fraction (IN), lanes 2, 5, 8, and 11 the depleted fraction (DE), and lanes 3, 6, 9, and 12 the immunoprecipitated fraction (IP); lane 13 is a positive control for the antibody (+). The immunoprecipitation is performed using the anti-FlagM2 antibody, while the immunoblot is developed using an anti-TBPH antibody. The Ponceau of the membrane was used as the loading control. On the right panel, a column graph quantifies the experiment. Results of IN and DE fractions were normalized to the input of each strain, and the IP fraction was normalized to the TBPH strain.Co-immunoprecipitation controls Controls are extremely important in immunoprecipitation experiments, and both negative and positive ones are required.The ones listed below can be used as negative controls for the experiment:A mock control (Figure 1, lanes 1, 2, 3);An unrelated protein tagged with the same flag (Figure 1, lanes 4, 5, 6);The protein of interest harboring a mutation that impaired its RNA binding or protein-protein interactions (Figure 1, lanes 7, 8, 9).As positive controls for the experiment, if available, an already known target must be confirmed.RNA extraction Transfer IN, DEP, and IP samples, stored at -80°C in 600 μl of Trizol reagent to ice.Once thawed, add 120 μl of chloroform (CHCl3) to each tube, and mix thoroughly for 5 s.Incubate at RT for 5 min.Centrifuge at 12,000 × g for 15 min at 4°C.Recover the transparent aqueous phase (~300 μl) and transfer it to a clean 1.",
    "5 ml tube.Add 1 volume of isopropanol (~300 μl) and glycogen to a final concentration of 0.2 μg/ulMildly invert the tubes five times.To increase yield, leave overnight at -80°C.Centrifuge at 12,000 × g for 30-45 min at 4°C.Discard the supernatant, keeping the pellet.Wash the pellet with 1 ml of 75% ethanol.Centrifuge at 12,000 × g for 5 min at 4°C, and remove the supernatant.Repeat the wash.Centrifuge at 12,000 × g for 5 min at 4°C. Completely remove the supernatant.Resuspend the pellet in 30 μl of RNase-free water.Store the RNA at -80°C.RT-qPCR Retrotranscribe 1 μg of RNA into cDNA by using Superscript Vilo Master Mix.Dilute the cDNA 1:10 in water.Samples are ready for qPCR with your primers of interest (see Materials and Reagents for primers sequences and references).For the quantitative PCR, use 2 μl of diluted cDNA with the iQ-Sybr Green Supermix.The quantitative PCR conditions are: 1 cycle at 95°C for 3 min; 40 cycles at 95°C for 10 s, and at 60°C for 30 s.Figure 2 shows an example of the outcome (from        Romano et al., 2020):imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4250/bioprotoc-11-23-4250-g002.jpgFigure 2. RT-qPCR analysis of mRNAs immunoprecipitated by Flag-M2-tagged TBPH (Elav>TBPH) and its mutant variants TBPH-F/L (Elav>TBPHF/L) in D. melanogaster adult heads.  The dicer-2 and syntaxin enrichment folds were referred to rpl11 (housekeeping) (adapted from        Romano et al., 2020).Protein analysis IN, DEP, and IP samples, all in 1× Laemmli loading dye, stored at -80°C, after a 5 min step of denaturation at 95°C, may be run in precast SDS-PAGE gel upon manufacturer instructions.After SDS-PAGE, proceed with western blot following your usual protocol. For further information on this sub-protocol, see Romano et al. (2014, 2018, 2020).",
    "Immunoblot must be performed against your immunoprecipitated protein (possibly with an antibody against a different protein epitope) to confirm immunoprecipitation, and with an antibody against your protein of interest, to verify possible interactions."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}