{
  "id": 18727,
  "origin_website": "Jove",
  "title": "A Possible Zebrafish Model of Polycystic Kidney Disease: Knockdown of wnt5a Causes Cysts in Zebrafish Kidneys",
  "procedures": [
    "NOTE: Ethics Statement: All zebrafish experiments were approved by the Institutional Animal Care and Use Committee at the Eastern Virginia Medical School.\n1. Morpholino Preparation\nDesign and synthesize translation-blocking (AUG-) and splice-inhibiting (Splice-) anti-sense morpholino (MO) oligonucleotides for the gene of interest as per manufacturer’s instructions (Figure 1A). Please see manufacturer’s information in Table 1.\n\tNOTE: MOs are shipped as lyophilized stocks in glass bottles.\nAdd high-grade sterile water to the glass bottles to re-suspend MOs to a final concentration of 25 μg/μl. Make sure that the oligonucleotide is completely dissolved. If some solid remains, heat the vial containing the stock oligonucleotide solution at 65 °C for 5 to 10 min and vortex briefly.\nStore the MO stock solution at RT. Do not store them at 4 °C or -20 °C because lower temperatures could cause the MO oligonucleotide to bind to the container wall. Measure the concentration of the stock solution using a spectrophotometer (please refer to Table1) each time a new MO stock solution is made.\nPrepare the MO working solution on the day of injection by diluting the stock solution with high-grade sterile water to the desired dose. Add 0.5% phenol-red to reach a concentration of 0.05%. For example, to make 5 μl working solution with a concentration of 15 ng/nL, add 3 μl MO stock solution and 0.5 μl 0.5% phenol-red to 1.5 μl of water.\n\tNOTE: With this working concentration, each drop (500 pl) of injection contains 7.5 ng of MO and two drops contain 15 ng of MO.\n2. Preparation of the Injection Apparatus\nPurchase glass pre-pulled needles (please see Table 1 for detailed information). Alternatively, pull the glass injection needle with a needle puller.",
    "Turn on the air compressor and adjust the pressure setting to 50 psi. Turn on the dissecting microscope light source and Pico micro-injection pump and adjust the settings as follows: hold pressure 20 psi, eject pressure 10 psi, period value of 2.5 and 100 μsec range of gating.\nLoad the glass pre-pulled needle with 5 μl of the injection solution and place the needle in a vertical position with the tip pointing down. Wait until all the solution reaches the needle tip with no visible air bubbles. Place the needle holder in an appropriate position next to the microscope and insert the glass needle into the holder. Adjust the injection angle to 45 degrees.\nBring the needle tip into view under the microscope, high off the stage, and focus on the thinnest region of the tip. Break off the needle tip with fine point tweezers.\nPlace a ruler and a capillary tube with inner diameter of 0.15 mm side by side under the microscope; inject the solution into one end of the capillary tube to make a liquid column. Adjust the eject time to reach every 17 drops per 1 mm length liquid column, then the volume of every drop is 1 nl (drop volume = π x radius2 x length (of liquid column) / count (of drops).\n\tNOTE: A drop with a diameter of 0.1 mm gives a injection volume of about 500 pl (drop volume = 4/3 x π x radius3).\n3. Preparation of Fertilized Zebrafish Embryos and Injection with Morpholinos",
    "Set up Tg(wt1b:GFP) transgenic zebrafish breeding pairs according to published protocols for standard zebrafish husbandry and maintenance. Collect embryos after natural spawn, and keep them in a 10 cm Petri dish filled with E3 water (5mM NaCl, 0.17mM KCl, 0.33 mM CaCl2, 0.33 mM MgSO4). Start MO injection right away 13. Monitor embryo morphology under the microscope and make sure MO injection is at the one-cell stage, or no later than the four-cell stage.\n\t\nTransfer the embryos to a 10 cm petri dish with wedge-shaped agar troughs. Aspirate the extra E3 water and gently press the embryos into the troughs.\nManipulate the embryos with the micropipette to visualize 1-cell stage embryos under the dissecting microscope. Penetrate the chorion and then the yolk to inject one or two drops of MO into the yolk (1 drop = 500 pl). Transfer the injected embryos to a 10 cm petri dish with E3 water and incubate at 28.5 °C.\nAfter the injections, remove the dead embryos and record the number of injected embryos. Replace the E3 water in the dish every 24 to 48 hr.\n4. Phenotype Rescue Experiments\nSelect an orthologue from another species that has a different primary base pair structure (usually 3-7 base pair mismatches) and is, therefore, resistant to the MO, for rescue. For example, in this experiment, we chose mouse because the mouse Wnt5a mRNA sequence is different from the zebrafish sequence.",
    "Design a primer set with the forward primer starting at the translational site and the reverse primer at close to the end of the mRNA coding region. Add a T7 promoter sequence at the 5’- end of the forward primer sequence. In this experiment, we used the following the primer sequences; forward: 5’- taa tac gac tca cta tag gga cta tga tgc tgc tga agc tga a- 3’ and reverse: 5’- tca ctt gca gac gta ctg gtc- 3’.\nPerform a 50 μl Polymerase Chain Reaction (PCR) with the primer set (0.5 μM of each primer) designed above and 0.1 μg template DNA containing the mouse Wnt5a cDNA sequence with the following PCR program: 1 cycle at 95 °C for 5 min; 35 cycles of 95 °C (30 sec), 58.5 °C (30 sec), 72 °C (1 min); and final extension step at 72 °C for 7 min.\nAfter finishing the cycle, run 2 μl of the PCR product on 1% agarose gel to make sure the band is the right size. Purify the PCR product with a PCR purification kit according to manufacturer’s instructions. Check DNA concentration with a spectrophotometer. Store the purified PCR product at -20 °C or directly use in capped RNA transcription in the next step.\nSynthesize in vitro capped mRNA with a capped RNA synthesis kit according to the manufacturer’s instructions. Dilute the mRNA in 20 μl RNase free water and determine the concentration. Aliquot the RNA and store at -80 °C.",
    "On the day of injection, prepare a working solution of the mRNA with RNase free sterile water. Note that 40 pg is generally the highest RNA dose at which nonspecific or toxic effects of the RNA do not occur. Keep the working solution on ice. Inject the embryo with MO and then the rescue mRNA, or co-inject both together. For example, if the concentration of the mRNA prepared in step 4.5 is 0.6 μg/μl, add 0.67 μl of mRNA (0.4 μg) to 4.33 μl of RNase free water to make a final concentration of 0.08 μg/μl, then one drop (500 pl) of each injection contains 40 pg of mRNA. Prepare MO as described in step 3.\n5. Preparation of Injected Embryos for Fluorescent Imaging\nAfter incubation at 28.5 °C O/N, add 0.003% N-Phenylthiourea (PTU) to the E3 water to prevent melanization, which affects observation of pronephros structure using fluorescence microscopy. However, do not add PTU before gastrulation, because it affects early embryonic development.\nAt 48 hpf, manually dechorionate the embryos with fine tweezers. Take images of 48 and 72 hpf embryos under a light dissection microscope.\n\tNOTE: These pictures can be taken without anesthesia.\nApproximately 10 min prior to imaging under the fluorescence microscope, anesthetize the embryos by placing them into a 10 cm petri dish containing 160 μg/ml buffered Tricaine. Wait for 5-10 min, and then lightly touch the zebrafish to confirm that they do not move and therefore the anesthesia is working.\nAfter the embryos are anesthetized, mount them in 3% methyl cellulose and orient them in a prone position under a dissecting microscope (please refer to Table 1).\nObserve the pronephros structure under a fluorescence microscope (please refer to Table 1) and take pictures at different magnifications (10X and 20X).",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}