{
  "id": 3155,
  "origin_website": "Cell",
  "title": "Generation of liver mesenchyme and ductal cell organoid co-culture using cell self-aggregation and droplet microfluidics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of liver mesenchyme and ductal cells\nTiming: 5–6 h\nIsolation of the primary cells from the liver tissue using mechanical disruption and enzymatic digestion. This step produces a single cell suspension of various liver cells (adapted from ref. 6[href=https://www.wicell.org#bib6]).\nEuthanize the mice and dissect the liver; all standard euthanasia methods yield similar results for isolation.\nWash the livers several times to remove as much blood as possible; stop when PBS is mostly clear.\nNote: No gentle washing necessary – vigorous washing is allowed at this step.\nTransfer livers to a petri dish, remove gallbladder and any peritoneal fat or non-liver pieces of tissue.\nRemove all PBS or transfer to a new petri dish without PBS and chop the liver into pieces with scissors or with 1 razor blade; make sure pieces are very small (∼ 1–2 mm length and width).\nTransfer the pieces to a new tube containing 10 mL of PBS.\nLet the pieces settle down by gravity or, alternatively, spin at 120 Relative Centrifugal Force (RCF)/2 min. Discard the supernatant to remove as much blood as possible.\nWash the pellet with 40 mL of PBS by inverting the tube several times\nRepeat step 2.\nAdd 10 mL of collagenase/dispase media mix (top up to approx. 12.5 mL, adjust it to the tissue pellet size). In that step the addition of DNAse is optional.\nIncubate 10 min at 37°C in a water bath.\nPipette up and down with 10 mL serological pipette.\nSpin at 120 RCF/5 min and discard the supernatant to remove as many blood cells as possible.\nResuspend in 25 mL of collagenase/dispase media mix supplemented with DNAse.\nIncubate 90 min at 37°C in a horizontal shaker at 130 RPM.",
    "Check digestion under a brightfield microscope; some ducts and some parenchyma should be present in the mixture.\nCritical: In contrast to ductal isolation from previous publication,6[href=https://www.wicell.org#bib6] make sure isolated ducts have some parenchyma present on them and do not appear completely cleared of parenchyma (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig2.jpg\nFigure 2. Example of digested ducts\n(A–C) (A) Under-digested ducts (arrowheads) – a lot of parenchyma is still present; (B) Correctly digested ducts (arrows) – some parenchyma is still present, preserving the ductal-mesenchymal connection but other clear ducts are also present; (C) Over-digested ducts (arrowheads) – no mesenchyme or parenchyma present on the ducts – this can decrease the mesenchymal yield, as they are already detached into the solution and directly exposed to the digestion mix as single cells. Scale bar, 500 μm.\nTake off ∼15 mL of the supernatant after the remaining pieces of tissue settle on the bottom and proceed to step 19.\nWith the reminder of tissue suspension repeat from step 7 as follows;\nPipette up and down with 10 mL serological pipette\nSpin at 120 RCF/5 min and remove the supernatant.\nResuspend in 25 mL of collagenase/dispase media solution supplemented with DNAse.\nIncubate 90 min at 37°C shaker horizontally with 130 RPM.\nCheck digestion under a brightfield microscope; ducts and some parenchyma should be present in the mixture (Figure 2[href=https://www.wicell.org#fig2]).\nNote: Ducts are branched structures, which become visible upon tissue digestion (Figure 2[href=https://www.wicell.org#fig2]A - ducts under-digested, the parenchyma appears around giving the ducts rough edges and ball-like appearance Figure 2[href=https://www.wicell.org#fig2]C – over-digestion, ducts without any parenchyma). To enrich for the portal mesenchyme around the ducts, digest the tissue as shown in Figure 2[href=https://www.wicell.org#fig2]B – where ducts appear mostly smooth-edged, but still retaining some of the parenchyma that contains the portal mesenchyme.",
    "Spin at 200 RCF/5 min and remove the supernatant.\nWash pellet with 40 mL of Advanced DMEM/F12+++ media.\nSpin at 200 RCF /5 min and remove the supernatant.\nResuspend in 5 mL 5×TrypLE with glass Pasteur pipette (make up 5×TrypLE by mixing 1×TrypLE with 10×TrypLE in 1:1 ratio).\nIncubate 10 min at 37°C in a water bath.\nIn the meantime, prepare the pre-conjugated antibodies for flow cytometry sorting.\nNote: The sorting described below was performed on different instruments, namely MoFlo Legacy, Astrios (Beckman Coulter), BD FACSAria (BD Biosciences) or SH800S (SONY) cell sorters. For these instruments, we recommend the following color combinations: Super Bright 436, GFP, APC, PE-Cy7, or similar fluorophores. The use of more colors is possible, but depending on the FACS sorter machine availability. PE can easily be included in this color combination, for e.g. as a dead cell dye.\nNote: In case of cross talk between PE and PE-Cy7 fluorophore (instrument-dependent), we recommend the Brilliant Violet 650 conjugates to the same monoclonal antibodies (excitation: laser line 405 nm, emission: similar to PE-Cy7).\nResuspend cells again with glass Pasteur pipette.\nCheck for the presence of single cell suspension under a brightfield microscope; if 80% of the cells are not single cells repeat step 23 until a single cell suspension where > 80% of cells are single cells is obtained.\nAdd 5 mL of 1% FBS DMEM media.\nPass the mix through 40 μm strainer.\nPass the mix again through a new 40 μm strainer. At this step the estimated total cell yield is variable between 10–80 million cells, with above 90% of viability.\nTop up with 40 mL of 1% FBS DMEM media.\nSpin at 500 RCF/3 min and discard the supernatant.",
    "Resuspend the cell pellet in 1 mL of 2% FBS DMEM media or relevant amount of blocking solution.\nProceed to step 34 for sorting.\nNote: The addition of DNAse in step 9 and step 16 vastly improves FACS cell sorting as the presence of DNA fragments keeps cells attached during sorting, which can clog the instrument nozzle and reduces the yield of single cells.\nFlow cytometric sorting of liver portal mesenchyme and ductal cells\nTiming: 2 h\nIsolation of desired cell populations (mesenchyme, ductal cells) from the single cell heterogeneous preparation of the liver. The purified cell populations can be used for further experiments directly, or expanded in culture.\nAdd 4 mL of 2% FBS DMEM and transfer to FACS-tubes (e.g., polypropylene 5 mL tube). Incubate cells on ice for 10 min (blocking step).\nTake out samples for staining controls: 100 μL sample.\nCentrifuge samples 500 RCF/3 min and remove the supernatant.\nResuspend cell pellet in 1.5 mL antibody solution and incubate for 30 min on ice.\nFor staining control add 1 μL of each relevant antibody to previously taken 100 μL sample cell suspension aliquots, and incubate for 30 min on ice.\nSpin at 500 RCF / 3min, discard the supernatant and wash the pellet with 4 mL 1% FBS DMEM media.\nSpin at 500 RCF/3 min, remove the supernatant and resuspend in 1 mL 1% FBS DMEM media (controls with 350 μL); if needed alter this volume depending on the sorter capacity for cell density as well as the size of your cell pellet.\nGo to the FACS sorter (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig3.jpg\nFigure 3. Flow cytometry cell sorting and gating",
    "(A–D) (A) Gating on liver cells – the liver prep has a lot of cell debris, which should be excluded with this gate; (B) Gating on single cells; (C) Gating on ductal cells (gate 1) and stromal cells (gate 2, excluding EpCAM positives and blood/immune positives); (D) From gate 2, gating on PDGFRα-GFP+ and SCA1+ (gate 4) or SCA1- (gate 3) mesenchyme.\nAt the sorter, gate first on the cells of interest using side-scatter and forward-scatter height plot; try to remove as much debris as possible, which appears as a bright cloud shown in red in Figure 3[href=https://www.wicell.org#fig3]A. There is a lot of debris in this type of liver digestion.\nRemove cell doublets by gating as shown in Figure 3[href=https://www.wicell.org#fig3]B, using a forward-scatter area vs. height plot.\nGate on PECy7 negatives (this step removes any remaining blood, immune and endothelium fractions) and APC-EpCAM negatives (this step removes liver ductal cells) – the double negatives are shown in Figure 3[href=https://www.wicell.org#fig3]C.\nWhen sorting ductal cells from the same preparation, gate and sort the EpCAM+ cells (Figure 3[href=https://www.wicell.org#fig3]C, gate 1). At this step, a typical expected yield is 50 000–100 000 ductal cells/liver, with >90% viability.\nGate on SCA1-SB436+ and PDGFRα-GFP+ double positives (you can also include SCA1- if needed), as shown in Figure 3[href=https://www.wicell.org#fig3]D.\nCollect cells in 300 μL of Advanced DMEM/ F12 +++ media. At this step, a typical expected yield is 10 000–40 000 SCA1+ PDGFRα-GFP+ mesenchymal cells/liver, with >90% viability.\nAfter sorting, spin cells at 500 RCF/5 min.\nResuspend cells in 200 μL of MM and plate in 1 well of 96 well tissue culture-treated plates at a ratio of up to 10 000 cells/well. Proceed to step 50 for culturing.\nNote: If the PDGFRα-H2B-GFP mouse model is not available, antibody staining against murine PDGFRα protein is possible.",
    "Note: Here, gating on EpCAM positives allows isolation of the ductal cells as well using the same antibody staining strategy.\nNote: Certain FACS-sorting machines have issues with crosstalk between PE (tdTomato channel) and PE-Cy7, as the PE-Cy7 composite fluorophore also has a small emission peak at the spectral height of PE; additionally, PE-Cy7 can be degraded and therefore provide additional fluorescence confounding signal of PE; to avoid this, we recommend the Brilliant Violet 650 conjugates to the same monoclonal antibodies (excitation: laser line 405 nm, emission: similar to PE-Cy7).\nCritical: The 96-well plate has to be tissue culture treated for attaching cells, e.g. flat bottom Nunclon Delta-Treated plates from ThermoFisher.\nLiver mesenchyme in vitro culture\nTiming: 2 weeks\nExpansion and passaging of liver portal fibroblast population in standard cell culture on plastic dishes.\nNote: We do not recommend passaging mesenchymal cells described here for more than 2 passages, as we observed change in appearance (Figures 4[href=https://www.wicell.org#fig4]A and 4B, passage 3 – more spread cells) as well as an increase in the expression of activated fibroblast marker αSMA, as noted in our previous manuscript (see ref. 1[href=https://www.wicell.org#bib1] Figure S4F).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig4.jpg\nFigure 4. Portal Mesenchyme culture in 2D\nNote the change in cell morphology between passages. (A) Representative images of isolated PDGFRα-GFP+ / SCA1+ mesenchymal cells after FACS sorting (brightfield), at passage 1 and at passage 3 (phase-contrast). Scale bar, 100 μm or 200 μm. (B) Representative images of mesenchymal cells at passage 1 and passage 3, grown on plastic in MM medium. Phase-contrast (gray) and PDGFRα-GFP expression (green). Scale bar, 100 μm. For more pictures of mesenchyme passages, refer to Figure S4D in ref. 1[href=https://www.wicell.org#bib1]\nExpand sorted mesenchymal cells (PDGFRα+ SCA1+) up to passage 2 (Figure 4[href=https://www.wicell.org#fig4]).",
    "After sorting and plating the cells in the adequate tissue culture plate incubate at 37°C 5% CO2; do not change media for at least 3 days – these cells need some time to attach.\nChange media every 3–4 days.\nSplit cells when 80%–90% confluent, up to 1:4 ratio.\nTo split, wash the well once or twice with sterile PBS and aspirate.\nAdd 200 μL of pre-warmed 1×TrypLE (for a 48-well plate, scale up or down proportionally).\nIncubate for 5 min at 37°C 5% CO2 in the incubator.\nAfter 5 min check the cells under a brightfield microscope, they should have started rounding and detaching.\nPipette the cells up and down with the p200 pipette (using the same 200 μL of TrypLE) to finish detaching the cells from the plate.\nTransfer cell suspension into a 15 mL falcon containing 10 mL of 1% FBS DMEM media.\nWash the well once with 200 μL of 1% FBS DMEM to remove any remaining detached cells and add them to the falcon tube.\nSpin at 300 RCF/5 min and remove the supernatant.\nResuspend in MM media.\nUse minimal media volumes per plate: 96-wells -200 μL, 48-wells – 300 μL, 24 wells – 500 μL.\nFor further media changes use MM media.\nMatrigel 2D layer co-culture of liver mesenchyme and ductal progenitor cells\nTiming: 1 h\nCo-culture method description, which allows combination of liver mesenchyme and ductal organoids in a layer of Matrigel. This co-culture model allows for direct control of respective number of cell-cell contacts, which scale proportionally to the number of cells added (i.e., the cell-cell ratio).\nCritical: Matrigel will solidify at 19°C–25°C, so work quickly and keep the basement matrix cold throughout the process.",
    "Note: In the classic matrigel dome 3D culture, the 2 cell types co-cultured together segregate, with the mesenchymal cells preferentially attaching to the plate bottom and the ductal cells forming ductal organoids without any mesenchymal contact. For more information, please refer to Figure S4M in ref. 1[href=https://www.wicell.org#bib1].\nNote: The expanded mesenchyme can be used up to passage 2, and ductal organoids until passage 10. Later passages of both cell types have successfully been used to make co-cultures, but we do not recommend this for the mesenchyme, as it shows signs of fibroblast-like activation in prolonged culture.\nNote: For simplicity, in this manuscript we present an experiment where the number of ratios tested ranges from 0.1:1 to 1:1. However, the ratio number can be changed to any desired ratio just by adjusting the ratio of both populations. For more co-culture ratios, refer to Figure 6 and Figure S6 in ref. 1[href=https://www.wicell.org#bib1].\nUse expanded or sorted cells from steps 50 or 48, respectively.\nDissociate mesenchyme to single cells, following protocol as for splitting (step 53).\nCollect ductal cell organoids grown from sorted cells in step 45 and passaged in a 3D Matrigel dome overlayed with expansion media (EM) (for more detail refer to6[href=https://www.wicell.org#bib6]) by scraping their culture Matrigel bubble with p1000 pipette tip and placing it in 2 mL of Advanced DMEM /F12 +++ media in a 15 mL falcon tube.\nPipette the media up and down with p1000 or a narrowed glass Pasteur pipette.\nTop up with Advanced DMEM/ F12 +++ media to 10 mL and spin at 200 RCF/5 min and remove the supernatant.\nResuspend the cells in 100 μL of Advanced DMEM/ F12 +++ media (adjust depending on the pellet size).",
    "Dissociate ductal cell organoids to single cells by incubating them 5–10 min with 1 mL of pre-warmed 1×TrypLE at 37°C.\nTop up with Advanced DMEM/ F12 +++ media to 10 mL and spin at 500 RCF/5 min and remove the supernatant.\nResuspend the cells in 100–500 μL of media (adjust depending on the pellet size).\nCount single cell solution cell density for both cell types.\nThe expected number of ductal and mesenchymal cells depends on their passage number. Ductal cells have the capacity to expand long-term, therefore increasing the number of passages will yield the desired number. On average, 1 confluent well of a 24 well plate yields 50 000–100 000 cells. Mesenchymal cells have less expansion capacity, which decreases with increasing passages. On average 1 confluent well of a 24 well plate yields 20 000–25 000 cells.\nMix selected number of cells, always adjusting the mesenchyme ratio to 5000 ductal cells, in a test tube.\nFor e.g., for 1:1 ratio of the cells, use 5000 ductal cells and 5000 mesenchymal cells.\nMesenchyme to ductal cells can be mixed at any ratios, for e.g., 0:1, 0.1:1, 0.2:1, 0.5:1, 1:1, 2:1 and 5:1.\nAfter mixing, centrifuge cells at 300 RCF/5 min.\nBefore seeding of the Matrigel-layer co-cultures, coat the 96-well plate wells with 30 μL of 100% Matrigel during cell centrifugation step:\nPipette 30 μL of 100% Matrigel per well on 96-well plate (at 19°C–25°C).\nAllow Matrigel to pre-solidify for minimum of 5 and maximum of 10 min.\nResuspend the cells in 200 μL of media.\nSeed on top of a 2D-layer of semi-solidified Matrigel (100%) covering the bottom of a 96-well plate.\nMonitor the growth of the culture over the next 7–10 days (Figure 5[href=https://www.wicell.org#fig5]), changing the media every 3 days.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig5.jpg",
    "Figure 5. Co-culture of mesenchymal and ductal cells on a Matrigel layer\nRepresentative images of mesenchymal cells (Msc, green) cultured at different ratios with ductal cells (DC, magenta) (Msc:DC ratio); Top row: day 1; bottom row, day 5; expansion media (EM) control is shown for comparison to mesenchymal media (MM). For more co-culture ratios, refer to Figure 6 and Figure S6 in ref. 1[href=https://www.wicell.org#bib1] Scale bar, 100 μm.\nMicrofluidic co-encapsulation of liver mesenchyme and ductal cells\nTiming: 2 h\nSecond co-culture method description, which allows combination of liver mesenchyme and ductal organoids in an agarose microgels, and subsequent culture in a 3D matrigel dome. The advantage of using this co-culture method is the better recapitulation of the periportal tract in vitro, however this method does not allow for the control of respective cell numbers in the structure.\nPrepare a 3% low-melting agarose solution for microfluidic cell co-encapsulation.\nPrepare a 3% (weight/volume) agarose solution in a test tube by weighing e.g., 15 mg agarose for 500 μL PBS.\nTo dissolve the agarose, spread the measured-out agarose powder on tube’s walls and add an appropriate amount of PBS to ensure homogeneous distribution of the powder in PBS.\nMelt the agarose at 75°C in an orbital thermomixer for 30 min while shaking at 400 RPM.\nOnce agarose is melted, cool the agarose solution to 37°C in an orbital thermomixer.\nCritical: Low-melting agarose must be used for microfluidic cell encapsulation. Other agarose preparations will solidify when cooled to 37°C.\nCritical: Agarose must be kept in the thermomixer at 37°C. Cooling it outside of a thermomixer may cause it to cool too quickly, which might cause it to solidify.",
    "Alternatives: In this protocol SeaPrep® ultra-low melting agarose (LONZA, #50302) is used. However, a variety of different low-melting agarose products are available from different suppliers. If alternatives are being used, the resulting gels may have different biophysical properties.\nNote: The tubing recommended here fits with 1 mm inlets/outlets for the microfluidic device used in the “Before you begin” step 3a. If necessary, tubing diameter can be adjusted depending on the size of the biopsy needle used to generate the inlets and outlets.\nNote: The expanded mesenchyme can be used up to passage 2, and ductal organoids until passage 10. Later passages of both cell types have successfully been used to make co-cultures, but we do not recommend this especially for the mesenchyme, as it shows signs of fibroblast-like activation in prolonged culture.\nPause point: Agarose can be kept at 37°C for several hours. At this point the microfluidic rig can be set up and cells can be prepared for encapsulation.\nPrepare the oil + surfactant solution.\nUse HFE-7500 3M™ Novec™ (Fluorochem, # 051243) engineered fluid as the carrier oil phase.\nUse Pico-Surf1 surfactant (5%; Sphere Fluidics, #C022) in the above-mentioned carrier oil diluted to 0.3% to stabilize the agarose-in-oil emulsion during encapsulation.\nIf surfactant appears milky, filter it though a 0.22 μm filter.\nPrepare the oil (carrier phase) syringe.\nPrepare tubing long enough to reach from the syringe (pumps) to the chip.\nUse tweezers to attach the tubing to the needle.\nFill the oil syringe (2.5 mL, Luer lock glass syringe) with the oil+surfactant solution (step 85: 0.3% Pico-Surf1 in HFE-7500 3M™ Novec™).\nAttach the tubing and needle to the syringe and push the air out, so that the whole tubing is filled with oil.",
    "Place the syringe in the pump and attach the tubing to the oil inlet of the PDMS chip.\nPrepare cells for encapsulation.\nPrepare single cell suspensions of ductal and mesenchymal cells in two different tubes.\nNote: for detailed description of preparing a single cell suspension, please refer to step 54 of this protocol for mesenchyme, and step 67 for ductal cells.\nPass ductal cell single cell suspension through a 40 μm strainer and subsequently collect at 500 RCF for 5 min.\nMesenchymal cell suspension does not need to be strained, but if strained use also 40 μm strainer; collect cells at 500 RCF for 5 min.\nResuspend each of cell types in 50 μL of MM media at a concentration of 0.5–1 × 106 cells/mL.\nKeep cells on ice until mixing with agarose.\nWarm up the cell suspension by placing the cells at 37°C or by holding the tube in your hand before adding the agarose from step 84.\nSlowly add 50 μL of agarose solution to the cells (1:1 ratio) and carefully mix the suspension by pipetting up and down without creating air bubbles.\nThe cells are now ready to be loaded into the syringes. Proceed to step 88.\nCritical: To achieve the mesenchyme cell concentrations specified above, isolation from several mice is often necessary. A pilot experiment is suggested, to assess how well the primary mesenchyme expands in the in vitro culture.\nPrepare the cell-laden (aqueous phase) syringes (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig6.jpg\nFigure 6. Loading of the agarose into cell syringe\n(A) Pre-fill the glass syringe with HFE-7000.\n(B) Connect the tubing with the needle.\n(C) Fill the needle reservoir with HFE-7500.\n(D) Connect the syringe with the needle and tubing, and push the HFE-7500 out of the syringe.",
    "(E) Pull the plunger back until a small air bubble appears at the end of the tubing.\n(F) Fill the tubing with the agarose/cell mixture using the air bubble as an indicator; stop just before the air bubble reaches the needle.\nCut 2 sets of tubing and attach each to a separate needle (Figure 6[href=https://www.wicell.org#fig6]A).\nTo see the contents of the tubing better and to avoid losing the tube content, make a loop at the end of the tubing and hold it in your hand so that the tube opening is facing upwards (Figure 6[href=https://www.wicell.org#fig6]B).\nFill each syringe with 100 μL of HFE-7500 and attach the needle to the tubing. Make sure that the needle reservoir is also filled with HFE-7500 (Figure 6[href=https://www.wicell.org#fig6]C).\nPush out the HFE-7500 with the syringe, leaving the oil only in the tubing (Figure 6[href=https://www.wicell.org#fig6]D).\nCreate a small air bubble at the end of the tubing by gently pulling the syringe plunger backwards (Figure 6[href=https://www.wicell.org#fig6]E). The air bubble will allow monitoring of how far the tubing has been filled with agarose/cell suspension mixture.\nPlace the end of the tubing in the agarose/cell suspension mixture and gently fill the tubing by moving the plunger slowly backwards (Figure 6[href=https://www.wicell.org#fig6]F).\nStop filling the tubing just before the air bubble enters the needle.\nStop filling the tubing before you completely run out of cell-agarose mixture. Avoid air bubbles.\nConnect the tubing to the correct inlets on the PDMS chip.\nAdd tubing for the outlet exiting the chip, and put a 1.5mL test tube on ice to collect the agarose droplets emerging from the tubing – there, they will solidify there and become microgels.\nPerform microfluidic encapsulation (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig7.jpg\nFigure 7. Microfluidics rig set up\nSet-up of the microfluidic encapsulation rig.",
    "(A) Photographic illustration of the microfluidic rig for co-encapsulation. (i) Sterile encapsulation environment including precision pumps, a high-speed camera and light microscope. (ii) The microfluidic chip connected to the pumps, ready for cell encapsulation. (iii) Close-up view of the connected microfluidic chip. iv) Disconnected chip for easier view of the inlets and outlets for the tubing.\n(B) Schematic illustration of the microfluidic co-encapsulation chip with labels designating inlets, outlets and flow rates used.\nSwitch on all the equipment (computer, pumps, microscope and camera, Figure 7[href=https://www.wicell.org#fig7]A).\nIn the pump software, select the correct syringe for each pump.\nSelect the correct flow rate for your experiments; here we used 3 μL/min for the cell syringes and 30 μL/min for the oil syringe (Figure 7[href=https://www.wicell.org#fig7]B).\nModify the flow rates to change droplet size and droplet forming speed in your experiments.\nRun the experiment.\nDuring the run, watch out for blockages, do not leave the equipment unattended while encapsulating.\nCollect the cell-laden agarose droplets gels in a test tube on ice for solidification and formation of microgels\nStop all equipment once the syringes are empty of the cell-agarose solutions; the oil syringe with the oil-surfactant can be reused for the next encapsulation if it is not empty.\nNote: Depending on microfluidic chip design, other flow rates may be equally suitable and can be experimentally optimized. Optimal flow rates are influenced by the viscosity of the oil and the hydrogel precursor used necessitating empirical adjustment.\nDe-emulsify the microgels.\nAt the end of the experiment, wait 5 min for the phases to separate in the microgel collection tube on ice (Figure 8[href=https://www.wicell.org#fig8]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig8.jpg\nFigure 8. De-emulsification of encapsulated agarose-cell microgels\n(A) Schematic of liquid layers before and after the adition of 1H,1H,2H,2H-Perfluioro-1-Octanol (PFO); the fraction “microgels + media” should be taken for further seeding in Matrigel.",
    "(B) Photographs of the test tubes before and after the addition of PFO for the de-emulsification procedure.\nRemove as much oil as possible without touching the cell phase with a pipette. It is better to leave some oil rather than disrupt the microgel-laden phase.\nAdd 200 μL of MM media to the microgels collection tube.\nCritical: Do not pipette up and down, just add media on top of the microgels phase.\nAdd 45 μL of 1H,1H,2H,2H-Perfluoro-1-octanol (PFO) to the microgels collection tube.\nCritical: Do not pipette up and down, just add on top of media and microgels.\nVortex for 5 s, spin briefly (5–20 s) in a microcentrifuge and take the cell suspension phase (Figure 8[href=https://www.wicell.org#fig8]B).\nMix 30 μL of cell-laden microgels from step 91e with 170 μL of 100% Matrigel.\nSeed 50 μL of the mixture as a Matrigel dome (see details in6[href=https://www.wicell.org#bib6]) in 24 well plate. If intended for imaging, seed 20 μL in a well of an IBIDI dish.\nLeave for 15 min at 37°C and 5% CO2 incubator for Matrigel solidification\nOverlay with cell culture media.\nMonitor the growth of the culture over the next 7–10 days (Figure 9[href=https://www.wicell.org#fig9]), changing the media every 3 days.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2730-Fig9.jpg\nFigure 9. Co-culture of mesenchyme and ductal cells after microfluidic co-encapsulation\nRepresentative images of encapsulated cells embedded in Matrigel at day 0 and day 6 of culture. Representative of organoid structures where contact between ductal cells (red) and portal mesenchyme (green) is established (i, ii, arrows), as well as ductal cell organoid structures with mesenchyme growing in the vicinity but where contact has not been established (iii, iv, arrowheads). BF, bright field. Scale bar, 100 μm.\nCritical: Matrigel will solidify at 19°C–25°C, so work quickly and keep the basement matrix cold throughout the process.",
    "Critical: Prepare cell culture plates or dishes for seeding by pre-warming them in 37°C – at least 30 min in advance, but the plates can also be pre-warmed a day in advance."
  ],
  "subjectAreas": [
    "Organoids",
    "Cell Biology",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}