{
  "id": 9670,
  "origin_website": "Jove",
  "title": "Profiling Voltage-gated Potassium Channel mRNA Expression in Nigral Neurons using Single-cell RT-PCR Techniques",
  "procedures": [
    "1. Brain slice preparation\nYoung (15-40 days old) male and female Sprague-Dawley rats are used. (We also use this same protocol in mice.) Under deep urethane anesthesia, animals are decapitated and the brain is quickly dissected out. Then 300 μm-thick coronal brain slices containing the midrostral part of substantia nigra are cut on a Leica vibratome (VT-1200S). The slice cutting procedure is performed in an ice-cold, oxygenated high sucrose cutting solution containing (in mM): 220 sucrose, 2.5 KCl, 1.25 NaH2PO4, 25 NaHCO3, 0.5 CaCl2, 7 MgCl2, 10 D-glucose. It is bubbled with a mixture of 95% O2/5% CO2 to keep oxygenated and maintain pH at 7.4. Keep the cutting solution ice-cold throughout the procedure.\nThe brain slices are incubated in an incubation chamber filled with an oxygenated artificial cerebrospinal fluid (aCSF) containing (in mM): 125 NaCl, 2.5 KCl, 1.25 NaH2PO4, 25 NaHCO3, 2.5 CaCl2, 1.3 MgCl2, 10 D-glucose. It is bubbled with a mixture of 95% O2/5% CO2 to keep oxygenated and maintain pH at 7.4. The incubation temperature is 34 °C for 45 min and then at room temperature until the brain slice is transferred to the recording chamber.\n2. Electrophysiological fingerprinting of nigral neurons\nOne brain slice is transferred to a patch clamp recording chamber continuously perfused with the oxygenated aCSF at 32 °C.\nPatch pipettes are pulled from autoclaved borosilicate (KG-33) glass capillary tubing (1.10 mm i.d., 1.65 mm o.d., King Precision Glass, Claremont, CA) using a PC-10 puller (Narishige, Tokyo, Japan) and filled with intracellular solution prepared with DNase-RNase-free water (Fisher Scientific) (containing 135 mM KCl, 0.5 mM EGTA, 10 mM HEPES, 1.5 mM MgCl2, pH adjusted to 7.3). The patch pipettes have resistances of 2-3 MΩ in the bath.",
    "The substantia nigra is identified according to its distinct anatomical location (Fig. 1A1-2). Under visual guidance of a video microscope (Olympus BX51W1) equipped with Nomarski optics and 60X water immersion lens, large cells in the substantia nigra pars compacta (SNc) and substantia nigra pars reticulata (SNr) (possible DA neurons and GABA neurons) are selected for recording. Conventional giga-ohm tight seal whole-cell configuration is obtained (Fig. 1B1). Current clamp and voltage clamp analyses can be performed. To minimize mRNA degradation, electrophysiological recording should be brief (≤5 min). One option is to record only the membrane and spiking properties to provide electrophysiological fingerprints for the neurons of interests (Fig. B2-3). This brief recording takes only about 1 min.\n3. Cytoplasm aspiration\nAfter electrophysiological fingerprinting and characterization of SNr GABA and DA neurons, gentle mouth suction is applied to aspirate the cytoplasm. The cell nucleus may also be aspirated, resulting in genomic DNA contamination. The tight seal should not be broken; otherwise extracellular debris including mRNA may be sucked into the patch pipette and contaminate the cell content. The integrity of the tight seal is good as long as the increase in the holding current at -70 mV does not exceed 100 pA.\nThen the aspirated cell content is expelled into a 0.2 mL PCR tube by breaking the pipette tip and a small positive pressure. One cell's content is collected into one PCR tube. After accepting the cell content, the collecting PCR tube, pre-cooled on ice, is immediately placed in a -20 °C freezer.\nTo rule out contamination of extracellular debris that may contain mRNAs, the patch pipette is lowered into the tissue without actually aspirating cytoplasm and then the pipette content is subjected to RT-PCR.\n4. Reverse transcription (RT)",
    "After collecting cell content from a reasonable number of neurons, usually 10-20, RT should start immediately to minimize the degradation of mRNAs.\nSince the quantity of the cell content from a single neuron is too small, RNA isolation procedure is not performed. To remove the potential contaminating genomic DNA, the aspirated cell content is first digested by DNase I (5 μL DNase I and 1.6 μL DNase I Buffer, 5 min at 25 °C). Then DNase I is inactivated by adding 1.2 μL 25 mM EDTA and incubating at 75 °C for 5 min.\ncDNA is synthesized using the SuperScript III reverse transcriptase-based Cells-Direct cDNA Synthesis kit (Invitrogen, Table 1). First strand cDNA is synthesized at 50 °C for 50 min, then the reaction is inactivated by incubation at 85 °C for 5 min and 1 μL RNase H is added to digest mRNA (37 °C for 20 min). The single-stranded cDNA is stored at -20 °C for later PCR amplification.\nComplete removal of genomic DNA is verified by RT-minus control in which the reverse transcriptase is omitted while all other reaction components were exactly the same.\n5. Two stage PCR amplification\nPrimers were designed according to the sequences in GenBank. Whenever possible, intron-spanning primer pairs were used that help detect genomic DNA contamination. Primer pair sequences are listed in Table 2. The effectiveness of the primer pairs should be first verified by whole brain mRNAs that yield positive products. All primers are synthesized by Integrated DNA Technologies (Coralville, Iowa, USA).",
    "In the first stage, 5 μL of the 30 μL cDNAs is amplified for 35 cycles in the presence of primer pair (Table 2). The thermal cycling protocol of the thermal cycler (MasterCycler, Eppendorf, Table 1) is 2 min at 94 °C for the initial denaturation, then 35 cycles of 15 s at 94 °C to denature, 30 s at 55°C to anneal, and 45 s at 72°C to extend, followed by 7 min for a final extension. Taq DNA polymerase, deoxynucleotide triphosphates (dNTPs), and all other components necessary for PCR amplification are provided by a PCR super mix (Invitrogen, Table 1)\nIn the second stage PCR, the product of 1 μL from the 1st stage PCR amplification is used as template and the same primer pair used in the first stage is used (Table 2). 40 cycles are run with the extension time shortened to 30 s. The same PCR super mix is used.\nPCR products from the 2nd stage amplification are separated by 2.5% agarose gel electrophoresis, visualized by ethidium bromide (0.05 mg/100 mL gel) or gelgreen under UV light, and photographed (Fig. B4). The positive bands are then cut out, extracted using a Qiagen extraction kit (Table 1) and sequenced, and compared with the published sequences of the target genes.\n6. Representative results:",
    "The dopamine (DA) neurons in the substantia nigra pars compacta and pars reticulata and the neighboring GABA projection neurons in the substantia nigra pars reticulata have distinct electrophysiological characteristics (Zhou et al. 2006; Ding et al. 2011). As shown in Fig. 1B2, SNr GABA neurons exhibit high frequency spontaneous spiking around 10 Hz. The spikes have a base duration around 1 ms. Upon hyperpolarizing current injection, SNr GABA neurons display a weak depolarizing sag in response to hyperpolarizing current injection, indicating a weak expression of Ih current in these neurons (Fig. 1B2). In contrast, the nigral DA neurons exhibit low frequency (around 2 Hz) spontaneous spikes that have a base duration around 3 ms. DA neurons also show a pronounced sag in response to hyperpolarizing current injection, indicating a strong expression of Ih current (Fig. 1B3) (Zhou et al. 2006; Ding et al. 2011).",
    "scRT-PCR detected mRNA for glutamic acid decarboxylase 1 (GAD1, the key enzyme for GABA synthesis and a marker for GABA neurons) in electrophysiologically identified SNr GABA neurons, but not in DA neurons (Fig. 1B4,5). In contrast, scRT-PCR detected mRNA for tyrosine hydroxylase (TH, key enzyme for dopamine synthesis and a marker for DA neurons) in electrophysiologically identified SNc and SNr DA neurons, but not in GABA neurons (Fig. 1B4,5). So scRT-PCR results confirm the electrophysiological neuron identification. Next, scRT-PCR was used to profile the expression of voltage-activated Kv3 channel subunits, Kv3.1, Kv3.2, Kv3.3 and Kv3.4. These subunits contribute to form voltage-gated K+ channels of diverse properties depending on subunit composition (Ding et al. 2011). In the example SNr GABA neuron shown in Fig. 1B4, mRNAs for Kv3.1, Kv3.2, Kv3.3 and Kv3.4 were detected. In the example SNr DA neuron shown in Fig.1B5, only Kv3.2, Kv3.3 and Kv3.4 were detected. In our pooled data, Kv3.1 was more frequently detected in SNr GABA neurons than in nigral DA neurons, indicating a higher expression level of Kv3.1 in the fast-spiking SNr GABA neurons (Ding et al. 2011).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3136/3136fig1.jpg",
    "Figure 1. Electrophysiological identification of SNr GABA neurons and nigral DA neurons. A: nigral areas can be identified by their distinct anatomical location. A1 shows the location of SNc and SNr in a coronal Nissl-stained section captured with a 1X objective. The boxed area was captured with a 10X objective and displayed in the middle as indicated by the arrow. The cell-rich SNc and cell-poor SNr are clearly visible. A2 shows the location of SNc and SNr in a live, unstained coronal section captured with a 4X objective. The cell-rich SNc and cell-poor SNr are also clearly identifiable. VTA, ventral tegmental area. B1 shows an SNr GABA neuron being patch clamped in whole-cell mode. B2 shows the typical electrophysiological properties of SNr GABA neurons in current clamp recording mode. These neurons fire spontaneous high frequency action potential of short duration and have a weak Ih-mediated sag response to hyperpolarizing current injection. B3 shows typical electrophysiological properties of nigral DA neurons in current clamp recording mode. They fire spontaneous low frequency action potentials of long duration and have a prominent Ih-mediated sag (arrow head) response to hyperpolarizing current injection. Thus, SNr GABA neurons and nigral dopamine neurons are clearly identified electrophysiologically. B4 shows a gel picture of scRT-PCR products from an electrophysiological identified SNr GABA neuron. Glutamate decarboxylase 1(GAD1) mRNA but no Tyrosine hydroxylase (TH) mRNA was detected. mRNAs for Kv3.1, Kv3.2, Kv3.3 and Kv3.4 were detected in this SNr GABA neuron. B5 shows scRT-PCR detection of neuronal Kv3 channel mRNAs in a SNr DA neuron. TH mRNA but no GAD1 mRNA was detected in an electrophysiologically identified SNr DA neuron. mRNAs for Kv3.2, Kv3.3 and Kv3.4 were detected in this SNr DA neuron. B6 shows pooled data.\n7. Potential false negative and false positive results",
    "Based on our experience, several factors can lead to false negative scRT-PCR results. These factors include failure in aspirating sufficient amount of the cytoplasm due to patch pipette tip clogging, RNase contamination, and inefficient PCR primers. Patch pipette tip clogging usually can be seen on the video monitor and indicated by increased access resistance. RNase contamination can be avoided by thorough deactivation and wearing gloves. PCR primer effectiveness should be tested by using total RNA from a brain tissue punch (Zhou et al. 2008; Ding et al. 2011).\nSince we always use DNase to first treat our samples before RT, we have not encountered false positive results. Theoretically, without DNase digestion, genomic DNA contamination and thus false positive detection may occur when the gene is intronless or the primer pair does not span the intron region.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}