{
  "id": 7442,
  "origin_website": "Bio",
  "title": "Quantitative Determination of Primary Cilia Protein Distribution Using Immunofluorescence Staining and MATLAB Analysis",
  "procedures": [
    "Seeding cells and fixation for ciliogenesis assayWash 13 mm coverslips in 1 N HCl at 55°C overnight in a flask in an orbital shaker at 140 × g.After extensive washing, coat coverslips with 0.1 mg/ml poly-L-lysine for 1 h at room temperature.Wash coverslips with water and let dry overnight.Before plating, place coverslips under UV light for 15 min.Seed cells onto coverslips at a density of 4 × 105 per well in 6 well plates (Diameter = 3.5 cm). This is approximately a 60% density, so the cells will be around 80% the next day. This can vary between cell lines, and we suggest optimization.Allow cells to attach for 24 h.Wash cells 3x with serum free media (SFM) and keep in SFM for 48 h.Wash 2x with 1× PBS (alternatively with PTEM buffer) and proceed to fix (4% formaldehyde diluted in 1× PBS or Methanol at -20°C, as desired).Immunostaining protocolNote: All steps to be carried out at room temperature. Place coverslips in a humid chamber and wash 2x with 1× PBST to permeabilize cells. Leave in second wash for 5 min.Block cells using 3% (w/v) bovine serum albumin in 1× PBST (PBSBT) for 5 min.Add primary antibodies diluted in PBSBT and incubate for 1 h.Wash coverslips 3x with 1× PBST for 5 min.Add secondary antibodies diluted 1:500 in PBSBT and incubate for 1 h.Wash coverslips 3x with 1× PBST for 5 min.Add DAPI diluted in PBSBT and incubate for 2 min.Wash 2x, apply drops of ProLong Gold to a slide, and mount. Allow to dry in the dark overnight.After 24 h, seal with nail polish.Image acquisitionImages were acquired using an 100× oil objective (1.4 NA). Exposure times were set equally for all images amongst different conditions. Images were acquired using Zeiss analysis software (Zen).",
    "Description of MATLAB scripts and analysis CILIA 1 (Four channel raw intensity): cilia_linesc_raw_int_v9 This script measures fluorescence intensity (channel 2) along a linescan drawn manually and outputs average intensity in 10 equal segments along the linescan. This allows the user to compare cilia of different length. Cilia are segmented in a user- interactive manner using the improfile function from MATLAB, which retrieves the intensity values of pixels along a multiline path defined by the user. This script also measures the length of the segmented cilium. The data is exported as an excel spreadsheet and saved using the same filename as the TIFF file. A cilia marker (i.e., acetylated tubulin or Arl13B) can be used to define the cilium path. Intensity profiles are then retrieved from the channels of interest. To reduce noise, the average fluorescence intensity of three pixels (above, on, and below the path) is measured for each position along the cilium (taking an average of multiple pixels reduces the impact of a single noisy pixel). A description of how to use this script is detailed below.    Four (4) fluorescent channels. For the example shown: channel 1 (C1) is the centriole marker (γ-tubulin), channel 2 (C2) is the protein of interest (IFT81), channel 3 (C3) is the cilia marker (acetylated tubulin), and channel 4 (C4) is the nuclear stain (DAPI). Cilia are manually defined, and then the script will divide cilia into 10 equal sections (bins). The raw pixel intensity of channel 3 will be measured along the defined cilia and presented as 10 cilia sections running from the base to the cilia tip. In the example below, this script is used to quantify IFT81 (Figures 1-8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g001.jpgFigure 1. A204 IFT81 image used for CILIA 1 script MATLAB analysis.",
    "A204 cells were serum starved for 48 h to induce ciliogenesis, then fixed and stained with antibodies for IFT81 (red), acetylated tubulin (green), and γ-tubulin (white). The nuclear stain is DAPI (blue). Scale bar = 10 μm.Opening MATLAB, importing data, and preparing scriptImage exporting and savingExport images as TIFF file format; an individual image is required for each fluorescent channel. The channels for analysis have been exported in the following order in the example shown: centriole marker, channel 1 (C1), signal to be analyzed, channel 2 (C2), acetylated tubulin or cilia marker of choice, channel 3 (C3) and DAPI or alternative nuclear stain, channel 4 (C4). An image of an overlay of all channels C1 + C2 + C3 + C4 is included in the file exported. In order for the script to work correctly, channel 2 (C2) must be the channel to be analyzed and channel 3 (C3) a cilia marker. The markers used for channel 1 and 4 can be changed if required.Open MATLAB.Add the four script files to the MATLAB directory (left sidebar) by dragging files.Add the TIFF image files to be analyzed to the left sidebar (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g002.jpgFigure 2. Importing data into MATLAB. Drag the script files and images to be analyzed into the MATLAB left sidebar of the operating interface. Images must be imported as the individual fluorescent channels as TIFF files.In line 12 of the script, change the name of the file to the same as the file to be analyzed. Exclude the TIFF file extension from the file name in the script (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g003.jpgFigure 3. Changing script file name. Change the filename in script (line 12, highlighted in blue) to the same name as the files to be analyzed. The TIFF extension should not be included in the filename.",
    "Click on the dash sign (-) next to line 28 in the script; this will add a breakpoint in the script, which allows the script to be paused at this point (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g004.jpgFigure 4. Selecting file to be analyzed and inserting a breakpoint in the script. Insert a breakpoint in the script by clicking on the dash sign next to line 28; this will convert the dash to a red circle (highlighted with an arrow). Run the script by clicking “run” (green icon boxed-in in red).Defining cilia and analyzing IFT81 pixel intensityRun the script by pressing the green icon on top of “run,” highlighted in Figure 4. An image of acetylated tubulin will appear in a new window. Click on “tools>zoom in” and draw a square around the cilia to be analyzed.Press “continue” on script (“continue” is found in the same place as the run icon).Using the cursor, draw a line along the center of the cilia starting from the base to the tip of the cilia. If the cilia bends, stop, click, and continue. When the line reaches the cilia tip, double click with the left mouse button (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g005.jpgFigure 5. Identifying the cilium to be analyzed. Draw a line along the center of the magnified cilium, ensuring the line goes from the base to the tip of the cilium. Double click when the line is at the cilium tip. This example uses A204 cells.The line drawn along the cilia will be automatically overlaid onto the IFT81 staining image, and pixel intensity will be measured along this line (measurements extend several pixels at the tip and in the lateral direction throughout the cilia, to ensure pixel intensity of the cilia is measured) (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g006.jpgFigure 6. Cilium line overlaid on to IFT81 image.",
    "The line drawn along the cilium will be automatically transferred to the IFT81 image, and the pixel intensity of this section of the image will be measured.A histogram of the IFT81 staining is displayed (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g007.jpgFigure 7. IFT81 pixel intensity histogram. Example of the histogram produced with the script. The average pixel intensity for each section of a cilium (1-10, proximal to distal) is shown. In the y-axis is the average pixel intensity, and the x-axis shows the cilium divided into 10 equal sections. Section 1 represents the cilium base and section 10 the tip. The base of the cilium was determined using the centrosomal marker γ-tubulin.An Excel spreadsheet of the IFT81 staining of the cilia is shown in the current folder side bar. This spreadsheet presents the average pixel intensity of the cilia divided into 10 sections (1 proximal-10 distal), and it also includes the cilia length. If multiple cilia are to be analyzed per image, it is important to change the name of the file so that the file is not overwritten when subsequent cilia are analyzed (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4248/bioprotoc-11-23-4248-g008.jpgFigure 8. Excel spreadsheet with data.The Excel spreadsheet of IFT81 pixel intensity will appear in the current folder side bar (highlighted in blue). If multiple cilia are to be analyzed per image, change the name of the file to avoid overwriting this file."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}