{
  "id": 15209,
  "origin_website": "Jove",
  "title": "High-Throughput Protein Crystallization via Microdialysis",
  "procedures": [
    "1. Protein sample preparation\nPrepare (through recombinant methods or otherwise) and purify the protein(s) of interest in a suitable buffer (i.e., one that is amenable for protein stability and crystallization) that has been filtered with a 0.22 µm filter (see Table of Materials). Evaluate the protein quality (in terms of purity, polydispersity, and stability) prior to crystallization31.\n\tNOTE: Please see the representative results section for details on the proteins and buffers used in the present study.\nConcentrate the sample up to 10-50 mg.mL-1 or higher (depending on the protein target) using the correct MWCO concentrator (see Table of Materials).\n\tNOTE: The concentrated sample can be used immediately for crystallization or stored frozen at -80 °C.\nIf the protein has been frozen, centrifuge the sample for 10 min in a bench-top centrifuge (≥16,000 × g, at room temperature or 4 °C) to pellet and remove any unwanted material (e.g., precipitates).\nAliquot the protein into clean 200 µL PCR tubes. Keep it on ice or at 4 °C if the protein is unstable at room temperature.\n2. Setting up the microdialysis plate\nNOTE: The commercially available microdialysis plate (see Table of Materials) consists of two sides ('protein side' and 'buffer side') with a regenerated cellulose membrane (available in different MWCOs), as shown in Figure 2.\nWith the plate orientated protein side up, peel back and remove the adhesive cover tape (Figure 2A) from the 200 µm pressure adhesive spacer. Take note of the position of well A1.\nUsing a multichannel pipette, load a maximum of 3.2 µL of protein (step 1.4) into each well (Figure 2B).",
    "NOTE: The protein can also be loaded using a repeat dispensing pipette. Using a single-channel pipette is possible, but it will increase the likelihood of partial dehydration of the drops occurring due to the extended loading time.\nPosition the 200 µm UV cover film (see Table of Materials) over the 96-well plate and check its integrity (Figure 2C). Ensure that the protective film is facing up.\nUse a sealing paddle (see Table of Materials), press down the UV cover film to activate and seal the pressure adhesive.\nInvert the plate and take note of the position of well A1. Ensure that the plate is oriented buffer side up and that the well positions are mirrored (Figure 2D).\nUsing a multichannel pipette, load a maximum of 350 µL of the dialysis solution into each of the wells (Figure 2D).\n\tNOTE: In this step, either commercially available crystallization screens (sparse matrix screens) or laboratory-made customized screens (grid screens) can be used (see Table of Materials).\nCarefully seal the wells with the 'reservoir cover film' (see Table of Materials) (Figure 2E).\nPlace the plate (buffer side up) in a suitable temperature-controlled incubator (20 °C) for crystal growth.\n\tNOTE: For the proteins selected for the present study, the crystals started to appear between 1-8 h at 20 °C.\nTo inspect for crystals under the microscope, invert the plate to bring the protein side up and remove the protective film from the 200 µm UV cover film (step 2.3), as shown in Figure 2F,G.\n3. Large-scale crystallization using dialyzer tubes",
    "NOTE: Once crystallization conditions have been explored using the microdialysis plate, large-scale crystallization of the protein (for serial crystallography or other purposes) can be performed using the dialyzer tube, as shown in Figure 3. Similar to the microdialysis plate, these devices are available with 3, 5, 10, and 30 kDa MWCO dialysis membranes.\nPrepare the optimized crystallization condition for the growth of microcrystals in large containers (adopting the conditions optimized using the microdialysis plate). Ensure the buffer has been previously filtered with a 0.2 µm filter.\nPipette the protein into the dialyzer tube (maximum volume of 0.5 mL) and seal the end using the included red plastic cap (Figure 3A).\nPlace the 500 µL dialyzer tube into a suitably sized container (depending on the total volume of dialysis solution) containing the floating rack (see Table of Materials), as shown in Figure 3B.\n\tNOTE: The floating rack provided with the dialyzer kit holds up to 18 dialyzer tubes simultaneously.\nPlace the container stationary in a suitable temperature-controlled incubator (20 °C) for crystal growth.\nTo inspect for crystals, pipette 1-2 µL of the solution onto a glass cover slide. Cover with a second glass cover slide on top (to prevent excess dehydration) and view under a microscope (see Table of Materials).\n\tNOTE: Crystals may be damaged when sandwiched between two glass cover slides during the inspection. Crystals may also be viewed directly by placing the dialyzer tube under a stereo high-magnification microscope."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}