{
  "id": 8877,
  "origin_website": "Jove",
  "title": "Neurobehavioral Assessments in a Mouse Model of Neonatal Hypoxic-ischemic Brain Injury",
  "procedures": [
    "All animals were housed in a standard cage (27 × 22.5 × 14 cm3) in a facility accredited by the Association for Assessment and Accreditation of Laboratory Animal Care (AAALAC) and given food and water ad libitum under alternating 12-h light/dark cycles. The authors followed animal protection regulations, and the experimental procedures were approved by the Institutional Animal Care and Use Committee of Yonsei University College of Medicine (IACUC No. 2010-0252; 2013-0220).\n1. Mouse Model of Neonatal HI Brain Injury\nAnesthetize the pups with isoflurane.\n\t\nPlace the pups (less than 5) into an anesthetizing box and close the lid.\nTurn on the anesthetizing system for approximately 15 min; adjust the gas and isoflurane using a table top anesthesia machine. Adjust the oxygen flowmeter to 1.5 L/min. Adjust the isoflurane vaporizer to 3-5% for the induction of anesthesia.\nAfter 15 min, adjust the isoflurane vaporizer to 1-2% for the maintenance of anesthesia.\nLay a fully anesthetized pup under a dissection microscope (abdomen facing the researcher) and secure it with tape.\nMake a ~0.7-mm incision in the neck using sterilized scissors.\nCarefully remove the adipose tissue using sterilized forceps and expose the unilateral right carotid artery.\nLigate the unilateral right carotid artery with a 5-0 absorbable suture.\nSuture the incision in the neck with 5-0 suture.\nPlace each pup in a 37 °C warm hypoxic chamber for 1 h for recovery. Do not close the chamber lid.\n1 h after the surgery, when the pups are fully awake, close the hypoxia chamber lid and decrease the gas levels to establish hypoxic conditions (8% O2 and 92% N2).\nAfter 90 min of hypoxia, return the pups to their cages.\nOne week after the HI brain injury, repeat step 1.",
    "After the anesthesia, make an incision in the scalp with sterilized scissors and forceps to identify the brain lesion in the posterolateral area of the right hemisphere.\n\t\tNote: This treatment induces hypoxia in pups. The presence and extent of brain injury in all mice is visually assessed with the naked eye through the semi-transparent skull. As determined by the size or volume of the discoloration (i.e., the brain lesion), pups are classified into groups. If there is no visible cortical injury , the mouse is classified into the “no cortical injury” group. If there is a visible cortical injury (i.e., a lesion in the right hemisphere), the mouse is classified into the “cortical injury” group. Since classification of the mice into groups is done one week after the operation, the groupings can be modified when the morphologies of the brain samples are clearly defined at the time of sacrifice1,2,3,4.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55838/55838fig1v3.jpg\nFigure 1: Modeling neonatal HI brain injury in mice.",
    "(A) A seven-day-old mouse pup underwent surgery, and the unilateral right carotid artery was ligated. (B) Pups were placed in a hypoxic chamber for 90 min with 8% O2 and 92% N2. (C, D, and E) The brains with neonatal HI injury showed various severity of damage and were categorized based on the degree of damage. At week 14, the brains were obtained, and the lesions were visualized. (C) Image of a brain classified as a \"no cortical injury\". Both (D) and (E) were classified into the \"cortical injury\" group. (F, G, and H) Representative MRI of (C), (D), and (E) mice, respectively. (F) The damage in the hippocampus is indicated with a yellow arrow, and lesions in the right hemisphere are also indicated with yellow arrows (G and H). Scale bars = 1 mm  Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55838/55838fig1v3large.jpg]\n2. Neonatal Behavioral Tests\nNote: Here, the behavioral tests were performed at 6 weeks of age.\nPassive avoidance task.\n\tNOTE: To evaluate memory function based on learning and the avoidance of an aversive stimulus, a two-compartment step-through PAT should be conducted13,14,15,16.\n\t\nPlace a mouse into the bright compartment of the Plexiglas shuttle box (41.5 × 21 × 35 cm3) of a PAT apparatus.\nAfter 30 s, open the guillotine door and record the latency time for the mouse to move into the dark compartment (up to 300 s).\nClose the guillotine door when all four limbs of the mouse are fully inside the dark compartment.\nAdminister electric foot shock (0.5 mA) for 2 s and return the mouse to its cage.\nReplace the mouse in the bright compartment 24 h after the electric foot shock.",
    "Open the guillotine door 10 s after the mouse is fully placed in the bright compartment, and record the latency time for the mouse to move into the dark compartment (up to 300 s).\nLadder walking test.\n\tNOTE: The ladder rung walking task allows for the discrimination between subtle disturbances of motor function by combining qualitative and quantitative analyses of skilled walking17,18.\n\t\nTurn on a video camera.\nPlace a mouse on the start panel of the ladder and immediately begin recording.\nRecord the video, focusing on the mouse limbs.\nStop recording when the mouse touches the last panel of the ladder. Repeat the back-and-forth trip four times.\nAnalyze the video recording and manually count the number of slips of each forelimb, as follows:\n\t\t\nPlay recording of the video on a computer at a slow speed (0.1x) and count the steps manually.\nGrip strength test.\n\tNOTE: The grip strength test is performed using a grip strength meter, which includes a push-pull strain gauge.\n\t\nFix the grip strength apparatus onto an acrylic panel.\nPlace a mouse on the acrylic panel and hold its tail.\n\t\t\nMove the hand holding the tail so that the mouse can reach and grip the metal wire of the apparatus.\nAllow multiple trials until the mouse grips a triangular piece of metal wire (2 mm in diameter); the peak force is automatically registered in grams by the apparatus.\n\t\tNOTE: Use the mean peak force of three trials for analysis19,20,21.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}