{
  "id": 9722,
  "origin_website": "Jove",
  "title": "Electrode Positioning and Montage in Transcranial Direct Current Stimulation",
  "procedures": [
    "1. Materials\nCheck if you have all materials needed (Table 1, Figure 1).\nTDCS devices should be battery-driven and function as a constant current stimulator with a maximum output in the miliAmps range. In some devices, the batteries can be chargeable. Constant voltage (voltage controlled) stimulators are not appropriate for tDCS.  Using electrical outlets to power the device is not convenient or appropriate as mal-functioning devices might deliver large intensities of electrical currents with no warning.\nElectrodes used for tDCS generally consist of a metal or conductive-rubber electrodes enclosed in a perforated sponge pocket which is saturated with an electrolytes (fluid with salt). Another possibility is the use of rubber electrode with conductive gel. Prolonged passage of direct current current across metallic electrode (where electrons from the stimulator are converted to ions carried through the body8) can produce undesired electrochemical products such as pH changes. The sponge pocket may act to physically separate, and thus buffer, the skin from electrochemical changes.\nFor this reason, metal or rubber electrodes should never be placed on the skin during tDCS. Similarly during stimulation user should be vigilant against sponge dehydration and movement. A further related consideration is the durability and re-usability of tDCS electrodes. Our experience is that, especially when the polarity of electrodes is rotated, and proper stimulation conditions consistently maintained, rubber and metal electrodes can be re-used. The choice of electrolyte is discussed further below. From operating experience, it is recommended to use flat, and not too coarse perforated sponges, as they best absorb the electrolyte conduction solution and provide uniform skin contact8.",
    "There is the possibility to apply topical anesthetics. Especially for short-lasting stimulation, when ramping is not possible, it might prevent somatosensory perception and uncomfortable sensation arising from tDC stimulation. Another reason for using topical application of local anesthetics is to create best comparability between sham and active tDCS conditions, since no subject would feel if current is flowing or not and optimal blinding situation would be guaranteed. This approach is particular vulnerable when planning to use larger intensities as blinding might be less effective in this situation7. Though sensation/pain and skin irritation are not always correlated, excessive use of topical anesthetics might mask serious adverse effects such as burning.\nIn this guide we illustrate the most typical tDCS set-up for pain management: using conductive rubber electrodes, pocket type perforated sponges, both placed on the head, with no topical anesthetic.\n2. Measurements\nMake sure the subject is seated comfortably.\nThe area of stimulation will be found through the measurement of the scalp. Usually the convention of the EEG 10/20 system is used7. The site of stimulation depends on your experimental approach.\nFind localisation of the Vertex (Figure 2): \nMeasure the distance of nasion to inion and mark halfway using a skin marker. \nNasion – point between the forehead and nose, at the junction of the nasal bones (Figure 3). \nInion – most prominent point of the occipital bone (Figure 3). \nMeasure the distance between the pre-auricular points and mark halfway. Mark both halfway spots to find the Vertex.",
    "To locate the primary motor cortex, or M1, use 20% of the auricular measurement and use this measurement from Cz through auricular line (to the side of the Vertex) (Figure 4). This spot should correspond to C3/C4 EEG location. This method of localization is enough given the focality of traditional large electrodes tDCS. For more focal tDCS, other methods of cortical localization might be needed.\nTo locate the dorsolateral prefrontal cortex (DLPFC)9,10: One practical method is to measure five centimetres forward from the M1 location or to use the 10/20 EEG system. This should correspond to the F3 or F4 EEG location, as seen here (Figure 5).  This method of determining the stimulation site is sufficient when using traditional tDCS electrodes. For more focal tDCS, other methods of cortical localization may be needed, such as neuronavigation.\n3. Skin Preparation \nInspect the skin for any pre-exiting irritation, cuts, or lesions - avoid stimulating over damaged skin and over skull lesions.\nTo increase conductance, move hair away from the site of stimulation and clean the surface of the skin to remove any signs of lotion, dirt, etc. and allow it to dry. For subjects with thick hair, use of conductive gel may be necessary.\nIf using re-usable electrodes, inspect the rubber insets and sponges for wear. Inspect the rubber insets and sponges for wear. If there is any evidence of deterioration, throw out the dirty components and use a new electrode.\n4. Position electrodes",
    "After finding the site of stimulation and skin preparation you should place one of the elastic or rubber head straps around the head circumference. The elastic head strap should be placed under the inion as to avoid movement during stimulation. The elastic straps should be made of non-conducting material (or they will function as electrodes) and non-absorbent material (to avoid the straps absorbing fluid from the sponges).\nEach side of the sponges should be soaked with saline solution. For a 35 cm2 sponge, approximately 6 mL of solution per side may suffice (total of 12 mL per sponge). Be careful not to over soak the sponge (not excessively wet- there should be no water leaking; but also not dry as to have a good electrode contact). Avoid fluid leaking across the subject. You can use a syringe to add more solution if needed.There is evidence that electrolyte solutions with lower NaCl concentrations(15 mM) are perceived as more comfortable during tDCS than those solutions with higher NaCl concentrations (220 mM)11,12. Since the ionic strength of deionised water is much less than that of all NaCl solutions, there is a significantly larger voltage required to carry current across the electrode and through the skin compared to NaCl solutions. Thus, it is recommended the use of solutions with moderate NaCl concentration, in the range 15 mM to 140 mM, as tDCS at these concentrations is more likely to be perceived as comfortable, requires moderately  lower voltage while still allowing good conduction of current.11  The use of gels (adapted from applications such as EEG) has also been considered – a main limitation is the increased hassle of set-up clean-up following stimulation, without proven benefit regarding outcome when using perforated sponge electrodes.\nConnect the cables to the device.",
    "Consult with your stimulator operating manual on if the stimulator should be powered on before or after connecting positioned electrodes to the stimulator. Using all stimulators, the electrodes should not be disconnected or connected when current flow has been initiated. Ensure the connection polarity is correct as the effects of tDCS are highly polarity specific (typically, red indicates the Anode electrode, and black or blue indicates the Cathode electrode; this is the convention- but check with your device).  Note that in the context of tDCS (and more broadly electrical stimulation in general), \"Anode\" always indicated the relative positive terminal where positive current flows intro the body, while \"Cathode\" indicates the relative negative terminal where the positive current then exits the body.\nInsert the connector cord pin securely into the opening of the receptacle on the conductive rubber inset.\nSlide the conductive rubber inset into the sponge. The insulated portion of cable will protrude from the sponge-pocket opening. Ensure the entire conductive rubber inset is covered by the sponge and that there is no part of the connector cord pin is visible.\nPlace one sponge electrode below the elastic head strap. Ensure that excessive fluid is not ejected from the sponge unto the scalp during this process as this will spread current flow across the scalp and deplete the sponge of fluid.\nConnect the second elastic head strap to the first elastic head strap according to the electrode montage you want to use (Table 2). Other elastic head straps can be used.\nPlace the second sponge electrode on the head under the second elastic head strap. Make sure you place it onto the marked area you want to stimulate.",
    "The path from one device terminal, through one electrode, across the body, through the second electrode, and back to the second device terminal forms a circuit – the total resistance of which (sum of the electrodes and body resistance) can be measured.  If the overall resistance is abnormally high, this may indicate improper electrode set-up.  If your device measure resistance - this would be recommended – the indication field should display appropriate electrode contact. Ideally, one should aim to have the impedance under 5k Ohms. Some devices indicate the voltage across the path rather than resistance - in this case resistance can be calculated simply using ohms law (Resistance = Indicate Voltage / Current applied). Many devices continue to provide an indication of resistance during the course of stimulation, which provides a useful way to detect a potentially hazardous situation (such as a drying electrode). In some cases, device will automatically terminate stimulation or reduce stimulation intensity if resistance increases beyond a certain threshold.\n5. Start tDCS\nPrior to start the procedure, screen subjects for any contraindications (see discussion).\nThe subject should be relaxed, comfortable and awake during the procedure.\nUncontrolled interference with current cortical activity during tDCS should be avoided. For stimulation to the motor cortex area, it has been demonstrated that intensive cognitive effort unrelated to the target area, as well as massive activation of the motor cortex by prolonged muscle contraction abolishes the effects of tDCS13.\nAdjust the settings on the tDCS stimulator that you want to stimulate with, including the intensity, time, and if applicable to your device, the sham condition setting (Figure 10). Note that some stimulators have to be switched on before the contact between the electrodes and the skin is made to avoid electrical shocks.",
    "Now initiate the tDCS. To reduce any adverse effects start current flow by ramping up the current.  Many commercial devices include features to automatically ramp current on and off. One point that should be noted is that subjects usually continue feeling some local sensation even after current is discontinued.\nSome subjects may experience discomfort during the initial tDCS period.   In such cases the current may be moderately decreased for a temporary period, for example by 50%, as the subject adjusts, then gradually increased back up to the desired level. This feature may depend on the device being used.\nAt the beginning of stimulation, the majority of subjects will perceive a slight itching sensation, which then fades in most cases. Similarly, rapid changes of the stimulating circuit immediately might induce peripheral nerve firing. The subject can notice it as brief retinal phosphenes with electrodes near the eyes. These effects can be largely avoided by ramping the current up and down at the beginning and end of treatment. This might also prevent the dizziness or vertigo occasionally reported when current is suddenly increased or decreased.7\nAfter the stimulation, current flow should be ramped off as well. Note on High-Definition tDCS (HD-tDCS): TDCS with electrodes smaller then approximately 2 cm2 is called HD-tDCS and often uses array of electrode (more than two) to guide current through the brain for specific applications14. This methods paper focused only on conventional tDCS (using larger sponge electrodes), and it is important to emphasize that HD-tDCS requires specific electrodes15, skin preparation, and stimulator hardware. It is not recommended to apply tDCS using 1-2 mA of sponge electrodes14,15.\n6. After the procedure",
    "To evaluate transcranial DC stimulation regularly and to record the safety of this technique over a long period of time, it is recommended to use a questionnaire of adverse effects.\nSuch a questionnaire should include any possible adverse effects associated with tDCS. The most common adverse effects are tingling, itching and burning sensations, headache and discomfort. You can find an example for such a questionnaire in the article of Brunoni et al. (2011)16. It is also recommended to collect quantitative on the adverse effects like a 1 to 5 or 1 to10 grade scale.\nOne should also use this adverse effect questionnaire after the condition of sham stimulation to reveal a better comparability between the two stimulation situations. There is evidence that sham stimulation causes a comparable amount of itching and tingling sensations as active stimulation.\n7. Representative Results: \nWith proper setup, the tDCS device should display that either current is flowing during active tDCS situation, or the device should display sham mode when running a sham stimulation procedure (Figure 10). \nOf note, even with the device indicating that current is flowing through the system, current might actually being shunted through the skin. In order to avoid this effect, it is recommended to have sufficient distance between electrodes. According to modeling studies we recommend that to be of at least 8cm when using 5x7cm electrodes17. \nFurthermore, it is recommended to consult computer head models14 and neurophysiological studies. These additional steps would ensure that a specific montage is associated with significant changes in cortical excitability in the area that is being investigated.\nRepresentative for anodal stimulation is an increase of brain excitability, whereas cathodal stimulation leads to a reduction of the cortical excitability. Robust evidence for this has been revealed in trials targeting the primary motor cortex (Figure 6).",
    "The variation of the electrode size leads to a variation of focal effects. With a decrease of the diameter of the electrode, a more focal stimulation can be achieved. This can be proven by using TMS over the motor cortex. On the other hand by increasing electrode size it is possible to have a functionally ineffective electrode (Figure 8). \nWith session duration of 20 minutes or more and with multiple sessions over consecutive days, the after-effects of tDCS will last longer. Example for this is the treatment of pain syndromes. \nOne important point is the location of the reference electrode. If an extracephalic position is chosen, investigator should be aware of current distribution as the reference electrode might displace the peak of induced current and modify the effects of tDCS.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig1.jpgFigure 1. Materials\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig2.jpgFigure 2: Vertex Position. Cortical areas marked according to the 10/20 system. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig3.jpgFigure 3: Nasion and Inion Position \nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig4.jpgFigure 4: Motor cortex Position. Cortical areas marked according to the 10/20 system.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig5.jpgFigure 5: DLPFC Position. DLPFC= dorsolateral prefrontal cortex. Cortical areas marked according to the 10/20 system.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig6.jpgFigure 6: Change in cortical excitability due to current polarity and tDCS montage. Table: Induced effects of tDC stimulation on the size of the motor evoked potential (MEP), assessed by transcranial magnetic stimulation (TMS). MEP amplitudes after stimulation are given in percent of MEP without stimulation. Note that only the motor cortex (M1) - contralateral supra-orbital (Fp2) montage setting leads to a significant increase of MEP size after anodal and a decrease of MEP amplitude after cathodal stimulation. There are no significant effects on MEP amplitude in other tDCS montages. Figure: Electrode Placements6 (modified from Nitsche 2000).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig7.jpgFigure 7: Electrode Sizes",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig8.jpgFigure 8: Decreasing the size of the electrode leads to a more focally effect of tDCS. Muscle-evoked potential (MEP) amplitude sizes of the abductor digiti minimi (ADM) and of the first dorsal interosseus muscle (FDI) during anodal or cathodal tDCS. Using the condition of a 35 cm2 electrode, anodal and cathodal tDCS influence the MEP amplitude size of the ADM and the FDI to a similar extent. At this montage, both hand muscle representation areas are located underneath the stimulating electrode. In the case of a smaller electrode, which is only placed over the representational area of the ADM, the effects of MEP amplitude changes of the cortical FDI representation are not reproducible (see yellow column)18 (modified from Nitsche 2007).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig9.jpgFigure 9: Tissue-depended current density. Current densities calculated in different tissues. Magnitude of current density is dependent on the conductivity of tissue. Note that approximately 10% of current density reaches the Gray Matter19 (modified from Wagner 2007a).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2744/2744fig10.jpgFigure 10: Different stimulation conditions: active vs. sham. Some tDCS devices provide set ups for active and sham condition. Usually applicable stimulation is indicated with a light signal.\ntable:\n﻿0\nMaterial\nTDCS device\n9V Battery (2x)\nTwo rubber head bands\nTwo conductive rubber electrodes\nTwo sponge electrodes\nCables\nNaCl solution\nMeasurement Tape\nTable 1. Materials\ntable:\n﻿0,1,2,3\nAnode Electrode Positioning,Cathode Electrode Positioning,Observations,Caveats\nPrimary Motor cortex (M1),Supra-Orbital,This is the most used montage. It has been proven that the cortical excitability can be changed up to 40%6 (Figure 6). Anodal stimulation results in neuronal depolarisation and increasing neuronal excitability while cathodal stimulation has opposite results6.,Only one motor cortex is stimulated – might be a problem for bilateral pain syndromes. Also the confounding effect of the supra-orbital electrode needs to be considered.",
    "Primary Motor cortex (M1),Primary Motor cortex,\"- Interesting approach when there is a bi-hemispheric imbalance between motor cortices (such as in stroke)  - Can be used with two anodal stimulation electrodes (see sixth row), where cathodal electrode is placed in the supraorbital area for instance.\",Electrodes might be too close to each other- issue of shunting. A decrease of the area of the electrodes will increase the degree of shunting along the skin 19  Therefore shunting might be related not only to electrode positioning but also to electrode size. The relative resistance of the tissues is dependent upon the electrode position and size- the overall resistance on which the current flows is dependent upon the electrode properties19.\nDorsolateral Prefrontal Cortex (DLPFC),Supra-Orbital,Most used for DLPFC stimulation – positive results for treatment of depression20 and also chronic pain3.,Only unilateral DLPFC stimulation situation is possible with this montage.\nDorsolateral Prefrontal Cortex,Dorsolateral Prefrontal Cortex,\"- Interesting approach when there is a bi-hemispheric imbalance. - Can be used for a two anodal stimulation situation (see sixth row), where cathodal electrode is placed in the supraorbital area for instance.\",\"Electrodes might be too close to each other- issue of shunting 19. (Please see second row, fourth column).\"\nOccipital,Vertex,Interesting active control for chronic pain trials or for modulation of visual cortex.,\"When used as active control, reference electrodes are placed in different locations- problem of comparability between intra- and inter- experimental approaches.\"\n\"Two anodal electrodes, e.g. both Motor cortices\",Supra-Orbital,Simultaneous change in cortical excitability,Transcallosal inhibition might add a confounding factor21\n\"One electrode over a cortical target, e.g. Primary Motor cortex (M1)\",Extra-Cranial,Avoid the confounding effect of two electrodes with opposite polarities in the brain7.,\"Depending on intended target, current distribution might not be optimal and therefore induce ineffective stimulation22\"\nTable 2. Electrode Positioning7",
    "Note: It is possible that the differences between various electrode positions might be the activation of different neuronal populations due to different electrical field orientations."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}