{
  "id": 12001,
  "origin_website": "Jove",
  "title": "Measuring Real-time Drug Response in Organotypic Tumor Tissue Slices",
  "procedures": [
    "All mouse experiments were performed according to the recommendations in the Guide for the Care and Use of Laboratory Animals of the Animal Welfare Act and the National Institutes of Health guidelines for the care and use of animals in biomedical research.\n1. Preparation of tumor tissue slices\nPrepare tissue slice culture (TSC) medium following the recipe in Table 1. Filter the medium with a 0.45 µm vacuum filter unit to sterilize.\nAliquot 250 µL of TSC medium per well for a 24 well plate, or 1 mL of medium per well for a 6 well plate. Keep the plate in a 37 °C, 5% CO2 humidified incubator until use.\n\tNOTE: The medium and supplements can be optimized depending on tissue types and experimental goals. The amount of medium should be just enough to soak the porous membrane of a culture insert. Do not exceed the level of the membrane. Adjust the medium volume if the medium level is too low or too high. If researchers are testing immunomodulatory agents, we recommend supplementation of the medium with IL-210.\nIf using tumor tissue derived from mice, euthanize mice with a recommended procedure, sanitize the exposed skin of mice by spraying 70% ethanol, and dissect tumors with aseptic techniques. Store the tumor tissue in a tube containing ice-cold Hank’s Balanced Salt Solution (HBSS).\nIf using fresh patient tumor tissues, store in ice-cold HBSS for short term, or ice-cold Belzer University of Wisconsin (UW) solution for longer term storage (up to 24 h) to preserve tissue viability.\n\tNOTE: Slices from a PDX tissue shipped overnight in ice-cold UW solution have been successfully prepared.",
    "Transfer the tumor tissue into a 10 cm culture plate containing ice-cold HBSS. Cut tumor into halves with a scalpel while submerged in ice-cold HBSS. Shape tumor tissues into cylinders using a 6 mm diameter biopsy punch and trim one side to create a flat surface. Store the tissues in ice-cold HBSS until use.\n\tNOTE: Avoid including the necrotic area of the tissue, which is generally at the center and has an opaque and fragile appearance.\nSet up the vibratome. Disinfect all the equipment using 70% ethanol. Place the vibratome buffer tray covered with an acrylic glass lid at the center of the vibratome ice bath. Add ice to the ice bath and fill up the buffer tray with cooled HBSS to keep the tissue cool while slicing. Attach a razor blade to the blade holder.\n\tNOTE: Although keeping vibratomes in a semisterile environment has not affected prior experiments, it is recommended to store the vibratome under a biosafety cabinet if available.\nCarefully lift up a biopsy-punched tumor tissue from the HBSS using toothed forceps and remove excess buffer by dabbing the tissue with a lint-free paper towel.\nPlace a drop of medical grade cyanoacrylate glue on the specimen plate and place the tissue on this drop. Air-dry the glue for 2–3 min and place the plate into the buffer tray. Supplement with some HBSS until the tissue is fully immersed in the buffer.",
    "NOTE: Mounting tissues in an upright, stable position is critical to generate uniformly cut slices. If mounted tissues are unstable, either add more glue to the surrounding tissue to retain an upright position or unload the tissue, flatten the bottom, and glue it again. Elastic tissues tend to get pushed and bent more easily during slicing, in which case shorter lengths (<5 mm) and multiple runs may be appropriate. For extremely fragile tissues, paper towels can destroy the tissue. In this case, the tissue can be placed on a plastic surface to wick away some excess HBSS.\nAdjust the vibratome settings. The following settings are used: cutting thickness = 250 µm, amplitude = 3.00 mm, slicing speed = 0.01–0.25 mm/s, and blade angle = 15°–21°.\n\tNOTE: Optimize the slicing settings depending on the stiffness of the tissue. Softer tissues are more easily cut with a deeper blade angle at lower speed. A blade angle of 18°, cutting speed between 0.10–0.18 mm/s, and an amplitude of 3.00 mm works well for mouse 4T1 and PDX HCI010 tumors. Stiffer tissue can be cut with a faster blade speed.\nSet the start and end locations of the blade and adjust the height of the stage. Run the instrument with continuous mode to cut slices for several cycles until the tissues are cut uniformly.\nContinue slicing the tissue. Transfer the slices along with a small amount of HBSS buffer onto the cell culture insert with medium with a wide-tip transfer pipette, using suction to lift the whole slice. Place one slice per insert on a 24 well plate. An insert for 6 well plates can accommodate up to four slices for a replicate assay.",
    "NOTE: If the last edge of the tissue slice is still attached to the uncut tissue, stop the vibratome and separate the tissue slice with two pairs of fine tip forceps without touching or poking the tissue slices. A separate razor blade can be useful in removing hanging tissue.\nRemove any excess buffer with a fine tip transfer pipette.\nWhen the blade reaches close to the glued tissues, stop the instrument, lower the stage, remove the stiffened tissue with a separate blade, and mount a new tissue. Continue slicing until enough slices have been collected.\nCulture the plates in a humidified incubator set at 37 °C, 5% CO2. The tissue slices are cultured at the air-liquid interphase on the cell culture insert. The tissue slices are ready for experiments 24–48 h after the initial slice preparation. For long-term cultivation, exchange the medium every 2–3 days.\n2. Viability measurement\nFor viability measurement of the tissue slice, exchange the medium with a luminescence-based viability measurement reagent containing both luciferase and prosubstrate at 1:1,000 dilution in TSC medium following the manufacturer’s instructions. The reagent measures the reduction activity of live cells of metabolized prosubstrate to luciferin11. Transfer 50 µL of enzyme-substrate mixture on top of each tissue slice.\nIncubate with gentle agitation on an orbital shaker located inside a humidified incubator set at 37 °C with 5% CO2 overnight.\nLuminescent signals can be measured using either a microplate reader or an in vivo imaging instrument for tissues cultured in a 24 well plate. To measure the individual viability of multiple tissues on a 6 well plate, an in vivo imaging system should be used.",
    "When using a microplate reader, set the microplate without the lid. Any type of microplate reader capable of measuring luminescent intensity should be suitable for the experiment. We used the following settings: read time = 1 s, measurement from the top, gain = 200.\n\t\tNOTE: For higher accuracy, use a white-wall microplate to set up the experiment. White-wall, clear-bottom 24 well plates have been tested, and in most cases, clear well plates do not compromise the results.\nWhen using an in vivo imaging system to measure the viability, place the plate at the center of the stage and remove the lid. Acquire normal photographic images followed by luminescent images with a field of stage setting at C, auto exposure time, f-stop = 1, objective setting as microplate with subject height = 0.0 cm.\nQuantify the luminescent intensity using the imaging software accompanied with the in vivo imaging system. Draw consistent regions of interest (ROI) around each tissue slice. This protocol uses a 1 cm diameter circle as an ROI (See Figure 1). Measure the total flux (p/s) of the area.\n3. Evaluation of drug effect on the tissue slices\nMeasure baseline viability prior to treatment using the luminescence-based viability measurement reagent as explained in section 2.\n\tNOTE: If several tissues have significantly lower viability compared to others, omit the tissues from the assay.\nDissolve drugs in dimethyl sulfoxide (DMSO) to make stock solutions. Prepare a 10x drug solution with TSC or other culture medium (25 µL/well for a 24 well plate containing 250 µL of medium) at the desired concentrations. For vehicle control, prepare medium containing an equivalent volume of DMSO.",
    "Supplement the 10x drug solution to the culture medium at the bottom of the well. Mix by pipetting and transfer 50 µL of the medium on top of the tissues.\n\tNOTE: If several tissue slices are available, test duplicates or triplicates for each condition.\nIncubate overnight with gentle shaking on an orbital shaker in a 37 °C, 5% CO2, humidified incubator.\nRemove the plate from the shaker and incubate statically in the 37 °C, 5% CO2, humidified incubator.\nAt desired timepoints, measure the luminescent intensity from the tissues using a microplate reader or an in vivo imaging system. Usually, drug effects become detectable after 1–6 days of treatment.\n\tNOTE: The luminescence-based viability reagent is stable for at least 3 days under culture conditions. However, the substrate may be depleted during the assay depending on the metabolic activity of the tissue. If a significant signal drop is observed in tissues with previously high signals, supplement the substrate in all the wells.\nCalculate the remaining viability of the treated tumor tissues using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61036/61036eq1v2.jpg\n\tThe viability of the treated tissue is normalized by its baseline viability and viability shift of control tumor tissues.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}