{
  "id": 6026,
  "origin_website": "Bio",
  "title": "Reduced Representation Bisulfite Sequencing in Maize",
  "procedures": [
    "The complete pipeline contains 1. in slico enzyme selection, followed by 2. RRBS library preparation. The resulted library is to be sequenced to generate DNA methylation profiles at genomic regions of interest.In silico enzyme selectionClone the GitLab project from: https://gitlab.com/fmhsu0114/maize_RRBS[href=https://gitlab.com/fmhsu0114/maize_RRBS].Download the genome FASTA file of your interest, i.e., maize_genome.fa, and use the following command to build the genome database:$ python Build_Gnome.py AGPv3.fa2 output files (genome.shelve and log-genome.txt) will be generated.Download the annotation refFlat file, i.e., refFlat.txt, and use the following command to build the gene annotation database:$ python Build_refgene_shelve.py refFlat.txt log-genome.txt1 output file (refgenes.shelve) will be generated.Download the annotation gff3 file and grep ‘repeats’ into an individual file, i.e., repeats.gff3, and use the following command to build the repeat annotation database:$ python Build_repeats_Gnome.py repeats.gff3, log-genome.txt1 output file (repeat.shelve) will be generated.Build the genome CG, CHG and CHH sites database with the following command:$ python Build_CG_CHG_CHH_Gnome.py genome.shelve log-genome.txt1 output file (CG_CHG_CHH.shelve) will be generated.Perform in silico digestion with the provided enzyme list in the GitLab project (enzyme_cutting_sites.txt) with the following command:$ python Enzyme_digestione.pyfragment_info (per MSRE and per size range) for each enzyme and a Summary-enzyme-coverage.txt file will be generated.Place the output files from 1.6 into one directory ./fragment/ and run the enrichment analysis with the following command:$ python RRBS_fragments_enrichment.py repeats.shelve, refgenes.shelvelog2_fold_enrichment (per MSRE and per size range) files will be generated (see Table 1).Table 1. Fold enrichment values in log2 scale of the MseI 40-300-bp fragmentsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315022655_7172.jpgMove all of the log2_fold_enrichment files into one directory ./output/ and plot the enrichment bar charts with the following command:$ Rscript Barchart_enrichment.RSee Figure 2 to Figure 4 as examples.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315022814_0202.jpgFigure 2. Bar chart of the MseI 40-300-bp fragments shows enrichment in promotersimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315022852_6504.jpgFigure 3. Bar chart of the CviQI 40-280-bp fragments shows enrichment in exons, introns, UTRs and splice sitesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315022946_1842.jpgFigure 4.",
    "Bar chart of the BfaI 50-300-bp fragments shows enrichment in promotersUse the following command to calculate the covered promoter and genebody region:$ python RRBS_fragments_enrichment_gene_level_per_MRE_Size.py -i Enzyme -s size_range -c 1This script has 3 parameters:-i: restriction enzyme-s: size selection range, e.g., 40-280-c: number of cytosines per promoter/genebody to be includedAn output file, Fragment-Enrichment-genebody-pmt-Enzyme-size_range-1.txt, will be generated (Table 2 and Table 3). This file contains the percentages of the promoters and genebody covered in the reduced representation (RR) genome. Note: In Table 2 and Table 3, Pct refers to percentage; Pmt refers to promoter. Table 2. Promoter and genebody covered in the MseI 40-300-bp fragmentsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180320/20180320012651_7864.jpgTable 3. Promoter and genebody covered in the BfaI 50-300-bp fragmentsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180320/20180320012723_1506.jpg RRBS library preparationUse Qubit Fluorometric Quantification with Qubit dsDNA BR assay to quantify maize genomic DNA according to the manufacturer’s instructions.Note: To acquire high quality double strand genomic DNA, we recommend spin column-based DNA extraction kit, e.g., QIAGEN DNeasy Plant Mini kit. If Pheno-Chloroform method is used, we suggest another round of spin-column based purification.Aliquot 1 μg of maize genomic DNA into a 1.5 ml tube, add 5 μl of 10x CutSmart Buffer, 1 μl of MseI and ddH2O to a final volume of 50 μl. Mix carefully with a pipette and incubate at 37 °C on the heating block for 4 h.Note: MseI used here is designed for promoter-enriched RRBS in maize. For different genomes (organisms), researchers should conduct ‘in silico enzyme selection’ and replace MseI with the predicted enzyme, and modify the digestion time, buffer and temperature according to the manufacturer’s instructions.[Optional] Take 5 μl for gel electrophoresis (100 ng, 1.5%, 0.5x TBE) and add 5 μl ddH2O to the enzyme digestion product. Note: This step is to confirm the enzyme digestion efficiency.",
    "Post-digestion AMPure beads purificationAdd 150 μl of well-inverted AMPure XP beads solution to 50 μl of DNA, vortex for 10 sec, briefly centrifuge and incubate at RT for 5 min. Note: When vortexing solutions with AMPure XP beads, avoid high vortexing strength causing bubbles. After vortexing, use microcentrifuge to spin down quickly to remove liquids from the lid and the wall of the tube.Place the tube on the magnetic stand for 3 min. Remove the supernatant. Add 200 μl of 80% EtOH without disturbing the beads and incubate at RT for 30 sec. Remove the EtOH. Note: Do not remove the tube from the magnetic stand.Repeat the washing Step B4d. Air-dry the beads for 5 min. Remove the tube from the magnetic stand. Add 32 μl of 10 mM Tris-HCl and pipet up and down to mix thoroughly. Incubate at RT for 2 min. Place the tube on the magnetic stand for 3 min. Transfer the supernatant to a PCR tube.End repair and A-tailingAdd 6 μl of 10x NEBuffer 2, 12 μl of 5x RRBS dNTP mix and 3 μl of 3’→5’ Klenow exo- to the purified DNA and add ddH2O to a final volume of 60 μl. Incubate using thermocycler at 30 °C for 20 min and 37 °C for 20 min, then place the tube on ice.DNA purification with AMPure XP beadsAdd 180 μl of well-inverted AMPure XP beads to the 60 μl of DNA, vortex for 10 sec, briefly centrifuge and incubate at RT for 5 min.Place the tube on the magnetic stand for 3 min. Remove the supernatant.Add 200 μl of 80% EtOH without disturbing the beads and incubate at RT for 30 sec. Remove the EtOH. Note: Do not remove the tube from the magnetic stand.Repeat the washing Step B6d.",
    "Air-dry the beads for 5 min. Remove the tube from the magnetic stand. Add 24 μl of 10 mM Tris-HCl and pipet up and down to mix thoroughly. Incubate at RT for 2 min. Place the tube on the magnetic stand for 3 min. Transfer the supernatant to a PCR tube.Ligate with a TruSeq methylated Illumina adaptorAdd 3 μl of 10x T4 DNA ligation buffer, 2 μl of adaptor and 1 μl of T4 DNA ligase to the 24 μl end-repaired and A-tailed DNA to a final volume of 30 μl. Incubate at 16 °C overnight in a thermocycler.Gel size selection (Figure 5)Load all the adapter-ligated DNA to 1.5% 0.5x TBE gel (15 μl per well, in total 2 wells) for gel electrophoresis with a 100-bp DNA ladder.Use a clean razor blade for each sample to cut 40-300-bp fragments and purify the DNA using the QIAGEN Qiaquick Gel Extraction Kit following the manufacturer’s instructions. Elute DNA twice with a total volume of 34 μl of EB buffer. Transfer the solution to a PCR tube. Take 1 μl for Qubit quantification (optional).Note: One should avoid UV light during gel size selection. Since the adaptor sequence is about 120 bp, we cut 160-420-bp fragments from the gel. For each well in the previous step, use one QIAGEN Qiaquick Gel Extraction reaction. For the first round of elution, add 10 μl of EB buffer to each MinElute spin column, and collect the 20 μl of the solution in a new tube. Then use another 14 μl of EB buffer to elute the remaining DNA from each spin column one by one.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315023957_7261.jpgFigure 5. Gel size selectionBisulfite conversion Note: Confirm that the reagents in the EpiTect Fast Bisulfite Conversion Kit are ready to use.",
    "Add RNase-free water to the DNA solution to a final volume of 40 μl, mix with a pipette and aliquot 20 μl to another PCR tube. Add 35 μl of DNA Protect Buffer and 85 μl of a Bisulfite Solution to each tube to a final volume of 140 μl and mix thoroughly with gentle pipetting. Run in a thermocycler with the following program: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315024151_1582.jpgThen hold at 20 °C. Lid temperature: 100 °C.Briefly centrifuge the PCR tubes containing the bisulfite reaction with microcentrifuge to remove the liquid from the tube lid and transfer to clean 1.5 ml microcentrifuge tubes. For each tube, add 310 μl of freshly prepared Buffer BL containing 10 μg/ml carrier RNA, mix thoroughly with pipetting and then centrifuge briefly. Add 250 μl of 96-100% EtOH, gently pipet for 10 sec and then centrifuge briefly. Transfer all of the solution to MinElute DNA spin columns with collection tubes. Centrifuge at maximum speed for 1 min and discard the flow-through. Washing Add 500 μl Buffer BW to each spin column, centrifuge at maximum speed for 1 min and discard the flow-through. DesulfonationAdd 500 μl of Buffer BD to each spin column and incubate for 15 min at RT. Centrifuge at maximum speed for 1 min and discard the flow-through.Add 500 μl Buffer BW to each spin column, centrifuge at maximum speed for 1 min and discard the flow-through. Repeat the washing Step B14c. Add 250 μl of 96-100% EtOH to each spin column and centrifuge at maximum speed for 1 min. Place each spin column into a clean 1.5 ml microcentrifuge tube, open the lid and incubate using a 60 °C heating block to evaporate the liquid.",
    "Elute the DNA by adding 15 μl of Buffer EB onto the center of the spin column membrane, close the lid and incubate at RT for 1 min. Centrifuge at 15,000 x g for 1 min.PCR amplificationAdd 2.5 μl Illumina TruSeq PCR primer cocktail, 0.5 μl of 10 mM dNTP, 5 μl of 10x Pfu Turbo Buffer, 0.5 μl of Pfu Turbo DNA polymerase and 26.5 μl of ddH2O to the eluted DNA solution to a final volume of 50 μl. Mix thoroughly and centrifuge briefly. Run in a thermocycler with the following program:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180315/20180315024349_9044.jpgDNA purification with AMPure XP beadsAdd 150 μl of well-inverted AMPure XP beads to the 50 μl of DNA, vortex for 10 sec, briefly centrifuge and incubate at RT for 5 min.Place the tube on the magnetic stand for 3 min. Remove the supernatant.Add 200 μl of 80% EtOH without disturbing the beads and incubate at RT for 30 sec. Remove the EtOH. Note: Do not remove the tube from the magnetic stand.Repeat the washing Step B16d. Air-dry the beads for 5 min. Remove the tube from the magnetic stand. Add 22 μl of 10 mM Tris-HCl and pipet up and down to mix thoroughly. Incubate at RT for 2 min. Place the tube on the magnetic stand for 3 min. Transfer the supernatant to a 1.5 ml microcentrifuge tube.Quantify the final library concentration with the Qubit assay.Sequence the RRBS library with Illumina paired-end sequencing. Any regular length of pair-end reads, e.g., 100-250 bp, is fine."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Plant Science",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}