{
  "id": 17777,
  "origin_website": "Jove",
  "title": "Non-Radioactive In Vitro Cardiac Myosin Light Chain Kinase Assays",
  "procedures": [
    "1. Cloning and purification of recombinant wild type and DCM-associated mutant cMLCK\nCloning of recombinant cardiac myosin light chain kinase into plasmid\n\t\nDesign a continuous nucleotide sequence to represent the final plasmid.\nAmplify a DNA fragment coding human MYLK3 (NM_1829493.3) using a standard PCR method. The primer sequences are as follows:\n\t\tForward primer: 5’- CACCATGTCAGGAACCTCCAAGGAGAGTCTGGGG -3’\n\t\tReverse primer: 5’- TTAGGGAGAAGTTGGAAATTTCCTTAACCT -3’\n\t\tThe melting temperature is 60 °C.\n\t\tNOTE: The single-stranded overhang sequence (CACC) is necessary to ligate to the TOPO cloning vector.\nIntroduce a DCM-associated mutant construct by primer-derived mutagenesis. The primer sequences are as follows:\n\t\tForward primer: 5’- GTACAAGCCTCGAGAGAAGCTGAAGGTGAAC -3’\n\t\tReverse primer: 5’- CTTGAGGTCCAGGTGCAGGATGTAGTGCTGGT -3’\n\t\tThe melting temperature is 60 °C.\nRun a 0.8% agarose gel at 135 V for 20 min, and cut out the bands corresponding to the PCR products. Then extract and purify the PCR products using a gel extraction kit (see Materials) following the manufacturer’s instructions.\nPerform a TOPO cloning reaction following the manufacturer’s instructions (see Materials) and transform Escherichia coli (pENTR/cMLCK WT, mutant vector).\nConfirm the correct sequence by PCR using the following universal M13 primers. The primer sequences are as follows:\n\t\tForward primer: 5’- GTAAAACGACGGCCAGT -3’\n\t\tReverse primer: 5’- GTCATAGCTGTTTCCTG -3’\nIncorporate a FLAG-tag into the pENTR/cMLCK vector and perform a LR recombination reaction between MYLK3 and a GateWay destination vector (i.e., pEF-DEST51) following the manufacturer’s instructions (pEF-DEST51/FLAG-cMLCK WT, mutant).\nCell culture and transfection into HEK293T cells\n\t\nSeed a 100 mm dish with 7.5 x 106 HEK293T cells and culture with DMEM supplemented with 10% FBS and 1% penicillin-streptomycin. Incubate at 37 °C in 5% CO2 for 24 h.",
    "Prepare the Lipofection reagent/DNA mix for transfection into HEK293T cells by mixing 10 µg of plasmid DNA in 500 µL of MEM (see Table of Materials). At the same time, prepare the mixture by adding 20 µL of Lipofectamine 2000 in 500 µL of MEM.\nIncubate for 5 min at room temperature (RT), then mix the Lipofectamine-DNA solution.\nIncubate for 20 min at RT, then add 1 mL of the Lipofectamine-DNA solution to the 100 mm dish.\n\t\tNOTE: To avoid detaching the cells, add the lipofection mixture gently.\nIncubate the transfected cells for up to 48 h at 37 °C with 5% CO2.\nPurification of recombinant cMLCK protein\n\t\nPlace the transfected cells on ice and wash 3x with 5 mL of PBS.\nPrepare lysis buffer (50 mM Tris-HCl, 0.15 M NaCl, 1% NP40, 0.5 mM EDTA, 0.5 mM EGTA, and protease inhibitor cocktail, pH = 7.5) and keep on ice.\n\t\tNOTE: Add the protease inhibitor cocktail just before the assay.\nAdd 1 mL of lysis buffer to the cells, use a scraper to harvest cells into a 1.5 mL tube, and incubate on ice for 5 min.\nCentrifuge at 20,000 x g for 5 min at 4 °C.\nCollect supernatant in a new 1.5 mL tube and incubate with 5 µL of FLAG-M2 agarose for 1 h at 4 °C.\nCentrifuge at 1,000 x g for 1 min at 4 °C, then remove the supernatant and wash in FLAG-M2 agarose 3x using washing buffer (50 mM Tris-HCl, 0.15 M NaCl, 1% NP40, 0.5 mM EDTA, 0.5 mM EGTA, and protease inhibitor cocktail, pH = 7.5).\nElute the binding proteins with elution buffer (50 mM Tris-HCl, 0.15 M NaCl, 1% NP40, 0.5 mM EDTA, 0.5 mM EGTA, and protease inhibitor cocktail, pH = 7.5) at 4 °C for 30 min.",
    "Centrifuge at 1,000 x g at 4 °C for 3 min and use the supernatant as the recombinant FLAG-tagged proteins.\n2. Cloning and purification of recombinant calmodulin\nCloning of recombinant calmodulin into the plasmid\n\t\nDesign a continuous nucleotide sequence to represent the final plasmid.\nAmplify a DNA fragment coding human calmodulin (CALM1) (NM_006888) using a standard PCR method. The primer sequences are as follows:\n\t\tForward primer: 5’- CACCATGGCTGATCAGCTGACCGAAGAACAGATT -3’\n\t\tReverse primer: 5’- TCATTTTGCAGTCATCATCTGTACGAATTC -3’.\n\t\tThe melting temperature is 60 °C.\n\t\tNOTE: The single-stranded overhang sequences (CACC) are necessary for ligating to the TOPO cloning vector.\nRun a 0.8% agarose gel at 135 V for 20 min, and cut the bands corresponding to the PCR products out of the gel. Then extract and purify the PCR products using a gel extraction kit (see Materials) following the manufacturer’s instructions.\nPerform the TOPO cloning reaction following the manufacturer’s instructions (see Materials) and transform into E. coli (pENTR/Calmodulin).\nConfirm correct sequence by PCR using the following universal M13 primers. The primer sequenced are as follows:\n\t\tForward primer: 5’- GTAAAACGACGGCCAGT -3’\n\t\tReverse primer: 5’- GTCATAGCTGTTTCCTG -3’\nPerform the LR recombination reaction between the calmodulin and a GateWay destination vector (pEF-DEST17) following the manufacturer's instructions.\nTransform into BL21 (DE3) chemically competent E. coli.\nCell culture and induction of expression\n\t\nInoculate 5 mL of LB medium containing 100 µg/mL ampicillin with a colony from the transformed E. coli and shake overnight at 37 °C.\nTransfer to 200 mL of LB medium containing 100 µg/mL ampicillin and incubate at 37 °C until the culture optical density (600nm) reaches 0.5.\nAdd arabinose to a final concentration of 0.2% and culture for 3 h at 37 °C.\nCentrifuge at 5,000 x g at 4 °C for 10 min and remove the supernatant.",
    "Suspend in 10 mL of BugBuster Master Mix containing EDTA-free protease inhibitor cocktail and rotate at RT for 20 min.\nCentrifuge at 16,000 x g at 4 °C for 10 min.\nThe resulting supernatant containing the N-terminus His-tagged calmodulin protein was loaded onto a column of TALON Affinity Resin equilibrated with immobilized metal ion chromatography binding buffer.\nElute the bound His-tagged calmodulin protein with elution buffer (50 mM sodium phosphate [pH = 8.0], 0.3 M NaCl, 0.1% CHAPS, and 0.15 M imidazole), then refold and concentrate by centrifugation at 5,000 x g at 4 °C using a centrifugal filter.\nThe protein concentration was adjusted to 10 μM and the solution kept at -80 °C until use.\n3. In vitro kinase assay\nNOTE: All steps are performed on ice to prevent the kinase reaction from proceeding. Additionally, the MLCK and substrate solutions are mixed separately to avoid an overly fast reaction.\nPrepare the following solutions and keep on ice:\n\t10x kinase buffer (200 mM HEPES, 10 mM CaCl2, 50 mM MgCl2, 0.1% Tween 20, pH = 7.5)\n\t100 mM DTT\n\t10 mM ATP\n\t500 nM calmodulin\n\t100 nM FLAG-tagged cMLCK\n\t24 µM His-tagged MLC2v\n\tNOTE: Recombinant proteins are diluted using 1x kinase buffer according to the indicated concentrations.\nPrepare 100 µL of the cMLCK master solution on ice in 1.5 mL tubes using the following ingredients:\n\t10 µL of 10x kinase buffer\n\t20 µL of 100 nM cMLCK\n\t20 µL of 5 µM calmodulin\n\t8 µL of 100 mM DTT\n\t42 µL of H2O\n\tNOTE: Each sample is diluted with 10x kinase buffer and distilled water and kept on ice.",
    "Prepare 30 µL of substrate solution in the 8 strip PCR tube on ice at each MLC2v concentration as described in Table 1. The final MLC2v concentrations are 0, 0.25, 0.5, 1, 2, 4, 8, and 12 µM.\n\tNOTE: Recombinant His-tagged MLC2v is diluted with 10x kinase buffer and distilled water. The volume of substrate solution is adjusted to 30 µL by adding water to obtain the appropriate MLC2v concentration.\nAdd 10 µL of the MLCK master solution to achieve a final reaction solution volume of 40 µL. The final concentration of each component in the kinase reaction is 20 mM HEPES, 1 mM CaCl2, 5 mM MgCl2, 0.01% Tween 20, 2 mM DTT, 150 μM ATP, 5 nM cMLCK, 250 nM calmodulin, and 0, 0.25, 0.5, 1, 2, 4, 8, or 12 μM MLC2v (pH = 7.5).\nMix well and spin down.\nIncubate the reaction samples at 25 °C for the indicated time.\nAfter incubation, measure kinase activity by phosphate-affinity SDS-PAGE or bioluminescent ADP detection assay.\n4. Phosphate-affinity SDS-PAGE\nNOTE: Phosphate-affinity SDS-PAGE was performed according to the manufacturer’s protocol (see Table of Materials).\nPour the gel for phosphate-affinity SDS-PAGE.\n\t\nMix stacking gel solutions as follows: 12% wt/vol acrylamide, 0.1% wt/vol SDS, 125 mM Tris-HCl (pH = 6.8), 0.1% wt/vol ammonium persulfate, and 0.5% vol/vol N, N, N’, N’- tetramethylethylenediamine.\nMix resolving gel solutions as follows: 12% wt/vol acrylamide, 30 µM Phos-tag acrylamide, 60 µM MnCl2, 0.1% wt/vol SDS, 375 mM Tris-HCl (pH = 8.8), 0.05% wt/vol ammonium persulfate, and 0.25% vol/vol N, N, N’, N’- tetramethylethylenediamine.\nPrepare sample for electrophoresis.\n\t\nAdd and mix 1 mM MnCl2 to the sample from the in vitro kinase reaction.\nPerform electrophoresis and Western blotting.",
    "Run the gel at 150 V for 80 min in running buffer (0.1% wt/vol SDS, 25 mM Tris, and 192 mM glycine).\nAfter electrophoresis, soak the gel in EDTA (+) transfer buffer (10 mM EDTA, 50 mM Tris, 380 mM glycine, 0.000375% wt/vol SDS, and 20% wt/vol ethanol) for 10 min and then in transfer buffer for 10 min.\nTransfer proteins to PVDF membrane at 15 V for 30 min in transfer buffer.\nRock the membrane continuously with non-fat dry milk for 30 min in RT. After blocking, wash the membrane 3x with TTBS (50 mM Tris, 150 mM NaCl, 0.001% Tween).\nSoak the membrane with the primary antibody (anti-MLC2v, 1:4,000; Abcam ab92721) overnight at 4 °C.\nWash the membrane 3x with TTBS (50 mM Tris, 150 mM NaCl, and 0.001% Tween).\nSoak the membrane with the secondary antibody (HRP-coupled goat anti-rabbit 1:8,000; Cappel, #55696) for 1 h at RT.\nWash the membrane 3x with TTBS.\nDetect and analyze proteins on the membrane.\n\t\nAdd ECL (Enhanced Chemi Luminescence reagent) detection reagent to the membrane for 1 min at RT.\nDetect the proteins on the membrane using a LAS-4000 at the optimal time.\nQuantify the phosphorylated and nonphosphorylated MLC2v, subtracting the background densitometry using ImageQuant TL software.\n5. Bioluminescent ADP detection assay\nNOTE: The bioluminescent ADP detection assay was performed according to the manufacturer’s protocol.\nStop the kinase reaction by adding 40 µL of ATP depletion reagent into the kinase assay reaction solution. Mix well and incubate for 30 min at RT.\nAdd 80 µL of ADP detection reagent. Mix well and incubate for 30 min at RT.\nMeasure the luminescence using a luminometer with a suggested maximum integration time of 0.5 s per well.\nConvert the luminescence intensity to ADP concentration using a calibration curve.",
    "Calculate the amount of phosphates used for MLC2v phosphorylation.\n\tNOTE: The total ADP produced during the kinase reaction is measured as described above. Background ADP, including cMLCK autophosphorylation, is measured based on a reaction without MLC2v, and the amount of ADP used for MLC2v phosphorylation is assessed by subtracting background ADP from total ADP.\n6. Data Analysis\nFit data to the Michalis-Menten equation using appropriate data analysis software. Data are expressed as mean ± standard deviation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}