{
  "id": 6229,
  "origin_website": "Bio",
  "title": "Enzymatic Assays and Enzyme Histochemistry of <em>Tuta absoluta</em> Feeding on Tomato Leaves",
  "procedures": [
    "Tuta absoluta larvae Cryo-sectioning (Video 1)<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Sample preparation and cryostat sectioning of Tuta absoluta larvae Collect Tuta absoluta larvae into 1.5 ml tubes and freeze them in liquid nitrogen.Pour a small volume of NEG-50 cryo-protector gel in a mold. Use a pills blister as a mold.Deposit the frozen larva in the mold and cover it with cryo-protective gel.Note: Make sure there are no air bubbles in the gel. Freeze the mold with the gel-included larva in liquid nitrogen until all the air bubbles are removed.Remove the frozen sample from the mold.Cover the surface of a pre-chilled cryostat specimen disc with NEG-50 gel. Deposit the frozen sample on the disc and place it in the cryostat chamber to freeze.Once all the gel is frozen, fix the specimen disc in the orientable specimen head.Set the section thickness to 16 μm and proceed to sectioning.Once it reaches the region of interest of the insect and you are able to see the digestive system of the larva, recover the section on a poly-lysine coated slide. Enzyme histochemistryIncubate the slide with 1 ml of the Histochemistry wash solution 1 for 2 min at room temperature to avoid macromolecules diffusion.Deposit 50 μl of the Histochemistry substrate solution on the cryo-section and incubate at 37 °C for 15 min in the dark.Wash the slide 5 times each with 1 ml of the Histochemistry wash solution 2. Keep the slides at -20 °C until you observe them under a microscope. You can keep the slides for several days at -20 °C.Total protein extractionDeposit one egg of Tuta absoluta on a fresh tomato leaf and incubate in a Petri dish with 2% agar (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828011716_8409.jpgFigure 1. Larva of Tuta absoluta in the third instar (L3) developing in a tomato leaf.",
    "The leafminer larva feeds and develops inside tomato leaves protected from predators and insecticides (Camera: Nikon D3200).Follow the larval development daily under a binocular stereomicroscope.Larvae of the first instar (L1) have a creamy yellowish color with a dark head and measure about 1.6 mm. Larvae of the second instar (L2) are about 2.8 mm long. In the third instar (L3), larvae become greener and increase their size reaching 4.7 mm. In the fourth larval instar (L4), it acquires a dorsal red colored band. In this last larval instar, it can reach 9 mm (Figure 2) (EPPO, 2011).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180828/20180828011746_4126.jpgFigure 2. Larvae of Tuta absoluta at different development instars. L1: first instar; L2: second instar; L3: third instar; L4: fourth instar. During its development, the larva becomes bigger and acquires a green color.One day after each molting, recover the larva and sacrifice it by freezing in liquid nitrogen.Pool about 40 mg of larvae of each instar in 1.5 ml microcentrifuge tubes.Grind larvae in liquid nitrogen.Homogenize the obtained powder in 200 μl of ice cold Protein extraction buffer.Centrifuge at 16,200 x g for 15 min at 4 °C.Recover the supernatant, mix it with 400 μl of 90% ice cold acetone and incubate at -20 °C for 2 h.Centrifuge at 16,200 x g for 10 min at 4 °C and discard the supernatant.Wash the pellet twice with 90% ice cold acetone and resuspend it in 100 μl of 0.5 M Tris buffer pH 8.Measure protein concentration in the crude extract by the Bradford method (Bradford, 1976).Preparation of trypsin and papain standard curvePrepare trypsin and papain standards: 0.5 μg/μl, 1.0 μg/μl, 1.5 μg/μl, 2.0 μg/μl, and 2.5 μg/μl.",
    "Add 50 μg of the substrate to the standards (BApNA to trypsin and PFLNA to papain), and make up the volume to 100 μl with trypsin or papain assay buffer, respectively.Incubate at 37 °C for 30 min.Measure absorbance at 405 nm with a spectrophotometer.Quantification of trypsin and papain contentMix 5 μg of protein extract, 50 μg of the substrate and up to 100 μl of trypsin/papain assay buffer.Incubate at 37 °C for 30 min.Centrifuge the tubes at 16,200 x g for 10 min at 4 °C and recover the supernatant.Measure absorbance at 405 nm with a spectrophotometer."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}