{
  "id": 4131,
  "origin_website": "Cell",
  "title": "Protocol for using fluorescent sensors targeted to endogenous proteins (FluoSTEPs) to measure microdomain-specific signaling events",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSplit GFP tagging of a POI\nTiming: 1 month\nThe purpose of this step is to generate a cell line where GFP11 is attached to a POI via CRISPR/Cas9. The details of this protocol apply to HEK293 cells (both T and A versions), thus some details such as confluency and transfection method may differ depending on your cells.\nNote: HEK293A cells are more adherent and flatter, and these properties are beneficial for live-cell imaging (Hurt et al., 2014[href=https://www.wicell.org#bib8]).\n(A) Plating and transfection of cells\nPlate HEK cells in 6-well plates at approximately 50% confluency.\nNote: Expression of FluoSTEP component 2 can alternatively be driven by an inducible promoter (e.g., TetOn) to achieve more precise control. To avoid overexpression of both the POI and the sensor, a stable cell line allowing for dose-dependent FluoSTEP expression can thus be generated, which can also be used as the target cell line for GFP11 tagging. In this case, GFP11-edited cells can be FACS selected using gain of GFP fluorescence in the presence of the inducer (see step 7 below).\nAfter 24 h, transfect each well with 1 μg of px459 plasmid encoding the customized gRNA and 20 pmol of ssDNA ultramer HDR template using Polyjet, following the manufacturer’s protocol. Transfection of multiple gRNAs into the same cell is possible and may increase the chances of successful knock-in. Leave one well untransfected as a negative control.\nThe next day, passage cells from each well into separate 60-mm dishes.\n(B) Selection of cells",
    "Critical: Prepare a puromycin selection curve prior to this step. To determine which puromycin concentration to use for selection, choose the lowest concentration of puromycin that achieves 99% cell death by day 3. Suggested concentrations to construct an initial puromycin selection curve: 0, 0.5, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 μg mL−1.\nCritical: Puromycin selection should be performed 1 day after passaging. If selection is performed sooner, the cells may be under too much stress from both passaging and puromycin, leading to false negatives. If performed after more than 1 day, gene-edited cells may grow more slowly than wild-type cells, thus allowing the overgrowth of wild-type cells in culture.\n1 day after passaging, add 1 μg mL−1 puromycin to each 60-mm dish (this concentration is specific to our HEK293 cells).\nWhen no viable cells remain in the non-transfected dish (around 2–3 days), exchange the media for puromycin-free media to ease the stress on the cells.\n1 day after relieving puromycin, passage and resuspend cells in FACS sorting buffer, which includes DAPI.\nUsing FACS, sort for DAPI-negative cells with the expected size (Figure 3[href=https://www.wicell.org#fig3]), and plate single cells into a 96-well plate with media containing 15 mg/L phenol red and 20% FBS.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/896-Fig3.jpg\nFigure 3. Example FACS workflow",
    "To identify cells with GFP11 successfully incorporated into the target genomic locus, puromycin (Puro)-selected cells are stained with DAPI and subjected to FACS to identify the DAPI− cell population. DAPI− cells can immediately be single-cell sorted into 96-well plates to obtain clones for expansion and sequencing. Alternatively, DAPI− cells can be transfected with a GFP1-10 expression plasmid, followed by FACS to select GFP+ cells. These cells should then be cultured and subjected to another round of FACS to select GFP− cells and avoid stable integration of GFP1-10, followed by single-cell sorting.\nNote: The absence of DAPI in cells is due to the cell membrane being intact, thus indicating that these cells survived puromycin selection.\nAlternatives: Transfection of a GFP1-10 expression plasmid into both gene-edited and wild-type cells (negative control) 1 day prior to FACS may allow for sorting of cells based on GFP fluorescence (Figure 3[href=https://www.wicell.org#fig3]). However, due to the expected low signal from a tagged protein expressed at endogenous levels, this strategy may be challenging. After sorting for GFP-positive cells, a subsequent negative FACS sort to select cells without GFP signal is necessary to prevent genomic integration of GFP1-10.\n3 weeks after incubation (may be longer depending on the doubling time of different cell lines), wells containing single-cell colonies should be nearly confluent.\nNote: Using media that contains phenol red allows for easy identification of wells containing single-cell colonies, as the color of the media will change from pink to yellow.\n(C) Genotyping of cells\nPassage single-cell colonies, keeping half for further expansion in 6- or 12-well plates in normal FBS concentrations and the other half for genomic DNA extraction using kits such as the DNeasy Blood & Tissue Kit (Qiagen).",
    "Perform PCR on the extracted genomic DNA using kits such as the Q5 High-Fidelity Kit (New England Biolabs) and with primers designed to amplify the target region of the GOI. Genomic PCR may be tricky and typically leads to multiple bands; for these issues, we refer the reader to Problem 1 in the troubleshooting portion of this protocol.\nTo evaluate the copy number of correct gene edits, PCR products should be gel extracted using kits such as the PureLink Quick Gel Extraction kit (Invitrogen), cloned into TOPO PCR vectors, and subjected to Sanger sequencing.\nNote: Some cell lines such as HEK293 cells are aneuploid; thus, it may be difficult to discern if cells are homozygous or heterozygous. Sequencing multiple TOPO PCR vectors allows for a rough estimation of the percentage of gene loci with successful knock-in of GFP11.\n(D) Imaging of cells to determine feasibility for FluoSTEP imaging\nCritical: The fluorescence signal must be clearly detectable above background autofluorescence before the use of FluoSTEPs. If no detectable signal is observed, we refer the reader to Problem 2 in the troubleshooting portion of this protocol.\nPassage cells that are identified to have successful knock-in, as well as wild-type cells, into 35-mm glass-bottom dishes at approximately 30% confluency.\n1 day after passaging, transfect 1 μg of GFP1-10 plasmid into both knock-in and wild-type cells via PolyJet.\nAlternatives: Other transfection reagents, such as Lipofectamine, may suffice as well depending on the specific cell type.\nImage cells 1 day after transfection.\nAspirate the cell media without touching the bottom of the dish, and wash twice with 1 mL of HBSS. Add 2 mL of HBSS for imaging.",
    "Mount the imaging dish on the microscope stage and image in the GFP channel. Use the GFP1-10-transfected wild-type cells as a guide for determining the autofluorescence background signal.\nCritical: After successful genotyping and phenotyping, freeze down multiple vials of the knock-in cells, referred to as FP11-cells throughout the rest of this protocol.\nLive-cell imaging of FluoSTEP sensors to measure native, microdomain-specific signaling\nNote: To increase cell adhesion especially for cell lines that easily detach (e.g., HEK), we recommend coating the imaging dish with poly-D-lysine (PDL). Reconstitute PDL in sterile water at a concentration of 0.1 mg/mL. Coat the 35-mm glass-bottom dish with 400 μL Poly-D-Lysine (PDL) (just enough to cover the imaging area) in a biosafety cabinet. Incubate the dishes with PDL for 30 min in a sterile, 37°C incubator and then wash 3 times with sterile PBS in a biosafety cabinet. Let the coated dishes dry for 30 min in a biosafety cabinet, and then wrap the dishes in parafilm and store at 4°C. As an alternative, 35-mm glass-bottom dishes pre-coated with poly-D-lysine can be purchased commercially.\nNote: To determine the influence of the microdomain on the measured activity/signaling, control experiments using untargeted biosensors containing the full donor fluorophore should be performed, similar to what was done previously (Tenner et al., 2021[href=https://www.wicell.org#bib16]).\n(E) Real-time imaging of FluoSTEP-expressing cells\nPassage FP11-cells and transfect 1 day later with 1 μg of the FluoSTEP probe of your choice.\nImage cells 1 day after transfection (wash and place cells in HBSS as above). Prepare drugs at 1000× stock concentration. Aliquot 2 μL of 1000× drug stocks into separate 1.5 mL tubes.\nNote: Store drug aliquots properly during imaging. Most drugs are best kept on ice, but this will depend on the specific compound.\nReal-time imaging of cells with acute stimulation.",
    "Critical: There are multiple factors to consider when choosing the parameters for real-time imaging of cells, especially FP11-cells, as there is a balance between obtaining enough fluorescence signal and minimizing photobleaching. Select appropriate excitation and emission filters for monitoring GFP and RFP fluorescence intensities, gain, ND filters, exposure times, and image acquisition interval. For example, our imaging used a 0.3 ND filter (50% transmittance), 500 ms exposure times for the FRET and GFP channel, and 30 s acquisition interval. In addition, select an appropriate objective lens to record imaging with sufficient detail. For example, higher-magnification objectives (e.g., ≥40×) are preferable for visualizing fluorescence signals localized to subcellular structures (e.g., plasma membrane, organelles, cytoskeleton, etc.). Details of our microscope system are provided in the Key Resources Table[href=https://www.wicell.org#key-resources-table] and the Materials and Equipment[href=https://www.wicell.org#materials-and-equipment] section.\nImage cells in 3 channels: green direct (GFP excitation and emission), red direct (RFP excitation and emission), and green-red FRET (GFP excitation and RFP emission).\nImage the cells for at least 5 min to acquire a baseline signal prior to the first drug addition.\nPause the imaging cycles to add the first drug to the dish that is fixed to the microscope stage: Use a P1000 micropipette to transfer ∼0.5 mL of HBSS from the imaging dish into a 1.5 mL tube containing an aliquot of 1000× drug stock; mix briefly, and carefully add the HBSS + drug mixture back to the imaging dish, mixing again (at least 3 times) to ensure homogeneous distribution of the drug. When adding a drug to the dish, pipet gently and away from the center of the dish to avoid displacing cells from the surface. Also, avoid directly touching the imaging dish when performing drug addition, as you may shift the microscope field of view.",
    "Critical: The cells may be subjected to significant shear stress from pipetting during acute drug addition. HEK cells are not as adherent as other cells and can easily detach from the imaging dish surface; therefore, using poly-D-lysine-coated imaging dishes is important to limit this effect. Alternatively, performing drug addition using a smaller volume of HBSS (e.g., 0.2 mL and a P200) may reduce shear stress.\nNote: The exact stimulation conditions will depend on the probe/activity being monitored. FluoSTEPs have been tested with adenylyl cyclase activators, phosphodiesterase inhibitors, and β-adrenergic agonists to induce cAMP and PKA signaling (FluoSTEP-ICUE and FluoSTEP-AKAR); growth factor stimulation to induce Akt or Erk signaling (FluoSTEP-AktAR or FluoSTEP-EKAR); stress induction to induce Jnk signaling (FluoSTEP-JNKAR); and G-protein coupled receptor stimulation to induce RhoA activity (FluoSTEP-RhoA) (Tenner et al., 2021[href=https://www.wicell.org#bib16]).\nRestart the imaging cycles and image the cells until the fluorescence signal reaches a stable plateau. Repeat for subsequent drug additions.\nNote: Imaging for at least 5 min before the first drug addition is required, as FluoSTEPs in our experience can exhibit significant baseline drift, mostly due to photobleaching of the donor fluorophore. Having a stable baseline emission ratio before any drug addition is critical to see the effect of the added drug."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell-Based Assays",
    "Signal Transduction",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}