{
  "id": 9518,
  "origin_website": "Jove",
  "title": "Design and Assembly of an Ultra-light Motorized Microdrive for Chronic Neural Recordings in Small Animals",
  "procedures": [
    "1. Overview of Components\nA complete microdrive consists of several main components (Figure 1): a chassis that serves as the superstructure for the drive, a motor with a finely threaded output shaft, a threaded shuttle that carries the electrodes and provides a point of electrical connection, and an Omnetics (or equivalent) connector.\nThe chassis, electrode shuttle, and electrode shuttle tubes are custom components that were designed with 3D CAD software (SolidWorks) and were machined by a local precision machinist. All other components are commercially available.\nChassis and shuttle are machined from lightweight polyetherimide (PEI), while the electrode shuttle tubes are cut to size with a lathe from stainless steel hypodermic tubing (0.0293\"OD x 0.00975\"ID). Though these components may be cut from other materials, we have found that PEI and stainless steel have the right balance of machinability, strength, and weight for our application.\nTo assemble the drive, a motor controller, capable of spinning the low DC-voltage stepper motor, is required. We employ a custom solution based on a three-phase motor driver IC (Faulhaber BLD05002 available from the manufacturer) in conjunction with an IC timer that provides the timestep-input. A variety of off-the-shelf solutions are also available (e.g. Faulhaber MCBL05002 or Sutter Instruments MP-285).\n2. Drive Chassis Preparation and Assembly\nWith fine diagonal cutters, trim the contact pins on the bottom of the Omnetics (or equivalent) connector - 1.5 mm for the rear row, 1 mm for the front row (Figure 2A). To improve the strength of the epoxy bond between the drive chassis and the connector, use a scalpel to roughen the rear surfaces of both components.",
    "Using a scalpel, cut four 15 mm long sections of polyimide tubing (0.0113\" ID x 0.0133\" OD) for use as wire guides. Carefully secure the chassis in a small vice with the open cavity down (Figure 2B). Use cyanoacrylate glue to attach the polyimide tubes to the chassis. They should lay flush with the rear chassis surface and be oriented parallel to each other as shown in Figure 2B.\nOnce dry, trim the polyimide tubes to approximately 6 mm in length and remove the waste sections. The remaining tubes should be approximately 3 mm from the bottom edge of the chassis.\nTo ensure proper clearance for mating with the headstage or cable, the connector should be mounted a few millimeters above the polyimide tubes and be parallel with the chassis surface (Figure 2B). Use epoxy (Torr Seal) to construct a small pedestal for the connector, place it on top with the shorter row of pins topmost, and add more epoxy around the connector. Do not proceed until the epoxy has completely cured.\nRemove the chassis from the vice, transfer to a jig that allows for connection to the motor controller (i.e., in our case, this jig is simply a rigid rod with the mating Omnetics connector affixed to one end) and orient with the front surface of the drive facing up. Guide the motor wires through the hole in the chassis and slide the motor into the groove in the base. The motor and drive shaft should be parallel to the chassis and fit snuggly against the bottom and side.\nEpoxy the motor to the chassis, taking care not to obstruct either the drive shaft or the space where the electrodes will be installed (see Torr Seal placement in Figure 4). Allow the epoxy to cure.",
    "Rotate the chassis so that the connector is accessible. To support the motor wires and prevent accidental breakage, add a small drop of fast-set epoxy to the wires where they emerge from the chassis. Trim, strip, and solder the wires to the appropriate contacts on the connector (Figure 2A). Test the motor to ensure smooth shaft rotation in both directions.\n3. Electrode Shuttle Assembly\nTo minimize the potential for motion-induced artifacts in the recordings, it is essential that the electrode shuttle fit snuggly in the chassis. Test the fit of the shuttle by threading it onto the motor shaft and running it up and down the full length of the shaft at low speed. Be careful not to wedge the shuttle in the drive and thus over-torquing the motor- it is very easy to permanently damage the plastic gearhead at this stage. If a previously spinning motor shaft ceases turning, the gearhead may be damaged.\nIf the shuttle does not run smoothly down the shaft, inspect the chassis surfaces and the drive screw for debris. Remove with fine forceps or compressed air, coat the threading in some light mineral oil and recheck the shuttle fit.\nIf the shuttle is too tight, use forceps and a fine grain whetstone to remove obstructing material from the side of the shuttle. Take care to remove the material evenly.\nIf the shuttle is too loose such that it tilts and chatters during travel, glue a small sliver of transparency film to the shuttle to fill the gap between it and the chassis surface.",
    "Once the shuttle has been properly fit, remove the shuttle from the shaft and press one of the stainless steel shuttle tubes into each of the four large holes in the shuttle. Each should be centered on the shuttle with the ends of all four tubes flush (Figure 3). Secure them with a small drop of cyanoacrylate glue applied to the base of the tube. Be very careful not to allow the glue to get on the edges of the shuttle or into the tubes.\nThread the completed electrode shuttle back on to the drive shaft and bring it all the way down to the base of the threading.\n4. Guide Tube and Electrode Installation\nCut four 25 mm long sections of polyimide tubing (0.0045\" ID x 0.006\" OD) for use as electrode guides. In addition, cut four electrodes to 40 mm sections for use as dummy electrodes which will hold the guide tubes in position during assembly. (Note that these dummy electrodes are for assembly only and will not be used for recording, so you may reuse the same ones for each assembly.) Slide each section of tube onto on to a dummy electrode such that the electrode extends ~10 mm beyond the end of the tube.\nArrange each of the polyimide tubes in the chassis as shown in Figure 4A. This will result in the ends of the electrode guides, flush with each other and aligned to the base of the motor shaft, splaying out toward the electrode shuttle and the opposite ends converging at the bottom of the drive. Mix a small amount of Kwik-Cast and apply approximately 2 mm below the top end of the electrode guides. Allow to dry.",
    "Remove the dummy electrodes and reposition the free ends of the electrode guides such that they form a tight bundle at the bottom of the drive. It may be helpful to use a fine wire to hold them in place temporarily (Figure 4B). Fix the new position with more Kwik-Cast. Allow to dry.\nWith a sharp scalpel, trim the electrode guide tubes where they extend beyond the bottom of the microdrive. When implanted, these tubes will guide the electrodes from the bottom of the drive (resting on the skull) to the surface of the brain. Thus, the length at which the tubes should be trimmed depends on the anatomy of the implantation site (Figure 5). For songbirds, this is approximately 1.5 mm.\nTo connect an electrode to the connector, cut a 30 mm long section of insulated platinum wire (0.003\" dia.) and strip 1 mm of insulation from one end. Solder it to one of the signal pins on the connector. Bend the wire under the connector and push it through one of the wire guide tubes. Pull the wire taunt and wrap it around the guide slot in the top of the chassis.\nWith scissors or fine wire cutters, cut an electrode to ~25 mm in length. Take care to do this without bending the electrode or damaging the tip; if either occur, the electrode cannot be used. With the electrode shuttle now at the top of the shaft, insert the electrode into a polyimide tube and pull it up through the stainless steel tube in the shuttle. Position it such that the tip of the electrode is flush with the bottom end of the polyimide tube. Trim the electrode 1 mm above the shuttle tube.",
    "With a fine set of forceps, strip the insulation off the last 2 mm of the electrode and the last 2 mm of the platinum wire. Reposition the electrode in the shuttle tube, insert the platinum wire into the tube, and pin the two together by sliding a short 1 mm section of tungsten wire (0.008\" dia) into the tube. This should be a tight fit that will provide both a mechanical and an electrical connection between the electrode and the wire (Figure 3).\nRun the shuttle up and down the length of the drive shaft to ensure continued movement.\nRepeat 4.5-4.8 until all electrodes have been installed.\nCut a 30 mm long section of silver wire (0.005\" dia) for use as a ground wire. Strip 1 mm of insulation off one end and solder to the ground pin.\n5. Final Assembly and Pre-Implantation Preparation\nTo reduce the friction of the electrodes against the guide tubes, fill the guide tubes with light mineral oil. Capillary action is sufficient to fill the tubes from a drop of oil placed at one end.\nTo create a protective cover for the motor and electrodes, cut a 12 mm x 25 mm rectangle of transparency and fold it into a wide U-shape. Use cyanoacrylate to glue the cover to the outer surfaces of the chassis (Figure 6). Cut a 15 mm x 6 mm rectangle of transparency and use cyanoacrylate to glue it around the connector. To prevent interference with the connector, the long edge of the transparency should be flush with the top edge of the connector.\nPrior to implantation, sterilize the electrodes and guide tubes by lowering the extended electrodes into a 10:1 DI water-bleach solution for 10 min. Then, flush thoroughly with sterile water.",
    "A jig similar to that used in step 2.5 can be used to hold the microdrive in a stereotaxic manipulator during implantation.\n6. Representative Results\nThis protocol requires approximately 5 hr of hands-on assembly time with an additional 6-8 hr interspersed for the epoxy and glue to dry. However, once the microdrive has been assembled the first time, it can be prepared for reuse (i.e., the electrodes, electrode guide tubes, and electrode wires can be replaced) in less than 2 hr. The quality and character of the recordings obtained by following this protocol will, of course, be in part dependent on the recording target, the choice of electrodes, and any processing performed at the headstage or further upstream of the microdrive. This aside, it is possible to obtain stable recordings from a behaving animal over a time-span of more than ten weeks. Examples of single unit recordings from the robust nucleus of the archistriatum (RA) in a behaving songbird is shown in Figure 7A; multi-unit activity from the same region is shown in Figure 7B.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig1.jpg\nFigure 1. 3D model of the assembled motorized microdrive. The microdrive consists of several major components: (i) the chassis, (ii) motor with threaded output shaft, (iii) electrode shuttle, (iv) shuttle tubes, (v) electrodes, (vi) electrode guide tubes, and (vii) connector.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig2.jpg\nFigure 2. A) Model and connection diagram for the connector. Motor wires: b, i, l. Electrode wires: c,d,e,f. Ground wire: k. All other pins available for auxiliary instrumentation. B) Photo of the connector attached to the chassis with Torr Seal epoxy. Note the position of both the connector and the underlying wire guide tubes. The cyanoacrylate glue holding the guide tubes in position dries clear and, thus, is not visible in the image.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig3.jpg\nFigure 3. Electrode shuttle assembly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig4.jpg",
    "Figure 4. A) The electrode guide tubes positioned in the chassis prior to applying Kwik-Cast. B) To ensure that the electrodes exit the bottom of the drive in parallel, bring the bottom end of the guide tubes into a tight bundle before adding the last drop of the Kwik-Cast.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig5.jpg\nFigure 5. The amount that the electrode guide tubes extend beyond the bottom of the drive is specified by the anatomy of the implantation site. The diagram illustrates the dimensions that are relevant for determining the length of the guide tubes. For implanting in the songbird, 1.5 mm is sufficient.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig6.jpg\nFigure 6. The finished motorized microdrive with protective covers attached.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4314/4314fig7.jpg\nFigure 7. Representative recordings from the robust nucleus of the archistriatum (RA) in the behaving zebra finch. A) Single-unit activity recorded with 10MΩ platinum-iridium electrodes. Top: example recording made one week after implantation. Bottom: example recording from the same electrode as above, nine weeks later. B) Multi-unit activity recorded with 1MΩ platinum electrodes.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4314/4314fig7large.jpg].\nAdditional Files: The chassis, shuttle, and electrode tubes were designed with SolidWorks 2010 CAD software. These part files are provided in both the proprietary (*.sldprt) and vendor-neutral (*.iges) formats and dimensioned production drawings are provided in PDF format.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}