{
  "id": 15510,
  "origin_website": "Jove",
  "title": "Continuous Fluorescence-Based Endonuclease-Coupled DNA Methylation Assay to Screen for DNA Methyltransferase Inhibitors",
  "procedures": [
    "1. Prepare assay solutions for the screen\nNOTE: The concentrations of substrates used in this assay can be adapted. For RFTS-lacking DNMT1, the experimentally determined Km values for the hairpin DNA substrate and SAM are 1–2 nM and 2 µM, respectively26,40.\nPrepare 600 µL of each assay condition being tested in microcentrifuge tubes on ice.\n\tNOTE: The total volume of assay solution needed depends on the number of replicates being conducted. Each assay condition was run in triplicate for this protocol.\n\t\nAdd ddH2O and 5x methylation buffer (250 mM Tris pH 7.5, 5 mM MgCl2, 500 mM potassium glutamate, 5 mM dithiothreitol (DTT), 25% glycerol) to each tube to achieve a final concentration of 1x buffer. For assays containing 20 µM compound, add 472 µL of ddH2O and 120 µL 5x buffer. For assays containing 50 µM compound, add 470 µL of ddH2O and 120 µL of 5x buffer.\nAdd 3.15 µL of 20 mg/mL bovine serum albumin (BSA) to each sample.\nAdd 2 µL of 3.15 µM hairpin DNA substrate and 1.33 µL of 4.75 mM SAM to each sample.\n\t\tNOTE: The concentration of substrates in the assay solution mixture is 1.05x the desired final concentrations.\nAdd inhibitor to a final concentration of 21 µM (1.26 µL of 10 mM) or 52.5 µM (3.15 µL of 10 mM) to the appropriate samples. Add an equivalent amount of dimethylsulfoxide (DMSO) to a control sample.\n\t\tNOTE: The concentration of inhibitor used in the screen can be varied. The maximum final DMSO concentration should be ≤5% (v/v). DMSO concentrations up to 5% (v/v) have no effect on the activity observed in the assay26.",
    "Mix the solutions by vortexing (3,000 rpm) for 3 s. Spin the samples for a few seconds in a tabletop mini centrifuge (1,200 × g) to ensure that the solution is collected at the bottom of the tube.\nAliquot 95 µL of each assay solution into 6 consecutive wells in a black half-area 96-well plate (Figure 2).\n\tNOTE: These screening assays were performed in two batches. First, 20 µM inhibitor samples (4 total conditions) were examined, followed by the 50 µM inhibitor samples (4 total conditions).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62949/62949fig02.jpg\nFigure 2: Assay plate setup. Each assay solution is aliquoted into six wells in the black 96-well plate: DMSO control (blue), compound 1 (green), compound 2 (red), and compound 3 (yellow). Both RFTS-lacking DNMT1 and Gla I will be added to three wells. As a control, Gla I alone will be added to the other three wells. Abbreviations: RFTS = Replication Foci Targeting Sequence; DNMT1 = DNA methyltransferase 1; DMSO = dimethylsulfoxide. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62949/62949fig02large.jpg]\n2. Prepare enzyme solutions for screen\nNOTE: RFTS-lacking DNMT1 can be expressed in E. coli and purified to homogeneity. Expression and purification procedures for RFTS-lacking DNMT1 have been described previously41. The volume of enzyme needed depends on the number of assays being conducted. Here, four different assays are being performed in each set; each assay is completed in triplicate.\nPrepare 75 µL of each enzyme solution in microcentrifuge tubes on ice.\n\tNOTE: Two enzyme solutions will be needed. One solution will contain DNMT1 and Gla I; the other will contain only Gla I.",
    "Add ddH2O and 5x methylation buffer (250 mM Tris pH 7.5, 5 mM MgCl2, 500 mM potassium glutamate, 5 mM DTT, 25% glycerol) to each tube to achieve a final concentration of 1x buffer. For the Gla I enzyme solution, add 15 µL of 5x buffer and 58.8 µL ddH2O. For the DNMT1+Gla I enzyme solution, add 15 µL of 5x buffer and 58.2 µL ddH2O.\nAdd 1.2 µL of 10 U/µL Gla I to each solution for a final concentration of 0.16 U/µL.\nAdd 0.6 µL of 5 µM RFTS-lacking DNMT1 for a final concentration of 40 nM to the DNMT1+Gla I solution.\nTap gently to mix the solutions. Spin the samples for a few seconds in a tabletop mini centrifuge (1,200 × g) to ensure that the solution is collected at the bottom of the tube.\nAliquot 12 µL of each enzyme solution into 6 wells in a conical-bottomed 96-well plate (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62949/62949fig03.jpg\nFigure 3: Enzyme plate setup. The Gla I (grey) and DNMT1+Gla I (blue) solutions are each aliquoted into six wells in the 96-well plate. Using a multichannel pipet, the enzyme can be added to a row of assay solutions simultaneously. For each assay condition (six wells), three wells will receive DNMT1+Gla I, and three wells will receive Gla I alone. Abbreviation: DNMT1 = DNA methyltransferase 1. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62949/62949fig03large.jpg]\n3. Run the assay and analyze the data.\nPreheat the plate reader to 37 °C. Insert the black plate containing the assay solutions. Shake the plate (double orbital at 425 cpm for 5 s) and read the fluorescence with an excitation wavelength of 485 nm and an emission wavelength of 528 nm. Incubate the plate at 37 °C for 5 min.",
    "NOTE: Alternatively, filters with proper wavelength cutoffs can be used for the fluorescence readings.\nRemove the assay plate. Add 5 µL of enzyme solution to each well and mix by pipetting up and down.\n\tNOTE: Use multichannel pipets so that a row of samples can be initiated simultaneously.\nInsert the plate into the plate reader. Record fluorescence every 53 s for 30 min. Shake the plate (double orbital at 425 cpm for 4 s) before each reading.\nAverage triplicate Gla I control assays for each condition. Subtract the average Gla I-containing control reaction trace from the triplicate traces obtained in the presence of RFTS-lacking DNMT1. Determine the average and standard error of the mean for the corrected replicates.\nPlot the average corrected reaction trace and fit the initial linear portion to a line to determine the initial velocity.\nDetermine the percent activity by dividing the velocity observed in the presence of a compound by the velocity observed in the DMSO-containing control reaction and multiplying by 100.\n4. Additional assay control — sequential addition of enzymes\nPrepare 550 µL of assay solution in a microcentrifuge tube on ice. Add 110 µL of 5x methylation buffer, 3.88 µL of 3.15 µM hairpin DNA substrate, 6.43 µL of 47.5 mM SAM, 3.06 µL of 20 mg/mL BSA, and 426.6 µL of ddH2O.\nMix the solution by vortexing (3,000 rpm) for 3 s. Spin the samples for a few seconds in a tabletop mini centrifuge (1,200 × g) to ensure that the solution is collected at the bottom of the tube.\nAliquot 90 µL of the assay solution into 6 consecutive wells in a black half-area 96-well plate.",
    "Prepare the DNMT1 enzyme solutions on ice. Add 4 µL of 5x methylation buffer, 0.76 µL of 5 µM RFTS-lacking DNMT1, and 15.24 µL of ddH2O to one tube. Add 4 µL of 5x methylation buffer and 16 µL of ddH2O to another tube.\nTap gently to mix the solutions. Spin the samples for a few seconds in a tabletop mini centrifuge (1,200 × g) to ensure that the solution is collected at the bottom of the tube.\nAdd 5 µL of the DNMT1-containing solution to three wells in the black half-area 96-well plate. Add 5 µL of the buffer control solution to the other three wells.\nPlace the microtiter plate into the plate reader preheated to 37 °C. Shake the plate (double orbital at 425 cpm for 3 s) and read the fluorescence with an excitation wavelength of 485 nm and an emission wavelength of 528 nm. Repeat the shake and read every 60 s for 30 min.\nWhile the assay plate is in the plate reader, prepare the Gla I solution on ice. Add 8 µL of 5x methylation buffer, 0.64 µL of 10 U/µL Gla I, and 31.4 µL of ddH2O to a microcentrifuge tube. Tap gently to mix the solution. Spin the sample for a few seconds in a tabletop mini centrifuge (1,200 × g) to ensure that the solution is collected at the bottom of the tube.\nAliquot 6 µL of the Gla I solution into 6 wells in a conical-bottomed 96-well plate.\nFollowing the initial 30 min read, remove the black plate from the plate reader. Add 5 µL of Gla I solution to all 6 wells and mix by pipetting up and down.\n\tNOTE: Use a multichannel pipet so that all wells can be initiated simultaneously.",
    "Place the black plate back into the plate reader. Record fluorescence every 35 s for 35 min. Shake the plate (double orbital at 425 cpm for 3 s) before each reading.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}