{
  "id": 3941,
  "origin_website": "Cell",
  "title": "Standardized flow-cytometry-based protocol to simultaneously measure transcription factor levels",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFlow cytometry panel design\nTiming: 1–2 h\nThis protocol assumes the user has basic knowledge and ability to design flow cytometry panels. However, there are a few specific features of panel design that will be detailed here.\nDesign flow cytometry panel as needed for both cell surface markers and intranuclear targets.\nNote: When selecting antibody-conjugate combinations, the brightest fluorophore(s) should generally be reserved for transcription factors.",
    "Note: When selecting transcription factor antibody-fluorophore combinations, it can be incredibly helpful to limit the selection of these to non-tandem dye combinations. This is due to the compensation requirement. When compensating, the user has two options: using antibody capture beads or cells. The authors opted for the use of cells for three reasons. First: the use of antibody capture beads can often lead to compensation control staining that is several logs brighter than the actual stain in the panel, potentially causing overcompensation. Additionally, the negative bead population is not representative of the negative cellular population. Second: most live/dead discrimination dyes cannot be used with antibody capture beads (as they are not antibodies), resulting in the use of both cells and beads during compensation. Third: compensating with cells allows for more accurate levels of positive and negative fluorescence to be accounted for and reveals basal cellular autofluorescence. When compensating, a single-stained compensation control is required for each antibody in the panel. However, transcription factor staining can be very dim and make for a poor compensation control. To circumvent this issue, a surrogate compensation control can be used for those fluorophores. This is done by using a different antibody that has the same fluorophore as the transcription factor antibody for the compensation control. To prevent potential overcompensation, using a surrogate compensation control that is 0.5–1 log brighter than the transcription factor antibody is optimal.\nCritical: Surrogate compensation controls only work when using non-tandem fluorophores, as there is equivalence between them. Tandem fluorophore combinations can vary enormously between vendors, lots, and individual preparations and cannot be used in a surrogate situation. Refer to the manufacturer’s product information for each antibody to determine if it is a tandem or not.",
    "Example: mouse anti-human PU.1 IgG1, κ Alexa Fluor 647® transcription factor antibody could have a surrogate compensation control in the form of mouse anti-human CD3 IgG1, κ Alexa Fluor 647® antibody (titered to ensure the fluorescence expression is 0.5–1 logs brighter than the transcription factor antibody).\nCritical: When titrating the antibodies to be used (see reagent preparation and testing[href=https://www.wicell.org#sec1.1], above), it is imperative that the titration be performed using the same reagents and permeabilization kit(s) that the experimental panel will utilize in order to ensure the antibody-fluorophore conjugates withstand the fixation and permeabilization steps.\nDesign isotype control panel variants for transcription factors.\nFor each full staining panel, an additional panel with isotype controls in place of the transcription factor antibodies must be used.\nNote: This standardization protocol makes use of isotype controls to accurately measure levels of transcription factors by flow cytometry. The isotype controls allow for normalization of the output data by controlling for non-specific binding and inherent background staining common among transcription factor antibodies.\nCritical: When using isotype controls (for any application), several rules must be followed to ensure proper readout of the data:\nFirst, the antibody isotype of the isotype control, and its host species, must be identical to the primary antibody.\nExample: Mouse anti-human PU.1 IgG1, κ primary antibody needs to be paired with a mouse IgG1, κ isotype control antibody.\nSecond, the antibody-fluorophore conjugation of the isotype control must be identical to that of the primary antibody.",
    "Example: Mouse anti-human PU.1 IgG1, κ Alexa Fluor 647® needs to be paired with a mouse IgG1, κ Alexa Fluor 647® isotype control. Similar, but not identical pairings destroy the integrity of this standardized protocol (i.e., an APC isotype control paired with an Alexa Fluor 647® antibody or an Alexa Fluor 488® isotype control paired with a FITC primary antibody is forbidden).\nThird, the isotype control must be used at the same protein concentration as the primary antibody.\nExample: Mouse anti-human PU.1 IgG1, κ Alexa Fluor 647® is used at 1 μg per stain. The mouse IgG1, κ Alexa Fluor 647® isotype control must be used at the same concentration. It is worth noting that often, but not always, isotype control antibodies are provided at a higher concentration than many primary antibodies, requiring a different dilution to achieve the same protein concentration.\nPanel testing and flow cytometer standardization setup\nTiming: 6–8 h (one-time setup)\nThis setup step prepares the cytometer for standardized use with the optimized flow cytometry panel(s) designed by the user.\nNote: Portions of this setup step are simplified from previously published protocols (Perfetto et al., 2012[href=https://www.wicell.org#bib4]) and (Perfetto et al., 2006[href=https://www.wicell.org#bib3]).\nUsing primary cells of the same type that will be experimentally evaluated, stain the cells using the standardized protocol outlined in the sections below.\nIf possible, test stains across multiple individuals/sources to account for minor staining variability within patients/individual sample sources.\nInclude appropriate isotype controls as separate stains.\nCollect the data on the flow cytometer and immediately analyze.\nAssess if the panel allows for clean separation of cellular population(s), resolution of transcription factor(s), isotype controls that are negative, and appropriate compensation values.",
    "Upon validation of the test panel(s), the cytometer can now be further setup for standardized analysis (performed on the same day immediately following step 5):\nPrepare a worksheet template on the flow cytometer for the fluorescent beads (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/662-Fig1.jpg\nFigure 1. Flow cytometer standardization bead worksheet template\nThe beads are first gated on FSC-A vs. SSC-A (Gate 1). Next, a histogram of the beads for the channel closest to SSC is created. Gating tightly on the main bead peak in the histogram eliminates bead aggregates (Gate 2). Additional histograms of each remaining fluorescent parameter are then created (easily sorted by laser). A statistics view is then created evaluating the MFI for each fluorescent channel based off Gate 2. As the beads are acquired, the cytometer voltages/gains are adjusted until the MFI from Gate 2 matches the Target MFI (as determined during the initial setup). Beads are then recorded and the voltage/gain values applied to that day’s flow cytometry experiment.\nSet the voltages/gains of each channel to that used in step 4, above.\nPrepare the beads by adding 2–3 drops to 1 mL 1× PBS or flow cytometer sheath fluid.\nLoad the beads on the machine and begin acquiring events with a flow rate of approximately 150–250 events per second.\nIn the cytometer worksheet, create a graph of forward scatter area (FSC-A) vs. side scatter area (SSC-A) and draw a gate around the beads (Gate 1).\nNote that only the FSC and SSC voltages can be changed at this point to ensure visualization of the beads.\nCreate a histogram plot (as child graphs from Gate 1) for the fluorescent channel/detector on the cytometer that is closest to SSC.",
    "Check the cytometer’s configuration to determine the channel closest to SSC. For most machines, SSC is collected on the 488 nm (blue) laser, indicating that the channel that detects the lowest wavelength on the 488 laser should be selected at this step. This channel is typically designated as FITC, GFP, 488B, etc.\nOn the histogram of the channel closest to SSC, draw a gate around the main bead peak only (Gate 2), avoiding any smaller side peaks (indicative of bead doublets/aggregates)\nThis step ensures evaluation of single bead events.\nCreate a series of histogram plots (as child graphs from Gate 2) for each remaining fluorescent channel on the cytometer (from all lasers).\nCreate a statistics view within the worksheet that evaluates the median fluorescent intensity (MFI) statistic of each channel on the flow cytometer based on Gate 2 (the single beads gate).\nRecord 10,000 events.\nWithin the worksheet, or on a master document, record the MFI for each channel following the bead acquisition.\nThese MFI values are the target values to be obtained each day prior to flow cytometer acquisition for this protocol.\nNote that the target MFI values can be rounded to the nearest multiplier of 50 (i.e., an MFI of 15,256 could be rounded to 15,250).\nExport/save the bead template and channel/detector MFI values.\nDaily flow cytometer setup prior to collecting samples\nTiming: 5–15 min\nThis daily step prepares the flow cytometer for standardized event collection.\nEach day, before running any samples using this protocol:\nLoad the bead template and a new tube of flow cytometer setup beads on the machine.\nAcquire, but don’t record, the beads at approximately 150–250 events per second.\nAdjust the voltage/gain for the channel closest to SSC until the target MFI is reached when Gate 2 is properly placed.",
    "Adjust the voltages/gains for each remaining channel on the cytometer until the target MFI values (as previously determined) for each channel are reached.\nNote: The voltages/gains flow cytometers use are arbitrary values that can vary day-to-day. The power of this protocol is to set each channel/detector to a specific fluorescence sensitivity value that can be exactly recapitulated each day.\nRecord 10,000 events.\nThe exact voltage/gain values determined during this step are to be used for that day’s flow cytometry experiments ran under this protocol (and cannot be carried forward to any other day’s experiments).\nNote: As mentioned above and throughout, any changes to any part of this protocol will affect the target MFI values and data integrity.\nCritical: This protocol relies on the stable use of a single flow cytometer. If a different cytometer is used, or if the current cytometer undergoes major changes, the above steps will need to be repeated. Some examples of major cytometer changes include, but are not limited to; addition of new laser(s), replacing existing lasers, changes to laser power thresholds, alternate/different filter sets, changes to channels/detection components, and major preventative maintenance that affects the fluorescence detection. Ideally, a bridging study can be conducted to update new MFI target values before continuing with new experiments (this may not be appropriate for all changes, such as laser replacement). This is accomplished by, on the day the machine is undergoing changes, performing the daily bead setup prior to change, recording the daily voltages, and re-running the daily bead setup after changes have been made with the same voltages to obtain the new MFI targets.",
    "Critical: If new lot of antibodies, new antibody titers, new panel design, addition or deletion of antibodies from the panel, or new bead lots are to be used, the above must be repeated to ensure proper standardization. As mentioned above, completing a bridging study between current and new experimental parameters will allow for quick and easy updating of the standardized values.\nExample 1\nA new lot of an antibody is to be used. Titrate the new antibody lot as normal. In the same staining procedure, include an additional sample that uses the current antibody lot at its current titer. Upon analysis, compare the newly titrated antibody against the previous lot and select the titer that matches the fluorescence expression level of the current antibody lot. Experiments can now continue.\nExample 2\nA new lot of the flow cytometer setup beads is to be used. Prepare a tube of the current and new flow cytometer beads. Use the current lot to adjust all voltages to obtain the current MFI target values for each channel. Then, load the new bead lot and record 10,000 events. Update the target MFI values as needed with those obtained from the new bead lot.\nNote: Continually titrating new antibody lots and updating bead lot targets is a common feature of this protocol. To alleviate some of this work, consider obtaining appropriate volumes of reagents that are from the same lot for the duration of the study.\nStaining cells for transcription factor expression level and comparative determination across multiple time points via standardized flow cytometry\nTiming: 4–6 h\nThe following steps detail the exact staining procedure for transcription factor staining.",
    "Note: Variations to staining protocols are common and may need to be modified for each user’s exact application. However, following testing and determination of the staining protocol to use, no deviations from that protocol are allowed to maintain the integrity of the standardization. The protocol presented below reflects that which was used in (Manso et al., 2021[href=https://www.wicell.org#bib1]) and (Manso et al., 2019[href=https://www.wicell.org#bib2]) for freshly isolated, primary human bone marrow cells.\nNote: Keep all reagents and cells on ice (4°C) unless otherwise indicated.\nNote: This step assumes the user begins with a single-cell suspension of the cells of interest. There are a variety of methods used to generate single-cell suspensions and considerations including tissue source and cellular population(s) of interest dictate the method used.\nDetermine the number of cells required for each staining panel.\nThis includes both the full stain panel and the paired isotype control panel.\nThe author’s utilized 5x106 cells per individual stain (10x106 total for stain and isotype control panels) as they were targeting rare cell populations (see (Manso et al., 2021[href=https://www.wicell.org#bib1])).\nNote that this number can be adjusted to the user’s requirements, but should remain constant throughout the entire use of this protocol to maintain standardization.\nCount viable cells and remove an appropriate volume to obtain the live cell numbers required.",
    "Critical: When performing retrospective studies that utilize cryopreserved samples, the amount of dead cells and debris will, on average, be greater than that of a freshly prepared sample. Therefore, the user is encouraged to prepare cryopreserved samples in such a way that will eliminate as many dead cells as possible prior to staining and apply sample exclusion criteria for samples with higher than average cell death upon thawing and reconstitution. Additionally, cryopreservation may alter the expression of cellular proteins, so the user is cautioned to validate any comparisons made between fresh and cryopreserved samples.\nPlace cells in a 50 mL conical tube and add 5–10 mL flow cytometry staining buffer.\nSpin cells at 700 xg (RCF) for 5 min at 4°C.\nDecant supernatant.\nRe-suspend the cell pellet(s) in 300 μL/108 cells of flow cytometry staining buffer.\nAdd 100 μL/108 cells of Human Fc block, mix well, and place on ice (4°C) for 20 min.\nNote, different blocking reagents can be used and may require different volumes and ratios. However, as with any modification, once determined, those values cannot change to maintain standardization.\nCritical: Fc receptor blocking is an absolute requirement for this protocol (and for most flow-cytometry-based experiments).\nAdd 20 mL flow cytometry staining buffer to the sample(s).\nSpin cells at 700 xg (RCF) for 5 min at 4°C.\nDecant supernatant.\nRe-suspend samples at 25x106 cells/mL in flow cytometry staining buffer.\nPlate 200 μL cells (5x106) into the appropriate wells of a labeled round-bottom 96-well plate.\nFor example, if one panel is being stained for, one well needs to be plated for the staining panel and a second well for the paired isotype control panel (per sample).\nUsing remaining/extra cells, plate approximately 1–5x106cells/well for compensation controls.",
    "A single-stained compensation control is required for each antibody-fluorophore combination and dye in the panel. This includes:\nUnstained cells.\nFixable viability dye (FVD).\nEach cell surface antibody.\nEach transcription factor antibody.\nNote: See comments in Flow cytometry panel design (above) for notes about compensation controls for transcription factor antibodies.\nSpin plate at 700 xg (RCF) for 3 min at 4°C.\nFlick plate to remove supernatant.\nNote: To appropriately flick the plate, quickly invert the plate and flick once with the wrist using one fluid motion. While still inverted, blot the plate on a stack of paper towels to remove excess liquid.\nPrepare fixable viability dye (FVD) live/dead discrimination dilution:\nEach well requires 100 μL FVD working solution.\nMake enough to have 2 wells extra.\nIn an appropriately sized tube, add 1× PBS following this formula:\n[Number of sample wells + 2] × 100 μL = total volume 1× PBS.\nDilute stock FVD to the manufacturer’s recommended dilution (refer to the manufacturer’s technical data sheet).\nExample: the FVD used in (Manso et al., 2021[href=https://www.wicell.org#bib1]) and (Manso et al., 2019[href=https://www.wicell.org#bib2]) required a 1:1000 dilution, adding 1 μL stock FVD for every 1 mL 1× PBS.\nNote: Fixable viability dyes work by staining free amine groups found in proteins. Therefore, buffers that contain protein (such as flow cytometry staining buffer) may quench or diminish dye staining. A protein-free buffer, such as 1× PBS, should be used at this step.\nNote: Many live/dead alternatives exist and may have additional and/or different staining requirements. As with everything else, once a live/dead dye has been selected, it and its application cannot be changed to maintain the standardization integrity.\nCritical: Live/dead staining is an absolute requirement for this protocol (and for most flow-cytometry-based experiments).\nRe-suspend each sample well in 100 μL FVD solution, mixing the cells well.",
    "Re-suspend the FVD compensation well in 100 μL FVD solution.\nRe-suspend all other compensation wells in 100 μL 1× PBS.\nIncubate protected from light on ice (4°C) for 20 min.\nPrepare cell surface staining panel(s):\nIn a tube of an appropriate size, add flow cytometry staining buffer and the correct volumes of each cell surface staining antibody such that each well will get 100 μL staining cocktail with the appropriate final titer of antibodies. Mix well and keep protected from light at 4°C until use.\nNote: Being as accurate as possible for volumes used when preparing the staining panel(s) allows the user to achieve the desired concentration of each antibody. For example:\n4 samples × 100 μL = 400 μL total staining cocktail required\nAntibody A: 2.5 total μL\nAntibody B: 4.75 total μL\nAntibody C: 8.25 total μL\nVolume flow cytometry staining buffer to add: 384.5 μL\nNote: Each sample and staining panel requires its own, transcription factor(s)-paired isotype control(s) panel.\nAdd 100 μL flow cytometry staining buffer to each well.\nSpin plate at 700 xg (RCF) for 3 min at 4oC.\nFlick and blot plate to remove supernatant.\nAdd 100 μL cell-surface staining cocktail to each well as appropriate and mix well.\nRe-suspend all compensation wells in 100 μL flow cytometry staining buffer and mix well.\nTo each appropriate compensation control, add the single antibody for that control and mix well.\nIf using a surrogate compensation control (in place of a transcription factor antibody) that binds a cell surface antigen, stain it at this step. If using the actual intranuclear transcription factor antibody, no additional steps are required beyond re-suspension in flow cytometry staining buffer. That compensation control(s) will be stained in step 62.",
    "Note: See comments in Flow cytometry panel design (above) for notes about compensation controls for transcription factor antibodies.\nIncubate protected from light on ice (4°C) for 30 min.\nAdd 100 μL flow cytometry staining buffer to each well.\nSpin plate at 700 xg (RCF) for 3 min at 4°C.\nFlick and blot plate to remove supernatant.\nAdd 200 μL flow cytometry staining buffer to each well.\nSpin plate at 700 xg (RCF) for 3 min at 4°C.\nFlick and blot plate to remove supernatant.\nPrepare BioLegend True-NuclearTM Transcription Factor Buffer fixation/permeabilization solution:\nAlways prepare this buffer fresh, no more than 1 h prior to use.\nPrepare buffer following this formula: [total number of wells (samples and compensation controls) +2] × 500 μL = total volume required.\nThe 4× fixation/permeabilization solution needs to be diluted 1:4 in the fixation/permeabilization diluent.\nExample: for 10 mL total volume, add 2.5 mL 4× fixation/permeabilization to 7.5 mL fixation/permeabilization diluent to obtain a working 1× solution.\nNote: The BioLegend True-NuclearTM Transcription Factor Buffer fixation/permeabilization kit was used in our studies (Manso et al., 2021[href=https://www.wicell.org#bib1]) as it provided the cleanest staining with the best resolution. As mentioned above, the user must determine the optimal kit(s) for their studies and reagents.\nNote: If a different cell number other than 5x106 total cells are being used in each stain, this volume may need to be adjusted as determined during the user’s initial testing of reagents.\nMix the fixation/permeabilization working solution well and keep at 18°C–22°C until use.\nLabel 5 mL FACS tubes for each sample and compensation control well.\nAdd 300 μL of the 1× fixation/permeabilization solution to each tube.\nAdd 200 μL of the 1× fixation/permeabilization working solution to each well of the plate and mix well.",
    "Transfer each well to its appropriately labeled 5 mL FACS tube\nThe total volume is now 500 μL\nNote: Internal testing has found this volume and this size of sample tube to be optimal for limiting background staining while optimizing signal intensity.\nGently mix using a pipette.\nIncubate protected from light at 18°C–22°C for 1 h.\nNote: Everything from this point forward will be at 18°C–22°C.\nNote: Do not vortex tubes to mix as cells can become more fragile following this protocol.\nPrepare BioLegend True-NuclearTM Transcription Factor Buffer 1× permeabilization/wash buffer:\nAlways prepare this buffer fresh, no more than 1 h prior to the first use.\nPrepare buffer following this formula: [total number of wells (samples and compensation controls) +2] × 500 μL × 5 = total volume required.\nThe 10× permeabilization/wash buffer needs to be diluted 1:10 in dH2O.\nExample: for 50 mL total volume, add 5 mL 10× permeabilization/wash buffer to 45 mL dH2O to obtain a working 1× solution.\nMix the working permeabilization/wash buffer well and keep at 18°C–22°C.\nSpin the sample tubes at 700 ×g (RCF) for 5 min at 18°C–22°C.\nDecant tubes by inverting (do not shake or flick) and blot the mouth of the tube on a paper towel to remove residual liquid.\nAdd 500 μL 1× permeabilization/wash buffer to each tube.\nSpin the sample tubes at 700 xg (RCF) for 5 min at 18°C–22°C.\nDecant tubes by inverting (do not shake or flick) and blot the mouth of the tube on a paper towel to remove residual liquid.\nAdd 500 μL 1× permeabilization/wash buffer to each tube.\nSpin the sample tubes at 700 xg (RCF) for 5 min at 18°C–22°C.",
    "Decant tubes by inverting (do not shake or flick) and blot the mouth of the tube on a paper towel to remove residual liquid.\nA total of 3 washes post-fixation/permeabilization should take place.\nPrepare intranuclear staining cocktails in the 1× permeabilization/wash buffer:\nIn a tube of an appropriate size, add 1× permeabilization/wash buffer and the correct volumes of each transcription factor staining antibody or isotype control such that each tube will get 250 μL staining cocktail. Mix well and keep protected from light at 18°C–22°C until use.\nFollowing the third wash, re-suspend the cell pellets in 250 μL of the appropriate staining or isotype control cocktail and mix well by pipetting.\nRe-suspend the compensation controls in 250 μL 1× permeabilization/wash buffer and add any transcription factor single-stain compensation controls to the appropriate tube(s).\nDepending on the use of surrogate compensation controls for transcription factor antibodies, this compensation control staining step may have already been completed.\nIncubate protected from light at 18°C–22°C for 30 min.\nAdd 250 μL 1× permeabilization/wash buffer to each tube.\nSpin the sample tubes at 700 xg (RCF) for 5 min at 18°C–22°C.\nDecant tubes by inverting (do not shake or flick) and blot the mouth of the tube on a paper towel to remove residual liquid.\nAdd 500 μL 1× permeabilization/wash buffer to each tube.\nSpin the sample tubes at 700 xg (RCF) for 5 min at 18°C–22°C.\nDecant tubes by inverting (do not shake or flick) and blot the mouth of the tube on a paper towel to remove residual liquid.\nRe-suspend cell pellets in 400 μL 1% PFA.\nPlace all tubes on ice (or in the refrigerator, 4°C) and protect from light until flow cytometry analysis.",
    "Note: For optimal results, samples should be analyzed on the flow cytometer as quickly as possible, with the acquisition taking place no longer than 18–24 h following the completion of staining."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}