{
  "id": 8991,
  "origin_website": "Jove",
  "title": "Analyses of Mitochondrial Calcium Influx in Isolated Mitochondria and Cultured Cells",
  "procedures": [
    "All methods described in this protocol have been approved by the Institutional Animal Care and Use Committee of Emory University.\nNOTE: The first part is the experimental procedure for measuring mitochondrial Ca2+ influx in isolated cardiac mitochondria using a plate reader.\n1. Reagents and Solutions\nMake 500 mL of MS-EGTA buffer for mitochondrial isolation: 225 mM mannitol, 75 mM sucrose, 5 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES), 1 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid (EGTA), pH adjusted to 7.4 with KOH. Sterilize it through a 0.22 μm filter and store it at 4 °C. Ensure that the MS-EGTA buffer is pre-chilled to 4 °C before use.\nPrepare 100 mL of KCl Buffer: 125 mM KCl, 20 mM HEPES, 1 mM KH2PO4, 2 mM MgCl2, 40 μM EGTA and pH adjusted to 7.2 with KOH. Store it at room temperature.\nPrepare 1 mM calcium green-5N stock in dimethyl sulfoxide (DMSO). The calcium green-5N stock can be aliquotted and stored at -20 °C.\nPrepare substrates for Ca2+ uptake.\nPrepare 1 M sodium pyruvate, pH 7.4. Store it in aliquots at -20 °C.\nPrepare 500 mM malate, pH 7.4. Store it in aliquots at -20 °C.\n2. Isolation of Cardiac Mitochondria\nEuthanize the mouse according to institutional standards.\n\tNOTE: For our institutionally approved method of euthanasia, mice were anesthetized by isofluorane inhalation and sacrificed by cervical dislocation.\nCollect the heart by opening chest cavity, cutting along either side of the ribs, flanking the heart, cutting away the diaphragm, and excising the heart tissue.\n\tNOTE: In this protocol, mitochondrial isolation is performed from a whole heart collected from an adult mouse (approximately 120 mg), which should be sufficient for 3-4 experiments. For mitochondrial isolation from other mitochondria-rich tissues such as the liver, up to 200 mg of tissue can be used following the protocol described.",
    "Rinse the tissue thoroughly in 25 mL of ice-cold 1x phosphate buffered saline (PBS) ensuring that all blood is squeezed out of the ventricles.\n\tNOTE: The heart will be sufficiently rinsed when the liquid squeezed out of the heart runs clear.\nMince the heart into small pieces in 5 mL of ice-cold 1x PBS using a pair of sharp scissors.\nDiscard the PBS and transfer minced heart tissue to a pre-chilled 7 mL glass-teflon dounce homogenizer with a 0.10 to 0.15 mm clearance.\nAdd 5 mL of ice-cold MS-EGTA buffer, and homogenize the sample until tissue pieces are no longer visible (approximately 11 strokes).\n\tNOTE: Do not over-homogenize the tissue as the goal is to obtain intact and functional mitochondria.\nTransfer the homogenate to a 15 mL tube.\nCentrifuge the homogenate at 600 x g at 4 °C for 5 min to pellet nuclei and unbroken cells.\nTransfer the supernatant to a fresh 15 mL tube and centrifuge it at 10,000 x g at 4 °C for 10 min to pellet mitochondria.\nDiscard the supernatant and keep the mitochondrial pellet on ice.\nWash the mitochondrial pellet twice using ice-cold MS-EGTA buffer. For each wash, resuspend the mitochondrial pellet in 5 mL of MS-EGTA buffer, centrifuge it at 10,000 x g at 4 °C for 10 min, and discard the supernatant.\nAfter the final wash, discard the supernatant and resuspend the mitochondria in 100 μL of ice cold MS-EGTA buffer. Keep the mitochondria on ice.\n\tNOTE: Mitochondria should be used for experimentation within 1 h.\nMeasure mitochondrial protein concentration using a Bradford Protein Assay26.\n3. Plate Reader-based Measurement of Mitochondrial Calcium Uptake",
    "NOTE: Here, it is described the protocol for analyzing mitochondrial Ca2+ uptake using a multimode plate reader fitted with injectors. Any plate reader with the capability of reading calcium green-5N fluorescence (excitation/emission of 506/532 nm) in a kinetic mode with automated reagent injectors to keep the reaction protected from light can be used.\nProgram the plate reader to perform a kinetic read of calcium green-5N fluorescence with measurements taken every second for a total assay time of 1,000 s. Additionally, program the reagent injectors to dispense 5 μL of CaCl2 solution at the 30 s, 150 s, 300 s, 480 s, and 690 s time points.\n\tNOTE: The timing of the CaCl2 injections are user defined, and can be adjusted for according to experimental needs.\nPrime the reagent injectors with the CaCl2 solution to be used.\n\tNOTE: The concentration of the CaCl2 solution is user defined, and can be adjusted in subsequent runs to titrate the amount of Ca2+ required to trigger MPTP opening.\nAdd 200 μg of mitochondria to an individual well of a 96 well plate.\nAdd the appropriate volume of KCl buffer to the well such that the total volume of mitochondria and KCl buffer comes to 197 μL.\nAdd 1 μL of 1 M pyruvate, and 1 μL of 500 mM malate to the mitochondria mixture. Pipet gently to mix, and incubate the mitochondria with the substrates for 2 min at room temperature to allow mitochondria to become energized.\nAdd 1 μL of 1 mM calcium green-5N stock. Mix gently by pipetting.\n\tNOTE: Protect the reaction from light following the addition of the calcium green-5N dye.\nStart the pre-programmed kinetic protocol and monitor calcium green-5N fluorescence.\n4. Reagents and Solutions\nNOTE: The second part is experimental procedure for confocal imaging of mitochondrial Ca2+ in cultured cells",
    "Make Tyrode's solution (130 mM NaCl, 4 mM KCl, 2 mM CaCl2, 1 mM MgCl2, 10 mM glucose, and 10 mM HEPES, pH 7.2 with KOH). Store it at 4 °C. Warm it to room temperature before use.\nPrepare Wash Solution (100 mM potassium acetate, 15 mM KCl, 5 mM KH2PO4, 5 mM Mg-ATP, 0.35 mM EGTA, 0.12 mM CaCl2, 0.75 mM MgCl2, 10 mM phosphocreatine, 10 mM HEPES, pH 7.2 with KOH). Store it at 4 °C. Warm it to room temperature before use.\nPrepare Permeabilization Solution, which contains 0.005% saponin in Wash Solution. Prepare it fresh daily.\nPrepare 0 Ca2+ Internal Solution (100 mM potassium acetate, 15 mM KCl, 0.35 mM EGTA, 0.75 mM MgCl2, 10 mM HEPES, pH adjusted to 7.2 with KOH). Store it at 4 °C. Warm it to room temperature before use.\nPrepare internal solution containing Ca2+. Add CaCl2 to the internal solution above to reach the desired concentration of free Ca2+. The amount of CaCl2 to add is calculated using the MaxChelator program (maxchelator.stanford.edu).\nPrepare 1 mM Rhod-2/AM stock in DMSO and store it at -20 °C until use.\nPrepare 1 mM MitoTracker green stock in DMSO and store it at -20 °C until use.\n5. Plating Cells for Imaging\nWash 22 x 22 cm2 glass coverslips with 100% ethanol and allow the coverslips to air dry.\nPlace the glass coverslips into individual wells of a 6-well tissue culture dish.\n\tNOTE: Coverslips can be coated with laminin, poly-L-lysine, or similar matrix to promote cell attachment.\nTrypsinize and plate the cells onto the coverslips aiming for approximately 70% confluence on the day of imaging.\n6. Loading Cells with the Rhod-2/AM and MitoTracker Green",
    "Prepare Rhod-2/AM-MitoTracker green working solution. Add 20 μL of Rhod-2/AM 1 mM stock, 0.2 μL of MitoTracker green 1 mM stock, and 2.5 μL of 20% pluronic F-127 to 1 mL of Tyrode's solution. The final concentration of Rhod-2 in the working solution is 20 µM and the final concentration of MitoTracker green is 200 nM.\nGently remove the growth media from the coverslip.\n\tNOTE: A wash step is not necessary prior to dye solution addition.\nAdd the Rhod-2/AM-MitoTracker green solution in a dropwise fashion onto the coverslip until the coverslip is just covered (approximately 3-4 drops per coverslip).\nIncubate it for 30 min at room temperature protected from light to allow the cells to load with the dyes.\nDe-esterify the Rhod-2/AM. Gently remove the Rhod-2/AM-MitoTracker green solution, replace it with fresh room temperature Tyrode's solution, and incubate it for 30 min at room temperature protected from light.\n7. Confocal Imaging of the Mitochondrial Rhod-2/AM and MitoTracker Green Fluorescence\nTransfer the coverslip to the microscope imaging chamber and fill the chamber with wash solution.\nUnder settings for observing cells in phase contrast at 40X, adjust focus until cells are visible and in focus.\nPermeabilize the plasma membrane of Rhod-2/AM-MitoTracker green loaded cells to remove cytosol-localized Rhod-2, while retaining mitochondria-localized dye.\nRemove the Wash Solution from the coverslip.\nReplace it with Permeabilization Solution for approximately 1 min.\nVisually monitor the plasma membrane morphology throughout the permeabilization process. Permeabilized cells will develop a roughened surface.\nWhen permeabilization is complete, immediately remove the Permeabilization Solution and replace it with 0 Ca2+ Internal Solution.",
    "Simultaneously image Rhod-2 fluorescence (excitation using the 559 nm laser line and emission collected at wavelengths between 575-675 nm) and MitoTracker green fluorescence (excitation using the 488nm laser line and emission collected at wavelengths between 505-525 nm). Focus on permeabilized cells displaying a clear colocalization of Rhod-2 and MitoTracker green.\nDecrease the microscope laser and gain settings such that the mitochondrial Rhod-2 fluorescence is dim and just visible.\nSelect microscope settings to acquire 2-dimensional scans at an appropriate frame rate and time course for the specific application. A frame rate of at least 30 frames/s is recommended to accurately capture the kinetics of changes in mitochondrial Ca2+.\nRemove the 0 Ca2+ Internal Solution without disturbing the cells or microscope focus.\nStart image acquisition.\nAdd Ca2+-replete Internal Solution at the 10 s time point either manually or with a perfusion system.\nSelect regions of interest (ROIs) to encompass regions of colocalization between mitochondrial Rhod-2 and MitoTracker green signal in the image acquisition software.\n\tNOTE: Arbitrary fluorescence (F) values for each time point of the recording are obtained for each ROI. These values are background subtracted and normalized to the initial fluorescence (prior to Ca2+ addition; F0) and plotted as F/F0 over time for data presentation and quantification of the amplitude of the change of mitochondrial Ca2+.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}