{
  "id": 6860,
  "origin_website": "Bio",
  "title": "Isolation and High Throughput Flow Cytometric Apoptosis Assay of Human Neutrophils to Enable Compound Library Screening",
  "procedures": [
    "Part I: Isolation of neutrophils from peripheral bloodBlood was obtained from healthy subjects following approval from the local ethics committee and informed consent from volunteers. All scientists handling blood and blood products were vaccinated against hepatitis B. Aside from the blood collection and centrifugation steps, carry out all work inside a Class II Biological Safety Cabinet.PreparationPrepare a Class II Biological Safety Cabinet for use by cleaning with 70% ethanol or similar.Pre-warm the 6% Dextran solution in a water bath set to 37 °C.Place the 90% Percoll solution into the cabinet to allow it to reach room temperature.Prepare a 50 ml tube for blood collection by adding 5 ml 3.8% tri-sodium citrate as an anti-coagulant.Note: Concentration of tri-sodium citrate = 11% total volume.Blood collectionObtain peripheral whole blood samples by venepuncture using a BD Vacutainer Safety-Lok blood collection set, collecting 40 ml of blood into a 50 ml syringe.Note: Blood is typically obtained at the same time of day (between 8-10 am). Immediately transfer the blood into the 50 ml tube containing tri-sodium citrate, running the blood slowly down the side of the tube to avoid the formation of bubbles. Invert slowly several times to mix.Neutrophil isolationCentrifuge the blood at 323 x g at 20 °C for 20 min (Figure 1, Spin 1).This results in the separation of the blood sample into two distinct layers of platelet-rich plasma (PRP) and blood cells (Figure 1A). Using a serological pipette followed by a Pasteur pipette, transfer the PRP to a fresh 50 ml tube. Avoid disturbing the interface.Centrifuge the PRP at 896 x g for 20 min at 20 °C (Figure 1, Spin 2) to pellet the platelets. Following centrifugation of the PRP, transfer the supernatant (PPP, Figure 1B) to a fresh 50 ml tube. The platelet pellet can be discarded.",
    "During this centrifugation step, add 6 ml of the pre-warmed 6% dextran solution to the remaining blood cell layer from Step C1, and top up to 50 ml with saline. Replace the lid and mix gently by inversion. Take off the lid and use a Pasteur pipette to remove any bubbles that have formed around the top of the tube or in the lid.Loosely replace the lid, and leave undisturbed at room temperature for 20-30 min. A clear interface should be visible.Following dextran sedimentation (Figure 1C), transfer the pale upper leukocyte layer to a clean 50 ml tube using a serological pipette followed by a Pasteur pipette. Take care to not to disturb the interface.Centrifuge at 224 x g at 20 °C for 6 min (Figure 1, Spin 3).During the centrifugation step, the discontinuous plasma/Percoll gradient is prepared.Label two separate 15 ml tubes as “upper phase” and “lower phase”.To make the lower phase, add 1.02 ml of 90% Percoll (Recipe 2) and 0.98 ml PPP. Mix carefully by pipetting up and down, avoiding bubbles.Note: For accuracy use a p1000 pipette to make the gradient layers. To make the upper phase, combine 0.84 ml 90% Percoll with 1.16 ml PPP. Mix carefully as above.Using a Pasteur pipette, take up all 2 ml of the upper phase and very slowly deposit it on top of the lower phase. Hold the tube containing the lower phase at a 45° angle so the liquid slowly runs down the side of the tube and sits on top of the lower phase.Note: Avoid the formation of bubbles. Once the centrifugation (Step C7) is complete, remove and discard the supernatant, and gently resuspend the leukocyte pellet in 2 ml PPP by gently swirling the tube in a circular motion.",
    "Note: The cell pellet is soft and extra care is required when handling. Deposit all 2 ml of the resuspended leukocyte population on top of the upper phase of the gradient using the same careful technique as in Step C8d (Figure 1D).Centrifuge the tube containing the gradient at 271 x g for 11 min at 20 °C with no brake (Figure 1, Spin 4).Note: This yields three layers of cells: remaining red blood cells at the bottom of the tube, granulocytes in the middle, and peripheral blood mononuclear cells (PBMCs) closest to the top (Figure 1E). Using a Pasteur pipette, remove the PBMC layer into a clean 50 ml tube, being sure to remove as many cells as possible as residual PBMCs may contaminate the granulocyte layer.Note: PBMCs can be resuspended in media and used in other protocols or discarded if not required. Using a Pasteur pipette, remove the granulocyte layer into a clean 50 ml tube, taking as many cells as possible but avoid disturbing the red blood cell pellet.Add 10 ml PPP to the tube, top up to 40 ml with Hank’s Balanced Salt Solution (HBSS) and mix by inversion to ensure an even cell suspension.Count cells using a cell counting chamber.Centrifuge at 504 x g for 6 min at 20 °C (Figure 1, Spin 5).Remove the supernatant and gently resuspend the cell pellet in media (Recipe 4) to a final concentration of 5 x 106 cells/ml.Freshly isolated neutrophils are cytocentrifuged (300 rpm, 3 min, Cytospin 4 cytocentrifuge) onto microscope slides and stained with Kwik-Diff dyes. The purity of the prep is determined by assessment of cell morphology (Figure 2A). These slides can also be used to identify apoptotic neutrophils, based on morphological changes (Figure 2B).",
    "Note: Neutrophils that have been in culture are centrifuged at 200 rpm, 3 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603190108_9352.jpg Figure 1. Flow diagram of the neutrophil isolation protocolimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603190136_5387.jpgFigure 2. Healthy and apoptotic neutrophil morphology. Immediately after isolation (A) neutrophils are healthy, with lobes of the nucleus connected by string-like chromatin bridges (red arrows). Apoptotic neutrophils (B, blue arrows) are identifiable by their rounded-up nuclei and lack of chromatin bridges. Visualised on Kwik-Diff stained cytocentrifuge slides by oil immersion microscopy.Part II: High-throughput kinase inhibitor apoptosis assay Note: See Figure 3 for a schematic summary of this section of the protocol. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603190203_6463.jpgFigure 3. Flow diagram of the apoptosis screening protocol Preparation of test compoundsPublished Kinase Inhibitor Set (PKIS) compounds dissolved in DMSO come pre-aliquoted into 96-well plates. Using a multi-channel pipette, transfer an aliquot of each compound to a clean 96-well plate and dilute in media to achieve a 10x final concentration sub-stock (in this case 625 µM).In sterile Eppendorf tubes, prepare dilutions of control reagents (in this case pyocyanin and GM-CSF, which accelerates and inhibits neutrophil apoptosis, respectively) to achieve 10x final concentration sub-stocks (500 µM for pyocyanin and 500 U/ml for GM-CSF). Prepare a DMSO control by diluting DMSO in media at the same ratio (v/v) as the control reagents.Keep all reagents on ice until required.Note: Alternative inhibitor libraries and control compounds may be more appropriate for user assays.Seeding platesTake two sterile 96-well flexible, untreated polyvinyl chloride general assay plates and label the control plate: A and test plate: B.Add 50 µl media to 8 wells of plate A (see plate A template below).Note: Plate A includes wells for technical controls including unstained samples and single stain controls for Annexin-V and TOPRO-3. Since Annexin-V binding is a calcium dependent process, an additional control containing EDTA is included. To plate B add kinase inhibitor compounds [62.",
    "5 µM] and assay control compounds (media, DMSO (vehicle control), GMCSF [50 U/ml] and pyocyanin [50 µM]) in corresponding duplicate wells (see plate B template). Using a multi-channel pipette add 10 µl of each kinase inhibitor compound sub-stock (see Step A1) to wells containing 40 µl of media. Add 10 µl each of pyocyanin, GM-CSF and DMSO sub-stock (see Step A2) to wells containing 40 µl of media. Include a final 2 wells containing 50 µl of media.Resuspend 30 x 106 freshly isolated neutrophils in 6 ml of warm media at a final density of 5 x 106/ml (see Step C17 of Part I).Transfer the cell suspension to a sterile Petri dish and using a multichannel pipette, transfer 50 µl of the cell suspension to each well of the 8 wells of plate A and all wells of plate B.Incubate in a humified incubator at 37 °C and 5% CO2 for 6 h.Note: Concentrations of inhibitors and control compounds are calculated based on a final volume of 100 µl per well, since 50 µl neutrophil suspension is added making a total volume of 100 µl (Figure 3). Each well contains 2.5 x 105 cells.See suggested templates for staining control and assay plates below (Tables 1-2):Table 1. Plate A template (flow cytometric controls)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603190719_6975.jpgU = unstained; A5 = PE-Annexin V single stain control and T3 = TOPRO-3 single stain controlTable 2. Plate B template (test plate)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603190901_9959.jpgM = Media; D = DMSO; G = GMCSF; P = Pyocyanin and I = Inhibitor compoundsStaining cells for flow cytometric apoptosis assayFollowing the incubation period, use a multi-channel pipette to resuspend the cells by gently pipetting up and down 2-3 times and transfer the cell suspension to Attune autosampler compatible, firm 96-well plates. Keep the plate on ice.",
    "Centrifuge the plates at 378 x g for 6 min at 4 °C.Using a multi-channel pipette, remove supernatants carefully without disturbing the cells and discard the supernatants.Using a multi-channel pipette, add 150 µl ice cold PBS, gently resuspend cells to wash and centrifuge plates as above.During the centrifugation prepare the following:1x ABB (Annexin Binding Buffer) by diluting 10x ABB (see Recipe 5)PE-conjugated Annexin-V (see Recipe 6)Following centrifugation, remove supernatants and immediately add 50 μl diluted PE-conjugated annexin-V to all wells except unstained and TOPRO-3 single stain control wells (see Table 3 below) and mix gently. To EDTA control wells add EDTA to a final concentration of 0.02 M.Table 3. Cell death probe staining conditionsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603191011_7398.jpgCover the plate with aluminium foil to minimise exposure to light and incubate for 20 min at room temperature in the dark.During the incubation period, prepare TOPRO-3 solution (1:7,500 v/v) in 1x ABB (see Recipe 7).Following the incubation period, add 150 μl of the TOPRO-3 solution to all wells except unstained, annexin-V single stain and EDTA control wells (see Table 3 above).To each of the unstained, annexin-V single stain and EDTA control wells, add 150 μl of 1x ABB.Transfer samples from wells of plate A to corresponding 1.5 ml centrifuge tubes. The unstained and single strain controls in the tubes will be used to set up cytometer parameters during sample acquisition.Flow cytometry sample acquisitionPerform sample acquisition with an AttuneTM Flow Cytometer using AttuneTM Cytometric Software as per suggested protocols.Acquire sample from tubes for unstained and single stain controls in order to set up parameter settings.Gate neutrophils based on typical forward (FSC) and side (SSC) scatter profiles (see Figure 4A) (Prince et al., 2012).Perform sample acquisition using a built-in auto sampler, which acquires samples from 96 wells plate in a robotic manner based on a pre-set program.",
    "Set the flow cytometer to collect a pre-defined number (e.g., 10,000) of gated events from each well. The plate was routinely read from well A1 to H12.Note: Each 96-well plate takes approximately 60 min to acquire therefore we recommend limiting the number of plates sampled in order to avoid lengthy acquisition times which may affect results.Data analysisExport data to .fcs files and analyse by flow cytometry analysis software FlowJo.Gate neutrophils based typical forward (FSC) and side (SSC) scatter profiles (see Figure 4A).Analyse the gated neutrophils based on the quadrant distribution of annexin-V and TOPRO-3 positive events (see Figure 4B). Determine percentage of cells appearing in each quadrant.Calculate percent apoptosis by the summation of annexin-V positive and annexin-V/TOPRO-3 double positive events.Calculate average percent apoptosis from at least three independent experiments.Calculate apoptosis fold change for inhibitor compounds compared to DMSO controls.Note: In optimisation experiments we confirmed percentage apoptosis as determined by high throughput flow cytometry closely correlated with apoptosis measured by light microscopy.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603191550_2678.jpgFigure 4. Flow cytometry gating strategy for the assessment of neutrophil apoptosis. A. Neutrophils were first gated based on the forward scatter (FSC-A) and side scatter (SSC-A) properties. The FSC-A versus SSC-A distribution is shown in a pseudo colour dot plot. (B) Gated neutrophils were then analysed based on the annexin-V versus TOPRO-3 distribution profile, and apoptosis calculated by the summation of annexin-V single positive (Q1) and annexin-V/ TOPRO-3 double positive (Q2) events. Representative examples showing the distribution of annexin-V/TOPRO-3 in media- and pyocyanin-treated neutrophils."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}