{
  "id": 2890,
  "origin_website": "Cell",
  "title": "Protocol for analyzing enzymatic hydrolysis of cellulose using surface pitting observation technology",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of cellulose gel: Solvent exchange to the reaction buffer\nTiming: 3–5 h\nNanofibrous cellulose gel plates (with diameter and thickness of 9 cm and 5 mm, respectively) contain water after preparation. The water should be replaced with the appropriate buffer for the enzymatic reaction.\nNote: All subsequent experiments are performed at room temperature (22°C–25°C) with normal humidity (14%–20% relative humidity).\nSolvent exchange of the nanofibrous cellulose.\nPrepare 2× buffer of the target reaction buffer. In this protocol, 0.2 M acetate buffer (pH 4.8) is prepared.\nPour 20 mL, that is, the same volume as the nanofibrous cellulose plate, of 2× buffer into a Petri dish containing the nanofibrous cellulose plate.\nLeave the plate for 1–4 h with gentle shaking on an orbital shaker.\nRemove excess buffer with a pipette. Nanofibrous cellulose is stored in airtight Tupperware containers at 4°C.\nCut the disc-shaped cellulose plate into square pieces (1–3 cm across) and place a piece on a glass slide.\nAir dry the cellulose plate for 20–30 min to remove excess water on the surface.\nDuring air drying, enter the thickness value of the nanofibrous cellulose and glass slide into the material thickness parameter in the stage control panel of the inkjet device.\nNote: This setting is used as reference in the subsequent inkjet printing experiments to control the distance between the nozzle tip and gel surface.\nCritical: Maintaining standardized air-drying conditions is critical to obtain consistent pit-formation results. Air drying considerably affects the diffusion of enzymes into cellulose matrices; thus, pit sizes vary depending on the air-drying condition; for example, longer drying results in larger pits. See also troubleshooting 5[href=https://www.wicell.org#sec6.9].",
    "Note: An air-drying time of 20–30 min is recommended. As the enzyme deposition by the inkjet printing device is sometimes unstable, as in troubleshooting 1[href=https://www.wicell.org#sec6.1], 2[href=https://www.wicell.org#sec6.3], and 3[href=https://www.wicell.org#sec6.5], this leaves enough margin for troubleshooting before the next inkjet printing experiment. Proceed to the next steps while air-drying, and keep the time of enzyme deposition (major step 6) constant after removing the gel from the airtight container (major step 2).\nNote: When the solvent exchange was tested with Luria–Bertani broth, the exchange was almost completed within 2 h.8[href=https://www.wicell.org#bib8]\nDeposition of cellulase on nanofibrous cellulose by inkjet printing\nTiming: ∼10 min\nA solution containing 10 mg/mL cellulases (Meicelase) is deposited onto a flat surface of a nanofibrous cellulose gel using an inkjet patterning device (LaboJet 500Bio) equipped with an IJHBS 10 inkjet head. The amount of deposited solution is controlled by repeatedly depositing the solution in the same place.\nNote: Turn on the laser microscope for 60 min at minimum before use.\nNote: The condition used in this protocol was 8.93 ± 0.74 pL of the 10 mg/mL cellulase solution per shot (Table 1[href=https://www.wicell.org#tbl1]).\nMount the slide glass with nanofibrous cellulose on the sample stage base.\nSettings of the patterning methods (Examples are shown in Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_2394_2.csv\nSet the distance from the nozzle tip of the inkjet print head to the surface of the nanofibrous cellulose gel to 1 mm (Gaps in Table 2[href=https://www.wicell.org#tbl2]).\nSet the interval between the droplet (dot spacing) to 400 μm.\nSet the number of shots to be deposited; for example, 2 (0.18 ng of cellulases), 4 (0.36 ng), 6 (0.72 ng), or 8 shots (0.90 ng).\nInclude the droplet observation method to check the droplet performance (Table 2[href=https://www.wicell.org#tbl2], step no. 1).",
    "Set a test condition outside the print area because the first shot is not stable (Table 2[href=https://www.wicell.org#tbl2], step no. 2).\nStart patterning and check the droplet performance.\nIf issues are encountered with the proper ejection of drops from the inkjet nozzle, refer to troubleshooting 1[href=https://www.wicell.org#sec6.1], 2[href=https://www.wicell.org#sec6.3], and 3[href=https://www.wicell.org#sec6.5] for possible solutions.\nThe reaction start time is defined as the time immediately after the device starts to move for patterning.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2394-Fig3.jpg\nFigure 3. Effects of pit intervals on the baseline\n(A–H) Pits with intervals of 400 μm (A, C, E, and G) and pits with intervals of 300 μm (B, D, F, and H). A successful image shows a flat baseline in its cross-sectional profile (C); however, baselines are ambiguous when the intervals are too narrow (D). Additionally, the pit with intervals of 300 μm is large in diameter but shallow; in addition, the pit does not exhibit a gaussian-like cross-sectional profile. Longer air-drying should be applied to ensure pit formation in the depth direction (troubleshooting 5[href=https://www.wicell.org#sec6.9]). Both pits were observed at 29 min after depositing 0.89 (A, C, E, and G) and 1.32 ng (B, D, F, and H) of cellulases. Scale bars: 100 μm.\nNote: To assess reproducibility, major steps 2–6 and the laser profilometry experiments (major steps 7–15) are repeated 10 times for each condition.\nNote: Patterning of multiple spots under the same drop conditions is recommended owing to the possible existence of surface profile disorder, scratches, or dust adhering to the surface. Even if only a single spot is measured using a laser microscope, a spot with a smooth surface can be selected.",
    "Optional: The above protocol is for tracking the growth of a spot over time. If the purpose of the measurement is to observe multiple spots without the need to take a time-course of enzymatic activity, variations can be made in the amount of enzyme drops in each patterning experiment.\nNote: Spacing intervals of the points are set to 400 μm to ensure that the points are spaced with sufficient distance to generate a flat baseline. See also expected outcomes[href=https://www.wicell.org#expected-outcomes] and Figure 3[href=https://www.wicell.org#fig3].\nQuantification of pits using a laser scanning confocal microscope\nTiming: ∼30 min\nPits on the surface of nanofibrous cellulose matrices are quantified using a laser scanning confocal microscope operated in reflection mode. Three-dimensional height maps of the pitted surface are obtained in a non-destructive manner.\nNote: The microscope uses a laser (λ = 408 nm) to scan the target in the field of view along the X and Y directions (1,024 × 768 pixels) for every single plane. The intensity of reflected light from the surface, I, is measured by a photomultiplier. Measurements are repeated to obtain a stack of images as the objective lens moves in the depth (z) direction at a specified pitch. A focal position of a pixel is given at z, where the strongest I is recorded. A 3D height map is generated by locating the focal positions of all pixels in an image.\nNote: A 50× objective lens (N.A. 0.95, a field of view: 270 μm × 202 μm) is used in this protocol. A 20× objective lens (N.A. 0.46, a field of view: 675 μm × 506 μm) is also usable; however, the resolution is insufficient for quantifying enzymatic pit formation.",
    "Note: Imaging is performed using the panorama mode with an aid of automatic control by the motorized electric stage. Four images (2 × 2 grids) are collected for each spot and computationally joined together to yield an image covering an area larger than a single field of view.\nNote: The space inside the pit remains dry because the excess water released during the disruption of the 3D network is re-absorbed by the surrounding matrix.\nA lens heater is attached to the objective lens to prevent water condensation on the lens surface.\nSet the heater temperature to 40°C; > 10 min is required to reach the set temperature.\nMove to the spot position to be measured.\nMount nanofibrous cellulose on the stage of the microscope (Figure 2[href=https://www.wicell.org#fig2]A); place the glass slide to the defined place on the stage using double-sided tape.\nPlace the humidifying chamber on the stage to cover the nanofibrous cellulose and objective lens (Figure 2[href=https://www.wicell.org#fig2]B).\nAdjust the focal position to get a view of the target to be examined.\nDetermine the z range to be scanned: move the peak (focal spot) to the top and bottom of a target and save the peak information in the memory.\nTake panoramic images of 4 views (2 × 2 grids).\nContinue measurements by repeating the major steps 12 and 13 until the end of the incubation (30 min).\nExport image files. The panorama images are computationally joined together.\nNote: The surface profile around the pit is measured extensively because a flat surface area is necessary to obtain a reference surface for accurate volume calculations. See also expected outcomes[href=https://www.wicell.org#expected-outcomes] and Figure 3[href=https://www.wicell.org#fig3].",
    "Note: Scan time is ∼1 min for each image. Shallow pits (reaction time 5 min) require ∼3 min per four images, whereas deeper pits (reaction time 30 min) require ∼5 min per four images.\nQuantification and statistical analysis of pit volume\nTiming: ∼5 min\nPit volumes are calculated from the 3D height map using a scanning probe image processor (SPIP ver. 6.13). SPIP contains many generic analytical and visualization tools. The specialized tools for plane correction are particularly useful for quantitatively analyzing the pit volume.\nNote: The roughness of the nanofibrous cellulose surface was determined to be 0.2–0.4 μm using the root mean-square deviation (Rq) of the average amplitude in the height direction. To eliminate errors due to surface irregularities, set the depth threshold to –1 μm. Data of the surface areas above the threshold are excluded from the calculation. The appropriate threshold for the detection of shallow pits can be adjusted according to the specific experimental conditions. If very shallow pits need to be detected with high sensitivity, setting the threshold to 0.5 μm may be appropriate.\nImport an image file into the SPIP software.\nPolynomial plane correction (flattening).\nSelect the pit by Area of Interest marking tools (Circle markers). The fit surface for plane correction is calculated based on the data outside the Area of Interest in the next step b.\nOpen the Plane Correction Dialog, apply the setting in Table 3[href=https://www.wicell.org#tbl3], and perform plane correction.\ntable:files/protocols_protocol_2394_3.csv\nThe SPIP software automatically generates the height distribution histogram of the image.\nSelect volumes below the threshold (-1 μm) in the Histogram window.\nThe SPIP software integrates the volume of the selected area.",
    "Multiply the integrated volume data below the threshold (-1 μm) by pixel dimension (0.3 μm × 0.3 μm for a 50× objective) and fiber density (0.03 g cm-3 for 3% nanofibrous cellulose).\nNote: Since the surface of the nanofibrous cellulose gel is slightly undulated rather than flat, it is recommended to use image analysis software with plane correction tools of higher-order flattening.\nNote: Our histogram data is available in the Figure S8 in a previous study.1[href=https://www.wicell.org#bib1]"
  ],
  "subjectAreas": [
    "Material Sciences",
    "Chemistry",
    "Biotechnology And Bioengineering",
    "Microscopy",
    "Microbiology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}