{
  "id": 9250,
  "origin_website": "Jove",
  "title": "Isolation of Primary Murine Brain Microvascular Endothelial Cells",
  "procedures": [
    "All animal experiments were approved by the local authorities (“LandesamtfürNatur, Umwelt und Verbraucherschutz NRW; Fachbereich 87, Tiergesundheit, Tierschutz; Recklinghausen, Germany”) and conducted according to the German law of animal protection.\n1. General Comments for Mouse Experiments\nPerform all experiments using mice in accordance with the guidelines of the respective Institutional Animal Care and Use Committee.\nKeep the mice under pathogen-free conditions and enable them to have access to food and water ad libitum.\nUse age- and sex-matched mice in experimental groups because biological properties can vary with age and gender.\nWhenever possible try to reduce, refine or replace animal experiments.\n2. Preparation of the Percoll Gradient\nMix 19 ml of 1x PBS with 1 ml 10x PBS, 1 ml FCS and 10 ml Percoll.\nPerform sterile filtration in a glass tube (diameter of filter pores: 0.2 µm). Afterwards store the solution at 4 °C.\n3. Preparation of Endothelium Cell Medium and Coating of Cell Culture Plates\nEndothelial cell medium:\n\t\nPreparation of 500 ml medium: Mix 400 ml DMEM medium (approx. 80%) with 100 ml PDS (approx. 20%), 0.25 ml bFgF (20 µg/ml; approx. 0.05%), 0.5 ml heparin (100 µl/ml; approx. 0.1%) and 0.5 ml pyrumycin (4 mg/ml; approx. 0.1%). Add pyrumycin only for cell culture medium used in the first 2 days of culture.\nPerform sterile filtration in a glass tube (diameter of filter pores: 0.2 µm). Afterwards store the solution at 4 °C.\nCoating of cell culture plates:\n\t\nFor 1 ml of coating solution, prepare a solution of 500 µl ddH2O, 400 µl collagen IV (0.4 mg/ml) and 100 µl fibronectin (0.1 mg/ml).\nCover the whole surface of each well of the cell culture plate with the coating solution. Store the plate at 4 °C overnight.\n4. Isolation of Murine Brain Microvascular endothelial cells (MBMEC)",
    "Sacrifice 10 adult mice (8 - 12 weeks old, C57BL/6) by cervical dislocation. Afterwards isolate the mouse-brains and store in 5 ml of PBS (Caveat: Work sterile!).\nRemove brain stems, cerebella and thalami with a forceps. Detach meninges by carefully rolling the brains on a sterile blotting paper. Collect the resulting meninges-free forebrains.\nTransfer the brains to a 50 ml Falcon tube filled with 13.5 ml of DMEM.\nMince the tissue, first with a 25 ml pipette, then with a 10 ml pipette until the media becomes milky.\nThen digest the tissue with a mixture of 0.6 ml collagenase CLS2 (10 mg/ml in DMEM) and 0.2 ml DNAse (1 mg/ml in PBS) in Dulbecco’s Modified Eagle Medium (DMEM) for 1 hr at 37 °C on an orbital shaker at 180 rpm.\nAdd 10 ml of DMEM added to the tissue suspension and centrifuge the cells at 1,000 x g for 10 min at 4 °C.\nDiscard supernatant (Caveat: PELLET IS EASY TO LOSE!)\nTo remove the myelin, resuspend the pellet with a 25 ml pipette in 25 ml of BSA-DMEM (20% w/v) (approx. 25 times), and centrifuge at 1,000 x g for 20 min at 4 °C.\nDiscard the upper myelin layer (milky) with a broken glass Pasteur pipette with larger diameter, and then discard the BSA layer with a normal Pasteur pipette.\nResuspend the pellet in 9 ml DMEM and add 1 ml collagenase/dispase (final concentration is 1 mg/ml) and 0.1 ml DNAse. Digest the solution for 1 hr at 37 °C on an orbital shaker at 180 rpm (caveat: do not use the pipette to resuspend – cells can be lost).",
    "During the digestion, centrifuge the Percoll solution to set up the density gradient using an ultracentrifuge at 3,000 x g for 1 hr at 4 °C, with acceleration, without brake.\nAdd 10 ml of DMEM to the digested cell suspension. Centrifuge the suspension at 1,000 x g for 10 min at 4 °C. Then discard the supernatant and resuspend the pellet in 2 ml of DMEM.\nAdd the resuspended cells carefully on top of the Percoll gradient and centrifuge at 700 x g for 10 min at 4 °C without acceleration and brake. Note: The cells are visible as a cloud in the interphase.\nTake approx. 12 ml of the interphase with cells with a long sterile needle and place it in a new 50 ml Falcon with 5 ml of DMEM.\nCentrifuge the cells again at 1,000 x g for 10 min at 4 °C. Afterwards resuspend the pellet in endothelial cell medium (use approx. 0.2 ml of medium per 1 cm2 surface of cell culture plate).\nRemove coating solution from coated cell culture plates (see step 3.2) and rinse every well with sterile PBS in two consecutive washing steps.\nMaintain cell cultures in endothelial cell medium at 37 °C and 5% CO2 in a sterile incubator. Change the medium every two to three days. Split cells at 90% confluence."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}