{
  "id": 18394,
  "origin_website": "Jove",
  "title": "A Step by Step Protocol for Subretinal Surgery in Rabbits",
  "procedures": [
    "Ethics of animal handling in ophthalmic research: We obtained approval from the Ethics committee of the Medical Faculty, University of Bonn, and adhere to the guidelines stated by The Association for Research in Vision and Ophthalmology (ARVO). Moreover, all procedures were approved by the state regulatory authorities of North Rhine-Westphalia. Animals were held indoors in a specialized facility in an air-conditioned room with temperatures between 18 - 20 °C, exposure to regular daylight, in standardized individual cages with free access to food and water.\nNote: To ensure the animals operative affinity, an animal health score sheet is followed which includes the following definitive animal exclusion criteria: 20% weight loss compared to weight on admission; apparent cyanosis of the animal; animal shivers, has cramps or cannot move in coordination; ataxia/ paresthesia, e.g., paralyses; apathy; extreme auto mutilation (skin wounds, severed limbs).\n1. Instrument Sterilization\nPlace reusable instruments in ultrasonic bath.\nAdd 500 ml distilled water and 2 ml of instrument disinfectant.\nClean instruments using sweep function for 15 min.\nRemove instruments from ultrasonic bath and rinse thoroughly using distilled water for 5 min.\nInsert instruments in autoclave and use the standard program (sterilization of instruments under 121 ºC for 20 min).\n2. Instrument Preparation\nEstablish and maintain a sterile field, by working in a closed room, wearing surgical scrubs, mask and hair cover. Disinfect hands prior to wearing sterile surgical gloves. For detailed approach see 28.\nPlace sterilized instruments on a sterile drape.\nPlace 1 ml syringe filled with 40 mg triamcinolone attached to a 27 G needle for injection, 10 ml syringe with Balance salt solution (BSS), and 5 ml syringe of lubricant on drape.",
    "Place 3-0 silk, 7-0 vicryl, ocular sticks (to stop conjunctival/ scleral bleeding), twister gauze sponges, wound closure strips (to fixate the vitrectomy tip tubing), and chandelier endoillumination fiber wire on a drape.\nUnwrap 25 G chandelier endoilluminator and connect to light machine using sterile techniques (see step 2.1). Connect vitrectomy set including high speed vitrector and Venturi cassette to vitrectomy machine using sterile techniques (see step 2.1).\nOpen 500 ml BSS bottle and connect solution to Venturi cassette according manufacturer's instructions.\n3. Preparation of Anesthesia and Positioning of the Animal\nWeigh animal to ensure accurate medication dosage.\nPrepare intramuscular (IM) anesthesia using 1 syringe with 27 G needle containing 0.35 mg/kg ketamine and 0.25 mg/kg medetomidine for start. Flip the syringe to mix.\nPrepare 2 syringes with 1/3 the doses to maintain the anesthesia during the operation.\nPrepare syringe containing 20 ml of 5% glucose solution and 18 G needle for subcutaneous injection as an intravenous infusion alternative.\nGive 3 x 1 drop of mydriatic eye drops prior to vitrectomy for pupil dilatation.\nCover rabbit with blanket to calm before anesthesia injection, inject in the hind limb (gluteal muscle) and massage around injection site for 30 sec.\n\tNote: The first shot of IM anesthesia lasts about 1 - 2 hr. depending on the rabbit's size, drug tolerance, fat layer, stress and body temperature. The first sign of the anesthesia fading away is a nystagmus (must be monitored by the surgeon), subsequent injections last about 30 - 45 min.\nConfirm proper anesthesia, by verifying hypnosis, hyporeflexia, analgesia and muscle relaxation of the animal.\nGive subcutaneous injection (Pt. 3.3) in neck skin fold, once the rabbit is unconscious.\nAdd methylcellulose lubricant every 5 - 10 min in operated eye, add lubricant and tape lids in non-operated eye.",
    "Place the covered rabbit on the surgical table draped with a cover such as a cotton blanket in an optimal position (nose slightly elevated through a mold of the blanket, so it is level with ocular surface) under surgical microscope. Align eye perpendicular to microscope objective.\nEnsure proper body core temperature using rectal thermometer (normothermia 39 ± 1 ºC)29.\nCut eyelashes using scissors (some ointment on blade) to reduce postoperative infections.\nDisinfect the eye using 2 - 3 drops of 0.1 g/ml Povidone-Iodine topically for 1 min and rinse with sterile BSS.\nCover eye with sterile drape with pre-cut opening in the middle for the eye and then cover with (sticky) surgical incision drape 12 x 17 cm.\n4. Vitrectomy\nProptose and secure eye with 3-0 silk using inverted caliper and, perform a conjunctival peritomy.\n\t\nIncise the conjunctiva with a vannas scissor close to limbus but far enough from the blood vessels (~1 mm distance).\nDissect the conjunctiva by creating a \"T-cut\". First enlarge the peritomy with the scissor parallel to limbus and then incise the conjunctiva vertically in form of a \"T\" for about 6 - 7 mm. Carefully separate the conjunctiva bluntly.\nPerform a sclerotomy using a 23 G microvitreoretinal (MVR) blade at 8 o'clock on right eye/OD (4 o'clock on left eye/OS) by carefully inserting the sharp tip of the blade in direction towards the optic nerve. Slowly retract the blade in the same direction and avoid enlarging the sclerotomy.\nInsert and suture custom side port-infusion cannula27 using 7-0 silk suture and set intraocular pressure (IOP) at 24 mmHg.\nPerform a sclerotomy with 25 G flat head trocar at 2 o'clock on OD (10 o'clock on OS) similar to step 4.2.",
    "Insert 25 G chandelier light into flat head trocar, fixate with sticky tape and turn on light source at ca. 30%.\nIf needed, remove edematous corneal epithelium using a #20 scalpel for better intraocular visualization.\nPerform a sclerotomy similar to step 4.2 at 10 o'clock on OD (2 o'clock on OS), (pre-) place u-shaped 7-0 sutures around sclerotomy without tying the knot, and insert vitrectomy cutter tip.\nStart vitrectomy30 around the entry port, then continue over the optic disc and the fibrae medullares using high speed vitrector by cutting the vitreous humor into small pieces at max. 2,000 - 3,000 cuts/min, aspirating at max. 200 mmHg using the stated parameter setup of the vitrectomy machine (Table 1)\nPerform a posterior vitreous detachment (PVD) by separating the vitreous humor from the retina by holding the high speed vitrector over the posterior pole and (if feasible gently) superior of the disc31 while aspirating only at max. 200 mmHg without cutting.\nInject ca. 50 µl (20 mg) triamcinolone or diluted fluorescein (ca. 0.1 mg/ml) intravitreally to visualize and facilitate (near total) removal of the floating vitreous over the posterior pole and midperiphery during vitrectomy. Avoid crossing over under the lens. Indentation to shave peripheral vitreous by a (skilled) assistant is recommended if gas tamponade is desired.\nAdd 20 units/ml heparin and 0.5 mg epinephrine to final concentration of 0.001 mg/ml into the BSS infusion solution in parallel or after step 4.10.\n\tNote: As heparin/epinephrine are not injected intraocular their effects are delayed depending on infusion flow rate.\n5. Loading Shooter",
    "Note: The work described herein does not fall under the tenets of the Declaration of Helsinki; it did not involve human patients. Here, standard RPE cells were isolated from fetal human eyes, cultured and differentiated on uncoated 10-µm-thick polyester (PET) inserts according to our previously published protocol14. A permission to work with the human fetal material was obtained from the ethics committee of the University of Bonn. Alternatively, hES-RPE were shipped from the Skottman lab (manuscript in prep.), where they were cultured according to the technique described by Vaajasaari et al.32; for these cells a permission has been obtained from the R. Koch Institute, Berlin, Germany.\nRinse cell culture prior to preparation of the implant 3x with ophthalmic grade BSS.\nFill a standard cell culture dish (100 x 20 mm) with 10 ml ophthalmic grade BSS.\nAdd the cell culture insert into the BSS and center the dish under a light microscope.\nPunch out a 2.4 x 1.1 mm implant with a blunt, oval, custom-made needle to obtain a flat, bean-shaped substrate with two long edges and two round edges.\nGently flood the needle through the second port with BSS to flush out the implant into the BSS filled custom made loading station (Figure 1).\nOptionally cut one round end of implant (<0.5 mm), just to obtain a third edge.\nMake sure that the implant is in the right orientation by ensuring that the monolayer is upside on the cell carrier. To change positioning carefully use two scalpels.\nPush the implant gently and completely into the shooter instrument using the needle holder until all of the implant is secured inside of the tip. The plunger should remain retracted.\nKeep the \"loaded\" shooter tip in loading station under BSS until the moment of implantation.\n6. Implantation",
    "Approach neural retina with extendible 41 G subretinal injection needle connected to a gastight syringe (ensure that all air bubbles have been evacuated from tubing!).\nInject BSS (with calcium and magnesium/ CM) subretinally and thereby create a bleb retinal detachment (bRD) of about 2 - 3 disc diameter (DD). Two bRD per eye can be raised safely.\nEnlarge retinotomy to 1.5 mm with vertical 23 G VR-scissors. The subretinal space is now accessible for implantation or further maneuvering.\nExtend sclerotomy (precisely) with a 1.4 mm incision knife to 20 G approach.\nAttempt passing through the sclerotomy using a 20 G shooter dummy, enlarge as needed to ensure smooth, yet snug transition of the loaded shooter.\nPass with the loaded shooter27 through sclerotomy ideally at 24 mmHg.\nApproach retinotomy edge and eject the implant subretinally from an epiretinal position.\nAdjust the implant with half-closed 23 G scissors, forceps or 41 G needle to make sure it is positioned well under the retina- reasonably away from the retinotomy.\n7. Ending Operation\nRemove 25 G chandelier and infusion cannula.\nSuture all sclerotomies.\nInject 25 µl (10 mg) triamcinolone by the 8 o'clock sclerotomy (prior to suturing last sclerotomy).\nCheck/adjust IOP by palpation and inject BSS via 30 G needle/syringe, if needed.\nSuture conjunctiva with 7-0 vicryl.\nRemove proptosing 3-0 silk sling slowly (Avoid deep orbital venous plexus!).\nAdd dexamethasone/antibiotic ointment under lid.\nPosition for 1 hr covered with blanket with operated eye facing up (w/o gas), or down (with air/gas).\nDo not leave animal unattended until it regains sufficient consciousness to maintain sternal recumbence.\nDo not transport rabbit before the anesthesia fades completely, this can be speeded up by injecting medetomidine reversing agent equal to amount of medetomidine given.\n8. Post-operative Animal Care",
    "Keep rabbits under appropriate conditions (temperature, light, food, water, space, etc.) and close monitoring in a specialized facility.\nEnsure that animal is well rested, i.e., no extended periods of food or water deprivation.\nLook for any wounds or injuries, especially on injection sites.\nKeep wounds dry to prevent infections. Give antibiotics when infection is suspected: dexamethasone 1 mg/g, neomycin sulfate 3,500 I.U./g, polymyxin B sulfate 6,000 I.U./g ointment was applied twice daily for 1 week postoperative onto the ocular surface.\nAdd dexamethasone/antibiotic ointment for next 7 days postoperative twice daily for better ocular surface regeneration and reduced post-operative pain.\nGive systemic analgesics (Carprofene 4 mg/kg twice daily) for initial 48 hr.\nDo not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbence.\nDo not return an animal that has undergone surgery to the company of other animals until fully recovered.\nDo not expose animals to unnecessary distress.\n9. SLO/SD-OCT Guidance\nPrepare and inject intramuscular (IM) anesthesia using 1 syringe with 27 G needle containing 0.175 mg/kg ketamine and 0.125 mg/kg medetomidine for start. Flip the syringe to mix.\nAdd a lubricant at least every 5 min to moisturize eye and maintain clear SD-OCT imaging, optionally a custom contact lens may be used.\nAttach a steel platform to the headrest to stabilize the animal in the required position.\nPlace rabbit on steel platform, placing its eye perpendicular to probe.\nHold the rabbit's head from the lower cheek bone (mandibula) avoiding the trachea.\nTilt animal's head by roughly 45º towards the SD-OCT probe to optimize the viewing angle on the implant.",
    "Use a 30-degree lens and the following parameters for optimal OCT imaging [HS]: 30 degrees settings for single line scans with ART mode set to 100 (averaging) and 20 x 20 degree settings for volume scans with ART mode set to 15; high resolution mode is not required.\nUse SLO infrared reflectance imaging to find the focal plane of the implant (Fig. 2A); optimal focus is reached when (all) the implant edges are sharp14.\nAdd dexamethasone 1 mg/g, neomycin sulfate 3,500 I.U./g, polymyxin B sulfate 6,000 I.U./g ointment under lid when finished."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}