{
  "id": 19159,
  "origin_website": "Jove",
  "title": "Mouse Model of Surgically-induced Endometriosis by Auto-transplantation of Uterine Tissue",
  "procedures": [
    "1. Planning for live-animal surgery\nEnsure that appropriate approval has been received to work with laboratory animals.\nOrder mice and allow at least one week of acclimation to their new environment.\nFemale mice housed in the absence of exposure to male pheromones can stop cycling, a phenomenon referred to as the Whitten effect15,16. To keep mice cycling transfer urine-soaked male bedding to the female cage every five days. Alternatively, if open-top cages are used, place the female cage between two cages of males to keep the females cycling regularly.\nEnsure that mice are cycling by analyzing vaginal cytology daily for at least one week prior to surgery (Table 1)17.\n\t\nUse a wax pencil to create eight partitions on a glass slide so that vaginal smears from multiple mice can be collected.\nFlush the vagina with 0.2-0.25 mL normal saline or distilled water using an eyedropper. Be sure to place the eyedropper just at the vaginal orifice, as cervical stimulation with the eyedropper could cause pseudopregnancy. Place the vaginal lavage on the glass slide for analysis of cell types. Slides can be read fresh (wet) or alternatively fixed by a number of methods and examined using a standard light microscope17.\nGather, clean and sterilize all necessary surgical equipment for a successful aseptic surgery (see Material Section)18.\nPrepare buprenorphine solution for analgesia in PBS using sterile technique to deliver 0.2 mg/kg final dose. The concentration of the buprenorphine solution should be 0.0333 mg/ml assuming that the average adult C57BL/6 mouse weighs approximately 0.025 kg and a subcutaneous injection volume of 0.15 ml per mouse. Buprenorphine can be prepared ahead of time and stored as aliquots. Note that buprenorphine is a Schedule III controlled substance requiring a DEA license and detailed inventory log.",
    "Prepare sterile PBS with penicillin (100 U/ml) and streptomycin (100 μg/ml).\nSynchronize estrus cycles by transferring urine-soaked male bedding to the female cages 72 hours prior to induction15.\n2. Prepare the surgical area for live animal surgery\nPrepare the surgical area as previously described18.\nPrepare the preparation area by setting out electric clippers, ophthalmic ointment, and surgical scrubs.\nPrepare the surgical area by placing a recirculating hot water heating pad on the surgical area to maintain body temperature throughout the surgery. Place a sterile waterproof pad over the recirculating hot water heating pad. Arrange surgical instruments, suture, sterile glass Petri dish, biopsy punch, sterile gauze, wound clips and wound clip applicator on the sterile surgical field.\nPrepare recovery area by placing recirculating hot water heating pads halfway under an empty cage to allow mice to move away from the heat if so desired.\n3. Anesthetize and prepare the mouse for surgery\nRecord the weight of the mouse and determine estrus stage by evaluating the vaginal cytology.\nFor induction of anesthesia, place the mouse in an empty anesthesia chamber (empty cage with solid lid containing portal for isoflurane). Turn on isoflurane non-rebreathing anesthetic system and set the vaporizer to 4% isoflurane (with an oxygen flow rate of 0.5 to 1 L/min).\nWhen the mouse is under anesthesia switch the isoflurane flow to a cone (30-60 ml syringe sheath) and place mouse's nose and mouth in the cone on preparation table. Adequate anesthesia can be maintained with a lower concentration of isoflurane throughout the remainder of the surgery (~2.5-3.5% isoflurane). Adequate depth of anesthesia should be determined by a negative response to toe pinch stimulus.\nApply ophthalmic ointment to avoid drying of the eyes during surgery.\nUsing small electric clippers, shave the surgery site.",
    "Disinfect and prepare the surgery site with three alternating swipes of chlorhexidine scrub and 70% ethanol.\nDrape animal with a sterile field.\n4. Uterine ligation\nMake a small (~1 cm) midline incision using either small scissors or a scalpel blade ending 0.5 - 1.0 cm rostral to the vaginal opening.\nInsert closed scissors into the opening such that the blades are between the body wall and abdominal wall. Gently blunt dissect the area around the incision by slowly opening and closing the scissors such that the abdominal wall is sufficiently detached from the skin. Remaining visible adhesions between the abdominal wall and skin around the incision site can be carefully snipped. Failure to adequately blunt dissect the incision site will make closing the abdominal wall more difficult.\nUsing small forceps, gently locate the left uterine horn. The uterus is dorsal to the intestine, which is what you will see upon first entering the incision site. In some instances it is easiest to first locate the ovary and the associated ovarian fat pad. Gently pull up on the uterine horn and slide an open forceps underneath it to serve as a retractor. If desired, note the appearance of the ovaries and uterus at this time for additional information regarding the estrus stage at induction (Table 1).\nGently slide two 6-8 cm pieces of 5-0 black braided silk suture (without a needle) underneath the stretched uterine horn.\nSecurely ligate the horn at the utero-tubual junction (just caudal to the fallopian tube) and at the utero-cervical junction (just rostral to the cervix) using a square knot at each location. Leave the ends of the suture for the moment.",
    "Cut out the section of uterine horn between the two ligations and place the tissue in a sterile glass Petri dish containing ~100 μL of PBS containing penicillin (100 U/ml) and streptomycin (100 μg/ml). Cut the ends of the silk suture last. If suture comes loose or there is bleeding, find the stump and tie another knot.\n5. Prepare endometriotic implants from excised uterus\nWhile the excised uterus is being manipulated, cover the abdomen with sterile gauze and maintain hydration with sterile PBS containing penicillin and streptomycin as needed.\nStrip the excised uterine horn of fat.\nIf desired, weigh the excised uterine horn.\nOpen the uterine horn by inserting one blade of small scissors (14 mm blade length) into the lumen and gently sliding the scissors down the uterine horn while holding the horn with forceps.\nIn the glass Petri dish, use a 2 mm biopsy punch to cut out three equal sized implants.\n6. Suturing endometriotic implants in peritoneal cavity\nPlace sterile gauze immediately above the incision site and thoroughly wet with sterile PBS containing penicillin and streptomycin.\nWith small, smooth forceps gently find the cecum and move rostrally along the small intestine. Pull out a small (4-5 cm) section of intestine that is at least two arteries away from the cecum and arrange it like a fan on the pre-wetted gauze so that the arterial cascade of the intestinal mesentery is clearly visible. Be sure to keep the bowel moist at all times with sterile saline. Note: do not use rat-toothed forceps while handling the bowel.\nUse 6-0 black ethilon suture with a P-1, 11 mm, 3/8 circle, reverse cutting needle to gently suture one implant to an artery approximately 0.5 cm from the bowel.",
    "Note: The intestinal mesentery is covered by a thin layer of peritoneum. Be careful to make a clean pass through this layer while suturing around the artery. Pull suture through slowly and carefully as not to tear the peritoneum or rupture the artery.\nComplete two knots of one throw each, being careful not to tighten the suture very hard, as doing so may result in loss of blood flow and subsequent necrosis of the intestine and death. Trim the suture within 2 mm of the implant. Wet bowel again to continue to maintain hydration before moving on to next implant.\nMoving in a rostral direction, pull out the next 3-4 cm of intestine and gently replace the section that already contains an implant. Skip one or two arteries from the previous implant site and suture the next implant. Repeat for the third implant.\nReplace all of the bowel in the abdominal cavity.\n7. Sham surgeries\nSham surgeries are performed using the same steps as the endometriosis surgeries except that no tissue is sutured to the intestinal mesentery.\nExcise the left uterine horn as in step 4.\nEndometriotic implants (step 5) are not prepared in the sham surgery. The excised uterine horn can be discarded or used for other purposes if desired.\nSutures, but no tissues, are placed around three arteries in the arterial cascade of the intestinal mesentery as in step 6.\n8. Closing the surgical wound\nEnsure that all of the organs are approximately back to their anatomical position.\nUse 5-0 coated vicryl suture in a non-interlocking continuous stitch to close the abdominal wall.\nUse 9 mm wound clips to close the skin.\n9. Recover animal",
    "Administer 0.33 mg/ml buprenorphine at 0.15 ml/25 g mouse via subcutaneous injection for a dose of 0.2 mg/kg. Buprenorphine is administered post-operatively to prevent further cardiovascular/respiratory depression that can lengthen the recovery process.\nGently dry the mouse with kimwipes or paper towels if it has gotten wet during the surgery.\nPlace animal ventral side down in cage partially atop a recirculating heated water pad until the animal is recovered and has regained sternal recumbency (within five minutes as the inhalant anesthetic quickly wears off).\n10. Post-operative care\nMice should be observed every 15 minutes until they are able to maintain sternal recumbency, then hourly until they regain their normal behavior following surgery.\nMice should appear normal within 24 hours of surgery. Mice should be monitored daily for seven to ten days for signs of recovery and good health.\n\t\nIndications that an animal is in poor health, pain, or distress include decreased activity, self-mutilation, ungroomed appearance, or hunched posture.\nIf an animal does not appear to be in good health within 24 hours of surgery, either administer buprenorphine (0.2 mg/kg) or euthanize the animal. If the animal does not improve within 8 hours of supplemental buprenorphine administration the animal should be euthanized as bowel necrosis is likely.\nRemove wound clips 7-10 days post-induction.\nContinue to monitor estrus cyclicity by examination of vaginal cytology for the duration of the experiment. Synchronize estrus cycles 72 hours prior to collection by transferring urine-soaked male bedding to the female cages as described in step 1.3.\n11. Necropsy and tissue excision\nThe timing of necropsy is dependent on the particular research question and is further discussed in the representative results and discussion.\nEuthanize the mouse by carbon dioxide asphyxiation.\nCollect blood by cardiac puncture using a 23 gauge needle on a 1cc syringe (if desired).",
    "Collect a vaginal cytology smear as described above to determine estrus stage at the time of collection17.\nCut remaining uterine horn at utero-tubal junction and at the cervix, remove fat, weigh, and process as desired (see 11.14 and 11.15).\nLocate the black sutures around the endometriotic lesions. Photograph intact endometriotic lesions if desired.\nCarefully dissect the adhesions surrounding the endometriotic lesions with a small scissors and forceps, being careful not to lance the lesions. Work quickly and carefully to prevent RNA degradation.\nMeasure and record the length and width of the endometriotic lesions using calipers.\nExcise the endometriotic lesions and place on a paper towel moistened with PBS. Remove any non-endometriotic tissue from the lesions. A dissecting microscope or magnifying glass stand can be used to aid in the dissection.\nWeigh the three fluid filled endometriotic lesions prior to removing the suture.\nGently remove the suture from the endometriotic lesions.\nFor histology, formalin fix one fluid filled endometriotic lesion for two hours followed by three thirty minute PBS washes and final storage in 70% ethanol. Dehydrate and paraffin embed.\nLance two of the endometriotic lesions. Weigh these again. Since cyclic hormonal changes can alter the amount of cyst fluid, this gives a measure of the tissue wet-weight in addition to the weight of the cyst plus the fluid as measured in 11.10.\nFor RNA isolation and gene expression studies, immediately homogenize one of the lanced endometriotic lesions (or ~20 μg uterine tissue) in lysis binding solution and store at -80°C for future RNA isolation with the RNAqueous kit (Ambion) or other method as desired.\nFor future isolation of RNA, DNA, or protein, immediately snap-freeze the second lanced endometriotic lesion (or ~20 μg uterine tissue) in liquid nitrogen and store at -80°C.\nRepresentative Results",
    "Endometriotic lesions in the mouse model of surgically induced endometriosis morphologically and histologically resemble those observed in women. Histological analysis of endometriosis in both women and the mouse model indicates that endometriotic lesions contain endometrial glands and stroma (Figure 2A). Endometriotic lesions in mice also contain hemosiderin-laden macrophages, which are a common hallmark of endometriosis in women (Figure 2B)19.\nEndometriotic lesions removed from mice three days post-induction appear inflamed and hemorrhagic (Figure 3A). After two to four weeks of growth endometriotic lesions in the mouse model are cyst-like, fluid filled and surrounded by peritoneal adhesions (Figures 3B and 3C). Compared to lesion weight at induction, fluid filled lesions were 306% and 862% larger at one and two months post-induction and lanced lesions were 51% and 172% larger, respectively (Figures 4A and 4B). We have obtained consistent fluid filled and lanced endometriotic lesion weights at one-month post-induction over five different experiments (Figure 5). At one month post-induction fluid filled (7.44±3.75 mg) and lanced (2.92±1.23 mg) endometriotic lesion weight were significantly correlated (Pearson's correlation coefficient = 0.669, p < 0.001).\nAge of the mouse did not affect lesion size for mice between three and ten months of age. Neither the fluid filled or lanced endometriotic lesion weight at one month post-induction was significantly correlated with the age of the animal (r = -0.136, p = 0.380 and r = -0.063, p = 0.698, respectively).",
    "The mouse uterus undergoes changes in size, fluid retention, cell proliferation and appearance due to the influence of steroid hormones during the estrus cycle. We compared the endometriotic lesion weight to the weight of the remaining intact uterine horn from animals in different estrus stages. We did not find a significant correlation between uterine weight and fluid filled or lanced endometriotic lesion weight at one-month post induction (r = -0.046, p = 0.765 and r = 0.232, p = 0.155, respectively).\nThe gene expression pattern observed in the endometriotic lesions of mice closely mirrors that reported in women with the disease5. By three days post-induction genes regulating extracellular matrix remodeling, cell adhesion, and angiogenesis are highly upregulated and many of these genes remain upregulated through one month of growth.\nFigures and Tables\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396fig1.jpg\nFigure 1.  Surgical induction of endometriosis by autologus uterine tissue transfer in the mouse. The left uterine horn is ligated, excised, and opened longitudinally to expose the endometrium. Three 2 mm2 biopsies are prepared and each is sutured to an artery in the arterial cascade of the intestinal mesentery. By one month post-induction the endometriotic lesions are fluid filled and surrounded by adhesions.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396fig2.jpg\nFigure 2.  Hematoxylin and eosin stained section of an endometrial lesion from the mouse model of endometriosis at one month post-induction demonstrating (A) the presence of endometrial glands and stroma; scale bar = 50 μm and (B) hemosiderin-laden macrophages, some of which are indicated by arrows; scale bar = 20 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396fig3.jpg\nFigure 3.  Endometriotic lesions in the mouse model following euthanasia, either three days post-induction (A) or one month post-induction (B and C).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396fig4.jpg",
    "Figure 4.  Endometriotic lesions from mice surgically induced to have endometriosis were excised and weighed at one or two months post-induction. Data are average±SEM. Data were log transformed and different letters indicate significance within each panel by one-way ANOVA followed by one-sided Fisher's Least Significant Difference Mulitple Comparisons. (A) Cyst like, fluid filled endometriotic lesions (N = 10, 7 or 5 for induction, one month, or two month post-induction, respectively). (B) Lanced endometriotic lesions (N = 10, 8 or 7 for induction, one month or two month post-induction respectively).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396fig5.jpg\nFigure 5.  Endometriotic lesion wet weight with fluid and lanced at one month post-induction from five separate experiments. Data are average±SEM. Mice N=10, 6, 8, 7 and 7 for fluid filled lesions and 0, 7, 10, 8, and 8 for lanced lesions in experiment 1, 2, 3, 4, and 5, respectively.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396table1.jpg\nTable 1. Observation of Estrus Stage by Vaginal Cytology and Visual Appearance of Ovaries and Uterus and Induction.\nAppearance of ovary and uterus will be time dependent. The following are based on sacrifice around 8:00 am the morning of each cycle day. Further, the observations are subjective and comparing the ovary and uterine horns will be a better estimate than uterine horns only. These observations are meant to supplement the information obtained from daily vaginal cytology readings.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3396/3396table2.jpg\nTable 2. Comparison of surgery in mouse and rat.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}