{
  "id": 3056,
  "origin_website": "Cell",
  "title": "Protocol to prepare doubly labeled fluorescent nucleosomes for single-molecule fluorescence microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHistones over-expression and purification\nTiming: 9 days\nThe following procedure is for over-expression of recombinant human core histones in E. coli, extraction from inclusion bodies and purification by ion exchange. It is informed by previously published protocols3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5] with modifications. Over-expression is in pET3a plasmid vector, regulated by T7 promoter and induced by IPTG.\nOver-expression of recombinant human core histones\nTiming: 3–4 days\nNote: For purposes of fluorescent labeling, you should confirm that you are expressing the target histone that contains only a single Cysteine residue at the required labeling site (e.g., H2A K119C mutant as an example here).\nNote: In our hands, human H2B is better expressed in BL21(DE3) cells, while all other core human histones are expressed better in Rosetta 2(DE3) pLysS strain.\nNote: In all steps shown below, final concentrations of Carbenicillin (Carben), Chloramphenicol (CAM) and glucose are 50 μg/mL, 34 μg/mL and 0.1% (w/v), respectively, unless otherwise stated.\nSmall-scale expression check of several colonies.\nNote: Expression of recombinant human core histones in E. coli is often associated with large fluctuations in cell growth rate and protein yield. Hence, for reproducibility, we recommend carrying out small-scale expression of several colonies every time you express the same histone type.\nNote: Usually there are large fluctuations in expression level among different colonies from the same transformation experiment.\nNote: A small-scale expression check is also a good opportunity to optimize expression conditions (e.g., cell density at induction time and IPTG concentration) when mutants and WT of a certain histone type are associated with different cell expression behaviors.\nTransformation:\nEquilibrate fresh agar plates supplemented with Carben and CAM (or Carben only in case of H2B) to 22 C.\nNote: Store Carben and CAM stocks at −20°C for up to 1 year.",
    "Mix 1 μL of plasmid (of 50–100 ng/μL concentration) with 50 μL chemically competent Rosetta 2 (DE3) pLysS cells (or BL21 (DE3) in case of H2B).\nHeat shock following cells manufacturer’s recommendation (https://www.emdmillipore.com/US/en/product/Rosetta-2DE3pLysS-Competent-Cells-Novagen,EMD_BIO-71403#anchor_USP[href=https://www.emdmillipore.com/US/en/product/Rosetta-2DE3pLysS-Competent-Cells-Novagen,EMD_BIO-71403#anchor_USP]).\nNote: In our hands, we incubate the plasmid-cells mixture on ice for 15 min, then incubate at 42°C for 45 s, then incubate back on ice for 5 min.\nAfter heat shock, incubate plasmid-cell mixture in 1 mL of LB media (inside 15-mL sterile tubes) at 37°C for 30 min, shaking at 300 rpm.\nSpread 100 μL of plasmid-cell-LB mixture on an agar plate.\nIncubate for 16 h at 37°C.\nInoculating small liquid cultures:\nTransfer 10 mL sterile 2×YT supplied with 10 μL Carben and 10 μL CAM (or Carben only in case of H2B) and 50 μL of 20% glucose to each of 6 (or more) sterile 50 mL tubes.\nNote: Store glucose stock at - 20°C for up to 6 months.\nTransfer a single colony to each tube.\nIncubate these small cultures at 37°C, shaking at 220 rpm until only slightly turbid.\nNote: This will take 3–4 h for the histones grown in Rosetta 2. H2A will take the longest time. In the case of H2B expressed in BL21, this will take ∼ 2 h.\nGlycerol stocks:\nFrom each liquid culture, transfer 0.5 mL to sterile 1.5 mL tube then mix with 0.2 mL sterile 80% glycerol.\nNote: Store 80% glycerol stock at 22°C.\nStore all these glycerol stocks at −80°C (one will be used later for large-scale expression).\nInduction & incubation:",
    "Induce expression by adding IPTG with concentrations of 0.4 mM, 0.2 mM, 0.4 mM and 0.2 mM for H2A, H2B, H3 and H4, respectively, by adding 4μL, 2μL, 4μL, and 2 μL of 1 M IPTG stock to each 10 mL liquid culture for H2A, H2B, H3 and H4, respectively.\nNote: Store IPTG stock at −20°C for up to 1 year.\nKeep one small culture without IPTG to be used as an uninduced control.\nIncubate these small cultures at 37°C, shaking at 220 rpm for 4, 2, 3, and 3 h for H2A, H2B, H3 and H4, respectively.\nHarvesting cells:\nSpin liquid cultures at 22°C for 20 min at 7,000 × g, then discard supernatant.\nStore cell pellets at –20°C for analysis later (or, instead, go to step 6).\nSDS-PAGE (SDS-polyacrylamide gel electrophoresis) analysis of expression in different colonies:\nLyse the cell pellet from each of the 10 mL liquid cultures by mixing with 500 μL MilliQ H2O and resuspend very well by pipetting up and down for 3 min.\nFor each cell pellet mix 10 μL total cell lysate with 2 μL gel loading solution (6×).\nHeat at 95°C for 7 min.\nSpin at 22°C for 6 min at 4,600 × g.\nLoad supernatants only on a 15% (29:1) SDS-polyacrylamide gel (for best results use 15-well, 7 × 8 × 1.5 mm, W × H × D).\nRun samples on gel at 120 V for 75 min.\nStain and image the gel to determine which colony has the best expression.\nStreaking agar plates from glycerol stocks:\nStreak an agar plate with the glycerol stock of the best expressing colony. The plate should be supplied with Carben and CAM (or Carben only in case of H2B).\nIncubate for 16 h at 37°C.\nLarge-scale expression.\nStarter cultures (4 mL):",
    "Transfer 4 mL 2×YT, 20 μL glucose, 4 μL Carben and 4 μL CAM (or Carben only in case of H2B) to each of five sterile 50 mL tubes.\nInoculate each of the five tubes with a single colony (all from the same agar plate).\nIncubate starter cultures shaking at 250 rpm until slightly turbid as follows:\nH2A for 16 h at 21°C (sometimes additional incubation at 37°C for 1–2 h is necessary).\nH2B for 2 h at 37°C.\nH3 for 16 h at 21°C.\nH4 for 16 h at 21°C.\nPre-culture (100 mL):\nTransfer 100 mL 2×YT, 0.5 mL glucose, 100 μL Carben and 100 μL CAM (or Carben only in case of H2B) to a single sterile 500 mL flask.\nKeep aside 2 mL liquid media to be used as blank solution for OD600 (optical density at 600 nm) measurements.\nInoculate the pre-culture with the following number of 4-mL starter cultures:\nFor H2A, 4 starter cultures.\nFor H2B, inoculate with only the most turbid starter culture.\nFor H3, 2 starter cultures.\nFor H4, 4 starter cultures.\nIncubate pre-culture shaking at 220 rpm at 37°C until OD600 is as follows:\nFor H2A, OD600 = 0.5 (∼ 5–6 h).\nFor H2B, OD600 = 0.1–0.2 (∼ 2 h).\nFor H3, OD600 = 0.4 (∼ 1.5 h).\nFor H4, OD600 = 0.4 (∼ 2 h).\nCultures (per 1 L):\nCarry out large-scale expression in total 2 × 1 L culture for each histone.\nAdd 5 mL glucose, 0.75 mL Carben and 0.75 mL CAM (or Carben only in case of H2B) to each sterile 3 L flask containing 1 L of 2×YT.\nKeep aside 2 mL liquid media to be used as blank solution for OD600 measurements.\nTransfer 20 mL pre-culture to each 1 L liquid media.",
    "Incubate the cultures shaking at 220 rpm at 37°C until OD600 = 0.4-0.5 (∼ 3–4 h).\nInduction & incubation:\nInduce expression by adding IPTG at 0.4 mM, 0.2 mM, 0.4 mM and 0.2 mM for H2A, H2B, H3 and H4, respectively, by adding 0.4 mL, 0.2 mL, 0.4 mL, and 0.2 mL of 1 M IPTG stock to 1 L liquid culture for H2A, H2B, H3 and H4, respectively.\nIncubate the cultures at 37°C shaking at 220 rpm for 4 h, 2 h, 3 h, and 3 h for H2A, H2B, H3 and H4, respectively.\nHarvesting cells:\nKeep aside 10 mL from each 1 L liquid culture to test expression from total cell lysate using SDS-PAGE before going to extraction of inclusion bodies and purification.\nSpin cultures at 6,000 rpm for 30 min at 4°C.\nThoroughly resuspend the cell pellet from each 1 L culture in 30 mL 2×YT, then transfer it to a sterile 50 mL tube and spin for 30 min at 7,000 × g at 4°C.\nDiscard supernatant.\nStore pellets at −20°C (for weeks) or at −80°C (for months).\nExtraction of histones from inclusion bodies (IBs)\nTiming: 1 day\nDo all the steps of this process at 22°C (except freeze/thaw cycles and sonication). The steps shown below will be done for cell pellet from 1 L liquid culture.\nResuspend pellet from 1 L liquid bacterial culture in 20 mL histone lysis buffer. Resuspend very well by pipetting and vortexing.\nNote: Store benzamidine stock at – 20°C for up to one year. Store EDTA, NaCl and Tris-Cl stocks at 22°C for up to 6 months.\nNote: Store histone lysis buffer at 22°C.\nNote: Add BME and benzamidine to histone lysis buffer only at time of use.",
    "Do four freeze /thaw cycles (using dry ice and a 37°C water bath).\nStir the cell suspension for 20 min with magnetic stirrer in a beaker.\nAdd Triton X-100 to cell resuspension (1% or 0.2 mL in 20 mL lysis buffer).\nStir for an additional 10 min.\nTransfer to a stainless-steel beaker.\nSonication: Do 10 cycles of 10 s ON, 30 s OFF (total 400 s) using an amplitude of 400 Watts power and a frequency of 20 kHz.\nNote: Keep the beaker on ice during the whole sonication process (to avoid over-heating).\nNote: Use flat tip for sonication (see key resources table[href=https://www.wicell.org#key-resources-table]).\nSpin cell lysate at 7,000 × g for 40 min.\nDiscard supernatant.\nResuspend pellet in histone lysis buffer supplemented with 1% Triton x-100 (20 mL per 1 L pellet).\nSpin at 7,000 × g for 30 min.\nDiscard supernatant.\nRepeat steps 22–24.\nResuspend pellet in buffer without Triton (20 mL per 1 L pellet).\nSpin at 7,000 × g for 30 min.\nDiscard supernatant.\nYou can stop here and store the pellet at −80°C or continue to the next step.\nAdd 500 μL DMSO to the pellet then break up well with a spatula.\nLet sit at 22°C for 30 min.\nSlowly add histone Gdn-HCl buffer (10 mL / 1 L cell pellet).\nNote: Store DTT stock at −20°C for up to 6 months.\nNote: Store histone Gdn-HCl buffer at 22°C. Add DTT only at time of use.\nMix with spatula then transfer to a beaker.\nStir for 1 h at 22°C.\nSpin at 7,000 × g for 30 min.\nSave supernatant. It contains the solubilized histone.\nRe-extract the pellet from step 36, repeating steps 30–36.\nKeep 20–30 μL sample before dialysis to check for protein expression by SDS-PAGE.",
    "Prepare 2.5 L of 8 M urea. Add 50 g mixed ion exchange resin and stir for 1 h.\nNote: Keep 8 M urea at 22°C. Do not use urea solution older than 2 days.\nDialyze for 16 h each 20 mL histone extract into 2.5 L of 8 M urea at 22°C. Mixed ion exchange resin should still be outside of the dialysis cassette.\nNote: Use 3.5 kDa MWCO dialysis cassette.\nNote: Do not store the histone extract in urea, even at −20°C or −80°C as this can lead to carbamylation of the histones.\nPurification of histones with ion exchange chromatography\nTiming: 4 days\nDo all the steps of this process at 22°C.\nRecover histone extract from dialysis cassette.\nKeep aside 50 μL sample from the dialysis products for SDS-PAGE analysis.\nRemove the beads of the mixed ion exchange resin from the 8 M urea solution used for dialysis using bottle-top filter. This 8 M urea solution can be used for purification below.\nQ-sepharose removal of negatively charged biomolecules (e.g., nucleic acids).\nPre-equilibrate 5 mL Q-Sepharose into 8 M urea as follows:\nPour Q-Sepharose resin into a clean glass gravity column.\nLet settle into the glass column.\nDrain storage solution from Q- Sepharose.\nWash with 6 column volumes (CV) of MilliQ H2O before mixing with urea from step 43 (30 mL total).\nWash with 3 CV of 8 M urea (15 mL total).\nIncubate the dialyzed histone extract with pre-equilibrated Q-Sepharose resin for 1 h while rocking.\nCollect flow-through from the column (use peristaltic pump if desired to increase flow. Use only 30% of maximum flow rate. See key resources table[href=https://www.wicell.org#key-resources-table] for product specifics).\nWash the column with an additional 6 CV (30 mL) of 8 M urea.\nKeep the wash.\nSP-sepharose purification of positively charged histones.",
    "Pre-equilibrate 25 mL SP-Sepharose into 8 M urea as follows:\nPour SP-Sepharose resin into a clean glass gravity column.\nDrain the storage solution from it.\nWash with 6 CV (150 mL) of MilliQ H2O.\nWash with 3 CV of 8 M urea (75 mL total).\nMix the first flow-through from the Q-sepharose with the pre-equilibrated 25 mL SP-Sepharose.\nIncubate this mixture for 2 h while rocking.\nDiscard the flow-through.\nRun the wash from Q-sepharose over SP-sepharose.\nDiscard the flow-through.\nWash with an additional 2 CV of 8 M urea.\nElute with a step gradient of NaCl by pouring 30 mL of 200 mM, 300 mM, 400 mM, 500 mM, 600 mM, and 700 mM NaCl in 8 M urea in a stepwise manner. Save the flow through fraction of each gradient step.\nNote: These NaCl solutions in urea should be made fresh and kept at 22°C.\nSDS-PAGE analysis of elution fractions.\nPrepare a 15% (29:1) SDS polyacrylamide gel. For best results, use a gel with dimensions of 7 × 8 × 0.15 cm (W × H × D, with 15 wells, and 40 μL well volume).\nMix 10 μL of each fraction with gel loading solution then load on gel.\nRun samples at 120 V for 75 min in presence of 1× Tris/glycine/SDS gel running buffer.\nStain and destain gel according to instructions of stain manufacturer (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011533_Imperial_Protein_Stain_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011533_Imperial_Protein_Stain_UG.pdf]).\nPool fractions that have the target protein (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig2.jpg\nFigure 2. Image of a representative 15% (29:1) SDS polyacrylamide gel of recombinant human histone purified with ion exchange chromatography\nThe example gel shown is for H3 histone. Only 500, 600, and 700 mM NaCl fractions of elution from SP-Sepharose column were pooled. The gel was stained with Coomassie Brilliant Blue. PS: protein standards; L: sample loaded on Q-Sepharose column.",
    "Dialysis into MilliQ H2O.\nNote: Usually you will pool 2–3 fractions, which is equivalent to 60–90 mL total pool volume.\nNote: Start dialysis on the day of ion exchange chromatography so that histones are not exposed to Urea for too long.\nDialyze fractions containing histones into 2.5 L MilliQ H2O supplemented with 2 mM BME (0.35 mL of 14 M stock).\nNote: Use 3.5 kDa MWCO dialysis cassette with a volume bigger than the total volume of the fractions containing histones because the volume increases by ∼ 30% after 5 steps of dialysis.\nChange dialysis H2O for a total of 5 times, with at least 2 steps running for 16 h each. Add BME every time.\nConcentrating, lyophilizing, and mass spectroscopy analysis of purified histones.\nRecover histone solution from dialysis cassette.\nKeep some dialysis solution to use later.\nNote: This dialysis solution will be used for (1) blanking while measuring concentration by UV absorption spectroscopy and (2) cleaning the centrifugal filter before concentrating the histone solution.\nRemove any particles in the histone solution by spinning at 7,000 × g for 10 min.\nConcentration of histone solution:\nClean a pair of 15 mL centrifugal filters (3.5 kDa MWCO) with dialysis solution by spinning at 5,000 × g for 10 min, then discard any remaining solution.\nConcentrate the histone solution 12-fold.\nNote: The speed and time required will depend on the brand of the centrifugal filter.\nFilter any undissolved particles using 0.22 μm syringe filter.\nSet aside ∼ 50 μL of the histone solution.\nMeasure the concentration using the absorbance at 280 nm and molar absorption coefficient for each specific histone (see this information in Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_2599_9.csv\n# Numbering of residues starts after the first methionine.\naH2A K119C # mutant used in this protocol is derived from this WT H2A.",
    "bCalculated using Expasy ProtParam (https://web.expasy.org/protparam/[href=https://web.expasy.org/protparam/]).\ncSequence shown without the first Methionine.\ndWe used in this protocol H3 carrying G102A# and C110A# mutations.\nCheck quality of purified histone using 15% (29:1) SDS-PAGE.\nFlash freeze the concentrated histone solution in 50 mL conical tubes then lyophilize.\nNote: Do not exceed 20–30 mL solution per tube.\nNote: Depending on lyophilizer, this step may take 1–2 days for 10–20 mL histone solution.\nMass spectroscopy analysis: it is critical to check for any carbamylation through MALDI (Matrix-assisted laser desorption/ionization) or ESI (Electrospray ionization) mass spectroscopy or any equivalent technique.\nNote: Resuspend a portion of the lyophilized histone in MilliQ H2O with concentration and volume according to the instructions of the mass spectroscopy facility in your institution.\nFluorescent labeling of histones\nTiming: 2 days\nThe following procedure is for labeling a histone containing a single Cysteine residue with fluorescent dye maleimide under denaturing conditions. In this specific example, human H2A K119C is labeled with Cy3.5 maleimide. The procedure and compositions of buffers are informed by previously published reports.6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8]\nLabeling\nTiming: 1 day\nDo all the work of this procedure under the minimum light possible.\nEquilibrate lyophilized histone and fluorescent dye to 22°C for ∼ 1 h (in the dark).\nWeigh 1 mg histone into an autoclaved microcentrifuge tube.\nMix it with 800 μL labeling buffer for a concentration of ∼ 90 μM.\nNote: Make the labeling buffer fresh before use. Store at 22°C.\nAdd 2 μL of 0.5 M TCEP to the mixture (final concentration is 1.25 mM) to stabilize the free sulfhydryls.\nNote: Store TCEP stock at −20°C for up to 6 months.\nIncubate for 2 h at 22°C while mixing using a tube revolver.\nMeasure the absorbance at 280 nm (A280) of the histone mixture and determine its concentration.",
    "Note: Blank using labeling buffer (after supplying with TCEP).\nNote: See Table 1[href=https://www.wicell.org#tbl1] for molar absorption coefficient values at 280 nm.\nKeep aside 15 μL of the histone solution for analysis with SDS-PAGE.\nNote: This sample will be used as a reference for determining the concentration of the clean labeled histone using SDS-PAGE.\nMix 1 mg of Cy3.5 maleimide with 26.5 μL DMSO by slowly pipetting up and down (dye concentration should be 31.5 mM). Do this mixing away from light.\nTransfer all of the dye solution to the histone solution (total volume ∼ 828.5 μL) leading to the dye ∼ 11× molar excess over histone (∼ 87 μM histone and ∼ 1 mM dye).\nIncubate for 16 h at 4°C in the dark while mixing using tube revolver.\nFurther incubate at 22°C for 1.5 h.\nRemoving excess dye\nTiming: 5 h\nDo all the work of this procedure at 22°C.\nWash a pair of centrifugal filters (Microcon-5, 0.5 mL, 5 kDa) before use as follows:\nFill each filter with labeling buffer.\nSpin at 12,000 × g for 5 min.\nReverse spin at 21,000 × g for few seconds.\nNote: ‘Reverse spin’ means invert the filter in the tube upside-down then spin.\nNote: Reverse spin just before transferring the crude labeled histone to the filter.\nStop the labeling reaction by adding ∼5 μL of BME (final concentration ∼ 84 mM).\nKeep aside 15 μL sample for SDS-PAGE analysis.\nTransfer half the crude fluorescent histone solution to each centrifugal filter.\nSpin at 12,000 × g for 45 min, or until the volume in each filter is reduced to a third of the original volume (that is ∼ 140 μL).\nTransfer the filters with the histone solution to two new tubes.\nFill each filter with fresh labeling buffer.",
    "Note: Use labeling buffer that contains 7 M Gdn-HCl, instead of H2O, because some fluorescently labeled histones, like H3, aggregate upon switching to water, although they are originally soluble in water in the unlabeled form.\nRecover the labeled histone by reverse spinning for 10 s at 21,000 × g.\nWash two new centrifugal filters as in step 85.\nSplit the labeled histone solution into the two new filters.\nSpin at 12,000 × g until the volume in each filter is reduced to a third of the original volume (≤ 30 min).\nRepeat removing excess dyes with a third pair of new filters (i.e., total three rounds of spinning each with a new pair of filters).\nSpin at 12,000 × g until the total volume in both filters is reduced to 120 μL (≤ 30 min).\nKeep aside 5 μL of purified labeled histone for SDS-PAGE analysis.\nAliquot the purified fluorescent into 20 μL aliquots.\nFlash freeze and store at −80°C.\nSDS-PAGE determination of fluorescently labeled histone concentration\nTiming: 5 h\nPrepare a 15% (29:1) SDS-polyacrylamide gel with dimensions 7 × 8 × 0.15 cm (W × H × D).\nNote: For best results, use a 10 -well gel, with well dimensions of 0.5 × 1 × 0.15 cm, and well volume of 65 μL. This is necessary for loading 50 μL per well as shown below.\nPreparation of histone samples for SDS-PAGE:\nNote: Calculations, dilutions, and mixing shown below are aimed towards loading ≥ 5 μg histone of each sample per well.\nRun the following histone samples on the same SDS gel:\nUnlabeled histone sample from step 80. This will be the reference for the determination of the total mass loaded per well of the purified labeled histone sample.\nCrude labeled histone before removing excess dye from step 87.",
    "Purified labeled histone after removing excess dye from step 98.\nInitial concentrations of the samples:\nUnlabeled histone concentration is 1 mg/800 μL (∼ 90 μM), so 5 μL is equivalent to ∼ 6 μg.\nCrude labeled histone concentration before cleaning is 1 mg/828.5 μL or ∼ 87 μM (assuming no loss during labeling), so 5 μL is equivalent to ∼ 5.5 μg.\nPurified labeled histone is ∼ 7× concentrated (assuming no loss during labeling).\nDilutions:\nFor purified labeled histone, dilute 7× (i.e., 1 μL sample + 6 μL MilliQ H2O).\nMixing: total volume of each sample to be loaded per well is 50 μL.\nFor both unlabeled and crude labeled histone, mix 5 μL sample, 8.33 μL gel loading solution (6×) and 36.66 μL MilliQ H2O.\nFor purified labeled histone, mix 5 μL of 7× diluted sample, 8.33 μL loading solution (6×) and 36.66 μL MilliQ H2O.\nHeat the samples at 95°C for 5 min before loading on the SDS gel.\nRun samples on the SDS gel, while covered from light, at 120 V for 1 h 45 min (or until free dye reaches the bottom of gel).\nCarry out fluorescence imaging of the gel while it is still between the glass plates. For histones labeled with Cy3.5, you can use the ordinary Cy3 channel of the gel imager (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig3.jpg\nFigure 3. Images of 15% (29:1) SDS-polyacrylamide gel of Cy3.5-labeled H2A K119C histone\n(A) Fluorescent image of the gel. The Cy3.5-labeled histone and the free Cy3.5 dye can be observed. The gel image shows that the labeling was successful, and the vast majority of the free dye is removed.",
    "(B) The image of the same gel after staining with Coomassie Brilliant Blue. PS: protein standards; UH: unlabeled histone; LB: labeled histone before removing excess dye; LA: labeled histone after removing excess dye; FT: flow-through from the third centrifugal filter.\nTake the gel off the glass plates and stain and destain according to manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011533_Imperial_Protein_Stain_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011533_Imperial_Protein_Stain_UG.pdf]).\nImage the gel using default Coomassie stain settings (Figure 3[href=https://www.wicell.org#fig3]B).\nDetermination of concentration of purified labeled histone:\nAnalyze the gel image using ImageJ or any equivalent software.\nFind the net integrated intensity of the reference band by subtracting background (reference band is that of the unlabeled histone. See step 80).\nFind the net integrated intensity of the purified labeled histone band in the same way.\nCalculate the ratio of the net integrated intensities of purified labeled over unlabeled histone bands (RLU).\nCalculate the total reference mass loaded on gel (Mref) using the concentration of the reference unlabeled histone solution, and its volume loaded on gel before mixing with H2O and gel loading solution.\nTotal mass of labeled histone (ML) loaded on gel is calculated as ML = RLU × Mref.\nConcentration of labeled histone (μg/μL) = 7 × (ML/VL); where VL is volume of 7×-diluted purified labeled histone before mixing with H2O and gel loading solution (see step 102-d-ii for the reason for using the constant 7).\nNote: Overall loss during labeling is ∼ 30% of the initial total histone mass.",
    "Note: Ideally for single-molecule FRET experiments, each fluorescently labeled biomolecule should be conjugated to only one donor and one acceptor, which makes analysis of single-molecule data straightforward. However, each nucleosome contains two copies of each specific histone (H2A in this example). Hence, during preparation of fluorescent nucleosomes, the less the labeling efficiency of H2A, the more the percentage of nucleosomes that possess only one labeled H2A, which is ideal for single-molecule FRET. If we prepared 100% labeled H2A then all nucleosomes will possess two labeled copies. Under the conditions used in this protocol, labeling efficiency is always below 100%. If determination of histone labeling efficiency is necessary, then the experimenter can use either solution absorption spectrophotometry or gel-based methods. In the case of the former method, the purified labeled histone solution should be diluted to the minimum possible (i.e., A280 ≥ 0.1 for 1 cm pathlength) so that the viscosity of the dye-labeled histone solution is the lowest. In the case of the latter method, dye fluorescence intensity can be used to roughly determine the concentration of the labeled histone, hence together with concentration of the total histone then the labeling efficiency can be roughly determined.\nFluorescent labeling of PCR primers\nTiming: 3 days\nThe following protocol is for fluorescent labeling of 5′-Amino-modified single-stranded DNA (ssDNA) primers with Cy5.5 NHS ester dye. For other dyes, you may need to use different labeling conditions (e.g., DNA: dye molar ratio and incubation conditions).\nNote: For certain dyes such as Cy5 you can purchase ready-made fluorescent primers from commercial sources (e.g., Integrated DNA Technologies, IDT).\nCleaning primers before labeling\nTiming: 5 h",
    "This procedure is informed by Ellington and Pollard9[href=https://www.wicell.org#bib9] with modifications. The 5′-amino-modified primers will be cheaper when purchased with standard desalting purification quality, then cleaned up in-house with three ethanol precipitations. The procedure shown below is for cleaning 200 nmol.\nResuspend the standard desalted Amino-modified primers in autoclaved 10 mM Tris-Cl (pH 8) to a final concentration of 100 μM.\nNote: Store Tris-Cl stock at 22°C.\nCool 50 mL ethanol (200 Proof) on ice for 1 h.\nFirst ethanol precipitation:\nIn a sterile tube, mix 2 mL DNA solution (100 μM), 0.2 mL Sodium Acetate (3M, pH 5.2) and 6.6 mL ethanol (ice cold). Total volume is 8.8 mL.\nNote: Store sodium acetate stock at 22°C.\nIncubate at −80°C for 40 min.\nSpin down precipitate at 7,000 × g for 25 min at 4°C.\nTransfer supernatant to another tube.\nSecond ethanol precipitation: Resuspend the pellet from the first precipitation in 2 mL of 10 mM Tris-Cl (pH 8), then add sodium acetate and ethanol, incubate at −80°C and spin as in step 111.\nThird ethanol precipitation:\nResuspend the pellet from the second precipitation in 2 mL of 10 mM Tris-Cl (pH 8), then add sodium acetate and ethanol as in the first precipitation.\nSplit the 8.8 mL solution into 10 aliquots, 880 μL each, by transferring each aliquot to a sterile microcentrifuge tube.\nIncubate at −80°C for 40 min.\nSpin at 16,000 × g for 15 min at 4°C.\nFor each aliquot, rinse three times by adding then removing 1 mL ice cold ethanol without disrupting the pellet. Repeat this for all the 10 aliquots.\nDry pellets for 1 h by opening the cap of each microcentrifuge tube and leaving it on its side on the bench. Do not let the pellets dry for more than an hour.",
    "Resuspend one of the pellets in 100 μL DNAse-free H2O.\nTransfer this resuspension to the second microcentrifuge tube. Resuspend well.\nRepeat until you have collected and combined pellets from all 10 tubes into one tube (in total 100 μL DNAse-free H2O).\nNote: It is important to resuspend in H2O, not TE or Tris buffer, for higher labeling efficiency.\nConcentration measurement:\nDilute 1 μL of the cleaned primer so that the absorbance at 260 nm (A260) is below 1 (for 1 cm pathlength).\nNote: To estimate the dilution factor (DF), use the molar absorption coefficient of the primer, and assume a concentration of 200 nmol in 100 μL (i.e., assume no loss during cleaning process). For example, if the expected A260 is ∼ 390, then dilute ∼400×.\nNote: Prepare this by serial dilution (e.g., dilute 10× then dilute 40×).\nBlank with the same DNAse-free H2O used for resuspension.\nCalculate the concentration of the stock using the DF.\nAdjust the primer solution volume using DNAse-free H2O so that the final concentration is 1 mM.\nStore the cleaned primer ssDNA at −20°C.\nLabeling primers\nTiming: 1 day\nThe following procedure is informed by Joo and Ha 2008 Laboratory Manual10[href=https://www.wicell.org#bib10] with many modifications.\nNote: For the 5 mL PCR reactions pool described later, you will need 2.5 nmol of labeled primer (see ‘Fluorescent labeling of nucleosomal dsDNA’ section). We recommend carrying out the following procedure for 7.5 nmol primer.\nNote: For the Cy5.5 NHS ester dye, reaction conditions are optimized with 0.5 nmol primer. Thus, for labeling 7.5 nmol primer carry out 15 labeling reactions.\nNote: Do all work under the minimum light possible.\nPrepare dye stock solution by resuspending each 1 mg in 9.5 μL DMSO (final concentration 80 mM for Cy5.5. NHS ester). Prepare a total of 19 μL stock solution.",
    "Prepare primer working stock solution by mixing 10 μL of a 1 mM stock with 10 μL DNAse-free H2O (final concentration 0.5 mM).\nAssemble each one of the 15 labeling reactions in sterile microcentrifuge tubes as follows:\ntable:files/protocols_protocol_2599_10.csv\nNote: 14% (v/v) DMSO is the total of DMSO in dye stock solution plus additional DMSO added as a separate component in the table above.\nNote: Prepare labeling buffer fresh at time of use.\nWrap each tube with aluminum foil.\nIncubate at 30°C for 16 h shaking at 700 rpm in a thermomixer.\nRemoving excess dye\nTiming: 9 h\nNote: Do all work under the minimum light possible.\nCool 50 mL ethanol (200 Proof) on ice for 1 h.\nMix each 20 μL labeling reaction with 2 μL NaCl (3M) and 50 μL ethanol.\nIncubate at −20°C for 5 h.\nSpin at 12,000 × g for 30 min at 4°C.\nDiscard supernatant.\nFor each pellet, rinse three times. Each rinse is done by adding 1 mL ice cold ethanol, spin at 12,000 × g for 2 min at 4°C then remove the supernatant.\nNote: Avoid disrupting the pellet while rinsing.\nNote: You can do more rinses if you still see any color in the supernatant.\nDry pellets for 1 h by opening the cap of each microcentrifuge tube and leaving it on its side inside a dark cabinet. Do not let the pellets dry for more than an hour.\nResuspend the pellet of each reaction/tube in 20 μL of autoclaved 10 mM Tris-Cl (pH 8). Combine all in one tube.\nDetermination of concentration and labeling efficiency\nTiming: 1 h\nPrepare the following information before starting this procedure:\nMolar absorption coefficient (ɛλmax) at absorption maximum wavelength (λmax) of the fluorescent dye.\nMolar absorption coefficient at 260 nm of DNA primer (ɛ260).",
    "Correction factor of DNA absorbance at 260 nm due to absorption by the dye (CF).\nNote: All these values should be provided by the corresponding manufacturer (https://www.aatbio.com/products/cyanine-5-5-monosuccinimidyl-ester-cy5-5-nhs-ester?unit=174[href=https://www.aatbio.com/products/cyanine-5-5-monosuccinimidyl-ester-cy5-5-nhs-ester?unit=174]).\nCalculate the dilution factor (DF) of the primer solution that makes the expected absorbance at 260 nm (A260) ≤ 1 for a 1 cm pathlength.\nNote: You can estimate the expected absorbance by considering that you resuspended ∼ 0.5 nmol primer in 20 μL, which means ∼ 25 μM, assuming no loss during labeling.\nNote: Dilution and blank should be done using the same buffer used for resuspension of DNA.\nMeasure A260 and absorbance at absorption maximum wavelength of the dye (Aλmax) for a 1 cm pathlength.\nCalculate DNA concentration ([DNA]), dye concentration ([dye]), and labeling efficiency as follows:\n[\nD\nN\nA\n]\n=\n(\n(\nA\n260\n−\n(\nC\nF\n×\nA\nλ\nmax\n)\n)\n/\nε\n260\n)\n×\nD\nF\n[\nd\ny\ne\n]\n=\n(\nA\nλ\nmax\n/\nε\nmax\n)\n×\nD\nF\nL\na\nb\ne\nl\ni\nn\ng\ne\nf\nf\ni\nc\ni\ne\nn\nc\ny\n=\n(\n[\nd\ny\ne\n]\n/\n[\nD\nN\nA\n]\n)\n×\n100\nFluorescent labeling of nucleosomal dsDNA\nTiming: 6 days\nThe following procedure is for PCR-based fluorescent labeling of a 253 base-pair (bp) DNA containing a 147-bp Widom 601 NPS with Cy5.5 (acceptor) fluorescent dye at one end and biotin at the other (Figure 1[href=https://www.wicell.org#fig1]). The Widom 601 sequence is flanked by 6 bp at the end on which the fluorescent dye is conjugated, and a 100-bp linker to the biotin-labeled end.\nNote: The procedure and composition of buffers used here are informed by previously published protocols6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7],11[href=https://www.wicell.org#bib11] with modifications.",
    "Note: The basic idea of this labeling method is to PCR amplify the NPS-containing region from a plasmid using fluorescently labeled forward primer and biotin-labeled reverse primer.\nNote: The reverse primer can be purchased from any commercial manufacturer and should be ordered with HPLC purification quality.\nLarge-scale PCR labeling\nTiming: 8 h\nAverage yield of purified fluorescent nucleosomal DNA from 5 mL crude PCR pool (100 × 50 μL per PCR reaction) is ∼ 0.5 nmol. One nucleosome reconstitution requires ∼ 0.4 nmol (see ‘reconstitution of fluorescent nucleosome[href=https://www.wicell.org#sec3.6]’ section). Any commercial Phusion DNA polymerase (Pol, see key resources table[href=https://www.wicell.org#key-resources-table]) or in-house purified Phusion DNA polymerase can be used.\nOptimize PCR reaction conditions on a small-scale before carrying out hundreds of 50 μL-PCR reactions.\nThe recipe for a single 50 μL PCR reaction is as follows:\ntable:files/protocols_protocol_2599_11.csv\n∗ Or any volume recommended by manufacturer.\nTotal amounts and dilutions for assembling 5 mL PCR mixture (for 100 PCR reactions, 50 μL each):\nFor Phusion HF buffer (5×), a total of 1 mL is required.\nFor template DNA solution with 10 ng /μL concentration, a total of 100 μL is required.\nFor dNTPs mix (10 mM each dNTP), a total of 100 μL is required.\nFor forward fluorescent primer (10 μM), a total of 250 μL is required. Dilute to 10 μM based on concentration of the stock (see ‘fluorescent labeling of PCR primers[href=https://www.wicell.org#sec3.3]‘ section).\nFor reverse biotin-labeled primer (10 μM), a total of 250 μL is required.\nResuspend this primer to 100 μM solution in autoclaved 10 mM Tris-Cl (pH 8).\nDetermine the accurate concentration by measuring absorbance at 260 nm.\nPrepare 250 μL of 10 μM concentration.\nFor Phusion DNA polymerase, a total of 100 μL is required or any amount enough for 100 PCR reactions according to manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012393_Phusion_HighFidelity_DNAPolymerase_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012393_Phusion_HighFidelity_DNAPolymerase_UG.pdf]).",
    "Note: Do all the dilutions in DNase-free H2O.\nNote: Keep everything on ice during these preparations.\nTransfer 3.2 mL DNAse-free H2O to a sterile 15 mL tube. Mix it with all the total amounts shown in step 141.\nDistribute the 5 mL PCR reaction mixture over 100 PCR tubes. Do this on ice.\nRun the PCR reaction using the following settings:\ntable:files/protocols_protocol_2599_12.csv\nPool all 100 PCR reactions back into one sterile 15 mL tube.\nWrap with aluminum foil to protect from light.\nKeep aside 20 μL for checking the yield with agarose gel electrophoresis.\nStore the rest at −20°C until purification time or start purification right away.\nAgarose gel check of the yield of the PCR products:\nPrepare a 1.5% agarose gel (7 × 7 cm) supplied with Sybr Safe stain (diluted 1:5000).\nNote: For the best results, use an 8-well gel, with well dimensions of 0.5 × 1 × 0.15 cm (W × H × D).\nLoad 10 μL per well of the crude PCR products. Load 10 μL of 100-bp DNA ladder per well.\nNote: This volume of crude PCR products was chosen considering the conditions and the usual yield of PCR reactions discussed above. If the average yield of the PCR reactions is less, then load more volume.\nRun DNA samples on gel with 120 V for 35 min.\nImage the gel. The band of the PCR products should be between the 200 bp and 300 bp bands.\nPurification of fluorescent PCR products\nTiming: 5 days\nThe purification process consists of 4 procedures: (1) ethanol precipitation, (2) non-denaturing poly-acrylamide gel electrophoresis (PAGE) purification, (3) butanol extraction, (4) a final ethanol precipitation.\nEthanol precipitation.\nThaw on ice the 5 mL PCR pool (if stored at −20°C).\nCool 50 mL of 100% ethanol on ice for 1 h.",
    "Mix the PCR pool with 0.5 mL sodium acetate (3 M, pH 5.2) and 13.75 mL ice-cold 100% ethanol (i.e., 2.5× volume of the PCR pool-acetate mixture).\nIncubate for 16 h at −20°C in the dark.\nSpin for 30 min at 7,200 × g at 4°C.\nDiscard supernatant.\nCool 50 mL of 70% ethanol on ice for 1 h.\nSlowly add 20 mL of 70% ethanol without disrupting the pellet.\nSpin for 30 min at 7,200 × g at 4°C.\nDiscard supernatant.\nAir dry the pellet, by opening the cap of the tube and leaving it on its side inside a dark cabinet. It will take 3 (± 1) hrs to dry completely. Do not let the pellet dry for longer.\nResuspend the pellet in 500 μL of T50 buffer. Do not store pellet in the freezer dry. If it is difficult to resuspend, then incubate at 37°C for 10 min.\nNote: Store T50 buffer stock at 22°C.\nStore the pellet at −20°C or go to the step of non-denaturing gel purification.\nNon-denaturing PAGE purification.\nPrepare a 5% (29:1) non-denaturing polyacrylamide gel with dimensions of 20 × 16 × 0.3 cm (H × W, D) and well dimensions of 2.7 × 2.3 × 0.3 cm (volume ∼ 1.8 mL).\nPrepare 4 L of 0.5× TBE buffer (3.8 L MilliQ H2O and 0.2 L of 10× TBE).\nNote: Filter the 10× TBE with a 0.22 μm bottle top filter into autoclaved bottle.\nNote: Store the 10× TBE at 22°C.\nMove all tools and reagents to a cold room (4°C) and equilibrate for at least 1 h.\nPre-run the gel for 1 h at 5 V/cm (100 V total for 20 cm long gel).\nSample preparation:\nThaw the DNA sample (if frozen).",
    "Spin with 14,000 × g for 15 min at 22°C (to remove any insoluble proteins). The supernatant will have the DNA sample.\nMix 55.6 μL glycerol with 500 μL DNA sample (10% v/v final glycerol concentration). Total volume of the mixture is now 555.6 μL.\nNote: Mixing with glycerol is important for samples to sit well at the bottom of the gel wells.\nRinse the gel wells three times with fresh 0.5× TBE buffer.\nLoad all the sample in one well using a 1 mL Luer syringe attached to a needle (18 Gauge).\nRun sample on gel at 5 V/cm (100 V total for 20 cm long gel) in a cold room (4°C) for 3 h.\nExcision of gel band:\nClean a new razor with MilliQ H2O and 70% ethanol.\nTake the gel off the glass plates and place on Saran wrap plastic. Do not excise the gel band while the gel is on the glass plate.\nExcise the band with the razor, then move the gel slice to a sterile 15 mL tube.\nStore the gel slices at −20°C or go to next step.\nExtracting DNA from gel slices:\nSoak gel slices in 5 mL of autoclaved 10 mM Tris-Cl (pH 7.5) buffer.\nIncubate for 16 h at 37°C with shaking (or rotating).\nKeep the supernatant, which contains DNA that diffused out of the gel slices.\nCrush the gel slices using a sterile 1 mL pipette tip.\nRepeat soaking in fresh 5 mL buffer, incubating for 16 h at 37°C.\nCombine the supernatants from the two rounds of soaking (total volume is 10 mL).\nFilter supernatant to remove gel particles (using 20 mL Luer syringe fit to a 0.22 μm syringe filter).\nButanol extraction.",
    "Add an equal volume (here 10 mL) of 2-butanol to the combined supernatants from step 172 then mix well.\nSpin at 7,000 × g for 1 min at 4°C (to separate organic and aqueous phases).\nDiscard the upper organic layer.\nRepeat the 2-butanol extraction until volume of aqueous phase is less than or equal to 500 μL.\nNote: This will take 3 or 4 rounds (if the initial total volume of DNA-butanol mixture is 20 mL).\nIn the last round, discard the upper layer, spin again without adding butanol, then remove traces of butanol from the top of the aqueous DNA solution.\nMeasure the exact volume of the extracted aqueous fluorescent DNA solution. It should be approximately 500 μL.\nEthanol precipitation.\nCool 10 mL of 100% ethanol on ice for at least 30 min.\nMix the fluorescent DNA sample with 50 μL (or 0.1 × volume) sodium acetate (3 M, pH 5.2) and with 2.5× volume cold 100% ethanol (calculated after addition of sodium acetate). The total volume should be ∼ 2 mL.\nIncubate for 16 h at −20°C (in the dark).\nSpin for 15 min at 15,000 × g at 4°C.\nDiscard supernatant.\nRinse the pellet by adding 1.5 mL of ice cold 100% ethanol, spinning for 15 min at 15,000 × g at 4°C then pipetting out the ethanol without disrupting the pellet.\nAir dry the pellet for 1 h by opening the cap of the tube and leaving it on its side inside a dark cabinet. Do not let the pellet dry for longer.\nResuspend the pellet in 25 μL of autoclaved TE buffer. Do not freeze the pellet dry.\nNote: Store TE buffer at 22 C.\nStore the fluorescent dsDNA solution at −20°C.",
    "Note: If the average yield from 5 mL PCR pool is 0.5 nmol purified fluorescent dsDNA, then resuspension in 25 μL buffer results in a concentration of ∼ 20 μM.\nConcentration determination.\nExample sequence:\nTCCGATATCGAGAATCCCGGTGCCGAGGCCGCTCAATTGGTCGTAGACAGCTCTAGCACCGCTTAAACGCACGTACGCGCTGTCCCCCGCGTTTTAACCGCCAAGGGGATTACTCCCTAGTCTCCAGGCACGTGTCAGATATATACATCCGATATCAGATCTCGTCAATCGAGTTCGTAAAGGGCGACACAAAATTTATTCTAAATGCATAATAAATACTGATAACATCTTATAGTTTGTATTATATTTTGTA.\nwhere the underlined and bold region is the Widom 601 NPS that is flanked by upstream 6 bp and downstream 100 bp linker DNA sequences.\nCalculation of molar absorption coefficient (ɛ260) of a specific DNA construct:\nUse a set of online calculators to estimate different values of ɛ260 for a specific DNA sequence. Keep using the same online calculators every time you do this step.\nUse the mean of all these ɛ260 values to calculate the concentration (for the example DNA sequence shown above, the mean ɛ260 = 3′790′933 M-1cm-1).\nNote: Do not use the automatic DNA concentration calculator in the operating software of spectrophotometer, because different devices provide different estimates.\nDilute 2 μL of purified fluorescent DNA solution so that absorbance at 260 nm (A260) will be < 1 for 1 cm pathlength.\nNote: If the expected concentration is ∼ 20 μM, then expected A260 = 76. Hence, dilute 2 μL DNA solution 80× using resuspension buffer (i.e., use a dilution factor, DF = 80).\nNote: Do this step using serial dilutions, not with a single dilution step.\nMeasurement of A260:\nBlank using the same buffer used for resuspension and dilution.\nUse A260 value of 1 cm pathlength for calculations.\nIf A260 is > 1, then dilute more and repeat measuring A260.\nConcentration of DNA,    [  D N A  ]  =  (   A 260  /  (   ε 260  × 1 c m  )   )  × D F",
    "Note: This calculation ignores the fluorescent dye absorption at 260 nm because (1) dye absorption coefficient at maximum wavelength is usually very small compared to that of ∼ 250 bp DNA (e.g., for Cy5.5, ɛ683 = 250′000 M-1cm-1 which is ∼ 6.5% of ɛ260 of ∼ 250 bp DNA example shown above), and (2) correction factor of A260 because of absorption of the dye is small (e.g., for Cy5.5, it is ∼ 0.05 or 5% of absorbance of dye at its absorption maximum).\nNon-denaturing PAGE analysis.\nWe recommend running the purified fluorescent dsDNA on 7 × 8 cm non-denaturing PAGE for good judgment (Figure 4[href=https://www.wicell.org#fig4]). See ‘reconstitution of fluorescent nucleosome[href=https://www.wicell.org#sec3.6]’ section for procedure.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig4.jpg\nFigure 4. Images of 5% (59:1) non-denaturing polyacrylamide gel of Cy5.5-labeled double-stranded (ds) DNA\n(A) Gel image after staining with ethidium bromide. dsDNA size standards are loaded in the leftmost lane.\n(B) Fluorescent image of the same gel.\nNote: Although agarose gel electrophoresis is a quicker method for checking quality of purified fluorescent dsDNA, it does not have the same resolution as non-denaturing PAGE.\nRefolding fluorescent octamer\nTiming: 5 days\nThe following procedure is informed by previously published protocols4[href=https://www.wicell.org#bib4],6[href=https://www.wicell.org#bib6],8[href=https://www.wicell.org#bib8] but with many modifications. The overall strategy of this protocol is to prepare the octamer by refolding denatured histones using dialysis into high salt buffer without denaturant, followed by separating the properly folded octamer from unwanted by-products using size-exclusion chromatography (SEC).\nResuspending histones and dialysis\nTiming: 3 days\nNote: Protect the fluorescent histone from light at all times.\nEquilibrate the unlabeled lyophilized frozen histones to 22°C (∼ 1 h).\nThaw the fluorescent histone stock (here it is Cy3.5-labeled H2A K119C) on ice.\nWeigh ∼ 2 mg of each of the unlabeled histones into separate autoclaved microcentrifuge tubes.",
    "Dissolve each histone in 1 mL of unfolding buffer rotating for 1 h at 22°C using tube revolver.\nNote: To prepare unfolding buffer, use sterile tools and autoclaved MilliQ H2O and Tris-Cl stock.\nNote: Complete dissolving of 50 mL unfolding buffer requires shaking for 20 min without heating.\nNote: Store unfolding buffer at 22°C until time of use.\nNote: Add DTT to unfolding buffer just on time of use.\nDetermine the exact concentrations of all unlabeled histones by measuring their absorbances at 280 nm (A280).\nNote: Blank with the same unfolding buffer used for resuspension of lyophilized unlabeled histones.\nNote: See Table 1[href=https://www.wicell.org#tbl1] for values of molar absorptions coefficients.\nNote: For the fluorescently labeled histone, use the concentration as determined using SDS-PAGE (see ’fluorescent labeling of histones[href=https://www.wicell.org#sec3.2]’ section).\nCalculations and mixing of histones:\nCalculations will be carried out such that H2A /H2B is in 20% excess (in nmole) over H3 /H4.\nNote: This molar excess of H2A and H2B is used to shift the equilibrium toward octamer formation.\nNote: Any excess H2A / H2B dimer will be removed by subsequent SEC.\nUsing calculated concentrations of all histones, determine the volumes of H2A and H2B solutions that contain 40.2 nmol, and the volumes of H3 and H4 solutions that contain 33.5 nmol.\nNote: This is equivalent 33.5/2 (or 16.75) nmol octamer.\nConfirm that the total mass of all 4 histones is ∼ 2 mg.\nCombine solutions of all 4 histones. Total volume should be < 1 mL.\nDilute the combined histones with unfolding buffer to a total volume of 2 mL. The final total protein mass concentration should be equal to 1 mg/mL.\nDialysis:\nEquilibrate 250 mL of refolding buffer for 2 h in the cold room (4°C).",
    "Note: To prepare refolding buffer, use sterile tools and autoclaved MilliQ H2O, Tris-Cl and EDTA stocks.\nNote: Filter the refolding buffer with a 0.22 μm bottle top filter.\nNote: Store the refolding buffer in a cold room (4°C) for at least 2 h before use.\nNote: Add BME to refolding buffer just on time of use.\nInject the sample into a 3-mL dialysis cassette (7 kDa MWCO) according to manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011337_SlideALyzer_Dialy_Cass_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011337_SlideALyzer_Dialy_Cass_UG.pdf]).\nDialyze for 16 h in 250 mL refolding buffer (125× dilution) at 4°C while stirring.\nNote: Use autoclaved beaker and stirring bar.\nNote: Wrap the beaker with aluminum foil, to protect the fluorescent dye from light.\nChange buffer then repeat dialysis for 6–8 h.\nChange buffer a third time then repeat dialysis for another for 16 h (total 3 dialysis steps with two steps each for 16 h).\nTransfer the dialysate to an autoclaved tube and measure its volume.\nKeep aside 10 μL for SDS-PAGE analysis.\nPellet down any aggregates by spinning at 18,000 × g for 10 min at 4°C.\nTransfer supernatant to a new autoclaved microcentrifuge tube.\nNote: Keep the dialysate on ice.\nConcentrating dialysate:\nNote: The target of this step is to reduce the volume to ≤ 500 μL. This is important for injection of dialysate into SEC column via 0.5 mL loop (see steps shown below).\nNote: All the following spins should be done at 4°C.\nWash two centrifugal filters (Microcon-5, 0.5 mL, 5 kDa MWCO) by filling them with refolding buffer then spinning at 13,000 × g for 2 min at 4°C.\nRemove buffer by inverting filters in tubes, then pulse spin (i.e., maximum speed for 1–2 s).\nSplit the dialysate in half.\nConcentrate the first half by splitting on two filters (each will have ¼ of total initial volume).",
    "Spin at 13,000 × g to reduce volume in each filter to ∼ 100 μL (total ∼ 200 μL in two filters).\nTransfer filters to two new tubes.\nRecover concentrated dialysate by inverting filters in tubes, then spin for 30 s at 6,500 × g.\nConcentrate the remaining half of dialysate as above. At the end, you will have 400–500 μL total concentrated dialysate.\nNote: Each round of concentrating takes ∼ 3 h (for Microcon-5 filter), hence the two rounds take ∼ 6 h. Different filter products take different times.\nKeep aside 5 μL concentrated dialysate for SDS-PAGE analysis.\nKeep the concentrated dialysate on ice until time of SEC. If it is stored to the next day, then store the dialysate on ice inside a 4°C fridge.\nSize-exclusion chromatography (SEC)\nTiming: 1 day\nNote: Chromatography should be carried out at 4°C.\nNote: The SEC buffer is the same as refolding buffer, but without BME. Prepare 1 L.\nNote: Degas the SEC buffer using ultrasonic bath for 20 min (or until bubbles stop rising to the surface). Do this directly before use.\nPurify the octamer over SEC using a Superdex 200 Increase 10/300 GL, or equivalent. Mind the following tips:\nAdjust the volume of the concentrated dialysate to exactly 500 μL using SEC buffer.\nWash a 0.5 mL sample injection loop with 5 mL SEC buffer.\nInject sample into the loop.\nTurn off light around machine or cover fraction collection module with dim cover (to protect fluorescent dye from light).\nElute sample using a flow rate of 0.5 mL/min and collect 0.5 mL-fractions. The histone octamer elutes at 11–12 mL (i.e., main elution peak) followed by excess H2A/H2B dimer at ∼ 15 mL (i.e., secondary elution peak) (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig5.jpg",
    "Figure 5. Elution profile from a Superdex 200 Increase 10/300 GL size-exclusion column\nThe histone octamer elutes first at ∼ 11.5 mL, followed by a small peak of H2A-H2B dimer at 15 mL observed due to using excess of H2A and H2B histones during the preparation of octamer.\nTransfer fractions of both elution peaks to autoclaved microcentrifuge tubes.\nStore fractions on ice.\nConcentrating the histone-containing fractions (i.e., fractions of elution peaks):\nNote: Obtaining the best results of SDS-PAGE analysis of elution fractions (see steps 214–228) depends on good determination of concentrations of fractions, which requires values of absorbance at 280 nm (A280) above 0.1, for 1 cm pathlength. Hence, fractions of elution peaks should be concentrated.\nChill a number of centrifugal filters (Spin-X UF, 10 kDa, 0.5 mL) on ice for 15 min.\nClean the centrifugal filters by filling them with SEC buffer and spinning at 12,000 × g for 1 min at 4°C, then discard buffer.\nTransfer elution fractions to the centrifugal filters and spin at 12,000 × g for 7 min at 4°C (or until volume of each fraction is ∼ 75 μL. This is ∼ 7× the initial concentration).\nNote: Do not concentrate further to avoid aggregation of fluorescent octamer at higher concentrations.\nMeasure A280 of the concentrated fractions of elution peaks.\nSDS-PAGE analysis, pooling fractions and concentration measurement\nTiming: 1 day\nPrepare an 18% (29:1) SDS-polyacrylamide gel with dimensions 7 × 8 × 0.15 cm (W × H × D).\nNote: For the best results, prepare 10-well gel with well dimensions of 0.5 × 1 × 0.15 cm (W × H × D) and volume of 65 μL.\nCalculate the concentration of octamer in the central (most concentrated) fraction of the main elution peak using molar absorption coefficient at 280 nm (ɛ280) of 44,700 M-1cm-1.",
    "Note: This ɛ280 value of octamer is calculated by summing the corresponding ɛ280 values for all 4 histones shown in Table 1[href=https://www.wicell.org#tbl1] and then multiplied the sum by two.\nDetermine the volume to load of each of the fractions of the main elution peak as follows:\nCalculate the sample volume that contains 14 μg octamer (i.e., 3.5 μg of each histone) of the central fraction of this peak.\nNote: If the concentration of the central fraction is 57 μM, then 2.28 μL will contain 14 μg octamer (using octamer M.W. of 108.42 kDa).\nNote: Octamer M.W. is obtained based on the M.W. values of the 4 histones shown in Table 1[href=https://www.wicell.org#tbl1].\nLoad the same volume for the rest of the fractions of the main elution peak.\nCalculate the ratio between A280 of the central fraction of the main elution peak and the central fraction of the secondary elution peak (we call this ratio here as ‘scaling factor’, SF).\nFor fraction at the center of the secondary elution peak, load a sample volume equal to SF × volume of sample taken from the central fraction of the main elution peak (see step 216-a). Load the same sample volume for the rest of the fractions of the secondary elution peak.\nSamples preparation and loading:\nDilute each sample 2× with MilliQ H2O.\nMix with gel loading solution.\nLoad all of the diluted sample in each well.\nNote: We dilute samples with H2O to reduce distortion of the bands resulting from the high salt concentration of the SEC buffer.\nRun samples at 180 V for 110 min in 1× Tris/glycine/SDS gel running buffer.\nStain and destain according to manufacturer’s instructions of protein stain (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011533_Imperial_Protein_Stain_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011533_Imperial_Protein_Stain_UG.pdf]).\nNote: Avoid very long destaining and/or microwave heating of gel which result in diffuse bands.",
    "Image the gel using default settings for Coomassie Brilliant Blue stain (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig6.jpg\nFigure 6. Image of 18% (29:1) SDS-polyacrylamide gel of fractions of octamer and dimer elution peaks\nGel was stained with Coomassie Brilliant Blue.\nPool fractions that display equimolar quantities of all four histones. Mix slowly by pipetting.\nSpin the pool at 1,000 × g for 1 min at 4°C.\nCheck for aggregation (irreversible) or phase separation (reversible by pipetting).\nDetermine the concentration by measuring A280 and using the octamer ɛ280 mentioned above. Blank with SEC buffer.\nIf needed concentrate to ∼ 20 μM.\nStore purified octamer for short-term (a few days to a couple of weeks) on ice at 4°C. Renew ice daily.\nNote: The octamer can be stored for long-term (for several months) at – 20°C with 50% glycerol. To use it for nucleosome reconstitution, remove glycerol by dialysis into high salt buffer and repeat SEC.\nNote: Expected efficiency of octamer refolding using this procedure is ∼ 30% (i.e., starting with material equivalent to ∼ 16.7 nmol octamer, you end up with ∼ 5.5 nmol purified fluorescent octamer). This amount is sufficient for many reconstitutions of fluorescent nucleosomes.\nNote: Correction of A280 of octamer due to absorption of fluorescent dye is ignored here because of two reasons: (1) it is safer to over-estimate octamer concentration because nucleosome reconstitution will be done using more DNA than octamer, and (2) correction factor changes based on labeling site (i.e., chemical environment).\nReconstitution of fluorescent nucleosome\nTiming: 5 days",
    "The following procedure is for preparation of doubly labeled fluorescent nucleosome and is informed by previously published reports.3[href=https://www.wicell.org#bib3],4[href=https://www.wicell.org#bib4],6[href=https://www.wicell.org#bib6],7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8] The overall strategy is to reconstitute the nucleosome using a 1.25:1.0 molar ratio of DNA: octamer by double dialysis into buffer without salt, then to separate properly reconstituted nucleosomes from free DNA and other by-products by sucrose gradient.\nDouble dialysis\nTiming: 2 days\nCalculations:\nCalculate the volume of fluorescent DNA solution (VDNA) that contains 350 pmol based on stock concentration (see ‘fluorescent labeling of nucleosomal dsDNA[href=https://www.wicell.org#sec3.4]‘ section).\nCalculate the volume of fluorescent octamer (Voct) that contains for 280 pmol (see step 226).\nMix DNA with octamer in the following sequence:\nCombine DNA with a volume of 3 M NaCl solution (VNaCl) to reach a final concentration of 2 M NaCl.\nAdd high salt buffer with volume VHS , where VHS will bring the final volume to 200 μL (see step ‘d’ below).\nNote: For preparing high salt buffer, use sterile tools and autoclaved MilliQ H2O, Tris-Cl and EDTA stocks.\nNote: Filter the buffer with a 0.22 μm bottle top filter.\nNote: Store the buffer at 4°C.\nNote: Add benzamidine to the high salt buffer on time of use.\nAdd octamer as the last component to the mixture.\nTotal volume of the mixture = VDNA + Voct + VNaCl + VHS = 200 μL.\nKeep the DNA-octamer mixture on ice until dialysis setup is ready.\nCool down the no- salt buffers to 4°C for a couple of hours before use.\nNote: For preparing no-salt buffer, use sterile tools and autoclaved MilliQ H2O, Tris-Cl and EDTA stocks.\nNote: Filter the no-salt buffer with a 0.22 μm bottle top filter.\nNote: Store the buffer at 4°C.\nNote: Prepare a total of 12 L of no-salt buffer.",
    "Note: Add benzamidine to the no- salt buffer on time of use.\nDouble dialysis setup (Figure 7[href=https://www.wicell.org#fig7]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig7.jpg\nFigure 7. Schematic of double-dialysis setup\nB: beaker; DB: dialysis bag; MD: micro-dialysis device.\nDialysis tubing.\nCut 20 cm of dialysis tubing (8 kDa MWCO and 5 cm flat width).\nRemove preservatives by immersing dialysis tubing in 1 L MilliQ H2O for 2 min. Repeat two more times.\nMove the dialysis tubing to 4 L of no-salt buffer leaving one end open for now.\nFill the dialysis tubing with 50 mL high salt buffer.\nPrevent the dialysis tubing from sinking into the 4 L no-salt buffer by anchoring.\nMini dialysis device.\nHydrate two mini dialysis devices (7 kDa MWCO, 100 μL capacity each) by leaving them for 2 min in 100 mL MilliQ H2O. Keep them closed so that H2O does not go inside.\nFill them with the DNA-octamer mixture.\nAssembly of the full double dialysis setup:\nPut the two mini dialysis devices into the larger dialysis tubing and close it.\nAttach the dialysis tubing to a floating buoy to avoid its sinking down (the dialysis tubing has solution with more density than the dialysis buffer outside).\nDialyze at 4°C for 16 h while slowly stirring in darkness (to protect the fluorescent dyes from light).\nChange dialysis buffer with 4 L of fresh no-salt buffer and dialyze for another 8 h.\nChange dialysis buffer again with 4 L of fresh no-salt buffer and let go for 16 h (total three dialysis steps).\nTransfer the dialysate to an autoclaved microcentrifuge tube and store it on ice at 4°C until loading on sucrose gradient.\nKeep aside 5 μL of dialysate for non-denaturing PAGE analysis.\nUltracentrifugation of dialysate over sucrose gradient\nTiming: 2 days\nTiming: 5 h (for step 237 to 242)",
    "Timing: 1 day (for steps 243 to 245)\nTiming: 2 h (for steps 246 to 249)\nTiming: 3 h (for steps 250 to 252)\nTiming: 1 h (for steps 253 and 254)\nMaking sucrose gradient.\nTo better position the octamer on the NPS, heat shock the dialysate at 37°C for 1 h then cool on ice.\nNote: Temperature and duration of heat shock require optimization for different NPSs.\nEquilibrate to 22°C all solutions and tools used for making sucrose gradient.\nEquilibrate to 4°C ultracentrifuge, SW41 rotor and buckets.\nNote: Check gradient maker manual for ultracentrifuge tubes recommended for each rotor. For DNA and octamer amounts used here, we recommend using 12 mL tubes.\nWash the ultracentrifuge tubes with autoclaved H2O, 20% ethanol then autoclaved MilliQ H2O.\nPrepare sucrose gradient.\nNote: For nucleosomal DNA of the size shown in this protocol, we prepare 5%–40% sucrose gradient (see ‘Fluorescent Labeling of nucleosomal dsDNA’ section). For different DNA sizes, gradient range should be optimized accordingly.\nNote: We use a BioComp Gradient Maker.\nNote: Store the 5% and 40% sucrose stocks at – 20°C.\nCool the sucrose gradient at 4 C for 1 h.\nUltracentrifugation.\nLoad all dialysate sample (∼ 200 μL) on sucrose gradient of one 12 mL-ultracentrifuge tube.\nSpin at 41,000 rpm for 22 h at 4°C.\nNote: Parameters of spinning depend on size and symmetry degree of nucleosome construct.\nKeep tubes in the rotor buckets at 4°C until next step (for no more than 2 h).\nFractionation of sucrose gradient.\nCollect 32 fractions, 0.35 mL each, from the ultracentrifuge tube containing the dialysate sample. Record the profile of sucrose gradient using DNA absorbance at 260 nm (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig8.jpg\nFigure 8. Sucrose gradient profile monitored by measuring absorbance at 260 nm",
    "The assignment of the peaks to free DNA, hexasome and nucleosome species was confirmed using non-denaturing PAGE (see Figure 9[href=https://www.wicell.org#fig9]).\nNote: Free DNA will be in earlier fractions if collection direction is top-to-bottom, while nucleosomes will be in later fractions closer to the bottom of the tube.\nNote: We use a BioComp Fractionator.\nIf pertinent, collect manually the last ∼ 1 mL remaining at the bottom of ultracentrifuge tube.\nCover fractions with aluminum foil to protect from light.\nStore on ice in a 4°C fridge.\nNote: Do not store fractions for more than a day without concentrating them.\nConcentrating fractions.\nNote: Do this procedure for important fractions only; like hexasomes and nucleosomes. No need to concentrate the free DNA fractions.\nNote: Do spins in this procedure at 4°C.\nClean a set of centrifugal filters (Amicon Ultra, 0.5 mL, 10 kDa MWCO) using autoclaved 0.5× TE buffer according to manufacturer’s instructions (https://www.emdmillipore.com/US/en/product/Amicon-Ultra-0.5-Centrifugal-Filter-Unit,MM_NF-UFC501024#documentation[href=https://www.emdmillipore.com/US/en/product/Amicon-Ultra-0.5-Centrifugal-Filter-Unit,MM_NF-UFC501024#documentation]).\nConcentrate fractions of gradient until each fraction volume is ∼ 35 μL.\nNote: In case of Amicon Ultra filters (see key resources table[href=https://www.wicell.org#key-resources-table]), spin for 90 min with 14,000 × g then collect concentrate.\nNote: Now each fraction is ∼ 10× more concentrated.\nStore concentrated fractions on ice in 4°C fridge.\nDetermining concentrations of fractions.\nThis procedure is important for the accurate determination of the amount of each fraction to load on non-denaturing PAGE (see next procedure).\nNote: You will need a NanoDrop device so that you can use small sample volume (2 μL) to measure A260.\nMeasurement of the DNA absorbance at 260 nm (A260) of all important fractions:\nDilute each concentrated fraction as necessary such that A260 is not > 1. Dilute using 0.5× TE buffer.",
    "Note: To determine the amount of dilution necessary, consider the initial A260 value of each fraction in the sucrose gradient absorbance profile (see step 246) and also consider the 10× concentrating of fractions (see steps 250–251),\nMeasure A260 of the fractions. Blank using 0.5× TE buffer. Use A260 values of 1 cm pathlength.\nNote: See ‘Fluorescent labeling of nucleosomal dsDNA’ section for determination of molar absorption coefficient of nucleosomal DNA at 260 nm, ɛ260.\nNote: The contributions of sucrose and histones are ignored.\nConcentration of fraction (n) =    (   A 260   ( n )   /  (  ε 260  )   )  × D F  ( n )    (where DF is dilution factor).\nNon-denaturing PAGE analysis\nTiming: 8 h\nThis procedure is for deciding which sucrose gradient fraction(s) contain(s) properly reconstituted nucleosomes.\nWash the glass plates, spacers and comb that you will use for gel preparation with soap and warm water, then dry them. Rinse all of them with ethanol 70% then wipe dry.\nPrepare a 7 × 8 × 0.15 cm (W × H × D) non-denaturing polyacrylamide 5% (59:1) gel.\nNote: For the best results, use 10-well gel with 0.5 × 1 × 0.15 cm (W × H × D) well dimensions and 65 μL volume.\nCool electrophoresis device, gel, and 2 L of 0.2× TBE buffer inside a cold room (4°C) for 1 h.\nPre-run the gel for 1 h at 125 V (or 15.6 V/cm for 8 cm height gel).\nSample preparation:\nFor each fraction, load 0.1–0.2 pmol DNA per well.\nDilute sample of each fraction with 0.5× TE so that the total volume is 5 μL.\nMix the 5 μL of each fraction with equal volume of non-denaturing gel loading solution (2×).\nRinse wells of the gel with fresh 0.2× TBE buffer.\nLoad the samples.",
    "Cover electrophoresis tank to protect fluorescent dyes from light.\nRun samples on gel at 125 V for 75 min.\nFluorescence imaging: Record image of gel while still sandwiched between the glass plates using channel suitable for dye label on nucleosome (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2599-Fig9.jpg\nFigure 9. Image of 5% (59:1) non-denaturing polyacrylamide gel of some fractions of the sucrose gradient\nThe gel was visualized using Cy5.5-labeled DNA fluorescence. The three rightmost fractions contain purified nucleosomes. They were pooled and concentrated then used for single-molecule imaging experiments. The weak smeared band directly below hexasome is likely to be of a subnucleosomal product (e.g., tetrasomes).\nNote: Hexasomes migrate faster on gel than nucleosomes for this length of DNA.\nEthidium Bromide (EtBr) imaging:\nPrepare 100 mL of 5 ng/mL EtBr solution in MilliQ H2O.\nTake the gel off the glass plates.\nStain the gel for 15 min at 22°C while shaking.\nRinse once with MilliQ H2O without destaining.\nImage the gel.\nPool fractions containing nucleosomes only.\nNote: Equal amount of nucleosomal DNA is usually associated with 2-3 times less stain signal intensity compared to free DNA.4[href=https://www.wicell.org#bib4],7[href=https://www.wicell.org#bib7]\nBuffer exchange and concentrating\nTiming: 4 h\nNote: Do all spins in this procedure at 4°C.\nChill 50 mL 1× TE on ice for ∼ 1 h before mixing with nucleosomes.\nClean a pair of centrifugal filters (Amicon Ultra, 0.5 mL, 10 kDa MWCO) according to manufacturer’s instructions (https://www.emdmillipore.com/US/en/product/Amicon-Ultra-0.5-Centrifugal-Filter-Unit,MM_NF-UFC501024#documentation[href=https://www.emdmillipore.com/US/en/product/Amicon-Ultra-0.5-Centrifugal-Filter-Unit,MM_NF-UFC501024#documentation]).\nNote: One of the filters will be used for balance.\nTransfer the nucleosome pool to a centrifugal filter.\nFill the filter with TE (1×).\nSpin at 14,000 × g for 30 min. Volume should be ∼ 35 μL.\nRefill the filter and repeat spinning until volume is ∼ 35 μL.\nRefill the filter and spin for 60 min (total three spins).",
    "Recover the concentrate (i.e., nucleosomes) by inverting the filter inside a new tube and spin with 1,000 × g for 2 min. Volume should be now ∼ 30 μL.\nStore both nucleosomes and flow-through solutions in autoclaved microcentrifuge tubes at 4°C in darkness.\nNote: The flow-through is useful for future dilutions of nucleosomes.\nRepeat measuring A260 and calculating concentration after pooling and concentrating fractions. Blank with 1× TE."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Protein Expression And Purification",
    "Single-Molecule Assays",
    "Microscopy",
    "Molecular Biology",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}