{
  "id": 17476,
  "origin_website": "Jove",
  "title": "Technique for Obtaining Mesenchymal Stem Cell from Adipose Tissue and Stromal Vascular Fraction Characterization in Long-Term Cryopreservation",
  "procedures": [
    "The present study is approved by the Ethics Committee of the UNIFESP (protocol number: 0029/2015 CAAE: 40846215.0.0000.5505), performed after obtaining written informed consent from the patients according to the Declaration of Helsinki (2004). The sample of the present study is composed of nine female patients, aged 33-50 years (average age 41.5) and average initial body mass index (BMI) of 24.54 (ranging between 22.32-26.77) (Table 1) who underwent aesthetic abdominoplasty due to excess of skin after pregnancies, at the Division of Plastic Surgery of the Universidade Federal de São Paulo (UNIFESP), Brazil. To reduce bias, the patients were selected as a homogeneous group considering sex, age, and BMI. The datasets used and/or analyzed during this study are available from the corresponding author upon reasonable request.\n1. Collection of lipoaspirate\nNOTE: This step needs to be performed in the surgery center.\nUse 4% chlorhexidine gluconate (see Table of Materials) for skin preparation and asepsis.\n\t\nPerform a 2 mm subcutaneous skin incision (between the sub-dermis and aponeurosis). Insert a Klein cannula of 26 mm 3 G three-hole and 3 mm caliber and a syringe to inject a total volume of 500 mL of an adrenaline solution (1 mg/mL) (see Table of Materials) diluted in saline (1:1,000,000) in the infraumbilical area.\nConnect a 60 mL syringe to a 26 mm 3 G three-hole and 3 mm caliber liposuction cannula and insert it through the skin incision, locking the plunger to create a vacuum.\n\t\nMake pushing and pulling movements so that, with the vacuum created, the lipoaspirate remains in the 60 mL syringe.\nUsing a sterile connector with a valve, transfer the 100 mL of the collected lipoaspirate to a 150 mL polyvinyl chloride transfer bag (see Table of Materials).",
    "Pack the transfer bag in a polystyrene box at room temperature (~25 °C) and take it immediately to the laboratory. Do not take longer than 30 min to start the tissue processing.\n2. Processing of lipoaspirate\nNOTE: This step is to be performed in the laboratory.\nFirst, weigh the bag, gauge the temperature with a digital non-contact infrared clinical thermometer, and leave the bag resting for 5 min inside the laminar flow chamber for precipitation of the greasier layers (bubbles) and tissue separation containing the cells of interest.\n\t\nPerform a series of tissue washes. First wash: inject 100 mL of DPBS with calcium (1x) into the transfer bag and mix it with the hands.\nLet it stand for 5 min and remove most of the basal liquid that precipitates.\nDiscard the basal liquid with a 60 mL syringe attached to the bag adapter. This process must be repeated twice.\nAdd 100 mL of digestion solution to the bag (93 mL of calcium-free DPBS + 60 µL of calcium chloride (1 g/L) + 7 mL of 0.075% sterile collagenase, see Table of Materials) and leave at 37 °C for 30 min under slow stirring.\nTransfer all the bag's content to four conical tubes of 50 mL and centrifuge them at 400 x g at 22 °C for 10 min.\n\t\nRemove and discard the supernatant and add 5 mL of Dulbecco's modified Eagle's medium (DMEM) low glucose supplemented with 20% FBS (Fetal bovine serum) to the cell pellet (Figure 1).\n3. Counting of the SVF cells\nMix a fresh solution of 10 µL of trypan blue at 0.05% in distilled water with 10 µL of cellular suspension for 5 min.\nCount viable cells in a Neubauer cell counting chamber32 using an inverted light microscope (see Table of Materials) at 20x magnification.",
    "Resuspend the cell pellet in a cryoprotective medium (5 mL of FBS + 10% of Dimethyl Sulfoxide - DMSO) at a concentration of 1 x 106 cells/mL.\nPlace 1 mL of this mix in cryovials. Use a freezing container (see Table of Materials) with a cooling rate of (1 °C/min to -80 °C).\n\t\nStore at -80 °C for 1 year.\nAfter this time, store in standard cassette boxes immersed in the liquid nitrogen vapor phase (-165 °C).\n4. Thawing process of the cells\nRemove the vials from liquid nitrogen and place them immediately in the 37 °C water bath for 1 min.\nPlace the SVF cells in a conical tube with 4 mL of DMEM (low glucose supplemented with 20% FBS) preheated at 37 °C.\nCentrifuge at 400 x g at 22 °C for 5 min.\nRemove the supernatant and add 1 mL of DMEM (low glucose) + 10% FBS. Perform immunophenotyping following the steps below.\n5. Flow cytometry technique (immunophenotype multiple labeling)\nPlace 1 mL of cell pellet (concentration of 1,000 cells/µL) in five cytometry tubes (200 µL each).\nCentrifuge at 400 x g at 22 °C for 5 min and discard the supernatant with a pipette.\nAdd 300 µL of Phosphate-Buffered Saline (PBS) (10x), centrifuge at 400 x g at 22 °C and discard the supernatant with a pipette.\nPrepare five tubes for different marker combinations as follows: 5 µL of CD11B/5 µL of CD19/20 µL of CD45; 5 µL of CD73/20 µL of CD90/5 µL of CD105/20 µL of CD45; 20 µL of CD34/5 µL of HLA-DR/20 µL of CD45; Cell viability assay-5 µL of fluorescent reactive dye. (see Table of Materials) and a tube with unstained cells and PBS as the negative control. Homogenize in a vortex and incubate at 4 °C for 30 min.",
    "Centrifuge at 400 x g at 22 °C for 5 min, discard the supernatant with a pipette, add 500 µL of PBS (10x), and proceed with cell sorting.\n\t\t​NOTE: Five thousand events are acquired per antibody set in the Flow Cytometer of four colors and five parameters and analyzed with CellQuest software.\n6. Seeding of passage 1 (P1)\nSeed 2 x 105 cells in a 75 cm2 culture flask.\nAdd 12 mL of DMEM low glucose + 20% of FBS + 10% antibiotic/antimycotic (with 10,000 units penicillin, 10 mg streptomycin, and 25 µg amphotericin B per mL, 0.1 µm).\nWhen the cells reach between 80%-90% confluence, perform trypsinization of adherent cells with 2 mL of 0.25% EDTA-trypsin for 3 min.\nCount cells again (as mentioned in step 3).\nPerform immunophenotyping again (as mentioned in step 5).\n7. Statistical analysis\nUse Spearman's Rho Calculator33 to measure the strength of association between the following variables with P < 0.05, as mentioned below.\n\t\nSelect SVF cellular yield and the number of days SVF stays in culture in the first passage (P1) until 80%-90% confluence (days to P1).\nSelect SVF cellular yield before and after going to P1.\nConsider days to P1 and cellular yield before going to P1.\nSelect SVF cellular yield with the average percentage of confirmed ADSC.\nCalculate the percentage of confirmed ADSC and the cellular yield before going to P1.\nDetermine the BMI and SVF cellular yield.\n8. Differentiation assay\nPerform the differentiation assay following a differentiation kit protocol (see Table of materials). Figure 4 demonstrates the results for Case 1.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}