{
  "id": 6961,
  "origin_website": "Bio",
  "title": "Integration of Human Induced Pluripotent Stem Cell (hiPSC)-Derived Neurons into Rat Brain ",
  "procedures": [
    "hiPSCs culture and passageCulture hiPSC dsRED-SC1014 cells on inactivated MEFs in human embryonic stem cell (ESC) medium (see Recipes) in regular 6-well plates. Change medium every day.Passage cells at a ratio 1:6 to 1:12 when cells reach 80-90% confluency.Prepare MEF plates following Steps A4-A6 one or two days before passaging hiPSCs culture.Cover the whole surface of culture vessels with 2% Matrigel (in DMEM/F12) and incubate the vessels at room temperature for at least 1 hour. Aspirate Matrigel and plate 30,000 cells/cm2 of mitotically inactivated MEFs in the vessels in MEF medium (see Recipes).Keep MEF plates in a 37 °C, 5% CO2 incubator.Aspirate the MEF medium from a plate containing inactivated MEFs and add pre-warmed human ESC medium 3-4 h before plating hiPSCs.Remove hiPSC colonies which need to be passaged under a dissection microscope.Add collagenase (1 mg/ml in DMEM/F12) solution to the plate containing hiPSCs, and incubate the plate in a 37 °C, 5% CO2 incubator for 30-60 min.Stop the incubation when the edges of the colonies start to pull away from the plate.Remove the collagenase carefully to avoid disturbing the attached cell layer.Add human ESC medium to the plate, gently blow hiPSCs off, and collect hiPSCs in a new conical tube. Make sure to minimize foaming.Centrifuge at 200 x g for 5 min, and then remove the supernatant from the hiPSC pellet.Resuspend the pellet with human ESC medium.Add appropriate volume of cell suspension to each MEF plate, and return the plate to the incubator. Replace medium daily.Neural differentiation of hiPSCsDifferentiate hiPSCs to neurons based on rosette neural aggregates (termed RONAs) method (Xu et al., 2016) as below.Incubate hiPSC colonies with collagenase (1 mg/ml in DMEM/F12) in the incubator for about 5-10 min, and then gently wash off the collagenase with medium.",
    "Grow detached hiPSC colonies in suspension as embyroid bodies (EBs) (100-200 μm in diameter, ~10 EBs/ml medium) in human ESC medium without FGF2 for 2 days in Ultra-Low attachment 6-well plates (Corning).From day 2 to day 6, add Noggin (50 ng/ml, R&D system) or Dorsomorphin (1 μm, Tocris) and SB431542 (10 μM, Tocris) in human ESC medium (without FGF2).On day 7, transfer free-floating EBs to Matrigel precoated culture plates (as described above) to allow the complete attachment of EB aggregates with the supplement of N2-induction medium (NIM, see Recipes).Continuously feed cultures with N2-medium every other day from days 7 to 12.Change N2-induction medium every day from day 12 onward. Attached EB aggregates break down to form a monolayer colony on day 8 to 9 with typical neural-specific rosette formation. With the extension of neural induction, highly compact three-dimensional column-like neural aggregates RONAs form in the center of attached colonies. Microisolate RONAs manually, taking special care to minimize contaminating the peripheral monolayer of flat cells and cells underneath RONAs.At day 17, collect and maintain RONA clusters as neurospheres in Neurobasal medium (Thermo Fisher Scientific) containing B27 minus VitA (Thermo Fisher Scientific), 1 mM Glutamax (Thermo Fisher Scientific) for one day. A typical RONA is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200903/20200903201133_9070.jpgFigure 1. Typical RONAs on day 17. Immunostaining of PAX6 and NKX2.1 showing cortical patterning related transcriptional factors in neural progenitors (reproduced from Xu et al., 2016).At day 18, dissociate neurospheres into single cells following Steps B11 to B19.Remove neurosphere suspension from culture plate and transfer to a 15 ml conical tube.Let neurospheres settle down in the tube 2-5 min, and then remove the medium carefully leaving ~100 μl medium remaining with the neurospheres.Resuspend neurospheres in 5 ml DPBS (Thermo Fisher Scientific).",
    "Let neurospheres settle down in the tube 2-5 min, and remove DPBS carefully leaving ~100 μl DPBS remaining with the neurospheres.Add 1 ml Accutase (Corning) to the neurospheres and incubate for 10 min at room temperature. Pipet up and down until all the neurospheres are in a single cell suspension.Add 4 ml neural differentiation medium (see Recipes) to the tube, and centrifuge the cells at 200 x g for 5 min.Remove the supernatant gently. Resuspend the cells in neural differentiation medium to desired cell density, and plate the cells on Laminin/poly-D-lysine coated plates (Corning).From days 24 to 30, apply RA (2 μM, Millipore Sigma), SHH (50 ng/ml, R&D system), and Purmorphamine (2 μM, R&D system) into neural differentiation medium to maintain the identity of neural progenitors, which provides an appropriate percentage of excitatory (~80-85%) and inhibitory (~15-20%) neurons representative of the human cerebral cortex.hiPSC-derived neural progenitors at days 31-32 are injected into neonatal rat cortices as described below (Procedure C), and characterization are performed at 10 weeks after transplantation.In culture conditions, hiPSC-derived neurons show mature human cortical identity after 10 weeks (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200903/20200903201209_0529.jpgFigure 2. hiPSC-derived neurons show human cortical identity in culture after 10 weeks of differentiation. A. Cultures express the cortical layer-specific markers TBR1, CTIP2, BRN2, and STAB2. B. Some cells express the hippocampal marker PROX1 (reproduced from Yin et al., 2019).Animal transplantationThe whole procedure from the cell culture to transplantation is shown in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200903/20200903201232_0718.jpgFigure 3. An outline showing transplantation of forebrain progenitors from hiPSCs (reproduced from Yin et al., 2019).Trypsinize hiPSC-derived neural progenitors at days 31-32 in culture and thoroughly dissociate with a pipette. Then, centrifuge the cells at 300 x g for 3 min.Carefully remove the supernatant, and resuspend the pellet in ice cold 1x PBS with a final density of 2 x 106 cells/μl.",
    "Fill 1.0 μl of cells into a pulled glass micropipette (0.5 mm I.D., 1 mm O.D.) by suction, and then fit glass micropipette to an auto-nanoliter injector ( Nanoinject II  , Drummond). Using nanoinjector allows to minimize tissue damage and inject small volume at a relatively slow rate.Gently and deeply anesthesize neonatal rat pups.Inject the cells into the right cortex (2.0 mm posterior and 1.9 mm lateral to bregma, 2.6 mm below the dura) over 1 min. Keep the micropipette tip in place for a further 2 min before withdrawal.Brain sections immunostainingAnesthetize rats (10-week-old, also 10 weeks after transplantation) with ketamine/xylazine solution (0.5 ml/kg, see Recipes).Perfuse rats through the left ventricle of the heart with 1x PBS until the liver is bleached.Continue perfusion with freshly prepared 4% PFA.Dissect the brains and post-fix them in 4% PFA for 2-3 days at 4 °C.Transfer the brains to 30% sucrose until they sink to the bottom when they get saturated with sucrose solution.Remove the brains from sucrose solution and put them in 2-methylbutane (Fisher Scientific) in a container already chilled in liquid nitrogen for 30 s to 1 min.Drop some OCT compound (SAKURA) on the cryostat tissue holder already placed on dry ice.Place the brain tissue in the center of the holder and add more OCT compound surrounding the brain until it becomes solidified. Store the OCT brain blocks at -80 °C until being processed for serial sections.Prepare brain coronal sections (25 μm) using a cryostat ( CM3050  , Leica).Antigen retrieval step is optional and should be standardized depending upon the guidelines for each antibody. For the antibodies used in the present study, antigen retrieval is not necessary. Proceed sections for blocking with 10% (v/v) donkey serum and 0.2% (v/v) Triton X-100 in 1x PBS for one hour at room temperature.",
    "Incubate sections overnight at 4 °C with primary antibodies of interest.Wash sections with PBS three times of 5 min each, followed by incubations with appropriate, fluorescently labeled secondary antibodies at room temperature for one hour.After incubation for one hour at room temperature, wash sections with PBS three times for 5 min each and mount them on a clean slide. Dry the slide completely, and then proceed for imaging with a confocal microscope (Figure 4 and Video 1).Video 1 is produced using Z-Stack images. Set the first and last positions for the Z-Stack, i.e., the depth of the section. 1.01 µm is used for the Interval in the current study. Alternatively, choosing interval can be done by clicking on Optimal to set the number of slices.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200903/20200903201629_2950.jpgFigure 4. Human neurons expressing RFP colocalize with the mature neuronal marker MAP2, suggesting hiPSC-derived neurons integrate into the rat brain. A. A low magnification image showing RFP positive human cells in rat brain. B. Brain sections immunostained with MAP2 and DAPI (reproduced from Yin et al., 2019).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. hiPSC-derived neurons in rat brain as shown by RFP/MAP2 double positive cells (reproduced from Yin et al., 2019)Electrophysiological recordings of acute brain slicesAnesthetize rat (10-week-old, also 10 weeks following transplantation) with isoflurane (300 μl in a 500 ml container for drop jar anesthesia) and quickly remove the brain.Prepare transverse brain slices of 350 μm thickness using a vibratome (Leica  VT1200S  ).Incubate slices in ACSF solution (see Recipe 4) continuously bubbled with 95% O2 and 5% CO2, first at 34 °C for 30 min, and then at room temperature.Transfer a single slice into a submerged recording chamber constantly perfused with carbogen-equilibrated ACSF.Visualize injected human neurons expressing RFP under a 40x water immersion objective by fluorescence and DIC optics (Carl Zeiss).",
    "Perform whole-cell patch clamp recordings using a glass pipettes (3-5 MΩ) filled with internal solution (see Recipes). Randomly select RFP-positive human neurons for recording 300 μm to 1,000 μm from graft site.Induce action potentials by a series of hyperpolarizing and depolarizing step currents.Evoke sodium and potassium currents by a series of voltage steps (from –100 mV to +60 mV in 20-mV steps).Record spontaneous excitatory postsynaptic currents (sEPSCs) and spontaneous inhibitory postsynaptic currents (sIPSCs) in voltage-clamp configuration at –70 mV. Obtain sEPSCs in the presence of picrotoxin (100 μM), and sIPSCs in the presence of CNQX (20 μM) and D-AP5 (50 μM).The recording results show that grafting hiPSC-derived neurons functionally integrate to the rat brain, and they are able to fire and display excitatory and inhibitory synaptic activity (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200903/20200903201705_1246.jpgFigure 5. hiPSC-derived neurons functionally integrate into the synaptic circuitry of the rat brain. A. AP firing patterns of hiPSC-derived neurons. B. Representative traces of whole-cell Na+ (inwards) and K+ (outwards) currents recorded from grafted cells. C. Representative traces of sEPSCs and sIPSCs (reproduced from Yin et al., 2019)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}