{
  "id": 9512,
  "origin_website": "Jove",
  "title": "Thinned-skull Cortical Window Technique for In Vivo Optical Coherence Tomography Imaging",
  "procedures": [
    "1. Surgical Preparation\nFemale CD 1 mice between the ages of 6-8 weeks were used in our experiments.\nAnesthetize the mouse with an intraperitoneal injection of a ketamine and xylazine combination (80 mg/kg ketamine/10 mg/kg xylazine). Place the mouse on a homeothermic pad to ensure optimal body temperature at ~37 °C. Continuously monitor level of anesthesia by testing animal's reflexes (e.g., pinching foot with blunt forceps) and inject more anesthesia when necessary.\nLubricate both eyes with an artificial tear ointment. Remove hairs on the scalp using a razor and remove residual hair using 70% alcohol prep pads. Apply a thin layer of Nair hair removal cream over the scalp and wait 2 min for it to take effect. Gently wipe away Nair and remaining hair using saline moistened cotton swabs and alcohol prep pads. Scalp should now be completely hairless.\nDisinfect scalp using a betadine swab stick and clean with 70% ethanol prep pads.\nCarefully wrap the animal in surgical drapes to ensure optimal body temperature of ~37 °C and mount the animal onto a stereotaxic frame to immobilize the skull. Lightly tap the skull to ensure its stability. A list of materials used is provided in Table 1.\n2. Thinned-skull Cortical Window Preparation\nStart the incision at the midline point between the eyes. Continue caudally to the midline point between the ears. Part the skin with forceps.\nLocate the area to be thinned under a dissecting microscope and gently remove the fascia using tweezers. Dry the skull with sterile cotton swabs before creating the thinned cortical window. In our experiments, we created a 4 × 4 mm thinned cranial window ~1 mm posterior and lateral to bregma.",
    "Begin thinning the skull using a round carbide bur with drill bit size 0.75 mm in a surgical hand drill using light sweeping motion only. Do not apply direct pressure onto the skull. Stop drilling every 20-30 sec to remove bone dust using sterile saline and cotton swabs and to avoid overheating the skull. The saline will also aid in dissipating the heat throughout the skull.\nOnce the outer layer of the compact bone is completely removed the middle spongy bone layer should now be visible. There may be some slight bleeding as blood vessels are more apparent in the spongy bone layer. Switch to a green stone bur and continue drilling using extra caution as the spongy layer is more delicate. The green stone bur will remove less bone material while creating evenness throughout the cranial window. Stop drilling occasionally to remove bone dust and to cool the skull.\nFinally, when the skull has become more transparent and vasculature on the brain is now visible, begin polishing the skull using a polishing bur. This will allow a more precise thinning while smoothing down the skull. Check thinness of the skull by gently tapping on it with forceps. Stop polishing when the skull becomes slightly flexible.\nThe thinned cranial window should now be completely smooth and reflective and ready for imaging (Figure 1). Due to the nature of highly scattering tissues of the brain, the skull should be thinned to at least 55 μm for optimal depth penetration. A list of materials used is provided in Table 1.\n3. Optical Coherence Tomography Imaging",
    "After surgery is complete, check animal's breathing rate and reflexes to ensure proper level of anesthesia and administer additional anesthesia if necessary. Remove animal from the stereotaxic frame, keep animal wrapped in surgical drapes, and transport animal to the imaging station.\nBefore imaging check signs for reflexes and apply additional artificial tear if needed. Mount animal on to the stereotaxic frame to secure the skull.\nPlace animal under OCT camera and position the TSCW under the optical beam (Figure 2). A cross-sectional view of the skull and brain can now be visualized (Figure 3).\nData acquisition can begin once area of interest is located. For imaging purposes, we use galvo mirrors to achieve an imaging window with a width of 4.0 mm. An imaging depth of 2 mm was obtained with 6 mW of incident power and a focal point 1 mm below the thinned skull. Each cross-sectional area consisted of 2,048 axial scans with an acquisition rate of 0.14 sec per image.\nVolumetric scans of the brain can also be obtained by collecting a series of 2D cross-sectional images by using two sets of galvo mirrors for x-y scanning with the first galvo mirror scanning the beam in the sagittal direction and the second galvo mirror scanning in the coronal direction.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}