{
  "id": 4803,
  "origin_website": "Bio",
  "title": "Thioglycollate-elicited Peritoneal Macrophages Preparation and Arginase Activity Measurement in IL-4 Stimulated Macrophages",
  "procedures": [
    "Injection of thyoglicollate into the peritoneum   Preparation of 3% thioglycollate medium.    Suspend 30 grams of thioglycollate medium in 1,000 ml of pyrogen-free water.   Aliquot to 100 ml sterile bottles.    Autoclave (15 psi/121 °C/15 min).   After cooling, store in a dark place at room temperature for 2 months before using.  Note: Thioglycollate solution needs to age for several weeks until it turns to brown in color. This process is important to increase the extravasation of peritoneal cells.     Inject 2.5 ml of 3% thioglycollate medium i.p. per mouse using a 10 ml syringe with a 25 G needle. Wait for 4 days and harvest peritoneal cells (see step B).      Isolation and culture of thioglycollate elicited peritoneal macrophages    Sacrifice mouse with CO2 or isofluorane (the use of cervical dislocation is not indicated in this protocol in order to avoid potential internal bleeding).   Clean abdomen with 70% ethanol.   Remove skin to expose the peritoneal wall. Practice a small incision in the skin and pull firmly.   Inject 10 ml of RPMI 1640 into the peritoneal cavity with a 25 G needle.   Massage abdomen for approximately 30 sec.   Recover peritoneal fluid as much as possible using a 10 ml syringe with a 21 G needle. (Usually approximately 8-10 ml fluid can be recovered from one mouse.)   Remove needle from syringe and put fluid into a 50 ml conical centrifuge tube on ice.   Centrifuge peritoneal cells 5 min at 300 x g (1,500 rpm, 4 °C). Discard the supernatant and collect the pellet.   Resuspend cell pellet in 10 ml of RPMI 1640 medium and count cells. (Usually approximately 30-50 million cells can be recovered from one mouse.)   Culture peritoneal cells (1 x 106/cm2) in a 12-well plate in 1 ml of RPMI containing 10% heat-inactivated FBS at 37 °C with 5% CO2 for 3 h.",
    "Remove non-adherent cells by extensive washing with RPMI containing 10% heat-inactivated FBS at 37 °C.   Proceed to overnight cell starvation in the presence of 1 ml of RPMI 2% FBS per well.      M2 activation of peritoneal macrophages   After cell starvation, maintain the cells in RPMI 2% FBS and stimulate macrophages by adding IL-4 (20 ng/ml) to the 12-well plate and incubate at 37 °C for 24 h.      Arginase activity measurement   For cell dissociation, wash cells once with PBS and add an appropriate volume of lysis buffer at RT (see Recipes).  Note: Usually 200 μl in each 12-well plate.    Remove cells with a cell scraper, collect them into a 1.5 ml Eppendorf and pipette up and down 5 times with a 200 µl tip for complete suspension.    Lyse the cells for 15 min at 4 °C.   Then spin down cell lysates at full speed (10 min, 14,000 rpm, 16,800 x g) at 4 °C and isolate the supernatant. Store at 4 °C before use.   Meanwhile, prepare a stock of 8 M urea in 50 mM Tris-HCl (pH 7.5).   Dilute stock of urea in 50 mM Tris-HCl (pH 7.5) to yield a standard range from 25 to 1,500 μg/ml. (e.g. 25, 50 100, 250, 500, 1,000 and 1,500 μg/ml)   Transfer 50 μl of cell lysates and standards to a 2 ml Eppendorf tube and add 50 μl of 10 mM MnCl2 diluted in 50 mM Tris-HCl (pH 7.5).    Incubate tubes in a thermoblock or water bath for 10 min at 55 °C to trigger arginase-1 activity.   Then add 50 μl of 0.5 M L-arginine to the tubes and incubate in a thermoblock or water bath at 37 °C for 60 min. This step induces arginine hydrolysis.   Stop the reaction by adding 400 μl of stopping solution (H2SO4/H3PO4/H2O = 1/3/7, v/v/v).",
    "Next, add 50 μl of 9% isonitrosopropiophenone in 100% ethanol to each sample and standard, and incubate the tubes in a thermoblock at 100 °C for 60 min.   Place the tubes in the dark at RT for 30 min.   Transfer 100 μl/well of samples and standards in triplicate to a 96-well plate and read optical density at 540 nm with a 690 nm correction.    Calculate sample concentrations from the standard curve and converted to Arginase Units using the following formula: [Urea Produced (μg/ml)/Total Protein (μg/ml)]."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}