{
  "id": 18545,
  "origin_website": "Jove",
  "title": "Isolation and Culture Expansion of Tumor-specific Endothelial Cells",
  "procedures": [
    "The following protocol is carried out according to guidelines established by the Department of Laboratory Animal Medicine at the University of North Carolina at Chapel Hill.\n1. Prepare the Following Material and Reagents Before Starting\nPrepare EC media by supplementing 400 ml low glucose (1 g/L D-glucose or LG) Dulbecco's Modified Eagle's medium (DMEM) with 50 ml heat-inactivated fetal bovine serum, 50 ml Nu-Serum IV, 5 ml antibiotic-antimycotic, and the hFGF, VEGF, hEGF, R3-IGF-1, and heparin components from the commercial kit.\nPrepare 500 ml FACS buffer (0.5% BSA and 2 mM EDTA in PBS); filter through a sterile 0.22 µm filter cup.\nSterilize or disinfect dissecting board.\nSterilize dissection pins, surgical scissors, and dissectors.\n2. EC Isolation (Day 1, ~5 hr)\nEuthanize mouse with carbon dioxide or other methods compliant with the Institutional Animal Care and Use Committee (IACUC) policies.\n\tNote: Multiple mammary tumors varying in size (5 - 15 mm in diameter) may develop in a single genetically modified mouse such as C3-TAg, be sure to harvest all of them for TEC isolation. If using tumors that are orthotopically engrafted in mice, pool two to three 1 cm3 tumors for a single EC isolation. Here we use mammary tumors as a demonstration, but the protocol can be modified for other types of tumors.\nDisinfect mouse by spraying or wiping the mouse ventral side with ample amount of 75% v/v ethanol.\nResect tumors with one pair of scissors and dissectors using aseptic techniques in a sterile hood or at a clean bench.\n\t\nStretch out and pin the limbs of the mice on a dissecting board. Make a midline ventral incision with the scissors without opening the peritoneum. Dissect laterally between the skin and the peritoneum towards the mammary glands where tumors are located. Do not open the peritoneum.",
    "Excise only tumor tissue from the mammary glands, leaving out normal mammary margins. Carefully trim off non-tumor tissues such as skin and muscles, and place dissected tumors in a conical tube containing 30 ml of LG-DMEM on ice.\nBring tumor samples to tissue culture hood; wash tissues with sterile LG-DMEM 1 - 2 times.\nTransfer tumors from the conical tube to a sterile tissue-culture petri dish, add 2 ml of LG-DMEM in the dish, and mince with a pair of sterile scissors into pieces <5 mm.\nAdd 5 ml of collagenase (stock = 2 mg/ml in Hank’s Balanced Salt Solution, hereafter HBSS), 1 ml of dispase (stock = 2.5 U/ml in HBSS) and 75 μl of deoxyribonuclease (stock = 1 mg/ml in PBS) into the petri dish. Total volume is now ~10 ml.\nTransfer the collagenase/tissue mix from the petri dish to a tissue-dissociator tube and run on a tissue dissociator for 60 sec twice (pre-set dissociation program on the dissociator: 1,270 total rounds per run). Incubate with light shaking on a shaker for 75 min at 37 °C.\nFilter digested tissue through a 100 μm cell strainer over a 50 ml conical tube. Rinse filter with 5 ml of FACS buffer to wash any remaining cells. Spin at 280 x g for 5 min and carefully aspirate the supernatant without disturbing the cell pellet.\nDilute 1 ml of stock RBC lysis buffer (10x) in 9 ml of sterile water. Lyse red blood cells with 10 ml of lysis buffer (1x), and immediately spin 5 min at 280 x g. Note: This step can be skipped if little blood is visible.\nResuspend in 10 ml of FACS buffer. Mix 10 μl of cell suspension with 10 μl of trypan blue, and count live cells using a hemocytometer .",
    "Resuspend cells at ~107 cells/100 μl. Add 10 μl of FcR block per 100 μl of cell suspension, and incubate on ice for 10 min.\nAdd rat-anti mouse PE-conjugated CD31 antibody according to Table 1. Incubate on ice for 10 - 15 min and flick tube occasionally.\nAdd 10 ml of FACS buffer to the tube and spin at 280 x g for 5 min. Carefully remove the supernatant, and wash the cell pellet again with 5 ml of FACS buffer. Centrifuge to pellet cells. Aspirate supernatant without disturbing cell pellet.\nAdd FACS buffer and anti-PE microbeads according to Table 2. Incubate on ice for 10 - 15 min. Flick tube occasionally.\nAdd 10 ml of FACS buffer and spin samples at 280 x g for 5 min; wash once with 5 ml of FACS buffer and centrifuge again. Aspirate supernatant without disturbing pellet.\nBring volume to 300 μl in FACS buffer. Spin through 35 μm cell-strainer capped tube 5 min at 280 x g. Use 2 tubes and a larger volume if needed.\nSet up magnetic multistand and magnetic columns in hood, attach a column to the separator and equilibrate the column with 2 ml of FACS buffer.\nAspirate the supernatant and resuspend the cell pellet in 0.5 - 1 ml of FACS buffer.\nPass the cell suspension through the equilibrated magnetic column.\nWash the column three times with 2 ml of FACS buffer, and collect flow-through (FT) in a 15 ml tube (FT fraction).\nTake the column off the separator and elute with 2 ml of FACS buffer into another 15 ml tube (eluate fraction). Use plunger to ensure all cells are off the column. Repeat the elution two more times with 2 ml of FACS buffer each time.",
    "Spin the eluate at 280 x g for 5 min.\nRemove the supernatant and resuspend the pellet in 10 ml of EC media.\nEqually divide the eluate fraction (~ 6 ml) into 10 cm gelatin-coated dishes. For three 1 cm3 tumors, plate eluted cells in at least four plates. Alternatively, plate eluted cells at different concentrations in multiple plates (e.g., seed 0.5 ml, 1 ml, 1.5 ml, and 3 ml of the eluate into four plates) to ensure that at least one plate is sparsely seeded with eluted cells. Check that the confluency of the attached cells is at ~1% the next day (i.e., approximately 1.0 - 2.0 X 105 attached cells).\n\tNote: The cells need to be plated sparse so that EC colonies can form without being contaminated by other cell types.\nPlate FT fraction in one 10 cm dish to let cells recover O/N. Check that the plate is 80 - 100% confluent the next day. Freeze down the cells (-80 °C) in 250 µl cell-freezing media in a cryotube and store them in liquid nitrogen the next day. Note: FT fraction can be used for tumor cell isolation at a later stage and/or as a negative control for EC gene expression analysis of the isolated EC clones.\nChange media every 2 - 3 days. Colonies start to form after 7 - 10 days. Small EC colonies can be identified as early as day 3. Mark the colonies with a fine-tip marker on the bottom of the dish.\nScrape off non-specific cells surrounding the identified colonies with a sterile 200 µl pippet tip.\n3. Colony Selection Using Cloning Rings",
    "Change media every 2 - 3 days. EC purity can be checked by LDL (DiI-Ac-LDL) addition at about 5 - 7 days. Add 50 µl of LDL per 10 ml EC medium and incubate for 3 - 4 hr before checking the cells under fluorescence microscope.\n\tNote: Multiple LDL+ EC clones could be observed at ~day 7.\nStart harvesting EC colonies when they reach diameters of 3 - 5 mm in size. (Choose big colonies that are packed with small LDL+ cells for best results.)\nBefore harvesting EC with cloning rings, pre-coat a few 6-well plates with 0.5% gelatin. Aspirate gelatin, add 2 ml of EC media to each well, and keep the plates in an incubator until needed.\nScrape off non-EC on the edges of the colonies to make sure no other cell types will be trapped within the cloning ring.\nUsing a phase-contrast microscope (4X or 10X objective), outline with a fine-tip marker on the bottom of the culture dish the areas containing EC colonies.\nWash the plate with 10 ml of PBS and leave a very thin layer of PBS in the plate when aspirating. (Important: a small amount (~0.5 ml) of PBS will keep cells alive during the cloning-ring procedure; also, tissue adhesive needs water to bond.)\nChoose a cloning ring of appropriate size. Use a pair of dissecting forceps to pick up a ring, and with a 10 µl pipet tip evenly apply a small amount of tissue adhesive onto the cloning ring.\n\tNote: use only minimal amount (~0.2 μl for a small ring) of tissue adhesive on cloning rings, and make sure tissue adhesive is spread out evenly around the bottom surface to ensure good sealing. Excessive tissue adhesive produces heat and forms films that may kill cells.",
    "Place the cloning ring over the EC colony. Gently press down the cloning ring to glue the ring onto the plate. Ensure that the colonies are not dried out before gluing the ring.\nImmediately pipet 25 µl of enzymatic cell detachment solution into the cloning ring and incubate ~1 min or until the cells are loosely attached.\nPipet cells in the cloning ring drop-wise into one well of a 6-well plate containing pre-warmed EC media. (Important: Do not shake the plate to disperse cells; EC prefer to grow in tight clusters.) Wash the cloning ring with 50 - 100 µl EC media to collect as many cells as possible, and transfer all washes into the same 6-well.\nIf some colonies in the 10 cm dish are too small to harvest, add 10 ml fresh media, let the colonies grow for a few more days, and repeat the cloning ring procedure again.\nGrow harvested colonies in 6-well plates until 80 - 100% confluent, and transfer cells to 3 wells of a 6-well plate, before expanding them in a 10 cm tissue culture dish. Scrape off contaminant cells. Repeat another round of cloning ring procedure (Steps 3.5 - 3.10) if necessary. Keep cells relatively confluent (~60 - 70%) when expanding. EC may stop growing if plated too sparse.\nCharacterize EC by FACS, staining, PCR, etc. Note that Dil-Ac-LDL is fluorescent and may interfere with PE or other fluorescent antibodies for FACS.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}