{
  "id": 7552,
  "origin_website": "Bio",
  "title": "Generation, Maintenance and HBV Infection of Human Liver Organoids",
  "procedures": [
    "Dissociation of human liver hepatocytes and seeding of organoidsSafety instructions for working with human tissue:While handling human tissue, work inside the biosafety cabinet.Take precautions while working with human tissue (i.e., wear lab coats, gloves, sterilize the working space, etc.)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical Step:  Warm up a 24/48-well suspension plate in the incubator at 37°C.Prepare all the buffers/solution required for the procedure prior to start.After surgical excision, collect the sample immediately in a 15 mL or 50 mL Falcon tube, depending on the size of the biopsies and preserve in 5–10 mL of Belzer UW cold storage solution (commercial transfer medium provided by surgeons to transfer the biopsies) at 4°C until processing.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000946_8567.pngOptional step:  Biopsies can be stored up to 48 h at 4°C. We recommend processing the tissue immediately after surgery.Remove the basal medium and wash the tissue twice with 10 mL of DMEM +/+ (see Recipes) using a 10 mL pipette.Place the tissue into a 60 mm Petri dish using sterile tweezers (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g001.jpgFigure 1. Human liver biopsies from donor (left) and patient (right). Add 1-2 mL of Ad+++ medium on top of the tissue and mince it into pieces of 0.5-1 mm3, using two scalpels (mince the tissue until it can be easily triturated with a p1000 pipette) (Figures 2-3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical Step:  Use a scalpel blade 12D and scalpel blade 10 or 11 to cut the tissue. Try to slice the tissue gently and vertically with the scalpels, instead of pressing or mashing the tissue at an angle with the side of the scalpels with force. Excessive force can cause cell rupture.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g002.jpgFigure 2. Mincing of liver biopsy. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g003.jpgFigure 3. Minced liver tissue from donor (left) and patient (right). Transfer the minced tissue with a P1000 pipette to a 15 mL Falcon tube and top up to 10 mL with ice-cold Ad+++.",
    "Gently pipette up and down with a 10 mL pipette, to wash the liver pieces.Centrifuge at 100 × g and 4°C for 10 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical Step:  For biobanking the tissue:Divide the minced tissue into two after centrifugation and place half in a cryoTube containing 1 mL of freezing media.Label with an alcohol-resistant marker and transfer the cryotube in the pre-cooled (4°C) freezing container.Transfer the freezing container to -80°C.Transfer the samples within 2-3 days from the -80°C freezer to liquid nitrogen, for long-term storage.Organoids can be generated from frozen tissue, albeit with lower efficiency. Frozen tissue can also be used for genomic, transcriptomic, and proteomics studies.To generate organoids from frozen minced tissue, take the sample out from the liquid nitrogen tank and transfer on dry ice. Take the vial and place it in a water bath (37°C) for 40-60 s (~90% of the sample is thawed) and immediately add 1 mL of Ad+++ dropwise to the vial. Transfer the volume to a 15 mL Falcon tube containing 10 mL of Ad+++. Continue further from step 6.Discard the supernatant and add a sufficient volume (4-6 mL based on the size of the tissue, 4 mL for smaller tissue, and 6 mL for larger tissue) of pre-warmed digestion solution.Homogenize the tissue gently with digestion solution by inverting the tube 5-8 times and pipetting up and down with a P1000 pipette.Place the tube containing the homogenized sample horizontally in a rack and transfer it to a shaker incubator at 100-120 rpm and 37°C for 45 min-1 h (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical Step:  Check every 15 min, to make sure not to over-digest the tissue. Whenever almost all the pieces of tissue are digested, start the next step immediately.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g004.jpgFigure 4. Placement of minced tissue on the shaker inside the incubator.",
    "Resuspend the cells by pipetting up and down with a P1000 pipette (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g005.jpgFigure 5. Digested liver biopsy. Neutralize the digestion by adding 10 mL of cold Ad+++.Pass the digested material through a 70 µm cell strainer (Figure 6) and collect the material in a 50 mL Falcon tube.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000946_8567.pngOptional step:  If any partially digested tissue remains on the strainer, collect it with a p1000 pipette and incubate further with 1 mL of TrypLE at 37°C and 5% CO2 for 10–15 min. After incubation, follow step 12 again.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000946_8567.pngOptional step:  If any debris or plastic pieces from the Petri dish are still present in the solution, repeat step 12 to remove these.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g006.jpgFigure 6. Straining of digested liver biopsy. Add pre-warmed Ad+++ (37°C) to increase the volume to 25–30 mL.Centrifuge at 200 × g and 4°C for 5 min.Remove the supernatant. Resuspend the cell pellet in 10 mL of cold Ad+++ with a 10 mL pipette and transfer the resuspended cells to a 15 mL Falcon tube.Centrifuge at 200 × g and 4°C for 5 min.Remove the supernatant and resuspend the cell pellet in 2 mL of Ad+++. Count the cells and mix the appropriate number of cells with BME, which will polymerize and form a dome like structure (drop), to give the organoids mechanical support to grow in 3D.Count the cells with a hemocytometer to seed approximately 10,000-15,000 cells/25 µL drop in a 48-well plate.Centrifuge at 200 × g and 4°C for 5 min.Resuspend the cells with the appropriate volume of Ad+++ and BME to make the drops (each drop contains 1/3 Ad+++ and 2/3 BME, i.e., 8.3 µL of Ad+++ plus 16.6 µL of BME per 25 µL-drop in a 48-well plate).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical Step:  When homogenizing the BME/Ad+++ mixture and making the drops, it is important to avoid making any bubbles.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.",
    "pngCritical Step:  While handling the BME, always keep the BME on ice, and be quick when making the drops. The BME will start to solidify if removed from ice for longer than 1 min.Take the pre-warmed plate from the incubator and start making the drops (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312002008_1387.jpgNote:  The volume of a drop for each well of a 48-well plate is 25 µL. For a 24-well plate, both 3× 25 µL drops or 1× 50 µL drop can be used.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g007.jpgFigure 7. BME drops containing hepatocytes. Incubate at 37°C and 5% CO2 for 30–45 min, and let the BME polymerize.Add 250 µL (48-well plate) or 500 µL (24-well plate) of warm human liver organoid isolation medium (IM) in each well (Figure 8).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g008.jpgFigure 8. Adding the organoids culture medium. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical step:  Add the medium gently on the side of the well. Avoid adding the medium directly on top of the drop.During the first seven days, change the medium every 3–4 days and use IM.After 1 week of seeding the organoids, change IM to human liver expansion medium.Organoids will be visible within 2–14 days post seeding. Daily monitoring using a bright field microscope is required to identify growing organoids (Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g009.jpgFigure 9. Generation of organoids from liver biopsy.Expansion and maintenance of organoids in cultureSplit the organoids every 7–10 days according to organoid density and size (>500–1,000 µm). Here, the term splitting means digesting the organoids enzymatically and mechanically, and distributing the digested organoids into the required number of wells by means of mixing the digested organoids with BME/Ad+++ and making the drops. The general split ratio is 1:4–1:8, depending on growth rate of the donor organoid lines.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical step:  Pre-warm the 24-well suspension platePrepare 1× 15 mL Falcon tube containing 10 mL of ice-cold Ad+++.Discard the medium from each well.",
    "To collect the drops, take 4 mL of ice-cold Ad+++ from the 15 mL Falcon tube and add 1 mL into each well containing organoids that need to be split.Disrupt the drop containing organoids by scraping with P1000 pipette.Collect the disrupted organoids and transfer to one 15 mL Falcon tube. A maximum of 4 wells can be collected in one 15 mL Falcon tube (e.g., if 8 wells are split, the organoids can be collected in two 15 mL Falcon tubes).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312002008_1387.jpgNote:  Follow step 3–5 for each 4 wells of organoids.Triturate 3–5 times with a 10 mL pipette.Keep the Falcon tubes on ice for 20–45 min. Invert the Falcon tubes every 10 min, this can help the BME to dissolve efficiently.Centrifuge at 200 × g and 4°C for 5 min.Discard the supernatant.Add 60–100 µL of TrypLE to the pellet of organoids. Digest the organoids mechanically at room temperature for 1–5 min, by pipetting with a P200 pipette.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312002008_1387.jpgNote:  Check the size of the digested organoids under the microscope. The desired size depends on the experimental requirements. Make sure that the digested organoids are uniform in size.Add 10 mL of ice-cold Ad+++ to stop the digestion and centrifuge at 200 × g and 4°C for 5 min.Discard the supernatant completely.Resuspend the digested organoid pellet with the appropriate amount of 1/3 Ad+++ and 2/3 BME (e.g., if splitting two wells 1:4, then 8 drops need to be made; if 6 drops are split 1:6, then 36 drops need to be made).Make drops of appropriate volume based on the plate that is used.Allow the drops to polymerize at 37°C and 5% CO2 for 30–45 min.Add 250 µL (48-well plate) or 500 µL (24-well plate) of warm EM.Change the medium every 2–3 days (Figure 10).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g010.jpgFigure 10. Liver organoids in expansion medium.",
    "Hepatic differentiation of liver organoidsCulture liver organoids with EM-wnt3A+BMP7 for 3–5 days prior to differentiation, to allow the organoids to recover and completely reform after splitting.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical step:  If the organoids are big, this might result in breaking of organoids during spin infection. Therefore, start differentiating the liver organoids when they are small (50–350 µm).Wash the drops gently two times with 500 µL of warm Ad+++.Add 250 µL (48-well plate) or 500 µL (24-well plate) of warm human liver organoid differentiation medium (DM).Change the medium every 2–3 days. Differentiate the organoids for 7 days (Figure 11).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g011.jpgFigure 11. Liver organoids in differentiation medium. HBV infectionThe infection of human liver organoids can be done either without the addition of PEG or with addition of 4% PEG, which plays a role in increasing the infection efficacy.Safety instructions for working with recombinant HBV:Handling HBV should only be done by HBV vaccinated personnel.While handling HBV, work inside the biosafety cabinetTake proper precautions while working with HBV (i.e., wear lab coat, gloves, sterilize the working space, etc.)Remove the medium from each well.Collect the organoids by disrupting the drops gently with a 10 mL pipette.Pull together 3–4 wells of organoids into a 1× 15 mL Falcon tubes containing 10 mL ice cold Ad+++Pipette up and down gently 3–5 times with a 10 mL pipette.Incubate on ice for 50–60 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical step:  Mix the organoids by inverting the flacon tubes every 5 min. This will help the BME to dissolve efficiently.Centrifuge the differentiated organoids at 100 × g and 4°C for 10 min.Discard the supernatant.Thaw the pre-titered recombinant HBV stock on ice.Centrifuge the virus at max speed and 4°C for 10 min.Prepare 500 μL of Ad+++ containing 1–10 × 107 copies of HBV (or heat inactivated HBV as control) with or without 4% PEG.",
    "Resuspend a pellet of washed differentiated organoids corresponding to 3–4 wells (of 24-well plate) in the 500 μL virus mix.Divide the volume over a 48 (250 μL/well) or 24-well plate (500 μL/well)Seal the plate with parafilm (Figure 12).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g012.jpgFigure 12. Parafilm sealed plate containing differentiated liver organoids and HBV. Place the sealed plates in the pre-warmed (32°C) Eppendorf centrifuge (5810 R) and spin infect at 600 × g and 32°C for 60 min.Remove the parafilm.Triturate gently the organoids with a P1000 pipette.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical step:  If the organoids are too big, snip the tip of the P1000 before triturating.Incubate at 37°C and 5% CO2 for 5 h.Collect the organoids in a 15 mL Falcon tube with a 10 mL pipette.Centrifuge at 100 × g and 4°C for 10 min.Discard the supernatant containing the virus.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220312/20220312000929_8546.pngCritical step:  Virus can be recycled 2–3 times. It is recommended to check the virus titer before each subsequent infection.Resuspend the organoids with 10 mL of ice-cold Ad+++.Centrifuge at 100 × g and 4°C for 10 min.Repeat steps 20–21 4–5 times.Remove the supernatant completely.Resuspend the pellet with an appropriate volume of 1/3 Ad+++ and 2/3 BME.Make the drops in pre-warmed plate. Keep the number of wells the same as the number of wells that were collected for infection (i.e., if 12 wells of differentiated organoids are used for infection, the organoids can be seeded back into 12 wells post spin infection.)Incubate the plate at 37°C and 5% CO2 for 30–45 min.Add 250 µL (48-well plate) or 500 µL (24-well plate) of warm EM supplemented with 10 µM Rho-kinase inhibitor.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4358/bioprotoc-12-06-4358-g013.jpgFigure 13. Hepatitis B virus (HBV)-infected liver organoids. The next day, remove the medium of organoids.Keep the medium to titer.Gently wash the drops with 500 µL of pre-warmed Ad+++ four times.",
    "Add 250 µL (48-well plate) or 500 µL (24-well plate) of pre-warmed DM.Change the medium every 2–3 days depending on experiment."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}