{
  "id": 11184,
  "origin_website": "Jove",
  "title": "Synthetic Spider Silk Production on a Laboratory Scale",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig1overview.jpg\nGraphical Overview: Biomimicry of the Spinning Process\nBiomimicry of the natural spider silk production pathway: a route to manufacture synthetic silk. This image shows the major ampullate gland from the golden orb weaver, Nephila clavipes, and the components utilized for natural silk production (white text). The tail region synthesizes large quantities of silk proteins that are transported to the ampulla, a storage region for the spinning dope. This concentrated dope is extruded through the spinning duct where the solution experiences ion exchanges and dehydration prior to fiber extrusion. The biomimetic processes used in our laboratory are indicated by the red text. Recombinant silk production is generated using transgenic bacteria, followed by protein purification using chromatography. Next, the purified protein is subject to lyophilization to concentrate the material. Lastly, the protein is re-dissolved in HFIP and extruded from a syringe needle into an isopropanol bath.\n1. Plasmid Construction and Bacterial Cell Culture Preparation\nPerform PCR using the desired spider silk cDNA and specific primer sets. Gel-extract and ligate the amplified cDNA into a prokaryotic expression vector e.g. pBAD/TOPO ThioFusion (Fig. 1A). This vector has an N-terminal thioredoxin tag to facilitate silk protein solubilization and a C-terminal 6x his-tag for protein purification. Transform the ligation products into competent E. coli cells.\nSelect colonies that contain the recombinant cloning vector and use one colony to inoculate 200 mL of sterile LB supplemented with ampicillin (Fig. 1B). Grow this culture overnight to saturation by shaking at 200 rpm in an orbital incubator at 37 °C.\nCombine the 200 mL of saturated culture with 800 mL of fresh LB culture. Induce spider silk protein expression for 4 hours by adding 0.2% arabinose (w/v). Make sure to keep the culture under antibiotic selection.",
    "Pellet the cells at 16,000x g for 10 minutes at 4 °C (Fig. 1C). For simplicity, pellet the entire volume in one container. Multiple centrifugation steps may be necessary depending upon the volume capacity of the centrifugation tubes. If necessary, decant the liquid volume after spinning and re-pellet additional material to ensure the entire cell pellet is in one container. Cell pellets can be stored at -80 °C until needed.\nBefore disposing the spent culture media, add bleach or autoclave to sterilize.\n2. Cell Lysis\nAdd 20 mL of 1x lysis buffer to the 1 L cell pellet (Fig. 2A). Make sure to resuspend the cell pellet completely.\nAdd lysozyme to a concentration of 1 mg/mL to promote further cell lysis. DNase can also be added at this step to digest chromosomal DNA to help reduce the viscosity of the solution. Place the sample on an orbital shaker and gently rock for 20 min.\nSonicate the solution at maximum for 1 minute.\nTo clarify the solution, centrifuge at 16,000x g for 10 minutes at 4 °C (Fig. 2B).\n3. Protein Purification: Ni-NTA Affinity Column Chromatography\nRemove the supernatant and transfer it into a clean 25 mL chromatography column. Make sure the supernatant is non-viscous and clear. If the solution is viscous and cloudy, add more DNase or sonicate and/or re-pellet the supernatant (repeat steps 2.3-2.4).\nAdd 1 mL of Ni-NTA slurry (0.5 mL beads) into the column. Tightly secure the cap and stopcock, and then set on a rocker to equilibrate for 1 hour to allow binding of the 6x his-tag to the Ni-NTA beads (Fig. 3A).",
    "Set the column upright on a stand and allow the Ni-NTA beads to settle for approximately 2 minutes. A light blue layer can be seen at the bottom when the beads are completely settled.\nRemove the cap and allow the solution to flow through the stopcock. Collect this solution for further analysis (Fig. 3B).\nAdd 20 mL of 1x wash buffer and allow the beads to settle. Open the stopcock and allow the solution to flow through. Collect this solution in four 5 mL aliquots for further analysis. Note: Additional wash volumes can be used to reduce contaminating proteins; however, there is a possibility of a decrease in final protein yield.\nAdd 20 mL of 1x elution buffer and allow the resin to settle. Open the stopcock and allow the solution to flow through. Collect this solution in four 5 mL aliquots for further analysis. Note: Additional elution volumes can be collected from the Ni-NTA resin if the elution is not completed.\nSamples may be stored in 4 °C or -80 °C for short- or long term storage, respectively.\nSize-fractionate the samples using SDS-PAGE analysis. Visualize the proteins with silver or Coomassie Brilliant Blue R-250 (Fig. 3C). Only pure fractions should be used for the following steps. Note: Western blot analysis can be used to confirm the identity of the purified protein.\n4. Dialysis and Lyophilization\nDialyze the samples against at least 100x the sample volume (use deionized water) for 2 days. Change the water solution every 6 hours to remove all salts. Note: The molecular weight size cut-off of the dialysis tubing depends on the size of the recombinant silk protein.",
    "Weigh six 1.5 mL empty microfuge tubes and record their masses. It may be useful to puncture small holes or slits on the caps of the tubes prior to weighing for freeze drying to facilitate lyophilization (Fig. 4A).\nAfter dialysis, transfer 1 mL of the dialyzed sample into each of the 6 pre-weighed microfuge tubes (Fig. 4B). Flash freeze using liquid nitrogen and dry the samples down using a freeze dryer (Fig. 4C).\nOnce dry, transfer another 1 mL of the dialysis sample into each of the six tubes. Repeat until the entire dialysis sample has been dried down in the microfuge tubes.\nFreeze dried samples can be stored at -80 °C for long term storage.\n5. Spinning Dope Preparation\nWeigh each of the microfuge tubes containing the dried protein powder. Subtract the initial mass of the empty tubes to obtain total dry protein mass. Note: Depending upon protein yield, you may need to purify additional material for the spinning process.\nCalculate the volume of Hexafluoroisopropanol (HFIP) to add to each tube to obtain 200 mg/mL to 500 mg/mL, or 20% to 50% weight per volume. Add the appropriate amount of HFIP into each tube (Fig. 4D). Note: HFIP is highly volatile and toxic, pipette carefully and cap the tube as soon as possible. HFIP should be handled underneath a safety hood.\nParafilm the tubes and place on a rocker to solubilize the protein. Vortex and centrifuge occasionally to facilitate solubilization. This may take up to 2 days.\n6. Syringe Preparation and Apparatus Setup\nLoad at least 25 μL of the solubilized spinning dope into the syringe. Make sure there are no aggregates present as it may clog the syringe. Note: This sample is incredibly viscous, so take care when pipetting.",
    "Push the dope to the front of the syringe vertically, removing all air bubbles (Fig. 5A). Note: Air bubbles create inconsistencies in the fiber.\nLock the syringe to the pump. Raise a 400 mL beaker filled with 95% isopropanol up so the tip of the syringe is just breaking the surface of the alcohol (Fig. 5B).\nSet the syringe pump to 15 μL/min and start the program. Allow the as-spun fiber to sit in the isopropanol for 20 minutes to fully equilibrate. Note: These fibers can still be used by MS/MS analysis to confirm the identity of the proteins in the fibers.\n7. Post-spin Draw and Sample Collection\nApply double-sided tape to both sides of the comb on the spooling device. The spooling device was created from gluing metal combs to a digital caliper (Fig. 6A). Attach the spooling device to a motor (Fig. 6B). We recommend spooling the threads at 2 rpm. Note: faster spooling rates result in large amounts of variation in fiber quality and reproducibility.\nUsing forceps gently grab one end of the fiber and slowly pull it out of the isopropanol, attaching it to the edge of one of the comb arms on the spool (Fig. 6C). The next few steps should be done without a stoppage to prevent the fibers from drying out.\nTurn on the motor and gently guide the fiber onto the spooling device. Note: During spooling, do not allow the fiber to double up and stack on top of each other.",
    "Once the entire fiber is spooled, detach the spool from the motor and apply glue to the edge of each silk fiber on the double sided tape (Fig. 6D). This fastens the spider silk onto the apparatus. Note: By applying the glue to the double-sided tape prior to post-spin drawing, it prevents the entire fiber from slipping and allows for selective stretching of the interior segments of the fibers within the caliper arms.\nAttach the spool to the linear actuator (Fig. 7A). Record the initial length of the fibers using the caliper. Note that this is the internal length of the fiber; it does not include the length glued and wrapped around the spool.\nLower the spool into a 75% isopropanol bath. Allow the fibers to equilibrate for 10 minutes. Note: Other dehydrating solutions can be used for the spinning process, such as methanol, acetone and ammonium sulfate.\nSet the linear actuator speed to 1.5 mm/sec. Based on the initial length, calculate the final length for the desired post-spin draw ratio. The amount stretched can be controlled based on the speed or the length, depending on the set up. For example, with an initial length of 15 mm and a desired post-spin draw ratio of 3x, the final length should be 45 mm. This can also be calculated as powering the linear actuator for 20 seconds at a rate of 1.5 mm/sec.\nOnce the desired post spin draw is complete, slowly raise the spool out of the isopropanol. Allow the droplets of isopropanol to dry for 1 minute, and then collect samples (Fig. 7B). Samples should be mounted on cardstock or foil frames for testing purposes.",
    "If further post spin draw ratios are desired, lower the spool back into the 75% isopropanol bath. Allow the fibers to equilibrate for 10 minutes, and then proceed to the next post spin draw ratio.\n8. Tensile Testing\nAllow the collected samples to equilibrate to the standard lab environment for at least 1 hour before mechanical testing. The humidity and temperature should be recorded as they may affect the fiber's mechanical properties. Standard humidity and temperature conditions should be approximately 40% and 25 °C, respectively.\nGlue the edges of the cardstock or foil to secure the fiber on the frame. Take note of the size of the opening of the frame. This is the initial length of your tested fiber. A 1 inch (25.4 mm) opening frame is shown here (Fig. 8A).\nUsing a light microscope with a 100x or greater magnification, take diameter measurements along the longitudinal fiber axis. At least 3 measurements should be recorded. The higher the magnification used and the more measurements taken, the better the accuracy.\nSecure the frame to a tensometer mechanical loading frame (Fig. 8B). Cut the frame on both sides so the tension is only running through the fiber. Tare the tensometer and collect the data. A standard strain rate of 2% per second is recommended.\nUsing the data collected and the average diameter, a stress strain curve can be plotted.\nThe broken fiber can now be mounted on a scanning electron microscope (SEM) stub for morphological analyses and break point diameter measurements. The fiber segment away from the break point can be used to estimate and check the initial diameter measured by the light microscope.\n9. Representative Results",
    "From step 3, the different fractions should be analyzed by SDS-PAGE analysis and the proteins visualized with silver or Coomassie Brilliant Blue R-250. From a standard Ni-NTA column conditions, elution fractions with >90% purity can be obtained (Fig. 9). Small contaminating proteins can be further removed by extensive dialysis. Using 25 μL of spinning dope at 20% (w/v), at least 30 separate fiber samples can be collected from the continuous wound fiber on the spool (assumes an initial length of 13 mm is used). The mechanical properties can be analyzed by tensometer tests (Fig. 10). Depending on the recombinant silk protein used for the spinning process, the maximum post spin draw ratios will need to be empirically determined. In general, post spin draw ratios of 4.0x can be achieved without fiber failure (Fig. 10). Spun fibers, before or after post spin draw, can be analyzed with a scanning electron microscope to visualize the ultrastructure (Fig. 11A,B). Spun fibers can also be used for mechanical testing, displaying results that with low variation within a post spin draw ratio sample group (Fig. 10).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig1.jpg\nFigure 1. Expression of the spider silk cDNA in bacteria. A) The pBAD TOPO/Thio vector containing the spider silk cDNA of interest is transformed into competent E. coli cells. B) A single colony is inoculated into 200 mL of LB and grown to saturation overnight. Following inoculation, 800 mL of fresh LB is added and the culture is induced for expression using arabinose. C) At the conclusion of induction, the culture is pelleted by centrifugation.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4191/4191fig1large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig2.jpg",
    "Figure 2. Lysis of bacterial cells after spider silk protein induction. A) Twenty milliliters of 1x lysis buffer and DNase is added to the cell pellet and placed on an orbital shaker and sonicated to lyse the cells. B) The cell lysate is spun in a centrifuge to clear the supernatant of cellular debris, and the supernatant is collected.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4191/4191fig2large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig3.jpg\nFigure 3. Purification of spider silk recombinant proteins using affinity chromatography. A) The cell lysate supernatant and Ni-NTA beads are added to a chromatography column and incubated for 1 hour. B) After the flowthrough is collected, 20 mL of wash buffer and 20 mL of elution buffer are used in sequence and collected in 5 mL fractions. C) The different fractions are analyzed by SDS-PAGE; the pure samples containing the target protein are transferred to a dialysis bag and dialyzed against DI water to completion.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4191/4191fig3large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig4.jpg\nFigure 4. Preparation of the purified spider silk protein for wet-spinning. A) The dialyzed product is transferred to pre-weighed centrifuge tubes in 1 mL aliquots. B) The 1 mL aliquots are flash frozen with liquid nitrogen. C) The frozen samples are lyophilized and more dialysis sample is added. D) Dried mass is calculated and HFIP is added to the dry powder to produce a 20% (w/v) spinning dope.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4191/4191fig4large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig5.jpg\nFigure 5. Loading of the spinning dope into the glass syringe for wet-spinning. A) While holding the syringe vertically, the spinning dope is pushed to the top of the syringe column, removing air bubbles. B) The loaded syringe is attached to the syringe pump and lowered into the 95% isopropanol bath so the tip is just breaking the surface of the bath.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig6.jpg",
    "Figure 6. Spooling of the synthetic spider silk fibers onto a custom reeling device. A) The spooling device is constructed from a digital caliper with attached metal combs. Double sided tape is applied to both sides of the comb to attach the fiber ends. B) The spool is attached to the slow speed motor using an alligator clip. C) The fiber is slowly pulled from the alcohol bath and wound around the spool. D) Glue is applied to the edge of each fiber segment to hold them in place. Shown are two different fibers spun from different proteins.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig7.jpg\nFigure 7. Post-spin draw of the synthetic fibers using a homemade apparatus. A) The spooling device is attached to the linear actuator setup using alligator clips. B) After a post spin draw step, the spool is lifted from the bath. Isopropanol droplets are allowed to evaporate before fiber collection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig8.jpg\nFigure 8. Mounting of the synthetic silk fibers onto a cardstock for mechanical studies. A) Collected fibers are mounted on cardstock frames with a 1\" x 1\" cutout. The fibers are initially held in place with double sided tape, and then fixed with glue. B) The cardstock frame is fixed onto a tensometer. The sides are then cut so the tension is only running though the fiber.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig9.jpg\nFigure 9. Size fractionation of purified recombinant MaSp1 protein fractions using SDS-PAGE analysis followed by visualization with silver staining. Protein ladder is depicted in kDa. The two wash samples show non-specific binding to the beads, while the elution samples reveal the need for 6 collections to ensure total protein recovery.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig10.jpg",
    "Figure 10. Stress strain curves of fibers spun from recombinant TuSp1 proteins.8 Colors show fibers that were subject to different post spin draw ratios, ranging from 2.5x to 6x. Fibers show low variation within their ratio group; as post spin draw ratios increase, the strength of the fiber is increased while extensibility is decreased.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4191/4191fig11.jpg\nFigure 11. Scanning electron microscopy images of fibers spun from recombinant TuSp1 proteins. A) At 500x magnification, the smooth external surface can be seen. B) At 5000x, the dense interior core can be observed from a natural break of fiber.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}