{
  "id": 3480,
  "origin_website": "Cell",
  "title": "Protocol for assessing translation in living Drosophila imaginal discs by O-propargyl-puromycin incorporation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissection, OPP incorporation, and fixation—Day 1\nTiming: 1‒1.5 h\nIn this step, the larvae are inverted to make the imaginal discs accessible to the labeling medium, which is supplemented with O-propargyl-puromycin (OPP). The labeling time is short (only 15 min), but sufficient to allow OPP incorporation into newly synthesized proteins. Following the OPP labeling, the Drosophila tissues are fixed.\nTo begin, transfer the flies to a fresh vial and allow them to lay eggs for one day. Depending on the genotype, proceed with the dissection of third instar larvae after 4–5 days which marks Day 1 of this Protocol.\nNote: The dissection time depends on the developmental growth of the flies. For example, Minute flies require more days (1‒2) to reach the same developmental stage compared to wild-type files.\nNote: During this period, it is possible to generate clones by utilizing heat shock inducible flippase and FRT recombination.\nDissection.\nCollect wandering third instar larvae of the desired genotype from the fly food and wash them twice with 1× PBS in a 9-well glass plate.\nNote: This is important to remove any excess of food particles that may be adhered to their cuticles and may interfere with the subsequent reactions.\nNote: 1× PBS is freshly prepared using a 10× PBS solution.\nTransfer the clean larvae (usually 20 in number) to a new well containing Schneider medium (∼500 μL) which is supplemented with 10% FBS serum (Schneider/FBS medium).\nNote: FBS is important to ensure that the larvae have the appropriate nutrients and growth factors to support survival and growth of the tissues during the protocol.\nUsing a pair of forceps dissect the larvae.",
    "Grab the mouth hooks of the larvae and with a microdissection spring scissors cut and remove the posterior one-third of the larvae (usually around 20 larvae).\nInvert dissected larvae using forceps.\nRemove quickly the largest portion of unrelated tissues (i.e., fat body, salivary glands, gut).\nNote: Complete this step within 10–15 min of initial dissection, at room temperature (RT, temperature range between 22°C and 25°C).\nNote: Practice may be required to invert the larvae fast enough. Untrained users can refer to published videos demonstrating dissections of wing and eye imaginal discs.5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6]\nOPP incorporation.\nRemove the medium used during dissection and add fresh Schneider/FBS medium supplemented with Component A.\nNote: The concentration of Component A is in the range of 10–20 μM, which corresponds to a dilution of 1:1,000‒1:2,000.\nGently shake the samples for 15 min at RT, at speed 100 rpm.\nCritical: OPP becomes covalently attached to the nascent amino acid chains and blocks further elongation. Longer incubation time should be avoided due to potential toxicity, and additionally since it will increase the dependence of the OPP signal on turnover rate of the truncated polypeptides. Differences in proteasome function between samples could then affect the signal as much as differences in translation rate.4[href=https://www.wicell.org#bib7],7[href=https://www.wicell.org#bib8]\nFixation.\nWash the samples once with 1× PBS and immediately proceed to sample fixation.\nNote: For sample fixation we use freshly prepared 4% Formaldehyde Solution (FA, Pierce, Cat #28908) diluted either in PEM buffer(100 mM Pipes, 1 mM EGTA, 1 mM MgCl2) or 1× PBS for 20 min at RT.\nCritical: Follow safety measures when handling formaldehyde, since it is highly toxic. Wearing gloves and working in a chemical fume hood are good safety practices to prevent accidents.\nPermeabilization and click-chemistry reaction—Day 1\nTiming: 1‒1.5 h\nPermeabilization and Click chemistry reaction.",
    "Wash the samples twice with 1× PT (1× PBS, 0.2% Triton X-100).\nWash with 0.5% Triton X-100 in 1×PBS for 10 min.\nNote: At this point, thaw the Click Components.\nBlock with 3% BSA in 1× PBS for 10 min.\nNote: While blocking with 3% BSA, prepare the Click reaction mix according to the proportions in the Materials section.\nNote: The mix should be used within 10 min.\nRemove the blocking solution and add 300–400 μL of Click reaction mix to each sample in the 9-well glass plate.\nIncubate the samples in the dark at RT, on a shaker, for 30 min.\nRemove reaction mix and wash once with the Rinse buffer (component F).\nWash with 3% BSA in PBS for 2 min.\nNote: If there are no primary antibodies, proceed to NuclearMask staining (step 8).\nBlocking and primary antibody incubation—Day 1\nTiming: 1‒1.5 h\nBlocking and Primary Antibody Incubation.\nBlock 1 h with PBT (1× PBS, 0.2% Triton X-100, 0.5% BSA).\nNote: Prepare primary antibody at proper dilution (e.g., mouse anti-b-gal mAb40-1a dilution used 1:100) in PBT\nIncubate in primary antibody overnight (12–16 h) on shaker (4°C–8°C).\nSecondary antibody incubation—Day 2\nTiming: 3–4 h\nSecondary Antibody Incubation.\nWash the samples thrice with PT (1× PBS + 0.2% Triton X-100), 5–10 min for each wash.\nAdd secondary antibody.\nNote: Depending on the Alexa Fluor dye of the Click reactions use the appropriate secondary antibody to avoid overlap with the OPP signal in the same channel. For example, if using 594 picolyl azide, the secondary antibody could be Alexa 488 conjugated. For 488 picolyl azide use 555 or 647 conjugated secondary antibody diluted in PBT.\nIncubate the samples on shaker for 2–3 h in the dark at RT.",
    "Wash the samples thrice with PT (1× PBS + 0.2% Triton X-100), 5–10 min for each wash.\nNuclearMask staining and mounting—Day 2\nTiming: 1–2 h\nAt this step we label nuclei using the NuclearMask component of the kit, before we proceed to sample mounting. It is important to include NuclearMask staining since OPP labeled proteins are released from ribosomes and localize to various subcellular compartments. Translational rates are determined by the signal intensity in the ring around or within the nucleus identified by NuclearMask.\nNuclearMask Staining.\nWash once with 1× PBS.\nAdd NuclearMask solution into the samples and incubate them for 30 min at RT in the dark on a shaker.\nNote: Dissolve NuclearMask solution (Component G) in 1× PBS (1:2,000)\nCritical: NuclearMask Blue Stain is a known mutagen and therefore appropriate precaution is required.\nMounting imaginal discs.\nDissect imaginal discs of interest (e.g., wings, eye) from the inverted larva body and mount them on slides by using VECTASHIELD mounting medium. Seal the edges of the coverslip with clear nail polish.\nNote: 14 μL is sufficient for 24 × 24 mm coverslips.\nProceed to imaging or store slides at 4°C or at ‒20°C (for longer periods) prior to imaging.\nImaging and analysis—Day 3\nTiming: 2–3 h\nImage the samples under a confocal microscope, using the appropriate channels.\nNote: Images were taken using 40× oil immersion objective.\nNote: The intensities of all the lasers and detectors were set to avoid excessive or weak signal. The Quick LUT feature in the Leica software was used to assess the intensity saturation and optimizing the settings for the image capturing.",
    "Save all images in the original format as well as any other format appropriate for subsequent analysis. For Image J quantification, .tif images of a single section were used. For details, check the “quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]” section below."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Model Organisms",
    "Developmental Biology",
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}