{
  "id": 10281,
  "origin_website": "Jove",
  "title": "Stepwise Cell Seeding on Tessellated Scaffolds to Study Sprouting Blood Vessels",
  "procedures": [
    "1. Tessellated scaffold fabrication\nNOTE: Photolithography is a widespread technique that requires specialized equipment typically housed within a nanofabrication facility/laboratory. The method laid out in this protocol was generalized as much as possible for the audience; however, slight changes to procedures may be necessary depending on equipment available to the reader. We recommend performing these procedures in a clean room at a nanofabrication facility to ensure the highest process quality. Before beginning, obtain access to a mask-aligner (or some UV-exposure set-up), a spin coater, hot plates, a solvent washing station, a photomask, and a plasma cleaner. The solvents and chemicals used in procedure are hazardous, so please take the upmost care to avoid any chemical exposure. When designing the photomask, identify what sized silicon wafers and photomasks are compatible with the spin-coater and mask-aligner. Additionally, the photoresist located toward edges of the silicon wafer is typically deformed from handling; hence, make the designs toward the center area of the wafer.\nPrepare scaffolds using a photolithography technique with the selected geometry of interest.\n\t\nBefore spin coating, clean the silicon wafer. This can be done with plasma cleaning or a solvent-based technique. If plasma cleaning, follow the standard operating procedure of the instrument for operational details. Spray with compressed nitrogen gas and inspect the wafer to ensure it is free of debris before spin-coating. This wafer will serve as the substrate upon which the scaffolds are created.\n\t\t​NOTE: For best results start with a fresh wafer. Wafers can be re-used but should be free of old photoresist, surface defects and debris. It is helpful to use wafer-tweezers for handling.",
    "Center a silicon wafer onto the spin-coater chuck using a guide. Briefly spin the wafer to ensure it has been properly centered on the chuck, adjust as necessary until properly centered. This must be done every time a wafer is placed on the spin-coater. Dispense 1-4 mL of the lift-off reagent onto the wafer (this will depend on the size of the wafer). Approximately 2 mL of lift-off reagent works well for a 4-inch wafer.\n\t\t\nSet spin-coater spread speed at 500 rpm for 5 seconds, and the spin-speed to 1000 rpm for 30 seconds, then spin the lift-off reagent. Inspect the wafer to ensure it has an even coating across the wafer. Any debris left on the wafer will be very obvious at this point. Any scaffolds in an area with debris will likely be unusable. After spin coating, transfer to a hot plate and bake for 1 minute at 200 °C.\nRepeat the previous step two more times for a total of three coatings.\nSpin-coat the lift-off reagent coated silicon wafer with SU-8 2050 photoresist until obtaining a thickness of approximately 100 µm.\n\t\t\nDispense 1 mL of resist for every 25 mm of substrate diameter.\n\t\t\t​NOTE: Be careful to avoid bubbles while pouring the resist. For SU-8 2050, pouring approximately a 2-inch diameter circle, when using a 4-inch silicon wafer works well.\nSpin-coat the SU-8 2050. Spread at a speed of 500 rpm for 5 seconds, followed by a spin speed between 1700 to 1800 rpm to achieve approximately 100 µm thickness.\nOptional: After spinning, leave the spin coated wafers to de-gas overnight on a level surface protected from light prior to the pre-bake. This may help to rid the resist of any bubbles and allow defects to level out.",
    "​NOTE: The actual thickness of the resist and the resultant scaffolds can vary with user error and equipment parameters. Therefore, the thickness of the scaffolds should be verified later, in step 1.6. Modify spin coating procedures accordingly to achieve the desired thickness.\nPrior to exposure, pre-bake the wafers at 65 °C for 10 min and then 95 °C for 40-50 min. Prior to exposure, test the surface of the resist by pressing on the edge with a pair of tweezers to ensure that it is no longer tacky/viscous. It is helpful to pull the wafer off of the hot plate and allow it to cool for a 0.5-1 min before assessing the tackiness.\n\t\tNOTE: Slow temperature ramp times (heating and cooling) may help to prevent warping of the scaffolds.\nExpose the photoresist to UV light (350-400 nm) through a photomask with an exposure energy of 215-240 mJ/cm2 for a resist thickness of 85 - 110 µm. Refer to photoresist manufacturer guidelines for recommended exposure energy-thickness correlations.\n\t\nEnsure that the exposure is properly calibrated such that the energy is verified. Adjust the exposure time as necessary to achieve desired exposure energy. Furthermore, mask aligners may allow for different exposure modes: vacuum contact, hard contact, soft contact, and proximity contact (specific terms may vary). Generally, these will impact resolution and feature alignment. The authors typically used a \"hard contact\" mode.\nFor small features or multiple layers, where alignment will matter, consider exposure modes and mask aligner procedures more carefully. Be sure to consider the height of the resist when adjusting the thickness value. Refer to the standard operating procedures of your mask-aligner for operation details.",
    "​NOTE: The design of the photomask will determine the scaffolds size, compartment geometry, and number of scaffolds obtained per batch. The use of a hard glass or quartz photomask will yield the highest resolution; however, a soft polymer transparent film photomask generally can be used for these large feature sizes (>10 µm). The use of a film-photomask may lead to topographical features along the z-axis of the scaffold pores as a result of poorer feature resolution. This could potentially have an influence on cell behavior. Verify the desired resolution consult with whomever is producing the photomask to ensure the desired resolution is achieved.\nBake the wafer immediately after UV exposure at 65 °C for 2-5 minutes and then at 95 °C for 8-10 minutes.\nDevelop the scaffolds to remove undeveloped resist.\n\t\nImmerse the scaffolds using a low volume of SU-8 developer solution for 7-10 minutes to dissolve any undeveloped resist.\nRinse with isopropyl alcohol (IPA).\nDry wafer with compressed nitrogen.\n\t\tNOTE: Be careful during step 1.4 to not cause premature release of the scaffolds. Low volumes of developer and gentle handling are necessary to achieve this.\nFollowing development, hard bake the wafers at 150 °C for 15 min.\n\tNOTE: After hard bake, turning off the hotplate to allow the wafers to cool very slowly may be advantageous in preventing warping/curling of the final scaffolds.\nOptional: Following the hard bake and prior to lift-off, assess scaffold thickness since the scaffolds should still be gently adhered to the surface of the wafer. For this procedure, contact profilometry works well; however, any appropriate method could be employed.\nLift the scaffolds off the wafer.\n\t\nSubmerge the scaffolds in SU-8 developer to cause them to immediately lift off the wafer. If scaffolds do not lift off, gently push the scaffolds with a pair of wafer-tweezers.",
    "Remove excess developer.\nTransfer the scaffolds into new container and submerge in isopropyl alcohol. Rinse in IPA for a minimum of 6 times to ensure all developer has been removed.\nAir dry the scaffolds for a minimum of a week before use.\n2. Scaffold fibronectin coating\nFor disinfection, submerge the scaffolds in 70% ethanol (v/v) for a minimum of 15 minutes, and wash 2 times in phosphate buffered saline (PBS) before use.\n\t​CAUTION: The SU-8 scaffolds are frail and can break easily. Handling is recommended using blunt and curved-tip forceps, and they should be handled with upmost care. Easier handling can be achieved by submerging the scaffolds in liquid, to avoid electrostatic interactions between the scaffolds and the surface.\nPrepare a dilution of 50 µg/mL of human fibronectin in PBS and cover the scaffolds by protein adsorption.\n\t\nMix 1.5 µL of fibronectin stock solution (1 mg/mL) with 28.5 µL of PBS per each scaffold to be seeded. Preferably, prepare only one fibronectin dilution to be used for all scaffolds to avoid pipetting errors.\n\t\t\nFor 10 scaffolds, mix 15 µL of stock fibronectin solution in 285 µL of PBS, amounting to a total of 300 µL of 50 µg/mL fibronectin dilution.\nPlace the scaffolds sparsely on top of a hydrophobic surface (i.e., non-tissue culture (nonTC) 10 cm dish) and cover each scaffold with 30 µL of the fibronectin dilution prepared in step 2.2.1.\n\t\t​CAUTION: Make sure that no bubbles are trapped in the scaffold compartments. If bubbles are present, they can be removed by gently shaking the scaffold within the droplet or light pipetting.\nReplace the plate's lid and place the fibronectin-covered scaffolds into an incubator with 37 °C and 100% humidity for a minimum of an hour.",
    "After incubation, lightly rinse the scaffolds in PBS to remove fibronectin remnants. The scaffolds can be kept in PBS at 4 °C for up to a week before use.\n3. Endothelial cells seeding\nPrepare EC medium by mixing the basal medium with its correspondent medium kit components, including an antibiotic solution (Pen/Strep), fetal bovine serum (FBS), and endothelial cell growth supplements, as indicated by the manufacturer.\nMake a human adipose microvascular endothelial cell (HAMEC) suspension in EC medium with a concentration of 4 x 106 cells/mL.\n\tNOTE: Real time imaging can be performed if the used endothelial cells are previously transfected to express a fluorescent protein, or pre-stained using a non-toxic cytoplasmic membrane dye (furtherly referred as labeled ECs).\nUsing forceps, place one fibronectin-coated scaffold per well on a nonTC 24-well plate well.\nCover each scaffold with 25 µL droplets of the HAMEC suspension. Beware not to let the suspension flow away from the scaffold, since it can hinder cell adhesion.\nPut the lid on the plate and place it in an incubator at 37 °C, 5% CO2 and 100% humidity. Let incubate for a minimum of 60 minutes and a maximum of 90 minutes.\n\tNOTE: During incubation, placing the plate on an orbital shaker within the incubator improves cell attachment onto the scaffold's walls. The orbital shaker should be set at no more than 5 rpm.\nAfter incubation, fill each well with 700 µL of EC medium using a pipette.\n\tNOTE: Expect to see ECs at the bottom of the well, since some of the cells do not attach to the scaffold and fall through the scaffold's voids.",
    "Incubate the endothelialized scaffolds until EC confluence can be observed using fluorescent microscopy on the scaffold's walls (when using labeled ECs), or for 3 days (when using non-labeled ECs), which provides enough time to achieve EC confluence. Change the medium every other day.\n4. Support cell seeding and co-culture\nPrepare dental pulp stem cell (DPSC) medium (DPSCm) by mixing 500 mL of low-glucose Dulbecco's modified Eagle medium (low-glucose DMEM), 57.5 mL of FBS, 5.75 mL of non-essential amino acids (NEAA), 5.75 mL of GlutaMAX, and 5.75 mL of penicillin-streptomycin-nystatin solution.\nTransfer the endothelialized scaffolds into a new nonTC 24-well plate to discard ECs attached to the wells' bottom using forceps.\n\t\nDiscard all media from the current plate using a 1 mL pipette, or vacuum suction. Be careful not to apply vacuum straight on the scaffold.\nPlace one scaffold per well, preferably at the center of the well to avoid running liquid toward the walls due to surface tension effects. Dry the area surrounding the scaffold with light vacuum but avoid complete drying of the scaffold.\nPrepare a DPSC suspension in fibrin pre-gel solution.\n\t\nDilute thrombin and fibrinogen stock solutions with PBS until obtaining a final concentration of 5 U/mL and 15 mg/mL, respectively.\nPrepare an 8 x 106 DPSC/mL suspension in the 5 U/mL thrombin dilution and distribute in individual eppendorfs 12.5 µL of said suspension per scaffold to be seeded.\nSet a 5-50 µL pipette (or similar) to 12.5 µL and fill it with the 15 mg/mL fibrinogen solution.\nWithout removing the tip, set the pipette to 25 µL. The material in the tip should rise and leave an empty volume towards the tip opening.",
    "Slowly press the plunger button until the liquid reaches the tip opening but does not leak out. Hold the plunger in this position and put the tip into one of the microcentrifuge tubes containing the cells in thrombin suspension, making sure the tip is in contact with the liquid.\n\t\t​CAUTION: The fibrin crosslinking will begin immediately after the thrombin and fibrinogen come into contact. The following step should be done quickly.\nGently release the plunger button and draw the cell suspension into the tip. Thoroughly mix both materials, avoiding bubble formation.\nQuickly dispense the mixed materials on top of an endothelialized scaffold. Repeat the previous steps for each scaffold, making sure to always change tips between uses to avoid unexpected fibrin gel formation within the tip.\nReplace the plate lid and incubate the scaffolds at 37 °C, 5% CO2 and 100% humidity for 30 minutes.\nAfter incubation, fill each well with 1 mL of 1:1 DPSC and EC medium.\n\t\nCulture for 1 week, changing medium every other day.\nDuring culture, remove the medium from the well and image the constructs using a confocal microscope at different time points to study the vascular development or any other parameter of interest.\n\t\t​NOTE: This step can only be performed if the experiment is performed using labeled ECs. See Step 6 - NOTE for further clarification.\n5. Immunofluorescent staining for characteristic vascular markers\nNOTE: The following steps can be performed in the same wells where the constructs were cultured. It is critical to always make sure that the solutions completely cover the scaffolds. Moreover, when possible, performing the steps on an orbital shaker is recommended, although not mandatory.\nAt day 7, discard the media from the wells and rinse the scaffolds by adding PBS to the wells, and removing it using vacuum.",
    "Fix the scaffolds by adding 4% paraformaldehyde for 20 minutes. Wash in PBS 3 times, 5 minutes per wash.\nPermeabilize the fixed cells using 0.3% Triton-X in PBS (v/v) for 15 minutes. Wash in PBS 3 times, 5 minutes per wash.\nPrepare a 5% bovine serum albumin (BSA) in PBS (w/v) blocking solution and cover the scaffolds. Leave at room temperature for 1 hour.\n\t​NOTE: All the required solution amounts will depend on the number of scaffolds to be stained. Prepare the solutions as needed keeping the stated concentrations.\nPrepare and apply the primary antibodies staining solution .\n\t\nDilute rabbit anti-von Willebrand factor (vWF) antibody 1:150 and mouse anti-SMA antibody 1:50 in fresh blocking solution.\n\t\tNOTE: Other endothelial cells markers, such as CD31 or VE-Cadherin can be used.\nCover the scaffolds with the primary antibodies solution and keep at 4 °C overnight. Wash in PBS three times, 5 minutes per wash.\nPrepare and apply the secondary antibodies staining solution.\n\t\nDilute goat anti-mouse Cy3 antibody 1:150 and goat anti-rabbit Alexa-Fluor 488 1:400 in PBS.\nCover the scaffolds with the secondary antibodies solution and incubate for a minimum of 3 hours at room temperature, or at 4 °C overnight. Wash 3 times in PBS, 5 minutes per wash. Keep stained scaffold in 0.3% PFA in PBS (v/v) for up to a month.\n6. Scaffold confocal imaging and vessel development analysis\nNOTE: The following steps can be performed on the fixed and stained scaffolds at the chosen final time point or, if fluorescent cells were used, during the cell culture period without the need to terminate the experiment. For the latter, it is recommended to set specific time points; this work shows day 0 (before SCs seeding), and days 1, 3, 5 and 7 after SCs seeding (Figure 3A).",
    "Image the scaffolds using a confocal microscope with a 5X lens and a zoom of 0.5 and the full z range of the scaffold. This will allow to capture 9 separate compartments for the squared and circular geometries, or 8 full compartments for the hexagonal geometry. Image the fluorescent signal and the transmitted light, to get both the vessel network structure and the compartment geometry (Figure 3A).\nUsing ImageJ (or any other image processing software), crop each individual compartment; for this process, only the vascular networks markers are relevant. Remove any vessel not located inside the compartment area. Create a maximum intensity projection and save each individual cropped compartment as a TIFF image.\n\t\nIn ImageJ, press File > Open and select the desired TIFF image containing several compartments. The image should have at least two channels, the fluorescent vessel network, and the transmitted light image.\nFrom the toolbar, select the Polygon selection tool. Select the transmitted light channel. Click on one of the corners of the hexagonal compartment, at the interface between the compartment area and the scaffold wall, this will start the mask definition. Continue clicking on the next corners in a sequential order until the initial corner is selected, closing the mask.\n\t\tNOTE: This explanation applies to a hexagonal compartment. When the compartment is either squared or circular, use the Rectangle or Oval tools, respectively, to create an appropriate mask. Regardless the shape, always fit the mask to follow the inner wall of the scaffold.\nClick on Analyze > Tools > ROI manager. In the ROI manager (ROI, region of interest), click the Add button to save the created mask. The new mask will show up in the left side list. This step allows the analysis to be consistent between different images.",
    "​NOTE: In the ROI manager, it is possible to save a file with all the created masks by clicking on More > Save. In the Save selection window, choose a name and location, and save the .roi file. To retrieve the mask, in the ROI manager, click on More > Open and choose the desired .roi file.\nSelect the fluorescent vessel network image and click on Edit > Clear outside. Only the image contained in the mask will remain, while the rest will be eliminated.\nWith the cleared network image open, click on Image > Duplicate. In the Duplicate pop-up window, write the name of the image. If the Duplicate hyperstack is selected, unselect it and click OK. A new image containing only the cropped fluorescent vessel networks will be created.\nSave the cropped image by clicking on File > Save as > Tiff. Choose the name and directory and click OK.\nAnalyze the vascular development on the cropped images.\n\t\nDownload and install the analytical free software AngioTool, which provides quantitative tools to quantify a variety of vascular parameters. The software can be obtained from the following address https://ccrod.cancer.gov/confluence/display/ROB2/Home.\nSet the scale value of the images to obtain results in millimeter units and load an image.\n\t\t\nClick on the Setting tab and fill the Distance in pixels and Distance in mm with representative values from the taken images. Using the imaging parameters mentioned above, the values to fill are 400 pixels per 1 mm.\nPress the Open image button and browse for the image of interest.\nChoose the analysis parameters to quantify vessel development in the Analysis tab.\n\t\t\nUnder the Vessel diameter and intensity field, deselect any present marker from the top range selector, and activate the marker representing the number 3.",
    "Under the Vessel diameter and intensity field, on the bottom range selector, move the lower range marker to 60, and leave the high ranger maker at 255.\nActivate the Remove small particles box and set the marker to 100.\nUnder the field Saving preferences, select the name and location of the spread sheet file in which the results will be saved and press the Run analysis button. If the Save result image box is selected, Angiotool will generate and save a new jpeg image showing the vessel network quantified parameters.\n\t\t\t​NOTE: For each performed analysis without changing the spread sheet file name, a new row will be added at the bottom of the file, with the newly acquired results.\nOrganize the data and run a statistical analysis.\n\t\nFor all the processed images, choose the parameter of interest from the spread sheet (e.g. Total vessel length and Vessel area) and input them into a statistical analysis software to properly study the obtained results (Figure 3C).\n7. Time lapse imaging for sprouting origin detection and migration tracking\nAlternatively, to culturing the scaffolds in the incubator as described in step 4.6, set a confocal microscope culture chamber to 37 °C, 5% CO2 and 100% humidity.\n\t\nPut the plate containing the fully seeded scaffolds in the confocal microscope chamber and set the imaging parameters to the desired values.\nSet the image taking interval to 30 minutes, and the total imaging time of 72 hours. This will enable to run the time lapse completely without the need for a medium change.\n\t\tCAUTION: In case a longer time lapse imaging is desired, a careful position calibration should be performed to be able to retrieve the original imaging location, since medium changes require removing the plate from the confocal incubator and into the sterile biological hood.",
    "NOTE: ECs detachment from the scaffold walls and tubular structures formation will start within the first hour after SCs seeding (step 4) and may take up to 50 hours to complete. After initial tube formation, new sprouts will start migrating into the compartment from the surrounding vessels. Sprouting and subsequent network remodeling will continue throughout the experiment approximately until day 10, when the vessel networks become stable22. Use this information to choose the time lapse starting point and time step accordingly.\nSave the complete time lapse movie file as a TIFF sequence.\nOpen ImageJ and click File > Import > Image sequence and select your files. This will open your TIFF sequence as a movie.\nOpen the Manual Tracking plugin by clicking on Plugins > Manual Tracking. This will open the Tracking window.\nObserve the movie and select the vessel to be tracked. Pay attention to its origin and migration.\nActivate the Show parameters box and input the 30 minutes for Time interval. The x/y calibration will depend on the pixel amount selected during imaging.\nProceed to manually track the sprouting vessels from the scaffold contour.\n\t\nPress the Add track button. On the movie's first frame, press the location of the vessel to be tracked. After this, the movie will change to the next frame automatically.\nClick on the image of the second frame where the vessel is located. Again, the movie will change to the next frame automatically.\nProceed with the same vessel until the full migration tracking has been completed.\nOn the Tracking window, click on the Overlay Dots & Lines to imprint a visual path of the vessel migration on the movie. This will open a copy of the movie with a dot representing the current position of the tracker, and a line showing the previous path.",
    "Click on the End Track button to finalize recording the current vessel movement.\nClick on the Add track button again to start over with a new vessel. When doing this, the line and dot markers will automatically change their color for the new vessel. Repeat until all desired vessels are tracked.\n\t\tNOTE: The x/y location, vessel velocity and moved distance can be retrieved from the pop-up window Results. Each vessel will be identified by its track number in the leftmost column. This data can be copied and pasted into a spread sheet to perform further analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}