{
  "id": 19078,
  "origin_website": "Jove",
  "title": "Intraductal Injection of LPS as a Mouse Model of Mastitis: Signaling Visualized via an NF-κB Reporter Transgenic",
  "procedures": [
    "All animal experiments were approved by the Vanderbilt University Institutional Animal Care and Use Committee.\n1. Preparing Transgenic Mice\nFemale mice, positive for the NGL (NF-κB-GFP-Luciferase) reporter transgene (described previously1) are used for this procedure. When females are at least 6 weeks of age, mate them with an FVB wild type male. Harem breeding may be used (up to 4 females in a cage with 1 male). (Please note: FVB strain mice were used for the current study. Darker strain mice such as C57Bl6 may also be used, but these mice must be shaved prior to imaging).\nStarting at 15 days post-mating, check the females regularly for signs of pregnancy (large protruding girth). Each female must be separated once pregnant and the male removed from the breeding cage once the last female becomes pregnant.\nWatch the separated females and note the date of birth when a litter appears. A litter of at least 6 pups is required for adequate lactation. Eight days after the birth of the litter, proceed with the protocol (see Figure 1 for a timeline schematic).\n2. Preparation for Injection\nDissolve the E. coli LPS in PBS to a final concentration of 0.1 μg/μl. 50 μl of this solution, or a total of 5 μg, will be injected into the mammary gland. Prepare a second tube of PBS alone to be used for control injection.\nSet-up a dissecting scope and isoflurane anesthesia equipment. A nose-cone apparatus should be secured to the stage of the dissecting scope where the mouse will be placed. A good light source, whether from the scope itself or from extra spotlights should also be prepared.\nOnce the set-up is complete, start the isoflurane machine and air flow.\n3. Intraductal Injection of LPS",
    "Load the short needle syringe with 50 μl of the LPS solution. Set this aside.\nAnesthetize the mouse to be injected by first placing the female into an isoflurane filled box and then once breathing is slowed, move her onto the stage and place her nose within the nose-cone. Use a toe pinch to confirm the mouse is fully anesthetized. Monitor the mouse's breathing throughout the procedure and adjust the isoflurane level accordingly. The cage containing the litter of pups that the female has been taken from should be carefully set aside until the dam can be returned after the procedure.\nUse a small drop of 70% ethanol to make the coat lay flat and to help visualize the nipple attached to the right #4 inguinal mammary gland on the mouse's lower abdomen.\nFocus the dissecting scope for an optimal view of the nipple. Carefully use a set of fine forceps to further draw out the nipple away from the skin, but do not puncture or injure the nipple in any way. The forceps should never be tightly clamped together when manipulating the tissue, but used with a light hold which requires the minimal amount of stress on the nipple.\nUse the forceps in the left hand to gently hold the nipple in place. Slowly bring the preloaded syringe into the field of view using the right hand. The syringe should be held so that no repositioning has to occur in order to inject the contents.\nOnce the syringe is in view, aim carefully at the small ductal opening within the center of the nipple, and insert the syringe.\nWithout repositioning the hand, inject the contents of the syringe and remove the needle from the nipple.",
    "Load a second syringe with 50 μl of PBS for the control injection. Reposition the mouse on the stage and for the best view of the left #4 inguinal mammary gland nipple on the other side of the mouse's lower abdomen. Repeat steps 3.4 to 3.7 using the PBS-loaded syringe.\nOnce both injections are complete, discontinue anesthesia and move the mouse to a recovery cage. Monitor the female to insure that she becomes mobile within 5 min. Allow the mouse to remain in the recovery cage for 1 hr. After 1 hr of recovery, place the female back into the cage with her litter of pups. Mice should be periodically monitored for 6 hr post injection before proceeding to imaging. In our experience, no adverse consequences were noted in either the female or the pups during the period between injection and imaging. However, if signs of distress are observed in the female (e.g. hunched posture, biting or guarding of the injection site, general lethargy) or the pups (no movement, bluish color of skin) the experiment should be discontinued.\n4. Bioluminescent Imaging to Visualize NF-κB Activity\nOnce mice have been transported to the imaging facility, begin the imaging procedure by opening the software and initializing the machine. Turn on the isoflurane machine and air flow, ensuring that the anesthesia is flowing to both the box and the imaging chamber.\nPlace the mouse under isoflurane anesthesia in the clear anesthesia box. Once breathing has slowed, use a toe pinch to confirm the mouse is fully anesthetized. Then, inject 100 μl of luciferin substrate into the mouse by retro-orbital injection5 using a sterile syringe.",
    "Immediately transfer the mouse to the imaging chamber and place her nose under the isoflurane nose-cone located there. The mouse should be supine. Secure each foot to the stage with tape.\nInput the appropriate settings to the IVIS software to take both a white light photographic image and an image of the bioluminescent activity. The exposure time should be 10 sec. Acquire the image.\nOnce images have been acquired, allow the mouse to recover and then place her back in the cage with her pups and monitor periodically.\nThe photographic and luminescent images are automatically overlaid and displayed on the screen, as in Figure 2. Analyze the acquired images by placing region of interest or \"ROI\" circles of equal size over each side of the mouse's lower abdomen (one over the PBS-injected gland and one over the LPS-injected gland). Set the read-out to photons. A number should be displayed indicating the luminescence detected within each ROI (see Figure 2B). Use this number in statistical analysis.\nTo display the optimum image, further adjust the threshold of signal displayed. This will not alter the total luminescence read-out but will allow you to remove background signal and visualize the differences between the control and LPS-treated gland. Decrease the amount of luminescence shown until the PBS-injected gland is free of background signal. This should leave the increased signal in the LPS-treated gland still apparent in the image, as seen in Figure 2.\nAdditional analysis, including protein and RNA assays, can be completed with mammary tissue collected from the female post-mortem6.\n5. Representative Results",
    "To obtain interpretable results from these methods, LPS (or PBS) must be infused only into the mammary ducts, leaving the adjacent tissue undisturbed. Injection into the subcutaneous tissue surrounding the nipple will result in inflammation due to injury rather than the simulated infection. Injection of trypan blue dye diluted in PBS is helpful when learning the technique. Figure 3A shows a successfully injected gland infused with 100 μl of trypan blue in PBS. As shown, only the ductal tree should be filled with the injected solution, and there should be no bolus at the injection site. A \"bolus\" in this context is a build up of the injected liquid at the nipple or in the tissue surrounding the nipple without infusion into the ductal tree. This is shown in Figure 3B. Please note that the practice injections shown in Figure 3 were completed in a female at day 21 of lactation. During the height of lactation (day 8-10, the stage at which LPS is injected using the current protocol), milk is abundant and it is difficult to visualize the ducts and determine if the injection has been completed correctly. Therefore, later time points in lactation are better for practice injections.",
    "Successful injection of LPS into the mammary ducts results in increased NF-κB activity within the gland. This should be evident in the reporter mouse upon IVIS imaging, and the LPS-injected gland should have substantially higher luciferase activity (measured by photon count) than the PBS-injected gland, as shown in Figure 2 (on average, the LPS gland reads 200% of the PBS control signal). A statistically significant increase in luminescence within the LPS-treated glands as compared to the contralateral control was achieved though the completion of a group of 4 mice 4. One additional study has also utilized intraductal mammary injection of either E. coli or LPS into NF-κB reporter transgenics. Similar to our own work, these authors saw a significant increase in reporter activity 6 hr after E. coli injection2.\nPlease note, due to constitutive NF-κB activity in the brain and other abdominal organs, the heads and abdomens of our reporter mice consistently show a signal when imaged, even at baseline prior to any manipulation. Thus, this signal should be ignored with regard to this experiment. An obvious signal should remain within the LPS-injected mammary gland after the image read-out is adjusted to minimize background luminescence in the PBS gland. Figure 2 shows images with the background reduced.\nUnsuccessful injection of the gland will most likely result in damage to the nipple. This will cause pointed, skin-level inflammation that will be evident upon imaging. This type of wounding signal will be very strong and confined to the nipple area where the damage occurred, not emanating throughout the gland, as seen after a successful LPS injection into the ducts.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4030/4030fig1.jpg\n Figure 1. Schematic of Procedure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4030/4030fig2.jpg",
    "Figure 2. Representative results from IVIS bioluminescent imaging. (A) Acquired image with background reduced, revealing increased luciferase activity in the LPS-injected gland. (B) Image from A with region of interest quantifications added.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/4030/4030fig2large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4030/4030fig3.jpg\n Figure 3. Practice injection: mammary gland injected with dye via intraductal injection. To test the accuracy of delivery via the nipple, a mouse at day 21 of lactation was injected with 100 μl of trypan blue dye diluted in PBS. Following sacrifice, the gland was exposed for visualization. (A) successful injection and (B) bolus of dye at the nipple.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}