{
  "id": 1988,
  "origin_website": "Cell",
  "title": "Analysis of the pheromone signaling pathway by RT-qPCR in the budding yeast Saccharomyces cerevisiae",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nYeast cell culture and pheromone treatment\nTiming: Day 1, 12–16 h to grow cells until day 2; Day 2, 4 h until sample collection\nThe different yeast strains are cultured in three biologically independent replicates and incubated in the presence or absence of α-factor to activate or not the pheromone signaling pathway.\nInoculate an individual yeast colony from an YPD agar plate in 3 mL of YPD medium in a 15 mL tube and incubate at 30°C while shaking at 200 rpm for 12–16 h.\nAfter 12–16 h, dilute 2 mL of the culture (expect a starting OD600 of approximately 10) into 18 mL of fresh YPD medium (1/10 dilution) in a 100 mL Erlenmeyer flask and incubate at 30°C while shaking at 200 rpm for 2 h (expect a final OD600 of approximately 2). Problem 1[href=https://www.wicell.org#sec6.1]\nSplit the yeast culture into two 50 mL Erlenmeyer flask (10 mL of yeast cell culture each):\nAdd 150 μL of α-factor (1 mg/mL) to one of the yeast cultures (final concentration 15 μg/mL).\nThe other culture remains untreated.\nThe incubation continues at 30°C while shaking at 200 rpm for 2 h for both treated and untreated cells.\nAfter 2 h of incubation, monitor shmoo formation by differential interference contrast microscopy (Figure 1[href=https://www.wicell.org#fig1]). Problem 2[href=https://www.wicell.org#sec6.3]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1470-Fig1.jpg\nFigure 1. Differential interference contrast images of representative wild-type (WT) cells in absence (top) or presence (bottom) of α-factor\nIn the lower panel, α-factor has triggered shmoo formation. Scale bar, 5 μM. Adapted from our recently published work (Garcia et al., 2021[href=https://www.wicell.org#bib4]) (CC BY 4.0. No changes to the figure were made).\nNote: Shmoo formation is a change of cell morphology that is triggered by the activation of the pheromone signaling pathway.",
    "Critical: Work under sterile conditions. Thaw and maintain α-factor on ice until use. Proceed with step 6 only when shmoo formation has been observed for WT cells. Problem 2[href=https://www.wicell.org#sec6.3]\nHarvest yeast cells:\nCentrifuge a volume corresponding to 5 OD600 units 5 min at 3000×g.\nRemove supernatant, resuspend the cells using 1 mL of ice-cold sterile mqH2O and transfer to a new 1.5 mL microcentrifuge tube.\nCentrifuge 1 min at 15,000×g.\nRemove supernatant, snap freeze the microcentrifuge tube in liquid nitrogen and store at –80°C.\nCritical: Step 6c, remove any remaining supernatant before snap freezing.\nPause point: Harvested cell pellets can be stored at –80°C for 1 month before proceeding to the purification of total RNA.\nPurification of total RNA\nTiming: 1 h\nRNA purification using adapted steps from the manufacturer’s protocol of RNeasy Mini Kit (RNeasy Mini Handbook - (EN) - QIAGEN[href=https://www.qiagen.com/us/resources/resourcedetail?id=14e7cf6e-521a-4cf7-8cbc-bf9f6fa33e24&lang=en])\nCritical: An appropriate safety protocol has to be followed while handling the RLT and RW1 buffers from the RNeasy Mini Kit: both contain guanidine thiocyanate and β-ME that needs to be added to RLT buffer before use. Wear lab coat, goggles, gloves and use RNase-free filter tips (those will also minimize the risk of RNA degradation). Work under a fume hood to prevent harmful inhalations and use suitable waste containers.\nPrepare yeast lysate by mechanical disruption:\nAdd 600 μL of RLT buffer (containing 10 μL of β-M per 1 mL of buffer) to the cell pellets on ice and resuspend by pipetting.\nTransfer the content of the tube to an autoclaved and ice-chilled 2 mL screw-cap-tube already containing 600 μL of acid-washed glass beads.\nCarefully secure the lid of the tubes and lyse cells at 4°C for 10 min at max speed on a bead mill (Digital Disruptor Genie Vortex, Scientific Industries).",
    "Critical: β-ME must be added to RLT buffer under a chemical fume hood before use (10 μL β-ME per 1 mL of RLT buffer). The mixture can be stored at RT for up to 1 month. After the mechanical disruption of the cell walls, the following steps in the purification of total RNA are performed at RT.\nNote: QIAGEN recommends not processing more than ∼5 × 107 cells. Then, the above mentioned 5 OD600 units harvested as starting material (step 6) may be adjusted depending on the yeast strain background and the spectrophotometer used.\nOptional: enzymatic lysis methods using zymolyase or lyticase digestion can be used instead of the mechanical disruption of cell walls (RNeasy Mini Handbook - (EN) - QIAGEN[href=https://www.qiagen.com/us/resources/resourcedetail?id=14e7cf6e-521a-4cf7-8cbc-bf9f6fa33e24&lang=en]).\nTransfer the lysate (usually 350 μL) to a new microcentrifuge tube.\nCentrifuge 2 min at ≥ 9000×g and transfer the supernatant to a new microcentrifuge tube.\nAdd 1 volume of 70% ethanol.\nMix by pipetting (do not centrifuge) and proceed to step 12.\nNote: Precipitates may be visible after addition of ethanol.\nTransfer the sample (max 700 μL) including any precipitate that may have formed, to an RNeasy spin column placed in a 2 mL collection tube.\nCentrifuge 15 s at ≥9000×g and discard the flow-through.\nNote: If the sample volume exceeds 700 μL, centrifuge successive aliquots in the same column.\nAdd 700 μL of RW1 buffer to the RNeasy spin column.\nCentrifuge 15 s at ≥9000×g to wash the spin column membrane and discard the flow-through.\nNote: After centrifugation, carefully remove the RNeasy spin column from the collection tube so that the column does not contact the flow-through. Be sure to empty the collection tube completely.\nAdd 500 μL of RPE buffer to the RNeasy spin column.",
    "Note: RPE buffer is supplied as a concentrate. Before using for the first time, add 4 volumes of ethanol (96%–100%) to obtain a working solution.\nCentrifuge 15 s at ≥9000×g to wash the spin column membrane and discard the flow-through.\nAdd 500 μL of RPE buffer to the RNeasy spin column.\nCentrifuge 2 min at ≥9000×g and discard the flow-through.\nNote: The longer centrifugation time in in step 19 allows drying the spin column membrane, ensuring that no ethanol is carried over during RNA elution. After centrifugation, carefully remove the RNeasy spin column from the collection tube so that the column does not contact the flow-through.\nDiscard the collection tube and place the RNeasy spin column in a 1.5 mL RNAse-free collection tube.\nAdd 30–50 μL RNAse-free water directly to the spin column membrane, incubate 1 min and centrifuge 1 min at ≥9000×g to elute the RNA.\nDiscard the spin column and place immediately the collection tube on ice and proceed with cDNA synthesis. Problem 3[href=https://www.wicell.org#sec6.5]\nPause point: Purified RNAs can be stored at –80°C for months. However, it is strongly recommended to immediately proceed to cDNA synthesis to minimize the risk of RNA degradation due to freeze-thaw cycles.\ncDNA synthesis (reverse transcription)\nTiming: 30–45 min\nReverse transcription was performed using the QuantiTect Reverse Transcription Kit according to manufacturer’s instructions ((EN) - QuantiTect Reverse Transcription Handbook - QIAGEN[href=https://www.qiagen.com/us/resources/resourcedetail?id=f0de5533-3dd1-4835-8820-1f5c088dd800&lang=en]).\nCritical: Set up all reactions and samples on ice to minimize the risk of RNA degradation. Continue using lab coat, gloves and RNase-free filter tips.\nQuantify RNAs using a NanoDrop spectrophotometer.\nPrepare the genomic DNA elimination reaction on ice using volumes as listed below.\ntable:files/protocols_protocol_1470_3.csv",
    "Critical: Consider dilute the RNAs with RNAse-free water to stay within the range of 500 ng of RNA between a maximum volume of 12 μL and, to avoid pipetting error, a minimum volume of 1 μL.\nNote: This protocol uses 500 ng of RNA, however, QuantiTect Reverse Transcription Kit protocol works with amounts of template RNA ranging from 10 pg to 1 μg.\nIncubate 5 min at 42°C and place immediately on ice.\nCritical: Do not incubate at 42°C longer than 10 min in step 25.\nPrepare the reverse-transcription master mix on ice using volumes as listed below and then add the reverse transcription master mix to the template RNA from step 25.\ntable:files/protocols_protocol_1470_4.csv\nOptional: The supplied RT primer Mix will generate random cDNAs but gene-specific primers can be used in a final concentration of 0.7 μM.\nIncubate 15 min at 42°C to synthetize the cDNAs.\nIncubate 3 min at 95°C to inactivate the Quantiscript Reverse Transcriptase and directly perform RT-qPCR.\nPause point: cDNAs can be stored at –20°C for months.\nRT-qPCRs\nTiming: 3 h\nAnalysis of the expression of FUS3 and STE2 by RT-qPCR.\nRT-qPCRs were done using a StepOnePlus™ Real-Time PCR System (StepOnePlus™ Real-Time PCR System (thermofisher.com[href=https://www.thermofisher.com/order/catalog/product/4376600]) and analyzed using the Applied Biosystems® Real-Time PCR Software (Applied Biosystems® Real-Time PCR Software User Bulletin-for use with StepOne and StepOnePlus (fishersci.com[href=https://assets.fishersci.com/TFS-Assets/LSG/manuals/100023687_RTPCR_Software_UB.pdf]).\nOptional: The 5S gene may be used as a control gene because it is not affected by the treatment with α-factor (see problem 5[href=https://www.wicell.org#sec6.9]).\nCritical: Oligonucleotide primers must be designed so that RT-qPCR products never exceed 200 bp in length.\nPrepare the following cDNA dilutions for each sample:\n1/20 dilution (for FUS3 and STE2 RT-qPCRs): dilute 5 μL of cDNA into 95 μL of DNAse-free mqH2O.",
    "1/2,000 dilution (for 5S RT-qPCR): dilute 5 μL of cDNA 1/20 dilution into 495 μL of DNAse-free mqH2O.\nUse one of the undiluted cDNA samples from step 28 to prepare serial dilutions (1/5, 1/10, 1/50, 1/100, 1/500, 1/1000, 1/2000, 1/10000, 1/20000) to generate a standard curve.\nPrepare the RT-qPCR master mixes on ice. Considering all samples and use a calibration curve for each primer set using volumes as listed below.\ntable:files/protocols_protocol_1470_5.csv\nNote: The different cDNA dilutions are adjusted to the expected abundance of each RNA (e.g., for 5S the cDNA dilution used is 1/2,000 as the ribosomal RNA abundance is very high)\nPipette 18 μL per well of the qPCR master mix in 96-well PCR plates suitable for StepOnePlus™ Real-Time PCR System.\nAdd 2 μL of each cDNA per well (including each dilution of the calibration curve). Problem 4[href=https://www.wicell.org#sec6.7] and Problem 5[href=https://www.wicell.org#sec6.9]\nRun the RT-qPCR as indicated below.\ntable:files/protocols_protocol_1470_6.csv\nNote: the melting curve generated with each primer pair indicates the specificity of the PCR reaction. A unique melting peak is desirable and indicates the melting temperature (Tm) of the amplified target.\nOptional: Alternative and faster cycling conditions are suitable for StepOnePlus™ Real-Time PCR System using other RT-qPCR master mixes.\nAmplifications are quantified using the standard curve method of the Applied Biosystems® Real-Time PCR Software.\nRaw data processing and statistical analysis of at least three independent experiments.\nCalculate the mean of WT untreated qPCR results (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1470_7.csv\naNormalized values are calculated by dividing each “raw” value by the “mean of WT” raw values. This sample data was used to generate the plot in Figure 2[href=https://www.wicell.org#fig2].\nNormalize each qPCR value to the mean of the WT calculated in a (Table 1[href=https://www.wicell.org#tbl1]).",
    "Use normalized data to calculate the statistical significance between samples of interest by using the paired-sample Student's t-test function of the Excel software or the following R-code snippet (https://www.r-project.org[href=https://www.r-project.org/]).\n# P-value calculation start----------------------------------\nt.test(c(Sample1Experiment1,\n      Sample1Experiment2,\n      Sample1Experiment3),\n  c(Sample2Experiment1,\n      Sample2Experiment2,\n      Sample2Experiment3),\n  paired = TRUE\n  )$p.value\n# P-value calculation end -----------------------------------"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Signal Transduction",
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}