{
  "id": 12029,
  "origin_website": "Jove",
  "title": "Combined Use of Tail Vein Metastasis Assays and Real-Time In Vivo Imaging to Quantify Breast Cancer Metastatic Colonization and Burden in the Lungs",
  "procedures": [
    "This protocol involves the use of mice and biohazardous materials and requires approval from the appropriate institutional safety committees. All of the described in vivo work here is approved by the Albany Medical College institutional animal care and use committee (IACUC).\nNOTE: For a protocol overview, see schematic in Figure 1.\n1. Packaging all required retroviruses and lentiviruses\nNOTE: The described protocol uses lentiviral or retroviral vectors to stably express a luciferase enzyme and fluorescent protein as well as to manipulate the expression of a candidate gene. These viruses are packaged in HEK-293FT cells as described below.\nDay 1: Plate HEK-293FT cells on 6-well plates in 2 mL of complete growth media (10% FBS in DMEM with 1% penicillin/streptomycin and 2 mM L-Glutamine) so that they are 40-60% confluent on day 2. Incubate at 37 °C, 5% CO2 overnight.\nDay 2: For each viral vector to be packaged, transfect a 40-60% confluent well of HEK-293FT cells with the retroviral or lentiviral vector and the appropriate vectors encoding the viral coat and packaging proteins.\n\tNOTE: This protocol uses VSVG as the coat protein, psPAX2 for lentiviral packaging, and gag-pol for retroviral packaging (see Supplemental Table 1 for vector list).\nMake a co-transfection mixture for each well as follows:\n\t\nCombine 4 μL of lipid solution for transfections (see Table of Materials) and 96 μL of transfection buffer and incubate for 5 minutes.\nAdd 1 μg of viral vector, 0.5 μg of coat protein vector (VSVG), and 0.5 μg of packaging protein vector (psPAX2 or gag-pol) and incubate for 20 minutes.\nGently add the co-transfection mixture from step 1.3.2 to the HEK-293FT cells plated in step 1.1 and incubate at 37 °C, 5% CO2 overnight.",
    "Day 3: Remove the transfection-containing media from each well and gently add 2 mL of complete growth media to each well. Incubate at 37 °C, 5% CO2 for approximately 24 hours.\nDay 4: Collect the viral supernatant from each well using a 3 mL syringe and filter through a 0.45 μm filter into a 2 mL microcentrifuge tube.\nOptional: If collection of a second batch of virus is desired, gently add 2 mL of complete growth media to each well and incubate at 37 °C, 5% CO2 for approximately 24 hours.\nDay 5 (Optional): Collect a second round of viral supernatant as in step 1.5.\n\tNOTE: The protocol may be paused by freezing the viral supernatant.\n2. Generation of cancer cells stably expressing luciferase and a fluorescent protein\nNOTE: The following protocol describes how to first to stably label 4T1 cells with firefly luciferase and a fluorescent protein (ZsGreen) using two vectors with unique selection genes. Then a 3rd viral vector is used to manipulate the expression of a candidate gene. However, viral vectors that simultaneously deliver a fluorescent protein and a genetic manipulation can also be used as an alternative (as in the representative experiments below). Other cancer cells can be used, but the cell numbers should be optimized for steps 2.1 and 2.7.1.\nPlate 4T1 cells at 1.5 x 105 cells/well in a 12-well plate in complete growth media (10% FBS in DMEM with 1% penicillin/streptomycin and 2 mM L-Glutamine) and incubate at 37 °C, 5% CO2 overnight.\nInfect the 4T1 cells with the viral supernatant generated in step 1 as follows.",
    "Aspirate the growth media from the cells and add 500 μL of luciferase viral supernatant and 500 μL of fluorescent protein viral supernatant to simultaneously infect the cells with both the luciferase and fluorescent protein viral supernatants.\nAdd 1 μL of 8 mg/mL hexadimethrine bromide (see Table of Materials).\nIncubate the cells at 37 °C, 5% until 75-90% confluent (typically 24-48 hours).\nTrypsinize the 4T1 cells with 500 μL of trypsin for 2-5 minutes (cells should freely rinse off the bottom of the well). Transfer all the cells to a 6 cm dish in 4 mL of selection media (complete growth media containing the appropriate antibiotics) thereby quenching the trypsin. Plate a 6 cm dish of non-infected control cells in the same selection media.\n\tNOTE: Appropriate antibiotic concentration should be determined ahead of time by testing several doses. Additionally, fluorescence-activated cell sorting can also be used to select the fluorescently labeled cells in place of drug selection.\nIncubate the cells at 37 °C, 5% CO2 in selection media and split the cells when necessary until all non-infected control cells are dead (dependent upon the selection gene and cell line).\nConfirm that the infected 4T1 cells are expressing the ZsGreen fluorescent protein using a green excitation (450-490 nm)/emission (500-550 nm) filter set on an inverted fluorescent microscope at 50-100x magnification.\nConfirm that the infected 4T1 cells are expressing luciferase using a commercially available luciferase activity kit as follows.\n\t\nUse a minimal volume of 1x passive lysis buffer to lyse luciferase-expressing 4T1 cells and control 4T1 cells that do not express luciferase, gently shaking for 30 minutes.\nAdd 20 µL of cell lysate to a white-bottom 96-well plate and then 50 µL of the luciferase assay reagent from the luciferase activity kit.",
    "Use a plate reader to measure the luminescence from the cells at all wavelengths in the spectrum by using the luminescence setting.\n\t\tNOTE: The protocol may be paused by freezing down the stably-transduced cells.\nManipulate the expression of the candidate gene as follows:\n\t\nPlate 6 x 105 labeled 4T1 cells from step 2.6 on a 60 mm dish in 4 mL of complete growth media and incubate at 37 °C, 5% CO2 overnight.\nAspirate the growth media from each well and add 2 mL of complete growth media containing 4 μL of 8 mg/mL hexadimethrine bromide.\nAdd 2 mL of viral supernatant from step 1 to the cells plated from step 2.7.2 and incubate at 37 °C, 5% CO2 overnight.\nTrypsinize the 4T1 cells with 500 μL of trypsin for 2-5 minutes (cells should freely rinse off the bottom of the well). Transfer all of the cells to a 10 cm dish in 10 mL of selection media (complete growth media containing the appropriate antibiotics) thereby quenching the trypsin. Plate some non-infected control labeled 4T1 cells in the same selection media.\nIncubate the cells at 37 °C, 5% CO2 in selection media and split the cells when necessary until all non-infected cells are dead.\nConfirm that the expression of the candidate gene is altered using a standard approach such as western blot20 or qPCR21.\nAssay luminescence and fluorescence as in steps 2.5-2.6 to determine how similar they are in control and knockdown cells, as this can change (see Discussion).\n\t\tNOTE: The protocol may be paused by freezing down the stably-transduced cells.\n3. Optimization of the in vivo experimental design\nOptimize appropriate cell number and duration of experiment for the desired metastatic burden as follows.",
    "Expand the fluorescent and bioluminescent 4T1 cells from step 2.6 in complete growth media so that excess cells are available on the desired day of injection.\nPrepare the cells for tail vein injections as described in step 4.2. To determine the optimal cell number for injections, resuspend the cells at several different concentrations in 100 μL of 1x PBS.\n\t\tNOTE: We recommend testing a range of cell numbers/mouse from 25,000 up to 500,000.\nKeep the cell suspensions on ice until injection.\nInject each dilution of 4T1 cells from step 3.1.2 into 3-4 mice via the lateral tail vein described in step 4.3 (see below).\nReturn the mouse to its cage and monitor for 15 minutes to ensure a full recovery. Mice should be checked for signs of pain or distress 3x weekly.\nMonitor mice for metastasis formation and growth for 3-6 weeks (cell line and mouse strain dependent) using an in vivo live animal imaging device (see steps 5 and 6).\n\t\t\nEuthanize mice 3-6 weeks after the tail vein injection according to standard institutional guidelines.\nPrepare the lungs and assess metastasis size and number described in step 7.\nChoose the appropriate length of time for the metastases to grow for the desired metastatic burden (see discussion).\n4. Tail vein injection of labeled cancer cells\nNOTE: Step 4.2.4 has been optimized for 4T1 cells growing in syngeneic BALB/c mice. If other cancer cell lines and mouse strains are used, the number of cells injected, and the length of the assay should first be optimized.\nExpand the 4T1 cell lines generated in step 2 on two 15 cm dishes in complete growth media so that excess cells are available on the day of injection.\nPrepare the cells for tail vein injection as follows:",
    "Aspirate the media and rinse the cell plates with 1x PBS.\nTrypsinize the cells with 5 mL of trypsin per 15 cm plate for 2-5 minutes (cells should freely rinse off the bottom of the well). Transfer all of the cells to a conical tube. Wash remaining cells from the tissue culture dish with enough complete growth media to quench the trypsin and add the wash to the same conical tube.\nCount the cells using an automated cell counter to determine the total cell number.\nCentrifuge the cells at 122 x g for 3 minutes, aspirate the supernatant, and resuspend the cells in 1x PBS at the desired concentration. Here, 2.5 x 104 cells are injected into each mouse in 100 μL of PBS, so the resuspend cells at 2.5 x 105 cells/mL. Keep the cell suspensions on ice until injection.\n\t\tNOTE: it is important to limit the amount of time between trypsinization of the cells and the tail vein injection to roughly 1 hour.\nInject 4T1 cells from step 4.2.5 into mice via the lateral tail vein as follows:\n\t\nWorking in a hood at the animal facility, gently but thoroughly mix the cells by inverting the tube or using a 1 mL syringe to ensure that they are uniformly resuspended. Always ensure the cells are resuspended prior to loading the syringe.\nLoad a 1 mL Luer-lock syringe with cell suspension and expel excess air bubbles. Place a ½ inch, 30-gauge needle on the syringe with the bevel up and expel air bubbles.\nGently place the mouse in a rodent restrainer.\nThe lateral tail veins should be visible and dilated. If not, gently pinch the base of the tail and dip the tail in warm tap water to dilate the veins.",
    "NOTE: Dilation of the veins may also be achieved by placing the mouse cage under a heating lamp and/or on top of a heating pad.\nUse an alcohol wipe to clean the tail. Insert the needle into the tail vein, bevel side up, and inject 100 μL of cell suspension.\n\t\tNOTE: If the needle is inserted properly into the vein, it should easily slide slightly forward and back, and there should not be resistance when the plunger is pushed. Successful injections should also result in a \"flush\" in which the blue color of the vein turns white for a few seconds following the injection.\nSlowly remove the needle and using a sterile gauze, apply pressure to the injection site to stop any bleeding.\nReturn the mouse to its cage and monitor for 15 minutes to ensure full recovery. Mice should be checked for signs of pain or distress 3x weekly.\nMonitor mice for metastasis formation and growth for 3-6 weeks (cell line and mouse strain dependent) using an in vivo live animal imaging device (see steps 5 and 6).\n5. Monitoring the metastatic burden by fluorescence with an in vivo live animal imaging device\nNOTE: Do not image animal for fluorescence with active luminescent signal.\nIf only imaging bioluminescence, skip to step 6.\nTurn on the in vivo live animal imaging device.\nSet up the in vivo live animal imaging anesthesia system according to manufacturer's guidelines to deliver between 1.5% and 2% isoflurane to the anesthesia chamber and the imaging chamber.\nAnesthetize mice with fluorescently labeled metastases from step 4 by placing them in an anesthesia chamber and delivering 1.5-2.5% isoflurane.\nOpen the image software (see Table of Materials) and login.\nClick the Initialize button and wait for the machine to initialize.\nChange the Field of View to D.",
    "NOTE: Field of View C can also be used if a closer view of a mouse is required, but this limits the number of mice that can be imaged simultaneously.\nOnce the software has indicated that the camera has reached the appropriate temperature, click the Imaging Wizard button, choose Fluorescence and then choose the appropriate filter pair from the drop-down menu.\n\tNOTE: If the fluorophore being used is not an option, choose Input EX/EM and type the excitation and emission required.\nPlace the mouse in the chamber as described in step 3.2.4.\nClick Acquire Sequence.\nAfter imaging, return the mouse to its cage and monitor for 15 minutes to ensure full recovery.\nRepeat step 5.2 and steps 5.7-5.9 with at least one mouse that does not contain metastases. NOTE: This mouse will be used to quantify and subtract background signal during analysis (step 8).\nImage 2-3 times weekly for the duration of the experiment.\n6. Monitoring the metastatic burden by bioluminescence with an in vivo live animal imaging device\nTurn on the in vivo live animal imaging device and setup the program as follows.\n\t\nOpen the image software (see Table of Materials) and login. Click the Initialize button and wait for the machine to initialize. Change the Field of View to D.\n\t\tNOTE: Field of View C can be used for a closer view to image the full mouse body; however, this limits the number of mice that can be imaged at once.\nFor first time use, edit exposure settings as follows: click Edit | Preferences | Acquisition | Auto Exposure and change the maximum exposure time from the default 60 seconds to 300 seconds and click OK.\n\t\tNOTE: Do not change any other parameters in the auto exposure tab.",
    "Set-up the anesthesia system according to manufacturer's guidelines to deliver between 1.5% and 2% isoflurane to the anesthesia chamber and the imaging chamber.\nEnsure the camera has reached the appropriate temperature before proceeding to step 6.4.\nAnesthetize metastasis-containing mice from step 4 by placing them in an anesthesia chamber and delivering 1.5-2.5% isoflurane.\nPrepare mice for bioluminescence imaging as follows.\n\t\nLoad a 1 mL syringe with D-luciferin (30 mg/mL in D-PBS) and then add a ½ inch 30-gauge needle to the syringe and expel air bubbles.\nMeasure and record the mass of the anesthetized mouse.\nRestrain the mouse by pinching the scruff of their neck using the thumb and pointer fingers and grasping the tail between the pinkie finger and the base of the hand. Invert the mouse at a 45-degree angle, with its head pointed downward.\nInsert the needle, bevel side up, into the mouse's left side intraperitoneal (IP) space. Confirm entry into the IP space by drawing back a small volume. There should not be color at the base of the needle when drawing back in the IP space.\nInject the appropriate volume of D-luciferin for a dose of 150 mg/kg.\nImmediately after D-luciferin administration, start a timer and place the mouse flat on its back in the imaging device with its nose in the nose cone and ensure that 1.5-2.5% isoflurane is being administered. Place dividers between each mouse if imaging multiple mice. Ensure mice are positioned as flat as possible (i.e. not leaning to one side).\nClick the Luminescent and Photograph boxes and then click Acquire in the Acquisition Control Panel.\nContinuously acquire bioluminescent images until the peak signal is achieved and use the image with the peak bioluminescent signal for analysis.",
    "After imaging, return the mouse to its cage and monitor for 15 minutes to ensure full recovery.\nImage 2-3 times weekly for the duration of the experiment.\n7. Quantification of the number and size of metastases\nNOTE: The length of time the metastases are allowed to grow should be determined for each cell line and mouse strain, and will be influenced by the number of cells injected.\nEuthanize the mice according to standard institutional guidelines.\nIsolate and remove the lungs from each mouse and rinse in 1x PBS to remove excess blood.\nGently separate the lungs into lobes.\nAcquire images of ZsGreen metastases in the lobes at 10x in bright field and fluorescence using a fluorescent stereoscope with a GFP wideband filter (excitation 470/40x).\n\tNOTE: Maintain the same magnification and brightness for all samples. The magnification used may vary depending on the size, number, and brightness of metastases as well as the field of view for the microscope used.\nUse image analysis software to quantify the size and number of metastases from the images.\n\tNOTE: The protocol for image analysis is software dependent and could be optimized with tumors from step3. Alternatively, count the number of metastases in each lung manually using the fluorescent stereoscope. Protocol can be paused here and step 8 can be done at any point after all the in vivo images have been collected.\n8. Processing and analysis of the data from the images acquired with the in vivo live animal imaging device\nOpen all image files for each mouse in the image software.\n\tNOTE: Use the image with the peak bioluminescent signal for analysis",
    "Ensure the units are in Radiance for bioluminescent data and Efficiency for fluorescent data by clicking the arrow at the top left of the image window and changing it to the appropriate unit.\nUse the image from the last timepoint to create a region of interest (ROI) as follows.\n\t\nClick ROI Tools in the Tool Palette window. Insert one ROI by clicking the arrow and selecting 1.\nClick the border of the ROI and move it over the chest of the mouse. Adjust the size of the ROI so it covers the chest of the mouse and does not exclude signal.\nClick measure ROIs and copy or type the raw number into an excel sheet.\n\tNOTE: For bioluminescent data select the total flux (photons/second), which is the sum of all the radiance in the ROI. Since metastases do not necessarily grow uniformly, the total flux is preferred over average radiance because it measures the sum of the metastatic burden. Similarly, for fluorescent data, the total efficiency % (emission light (photons/second)/excitation light (photons/second)) should be used instead of average efficiency.\nRight click in the image file to copy the ROI used in step 8.3 and paste it into every image file.\n\tNOTE: When quantifying fluorescent images, quantify the same region on a mouse that was imaged with no metastasis. Use this signal as the background signal and subtract it from each fluorescent metastasis-containing mouse image acquired.\nMove pasted ROIs over the same region selected in step 8.3.4 for each image and repeat step 8.4.\nPlot and analyze the raw data as follows (see Supplemental Table 2).",
    "Do a log10 transformation of the raw data for each mouse using the indicated formula (Supplemental Table 2) and plot as in Figure 2D and Figure 4F. The log10 transformation linearizes the growth curve which tends to be geometric and minimizes heteroscedasticity.\nUsing linear regression, calculate the slope of the fitted line to the log10 transformed data for each mouse plotted in step 8.7.1 (Supplemental Table 2). Refer to the formula in Supplemental Table 2 to fit the line and calculate the slope in one step.\nPlot the numerical values of the slopes as in Figure 2E and Figure 4G. Use a Student's t-test or one-way ANOVA (for more than 2 groups) on the slopes to determine statistical significance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}