{
  "id": 9249,
  "origin_website": "Jove",
  "title": "Radio Frequency Identification and Motion-sensitive Video Efficiently Automate Recording of Unrewarded Choice Behavior by Bumblebees",
  "procedures": [
    "The Animal Care Committee of the University of Ottawa has approved our experimental protocol, which delineates safety procedures for personnel working with bees.\n1. Testing Environment Preparation\nPrepare an empty space (isolated room, or metal-screen covered flight cage) of 2 m x 2 m x 2 m.\n\tNOTE: If the room is chosen as the testing space, ensure that bees cannot escape through windows, spaces under doors, and air exchange ducts.\nAdd small entry points (e.g., approx. 2 cm diameter holes) to the flight cage where bees can enter and exit the testing space without obstruction. Design a mechanism to block access points to keep bees out of the testing space during periods reserved for maintenance and equipment configuration.\n\tNOTE: We used Bombus impatiens Cresson workers.\nConnect one or two colony boxes to the testing-space using a connector. Ensure that a dead bee cannot block the connector.\n\tNOTE: Here, use two types of connecting structures: a wooden “bridge” structure with a glass top cover, and a wire mesh tube. They are easy to clean and they provide traction for the bees.\nPlace two artificial flower holders inside the testing-space.\n\t\nPlace flower holders in the center of the testing-space, or attach them to the wall.\nConnect a “2k6 head” RFID reader to the top of the cylinder portion of the artificial flower using masking tape (see Figure 1 for positioning). Use a 1.2 m tall wooden stand to which to attach artificial flowers.\n\t\tNOTE: The top of the stand should feature an attachment mechanism where artificial flowers can be connected. See Figure 2 for a schematic drawing\nAdd high-frequency (min. 200 Hz) fluorescent light fixtures to adequately light the testing-space. Use a high frequency electronic ballast to ensure that light flicker is above bumblebees’ visual flicker fusion threshold6.",
    "NOTE: Here, use 12 daylight fluorescent bulbs that produce about 1,200 Lux light intensity for a space of 2 x 2 x 2 m.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52033/52033fig1highres.jpg\nFigure 1. RFID Artificial Flower Design. Schematic diagram of the RFID-enabled artificial flower used in Experiment 1. The RFID reader rested on top of the open cylinder through the center of the flower. Stimuli patterns and positions: a. peripheral-concentric, b. central-concentric, c. peripheral-radial and d. central-radial. This figure has been modified from Orbán et al.11.\nimgsrc://cloudfront.jove.com/files/ftp_upload/52033/52033fig2highres.jpg\nFigure 2. Stimulus Display Stand. A schematic drawing showing the design of the artificial flower stimulus stand, and attachment clip. The attachment clip is glued to the artificial flower and is used to quickly attach and detach the stimuli to and from the stimuli stands. This configuration was used in the motion-sensitive video experiment. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52033/52033fig2highres.jpg]\n2. Bumblebee Colony Preparation\nUpon arrival of commercially ordered colonies, connect the colony box to the flight cage.\nProvide pollen (collected by honeybees from a variety of plants) and sugar-water (1:1 by volume) ad libitum until the start of the testing sessions.\n\t\nBoil 1 L of water, and mix in the same volume of sugar to create the sugar-water solution.\nPurchase pollen from an apiarist or the commercial supplier of bumblebee colonies. Grind the pollen with a mortar and pestle, and mix with honey and water (as needed) to make it into a moist paste.\nOnce the experiment begins, provide 15–40 ml of sugar water (quantity proportional to the colony size) daily. Continue to provide pollen ad libitum. Adjust sugar-water quantity according to storage levels in the honey pots.\n\tNOTE: Keeping food storage levels low provides an incentive for workers to leave the nest to seek more food.",
    "Allow bees to enter the testing environment via the connector structure, as described in step 1.3.\n\tNOTE: Bees move freely between the nest and the testing environment throughout the experiment.\n3. Preparation for Observation by Radio-frequency Identification\nStart gluing RFID tags to the thorax of the workers as soon as the colony arrives, and continue throughout the experiment, as new workers emerge.\nGluing Technique\n\t\nPlace all workers in individual containers during initial tagging. Cool workers down for approximately 1 hr in the fridge (approximately 7 °C) to slow them down.\n\t\tNOTE: Cooling down workers in advance of tagging helps make aggressive colonies more manageable. This minimizes the chance of stings.\nUsing the tagging apparatus and non-toxic glue (provided by the tag provider), attach the RFID tag to the thorax of the worker. Glue RFID tags to workers as they emerge, while they are still in callow stage (before they are capable of flying).\nWait a minimum of 10 min before placing the worker back in the colony to ensure the RFID tag cannot be removed by the worker. \nDispose of workers that were not tagged during their callow stage, or workers that have lost their RFID tags (as seen by glue residue or bald patch on the thorax).\n\tNOTE: These bees may have had experience outside the colony.\nRFID Reader software\n\t\nUse a personal computer (PC) to configure the RFID reader software. Change the operating system’s date format to yyyy-mm-dd hh:mm:ss to ensure the downloaded RFID data are correctly encoded. Adjust the program supplied with the RFID readers using C++ programming language to allow exporting the data on the RFID reader as Comma Separated Values (CSV).",
    "Connect the RFID reader to the computer using an RS-232 to USB connector. Download the data to the RFID reader periodically, before the reader reaches storage capacity (up to 32,000 records). Use RFID readers to record date, time and a thirteen character unique string associated with each tag. Import the downloaded CSV file into a relational database management system (RDBMS).\n4. Artificial Flower Preparation for RFID Readers\nPurchase blue and yellow bake clay from a local crafts store.\nCreate a blue cylinder with a diameter of 1.5 cm, and cut a 1.5 cm x 3 cm hole on the side.\n\tNOTE: The hole on the side of the cylinder will serve as the receptacle for the RFID reader.\nCreate a blue cone with a diameter of 8 cm on one end, and 1.5 cm on the other end.\nMerge the cylinder and the cone.\nCreate a 20 cm long and 0.5 cm wide strand of yellow clay.\nCut the yellow strand to size, and work into the blue cone and the cylinder.\n\tNOTE: Radial shapes will require 5 cm long straight lines, and concentric shapes will require 4–8 cm long circular lines.\nBake clay at 130 °F until fully hardened.\n5. Preparation for Observation by Motion-sensitive Video Recording\nStart gluing colored plastic number tags to the thorax of the worker bees as soon as the colony arrives, and continue throughout the experiment as new workers emerge.\nRemove all workers during the initial tagging session to ensure that every individual receives a number tag. Place workers back in the colony immediately after tagging.\n\tNOTE: Unlike RFID tags, number tags are more difficult for workers to remove.",
    "As new workers emerge, tag them while they are still callow. Tagging frequency varies with the state of colony cycle, but averages to about 7–10 workers every 2–3 days. Dispose of workers that were not tagged during their callow stage because they may no longer be flower-naïve.\nSystem for tagging more workers than available tag numbers\n\tNOTE: If the experiment continues for a period of months and multiple colonies are involved, there is a good chance that available tag numbers run out. There are about 7 distinguishable tag colors, each numbered from 1 to 99 allowing up to 693 concurrently tagged workers. An experiment running for 3 months using 3–4 colonies will have well over 693 workers in total, but never concurrently alive.\n\t\nEnsure that numbers tags are positioned systematically (e.g., top side of the tag number is always aligned with the bee’s head), especially for the following numbers: 6, 9, 66, 69, 99.\nRemove dead workers, and record their tag number as “freed up”. Maintain a database of tag numbers and colors that are “available” or “in use” to ensure that a unique tag is not used on multiple bees at the same time.\n\t\tNOTE: Additional tag combinations may be produced by adding colors to already existing colors. For example, adding a yellow dot to a blue tag with a sharpie pen can create new combinations.\nVideo Data Processing\n\t\nPlace two internet protocol (IP) camcorders (minimum 1 mp picture resolution) in front of each floral display, outside the testing environment (see Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/52033/52033fig3highres.jpg\nFigure 3. Testing Environment. A photograph of the testing environment showing the two frontal camcorders in the foreground, the ceiling camcorder in between the light fixtures, and the stimuli stands with sample stimuli in the middle of the room.",
    "NOTE: A glass divider between the IP camcorders and the artificial flowers ensures that the artificial flowers are clearly visible. The IP camcorders may be up to 5 m away from the stimuli. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/52033/52033fig3highres.jpg]\nReplace the stock lenses with 1.8 mm vari-focal lenses. These lenses allow sufficient zoom and focus on the artificial flowers.\nPlace an additional IP camcorder directly above the artificial flower, focusing on an area 1–2 m in front of the artificial flowers. This camcorder captures hovering and antennation behaviors.\nConnect the IP camcorders to a PC via a secondary network interface controller (NIC), and an Ethernet hub.\nConfigure the PC’s dynamic host configuration protocol (DHCP) to dynamically distribute IP addresses to the IP camcorders.\nConfigure a file transfer protocol (FTP) server on the PC.\nConfigure an FTP client process to automatically deposit video clips on the PC.\nConfigure the IP camcorder to record a 10 sec video clip each time motion is detected. \nVideo Clip Analysis\n\t\nOpen a video clip, and view the contents frame-by-frame using a video viewer of choice.\nRecord a bee’s plastic tag number, date and time of recording in a spreadsheet or an RDBMS. Here, define a landing as a bee’s legs coming into contact with the artificial flower.\n\t\tNOTE: Discard choices that are socially influenced (landing while another bee is present on the stimulus).\n6. Artificial Flower Preparation for Video Observation\nDesign visual properties using a graphics editing software.\n\tNOTE: Ensure that the printed pattern can be cut and folded into a cone. Use geometrical calculations to produce the cutout shape that results in a cone with an 8 cm diameter.\nPrint, cut, and fold the visual property into a cone.\nGlue attachment clips to stimulus (see Figure 2).",
    "7. Statistical Analysis\nIn both experiments, compute a choice proportion for each bee (e.g., a particular bee made x choices of one flower out of a total of y).\nAnalyze these proportions with a replicated Goodness of Fit Test7.\n\tNOTE: A replicated G-Test computes a heterogeneity value (Gh) that indicates the amount of variability of replicates (i.e., each bee), and a pooled value (Gp) that indicates the overall significance of all choice proportions. The G values are compared to χ2 values in tests of significance.\n8. Stimuli Presentation Sequence\nAttach artificial flowers to the flower stands inside the testing space. Change the combination and location of displayed stimuli at regular time intervals (e.g., daily) to avoid location effects.\n9. Study Termination\nPlace the colonies in the deep freezer at -10 °C for 3 days to kill the bees."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}