{
  "id": 10988,
  "origin_website": "Jove",
  "title": "Protocol for Biofilm Streamer Formation in a Microfluidic Device with Micro-pillars",
  "procedures": [
    "Perform the experimental protocols here in the order described below. Microfabrication protocols for creating the microfluidic platform are discussed in Step 1. Step 2 describes the bacterial culture protocol (Figure 2), and Step 3 pertains to assembly of the experimental setup (Figure 3). Finally, the actual experimental step is described in Step 4.\n1. Chip Fabrication Procedure\nNOTE: Proper safety procedures must be followed for the processes described below. Consult the institutional safety officer for details.\nDesign the mask with an appropriate software (e.g., L-Edit). The channel design consists of a main micro-channel of width 625 μm. The central region of the channel contains an array of micro-posts 50 μm in diameter, spaced 25 μm apart (See Supplemental Files).\nPrint this design on glass (5\" x 5\" soda lime glass), which has a thickness of 0.09\" and is coated by approximately 70 nm thick layer of Chromium (Cr), using masking in order to prepare a photo mask. Use AZ400K developer for 1 min. Then, etch the Cr layer using Cr etchant for about 1 min. Use acetone to strip the resist and clean it with cold piranha solution (H2SO4 and H2O2 in a ratio of 3:1).\nPhotolithography\n\t\nClean a standard 4\" silicon wafer chemically with piranha solution for 20 min.\nRinse the wafer with DI water and dry it.\nHeat the wafer on a hot plate (200 °C for 15 min).\nCoat the silicon wafer with photoresist. Here, the positive photoresist AZ4620 was spin-coated on a silicon wafer at 2,000 rpm for 25 sec to obtain a 12.5 μm thick layer.\nRemove all the solvent by soft baking of the wafer on a hot plate by floating the wafer for 90 sec on nitrogen flow at 100 °C. Then, keep it in vacuum at the same temperature for 60 sec.",
    "Place the wafer in a dark box for 24 hr for dehydration.\nExpose the wafer to UV light in order to transfer the designed pattern to the photoresist.\nImmerse the wafer in photoresist developer solution (AZ400K) for 240 sec. Then, rinse the wafer with isopropyl alcohol and dry it by placing in a stream of nitrogen gas.\nICP-DRIE (Inductively Coupled Plasma - Deep Reactive Ion Etching) Process\n\t\nApply DRIE etching. Choose the appropriate etch depth according to final depth required for device (50 μm in this investigation). Photoresist acts as a masking layer during this process.\nRemove the remaining photoresist with acetone and clean the wafer.\nPDMS (polydimethylsiloxane) Casting\n\t\nUse trichloromethylsilane (TCMS) for silanizing the silicon master mold. Pour 2 or 3 drops of trichloromethylsilane in a vial and place it in a desiccator beside the silicon master mold. Allow 2-3 hr for the silanizing process to complete.\nIn a separate container, mix the Sylgard 184 silicone base with curing agent by weight ratio of 10:1 to prepare PDMS. Degas the PDMS by subjecting it to vacuum conditions (about 2 hr).\nPut the silicon master mold in a holder. Then, pour the PDMS on the silicon master mold to form the PDMS stamp. Ensure that bubbles do not form in the PDMS during this process.\nCure the PDMS for 2 hr at 80 °C.\nPeel off the PDMS stamp from the master mold. Then, cut the PDMS stamp into separate microchips. Finally, use a cutting core to drill holes for the inlet(s) and outlet(s).\nBonding of PDMS to Glass\n\t\nExpose the cover slip and PDMS stamp to oxygen plasma for 30 sec. Bond PDMS stamp to the cover slip.",
    "To achieve proper sealing between the PDMS stamp and the cover slip, anneal the device by putting it in oven at 70 °C for 10 min.\n2. Bacterial Culture\nNOTE: Proper biosafety protocols must be followed for Steps 2-4. Consult the institutional safety officer for details.\nPrepare LB Agar Plates\n\t\nAdd 20 g Luria-Bertani (LB) agar (Miller) powders and 500 ml of ultrapure water to a 1 L flask. Stir to dissolve the powder.\nSterilize by autoclaving at 15 psi, 121 °C for 15 min.\nAllow the flask to cool down to 50-55 °C on a bench or in a water bath in the biosafety hood.\nAdd the antibiotic Tetracycline to achieve a final concentration of 50 μg/ml. Mix well by swirling.\nPour the mixture into plates. Fill each plate till 1/2 - 2/3 full.\nFlame air bubbles briefly to pop them if they form. Solidified air bubbles are difficult to spread bacterial culture over.\nAllow the plates to cool at room temperature overnight.\nWhen they are cool, put plates back into their sleeve, seal the bag, label (antibiotic and date), and store at 4 °C.\n\t\tNOTE: Cover the stock of plates with tin foil, as light deactivates many antibiotics.\nLB Broth Preparation\n\t\nAdd 20 g Luria-Bertani (LB) broth (Miller) powders and 1 L of ultrapure water to a flask. Stir to dissolve the powder.\nSterilize by autoclaving at 15 psi, 121 °C for 15 min.\nAllow flask to cool down to 50-55 °C on a bench or in a water bath in the biosafety hood.\nAdd the antibiotic tetracycline to achieve a final concentration of 50 μg/ml. Mix well by swirling.\nWhen cool, place the labeled bottle at 4 °C.\n\t\tNOTE: Cover the bottle with tin foil, as light deactivates many antibiotics.",
    "Culture Bacteria on an LB Agar Plate (This protocol uses Pseudomonas fluorescens)\n\t\nTake the bacterial stock from the freezer (-80 °C) and place it on ice.\nPlace the -80 °C bacterial stock and an LB agar plate inside a biosafety hood.\nStreak the bacterial strain onto an LB agar plate in a zigzag pattern. Cover the agar plate and incubate it at 30 ºC overnight. Finally, store the plate in the refrigerator at 4 °C.\nPrepare the Bacterial Solution (S1)\n\t\nPour 50 ml LB broth media to an autoclaved flask. Perform this operation inside a biosafety hood.\nTransfer a single bacterial colony from the LB agar plate to the flask. This operation should also be performed inside a biosafety hood.\nPut the flask in a shaker incubator at 30 °C and 150 rpm for adequate time (4 hr).\nPrepare the Dilute Bacterial Solution (S2)\n\t\nPour 5 ml LB broth media into a sterilized plastic tube.\nDilute S1 by mixing with LB broth media. Then, vortex the solution. Dilute the solution achieve the desired optical density (OD measured at 600 nm = 0.1).\n\t\tNOTE: Biofilm experiments typically employ OD values in this vicinity.\n3. Prepare the Experimental Setup\nUsing tweezers connect flexible plastic tubes (0.20\" ID) into the inlet(s) and outlet(s) of the microchip. The inlets and outlets were previously drilled into the PDMS portion of the microchip (step 1.5.5). In this investigation, the microchip consists of two inlets and one outlet.\nFill syringe(s) with bacterial solution (S2 solution) and remove all the bubbles in the syringe(s).\nConnect syringe tip(s) (30 G 0.5\" blunt needle) into inlet tube(s). Then, connect outlet tube(s) to waste container.\n4. Run the Experiment\nConnect the syringe(s) to the syringe tip(s).",
    "Place and fix syringe(s) onto the syringe pump. Then place the microchip under an optical microscope with objective lenses of desired magnification (e.g., 40X). Cover the microchip with a live cell chamber device to maintain a constant temperature environment for bacterial growth (30 °C for P. fluorescens).\nSet the pump to the desired flow rate level (say 10 μl/hr) and initiate fluid pumping.\nOnce bacteria are introduced into the chamber, biofilm formation is also initiated. Biofilm formation and maturation typically occur over a period of several hours or even days. Observe and take images of biofilm growth through the microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}