{
  "id": 10856,
  "origin_website": "Jove",
  "title": "Real Time Monitoring of Intracellular Bile Acid Dynamics Using a Genetically Encoded FRET-based Bile Acid Sensor",
  "procedures": [
    "1. Transient Transfection\nNote: CytoBAS and NucleoBAS (Please see Materials Table) are successfully used in several cell types, (U2OS, Huh7, HepG2, H69, MDCK and HEK293T cells). The main requirement to use the sensor is that it needs to be expressed, requiring the encoding DNA to enter the cell.\nHarvest cells from an 80% confluent 25 cm2 flask. Dilute cells in complete culture medium suitable for the specific cell line (10% FBS, 1% L-glutamine, 1% pen/strep for U2OS and Huh7 cells).\nPlate cells at the desired density into a sterile 8 well chambered cover glass (0.8 cm2). Aim for a sub-confluent (60-80% confluency) layer of cells on the day of the experiment, although this is not essential.\nAdd complete culture medium to a final volume of 400 µl per well. Allow cells to attach for 24 hr.\nPrepare the transfection mix in a sterile tube by adding 0.5 µg of NucleoBAS or CytoBAS DNA to 100 µl of culture medium (serum/antibiotic free). Vortex well. Add a transfection reagent and mix by vortexing. Transfection reagents that give optimal efficiency are cell type dependent and might require prior testing.\n\t\nFor instance, use 2.5 µl of 1 mg/ml polyethylenimine (PEI) and incubate the DNA/PEI mix for 15 min at RT.\nAdd the transfection mixture in droplets to the cells and mix by gently shaking the well plate by hand. Add 100 µl of the mixture for a well of ~9.6 cm2. Use 10 µl of the transfection mixture for individual imaging chambers for transiently transfected cells.\n\tNote: After 24-48 hr, cells will express the bile acid sensor and can be used for experiments.\n2. Stable Transfection",
    "Harvest cells from an 80% confluent 25 cm2 flask. Dilute pellet in complete culture medium suitable for the specific cell line (10% Fetal Bovine Serum, 1% L-glutamine, 1% pen/strep for U2OS and Huh7 cells) to a concentration of 150,000 cells per ml and add around 300,000 cells per well in a 6-well culture plate (2 ml end volume).\nAllow cells to attach for 24 hr.\nPrepare the transfection mix in a sterile tube by adding 0.5 µg of CytoBAS or NucleoBAS DNA (Please see Materials Table) to 100 µl of culture medium (serum/antibiotic free). Vortex well. Add a transfection reagent and mix by vortexing.\n\t\nFor instance, use 2.5 µl of 1 mg/ml polyethylenimine (PEI) and incubate the DNA/PEI mix for 15 min at RT.\nAdd 100 µl of the transfection mixture in droplets to the cells and mix by gently shaking the well plate by hand. Always include an untransfected control when creating a stable cell line.\nGrow cells O/N at 37 °C, 5% CO2.\nTrypsinize cells according to manufacturer's protocol (Incubate cells at 37 °C with 1.5 ml prewarmed trypsin per 25 cm2 cell culture) and spin them down at 250 x g at RT for 5 min. Remove supernatant and resuspend cells in 13 ml of complete culture medium. Divide cells over various 10 cm diameter culture dishes: 0.5 ml (low density), 1.5 ml (medium density), and 4.5 ml (high density). Do the same for remaining 6.5 ml.",
    "Add culture medium to a final volume of 10 ml. For U2OS cells, use 800 µg/ml G418 for plasmids with the neomycin resistance cassette such as the CytoBAS and NucleoBAS constructs to select for positive cells. This concentrations is cell type dependent and can be determined by selecting the lowest antibiotic (G418) concentration where untransfected cells died within 2 to 10 days (800 µg/ml G418 for U2OS cells).\nRefresh the culture medium with the appropriate antibiotic (G418) every 72 hr until the untransfected cells are dead.\nExamine the culture plate under the microscope with a 20X objective for positive colonies (fluorescence can be monitored using most filter sets used for green, cyan or yellow fluorescence).\nMark the positive colonies that lie isolated from other colonies with a pen on the exterior bottom of the culture dish.\nWash the plate twice with Phosphate Buffered Saline (PBS) and aspirate it. Take around 15 sterile cloning cylinders and dip them into sterile silicone. Apply them around the selected colonies by pressing lightly against the petri-dish and make sure that not more than one colony is included in the cloning ring.\nPipet 20 µl of pre-warmed trypsin (1x, 0.25%) in the cloning cylinder and incubate at 37 °C until most of the cells have rounded up (observe with a microscope).\nAdd 150 µl of culture medium with serum and the appropriate antibiotic (10% FBS and 800 µg/ml G418 for U2OS and Huh7 cells) in the cloning cylinder and pipet up and down several times to resuspend the cells and transfer to a 96-well plate. Refresh medium after 4-24 hr and allow cells to grow confluent in the next few days (37 °C, 5% CO2for U2OS and Huh7 cells).",
    "Refresh medium with antibiotic every 3 or 4 days. When the cells have grown confluent, transfer them to a larger well plate. Repeat this step until the culture is large enough for experiments. Cryopreserve some vials for backup. Cryopreservation medium consists of 20% FBS and 20% DMSO in media (DMEM) without supplements.\n\tNote: Now, the cell line is monoclonal and considered stable for expressing the Bile Acid Sensor. Half the concentration of the antibiotic G418 (400 µg/ml) is now sufficient to maintain expression in the stable cell line.\n3. Lentiviral Transduction\nNote: Some cell lines are considered difficult to transfect by more traditional methods such as the polyethylenimine (PEI) method. Viral transduction of cells is an efficient alternative tool for gene-delivery and stable transgene expression.\nHarvest cells from an 80% confluent 25 cm2 flask. Dilute cells in complete culture medium suitable for the specific cell line (10% FBS, 1% L-glutamine, 1% pen/strep for U2OS and Huh7 cells) and add around 200,000 cells per well in a 6-well culture plate.\nAdd culture medium to a final volume of 2 ml per well. Allow cells to attach for 24 hr.\nPerform viral transductions by incubating cells for 4-6 hr with 500 µl CytoBAS lentivirus containing medium (available upon request) filled up to a total amount of 1 ml with complete culture medium containing 10 µg/ml diethylaminoethyl (DEAE)-dextran or another lentiviral transduction enhancer. Do not forget to include a well with untransduced control cells.\nRemove medium and add 2 ml of complete culture medium containing the desired antibiotic (500 µg/ml hygromycin). Use a lentiviral construct for CytoBAS transduction that provides hygromycin resistance to cells. Grow cells under desired conditions.",
    "Refresh medium with (500 µg/ml hygromycin) antibiotic every 3 days and split the cells when 80% confluent, until all negative control cells are dead (takes about 1-2 weeks for most cell lines). The cell line is now considered stable for expressing the Bile Acid Sensor.\n\t\nAlternatively, use cells for experiments 1-3 days after viral transduction. As live virus might be present, this requires FRET-readout equipment in rooms with the appropriate safety level.\nAlternatively, for rapid isolation of stable cell lines, perform fluorescence activated cell sorting (FACS).\n\t\nHarvest cells from a confluent 160 cm2 flask.\nDilute cells in Leibovitz culture medium (L-15 medium) with <5% serum to a concentration of maximum 5 x 106 cells per ml\nFor collection of sorted cells, fill FACS tubes with 1 ml of collection medium (L-15 medium + 1.5% pen/strep, 1% L-glut and 20% serum).\nSort cells for citrine (520-580 nm) or cerulean (450-520 nm), excited with 405 laser.\nAfter sorting approximately 500,000 cells, spin down cells (5 min, 250 x g) and resuspend them in 5 ml normal complete culture medium (10% FBS, 250 µg/ml Hygromycin for U2OS and Huh7 CytoBAS cells) and plate them in a T25 culture flask. Grow cells under desired conditions (37 °C, 5% CO2 for U2OS and Huh7 cells).\n4. Live Cell Imaging of the Bile Acid Sensor\nNote: Cells containing bile acid transporters can be cultured in medium with 1-10% charcoal-filtered serum that removes lipophilic compounds. Normal serum often contains bile acids that could lead to intracellular bile acid accumulation and saturation of the Bile Acid Sensor.\nFRET measurements using the confocal microscope",
    "Plate the cells stably or transiently expressing the sensor at the desired density into a sterile 8 well coverslip bottomed chamber slide (0.8 cm2). Grow cells in complete culture medium (using charcoal-filtered serum) so that on the day of the experiment, confluency is around 60-70%.\nWash the adherent cells in chamber slide once with 200 µl 1x PBS or Leibovitz's L-15 culture medium.\nAspirate and replace with 300 µl Leibovitz's L-15 culture medium so that no CO2control is necessary.\n\t\tNote: DMEM without phenol red can be used as well but requires CO2buffered conditions. The bile acid sensor shows (some) pH-sensitivity so aim to keep the pH constant during the data-collection.\nDilute the compounds to be used in the confocal imaging experiment also in L-15 culture medium. Take into account that during imaging, relatively large amounts of liquid in the chambers have to be added to secure rapid mixing of the sample (50-100 µl), so make 3-5x solutions.\nStart the imaging software of a confocal microscope with a 37 °C incubation chamber and turn on the violet 405 nm laser. Put a drop of immersion oil onto the objective and place the 8-chamber on top of it. For single cell imaging of FRET, use the 63X oil objective. The sensor has been successfully used at RT, but cell behavior might be altered.\nSet the settings of the confocal microscope properly.\n\t\t\nSet Acquisition mode: xyt (time-lapse imaging of single focal plane).\nAcquire images at 20 sec intervals to allow compounds to be added between acquisitions without pausing the experiment.\nSet spectral range for emission detection: Cerulean: 450-520 nm; Citrine: 520-580 nm.",
    "Focus on the single cell layer using transillumination light. Start imaging and adjust the z-position more precisely. Adjust gain and offset for each channel to distinguish signal from background while remaining well below saturation for all pixels in cells of interest.\nDraw circles to define the region of interest (ROI). Select cells that show similar fluorescence intensity. Avoid cells that obviously differ from the average cell in size and shape. Expose the cells to light for a time as short as possible to minimize photobleaching of the sensor. It is advisable to draw ROIs not very close to the cell perimeter. This area is most sensitive to changes in fluorescence intensity due to focal drift (cells moving in z-direction) making it more difficult to monitor changes in fluorescence ratio during the experiment.\nStart measurements with the confocal microscope. Wait until the cerulean and citrine fluorescence is stable.\nAdd 50-100 µl bile acids or other compounds at chosen time points during measuring. The relatively high amounts of liquid (one-fifth to one-third of the final volume) are necessary to mix the fluids well (within 10 sec) without shaking/pipetting up and down. Make sure not to touch the edge of the 8-well chamber with the pipette tip and add the liquid slowly so that the cells do not get out of focus. Do not add new compounds before the plateau phase is reached. This takes about 200 sec.\nEnd each experiment with the addition of 100 µl GW4064, end concentration 5-10 µM (sensor saturating dose) and wait until sensor fluorescence is stable.\nSave the experiment and export the data as an .AVI file.",
    "Open in ImageJ both AVI files (channel 00, cerulean; channel 01, citrine) by selecting Plugins > Stacks > Stack interleaver. Alternatively, import confocal file (e.g., .lsm or .lif files) directly in Image J using appropriate plugins (available at http://www.openmicroscopy.org) and move to step 4.1.14.\n\t\t\nFor Stack 1: use Channel 01 (citrine).\nFor Stack 2: use Channel 00 (cerulean).\nClick on Edit > Selection > Add to manager, to open the ROI manager window. Check the checkbox 'Show All'.\nDraw a few regions of interest (ROIs) covering specific cells with the oval selection tool. Also draw one circle in an area outside cells or inside a cell that does not express the sensor to determine the background signal. It is advisable to draw ROIs not very close to the cell perimeter in experiments when changes in fluorescence intensity due to focal drift (cells moving in z-direction) or cell migration were obvious.\nSelect one cell. Click on Plugins > Ratio Profiler. This will result in 3 screens: RAW, ratio and Ratio_Profile. The RAW window shows the increase in intensity of citrine (blue line) and a decrease in cerulean (red line) if there is FRET. The Ratio window gives information about the ratio citrine/cerulean, which will increase with an increase in FRET. The Ratio_Profile window gives the actual numbers of fluorescence intensity measured in both channels. If microscope setup-specific files (e.g., .lsm or .lif instead of .avi) files are used the channel order might be reversed.\nCopy the data from the Ratio_Profile window in the spreadsheet attached as supplementary data. Do the same for all the other cells (and background ROI).",
    "Note: In the online spreadsheet, all data is normalized to the condition at which maximum BAS activation is expected. Given that GW4064 is the most potent activator of FXR, the fluorescence ratio after incubation with a surplus of GW4064 is set to 1. It is therefore important to end all of the experiments with addition of GW4064. The advantage of this is that the data is no longer dependent on laser intensity or detector gain and experiments on different days can be compared more easily. Furthermore, in the bottom graph of the spreadsheet, a running average can be used to smooth the curves for experimental noise. However, do not use this graph when analyzing kinetic data, since the running average will also smooth fast kinetic responses.\nFRET measurements using Fluorescence Activated Cell Sorting (FACS)\n\t\nDilute all compounds for the FACS experiment in sterile FACS uptake buffer (0.3 mM EDTA, 0.5% BSA, 0.01% NaN3and 10 mM D-glucose).\nHarvest cells from an 80% confluent T-160 cm2 cell culture flask using 5 mM EDTA in PBS. Centrifuge cells at 250 x g for 5 min. Wash cell pellet 2x in 5 ml FACS uptake buffer at RT.\nCount cells using the coulter counter or a counting chamber.\nDilute pellet in FACS uptake buffer to a concentration of 1 x 106 cells/ml. Pipette up and down to create a homogeneous suspension of single cells. If cells are difficult to disaggregate, put the samples through a cell strainer before sorting to minimize nozzle clogs.\nPipet 200 µl cells per FACS tube and protect them from light.\nAdd the desired concentration of the compound (e.g., bile acids, synthetic FXR ligands, transporter inhibitors). Vortex. Incubate for 20-30 min at RT while shaking (in the dark).\nMeanwhile, start the FACS (the lasers need time to warm up).",
    "Set the flow cytometry gating parameters for the experiment (see Figure 3):\n\t\t\nLoad around 100,000-200,000 NucleoBAS or CytoBAS transfected cells to determine the gates.\nFirst adjust the FSC and SSC voltages to plot the cells in the center of the plot.\nUsing the violet laser, adjust the cerulean (450/40 nm) voltage value and citrine (525/20 nm) voltage and ensure that all NucleoBAS or CytoBAS positive cells are plotted within the scatter plot.\nSet the correct gates (Gate P1 up to Gate P4), see Figure 4.\n\t\t\t\nUse gate P1 to exclude dead cells, usually displayed in the lower left corner by selecting the main population in the middle of the SSC-A/FSC-A plot.\nUse gate P2 in the FSC-H/FSC-A window to remove duplets from analysis. Single cells are presented in a more diagonal line than doublets.\nGate P3 in the citrine (525/20 nm)/cerulean (450/40 nm) window can be used to select for NucleoBAS/CytoBAS positive cells, by gating citrine and cerulean high cells, a population displayed diagonally in the upper right corner of the plot.\nDraw gate P4 at the top left of the population, as close as possible and make sure that no more than 5% of the cells fall within this gate.\nLoad some untransfected cells (no expression of CytoBAS or NucleoBAS) to determine auto-fluorescence. The untransfected population may not be located in gate P3. Adjust gate P3 when necessary to exclude auto-fluorescent cells.\nVortex the samples before placing the tubes in the FACS. For each sample, measure at least 10,000 cells in gate P3.\n\t\tNote: The Population Hierarchy Window gives the number of events being displayed for each gate and % of the parent gate. In gate 4, the % of the parent states cells with an increased citrine/cerulean ratio as a percentage of all NucleoBAS positive cells.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}