{
  "id": 18049,
  "origin_website": "Jove",
  "title": "The Generation of Closed Femoral Fractures in Mice: A Model to Study Bone Healing",
  "procedures": [
    "The following procedure was performed with approval from the Indiana University School of Medicine Institutional Animal Care and Use Committee (IACUC). All survival surgeries were performed under sterile conditions as outlined by the NIH guidelines. Pain and risk of infections were managed with proper analgesics and antibiotics to ensure a successful outcome.\n1. Anesthesia and Preparation\nWeigh the mouse and anesthetize it with a mixture of ketamine (100 mg/kg) and xylazine (10 mg/kg) administered via the intraperitoneal (I.P.) route. Place the mouse in an empty cage and monitor it until it is fully sedated.\nEnsure that the mouse is sedated using a toe pinch reflex. Apply ophthalmic ointment to its eyes to protect them from drying out.\nRemove the fur from the right limb. Wipe down the surgical site with an iodine-based scrub and 70% ethanol. Scrub the surgical site starting at the center of the knee and making a circular sweep outward. Repeat this 3x with fresh scrubs, ending with 70% ethanol.\nAdminister a preoperative dose of buprenorphine hydrochloride analgesia (0.03 mg/kg) subcutaneously for the immediate postoperative pain management.\nPlace the mouse on a heating pad covered by a sterile surgical pad.\n2. Surgical Approach\nNOTE: Prior to the fracture, the weight and the drop height should be empirically determined for the specific strain, age, and sex of the mice prior to the surgery. This surgical procedure is optimized for C57BJ6 male mice at 10 weeks of age.\nPlace the mouse on its back and flex the knee of the operative leg. Using a scalpel blade, make a 1.5 cm incision centered over the knee joint.",
    "Laterally displace the patella using forceps to expose the distal end of the femur. Insert a 1.5-in long 25-gauge stainless steel hypodermic needle at the center of the trochlear groove, down the length of the medullary canal in a retrograde manner and through the proximal end of the femur. Take an X-ray to ensure the proper placement of the pin.\n\tNOTE: The needle should exit the dorsal side of the mouse to create a path for the guidewire.\nPass a 4-in long 36-gauge tungsten guidewire through the shaft of the needle, entering through the hub at the distal femur and exiting the bevel on the dorsal side of the mouse.\nFollowing the successful placement of the guidewire, carefully remove the 25-gauge needle by gently pulling on the hub while holding the limb and the guidewire in place. Confirm the placement of the guidewire by X-ray.\nHold a 391 g weight from a height of 34.6 cm above the impact disc (Figure 1A). Position the femur horizontally across the two supporting points, such that the intertrochanteric and supracondylar regions of the femur rest on the support anvils (Figure 1B) and the lateral side of the limb is facing the loading point (Figure 1C). Drop the weight and carefully remove the mouse from the device immediately following the fracture.\nConfirm the fracture location by X-ray.\nInsert the 24-gauge stainless steel hypodermic tubing over the guidewire to stabilize the fractured femur.\n\tNOTE: This application may require some force as the point of entry was generated using a needle of a smaller diameter. This difference in diameter effectively prevents a potential migration of the 24-gauge rod through the proximal end of the femur. The depth of insertion can be felt manually as the blunt tubing meets the cortical bone of the greater trochanter.",
    "Confirm the position of the steel rod and the stabilization of the fractured femur by X-ray before removing the guidewire.\nCut the excess tubing at the distal end of the femur using wire cutters. Bury the exposed tubing under the surface of the condyles using forceps to apply a gentle downward force, being careful not to dislocate the knee joint.\nReposition the patella using forceps. Close the incision site with a 5-0 absorbable suture.\n3. Postoperative Management\nFollowing surgery, the mice may be injected with up to 500 µL of sterile saline via the I.P. route to aid them in their postoperative recovery.\nMonitor the animals on a heated recovery bed until they awaken from surgery. Once ambulatory, return them to their cage.\nContinue to closely monitor the mice for several days after the surgery to ensure they are healing properly and regain mobility. Administer buprenorphine hydrochloride analgesia (0.03 mg/kg) subcutaneously every 6 h for 3 days following the surgery, and as needed thereafter. Avoid the use of non-steroidal anti-inflammatory drugs (NSAIDs) as they have been shown to impair bone healing after surgery.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}