{
  "id": 4279,
  "origin_website": "Bio",
  "title": "Dissociated Retinal Cell Culture",
  "procedures": [
    "Day before experimentCoat culture dishes with poly-L-lysine and lamininPrepare a 50% working solution of Poly L-lysine (PLL) by diluting the stock solution in sterile water. Add 1.5 ml of PLL solution to each 35 mm petri dish. Leave at RT for 60 min. Remove PLL and let dry in the hood. Wash three times with sterile water.Prepare the mouse laminin solution at a concentration of 5 µg/ml in cold Neurobasal medium. Add 1.5 ml of mouse laminin solution to the dish. Incubate for at least overnight in an incubator equilibrated at 37 °C and 8% CO2. 5% CO2 incubation is ok, but not optimal for the Neurobasal/DMEM/F12 medium mix. Longer incubation can be done and were found to improve quality of the prep.Prepare the “incomplete” retina growth medium (RGM)In a 50 ml conical tube, under sterile condition, add to following:10 ml of Neurobasal medium 10 ml of DMEM/F12 medium100 µl of N2 supplement 200 µl of B27 supplement 200 µl of 100x Pen/Strep (P/S) 200 µl of 6 mg/ml NAC 40 µl of 50 mM cpt-cAMP  20 µl of 10 mM Forskolin 200 µl of 2.5 mg/ml Insulin Filter sterilize the solution using a 0.22 µm filter previously rinsed with Neurobasal medium  and stored at 4 °C until needed.Day of ExperimentPrepare the solution needed (see Recipes for the preparation of the stock solutions)“Incomplete” RGM medium add the growth factors4 µl of EGF 250 µg/ml2 µl of b-FGF 100 µg/ml20 µl of BDNF 50 µg/ml5 µl of NT-3 100 µg/mlTo equilibrate the medium at the right temperature and pH, put the lid on the 50 ml tube and unscrew ¼ of a turn. Place the tube in the incubator at 37 °C and 8% CO2 until needed.",
    "Papain solutionIn a 15 ml conical tube add the following10 ml of DPBS5 µl of 1 N NaOH100 U of papain solution 100 µl of 0.4% DNase2 mg of L-cystein crystal (to be added only prior to using the solution for dissociation)Keep at 37 °C in a water bathLO-OVO solution9 ml of DPBS 1 ml of 10x LO-OVO 100 µl of 0.4% DNaseKeep at 37 °C in a water bathCulture procedure Note: The dissection should be carried out under sterile conditions. Spray the working area with 70% ethanol and use a flame. Sterilize all the instruments before use. Prepare two 100 mm dish filled with 10 ml of sterile DPBS, one to transfer the heads and the other to dissect the eyes and two 35 mm dish filled with 2 ml of sterile DPBS to collect the retinas.Collection of the embryosEuthanize the animal in a CO2 chamber. Place the animal on it’s back and clean the belly skin with 70% ethanol. Pinch the skin with a straight forcep, lift the skin and muscle and make a V shape opening using scissors on both side of the abdomen starting from the lower abdomen and cutting all the way to the side of the animal. Lift the skin and muscle upward to reveal the internal organs and uterus. Cut out the uterus and transfer it to a 150 mm dish.Remove the embryos from the uterus and decapitate the heads with sharp scissors.Transfer the heads to a 100 mm dish filled with DPBS.Dissection of the retinasCarefully remove the skin that covers the eye. Place a curved forcep of both side of the eye and apply a gentle pressure. The eye should pup out. Pinch the back of the eye and pull. Transfer the eye in a 100 mm dish filled with DPBS.",
    "With the lens facing downward, secure the eye in position with a fine forceps and remove the optic nerve (Figure 1, steps 1-2). Introduce the tip of another forceps through the optic nerve head and between the choroid and retina to secure the sclera. Now that the sclera is secured, you need to gently tear it open with both forceps from the optic nerve head to the cornea to expose the retina andlens (Figure 1, steps 3-4). Carefully detach the lens and place the retinas in a 35 mm dish filled with DPBS (Figure 1, steps 5-6). From E18-19 onward, it is required to remove the blood vessel covering the retina to avoid endothelial cell contamination in the culture. The blood vessels form a reddish membrane overlying the inner face of the retina. The membrane is easily removed by pinchingand pulling with a fine forceps.Transfer the retinas in a 35mm dish filled with DPBS. Using a fine scalpel, slice the retinas in small pieces (2 mm) to help the dissociation. The number of retinas to dissect depends on your need. Typically, the yield is about 0.5 x 106 cells for one E17 retina and 1.6 x 106 cells for one P0 retina. It is optimal to dissect at least 6 to 8 retina as it improve cell recovery.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140111/20140111025604_0256.jpgFigure 1. Dissection of the retina. Steps 1 to 5 show the procedure to dissect the retina from the eyeball. Step 6 shows the dissected retina and lens.Dissociation of the retinas (all these steps are done in the laminar flow hood)Digestion of the tissueTake out the papain tube from the water bath and add 2 mg of L-cystein. Transfer the pieces of retina in this tube.",
    "Return the tube in the 37 °C water bath and incubate 5 min if you are working with E17 retinas or 8 min if you are working with P0 retinas. Neutralisation of the enzyme activityTake out the tube from the water bath, let the pieces of retina settle in the bottom of the tube and remove the supernatant with gentle aspiration.  Slowly add 4 ml of LO-OVO solution over the pieces of retina.Let the pieces of retina settle in the bottom of the tube and remove the supernatant with gentle aspiration. Add 1 ml of LO-OVO solution.TriturationUsing the P1000, gently triturate up and down the pieces of retina to break them apart until the solution appears cloudy.Make sure that the cell suspension is well dissociated and that no clumps of cells remain by observing a small aliquot of the suspension under the microscope.If clumping is observed, triturate the suspension with a little more force until unicellular suspension is obtained. (If the cells are difficult to dissociate, the incubation time in papain can be increased). Be careful not to over triturate the cells, this could lead to decreased survival.Add the remaining 5 ml of LO-OVO solution to the cell suspension and centrifuge 11 min in a benchtop centrifuge at 200 x g at room temperature.PlatingTake out the RGM medium from the incubator. Aspirate the supernatant and gently resuspend the cell pellet in 1 ml of equilibrated RGM medium.Using the hemacytometer, count the number of total cells. For clonal density culture, add 5,000 cells per 35 mm dish, for low density culture, add 20,000 cells per 35 mm dish and for high density culture, add 100,000 cells per 35 mm dish. Dilute to right amount of cells in 1 ml of RGM medium and add it to the 35 mm dish.",
    "Place in the incubator at 37 °C with 8% CO2 for 2 h. Once the cells have adhered to the bottom of the dish, gently add another 1.5 ml of medium and replace in the incubator.FeedingFeed the cells every 3 to 4 days by removing 50% of the culture medium and adding the same amount of equilibrated RGM medium. In optimal conditions, the cells can be cultured for 10 to 14 days.Immunostaining of cultured cells Note: In these culture conditions, retinal progenitor cells will divide and differentiate into the different retinal cell types, normally produced from E17 (amacrines, bipolars, rod photoreceptors, and Müller cells). Various cell-specific markers can be used to identify the different retinal cell types. Nestin for retinal progenitor cells, Brn3b and neurofilamment 165 for ganglion cells, Rhodopsin and recoverin for rod photoreceptors, Islet-1 for bipolar cells and a subtype of amacrines and ganglion cells, whereas Pax-6 is a marker of retinal progenitor cells, amacrines and ganglion cells. Here, we provide a general protocol for immunostaining. Aspirate the culture medium and fix the cells by adding cold 4% PFA  for 15 min on ice.Rinse three times with 1x PBS.Block/permeabilize for 1 h at room temperature (RT) with block/permeabilization solution (20% goat serum + 0.4% Triton in 1x PBS).Prepare the primary antibody in 1 ml of block/permeabilization solution. Dilution to be used depend on the antibody.Incubate overnight at 4 °C.Discard primary antibody.Rinse three times with 1x PBS.Prepare the secondary antibody in 1 ml of block/permeabilization solution. The secondary antibody is usually used at a 1:1,000 dilution.Incubate 1 h at RT.Discard secondary antibody.Rinse three times with 1x PBS.To counterstain the nucleus, incubate in Hoechst solution (1 ml of Hoechst in 10 ml of 1x PBS) for 5 min at RT.Observe under inverted microscope.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140111/20140111025748_2806.jpgFigure 2.",
    "Phase contrast and immunostaining micrographs of dissociated cultures. A. Two retinal progenitor cells 18 h after plating. Retinal progenitors have a typical bipolar morphology. B. A dissociated retinal cell culture seen after 7 days in culture showing many differentiated neurons. C. Retinal progenitor cells stained for Nestin (red) 24 h after plating."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}