{
  "id": 15195,
  "origin_website": "Jove",
  "title": "High-Resolution Comparison of Bacterial Conjugation Frequencies",
  "procedures": [
    "1. Preparation of a Donor with Green Fluorescent Protein (GFP)- and Kanamycin Resistance Gene-Tagged Plasmids\nIntroduction of marker genes into the target plasmid pBP136\nNote: The goal of this protocol is to generate pBP136::gfp. The bacterial strains and plasmids used in this study are listed in Table 1.\n\t\nGrow cultures of Escherichia coli DH10B harboring pBP13617 in 5 mL of sterile Luria broth (LB) and E. coli S17-1λpir18 harboring pJBA2819 [containing a kanamycin (Km)-resistance gene and gfpmut3* gene with its promoter and terminator in a mini-Tn5] in 5 mL of sterile LB containing 50 μg/mL Km at 37 °C overnight (O/N, 16–24 h) with shaking at 200 revolutions per minute (rpm).\nHarvesting and washing\n\t\t\nHarvest 1 mL of each culture, place it into a 2 mL microtube, and centrifuge (10,000 × g, room temperature, 2 min). Then, discard the supernatant and resuspend the cell pellet in 2 mL of sterile phosphate buffered saline (PBS).\nCentrifuge again (10,000 × g, room temperature, 2 min), and resuspend in 500 μL of sterile PBS.\nFilter mating\n\t\t\nPrepare sterile LB plates (with 1.6% agar), and place a sterile 0.22 μm pore size membrane filter on it. Mix 500 μL of E. coli S17-1λpir harboring pJBA28 with E. coli DH10B harboring pBP136 and spot the mixture on the filter on the LB plate. Incubate the plate O/N at 30 °C. Remove the filter from the LB plate, place it into a sterile 50 mL plastic tube, and add 1 mL of sterile PBS.",
    "Note: pJBA28 can replicate in the presence of Π protein, encoded by the pir gene18, and can be transferred from S17-1λpir to DH10B. pBP136 carries no marker gene17 and can be transferred from DH10B to S17-1λpir. Therefore, we could not distinguish S17-1λpir harboring pBP136 and pJBA28 from DH10B harboring pBP136 and the mini-Tn5 (transposed into the chromosome or pBP136) at this stage. Then, we used mixtures of them as donors in subsequent steps (1.1.4.–1.1.5.).\nGrow an O/N culture of the above mating mixture in sterile LB containing 50 μg/mL Km at 37 °C with shaking at 200 rpm and a culture of Pseudomonas putida KT2440 [Km-sensitive (Kms), rifampicin-sensitive (Rifs), gentamicin-sensitive (Gms), and tetracycline resistant (Tcr)] in medium containing 12.5 μg/mL Tc at 30 °C with shaking at 200 rpm.\nAfter harvesting and washing the cells as in step 1.1.2, use them (the mating mixture and KT2440) for filter mating (O/N, 30 °C) as in step 1.1.3.\nPrepare sterile LB plates containing 50 μg/mL Km and 12.5 μg/mL Tc (LB + Km + Tc plates).\nDilute the resuspended mixture on the membrane filter with sterile PBS (101–105-fold), and then spread each dilution onto LB + Km + Tc plates and incubate the plates at 30 °C for 2–3 d.\nPick colonies from the plates, grow an O/N culture in sterile LB containing Km and Tc as well as P. resinovorans CA10dm4RG (Rifr and Gmr)6 in sterile LB containing Rif (25 μg/mL) and Gm (30 μg/mL) at 30 °C and 200 rpm.",
    "Note: As described in the previous note, the colonies on the LB + Km + Tc plates (from 1.1.7.) may be KT2440 harboring pBP136 carrying a mini-Tn5 and KT2440 with a mini-Tn5, because pJBA28 could be directly transferred from S17-1λpir harboring pBP136 and pJBA28 to KT2440. This is why another mating with P. resinovorans CA10RG is required to obtain the target pBP136 with a mini-Tn5 in the following steps.\nAfter harvesting and washing the cells as in step 1.1.2, use them for filter mating (O/N, 30 °C) as in step 1.1.3.\nPrepare sterile LB plates containing Rif, Gm, and Km (LB + Rif + Km + Gm plates).\nResuspend the mixture on the filter and then dilute it 101–105-fold, spread it onto LB + Rif + Km + Gm plates, and incubate the plates for 2–3 d at 30 °C.\nPick the colonies and check if they harbor pBP136 by PCR using specific primers for the plasmid.\nIntroduction of a selective marker gene into the target plasmid pCAR1\n\tNote: The goal of this protocol is to generate pCAR1::gfp\nGrow an O/N culture of P. putida KT2440 harboring pCAR1 (Kms, Gms, Rifs, Tcr)20 at 200 rpm and 30 °C and E. coli S17-1λpir18 harboring pJBA28 in 5 mL of sterile LB containing 50 μg/mL Km at 200 rpm and 37 °C.\nAfter harvesting and washing the cells as in step 1.1.2, use them for filter mating (O/N, 30 °C) as in step 1.1.3.\nRemove the filter from the LB plate, place it into a sterile 50 mL plastic tube, and add 1 mL of sterile PBS.\nDilute the resuspended mixture with sterile PBS (101–105-fold), and spread the diluted mixture onto sterile selective LB + Tc + Km plates.",
    "Note: pCAR1 does not replicate in E. coli; thus, P. putida KT2440 harboring pCAR1 with a mini-Tn5 can be selected on LB + Tc + Km plates.\nPick a colony from the plate, and grow an O/N culture in sterile LB containing Km and Tc and a culture of P. resinovorans CA10dm4RG in sterile LB containing Rif and Gm (200 rpm, 30 °C).\nAfter harvesting and washing as in step 1.1.2, use the cells for filter mating (O/N, 30 °C) as in step 1.1.3.\nResuspend the mixture on the filter and then dilute it, spread onto LB + Rif + Km + Gm plates, and incubate the plates for 2–3 d at 30 °C.\nPick the colonies and check if they harbor pCAR1 by PCR with specific primers for the plasmid.\nConfirm the transferability of the tagged-plasmids and prepare the donors for the next steps\n\tNote: The goal of this protocol is to confirm the transferability of the above constructed plasmids and prepare the donors for the next steps.\n\t\nGrow an O/N culture of P. resinovorans CA10dm4RG harboring pBP136::gfp or pCAR1::gfp in sterile LB containing Km and a culture of P. putida SMDBS [Kms, Gms, Rifr, Tcr, lacIq, in which PA1/O4/O3-gfpmut3* is not expressed because of its chromosomal lacIq gene]21 in 3 mL of LB containing Tc (200 rpm, 30 °C).\nAfter harvesting and washing the cells as in step 1.1.2, use them for filter mating (O/N, 30 °C) as in step 1.1.3.\nPlace the filter into a sterile 50 mL plastic tube, and resuspend with 1 mL of sterile PBS. Dilute the resuspended mixture with sterile PBS (101–105-fold), spread the diluted mixture onto sterile selective LB + Tc + Km plates.\nPick the colonies and check if they harbor each of the plasmids by PCR with specific primers.",
    "Note: Confirmation of the insertion position of the mini-Tn5 by direct sequencing after plasmid extraction is optional, to confirm that the insertion does not affect the transfer function of the plasmids.\n2. Calculation of Conjugation Frequency by the MPN Method\nPrepare sterile LB + Km and LB + Gm plates.\nGrow an O/N culture of P. putida SMDBS harboring pBP136::gfp or pCAR1::gfp in 3 mL of sterile LB containing Km and a culture of P. putida KT2440RGD (Gmr, Rifr) in 3 mL of LB containing Gm (140 rpm, 30 °C).\nAfter harvesting and washing the cells as in step 1.1.2, use them for filter mating at 30 °C for 45 min as in step 1.1.3.\nSerially dilute the above donor and recipient culture (101 –107) and spread it onto LB + Km (donor) or LB + Gm (recipient) plates (each in triplicate) to count the colony forming units (CFU). Incubate the plates at 30 °C for 2 d.\nResuspend the mixture on the filter in sterile LB containing Km and Gm, and serially dilute (from 21 to 224–107.2) using a 96-well cell culture plate (in quadruplicate).\nIncubate the 96-well plate for the appropriate time (2 d at 30 °C).\nCount the CFU of the donor and recipient on the plates (step 2.4.) and count the number of wells in which the transconjugants grow.\nCalculate the MPN and its deviation by using the MPN calculation program developed by Jarvis et al.22, which is available at http://www.wiwiss.fu-berlin.de/fachbereich/vwl/iso/ehemalige/professoren/wilrich/MPN_ver5.xls.\n\t\nEnter the name of the experiment (ex., ‘test’), the date of the experiment (ex., 2018/4/9), the number of test series, and the max. no. of dilutions (enter ‘24’) in row #7 of the ‘Program’ sheet of the Excel file (‘MPN_ver5.xls’).",
    "Enter ‘2-1 (= 0.5) to 2-24 (= 5.96 × 10-8)’ in the ‘dilution factor d’ column, ‘0.01’ in ‘volume in ml or g w’ column, and ‘4’ in ‘No. of tubes n’ in the automatically produced tables of ‘input data’.\nEnter the number of wells in which the transconjugants grow at each sample dilution (0–4).\nPush the upper right ‘Calculate Results’ button, and then obtain the results (in MPN/μL) and their 95% confidence limits (lower and upper).\nCalculate the conjugation frequency of the plasmids by dividing the number of transconjugants (MPN/mL) by the numbers of donor and recipient cells (CFU/mL).\n3. Preparation for Estimation of the Probability of Donor-Initiated Conjugation\nGrow an O/N culture of P. putida SMDBS harboring pBP136::gfp or pCAR1::gfp in 3 mL of sterile LB containing Km and a culture of P. putida KT2440RGD (Gmr, Rifr) in 3 mL of sterile LB containing Gm using 300 mL flasks (140 rpm, 30 °C) as precultures.\nTransfer 200 μL of the preculture into 200 mL of fresh sterile LB containing Km or Gm in 500 mL flasks and incubate at 30 °C with shaking at 140 rpm.\nMeasure the turbidity at 600 nm (OD600) of the culture using a UV-VIS spectrophotometer and spot the culture, diluted in LB (101–108-fold dilutions), onto an LB plate containing Km or Gm. Incubate these LB plates at 30 °C for 1–2 d, and determine the CFU.\nPlot the OD600 values and the CFU with growth time to generate growth curves of the donor and recipient.\nGrow cultures of the donor and recipient strain to mid-log phase, based on the growth curve.\nAfter harvesting and washing the cells, prepare 101–103 CFU of the donor in 10 μL of LB and 105–107 CFU of the recipient in 100 μL of LB.",
    "Mix 10 μL of the donor and 100 μL of the recipient cultures at different densities in 96-well plates (in triplicate). For example, mix 101 CFU of the donor and 105 CFU of the recipient and add it to each of the 96 wells, and mix 101 CFU of the donor and 106 CFU of the recipient in another 96-well plate, and so on.\nIncubate the mixture at 30 °C for 45 min, and then add high concentrations of antibiotics (100 μg/mL Km and 60 μg/mL Gm) to each well to inhibit further conjugation.\nIncubate the plate at 30 °C for 2 d.\nCount the number of wells in which transconjugants grow.\nChoose the recipient density that is appropriate for estimation of the probability of donor-initiated conjugation based on the above data (transconjugants should be found in at least 1 well of a 96-well plate).\nNote: Transconjugants will grow in all wells when the densities of the donor and recipient cells are high and more than one conjugation occurs in a well. In contrast, no transconjugants will be found in any wells when the cell density is too low. In the following section, a single donor cell is sorted into a well. Therefore, the recipient density should be at maximum.\n4. Estimation of the Probability of Donor-Initiated Conjugation\nPrepare 200 mL of a mid-log phase culture of donor P. putida SMDBS harboring pBP136::gfp or pCAR1::gfp and that of recipient P. putida KT2440RGD, as described in 3.6–3.7.\nPlace 106 CFU of the recipient in 100 μL of LB in each well of a 96-well plate.",
    "Set up the FACS system (flow cytometry and cell sorter with a robotic arm, a 488 nm argon laser, and a 70 μm nozzle orifice). Set to forward scatter (FSC), with a 1% threshold as the acquisition trigger. Tune the H gain and A gain of the FSC and side scatter (SSC) at maximum sensitivity, which can exclude false positive signals, using PBS as a negative control. Set the sort gate based on FSC and SSC and 0.5 drop sort mode for maximal sort purity.\nSort a single donor cell by FACS on an LB plate (384 different spots), incubate the plate at 30 °C for 2 d, and then count how many colonies appear on the plate from the sorted cells.\nNote: This procedure is for validation of the set gate. If there are 384 colonies on the plate, it means that 100% of the sorted cells could form colonies. The average validity of the sorting is always 90–95%.\nSort a single donor cell by FACS into each well of a 96-well plate with the recipient (4.2).\nIncubate the plate for 45 min at 30 °C, and then add high concentrations of antibiotics (100 μg/mL Km and 60 μg/mL Gm) to each well to prevent further conjugation.\nIncubate the plate at 30 °C for 2 d.\nCount the number of wells in which transconjugants grew as determined by visual inspection with the naked eye.\nCalculate the probability of donor-initiated conjugation by dividing the number of wells with transconjugants by the total number of wells in which the donor was sorted.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}