{
  "id": 8526,
  "origin_website": "Jove",
  "title": "Reliable Isolation of Central Nervous System Microvessels Across Five Vertebrate Groups",
  "procedures": [
    "All procedures of the present study are in accordance with the guidelines set by the University of California (UC), Davis Institutional Animal Care and Use Committee (IACUC). Animal care at UC Davis is regulated by several independent resources and has been fully accredited by the Association for Assessment and Accreditation of Laboratory Animal Care International (AAALAC) since 1966. Porcine CNS tissues were obtained from UCD Department of Animal Sciences, Meat Sciences Laboratory. CNS tissues from rhesus macaques were obtained from the California National Primate Research Center Pathology Department (NIH P51OD011107). No anesthesia, euthanasia, or necropsy was performed by laboratory staff on pigs and macaques. Therefore, there are no particular recommendations regarding these matters.\nNOTE: This method was validated for multiple species, but the provided protocol corresponds more directly to mouse and porcine tissues. Details pertaining to the optic lobe do not apply when using mammalian specimens. All biohazardous materials must be handled in an appropriate biosafety level (BSL) facility. All acutely toxic materials must be handled underneath a fume hood. All biohazardous medical waste and acutely toxic waste must be disposed of properly.\n1. Preparation\nPrepare solutions (Table 1) at least one day ahead.\n\tNOTE: It is very difficult to dissolve 70 kDa molecular weight (MW) dextran. It is more efficient to let the solution stir overnight covered with either paraffin film or foil. The protocol requires the use two different MV-2 solutions depending on the specimen under investigation. The 18% dextran efficiently separates the myelin from the microvessel pellet when performing the protocol on small lissencephalic specimens. However, it develops a smear of myelin within the interface of CNS tissues from large gyrencephalic specimens, as well as the hypothalamus and the pituitary from small specimens. This smear is prevented by using 20% dextran.",
    "Prepare well-slides by loading 50 µL per well of poly-D-lysine and let dry for 2 h at room temperature (RT), preferably in a biological safety cabinet-class 2 (BSC-2). Do not overdry. Rinse twice with phosphate-buffered saline (PBS) and keep in the fridge until ready to use.\n2. CNS Tissue Dissection from Small Lissencephalic Vertebrate Specimen\nNOTE: The article demonstrates the application of the protocol on a C57BL6/J, 10 week-old, ~25 g, male mouse.\nPrepare two 15 mL conical tubes and a 1.7 mL microcentrifuge tube with 5 mL and 1 mL, respectively, of MV-1 solution per specimen. Keep tubes on ice.\nAnesthetization\n\t\nAnesthetize mice by intraperitoneal injection of a ketamine, xylazine, and acepromazine anesthetic cocktail at 100/10/3 mg per kg body weight and spray with 70% ethanol. Confirm anesthesia by assessing the absence of palpebral and pedal reflexes by touching an eye and pinching a foot, respectively.\nAnesthetize pigeons by inhalation of 5% isoflurane using an induction anesthesia box.\nAnesthetize fish and frogs in 1% Tricaine in either a fish holding water tank or amphibian Ringer's solution (Table of Materials), respectively.\nAnesthetize lizards by cooling at 4 °C prior to euthanasia.\nDecapitate the animal with surgical scissors, peel away the skin with forceps to expose the skull, and cut with LaGrange scissors through the foramen magnum (Figure 1A).\nDissect the brain out with a spatula and transfer to a 15 mL conical tube with MV-1 solution. Keep tube on ice.\nRetrieve the pituitary from the skull's sella turcica with forceps and transfer to a 1.7 mL microcentrifuge tube with MV-1 solution. Keep tube on ice.\nRemove the skin and muscle to expose the vertebral column. Cut out the limbs, rib cage, and internal organs (Figure 1B).",
    "Dissect the spinal cord by one of the two methods described below. Then, transfer to a 5 mL conical tube with MV-1 solution. Keep tube on ice.\n\t\nPerform laminectomy by cutting in a rostral to caudal direction with LaGrange scissors, starting through the cervical vertebral foramen, until reaching the lumbar cord.\nPerform flushing in a caudal to rostral direction throughout the lumbar vertebral foramen with an 18 G needle and 10 mL syringe loaded with MV-1 solution (Figure 1C,D).\n\t\tNOTE: This method only works with very small specimens, mostly rodents (<100 g).\nUsing a dissecting scope, cut the dural sac from the spinal cord with spring scissors and remove the remaining meninges with a double-pronged pick (Figure 2).\nTransfer the brain to a Petri dish and, using a dissecting scope, remove the meninges with a double-pronged pick (Figure 2A–C).\nExcise the olfactory bulbs and thalamus with forceps, iris scissors, and spring scissors. Using the double-pronged pick, remove the choroid plexus from all the brain ventricles. Make sure to remove all the choroid plexus.\n\tNOTE: The choroid plexus and olfactory bulbs are a massive source of contamination. In contrast to the BBB, these capillaries are highly fenestrated and the results of the subsequent experiments will be compromised if they are not removed.\nUsing forceps, separate the distinct CNS regions: cortex, cerebellum, brainstem, optic lobe (not on mammalian specimens), and hypothalamus.\n3. CNS Tissue Dissection from a Large Gyrencephalic Vertebrate Specimen\nNOTE: This protocol uses porcine CNS tissues obtained from an abattoir. Therefore, no anesthesia, euthanasia, or necropsy is described or shown here.\nTransport porcine CNS tissues in a 0.946 L (32 oz) histology container loaded with MV-1 solution inside an ice chest/bucket.",
    "Using a dissecting scope, remove the meninges with a double-pronged pick, forceps, iris scissors, and spring scissors from each CNS tissue. Make sure to remove any pieces of choroid plexus from the brain ventricles.\n4. CNS Tissue Homogenization\nNOTE: It is more efficient when two investigators engage in the homogenization process: one dissecting the meninges under the stereoscope and the other homogenizing the minced tissues. This way, the tissues are quickly returned to the ice bucket and kept cold.\nPlace each CNS region on a Petri dish with ~1 mL of MV-1 solution. Using a single-edge blade, mince the tissue to obtain 1–2 mm pieces.\n\t\nFor a small vertebrate specimen, use a 100 mm x 20 mm Petri dish.\nFor a large vertebrate specimen, use a 150 mm x 15 mm Petri dish.\nHomogenization of a small vertebrate specimen (Table 2 and Table 3)\n\t\nTransfer the cortex, cerebellum, brainstem, optic lobe, and spinal cord to ~1 mL of MV-1 solution in an individual 10 mL Potter-Elvehjem glass tissue grinder with a PTFE pestle using a transfer pipette. Add 5 mL of MV-1 solution and homogenize each tissue (~10 strokes). Transfer to individual 15 mL conical tubes. Keep tubes on ice.\n\t\tNOTE: For a small vertebrate, 5 or 4, with or without optic lobe, respectively, 10 mL Potter-Elvehjem grinders and 15 mL conical tubes are needed.\nTransfer the hypothalamus and pituitary with forceps to ~100 µL of MV-1 solution in an individual 1.7 mL tube and carefully homogenize with a glass micropestle. Rinse each micropestle with ~1 mL of MV-1 solution. Keep tube on ice.\n\t\tNOTE: For a small vertebrate, 2 glass micropestles and 1.7 mL tubes are needed.\nHomogenization of a large vertebrate specimen (Table 4 and Table 5)",
    "Using a transfer pipette, transfer the minced tissue to a 55 mL Potter-Elvehjem glass tissue grinder with a PTFE pestle and attach to overhead stirrer. Add half of the recommended volume of MV-1 solution, according to the specific CNS portion being homogenized (Table 5).\nTurn on the overhead stirrer at very low speed (~150 rpm) and carefully move the glass tube up and down for about 30 s.\nTurn off overhead stirrer, add more MV-1 solution, and repeat step 4.3.2 until obtaining a homogenous slurry.\nTransfer to a 50 mL conical tube. Keep tube on ice.\nWash the grinder with deionized water between each CNS tissue homogenization.\n\t\tNOTE: For a large vertebrate 5 or 4, with or without white matter, respectively, 50 mL conical tubes are needed. Likewise, two (2) 15 mL conical tubes are needed for the hypothalamus and pituitary.\n5. Microvessel Purification\nCentrifuge tissue homogenates resulting from step 4.2.1, 4.2.2, or 4.3.4 at 2,000 x g for 10 min at 4 °C. A large white interface of myelin will form on the top of the reddish microvessels' pellets. Discard the supernatants.\n\t\nSmall vertebrate specimen (Table 2 and Table 3)\n\t\t\nResuspend the cortex, cerebellum, brainstem, optic lobe, and spinal cord pellets in 5 mL of ice-cold MV-2 solution with a 5 mL serological pipette (~10 flushes). Add 5 mL of ice-cold MV-2 solution to each suspension and carefully mix by flipping the tubes.\nResuspend the hypothalamus and pituitary pellets with 1 mL of MV-2 solution.\nLarge vertebrate specimen (Table 4 and Table 5)",
    "Add 20 mL of ice-cold MV-2 solution to the cortex, cerebellum, brainstem, and spinal cord microvessel pellets. Resuspend the pellets by mixing on a tube revolver shaker, stirring at 40 rpm for ~5 min. Balance the conical tubes' volumes of the cortex, cerebellum, brainstem, and spinal cord suspensions by adding more MV-2 solution.\nResuspend the hypothalamus and pituitary microvessel pellets in 5 mL of MV-2 solution with a 5 mL serological pipette (~10 flushes). Add 5 mL of ice-cold MV-2 solution to the suspensions and carefully mix by flipping the tube.\nCentrifuge at 4,400 x g for 15 min at 4 °C.\nCarefully detach the thick and dense myelin layer on the liquid interface from each tube's walls by slowly rotating the tubes and allowing the supernatant to pass along the walls.\nDiscard the myelin and liquid interface and blot the inside wall of each tube with a spatula wrapped with a low-lint paper wipe. For small vertebrate specimens, remove myelin layer from each hypothalamus and pituitary tube by suctioning carefully with a transfer pipette.\nWipe out excess liquid with a twisted low-lint paper wipe. Resuspend each pellet with 1 mL of MV-3 solution using low-binding tips. Keep tubes on ice.\n6. Microvessel Elution and Filtration\nPour ice-cold MV-3 solution in individual beakers for each CNS region. Keep at 4 °C.\n\t\nFor small vertebrate specimens, use 10 mL of MV-3 solution per 50 mL beaker. A total of 6–7 beakers is necessary depending on whether or not the optic lobe is included.\nFor large vertebrate specimens, use 30 mL of MV-3 solution per 100 mL beaker. A total of 6–7 beakers is necessary depending on whether or not white matter is included.",
    "Place a cell strainer on top of a 50 mL conical tube. Use one per CNS region. Use a 100 µm strainer for the cortex, brainstem, optic lobe, spinal cord, and pituitary. Use a 70 µm cell strainer for the cerebellum and hypothalamus.\nWet each strainer with 1 mL of ice-cold MV-3 solution.\nAdd more MV-3 solution to the suspensions prepared in step 5.5 with a serological pipette while mixing to avoid aggregates. Carefully load microvessels on top of the strainer. Rinse with ice-cold MV-3 solution.\n\t\nFor small vertebrate specimens (Table 2 and Table 3), add 10–15 mL of MV-3 solution with a serological pipette and rinse with 5 mL of MV-3 solution.\nFor large vertebrate specimens, add 20 mL of MV-3 solution with a serological pipette and rinse with 10 mL of MV-3 solution.\nAssemble the filtration unit by placing a 20 µm nylon net filter on a modified filter holder (Figure 2D), one per CNS region.\n\t\nFor small vertebrate specimens (Table 2 and Table 3), use 25 mm modified filter holders for the cortex, cerebellum, brainstem, optic lobe, and spinal cord. Use 13 mm modified filter holders for the hypothalamus and pituitary.\nFor large vertebrate specimens (Table 4 and Table 5), use 47 mm modified filter holders for the cortex, cerebellum, brainstem, and spinal cord. Use 25 mm for the hypothalamus and pituitary.\nPlace filter on top of a 50 mL conical tube and wet filter with 5 mL of ice-cold MV-3 solution making sure buffer pours down the filter holder to the conical tube.\nTransfer the eluted microvessels (from step 6.4) on top of the 20 µm nylon net filter and rinse the microvessels with 5–10 mL of ice-cold MV-3 solution.",
    "Recover the filter using clean forceps and immerse it in the beaker containing the ice-cold MV-3 solution prepared in step 6.1.\nDetach the microvessels from the filter by shaking it gently for about 30 s. For small vertebrate specimens, pour the beaker content in a 15 mL conical tube. For large vertebrate specimens, pour the beaker content in a 50 mL conical tube.\nCentrifuge at 2,000 x g for 5 min at 4 °C and resuspend the pellet in 1 mL of ice-cold MV-3 solution using a low-binding pipette tip.\n\t\nFor small vertebrate specimens, transfer the suspension (from step 6.10) into a 1.7 mL microcentrifuge tube and centrifuge at 20,000 x g for 5 min at 4 °C.\n\t\tNOTE: This spin is performed on a benchtop centrifuge at maximum speed (~20,000 x g) to ensure a robust yield.\nFor large vertebrate specimens, transfer the suspension from step 6.10 into a 5.0 mL microcentrifuge tube, add 4 mL of MV-3 solution, and centrifuge at 2,000 x g for 5 min at 4 °C.\n7. Immunostaining\nNOTE: Hematoxylin and eosin (H&E) staining was performed on reptile, amphibian, and fish specimens as a proof-of-concept of the protocol feasibility. Therefore, there is no recommendation for immunolabeling for these specimens.\nRemove the supernatant from the microcentrifuge tubes.\nResuspend the pellet in 1x sterile PBS using a low-binding pipette tip (Table of Materials). Keep the microvessels from forming aggregates by pipetting multiple times. For small vertebrate specimens (Table 3), use ~100 µL–2,000 µL according to the pellet size. For large vertebrate specimens (Table 5), use ~1,000 µL–4,000 µL according to the pellet size.\nUsing a low-binding pipette tip, transfer the microvessels to well slides, being careful to add them to the center of each well, avoiding the sidewalls.",
    "Set the well slides, uncovered, inside a BSC-2, and let dry for 20 to 30 min at RT.\n\tNOTE: A relatively high volume of 1x PBS is used to avoid aggregate formation. Because of this, it is necessary to let the slides dry prior to fixation to make sure the microvessels are being held by the poly-D-lysine coating.\nRemove residual 1x PBS by pipetting out with a transfer pipette, add 200 µL of 4% paraformaldehyde (PFA) and incubate for 30 min at RT.\nPipette out the fixative solution and wash 3x with 200 µL of 1x PBS for 5 min at RT.\n\tNOTE: H&E staining on fish, amphibian, and reptile CNS microvessels was performed at this point.\nAdd 200 µL of blocking buffer to the well slide and incubate for 60 min at 37 °C.\nRemove the blocking buffer with a transfer pipette and add 200 µL of the primary antibody cocktail in antibody diluent (Table of Materials). Incubate at 4 °C overnight.\nPipette out the primary antibody cocktail and wash 3x with 200 µL of 1x PBS for 5 min at RT.\nLoad the secondary antibody cocktail (Table of Materials) diluted in 1x PBS and incubate for 2 h at RT, protected from light.\nPipette out the secondary antibody cocktail and wash 3x with 200 µL of 1x PBS for 5 min at RT, protected from light. After the last wash detach the well-slide's frame and blot-dry any excess 1x PBS with a low lint paper wipe.\nAdd a coverslip, liquid antifade mountant medium, and 4′,6-diamidino-2-phenylindole (DAPI) for nuclear staining. Let dry overnight at RT protected from light.\nOnce dry, keep protected from light on a slide box at 4 °C until ready for confocal microscopy and data acquisition.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}