{
  "id": 12093,
  "origin_website": "Jove",
  "title": "Important Endpoints and Proliferative Markers to Assess Small Intestinal Injury and Adaptation using a Mouse Model of Chemotherapy-Induced Mucositis",
  "procedures": [
    "All methods described were conducted in accordance with the guidelines of Danish legislation governing animal experimentation (1987). Studies were performed with the permission from the Danish Animal Experiments Inspectorate (2013-15-2934-00833) and the local ethical committee.\nNOTE: Female C57BL/6J mice (~20−25 g) were obtained and housed eight per cage in standard 12 h light, 12 h dark cycle with free access to water and standard chow. Animals were left to acclimatize for one week before experiments began.\n1. Induction of mucositis using 5-fluorouracil\nObtain 5-fluorouracil (5-FU) in a 50 mg/mL solution.\nWeigh and record the body weight of the mice. From the body weight, calculate the amount of 5-FU for injection (e.g., 400 mg/kg).\nPrepare a 1 mL syringe connected to a 27 G x 30 mm needle and fill the syringe with the calculated amount of 5-FU for injection.\nRestrain the mouse by the scruff method. To do this, grab the base of the tail with one hand and place it on a toe-gripping surface, such as a wire bar lid. While positioning the tail with one hand, hold the scruff of the neck with the other hand.\nFirmly position the body of the mouse across one hand by extending the forefinger and thumb back as far as possible. Place the tail between the fingers of this same hand to secure the mouse.\nWhile maintaining the mouse in a firm but gentle grip, expose the ventral side of the mouse and insert the needle into the intraperitoneal cavity on the lower right or left quadrant of the abdomen. Aspirate to ensure proper placement and inject the 400 mg/kg 5-FU.\n2. Tissue collection\nAnesthetize the mouse with an intraperitoneal injection of ketamine/xylazine (100/10 mg/kg) diluted in saline solution (0.9% NaCl). Monitor the depth of anaesthesia by observing the pinch withdrawal reflex.",
    "NOTE: The anaesthesia is a non-recovery anaesthesia.\nRecord the weight of the anesthetized mouse.\nPlace the mouse in a supine position and perform a laparotomy to expose the abdominal cavity, followed by an incision of the chest cavity to introduce pneumothorax.\nUsing scissors, sacrifice the animal by cutting open the diaphragm.\nRemove the small intestine. Cut superior to the pylorus, carefully retract the small intestine away from the carcass until the cecum is reached and make a cut just before the cecum.\nUsing forceps, gently clamp the proximal lumen shut. Using a 1 mL syringe with a 25 G needle attached, flush the small intestine with saline to remove the feces.\nGently remove the saline from the intestinal lumen with surgical instruments.\nPlace the small intestine on clean blotting paper to carefully remove excess saline.\nRecord the weight of the flushed tissue.\nCalculate the flushed small intestinal weight as a percentage of body weight.\n3. Small intestine histology\nTissue preparation\nIn a fume hood, use scissors to cut 3 cm sections of the flushed intestinal tissue from each mouse from the duodenum, jejunum and ileum and fixate sections in 10% formalin for 24 h at room temperature.\n\t\tNOTE: The fixative volume should be 5−10 times of the tissue volume.\nTransfer the fixed tissue to a cutting board.\nUsing a scalpel, trim the tissue to approximately 1 cm and transfer into an embedding cassette.\n\t\tNOTE: The cassette should be labelled with the sample identification (ID) in pencil.\nSubmerge the cassette in 70% ethanol and store at 4 °C until further processing.\nTissue embedding in paraffin",
    "Dehydrate the tissue by placing in ascending alcohol solutions. Place the cassette in 70% ethanol for 1 h, followed by 80% ethanol for 1 h, 95% ethanol for 1 h and 100% ethanol for 1.5 h. Transfer the cassette from 100% ethanol to xylene for 1.5 h.\nImmerse the cassette with paraffin wax heated between 58−60 °C. Use forceps to position the tissue in a transverse orientation and leave the blocks to cool more than 24 h until solid.\nCutting tissue using a microtome\nPlace block, tissue face down on ice for 5 min. Using a microtome, trim the paraffin blocks at a thickness of 10−30 µm to expose the tissue surface.\nCut cross-sections of the tissue block between 3−5 µm, making transverse sections from the duodenum, the jejunum and the ileum.\nPlace paraffin ribbon in a water bath set between 40−45 °C. Use forceps to separate the sections.\nUse microscope slides to pick up the sections from the water.\nAir dry the slides for 30 min before staining.\n\t\tNOTE: For storage over a longer period of time, store slides in a fridge.\nHematoxylin-eosin staining of tissue\nPlace the microscope slides in a histology cradle. Deparaffinize the slides in a heating cabinet set at 60 °C for 60 min.\n\t\tNOTE: Slides directly from the fridge should be left to reach room temperature before placing them in a heating cabinet.",
    "In the fume hood, rehydrate the tissue in 3 changes of a clearing agent (Table of Materials), make 20 dips in the first clearing agent jar and then let them stand for 7−8 min in each of the two additional clearing agent jars. Transfer the slides to descending alcohol solutions, start with 3 changes of 99% ethanol, followed by 2 changes of 96% ethanol and 70% ethanol. Make a minimum of 20 dips in each jar. Transfer to running water and let the slides stand for 5 min.\nImmerse the slides in filtered Meyer’s hematoxylin for 1 min.\nWash the samples in running tap water for 5 min.\nImmerse sections in the eosin stain for 1−2 min, then rinse in tap water.\nDehydrate the tissue by placing in ascending alcohol solutions. Start with 70% ethanol, followed by 96% ethanol, 96% ethanol, and 4 times 99% ethanol. Make a minimum of 20 dips in each jar, and let the cradle stand in 99% ethanol until they are mounted.\nMount coverslips by applying a small amount of the mounting medium to the surface of the slides. Put the coverslip on top of the mounting medium without creating bubbles under the coverslip. Let it dry for 24 h.\nExamine the tissue using a light microscope connected to a camera to obtain histological photos. Use a 10x objective to take snapshots until a full coverage of the tissue slide is reached.\n4. Measurement of crypt depth and/or villus height\nDownload and install the analysis software (i.e., Zen Lite, Table of Materials).\nOpen the image in the software and connect to the camera. Take snapshots in camera mode with 20x objective.\nIn processing mode, open the snapshot.",
    "To measure the crypt depth: in the 2D view, select the line tool from the graphics tab. Choose a well-orientated crypt and start the line at the bottom of a villus and finish at the bottom of the crypt. Repeat this action for 20 well-orientated crypts (Supplementary Figure 1).\nTo measure the villus height: in the 2D view, select the line tool from the graphics tab. Choose a well-orientated villus and start the line at the end of the luminal projection and finish at the start of the crypt. Repeat this action for 20 well-orientated villi (Supplementary Figure 1).\nSwitch from 2D view to the Measure view to display the measurements.\nExport the measurements and calculate the average of the crypt depth and villus height.\n5. BrdU quantification (proliferation) by immunohistochemistry\nInjection of the BrdU solution\nWeigh and record the body weight of the mice.\nIn a fume hood, prepare a representative amount of 0.5% w/v bromodeoxyuridine (BrdU) solution in phosphate buffered saline (PBS).\nIn the fume hood, inject 50 mg/kg of BrdU by intraperitoneal injection.\n\t\tNOTE: To ensure that each mouse is euthanized at exactly 150 min post BrdU injection, inject each individual mouse in succession with 10−20 min interval in between in order to properly perform the tissue collection.\nRecord the time of injection.\nWait 150 min, then anesthetize mice and collect the tissue as described in steps 2.1−2.7. Perform BrdU immunohistochemistry as described in section 5.2.\nBrdU immunohistochemistry \nPrepare the tissue as described in steps 3.1.1−3.3.4.\nFor antigen retrieval, place a slide cradle with the sections in a glass histology jar and fill it with the EDTA buffer (pH 9) in a microwave oven for 1 min at 750 W followed by 9 min at 350 W. Repeat cycle.",
    "NOTE: Ensure that the tissue does not dry out, which might require adding more buffer to the jars between heating.\nWash sections 2−3 times in tris-buffered saline and polysorbate 20 (TBS-T) buffer for 3 min each.\nApply 5 drops of peroxide block (Table of Materials) for 10−15 min at room temperature to block endogenous peroxidase activity. Wash sections 2−3 times in TBS-T buffer for 3 min each.\nApply 5 drops of rodent block buffer (Table of Materials) for 30 min at room temperature, to block non-specific binding. Wash sections 2−3 times in TBS-T buffer for 3 min each.\nIncubate the sections with a monoclonal mouse anti-BrdU antibody diluted 1:500 for 1 h at room temperature. Wash sections 2−3 times in TBS-T buffer for 3 min each.\nVisualize immunopositivity using 3,3’-diaminobenzidine (DAB) by applying 5 drops of horseradish peroxidase to each slide and incubate for 15 min at room temperature. Transfer the sections to a fume hood, add 150 µL of DAB and incubate for 5 min.\n\t\tNOTE: Always wear gloves when handling DAB and dispose of waste appropriately.\nRinse sections in deionized water.\nDehydrate the tissue and mount a coverslip as described in steps 3.4.6 and 3.4.7.\nVisualization of the immunoreactions\nVisualize the tissue sample with a light microscope connected to a camera.\nUse the analysis software to obtain microscope images using a 20x objective of all sections and save files in the .JPG format.\nTake a snapshot of a stage micrometer using a 20x objective, which will be used as a calibration tool in ImageJ software.\nMeasuring the area of BrdU immunoreactive cells \nInstall ImageJ software (Table of Materials).\nAssigning scale to an image in ImageJ: Open the stage micrometer image using the ImageJ File | Open menu command. Select the straight-line selection tool.",
    "Select the straight tool and draw a straight line on the micrometer image to define a known distance.\nSelect Set Scale under the Analyse menu.\nEnter a value in the Known Distance box and define the unit of length in the Unit of Length box. Select Global so that this calibration applies to all images that are opened in this ImageJ session.\nOpen an image of interest by using the ImageJ File | Open menu command to measure the area of the BrdU immunoreactive cells per crypt.\nSet the color graphics to 8-bit under the Image/Type menu.\nIncrease the contrast of the image under Process/Enhance contrast and set the saturated pixels to 0.4%.\nApply a threshold to the image to segment the immunopositivity. Select Image/Adjust under menu, then threshold and select the color Red (dark area shown in red). Choose a threshold of around 10−20% by moving the threshold bar.\n\t\tNOTE: Choose a threshold that includes all the BrdU positive cells with as little background as possible. The chosen percentage should apply to all sections.\nChoose a well-orientated crypt, i.e., a complete crypt from intact tissue, and select the free hand selection tool to mark the area around it.\nTo measure the threshold area, select the Analyse tab, followed by Analyse particles. In the Analyse particle window, set Size to 20-infinity, click the box pixel units, set Circularity to 0.00−1.00, and set Show to Outlines. Click boxes Display Results, Summarize, and Include holes.\n\t\tNOTE: The values for BrdU positive cells are automatically generated in a result window, showing the individual measurements for each BrdU positive cell. Furthermore, a summary window is automatically generated, showing the number of counts, total area, average size and percentage of area with BrdU positive cells.",
    "Repeat steps 5.4.10 and 5.4.11 to measure a new crypt. The results of all measured crypts will be displayed in the Summary window.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}