{
  "id": 6910,
  "origin_website": "Bio",
  "title": "Generation and <em>in Planta</em> Functional Analysis of Potato Virus Y mutants",
  "procedures": [
    "Gene cloning to prepare the mutated PVY cDNA cloneIn Procedure A, the mutation is introduced into the desired location of the PVY plasmid, followed by transformation of the mutant plasmid into E. coli, and confirmation of the introduced mutation by colony PCR. In the end, mutated and WT plasmids are multiplied and purified before they are introduced into the plants.Introduce mutation into the plasmid (PVY cDNA clone PVY-N605(123), Bukovinszki et al., 2007) by site-directed mutagenesis using the QuikChange II XL Site-Directed Mutagenesis Kit (Agilent technologies).Design primers for mutation (e.g., deletion).The desired mutation should be in the middle of the primer.Minimum GC content should be 40%.Terminate in one or more C or G bases.The primer should be 40-50 bases long.The melting temperature (Tm) of the primer is ≥ 78 °C (Tm calculation: 81.5 + 0.41(%GC) – (675/N); N is the primer length in bases and does not include the bases that are being inserted or deleted.Purify with HPLC.An example of designing a forward primer to introduce a deletion of 60 amino acid residues at the C terminus of PVY CP is provided (Figure 1):The forward primer (excluding the nucleotides to be deleted) is annealed to the parental plasmid, forming a hairpin in the parental plasmid’s region to be deleted. This results in an amplified fragment that includes the desired deletion after PCR.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715001535_2469.jpgFigure 1. An example of designing a forward primer using SnapGene viewerSet up the PCR reaction with the reagents specified in Table 1 and the cycling program shown below. Table 1. Reaction components for mutagenic PCRimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715001843_9382.jpgThermal cycler conditionstable:\n﻿0,1\n92 °C 2 min,\n92 °C 50 s,\n\"65 °C to 55 °C 50 s, touch down\",10 cycles\n68 °C 2 min/kb,\n,\n92 °C 50 s,\n55 °C 50 s,8 cycles\n68 °C 2 min/kb,\n68 °C 60 min,",
    "Digest unmodified plasmid with DpnI enzyme from the QuikChange II XL Site-Directed Mutagenesis Kit. Use 4 µl of enzyme per 25 µl of reaction, incubate 2 h at 37 °C.Transform E. coli XL10-Gold ultracompetent cells (included in the QuikChange II XL Site-Directed Mutagenesis Kit):Gently thaw the XL10-Gold ultracompetent cells on ice. Aliquot 45 μl of the ultracompetent cells to a 2 ml tube for each sample reaction.Add 2 μl of the β-ME mix (provided with the kit) to the 45 μl of cells.Mix gently. Incubate the cells on ice for 10 min, mixing gently every 2 min.Transfer 2 μl of DpnI-treated DNA to each aliquot of the ultracompetent cells.Gently mix the transformation reactions and incubate on ice for 30 min.Heat shock tubes in a 42 °C water bath for 30 s. The duration of the heat shock is critical for obtaining the highest efficiencies.Incubate the tubes on ice for 2 min.Add 0.5 ml of preheated (42 °C) S.O.C. media to each tube.Incubate at 37 °C for 1 h with shaking at 225-250 rpm.Plate the entire volume of each transformation reaction (250 µl x 2 plates) on LB agar plates containing the appropriate antibiotic for the plasmid (e.g., ampicillin).Incubate plates overnight at 37 °C.Set up Colony PCR using the KAPA2G Robust HotStart PCR Kit (Kapa Biosystems).Resuspend five transformed colonies in 50 µl sterile ddH2O.Use 1 µl of colony suspension to prepare a colony PCR.Note: Store the remaining colony suspension at 4 °C; it will be used to prepare overnight cultures of positive colonies. Set up the PCR reaction with the reagents specified in Table 2 and the cycling program shown below.Note: Amplify also non-mutated plasmid (10 ng/µl) as a control.Table 2. Reaction components for colony PCRimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715002352_5624.jpgThermal cycler conditionstable:\n﻿0,1\n95 °C 5 min,\n95 °C 30 s,",
    "Tm °C 15 s,30 cycles\n72 °C 1 min/Kb,\n72 °C 5 min,",
    "Load 1 µl of each PCR product (also non-mutated plasmid) onto 1% agarose gel, made in 1x TAE buffer with ethidium bromide (final concentration 0.5 µg/ml).For colonies with mutations (observed as a shift on the gel, see Figure 2), add 5 µl of colony suspension to 5 ml of LB liquid media with antibiotic (e.g., ampicillin).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715002548_0212.jpgFigure 2. Agarose gel showing colonies with deletions. 1: non-mutated plasmid; 2-8: colonies with deletions; Mw: molecular weight; bp: base pairs.Incubate for 16-18 h at 37 °C with shaking at 200–250 rpm.Isolate plasmids using the GenEluteTM Plasmid Miniprep Kit (Sigma) following manufacturer’s instructions[href=https://www.sigmaaldrich.com/content/dam/sigma-aldrich/docs/Sigma/Bulletin/pln70bul.pdf] with a few modifications:Centrifuge 5 ml of overnight culture in a 15 ml Falcon tube for 5 min at 4,500 rpm at room temperature.Elution step:Add 30 µl of nuclease-free water to the spin column. Incubate for 10 min at room temperature. For plasmids ≥ 10 kb or ≥ 20 kb, use water preheated to 70 °C or 80 °C, respectively. Centrifuge at top speed for 2 min at room temperature.Measure plasmid concentration with the NanoDropTM 1000 Spectrophotometer. The expected yield range is 1.5-4.5 µg, and the expected purity ranges for the indicator ratios A260/A230 and A260/A280 are 1.8-2.4 and 1.8-2.1, respectively.Send samples for Sanger sequencing to confirm the right sequence (company: Eurofins Scientific). Use a 5' PCR primer upstream of the mutation site and a 3' PCR primer downstream of the mutation site. The obtained sequence should be 100% identical at the amino acid level to the expected sequence including the planned modification. Silent mutations are acceptable.After confirming the sequence, prepare 50 µg of each plasmid by using the same protocol and combining 5-10 mini-, midi-, or maxi-preps.Note: For plasmid isolation, the Monarch Plasmid Miniprep Kit (NEB, see Quick Protocol Card) can also be used.",
    "Biolistic bombardment using the Helios Gene Gun system (Bio-Rad) to infect plants with the PVY cDNA clones (WT and mutated)Here, the gold nanoparticles that help transfer the plasmids into the plants are prepared. First, the plasmids are bound to the gold nanoparticles, and then the Gene Gun cartridges are loaded with the plasmid-bound nanogold particles. The cartridges are inserted into the Gene Gun, and the plasmid-bound gold nanoparticles are shot into the plant leaf tissue.Precipitation of plasmid DNA onto microcarriers.Prepare a stock solution of 20 mg/ml PVP in 100% ethanol. Dilute this solution with 100% ethanol to prepare 3 ml of PVP solution with a concentration of 0.05 mg/ml. Keep these solutions tightly capped when not in use. Only use freshly prepared dilutions.Weigh gold microcarriers in a 1.5 ml microfuge tube (size of gold particles: 0.6 µm, use 6.25 mg/plasmid).Add 0.05 M spermidine to the 6.25 mg of gold in the tube. The volume of 0.05 M spermidine should be equal to the volume of 50 µg of plasmid.Vortex the gold and spermidine mixture for a few seconds, and then sonicate with an ultrasonic cleaning bath for 3-5 s to break up gold clumps.Add 50 µg of plasmid to the gold and spermidine mixture.Mix DNA, spermidine, and gold by vortexing for ~5 s.While vortexing the mixture at a moderate rate, add 1 M CaCl2 dropwise to the mixture. The volume added should be equal to the volume of plasmid. The maximal volume of the entire mixture (gold, spermidine, plasmid, and CaCl2) should not exceed 1,200 µl.Allow the mixture to precipitate at room temperature for 10 min.Most of the gold will now be in the pellet, but some may remain on the sides of the tube.",
    "Spin (10,000 rpm) the microcarrier solution in a microfuge for ~30 s to pellet the gold. Discard the supernatant.Resuspend the pellet in the remaining supernatant by vortexing briefly. Wash the pellet three times with 1 ml of fresh 100% ethanol each time, sonicate if you see aggregates of gold particles (only for a short time to avoid DNA damage); spin for ~30 s in a microfuge between each wash. Discard the supernatant.After the final ethanol wash, resuspend the pellet in 200 µl of ethanol solution containing 0.05 mg/ml of PVP (prepared in Step B1a). Transfer the suspension to a 15 ml disposable polypropylene centrifuge tube with a screw cap. Rinse the microfuge tube with 200 µl of the same ethanol/PVP solution and add to the 15 ml centrifuge tube. Rinse again until all gold is washed from the tube. Add up to 3 ml of ethanol/PVP solution to the 15 ml centrifuge tube.Preparation of cartridgesLoad the DNA/microcarrier suspension into the Gold-Coat tubing using the Tubing Prep Station.Prior to cartridge preparation, ensure that the Gold-Coat tubing is completely dry by purging with nitrogen. Insert an uncut piece of tubing into the Tubing Prep Station. Connect the Tubing Prep Station to a nitrogen gas tank. Using the knob on the flowmeter of the Tubing Prep Station, turn on the nitrogen and adjust the flow to 0.3-0.4 LPM (liters per minute). Allow nitrogen to flow through the Gold-Coat tubing for at least 15 min immediately prior to using it in the following steps.Remove the Gold-Coat tubing from the Tubing Prep Station.Turn off the nitrogen flow to the Tubing Prep Station using the knob on the flowmeter.Cut a piece of dried Gold-Coat tubing with a length of the Tubing Station plus 10 cm.",
    "Insert one end of the Gold-Coat tubing into the end of the adaptor tubing fitted to the 10 ml syringe.Vortex the microcarrier suspension and, if necessary, briefly sonicate to achieve an even suspension of gold. Invert the tube several times to resuspend the gold. Immediately remove the cap and quickly draw the gold suspension into the Gold-Coat tubing to cover the tube. Avoid drawing bubbles into the Gold-Coat tubing. Remove the tubing from the suspension and continue drawing the suspension into the tubing for another ~3 cm to leave some space at each end. Cut the part of the tube that was soaked in the liquid to avoid contamination of Tubing Prep Station.Immediately bring the Gold-Coat tubing to a horizontal position and slide the loaded tube, with syringe still attached, into the tubing support cylinder in the Tubing Prep Station until the tubing passes through the O-ring.Allow the microcarriers to settle for 5 min.Remove the ethanol by slowly drawing the syringe plunger outwards at a rate of 1-2 cm/s.Detach the syringe from the Gold-Coat tubing and attach a disposable filter (0.2 µm) at the end of the tube. Immediately turn the Gold-Coat tubing by 180° while in the groove and allow the gold to begin coating the inside surface of the tubing for 3-4 s.Start rotating the Tubing Prep Station. Allow the gold to spread within the tube for 20-30 s and then open the valve on the flowmeter to allow 0.35-0.4 LPM of nitrogen to dry the Gold-Coat tubing, while it continues to rotate.Continue drying the Gold-Coat tubing while rotating for 5 min.Turn off the motor of the Tubing Prep Station. Turn off the nitrogen by closing the valve on the flowmeter.Remove the tubing from the tubing support cylinder.Prepare cartridges using the tubing cutter.",
    "Store the cartridges in a cartridge storage vial containing a desiccant pellet.Bombardment with the Gene Gun.Experimental set-up:Use N. clevelandii plants at the 6 to 10 leaf stage.Bombard seven plants (five leaves per plant) for one construct.Use a yellow fluorescent protein-expressing plasmid or some other plasmid that lacks any PVY-related sequence as a negative bombardment control (to check for any background signal due to PVY carry over during the bombardment procedure).The WT virus should always be used last to bombard the leaves (to avoid contamination). Bombardment:Notes:1)Use a disposable coat and glasses and work in a chamber with UV light.2)After bombardment and before proceeding with the next plasmids, carefully clean with DNA remover and turn on the UV light in the chamber.Prepare the Gene Gun: insert the battery, tighten the Barrel Liner on the gun, and insert the Barrel O-ring in the Barrel Liner.Connect the gun to the Helium tank (open the first valve fully and set the second valve to a pressure of 200 psi).Note: Check after the first bombardment that the pressure is still 200 psi. Fill cartridge holder with cartridges (use tweezers).Insert the cartridge holder into the gun (open all locks), set number 12 on the top, and press the Cylinder Advance lever (see Figure 3 for clarification).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715002906_0003.jpgFigure 3. Components and controls on the Helios Gene Gun (manual for Helios Gene Gun System)Touch the leaf with the gun (with the Barrel Liner), hold the Safety Interlock Button, and press the Trigger button to bombard the leaf (see Figure 4). Press the Cylinder Advance lever to switch to a new cartridge.Repeat the procedure on five leaves per plant.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715002925_8137.jpgFigure 4. Bombardment of the plant leaf Collect the material in Fast-Prep tubes.At 7 days post-bombardment, separately collect three bombarded leaves per each plant and immediately freeze them in liquid N2.",
    "Using the same approach, sample systemic infected leaves at 14 days post-bombardment.PCR analysis (following amplification of the virus in plants)Here, the total RNA is purified from plant leaves bombarded with mutant PVY clones, and the presence of introduced mutations in the viral progeny is confirmed by classic RT-PCR and agarose gel electrophoresis. Then, the viral load in plants bombarded with WT and mutated virus clones is relatively quantified using a PVY universal RT-qPCR assay.RNA isolationUse the MagMAX-96 Total RNA Isolation kit (Thermo Fisher Scientific). The RNA can be isolated manually using a magnetic stand and orbital shaker for 96-well plates or automatically using the KingFisher instrument (Thermo Fisher Scientific).Follow manufacturer’s instructions[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fcms_078409.pdf&title=VXNlciBHdWlkZTogTWFnTUFYLTk2IFRvdGFsIFJOQSBJc29sYXRpb24gS2l0IEluc3RydWN0aW9uIE1hbnVhbCAoRW5nbGlzaCAp] with modifications regarding homogenate preparation: Add 450 µl of Lysis Binding solution concentrate and 50 µl of Plant RNA Isolation Aid to each frozen leaf and immediately start homogenisation with the FastPrep instrument (6 m/s, 60 s). After complete homogenisation, centrifuge samples at 14,000 x g for 10 min. Discard the pellet. Transfer 50 μl of homogenised sample to the wells of the processing plate and follow the manufacturer’s protocol.Include a negative control for the extraction procedure.The optimal RNA yield range is 1-9 µg, and the optimal purity ranges for the indicator ratios A260/280 and A260/230 are 1.7-2.2 and 1.0-2.1, respectively. In our experience, values that are not within these ranges also yield optimal qPCR results.Set up classic one-step RT-PCR to confirm that the introduced mutation is maintained in the viral progeny in planta using the Qiagen OneStep RT-PCR kit. Use reagents specified in Table 3 and the cycling program shown below. Load the PCR product on 1% agarose gel made in 1x TAE buffer with ethidium bromide (final concentration 0.5 µg/ml). Inspect the shift on the agarose gel to confirm the mutation.Table 3. Reaction components for One-Step RT-PCRimgsrc:https://en-cdn.",
    "bio-protocol.org/attached/image/20200715/20200715003451_4226.jpgThermal cycler conditionstable:",
    "﻿0,1\n50 °C 30 min,\n95 °C 15 min,\n94 °C 30 s,\nTm °C 30 s,35 cycles\n72 °C 1 min/Kb,\n72 °C 10 min,\nSet up the qPCR reaction (single-step quantitative RT-PCR) using the AgPath-IDTM One-Step RT-PCR kit (Thermo Fisher Scientific) for virus detection.Quantify the PVY-N605 virus.Use the amplicon targeting the CP to detect the PVY clone (PVY) and cytochrome oxidase transcript (COX) as the endogenous control (see primers and probes in Table 4).Note: Ensure that the amplicon for the PVY clone is not at the position of the introduced mutation (e.g., deletion). This amplicon quantifies WT virus and mutants and enables their comparison.Table 4. Primers and probes for the COX and PVY ampliconsimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715003636_8644.jpgSet up a One-Step quantitative RT-PCR with the reagents shown in Table 5 and cycling conditions below.Table 5. Reaction components for One-Step quantitative RT-PCRimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715003709_6270.jpgThermal cycler conditionstable:\n﻿0,1\n48 °C 10 min,\n95 °C 10 min,\n95 °C 15 s,40 cycles\n60 °C 1 min,",
    "Prepare a standard curve: combine 2 µl of each sample. Dilute 5x, 25x, 125x, and 625x.Include a non-template control.If an automated liquid handling station will be used to pipet onto 384-well plates, two technical replicates are sufficient, otherwise, three are recommended.RT-qPCR can detect both viral RNA and residual plasmid DNA. To quantify only viral RNA, the contribution of the plasmid-derived signal to the concentration of PVY RNA must be eliminated. To detect any plasmid-derived signals, a qPCR reaction without RT is run for each sample. For this, denature the RT enzyme from the AgPath-ID One-Step RT-PCR kit by heating the 25x RT-PCR Enzyme Mix at 95 °C for 10 min before the qPCR reaction. To calculate the quantity of viral RNA, the plasmid-derived signal is subtracted from the overall signal (viral RNA + plasmid DNA) (see Data analysis, step 2).Calculate relative copy numbers of PVY RNA using the quantGenius software (http://quantgenius.nib.si/user/login[href=http://quantgenius.nib.si/user/login], Baebler et al., 2017), see Data analysis.Sample observation with transmission electron microscopy and image acquisitionHere, extracts from plant leaves bombarded with WT and mutated virus clones are observed by electron microscopy to visualise virion formation.Cut 3-4 pieces (of 1-2 mm2) of the lower leaves of N. clevelandii 7 days post-bombardment, place them into Eppendorf tubes, and macerate them with 300 µl of 0.1 M phosphate buffer. Place a formvar- and carbon-coated grid on a drop of sample for 5 min.Soak away the sample by carefully touching the edge of the grid with filter paper and wash the grid with 5-10 drops of deionised water.Stain the sample with one drop of 1% (w/v) uranyl acetate.Immediately remove excess uranyl acetate by touching the edge of the grid with filter paper.Dry the sample at room temperature.",
    "Observe the grids with a transmission electron microscope and acquire the images with a couple-charged device camera (Figure 5).Use Digital Micrograph software to process the images.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200715/20200715003914_4837.jpgFigure 5. Negative-stain transmission electron microscopy of clone PVY-N605(123) in bombarded leaves. PVY-N605(123) flexuous virions are indicated by arrows."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}