{
  "id": 5249,
  "origin_website": "Bio",
  "title": "Determining Efficiency and Selectivity of Lipid Extraction by Perturbing Agents from Model Membranes",
  "procedures": [
    "Typically, a series of experiments is planned for a given perturbing agent and model membranes, at different ratios of lipid to perturbing agent. Samples are carried out in triplicates. Stock solutions are prepared to perform one set of measurements. For a single measurement, between 300 and 800 nmoles of phospholipids are needed; the lipid amount is kept constant in all samples.Model membrane preparationTo form model membranes from a binary mixture of lipids, individual lipids are first dissolved in a benzene/methanol mixture. Typically an individual lipid stock solution is prepared by weighting exactly ~25 mg of lipid and by adding the appropriate volume of benzene/methanol (90/10, v/v) solution to obtain 5 mg of lipid/ml. For more polar species, such as phosphatidylserine, and cholesterol sulphate, the proportion of methanol can be increased to 85/15 (v/v). The lipid organic solutions are prepared in V-Vial screw-thread sample vials, 5 ml, in order to limit solvent evaporation.Aliquots with appropriated volumes of lipid solutions are mixed to obtain the desired molar ratio. The absolute amount of lipid depends on the number of planned samples. The lipid solution is then frozen in liquid nitrogen and lyophilized for at least 16 h to make sure that all the organic solvent is removed. The lipid powder is hydrated in a MOPS buffer (50 mM) containing 100 mM NaCl and 100 µM EDTA, and adjusted to pH 7.4. Typically the appropriate buffer volume is added to provide a MLV stock suspension of 5 mM.The samples are submitted to 3 freeze-and-thaw cycles (from liquid nitrogen temperature to a temperature about 10 °C above the temperature of the gel-to-fluid phase transition). The sample is vortexed when the sample is at high temperature to ensure the proper hydration of the lipids.",
    "Note: Other buffers could be used but they must be phosphate free in order to assay phospholipids.Example: model membrane preparationMembranes made of 1-palmitoyl-2-oleoyl-sn-glycero-phosphocholine (POPC) and 1-palmitoyl-2-oleoyl-sn-glycero-phosphoethanolamine (POPE) with a POPC/POPE molar ratio of 60/40; sufficient lipid amount for 10 samples.Molecular weight (POPC) = 760.07 g/mol; Molecular weight (POPE) = 718.01 g/molOrganic solution: 5 mg of phospholipid/ml.730 µl of POPC organic solution (3.65 mg; 4.80 µmol) were mixed with 460 µl of POPE organic solution (2.30 mg; 3.20 µmol).After lyophilization, the resulting lipid powder (5.95 mg; 8.00 µmol) was hydrated with 1.6 ml of buffer to provide a MLV stock suspension of 5 mM.  Lipid extractionThe lipid extraction is determined for a given membrane composition, a given temperature, and a given concentration of perturbing agent. All the samples, including the controls (i.e., without the perturbing agent), have the same final volume, and final lipid concentration.Each sample is a combination of an aliquot of MLV suspension, an aliquot of perturbing agent solution, and an aliquot of buffer. The final concentration of lipid is set between 1.5 and 4 mM, and the concentration of perturbing agent depends on the desired lipid/perturbation agent molar ratio. The total volume should be between 250 and 1,500 µl. The appropriate volume of MLV stock suspension is pipetted in a 1.5 ml centrifuge tube. The aliquot of perturbing agent solution, prepared in the same buffer as the lipid suspension, is added to obtain the desired lipid/perturbing agent ratio. An aliquot of buffer is added to ensure that all samples have the same volume and the same lipid concentration (Table1).Table 1 shows an example of the composition of a sample series to determine the efficiency and selectivity of lipid extraction induced by a detergent.",
    "In this case, the concentration of the lipid stock solution is 40 mM while the concentration of the detergent stock solution is 10 mM.Table 1. Example of sample series: Lipid extraction by a detergentimgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110214837_9028.jpgThe suspensions are then vortexed and incubated for at least 30 min at a given temperature, using a water bath. After the incubation, the samples are centrifuged for 5 min at 20,800 x g and 1 °C. The extracted lipids are defined as those existing in small perturbing agent/lipid assemblies that stay in the supernatant while the remaining MLVs (possibly with bound perturbing agent) pellet. Centrifugation of control samples (without perturbing agent) typically show that more than 95% of lipids are found in the pellets.Note: Another temperature can be selected for the centrifugation; the control samples (without perturbing agent) provide a quantitative description of the efficiency of the separation of the extracted lipids from the remaining MLVs by centrifugation. The supernatants are isolated using a syringe.The pellets are resuspended in 500 µl of MOPS buffer for their analysis.Lipid analysisTwo parallel analyses are carried out to determine the extent of lipid extraction. First, the phospholipid contents in the supernatants, and in the pellets are determined by a Bartlett phosphorus assay (Bartlett, 1958). Second, an LC-MS analysis is carried out for the supernatants and the pellets.Bartlett phosphorus assayAn aliquot of the lipid sample containing between 8 and 70 nmol in phospholipid is transferred into a glass test tube. Typically, 20 µl of the supernatant and 20 µl of resuspended pellet are used.Standard samples containing between 0 (blank), and 3.5 mM phosphate are prepared in glass test tubes, from a KH2PO4 stock solution (3.5 mM in Milli-Q water; 47.63 mg in 100 ml). Typically, samples with 3.5, 2.0, 1.5, 1.0, 0.4 mM KH2PO4 are prepared.",
    "A 20-µl aliquot of each standard sample is transferred into a glass test tube.To each tube, 120 µl of concentrated sulphuric acid is added. The samples are then vortexed.To each tube, 20 µl of H2O2 (30%) is added. The samples are then vortexed.The tubes are heated all together to 200 °C for 10 min. During the heating, marbles are placed on top of the tubes to prevent potential evaporation.The samples are put on the bench and left to cool to room temperature.To each tube, 1,340 µl of Milli-Q water is added. The samples are then vortexed.To each tube, 40 µl of Na2S2O5 solution (526 mM in Milli-Q water; 100 mg in 1 ml) is added. The samples are then vortexed.The tubes are heated all together to ~90 °C for exactly 5 min.The samples are put on the bench and left to cool to room temperature.To each tube, 400 µl of (NH4)6Mo7O24·4H2O solution (16.2 mM in Milli-Q water; 200 mg in 10 ml) is added. The samples are then vortexed.To each tube, 40 µl of ascorbic acid (568 mM in Milli-Q water; 100 mg in 1 ml – the solution is photosensitive and must be kept in the dark prior its use) are added. The samples are then vortexed.The tubes are heated all together to ~90 °C for exactly 10 min. A blue color should appear.The samples are put on the bench and left to cool to room temperature.The absorbance at 820 nm is read within 1 h and is used for the phospholipid determination (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161110/20161110215319_2649.jpgFigure 1. Typical calibration curve for the Bartlett assay LC-MS analysisThe lipid composition of the supernatants and of the pellets are determined by LC-MS analysis. Typically 32-µl aliquots of each sample are injected and triplicates are carried out for each condition.",
    "Samples are eluted on a YMC diol column (4.6 x 150 mm, 5 µm particle size) (Agilent Technologies), maintained at 50 °C. Elution of the phospholipids is achieved in 7 min, using acetonitrile/aqueous ammonium acetate solution (100 mM) (85/15, v/v) at 0.6 ml/min. The ESI source is used in the positive ionization mode. Nitrogen is used as drying gas at 250 °C and 12 L/min. Nebulizing gas is also nitrogen, held at 241 kPa.A 2-µl aliquot of the supernatant and of the resuspended pellet is diluted in 1 ml of an H2O/MeOH (1/9, v/v) solution.A 2-µl aliquot is injected for the LC/MS analysis."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}