{
  "id": 14155,
  "origin_website": "Jove",
  "title": "Fat Preference: A Novel Model of Eating Behavior in Rats",
  "procedures": [
    "All experimental procedures are in accordance with the Guide for the Care and Use of Laboratory Animals (Institute of Laboratory Animal Resources (U.S.), 1996) and with the approval of the Institutional Animal Care and Use Committee at the University of Texas Medical Branch.\n1. Subjects\nSingle house male Sprague-Dawley rats weighing 225-250 g at 21 °C and 30-50% relative humidity with a 12 hr light-dark cycle (lights on 6:00 am-6:00 pm).\nMaintain rats on a low fat food (10% fat by energy). Habituate rats to food and colony room for at least 7 days prior to experimentation. Animals are habituated to handling and dosing of vehicle for three days prior to starting the studies. The first day after habituation is experimental Day 1.\n2. Baseline Preference\nDay 1, fill two clean food hoppers, one marked with an A and the other with B, with 10% fat food for each cage. Weigh the food hoppers (with food) and place them in the cage, ensuring the rat has access to both.\nDay 2, at approximately the same time food hoppers were placed in the cage the day before, record the food hopper weights and switch the positions of hopper A and hopper B. This mitigates position bias. Always examine the home cage for any food removed from the hopper, weigh it, and account for it. Food intake is measured by change in hopper weight between days.\nDay 3, record the food hopper weights as before. Examine the amount of food consumed in each food hopper position and food hopper identification (A and B). This data gives a baseline understanding of position bias and specific hopper preference, and should have a preference score of approximately 50% indicating no preference. Throw out the remaining food.\n3. Fat Preference",
    "Day 3, obtain two clean food hoppers for each cage. It is important to use clean food hoppers whenever switching between the different foods to prevent confounding scents from previous experiments. Fill hopper A with 12.5% fat food and hopper B with 15% fat food (Table 1). Record the starting weights of each hopper and place both in the cage.\nDay 4, record the weights of each hopper, switching the positions of hopper A and hopper B upon placing them back in the cage.\nDay 5, record the weights of each hopper. After determining the grams of each food consumed on both days, the rat’s food preference can be determined.\nRepeat steps 3.1 through 3.3 multiple times with the same animals using 12.5% fat food as compared to foods with increasing fat content (e.g. first 15%, next 17.5%, then 20%, and lastly 45% fat).\n4. Data Calculations and Analysis\nCalculate the daily food intake for each animal by subtracting the final mass of the food+hopper from the starting mass of the food+hopper. Because each food is measured over 2 days, the 2 day total can be added together for each % fat content.\nCalculate the fat preference score by dividing the intake of the higher fat food from the total food consumed over each two day period. For example, one rat ate 8.9 g of the 12.5% fat diet and 27.5 g  of the 17.5% diet over 2 days. Therefore the preference score for that individual animal is 76% (27.5 divided by 36.4).\nAverage and graph the preference score for each diet (15%, 17.5%, 20%, and 45% fat) (Figure 3). The total food intake is also informative and can readily be plotted as grams (Figure 4).",
    "Express the preference score (Figure 5A) and total food intake (Figure 5B) as a function of total energy intake (kilocalories) using the energy density in Table 1.\nIf using more than one group of animals, perform a two-way repeated measures ANOVA followed by a Bonferroni post-test. Power analysis indicates that n = 8 animals per group is appropriate for detecting a difference of 7% between treatment groups.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}