{
  "id": 17200,
  "origin_website": "Jove",
  "title": "Troubleshooting FoCUS Image Acquisition: Patient Positioning, Transducer Manipulation, and Image Optimization",
  "procedures": [
    "This material is the authors' original work, which has not been previously published elsewhere. The protocol described is for clinical use and not research purposes. De-identified images were obtained from a volunteer model in a non-clinical environment. The authors did not seek a formal \"Not Regulated\" determination from the IRB in accordance with institutional policy, as the activity falls outside of the Common Rule and FDA definitions of human subject research.\n1. The transducer\nUse the phased array transducer. This is a 4-12 MHz transducer that penetrates deep into the thoracic space, due to its low frequency compared to other ultrasound transducers.\n\t\nSelect the phased array transducer using the Exam button on the machine and selecting the cardiac exam or equivalent available exam.\nPractice with transducers from various vendors to gain experience and refine one's cognitive skill set for transducer manipulation.\nPractice transducer manipulation with both hands to develop ambidexterity, which may be required when working in limited clinical environments.\nAnchor the dominant hand while holding the ultrasound transducer on the patient, with the fat pad of the medial aspect of the hand.\n\t​NOTE: This provides additional stability and reduces error caused by large movements. Holding the transducer by the base, without anchoring, results in unintended movements, preventing the ability to maintain the image axis and orientation.\nUse two hands for transducer manipulation to improve the ultra-fine adjustments often required for optimal views. Place the dominant hand on the base of the transducer with the non-dominant hand on the tail of the transducer, providing additional stability and guided movement.\n2. Patient positioning\nObtain the PLAX, PSAX, A4C, SC4C, and IVC views in the supine position.",
    "Instruct the patient to extend their left arm above their head and lie on their left side, and obtain images in this position if they are unable to be obtained in the supine position.\n\tNOTE: This results in expansion of the intercostal spaces for larger imaging windows.\n\t\nPlace a wedge or blanket roll behind the patient's right upper torso if the patient cannot easily rotate to 45°, or reposition their limbs. Postoperative and intensive care unit patients often need support to maintain appropriate positioning for FoCUS examination.\nDrape the breast as desired by the patient, and make sure that the patient is aware of where the transducer will be placed before beginning the exam.\nManipulate the breast tissue to allow for optimal image acquisition.\n\t\nIf able, instruct the patient to assist moving the breast tissue with their right hand.\nDiscuss the appropriateness of removal or relocation of monitors beforehand with bedside nurses and other relevant providers.\nDo not alter or remove tubes, lines, or drains for imaging purposes. Discuss the duration of the devices with the relevant providers and consider reimaging the patient following their removal.\n3. Transducer manipulation\nAppreciate and understand the definitions of transducer movements to allow for optimal image acquisition, and provide consistent terminology for communication between providers, especially during teaching (Figure 1 and Table 1).\n4. 2-D image optimization\nAdjust the depth (approximately 12-16 cm, depending on view) to see the structure of interest.\nAdjust the gain to optimize the brightness of the image.\nAdjust the focus to the depth of the structure of interest in order to improve resolution.\n5. Motion mode (M-mode)\nUse M-mode to display a single scan line (wherever the cursor is placed) of the B-mode image (Y-axis) against time (X-axis).",
    "NOTE: This mode can help operators understand the dynamic relationship of different structures over time and is useful in many different assessments, including IVC size and variability and E-point septal separation (EPSS).\nUse the button with the letter \"M\" on it to turn on M-mode.\n\t​NOTE: M-mode will be an on/off button unique to each machine.\n6. Parasternal long axis (PLAX)\nNOTE: The PLAX refers to obtaining an image that is along the long axis of the heart (Figure 2).\nPlace the patient in the supine position. If there is difficulty obtaining the PLAX image, place the patient on their left side and extend their arm above their head, if possible.\nPlace the transducer at an oblique angle between the third and fifth intercostal space of the left parasternal region, with the transducer marker pointing to the patient's right shoulder.\n\t\nVisualize the right ventricle, left ventricle, left atrium, mitral valve, left ventricular outflow tract, aortic valve, and descending thoracic aorta in this image.\nVisualize the mitral valve and aortic valve opening and closing together, to ensure that the image is not foreshortened. Foreshortening is where the ultrasound plane does not cut through the true apex of the structure, changing the perceived image.\n2-D image optimization\n\t\nStart with an initial depth of approximately 15-20 cm. Adjust the depth so that the tip of the mitral valve is in the center of the image, and the descending thoracic aorta (deep to the left atrium) is visible.\nAdjust the gain to maximize the visibility of the myocardium and mitral valve.\nMove the focus to the region of interest, most focused at the depth of the mitral valve.\nUse M-mode for EPSS or fractional shortening.\n7. Parasternal short axis (PSAX; Figure 3)",
    "Place the patient in the same positioning for the PSAX as used for the PLAX.\nPlace the transducer approximately 90° relative to the transducer in the PLAX.\n\t\nObtain an optimal PLAX and rotate the transducer slowly in a clockwise fashion without lifting the transducer from the patient's chest, until the transducer is obliquely angled across the third to fifth intercostal space of the parasternal region, with the transducer marker pointing to the patient's left shoulder.\n\t\tNOTE: Over-rotation beyond 90° can lead to interventricular septal flattening, and falsely appear as right ventricular volume or pressure overload.\nTilt the transducer until the mid-papillary muscles are visualized for the FoCUS assessment.\n\t\tNOTE: The papillary muscles should move in synchrony with the left ventricle wall. If the papillary muscles appear to be bouncing or fluttering independent of the left ventricular wall, it may signify that the image is capturing the mitral valve leaflet as a result of being off axis.\nTilt the transducer toward the base of the heart, to visualize the bi-leaflet mitral valve initially followed by the tri-leaflet aortic valve.\n2-D image optimization\n\t\nStart with a deeper image (approximately 16 cm) to identify any pleural effusion.\nAdjust the depth to include the full depth of the left ventricle and a few centimeters beyond, to ensure that a pericardial effusion would be fully visualized.\nAdjust the gain to maximize visualization of the septum and papillary muscles.\nAdjust the focus to the papillary muscles.\n8. Apical four chamber view (A4C; Figure 4)\nNOTE: Images in patients with chronic obstructive pulmonary disease (COPD), and otherwise inflamed thoracic cavities, are obtained more medially, and images in patients with left ventricular hypertrophy (LVH) or heart failure with reduced ejection fraction (HFrEF) have their view more lateral.",
    "Position the patient with their left arm extended above their head and lying on their left side. If there is significant artifact present, have the patient exhale and hold their breath to minimize pulmonary artifact.\nPosition the transducer in the fourth through sixth intercostal space along the left anterior axillary line (inferolateral to the left pectoral muscle), with the transducer marker pointed toward the left axilla. Move the transducer lateral, medial, or caudal, as needed to obtain an optimal A4C view.\n\t\nLift the breast tissue and push superior along the inframammary fold as needed.\nIf the left ventricular apex is not fully visualized, move the transducer lateral while orienting the transducer toward the right shoulder.\nPosition the marker on the phased array transducer between the two and three o'clock positions. In the normal heart, the apex of the left ventricle is at the top and center of the sector, the right ventricle is triangular and smaller, and the myocardium should be uniform from the apex to the atrioventricular valves. If this is not the case, the image may be foreshortened, and should be optimized and acquired from a lower intercostal space.\nTilt the transducer cephalad approximately 60°, so that the A4C view can capture an A4C cardiac image that includes both atria, ventricles, the interventricular septum, and the lateral portions of the tricuspid and mitral annuli. The aortic valve and left ventricular outflow tract should not be present in an A4C view, and are only present in an apical five chamber view.\nVisualize the mitral valve, the tricuspid valves, and the interventricular septum on the A4C image. If both valves and the interventricular septum are not visualized, the image should be further optimized.",
    "Slide the transducer up or down a rib space and tilt the base of the transducer down (cranially) to improve the image of the valves. If the base of the transducer is tilted too far down (cranially), an apical five chamber view, including the aortic valve, will appear, and the transducer should be tilted back up (caudally) to optimize the A4C view. If the base of the transducer is tilted too far up (caudally), the coronary sinus will appear, and the transducer should be tilted back down (cranially).\nRotate the base of the transducer toward the patient's midline to optimize the interventricular septum position, which should be present vertical in the center of the image. Minimal rotation should be required. If over-rotated, a two chamber view will be observed.\n2-D image optimization\n\t\nIncrease the depth to include both atria at the image's deepest point, in addition to accommodating the left and right ventricular free walls (approximately an initial depth of 20 cm).\nAdjust the gain to maximize visibility, often resulting in increased echogenicity, of the myocardium, the mitral valvular annulus, and the tricuspid valvular annulus.\nAdjust the focus to the depth of the valvular annuli (the tricuspid annulus is most commonly used). This depth will also be appropriate when transitioning to an apical five view, if desired.\n9. Subcostal four chamber view (SC4C; Figure 5)\nPosition the patient supine for the subcostal four chamber view. Flex the patient's knees, and support them to maintain the flexed position, to reduce the abdominal muscle tone for easier transducer compression.",
    "Place the transducer nearly flat on the patient's subxiphoid abdomen, with the operator hand on top of the transducer providing cephalad pressure. Find the liver, and then drop the transducer to a shallower angle (often less than 30°) against the subxiphoid portion of the patient's abdomen in a cephalad fashion, with the transducer marker to the patient's left side, approximately pointing to three o'clock. Include the liver in the image so that it can be utilized as an acoustic window to obtain this image.\n\t\nHold the lateral aspects of the transducer with the fingers, not underneath the transducer, to flatten the transducer appropriately. Use the index finger to provide downward pressure.\n2-D image optimization\n\t\nStart with an initial depth of 18-24 cm. Adjust the depth to include the liver as a sonographic window for the ultrasound. The optimal depth varies from patient to patient based on patient body habitus and liver size.\nDecrease the gain, as the liver often provides a good medium to transmit sound waves.\nIncrease the focal points to focus on the cardiac structures of interest below the liver.\nInstruct non-intubated patients to perform an inspiratory hold, as this often increases the quality of the image.\n10. Inferior vena cava (IVC; Figure 6)\nPosition the patient supine for the IVC view.",
    "Begin with the subcostal view, then rotate the transducer counterclockwise until confluence of the right atrium and IVC is appreciated, and the transducer is placed longitudinally in the upper abdomen, to the right of the patient's midline. Optimize the image by tilting the transducer until the IVC is fully visualized, and then by rocking the transducer cephalad until the confluence of the IVC and the right atrium is fully visualized. Adjust the transducer (most frequently with minimal rotation) until the IVC is visualized across the entire screen.\n\t\nVisualize the right atrium, IVC, liver, and hepatic vein in an optimal view.\nDo not confuse the IVC with the aorta. The aorta is left lateral of the IVC and will not touch the liver. The IVC will always touch the liver, and is often surrounded by liver on both sides.\n\t\t\nAppreciate that hepatic veins can often be seen coming into the IVC, providing another way to prove that the structure being imaged is the IVC.\nUse pulse wave velocity to visualize the venous (vs. arterial) waveform, and confirm the vessel being imaged is the IVC and not the aorta.\nMeasure IVC diameters at midline and mid-expiration. Do not measure the diameter of the IVC to the side which could underestimate the diameter of the IVC.\n2-D image optimization\n\t\nMinimize the depth to only include the IVC. Do not include the spine in the image.\nAdjust the gain to be the same as for the subcostal view.\nAdjust the focus to the depth of the IVC.\nPlace the cursor 1-3 cm from the confluence of the IVC and the right atrium, and apply M-mode to evaluate respiratory variation of the IVC.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}