{
  "id": 5897,
  "origin_website": "Bio",
  "title": "Mouse Model of Immune Complex-mediated Vasculitis in Dorsal Skin and Assessment of the Neutrophil-mediated Tissue Damage",
  "procedures": [
    "Arthus reaction in dorsal skinWeigh the experimental C57BL/6J mice and intraperitoneally inject anesthesia solution (see Recipe 1) according to the body weight at 5 µl/g body weight (e.g., 150 µl for a 30 g mouse). The mice are expected to be anesthetized for at least 30 min. Mice are placed on a heating table (39 °C) during anesthesia to maintain the body temperature. Shave the hair on the dorsal skin by using an animal hair clipper. Optional: application of therapeutic agents and the respective controls. Notes:  The method and duration of application of therapeutic agents need to be determined for individual treatment condition. For example, to study the effect of mesenchymal stem cells (MSCs) on IC-mediated vasculitis, 2.5 x 105 adipose tissue-derived MSCs in 100 µl PBS per injection were intradermally injected to both sides of the shaved dorsal skin of mice.  Mice intradermally injected with 100 µl PBS served as controls. Injection of such volumes into mouse ears is not possible.  Arthus reaction can be induced half an hour after injection of MSCs.Intravenously (or intraperitoneally) inject 100 µl of Evans blue-BSA solution (see Recipe 2).Note: Compared to i.v. injection, i.p. injection resulted in smaller Evans blue areas in the skin at the injection sites of anti-BSA antibody, but the difference between anti-BSA and rabbit serum control was clear (Figure S1[href=https://os.bio-protocol.org/attached/file/20171207/Supplementary file Figure S1.docx]). Therefore, i.p. injection of Evans blue-BSA solution can also be used for this procedure.Intradermally inject 40 µl of rabbit anti-BSA antibody (undiluted whole antiserum, concentration varies in different lots, in our experiments ranged from 3-5 mg/ml) into the dorsal skin of interest (e.g., areas that had been treated testing therapeutic agent, such as with AT-MSCs, or respective control). In control mice, 40 µl of rabbit serum was injected intradermally.",
    "Four hours later, to quantify the extent of Evans blue-marked vascular leakage, sacrifice the mice, harvest skin specimen (Video 1) and immediately photograph digitally (Figure 1B).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Dissection of mouse skin after Arthus reaction. The Arthus reaction was elicited by i.p. injection of 100 µl PBS solution containing 1% Evans blue and 2% BSA. Afterward, 40 µl of anti-BSA antibody (left-side of back-skin) or 40 µl rabbit serum (right-side of back-skin) was intradermally injected. 4 h later, mice were sacrificed and the skin specimen was harvested and digitally photographed.Analyze the Evans blue areas in the skin, indicative of the extent of vessel damage due to BSA/anti-BSA complex formation, with ImageJ (details see Data analysis) (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213194023_8866.jpgFigure 1. Induction of IC-mediated vasculitis in mouse dorsal skin and data analysis. A. Flow chart of the data analysis; B. 100 µl PBS or 2.5 x 105 adipose tissue-derived mesenchymal stem cells (MSCs) were intradermally injected to both sides of the shaved dorsal skin of mice. The Arthus reaction was elicited by i.v. injection of 100 µl PBS solution containing 1% Evans blue and 2% BSA. Afterward, 40 µl of anti-BSA antibody was intradermally injected to the area that had been injected with MSCs or PBS. 4 h later, mice were sacrificed and the skin specimen was harvested and digitally photographed. C. With ImageJ, the original photo in RGB format was converted to HSB format with plugin ‘Color Space Converter’. D. After splitting channels, the green channel was kept for Evans blue area analysis. D’. Alternatively, the RGB photo was converted to CYMK format with plugin ‘RGB to CYMK’ and the cyan channel was kept for analysis. E. A binary image was created with the Evans blue areas in black. F and G. Settings for measurement and particle analysis. H.",
    "Particle analysis indicating the Evans blue areas in skin. I. Results were presented as a scatter plot by GraphPad Prism. Intradermal injection of MSCs resulted in significantly reduced areas of Evans blue staining by 52.1% compared to PBS control (15.8 vs. 33.0 AU). **, P < 0.01 by Mann-Whitney tests; AU, arbitrary unit.Histology and immunofluorescence of neutrophils Note: Histological examination with H&E staining and immunofluorescence staining of neutrophil activation markers are optional but are recommended, in order to confirm the observed tissue damage is indeed due to neutrophil recruitment and activation. Arthus reaction without Evans blue Follow the Procedure A. In Step A4, replace the Evans blue-BSA solution to sterile filtered 2% BSA in PBS. In Step A6, the harvested skin specimen was fixed in 10% formalin solution at 4 °C for overnight. Fixed tissues were processed with tissue processor for dehydration and clearing and embedded in paraffin blocks and sectioned into 5 µm sections using a microtome (the details of making formalin-fixed-paraffin-embedded [FFPE] sections can be referred to existing literature, e.g., Canene-Adams, 2013). H&E staining (Figure 2)Heat paraffin sections at 50-60 °C for 30 min.Put sections in xylene for 10 min for 2 times.Hydrate sections in 100%, 95%, 80%, 70% ethanol for 3 min for 2 times for each.Incubate the sections in distilled water for 5 min.Incubate in Mayer’s hematoxylin for 10 min.Wash in cold tap water for 5 min.Rinse with distilled water (dip the slides in distilled water for several times).Incubate in Eosin Y (+ 1 drop of acetic acid/100 ml) for 2 min.Rinse with distilled water.Dehydrate the sections in 80%, 95%, 100% ethanol for 5 min each.Clear with Roti-histol.Mount with Roti-histokitt.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213194240_1125.jpgFigure 2. H&E staining of FFPE skin sections after induction of IC-mediated vasculitis.",
    "Mice were intradermally injected with PBS or MSCs and subjected to Arthus reaction by i.v. injection of 100 µl PBS solution containing 2% BSA. Afterwards, anti-BSA antibody was intradermally injected into the area that had been injected with MSCs or PBS. Mice received rabbit serum served as healthy controls. 4 h later, mice were sacrificed and the skin specimen was harvested and processed to 5 µm paraffin-embedded sections. Representative pictures of H&E staining of skin sections from 4 mice of each group are shown. White arrows indicate blood vessels. Scale bars = 50 µm. The dermis of the mice subjected to Arthus reaction with PBS injection showed severe damage of vessels surrounded by red blood cells and neutrophils (B). Pre-treatment of MSCs reduced vessel destruction (C), and histology was similar to skin specimen from healthy control mice (A).Immunofluorescence staining of neutrophil marker (Ly6G), neutrophil extracellular traps (NETs), neutrophil elastase (NE) and myeloperoxidase (MPO) Follow Steps B2a-B2d.During Step B3a, prepare antigen retrieval buffer: 20 ml of 10x target retrieval solution + 180 ml distilled water, and heat the buffer in a steam cooker.Antigen retrieval: heat sections (in plastic chambers) in buffer for 15 min in a steam cooker.Cooling for 10 min, and put sections in PBS for 5 min.Permeabilization: put sections in 0.25% Triton X-100 for 10 min (0.5 ml Triton X-100 in 200 ml PBS).Wash with PBS for 3 times with each 5 min.Incubate the sections with blocking buffer (see Recipe 3) for 1 h at room temperature.Incubate the sections with the first primary antibody at 4 °C for overnight in a staining tray: anti-Ly6G (1:100 dilution in antibody diluent [see Recipe 4]) (Figures 3A-3C), or anti-NE (1:200 dilution in antibody diluent) (Figures 3D-3F). Wash in PBS 3 times, each time 5 min.",
    "Incubate the section with the first secondary antibody at room temperature for 1 h in a staining tray: AF488-conjugated goat anti-rat IgG (1:200 dilution in antibody diluent) (Figures 3A-3C), or AF488-conjugated donkey anti-rabbit IgG (1:200 dilution in antibody diluent) (Figures 3D-3F).Wash in PBS 3 times, each time 5 min. Avoid the direct light exposure. Incubate the section with the second primary antibody at room temperature for 2 h in a staining tray: anti-DNA/histone H1 antibody for NETs (1:100 dilution in antibody diluent) (Figures 3A-3C), or anti-MPO (1:50 dilution in antibody diluent) (Figures 3D-3F). Wash in PBS 3 times, each time 5 min.Incubate the section with the second secondary antibody at room temperature for 1 h in a staining tray: AF555-conjugated goat anti-mouse IgG (1:200 dilution in antibody diluent) (Figures 3A-3C), or AF555-conjugated donkey anti-goat IgG (1:200 dilution in antibody diluent) (Figures 3D-3F).Wash in PBS 3 times, each time 5 min. Avoid the direct light exposure. Incubate the section with DAPI solution (1:5,000 dilution in PBS) at room temperature for 3 min in a staining tray.Rinse the slides with PBS, and air dry. Avoid the direct light exposure.Mount cover slip with fluorescent mounting media. The slides can be stored at 4 °C. Fluorescence microscopy.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171213/20171213194434_4371.jpgFigure 3. Immunofluorescence staining of neutrophil activation markers on FFPE skin sections after induction of IC-mediated vasculitis. Mice were intradermally injected with PBS or MSCs and subjected to Arthus reaction by i.v. injection of 100 µl PBS solution containing 2% BSA. Afterwards anti-BSA antibody was intradermally injected into the area that had been injected with MSCs or PBS. Mice received rabbit IgG served as healthy controls. 4 h later, mice were sacrificed and the skin specimen was harvested and processed to 5 µm paraffin-embedded sections.",
    "Representative pictures of skin sections from 4 mice of each group with immunostaining of murine neutrophil marker Ly6G (green) and NETs marker DNA/histone-1 (red) (A-C), and immunostaining of NE (green) and MPO (red) (D-F) are shown. Nuclei were counterstained with DAPI (blue) in immunostainings. Scale bars = 50 µm. The dermis of the mice subjected to Arthus reaction with PBS injection showed massive infiltration of neutrophils with NETs (B), NE and MPO in the tissue (E), which very much resemble the features of human vasculitis. In contrast, intradermal injection of MSCs significantly reduced NETs (C) and the numbers of NE+MPO+ neutrophils in the dermis (F), which were similar to skin specimen from healthy control mice (A and D)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}