{
  "id": 9192,
  "origin_website": "Jove",
  "title": "Imaging Ca2+ Dynamics in Cone Photoreceptor Axon Terminals of the Mouse Retina",
  "procedures": [
    "All animal procedures were carried out adhering to the guidelines and laws for animal protection determined by German Federal Government and approved by the institutional animal welfare committee of the University of Tübingen.\n1. Animal Models\nHR2.1:TN-XL Ca2+ biosensor mouse\n\t\nUse the transgenic HR2.1:TN-XL mouse line expressing the Ca2+ biosensor TN-XL selectively in cone photoreceptors10. Use 3 - 6 weeks old mice of either sex raised with a standard 12 hrs day/night rhythm.\n2. Retinal Dissection\nPhysiological solution\n\t\nPrepare freshly 2 L of extracellular solution, containing 125 mM NaCl, 2.5 mM KCl, 1 mM MgCl2, 1.25 mM NaH2PO4, 26 mM NaHCO3, 0.5 mM L-glutamine, and 20 mM (+) glucose. Mix until all ingredients dissolve.\n\"Bubble\" extracellular solution with carboxygen (95% O2, 5% CO2) for 5 - 10 min. Add CaCl2 to reach a concentration of 2 mM.\nAfter bubbling the extracellular solution, measure its pH. The pH should be 7.4, otherwise it is likely that mistakes have been made during the preparation of the solution. Keep bubbling rate and solution temperature constant throughout experiment to ensure constant pH.\nSeparate the stock into 2 flasks, one for retina dissection and one for the recording setup (perfusion).\nEye enucleation and isolation of retina (5 - 10 min)\n\t\nMaintain a dim red illumination in the working area for enucleation. Use LEDs with a peak wavelength of 650 nm (or longer) to avoid bleaching of cones during dissection.\nDark-adapt the mouse for 2 hrs by putting its cage into a well-ventilated, lightproof box to ensure that cones are fully sensitized at time of recordings.",
    "Anaesthetize the mouse under a laboratory hood with isoflurane (5%) using a vaporizer and a gas-tight container that holds a standard mouse cage. Carefully follow the manufacturer´s instructions when handling the vaporizer. Use gloves and face mask to reduce exposure to allergens.\nUse a binocular microscope with a 10 - 40X magnification for dissection.\nSacrifice the anaesthetized mouse by decapitation.\nFor orientation, mark the top of each eye (= dorsal) with a waterproof pen. Keep track on whether using left or right eye.\nRemove the eye carefully using curved scissors by cutting the optic nerve behind the eyeball. For dissection, transfer the eyeball to a Petri dish containing freshly carboxygenated extracellular solution. For transferring the eyeball, hold it by the optic nerve stump.\nPierce the eye at any point along the border between the cornea and the sclera (i.e., at the ora serrata) with a sharp injection needle.\nHold the eye at the sclera with a pair of forceps and gently insert one scissors blade into the hole made in the previous step. Cut along the ora serrata to separate the anterior part of the eye (cornea, lens, vitreous body) from the posterior part (eyecup). Cut the eyecup radially (towards the optic disc) at the position of the pen mark to indicate the dorsal position on the retina.\n\t\tNote: Prepared this way, the eyecups can be kept in constantly carboxygenated solution for later use.\nTurn the eyecup in the Petri dish such that the dorsal cut points away from oneself. Grab the sclera on the left and the right side of the eyecup with a pair of forceps each by inserting the forceps tips between retina and sclera.",
    "Detach the retina by gently inverting the scleral part of the eyecup. Finally, cut the optic nerve using micro dissecting scissors to free the retina from the sclera.\n\t\tNote: This is a critical step. Avoid damage to the retina (e.g., by touching and squeezing it with forceps).\nHold one of the edges of the retina with a pair of forceps and gently remove debris and vitreous body from the retinal surface using a second pair of forceps. When the retinal surface is clean, use micro dissecting scissors to make three additional shorter, radial cuts (approximately every 90°). These cuts allow one to carefully flatten the retina with the photoreceptor side facing down in the Petri dish (Figure 1A).\nSlice preparation (10 - 15 min)\n\t\nPrepare beforehand nitrocellulose filter membranes for retinal slicing and glass cover-slips for mounting slices and transferring them to the recording chamber. Cut nitrocellulose filter membrane into approximately 10 x 5 mm sized rectangular pieces using scissors. Cut coverslips into approximately 10 x 5 mm sized rectangular pieces using a glasscutter.\nSlowly immerse a glass slide into the extracellular solution close to tissue. Gently, pull the retina onto the glass slide with the ganglion cell side up by grabbing it at the very edge using a pair of forceps. This process reduces mechanical damage and folding of tissue.\nChoose the region of the retina that is related to the respective research question (see also Discussion). Remember, the long cut made in step 2.2.9 marks the dorsal retinal half (Figure 1A). Cut a rectangular, approximately 1 x 2 mm sized piece out of the selected retinal region using a curved scalpel blade. Wipe off excess solution around the tissue.",
    "Place the filter membrane on top of the piece of retina such that the ganglion cell side adheres to the membrane. Immediately, add a drop of extracellular medium onto the membrane to firmly attach the tissue to the membrane.\nTransfer the membrane-mounted retinal tissue to the slicing chamber containing fresh extracellular solution.\nCut retina into vertical slices of 200 µm thickness (Figure 1B) using a fresh razor blade attached to a tissue chopper23. Change blade for every retinal piece.\n\t\tNote: The razor blade needs to be perfectly aligned with the surface of the slicing chamber bottom such that the whole membrane splits simultaneously, as indicated by a “clicking” sound when cutting – otherwise the blade may bend and damage the slice.\nGlue a single membrane-mounted slice to a glass cover-slip by applying high vacuum grease to the membrane ends only (Figure 1C). Keep the glass surface below the retina free from grease.\nKeep coverslip-mounted slices covered by a drop of extracellular solution in the holding chamber – a closed and lightproof container, e.g., a Petri dish with the lid covered with aluminium foil – under a carboxygen atmosphere at RT. Introduce carboxygen by bubbling a small water reservoir to keep the atmosphere in the holding chamber humidified; this prevents the slices from drying out.\nAllow slices to rest in the holding chamber for 10 - 15 min before moving them (one by one) to the recording chamber. Slices can be maintained up to 4-5 hrs in holding chamber at RT (~21 °C).\n3. Two-photon Ca2+ Imaging\nTwo-photon microscopy\n\t\nUse a Movable Objective Microscope (MOM)-type two-photon microscope. Both MOM design and imaging procedures were described earlier24, for details see also10,21,25 (for sources and companies, see Table 1).",
    "Note: Any upright two-photon microscope that fulfils the following minimal requirements can be used: It has to be equipped with (a) a pulsed laser tuneable to ~860 nm, (b) a minimum of two simultaneously acquired fluorescence channels, (c) filters for eCFP and citrine fluorescence, (d) a light stimulator (for possible designs, see24,26), and (e) software that allows recording time-lapsed image sequences at a frame rate sufficient to resolve the Ca2+ signals of interest.\nStart the two-photon imaging system as indicated by the manufacturer. Strictly follow the facility’s laser safety guidelines. Start the laser and tune it to ~860 nm.\nTransfer a slice from the holding chamber to the recording chamber and immediately start perfusing with carboxygenated extracellular solution. Maintain a perfusion flow rate of 2 ml/min and a temperature of 37 °C in the recording chamber.\nUse a 20X 0.95 NA water immersion objective. If available, use a CCD camera in combination with an infra-red LED below recording chamber to locate the retinal slice (Figure 2). Otherwise locate slice using two-photon imaging (see 3.1.5).\nSwitch to two-photon imaging to view biosensor expression. Turn on the two detection channels for fluorescence imaging of eCFP and citrine.\nUse the image acquisition software that controls the two-photon microscope to scan and select a row of cone terminals for recording (Figure 3A). Set image acquisition to 128 x 16 pixel images (31.25 Hz) or a similar configuration. Restrict scanned area to cone terminals to avoid bleaching of photopigments in outer segments.\n\t\tNote: For the TN-XL calcium sensor (τ = ~0.6 sec for Ca2+ binding, τ = ~0.2 sec for Ca2+ unbinding; see16) a minimum frame rate of ~8 Hz is recommended.\nLight stimulation and recording\n\t\nUse a sub-stage full-field light stimulator as described elsewhere10,21,26 to perform the following steps.",
    "Note: A simple solution for a full-field light stimulator is to use two band-pass-filtered LEDs (e.g., “blue”: 360 BP 12, “green”: 578 BP 10) that match the wavelength sensitivities of mouse cones but at the same time do not overlap with the filters used for fluorescence detection (cf. 3.2.4). The light from the LEDs is focused by the condenser through the bottom of the recording chamber (Figure 2). For details on this stimulator design, its calibration, the light intensities used and the evoked cone photo-isomerisation rates, see10,21,26.\nTurn on the laser and allow cones to adapt to the scanning laser and the stimulus background light (20 - 30 sec, see also Potential Pitfalls) before presenting light stimuli (see 3.2.3) or applying pharmacological agents.\nStart presentation of arbitrary stimuli (e.g., flashes of light, as shown in Figure 3B,C). In the case of the stimulator described in step 3.2.1, generate the stimuli by modulating the intensity of the two LEDs over time using a microprocessor board controlled by customized software (for details, see10,21,26).\nStart recording the two fluorescence channels (e.g., at 483 nm for “blue” FRET-donor eCFP and at 535 nm for “yellow” FRET-acceptor; for specs see Table 1) simultaneously using the respective image acquisition software (see also 3.1.6). For example, in the case of light flashes (Figure 3B,C), record at least 8 - 10 stimulus presentations (trials).\n“In-slice” Ca2+ calibration\n\t\nRecord Ca2+ signals in cone terminals (as described in 3.1.6 and 3.2.4) and extract the baseline Ca2+ level in a set of cones (as described in 3.4).",
    "Switch to “Ca2+ free” extracellular medium with 5 µM ionomycin (dissolved in DMSO) and 10 mM EGTA (or, alternatively, BAPTA) added. Record cone terminals again every 5 min to determine the minimal fluorescence ratio (Rmin), i.e., the ratio in the (near) absence of intracellular Ca2+. This may take anywhere between 15 - 30 min.\n\t\tNote: A perfusion system is required that allows switching between different reservoirs.\nSwitch to extracellular medium with 5 µM ionomycin (dissolved in DMSO) and 2.5 mM Ca2+. After an incubation time of 5 min, record cones again every 5 min to measure the maximal fluorescence ratio (Rmax), i.e., the ratio in the presence of saturating concentrations of intracellular Ca2+. Following ionomycin application, it may take between 3 - 15 min for the Ca2+ ratio to become stable.\n\t\tNote: Exposing the slices to high Ca2+ and ionomycin for a longer period will eventually damage the cells. Include only cells in the analysis that retain their normal morphology. Concentrations (i.e., EGTA, ionomycin) may need to be adapted. For more details on the Ca2+ calibration protocol, see13,17.\nData analysis\n\t Note: Use an image processing and data analysis software package compatible with the respective microscope software and capable of running custom analysis scripts.\n\t\nLoad an imaging data file and draw regions of interest (ROIs) around each cone terminal (Figure 3A). For each frame, average fluorescence intensity within the ROI and subtract background fluorescence, before calculating the ratio (R) between FRET-acceptor (citrine) and donor (eCFP) fluorescence (R=FA/FD; Figure 3B,C). This ratio is typically used as a proxy for relative intracellular Ca2+ concentration, but after calibration (see 3.3), also absolute concentrations can be estimated (see 3.4.3).",
    "Note: The pedicles can be recognized by their location in the outer plexiform layer and their morphology (somewhat flattened “blobs” smaller than the cone somata, located at the end of the cone axon).\nAverage stimulus trials (Figure 4A). Extract response parameters from averaged traces (Figure 4B), such as Ca2+ baseline level (Rbase) prior to light stimulation, peak amplitude (Ramp), and area under the curve (RA) as measures for response size. Also, extract response kinetics from averaged traces, such as response rise (trise) and decay time (tdecay) (= respective time intervals between 20% and 80% of Ramp; see illustration in Figure 4B). For more details on how to determine these parameters, see10.\nCalculate an estimate of the absolute cone Ca2+ concentration based on the measurements from steps 3.3.1-3.3.3. Use the ratios for minimal and maximal Ca2+ concentration, Rmin and Rmax, respectively, the donor fluorescence in the Ca2+-bound (FD,Ca-bound) and -unbound (FD,Ca-free) state, as well as the in-vivo dissociation constant (Kd = 0.77, see16) for TN-XL with the following equation (analogue to27):\nimgsrc://cloudfront.jove.com/files/ftp_upload/52588/52588eq1.jpg"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}