{
  "id": 4405,
  "origin_website": "Bio",
  "title": "Analysis of Mycobacterial Protein Secretion ",
  "procedures": [
    "Inoculation and growth of mycobacterial cultures Inoculate liquid cultures of mycobacteria from frozen stocks, prepared from mid-log phase mycobacterial cultures (OD600 between 0.5 to 1.0) that were frozen in 18% glycerol at -80 °C.For inoculation, the doubling rate of the mycobacterial species needs to be kept in mind. Msmeg doubles approximately every 3 h, whereas BCG and Mtb double approximately every 20 h in 7H9 complete media at 37 °C. The cultures are inoculated in 10 ml of 7H9 complete media in 30 ml square media bottles. Include appropriate antibiotics if required e.g. antibiotics can be included at appropriate concentration for selecting a plasmid when growing a transformed mycobacterial strain. The mycobacterial cultures are incubated at 37 °C with slow shaking at a speed of 90 rpm. BCG and Mtb cultures are placed in aerosol containment in a shaking incubator.For Msmeg, inoculate 200 µl from glycerol stock and grow overnight to saturation. Dilute the over-night culture 1:40 into fresh 7H9 complete media and grow to mid-log phase. For BCG and Mtb, inoculate 0.5 ml from frozen stock. It will take several days (~4 days) for the culture to reach mid-log phase and the exact time depends upon the initial inoculum density and growth conditions.  Measure the OD600 of the culture. Determine the culture volume required to give a final starting OD600 of at least 0.25 when resuspended in 25 ml of Sauton’s media [culture volume in ml = 25 ml x desired OD600 (e.g. 0.25)/OD600 of the experimental culture]. Transfer this volume of culture media to a 15 ml falcon tube and pellet the bacterial cells by centrifuging at 1500 x g for 7 min at room temperature. Remove the supernatant and resuspend the pellet in PBS.  Again centrifuge at 1,500 x g for 7 min.",
    "This wash step is important to remove albumin carried over from 7H9 complete media.  Notes:   As per our institutional standards of practice for centrifuging Mtb and BCG cultures, falcon tubes are placed in centrifuge adaptors that are put in Aerosolve® canisters (mentioned in Equipment, item 14) inside class II biosafety cabinet (BSC II). These are removed from the hood and loaded into the rotor and centrifuged. After spin, the whole Aerosolve® canister with the falcon tubes is carried back to the BSC II hood and opened. This procedure contains aerosols produced during centrifugation. Mtb cultures should be handled in BSL3 facility. Remove the supernatant and resuspend the bacterial pellet in 1 ml of Sauton’s media. Transfer this to 125 ml square media bottle containing 24 ml of Sauton’s media (include appropriate antibiotics in Sauton’s media as required). Incubate in the shaking incubator at 37 °C.  Notes: Sauton’s media is a minimal media in which mycobacteria grow more slowly than they do in 7H9 complete media. Alternatively, if the effect of metal ions on secretion is to be studied, one can use chelated Sauton’s media as the minimal media and add defined concentrations of metal ions. Monitor OD600 of the culture. Grow the culture to between 0.5 to 0.8 OD600. It takes about 6 h for Msmeg and 48 h for BCG and Mtb This procedure could be modified to inoculate the bacteria at a lower density and allow them to grow for a longer period of time, depending upon the goals of the experiment.Harvesting the bacterial culture and preparation of the WCEAfter incubating in Sauton’s media as described above, determine the OD600. Calculate the volume corresponding to 5 OD600 units. For example, if the OD600 of the culture is 0.",
    "5, then 10 ml will correspond to 5 OD units (desired volume = 5/OD600 of the experimental culture).Transfer 5 OD600 of the culture into a 15 ml falcon tube (to be used to prepare the WCE). Transfer the remaining culture into a 50 ml falcon tube (to be used to precipitate proteins from the CF). Centrifuge both tubes at 2,000 x g for 5 min at 4 °C. Pool the supernatant from both the 15 and 50 ml falcons into one unused 50 ml falcon tube and store on ice until you are ready to process it further (see below, preparation of CF in step C).  Wash the pellet in the 15 ml falcon with 5 ml of PBS by resuspending and centrifuging at 2,000 x g, 5 min, 4 °C.Discard the supernatant and resuspend the pellet again in 1 ml of PBS and transfer it to a 2 ml Sarstedt tube with O ring in the screw cap (for containing aerosols during bead beating). Spin on a table top centrifuge at 3,000 x g, 5min and discard the supernatant. To the pellet add 300 µl of protein extraction buffer with protease inhibitors. Resuspend the pellet by pippetting. Dispense 100 µl of 0.1 mm zirconia/silica beads into a 1.7 ml eppendorf and add this to the Sarstedt tube containing the pellet.Using a bead beater contained within a class II bio-safety cabinet (please read the bead beater manual for the operating procedure and also see the link provided in Equipment, item 19), bead beat the sample for 1 min at 3,450 oscillations/min and place it on ice for 2 min to cool. Repeat this twice. This sample is the WCE. Centrifuge the lysate at full speed for 2 min in a microcentrifuge to settle the froth before opening the tube.",
    "Notes: Alternate bead beaters may have different speeds and hence the user should optimize bead beating (speed and time) for maximal lysis of mycobacterial pellet.The degree of lysis can be established by plating the bacteria before and after bead beating for colony forming units. For SDS-PAGE, add 60 µl of 5x SDS-PAGE sample buffer to the Sarstedt tube and then gently mix by inversion. Incubate at 95 °C for 5 min. The heating step helps to denature the sample and also sterilize mycobacterial lysate after bead beating. The mycobacterial WCE can be stored at -80 °C. Note: The WCE of Mtb can generally be transferred out of BSL3 facility at this step as long as that is consistent with the institutional standards of practice.Before use, thaw at room temperature and then heat at 95 °C for 5 min. 20 µl of the WCE is often sufficient for SDS-PAGE and western analysis, although this amount will depend upon the target protein levels and the sensitivity of the detection method.TCA precipitation of the CFFilter the culture supernatant from step B9 through 0.22 µM filters using a 25 ml syringe into a fresh 50 ml falcon tube. Notes: Alternatively, it can be filtered by vacuum using 50 ml Steriflip-GV filter units (0.22 µM) to remove any bacteria from the supernatants. This can be done twice depending on the turbidity of the supernatant. Double filtration may also be required depending upon the standard operating procedures of the facility to transfer the CF from the BSL3 facility. Pre-chill trichloroacetic acid (TCA) on ice. Add TCA to a final concentration of 12% to the CF (3 ml of 100% TCA to the 25 ml sample). Invert the tube several times to mix and put the falcon tube at 4 °C overnight.",
    "Ensure the falcon tubes used for precipitation are compatible with organic solvents and high speed centrifugation.Spin the CF at 15,000 x g for 15 min at 4 °C.Discard the supernatant carefully to avoid loosing the pellet.Wash the remaining TCA by adding 5 ml acetone (pre-chilled at 4 °C) slowly along the sides of the tube.Spin at 15,000 x g for 15 min at 4 °C.Discard the supernatant very carefully at this stage since the pellet is not adhered tightly to the tube. Leave the tubes open in a Class II BSC for 10-20 min for faster drying of the pellet. Do not over dry to avoid difficulty in solubilizing of the pellet.  Resuspend the pellet in 150 µl 1x SDS-PAGE sample buffer. You may need to place tubes in a 65 °C water bath briefly to completely resuspend.If samples turns yellow due to incomplete removal of TCA, add a few microliters of 1 M Tris-HCl (pH 8) until they turn blue again. Store sample at -70 °C. Thaw before use. 10 µl of the sample may be enough for SDS-PAGE and western analysis, although the amount will depend upon the amount of the target protein and the sensitivity of the detection method."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}