{
  "id": 7021,
  "origin_website": "Bio",
  "title": "Advances in Proximity Ligation <em>in situ</em> Hybridization (PLISH)",
  "procedures": [
    "Probe design, sequences and templatesLabel probes (oligonucleotides conjugated to fluorophores) (Table 1)Label probes (LPs) bind to the VB barcodes within the single-stranded RCA amplicon. Each LP consists of 15-20 bases that are identical to the barcode region of the corresponding VB (and are therefore complementary to the RCA amplicon).Table 1. Label probe sequences for a 4 channel PLISHimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102003744_5451.jpg Order LPs from a vendor (e.g., IDT) on the 100 nanomole scale, with 5’ conjugation of the fluorophore and HPLC purification. Resuspend the LPs in TE buffer to a stock concentration of 100 µM and store at -20 °C. Prepare 10 µM working solutions in nuclease-free water and store at 4 °C.Plan your experiment so that you will use Cy5 for the most important target RNA. The simultaneous use of Cy3 and Texas red readouts may require linear unmixing to maximize the accurate discrimination of these two fluorophores, given their overlapping emission spectra. Consult your microscope software manual for instructions on linear unmixing, if available.If you plan to perform PLISH for more than 4 transcripts in a specimen, order LPs with the ‘T’ nucleotides substituted with deoxyuracil (Table 2). This enables the enzymatic erasure of LPs by USER (Uracil specific excision reagent) after photo-documentation (Refer to detailed protocol in Step C5b, in situ hybridization).Some LPs have additional nucleotides on the 5′ or 3′ ends to facilitate fluorophore conjugation and/or compatibility with the USER digestion protocol.Table 2. Label probe sequences for iterative PLISHimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102003807_3733.jpg Circle componentsCCC2.1 is the Common Connector CircleCCC2.15′ ATTCCTGACCTAACAAACATGCGTCTATAGTGGAGCCACATAATTAAACCTGGCTAT 3'(CCC2.1 is compatible with all Variable Bridges).VB barcodes that are identical to the corresponding label probe are in bold (Table 3).Table 3. Variable bridge sequences for PLISHimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102011754_3461.jpg Order CCC2.1 and VB on a 100 nanomole scale as 5′ phosphorylated oligonucleotides with HPLC purification.",
    "Prepare 10 µM stock aliquots in nuclease-free water and store at -20 °C.Hybridization probe design overviewStringent probe design is critical for optimizing transcript detection efficiency and minimizing the risk of false positive signal. A single PLISH probeset consists of one right probe (HR) and one left probe (HL). Each H probe is ~46 bases long, with an ~20 base region that is the reverse complement of the target RNA. The other ~26 base pairs comprise an “overhang” sequence that is the reverse complement to the variable bridge (VB) and common connector circle (CCC, see Figure 1) sequences. The design process starts by choosing an RNA transcript of interest from the National Center for Biotechnology Information (NCBI) Nucleotide database. We generally name the probeset using the HUGO (Human Genome Organization) Gene Nomenclature Committee (HGNC) approved gene symbol found at https://www.genenames.org[href=https://www.genenames.org].  Dinucleotides in the target transcript that can serve as the center of a Holliday junction are first identified, and the surrounding ~40 base RNA sequence is nominated as a candidate probe site. The candidate probe site sequence is then fed to the NCBI Basic Local Alignment Search Tool (BLAST) both to quantify homology to the target RNA and its transcript variants, and to determine if the degree of homology to off-target RNAs is below a minimum threshold (see “Criteria for Off-Target Homology” below). When the specificity criteria are met, the reverse complement of the RNA sequence on the 5' side of the junction center (the HL homology region) and the reverse complement of the RNA sequence on the 3' side of the junction center (the HR homology region) are catenated to an appropriate overhang sequence to produce complete H probes. The H probeset is analyzed using an online oligo calculator (refer to Step A3b.",
    "xvi) to determine whether the melting temperature of each arm of the prospective junction is acceptable, and to rule out the possibility of hairpin or dimer formation. Between five and ten H probeset pairs are designed per transcript. Cognate VB, CCC2.1 and LP oligonucleotides are ordered along with the H probes.  The RNA dinucleotide sequence at the junction center is intended to force the Holliday junction into a conformational isomer that is favorable for PLISH (Miick et al., 1997; Eichman et al., 2000; Liu et al., 2005; Hays et. al., 2006; Khuu et al., 2006). In general, we recommend using RNA dinucleotides 5′-AG-3′ or 5′-UA-3′ at base pairs 20 and 21 of candidate probe sites. However, requiring the optimal central dinucleotide sequence can overly restrict the number of candidate probe sites for short transcripts, for which the criterion may be relaxed.  In our experience, the major challenges in PLISH probe design relate to off-target homology and RNA access, since the tertiary and quaternary structure of endogenous target RNAs likely limits the accessibly of some candidate probe sites more than others. Probe dimerization and hairpin formation are less significant concerns, possibly due to the use of strong denaturants in the hybridization buffer.  We include a MATLAB script that was written to automate the above steps (see Appendix for the MATLAB file–PLISH_Probe_Design_BLAST210.m and accompanying instructions “How_to_use_the_MATLAB_Probe_Design_Script.pdf”), allowing the user to quickly identify candidate H-probe binding regions that do not have a high level of off-target homology. It also generates lists of H probes with overhang sequences corresponding to a specified VB barcode.  Please note that the MATLAB script is not required to perform PLISH. It is included as a potential convenience for some users.",
    "We recommend first designing probes by hand and optimizing the entire PLISH protocol prior to moving on to an automated design script.  Additional considerations are required prior to using the MATLAB script. First, if PLISH will be  used for a low number of genes (e.g., less than 10) then it is likely more efficient to design the probes by hand rather than investing in the required ancillary software needed for the MATLAB script. Second, the MATLAB script requires that the user have a stand-alone, or “local” installation of the NCBI BLAST search tool and Refseq database, which may necessitate additional computing resources. It also requires the user to set up the local BLAST search tool and related Refseq databases such that they can be “called” by MATLAB (and other programs) in the user’s operating system (usually Windows). Although we provide basic guidelines on how to install these NCBI tools, it is beyond the scope of this protocol to guide the user through this process, especially as updates and newer versions of BLAST are regularly released by the NCBI. Instead, the user is directed to the NCBI’s current online instructions and help resources for installation of both the search tool and the databases. Finally, updates in MATLAB or the NCBI tools could render the current script obsolete over time.  Our MATLAB script determines the specificity of a candidate probe to its probesite based on the number of significant BLAST alignments to genes other than the one from which the probesite is derived. The design of oligonucleotide probes specific for a transcript of interest at a genome-scale is an active area of research, with new tools emerging. One solution, OligoMiner (Beliveau et al.",
    ", 2018), provides a python-based pipeline which leverages both next-generation sequencing (NGS) alignment tools (such as Bowtie2) and linear discriminate analysis machine learning to determine target specificity.  If electing to use the MATLAB script, it is still recommended that the user manually verify (by entering the region of the RNA sequence targeted by the H-probe into NCBI BLAST) that off-target homology is acceptably low. The script will provide a FASTA file of these sequences which can be entered directly into the online NCBI BLAST search query for this purpose.Criteria for off-target homologyWhen performing a BLAST query, the settings outlined in Table 4 should be applied. Based on our experience with the hybridization conditions detailed in the new protocol, an alignment with a BlastN bit score of greater than 30 should be considered to have significant homology, irrespective of the number of base pair matches or gaps in the alignment. Note that when parsing the search results, only alignments to RNA (and not genomic DNA) are considered. Also, because the target RNA transcript sequence is used as input for the BLAST query, only \"Plus/Plus” (and not “Plus/Minus”) strand alignments are relevant. For example, a candidate sequence that has an alignment to an off-target transcript with a \"Plus/Plus” bit score of 35 would be deemed to have unacceptable off-target homology.Note: Plus/Plus vs. Plus/Minus Convention: For every Blast search, the result report will include 2 strands: The query (~40 bp candidate RNA sequence) and the subject (the RNA transcript pool database). Metrics describe how good the alignment is between the two strands. The Query is always presented as a “Plus” strand with a 5’-3’ orientation. Although the subject is also written in 5′-3′ orientation, BLAST will consider alignments to both the sense mRNA strand (“Plus”) and the anti-sense mRNA strand (“Minus”).",
    "The BLAST algorithm compares strands for similarity in a base-for-base fashion. After performing a BLAST query for a 40 bp query sequence, clicking on the ‘Alignment’ tab in the results page will show the pairwise alignment of sequences. The first few BLAST hits generally align to the sequence of the RNA of interest and its isoforms, with identities–40/40 (100%) and Strand–Plus/Plus indicating a base-for-base, query-to-subject alignment to the sense strand. In some of the subsequent hits (possible off-target RNA sequences) the strand alignments may be Plus/Plus (i.e., the query sequence aligns entirely or partly to the sense mRNA subject strand) or Plus/Minus (i.e., the query sequence aligns to the reverse complement of the sense mRNA subject strand). You may ignore hits that have Plus/Minus, because they are reverse complementary to your candidate RNA sequence (i.e., the aligned subject sequence is the same as the H probe sequence so there will be no off-target binding). Table 4. Settings for performing NCBI Blast searchimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102003853_3598.jpg Detailed H Probe Design Protocol for mRNANavigate to the NCBI Nucleotide Database (https://www.ncbi.nlm.nih.gov/nucleotide?cmd[href=https://www.ncbi.nlm.nih.gov/nucleotide?cmd]=search).Search for the transcript of interest. On the results page, first filter the results by the taxon of interest using the menu in the top right corner (e.g., Homo sapiens or Mus musculus) and then by the molecule type using the menu in the left sidebar (RNA).Record the number of transcript variants, predicted or otherwise. Choose the search result for the primary transcript entry or for the lowest numbered transcript variant.Navigate to the bottom of the web page and examine the sequence (denoted by ORIGIN). Paste the full sequence into a word processor document such as Microsoft Word.Use the Control-F ‘find’ function to identify suitable central dinucleotides for a prospective Holliday junction. As noted above, these sites are 5′-AG-3′ or 5′-UA-3′.",
    "Once a Holliday junction site is found, use the Control-C function to ‘copy’ the 40 base pair sequence.Open the NCBI Basic Local Alignment Search Tool website (https://blast.ncbi.nlm.nih.gov/Blast.cgi[href=https://blast.ncbi.nlm.nih.gov/Blast.cgi]). Click on the “Nucleotide Blast” button.Paste the candidate sequence in the “Enter Query Sequence” Box at the top of the BlastN suite webpage.Next, choose the appropriate database. For Homo sapiens or Mus musculus the curated species-specific genome + transcript databases can be selected from the appropriate dropdown menu located to the right of “Database”. For other species, or for performing local blast queries, we recommend using the Referenced RNA sequences (Refseq_rna) database. This option will require the user to enter the organism name or Taxid (https://www.ncbi.nlm.nih.gov/taxonomy[href=https://www.ncbi.nlm.nih.gov/taxonomy]) in the box next to Organism (e.g., “Zebrafish” Taxid “7955”).Under “Program Selection” to the left of “Optimize for”, choose the “Somewhat similar sequences” or “blastn” option.Click on the “+” next to Algorithm Parameters.Change the Expect Threshold to 100 and the Word Size to 7. Match and Mismatch scores should be set to 2 and -3, and gap costs should be +5 and +2 for existence and extension, respectively. De-select the check box for Low complexity regions. Finally, click on the bottom BLAST button to run the search.Parse the Blast search results page. First ensure that the transcript of interest and all of its variants appear in the search results. Next, examine the off-target alignments. If the bit score of the alignment is over 30 and the strand result is “Plus/Plus”, then the candidate sequence has unacceptable off-target homology.1)If unacceptable off-target homology exists, the candidate sequence should be abandoned in favor of an alternative sequence. Return to Step A3bv. and try a new candidate sequence.",
    "2)If it is known with high confidence that an off-target transcript is not expressed in the tissue or cells that you plan to stain, the probe can still be considered for use in this context.Continue with Steps A3bv. through A3Bxiii. until a pool of 5-10 candidate RNA sequences have been identified.Divide each candidate RNA sequence in half. Base pairs 1-19 form the target site of HL and base pairs 20-40 form the target site of HR. Determine the reverse complements of the two 20 base target site sequences, which will constitute the target homology regions of HL and HR, respectively. Online tools such as “Sequence Massager” can be used.Analyze the HL and HR homology region sequences for Tm, hairpin formation, self-annealing, and 3′ complementarity. A Tm range of 45-65 °C is recommended. Acceptable deltaG values for hairpin formation should be greater than -3 kcal/mole, and for self-dimerization greater than -10 kcal/mole. The calculations can be performed with the online “Oligo Calculator”, with proprietary packages such as “Oligocalc” (MATLAB) or with the online IDT “OligoAnalyzer” tool. Since H probe hybridization is conducted in a denaturing high salt buffer, weak self-dimerization or hairpin formation should not necessarily rule out a candidate H probe.An appropriate left overhang sequence is catenated to the 3′ end of the HL homology region sequence, and a corresponding right overhang sequence is catenated to the 5′ end of the HR homology region sequence.Notes:1)When designing probes for transcripts that will be imaged together, it is essential to choose VR barcodes that are read out in distinct color channels.2)Pick at least 5 pairs of probes for abundantly expressed transcripts and 10 pairs for low or moderately expressed transcripts.3)In some cases, we have observed specificity issues when using probes with partial homology to an off-target RNA.",
    "The off-target signal is usually weaker than the on-target signal. Some probes with partial off-target homology may not be problematic, for instance when the off-target RNA is very lowly expressed or absent in the stained tissue.4)It is not essential that the H probes have exactly 20 bases of homology to the target RNA. Depending on the sequence, 19-25 bases of homology can provide an acceptable melting temperature. Melting temperatures should be at least 9 °C above the temperature at which the probes are incubated with the tissue sample, which is 37 °C in this protocol.5)For an initial test experiment, select one abundant transcript (5 pairs of H probes) and one or two RNAs that are expressed at a lower level (10 pairs of H probes) in the tissue you will be staining. It is most useful to select RNAs for which you already know the proper expression pattern, for instance cell type markers, to help gauge which condition provides the optimal sensitivity and specificity in the target tissue. Preparing individual and pooled stocks of H probesOrder H probes on the 25 nanomole scale as standard desalted oligonucleotides. Dissolve each H probe in TE buffer (pH 8.0) to make a 100 µM stock solution and store at -20 °C. Depending on the number of probe pairs designed for your transcript of interest, prepare pooled stocks as described below (Tables 5-7) and store at -20 °C.Table 5. Preparing 10 µM pooled stock for 5 pairs of H probes targeting Transcript A in a template for variable bridge VB01imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102003915_5628.jpg Table 6. Preparing 5 µM pooled stock for more than 5 pairs of H probes targeting Transcript A in variable bridge VB01imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102003934_5929.jpg Table 7. Preparing 5 µM pooled stock for 10 pairs of H probes targeting Transcript A in variable bridge VB01imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102003951_9683.",
    "jpg Template for designing H probesEvery H probe contains an ~20 base homology region that is complementary to the target RNA. The overhang on H probes consists of a 16-base region (highlighted in red) that binds to the VB oligonucleotide, and an 11-base region (highlighted in blue) that binds to the common connector circle oligonucleotide (Tables 8-10). Table 9 shows a 40 nucleotide region on the mouse Nkx 2.1 transcript that was used to design a pair H probes (Table 10).When designing H probes for one round of PLISH (1-4 genes), refer to Table 8 for templates. For iterative PLISH (> 4 genes), refer to Table 11.Table 8. Template for designing H probes for simultaneous four-plex PLISHimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004012_3443.jpg HLC2-VB01 denotes an HL probe that works with the CCC2.1 circle and VB01.LLLLL and RRRRR designate the regions where the ~20 base target homology sequences are placed.Table 9. Identifying a candidate probe site and prospective Holliday junction for the mouse Nkx2.1 transcript (NCBI reference number NM- 009385.3)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004031_5323.jpg The dinucleotide at the junction center (AG or UA in the RNA sequence) is highlighted in green.Table 10. Designing a pair of H probes targeting the mouse Nkx2.1 transcript (NCBI reference number NM- 009385.3)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102005011_8268.jpg The two nucleotides complementary to the junction center (AG or UA in the RNA sequence) are highlighted in green. mm, Mus Musculus. Table 11. H probe template sequences for iterative PLISHimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004107_4842.jpg LLLLL and RRRRR indicate the regions where the ~20 bp probe sequences are inserted.Sample preparationCells grown on coverslipsPreparing poly-L-Lysine coated coverslips in a tissue culture hood:Wash coverslips in 70% ethanol briefly then transfer them into sterile plates (that have also been pre-washed with 70% ethanol).Rinse once with tissue culture grade sterile water (Pyrogen-free).Incubate the coverslips in the poly-L-Lysine solution for 20 min.Rinse twice with tissue culture grade sterile water.",
    "Aspirate off all remaining water and allow the coverslips to air dry for 10 min in the tissue culture hood.Splitting cells growing in a flask (perform steps in a tissue culture hood):Aspirate off the media and discard it. For a medium-sized flask, wash once in 5 ml of a solution containing 1x PBS and 1 mM EDTA. Alternatively, you may use Trypsin.Cover the cells in 1 ml of a solution containing 1x PBS and 1 mM EDTA, then incubate the cells at 37 °C for 2-3 min (no more than 5 min). Gently tap the flask to ensure that the cells have detached into solution (cells should be visibly floating).Pre-dilute the cells at least ten-fold into fresh, pre-warmed media. Perform a final dilution (e.g., 1:20) with fresh media then gently pipet the cells onto Petri plates containing coverslips until they are submerged. Move Petri plates into 37 °C incubator where cells will settle onto coverslips and adhere. Grow the cells until they reach the desired level of confluency.When the cells are ready for analysis, rinse the coverslips in 1x PBS. Fix cells in 3.7% Formaldehyde (prepared in 1x PBS using 37% molecular biology grade Formaldehyde) at room temperature for 20 min.Pre-treat the coverslips with 10 mM Citrate pH 6.0 + 0.05% LDS at 70 °C for 30 min, followed by air drying (~5 min).Apply seal chambers. Proceed to the H probe hybridization step.Tissue sections collected on Superfrost glass slidesPrepare sections from OCT embedded cryoblocks or from paraffin blocks of Paraformaldehyde (PFA) fixed tissue. To cryoembed adult mouse lungs, immersion fix in 4% PFA with 1x PBS, 5 mM EDTA and 10 mM Citrate at 4 °C overnight.",
    "After fixation, transfer the lungs into a 30% Sucrose solution prepared in 1x PBS with 5 mM EDTA and 10 mM Citrate, then incubate at 4 °C overnight. Embed the lungs in OCT, freeze them, and store the cryoblock at -80 °C.For OCT blocks: Cut 14 µm sections and collect on clean Superfrost glass slides. Air dry for 5-10 min then proceed to sample treatment step.For FFPE samples: Cut 10 µm paraffin sections and collect them on clean Superfrost glass slides. Air dry the sections for 30 min then bake them at 60 °C for 1 h. To deparaffinize, immerse in Xylene twice for 5 min each; immerse in 100% ethanol twice for 5 min each; air dry slides for 5 min. Rehydrate the sections in a graded ethanol series (80% ethanol, 50% ethanol, then 1x PBS for 5 min each). Proceed to the sample treatment step.Tissue sections collected on poly-L-Lysine coated coverslipsCollecting tissue sections on coverslips facilitates iterated labelimage-erase cycles because the seal chambers do not have to be removed for imaging each cycle (which is the case when a slide is used).After imaging, LPs can be erased by USER enzyme (see Step C5b for protocol) then the specimen incubated with a new set of LPs to image another subset of transcripts.Wash the coverslips in 70% ethanol for 2 min and rinse them with nuclease-free water. Incubate the clean coverslips with poly-L-Lysine solution for 20 min with gentle rocking (the solution should uniformly coat the coverslips), remove the excess solution and air dry the coverslips for 10 min or until all of the moisture has evaporated. Store the coverslips protected from dust.Collect tissue sections on poly-L-Lysine coated coverslips. Air dry for 5 min at room temperature.",
    "Bake coverslips at 37 °C for 15-30 min for strong adhesion of the tissue. Proceed to the sample treatment step (Figure 2).Note: Consider the following when preparing tissue samples for PLISH. Prior to fixation, trim each tissue piece so its size does not exceed 10 mm. During collection, transfer tissues immediately to fixative solution to minimize RNA degradation. For cells, only perform the sample pretreatment step 1. Skip the sample pretreatment step 2. All reagents should be prepared using nuclease-free water. Maintain a clean work area and use ELIMINase to minimize risk of exposure of cells or tissue to RNases. Sample treatment for adult mouse lungSample treatment step 1: Prepare 10 mM Citrate pH 6.0 + 0.05% LDS in nuclease-free water and pour into a slide jar. Pre-warm this buffer in a water bath at 100 °C for 5 min. Place the air-dried slides into the jar and incubate for 5 min at 100 °C. Use forceps to transfer slides into a jar containing nuclease-free water. Rinse by lifting then re-immersing the slides in the water 4 times. Air dry the slides for 10 min. Use a Kimwipe to remove excess moisture. Apply seal chambers over the tissue. Rehydrate the sections with nuclease-free water for 1 min before proceeding to the next step. Each seal chamber accommodates ~50 µl volume (Figure 2).Sample treatment step 2: Prepare 0.025 mg/ml Pepsin (in 0.1 M HCl). Add this solution to the seal chamber wells and incubate at 37 °C in a humidified chamber for 5 min. Quickly remove the Pepsin solution and add 1x PBS to inactivate residual Pepsin (Figure 2). Proceed to hybridization of H probes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3808/bioprotoc-10-21-3808-g002.jpgFigure 2. An overview of the sample preparation protocol for PLISH.",
    "A fresh tissue specimen is chopped into smaller pieces (for full penetration of the fixative solution) then rapidly fixed. The tissues are then used to prepare OCT embedded cryoblocks or Formalin Fixed Paraffin Embedded (FFPE) blocks. Sections from these blocks are collected on Superfrost slides, deparaffinized (if required), subjected to de-crosslinking by boiling in 10 mM Citrate buffer at 100 °C, followed by proteolysis using Pepsin and hybridization of H probes. Cells grown on coverslips or slides are fixed, subjected to de-crosslinking by boiling in 10mM Citrate buffer at 100 °C, then H probes are hybridized.Note: The provided sample treatment is optimized for 14 µm adult mouse lung cryosections, but in our experience each tissue requires a customized treatment protocol that varies depending on the tissue under study, the fixation and embedding conditions, and the species of origin. Use the guidelines below to determine the optimal sample treatment conditions for your tissue of interest (Table 12; Figure 3). Note that tissue thickness can also impact on PLISH performance, so if the initial trials are suboptimal, you may wish to empirically test the effect of varying the section thickness. Table 12. Range of suggested conditions for determining optimal pretreatment for fixed frozen or FFPE samples of your tissue of interestimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004338_7807.jpg imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3808/bioprotoc-10-21-3808-g003.jpgFigure 3. Utilizing guidelines to identify optimal pretreatment conditions for normal human lung FFPE sections. A-F, 10 μm FFPE sections of normal human lung were processed for PLISH. The sample pretreatment guidelines mentioned in Table 12 were followed and PLISH was performed to detect human Surfactant protein C (SFTPC, red) using Cy5-conjugated label probes. Samples (A-F) were boiled in 10mM citrate buffer with 0.05% LDS at 100 °C for 5 min. This was followed by no pepsin treatment (A) or 5, 10, 20, 30 and 40 min of pepsin (0.",
    "1 mg/ml in 0.1 M HCl) digestion at 37 °C (B-F). A-C show weak detection of SFTPC. D shows maximum SFTPC detection indicating optimal pretreatment conditions. E and F show diminished SFTPC signal due to excess proteolytic digestion leading to loss of RNA. DAPI, blue. Scale, 50 μm. Images were acquired on a Leica Sp8 confocal microscope using a 633 nm laser (with a laser power level of 10%; PMT detector gain of 750 V and offset of–0.5%) and a 25x water immersion objective.In situ hybridizationThe example below shows how to perform PLISH for 2 transcripts. Transcript A has 5 pairs of H probes designed to work with the VB01 bridge and LP1 label probe. Transcript B has 10 pairs of H probes designed to work with the VB02 bridge and LP2 label probe.H probe Hybridization (Table 13)If using 5 pairs of H probes to target a transcript of interest (as described in Table 5), the final concentration of each probe in the hybridization reaction should be 100 nM. If using more than 5 pairs, the final concentration of each H probe in the hybridization reaction should be 50 nM. Therefore, for Transcript A (targeted using 5 pairs of H probes or a total of 10 probes) the pooled stock is 10 µM (Table 5), the final concentration of each H probe in the hybridization reaction is 100 nM and the total final concentration of all H probes targeting Transcript A is 1,000 nM (100 nM x 10 probes = 1,000 nM).",
    "For Transcript B (targeted using 10 pairs of H probes or a total of 20 probes) the pooled stock is 5 µM (Table 7), the final concentration of each H probe in the hybridization reaction is 50 nM and the total final concentration of all H probes targeting Transcript B is 1,000 nM (50 nM x 20 probes = 1,000 nM).Table 13. Hybridization buffer with probes targeting Transcript A and Transcript B imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004402_3918.jpg Add the hybridization buffer with probes to the sample and incubate at 37 °C in a humid chamber for 2 h. Wash four times for 5 min each in pre-warmed hybridization buffer at 37 °C, followed by one wash for 10 min with pre-warmed high salt buffer at 37 °C.Assembly of circle components (Table 14)Use each phosphorylated oligonucleotide (CCC2.1 and each VB) at a final concentration of 100 nM.Table 14. Circle hybridization buffer with phosphorylated circle and bridge oligonucleotidesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004424_4568.jpg Add circle hybridization buffer containing phosphorylated VB and CCC2.1 to the sample and incubate at 37 °C in humid chamber for 60 min. Wash twice for 5 min each in pre-warmed circle hybridization buffer at 37 °C. Wash for 2 min in pre-warmed 1x ligase buffer at 37 °C.Ligation Reaction (Table 15)Table 15. T4 DNA Ligase reaction miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004441_8420.jpg Add the ligation reaction mix to the sample and incubate at 37 °C in a humid chamber for 2 h. Wash twice for 5 min each in pre-warmed circle hybridization buffer at 37 °C. Wash for 2 min with pre-warmed 1x phi29 DNA polymerase buffer at 37 °C.Rolling Circle Amplification (RCA) Reaction (Table 16)Table 16. Rolling circle amplification reaction miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004558_2499.jpg Add the RCA reaction mix to the sample and incubate at 37 °C in a humid chamber overnight.",
    "Wash twice for 5 min each in pre-warmed label probe hybridization buffer at 37 °C.Label Probe Hybridization (Table 17)Use label probes at a final concentration of 100 nM each.Table 17. Label probe hybridization miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004802_1571.jpg Add the label probes to the sample and incubate at 37 °C in humid chamber for 30 min. From this point, the protocol diverges to three possible steps, depending on the experimental design.If no additional staining is plannedWash samples twice for 5 min each in PBST, then incubate for 5 min with DAPI in PBS (DAPI stock is 1 mg/ml; dilute the stock 1:1,000 in 1x PBS to prepare a working solution). Peel off the seal chamber and mount the sample in 1x PBS if using a water objective, or 80% glycerol if using a glycerol objective.If conducting additional round(s) of label probe hybridization for iterative PLISHWash samples twice for 5 min each in PBST, then incubate for 5 min with DAPI in PBS (the DAPI stock is 1 mg/ml; dilute stock 1:1,000 in 1x PBS to prepare a working solution). Image the specimen in PBS. After photo-documentation of labeled transcripts, proceed with the enzymatic erasure of label probes as detailed below.USER digestion (Table 18)Table 18. USER digestion miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004818_1878.jpg Incubate at 37 °C in a humidified chamber for 20 min. Wash samples twice for 5 min each in PBST.UDG (Uracil DNA Glycosylase) Inhibition (Table 19)Table 19. Uracil DNA Glycosylase Inhibitor reaction miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20201102/20201102004833_7344.jpg Incubate the samples at 37 °C in a humidified chamber for 20 min then remove the digestion solution and add the next round of LPs in label probe buffer. Incubate at 37 °C in humid chamber for 30 min.",
    "Note: If performing more than one label-image-erase cycle, we recommend fixing the samples after the RCA reaction step using 4% Paraformaldehyde for 10 min at room temperature, followed by washing twice for 5 min each in 1x PBS. If conducting combined PLISH and immunohistochemistry:Add 5 mM EDTA to all of the solutions used for the immunohistochemistry steps. Following label probe hybridization, wash samples twice for 5 min each in at room temperature. Add blocking solution (50 µl/ml serum, 1 µl/ml Triton X-100 and 0.03 g/ml BSA in PBS) and incubate for 1 h at room temperature with gentle rocking. Remove blocking solution and add primary antibody (diluted in blocking solution). Incubate samples for 2 h at room temperature or overnight at 4 °C with gentle rocking.  Wash samples four times for 5 min each in PBST at room temperature. Add secondary antibody (diluted in blocking solution) and incubate samples for 1 h at room temperature with gentle rocking. Wash samples four times for 5 min each in PBST at room temperature, then incubate for 5 min with DAPI in PBS at room temperature. Peel off the seal chamber and mount the sample in 1x PBS if using a water objective, or 80% glycerol if using a glycerol objective.  If you plan to store samples for imaging later, seal the coverslips with a thin coat of clear sealant along the edges and allow to dry completely in a dark chamber at room temperature. Store slides at 4 °C in a slide box protected from light."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}