{
  "id": 9546,
  "origin_website": "Jove",
  "title": "Imaging Calcium Responses in GFP-tagged Neurons of Hypothalamic Mouse Brain Slices",
  "procedures": [
    "1. Preparation of Solution and Agarose Gel\nPrepare extracellular solution according to the table with double distilled water. The pH will be ~7.3 after 10 min aeration with carbogen (95% O2 / 5% CO2), the osmolarity 300 mOsm8. If a higher osmolarity is required, it can be adjusted by adding more glucose (1 mM equals 1 mOsm). The solution is filtered twice using a 0.2 μm membrane filter to eliminate dust particles and possible bacterial contaminations.\ntable:\n﻿0,1,2,3,4,5\nName of reagent,Abbreviation,Mol. weight,Conc.,Company,Cat. N°\nSodium chloride,NaCl,58.44 g/mol,120 mM,VWR,27810\nSodium hydrogen carbonate,NaHCO3,84.01 g/mol,25 mM,Merck,106329\nPotassium chloride,KCl,74.55 g/mol,5 mM,Merck,104936\nBES*,C6H15NO5S,213.25 g/mol,5 mM,Sigma,14853\n\"Magnesium sulfate, anhydrous\",MgSO4,120.37 g/mol,1 mM,Sigma,M7506\nCalcium chloride dihydrate,CaCl*2H2O,147.02 g/mol,1 mM,Merck,102382\nD(+)-Glucose monohydrate,C6H12O8*H2O,198.17 g/mol,10 mM,Merck,108342\n* N,N-Bis(2-hydroxyethyl)-2-aminoethansulfonic acid\nThe solution is stored at 4 °C, but should be aerated with carbogen (95% O2 / 5% CO2) for 10 min before use.\nAt this time, prepare also 1 cm3 blocks of agar gel to stabilize the brain during the cutting procedure (see step 3). First, dissolve 4% (w/v) agar (Sigma) in double distilled water by heating the solution to approximately 60 °C. The heated dissolved agar solution is poured into a square Petri dish to a height of 1 cm. After cooling and hardening, the 4% agar gel is cut into blocks of 1 cm3. These blocks can be stored for up to 4 weeks at 4 °C.\n2. Dissection of the Mouse Brain\nPlease make sure that all animal experimental procedures are performed in accordance with the guidelines established by the animal welfare committees of the respective institutions.\nBefore sacrificing the animal, make sure the agar gel blocks are ready for use.",
    "Anesthetize the mouse with isoflurane (1-4% isoflurane in oxygen using a precision vaporizer for approximately 1 min). It is important to prevent hypoxia and therefore neuronal damage. A disadvantage of isoflurane is the cost and logistics of using precision vaporizers. A fatal overdose in an open system could be an alternative, since the mouse will be sacrificed. Occupational safety is in this case a serious concern. The isoflurane must be directly vented out of the room. Therefore, an overdose in an open system should be performed in a chemical fume hood.\nEuthanize the mouse by decapitation after monitoring the depth of anesthesia by testing the rear foot reflex. This pedal or paw pinch reflex is performed by firmly pinching a paw or toe between one's fingers to elicit a withdrawal response by the animal. An animal that shows a reflex is not at a surgical level of anesthesia and definitely not in a state to euthanize.\nAfter decapitation, cut the scalp with a single edge razorblade centrally in sagittal direction, from the frontal bone to the external occipital protuberance. Move the two parts of the scalp, first from the medial caudal end in rostral lateral direction, then down in ventral direction (Figure 1A-C).\nMake two lateral and one rostral cut in the foramen magnum with a small spring scissor (see for cutting direction the black dashed arrows in Figure 1C). Carefully cleave off the cranium from mediocaudal to lateral rostral with blunt forceps (see broad grey arrows in Figure 1C). In older animals a small cut at the sagittal suture is helpful and often necessary to avoid damaging cortical layers of the brain.",
    "At this moment the occipital, interparietal and parietal bones should be detached. If still present, the dura mater should be carefully removed using forceps to prevent damage to the brain in the next step.\nTake away the squamosal bone, the anterior ethmoidal and frontal foramen (Figure 1D).\nThe brain can now easily be removed using an inverted micro spoon spatula and severing the cranial nerves (Figure 1E).\n3. Slicing Coronal Hypothalamic Sections of the Mouse Brain\nPlace the brain on its ventral side on a cut-resistant surface and remove the cerebellum with a single edge razor blade (Figure 2A). This straight cut surface will be the basis for mounting the brain on a plate to enable slicing of coronal brain sections.\nGlue the brain with the cut section on the baseplate of the microtome (Zeiss, Hyrax V50) using low amounts of a fast curing high performance cyanoacrylate adhesive superglue (Loctite 406; Figure 1A). In addition, glue a 1 cm3 agar gel block (see 1.5) at the ventral side of the brain (see 'v' in Figure 2B) onto the baseplate of the microtome (Zeiss, Hyrax V50) to support and fix the brain while slicing. Make sure not to use too much glue, to evade that glue traverses between brain and gel block causing problems in removing tissue slices after the cut. The gel block will be located at the opposite side of the cutting blade from the microtome (Figure 2B).\nAfter a few seconds the bond has dried, put the plate into the bath of your microtome filled with 6 °C cold oxygenated (95% O2 / 5% CO2) extracellular solution (see 1.1).",
    "Use appropriate low slicing velocity and cut 300 μm thick slices. In case of our microtome, we use a frequency of 60 Hz, an amplitude of 0.8 mm and a velocity of 0.8 mm/s (Figure 2C). The coronal brain slices are either collected directly after each cut or can be left in the bath until the whole brain has been sectioned. The coronal brain slices are carefully transferred to a beaker with cold oxygenated extracellular solution. Various tools have been designed to perform the transfer (e.g. cut broad plastic or glass Pasteur pipettes or broad spoon spatulas). It depends on the experimentator which is being preferred. Most importantly, the slices should be handled appropriately to minimize damage.\nIf the microtome can be programmed to cut slices automatically, you can start to prepare the Ca2+ indicator dye loading solution at this moment. Otherwise, it is recommended that the preparation of this solution is performed before the brain slicing has ended to minimize delays for measuring Ca2+ responses in the neurons, namely before starting step 2.\n4. Preparation of the Ca2+ Indicator Dye Loading Solution\nA critical step in loading neurons remains often the health of the cells which depends on the amount of damage induced by and the speed of the dissection procedure. Another essential step seems to be the use of fresh Pluronic F-127 solution (see 4.1). It is being recommended to make this solution in the laboratory and not to use a premade solution from a vendor. Depending on the temperature, the humidity and the shelf lifetime of the Pluronic F-127 solution, we noted degradation of olfactory and brain neurons during the Ca2+ loading procedure.",
    "Prepare the 20% (w/v) Pluronic F-127 (Sigma) in dimethyl sulfoxide (DMSO) by adding the Pluronic F-127 powder on top of the DMSO solution. Directly sonicate this solution without prior vortex or mixing. Within 2 min sonication the Pluronic F-127 will be dissolved. 100 μl Pluronic F-127 solutions are prepared fresh weekly.\nTake one tube of 50 μg cell-permeable fura-red/AM (Invitrogen; AM, acetoxymethyl ester) and add 5 μl 20% Pluronic F-127 solution. Mix the solution using the tip of your pipette.\nAdd 45 μl extracellular solution (see 1.1) to the mix and vortex it shortly.\nAdd an additional 325 μl extracellular solution and sonicate the tube for 3 min.\nAfter sonication add 1.156 ml oxygenated (95% O2 / 5% CO2) extracellular solution to get your final Ca2+ indicator dye loading solution (30 μM fura-red/AM, 0.33% DMSO and 0.065% Pluronic F-127). Store the tube in a dark place until use (see 4.8).\nTransfer the coronal brain slices to a 6-well cell culture plate (BD Falcon) filled with oxygenated (95% O2 / 5% CO2) extracellular solution (up to six slices per well).\nSuck off the oxygenated extracellular solution from the chambers of the 6-well plate taking care not to damage the brain slices.\nPipet directly 750 μl of the Ca2+ indicator dye loading solution to every well. The brain slices should be covered by the solution containing fura-red/AM (immersion loading).\nIncubate the slices in an O2/CO2 cell culture incubator (O2: 23.5%; CO2: 5%) for 45 to 60 min at 37 °C.",
    "At the end of the incubation time, replace the Ca2+ indicator dye loading solution by fresh oxygenated extracellular solution to prevent overloading the cells with fura-red and influencing in a subtle way the Ca2+ measurement via the chelating action of the dye. The slices are then being kept in the O2/CO2 incubator (see previous point for settings) until use and are viable for up to 3-6 hr.\n5. Microscopy and Analysis\nIn this protocol, the fluorescence intensity of GFP, which identifies the cell of interest, and of the Ca2+ indicator dye will be measured simultaneously in brain slices. Thus, the confocal microscope should be equipped with the correct laser, filters and two photomultiplier tubes to collect the two emission signals. GFP and the change in fluorescence intensity of fura-red can be measured using a single excitation wavelength of 488 nm. Emission fluorescence from the fluorophores can be collected using a 522/DF35 nm filter for GFP and a long-pass filter for wavelengths greater than 600 nm for fura-red.\nTo start monitoring stimulus-induced changes in the fluorescence signal, which are a measure of the intracellular Ca2+ concentration, one of the fura-red loaded brain slices is transferred to a recording chamber (i.e. Warner Instruments RC-27 Open Bath Chamber) that can be mounted on the confocal microscope setup (Figure 3A,B).",
    "Secure the brain slice with a harp (Figure 3C) to prevent the slice to move due to the perfusion speed of the bath solution (oxygenated extracellular solution; see step 1.1). The harp (slice holder) is made of a parallel array of nylon threads (separated from each other by ~1 mm) strung on a U shape silver or platinum frame. The temperature of the bath solution at this step should be at least room temperature. If higher temperatures are required, appropriate care has to be taken to prevent condensation on microscope lenses and movement of the plane of focus due to shifting parts in the microscope.\nPerfuse the slice for 10 min with oxygenated extracellular solution to remove any surplus of extracellular Ca2+ indicator dye. The flow rate of the perfusion should be adjusted to ~100 μl/s (tips regarding an appropriate perfusion system see 9).\nLook at the slice through the microscope at low magnification, make a note of the orientation of the slice for your records and find your area of interest in the slice, in our case the hypothalamic area in the brain.",
    "Change to high magnification and find the cell of interest in the slice by collecting GFP images and simultaneously checking the fluorescence intensity of the fura-red signal (Figure 4A-C). Cells near the surface could be damaged or dead. Therefore, cells located at a depth of more than 10 μm should be selected for imaging. We could reliably measure cells up to a depth of 40-50 μm, whereafter the signal strength started to drop. Remember that the fura-red signal of cells at rest with low Ca2+ concentration have relative high fluorescence intensities. This high fluorescence intensity is in this case not a sign of dead cells. The GFP signal can be used to detect any drift or movement of the tissue slice or as an indicator for changes in intracellular pH10.\nAdjust the laser power to a value that allows measurements in the change of fura-red fluorescence intensity and prevents bleaching of the two fluorophores. Therefore, start with the lowest laser power and adjust to obtain a sufficient signal-to-noise ratio by changing black level (offset), detector aperture, gain and laser neutral density filters. Except for the laser power, the same should be done for the GFP signal.\nStart to acquire images at rates between 0.5 - 2 Hz to collect the fura-red and GFP signals. The acquisition rate should be optimized to the expected rate of the Ca2+ signal. Voltage-dependent Ca2+ spikes may cause quicker and shorter transients than activation of some signal transduction cascades requiring activation of various second messengers. The length of the image acquisition should be appropriate for the purpose of the experiment. The GFP signal over time will help determine if any movement of the brain slice has occurred.",
    "During the acquisition and the experiment, all scanning head settings have to be held constant to record reliable results that can be compared.\nThe changes in fluorescence over time can be analyzed using different mathematical programs, i.e. ImageJ (NIH, Bethesda, MD; http://rsb.info.nih.gov/ij/[href=http://rsb.info.nih.gov/ij/]), Igor Pro (Wavemetrics) or MatLab (The MathWorks). By encircling the somata of a GFP-tagged neuron indicating the region of interest (ROI), this exact same region can be analyzed for changes in Ca2+ using the fura-red fluorescence signal over time.\nCa2+ signals can be presented as arbitrary fluorescence units or as values (ΔF/F) of the relative change in fluorescence intensity (ΔF) normalized to the baseline fluorescence (F). This procedure results in a negative deflection when the intracellular Ca2+ concentration increases using fura-red as the Ca2+ indicator dye. To ease the interpretation of the results, we recommend multiplying the ΔF/F values with -1 to obtain positive fluorescence signals to display a rise in Ca2+ (Figure 4C).\nTo compare results between neurons the amplitude and frequency of the Ca2+ signals are usually analyzed. Yet, some Ca2+ signals do not occur with a regular period or comparable amplitudes. Some signals might be strongly influenced by stochastic processes within the cell. Thus, to quantify the total change in Ca2+ in a given cell and to enable comparison of Ca2+ responses between neurons in different brain regions, analysis of the area-under-the-curve (AUC) is more appropriate. This measure for the amount of Ca2+ encompasses any initial Ca2+ transient, second phases and sustained elevated Ca2+ responses and oscillations. In this case care should be taken to analyze the same time period to enable the comparison between neurons.\n6. Representative Results",
    "To start characterizing gonadotropin releasing hormone receptor (GnRHR) expressing neurons in the hypothalamus we made use of transgenic mice that express GFP after Cre-mediated excision in GnRHR-expressing neurons4,11. GFP fluorescent neurons were identified in various brain areas, including the hypothalamus. To investigate the physiological properties of these GnRHR neurons, we first recorded Ca2+ signals in hypothalamic slices using a confocal microscope. First, we obtained coronal brain slices from these mice using the above-described protocol. Figure 1 illustrates the necessary tools, material and steps for excising a mouse brain. The coronal hypothalamic brain slices were cut (Figure 2) and then loaded according to the steps in point 4 of the protocol. Single brain slice of the appropriate area are placed in a recording chamber, secured with a harp (Figure 3) and then imaged using a confocal microscope (see steps 5.1-5.9). Figure 4 shows an example of two individual coronal brain slices identifying single GnRHR-τGFP cell bodies, the fluorescence at rest after loading the brain slice with fura-red/AM and the merged confocal image indicating that the GFP neuron had taken up fura-red sufficiently to enable investigation of stimulus-induced Ca2+ signals in these cells. Using our protocol we initially tested whether GnRHR neurons utilize similar Ca2+ signals for stimulus detection in different areas of the hypothalamus in response to direct activation with GnRH (Figure 4E). However, these signals differed in their waveform depending on stimulus strength and brain area4. To quantify the change in the dynamics of the Ca2+ responses, the area-under-the-curve (AUC) can be calculated as a measure for the increase in intracellular Ca2+ (Figure 4E)4. Studies are currently underway to investigate the molecular basis underlying the Ca2+ waves and oscillations, their dependence on sex and hormonal status of the animal, and whether they can be modulated by other natural stimuli.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4213/4213fig1.jpg",
    "Figure 1. Tools, material and steps for excising a mouse brain. A. Tools and materials used for brain dissection: 1, Loctite 406 superglue; 2, micro spoon spatula; 3, single edge razor blade; 4, small and medium spring scissors; 5, blunt forceps; 6, scissors; 7, Petri dish containing agar gel block; 8, base plate for mounting brain into microtome. B-F. Images of some steps being described in point 2 of the protocol. B. Photograph of a mouse head indicating the cutting position of the scalp (red line) and arrows (orange) indicating the direction the skin should be pulled away from the bone (see step 2.4). C. Photograph of the mouse head after the skin is pulled away showing the bone structures (see step 2.4). Cutting direction of the scissor and the direction for breaking open the cranium with the blunt forceps is indicated with either the black dashed arrows or grey broad arrows, respectively. D. Photograph of the mouse brain after eliminating the various bone structures (see step 2.5 - 2.7). E. Photograph of the removal of the brain still connected to the skull via the cranial nerves. F. Photograph of a relatively undamaged mouse brain.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4213/4213fig2.jpg\nFigure 2. Slicing of coronal hypothalamic sections of the mouse brain.  A. Photograph indicating the position of the single edge razor blade for eliminating the cerebellum (see step 3.1). B. Position of agar gel block in relation to the brain glued onto the baseplate of the microtome (see step 3.2). C. Cutting of coronal brain slice (note here the location of brain and gel block positions in regard to the cutting blade of the microtome; see step. 3.4). d, dorsal; v, ventral.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4213/4213fig3.jpg",
    "Figure 3. Brain slice positioned in recording chamber.  A,B. Overview (A) and higher magnification (B) of a Warner Instruments RC-27 open bath recording chamber giving broad access to the hypothalamic areas of the coronal brain slice (see step 5.1). C. U-shaped metal harp containing parallel arrays of nylon threads which will hold the slice in position in the recording chamber (see step 5.2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/4213/4213fig4.jpg",
    "Figure 4. Ca2+ signals in τGFP neurons of mouse hypothalamic brain slices.  A-D. Identification of a GFP neuron and simultaneous acquisition of the fura-red fluorescence in coronal mouse brain slices. A. Confocal image of a coronal brain slice identifying GnRHR-τGFP neurons (green). B. Relatively uniform fluorescence signal (red) of the brain area shown in A observed after loading the brain slice with fura-red/AM. C. Merged image showing the neurons depicted in A loaded with the Ca2+ indicator dye (yellowish). Boundaries of GFP neuron somata are indicated in dashed white lines, whereas examples of two non-GFP somata (arrows) are indicated in grey lines. D. Example of a GFP and non-GFP neuron with higher amounts of red fluorescence compared to the background. E. Examples of somatic stimulus-induced Ca2+ responses from individual GFP-tagged neurons in different hypothalamic brain areas (Pe, periventricular nucleus; DM, dorsomedial hypothalamus; Arc, arcuate nucleus). Area-under-the-curve (AUC) is depicted by the red area. The distinct Ca2+ signals between GnRHR-expressing neurons from different hypothalamic nuclei can be compared using the AUC as an estimate for the total change in Ca2+ in a given cell during the same period. F. Schematic drawings and diagram indicating the location of the GFP-tagged neurons analyzed in A-E. Upper panel: location of a coronal brain section containing hypothalamic brain regions (red line). Middle and lower panel: Schematic drawing of a brain slice (middle) and magnification of its red boxed area (lower panel) indicating with red dots the approximate position of the recorded GFP-tagged neurons from the Pe, DM and Arc shown in E; black area in lower panel scheme: 3rd ventricle. Lower two diagrams are adapted from Paxinos and Franklin12. Lower left corner number indicates the distance (mm) from Bregma.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}