{
  "id": 6446,
  "origin_website": "Bio",
  "title": "Protein-peptide Interaction by Surface Plasmon Resonance",
  "procedures": [
    "pH scouting (determination of the optimal pH for the ligand)The positively charged ligand is electrostatically coupled to the negatively charged surface of the sensor chip, leading to ligand concentration. pH scouting is performed so as to determine the pH range that concentrates the ligand.Dilute ligand to a final concentration of 5-200 μg/ml (higher protein concentration is necessary for ligands that are difficult to concentrate) in 10 mM acetate buffer of different pH. A regeneration step using 50 mM NaOH is performed after each pH scouting step.Below is an example of pH scouting of a ligand to a sensor chip.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130124/20130124040851_4373.jpgImmobilizationPrepare the ligand at optimal pH and concentration. The optimal pH is the highest pH that allows ligand concentration in pH scouting. For example, pH5 is the optimal pH for the ligand shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141021/20141021182246_2290.jpgFigure 1. pH scoutingBelow is an example of immobilization of a ligand to a sensor chip.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130124/20130124040959_3770.jpg* EDC: N-ethyl-N’-(3-dimethylaminopropyl)carbodiimide hydrochlorideNHS: N-hydroxysuccinimideThese two and ethanolamine are provided in the Amine Coupling Kit ** Flow cell 1 serves as a reference cell.After immobilization, run 1x running buffer for immobilization (1x RB-i) at 10 μl/min until the baseline becomes stable. A typical readout of immobilization is show in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141021/20141021182535_2241.jpgFigure 2. Immobilization Analyte preparationPrecise sample preparation is required for accurate measurement, particularly when the analyte is dissolved in organic solvent. Even a subtle difference of organic solvent concentration between the sample and running buffer leads to inaccuracy. Below is how we matched the DMSO concentration of our samples.Dilute 10x HBS buffer with MilliQ water and Tween-20 to 1.1x HBS buffer with 0.11% Tween-20.Add 25 ml of DMSO and 25 ml of MilliQ water to 450 ml of 1.1x HBS buffer with 0.11% Tween-20 to make 1x running buffer for binding assay (1x RB-b).",
    "Dilute 10 mM peptide in DMSO to 5 mM with MilliQ water, and further dilute to 500 μM with 1.1x HBS buffer with 0.11% Tween20 (this makes 500 μM peptide in 1x RB-b).Dilute 500 μM peptide mixture to 12.5 μM with 1x RB-b, followed by two-fold dilution to 0.39 μM with 1x RB-b.Regeneration conditionFor analytes with slow dissociation (when the sensorgram does not go back to the background level at the end of the dissociation step), a regeneration step must be performed after each binding assay. Determine an optimum regeneration condition for each analyte. The regeneration should not change the activity of the immobilized ligand (that is, the responses obtained from the binding assays before and after regeneration should be the same).Binding assayPerform the binding assay was with 1x RB-b.Below is an example of a binding assay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130124/20130124041115_6607.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20130124/20130124041158_8808.jpgData analysis is performed with the Biacore X100 Evaluation Software (GE Healthcare).A sensorgram of protein-peptide interaction is shown in Figure 3 and also in the reference (Eguchi et al., 2012).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141021/20141021182933_3440.jpgFigure 3. Binding assay"
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}