{
  "id": 2517,
  "origin_website": "Cell",
  "title": "Differentiating functional human islet-like aggregates from pluripotent stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe SC-islet differentiation protocol outlined below is divided into 7 stages, roughly corresponding with developmental stages of the pancreas. Each stage contains specific media compositions that sequentially guide PSCs into pancreatic endocrine lineages. Full media reagent lists will be outlined below, but the protocol itself will be broken into the key steps that modulate the success and efficiency of the differentiation. Namely, i) the initial seeding of PSCs in planar culture; ii) the efficient induction of definitive endoderm; iii) the formation of pancreatic progenitors and their generation into uniformly sized endocrine progenitor aggregates; and finally, iv) the maturation of the SC-islets in suspension culture. All steps in this protocol should take place within appropriate biosafety cabinets and under aseptic cell culture conditions.\nThis protocol will yield functional glucose-sensitive SC-islets after 44 days of culture. This functional state can also be maintained for a minimum of 3 weeks in the final Stage 7 culture conditions.\nAlthough yields can vary, 2 fully confluent 10 cm plates of PSCs at the start of the differentiation (seeded on Day 0) should be able to generate enough pancreatic progenitors to fill each well of a 6-well AggreWell plate, allowing the formation of approximately 8,000–10,000 SC-islets at the end of the protocol. This can therefore be scaled up or down depending on the required yields.\nHigh density seeding of pluripotent stem cells\nTiming: Day 0, 1 h",
    "This step ensures a fully confluent seeding of cultured PSCs that enables the highly efficient induction of definitive endoderm (DE). The planar steps of the protocol can take place in either Matrigel-coated 6-well or 10 cm tissue culture plates. For high yields and ease of media exchange we recommend running the differentiation in 10 cm plates. However, seeding a small number of wells in 6-well plates in parallel may be useful for quality control steps throughout the protocol that require cell extraction (see optional steps throughout).\nAllow Matrigel-coated plates to warm to room temperature (if stored at 4°C) and pre-warm E8 medium to room temperature.\nDissociate PSC colonies from 10 cm culture plates:\nAspirate E8 media and wash with 4–6 mL mL EDTA-PBS (0.5 mM) per plate.\nReplace the wash solution with another 4–6 mL of EDTA-PBS.\nIncubate the PSC plates at 37°C for 8–10 min.\nGently knock each plate to ensure that PSC colonies are beginning to dissociate and fragment into single cells. Adjust the incubation time accordingly.\nAdd 4–6 mL E8 medium (or DMEM/F12 medium) to each plate. Gently triturate the colony fragments using a serological pipette to acquire a single cell suspension. Pool the PSC suspension from each plate to a sterile 50 mL tube.\nRemove an aliquot of the cell suspension to perform a cell count. Centrifuge the remaining volume at 200 g for 3 min.\nRemove the supernatant and gently resuspend the cell pellet in E8 medium to a density of 2 × 106 cells/mL.\nPlate the dissociated cells at a density of 1.5–2 × 106 cells/well of a 6-well plate, or 12–14 × 106 cells/10 cm plate.\nAdd E8 medium to bring the total volume to 3 mL/well in 6-well plates and 12–14 mL in each 10 cm plate.",
    "Add ROCK inhibitor (Y-27632, 10 mM) to each plate/well for a final concentration of 10 μM.\nEvenly disperse the cells with a gentle criss-cross motion (avoid swirling the plate). Move plates to a humidified incubator and allow cells to attach overnight.\nCritical: High PSC confluency prior to the start of the induction of definitive endoderm is a key step in biasing the differentiation towards pancreatic lineage selection. The seeding densities here should act as a guide and may need optimizing depending on the viability and proliferative capacity of the PSC line being used.\nDefinitive endoderm induction (stage 1)\nTiming: Days 1–3, 30 min per day\nThis stage of the protocol is necessary to generate a dense layer of definitive endoderm (DE) from which to derive posterior foregut and pancreatic lineage identities in future steps. We have found that this is a critical step of the protocol and can be a common point of failure of the differentiation.\nCritical: The PSCs seeded on Day 0 should be 100% confluent before continuing with the differentiation (see Figure 1[href=https://www.wicell.org#fig1]). Low confluency, low cell viability or over-acidification of the media will result in poor differentiation efficiency. (See troubleshooting[href=https://www.wicell.org#troubleshooting], problem 1[href=https://www.wicell.org#sec6.1]).\nDay 1: Prepare an aliquot of Stage 1-Day 1 media and warm to 37°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig1.jpg\nFigure 1. Examples of Good and Poor PSC seeding prior to the start of the differentiation\nBefore the start of DE induction PSCs should be at 100% confluency (left panel). Any gaps in the cell layer or drops in confluency due to excessive cell death or under-seeding will negatively affect the differentiation (right panel, white arrow heads). Scale bar represents 200 μm.\n12 mL needed for each 10 cm plate.\n2 mL needed for each well of a 6-well plate.\ntable:files/protocols_protocol_2024_10.csv",
    "Gently remove the E8 media, rinse with 2 mL PBS per well (or 10 mL per 10 cm plate), and replace with the pre-warmed Stage 1-Day 1 media.\nReturn plates to an incubator overnight.\nDay 2: Prepare an aliquot of Stage 1-Day 2 media and warm to 37°C.\n12 mL needed for each 10 cm plate.\n2 mL needed for each well of a 6-well plate.\ntable:files/protocols_protocol_2024_11.csv\nGently remove the previous media and replace with the pre-warmed Stage 1-Day 2 media.\nReturn plates to an incubator overnight.\nDay 3: Prepare an aliquot of Stage 1-Day 3 media and warm to 37°C.\n12 mL needed for each 10 cm plate.\n2 mL needed for each well of a 6-well plate.\ntable:files/protocols_protocol_2024_12.csv\nGently remove the previous media and replace with the pre-warmed Stage 1-Day 3 media.\nReturn plates to an incubator overnight.\nNote: It is not uncommon to see a degree of cell death and detachment during DE induction. However, the proliferative nature of the cells at this stage should maintain a fully confluent cell layer.\nCritical: If a high rate of cell death or excessive detachment takes place during Stage 1 that results in gaps in the cell monolayer it is unlikely that the future steps of this protocol will be successful. To minimize the effect of harsh DE induction and excessive cell loss we recommend reducing the time in Stage 1 media slightly by initiating the change to Stage 2 media on Day 4 (below) as early as possible in the day. The media volume can also be increased if over-acidification is resulting in high cell death (3 mL per well in 6-well plates/16 mL per 10 cm plate).\nPancreatic progenitor formation (stage 2 to stage 4)\nTiming: Days 4–10, 30 min per day",
    "This portion of the protocol also takes place in planar cell culture and includes patterning factors that trigger differentiation through primitive gut tube (Stage 2), posterior foregut (Stage 3) and into pancreatic progenitor (Stage 4) lineages. Media must be changed each day following the compositions outlined below.\nDay 4 – Day 6: Prepare an aliquot of Stage 2 medium and warm to 37°C.\n12 mL needed for each 10 cm plate.\n2 mL needed for each well of a 6-well plate.\ntable:files/protocols_protocol_2024_13.csv\nGently remove the previous media and replace with the pre-warmed Stage 2 media.\nOptional: To ensure the efficient induction of DE in Stage 1, we recommend assaying the presence of the DE marker CXCR4 (CD184) through flow cytometry on Day 4. The dissociation of a well of Day 4 cells with EDTA-PBS followed by an antibody probe against CXCR4 should reveal an induction efficiency of >90% (Figure 2[href=https://www.wicell.org#fig2]). For more detailed analyses of DE induction, it is also possible to co-stain for other DE markers (such as CD117, SOX17 and/or FOXA2).\nDay 7 – Day 8: Prepare an aliquot of Stage 3 medium and warm to 37°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig2.jpg\nFigure 2. Estimating DE induction efficiency\nA flow cytometry plot of CXCR4-labeling following a successful Stage 1 DE induction. CXCR4+ cells (red), negative control (blue).\n12 mL needed for each 10 cm plate.\n2 mL needed for each well of a 6-well plate.\ntable:files/protocols_protocol_2024_14.csv\nGently remove the previous media and replace with the pre-warmed Stage 3 media.\nDay 9 – Day 10: Prepare an aliquot of Stage 4 medium and warm to 37°C.\n12 mL needed for each 10 cm plate.\n2 mL needed for each well of a 6-well plate.\ntable:files/protocols_protocol_2024_15.csv\nGently remove the previous media and replace with the pre-warmed Stage 4 media.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig3.jpg",
    "Figure 3. Morphological clues of pancreatic progenitor differentiation efficiency\nCell layer thickening during Stage 3 and Stage 4 of the protocol (Day 7 to Day 10) and maintenance of confluency is a strong indicator of pancreatic progenitor formation (left panels). A break in the cell layer or the formation of raised “ribbons” of cells is an indicator of poor pancreatic progenitor induction (middle and right panels, white dotted line areas). Pancreatic progenitor marker (PDX1, green), non-pancreatic marker (AFP, red). Scale bars represent 400 μm.\nNote: Throughout Stage 3 and 4 (Day 7 to Day 10) the cell layer should begin to noticeably thicken and retain a highly “crowded” appearance. Any break in the continuous cell layer or a “ribbon” pattern of raised cells is indicative of low pancreatic progenitor induction (Figure 3[href=https://www.wicell.org#fig3]).\nAggregation of pancreatic/endocrine progenitors (stage 4 to stage 5)\nTiming: Days 11–14: 2 h on Day 11 and 30 min other days\nThis step describes the critical transfer of pancreatic progenitors from planar culture into microwell plates to create uniformly sized aggregates. The formation of the aggregates serves two purposes. The first is to ensure that endocrine progenitor aggregates (formed throughout Stage 5) are of a regular size and composition to ensure the homogeneity of derived SC-islets at the end of the protocol. The second effect is that of an enrichment of pancreatic progenitors through the exclusion of non-pancreatic lineages, which tend not to re-aggregate following dissociation.\nDay 11: Prepare AggreWell 400 6-well microwell plates (approximately 1 × microwell plate for every 2 × 10 cm differentiation plate).\nAdd 2 mL anti-adherence rinsing solution per well and centrifuge at 1,300 g for 6 min.",
    "Check for air bubbles across the microwells under a microscope. Re-centrifuge as necessary to rid microwells of trapped air. Refer to Figure 4[href=https://www.wicell.org#fig4] as an example of trapped air within microwells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig4.jpg\nFigure 4. Representative images of microwell plates following anti-adherence treatment\nFollowing anti-adherence treatment and centrifugation, microwells should be free of any trapped air/bubbles (left panel). However, some microwells may contain trapped air bubbles that would impede aggregate formation (right panel, red arrow heads) and require further centrifugation (step 26 b).\nAspirate the rinsing solution and add 2 mL DMEM/F12 per well.\nNote: Appropriate pipette technique for coating and exchanging media in AggreWell plates should be adhered to, to ensure successful microwell seeding and aggregate maintenance (Figure 5[href=https://www.wicell.org#fig5]).\nDissociate pancreatic progenitors from the 10 cm culture plates:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig5.jpg\nFigure 5. Overview of correct pipetting technique for media exchanges within AggreWell plates\nGentle handling of seeded microwell plates is integral for maintaining aggregate yield. Media exchanges should follow the key principles in the left most panel. Media aspiration also follows the same pattern with slow aspiration of media with a serological pipette. Poor handling of seeded microwells, such as overly fast media addition or aspiration, will cause aggregate loss during aspiration. AggreWell plates should never be tilted for media exchanges as this may also dislodge the seeded aggregates.\nGently wash each plate with 4–6 mL of EDTA-PBS (0.5 mM).\nAspirate the EDTA-PBS and replace with 4–6 mL of TrypLE.\nIncubate for 8–12 min at 37°C.\nMild tapping of the plate should cause noticeable cell detachment from the plate, keep at 37°C until this occurs.\nAdd 4–6 mL of DMEM/F12 (or MCDB131) per plate and gently triturate with a wide-bore serological pipette.\nPool the cell suspensions from each plate into a sterile 50 mL tube.",
    "Critical: Rough mechanical dissociation of the progenitor cells will drastically lower cell viability and cause clumping of cells in the suspension. If cells do not easily detach, we recommend extending the incubation time in TrypLE rather than relying on harsher physical detachment techniques. However, an overly long dissociation in TrypLE can also have a negative impact on cell viability and trigger the formation of cellular debris that will negatively impact aggregation. Monitoring of cell detachment throughout the incubation time will help minimize cell loss.\nTake an aliquot of the cell suspension for a cell count estimation.\nCentrifuge the cell suspension at 200 g for 3 min.\nGently aspirate the supernatant, preferably with a serological pipette to minimize the chance of losing the loose cell pellet.\nGently resuspend the pellet in pre-warmed Stage 4 media (composition outlined at step 24) to a cell density of 1.2 × 106 cells/mL.\nCritical: Limit the amount of pipetting of the cell pellet during resuspension, as these cells are very sensitive to over-handling and manipulation.\nNote: An estimation of the volume of Stage 4 medium needed can be made during steps 28 and 29 of this protocol. Each well of the AggreWell plates will be seeded with 6 × 106 cells (5 mL of cell suspension, approximately 1,000 cells/microwell).\nAspirate the DMEM/F12 from each well of the microwell plate. Gently add 5 mL of the cell suspension to each well of the microwell plate (6 × 106 cells/well).\nCentrifuge the plate at 100 g for 3 min to ensure an even deposition of cells into the microwells (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig6.jpg\nFigure 6. Example images of AggreWell seeding at Day 11 and aggregate formation by Day 14",
    "Pancreatic progenitor seeding should appear evenly spread across all microwells and adequately fill each microwell (Day 11). In the following days (Stage 4 to Stage 5 transition) the progenitors should form spherical aggregates with low levels of cell debris. Scale bars represent 400 μm.\nGently move the AggreWell plates to a humidified incubator.\nDay 12: Gently add 2 mL of pre-warmed Stage 4 media (see step 24) to each well of the AggreWell plate.\nCritical: Media changes in AggreWell plates should be done as gently and slowly as possible using the side of each well to minimize disturbing the aggregates, which may float into other microwells and fuse or be lost through media aspiration. Guidelines on the appropriate technique for exchanging media within AggreWell plates are outlined in Figure 5[href=https://www.wicell.org#fig5].\nNote: In the days following AggreWell seeding, some tube-like cell aggregates or structures may form in each well. These can be gently removed and discarded without disturbing the aggregates underneath.\nDay 13 – Day 14: Prepare an aliquot of Stage 5 medium and warm to 37°C.\nExchange 4 mL of the previous media with 4 mL of Stage 5 media per well each day. Refer to Figure 5[href=https://www.wicell.org#fig5] for appropriate handling of seeded AggreWell plates.\ntable:files/protocols_protocol_2024_16.csv\nCritical: Do not use vacuum-based aspiration to remove media from AggreWell plates. Instead use a serological pipette to aspirate the media using the technique outlined in Figure 5[href=https://www.wicell.org#fig5].\nNote: During Days 12–14 the seeded progenitor cells should begin to aggregate and take on a spherical morphology (Figure 6[href=https://www.wicell.org#fig6]). We recommend maintaining the aggregates in AggreWell plates until Day 14 even if aggregate formation occurs earlier, as early removal may lead to a high degree of aggregate fusion and loss.",
    "Note: Some degree of aggregate loss is expected during the handling and media changes of AggreWell plates. However, careful handling of the plate and appropriate technique during media exchange should minimize the loss.\nOptional: As another quality control step, an aliquot of cells from the planar detachment step (step 27 Day 11) or following aggregation (Day 12) can be used to quantify the degree of pancreatic progenitor formation. This is done through flow cytometric assessment of PDX1 and NKX6.1 positive cells (antibodies used are listed in the key resources table[href=https://www.wicell.org#key-resources-table]) (Figure 7[href=https://www.wicell.org#fig7]). A yield of >60% double-positive cells is representative of an efficient pancreatic progenitor induction. Lower yields may result in fewer aggregates or aggregates of a reduced size.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig7.jpg\nFigure 7. Flow cytometry and IHC assessment of pancreatic progenitors generated by Day 11 of this protocol\nNKX6.1 and PDX1 double-positive cell proportion following a successful induction (left panel), negative control (blue) and antibody-probed cells (red). An even cell layer of double-positive cells can also be seen through IHC assessment of planar cultures prior to dissociation and aggregations (right panel). Scale bar represents 200 μm.\nTransfer of endocrine progenitor aggregates to suspension culture (stage 5)\nTiming: Day 15, 1 h\nDay 15: This step of the protocol transfers the endocrine progenitor (EP) aggregates formed through Stage 4 and 5 in the AggreWell microwell plates to a rotating suspension culture. These aggregates through further maturation steps will gain downstream cellular identities and form SC-islets. Each AggreWell well will be transferred into 1–1.5 wells of an ultra-low attachment (ULA) 6-well plate.\nRemove approximately 2 mL of media from each well of the AggreWell plate and transfer the media to wells of a ULA 6-well plate (1–2 mL per well).",
    "Agitate and swirl the AggreWell plate to gently dislodge aggregates from the microwells. A swirling action will pool the aggregates towards the center of the well and allow easy transfer into the ULA plate.\nUse a serological pipette to transfer the aggregates into the wells of the ULA 6-well plate. Try to ensure an even distribution of aggregates into the ULA wells.\nUse the remaining media in each of the AggreWells to gently dislodge any remaining aggregates from the microwells. Add the aggregates and remaining media to the ULA plate.\nTransfer the ULA 6-well plate(s) to a platform rotator (95 RPM) housed in a humidified cell culture incubator (37°C, 5% CO2) while preparing fresh Stage 5 media (step 42).\nNote: The culture of aggregates on the platform rotator is to aid in the diffusion of oxygen and nutrients and reduce the fusion of aggregates in suspension.\nCritical: Absolute platform rotator speed may need to be altered depending on the particular model of rotator. A too high rate of rotation may result in the fragmentation and loss of EP aggregates and SC-islets. Conversely, a too low rate of rotation (and/or too large volumes of media per well (>5.5 mL)) will result in higher rates of aggregate fusion.\nPrepare an aliquot of Stage 5 medium (see step 36) and warm to 37°C.\n5 mL per well of aggregates in the ULA plate.\nTransfer the ULA plate from the incubator, and swirl gently in a single direction to draw the aggregates to the center of each well.\nSlowly remove the previous media using a serological pipette at the very edge of each well.\nTrace the edge of each well as media is aspirated to avoid drawing in aggregates to the pipette.",
    "Add in 5 mL of fresh Stage 5 media to each well and return the plate to the platform rotator.\nDay 16: Repeat steps 42–45 but only exchange 4 mL Stage 5 media (see step 36) per well.\nExtended culture and maturation of SC-islets (stage 6 to stage 7)\nTiming: Days 17–44, 30 min every 2–3 days\nThese final two stages of the protocol maintain and further develop the EP-aggregates into terminally differentiated endocrine lineages and act to stabilize and functionally mature the resultant SC-islets. In contrast to Stage 1 to Stage 5, media changes in Stage 6 and 7 are done every 2–3 days, rather than daily media changes.\nNote: For ease of culture during SC-islet formation and maturation phases (Day 17 to Day 44) we recommend three media changes per week (Monday, Wednesday, and Friday).\nDay 17 - Day 23: Prepare an aliquot of Stage 6 medium.\n4 mL of media needed per well of 6-well ULA plate.\ntable:files/protocols_protocol_2024_17.csv\nTransfer the ULA plate from the incubator, and swirl gently in a single direction to draw the aggregates to the center of each well.\nSlowly remove 4 mL of the previous media using a serological pipette at the very edge of each well.\nTrace the edge of each well as media is aspirated to avoid drawing in aggregates to the pipette.\nAdd in 4 mL of fresh Stage 6 media to each well and return the plate to the platform rotator.\nDay 24 – Day 44+: Prepare an aliquot of Stage 7 media.\n4 mL of media needed per well of 6-well ULA plate.\ntable:files/protocols_protocol_2024_18.csv",
    "Note: The T3 dilution from the 10 mM stock solution may be unfeasible for many aliquots of Stage 7 media. We recommend preparing a 1:1,000 dilution of T3 in PBS to form a working stock of 10 μM T3 from which to make Stage 7 media. This stock can be kept at 4°C for up to 1 week (used at 1 μL per mL of Stage 7 media).\nTransfer the ULA plate from the incubator, and swirl gently in a single direction to draw the aggregates to the center of each well.\nSlowly remove 4 mL of the previous media using a serological pipette at the very edge of each well.\nTrace the edge of each well as media is aspirated to avoid drawing in aggregates to the pipette.\nAdd in 4 mL of fresh Stage 7 media to each well and return the plate to the platform rotator.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2024-Fig8.jpg\nFigure 8. Morphology and predominant endocrine cell populations of SC-islets\nThe expected morphology of SC-islets throughout Stage 6 and Stage 7 (left panel). Flow cytometric analysis of insulin- and glucagon-positive cells from early and late Stage 7 SC-islets (right panels). Antibodies used are shown in the key resources table[href=https://www.wicell.org#key-resources-table]. Scale bar represents 1,000 μm.\nNote: SC-islets formed in Stage 6 and Stage 7 do not require any form of passaging or splitting. The size of the aggregates should remain stable and low degrees of cell death and fragmentation should occur in these late maturation stages. Aggregates may darken slightly over time due to an accumulation of secretory granules but retain a rounded morphology (Figure 8[href=https://www.wicell.org#fig8]).",
    "Optional: Quantification of the endocrine subtypes present within the SC-islets can be assayed from Day 24 onwards. We have found that monohormonal insulin-positive beta-like cell numbers retain constant throughout Stage 7, whereas polyhormonal (insulin and glucagon double positive cells) will be prevalent early in Stage 7 but diminish during maturation, leading to an increasing pool of mono-hormonal glucagon-positive alpha-like cells (Figure 8[href=https://www.wicell.org#fig8])."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}