{
  "id": 18954,
  "origin_website": "Jove",
  "title": "Looking Outwards: Isolation of Cyanobacterial Released Carbohydrate Polymers and Proteins",
  "procedures": [
    "1. Cyanobacterial released carbohydrate polymer isolation\nPolymer isolation and removal of contaminants \nCultivate the cyanobacterial strain under standard conditions [e.g., 30 °C under a 12 h light (50 μE m−2s−1)/12 h dark regimen, with orbital shaking at 150 rpm]. Measure growth using standard protocols [e.g., optical density at 730 nm (OD730nm), chlorophyll a, dry-weight, etc.], then measure the production of released polysaccharides according to the phenol-sulfuric acid method16.\nTransfer the culture into dialysis membranes (12-14 kDa of molecular weight cut-off) and dialyze against a minimum of 10 volumes of deionized water for 24 h with continuous stirring.\n\t\tNOTE: Depending on the volume of culture to dialyze and medium composition, it may be necessary to change the dialysis water.\nCentrifuge the culture at 15,000 x g for 15 min at 4 °C. Transfer the supernatant to a new vial and discard the pellet (cells).\nCentrifuge again at 20,000 x g for 15 min at 4 °C to remove contaminants such as cell wall debris or lipopolysaccharides (LPS).\nTransfer the supernatant to a glass beaker and discard the pellet.\nPrecipitation of the polymer\nAdd 2 volumes of 96% ethanol to the supernatant.\nIncubate the suspension at 4 °C, at least overnight.\nPolymer recovery\n\t\t\nFor small or not visible amounts of precipitated polymer: centrifuge the suspension at 13,000 x g for 25 min at 4 °C. Discard the supernatant and resuspend the pellet in 1 mL or 2 mL of autoclaved deionized water. Transfer the aqueous suspension to a vial.\n\t\t\tCAUTION: The supernatant should be discarded gently, as it can become easily resuspended.\nFor visible/large amounts of precipitated polymer: collect the precipitated polymer with sterile metal forceps to a vial. Squeeze the polymer and discard the excess ethanol.",
    "Optional: depending on the degree of polymer purification required, repeat the precipitation step with 96% ethanol after resuspension of the polymers in deionized water.\nLyophilization of the polymer \nKeep the vials with the precipitated polymer at -80 °C, at least overnight.\nFreeze-dry (lyophilize) the polymer for at least 48 h (do not let the suspension defrost before freeze-drying).\nStore the dried polymer at room temperature (RT) until further use.\n\t\tNOTE: Storing the polymer in a desiccator is advisable, as it can absorb water over time.\n2. Cyanobacterial exoproteome isolation\nMedium concentration\nCultivate cyanobacteria under standard conditions [e.g., 30 °C under a 12 h light (50 μE m−2s−1)/12 h dark regimen, with orbital shaking at 150 rpm]. Monitor the cyanobacterium growth using standard procedures (e.g., OD730nm, chlorophyll a, dry-weight, etc.).\nCentrifuge the cultures at 4,000 x g, for 10 min at RT.\nTransfer the supernatant to a flask and discard the cell pellet.\nFilter the decanted medium through a 0.2 μm pore size filter.\n\t\tNOTE: The protocol can be paused here for a short time period, if the medium is kept at 4 °C.\nConcentrate the medium approximately 500x (considering the initial volume of filtered medium), using centrifugal concentrators with a nominal molecular weight cut-off of 3 kDa. Centrifugation should be operated at 4,000 x g (maximum 1 h per centrifugation round) at 15 °C.\n\t\tCAUTION: For the majority of concentrator brands, the filter device needs to be rinsed by centrifugation with ultrapure water before use. Once the filter is wet, do not let it dry out. Leave enough fluid on the reservoir when the device is not being used.",
    "NOTE: Reducing the centrifugation temperature to 4 °C may be helpful if the aim is to study protein activity, though it will increase the time necessary for sample concentration. The protocol can be paused between centrifugation steps for short time periods if the medium is kept at 4 °C.\nRinse the walls of the filter device sample reservoir with the concentrated sample and transfer the content to a microcentrifuge tube.\nPerform an additional washing step of the filter device sample reservoir with autoclaved culture medium to ensure maximal exoproteome recovery.\n\t\tNOTE: To quantify the percentage of recovery, follow the specific manufacturer’s instructions.\nStore the exoproteome samples at -20 °C until further use.\n\t\tNOTE: Addition of protease inhibitors is recommended for long-term storage.\nAnalysis of the exoproteome\nQuantify the protein content by BCA protein assay in 96-well plate according to the manufacturer’s instructions.\nSeparate the proteins by sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE), using standard staining protocols (e.g., Coomassie blue, silver staining).\nCut out the bands/gel regions of interest and collect them in different microcentrifuge tubes containing appropriate volumes of ultra-pure water.\nProceed with identification and analysis of the proteins by mass spectrometry.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}