{
  "id": 18744,
  "origin_website": "Jove",
  "title": "Tumor Treating Field Therapy in Combination with Bevacizumab for the Treatment of Recurrent Glioblastoma",
  "procedures": [
    "NOTE: This protocol consists of two parts: the detailed methodology for applying the TTF System and the methodology for bevacizumab infusion8-11. The FDA mandates that only prescribers trained by the manufacturer may prescribe the device. Patients eligible for TTF Therapy are those 22 years of age or older with recurrent glioblastoma, typically after surgical, surgery and radiation options have been exhausted but should have received at least one prior chemotherapy regimen. Contraindications to the use of TTF Therapy include sensitivity to conductive hydrogels, the presence of an active implanted medical device (deep brain stimulators, spinal cord stimulators, vagus nerve stimulators, pacemakers, defibrillators, and programmable shunts), a skull defect or bullet fragment(s). While the TTF Therapy is generally well tolerated, the most typical device-related adverse event is skin redness and occasionally skin breakdown due to the prolonged contact of the transducer arrays to the skin surface. To minimize this potential side effect, the arrays are typically changed twice a week and if a skin reaction is observed, the arrays can be moved away from the site of skin redness or inflammation. These skin reactions can also be treated by topical steroids and/or topical antibiotics if needed1.\n1. Application of the TTF System\nNOTE: the system consists of the following components: an electric field generator (the Device), a connection cable and box, a portable battery(s), a charger for portable batteries, a plug-in power supply, and a set of Transducer arrays (4) (Figure 1).\nAssembling the System\n\tNOTE: In order for the electric field generator to deliver the electric fields to the tumor mass, the components have to be interconnected in the following manner:\n\t\nCharge the battery(s) using the battery charger by connecting its power cord to a standard wall outlet and switch on the power button on the back of the charger.",
    "NOTE: A battery rack can hold up to 3 batteries at a time.\nUse a charged battery to power the electric field generator or “Device”, which in turn delivers the electric fields to the transducer arrays.\nPlug the battery in through its connecter to a socket labeled “DC IN” on the front panel of the device. Ensure that the arrows on the battery connector are facing up towards the “DC IN” sign while plugging in the connector.\nTurn on the power button after the battery is plugged into the device.\nConnect each of the four transducer array connectors, using the color coded plugs, to the matching color-coded socket on the connection cable box.\n\t\tNOTE: for example, the transducer array connector with the red ring is plugged into the red socket (labeled “N1”) on the connection cable box (see Figure 1).\nConnect the coiled connection cable to the box on one end and the device to the other end.\nConnect the battery to the device to provide the necessary power for the device to generate the alternating electric fields.\nConnect the device to the connection cable and box using the color coded sockets that match color coded cables attached to the transducer arrays.\nApplying the Transducer Arrays to the Scalp\n\t\nPrepare the patients head for array application. Shave the entire scalp using an electric shaver. Ensure no stubble remains and wipe the scalp with 70% medical grade alcohol.\n\t\tNOTE: An over-the-counter hydrocortisone (steroid) cream may be used if the scalp is irritated.\nLay out the transducer arrays according to a pre-determined specific array layout on a patients clean and shaven scalp.",
    "NOTE: The array layout is calculated using special software that utilizes head and tumor measurements from the patients’ magnetic resonance imaging (MRI) in order to generate the optimal electric field intensity at the site of the tumor to achieve maximal results.\nPeel off the envelopes and remove the arrays then apply to the scalp according to specific array layout color scheme.\n\t\tNOTE: The transducer array locations and colors are: front (blue), back (red), right (yellow), left (white) according to where they are placed on the scalp.\n\t\tNOTE: Transducer arrays are supplied in clear sterile envelopes.\nSnap the plugs into the connector.\nPlace the color-coded plugs on the transducer array connectors of the four transducer arrays.\n\t\tNOTE: These colors match the color coding of the transducer array placement diagram that has been generated for each patient with the help of special software (1.2.2).\nPlug the array cables into the color-matched connection cable and box as mentioned above (see section 1.1).\nTurn on the power switch on the device once the arrays are in place and the system is fully connected.\nSwitch on the TTF Field button and the system is now ready for electric field delivery.\n\t\tNOTE: There is no standard duration for continuation of TTF Therapy, however, in the author’s opinion TTF Therapy can be continued until the time of clinical and/or radiographic progression of the disease or development of unacceptable toxicity. To achieve an optimal response, TTF Therapy should be used on a continuous basis for a minimum of 18 hr a day. Treatment duration of less than 18 hr per day has been associated with suboptimal response. A monthly compliance log can be downloaded from the device software by a Novocure technician.\n2. Concurrent Bevacizumab Administration",
    "NOTE: Bevacizumab is a humanized monoclonal antibody targeted against the vascular endothelial growth factor (VEGF) protein. By blocking the interaction of VEGF with its receptor, bevacizumab exerts a potent anti-angiogenic effect6,7. Typically bevacizumab is administered as an IV infusion (typically over 30 min) every 2 weeks. However, the TTF device is designed to be used on a continuous basis or at least for 18 hr per day in order to achieve optimal outcomes10.\nSelect patients carefully in order to minimize the potential for serious drug related complications.\n\tNOTE: The exclusion criteria for bevacizumab include recent intracranial hemorrhage, recent stroke or MI (less than 1 year), major surgery within 4 weeks, uncontrolled hypertension, pregnancy or lactation and imaging showing minimal or no contrast enhancing disease. Also, caution must be exercised in patients with renal disease including proteinuria, bleeding disorders, history of DVT, uncontrolled angina, cardiac arrhythmias, congestive heart failure, prior chest wall radiation, prior anthracycline exposure, patients on anticoagulants, recent (less than 6 months) arterial thromboembolic events and other serious medical illness.\nPrescreen patients with baseline testing to include complete blood count with differential, renal and liver function testing, serum electrolytes, urine dipstick for protein and pre and post infusion blood pressure measurement.\nAdminister the bevacizumab infusion once a patient is deemed an appropriate candidate using the standard dose of 10 mg/kg body weight and start the TTF System simultaneously with the bevacizumab infusion.\n\tNOTE: Give the initial infusion over 60 min and mix in 100 ml of normal saline. Provided that no complications develop, bevacizumab can be given over 30 min on subsequent infusions.\n3. Monitoring Patients Post Infusion",
    "Monitor the patient for infusion reactions such as fever, chills, pruritis, rash or angioedema. If these occur stop the bevacizumab infusion, and treat the reactions using standard approaches based on their degree of severity8,9,11.\n\tNOTE: Other complications of bevacizumab treatment that require dose modification or discontinuation include proteinuria and hypertension, both of which have been observed in clinical trials with bevacizumab8,9,11.\nIf acute hypertension (a rise of 20 mmHg or more in diastolic blood pressure or a blood pressure of 150/100 mmHg above normal baseline values) occurs, withhold bevacizumab. If the blood pressure subsequently returns to normal within 1h following the holding of the infusion, restart the infusion at ½ the initial rate. If sustained hypertension occurs then hypertension modification agents such as calcium channel blockers, ACE inhibitors or diuretics (hydrochlorothiazide).\nIf proteinuria (2+, 3+ or 4+ on urine dipstick) occurs then perform a 24 hr urine collection for protein. If the 24 hr urine protein reveals a protein level of less than 2 g/24 hr then administer bevacizumab at full strength. For levels between 2-4 g/24 hr, administer bevacizumab at 5 mg/Kg body weight (½ the standard dose). Discontinue Bevacizumab for protein levels of more than 4 g/24 hr.\nPerform gadolinium-DTPA enhanced magnetic resonance imaging once every 8-12 weeks to assess for tumor response.\n\tNOTE: A FLAIR sequence is also particularly helpful especially while administering bevacizumab, since occasionally the contrast enhanced component may diminish while the FLAIR signal change may show signs of progression.\nAssess the radiographic change of the glioblastoma using the newly published Revised Assessment in NeuroOncology (RANO) criteria (modified from the older Macdonald criteria)16."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}