{
  "id": 8459,
  "origin_website": "Jove",
  "title": "A Benchtop Approach to the Location Specific Blood Brain Barrier Opening using Focused Ultrasound in a Rat Model",
  "procedures": [
    "All experimental procedures were done in accordance with UAB Institutional Animal Care and Use Committee (IACUC) guidelines.\n1. Focused ultrasound driving equipment setup\nUse 50 Ohm coaxial BNC cables to connect (1) the input of the ultrasound transducer to the output of the RF amplifier and (2) the input of the RF amplifier to the output of the function generator.\nSet the function generator mode to a sinusoid burst once per second with a 1% duty cycle.\n\t\nFor the damped 1 MHz low-power immersion transducer with a 0.8 inch focal distance used with a 50 dB RF amplifier, set the starting settings to: 1 MHz sine wave, 1 V peak to peak, 10k cycle, 1 s interval (or period).\nFor the air backed, 1.1 MHz high-power transducer, set the initial settings to: 1.1 MHz sine wave, 50 mV peak to peak, 11k cycles, 1 s interval.\n\t\t​NOTE: Do not operate the transducers unless they are submerged. Do not place a hand or other body part at the ultrasound focus or touch the transducer face while it is operating.\n2. Focused ultrasound benchtop setup\n3D-print the stereotaxic frame and the stereotactic frame holder.\nConnect the transducer to the XYZ positioner using a clamp holding a PVC pipe (Figure 1a). Bolt the clamp onto the X-axis slide and lock with a wing nut.\n\t\nIf using the high-power ultrasound transducer, attach it to the PVC pipe using a matched pair of magnets. Ensure that one magnet has a hole and the other has a matching protrusion. Cap the bottom of the PVC pipe and attach one of the magnets to it using epoxy (see Figure 1b).",
    "Attach the second magnet to the top center of the high-power ultrasound transducer using epoxy. Make sure it is at the very center of the transducer (Figure 1c).\nIf using the high-power ultrasound transducer, make a pointer for nulling the XYZ positioner. The tip of this pointer indicates the location in space of the center of the transducer focus when the ultrasound transducer is attached to the XYZ positioner. Make a pointer out of an 18 G needle cut to be the length of the focal distance of the transducer plus the thickness of the transducer (Figure 1d).\n\t\nApply epoxy to a third magnet (this magnet also pairs with the PVC cap magnet) and attach it to the top of the pointer. The pointer will then be able to attach to the magnet on the PVC pipe for XYZ nulling (Figure 1d).\nIf using the low-power immersion transducer, 3D-print the file for the pointer and the mounting clip.\n\t\nAttach the low-power immersion transducer to the PVC pipe by clipping the mounting clip onto to the PVC pipe and insert the transducer into the ring (Figure 1f).\nMake a water bath by gluing together pieces cut from acrylic sheet that will be able to rest on top of the animal’s head above the stereotactic frame (Figure 1e).\n\t\nCut an opening in the bottom of the bath that is about the size of the animal’s head. Cover the hole in the water bath with a polyimide tape.\n\t\tNOTE: Care must be taken to ensure that water does not leak around the polyimide tape as it can wet the rat’s fur and cause hypothermia.",
    "Make an MRI fiducial by filling a 4 mm diameter thin-shelled plastic or glass sphere with an MRI visible fluid (e.g., Vitamin E oil) and seal it. Place it in the MRI fiducial holder on the right side of the 3D-printed stereotaxic frame (Figure 2a).\nFirmly secure the 3D-printed frame holder to the XYZ positioner at a good location for animal positioning. Slide the tab on the rostral end of the frame holder into the matching channel on the Y-axis rail and securing with set screws (Figure 1h, red arrows).\nFor driving the XYZ positioner, install the USB to serial converter onto a computer by following the manufacturer’s directions and plug in the converter. Install the runtime environment and motor controller software onto the PC.\n\t\nEnsure that the proper serial port is selected in the software by selecting the USB to serial converter in the port selection dropdown control on the front panel of the controller software. Connect the USB to serial converter to the stepper motor controller box using a 9-pin serial crossover cable (e.g., RS232 null modem cable).\nRun the controller software to test that the stepper motors can be driven under software control. This step may require the assistance of local IT support.\n3. Intracranial targeting procedure\nNOTE: Male Sprague Dawley rats weighing 250-350 g were used for these experiments. Animals had free access to water and rat chow, and were maintained on a 12:12 h light:dark cycle.\nPut the animal under anesthesia (3% isoflurane with oxygen) and check for the lack of response to the toe pinch. Then insert the catheter as described below.\n\t\nWarm the tail with a lamp to make is easier to hit the vein. Be careful not to overheat the animal or to burn the tail.",
    "Once the animal is asleep (does not respond to a toe pinch), insert the 24 G tail vein catheter that will be used to deliver microbubbles, Evans blue dye (EBD), gadobutrol MRI contrast if using MRI, and the experimental agent of interest. Once the vein is hit, blood will fill the sheath, slowly remove the inner needle while pushing the sheath further into the vein.\n\t\tNOTE: See a guide like Stuart and Schroeder33 if doing the rat tail vein injections for the first time.\nIf there is no blood flow, slowly move the catheter sheath out of the vein to test that the needle may have poked through the vein. If blood flows when the catheter is pulled back slightly, then first poke went through the vein and the catheter placement will need to be restarted at another location on the tail that is rostral to the previous location.\nFill the catheter plug with saline and screw the catheter plug into the end of the catheter port as soon as the port has filled with blood. Carefully wrap the lab tape around the catheter and the tail to keep it in place. Start with a small piece at the top and work in the caudal direction, leaving the very end of the catheter plug exposed.\nPlug the anesthesia line onto the anesthesia connector on the stereotaxic frame (Figure 2a) and fix the animals head into the frame by placing the mouth onto the bite bar and by guiding the ear bars into both ear canals, then tighten the set screws. Make sure the animals head is secure and level.\nMove the animal into the MRI bed and connect the anesthesia line to the nose cone. In this protocol a 9.4 T small bore animal MRI was used.",
    "Collect coronal and axial T2-weighted images that capture the whole brain as well as the MRI fiducial (Figure 2b) for coordinate measurements. Provide the local MRI physicist or tech the following information so that they can build the MRI protocol.\n\t\nFor coronal images (Figure 2b top), use the following parameters: number of images: 27, width: 62.2 mm, height: 62.2 mm, depth: 37.97 mm, Voxel size: 0.24 x 0.24 x 1.41 mm3.\nFor axial images (Figure 2b bottom), use the following parameters: number of images: 13, Width: 61.47 mm, Height: 53.81 mm, Depth: 16.7 mm, Voxel size: 0.41 x 0.21 x 1.29 mm3.\n\t\tNOTE: It is not necessary to have these exact parameters as long as the coronal in plane resolution is close to 0.25 mm and the images cover the whole brain and fiducial.\nCollect coordinate measurements from the above images by recording the distance from the MRI fiducial to the brain region that will be targeted with FUS.\n\t\nAt the scanner, on the coronal images collected in step 3.5, find the image in which the fiducial is the largest, indicating the center of the fiducial. Record the distance from the top of the fiducial to the brain region of interest in mm (the MRI software will have a scale or point measurement tool, consult local MRI tech or physicist on how to do this) in both the medial/lateral direction and in the dorsal ventral direction (Figure 2b, top).\nAt the scanner, on the axial images collected in step 3.5, find the image that shows the very top of the fiducial and measure the distance from the center of the fiducial to the target brain region in both the dorsal/ventral direction and in the medial/lateral direction (Figure 2b, bottom).",
    "Compare the two medial/lateral measurements and if they are different use the average. These coordinate measurements will be used later in step 4.3 for guiding the FUS focal point to the target brain region with the XYZ positioner.\nCollect MRI prescan images. Compare these images to the images collected after FUS BBB opening (Figure 4). T1-weighted images will later be used to visualize BBB opening, T2-weighted images will later be used to ensure no tissue damage has occurred following FUS treatment34.\n\t\nFor T1-weighted axial images, use the following parameters: width: 30 mm, height: 51.2 mm, depth: 3.0 mm, voxel size: 0.23 x 0.2 x 0.23 mm3, number of images: 13.\nFor T2-weighted axial images, use the following parameters: width: 30 mm, height: 51.2 mm, depth: 2.6 mm, voxel size: 0.2 x 0.2 x 0.2 mm3, number of images: 13.\nFor T1-weighted coronal images, use the following parameters: width: 30 mm, height: 30 mm, depth: 27 mm, voxel size: 0.16 x 0.16 x 1 mm3, number of images: 27.\nFor T2-weighted coronal images, use the following parameters: width: 30 mm, height: 30 mm, depth: 27 mm, voxel size: 0.12 x 0.12 x 1 mm3, number of images: 27.\n\t\tNOTE: As in step 3.5, these imaging parameters need not be exactly the same as listed. These images have a smaller FOV and higher resolution than the ones collected in step 3.5.\nKeeping the animal in the stereotaxic frame, quickly transport the animal from the MRI bed to the benchtop FUS setup. Ensure that the animal remain asleep for the transfer under the effect of anesthesia.",
    "For longer transfer times, use a box for transfer that is large enough to fit the animal and the frame. With the anesthesia plug still attached, place the animal and frame inside the box and allow the excess isoflurane to fill the box for a few minutes. Unplug the anesthesia line and quickly transfer.\n4. Focused ultrasound procedure\nUpon arriving to the FUS benchtop setup, immediately plug the anesthesia line into the nose cone and continue to run 1.5-3% isoflurane with oxygen. Do this as quickly as possible to avoid the animal waking up.\nSlide the frame into the frame holder and snap it into place firmly. Use clippers to shave the animal’s head. Brush away excess hair and apply hair remover cream to the scalp. Let sit for 3 min and wipe away with water and gauze.\nIf MRI is not available for targeting, use a standard (not 3D-printed) stereotactic frame to null the pointer position to bregma by touching the pointer tip to bregma (a scalp incision will be needed for this) and nulling the software or recording the coordinates. Move the XYZ carriage up by 50 mm by clicking the up 50 button in the software and swapping the pointer for the transducer. Based on a rat brain atlas as described previously35, move to the desired brain coordinates using the stepping buttons in the software. If using this method instead of MRI, skip down to section 4.6.",
    "If using MRI guidance, attach the pointer and move the pointer to the location of the MRI fiducial (Figure 1d,g). Position the pointer at the very top and center of the MRI fiducial (a small hole in the top of the fiducial holder is provided for pointing). Click the null position button which is the point from which all distances in the MRI image were calculated.\nRemove the pointer and move the positioner to the medial/lateral coordinates and the rostral/caudal coordinates. Raise the positioner up by pressing the up 50 button to allow for the placement of the water bath and ultrasound gel. If the top of the Z-axis travel is reached, the nulling location will be invalidated. The dorsal/ventral coordinate will be set after the transducer is added.\nApply ultrasound gel to the animal’s scalp and place the water bath over the animal with the polyimide tape window pressed onto the gel. Make sure that there are no air bubbles in the ultrasound gel.\nFill the water bath with degassed water.\nIf using the high-power transducer, lower the positioner so that the magnet is just above the water. Attach the transducer to the positioner by carefully lowering the transducer into the water at an angle to prevent air bubbles from getting trapped underneath the face and connect the magnets.\nIf using the low-power immersion transducer, lower the positioner into the water just above the transducer clip. Then clip the transducer in place by slowly lowering it into the water at an angle to prevent air bubbles from getting trapped underneath the face.\n\tNOTE: A transparent bath is helpful when looking under the transducer face for bubbles.\nLower the positioner to the dorsal/ventral coordinate.\nTurn on the RF power amp.",
    "Inject 1 mL/kg of 3% Evans blue dye (EBD) by sticking the needle tip into the catheter plug and injecting. Allow it to circulate for 5 min.\nActivate the microbubbles by shaking them violently with the with the bubble shaker.\n\t\nPrepare 5x the dose of 30 µL/kg of microbubbles (bubble conc. 1.2 x 1010/mL) in 0.2 mL of saline to account for the 2 FUS treatments and the tubing in the 18 G winged infusion set. For example, if the rat weighs 200 g, then fill the syringe containing 18 G needle tip with 30 µL of microbubbles in 1 mL of saline.\n\t\tNOTE: Make sure to use 18 G needle tips for both up taking and injecting with the winged infusion set.\nInvert the syringe several times to get a uniform distribution of microbubbles. Then attach and fill the winged infusion set. Position the syringe on the infusion pump and set the infusion pump to deliver 0.2 mL at a rate of 6 mL/h. This will provide slow infusion of the microbubbles over the 2-min FUS exposure.\nInsert the winged needle into the catheter plug.\nFirst, run the infusion pump, wait 3 s and start the FUS treatment by pressing the output enable button on the function generator (labeled “on” on the function generator in the Table of Materials). Repeat these two times per region with 5 min in between to allow the microbubbles to clear.\n\t\nPress the on button again on the function generator to stop the FUS treatment when the infusion pump stops at 2 min.\nWait for 5 min for the microbubbles to clear. Then start the infusion and the second FUS treatment.",
    "Immediately after the second FUS treatment, inject gadobutrol contrast (if using MRI) and the agent of interest, for example, viral particles. Total delivered volume of all agents should not exceed 5 mL/kg.\n\t\tNOTE: The timing of delivery (e.g., before or after FUS BBB opening) of the agent of interest may differ depending on the agent used.\nTurn off the RF power amp and immediately transport animal back to the MRI.\n5. MRI confirmation of BBB opening\nIf MRI is not available, skip to section 6 and use EBD expression for confirmation of BBB opening.\nPlace the animal back onto the MRI bed at the exact same location as in step 3.7 and plug in the anesthesia line.\nCollect the MRI post scans with the same imaging parameters used in step 3.7 to visualize gadobutrol MRI enhancement in the region of BBB opening (Figure 3b,e).\n6. Perfusion and tissue collection\nPerfuse the animal with cold 4% formalin until the blood runs completely clear.\nRemove the brain and place in 4% formalin or PFA at 4 °C overnight. Next, place brain in 30% sucrose solution until the brain sinks (about 2-3 days). Finally, flash freeze in liquid nitrogen or on dry ice and store at -80°C until cryosectioning.\nFreeze the brain in OCT and take cryosections.\nFix and coverslip sections for fluorescence microscopy. EBD excitation peaks at 470 and 540 nm and emission peaks at 680 nm. Coverslip with DAPI mounting medium in order to visualize overall cellular morphology.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}