{
  "id": 17795,
  "origin_website": "Jove",
  "title": "Standardized Model of Ventricular Fibrillation and Advanced Cardiac Life Support in Swine",
  "procedures": [
    "The experiments in this protocol were approved by the State and Institutional Animal Care Committee (Landesuntersuchungsamt Rheinland-Pfalz, Koblenz, Germany; Chairperson: Dr. Silvia Eisch-Wolf; approval no. G16-1-042). The experiments were conducted in accordance with the ARRIVE guidelines. Seven anesthetized male pigs (sus scrofa domestica) with a mean weight of 30 ± 2 kg and 12-16 weeks in age were included in the protocol.\n1. Anesthesia, intubation, and mechanical ventilation13,14\nMaintain animals in their normal environment as long as possible to minimize stress. Withhold food 6 h before the scheduled experiment to reduce the risk of aspiration, but do not refuse water access.\nSedate pigs with a combined injection of ketamine (4 mg/kg) and azaperone (8 mg/kg) in the neck or gluteal muscle with a needle (20 G) for intramuscular injection. Leave the animals undisturbed in their stables until sedation sets in (15-20 min).\n\tCAUTION: Gloves are absolutely necessary when handling animals.\nTransport the sedated animals to the laboratory. Transport time should not exceed effective sedation time (here, 30-60 min).\nMonitor the peripheral oxygen saturation (SpO2) with a sensor clipped to the tail or ear.\nDisinfect the skin with an alcoholic disinfectant before insertion of a peripheral vein catheter (20 G) into an ear vein. Spray the area, wipe 1x, spray again, and let the disinfectant dry.\nAdminister analgesia via intravenous injection of fentanyl (4 µg/kg). Induce anesthesia with intravenous injection of propofol (3 mg/kg)\nPlace the pig in supine position on a stretcher with a vacuum mattress and fix it with bandages. Apply muscle relaxant via intravenous injection of atracurium (0.5 mg/kg)",
    "Directly start noninvasive ventilation with a dog ventilation mask (size 2). Ventilation parameters are as follows: FiO2 (inspiratory oxygen fraction) = 100%, respiratory rate = 18-20 breaths/min, peak inspiratory pressure = <20 cmH20, PEEP (positive end-expiratory pressure) = 5 cmH20.\nMaintain anesthesia via continuous infusion of fentanyl (0.1-0.2 mg kg-1 h-1) and propofol (8-12 mg kg-1 h-1). Start a continuous infusion of balanced electrolyte solution (5 mL kg-1 h-1).\nSecure the airway via intubation with a common endotracheal tube (ID 6-7) and an introducer. Use a common laryngoscope with a Macintosh blade (size 4). Two people are necessary for this step.\n\t\nEnsure that one person fixes the tongue outside with a piece of tissue and opens the snout with the other hand.\n\t\t\nEnsure that the second person performs a laryngoscopy of the porcine larynx. When the epiglottis comes into view, move the laryngoscope ventrally. The epiglottis should be lifted up and the vocal cords will be visible.\n\t\t\tNOTE: If the epiglottis does not move ventrally, it will stick to the soft palatine and can be mobilized by the tip of the tube.\nMove the tube carefully through the vocal cords.\n\tNOTE: The narrowest point of the trachea is not on the level of the vocal cords but is subglottic. If tube insertion is not possible, try to rotate the tube clockwise or use a smaller tube.\nPull the introducer out of the tube. Use a 10 mL syringe to block cuff with 10 mL of air. Control the cuff pressure with a cuff manager (30 cmH2O).",
    "Start mechanical ventilation after tube connection with a ventilator (PEEP = 5 cmH2O, tidal volume = 8 mL/kg, FiO2 = 0.4, I:E [inspiration to expiration ratio] = 1:2, respiratory rate = variable to achieve an end-tidal CO2 of <6 kPa, usually 20-30/min). Make sure that tube position is correct by regular and periodic exhalation of carbon dioxide via capnography.\nCheck double-sided ventilation via auscultation.\n\tNOTE: In case of incorrect placement of the tube, an air-filled stomach rapidly forms a clearly visible bulge through the abdominal wall. In this case, immediate replacement of the tube and insertion of a gastric tube is necessary. If intubation is not successful, switch back to mask ventilation and try a smaller tube or better positioning of the snout.\nPlace gastric tube into the stomach to avoid reflux and vomiting with two people.\n\t\nFix the tongue outside with a piece of tissue and open the snout with the other hand.\n\t\t\nEnsure that a second person performs a laryngoscopy of the porcine larynx then visualizes the esophagus. Push the gastric tube inside the esophagus with a Magill's forceps until gastric fluid is drained.\n\t\t\tNOTE: Visualization may be difficult. In this case, lift the tube with the laryngoscope ventrally to open the esophagus.\n2. Instrumentation\nUse bandages to pull back the hindlegs to smooth the folds in the femoral area for vessel catherization.\nPrepare the following materials: syringes (5 mL, 10 mL, and 50 mL), Seldinger needle, introducer sheaths (6 Fr, 8 Fr, 8 Fr), guidewires for the sheaths, central venous catheter with three ports (7 Fr, 30 cm) with guidewire, cardiac output monitor (Table of Materials), and a catheter (5 Fr, 20 cm).\nDisinfect the inguinal area (see step 1.6). Repeat this process 2x.",
    "Fill all catheters with saline solution. Apply ultrasound gel on the ultrasound probe. Cover the inguinal area with a sterile fenestrated drape.\nScan the right femoral vessels with ultrasound and use doppler technique to identify the artery and vein15. Visualize the right femoral artery axially. Switch to a longitudinal view of the arteria by rotating the probe 90°.\nPuncture the right femoral artery under ultrasound visualization with the Seldinger needle under permanent aspiration with the 5 mL syringe.\n\tNOTE: In our opinion, the ultrasound guided Seldinger's technique is associated with significantly less blood loss and tissue trauma than other methods of vascular access.\nConfirm the desired needle position by observing bright red pulsating blood. Disconnect the syringe and quickly insert the guidewire into the right femoral artery.\nVisualize the longitudinal axis of the right femoral vein. Insert the Seldinger needle under permanent aspiration with the 5 mL syringe. Aspirate any dark red non-pulsating venous blood.\n\tNOTE: If the correct position of the needle in the different vessels cannot be visually confirmed, take blood samples and analyze the blood gas content. A high oxygen level is a good sign for arterial blood, while low oxygen saturation indicates intravenous position.\nInsert the guidewire for the central venous catheter into the right femoral vein after disconnecting the syringe. Retract the Seldinger needle.\nVisualize both right vessels using ultrasound to control the correct wire position. Push the arterial introducer sheath (6 Fr) over the guidewire into the right artery and secure the position with blood aspiration.\n\tNOTE: Placing the sheath through the skin can be difficult. It can be helpful to perform a small incision along the wire to facilitate better placement.",
    "Use Seldinger's technique to position the central venous line into the right femoral vein. Aspirate all ports and flush them with saline solution.\nPerform the same procedure on the left inguinal side to insert the other introducer sheaths in Seldinger's technique into the left femoral artery (8 Fr) and femoral vein (8 Fr).\nConnect the right arterial introducer sheath and the central venous catheter with two transducer systems for measurement of invasive hemodynamics. Position both transducers at heart level.\nSwitch the tree-way stopcocks of both transducers open to the atmosphere to calibrate the system to zero.\n\tNOTE: It is necessary to avoid any air bubbles and bloodstains in the system to generate plausible values.\nSwitch all infusions for maintaining anesthesia from the peripheral vein to a central venous line. Take baseline values (hemodynamics, spirometrics, and other output from the cardiac monitor; see section 3) after a 15 min recovery.\nInitiate ventricular fibrillation (see section 4).\n3. Pulse contour cardiac output\nInsert transpulmonal thermodilution catheter into the right arterial introducer sheath.\n\tNOTE: In clinical medicine, thermodilution catheters are directly placed by Seldinger's technique. However, placement via an introducer sheath is also feasible. In the proposed protocol, sheaths are placed as a standardized vascular access for maximum flexibility in instrumentation throughout different experiments.\nConnect the catheter with the arterial wire of the cardiac monitor system. Switch the arterial transducer directly with the cardiac monitor port and recalibrate as described in step 2.14. Connect the venous measuring unit of the cardiac monitor system with the left venous introducer sheath.",
    "NOTE: It is necessary to connect the venous and arterial probes as far apart as possible; otherwise, the measurement will be disturbed, because the application of cold water into the venous system will affect the arterial measurement. More details regarding PiCCO2 have been provided previously16.\nTurn on the cardiac monitor system. Confirm that a new patient is being measured. Enter the size and weight.\nSwitch the category to adults. Enter the protocol name and ID. Click on Exit.\nSet the injection volume to 10 mL.\n\tNOTE: The volume of chosen injection solution can be changed in the software. A higher volume makes the measured values more valid. A small volume was chosen for this experiment to avoid any hemodilution effects.\nEnter the central venous pressure.\nOpen the three-way stopcock to the atmosphere.\nClick on Zero for system calibration. Click on Exit.\nCalibrate the continuous cardiac output measurement.\n\t\nClick on TD (thermodilution). Prepare a physiological saline solution with a temperature of 4 °C in a 10 mL syringe. Click on Start.\nInject 10 mL of cold saline solution quickly and steadily into the venous measuring unit. Wait until the measurement is completed and the system requests a repetition.\nRepeat the previous step until three measurements are completed. The system will calculate the mean of all parameters. Click on Exit.\n\t\tNOTE: Measurements will start immediately after calibration has been completed. Although cardiac output measurements during CPR are not performed regularly, plausible results have been able to be affirmed after adequate calibration17,18.\n4. Ventricular fibrillation and mechanical resuscitation\nPlace defibrillator patch electrodes in anterior-posterior position on the torso. The posterior electrode should be positioned on the central left hemithorax.\n\tNOTE: Use a razor to remove excess hair and dirt to facilitate optimal conduction.\nConnect the electrodes to a defibrillator and establish an ECG.",
    "Immobilize the pig inside the vacuum mattress. Deflate the mattress to prevent unwanted movement during CPR. Control fixation of the limbs.\nPlace chest compression device (here, LUCAS-2) around the chest and under the vacuum mattress according to the manufacturer's recommendations. Adjust the pressure pad to the lower third of the sternum in median position.\nTurn on chest compression device (\"power\" button) and lower the pressure pad to skin level. Set the compression frequency to 100/min, if not otherwise defined in the protocol. Press the Pause button to prepare the compression device for chest compressions.\nInsert a fibrillation/pacing catheter into the left femoral vein through the i.v. sheath.\nInflate the catheter cuff with 1-2 mL of air. Slowly push the inflated cuff further until it is placed next to the right atrium (usually about a 50 cm distance).\nConnect catheter electrodes to an adequate oscilloscope/function generator. Adjust fibrillation parameters to the desired values (here, a 13.8 V current with frequencies between 50-200 Hz).\nTurn on generator and monitor ECG changes. Move the catheter slowly forward until arrhythmias can be detected in the ECG.\n\tCAUTION: Prevent the separate electrodes at the end of the catheter from touching human skin or each other to prevent short circuits and possibly life-threatening situations.\nCarefully vary the catheter position until ventricular fibrillation can be detected.\n\tNOTE: It can be difficult to induce fibrillation right away. If a position is reached at which ECG effects can be seen, changing the frequency or repeatedly turning the generator on and off can sometimes be helpful.\nOnce ventricular fibrillation is confirmed, turn off the generator, deflate the balloon, and remove the fibrillation catheter. Maintain fibrillation with or without ventilation for as long as required.",
    "Start mechanical chest compressions by pressing the Play button on the compression device. To interrupt chest compressions, press the Pause button on the compression device.\nAnalyze ECG patterns. If ventricular fibrillation persists, prepare defibrillation.\n\t\nEnter Manual mode in the defibrillator menu. Adjust the energy to 200 J biphasic.\nPress the Load button. Wait until acoustic signal turns on to indicate a prepared shock value. Initiate electric shock.\n\t\tCAUTION: Only experienced users should handle defibrillators and fibrillation catheters. No shocks should be initiated if there is any indication for faulty or worn materials. The initiation of an electric shock must always be announced clearly audible to every person in the room, and the person launching the defibrillation is responsible for ensuring that nobody is touching the animal or stretcher prior to releasing the shock.\n\t\tNOTE: Here, guideline-based resuscitation protocol was used (i.e., 2 min of chest compressions, ECG assessment, shock, 2 min of chest compressions, adrenaline administration, etc.). For more information, consult with the guidelines4.\nIn the case of return of spontaneous circulation (ROSC), stop chest compressions, continue ventilation, and apply monitoring as extensively and for as long as needed.\n\tNOTE: Anesthetic drug administration may or may not be interrupted during CPR, depending on the protocol. If sedation is discontinued, infusion should be restarted upon confirmed ROSC.\nA goal-directed approach for the guidance of fluid and catecholamine administration as well as standardized respiratory and ventilation settings are recommended to prevent cardiorespiratory deterioration in the ROSC phase leading to experimental failure.\n5. End of experiment and euthanasia (in the case of ROSC)\nInject 0.5 mg of fentanyl into the central venous line. Wait 5 min. Inject 200 mg of propofol into the central venous line.\nEuthanize the animal with a 40 mmol potassium chloride injection.\nPerform organ removal/fixation or analyses as needed.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}