{
  "id": 9671,
  "origin_website": "Jove",
  "title": "Using a Comparative Species Approach to Investigate the Neurobiology of Paternal Responses",
  "procedures": [
    "1. Identification of Animal Model\nThe California Deer Mouse (Peromyscus californicus) is an ideal model to explore paternal responses. As you see, this mouse grooms the pups just as the moms do - they even crouch over them so that it looks like the pups are nursing. The behavior of the California mice is compared to a species of the same genus, the common deer mouse (Peromyscus maniculatus) which exhibits little interest in the pups, often trying to escape or even attack them. (See Figure 1 for pictures of these species interacting with pups.)\nOnce the species model has been identified then the various groups need to be established. In this study, biological fathers, virgins with no parenting experience, and virgins with limited pup exposure (pup-exposed or foster fathers) of both species are used so that both predisposed and acquired paternal characteristics can be assessed. In this particular study we also exposed all groups to a toy mouse pup to assure that the social interactions were specific to a pup and not a representative response to anything placed in the cage (See Figure 2.)\nBefore investigating neurobiological factors, it is important to confirm that the selected species exhibit clear differences in the behavior of interest. In this study, males are placed in a cage with a pup for five minutes and a paternal behavior ethogram (see Table 1 for example of ethogram) is used to score behaviors such as latency to approach the pup and amount of time spent in contact with the pup. If aggressive responses are observed, the pup is removed immediately. These sessions are often videotaped so a careful behavioral analysis can be subsequently conducted.\n2. Preparing Brain Tissue",
    "Following a standard perfusion of each mouse (protocol attached), the brains are removed so that they can be sectioned in the specific area of interest (show brain).\nA standard mouse brain atlas (show atlas) is used to locate the paraventricular nucleus in the hypothalamus, an area known to be rich in cells producing the neuropeptide of interest in this study - vasopressin (AVP).\nThe brain is then blocked and mounted on a freezing chuck so that the tissue will freeze before being sectioned with the microtome. The brain is sectioned in a trim mode until specific landmarks are identified, then the specific brain thickness, 30 microns in this case, is set for the brain sections used for analysis.\nThe brain sections are carefully placed in well plates filled with phosphate buffer saline (PBS); (protocol for PBS attached; please note that this is only one example of a standard immunocytochemistry protocol).\n3. Immunocytochemistry\nThroughout the various steps of this process (see attached protocol), it is important to have accurate pipetting skills to assure accurate measurements of chemicals and other ingredients important for this technique (show student pipetting).\nThe first step in this process is washing the brains which involves replacing the PBS in the well plates three to five times; between each wash the well plates are placed on a rocker for 10 minutes (show student replacing PBS and placing well plates on rockers).\nThe brain slices are then exposed to the primary antibody solution and stored at 4 °C overnight on the rocker (show process).\nFollowing another wash, the brain slices are exposed to a secondary antibody for one hour on the rocker at room temperature, then washed again.\nNext the brains are exposed to an Avitin-Biotin Complex solution to prepare for the visualization of the neurochemical-positive cells.",
    "For the final visualization step, the brains are exposed to DAB. This is a hazardous product and should always be handled with caution. As seen here, the brain slices begin to get darker before your eyes (show process).\nFollowing the DAB exposure, the brains go through the last series of washes and are then carefully placed on subbed microscope slides and allowed to dry overnight (show the placement of a brain slice on a slide; see attachment for subbed slides protocol).\nThe slides are then cleared through a series of distilled water and alcohol washes, finally being submerged in Citrosolv before being coverslipped and stored in a slidebox for safe keeping (show various aspects of this process; see attachment for clearing process).\n4. Neuroquantification\nAfter the slides have dried, they can be assessed with specialized neuroquantification software. Here Bioquant software is used to quantify the vasopressin-positive cells and fibers in the paraventricular nucleus of the mouse brains (show software on screen...and microscope).\nThe specific area of interest is identified using the measurement options of the software to establish the visual field for neuroquantification. It is important that a consistent visual field size is quantified for each animal (show student doing this).\nHere the darkly stained vasopressin-immunoreactive cell bodies and fibers are apparent. Because it is difficult to count or trace this tissue, a special feature of this software uses light thresholding to determine the total amount of positively stained tissue within the specified area of interest. This thresholding tells us how much of the specified area contained vasopressin-positive tissue (show the data value on the computer screen).\n5. Behavioral Analysis",
    "If more than one observer will be scoring the videotapes, it is important to establish inter-rater reliability to assure that the observers are scoring the behavior in a consistent manner. For the actual scoring session, a behavior scoring sheet should be prepared to allow for easy scoring of behavior during observation sessions (see Table 2 for example of scoring spread sheet).\nFor behaviors that aren't fast episodic responses, a microsequencing analysis can reveal subtleties about the progression of the specific responses. For example, grooming behavior consists of a chain of very fast responses. Although one option is to simply record the presence and duration of grooming, another is to document the chain of events accompanying this response. Using this microsequencing software, observers score the presence of a particular behavior every second, as prompted by the software (show software and video).\nFollowing data collection, the parameters of interest are determined and the appropriate behavioral scores are analyzed. Examples may be total duration of time spent in contact with the pup, or number of disruptions in the grooming sequence (show computer with spread sheet with data entered for each animal).\nOnce the behavior is scored it is important to confirm that the two species exhibited different response strategies for the behavior of interest in the study. In this case the California deer mice should exhibit more paternal behavior than the common deer mice. Additionally, various behavioral measures can be correlated with brain measures to get a more informed view of relevant influences.\n6. Representative Results:\nTo validate the model, the data should clearly indicate that the two species performed differently with regard to the behavior of interest. Here you see that the P. californicus males spent more time grooming and crouching over the pups, two hallmarks of paternal responses (See Figure 4).",
    "In order to determine if the neurobiologial variable of interest is important in paternal responses, the amount of vasopressin (AVP)-positive tissue was quantified for several relevant brain areas; as can be seen, the paternal P. californicus animals had more immune-positive tissue in several of these brain areas. (see Figure 5).\nIn a related study using the microsequencing analysis, it was hypothesized that paternal California mice would exhibit less anxiety than their virgin counterparts; accordingly, when exposed to a predator odor, the fathers exhibited fewer interruptions in the grooming sequence than the virgin animals (see Figure 6).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig1.jpg\nFigure 1: (A) Male California mice exhibiting paternal responses toward conspecific alien pup. (B) Male deer mouse exhibiting a cautious approach (stretch attend) and avoidance response in the presence of a conspecific alien pup. Note: In these social interaction assessments, if a male exhibits aggressive responses toward the pup, the experimenters immediately hit the top of the cage to distract the male. At this time the session is terminated and the pup is removed, inspected for any wounds and returned to the mother. In our laboratory, this rarely is observed with P. californicus males but is occasionally observed with P. maniculatus; close observation and immediate intervention, however, prevent harm from occurring to the animals.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig2.jpg\nFigure 2: A California mouse interacting with a toy mouse; most tried to chew on these stimuli.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig3.jpg\nFigure 3: Experimental design of study; there were approximately 6 animals in each group for each species.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig4.jpg\nFigure 4: Graphic of immunocytochemistry process.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig5.jpg\nFigure 5. Paternal responses in the California and deer mice; more paternal responses (groom, crouch, faster approach) were observed in the California mice. More stretch attends (stress response) were observed in the deer mice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig6.jpg",
    "Figure 6. Vasopressin immunoreactivity in various brain areas of both species. The California mice had more staining in the PVN cells and fibers.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3173/3173fig7.jpg\nFigure 7: Paternal California mice exhibited fewer disruptions in their grooming sequences in the presence of a predator odor than the pup-exposed and virgin groups."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}