{
  "id": 18955,
  "origin_website": "Jove",
  "title": "Technique and Considerations in the Use of 4x1 Ring High-definition Transcranial Direct Current Stimulation (HD-tDCS)",
  "procedures": [
    "1. Contraindications and Special Considerations\nPrior to device setup, confirm that the participant does not have any contraindications for HD-tDCS. It seems reasonable to assume that these contraindications are the same as for conventional tDCS (Table 1). Other special considerations, such as patient medications, should also be taken into account. For instance, central nervous system-acting drugs might change the desired effects of the stimulation.\nInspect the participant's scalp thoroughly for cutaneous lesions, such as cuts or inflammatory signs. Avoid stimulating areas of the scalp that show such lesions. Additionally, stimulation should be avoided in patients with skull defects or metallic implants. If the purpose of the trial is to specifically study this patient population, additional precautions and special dose consideration should be taken into account (e.g. with computational forward models) 17.\n2. Materials\nEnsure that all the necessary materials are readily available (Table 2).\nEmbed the plastic HD casings in the modular electroencephalogram (EEG) recording cap. The center electrode should correspond to the target area, in this demonstration the M1, and the radius of the four return electrodes should be adjusted based on the protocol that is being studied. In this demonstration, we use a radius of approximately 7.5 cm, with the center electrode placed over M1 and the return electrodes' location corresponding roughly to Cz, F3, T7 and P3 in the International 10-20 EEG system 18.",
    "Before each stimulation session, turn on the conventional tDCS device (Soterix 1x1 Low-intensity DC Stimulator) and the Multichannel Stimulation Adapter and check that the batteries are charged. A \"low battery\" indicator on either device will illuminate if that is not the case, indicating that the batteries need to be replaced. After checking battery charge, the devices can be turned off until immediately before the stimulation. The conventional tDCS device is a battery-operated device that delivers DC with an intensity of a few mA. A current-controlled and not a voltage-controlled stimulator is preferred due to changing electrode impedance. The use of power adapters is always discouraged for safety reasons, in order to avoid accidental delivery of larger intensities. The operation of this device was described in our previous article 19. By connecting the conventional tDCS device to the Multichannel Stimulation Adapter (Figure 1), DC is delivered along the 4x1 HD-tDCS configuration allowing for neuromodulation restricted to the desired area.\nPrior to each session, visually inspect the electrodes before use for signs of unusual wear or damage. The HD-tDCS electrodes are reusable, but have a limited number of total applications (see Discussion). Electrode assemblies used for HD-tDCS should have been specifically designed or tested for this purpose. The approach demonstrated in this article uses Ag/AgCl sintered ring electrodes (Figure 2). The use of these electrodes, in combination with appropriate electrically conductive gel and HD plastic casings, has been shown to minimize changes in stimulation electrode potential and pH changes in the gel while producing no significant heating 9,20, therefore resulting in a safer and more effective approach as compared to other types of electrodes.",
    "Connect the cables of five Ag/AgCl sintered ring electrodes to the matching receivers on the 4x1 adapter output cable. The center electrode will be the one defining the polarity of the stimulation as either anodal or cathodal. Make sure to connect the center electrode lead to the center receiver plug. Then, connect the remaining electrodes into the surrounding plugs. It should be noted that the arrangement of the four return electrodes in the receiver plugs is not critical, as they will all be the same polarity.\n3. Measurements\nHead measurement and localization of the area of stimulation are identical to those for conventional tDCS, as explained in our previous article 19. The steps will be described again in detail for further clarification.\nHave the participant sit comfortably in a chair, which may have a headrest.\nThe stimulation site is determined by the protocol of interest for the researchers, since stimulation of different areas results in distinct effects. Most commonly, the International 10-20 EEG system 18 is utilized for head measurements, as described below.\nFirst, localize the vertex (Cz).\n\t\nIn order to do this, measure the distance from the nasion to the inion and divide the distance by half. The nasion is the spot at the junction of the forehead and the nasal bones, and the inion is the most prominent point of the occipital bone (Figure 3). Mark the spot as a line, using an oil pencil or a nontoxic water-based marker.\nSecondly, measure the distance between the left and right pre-auricular points (i.e. the area anterior to the tragus). Divide this distance by half, and mark the spot with a line. Now connect both lines to create a cross. The point at which both lines intersect corresponds to Cz.",
    "Depending on the protocol being studied, identify the target site on the head.\n\t\nIn order to stimulate over the primary motor cortex (M1), calculate 20% of the distance from Cz to the left or right pre-auricular point, beginning the measurement at Cz (Figure 3). For a more precise determination of this area, the use of adjunct methods such as neuronavigation systems or transcranial magnetic stimulation (TMS) may be suitable.\n4. Skin Preparation\nPrepare the skin at the stimulation site by separating the hair. An alcohol swab may be used in order to help remove sebum or hair products from the scalp. Do not abrade the skin. Ensure that no skin lesions are present.\n5. Electrode Positioning and Device Setup\nAfter measuring head dimensions and preparing the skin, find the mark corresponding to the M1.\nNext, keeping the M1 mark in sight, place the modular EEG recording cap on the subject's head while holding the center plastic casing over the mark. To keep the M1 cross mark on the scalp in sight, one can move the hair around before placing the HD casing over it. Ensure that the cap fits snugly but comfortably, and adjust the position of the four return plastic casings. Although other approaches are certainly feasible, in a previous trial 16 we positioned the return electrodes in a radius of approximately 7.5 cm from M1. Their locations corresponded roughly to Cz, F3, T7 and P3 (Figure 4). Then adjust the straps of the EEG cap.\nUsing a measuring tape, confirm that the inter-electrode distance is adequate based upon the study protocol.\nUsing the end of a wooden cotton swab, separate the hair through the opening in the plastic casing until the scalp is exposed. Repeat under each casing.",
    "Introduce approximately 1.5 ml of electrically conductive gel through the opening of each plastic casing, beginning at the scalp surface. Application of the gel can be achieved using a plastic syringe. Carefully avoid spreading gel beyond the circumference of the plastic casing, as this may lead to shunting of electrical current and inadequate current flow (Figure 5).\nNext, with its rough surface facing down and the smooth rounded surface facing up, position one Ag/AgCl sintered ring electrode in each HD plastic casing. Using the syringe or the plunger as a guide if necessary, lower the ring electrode until it rests on the base of the plastic casing.\nAdd some more gel to cover the electrode, and then use the caps provided with the HD plastic casings to lock the electrodes in place (Figure 6). This cap will keep the electrode in place throughout the stimulation. Rotate the cap to lock it in position. If the plastic cap does not turn easily do not use excessive force. Re-adjust the electrode as described in 5.6, and then attempt to lock the cap in place. The cap of the HD plastic casing is designed to turn easily if the Ag/AgCl sintered ring electrode is inserted fully and in its proper positioning.\nTo reduce tension on the electrode cables, loop them around each plastic casing and tape them to the chair or to the subject's clothes (Figure 7).\nConnect the rounded end of the output cable to the 4x1 Adapter output port.",
    "Use the input cable to connect the 4x1 Multichannel Stimulation Adapter to the conventional tDCS device. Connect the cone-plug end of the input cable to the 4x1 Adapter input port and connect the other end of the input cable (two banana-type plugs) to the output port of the conventional tDCS device. Importantly, the cable that is labeled as \"Center\" is the one that will define DC polarity delivered from the center electrode as either anodal or cathodal. Note that when using the 4x1 Multichannel Stimulation Adapter in combination with the conventional tDCS device there is no switch or button for selecting center-anode or center-cathode. This polarity is determined through the process of connecting the connector cable banana-type plugs to the conventional tDCS device outputs, as described above. In tDCS and HD-tDCS, \"anode\" refers to the relatively positive terminal where positive current flows into the body. On the other hand, the \"cathode\" is the relative negative terminal where positive current then exits the body.\nWhen the connections are ready, turn on both devices.",
    "Ensure that the impedance values are within an adequate range by turning the \"Mode select\" knob in the 4x1 Multichannel Stimulation Adapter to \"Scan\". The device will then scan the electrodes, showing the impedance of one electrode at a time in the display window. The \"Lead toggle\" button can be used to toggle this automatic switching of the electrodes in the display. The button can be pressed to lock the display on the selected electrode, and examine the impedance. Then, it can be pressed again to allow the device to change the electrode displayed. The 4x1 Multichannel Stimulation Adapter device will measure impedance in \"quality units\". The contact quality is normalized to these \"quality units\" by the test circuit based on the fact that electrode resistance is non-linear to the electrode-interface electrochemical processes 21, and that electrode resistance (impedance) can therefore be misleading. For example, the resistance apparently measured is completely dependent on the test current 22. Lower \"quality units\" values are desirable. Although no strict guidelines are available to date, values lower than or equal to 1.50 to 2.0 \"quality units\" have been used as a cutoff in previous studies 15,16 .\nDo not activate the conventional tDCS device while the 4x1 Multichannel Stimulation Adapter is in \"Scan\" (impedance check) mode, as stimulation will not be delivered to the subject.",
    "If impedance values are beyond these desired limits, open the cap of the plastic casing containing the electrode showing high impedance and remove the Ag/AgCl sintered ring electrode. Follow the procedures as described above (i.e. 5.4-5.7) to adjust the hair and electrode to obtain optimal impedance. Check the impedance again, as noted in 5.12. Once the target quality value is achieved, replace the cap on the casing. Repeat the same procedure for other electrodes as needed. Optimal quality indication may vary from subject to subject, but a quality indicator higher in one electrode than in the others may indicate poor contact in that electrode.\nOnce the impedance quality for all electrodes is confirmed to be within the desired range, turn the \"Mode select\" knob in the 4x1 Multichannel Stimulation Adapter from \"Scan\" to \"Pass\". This setting allows the current to pass from the conventional tDCS device through the electrodes into the 4x1 device. The operator is now ready to begin the stimulation.\n6. Stimulation\nEnsure that the participant is seated comfortably in the chair and remains awake during the stimulation.\nHD-tDCS is now applied using the controls of the conventional tDCS device as shown in our previous article 19. Confirm the duration and intensity of stimulation being delivered, and adjust the device as needed. In addition, determine the mode of the session (sham or active stimulation). If the sham mode is chosen, the device will automatically deliver current for a period of thirty seconds only. This approach has been reported to be successful for blinding of participants in both conventional tDCS 23 and HD-tDCS 15 trials.",
    "Initiate the HD-tDCS session by pressing the \"Start\" button of the conventional tDCS device. The \"Start\" light will flash as DC intensity is ramped up and then light continuously when target current is reached. The timer will then show the remaining time and the \"True Current\" indicator will show the current intensity delivered to the center electrode and the four return electrodes combined.\nIt might be the case that subjects indicate discomfort, itching or tingling during the initial stimulation period 24. Should these symptoms be too uncomfortable, it is recommended that the current intensity be manually ramped down by 0.2-0.5 mA for a few seconds using the \"Relax\" feature until the subject feels comfortable. Immediately after, the current intensity should be gradually increased back to the original dose. The abovementioned sensations typically tend to fade away after a few minutes of stimulation.\n7. After the Procedure\nAfter the session is complete, resistances across all channels can be measured again if desired. Open the plastic caps and gently remove the Ag/AgCl sintered ring electrodes from the casings. If necessary, use the blunt end of a cotton swab to avoid tugging on the electrode wires. Electrodes should be washed gently with tap water in order to remove gel and then dried before storing.\nNext, remove the EEG cap with the embedded plastic casings. Do not remove the EEG cap with the plastic caps closed, as the participant's hair may be caught in the caps and/or casings. The plastic casings should then be washed to remove gel, and dried with a paper towel.\nUsing a paper towel, remove the remaining gel from the subject's head. Since the gel is hydrosoluble, some water may be used to help remove it.",
    "It is recommended to ask the participant to fill out a questionnaire after each stimulation session to monitor for any adverse events (Table 3)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}