{
  "id": 9209,
  "origin_website": "Jove",
  "title": "Surgical Method for Virally Mediated Gene Delivery to the Mouse Inner Ear through the Round Window Membrane",
  "procedures": [
    "NOTE: All procedures and animal handling complied with NIH ethics guidelines and approved protocol requirements of the Institutional Animal Care and Use Committee of the University of California, San Francisco.\n1. Preparing the Animal for Surgery\nCarry out surgical procedures in a clean, dedicated space. Autoclave all surgical instruments, sterilize with a glass-bead sterilizer prior to surgery.\n\tNOTE: In this protocol, use postnatal day 10-12 (P10-12) FVB mice. Different ages and strains of mice can be used to meet the needs of a specific project. Mice older than P40 can be challenging because the bulla bone gets harder.\nAnesthetize the mice with intraperitoneal injection of a mixture of ketamine hydrochloride (100 mg/kg), xylazine hydrochloride (10 mg/kg), and acepromazine (2 mg/kg). Begin surgical preparation only after the animal no longer responds to painful stimuli, such as toe pinch. If necessary, administer a booster dose (one-fifth the original dose) of the anesthetic cocktail to restore the original anesthetic plane.\n\tNOTE: Take care at this step because most of the mortality observed at this age is caused by anesthetic overdose.\nCover the animal's eyes with a protective ophthalmic ointment to keep the eyes moist during anesthesia, suppressing the animal's blink reflex.\nPosition the mouse with neck extended on a heating pad throughout the procedure until the mouse is totally awake, to prevent post-anesthesia hypothermia.\nShave the left post-auricular region with a clipper and disinfect with 70% ethanol and povidone-iodine before surgical manipulation.\n2. The Surgical Procedure and Vector Injection",
    "Use a post-auricular approach to expose the tympanic bulla. Incise the subcutaneous tissue with small scissors to expose the post-auricular muscle. After retracting the adipose tissue to the posterior side of the incision, separate the muscles to the right and left side perpendicular to the incision to expose the temporal bone. Ensure that this incision is long enough to work comfortably with adequate visualization.\nPerforate the tympanic bulla with a 25 G needle and expand the hole as necessary with forceps by peeling the bone back to allow access to the basal turn of the cochlea, and then widen sufficiently to visualize the stapedial artery and the round window membrane (RWM).\nPuncture the RWM gently in the center with a borosilicate capillary pipette. Observe fluid efflux through the RWM at this point; this is normal. Wait until the efflux has stabilized (the effluxed fluid from the cochlea is dried with a sterile filter paper).\n\tNOTE: Take care when holding and advancing the glass needle so that the RWM perforation is as small as possible. Depending on the microscope used, hold the pipettes using a micromanipulator or by hand using a pipette holder.\nPrepare the pipettes for injection using a pipette puller the same way patch clamp pipettes are prepared. Ensure that the tip diameter is large (about 15 µm in diameter) so that pipetting the virus in and out is done easily.\nDraw up 1 to 2 µl of AAV1-VGLUT3, AAV1-GFP or AAV2-GFP into an injection pipette. After the efflux is stabilized (5 to 10 min), microinject this fixed volume into the scala tympani through the same hole previously made in RWM.",
    "Seal the RW niche quickly after pulling out the pipette with a small plug of muscle and secure it with a small drop of tissue adhesive placed on the muscle to avoid leakage from the round window.\n\tNOTE : Seal this hole very well after the needle is removed with a small plug of muscle to prevent any perilymph leakage from the cochlea-this step is critical to preserve hearing. Failure to seal completely the RWM will result in hearing loss over time.\nAfter injection, cover the hole in the auditory bulla with adipose tissue, return the post-auricular muscles and adipose tissue to their normal position and suture the wound in layers with a 6-0 or smaller absorbable chromic suture.\nDisinfect the wound with povidone-iodine.\n3. Postoperative Care\nPlace mice in a warm cage and do not leave them unattended until they are fully recovered then move them back with the mother. It is recommended to remove the male from the cage before putting the pups back with the mother.\nAdminister subcutaneous Carprofen (2 mg/kg) for analgesia postoperatively and every 24 hr thereafter for 3 days, to manage inflammation and pain. Monitor the animals daily for signs of distress, abnormal weight loss, pain, or infection. Generally by the 3rd day after the surgery all mice should be acting normally. If any signs of distress or disease appear in a mouse after the 3rd day, consider euthanizing the mouse as per institutional guidelines.\n4. Assessment of Cochlear Function Following Viral Delivery Using Auditory Brainstem Response (ABR) Recordings",
    "NOTE: The auditory brainstem response (ABR) is an auditory evoked potential extracted from ongoing electrical activity in the brain and recorded via electrodes placed under the scalp. The animal is stimulated with sound. The resulting recording consists of five waves that reflect the electrical activity of successive points in the auditory pathway in the first 10 msec after onset of an auditory stimulus.\nAnesthetize mice by intraperitoneal injection of a mixture of ketamine hydrochloride and xylazine hydrochloride as described in section 1.2 of this protocol, except without acepromazine.\nPlace the mouse on a heating pad throughout the hearing test until the mouse is totally awake, to prevent post-anesthesia hypothermia.\n\tNOTE: Use the following sound stimuli in this experiment: click (5 msec duration; 31 Hz presentation rate).\nPlace subdermal needle electrodes at the vertex, below the pinna of the left ear (reference), and below the contralateral ear (ground) and start recording ABRs as previously described in a sound-proof chamber27,28. Record ABR waveforms in 5 dB sound pressure level intervals down from maximum amplitude.\nDetermine ABR thresholds postoperatively as early as 4 days after viral delivery\n\tNOTE: Threshold is defined as the lowest stimulus level at which response peaks for waves I–V were clearly and repeatedly present on visual inspection.\nMeasure Wave I to analyze the activity from the cochlear nerve. The lowest stimulus level that yields a detectable ABR waveform is defined as the threshold.\n5. Cochlear Transgene Protein Expression Using Immunofluorescence\nAnesthetize mice by an overdose of intraperitoneal injection of a mixture of ketamine hydrochloride and xylazine hydrochloride as described in section 1.2 of this protocol, except without acepromazine.\nDecapitate the head only after the animal no longer responds to painful stimuli, such as toe pinch.",
    "Dissect the cochleae out and process for whole-mount immunofluorescence as described26. A detailed protocol of cochlear whole-mount immunofluorescence using anti-VGLUT3 and anti-Myosin 7a antibodies is described in Akil et al., 201329.\nFor GFP labeling, incubate the cochlear whole-mounts overnight at 4 °C with a rabbit anti-GFP antibody at 1:250 dilution.\nRinse the cochleae twice for 10 min with PBS and then incubate for 2 hours in goat anti-rabbit IgG conjugated to Cy2 diluted 1:4,000 in PBS.\nRinse the cochleae with PBS twice for 10 minutes and incubate them with DAPI for 15 min.\nMount the cochleae on glass slides and observe under a microscope with confocal immunofluorescence.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}