{
  "id": 3019,
  "origin_website": "Cell",
  "title": "Cranial imaging window implantation technique for longitudinal multimodal imaging of the brain environment in live mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPART 1: Mouse preparation\nTiming: 15–20 min\n    \n      This section will explain how to anesthetize and prepare the mouse before\n      initiating the surgery.\n    \nNote: Prepare all autoclaved surgical\n      tools and other materials required during the surgery before starting, and\n      place them next to the stereotactic apparatus (Figures 2[href=https://www.wicell.org#fig2]A and 2B). The Petri dish containing the CIWs should be filled with 70%\n      ethanol at the start of the surgery for sterilization purposes. The same\n      surgical tools can be used for multiple CIW surgeries, but make sure to\n      extensively clean them with water and subsequently rinse them with 70%\n      ethanol and/or sterilize in a glass bead sterilizer before each individual\n      surgery.\n    \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2562-Fig2.jpg\n          Figure 2. Preparation for the CIW implantation surgery\n        \n          (A) Prepare the surgery preparation area by placing the following\n          items on a heating pad covered by an absorbent bed mat: a shaver,\n          ethanol and betadine pads, a scalpel, an insulin syringe containing\n          lidocaine/bupivacaine analgesia, an insulin syringe containing\n          buprenorphine analgesia, and the isoflurane anesthesia mask.\n        \n          (B) Prepare the CIW surgery area by placing the following items on an\n          absorbent bed mat next to the stereotaxic frame: CIWs in 70% ethanol,\n          EPE foam mold, dental cement liquid and powder, surgery tools\n          including forceps and scissors, a 3-mm biopsy punch, an autoclaved\n          head bar, Ringer’s solution and sterile cotton swabs.\n        \n          (C) Prepare the mouse for the CIW implantation surgery by making an\n          incision into the shaved and clean scalp (left image), and by\n          mechanically (middle image) and chemically (right image) etching the\n          skull.\n        \n        Prepare the shaver, one ethanol pad and one betadine pad, ∼10 sterile\n        disposable cotton swabs, a scalpel, one 0.5 mL syringe containing 50 μL\n        of the mixture of 4.4 mg/mL lidocaine and 2.8 mg/mL bupivacaine, and one",
    "1 mL syringe containing 100 μL of 0.02 mg/mL buprenorphine.\n      \n        Anesthetize the mouse with isoflurane inhalation anesthesia (3.5%\n        isoflurane/O2 for induction, and 2% isoflurane/O2\n        for maintenance).\n      \nCritical: To assess that the mouse is\n      fully anesthetized, pinch the toes with surgical tweezers. If fully\n      asleep, the mouse will not react.\n    \n        Place the mouse on a heating pad covered by a liquid-absorbable bed mat\n        and ensure continuous isoflurane inhalation anesthesia through a nose\n        mask.\n      \nCritical: Heat loss is rapid in\n      anesthetized mice. Providing a safe supplemental heat source and\n      preventing contact with cold surfaces is critical for maintaining normal\n      body temperature during anesthesia.\n    \nShave the fur on the top of the scalp.\nApply eye ointment.\n        Clean the shaved scalp with the ethanol and betadine pads sequentially,\n        and repeat this procedure 3 times.\n      \nApply eye ointment again.\n        Inject 50 μL of the mixture of 4.4 mg/mL lidocaine and 2.8 mg/mL\n        bupivacaine subcutaneously under the scalp; a small bulge appears.\n      \n        Inject 100 μL of 0.02 mg/mL buprenorphine subcutaneously in the upper\n        back of the mouse.\n      \n        After 2 min, allowing the lidocaine/bupivacaine mixture to take effect,\n        use the scalpel to make an incision into the skin overlaying the scalp\n        (Figure 2[href=https://www.wicell.org#fig2]C). Cut longitudinally between the eyes as\n        far as the back of the skull.\n      \nCritical: Keep the scalpel blade flat\n      and cut very gently in order to avoid damaging blood vessels in the skull\n      underneath. If bleeding occurs, place a piece of Gelfoam on the damaged\n      site while gently applying pressure and wait for the bleeding to stop.\n    \nDry the skull and remove the periosteum with a cotton swab.\n        Mechanically etch the skull with the scalpel by making a pattern of\n        crosses on the bone (Figure 2[href=https://www.wicell.org#fig2]C).\n      \nCritical: While etching the skull\n      mechanically, avoid cutting or touching the major blood vessels as this",
    "can result in substantial bleeding.\n    \n        Chemically etch the skull by wiping it once with a cotton swab moistened\n        in 35% phosphoric acid (Figure 2[href=https://www.wicell.org#fig2]C).\n      \nNote: Etching the skull chemically and\n      mechanically improves the long-term adherence of the CIW and dental cement\n      applied at the end of the surgical procedure. To assess the proper etching\n      of the skull, clean the skull with a cotton swab again. An etched bone\n      should provide an uneven and coarse surface.\n    \nCritical: 35% phosphoric acid is not\n      expected to be an inhalation hazard unless heated or misted, but it can\n      cause skin corrosion and eye irritation upon contact, so we advise wearing\n      adequate personal protective equipment.\n    \nPART 2: CIW implantation\nTiming: 25–35 min\n    \n      The following section explains the surgical procedure to implant the CIW\n      in the mouse’s skull.\n    \nCritical: Heat loss is rapid in\n      anesthetized mice. Use a safe supplemental heat source, for example a\n      stereotaxic apparatus with an integrated warming base, to maintain normal\n      body temperature during anesthesia.\n    \n        Move the mouse on the stereotactic apparatus and restrain the head in\n        the EPE foam mold. Apply new eye ointment if necessary.\n      \n        Use a disposable Pasteur pipette to moisten and clean the exposed skull\n        with Ringer’s solution (Figure 3[href=https://www.wicell.org#fig3]A).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2562-Fig3.jpg\n              Figure 3. CIW implantation surgery\n            \n              (A) Place the mouse on the stereotaxic frame, and rinse the skull\n              extensively with Ringer’s solution to remove excess 35% phosphoric\n              acid.\n            \n              (B) Remove a part of the scalp, while leaving sufficient skin\n              around the eyes.\n            \n              (C) Place sliding lock forceps on the side of the planned\n              craniotomy to gain better access to the surgical area.\n            \n              (D) Perform craniotomy using the 3-mm biopsy punch and carefully\n              remove the bone flap.\n            \n              (E) Optional: induce glioblastoma formation by injecting RCAS\n              virus-producing DF-1 cells into Tva transgenic mice using a\n              Hamilton syringe.",
    "(F) Place the CIW (left image) and put Loctite super glue on the\n              edge of the 5-mm coverslip while gently pressing the CIW with a\n              blunt forceps.\n            \n              (G) Glue head bar next to the implanted CIW using Loctite super\n              glue.\n            \n              (H) Apply dental cement to the exposed skull and wait until it\n              solidifies (several minutes) before removing the mouse from the\n              surgery table.\n            \nCritical: Perform this step regularly\n      between each of the following steps to ensure the proper hydration of the\n      tissues and brain throughout the procedure.\n    \n        Use surgical scissors to remove part of the scalp (Figure 3[href=https://www.wicell.org#fig3]B).\n      \nCritical: Remove approximately 4 mm of\n      skin frontally and caudally, and 2 mm of skin laterally on each side. This\n      step allows the investigator to create physical space to perform the next\n      surgery steps. Be careful not to remove too much skin close to the eyes,\n      as this may later result in discomfort for the animal.\n    \n        Use forceps with a sliding lock to grasp the skin on the side of the\n        craniotomy to have better access to the surgical site (Figure 3[href=https://www.wicell.org#fig3]C).\n      \n        Use a sterile cotton swab to remove the periosteum and to dry the area\n        of the craniotomy, which will be located in the skull overlaying the\n        right frontal cortex.\n      \n        Use a 3-mm biopsy punch to make a craniotomy.\n        \n            Place the biopsy punch on the skull, and slowly turn it in both\n            directions to etch the bone (Figure 3[href=https://www.wicell.org#fig3]D).\n          \n            Continue until the round bone flap becomes loose and almost detaches\n            from the skull so that it can be carefully removed with a forceps.\n          \nCritical: We recommend to perform the\n      craniotomy using a biopsy punch instead of using a micro-drill. In our\n      hands, it is more precise, allowing the 3-mm coverslip to completely seal",
    "the craniotomy. This minimizes the risk of Loctite super glue running into\n      the brain tissue when gluing the CIW, and infections under the CIW.\n      Morever, when choosing the correct position of the craniotomy, the risk of\n      major bleedings is minimal. Make sure that there is ample space between\n      the craniotomy and the major blood vessels in the skull, including the\n      sagittal suture and bregma. We recommend to take the necessary time to\n      slowly turn the biopsy punch while applying minimal pressure. Rough\n      movements can lead to the breaking of the skull and eventually damage the\n      brain. Regularly check if the bone flap starts to detach by gently\n      applying some pressure on the craniotomy with a forceps. If the bone is\n      detaching, the bone flap starts to move when applying a minimal amount of\n      pressure. This method can also be used to evaluate on which side the bone\n      flap is still attached to the skull. If this is the case, slightly tilt\n      the biopsy punch when making the turning movements to the side where the\n      bone still needs to be cut. Doing these checks regularly during the\n      punching procedure prevents cutting too deeply thereby damaging the\n      meningeal layers and/or brain tissue.\n    \nNote: The bone flap can be stored in 1×\n      PBS to later confirm the absence of the dura mater on the piece of removed\n      bone.\n    \n        Extensively rinse the site of the craniotomy with Ringer’s solution.\n      \nCritical: The exposed brain tissue\n      should be covered by Ringer’s solution throughout the surgery to prevent\n      any permanent damage to the brain tissue at the site of the craniotomy.\n    \n        Remove one CIW from the ethanol and allow it to dry while proceeding\n        with steps 22–25.\n      \nCritical: Use blunt forceps to handle\n      the CIWs to minimize the risk of scratches and damage.",
    "Optional (to induce high-grade gliomas):\n        Resuspend the DF-1 cells by flicking the Eppendorf tube and prepare 2 μL\n        in the Hamilton syringe.\n      \n        Attach the Hamilton syringe to the stereotactic apparatus.\n        \n            Use the stereotactic apparatus to precisely position the syringe and\n            to inject the cells into the right frontal cortex (2 mm frontal,\n            1.5 mm lateral from bregma, 2 mm deep) (Figure 3[href=https://www.wicell.org#fig3]E).\n          \n            Inject the cells slowly over a time frame of 10 s, and then leave\n            the needle in place for an additional 10 s before slowly removing\n            it.\n          \nNote: Depending on the cells to be\n      injected, an injecting pump may be needed to control the injection rate.\n      In our experimental setting herein, the injected cells (DF1) are not\n      tumorigenic per se, and it is therefore not essential to prevent leakage\n      by lowering the injection speed. However, we do advise to lower the\n      injection rate to 1 μL/minute when cancer cells are injected, which will\n      prevent the formation of extraparenchymal tumors.\n    \n        Prepare some Loctite super glue in a Petri dish and break a cotton swab\n        in the middle in order to create a small spatula.\n      \n        Carefully dry the skull surrounding the craniotomy while leaving some\n        Ringer’s solution on top of the brain tissue.\n      \nNote: Drying the skull will support a\n      proper adherence of the Loctite super glue (step 27 below), and will\n      prevent the glue running over the skull and into the skin which\n      complicates the proper closure of the wound.\n    \n        Verify that the CIW is free of any residual ethanol, and use surgical\n        tweezers to gently place the CIW on the craniotomy hole (Figure 3[href=https://www.wicell.org#fig3]F).\n      \nCritical: The CIW must be placed with\n      the 3-mm diameter coverslip facing the brain. The 3-mm diameter coverslip\n      will perfectly fit the size of the 3-mm craniotomy, allowing the",
    "craniotomy hole to be fully sealed and thereby minimizing the chance of\n      bone regrowth. The upper 5-mm diameter coverslip allows gluing of the CIW\n      to the skull (Figure 3[href=https://www.wicell.org#fig3]F). When the CIW is correctly\n      placed, one can feel that it is firmly inserted inside the craniotomy hole\n      and it will not move.\n    \n        While gently keeping the CIW in place using blunt tweezers with one\n        hand, use the wooden end of the broken cotton swab in the other hand as\n        a spatula to apply the Loctite super glue at the edges of the 5-mm\n        diameter coverslip (Figure 3[href=https://www.wicell.org#fig3]F). Try to avoid any\n        running over of the glue across the middle of the CIW.\n      \n        Wait 1–2 min with the tweezers in place to ensure drying of the glue.\n      \n        Take one head bar and immerge the smaller side into the Loctite super\n        glue, then place it on the skull in the lower back corner (diagonal to\n        the CIW) and allow it to dry while keeping it in place with surgical\n        tweezers (Figure 3[href=https://www.wicell.org#fig3]G).\n      \n        Prepare the dental cement by mixing an equal volume of dental cement\n        powder and solution in a Petri dish.\n      \nNote: The dental cement is required to\n      close and seal the surgical site, while keeping the skin and head bar in\n      place.\n    \nCritical: We recommend to prepare a\n      rather fluid dental cement; the recommended mixing ratio is 1 g powder :\n      0.6 mL liquid. Wait until it starts to solidify, instead of exceeding the\n      initial powder content. Start to apply the dental cement only once it\n      becomes viscous and slowly drops from the surgical spatula.\n    \n        Apply the dental cement slowly by dropping it in the empty spaces\n        between skin and skull, starting from the skin of the neck, proximal to",
    "the head bar. Then, cover the smaller side of the head bar and seal the\n        space around the CIW (Figure 3[href=https://www.wicell.org#fig3]H).\n      \nCritical: Pay attention not to cover\n      the CIW itself with dental cement. A firmly viscous dental cement will\n      help in performing this last step. If needed, the spatula can be used to\n      make refinements to the dental cement shape in the first minutes after\n      making the cement, and the cement may still be pushed away from the\n      central CIW area. Also, small refinements to the dental cement can still\n      be made using a micro-drill prior to the first imaging session, see step\n      40. We do not advise to adjust the shape of the dental cement in this step\n      to prevent the detachment of the CIW (the Loctite super glue and/or dental\n      cement may not have set completely). Moreover, if there was a bleeding\n      during the surgery that was successfully stopped (see\n      troubleshooting[href=https://www.wicell.org#troubleshooting]\nproblem 3[href=https://www.wicell.org#sec6.5]), drilling the dental cement may reinduce\n      the bleeding.\n    \n        Remove the mouse from the stereotaxic apparatus and turn off the\n        isoflurane anesthesia.\n      \n        Weigh the mouse to have a baseline measurement for subsequent weight\n        monitoring.\n      \nPlace the mouse on a heating pad.\n        Administer 300 μL of a 0.9% NaCl solution by intraperitoneal injection.\n      \n        Monitor the mouse until it becomes conscious and then move it back to\n        the housing cage.\n      \n        Add paracetamol to the mouse’s drinking water for the first 7 days after\n        surgery (500 mg paracetamol per 250 mL water).\n      \nNote: Diet gel, placed in the bottom of\n      the cage, provides easy access to water, calories and minerals, and may\n      help speeding up the post-surgery recovery. We recommend to closely\n      monitor the mouse at least daily over the weeks following surgery, and to\n      administer 0.9% NaCl daily (300 μL by intraperitoneal injection) until the",
    "mouse’s weight is equal to, or greater than, its starting weight.\n    \nPART 3: Multimodal imaging\n      CIW-bearing mice can be used for multimodal imaging – in this protocol we\n      describe 2P-IVM and MRI, but it is possible to extend the application to\n      even more (functional) imaging modalities, such as molecular\n      bioluminescence imaging19[href=https://www.wicell.org#bib19] or positron emission\n      tomography.20[href=https://www.wicell.org#bib20] We advise to wait at least 3 weeks\n      before performing the first imaging experiments described below, to allow\n      any wound healing response triggered by the CIW surgery to fully\n      resolve.21[href=https://www.wicell.org#bib21]\nNote: We advise to use monitoring\n      equipment (for example from Harvard Apparatus) to check the mouse’s vital\n      signs such as heart and respiration rate, and body temperature during\n      2P-IVM and MRI. This allows the investigator to assess the depth of\n      anesthesia and adjustment of isoflurane levels if necessary, ensuring\n      proper recovery of the animal after each imaging experiment.\n    \nTwo-photon microscope imaging\nTiming: 2–6 h\n      In this section we explain a standard two-photon microscopy protocol that\n      allows acquisition of an overview of the area below the CIW, and the\n      recording of high-resolution time lapses of specific regions of interest.\n      The exact imaging settings depend on the scientific question and on the\n      specifications of the microscope.\n    \nCritical: Switch on the two-photon\n      microscope before anesthetizing the mouse. Also switch on the climate\n      chamber surrounding the microscope or any other heating system to keep the\n      mouse warm during the imaging and in order for the optic elements of the\n      microscope to reach a stable temperature before starting the imaging.\n    \n        Anesthetize the mouse with isoflurane inhalation anesthesia (3.5%\n        isoflurane/O2 mixture) and place it on a heating pad with a\n        nose mask to ensure continuous anesthesia (use 2% isoflurane/O2\n        mixture for maintenance).\n      \nApply eye ointment.\n        Use a micro-drill to reshape the dental cement around the CIW (Figure 4[href=https://www.wicell.org#fig4]A).\n        \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2562-Fig4.jpg",
    "Figure 4. Preparing the mouse for 2P-IVM\n            \n              (A) Before the first 2P-IVM session it is often necessary to\n              reshape the dental cement to obtain an optimal field-of-view and\n              to remove super glue and/or dental cement residues from the CIW.\n              The dental cement is reshaped using a micro-drill, aiming for a\n              conical shape to keep immersion liquid in place during 2P-IVM\n              experiments. Subsequently, the CIW is cleaned with acetone until\n              it is free of glue residues.\n            \n              (B) The mouse is fixed in the head-bar holder and is constantly\n              kept under isoflurane anesthesia (left image). Dependent on the\n              microscope objective to be used, immersion liquid is added on top\n              of the CIW. Completely fill the conical shape of the dental cement\n              so that there is sufficient immersion liquid for the duration of\n              the experiment (top right image). Lastly, position the CIW under\n              and perpendicular to the objective (lower right image).\n            \nCritical: Excessive amounts of dental\n      cement may limit the range of movement of the microscope’s objective and\n      preclude imaging the full area underneath the CIW. While reshaping the\n      dental cement, it is important to create or maintain the conical shape (Figure 4[href=https://www.wicell.org#fig4]A) which allows it to hold the immersion liquid for the microscope\n      objective on top of the CIW for the duration of the 2P-IVM experiment.\n    \n        Screw the head bar to the head-bar holder and place the mouse on the\n        stage of the two-photon microscope with its nose into the anesthesia\n        mask (Figure 4[href=https://www.wicell.org#fig4]B). Adjust isoflurane levels as\n        necessary – the optimal level is typically around 1%.\n      \n        Adjust the head-bar holder to ensure that the CIW is positioned\n        perpendicular to the objective, allowing optimal imaging time.\n      \n        Depending on the type of objective, add immersion liquid in the dental",
    "cement pocket above the CIW to immerse the objective (Figure 4[href=https://www.wicell.org#fig4]B). The mouse is now ready to be imaged with the settings required for\n        the specific study.\n      \nNote: The total imaging duration and the\n      time interval greatly depend on the specific scientific research question.\n      If one is mainly interested in the overall changes in the brain\n      environment without tracking individual cells, it may be sufficient to\n      collect a tile-scan overview image of the area underneath the CIW at\n      defined time-points. The expected timing is 30 min–1 h, depending on the\n      objective used, the field-of-view imaged and the imaging settings. For\n      example, with a 16× objective (HC FLUOTAR L N.A. 0.6 FWD 2.5 mm), it takes\n      approximately 30 minutes to image 16 individual tiles (covering the area\n      under the CIW) at 512 × 512 pixels, 400 Hz, with a total Z-depth of 300 μm\n      and a Z-step size of 10 μm.\n    \n      If one is interested in tracking individual cells, the total time duration\n      depends on the cell type of interest. Tumor cells generally migrate more\n      slowly than immune cells, in the range of 2–4 μm/h22[href=https://www.wicell.org#bib22],23[href=https://www.wicell.org#bib23] and therefore we would advise a total\n      imaging time of ∼5 h with a time interval of ∼20 min. For immune cells,\n      migrating in the range of 100–200 μm/h1[href=https://www.wicell.org#bib1] a total\n      imaging duration of 20–30 min with a minimal time interval (usually around\n      1 min when scanning at 1024 × 1024 pixels, 400 Hz, a total Z-depth of\n      300 μm and a Z-step size of 5 μm) would be sufficient to detect migrating\n      cells. In case the time interval needs to be shortened further, for\n      example when studying extremely fast-moving cells or other rapid dynamic\n      behaviors, different considerations will have to be made. Limitations in",
    "scanning speed can be overcome by using a resonance scanner with a scan\n      frequency up to 12,000 Hz; however, this is associated with extremely\n      short pixel dwell times and may therefore, depending on the fluorescence\n      intensity and background signal, provide an insufficient signal-to-noise\n      ratio. Another option would be to decrease image size, for example from\n      1024 × 1024 pixels to 512 × 512 pixels, at the cost of resolution. Lastly,\n      one can decide to decrease the Z-depth or to increase the Z-step size, but\n      this may result in cells moving outside the Z-stack or Z-planes.\n    \n      In the situation where the exact same brain environment from a previous\n      imaging session needs to be relocated, it is advised to first make a\n      (low-resolution) overview tile-scan of the tissue underneath the CIW.\n      Visual landmarks, such as patterns in the vasculature or extracellular\n      matrix, can be used to navigate to the region-of-interest.\n    \n        After the 2P-IVM session, remove the mouse from the microscope and\n        inject ∼0.5 mL of 0.9% NaCl solution intraperitoneally to rehydrate the\n        mouse. Return the mouse to its cage, place the cage on a heating pad and\n        visually inspect the mouse until it has fully recovered from anesthesia.\n      \nNote: For in-depth analysis of 2P-IVM\n      data, we advise to use Imaris for image processing, cell segmentation, and\n      extracting single cell measurements, followed by further processing and\n      analyses-of-interest in R.\n    \nMagnetic resonance imaging\nTiming: 5–10 min\n      In this section we describe a standard MRI protocol to monitor tumor\n      growth or regression. However, MRI can also be used to investigate other\n      brain pathologies, including multiple sclerosis7[href=https://www.wicell.org#bib7] and\n      traumatic brain injury.8[href=https://www.wicell.org#bib8]\nCritical: Switch on the MRI machine\n      before anesthetizing the mouse. Also switch on the water bath pumping warm\n      water to the MRI-compatible heating pad inserted in the mouse cradle. For",
    "our experiments, we are using a BioSpec 3T preclinical machine (Bruker).\n    \n        Anesthetize the mouse with isoflurane inhalation anesthesia (3.5%\n        isoflurane/O2 mixture) and apply eye ointment once the mouse\n        is anesthetized.\n      \n        Transfer the mouse in its natural position (belly positioned towards the\n        ground) to the continuously heated MR cradle and fix the mouse in the\n        tooth bar. Adjust isoflurane levels to 1.5–2%.\n      \n        Make sure the mouse’s head is positioned straight and is not tilted\n        before positioning the MRI surface coil.\n      \n        Insert the cradle into the MR bore, placing the animal’s head at the\n        center of the magnet.\n      \n        Run a 3-slice localizer to assess the position of the mouse’s head, and\n        initial MR preparation scans suitable for your experimental design.\n      \nNote: This step may include adjustments to\n      tune and match the frequency of the coil, to the radiofrequency power, and\n      to compensate for MR field inhomogeneities.\n    \n        Start the desired protocol on the MRI machine. To visualize high-grade\n        gliomas, we suggest to use a 2D turbo rapid acquisition relaxation\n        enhancement (Turbo-RARE) T2-weighted acquisition with the following\n        pulse sequence parameters: TR = 3000 ms, TE = 75 ms, NA = 6, number of\n        slices 10, slice thickness (ST) = 0.7 mm, FOV = 20 × 20 mm2,\n        pixel size 0.156 × 0.156 mm2, (ETL = 12, Tacq =\n        3 min) with images being acquired in axial planes.\n      \n        After the MRI session, remove the mouse from the cradle and return it to\n        its cage. Visually inspect the mouse until it has fully recovered from\n        anesthesia. This happens usually within 1 min when the total duration of\n        the MRI scan is short (5–10 min if monitoring brain tumor growth).\n      \nNote: We suggest to use the free MIPAV\n      (Medical Image Processing, Analysis, and Visualization) application\n      (National Institutes of Health, USA) for quantification of tumor volumes."
  ],
  "subjectAreas": [
    "Immunology",
    "Microscopy",
    "Cancer",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}