{
  "id": 2252,
  "origin_website": "Cell",
  "title": "SPIKES: Identification of physicochemical properties of spike proteins across diverse host species of SARS-CoV-2",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nData collection and preprocess\nTiming: ∼2 h\nThis section describes download of the S protein sequence data from GISAID and NCBI databases.\nUser registration is required to download the data from GISAID link[href=https://www.gisaid.org/].\nFirst, log in to the GISAID database, search for the SARS-CoV virus in the search box. Select the host (human/others), and download the S protein sequences in FASTA format.\nHuman and animal host CoV S protein sequences can be obtained from the NCBI database using the search terms “S protein” and “SARS-CoV”.\nA description of acquired data from the GISAID and NCBI databases, and an example of the FASTA file format is shown in Figures 1[href=https://www.wicell.org#fig1]A and 1B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1722-Fig1.jpg\nFigure 1. Screenshots showing spike protein data acquisition from databases\n(A and B) (A) Displaying SARS-CoV-2 data from GISAID and (B) NCBI databases. An example of amino acid sequence in FASTA format.\nPreprocessing the FASTA sequence data.\nThe human and animal FASTA sequences must be formatted independently.\nThe input must be all the S protein sequences of human/animal in bulk.\nThe Initial dataset consisted of several thousand S protein sequences of spike human (spike-H) and spike animals (spike-A). Because amino acid changes are a crucial factor for disease transmission, we considered 99% sequence identity in the redundancy reduction process. Use the CD-HIT web server to reduce the sequence redundancy.\nGo to the CD-HIT we bserver at link[href=http://weizhong-lab.ucsd.edu/cdhit-web-server/cgi-bin/index.cgi].\nLoad query FASTA sequence file under cd-hit tab.\nChoose sequence identity cut-off value of 0.99.\nAlgorithm parameters: select ‘yes’ to the ‘use global sequence identity’ and ‘sequence is clustered to the best cluster that meet the threshold’. Set bandwidth of alignment to 20 and length of sequence to skip to 10.",
    "Alignment coverage parameters: set a default value ‘0’ for minimal alignment coverage (fraction) for the longer sequence, minimal alignment coverage (fraction) for the shorter sequence, and minimal length similarity (fraction). Set ‘unlimited’ to the maximum unaligned part (amino acids/bases) for the longer sequence, maximum unaligned part (amino acids/bases) for the shorter sequence, and maximum length difference in amino acids/bases(-S).\nUser may change or use default options for algorithm parameters and alignment coverage parameters.\nClick on submit button.\nUsers can also use the protein-to-protein BLAST option from the BLAST server link[href=https://blast.ncbi.nlm.nih.gov/Blast.cgi?CMD=Web&PAGE_TYPE=BlastDocs&DOC_TYPE=BlastHelp] to determine the sequence similarity between two protein sequences.\nExclude ambiguous FASTA sequences by removing any protein sequences containing special characters, such as ‘B, J, O, U, X and Z’, that do not represent a specific amino acid.\nAfter sequence redundancy reduction and accounting for uncertainties, the dataset consisted of 211 and 611 S protein sequences of spike-H and spike-A, respectively. For analysis, select the 211 spike-H proteins and a random sample of the 611 spike-A proteins. This will produce a final balanced dataset consisting of 211 and 211 S protein sequences of spike-H and spike-A, respectively.\nIt could take ∼2 h for downloading the desired/updated SARS-CoV-2 sequences and preprocessing, which depend on the speed of the Internet connection and the computer processor.\nCritical: Ensure you have sufficient storage on your computer before downloading data from GISAID. Downloading and extracting the initial dataset from GISAID requires ∼ 4 GB of disk space.\nFeature extraction\nTiming: ∼1 h\nThe AAindex database contains numerical indices representing the PCPs of amino acids (Kawashima et al., 2008[href=https://www.wicell.org#bib7]). Each index represents a different PCP and has 20 values, one for each of the 20 naturally occurring amino acids.",
    "SPIKES adopted 531 PCPs retrieved from the AAindex database as candidate features to distinguish S proteins of diverse CoV strains. The original CoVs’ amino acid sequences were converted into AAindex numerical indices according to the 531 PCP values. That is, each amino acid in the sequence was represented by the 531 index values for that amino acid in the AAindex. The feature representation of the 531 PCPs is described as follows:\nCollect the spike protein sequences from the dataset.\nCalculate the amino acid composition l(aai) of a sequence for the ith amino acid aai of 20 amino acids and encode the protein sequence of variable length into the feature vector with a length of 531 properties. The AAindex matrix is provided in link[href=https://github.com/mingjutsai/SPIKES/tree/main/src/aaindex].\nCalculate the feature value of the pth physicochemical property, PCP(p), of a spike protein, where p=1, 2, …, 531.\n   (Equation 1)   P C P  ( p )  =  ∑  i = 1  20   l  (  a  a i   )  . P C  P p   ( a  a i  )       \nBefore converting the FASTA sequence into AAindex features, users are required to compile the AAindex to get the executable program.\n>git clone https://github.com/mingjutsai/SPIKES\n>cd SPIKES\n>src/aaindex\n>make\nFeature selection and model tuning\nTiming: ∼1 h\nFeature selection and model tuning are the core of this workflow.\nFeature scaling helps to normalize the features within a specific range. Scaling maps the feature values into the {-1, 1} or {0, 1} interval. The feature scaling to the dataset can be applied using “svm-scale”, a regular program provided by LIBSVM.\nThe feature values were scaled in to the range of -1 and +1. The feature scaling of the dataset is provided in the link[href=https://github.com/mingjutsai/SPIKES/blob/main/src/libsvm_320/svm-scale.c].\n>cd SPIKES\n>src/libsvm_320\n>make\nUsage: svm-scale [options] data filename\n  Options",
    "-l lower : x scaling lower limit (default -1)\n  -u upper : x scaling upper limit (default +1)\n  -y y_lower y_upper : y scaling limits (default: no y scaling)\n  -s save_filename : save scaling parameters to save_filename\n  -r restore_filename : restore scaling parameters from restore_filename\nNote: The training and test data should apply the same scaling parameter. For more information, please refer LIBSVM website and download its SVM package: link[href=http://www.csie.ntu.edu.tw/%7Ecjlin/libsvm/].\nFeature selection\nTiming: ∼2–3 h\nThe SPIKES was developed using SVM (Vapnik, 1999[href=https://www.wicell.org#bib17]) incorporating an optimal feature selection algorithm, IBCGA (Ho et al., 2004[href=https://www.wicell.org#bib4]) to select informative features from a large number of candidate features. SPIKES selects important PCPs of S proteins and distinguishes the human host from the animal host coronaviruses simultaneously. Further details of the feature selection algorithm could be found in these studies (Tung and Ho, 2007[href=https://www.wicell.org#bib14]) and (Tung and Ho, 2008[href=https://www.wicell.org#bib15]). The parameter tuning of SVM can also be found in the study (Yerukala Sathipati and Ho, 2021[href=https://www.wicell.org#bib18]). The steps involved in the feature selection process is depicted in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1722-Fig2.jpg\nFigure 2. The steps involved in feature selection algorithm\nThe steps involved in IBCGA are as follows:\nStep 1: (Data Preparation) Compile the training sets from spike-H and spike-A for developing and evaluating the SPIKES method.\nStep 2: (Initialization) Randomly generate an initial population of Npop individuals. Npop = 50, rstart = 50, rend = 10, and r = rstart.\nStep 3: (Evaluation) Evaluate the fitness value of all individuals using the fitness function that is the prediction accuracy in terms of 10-fold cross-validation (10-CV).\nStep 4: (Selection) Use a conventional tournament selection method that selects the winner from two randomly selected individuals to generate a mating pool.",
    "Step 5: (Crossover) Select two parents from the mating pool to perform an orthogonal array crossover operation.\nStep 6: (Mutation) Apply a conventional bit mutation operator to GA-genes of SVM parameters and a swap mutation to the binary GA-genes for keeping r selected features. The best individual was not mutated for the elite strategy.\nStep 7: (Termination test) If the stopping condition for obtaining the solution Xr is satisfied, output the best individual as the solution Xr. Otherwise, go to step 2.\nStep 8: (Inheritance) If r > rend, randomly change one bit from 1 to 10 in the binary genes for each individual. Decrease the number r by one and go to step 2. Otherwise, stop the algorithm.\nStep 9: (Output) Obtain a set of m features in total for PCPs, from the best solution Xm among the solutions Xr, where r = rend, rend + 1,… , rstart.\nThe SPIKES model file to select the PCPs has been provided at link[href=https://github.com/mingjutsai/SPIKES/tree/main/src/aaindex].\nFirst train the SPIKES-Training data using the SPIKES model file and validate on SPIKE-Test data. The usage of datasets and SPIKES is provided at link[href=https://github.com/mingjutsai/SPIKES/tree/main/src].\nPhysicochemical properties identification\nTiming: ∼10 min\nWe’ve built an easy-to-use prediction pipeline from protein FASTA to prediction results using 11 informative features (Table 2[href=https://www.wicell.org#tbl2]) prediction model.\ntable:files/protocols_protocol_1722_2.csv\nCreate an output folder for prediction results and use the following command to conduct the SPIKES prediction pipeline:\n>mkdir output\n>perl SPIKES_main.pl protein.fa output\nPhysicochemical property analysis\nTiming: ∼2–3 h\nUse the PCPs selected by the SPIKES model for comparing features between the S proteins of human and animal CoVs.\nMeasure the PCPs for Spike-H and Spike-A to compare the property differences in human and animal host CoVs.\nMeasure the amino acid and dipeptide compositions.",
    "The values of f(aai) were calculated for the Spike-H and Spike-A where i=1,…, 20. The feature set of DPC is represented as a feature vector of length 400 for the dipeptides, (i.e., AA, AC…. YY). The feature set of PseAAC is represented as a feature vector of length 80 for the AAC and PseAAC for hydrophilicity and hydrophobicity.\nThe amino acid and dipeptide conversion can be done using the following sequence conversation code via R studio.\n>library(seqinr)\n> Human <- read.fasta('Human.fasta', seqtype=\"AA\", as.string = TRUE)\n>NonHuman <- read.fasta('nHuman.fasta', seqtype=\"AA\", as.string = TRUE)\n#Check for non-amino acids in the FASTA sequence\n>Human[(sapply(Human, protcheck))]\n>NonHuman [(sapply(NonHuman, protcheck))]\n#AAC and DPC Feature extraction\nAAC <- t(sapply(Human, extractAAC))\nDPC <- t(sapply(Human, extractDC))\n# Do the same for NonHuman host coronavirus sequences\nBelow is the list of PCPs obtained from SPIKES.\nNote: Users may get a different set of features by using a larger S protein dataset and modifying the tuning of search parameters.\nTo determine the significance of compositional changes in amino acids in S protein from different strains of CoVs, the user may use the hCoV-19 spike glycoprotein mutation surveillance dashboard from GISAID.\nLogin into the GISAID webpage. Select EpiCoV > spike glycoprotein mutation surveillance.\nThe specific amino acid changes in S proteins have been implicated in increasing the infectivity and virulence of new variants. User may use GISAID data statistics to examine the amino acid changes in S protein that increased the infectivity in emerging new variants.\nUsers can use Chimera protein visualization software to visualize the S protein structure in .pdb format and observe the amino acid preferences in alpha helices and beta sheets.\nVisit the Chimera URL link[href=https://www.rbvi.ucsf.edu/chimera/] and download and install the software.\nVisit the Protein Data Bank URL link[href=https://www.rcsb.org/]. Search for the S protein (e.g., PDB: 6VXX).",
    "Download the protein structure in .pdb format.\nOpen the 6VXX.pdb file in the Chimera protein visualization software. File > open > 6VXX.pdb."
  ],
  "subjectAreas": [
    "Proteomics",
    "Microbiology",
    "Bioinformatics",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}