{
  "id": 15293,
  "origin_website": "Jove",
  "title": "Constitutive and Inducible Systems for Genetic In Vivo Modification of Mouse Hepatocytes Using Hydrodynamic Tail Vein Injection",
  "procedures": [
    "All animal experiments were performed according to the guidelines for the care and use of laboratory animals and were approved by responsible authorities (Regierung von Oberbayern, Munich, Germany and Stanford Institutional Animal Care and Use Committee, Stanford, CA, USA). A list of all plasmids for cloning (step 1 through 4) is provided in supplementary table S1.\n1. Cloning of a Transgene for Constitutive Gene Expression\nDesign primers for transgene amplification13,14.\nAdd restriction sites for PacI (TTAATTAA) to the 5' end of the forward primer. Add restriction sites for AscI (GGCGCGCC) or FseI (GGCCGGCC) to the 5' end of the reverse primer.\nAmplify transgene by PCR using conditions optimized for the desired transgene14. Purify using a commercially available DNA purification kit.\n\tNOTE: Annealing time depends on the primers designed in step 1.1., elongation time depends on the length of the construct. For example, for a construct of 1,000 bp length use 60 s of elongation time.\nDigest transgene and vector for constitutive gene expression15 with respective restriction nucleases (see step 1.2) and buffer in a total volume of 50 µL at 37 °C overnight. For example, digest construct with 5 units PacI and 5 units FseI if appropriate (see step 1.2).\nGel purify digested vector and insert using a commercial gel extraction kit according to the manufacturer's instructions. Perform a standard ligation of 100 ng of vector and 100–1,000 ng of insert using 400 U T4 ligase at 14 °C for 16 h. Heat inactivate at 65 °C for 10 min.\nTransform competent bacteria using a standard heat-shock-protocol16.\nPlate on agar plates containing 100 µg/mL ampicillin. Incubate at 30 °C for 24 h.\nPick single colonies, purify plasmid DNA using a commercial miniprep kit according to the manufacturer's instructions and verify the sequence by Sanger sequencing17 (sequencing primer: 5' TGCTGGAGTTCTTCGCC 3').",
    "Use positive colonies for maxi scale amplification of plasmid DNA and purify using an endotoxin-free plasmid preparation kit18 according to the manufacturer's instructions.\nConstruct is ready for injection, thus continue with step 5.\n2. Cloning of a Transgene for Inducible Gene Expression\nDesign primers for transgene amplification13,14.\nAdd restriction sites for SacI (GAGCTC), SpeI (ACTAGT), or KpnI (GGTACC) to the 5' end of the forward primer. Add restriction sites for NotI (GCGGCCGC) or XhoI (CTCGAG) to the 5' end of the reverse primer.\nAmplify transgene by PCR using conditions optimized for the desired transgene14. Purify using a commercial DNA purification kit.\nDigest the purified transgene and 4 µg of Entry vector (pEN_TTmcs-Vector, see Table of Materials)19 separately with appropriate restriction nucleases (see step 2.2) and buffer in a total volume of 50 µL at 37 °C overnight.\nGel purify digested vector and insert using a commercial gel extraction kit according to the manufacturer's instructions. Perform standard ligation with 100 ng of vector and 100–1,000 ng of insert using 400 U T4 ligase at 14 °C for 16 h. Heat inactivate at 65 °C for 10 min.\nTransform competent bacteria using a standard heat-shock-protocol16.\nPlate on agar plates containing 15 µg/mL gentamicin. Incubate at 37 °C for 16 h.\nPick single colonies, purify plasmid DNA, and verify insert by sequencing17 using the pCEP forward primer: 5' AGAGCTCGTTTAGTGAACCG 3'.\n\tNOTE: PCR on single colonies can be performed without prior purification with primers pCEP forward and pCEP reverse (5' AGA AAG CTG GGT CTA GAT ATC TCG 3'). This step can useful for pre-selection of positive colonies.\nProceed to step 4.\n3. Cloning of a miR-shRNA for Inducible Gene Knock-down\nDesign miR-shRNA oligonucleotides according to the pSLIK cloning protocol19. Anneal and purify oligonucleotides and dilute 1 : 20 in ddH2O.",
    "Digest 3 µg of Entry vector with 5 U BfuAI at 50 °C for 3 h, then inactivate the reaction at 65 °C for 20 min.\n\tNOTE: If co-expression of green fluorescent protein (GFP) is desired, use pEN_TTGmiRc19 as an entry vector, otherwise use pEN_TTmiRc219.\nGel purify digested vector as in step 2.5. Perform standard ligation of 100 ng of vector and 1 µL of purified and diluted shRNA oligonucleotides (step 3.1) using 400 U T4 ligase at room temperature for 1 h. Heat inactivate at 65 °C for 10 min.\nTransform competent bacteria using a standard heat-shock-protocol16.\nPlate on agar plates containing 15 µg/mL gentamicin. Incubate at 37 °C for 16 h.\nPick single colonies, purify plasmid DNA, and verify insert by Sanger sequencing17 (sequencing primer: 5' TAGTCGACTAGGGATAACAG 3').\nProceed to step 4.\n4. Recombinational Cloning to Generate Ready-for-Injection Clones\nMix 150 ng of Entry vector (from step 2 or step 3) and 150 ng of pTC TET-vector20.\nAdd TE buffer to a total volume of 8 µL (pH=8).\nTransfer the LR-clonase enzyme mix II (see Table of Materials) to ice, incubate for 2 min. Vortex twice.\nAdd 2 µL of LR-clonase enzyme mix II to the reaction and incubate at 25 °C for 1 h.\nStop the reaction by adding 1 µL of Proteinase K-solution. Incubate at 37 °C for 10 min.\nTransform Stbl3 competent bacteria with 2 µL of recombinational cloning mix using a standard heat-shock-protocol16.\nPlate on agar plates containing 100 µg/mL ampicillin. Incubate at 30 °C for 24 h.\nPick single colonies, purify plasmid DNA using an endotoxin-free plasmid preparation kit18 according to the manufacturer's instructions, and confirm vector integrity by Sanger sequencing17 (sequencing primer 5' AGGGACAGCAGAGATCCAGTTTGG 3').\nConstruct is ready for injection, continue with step 5.\n5. Preparing Solution for Hydrodynamic Tail Vein Injection",
    "NOTE: Preparation of constructs for constitutive and inducible gene expression are described in Step 1, 2, 3, and 4.\nPrepare sterile 0.9% saline for injection (do not use PBS). Use volume corresponding to about 10% of mouse body weight. Example: for a mouse weighing 20 g, prepare 2 mL of solution.\nPrepare injection vectors that were purified using an endotoxin-free plasmid purification kit18 (see step 1.8 or 4.8, respectively).\nAdd 10 µg or 15 µg of endotoxin-free sleeping beauty vector construct (from step 1 use 10 µg, from step 4 use 15 µg, respectively) and 1 µg of endotoxin-free pc-HSB521 per mL of sterile saline.\nStore solution for up to 4 h at 4 °C. Do not freeze.\n6. Performing Hydrodynamic Tail Vein Injection\nUse a restrainer for tail vein injection (commercial or prepared from a 50 mL conical tube with holes for breathing and for the tail). Fill bottom of the tube with tissue paper.\nFor injection, use mice of about 8–10 weeks of age with weights of 20–25 g.\nWeigh mice before injection and prepare injection volume according to body weight (corresponding to 10% of body weight, see step 5.1). Prepare a sterile 3 mL-syringe with a 27 G-needle for injection and fill with the required volume.\nPlace the mouse into the restrainer. Adjust the amount of tissue paper (see step 6.1) to leave only minimal space for movement but enough space for breathing.\nEnsure that the mouse is breathing regularly.\nWarm the tail using an infrared lamp for 30-60 s. Carefully watch for signs of overheating.\nClean the tail with an alcohol swab.\nInsert the needle almost horizontally into either one of the two lateral tail veins close to the base of the tail.",
    "NOTE: If placed successfully, a small amount of blood might flow back into the cone of the needle. It is not recommended to actively aspirate as any additional movement of the needle can result in its displacement and/or injury of the vein.\nInject the total volume into the tail vein within 8-10 s.\nImmediately remove the mouse from the restrainer. Compress injection wound for at least 30 s or until any bleeding subsides.\nPlace the mouse into a separate cage. Once the mouse has recovered from the procedure (about 30–60 min), transfer the mouse back to its original cage. Check on the mouse regularly for the next 24 h.\n\tNOTE: Mild sedation of the mouse is routinely observed for up to 2 h after injection.\nBefore proceeding with further experiments (i.e., step 7), wait 10–15 days for clearance of non-integrated vectors.\n7. Induction of Transfected CreER with Tamoxifen\nCAUTION: Tamoxifen is harmful, may be cancerous or damage fertility. Please refer to the safety data sheet.\nPlan intraperitoneal tamoxifen injections on three consecutive days.\nOn day 1, dissolve 10 mg of tamoxifen in 40 µL ethanol. Incubate at 55 °C for 10 min. Vortex several times until the tamoxifen has dissolved.\nAdd 960 µL corn oil. Incubate for 5 mins at 55 °C. Vortex several times to get a clear solution.\nPrepare the solution in a 1-mL insulin syringe with a 27 G needle.\nScruff the mouse by grabbing the neck of the mouse carefully with the thumb and the second finger, fixing the tail between the base of the hand and the fourth and fifth finger.\nInject 0.1 mL (= 1 mg of tamoxifen) of the solution intraperitoneally into the left lower quadrant of the abdomen.\nRepeat the injections on days two and three.",
    "8. Induction of Tetracycline-dependent Gene or shRNA Expression\nCAUTION: Doxycycline may be harmful. Please refer to the safety data sheet.\nNOTE: Depending on the type and duration of the experiment, doxycycline can be supplied in drinking water (step 8.1) or chow (step 8.2)\nFor short term experiments (<10 days) administer doxycycline via drinking water using the following protocol.\nDissolve 5 g sucrose in 100 mL of tap water. Autoclave.\nDissolve 100 mg of doxycycline-hyclate in 5 mL of sucrose solution (step 8.1.1) in a 15-mL conical tube.\nUsing a 10-mL syringe, sterile filter the solution through a 0.2 µm filter. Add to the sucrose solution prepared in step 8.1.1.\nSupply doxycycline-sucrose solution as drinking water to the mouse. Check daily and replace when the solution becomes cloudy indicating bacterial overgrowth (replace clear solution after three days at the latest).\nFor long term experiments (>10 days) or experiments sensitive to metabolic changes, use commercial doxycycline-chow (e.g., Doxycycline Hyclate Chow 0.625 g/kg) to avoid dehydration and/or sucrose-induced changes in the livers of treated animals.\n9. Preparation of Mouse Liver for Analysis by Immunostaining\nCAUTION: Paraformaldehyde may be harmful. Please refer to the safety data sheet.\nNOTE: The timepoint when mice will be analyzed depends on the experiment. It is recommended to analyze liver tissue after no less than three days of doxycycline treatment to ensure sufficient induction of transgene or shRNA expression.\nPrepare a 1 mL syringe with a 27 G needle with 1 mL of 4% paraformaldehyde solution (PFA).\nEuthanize the mouse by an appropriate method according to an approved animal protocol.\n\tNOTE: Guidelines for appropriate methods of euthanasia may vary depending on the institution.",
    "Using dissecting scissors and anatomical forceps, carefully open the abdominal cavity with a median laparotomy to expose the liver. Move the small intestine to the right to expose the portal vein and the inferior vena cava (IVC).\nInsert the needle of the prepared syringe (see step 9.1) into the IVC and cut the portal vein. Inject 1 mL of PFA slowly into the IVC to perfuse the liver tissue and remove auto-fluorescent red blood cells (desirable if immunofluorescent staining will be performed).\nRemove the liver. Rinse in water and transfer to 5–10 mL of 4% PFA solution.\nFor paraffin sections, fix tissue for 36–48 h. Tissue is ready for dehydration and paraffin embedding.\nFor frozen sections, fix tissue in 4% PFA for 1 h.\nFor cryoprotection, transfer to 10% sucrose solution. Incubate 60 min.\nTransfer to 20% sucrose solution. Incubate 60 min.\nTransfer to 30% sucrose solution. Incubate 12–16 h. Embed in embedding compound for frozen sections and freeze at -20 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}