{
  "id": 18092,
  "origin_website": "Jove",
  "title": "Emergency Undocking in Robotic Surgery: A Simulation Curriculum",
  "procedures": [
    "The IRB determined that this project was exempt from IRB review in accordance with federally defined categories of exempt review per 45 CFR 46.101 Category 2.\n1. Gather and Prepare Materials\nCollect materials for the training curriculum, including a robotic system with 2 training arms (see Table of Materials), 3 trocars, and a laparoscope.\nIn the hollow training torso, create at least 3 separate incisions with a scalpel to place laparoscopic instrument trocars. Ensure that the incisions are consistent with those found in robotic surgery, i.e., one above the umbilicus, and one in each the right and left lower quadrant large enough to accommodate a trocar.\nTo simulate a vessel and subsequent vessel injury, create a vessel using rubber tubing. Tubing from a water seal chest drain functions well.\n\t\nCut a separate tube for the vena cava and descending aorta.\nConnect two shorter pieces replicating the right and left common iliac veins and two shorter pieces replicating the common iliac arteries to the vena cava and aorta, respectively, using a Y-connector.\nCreate a notch at the distal end of the common iliac artery to allow for simulated blood to escape in the case of a vessel injury.\nPlace the vessels against the posterior wall of the torso and secure using glue. Protrude the access point to the vessel through the cephalad portion of the torso to allow for instillation of red food colored fluid.\nColor as necessary for realism with oil base red and blue paint for artery and vein respectively. Coat with a protective clear enamel spray for durability.\nObtain a 1-liter bag of IV fluid. Inject red food coloring until the fluid has a color consistent with blood. Hook this bag to the previously assembled vessel.",
    "Drape the torso with operating room drapes used for laparoscopic surgery or laparotomy. Ensure that the drape covers the entire OR table.\nHave embedded standardized persons (ESPs) or confederates fulfill the roles laid out in the emergency undocking protocol (Figure 2). A minimum of 4 individuals is required. Alternatively, OR personnel can be employed to perform their actual roles.\n2. Setup of the Operating Room\nPlace the training torso, complete with vessel and IV tubing, and connect it to an IV fluid bag on the OR table. Place the table in a steep trendelenburg position, then drape using OR drapes.\nPlace the laparoscopic trocars into the training torso through the incisions made previously. Move the robotic patient side cart to the bedside, and attach robotic arms to trocars. Once attached, dock robotic training instrument and camera to torso using trocars.\nPlace ESPs or OR staff in desired roles as described in Figure 2. Have the surgeon console on and ready for surgeon to assume control of robotic instruments.\n3. Simulation and Debriefing\nHave the surgeon enter the room and position at the surgeon's console. Instruct the surgeon to adjust positional settings, but not take control of the instruments until completion of orientation to the case.\nIntroduce the ESPs or OR staff to the surgeon. Read one of the case stems presented in Figure 3. Then, instruct the surgeon to take control of the instruments following completion of the case stem.\nHave the anesthesia ESP initiate bleeding from the vessel via pressure bag or manual pumping of fluid bag once the case stem is completed. The IV tubing should be wide open, allowing for brisk bleeding. Allow the surgeon up to 5 minutes to complete emergency undocking.",
    "Following the case (or after 5 minutes), proceed with debriefing and didactic component of the scenario and procedure. During the debriefing emphasize key points of personnel roles as listed in Figure 2, key equipment including instrument arms and patient side cart, and use of closed loop communication.\nReposition ESPs or OR staff, and run a second case to reinforce the lessons taught during debriefing. Following the case, reiterate any points missed during the second case.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}