{
  "id": 13813,
  "origin_website": "Jove",
  "title": "Induction of Protein Deletion Through In Utero Electroporation to Define Deficits in Neuronal Migration in Transgenic Models",
  "procedures": [
    "NOTE: All experiments were approved by the University of Ottawa’s Animal Care ethics committee, adhering to the Guidelines of the Canadian Council on Animal Care.\n1. Pre-surgical Preparation and Materials\nPlasmid Preparation:\n\t\nPrepare plasmids using the Qiagen MegaPrep according to the manufacturer’s protocol. Innoculate at least 400 ml of LB broth with transformed bacteria to ensure a high DNA yield and incubate overnight.\nResuspend plasmid in 100-200 µl TE to a final concentration of at least 5 µg/µl. Aliquot DNA and store at -20 °C. If the concentration is too low, do not precipitate and resuspend as this can add impurities. Start over with a new preparation.\nBefore surgery, dilute a single plasmid (Cre-GFP for example) to 2 µg/µl in sterile water with 1 µl of 0.1% (w/v) Fast Green dye per 10 or 20 µl of diluted plasmid solution. If GFP and the gene of interest are to be co-electroporated on separate plasmids, inject the GFP plasmid and the plasmid carrying the gene of interest at a ratio of 1:4 to maximize the likelihood that all cells marked with GFP are co-electroporated with both plasmids.\nPull glass microcapillary tubes (1 mm outer diameter - hereafter referred to as needles) on a standard needle puller, using a single step pull at 62 °C.\nAutoclave a surgical pack containing the following: needle holders, wound retractor, forceps, scissors for surgery, scissors for needles, stapler, staples, gauze, wound covers, surgical drapes (Figure 1A, B; Materials Table).\nCollect other required tools: Electroporator, Femtojet Microinjecter, Tweezertrodes (5 or 7 mm), saline, suture, 5 ml syringe (Materials Table).\n2. Prepare Mouse for Surgery\nFor pain management, inject a timed-pregnant mouse with Buprenorphine (0.05 mg/kg body weight) one hour before surgery. Apply this protocol to mice timed anywhere from embryonic day 12.5 (E12.5) to E17.5.",
    "Use microloader pipette tips to back-load pulled needles with the plasmid solution. Do not fill all the way into the tip of needle yet as this will cause the needle to become clogged.\nAnaesthetize mouse using 2-5% isoflurane gas with 1 L/min O2. Once immobile, place in face mask and apply ointment to eyes to prevent drying. Inject with 1 ml saline (0.9% NaCl) subcutaneously in back.\n\tNOTE: When working with isoflurane gas, use a gas scavenger to recapture excess gas and prevent it from escaping into the room.\nShave abdomen. Wash abdomen with Chlorohexadine scrub, rinse with water, and apply a final prep solution of chlorohexadine and 70% ethanol. Cover mouse with sterile drape or gauze to cover fur but leave abdomen exposed (Figure 1C, D).\n3. In utero Electroporation\nMake an incision in the skin over the abdomen between the lower teats. Pull the skin away from the underlying muscle layer by tearing the connective tissue, then cut through the peritoneum into the abdominal cavity along the linea alba. Insert the wound retractor to pull the edges of the wound apart.\nRemove the uterus from the abdominal cavity and lay it out as shown (Figure 1E).\n\t\nIf different pups are to be injected with different plasmids (such as GFP vs. GFP with the gene of interest), count the pups on each side and decide which ones and how many to inject with each plasmid. Replace one side of the uterus back into the abdomen to keep the embryos warm and lubricated. Immediately moisten the exposed uterus with saline (preferably warmed to body temperature).\nIf injecting all pups with the same plasmid (such as when injecting Cre-GFP into transgenic embryos) only remove one horn of the uterus at a time.",
    "Put a loaded needle in the grip head of the injection wand and carefully cut the tip with a pair of small surgical scissors or fine forceps. Cut the tip so the needle stays as long as possible while still allowing fluid to pass through (Figure 1Ji-iv).\n\t\nAdjust length of injection (in seconds) and injection pressure on the microinjector so that a small yet easily visible droplet of 0.1-0.2 µl appears on the tip of the needle when the foot paddle is pressed. Keep the volume of this droplet as consistent as possible between different needles.\n\t\tNOTE: this step is crucial for embryo survival (see discussion).\nUse the following injection parameters for the Femtojet: injecting pressure (pi) = 250-300 hPa; injection time (ti) = 0.8-1.2 sec; compensation pressure = 10-50 hPa. If required, adjust these parameters to accommodate variation between needles.\nSelect an embryo and gently position it on its back, head tilted upward (Figure 1F).\n\tNOTE: This may require turning or shifting the embryo; be careful not to apply too much pressure and avoid rupture of the amniotic sac while manipulating the embryo.\nOnce the embryo is in place, locate the ventricle, which presents as a crescent shaped shadow parallel to the sagittal sinus. Touch the tip of the needle to the uterus above the ventricle at a slight angle and guide the needle through the uterine wall. The amount of pressure required depends on the sharpness of the needle. Push the needle through the cortex into the ventricle.\n\tNOTE: Although there is rarely any additional detectable resistance, the embryo’s head is often pushed away slightly and then recoils as the needle passes through the cortex into the ventricle.",
    "Pump the foot paddle to inject the plasmid solution. Continue to pump until a green area is visible and conforms to the arc shape of the ventricle (Figure 1G). In young embryos (E12.5 to E14.5) the dye will often diffuse into the contralateral ventricle.\n\tNOTE: The number of pumps depends on the diameter of the needle tip, the age of the embryo (and resulting size of the ventricle) and the desired injection volume. Keep volume injected as consistent as possible between embryos.\nInject three or four embryos. Keep all exposed embryos moist with saline throughout procedure.\nGo back to the first embryos injected and place the paddles such that the positive electrode will draw the plasmid into the desired region of the brain (Figure 1H). Angle the negative electrode so that the shortest path between the electrodes passes directly through the structure targeted for electroporation (Figure 2).\nOnce the paddles are in place, apply the shock. Depending on the age and size of the embryos, use 5 pulses of 35-50 V (see Table 1). Use the following electroporation parameters: pulse length of 5 msec with a pulse interval of 950 msec. Repeat with all injected embryos.\nCut the tip of new pre-loaded needle as in step 3.3 as the last needle likely dried and clogged during step 3.9. Inject the next set of three or four embryos with either the same plasmid or a different plasmid and then apply the shock as in step 3.9. When all the pups in one side of the uterus are injected, remove the second side of the uterus from the female’s abdomen and then replace the completed side to keep it warm.",
    "Return both sides of the uterus to the female being careful to keep the surface moist with saline and not to apply too much pressure to prevent trauma to the amniotic sacs. Suture the muscle layer closed using a simple continuous stitch. Staple the skin closed. If staples are not available, suture the skin with a simple interrupted stitch. (Figure 1I)\nWhile suturing, progressively turn down the isoflurane to allow the pregnant female’s anesthesia to lighten.\n\tNOTE: This will expedite arousal of the dam after the surgery is complete; keeping the female anesthetized for as short a time as possible will improve embryo survival. Total surgery time, starting from when the female is first anaesthetized, should be approximately 30 min.\n4. Aftercare\nPlace the sutured female in an incubator or on a heating pad to recover from anesthesia. Bed her on clean bedding and place a standard recovery gel in the cage maintain hydration. For pain management following surgery, give the female three doses of Buprenorphine (0.05 mg/kg body weight) at 8 hr intervals following surgery, then four additional doses at 12 hr intervals. \n5. Harvesting Brains\nNOTE: Brains can be harvested at any age up to adulthood. The following applies for collecting brains prior to birth. Note that once pups are born, the order within the uterus is lost, so either every pup in the litter must be injected with the same plasmid, or another method of differentiating between control and experimental animals must be devised.\nPrepare cold (4 °C), filtered 4% paraformaldehyde (PFA) prior to euthanizing female.\nEuthanize the female using an intraperitoneal injection of a lethal dose of sodium pentobarbital (100 mg/kg body weight) and cut open abdomen. Pull out both sides of the uterus and lay out as when pups were initially injected.",
    "In the case where all pups received the same plasmid, such as when injecting Cre into a transgenic litter, embryo order is not important, therefore cut the uterus out of the female and place in PBS.\nIf pups were injected with different plasmids, be sure to locate each pup, noting any dead pups, and determine which ones were injected with control and experimental plasmids before removing the uterus from the female. Be careful to keep track of which pup belongs to which group after the uterus is in PBS.\nRemove each pup individually, decapitate with sharp scissors or a razor blade and place the head in PBS. In the case of transgenic mice, collect tissue samples for genotyping and keep each head separate, such as in a 12-well plate.\nUnder a dissecting scope, remove the brain from the skull, being careful not to nick the cortex or tear the midline. Using a fluorescent microscope, check to see if brains have a GFP+ patch, indicating that they were electroporated successfully.\nFix brains by immersion in PFA at 4 °C overnight.\n\tNOTE: Check brains for expression of GFP prior to fixation since PFA often quenches the signal.\nCryoprotect brains through immersion in 20% sucrose for at least three days prior to freezing. Use a sucrose gradient of 10%, 15% and 20% (24 hr in each solution) to prevent tissue damage due to osmotic pressure. Store frozen brains at -80 °C and cut on a cryostat at 10-14 µm thick sections.\n6. Co-staining with anti-GFP",
    "NOTE: If antigen retrieval is necessary in order to co-stain with anti-GFP, it is important to use a gentle antigen retrieval protocol that does not compromise the GFP signal. Some antigen retrieval protocols are too harsh to use in conjunction with GFP staining (even with an antibody against GFP). A basic citric acid pre-treatment prior to application of the primary antibody is successful for most epitopes 24.\nMake a 0.01 M solution of citric acid in ddH2O. pH to 6 using a calibrated pH meter.\nHeat citric acid in staining chamber in microwave or water bath until citric acids reaches 75-80 °C. Put slides in staining chamber for 10-15 min. Maintain temperature as stable as possible.\nWash slides in PBS 3x for 3 min at room temperature. Apply the primary antibody and proceed with immunostaining according to a standard protocol.\nValidate Cre mediated excision by co-labelling for GFP and the gene of interest to confirm knock down (Figure 3A).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}