{
  "id": 11201,
  "origin_website": "Jove",
  "title": "Non-contact, Label-free Monitoring of Cells and Extracellular Matrix using Raman Spectroscopy",
  "procedures": [
    "1. Preparation of the Biological Sample\nPreparation of living cells\n\t\nPreparation of adherent cells\n\t\t\nSeed in vitro-cultured or freshly isolated cells on a glass bottom dish (Greiner BioOne/Germany) and incubate them at 37 °C and 5% CO2 until cell attachment is completed.\nRemove culture medium and wash gently three times with PBS prior measurement. Keep the cells covered with either PBS or cell culture medium throughout the whole measurement procedure.\nPreparation of cells in suspension\n\t\t\nDetach in vitro-cultured cells according to common protocols (e.g. trypsin-EDTA, cell scraping), centrifuge the cells and re-suspend the obtained cell pellet in PBS or cell culture medium.\nTransfer 100 μl of the cell suspension (concentration: max. 100,000 cells/ml) to a glass bottom dish.\nPreparation of native tissues\n\t\nAfter harvesting the tissues, transfer them to sterile, ice-cold PBS and keep them no longer than 12 hours at 4 °C or on ice prior measurement. Previous experiments have shown that a prolonged storage time (cold ischemia time > 12 hours at 4 °C) resulted in spectral changes due to natural degradation processes.\nMeasurements must be performed with the tissue covered in PBS or medium to avoid damage of the ECM proteins and cells due to tissue drying.\n2. Raman Spectrometer\nOur customized Raman spectrometer combines a standard fluorescence microscope (Olympus IX 71) with a Raman spectrometer that allows the direct comparison of bright-field and fluorescence images with the Raman spectra. The basic set up consists of a 784 nm diode laser (Toptica photonics AG/Germany), a notch filter for the separation of the Raman-scattered light from the excitation light, a microscope and a spectrograph (Kaiser Optical Systems Inc., Ann Arbor/USA) with a charge coupled device (CCD camera) optimized for the detection of spectral information (F-view from Soft Imaging Systems/Germany).\n3. Control of Laser Function",
    "Start the software Andor Solis (Andor/United Kingdom) and set the temperature of the CCD camera to -60 °C to minimize the noise caused by thermally induced currents in the camera.\nPlace a silicon wafer on the microscope stage for the calibration procedure.\nTurn the laser on and set the power to 85 mW.\nUse the software Cell B (Olympus/Germany) to focus the laser onto the wafer until XY appears.\nMeasure the silicon wafer with a single integration time of 1 sec using a 60x air objective.\nChange the unit of the x-axis from pixel number to Raman shift (cm-1) in the Andor Solis software.\nVary the laser focus of the silicon peak at 520 cm-1 in the collected spectrum in order to find the maximum possible intensity for this Raman band. The minimum amount of counts must be higher than 11,000 to have a successful calibration.\n4. Raman Spectroscopic Measurements\nAll measurements are performed at room temperature.\nBasic settings\n\t\nUse a 60x water immersion objective (Olympus/Germany) with a numerical aperture of 1.2 to collect the spectrum of the samples.\nChange the acquisition settings to 10 integrations/ 10 seconds for a total of 100 seconds per measurements.\nMeasurement of adherent cells\n\t\nTake the glass bottom dish with the cells and place it on the microscope stage.\nIn order to obtain a better signal and ensure reproducibility, focus the laser on the cell nucleus, turn the microscope light off and start collecting the spectrum.\nMeasure a reference spectrum of the background every 10 spectra by moving the laser focus beside the cell. It is important to consider that when changing the focus a new background must be collected for each focus depth.\nMeasurement of cells in suspension",
    "Transfer 100 μl of the cell suspension into the glass bottom dish and place it onto the microscope stage.\nFocus the laser on the center of the cell, turn the microscope light off and start collecting the spectrum.\nMeasure a reference spectrum of the background every 10 spectra by moving the laser focus beside the cell. When changing the focus, a new background must be collected for the new focus depth.\nMeasurement of native tissues\n\t\nTake the sample and place it into a glass bottom dish. The region of interest (ROI) should be oriented facing the bottom of the dish.\nFill the dish with enough PBS to cover the sample.\nPlace a cover glass over the sample to avoid any movement of the sample during measurements.\nSet the laser focus into the structure of interest (depth resolution is laser- and tissue-dependent) and start collecting the spectra.\nCollect a reference spectrum of the background every 10 spectra by moving the laser focus out of the whole tissue area. When changing the focus, a new background must be collected for the new focus depth.\nMeasurement of immunofluorescence (IF)-labeled cryosections\n\t\nSection fresh, snap-frozen tissue samples using a standard cryotom and mount them on silica-coated cover glasses.\nStain the cryosections following a routine protocol for IF, employing only a short fixation step (max. 10 minutes with 4% paraformaldehyde) and using appropriate antibodies for the detection of the protein of interest.\nPerform Raman measurements focusing in the area where fluorescence occurs.\nElastin degradation experiments\n\t\nPlace the ventricularis of the dissected porcine aortic valve leaflets (elastin-rich, blood inflow-side layer of the heart valve leaflet) facing to the bottom of the glass bottom dish.\nMeasure the native tissue as a 'non-incubated control' at 30 random points across the whole tissue surface focusing in the fibrillar structures.",
    "Divide the sample into 3 sections and place them into separate 2.5 ml Eppendorf tubes filled with 2 ml of an elastase solution (5 U/ ml, Worthington/Germany).\nIncubate the tissue for either 15 or 30 minutes at 37 °C.\nAfter incubation for either 15 or 30 minutes, remove the tissues from the Eppendorf tube and wash carefully with PBS in order to completely stop the enzymatic reaction.\nMeasure each sample at 30 random points, focusing in the fibrillar structures.\n5. Data Processing and Analysis\nRaman spectra processing\n\tThe pre-treatment of the generated spectra was performed using OPUS software (Bruker Optik GmbH/Germany).\n\t\nIn order to reduce interfering signals from the glass and medium as well as to avoid variations caused by changes in the focus during measurements, subtract the corresponding background spectrum from the collected spectra.\nReduce the spectra to the wavenumber region between 400-1800 cm-1, which offers the highest amount of information.\nIf needed, normalize the spectra to the maximum peak. Normalization factors out the intensity fluctuations and systematic failures, simplifying the detection of structural changes in the sample spectra.\nPerform a baseline correction to increase the comparability between different experiments.\nRaman spectra analysis",
    "The Raman spectra were analyzed using PCA with The Unscrambler (CAMO/ Norway) software. This multivariate analysis detects differences and similarities within the spectral data sets. Every spectrum is plotted as a single point in a multidimensional space based on the collected counts for every Raman shift. Each principle component (PC) describes a certain quantity of the total information contained in the original data. The first PC is the one that contains the highest source of variation. Each following PC contains, in order, less information than the previous one. Every variable has a score and a loading on each PC. By plotting PCs (=scores), important sample correlations can be exposed. The loadings describe the contribution of each analyzed variable to the PCA.\n\t\nLabel each group of measurements by creating row ranges for every sample group.\nUse the following basic settings for the PCA: cross validation, the NIPALS algorithm, no rotation and start the analysis. These settings are spectra dependent.\nPerform the PCA.\n6. Representative Results\nRaman spectra generated from adherent cells often reveal a low signal-to-noise ratio and a low overall signal intensity (Fig. 1).11 Due to the fact that the laser focus has to be set near the glass bottom, the influence of the interfering glass signal is rather high, causing masking of the actual sample signal. Consequently, the sample signal might be minimized or even eliminated during a subsequent background subtraction. Thus, we prefer to use cells in suspension for our Raman spectroscopic analysis, as they allow the detection of more detailed spectral information. However, the spectra of adherent and suspension cells exhibit the same main peaks differing only in their intensities.",
    "For the characterization of different cell types within a suspension, no pre-treatment is required. The mean Raman spectra and standard deviations of human fibroblasts, mesenchymal stem cells (MSCs), chondrocytes and keratinocytes measured in suspension are depicted in Figure 2. All Raman spectra are similarly structured, with peaks originating from typical biomolecules such as proteins, nucleic acids and lipids (see Table 1).12 For these cell types, the spectral region between 600 and 1800 cm-1 contains most relevant spectral information, by which clear differences are detectable between the different cell types (Fig. 2A). Exemplary, we highlighted one spectral region (1280-1350 cm-1) displaying clear structural differences, which is assignable to molecular vibrations of collagen and lipids. In contrast, morphological analyses are not suitable for the identification and distinction of most cells (Fig. 2B-I). While the difference between chondrocytes and skin cells is observable (Fig. 2D,H versus B,F and E,I), fibroblasts and MSCs are difficult to separate using solely bright-field micrsocopy (Fig. 2B,F versus C,G).13",
    "Raman spectroscopic analysis of native tissue, particularly of ECM proteins, requires that a ROI can be visualized by bright-field imaging in order to be able to focus on the respective structure. For the assignment of a protein to a specific fingerprint spectrum, we generated Raman spectra of commercially available pure proteins and immunohistologically stained cryosections. Here, we identified the fingerprint spectra of elastic fibers within native tissues comparing lyophilized elastin and immunofluorescence-stained cryosections employing an antibody against elastin. However, since elastin features a high autofluorescence, which is reflected in the Raman spectra, the data analysis is challenging (Fig. 3A). To reduce the systematic failure due to sample-specific properties such as autofluorescence, an appropriate processing of the data sets is crucial. In our data analyses, we used normalization to eliminate the significantly higher signal intensity of the pure elastin protein, and thus, we were able to generate comparable Raman spectra (Fig. 3B). Elastin is one of the most stable ECM proteins in the body and is therefore very difficult to degrade.14 In our experimental set up, we induced elastin degradation in healthy porcine aortic valve leaflets by performing an enzymatic digestion. Applying the multivariate analysis PCA, we identified significant differences between the Raman spectra of enzymatically-treated samples and native controls (Fig. 3C). These spectral differences were observed in the loading spectrum at 861, 1003 and 1664 cm-1. Expected structural changes in the elastin-containing fibers due to extended exposure times to elastase were shown by HART's staining (Fig. 4), which were also reflected in more distinct separable score clusters (Fig. 3C).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3977/3977fig1.jpg\nFigure 1. Mean Raman spectra of detached and adherent fibroblasts.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3977/3977fig2.jpg",
    "Figure 2. (A) Mean Raman spectra and standard deviations of four different primary isolated cell types (fibroblasts, MSCs, chondrocytes and keratinocytes). The frame highlights the spectral region of 1280 - 1350 cm-1 with structural differences. (B-E) Bright-field images of detached (B) fibroblasts, (C) MSCs, (D) chondrocytes and (E) keratinocytes. Scale bar equals 20 μm. (F-I) Bright-field images of adherent (F) fibroblasts, (G) MSCs, (H) chondrocytes and (I) keratinocytes. Scale bar equals 200 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3977/3977fig3.jpg\nFigure 3. (A) Raman spectra without normalization of lyophilized elastin (blue line), immunofluorescence (IF)-labeled cryosections (orange line) and elastic fibers (red line) measured within native aortic valve leaflets. The high signal intensity of lyophilized elastin is caused by autofluorescence. (B) Raman spectra after normalization in order to eliminate systemic failures. (C) Scores and loadings of the comparison between non-treated control (red) and enzymatically-degraded (blue and green) elastic fibers within the native tissue.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3977/3977fig4.jpg\nFigure 4. HART's-stained porcine aortic valve leaflets. Elastic fibers are visualized in black. (A) and (B) show non-treated control and (C) and (D) depict tissue samples that were exposed to the elastin-degrading enzyme elastase for 30 minute.\ntable:\n﻿0,1,2\nWavenumber in cm-1,Assignment12,Assignment12\n717-719,C-N,Phospholipids\n785-788,\"DNA/RNA bases,  O-P-O backbone\",DNA/RNA\n1003- 1005,Phenylalanine,Protein\n1220-1280,Amide III,Protein\n1445-1447,CH2,Protein/Lipid\n1655-1680,Amide I C=C,Protein Lipid\nTable 1.  Raman bands that are detected within spectra of all cell types (fibroblasts, MSCs, chondrocytes and keratinocytes)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}