{
  "id": 6479,
  "origin_website": "Bio",
  "title": "A Flow Cytometric Method to Determine Transfection Efficiency",
  "procedures": [
    "Plasmid labelingExtract pNL4-3 and pUltraHot encoding mCherry for transfection from Stbl3TM (Thermo Fisher, Waltham, MA) or Stellar (Clontech, Mountain View, CA) bacteria using the PureLink HiPure Midiprep Kit (Thermo Fisher, Waltham, MA). Determine concentration and purity (260/280 ratio) of nucleic acid using spectrophotometry. Label Plasmid DNA with DNA Label IT® Tracker (Mirus, Madison, WI) the day before transfection using 0.5 μl FITC/1 μg DNA according to the manufacturer’s protocol. Remove unreacted Label IT® Tracker reagent using ethanol precipitation. According to the manufacturer, 1 μl of labeling dye per 1 μg plasmid DNA will yield labeling efficiencies of approximately one Label molecule every 40 base pairs (on average) of double-stranded DNA. Determine the purity and concentration of labeled DNA using spectrophotometry.Antibody conjugationConjugate Anti-HIV-1 p24 monoclonal antibody (71-31) with Mix-n-Stain CF647 dye, according to the manufacturer’s protocol. Conjugate Human IgG1 control with Mix-n-Stain CF647 dye according to the manufacturer’s protocol.Transfection of 293T cells with FITC labeled DNA by different transfection reagentsPlate 3 x 105 293T cells of < 20 passages into 12-well plates the day before transfection. At this density, cells are usually attached to the bottom of the well at a confluency of 70%-80% after 24 h.Twenty-four hours after seeding, transfect cells with FITC-labeled and unlabeled pNL4-3 or pUltraHot encoding mCherry. The transfections can be performed in 12-well plates using 1 μg plasmid DNA and 3 μl TransIT X2 in serum-free media, according to the manufacturer’s protocol.Culture cells in complete media after adding transfection complexes for 6 h. Then change medium to 10% FBS complete culturing medium.",
    "Note: For experiments comparing different transfection reagents, the cells can be transfected with 1 μg DNA per well with varying amounts of transfection reagents to facilitate the recommended ratio of transfection reagent to DNA for each reagent: 3 μl TransIT X2, 4 μl Lipofectamine 2000, 2 μl Jet Prime and 3 μl Fugene HD.  Harvest cells at 24 h post-transfection and wash one time in PBS.Note: For time course experiments, the cells can be transfected at the same time and harvested at 0, 6, 12, 24, 36, 48 and 72 h. Fix cells in 4% PFA for 15 min at room temperature.Permeabilize cells in 0.2% Tween/PBS for 15 min. Stain cells for HIV-1 p24 protein with 1 μg anti-p24 antibody conjugated to CF647 in 100 μl staining medium containing PBS/2% BSA for 30 min at 4 °C. Wash 293T cells once with PBS.Fix cells in 4% PFA for 15 min. Electroporation of Jurkat cells with FITC labeled pUltraHotWash Jurkat E6-1 cells 2 times in OptiMEM before resuspending cells in OptiMEM at 1 x 106 cells/100 μl. Transfer 1 x 106 cells into 4 mm cuvettes and add 4 μg of labeled or unlabeled pUltraHot plasmid to the suspension.Electroporate Jurkat E6-1 cells with a BioRad Gene Pulser Xcell electroporation system using exponential protocol with 250 voltage, 350 μF capacitance, 1,000 Resistance at room temperature.Transfer cells immediately into pre-warmed media and incubate cells for 24 h before staining for viability and Flow cytometric analysis. Collect Jurkat cells transfected with pUltraHot. Stain Jurkat cells with 1 μl Ghost Violet 450 Live/dead dye in 1 ml PBS incubate 30 min at room temperature. Wash Jurkat cells with 1% FBS in PBS. Fix Jurkat cells in 4% PFA for 15 min.",
    "Flow cytometry analysisAcquire samples on an LSRII Fortessa flow cytometer (BD Biosciences, San Jose, CA, USA) with BDFACSDiVaTM Software (BD Biosciences). The flow cytometer is equipped with 405, 488, 561 and 635 nm lasers, and emission filters for Pacific blue (LP: −, BP:450/50), Alexa fluor-488 (LP: 505, BP: 530/30), PE (LP: −, BP: 582/15), mCherry (LP: 600 BP: 610/20), PerCP-Cy5.5 (LP: 685, BP: 695/40), APC (LP: −, BP: 670/14). FITC fluorescence intensity (y-axis) is plotted on a log scale against the fluorescence intensity (x-axis) of fluorochrome that is used to quantify protein expression (e.g., mCherry) (Figure 2).The mean fluorescence intensity (MFIs) of FITC and Alexa Fluor® 647 can be further standardized using Quantum MESF (Molecules of Equivalent Soluble Fluorochrome) kits for Alexa Fluor® 488 and Alexa Fluor® 647 as previously described (Kapoor et al., 2009).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190516/20190516031253_9846.jpgFigure 2. Flow cytometric determination of transfection efficiency based on two independent readouts (DNA plasmid uptake and protein expression). Representative transfections are shown. 293T cells underwent chemical transfection using the TransITX2 transfection reagent as described in Procedure. The same amount (1 μg) of DNA was used for two independent plasmids: a small (B. pUltraHot expressing mCherry, 8.3 kb) and a large (C. pNL4-3 expressing p24, 14.0 kb) DNA plasmid. Gating strategy is shown: A) forward and side scatters B) discrimination of doublets C, D) two independent readouts of transfection efficiency. FITC fluorescence corresponds to the uptake of FITC-labeled plasmid DNA (y-axis). A fluorochrome that has no spectral overlap with FITC is used to quantify protein expression. Either a fluorescent protein can be used (e.g., mCherry; shown in C) or a protein labeled with a fluorescent-labeled antibody (e.g., intracellular expression of HIV-1 p24 protein was detected by a CF647-labeled anti-p24 antibody; shown in D).",
    "Co-expression of DNA taken up by cells and target protein were analyzed 24 h after transfection. The numbers in the quadrants indicate the percentages of viable cells that took up the FITC labeled DNA plasmid versus the expressed protein that was detected. The following dot plots are shown for each chemical transfection in 293T cells: i) untransfected cells (negative control), ii) cells transfected with FITC-labeled DNA plasmid harvested before protein expression occurred (3 h post transfection), iii) cells transfected with unlabeled plasmid harvested 24 h after transfection (when protein expression can be quantified) iv) cells transfected with FITC-labeled DNA plasmid and harvested 24 h after transfection (when protein expression can be quantified). In this plot Q3 quadrant demonstrates many cells that express protein but do not show any fluorescence associated with uptake of the plasmid DNA. Either Q1+Q2 (DNA signal) or Q2+Q3 (protein signal) should be used as readouts of transfection efficiency. E. Transfection efficiency was quantified in human lymphocytes (Jurkat E6 cells) harvested 24 h after electroporation with FITC-labeled DNA mCherry plasmid without the need to use co-transfection of 2 different plasmids and GFP reporter."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}