{
  "id": 13339,
  "origin_website": "Jove",
  "title": "Wholemount In Situ Hybridization for Astyanax Embryos",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Cincinnati (Protocol #10-01-21-01).\n1. Fixation\nIsolate desired number of Astyanax mexicanus embryos from a breeding tank and fix ~50 embryos at a time. If embryos are large and old, it may be necessary to fix 25 at a time to ensure even fixation.\nDepending on the age of the embryo, utilize the IACUC-approved method of anesthesia. For older embryos with a functioning nervous system, sacrifice embryos via anesthetic overdose. Accordingly, place embryos in a solution of ~1% tricaine (buffered to pH 7.4) to minimize pain and discomfort for the organism.\nOnce the embryos are unresponsive to touch, replace system water containing tricaine, and add ~1 mL of 1x phosphate-buffered saline (PBS, pH 7.4).\nRemove the PBS solution, and add 1 mL of 4% paraformaldehyde (PFA). Fix embryos overnight at 4 °C.\n\tCAUTION: PFA is hazardous (i.e., it is flammable and is a skin and lung irritant), handle with care.\n2. Dehydration\nTo dehydrate the embryos, remove the fixative solution and rinse with 1 mL of PBS. Place embryo-containing vials at an angle (between 30° and 45°), on a platform shaker during rinse. Continue to wash the embryos twice, 5 min per wash.\nIf embryos still have a chorion, place all 50 embryos into a 100 mm x 25 mm Petri dish, and carefully isolate them from the chorions using two sets of Watchmaker’s forceps (e.g., #5 forceps) under a microscope.\n\tNOTE: During the steps described below, and for the remainder of the protocol, carefully remove all liquid from the previous step using clean, glass Pasteur pipettes before adding the next solution",
    "Dehydrate the embryos in a series of increasingly concentrated washes of methanol (MeOH) described below. The dilutions are based on a 1 mL total volume with 500 µL of solution going into each 4 mL glass vial. Perform all dehydration steps at room temperature (RT) on platform shaker.\n\t\nCarefully remove the PBS solution. Add a 25% MeOH solution (250 µL of MeOH + 750 µL of PBS). Gently shake on a platform shaker for 5 min.\nCarefully remove the 25% MeOH solution. Add a 50% MeOH solution (500 µL of MeOH + 500 µL of PBS). Gently shake on a platform shaker for 5 min.\nCarefully remove the 50% MeOH solution. Add a 75% MeOH solution (750 µL of MeOH + 250 µL of PBS). Gently shake on a platform shaker for 5 minutes.\nCarefully remove the 75% MeOH solution. Add a 100% MeOH solution (1 mL of MeOH). Gently shake on a platform shaker for 5 min. Repeat this step 3 times.\nAt this point, store dehydrated embryos, as needed, in their glass vials at -20 °C (long term). Alternatively, proceed directly to day 1 of the protocol.\n3. Day 1: Rehydration\nObtain dehydrated embryos from -20 °C freezer (or proceed directly from step 2.5).\nSort the embryos using a Pasteur pipette. One can sort based on morphotype (i.e., cave and/or surface), and the number of genes assessed in each experiment. There are usually no more than 12 embryos per vial once sorted. To maintain organization, use colored lab tape to designate vials and pipettes for each gene. Embryos will stay in the same vial throughout the entire protocol.\n\tNOTE: Place the tip of the Pasteur pipette in 100% EtOH to sterilize it between uses.",
    "Set a shaking water bath to 70 °C to be used in a later step. Carefully, draw out the MeOH in vials of sorted embryos and replace with 500 µL of new 100% MeOH. Wash briefly (~1 min) on platform shaker.\nRehydrate embryos in an increasing concentration of 1x PBS with Tween 20 (PBT, see below) on platform shaker. The dilutions are based on a 1 mL final dilution volume with 500 µL going into each vial.\n\t\nAdd a 25% PBT solution (250 µL of PBT, 750 µL of MeOH). Gently shake on a platform shaker for 5 min.\nCarefully remove the 25% PBT solution. Add a 50% PBT solution (500 µL of PBT, 500 µL of MeOH). Gently shake on a platform shaker for 5 min.\nCarefully remove the 50% PBT solution. Add a 75% PBT solution (750 µL of PBT, 250 µL of MeOH). Gently shake on a platform shaker for 5 min.\nCarefully remove the 75% PBT solution. Add a 100% PBT solution (1 mL of PBT). Gently shake on a platform shaker for 5 min. Repeat this step 3 times.\n4. Day 1: Digestion and fixation\nPrepare a proteinase K (PK) solution by adding 1 µL of PK (20 mg/mL) to 2 mL of PBT.\nIn anticipation of subsequent steps, obtain frozen aliquots of hybridization buffers (Hyb- and Hyb+; see Supplemental File 2 and Supplemental File 3) and PFA from -20 °C storage.\n\t\nAllow PFA to thaw at RT.\nPlace aliquots of Hyb- and Hyb+ in a rotating 70 °C water bath. Place all reagents and vials inside a small “gasket” with a mesh bottom, inside the floating water bath apparatus. This enables simple addition and removal of tubes and vials from the rotating 70 °C water bath.",
    "Gently add PK solution to the vial(s) of embryos ensuring all tissues are completely covered with solution. Digest embryos for ~12 min in PK working solution on the platform shaker.\n\tNOTE: The length of digestion can be varied by the investigator to ensure optimal results.\nGently draw off the PK solution, and briefly flood the vial with PBT to dilute any remaining PK.\nDraw off the PBT solution and replace with 500 µL of new PBT. Allow the solution to rinse on the platform shaker for 5 min.\nDraw off PBT and replace with 500 µL of thawed 4% PFA. Allow the embryos to incubate for 20 min on the platform shaker at RT.\nDraw off the 4% PFA, and briefly flood the vial with PBT to dilute any remaining PFA. Draw off the PBT, and replace with 500 µL of fresh PBT. Allow embryos to rinse for 5 min on the platform shaker. Repeat this step 4 more times.\n5. Day 1: Prehybridization\nPlace 500 µL of pre-warmed Hyb- solution into the vial. Carefully place the vial in the 70 °C water bath (inside gaskets) without shaking, for 5 min.\nDraw off the Hyb- solution and flood the vial with 500 µL of pre-warmed Hyb+ solution. Place the vial back into the 70 °C water bath with shaking (40 rpm). Incubate for either 4 h, or overnight.\n\tNOTE: A 4 h incubation will yield a complete in situ protocol that will last for 4 days in total. Here, this step is presented as an overnight incubation, which will yield a protocol lasting 5 days in total.\n6. Day 2: Hybridization\nPlace an aliquot of Hyb+ from the -20 °C freezer into the shaking hot water bath for 5 min.",
    "Draw off the Hyb+ from the vial and replace with 500 µL of pre-warmed Hyb+. To this solution, carefully add 2 µL of RNA probe to each vial. Gently swirl the vial to ensure even distribution of the probe.\nIncubate the Hyb+ (with added probe) solution in the 70 °C hot water bath overnight while shaking at 40 rpm.\n\tNOTE: One can re-use Hyb+ (with probe) solution. For this, take Hyb+ with probe from the first run from the -20 °C freezer and place it in a hot water bath for 5 min. Replace Hyb+ from the day 1 protocol with Hyb+ with probe and allow incubating overnight in hot water bath.\n7. Day 3: Solution preparation\nPrepare microcentrifuge tubes labeled Hyb+ with the “gene-of-interest” RNA probe. Prepare the series of dilutions that will be used during day 3.\n\t\nUsing 6 separate tubes, prepare the following series of dilutions of Hyb- and saline sodium citrate (SSC, 0 to 100%) in a 1 mL volume, and place them in the 70 °C shaking water bath: Tube 1 = 100% Hyb- (1 mL of Hyb-): Tube 2 = 25% 2x SSC (250 µL of 2x SSC, 750 µL of Hyb-); Tube 3 = 50% 2x SSC (500 µL of 2x SSC, 500 µL of Hyb-); Tube 4 = 75% 2x SSC (750 µL of 2x SSC, 250 µL of Hyb-); Tube 5 = 100% 2x SSC (1 mL of 2x SSC); Tube 6 = 100% 0.2x SSC (2 mL of 0.2x SSC).\n\t\tNOTE: Be vigilant of the concentration of SSC, as it changes from 2x to 0.2x.",
    "Using 4 separate tubes, prepare the following series of dilutions of PBT and SSC in a 1 mL volume, and place at RT: Tube 1 = 25% PBT (250 µL of PBT, 750 µL of 0.2x SSC); Tube 2 = 50% PBT (500 µL of PBT, 500 µL of 0.2x SSC); Tube 3 = 75% PBT (750 µL of PBT, 250 µL of 0.2x SSC); Tube 4 = 100% PBT (1mL of PBT).\nPrepare a tube with 2 mL of maleic acid buffer containing Tween 20 (MABT) working solution.\nPrepare two 15 mL conical tubes of blocking solution. In each tube, add 0.2 g of blocking reagent to 10 mL of MABT (see Supplemental File 4). Place both tubes on a nutating mixer (or platform shaker) until completely dissolved in solution (up to 3 h).\n8. Day 3: Probe removal\nDraw off Hyb+ (with probe) solution with a glass Pasteur pipette and place it into a sterile, labeled microcentrifuge tube. Retain this tube in the -20 °C freezer for future use (if probe-labeling is successful).\nCarefully add 500 µL of the warm SSC/Hyb- dilutions (indicated below). Incubate in each of the following solutions for 10 min each in the 70 °C shaking water bath.\n\t\nIncubate sequentially with 100% Hyb- (1 mL of Hyb-), 25% 2x SSC (250 µL of 2x SSC, 750 µL of Hyb-), 50% 2x SSC (500 µL of 2x SSC, 500 µL of Hyb-), 75% 2x SSC (750 µL of 2x SSC, 250 µL of Hyb-), 100% 2x SSC (1 mL of 2x SSC), 100% 0.2x SSC (2 mL of 0.2x SSC).",
    "Following the last step, incubate in each of the following solutions for 10 min each. All of the following incubations take place at RT on the platform shaker: 25% PBT (250 µL of PBT, 750 µL of 0.2x SSC), 50% PBT (500 µL of PBT, 500 µL of 0.2x SSC), 75% PBT (750 µL of PBT, 250 µL of 0.2x SSC), 100% PBT (1 mL of PBT).\nAfter a 10 min incubation, remove the 100% PBT, and add 500 µL of MABT into each vial. Repeat this step twice for 5 min.\n9. Day 3: Blocking\nRemove MABT from each vial and flood with premixed blocking solution from one of the tubes (prepared in step 7.1.4). Place vial on a nutating mixer for ~4 h at RT.\nAdd 2 µL of Anti-DIG-AP Fab fragments to the second vial of 10 mL blocking solution (prepared in step 7.1.4) and briefly vortex.\nFill each vial almost completely with blocking solution (~5 mL) and place on nutating mixer overnight in a refrigerator at 4 °C.\n10. Day 4: MABT Rinses\nPrepare a stock vial of 10% normal goat serum (NGS) in MABT (add 100 µL of NGS to 900 µL of MABT).\nDraw off the blocking solution in each vial and add 500 µL of NGS/MABT mixture into each vial. Allow the embryos to incubate for 25 min at RT on the platform shaker.\nReplace the NGS/MABT mixture with 500 µL of 100% MABT. Incubate for 30 min at RT on the platform shaker. Perform this rinse 11 more times throughout the day every 30 min.\nFill the vial with 100% MABT, and place on a nutating mixer overnight in a refrigerator or walk-in chamber at 4 °C.\n11. Day 5: Probe visualization",
    "Prepare a 50 mL aliquot of alkaline phosphatase (AP) buffer (see Supplemental File 5). Combine the following in a 50 mL conical tube wrapped in aluminum foil to limit light exposure: 5 mL of 1 M Tris (pH 9.5), 5 mL of 50 mM MgCl2, 5 mL of 1% Tween 20, 5 mL of 1 M NaCl, 30 mL of ddH2O.\nRemove MABT and replace with 1 mL of AP buffer (tube wrapped in foil). Let it wash for 5 min. Do this twice to ensure complete removal of MABT.\nRemove AP buffer and replace with 1 mL of AP buffer with 3.5 μL 5-bromo-4-chloro-3'-indolyphosphate (BCIP) and 4.5 μL of nitro-blue tetrazolium (NBT). Replace with freshly prepared AP buffer/NBT/BCIP once every hour until reaction is complete. Monitor closely, checking every 15 min, to allow the coloration reaction to take place until the desired level of staining has been achieved. If precipitate begins to form, replace the solution sooner.\nStop the coloration reaction by rinsing the embryos in fresh 100% AP buffer (without NBT/BCIP) for 5 min. Continue rinses in PBT until optimal levels of signal (with minimal amounts of background staining) are achieved. Continue to rinse specimens with increasing dilutions of PBT in AP Buffer as follows: 25% PBT (250 μL of PBT, 750 μL of AP Buffer), rinse for 5 min; 50% PBT (500 μL of PBT, 500 μL of AP Buffer), rinse for 5 min; 75% PBT (750 μL of PBT, 250 μL of AP buffer), rinse for 5 min.\nRinse embryos in ~5 mL of 100% PBT on nutating mixer until desired minimum background staining is reached. Switch out with fresh PBT several times. This could take up to several days.",
    "When rinsing is complete, wash embryos in 500 μL of sterile PBS on a platform shaker. Perform this rinse twice for 5 min. After PBS washes, post-fix the specimens in 500 μL of 4% PFA for 1 h at RT on a platform shaker. Alternatively, fix overnight in 1 mL of 4% PFA in the refrigerator at 4 °C.\nReplace the fixative with fresh, sterile PBS. Perform this rinse at least twice for 5 min. Place the embryos in ~4 mL of 100% sterile PBS, and store long term at 4 °C.\n12. Imaging\nMake up an imaging plate in a Petri dish using 3% agarose and TAE buffer.\n\tNOTE: Quantities depend on how many plates are needed. Plates can be reused several times. It is recommended that a shallow rectangular mold is placed in the Petri dish while the gel is cooling in order to create a depression for containing the embryos on the plate.\nPlace the embryos on the plate in the PBS.\n\tNOTE: It is best to gently pour embryos onto the plate instead of pipetting them out because it has been found that they will stick to the inside of plastic pipettes.\nUse light microscopy in order to visualize each embryo. Use a blunt probe to maneuver embryos to desired position.\nTake an image when the embryo is in desired position. Note that it is important to take images of embryos within a couple weeks of completed staining to avoid potential degradation of stain.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}