{
  "id": 11967,
  "origin_website": "Jove",
  "title": "Using Computer-based Image Analysis to Improve Quantification of Lung Metastasis in the 4T1 Breast Cancer Model",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of Virginia Tech and in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals. Performing this protocol requires permission from the appropriate institutions and adherence to all appropriate guidelines.\n1. Cell Culture\nMake complete culture media (RPMI + 10% Fetal Bovine Serum +1% Pen Strep). Revive 4T1 cells according to ATCC Protocol10 and incubate at 37 °C and 5% CO2 in a T-25 flask until confluent. Change media the day after reviving to remove dead cells, and again if media is spent before cells are confluent enough to passage.\nOnce the T-25 flask is confluent, passage cells to a T-75 flask by discarding media, washing flask with 5 mL of 1x Dulbecco’s Phosphate Buffered Saline (DPBS), and adding 500 μL of Trypsin-EDTA. Incubate for 5-10 minutes at 37 °C until cells detach.\n\t\nOnce detached, add 5 mL of warmed complete culture media to cells. Aspirate and transfer the 5 mL to a T-75 flask containing 15 mL of warmed complete culture media.\nPassage cells in T-75 flasks at least four times. Do this once the flask is confluent by washing with 8 mL of 1x DPBS, adding 1 mL of Trypsin-EDTA for detaching cells, adding 10 mL of warmed media to cells, and diluting 1:6-1:8 into a new T-75 flask containing 20 mL of warmed complete culture media.\nPassage cells up to the appropriate number of T-150 flasks containing 40 mL of warmed complete culture media for the number of mice to be injected. Most studies will require multiple T-150 flasks to ensure enough cells for injection.",
    "When mice are ready to be injected (8 weeks old or weighing over 20 g, depending on the IACUC or institutional protocols), harvest cells by discarding media, washing each flask with 10 mL of 1x DPBS and adding 2 mL of trypsin-EDTA. Incubate for 5-10 minutes at 37 °C until cells detach.\nWash flask with 10 mL of complete media and transfer all contents (10 mL of media + 2 mL of trypsin-EDTA cell mixture) to the next flask. Continue to wash and collect cells from each flask using the same 10 mL of media to avoid using an excessive amount of media.\n\t\nOnce all flasks have been collected, transfer the contents into a 50 mL centrifuge tube. Collect a 10 μL sample for counting in a microcentrifuge tube and centrifuge the 50 mL conical tube at 125 x g for 5 minutes.\nWhile cells are being centrifuged, add 10 μL of Trypan blue to 10 μL of cell sample. Count cells using a hemocytometer. Once the total number of cells is determined, calculate the concentration of cells needed to inject mice for 1.2 x 106 cells per mouse (per 100 μL).\nAfter centrifugation, decant media and resuspend cell pellet in correct amount of sterile 1x DPBS for 1.2 x 106 cells per 100 μL. Split cell/DPBS mixture into microcentrifuge tubes for easy access with the syringe when aspirating cells for injection. Keep cells on ice and inject soon thereafter as cells will begin to die after being on ice for extended periods of time.\n2. Injections",
    "Prepare cells for injection by tapping or gently mixing the microcentrifuge tube to resuspend the cells, and then aspirate 600 μL into a 1 mL syringe. Turn the syringe upwards and pull the plunger down to bring cells away from the syringe opening. Tap the syringe to rid it of air bubbles.\nAttach the needle bevel up and dispense cells back into the microcentrifuge tube until only 500 μL remain in the syringe. Put syringe flat on ice.\n\tNOTE: 4T1 cells fall out of suspension quickly. Therefore, it is important to mix cells back into suspension by tapping frequently.\nAnesthetize 8 week old/>20 g female BALB/c mouse using isoflurane or other approved anesthetic agent. Monitor the mouse’s breathing to assess depth of anesthesia.\nOnce the mouse is properly anesthetized as indicated by lack of corneal reflex, place the mouse on its back. Using the thumb, pointer, and middle finger, gently hold down the mouse. Use the pointer and middle fingers to hold down the mouse’s upper body and thumb for its rear left leg. Be gentle but firm.\nWith the bevel of the needle up, inject 100 μL of cells subcutaneously into the mouse’s left abdominal mammary fat pad. Monitor for a good bleb and any leakage, and ensure the mouse wakes up and moves easily after injection.\n\t\nChange needles between each mouse.\n\t\tNOTE: Do not allow needle to enter the peritoneal cavity. This would cause the cancer to spread quickly and not be representative of the model. To ensure a subcutaneous injection, gently pull upwards on the needle when inserted in the left abdominal mammary fat pad. If the needle is easily lifted upwards, it is correctly positioned subcutaneously.\n3. Monitoring",
    "Monitor mice at least 3 times a week for weight, body condition score, tumor size, tumor condition, respiration, activity level, appearance, and movement. Once the tumor reaches 0.7-0.8 cm in diameter, begin to monitor daily.\n\t\nConsider euthanasia when tumor size reaches 1.5 cm, or weight loss reaches 20%, or severe clinical decline in body condition score, tumor condition, respiration, activity level, appearance, or movement are observed based on institutional guidelines.\n\t\tNOTE: Body condition score is crucial to monitor as body weight may increase as the tumor increases in size, negating body condition loss due to disease burden. Exact monitoring protocols will depend on the approved IACUC or institutional protocols.\n4. Necropsy\nEuthanize mouse using CO2 following institutional guidelines.\nSpray mouse with 70% ethanol to disinfect. Make an incision up the ventral midline of the mouse to expose the body cavity.\nRemove the kidney. Continue cutting up the midline until the diaphragm is visible. Use scissors to puncture the diaphragm to deflate the lungs. Trim the diaphragm to get better access to the cavity.\nUse blunt scissors to cut up the center of the ribcage. Pin ribcage back to expose the lung and heart.\nPerfuse the heart with 2 mL of non-sterile 1x DPBS by inserting a needle into the apex of the heart until it pools in the abdominal cavity where the kidney was removed.\nTo remove the heart and lungs, use blunt scissors to cut the esophagus and trachea directly above the heart. Using forceps, begin to pull the heart away from the body and cut away at any connective tissue keeping it attached. The lungs will come out with the heart.\nIdentify the multi-lobed (right) and single-lobed (left) lungs. Keep heart attached for reference, but once lungs are identified, cut the heart away.",
    "Label a 12 well plate containing 1x Hank’s Balanced Saline Solution (HBSS) in each well. Each mouse needs 2 wells. Place the multi-lobed (right) lung in the 12 well plate for metastasis evaluation and keep on ice. Keep the neighboring well empty for now.\n\tNOTE: It is important to use the same lung (multi-lobed) from every mouse to ensure each sample is close in size. The single-lobed lung can then be used for other analysis, like histopathology.\n\tNOTE: Samples are stable on ice or at 4 °C for a few hours.\n5. Processing Tissues\nNOTE: All steps in this section should be done using sterile technique.\nLabel 1 15 mL conical tube per mouse and add 2.5 mL of type IV collagenase mixture and 30 units of elastase to each tube. To make type IV collagenase mixture, dissolve 2 mg of type IV collagenase per mL 1x HBSS and sterile filter. This can be stored up to 12 months at -20 °C and thawed when needed.\nTransfer the lung to the second, clean 1x HBSS well for that sample. Swirl using forceps to remove any remaining blood. Transfer clean lung to empty 3.5 cm tissue culture plate. Mince lung with scissors. Rinse plate with 2.5 mL of 1x HBSS, transfer 1x HBSS and lung pieces into a 15 mL conical tube already containing collagenase/elastase cocktail (5 mL total).\nIncubate for 75 minutes at 4 °C. Continue mixing samples during this time, so place tubes on a rocker or rotating wheel. During this incubation step, label 50 mL centrifuge tubes and 10 cm tissue culture plates for each mouse. If doing a dilution, label enough 10 cm tissue culture plates for the dilutions.",
    "NOTE: Label the lid of the tissue culture plates. If labeling the plate itself, the writing will interfere with Fiji-ImageJ analysis.\nBring volume of each tube up to 10 mL total with 1x HBSS. Pour contents over a 70 μm cell strainer into a 50 mL conical tube for each sample. Use the plunger of a 1 mL syringe to gently grind the sample through the strainer to allow more cells to filter through.\nCentrifuge for 5 minutes at 350 x g at room temperature (RT). Discard the supernatant and wash pellet with 10 mL of 1x HBSS. Repeat this step twice.\nResuspend pellet in 10 mL of 60 μM 6TG complete culture media, either RPMI or IMDM. Plate samples in 10 cm cell culture plates, using a dilution scheme if desired. Incubate at 37 °C, 5% CO2 for 5 days.\n\tNOTE: 1:2, 1:10, and 1:100 are common dilutions that will need to be empirically determined based on study parameters.\n\tCAUTION: 6TG is toxic. Use caution when handling and follow all Environmental Health and Safety guidelines for disposal.\n6. Staining plates\nPour culture media off plates into appropriate waste container. Fix cells by adding 5 mL of undiluted methanol per plate and incubate for 5 minutes at RT, making sure to swirl methanol so that it covers the entire plate.\n\tCAUTION: Methanol is hazardous if ingested, inhaled, or is on skin. Use a fume hood for this step.\nPour methanol off plates into appropriate waste container. Rinse plates with 5 mL of distilled water per plate and pour water into appropriate waste container. Add 5 mL of 0.03% methylene blue per plate and incubate for 5 minutes at RT, making sure to swirl methylene blue solution so that it covers the entire plate.",
    "Pour methylene blue into appropriate waste container. Rinse plates again with 5 mL of distilled water per plate. Turn plates upside down and blot against a paper towel to remove excess liquid. Place plate on its lid and let air dry overnight at RT.\n\tNOTE: Metastatic colonies will be blue. Once plates are dried, they can be stored at RT indefinitely.\n7. Image analysis\nRemove labeled lids from plates, taking care to ensure clear identification of samples. Line up all stained lung plates on a clean, light surface to take a picture of all of the plates in one image.\nTake a picture of the collection of plates in a well-lit area, making sure to minimize reflections as the plates are very reflective. Reflections in the plates will influence image analysis and therefore need to be avoided.\n\tNOTE: Fiji-ImageJ has an upper limit of 2 gigapixels. Most modern smart phones will have sufficient cameras. Do not use a camera less than 8 megapixels. The camera used in this experiment was a 12.2 megapixel on a Google Pixel 2.\nCrop the image to include the plates, but exclude the lids or anything else in the background of the image. Upload the cropped image into Fiji-ImageJ.\nChange the image to black and white using the following commands: Image, Adjust, Color Threshold, Thresholding method: Default, Threshold color: B&W, Threshold space: Lab. Unselect the Dark background box. The image should now be black and white. Black represents the light background, and white represents the blue metastatic colonies.",
    "Using the Circle tool on the Fiji-ImageJ toolbar, select the area to be analyzed. Draw one circle to use for all of the plates to ensure each plate is analyzed for the same-sized area. Choose a size that maximizes analyzed area on the plates while minimizing the background noise that appears on the edge of the plates. The size appears in the toolbar as it is drawn, so it is possible to make a perfect circle by monitoring the height and the width as the circle is drawn.\nAnalyze the selected circle to determine what percentage of the area is white, which represents the area of the plate that has blue metastatic colonies. Use the following commands:\n\tAnalyze, Analyze Particles, Size (pixel2): 0-Infinity, Circularity: 0.00-1.00, Show: Nothing, and check the Summarize box. Hit OK.\nRecord the % Area result. This is the percentage of the selected area that is white, and therefore represents the metastatic burden.\n\tNOTE: It is recommended to either save the results in Fiji-ImageJ or copy/paste the entire results page into a separate document. If % Area results are unexpected or suspicious, it is then possible to see if any of the other measurements were also suspicious or if % Area was recorded incorrectly.\nMove the circle, without altering its size by grabbing it in its center, to the next plate in the picture. Repeat steps 7.6 and 7.7 for all plates in the picture.\nRepeat steps 7.1 – 7.8 on at least two more images. Once all plates and images have been analyzed, average the % Area results between different images for each plate to mitigate any inconsistencies between pictures.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}