{
  "id": 18915,
  "origin_website": "Jove",
  "title": "In vivo Macrophage Imaging Using MR Targeted Contrast Agent for Longitudinal Evaluation of Septic Arthritis",
  "procedures": [
    "All procedures involving animal subjects have been approved by the University Hospital Institutional Animal Care committee.\n1. Intraarticular Bacterial Inoculation\nBefore injection, anesthetize rabbits by means of intramuscular injection of ketamine (30 mg/kg of body weight) mixed with xylazine (4 mg/kg) within Erector Spinae muscle. Ensure animals are fully anesthetized by checking that they fail to respond to paw pinch. This protocol provides sufficient anesthesia for the intraarticular injection of the knee joint. Place the animals under oxygen mask during anesthesia.\nShave animals' knee. Prepare the knee for aseptic injection by 3 alternating wipes of povidone-iodine scrub and alcohol followed by application of povidone-iodine solution.\nManually identify the patellar tendon as an elastic structure at the anterior aspect of the knee using a sterile needle cap as shown or a sterile probe.\nWith visual control and by using an anterior approach, place a 25 G needle percutaneously in the right knee of each of the 12 rabbits through the patellar tendon.\nInject each knee with 1 ml of a bacterial suspension of Staphylococcus aureus (Neumann strain) at a concentration of 106 UFC/ml. An injection without resistance confirms the intraarticular location of the tip of the needle.\nAfter injection procedures, keep the animal under convective source to avoid heat loss and monitor respiratory rate by observing movement of the chest. Once awake, keep animals in cages with free access to food and water.\nManage pain by administering an intramuscular injection of 0.1 mg/kg buprenorphine every 8 hr.\nClinically observe rabbits each day, monitoring consumed quantities of food and water, weight loss, temperature, and general behavior.\nTo image the acute phase of infection perform the first MR imaging session as soon as an animal presents substantial weight loss (10%); generally this occurs after about 2 days.",
    "If intravenous drug administration is required before MRI examination, an auricular venous access could be installed (cf. below).\n2. MRI Examination\nWhen imaging live animals, a careful animal installation is a key feature to ensure animal comfort and optimal anesthesia. This will allow for best imaging results and ensure a reproductive image acquisition for longitudinal studies. Due to the size of the animal, the use of a clinical-sized MR unit (1.5 T or 3 T) is most suitable. 8-channel clinical knee coil is used as it provides suitable resolution and contrast-to-noise ratio for rabbit knee exploration.\nBefore installation on the imaging system, install a peripheral venous access through an auricular vein. This access will serve to inject the contrast agent.\n\t\nShave and disinfect the ear.\nPerform local anesthesia by subcutaneous injection of lidocaine.\nInsert a 25 G catheter inside the lateral auricular vein.\nAssess the permeability by injection of 1 ml sterile physiological serum.\nMaintain the catheter with adhesive tapping.\nAnesthetize animals by means of intramuscular injection of ketamine (30 mg/kg of body weight) mixed with xylazine (4 mg/kg). Animals are fully anesthetized once they fail to respond to paw pinch. Place a facial mask on the rabbit, giving it oxygen with a flow rate of 200 ml/min.\nOnce fully anesthetized, take animals to the MR imaging unit. Place animals so that the knees are located in the center of the MR coil. Place the animals' legs in complete extension, so that the long axis of the tibia is parallel to the MR imaging unit table. Use Velcro fasteners or sand bags to maintain optimal leg position.\nCardio-respiratory monitoring of the animals is not required as the anesthesia protocol allows deep anesthesia on spontaneous breathing, but animals have to be covered to avoid anesthesia-induced heat loss.",
    "MR protocol is detailed in Table 1. The average time for total acquisition including optimal installation is about 20 min.\nPerform MR imaging in different planes. Nevertheless, the transverse plane of the knees (orthogonal to the tibia) is the reference plan as it ensures anatomic reproducibility of image position for sequential longitudinal examinations and allows optimal correlation with histologic slices.\nAt the completion of unenhanced sequences, inject the UPSIO contrast agent through the auricular venous access. Slowly administer the iron oxide particles in a single dose of 150 μmol Fe/kg. Rinse the catheter by injection of 1 ml of sterile physiological serum.\nRepeat the enhanced GRE weighted sequence 24 hr after the injection. This delay allows the particles to be phagocytized by the macrophages.\nFor longitudinal studies evaluating drugs effect (antibiotics, steroids, anti-macrophage antibodies, etc.), repeat sequential MR examinations using the above-described protocol.\n3. Image Analysis\nFor longitudinal evaluation perform measurements at the same anatomic level, and define an easily identifiable landmark. For instance, acquisition through the axial plane where the greatest diameter of the patella is observed is a reliable way to obtain reproducible measurement (Figure 1).\nPerform image analysis using a DICOM-based software (such as Osirix) or an image processing software (ImageJ).\nUsing ImageJ software, perform the segmentation of the synovial area that demonstrates signal loss on USPIO-enhanced GRE T2-weighted image using the \"irregular area\" drawing tool. Once the synovium with dark signal is outlined, click on \"Analyze\" to obtain the area/ number of pixels (Figure 2).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}