{
  "id": 2175,
  "origin_website": "Cell",
  "title": "Evaluation of long-chain fatty acid respiration in neonatal mouse cardiomyocytes using SeaHorse instrument",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1. Neonatal mouse cardiomyocyte isolation\nTiming: Day 1: 1 h; Day 2: 2–3 h\nThis step is critical, as cell quality may influence the quality of the results with SeaHorse. The protocol is adapted from Neonatal mouse cardiomyocyte kit from Worthington (#LK003300). To our experience, it is important to isolate the cells from P0-P1 mouse pups.\nCollection of mouse neonatal hearts.\nOptional: Genotyping. If the experiment involves transgenic mouse models, genotyping should be preferably performed before the sample collection, so genotype-matched hearts can be pooled during the isolation process.\nTo limit any heat/cold stress and distress during the time of genotyping, the pups can be left in their bedding and tagged appropriately, according to your protocol approval. We usually used a non-toxic marker (100% ink-based Pentel) and gently label the upper part of their tail or their back.\nCollect a 1–2 mm piece of tail, and proceed to the DNA isolation and genotyping, according to your manufacturers’ protocol.\nEuthanasia.\nAnesthetize the pups according to your protocol approval (Figure 1[href=https://www.wicell.org#fig1]A). Be aware that P0-P1 pups are more resistant to inhalation method (isoflurane) but more sensitive to temperature stress.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1653-Fig1.jpg\nFigure 1. Isolation of neonatal mouse cardiomyocytes\n(A–H) Set of photography and scheme depicting the first steps of the neonatal mouse cardiomyocyte isolation, from mouse pup anesthesia (A), heart harvesting (B and C as a focus of B; scale bar: 1 mm); heart slicing and collection (D–F; scale bar E.: 5 mm), rotating steps (G) and final steps (from straining to seeding) (H).\nSterilize the abdomen with antiseptic solution.\nEuthanize by decapitation using sharp scissors.\nHeart collection.\nSurgically collect the heart while still beating (Figures 1[href=https://www.wicell.org#fig1]B and 1C).",
    "Hearts are immediately placed in ice-cold CMF Hank’s Balanced Salt Solution (HBSS), pH 7.4 in a small petri dish put on an ice bed.\nOnce cleared from extra-cardiac tissues and blood, cut each heart in 2–3 longitudinal pieces only, and transfer the sections into 1.5 mL Eppendorf tubes (labeled accordingly) containing 450 μL of HBSS (Figures 1[href=https://www.wicell.org#fig1]D–1F). Count 3 mouse pup hearts for 450 μL of HBSS.\nKeep the tubes on ice until the end of the collection.\nNote: You can use lamp-equipped magnifying glasses for assistance during the dissection process.\nCardiomyocyte isolation – Day 1.\nCritical: This step is critical, as cell quality may influence the quality of the results with SeaHorse. The protocol is adapted from Neonatal mouse cardiomyocyte kit from Worthington. For an alternative method isolation method that may not rely on commercial kit, the experiments may refer to this article (Ehler et al., 2013[href=https://www.wicell.org#bib3]).\nAlternatives: Pierce™ Primary Cardiomyocyte Isolation Kit (Cat#88281 from Thermo Fisher Scientific).\nAlternatives: Neonatal Cardiomyocyte Isolation Kit, mouse (Cat#130-100-825 from Miltenyi Biotec).\nTo our experience, it is important to isolate the cells from P0-P1 mouse pups.\nIf using the Worthington kit: Resuspend the trypsin vial in 2 mL of ice-cold sterile HBSS to obtain a 500 μg/mL solution.\nPut the tubes on a plate (lid of a petri dish, for instance), and incubate for at least 10–12 h at 4°C (fridge).\nCardiomyocyte isolation – Day 2.\nUnder a sterile hood, transfer the tissue and solution into a 10 mL tube. Use a wide-mouth (3 mm opening) pipet to avoid damaging the cells.\nAdd 100 μL of Trypsin inhibitor per 500 μL of tissue-containing solution.\nIncubate for 5 min at 37°C.\nResuspend collagenase in 5 mL of pre-warm Leibovitz L-15 medium. Add 250 μL per 500 μL of tissue-containing solution.",
    "Incubate at 37°C under slow rotation (2–4 rpm) for 45 min to one hour (Figure 1[href=https://www.wicell.org#fig1]G). We usually put the 1.5 mL tubes into a 50 mL Corning tube during the rotation process, but this is optional.\nPrepare a complete medium containing Leibovitz L-15 medium with 10% horse serum 5% fetal bovine serum, 1% penicillin-streptomycin. Pre-warm at 37°C in a water bath. The L15 containing medium is stable up to 3–4 months at 4°C (fridge).\nUnder the sterile hood, triturate the cells at least 10 times with a wide mouth pipet (or regular 10 mL pipet). Avoid air bubbles and high speed pipetting during the process, both of these would damage the cells. Just slowly aspirate the medium until 2/3 of the pipet tip or 10 mL pipet, and gently release it back into the tube.\nPre-wash a 40 μm strainer with 1 mL of L15 culture medium, then strain the cells, wash the strainer with 1 mL of medium. Repeat the operation a second time. Rinse the strainer with 2 mL of medium (Figure 1[href=https://www.wicell.org#fig1]H, top panel).\nPre-plating: Put the cell-containing medium in non-coated 35 mm2 dishes. Leave the cells undisturbed for 1 h in the incubator at 37°C (Figure 1[href=https://www.wicell.org#fig1]H, middle panel).\nCritical: This step enables the removal of most of the fibroblasts that are fast adhering compared with cardiomyocytes.\nGently collect the medium with cells in suspension, do not wash too toughly or this will detach the fibroblasts. Then spin the cells at 150 g for 5 min at 21°C.\nResuspend the cell pellet in appropriate volume of L-15 complete medium. Depending on the experimenter, the equivalent of 3–4 mouse pup heart can be seeded onto a 35 mm diameter dish (Figure 1[href=https://www.wicell.org#fig1]H, bottom panel).\nLeave the seeded cells undisturbed between 24 and 48 h.",
    "Note: Adhesion can be improved by pre-coating the plate with Poly-Lysine (Millipore Sigma, Cat# P8920).\nAt the end of the seeding time, the cardiomyocytes should be fully attached, and they may start beating (See Methods Video S1[href=https://www.wicell.org#mmc1] “Beating Neonatal Mouse cardiomyocytes”).\nPart 2. Cell culture on SeaHorse plate\nTiming: 1–4 days\n24–48 h after their seeding, the cardiomyocytes can be trypsinized and split into new plates. Seeding medium would be then replaced by culture medium. Cells isolated from transgenic mouse models can be treated with 4OH-tamoxifen for 4 consecutive days before assessment of respiration.\nTransfer the cells in SeaHorse 8-well plates.\nNote: Make sure the SeaHorse plates and sensors match with your SeaHorse Flux Analyzer instrument. The XFp Analyzer is now replaced by the XF HS Mini Flux Analyzer (See the link below for more information: Agilent).\nRemove the seeding medium, gently wash the cells with sterile D-PBS, and apply a volume of Trypsin EDTA 0.05% (Gibco Cat# 25300054) according to the size of the dish (1 mL for a 35 mm diameter dish). For proceeding the trypsinization from a different surface area, the experimenter should refer to “Useful Numbers for Cell Culture” from Thermo Fisher Scientific.\nIncubate for 5 min at 37°C.\nCollect the cells, spin at 150 g for 5 min at room temperature (19°C–21°C).\nDiscard the supernatant and resuspend the cells in 1 mL of complete culture medium (DMEM – Horse Serum 5% - Fetal Bovine Serum 10% - Penicillin/Streptomycin 1%).\nCell counting:\nPrepare a 1:10 dilution in a 1.5 mL Eppendorf tube.\nLoad 10 μL of the 1:10 dilution in a counting chamber of a hematocytometer or a slide of an automatic cell counter.\nEstimate the cell concentration of your undiluted cell suspension.",
    "Estimate the volume you need to pipet to load 25,000 cells in 100 μL of medium. Prepare the dilution of your cell suspension accordingly.\nNote: Please note that the complete estimation of cell lipid metabolism should include BSA-incubated and Palmitate-incubated wells, in presence or absence of etomoxir. This may enable to decipher exogenous to endogenous fatty acid oxidation (as discussed below). Consequently, any tested condition (Pharmacological drug incubation, or tamoxifen-induced gene disruption, for instance) may multiply the number of plates required per assay exponentially (Figure 2[href=https://www.wicell.org#fig2]B shows an example of plate setup).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1653-Fig2.jpg\nFigure 2. Neonatal mouse cardiomyocyte in a SeaHorse miniplate\n(A) Schematic representation of Seahorse miniplate preparation for a LCFA oxidation assay.\n(B) Example of plate groups that can be assigned for the assay.\n(C) Schematic representation of a cartridge (Left: injection ports, Right: utility plate for sensors hydration and calibration).\n(D) Screenshot from the Wave software representing the optimal protocol for LCFAO measurement (D). OligoM depicts “Oligomycin”; and Rot/AA “Rotenone/Antimycin A”.\n(E) For optimization purpose, a second injection could be added to the program, as shown in (E).\nPipet the volume according to your calculation, and load 6 well of an 8-well plates. Adjust the volume in the wells to 250 μL–300 μL.\nNote: One or two wells should be kept as a cell-free background per plate (Figure 2[href=https://www.wicell.org#fig2]A).\nPlace your plates in an incubator at 37°C/5% CO2, and leave them seeding for additional 24 h, or at least 12 h.",
    "Optional: To our experience, if cells are freshly isolated and healthy, and the SeaHorse miniplates being used, re-coating of the SeaHorse miniplates is not necessary. However, if preferred, the experimenters could eventually pre-coat the plates with poly-lysine or collagen for at least 1 h before seeding the cells. Previously, we had performed assay with or without pre-coating and we noticed no difference in term of OCR.\nNote: Cell morphology can be difficult to clearly assess on SeaHorse plate. The NMCMs might appear more round-shaped, but they should be beating as a syncytial at 1–2 days after seeding (Methods Video S1[href=https://www.wicell.org#mmc1]). Depending on the genes targeted by tamoxifen-induced disruption, treatment with tamoxifen may later affect their beating rate or synchronization.\nCell culture maintenance.\nThe cells can be kept in culture for up to one week. Medium should be changed every two days. Our maintenance medium usually contains DMEM – Horse Serum 5% - Fetal Bovine Serum 10% - Penicillin/Streptomycin 1%. Other formulation may be possible, but maintenance medium should always contain glucose, serum and antibiotics.\nOptional: treatment with tamoxifen.\nDilute 4OH-tamoxifen at 100 nM in complete maintenance medium.\nGently wash the cells with D-PBS and replace medium by 200 μL of fresh medium containing tamoxifen (Day 0 of treatment).\nCheck the viability of the cells after 24 h (Day 1 post-tamoxifen).\nNote: Do not increase 4OH-tamoxifen concentration to speed up or strengthen the process, since the reagent is highly cytotoxic for neonatal cardiomyocytes at higher dose.\nReplace the medium by fresh medium containing 100 nM of 4OH-tamoxifen at Day 2 or Day 3, and every 2–3 days, if longer incubation is needed.\nGene disruption is usually completed between Day 3 and Day 4.",
    "Note: Before running any SeaHorse plate experiment with a new transgenic mouse line, it is highly recommended to first ascertain the efficiency of the gene disruption in NMCMs, as well as the absence of tamoxifen cytotoxicity.\nKnock-out validation methods could include: DNA isolation and genotyping of the “floxed” alleles of your transgene of interest; RNA isolation and RT-qPCR for the mRNA coding the protein of interest, or Western blot for the protein of interest. The optimal methods may depend on 1- the yield of DNA, RNA or proteins that you could extract from your treated cell preparation; 2- the abundance of the mRNA or the protein coded by your gene of interest.\nChanges in beating rate could be also noticed in the plate when metabolism or Ca2+ cycling are impacted. This observation remains empirical and may be difficult to evaluate with additional electrophysiological approach on a SeaHorse plate.\nPause point: Tamoxifen can be replaced at Day 2 instead of Day 3 with no consequence on cell viability. Depending on the efficiency of the gene disruption, the cells can be ready to run between Day 3 (12 h after medium change at Day 3) and Day 5.\nPart 3. LCFA β-oxidation using SeaHorse\nTiming: 1–3 h\nThe day before the experiment:\n12 h before the experiment :\nReplace medium by substrate-limited medium: MEM + with 1% serum (fetal bovine or horse), 1% antibiotics, 1% Glutamine, 1% L-Carnitine. Incubate the cells in their regular incubator (18.6% O2, 5%CO2 at 37°C). This starvation step promotes the consumption of endogenous substrates or exogenous metabolite byproducts (glutamine, glucose or pyruvate oxidation) that may interfere with the assay (Zeidler et al., 2017[href=https://www.wicell.org#bib6]).",
    "Prepare cartridge hydration following the manufacturer’s recommendation (Agilent – Hydrating a XFp Sensor Cart). See in Figure 2[href=https://www.wicell.org#fig2]C a schematic representation of a cartridge. The recommendations have changed since we started working with the SeaHorse instrument, suggesting that the SeaHorse Calibrant Buffer composition might have slightly changed. The new protocol includes a hydration step and a calibration step. To perform the hydration, first, an aliquot of SeaHorse Calibrant Buffer (5 mL enough for 3 cartridges) is placed in a non-CO2 37°C and left for at least 12 h. Then, under a sterile cell culture hood, remove the top (green) part of the cartridge and place it upside down on your sterile bench. Add 200 μL of sterile distilled water into each wells of the cartridge utility plate (clear, Figure 2[href=https://www.wicell.org#fig2]C right panel). In order to prevent evaporation, add 400 μL of sterile water in the compartments (moats) on each side of the utility plate (Figure 2[href=https://www.wicell.org#fig2]C, right panel).\nPlace the green part of the cartridge back onto the utility plate, so the sensors are fully submerged.\nIncubate the cartridges at 37°C in a Non-CO2 incubator. The cartridges can be wrapped with aluminum foil or parafilm to prevent any overnight evaporation.\nNote: Once rehydrated, the cartridges can be short-term stored at 4°C up to 24–48 h before being used for any assay. They need to be kept wrapped in parafilm and aluminum foil to avoid evaporation and contamination. The leftover of Calibrant buffer should be discarded.\nAt least 3–6 h before the experiment: Turn on the SeaHorse Flux Analyzer to make sure the instrument is set at 37°C at the time of experiment.\nPrepare the program using the Wave software (Figure 2[href=https://www.wicell.org#fig2]D) and save the file into the same USB that will be used for data collection.",
    "Note: For the first tests of optimization, to our experience, adjustment of substrate, inhibitors and especially FCCP uncoupling concentration might be needed (as discussed in the expected outcomes[href=https://www.wicell.org#expected-outcomes] and troubleshooting[href=https://www.wicell.org#troubleshooting] sections). If so, add FCCP working solution into the injection port C and add another injection and measurement in your program accordingly (Figure 2[href=https://www.wicell.org#fig2]E).\nCritical: This is important to keep the wait time at minimum while assessing respiration in neonatal cardiomyocytes.\nDay of experiment: Before you start, make sure to prepare a layout of your miniplate(s) that clearly indicates the treatment of your cells.\nPrepare the FAO medium (up to 10–20 mL), and filter it with a 0.20 μm filter gauge.\nThe FAO medium is a working solution that should not be stored or reused.\nUnder a sterile hood, wash the wells of the plate (containing cells) twice with 200–300 μL of FAO medium.\nMake sure the original culture medium is fully removed and washed out, as volume leftover may affect reagent concentration and cell response. It can also introduce well to well variation.\nAdd 130 μL of FAO medium in each well and incubate the plate in a Non-CO2 37°C incubator for 60 min.\nAt the same time, remove the cartridge from the Non-CO2 incubator. Remove the water from the wells of the utility plate and replaced it by the pre-warm aliquoted SeaHorse Calibrant Buffer. Place the cartridge back to the Non-CO2 incubator and incubate for 45–60 min.\nPrepare the SeaHorse reagent working solutions.\nIf using Agilent Mito Stress Kit, follow the manufacturer instructions to resuspend the pouches (Agilent Mito Stress Kit). The pouches are single-used and should not be stored.\nIf preparing solutions from powder-made stock, follow the preparation steps, as mentioned in materials and equipment[href=https://www.wicell.org#materials-and-equipment].",
    "BSA-conjugated Palmitate: Pre-warm Palmitate and BSA stock solution at 52°C. Mix 100 μL of Palmitate 10 mM + 200 μL of 1 mM BSA in room temperature FAO medium (final volume = 1 mL) immediately.\nFatty-acid free BSA: Mix 200 μL of 1 mM BSA stock with 800 μL of FAO medium.\nOligomycin: Intermediate Dilution at 1:100 in FAO medium.\nNote: The dilution is stable for few hours after preparation. Can be used for the preparation of working solution of several runs.\nWorking solution: 48 μL of 1:100 dilution + 252 μL of FAO medium. Load 25 μL/well (1 μM / per well).\nFCCP: Intermediate Dilution: 24 μL of stock solution in 900 μL of FAO medium. Working solution: 200 μL of dilution + 800 μL of FAO medium. Load 25 μL/well (16 μM / per well).\nRotenone: Intermediate Dilution #1): 10 μL of stock solution in 990 μL of FAO medium Intermediate Dilution#2): 1:100 of Dilution #1 in FAO medium.\nWorking solution: 60 μL of Intermediate Dilution#2 + 240 μL of FAO medium.\nLoad 25 μL/well (0.5 μM / per well).\nNote: The stock solutions can be stored at −20°C after resuspension. The working solution should not be reused from one experiment to another. However, while kept on ice, the intermediate dilutions can be reused for few hours.\nLoad the injection ports of a pre-equilibrated cartridge (still on the top of the utility plate, the sensors submerged in calibration medium) with oligomycin, FCCP and Rotenone/Antimycin A, in A to D according to your injection program (Figure 2[href=https://www.wicell.org#fig2]C, left panel). With our method, the injection volume is equal to 25 μL per port.\n(If using the ready-to-use solutions from Agilent, the experimenters should refer to the manufacturer recommendation and protocol: Agilent Mito Stress Kit).",
    "Bring the cartridge to the SeaHorse Flux Analyzer. Start the program. Launch the calibration step, following the instrument instruction.\nThis calibration step should approximatively take 15–20 min, depending on the instrument.\nPre-treatment with Etomoxir needs to be performed in order to ascertain the impact of endogenous fuel source. Add 20 μL of Etomoxir in the wells dedicated to Etomoxir-treatment at the beginning of the calibration time.\nEtomoxir : 5 μL of stock Etomoxir (at 30 mM) in 745 μL of FAO medium. 20 μL per well. (40 μM per well).\nOnce the SeaHorse instrument is ready and calibration is complete, add 25 μL of working solution of BSA-conjugated-Palmitate (and/or Fatty acid-free BSA) in the wells.\nStart the program by loading the cell plate into the instrument.\nThe program should be fully complete within 1 h and half.\nAt the end of the experiment, collect your dataset by exporting the file with a USB key.\nThe instrument is ready to start the second run, if needed.\nIf so, a new cartridge can be loaded for calibration.\nGet your plate back from the SeaHorse instrument.\nRemove FAO medium and gently wash twice with PBS.\nAdd 10–20 μL of cell lysis buffer (regular lab-made buffer or ready-to-use RIPA buffer). You should obtain enough material to estimate the protein concentration via a Bradford or BCA assay (see details in quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section below).",
    "Optional: Depending on the relative protein abundance of the gene of interest, target gene disruption could be directly verified by running a Western blot from 5–10 μL of this cell lysate (see more information below in the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] paragraph). If intended to do so, add protease/phosphatase inhibitor cocktail to the cell lysis buffer and quickly collect the cells while putting the plate on an ice-bed right after the end of the SeaHorse experiment."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Isolation",
    "Cell Culture",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}