{
  "id": 2717,
  "origin_website": "Cell",
  "title": "Protocol to identify small molecules promoting rat and mouse cardiomyocyte proliferation based on the FUCCI and MADM reporters",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvesting heart ventricles from neonatal rats\nTiming: 30 min\nThis section describes the procedures for harvesting heart ventricles from neonatal rats, washing in pre-cooled PBS to remove the blood, atria, and other tissues.3[href=https://www.wicell.org#bib3] Perform all the following steps are in a sterile cell-culture hood, all surgical instruments should be sterile. Keep prepared reagents on ice and harvest the ventricles as fast as possible.\nPrepare the following surgical instruments, consumables, and reagents.\nSurgical instruments.\nTwo sterile straight forceps.\nTwo sterile curved forceps.\nTwo sterile straight scissors.\nOne sterile curved scissor.\nConsumables.\n15 mL sterile centrifuge tubes.\n50 mL centrifuge tubes.\nTwo 100 μm cell strainers.\nOne 0.22 μm filter.\n10 mL syringes.\nOne sterilized bottle.\nOne sterilized rotor.\nTwo sterilized gauzes.\nTwo sterilized 100 mm plastic dishes.\n10-mL pipettes.\nOne carcass bag.\nOne ice box.\nReagents.\n75% alcohol.\nPre-cooled HBSS without Ca2+ and Mg2+ (MacGene, CC016).\nPrepare 60 mL digestion solution containing collagenase II (0.3 mg/mL; Gibco, 2163320) and trypsin (1 mg/mL; Amresco, VWRV0785) in HBSS.\nNote: Filter digestion solution with a 0.22 μm filter using 10 mL syringes and place on ice.\nPrepare 100 mL of high glucose DMEM (Hyclone, SH30022.01) containing 10% fetal bovine serum (FBS, Yeasen, 40130ES76) and 1% penicillin-streptomycin (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2204-Fig7.jpg\nFigure 7. Schematic of neonatal rat cardiomyocyte isolation\nTurn on the constant temperature magnetic stirrer, set the stir speed to 180 rpm, and the temperature to 37°C.\nNote: The constant temperature magnetic stirrer heats up slowly. In order to ensure that the heart can be digested at 37°C after harvesting, it needs to be turned on at least half an hour in advance.\nTransfer 15 mL pre-cooled HBSS without Ca2+ and Mg2+ into three sterile 100 mm dishes and place them on ice.",
    "Place 3-day-old (P3) SD rats and 75% alcohol in two boxes, and cadavers in the third box.\nSterilize P3 SD rats with 75% alcohol, mainly focusing on the chest.\nDecapitate pups using sterile straight scissors, and open the chest along the sternum to remove the heart.\nNote: A rat heart can obtain 4 × 106 cardiomyocytes. The number of hearts can be calculated according to the total number of cardiomyocytes required.\nCollect hearts with curved scissors.\nImmediately transfer into the 100 mm dish containing pre-cooled HBSS without Ca2+ and Mg2+.\nTransfer hearts to other two dishes containing HBSS with curved tweezers to remove the blood, atria, and other tissues (Figure 7[href=https://www.wicell.org#fig7]).\nEnzymatic digestion of ventricles\nTiming: 1 h\nThis section describes the procedures for enzymatic digestion of ventricles. Digest ventricles for 8–10 times and collect the supernatants of each digestion. Centrifuge the collected cells and seed the cell suspension onto two dishes.\nAdd 5 mL filtered digestion solution and a sterile rotor to the 10 mL sterilized bottle.\nTransfer the collected hearts into the bottle.\nCut the hearts into small pieces using straight scissors.\nDigest the ventricles under 180 rpm agitation at 37°C for 5 min (Figure 7[href=https://www.wicell.org#fig7]).\nNote: Do not cut the heart into too small pieces while avoiding the adherence of tissues during digestion.\nAfter 5 min, leave the ventricle tissues to stand for a minute, discard the supernatant, and add a fresh 5-mL digestion solution.\nRepeat steps 10 and 11 to remove the red cells.\nNote: Before the second digestion, cut the heart tissue into smaller pieces with straight scissors to fully remove the blood.\nAfter the third digestion, transfer the supernatants to a 15 mL tube containing 5 mL high-glucose DMEM with 10% FBS and 1% penicillin-streptomycin.",
    "Pipette up and down 10 times using a 10 mL pipette to stop the digestion.\nPlace the 15 mL tube on ice.\nCritical: Fully mix the supernatants and complete medium by pipetting up and down to terminate digestion.\nAdd 5 mL digestion solution to the remaining cardiac tissue and digest it under 180 rpm agitation at 37°C for 5 min.\nRepeat steps 13 and 14 8–10 times with the remaining cardiac tissue until it is flocculent. Troubleshooting 1[href=https://www.wicell.org#sec7.1].\nAfter finishing the last digestion, centrifuge cells of all 15 mL tubes at 200 g for 5 min (Figure 7[href=https://www.wicell.org#fig7]).\nCarefully discard the supernatant and re-suspend the remaining cell pellets in 20 mL high-glucose DMEM containing 10% FBS and 1% penicillin-streptomycin.\nPipette up and down using a 10 mL pipette to ensure a homogeneous solution of single cells.\nPass the cell suspension through a 100 μm cell strainer.\nSeed onto two sterilized 100 mm plastic dishes to allow the fibroblasts to adhere.\nIncubate the cells for 2 h at 37°C in a 5% CO2 humidified incubator.\nNote: This step is designed to separate non-cardiomyocytes from cardiomyocytes. Non-cardiomyocytes in the heart are mainly fibroblasts, and fibroblasts adhere to the culture plates more rapidly than cardiomyocytes. Using differential attachment technique, we allow the cells to adhere for two hours and then collect non-adhered cells for enriching cardiomyocytes.\nCounting and plating the cells\nTiming: 1 h\nThese procedures are performed after culturing cardiac cells for 2 h.\nAfter culture for 2 h.\nGently wash the dishes with 10 mL high-glucose DMEM containing 10% FBS and 1% penicillin-streptomycin.\nTransfer the supernatant to two 15 mL tubes.\nCentrifuge at 200 g for 5 min at 25°C.\nRe-suspend the pellets in 10 mL high-glucose DMEM containing 10% FBS and 1% penicillin-streptomycin.",
    "Pass the cell suspensions through a 100 μm cell strainer.\nTake 9 μL cell suspension and 1 μL 0.4% trypan blue (Solarbio, C0040), pipette up and down to mix them, and stain for 3 min.\nLoad 10 μL of the mixture into the well of a cell-counting chamber.\nDetermine the total cell number and viability by a Countess II Automated Cell Counter.\nPrepare culture medium containing high glucose DMEM, 20 μM cytosine arabinoside, and 5% horse serum.\nNote: Since cytosine arabinoside blocks DNA synthesis to inhibit non-cardiomyocytes proliferation, thus avoiding the dominant growth of non-cardiomyocytes during adherent culture.\nAdd a certain amount of culture medium according to cell viability and total cell number.\nPipette up and down using a 10 mL pipette to ensure a homogeneous solution of single cells.\nSeed the cell suspensions on 96-well plates at 15,000 cells per well and incubate at 37°C and 5% CO2.\nAdenoviral infection\nTiming: 30 min\nThis section describes the procedures for pAdeno-Tnnt2-mAG-hGeminin (1/110) adenovirus infection in neonatal rat ventricular myocytes (NRVMs).\nAfter plating for 48 h, confirm that NRVMs are attached and exhibit spontaneous beating under microscopy (Figure 8[href=https://www.wicell.org#fig8]). Troubleshooting 2[href=https://www.wicell.org#sec7.3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2204-Fig8.jpg\nFigure 8. Bright-field images of cardiomyocytes at different culture times\nScale bar, 100 μm.\nCalculate the required amount of virus according to the following formula. The amount of virus for each well (μL) = (MOI) × (the number of cells at the time of infection) / the titer (PFU/mL) × 1000.\nRemove the medium from the 96-well plate.\nAdd pAdeno-Tnnt2-mAG-hGeminin (1/110) adenovirus at an MOI of 100 that are diluted in a high-glucose medium containing 1% FBS. Troubleshooting 3[href=https://www.wicell.org#sec7.5] and 4[href=https://www.wicell.org#sec7.7].",
    "Note: Adenovirus should be stored as aliquots to avoid repeated freezing and thawing. After taking out the virus, place the adenovirus on ice immediately. Mix adenovirus thoroughly by pipetting up and down before adding it to the medium.\nSmall-molecule treatment\nTiming: 2 h\nThis section describes the procedures of small-molecule treatment. All the following steps are performed in a sterile cell-culture hood, except for transferring compounds by ECHO 520.\nTake 384-well chemical library plates from a –80°C refrigerator at least 2 h in advance.\nThaw compounds at room temperature (18°C–26°C).\nCentrifuge them quickly with a centrifuge dedicated to these plates.\nPrepare high-glucose DMEM with 1% penicillin-streptomycin and 0.5% FBS and as negative control (0.5% FBS with DMSO) or 10% FBS as positive control (10% FBS with DMSO).\nAfter adenoviral infection for 24 h.\nAspirate the culture medium.\nImmediately add fresh culture medium with 2 μM indicated small molecules.\nCritical: Do not discard the liquid in several 96-well plates at one time to avoid a great impact on the cell state caused by a long operating time. When transferring compounds with ECHO 520, the plates need to be inverted, so it is necessary to ensure that there is no liquid remaining in the plates.\nTransfer compounds in 384-well plates in a volume of 20 nL (10 mM) to 96-well plates using ECHO 520 (Labcyte) (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2204-Fig9.jpg\nFigure 9. Schematic of the location of small molecules from one 384-well plate to four 96-well plates\nDistribute 100 μL DMEM with 0.5% FBS and 1% penicillin-streptomycin to each well using Multidrop Combi (Thermo Scientific), thus making a final working concentration of 2 μM for each compound.\nAdd both negative control (0.5% FBS with DMSO) and positive control (10% FBS with DMSO) in the 96-well plates as shown in Figure 9[href=https://www.wicell.org#fig9].",
    "Immediately place the 96-well plate into the incubator after adding compounds and negative and positive controls.\nRepeat steps 37–41.\nSeal the 384-well library plates with sealing film, flat with a roller, and return to the –80°C refrigerator.\nImaging and analysis\nTiming: 2–4 h\nThis section describes the procedures for imaging and analysis of FUCCI-positive NRVMs after small-molecule treatment for 24 h.\nAfter small-molecule treatment for 24 h, aspirate the culture medium, and stain the nuclei with Hoechst 33342.\nCapture images of FUCCI [mAG-hGeminin (1/110)]-positive green fluorescent NRVMs using the MD ImageXpress Micro XL Imaging System (Molecular Devices). (refer to Table 6[href=https://www.wicell.org#tbl6] for parameter settings of MD ImageXpress Micro XL Imaging System). Troubleshooting 5[href=https://www.wicell.org#sec7.9].\ntable:files/protocols_protocol_2204_16.csv\ntable:files/protocols_protocol_2204_17.csv\nNote: Acquiring at least 9 images per well and analyzing 3,000 cells per well.\nOptional: Images of FUCCI [mAG-hGeminin (1/110)]-positive green fluorescent NRVMs can also be acquired using Opera Phenix (Perkin Elmer) (refer to Table 7[href=https://www.wicell.org#tbl7] for parameter settings of PE Opera Phenix) and the data can be analyzed using the harmony software in Opera Phenix.\nCount the number of FUCCI-positive NRVMs and the total number of NRVMs based on cell segmentation using MetaXpress software.\nCalculate the percentage of FUCCI-positive NRVMs in each well.\nDetermine positive hits of small molecules based on at least 2-fold greater effects on the induction of FUCCI-positive NRVMs than the negative control (Figure 10[href=https://www.wicell.org#fig10]). Troubleshooting 6[href=https://www.wicell.org#sec7.11].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2204-Fig10.jpg\nFigure 10. The compound Harmine enables neonatal rat cardiomyocyte proliferation\n(A) Representative images of P3 NRVMs infected with FUCCI [Ad-Tnnt2-mAG-hGeminin (1/110)] adenovirus and treated with either DMSO (negative control), 10% FBS (positive control), or Harmine. Scale bars, 100 μm.\n(B) Quantitative analysis of data from (A). n = 3,000 cells per replicate, 4 replicates per group. Data are the mean ± SEM. ∗∗∗∗p < 0.0001; ns, not significant; unpaired, two-tailed Student’s t test.",
    "Confirm candidate small molecules (2 μM) twice to assess their effects on induction of FUCCI-positive NRVMs. Troubleshooting 7[href=https://www.wicell.org#sec7.13].\nDetermine optimal concentration of candidate compounds\nTiming: 1–2 weeks\nThe concentration of candidate compounds in the three repeated initial screenings are 2 μmol/L, the following steps describe procedures for determining the optimal working concentration for each candidate.\nIsolate and seed P3 NRVMs on 24-well plates at 50,000 cells per well.\nAfter 48 h, infect NRVMs with pAdeno-Tnnt2-mAG-hGeminin (1/110) adenovirus at an MOI of 100.\nDissolve each candidate small molecule in DMSO at 10 mM.\nDilute these small molecules into high-glucose DMEM containing 0.5% FBS at 0, 0.5, 1, 2, 5, or 10 μM and are applied to NRVMs for 24 h.\nNote: Vortex small molecules before and after dilution into high-glucose DMEM containing 0.5% FBS. Gently shake the 24-well plates after adding small molecules to cardiomyocytes.\nMeasure the percentage of FUCCI-positive NRVMs in each well based on cell segmentation using MetaXpress software. Troubleshooting 8[href=https://www.wicell.org#sec7.15] and 9[href=https://www.wicell.org#sec7.17].\nHarvesting neonatal mouse ventricles\nTiming: 12–16 h\nThis section describes the procedures of isolating cardiomyocytes from neonatal mouse ventricles with overnight pre-digestion by trypsin.\nNote: All the following steps are performed in a sterile cell-culture hood, all surgical instruments should be sterile, and the prepared reagents should be kept on ice.\nPrepare the following surgical instruments, consumables, and reagents.\nSurgical instruments.\nThree sterile curved forceps.\nOne straight sterile scissor.\nOne sterile curved scissor.\nConsumables.\nOne 0.22 μm filter.\n10 mL syringes.\nOne sterilized bottle.\nOne sterilized rotor.\nTwo sterilized gauzes.\nThree sterilized 100 mm plastic dishes.\n10 mL pipettes.\nOne carcass bag.\nOne ice box.\nReagents.\n75% alcohol.\nPre-cooled HBSS without Ca2+ and Mg2+.\nAdd 10 mL filtered 0.25% trypsin with EDTA and a rotor to a sterilized bottle. Place the bottle on ice.",
    "Transfer 15 mL pre-cooled HBSS without Ca2+ and Mg2+ into three sterile 100 mm dishes and place them on ice.\nPlace P3 MADM-ML-11TG/GT neonatal mice and 75% alcohol in two boxes, and cadavers in the third box.\nSterilize P3 MADM-ML-11TG/GT mice with 75% alcohol, mainly focusing on the chest.\nFollowing euthanasia, open the chest of pups along the sternum.\nUse the curved scissors to collect the ventricles.\nNote: A mouse heart can isolate 2 × 106 cardiomyocytes. The number of hearts can be calculated according to the total number of cardiomyocytes required.\nTransfer each heart immediately into the 100 mm dish containing pre-cooled HBSS without Ca2+ and Mg2+.\nUsing the curved tweezers, transfer hearts to the second and then third dish to remove the blood and other tissues.\nUsing straight scissors to make an incision in the heart, which does not need to be completely cut apart.\nGently transfer hearts to the bottle containing 0.25% trypsin with EDTA.\nPlace the bottle in a 4°C refrigerator and leave overnight (12–16 h).\nDigesting, counting, and plating mouse CMs\nTiming: 4 h\nThis section describes the procedures of isolating mouse cardiomyocytes. Ventricles are digested by collagenase II 3–4 times. To separate the cardiomyocytes from non-cardiomyocytes, the cells are plated into 2 dishes and incubated for 2 h. After that, purified cardiomyocytes are seeded into culture plates.7[href=https://www.wicell.org#bib7]\nAfter pre-digestion, prepare the following surgical instruments, consumables.\nSurgical instruments.\nSterile straight scissors.\nConsumables.\nTwo 100 μm cell strainers.\n15 mL sterile centrifuge tubes.\n50 mL centrifuge tubes.\nOne 0.22 μm filter.\n10 mL syringes.\nOne ice box.\nPrepare 60 mL complete medium of high glucose DMEM containing 10% FBS and 1% penicillin-streptomycin.\nPrepare 30 mL digestion solution containing collagenase II (0.5 mg/mL; Gibco, 2163320) and BSA (5 mg/mL; MP Biomedicals, Y180306) in complete medium.",
    "Filter the digestion solution with a 0.22 μm filter and place on ice.\nTurn on the constant temperature magnetic stirrer, set the stir speed to 90 rpm, and the temperature to 37°C.\nTake the bottle out of the 4°C refrigerator.\nAdd 10 mL complete medium to the bottle.\nPut the bottle in a water bath under 90 rpm agitation at 37°C for 5 min to stop the trypsin digestion.\nAfter 5 min, discard the supernatant and add 5 mL fresh digestion solution.\nDigest the heart in the water bath under 90 rpm agitation at 37°C for 1 min.\nAfter 1 min, discard the supernatant and add fresh 5 mL digestion solution.\nDigest the heart in the water bath under 90 rpm agitation at 37°C for 5 min.\nAfter 5 min, gently transfer the supernatants into a 15 mL centrifuge tube and place the tube on ice, being careful not to transfer tissue into the tube.\nRepeat steps 73 and 75 3–4 times until the tissue is flocculent.\nAfter finishing digestion, centrifuge all cells in the 15 mL tubes at 200 g for 5 min.\nCarefully discard the supernatants and re-suspend the cell pellets in 20 mL complete medium by pipetting up and down.\nPass the cell suspensions through a 100 μm strainer.\nSeed cell suspensions onto two sterilized 100 mm plastic dishes.\nIncubate cells for 2 h at 37°C in a 5% CO2 humidified incubator to separate cardiomyocytes from non-cardiomyocytes.\nAfter 2 h incubation.\nHarvest the cell suspension and gently wash the dishes with 10 mL complete medium.\nTransfer the suspensions into two 15 mL tubes.\nCentrifuge at 200 g for 5 min at room temperature (18°C–26°C).\nGently re-suspend the cell pellets in complete medium by pipetting.\nPass the cell suspension through a 100 μm strainer.",
    "Count the cells as in steps 26 and 28.\nPrepare high glucose DMEM containing 20 μM cytosine arabinoside, 10% FBS, and 1% penicillin-streptomycin.\nSeed the cardiomyocyte on 96-well plates at 15,000 cells per well and incubate at 37°C, 5% CO2.\nTnnt2-Cre adenoviral infection and candidate small molecule treatment\nTiming: 30 min for infection and 2 h for compound treatment\nThis section describes the procedures of Tnnt2-Cre adenoviral infection and the procedures of small-molecule treatment, which induces inter-chromosomal recombination in MADM cardiomyocytes and collect high-content microscopy images to evaluate the efficiency of cytokinesis.\nAfter 48 h in culture.\nPrepare the high glucose DMEM containing 1% FBS and 1% penicillin streptomycin.\nDilute pAdeno-Tnnt2-Cre adenovirus at an MOI of 200 in the medium. Follow infection protocol with steps 31–34.\nAfter 24 h of infection, prepare preheated adequate DMEM containing 0.5% FBS and 1% penicillin-streptomycin.\nDilute candidate compounds at the optimal concentration in the medium.\nAdd equivalent DMSO to the medium (0.5% FBS) as a negative control.\nGently remove the medium from the 96-well plate by pipetting, and add negative control and candidate compound media to the plates.\nAfter incubation for 72 h, stain the nuclei with Hoechst 33342.\nCapture images and analyze the data using MD ImageXpress Micro XL Imaging System (Figure 11[href=https://www.wicell.org#fig11]). Imaging parameter settings could refer to step 45.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2204-Fig11.jpg\nFigure 11. The compound AZD3965 slightly induces cardiomyocyte cytokinesis as assessed by the MADM reporter\n(A and B) Representative images (A) and quantification (B) of single-color (red or green) cells among Ad-Tnnt2-Cre adenovirus-infected neonatal mouse MADM cardiomyocytes after either DMSO or AZD3965 treatment. n = 2,500 cells per replicate, 3 replicates per group. Data are the mean ± SEM.; ∗∗p <0.01; ns, not significant; unpaired, two-tailed Student’s t test.\nScale bars, 100 μm.",
    "Calculate the percentage of single-color cardiomyocytes in each well. Troubleshooting 9[href=https://www.wicell.org#sec7.17]."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Microscopy",
    "Cell Biology",
    "Cell-Based Assays",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}