{
  "id": 4045,
  "origin_website": "Cell",
  "title": "High-content imaging and analysis to quantify the nuclear to cytoplasmic ratio of TGFβ and hippo effectors in mammalian cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nReverse siRNA transfection of EpH4 cells\nTiming: [∼ 24 h] for step 1\nTiming: [∼ 25 h] for step 2\nThis step describes the transfection of EpH4 cells with siRNAs targeting Taz (Wwtr1) and Yap (siTaz/Yap) and controls (siCTL) for automated quantitative imaging in a 96-well dish and for parallel monitoring of knockdown efficiency by quantitative PCR (qPCR) and immunoblotting in 12-well dishes.\nCell preparation for transfections\nSplit sub-confluent EpH4 cells into DMEM supplemented with 10% FBS in 100 mm dishes such that cells reach 50–70% confluency after 24 h. Typically, this can be achieved by a 1:10 split from a confluent dish.\nTrypsinize EpH4 cells for 5 min, neutralize with DMEM containing 10% FBS and count cells using a hemocytometer. Using 50 mL tubes, prepare two 15 mL cell dilution stocks in DMEM containing 10% FBS at 56,000 or 67,200 cells/mL for siCTL or siTaz/Yap, respectively.\nCritical: The Hippo pathway is highly responsive to the increases in cell density, thus, to avoid pathway activation, cells must be maintained at low density up to and including the assay endpoint. In addition, to ensure that siCTL and siTaz/Yap transfected cells, which grow at different rates, are at the same confluency, transfected cells should be seeded at a ratio of 1:1.2, respectively. These requirements are achieved when cells are plated at a final density of 20,000 and 24,000 cell/cm2 for siCTL and siTaz/Yap transfectants, respectively.",
    "Note: For imaging, 0.2 mL of the cell suspension/transfection solution will be used in each of 48 wells of a 96-well high optical quality μ-Plate, (area = 0.56 cm2/well), which is 11200 or 13440 cells/well for siCTL or siTaz/Yap, respectively. For verification of knockdown, 1.25 mL of the cell suspension/transfection solution will be used in each of 2 wells (area = 3.5 cm2 / well) of a 12 well plate. Thus, the total volume required for the experiment is 12.1 (48 x 0.2 + 2 x 1.25) mL per condition.\nPreparation of siRNA transfection mix and cell transfection\nLabel two 50 mL tubes as siCTL and siTaz/Yap for preparation of transfection solutions.\nEach mL of cell suspension requires 196 μL of Opti-MEM and 2 μL of siRNAs. For siTaz and siYap, use 1 μL of Taz and 1 μL of Yap siRNApools and for siCTL, use 2 μL of the siRNA pool from a 20 μM siRNA stock solution. Thus, to prepare sufficient mix for a final volume of 13 mL of cell suspension/transfection solution, use 2.55 mL of Opti-MEM and 26 μL of siRNAs (13 μL each of siTaz or siYap and 26 μL of siCTL). Gently mix by tapping or pipetting and then incubate at RT for 5 min.\nFor each mL of transfection mix, add 2 μL of Lipofectamine RNAiMAX (i.e., 26 μL to each siRNA solution). Mix gently and incubate at RT (20°C–25°C) for 20 min.\nAdd 10.4 mL of each cell suspension prepared in step 1 to the corresponding transfection mix and pipet up and down gently, avoiding bubbles to thoroughly mix cells and reagents.",
    "Distribute the cell suspension/transfection solution into individual wells. For the 96-well imaging plate, use a multichannel pipette to seed 0.2 mL of the siCTL or siTaz/Yap cell suspension/transfection mix into each of 48 wells in either the 6 left columns or 6 right columns, respectively of the 96 well plate. Gently shake the plate to distribute cells evenly in wells.\nFor immunoblotting and/or qPCR to confirm knockdown efficiency, add 1.25 mL of the siCTL or siTaz/Yap cell suspension/transfection mix per well in duplicate into a 12-well dish. To monitor both protein and mRNA levels and to allow for independent sample processing, use a single well for each condition plated into 2 separate 12-well plates.\nPlace plates in a tissue culture incubator for 20 h.\nNote: Be sure to time this incubation accurately for optimal transfection efficiency.\nThe next day (after 20 h) add fresh media (0.2 mL per well of DMEM 10% FBS to the 96 well plate and 1.25 mL to wells in the 12 well plates) and incubate for 4 h.\nCell starvation and TGFβ stimulation\nTiming: [∼ 6 h]\nTo determine temporal patterns of Smad localization, EpH4 cells transfected with siCTL or siTaz/Yap are treated with different doses of TGFβ from 1 to 50 pM at varying times from 0 to 3 h. Optimal activation of TGFβ signaling occurs in low serum conditions, possibly due to the presence of latent TGFβ in Fetal bovine serum (FBS) (Oida and Weiner 2010[href=https://www.wicell.org#bib5]). For imaging, all cells are simultaneously fixed and stained. Thus, to vary the time of TGFβ treatment and ensure that all cells experience equivalent serum-deprivation conditions, a reverse time course approach is required.\nCell starvation",
    "Change media with starvation media (media with low serum, 0.1% FBS). Aspirate old media and add 0.2 mL of starvation media for varying times, as listed in Table 1[href=https://www.wicell.org#tbl1] (Column 2) such that all cells are starved for 3 h at the assay endpoint. Cells in 12 well plates for immunoblotting and qPCR experiments are starved for 3 h.\ntable:files/protocols_protocol_758_9.csv\nTGFβ stimulation\nPrepare TGFβ-containing media in PCR tubes by diluting the TGFβ stock solution into starvation media to achieve a final concentration of 21, 52.5, 105, 210, 420 and 1050 pM.\nCritical: Dilute TGFβ into final concentration immediately after starvation and before treatment as TGFβ can be easily absorbed on the wall of the tubes.\nUsing a micro multichannel pipette, add TGFβ at the indicated times (Table 1[href=https://www.wicell.org#tbl1], Columns 3-4) to obtain the desired treatment dose and time by adding 10 μL of each of the different concentrations to the corresponding wells to achieve a final concentration of 1, 2.5, 5, 10, 20, and 50 pM. Table 2[href=https://www.wicell.org#tbl2] shows the timing and concentration of TGFβ treatment.\ntable:files/protocols_protocol_758_10.csv\nNote: A similar protocol is followed for transfection, seeding, starvation and TGFβ treatment of cells for tracking localization of Smad4.\nCell fixing and antibody staining\nTiming: [∼ 0.5 h] for step 5\nTiming: [∼ 18 h] for step 6\nThis step describes fixation and immunofluorescent staining of cells in 96-well dishes to monitor localization of Smads and Taz/Yap proteins in cells transfected with siRNAs. The following steps do not require sterile conditions.\nCell Fixing.\nRemove media using a multichannel aspirator and wash cells 3 times with PBS at RT (20°C–25°C) using a multichannel pipette.\nCritical: Use PBS at RT (20°C–25°C) to wash treated cells before fixation to avoid cold stress to cells.",
    "Fix cells using 100 μL per well of 4% PFA in PBS at RT (20°C–25°C) for 20 min and then wash 3 times with PBS-T.\nAntibody staining.\nPermeabilize cells using 100 μL per well of 0.5% Triton X-100 in PBS for 10 min, and then wash 3 times with PBS-T.\nBlock using 100 μL per well of blocking buffer for 1 h at RT (20°C–25°C).\nIncubate with 70–100 μL per well of primary antibodies diluted in blocking buffer at 2°C–8°C overnight (16–18 h), with rocking. The plate is stained simultaneously for both Smad2/3 and Taz/Yap, using dilutions of 1:500 for rabbit anti-Smad2/3 and 1:300 for mouse anti-Yap (see key resources table[href=https://www.wicell.org#key-resources-table]).\nWash cells 3 times with PBS-T for 5 min each.\nIncubate with 100 μL per well of secondary antibodies (Alexa Fluor® 488 Goat Anti-Rabbit IgG (H+L) and Alexa Fluor® 546 Goat Anti-Mouse IgG (H+L), for Smad2/3 and Taz/Yap, respectively, each at a dilution of 1:1000 and DAPI at 1 μg/mL, diluted in blocking buffer at RT (20°C–25°C) for 2 h. Cover the plate with foil to prevent light exposure as these antibodies are light sensitive.\nWash 3 times with PBS-T for 5 min each.\nAdd 400 μL of cold PBS to each well and seal the plate with aluminum foil sealing film.\nCritical: The sealed plate can be stored at 2°C–8°C prior to image acquisition (for up to 1 day).\nNote: Antibody specificity and low background signals (roughly 5% of total intensity) were confirmed by testing all individual primary and secondary antibodies (see key resources table[href=https://www.wicell.org#key-resources-table]).\nNote: A similar protocol can be followed for staining of Smad4 alone using a dilution of 1:250 for mouse anti-Smad4 and 1:1000 of Alexa Fluor® 488 Goat Anti-Mouse IgG (H+L) secondary antibodies (see key resources table[href=https://www.wicell.org#key-resources-table]) with Yap staining done in parallel wells.",
    "Note: Several Yap antibodies have been validated for immunocytochemistry in EpH4 cells (Narimatsu et al., 2016[href=https://www.wicell.org#bib3]). The mouse anti-Yap antibody used in this protocol (see key resources table[href=https://www.wicell.org#key-resources-table]) recognizes both Yap and Taz. Validated alternatives that recognize only YAP are also available (Narimatsu et al., 2016[href=https://www.wicell.org#bib3]).\nSetting up image acquisition and analysis\nTiming: [∼1 h] for step 7\nTiming: [∼1–2 h] for step 8\nTiming: [∼ 1 h] for step 9\nThis step describes the setup for collecting images using IN Cell Analyzer 6000 (Manufacturer, Cytiva (https://www.environmental-expert.com/products/cytiva-model-6000-in-cell-analyzer-581291[href=https://www.environmental-expert.com/products/cytiva-model-6000-in-cell-analyzer-581291])), equipped with 20×/0.75 NA objective and sCMOS 2048×2048 camera. Image analysis using a custom image analysis routine in Columbus Image Data Storage and Analysis System v2.3 (PerkinElmer) is also described.\nAcquisition and image pre-processing for high-content analysis.\nSelect the 20× objective.\nNote: In alternative imaging platforms where the objective requires immersion media other than air, ensure that there is sufficient immersion medium on the objective throughout image acquisition.\nPlace the 96-well plate into the sample holder.\nPosition acquisition points in an unbiased way across all the wells in a plate.\nSet up 3 acquisition channels to acquire: Channel I: DAPI (DAPI channel in IN Cell 6000) Channel II: Alexa Fluor® 488 (FITC channel in IN Cell 6000) Channel III: Alexa Fluor® 546 (dsRed channel in IN Cell 6000)\nThe number of acquisition points should be sufficient to capture 1000 cells per well. A recommendation is to start with 9 fields of view and adjust accordingly.\nFocusing must occur prior to each acquisition.\nSet up the 3D acquisition to acquire 4–6 μm along z-axis to capture the entire cell volume. Spacing between adjacent z-slices must be adjusted depending on objective’s NA.\nAcquire images for wells of interest.",
    "Collapse the 3D datasets into 2D images using the maximum intensity projection method. Alternatively, individual z-slices or 3D rendering may be used to qualitatively examine images. Figure 1[href=https://www.wicell.org#fig1] shows representative images taken using this strategy.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/758-Fig1.jpg\nFigure 1. Representative images of cells used for quantification\nEpH4 cells were transfected with siCTL or siTaz/Yap and then treated with 5 pM TGFβ for 1 h. Cells were fixed, nuclei visualized with DAPI and Smad proteins stained with antibodies against (A) Smad2/3 or (B) Smad4 and representative images, visualized using an IN Cell Analyzer 6000, are shown. Scale bar, 30 μm (Reprinted from (Labibi et al., 2020[href=https://www.wicell.org#bib2]), Figure S1E and S1F).\nNote: Although not amenable to assessment of a large number of samples as in this method, a more accurate estimate of nuclear to cytoplasmic volumes can be obtained using 3D reconstruction from serial light sheet-based fluorescence microscopy optical sections.\nImage analysis\nSegment nuclear masks in the DAPI (or other nuclei counterstained) channel (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/758-Fig2.jpg\nFigure 2. Steps of the image analysis routine\nNuclear (A) and Cellular (B) masks are indicated in the DAPI and FITC channels, respectively. Scale = 50 μm.\nSegment cellular masks in the Smad (Smad2/3 or Smad4) FITC channel (Figure 2[href=https://www.wicell.org#fig2]B).\nIdentify the cytoplasmic mask by subtracting the nuclear segmentation mask from the cell segmentation mask.\nCalculate median intensity for the Smad channel (Channel II, see 7d) within the nuclear segmentation mask (SmadN) and the cytoplasmic segmentation mask (SmadC)\nCalculate the ratio of     S m a  d N    S m a  d C      for each cell within a well.\nFor each well, calculate the median value of all the     S m a  d N    S m a  d C      values obtained for each individual cell in a given well.",
    "Calculate median intensity for the Taz/Yap channel (Channel III, see 7d) within the nuclear segmentation mask (Taz/YapN) and the cytoplasmic segmentation mask (Taz/YapC).\nCalculate the ratio of     T a z / Y a  p N    T a z / Y a  p C      for each cell within a well.\nFor each well, calculate the median value of all the     T a z / Y a  p N    T a z / Y a  p C      values obtained for each individual cell in a given well.\nNote: Steps 8g-i are used to verify that Taz/Yap localization remains constant throughout the experimental conditions.\nCalculate median intensity with a cell mask for the Taz/Yap channel (Channel III, see 7d)\nIdentify cells with high intensity signals (which correspond to wild type cells) and those with low intensity signals, which correspond to Yap/Taz depleted cells.\nNote: Steps 8j and k are used to verify Taz/Yap knockdown efficiency.\nEstimating normalized masses of proteins in the nucleus and cytoplasm\nEstimate the pixels covered by nucleus and cytoplasm (determined by subtracting nucleus from entire cell) and calculate the areas of each region assuming each pixel is 0.325 micrometers.\nCalculate the ratio of the nuclear to cytoplasmic volume. Volume is the base area times height and as a rough approximation, the ratio of the volumes is the same as the ratio of the areas. The ratio of cytoplasmic to nuclear volumes was determined to be 2.52 ± 0.023 for EpH4 cells transfected with siRNAs.",
    "Estimate the normalized cytoplasmic and nuclear masses. Fluorescence data are proportional to concentrations (Schmierer et al., 2008[href=https://www.wicell.org#bib6]), thus, to estimate normalized cytoplasmic and nuclear masses, R and    R v   , the ratios of cytoplasmic to nuclear concentration and volumes, respectively, as defined in Table 3[href=https://www.wicell.org#tbl3] are measured by IF experiments. Then, accordingly the ratio of nuclear to cytoplasmic masses of the proteins,    R m    (Table 3[href=https://www.wicell.org#tbl3]) is calculated.\ntable:files/protocols_protocol_758_11.csv\nConsidering   1 +  R m  = 1 +   M Nuc   M Cyt   =    M Nuc  +  M Cyt    M Cyt    , and since during the signaling period (3 h) there is negligible degradation of the Smad/Taz/Yap proteins as shown by immunoblotting (Labibi et al., 2020[href=https://www.wicell.org#bib2]), by assuming    M Nuc  +  M Cyt  = 100  , the normalized cytoplasmic and nuclear masses of the proteins can be calculated as:    M Cyt  =  100  1 +  R m      and    M Nuc  =   100  R m    1 +  R m     , respectively. Example plots of results are shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/758-Fig3.jpg\nFigure 3. Normalized nuclear and cytoplasmic masses of Smad2/3 and Smad4 upon loss of Taz/YAP expression\nThe nuclear to cytoplasmic ratios obtained by IF imaging were converted into normalized mases by taking into account the volumes of the nucleus and cytoplasm. The gray area indicates the mean +/- SEM of at least 9 biological replicates and the full circles show the average values of the original data. (A) Normalized mass of nuclear Smad2/3, (B) Normalized mass of cytoplasmic Smad2/3, (C) Normalized mass of nuclear Smad4 and (D) Normalized mass of cytoplasmic Smad4. (Reprinted from (Labibi et al., 2020[href=https://www.wicell.org#bib2]), Figure S4 panels B to E).\nConfirmation of knockdown efficiency of Taz and Yap by qPCR\nTiming: [∼ 6 h]",
    "This step describes parallel monitoring of knockdown efficiency of Taz/Yap and the effect on target gene expression by qPCR using cells plated in a 12-well dish as described above (step 2f). The expression levels of Taz, Yap and the Hippo target genes Ankrd1 and Cyr61 are compared in cells transfected with siCTL or siTaz/Yap. The expression levels of the Hippo target genes are expected to be reduced in siTaz/Yap transfected cells.\nRNA isolation, cDNA preparation and qPCR\nIsolate total RNA from siCTL and siTaz/Yap transfected and serum starved (3 h) cells using PureLink RNA Mini Kit according to the manufacturer's instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fpurelink_rna_mini_kit_man.pdf&title=UHVyZUxpbmsgUk5BIE1pbmkgS2l0[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fpurelink_rna_mini_kit_man.pdf&title=UHVyZUxpbmsgUk5BIE1pbmkgS2l0]). Store purified RNA on ice. For long-term storage, store at −80°C.\nDetermine RNA concentration by a NanoDrop One-C.\nUsing 1 μg of total RNA, generate cDNA using oligo (dT) primers and M-MLV reverse transcriptase using standard protocols that include a DNaseI pre-digestion step.\nPerform Real-time PCR using a 2X SYBR Green PCR master mix and validated primers (see key resources table[href=https://www.wicell.org#key-resources-table]) using an appropriate Real-Time PCR instrument such as the QuantStudioTM 6 flex real-time PCR. For each well of a 384-well dish use 6.25 ng of cDNA template and 250 nM of each primer in a 10 μL reaction volume.\nPerform PCR using the following cycle conditions: 1 denaturing cycle of 95°C for 10 min, 40 qPCR cycles of 95°C for 15 s, 60°C for 1 min, and 1 melting curve cycle of 95°C for 15 s, 60°C for 1 min and 95°C for 15 s.\nNormalize gene expression to Hprt and calculate relative expression by the ΔΔCt method.\nImmunoblotting to confirm knockdown efficiency of Taz and Yap\nTiming: [∼ 24 h]",
    "This step describes parallel monitoring of knockdown efficiency of Taz/Yap at the protein level by immunoblotting using extracts from cells plated in 12-well dish (step 2f). The expression levels of Taz/Yap proteins are compared in cells transfected with siCTL or siTaz/Yap.\nPreparation of Cell Lysates, Electrophoresis, and Immunoblotting.\nPlace the 12-well dish of siTaz/Yap or siCTL transfected and serum starved (3 h) cells on ice and wash cells 3 times with 1 mL of ice-cold PBS.\nAdd 150 μL of lysis buffer per well. Rock the plate at 2°C–8°C for 15 min.\nCritical: Prepare the lysis buffer immediately before lysing and keep on ice until use.\nScrape wells with a cell scraper and collect lysates into 1.5 mL microcentrifuge tubes. Centrifuge at 15,000 × g for 10 min.\nCollect supernatants, transfer into new tubes and determine total protein concentration using the Bradford assay (He 2011[href=https://www.wicell.org#bib1]).\nAdjust to achieve equal protein concentrations in all samples, add sample buffer, and heat samples for 5 min at 95°C. Load 15–25 μg of protein per lane and separate by SDS-PAGE gel electrophoresis.\nTransfer proteins to a nitrocellulose membrane using wet transfer.\nBlock membranes using 5% skim milk in TBS-T for 1 h.\nRemove blocking solution and incubate membranes in primary antibodies diluted in TBS-T with 5% skim milk (for mouse anti-Yap, which also recognizes Taz, use 1:1000 and for rabbit anti-Actin use 1:8000) at 2°C–8°C overnight (16–18 h) on a rocker.\nWash membranes with TBS-T buffer 3 times for 10 min each time on a rocker.\nIncubate membranes with HRP-conjugated secondary antibodies (anti-mouse for Yap and anti-rabbit for Actin, diluted 1:5000) in blocking solution at RT (20°C–25°C) for 1 h on a rocker.\nWash membranes with TBS-T buffer 3 times for 10 min each time on a rocker.",
    "Detect chemiluminescent signals using SuperSignalTM substrate as described by the manufacturer (thermofisher.com[href=http://thermofisher.com])<https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0011307_SupSig_West_Dura_Extend_Dur_Subs_UG.pdf&title=VXNlciBHdWlkZTogIFN1cGVyU2lnbmFsIFdlc3QgRHVyYSBFeHRlbmRlZCBEdXJhdGlvbiBTdWJzdHJhdGU[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0011307_SupSig_West_Dura_Extend_Dur_Subs_UG.pdf&title=VXNlciBHdWlkZTogIFN1cGVyU2lnbmFsIFdlc3QgRHVyYSBFeHRlbmRlZCBEdXJhdGlvbiBTdWJzdHJhdGU]) and image using an appropriate instrument such as the Versadoc (BioRad) or other Imager."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cancer",
    "Cell Culture",
    "Cell Biology",
    "Signal Transduction",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}