{
  "id": 15343,
  "origin_website": "Jove",
  "title": "Quantifying Abdominal Pigmentation in Drosophila melanogaster",
  "procedures": [
    "1. Specimen Mounting\nNOTE: Store dead flies in 70% ethanol in water prior to imaging.\nPour 10 mL of 1.25% agar dissolved in boiling water in a 60 mm x 15 mm Petri dish and allow it to set.\nUnder a dissecting microscope, use a pair of fine-point forceps to make a ~20 mm ong, 2 mm wide, 1 mm deep groove in the surface of the gel. Using fine forceps, embed the ventral side of an adult fly in the groove, with the dorsal side of the fly projecting above the gel.\n\tNOTE: The looseness of the gel allows for easy repositioning without damaging the specimen. The same groove can be used for multiple specimens, although it will become dirty, broken-up, and unusable with time. The user can then make another groove in the same gel. Each plate can be used to image ~200 flies.\nCompletely cover the specimen in 70% ethanol in water to reduce any light reflections from the waxy cuticle and to prevent wing damage during specimen manipulation.\n2. Microscope Setup\nNOTE: Images are acquired using a dissecting scope, transmitted light base, digital camera, and gooseneck cold light source attached to a computer running image acquisition control software. Software instructions are specific to Micro-Manager v1.4.2044, which is an open-source software that incorporates ImageJ45.\nTurn on the microscope, digital camera, double gooseneck cold light source, and computer.\nRun the image capture software to open a Micro-Manager window and an ImageJ window. In the ImageJ window click \"Image\" > \"Type\" > \"8-Bit\" to set all images as 8-bit. Click \"live\" in the Micro-Manager window to open a \"Snap/Live\" window showing a real-time preview from the camera.",
    "Maximize the size of the \"Snap/Live\" window if necessary. Select \"Grayscale\" in the pulldown \"Display mode\" menu in the \"Contrast\" tab of the Micro-Manager window.\nTurn on the cold light source to its maximum intensity and position the tips of each gooseneck to approximately 120 mm from the stage, one on the left and one on the right.\n\tNOTE: Users can also use an annular illuminator, although this may generate a ring of reflected light around the fly abdomen.\nManually set the microscope magnification to 60X so that the field of view captures an area approximately 3 mm in diameter on the stage.\nPlace a 2 mm stage micrometer on the stage (switching the background to white if necessary). While looking at the live preview, focus on the stage micrometer and adjust the exposure in the Micro-Manager window by entering the exposure time in ms in the \"Exposure\" box.\nTo spatially calibrate the camera, select the \"straight line\" tool in the ImageJ window and draw a line the length of the stage micrometer. In the ImageJ window click \"Analyze\" > \"Set Scale\" to open the \"Set Scale\" window, enter the length of the micrometer in µm in the \"Known distance\" box, and enter \"µm\" in the \"Unit of length\" box.\nSee that the \"Set Scale\" window then displays the scale in \"pixels/µm.\" Make a note of the scale and click \"OK.\"\nIn the \"Snap/Live\" window, click \"Stop\" and then \"Snap\" to capture an image of the stage micrometer.\nSave the image as an 8-bit grayscale TIFF to ensure the ability to spatially calibrate the images again if necessary. In the ImageJ window click \"File\" > \"Save As\" > \"Tiff…\" Specify where to save the file in the file browser, name the file, and click \"Save.\"",
    "Switch the stage to black and place a Petri dish holding a fly mounted in agar (steps 1.1-1.2) on the stage.\nLook through the microscope and position the fly to ensure that the dorsal midline is straight up in order to best view the pigmentation pattern. Move any wings and appendages to ensure that the view of the abdomen is unobstructed. If the pigmented cuticle (a2-a5) is not visible, squeeze the abdomen laterally until it is (although the abdomen of flies stored in 70% ethanol in water stretch, so that this is not usually necessary).\n\tNOTE: When positioning the fly, the user may need to use a lower magnification (20X). The magnification must be returned to 60X before proceeding.\nManually focus on the dorsal abdomen of the fly. Manually adjust the tips of the light source to minimize the shadows and reflection on the dorsal abdomen.\nWhile looking at the live preview on the computer screen, and using the pixel value histogram in the \"Contrast\" tab of the Micro-Manager window, adjust the exposure as described in step 2.4 to maximize the range of pixel values of the preview image.\nRemove the fly and Petri dish and replace them with an LED (spectral output of 430-660 nm) connected to a voltage meter, centered in the field of view at the same position as the fly. Use the LED and voltage meter as a light meter46 and record the voltage generated by the light striking the LED (~125 mV).\n\tNOTE: The LED and voltage meter are used to ensure that light levels are constant across multiple imaging sessions within a single experiment.\nFor the duration of the experiment, do not further change the position or intensity of the light source, the magnification of the microscope, or the exposure of the camera.",
    "3. Specimen Imaging\nPlace a Petri dish holding a fly mounted in agar (steps 1.1-1.3) on the black microscope stage.Adjust the position of the fly so that the third and fourth abdominal segments are visible and the dorsal midline is straight up, as described in step 2.9. Ensure that the magnification is at 60x before proceeding.\nManually focus the microscope such that the third and fourth dorsal abdominal tergites are in focus. Use the image capture software to acquire an image as an 8-bit grayscale TIFF, as described in step 2.6.\n\tNOTE: The image can be captured in color and subsequently converted to grayscale for analysis.\nSave the image as \"SESH000_sampleID.tiff,\" as described in step 2.7.\n\tNOTE: Here, [SESH] is constant, [000] is the session number and is variable but must be three digits long, and [sampleID] is whatever the user wishes, although it must not contain any additional underscore (_) characters and must be of a constant length. [sampleID] should include details of the factors used in the analysis of the pigmentation data (e.g., temperature or lineage), separated by a distinctive non-alphabetical character, such as a hyphen (-). This allows these factors to be easily parsed out of [sampleID] using standard statistical software.\nRemove the Petri dish from the stage and replace the fly with the next specimen. Repeat steps 3.1-3.3 until all the specimens have been imaged, without further adjusting the lighting levels, magnification, or exposure.\n4. Imaging Across Multiple Sessions\nIf images need to be taken over multiple sessions, maintain the light intensity, exposure, and magnification across sessions. At the beginning of each session, check the spatial calibration of the camera (step 2.4) and the light intensity at the stage (as measured by the LED/voltage meter, step 2.12).",
    "Capture and save an image of the stage micrometer (steps 2.5-2.7) to ensure the ability to spatially calibrate the images again, if necessary.\nUse at least 15 control specimens and randomly re-image them in each session to allow for the detection and elimination of session effects. Ensure that duplicate control specimens between sessions have the same [sampleID] but different [SESH000].\n\tNOTE: The control specimens are flies collected, stored, and mounted identically to experimental specimens but are re-imaged across sessions. The precise number of control specimens will depend on the user's experimental setup. See the discussion for further details.\n5. Image Analysis\nNOTE: Image analysis is conducted in ImageJ45 and uses the \"Measurement of Pigmentation.ijm,\" macro provided as a supplementary file.\nPlace all images to be analyzed in the same folder.\nStart ImageJ and run the \"Measurement of Pigmentation.ijm\" macro by clicking \"Plugins\" > \"Macro\" > \"Run,\" selecting \"Measurement of Pigmentation.ijm\" in the file browser, and clicking \"open.\"\n\tNOTE: All subsequent steps are within the macro. Each step is an individual macro command.\nNote that an \"Action Required\" dialog box opens, stating \"Choose the folder where images are stored.\" Click \"OK\" and use the file browser to select the folder containing the images and then click \"choose.\"\nNote that an \"Action Required\" dialog will box open, stating \"Choose the folder where you want the data to be stored.\" Click \"OK\" and use the file browser to select the desired folder for saving the pigmentation profiles. Click \"choose.\"\nNote that a dialog box will open, asking \"How many characters in your sample ID?\" In the data input box, enter the number of characters in [SampleID], as specified in step 3.3, and click \"OK.\"",
    "Note that a dialog box will open, asking \"How wide is your ROI?\" In the data input box, enter the pixel width of the anterior-posterior strip along which the pigmentation profile is to be read (green rectangle, Figure 1G, Figure 2A, and 2A'). Click \"OK;\" the default is 20 pixels.\n\tNOTE: The pigmentation profile is read across a strip of cuticle, rather than a line, to reduce noise due to hairs and bristles. The width of this strip will depend on the resolution of the image, but it should be ~1/20th of the width of the abdomen, in pixels.\nNote that the macro will open the image of the first fly, and a dialog box will ask whether to measure the current fly (click \"Yes\"), to go on to the next fly (click \"No\"), or to exit the macro (click \"Cancel\").\nNote that a dialog box will open, stating \"Define the midline of the dorsal abdomen, from ANTERIOR to POSTERIOR.\" The \"straight line\" tool will already be selected. Draw a line from anterior to posterior to define the midline of the dorsal abdomen. Click \"OK;\" see Figure 2A and 2A', yellow line.\n\tNOTE: This is used to reorient the image so that the dorsal midline lies horizontally across the screen, with the anterior on the left, making the subsequent steps easier.\nNote that a dialog box will open, stating \"Define the POSTERIOR edge of Tergite 4 just behind the pigment band.\" The \"straight line\" tool will already be selected. Draw a line from the posterior midline edge to the right-lateral edge, such that the center of the line (marked by a white square) sits just posteriorly to the posterior edge of the pigment band (cuticle a5). Click \"OK;\". See Figure 2A and 2A′, magenta line.",
    "NOTE: The R script will automatically detect the posterior edge of the pigment band from the pigmentation profile.\nNote that a dialog box will open, stating \"Define the ANTERIOR edge of Tergite 4 at the anterior edge of the pigmented cuticle (a2).\" The \"straight line\" tool will already be selected. Draw a line from the anterior midline edge to the right-lateral edge, such that the center of the line (marked by a white square) sits at the anterior edge of the pigmented cuticle (cuticle a2). Click \"OK;\". See Figure 2A and 2A', cyan line.\n\tNOTE: The R script will define this point as the anterior edge of the pigmented cuticle of the tergite. On the image, the macro will show the region of interest (ROI) along which the pigmentation profile is read (green rectangle, Figure 2A and 2A′, enlarged in Figure 2B and 2B′). The macro will also open a second window showing the pigmentation profile for the ROI (Figure 2C and 2C′), where the x-axis is the position, expressed as the number of pixels from the posterior edge of the profile, and the y-axis is the average pixel value at each position.\nView the plots of the pigmentation profile that will be opened by the macro. If necessary, click \"Live\" in the profile window to adjust the position of the ROI so that it does not include any structures (e.g., bristles) that would influence the pigmentation profile. Once the profile is satisfactory, click \"OK.\"\nRepeat steps 5.8-5.11 for Tergite 3.\n\tNOTE: The macro then exports the pigmentation profiles as two CSV files, each named \"SESH000_samplename_TX_profile.csv,\" where [SESH000_samplename] is the image name and [TX] is either T3 or T4 for the third and fourth tergites, respectively.",
    "Note that the macro opens the next image. Repeat steps 5.7-5.13 until all images have been analyzed.\n6. Data Preprocessing, Analysis, and Session Correction\nNOTE: All data analysis is conducted in R47 and uses the \"Analysis of Pigmentation.R\" script provided. Below, \"L…\" indicates which line(s) of the script to run for each part of the analysis. See the Supplementary Information for additional details on how the analysis is conducted.\nEdit the R script to set the working directory (L6) and define the filepath to the folder containing the.csv profiles (L11).\nRun L13-15 to generate a list of the pigmentation profiles stored in the profile folder.\nLoad and run the \"reader\" and \"addPrimaryKey\" functions (L17-41) to read the profiles into a single data frame.\nEdit the script at L43 to specify the spatial calibration of the images in µm/pixels, as determined in step 2.5.\nLoad and run the \"adjustments\" function (L46-58) to convert the profile position (x-axis, Figure 2C and 2C′) from pixels-from-posterior-edge-of-ROI to µm-from-anterior-edge-of-ROI and the profile value (y-axis, Figure 2C and 2C′) from the pixel value (0 = black, 255 = white) to the pigmentation value (0 = no pigment, 255 = maximum pigment).\nLoad and run the \"spline.der.er\" function (L60-71) to generate the cubic spline of the pigmentation profiles and its first and second derivatives (Figure 2D-2F and 2D′-2F′).\nLoad and run the \"coord\" and \"assmbly.coord\" functions (L74-163), first to extract the position of the posterior (T3) and anterior (T2) edges of the pigment band (Figure 2D and 2D′) and the posterior edge of the a2 cuticle (T1, Figure 2D and 2D′), and then to extract the maximum (Pmax) and minimum (Pmin) pigmentation values, taken at T3 and T1, respectively.\n\tNOTE: The anterior edge of the a2 cuticle has already been defined in step 5.9.",
    "Optional: Load and run the \"chek\" function (L165-175) to check whether the \"coord\" function is correctly identifying positions T1-3 for a randomly selected pigmentation profile.\nLoad and run the index and metrics functions (L178-193) to generate a data table with the headings \"Session,\" \"Sample,\" \"Tergite,\" \"id\" (a concatenation of Sample and Tergite), \"Pmax,\" \"Pmin,\" \"Wband\"(width of the pigment band, = T3 - T2), and \"Wtergite\"(width of the pigmented cuticles a2-a5, = T3).\nLoad and run the \"correction\" function (L196-234) to generate a data table that corrects Pmax and Pmin for any nuisance factors arising due to session effects. Use the average increase (or decrease) in Pmax or Pmin from the control specimens re-imaged across temporally adjacent sessions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}