{
  "id": 7586,
  "origin_website": "Bio",
  "title": "RNA Interference Method for Gene Function Analysis in the Japanese Rhinoceros Beetle <em>Trypoxylus dichotomus</em>",
  "procedures": [
    "Search target regions of dsRNASearch target mRNA in RNA-seq database of Trypoxylus dichotomus (Ohde et al., 2018; Zinna et al., 2018).Search for target regions of dsRNA.Note: The lengths of target regions range from 150 bp to 600 bp. The target region should have low homology with any other T. dichotomus gene to avoid off-target effects. Therefore, it is desirable to not include any domains in the target design. Furthermore, the target region is checked for homology with other T. dichotomus genes, by performing a blastn search in the T. dichotomus database. dsRNA should be redesigned in other regions, if consecutive regions of 25-bp or more homological with other T. dichotomus genes are included. Add the adapter sequence 5’-AACGAATTCGCCCTT-3’ at the 5’ end of the dsDNA, and the sequence 5’-AAGGGCGAATTCGCG-3’ at the 3’ end of dsDNA.Note: The final sequence is as follows: 5’-AACGAATTCGCCCTT-[the sequence in the target region of dsRNA]-AAGGGCGAATTCGCG-3’. The adapter sequences are designed to be homologous with both ends of the pCR 4-TOPO vector (Invitrogen, catalog number: K457502). Synthesize the above sequences using a dsDNA synthesis service (e.g., IDT eBlocks).Synthesize dsDNAAdd the T7 promoter sequences at both ends of dsDNA, by performing PCR using the following primers: 5’-taatacgactcactatagggAACGAATTCGCCCTT-3’ [melting temperature (Tm) = 74°C] and 5’-taatacgactcactatagggCGCGAATTCGCCCTT-3’ (Tm = 78°C).Note: T7 promoter sequences are written in lowercase and underlined. The primers can also be used to attach T7 promoter sequences to inserts that are subcloned into the pCR 4-TOPO vector. Perform PCR with a reaction mixture in which dsDNA (10–100 ng) synthesized in step A-4 is added as a template.",
    "Note: The following steps constitute the PCR reaction: the initial denaturing step is 98°C for 30 s, followed by 30 cycles of denaturing at 98°C for 10 s, annealing at 55°C for 30 s, and an extension of for 60 s per 1 kb at 72°C, with an additional step of 72°C for 5 min. React about four 50 µL-reaction mixture tubes per target gene, to obtain more than 1 µg of dsDNA. Collect PCR products from step B-2 into a 1.5-mL microtube (50 µL × 4 = total of 200 µL).Add a sufficient amount of 1× TAE and 1 % agarose gel into the electrophoresis chamber.Load a 100-bp DNA Ladder into the 1 % agarose gel well.Load 5 μL of PCR product mixed (step B-3) with 1 μL of 6× DNA loading dye into a well.Perform electrophoresis on full power (100 V) for 30 min.Using a gel imaging device, check whether the PCR product size corresponds to the expected size.Purify the PCR product from step B-3 with Monarch PCR & DNA Cleanup Kit (5 μg), according to the manufacturer’s instructions.Note: dsDNA is eluted with 100 µL of elution buffer. Make dsDNA solution RNase-free.Note: Lay aluminum foil on the laboratory table, and make the workplace and the experimental materials and equipment RNase-free with RNase AWAY. Wear rubber gloves. Add 100 μL (equal to the volume of dsDNA solution) of Phenol/Chloroform/Isoamyl alcohol (PCI) to the result from step B-9 and vortex.Centrifuge at 13,000 × g and 25°C for 15 min.Transfer upper layer to new 1.5-mL RNase-free microtube.Add 100 μL (equal to the volume of dsDNA solution) of chloroform, and vortex.Centrifuge at 13,000 × g and 25°C for 5 min.Transfer upper layer to new 1.5-mL RNase-free microtube.Add 250 μL (2.5-fold the volume of dsDNA solution) of ethanol, and 10 μL (0.",
    "1-fold the volume of dsDNA solution) of 3 M Sodium Acetate (pH 5.2), and vortex.Centrifuge at 20,400 × g and 4°C for 15 min .Discard the supernatant.Add 250 μL of 70% ethanol solution, made with UltraPure water (UPW), and vortex.Centrifuge at 20,400 × g and 4°C for 5 min.Discard the supernatant.Open the lid of the tube, and dry for 5 min.Add <7.3 µL of UPW.Mix 1 µL of dsDNA solution from step B-10-n, and 9 µL of UPW, to make a 10-fold dilution.Measure the concentration of the 10-fold diluted dsDNA solution from step B-10-o with the spectrophotometer.Synthesize dsRNASynthesize dsRNA with 1 µg of dsDNA and AmpliScribeTM T7-FlashTM Transcription Kit according to the manufacturer’s instructions.Purify dsRNANote: Lay aluminum foil on the laboratory table, and make the workplace and the experimental materials and equipment RNase-free with RNase AWAY. Wear rubber gloves. Add 80 μL of UPW to the result from step C-1, for a total volume of 100 µL.Add 100 μL (equal to the volume of dsRNA solution) of PCI, and vortex for 30 s.Centrifuge at 13,000 × g and 25°C for 15 min.Transfer the upper layer to a new 1.5-mL RNase-free microtube.Add 100 μL (equal to the volume of dsRNA solution) of chloroform, and vortex for 30 s.Centrifuge at 13,000 × g and 25°C for 5 min.Transfer the upper layer to a new 1.5-mL RNase-free microtube.Add 250 μL (2.5-fold the volume of dsRNA solution) of ethanol, and 10 μL (0.1-fold the volume of dsRNA solution) of 3 M Sodium Acetate (pH 5.2), and vortex for 30 s.Centrifuge at 20,400 × g and 4°C for 15 min.Discard the supernatant.Add 250 μL of 70% ethanol solution made with UPW, and vortex for 30 s.Centrifuge at 20,400 × g and 4°C for 5 min.Discard the supernatant.",
    "Open the lid of the tube, and dry for <5 min.Note: Do not dry RNA pellets for too long. Add 20 μL of UPW.Incubate the tube containing dsRNA solution from step C-2-o in a heat block at 65°C for 10 min.Transfer the aluminum block of the heat block into a Styrofoam™ container, and cool it to room temperature, to anneal the dsRNA (Figure 2A).Take an aliquot of the annealed dsRNA, and dilute it with UPW for quantification. We routinely dilute 1 µL of the dsRNA solution from step C-2-o with 9 µL of UPW.Measure the concentration of 1 µL of 10-fold diluted dsRNA solution from step C-2-r with the spectrophotometer.Add a sufficient amount of 1× TAE and 1% agarose gel into the electrophoresis chamber.Load 100-bp DNA Ladder into the 1% agarose gel well.Load 9 μL of 10-fold diluted dsRNA solution from step C-2-s mixed with 2 μL of 6× DNA loading dye into a well.Perform electrophoresis on full power (100 V) for 30 min.Check the concentration, and whether the dsRNA product size is the same as expected.Add UPW to dsRNA solution.Note: It is helpful to adjust the final concentration of the dsRNA solution to 5 µg/µL. Store at −30°C until use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4396/bioprotoc-12-08-4396-g002.jpgFigure 2. dsRNA annealing process. A. The annealing process of dsRNA. B. Evaluation of dsRNA patterns via the annealing process. Lane 1; 100 bp DNA ladder. Lane 2; dsRNA before the annealing process looks smeared. Lane 3; dsRNA after the annealing process resembles a sharp band.Inject dsRNA in Trypoxylus dichotomus Note: EGFP is used as negative control. Mix dsRNA (50–100 µg) and UPW.Note: The final volume of dsRNA solution should be 50 µL. Wear rubber gloves.Softly hold the larva of T. dichotomus (Figure 3A).Suck dsRNA aqueous solution using a 1-mL syringe with a 30-gauge needle.",
    "Pierce the needle at the lateral body wall of the first thoracic segment (T1) of a larva, and inject the solution into the hemocoel, just beneath the epidermis (Figure 3B and C).Note: It is possible for bubbles to be injected in T. dichotomus to a small extent. Place the larva in a bottle filled with humus, and incubate it at room temperature (24–28°C) until the larva develops into the pupa or the adult.Observe the phenotype in the pupa and/or the adult.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4396/bioprotoc-12-08-4396-g003.jpgFigure 3. Injection of dsRNA into third instar larvae of Trypoxylus dichotomus. A. How to hold a larva during the injection. To prevent a larva from moving its head during injection, place your thumbnail under the mandible and push the larval head upward. B. Injection of dsRNA into third instar larvae. C. A highly magnified view of the injection point in the first thoracic (T1) body segment. dsRNA is injected into the T1 of a larva. The needle should be inserted about 2 mm beneath the epidermis. The needle should be held in place for 10 sec after dsRNA injection, to prevent the backflow of dsRNA."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}