{
  "id": 19620,
  "origin_website": "Jove",
  "title": "Affinity Purification of Chloroplast Translocon Protein Complexes Using the TAP Tag",
  "procedures": [
    "1. Preparation of Arabidopsis Plants\nPrepare 1 L of half strength of Murashige and Skoog (MS) medium including vitamins with 1% sucrose and adjust the pH to 5.7 with potassium hydroxide (KOH). Add 0.8% of phytoagar and autoclave for 20 min at 120 °C.\nPour 75 mL of MS medium per Petri plate (diameter 14.5 cm, height 3 cm) and allow the solidification for 1 h.\nAdd 30 mg of Arabidopsis thaliana seeds to a 1.5 mL microfuge tube, and surface sterilize with 70% (v/v) ethanol containing 0.05% (v/v) Triton X-100 for 5 min, followed by 100% (v/v) ethanol for 10 min. Remove the ethanol.\nTransfer the seeds to sterile filter paper for drying. Sprinkle the sterilized seeds evenly onto a MS plate (each genotype requires at least 8-10 plates), and seal each plate with surgical tape.\nIncubate the plates at 4 °C for two days in the dark to synchronize seed germination. Transfer to a growth chamber with the following light cycle: 8 h of 120 µmol m−2 s−1 light, and 16 h of dark at 22-20 °C.\n2. Preparation of HsIgG Agarose Beads\nSuspend CNBr-activated agarose beads (4 g) in 100 mL of 1 mM HCl and incubate for 30 min at room temperature.\nTransfer the agarose beads into a sintered glass filter, wash under vacuum with 100 mL of 100 mM HCl and repeat 2-3 times.\n\tNOTE: Precool the wash solution to 4 °C.\nResuspend the agarose beads in 1 mL of cold 100 mM HCl and transfer to a 50 mL conical centrifuge tube. Wash the sintered glass filter with 3 mL of 100 mM HCl and transfer the liquid to the same tube.\nSpin at 400 × g for 5 min at 4 °C and remove the supernatant with a pipette.",
    "NOTE: Do not decant the tube.\nResuspend the beads in 50 mL of coupling buffer (Table 1); mix briefly, and then spin at 400 × g for 5 min at 4 °C.\nDissolve 50 mg of lyophilized Homo sapiens IgG (Hs-IgG) in 10 mL of coupling buffer, mix the agarose beads gently, and incubate in rotary shaker overnight at 4 °C.\nSpin at 400 × g for 5 min at 4 °C and remove the supernatant with a pipette.\nWash the IgG-agarose beads with 50 mL of coupling buffer and spin at 400 × g for 5 min at 4°C.\nResuspend the IgG-agarose beads with 50 mL of blocking buffer (Table 1) and spin at 400 × g for 5 min at 4 °C. Repeat once.\nResuspend IgG-agarose beads in 50 mL of blocking buffer, rotate the mixture for 2 h at RT and spin at 400 × g for 5 min at 4 °C.\nRemove the supernatant and resuspend the IgG-agarose beads in 200 mL of NaCl coupling buffer (Table 1).\nTo block any remaining cross-linking CNBr groups, wash the IgG-agarose beads with 100 mL of 0.1 M glycine-HCl, pH 2.8. Spin at 400 × g for 5 min at 4 °C and remove the supernatant. Wash with 0.2 M glycine-HCl, pH 2.8, spin at 400 × g for 5 min at 4 °C and remove the supernatant. Finally, wash the IgG-agarose beads with 200 mL of ultrapure water.\nWash the IgG-agarose beads with 200 mL of ultrapure water and then 200 mL of PBS buffer (Table 1).\nResuspend the IgG-agarose beads in 20 mL of PBS buffer with 0.01% NaN3 (sodium azide) and store at 4 °C.\n3. Isolation and Solubilization of the Membrane Fraction",
    "Grind 10 g of three weeks old A. thaliana seedlings in liquid nitrogen using a cold mortar and pestle with sand.\nAdd 20 mL of cold grinding buffer (Table 1) to 10 g of ground tissue, mix well, and thaw on ice.\nFilter the homogenate through two layers of quick filtration material into a 50mL conical centrifuge tube. Soak the quick filtration material with grinding buffer before filtration.\nCentrifuge the filtrate for 10 min at 1,500 × g at 4 °C and transfer the supernatant to a chilled 50 mL conical centrifuge tube, repeat the same step one more time and collect the supernatant. Retain a 200 µL sample of the \"total fraction\" and store at -80 °C for later analysis\nTransfer the supernatant to cold 38.50 mL ultracentrifuge tubes and top up to 35 mL with cold grinding buffer. Centrifuge for 1 h at 100,000 × g at 4 °C in an ultracentrifuge.\nTransfer the supernatant to a 50 mL conical centrifuge tube. Retain a 200 µL sample of the \"soluble fraction\" and store at -80 °C for later analysis.\nRe-suspend the green pellet using a glass teflon homogenizer, in grinding buffer. Centrifuge for 1 h at 100,000 × g at 4 °C in an ultracentrifuge and discard the supernatant.\nResuspend the green pellet in 18.75 mL of 1x grinding Buffer using a glass teflon homogenizer and add 9.375 mL of 1x grinding buffer.\nAdd 9.375 mL of 4x solubilisation solution (Table 1) (containing the TX-100 detergent) to give 37.5 mL and incubate for 30 min on a \"rotating shaker\" at 4 °C.",
    "Centrifuge for 1 h at 100,000 × g at 4 °C in an ultracentrifuge. Transfer the supernatant to a 50 mL conical centrifuge tube. Retain a 200 µL sample of the supernatant (future \"load fraction\") and store at -80 °C for later analysis.\nResuspend the pellet in 37.5 mL of grinding buffer. Retain the sample of insoluble part and store at -80 °C\n4. Immunoprecipitation\nEquilibrate 100 µL of packed IgG-agarose resin in Buffer A (Table 1) and spin at 100 × g for 5 min at 4 °C.\nRemove the supernatant and resuspend the IgG-agarose resin in 100 µL of Buffer A at 4 °C.\nTransfer the washed IgG-agarose resin to the 37.5 mL of solubilized membranes and incubate overnight on a rotating shaker in a 50 mL conical centrifuge tube at 4 °C.\nSediment the IgG-agarose resin at 100 × g for 5 min at 4 °C and remove the supernatant with a pipette. Retain a 200 µL sample of the \"flow through\" and store at -80 °C for later analysis.\nWash the IgG-agarose resin in 37.5 mL of Buffer A and incubate for 10 min on a rotating shaker.\nSediment the IgG-agarose resin at 100 × g for 5 min at 4 °C, remove the supernatant with a pipette, add 5 mL of grinding Buffer A to a 15 mL centrifuge tube and centrifuge at 100 × g, 4 °C, 5 min. Retain a 200 µL sample of the \"Wash 1\" and store at -80 °C for later analysis.\nRepeat the 5 mL washing step three times with Buffer A.\nCarry out the last two washing steps without the inhibitors (NaF, Protease inhibitor and PMSF)",
    "NOTE: Inhibitors are no longer required at this stage and omitted to reduce cost. Retain a 200 µL sample of the last washing step \"final wash (W6)\" and store at -80 °C for later analysis.\nTransfer the IgG-agarose resin to a 500 µL spin column with a 35 µm filter and wash the beads twice with 300 µL of TEV elution buffer (Table 1) (not containing AcTEV) for equilibration. Close the spin column.\nAdd 300 µL of TEV elution buffer containing 50 units (10 µL) of AcTEV. Prepare the mix in a tube before adding to the resin.\nIncubate the spin column with beads in a thermomixer at 16 °C, 350 rpm for 2 h. Invert the column gently several times every 30 min.\nOpen the spin column, place it in a new clean 1.5 mL tube and spin at 100 × g for 5 min at 4 °C to collect the eluate.\nDry (for instance) 10% (v/v) of the eluted sample (~25 µL) in a centrifugal evaporator and use for mass spectrometry or other further analysis.\nAliquot the remaining eluate (~275 µL) divided in to eleven 1.5 mL centrifuge tubes (25 µL each), dry in a centrifugal evaporator, and store at -80 °C.\nAnalyze the samples retained throughout the procedure as well as the eluates by standard SDS-PAGE followed by immunoblotting. For sample preparation, precipitate 50 µg of Total (T), Load (L), Flow through (FT), Wash 1 (W1) and 200 µL of Wash 6 (W6) by chloroform/methanol extraction16.\nAdd 10 µL of 2x SDS-PAGE loading buffer (Table 1) to the precipitated samples and 25 µL of eluted dried sample. Vortex and boil for 10 min at 95 °C in a heat block.",
    "Analyze Total (T), Load (L), Flow through (FT), Wash 1 (W1), Wash 6 (W6) and Elution (E) by immunoblotting using anti-TOC159 antibodies to determine the efficiency of the isolation procedure."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}