{
  "id": 9924,
  "origin_website": "Jove",
  "title": "Nuclear Magnetic Resonance Spectroscopy for the Identification of Multiple Phosphorylations of Intrinsically Disordered Proteins",
  "procedures": [
    "1. Production of 15N, 13C-Tau (Figure 1)\nTransform pET15b-Tau recombinant T7 expression plasmid13,14 into BL21(DE3) competent Escherichia coli bacterial cells15.\n\tNOTE: the cDNA coding for the longest (441 amino acid residues) Tau isoform is cloned between NcoI and XhoI restriction sites in the pET15b plasmid.\n\t\nMix gently 50 µl of competent BL21(DE3) cells, forming 1-5 x 107 colonies per µg of plasmid DNA, with 100 ng of plasmid DNA in a 1.5 ml plastic tube.\n\t\tNOTE: Codon-usage optimized bacterial strains for eukaryotic cDNA expression are not essential to produce human Tau.\nPlace the cell mixture on ice for 30 min and then heat shock for 10 sec at 42 °C. Place the tube back on ice for 5 min and add 1 ml of room temperature LB (Luria-Bertani) medium. Incubate the bacterial suspension at 37 °C for 30 min under gentle agitation.\nSpread using an inoculation loop 100 µl of cell suspension evenly onto an agar plate of LB medium containing 100 µg/ml of ampicillin antibiotic.\nIncubate the selection plate for 15 hr at 37 °C.\nKeep the selection plate at 4 °C until proceeding to the culture step, for a maximum of 2 weeks approximately.\n\tNOTE: a glycerol stock of bacterial culture (50% glycerol), stored at -80 °C, can be prepared to start the culture at a later stage.\nAdd 1 ml 1 M MgSO4, 1 ml 100 mM CaCl2, 10 ml 100x MEM vitamin complement, 1 ml 100 mg/ml ampicillin to 1 L of autoclaved M9 salts (6 g Na2HPO4, 3 g KH2PO4, 0.5 g NaCl).\n\tNOTE: A white precipitate will form upon addition of the CaCl2 solution to the M9 salts that quickly dissipates.",
    "Solubilize 300 mg of 15N, 13C-complete medium, 1 g of 15NH4Cl and 2 g of 13C6-glucose in 10 ml of M9 medium. Filter-sterilize the isotope solution using a 0.2 µm filter, directly into the M9 medium.\nSuspend using an inoculation loop one colony of pET15b-Tau transformed bacteria from the selection plate in 20 ml of LB medium supplemented with 100 µg/ml of ampicillin.\nIncubate the inoculated medium at 37 °C for about 6 hr.\nMeasure optical density at 600 nm (OD600) on 1 ml of a ten-fold dilution of bacterial culture in a plastic spectrometer cuvette.\n\tNOTE: Turbidity of the bacterial culture corresponding to OD600 of 3.0-4.0 indicates that saturation growth phase is reached.\nAdd 20 ml of the saturated LB culture to 1 L of M9 growth medium supplemented with ampicillin (100 µg/ml final concentration), in 2 L Erlenmeyer plastic baffled culture flask.\nPlace the culture flask in a programmable incubator set to 10 °C and 50 rpm. Program the incubator to switch to 200 rpm and 37 °C early in the morning of the next day.\nMeasure OD600 on 1 ml of bacterial culture in a plastic spectrometer cuvette. Add 400 µl of 1 M IPTG (isopropyl β-D-1-thiogalactopyranoside) stock solution (kept at -20 °C) when OD600 reaches a value of about 1.0 to induce the expression of recombinant Tau protein.\nContinue the incubation at 37 °C for a further 3 hr. Collect the bacterial cells by centrifugation at 5,000 x g for 20 min.\nFreeze the bacterial pellet at -20 °C. Keep frozen until the purification step, for an extended period if needed.\n2. Purification of 15 N, 13 C-Tau (Figure 2)\nAutoclave cation-exchange (CEX) purification buffers at 121 °C under 15 psi for 20 min. Store buffers at 4 °C.",
    "Thaw the bacterial cell pellet and resuspend thoroughly in 45 ml of extraction CEX A buffer (50 mM NaPi buffer pH 6.5, 1 mM EDTA) freshly supplemented with protease inhibitor cocktail 1x (1 tablet) and DNAseI (2,000 units).\nDisrupt the bacterial cells using a high-pressure homogenizer at 20,000 psi. 3-4 passes are necessary. Centrifuge at 20,000 x g for 40 min to remove insoluble material.\nHeat the bacterial cell extract for 15 min at 75 °C using a water bath.\n\tNOTE: a white precipitate is observed after a few minutes.\nCentrifuge at 15,000 x g for 20 min and keep the supernatant containing the heat-stable Tau protein.\nStore at -20 °C until the following purification step, if needed.\nPerform a cation-exchange chromatography on a strong CEX resin packed as a 5 ml bed column using a fast protein liquid chromatography (FPLC) system (Figure 3 A).\n\t\nSet flow rate to 2.5 ml/min.\nEquilibrate the column in CEX A buffer\nLoad the 60-70 ml heated-extract containing Tau using a sample pump, or alternatively pump A, depending on the system. Collect the flow-through for analysis to verify that Tau protein is efficiently binding to the resin (see 2.8).\nWash the resin with CEX A buffer until absorbance at 280 nm is back to baseline value.",
    "Elute Tau from the column using a three-step NaCl gradient obtained by gradual increase of CEX B buffer (CEX A buffer with 1 M NaCl). Program the FPLC as follows: first step of the gradient to 25% CEX B buffer in 10 column volumes (CV) to reach 250 mM NaCl, second step to 50% CEX B buffer in 5 CV to reach 500 mM NaCl, and third step to 100% CEX B buffer in 2 CV to reach 1 M NaCl. Collect 1.5 ml fractions during the elution steps.\nAnalyze 10 µl of the fractions collected during the elution step by SDS-PAGE (12% SDS-acrylamide gel) and Coomassie staining (Figure 3 A)16. Check the loading step on the column as well by analyzing 10 µl of the flow-through.\nChoose the fractions containing Tau and pool these fractions for the next step.\nPerform a buffer exchange on Tau-containing pooled fractions (Figure 3 B).\n\t\nEquilibrate a desalting column of 53 ml G25 resin packed bed (26 x 10 cm) in 50 mM ammonium bicarbonate (volatile buffer) using a FPLC system.\nSet flow rate to 5 ml/min. Inject the Tau sample on the column via a 5 ml injection loop. Collect fractions corresponding to the absorption peak at 280 nm.\nRepeat the injection 3-4 times, depending on the volume of the initial CEX pool.\nCalculate the amount of purified Tau protein by using the peak area of the chromatogram at 280 nm (1 mg of Tau corresponds to 140 mAU*ml).\n\tNOTE: The extinction coefficient of Tau protein at 280 nm is 7,550 M-1cm-1. Tau does not contain any Trp residues.\nPool all Tau fractions.",
    "Aliquot the sample into tubes containing the equivalent of 1 to 5 mg of Tau. Choose these tubes so that the volume of solution is small compared to the volume of the tube (for example 5 ml of solution in a 50 ml tube).\nPunch holes in the tube caps using a needle. Freeze Tau samples at -80 °C.\nLyophilize Tau samples. Lyophilized Tau protein can be kept at -20 °C for long periods of time.\n3. In Vitro Phosphorylation of 15N-Tau\nDissolve 5 mg of lyophilized Tau in 500 µl phosphorylation buffer (50 mM Hepes·KOH, pH 8.0, 12.5 mM MgCl2, 1 mM EDTA, 50 mM NaCl).\nAdd 2.5 mM ATP (25 µl of 100 mM stock solution kept at -20 °C), 1 mM DTT (1 µl of 1 M stock solution kept at -20 °C), 1 mM EGTA (2 µl of a 0.5 M stock solution), 1x protease inhibitor cocktail (25 µl of a 40x stock obtained by dissolving 1 tablet in 1 ml phosphorylation buffer) and 1 µM activated His-ERK2 (250 µl in conservation buffer 10 mM Hepes, pH 7.3, 1 mM DTT, 5 mM MgCl2, 100 mM NaCl and 10% glycerol, stored at -80 °C) in a total sample volume of 1 ml.\n\tNOTE: The activated His-ERK2 can be prepared in-house5,8 by phosphorylation with the MEK kinase.\nIncubate 3 hr at 37 °C.\nHeat the sample at 75 °C for 15 min to inactivate ERK kinase.\nCentrifuge at 20,000 x g for 15 min. Collect and keep the supernatant.\nDesalt the protein sample into 50 mM ammonium bicarbonate using a column of 3.45 ml G25 resin packed bed (1.3 x 2.6 cm), which is suitable for a 1 ml sample.",
    "Run a 12% SDS-PAGE16 with 2.5 µl of the protein sample to check both its integrity and efficient phosphorylation (Figure 4).\nLyophilize the phosphorylated Tau sample. Store the powder at -20 °C.\n4. Acquisition of NMR Spectra (Figure 5)\nSolubilize 4 mg of lyophilized 15N, 13C ERK-phosphorylated-Tau in 400 µl NMR buffer (50 mM NaPi or 50 mM deuterated Tris-d11.Cl, pH 6.5, 30 mM NaCl, 2.5 mM EDTA and 1 mM DTT).\nAdd 5% D2O for field locking of the NMR spectrometer and 1 mM TMSP (3-(trimethylsilyl)propionic-2,2,3,3-d4 acid sodium salt)) as internal NMR signal reference. Add 10 µl of a 40x stock solution of complete protease inhibitor cocktail.\nTransfer the sample in a 5 mm NMR tube using an electronic syringe with a long needle or Pasteur pipette. Close the NMR tube using the plunger. Remove any air bubble trapped between plunger and liquid by plunger movements.\nPlace the NMR tube in a spinner. Adjust its vertical position in the spinner with the appropriate gauge for the NMR probe head used, such that most of the sample solution will be inside the NMR coil.\nStart the air flow: click lift in the magnet control system window. Carefully place the spinner with the tube in the airflow at the top of the magnet bore. Stop the air flow (click lift) and let the tube descend into place inside the probe head in the magnet.\nSet temperature to 25 °C (298 K).\nPerform semi-automatic tuning and matching of the probe head to optimize power transmission. Type atmm on the command line.\nLock the spectrometer frequency using the D2O signal of the sample recorded on the deuterium channel. Click lock in the magnet control system window.",
    "Start the shimming procedure to optimize homogeneity of the magnetic field at the position of the sample. Type topshim gui on the command line to open the shim window. Click start in the shim window. Check the residual B0 standard variation value to verify that shims are optimal (less than 2 Hz is good).\nCalibrate the p1 parameter (length of a proton radiofrequency pulse in µsec), which is necessary to obtain a 90° rotation of proton spins. Aim for the 360° pulse using a 1D spectrum of water protons (Figure 6).\nAdjust the frequency offset by setting the o1 parameter (in Hz) to the proton water frequency in the 1D spectrum (Figure 6).\nStart acquisition of a 1D proton spectrum (pulse sequence with watergate sequence for water signal suppression, for example zggpw5) to verify signals from the sample (Figure 7). Adapt the number of scans to the relative protein concentration. Type zg on the command line to start the acquisition.\nSet up additional parameters for the acquisition of a 2D [1H,15N] HSQC spectrum (pulse sequence hsqcetfpf3gpsi, Figures 8-9).\n\t\nFor a 15N,13C labeled sample, decouple 13C during the 15N indirect evolution.\nSet the number of points and the spectral width (ppm) in the 1H (F2) and 15N (F1) dimensions.\n\t\tNOTE: Adapt the number of acquisition data points to the spectrometer field to keep a similar number of Hz per point and to limit decoupling times: use 3,072 points at 900 MHz and 2,048 points at 600 MHz, in the 1H dimension.\nOptimize additional parameters in the pulse sequences, corresponding to delays, pulse lengths, offset frequencies, power levels. Type ased on the command line to display all parameters relevant for the experiment.\nSet parameters for the acquisition of a 3D [1H,15N,13C] HNCACB spectrum (pulse sequence hncacbgpwg3d, Figure 10A) at 600 MHz.",
    "Set parameters for a 3D [1H,15N,15N] HNCANNH experiment (pulse sequence hncannhgpwg3d) at 600 MHz. Set the number of points to 2048 in the 1H and, 64 and 128 points in the two 15N dimensions. Define the spectral widths as 14, 25, 25 parts per million (ppm) centered on 4.7, 119, 119 ppm in the 1H, 15N and 15N dimensions. Duration of acquisition with 16 scans is 1 day and 22 hr.\n5. Identification of Phosphorylation Sites\nProcess spectra using acquisition and processing NMR software.\n\t\nPerform a Fourier transformation of the data (Figure 7). Type ft for a 1D spectrum, xfb for a 2D spectrum or ft3d for a 3D spectrum, on the command line.\nPhase and reference all spectra (Figure 7C) using the interactive windows.\nIdentify resonances of interest in the 2D HSQC potentially corresponding to phosphorylated Ser and Thr residues (Figure 9, red box).\nExtract planes (i.e. 2D 1H-13C spectra) from the 3D 1H-15N-13C spectrum using the 15N chemical shifts of resonances of interest in the 2D. Use the cursor of dimension 2 (w2) to choose the 15N frequency corresponding to the plane (w1-w3) to be visualized (Figure 10B).\nPick the resonance frequencies of 'CA' and 'CB' 13C nuclei of the 'i' and 'i-1' residues (weaker set of signals compared to those of the i residue) for each [1H, 15N] resonance of interest in the HNCACB 3D spectrum by clicking on the resonance, in pointer mode menu find/add peak, to add the chemical shift value in a peak list file.\n\t\nIdentify the i residue type, pSer or pThr, by comparing the chemical shifts in the peak list to known values of CA and CB chemical shifts of pSer and pThr17.",
    "Identify the presence of a Pro residue at the i+1 position by a characteristic additional +2 ppm shift of the CA chemical shift value18.\nCompare the chemical shift values of the CA and CB resonances corresponding to the i-1 residue to a table of chemical shifts predicted for Tau amino acid residues19 to identify the nature of the residue at the i-1 position.\nPick the resonance frequencies of 15N nuclei of the 'i' and 'i-1' residues for each [1H, 15N] resonance of interest in the HNCANNH spectrum.\nCompare the 15N chemical shift values to the chemical shift assignment of the Tau protein20-23.\nCompare the identified dipeptides with the Tau sequence to define the sequence specific assignment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}