{
  "id": 8508,
  "origin_website": "Jove",
  "title": "Morphological and Functional Evaluation of Axons and their Synapses during Axon Death in Drosophila melanogaster",
  "procedures": [
    "1. Observation of Axon Morphology During Axon Death in the PNS\nWing injury: partial injury of axon bundles\n\t\nUse 5 virgin females and 5 males from the right genotype (Figure 4A, P0 generation) to perform crosses at room temperature (RT). Pass P0 into new vials every 3–4 days. Collect freshly eclosed adult progeny (F1 generation) daily and age them for 7–14 days.\nAnesthetize flies on CO2 pads. Use micro scissors to cut the anterior wing vein roughly in the middle of the wing (Figure 1A). Use one wing for the injury and the other wing as an age-matched uninjured control. Apply one injury per wing, and make sure to get sufficient wings injured (approximately 15 wings).\n\t\tNOTE: The whole wing can be cut through, but it is sufficient to cut only the anterior wing vein. This is the strongest part of the wing.\nRecover the flies in food-containing vials.\nWing dissection and visualization of axons\n\t\nSpread 10 µL of halocarbon oil 27 with a pipette along a whole glass slide (Figure 1B).\nCut off the injured, as well as, the uninjured control wing at desired time points (e.g., 1 or 7 days post injury). Use micro scissors to cut, and tweezers to grab the wing. Mount maximal 4 wings into halocarbon oil 27 (Figure 1B) and cover them with a cover slide.\nImage the wing immediately using a spinning disk microscope. Acquire a series of optical sections along the z-axis with 0.33 μm step-size and compress z-stacks into a single file for subsequent analyses.\n\t\tNOTE: Do not grab the anterior wing vein where cell bodies and axons are housed. Grab the wing at the center. The tissue in wings is not fixed; keep the time from mounting wings to imaging these under 8 min.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60865/60865fig01.jpg",
    "Figure 1: Observation of axon morphology during axon death in the wing. (A) Schematic fly wing with two sparsely GFP-labeled sensory neurons, which are also separately indicated below. The site of injury and the field of observation are indicated. (B) Schematic setup for wing imaging. Injured and uninjured control wings (grey) are mounted in halocarbon oil 27 (red) on a glass slide (light blue) and covered with a cover slide (black). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60865/60865fig01large.jpg]\n2. Observation of Axon and Synapse Morphology During Axon Death in the CNS\nAntennal ablation: injury of whole axon bundles\n\t\nUse 5 virgin females and 5 males from the right genotype (Figure 5A, P0 generation) to perform crosses at RT. Pass P0 into new vials every 3–4 days. Collect freshly eclosed adult progeny (F1 generation) daily and let them age for 7 up to 14 days.\nAnesthetize flies on CO2 pads. Use tweezers to ablate the right 3rd antennal segment for unilateral ablation; or both left and right 3rd antennal segments for bilateral ablation (Figure 2A-C). This will remove GFP-labeled neuronal cell bodies, while their axonal projections remain in the CNS.\n\t\tNOTE: Antennal ablation severs the whole axon bundle. If unilateral ablation is performed, the axon bundle on the contralateral side (the unablated antenna) serves as internal control. Make sure to perform sufficient antennal ablations (approximately 15 animals).\nRecover the flies in food-containing vials.\nBrain dissection and visualization of axons\n\t\nMix silicone elastomer base (9 mL) and curing agent (1 mL) in a volume ratio of 10:1. Transfer each 5 mL mixture into a 35 mm tissue culture plate, and reduce air introduced by mixing with gentle agitation in the fume hood overnight. The mixture solidifies within 24 h.",
    "NOTE: Dissection plates must be prepared only once and may be used multiple times.\nAnesthetize flies on CO2 pads and decapitate adult heads using two tweezers at desired time points (e.g., 1 or 7 days after antennal ablation). Use one tweezer to grab the neck, and the other tweezer to fix the thorax. Gently pull the neck and head off the thorax.\n\t\tNOTE: Leave decapitated heads on the CO2 pad until the desired number is achieved, but make sure to proceed to the next step within 30 min.\nTransfer all heads into a 1.5 mL microcentrifuge tube containing 1 mL of fixing solution containing 4% paraformaldehyde (PFA) and 0.1% Triton X-100 in phosphate buffered saline (PBS) using tweezers that have been dipped into the fixing solution.\n\t\tNOTE: Fly heads stick well on wet tweezers. It makes it feasible to transfer all heads readily into the microcentrifuge tube.\nFix heads for 20 min with gentle agitation at RT. Put the microcentrifuge tube on ice, heads will gravitate to the bottom of the microcentrifuge tube. Remove the supernatant with a pipette and repeat this procedure with five 2 min washes with 1 mL of washing buffer containing 0.1% Triton X-100 in PBS with gentle agitation at RT, to remove residual fixing solution.\n\t\tNOTE: Videos on how to dissect adult Drosophila brains are readily available27.\nTransfer the heads with a glass pipette into a dissection plate filled with washing buffer. Use one tweezer to grab and pull the proboscis off the head, while holding the head with the other tweezer. This will leave a hole were the proboscis was attached to the exoskeleton.",
    "Use two tweezers to remove the exoskeleton between the hole and each compound eye. This will make it feasible to open the head structure with both tweezers, and to gently scratch out the brain within.\nClean each brain by removing trachea or fat stuck to it (Figure 2D, top). Once the brain is cleaned, put it in a new microcentrifuge tube containing 1 mL of washing buffer on ice.\n\t\tNOTE: Damaged or lost optic lobes will not affect the olfactory lobe in the center of the brain (Figure 2D, top).\nReplace washing buffer with 1 mL of fixing solution once all brains are collected and accumulated at the bottom of the microcentrifuge tube. Fix brains for 10 min with rocking at RT, followed by five 2 min washes in 1 mL of washing buffer with rocking at RT.\nApply primary antibodies (1:500) in washing buffer overnight with rocking at 4 °C, followed by 10 washes over 2 h using 1 mL of washing buffer with rocking at RT.\nApply secondary antibodies (1:500) in washing buffer 2 h with rocking at RT and wrap microcentrifuge tube in aluminum foil to block light. Keep the microcentrifuge tube covered with aluminum foil for the rest of the procedure. Apply ten washes with 1 mL of washing buffer over 2 h with rocking at RT.\nRemove the supernatant and use a single drop of antifade reagent to cover the brains in the microcentrifuge tube. Incubate brains for at least 30 min at 4 °C before preparing them for mounting and imaging.\nPrepare a cover slide, stick lab tape on it, and cut out a \"T\"-like shape from the tape (Figure 2D, bottom). The resulting space serves as area where the brain-containing antifade reagent28 will be pipetted into, preferably into both chambers.",
    "NOTE: Use a 20-200 µL pipette tip where 3 mm of the tip has been cut off to widen the opening of the pipette. This will make it feasible to pipette the brain-containing antifade reagent. Carefully cover the brains with a cover slide.\nUse clay to prepare two small even rolls. Ensure that the clay rolls are not higher than the height of a glass slide. Stick the clay rolls onto the glass slide (Figure 2D, bottom). Place the brain-containing cover slide sandwich onto the clay rolls.\n\t\tNOTE: GFP-labeled axons and their synapses are located in the front of the brain. It is, therefore, easier to image them from the front. However, brains will either face up, or face down on the cover slide sandwich. Clay rolls serve as sandwich holders, and during imaging, the sandwich can be flipped upside down. This will make it feasible to acquire images from the front from every brain.\nAcquire a series of optical sections along the z-axis with 1.0 μm step-size using a confocal microscope, and compress z-stacks into a single file for subsequent analyses, to assess the number of axonal projections remaining intact.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60865/60865fig02.jpg",
    "Figure 2: Observation of axon and synapse morphology during axon death in the brain. (A) Side view of a schematic fly head with GFP-labeled cell bodies, axons and synapses. (B) High-magnification front view of GPF-labeled olfactory receptor neurons and their axons and synapses. Cell bodies are housed in the 3rd antennal segment, and their axons project into the CNS. Axons form synapses in a glomerulus in the left olfactory lobe, cross the midline and form synapses in the glomerulus on the contralateral olfactory lobe. (C) Examples of fly heads with unilateral antennal ablation. Top: Uninjured control. Middle: Ablation of the 3rd antennal segment. Bottom: Ablation of the 2nd (and thus also 3rd) antennal segment. (D) Brain preparation. Top: Schematic dissected fly brain with indicated olfactory lobes and axonal projections in the field of view. Bottom: Schematic setup for brain imaging. Two clay rolls (green) are mounted onto a glass slide (light blue), they carry a cover slide sandwich, which contains fly brains (grey). Brains are mounted in antifade reagent(purple), surrounded by a lab tape (orange), and covered by two cover slides (black). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60865/60865fig02large.jpg]\n3. Grooming Induced by Optogenetics as a Readout for Axon and Synapse Function\nOptogenetic setup\n\t\nPerform the optogenetic experiment in a dark room. Ensure that the setup consists of an 850 nm infrared (IR) LED spotlight to illuminate flies in the dark (Figure 3A), a flashing 660 nm red LED spotlight to activate neurons expressing CsChrimson, and a monochrome camera with a 700 nm longpass filter, which prevents the recording of red light flashes.",
    "Use a 3D printer to generate a tiny circular behavior chamber with a diameter of 1 cm, cover it with a cover slide, and place an 860 nm emitter coupled to the red LED spotlight next to the chamber (Figure 3B).\n\t\tNOTE: The emitter indicates when the red LED spotlight is on, thus activating the neurons.\nMount the LED spotlights and the camera on top of the chamber (Figure 3A, C).\nActivate neurons by 10 Hz flashes during 10 s. The duration of activation can be adjusted according to the experimental design.\nPreparing flies for optogenetics\n\t\nMelt fly food in a microwave. After the food cooled down, before solidification, add 1:100 of 20 mM all trans-retinal in ethanol (EtOH) to a final concentration of 200 µM. Mix well, and pour the food immediately into empty vials.\n\t\tNOTE: Avoid adding all trans-retinal to hot food, this could result in less efficient optogenetics.\nCover vials containing solidified food with plugs or cotton balls. Wrap vials with aluminum foil. Then, store the food-containing vials in a dark, cold room.\nUse 5 virgin females and 5 males (Figure 6A, generation P0) from the right genotype to perform crosses at RT. Pass P0 into new vials every 3–4 days. Collect freshly eclosed adult progeny (generation F1) on a daily base and let them age for 7 up to 14 days in aluminum-covered vials containing 200 µM all trans-retinal in fly food.\nCollect flies by tapping them from food-containing vials into an empty vial with no food. Cool the vial down in ice-containing water for approximately 30 s. Flies will fall asleep. Put individual flies rapidly into small chambers covered with a cover slide (Figure 3B).",
    "NOTE: As soon as flies warm up, they wake up. It is crucial to quickly spread individual flies into single chambers each. Avoid CO2 pads to anaesthetize flies, this will impact their behavior.\nPerform optogenetics to elicit antennal grooming. Here, the protocol consists of the following intervals: 30 s where the red light is absent, followed by 10 s of red-light exposure at 10 Hz. Repeat this procedure three times in total, followed by an additional 30 s interval where the red light is absent12,29,30.\n\t\tNOTE: This protocol can be adjusted according to the experimental preference.\nCollect individual flies from each chamber on CO2 pads. Subject them to antennal injury. Ablate both the left and the right 2nd antennal segments (Figure 2C). This will remove the cell bodies of Johnston's organ (JO) neurons, while the axonal projections remain in the CNS. Recover the flies in aluminum-covered vials containing 200 µM all trans-retinal.\n\t\tNOTE: For antennal grooming induced by optogenetics, the sensory neuron cell bodies are housed in the 2nd antennal segment (Figure 2C).\nAt corresponding time points (e.g., 7 days post antennal ablation), subject flies to another grooming assay (go back to step 3.2.4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/60865/60865fig03.jpg\nFigure 3: Optogenetic setup to induce grooming as a readout for axon and synapse function. (A) Illustration of assembled components required for optogenetics. Infrared (IR) LED spotlight, camera and red LED spotlight (from left to right, respectively). The components including a detailed description are listed in the Table of Materials. (B) Top view illustration of a behavior chamber including an IR emitter to indicate red LED spotlight activation. (C) Illustration of a single mount setup. A total of three mount setups are required for the two LED spotlights and the camera, respectively. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60865/60865fig03large.jpg]"
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}