{
  "id": 8432,
  "origin_website": "Jove",
  "title": "Imaging and Analysis of Neurofilament Transport in Excised Mouse Tibial Nerve",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of The Ohio State University.\n1. Preparation of nerve saline solution\nMake 100 mL of Breuer’s saline10: 98 mM NaCl, 1 mM KCl, 2 mM KH2PO4, 1 mM MgSO4, 1.5 mM CaCl2, 5.6% D-glucose, 23.8 mM NaHCO3 in double-distilled water.\nBubble 95% oxygen/5% carbon dioxide (carbogen) through the saline solution for at least 30 minutes prior to use. Leftover saline can be reused within one week; however, it must be reoxygenated before each use.\nPour oxygenated saline into a 60 mL syringe and ensure that there is minimal air remaining in the syringe.\n2. Initial assembly of nerve perfusion chamber\nConnect the syringe and the tubing as shown in Figure 1A, placing the outflow tube into a waste flask.\nPlace the outer gasket into the perfusion chamber housing, ensuring that the flow inlet and outlet posts are aligned with the holes in the gasket.\nLay the inner gasket (silicone, 100 µm thick) on a #1.5 circular coverslip (40 mm diameter), carefully smoothing out any wrinkles in the gasket to ensure a tight seal. To facilitate later assembly, place the coverslip and gasket on a paper towel or task wipe with the gasket facing up.\n3. Dissection and preparation of mouse tibial nerve\nSacrifice the animal by carbon dioxide inhalation or another institutionally approved method. Start a timer when the animal ceases movement/breathing, as experiments must only be conducted within 3 hours of sacrifice7.\nSpray the fur with 70% ethanol and remove as much as possible from the animal’s legs and back using an electric razor.",
    "Using a pair of large dissection scissors, make a dorsal incision in the skin near the middle of the spine and continue the cut around the ventral aspect of the animal. Starting from this cut, slowly reflect the skin from the legs by gently pulling it away from the muscle and cutting the fascia.\nPlace the animal in a supine position on a dissection tray and pin all four paws. Optionally pin the tail to reduce movement further.\nUsing microdissection scissors, make an incision in the thigh muscles midway between the tail and knee to expose the sciatic nerve. Ensure that the nerve, which is visible through the muscle, is not cut.\nExtend the incision dorsally and ventrally to remove the muscle. Similarly, remove the muscles of the calf, keeping cuts shallow and short to avoid damaging nerve.\nRemove muscles until the tibial nerve is fully exposed from the point where it branches from the sciatic nerve (at the knee) to the heel (Figure 2A).\n\tNOTE: In all steps including and following dissection of the tibial nerve, avoid unnecessary exposure to ambient light to minimize possible incidental activation of paGFP in the nerve.\nGrasp the tibial nerve at the spine-proximal end with a pair of forceps and cut the nerve using a pair of microdissection scissors. Taking care not to put tension on the nerve, lift it away from the muscle, cutting any attachments.\nCut the spine-distal end of the tibial nerve and transfer to a small Petri dish of room temperature oxygenated saline. From this point on in the procedure, always be certain to keep track of the proximal and distal ends of the nerve.",
    "NOTE: One way to do this is to mark the distal end of the nerve with an angled cut such that the taper is visible.\nStarting from the proximal end of the nerve, gently grasp the exposed axon ends with a pair of very fine-tipped forceps.\nWith a second pair of forceps, grasp the nerve sheath proximally, and slowly pull towards the distal end of the nerve. The nerve sheath will slide along the axons with minimal resistance. Ensure that no undue tension is applied to the nerve during this process.\n4. Final nerve perfusion chamber assembly\nGrasping the proximal end of the nerve, remove it from the saline and slowly lay it down onto the coverslip of the perfusion chamber within the rectangular opening of the inner gasket, maintaining gentle tension on the nerve as you lay it down so that it lies straight.\nPlace the microaqueduct slide over the nerve with the grooved side facing the nerve, and the direction of flow parallel to the nerve. Flip the coverslip and microaqueduct assembly over, and place it within the perfusion chamber housing with the microaqueduct slide apposed to the outer gasket. The nerve and surrounding inner gasket will now be sandwiched between the coverslip and the microaqueduct slide, which are separated by the gasket, with the coverslip facing up (Figure 1B).\nSecure the perfusion chamber by placing it in the metal housing and rotating the locking ring. Ensure that the plastic housing is fully under all metal clips and tighten well to prevent saline leakage. Overtightening may crack the microaqueduct slide or coverslip. Flip the chamber over so that the coverslip is facing down.",
    "Slowly depress the saline syringe plunger to fill the perfusion chamber. Keep the inlet and outlet tubing, outlet flask and syringe elevated above the chamber itself at all times during setup and imaging. This avoids siphoning, which can introduce bubbles or cause focus instability due to negative pressure in the chamber.\nTransfer the perfusion assembly to an inverted microscope stage and mount the saline syringe into the syringe pump. Start the motor at an appropriate speed for a flow rate of 0.25 mL/min. Then connect and turn on the in-line solution heater set to 37 °C.\nConnect the objective heater and set to 37 °C, apply oil to the objective, and insert the perfusion chamber into the stage mount.\nApply oil to the chamber heater pad and attach to the perfusion chamber. Connect and turn on the chamber heater; set to 37 °C.\n\tNOTE: Changes in temperature may cause bubbles to form in the perfusion chamber due to outgassing of the solution. If bubbles form, briefly increase the solution flow rate by 5-10x until bubbles clear the chamber.\nLock the perfusion chamber into the stage adapter and bring the objective oil into contact with the coverslip on the underside of the chamber.\n\tNOTE: The Bioptechs chamber with ASI stage adapter used here are designed for an inverted microscope configuration.\n5. Fluorescence activation and image acquisition",
    "Using brightfield illumination, focus on the layer of axons on the bottom surface of the nerve closest to the coverslip surface (Figure 2B). Myelinated axons (typically 1 - 6 µm in diameter in adult mice) can be identified by the presence of a myelin sheath, which is visible under brightfield transmitted light illumination without contrast enhancement. Schmidt-Lanterman clefts and nodes of Ranvier are also readily apparent. Unmyelinated axons are more slender (typically <1 µm diameter) and are generally present in bundles (Remak bundles), where they are generally too closely apposed to be resolved from each other.\nIf available on the microscope, activate the auto-focus system to maintain focus over the course of timelapse imaging.\nAcquire a brightfield reference image. Record the orientation of the nerve (spine-proximal and distal ends) with respect to images.\nAcquire a confocal image using a 488 nm laser and an emission filter appropriate for paGFP (e.g., 525/50 nm) to record the pre-bleach autofluorescence. Keep the laser power low to minimize photobleaching, with exposure time adjusted accordingly to detect the faint signal. As an example, representative data were acquired at 5% laser power and 4 s exposures. Record the acquisition settings for use in all future experiments.\n\tNOTE: After photoactivation, the ideal imaging settings will produce a signal-to-noise ratio > 8 and photobleaching of less than 25% of the original signal over the course of 20 images. The axons can also be imaged by widefield epifluorescence microscopy as we did originally7, but the image quality will be inferior due to lack of confocality.",
    "Set the laser power to approximately 5x normal imaging power and acquire an image with an exposure time of 3-4 minutes. Though not essential, this step is recommended to bleach autofluorescence and other sources of unwanted fluorescence in order to reduce background signal and thus maximize the signal-to-noise of the photoactivated fluorescence.\nAcquire an image with the settings used in step 5.4 to record the pre-activation autofluorescence after this bleaching step.\nOn the brightfield image, draw a line parallel to the axons with a length equal to desired activation window size. The length of this window will vary depending on the experimental goal and parameters, but typical lengths are 5 μm for the pulse-escape paradigm and 40 μm for the pulse-spread paradigm.\nUsing this line as a guide, draw a rectangular region of interest (ROI) across the field of view perpendicular to the axons. The region must encompass all the axons to be photoactivated.\nDetermine optimal settings for photoactivation with 405 nm illumination.\n\tNOTE: Only perform this step and sub-steps prior to first experimental activation. Over the course of an experiment, the same photoactivation settings must be used.\n\t\nActivate a region of interest repeatedly using the 405 nm laser line, low laser power (e.g., 5%), and pixel dwell time (e.g., 40 µs), and one pulse, acquiring an image of the activated GFP fluorescence after each activation. Repeat until the fluorescence no longer increases, and then quantify the fluorescence in a region of interest for each image.\nPlot the average fluorescence intensities versus pulse number. Select the number of pulses after which fluorescence no longer increases as the optimal number of pulses for activation.",
    "Activate the paGFP fluorescence the region drawn in step 5.8 by patterned excitation with 405 nm light. Ensure that an image is acquired just prior to and just following activation.\n\tNOTE: The ideal paGFP activation will produce a clearly defined region of fluorescence with sharp boundaries contained within the ROI.\nStart a 1 minute timer as the activation finishes. At the end of 1 minute, start acquisition of a timelapse series.\n\tNOTE: The 1 minute delay is necessary to allow for the increase in fluorescence that is observed following photoactivation of paGFP11. For the pulse-spread method, a 5-10 minute acquisition period with 30 second timelapse intervals is sufficient for measurement of the initial slopes in the central and flanking windows to measure velocity and directionality. For the pulse-escape method, an acquisition period of 30-150 minutes with 5 or 10 minute timelapse intervals permits analysis of the long-term pausing behavior of the filaments\nSave all images acquired, as well as the ROI used for fluorescence activation.\nMove to a new region of the nerve and repeat steps 5.1-5.11. If the new region is along the same axon, it must be at least 500 µm from the previously activated region to avoid detection of fluorescent neurofilaments that moved out of the other activated region. The acquisition of the final timelapse must finish before the end of the 3 hour window.\n\tNOTE: It is possible that the preparation may be viable for longer than 3 hours, but we have not confirmed that. With proficient dissection and preparation, between five and eight 10-minute timelapse image sets may be acquired within this 3 hour window.\nAfter the final timelapse image series is acquired, stop the flow of saline, disconnect the solution and chamber heaters, and remove the perfusion apparatus from the microscope stage.",
    "6. Flatfield and darkfield image acquisition\nMake a solution of fluorescein by adding 250 mg of fluorescein powder to 0.5 mL of double distilled water. Mix until there are no visible particles and spin the solution for 30 seconds in a tabletop centrifuge to sediment any undissolved material. This solution can be stored for several months at 4 °C if protected from light exposure.\nAdd 8 μL of fluorescein solution to a slide and apply a #1.5 coverslip. Blot excess liquid, seal with nail polish, and allow to dry.\n\tNOTE: At this high concentration, the strong absorption of the fluorescein dye extinguishes the illuminating beam within the solution, producing a thin plane of fluorescence at the surface of the coverslip that is both uniform and resistant to photobleaching due to rapid diffusive exchange12.\nPlace the fluorescein slide coverslip-side down on the inverted microscope stage and adjust the focus on the thin plane of fluorescence at the surface of the coverslip. Move around the slide to find a field of view that does not contain air bubbles (dark spots) or large fluorescein particles (bright spots).\nAcquire a z-stack spanning 6 μm at 0.2 μm intervals such that the middle image is the original focus plane. Use a short exposure time (e.g., 40 ms) because the fluorescence will be very bright. This z-stack acquisition is necessary to capture the maximal fluorescence across the field of view as the coverslip is rarely perfectly horizontal and the plane of fluorescein fluorescence is very narrow. Repeat this for a total of 25 fields of view, moving the stage by at least 20 µm in any direction between fields.",
    "Close all light path shutters, including the camera shutter, and set the laser power and the exposure time to zero. Acquire a stack of 100 images with these settings. These images will be averaged to generate the darkfield image, which will be used to correct for dark current and the bias offset on the camera chip.\n\tNOTE: Streaming acquisition is an ideal way to capture these images.\n7. Imaging glycolytically inhibited nerves for bleach correction\nMake and oxygenate a saline solution as in step 1; however substitute 2-deoxy-D-glucose for D-glucose and add 0.5 mM sodium iodoacetate to inhibit glycolysis13. We refer to this as “inhibitory saline”.\nRepeat steps 2-5 using the inhibitory saline, with a 10-30 minute timelapse image set in step 5.11. Allow 40-50 minutes after application of inhibitory saline before imaging to ensure complete inhibition of neurofilament transport.\n\tNOTE: Glycolytic inhibition will eventually kill the axons so there is a narrow window of time after inhibition in which to acquire data, typically about 30 minutes. An indicator of the level of metabolic inhibition is the flavin autofluorescence of the axonal mitochondria, which can be detected in the timelapse series due to the long exposures that we use to image the paGFP fluorescence14. Typically, mitochondrial autofluorescence will increase during treatment with inhibitory saline. If the mitochondria begin to round up or fragment, then cease imaging.\n8. Image processing and analysis using ImageJ\nFlatfield and darkfield correction\n\t\nOpen the darkfield image stack and average the images by clicking Image | Stacks | Z Project and selecting Average Intensity in the drop-down menu to generate the darkfield image.\nOpen the fluorescein flatfield image stacks and create a maximum intensity projection of each (25 in total) by clicking Image | Stacks | Z Project and selecting Max Intensity in the drop-down menu.",
    "Combine the resultant 25 maximum projection images into one stack by clicking Image | Stacks | Images to Stack. Create an average intensity projection of this stack by clicking Image | Stacks | Z Project and selecting Average Intensity from the dropdown menu to generate the flatfield image.\nSubtract the darkfield image from the flatfield image by clicking Process | Image Calculator, selecting Subtract as the operation. Ensure that the 32-bit (float) result option is checked. The result is the corrected flatfield image.\nMeasure the average pixel intensity of the corrected flatfield image by first clicking Analyze | Set Measurements and checking the Mean gray value box, and then pressing the ‘m’ key.\nDivide the corrected flatfield image by its average intensity by clicking Process | Math | Divide and entering the average gray value obtained in step 7.1.5. This will produce the inverse gain image.\nOpen the pre-activation and post-activation images along with the timelapse image stack. Combine the images into a single stack by clicking Image | Stacks | Tools | Concatenate, and select the images in chronological order from the dropdown menus. Make sure that the Open as 4D image option is not selected. The resulting stack is the full image set.\nRepeat step 8.1.4 on the full image set, and then divide the result by the inverse gain image by clicking Process | Image Calculator and selecting Divide as the operation. This will produce the corrected full image set, in which each image has been corrected for the non-uniformity in the field of illumination and on the detector.\nImage stack alignment",
    "To correct for misalignment of the image planes in the timelapse series due to stage or sample drift, install the Alignment by fixed region plugin (Supplemental File 1) by clicking Plugins | Install PlugIn, navigating to the folder containing the plugin file, and selecting the plugin. Restart ImageJ after installing the plugin.\n\t\tNOTE: This plugin aligns images based on the “least squares congealing” principle15.\nDraw an ROI on the corrected full image set which spans several axons and does not extend beyond the proximal and distal boundaries of the activated fluorescence within each of the axons. The geometry of the region is unimportant, however excluding areas in which structures change shape or size will improve alignment.\nRun the alignment plugin by clicking Plugins | Alignment by fixed region. The plugin places a default 2-pixel maximum on the displacement between frames, however this may be adjusted in the initial pop-up window if there is significant drift of the sample. The alignment may take several minutes, depending on the size of the image stack.\nVisually inspect the aligned stack to assess the quality of the alignment. Some frames may then need to be aligned manually, as the automated alignment may not function well for large fluctuations in fluorescence between frames. This may be accomplished while viewing a frame which must be shifted by clicking Image | Transform | Translate. Click No on the following pop-up asking whether the entire stack should be translated. Use only integer pixel values in translation and ensure that the dropdown interpolation menu is set to None, as fractional pixel shifts or interpolation will alter the data due to resampling of the pixel intensities.\nSave this as the aligned full image set. \nMeasurement of fluorescence intensities",
    "Draw an ROI using the Angle tool on the first frame of the aligned full image set with the first arm along one edge of the activated region, perpendicular to the axons, and the second arm vertical. Press the ‘m’ key to measure the angle, which describes the orientation of the axons in the field of view.\nSet the scale of the images so that dimensions are measured in microns by clicking Analyze | Set Scale and entering the appropriate values.\nOpen the ROI manager by clicking Analyze | Tools | ROI Manager. For the pulse-escape paradigm, skip to step 8.3.7. For the pulse-spread, continue to step 8.3.4.\nDraw a square ROI of any dimensions, and then click Edit | Selection | Specify. Ensure that the Scaled units option is checked, and then set the ROI to a width of 15μm and a height equal to or greater than the height of the image.\nRotate the ROI by the angle measured in step 8.3.1 by clicking Edit | Selection | Rotate to make it perpendicular to the axons, and place the ROI with one side along the proximal edge of the activated region. Add this ROI, which we will refer to as the proximal guide ROI, to the manager by pressing the ‘t’ key.\nDrag the ROI to align with the distal edge of the activated region and add to the ROI manager again by pressing the ‘t’ key. We will refer to this as the distal guide ROI. The proximal and distal guide ROIs will be used later to draw the flanking measurement ROIs.",
    "Select axons for quantification, using the timelapse image sequence acquired in step 5.11 above. This image sequence is helpful for this purpose because it captures the weak autofluorescence of the axons, revealing their morphology outside of the activated region.\n\t\tNOTE: Axons that do not meet the following criteria are excluded from the analysis:\n\t\t\nAxons must be in focus along the entire length of all measurement windows.\nAxons must be within 5° of perpendicular to the proximal and distal ends of the activation region.\nAxons must have no invaginations within 5μm of the proximal and distal ends of the activation region.\nExclude axons which change shape visibly during the course of imaging.\nExclude axons that appear unhealthy as evidenced by the absence of a discrete activated region in the post-activation image (Figure 2C, bottom), as this is indicative of diffusive dispersion of the activated fluorescence, which happens when the axon dies.\nObserve long-exposure bleaching image from step 5.5 for autofluorescent structures within axons. This fluorescence is due to flavins within mitochondria16. Exclude axons from analysis if these mitochondria appear rounded or fragmented (Figure 2D, bottom), as opposed to extended, linear structures (Figure 2D, top), as this is an indication of metabolic decline.",
    "Using the proximal and distal guide ROIs created above, draw three measurement ROIs per axon being analyzed: a central window encompassing the axon within the 40 μm activated region, and two flanking windows with width constrained by flanking window 15 μm ROIs and height constrained by the diameter of the axon at the border of the activation region. Add all three regions to the ROI manager. For glycolytically inhibited axons, draw a single region that is no more than 5 μm wide in the middle of the activated region and that does not extend outside the axon. For the pulse-escape paradigm, the activated region is only 5 μm wide, so the entire window must be used.\nRepeat step 8.3.9 for all axons which meet criteria of steps 8.3.7 and 8.3.8.\nSet active measurements to average pixel intensity by clicking Analyze | Set Measurements and selecting the Mean gray value option. Ensure that no other measurement options are checked.\nSelect all ROIs in the ROI Manager window by selecting the window and pressing ‘Ctrl’ + ‘a’. In the ROI Manager window, click More | Multi Measure to measure the fluorescence intensities. Copy the data from the results window to a spreadsheet for further analysis.\nSet active measurements to region area by clicking Analyze | Set Measurements and selecting the Area option. Ensure that no other measurement options are checked.\nRepeat step 8.3.12. It is only necessary to copy one row of the results for the area, as the area does not vary with time.\n9. Photobleach correction\nIn the data spreadsheet for glycolytically inhibited axons, subtract the mean fluorescence of frame 1 (the pre-activation frame) from the mean fluorescence of each frame starting at frame 3 (the first timelapse frame) for a given ROI. The results are the background-subtracted means.",
    "Plot the data as a scatterplot with the frame numbers as the abscissa. Fit an exponential trendline to the data from each ROI (most spreadsheet programs have this function) with an equation in the form of Ae-bx. This equation is equivalent to the photobleaching function Ft = F0 * e-tɣ where F0 is the fluorescence at the first frame of the timelapse, ɣ is the exponential bleaching rate, t is the time, and e is the natural logarithm base.\nRepeat steps 9.1.1-9.1.2 for all ROIs of all axons from the glycolytically inhibited nerves. For the most accurate estimate of the photobleaching rate, use at least 15 axons in total from at least 5 separate nerves. Use the average of the exponential bleaching rates (ɣ) from all inhibited axons to correct the experimental data for photobleaching. A new bleaching calibration must be performed for each experiment or study, because photobleaching is dependent on the image acquisition settings and the laser power, which can change over time.\nRepeat step 9.1.1 for all regions of axons imaged with normal saline (i.e. not glycolytically inhibited).\nDivide each data point by e-tɣ, using time for t and the average ɣ found in step 9.1.3. These are the photobleach-corrected means.\nMultiply each data point by the area for that region of interest to find the total fluorescence in that region at each time.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}