{
  "id": 18482,
  "origin_website": "Jove",
  "title": "A Magnetic Microbead Occlusion Model to Induce Ocular Hypertension-Dependent Glaucoma in Mice",
  "procedures": [
    "The following procedure was performed in compliance with the guidelines of the Canadian Council on Animal Care for the Use of Experimental Animals and the Statement for the Use of Animals in Ophthalmic and Visual Research from the Association for Research in Vision and Ophthalmology (ARVO).\n1. Preparation of the Microneedle for Anterior Intracameral Injection\nWith a puller, generate a microneedle from a borosilicate glass capillary\nUnder a microscope, use a sharp blade to carefully create an opening at the tip of the microneedle. The resulting opening should have an elliptical shape with a major and minor axis diameter of approximately 190 µm and 70 µm, respectively. Measure the area of the prepared microneedle opening by first acquiring images with a ruler placed under the microscope followed by quantification using image analysis software.\nIn the micropipette bevelling system, place the microneedle at a 20 degree angle relative to the bevelling plate so that the microneedle opening is touching the plate. Bevel for approximately 10 min until the edges are flat and smooth. Add a few drops of distilled water to aid in the process.\nRotate the microneedle to bevel the two edges surrounding the opening until the tip is sharp.\nClean all debris and water from the microneedle tip opening using an aerosol duster.\nCarefully examine the finished microneedle under a microscope. Discard microneedles with fractures to minimize the risk of the microneedle breaking during surgery.\nSterilize the microneedle by rinsing first with ethanol, then with sterile balanced salt solution (BSS).\n2. Preparation of the Magnetic Microbead Solution",
    "Note: The magnetic microbeads used in this study are coated with epoxy groups. To prevent any adverse effects, such as clumping of the beads and unwanted molecular interactions, these epoxy groups must first be removed from the microbeads before proceeding with the injection surgery.\nRemoval of Epoxy Groups from Magnetic Beads\nPrepare a solution of 0.02 M sodium hydroxide (NaOH, MW 39.997 g/mol) in 10x Tris buffer (MW 121.14 g/mol).\nGently vortex the stock of magnetic microbead solution (4.5 µm diameter, 4 x 108 beads/ml) until the beads are evenly suspended in solution.\nQuickly pipet 1 ml of magnetic bead solution into 50 ml of 0.02 M NaOH in 10x Tris buffer.\nRotate for 24 hr at RT to remove the epoxy groups from the beads.\nCollect the beads by securing a magnet to the bottom of the tube. Orient the tube horizontally to ensure that all the beads are attracted to the magnet. Rotate for an additional 4 hr at RT.\nWith a micropipette, carefully remove the supernatant without disturbing the pellet of beads.\nGently vortex the pellet in 50 ml of 10x Tris buffer until the beads are well suspended.\nRepeat steps 2.1.4 to 2.1.6.\nConcentration and Resuspension of Magnetic Microbeads in Sterile Balanced Salt Solution\nNote: It is necessary to concentrate the stock of magnetic bead solution in sterile balanced salt solution (BSS) to reach a final concentration of 1.6 x 106 beads/µl so that 2.4 x 106 beads can be injected into the anterior chamber in a final volume of 1.5 µl, which is appropriate for the small mouse eye.\nWash the beads in 5 ml of ultra-pure laboratory grade water by gently vortexing for 2 min.\nCollect the beads by attracting them to the bottom of the tube with a magnet.",
    "With a micropipette, carefully remove the water without disturbing the pellet of beads.\nRepeat steps 2.2.1 to 2.2.3 three more times.\nIn a laminar flow hood, wash the beads with 500 µl of BSS by pipetting up and down. Perform the remaining steps in this section under sterile conditions in a laminar flow hood.\nCollect the beads by attracting them to the bottom of the tube with a magnet.\nWith a micropipette, carefully remove the BSS without disturbing the pellet of beads.\nRepeat steps 2.2.5 to 2.2.7 three more times.\nResuspend by pipetting the beads up and down in 250 µl of BSS.\nEnsure that the bead solution is well homogenized. Then, quickly aliquot 25 µl of the suspension into sterile 0.5 ml tubes. The final concentration of the stock bead solution is 1.6 x 106 beads/µl.\nStore at 4 °C.\n3. Induction of Ocular Hypertension\nNote: Section 3 is a two-person operation. In the event that a particular action is to be performed by a specific person, the appropriate person is identified. In general, Person 1 handles the mouse under the microscope while Person 2 is responsible for manipulating the microsyringe pump. The total duration of the surgical procedure should be less than 10 min (steps 3.9 to 3.17).\nPerform procedures in adult C57BL/6 mice. House mice in a standard environment with access to food and water ad libitum. In this paper, use female C57BL/6 mice between 3 and 4.5 months of age. However, this protocol can be adapted to males and mice of different ages, as well as other mouse strains, including transgenic and knockout mice.\nMeasure baseline IOP in awake mice prior to anaesthesia and microbead injection using a calibrated rebound tonometer. Apply one drop of proparacaine hydrochloride on the cornea.",
    "Gently restrain the mouse by holding the skin between the ears. Place the mouse on the benchtop so that the animal is comfortable and the eyes are accessible. Hold the tonometer perpendicular to the corneal surface and take at least three sets of ten consecutive readings per eye to obtain an IOP average. The measuring of IOP in awake mice is preferred to bypass anaesthesia-related effects on IOP. Alternatively, IOP can be measured in anesthetised mice after step 3.4.\nPrepare a stock mouse cocktail anaesthesia mixture composed of 20 mg/ml ketamine, 2 mg/ml xylazine, and 0.4 mg/ml acepromazine.\nInduce anaesthesia in the mouse by intraperitoneal administration of the cocktail mixture (1 µl/g of body weight). The use of an injectable anaesthetic cocktail is preferred over gas anaesthetics (e.g., isoflurane) because it allows flexibility when handling the mouse head as the animal is not connected to an inhalation mask. In addition, the longer recovery period required with an injectable anaesthetic ensures that microbeads settle at the iridocorneal angle without dislodging back into the anterior chamber.\nAdminister 0.05 mg per kg of body weight of buprenorphine subcutaneously.\nTreat the eye with a tropicamide eye drop to induce pupil dilation. Due to the small size of the murine anterior chamber, the pupil must be dilated to easily visualize the positioning and advancement of the microneedle during injection.\nApply topical ointment on the contralateral eye (un-operated) to avoid drying of the cornea during the procedure.\nAttach a clean microneedle to the injection assembly of the microsyringe pump. Replace the microneedle after every operation to avoid cross-animal contamination.",
    "Person 1: Transfer the anesthetised mouse to the operating platform. Under the microscope, ensure that the pupil is fully dilated and that the ocular muscles are relaxed so that there is no eye movement. The absence of eye movements ensures stability during the injection. Gently wipe the tropicamide eye drop from the eye using absorbent swabs.\nPerson 2: Mix the magnetic microbead solution by pipetting up and down.\nUsing the microsyringe pump, immediately load the microneedle (prepared in section 1) with 1.5 µl of the homogenized magnetic microbead solution (2.4 x 106 beads). Ensure that air bubbles are absent at the tip of the microneedle. After the microneedle is loaded, carry out steps 3.12 to 3.13 as quickly as possible so that the magnetic microbead solution remains in a homogeneous suspension.\nPosition the loaded microneedle at a 45° angle, placed anteriorly relative to the limbus. Person 1: support the eye using plastic forceps. Ensure that the angle between the microneedle and the plastic forceps is approximately 90°.\nPerson 2: With the loaded microneedle, gently puncture the cornea so that the tip of the microneedle enters the anterior chamber. Ensure that the loaded microneedle remains at a 45° angle relative to the limbus during the puncture. Avoid any contact with the lens or the iris. Ensure that the microneedle does not enter the posterior chamber. Person 1: continue to support the eye using plastic forceps.",
    "Person 1: Without moving the mouse head, place the magnet beside the eye, opposite to the microneedle tip, to attract the magnetic beads into the anterior chamber and minimize contact of the beads with the inner surface of the cornea. Person 2: Using the microsyringe pump, inject 1.5 µl of the magnetic bead solution into the anterior chamber. The microbead solution is injected over a period of 15 to 30 sec. Person 1: Continue to hold the magnet opposite to the microneedle tip during the entire duration of the injection.\nPerson 2: Once the full volume of beads has been injected, slowly withdraw the microneedle from the eye. Person 1: To avoid reflux of the microbeads, continue to attract the magnetic beads towards the anterior chamber by holding the magnet next to the eye for an additional 30 to 60 sec.\nPerson 1: Using the magnet, attract the beads to the iridocorneal angle. Ensure that the beads form an evenly distributed ring around the circumference of the anterior chamber. During this step, avoid attracting beads to the cornea as they have a tendency to stick to the inner surface of the cornea upon contact.\nTreat the operated eye with an antibiotic eye drop to minimize the risk of infection.",
    "Allow the mouse to recover on a heat pad until fully awake (~3 to 4 hr). Place the mouse so that the operated eye is facing upwards. This positioning will prevent accumulation of the injected beads to the inner surface of the cornea by gravitational pull. In addition, this position will decrease the potential for infection as the operated eye will not be in contact with any bedding and/or other materials that may be present in the cage. In the event that an animal displays any sign of distress, administer additional doses of buprenorphine as needed. \nAllow mice to recover from the procedure for at least 2 days before taking IOP measurements. Measure IOP as described in 3.2. Monitor IOP at least once a week or more frequently, as needed, and at the same time of the day to minimize circadian-related fluctuations.\nFor IOP measurements, use the contralateral eye from the operated mouse as an internal control. Alternatively, use measurements from intact, non-operated or sham-operated mice as naïve controls.\n4. Assessment of Retinal Ganglion Cell Soma and Axon Survival\nPerfuse mice subjected to ocular hypertension by intracardial injection of 0.1 M phosphate buffer solution (PBS) immediately followed by ice-cold 4% paraformaldehyde (PFA).\nPerfuse intact, non-operated mice as described in 4.1 and use them as uninjured controls. The use of contralateral eyes from operated mice is not recommended to assess RGC survival because changes in contralateral eyes following injury have been reported15,16 and can confound data interpretation. Alternatively, use sham-operated eyes injected with 1.5 µl of BSS as controls.\nUsing microscissors, carefully cut the connective tissue around the eye to isolate it from the eye socket. Separate the optic nerve from the eye by cutting it at the level of the optic nerve head.",
    "Using a 30 G needle, make a hole in the cornea to allow penetration of the fixative solution into the eye. Place the eye in 4% PFA and incubate for 1 hr at 4 °C for additional fixation.\nPlace the optic nerve in a solution containing 2% PFA and 2.5% glutaraldehyde in 0.1 M sodium cacodylate (MW: 214 g/mol) and incubate O/N at 4 °C for additional fixation.\n5. Quantification of RGC Soma Density on Flat-mounted Retinas\nNote: The following procedure is adapted from a protocol by Nadal-Nicolas et al. 17 and outlines the quantification of RGCs using an antibody against the brain-specific homeobox/POU domain protein 3A (Brn3a) on retinal flat-mounts. Alternative methods for labeling RGCs can also be used including immunohistochemistry with an antibody against RNA-binding protein with multiple splicing (RBPMS) or retrograde labelling with Fluorogold or DiI.\nUnder a dissecting microscope, remove the anterior part of the eye by making an incision along the entire limbus until the cornea detaches easily. Remove the cornea and lens. Carefully detach the retina from the eye by making cuts along the ora serrata and optic nerve.\nPrepare a retinal flat-mount by making four small equidistant incisions from the periphery of the retina towards the optic nerve to clearly delineate the four retinal quadrants. Using a small brush, gently remove any remaining vitreous from the retina. The removal of as much vitreous humour as possible is crucial for obtaining a clean and strong immunohistochemical signal.\nCarefully transfer the retina to a 48-well flat bottom culture plate containing 0.5% Triton X-100 in PBS so that the retina is free-floating. Make sure the ganglion cell layer is facing upwards.",
    "Place the culture plate at -70 °C for 15 min. After thawing the retinas, further permeabilize by washing twice in fresh 2% Triton X-100 in PBS.\nDilute the Brn3a antibody to 0.3 - 0.5 µg/ml with PBS containing 2% Triton X-100 and 2% normal donkey serum. Incubate the retina in the Brn3a primary antibody solution by gently shaking O/N at 4 °C. The retinas should be fully immersed in 150 to 200 µl of solution at all times.\nDilute the donkey anti-goat IgG secondary antibody to 2 µg/ml with PBS containing 2% Triton X-100 and incubate the retina in this solution for 2 hr at RT with gentle shaking. The retina should be fully immersed in the antibody solution at all times. Cover the culture plate with aluminum foil for the remaining steps to prevent photobleaching.\nUsing a brush, carefully transfer the retina to a slide so that the tissue lies as flat as possible. Air dry for 10 min. Mount using anti-fade mounting medium.\nExamine the retinal flat-mounts under a fluorescent microscope. Quantify the number of Brn3a positive RGCs in three non-overlapping areas per retinal quadrant as described.18\n6. Quantification of RGC Axons on Optic Nerve Cross Sections \nCollect the optic nerve from step 4.5 and incubate in 2% osmium tetroxide (OsO4, MW 254.23 g/mol) for 2 hr.\n\tCaution: Due to its high toxicity, osmium tetroxide should be handled in a fume hood with appropriate laboratory attire.\nDehydrate the optic nerve by immersing it in increasing concentrations of ethanol (50%, 70%, 90%, 95%, and 100%) for 15 min each.\nPrepare the epoxy resin using the following recipe: 15.72 ml Embed-812, 6.45 ml dodecenyl succinic anhydride, 7.83 ml nadic methyl anhydride, 0.45 ml DMP-30.",
    "Sequentially incubate the optic nerve in solutions composed of the following ratios of epoxy resin to propylene oxide (MW 58.08 g/mol): 0:1, 1:1, 0.75:0.25, and 1:0. The optic nerve is incubated in each solution at RT for an O/N period.\nIncubate optic nerves embedded in 100% epoxy resin (last step from 6.4) at 60 °C for an additional 48 hr.\nGenerate semi-thin optic nerve cross sections (0.75 µm) using a microtome.\nStain optic nerve cross sections with 1% toluidine blue.\nQuantify the RGC axons in five non-overlapping areas of each optic nerve section as described 19."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}