{
  "id": 17602,
  "origin_website": "Jove",
  "title": "Retinal Organoid Induction System for Derivation of 3D Retinal Tissues from Human Pluripotent Stem Cells",
  "procedures": [
    "1. Culture and expansion of hPSCs\nHPSC culture\nCoat two wells of a 6-well plate with extracellular matrix (ECM, hESC-qualified matrix). Prepare 50 mL of an ECM solution containing 8-12 µg/mL of ECM in Dulbecco's Modified Eagle's Medium (DMEM). In 49 mL of DMEM, add 1 mL of the thawed ECM stock solution (50x). Add 1 mL of the ECM solution to each well of a 6-well plate. Incubate it for 1 h in an incubator at 37 °C and 5% CO2.\nPrepare hPSC maintenance medium (MM) according to the manufacturer's instruction.\nPre-warm MM at room temperature (RT) for 30 min.\nThaw a cryogenic vial of hPSCs (hiPSCs or hESCs) (about 1 x 106) from a liquid nitrogen tank by incubation in a water bath at 37 °C for 30 s.\nTake out the vial, and carefully disinfect it using a 75% disinfection alcohol spray. Put it in a biosafety cabinet.\nTransfer the cell suspension from the vial to a 15 mL tube, add 5 mL of pre-warmed MM drop by drop to the tube using a 5 mL pipette. Meanwhile, gently shake the tube to blend the hPSCs .\nCentrifuge the tube at 170 x g for 5 min. Remove most of the supernatant using a 1 mL pipette carefully and leave behind about 50 µL of supernatant to avoid losing the cells.\nAdd 1 mL of MM to the tube, and resuspend the pellet by gently pipetting up and down once or twice with a 1 mL pipette.\n\t\tNOTE: The survival of single cells of hPSCs is low. Small cell clumps with 3-5 cells are preferred to keep the hPSCs growing in colonies.",
    "Remove ECM from the pre-coated wells (step 1.1.1), add 1.5 mL of MM to each well, and then distribute 0.5 mL of cell suspension per well.\nGently shake the plate to distribute the hPSCs uniformly, and put the plate in an incubator at 37 °C and 5% CO2. Do not move the plate for at least 24 h to promote cell adherence.\nChange MM every other day and passage the hPSCs when the confluence has reached about 80%.\nPassaging of hPSCs\n\tNOTE: The maintenance of the undifferentiated state in hPSCs is quite critical for further applications. Under the adherent conditions, hPSCs grow in colonies with a well-defined border. The cells should be passaged when the confluence of hPSCs reaches about 80%.\n\t\nObserve the cells under a microscope. Mark and mechanically remove the clearly visible differentiated cells (<5%) before passaging.\nPrepare the ECM-coated plate as described in step 1.1.1.\nPre-warm MM and 1x phosphate buffer saline (PBS) without Ca2+ and Mg2+ at RT.\nPre-warm the 0.5 mM EDTA (in 1x PBS) solution in a water bath at 37 °C.\nRemove the medium from the culture plate using a vacuum-aspiration system, add 1 mL of 1x PBS in each well to wash the cells using a 1 mL pipette and repeat twice.\nAdd 1 mL of EDTA solution per well to dissociate the hPSCs in a cell culture incubator at 37 °C and 5% CO2 for 5 min. Do not exceed the recommended incubation time in order to avoid dissociation to single cells.\nTake out the plate and check for the detachment of cells under a microscope. The confluent hPSCs loosen up and each cell border can be seen, but the cells cannot easily come off by gently shaking the cell plate.",
    "Remove the EDTA solution with a 1 mL pipette, and add 1 mL of MM to stop the dissociation. Gently pipette the hPSCs once or twice with a 1 mL pipette to resuspend the cells. There is no need to centrifuge to collect the cells.\n\t\t​NOTE: If most of the cells come off from the plate after incubation with EDTA, cells can be collected by centrifuge.\nRemove ECM from the pre-coated wells (step 1.2.2), and add 1.5 mL of MM per well.\nTransfer 150-200 µL of cell clumps to each well. Generally, hPSCs can be passaged at a ratio of 1:6. For example, cells from one well of a 6-well plate can be distributed to six new wells.\nGently shake the plate to distribute the hPSCs uniformly and culture the hPSCs in the incubator at 37 °C and 5% CO2 for at least 24 h without touching the plate.\nChange MM every other day as described in step 1.1.\n2. Retinal differentiation from hPSCs\nNOTE: When the colonies reach ~80% confluence (Figure 1B), they can be guided to differentiate into retinal organoids following the protocol schematized in Figure 1A. To ensure the hPSCs have high quality and good yield, regularly evaluate the pluripotency with molecular markers such as OCT4 or NANOG using IFC or QPCR. HPSCs should be discarded if differentiated cells account for more than 5% of the total cells. Check for mycoplasma contamination with a mycoplasma detection kit according to the manufacturer's instructions. Use only mycoplasma-free hPSCs as mycoplasma can alter the differentiation capability of hPSCs.\nPrepare media and reagents",
    "Prepare neural induction medium (NIM) by mixing the following: 500 mL of Dulbecco's Modified Eagle Medium/Nutrient Mixture F-12 (DMEM/F-12, 1:1), 5 mL of 1% N2 supplement, 0.5 mL of 0.1% heparin (2 mg/mL in 1x PBS), and 5 mL of 1% MEM Non-Essential Amino Acids (NEAA).\nPrepare retinal differentiation medium (RDM) containing 300 mL of DMEM/F-12, 200 mL of DMEM basic, 10 mL of 2% B27 supplement, 5 mL of 1% Antibiotic Antimycotic, and 5 mL of 1% MEM NEAA.\n\t\tNOTE: Both NIM and RDM are not filtered but a sterility test is performed. Take out 1 mL of medium and add it into a 35 mm dish, and culture for 3-7 days in an incubator at 37 °C and 5% CO2. The media can be stored at 4 °C and should be used within 2 weeks to ensure the activity of the components.\nPrepare 10 mM Blebbistatin (1,000x) in DMSO. Add 1,710 µL of DMSO to dissolve 5 mg of Blebbistatin to obtain 10 mM stock solution (1,000x), aliquot at 10 µL/tube, and store at -20 °C.\n\t\tNOTE: All media and reagents should be warmed at RT for 30 min before use, unless otherwise mentioned.\nEmbryoid body (EB) formation\nOn day 0 (D0), initiate the differentiation. Take out one well of hPSCs from a 6-well plate, which has grown to ~80% confluence. Collect the cells with EDTA dissociation solution as described in steps 1.2.1 to 1.2.6.\nRemove the EDTA solution, add 1 mL of MM containing 10 µM Blebbistatin to stop cell dissociation, and collect the cells with a 1 mL pipette. The size of cell clumps is one of the key factors impacting the yield of EBs. Approximately, five cells per clump are preferred to produce the right size of EBs on D5 to D7.",
    "NOTE: This is a key step. Do not pipette the cells too many times since EB-like aggregates are hard to form from single cells of hPSCs.\nTransfer the cell suspension (about 2 x 106 cells) to a 100 mm ultra-low attachment Petri dish and add 9 mL of MM containing 10 µM Blebbistatin to the dish.\nGently shake the dish twice to distribute the cells uniformly, and put the dish in the incubator at 37 °C and 5% CO2.\nOn D1, after the cells are cultured for at least 24 h, take out the dish and observe it under the microscope. A large number of the small cell aggregates will be spontaneously formed by this time (Figure 1C).\nPrepare 12 mL of mixture with MM and NIM at a 3:1 ratio (9 mL of MM and 3 mL of NIM) in a 15 mL tube.\nTransfer the cell cultures to a 15 mL centrifuge tube with a 10 mL pipette perpendicularly, and add 10 mL of the pre-warmed mixture to the dish.\nCentrifuge the tube at 60 x g for 3 min to collect the aggregates, remove the supernatant using a 5 mL pipette and leave behind about 500 µL to avoid losing cells.\nAdd 2 mL of the mixture to the tube, and transfer the suspension to the same dish (step 2.2.7).\nGently shake the dish to uniformly distribute the cell aggregates, and put the dish back in the incubator.\nOn D2, prepare 12 mL of a new mixture with MM and NIM at a 1:1 ratio (6 mL of MM and 6 mL of NIM) in a 15 mL tube. Change cell medium with the fresh prepared mixture by repeating the steps from 2.2.5 to 2.2.10.",
    "On D3, change cell medium with 15 mL of NIM as described above. Culture the cells for at least 5 days under the suspension conditions.\n\t\tNOTE: During D1 to D3, the medium should be changed each day, providing enough nutrition. Since D3, NIM can be changed every other day. Also, EBs can be divided into several dishes to provide abundant nutrition.\nSeed the EBs\n\tNOTE: On D5 to D7, choose an appropriate time point to plate the EBs on the ECM-coated dishes according to the size of EBs. EBs with an approximate diameter of 200 µm is appropriate for the retinal differentiation. In general, one well of hPSCs in a 6-well plate can produce about 300 to 1,000 EBs. The variation of EB yield is varied by the hPSC lines.\n\t\nOn D4, prepare ECM-coated dishes for EBs adherent culture. Add 5 mL of ECM to each 100 mm tissue culture dish (surface treated), and put them in the incubator overnight.\nOn D5, remove ECM from the pre-coated dishes, and add 10 mL of pre-warmed NIM to each dish.\nTake out the dish containing EBs. Check the quality of EBs under the microscope and ensure that they are quite bright and round in shape. The size of the EBs is approximate 200 µm in diameter. Collect all EBs in a 15 mL tube. Transfer the EBs from the dishes to a 15 mL tube with a 5 mL pipette. Let the EBs settle down for 5 min. Remove most of the supernatant, leaving behind about 2 mL of medium.",
    "Distribute the EBs into the coated dishes containing 10 mL of NIM drop by drop with a 1 mL pipette. Seed the EBs at a density of approximately 2-3 EBs per cm2. For example, add about 120-180 EBs into a 100 mm dish. To roughly judge the EB number, place one drop of EB suspension onto a coverslip, and count the number of EBs under the microscope.\n\t\tNOTE: The plating density of EBs is one of key factors impacting the efficiency of retinal induction. The density can be also adjusted by each hPSC line.\nGently shake the dishes to distribute the EBs uniformly. Put them in the incubator at 37 °C and 5% CO2.\n\t\tNOTE: Do not move the dishes for at least 24 h to enhance the adherence of EBs.\nInduction of optic vesicles (OVs) and retinal pigment epithelium (RPE) in adherent conditions\n\tNOTE: After EBs are seeded on the ECM coated surface, hPSCs can develop OV-like structures, which can be observed as early as D20 after differentiation. In this protocol, specific growth factors or signaling molecules are not required to guide the hPSCs into the retinal fate except the addition of N2 and B27 supplements in the media.\n\t\nOn D8-D9, remove the dishes and observe the EBs under the microscope. All EBs will be attached and spread out on the dishes (Figure 1D). Add 10 mL of  fresh NIM to each 100 mm dish containing 10 mL of old medium. Put them back in the incubator.\n\t\tNOTE: Do not remove the old medium.\nOn D12, change half of the medium with NIM using a 10 mL pipette. Keep the culture in the incubator.",
    "On D16, remove all NIM from the dishes using a vacuum-aspiration system. Add 20 mL of RDM to each dish. Keep culturing in RDM and change half of the medium every other day.\nDuring D10-D30, observe the morphological changes of the cells twice a week under a microscope and evaluate the efficiency of retinal differentiation.\n\t\t​NOTE: Since D10, eye field (EF) domains are self-organized in the peripheral zones of adherent EBs. The OV-like structures appear between D20 to D25, gradually protrude from the dish, and self-form an optic cup, which is surrounded by the pigmented RPE (Figure 1E). The OVs can be easily recognized with the bright, refractive, and thick NR ring.\nDetach and culture OVs and RPE in suspension to obtain retinal organoids (ROs)\nOn D28-D35, most of OVs appear in the dishes. Use a Tungsten needle or a needle with 1 mL syringe to mechanically detach the morphologically identifiable OVs along with the adjacent RPE. Culture them in suspension.\n\t\tNOTE: The appearance and yield of OVs and RPE vary widely in different hPSC lines. Thus, the time point of detaching OV and RPE is flexible. Obvious OVs with the adjacent RPE can be detached, and then moved to a low attachment culture dish containing RDM. Keep culturing the rest of the cells until all OVs and RPEs are lifted up.\nPut 50-60 OVs into each 100 mm low attachment culture dish containing 15 mL of RDM for the ROs formation (Figure 1F).\nChange RDM every 2-3 days until D42, when the ROs are well round-shaped.\n3. Retinal development and maturation\nNOTE: In this protocol, serum is required to keep the ROs grow and mature for long-term culture.\nRetinal lamination and specification in ROs",
    "Prepare 10 mL of 100 mM taurine (1,000x) in 1x PBS. Weigh 125 mg of taurine, and dissolve in 10 mL of 1x PBS. Filter the solution with a 0.22 µm syringe filter. Aliquot at 500 µL/tube, and store at -20 °C.\nPrepare retinal culture medium 1 (RC1). Mix the following components: 250 mL of DMEM/F-12, 175 mL of DMEM basic, 50 mL of fetal bovine serum,10 mL of 2% B27 supplement, 5 mL of 1% Antibiotic Antimycotic, 5 mL of 1% MEM NEAA, 0.5 mL of 100 µM taurine, and 5 mL of 2 mM L-alanyl-L-glutamine.\nPrepare retinal culture medium 2 (RC2) containing 450 mL of DMEM/F-12, 50 mL of fetal bovine serum, 5 mL of 1% N2 supplement, 5 mL of 1% Antibiotic Antimycotic, 0.5 mL of 100 µM taurine, 5 mL of 1% MEM NEAA, and 5 mL of 2 mM L-alnyl-L-glutamine.\n\t\tNOTE: The RC1 and RC2 are not filtered, but undergo a sterility test. Take out 1 mL of medium, add it to a 35 mm dish, and culture for 3-7 days in the incubator at 37 °C and 5% CO2, to ensure sterility before use. The medium can be stored at 4 °C and should be used within 2 weeks to ensure the activity of the components. All media and reagents should be pre-warmed at RT for 30 min before use.\nOn D42, switch the culture medium from RDM to RC1.\nTilt the dishes at about 30˚ and let the ROs settle down for 30 s. Remove the old RDM with a 10 mL pipette leaving behind about 1 mL of medium to avoid losing ROs. Add 15 mL of fresh RC1 to each dish.",
    "Gently shake the dishes to distribute the ROs uniformly. Put the dishes back in the incubator. Change the whole medium twice a week thereafter.\nDuring D50-D90, select out high quality of ROs for long-term culture, which are round-shaped with a thick and bright NR. Place 30-40 ROs in a 100 mm low attachment dish with 20 mL of RC1,and  change the whole medium twice a week.\nFor the long-term suspension culture of ROs, pipette the ROs to avoid RO-RO reattaching using a pipette. Transfer ROs to new culture dishes once a month to avoid ROs sticking to the surface of the dishes.\n\t\tNOTE: Under the suspension culture conditions, ROs are round-shaped, with a bright and thick NR ring attached with more or less RPE at one side. Laminated neural retina develop and retinal cell subtypes sequentially appear with retinal ganglion cells first generated, followed by photoreceptor cells, amacrine cells, and bipolar cells.\nHuman photoreceptor maturation with enrichment of cones in ROs\nAfter D90, switch the medium from RC1 to RC2, which is suitable for photoreceptor maturation.\nChange the medium as described in steps 3.1.7-3.1.8.\n\t\tNOTE: Under this culture condition, ROs can grow long-term (Figure 1G), up to D300 tested. Retinal cells in ROs become mature, and all cell subtypes of neural retina, including muller glial cells, rods and cones are also acquired. Without any addition of RA, cone photoreceptors are also rich in ROs.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}