{
  "id": 15041,
  "origin_website": "Jove",
  "title": "An Approach to Study Shape-Dependent Transcriptomics at a Single Cell Level",
  "procedures": [
    "All the procedures involving animals were in accordance with the regulations of the animal ethics committee of the Karolinska Institutet, Stockholm, Sweden.\n1. Micro-patterned chip layout\nUse a custom-designed chip (Table of Materials) (Figure 1A): a 19.5 mm x 19.5 mm coverslip with activated micropatterns, printed by photolithography on borosilicate glass.\n\tNOTE: These micropatterns are surrounded by a cytophobic area. Therefore, a seeded cell can only attach and grow on one of these micropatterns and capture the AR of that micropattern. The chip is divided into three zones and each zone consists of micropatterns with a specific AR. The chip layout is shown in Figure 1B. The geometry of the defined ARs is presented in Table 1. Magnified fluorescent images of the different shapes of the fibronectin micropatterns are shown in the lower images in Figure 1B.\n2. Coating micropatterned chips\nPrepare 2x coating protein solution for each chip by adding 80 µg of fibronectin to 2 mL of phosphate-buffered saline (PBS-/-).\nTransfer a chip to a 35 mm Greiner Petri dish and immediately add 2 mL of PBS-/-. Then add 2 mL of the 2x coating protein solution.\nIncubate the chips at room temperature for 2 h.\nWash the coating solution by successive dilution steps with PBS-/-. The chip surface should always be wet. Then, replace the PBS with 2 mL of plating medium and incubate at 37 °C until seeding cells.\n3. Isolation of CMs\nPrepare the plating medium by supplementing DMEM:M199 (4:1) with 10% horse serum, 4% fetal bovine serum, 2% HEPES (1 M) and 1% penicillin/streptomycin (10,000 U/mL)22.\nDissect the tissue from the left ventricle of 2-day-old neonatal rat hearts and transfer to a 10 cm dish containing PBS. Cut the tissue into approximately 1 mm3 pieces.",
    "Transfer the harvested tissue into a rotor-cap tube, equipped with a rotor in the cap for tissue dissociation (Table of Materials). Let the tissue settle down and then carefully remove the supernatant.\nAdd 2.5 mL of the mixture of enzyme mix 1 and 2, prepared using the Neonatal Heart Dissociation Kit (Table of Materials), to the C Tube and close the cap tightly.\nInsert the rotor-cap tube onto the sleeve of the dissociator, equipped with heaters (Figure 2A and B) (Table of Materials). Run the incubation program 37C_mr_NHDK_1 (Figure 2C), which lasts about an hour.\nWhile the incubation program is running, prepare PEB buffer containing 2 mM EDTA and 0.5% bovine serum albumin (BSA) in PBS, pH 7.2, and keep it at 4 °C.\nAfter termination of the incubation program, detach the rotor-cap tube (Figure 2D) and add 7.5 mL of pre-warmed plating medium.\nResuspend the sample and filter the cell suspension using a 70 µm strainer.\nWash the strainer with another 3 mL of plating medium.\nCentrifuge the cell suspension at 600 x g for 5 min. Aspirate the supernatant completely.\nResuspend the cell pellet in 60 µL of cold PEB buffer.\nAdd 20 µL of Neonatal Cardiomyocyte Isolation Cocktail (Table of Materials), containing micron-sized beads that target non-CMs.\nAdd 20 µL of Anti-Red Blood Cell beads (Table of Materials).\nMix the suspension and incubate at 4 °C for 15 min.\nAdd 400 µL of PEB buffer.\nApply the cell suspension onto the LD column (Table of Materials), which has been inserted vertically into a magnet stand and washed well with PEB buffer.\nCollect unlabeled cells and wash column with 0.5 mL of PEB buffer.",
    "Add 8 mL of plating medium and transfer the cell suspension into a 75-cm2 uncoated culture flask and incubate at 37 °C for 1.5 h. The remaining non-CMs will start to adhere to the uncoated cell culture and the cell suspension will be enriched by the CM population.\n4. Patterning CMs\nNOTE: We compared single CMs with ARs of 1:1, 7:1 or 11:1. This is done by seeding the isolated neonatal rat CMs onto a specially designed chip filled with fibronectin-coated micropatterns with defined ARs of 1:1, 7:1 or 11:1. The micropatterns were coated by fibronectin, surrounded by cytophobic surface. Therefore, CMs will attach, spread and capture the defined AR of micropatterns by solely growing on the fibronectin substrate. Pattern the isolated CMs according to the following steps.\nTransfer the cell suspension to a 15 mL tube, count the cells and dilute to a concentration of 100,000 cells per mL by adding appropriate plating medium.\nAdd 2 mL of cell suspension onto the chip, which has already been submerged in 2 mL of warm plating medium inside a 35 mm Greiner Petri dish.\nIncubate the dish at 37 °C with 5% CO2 to let the CMs attach to the fibronectin-coated micropatterns and allow each CM to acquire the AR of its substrate micropattern.\nAfter 18 h, check the chip. If most of the cells have attached, detach and remove the debris and dead cells that are attached to the patterned cell. Do this by removing the plating medium and gently adding PBS-/- dropwise, starting from the center of the chip then moving towards the sides. Repeat 2 times.\nAspirate the PBS with fresh maintenance medium by supplementing DMEM:M199 (4:1) with 4% horse serum, 4% fetal bovine serum, 2% HEPES (1 M) and 1% penicillin/streptomycin (10,000 U/mL).\n5. Picking adherent CMs",
    "NOTE: After a culturing period of 72 hours, patterned single CMs are picked from their fibronectin micropatterns using a semi-automated cell picker (Table of Materials) (Figure 3). The cell picker uses a software23 to control the motorized stage (Figure 3A). A 70 µm glass microcapillary (Figure 3B) is used to pick and inject the patterned neonatal rat CMs. The cell picker sorts adherent cells by generating a vacuum and injecting the cells by applying pressure. The vacuum in syringe number 1 is applied by pulling the syringe using the syringe pump (Figure 3C). The hydrostatic pressure is based on gravity and induced by placing syringe number 2 at a distance of 87 cm over the microscope desk. Syringes 1 and 2 are respectively connected via PTFE tubes, to valves 1 and 2, which are embedded in the control unit (Figure 3D). The PTFE tubes are completely filled with RNase-free water. The picked single cell is then injected to the polymerase chain reaction (PCR) tube, containing 3.55 µL of lysis buffer.\nAfter a culturing period of 72 hours, remove the old medium and gently flush the chip surface with warm DPBS-/-.\n\t\nKeep the dish flat and aspirate the old medium gently with a 1000 µL pipette from one side of the dish. Make sure that the chip remains wet at all times.\nAdd 2 mL of DPBS-/- gently and drop-wise detach most of the dead cells that are attached to the patterned cells, starting from the center of the chip and then moving to its sides.\nAspirate most of the DPBS to remove as many detached floating cells as possible, starting from the center of the chip and then moving to the sides.\nRepeat steps 5.1.2 and 5.1.3 once more.",
    "Use angled forceps to grab the edge of the chip and immediately transfer it to a new sterile 35 mm Greiner Petri dish to reduce the number of floating cells while picking.\nImmediately add 1.5 mL of DPBS-/- so that the chip does not dry out.\nAdd 1.5 µL of Vibrant Dye Cycle green to visualize the nuclei of the live cells.\nPlace the chip in the center of the Greiner Petri dish by using the tip of the forceps.\nPut a chamber (Table of Materials) over the chip. The chamber will fix the chip to the bottom of the dish, without blocking access to the cell patterns.\nMount the Greiner Petri dish onto the dish holder of the cell picker stage and insert the magnetic cap.\nCalibrate the automated injection.\n\t\nLocate the crosshair, which is engraved on the motorized stage in the middle of the image in the Live View window.\nFocus on the crosshair and select the Calibration for automated injection button in the Scanning and sorting window.\nReplace the DPBS-/- with 1.5 mL of DPBS/trypsin-/- (1:1) while the dish is on the stage, to loosen the cells from the fibronectin so that a fluidic vacuum can be used to pick the cells.\nScan the whole chip using the Scanning tab in the Scanning and sorting window. Locate the top left corner of the chip in the field of view and click on Get current microscope position in the top left corner row.\n\t\nThen, move the motorized stage to the bottom right corner of the chip. Focus the microscope and click on Get current microscope position in the bottom right corner row.",
    "Click on the Set sharpest plane button and on the popped up window click on the Go to the top right corner. Focus the microscope and click on Go to the bottom left corner and set the focus. When done click the Finish button and start scanning.\nWhen the scanning is terminated, go to the Analyzing tab and select the single cells that pass the study criteria.\nMake sure that the glass microcapillary is in the middle of the microscope’s live view.\nControl the syringe pump using the Pump window of the software. Create a vacuum by withdrawing 4 mL from a 50 mL number 1 syringe, which has a diameter of 27 mm.\nIn the Sorting tab\n\t\nSet the injection parameters of the valves. It was calculated that the injection volume that delivered a picked single cell was 1 μl, if valve 2 was opened for 120 milliseconds and then valve 1 opened for 20 was milliseconds after a time lapse of 200 milliseconds. Due to the elasticity of the tubes, open valve 1 to stop injecting the flow.\nSet the pick-up parameters of the valves. It was calculated that if valve 1 was opened for 20 milliseconds and then valve 2 was opened for 10 milliseconds, after a time lapse of 10 milliseconds, most of the patterned cells can be picked up. This is because their fibronectin bindings were loosened after being treated by trypsin.\nClick on the Compute the path button. The software computes the fastest path from cell to cell, to pick up and inject the selected cells throughout the chip.\nFocus the microscope on a patterned cell on the chip surface.",
    "Using the joystick, move the microcapillary down carefully, so that the sharpest image of the tip of the microcapillary can be obtained without touching the cell.\nClick the Set button in the Micropipette offset section. A new window will pop up, showing the microcapillary cross section. Click on the exact center of the capillary. The software will then record the tip offset of the capillary in the x, y and z coordinates.\nLaunch sorting using the Start sorting button."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}