{
  "id": 7152,
  "origin_website": "Bio",
  "title": "Intestinal Co-culture System to Study TGR5 Agonism and Gut Restriction",
  "procedures": [
    "Grow cells to confluencyPrepare and filter-sterilize complete DMEM and RPMI media (Recipe 1). Warm media to 37 °C prior to use.Thaw the attachment cell line Caco-2 and resuspend in complete DMEM media (Gagnon and Brubaker, 2015). Thaw the suspension cell line NCI-H716 and resuspend in complete RPMI media (Gagnon and Brubaker, 2015; Lea, 2015).Seed both cell lines separately into TC treated flasks (seeding density for Caco-2 cells, 1 × 104 cells per cm2; NCI-H716 cells, 4 × 105-8 × 105 cells per ml) and immediately transfer them to the tissue culture incubator (5% CO2, 37 °C). Media added at 0.2 ml per cm2.Passage Caco-2 cells by first detaching cells with 1× Trypsin-EDTA (1 ml per cm2) for no more than 10 min in the tissue culture incubator. Once cells are detached, add complete DMEM media to the flask to deactivate the Trypsin enzyme, followed by resuspension in complete DMEM media in the flask and transfer to flasks at a subcultivation ratio of 1:5, followed by incubation in the tissue culture incubator. Passage NCI-H716 cells by collection of cells in Falcon tubes and centrifugation at 500 × g, 5 min, room temperature. Remove supernatant and resuspend cells in fresh complete RPMI media, transfer to flasks at a subcultivation ratio of 1:5, followed by incubation in the tissue culture incubator.Grow Caco-2 and NCI-H716 cells in TC Treated Flasks for up to 2 weeks to obtain desired number of cells for seeding and differentiation (see Step A3). Thaw the appropriate number of cells in Step A2 such that the required number of cells are obtained in 2 weeks, which is the optimal growth time for robust differentiation. Cells should not be passaged more than 15 times to avoid heterogeneity in chromosome distribution, which could affect differentiation and gene expression in the cell lines.",
    "Count Caco-2 and NCI-H716 cells in a hemocytometer using Trypan blue staining. Once desired confluency is reached, proceed to differentiation step.Note: For a 24-well transwell, 200,000 Caco-2 cells and 50,000 NCI-H716 cells will be required to initiate differentiation (see Step B3). Therefore, with 1 confluent 75 cm2 TC Treated Flask of each cell line, approximately 40 24-well transwells can be seeded for differentiation. Seed and differentiate cells in TranswellsTo start differentiation and co-culture, Trypsinize and collect Caco-2 cells, and collect NCI-H716 cells in 50 ml Falcon tubes, followed by centrifugation (500 × g, 5 min, room temperature).Remove supernatant and resuspend cells in desired volume of fresh complete DMEM media.Mix 200,000 Caco-2 cells with 50,000 NCI-H716 cells in Falcon tubes, and seed in each 24-well plate transwell inserts to mimic the ratio of epithelial cells to enteroendocrine cells in the human colon (Cristina et al., 1978). The final volume of media and cells in each transwell insert should be 100 µl, and the final number of cells seeded is 250,000 per transwell insert.Add 500 µl of complete DMEM media in the basolateral chamber of the transwell inserts. Use DMEM media throughout differentiation. Transfer plates to the tissue culture incubator for differentiation (Day 1).Replace media on Days 4, 8, 12, 16, and 18 to differentiate cells (Lea, 2015). To change media, carefully remove media, first from the apical compartment of the transwells (without disturbing or touching the seeded cells), then from the basolateral chamber. Replace with fresh complete pre-warmed DMEM media, first by adding 100 µl media to the apical chamber, then by adding 500 µl media to the basolateral chamber of the transwell inserts.Differentiation of cells will take 21 days. On Day 21, differentiated polarized cells are ready for assays (Figure 1), and must be utilized by Day 27.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3948/bioprotoc-11-06-3948-g001.jpgFigure 1.",
    "Electron microscopy images of intestinal cells in transwells. A. Scanning electron microscopy (SEM) images of Day 1 (undifferentiated) and Day 21 (differentiated) Caco-2 + NCI-H716 cells. Differentiated cells have a monolayer of cells with distinct microvilli. Scale bars from left to right, 400 µm and 4 µm. B. Transmission electron microscopy (TEM) images of differentiated Caco-2 + NCI-H716 cells. Asterisk (*) shows tight junctions between adjacent cells, arrow (>) show desmosomes. Scale bar, 400 nm. C. Transmission electron microscopy (TEM) images of differentiated Caco-2 + NCI-H716 cells. The cell on the left is a Caco-2 epithelium cell, while the cell on the right is a NCI-H716 enteroendocrine cell with relatively displaced nucleus (*) and presence of dark granules (>) (Gonzalez et al., 2013). Scale bar, 400 nm. D. Higher-magnification of the NCI-H716 cell from (C) showing structures of the dark granules (>). Asterisk shows the nucleus (*). Scale bar, 2 µm. Electron microscopy performed by the EM core at Harvard Medical School.Transfection of differentiated Caco-2 + NCI-H716 cells with siRNAs or shRNA plasmidsPrepare desired concentration of siRNAs or shRNA plasmids (for example, 40 nM) in low serum media such as OptiMEM with a transfection reagent such as Lipofectamine 3000 (Recipe 2). Perform transfection according to manufacturer’s instructions on Day 19 of differentiation.Perform first siRNA or shRNA treatment by adding siRNA or shRNA plasmids in low-serum and antibiotic-free media to the apical chamber at 100 µl and the basolateral chamber at 500 µl and incubate for 12 h.After the 12 h incubation, replace media with complete DMEM media for 12 h.",
    "After the 12 h incubation, on Day 20 of differentiation, perform second siRNA or shRNA treatment by adding siRNA or shRNA plasmid in low-serum and antibiotic-free media such as OptiMEM to the apical chamber at 100 µl and the basolateral chamber at 500 µl and allow to incubate for 12 h.After the 12 h incubation, replace media with complete DMEM media for 12 h.On Day 21, siRNA- or shRNA-treated differentiated polarized cells are ready for assays, and must be utilized by Day 23.Treatment of differentiated cells with small molecules such as bile acids for GLP-1 secretion assayPrepare concentrated molecule stocks to be tested in the desired concentrations in a suitable vehicle such as DMSO or PBS. Use appropriate vehicle as negative control. Do not use >10% DMSO solution to minimize toxic effects of DMSO on the cells and the monolayer integrity.Prepare low serum RPMI media (0.5% FBS) (Recipe 3) without antibiotics, and prepare dilutions of molecules in this media (Gagnon and Brubaker, 2015).On Day 21 of the differentiation, remove media from both the apical and basolateral compartments of the transwells.To test if molecules can induce GLP-1 secretion when treated apically, add molecules diluted in low serum RPMI media (Gagnon and Brubaker, 2015) to the apical chamber of the transwell inserts in a total volume of 100 µl. Add 500 µl of low serum RPMI media to the basolateral chamber. The monolayer would prevent diffusion of media between the chambers.To test if molecules can induce GLP-1 secretion when treated basolaterally, add molecules diluted in low serum RPMI media to the basolateral chamber of the transwell inserts in a total volume of 500 µl. Add 100 µl of low serum RPMI media to the apical chamber.Incubate in the tissue culture incubator for 2 h.",
    "During the incubation, prepare Microfuge tubes with 1% TFA in water to collect basolateral media such that the final concentration of TFA will be 0.1%. Keep on ice. For example, for 1 ml of media to be collected, prepare tubes with 10 µl of 1% TFA on ice.Prepare cell lysis buffer (Recipe 4) fresh and keep on ice.After the incubation period, collect basolateral media and transfer to prepared Microfuge tubes with TFA.Remove apical media, add 200 µl of cold cell lysis buffer (Recipe 4) to each transwell. Collect cells by gently scraping the transwells, and transfer contents into Precellys lysing tubes with beads.Lyse cells by homogenization in a MagNA Lyser at 2,800 × g for 1 min, ideally in a cold room to prevent heating of the samples during homogenization.Freeze collected cells and media at -80 °C for future analysis described in E. Alternate protocols for GLP-1 peptide purification and measurement can also be used.GLP-1 peptide purification and quantification (for ELISA-based detection of GLP-1)Thaw frozen samples on ice.Centrifuge media at 1,800 × g, 10 min at 4 °C to pellet cell debris.During the centrifugation, prepare GLP-1 peptide purification and elution buffers. Buffer A (wash buffer) is 0.1% TFA in water, buffer B (elution buffer) is 0.1% TFA in 80% isopropyl alcohol in water.Pretreat Sep-Pak columns by adding 500 µl of buffer B. Allow buffer to drip through the columns or use air pressure or centrifugation at 11,000 × g, 1 min to force the buffer through the columns. Discard eluate.Equilibrate Sep-Pak columns by adding 500 µl of buffer A. Allow buffer to drip through the columns or use air pressure or centrifugation at 11,000 × g, 1 min to force the buffer through the columns. Discard eluate.Load columns with media or cell lysate at 200-300 µl.",
    "Incubate at room temperature for 5 min.Allow buffer to drip through the columns or use air pressure or centrifugation at 11,000 × g, 1 min to force the buffer through the column. Discard eluate.Wash by adding 500 µl of buffer A. Allow buffer to drip through the columns or use air pressure or centrifugation at 11,000 × g, 1 min to force the buffer through the columns. Discard eluate.Elute GLP-1 peptide by adding 500 µl of buffer B. Allow buffer to drip through the columns or use air pressure or centrifugation at 11,000 × g, 1 min to force the buffer through the columns. Collect the eluate in a 96-well plate directly by allowing flow-through to drip into wells.Dry the eluate containing purified GLP-1 peptides in a SpeedVac for 4 h.Resuspend in 100 µl 0.1% TFA in water and freeze at -80 °C for GLP-1 measurement analysis.Use purified peptides in GLP-1 EIA Kit to measure total GLP-1 levels according to manufacturer’s instructions with 0.1% TFA in water as a negative control in addition to vehicle control used for normalization (Figure 2A). The following calculation may be used to determine percentage GLP-1 secretion:Percentage GLP-1 secretion = (Total GLP-1 secreted into media)/(Total GLP-1 secreted into media + Total GLP-1 in cell lysates) × 100.Treatment of differentiated cells with molecules for induction of TGR5 expressionPrepare concentrated molecule stocks to be tested in the desired concentrations in a suitable vehicle such as DMSO or PBS. Use appropriate vehicle as negative control. Do not use >10% DMSO solution to minimize toxic effects of DMSO on the cells and the monolayer integrity.Prepare dilutions of molecules in complete DMEM media.On Day 21 of the differentiation, remove media from the apical and basolateral compartment of the transwells.",
    "To test if molecules (here we test bile acid metabolites) can induce TGR5 expression when treated apically, add molecules diluted in complete DMEM media to the apical chamber of the transwell inserts in a total volume of 100 µl. Add 500 µl complete DMEM media to the basolateral chamber.To test if molecules can induce TGR5 expression when treated basolaterally, add molecules diluted in complete DMEM media to the basolateral chamber of the transwell inserts in a total volume of 500 µl. Add 100 µl of complete DMEM media to the apical chamber. Complete DMEM media is used here to provide cells with optimal FBS and glucose so that the monolayer integrity is not compromised during the overnight incubation in the next step.Incubate in the tissue culture incubator overnight (up to 16 h).After the incubation period, remove media from the apical and basolateral chambers and wash transwells gently with PBS.Add TRIZol or other appropriate buffers directly to the transwells for RNA extraction, and scrape cells to collect into Microfuge tubes.Freeze at -80 °C for future RNA extraction and qPCR analysis (Figure 2B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3948/bioprotoc-11-06-3948-g002.jpgFigure 2. Testing of small molecule TGR5 agonists for induction of TGR5 expression and GLP-1 secretion using the co-culture transwell system. A-B. Cholic acid-7-sulfate (CA7S), a naturally occurring TGR5 agonist and GLP-1 secretagogue induces GLP-1 secretion (A) and TGR5 expression (B) in differentiated Caco-2 + NCI-H716 cells when treated apically or basolaterally, similar to previous observations (Chaudhari et al., 2021). (≥3 biological replicates per condition, CA7S Apical GLP-1, **P = 8 × 30-3; CA7S Basolateral GLP-1, *P = 0.03; CA7S Apical TGR5, ***P = 3 × 10-4; CA7S Basolateral TGR5, *P = 0.01, Welch’s t-test). No detectable induction of GLP-1 or TGR5 expression was observed in differentiated Caco-2 cells alone.",
    "GLP-1 absorbance readings and qPCR analysis were performed as described previously (Chaudhari et al., 2021) at the ICCB-Longwood Screening facility at Harvard Medical School. See Data analysis section for calculation of relative GLP-1 secretion in A. All data are presented as mean ± SEM.Treatment of differentiated cells with molecules for determination of gut-restricted properties, cell toxicity, and effect on intestinal permeabilityPrepare concentrated molecule stocks to be tested in the desired concentrations in a suitable vehicle such as DMSO or PBS. Use appropriate vehicle as negative control. Do not use >10% DMSO solution to minimize toxic effects of DMSO on the cells and the monolayer integrity.Prepare dilutions of molecules in complete DMEM media.On Day 21 of the differentiation, remove media from the apical and basolateral compartment of the transwells.To test if molecules are gut-restricted, add molecules diluted in complete DMEM media to the apical chamber of the transwell inserts in a total volume of 100 µl. Add 500 µl complete DMEM media to the basolateral chamber.Incubate in the tissue culture incubator overnight (up to 16 h).After the incubation period, collect basolateral media in Microfuge tubes.Detect and quantify molecules in basolateral media using appropriate instruments and assays (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3948/bioprotoc-11-06-3948-g003.jpgFigure 3. Testing of small molecule TGR5 agonists for gut-restricted properties using the co-culture transwell system. A. Cholic acid-7-sulfate (CA7S, 100 µM) is undetected in the basolateral chamber when treated apically in differentiated Caco-2 + NCI-H716 cells. B. CA7S is undetected in the apical chamber when treated basolaterally (100 µM) in differentiated Caco-2 + NCI-H716 cells. These data (A and B) suggest that CA7S does not pass through an intestinal epithelial monolayer and suggests that CA7S is gut-restricted (≥3 biological replicates per condition). C. Representative UPLC-MS traces for A and B. D.",
    "Tauro-deoxycholic acid (TDCA), a naturally occurring TGR5 agonist, is detected in the basolateral chamber when treated apically (100 µM) in differentiated Caco-2 + NCI-H716 cells. E. TDCA is detected in small amounts in the apical chamber when treated basolaterally (100 µM) in differentiated Caco-2 + NCI-H716 cells. These data (D and E) suggest that TDCA does pass through an intestinal epithelial monolayer and suggests that TDCA is not gut-restricted (≥3 biological replicates per condition). F. Representative UPLC-MS traces for D and E. Quantification of CA7S and TDCA directly in media was performed by UPLC-MS-based detection as described previously (Yao et al., 2018; Chaudhari et al., 2021). All data are presented as mean ± SEM.To test whether molecules were toxic to the monolayer, cell viability can be measured using the MTT assay or CellTiter-Glo assay according to manufacturer’s instructions and media provided in the respective kits (Figure 4A).To test whether molecules damaged/affected intestinal barrier integrity, test transwells for epithelial integrity by Fluorescein isothiocyanate-dextran (FITC-D, 4 kDa) permeability assay.Prepare 5 µM FITC-D in PBS in the dark.On Day 21 of the differentiation, remove media from the apical and basolateral compartments of the transwells.Add 5 µM FITC-D solution to the apical chamber of transwell inserts with cells, and add 500 µl of PBS to the basolateral chamber.Transfer plates to the tissue culture incubator, and incubate for exactly 20 min.After incubation, remove and discard transwell inserts.Transfer 100 µl of the basolateral chamber PBS into black 96-well plates.Measure FITC-D by measuring fluorescence in a fluorescence plate reader with an excitation wavelength of 485 nm and an emission wavelength of 530 nm (Figure 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3948/bioprotoc-11-06-3948-g004.jpgFigure 4. Testing of small molecule TGR5 agonists for toxicity and effect on intestinal permeability using the co-culture transwell system. A-B .",
    "Naturally occurring TGR5 agonists cholic acid-7-sulfate (CA7S) and tauro-deoxycholic acid (TDCA) do not affect cell viability (A) in the MTT assay, nor induce intestinal permeability (B) in the FITC-D assay in differentiated Caco-2 + NCI-H716 cells. These results suggest that CA7S and TDCA are not toxic to human intestinal epithelial and enteroendocrine cells. When TDCA is treated apically, this compound does not cause epithelial toxicity or disrupt the gut barrier integrity, suggesting that accumulation of TDCA in the basolateral chamber (Figure 3D, F) may occur via active or passive transport. Data not marked with asterisk (*) is not significant. (≥3 biological replicates per condition. A. CA7S vs. DMSO, P = 0.93; TDCA vs. DMSO, P = 0.62; B. CA7S vs. DMSO, P = 0.26; TDCA vs. DMSO, P = 0.45, one-way ANOVA followed by Dunnett’s multiple comparisons test). MTT absorbance and FITC-D fluorescence readings performed as described previously (Chaudhari et al., 2021) at the ICCB-Longwood Screening facility at Harvard Medical School. All data are presented as mean ± SEM."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}