{
  "id": 2088,
  "origin_website": "Cell",
  "title": "Detecting archaic introgression and modeling multiple-wave admixture with ArchaicSeeker 2.0",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nInstall ArchaicSeeker 2.0 and MultiWaver 2.1\nTiming: 4 min\nCompile the ArchaicSeeker 2.0 (Troubleshooting 1[href=https://www.wicell.org#sec6.1] and 2[href=https://www.wicell.org#sec6.3]).\nFirst modify the parameters specified by CFLAG (-I and -L) in the makefile into the path of installed libraries, and then type the following commands to compile:\n> cd ArchaicSeeker2.0\n> make clean\n> make all\nNote: This is an optional step. We have provided the static version of ArchaicSeeker 2.0 and it is executable in Linux Systems (Troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nCompile the getAS2Seg and MutliWaver 2.1 (Troubleshooting 4[href=https://www.wicell.org#sec6.7]).\n> cd WaveEstimate/getAS2Seg\n> rm getAS2Seg\n> g++ getAS2Seg.cpp -o getAS2Seg\n> cd ../MultiWaver2.1\n> make clean\n> make\nNote: This is an optional step. We have provided the static version of getAS2Seg and MultiWaver 2.1 and they are executable in Linux Systems.\nPrepare input data for ArchaicSeeker 2.0\nTiming: 1 h\nCritical: The software ArchaicSeeker 2.0 takes the following six files respectively regarding to the information of several VCF files (archaic hominins, African population, and the test non-African population), recombination map, population annotation, outgroup population, ancestral allele states, prior matching model as input (Troubleshooting 7[href=https://www.wicell.org#sec6.13]).\nPrepare the configuration file about the phased genomic VCF files.\nHere is the VCF configuration file “vcf.par” in the examples folder:\nvcf\nexamples/Neanderthal.KGP3.combined.21.vcf.gz\nexamples/Neanderthal.KGP3.combined.22.vcf.gz\nexamples/Denisova.KGP3.combined.21.vcf.gz\nexamples/Denisova.KGP3.combined.22.vcf.gz\nexamples/YRI.chr21.vcf.gz\nexamples/YRI.chr22.vcf.gz\nexamples/Han.chr21.vcf.gz\nexamples/Han.chr22.vcf.gz\nCritical: The VCF configuration file should begin with the “vcf” and arrange the paths to the genomic VCF files in the following rows.\nNote: Input genomic VCF files should be phased and at least include the archaic hominins, African, and the test non-African population (Troubleshooting 5[href=https://www.wicell.org#sec6.9] and 6[href=https://www.wicell.org#sec6.11]).",
    "Note: Physical positions cannot be duplicated and should be strictly increasing in one single VCF File. Only biallelic SNPs are allowed and the reference allele in the input VCF files should be same as that of ancestral allele states.\nNote: The order of input VCF files can be arbitrary and random. Nonetheless, we recommend that for the same chromosome, make the VCF file with fewer SNPs in front as our algorithm can take the intersection of the input VCF files automatically.\nPrepare the configuration file regarding the recombination maps.\nHere is the recombination configuration file “remap.par” in the examples folder:\nremap                                                contig\nexamples/genetic_map_chr21_combined_b37.txt  21\nexamples/genetic_map_chr22_combined_b37.txt  22\nCritical: The recombination configuration file consists of two columns and should start with the “remap contig”. The paths to the recombination file and corresponding Chromosome ID are arranged in the following rows.\nNote: The recombination map file consists of three columns representing the physical position (unit: bp), recombination rate (unit: cM/Mb), and genetic distance (unit: cM).\nNote: Recombination information of different chromosomes should be put separately in different files.\nPrepare the population annotation files.\nHere show the several lines of the population annotation file “pop.par” in the examples folder:\nID              Pop            ArchaicSeekerPop\nDenisovaPinky  Denisova      Archaic\nAltaiNea        Neanderthal  Archaic\nNA18486          YRI            African\nNA18488          YRI            African\n……              ……            ……\nNA19257          YRI            African\nHan-3            Modern        Test\nHan-1            Modern        Test\nHan-2            Modern        Test\nCritical: The header line of the population annotation files should be the “ID Pop ArchaicSeekerPop”.\nNote: This file demonstrates the individual ID and corresponding population label in the prior matching model as well as the population label specified by ArchaicSeeker 2.0, one individual per line.\nNote: The population label specified by ArchaicSeeker 2.0 should be one of the “Archaic”, “African”, and “Test”, which respectively corresponds to the archaic hominins, African population, and test non-African population.",
    "Prepare the configuration file regarding the outgroup genomic files.\nHere we show the outgroup configuration file “outgroup.par” in the examples folder:\noutgroup                              contig\nexamples/chr21.hg19.chimp.fa.gz  21\nexamples/chr22.hg19.chimp.fa.gz  22\nCritical: The outgroup configuration file starts with “outgroup contig”. The following lines specify the path to each outgroup genomic file and corresponding chromosome ID, one file per line.\nNote: The genomes of the outgroup population are used to determine the root of the model. The Chimpanzee reference genome is recommended to represent the outgroup population. The input genome should be in FASTA format and one chromosome per file.\nPrepare the configuration file regarding the ancestral allele state files.\nHere is the ancestral allele states configuration file “anc.par” in the examples folder:\nancestor                                        contig\nexamples/homo_sapiens_ancestor_21.fa.gz  21\nexamples/homo_sapiens_ancestor_22.fa.gz  22\nCritical: The ancestral allele states configuration file starts with “ancestor contig”. The following lines specify the path to each ancestral allele states file and corresponding chromosome ID, one file per line.\nNote: The ancestral state files are used to determine the ancestral allele state of each SNP. Same as the above outgroup genomic file, the information should be in FASTA format and one chromosome per file.\nPrepare the matching model file.\nHere we show the matching model file “model.txt” in the examples folder and the corresponding tree topology (Figure 1[href=https://www.wicell.org#fig1]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1572-Fig1.jpg\nFigure 1. Corresponding tree topology of the example matching model\n((YRI:100,Modern:100):557.5,(Denisova:340,Neanderthal:300):237.5);\nNote: The matching model describes the prior phylogenetic relationship information of input populations. The model is in the “Newick” tree format and the leaf node is denoted by the population ID. The unit of time could be in generations, one thousand years, or others specified by the users. In the above example file, the unit is in one thousand years.",
    "Note: With the addition of Vindija Neanderthal, the matching model could be as follows: ((YRI:100,Modern:100):557.5,(Denisova:340,(Vindija:82.5,Neanderthal:20):280):237.5);.\nNote: For estimating the archaic introgression proportion in the non-African modern human population, the above model example can be used. Actually, the value of these divergence times is not so important, since our algorithm can automatically correct the branch length of the matching model based on the input data.\nRun ArchaicSeeker 2.0 to detect archaic introgression segments\nTiming: 2 min\nThe arguments of ArchaicSeeker 2.0 are listed in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_1572_1.csv\nRun ArchaicSeeker 2.0 to detect the archaic introgressed segments.\n> ./ArchaicSeeker2 -v examples/vcf.par -r examples/remap.par -p          examples/pop.par -X examples/outgroup.par -A examples/anc.par -m examples/model.txt -o examples/Han\nPrepare input data for MultiWaver 2.1\nTiming: 1 min\nConvert the information output by ArchaicSeeker 2.0 (Troubleshooting 8[href=https://www.wicell.org#sec6.15]).\nHere is an example to model the introgression pattern from the Denisova:\n> cd WaveEstimate\n> getAS2Seg/getAS2Seg MWexamples/genetic_map_b37/ ../examples/Han.seg MWexamples/Han Denisova\nCritical: The script “getAS2Seg” takes four parameters as input respectively representing the folder path to the genetic map files, the file path to the segment file output by ArchaicSeeker 2.0, the prefix of the output file, and specific archaic hominin.\nNote: In order to model the multiple-wave admixture model from a certain archaic hominin, firstly use the executable script “getAS2Seg” in the WaveEstimate folder to convert the information output by ArchaicSeeker 2.0 to the input format of MultiWaver 2.1.\nNote: MultiWaver 2.1 is a modified version of MultiWaver 2.0 (Ni et al., 2019[href=https://www.wicell.org#bib9]) and is specifically used to estimate the number of archaic introgression waves utilizing the information output by ArchaicSeeker 2.0.\nRun MultiWaver 2.1 to model multiple-wave introgression\nTiming: 1 min\nThe arguments of MultiWaver 2.1 are listed in Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_1572_2.csv\nInfer the multiple-wave introgression model (Troubleshooting 9[href=https://www.wicell.org#sec6.17] and 10[href=https://www.wicell.org#sec6.19]).\n> MultiWaver2.1/MultiWaver2.1 -i MWexamples/Han.seg -l 0.00015 -o MWexamples/Han"
  ],
  "subjectAreas": [
    "Sequence Analysis",
    "Bioinformatics",
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}