{
  "id": 3842,
  "origin_website": "Cell",
  "title": "Ex ovo electroporation of early chicken embryos",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nExtracting embryos from the egg\nTiming: Approximately 30–45 min per tray of eggs (2.5 dozen)\nHere we describe the steps involved to remove developing embryos from the egg and prepare them for electroporation.\nNote: Electroporation at HH4, targets ectodermal derivatives (neural, skin, placodes, and neural crest); if mesodermal derivatives are to be targeted electroporations should be conducted at HH3+, however this does reduce the over-night survival rate.\nBreak a small hole in the shell in the top hemisphere of the egg.\nRemove the thick albumin by pouring/pulling with blunt serrated forceps. Collect thin albumin only into a 50 mL falcon tube to use as media for embryo incubation. Take care not to break the yolk during this process as this will disrupt the embryo.\nBreak the eggshell away until none is visible over the yolk (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/564-Fig2.jpg\nFigure 2. Ex ovo preparation and electroporation of gastrula stage chick embryos\n(A and B) Egg shell is removed until none protrudes above the surface of the yolk.\n(C and D) Hole-punched filter paper is used to extract the embryo from the yolk.\n(E) Embryos are collected in Ringer’s solution.\n(F–H) (F and G) Injection and (H) electroporation of HH4 embryo.\n(I) Embryos are cultured on a thin layer of albumin in 35 mm petri dish.\nLocate the developing embryo; this may require gently turning the yolk using horizontally positioned blunt forceps.",
    "Critical: Remove any residual thick albumin covering the embryo to ensure the filter paper adheres well to the vitelline membrane. Using the side of serrated blunt forceps gently stroke the surface of the yolk in all directions away from the embryo, until all albumin is shifted away, drying the forceps intermittently on a paper towel helps to attach thick albumin to forceps and leave membrane perfectly smooth. Alternatively, the whole yolk can be placed in a petri dish and albumin removed using Kim wipe tissue paper as described elsewhere (Chapman et al., 2001[href=https://www.wicell.org#bib2]). Avoid touching or putting the pressure on the embryo itself during this process.\nPlace a piece of filter paper on the yolk such that the embryo is positioned in the middle of the hole (Figure 2[href=https://www.wicell.org#fig2]C).\nCarefully cut each edge of the filter paper, and using dissecting forceps gently lift the filter square with the embryo attached to it off the yolk, sliding it in the horizontal direction (Figure 2[href=https://www.wicell.org#fig2]D).\nInvert the filter paper, hence holding the ventral side of the embryo (with hypoblast on the top and dorsal side, covered with the vitelline membrane to the bottom) and place it into Ringer’s solution (Figure 2[href=https://www.wicell.org#fig2]E). Move the filter paper and the attached embryo around the petri dish gently to remove any excess yolk still attached to the upper surface and transfer it to a clean dish of Ringer’s.\nNote: Embryos remain positioned ventral side up and can be left in Ringer’s at room temperature while collecting others. This time should ideally not exceed ∼1 h, as the embryos can detach from the paper.\nElectroporation\nTiming: Approximately 1 min per embryo",
    "During this step embryos are injected with required reagents (plasmids, morpholinos, CRISPR components etc) and electroporated using square-wave electric pulses, such that cell membranes are transiently depolarized and destabilized, allowing the reagents to move directionally into the cells.\nSecure the electroporation chamber containing the negative electrode to the microscope base using double-sided tape, ensuring the center of the chamber is central to the field of view. Fill with ∼1 mL clean 1× Ringer’s solution. Attach to the electroporator equipment using a crocodile clip.\nCritical: A clean and dry connection is essential for efficient, even electroporation.\nPlace the embryo on filter paper into the center of the electroporation chamber, overlaying the chamber cavity and the electrode platinum sheet. Ventral side facing up and submerged in Ringer’s solution.\nBack fill a needle with reagents to be injected using a micro-loader tip and carefully break off the end of the needle using fine forceps to allow expulsion of reagents.",
    "Inject reagents into the cavity between the blastoderm and underlying vitelline membrane. We use an airflow system, whereby oxygen-free nitrogen is allowed to continuously escape through an outlet valve and serves as injection OFF switch. When outlet valve is covered by the user’s finger/thumb (ON-switch), the airflow is directed to the needle and consequently reagents are pushed into the region of interest. This can also be performed using mouth pipetting, but we do not recommend using the microinjector due to the difficulty of controlling the flow and intensity of the injection. Gently break the surface of the hypoblast with the needle at the targeted region ensuring not to push too far through and pierce the vitelline membrane (Figures 2[href=https://www.wicell.org#fig2]F and 2G). Multiple injection sites can be created if required. The injected reagents (in color due to the presence of vegetable dye) will distribute radially and the injected “circle” should stably stay in place if the reagents were delivered appropriately.\nNote: If performing bilateral electroporation use two separate needles to sequentially inject left and right sides of the embryo. Ensure the control and experimental reagents do not cross over the primitive streak.\nEnsuring the embryo is positioned centrally above the negative electrode at the base of the chamber, position the paddle shaped positive electrode directly above the embryo. Take care not to touch the embryo with the electrode but keeping it submerged in Ringer’s (Figure 2[href=https://www.wicell.org#fig2]H). Apply the electric current, for our electroporation setup, we use a set of 5 pulses (5 V, 100 ms ON, 50 ms OFF). However, the exact conditions may vary depending on the equipment used, and we provide some optimization guidelines in the troubleshooting[href=https://www.wicell.org#troubleshooting] section. It is of note that, in general, electroporators producing square electric pulses work significantly better than those generating exponential decay wave.",
    "Place the embryo into a 35 mm petri dish containing 1 mL of the thin albumin, (Figure 2[href=https://www.wicell.org#fig2]I) coat the inside edge of the lid with thin albumin such that a seal is created. We have not found it necessary to supplement albumin with antibiotics, but use of Penicillin/Streptomycin can be implemented at a final concentration of 1×, if infections in the cultures occur.\nIncubate embryos at 37°C to the desired stage (approximately 12–16 h from HH4 to 7ss)."
  ],
  "subjectAreas": [
    "Model Organisms",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}