{
  "id": 18791,
  "origin_website": "Jove",
  "title": "Implantation of Total Artificial Heart in Congenital Heart Disease",
  "procedures": [
    "1. Pre-operative Patient Preparation\nThe patient was given general anesthesia according to standard procedures.\nHe was placed on the operating table in supine position.\nThe right neck line and a right atrial PICC line were removed.\nHe received central access in the left femoral vein and remained with his arterial line.\nA TEE probe was placed and demonstrated severely depressed biventricular function and significant aortic insufficiency.\n2. Cardiectomy\nThe patient was positioned, prepped and draped in the normal sterile fashion for the repeat sternotomy.\nThe repeat sternotomy was completed (Figure 4). Immediately noticeable was the extremely enlarged heart and severe adhesions.\nThe diaphragmatic surface was dissected out. It was severely adhered secondary to epicardial wires. The patient would not tolerate significant movement of the heart in trying to reach the inferior vena cava (IVC).\nThe aorta was dissected.\nThe right femoral vein was dissected.\nPursestrings were placed in the aorta and femoral vein, heparin was administered, and the aorta and right femoral vein were cannulated. The tip of the venous cannula was advanced to the IVC.\nAfter reaching appropriate activated clotting time (ACT), the patient went onto cardiopulmonary bypass. Since his systemic vascular resistance was markedly elevated due to severe heart failure, aggressive afterload reduction was required to achieve adequate perfusion pressure.\nThe patient was placed with an MPA vent to achieve better decompression of the left heart. However, it became obvious with full flow that this would be a difficult hemodynamic circuit to keep stable primarily due to significant aortic insufficiency.\nThe superior vena cava (SVC) was dissected and cannulated, and the patient was placed on bicaval cardiopulmonary bypass (Figure 5).\nThe IVC was dissected and the aorta was cross-clamped. This allowed complete decompression of the heart.\nThe aorta and the main PA were divided (Figure 6).",
    "The rest of the ventricular surface including the diaphragmatic surface, left atrial gutter, and right atrial gutter was dissected out. The MPA, the PA branch and the proximal PA branches were also dissected.\nThe right ventricle was dissected out, leaving approximately 3-4 mm of muscle below the right AV valve (Figure 7A).\nThe left ventricle was dissected out leaving a 3-5 mm cuff of ventricular muscle below the left AV valve (Figure 7B).\n3. TAH Implantation\nUsing a large Prolene on an MH needle, the previously prepared felt strip with Gore-Tex was whip-stitched to fortify the muscular rim of the ventricular muscle cuffs.\nThe atrial quick-connect was trimmed to a 3-4 mm rim. It was inverted and sewn to the muscular cuff both on the left and right sides, to prevent scalloping (Figure 8).\nThe ventricles were tunneled out just left of the midline and outflow grafts were cut to the appropriate size.\nThe Ao and PA cuffs were sewn using running sutures (Figure 9).\nThe RV to PA conduit and calcified areas were excised.\nThe atrial cuffs were tested for leaks, and then the Ao and PA anastomoses were tested\nA driveline tunnel was created (Figure 10).\nThe left TAH ventricle was connected to the left atrial cuff and then to the aorta (Figure 11).\nThen the outflow graft of the Ao was connected to the system and the cross clamp was released slowly (Figure 12a).\nAfter this, the TAH right ventricle was connected to the atrial cuff of the RA and then to the PA (Figure 12b).\nIn the final position, the TAH ventricles were aligned in a parallel fashion because the PA graft did not cross over top of the aortic graft due to the TGA anatomy (Figure 13).",
    "The right ventricle was de-aired by removing the IVC snare, an active root vent was placed in the ascending Ao and rewarming was completed.\nThe lungs were suctioned and ventilated and the TAH was turned on to de-air the active root vent in the ascending Ao.\nThe patient was taken off cardiopulmonary bypass, and the rate of the TAH was increased.\nAfter achieving good hemodynamics and giving protamine, the heart was decannulated.\nOnce hemostasis was achieved, four chest tubes were placed: two Blakes in the mediastinum and posterior mediastinum, one large 40 chest tube in the anterior mediastinum, and a right-angle chest tube in the left chest.\nA neopericardium made of thin Gore-Tex was created and placed around the device. Once completed, the entire mediastinum was irrigated with copious amounts of warm antibiotic saline solution.\nThe sternum was closed with surgical steel wires, while making sure sternal closure did not cause any compression to the TAH. The skin and underlying tissues were closed in layers.\nAfter gaining hemostasis in the groin, this area was closed.\nThe AICD pocket was cultured, the AICD removed, and a small drain was placed in the pocket.\nThe patient tolerated this very complex procedure well and was transferred to the CVICU in a stable hemodynamic and respiratory state. The patient was extubated on postoperative day 2. Unlike management for ventricular assist device, postoperative care TAH does not require inotropes. Fluid control and afterload reduction are the main parts of postoperative care. Anticoagulation was commenced at day 2 per the manufacture's protocol."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}