{
  "id": 6831,
  "origin_website": "Bio",
  "title": "Application of Mechanical Forces on <em>Drosophila</em> Embryos by Manipulation of Microinjected Magnetic Particles",
  "procedures": [
    "Construction and calibration of the electro magnetTo apply controlled forces, we designed an electromagnet similar to the one described in Kollmansberger and Fabry (Kollmannsberger and Fabry, 2007). The electromagnet is composed of three components: A Mu-metal rod (soft ferromagnetic alloy with very high magnetic permeability), a radiator in aluminium to evacuate the heat and a copper wire to connect to electric current (Figures 1A and 1B). The Mu-metal rod is sharpened to achieve a conical tip and then thermally annealed. (both operations can be done at the Sekels factory). A custom manufactured 45 mm long aluminium cylinder–with 4.5 mm inner diameter to host the Mu-metal rod was used to dissipate the heat generated by the magnet. The outer diameter of the cylinder was 200 mm. Close to one end, four, 1 mm wide and 40 mm deep troughs spaced by 2 mm were milled into the cylinder to increase the radiator surface. Another 220 mm wide trough of 100 mm diameter was milled 5 mm from the other end of the cylinder to host 100 coils of the copper wire. On the two extremities, three plastic screw were positioned at 120° interval and were used to hold the Mu-metal rod (Figures 1C and 1D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200427/20200427000514_9728.jpgFigure 1. Electromagnet set up for force application. A. Photograph of the power supply (left) and electromagnet mounted on the micromanipulator. B. Photograph of the electromagnet mounted on the stage of the spinning disk microscope. C. Close up of the electromagnet, the left arrow indicates the Mu-metal rod conically shaped, the center arrow indicates the copper coil around the radiator and the right arrow indicates the aluminium radiator. D. Schematics showing the design of the aluminium radiator, a = 160 mm, b = 120 mm, c = 220 mm, d = 160 mm, e = 200 mm.",
    "Upon application of a direct current circulating within the cupper coils, a magnetic field emanates from the tip and decays spatially. Magnetic beads lying within the magnetic field are attracted towards the tip with a force proportional to the gradient of the field (Kollmannsberger and Fabry, 2007).  To calibrate the force exerted on the bead as a function of the distance from the magnet, we developed an assay using beads embedded in PDMS. Since its viscosity is known, by measuring the velocity of the beads within the PDMS when the magnetic field is applied, we can calculate the force field as a function of the distance from the tip: Stoke’s law directly relates the force to the velocity (Figure 2 and Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200427/20200427000547_0413.jpgFigure 2. Construction of the calibration chamber. A and B. Sequential folding of a rectangular piece of Parafilm, dotted line represents the folding site. C. The dotted line represents the cut position to generate a window. D. The Parafilm is transferred onto a coverslip. E. Photograph of the calibration chamber mounted on the metal slide.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Calibration of the force applied to a 4.5 μm bead. (Left) Time lapse video of 4.5 μm magnetic beads embedded in PDMS moving toward the magnet during application of the magnetic field and respective tracking (Right).Place 5 μl of Dynabeads in 1.5 ml Eppendorf tube and put it at 37 °C with the lid open in the Thermomixer for a few hours in order to completely desiccate the bead.Add 1 ml of PDMS and stir it with a pipette tip in order to detach the pellet of beads from the bottom.Using the Bioruptor, sonicate at maximum power for 10 min. If the beads are not evenly resuspended repeat the sonication procedure.",
    "Cut a rectangular piece of Parafilm 10 cm x 3 cm and fold it as in Figure 2.Using a cutter, open a window of 5 x 10 mm in the center of the folded Parafilm.Transfer the Parafilm on top of a coverslip and heat it on top of a hot plate until the Parafilm attaches properly to the coverslip without melting.Transfer 50 μl of beads/PDMS (from Step A3) into the Parafilm window.Mount the coverslip onto a frame slide Leica using a drop of silicon grease.On the spinning disk microscope use a 40x lens and focus on the beads.Bring the electromagnet to one edge of the field of view (Video 1).Start the time-lapse using transmitted light and an exposure time of 20 ms.Start the force application.Injection procedure of individual 4.5 μm bead into Drosophila embryoA single magnetic bead is injected into the yolk of an embryo at stage 2 of Drosophila development (Figures 3-4). After injection, the coverslip supporting the embryos is left to develop over a neodymium magnet that will hold the bead in the embryo cortex. Thus, at cellularization time, the bead will be naturally encapsulated into a newly formed cell. By choosing the orientation of the embryo relative to the neodymium magnet, it is possible to embed the particle in a specific group of cells, which will later develop into specific tissues or organs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200427/20200427000626_9707.jpgFigure 3. Immobilization of a single 4.5 μm bead at the tip of the injection needle. A. The injection needle is placed into a drop of 4.5 μm beads resuspended in 0.1% PBS/BSA. B. Negative pressure (P < 0) is applied to the needle in order to immobilize a single bead.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200427/20200427000646_6919.jpgFigure 4. Injection of a single 4.5 μm bead into Drosophila embryo. A and B.",
    "Negative pressure (P < 0) is applied to the needle in order to immobilize a single bead while approaching the embryo. C and D. Negative pressure is released and the bead remains inside the embryo. The inset shows a cartoon of the corresponding injection step where the needle is depicted in cyan, the bead in yellow and the embryo in light gray. The arrow represents the resulting force generated by the negative pressure inside the needle.Prepare 0.1 M boric acid solution at pH 9.5.Wash 3 times 50 μl of 4.5 μm Dynabeads with 1 ml of boric acid solution.Resuspend 10 μg of GBP in 400 μl of boric acid solution and incubate O/N at 37 °C.Wash 2 times the Dynabeads with 1 ml of boric acid solution.Resuspend in 1 ml boric acid solution 0.1% BSA (w/v).Prepare heptane glue by incubating O/N 10 ml of heptane with 120 cm of magic tape.Place a drop of 100 μl of heptane glue in the middle of a coverslip and allow the drop to flow down by gravity, creating a stripe of sticky surface in the middle of the coverslip, parallel to his long edge.Thirty to forty freshly laid embryos are chemically dechorionated using sodium hypochlorite for 90 s at RT, then rinsed under tap water for 90 s and then mounted on a coverslip coated with heptane glue.Note: All embryos should be mounted in a single row, regularly spaced and parallel to each other, to facilitate the injection. The embryos are dehydrated for 10-15 min in a 25 °C incubator, to reduce turgidity and avoid bursting upon injection, and then covered with a small drop of Voltalef oil. Please note that the dehydration time needs to be adjusted depending on the humidity in the incubator.",
    "A drop of 40 μl beads resuspended in PBS/0.1% BSA is deposited next to the embryos, aside of the Voltalef oil drop.Turn on the micro-puller and set the values of heat 1 at 860 and pull at 750. Then insert a glass capillary in the respective holder and generate an injection needle. Note that different pulling parameters can be used. The injection needle just need to be elongated enough to have a diameter allowing to hold the magnetic particle and to enter the embryo without damaging it (see Figures 3 and 4).The injection needle is precisely opened using a microgrinder to achieve an internal diameter of 3.5 μm (see Figure 3).The needle is connected to a Microinjector (WPI  PV 820  ).The needle is positioned in the drop containing beads (in PBS/0.1% BSA) and, by applying negative pressure, a single bead is held at the tip of the needle. Figure 3 illustrates the process.Move the needle holding the bead close to the posterior pole of the embryo, set the pressure of the microinjector to neutral just before the injection. Then, the bead can be transferred into the center of the embryo (see Figure 4).Once all the embryos are injected, place the coverslip with the injected embryos on top of a permanent magnet for 2 h at 25 °C.Notes:In order to maximize the force applied by the neodymium magnet to the embryos, position the coverslip with the injected embryos directly on the neodymium magnet without the microscopy slide. To minimize the damage inferred to the embryos, the bead needs to be injected at early developmental stage (stage 2). In order to target specific tissues, the embryo needs to be mounted with the tissue of interest facing the coverslip. i.e.",
    ", if we want to apply forces during the process of dorsal closure, the embryos have to be mounted with dorsal side facing the coverslip and the embryos must be left to develop for 20 h after injection at 18 °C.Imaging and force applicationThe coverslip is mounted onto a frame slide Leica using a drop of silicon grease.Select a 40x lens at the spinning disk, focus on an embryo with the bead in right orientation and then position the tip of the electro-magnet at 150-200 μm from the chosen embryo. Care must be taken in choosing the bead-magnet distance in order to position the bead in a region of the force-distance curve with small steepness to allow for an accurate estimation of the force (see Figure 5B and Figure 6).Set up a two channel, x-y-z time lapse imaging protocol. One channel will use the 488 nm laser to acquire GFP signal and the other channel will use 561 nm laser will acquire the auto-fluorescence of the bead.Set up 5 z steps spaced by 1 μm and choose a time resolution of 5 s.Start the movie, after 1 min turn on the power supply and select 0.3 A to generate a magnetic field that will exert a force of 115pn on the bead. Keep the power supply on for 1 min, then, after switching off the power supply, allow the imaging to proceed for 1 more minute before stopping the movie (Figures 5A, 5C and Video 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200427/20200427000732_4257.jpgFigure 5. Force application on a single 4.5 μm bead to the Drosophila blastoderm. A. Time-lapse images showing the bead (magenta) in response to a force step (∼115 pN; onset at 0 s). The bead was embedded into an individual cell of a Resille-GFP embryo. White arrows indicate force application.",
    "White dashed lines mark the left side of the bead at time 0s. Scale bar = 10 μm. B. Snapshot in transmitted light of an embryo containing a 4.5 μm bead and the electromagnet placed at 190 μm. Scale bar = 20 μm. C. Bead displacement corresponding to the force application shown in A.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200427/20200427000800_0637.jpgFigure 6. Force-distance calibration plot. Example of force-distance plot for the calibration of the electromagnet. The force exerted on three single beads is plotted as function of the distance from the tip of the magnet. A power law fit on the force curve of bead number three is represented in red.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Force delivery to a single cell during Drosophila cellularization. Time-lapse video showing a force application on a 4.5 μm bead embedded into a Resille-GFP expressing embryo. The purple arrow indicates when a force of ~115 pN is applied on the bead. Scale bar = 10 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}