{
  "id": 11829,
  "origin_website": "Jove",
  "title": "Syngeneic Mouse Orthotopic Allografts to Model Pancreatic Cancer",
  "procedures": [
    "The animal experiments were approved by the institutional animal care and use committees (IACUCs) of the local authorities of Technical University of Munich and Regierung von Oberbayern.\n1. Information to consider prior to the procedure\nEnsure approval of the animal protocol and personnel by the local authorities before starting any animal experimentation.\nSelect recipient mice.\n\t\nSelect mice of similar ages for implantation (C57Bl/6J recipient mice with an age range between 2 months and 4 months).\nEnsure that the sex and genetic background of the recipient animals match the sex and genetic background of the animals from which the cell line used for implantation originated (syngeneic allografts).\nPrepare the mice for implantation.\n\tNOTE: Handle the mice according to the hygienic standards of the local animal facility.\n\t\nOn the day of implantation, do not feed the mice 4 h before the procedure to avoid complications due to the administration of anesthetics.\nWeigh the mice prior to implantation to calculate the amount of the necessary anesthetics.\nTransfer the mice to the operation room.\nSelect the PDAC cell lines.\n\t\nMake sure that the genetic background and sex of the mice from which the cell lines are derived match the background and sex of the recipient mice (e.g., the PDAC cell lines PDAC 1-3 previously generated from PDAC GEMMs on a C57Bl/6J background in the laboratory with the following genotypes, as described previously14: PDAC 1 and 2: Ptf1aCre/+;LSL-KrasG12D/+;LSL-Trp53R172H/+, PDAC 3: Ptf1aCre/+;LSL-KrasG12D/+;LSL-Trp53R172H/R172H).\nSelect the cell lines that do not express proteins that are potentially immunogenic.\nCulture the PDAC cell lines.\n\tNOTE: Perform the cell culture work under a laminar flow hood. Disinfect the gloves, working space, and materials before working.",
    "Thaw the cells 1 week before implantation by resuspending the pellet in 5 mL of cell culture medium. Spin down the cells, aspirate the supernatant, resuspend the pellet in 5 mL of phosphate-buffered saline (PBS), and spin down the cells again. Remove the supernatant and resuspend the cells in 5 mL of Dulbecco's Modified Eagle's Medium (DMEM) with 10% fetal bovine serum (FBS) and 0.1% penicillin-streptomycin (PS). Transfer the cell suspension to a 25 cm² flask.\nPassage the cell lines at least once before implantation.\n\t\t\nRemove the cell medium, wash 1x with PBS, and add 0.5 mL of trypsin to detach the cells from the flask. Incubate the cells at 37 °C until they detach from the flask (depending on the cell line, this usually takes 5-10 min). When the cells are detached, resuspend the cells in 10 mL of DMEM with 10% FBS and 0.1% PS and transfer the cell suspension to a 75 cm² flask.\n\t\t\tNOTE: As FBS inactivates trypsin, it would hinder trypsinization.\nEnsure confluency of ~70%-80% on the day of implantation.\nMaterial needed for implantation\n\t\nAutoclave all the surgical instruments.\nKeep anesthetics ready based on the animal experiment license.\n\t\t\nUse meloxicam for analgesia at least 5 min in advance as a long-lasting analgetic with anti-inflammatory properties.\nFor surgery, use a combination of midazolam, medetomidine, and fentanyl (MMF) for analgosedation.\nUse a combination of atipamezole, flumazenil, and naloxone (AFN) for antagonizing the MMF analgosedation after implantation.\nPrepare a sterile drape, a heating mat, a shaver, gloves, eye cream, 0.9% sodium chloride, iodine or chlorhexidine-based surgical scrub, 80% ethanol, soluble suture, wound clips, a 50 µL injection volume syringe, and tape.\n2. Preparing the cell lines before implantation",
    "NOTE: Prepare the tumor cells only when the mice are ready for implantation. Ensure a short time frame between the harvesting or collection of cells and implantation.\nWarm all the liquids to 37 °C before use.\nPrepare the cells (starting from 1x T75 (a 75 cm2 culture flask) as described in step 1.5.2.1 until they detach from the flask. Resuspend the cells in 10 mL of DMEM with 10% FBS and 0.1% PS and transfer the cell suspension to a 15 mL tube.\nSpin down the cells at 200 × g for 5 min in a centrifuge. Aspirate the supernatant and resuspend the cell pellet in an adequate volume of DMEM without additives based on the required final concentration of the cells for injection. Use 10 µL of the cell suspension to count the cells using a Neubauer chamber and calculate the number of available cells.\nDilute the cells to the final required number of cells for injection (e.g., 2,500 cells in 20 µL) in DMEM without additives. Transfer 1 mL of the diluted cell suspension to a 1.5 mL tube. Place the tube on a rotator until implantation to prevent the cells from aggregating.\n3. Orthotopic implantation of PDAC cells\nNOTE: In case of insufficient surgical experience, practice with cadavers first and get adequate training, for example, within an animal training protocol. The personnel performing the surgery and the animal experiments need to fulfill the criteria of the respective authorities and the institutional guidelines.\nUse meloxicam as a perioperative analgesic and apply 5 mg/kg body weight subcutaneously.\nIntraperitoneally inject MMF according to the body weight of each mouse (midazolam [5.0 mg/kg], medetomidin [0.5 mg/kg], and fentanyl [0.05 mg/kg]).\nPut the mouse back into the cage for 10-15 min.\nApply eye cream when the mouse is asleep.",
    "Check sufficient analgosedation after 10 min by testing the pedal withdrawal reflex (pinch on the foot pads of both hind feet). In case of a response, apply 1/3 of the original dose of analgosedation. After 10 min, repeat the procedure and proceed only in the absence of a pedal withdrawal reflex.\nShave the left lateral abdominal flank of the mouse. Place the mouse lying on the right side on a sterile heating mat and tape its legs to the surface. Disinfect the abdomen using an iodine or chlorhexidine-based surgical scrub followed by 80% ethanol in a circular motion and repeat the procedure three times. To maintain sterility of the surgical field, use a surgical drape.\nWear new gloves and disinfect them. Use surgical scissors to cut the skin and subcutaneous fat tissue longitudinally on the left flank where the spleen is projected. Perform a cut of about 1 cm in length.\nUsing scissors and forceps, separate the skin from the peritoneum to get an easier access to the peritoneum.\nChange the pair of scissors. Open the peritoneum at the location of the spleen with a 1 cm longitudinal cut.\nMobilize the spleen and the attached pancreas using blunt, fine-tipped forceps. Make sure the organs are not attached to other tissue and check for supplying blood vessels to avoid injuring the vessels or the surrounding tissue when handling the pancreas.\n\tNOTE: Do not grab the spleen directly to prevent bleeding.",
    "Carefully pull the pancreas out of the incision to enable easier access to the organ's tail and observe the spleen following the pancreas. Use the non-dominant hand to grab the pancreas with forceps and carefully cut the ligaments that prevent the pancreas from extracorporalization. Make sure the organ is not folded during injection and that the organ's capsule is held under tension at the site of needle penetration to avoid spillage.\nUse the dominant hand to carry out the injection. Carefully penetrate the organ's capsule with the syringe's needle following the longitudinal axis of the organ. Aim for a piece of pancreatic tissue between visible blood vessels to minimize the risk of puncturing or injecting into a vessel. Slowly inject an adequate number of cells according to the experimental plan (here, 2,500 cells in 20 µL of DMEM) with a 27 G cannula and a 50 µL syringe into the tail area of the pancreas.\n\tNOTE: A transparent bubble forms upon successful injection into the tissue.\nKeep the pancreas and the inserted syringe still for approximately 1 min to avoid spilling of the tumor cells. Remove the needle carefully from the injection site.\n\tNOTE: Change needles between mice and use a new sterile syringe for the injection of a new cell line.\nRearrange the organs inside the abdomen carefully. Take care not to injure the tissue to avoid spilling of the cells. Pour 1 mL of 0.9% sodium chloride onto the organs to avoid organ adhesion.\nCarefully suture the peritoneum using the simple interrupted suture technique and close the skin using two to three 9 mm stainless steel wound clips.\n\tNOTE: Remove the wound clips 7 days after implantation if the surgical incision has healed.",
    "If necessary, prevent dehydration of the animals due to the procedure and the anesthesia by injecting 0.5 mL of sodium chloride subcutaneously.\nAfter implantation, antagonize the analgosedation by MMF with a subcutaneous injection of AFN (atipamezol [2.5 mg/kg], flumazenil [0.5 mg/kg], naloxon [1.2 mg/kg]), according to the body weight of the mouse.\nPlace the mouse in a 37 °C heated chamber until it is awake and completely active. Then, place the mouse back into its original cage. Monitor the health status of the mouse by checking the fur, skin color, and activity and repeat this 3-4 h after surgery.\n4. Aftercare for the mice\nGive the mice access to water and food when back in the animal facility.\nContinue subcutaneous or oral application of meloxicam (5 mg/kg) every 6-12 h for 2-3 days after surgery.\nMonitor the health status of the mice regularly according to the animal protocol and the institutional guidelines.\nDepending on the goal of the experiment, monitor tumor growth every week or more frequently by palpating, ultrasound imaging, bioluminescence (BLI), or magnetic resonance imaging (MRI).\n\t​NOTE: Based on the method of choice, the growth rate, and the number of cells implanted, a tumor can be detected as early as 1 week after the injection.\n5. Harvesting tumor grafts\nHarvest the tumors at the end of the experiment or when the mice need to be euthanized following the criteria of the institutional animal care and use committees or animal experiment license.\nEuthanize the mouse using a method permitted by the animal experiment license.\n\tNOTE: Carry out steps with a minimal time loss to minimize the ischemia time. Therefore, cervical dislocation is recommended as it is a quick method and the time of death can be determined exactly, in contrast to terminal bleeding or chemical methods.",
    "Place the mouse supine on a sterile mat and tape its legs to the surface. Use 80% ethanol to disinfect the abdomen.\nWear new gloves and disinfect them. Use surgical scissors to cut the skin longitudinally on the central abdomen.\nUsing scissors and forceps, separate the skin from the peritoneum to get an easier access to the peritoneum.\nChange the pair of scissors. Open the peritoneum at the central abdomen with a 5 cm longitudinal cut.\nMobilize the spleen and the attached pancreas using blunt, fine-tipped forceps. Carefully detach the tumor from the surrounding tissue using forceps and surgical scissors.\nStore the tumor tissue in a medium suitable for downstream experiments. Process the tissues immediately or, if necessary, keep the sample at 4 °C for a maximum of 6 h until further processing.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}