{
  "id": 18306,
  "origin_website": "Jove",
  "title": "Intravital Microscopy and Thrombus Induction in the Earlobe of a Hairless Mouse",
  "procedures": [
    "All in vivo experiments (7221.3-1-006/15) were conducted in accordance with the German legislation on the protection of animals and the NIH Guide for the Care and Use of Laboratory Animals (Institute of Laboratory Animal Resources, National Research Council).\n1. General Keeping of the Animals\nPerform the experiments with male SKH1-Hrhr mice aged 4 to 6 weeks. Use animals with a weight between 20 and 25 g.\nKeep the animals in a pathogen-free facility and under standardized conditions of 24 to 26 °C and about 60% relative humidity, with steady access to water and food ad libitum.\nKeep up to five male animals in one cage. Provide bedding and enrichment material during the housing of the animals for their well-being.\n2. Prearrangement of the Animals\nWeigh a mouse and load the respective drug (e.g., the cannabinoid, 5 mg/kg bodyweight (bw)) into an insulin syringe. Administer the drug 30 min prior to thrombus induction.\nBy holding the neck of the mouse between the thumb and the index finger and the tail of the mouse with the little finger, stretch the animal and inject the drug intraperitoneally (ip) into the bottom left quadrant of the abdomen. Put the animal back into the cage for 15 min.\nPrepare anesthesia with ketamine (90 mg/kg bw) and xylazine (25 mg/kg bw). 15 min prior to thrombus induction, anesthetize the mouse. Put the mouse in the cage, pull the tail slightly, and inject the anesthetics ip with an insulin syringe.\nPut the mouse back into the cage until the onset of anesthesia. To verify sufficient anesthesia, pinch the tail with forceps.",
    "Load 0.05 mL of defrosted fluorescein isothiocyanate-labeled dextran (FITC-dextran; 5%, 150 kDa) into an insulin syringe. While filling the syringe, ensure that no air bubbles remain, because even small intravenously (iv)-administered air bubbles can be lethal for the animal.\nPlace the anesthetized mouse on a heating plate in the facedown position. Adjust the heating plate to 37 °C.\nPut eye ointment on the cornea of the mouse. Disinfect the skin and use sterile instruments.\nStitch two sutures of polypropylene 7/0 into the cranial and caudal edge of the right ear. Place the stitches as close to the edge and as proximal to the base as possible (Figure 1B).\nShift the mouse to dorsal position. Fix all legs to the acrylglass platform using adhesive strips. Hook a suture under the front teeth and position the head in dorsiflexion by sticking the suture to the acrylglass with adhesive strips.\nTranslocate the animal on the platform under the operation stereomicroscope. Use 16X magnification.\n3. Preparation of the Left Jugular Vein and Injection of FITC-Dextran\nNote: For microscopy of the right ear, prepare the left jugular vein.\nUsing a scalpel, create a 5-mm incision in the skin on the left side of the neck in a cranio-caudal direction. Dissect the subcutaneous tissue with a microforceps and microscissors. Either ligate crossing vessels with polyester 8/0 sutures or with electrocoagulation.\nFree the vein from its adventitia using microforceps and microscissors without touching the vessel.\nUse the prepared insulin syringe for the injection of the fluorescent dye. Carefully grab the vessel wall with the microforceps, without perforating the vein. Penetrate the distended vessel wall with the syringe and inject FITC-dextran iv.\nStop the bleeding after withdrawing the syringe using cotton swabs. Avoid blood and dye contamination of the ear.",
    "4. Positioning of the Right Ear for Intravital Fluorescence Microscopy\nTransfer the animal on the heating plate to an acrylglass construction with a slot for the heating plate and a 0.5 cm-high plane for positioning the ear.\nFix the animal face down on the heating plate using adhesive strips. Place the relatively strong and convex cartilage at the base of the ear beside the 0.5 cm-high plane for the ear (Figure 1B) so that the apical part of the ear can be positioned flat on the plane.\nAdd one drop of room-temperature 0.9% NaCl to the acrylglass plane in order to position the ear. Place the right ear, with the prearranged sutures on its concave ventral side facing downwards, on the drop of 0.9% NaCl. Using cotton swabs, absorb the drop of NaCl and let capillary forces attach the ear plane to the acrylglass.\nTape the sutures to the acrylglass to fix the position of the ear.\nAdd one drop of 0.9% room temperature NaCl to the convex dorsal side of the ear. Carefully put one coverslip (0.5 cm diameter) on the ear without compressing the basal vessels entering the ear. Using cotton swabs, remove as much NaCl as possible from under the coverslip in order to minimize the distance between the coverslip and the ear target vessels.\n5. Intravital Fluorescence Microscopy and Thrombus Induction of the Right Ear\nAdjust the intravital fluorescence microscope for FITC-dextran visualization (450 - 490 nm; FT: 510; LP: 520). Use a variable 100-W mercury lamp as a light source. Connect a high-resolution, black-and-white CCD camera to a DVD recorder.\nTransfer the animal on the acrylglass containing the heating plate with the fixed abducted ear to the desk of the intravital fluorescence microscope.",
    "Using 20X magnification (20X/0.95 numeric aperture) and 20% light intensity, search for a venous vessel 50 - 60 µm in diameter and with an anterograde blood flow of 400 - 600 µm/s.\nAdd one drop of room-temperature water to the coverslip for water immersion of the 63x magnification objective (63X/0.95 numeric aperture). Use a syringe with a 1-mm diameter cannula and place the drop on the objective of the microscope. Add just enough water to contact the coverslip and the objective with the water drop.\nImmediately after the application of the water drop, begin recording the vessel for 20 s with 20% light intensity for the offline measurement of the diameter and blood flow.\nStart thrombus induction 5 min after the injection of FITC-dextran. For this purpose, raise the light intensity to 100%.\nDuring thrombus induction, close the aperture of the microscope for 2 s within a period of 30-s to check the blood flow. In case of persisting blood flow, open the aperture again. In case of stopped blood flow, observe the vessel for 30 s.\n\tNOTE: The vessel is classified as occluded if the flow stands still for 30 s or more or if the blood flows retrogradely. If the orthograde blood flow starts again, completely open the aperture and continue the thrombus induction until vessel occlusion occurs as described above. During early thrombus induction, ensure that the times when the aperture was closed to check the blood flow are as short as possible in order to maintain almost continuous epi-illumination. Later, during thrombus growth, the vessel is perfused with less fluorescent dye, so it can be observed continuously.\nSelect and occlude 5 vessels per ear. Limit the time of thrombus induction under the microscope to approximately 1 h after the injection of FITC-dextran.\n6. Follow-up Activities",
    "Perform a wound closure of the neck using transcutaneous polypropylene 6/0 sutures.\nDuring recovery from anesthesia, put the mouse back into the cage and warm the animal using infrared light.\nTransfer the recorded data from the DVD recorder to software allowing the measurement of the diameter of the vessels and velocity of blood flow.\n7. Examination of the Left Ear\nLet the animal recover and eliminate all injected FITC-dextran for 48 h.\nRerun the steps described above, this time preparing the right jugular vein and the left ear.\n8. Tissue Asservation\nAfter intravital fluorescence microscopy of the left ear, sample 0.5 mL of blood from the retrobulbar vein plexus of the eye using a glass capillary. Carefully penetrate the inner palpebral angle with screwing movements, until venous blood flows through the capillary. Collect the probe in an ethylenediaminetetraacetic acid (EDTA) blood tube.\nAfter blood sampling, sacrifice the animal by injecting 500 mg/kg bw ketamine into the tail vein.\nCount the blood cells using a hematology analyzer for a quantitative assessment of leukocytes, erythrocytes, thrombocytes, hemoglobin, and hematocrit.\nCentrifuge the remaining EDTA blood at 2,500 x g and room temperature for 10 min. Pipette and freeze the blood plasma for further investigations.\nUsing scissors, cut the auricles and fix them in 4% formaldehyde for histological examination.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}