{
  "id": 18486,
  "origin_website": "Jove",
  "title": "Glaucoma-inducing Procedure in an In Vivo Rat Model and Whole-mount Retina Preparation",
  "procedures": [
    "All procedures using animal subjects have been in accordance with the standards of the Institute of Animal Care and Use Committee (IACUC) at Western Michigan University.\n1. Animals\nUse male and female rats 3 months of age in this study.\nKeep animals in a 12 hr light/dark cycle with free access to food and water.\n2. Preparation of KAX Cocktail for Animal Anesthesia\nDissolve 50 mg of xylazine (20 mg/ml) in 5 ml ketamine (100 mg/ml) with 1 ml acepromazine (10 mg/ml) and 3 ml of distilled water. Mix thoroughly.\nSterilize with a syringe filter and store this solution into a 10 ml serum bottle.\n3. KAX Injection\nWeigh animal (g) and return to cage until ready for injection.\nInject 0.1 ml KAX/100 g animal body weight intraperitoneally, using a 1 ml insulin syringe with a 28 G needle.\nAllow for animal to become unconscious. Check reflexes by pinching the feet and tail.\nKeep all animals safely in lab for the duration of surgery.\nPost-surgery, replace animals into their cages and keep comfortable in RT until consciousness is regained. Only return animals to the animal facility when the animals awaken and resume normal behavior.\n4. Preparation for Surgery and Microneedle Assembly\nMake a sterile 2 M NaCl solution.\nUse a microelectrode puller (Figure 1C) to pull one 0.86 mm inner diameter heavy polished standard and thin walled borosilicate tube into two finely tapered glass microneedles (Figure 1D, Figure 1E).\nBackfill one microneedle from the previous step with 2 M saline using a backfilling syringe needle and a 1 ml syringe (Figure 1B) . Tap out air bubbles from the tip of the electrode.",
    "Fill a second 1 ml syringe with 2 M NaCl. Connect an 18 G needle and then attach a length (approximately 10 inches) of polyethylene tubing (Figure 1A). Use the syringe plunger to fill the polyethylene tubing with saline through the needle.\nWhen both the microneedle and tubing are filled with saline, carefully connect the two. Eliminate any air in the connection between them (Figure 2).\nFinely bevel the tip of the microneedle by scraping it very lightly against the grain of a course paper towel.\nCheck the resistance of the microneedle by gently pushing the plunger on the syringe until a fine stream of liquid can be seen on the paper towel. The stream of liquid should be no wider than 0.5 mm.\n5. Preparation of Animal\nApply 1 - 2 drops topical anesthetic to cornea (Proparacaine Hydrochloride Ophthalmic Solution, USP, 0.5%). Wait until no ocular reflex occurs.\nTrim whiskers with scissors.\nSaturate a cotton tip applicator with betadine solution and swab area around the experimental eye.\nUsing a microscope, attach a hemostat to clamp the bottom eyelid to bulge the eye, expose the episcleral vein and restrict eye movement. (Figure 3, arrowhead)\n6. Glaucoma-inducing Saline Injection\nWhen the microneedle assembly and the animal are prepared, begin injections.\nWhen the animal is confirmed to be unresponsive to feet/tail pinch, carefully pierce the episcleral vein with the microneedle by coming at a low angle between 10 and 20 degrees to the vein (Figure 3, white arrow). A successful puncture into the vein is apparent when blood enters the tip of the microneedle (Figure 3, black arrow).",
    "Slowly and manually inject approximately 50 µl saline into the vein. This should take approximately 10 sec. The veins will blanch white as the salt circulates through the vasculature (Figure 4, arrowhead). Some regions may maintain a blood red appearance (Figure 4, arrow).\n\t\nPerform a second injection into the vein, opposite to the site of the first, to ensure thorough retinal damage to the complete retinal ganglion cell layer.\n\t\tNote: Within minutes, one should see a distinct cloudy appearance through the iris of the eye as the salt circulates through the vascular system.\nLeave the opposite eye untreated for use as an internal control.\n7. Animal Recovery\nRemove the hemostat.\nUse a cotton applicator to apply triple antibiotic ointment (Bacitracin zinc, neomycin sulfate, polymysin B sulfate)  to the site clamped by the hemostat and to injection sites. Tissue damage around the eye does not occur using the hemostat.\n>Place anesthetized animals in their cages on a circulating warm water blanket to prevent hypothermia. Keep animals under observation until consciousness and normal behavior are regained. Transport awake animals back to the animal colony. Animals remain in the colony until the time of sacrifice.\n8. Animal Sacrifice and Retina Removal\nOne month following the procedure to induce glaucoma, animals are euthanized by CO2 asphyxiation and secondary thoracic puncture. \n\t\nPlace the animal in the chamber and put the lid on securely.\nOpen the CO2 and gas regulator valves to allow 20% volume/min CO2 displacement of oxygen in the chamber.\nAllow four to 5 min for the animal to expire.\nTurn off both valves.\nRemove animal from the chamber and perform a secondary thoracic puncture with a sterile scalpel.",
    "After euthanasia, use a scalpel to cut the connective tissue in the orbital cavity surrounding the eye, being careful not to cut into the eyeball itself.\nCarefully use curved edge scissors to cut the optic nerve and any remaining tissue to extract the intact eyeball. Place extracted eyeball in a sterile 60 mm x 15 mm disposable petri dish containing fresh PBS.\nMake an eyecup from the eyeball. To do this, make a small incision with the scalpel just posterior to the border between the iris and the sclera. Follow this incision around the circumference of the eye with small spring scissors to remove the corneal hemisphere from the eyeball. The hemisphere connected to the optic nerve remains.\nFind the very thin pink/beige retina inside the eyecup from the euthanized animal. Hold the pigmented layer of the retina with blunted forceps to stabilize the eyecup. Use another pair of closed forceps to very gently tease the whole intact retina off of the back of the eye. Avoid pinching, pulling, or tugging the retina directly.\nUse small spring scissors to cut the area where the optic nerve is still attached to the retina.\nBe sure to cut away any residual pigment epithelium or scleral tissue from the retina.\nUsing a transfer pipette, very gently transfer the isolated retina to a clean sylgard coated 35 mm x 10 mm petri dish containing fresh PBS.\n9. Whole-Mount Retina Preparation\nOnce in the sylgard dish, use forceps and one cactus needle to pin the retina in place. Keep the retinal ganglion cell layer facing up and optic nerve down. The retina's hemispherical shape is notable even after fixation. The curvature of the retina will curl toward the ceiling when the retinal ganglion cell layer is in the desired orientation.",
    "Use small scissors to cut the retina into four quadrants, making the shape of a four leaf clover radiating from the optic nerve head.\nPin the quadrants of the retina with additional cactus needles to make the retina as flat as possible without stretching (Figure 5).\nFix the pinned retinas in the sylgard dish with 3 ml of 4% paraformaldehyde O/N at RT.\n10. Antibody Staining of Retina\nNote: Stain fixed retinas with primary and secondary antibodies for viewing neurons in the retina (Figure 6).\nRinse fixed, flat-mounted retinas three times for 2 min each in PBS.\nPermeabilize the retinas with 1% Triton X-100 with 1% fetal bovine serum in PBS for 60 min.\nRinse retinas three times, 2 min each, in PBS.\nRinse twice with 0.1% Triton X-100 in PBS, 5 min per wash.\nRinse twice with PBS, 5 min per wash.\nIncubate with 1% Triton X-100 and 1% fetal bovine serum in PBS at RT for 45 min.\nRinse twice with 0.1% Triton X-100 in PBS, 5 min per wash.\nRinse twice with PBS, 5 min per wash.\nIncubate each retina in 3 ml 1% fetal bovine serum in PBS with purified mouse anti-rat CD90/mouse CD90.1 (1:300 dilution) O/N at RT.\nRinse retinas once with 0.1% Triton X-100 in PBS for 5 min.\nRinse twice with PBS, 5 min per wash.\nIncubate each retina in 3 ml PBS (no FBS) with secondary Alexa Fluor 594 goat anti-mouse IgG (1:300) O/N at RT.\nWash retinas with PBS liberally.\nUsing a dissecting microscope, carefully remove cactus needles from the retina.",
    "Gently transfer retinas onto microscope slides with a transfer pipette. Be sure to maintain orientation with retinal ganglion cell layer facing to the ceiling. The retina's hemispherical shape is notable even after fixation. The curvature of the retina will curl toward the ceiling when the retinal ganglion cell layer is in the desired orientation.\nAbsorb any excess PBS with KimWipe or other such absorbent material. Be careful not to absorb the retina.\nAdd 5 drops of ½ glycerol and ½ PBS by weight as a mounting media.\nCover retina with coverslip, avoiding air bubbles.\nSecure coverslip using clear nail polish, glue, or other adhesive.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}