{
  "id": 18326,
  "origin_website": "Jove",
  "title": "Isolation of Endothelial Progenitor Cells from Healthy Volunteers and Their Migratory Potential Influenced by Serum Samples After Cardiac Surgery",
  "procedures": [
    "Blood for the isolation of EPCs was obtained from healthy volunteers after informed consent in accordance with the local ethics committee. Serum samples used in the migration assays were obtained from patients that underwent conventional cardiac surgery with the use of cardiopulmonary bypass (CPB). Exclusion criteria were emergency operations, known or suspected pregnancy, patient`s age less than 18 years, and failure to obtain informed consent. Serum samples were drawn in addition to clinical routine measurements (immediately before surgery and immediately after myocardial reperfusion/opening of aortic cross-clamp) and subsequently stored at -80 °C until final analysis. The institutional review board (Ethics committee, RWTH Aachen University) approved this study. The patients showed an average age of 68.6 years and an average weight of 81.7 kg. Pre-existing diseases included: hypertension (65%), chronic pulmonary disease (19%), extra cardiac arteriopathy (16%), cerebral dysfunction (6%), unstable angina (3%), recent myocardial infarction (28% within 90 d), chronic kidney disease (14%), liver disease (2%) and diabetes (34%).\n1. Coating of T75 Flask:\nPrepare 5 mL fibronectin solution (1 mg human fibronectin diluted in 15 mL ultrapure water) per T75 flask.\nAdd the solution to a T75 flask and wait until the water is evaporated. To avoid any unnecessary interruptions during the isolation process due to the evaporation, perform this process in advance (e.g. overnight) and at room temperature. This solution gives 4.44 µg fibronectin/cm2.\nPrepare the endothelial cell growth medium MV2 by supplementing the basal MV2 medium with the growth factor supplements provided by the manufacturer.\n2. Isolation of Endothelial Progenitor Cells (EPCs) from 60 mL Blood:",
    "NOTE: As the CD34-positive selection cocktail and the magnetic beads are commercially available in a combined selection kit, there are no concentrations provided by the manufacturer. However, about 100 µL of the antibody are sufficient for processing up to 5 x 108 cells. The magnetic beads are diluted in water, dextran-coated and about 5,000x smaller compared to other commercially available beads. For further information, see manufacturer´s instructions.\nMix blood (with or without anticoagulants) 1:1 with Ca2+-Mg2+-free PBS.\nAdd 15 mL of density gradient solution per 50 mL tube. For further information, see manufacturer´s instructions.\nSlowly layer the diluted blood on top of the density gradient solution.\nCentrifuge samples at 2,500 x g for 30 min with slow acceleration and without braking.\nCarefully collect the buffy coat layer of every tube (Figure 1) using a sterile plastic pipette and put it into another tube. Avoid collection of the density gradient solution. The expected PBMC yield is approximately 3-4 x 106 cells/mL blood.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55192/55192fig1.jpg\nFigure 1: Density Gradient Centrifugation of Bbuffy Coat on Ficoll Solution. Shown is the result of the density gradient centrifugation at 2,500 x g for 30 min on the density gradient solution. Depicted are erythrocytes and granulocytes (red), the mononuclear cell fraction (white layer), plasma (yellow), and the density gradient solution (whitish). Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55192/55192fig1large.jpg]\nDilute the peripheral blood mononuclear cell fraction with at least 3 volumes of PBS and mix. Centrifuge at room temperature for 15 min at 200 x g.\nRepeat step 2.6 twice.\nAspirate the supernatant and resuspend cell pellet in 5 mL MV2 medium.\nAdd 100 µL of human CD34 antibody (sufficient for processing up to 5 x 108 cells) per used buffy coat and rotate for 15 min at 37 °C with 5% CO2.",
    "Add 50 µL of dextran-coated magnetic beads per used buffy coat and rotate for 10 min at 37 °C with 5% CO2.\nAfter incubation, transfer the suspension to FACS tubes with a maximum of 3 mL in each tube. Higher amounts will not be permissible with the magnet.\nInsert FACS tube(s) into the magnet(s) and wait for 5 min.\nDiscard supernatant without pulling the FACS tubes out of the magnet.\nResuspend the cells in each FACS tube with 3 mL MV2 medium outside of the magnet.\nRepeat steps 2.12-2.14 twice.\nPull the FACS tubes out of the magnets and resuspend the cells in 3 mL MV2 medium.\nTransfer the cell suspension into pre-coated T75 flasks and add 17 mL MV2 medium per flask.\n\tNOTE: The medium should be changed after 3 days. After one week, cells show spindle-like structures (Figure 2) and are ready to use. For an overlook of the isolation see Figure 3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55192/55192fig2.jpg\nFigure 2: Microscopic Image of Isolated EPCs. Shown is a representative image of isolated early-EPCs in a T75 flask prior to detachment. Apparent is the spindle-like structure of the EPCs. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55192/55192fig2large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/55192/55192fig3.jpg\nFigure 3: Flowchart Showing the EPC Isolation Procedure. Depicted is a scheme, showing the single steps of the EPC isolation protocol. For a more detailed protocol see Section 2 in the protocol section.\n3. Migration Assay\nRemove the medium from EPCs in the T75 flask.\nWash with 5 mL PBS by shaking it carefully.\nRemove PBS and add 5 mL commercial cell detachment solution. Wait until the cells are detached (check under a microscope). Accelerate the detachment by carefully tapping the bottom of the flask.",
    "When the cells are detached, quickly add 5 mL of MV2 complete medium and transfer the cell suspension into another tube.\nCentrifuge at 2,000 x g for 5 min.\nResuspend cells in 5-10 mL PBS and centrifuge again at 2,000 x g for 5 min.\nRepeat step 3.6.\nResuspend the cell pellet in MV2 starved medium (50,000 cells in 75 µL per transmigration well are needed).\n\tNOTE: Which migration system is needed depends on the cell type and assay. There are different pore diameters and plate sizes (number of wells). For EPCs a pore size of 5 µm in 96 well system is optimal.\nPrepare the migration plate by adding 235 µL of the serum sample (serum diluted 1:5 in MV2 starved medium) into the lower chamber (Figure 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/55192/55192fig4.jpg\nFigure 4: Migration Assay in a Modified Boyden Chamber. Shown is the general design of a modified Boyden chamber. The cell culture inserts (= upper chamber) are indicated in dark blue and are inserted into the lower chamber. The bottom (but not the walls) of these inserts represents the filter system including the pores. (a) Shows the setup at time point zero. (b) After a chosen time point, cells are migrated through the filter towards a stimulus. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55192/55192fig4large.jpg]\nAdd the insert shortly prior adding the cell solution.\nAdd 75 µL of the cell solution (= 50,000 cells) into the upper chamber.\nLet the EPCs migrate for 3 h at 37 °C and 5 % CO2 (migration time depends on cell type and system).\nTo avoid serum auto-fluorescence artefacts, quantify migrated cells by taking pictures of the well under a microscope and count the cells using the semi-automated software \"ImageJ\".\nRemove the upper chamber (containing all non-migrated cells).",
    "Add 70 µL 3.6% paraformaldehyde solution, including Hoechst dye (diluted 1:1,000). The plate can be stored at 37 °C and 5% CO2 overnight.\nCentrifuge the plate shortly to get all cells into the same focal plane at 2,000 x g for 1-2 min.\nTake 5 pictures per well (Figures 5 and 6) with a 100x magnification.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55192/55192fig5.jpg\nFigure 5: Scheme Showing the Position of the Taken Pictures. The scheme depicts the position of the five taken pictures, which are needed for the determination of migrated cells, in relation to the well. The pictures are taken to count the cells and calculate a mean value for every well. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55192/55192fig5large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/55192/55192fig6.jpg\nFigure 6: Microscopic Image for Cell Quantification. Shown is a representative image, which was taken for cell quantification. The cells were stained and fixed using Hoechst dye in 3.6% paraformaldehyde. The dots represent fixed and stained endothelial progenitor cells. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55192/55192fig6large.jpg]\nCount the migrated cells by using the semi-automated software \"ImageJ\" by the National Institute of Health.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}