{
  "id": 9441,
  "origin_website": "Jove",
  "title": "Electroporation of the Hindbrain to Trace Axonal Trajectories and Synaptic Targets in the Chick Embryo",
  "procedures": [
    "1. Hindbrain Electroporation\n1.1 Egg handling\nPlace the eggs horizontally in a humidified incubator (37-38.5 °C). Embryos are electroporated after 65-70 hr of incubation, when they reach 16-17 (HH) stage (25-30 somites).\nRemove the eggs from the incubator; they remain in the horizontal position.\n1.2 Preparations\nPull glass capillaries (0.5 mm diameter).\nConnect bent L-shaped gold Genetrodes electrodes (3 mm diameter) with an adaptor holder to the pulse generator. Electroporation parameters include 25 volts, 5 pulse numbers, 45 msec pulse length, 300 msec pulse intervals.\nPrepare a mouth pipette, 10 ml syringe needle, parafilm strips, a soft brush, sharp dissecting scissors and 25 ml sterile PBS solution. This amount is usually sufficient to handle an egg tray (18 eggs).\nPrepare an adequate mixture of DNA plasmids (5 μg/μl each) and add about 0.025% Fast Green dye to visualize DNA injection. Usually a volume of 4 μl is sufficient for the injection of a tray.\n1.3 Windowing, Injection and Electroporation\nClean egg shells with 70% ethanol.\nHandle one egg at a time to minimize embryonic exposure time to air.\nMake a hole at the egg pole with the scissors ends and remove 3-4 ml of albumin with the syringe. Do not remove a larger amount of albumin as it reduces viability.\nOpen a small oval window (2.5 x 2 cm size) at the upper center of the egg shell using the dissecting scissors.\nDrip few drops of PBS on top of the embryo to prevent dryness during the whole process.\nLoad a small amount of the DNA mixture into the glass capillary using a mouth pipette.",
    "Place the embryo with its posterior end towards you. No ink injection is required at this stage as the embryo is clearly visible. Avoiding ink injection increases embryonic survival. Penetrate the caudal hindbrain by holding the capillary at ~45°. Do not remove any membrane from around the embryo. Inject DNA solution carefully into the hindbrain lumen and exhale without forming air bubbles. DNA solution spreads anteriorly.\nImmediately after DNA injection, place the parallel electrodes at the precise AP and DV hindbrain position you aim to target. Push the electrodes slightly ventrally without touching the heart, as it may reduce viability. Pulse the electroporator. Electrodes should be covered with bubbles to indicate electrical conductivity (Figure 1A).\nCarefully remove the electrodes and drip few drops of PBS to cool the embryo and to remove bubbles. Seal the egg opening properly with a parafilm strip to prevent drying during incubation. Wash electrodes in PBS with the soft brush.\nPlace egg in the incubator for the desired length of time. Survival of embryos is approximately 90% 2-3 days after electroporation, and reduces up to 50% 12 days following electroporation.\n2. Analysis of Embryos\n2.1 Flat-mount preparation and immunofluorescence\nFlat-mount preparations of the hindbrain can be performed up to E6.5 to easily visualize axons under a microscope or a stereo-microscope.\nDissect the embryo carefully by separating it from surrounding membranes and blood vessels. Place the embryo in a small silicone-coated Petri dish containing PBS. Attach the embryo to the dish with tungsten pins facing dorsally. Perform a dorsal slit in the hindbrain roof-plate using sharp glass capillaries.\nUsing sharp tweezers and micro-scissors hold the upper part of the head and pull the hindbrain tissue very carefully from rostral to caudal. After separation of the hindbrain remove remaining ventral tissues to reach a clean preparation.",
    "Incubate the hindbrain with 4% paraformaldehyde (PFA) solution for 1-2 hr at room-temperature (RT). Wash the hindbrain with PBT (PBS/0.1% Triton X-100) to remove PFA.\nFor Immunofluorescence in flat-mounted hindbrains add 500 μl of blocking solution (5% of goat serum in PBT and incubate for 2 hr at RT Incubate with 1st antibody ON at 4 °C. Wash with PBT (15 min x 3). Incubate with 2nd antibody for 2 hr at RT. Wash with PBT (15 min x 3).\nPlace the hindbrain facing dorsally on a glass slide. Add fluorescent mounting media onto the hindbrain. Use glass capillaries or tungsten needles to flatten the hindbrain on the slide.\nAdd small amount of grease at each corner to prevent squeezing of the tissue by the cover slip. Carefully place a cover slip on top of the hindbrain and avoid air bubbles. For adherence add nail polish to cover glass edges.\n2.2 Cryo-sections and Immunofluorescence\nCryo-sections of the brainstem can be performed at any stage to visualize axonal trajectories. Yet, after E6.5 this should be the preferred method due to the difficulty to visualize axons in the flat-mounted embryo, which becomes too thick. Moreover, demonstration of synapses requires sectioning of the tissue and a high-magnification view under a microscope.\nDissect the embryo and remove all surrounding tissues. Rinse with PBS. Cut the embryo at the caudal part of the medulla using micro-scissors and sharp tweezers. Make a wide incision between the cerebellum and the midbrain and remove the entire brainstem. The tissue should contain the medulla, pons and cerebellum.\nFix the brainstem in 4% PFA for overnight (ON) at 4 °C, rinse with PBS (10 min x 3), and incubate with 30% sucrose for ON at 4 °C until sinking.",
    "Embed the hindbrain in a cryo-mold with OCT (Optimal Cutting Temperature) compound, and place it at -20 °C until freezing, as described elsewhere 11.\nPlace the OCT block in the cryostat at the desired sectional axis. Section width is 12 μm.\nDry the slides. Add 100 μl blocking solution on each slide for 2 hr at RT. Add 100 μl of antibodies (diluted in the blocking solution to the desired concentration). Incubation period for 1st and 2nd antibodies is ON at 4 °C or 2 hr at RT, respectively. For each incubation time, gently add parafilm strip on top of the slide to prevent dryness. Wash with PBS (10 min x 3) between antibodies. If required, add 1:1,000 Dapi (4'-6-Diamidino-2-phenylindole), diluted in PBS for 20 min at RT. Rinse with PBS.\nMount the slide with fluorescent mounting media. Let dry for 1 hr before analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}