{
  "id": 11105,
  "origin_website": "Jove",
  "title": "Modified Blood Collection from Tail Veins of Non-anesthetized Mice with a Vacuum Blood Collection System and Eyeglass Magnifier",
  "procedures": [
    "1. Husbandry\nUse 12 week old Kunming mice.\n\tNOTE: We used mice (n = 40, 20 males, 37–46 g, mean 42.38 ± 2.39 g) from the Experimental Animals Center of Tongji Medical College.\nHouse the mice under standard conditions with free access to food and drinking water. Keep two mice in a 530 cm2 cage with wood shaving bedding.\nMaintain a room temperature between 21–23 °C.\nFeed mice with a normal salt diet (0.3% NaCl) throughout the study.\n2. Blood sample collection\nPrepare the following equipment: vacuum tube (1 mL), butterfly needle, eyeglass magnifier, and plastic restraining holder. Place them on a sterile surface (Figure 1).\nPlace a mouse in a plastic restraining holder and wash its tail with warm water (20–30 °C). Wipe the tail with 70% ethanol-saturated cotton balls to expand the vein. Select the right or left tail vein for blood sampling. Grasp the lower portion of the tail gently and keep the tail straight during blood sample collection.\nCollect the blood. If comparing methods, collect blood in two groups: the “experimental” group using the procedure we have developed, presented below, and “conventional” group using a conventional method, also presented below.\n\t\nExperimental collection:\n\t\t\nWear an eyeglass magnifier to improve the viewing for puncture of the tail vein. Insert the 22 G butterfly needle tip into one of the lateral tail veins at a position approximately half the distance distally from the tip of the tail at an angel approximately 10°, moving towards the base of the tail for multiple samples.\nInsert the rubber end of the butterfly needle into the vacuum blood collection tube to collect blood (Figure 2).",
    "NOTE: If blood stops flowing out during blood collection, the needle angle should be quickly adjusted. To avoid blood coagulation in the needle, another puncture position should be selected if blood stops flowing out after 15 s.\nConventional method:\n\t\t\nInsert the needle connected to a syringe into one of the lateral veins approximately one-third of the distance distally from the tip of the tail.\nWhen blood appears in the hub, pull back the plunger slowly to collect blood (Figure 3)7.\n\t\t\tNOTE: To further elucidate the effects of varying experience with blood collection, a beginner and expert were chosen to collect blood samples using experimental and conventional methods simultaneously.\nAfter blood collection, remove the needle and press the puncture point to stop bleeding. Then, release the mouse from the plastic restraining holder and return the mouse to its cage.\n\tNOTE: It has been reported that up to 10% of total blood volume can be safely removed from a healthy animal at 2 week intervals8, so about 175 µL of blood was collected each time in accordance with ethical principles.\nUse tubes with EDTA to collect plasma and use tubes without anticoagulants to collect serum. Gently invert the tube several times and put them on ice vertically.\nCentrifuge the blood sample collection tubes in a refrigerated centrifuge at 1,000 x g for 10 min to separate plasma and serum.\n\tNOTE: Successful blood collection is defined as obtaining a volume of 175 µL each time. No more than three punctures should be attempted, and a failed blood collection is defined as a total blood volume of less than 175 µL after the third puncture. The sampling duration is defined as the time from the tail vein puncture to removal of the needle after blood collection.\nCollect blood twice at intervals of 2 weeks8.",
    "3. Statistical analysis\nUse commercially available statistical software for analysis. Present data as mean value ± standard deviation, using p < 0.05 as the cutoff for statistical significance."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}