{
  "id": 5707,
  "origin_website": "Bio",
  "title": "Tandem Affinity Purification in Drosophila Heads and Ovaries",
  "procedures": [
    "Isolation of protein complexesFor protein complex isolation from drosophila ovaries:Feed (1-3 day old) flies expressing your TAP-tagged protein for three days with yeast paste.Dissect ovaries in 1x PBS, collect in a 1.5 ml microcentrifuge tube, and freeze at -80 °C. Collect more than 200 pairs of ovaries. Ovaries can be collected following several independent rounds of dissection and frozen to amass an appropriate amount.Homogenize ovaries in 1 ml Bouwmeester's buffer using disposable pestles that fit 1.5 ml microcentrifuge tube.Incubate on ice for 20 min and transfer to Beckman centrifuge tubes (1/2 x 2 inch).Spin tubes at 4 °C, 20,000 x g for 15 min.Remove and save supernatant on ice. This is your cytoplasmic extract.Spin tubes at 4 °C, 100,000 x g for 45 min to remove remaining extract following additional spin.Remove and save supernatant on ice. This is your nuclear extract (can combine the extracts from step A6 and A8, if you want total extracts, or keep separate).Take out 20 μl from each of your isolated extracts as a lysate control (control A). Freeze in liquid nitrogen and store at -80 °C. Go to step #a in Section 2: Pulldown of protein complexes.For protein complex isolation from drosophila heads:Freeze flies expressing TAP-tagged protein of interest at –80 °C. You will need at least 50 ml of frozen flies to begin. Weigh starting materials on a standard scale and be sure to have at least 1 gram of heads.Chill sieves in liquid nitrogen in preparation for head popping procedure.Pop heads off using liquid nitrogen and the proper sized meshes (http://cmgm.stanford.edu/~vesicle/protocols/droshead.html[href=http://cmgm.stanford.edu/~vesicle/protocols/droshead.html]). Keep purified head samples on dry ice or at -80 °C until you are ready for the next step.Pre-freeze mortar and pestle using liquid nitrogen.",
    "Add heads and liquid nitrogen to chilled mortar and pestle and grind sample on dry ice, continuing to add liquid nitrogen until you have a fine powder.When you have fine powder, add more liquid nitrogen to pour out powder into a 50 ml falcon tube.Let liquid nitrogen de-gas in uncovered tube for 5-10 min.Add 2 ml bouwmeester buffer to powder, transfer to a dounce homogenizer and dounce homogenize 10 times. Transfer to several 1.5 ml microcentrifuge tubes. Spin 15 min, 15,000 x g at 4 °C, remove supernatant and repeat spin to remove as much as supernatant as possible.Take out 20 μl as a lysate control from each sample (control A). Snap freeze in liquid nitrogen and store at -80 °C.Pulldown of protein complexesPrepare 200 μl IgG Sepharose Fast Flow beads in a 15 ml falcon tube and wash twice with 500 μl buffer B (add 100 μl PIC and 5 μl DTT fresh to 10 ml buffer B). After each wash with buffer B, spin at 4 °C, 100 x g for 2 min in a Beckman table top centrifuge and remove supernatant.Add lysate and rotate overnight at 4 °C on a nutator.After overnight incubation, spin at 4 °C, 100 x g for 5 min in a Beckman table top centrifuge and remove supernatant. Save 20 μl of supernatant for post-incubation control (control B).Wash beads 3 times in 1 ml Buffer B. Spin 4 °C, 100 x g for 2 min after each wash in a Beckman table top centrifuge.Wash beads 4 times in 1 ml Buffer C. Spin 4°C, 100 x g for 2 min after each wash in a Beckman table top centrifuge.Wash twice in 1 ml TEV cleavage buffer.",
    "Spin 4 °C, 100 x g for 2 min after each wash in a Beckman table top centrifuge. Remove 10 μl beads as a control (control C).Add 400 μl TEV cleavage buffer and 4 μl AcTEV protease to beads and transfer to a 1.5 ml microcentrifuge tube. Rotate overnight at 4 °C on a nutator.Spin 300 x g, 1 min at 4 °C in a bench top centrifuge.Take off supernatant and add 0.6 μl 1 M CaCl2 per 200 μl supernatant (usually 1.2 μl for 400 μl total supernatant).Prepare a 1.5 ml microcentrifuge tube with 100 μl Calmodulin sepharose resin and wash twice with 500 μl Calmodulin binding buffer. Spin 2 min, 1,500 rpm, 4 °C after each wash.Add 3x volume Calmodulin binding buffer to supernatant and add this to prepared calmodulin resin. Rotate 3-4 h at 4 °C.Spin 2 min, 1,500 rpm, 4 °C.Wash three times with 500 μl Calmodulin binding buffer. Spin 2 min, 1,500 rpm, 4 °C after each wash.Elute TAP-tagged protein with Calmodulin elution buffer using preferred strategy.Run eluate on a 4-12% Bis-Tris 10 well gel.Run controls and protein ladder on a separate gel from final eluate so there is no contamination.Stain with either Coomassie Blue, Colloidal Blue Staining Kit, or Silverquest Kit. Cut out bands of interest and send to the Mass Spectrometry Facility."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}