{
  "id": 15064,
  "origin_website": "Jove",
  "title": "Methylated RNA Immunoprecipitation Assay to Study m5C Modification in Arabidopsis",
  "procedures": [
    "1. Preparing the RNA\nGrind 200 mg of plant tissue to powder in liquid nitrogen, making sure that the tissue remains frozen throughout the procedure.\nExtract the RNA from the desired plant tissue following an acid guanidinium thiocyanate-phenol-chloroform extraction protocol. To decrease the possibility to contaminate RNA with DNA during the phase separation, use 1-bromo-3-chloropropane instead of chloroform.\n\t\nAdd 1 mL of RNA extraction reagent containing guanidine thiocyanate and acid phenol to the grinded plant tissue (500 µL per 100 mg tissue). Mix well by inverting and make sure all the tissue is wet. Incubate for 10 min at room temperature to dissociate the ribonucleoprotein complexes.\nCentrifuge for 10 min at 12,000 x g at 4 °C and transfer the supernatant to a new 1.5 mL tube.\nAdd 200 µL of 1-bromo-3-chloropropane (100 µL per 500 µL RNA extraction reagent) and vortex vigorously.\nCentrifuge for 15 min at 12,000 x g at 4 °C and transfer the upper aqueous phase (approx. 500 µL) to a new 1.5 mL tube.\nAdd 1 volume of isopropanol (500 µL) and 0.1 volume of 3 M sodium acetate pH 5.5 (50 µL), mix well by inverting and precipitate 10 min at -20 °C.\n\t\tNOTE: The use of sodium acetate (NaOAc) is recommended in order to enhance RNA precipitation. The protocol can be paused at this point by prolonging the precipitation of RNA for a few hours or even overnight.\nCentrifuge for 30 min at 12,000 x g at 4 °C and discard the supernatant.\nWash the pellet twice with 500 µL of 80% EtOH, centrifuge for 5 min at 12,000 x g at 4 °C and discard.\nWash the pellet once with 500 µL 99% EtOH, centrifuge for 5 min at 12,000 x g at 4 °C and discard.",
    "Dry the pellet for 5-10 min and dissolve in 30 µL of RNase-free H2O.\n\t\tNOTE: Instead, use any RNA extraction protocol of choice (e.g., a column-based system). If a DNase digestion is included in the protocol, skip it in the following step (step 1.3).\nMeasure the RNA concentration (e.g., with the use of a spectrophotometer) and digest 20 µg of RNA with DNase.\n\tNOTE: DNA is rich in m5C and the antibody does not distinguish between DNA and RNA.\n\t\nIn a typical DNase reaction, treat 10 µg of RNA in a 50 µL reaction. Mix the following components and incubate the reaction(s) at 37 °C for 30 min:\n\t\t10 µg of RNA x µL\n\t\t10x DNase buffer 5 µL\n\t\tDNase 1 µL (2 units)\n\t\tRNase-free H2O up to 50 µL\nRemove the enzyme either by adding an appropriate volume of DNase inactivation reagent (if it is included in the DNase kit and according to manufacturer’s instructions) or by performing a cleanup step (e.g., column purification or phenol/chloroform extraction).\nCheck the quality and purity of the isolated RNA by capillary electrophoresis and proceed if the RNA integrity number (RIN) is higher than 7, to ensure the samples are of good quality.\nOPTIONAL: Remove the ribosomal RNA to enrich the samples in mRNA content using an rRNA removal kit and according to manufacturer’s protocol.\n\t\nUse the DNase treated RNA from the previous step for the rRNA depletion reaction(s). Perform multiple reactions if the amount of total RNA is more than the maximum amount suggested for the reaction.\nNote that only 5-10% of the input amount will be recovered after rRNA depletion. Proceed with the rRNA depleted RNA (equal amount for all samples) and ignore the amounts mentioned in the following steps, as they refer to total RNA.",
    "NOTE: For a comparison and description of available rRNA depletion methods see references 38,39,40. rRNA is the major part of total RNA and is m5C methylated in many organisms.\nPrepare in advance in vitro transcripts (IVT) to be used as control RNA sequences and add them in the samples.\n\t\nProduce two distinct IVTs using an in vitro transcription kit, one with non-methylated nucleosides and one where rCTP is replaced by 5-methyl-rCTP, to serve as negative and positive controls in MeRIP, respectively. The transcripts prepared were those of EGFP and Renilla luciferase.\n\t\tNOTE: The IVTs should not exist in the transcriptome of the organism you are analysing. If the IVTs are from the same template (e.g., both EGFP), then add the positive and negative control in two different samples. If their sequence is different (e.g., EGFP and Renilla), they can be added to the same sample.\nSpike in each sample 0.1 ng IVT per 3 µg of RNA, as controls.\nSonicate the RNA to approximately 100 nt fragments.\n\tNOTE: The conditions for RNA shearing must be adjusted in advance and they differ for each sonicator. For the model used here, sonication is performed with the following conditions: Peak power 174, Duty factor 10, Cycles/burst 200, 17 min.\n\t\nSonicate the same amount of RNA for all samples, at least 12 µg RNA per sample in 80 µL of total volume (min 60 µL, max 100 µL), filled up with RNase-free H2O.\nConfirm the efficiency of sonication and the concentration of the RNA samples by capillary electrophoresis. The average size of fragmented RNA should be around 100 nt.\n2. Methylated RNA Immunoprecipitation (MeRIP)\nIn low-binding tubes, add 9 µg of sonicated RNA and RNase-free H2O up to 60 µL (or more, depending on the concentration).",
    "Dissociate the secondary structures by heating the RNA at 70 °C in a water bath for 10 min and cooling down for an additional 10 min in an ice-water mix.\nSplit the sample in three parts: one-third (20 µL, if 60 µL were taken in step 2.1) is saved in a separate tube at -80 °C as the Input sample. Fill the remaining 40 µL with RNase-free H2O up to 860 µL and then split in two low-binding tubes: one for IP and one for the Mock control (430 µL each).\nAdd to both tubes:\n\t50 µL of 10x MeRIP buffer\n\t10 µL of RNase inhibitor\n\t10 µL of α-m5C antibody (10 µg) in the IP sample per 10 µL of H2O in the Mock sample\n\tNOTE: The antibody clone used previously is not commercially available anymore. However, any anti-5-methylcytosine monoclonal antibody should work similarly. Antibodies should be tested for specificity before used for MeRIP11,23.\nSeal the tubes with parafilm and incubate for 12-14 hours at 4 °C, with overhead rotation.\nThe next day, prepare the protein G magnetic beads for binding.\n\t\nFor each tube (either IP or Mock control), use 40 µL of beads. Add the total amount of beads (# of tubes x 40 µL, e.g., for 2 IP and 2 Mock samples, 160 µL of beads are needed) in a 15 mL tube and wash three times with 800 µL of 1x MeRIP buffer per sample (# of tubes x 800 µL buffer, e.g., 3.2 mL for 2 IP and 2 Mock samples).",
    "Perform washes at room temperature for 5 min with overhead rotation, collect the beads with the help of a magnetic rack and discard the washing buffer. After the third wash, resuspend the beads in the same volume of 1x MeRIP buffer as the initial volume of beads taken (# of tubes x 40 µL, e.g., 160 µL of 1x MeRIP buffer for 2 IP and 2 Mock samples).\n\t\tNOTE: The amount of protein G beads used is determined by the binding capacity of the beads for the specific antibody type and the amount of antibody used. In this case, the beads have a binding capacity of approx. 8 µg of mouse IgG per mg of beads and 30 mg/mL concentration. Therefore, 40 µL are enough to bind approx. 9.6 µg of antibody.\nAdd 40 µL of resuspended beads to each IP and Mock sample and incubate for additional 2 hours at 4 °C, with overhead rotation.\nPlace the tubes on a magnetic rack for 1 min and discard the supernatant or save it as a control (non-bound RNA sample).\nWash the beads 5 times by resuspending in 700 µL of 1x MeRIP buffer supplied with 0.01% Tween 20 and incubating for 10 min at room temperature with overhead rotation.\nResuspend the washed beads in 200 µL of Proteinase K digestion buffer and add 3.5 µL of Proteinase K. Incubate for 3 hours at 50 °C, shaking at 800 rpm. Occasionally, flick manually the bottom of the tube if a sediment of beads is forming during the incubation.",
    "Extract the RNA by addition of 800 µL of RNA extraction reagent and following an acid guanidinium thiocyanate-phenol-chloroform extraction protocol, and continue as in step 1.2. To increase visibility of the RNA pellet, a colored co-precipitant can be added in isopropanol at the precipitation step. Resuspend the pellet in 20 µL of RNase-free H2O (or equal to Input volume kept in step 2.3).\n3. Downstream analysis\nSubmit the Input and IP samples for single end sequencing with 50 bases read length (SE50).\nTrim 3’ end adaptors using cutadapt41 and discard reads that are shorter than 48 nt.\nMap trimmed reads to the Arabidopsis genome (TAIR10 annotation) using STAR42 with a cutoff of 6% for mismatches and maximum intron size of 10 kb. Keep uniquely mapped reads for further analysis.\nIdentify enriched RNA fragments in IP samples compared to Input using two distinct methods and consider those that are found significantly enriched by both.\n\t\nFirst, detect MeRIP-seq peaks using MACS2 peak caller43 on pooled IPs versus Input.\nSecondly, follow the analysis for MeRIP-seq peak calling as described in Meyer et al.22 and Yang et al.17.\n\t\t\nUsing custom R scripts, divide the genome in distinct 25 nt windows and count the number of uniquely mapped reads for each window based on the position of the last mapped nucleotide (since the reads originate from 100 nt RNA fragments).\nCalculate significantly enriched windows in IP samples compared to Input with the Fisher Exact Test. Use the Benjamini-Hochberg procedure to correct for multiple testing.\nKeep the significantly enriched peaks that span over at least two consecutive windows and discard peaks that cover only one window.\nIdentify annotated regions of the genome (transcripts) with significantly enriched peaks found by both methods.\nAlternatively or complementarily, test specific RNA targets for their enrichment in the IP samples.",
    "Reverse transcribe the RNA (same volume of Input, IP and Mock samples) with random hexamers.\nPerform quantitative real-time PCR on the chosen targets, comparing Input, IP and Mock via the ΔΔCt method.\n\t\tNOTE: The generated product should not be longer than 100 bp, as this is the average fragmentation size."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}