{
  "id": 3879,
  "origin_website": "Cell",
  "title": "Mass spectrometry analysis of circulating breast cancer cells from a Xenograft mouse model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCTC live immunostaining\nTiming: 45 min\nThis staining procedure discriminates between CTCs (e.g., EpCAM-positive), mouse blood cells (e.g., CD45-positive) and dead cells (DAPI-positive). Further staining for Tags or taggable markers (e.g., EGFR, HER2) can be added to refine the cell populations. For instance, some cancer cells express low levels of epithelial surface markers, such as EpCAM. In this case, when these are not stably transduced with a tagging fluorophore, CD298 (antibody recognizing β3 Na+/K+ ATPase protein and abundantly present on the membrane of several cancer models, such as LM2 cells) could be used to discriminate between cancer cells and contaminant cells (Lawson et al., 2015[href=https://www.wicell.org#bib8]).\nIn this protocol, we added CD298-PE staining of LM2 mCherry/Luc expressing HIF1α activity reporter (eYFP(+)).\nBSA removal from antibody solutions (work at RT).\nMix the chosen antibody cocktail: for 100 μL staining solution, add 1:15 dilution CD298-PE, 1:10 mouse CD45-AF647 and 1× DPBS up to 100 μL.\nApply the GOLD BSA removal kit according to the manufacturer’s protocol.\nCTCs live immunostaining (work on ice).\nGently centrifuge the CTC suspension at 72 × g for 4 min in a pre-cooled centrifuge to reduce the volume.\nGently resuspend the pellet in cold 1× DPBS and add the BSA-free antibody mix in a total volume of 500 μL.\nIncubate for 30 min at RT and protect from light.\nWash the CTCs suspension using 1 mL of cold 1× DPBS and centrifuge at 72 × g for 4 min in a pre-cooled centrifuge. Repeat this wash twice to ensure total elimination of excess antibodies.\nResuspend stained cells in 1–2 mL of cold 1× DPBS solution and transfer on ice.",
    "Note: When working with single CTCs and CTC clusters, it is important to reduce the steps of centrifugation to the minimum. Therefore, the use of fluorescent labeling of cancer cells and in-cassette staining procedures are strongly advised.\nFluorescent-activated cell sort\nTiming: 2–3 h\nFACS sorting of CTCs separates different populations of interest. Single CTCs and CTC clusters are separated by physical properties via Side SCatter (SSC) and Forward SCatter (FSC). The use of specific FACS sorting technology that allow to mount 200 μm nozzles (e.g., Influx, BD) and to set the minimum fluidic pressure to five pounds per square inch (psi), permits the separation of CTC clusters from single CTCs without damaging CTC clusters (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/602-Fig2.jpg\nFigure 2. FACS strategy to separate eYFP(+) CTCs from eYFP(-) CTCs, and single CTCs from CTC clusters\n(A) The plot shows the average cluster size of eYFP(+) and eYFP(-) CTC clusters after FACS sort. The number of independent biological replicates (n) is shown and the Error bars represent SEM.\n(B) Schematics of experimental design.\n(C) The plot shows the separation of cells from debris based on Forward SCatter polarized (FSC POL, X Axis) and Side SCatter (SSC, Y Axis).\n(D) The plot shows the separation and gating strategy of single cells from clustered cells based on FSC POL Width (X Axis) and SSC (Y Axis).\n(E) The plot shows the gating strategy of cells based on the expression of eYFP (X Axis) and CD45 (white blood cells marker, Y Axis).\n(F) Representative pictures of sorted CTC clusters positive (top) or negative (bottom) for the expression of eYFP.",
    "A higher level of separation is achieved when fluorescent staining of cell markers is combined to the stable labeling of the cells of interest. Single CTCs or CTC clusters can be separated for further characteristics such as their hypoxic status (i.e., HIF1α activity reporter, eYFP (+)) based on the combination of fluorescent signals (Figure 2[href=https://www.wicell.org#fig2]B).\nLastly, while for single-cell analysis a micromanipulation of single CTCs and CTC clusters is significantly superior to FACS due to high levels of purity and membrane integrity of micromanipulated CTC clusters, for bulk analysis such as quantitative protein assessment a single-cell micromanipulation would be time consuming. Therefore, FACS represents the best compromise between CTC cluster integrity, sorted CTC yield and time commitment.\nFACS gating strategy.\nDefine the gating strategy in order to separate cells from debris and red blood cells (RBCs) based on their physical properties (Figure 2[href=https://www.wicell.org#fig2]C).\nUse both SSC and FCS Width (W) and Length (L) to separate single cells (left) from clustered cells (right) (Figure 2[href=https://www.wicell.org#fig2]D).\nNegatively gate single cells for CD45 cells while positively gate the same population for the fluorophore of choice (e.g., eYFP +/-) (Figure 2[href=https://www.wicell.org#fig2]E). Repeat the same action for the other cell compartment (clustered cells).\nSort a small quantity of cells in a plate or 1.5 mL tube to assess the purity of the sorted samples under a fluorescent microscope (Figure 2[href=https://www.wicell.org#fig2]F).\nCritical: When sorting for 4 populations simultaneously (Single CTCs eYFP (+), Single CTCs eYFP (-), Clusters eYFP (+), Clusters eYFP (-)), make sure to check the purity of the sample before starting each sort, as changes in the charge of the deflection plates could significantly affect the purity of sorted cells.\nCTC sort of single CTCs or CTC clusters, positive or negative for eYFP fluorophore tag.",
    "Place 1.5 mL tubes in the collection casket with 0.5 mL of cold 1× DPBS.\nAdd DAPI 1:1000 to the sample to discriminate between alive and dead cells.\nNote: Add DAPI right before starting the sort as prolonged incubation might cause leakage of DAPI in live cells.\nStart and monitor the sort.\nNote: Clogs due to big clusters or clamps can contaminate, and in extreme cases, abort the sort. It is advised to not leave the machine unsupervised.\nFor single CTC samples, collect a minimum of 10’000 events. For CTC clusters, collect based on the average cluster size calculated during a trial sort. For example, with 3.5 cells per cluster ratio, collect a minimum of 2’860 events.\nCollect sorted samples and incubate on ice. Proceed immediately to the next step.\nPause Point: Storage of sorted CTCs\nGently centrifuge the CTC suspension at 72 × g for 4 min in a pre-cooled centrifuge to pellet the sorted CTCs.\nRemove as much supernatant as possible and snap freeze the tubes containing the sorted samples in liquid nitrogen\nStore samples at −80° C for up to 1 month. For longer storage (up to 3 months), store samples in liquid nitrogen.\nSample preparation for mass spectrometry (MS) analysis",
    "For a successful proteomic experiment, efficient cell lysis, digestion, and peptide purification are required. In the presented protocol, the protein extraction is performed in the presence of sodium deoxycholate (SDC) that facilitates the extraction of membrane proteins and does not inhibit the enzymatic activity of trypsin. In addition, as a detergent precipitating at pH below 4, it can be easily removed from the sample by acidification. Finally, tryptic peptides are purified using the SDB-RPS spin columns (PreOmics, #P.O.00013), which allow for stringent washes with organic solvents. Importantly, for this protocol, at least 1 μg of starting material is required. In case such yields cannot be achieved, we recommend to use protocols that are optimized for sub-microgram amounts of starting material, for example Single-Pot Solid-Phase-enhanced sample preparation procedure known as SP3 (Hughes et al., 2019[href=https://www.wicell.org#bib7]).\nProtein extraction from whole cells and protein alkylation\nTiming: 1–2 h\nThaw sample tubes at RT and shortly spin to re-pellet.\nAdd 50 μL of lysis buffer to cell pellets, ideally corresponding to 1–100 μg.\nSonicate samples using Bioruptor (Diagenode, 30 s on, 30 s off, 10 cycles at 4° C).\nNote: After sonication, samples should look completely translucent. If not, repeat the sonication step.\nShortly spin samples for 10 s at 2000 × g.\nHeat samples at 300 rpm in a Thermomixer for 10 min at 95°C.\nCritical: Pressure can develop during the heating phase, which can cause the opening of the lid and consequent sample loss. To avoid this, insert the samples in the heating block with the lid opened and close after one minute.\nCool down samples at 25°C and subsequently spin down at 2000 × g for 10 s.\nOptional: If the protein content is not known, measure protein concentration using Reducing Agent compatible BCA assay, according to the manufacturer’s protocol.",
    "Add 1 μL of 0.75 M Chloroacetamide solution and incubate at 500 rpm in a Thermomixer for 30 min at 37° C.\nShort spin samples at 2000 × g for 10 s.\nImmediately continue with the next step.\nProtein digestion\nTiming: 12 h\nMeasure pH of the samples. pH should be kept between 8 and 9. If adjustments are required, use 1M Ammonium bicarbonate.\nAdd trypsin to a final enzyme/protein ratio of 1:50 and digest for 12 h at 37°C.\nNote: Up to 100 μg of protein can be used for the digestion (which is the maximum capacity of SDB-RPS cartridges). The remaining sample can be stored at −80°C.\nSolid-phase extraction (SDB-RPS purification)\nTiming: 2–3 h\nThe next day, spin samples at 2000 × g for 10 s.\nAdd 50 μL of 5% TFA solution.\nNote: After addition of the TFA, a white precipitate should be visible. If not, check the pH to be < 2. If not, add additional 10 μL of 5% TFA.\nAdd 100 μL of Wash 1 buffer.\nVortex for 10 s.\nNote: The precipitate should now be dissolved.\nShortly spin samples at 2000 × g for 10 s\nPlace SDB-RPS cartridges (PreOmics, #P.O. 00013) in 2 mL flow through collection tubes.\nAdd peptide samples to the cartridges and spin at 2’000 × g for 4 min at 25°C .\nDiscard the flow-through.\nNote: Increase the speed by 200 × g and spin again if the liquid does not go through completely\nAdd 200 μL of Wash 1 buffer and spin down at 2’000 × g for 4 min at 25°C.\nRepeat step 26.\nDiscard the flow-through.\nAdd 200 μL of Wash 2 buffer and spin down at 2’000 × g for 4 min at 25°C.\nRepeat step 29.\nDiscard the flow-through.",
    "Place cartridges in clean and labeled 2 mL tubes.\nTo elute the peptides, add 100 μL of the Elution buffer and spin down at 2’000 × g for 2 min at 25°C.\nRepeat step 33.\nDry eluted peptides in a vacuum concentrator at 50°C.\nNote: The temperature of the vacuum is not crucial and it can be run at different temperatures depending on the type of speedvac.\nPause Point: Dried peptides can be stored in −20°C, up to 1 year.\nMass spectrometry analysis\nTiming: 2 h per sample\nDifferent quantitative approaches can be applied to study proteomes of CTCs. The appropriate method should be selected based on the total amount of extracted proteins and number of samples to be compared. In this protocol, we focus on a label-free quantification approach that can be used when the yield of extracted proteins is limited (less than 5 μg). If larger quantities of starting material are available, the quantification accuracy and the proteome coverage can be further increased by employing the tandem mass tagging (TMT) approach (Thompson et al., 2003[href=https://www.wicell.org#bib12]) followed by peptide fractionation (Wang et al., 2011[href=https://www.wicell.org#bib13]).\nReconstitute peptides in 20 μL of LC-MS buffer:\nAdd 20 μL of buffer to each sample.\nSonicate in Vial Tweeter sonicator (5 pulses, Amplitude 100%, cycle 0.5).\nShake at 1400 rpm in a Thermomixer for 5 min at 25°C.\nDetermine peptide concentration using a NanoDrop (280 - 340 nm wavelengths). 30%–40% of initial protein amount is expected to be purified as peptides.\nDilute samples with LC-MS buffer to the same concentration, ideally 0.25 ug/ul.\nTransfer samples to the LC-MS vials.\nAnalyze by LC-MS using the gradient and instrument settings indicated in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section. Inject up to 0.5 μg of peptide per run.",
    "Note: The rest of the peptide can be stored at −20°C in case the analysis needs to be repeated."
  ],
  "subjectAreas": [
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Proteomics",
    "Mass Spectrometry",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}