{
  "id": 15302,
  "origin_website": "Jove",
  "title": "Chromatin Immunoprecipitation (ChIP) of Histone Modifications from Saccharomyces cerevisiae",
  "procedures": [
    "1. Pre-bind Antibody to Magnetic Beads\nMix the protein A/G magnetic beads well and transfer 20 µL of magnetic beads per one immunoprecipitation (IP) sample to a 1.5 mL tube.\n\tNOTE: When pipetting beads, use wide-bore, low-retention tips.\nPlace the tube with beads into a magnetic stand and allow beads to collect on side of the tube. Remove the supernatant.\nWash the beads 3 times with 1 mL of cold Tris-buffered saline (TBS) (50 mM Tris-HCl pH 7.5, 150 mM NaCl).\nAdd 200 µL of TBS to beads and appropriate amount of antibody. Rotate at 8 rpm overnight at 4 °C.\n\tNOTE: For many histone PTM antibodies, 1-3 µg of antibody per IP is sufficient. However, titration experiments are recommended to determine appropriate concentrations. Recommended concentrations for well-characterized, commercial histone PTM antibodies are often accurate and can be found in published reports or product literature.\nPlace the beads in a magnetic stand and remove the supernatant. Wash them with 1 mL of TBS.\nResuspend the beads in 20 µL of TBS per IP sample plus an additional 5 µL (in case of pipetting error) of TBS.\n\tNOTE: The beads can be stored short-term at 4 °C until use.\n2. Grow Yeast Cells\nInoculate 10 mL of YPD (10% yeast extract, 20% peptone and 20% dextrose) with a single colony of the appropriate strain and grow it at 30 °C overnight in a shaking incubator at 220 rpm.\nMeasure the optical density at 600 nm (OD600) of the yeast culture using a spectrophotometer. Dilute the culture to an OD600 = 0.2 in 100 mL YPD in a new flask.\nGrow the cells at 30 °C in a shaking incubator at 220 rpm until they reach mid-log phase (OD600 = 0.6-0.8).\n3. In Vivo Crosslinking of Proteins to DNA",
    "When cultures reach mid-log phase, add 2.7 mL of 37% formaldehyde directly to the medium, for a final concentration of 1% formaldehyde. Transfer the flask to a shaker at 25 °C (or room temperature) and shake it at 50 rpm for 15 min.\nAdd 5 mL of 2.5 M glycine to the medium and continue shaking at 50 rpm at room temperature for 5 min to quench the formaldehyde.\nTransfer the cells to centrifuge bottles and spin the cells at 5800 x g for 5 min at 4 °C. Decant supernatant.\nWash the cells by resuspending them in 45 mL of cold TBS and transfer the suspension into a 50 mL conical tube. Spin the tube at 2800 x g for 3 min at 4 °C. Remove the supernatant.\nWash the cells in 10 mL of cold chIP Lysis Buffer (50 mM Tris-HCl pH 7.5, 150 mM NaCl, 1 mM ethylenediaminetetraacetic acid (EDTA), 1% nonidet octyl phenoxypolyethoxylethanol (NP-40), stored at 4 °C).\nSpin the cells at 2800 x g for 3 min at 4 °C. Remove the supernatant.\n\t\tNOTE: Cells can be frozen with liquid nitrogen and stored at -80 °C until further processing.\n4. Make Yeast Lysates\nResuspend the cells in 1 mL of cold ChIP Lysis Buffer with 1 mM phenylmethylsulfonyl fluoride (PMSF) and 1:1,000 dilution of the yeast protease inhibitor cocktail. Transfer the suspension to a 2.0 mL screw cap tube containing 200 µL of glass beads.\nTransfer the cells to a bead beating apparatus for high speed agitation at 4 °C and bead beat 6 times for 30 s each. Keep the cells on ice for at least 1 min between each bead beating.",
    "Transfer the lysate to a 1.5 mL tube using gel loading tips. Centrifuge the lysate at 15,500 x g for 20 min at 4 °C.\nDiscard the supernatant and resuspend the pellet in 250 µL of MNase Digestion Buffer (10 mM Tris-HCl pH 7.5, 10 mM NaCl, 3 mM MgCl2, 21 mM CaCl2, 1% NP-40, stored at 4 °C) by gently pipetting up and down.\nAdd 2.5 µL of MNase to the reactions. Mix them gently by inverting 4-6 times and immediately incubate it in a 37 °C water bath for 20 min.\n\tNOTE: Digest conditions should be optimized when a new stock of MNase is used. See step 10 for the protocol.\nImmediately place the tubes on ice to stop the reaction and add 5 µL of 0.5 M EDTA for a final concentration of 10 mM EDTA. Mix them gently by inversion.\nCentrifuge the reaction at 15,500 x g for 15 min at 4 °C and transfer the supernatant to a new 1.5 mL tube.\n\tNOTE: Soluble (digested) chromatin will be in the supernatant. The pellet contains anything undigested and insoluble cell debris.\n5. Immunoprecipitate (IP) Modified Histones\nDetermine the protein concentration of each MNase-released chromatin fraction using a Bradford assay. Add 1 mL of Bradford reagent to each of 8 disposable cuvettes plus 1 additional cuvette for each protein sample to be tested.\nPrepare a stock solution of 2 mg/mL bovine serum albumin (BSA).\nAdd the appropriate volume to achieve the following concentrations of BSA in 1 mL of Bradford reagent: 0 μg/mL, 0.5 μg/mL, 1 μg/mL, 2 μg/mL, 4 μg/mL, 6 μg/mL, 8 μg/mL and 10 μg/mL. Add 2 μL of the MNase-released chromatin fraction to the additional cuvettes.",
    "Cover the top of each cuvette with a small piece of parafilm and invert the cuvettes 4-6 times to mix the solution well. Incubate the cuvettes at room temperature for 15 min.\nUsing a visible light spectrophotometer, measure the absorbance at 595 nm for the standard curve and experimental samples.\n\t\tNote: Use the cuvette without BSA (0 μg/mL) to blank the spectrophotometer prior to taking the first measurement.\nPlot a standard curve using the absorbance values for the different concentrations of BSA on software associated with the spectrophotometer or spreadsheet software. Based on the standard curve and the dilution factor used (1:500), use the absorbance values to calculate the protein concentration for each of the chromatin fraction samples.\nFor each IP, add 50 µg of total protein from the MNase-released chromatin fraction to ChIP Lysis Buffer to reach a final volume of 1 mL.\n\tNOTE: If setting up more than one IP per lysate, make a master mix of the lysate and ChIP Lysis Buffer and aliquot 1 mL to individual tubes for the IP.\nRemove 100 µL from the IP mix to process as the input sample. Freeze the input sample at -20 °C until step 7.1.\n\tNOTE: Any remaining chromatin sample can also be frozen at -20 °C and used for a subsequent IP if desired.\nAdd 20 µL of magnetic Protein A/G beads pre-bound with antibody to each IP sample. Rotate the sample at 8 rpm for 3 h (standard) or overnight (if preferred) at 4 °C.\n6. Wash IPs and Elute Histone-DNA Complexes\nPlace the tubes in a magnetic stand and let beads collect on the side of the tube. Remove the supernatant using a pipette. Wash the beads successively with 1 mL of each of the buffers below.",
    "Perform each wash by rotating at 8 rpm for 5 min at 4 °C, placing beads in a magnetic stand, removing supernatant, and adding next buffer: 2x - ChIP Lysis Buffer, 2x - High Salt Wash Buffer (50 mM Tris-HCl pH 7.5, 500 mM NaCl, 1 mM EDTA, 1% NP-40, stored at 4 °C), 1x - LiCl/detergent Wash Buffer (10 mM Tris-HCl pH 8.0, 250 mM LiCl, 1 mM EDTA, 1% NP-40, 1% sodium deoxycholate, stored at 4 °C), 1x - TE (10 mM Tris-HCl pH 8.0, 1 mM EDTA, stored at 4 °C), and 1x - TE .\nWith last TE wash, transfer beads to a new tube using 0.5 mL of TE to transfer most of the beads, then another 0.5 mL of TE to wash the tube and transfer remaining beads.\nAdd 250 µL of freshly made ChIP Elution Buffer (1% SDS, 1 mM NaHCO3). Vortex the solution briefly. Rotate the samples at 8 rpm for 15 min at room temperature.\nPlace tube in a magnetic stand and collect the beads. Carefully transfer the supernatant to a new tube and avoid the beads.\n\tNOTE: The eluate contains immunoprecipitated proteins and associated DNA.\nAdd another 250 µL of ChIP Elution Buffer to beads. Rotate the samples at 8 rpm for 15 min at room temperature.\nCarefully transfer the supernatant to the tube containing the first elution. If necessary, remove a smaller volume (240 µL) for all IPs to avoid disturbing the beads.\n7. Reverse Protein-DNA Crosslinks\nThaw the input samples and add 400 µL of ChIP Elution Buffer to each input.",
    "To both input and IP samples, add 20 µL of 5 M NaCl, 5 µL of 20 mg/mL glycogen, and 12.5 µL of 20 mg/mL Proteinase K. Mix well by inverting or flicking tubes. Incubate the samples in a 65 °C water bath overnight.\n8. Purify and Concentrate DNA\nAdd 10 µL of 10mg/mL RNase A to the input and IP samples. Incubate the samples in a 37 °C water bath for 30 min.\nAdd 600 µL of phenol:chlorofrom:isoamyl alcohol (25:24:1 PCI) to the aqueous solution and mix them well. Spin them at 15,500 x g for 5 min at room temperature.\nRemove the aqueous layer to a new tube. Add 600 µL of PCI and mix them well. Spin the tube at 15,500 x g for 5 min at room temperature. Transfer the aqueous layer to a new tube.\n\t\tCAUTION: Work in the fume hood and wear appropriate personal protective equipment when working with PCI. Dispose liquid and solid waste as instructed by institutional guidelines.\nAdd 0.1x volume of 3M sodium acetate and 1 mL of cold 100% ethanol to precipitate the DNA. Invert the tube 4-6 times to mix the solution well. Incubate at -20 °C overnight.\nSpin the tube at 15,500 x g for 20 min at 4 °C. Carefully remove the supernatant with a pipette.\nWash the pellet in 1 mL of cold 70% ethanol. Spin it at 15,500 x g for 10 min at 4 °C. Carefully remove the supernatant with a pipette.\nAir-dry the pellets in the hood for approximately 20 min (until completely dry). Resuspend IP samples in 50 µL of nuclease-free water and resuspend input samples in 100 µL of nuclease-free water. Store the DNA samples at -20 °C until performing qPCR.\n9. Quantitative PCR (qPCR) to Detect Enriched Genomic Regions",
    "Make a qPCR master mix for each set of primers. One reaction contains 5 µL of 2x qPCR mix, 0.25 µL of 20 µM forward primer, and 0.25 µL of 20 µM reverse primer.\n\tNOTE: Proper primer design and testing for qPCR experiments are described elsewhere14,15,16.\nMake DNA master mixes for each DNA sample. One reaction contains 0.5 µL of DNA and 4.0 µL of nuclease-free water.\nAdd 5.5 µL of the appropriate primer master mix and 4.5 µL of the appropriate DNA master mix to each well on a 384-well qPCR plate.\n\tNote: Start with adding 5.5 µL of the primer mix to each well. Spin the plate at 200 x g for 1 min at room temperature before adding 4.5 µL of the DNA mix.\nAdhere the seal to the plate and spin at 200 x g for 1 min at room temperature.\nPerform qPCR using a real-time qPCR system with the following conditions: 95 °C for 3 min; 40 cycles of 95 °C for 10 s, 55 °C for 30 s; melting curve 65 °C to 95 °C with 0.5 °C increments, 5 s.\nFor each primer pair, calculate the percent input of the IP sample relative to the 5% input sample used in the qPCR. Use the means of the technical PCR triplicates to perform the calculations.\n\tNOTE: If substantial variation is observed in the PCR triplicates, it is best to repeat the qPCR with attention to master mix composition, pipetting errors and cross-contamination between wells in the 384-well plate.\n\t\nAdjust the Cq values for the input to 100% by subtracting the number of cycles representing the dilution factor from the raw Cq values.\n\t\tNOTE: Five percent input represents a dilution factor of 20-fold, which equals 4.32 cycles (log2 20 = 4.32).",
    "Calculate the percent input as 2^(Cqinput - CqIP) multiplied by 100.\n10. Determine MNase Digest Conditions (Recommended Prior to First Full chIP Experiment)\nFollow steps 2.1 through 4.4 of the preceding protocol. Scale up the protocol to generate enough lysate for multiple samples of MNase digestion of the chromatin-containing pellet. At step 4.4, resuspend the pellets in 1.25 mL of MNase Digestion Buffer. Aliquot the samples to 5 tubes so that each contains 250 µL of the chromatin pellet resuspended in MNase Digestion Buffer.\nAdd 0, 1.5, 2.5 or 5 µL of MNase to each tube. Mix them gently by inverting 4-6 times and immediately incubate the tubes in a 37 °C water bath for 20 min.\nStop reactions by immediately placing tubes on ice and adding 5 µL of 0.5 M EDTA for a 10 mM final concentration. Mix the solution gently by inversion.\nCentrifuge the tubes at 15,500 x g for 15 min at 4 °C and transfer the supernatant to a new 1.5 mL tube.\nAdd SDS to 1% final concentration (25 µL of 10% stock solution) and NaHCO3 to 0.1 M final concentration (25 µL of 1M stock solution) to the samples in the 1.5 mL tubes.\nAdd 20 µL of 5M NaCl, 5 µL of glycogen, and 12.5 µL of 20mg/mL proteinase K to the samples in the 1.5mL tubes. Incubate them at 65 °C overnight.\nAdd 10 µL of 10 mg/mL RNaseA. Incubate at 37 °C for 30 min.\nAdd 300 µL of PCI to the aqueous solution and mix them well. Spin at 15,500 x g for 5 min at room temperature.",
    "Remove aqueous layer to a new tube. Add 300 µL of PCI and mix well. Spin at 15,500 x g for 5 min at room temperature. Transfer aqueous layer to a new tube.\nAdd 0.1x volume of 3 M sodium acetate (usually ~30 µL) and 1 mL of cold 100% ethanol to precipitate the DNA. Invert the tube 4-6 times to mix well. Incubate the tube at -80 °C for 1 h or -20 °C overnight.\nSpin the tube at 15,500 x g for 20 min at 4°C. Carefully remove supernatant with a pipette.\nWash the pellets in 1 mL of cold 70% ethanol. Spin at 15,500 x g for 10 min at 4 °C.\nLet the pellets air-dry in the hood approximately 20 min (or until completely dry). Resuspend the pellets in 30 µL of nuclease-free water.\nAdd the DNA loading dye and run 20 µL on a 2% agarose gel to visualize digested DNA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}