{
  "id": 18906,
  "origin_website": "Jove",
  "title": "Production of Apolipoprotein C-III Knockout Rabbits using Zinc Finger Nucleases",
  "procedures": [
    "All animal maintenance, care and use procedures were reviewed and approved by the University Committee on the Use and Care of Animals of the University of Michigan.\n1. ZFN Design and Selection\nSupply the genomic sequence information of the gene of interest (e.g. rabbit ApoCIII) to the manufacturer. Select ZFN set(s) for the experiments based on the ZFN scores.\n2. Rabbit Embryo Collection\nSuperovulate sexually matured (6-18 months) New Zealand White (NZW) female rabbits by subcutaneous (s.c.) injection of FSH twice/day with a dosage of 3 mg for the first two injections, 5 mg for the next two injections and 6 mg for the last two injections.\nAdminister a single intravenous (i.v.) injection of 200 IU hCG at 72 hr after the first FSH injection to induce ovulation. Mate the superovulated females with a male rabbit immediately after hCG injection.\nEuthanize the superovulated donor rabbits with sodium pentobarbital (150 mg/kg, i.v.) at 16-18 hr post insemination (p.s.i.).\nRecover the oviduct ampullae by carefully collecting the entire oviducts and ovaries structure.\nFlush each oviduct with 10 ml manipulation medium of HEPES buffered TCM 199 supplemented with 10% fetal bovine serum, by injecting the medium from the uterus end of the oviduct. Collect the flushed medium at the ovary-end opening of the oviduct to a Petri dish.\nObserve and identify recovered embryos in the flushed medium, wash the embryos three times in the manipulation medium, keep them in the manipulation medium at 38.5 °C in air, and observe them under a stereomicroscope for the occurrence of fertilization. Prepare for microinjection on pronuclear stage embryos 19-21 h p.s.i.\n3. Preparation of ZFN mRNA\nPurify the resulting mRNA before resuspension in RNAse-free 0.1X TE (1 mM Tris-Cl pH 8.0, 0.1 mM EDTA). Measure the concentration and store the mRNA at -80°C until use.",
    "Prepare the mRNAs encoding ZFN pair (4-10 ng/μl in 1 mMTris-Cl, 0.1 mM EDTA at pH 7.5), aliquot into 10 μl vials. Store them at -80 ºC until ready for use. Before microinjection, thaw the RNA vial(s), and keep it on ice.\n4. Embryo Microinjection\nPrepare the microinjection platform by placing a 5 μl drop of manipulation medium on a 1-well chamber slide that has the media chamber removed. Cover the medium drop with mineral oil and place on the heated microscope stage.\nPlace holding pipette (120 μm diameter) into the holder arm of the micromanipulator and position it into the drop of manipulation medium.\nFabricate injection micropipettes by heating and pulling borosilicate glass capillary tubes in a micropipette puller device. Load the mRNA to be injected in the injection pipette.\nTurn on the compressed air supply that is connected to a microinjector.\nPlace injection pipette into the injection holder, put it on the micromanipulator and position it into the drop of manipulation medium.\nSetup the microinjector, with the following suggested parameters: holdP=2 p.s.i., InjP=20 p.s.i., ClearP= 60 p.s.i., Injtime= 1 sec, which will result in an injection volume of 1-5 pl.\nOpen the tip of the injection pipette by gently tapping it against the holding pipette.\nTransfer embryos (30-50) to the micromanipulation drop on the platform. Use the holding pipette to capture an embryo and align the injection needle, embryo and the holding pipette along the x-axis.\nUnder 400X magnification, advance the injection pipette through the embryo. Be careful to avoid the nucleus. Once the plasma membrane is pierced, press foot pedal to inject. After injection, withdraw the needle, release the embryo. Repeat the process for all remaining embryos.",
    "Wash injected embryos three times in embryo culture medium, which consists of Earle's Balanced Salt Solution (EBSS) supplemented with nonessential amino acids (NEAA), essential amino acids (EAA), 1 mM L-glutamine, 0.4 mM sodium pyruvate, and 10% FBS.\nIncubate embryos at 38.5 °C in 5% CO2 in air for 1-2 hr before they are surgically transferred into the oviducts of a synchronized recipient female NZW rabbit (see step 5.1). Alternatively, culture the embryos until they reach blastocyst stage before they are used for in vitro validation or assays.\n5. Embryo Transfer\nSelect a female NZW rabbit 5-12 months old, in good health, weighing approx. 4.0 to 5.0 kg as recipient animal. Administer Gonadotropin Releasing Hormone (GnRH) injection intramuscularly (i.m., 50 mcg/ml, 0.3 ml/animal) to the recipient at the same time point with that of hCG injection to the donor animal(s) (see step 2.2).\nAfter completion of microinjection, prepare the recipient rabbit for embryo transfer (normally 16-24 hr after GnRH injection). Anesthetize the rabbit with 10-40 mg/kg ketamine (i.m.), and/or vaporized isoflurane (2-4%) through inhalation. Protect the rabbit’s eyes from excessive drying by the application of a sterile ophthalmic ointment. Observe the animal until it is fully unconscious, i.e. does not respond to pedal reflexes; squeezing the foot pad is used to check for lack of pedal reflex which is an indication of adequate anesthesia.\nShave the rabbit's abdomen, wash with antiseptic scrub, followed by antiseptic solution, and wipe the shaved area with sterile gauze sponges.\nPerform surgery under sterile conditions, record vital signs of the recipient rabbit approximately every 15 min throughout the surgery.\nTransfer 10-25 embryos to one recipient animal, depending on the available number of embryos.",
    "At the end of the surgical procedures, close the muscle layer with coated absorbable suture. Suture the skin with either a subcuticular suture using absorbable suture or with simple interrupted skin sutures using nonabsorable suture (e.g. monofilament nylon or similar).\nKeep the animal warm and monitor it until its sternal recumbency is attained.\nMonitor the animal daily. Follow veterinarian’s instructions to care for the animal. Administer meloxicam (s.c. 1.0 mg/kg) to relieve pain and/or reduce fever daily post operation if determined necessary by the veterinarian.\nRemove nonabsorable skin sutures at about 10-14 days post operation.\n6. Detection of ZFN Induced Gene Disruption\nFor in vitro validation, perform genotyping on the in vitro cultured embryos. Lyse individual embryos that developed to morula/blastocyst stages in 5 μl NP40 solution (1% NP40 plus 1 ug/ml Proteinase K in Taq Buffer) for 0.5-1 hr at 55 °C, and 10 min at 95 °C.\nFor genotyping of the offspring, collect ear skin samples from newborn kits, extract genomic DNA, and use them as templates for PCR sequencing. Apply Kwik-Stop to the sampling area after collection to stop bleeding and reduce discomfort.\nUse the lysis from step 6.2 or 6.3 as template for PCR using LA-Taq and PCR primer pair, which are located upstream (5’- TGAGGCCGGGAAGGGAGCAGTCG-3’) and downstream (5’-GCCAGGCCCACCCACGGAACAGC-3’) of the ZFN target site.\nPurify PCR products and sequence them with sequencing primer (5’-TCTGCACGCTTGGGGCTGGAG-3’).\nIdentify mutant samples by looking for double curve in the sequence diagram around the targeting site. Label the ones with double curves as \"positive\".\nClone the \"positive\" PCR products into TA cloning vector, pick up 10-20 clones, sequence the inserts, and confirm the mutations around the targeting site."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}