{
  "id": 7011,
  "origin_website": "Bio",
  "title": "Estimation of the Minimum Number of Replication Origins Per Chromosome in any Organism",
  "procedures": [
    "Notes: If you already have the values for chromosomes size, S-phase duration, and replication rate for the organism in question, the following steps (A-C) are not necessary. The description of the steps B (estimation of the S-phase) and C (estimation of the replication rate) uses as example the organism T. brucei. However, for other cell types these parameters can be found in specific studies when available [e.g., S. cerevisiae (Brewer et al., 1984; Sekedat et al., 2010; Ivanova et al., 2020); mammalian cells–MEFs cell (Ishida et al., 2001; Stanojcic et al., 2016; Pereira et al., 2017)].Obtaining values for chromosome sizeFirst option (for any organism):Access the website https://www.ncbi.nlm.nih.gov/[href=https://www.ncbi.nlm.nih.gov/].In ‘popular resources’ option (right side), click on genome.Type the name of the organism of interest.Obtain the values of chromosome size from the table.Second option (only for trypanosomatids organisms):Access the website https://tritrypdb.org/tritrypdb/https://tritrypdb.org/tritrypdb/[href=https://tritrypdb.org/tritrypdb/].In ‘search for other data types’ option (middle column), click on ‘genomic sequences’, then 'organism’.Choose the organism of interest (e.g., Trypanosoma brucei).Click on ‘Get Answer’.Obtain the values of chromosome size (length) from the table.Estimation of the S-phase duration using CeCyD softwareCeCyD is a user-friendly website able to calculate the values of cytokinesis (C), mitosis (M), G2, S, and G1 phases of the cell cycle, for any organism. For this, the user must enter the following parameters on the website: doubling time, percentage of cells in cytokinesis, percentage of cells in mitosis, minimum time to detect two EdU-labeled nuclei in the same cell, percentage of cells EdU-labeled after EdU pulse, and the duration of this EdU pulse. The following steps of this section describe how these parameters are obtained in T. brucei (used as an example). However, for other cell types, the S-phase duration can be obtained directly from specific studies when available [e.g., S. cerevisiae (Brewer et al., 1984; Ivanova et al.",
    ", 2020); mammalian cells – MEFs cells (Ishida et al., 2001; Pereira et al., 2017)].Prepare a set of T. brucei culture (here, it was used the procyclic forms) to estimate de doubling time. Initiates a growth curve with 1 x 106 cells/ml at 28 °C in 10 ml of culture.Note: The cell density for the beginning of the curve varies according to the cell type. Harvest cell samples and count daily, until it reached the stationary phase.Insert the values counted on https://doubling-time.com[href=https://doubling-time.com] and take note of the doubling time value.Prepare a new set of T. brucei culture (procyclic forms) to estimate the percentage of cells in mitosis and cytokinesis. Incubate cells (28 °C) until they reach exponential phase (~1 x 107 cells/ml).Note: The cell density for the exponential phase varies according to the cell type used. Harvest 1 ml of the culture by centrifugation at 800 x g for 5 min at 4 °C and wash twice using 1 ml of 1x PBS.Remove the 1x PBS from cells carefully to preserve the pellet.Suspend the pellet in 1 ml of Fixation Buffer (FB) and transfer to a 1.5 ml microcentrifuge tube.Incubate at 4 °C for 7 min and wash three times using 1 ml of cold 1x PBS (centrifuging at 800 x g for 5 min in each wash). For the last wash, suspend the pellet carefully into 500 μl of 1x PBS. If the pellet is too small (i.e., almost invisible to the naked eye), decrease the volume to 100 μl of 1x PBS.Prepare the slides to receive the cells by spreading 2.5 μl of Poly-L-lysine solution (PLS) onto slide surface until PLS dry out. Prepare three slides for each sample from Step B8.Note: Use a coverslip to spread PLS onto slide (see da Silva et al.",
    ", 2018 for more detail). Spread the suspended-pellet (from Step B8) carefully in each of the three slides. Use 25-30 μl and save the remaining suspended-pellet volume in case you need to remake some slides.Notes:Use the same surface where PLS was previous spread.Each slide is one technical replicate. Wait for the cells to precipitate and settle on slide for 10-15 min at room temperature. Ensure that the cells do not dry out.Permeabilize the cells by adding 50 μl of permeabilization solution (PS) for 10 min at room temperature.Wash the slide containing cells three times using 1x PBS.Note: Use a P1000 micropipette to spread (by sneezing) 1x PBS (1 ml) onto slide three times. Ensure all the liquid was removed from the slide surface containing cells and add 4 μl of Vectashield mounting medium containing DAPI.Note: This reagent is used as anti-fade mounting solution and to stain organelles containing DNA. Add a glass coverslip and seal using colorless nail varnish. Wait the varnish dry out for 5 min. The slide can be analyzed under a fluorescence microscope immediately or stored at 4 °C up to one month.Count at least 100 cells and identify cells in mitosis (with the nucleus in division) and cytokinesis (with two separated nuclei in the same cell). Figure 1 shows representative images of T. brucei cells in mitosis (A) and cytokinesis (B).Note: Capture images using the differential interference contrast (DIC) (if available) or phase contrast. Merge with DAPI to assist in the identification of cells in mitosis/cytokinesis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201017/20201017092159_8630.jpgFigure 1. Representative images showing T. brucei cells in mitosis (left) and cytokinesis (right). It is worth to mentioning that in mitosis, the nucleus is dividing, while in cytokinesis the nucleus has already been divided.",
    "DIC was used to show the morphology of the cells, while DAPI was used to stain organelles containing DNA [nucleus (N) and kinetoplast (K)]. Scale bars = 10 μm.Take note the percentage of cells in mitosis and citokynesis.Prepare a new set of T. brucei culture to estimate the minimum time to detect two EdU-labeled nuclei in the same cell. Incubate cells (28 °C) until they reach exponential phase (~1 x 107 cells/ml).Note: The cell density for the exponential phase varies according to the cell type used. Add 100 µM of 5-ethynyl-2’-deoxyuridine solution (EdU-S) in the culture containing T. brucei cells and wait for 30 min.Harvest 500 µl of the culture by centrifugation (800 x g for 3 min at 4 °C) and wash twice using 1 ml of 1x PBS.Follow the Steps B6-B7 exactly as previously described.Incubate at 4 °C.Continue collecting samples every 15 min until reach 3 h of EdU incorporation (11 samples). Follow the Steps B20-B22 for each sample.Notes:Each sample should be incubated in FB for, at least, 7 min on ice. At the end of this step, there should be 12 samples collected every 15 min. Take the 12 samples and wash three times each using 1 ml of cold 1x PBS (centrifuging at 800 x g for 5 min in each wash). For the last wash, suspend the pellet of each sample carefully into 500 μl of 1x PBS. If the pellet is too small (i.e., almost invisible to the naked eye), decrease the volume to 100 μl of 1x PBS.Prepare 12 slides by spreading 2.5 μl of PLS onto slide surface until it dry out.Note: Use a coverslip to spread PLS onto slide. For more details, see da Silva et al. (2018). Spread the suspended-pellets (from Step B23) carefully in each slide.",
    "Use 25-30 μl and save the remaining volume in case you need to remake some slides.Note: Use the same surface where PLS was previous spread. Wait for the cells to decant and settle on slide for 10-15 min at room temperature. Ensure that the cells do not dry out.Permeabilize each sample by adding 50 μl of PS for 10 min at room temperature.Wash each slide containing cells three times using 1x PBS.Note: Use a P1000 micropipette to spread (by sneezing) 1x PBS (1 ml) onto slide three times. Follow the protocol of Click-iT EdU Imaging Kit, established by the manufacturer.Note: The protocol can be accessed here, on the topic Documents/Manuals and protocols:https://www.thermofisher.com/order/catalog/product/C10337#/C10337[href=https://www.thermofisher.com/order/catalog/product/C10337#/C10337]. At the end of the protocol established by the manufacturer, ensure all the liquid was removed from the slide surface containing cells and add 4 μl of Vectashield mounting medium containing DAPI.Note: This solution is used as the anti-fade mounting solution and to stain organelles containing DNA. Add a glass coverslip and seal using colorless nail varnish. Wait the varnish dry out for 5 min. The slide can be analyzed under a fluorescence microscope immediately or stored at 4 °C up to one month.Search (in each sample) for a parasite containing two EdU-labeled nuclei in the same cell (i.e., cell in citokynesis). Start from the shortest time sample, i.e., 15 min after 30 min of EdU incorporation, and proceed with the other samples (i.e., 30 min after 30 min of EdU incorporation, 45 min after 30 min of EdU incorporation, etc.).Note: For more details, see the description and images on Figure 1D from da Silva et al. (2019). Once observed, take note the time required for this. This is the minimum time to detect two EdU-labeled nuclei in the same cell.",
    "Note: The time obtained must be the sum of the initial time for EdU incorporation (30 min) plus the shortest time in which the two EdU-labeled nuclei were observed. In our case, this time was 2 h. For details, see da Silva et al. (2019). Prepare a new set of T. brucei culture to estimate the percentage of EdU-labeled cells during a EdU pulse. Incubate cells (28 °C) until they reach exponential phase (~1 x 107 cells/ml). Note: The cell density for the exponential phase varies according to the cell type used. Add 100 µM of EdU-S in the culture containing T. brucei cells and wait for 1 h.Note: This will be the duration of the EdU pulse, i.e., 1 h. Harvest 500 µl of the culture by centrifugation (800 x g for 3 min at 4 °C) and wash twice using 1 ml of 1x PBS.Follow the Steps B6-B13 exactly as previously described.Follow the protocol of Click-iT EdU Imaging Kit, established by the manufacturer.Note: The protocol can be accessed here, on the topic Documents/Manuals and protocols:https://www.thermofisher.com/order/catalog/product/C10337#/C10337[href=https://www.thermofisher.com/order/catalog/product/C10337#/C10337]. At the end of the protocol established by the manufacturer, ensure all the liquid was removed from the slide surface containing cells and add 4 μl of Vectashield mounting medium containing DAPI.Add a glass coverslip and seal using colorless nail varnish. Wait the varnish dry out for 5 min. The slide can be analyzed under a fluorescence microscope immediately or stored at 4 °C up to one month.Count at least 100 cells (total) and identify cells EdU-labeled. Figure 2 shows representative images of T. brucei EdU-positive cells.Measure the percentage of cells EdU-positive.Once you have all the required parameters, access the CeCyD website: http://cecyd.vital.butantan.gov.br/[href=http://cecyd.vital.butantan.gov.br/], and input the values to obtain the duration of all the cell cycle phases. Take note of the S-phase duration.",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201017/20201017091412_3518.jpgFigure 2. Representative image showing EdU-positive T. brucei cells. The representative image is organized in four squares: DIC (indicating the morphology of the cells), DAPI (staining organelles containing DNA), EdU (showing cells that uptaked EdU during the S-phase), and Merged (overlay between DAPI and EdU). The white arrows indicate EdU-positive cells. Scale bar = 10 μm.Estimation of the replication rate using DNA combingThe following steps of this section describe how the replication rate is obtained in T. brucei (used as an example). However, for other cell types, the replication rate can be obtained directly from specific studies when available [e.g., S. cerevisiae (Sekedat et al., 2010); mammalian cells–MEFs cells (Stanojcic et al., 2016)].Prepare a set of T. brucei culture (here, it was used the procyclic forms) to perform the DNA combing assay. Initiates the culture with 2 x 106 cells/ml in 10 ml of culture. Incubate at 28 °C for 24 h. Count the cell density. The culture must be in the concentration of ~1-2 x 107 cells/ml, totalizing ~1-2 x 108 cells.Note: The cell density for the beginning of the DNA combing assay varies according to the cell type. Add 300 µM of 5′-iodo-2′-deoxyuridine solution (IdU-S) and wait for 30 min.Add 500 µM of 5′-chloro-2′-deoxyuridine solution (CldU-S) and wait for 30 min.Note: Do not wash between the halogenated thymidine analogs (IdU and CldU) incorporation. Harvest the whole culture by centrifugation (1,600 x g for 3 min at 4 °C) and wash twice using 1 ml of 1x PBS. In the second wash, transfer the suspended-pellet to a 1.5 ml microcentrifuge tube.Wash using 500 µl of DNA combing washing buffer (DC-WB) and suspend the pellet in 50 µl of DC-WB. Keep at room temperature.Prepare 2% agarose low-melting: Weigh 10 mg of low melting agarose in a 1.",
    "5 ml centrifuge tube. Using another 1.5 ml centrifuge tube, heat 500 µl of DC-WB (90 °C for 5 min). Resuspend the 10 mg of low melting agarose using the heated 500 µl of DC-WB. Mix well to solubilize the agarose. Keep the solution heated at 65 °C.Prepare the reusable plug modes to receive 100 µl of the agarose + cells mixture.Gently mix 50 µl of the agarose solution (from Step C6) in the 50 µl of resuspended pellet (from Step C5), totalizing 100 µl. Add immediately to the previously prepared reusable plug model (from Step C7). Wait to cool and incubate at 4 °C for 1 h.Carefully unmold the plug in a 1.5 ml epp containing 500 µl of DNA combing lysis buffer (DC-LB).Incubate for 24 h at 50 °C.Replace the DC-LB (gently) by a new one (500 µl) and incubate for another 24 h at 50 °C.Wash twice using 1 ml of T10E1 buffer for 1 h (each wash) at room temperature.Add 1 ml of T10E1 buffer (gently) and incubate overnight at 4 °C.Discard the T10E1 buffer and incubate the plug in 800 µl of 0.5 M MES, pH 5.5 at 68 °C for 20 min. Next, remove the tube containing the plug from 68 °C and incubate it immediately at 42 °C for 10 min.Add 2 μl of β-agarase I (1,000 units/ml) and incubate overnight at 42 °C.Note: In this step, add the β-agarase I in 200 µl of 0.5 M MES. Mix well and add it carefully in the plug dissolved with 800 µl 0.5 M MES. Prepare the molecular combing system by adding 1 ml of 0.5 M MES into the reservoir of the FiberComb apparatus.",
    "Next, carefully pour the tube containing the plug dissolved (from Step C15) into the reservoir containing 1 ml of 0.5 M MES.Note: At this stage, it is normal to form a viscosity in the liquid coming from the tube. Immediately, place the Combicoverslip on the FiberComb apparatus and stretch the DNA according to equipment's instructions.Note: The solution containing the plug dissolved (i.e., incorporated DNA) inside the reservoir can be stored up to 1 week at 4 °C protected from light. After stretch the DNA onto Combicoverslip, let it dry for a few seconds and incubate it at 65 °C for 2-4 h.Place the Combicoverslip containing the DNA stretched in an appropriate container (e.g., use a 6-well flat-bottom plate). Carefully add 3 ml of DNA combing denaturation buffer (DC-DB) and incubate for 20 min.Wash three times using 1 ml of 1x PBS. Dehydrate the coverslip containing the DNA stretched successively using 2 ml of: 70% ethanol, then 90% ethanol, and 100% ethanol (1 min each). Remove the alcohol and let the Combicoverslip dry completely at room temperature.Block using 3 ml of DNA combing blocking solution (DC-BS) for 20 min at 37 °C.Prepare the DNA combing primary antibodies solution (DC-PAS).Note: The DC-PAS must be freshly prepared, as it is for immediate use. Add 20 µl of DC-PAS on the top of the Combicoverslip containing the DNA stretched (from Step C21). Cover with plastic coverslip. Incubate at 37 °C for 1 h protected from light.Wash twice using 1x PBS for 3 min each.Prepare the DNA combing secondary antibodies solution (DC-SAS).Note: The DC-SAS must be freshly prepared, as it is for immediate use. Add 20 µl of DC-SAS on the top of the Combicoverslip containing the DNA stretched (from Step C24). Cover with a plastic coverslip.",
    "Incubate at 37 °C for 1 h protected from light.Wash twice using 1x PBS for 3 min each.Prepare the DNA combing anti-ssDNA solution (DC-anti-ssDNA).Note: The DC-anti-ssDNA must be freshly prepared, as it is for immediate use. Add 20 µl of DC-anti-ssDNA on the top of the coverslip containing the DNA stretched (from Step C27). Cover with plastic coverslip. Incubate at 37 °C for 2 h protected from light.Wash twice using 1x PBS for 3 min each.Prepare the DNA combing Alexafluor 350 (DC-alexa350).Note: The DC-alexa350 must be freshly prepared, as it is for immediate use. Add 20 µl of DC-alexa350 on the top of the coverslip containing the DNA stretched (from Step C30). Cover with plastic coverslip. Incubate at 37 °C for 1 h protected from light.Wash twice using 1x PBS for 3 min each.Ensure all the liquid was removed from the coverslip containing the DNA stretched. Mount the coverslip on a slide adding 20 µl of ProLong Gold antifade. Seal using colorless nail varnish and let dry for at least 1 h at room temperature.Acquire images of DNA fibers using a fluorescence microscope. Merge acquired images using the Cell F Olympus or ImageJ software.Notes: The observation of longer DNA fibers requires the capture of adjacent fields.The stretching factor along each molecule is contant (1 µm = 2 kb). Fibers < 100 kb must be excluded from the analysis to improve the accuracy of the assay. Only green tracks (containing CldU, the second analog added) continuing from red tracks (containing IdU, the first analog added) or blue tracks (non-incorporated DNA) must be used to determine replication rate. The length of the green track must be measured from intact green fibers: blue-green-red (BGR), red-green-blue (RGB), and blue-green-red-green-blue (BGRGB) events. Estimate the average replication rate using the formula:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201017/20201017091620_2675.",
    "pngwhere v is the average replication rate (in kb.min-1), n is the number of DNA fibers analyzed, and t is the time of CldU pulse (in min).Note: At least three independent assays must be performed to improve the accuracy of the assay"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}