{
  "id": 19853,
  "origin_website": "Wiley",
  "title": "Rfoot-seq: Transcriptomic RNase Footprinting for Mapping Stable RNA-Protein Complexes and Rapid Ribosome Profiling",
  "procedures": [
    "This protocol describes how to prepare a cell lysate for Rfoot-seq using HEK293T cells and can be adapted to other adherent cultured mammalian cells. Most conditions are identical for low-input and ultra-low-input samples; exceptions are described in the appropriate steps. We recommend plating cells in an appropriate multiwell plate and culturing them in an incubator overnight to allow attachment to the plate. Typical cell confluency before harvesting is 70%-80%.\nMaterials\nHEK293T cells (ATCC, cat. no. CRL-3216)\nComplete DMEM: DMEM (Gibco, cat. no. 11965092) with 10% FBS (Gibco, cat. no. 26140079)\nDPBS, no calcium, no magnesium (Gibco, cat. no. 14190094)\nCell lysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-rec-0002])\n48- or 96-well plate (Corning, cat. nos. 3548 and 3595)\nCO2 incubator (NuAire or equivalent)\n1.5-ml low-retention microcentrifuge tubes (Thermo Scientific, cat. no. 3451)\n1. The day before cell harvest, seed HEK293T cells in complete DMEM in a 48-well plate at 4–5 × 104 cells per well. Grow overnight in a CO2 incubator to allow cells to adhere.\nAs an example of an ultra-low-input sample, to generate a library with 1000-10,000 HEK293T cells, seed cells in a 96-well plate at 1000-10,000 cells per well.\nAlternative plates or culture vessels with larger or smaller surface area can be used, so long as cells are ∼80% to 90% confluent at harvesting.\n2. Remove and discard medium from the wells. Quickly rinse cells twice with 200 µl cold DPBS and aspirate DPBS thoroughly.\nRNA translation is sensitive to stress. After removing cells from the incubator, try to complete rinses and cell lysis within 10 min. Leaving cells longer at room temperature or in cold DPBS will induce cellular responses to the temperature changes.\n3. Add 80-90 µl cold cell lysis buffer to each well place the plate on ice.",
    "For the ultra-low-input sample (e.g., 1000 cells/well in a 96-well plate), use 40-60 µl lysis buffer per well.\n4. Transfer the entire cell lysate to a pre-cooled 1.5-ml microcentrifuge tube, pipette up and down 10 times, and place on ice for 10 min.\n5. Proceed directly to RNase digestion (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004] or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0005]).",
    "This protocol describes how to prepare a cell lysate for Rfoot-seq using suspension cells. We use cultured K562 cells and isolated primary human PBMCs as examples, but the procedure can be adapted to other suspension cells or isolated primary cells. Most conditions are identical for low-input and ultra-low-input samples; exceptions are described in the appropriate steps.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0001])\nK562 cells (ATCC, cat. no. CCL-243) or primary human PBMCs\nComplete IMDM: IMDM (Gibco, cat. no. 12440061) with 10% FBS\nComplete RPMI: RPMI 1640 (Gibco, cat. no. A1049101) with 10% FBS\n0.4% trypan blue (Gibco, cat. no. 15250061)\nCulture flask (Greiner, cat. no. 658195)\nAutomated cell counter (e.g., Countess 3, Invitrogen, cat. no. AMQAX2000)\nCell counting chamber slides (e.g., Countess, Invitrogen, cat. no. C10312)\n1. For K562 cells, grow a fresh culture in complete IMDM to a density of ∼500,000 cells/ml in a culture flask. For PBMCs, isolate according to manufacturer's instructions and suspend in complete RPMI.\nWe recommend suspending isolated primary immune cells in the appropriate medium and culturing in an incubator for at least 30 min to recover their translation activity if in vitro culture is applicable.\n2. Aspirate 10 µl cell suspension to a 1.5-ml microcentrifuge tube and mix well with 10 µl 0.4% trypan blue.\n3. Transfer 10 µl to a chamber slide and measure the cell density using a cell counter.\nRNA translation is sensitive to stress. During counting, the cell suspension should be returned to the incubator. After cells are removed from the incubator, the rinsing and lysis steps should be completed within 10 min. Leaving cells longer at room temperature or in cold DPBS will induce cellular responses to the temperature changes.",
    "4. Transfer medium containing 50,000 K562 cells or 100,000 PBMCs to a 1.5-ml microcentrifuge tube and centrifuge 3 min at 100 × g.\n5. Quickly rinse cells by resuspending with 200 µl cold DPBS, centrifuging 3 min at 100 × g, and aspirating off the DPBS.\n6. Repeat rinse and remove all residual DPBS with a pipette.\n7. Add 80-90 µl cold lysis buffer to the pellet, pipette up and down 10 times, and incubate on ice for 10 min.\nThe amount of lysis buffer depends on the number of cells. For ultra-low-input samples (e.g., 1000 K562 cells) and primary cells with low translation activity (e.g., 100,000 PBMCs), use 40-60 µl lysis buffer.\n8. Proceed directly to RNase digestion (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004] or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0005]).",
    "This protocol describes how to prepare a cell lysate for Rfoot-seq using snap-frozen tissues. We use snap-frozen spleen tissue from a mouse as an example, but the procedure can be adapted to other snap-frozen tissues.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0001])\nSnap-frozen spleen tissue from a mouse\nLiquid nitrogen\nScalpel\nMortar and pestle (BioSpec, cat. no. 206; Bel-Art, cat. no. H37260-0100; or equivalent)\n26-G needle (BD, cat. no. 305111)\n1-ml syringe (BD, cat. no. 309659)\n1. Weigh 1-2 mg snap-frozen spleen tissue using an analytical balance. Place in a pre-cooled mortar and powder the tissue using a pestle while continuously adding liquid nitrogen.\nCutting 1-2 mg frozen tissue is an arduous task. Alternatively, you can cut a small, unweighed amount of frozen tissue, powder it, and then weigh out 1-2 mg tissue powder.\nIf more than 2 mg tissue is used here, the amount of input material should be adjusted before RNase digestion. For more information, see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004], step 2.\n2. Transfer powdered tissue to a pre-cooled 1.5-ml microcentrifuge tube.\n3. Add 100 µl cold lysis buffer, triturate through a 26-G needle ten times, and incubate on ice for 10 min.\n4. Centrifuge lysate 5 min at 1000 × g, 4°C.\n5. Transfer supernatant (∼80-90 µl lysate) to a new pre-cooled 1.5-ml microcentrifuge tube.\n6. Place on ice and proceed directly to RNase digestion (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004] or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0005]).",
    "RNase treatment is a key step of Rfoot-seq as library quality is highly dependent on RNase digestion. This protocol describes how to determine the conditions for RNase digestion and recover RNase footprints after digestion for low-input samples. This protocol is used when 200 ng to 1.2 µg total RNA can be obtained from your sample (e.g., 50,000 HEK293T cells or K562 cells or 1 mg tissue).\nMaterials\nQubit RNA HS Assay (Invitrogen, cat. no. Q32852)\nQubit 4 fluorometer and assay tubes (Invitrogen, cat. no. Q33238 and Q32856)\nPolysome buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-rec-0003]; optional)\n10 U/μl RNase I (Lucigen, LGC Biosearch Technologies, cat. no. N6901K)\nTRIzol Reagent (Invitrogen, cat. no. 15596018)\nChloroform (molecular biology grade, Sigma-Aldrich, cat. no. C2432)\n15 mg/ml GlycoBlue (Invitrogen, cat. no. AM9515)\n3 M sodium acetate (NaOAc), pH 5.5 (RNase-free, Invitrogen, cat. no. AM9740)\nIsopropanol (molecular biology grade, Fisher Scientific, cat. no. BP2618)\n80% (v/v) ethanol (Fisher Scientific, cat. no. BP2818) in nuclease-free water, freshly prepared\nSize markers for analysis of RNA footprints (optional):\n               \n26- and 34-nt RNAs: 5′-ACGAACAUCUUGAUAUGGUCCACUGC-3′ and 5′-AGUAAUAACACCAGAAACGUGACCAGCAAUAAGC-3′ (synthesized by Integrated DNA Technologies)\nLow-range ssRNA ladder (New England Biolabs, cat. no. N0364S)\nParafilm (Bemis, cat. no. PM996)\nTube nutator (Fisher Scientific, cat. no. NC0597936)\n1.5-ml low-retention microcentrifuge tube (Thermo Scientific, cat. no. 3451)\nPerform digestion\n1. Measure the RNA concentration in the cell lysate using the Qubit RNA high-sensitivity assay kit according to the manufacturer's protocol.\n2. Calculate the total amount of RNA in the lysate using the equation:\n         \nTotal RNA (µg) = RNA concentration × volume cell lysate (µl)",
    "We generally obtain 800 ng to 1.2 µg total RNA from 50,000 cultured mammalian cells or 1 mg of tissue. The full protocol was developed for samples with no more than 1.2 µg total RNA and the conditions for library preparation were optimized based on this. Using more starting material is discouraged, as it may compromise library quality. If the lysate has more than 1.2 µg total RNA, discard excess lysate and re-adjust the reaction volume with lysis buffer or DTT- and CHX-supplemented polysome buffer.\nWe consider both the amount and concentration of RNase 1 in the reaction, and changing the volume of lysis buffer will affect both parameters for a given sample. As described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0001] and Alternate Protocols 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0002] and 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0003], lysing low-input samples in 80-90 µl lysis buffer is an optimized condition. Using less than 80 µl buffer for low-input samples is discouraged, especially for samples with more than 1 µg total RNA.\n3. Calculate the required amount of RNase using the equation:\n         \nRNase 1 (U) = 50 U/µg × total RNA amount (µg)\n4. Calculate the resulting concentration of RNase 1 in the reaction using the equation:\n         \nRNase 1 (U/µl) = RNase 1 (U) / volume cell lysate (µl)\nIf it is between 0.5 and 1 U/µl, proceed to the next step. If it is <0.5 U/µl, add RNase 1 to reach a minimum of 0.5 U/µl (see Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0001] for examples).\nTable 1.\n                Examples for Determining RNase 1 Conditions for Digestion\ntable:\n﻿Lysate volume (µl),RNA amount (µg),Calculated amount of RNase (U),Reaction volume (µl)a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl1-note-0001_66],Calculated [RNase] (U/µl),Is [RNase] within 0.5-1 U/µl?,Adjust RNasea[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl1-note-0001_67],Calculated [RNase] (U/µl).1,Is [RNase] within 0.5-1 U/µl?.1\n80,1.2,60,86,0.698,Yes,—,—,—\n90,1.2,60,96,0.625,Yes,—,—,—\n80,1.0,50,85,0.588,Yes,—,—,—\n90,1.0,50,95,0.526,Yes,—,—,—\n80,0.8,40,84,0.476,No,+5 U,0.533,Yes\n90,0.8,40,94,0.426,No,+10 U,0.526,Yes",
    "a Concentrations are calculated based on RNase I from Lucigen, which is provided at 10 U/μl. If another source provides the enzyme at a different concentration, the volume change must be taken into account.\n5. Add the calculated volume of RNase 1 to the cell lysate, mix gently by pipetting, and seal the tube with Parafilm. Digest for 1.5 hr at room temperature (25°C) with gentle agitation (e.g., on a tube nutator).\n6. Add 400 µl TRIzol to stop the digestion, vortex to mix thoroughly, and place the tube on ice.\nAfter adding TRIzol, samples can be stored at −80°C for several days. If more samples need to be collected at different times, this is the first recommended pausing point.\nCAUTION: Be careful when handling TRIzol. Use in a chemical fume hood.\nExtract and precipitate RNA\n7. Add 100 µl chloroform, vortex thoroughly, and centrifuge 15 min at 12,000 × g, 4°C.\nCAUTION: Be careful when handling chloroform. Use in a chemical fume hood.\n8. Transfer the upper (aqueous) layer to a new microcentrifuge tube.\n9. Precipitate RNA fragments by adding 20 µg GlycoBlue, 0.1 vol. of 3 M NaOAc, pH 5.5, and 1.5 vol. isopropanol.\n10. Incubate overnight (at least 6 hr) at −20°C.\n11. Pellet RNA by centrifuging 30 min at 15,000 × g, 4°C.\n12. Remove and discard the supernatant, being careful not to disturb the RNA pellet.\n13. Add 500 µl of 80% ethanol to the pellet and incubate on ice for 1 min.\n14. Centrifuge 5 min at 15,000 × g, 4°C.\n15. Remove all liquid from the tube and allow the RNA pellet to air-dry for 8 min.\n16. Place the RNA pellet on ice and proceed directly to library preparation (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0006]).",
    "Optional step for quality check: Prepare one more replicate to check RNase footprint quality. Suspend RNase footprints in RNase-free water and separate on a 15% polyacrylamide TBE-urea gel. With optimized RNase digestion, you will find discrete RNA bands between 26 and 34 nt, and no RNA fragments longer than 500 nt. Representative results generated from HEK293T cell lysates are shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0002].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/c1c68652-d4a8-49b5-8308-4f2db01cc0f4/cpz1761-fig-0002-m.jpg</p>\nFigure 2\nQuality check of RNase footprints by agarose gel electrophoresis. After RNase 1 digestion, extracted RNA fragments were separated on a 15% agarose gel, which was stained with SYBR Gold and visualized on a blue-light transilluminator. An RNA ladder and markers are shown in lanes 1 and 2. The representative size distributions of RNase footprints are shown under conditions of insufficient RNase digestion (samples 1-3) and sufficient RNase digestion (sample 4).",
    "The protocol describes how to determine the condition of RNase digestion and recover footprints after the digestion for ultra-low-input samples. We use a different equation to calculate the RNase amount and extend the RNase treatment time. If 20 ng to 200 ng total RNA can be obtained from your sample (e.g., 1000 cultured K562 cells or 100,000 PBMCs), follow the procedures described in this section.\nFor materials, see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004].\n1. Determine the RNA concentration and total amount of RNA in the cell lysate as described (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004], steps 1-2).\nWe generally obtain 20-200 ng total RNA from ultra-low-input samples. In some samples the RNA concentration may be too low to quantify, in which case you can proceed to step 2.\n2. Calculate the required amount of RNase using the equation:\n         \nRNase 1 (U) = 1 U/µl × volume cell lysate (µl)\n3. Add the calculated amount of RNase 1 to the lysate and mix gently by pipetting.\nAs described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0001] and Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0002], we lyse ultra-low-input samples in 40-60 µl lysis buffer. As RNase concentration is the only parameter considered here, using a lower volume of lysis buffer will reduce RNase 1 cost. The volume of lysis buffer for ultra-low-input samples was optimized considering sample lysis, RNase treatment, and footprint recovery steps.\n4. Seal the microcentrifuge tube with Parafilm and digest for 2 hr at room temperature (25°C) with gentle agitation.\n5. Proceed with the rest of the protocol as described (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004], steps 6-16), but increase the amount of GlycoBlue in step 9 from 20 μg to 25 μg.",
    "In this protocol, we describe how to generate a DNA library for sequencing using the total RNA fragments isolated from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004]. We outline the procedures for end-healing of RNase footprints, polyA-tailing of end-repaired RNase footprints, SMART-RT, removal of RNA fragments, and PCR1 and PCR2. Size selection is conducted on dsDNA after PCR amplification but not on RNA fragments. Most of the experimental conditions are identical for low- and ultra-low-input samples; any differences are noted in the appropriate steps.\nAdditional Materials (also see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004])\nRNase footprints (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004] or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0005])\nT4 polynucleotide kinase (PNK) and 10× reaction buffer (New England Biolabs, cat. nos. M0201L and B0201S)\nSUPERase⋅In RNase inhibitor (Invitrogen, cat. no. AM2694)\nNuclease-free water\n5× SuperScript II first-strand buffer (Invitrogen, cat. no. 18064014)\nE. coli polyA polymerase (New England Biolabs, cat. no. M0276L)\nAdenosine-5′-triphosphate (ATP, New England Biolabs, cat. no. B0756A)\n10 µM SMART-RT primer (synthesized by IDT; see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0002] for sequence)\nSuperScript II reverse transcriptase (Invitrogen, cat. no. 18064014)\n10 mM dNTP mix (Invitrogen, cat. no. 18427-013)\n100 mM DTT (Invitrogen, cat. no. 18064014)\n5 mM betaine (Sigma, cat. no. B0300)\n1 M MgCl2 (RNase free, Invitrogen, cat. no. AM9530G)\n100 µM SMARTer oligo (synthesized by QIAGEN; see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0002] for sequence)\n5000 U/ml RNase H (New England Biolabs, cat. no. M0297L)\n2× Ultra II Q5 Master Mix (New England Biolabs, cat. no. M0544L)\nPCR1 and PCR2 forward and reverse primers (synthesized by IDT; see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0002] for sequences)\nDNA Clean & Concentrator-5 (Zymo Research, cat. no. D4014)\n6× Gel Loading Dye (New England Biolabs, cat. no. B7024S)\n4% UltraPure agarose gel (precast, see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-rec-0001])\n174- and 194-bp dsDNA markers (see Support Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0007])\n100-bp DNA ladder (New England Biolabs, cat. no. N3231L)",
    "10× TBE (molecular biology grade, Promega, cat. no. V4251)\nZymoclean gel DNA recovery kit (Zymo Research, cat. no. D4008)\nQubit 1× dsDNA high sensitivity (HS) kit (Invitrogen, cat. no. Q33231)\nTable 2.\n                Primers for Generating Rfoot-seq Libraries\ntable:\n﻿Primer,Sequence\nSMART-RT primer,5′-ACGTGTGCTCTTCCGATCTNNNNNNNNNNNNNNNTTTTTTTTTTTTTTTVN-3′\nSMARTer oligo,5′-CTCTTTCCCTACACGACGCTCTTCCGATCTNNNNrGrG+G-3′\nPCR1 forward primer,5′-GATCTACACTCTTTCCCTACACGACGC-3′\nPCR1 reverse primer,5′-GTGACTGGAGTTCAGACGTGTGCTCTTCCGATCT-3′\nPCR2 forward primer,5′-AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACAC-3′\nPCR2 reverse primer,5′-CAAGCAGAAGACGGCATACGAGATNNNNNNGTGACTGGAGTTCAGACGTGTG-3′\n0.2-ml PCR tubes, DNA/DNase/RNase free\nThermal cycler (e.g., Applied Biosystems, cat. no. 4375786)\nBlue-light transilluminator (e.g., Safe Imager 2.0, Invitrogen, cat. no. G6600)\nAgilent High Sensitivity D1000 ScreenTape (run on the Agilent 2200 TapeStation)\nAdditional reagents and equipment for agarose gel electrophoresis\nEnd-heal RNase footprints\n1. Prepare the T4 PNK reaction mixture on ice as follows and mix well by pipetting:\n         \n0.5 µl 10× PNK buffer\n1 µl T4 PNK\n0.5 µl SUPERase⋅In RNase inhibitor\n3 µl nuclease-free water\nIf multiple samples are processed in parallel, prepare a master mix for all samples.\n2. Suspend RNase footprints in 5 µl T4 PNK reaction mixture.\n3. Run in a thermal cycler with the following program:\n         \n37°C for 45 min\n50°C for 90 s\n37°C for 15 min\n65°C for 5 min\nHold at 4°C\nT4 PNK removes 3′ phosphoryl groups to make the RNase footprints suitable for polyA tailing.\nPerform polyA tailing\n4. Prepare the polyadenylation mix as follows and keep on ice:\n         \n2 µl SuperScript II first-strand buffer\n2 µl E. coli polyA polymerase\n0.25 µl 10 mM ATP\n0.5 µl SUPERase⋅In RNase inhibitor\n0.25 µl nuclease-free water\nIf multiple samples are processed in parallel, prepare a master mix for all samples together.\n5. Add 5 µl polyadenylation mix to end-repaired RNase footprints and mix well.\n6. Incubate in a thermal cycler at 37°C for 2-3 hr for low-input samples or 4 hr for ultra-low input samples.\nPerform SMART-RT",
    "7. Add 2.5 µl of 10 µM SMART-RT primer to the polyA-tailed samples and mix well by pipetting.\nThe SMART-RT primer includes a polyT tail, a 15-mer unique molecular identifier (UMI, N15, to control for PCR bias), and a partial Illumina read 2 sequencing adapter.\n8. Anneal primer by running the following program in a thermal cycler:\n         \n72°C for 5 min\nHold at 4°C\n9. Prepare the SMART-RT reaction mix as follows and keep on ice:\n         \n4 µl SuperScript II first-strand buffer\n2 µl SuperScript II reverse transcriptase\n0.5 µl SUPERase⋅In RNase Inhibitor\n2.5 µl 10 mM dNTP mix\n1.5 µl 100 mM DTT\n6 µl 5 mM betaine\n0.12 µl 1 M MgCl2\n0.5 µl 100 µM SMARTer oligo\n0.5 µl nuclease-free water\nIf multiple samples are processed in parallel, prepare a master mix for all samples together.\nThe SMARTer oligo includes locked nucleotides rGrG+G, four random nucleotides (N4, to increase sequencing quality) before the locked nucleotides, and a partial Illumina read 1 sequencing adapter.\n10. Add the SMART-RT mix (17.12 μl) to the reaction and mix well.\n11. Run the following RT program in a thermal cycler:\n         \n1 cycle: \n               \n1 hr at 42°C\n10 cycles:\n               \n2 min at 50°C\n2 min at 42°C\n1 cycle:\n               \n15 min at 70°C\nHold at 4°C\ncDNA can be stored at −20°C for several days.\nRemove RNA fragments\n12. Add 1 µl of 5000 U/ml RNase H and incubate in a thermal cycler as follows:\n         \n15 min at 37°C\n15 min at 65°C (to inactivate RNase H)\ncDNA can be stored at −20° or −80°C for several months or longer.\nAmplify cDNA by SMART-RT (PCR1)\n13. Prepare the PCR1 mix and mix well:\n         \n50 µl 2× Ultra II Q5 Master Mix\n5 µl 10 µM PCR1 forward primer",
    "5 µl 10 µM PCR1 reverse primer\n30 µl cDNA (from step 12)\n10 µl nuclease-free water\n14. Run the PCR1 program in a thermal cycler:\n         \n1 cycle:\n               \n3 min at 98°C\n1 cycle:\n               \n20 s at 98°C\n30 s at 65°C\n90 s at 72°C\n6-8 cycles:\n               \n20 s at 98°C\n20 s at 67°C\n60 s at 72°C\n1 cycle:\n               \n3 min at 72°C\nHold at 4°C\nThe number of amplification cycles can be adjusted based on the input material. We generally have good library yield after six cycles for low-input samples or seven to eight cycles for ultra-low-input samples. The yield can be checked using Qubit dsDNA high-sensitivity reagents. Typically, more than 1 µg dsDNA can be obtained after PCR1.\n15. Purify the PCR1 product using a DNA Clean & Concentrator-5 column, eluting the product in 20 µl nuclease-free water.\ncDNA can be stored up to 1 year at −20°C.\nAmplify PCR1 product with extended primers (PCR2)\n16. Prepare the following PCR2 mix and mix well:\n         \n25 µl 2× Ultra II Q5 Master Mix\n2.5 µl 10 µM PCR2 forward primer\n2.5 µl 10 µM PCR2 reverse primer\n20 µl purified PCR1 eluent\nThe PCR2 reverse primer includes the Illumina P7 sequence, a library index (N6), and a partial Illumina read 2 sequencing adapter.\n17. Run the PCR2 program in a thermal cycler:\n         \n1 cycle:\n               \n3 min at 98°C\n4-6 cycles:\n               \n20 s at 98°C\n20 s at 67°C\n30 s at 72°C\n1 cycle:\n               \n3 min at 72°C\nHold at 4°C",
    "The number of amplification cycles can be adjusted based on the input material. We generally have good library yield after four cycles for low-input samples or five to six cycles for ultra-low-input samples. The yield can be checked using Qubit dsDNA high-sensitivity reagents. Typically, 1-2 µg dsDNA can be obtained after PCR2.\n18. Purify the PCR2 product using a DNA Clean & Concentrator-5 column, eluting in 20 µl nuclease-free water.\nYou can skip this purification step and proceed directly to the next step, but we find that purification of the PCR products can improve the accuracy of gel-based size selection.\ndsDNA can be stored up to one year at −20°C.\nPerform size selection\n19. Add 4 µl of 6× Gel Loading Dye to each sample and load on a precast 4% agarose gel.\n20. Prepare dsDNA markers for one lane by mixing:\n         \n100 ng 174-bp library marker (equivalent to a 15-bp insert)\n100 ng 194-bp library marker (equivalent to a 35-bp insert)\n6× loading buffer\nNuclease-free water to bring loading buffer concentration to 1×\n21. Load dsDNA library markers and 10 µl of 100-bp DNA ladder in separate lanes of the gel.\nTo facilitate gel excision, library markers can be loaded on both sides of the DNA samples (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0003],C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3fb7acfd-cceb-4f01-8d18-f4413330ba7a/cpz1761-fig-0003-m.jpg</p>\nFigure 3\nSize selection of Rfoot-seq library. Representative DNA libraries generated with HEK293T cells (A), snap-frozen mouse spleen tissue (B), and human CD4+ T cells isolated from blood (C) were separated by agarose gel electrophoresis. A DNA ladder and a mixture of upper- and lower-sized (194- and 174-bp) dsDNA markers were loaded in each gel. The bracket indicates the region that should be excised.\n22. Run gel in 1× TBE buffer for 60 min at 150 V.",
    "23. Visualize the gel on a blue-light transilluminator and excise the DNA product with 15-35 bp insert.\nExample results are shown in Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0003].\n24. Use a DNA gel recovery kit to recover the size-selected DNA library.\nThe purified dsDNA library can be stored indefinitely at −20°C.\n25. Quantify dsDNA in the library using the Qubit dsDNA high-sensitivity kit.\nSamples can be multiplexed at equal molarity (or as desired).\nSequence dsDNA library\n26. Check the DNA size distribution of the Rfoot-seq library with a high-sensitivity D1000 ScreenTape assay according to manufacturer's instructions.\nA typical library DNA size distribution is shown in Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0004].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0a6b10e2-b3b6-429d-97c1-2eda50e0f77b/cpz1761-fig-0004-m.jpg</p>\nFigure 4\nTapestation High Sensitivity D1000 analysis results showing the size distribution of a high-quality DNA sequencing library. The size distribution should be from 174 to 205 bp, with a peak around 190 bp.\n27. Sequence Rfoot-seq libraries with an Illumina sequencer (HiSeq or similar) to obtain at least 50 million reads per sequencing library.",
    "Two dsDNA fragments (174 and 194 bp) are used as markers to guide library size selection. Both markers are generated by PCR amplification from the same synthesized 174-nt ssDNA template using separate sets of primers.\nMaterials\nssDNA template and forward and reverse primers (see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0003])\n2× Ultra II Q5 Master Mix (New England Biolabs, cat. no. M0544L)\nDNA Clean & Concentrator-5 (Zymo Research, cat. no. D4014)\nQubit 1× dsDNA high sensitivity (HS) kit (Invitrogen, cat. no. Q33231)\nThermal cycler (e.g., Applied Biosystems, cat. no. 4375786)\nTable 3.\n                Oligos for Generating dsDNA Library Markers\ntable:\n﻿Oligonucleotide,Sequence\nssDNA library marker template,5′-AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTCTTCCGATCTATCGGGGATCTGCACTAGCCATTTCAACCAAAGTGTTTTCATTCAAATACTGAGATCGGAAGAGCACACGTCTGAACTCCAGTCACATCGCTATCTCGTATGCCGTCTTCTGCTTG-3′\nForward primer for 194-bp marker,5′-AGCAGGGTAGAATGATACGGCGACCACCGA-3′\nReverse primer for 194-bp marker,5′-AGTTGGTGCTCAAGCAGAAGACGGCATACG-3′\nForward primer for 174-bp marker,5′-AATGATACGGCGACCACCGA-3′\nReverse primer for 174-bp marker,5′-CAAGCAGAAGACGGCATACG-3′\n1. Prepare 10 µM stock solutions of all oligos listed in Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0003].\n2. Prepare two reactions, one using the appropriate primers for the 174-bp marker and the other using the primers for the 194-bp marker (see Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0003]):\n         \n50 µl 2× Ultra II Q5 Master Mix\n5 µl 10 µM forward primer\n5 µl 10 µM reverse primer\n0.1 µl 10 µM marker ssDNA template\n40 µl nuclease-free water\n3. Amplify in a thermal cycler with the following program:\n         \n1 cycle:\n               \n3 min at 98°C\n20 cycles:\n               \n20 s at 98°C\n20 s at 67°C\n20 s at 72°C\n1 cycle:\n               \n3 min at 72°C\nHold at 4°C\n4. Clean amplified DNA fragments using DNA Clean & Concentrator-5 columns.\n5. Quantify DNA concentration using the Qubit dsDNA High Sensitivity (HS) kit.\n6. Store dsDNA library markers indefinitely at −20°C.",
    "This protocol describes the computational data analysis of the Rfoot-seq data. When Rfoot-seq is applied to a new cell type of interest, it is generally necessary to optimize the RNase treatment and library preparation procedures. Here, we introduce the library data quality analysis steps and describe the procedures to calculate ribosome occupancy in protein-coding regions. As this assay also maps RNA fragments from stable non-ribosomal complexes in noncoding regions (e.g., sncRNAs and some lncRNAs), we describe the analysis needed to distinguish ribosomal from non-ribosome footprints based on read distribution features.\nAs an example, we use Rfoot-seq data derived from HeLa cells, a human epithelial cell line derived from cervical cancer. The example command lines are available on GitHub (https://github.com/zhejilab/RNaseFootprinting[href=https://github.com/zhejilab/RNaseFootprinting]). This procedure can be adapted to analyze data from other cell types or model species.\nNOTE: Where appropriate, we have specified the use of eight threads to speed up alignment and coverage track creation steps. This number should be adjusted based on the computational resources available.\nMaterials\nPython/Anaconda\nR\nBowtie 2 (Langmead & Salzberg, 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0023])\nTopHat (Kim et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0022])\ndeepTools (Ramírez et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0030])\nSAMtools (Danecek et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0008])\nHTSeq (Anders et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0001])\nSRA Toolkit (https://github.com/ncbi/sra-tools[href=https://github.com/ncbi/sra-tools])\nCutadapt (https://github.com/marcelm/cutadapt[href=https://github.com/marcelm/cutadapt])\nRibORF 2.0 (https://github.com/zhejilab/RibORF[href=https://github.com/zhejilab/RibORF])\nOptional: Rfoot (https://github.com/zhejilab/Rfoot[href=https://github.com/zhejilab/Rfoot])\nRead mapping\n1. Download reference files from the UCSC Genome Browser and GENCODE (Frankish et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0010]) databases. The “refFlat.txt.gz” file is processed into genePred format to meet the RibORF input requirements. All reference files are moved to the “annotation” directory for organizational purposes.\n         \n```\nmkdir ./annotation\nwget “https://ftp.ebi.ac.uk/pub/databases/gencode/Gencode_human/release_42/GRCh38.primary_assembly.genome.fa.gz”\ngunzip GRCh38.primary_assembly.genome.fa.gz\nmv GRCh38.primary_assembly.genome.fa ./annotation/genome.GRCh38.fa\nwget \"https://ftp.ebi.ac.uk/pub/databases/gencode/Gencode_human/release_42/gencode.v42.annotation.gtf.gz\"\ngunzip gencode.v42.annotation.gtf.gz\nmv gencode.v42.annotation.gtf ./annotation/gencode.v42.gtf\nwget \"https://hgdownload.cse.ucsc.edu/goldenpath/hg38/database/refFlat.txt.gz\"\ngunzip refFlat.txt.gz\ncut refFlat.txt -f2-11 > ./annotation/refseq.genePred\nrm refFlat.txt\n```\n2. Make alignment indices for Bowtie 2 and TopHat.\n         \n```\nmkdir ./annotation/rRNA\nbowtie2-build -f ./annotation/rRNA.fa ./annotation/rRNA/rRNA\nmv ./annotation/rRNA.fa ./annotation/rRNA/rRNA.fa\nmkdir ./annotation/genome",
    "bowtie2-build -f ./annotation/genome.GRCh38.fa ./annotation/genome/genome\nmv ./annotation/genome.GRCh38.fa ./annotation/genome/genome.fa\nmkdir ./annotation/transcriptome\ntophat -G ./annotation/gencode.v42.gtf --transcriptome-index=./annotation/transcriptome/known ./annotation/genome/genome\nmv ./annotation/gencode.v42.gtf ./annotation/transcriptome/known.gtf\n```\n3. Optional: Download the FASTQ file of interest from NIH Gene Expression Omnibus (GEO) repository. The data for “SRR11950060” are analyzed here as an example.\n         \n```\nfasterq-dump --outdir ./data/SRR11950060\ngzip ./data/SRR11950060_1.fastq\ngzip ./data/SRR11950060_2.fastq\n```\n4. Trim read adapters for higher accuracy of downstream read alignment. As the RNase footprints are generally short, the R1 sequencing reads can cover the whole footprint and are used for downstream analyses. The first seven nucleotides are from the SMARTer oligo (rGrG+G + 4 random nucleotides) and are trimmed from the beginning of each read (“-u 7”). The polyA adapter is removed from the end of reads (“-a AAAAAAAA”), allowing for one mismatch within the adapter sequence (“-e 0.2”, where “-e” sets the maximum allowed error rate in the adapter sequence). Reads with a length between 18 and 35 nt are retained for downstream analysis to facilitate quick and accurate alignment (“-m 18 -M 35”, where “-m” and “-M” are the minimum and maximum read lengths).\n         \n```\ncutadapt -a AAAAAAAA -e 0.2 -u 7 -m 18 -M 35 \\\n-o ./data/SRR11950060_1.trimmed.fastq.gz \\\n./data/SRR11950060_1.fastq.gz > ./logs/SRR11950060_cutadapt.log\n```\n5. Align trimmed reads to rRNA. Trimmed input reads are aligned to rRNA reference sequences. The reads unmapped to rRNA sequences are used for further analyses. About 80% of Rfoot-seq reads were mapped to rRNAs. These reads cannot be aligned to a reference transcriptome to study RNA translation.\n         \n```\nmkdir ./align_rRNA\nbowtie2 -p 8 \\\n-x ./annotation/rRNA/rRNA \\\n-U ./data/SRR11950060_1.trimmed.fastq.gz \\\n--un ./align_rRNA/unmapped.fastq \\\n-S ./align_rRNA/accepted_hits.sam 2> ./logs/SRR11950060_align_rRNA.log\n```\n6. Align rRNA-unmapped reads to the transcriptome and then genome. To prevent an error during alignment, the output directory needs to be specified with a trailing forward slash.\n         \n```\nmkdir ./align_transcriptome",
    "tophat -p 8 \\\n--transcriptome-index=./annotation/transcriptome/known \\\n-o ./align_transcriptome/ \\\n./annotation/genome/genome \\\n./align_rRNA/unmapped.fastq &> ./logs/SRR11950060_align_transcriptome.log\n```\n7. Extract uniquely mapped reads and quality check results. Coverage tracks (BigWig format) for the forward and reverse strands can be viewed in the Integrative Genomics Viewer (IGV).\n         \n```\nsamtools view -H ./align_transcriptome/accepted_hits.bam > ./align_transcriptome/unique_hits.sam\nsamtools view ./align_transcriptome/accepted_hits.bam | grep -w \"NH:i:1\" >> ./align_transcriptome/unique_hits.sam\nsamtools view -S -b ./align_transcriptome/unique_hits.sam | samtools sort -o ./align_transcriptome/unique_hits.bam\nsamtools index ./align_transcriptome/unique_hits.bam\nbamCoverage -p 8 -b ./align_transcriptome/unique_hits.bam -o ./align_transcriptome/unique_hits.str1.bw --filterRNAstrand reverse --normalizeUsing CPM --binSize 1\nbamCoverage -p 8 -b ./align_transcriptome/unique_hits.bam -o ./align_transcriptome/unique_hits.str2.bw --filterRNAstrand forward --normalizeUsing CPM --binSize 1\n```\nData quality control using RibORF\nRibORF takes the read alignment from the step above and examines the read fragment sizes and their distribution around the start and stop codons of mRNAs.\n8. Examine the read fragment sizes and plot the distribution of read 5′ end locations surrounding the start and stop codons grouped by read length. High-quality data should show strong read enrichment in coding regions compared to UTRs. The coding region reads should be enriched for lengths of ∼21 and ∼29 nt with 3-nt periodicity (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0005],B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0005]). If this pattern is not observed, see Table 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-tbl-0004] for troubleshooting of experimental conditions.\n         \n```\nmkdir -p ./riborf/readdist\nperl ./software/RibORF.2.0/readDist.pl \\\n-f ./align_transcriptome/unique_hits.sam \\\n-g ./annotation/gencode.v38.genePred \\\n-o ./riborf/readdist \\\n-d 18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,\n```\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1008059e-237d-4725-b3c9-33f00eb3ac2a/cpz1761-fig-0005-m.jpg</p>\nFigure 5",
    "Computational analyses of Rfoot-seq data. (A) Distribution of read fragments. Read peaks were observed at 29 and 21 nt. (B) Read distribution around mRNA start and stop codons. The 29-nt read fragments were used in the analysis. The reads were enriched in coding regions with 3-nt periodicity and were depleted in 3′ UTRs. (C) Read distribution for ribosomal and non-ribosome footprints. The ribosomal A-site-adjusted reads are shown. (D) Example read distribution across the CSTF2 coding region. The reads show 3-nt periodicity. (E) Example non-ribosome footprints in the sncRNA SNORD75. The reads show a localized distribution without periodicity.\nTable 4.\n                Troubleshooting Guide for Rfoot-seq Assay\ntable:\n﻿Problem,Possible Cause,Solution\nRead size peak >29 nt,Insufficient RNase digestion,Follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004] or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0005] to optimize digestion conditions\n,,\"Confirm performance of RNase 1, especially its unit definition\"\n,,Increase RNase 1 in the reaction so it is close to 1 U/µl\nRead size peak <28 nt,Overdigestion by RNase,Follow Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0004] or Alternate Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0005] to optimize digestion conditions\n,,Decrease RNase 1 in the reaction so it is close to 0.5 U/µl\nLack of 3 nt and read size peak is ∼29 nt,Insufficient RNase digestion or cell-specific ribosome conformation,\"Confirm performance of RNase1, especially its unit definition\"\n,,Increase RNase 1 in the reaction so it is close to 1 U/µl\n,,Try on another cell or tissue to see if it is cell/tissue-specific\nLow yield,RNA degradation,Clean bench and pipetters with RNase decontamination solution before library preparation\n,Unoptimized library construction conditions,Increase incubation time for polyA tailing\n,,Increase cycle numbers for PCR and PCR2\nReads show strong bias across coding regions covering few codons,Too much starting material,Use no more than 1200 ng starting material\n,Unoptimized SMART-RT conditions,Follow Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-prot-0006] to optimize SmartRT conditions\n,Low sequencing depth,Obtain more sequencing reads",
    "Low mappable reads,Inaccurate dsDNA size selection,Use 4% agarose gel\n,,Run gel longer for better DNA separation\nQuantifying ribosome occupancy in protein-coding regions\n9. Quantify ribosome occupancy in coding regions using HTSeq. We quantify only reads that overlap CDS regions according to the annotation file (“--type CDS”). Reads that overlap a portion of a gene but are not fully contained within that gene are also counted (“--mode union”). Reads that overlap multiple transcript isoforms are counted toward the gene expression (“--nonunique all”). The data is processed in a strand-specific manner (“--stranded yes”).\n         \n```\nhtseq-count \\\n--format=\"bam\" \\\n--stranded=\"yes\" \\\n--type=\"CDS\" \\\n--mode=\"union\" \\\n--nonunique=\"all\" \\\n./align_transcriptome/unique_hits.bam \\\n./annotation/transcriptome/known.gff > ./align_transcriptome/unique_hits.counts.txt\n```\nRead distribution features distinguishing ribosome from non-ribosome footprints\n10. Correct the location of reads based on their read length and the provided offset parameters, which will need to be manually curated before this step. This will assign the read mapping locations to ribosomal A-sites, correcting for the offset distance between the 5′ end of reads and ribosomal A-sites. These correction parameters are inferred from the RibORF readDist plots. Here, we only include fragment sizes showing >60% of reads assigned to the first nucleotides of codons, including 21, 27, 28, and 29 nt. Details are described in a previously published protocol (Ji, 2018b[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0018]). Users can load corrected reads (BigWig files) to IGV. The translated ORFs show 3-nt periodicity and the non-ribosome footprints show a localized distribution without periodicity (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0005]-E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-fig-0005]).\n         \n```\nmkdir -p ./riborf/corrected\nperl ./software/RibORF.2.0/offsetCorrect.pl \\\n-r ./align_transcriptome/unique_hits.sam \\\n-p ./riborf/offset.correction.parameters.txt \\\n-o ./riborf/corrected/corrected_hits.sam\nperl ./software/RibORF.2.0/readDist.pl \\\n-f ./riborf/corrected/corrected_hits.sam \\\n-g ./annotation/refseq.genePred \\\n-o ./riborf/corrected \\\n-d 1\nRscript --vanilla ./software/RibORF.2.0/combine_plots.R ./riborf/corrected 1\nsamtools view -S -b ./riborf/corrected/corrected_hits.sam | samtools sort -o ./riborf/corrected/corrected_hits.bam\nsamtools index ./riborf/corrected/corrected_hits.bam\nbamCoverage -p 8 -b ./riborf/corrected/corrected_hits.bam -o ./riborf/corrected/corrected_hits.str1.bw --filterRNAstrand reverse --normalizeUsing CPM --binSize 1",
    "bamCoverage -p 8 -b ./riborf/corrected/corrected_hits.bam -o ./riborf/corrected/corrected_hits.str2.bw --filterRNAstrand forward --normalizeUsing CPM --binSize 1\n```\n11. Optional: Users can further apply RibORF to identify genome-wide translated ORFs and Rfoot to identify non-ribosome footprints using the Rfoot-seq data. The detailed analysis steps have been described in previous Current Protocols articles (Ji, 2018a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.761#cpz1761-bib-0017],b).\nSee Understanding Results for information about sample data."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}