{
  "id": 17626,
  "origin_website": "Jove",
  "title": "Implantation of Combined Telemetric ECG and Blood Pressure Transmitters to Determine Spontaneous Baroreflex Sensitivity in Conscious Mice",
  "procedures": [
    "Perform all animal studies in compliance with local institutional guidelines and national laws on animal experimentation. For this experiment, the studies were approved by the Regierung von Oberbayern and were in accordance with German laws on animal experimentation. WT animals (C57BL/6J background) and animals of a sick sinus syndrome mouse model displaying increased BRS sensitivity (Hcn4tm3(Y527F;R669E;T670A)Biel)11 (mixed C57BL/6N and 129/SvJ background) were used for this study.\n1. Equipment setup\nRemove a telemetric transmitter from its sterile package and shorten the ECG leads to the length appropriate for the size of the mouse. For a 12-week-old male black six mouse (C57BL/6J), weighing ~30 g, shorten the positive lead (red) to a length of ~45 mm and the negative lead (colorless) to a length of ~40 mm using scissors.\n\tNOTE: These values are given as orientation and must be adapted as necessary (Figure 2).\nRemove approximately 6 mm of the ECG lead´s silicone tubing using a scalpel to expose the wire. Cover the tips of the wire with excessive tubing leaving a ~2 mm portion of ECG wire uncovered to record electrical signals. Secure the silicone tubing with non-absorbable 5-0 silk suture material (Figure 2A).\nWrite down the transmitter serial number into the operation protocol (Supplemental File 1).\nHydrate the transmitter in warm, sterile 0.9 % NaCl solution.\nWeigh the mouse and record its weight.\nAutoclave all surgical instruments prior to the surgery. Sterilize them during surgery and between operating different animals by dry heat using a hot glass bead sterilizer.\n\t​NOTE: Surgical instruments must cool down to room temperature before use to prevent skin burns.\nDisinfect the work bench to assure aseptic conditions.\n2. Surgical implantation of telemetric transmitters for combined ECG and blood pressure measurements\nDissection of the left common carotid artery.",
    "Anesthetize a mouse by intraperitoneal injection of anesthesia mix (100 mg/kg ketamine; 15 mg/kg xylazine; 1 mg/kg acepromazine). Perform a toe pinch test to ensure that the mouse is fully anesthetized before commencing surgery.\nUse a trimmer to shave the surgical area from below the chin towards the transversal pectoral muscles.\nPlace the mouse in a supine position on a temperature-controlled surgery plate set to 37 °C. Secure the limbs with surgical tape and continuously monitor body temperature with a rectal thermometer (Figure 2C). If body temperature drops below 37 °C cover the animal´s body with sterile cotton gauze during surgery.\nApply eye ointment to protect the animal´s eyes during anesthesia.\nApply depilatory cream to the previously shaved surgical area. Remove hair and depilatory cream using a cotton pad and warm water after 3-4 min. Make sure that the skin is clean and free of any residual hair and depilatory cream, so that the wound will not be contaminated during the operation.\nDisinfect the skin with several alternating rounds of povidone-iodine or chlorhexidine scrub followed by alcohol. \nPosition the animal under a dissecting microscope and place a sterile drape around the surgical area.\nMake a 1-1.5 cm midline incision through the skin of the neck, starting immediately below the chin. Take effort to make the incision as straight as possible. (Figure 2D).\n\t\tNOTE: During the following steps, the surgical area must be kept moist by regular application of sterile, warm (37 °C) 0.9 % NaCl.\nCreate a subcutaneous space at both sides of the incision by separating the skin from underlying connective tissue with blunt dissection scissors. Be careful not to pinch the skin too strongly with the forceps, as this can cause necrosis and lead to impaired wound healing after surgery.",
    "Separate the parotid and submandibular glands using cotton tip applicators to expose the musculature overlying the trachea.\nRetract the left salivary gland with curved dissection forceps to identify the left carotid artery located laterally to the trachea (Figure 2E).\nCarefully dissect the carotid artery from adjacent tissue using curved forceps. Be very careful not to injure the vagal nerve that is running along the vessel. Continue blunt dissection to expose the left carotid artery to about 10 mm in length and fully separate it from vascular fascia and the vagus nerve (Figure 2F).\nPass a non-absorbable, 5-0 silk suture underneath the isolated portion of the carotid artery while slightly lifting the blood vessel with curved forceps to reduce friction between the suture and the carotid artery, as this could easily damage the vascular wall.\nPlace the suture cranially, just proximally to the bifurcation of the carotid artery, form a knot and tie it to permanently ligate the vessel (Figure 2G). Fix both ends of the cranial occlusion suture to the surgery table with surgical tape.\nPass a second occlusion suture underneath the carotid artery and place it caudally at ~5 mm distance to the cranial suture (Figure 2H). It is needed for temporary occlusion of blood flow during cannulation of the artery. Therefore, tie a loose knot and fix both suture ends with surgical tape.\nPosition a third suture (secure suture) between the cranial and caudal occlusion suture and make a loose knot (Figure 2I). This suture is needed to keep the catheter in place while cannulating the artery. Tape one end of the suture to the surgery table.\nCannulation of the left common carotid artery.",
    "NOTE: The sensor area of the blood pressure catheter is located 4 mm from the distal end and consists of a tube containing a non-compressible fluid and a biocompatible gel (Figure 2B). Since this area is very sensitive, make sure it is free of air bubbles and do not touch it at any time during the procedure.\n\t\nBend the tip of a 24 G needle to an angle of ~100° to use it as a catheter introducer.\nGently pull the caudal occlusion suture and fix it with tension to temporarily stop blood flow and to slightly lift the artery.\nCarefully penetrate the artery proximal to the cranial occlusion suture with the bent needle (Figure 2J). Grip the catheter with vessel cannulation forceps, introduce it into the small puncture and let it slide slowly into the vessel. Gently pull back the bent needle simultaneously (Figure 2K).\nWhen the catheter reaches the caudal occlusion suture slightly tighten the secure suture to keep the catheter in place (Figure 2L).\nLoosen the caudal occlusion suture so that the catheter can be further moved until its tip is positioned in the aortic arch.\n\t\tNOTE: Be sure to determine the correct insertion length of the catheter, as this depends on the size of the mouse. For male mice with a C57BL/6J background at 12 weeks of age and ~30 g body weight, we recommend inserting the catheter until the integrated notch reaches the cranial occlusion suture. The correct insertion depth and placement of the catheter for the specific mouse line can be verified after euthanasia of the animal.\nOnce positioned properly, secure the catheter with all three sutures and cut the ends as short as possible. Do not pull the knots too tight as this could damage the fragile blood pressure catheter.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62101/62101fig2v2.jpg",
    "Figure 2: Implantation of a combined ECG and blood pressure transmitter - cannulation of the left carotid artery. (A) The telemetry transmitter is composed of a pressure catheter, two biopotential electrodes and the device body. (B) Schematic representation of the pressure catheter. The sensor area consists of a non-compressible fluid and a biocompatible gel. The catheter must be inserted into the carotid artery until the notch is at the level of the cranial occlusion suture to ensure proper position in the blood vessel. (C) Anesthetized C57BL/6J mouse prepared for surgical transmitter implantation. (D-L) Image sequence showing surgical procedure for cannulation of the left carotid artery. (D) Cervical skin incision. (E) Exposed trachea to identify the left carotid artery located laterally to the trachea. (F) Blunt dissection to isolate the artery from adjacent tissue and the vagus nerve. (G) Permanent ligation of the left carotid artery with cranial occlusion suture. (H) Tension applied to caudal occlusion suture to temporarily stop blood flow. (I) Secure suture to keep the catheter in place during cannulation. (J) Cannula with curved tip for insertion of the catheter into the blood vessel. (K) Pressure catheter is inserted into the carotid artery. (L) The catheter tip is positioned in the aortic arch and the catheter secured with the middle suture. Scale bar in D - L shows 4 mm. Reprinted from16. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62101/62101fig2v2large.jpg]\nPlacement of the telemetry device body in a subcutaneous pocket on the left flank of the mouse (Figure 3).\n\t\nForm a subcutaneous tunnel from the neck directed towards the left flank of the animal and form a small pouch using small, blunt dissecting scissors (Figure 3B).",
    "Irrigate the tunnel with a 1 mL syringe filled with warm, sterile 0.9% NaCl solution and introduce ~300 µL of the solution into the pouch (Figure 3C).\nCarefully lift the skin with blunt forceps and introduce the transmitter device body into the pouch (Figure 3D). During this step, be very careful not to pull the blood pressure catheter out of the carotid artery.\nPlacement of the ECG leads in Einthoven II configuration.\n\t\nForm a thin tunnel to the right pectoral muscle with blunt dissecting scissors and place the negative (colorless) lead into the tunnel using blunt forceps. Fix the terminal end of the lead with a stitch to the pectoral muscle using 6-0 absorbable suture material (Figure 3E).\nForm a loop in the positive (red) lead, position its tip at the left caudal rib region and secure its position with a suture using 6-0 absorbable suture material.\n\t\tNOTE: It is important that both leads lie flat against the body for their whole length to avoid tissue irritation (Figure 3F).\nClose the skin with single knots using 5-0 non-absorbable suture material (Figure 3H). Additionally, apply a small amount of tissue adhesive on every knot to keep the animal from biting the suture and prevent dehiscence.\nApply povidone-iodine hydrogel 10% to the wound to prevent wound infection during the recovery phase.\nFor preemptive pain relief inject 5 mg/kg carprofen in 0.9 % NaCl subcutaneously while the mouse is still under anesthesia.",
    "Set a heating platform to 39 ± 1 °C and place the mouse in a separate housing cage. Position one half of the cage on the platform for 12 h after surgery and transfer the mouse in the warm area. When the animal awakens from anesthesia, it has the option of staying in the warm area or moving to the cooler part of the cage.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62101/62101fig3v2.jpg\nFigure 3: Implantation of a combined ECG and blood pressure transmitter - subcutaneous placement of the ECG electrodes and device body. (A) Mouse after insertion of the blood pressure catheter. Catheter position is secured by the occlusion sutures. (B) Forming a subcutaneous pocket on the left flank of the animal with blunt scissors. (C) The pouch is irrigated with ~300 μL of warm sterile saline. (D) The device body is placed in the subcutaneous pocket. (E) The terminal end of the negative electrode (colorless) is fixed to the right pectoral muscle with absorbable suture material. (F) Fixation of the positive electrode (red) to the left intercostal muscles. (G) Placement of a permanent suture on the chest muscle to secure the position of the ECG electrodes. (H) Mouse after skin closure. The subcutaneous positions of the ECG electrode tips are indicated by red circles. For demonstration purposes, a dead animal was used to take these images. Please follow sterile practices while using a live animal. Reprinted from16. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62101/62101fig3v2large.jpg]\nPost-operative care\n\t\nFor post-operative pain relief inject 5 mg/kg carprofen in 0.9% NaCl subcutaneously every 12 h for 3-5 days until the wound has healed.\nInject 10 µL/g of warm ringer-lactate solution intraperitoneally to protect the animal from dehydration.",
    "Let the mouse recover for 2-3 weeks before running the first telemetric measurements. Carefully monitor general health conditions, wound healing, body weight, and food and water intake during the recovery period.\nAt the end of the experiment, euthanize the mouse by carbon dioxide (CO2) inhalation.\n\t\t​NOTE: Cervical dislocation or decapitation is not recommended as euthanasia method since this could damage parts of the ECG and BP transmitter device.\nData acquisition.\n\t\nTake measures to avoid acoustic and electronic noise during data recording. Additionally, limit access of personnel during data recording and complete all husbandry procedures prior to the experiment.\nPlace the animal´s cage on the telemetry receiver plate and turn on the telemetric transmitter by bringing a magnet close to the animal.\nAcquire continuous ECG, blood pressure and activity recordings over 72 h (12-h dark/light cycle) with data acquisition software (Figure 4).\nAnalysis of the circadian rhythm of heart rate, blood pressure and activity.\n\t\nCheck the presence of a regular circadian rhythm of HR, BP and activity using data acquisition software12 (Figure 5).\nData analysis including determination of baroreceptor sensitivity using the sequence method with ECG and BP analysis software.\n\t\nExport BP and HR data from data acquisition software into ECG and BP analysis software (Supplemental File 2). Use the following sequence of commands: Open ECG and BP analysis software > File > Raw data from converter > Convert non-IOX raw data. In the new window click File > Load Dataquest ART4 data. Again, a new window will open, select data file for export > New window opens, select animal from \"subjects\" list and select ECG and BP from \"waveforms list\" and press OK. Choose animals from which data should be converted by clicking Convert data > Create IOX binary site file.",
    "Open IOX binary site file in ECG and BP analysis software by using the following sequence of commands: File > Load IOX data > Select BP and ECG trace > press the green checkmark.\n\t\t​NOTE: The following data processing parameters are optimized for data acquired from wildtype mice and should in principle fit all mouse models used in preclinical field. However, adaption of these parameters might be necessary when working with specific experimental models, e.g., mice with extremely high or low HR and/or BP values, or different rodent species. In any case, data processing parameters need to be carefully reviewed to assure that they fit the specific model under study.\nFor settings for ECG, BP and BRS analysis see Supplemental File 3,4. For BRS analysis in mice, adjust the BRS parameters to detect only sequences of three (or more) beats exhibiting a delay between SBP and RR of one beat, and set the threshold for SBP and RR change to 0.5 mmHg and 2 ms. Ensure that the correlation coefficient of the slope of the regression line from RR/SBP plots is larger than 0.75 and analyze only sections exhibiting stable sinus rhythm. Set parameters for ECG, BP and BRS analysis accordingly by using the following sequence of commands: Tune > analysis settings > new window opens",
    "ECG settings (right-click in the \"ECG mode and signal filtering\" window (Supplemental File 3)). Set the parameters as detailed here. Mode: ECG, RR-only, Filter mode: auto, according to set HR, Expected heart rate: bpm > 300, Baseline removal filter width (ms): 100.00, Noise removal filter width: 1.00 ms, Notch filter: 50.0 Hz, Spike removal filter: off, Drop-out detection mode: off, Max RR lengths (ms): 900.00, RR from adjusted R peaks: off, RR_only settings mode: Xsmall: mouse, R peak width (ms): 10.00, PR width (ms): 20.00, RT width (ms): 50.00, Max inter beat artefact (%): 50.00, R to other amplitude ratio: 3.00, R peak sign: positive, and Compute extra parameter: off\nFor the blood pressure settings (BP, Pressure settings) right-click at the \"BP analyzer\" window (Supplemental File 4). Set the parameters as detailed here. Noise removal filter width (ms): 10.00, Derivative filter width (ms): 6.00, Notch filter: 50.0 Hz, Spike removal filter: off, Validation threshold (cal. unit): 12.00, Rejection threshold (cal. unit): 8.00, Derivative at begin upstroke (cal U/s): 10.00, Rejection limits: off, Delay from reference ecg: user defined window, Min delay from ecg Rpeak (ms): 10.00, Max delay from ecg Rpeak (ms): 250.00, Conduct_time_1 from mark: not computed, Conduct_time_2 from mark: not computed, BR (breathing rate): off, BRS (Baroreflex sensitivity): on, Minimum consecutive beat number: 3, Latency beat number: 1, Pressure value: SBP, Mark to compute pulse interval: R, Minimum pressure variation (caIU): 0.50, Minimum interval variation (ms): 2.00, Minimum correlation: 0.75\nScreen the activity signal for a 3-h sequence with low activity. Perform the BRS analysis in this time window since high activity of the animals interferes with BP and RR correlation.\nPerform a BP and RR analysis during this 3-h time window while subdividing the 3-h analysis into 10 min steps.",
    "Perform BRS analysis by using the following sequence of commands: Open BRS analysis window > View > BRS analysis. This opens the BRS analysis panel. Manually inspect every sequence displayed in the BRS analysis panel and exclude ectopic beats, sinus pauses, arrhythmic events or noisy data. Make sure to invalidate every single beat of such sequences to successfully exclude them from the analysis.\nExport the results of the BRS analysis into a spreadsheet file (Results File). Modify the parameters that are exported to the spreadsheet file by using the following sequence of commands (Supplemental Files 5-7):\n\t\t\nTune > Parameters in list/to file > sections > txt (Supplemental File 5). Select the \" beats\" section and any other section containing information of interest except the invalidated beats section.\nTune > Parameters in list/to file > steps > txt (Supplemental File 6). Choose step values to be exported.\nTune > Parameters in list/to file > beats -> txt (Supplemental File 7).\nMake sure that the beats section of the file contains at least the following data for every single beat. ECG_RR, ECG_HR, BP_SBP, BP_BRS_deltaP, BP_BRS_# (=consecutive beat intervals of the sequence), BP_BRS_slope, BP_BRS_correl, BP_BRS_shiftl (=RR of the subsequent beat)\nThen click File > Save results file.\nSort the exported data for up and down sequences using the filter function of Excel (Supplemental File 8). Calculate the number of sequences, mean BRS slope, standard deviation and standard error of BRS slope for up and down sequences separately. Also calculate the total amount of sequences per 1000 beats.",
    "NOTE: A spreadsheet template (TemplateBRS) for automated sorting and analysis of up and down sequences is provided in the Supplement (Supplemental File 8) and facilitates the analysis. By adjusting the filter function, you can sort sequences by different beat numbers (e.g., three- or four-beat sequences). For further details see Supplemental files 9-13.\n\t\t\nOpen the Results File and the TemplateBRS Excel file (Supplemental File 8). Copy the data of the following columns from the Results File: (Pressure)_BRS_deltaP, (Pressure)_BRS_# and (Pressure)_BRS_slope (Supplemental File 9). Paste the data into the respective columns of the \"Up sequences\" and \"Down sequences\" spreadsheets in the TemplateBRS file (Supplemental File 10). Additionally, copy the data of the column (Pressure)_BRS_SBP from the Results File (Supplemental File 11) and paste it into the \"All sequences\" spreadsheet in the TemplateBRS file (Supplemental File 12).\n\t\t\tNOTE: The number in the (Pressure)_BRS_# column is listed only at the last beat of a sequence and depicts the sequence length. Up and down sequences can be distinguished by the sign of the (Pressure)_deltaP value. Negative values for the second and third beat of a three-beat sequence indicate a down sequence. Positive values indicate an up sequence, respectively.\nFilter the copied data with the default filter settings. Click on the filter icon of the (Pressure)_BRS_# column and press \"ok\" (Supplemental File 13). Apply this step to the \"Up sequences\" and \"Down sequences\" spreadsheets.",
    "NOTE: The spreadsheet filters for three-beat sequences. If other sequence lengths are requested the setting of this column has to be changed in the drop-down menu. Calculations for number of sequences, mean BRS slope, standard deviation and standard error of BRS slope are displayed in the green boxes of the \"Up sequences\" and \"Down sequences\" spreadsheets. Calculations for the total number of sequences per 1000 beats appear in the green box of the \"All sequences\" spreadsheet."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}