{
  "id": 8624,
  "origin_website": "Jove",
  "title": "Covalent Immobilization of Proteins for the Single Molecule Force Spectroscopy",
  "procedures": [
    "1. Immobilization of Proteins via Functional Silane Coupling Agents\nNote: Figure 1 gives an overview over the surface chemistry applied in this protocol.\nCAUTION: In the following protocol, different chemicals with corrosive and skin irritating properties are used. Wear adequate (acid-resistant) gloves, safety goggles, and laboratory coat and work under the fume hood while preparing solutions in order to avoid inhalation of vapors.\nFunctionalization of glass surfaces and silicon nitride cantilever with silane coupling agents\n\t\nRemove coarse dust and contaminations from glass slides with isopropanol and lint-free precision wipes and cut the slides in desired size (optional).\n\t\tNote: Beside glass, the solid surface can be silica, quartz, and the oxides of aluminum, copper, tin, titanium, iron, chromium, zirconium, nickel, and zinc.\n\t\tCAUTION: Cutting the glass slides may cause sharp edges.\nPlace the glass slides in a staining jar filled with hydrochloric acid (33% HCl) diluted with doubly distilled water (ddH2O) to 3 - 5% (v/v), close the jar with appropriate lid and place it in an ultrasonic bath for 90 min at room temperature.\n\t\tNote: The used jar has a diameter of 6 cm and an approximate size of 65-70 mL. An appropriate volume of diluted HCl for the jar is 50 mL containing 5 mL 33% HCl and 45 mL of ddH2O. The HCl effectively removes non-binding metal ions, especially sodium, potassium, and calcium and reduces the silicon in order to produce a hydroxyl saturated glass surface.\n\t\tCAUTION: HCl is corrosive and skin irritating. Wear adequate acid-resistant gloves, safety goggles and laboratory coat and work under the fume hood while preparing the solution in order to avoid inhalation of vapors.",
    "Place the silicon nitride AFM cantilever probes on a clean glass slide with the tip facing upwards and irradiate with ultra violet light from above for at least 90 min.\n\t\tNote: For single molecule force spectroscopy, cantilevers with a nominal spring constant of 0.01 to 0.1 N m-1 are suitable. Irradiation of the cantilever surface with UV light will remove organic contaminants, mainly fat substances, and render it hydrophilic on one side. If the other side is heavily contaminated - which should not be the case, or if the cantilever probes are used fresh out of the suppliers’ box - it may affect the SMFS measurement. A thorough cleaning of the whole cantilever chip using piranha solution, which has been used in many studies34, may help.\n\t\tCAUTION: UV light is harmful to the eyes; therefore, irradiation of the cantilever probes should be carried out in an UV light impermeable chamber. Piranha solution is highly reactive and may burn skin, paper and other organic material. Do not use plastic containers. If placed in dishes or jars even with small amounts of organic surface contaminations (e.g., from previous use), it may react rapidly.\nReplace the hydrochloric acid in the staining jar with ddH2O without letting the glass surface dry and place the jar back in the ultrasonic bath for another 10 min. Replace the water two more times for 10 min respectively to properly wash off the hydrochloric acid.\nIn the meantime, dissolve ethoxy (or methoxy) silane polyethylene glycol acid (Si(OC2H5)3-PEG-COOH) in a mixture of ethanol and ddH2O (v/v 95%/5%, pH 4.6 adjusted with acetic acid) to a final concentration of 0.1 mg mL-1. Store the solution hermetically sealed in order to avoid the evaporation of the ethanol.",
    "Note: Silane coupling agents are sensitive to moisture and temperature. Therefore, they should be stored under inert gas (N2), at low temperature (-20 °C) and under dry conditions. Before opening the flask, make sure that the silanes have reached room temperature to minimize hydration and thereby passivation of reactive groups. Heterobifunctional PEG coupling agents are available with numerous different functional groups and different spacer lengths. For random immobilization of proteins via their free amino groups (NH2), as described in this protocol, the functional group additional to the ethoxy/methoxy silane must be an NHS ester. Beside the purchase of a silane agent with NHS ester, a simple way to gain such NHS ester is to activate a carboxyl group (-COOH) with 1-ethyl-3-(3-dimethylaminopropyl) carbodiimid (EDC) and NHS (see 1.2.1. and 1.2.2.).\n\t\tCAUTION: Ethanol is flammable and skin irritating. Acetic acid is flammable and corrosive. Take care not to get reactive silanes onto skin or into eyes. Wear adequate gloves, safety goggles and laboratory coat and work under the fume hood in order to avoid inhalation of vapors.\nPour the silane solution in two separate Petri dishes, place the prepared cantilever probes and glass slides in one Petri dish respectively, seal hermetically (e.g., parafilm) to avoid evaporation of the ethanol and incubate stationary for 90 min at room temperature.",
    "Note: The optimal size of the Petri dish depends on the number of cantilever probes and the size of the glass slides which should be functionalized. A diameter size for good handling and low reagent volume is 50-60 mm. To avoid undesired bending of the cantilever while penetrating through the air water interface the cantilever should be held at a 90° angle to the air-water interface. The incubation of the glass slides (but not the cantilever probes) can optionally be carried out on an orbital shaker.\nRinse the cantilever and glass slides in three consecutive beakers containing pure ethanol to completely wash off the unbound silane compounds.\n\t\tNote: To avoid undesired bending of the cantilever while penetrating through the air water interface, the cantilever should be held at a 90° angle.\nPlace the functionalized glass slides in the staining jar and the cantilever on a clean glass slide and cure at 110 °C for 30 min.\n\t\tNote: Curing with heat induces the formation of covalent siloxane bonds and the removal of water. As the glass slides were only functionalized on the one side, make sure to properly indicate the coated side.\nStore the silanized glass samples and cantilever probes in a vacuum desiccator for up to one week.\n\t\tNote: The protocol can be paused here.\nRandom immobilization of proteins on silanized glass and silicon nitride cantilever\n\tNote: To avoid undesired bending of the cantilever, the cantilever probe should be held at a 90° angle while penetrating any air-water interfaces.\n\t\nPrepare a solution containing 42 mg mL-1 of EDC and 20 mg mL-1 NHS in standard phosphate buffered saline (PBS; 137 mM NaCl, 2.7 mM KCl, 10 mM Na2HPO4, 1.8 mM KH2PO4, pH 7.4).",
    "CAUTION: EDC is corrosive and skin irritating and can cause serious eye damage. Wear adequate gloves, safety goggles and laboratory coat.\nCover the silane coated glass slides with the solution and put silanized cantilever probes in a drop of the EDC/NHS solution and incubate for 10 min at room temperature.\n\t\tNote: For the incubation of the cantilever probes, the original cantilever box is suitable. To couple proteins via their free amino groups to the carboxyls (-COOH) of the heterobifunctional silane-PEG agents, the -COOH group is activated with the widely used EDC/NHS chemistry. EDC couples NHS to the carboxylic acid, forming a “stable” NHS ester which enables efficient conjugation to primary amines at physiological pH in a next step.\nRinse the cantilever and glass slides thoroughly with PBS in three consecutive beakers in order to completely wash off excessive EDC/NHS.\n\t\tNote: This washing step is critical as remaining EDC/NHS can crosslink proteins and thereby alter their functionality.\nIncubate the activated glass slides with and the cantilever probes in a droplet of the desired protein solution in a wet chamber at room temperature. The protein concentration and incubation time should be adapted to meet the requirements of the experiment. In general, a concentration between 0.5 to 1 mg mL-1 and incubation times from 30 min to 2 h are suitable for most proteins. In the case of fibronectin (on glass slide) and pilus-1 tip protein RrgA (on cantilever), a molar concentration of 1.5 µM and 3 µM, respectively, and an incubation time of 2 h are sufficient.\nWash the glass slides and the cantilever probes thoroughly with PBS in three consecutive beakers in order to wash off unbound proteins.",
    "Saturate the remaining NHS ester with tris(hydroxymethyl)-aminomethan by placing the probes in tris-buffered saline (TBS; 50 mM Tris, 150 mM NaCl, pH 7.6) for 20 min at room temperature.\n\t\tNote: This step reduces undesired covalent coupling of proteins between the functionalized surface of the AFM tip and the glass, because amino groups of Tris can bind to the remaining activated COOH groups on the cantilever and substrate surface.\nWash the glass slides and the cantilever probes thoroughly with PBS and store them in separate Petri dishes covered in PBS until use.\n\t\tNote: The samples should be prepared freshly and used the same day.\n2. Atomic Force Microscopy Based Single Molecule Force Spectroscopy\nNote: In this work, an atomic force microscope from JPK Instruments was used and the set ups for obtaining force-distance curves was defined with the Force RampDesigner.\nCantilever calibration with the thermal noise method35\n\tNote: For cantilever calibration, follow the step in the manual of the manufacturer. Most cantilever suppliers state an approximate spring constant, which is usually calculated from the nominal cantilever shape (length, width, thickness) and is therefore not very reliable. As the correct spring constant is crucial, it is advisable to carry out the cantilever calibration described below in triplicate and use the mean values of optical lever sensitivity and spring constant. It can be useful to record the cantilever deflection in volts (V) during the experiment and convert it to force (pN) afterwards, using the optical lever sensitivity and spring constant mean values. The spring constant and optical lever sensitivity can be determined before and/or after the experiment, as long as the laser position is not changed on the cantilever (the position of the reflected laser can be readjusted on the photodiode).",
    "Fix a clean, fresh glass slide on the AFM sample holder and cover it with PBS buffer.\n\t\tNote: The calibration should be carried out on a hard surface (e.g., glass) and in the same buffer as the actual experiments.\nFix the prepared cantilever probe at the cantilever holder, place it in the AFM head and carefully wet the cantilever with a drop of PBS buffer.\n\t\tNote: The wetting of the cantilever reduces the surface tension appearing during penetration in the PBS buffer on the calibration glass slide and thereby undesirable bending of the cantilever.\nSlowly move the cantilever towards the calibration surface until the cantilever is completely immersed in the PBS buffer but still away from the calibration surface.\nUse the top view optical microscope of the AFM or (if available) the inverted microscope underneath the AFM to position the laser of the AFM on the backside of the cantilever. Place the laser spot near the end of the cantilever close to where the tip is located.",
    "Note: The laser spot should be located close to the end of the cantilever, but it should still be completely on the cantilever. If no optical microscope is available, use a piece of paper for visible laser diodes or a laser detector card for infrared laser diodes, put it underneath the AFM head and move the laser spot towards the edge of the cantilever-chip, where the cantilevers are located, until you see the spot on the paper or detector card. Then move the laser parallel to the edge. When the spot disappears, it is on a cantilever arm. For linear cantilevers, move the spot towards the end of the lever arm until it appears on the paper/detector card and move it back until it is again on the lever arm (disappears from the paper/card). For triangular, place the spot in the middle between two arms of the cantilever and move it towards the end of the cantilever, until it disappears from the paper/card. Check that you are in the middle of the cantilever by moving the spot perpendicular to the long axis of the cantilever.\nAdjust the position of the four quadrant detector photodiode of the AFM in such a way that the reflected laser beam is positioned in the center of the photodiode.",
    "Note: Proceed as follows: Use the micrometer screws near the detector diode to move the diode in horizontal and in vertical direction, until the sum signal from all four quadrants is maximized. Then move the diode in vertical direction, until the vertical deflection signal is zero, and move the diode in horizontal direction, until the lateral deflection signal is zero. Silicon nitride cantilevers usually have a gold coating and are therefore a bimetal with two different coefficients of thermal expansion. This results in a thermal drift (apparent in the vertical deflection signal) especially in solution. To reduce this drift during measurements, let the whole system equilibrate for a few minutes before starting the calibration.\nOpen the calibration manager in the AFM software and calibrate the cantilever sensitivity and spring constant of the cantilever with the thermal noise method as follows.\nCarefully approach the substrate surface and record a force-distance curve.\nDetermine the optical lever sensitivity in nm/V by fitting a straight line to the steepest part of the retraction force curve, where the tip is in contact with the substrate surface. The sensitivity enables to convert the cantilever spring constant to pN/nm.\n\t\tNote: The slope of the retraction curve is the piezo travel distance vs. the change in photodiode voltage (measured in nm/V).\nRecord several thermal noise spectra of the cantilever with the cantilever approximately 100 µm or more away from the surface in order to exclude any surface damping.\nDetermine the spring constant of the cantilever in pN/V by fitting a harmonic oscillator provided by the AFM software to the thermal noise spectra.\nSlowly retract the cantilever and withdraw it from the solution.",
    "Substitute the glass surface used for cantilever calibration with the sample surface containing the immobilized proteins. Make sure that the cantilever and the sample surface (and thereby the proteins) do not dry while changing the glass slides.\nInteraction force experiments on the single protein level\n\t\nSlowly move the moist cantilever towards the sample surface until the cantilever is completely covered by PBS buffer but still away from the substrate surface.\n\t\tNote: To reduce the thermal drift during the experiment, let the whole system set for a few minutes before starting the force spectroscopy measurements.\nApproach the surface and record multiple force-distance curves (≥ 500) at different locations of the sample surface, with a contact force of 250 pN, a contact time of 1 s, a retraction length of 2 µm and a retraction velocity of 1 µm s-1.\n\t\tNote: For general force spectroscopy adjustments, follow the manufacturer’s manual. Variations: The retraction speed can be varied between 0.1 and 5 µm s-1 to calculate kinetical data depending on the increasing force load. The interaction time can be varied to analyze time dependent bond strengthening. Instead of keeping the retraction speed constant, one may keep the force constant (force clamp mode).\nData analysis\n\tNote: Data analysis was carried out using the data processing software. Depending on the immobilized proteins, the contact time or the retraction speed, whether a footprint was incorporated or not and other variable parameters, the force-distance curves contain multiple different information. Data analysis and interpretation can vary greatly between different SMFS experiments and can therefore not be described in detail here. As for the interaction of RrgA and Fn, the following protocol can be a first step for the analysis of SMFS data.",
    "Open the measured force curve files by selecting the Open Batch of Force Scan icon and process the force-distance curves as follows:\nConvert the cantilever deflection (V) to the directly proportional force (F) by selecting the (Re)Calibrate the V-deflection by Adjusting Sensitivity and Spring Constant icon.\n\t\tNote: If cantilever calibration was carried out before the experiment, the values are saved in the force scan files and are automatically used during calibration of the V-deflection. If the calibration was carried out after the experiment, the software uses default values, which can be changed to the measured values.\nSubtract the baseline of the retraction channel in a region of the force curve far from the surface to set the zero force level by selecting the icon Baseline Subtraction.\n\t\tNote: In some cases, the retraction may not have the same constant force value and the curve may display a linear tilt, which can be removed by selecting Offset + Tilt.\nDefine the point where the tip gets into contact with the sample by selecting the Contact Point Determination icon.\nConvert the height signal to tip-sample separation by selecting the Tip-Sample Separation icon. In addition to subtracting the contact point position, this procedure subtracts the cantilever bending to calculate the distance between substrate surface and AFM-tip.\n\t\tNote: For fitting polymer elastic models, like the extensible worm-like-chain model, and the determination of interaction lengths, the tip-sample separation, which is corrected for the cantilever bending, is needed. To determine the force loading rate from the slope of the force curve and the z-piezo velocity, the uncorrected force curves should be used.",
    "Screen the force-distance traces for force peaks occurring at rupture lengths above 70 nm (length of the stretched PEG spacer)36 to sort out nonspecific interactions and apply the extensible worm-like-chain model to the selected peaks by selecting the Fit a Polymer Chain Model icon and chose the Extensible Worm-like Chain Model. The peaks in the retraction force curve will be fitted with this model and rupture forces and lengths are obtained, together with the elastic parameters of the polymer.\nDisplay the data as histograms showing the force and length distributions. Use at least 100 unbinding events for the histograms."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}