{
  "id": 17190,
  "origin_website": "Jove",
  "title": "A Bright NIR-II Fluorescence Probe for Vascular and Tumor Imaging",
  "procedures": [
    "Animal experiments for NIR-II imaging studies were conducted at the Animal Experiment Center of Wuhan University, which has been awarded the International Association for Experimental Animal Care (AALAC). All animal studies were conducted following the China Animal Welfare Commission Guidelines for the Care and Use of Experimental Animals and approved by the Animal Care and Use Committee (IACUC) of the Animal Experimental Center of Wuhan University.\nFemale BALB/c nude mice (~20 g) at 6 weeks of age were used for the present study.\n1. NIR-II imaging preparation\nPlace commercially available black cardboard (see Table of Materials) in the center of the carrier. Then, place the sample on top of the black cardboard, so that the sample is in the center of the carrier (a stage located in the imaging device).\n\tNOTE: Compared with white cardboard, black cardboard has less background interference during NIR-II imaging.\nSelect a suitable filter based on the wavelength of the NIR-II probe. Press long (>2 s) to control the box area (such as 900 LP) corresponding to the filter model in the screen interface when the system moves the filter into the optical imaging path.\nLong press platform up on the touch screen interface of the carrier console control area so that the carrier consoles up; long press platform down so the carrier consoles down.\nAdjust the platform height to \"0 mm\" (height adjustment) and use automatic focusing to make the NIR-II image clear.\n2. Synthesis of NIR-II dye (HLY1)\nWeigh the raw materials required for the synthesis experiment. Ensure they do not deteriorate.",
    "Add Compound 1 (200 mg, 0.18 mmol), PdCl2(dppf)2CH2Cl2 (28 mg, 0.04 mmol), N-phenyl-N-(4-(4,4,5,5-tetramethyl-1,3,2-dioxaborolan-2-yl)phenyl)naphthalen-2-amine (170 mg, 0.4 mmol), and K2CO3 (46 mg, 0.34 mmol) to tetrahydrofuran (THF) solution in a 25 mLround-bottom flask. Stir the mixture for 4 h at 75 °C under N2 atmosphere (Figure 1A).\n\tNOTE: For the synthesis procedure of Compound 1 and N-phenyl-N-(4-(4,4,5,5-tetramethyl-1,3,2-dioxaborolan-2-yl)phenyl)naphthalen-2-amine, refer to Li et al21. The chemical structures are shown in Figure 1A.\nAfter cooling to ambient temperature, quench the reaction with distilled (DI) water (80 mL), and extract the mixture with DCM (dichloromethane)/H2O (30 mL) (three times). Purify the crude product by column chromatography16 (petroleum ether:DCM = 10:1) to make HLY1 a green solid (78 mg, 30% yield).\nPlace the dye HLY1 under the protection of nitrogen in the refrigerator for later use. This can be stored for up to 6 months.\n3. Preparation of water-suspensible nanoprobe\nWeigh HLY1 (1 mg) and amphipathic encapsulation materials, 1,2-distearoyl-sn-glycero-3-phosphoethanolamine-N-[amino(polyethylene glycol)-2k (DSPE-PEG2k, 10 mg; see Table of Materials).\nPrepare HLY1 dots20 by employing DSPE-PEG2k as an encapsulation matrix (nanoprecipitation method12) (Figure 1C). Dissolve HLY1 in THF (1 mL) and slowly add into a beaker containing DSPE-PEG2k aqueous solution (9 mL) with sonication at 25 °C. Subsequently, remove THF from the mixture by dialysis20.\nConcentrate the above solution centrifugally with ultrafiltration18 (7100 x g for 10 min) and then place it in a 4 °C refrigerator for future use. This can be stored for up to 1 month.\n\tNOTE: The nanoprobe aqueous solution loaded by DSPE-PEG2k should be stored above 0 °C and used as soon as possible.\n4. Construction of tumor-bearing mice",
    "Culture 4T1 mouse breast cancer cells (4T1) in Dulbecco's Modified Eagle Medium (DMEM), supplemented with 10% (v/v) fetal bovine serum (FBS) and 1% (v/v) penicillin-streptomycin (see Table of Materials), and maintain in a humidified incubator with 5% CO2 at 37 °C.\nFor the NIR-II fluorescent imaging experiment, culture 4T1 cells (5 x 107) for 24 h, digest with trypsin (1 mL), and wash twice with serum-free DMEM (4 mL).\nAnesthetize the mice by treating with isoflurane (2%). Confirm adequate anesthetization by stimulating the toes or the soles of the feet of the mice, and observe whether the mice respond. If there is no response, it means that the anesthesia is sufficient32.\nThen, using an insulin injection needle, inject the 4T1 cell mixture into the mice through subcutaneous injection (100 µL).\n\t​NOTE: NIR-II imaging studies were performed ~2 weeks after inoculation, when the tumor had grown to a volume of ~100 mm3. Before NIR-II tumor imaging, please confirm the tumor size. The tumor size was estimated by an electronic vernier caliper for the present study11.\n5. In vivo NIR-II fluorescence imaging\nAnesthetize the mice by treating with isoflurane (2%) and perform NIR-II imaging of the whole body of the mice using an optical NIR-II imaging system (see Table of Materials).\n\tNOTE: Pay attention to the dosage of anesthetic to avoid mice death. Generally, anesthesia lasts for 5-10 min. Stimulate the toes or the soles of the feet of the mice, and observe whether the mice respond. If there is no response, it means that the anesthesia is sufficient.",
    "Take a solution of HLY1 dots (0.8 mg/mL, 200 µL). Inject the HLY1 dots intravenously into the anesthetized mice, and 3 min later, perform NIR-II fluorescence imaging of the blood vessels of the whole body of mice using an NIR-II imaging system. Focus further on the mouse's head to collect brain vascular imaging.\n\tNOTE: Use clean experimental gloves during imaging, which will help to obtain clean NIR-II images.\nCollect the images 5 min after the injection of HLY1 dots in mice, and process the data using ImageJ software. The instrument parameters of the optical NIR-II imaging system are 90 mW/cm2 (808 nm laser).\nOn completion of the experiment, euthanize the animals following institutionally approved protocols.\n\tNOTE: For the present study, the animals were euthanized by exposing them to excess isoflurane32.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}