{
  "id": 17919,
  "origin_website": "Jove",
  "title": "Modified Heterotopic Hindlimb Osteomyocutaneous Flap Model in the Rat for Translational Vascularized Composite Allotransplantation Research",
  "procedures": [
    "All animal surgeries were performed in accordance with protocols approved by the University of Louisville's Institutional Animal Care and Use Committee (IACUC-approved protocol 18198) and the National Institutes of Health (NIH) Guide for the Care and Use of Laboratory Animals10. Four-month-old male Brown-Norway (RT1.An) and 4-month-old male Lewis (RT1.Al) rats were used as VCA donor and recipients, respectively.\n1. Donor Allograft Harvest\nSedate the donor animal using vaporized isoflurane applied through a chamber.\nShave the graft donor area (hindlimb), as well as the groin and abdomen areas. Following that, treat with depilatory cream in order to reduce the amount of fuzz left by the clippers.\nDeeply anesthetize donor animals using intraperitoneal (IP) ketamine (60 mg/kg)/xylazine (15 mg/kg)/acepromazine (2 mg/kg). Administer an initial dose of 0.2 mL/100 g of body weight and additional doses of 0.2 mL every h. For convenience, it is optional to perform this step before step 2.\nContinuously monitor animals while under anesthesia for respiration, body temperature, and depth of anesthesia, using the toe pinch withdrawal reflex test.\nAdminister 30 U of heparin solution subcutaneously (SC) in the scruff area prior to the surgery to prevent clotting.\nWear a mask, a head cover, a disposable isolation gown, and disposable gloves.\nPlace the donor animal supine on a heating pad. Produce a sterile surgical field by prepping, scrubbing, and draping the surgical area including the both ventral and dorsal aspects of the leg. Don sterile gloves.\nMake a 3 cm skin incision in the groin concavity using scalpel blade #15 and reflect the inguinal fat pad laterally using iris scissors.\nExpose the common femoral vessels and place a wire hook with an elastic band to retract the abdominal muscles.",
    "Using a dissecting microscope (40x), dissect the pedicle proximally from the emergence of the common femoral vessels under the inguinal ligament and distally to the confluence of popliteal vessels into the graft.\nUsing microclips and bipolar jewelers’ forceps, ligate and divide the large arterial and venous branches, such as lateral circumflex femoral vessels, superficial caudal epigastric vessels, the saphenous artery, and proximal caudal femoral vessels, to mobilize the main femoral vessels. Cauterize any small branches using fine bipolar forceps.\nMake a skin incision from the center of the previous skin cut along the ventral side of the hindlimb, to the ankle area, using iris scissors.\nCut the gracilis muscle, as well as the other adductor muscles underneath it, in a vertical fashion to expose and ligate the medial proximal genicular vessels, deep-branching small vessels, and the sciatic nerve.\nNOTE: At this point, on a separate surgical table, the other surgeon should intubate and anesthetize (2.5%–3% isoflurane) the recipient animal; this allows the surgeons to prepare the recipient surgical site in time for graft placement and minimize the graft's ischemic time.\nOn the donor animal, make circumferential skin incisions at the level of the knee and ankle. Disarticulate the knee and ankle, remove extraneous muscle and tissue, and make a vertical skin incision on the dorsal side of the hindlimb to free the graft. At this point, the graft (composed of fibula and tibia, covered with related muscles and skin island nourished by its perforators) is connected only by the pedicle.\nPlace small clamps as proximally as possible on the femoral artery and vein, and cut the pedicle as proximally as possible, near the inguinal ligament.\nTo flush the graft of blood, inject heparinized saline (30 U/mL) into the femoral artery using a 27 G flushing blunt cannula.",
    "NOTE: Dilating the artery prior to the heparin flush allows easy access for insertion of the cannula. During the flush, closely monitor the outflow from the femoral vein. Once clear fluid exits the femoral vein, stop the flush.\nWrap the isolated graft in warm saline-soaked gauze and transport it immediately to the recipient animal’s table. At this time, the recipient surgical site should already be prepared for vascular anastomosis.\nAfter the graft harvest, immediately euthanize the donor rat via pneumothorax.\n2. Recipient Transplantation Surgery\nFollowing the sedation induction using vaporized isoflurane applied through a chamber, deeply anesthetize the recipient animal via a ventilator-controlled endotracheal tube and 2.5%–3% isoflurane.\nNOTE: At this stage, the donor rat is still anesthetized.\nContinuously monitor the heart rate, respiratory rate, body temperature, and depth of anesthesia of the recipient animal, using the toe pinch withdrawal reflex test.\nIn order to prevent dehydration and hypoglycemia, inject 2 mL of lactated Ringer’s solution and 2.5% dextrose subcutaneously at the beginning and another 2 mL at the end of the surgery.\nShave the groin area, then treat with depilatory cream in order to reduce the amount of fuzz left by the clippers.\nWear a mask, a head cover, a disposable isolation gown, and sterile gloves.\nPlace the animal supine on a heating pad. Apply ophthalmic ointment to prevent corneal abrasions during anesthesia. Produce a sterile surgical field by prepping, scrubbing, and draping the surgical area.\nMake a 3 cm skin incision in the groin concavity using scalpel blade #15 and reflect the inguinal fat pad laterally using iris scissors.\nExpose the common femoral vessels and place a wire hook with an elastic band to retract the abdominal muscles.\nLigate and divide Murphy branches.",
    "Using 10-0 nylon interrupted sutures, anastomose donor vessels to recipient vessels via venous end-to-side technique and arterial end-to-end technique. Gradually release the clamps from the artery and then the vein. Monitor the anastomotic sites for bleeding and add additional sutures if needed.\nVisually assess the vascular anastomosis in order to assure effective graft reperfusion.\nInset the graft into the inguinal pocket and orient it upside down, with the ankle joint superior and knee joint inferior.\nUsing tucking sutures, secure the graft to adjacent muscles. Close the skin via interrupted horizontal mattress skin absorbable 4-0 sutures.\nRemove the recipient animal from anesthesia and wean it off the ventilator. Place the animal on a heating pad for thermal support.\nNOTE: The overall operation time is between 3 to 4 h, depending on the surgeon’s experience and acquaintance with the surgical procedure.\nAdminister meloxicam (1 mg/kg) subcutaneously for pain suppression and monitor until the animal is fully recovered and mobile.\n3. VCA recipient Monitoring\nHouse the recipient rats singly and monitor them daily for clinical signs of pain, dehydration, weight loss, and decreased activity in addition to surgical failure (for the first 48–72 h) or rejection. Administer meloxicam subcutaneously (1 mg/kg) daily for the first 3 days for pain suppression.\nBased on the research endpoint, choose an immunosuppressant drug to be administered.\n4. Histology\nUnder inhaled isoflurane anesthesia (2.5%–3%), obtain the serial skin and underlying muscle biopsies from the donor graft at desired time points. The skin should be scrubbed and draped prior to obtaining a biopsy, and a sterile field and technique should performed.\nClose the wound with one to two stitches, using absorbable 4-0 sutures. Return the animal to its cage and allow it to recover from the anesthesia.\nFix the biopsied tissues in separate tubes in 10% formalin.",
    "At the terminal time point and under inhaled isoflurane anesthesia (2.5%–3%), take a larger skin biopsy that spans the donor/recipient border. Carefully locate the vessel leash pair at the site of anastomoses; the proper site will be apparent due to the sutures. Take the desired vessel samples from the artery and/or vein. Fix all samples separately in 10% formalin. After collection of tissue samples, and while the animal is still under isoflurane anesthesia, immediately euthanize the animal via pneumothorax.\nUsing a tissue processor (or other preferred embedding technique), paraffin-embed each biopsy into its own block. For skin samples, orient the tissue so that all epidermal and dermal layers may be seen in a single slice. For vessel samples, orient the vessels so that cross sections may be obtained.\nUsing a microtome, cut 6 µm-thick sections and apply them to slides for hematoxylin and eosin (H&E) staining.\nStain for H&E using a standard protocol.\nObtain representative images of all desired tissue samples using brightfield microscopy techniques.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}