{
  "id": 3745,
  "origin_website": "Cell",
  "title": "Whole-mount staining coupled to a UV-inducible basal cell carcinoma murine model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBuffer preparation\nPreparation of solutions to perform whole-mount immunostaining.\nFixation solution: 4% formaldehyde. For 1 L of 4% formaldehyde, heat 800 mL of PBS to 60°C in a beaker and keep it on heat plate at 60°C in a ventilated hood. Add 40 g of paraformaldehyde powder to the heated PBS solution. Slowly raise the pH to 7 by adding 1 N NaOH dropwise from a pipette until the solution clears. Once the paraformaldehyde is dissolved, adjust the volume of the solution to 1 L with PBS. The solution can be aliquoted and frozen or stored at 2°C–8°C for up to 1 month.\n20% sucrose solution: For 200 mL of 20% sucrose, add 200 mL of 1× PBS to a glass beaker on a stir plate. Add 40 g of sucrose powder to the PBS solution. Stir until dissolved. Stored at 2°C–8°C for up to 1 month.\nBlocking solution: 1× PBS, 0.5% Triton X, 2% bovine serum albumin (BSA), 20% normal goat serum (NGS), 1% dimethyl sulfoxide (DMSO), 100 mM maleic acid (pH 7.5). For 10 mL of blocking solution, dissolve 0.2 g of BSA in 6.85 mL of PBS, then add 50 μL of Triton X, 2 mL of NGS, 100 μL of DMSO, and 1 mL of 1 M maleic acid (pH 7.5).\nDiluent solution: 1× PBS, 0.5% Triton X, 2% bovine serum albumin (BSA), 1% dimethyl sulfoxide (DMSO), 100 mM maleic acid (pH 7.5). For 10 mL of diluent solution, dissolve 0.2 g of BSA in 8.85 mL of PBS, then add 50 μL of Triton X, 100 μL of DMSO, and 1 mL of 1 M maleic acid (pH 7.5).",
    "Washing solution: 1× PBS, 0.5% Triton X, 0.5% Tween 20. For 1 L of washing solution, add 5 mL of Triton X and 5 mL Tween 20 in 990 mL of PBS.\n4,6-Diamidino-2-phenylindole (DAPI) solution: For 1 mL DAPI solution, add 1 μL of DAPI in 999 μL of 1× PBS (1/1000 from a 14.3 M DAPI stock solution).\nWhole-mount immunofluorescent staining\nTiming: 4 days\nProtocol for florescent whole-mount cytokeratin 17 immunostaining to address the spatiotemporal dynamics of BCC formation.\nNote: we typically use the following timeline: day 1, steps 1–6; day 2, steps 7–11; day 3, steps 12–16; day 4, steps 17 and 18.\nCollect skin from the storage place:\n.After the excess of sucrose is removed, place the skin in a Petri dish\n.If the skin was stored at −80°C, put the tissue in a Petri dish. Leave it between 20°C and 25°C for at 20 min or until the tissue is thawed.\nPlace the skin in a Petri dish. Use the scalpel to gently scrape away the fat and blood vessels covering the dermis until the dermis is clearly and uniformly exposed. Note that the dermis has a dull appearance whereas fat is shiny and reflective (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/465-Fig3.jpg\nFigure 3. Preparing skin for whole-mount fluorescent staining step 2\n(A) Epidermis has a dull appearance. Hypodermis (fat) is shinny and reflective.\n(B) Gently scrape away the hypodermis (fat) and blood vessels using a scalpel. Dermis has a dull appearance.\nUsing the scalpel, prepare small pieces of back skin (5 mm2 maximum) for staining of specific antigens.\nPlace the samples in a 1.5 mL Eppendorf tube with 500 μL of blocking solution.",
    "Gently mix the samples and solution by rocking the tube on a tube roller mixer between 20°C and 25°C for 5 h. Make sure that the samples are covered in solution before leaving to incubate. A minimal speed of the roller mixer is not required but the speed as to be adjusted to avoid the tubes failing from the roller mixer.\nTransfer the samples to a new Eppendorf tube with 200 μL primary antibody diluted in diluent solution. Gently mix the samples and solution by rocking the tube on a tube roller mixer at 4°C between 14 h and 16 h.\nPlace the samples in a new Eppendorf tube with 300 μL of washing buffer.\nPlace tubes on a tube roller mixer between 20°C and 25°C for 30 min.\nRepeat steps 13 and 14 three times.\nPlace the skin pieces in a new Eppendorf tube containing 300 μL secondary antibody diluted in diluent solution.\nCritical: From here forward, make sure tubes are placed in a dark chamber or covered with aluminum foil as the light can affect the fluorescence of the fluorochrome. Moreover, to avoid any damages of the tissue, collect the tissues with the minimum of pressure when using the forceps. Plastic forceps may also help. It is also recommended to collect the tissue by one of the corners to minimize the damaged surface of the tissue if you have damage.\nGently mix the samples and solution by rocking the tube on a tube roller mixer at 4°C between 14 h and 16 h.\nPlace the samples in new Eppendorf tube with 300 μL of washing buffer.\nPlace tubes on a tube roller mixer between 20°C and 25°C for 30 min.\nRepeat steps 18 and 19 five times.",
    "Place samples in a new Eppendorf tube with 300 μL of DAPI solution.\nGently mix the samples and solution by rocking the tube on a tube roller mixer at 4°C between 14 h and 16 h.\nPlace samples in a new Eppendorf tube with 100 μL of clearing buffer.\nLeave the samples incubating for at least 3 h between 20°C and 25°C\nCritical: Prolonged incubation in clearing buffer will harden the tissue and lead to difficulty in mounting.\nMount tissue on concave slide\nTiming: 5 min/slide\nRemove the excess of clearing buffer with a tissue and put the skin pieces in the middle of a concave slide. Up to four pieces of 5 mm2 can be mounted on a single slide (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/465-Fig4.jpg\nFigure 4. Up to four pieces of 5 mm2 can be mounted on a single slide\nUsing a fluorescent microscope, make sure the epidermis is facing up (Figure 5[href=https://www.wicell.org#fig5], left image). Flip pieces that are not properly orientated.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/465-Fig5.jpg\nFigure 5. Representative images of skin counterstained with DAPI\nPhotomicrographs represents 2D optical section from a Z stack acquisition of whole-mounted skin displaying nucleus (DAPI). Left image: epidermis. Right image: dermis. Stars indicate the hair follicles (scale bar, 50 μm).\nNote: The orientation of the tissue can be chosen depending on the targeted area. Dermis can face up if you want to analyze dermis area, deep part of hair follicles, blood vessels (Figure 5[href=https://www.wicell.org#fig5]).\nCover the samples with 2–3 drops of mounting media.\nNote: Hardset mounting media is not recommended as hard tissue is difficult to mount and always results in air bubbles. It also prevents the reorientation of the tissue if acquisition of images from both epidermis and dermis is required.",
    "Gently apply the coverslip at an angle to avoid bubbles. Add a light pressure on the coverslip to evenly spread the mounting media and remove bubbles from the tissue. It is fine if some bubbles persist on the side of the tissue.\nUse nail polish to seal the coverslip on the slide."
  ],
  "subjectAreas": [
    "Microscopy",
    "Model Organisms",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}