{
  "id": 11912,
  "origin_website": "Jove",
  "title": "Defining Gene Functions in Tumorigenesis by Ex vivo Ablation of Floxed Alleles in Malignant Peripheral Nerve Sheath Tumor Cells",
  "procedures": [
    "Prior to performing any procedures with mice, all procedures must be reviewed and approved by the Institutional Animal Care and Use Committee. The protocol described in this manuscript was approved by the Institutional Animal Care and Use Committee of the Medical University of South Carolina. This protocol was performed by properly trained personnel following MUSC's institutional animal care guidelines.\n1. Generation of mice that develop MPNSTs homozygous for Erbb4 flox alleles\nProduce the F1 generation of P0-GGFβ3;Trp53+/-;Erbb4fl/+ animals by mating P0-GGFβ3;Trp53+/- mice7 with Erbb4fl/fl mice11. Use a Punnett square (Figure 1) to guide the breeding scheme to ensure that enough male and female F1 pups are generated with the desired P0-GGFβ3;Trp53+/-;Erbb4fl/+ genotype.\nGenotype F1 offspring by isolating genomic DNA from a tail snip collected in accordance with IACUC guidelines and then perform PCR using previously described primers to detect the P0-GGFβ3 transgene12, Trp53 wild type (+) and null (-) alleles7, and Erbb4flox and Erbb4 wild-type alleles13.\n\t\nIsolate tail DNA using methods detailed on jacks-lab.mit.edu/protocols.\nMake the PCR reaction mix with 25 ng DNA, 0.25 nM dNTPs, 0.02 U/µL Taq, 0.5 µM of each primer, and 1x PCR buffer. Perform PCR reaction with a single 95 °C incubation (to melt the genomic DNA and activate Taq) for 1 min followed by 35 PCR cycles of 94 °C, 10 s (melting); 55 °C, 30 s (annealing); 72 °C, 40 s (extension) followed by a single 72 °C (extension) for 5 min. Store the reactions at 4 °C until ready to run on a 1.2-1.5% agarose gel.\n\t\tNOTE: Annealing temperature depends on the PCR buffer system used; performing an annealing temperature gradient to determine the proper annealing temperature is recommended.\nProduce the F2 generation of P0-GGFβ3;Trp53+/-;Erbb4fl/fl animals by mating the appropriate F1 progeny (P0-GGFβ3;Trp53-/+;Erbb4fl/+) with each other.",
    "NOTE: Figure 1 illustrates the Punnet square predictions used to calculate the expected number of F2 offspring with the desired genotype.\nIdentify animals with the desired P0-GGFβ3;Trp53-/+;Erbb4fl/fl genotype as described in step 1.2.\nMate F2 progeny to each other to maintain the P0-GGFβ3;Trp53-/+;Erbb4fl/fl colony and genotype all the pups. Confirm that the newly introduced floxed allele does not compromise survival or tumor latency. Achieve this by establishing cohorts (20 mice/cohort) of P0-GGFβ3;Trp53+/- and P0-GGFβ3;Trp53+/-;Erbb4fl/fl mice and follow their survival and frequency of tumor occurrence.\nMonitor animals several times per week until the experimental endpoint is reached (maximum allowable tumor size/humane endpoint approved by IACUC).\n\t\nDuring the weekly monitoring, assess body weight, normal social and grooming behavior, and tumor size measurements. Arrange for veterinary assessment in case of weight loss of >10% of body weight, social seclusion, and hunching.\nWhen a tumor-bearing mouse is identified and has reached its humane endpoint, humanely euthanize the animal using carbon dioxide inhalation followed by cervical dislocation and sterilely remove the tumor using a scalpel knife. Take tumor measurements by measuring length, width, and depth using a caliper and weight tumor (mass and volume). Work quickly to avoid autolysis.\nSection the tumor into three sections using breadloaf style cuts with a scalpel knife under sterile conditions to generate tissue segments for formalin fixation/paraffin-embedding (FFPE), early passage culture generation, and flash-frozen material (Figure 2A).\n\t\nEnsure that Section 1 (for early passage culture generation, step 1.7.2) is approximately 10% of the total tumor volume, Section 2 (for fixation and IHC, step 1.7.3) is 70% of the total tumor volume, and Section 3 (for flash freeze, step 1.7.4) is 20% of the total tumor volume.\nTake section 1 of the tumor for the preparation of early passage cultures (see below).",
    "Fix section 2 of the tumor in 4% paraformaldehyde overnight at 4 °C and then embed in paraffin (formalin-fixed paraffin-embedded (FFPE) for diagnostic workup.\nFlash-freeze section 3 for analytical analyses (e.g., immunoblots to verify that protein encoded by the targeted floxed gene is appropriately expressed).\nStain 5 µm-thick FFPE tissue sections with hematoxylin and eosin (H&E) to confirm the tumor diagnosis by a qualified pathologist.If appropriate, perform immunohistochemical staining (IHC) to confirm the tumor diagnosis.\n\t\nImmunostain MPNSTs for S100 calcium-binding protein B (S100β), nestin, and sex-determining region Y (SRY)-Box transcription factor 10 (Sox10)-three markers that are expressed in both MPNSTs and Schwann cells (tumor cell origin)5,6,14,15. Stain the tumors with antibodies recognizing erbB4, the protein encoded by the gene targeted for ablation in downstream steps.\nTo confirm the diagnosis, have a qualified veterinary or human pathologist assess all stained tumor slides following WHO diagnostic and grading criteria5,6,7,16.\n2. Ex vivo ablation of floxed Erbb4 alleles in MPNST cells\nEstablish early passage cultures from freshly collected MPNST tissue by placing the tissue from section 1 (step 1.7.3) in 10 mL of ice-cold sterile phosphate-buffered saline (PBS) on ice and then transferring it to a sterile work area (Figure 2B)16.\n\tNOTE: All subsequent procedures are to be performed in a sterile tissue culture hood.\nMince the tumor tissue into 2-4 mm pieces and triturate 8-10 times in a 10 cm2 treated tissue culture dish with 10 mL of growth medium. Culture these preparations in high glucose DMEM-10 growth medium (Dulbecco's modified Eagle's medium (DMEM) containing 10% fetal calf serum, 1% glutamine, 10 µg/mL streptomycin, and 10 IU/mL penicillin) supplemented with 10 nM neuregulin-1β (NRG1β) and 2 µM forskolin. Add forskolin at this stage to inhibit the growth of common contaminating cell types such as fibroblasts.",
    "Maintain the mechanically dissociated tissue and cells for up to 3 days at 37 °C in a 5% CO2 atmosphere to establish an early passage culture. Do not separate dispersed cells and remaining tissue fragments at this point.\nRefresh the cultures with new medium every 3-4 days. Allow the tumor cells to proliferate until they are confluent.\nExpand the early passage cultures by splitting the confluent cultures into several dishes. Remove the growth medium and wash cells with 1x dPBS. Then, add 1 mL of 0.25% trypsin for 2-5 min at room temperature per 10 cm2 treated cell culture dish. Gently triturate the culture to facilitate detachment and generate a single-cell suspension.\n\t\nTerminate the trypsinization by adding 2 mL of DMEM-10 growth medium. Collect the trypsinized cell mixture and transfer it to a 5 mL sterile centrifuge tube. Pellet the cells by centrifugation for 5 min at 500 × g at room temperature.\nResuspend the cell pellet in 5 mL of DMEM-10. Split the cells into two to four 10 cm cell culture dishes, each containing 10 mL of growth media (approximately 1 × 106 cells per dish).\nAfter 5 passages (repeating steps in 2.5), use growth medium without NRG1β and forskolin. Immunostain a sample of the culture with an anti-S100β antibody to verify that the culture is composed solely of tumor cells. Maintain the cells in DMEM-10 growth medium in all subsequent passages.\nAt the next passage, count the cells and freeze down a portion of P0-GGFβ3;Trp53+/-;Erbb4fl/fl MPNST cells collected from confluent cultures (3 × 106 cells/vial).\nPlate P0-GGFβ3;Trp53+/-;Erbb4fl/fl early passage MPNST cells at a density of 1.5 × 106 cells per 10 cm treated cell culture dish in DMEM-10 growth medium.",
    "Day 0: (Approximately 12-16 h after plating), wash the adherent cultures with 2-4 mL of dPBS and infect with Ad5CMV-Cre/eGFP or Ad5CMV-eGFP at approximately 400 plaque-forming units (pfu)/cell in 10 mL of serum-free DMEM (i.e., 30 µL of 2 × 1010 pfu of virus per 10 cm dish). Ablate the floxed Erbb4 alleles using the adenovirus at the maximum tolerated virus concentration (multiplicity of infection, MOI), as determined empirically. Refer to Figure 2C for a schematic of the workflow for this ablation.\nDay 1: Approximately 16 h later, rescue the cultures by adding 10 mL of DMEM-10 to the infection cocktail.\nDay 2 - 3: FACS sort infected cells following the recommended protocol from the core facility to sort eGFP-positive cells approximately 48 h after infection. Prior to FACS sorting, briefly check cells for eGFP signal on a fluorescence microscope to ensure that the cultures have been efficiently infected (~50-100% positive cells). Return cells recovered after FACS to 10 cm tissue culture dishes; reserve one dish for genomic DNA isolation.\nDay 4 - 5: After FACS sorting, let the cells recover in a tissue culture incubator for at least 24-48 h and then prepare the cells for in vitro cell-based analyses or in vivo grafting. Confirm Erbb4 deletion via PCR using genomic DNA isolated from a portion of the sorted eGFP-positive cells. Verify that eGFP-positive cells are ErbB4-negative by PCR or by immunostaining a sample of the culture with an anti-erbB4 antibody.\n\t\nIsolate genomic DNA from the cells using standard acid-guanidinium-phenol and chloroform-based DNA isolation method17.",
    "Perform standard PCR to distinguish floxed Erbb4 alleles and ablated Erbb4 alleles. Perform 40 cycles with 2 ng DNA, 20 µM primers 1 + 2 to produce a 250 bp Erbb4-null product and a 350 bp floxed product13. Perform both PCR and antibody-based approaches to confirm knockout when no reliable antibodies are available.\n\t\t​NOTE: Cells are ready for in vitro cell-based assays as described below. Many types of downstream analyses can be performed with cells prepared in this manner. The purpose of the protocols presented below is to provide a few examples of in vitro and in vivo applications of these tumor cells post-ablation of the Erbb4 gene.\n3. Proliferation and viability assays in MPNST cells with ablated Erbb4 alleles\nPerform proliferation assays over the next seven days on sorted MPNST cells plated in a multiwell plate using an image-based automated cytometer.\n\t\nDay 6: Plate 2,000 cells per well in a final volume of 150 µL (~13,300 cells/mL) of growth medium in a 96-well plate. Perform measurements in triplicate for each experimental cohort and 4 daily endpoint reads (3 replicates x 2 conditions x 4 days).\nDays 7, 9, 11, 13: Stain cells with Hoechst and propidium iodide (PI) dyes and image them on an automated plate reader to count the number of live and dead cells in each well. To achieve this, simultaneously stain the cells with Hoechst dye to stain the nuclei of both living and dead cells and with propidium iodide (PI) to label the dead cells. Perform all reads at the same time every day or every other day.",
    "Add 50 µL of a 4x PI/Hoechst staining solution (4 µg/mL each) to each well quantified that day (e.g., Day 7 only), and incubate for 30 min at 37 °C in the tissue culture incubator. Keep the plate protected from light.\n\t\t\tNOTE: The staining concentration of Hoechst needs to be empirically determined and can range from 1 to 10 µg/mL depending on the cell type.\nRead the stained wells after incubation using the appropriate fluorescent channel on the automated cell imager. After reading, return the plate to the incubator for future reads on subsequent days (i.e., Days 9, 11, 13).\nQuantify the staining intensities based on the imaging system used and calculate the number of dead cells, living cells, and total cells using the following settings: blue channel (377/50 nm, Hoechst): total cells (live and dead); red channel (531/40 nm, PI): dead cells only; blue - red (total - dead) = live cells.\nPerform the cell viability assay over three days, if desired, following the assay manufacturers' protocol.\n\tNOTE: Viability assays can be combined with proliferation assays by performing a triple stain including calcein AM (488/32 nm; green channel, specifically labels living cells), PI, and Hoechst. An apoptosis assay may also be performed using cultures set up as described above; the specific protocol will depend on the imaging system.\n\t\nDay 6: Plate 4,000 cells per well in a final volume of 150 µL in a 96-well plate in triplicate.",
    "Days 7 - 9: Add 2,000x bioluminescent cell viability assay reagents (Table of Materials), return the plate to the incubator, and read the plate 1 h later. Perform subsequent reads at the same time every day. For the bioluminescence (MTT) assays, perform the assay exactly as outlined in the manufacturer's instructions every 24 h for 72 h using a luminometer plate reader.\n4. RNA-Seq analyses and identification of genes whose expression is altered by Erbb4 loss\nDay 6: Isolate total RNA from sorted MPNST cells using standard acid-guanidinium-phenol and chloroform-based methods. For experiments designed to detect changes in mRNA levels between two cohorts, prepare total RNA from at least three biological replicates in each cohort.\n\t\nTo eliminate events caused by the adenoviral vector or eGFP expression rather than Erbb4 loss, isolate RNA from three biological replicates of P0-GGFβ3;Trp53+/-;Erbb4fl/fl MPNST cells transduced with Ad5CMV-Cre/eGFP and three biological replicates transduced with Ad5CMV-eGFP.\n\t\tNOTE: Isolated RNA must have an RNA integrity number (RIN) score ≥ 8 for RNA-Seq analysis. Ensure that the sequencing core determines the RIN of all samples prior to constructing libraries.\nUse 100-200 ng of high-quality total RNA from each sample to prepare RNA-Seq libraries (work with the core sequencing facility for this step). Perform high-throughput sequencing using a next-generation DNA sequencer. For mRNA quantification, perform single-ended sequencing to generate Fastq files. Ensure a minimum of 50 million reads for each sample.",
    "NOTE: Refer to Figure 3 for a schematic illustrating the workflow used to process RNA-Seq data and to quantify the expression of differentially expressed transcripts. Sequence data, in the form of Fastq files, are subjected to quality control procedures; >80% of the reads should yield a Phred score of 30 to be considered appropriate for subsequent analysis. The sequences are also preprocessed (trimmed) using Trimmomatic18 to remove adaptor sequences and filter out low-quality reads.\nPerform RNA-Seq alignment and analysis on the fastq generated files using any capable software program (e.g., DNAStar19,20 or Partek21). Follow the program-specific steps using the default settings to align the fastq files to the mouse reference genome (GRCm38/mm10).\n\tNOTE: Using DNAStar as an example, the general workflow is described below (Supplemental Figure 1).\n\t\nSelect the analysis method, RNA-Seq.\nSelect the reference genome, Mouse.\nUpload the BED file if provided one by the sequencing core.\nUpload the fastq sequencing files, assigning them unique replicate names.\nGroup-replicate the fastq files and designate them to a replicate set (i.e., GFP, CRE)\n\t\tNOTE: Each alignment program has its specific steps, and the user must consult with the program user guide for the program-specific protocol. The program will then generate gene-specific raw count data from these Fastq files.\nPerform statistical and normalization analysis (DESeq2, EdgeR) on the raw count data using any capable software programs, as described in 4.3, with the Ad5CMV-eGFP sample set as the control data set and Ad5CMV-Cre set as the test data set to identify differential gene expression signals with robust statistical power22,23.\n\t\nSelect GFP fastq files as the control data set.\nSelect DESeq2 as the statistical and normalization method .\nStart assembly and analysis.",
    "NOTE: Each alignment program has its specific steps, and the user must consult with the program user guide for the program-specific protocol. The program will then generate gene-specific raw count data from these Fastq files. The statistical and normalization analysis is a built-in step in many programs, as shown in the example here, within the sequence alignment protocol. If an alternative sequence alignment software program is used that does not offer this subsequent built-in step, perform the statistical and normalization analysis on the raw count data at the terminal level using the DESeq2 or EdgeR coding packages written in R, freely available for download on Bioconductor.org.\nUse these approaches to identify changes representing at least a 1.5 fold increase or decrease relative to the control (in this case, cells transduced with the Ad5CMV-eGFP virus). Use only those differentially expressed genes (DEGs) determined to be statistically significant that show ≥1.5-fold changes and a p-value 0.05 or a padj of 0.1 for subsequent functional enrichment analysis.\n\tNOTE: This will generate a list of DEG genes and their statistical power for functional enrichment analysis.\nPerform functional enrichment analysis on statistically significant Erbb4-mediated DEG identified in 4.4 with a ranked gene list file using any of the freely available web-based tools. Determine biological and pathway significance of Erbb4 gene loss through gene ontology datasets integrated in these open-access functional enrichment analysis tools24,25,26,27 (see the Table of Materials for examples and Figure 3 for an example workflow using Panther).\n\t\nExport the data obtained in step 4.4 as a spreadsheet.\nRank the data by log2 fold change, p/padj value, or both.\nBe sure to remove all non-statistically significant data.\nExport the ranked gene list with gene ID only as a .txt file and upload it to the website.",
    "NOTE: Use only statistically significant DEG (p/padj values < 0.05 or 0.1, respectively) to generate a ranked input gene list using log2 fold changes (highest to lowest), p/padj-values (lowest to highest) or both [(-log10(pval)*sign(log2FC)]. There are several approaches to generate a ranked gene list and is empirically determined for the dataset and the question being asked. The specific type of functional enrichment analysis tool being used can also assist in determining the appropriate type of rank gene list. For additional resources on RNA-Seq, see the following papers28,29,30.\n5. Orthotopic allografting of MPNST cells with ablated Erbb4 alleles and analysis of the effects of Erbb4 ablation\nBefore performing orthotopic allografting of sorted MPNST cells, ensure that all procedures are reviewed and approved by the Institutional Animal Care and Use Committee, and that all procedures are performed by properly trained personnel.\nOn the day of injection, remove low passage cells (approximately 85% confluency) from cell culture plates or flasks using a non-enzymatic cell dissociation solution (e.g., a mixture of chelators; see the Table of Materials) and count the cells using a hemocytometer. For orthotopic injections into the sciatic nerve, reconstitute the cells at 16,667 cells/mL (50,000 cells per 3 µL for each animal) in DMEM-1031. Keep the cells on ice.\n\tNOTE: Some cultures will not successfully establish grafts unless the cells are injected in low-growth factor basement membrane matrix. The requirement for a basement membrane matrix (10-50%) must be empirically determined.\nAssess in vivo allograft growth potential in post-infected cells by injecting MPNST cells into the sciatic nerve of 8-10 anesthetized Hsd: Athymic Nude-Foxn1nu mice per cohort (aged 4-8 weeks). For orthotopic injection of tumor cells, refer to Turk et al31. Here, a subcutaneous injection is demonstrated.",
    "NOTE: To determine the number of experimental animals needed for statistical significance, consult with a biostatistician or it is recommended to use G*Power3, a freely available software32.\nMonitor the animals closely twice daily for the first week post-injection for any signs of pain. Thereafter, monitor the grafted mice three times per week for caliper measurements and assess body condition scores (BCSs) as previously described5,31. As outlined in IACUC guidelines, euthanize animals with a BCS of 2 or less.\nAs grafted cells grow at different rates, determine graft times empirically using control (unmodified) cells before performing experiments described in this section. To collect the grafts at the experimental endpoint, euthanize the mice humanely using carbon dioxide inhalation followed by cervical dislocation as a secondary measure. Record the final volume and mass measurements of each graft.\n\tNOTE: As unmodified P0-GGFβ3;Trp53+/-;Erbb4fl/fl MPNST cells typically reach the maximum size allowed by IACUC within 30-45 days, a typical timeline is around 30-45 days after injection.\nIsolate and section tissue as described in steps 1.6-1.8. Fix part of the graft tissue overnight in 4% paraformaldehyde (Figure 2) and then embed it in paraffin. Prepare 5 µm sections from the FFPE tissue and mount them on slides. Perform H&E staining and other necessary immunostaining to confirm that the graft tissue is composed of tumor cells as described in 1.8.1. Snap-freeze the rest of the tumor tissue for downstream analyses, such as validating the loss of Erbb4 expression and assessing the effects of Erbb4 loss on the expression of other Erbb family members.\n\tNOTE: Confirmation of tumor cells in the graft tissue must be done because immunodeficient mice are prone to develop neoplasms. In the case of small grafts, it is important to ensure that scar tissue or inflammation is not mistaken for a neoplasm.",
    "Perform standard IHC staining on the FFPE tissue to compare the expression of proteins of interest in allografts grown from Ad5CMV-eGFP and Ad5CMV-Cre/eGFP treated cells. Stain the excised graft tissue using erbB4-specific antibodies to confirm differences in in vivo erbB4 expression between the two experimental conditions. Determine the proliferative index via Ki67 staining and the level of apoptosis via terminal deoxynucleotidyl transferase-mediated dUTP nick-end labeling (TUNEL) staining.\n\t\t​NOTE: Any protein target of interest can also be assessed via IHC. For example, assess vascular density by immunostaining allografts with an anti-CD31 antibody (1:50 dilution) to determine in vivo vascular microenvironment differences mediated by gene ablation. The number of vascular profiles per 40x field can be counted for quantification. For these IHC-based assays, follow standard IHC protocols for the staining procedures and the manufacturer's protocol for TUNEL staining. For quantification of images, use the ImageJ plug-in \"automated counting of single-color image.\"\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}