{
  "id": 13527,
  "origin_website": "Jove",
  "title": "Chondrogenic Pellet Formation from Cord Blood-derived Induced Pluripotent Stem Cells",
  "procedures": [
    "This protocol was approved by the institutional review board of the Catholic University of Korea (KC12TISI0861). CBMCs used for reprogramming were directly obtained from the Cord Blood Bank of the Seoul St. Mary's Hospital.\n1. Chondrogenic Differentiation from iPSCs\nCBMC-iPSC generation\nGenerate CBMC-hiPSCs using the protocol shown in our previous work23.\nCollect the blood cells in a 15 mL conical tube and count them using a hemocytometer.\nPrepare 3 x 105 cells and centrifuge them for 5 min at 515 x g and RT. Discard the supernatant by suction and resuspend the cells in 0.5 mL of blood cell medium.\nTransfer the cells to a well of a non-coated 24-well plate and add the Sendai virus mixture, following the manufacturer's recommendations.\nCentrifuge the plate for 30 min at 1,150 x g and 30 °C.\nAfter centrifugation, incubate the cells overnight (O/N) at 37 °C in 5% CO2.\nThe next day, transfer the transduced cells to a matrix-coated well. Centrifuge the plate at 1,150 x g for 30 min at 30 °C.\nAfter centrifugation, remove the supernatant, add 1 mL of iPSC medium, and maintain the cells O/N at 37 °C in 5% CO2.\nMaintain the attached cells at 37 °C and 5% CO2. Change the medium daily, replacing it with fresh iPSC medium.\n\t\tNOTE: Colonies will appear on day 14-21 after transduction.\nEB generation\nMaintain the hiPSCs at 37 °C and 5% CO2. Change the medium daily, replacing it with fresh Essential 8 (E8) medium.\nPrepare 2 x 106 hiPSCs in a vitronectin-coated, 100-mm dish in E8 medium.\nRemove the E8 medium from the culture dish and wash with sterile phosphate-buffered saline (PBS).\nAdd 1 mL of 1 mM ethylenediaminetetraacetic acid (EDTA) and incubate at 37 °C and 5% CO2 for 2 min.",
    "Harvest the cells with 3 mL of E8 medium and transfer them to a new 15-mL conical tube. Centrifuge the cells at 250 x g at room temperature (RT) for 2 min.\nAspirate the supernatant without disturbing the cell pellet and resuspend the cells in 5 mL of E8 medium.\nCount the cells using a hemocytometer and prepare 2 x 106 cells for each 100 mm Petri dish. Resuspend the prepared cells in a 10-mL mixture of E8 and EB medium (1:1) with 10 µM rho-associated kinase (ROCK) inhibitor.\nIncubate the cells O/N for aggregation at 37 °C and 5% CO2.\nOn the following day, harvest the aggregated EBs by pipetting. Centrifuge the cells at 250 x g for 1 min. Remove the supernatant and resuspend the EBs in 10 mL of fresh E8 medium.\nEnlarge the generated EBs for 5 days, performing daily changes with fresh E8 medium. For further maturation, change the culture medium to E7 medium. Maintain the EBs at 37 °C and 5% CO2 for another 5 days, performing daily medium changes with fresh E7 medium.\n\t\tNOTE: E7 medium is E8 medium without FGF2.\nOutgrowth cell induction from EBs\nAdd 6 mL of 1% gelatin to a 100-mm dish and incubate at 37 °C and 5% CO2 for 30 min.\nRemove the gelatin and dry the dish completely for 2-3 h before use.\nTransfer the EBs to a 50-mL conical tube. Allow the EBs to settle to the bottom of the conical tube. Remove the supernatant without disturbing the EBs.\nResuspend the EBs in 10 mL of Dulbecco's Modified Eagle's Medium (DMEM) with 20% fetal bovine serum (FBS). Transfer the EBs to the gelatin-coated, 100-mm dish. Add 10 µM ROCK inhibitor.",
    "Incubate and maintain the cells at 37 °C and 5% CO2 for 7 days. Change the medium every other day without adding ROCK inhibitor.\nChondrogenic pellet formation\nAspirate the culture medium from the dish and wash the cells three times with PBS.\nApply 1 mL of 1 mM EDTA and incubate at 37 °C and 5% CO2 for 2 min.\nHarvest the cells using 5 mL of DMEM with 20% FBS and transfer them to a new 15-mL conical tube.\nCentrifuge the cells for 2 min at 250 x g and RT. Discard the supernatant and resuspend the pellet in 10 mL of DMEM with 20% FBS.\nFilter and discard the cell clumps using a 40 µm cell strainer and harvest the single cells. Count the single cells using a hemocytometer.\nCentrifuge the cells for 2 min at 250 x g and RT. Remove the supernatant and seed 3 x 105 cells per pellet in a 15 mL conical tube with 300 µL of chondrogenic differentiation medium (CDM).\nFor pellet formation, centrifuge the cells for 5 min at 680 x g and RT.\n\t\tNOTE: Pellets are maintained in 15 mL conical tubes during the differentiation of the chondrogenic pellets.\nIncubate the cells overnight at 37 °C and 5% CO2.\nChange the CDM every 2-3 days. Within 3 days, pellets will exhibit flattened, spheroidal morphologies. Maintain the pellets for 21 days at 37°C and 5% CO2.\n2. Chondrogenic Pellet Characterization by Staining\nChondrogenic embedding\nBefore embedding, prepare and melt paraffin at 58 °C.\nFix the pellets in 1 mL of 4% paraformaldehyde for 2 h at RT in a 1.5 mL tube.\n\t\tCaution: Paraformaldehyde is highly toxic. Avoid contact with eyes, skin, or mucous membranes. Minimize exposure and avoid inhalation while preparing it.",
    "Place one layer of gauze onto the cassette and transfer the fixed pellets using a pipette. Cover the pellet by folding the gauze and close the cassette lid.\nInitiate dehydration in 100 mL of 70% ethanol (EtOH) twice, 10 min each. Dehydrate the pellets through sequential 10-min washes in 80% and 95% EtOH.\nTransfer the pellets to 100% EtOH for 10 min. Repeat three times with fresh EtOH.\nFor \"clearing,\" exchange the solution for a 100 mL, 1:1 mixture of EtOH and xylene, followed by a 1:2 mixture of EtOH and xylene for 10 min each. Clear the remaining EtOH by incubating the pellets twice in 100% xylene, 10 min each.\nFor paraffin infiltration, incubate the pellets in sequential xylene and paraffin mixtures. Perform the whole paraffin infiltration process at 58 °C. Incubate the pellets in 100 mL of a 2:1 mixture of xylene and paraffin for 30 min.\nExchange the solution for 100 mL of a 1:1 mixture of xylene and paraffin and incubate for 30 min.\nExchange the solution for 100 mL of a 1:2 mixture of xylene and paraffin and incubate for 30 min.\nFor the final infiltration, transfer the pellets to the first bath of 100% paraffin and incubate for 2 h.\nTransfer the pellets to the second bath of 100% paraffin and incubate O/N at 58 °C.\nThe next day, gently transfer the pellets to a mold using a tweezer. Add paraffin to the mold from the paraffin dispenser. Solidify the paraffin for 30 min at 4 °C.\nSlice the sections at 7 µm and transfer the sections onto the slide. Allow the slides to dry overnight and store the slides at RT until they are ready for use.\nSlide preparation",
    "Deparaffinize the slides by moving them through 100 mL of 100%, 90%, 80%, and 70% EtOH sequentially for 5 min each.\nPlace the slides in a glass jar and rinse with tap water for 5 min.\nAlcian blue staining\nIncubate the slides in 50 mL of 1% alcian blue solution for 30 min.\n\t\tNOTE: Alcian blue is diluted in 3% acetic acid solution. Adjust the pH to 2.5 using acetic acid.\nPlace the slides in a glass jar and rinse with tap water for 2 min.\nRinse the slides in deionized water (DW) and counterstain with nuclear fast red solution for 2 min.\nPlace the slides in a glass jar and rinse with tap water for 1 min.\n2.3.5)Proceed to dehydrate and mount the slides in step 2.6.\nToluidine blue staining\nIncubate slides in 50 mL of toluidine blue solution for 4 min.\nPlace the slides in a glass jar and rinse with tap water for 5 min.\nProceed to dehydrate and mount the slides in step 2.6.\nImmunohistochemical staining\nIncubate the slides in 3% H2O2for 15 min for endogenous peroxidase blocking.\nApply 200 µL of primary antibody (anti-COL1A1 and -COL2A1) diluted 1:100 in tris-buffered saline (TBS) containing 1% bovine serum albumin (BSA) and 5% normal goat serum (NGS) to the slides and incubate O/N at 4 °C.\nThe next day, place the slides in a glass jar and wash them with 50 mL of TBS containing 0.1% polysorbate 20 (TBST) three times for 5 min each.\nApply 200 µL of secondary antibody (goat anti-rabbit IgG antibody, diluted 1:200 in TBS containing 1% BSA and 5% NGS) to the slides and incubate at RT for 40 min.\nPlace the slides in a glass jar and wash them three times with 50 mL, 5 min each.",
    "For signal amplification, apply HRP-conjugate streptavidin solution to the slides and incubate for 10 min.\nPlace the slides in a glass jar and wash them three times with 50 mL, 5 min each.\nMix the DAB-peroxidase substrate solution, apply 200 µL of solution to each slide, and incubate for 1 min.\nPlace the slides in a glass jar and rinse with tap water for 5 min.\nCounterstain with Mayer's hematoxylin for 1 min.\nWash the slides with DW.\nProceed to dehydrate and mount the slides in step 2.6.\nDehydration and mounting\nDehydrate the slides by moving them sequentially through 100 mL of 70%, 80%, 90%, and 100% EtOH, 30 s each.\nDip the slides into two changes of xylene for 1 min each.\nAdd 50 µL of mounting solution to the coverslips and place the slides on top.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}