{
  "id": 19062,
  "origin_website": "Jove",
  "title": "Collecting And Measuring Wound Exudate Biochemical Mediators In Surgical Wounds",
  "procedures": [
    "1. Study Protocol\nObtain Institutional Review Board approval and written informed consent.\nSelect an appropriate surgical population for study conduct. This methodology has only been applied to cesarean delivery wounds but most surgical wounds would be appropriate.\nConsider inclusion and exclusion criteria for your study participation. Patients and procedures with high rates of surgical wound infection may not be appropriate.\nStandardize anesthesia and postoperative management for all patients to avoid potential confounders.\n2. Nociceptive and Inflammatory Biochemical Mediator Collection\nInsert the ON-Q PainBuster with ON-Q SilverSoaker (I-Flow, Lake Forest, CA) into the subcutaneous layer just prior to wound closure (other tissue layers can be considered). The ON-Q PainBuster Pain Relief System continuously delivers normal saline at a rate of 2 ml/h. The carrier can be combined with or compared to drugs of interest such as a local anesthetic and non-steroidal anti-inflammatories.\nIncorporate a standard three-way stopcock into this system to allow aspiration of wound exudate at specified time points. The continuous infusion prevents the catheter from clotting and improves the reliability of the system to produce exudate samples. If aspiration of exudate is difficult (approximately 5% of cases), consider pushing gently above the wound, changing the subject's position (e.g., sitting the patient up or lying them flat), using a 0.5-1 ml normal saline flush or withdrawing the catheter 1-2 cm.\nAt time points specified by the protocol (e.g., 1, 4, 6, 24, and 48 hr after cesarean delivery), aspirate and withdraw 1 ml of wound exudate. Transfer the exudate into a polyethylene cup containing 30 μl of proteinase inhibitor. We have used Complete Proteinase Inhibitor (Roche Bioscience, Palo Alto, CA) for our purposes.",
    "At the same time intervals specified by the study protocol, collect 10 ml of blood. We have used a blood collection tube containing lithium heparin; at our institution this is a green-topped glass tube. Add an additional 300 μl of proteinase inhibitor into the blood samples.\nWithin 1 hr of collection, put samples on ice and centrifuge at 3,000 rpm for 10 min.\nRemove serum and wound supernate and place in a standard microcentrifuge tube and store at -20 °C.\n3. Assay Analysis\nOnce all the study exudate and serum samples are collected and stored, thaw and analyze the samples at the same time.\nWe have measured the cytokines and chemokines using a multiplex immunoassay. The multiplex immuno-assay technique allows us to assay numerous analytes from small (50 μl) volume samples. The multiplex produce results comparable with those obtained with ELISA. We have used the 17-plex Bio-PlexTM system (BioRad, Hercules, CA) for our analysis. This assay is capable of measuring tumor necrosis factor α (TNFα), interferon α (INFα), interleukin 1β (IL-1β), interleukin 2 (IL-2), interleukin 4 (IL-4), interleukin 5 (IL-5), interleukin 6 (IL-6), interleukin 7 (IL-7), interleukin 8 (IL-8), interleukin (IL-10), interleukin 12 (IL-12), interleukin 13 (IL-13), interleukin 17 (IL-17), granulocyte colony stimulating factor (G-CSF), granulocyte-macrophage colony stimulating factor (GM-CSF), monocyte chemoattractant protein 1 (MCP-1) and macrophage inflammatory protein 1 (MIP-1β). Nerve growth factor was measured with NGF DY256 antibody by adding it to the 17-plex plate with the Bio-Plex amine coupling kit.",
    "To ensure good quality analysis, each measurement should be made in duplicate. Standard curves for each analyte are generated by using reference analytes supplied by the manufacturer (at concentrations of 0.20, 0.78, 3.13, 12.5, 50, 200, 800, 3,200 pg/ml plus a zero standard for the normal saline). Standard curves are included in each run and sample concentrations are calculated with Bio-Plex Manager software.\nSubstance P and prostaglandin E2 were measured using highly sensitivity ELISA Kits. We have used Assay Designs, Inc. (Ann Arbor, Michigan) for this analysis. Perform the analysis in duplicate according to the manufacturer's specification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}