{
  "id": 7543,
  "origin_website": "Bio",
  "title": "A Novel PCR-Based Methodology for Viral Detection Utilizing Mechanical Homogenization",
  "procedures": [
    "HCoV-229E Viral Stock Preparation and DilutionsGrow a viral stock of HCoV-229E on MRC-5 cells and harvest the virus from the cell supernatant, following the manufacturer’s instructions. Use the virus to infect 80% confluent MRC-5 cells plated in T-75 flasks with a multiplicity of infection (MOI) of 1.6. Culture the infected cells for another 72 h post-infection, until greater than 70% cytopathic effect (CPE) is observed. Harvest the cell culture supernatant to create the HCoV-229E virus stock for utilization in these experiments. Centrifuge the harvested supernatant at 3,000 × g for 10 min, to pellet any cellular debris within the solution. After centrifugation, transfer the supernatant containing the virus stock to a clean 15 mL conical tube for storage and discard the pelleted debris.Following virus stock purification, complete plaque assays to determine a starting viral load. In this protocol, our viral stock had a concentration of 1.2 × 106 PFU/mL of HCoV-229E. Perform plaque assays via serial dilutions of viral stock onto MRC-5 cells plated to 80% confluence in 6-well plates. The starting cell count for this procedure was 200,000 cells/well in 2 mL of media. Following virus addition, allow the cells to grow for 5 days before evaluation of plaque formation.With 10 mL of HCoV-229E viral stock at 1.2 × 106 PFU/mL, dilute the HCoV-229E in a stepwise fashion by pipetting 1 mL of stock solution into 9 mL of viral transport media, inverting the new dilution three times, and then pipetting 1 mL into the next tube of 9 mL of viral transport media. Conduct this serial dilution until obtaining a stock of 1.2 × 101 PFU/mL. On the final dilution step, following the three inversions of the tube, pipette 1 mL of viral stock and discard it to maintain accurate concentrations.",
    "This step was conducted with all reagents thawed to room temperature.Store HCoV-229E stock dilutions in 2 mL cryogenic storage vials at -80°C until needed, if not being utilized within 2 h of stock dilution production.Sample Swab PreparationThaw HCoV-229E stock dilutions to 4°C, if not currently available for use. Conduct the remainder of the swab preparation procedure at room temperature.Pipette 1 mL of sterile viral transport media (VTM) into clean 2 mL screw cap tubes. Do not lose the caps for these tubes, as they will be needed in the homogenization step.Once HCoV-229E stocks are thawed, prepare swab samples from each dilution for PCR detection by submerging a cotton tipped swab in the HCoV-229E dilution for 5 s, to allow for complete saturation, and then placing the swab directly into one of the prefilled 2 mL screw capped tubes.Break off the stalk of the swab while maintaining the cotton tip within the VTM and replace the screw cap on the 2 mL tube.Repeat steps B2–B4 until the desired number of swabs for each dilution have been created in preparation for PCR detection.Note: We recommend a minimum of 5 swabs at each concentration for preliminary limit of detection work, with a minimum of 30 additional replicates needed for confirmation once a targeted concentration has been determined. Shaker Mill HomogenizationEnsure the screw capped tubes containing 1 mL of VTM and swabs are tightly sealed. Place 2 mL tube carriage on the Bead Ruptor Elite. Load the screw capped tubes onto the 2 mL carriage, then tighten the fingerplate, and close the lid.Homogenize at 4.2 m/s and room temperature for 30 s.Some froth may be generated within the tubes because of the homogenization; this is normal.",
    "To alleviate any frothing in the tubes, remove them from the Bead Ruptor Elite and spin the tubes in a microcentrifuge up to 10,000 × g for no more than 15 s.RT-qPCRPrepare the RT-qPCR HCoV-229E N Primer Mastermix, as described in the recipes section.Prepare the RT-qPCR mixture using the Luna Universal One-Step RT-qPCR kit, as described in the table below (Table 1).Table 1. Luna Universal One-Step RT-qPCR mixture for RT-qPCR table:",
    "﻿0,1\nReagent,Volume per reaction\nLuna Universal One-Step Reaction Mix (2×),10 µL\nLuna WarmStart® RT Enzyme Mix (20×),1 µL\nForward Primer (5 µM),1.25 µL\nReverse Primer (5 µM),1.25 µL\nTemplate RNA,1 µL\nNuclease-Free Water,5.5 µL",
    "Prepare the PCR plate with identified spots for positive controls of purified HCoV-229E RNA, the unknown samples of homogenized HCoV-229E, and negative controls using DPEC and no HCoV-229E RNA.Load 1 µL of sample (positive, unknown, or negative) into each well, as shown in the table above.Seal the PCR plate with the plate sealing film.Place plate into the CFX Connect and run the RT-qPCR with the following cycle parameters:55°C for 30 min95°C for 1 min44 cycles of 95°C for 15 s and 56°C for 30 sHold at 4°C for further processingAmplicon ConfirmationPrepare a 2% agarose gel using TBE buffer and 5 µL of 10 mg/mL ethidium bromide stock for amplicon visualization. Both 15 well and 8 well combs can be utilized, to create wells large enough to accommodate the 20 µL volume of sample. Herein, we chose to use 15 well combs in our gel due to the large number of samples we were trying to visualize.Load 20 µL of trypan blue into the 20 µL of suspected amplicon following RT-qPCR (1:1 mixture).Load 20 µL of the amplicon/trypan mixture into each well of the 2% agarose gel, with 3 µL of 100 bp molecular ruler in 12 µL of trypan blue into one of the wells.Run the gel at 125 V for approximately 1 h, or until the bands have sufficiently separated.Visualize the gel utilizing the Gel Doc EZ Imager System, to observe the size of amplicon product in comparison to the ladder. The EZ Imager Software is set to standard ethidium bromide exposure settings with targeting of band intensities for imaging of the gels. This allows for identification of the target amplicon size for the N gene mixture at 308 bp."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}