{
  "id": 15009,
  "origin_website": "Jove",
  "title": "Optimized Bone Sampling Protocols for the Retrieval of Ancient DNA from Archaeological Remains",
  "procedures": [
    "All research presented herein was performed in compliance with the guidelines set forth by the Max Planck Institute for the Science of Human History, Jena, Germany for working with ancient human remains. Before performing any steps of this protocol ensure to adhere to all local/state/federal ethical requirements pertaining to both obtaining permission for the scientific study and use of human remains for destructive sampling in your area. All procedures/chemical storage should be performed according to individual institutional safety guidelines.\n1. Considerations before sample processing\nTreat samples with care as ancient remains are an irreplicable and finite resource (e.g., sampling should be as minimally wasteful as possible, and all remains returned to their respective and lawful providers if possible).\nPerform all steps in a clean-room environment, preferably at a dedicated ancient DNA facility17,18,19. Use personal protective equipment (PPE) consisting of sterile microporous coveralls with hood, sterile gloves (two pairs), surgical mask, protective eyewear, and sterile boots or non-slip shoes with sterile covers (see Table of Materials). Change gloves frequently, especially between samples.\nClean and disinfect all equipment and surfaces thoroughly with bleach/DNA decontamination solution/ethanol and UV irradiation (wavelength: 254 nm) where possible (e.g., drill bits, drills, vises/clamps, etc.). Finally, it is highly recommended to take regular ergonomic breaks (every 2-3 h if possible) to avoid over-exhaustion due to the clean-room environment.\n\tNOTE: All skeletal remains should be appropriately documented (e.g., photographed, weighed, and if possible micro-CT scanned, 3D imaged, etc.) before sampling (protocols for appropriate documentation are not covered in this manuscript). All sampling protocols may be paused between sampling iterations and the samples can be stored indefinitely in a dry, temperature controlled (25 °C), sterile environment.\n2. Pretreatment\nDecontaminate all anatomical sampling locations prior to bone powder generation to minimize the risk of contamination18.",
    "NOTE: The efficacy of bleach and/or surface removal (see NOTE in step 3.3.2 for surface removal steps) for sample decontamination is still a matter of debate among aDNA researchers8,19,20,21,22,23,24,25 as both may influence overall DNA yields, especially in highly degraded samples. As such, the following steps are considered optional and are included here as they were used in all samples to generate the representative results presented in this paper. It is recommended that the use of these pre-treatment protocols be determined on a case-by-case basis based on the molecular application, age, rarity, and level of morphological degradation of each sample set.\n\t\nPerform all sampling in a dedicated clean room under a UV light equipped polymerase chain reaction (PCR) hood or biosafety cabinet with airflow turned off. Spread sterile aluminum foil across the benchtop to catch any stray bone powder/fragments.\nEnsure all bone fragments are recovered (for repatriation) before disposing of the foil. Change the foil between the treatment of each skeletal element. Dispose of used foil in an autoclavable biohazard bag/receptacle.\nRemove as much loose dirt/detritus as possible from anatomical sampling locations by gently wiping the area with a lint-free dry sterile wipe (see Table of Materials). Dispose of the wipes in autoclavable biohazard bags or receptacles.\nDecontaminate the cleaned surface by wiping with a sterile wipe moistened with diluted commercial bleach (~0.01% v/v, diluted with ultrapure DNase/RNase free water) and allow to incubate for 5 min. Dispose of the wipes in autoclavable biohazard bags or receptacles.\n\t\tCAUTION: Bleach is a highly corrosive and reactive chemical; hence appropriate safety precautions should be in place before its use.\nRemove as much residual bleach as possible from the anatomical sampling location with a sterile wipe moistened with ultrapure DNase/RNase-free water. Dispose of the wipes in autoclavable biohazard bags or receptacles.",
    "Expose all cleaned anatomical sampling locations to UV radiation for 30 min (wavelength: 254 nm), and then allow to dry fully at room temperature. Ensure that the anatomical sampling locations are completely dry before proceeding with sampling or returning to storage to not only make bone powder generation easier but also to prevent further degradation of the sample (e.g., mold).\n\t\tCAUTION: Exposure to UV radiation can be harmful to the eyes.\nMove immediately to sampling or store skeletal elements in a dry, temperature controlled (25 °C) sterile environment.\n3. Bone powder generation\nNOTE: The following protocols are intended for use in DNA extraction following the Dabney et al. 2019 protocol26.\nSampling of pars petrosa\n\tNOTE: This protocol is adapted from procedures described in Pinhasi et al. 20194 and is presented here for ease of use. This protocol does not represent the current, least destructive method for the sampling of pars petrosa. As such, it is recommended to use the protocol described by Sirak et al. 201713 or Orfanou et al. 202014 for samples where morphological preservation is of maximum importance.\n\t\nPerform all sampling in a dedicated clean room under a UV light equipped PCR hood or biosafety cabinet (wavelength: 254 nm) with airflow turned off. Spread sterile aluminum foil across the benchtop to catch any stray bone powder/fragments.\nEnsure all bone fragments and as much powder as possible is recovered (for repatriation) before disposing of foil. Change the foil between each sampling. Dispose of the used foil in an autoclavable biohazard bag/receptacle.\nSecure the dry, decontaminated element using a sterilized clamp or vise.",
    "Cut the pars petrosa in half along the superior sulcus petrosus (see Figure 1) using a standard jeweler's saw equipped with a 0.6 mm blade (see Table of Materials) at medium speed to avoid overheating (see NOTE below step 3.1.6).\n\t\tCAUTION: The pars petrosa is very dense, and as such may be difficult to cut. Take care to keep the element securely clamped to avoid injury. Dispose of any broken saw blades in the appropriate sharps' receptacle.\nRemove the petrous portions from the clamp. Recover and save any loose/excess material.\nPlace weigh paper in a sterile weighing boat\nHold the petrous portion over the weigh paper, cut side tilted toward the weighing tray. Drill into the dense cortical bone between the facial canal and mastoid antrum (appears shinier than the surrounding material, see Figure 1) using dental drill equipped with a small gauge bit (see Table of Materials) and set to medium speed, medium torque to produce bone powder.\n\t\tNOTE: Drilling/Cutting should be done in short bursts at low to medium speeds to avoid overheating the bone and potentially destroying/damaging DNA. Anecdotally, when the dense portion of the petrous begins to overheat a smell described as cooking bacon may be observed. Cease drilling/sawing immediately and allow the bone to rest until sufficiently cool before resuming.\nRepeat drilling until approximately 50-100 mg of powder is collected in the weigh paper, as measured using an enclosed balance accurate to at least 0.01 mg (see Table of Materials).",
    "NOTE: Where possible it is suggested to gather 100 mg of bone powder to allow for two replicate DNA extraction of 50 mg each. However, this may not always be possible based on either limitation of the anatomical sampling locations themselves (e.g., the distal phalanx, dental pulp chamber) or the need for morphological preservation. For other locations, such as the cementum, considerably less than 50 mg of the material may be available. However, the cementum, dental pulp chamber, and distal phalanx have all been shown to yield significant endogenous DNA11,27,28, despite lower initial input of bone powder from the extraction process.\nTransfer powder from the weigh paper to a 2 mL labeled low-bind, safe-lock tube for extraction or storage. Store samples at -20 °C, indefinitely.\nStore remaining bone/excess powder in a dry, temperature controlled (25 °C) sterile environment until return/repatriation can be completed.\nDispose of all waste in autoclavable biohazard bags or receptacles. Sterilize/decontaminate all reusable equipment (e.g., clamps, drill bits, drills, saws, etc.) using bleach/DNA decontamination solution/ethanol and UV (wavelength: 254 nm) exposure, as applicable, between each sampling.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63250/63250fig01.jpg\nFigure 1: Temporal bone including the pars petrosa. (A) Sample pre-cutting showing the locations of the petrous pyramid and the sulcus petrosa. (B) Petrous portion post-cutting highlighting the dense areas to be drilled. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63250/63250fig01large.jpg]\nSampling of permanent molars\n\tNOTE: For the sampling of permanent molars, pre-select in situ molars with fused roots and ideally void of caries, cracks in the enamel, or excessive wear for best results. Remove any dental calculus sampling and store at -20 °C for possible future analyses of the oral microbiome (procedure not covered here).\n\t\nSampling of the cementum",
    "Perform all sampling in a dedicated clean room under a UV light equipped PCR hood or biosafety cabinet (wavelength: 254 nm) with airflow turned off. Spread sterile aluminum foil across the benchtop to catch any stray bone powder/fragments.\nEnsure all bone fragments and as much powder as possible are recovered (for repatriation) before disposing of foil. Change the foil between each sampling. Dispose of used foil in an autoclavable biohazard bag/receptacle.\nPlace a sheet of weigh paper into a sterile weighing tray.\nHold/secure the decontaminated molar by the enamel, root down, over a weighing tray using a hand-held clamp such as an adjustable wrench (see Table of Materials).\nEquip a dental drill with a diamond-edged circular cutting wheel. With the drill set to a medium speed/torque setting, lightly touch the edge of the bit to the root at an angle of approximately -20°.\nScrape downward into the tray to remove/collect the yellow, outermost material from the root (cementum). Stop collection when the lighter (white) material of the dentin becomes visible.\n\t\t\tNOTE: It is important to match the direction of rotation of the cutting bit in relation to the collection tray to avoid the powder becoming aerosolized and potentially wasting the sample by missing the tray entirely. The cementum is particularly rich in DNA; however, typical yields of material are much smaller than other anatomical sampling locations (~7-20 mg)11,27,28.\nRecord mass of powder collected in weigh paper using an enclosed balance accurate to at least 0.01 mg (see Table of Materials).\nTransfer powder from the weigh paper to a 2 mL low-bind, safe lock tube for extraction. Store at -20 °C, indefinitely.\nSampling of the pulp chamber",
    "After the cementum has been collected (if desired), section the molar along the cemento-enamel junction using a jeweler's saw to remove the crown (see Figure 2).\nPlace a new sheet of weigh paper in a new weighing tray.\nSecure the crown section in a handheld clamp or vise, over the weighing tray. Hold cut side tilted downward and drill/scrape material as the first pass with a dental drill equipped with a small gauge drilling bit (see Table of Materials) along the edges of the pulp chamber within the crown portion (see Figure 2).\n\t\t\tNOTE: Only the first pass of the interior of the pulp chamber is to be collected and labeled as pulp material (5-15 mg typical yield), anything deeper into the tooth is considered dentin.\nTurn the tooth with the inferior portion facing down, tap the clamp with a hammer, and collect the liberated powder on the weigh paper.\nRecord the weight of the powder collected in the weigh paper using an enclosed balance accurate to at least 0.01 mg (see Table of Materials).\nTransfer powder from the weigh paper to a 2 mL low-bind, safe-lock tube for extraction. Store at -20 °C, indefinitely.\nSampling of the dentin\n\t\t\nPlace a new sheet of weigh paper in a new weighing tray.\nHold the crown section over the weighing tray (as per step 3.2.2.3), drill out and collect further 50-100 mg of dentin as measured using an enclosed balance accurate to 0.01 mg (see Table of Materials) from the interior of the pulp chamber in the same manner for further dentin sampling (see Figure 2).\nTransfer bone powder from the weigh paper to a 2 mL low-bind, safe-lock tube for extraction. Store at -20 °C, indefinitely.",
    "Store the remaining tooth pieces/excess powder in a dry, temperature controlled (25 °C) sterile environment until return/repatriation can be completed.\nDispose of all waste in autoclavable biohazard bags or receptacles. Sterilize/decontaminate all reusable equipment (e.g., clamps, drill bits, drills, saws, etc.) using bleach/DNA decontamination solution/ethanol and UV (wavelength: 254 nm) exposures as applicable, between each sampling.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63250/63250fig02.jpg\nFigure 2: Permanent molar pre-sampling. (A) Pre-treated molar prior to sampling, showing crown, cementum (yellowish layer of the root), and the cutting site at the cemento-enamel junction. (B) The same molar post-cementum collection, showing the cut site at the cemento-enamel junction. (C) Molar post-cutting and sampling showing anatomical sampling locations for the dental pulp chamber and dentin within the crown. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63250/63250fig02large.jpg]\nSampling of the thoracic vertebrae\n\t\nSampling of the vertebral body\n\t\t\nPerform all sampling in a dedicated clean room under a UV light equipped PCR hood or biosafety cabinet (wavelength: 254 nm) with airflow turned off. Spread sterile aluminum foil across the benchtop to catch any stray bone powder/fragments.\nEnsure all bone fragments and as much powder as possible are recovered (for repatriation) before disposing of foil. Change the foil between each sampling. Dispose of used foil in an autoclavable biohazard bag/receptacle.\nPlace a small sheet of weigh paper into a standard weighing tray.\nSecure the vertebrae with a clamp or hand vise, with the vertebral body outward.\nHold the vertebrae over the weighing tray with the vertebral body tilted downward. Using a dental drill equipped with a small gauge drilling bit (see Table of Materials) set to low-speed high torque, drill along the outermost rim (inferior and superior) of the cortical bone surrounding the cancellous inner tissue of the vertebral body (see Figure 3).",
    "Scrape the bit against the cortical layer over a standard weighting tray until 50-100 mg of material is collected, as measured using an enclosed balance accurate to 0.01 mg (see Table of Materials).\nTransfer bone powder from the weigh paper to a 2 mL low-bind, safe lock tube for extraction. Store at -20 °C, indefinitely.\nSampling of the superior vertebral arch\n\t\tNOTE: This step is optional. Remove and discard the outermost layer of the cortical bone of the superior vertebral arch using a dental drill equipped with a small gauge drilling bit (see Table of Materials) by scraping it along the surface19. This is not suggested for sampling from the vertebral body, as the layer of cortical bone is generally very thin and likely to be entirely depleted by this process (see NOTE in section 2).\n\t\t\nPlace a small sheet of weigh paper into a standard weighing tray.\nSecure the vertebrae in a hand clamp/vise with the vertebral process outward, superior aspect down.\nWhile holding the vertebrae, superior aspect down, over a weighing tray, drill upwards into the center of the V shaped notch formed by the fusion of the spinous process with the lamellae (see Figure 3) using a dental drill with a small gauge bit (see Table of Materials) set to low speed and high torque.\nCease drilling when there is a noticeable drop in resistance. Change the drilling position slightly and repeat until 50-100 mg of bone powder is collected, as measured using an enclosed balance accurate to 0.01 mg (see Table of Materials).\nTransfer bone powder from the weigh paper to a 2 mL low-bind tube for extraction. Store at -20 °C, indefinitely.\nStore remaining bone/excess powder in a dry, temperature controlled (25 °C) sterile environment until return/repatriation.",
    "Dispose of all waste in autoclavable biohazard bags or receptacles. Sterilize/decontaminate all reusable equipment (e.g., clamps, drill bits, drills, saws, etc.) using bleach/DNA decontamination solution/ethanol and UV (wavelength: 254 nm) exposure, as applicable, between each sampling.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63250/63250fig03.jpg\nFigure 3: Vertebral body and superior vertebral arch cortical bone anatomical sampling locations of the thoracic vertebra. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63250/63250fig03large.jpg]\nSampling of the distal phalanx\n\tNOTE: This step is optional. Remove and discard the outermost layer of the cortical bone of the shaft and/or apical tuft using a dental drill equipped with a small gauge drilling bit by scraping it along the surface19. This may not be possible for samples with excessively thin cortical bone or juvenile remains (see NOTE in section 2).\n\t\nPerform all sampling in a dedicated clean room, under a UV light equipped PCR hood or biosafety cabinet (UV wavelength: 254 nm) with airflow turned off. Spread sterile aluminum foil across the benchtop to catch any stray bone powder/fragments.\nEnsure all bone fragments and as much powder as possible are recovered (for repatriation) before disposing of foil. Change the foil between each sampling. Dispose of used foil in an autoclavable biohazard bag/receptacle.\nPlace a small sheet of weigh paper into a standard weighing tray.\nSecure the sample in handheld clamp/vise, superior side upwards.\nHold the sample over the weighing tray, collect bone powder from the cortical bone from the inferior side of the apical tuft and shaft by drilling through the outermost dense layers (see Figure 4) using a dental drill equipped with a small gauge drilling bit (see Table of Materials).",
    "Cease drilling when there is a marked decrease in resistance, as this signifies lighter, cancellous material. Repeat this process, radiating outward from the initial drilling until at least 50-100 mg of bone powder is collected, as measured using an enclosed balance accurate to 0.01 mg (see Table of Materials).\nTransfer bone powder from the weigh paper to a 2 mL low-bind, safe-lock tube for extraction. Store at -20 °C, indefinitely.\nStore the remaining bone/excess powder in a dry, temperature controlled (25 °C) sterile environment until return/repatriation.\nDispose of all waste in autoclavable biohazard bags or receptacles. Sterilize/decontaminate all reusable equipment (e.g., clamps, drill bits, drills, saws, etc.) using bleach/DNA decontamination solution/ethanol and UV exposure, as applicable, between each sampling.\n\t\tNOTE: For smaller samples (e.g., juvenile samples) there may be considerably less than the suggested 50-100 mg of cortical bone available to sample. However, even in low quantities, this anatomical sampling location has been shown to be particularly rich in DNA11.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63250/63250fig04.jpg\nFigure 4: Distal phalanx showing the locations of dense cortical bone along the shaft and inferior side of the apical tuft. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63250/63250fig04large.jpg]\nSampling of the Talus\n\t\nPerform all sampling in a dedicated clean room under a UV light equipped PCR hood or biosafety cabinet (wavelength: 254 nm) with airflow turned off. Spread sterile aluminum foil across the benchtop to catch any stray bone powder/fragments.\nEnsure all bone fragments and as much powder as possible are recovered (for repatriation) before disposing of foil. Change the foil between each sampling. Dispose of used foil in an autoclavable biohazard bag/receptacle.\nPlace a small sheet of weigh paper into a standard weighing tray.\nSecure the sample in handheld clamp/vise, dome upwards.",
    "Hold the talus, dome upward, and medial surface toward the collector, over the weighing tray. Scrape cortical bone from the neck of the talus to a depth of ~1 mm (see Figure 5) using a dental drill with a low gauge bit (see Table of Materials) set to low speed and high torque.\nChange the drilling position slightly and repeat until approximately 50-100 mg of bone powder is collected, as measured using an enclosed balance accurate to 0.01 mg (see Table of Materials).\nTransfer bone powder from the weigh paper to a 2 mL low-bind tube for extraction. Store at -20 °C, indefinitely.\nStore the remaining bone/excess powder in a dry, temperature controlled (25 °C) sterile environment until return/repatriation can be completed.\nDispose of all waste in autoclavable biohazard bags or receptacles. Sterilize/decontaminate all reusable equipment (e.g., clamps, drill bits, drills, saws, etc.) using bleach/DNA decontamination solution/ethanol and UV (wavelength: 254 nm) exposure, as applicable, between each sampling.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63250/63250fig05.jpg\nFigure 5: Sampling area of the talus for cortical bone recovery. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63250/63250fig05large.jpg]\nNOTE: The talus has very little cortical bone (a thin outer layer). The material should not only be collected from the surface but also the underlying dense layer of cancellous bone."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}