{
  "id": 2618,
  "origin_website": "Cell",
  "title": "Protocol for large scale whole blood immune monitoring by mass cytometry and Cyto Quality Pipeline",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThaw and lyse samples including reference sample\nTiming: around 2 h, depending on the number of samples\nNote: In this example we stain 10 samples + 1 reference sample. More samples/batches can be stained if required. However, to keep the lysis time comparable across the tubes help of another technician is needed, if more than 20 samples are analyzed. Due to long acquisition time on CyTOF (∼106 cells/hour) the number of samples should be adjusted to the core facility working hours.\nThaw frozen donor samples and 1 reference sample.\nTake FACS tubes containing preserved blood from −80°C.\nPlace them on a tube rotator at 4°C, until completely thawed (40 min approx.), process samples as soon as they are thawed.\nNote: Alternatively, samples can be thawed in cold water bath (∼ 10°C) with agitation.\nWhile thawing proceed to step 2.\nPrepare Thaw-lyse buffer and tubes.\nDilute Thaw-lyse buffer 1000× to 1× in MilliQ water, 13 mL per sample will be required.\nPrepare eleven (11) 15 mL tubes and eleven (11) 5 mL FACS tubes. Label them according to the barcoding ID that will be used. Place 100 μm strainers above each 15 mL tube.\nAdd 5 mL of Thaw-Lyse buffer to each tube, make sure that the strainer area is wet.\nLyse red blood cells.\nOnce the fixed blood is thawed, add 2 mL of Thaw-Lyse buffer to each tube.\nClose the tubes tightly and mix by inversion.\nTransfer the content of the FACS tubes to the corresponding centrifuge tube with the strainer.\nNote: If clumps are present after thawing, pipet gently to break them down.\nWash each FACS tube with 1 mL of Thaw-lyse buffer in order to collect all the cells and filter through the strainer.",
    "Fill the centrifuge tubes up to 15 mL with Thaw-Lyse buffer, discard the strainers caps, and incubate on the roller for 10 min at RT.\nCentrifuge tubes for 10 min at 4°C, 800 g and decant the supernatant.\nNote: If the pellet is still red repeat the lysis using 10 mL of Thaw-Lyse buffer and additional 10 min of incubation.\nWash with 3 mL of CSB (Cell staining buffer), 5 min, 800 g, 4°C.\nDecant the supernatant.\nAdd 2 mL of DPBS and count the cells.\nNote: It is strongly recommended to use an automated cell counter. In this experiment we use a TC20 cell counter.\nAlternatives: A hemocytometer could be used if an automated cell counter is not accessible. Importantly, this will cause add a substantial amount of time to the experiment.\nTransfer 1.5 × 106 cells to a labeled FACS tube.\nNote: During the counting we do not perform any life/dead staining. The fixation used in this protocol induce mild permeabilization, hence all cells will be positive for dyes like trypan blue.\nNote: If for some reason cell counts are lower than expected for a given sample, add less cells for this sample and recalculate the volume of antibodies needed conserving the final cell concentration in the staining step. We have stained 1.5 × 106 cells/sample, but the number can be adjusted according to the expected cell frequency of the target populations. If a smaller number of cells is included for a particular sample, it can be difficult to acquire the desired number of cells.",
    "Critical: It is important to standardize thawing conditions across all samples in the study, either thawing them at 4°C using tube rotator or agitating in water (∼ 10°C). Process the samples as soon as they are thawed. If grumps appear pipet the clumps and perform two lysis steps.\nBarcode samples\nTiming: 1 h\nTo limit intra-batch variation barcoding (labeling individual samples with unique combinatorial barcodes) is introduced before staining.\nIn this step individual samples are barcoded using palladium-based barcoding (Cell-ID™ 20-Plex Pd Barcoding Kit). Afterward the samples will be pooled in a single staining tube.\nDilute Maxpar® 10× Barcode Perm buffer (BPB) with Maxpar® PBS.\nNote: Prepare 1.5 mL/sample, keep the buffer on ice.\nWash cells with 500 μL of BPB and centrifuge for 5 min 800 g 4°C.\nDecant the supernatant and vortex gently.\nWash cells with 500 μL of BPB and centrifuge for 5 min 800 g 4°C.\nNote: At this point barcodes can be thawed as described in step 10.\nDecant the supernatant and vortex the pellet gently.\nResuspend in 400 μL of BPB.\nPrepare barcodes.\nThaw the barcodes at RT.\nSpin for 10 s in microcentrifuge (full speed).\ntable:files/protocols_protocol_2115_7.csv\nBarcode the samples.\nNote: Barcode ID per each sample is shown in Table 6[href=https://www.wicell.org#tbl6].\nUsing a multichannel pipette resuspend first four barcodes in 100 μL of ice-cold BPB.\nMix well and transfer 100 μL to the FACS tubes containing the cells. Vortex gently.\nNote: Pipetting can lead to cell loss, avoid it.\nCritical: Annotate the correspondence of each barcode to its staining tube as shown in Table 6[href=https://www.wicell.org#tbl6].\nRepeat steps a and b for the rest of the barcodes.\nIncubate for 20 min at RT.\nNote: During this step surface and cytokine antibody cocktails can be thawed as shown in step 15.",
    "Wash the tubes with 2 mL CSB, 5 min at 800 g, 4°C. Discard the supernatant and vortex the pellet.\nRepeat washing step twice.\nPool the barcoded samples in a single FACS tube.\nResuspend cells in each tube in 120 μL of CBS and pool all the samples to a new single FACS tube.\nAdd additional 120 μL of CSB to wash the original tubes and transfer all the remaining cells to the same FACS tube.\nCentrifuge 5 min at 800 g, 4°C, decant the supernatant and vortex gently.\nOptional: Other barcoding methods can be used, as for example, CD45 or β2-Microglobulin-based barcoding (Hartmann et al., 2018[href=https://www.wicell.org#bib13]; Lai et al., 2015[href=https://www.wicell.org#bib18]; Mei et al., 2015[href=https://www.wicell.org#bib21]). However, β2-Microglobulin resistance to fixation needs to be checked. We recommend to keep 3 barcodes per sample, to detect and exclude doublets. If surface-based barcoding is used, protocol needs to be adjusted.\nNote: Barcodes can be titrated to ensure correct intensity. This protocol is adapted from Cell-ID 20-Plex Pd Barcoding Kit[href=https://fluidigm.my.salesforce.com/sfc/p/] (Standard BioTools).\nSurface, intracellular and iridium staining\nTiming: 3 h\nIn this step staining of cell surface and intracellular markers is carried out and followed by DNA staining. On the contrary to flow cytometry, in mass cytometry no side and forward scatter parameters are available, therefore nucleated cells are defined using DNA intercalator. In this protocol we use Cell-ID™ Intercalator- Iridium (Ir) and Maxpar® Fix and Perm Buffer for preparing Ir-staining solution.\nPrepare the antibody cocktail.\nThaw one aliquot of the antibody cocktail at 4°C.\nNote: Both cocktails (surface and intracellular cytokines) can be thawed at this moment.\nCentrifuge 15,000 g for 10 min to sediment antibody aggregates. Keep the intracellular cocktail on ice until needed.\nStain cell surface.",
    "Add 298.6 μL of CSB to the cells and 31.4 μL of antibody cocktail as calculated in Table 3[href=https://www.wicell.org#tbl3], vortex gently.\nNote: Avoid touching the bottom of the tube containing the cocktail, as antibody aggregates can generate staining artifacts.\nNote: If unspecific staining is observed FcR blocking can be done.\nIncubate for 30 min at 4°C.\nWash for intracellular staining.\nWash cells with 3 mL of Perm-S buffer, centrifuge 5 min at 800 g, and 4°C, discard supernatant, vortex gently.\nRepeat Perm-S wash.\nStain intracellular cytokines.\nAdd 309.6 μL of Perm-S to the cells and 20.4 μL of antibody cocktail as calculated in Table 4[href=https://www.wicell.org#tbl4], vortex gently.\nNote: Avoid touching the bottom of the tube containing the cocktail, as antibody aggregates can generate staining artifacts.\nIncubate for 30 min at 4°C.\nNote: The staining time can be extended depending on the cytokine expression.\nWash cells with 3 mL of CSB, centrifuge 800 g, 5 min at 4°C, decant supernatant, vortex gently.\nRepeat CSB wash.\nStain DNA with Ir.\nCalculate the volume of Maxpar® Fix and Perm Buffer needed for Ir staining using the rule 5∗107/mL (see Table 7[href=https://www.wicell.org#tbl7]).\nDilute Ir (500 μM) to a final concentration of 0.125 mM in Maxpar® Fix and Perm Buffer.\nNote: Ir needs to be freshly prepared each day due to its instability.\nAdd calculated volume of Ir solution to the cells.\nVortex gently.\nIncubate for 30 min at RT.\nNote: In this example we have stained 1.65 × 107 cells, the total volume of Ir was 1.65 mL.\nCentrifuge 5 min at 800 g and 4°C, decant supernatant, vortex gently.\ntable:files/protocols_protocol_2115_8.csv\nPreparation of Ir solution for one sample and scaled to 1 batch and a multibatch experiment (4 batches).\nWash with 3 mL of CST.",
    "Centrifuge 5 min at 800 g and 4°C, decant supernatant, vortex gently.\nPrepare 2% PFA from Pierce™ 16% Formaldehyde stock.\nNote: This agent needs to be freshly prepared each day due to its low stability.\nResuspend the cells in 2% PFA at 1 × 107/mL. Vortex gently and store at 4°C until acquisition.\nPause point: The cells can be stored at 4°C in PFA for up to 72 h.\nNote: The antibody thawing protocol is adapted from (Schulz et al., 2019[href=https://www.wicell.org#bib35]) and the staining protocol from www.fluidigm.com[href=http://www.fluidigm.com/].\nSample acquisition in a CyTOF device\nTiming: ∼10 h depending on the amounts of cells needed\nIn this step the cells are prepared for CyTOF2/HELIOS acquisition. It is mandatory to first correctly tune the instrument, as recommended in the instrument manufacturer guidelines, https://www.fredhutch.org/content/dam/www/shared-resources/fc-cytof/CyTOF-Helios-User-Guide.pdf[href=https://www.fredhutch.org/content/dam/www/shared-resources/fc-cytof/CyTOF-Helios-User-Guide.pdf].\nIt is important to use the same acquisition template throughout the whole project to avoid mislabeling of antibody names. We also strongly advise to prepare a unique naming scheme (see Note below) for the samples and antibody panel acquired in a given study.\nPrepare the EQ™ Four Element Calibration Beads (beads) working solution.\nSonicate the beads for 10 min.\nCalculate the volume needed for the acquisition of the cells, according to Table 8[href=https://www.wicell.org#tbl8], take 2.1 mL of 1× beads.\ntable:files/protocols_protocol_2115_9.csv\nathe final volume of the beads solution (0.1×) is calculated as following 16.5∗106 / 0.8∗106. Calculation regarding cell concentration is approximate since we do not account for cell loss during staining.\nDilute 1× beads in MilliQ in 18.9 mL of water to obtain 0.1× beads solution, see Table 8[href=https://www.wicell.org#tbl8].\nVortex vigorously every time before use.\nNote: It is recommended to prepare fresh bead solution each time.",
    "Alternatives: EQ™ Six Element Calibration Beads (Standard BioTools) could also be used instead of EQ Four Element Calibration Beads. However, these beads can be only used on Helios or CyTOF XT instruments.\nPrepare sample for the acquisition and acquire.\nResuspend the cells by vortex.\nTake an aliquot of 200 μL transfer to a 5 mL FACS tube containing 1.8 mL of CSB.\nCentrifuge 5 min at 800 g and 4°C, vortex.\nWash with 2 mL of MilliQ water.\nCentrifuge 5 min at 800 g and 4°C, discard the supernatant, vortex.\nAdd 2 mL of MilliQ water, vortex and take 10 μL of cell aliquot for cell counting.\nCentrifuge 5 min at 800 g and 4°C discard the supernatant, vortex.\nResuspend cells in freshly prepared beads at 8 × 105/mL, since the acquisition speed should not exceed 400 events/s.\nIntroduce the name of the sample in the CyTOF software.\nNote: We encourage the users to be consistent with experiment naming across all batches. It is advisable to include batch number, the acquisition date and the experiment name in the name of the fcs file. This will facilitate the analysis using CytoQP package and experiment tracking. For example: day1_human_tlr_response_220622.fcs.\nAcquire every aliquot in a Helios mass cytometer for no longer than 1.5 h to avoid sample degradation.\nRepeat steps (a) to (i) until the target number of cells is acquired.\nProceed to data analysis pipeline described in quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section for data preprocessing and cleaning.\nNote: If an acquisition is longer than 1.5 h for 200 μL, reduce the volume of the aliquot taken.",
    "Alternatives: In this example samples were washed and acquired using MilliQ water with narrow bore (NB) injector, however cell acquisition solution (CAS) with wide bore (WB) injector can also be used. Samples can be acquired for longer times with CAS solution, though we advise aliquot acquisition since it reduces the size of each fcs file generated and speeds up the analysis time."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Mass Cytometry",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}