{
  "id": 7348,
  "origin_website": "Bio",
  "title": "Cortical Laminar Recording of Multi-unit Response to Distal Forelimb Electrical Stimulation in Rats",
  "procedures": [
    "System setupThe system setup is described in detail in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4153/bioprotoc-11-22-4153-g001.jpgFigure 1. Setup for the recording of cortical activity with simultaneous electrical stimulation of the paw in the anesthetized rat. We used two battery-powered HS32-Ext0.5 mA headstages synchronized through the W2100 from multichannel systems (MCS). This system allowed the use of separate grounds for recording and stimulation, limiting the eStim-induced artefacts (i.e., electrical artifacts). The HS32 headstages can electrically stimulate in a bipolar setup while providing simultaneous recording through a 32-channel omnetics connector. The recording headstage was connected to a 32-lead linear silicone probe (Neuronexus). To obtain the exact time of stimulation, the stimulation headstage was connected to the paw of the animal and returned the voltage to the MSC. This system allowed a precisely synchronized stimulation and recording of events with neural response. We recorded from 2 regions (sequentially) in order to assess the laminar response of the S1 region and S1/M1 regions in the rat following paw stimulation.Controlled Cortical Injury (CCI) Surgical Procedure and eCS gel implantPrior to CCI injury, anesthetize each animal with 5% isoflurane (switched to maintenance 2-3% as soon as the incision was performed – Step B4).Inject buprenorphine (0.3 mg/ml, 0.05 ml/300g, Henry Schein) subcutaneously,Place animals with their scalp shaved and sanitized (70% Ethanol and 3% povidone-iodine) on a stereotaxic frame attached to a temperature-controlled heating pad (37°C).Perform a sagittal incision and clean the periosteum using Etch-gel (phosphoric acid etching, Henry Schein).Perform a craniotomy using a 5-mm-diameter trephine bur fitted to an electric drill.Fit a 3-mm CCI tip onto the pneumatic piston, position it in contact with the surface of the dura (fully extended position), and then retract it to adjust for an impact depth of 2 mm.Launch the 3-mm CCI tip to create an impact.",
    "A severe CCI injury is induced by programming the piston speed to 2.25 m/s with a dwell time of 250 ms, resulting in an initial 3-mm-diameter injury with a depth of 2 mm.Apply absorbable gelatin (Gel Foam®, Pfizer pharmaceutical) to the injury site, using sterile cotton swabs to remove excess blood.Remove the gelatin and completely cover the injury site with a layer of 1% sterile agarose (SeaKem®, Lonza).Suture skin flaps were together to close the wound. Apply triple antibiotic cream on the sutured skin.Optional: For the eCS group, the eCS gel was implanted 48 h post-CCI using a pre-photocrosslinked gel delivered through a 32 gauge Hamilton syringe (speed: 20 μl/10min) in the center of the CCI lesion (1 mm depth).Electrode placement surgical procedure (8 weeks post-CCI)See Structure Denomination for brain region names.Structure Denomination:  M1: primary motor cortexRFA: rostral forelimb area, part of the M1 region for hand controlCFA: caudal forelimb area, part of the M1 region for hand and leg controlS1: primary sensory cortexAP/ML/DV: stereotaxic positioning relative to the bregma point (reference); AP: anterior-posterior, ML: middle-lateral, DV: dorsal-ventralFrom 8 to 10 weeks post-CCI, anesthetize rats that received RFA-targeted lesions using a ketamine/xylazine cocktail (100 mg/Kg) and place them on a stereotaxic frame.Following sagittal scalp incision, perform a craniotomy (Figure 2) caudally to the injury (AP: 0 mm, ML: 2 to 4mm, relatively to bregma). Using a dental drill with trephine bur (2 mm diameter), draw a square shape within the skull, from the half width of the injury site down to the bregma (AP: 0 mm), with a width of 3-4 mm, and covering the entire lateral side (from the midline to the temporal cranial muscles). Then, lift and carefully remove the bone flap with fine forceps.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4153/bioprotoc-11-22-4153-g002.jpgFigure 2. Position and description of the craniotomy post-lesion.",
    "Perform a durotomy to allow for the insertion of a 32-channel silicone probe (Neuronexus). Using the tip of a 1 ml insulin needle bent at 90° penetrate the dura tangentially to the brain to avoid any damage to the grey matter. Move the needle across the length of the craniotomy to tear the dura, and flip its pieces outside of the craniotomy region.Insert the silicone probe (Figure 3, Video 1) in the motor area adjacent to the RFA (position 1: CFA, AP: 0 mm, ML: 2.5 mm) or in the sensorimotor area (position 2: S1, AP: 0 mm, ML: 3.5 mm) at a depth of 2 mm from the surface of the brain. Important: since the CCI was performed on the RFA, the CFA region should remain intact. If necrosis is observed in the CFA region, chances are that the recording will yield a low number of healthy unit spiking. Necrosis in the CFA/S1 region can be identified by the presence of liquified or brownish tissue with poor consistency, missing tissue volume, or dark tissue with a mix of coagulated and non-coagulated blood.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4153/bioprotoc-11-22-4153-g003.jpgFigure 3. Poisitioning and setup of the recording electrode following craniotomy. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. General setup for the terminal recording of cortical activity following paw stimulation (somatosensory evoked response). (This video was made at the University of Georgia (UGA) according to guidelines from the IACUC of UGA under protocol # A2020-06-002.)Use the probe reference (top ground electrode) as the main reference, and a screw positioned above the left cerebellum (posterior, contralateral hemisphere) as ground. The probe reference is described in the main manufacturer website: https://www.neuronexus.com/files/technicalsupportdocuments/Chronic-Wiring-Configurations.pdf[href=https://www.neuronexus.com/files/technicalsupportdocuments/Chronic-Wiring-Configurations.pdf] (see chronic probe reference description for internal reference).Paw electrode placement procedureUse a bipolar configuration for the paw stimulation.",
    "Use close positioning of the sink and source electrode to produce a short distance electrical stimulation, which results in a very localized electrical field excitation of the tissue. The bipolar configuration is the opposite of a monopolar configuration, where the sink and source are placed far apart, with the stimulation area becoming larger and less specific as a consequence.Connect the anode and cathode of the stimulator to stainless steel needles.Insert the two electrode tips at 2 mm from each other in the ventral section of the forelimb (palm of the paw). Then, place the paw and the entire forearm on the sterile pad.Recording ProcedureDigitize and record neural data at 20 kHz (unit gain) using a multichannel system (MCS) W2100 acquisition module and a wireless headstage (HS32-EXT-0.5 mA, 16 bit; Figure 4A).For spike analysis, filter the broadband electrophysiological through a real-time bandpass (300-5,000 Hz) and use a baseline pre-calculated threshold as trigger to save spike waveforms and spike event timestamps (threshold: 5 standard deviations). Do not sort for single-unit data; rather use multiunit spikes as a measure of population activity (Figure 4B, Video 2).Perform all recordings for 5 min after stabilization for 10 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4153/bioprotoc-11-22-4153-g004.jpg Figure 4. Recording setup using multichannel system software. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Example of recording during ketamine anesthesia with laminar electrode. Stimulation ProtocolsPerform all paw stimulations using a single pulse (biphasic, on phase 1 ms) with a 1 s inter-pulse interval (1 Hz). Deliver the stimulation for a total of 120 pulses (2 min). Record continuously for 5 min and set the stimulation to start after 1 min of baseline and stop 2 min before the end of the recording, to obtain a return to baseline period.",
    "Choose a stimulation intensity of 50 µA, as this induced a visible S1 response without the presence of artifacts due to electrical stimulation. Use two separate, battery-powered headstages to perform the stimulation on the paw and the recording of the electrode, allowing for independent grounding and low cross-electrical artifact formation.Co-register each stimulation triggering to the recording system to match the real delivery of stimulation, rather than the estimated onset of the stimulation."
  ],
  "subjectAreas": [
    "Biophysics",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}