{
  "id": 5886,
  "origin_website": "Bio",
  "title": "Generation of Busulfan Chimeric Mice for the Analysis of T Cell Population Dynamics",
  "procedures": [
    "Note: The steps in this procedure are summarised in Figure 1. All animal procedures were performed in accordance with UK Home Office regulations.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171206/20171206222433_5270.jpg Figure 1. Generation of busulfan chimeric mice. This schematic summarises the principal steps of this protocol for the generation of busulfan chimeric mice. Bone marrow cells from CD45.2+ donor mice are labeled with biotinylated antibodies to CD3 and TCRb, followed by labelling with streptavidin-coated magnetic beads. Labelled cells are immobilised using a magnet, allowing the unbound fraction to be collected. T cell depleted bone marrow cells are then injected into busulfan-conditioned CD45.1+ host mice.    Busulfan treatment of host CD45.1 mice (Day -2 and Day -1)   Prepare a fresh working solution of 1 mg/ml busulfan by diluting Busilvex (6 mg/ml busulfan) in sterile PBS.  Note: This must be prepared fresh each day and cannot be stored.   Ear mark and weigh each mouse individually prior to each injection and calculate the appropriate volume of working solution required to deliver a dose of 10 μg/g busulfan–i.e., 10 μl of 1 mg/ml working solution per gram of body weight.   Day -2: Deliver appropriate dose of busulfan by intraperitoneal injection.   Allow host mice 24 h recovery after injection.   Day -1: Repeat Steps A1-A4 for a second injection of busulfan. The final dose of busulfan in each mouse is thus 20 μg/g, delivered as two doses of 10 μg/g 24 h apart. Note: Mice remain healthy and alert after busulfan injection. HSC are depleted within 24 h after busulfan treatment (Westerhof et al., 2000).      Preparation of T cell depleted donor CD45.2 bone marrow (Day 0) Note: Cell suspensions can be prepared on the bench; a laminar flow hood is not required.   Euthanise donor mice by cervical dislocation and remove the femur and tibia from both hind legs.",
    "Use a 5 ml syringe fitted with a 25 G needle to flush each of the bones with PBS/BSA (see Recipes), collecting the marrow in a Petri dish.   Filter the bone marrow through a 70 μm cell strainer into a 50 ml tube.   Centrifuge at 300 x g for 5 min at 4 °C, discard supernatant and resuspend in 1 ml PBS/BSA per donor mouse.   Count cells (expect to recover ~40 million cells per donor mouse) and adjust the volume of cell suspension to a concentration of 20-40 million cells/ml.   Add anti-TCRβ and anti-CD3ε biotinylated antibodies to a final concentration of 1 μg/ml for each, incubate with rotation for 30 min at 4 °C.   Centrifuge at 300 x g for 5 min at 4 °C, discard supernatant and resuspend in PBS/BSA at a concentration of at 20-40 million cells/ml.   Transfer cell suspension to 5 ml FACS tubes with lids. Use multiple tubes if necessary, with a volume of 3-4 ml per tube.   Add streptavidin Dynabeads to a bead: cell ratio of approximately 1:1 and incubate with rotation for 30 min at 4 °C.   Insert the tube of beads with cell suspension into the Easysep magnet and incubate for 2 min on ice.   Collect the supernatant containing the unbound fraction of cells into a fresh tube.   Repeat Steps B10-B11 with the collected unbound fraction of cells, to ensure all beads are removed from the cell suspension.   Centrifuge at 300 x g for 5 min at 4 °C, discard supernatant and resuspend in 1 ml PBS/BSA per donor mouse.   Count cells, expecting a loss of 10-40% from the original cell count (Step B5) due to depletion and repeated wash steps.   Confirm depletion of T cells by staining samples of pre- and post-depletion cells with fluorescent streptavidin and analysing by flow cytometry.",
    "Expect to see ~5% of lymphocytes staining positive in the pre-depletion sample, reduced to < 0.5% of lymphocytes in the post-depletion sample.      Bone marrow transplantation (Day 0)   Allow host mice 24 h recovery after the second injection of busulfan before transplantation with T-cell depleted donor bone marrow.   Resuspend T-cell depleted bone marrow in PBS to a concentration of at least 50 million cells/ml.   Deliver 200 μl (i.e., at least 10 million cells) to host mice by intravenous injection into the tail vein."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}