{
  "id": 2218,
  "origin_website": "Cell",
  "title": "Protocol for isolating adult pituitary stem/progenitor cells in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissociation of AL from the pituitary gland in adult mice\nTiming: approx. within 10 min/mouse\nThis section describes how to crack the skull and extract the pituitary gland. An overview of the procedure for pituitary gland extraction is shown in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1692-Fig1.jpg\nFigure 1. Dissection of pituitary gland from mouse\nStep 2: Beheading. Steps 3–4: Removal of skull. Dotted lines indicate the positions to be cut. V: ventral side. D: dorsal side. Step 5: Removal of brain. The tip of the arrow indicates the position to insert the medicine spoon. Step 6: Detachment of the diaphragma sellae. The arrows indicate where to pinch with tweezers. Step 7: The circle indicates the isolated pituitary tissue. Step 8: Excised pituitary glands. Scale bars: 20 mm (step 2), 5 mm (steps 3–8).\nEuthanize the mice by isoflurane overexposure.\nSpray with 75% (v/v) ethanol to generate a sterile environment, followed by decapitation.\nUsing sterile surgical tools, peel the head skin between the ears.\nInsert scissors toward the ears (along the dotted line) to open the skull using the principle of leverage.\nGently insert the medicine spoon between the brain and skull (the tip of the arrow) and scrape out the brain.\nRemove the diaphragma sellae with sharp tweezers without damaging the pituitary gland.\nNote: At both ends (the tip of arrowheads) of the pituitary gland, there is a thin membrane that can be pinched with tweezers, so pinch them and flip them in two places toward the ventral side back to remove the diaphragma sellae.\nTrim the surrounding tissue to make it easier to access the pituitary gland (in the circle).\nGently grasp the pituitary gland with blunt tweezers and transfer to a 35-mm plastic dish filled with 2 mL of HBSS.",
    "Discard the IL and PL from the pituitary gland under a stereomicroscope (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1692-Fig2.jpg\nFigure 2. Separation of anterior lobe (AL) and intermediate lobe (IL)/posterior lobe (PL)\n(A) Dorsal view of the pituitary gland. Dotted lines indicate the boundary between the AL and the IL or the IL and PL. The tip of the arrow indicates the Rathke’s cleft.\n(B) Poke the tip of the tweezers into the border area between the AL and the IL.\n(C) Using the pierced tweezers as a support, peel off the IL/PL with the opposite tweezers.\n(D) Image of the AL and the IL/PL after separation. Scale bars: 1 mm.\nNote: The IL is transparent to light, so it can be used as a guide to stick the tip of the sharp tweezers into the remnant cavity at the border of the AL.\nTransfer the AL to a new 35-mm plastic dish filled with 2 mL of fresh HBSS and carefully isolate with sharp tweezers (split into two) to increase the surface area for the enzymatic reaction.\nProceed to the next step after collecting three individuals.\nPreparation of a single-cell suspension of primary AL cells\nTiming: approx. within 60 min\nThis section describes steps for the dispersion of primary cells from the AL.\nCollect the AL fragments in a new 35-mm plastic dish filled with 1.8 mL of AM.\nAdd 0.2 mL of 2% collagenase solution and mix by pipetting.\nTransfer the AL fragments (with AM) to a 15-mL conical tube using a micropipette (P1000) and incubate in a water bath at 37°C for 15 min. Mix by tapping the conical tube, once every 5 min.\nWithout removing the supernatant, add 5 μL of DNase I solution. Mix by tapping the conical tube 5 times, followed by incubation at 37°C for 5 min.",
    "Centrifuge at 100 × g for 5 min at 20°C–25°C and remove the supernatant using a pipette.\nAdd 2 mL of digestion buffer A, followed by incubation at 37°C for 5 min.\nAdd 2 mL of AM to stop the trypsin reaction.\nCentrifuge at 100 × g for 5 min at 20°C–25°C and remove the supernatant using a pipette.\nAdd 2 mL of fresh AM and then dissociate the AL into single cells. Specifically, aspirate and expel the AL with a micropipette (dial is set to 1,000 μL) multiple times (approximately 10–20 times) until fragments are no longer visible.\nCount the number of primary AL cells.\nTwo-dimensional (2D) culture of primary AL cells\nTiming: approx. 7 days\nThis section describes steps for initial growth and expansion of primary AL cells.\nSeed at 75,000 cells/500 μL on the glass surface (4.52 cm2) of a glass-bottom dish (Figure 3[href=https://www.wicell.org#fig3]). Transfer to a CO2 incubator (5% CO2/95% air) and preculture at 37°C for 30–60 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1692-Fig3.jpg\nFigure 3. Points to note while seeding the primary cells\nStep 22: Make a droplet so that the culture fluid does not overflow from the glass surface of the glass-bottom dish. Step 23: Drip the culture medium from around the droplet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1692-Fig4.jpg\nFigure 4. Growth of primary anterior lobe (AL) cells isolated from mouse pituitary gland\nRepresentative phase contrast images are shown in the cell culture on a glass-bottom dish (A–C) or a plastic dish (D–F).\n(A and D) Primary AL cells immediately after medium change (day 1 of culture) (d1).\n(B and E) Primary AL cells on day 4 of culture (d4).\n(C and F) Primary AL cells on day 7 of culture (d7). Scale bar: 300 μm.\nCritical: If the volume exceeds 500 μL, the drop will overflow and break down.",
    "Critical: When a plastic dish is used instead of a glass-bottom dish for cell culture, the cells will grow but the cell density will remain low even after 7 days (Figure 4[href=https://www.wicell.org#fig4]).\nAdd 1.5 mL of fresh AM to a glass-bottom dish with a drop, and incubate until the next day.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1692-Fig5.jpg\nFigure 5. Quality check for primary-cultured anterior lobe (AL) cells isolated from the mouse pituitary gland\n(A) Primary-cultured AL cells were subjected to qRT-PCR analysis of the indicated mRNAs. Data were normalized by the amount of Tbp mRNA and are shown as means ± SD (n = 3).\n(B) Representative images of SOX2 (purple) and PRRX1 (green) with DAPI (blue) in primary-cultured AL cells on day 1 (d1) and day 7 of culture (d7) are shown.\n(C) Numbers of SOX2- and PRRX1-positive cells, together with cells stained with DAPI, in primary-cultured AL cells were counted and the proportion of each cell type was calculated. Data shown are means ± SD (n = 3/10 mm2, respectively).\n(D) Merged image of hormones (green) with DAPI in primary-cultured AL cells (day 7) is shown. Scale bars: 100 μm.\nCritical: If GM is used from the beginning, the cells will hardly stick to it and will not proliferate.\nCritical: If you need to check the purity of the adherent cells, perform steps 38 through 47 using cells from the day after seeding. If approximately 80% of the cells are PRRX1-positive at this point, cell selection is proceeding appropriately (Figure 5[href=https://www.wicell.org#fig5]).\nReplace with GM and incubate for another 6 days. Change the entire culture medium every three days.\nRemove the culture medium using a micropipette (P1000) for changing the medium, and rinse twice with 1 mL of HBSS.",
    "Add 2 mL of GM and incubate in a CO2 incubator (5% CO2/95% air) at 37°C.\nProceed to the next step after a total of 7 days of cell culture. Photograph cells using ECLIPSE Ts2-FL (Figure 4[href=https://www.wicell.org#fig4]).\nGene expression profiles of primary-cultured AL cells by quantitative reverse transcription real-time polymerase chain reaction (qRT-PCR)\nTiming: approx. 5 h\nThis section describes steps for the analysis of gene expression levels in primary-cultured AL cells.\nProceed up to step 25.\nRemove the culture medium using a micropipette (dial is set to 1,000 μL) and then rinse twice with 1 mL of HBSS.\nLyse cells by adding 100 μL of LB1 (One of the components of the NucleoSpin RNA Plus XS kit) onto the glass surface of a glass-bottom dish for 5 min at 20°C–25°C.\nExtract the total RNA using the NucleoSpin RNA Plus XS kit according to the manufacturer’s instructions and measure its concentration using an absorption photometer such as NanoDrop.\nSynthesize complementary DNA (cDNA) from 250–500 ng of total RNA.\nPrepare the following mixture in a microtube.\ntable:files/protocols_protocol_1692_14.csv\nHeat at 65°C for 5 min and cool immediately on ice.\nPrepare the reaction mixture by combining the following to a total volume of 20 μL.\ntable:files/protocols_protocol_1692_15.csv\nPerform the reaction at 42°C for 60 min.\nHeat at 70°C for 15 min and cool on ice.\nDilute with sterile water to a concentration of cDNA derived from 10 ng/μL total RNA equivalent. Store at −30°C until use.\nPrepare the following premix for qRT-PCR.\ntable:files/protocols_protocol_1692_16.csv\nAdd 9.5 μL of the premix followed by 0.5 μL of diluted cDNA to 8-stripe tubes or a 96-well plate, mix, and centrifuge briefly.",
    "Perform qRT-PCR using a CFX Connect Real-Time PCR Detection System (Bio-Rad Laboratories, Hercules, CA, USA) according to the manufacturer’s protocol of the SYBR Green Real-time PCR Master Mix Plus (Toyobo Co., Ltd., Osaka, Japan).\nCalculate the relative gene expression by comparing cycle times for each targeted PCR.\nNormalize target gene expression levels using TATA-box-binding protein (Tbp) as an internal standard gene (ΔCt).\nChecking the stemness marker of primary-cultured AL cells by immunofluorescence analysis\nTiming: approx. 2 days\nThis section describes steps for immunofluorescence analysis of primary-cultured AL cells.\nProceed up to step 25.\nRemove the culture medium using a micropipette, and then rinse twice with 1 mL of HBSS.\nNote: All further operations should be performed in a humidified chamber to prevent drying.\nFix the cells by adding 180 μL of the 4% PFA solution, which was brought to 20°C–25°C in advance, onto the glass surface of the glass-bottom dish for 20 min at 20°C–25°C.\nRemove the 4% PFA solution using a micropipette, and then wash the cells three times for 5 min each with 1 mL of HBSS.\nPermeabilize the cells by adding 180 μL of HEPES-T with 10% normal donkey serum (blocking buffer), which was brought to 20°C–25°C in advance, onto the glass surface of the glass-bottom dish for 60 min at 20°C–25°C.\nRemove the blocking buffer using a micropipette and incubate permeabilized cells by adding 180 μL of primary antibody mixes (appropriately diluted in the blocking buffer and brought to 20°C–25°C in advance) onto the glass surface of the glass-bottom dish for 12–16 h at 20°C–25°C.\nRemove the antibody solution using a micropipette, and wash the cells three times for 5 min each with 1 mL of HBSS.",
    "Incubate permeabilized cells by adding 180 μL of secondary antibodies mixes (appropriately diluted in the blocking buffer and brought to 20°C–25°C in advance) onto the glass surface of the glass-bottom dish for 1 h at 20°C–25°C.\nRemove the antibody solution using a micropipette, and wash the cells three times for 5 min each with 1 mL of HBSS.\nStain the nucleus by adding 100 μL of VECTASHIELD Mounting Medium with DAPI onto the glass surface of the glass-bottom dish for 2 h at 20°C–25°C.\nPerform fluorescence observation and acquire immunofluorescent images using a fluorescence microscope (i.e., IXplore Pro with the imaging software cellSens Dimension System, Olympus, Tokyo, Japan).\nChecking the differentiation capacity of primary-cultured AL cells\nTiming: approx. 5 days\nThis section describes steps for the aggregate formation from primary-cultured AL cells and its immunofluorescence analysis.\nProceed up to step 25.\nRemove the culture medium using a micropipette and then wash twice with 1 mL of HBSS.\nAdd 2 mL of digestion buffer B, followed by incubation at 37°C for 15 min.\nAdd 2 mL of DM to stop the trypsin reaction.\nTransfer the cell suspension to a 15-mL conical tube using a micropipette (P1000).\nCentrifuge at 100 × g for 5 min at 20°C–25°C and then remove the supernatant.\nAdd 2 mL of fresh DM and then suspend into single cells. Specifically, aspirate and expel the AL with a micropipette (dial is set to 1,000 μL) multiple times (approximately 10 times).\nSeed at 5,000 cells/100 μL/1 well in non-adherent, U-bottom 96-well plates, and then transfer to a CO2 incubator (5% CO2/95% air) and culture at 37°C for 4 days.\nCollect all aggregates from one plate into a 15-mL conical tube using a micropipette (P200).\nCentrifuge at 100 × g for 5 min at 20°C–25°C and then remove the supernatant.",
    "Resuspend aggregates in a small volume (up to 50 μL) of DM and keep on ice.\nSolidify the sample into a jelly-like substance using the iPGell kit according to the manufacturer’s instructions.\nAdd 1.3 mL of the 4% PFA solution and gently pipette the sample so that it peels off from the tube, and fix samples by rotating for 1 h at 4°C.\nRemove the 4% PFA solution using a micropipette and then rinse samples with 1 mL of HBSS.\nRemove HBSS using a micropipette and immersed samples in the 30% trehalose solution for 24 h at 4°C.\nEmbed the sample in O.C.T. Compound at –80°C before being sectioned.\nSection the frozen sample at a thickness of 8 μm and mount on glass slides.\nPerform immunofluorescence analysis as in step 41 through step 47.\nNote: Change the volume of all solutions (i.e., antibody mixes) to 50 μL."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Cell Differentiation",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}