{
  "id": 15310,
  "origin_website": "Jove",
  "title": "Concanavalin A-Based Sedimentation Assay to Measure Substrate Binding of Glucan Phosphatases",
  "procedures": [
    "1. Preparation of ConA-Sepharose beads\nMake 250 mL of a binding buffer containing 67 mM HEPES (pH 7.5), 10 mM MgCl2, and 0.2 mM CaCl2. Adjust the pH using 1 M NaOH solution.\nPipette 250 μL of ConA-Sepharose bead suspension into a 1.5 mL microcentrifuge tube. Centrifuge the contents at 10,000 x g for 30 s at 4 °C. Discard the supernatant.\n\tNOTE: 250 µL of ConA-Sepharose beads in a 1.5 mL microcentrifuge tube is needed for each amylopectin concentration used for the assay.\nAdd 750 µL of the binding buffer to each tube containing 250 µL of ConA-Sepharose beads. Centrifuge the tubes at 10,000 x g for 1 min at 4 °C. Remove the supernatant. Repeat this step 2x to ensure that the beads are appropriately washed and equilibrated with the binding buffer.\n2. Preparation of amylopectin solutions\nMake a stock solution of 10 mg/mL potato amylopectin. Amylopectin is water-insoluble and can be solubilized by heat. To solubilize, add 0.1 g of potato amylopectin to 10 mL of distilled water. Heat the suspension in a water bath at 80 °C for 1 h or until the solution is no longer cloudy.\nAllow the solution to return to room temperature (RT), with repeated vortexing to avoid clumping.\nAlcohol-alkaline treatment is an alternative method to solubilize amylopectin substrates. To solubilize using this method, follow the steps below.\n\t\nSuspend 0.5 g of amylopectin substrate in 5 mL of 20% ethanol and 5 mL of 2 M NaOH. Stir the contents vigorously for 15-20 min at RT.\nNext, add 10 mL of water, and adjust the pH of the solution to 6.5 by adding 2 M HCl. Bring up the volume of the resulting solution to 50 mL with distilled water to make a 10 mg/mL amylopectin solution.",
    "Dilute the 10 mg/mL solubilized amylopectin solution to make a series of 2 mL of diluted amylopectin solutions. For example, perform half dilutions of 10 mg/mL to prepare a series of amylopectin concentrations (5 mg/mL, 2.5 mg/mL, 1.25 mg/mL, 0.625 mg/mL, 0.3125 mg/mL, 0.156 mg/mL, 0.078 mg/mL, 0.039 mg/mL, 0.019 mg/mL, and 0 mg/mL).\n3. Preparation of ConA-Sepharose: amylopectin beads\nAdd 250 µL of each diluted amylopectin solution to 1.5 mL microcentrifuge tubes containing 250 µL of ConA-Sepharose beads pre-equilibrated in binding buffer. Mix the contents well. Label the tubes with the corresponding amylopectin concentration.\nIncubate the contents on a rotating wheel at 4 °C for 30 min.\n\tNOTE: There is no change in the ConA-Sepharose:amylopectin bound complex over time after 20 min. The 30 min incubation time was chosen by varying incubation times from 10 min to 1 h to ensure equilibrium was reached.\nCentrifuge the tubes at 10,000 x g for 1 min. Collect the supernatant in a newly labeled 1.5 mL microcentrifuge tube. Save these supernatant fractions to perform D-glucose assay12 (acid hydrolysis of amylopectin followed by UV determination of glucose via enzymatic assay). This step is necessary to ensure all amylopectin is bound to the beads.\nAdd 750 µL of binding buffer to the ConA-Sepharose:amylopectin beads. Centrifuge the tubes at 10,000 x g for 1 min. Discard the supernatant to remove any unbound amylopectin molecules.\nRepeat step 3.4 to ensure sufficient washing. Each tube now contains ConA-Sepharose beads bound to varying amounts of amylopectin substrates.\n4. Incubating SEX4 with ConA-Sepharose:amylopectin beads\nMix 250 µL of ConA-Sepharose:amylopectin beads with 100 µL of the binding buffer which includes 10 µg of SEX4 protein, 10 mM dithiothreitol (DTT), and 10 µM protease inhibitor cocktail (PIC). Note that the total volume in each tube is 350 µL.",
    "NOTE: A protease inhibitor cocktail is added as a precautionary step to avoid any unnecessary SEX4 degradation. This is an optional step. In this assay, the recombinant protein Arabidopsis thaliana SEX4 (AtSEX4) is used. The purified protein contains an N-terminal histidine tag necessary for detecting the protein via chemiluminescence. Detailed information on glucan phosphatase purifications is described in previous publications14,20,24.\nIncubate the protein and ConA-Sepharose:amylopectin bead suspension at 4 °C for 45 min with gentle rotation.\n\tNOTE: The 45 min incubation time is chosen to ensure equilibrium is reached for the complex.\nCentrifuge the tubes at 10,000 x g for 1 min. Pipette 50 µL of the supernatant carefully using a gel loading tip into a new 1.5 mL microcentrifuge tube. Add 20 µL of 4x SDS-PAGE dye and 10 µL of water to each tube containing 50 µL of the collected supernatant fractions. Heat the samples at 95 °C for 10 min. Save these samples for running the SDS-PAGE gels. Ensure 10 new tubes labeled \"supernatant (S)\" have the corresponding substrate concentrations.\nAdd 750 µL of the binding buffer to the ConA-Sepharose:amylopectin: SEX4 beads to remove any unbound protein from the beads. Centrifuge the tubes at 10,000 x g for 1 min. Repeat this step one more time to ensure proper washing. Discard the supernatant.\nAdd 20 µL of 4x SDS-PAGE dye and 80 µL of distilled water into the tubes containing washed ConA-Sepharose:amylopectin:SEX4 beads. Heat the samples at 95 °C for 10 min and centrifuge at 10,000 x g for 1 min.\nDiscard the pellet and save the supernatant for running the SDS-PAGE gels. Pipette 80 µL of the supernatant into new tubes and label them as \"pellet (P)\".\n5. Running SDS-PAGE gels",
    "Load 40 µL of the unbound protein samples (made in step 2.3, labeled S) into 4%-12% precast polyacrylamide gel wells from the lowest substrate concentration to the highest, but keep the first lane free to load the protein molecular weight marker. Use a second gel to load 10 bound protein samples made in step 2.5 (labeled as P).\nAdd freshly prepared 1x SDS-PAGE running buffer to both chambers of the apparatus. Run the gel at 150 V for 35 min or until the dye front reaches the bottom of the gel.\nRemove the run gel from the apparatus and remove the spacers and glass plates. Use the separated gel to run a western blot analysis.\n6. Western blotting for chemiluminescence detection14,15\nNOTE: This method can be easily modified/adapted depending on the western blotting equipment that users have in their labs.\nMake 1 L of transfer buffer containing 5.8 g of Tris base, 2.9 g of glycine, 0.37 g of SDS, and 200 mL of methanol.\nTransfer the size-separated proteins from the polyacrylamide gel to a nitrocellulose membrane. Briefly assemble the sponges, filter papers, gel, and nitrocellulose membrane according to western transfer protocol14,15. Run at 70 V for 1 h.\nTo prevent nonspecific protein binding, incubatethe nitrocellulose membrane containing the protein solution of 1%-5% bovine serum albumin (BSA) or milk protein in 50 mL of TBST buffer (20 mM Tris [pH 7.5], 150 mM NaCl, 0.1% Tween 20) for 1 h. Wash the membrane 3x using TBST buffer to remove any unbound blocking solution.\nIncubate the membrane with a horseradish peroxidase (HRP)-linked antibody specific for His-tagged protein for 1 h. Wash the membrane 3x in TBST buffer to remove any unbound antibodies. Use a 1:2,000 dilution of antibody to TBST for optimal reproducibility and sensitivity.",
    "The HRP enzyme-linked antibody binds specifically to the histidine tag of the SEX4 protein, which yields a band in the presence of chemiluminescence reagents. For digital imaging, make a solution of equal parts of chemiluminescent substrate solutions (750 µL each) in a 1.5 mL tube. Incubate the membrane for at least 5 min in the solution.\nPlace the membrane protein side down on the blot scanner and run the acquisition software to quantify the protein in both the pellet and supernatant fractions.\n7. Data analysis\nPerform the quantitative signal measurements using the acquisition software with the blot scanner. Normalize all quantitative measurements in the supernatant and pellet fractions to the total protein loaded.\n\tNOTE: The software allows to quantify the intensity of each protein band in the supernatant and pellet fractions.\nIn the saturating binding experiment, plot the percentage of protein-bound versus amylopectin concentration. Fit the data to Y = Bmax x X/(KD + X), using data analysis software to calculate KD.\n\t​NOTE: Bmax is the maximum specific binding, the Y-axis is the percentage of protein bound, the and X-axis is the amylopectin concentration.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64700/64700fig01.jpg\nFigure 1: Overview of the ConA-Sepharose sedimentation assay workflow. (A) Preparation of ConA-Sepharose beads. (B) Incubation with amylopectin substrate. (C) Incubation with SEX4 protein. (D) Separation of bound and unbound protein fractions through centrifugation. (E) Separation of protein through SDS-PAGE. (F) Western-blot analysis. (G) Chemiluminescence detection of His-tagged SEX4 protein. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64700/64700fig01large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}