{
  "id": 5520,
  "origin_website": "Bio",
  "title": "Analysis of <em>in vivo</em> Interaction between RNA Binding Proteins and Their RNA Targets by UV Cross-linking and Immunoprecipitation (CLIP) Method",
  "procedures": [
    "Cell culture preparation and UV cross-linkingGrow adherent PDAC cells until they reach 70-80% confluence. Usually, 5-10 x 106 cells are used for each immunoprecipitation (IP).Discard the medium and wash once with cold PBS. Add 4-5 ml of PBS in 100 mm cell culture Petri dish (~1 ml/cm2). Place the dish on ice without lid. Irradiate once with 400 mJ/cm2 (see Figure 1).Note: UV irradiation produces a covalent bound between RNA and protein that are in contact. The energy level to use depends on availability of aromatic acids. This covalent bound allows purification of RBP/RNA complex under stringent condition. The choice of UV irradiation should be set as the minimum irradiation that allows purification of a control RNA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170515/20170515032513_9672.jpgFigure 1. UV cross-linking. UV cross-linking was performed to bind RNA covalently with proteins. During irradiation the dish is kept on ice to minimize heating.Remove the PBS and add 0.5 ml of lysis buffer into the 100 mm dish. Note: Do not exceed with lysis buffer. Alternatively, gently scrape off the cells in cold PBS. Centrifuge for 5 min at 300 x g, at 4 °C. Discard the supernatant, snap freeze the pellets in liquid nitrogen and store at -80 °C.Cell lysisGently resuspend the cells in lysis buffer and transfer the suspended cells to a 1.5 ml centrifuge tube and sonicate on ice [Set: Amplitude (%) at 100 and Cycle at 1] (see Figure 2). Note: Cells tend to aggregate in lysis buffer. Sonication is required to completely dissolve cells aggregate. Usually 5 sec is enough. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170515/20170515033035_3552.jpgFigure 2. Cells sonication. Sonication was performed to dissolve cells aggregate. During sonication the tube is kept in ice to minimize protein denaturation.Incubate the cells for 10 min on ice. Add 5 µl per ml of sample of Turbo DNAse. Incubate for 3 min at 37 °C.",
    "Centrifuge at 15,000 x g at 4 °C for 3 min. Collect the supernatant (cell extract), dilute sample to 1 mg/ml in lysis buffer and store in ice. Note: Lysis buffer composition interferes with Bradford assay. No more than 1 µl of cell extract should be added to 1 ml of Bradford solution.RNA fragmentation and RBP immunoprecipitation For each IP use 10 µl of Protein G Dynabeads.Wash Protein G Dynabeads with 500 µl of lysis buffer and mixing the suspension. Place the tube containing the suspension in the magnetic stand and remove the supernatant. Repeat this step 3 times. Resuspend the Protein G Dynabeads in 100 µl of lysis buffer and add 3-5 µg of specific polyclonal antibody. Use IgG isotype as a negative control. Collect 3 aliquots of 10% of cell extract (100 µg) (Input) before adding RNase I. Note: Aliquots of inputs are required for (i) quantitative analysis of RBP binding (see steps D1a and F3), (ii) evaluation of RBP IP (see step C10a), and (iii) for evaluation of RNAse I fragmentation (see step D3, and Figure 4).Add 1 ml of cell extract (1 mg) to 100 µl Protein G Dynabeads (see step C2). Store on ice. Prepare a dilution of RNase I 1:1,000 in lysis buffer. Add to each IP 10 µl of RNase I 1:1,000.Rotate at 4 °C for 2 h. After incubation place the samples in the magnetic stand, collect supernatant aliquots (100 µl) from each IPs and discard the residual supernatant. Store aliquots on ice. Note: Aliquots are required for evaluation of RNAse I fragmentation (see step D3, and Figure 4).Wash IPs twice with 1 ml of high salt buffer and 2 times with 1 ml proteinase K buffer. Resuspend the Dynabeads in 100 µl of proteinase K buffer.",
    "Collect an aliquot of 10% of suspension (10 µl) from each IP. Add 10 µl of Laemmli buffer (2x) to the aliquots and boil aliquot for 5-10 min at 100 °C (see step C10a).Note: Aliquots are required for evaluation of RBP IP by Western-blot analysis (see C10a).  Control of RBPs IPRun an SDS-PAGE following Western blot analysis using aliquots from step C2 (input) and aliquots from step C10 (IP) samples (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170515/20170515033328_2038.jpgFigure 3. Control of RBP immunoprecipitation in HEK293T cells. Western blot analysis of aliquotes (10%) from step C2 (Input) and step C10 (IPs).RNA isolationFrom IPs:RNA is eluted by adding 50 µg of proteinase K (2.5 µl of proteinase K solution) to 90 µl of the remaining IP suspensions (step C10).Incubate for 1 h at 55 °C. Place samples in the magnetic stand, collect the supernatants and add water up to 300 µl. Add at each supernatant 1 volume of phenol:chloroform:isoamilic alcohol (25:24:1).Mix vigorously for 10 sec. Incubate for 10 min at room temperature. Centrifuge at 15,000 x g for 10 min. Collect the supernatant. Add 1/10 volume of 3 M sodium acetate (pH 5.2).Mix and add 2.5 volume of ethanol absolute.Mix and incubate overnight at -20 °C. After incubation, centrifuge at 15,000 x g for 15 min. Discard the supernatant and wash the RNA pellet with 1 ml of 70% ethanol. Centrifuge at 15,000 x g for 10 min. Discard the supernatant and air dry the pellet.From Input:50 µg of proteinase K (2.5 µl of proteinase K solution) was added to one of 10% input aliquot (step C2). Incubate for 1 h at 55 °C.RNA is recovered by adding 1 ml Trizol to the samples. Incubate for 5 min at RT. Add 200 µl of chloroform and mix vigorously. Centrifuge at 12,000 x g for 15 min.",
    "After centrifugation, collect half of aqueous phase (≈ 250 µl) to avoid DNA contamination. Note: In our experience, treatment of RNA input sample with DNAse is not sufficient to remove DNA contamination. We prevent DNA contamination by collecting only half of the aqueous phase and avoiding to touch the interphase layer during RNA isolation with Trizol reagent. Add 1 volume of 100% isopropanol. And incubate for 10 min at RT. Centrifuge at 12,000 x g for 15 min and discard the supernatant. Wash RNA pellet with 1 ml of 70% ethanol. Centrifuge at 12,000 x g for 10 min. Discard the supernatant and air dry the pellet.Control of RNAse I fragmentationAdd 50 µg of proteinase K (2.5 µl of proteinase K solution) to one aliquot from step C2 and step C7.Incubate for 1 h at 55 °C. Add 1 volume of phenol:chloroform:isoamilic alcohol. Proceed as described in steps D1e-D1m.Resuspend the RNA in 20 µl of nuclease-free water. After quantification at 260 nm, load the samples on 1.5% denaturating agarose gel for evaluation of RNA fragmentation (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170515/20170515033643_7572.jpgFigure 4. Control of RNA fragmentation. Denaturating agarose gel (1.5%) showing RNA fragmentation in presence of different RNAse I dilutions (1:500 corresponds to 2 U/ml of RNase I), and in presence of different extract concentration (0.8 and 2 mg/ml, left and right panel respectively). The optimal RNA fragmentation is indicated (red box).Reverse transcription (cDNA synthesis)Resuspend the RNA pellets from steps D1m and D2k in the same volume of nuclease free water. Note: Volume of water depends on the cDNA synthesis kit used. Heat for 5 min at 55 °C and store on ice. Perform cDNA synthesis according to manufacturer’s instructions using half volume of RNA samples. Use the other half to perform cDNA synthesis reaction in absence of reverse transcriptase enzyme (negative control).",
    "cDNA synthesis has to be performed using random hexamer primers. Note: Negative control is required to evaluate DNA contamination in all samples.Real-time quantitative PCR (qRT-PCR)Design pairs of primer located in different regions of the pre-mRNA, including the region embedding the RBP binding site (Figure 5).Notes:  Optimal PCR product length is 100 nt. If RBP binding site is not known, it is possible to identify the region in which this is embedded by using several primers pair designed to span the entire pre-mRNA.Perform qRT-PCR according to manufacturer’s instructions.Note: Quantification cycle (Cq) of negative control should be at least 6 cycles less than relative sample (i.e., Cq negative control = 36; Cq sample = 30).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170515/20170515033909_6969.jpgFigure 5. Schematic representation of primers position along the pre-mRNA for evaluation of RBP binding"
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}