{
  "id": 19845,
  "origin_website": "Wiley",
  "title": "Immunoelectron Microscopy of Viral Antigens",
  "procedures": [
    "The following protocol describes the basic steps in immunolocalization of antigenic components of a viral particulate sample. This technique allows for detection of particular antigens within the sample by using a colloidal gold label, which can be visualized by TEM as small, electron-dense objects. The sample used for antigen detection could be prepared from live virus (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0003]), inactivated virus, viral-like particles, purified proteins, or viral-based vaccines. Samples should be well dispersed and dilute enough that individual particles on the grid are spaced sufficiently to unambiguously assign the target of the colloidal gold marker when visualized by TEM. This can be determined through negative staining of the sample (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0004]). This protocol assumes that samples are stable without fixation. If necessary, a fixative agent such as paraformaldehyde can be used after applying samples to the grid before proceeding to incubation with antibodies. Antigens are labeled first with primary antibody targeting the antigen of interest and then with colloidal gold–conjugated secondary antibodies. Colloidal gold–conjugated protein A or protein G can be used as an alternative to colloidal gold–conjugated secondary antibody. Another alternative would be to use a colloidal gold–conjugated primary antibody, in which case no secondary antibody is needed. All procedures are carried out at room temperature.\nMaterials\nViral particulate sample (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0003] for preparing live virus)\nDistilled water\nBlocking buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0001])\nPrimary antibody targeted to antigen of interest\nPrimary antibody targeted to irrelevant antigen (in same species)\nWash buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0007])\nColloidal gold–conjugated secondary antibody targeted to species of primary antibodies (e.g., Aurion, SPI Supplies, or Nanoprobes)\nNegative staining solution (e.g., phosphotungstic acid [PTA]; see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0004])\nParafilm\nCarbon-coated TEM grids, 300 or 400 mesh (e.g., Ted Pella, Quantifoil, Electron Microscopy Sciences)\nGlass microscope slide",
    "Glow discharge unit (e.g., PELCO easiGlow™ Glow Discharge Cleaning System, Ted Pella)\nSelf-locking, fine-point forceps\nWhatman no. 1 filter paper\nHumidified chamber (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0001]A,B)\nGrid storage box (e.g., Ted Pella, Electron Microscopy Sciences)\nTransmission electron microscope\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/ab8f289c-d5fb-4396-bd5b-8c8f97c604d1/cpmc86-fig-0001-m.jpg</p>\nFigure 1\nExample of humidified chamber setup. (A) Schematic of humidified chamber used for immunogold staining protocol. Chamber should have a lid (1) to prevent evaporation. There should be a raised platform (2), on which a piece of Parafilm can be placed (3). Incubation of grids with droplets of antibodies and/or buffers should be performed atop the Parafilm. Next to the platform should be a reservoir of water (4) that provides humidity to the chamber. Be sure to keep the grids on the Parafilm away from the water reservoir. (B) Humidified chamber used for the experiments described in this article. Chamber is made of an empty pipet tip box, 1.5-ml microcentrifuge tube storage box, Parafilm, and water.\nViral particulate deposition\n1. Cut a piece of Parafilm from a roll, and place wax-side down on a clean benchtop. Remove paper overlay.\nTo ensure that the Parafilm adheres to the benchtop, a small amount of water can be placed onto the benchtop surface before placing the Parafilm on top.\n2. Optional: Make carbon coating on grid(s) more hydrophilic using a glow discharge unit. To do so, place grid(s) carbon-coated side facing upwards on a glass microscope slide, and insert slide into glow discharge unit. Treat grids for 25 sec at 15 mA.\n3. Deposit viral suspension onto TEM grids to the carbon-coated side, either by (a) floating the grid carbon-side down on a drop of sample or (b) direct deposition of the viral sample onto the carbon-coated side of the grid as follows:",
    "For each grid, pipet 15 to 25 μl sample onto the Parafilm. Using forceps, gently place grid carbon-coated side down onto the droplet of sample, being careful to not submerge the grid in the droplet. Allow sample to incubate with the grid for 1 min.\nFor each grid, use self-locking forceps to hold the grid carbon-coated side facing upward. Directly pipet 2 to 5 μl sample onto the surface of the grid, being careful to not bend the grid. Allow sample to incubate with the grid for 1 min.\n4. Pipet 15 to 25 μl distilled water per grid onto the Parafilm.\n5. Carefully pick up each grid by an edge using self-locking forceps, and then remove excess liquid from each TEM grid using one of two methods:\n         \nCarefully wick away excess liquid from the grid surface by allowing the grid to touch the edge of filter paper. Ensure the grid does not dry completely.\nGently tap the side of the forceps against the edge of a gloved finger, allowing excess liquid to drop onto a piece of filter paper. Be careful not to use aggressive force, as doing so could cause the grid to fall off the forceps.\n6. Before grids fully dry, transfer to water droplets prepared on the Parafilm, with carbon-coated side down interacting with the water. Be careful to float each grid on the droplet, rather than submerging the grid into the droplet. Allow grids to remain on water droplets for ∼1 min.\nAntigen detection\n7. In the humidified chamber, set up another piece of Parafilm, wax-side down. Pipet 15 to 25 μl blocking buffer per grid. Leave enough room on the Parafilm for other droplets to be added later.",
    "The humidified chamber is a container with sealable lid with reservoir of water or water-soaked paper towels (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0001]).\nThe presence of Tween 20 in the blocking buffer creates a droplet that spreads on the Parafilm surface more than phosphate-buffered saline (PBS) alone.\n8. Using self-locking forceps, pick up each grid by an edge, and gently remove excess liquid, as described in step 5. Immediately float each grid on a droplet of blocking buffer, carbon-coated side down, before it has an opportunity to dry. Seal the lid of the humidified chamber, and allow grids to incubate with blocking buffer for 15 to 30 min.\n9. For each grid, pipet 15 to 25 μl primary antibody of an appropriate dilution in blocking buffer onto the Parafilm in the humidified chamber. Carefully pick up each grid from the blocking buffer using self-locking forceps, and gently remove excess liquid without allowing the grid to dry. Float grids in primary antibody, and seal the lid of the humidified chamber. Allow grids to incubate on the droplets of primary antibody for 1 to 2 hr.\nThe antibody dilution will need to be empirically determined to identify the best antibody concentration, which has sufficient labeling with minimal background signal. Serial 10-fold dilutions of antibody may be useful in determining the appropriate concentration. The authors have found that ideal antibody concentrations are usually in the range of 0.1 to 1 μg/ml. To evaluate the specificity of binding, control grids using an irrelevant antibody derived from the same species as the primary antibody of interest should be prepared at the same concentration as the determined concentration of the antibody of interest.",
    "10. Wash each grid five times. To do so, for each grid pipet five droplets consisting of 15 to 25 μl wash buffer onto the Parafilm on the benchtop. Pick up grid from the blocking buffer with self-locking forceps, ensuring that the grid does not get submerged into the droplet. Remove excess liquid, and then immediately transfer grid to the wash buffer, ensuring the grid floats on top of the droplet. Let the grid incubate for 3 min, and then remove excess liquid before transferring the grid to the next droplet of wash buffer. Repeat this process until each grid has been washed five times.\nIf the room has very low humidity, the volume of wash buffer can be increased to prevent evaporation, or this step can be done in the humidified chamber.\n11. While the grids are incubating with wash buffer, for each grid, pipet 15 to 25 μl colloidal gold–conjugated secondary antibody diluted in blocking buffer onto the Parafilm in the humidified chamber. After the wash step is complete, transfer each grid from the last droplet of wash buffer to a droplet of secondary antibody, removing excess liquid as described in step 5. Seal the humidified chamber, and allow grids to incubate for 60 min.\nThere are numerous commercially available colloidal gold–conjugated antibodies (e.g., Aurion, SPI Supplies, Nanoprobes) that come in a variety of size ranges. The authors recommend using colloidal gold in the range of 5 to 25 nm.",
    "The colloidal gold–conjugated secondary antibody should be diluted in blocking buffer until the reddish color of the colloidal gold is barely detected by eye in the diluted solution. The authors recommend using a 1 in 20 dilution as a starting point. Before pipetting each droplet, the solution should be gently mixed, as the colloidal gold may settle in the tube.\n12. Wash each grid five times in wash buffer using the method described in step 10. Then wash each grid three times in distilled water using the same method.\nIt is important to wash the grid in water before proceeding to staining the grid, as salt ions in the PBS-containing wash buffer may interfere with uniform deposition of the stain and result in electron-dense crystals that obscure visualization of the sample.\nNegative staining\n13. Pipet 15 to 25 μl negative staining solution per grid to the Parafilm on the benchtop. Using self-locking forceps, gently pick up the grid(s) from the distilled water, and remove excess liquid from the grid(s). Then transfer each grid to the surface of the negative staining solution for 30 to 60 sec.\n14. Optional: Add an additional quick washing step after incubating the grid(s) with the negative staining solution if staining is too dense as determined by negative staining (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0004]). To do so, while the grid(s) incubate with the negative staining solution, pipet 15 to 25 μl water for each grid onto the Parafilm. After the grid(s) have incubated with the staining solution, remove excess liquid as described in step 5. Then use self-locking forceps to touch each grid to a droplet of water, and immediately remove excess distilled water.",
    "15. Remove excess liquid from the grid(s), and touch the edge of each grid to a wedge of filter paper until the grid(s) appear dry.\nSome of the negative staining solution may be trapped between the arms of the self-locking forceps during the blotting process. To remove this liquid, gently slide the pointed tip of the filter paper wedge between the arms of the forceps, being careful not to drop the grid in the process.\n16. Allow grid(s) to air dry fully before inserting into a transmission electron microscope.\nAllowing the grids to fully dry will prevent damage to the sample and microscope contamination. Grids can be stored in a grid storage box in a chamber with desiccant to accelerate the speed of drying.\n17. Examine grid(s) by TEM operated at 80 kV or higher, using an objective aperture to increase contrast.\nThe colloidal gold will appear as small, electron-dense (black) dots located near the antigen of interest in the microscope. See Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0002] for an example of a viral vaccine sample (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0002]A) with immunogold labeling (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0002]B,C).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/766acdc9-2418-4481-a647-74c2cc032e16/cpmc86-fig-0002-m.jpg</p>\nFigure 2\nImmunoelectron microscopy of Flublok (Sanofi Pasteur), a commercially available influenza vaccine from 2017 to 2018 containing hemagglutinin from H1N1, H3N2, and influenza B viruses. (A) Negative stain of vaccine stained with 3% PTA. Scale bar, 100 nm. (B) Vaccine labeled for H1N1 hemagglutinin using polyclonal rabbit antibody and 10-nm gold-conjugated goat anti-rabbit antibody (Aurion). Note that the complexes are small enough that antibody binding appears to alter the size of the complex (red arrows), as the antibodies can also be visualized. Scale bar, 100 nm. (C) Enlarged region from panel B showing complex containing H1N1 hemagglutinin antigen with immunogold labels (red arrow) compared with an unlabeled complex lacking H1N1 hemagglutinin antigens (white arrow). Scale bar, 50 nm.",
    "Probing for multiple antigens with immunoelectron microscopy in a suspension of viral particulates can be a powerful tool for understanding molecular organization of a sample. However, care must be taken to ensure specific and distinct labeling of antigenic components. The same considerations are required as described in the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001], including sample preparation and optional fixation. Of critical importance, the primary antibodies to be used for multiple labeling must be raised in different animal species (e.g., primary antibody to antigen 1 raised in mice, primary antibody to antigen 2 raised in rabbits, etc.). Colloidal gold–conjugated secondary antibodies must be specific to the species of primary antibodies, without species cross-reactivity that may cause nonspecific labeling (e.g., antibody to mouse IgG raised in goat and antibody to rabbit IgG raised in goat but not antibody raised to rabbit IgG raised in mouse). Each secondary antibody should be conjugated to a different size of colloidal gold to distinguish the labels when imaged by TEM. To ensure that variability in colloidal gold particle size does not create ambiguity when identifying antigens, it is recommended to choose antibody conjugates with differences in colloidal gold size of >5 nm. The following protocol describes steps necessary to label multiple antigens using immunoelectron microscopy of a suspension of viral particulates, whether they are live or inactivated virus (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0003]), viral-like particles, purified proteins, or viral-based vaccines. All procedures are carried out at room temperature.\nAdditional Materials (also see Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001])\nPrimary antibodies targeting antigen of interest raised in different host species\nPrimary antibodies targeting irrelevant antigen raised in different host species\nColloidal gold–conjugated secondary antibody targeted to species of primary antibodies",
    "1. Apply viral suspension sample to TEM grid(s) as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 3, either by direct application to the surface of the grid or by floating the grid on a droplet of sample.\n2. Rinse grid by floating grid on a droplet of distilled water, followed by incubation with blocking buffer for 15 to 30 min in the humidified chamber, as described in the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001].\n3. Prepare primary antibody cocktail solution(s). Freshly mix multiple antibodies to the antigens of interest (or irrelevant antigens as control) raised in different host species, diluted in blocking buffer. Then pipet 15 to 25 µl antibody cocktail solution onto Parafilm in the humidified chamber. Carefully pick up grid(s) floating on blocking buffer, and gently remove excess liquid. Transfer grid(s) to float on the primary antibody cocktail solutions, carbon-coated side down and interacting with the mixture. Allow grid to incubate for 1 to 2 hr.\nThe antibody dilution will need to be empirically determined to identify the best antibody concentration, which has sufficient labeling with minimal background signal. Serial 10-fold dilutions of antibody may be useful in determining the appropriate concentration, and the authors have found that ideal antibody concentrations are usually in the range of 0.1 to 1 μg/ml.\n4. Wash each grid five times with wash buffer on the benchtop, as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 10.",
    "5. While grids are incubating with wash buffer, prepare a fresh cocktail solution of gold-conjugated secondary antibodies diluted in blocking buffer. Pipet 15 to 25 μl secondary antibody cocktail solution for each grid onto the Parafilm in the humidified chamber. Transfer each grid from the last droplet of wash buffer to a droplet of the secondary antibody cocktail solution, making sure to remove excess liquid. Seal the humidified chamber, and allow grids to incubate for 60 min.\nSecondary antibodies can be raised in the same host species but should not be raised in the same species as any of the primary antibodies to avoid cross-reactivity. Each secondary antibody should be conjugated to a different size of colloidal gold.\nAs protein A and protein G can variably bind antibodies to numerous species, gold-conjugated protein A and G are not recommended for multiple labeling of antigens. The cocktail solutions of secondary antibodies should be slightly reddish in color and well mixed before pipetting onto the Parafilm.\n6. Wash each grid five times with wash buffer on the benchtop, and then wash three times in distilled water.\n7. Pipet 15 to 25 μl negative staining solution per grid to the Parafilm on the benchtop. As described in the Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001], float each grid on negative staining solution for 30 to 60 sec.\n8. Optional: Pipet 15 to 25 μl water for each grid onto the Parafilm. After grid(s) have incubated with the staining solution, remove excess liquid as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 5. Then touch each grid to a droplet of water, and immediately remove excess distilled water.\nThis wash step can be included if staining without a wash step is empirically determined to be too dense for sample alone (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0004]).",
    "9. Remove excess liquid from the grid(s), and touch the edge of each grid to a wedge of filter paper until the grid(s) appear dry. Allow grid(s) to air dry fully. Then examine grid(s) by TEM.\nSee Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0003] for an example of influenza virus immunogold labeled against two antigens (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0003]D), with 10-nm and 25-nm colloidal gold labels, compared with virus by only negative stain (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0003]A) and immunogold labeled against a single antigen (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0003]B,C).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0b4cd087-5203-467b-b650-2b4df85ecc97/cpmc86-fig-0003-m.jpg</p>\nFigure 3\nImmunoelectron microscopy of pandemic H1N1 influenza virus (A/California/04/09) produced in MDCK cells. (A) Negative stain of influenza virus stained with 3% PTA. (B) Virus labeled for hemagglutinin with C179 HA-stem binding antibody and 10-nm colloidal gold–conjugated goat anti-mouse antibody. (C) Virus labeled for neuraminidase with polyclonal rabbit antibody and 25-nm colloidal gold–conjugated goat anti-rabbit secondary antibody. (D) Virus double labeled for hemagglutinin (10-nm gold labels) and neuraminidase (25-nm gold labels). Scale bar, 100 nm.",
    "There are many aspects to the structural study of viruses including morphology, glycoprotein presence and distribution, and lipid bilayer organization. In order to visualize these viral characteristics, purified virions must be used. This protocol for viral propagation and purification using a mammalian cell culture system is reproducible, scalable, and lends itself to optimization based on the viral class being grown. The following protocol has been optimized for the propagation of influenza A viruses; however, the steps can be adapted to grow other viruses that require fusion for cellular entry (Hilleman, 2002[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-bib-0011]). Influenza virus infection in Murine-Darby canine kidney (MDCK) cells with optimized viral yield can lead to changes in such a generalized protocol (Ilyushina et al., 2012[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-bib-0013]). Common changes could include the need for TPCK-trypsin, incubation temperature, and the addition or absence of serum in the medium after virus adherence (Eisfeld, Neumann, & Kawaoka, 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-bib-0007]). Cell line clonality can also affect yield. In this protocol standard MDCK cells are used, but alternate types of MDCK cells are available, such as MDCK-SIAT cells that can produce high-yield viral infections (Lugovtsev, Melnyk, & Weir, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-bib-0017]). Viral propagation in a permissive cell type is a crucial factor, and while influenza virus infects not only MDCK cells but also Vero cells, identifying the most appropriate cell line is virus specific. Implementing optimization conditions will have to be empirically determined based on the particular virus being studied. It is important to note that infectious virus can pose a safety concern and may require special handling according to its biosafety levels (BSLs). Consult with your institute's appropriate office concerning the safety and use of viral materials prior to beginning viral growth experiments. This should be addressed when preparing for viral growth and purification, as well as for subsequent immunoelectron microscopy experiments.\nMaterials",
    "Cell line for viral growth (e.g., MDCK cells; ATCC #FR-926)\nDulbecco's Modified Eagle Medium (DMEM; e.g., Quality Biological)\nDMEM containing 5% or 10% fetal bovine serum (FBS) and antibiotics (see recipes[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0002])\n1× PBS, pH 7.4\n0.05% trypsin-EDTA\nInfluenza A virus source\n2.5% TPCK-trypsin (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0006])\n25-cm2 and 75-cm2 flasks (e.g., Corning)\n37°C humidified incubator with 5% CO2\nInverted light microscope\n15-ml conical tube\nCentrifuge\nHost cell preparation\n1. Thaw a new vial of MDCK cells, and add to a 25-cm2 flask with 5 ml prewarmed DMEM containing 10% FBS and antibiotics using sterile technique in a biological safety cabinet. Incubate flask in a 37°C humidified incubator with 5% CO2.\n2. When cells have reached ∼90% confluency, aspirate medium and wash monolayer with 3 ml PBS. Aspirate PBS and add 1 ml of 0.05% trypsin-EDTA. Rock flask back and forth to completely trypsinize the monolayer.\nThe cells will start to slough off the bottom of the flask upon the addition of trypsin.\nThe time it takes to completely trypsinize a monolayer can vary with density of the monolayer as well as age of the cells. The flask with trypsin-EDTA can be left at room temperature in the biological safety cabinet or returned to the incubator at 37°C to aide in trypsinization. Monitor the flask, and as soon as the cells start to slough off the bottom of the flask, proceed to step 3. The detached cells will give a cloudy appearance to the trypsin-EDTA, and when completely detached, the cells can be observed under an inverted light microscope as round and floating.",
    "3. Once all cells have detached from the bottom of the flask, add 12 ml DMEM containing 5% FBS and antibiotics with a serological pipet to quench the trypsinization, and pipet up and down multiple times to disrupt any cell clumps that may be present.\n4. Add cells to a 75-cm2 flask, and incubate in a 37°C humidified incubator with 5% CO2.\nMillions of cells will likely be transferred to the 75-cm2 flask during this step, though an exact cell count from the 25-cm2 flask is not necessary since the entire volume will be used to seed the 75-cm2 flask and since the cell growth surface area is being expanded 3-fold.\n5. Monitor cell growth by observing the monolayer using an inverted light microscope. When monolayer reaches 85% to 90% confluency, proceed to the next step.\n6. Aspirate growth medium from the 75-cm2 flask. Gently rinse monolayer with 5 ml prewarmed DMEM without FBS or antibiotics. Aspirate rinse, being careful to not let the monolayer dry, and add 3 ml DMEM without FBS or antibiotics.\nViral infection\n7. Add multiplicity of infection (MOI) of 0.01 virus source to 200 μl DMEM without FBS or antibiotics. Add complete volume to the flask, and rock to cover the flask, making sure there is full coverage so that the monolayer does not dry.\nInfecting monolayers at an MOI >0.01 plaque forming units/ml (PFU/ml) is a common parameter for influenza virus to prevent multiple viruses from infecting a single cell. For other viruses, a different MOI may be needed. Determining MOI via plaque assays or TCID50 are beyond the scope of this protocol. As this protocol has been optimized using in-house viral stocks, 2 μl virus stock in 200 μl DMEM has been sufficient for infecting a naïve monolayer.",
    "8. Incubate flask in a 37°C humidified incubator with 5% CO2 for 1 hr to absorb the virus to the cell surface. During this hour, periodically and briefly remove flask from the incubator, and rock flask back and forth to distribute the volume of liquid over the monolayer.\n9. After 1 hr, remove flask and add 3 ml DMEM containing 5% FBS, antibiotics, and 0.125 μl of 2.5% TPCK-trypsin. Do not aspirate the previous inoculum.\nThere should be a final volume of ∼6 ml.\nTPCK-trypsin denotes a treatment of trypsin to inhibit contaminating chymotryptic activity. TPCK-trypsin is used in influenza virus growth to cleave and activate influenza-specific glycoproteins but can be omitted for other virus preparations. As is the case with influenza virus, it may be necessary to use reagents specific for a particular virus being produced, and these reagents should be investigated prior to beginning the protocol.\n10. Place flask back in the incubator using the same conditions as described in step 1.\n11. Monitor infection for cytopathic effect (CPE) using an inverted light microscope.\nCPE is observed when the cells appear rounded, clumped, and/or start to release from the bottom of the flask.\n12. When ∼80% to 90% of the monolayer is showing CPE, harvest medium and place into a 15-ml conical tube.\n13. Centrifuge medium 20 min at 3200 to 3700 × g, 4°C, to pellet cellular debris.\n14. Remove supernatant from the pellet.\nThis supernatant contains the virus that will be pelleted.\n15. Centrifuge supernatant 3.5 hr at 42,000 × g, 4°C. Remove and discard supernatant from the white pellet visible on the tube wall. Resuspend pellet in 75 to 100 μl PBS.\n16. Visualize virus using negative staining TEM as described in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0004].",
    "Figure 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0003]A demonstrates a pandemic H1N1 influenza A virus sample (A/California/04/09) purified via this method as imaged by negative staining TEM.",
    "Negative staining TEM is a common method for screening samples to confirm successful sample preparation and to identify structural morphology. This is an important first step in identifying and analyzing the morphology of a particulate sample prior to beginning an immunogold staining experiment. The steps of this protocol closely mimic the final preparation of an immunogold-labeled grid after antibody incubation, as immunogold-labeled samples must also be stained using a negative staining solution to detect the morphology of the sample.\nIn this technique, a particulate sample is dispersed onto a carbon-coated grid, and then a staining solution that surrounds the particles is applied. In the microscope, the negative stain appears dark due to the density of the heavy metal stain, while the particles appear light in color where the stain has been excluded. An ideal particulate sample would be highly pure and concentrated enough that multiple viral particulates can be imaged in a single view at the preferred magnification, while dilute enough that individual particles are separated rather than clustered together. Samples should ideally be suspended in a low-salt buffer, as salts can interact with some negative staining solutions resulting in the appearance of opaque crystals on the grid.",
    "Multiple negative staining solutions can be used to visualize viral particulate samples, including PTA, uranyl acetate (UA), and methylamine tungstate, among others. Each stain has advantages and disadvantages based on its grain size, which affects resolution, electron density, and contrast. Multiple stains may need to be tested, but in general PTA often produces good results for a viral particulate sample. PTA is very commonly used in studying viruses as it can be used at neutral pH and is compatible with many viral particulate samples. However, PTA does not produce as much contrast or as high of resolution as some other stains and may interact with some lipoproteins (Rames, Yu, & Ren, 2014[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-bib-0021]). UA has very good contrast and resolution and acts as a fixative for samples. However, UA solutions are acidic (pH 4 to 5) and precipitate at neutral pH; therefore UA should not be used as a staining solution for samples that are unstable in acidic conditions. Methylamine tungstate has good resolution but is less electron dense than UA and therefore does not have as much contrast. However, it is near-neutral pH (pH 6.8) and does not disrupt lipoprotein architecture like PTA.\nMaterials\nDistilled water\nNegative staining solution: PTA (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0004]), UA (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-rec-0004]), or methylamine tungstate (e.g., Nano-W®, NanoProbes)\nViral particulate sample (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0003] for preparing live virus)\nCarbon-coated TEM grids, 300 or 400 mesh (e.g., Ted Pella, Quantifoil, Electron Microscopy Sciences)\nGlass microscope slide\nGlow discharge unit (e.g., PELCO easiGlow™ Glow Discharge Cleaning System, Ted Pella)\nParafilm\nSelf-locking forceps\nWhatman no. 1 filter paper\nGrid storage box (e.g., Ted Pella, Electron Microscopy Sciences)\nTransmission electron microscope",
    "1. Optional: Make the carbon coating on the grid(s) more hydrophilic using a glow discharge unit. To do so, place grid(s) carbon-coated side facing upwards on a glass microscope slide, and insert slide into the glow discharge unit. Treat grids for 25 sec at 15 mA.\n2. Prepare a piece of Parafilm on a clean benchtop as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 1. For each grid of sample being negative stained, pipet 15 to 25 μl distilled water and 15 to 25 μl negative staining solution onto the Parafilm.\n3. Apply viral particulate sample to carbon-coated side of the TEM grid(s) either by direct application to the grid or by floating the grid on a droplet of sample, as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 3.\n4. Carefully pick up each grid by an edge using self-locking forceps, and remove excess liquid from each TEM grid as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 5.\n5. Without allowing grid(s) to fully dry, transfer to the water droplets prepared on the Parafilm with the carbon-coated side facing down interacting with the water. Be careful to float each grid on the droplet without submerging it. Allow grid(s) to remain on the water droplets for ∼1 min.\n6. Gently pick up each grid from water droplet using forceps, and remove excess liquid from the grid. Then transfer each grid to the surface of a droplet of negative staining solution for 30 to 60 sec.",
    "7. Optional: Add an additional quick washing step after incubating each grid with the negative staining solution if staining is too dense. To do so, pipet 15 to 25 μl water onto the Parafilm per grid. After removing grid(s) from the negative staining solution, use self-locking forceps to touch each grid to the droplet of water, and immediately remove excess liquid as described in Basic Protocol[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-prot-0001] step 5.\n8. Remove excess liquid from each grid, and then touch its edge to a wedge of filter paper until grid(s) appear dry. Remove excess liquid that may be trapped between the arms of forceps with filter paper, as well.\n9. Allow grid(s) to air dry.\nThe grid can be stored in a grid storage box in a chamber with desiccant to accelerate the speed of drying.\n10. Examine grids by TEM.\nFor examples of successful negative staining TEM using PTA, see Figures 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0002] and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmc.86#cpmc86-fig-0003]."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}