{
  "id": 10985,
  "origin_website": "Jove",
  "title": "A Full Skin Defect Model to Evaluate Vascularization of Biomaterials In Vivo",
  "procedures": [
    "1. Preparation of Scaffolds\nGenerate samples of the scaffolds by using 12 mm biopsy punches.\nTo introduce bioactive molecules or cells into the scaffold, drain the scaffolds by gently squeezing them with a sterile gauze. Then rehydrate the scaffolds by adding 160 µl of a solution containing the bioactive molecules or cells of interest. Double-check the success of bioactivation with cells through metabolic assays such as MTT Assays.\nIf necessary, fix the compounds or cells to be tested inside the scaffold by delivering them, for instance in a fibrin-thrombin solution or a hydrogel, again through rehydration as described in step 1.2.\n\tNOTE: This step can be of helpful when compounds or cells do not mechanically attach to the material. One can also control the release dynamics of the compounds..\nPrepare the titanized meshes, which will be placed under each scaffold in every experiment and control group, by cutting out round shaped pieces, approximately 14 mm in diameter.\n\tNOTE: The titanized mesh works as a physical border required to delimit the regenerated tissue from the wound bed.\n2. Animals\nPrior to implementation of the presented model, consult the corresponding animal protection laws and obtain permission from the local authorities. In this work, all experiments were performed with mice, according to the current German animal welfare act and approved by the District Government of Upper Bavaria (Regierung von Oberbayern).\nCarefully choose the animal and strain. Although the model was established for mice, it can be translated to other common animals, such as rats, rabbits or pigs.\nIn case you are working with furred animals, shave the back of the animals before implantation of the scaffolds.",
    "NOTE: This work uses mice of 6 to 8 weeks of age with a body weight between 20 g and 25 g, however different ages and body weights can also be used.\n3. Anesthesia\nConduct the operation under sterile conditions. In order to maintain the animal’s normal body temperature, use a warming mat.\nPrior to inhalative anesthesia the animals receive Buprenorphin at a dose of 0.05-0.1 mg/kg bodyweight, subcutaneously every 8 hr.\nPlace the animal under inhalative anesthesia (Isoflurane) or apply equivalent standard procedures. Confirm anesthesia either by gently squeezing the animal’s toes or through a skin pinch.\nTo prevent exsiccosis, inject 0.5 ml physiologic saline solution subcutaneously at the beginning of the operation.\n4. Excision of the Skin\nPlace the animal in a prone position and mark the midline of the mouse’s back with a fine tip permanent pen (Figure 1A).\nDefine the excision area. Place the defects in the area shown in Figure 1C. Note that if the defects are placed too caudally, animals are more prone to remove the dressings and the scaffolds.\nCreate round bilateral defects using a 10 mm biopsy punch (Figure 1B). The punch should be carefully forced against the skin and must not be used to cut completely through the skin, but to delineate the excision area (Figures 1C & 1E).\nGently lift off the marked skin with forceps and incise along the marked circle using fine surgical scissors (Figure 1F). In case of bleeding, carefully compress with sterile gauze. A step-by-step description of the excision is shown in Figure 1.\n\tNOTE: The defect is created with a smaller punch than the one for generating the scaffolds, to compensate the enlargement of the defect due to the skin elasticity.\n5. Scaffold Implantation",
    "In order to make space for the titanized mesh, extend the separation of skin and underlying tissue at the wound borders for 2-4 mm (Figure 2A).\nPlace the titanized mesh into the defect directly on the wound bed and under the wound edges (Figures 2A & B).\nPlace scaffolds directly over the mesh.\nSuture the scaffolds to the adjacent wound edges with 4 to 6 single knots, leaving the edges slightly over the scaffold (Figure 2C).\n\tNOTE: Avoid the use of biodegradable sutures.\nSuture a transparent wound dressing above the defects to protect the scaffold while allowing monitoring of the wound area (Figure 2D).\n6. Postoperative Care\nKeep one mouse per cage to avert mutual manipulation of the dressing and scaffolds.\nEvaluate the general state of the animal on a daily basis by observing motor activity, body weight, signs of pain, tolerance to the dressing and auto-mutilation. Also monitor the wound area for bleeding, local and systemic signs of infection and the position of the dressing.\nIn order to minimize the pain of the animal, inject Buprenorphin daily at a dose of 0.05-0.1 mg/kg bodyweight or equivalent analgesic medication.\nIf the mouse removes or damages the wound dressing, replace or reattach it under anesthesia.\n7. Euthanasia and Explantation of the Scaffold\nAt desired time points, sacrifice the animals by overdoses of Pentobarbital (150 mg/kg).\nMark the site of skin excision with a permanent marker, which should include the scaffolds and as much of the mouse back skin as possible (Figure 3A).\nIncise the skin along the marked lines with a pair of scissors or a scalpel. Detach the entire skin, including the scaffolds and the titanized mesh, from the underlying tissue through blunt preparation (Figure 3B).\nPlace the explanted tissue stretched out on a Petri dish (Figure 3C and D)",
    "8. Visualization and Quantification of the Vascular Network\nTransillumination:\n\t\nSet up a transillumination device, by mounting a Petri dish above a strong source of white light (100 Watt standard light bulb).\nFix a digital camera above the transilluminator to obtain digital pictures.\nPlace the samples upside down on the Petri dish over the transillumination device.\nTake pictures of the complete scaffolds in macro mode as well as of equally sized areas of normal skin. Store the images in a TIFF format for further digital analysis.\nSave the tissue for further biochemical or histological analysis.\nDigital segmentation and quantification:\n\t\nDownload and install the VesSeg-Tool software, which can be obtained free of charge at: http://www.isip.uni-luebeck.de/index.php?id=150&L=2%255[href=http://www.isip.uni-luebeck.de/index.php?id=150&L=2%255].\nOpen the picture with the VesSeg-Tool software.\nSelect the area of the image covered by the scaffold for digital analysis (Image→Select).\nTo increase the contrast of vessels use the option “Hysteresis thresholding” (Image→Vessel enhancement filter→Hysteresis thresholding→Top-Hat transformation→Calculate vessel enhancement).\nProceed with the segmentation of the vessel map (Image→Vessel enhancement filter→Hysteresis thresholding→Threshold borders). Select the first threshold (“Vessel coverage”), so every pixel, which is even remotely vessel-like, will be labeled as vessel. Select the second threshold (“Background coverage”), so only those pixels that are particularly vessel-like will be labeled as vessels.\nCheck the automatic segmentation proposal manually to add non-captured vessels and to eliminate common false-positive structures, which usually are long and thin, vessel-like structures such as hairs or sutures.\nCalculate the length of the vessels and the overall area covered by vessels (Image→Image statistics→Binary image statistics).\n\t\tNOTE: For the calculation of the vessel-lengths, vessels in the resulting vessel map are thinned to lines with a width of one pixel20.",
    "Analyze the native skin area under the same parameters as the scaffolds, assigning a value of 100% to the native tissue and relate the scaffold to that value. For instance, if the percentage of white pixels is 60% in the normal tissue and 30% in the scaffold, it would represent a 50% vascularization of the scaffold. Note: The white vessels coverage is assigned to the area of a square around the scaffold. Adjust the number of white pixels coverage considering that the area of the circle is significantly smaller (π x R2) than the square (4 x R2).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}