{
  "id": 19507,
  "origin_website": "Jove",
  "title": "Millisecond Hydrogen/Deuterium-Exchange Mass Spectrometry for the Study of Alpha-Synuclein Structural Dynamics Under Physiological Conditions",
  "procedures": [
    "1. Protein expression and purification of aSyn\nPrepare aSyn following a previously published report9.\nDialyze into a safe storage buffer (e.g., Tris, pH 7.2 ).\nIf required, concentrate the sample (e.g., spin filter microcentrifuge tubes using 3 kDa MWCO, 14,000 x g for approximately 10-30 min, see Table of Materials).\n\tNOTE: It is advised not to concentrate excessively. The integrity of the monomer ensemble has not been verified beyond 25 µM.\nAliquot and store at −80 °C\n\t​NOTE: The aSyn monomer protein is stable for up to 1 year in these storage conditions.\n2. HDX buffer preparation\nNOTE: Since Tris has a high temperature coefficient, the pH measurement needs to be adjusted for the temperature at which the HDX reaction will be done, which is 20 °C in this protocol.\nPrepare equilibrium buffer for State A and State B by weighing 0.002 mol of Tris into 100 mL of LC-MS grade water. For State B, add 29.8 mg of KCl, 14.2 mg of MgCl2, 36.8 g of CaCl2, and 836 mg of NaCl to the Tris buffer. Adjust the pH to 7.40 ± 0.05.\n\tNOTE: The equilibrium buffer must contain the conditions at which aSyn is to be studied. In this case, it is 20 mM Tris at pH 7.4 +/− salts.\nPrepare labeling buffer for State A and State B by weighing 0.002 mol of Tris into 100 mL of deuterated water. For State B, add 29.8 mg of KCl, 14.2 mg of MgCl2, 36.8 g of CaCl2, and 836 mg of NaCl to the Tris labeling buffer. The pD of the labeling buffer corresponds to the pH of the equilibrium buffer. Since pH = pD - 0.41, adjust so that the pH meter reads 6.99 ± 0.0523,24.",
    "NOTE: The labeling buffer needs to have the same components as the equilibrium buffer, except that it is prepared using deuterated water.\nPrepare quench buffer by weighing out 0.010 mol of Tris and 0.050 mol of urea and make up to 100 mL with LC-MS grade water. Adjust the pH to 2.50 ± 0.05 at 0.5 °C.\n\tNOTE: A quench buffer screen must be performed prior to HDX experiments to identify the best quench buffer for the protein of interest. Different concentrations and combinations of denaturants (e.g., urea and guanidinium hydrochloride) and reducing agents (e.g., tris(2-carboxyethyl)phosphine) are screened, along with physical parameters such as trapping volume and temperature, to effectively unfold and digest the quenched protein. A quench buffer comprising 100 mM Tris and 0.5 M urea at pH 2.50 is optimal for the present study.\nPrepare digestion column wash buffer by weighing 0.125 mol of guanidinium hydrochloride into a Duran glass bottle. Add 25 mL of methanol and 250 µL of formic acid. Make up to 250 mL with LC-MS grade water.\n\tNOTE: For the Enzymate BEH pepsin column (see Table of Materials), use a column wash buffer of 0.5 M guanidinium hydrochloride, 10% (v/v) methanol, and 0.1% (v/v) formic acid.\nPrepare the syringe weak wash by pipetting 0.5 µL of formic acid into 249.5 mL of LC-MS grade water.\nPrepare the syringe strong wash by mixing equal parts of LC-MS grade water, methanol, acetonitrile, and isopropanol. Add formic acid to a final 2% (v/v) concentration.",
    "​NOTE: To prevent cross-contamination between the various buffers and the protein and to enable cleaning of the injection port, it is critical that syringe wash solutions are prepared and that the flow path to the valve (often named the \"wash liner\") is fully primed with liquid. The formic acid is optional for the syringe weak wash.\n3. Peptide mapping procedure\nPrepare the sample following the step below.\n\t\nFilter thawed aSyn protein stock from the −80 °C freezer with 0.22 µm syringe filters. Measure the absorbance of the filtered stock protein at 280 nm to determine the concentration by the Beer-Lambert law. Dilute the protein to a concentration of 5 µM in the equilibrium buffer (step 2.1.).\n\t\tNOTE: The Beer-Lambert law: A = εcl, where A is absorbance, ε is the extinction coefficient of the protein at the measured wavelength (280 nm here) with units M−1cm−1, c is the protein concentration in M, and l is the path length in cm. For wild-type aSyn26, ε = 5960 M−1cm−1.\nSet up the liquid chromatography method.\n\t\nCreate an inlet file with a loading/trapping time of 3 min at a pressure of 7000-9000 psi, followed by a gradient of 5% acetonitrile to 40% acetonitrile in 7 min, followed by repeated washing steps of 5%-95% acetonitrile-water for 10 min.\nEnsure lock spray (e.g., leucine enkephalin, see Table of Materials) is flowing at 2000 psi and connected to the source lock spray probe of the mass spectrometer.\nSet up the mass spectrometry MSE methods.\n\tNOTE: MSE is a broadband data-independent acquisition method with no precursor mass isolation. Therefore, all ions within the selected m/z range are fragmented further using collision-induced dissociation (CID)27.",
    "In the MS method file, choose MSE Continuum and set up an acquisition time between 2-10 min, electrospray source, and positive resolution mode. Acquire MSE over 50-2000 Da, scanning every 0.3 s.\nFor function 1 (low energy), set up the trap and transfer collision energies to be 4 V. For function 2 (high energy), set up the ramp transfer collision energy to be constant at 4V and the trap collision energy to be as stated in Table 1 for each mapping energy level.\n\t\tNOTE: Ion-mobility MSE methods can also be used. Alternative mapping methods (e.g., data-dependent acquisition or DDA) can be used at user discretion.\nSet up the autosampler robot (see Table of Materials).\n\t\nAdd 50 µL of the 5 µM protein to a total recovery vial. Place the vial in a sample position in the HDX right chamber. Ensure this chamber is at 0.5 °C.\nAdd one reagent vial of equilibrium buffer and two reagent vials of labeling buffer to reagent positions one, two, and three in the HDX left chamber. Ensure this chamber is at 20 °C by setting the Peltier temperature controller (see Table of Materials). Add one reagent vial of quench buffer to reagent position one in the HDX right chamber.\nAdd eight total recovery vials in the reaction positions of the HDX left chamber and eight maximum recovery vials in the reaction positions of the HDX right chamber.",
    "NOTE: To ensure full cleaning and maximum reproducibility of dispensed volumes, it is advised to perform a syringe wash and prime wash on the autosampler syringes. For example, execute a sequence of (1) weak wash, (2) strong wash, (3) weak wash prior to starting the mapping experiments. This sequence can be repeated extensively, and it is recommended to do it up to 20x or until the syringe is fully wetted.\nSet up a sample list with appropriate LC and MS methods in the scheduling software and start the schedule.\n\t\tNOTE: For the present study, Chronos is used as the scheduling software (see Table of Materials).\nProcess the mapping data.\n\t\nIdentify peptides from the mapping experiment files using appropriate software (see Table of Materials).\nImport peptide identification data into DynamX (see Table of Materials) using the following peptide threshold parameters: minimum intensity = 5000, minimum sequence length = 0, maximum sequence length = 40, minimum products = 1, minimum products per amino acid = 0.25, minimum consecutive products = 2, minimum sum intensity for products = 0, minimum score = 0, and maximum MH+ Error (ppm) = 0.\n\t\tNOTE: Alternatively, derive the optimized settings according to a recommended workflow28.\nSelect Data from the menu and click on Import PLGS Results. Click on Add to choose the relevant data files for the spectral assignment. When all have been added, click on Next and enter the above filter settings. Then, click on Finish.\nManually curate isotopic assignments to obtain the final peptide coverage map of aSyn in DynamX.\n4. Millisecond hydrogen/deuterium exchange study\nClean the FastHDX prototype instrument (see Table of Materials) before starting HDX experiments.\n\t\nOpen the compatible HDX software GUI and allow the system to initialize.",
    "Enter the Sample Chamber temperature as 20 °C and the Quench Chamber as 0.5 °C. Click on Set to apply the new temperatures.\nSet up the centrifuge tubes with LC-MS grade water at all inlets.\nIn the Titrator Plumbing Delivery tab, check both left and right syringes and click on Prime to remove any latent air bubbles in the tubes. Repeat until all bubbles are gone.\nIn the Macros tab, check all the boxes for the syringes. Click on Calibrate Syringes Home Position. Click on Wash Syringe Load Loop. Click on Wash All Mixing Loop Volumes.\nRepeat step 4.1.5. 1x more.\nIf any bubbles appear in the buffer syringes, degas by disconnecting the syringe and ejecting the bubble vertically. Replace the syringe and recalibrate to the zero position.\nSet up the FastHDX prototype instrument for HDX experiments.\n\t\nAdd 500 uL of filtered 5 µM aSyn in a total recovery vial and place inside a tabletop fridge to prevent temperature-induced oligomerization and aggregation.\nAdd 50 mL of equilibrium, labeling, and quench buffers to each buffer (2. HDX buffer preparation steps 1-3) inlet in the left and right chambers.\nAdd 50 mL of column wash buffer (2. HDX buffer preparation step 4) to the pepsin wash inlet.\nTo prime the protein and column wash lines 1x, check both left and right syringes in the Titrator Plumbing Delivery tab and click on Prime once.\n\t\tNOTE: Any subsequent click on Prime will cause additional repeats of the prime process, resulting in the consumption of large amounts of protein sample. Care is advised to avoid this, even when there is a delay in the software after a button click has been attempted.\nRepeat steps 4.1.5. 1x.\nIn the Manual Quench Flow tab, enter the required settings, explained in steps 4.2.7.-4.2.10.",
    "For a time-course experiment, enter the times in milliseconds using the Symbolic dots button. If replicates are required, add the same timepoint multiple times, e.g., for a triplicate of 50 ms, 50 50 50 needs to be entered. The sample list in the mass spectrometer software (MassLynx is used here, see Table of Materials) needs to match those timepoints exactly.\n\t\tNOTE: The mass spectrometer sample list file names and/or sample text should be used to ensure a permanent record of the HDX labeling times corresponding to those entered in the FastHDX software GUI. Labeling times for each sample run will not be stored anywhere else.\nSet Trap Time (mins) to be the length of the trapping time. Here, it is 3.00.\nSet Wait for HPLC (mins) = (trap time + run time + 1.5 min).\n\t\tNOTE: For example, for an experiment with 3 min trapping and 17 min gradient, this will be 21.50 min.\nClick on the Run Blank box only if running blank experiments between sample runs. If yes, ensure an entry (i.e., a valid row on the sample list) in the software for the blank run after each sample run.\nOnce the sample list is ready on the software, highlight the appropriate entries and start the run in the software by clicking on the Play button and FastHDX in the software.\n\t\t​NOTE: Due to hydrogen/deuterium scrambling, MS-only methods or soft-fragmentation techniques (electron transfer dissociation, electron capture dissociation, and ultraviolet photo-dissociation) can be used only29. For aSyn at a physiological pH of 7.40, timepoints ranging from 50 ms to 300 s are most applicable as these cover the entire deuterium uptake curve8.\n5. Data processing",
    "Load the file of spectrally assigned peptides from the peptide mapping experiments. Open the File menu and click on Open in the DynamX software (see Table of Materials).\nImport raw files into the preferred mass measurement software (e.g., DynamX, HDExaminer, etc.). Open the \"Data\" menu and click on MS Files. Click on New State to create states for each protein condition studied.\n\t\nClick on New Exposure to add each HDX timepoint. Click on New RAW to import the .raw files. Drag each .raw file to the correct position. Click on OK when done.\nAutomatically assign isotopes first (this is automatic following step 5.2. above), then manually curate the isotopic assignment to ensure high data quality.\nExport the cluster data into a .csv file with columns in the following order: protein name, sequence start number, sequence end number, sequence, modification, fragment, maximum possible uptake, mass of monoisotopic species, state name, exposure time, file name, charge, retention time, intensity, and centroid.\nOpen the Data menu in mass measurement software and click on Export Cluster Data.\n6. Data analysis\nLoad the exported cluster data into the preferred HDX analysis software. Here, HDfleX is used30 (see Table of Materials).\nFit the experimental data for all peptides and states, selecting the appropriate back-exchange correction methods to get observed rate constants for the HDX reaction.\nCalculate a global significance threshold by the preferred method (HDfleX supports several options for this) and perform hybrid significance testing to determine the significant differences across the states compared31,32.\n\tNOTE: If the difference observed is greater than the global threshold and the p-value is less than the chosen confidence level (e.g., 95%), the difference is considered significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}