{
  "id": 10299,
  "origin_website": "Jove",
  "title": "Evaluation of Left Ventricular Structure and Function using 3D Echocardiography",
  "procedures": [
    "This protocol follows the guidelines of the Semmelweis University Regional and Institutional Committee of Science and Research Ethics. The present protocol applies to a specific vendor. Although some steps remain valid regardless of the ultrasound machine and postprocessing software, important differences may exist if using other vendors' solutions.\n1. Technical requirements\nUtilize an echocardiography machine capable of 3D imaging.\nConnect a 3D transthoracic echocardiography capable phased array transducer.\nApply the built-in 3-lead ECG of the ultrasound system to allow the system to synchronize the recordings and analyses to the cardiac cycle.\n2. Acquisition of the 3D echocardiographic images\nPosition the patient in the left lateral decubitus position (patient lying on the left side with the left arm stretched above the head).\nEnsure that the ECG tracing on the screen is of good quality.\n\tNOTE: This is a prerequisite for postprocessing as the software will detect the different points of the cardiac cycle based on the ECG signal.\nUnfreeze the image, and start to examine the patient with the transducer. Visualize a conventional apical four-chamber view.\nOptimize the image quality by adjusting sector width to LV, lowering the depth to truncate the left atrium, and by using a slight overgain.\n\tNOTE: Ensure the entire LV endo- and also the epicardial surface is visible.\nPress the 4D button to switch to 3D mode.\n\tNOTE: By pressing the Multi-Slice... button on the touch screen, four options will be available (5, 7, 8, 12 slices) to overview the 3D dataset using standard short- and long axis cuts. If needed, transducer positioning can be corrected to ensure the inclusion of the entire LV wall thickness from apical to mitral valve level into the pyramidal 3D dataset. The use of 12 slices (with nine adjustable short-axis views) is recommended.",
    "Acquire 3D images using Multi Beat or Single Beat mode.\n\t\nUse the Multi Beat mode to achieve higher spatial and temporal resolution, where the dataset will be reconstructed from 2, 3, 4 or 6 cardiac cycles (this can be set-up on the screen) - end-expiratory breath-hold of the patient and stable transducer positioning needed to minimize stitching artifacts.\n\t\tNOTE: Single Beat acquisition is of lower spatial and temporal resolution; however, most modern transducers have better quality and, therefore, can be used to acquire proper 3D datasets without reconstruction to undergo further analysis. As a general recommendation, volume rates over 15 volumes per second are recommended for further analysis.\nWhen the full-volume is reconstructed from the subvolumes, and the entire LV is visible, freeze the image. Using the Cycle Select and Number of Cycles knobs, select the optimal acquired cardiac cycle(s) and press Image Store.\n\t\tNOTE: Stitching artifacts are spatially or temporarily misaligned subvolumes next to each other. Datasets with a significant dropout of LV walls or with stitching artifacts are generally not suitable for further analysis. The quality of the already acquired 3D dataset can be double-checked using the Multi-Slice mode.\n3. Postprocessing to quantify LV morphology and function\nSelect a 3D dataset appropriate for further analysis.\n\tNOTE: This part of the protocol requires the previously acquired and saved good-quality 3D images and can be performed on the ultrasound machine and a separate workstation, either.\nClick on Measure | Volume, and then select 4D Auto LVQ.",
    "On the quad-screen (three apical views: four-, two-, and three-chamber views, and one short-axis view, the latter can be adjusted by a horizontal plane on long-axis views), the software asks Modify alignment of apical slices to standard views. If required, correct the apical views manually by tilting and rotation to show the corresponding standard view, thereby eliminating foreshortening. Set tilting to align the caliper with the long axis of the LV by dragging and moving the calipers on long-axis views. Set rotation by the corresponding or the Rotate All knobs on the machine or by adjusting the calipers on the short-axis image.\n\tNOTE: Software recommendation can be reset by pushing the Auto Align button.\nAfter finishing view alignment, click to the next step EDV. The end-diastolic (ED) frame is automatically detected using the ECG signal, but can be manually corrected if necessary.\nSemi-automatic detection of LV endo- and epicardial surface\n\t\nSelect two landmark points manually on any apical views. Firstly, identify the LV apex and then the middle of the LV base (mitral annulus level) in any apical view. The algorithm will automatically contour the endocardial border of the entire LV.\n\t\tNOTE: There are two more options: Manual, which means that two basal and one apical landmark should be set in every apical view, and Auto Init, which will automatically contour the LV without any user interaction.\nCheck contour credibility in three apical views, three short-axis views of different levels, and a fourth user-controlled short axis, to allow visual verification of the detected surface. Contour correction is possible by manually adding points that will then be incorporated in the contour line.",
    "NOTE: With Undo, the previously added point can be deleted. Reset button resets the contouring to start the entire section from the beginning. Contour visibility can be adjusted to allow the appreciation of the endocardial surface on the grey-scale image. Endocardial and epicardial contouring should be performed in an accurate and consistent manner. For a detailed recommendation, please check the following reference6.\nChoose the next step, which is the ESV.\nRepeat the same procedure (3.5.1-3.5.2) as mentioned in the previous points to identify and correct the endocardial contour on the end-systolic frame.\n\t\tNOTE: The end-systolic (ES) frame is automatically detected using the ECG signal, but can be manually corrected if necessary. Values of end-diastolic volume (EDV), end-systolic volume (ESV), ejection fraction (EF), heart rate (HR), stroke volume (SV), cardiac output (CO) and sphericity index (SpI) are already displayed on the screen.\nPress Volume waveform for the next step. The software displays a dynamic 3D model of the LV and also time-volume curve as it traces the endocardial surface throughout the cardiac cycle frame-by-frame (Figure 1).\n\t\tNOTE: Here, there is a possibility to edit the endocardial border at any frame.\nFor the next step, press LV Mass. The software automatically contours LV epicardial contour on the end-diastolic frame and calculates LV mass (EDMass).\n\t\tNOTE: If necessary, edit the contour of the epicardial surface by adding points to include (same method as previously described) in any short- or long-axis plane. It can be selected which contour to adjust: Endo, Epi, or Endo+Epi.\nPress 4D Strain ROI for the next step. The software automatically contours LV epicardial contour on the end-systolic frame and calculates LV end-systolic mass (ESMass).",
    "NOTE: If necessary, edit the end-systolic contour of the epicardial surface by adding points to include (same method as previously described) in any short- or long-axis plane. ESMass should be of similar value than EDMass. This step is essential to calculate 3D strain values by speckle tracking.\nPress 4D Strain Results for the next step. The software visualizes the 3D myocardial tracking on multiple short- and long-axis planes and corresponding strain values of the 17 standard LV segments throughout the cardiac cycle, frame-by-frame. Time-strain curves and bull's eye plot are also displayed. The following parameters are calculated and can be demonstrated: longitudinal strain, circumferential strain, radial strain, area strain, rotation, and torsion.\n\t\tNOTE: There is a possibility to exclude a particular LV segment from analysis if it is considered as having a low tracking quality by visual observation of images or based on the time-strain curve. However, the software recommends by default on segment approval or rejection. Color-coded strain values can be visualized on a dynamic 3D model of the LV by changing the \"Layout\".\nTo terminate the analysis, press Approve & Exit.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}