{
  "id": 7859,
  "origin_website": "Bio",
  "title": "Revised iCLIP-seq Protocol for Profiling RNA–protein Interaction Sites at Individual Nucleotide Resolution in Living Cells",
  "procedures": [
    "We describe below the step-by-step procedure for performing an iCLIP-seq experiment using GFP-tagged proteins with modifications/improvements implemented at various steps. This procedure (designated as iCLIP-1.5) has been applied to both epitope-tagged proteins (i.e., GFP- or FLAG-tagged proteins) and endogenous proteins (e.g., SP1) using validated antibodies. For doxycycline-inducible epitope-tagged cell lines, induce the expression of protein 24 h prior to harvesting. Since this protocol follows the workflow of the original iCLIP-seq method (Huppertz et al., 2014), the data generated using this protocol can be subjected to the standard iCLIP analysis pipeline.Store all buffers at 4 °C and perform the procedure on ice. Room temperature is defined as 22 °C throughout this protocol. All washing steps throughout the protocol are performed with a volume of 900µL unless stated differently.UV crosslinking of cells Grow HEK293 cells in 15 cm diameter tissue culture plates (~80% confluent) (Note 1).Remove the media and wash cells once with ice-cold 1× PBS. Gently add 6 mL of ice-cold PBS and place the plate on a small ice tray that fits inside the Stratalinker (Note 2).Remove the lid and irradiate the cells once with 150 mJ/cm2 at 254 nm in a Stratalinker 2400 (or equivalent UV-C crosslinker) (Notes 3, 4, 5).Scrape off the cells and transfer to a 15 mL Falcon tube. Centrifuge at 1,000× g for 5 min at 4 °C, remove the supernatant, and snap freeze the cells for later use.Lysis, partial RNA digestion, and immunoprecipitation Prepare protein G Dynabeads for conjugation with anti-GFP antibody (Note 6). Wash 100 μL of protein G Dynabeads with 900 μL of lysis buffer (with protease inhibitors added) by gently pipetting up and down a few times. Place the tubes on a magnetic rack to separate the bead and remove the supernatant.",
    "Repeat the washing step three times and, after the last wash, resuspend beads in 100 μL of lysis buffer.Add 10 μg of anti-GFP antibody. Rotate tubes for 1 h at room temperature (i.e., ~22 °C) (Note 7).While beads are rotating, resuspend the cell pellets in 2.2 mL of iCLIP lysis buffer supplemented with protease inhibitors (1:100 Protease Inhibitor Cocktail Set III). Cells expressing free FLAG/GFP can be used as negative controls (Note 9).Sonicate the samples with a probe sonicator: 15 cycles, 0.3 s on, 0.7 s off (three rounds) (Note 10).Transfer 1 mL of cell lysate to a 1.5 mL Eppendorf tube.Prepare at least two RNase I dilutions in PBS: 1:50 dilution for high RNase I and 1:250 dilution for low RNase I (Notes 11, 12, 13).Add 20 µL of RNase I (from the dilution stocks) and 2 µL of Turbo DNase to 1 mL of lysate and place the tubes on a thermomixer. Shake the samples in a thermomixer (1,200 rpm) for exactly 5 min at 37 °C, and immediately put back on ice for 5 min.Critical:  Optimization of RNase I dilution is extremely important for the success of the experiment (see Note 11). Incubate the samples for exactly 5 min at 37 °C.Centrifuge the lysate at 16,100× g in a microcentrifuge for 30 min at 4 °C. Transfer the clarified supernatant to a new 1.5 mL Eppendorf tube and keep on ice.Transfer 20 µL of clarified lysate to an Eppendorf tube as input. Snap freeze in dry ice/liquid nitrogen and store at -80 °C until further use.After 1 h, wash the antibody-conjugated beads (from Step B1) twice with 900 µL of ice-cold lysis buffer.After the last wash, add the clarified cell lysate to the beads.",
    "Rotate in a cold room (4 °C) for 2 h or overnight (Note 14).Place the tubes on a magnetic rack to separate the beads, remove the supernatant, and add 900 µL of high-salt buffer (Note 15).Rotate for 5 min in the cold room. Repeat three times.Wash three times with PNK buffer (no need to rotate in the cold room). Add 900 µL of PNK buffer and gently pipette up and down. Place the tubes back on a magnetic rack and discard the supernatant (Note 16).Wash once with 1× FastAP buffer (no need to rotate in the cold room). Add 900 µL of 1× FastAP buffer and gently pipette up and down. Place the tubes back on a magnetic rack and discard the supernatant.RNA 3′ end dephosphorylation, L3 adapter ligation, and 5′ end labeling To prime RNA fragments for 3′ adapter ligation, RNA 3′ end dephosphorylation is carried out in two steps. This ensures the complete removal of the 3′-cyclic phosphate group left behind by RNase I cleavage.Resuspend the beads in 100 µL of the following mix and shake at 37 °C for 15 min in a thermomixer (1,200 rpm).H2O 79 μL10× FastAP buffer 10 μLRNase inhibitor 2 μLTurbo DNase 1 μLFastAP enzyme 8 μLWhile tubes are shaking, prepare 300 µL of the following mix for each sample. Add the mix to each tube and incubate for another 20 min while shaking.H2O 230 µL5× PNK (pH 6.5) 60 µL0.1 M DTT 3 µLTurbo DNase 1 µLRNase inhibitor (murine) 2 µLT4 PNK enzyme 4 µLSeparate the beads and wash once with 900 µL PNK buffer (no need to rotate in the cold room).Wash three times with high salt buffer. Rotate each time for 5 min in the cold room.",
    "Wash three times with PNK buffer (no need to rotate in the cold room).Wash once with 1× ligase buffer (no DTT) by gently pipetting up and down (Note 16).Remove the buffer and resuspend the beads in 30 μL of the ligation mixture.H2O 12 µL10× ligase buffer (no DTT) 3 µL100% DMSO 0.6 µL50% PEG 8000 9 µLRNase inhibitor (murine) 0.4 µLT4 RNA ligase 1 (high conc 30 U/µL) 2.5 µLPre-adenylated adapter L3-App (20 μM) 2.5 µLIncubate at room temperature for 90 min. Flick the tube every 10–15 min. Alternatively, the tubes can be shaken in a thermomixer at room temperature.Add 500 μL of PNK buffer and place on the magnetic rack to separate the beads. Discard the supernatant.Wash three times with high-salt buffer. Rotate each time in the cold room for 5 min.Wash three times with PNK buffer without rotation in the cold room. Gently pipette up and down a few times. Place the tubes back on a magnetic rack and discard the supernatant.Resuspend the beads in 1 mL of PNK buffer.Transfer 200 μL of beads (20%) (hot beads) to a new tube. Keep the remaining 800 μL of beads in PNK buffer on ice (cold beads). Remove the supernatant from the hot beads and resuspend in the 5′ end labeling mixture.T4 PNK 0.2 μL32P-γ-ATP 0.4 μL10× PNK buffer 0.4 μLH2O 3.0 μLCaution:  All 32P-related work must be performed in a designated radioisotope area. Always work behind the protective shield when handling radioactive material.Incubate for 5 min at 37 °C while shaking at 1,200 rpm in a thermomixer.Separate the hot beads using the magnetic rack and discard the supernatant as radioactive waste.Resuspend hot beads in 20 μL of 1× NuPage loading buffer (LDS sample buffer).",
    "Optional: add reducing agent (DTT) in the 1× NuPage loading buffer to break the antibody chains.Remove supernatant from cold beads and mix them with hot beads.Take out input tubes from -80 °C. Thaw on ice and add LDS sample loading buffer.Heat the beads and input tubes at 70 °C for 5 min. Magnetically separate the beads and transfer the supernatant into a new tube.Load the samples (20 μL) onto a 4%–12% NuPAGE Bis-Tris gel (Note 17). Use 1× MOPS-SDS running buffer (diluted from 20× MOPS-SDS running buffer). Also, load 5 μL of a pre-stained protein size marker.table:",
    "﻿0,1,2,3,4,5,6,7\n1,2,3,4,5,6,7,8\nLadder,Input,Ladder,Sample1,Empty,Sample2,Empty,Control",
    "Run the gel for 1 h at 180V. For high molecular weight proteins, run the gel for 72 min.Cut the ATP-containing dye front from the gel bottom and discard as solid radioactive waste.Set up the transfer using a pure nitrocellulose membrane and Whatman filter papers according to the manufacturer's instructions. Use 1× transfer buffer (diluted from 20× transfer buffer) (Note 17).Transfer in the cold room at 14 V overnight.RNA isolation Rinse the membrane in ice-cold PBS and wrap it with saran wrap. Expose to Fuji film at -80 °C for 30 min in a dark room (Notes 18, 19, 20).Isolate the RNA-protein complexes using the autoradiograph as a mask for cutting the desired regions on the membrane (Figure 1). Cut the membrane into small pieces (~1–2 mm slices) using a new sterile razor blade for each sample and place them in Eppendorf tubes. Keep the tubes on ice until all samples have been excised.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230602/20230602000944_4140.jpgFigure 1. Optimization of RNase 1 dilutions and CLIP-autoradiography. A. CLIP autoradiography of 32P-labeled RBP-RNA complexes was performed after RNase I treatment (1:25–1:250 dilution). Under high RNase 1 condition (1:25), the radiolabeled RNA signal diminished. Optimal RNase 1 concentration (1:250 here) results in radiolabeled RNA that runs as a smear above the predicted size of the RBP (~72 kDa here). Note: Antibody chains are often observed on autoradiographs. Bottom panel shows western blotting results to indicate the recovery of GFP-tagged bait protein. Black bar on the right indicates region on the membrane to be excised. B. Autoradiograph of input (INP) and 32P-labeled immunopurified (IP) RBP-RNA complexes after partial RNase I digestion (RNase I dilution, 1:250). Since the input sample was not radiolabeled, no radioactive signal was observed. Red boxes indicate the regions on the membrane that were excised to extract RNA.",
    "RBP (SP1) size is ~82 kDa here. GFP-only sample is shown as a negative control.Note: Representative autoradiographs shown in A and B are for two unrelated RBPs. For inputs, cut the membrane in parallel with the IP samples, matching the sizes of the excised areas (Figure 1B).Add 20 μL of Proteinase K into 180 μL of PK buffer. Add this Proteinase K mixture to tubes containing the membrane pieces.Shake the tubes in a thermomixer at 37 °C for 20 min.Add 200 μL of PK-7M urea buffer and shake for another 20 min at 37 °C. For making PK-7M urea buffer, first dissolve 420 mg of urea in 500 µL of PK buffer, then bring to a final volume of 1 mL by slowly adding PK buffer.Centrifuge the tubes briefly, collect the solution, and add it together with 400µL phenol/chloroform to a 2mL Phase Lock Gel Heavy tube.Shake at 37 °C for 5 min in a thermomixer.Separate the phases by centrifuging the tubes for 5 min at full speed in a tabletop centrifuge at room temperature.Transfer the aqueous layer into a new tube (be careful not to touch the gel matrix). Centrifuge the supernatant again for 1min and transfer into a new tube.Add 0.75µL of GlycoBlue and 40µL of 3M sodium acetate (pH 5.5), mix, and add 1mL of ice-cold 100% ethanol (EtOH). Mix by inverting the tubes several times and place overnight at -20 °C.The next day, centrifuge the samples at 16,100× g for 20 min at 4 °C.Remove the supernatant and wash the pellet with 900 µL of ice-cold 80% EtOH and centrifuge again for 10 min.Resuspend the pellet in 5 μL of H2O and transfer to a PCR tube. Keep on ice (or -80 °C) until the input samples are ready for cDNA synthesis.",
    "Input adapter ligation Prior to converting RNA samples into cDNA, input RNA must undergo L3 adapter ligation. Of note, for certain spliceosome subunits (e.g., U2AF65 and PUF60), L3 adapter ligation to the immunoprecipitated protein-RNA complexes does not occur efficiently, presumably due to steric hinderance (Shao et al., 2014; Han et al., 2022). In such cases, we recommend that the IP samples should be processed along with inputs so that, after immunoprecipitation and three high-salt buffer washes (Step B12), you proceed directly to radiolabeling (Step C11) and omit the dephosphorylation and adapter ligation steps described above in section C. Isolate the RNA from the membrane as detailed above and continue with the steps noted below for input samples.To 5 μL input samples, add:H2O  15 μL10× FastAP buffer 2.5 μLRNase inhibitor 0.5 μLFastAP enzyme 2.5 μLIncubate at 37 °C for 15 min while shaking at 1,200 rpm. Then, add 75 μL of the following master mix:H2O 48 µL5× PNK (pH 6.5) 20 µL0.1 M DTT 1 µLRNase inhibitor (murine) 1 µLTurbo DNase 1 µLT4 PNK enzyme 4 µLIncubate for another 20 min at 37 °C while shaking at 1,200 rpm.Using the magnetic rack, separate 20 µL of MyONE Silane beads per sample.Wash once with 900 µL RLT buffer. Pipette up and down a few times and then remove the buffer.Resuspend beads in 300 µL of RLT buffer. Then, add these beads in RLT buffer to the samples.Add 10 µL of 5 M NaCl and 615 µL of 100% EtOH.Mix and rotate samples at room temperature for 15 min.After 15 min, place tubes on the magnetic rack and remove supernatant.Resuspend beads in 1 mL of 75% EtOH and move the suspension to a new tube.Let it sit for 30 s and place back on the magnetic rack.",
    "Remove the liquid and resuspend again in 1 mL of 75% EtOH. Let sit for 30 s. Remove the liquid and repeat the process once more.After the final wash, spin down the tubes using a picofuge and place them back on the magnetic rack. Remove all residual liquid.Let air dry for 3 min.Resuspend in 10 µL of H2O. Let it sit for 5 min at room temperature.Using the magnetic rack, separate the beads and collect RNA in 10 µL of H2O. Freeze 5 µL at -80 °C as the backup input sample (Note 21).To the remaining 5 µL input samples, add:H2O 1.2 µL10× T4 RNA ligase reaction buffer   2 µL100% DMSO 0.3 µL50% PEG 8000 8 µLRNase inhibitor (murine) 0.2 µLT4 RNA ligase 1 (high conc 30 U/µL) 1.3 µLPre-adenylated adapter L3-App (20 μM) 2 µLIncubate at room temperature for 90 min with shaking at 1,200 rpm.Take 20 µL of MyONE Silane beads per sample.Wash once with 900 µL of RLT buffer.Resuspend beads in 61.6 µL of RLT buffer.Add beads in 61.6 µL of RLT buffer to the sample.Add 61.6 µL of 100% EtOH and incubate at room temperature for 15 min with the pipette tip left in the tube. Pipette up and down every 3–5 min to mix the samples.After 15 min, pipette resuspend in 1 mL 75% EtOH and move to a new tube. Let it sit for 30 s at room temperature and then remove the liquid.Add 1 mL of 75% EtOH, pipette resuspend, and after 30 s remove the liquid.Wash once again with 1 mL of 75% EtOH.After the third wash, briefly spin down the samples using a picofuge and remove residual liquid.Air dry samples for 3 min at room temperature. Resuspend in 5 µL of H2O.",
    "Reverse transcription and gel extraction of cDNA Now that the Input and CLIP samples are synchronized, remove the CLIP samples from -80°C and perform reverse transcription (RT) for all samples (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230602/20230602001316_8532.jpgFigure 2. Schematic representation of cDNA synthesis and iCLIP library preparation. Adapter-ligated RNA fragments are reverse transcribed using barcoded primers. Adapter and RT primer sequences are shown. cDNA is size selected, circularized, and linearized prior to performing PCR for library preparation.Note: RT primer sequence corresponds to Rt1clip, as listed in the Materials and Reagents section. Transfer RNA (5 µL) to PCR tubes and add the following reagents (Note 22):Rt#CLIP primer (0.5 pmol/μL) 1 μLdNTP mix (10 mM) 1 μLPlace tubes in PCR machine and use the following thermal program:70 °C for 5 min.Then, hold at 25 °C until RT mix is added.In the meantime, prepare RT mix:H2O 7 µL5× first strand buffer 4 µL0.1 M DTT 1 µLRNase inhibitor (murine) 0.5 µLSuperscript III 0.5 µLAdd 13 µL of RT mix to each tube and use following thermal program:25 °C 5 min42 °C 20 min50 °C 40 min80 °C 5 min4 °C holdAdd 1.65 μL of 1 M NaOH to each sample and incubate at 98 °C for 20 min.Add 20 μL of 1 M HEPES–NaOH pH 7.3 to each sample. This will eliminate radioactivity from strongly labeled samples and prevent RNA from interfering with subsequent reactions (Note 23).Add 350 μL of TE buffer, 0.75 μL of GlycoBlue, and 40 μL of 3 M sodium acetate (pH 5.5), mix, then add 1 mL of ice-cold 100% EtOH. Mix again and precipitate at -20 °C overnight.The next day, centrifuge at 16,100× g for 15 min at 4 °C. Remove the supernatant and wash the pellet with 500 μL of ice-cold 80% EtOH.",
    "Centrifuge again, remove supernatant, and resuspend the pellet in 6 μL of H2O.Add 6 μL of 2× TBE-urea loading buffer to the cDNA and heat samples to 80 °C for 5 min immediately before loading. Also, when loading the gel, leave one lane empty between each sample to avoid cross-contamination.Set up the gel running apparatus with 6% TBE-urea gel in 1× TBE running buffer according to the manufacturer’s instructions. Make sure to flush out urea from the wells using a P1000 pipette tip prior to loading samples.Run 6% TBE-urea gel for 40 min at 180 V until the lower (dark blue) dye is close to the bottom (Figure 3, Note 24).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4688/bioprotoc-13-11-4688-g003.jpgFigure 3. Gel purification and size selection of cDNA. Cartoon illustration of 6% TBE-urea gel electrophoresis to guide the excision of iCLIP cDNA products. The pattern of migration for cDNA and two dyes (indicated) is highly reproducible when the gel is run for 40 min at 180 V (make sure to note the time required to obtain the indicated pattern of migration of the bands on the gel when using your own powerpack in initial experiments). Gel slices that are excised to purify cDNA corresponding to high (H), medium (M), and low (L) molecular size cDNA fractions are indicated. This figure was made after Konig et al. (2011).Cut off the gel lane containing the size marker. Incubate it for 10 min in 20 mL of TBE buffer with 2 μL of SYBR green II added while gently shaking. Wash once with TBE and visualize by UV transillumination. Print the result using a 100% scale and use the printout as a mask to guide the excision of the cDNA bands from the rest of the gel (Note 25).",
    "Together with the full L3-App sequence, the primer sequence accounts for 52 nt of the cDNA. Cut three bands, at 70–85 nt, 85–120 nt, and 120–200 nt with a sterile razor (Figure 3) (Note 26).Use one of the following methods to crush the gel pieces:Add 400 μL of TE to each gel piece and crush it with a 1 mL syringe plunger.orPrepare 0.5 mL tubes by piercing a hole in the bottom using a sterile 19G needle. Needle can be heated with a flame to assist in piercing a hole. Place a gel fragment inside and then place the tubes into 2 mL collection tubes. Centrifuge at room temperature for 2 min at full speed. Remove the 0.5 mL tubes and add 400 μL of TE to each collection tube.Incubate samples for 1 h at 37 °C while shaking in a thermomixer. Then, place on dry ice for 5 min and put back for another hour at 37 °C while shaking.Place two 1 cm glass pre-filters into a Costar SpinX column and transfer the liquid portion of the supernatant to these columns for each sample.Centrifuge at full speed for 1 min in a tabletop centrifuge at room temperature. Collect the solution and add it together with 400 μL of RNA phenol/chloroform to a 2 mL phase lock gel heavy tube.Shake at 37 °C for 5 min in a thermomixer.Separate the phases by centrifuging the tubes for 5 min at full speed in a tabletop centrifuge at room temperature.Transfer the aqueous layer into a new tube (be sure not to touch the gel matrix). Optionally, centrifuge the supernatant again for 1min and transfer the liquid into a new tube.Add 1.5µL of GlycoBlue and 40µL of 3M sodium acetate (pH 5.5). Mix and add 1mL of ice-cold 100% EtOH.",
    "Mix by inverting the tubes several times and place overnight at -20°C.Circularization of cDNA The next day, centrifuge the samples at 16,100× g for 15 min at 4 °C. Remove the supernatants and wash once with 500 µL of ice-cold 80% EtOH. Centrifuge samples at 16,100× g for 10 min at 4 °C and remove supernatant.Resuspend pellets in 8 μL of ligation mix:H2O  4.9 μL10× Circligase buffer  0.8 μL50 mM MnCl2 0.4 μLCircligase II 0.3 μLBetain (5 M) 1.6 μLTransfer to PCR tubes and incubate samples at 60 °C for 2 h (Note 27).Then, add 30 μL of oligo annealing mix to each tube:H2O  26 μLFAST digest buffer 3 μL10 μM Cut_oligo 1 μLAnneal the oligonucleotide with the following program: 95 °C for 2 min, followed by successive incubations of 20 s, starting at 95 °C and decreasing the temperature by 1 °C each time until reaching 25 °C. Then, hold at 25 °C.Add 2 μL of BamHI and incubate for 30 min at 37 °C; then, incubate for 5 min at 80 °C (Figure 2).Transfer samples to 1.5 mL Eppendorf tubes. Add 350 μL of TE, 0.75 μL of GlycoBlue, and 40 μL of 3 M sodium acetate (pH 5.5) and mix. Then, add 1 mL of ice-cold 100% EtOH. Mix again and precipitate at -20 °C overnight.Library preparation and gel extraction The next day, centrifuge samples at 16,100× g for 15 min at 4 °C. Remove the supernatant and wash with 500 μL of ice-cold 80% EtOH as described above.Resuspend the samples in 23 μL of H2O.To determine the minimum number of PCR cycles required for library preparation, we recommend performing at least two initial PCR reactions using 17 and 20 cycles. Additional cycle numbers can also be tested.",
    "We usually do not sequence iCLIP libraries that require more than 22 cycles (Notes 28, 29).Set up the following reaction mixture for each sample:cDNA  1 μLP3/P5 Solexa primer mix (10 μM each) 0.25 μL2× Phusion HF PCR Master Mix 5 μLH2O 3.75 μLRun the PCR with the following conditions:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20230601/20230601000033_7107.jpg Mix 8 μL of PCR product with 2 μL of 5× TBE loading buffer, load on a 6% TBE gel, run at 180 V and 120 mA for 25–30 min, and stain the gel with SYBR Gold for 15 min.Image the gel and estimate the minimum number of cycles needed for library preparation (Note 30). Overamplification during PCR often results in secondary bands that migrate at higher sizes, as detailed previously (Huppertz et al., 2014) (Figure 4). We amplify libraries in two halves using 10 μL of cDNA template in each half. Since 2.5-fold more concentrated cDNA is used for the first half (and second half), the number of cycles needed for library preparation is one less than the number of cycles used in the initial test PCR.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4688/bioprotoc-13-11-4688-g004.jpgFigure 4. Representative PCR analysis of iCLIP libraries. Left: Preliminary PCR of iCLIP and input samples to determine the optimal cycle number. The iCLIP sample (labeled as IPs) was amplified using two different cycle numbers, i.e., 17 and 19, whereas the input (INP) was amplified using 17 cycles. While 19 and 17 cycles for IPs and input, respectively, lead to overamplification resulting in secondary products of higher sizes, 17 was chosen as the optimal cycle number to prepare the final libraries for iCLIP samples (labeled as IPs). Right: Gel image showing the final libraries for iCLIP and input samples prepared using the indicated cycle numbers. Note: Since the template cDNA was 2.",
    "5-fold more concentrated for the final PCR in comparison with the preliminary PCR, the iCLIP library (labeled as IPs) was prepared using 16 rather than 17 cycles. The final input library was prepared using 15 cycles. PCR products were resolved on 6% TBE gels and stained with SYBR gold.Prepare the following reaction mix:cDNA  10 μLP3/P5 Solexa primer mix (10 μM each) 1 μL2× Phusion HF PCR Master Mix 20 μLH2O 9 μLRun the same PCR program with the determined optimal cycle number.Mix 8 μL of PCR product with 2 μL of 5× TBE loading buffer, load on a 6% TBE gel, run at 180 V and 120 mA for 25–30 min, stain, and visualize with SYBR Gold (Figure 4).If the library appears under-amplified (i.e., the band is not clearly visible on the gel), immediately place back into the PCR machine for two or more cycles and re-run the gel.Amplify the second half of the cDNA using the appropriate number of cycles, then combine both halves and proceed to agarose gel extraction steps.Prepare 2% agarose gel in TBE. Let it cool down, add 1:10,000 SYBR Safe, mix, and pour gel.Estimate the volume of each sample and accordingly add 6× loading dye into each.Load samples on gel along with a low molecular weight DNA marker. Leave one well empty between samples.Run at 90 V for 1 h (Note 31).Use blue light illumination to visualize and then cut gel slices of appropriate sizes (see library amplification image for sizes) and place them into 15 mL Falcon tubes. Use a fresh razor blade for each sample.Perform gel extraction using the Qiagen Gel Extraction kit according to the manufacturer’s instructions, with the following modifications: melt the gel pieces at room temperature. Elute in 20 μL of elution buffer.",
    "For improved yield, elute twice by taking the flowthrough from first elute and adding it back to the column.Quantify the iCLIP libraries using Bioanalyzer and qPCR, as detailed previously (Huppertz et al., 2014). Mix High, Medium, and Low fractions into a 5:5:1 ratio for sequencing (Note 32).iCLIP libraries can be sequenced using standard Illumina protocols. 50-nucleotide single-end runs are recommended."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}