{
  "id": 7763,
  "origin_website": "Bio",
  "title": "Myonecrosis Induction by Intramuscular Injection of CTX",
  "procedures": [
    "Depending on the experimental design, the number of mice required for experiments varies. To obtain statistically significant and reproducible results we used at least four adult (approximately 8 weeks old) male mice for each condition (e.g., not injected, and injected for 3, 7, and 14 days).In sterile conditions, prepare CTX stock solution by dissolving 1 mg of CTX powder (MW: 6.8 g/mol) in 294 μL (3.4 mg/mL) of sterile 0.9% NaCl2  to obtain a 500 µM solution of CTX. Aliquot the CTX stock solution and store it at -20 °C. To avoid freeze-thaw cycles, prepare aliquots of 10 μL. For TA injection, dilute the stock solution in sterile 0.9% NaCl2  to obtain a final solution of 10 μM CTX in a total volume of 50 μL for each TA muscle. Mix the solution by vortexing and keep it on ice until use. Note: CTX is not classified as dangerous, so no particular care must be taken. It is important to prepare and store the solution in sterile conditions.  Anesthetize the animals with isoflurane, until they fall asleep. Isoflurane is administered in 100% O2  . Use an induction concentration of isoflurane of approximately 3%–4%. Maintenance concentrations are 1.25%–1.75% to avoid the overall alteration of mouse physiology. In this condition, mice can be anesthetized for up to 20–30 min.Fill a syringe (500 μL syringe 30 G, Vetrotecnica) with 50 μL of 10 μM CTX and keep it ready for use.Restrain the mouse properly and insert its head inside the anesthetic tube (Figure 1A).Shave the hindlimbs of the mouse with an electric razor and swab the area with 70% ethanol.",
    "Hold the foot of the hindlimb firmly, insert the needle of the syringe prepared in step 3 in the TA mid-belly region parallel to the muscle, and then gently pull the syringe plunger before injecting CTX to ensure that the needle has not entered a blood vessel (Figure 1B). The optimal positioning of injection sites is shown in Figure 2 by inserting the needle of the syringe parallel to the TA muscle. If no blood enters the syringe, 50 μL of CTX is to be slowly injected into TA muscle. Special care should be taken when injecting into TA to avoid going past the muscle tissue.Let the mouse recover from anesthesia and place it back in its cage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4587/bioprotoc-13-01-4587-g001.jpg Figure 1. Anesthesia administration and CTX injection.  After the induction with sufficient anesthesia in the animal, the leg is restrained (A), and injury by CTX injection can be inflicted by injection in the TA muscle (B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4587/bioprotoc-13-01-4587-g002.jpg Figure 2. Optimal positioning of the CTX injection site (white dot) in the TA muscle  At the selected time points post CTX injection, anesthetize the recipient mouse through isoflurane inhalation and sacrifice it by cervical dislocation.Regenerating TA can be collected as follows:Cut the skin below the ankle.Cut through the skin along the inner hindlimb.Expose the muscle fascia and patella by pulling the skin up, and remove the epimysium (Figure 3A).Separate the tendon of TA muscle using forceps along the inner margin of the shank (Figure 3B).Snip the tendons with the fine scissors (Figure 3C). Gently pull the TA muscle from the bone (Figure 3C). Below the TA you can see the extensor digitorum longus (EDL) muscle (Figure 3C).Cut the upper part of the TA near the patella (Figure 3D). You can proceed with TA freezing (Figure 3E and Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4587/bioprotoc-13-01-4587-g003.jpg Figure 3.",
    "Procedures to isolate the TA muscle.  Pictures depict (A) TA muscle after the removal of epimysium, (B) isolation of TA tendon, (C) cut of the TA tendon, (D) cut of the distal part of the TA, and (E) TA muscle. a. patella; b. TA; c. tendon of TA muscle; d. EDL muscle.Fill up the Dewar with liquid nitrogen and take all the material necessary for freezing muscles (isopentane, plastic scoop, standard forceps, and cryovials).Spray dissection tools and workspace with 70% ethanol. Then fill up a becher with isopentane (Figure 4A) and place it on the surface of the Dewar full of nitrogen to cool it down (to avoid the risk of solidification, the becher is laid on the surface of the liquid nitrogen) (Figure 4B).Place the isolated TA muscles on the plastic scoop and then inside the becher containing cold isopentane until the muscle is completely frozen (it takes approximately 30 s) (Figure 4C and 4D). Take a cryovial with a standard tweezer and cool it by dipping it inside liquid nitrogen (Figure 4E). Once the cryogenic vial is cold (5 s), remove the scoop from the isopentane, immediately detach the muscle from the plastic scoop, and place it into the cryovial (Figure 4F). This operation must be performed quickly to avoid thawing the muscles. The cryovials are conserved at -80 °C until use. Note: You can consider the muscle completely frozen when it whitens homogeneously.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4587/bioprotoc-13-01-4587-g004.jpg Figure 4. Procedure for freezing TA muscles for Hematoxylin and Eosin staining.",
    "Fill a small becher with isopentane (A), place it on the surface of a Dewar containing liquid nitrogen (B), place the isolated TA muscle on the plastic scoop (C), and then inside isopentane (D), immerge the cryovial in liquid nitrogen using a tweezer (E) and detach the muscle from the plastic scoop and place it into the cryovial (F).For sectioning, cut the frozen muscles transversely and embed one half, at the tendon site, on the cryostat chuck by using two drops of OCT. Allow the tissue block to equilibrate to the cryostat temperature (-20 °C) before cutting the sections. Cut 6 μm muscle slides with the cryostat and make them adhere on positively charged microscope glass slides. Dry the glass slides at room temperature until the sections are firmly adherent to the slide.Perform H&E staining, following the manufacturer’s instructions (Bio-Optica) (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4587/bioprotoc-13-01-4587-g005.jpg Figure 5. Hematoxylin and Eosin (H&E) staining of WT tibialis anterior (TA) muscles (Ctrl) noninjected and 3, 7, and 14 days after CTX injection.  Scale bars, 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}