{
  "id": 11850,
  "origin_website": "Jove",
  "title": "Simultaneous Imaging and Flow-Cytometry-based Detection of Multiple Fluorescent Senescence Markers in Therapy-Induced Senescent Cancer Cells",
  "procedures": [
    "1. DLBCL cell lines with mafosfamide or daunorubicin treatment to induce cellular senescence\nNOTE: The protocol also works for adherent cancer cells. Depending on cell size, seed 1-2 × 105 cells into one well of a 6-well plate and incubate the plate in a 5% CO2, 37 °C incubator overnight before treatment. The protocol steps are the same as for suspension cells but with two exceptions. First, cells need to be trypsinized off the plate after step 3.4. Second, wash steps are performed without centrifugation before trypsinization.\nCount DLBCL cells and seed 1 × 106 cells/mL in 4 mL of medium per well into a 6-well culture plate. Cultivate DLBCL cells in RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS) and 100 U/mL penicillin/streptomycin.\nAdd MAF (5 µg/mL) or DN (20 ng/mL) into the cell culture and gently rock the plate to mix.\n\tNOTE: MAF and DN are not stable. After dissolving in DMSO, the stock solution should be aliquoted and stored at -20 °C. Freeze/thaw cycles should be avoided.\nIncubate the plate in a 5% CO2, 37 °C incubator for 3 days.\nAfter a 3 day incubation, collect the DLBCL cells in 15 mL sterile centrifuge tubes and spin at 100 × g, 4 °C for 5 min.\nDiscard the supernatant, resuspend the cell pellets with 4 mL of fresh medium, and add the suspensions back into the 6-well plate.\nCultivate the cell plate in a 5% CO2, 37 °C incubator for another 2 days before harvesting for analysis.\n2. Prepare solutions for staining (Table 1)\n3. Stain DLBCL cells with different senescence markers",
    "NOTE: Cell samples stained with individual markers (i.e., pacific blue-EdU, C12FDG, or Alexa Fluor 647-γH2AX) are prepared to generate a compensation matrix to correct the fluorescence spillover during measurement. Although highly suggested, this step could be suspended when there is an omittable overlap (compensation coefficient value ≤ 0.1) of the emission spectra among different fluorophores. However, users must determine standardized compensation steps when using different instruments and fluorescent panels.\nAdd 10 mM EdU solution at a ratio of 1:1,000 into the DLBCL cell culture generated from step 1.6 (final EdU concentration is 10 µM). Gently rock the plate to mix and incubate in a 5% CO2, 37 °C incubator for 3 h.\nTake the plate out of the incubator and add 100 mM chloroquine solution to a final concentration of 75 µM (see discussion). Gently rock the plate to mix and incubate in a 5% CO2, 37 °C incubator for 30 min.\nTake the plate out of the incubator and add 20 mM C12FDG solution at 1: 1,000 to a final C12FDG concentration of 20 µM. Gently rock the plate to mix and incubate in a 5% CO2, 37 °C incubator for 1 h.\nTake the plate out of the incubator and add 100 mM 2-phenylethyl-β-D-thiogalactoside (PETG) solution at 1:50 to stop the fSA-β-gal staining (final PETG concentration of 2 mM). Gently rotate the plate to mix.\nTransfer the cells to 15 mL sterile centrifuge tubes and spin at 100 × g, 4 °C for 5 min. Discard the supernatant and wash the cells with 4 mL of phosphate-buffered saline (PBS).\nRepeat the PBS washing step. Discard the supernatant and resuspend the cell pellets in 500 µL of 4% paraformaldehyde fixation solution.",
    "After 10 min incubation at room temperature, centrifuge at 250 × g, room temperature for 5 min. Discard the supernatant and wash cells with 4 mL of PBS.\nRepeat the PBS washing step. Discard the supernatant, resuspend the cell pellet in 200 µL of saponin permeabilization buffer and transfer the suspension to a new 1.5 mL tube. After 10 min incubation at room temperature, centrifuge at 250 × g, room temperature for 5 min.\nDiscard the supernatant and resuspend the cell pellets in 200 µL of primary antibody solution (1:500 γH2AX antibody in antibody incubation solution). Incubate at 4 °C overnight in the dark.\nCentrifuge the tubes at 250 × g, 4 °C for 5 min. Discard the supernatant and wash with 100 µL of saponin wash solution.\nRepeat the washing step an additional two times. Discard the supernatant and resuspend the cell pellets in 500 µL of EdU detection cocktail.\nIncubate at room temperature for 30 min in the dark. Centrifuge at 250 × g, room temperature for 5 min. Discard the supernatant and wash with 1 mL of saponin wash solution.\nRepeat the washing step two times. Discard the supernatant and resuspend the cell pellets in 20-50 µL of PBS. Proceed to section 4 for sample measurement.\n4. Imaging senescence markers using the imaging flow cytometer system\nEmpty the waste fluid bottle. Check the levels of speed beads, sterilizer, cleaner, debubbler, sheath, and rinse reagents (deionized water) to ensure sufficient fluids before turning on the instrument (see the Table of Materials).\nTurn on the instrument and imaging software (see the software interface in Figure 1A).\nClick on the Startup button to initialize fluidics and system calibration.\n\tNOTE: This procedure takes approximately 45 min.",
    "Set the magnification to 40x, set fluidics speed to low, and turn on the lasers needed in the experiment. Turn on 405 nm, 488 nm, and 642 nm lasers to measure EdU-pacific blue, C12FDG, and Alexa Fluor 647-γH2AX (or Alexa Fluor 647-Ki67), respectively. Set Ch6 for scatter channel, and Ch1 and Ch9 for brightfield.\nStart with the sample expected to have the highest fluorescence to set up the intensity of the lasers. Gently flip the sample tube to mix. Open the tube lid, and insert the sample tube onto the dock. Click on Load to start.\nOpen a scatter plot and select the features Area_M01 and Aspect Ratio_M01 for the X- and Y-axes, respectively. Set a gate above aspect ratio of 0.5 to exclude doublets and cell aggregates below and on the right side, and the speed bead population on the left side (Figure 1B).\nOpen a histogram plot and select the feature Gradient RMS_M01_Ch01 for the X-axis. Choose the singlet population and set the gate to select for focused cells (Figure 1C).\n\tNOTE: The imaging system will automatically use speed beads to adjust the focus for imaging. However, it is recommended to select the right half of the histogram peak for the best-focused population.\nOpen a histogram plot and select Raw Max Pixel Intensities for X-axis for each color channel (Ch2, 7, and 11). Adjust the laser powers (i.e., 488 nm, 405 nm, and 642 nm lasers for Ch2, 7, and 11, respectively), so each fluorochrome has a Raw Max Pixel value between 100 and 4,000 to avoid oversaturation.\n\tNOTE: For this experiment, the laser power setting is 50 mW, 200 mW, and 50 mW for lasers 488 nm, 405 nm, and 642 nm, respectively.",
    "Choose the focused population to record and click on Acquire to measure the DLBCL samples with consistent settings. When changing samples for measurement, click on Return to recover the sample tube. Press Load to discard the sample.\nAfter all the samples are measured, turn off the brightfield and scatter laser. Measure single-color control samples to generate a compensation matrix.\nClick on Shutdown to close the imaging system.\nAnalyze the data in the image analysis software.\n\t\nUse the Spot Wizard tool of the image analysis software to automatically count and quantify nuclear γH2AX foci in live-cell images. Select two cell populations (one with high and one with low spot count) to train the spot wizard for further automatic spot count analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}