{
  "id": 9928,
  "origin_website": "Jove",
  "title": "A Facile and Efficient Approach for the Production of Reversible Disulfide Cross-linked Micelles",
  "procedures": [
    "Ethics statement: Female athymic nude mice (Nu/Nu strain), 6-8 weeks old, were purchased and then kept under pathogen-free conditions according to AAALAC guidelines and were allowed to acclimatize for at least 4 days prior to any experiments. All animal experiments were performed in compliance with institutional guidelines and according to protocol No. 07-13119 and No. 09-15584, approved by the Animal Use and Care Administrative Advisory Committee at the University of California, Davis.\n1. Synthesis of TD PEG5K-Cys4-Ebes8-CA8\nIn a round-bottom flask, dissolve MeO-PEG5K-NH2 (2 g, 0.4 mmol) in 10-20 ml of anhydrous dimethylformamide (DMF) and chill on ice.\nIn a glass beaker, dissolve 3 equiv. of 1-hydroxy-6-chloro-benzotriazole (HOBt), 3 equiv. of N,N'-diisopropylcarbodiimide (DIC), and 3 equiv. of (Fmoc)2Lys-OH in anhydrous DMF (10-15 ml). Stir for 15-20 min on a magnetic stir plate.\nAdd the mixture to the reaction flask containing the MeO-PEG5K-NH2. Remove the ice bath and stir the reaction mixture overnight at room temperature.\nConfirm the completion of the reaction with thin layer chromatography (TLC)16 and Kaiser's test17 (a yellow color indicates the absence of free NH2). Precipitate the polymeric product 1 (MeO-PEG5K-Lys(NH-Fmoc)2) by adding approximately 200 ml of ice-cold ether to the reaction flask. Separate the precipitated polymer via centrifugation (6 min at 6,000 x g and 4 °C).\n\t\nTo perform TLC, spot the samples on silica gel-coated TLC plates. Use dichloromethane/methanol (9:1) as the mobile phase. Observe spots under a UV lamp after developing the TLC plates. One can also use ninhydrin staining reagent to visualize amine spots on a hot plate.\nFor Kaiser's test, place a little bit of the sample in glass tube containing Kaiser's reagent. Heat it at 100 °C for 5 min and look for the color change (if the color of the solution remains yellow, then the reaction is complete).",
    "Re-dissolve the product in anhydrous DMF (10-20 ml) and repeat the precipitation and centrifugation (see step 1.4).\nRepeat step 1.5, and then wash the polymer precipitate three times with ice-cold ether.\nTransfer the polymer precipitate 1 to a clean reaction flask and connect the flask to a high vacuum source to remove the residual ether.\nPrepare and add approximately 20-30 ml of 20% (v/v) 4-methylpiperidine in DMF to polymer intermediate 1. Stir until complete dissolution. Run the reaction for 3 hr.\nPerform TLC16 and Kaiser's test (a blue color confirms the presence of free NH2)17 (see step 1.4) to confirm the completion of the reaction. If the reaction is complete, proceed to the ether precipitation, as mentioned for product 1 (steps 1.4-1.6).\nDry the polymeric product 2 (MeO-PEG5K-Lys(NH2)2) under a vacuum.\nCarry out one more round of (Fmoc)2Lys-OH-coupling onto intermediate 2 (steps 1.1-1.7) to generate product 3 (MeO-PEG5K-Lys(Lys(NH-Fmoc)2)2). De-protect (steps 1.8-1.10) the Fmoc groups (4, MeO-PEG5K-Lys(Lys(NH2)2)2) and couple (steps 1.1-1.7) the (Fmoc)Lys(Boc)-OH to generate a third-generation dendritic polylysine (5, MeO-PEG5k-Lys-Lys2-((Fmoc)Lys(Boc))4) terminated with four Boc and Fmoc groups on one end of the PEG chain.\nTransfer the resulting polymer intermediate 5 to a reaction flask. In a separate reaction flask, prepare 1:1 (v/v) trifluoroacetic acid (TFA) in dichloromethane (DCM). Add 15-20 ml of a 1:1 TFA/DCM (v/v) mixture to the polymer intermediate 5. Stir the mixture until the polymer is completely dissolved. Stir for an additional 3 hr.\nPerform TLC16 and Kaiser's test (a blue color confirms the presence of free NH2)17 (see step 1.4) to confirm the completion of the reaction. If the reaction is complete, evaporate the polymer-in-TFA/DCM mixture with air until a viscous solution is obtained. Proceed to the ether precipitation, as mentioned for product 1 (steps 1.4-1.6). Dry the polymeric product 6 (MeO-PEG5k-Lys-Lys2-((Fmoc)Lys(NH2))4) under a vacuum.",
    "Transfer polymer intermediate 6 into a reaction flask. Use approximately 40 ml of anhydrous DMF containing 8 equiv. of N,N-diisopropylethylamine (DIEA) to dissolve the polymer intermediate 6. In a glass beaker, dissolve 12 equiv. of HOBt, 12 equiv. of DIC, and 12 equiv. of (Fmoc)Cys(Trt)-OH in 20-25 ml of anhydrous DMF. Shake for 10-15 min, and then add the reaction mixture to the reaction flask containing 6. Run the reaction overnight.\nConfirm the completion of reaction with TLC16 and Kaiser's test (see step 1.4; a yellow color indicates the absence of free NH2)17. If the reaction is complete, proceed to the ether precipitation, as mentioned for product 1 (step 1.4-1.6), to isolate product 7 (MeO-PEG5K-Lys-Lys2-((Fmoc)Lys-((Fmoc)Cys(Trt)))4.\nPerform Fmoc de-protection on 7, as outlined in step 1.8, to obtain product 8 (PEG5K-Lys-Lys2-(Lys(NH2)-(Cys(NH2)(Trt)))4). Couple (Fmoc)-PEG2-Suc-OH (\"Ebes\" linker, 24 equiv.) on a polymer intermediate using the procedure outlined above for HOBt/DIC-mediated coupling to obtain intermediate 9 (MeO-PEG5K-Lys-Lys2-Lys4-(Cys(Trt))4(Ebes(NH-Fmoc))8).\nPerform one more round of Fmoc de-protection (steps 1.6-1.8) to get intermediate 10 (MeO-PEG5K-Lys-Lys2-Lys4-(Cys(Trt))4(Ebes(NH2))8).\nTransfer the polymer intermediate 10 into a reaction flask and add anhydrous DMF (approximately 30-40 ml) to dissolve it. In another reaction flask, dissolve 24 equiv. of CAOSu (prepared according to the previously published procedure) in anhydrous DMF (20-30 ml)18. Add 48 equiv. of N,N-diisopropylethylamine and let it stir for 10-15 min. Transfer the contents into the reaction flask containing 10 and let the reaction run overnight.\nConfirm the completion of the reaction with TLC16 and Kaiser's test (see step 1.4; a yellow color indicates the absence of free NH2)17. If the reaction is complete, proceed to the ether precipitation, as mentioned for product 1 (steps 1.4-1.6) to isolate product 11 (MeO-PEG5K-Lys-Lys2-Lys4-(Cys(Trt))4-Ebes8-CA8). Dialyze it in de-ionized water and lyophilize the sample to yield a white powder.",
    "Place the polymer intermediate 11 into a reaction flask. Prepare and add 20 ml of the TFA/1,2-ethanedithiol (EDT)/triethylsilane (TIS)/H2O (94/2.5/1/2.5, v/v) mixture into the polymer solution. Stir the mixture until complete dissolution. Run the reaction for 4 hr. Confirm the completion of the reaction by TLC16.\nUnder the fume hood, blow air into the polymer-TFA/EDT/TIS/H2O mixture until the solution becomes viscous. Proceed to the ether precipitation, as mentioned for product 1 (steps 1.4-1.6), to isolate the final product, 12 (PEG5K-Cys4-Ebes8-CA8). Dissolve it in acetonitrile and lyophilize it to yield a white powder.\n2. Preparation of PTX-loaded Micelles\nPrepare a PTX-loaded PEG5K-Cys4-Ebes8-CA8 micelle using the standard evaporation method.\n\t\nDissolve 20 mg of TD with a different amount of PTX (1-9 mg) in 1 ml of chloroform (CHCl3). Remove the solvent using a rotary evaporator to obtain a homogeneous, dry polymer film. Reconstitute the film with 1 ml of phosphate-buffered saline (PBS) by vortex, followed by sonication for 30 min at 40 kHz, if necessary, to allow the formation of drug-loaded micelles.\nAdd 6 µl of 3% (w/w) H2O2 (1 equiv. to free the thiol groups) to oxidize the thiol groups on the TD. Use the micelle solution for further characterization once the level of free thiol groups remains at constant low values, as indicated by Ellman's test19.\nFilter the solution with a 0.22-µm filter to sterilize the sample. Analyze the amount of drug loaded in the micelles on a HPLC20 system after releasing the drugs from the micelles by adding 9 times acetonitrile and performing 10 min of sonication. Use a C18 column for HPLC with acetonitrile/water as the mobile phase.\nCalculate the drug loading according to the calibration curve between the HPLC area values and the concentrations of the drug standard11.",
    "NOTE: The loading efficiency is defined as the ratio of drug loaded into the micelles to the initial drug content.\n3. Characterizations of Micelles\nMeasure the size and size distribution of the micelles with a dynamic light scattering (DLS) instrument29. Perform the measurements at room temperature and keep the micelle concentration at 1 mg/ml.\n\tNOTE: To perform particle size analysis, use PBS as blank, and then record the particle size for actual samples. Take the readings in triplicate for samples, and then average the readings.\nUse fluorescence spectra to measure the critical micellar concentration (CMC) of PEG5K-Cys4-Ebes8-CA8 before and after cross-linking with pyrene as a hydrophobic fluorescent probe, as described previously13,21.\n\tNOTE: Typically, the micelle concentration ranges from 5×10-7 to 5×10-4 M.\n4. Stability of Micelles in SDS with or without Reducing Agents\nPrepare stock solutions of sodium dodecyl sulfate (SDS) solution (7.5 mg/ml) and disulfide cross-linked micelles (1.5 mg/ml) in PBS. Next, using the stock solutions, make a solution mixture in which the final SDS concentration is at 2.5 mg/ml and the micelle concentration is at 1.0 mg/ml.\nMeasure the size and size distribution (as mentioned in step 3.1) of the micelle solutions at predetermined time intervals with or without the presence of 10 mM glutathione (GSH).\n5. Hemolysis Assay\nEvaluate the hemolytic potential of PTX-loaded, non-cross-linked micelles (PTX-NCMs) prepared according to previously published procedure11 and PTX-loaded cross-linked micelles (PTX-DCMs) using fresh citrated blood from nude mice collected from the tail veil.\n\t\nCollect red blood cells by centrifugation of blood sample (1.0 ml) at 1,000 x g for 10 min, wash them three times with PBS, and then re-suspend the cell pellets with PBS to a final concentration of 2%.",
    "Mix 200 µl of erythrocyte suspension with different concentrations (0.2 and 1.0 mg/ml) of PTX-NCMs and PTX-DCMs, respectively, and incubate for 4 hr at 37 °C in an incubator shaker.\nCentrifuge the micelle-erythrocyte mixtures at 3,000 x g for 5 min. Transfer 100 µl of the supernatant of all samples to a 96-well plate. Measure the absorbance of free hemoglobin in the supernatant at 540 nm using a micro-plate reader.\n\tNOTE: RBCs incubated with Triton-100 (2%) and PBS are to be used as the positive and negative controls, respectively. The percent hemolysis of the RBCs is calculated with the following formula: RBC hemolysis = (ODsample - ODnegative control)/(ODpositive control - ODnegative control) × 100%.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}