{
  "id": 13796,
  "origin_website": "Jove",
  "title": "Deriving Retinal Pigment Epithelium (RPE) from Induced Pluripotent Stem (iPS) Cells by Different Sizes of Embryoid Bodies",
  "procedures": [
    "1. Preparation of Culture Reagents and Culture Plates\nPrepare feeder-free stem cell culture medium by adding 100 ml of 5x serum-free supplement to 400 ml of stem cell basal medium. The medium is stable at 4 °C for up to 2 weeks and at -20 °C for 6 months.\nAdd 10 µM solution of rho-associated, coiled-coil containing protein kinase (Rock) inhibitor (Y-27362) to commercially available embryoid body (EB) formation medium.\nPrepare differentiation medium by adding 0.1 mM β-mercaptoethanol, 0.1 mM nonessential amino acids, 2 mM L-glutamine, 10% knockout serum replacement (KSR) and 10 µg/ml gentamicin to Dulbecco's Modified Eagle Medium/Nutrient Mixture F-12 (DMEM/F12).\nPrepare iPS-RPE medium by adding 1x N1 supplement, 0.1 mM nonessential amino acids, 250 µg/ml taurine, 13 ng/ml triiodo-L-thyronine sodium salt, 20 ng/ml hydrocortisone, 5 µg/ml gentamicin, and 15% Fetal bovine serum (FBS) 21 to Minimum Essential Medium Eagle (MEM). Adjust the pH to 7.4.\nPrepare triiodo-L-thyronine sodium salt stock solution. Dissolve 1 mg of triiodo-L-thyronine sodium salt in 1 N sodium hydroxide by gently swirling. Add 49 ml of MEM to make 50 ml of 20 µg/ml of triiodo-L-thyronine sodium salt. Prepare aliquots and freeze at -20 °C until needed. Use appropriate volume to achieve desired concentration in final culture medium.\nPrepare hydrocortisone stock solution. Solubilize 1 mg of hydrocortisone in 1 ml of 100% ethanol by gentle agitation. Add 19 ml of MEM to make 20 ml of 50 µg/ml hydrocortisone stock solution. Aliquot and freeze at -20 °C until needed. Use appropriate volume to achieve the desired concentration in the final culture medium.\nPrepare a working solution of dispase of 1 mg/ml in DMEM/F12.\nPreparation of matrix coated plates",
    "Prepare protein matrix extracted from Engelbreth-Holm-Swarm (EHS) mouse sarcoma cells in DMEM/F12 to 0.08 mg/ml. Coat each well of a 6-well plate with 1 ml of the matrix solution. Incubate the coated plates at RT for 1 hr.\nAfter the 1 hr incubation, aspirate the excess DMEM/F12. Add 0.5 ml of feeder-free stem cell culture medium to prevent drying of the wells. The matrix coated plates are ready for use.\nPrepare microwell plates, by rinsing each well with 2 ml of DMEM/F12. Remove DMEM/F12 and add 0.5 ml of EB formation medium supplemented with Rock inhibitor to each well. Centrifuge the plate at 2,000 x g for 5 min to remove any air bubbles.\nPrepare FACS staining buffer by mixing 2% FBS, and 0.09% sodium azide in phosphate buffered saline (PBS). Adjust the buffer to pH 7.4.\nPrepare trypsin neutralizing solution by adding 10% FBS to DMEM/F12.\n2. iPS Culture\nPrior to iPS cell seeding, warm feeder-free stem cell culture medium to 37 °C, and have the matrix coated plates ready.\nQuickly thaw the IMR90-1 iPS cells in a 37 °C water bath. Then remove the cryo-vial from the water bath and wipe the vial with 70% ethanol. Transfer the cells to a 15 ml conical tube using a 2 ml pipette to minimize breaking of cell clumps.\nAdd 5 ml of warm feeder-free stem cell culture medium to the cells dropwise and gently mix. Centrifuge the cells at 300 x g for 5 min at RT and remove the supernatant.\nCarefully resuspend the cell clumps in 2 ml of feeder-free stem cell culture medium and seed the cell clumps in the wells of matrix-coated plate. Place the plate into a 37 °C incubator with 5% CO2, 95% humidity.",
    "Change the iPS cell culture medium daily. Observe undifferentiated colonies five to seven days after seeding. Check for undifferentiated colonies that are ready for passage (colonies with a dense center) under a light microscope.\n3. Passaging of iPS Cells\nPrior to beginning to passage the iPS cells, warm the dispase solution, DMEM/F12 and feeder-free stem cell culture medium to 37 °C in water bath.\nBefore passaging iPS cells, remove any areas of differentiation by scraping the area and aspirating the medium. Carefully rinse the iPS cells with 2 ml DMEM/F12.\nAdd 1 ml of 1 mg/ml dispase to each well and incubate at 37 °C for 7 min. Aspirate the dispase and gently rinse the cell colonies with 2 ml of DMEM/F12 two times. After rinsing, add 2 ml of feeder-free stem cell culture medium to each well.\nUsing a 5 ml pipette gently scrape the colonies of the plate to form cell clumps. Transfer the detached cell clumps to a 15 ml conical tube. Add sufficient feeder-free stem cell culture medium to seed the next passage of cells.\n4. Generation of EBs Using Microwell Plates\nPreparation of a single cell suspension of iPS cells\n\t\nRemove the medium from the iPS cells and rinse the iPS cells with 2 ml of DMEM/F12. Add 750 µl of accutase to iPS cells at each well of the 6-well plate. Incubate the cells at 37 °C and 5% CO2 to allow the cells to detach from the plate (approximately 5-10 min).",
    "Use a pipette to gently dissociate any remaining cells and to detach any remaining cells on the plate surface. Transfer the cells to a 50 ml conical tube. Rinse the plate with 5 ml of DMEM/F12 and combine the rinsed DMEM/F12 with the cells in the conical tube. Pass the cell suspension through a 40 µm cell strainer to remove any possible residual cell clumps.\nCentrifuge the cells at 300 x g for 5 min at RT to remove the accutase. Resuspend the cell pellet in EB formation medium so that the cell concentration is approximately 0.5-1.0 x 107 cells/ml.\nDetermine the number of viable cells by counting the cells with Trypan Blue and a hemocytometer.\nAdjusting cell density in microwells to form size-controlled EBs\n\t\nAdjust the number of cells to each well of the microwell plate to generate the desired EB sizes. Add cells to the microwells of the plates prepared in step 1.9, Evenly distribute the cells by gently pipetting the cells several times.\n\t\tNOTE: Number of cells required per well = desired number of cells per EB x number of microwells per well.\nAdjust the EB formation medium supplemented with Rock inhibitor in the wells to a final volume of 2.0 ml. Redistribute the cells by gently pipetting each well. Centrifuge the microwell plates at 100 x g for 3 min. Place the plates in an incubator at 37 °C with 5% CO2 and 95% humidity for 24 hr.\nHarvesting EBs from the microwell plates\n\t\nHarvest EBs from microwells by pipetting medium in the well up and down with a 1 ml micropipettor to remove most of the EBs. Pass the EB suspension through an inverted 40 µm cell strainer on top of a 50 ml conical tube to remove single cells.",
    "Wash the microwell plate 5 times with 1 ml of DMEM/F12 to remove all the EBs. Collect washes and pass over the inverted cell strainer. Turn the cell strainer right-side up to a new 50 ml conical tube. Collect the EBs by washing with EB formation medium. Count EBs to determine the yield.\n5. Plating EBs and Initiating Differentiation\nPlate the EBs on protein matrix coated six well plates (as in step 1.8.1) at a density of < 1,000 EBs/well in EB formation medium plus 10 µM Rock inhibitor. Incubate the EBs at 37 °C with 5% CO2 and 95% humidity for 24 hr.\n24 hr after EB plating, replace with differentiation medium to initiate differentiation. Change half of the differentiation medium every other day until the cells are collected for further analysis.\nCollect samples at day 6, 17, 29 and 60 to conduct RT-PCR, immunocytochemistry and FACS to validate expression of characteristic RPE genes and proteins.\n6. RNA Extraction and PCR\nExtract RNA from the EB samples according to instructions provided in the commercially available kit. Determine RNA concentration by using a spectrophotometer.\nPerform reverse transcription on 100 ng of total RNA according to commercially available RNA to cDNA reverse transcript kit.\nPerform PCR with 10 ng of cDNA using the following primers (Table 1) at a concentration of 10 µmol / 10 ng of cDNA. Set the PCR as follows: denature DNA at 95 °C for 5 min, amplify with 35 cycles at 95 °C for 15 sec, 60 °C for 30 sec, 72 °C for 1 min, followed by a final cycle at 72 °C for 10 min. Run the PCR product on a 1% Agarose gel.\n7. Immunocytochemistry",
    "Wash the EBs with PBS two times at RT. Fix the EBs at RT in 4% paraformaldehyde for 10 min. Rinse once with PBS at RT. Store samples in PBS at 4 °C until used for staining.\nOn staining day, treat the fixed cells with fixation and permeabilization reagents. Incubate the samples with blocking solution (10% goat serum in permeabilization solution) for 1 hr at RT.\nPerform immunochemistry in 10% goat serum in permeabilization solution using the following primary antibodies at the indicated dilutions:anti-Pax6 (1:10), anti-RX (1:200), anti-MITF (1:30), and anti-ZO1 (1:100). Incubate samples with corresponding antibodies O/N at 4 °C.\nNext day, remove the primary antibody from the cells and rinse the samples three times with PBS. Incubate samples with fluorophore-conjugated secondary antibodies for 1 hr at RT.\nRemove the secondary antibody from the cells and rinse the samples three times in PBS. Mount the cover slips on glass slides with DAPI containing mounting medium and allow samples to set O/N in a dark chamber. Use a fluorescence microscope to visualize the staining.\n8. Staining for FACS Analysis\nWash the cultured EBs in PBS two times. Incubate the EBs with 0.5 ml of 0.25% trypsin for 5-10 min to make a single cell suspension. Neutralize the trypsin with trypsin neutralizing solution (1 ml/well).\nTransfer the single cell suspension to a 15 ml conical tube and centrifuge at 600 x g for 10 min.\nDiscard the supernatant and add 10 ml of DMEM/F12 to the cells in the tube. Gently invert to mix the cells. Centrifuge at 600 x g. After centrifugation, discard the supernatant and resuspend the cells in FACS staining buffer.",
    "Count the total number of cells. Centrifuge at 600 x g for 10 min. After centrifugation discard supernatant. Fix the cells immediately by adding 0.5 ml of 4% paraformaldehyde. Mix well by gentle vortexing. Incubate the cells at 4 °C for 20 min.\nCentrifuge at 600 x g for 10 min and remove the supernatant. Vortex gently to disrupt the cell pellet. Permeabilize the cells by adding 1 ml of chilled permeabilization solution. Vortex gently to mix and incubate on ice for 30 min.\nCentrifuge at 600 x g for 10 min and remove the supernatant. Add 3 ml of FACS staining buffer and resuspend. Repeat this step for one more time. Resuspend the cells in FACS staining buffer at a final concentration of 5 x 106 cells/ml.\nTransfer 100 μl of the cell suspension (0.5 x 106 cells) to each microfuge tubes and add the recommended volume of primary antibody . For Pax6, add 5 µl of PE anti-Pax6 in 100 µl of cell suspension. For MITF, add 5 µl of anti-MITF in 100 µl of cell suspension.\nMix and incubate at RT for 60 min. Add 3 ml of FACS staining buffer. Mix and centrifuge at 600 x g for 10 min. Remove the supernatant and repeat 8.16 for two additional times.\nFor MITF staining, incubate the cells in secondary antibody, goat anti-mouse Alexa Fluor 488 at a dilution of 1:2,000 for 1 hr at 4 °C. For Pax6 staining, avoid this step.\nWash the cells with 5 ml of FACS staining buffer and centrifuge at 600 x g for 10 min. Repeat the process for two more times.\nResuspend the cells in 500 μl of FACS staining buffer and vortex gently to disrupt the cell pellet. Samples are ready for flow cytometric analysis.",
    "9. iPS-RPE Isolation and Culture\nAt day 29, carefully cut around the selected pigmented colonies from the culture plate using a 200 µl pipette tip . Transfer the floating colonies to a 15 ml conical tube. Centrifuge the colonies at 600 x g for 10 min at RT and remove the supernatant.\nResuspend the cell colonies in 10 ml of DMEM/F12 and centrifuge at 600 x g for 10 min. Remove the supernatant.\nPrepare a single cell suspension by incubating the colonies with 2 ml of 0.25% trypsin at 37 °C for 7-10 min. Gently vortex the cell suspension to dissociate the colonies.\nNeutralize the trypsin by adding 2 ml of iPS-RPE medium. Centrifuge at 600 x g for 10 min and discard the supernatant. Resuspend the single cells in 2 ml of iPS-RPE medium. Transfer the cells into a protein matrix coated 6-well plate and place in an incubator at 37 °C, 5% CO2 and 95% humidity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}