{
  "id": 5201,
  "origin_website": "Bio",
  "title": "Aniline Blue and Calcofluor White Staining of Callose and Cellulose in the  Streptophyte Green Algae <em>Zygnema</em> and <em>Klebsormidium</em>",
  "procedures": [
    "Aniline blue stainingPrepare 20 ml of 8 N NaOH from sodium hydroxide pellets in double distilled water (A. bidest.) in a 25 ml beaker.Prepare 50 ml of Sørensen’s phosphate buffer (0.1 M, pH = 8.0).Transfer algae to 2 ml Eppendorf tubes (Figure 1B) and wash them once with culture medium.Note: Washing can be omitted if algae from lab cultures are investigated. Avoid mechanical stress or damage to the cells by using a pair of fine-pointed tweezers. This prevents additional short-term incorporation of callose in the cell walls. Single-celled organisms or cells surrounded by a sticky mucilage layer can be transferred easily by using glass pipettes.Decant and discard culture medium and add 1.5 ml 8 N NaOH in the tube (Figure 1C).Note: Centrifuge at ~1,000 x g to sediment biomass in order to remove liquid.Incubate the tubes at 60 °C for 20 min.Note: An easy way to do this is fixing the tubes in a metal rack in a pre-heated water bath or in a beaker on a heat plate. Maintain bath level at same level as the liquid in the tubes.Decant and discard the 8 N NaOH and wash algae 3 x with A. bidest. for at least 5 min.Add 1% aniline blue (w/v) to freshly prepared Sørensen’s phosphate buffer.In the following, it is recommended to work under low light intensities (~5 μmol photons m-2 s-1) to prevent degradation of the dye.Stain algae in 1.5 ml of 1% aniline blue for 1 h (Figure 1D).Note: Incubate in darkness under gentle shaking.Wash algae 2 x with Sørensen’s phosphate buffer for 5 min and transfer to microscopic slides (mount in Sørensen’s phosphate buffer).Visualize aniline blue with an epifluorescence microscope (excitation: band pass [BP] 365/12 nm; emission: long pass [LP] 397 nm; Figure 1E).",
    "Note: Aniline blue staining allows a quick and easy-to-use visualization of callose in plant’s cell walls. Furthermore, Aniline blue can be used to quantify the callose content in plant material spectrofluorimetrically (Köhle et al., 1985). For a more specific detection of callose at the confocal laser scanning and transmission electron microscopy level, commercially available monoclonal antibodies can be applied (Meikle et al., 1991; Herburger and Holzinger, 2015). Calcofluor white stainingAdd 1% (v/v) Calcofluor white to 50 ml of A. dest.Transfer algae to 2 ml Eppendorf tubes and wash once with culture medium (Figure 1B).Note: Washing can be omitted, if algal cultures are investigated. Single-celled organisms or cells surrounded by a sticky mucilage layer can be transferred easily by using glass pipettes.Stain algae with 1.5 ml 1% Calcofluor white for 20 sec (Figure 1F).Note: Krishnamurthy (1999) describes protocols using 0.01-0.7% (v/v) Calcofluor white in buffered or unbuffered solutions and incubation times up to 2 min. Although our plant material was rather small (algal filaments with a max. diameter of ~24 µm), a 1% aqueous solution of Calcofluor white produced the best results. Lower concentrations yielded very low fluorescence signals despite incubation times up to 10 min.Wash algae twice in A. dest. for 30 sec and transfer immediately to microscopic slides (mount in A. dest.). Note: To immobilize entire algal filaments in one optical plane, epoxy-coated microscopic slides can be used. This allows focusing the central area of algal filaments and reduces blur effects by filament’s top or bottom side (Figure 1G).Visualize Calcofluor white with an epifluoresence microscope (excitation: band pass [BP] 365/12 nm; emission: long pass [LP] 397 nm; Figure 1G).Note: Excitation at 400-410 is also fine. Calcofluor white may not specifically bind to cellulose and can also stain callose, chitin, mixed-linkage glycans or other cell wall polysaccharides (Krishnamurthy, 1999).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161011/20161011010230_1248.",
    "jpgFigure 1. (A-G) Summary of the experimental procedure for Aniline blue (C-E) and Calcofluor white (F, G) staining. Aniline blue (E) and Calcofluor white (G) fluorescence is shown in blue. Bright field and corresponding fluorescence images in (E) and (G) are reprinted from Herburger and Holzinger (2015). Scale bars = 10 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}