{
  "id": 12210,
  "origin_website": "Jove",
  "title": "An Automated Rapid Iterative Negative Geotaxis Assay for Analyzing Adult Climbing Behavior in a Drosophila Model of Neurodegeneration",
  "procedures": [
    "1. Fly Collection\nMaintain the flies on standard fly food at 25 °C, 70% humidity, and a 12 h/12 h light/dark cycle.\nCollect UAS-Dicer2; DDC-GAL4 fly virginsunder carbon dioxide (CO2) anesthesia.\nCross these virgins to 2 day old adult male flies carrying the following genotypes: UAS-mCD8GFP (control), auxR16182 (aux RNAi), auxGFP (aux overexpression), and auxR16182; auxGFP (rescue), with a male: female ratio of 1:2.\nSeperately collect newly eclosed males and females in 3 vials for each group per experiment, placing 10 flies in each regular fly vial with standard food at 25 °C.\nDepending on the experiment, keep the collected flies up to 35 days and use them for automated RING analysis at day 5, 15, 25, and 35.\n2. Automated RING Assay\nTransfer 10 collected flies (unisex) per genotype into each vial, then secure the vial with a screw. Analyze control flies and flies carrying different genotypes together for each set of experiments (up to 10 vials simultaneously, 10 flies in each vial).\nTurn on the digital camera placed in front of the apparatus, and start recording once flies are all loaded and ready.\nAfter allowing 1 min for flies to settle in vials, turn on the step controller that controls the step driver; this drives the small electric motor to control the lever attached so that it consecutively rises and taps the apparatus 4 times in 2 s. See Figure 1.\n\t\nAfter tapping, note that the flies begin to ascend the wall. Ensure that recording continues.\nRepeat the synchronization as described in step 2.3 in 60-s interval for 3 to 5 consecutive trials.\nRepeat the experiment for 5, 15, 25, and 35 day old flies. Conduct at least 3 independent experiments for each group, each experiment with at least 30 collected flies (3 vials).\n3. Data Analysis",
    "Import the recorded video into the computer.\nTake a snapshot of the video at 6 s after tapping, for each trial.\nImport the snapshot image into the RflyDetection software (see Figure 2), using the 'File' menu.\nSet the upper and lower baselines of the vial precisely by using the baseline icon on the toolbar and then using the cursor to mark the upper and lower baselines on the image.\nInput the number of flies per vial (e.g., 10 here) into the 'Flys in rect' field and vial length (e.g., 14 cm here) in the 'Tube Height' field within the settings bar.\n\t\nNote that the individual fly positions are detected and labeled with dots on the screen for each vial.\n\t\tNOTE: Figure 2 indicates the positions of all menu button clicks.\nNote that the software automatically determines the climbing distance for each fly and displays the averaged values from 10 flies in each vial in a table on the right-hand panel. (See Figure 2)\nProcess the climbing number with statistical software (e.g., Prism) for further statistical analysis.\nPresent the data as mean ± SEM.\nCalculate the p-values of significance (indicated with asterisks, * p < 0.05, ** p < 0.01, *** p < 0.001) using one-way ANOVA with Bonferroni multiple comparison test.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}