{
  "id": 14255,
  "origin_website": "Jove",
  "title": "Assessing Functional Performance in the Mdx Mouse Model",
  "procedures": [
    "The experiments described here were approved by the Animal Ethics Committee (DEC) of the Leiden University Medical Center (LUMC). Mice were bred by the animal facility of the LUMC and kept in individually ventilated cages with 12 hr light dark cycles. They had ad libitum access to water and standard chow.\nWhen performing any of the functional tests described below, experimental conditions have to be strictly controlled to reduce variation. Preferably, age and gender matched mice should be used, as performance differs between age and genders. Mice belonging to the same litter should be randomized over the experimental groups. Animals should be tested by the same operator, who is blinded to the experimental groups. Tests should be performed on the same time of day and weekday, same room to equalize odors, noises, etc.14 Large variation between individual mice and time points can be observed for all functional tests, therefore 6-8 mice/experimental group should be used. Functional test performance can also largely differ between different inbred wild type strains. Therefore, experimental and control wild type mice should always have corresponding backgrounds (in case of mdx mice use the C57BL/10ScSnJ wild type strain). All data described here have been obtained with the C57BL/10ScSnJ wild type strain, which we refer to as wild type from here on. The tests described here can be used longitudinally from at least 1-19 months of age in mdx and wild type mice. Tests should not be repeated more than once weekly to prevent mice from losing interest and willingness to perform the task.\n1. Forelimb Grip Strength Test\nUse the forelimb grip strength test to measure the strength of the forelimbs. The test is based on the tendency of a mouse to instinctively grasp a grid when suspended by the tail15, and adapted from DMD_M2.2.001.pdf[href=http://www.treat-nmd.eu/downloads/file/sops/dmd/MDX/dmd_m.2.2_001.pdf].",
    "Apparatus set up: Attach a grid to a force transducer, which measures the maximum force applied by the mouse on the grid during the pull. Make sure the setting is on Peak tension mode (T-PK) for pulling. The units of force can be adjusted in either ounces-of-force, grams-of-force, pounds-of-force, kilograms-of-force, or Newtons.\n\tNote: We prefer to work with grams as unit of values. Multiple meters are commercially available, but only axial transducers give reliable outcomes as lever type force transducers are negatively influenced by the physical laws of the lever effect. Either a nonflexible grid or triangle can be used with bars that are 1-2 mm in diameter.\nPrior to the test, assess the body weight of the mouse, to allow normalization for body weight.\nUse grams as unit of values. Reset the meter at the start of each recording.\nRemove the mouse from its cage by grabbing the tail and moving it horizontally towards the grid.\nCheck that the mouse grasps the grid tightly with both forepaws.\nPull the mouse away from the grid so that its grasp is broken; the highest force applied to the grid will be shown on the transducer's display, which can be either manually or automatically recorded.\nOnly take pulls into account in which the mouse shows resistance to the experimenter. Reject measures in which only one forepaw, or the hindlimbs were used and in which the mouse turned during the pull.\nLet the mouse pull the grid three times in a row and then return it in the cage for a resting period of at least one minute. Note: between series of pulls a resting period is necessary for the mouse to recover and avoid habit formation.",
    "Then let the mouse perform four series of pulls, each followed by a short resting period. In this way the mouse has pulled a total of 15x (3 pulls x 5 times = 15 pulls).\nDetermine the maximum grip strength and normalize for body weight by taking the average of the three highest values out of the 15 values collected.\nOptional: Determine fatigue by calculating the decrement between the average of the first two and the last two series of pulls 1+2+3=A, 4+5+6=B, 10+11+12=C and 13+14+15=D. The formula: (C+D)/(A+B) gives a value of 1 for mice which are not fatigued. This can be expressed in percentages so that a mouse without fatigue has a value of 0% and a mouse which forelimbs are completely fatigued has a value of 100%.\n2. Hanging Tests\nWith hanging tests, balance, coordination and muscle condition can be assessed. These tests are based on the knowledge that mice are eager to remain hanging on a wire or grid till exhaustion16. There are two distinctive hanging tests in which at the start of the test either only the two forelimbs or all four limbs are used, using a wire or grid respectively. The hanging test using the wire and the grid are the longest suspension time method adapted from DMD_M.2.1.004.pdf[href=http://www.treat-nmd.eu/downloads/file/sops/dmd/MDX/DMD_M.2.1.004.pdf] and DMD_M.2.1.005.pdf[href=http://www.treat-nmd.eu/downloads/file/sops/dmd/MDX/DMD_M.2.1.005.pdf] respectively. A fixed hanging limit is used of 600 sec. The majority of wild type mice can hang for 600 sec, while dystrophic mice cannot. To reduce time spend performing this test, a maximum hanging time was set in place. Mice that fall off the wire or grid before then are given up to two more tries. This is done to reinsure that mice are really unable to hang and do not fall due to clumsiness.\nHanging test with two limbs",
    "Apparatus set up: Tightly secure a 2 mm thick metal cloth hanger to a shelf with tape and maintain the hanger around 37 cm above a layer of bedding. Note: alternatively, a 55 cm wide 2 mm thick metallic wire which is tightly secured between 2 vertical stands could be used. The distance of 37 cm is sufficient to encourage mice to remain hanging, but also low enough to prevent mice from injuries when falling down. The wire should not vibrate or displace during the test as this could interfere with the performance of the mouse.\nHandle the mouse via the tail and bring it near the wire.\nLet the mouse grasp the wire with the two forepaws only, and lower the hindlimbs in such a way that the mouse only hangs with the two forepaws on the wire (Figure 2B).\nDirectly start the timer when the mouse is released. After release, strong mice try to catch the wire with all the four limbs and the tail, which is allowed (Figure 2C).\nWhen a mouse shows improper behavior (like balancing on or deliberately jumping off the wire as shown in Figures 2D and 2E), directly address this by replacing the mouse on the wire without stopping the timer.\nWhen a mouse falls off the wire, stop the timer and record the hanging time.\nWhen mice are able to hang for 600 sec, take them off the wire and return them to the cage. Mice that fall before this limit are given a maximum of two more tries.\nRecord the maximum hanging time (i.e. the longest of the trials) and use this for further analysis.\nHanging test with four limbs",
    "Apparatus set up: Use either a hand made square or the lid of a big cage for a rat or rabbit for this test. Position the grid 25 cm above soft bedding to prevent mice from harming themselves upon falling, but also to discourage mice to intentionally jump off the grid. Tightly secure the grid so that the experimenter does not have to manually hold the grid during the experiment as these movements might interfere with the mouse's performance.\nPlace the mouse on the grid so that it grasps it with its four paws.\nInvert the grid so that the mouse is hanging and directly start the timer.\nThe test session ends for mice that are able to hang for a duration of 600 sec. Give mice that fall off the grid earlier a maximum of two more tries.\nUse the maximum hanging time (i.e. the longest of the trials) for further analysis.\n3. Rotarod Running\nWith the rotarod test muscle strength, coordination, balance, and condition can be determined17.\nApparatus set up: For this test, mice have to run on a rotating tube. Ensure that the steady speed is set at 5 rotations per min (rpm), and that the speed increases from 5-45 rpm in the first 15 sec when started. After this it has to maintain its speed.\nPlace the mice on the tube of the rotarod when it rotates at a slow steady speed of 5 rpm. Five mice can be tested simultaneously.\nStart the run once all mice are positioned. Within the first 15 sec the speed of the tube accelerates from 5-45 rpm after which it maintains that speed.",
    "Monitor the run. The running time is continuously recorded by the software. Running time stops automatically when a mouse falls off the tube as this activates the time bar positioned below the tube. Reposition mice that turn around facing the opposite direction on the tube while running without stopping the tube to rotate.\nEnd the test session for mice that are able to run for a duration of 500 sec. Give mice a maximum of two more tries allowing them to improve their running time, when they fall earlier. \nUse the maximum running time (i.e. the longest of the trials) for further analysis. \n4. Treadmill Exercise\nThe treadmill can be used in three ways as a tool in pre clinical research. Firstly, forced treadmill running can be used to exacerbate disease pathology as described in this protocol (see also: DMD_M2.1.001.pdf[href=http://www.treat-nmd.eu/downloads/file/sops/dmd/MDX/DMD_M.2.1.001.pdf]). Secondly, the maximal running capability of mice and the effects of treatments on this can be assessed (See for the method to let mice run till exhaustion DMD_M.2.1.003.pdf[href=http://www.treat-nmd.eu/downloads/file/sops/dmd/MDX/DMD_M.2.1.003.pdf]). Finally, treadmill running can be used prior to another functional test to exhaust the mouse so that it performs less well in the second test13. This is done by exercising mice twice or three times weekly as described below, directly followed by either one of the functional tests described in protocol 1-3.",
    "Apparatus set up: There are several treadmills commercially available on which several mice can run simultaneously and for which elevation, duration and speed can be adjusted. Some treadmills are equipped with a grid to deliver low intensity shocks to encourage mice to run. However, mdx mice are sensitive to stress and can easily be motivated in a friendlier manner by a gentle push with the hand in the running direction. Therefore, it is strongly encouraged to NOT use the shock grid. Generally, stimulation with the hand is only needed during the first running session.\nPlace the mice on the horizontal treadmill.\nStart the treadmill at a running speed of 12 m/min. Lower speeds (8 m/min) have to be used in old mice (>15 months), where higher speeds easily lead to exhaustion.\nDuring the first session, encourage mice to run by gently pushing them when they are near the end of the belt.\nWhen the mice have run for a duration of 30 min, place them back into their cage.\nRepeat this twice weekly for e.g. 12 weeks.",
    "Allow resting periods when needed. For example, some mdx mice have to stop running and should be allowed to rest for a few min. If this happens, turn the belt off, give all mice a resting period of two min, turn the belt on for two min at 4 m/min. After this, increase speed to 12 m/min and allow the mice to finish the protocol. It is important that all mice complete the entire running protocol.Note: In case mdx mice need resting periods, consider a warm up before the 30 min exercise protocol. This warm up session consists of: a 2 min acclimatization period at a speed of 4 m/min, immediately followed by an 8 min warmup at 8 m/min.In our hands 4-16 week old female mdx mice are able to complete the 30 min exercise protocol without resting. Others have reported that in age matched male mdx mice 45% of the mice do need resting periods to finish the exercise. The warm up protocol reduces the amount of stops12.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}