{
  "id": 5825,
  "origin_website": "Bio",
  "title": "<em>In vitro</em> NLK Kinase Assay",
  "procedures": [
    "Purification of GST-fusion proteinClone the gene of interest into the pGEX vector multiple cloning site.Transform the pGEX-YAP plasmid (Moon et al., 2017) into BL21 bacteria and then grow overnight on an LB plate with ampicillin (see Recipes). Note: The purification protocol can be applied to other GST fusion proteins after cloning the gene of interest in frame with GST into the multiple cloning site of the pGEX vector.Pick one colony and culture overnight at 37 °C in a shaking incubator (180 rpm) with 6 ml of 2x YTA medium in a 14 ml round bottom tube (add ampicillin; 300 μg/6 ml of 2x YTA medium, see Recipes).Transfer all cultured cells to Erlenmeyer flask.Incubate for 1 h at 37 °C in a shaking incubator (180 rpm) with 100 ml of 2x YTA (add ampicillin; 5 mg/100 ml of 2x YTA medium) and 50 μM ZnCl2.Measure optical density at 600 nm (OD600) by a UV spectrophotometer (OD should be between 0.5 and 0.8).Note: If OD600 is less than 0.5, incubate until it exceeds 0.5.To induce protein expression, add 1 ml of 100 mM IPTG to make a final concentration of 1 mM and incubate for 2 h at 37 °C in a shaking incubator.Note: Prepare 100 mM IPTG stock in sterile water; store at -20 °C.Centrifuge at 3,500 x g for 10 min at 4 °C and remove supernatant.Add 4 ml ice cold lysis buffer A (see Recipes) and resuspend the bacterial pellet by pipetting up and down followed by incubation for 10 min at 4 °C.Transfer the bacterial suspension to a 15 ml conical tube and add 1 mg of lysozyme followed by incubation for 20 min at 4 °C.Sonicate at output of 40% on ice for 10 sec (0.",
    "5 sec sonication/1 sec break) and keep on ice for 30 sec. Repeat sonication step one more time.Transfer lysate to four new 1.5 ml micro-centrifuge tubes (aliquot 1 ml) and then centrifuge at 14,000 x g for 10 min at 4 °C.Note: Henceforth, perform all procedures in micro-centrifuge tubes. Transfer supernatant to four new 1.5 ml micro-centrifuge tubes. Add 30 μl PBS-washed 50% glutathione Sepharose 4B slurry (see Notes) to each tube and then incubate while rotating for 90 min at 4 °C. Note: To remove the storage solution, wash 125 µl of the original glutathione Sepharose 4B slurry (it was stored in 20% ethanol) by adding with 1 ml ice cold PBS. Centrifuge at 500 x g for 5 min at 4 °C and discard supernatant. To obtain 50% glutathione Sepharose 4B slurry, resuspend the pellet in 100 µl 1x PBS. Centrifuge at 500 x g for 5 min at 4 °C and discard supernatant.Add 1 ml lysis buffer A (see Recipes) and then incubate while rotating for 10 min at 4 °C.Centrifuge at 500 x g for 5 min at 4 °C and discard supernatant.Wash by adding 1 ml of 50 mM Tris (pH 8.0) and immediately centrifuge at 500 x g for 5 min at 4 °C.Discard supernatant.Add 350 μl elution buffer (see Recipes) to the glutathione Sepharose 4B beads and incubate while rotating for 4 h or overnight at 4 °C.Centrifuge at 500 x g for 5 min at 4 °C and divide the supernatant into 20 µl aliquots and store the protein aliquots at -80 °C for future use.To quantify the amount of purified recombinant GST-YAP, run an aliquot of the purified protein with a BSA standard on a 10% SDS-PAGE.",
    "For this add 5 µl 4x SDS loading dye (see Recipes) to 15 µl sample and boil for 5 min.Note: Add 1x SDS loading dye to the other SDS-PAGE samples, e.g., molecular weight marker and BSA standard, to obtain a total volume of 20 μl.Separate 20 µl SDS-PAGE samples on 10 % SDS-PAGE.Run the gel for Coomassie Blue staining, then incubate the gel for 20 min at RT in Coomassie Blue staining buffer on a rocker, followed by 5 washes with destaining buffer, 10 min each time.Note: Quantify the final concentration and size of protein by Coomassie Blue staining with a BSA standard (see Figure 1 and Recipes).Store the aliquots at -80 °C freezer for future use.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171031/20171031003748_5652.jpgFigure 1. Coomassie Blue stained gel of purified GST-YAP. GST-YAP is evident as a 95 kDa band in the gel, GST alone runs at a molecular weight of around 25 kDa and BSA at 66 kDa. Lane M: protein size marker; Lane 1, 3, 5: GST-YAP; Lane 2, 4: GST; Lane 6: elution buffer; Lane 7: BSA (1 μg).In vitro NLK kinase assayIncubate HEK293 cells at 37 °C in a humidified 5% CO2 incubator in DMEM supplemented with 10% FBS and 1x antibiotics.Seed 0.8 x 106 HEK293 cells on two 60 mm untreated cell culture dishes.After 24 h, transfect cells with 3 μg Flag-NLK-WT (wild type) or Flag-NLK-KM (kinase negative) plasmid (Ishitani et al., 1999) according to the manufacturer’s protocol (TurboFect transfection reagent).Note: The ratio of DNA (μg) to TurboFect (μl) is 1:2 to 1:3.Wash cells once with 1 ml ice cold 1x PBS (see Recipes), harvest cells by scraping off the cells in ice cold 1 ml 1x PBS, transfer the cells to micro-centrifuge tubes and centrifuge at 14,000 x g for 5 min at 4 °C.",
    "Discard supernatant and add 200 μl lysis buffer B (see Recipes) to the pellet.Lyse the cells by pipetting up and down around 40 times with a 200 μl pipette and incubate for 30 min at 4 °C.Centrifuge at 14,000 x g for 5 min at 4 °C and transfer supernatant into new micro-centrifuge tubes.Measure protein concentration with Protein Assay Dye Reagent kit using UV spectrophotometer.Incubate 400 μg of protein in 800 μl of lysis buffer B with anti-FLAG antibody (0.5 μg) on rotator overnight at 4 °C.Add Protein A/G plus agarose (20 μl per sample).Incubate on microfuge-tube rotator for 120 min at 4 °C.Centrifuge at 3,000 x g for 2 min at 4 °C and discard supernatant.Add 800 μl of lysis buffer B (see Recipes) and incubate on rotator for 5 min at 4 °C.Centrifuge at 3,000 x g for 2 min at 4 °C and discard supernatant (repeat steps B12-B13 three times).Add and gently mix 800 μl of ice cold 1x kinase buffer (see Recipes) and immediately centrifuge at 3,000 x g for 2 min at 4 °C.Discard supernatant and add 3 μl of 10x kinase buffer, 1 μg GST-YAP (referred to section of ‘Purification of GST-fusion protein’), 10 μCi of Adenosine 5’-triphosphate (ATP) [γ-32P] and add H2O to make the total volume up to 30 μl in two different tubes (Flag-NLK-WT/-KM).Note: Radioactive isotopes should be used only by authorized persons and at authorized places.Incubate for 5 min at 25 °C.To stop the reaction, add 10 μl of 4x SDS loading dye (see Recipes) and boil for 5 min.Centrifuge at 3,000 x g for 2 min at 4 °C and carefully take 30 μl of supernatant and separate proteins on 10% SDS-PAGE.Detach SDS-PAGE gel from electrophoresis apparatus.",
    "Incubate gel at a rocker with Coomassie Blue staining buffer (see Recipes) at room temperature for 30 min.Discard staining buffer and rinse for 20 min with destaining buffer (see Recipes). Note: Repeat destaining until the background is nearly clear.Capture image of SDS-PAGE gel using a flat scanner for Coomassie Blue staining.Dry SDS-PAGE gel for 60 min in a Gel dryer.Expose radioactivity with X-ray film for 30 min to 4 h in X-ray film cassette in a dark room (Figure 2).Develop and fix X-ray film for analyzing NLK kinase activity (see Data analysis).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171031/20171031004102_4007.jpgFigure 2. Schematic diagram of gel exposure"
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}