{
  "id": 7178,
  "origin_website": "Bio",
  "title": "Reconstitution of Chromatin by Stepwise Salt Dialysis",
  "procedures": [
    "Reconstitution of chromatinHere we describe the protocol for a standard chromatin reconstitution experiment. In this protocol, it is assumed that the optimal amounts of histones and DNA have been previously established.To determine the optimal histone:DNA ratio with new preparations of histones and/or DNA, this protocol can be performed at 0.5× scale (that is, each reaction has 25 µg of DNA in 75 µl final volume instead of 50 µg of DNA in 150 µl final volume) in a series of reactions with different histone:DNA ratios. For this purpose, we typically carry out reactions with histone:DNA mass ratios of 0.80:1.0, 0.90:1.0, 1.0:1.0, 1.1:1.0 and 1.2:1.0.For each reconstitution reaction, prepare a 150 µl histone-DNA mix that contains 50 µg of DNA and the desired mass of histone octamers in TE Buffer (pH 8.0) containing a final concentration of 1.0 M NaCl. Mix gently. Then, incubate for 15 min on ice.It is important to consider the salt contribution from the histone stock in the calculations of the final concentration of NaCl in the histone-DNA mixture. For example, a reconstitution reaction with a desired final histone:DNA ratio of 1.0:1.0 could be prepared from 42 µl of a 1.2 mg/ml DNA stock (50 µg DNA), 42 µl of a 1.2 mg/ml histone stock containing 2.5 M NaCl (50 µg histones), 9.0 µl of 5.0 M NaCl (to give 1.0 M NaCl final concentration), 15 µl of 10× TE Buffer (i.e., 1× TE final), and 42 µl of water in a final volume of 150 µl.Load the histone-DNA mix from Step A1 into a dialysis chamber.The dialysis chamber consists of the sample reservoir, the dialysis membrane, and a sealing ring (Figure 2). Assemble the dialysis chamber as follows:Cut a microcentrifuge tube (please see Note 8) such that the lid of the tube (i.e.",
    ", the sample reservoir) is surrounded by a ring (i.e., the sealing ring).Detach the sample reservoir from the sealing ring by cutting the linker between them. Then pull the two pieces apart.Cut a square piece (about 1.5 cm × 1.5 cm) of dialysis membrane and rinse it with water to remove the storage solution. Then, immerse the membrane in TE Buffer containing 0.80 M NaCl.Load the sample into the reservoir with a 200 µl pipette.Drain the excess buffer from the membrane by gently tapping the edge over a paper towel.Cover the sample with the membrane.Close the chamber with the sealing ring (i.e., place the ring on top of the membrane, then push it down over the sample reservoir piece).Fasten the dialysis chamber with a lid lock, and immediately immerse it into TE Buffer containing 0.80 M NaCl. The dialysis membrane should be in direct contact with the dialysis buffer (i.e., the membrane side of the dialysis chamber faces down).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3977/bioprotoc-11-07-3977-g002.jpgFigure 2. Diagram of the procedure for the assembly of a dialysis chamber. The dialysis chamber is prepared from a microcentrifuge tube and a small piece of dialysis membrane as follows. A. Cut the top part of a microcentrifuge tube. B. Separate the lid and the portion of the tube that remained attached. The lid serves as the sample reservoir and the cropped tube as the sealing ring. C. Pipet 150 μl of sample into the reservoir. Cover the sample with a small square of dialysis membrane (denoted in blue). Then, place the sealing ring on top of the membrane. Close the dialysis chamber by pushing the sealing ring down over the reservoir. D. Fully assembled dialysis chamber. E. Secure the dialysis chamber with a lid lock.",
    "Dialyze at room temperature (22 °C) in a stepwise manner against decreasing salt concentrations as follows:1 L of TE Buffer containing 0.80 M NaCl for 2 h.1 L of TE Buffer containing 0.60 M NaCl for 2 h.1 L of TE Buffer containing 0.05 M NaCl for 2 h.Notes: When transferring the sealed dialysis chamber between the different buffers, it is not necessary to remove the small amount of excess buffer that is associated with the outside of the dialysis chamber. Several reconstitution reactions can be dialyzed simultaneously in a beaker containing 1 L of dialysis buffer at medium speed on a magnetic stirrer. The dialysis chambers should be gently swirling around the top of the buffer during dialysis. Remove the dialysis chamber from the TE Buffer containing 0.050 M NaCl and place it over a paper towel with the membrane side facing up.Remove the remaining excess TE Buffer on the outside of the membrane with a 200 µl pipette. Then, with a new tip, carefully perforate the membrane and transfer the dialysate (i.e., reconstituted chromatin) to a microcentrifuge tube.Store the chromatin at 4 °C. The chromatin is stable at 4 °C for several months. Do not freeze the chromatin.Quantification of the DNA concentration in the salt dialyzed chromatinWith the chromatin reconstitution procedure described in Section A, we generally recover greater than 90% of the starting amount of DNA (Figure 3). For many applications, the nucleosomal DNA concentrations can be estimated (within 10% of the method described below and shown in Figure 3) by the A260nm readings (using the extinction coefficient for pure double-stranded DNA) on a NanoDrop OneC spectrophotometer (model ND-ONEC-W; Thermo Fisher Scientific, Waltham, MA). This is probably due to the low A260nm absorbance of the histones because of their low content of aromatic amino acid residues.",
    "Alternatively, the nucleosomal DNA concentrations can be determined by removal of the histones and quantification of the resulting DNA samples, as described below. In contrast, the use of a Qubit Fluorometer is not recommended because it does not provide accurate quantification of the nucleosomal DNA in the chromatin sample, probably because the binding of fluorescent dye molecules to nucleosomal DNA is less efficient than their binding to free DNA.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3977/bioprotoc-11-07-3977-g003.jpgFigure 3. Quantification of the DNA in chromatin reconstituted by salt dialysis. A sample of salt dialyzed chromatin was diluted 8-, 16-, and 32- fold in TE Buffer containing 0.05 M NaCl. After deproteinization of a 2.0 μl aliquot of each of the three chromatin dilutions, the resulting DNA samples, along with DNA standards of known concentration (20, 40 and 80 ng naked DNA), were subjected to agarose gel electrophoresis analysis and visualized by staining with ethidium bromide (EB). The numbers under Nucleosomal DNA correspond to the calculated amounts of DNA in 2.0 µl of the 32-, 16-, and 8- fold dilutions (from left to right) of the chromatin sample after quantification by using the Gel Analysis function of the ImageJ software (NIH, Bethesda, MD). In this experiment, the reconstituted chromatin contained about 0.30 µg/µl DNA in 160 µl final volume (i.e., 48 µg of DNA, which corresponds to about 96% of the starting amount in the chromatin reconstitution reaction). Measure the volume of the sample after dialysis by using a 200 μl pipette. With this method, the volume increases by about 7% of the original reaction volume during the salt dialysis (i.e., in chromatin reconstitution reactions performed with initial volumes of 150 μl and 75 μl, we typically recover about 160 μl and 80 μl, respectively).Quantify the DNA by agarose gel electrophoresis followed by analysis with ImageJ as follows.",
    "Prepare 40, 20, and 10 ng/μl standards (in TE Buffer containing 0.05 M NaCl) of the DNA stock that was used for reconstituting the chromatin. These standards will be used to make a DNA standard curve to determine the amount of DNA in the chromatin sample (Step B2q).Dilute 2.0 μl of the reconstituted chromatin in 14 μl of TE Buffer containing 0.050 M NaCl (i.e., 8-fold dilution). Then perform two 2-fold serial dilutions in the same buffer to give 16- and 32-fold dilutions of the reconstituted chromatin.To 2.0 μl of the 40, 20, and 10 ng/μl DNA standards (from Step B2a), and 2.0 μl of the 8-, 16-, and 32-fold dilutions of the chromatin (from Step B2b), add 48 μl of HEG Buffer to give a final volume of 50 μl of each sample.To each 50 μl sample, add 100 μl of Stop Buffer and 5.0 μl of 2.5 mg/ml proteinase K. Mix gently. Incubate 30 min at 37 °C.Add 155 μl of phenol:chloroform:isoamyl alcohol and vortex vigorously for 30 s.Centrifuge at 16,000 × g for 5 min.Transfer 140 μl of the aqueous phase to a new microcentrifuge tube.To the aqueous phase, add 25 μl of 2.5 M ammonium acetate and 600 μl of 100% ethanol. Mix by inverting the tube several times.Centrifuge at 16,000 × g for 20 min.Remove the supernatant by using a transfer pipette. Then, spin the tubes briefly in a minicentrifuge and remove any leftover liquid with a 10 μl pipette tip.Air dry the pellet for 5 min.To the pellet, add 5.0 μl of Orange G Loading Buffer. Incubate for 5 min. Vortex gently, then spin briefly.Subject the DNA to electrophoresis on a 1.0% agarose-TBE gel at 3.7 V/cm until the Orange G dye reaches the bottom of the gel.",
    "The running time will vary according to the gel dimensions. As an example, a gel that is 5 cm × 6 cm × 0.5 cm (width × length × height) will take about 40 min at 100 V in a horizontal electrophoresis chamber in which the anode and the cathode are separated by 27 cm. To estimate the total voltage, multiply the distance between the electrodes in the electrophoresis chamber by the desired voltage (V) per centimeter (cm). In this example, 27 cm × 3.7 V/cm = 100 V.Stain the gel for 10 min in EB staining solution.Rinse the gel with water for 10 min.Visualize the DNA with a UV transilluminator and record an image of the DNA in TIF format for quantitative analysis.Quantify the DNA on the gel by using the Gel Analysis function of the ImageJ software (National Institutes of Health, Bethesda, MD) as described elsewhere (https://imagej.nih.gov/ij/docs/menus/analyze.html#gels[href=https://imagej.nih.gov/ij/docs/menus/analyze.html]).Note: Adjust the calculated DNA amount on the gel according to the dilution factor that corresponds to each sample. To obtain the DNA concentration in the chromatin sample, divide the calculated total amount of DNA by the volume of sample recovered after the dialysis steps (from Step B1).MNase digestion analysis of the reconstituted chromatinThe quality of the reconstituted chromatin is assessed by using the MNase digestion assay (Figures 4 and 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3977/bioprotoc-11-07-3977-g004.jpgFigure 4. Determination of the optimal histone:DNA ratio for efficient chromatin reconstitution by salt dialysis. Chromatin was reconstituted with histone:DNA mass ratios of 0.80:1.0, 0.90:1.0, 1.0:1.0, and 1.1:1.0 (i.e., 25 µg of DNA with 20 µg, 22.5 µg, 25 µg, and 27.5 µg of histone octamers, respectively) by using the salt dialysis methodology outlined in Figure 1. To evaluate the quality of the reconstituted chromatin, the samples were subjected to partial digestion with four different concentrations of MNase.",
    "After deproteinization, the resulting DNA fragments were resolved by agarose gel electrophoresis and visualized by staining with ethidium bromide (EB). The arrows indicate the DNA bands that correspond to mono-, di-, tri-, tetra-, and pentanucleosomes. In this experiment, there are higher proportions of tetra- and pentanucleosomal DNA fragments at histone:DNA ratios of 0.90:1.0 (yellow dots) and 1.0:1.0 (green dots) than at 0.80:1.0 (pink dots) or 1.1:1.0 (blue dots). For many applications, such as HDR-mediated gene editing (Cruz-Becerra and Kadonaga, 2020), it is best to use chromatin with the lowest histone:DNA ratio that yields the most extensive nucleosome arrays. In this case, the 0.90:1.0 chromatin and the 1.0:1.0 chromatin are of comparable quality and are better than the 0.80:1.0 chromatin and the 1.1:1.0 chromatin, as assessed by the MNase analysis. Therefore, the recommended histone:DNA ratio is 0.90:1.0. The DNA size markers (M) are the 123 bp ladder (Millipore Sigma), which consists of bands that are integral multiples of 123 bp. The smallest 123 bp band migrates slightly faster than the mononucleosome DNA band.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3977/bioprotoc-11-07-3977-g005.jpgFigure 5. MNase digestion analysis of salt dialyzed chromatin. Chromatin was reconstituted with three different preparations of core histones and the same plasmid DNA template (pBKS-GAPDH-HDR; 5.6 kbp; Cruz-Becerra and Kadonaga, 2020) by using the salt dialysis methodology outlined in Figure 1. A. Chromatin prepared with core histones from Drosophila melanogaster (Dm) 0-12 h embryos. The histones were purified by using the method of Fyodorov and Levenstein (2002). B. Chromatin reconstituted with HeLa core histones prepared as described in Khuong et al. (2017) (denoted as Sample A). C. Chromatin assembled with HeLa core histones obtained from BPS Bioscience (San Diego, CA) (denoted as Sample B).",
    "After partial digestion of the chromatin samples with four different concentrations of MNase, the samples were deproteinized, and the resulting DNA fragments were resolved by agarose gel electrophoresis and visualized by staining with ethidium bromide (EB). The arrows indicate the DNA bands that correspond to mono-, di-, tri-, tetra-, and pentanucleosomes. The DNA size markers (M) are the 123 bp ladder (Millipore Sigma), which consists of bands that are integral multiples of 123 bp. The smallest 123 bp band migrates slightly faster than the mononucleosome DNA band.Perform partial MNase digestion of the reconstituted chromatin (from Step A5) with four different concentrations of enzyme. Each MNase digestion reaction contains 35 µl of chromatin (5.7 ng/µl DNA; 200 ng total DNA), 9.0 µl of 10 mM CaCl2, and 5.0 µl of MNase at various concentrations (e.g., 1.3, 0.67, 0.33, and 0.17 mU/μl; the optimal concentrations will vary with different preparations of MNase) in a final volume of 49 µl. The reactions are set up as follows:Dilute an aliquot of chromatin to 5.7 ng/μl DNA in HEG Buffer in 175 µl final volume.Thaw an aliquot of a 200 U/ml MNase stock in a container with water at 4 °C. After thawing, keep the enzyme stock on ice.Make MNase working stocks that contain 1.3, 0.67, 0.33, and 0.17 mU/μl in MNase Buffer R as follows:Dilute the 200 U/ml enzyme stock to 13 mU/μl in cold MNase Buffer R (e.g., 2.0 ul of 200 U/ml MNase in 30 μl final volume).Make a 10-fold dilution of 13 mU/μl MNase to obtain 1.3 mU/μl.Perform three 2-fold serial dilutions starting with 1.3 mU/μl MNase to obtain 0.67, 0.33, and 0.17 mU/μl.Immediately before use, combine 5.0 μl of the MNase working stock with 9.",
    "0 μl of 10 mM CaCl2 to give a final volume of 14 μl MNase-CaCl2 mix. Note that it is necessary to prepare a different MNase-CaCl2 mix for each of the four MNase working stocks from Step C1c in this section. If several chromatin samples will be analyzed simultaneously, prepare the required volume of each MNase-CaCl2 mix for the total number of samples plus one (e.g., for four chromatin samples, prepare 5 × 14 µl = 70 μl of each MNase-CaCl2 mix).Add 14 μl of MNase-CaCl2 mix to 35 μl of chromatin (5.7 ng/μl DNA; from Step C1a in this section) to give a final volume of 49 µl. Mix gently, then spin briefly. Incubate exactly 10 min. Repeat this step with each MNase-CaCl2 mix (and each chromatin sample).Stop the MNase digestion reactions by adding 7.0 μl of 0.50 M EDTA (to 63 mM EDTA final concentration) to each tube. Mix gently.Recover the DNA as follows.Add 100 μl of Stop Buffer and 5.0 μl of 2.5 mg/ml proteinase K. Mix gently. Incubate 40 min at 37 °C.Add 155 μl of phenol:chloroform:isoamyl alcohol and vortex vigorously for 30 s.Centrifuge at 16,000 × g for 5 min.Transfer 140 μl of the aqueous phase to a new microcentrifuge tube.To the aqueous phase, add 25 μl of 2.5 M ammonium acetate and 600 μl of 100% ethanol. Incubate for 10 min.Centrifuge at 16,000 × g for 20 min.Remove the supernatant by using a transfer pipette. Then, spin the tubes briefly in a minicentrifuge and remove any leftover liquid with a pipette tip.Air dry the pellet for 5 min.Resolve the DNA fragments by agarose gel electrophoresis.To the pellet, add 5.0 μl of Orange G Loading Buffer. Incubate for 5 min. Vortex gently, then spin briefly.Subject the DNA to electrophoresis on a 1.",
    "3% agarose-TBE gel at 3.3 V/cm until the Orange G dye reaches the bottom of the gel (this will take about 2.5 h with a gel that is 11 cm, 14 cm, and 0.6 cm in width, length, and height, respectively).Visualize the DNA by EB staining.Stain the gel for 30 min in EB staining solution.Remove the excess EB with water (typically, two 10 min rinses in water).Visualize the DNA with a UV transilluminator."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}