{
  "id": 15122,
  "origin_website": "Jove",
  "title": "Transforming, Genome Editing and Phenotyping the Nitrogen-fixing Tropical Cannabaceae Tree Parasponia andersonii",
  "procedures": [
    "1. Grow P. andersonii Trees in the Greenhouse\nGerminate P. andersonii WU1 seeds18.\nUse fresh Parasponia berries or soak dried berries in water for 2 h to rehydrate. Squash berries on a piece of tissue paper or rub against the inside of a tea sieve to remove the seeds.\nDisinfect seeds using commercial bleach (~4% hypochlorite) for 15-20 min and subsequently wash the seeds 6 times using sterilized water.\nTransfer the seeds to sterile 200 μL PCR tubes. Fill the tubes with sterilized water, such that the seeds are completely submerged. Incubate the tubes for 10 days in a thermocycler running the following program: 30 cycles (7 °C for 4 h, 28 °C for 4 h). Do not use a heated lid, as this might kill the seeds.\nPrepare SH-0 plates (see Table 1). Transfer the seeds to SH-0 plates and incubate at 28 °C, 16 h:8 h day:night. Close plates with 2 layers of elastic sealing foil to prevent drying during incubation at 28 °C.\nAfter seedlings have developed their first set of true leaves (~3-4 weeks after incubation at 28 °C), transfer seedlings to pots filled with commercial potting soil and cover the seedlings with a translucent plastic cup to prevent desiccation. Place pots in a 28 °C climate room or greenhouse, ~85% RH, under a 16 h:8 h day:night regime.\nAfter 1 week, remove the translucent plastic cup. Water the pots regularly and when trees grow bigger supplement with fertilizer to sustain growth.\n2. Cloning of Constructs for CRISPR/Cas9-mediated Mutagenesis of P. andersonii\nNOTE: Standard binary transformation vectors can be used for the stable transformation of P. andersonii. Here, as an example, is a procedure to generate constructs for CRISPR/Cas9-mediated mutagenesis using modular cloning (e.g., Golden Gate)19.",
    "Identify guide RNA target sequences for the gene(s) of interest, using bioinformatics software featuring a built-in CRISPR design tool. Choose guide RNA sequences located at the 5’-end of the coding sequence of the target gene to increase the chance of obtaining full knockouts. Make sure to check for off-target effects by searching against the P. andersonii genome6.\n\tNOTE: Use 2 sgRNAs per target gene, preferably 200-300 bp apart. This may generate deletions that can be identified by PCR and subsequently by agarose gel electrophoresis.\nGenerate level 1 Golden Gate constructs containing the sgRNA sequences.\nDesign primers to amplify each individual sgRNA by inserting the 20 bp guide sequence at the position of N(20) in the following primer sequence: 5’-TGTGGTCTCAATTGN(20) GTTTTAGAGCTAGAAATAGCAAG-3’.\n\t\tNOTE: If the guide sequence equals GN(19), remove the G at the 5’ end of the guide sequence before inserting in the primer sequence.\nPCR amplify sgRNAs from pICH86966::AtU6p::sgRNA_PDS20 using the forward primers designed at step 2.2.1 and the universal reverse primer: 5’-TGTGGTCTCAAGCGTAATGCCAACTTTGTAC-3’. Use a high-fidelity heat-stable DNA polymerase and the following PCR conditions: 98 °C for 30 s; 30 cycles (98 °C for 10 s; 53 °C for 20 s; 72 °C for 10 s); 72 °C for 7 min. Successful PCR reactions yield a 165 bp amplicon.\nColumn-purify the PCR amplicon using a commercial PCR purification kit. Subsequently, set up Golden Gate reactions to clone sgRNAs behind the Arabidopsis thaliana AtU6p small RNA promoter: 10 ng of the sgRNA PCR amplicon, 150 ng of pICSL01009::AtU6p20, 60 ng of the appropriate level 1 acceptor vector, 2 µL of T4 ligase buffer, 2 µL 0.1% of bovine serum albumin (BSA), 0.5 µL of BsaI, 0.5 µL of T4 ligase, fill to 20 µL with ultra-pure water. Ensure that all sgRNAs are cloned in the same orientation to prevent hairpin formation.",
    "Incubate reactions in a thermocycler running the following program: 37 °C for 20 s; 26 cycles (37 °C for 3 min; 16 °C for 4 min); 50 °C for 5 min; 80 °C for 5 min. Transform Golden Gate reactions to Escherichia coli and plate on LB medium21 containing ampicillin (50 mg/L), X-Gal (200 mg/L) and IPTG (1 mM).\n\t\tNOTE: Prepare stock solutions of IPTG and X-Gal in ultra-pure water and dimethylformamide, respectively. Filter sterilize the ampicillin and IPTG stock solutions and store all stocks at -20 °C. Wear gloves when handling dimethylformamide.\nSelect white colonies and isolate plasmids using a commercial plasmid isolation kit. Sequence verify isolated plasmids before continuing with Golden Gate level 2 assembly.\nAssemble level 2 Golden Gate constructs for the stable transformation.\nPerform a Golden Gate reaction using the level 1 AtU6p::sgRNA constructs (generated under section 2.2) as well as pICH47802::NPTII, pICH47742::35Spro::ΩNLS-aCas9::35Ster, the level 2 acceptor pICSL4723 and the appropriate end-linker (see Engler et al.22). Perform reactions as following: use ~100 fmol of each donor vector and ~20 fmol of the acceptor vector and add 2 µL of T4 ligase buffer, 2 µL of 0.1% BSA, 0.5 µL of BpiI, 0.5 µL of T4 ligase, fill to 20 µL with ultra-pure water.\n\t\tNOTE: The level 1 plasmids pICH47802::NPTII, pICH47742::35Spro::ΩNLS-aCas9::35Ster need to be cloned first (see Supplemental File 1), as is described for sgRNAs under section 2.220,22,23.\nIncubate reactions as under step 2.2.4 and transform into E. coli. Plate on LB medium containing kanamycin. Next day, select white colonies and isolate plasmids. Determine the correct plasmid assembly by restriction-digestion analysis.\nTransform level 2 constructs to Agrobacterium tumefaciens strain AGL124.\n3. Stable Transformation of P. andersonii",
    "Inoculate 2 LB plates containing the appropriate antibiotics with A. tumefaciens strain AGL1 transformed with the construct of interest. Incubate plates at 28 °C for 2 days.\nHarvest young branches from greenhouse-grown trees. Use about 5 branches of 5-8 cm in length for each transformation. Ensure to only use healthy non-infected branches. Remove the leaves by cutting them as such that ~1 cm2 of leaf tissue is left at the end of each petiole. Discard the leaves.\nDisinfect tissue for 15 min using 1:1-diluted commercial bleach (~2% hypochlorite after dilution) containing a few drops of polysorbate 20. Then, rinse the tissue 6 times with autoclaved water.\nNOTE: This step, as well as, the following steps need to be conducted inside a laminar down-flow cabinet to keep tissue sterile.\nRe-suspend the A. tumefaciens cells from 1-2 plates in 25 mL of infiltration medium (see Table 1) containing acetosyringone (20 mg/L) and a non-ionic surfactant (0.001% v/v) to reach an optical density (OD600) of ~5.\nNOTE: Prepare the acetosyringone stock solution in 70% ethanol and store at -20 °C. The non-ionic surfactant needs to be filter-sterilized before adding to the infiltration medium.\nCut both the stem and petiole tissue in pieces of ~1 cm in length inside the A. tumefaciens suspension, thereby creating fresh wounds at both sides. Leave tissue pieces in the A. tumefaciens suspension for 10-30 min.\nPrepare the rooting medium (see Table 1) and add acetosyringone (20 mg/L) after autoclaving. Dry tissue pieces on a sterile piece of filter paper and place it on the medium (~10 explants/plate). Incubate plates in dark at 21 °C for 2 days.\nNOTE: Allow the medium to cool down to ~60 °C prior to adding acetosyringone.",
    "After 2 days, inspect plates for fungal or obvious bacterial contamination (bacteria other than A. tumefaciens). Contaminated plates need to be discarded.\nPrepare liquid SH-10 medium (see Table 1). After autoclaving, add polysorbate 20 (0.01%, v/v). Transfer tissue pieces to 10 mL of SH-10 containing polysorbate 20. During a period of at least 10 min, gently agitate every 2-3 min to wash the tissue.\nWash two additional times with fresh SH-10 containing polysorbate 20. These times, a 2-3 min incubation time per washing step is enough.\nPrepare the rooting medium (see Table 1). After autoclaving, add cefotaxime (300 mg/L) and kanamycin (50 mg/L) and pour plates. For the secondary transformations (transformations of transgenic kanamycin-resistant lines), apply hygromycin (15 mg/L) selection.\nDry tissue pieces on sterile pieces of filter paper. Afterwards, transfer tissue pieces to the plates prepared in step 3.9.\nIncubate plates for 7 days at 28 °C, 16 h:8 h day:night. Every 2 days check plates for fungal or bacterial contamination and excessive growth of A. tumefaciens. In case of contamination, transfer non-infected pieces to a fresh plate.\nAfter 7 days, transfer tissue pieces to propagation medium (see Table 1) containing cefotaxime (300 mg/L) and kanamycin (50 mg/L). Incubate plates at 28 °C, 16 h:8 h day:night. Refresh plates once a week until transgenic shoots develop. Ensure to only transfer non-infected tissue pieces to fresh plates. Discard the pieces that are overgrown by A. tumefaciens.\nOnce putatively-transgenic shoots are ≥1 cm in length, cut shoots and culture them independently in the propagation medium containing cefotaxime (300 mg/L) and kanamycin (50 mg/L). To ensure that shoots represent independent transformants, take only a single shoot from each side of an explant.\nVegetatively propagate putatively-transgenic shoots as described under step 5.2.\n4. Genotyping of Putatively-transgenic Shoots",
    "Design primers spanning the sgRNA recognition site(s). To allow PCR amplicon sequencing, choose primers 150-250 bp away from the sgRNA recognition site(s).\nCut a leaf tip (~5 mm) from each transgenic shoot to be genotyped. Also, harvest a wild-type control sample.\nPerform 50 µL PCR reactions using the primers designed at step 4.1 and a commercial kit to directly amplify DNA from plant samples. Alternatively, PCR reactions can be performed on purified DNA using a high-fidelity polymerase.\nSeparate PCR amplicons on a 1.5-2% agarose gel.\nAnalyze the results from gel electrophoresis. Check for samples producing multiple bands (more than 1 allele) and PCR amplicons with sizes different from wild type, which indicates the presence of medium-sized indels.\nSequence PCR amplicons to identify the exact mutations. For samples producing a single PCR amplicon, PCR products can be sequenced directly. Samples that produce more than 1 band after gel electrophoresis or that appear to be heterozygous after direct sequencing of the PCR amplicon, need to be cloned into a blunt-end cloning vector first. Subsequently, sequence multiple clones for each sample to identify all possible alleles present in the sample.\nAlign sequencing results to the gene of interest and inspect the alignment to check for mutations near the sgRNA target site(s). Subsequently, check whether these mutations create frameshifts. Discard lines with > 2 alleles, and lines containing in-frame mutations.\nSelect several lines for further analysis.\nPropagate selected lines as described under step 5.2.",
    "When lines have developed several new shoots, take new samples from ≥3 leaf tips and repeat steps 4.3-4.7. Determine whether the mutations present in each of the samples originating from the same line as well as the original PCR sample are identical. Lines that yield the same mutations in all samples are homogeneously mutated and can be used for further experimentation. Discard lines that do not yield the same results as these lines are chimeric.\n5. Preparation of Rooted P. andersonii Plantlets for Experimentation\nInitiate a new tissue culture line of P. andersonii.\nHarvest axillary buds, young adventitious shoots or leaf tissue from healthy trees. Alternatively, seedlings can be used as a starting material.\nDisinfect tissue using 1:1-diluted commercial bleach (~2% hypochlorite after dilution) containing a few drops of polysorbate 20 for 15 min. Afterwards, rinse tissue 6 times using autoclaved water.\nNOTE: This step, as well as, the following steps need to be conducted inside a laminar downflow or laminar crossflow cabinet to keep tissue sterile.\nTransfer tissue to propagation medium (see Table 1). Close plates with 2 layers of elastic sealing foil and incubate plates at 28 °C, 16 h:8 h day:night.\nInspect plates every few days during the first 2 weeks to ensure that tissue is free from fungal or bacterial contamination.\nPropagate tissue by placing ~10 shoots on a fresh plate of propagation medium and close the plate with 2 layers of elastic sealing foil. Incubate plates at 28 °C, 16 h:8 h day:night. Repeat this step every 4 weeks.",
    "When shoots are >1 cm in length, cut shoots at their base and place them on the rooting medium (see Table 1). About 10 shoots can be placed on a single rooting plate. Position shoots upright by inserting the basal tip of the shoot into the medium. Roots appear at 10-14 days after incubation of the plates at 28 °C, 16 h:8 h day:night.\n\tNOTE: Do not root all shoots but keep part for tissue culture propagation (see step 5.2).\n6. Nodulation of P. andersonii Plantlets in Pots\nPrepare rhizobium inoculum.\nInoculate 10 mL of liquid YEM medium (see Table 2) from a single colony of Mesorhizobium plurifarium BOR26 and incubate at 28 °C for 2 days.\nNOTE: M. plurifarium BOR2 is preferred as it efficiently nodulates P. andersonii. However, other rhizobium strains can also be used for nodulation of P. andersonii (e.g. Bradyrhizobium elkanii WUR325, Rhizobium tropici CIAT89926,27 or Bradyrhizobium sp. Kelud2A4).\nUse the 10 mL culture to inoculate a larger volume of liquid YEM medium. The volume of this culture is dependent on the number of pots that need to be inoculated.\nPrepare liquid EKM medium (see Tables 3, Table 4). Centrifuge the bacterial culture for 10 min at 3,500 x g to harvest the cells. Subsequently, re-suspend the bacterial pellet in liquid EKM (use approximately the same volume as the original YEM culture) and determine the optical density (OD600).\nFor ~20 pots, prepare 3 L of liquid EKM medium and inoculate with the rhizobial suspension prepared at step 6.1.3. to reach OD600 = 0.025.\nMix 3 L of EKM containing rhizobia with 1,250 g of perlite. Subsequently, add 210 g of this mixture to sterile translucent polypropylene pots. Alternatively, instead of perlite, use sand as a substrate for nodulation assays.",
    "Plant 1-3 P. andersonii plantlets in each pot. Also, prepare several pots containing P. andersonii plantlets transformed with the CRISPR-control construct (see Supplementary Table 1). Weigh several pots to be able to determine water loss during the experiment. Cover the bottom of each pot to shield the roots from light exposure.\nIncubate pots in a climatized growth room (28 °C, 16 h:8 h day:night) for 4-6 weeks. Once a week, weigh several pots to determine water loss. If water loss exceeds 10 mL, supplement with ultra-pure water to compensate for the loss.\nAfter 4-6 weeks, clean the roots from perlite and determine nodule numbers using a binocular to examine the nodulation efficiency.\n7. Nodulation of P. andersonii Plantlets on Plates\nPrepare cellophane membranes28.\n\t\nCut the cellophane membrane to fit into a square 12 cm x 12 cm Petri dish. Cut the membranes a bit shorter at the top to allow space for the shoots to grow.\nTo increase the permeability of cellophane membranes, boil the membranes in EDTA solution (1 g/L) for 20 min. Afterwards, rinse at least 6x with demineralized water to remove the EDTA.\nNOTE: As the dry membrane tend to wrinkle when in contact with water, submerge the dry membranes one by one into the solution.\nArrange the membranes horizontally in a thin layer of water in a round glass plate. Sterilize the membranes by autoclaving twice.\nPlace 1 autoclaved cellophane membrane on a square 12 x 12 cm Petri dish containing agar-solidified EKM medium (see Table 3, Table 4). Place two 3-week old rooted P. andersonii plantlets (see section 5) or 4-week old seedlings (see section 1.1) on the top of the membrane. Ensure to only pick plantlets or seedlings with roots that have white root tips, indicating that these roots are still growing.",
    "Gently cover the roots with a second cellophane membrane, creating a sandwich layer. Seal the plate with 3 layers of elastic sealing foil. Wrap the bottom half of the plates with aluminum foil, to cover the roots from light exposure.\nIncubate the plates in a climatized growth room (28 °C, 16 h:8 h day:night) for 3-4 weeks. Mark the position of the root tips to follow the root growth over time.\nIf the EKM plates start to dry out due to prolonged incubation, transfer the plants to fresh EKM plates a few days ahead of bacterial inoculation.\nPrepare the bacterial inoculum as described at step 6.1.\nRemove the top cellophane membrane and apply 1 mL of rhizobium culture (OD600 = 0.025) to the roots. Subsequently, place a new cellophane membrane on the inoculated roots. Wrap the outside of the plate using aluminum foil to cover the roots from light exposure.\nAfter 4 weeks, examine nodule numbers using a binocular to determine the nodulation efficiency.\n8. Nodulation of P. andersonii Seedlings in Pouches\nGerminate P. andersonii seeds as described in section 1.1. After the cotyledons have fully emerged (~12 days on SH-0 plates at 28 °C), transfer the seedlings to pouches.\nTo prepare the pouches, tear the folded section of the paper wick and add 7 mL of modified EKM medium (see Table 3, Table 4).\nInsert 1 or 2 seedlings by placing the roots in between both sheets of paper that form the paper wick and the front plastic sheet of the pouch.\nShield the roots from light exposure, by folding aluminum foil around the pouch. Suspend the pouches in a plastic box covered with a translucent lid to maintain high humidity. Place the box in a climatized growth room (28 °C, 16 h:8 h day:night).",
    "Compensate for water evaporation by adding sterile ultra-pure water, as such that the paper wick remains humid (avoid standing water at the bottom of the pouch). After the first week, this generally requires adding 2-3 ml every 4 days.\nPrepare the bacterial inoculum as described at step 6.1.\nAfter seedlings have been grown for 10-12 days in pouches, inoculate the root system with 500 µL of rhizobium culture (OD600 = 0.025).\nFollow the nodule formation through time. Four weeks post inoculation, nodules can be counted and harvested to determine nodulation efficiency.\n9. Nodule Cytoarchitecture Analysis\nCollect 10-15 nodules in a 2 mL tube containing fixative (5% glutaraldehyde in 0.1 M phosphate buffer, pH 7.2). Apply vacuum for ½-1 h and incubate overnight at 4 °C. During this period, the samples sink to the bottom of the tube.\nNOTE: The fixative solution can be stored at 4 °C for ~2-4 weeks prior usage. Make sure to wear gloves when working with tissue fixative.\nWash the nodules 2x with 0.1 M phosphate buffer, pH 7.2. Apply 10 min intervals between each washing step.\nDehydrate the samples by subsequently incubating in 30%, 50%, 70%, and 100% ethanol. To ensure that all water is removed from the samples, repeat the 100% ethanol step 3x. Apply 10 min intervals between each dehydration step.\nPrepare polymerization mixture I (PM-I) by adding 1 pack of Hardener I to 2.5 mL of PEG400 mixed with 100 mL of HEMA (2-hydroxyethyl methacrylate)-based resin solution. Stir the solution for ~15 min to completely dissolve the Hardener I. Subsequently, store PM-I at -20 °C.",
    "Remove the ethanol from step 9.3. and infiltrate the samples in the following order: PM-I:100% ethanol (1:3, v/v), PM-I:100% ethanol (1:1, v/v), and PM-I:100% ethanol (3:1, v/v). Incubate the samples in each solution at RT for ½-1 h or until the samples sink to the bottom.\nIncubate samples overnight at 4 °C in 100% PM-I solution.\nPrepare polymerization mixture II by mixing PM-I and Hardener II in a 15:1 (v/v) ratio. Fill the plastic mold with the polymerization solution, orient the samples horizontally at the bottom of the mold, and cover with a piece of elastic sealing foil. Avoid the formation of air bubbles.\nNOTE: As the solution starts to polymerize upon exposure to RT, try to orient the samples as quickly as possible in the plastic holder. Polymerization is completed after overnight incubation at RT, or 1 h at 37 °C.\nRemove the elastic sealing foil cover from step 9.7 and place a holder to the polymerized samples. To mount the holder to the samples, dissolve 10 mL of methyl methacrylate-based resin powder in 5 mL of methyl methacrylate-based resin solution. Quickly add the solution to the hole in the top of the holder.\nNOTE: Perform the polymerization step in the fume hood (~30 min at RT).\nMicrotome section samples to a thickness of 4-5 µm. Place a microscope slide on a 58 °C hot plate and add a large drop of water to each slide. Place the sections on the top of the water. Once the water has evaporated, the sections will adhere to the slide.\nStain slides by immersing in 0.05 % (w/v) toluidine blue for 2 min. Subsequently, rinse slides 3x with ultra-pure water. Slides can be observed using a bright-field microscope.\n10. Mycorrhization of P. andersonii Plantlets\nPrepare Rhizophagus irregularis spores’ inoculum",
    "Prepare a stack of polyester woven filters with the following sizes (top to bottom): 210 µm, 120 µm, and 36 µm mesh size.\nPipette the required amount of a commercial spore suspension onto the stack of polyester filters. Rinse the filters 3x with 100 mL of autoclaved demineralized water. The spores are retained on the surface of the 36 µm filter.\nNOTE: Prepare the spore suspension in the laminar crossflow cabinet to prevent contamination.\nDisassemble the polyester stack and keep the 36 µm filter only. Repeat the washing step with autoclaved demineralized water for at least 6x.\nPlace the filter on a Petri dish and re-suspend the spores in autoclaved demineralized water. Use a volume of water equal to the volume of the spore suspension used in step 10.1.2. Transfer the spore suspension to a sterile tube by pipetting.\nPlace 5 drops of 20 µL of the spore suspension on a glass slide and count the number of spores using a bright-field microscope. Convert spore counts into a ratio of spores/mL and dilute the spore suspension until it reaches 250 spores/mL. Store the spore suspension at 4 °C.\nPerform mycorrhization assay. To this end, add 800 g of autoclaved sand supplemented with 70 mL of ½-Hoagland medium to sterile translucent polypropylene pots (see Tables 5-6). Mix sand and medium directly in the pot by shaking vigorously.\nPlace one P. andersonii plantlet in each pot, and pipette 1 mL of the spore suspension directly onto the root of the P. andersonii plantlet. Ensure to include several pots containing P. andersonii plantlets transformed with a CRISPR-control construct (see Supplementary Table 1).\nIncubate pots in a climatized growth room (28 °C, 16 h:8 h day:night) for 6 weeks.",
    "Take out the plants from the pots and wash the roots with running water to remove as much sand as possible.\nCut roots in 1 cm long pieces and boil the root pieces in 10% KOH (w/v) for 20 min at 90 °C. Subsequently, place the boiled roots on a cell strainer with a 100 µm mesh size and rinse 3x with 50 mL of water.\nStain roots with 0.05% (w/v) trypan blue in lactoglycerol (300 mL of lactic acid; 300 mL of glycerol; and 400 mL of demineralized water) for 5 min at 90 °C in a water bath or heating block. Subsequently, transfer roots to 30% glycerol. The root samples can be stored at RT.\nPlace 15-25 root fragments on a single microscope slide. Add 30% glycerol and cover with a cover glass and press until root pieces become flat. Observe the root fragments using a bright-field microscope and score the mycorrhizal colonization.\nNOTE: A method to score mycorrhization is described according to Trouvelot et al.29. This method uses several classes (%F, %M, and %A), which allows rapid estimation of the level of mycorrhizal colonization of each root fragment and abundance of arbuscules."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}