{
  "id": 2492,
  "origin_website": "Cell",
  "title": "CRISPR-Cas9 screen in human embryonic stem cells to identify genes required for neural differentiation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeCKO v2 lentiviral transduction for screen\nTiming: 2–3 weeks\nThe lentiviral GeCKO v2 library will now be used to transduce H9 ESCs. Considering the low transduction efficiency (∼30% if MOI = 0.3), at least 120 million cells are required to maintain enough coverage of the library. After transduction, the cells should be treated with puromycin for at least one week to kill non-transduced cells and promote gene editing.\nPrepare H9 ESCs for transduction.\nCulture H9 ESCs in ten 6-well plates. Refeed fresh mTeSR1 daily until cells reach ∼70% confluency.\nRemove the spent medium. Rinse cells with 1 mL/well DMEM/F12 and add 1 mL/well Accutase solution. Incubate at 37°C for 10 min.\nAdd 4 mL/well DMEM/F12. Pipette gently to dislodge cell aggregate into single cell suspension. Pool cell suspension from one plate to a 50 mL Corning tube.\nCentrifuge the cell suspension at 200 g for 5 min.\nRemove the supernatant. Resuspend cell pellets in 10 mL/tube mTeSR1 supplemented with 10 μM Y27632 ROCK inhibitor.\nPool all cell suspension together and mix well by pipetting.\nCount cell numbers with a cell counter.\nTransduction of cells.\nPrepare the transduction master mix by combining 120 million cells with the appropriate volume of viruses to achieve the desired MOI of 0.3.\nSeed cells at 5 × 105 cells/well in a 6-well plate. Use 40 Matrigel-coated 6-well plates to seed all 120 million cells.\nGently shake 6-well plates back and forth to spread cells evenly.\nCulture cells in a 37°C incubator.\nPuromycin selection and maintenance of transduced cells.\nRefeed cells daily with 1.5 mL/well fresh mTeSR1 supplemented with 0.5 μg/mL puromycin.\nKeep puromycin treatment for 7 days. Puromycin will kill uninfected H9 ESCs and promote growth of H9 ESCs infected with the lentiviral GeCKO library.",
    "Passage cells when they are 70% confluent.\nWhen passaging, dissociate cells with Accutase, pool all cells, re-suspend in mTeSR1 supplemented with 10 μM Y27632 ROCK inhibitor and 0.5 μg/mL puromycin, mix thoroughly and count cell density.\nSeed cells at 3 × 105 cells/well into new Matrigel-coated 6-well plates. Seed at least 36 million cells every time to maintain 300× coverage. This ensures optimal sgRNA representation in cells.\nNPC induction and harvesting\nTiming: 1–2 weeks\nIn the Sivakumar et al. (2022)[href=https://www.wicell.org#bib5] study, we performed a genetic screen to unravel novel regulators of neural differentiation. We used SOX1, a well-established neural progenitor cell (NPC) marker, as an end point reporter in our genetic screen. The SOX1 protein is not expressed in ESCs but is robustly expressed in NPCs, making it an ideal marker for NPC development (Figure 2[href=https://www.wicell.org#fig2]B). SOX1-positive NPCs were also functional and could be efficiently differentiated into neurons or astrocytes. We differentiated H9 ESCs infected with the GeCKO lentiviral library into NPCs by culturing them in SMADi neural induction medium. After 7 days of differentiation, NPCs were harvested and fixed for SOX1 staining with a specific SOX1 antibody (Figure 2[href=https://www.wicell.org#fig2]C). Other NPC markers, such as PAX6 or NESTIN, could also be used if the antibodies are specific.\nWash H9 ESCs (the uninfected control cells and cells infected with the GeCKO lentiviral library) once with 1 mL/well warm DMEM/F12. Add 1 mL/well warm Accutase. Incubate at 37°C for 10 min.\nAdd 4 mL/well warm DMEM/F12. Pipette gently to dislodge cell aggregates into single cells. Transfer the cell suspension to 50 mL tubes.\nCentrifuge at 200 g for 5 min.",
    "Remove the supernatant. Resuspend cell pellets in 10 mL SMADi Neural induction medium supplemented with 10 μM Y27632 ROCK inhibitor. Pool all infected cells, mix thoroughly, and count cell density in the suspension.\nSeed cells at 2 × 106 cells/well in five Matrigel-coated 6-well plates. Culture in a 37°C incubator.\nFrom day 1 to day 7 of NPC differentiation, refeed cells every day with 2 mL/well fresh SMADi Neural induction medium.\nOn day 7 of NPC induction, cells are ready for harvesting.\nTo harvest cells, rinse cells with warm DMEM/F12 and dissociate cells by incubating with 1 mL/well Accutase for 10 min at 37°C.\nPool all cells of the same condition together and count the cell density.\nCentrifuge cells at 300 g for 5 min.\nResuspend cell pellets in 20–30 mL cold Cytofix I buffer to fix cells for FACS sorting and staining. Incubate at room temperature (∼26°C) for 20 min.\nAlternatives: Other commercial or homemade fixation buffers could also be used.\nCentrifuge at 1,000 g for 10 min. Remove the Cytofix buffer and wash with 40 mL of cold PBS.\nCentrifuge at 1,000 g for 10 min. Remove PBS and re-suspend cell pellets in 20–30 mL cold Perm-III buffer.\nNote: The Perm-III buffer promotes permeabilization of cell membranes for antibodies to enter cells during staining protocols.\nAlternatives: Other commercial or homemade permeabilization buffers could also be used.\nIncubate cells for 30 min on ice.\nNote: Alternatively, cells can be stored in the Perm-III buffer for up to 6 months at −20°C.\nNPC staining and FACS sorting\nTiming: 2 days",
    "We stained day 7 differentiated cells (both the uninfected control cells and cells infected with the library) with the NPC specific marker SOX1 and used FACS to sort cells based on the SOX1 signal. The uninfected cells served as a positive control and exhibited SOX1-positive staining (Figure 1[href=https://www.wicell.org#fig1]B).\nCentrifuge NPC cells in the Perm-III buffer for 10 min at 1,000 g.\nRemove the supernatant and resuspend cell pellets in 30 mL cold PBS containing1% BSA. Centrifuge at 1,000 g for 10 min to collect cell pellets. Repeat this twice.\nRe-suspend cell pellets in 7 mL PBS containing 1% BSA. Save 50 μL cell suspension as unstained control. Save 50 μL of cell suspension as secondary-antibody control.\nAdd 50 μL SOX1 antibody to cell suspension (∼1:150 dilution).\nIncubate at room temperature (∼26°C) with rotation for 1 h.\nWash cells twice with PBS containing 1% BSA.\nResuspend cell pellets in 7 mL PBS containing 1% BSA and add 15 μL 488-conjugated secondary antibody (∼1:500 dilution).\nTo 50 μL secondary-antibody control cells, add 450 μL PBS containing 1% BSA and 1 μL 488-conjugated secondary antibody.\nIncubate cells with the secondary antibody at room temperature (∼26°C) with rotation for 1 h.\nWash cells twice with PBS containing 1% BSA.\nFilter cell suspension with 70-μm cell strainers to remove any debris before running samples on a FACS sorter.\nCount filtered cells and set aside 3.6 × 107 cells as the unsorted control.\nNote: The unsorted control is essential for identifying screen hits during NGS analysis.\nSubject other cells to FACS sorting.",
    "Use the unstained control sample and the secondary-antibody control sample as SOX1-negative populations. Use the uninfected stem cells differentiated into day 7 NPCs as positive controls for SOX1 expression. The positive and negative controls were used to gate the NPC population in cells infected with the GeCKO library.\nHarvest the bottom 1% of NPCs with the lowest SOX1 signal.\nCollect cell pellets of the sorted SOX1-negative NPCs.\nFlash freeze pellets in liquid nitrogen and store them at −80°C.\nIsolate genomic DNA from sorted or unsorted NPCs\nTiming: 2 days\nThe next step is to extract the genomic DNA from sorted or unsorted NPCs.\nThaw cell pellets on ice. Resuspend in the STE lysis buffer (1 mL per 1 × 107 cells).\nAliquot 500 μL cell suspension into each microtube and incubate 12–16 h at 56°C in a thermal mixer.\nAfter incubation, cool down the cell lysate to room temperature. Add 4 μL (400 μg) RNase A and incubate for 1 h at 37°C in a thermal mixer.\nAdd 500 μL buffer-saturated phenol (pH 7.9) to each tube and mix by vortexing for 1 min.\nCentrifuge at 13,000 rpm for 5 min. Transfer the aqueous phase to new tubes (∼550 μL).\nAdd equal volume of phenol:chloroform:isoamyl alcohol and mix by vortexing.\nCentrifuge at 13,000 rpm for 5 min and transfer the aqueous phase to new tubes (∼550 μL).\nAdd equal volume of chloroform and mix by vortexing.\nCentrifuge at 13,000 rpm for 5 min. Transfer the aqueous phase (∼300 μL) to new tubes. Add 0.5 μL Glycoblue.\nNote: Glycoblue labels genomic DNA blue and helps visualize the genomic DNA pellet when the yield is very low. It is an optional step and can be skipped if the yield is high.",
    "Add 900 μL ethanol (the final centration is 75%) and mix by inverting.\nFreeze at −80°C for 1 h to 12 h.\nCentrifuge at 4°C for 10 min and discard the supernatant.\nWash once with 1 mL 75% ethanol.\nAir dry for 10–15 min at room temperature.\nAdd 50 μL AE buffer (10 mM Tris-Cl, 5 mM EDTA; pH 9.0) to each tube.\nIncubate at 37°C for 5 h up to 12 h to dissolve DNA.\nAlternatives: Genomic DNA can also be eluted with nuclease-free water.\nMeasure the DNA concentration with a Nanodrop spectrophotometer.\nStore DNA at −20°C.\nAmplify the sgRNA cassette from genomic DNA by PCR\nTiming: 1 week\nThe purpose of this step is to amplify the sgRNA-containing cassette and add NGS adaptors for high-throughput sequencing.\nPerform the first round PCR to amplify the sgRNA-containing cassette from genomic DNA of unsorted and sorted NPCs:\nSet up each PCR reaction as follows:\ntable:files/protocols_protocol_2000_8.csv\nCritical: It is important to use enough genomic DNA for PCR to maintain the coverage of the sgRNA library. For unsorted NPCs, the yield of gDNA from 3.6 × 107 cells is at least 200 μg. Set up 50 μL PCR reaction for every 2 μg gDNA. Hence, for 200 μg gDNA, 100 PCR reactions were set up. For the sorted NPCs, we divided all the gDNA samples into 3 PCR reactions.\nAlternatives: Other high fidelity DNA polymerases can also be used for PCR.\nPerform PCR using the following conditions:\ntable:files/protocols_protocol_2000_9.csv\nAfter the PCR reaction, pool all PCR products from the same genomic DNA sample. Mix thoroughly and either store at −20°C or use as template for the second round of PCR.\nPause point: The PCR product can be stored at −20°C if not performing the second round PCR immediately.",
    "Perform a second round of PCR to add NGS adaptors.\nSet up PCR reaction as follows:\ntable:files/protocols_protocol_2000_10.csv\nCritical: To maintain the coverage of sgRNA library, perform one PCR reaction for every 5,000 sgRNAs. For the unsorted NPCs, we performed 30 PCR reactions (24 reactions is enough). For the sorted NPCs, we performed 6 PCR reactions.\nNote: Each forward primer (F01 to F12) contains an 8-bp barcode as well as staggered sequences with different sequence and length. The barcodes are used to discriminate different samples when doing multiplex sequencing. The staggered sequence is used to introduce length diversity to the sequencing library. It is recommended to pool multiple forward primers with different barcodes and staggered sequences and use the primer mix for the PCR reaction.\nPerform PCR using the following conditions:\ntable:files/protocols_protocol_2000_11.csv\nCritical: The number of PCR cycles for each sample should be optimized to produce enough target DNA for sequencing while minimizing PCR amplification biases. Usually, 10–14 cycles will be sufficient.\nPool PCR products from the same DNA template. Run a 10 μL sample on 1% agarose gel to check the target DNA band.\nNote: After the second round of PCR, one specific DNA band around 300 bp should be observed.\nPause point: The PCR product can be stored at −20°C if it is not purified immediately.\nPCR product purification with AMPure XP beads.\nMix the AMPure beads thoroughly by inverting.\nCombine 100 μL PCR product with 180 μL AMPure beads in a PCR tube. Mix by pipetting gently.\nPlace the PCR tube on a magnetic rack and incubate for 2 min at room temperature.\nAspirate the supernatant carefully without disturbing the beads. Wash beads with 200 μL 70% ethanol and mix by pipetting gently. Place the tube on the magnetic rack for 2 min.",
    "Aspirate the supernatant carefully without disturbing the beads. Repeat 70% ethanol washing two more times. Place the tube on the magnetic rack for 2 min.\nAspirate the supernatant carefully without disturbing the beads. Air dry beads for 8 min. Add 40 μL nuclease-free water and incubate for 3 min at room temperature.\nPlace the tube on the magnetic rack, incubate for 2 min, and transfer the supernatant to a new 1.5 mL tube.\nStore the purified DNA at −20°C.\nHigh-throughput sequencing and data analysis\nTiming: 3–4 weeks\nThe purpose of this step is to use high throughput sequencing to analyze all sgRNAs that are integrated in the genome. By comparing the distribution of sgRNAs in the unsorted and sorted NPCs, we can determine whether a given sgRNA is enriched or depleted in the target cell population.\nCheck the size of DNA fragments with the Agilent Bioanalyzer High Sensitivity DNA Analysis Kit.\nMeasure DNA concentration both by the Qubit dsDNA HS assay kit (Thermo Fisher Scientific) and by qPCR using the KAPA Library Quantification Kit (Roche) for Illumina platforms.\nPool all samples and sequence on Illumina NextSeq 500 sequencer or other equivalent instrument with read configuration as 75-bp single-end sequencing. Sequence 20–30 million reads per sample.\nAnalyze the sequencing data with the MAGeCK algorithm (Li et al., 2014[href=https://www.wicell.org#bib2]).\nNote: The reference sgRNA library sequences for human GeCKO v2.0 (A and B) were downloaded from Addgene (https://www.addgene.org/pooled-library/[href=https://www.addgene.org/pooled-library/]). The clean sequence reads were mapped to the reference sgRNA library with mismatch option as 0 using MAGeCK. Read counts for each sgRNA were generated and median normalization was performed to adjust for library size. Positively and negatively selected sgRNAs and genes were identified with MAGeCK using the default parameters."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Crispr",
    "Cell Biology",
    "Neuroscience",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}