{
  "id": 3050,
  "origin_website": "Cell",
  "title": "Generating a mouse model for relapsed Sonic Hedgehog medulloblastoma",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Breeding\nTiming: 4 months (for step 1)\nGenerating Math1-Cre/Ptch1loxP/loxP/R26R-GFP (MPG) Mice.\nGeneration of MPG mice that will develop MB in their cerebella.\nCross Math1-Cre mice with Ptch1loxp/loxp mice to obtain Math1-Cre/Ptch1loxp/wt mice.\nCross Ptch1loxp/loxp mice with R26R-GFP mice to obtain Ptch1loxp/wt/R26R-GFP mice.\nCross Math1-Cre/Ptch1loxp/wt mice with Ptch1loxp/wt/R26R-GFP mice to obtain MPG mice.\nNote: R26R-GFP mice are not necessary for the generation of the relapse model. We use R26R-GFP mice to lineage-trace tumor cells in relapsed MB (Mao et al.7[href=https://www.wicell.org#bib4]).\nNote: Math1-Cre/Ptch1loxp/wt/R26R-GFP mice obtained from the above step c crossing can be backcrossed to Ptch1loxp/loxp mice to generate MPG mice. MPG mice can also be generated by intercrossing Math1-Cre/Ptch1loxp/wt/R26R-GFP mice.\nNote: All MPG mice develop MB in their cerebella. MPG mice may display cranial tumor signs including ataxia, hunched back and tilted head starting from 3–4 weeks of age.\nNote: To determine the optimal stage of tumor development for generating tumor relapse, MPG mice at 2 or 4 weeks of age are used for irradiation.\nPart 2: Irradiation\nTiming: 30 min (for step 2)\nTiming: dosage dependent; ∼ < 5 min/mouse (for step 3)\nTiming: 12 h–14 days (for step 4)\nNote: A license authorizing the use of sealed sources containing radioactive material may be required to operate the irradiator. Consult the institutional irradiation safety office for the regulations.\nPrepare Mice for Irradiation.\nMice must be properly anesthetized for the irradiation procedure to minimize pain and distress, as well as movement during the procedure to ensure accurate dosages of irradiation.\nPrepare 10 mL Ketamine/Xylazine Anesthetic Solution.\nPrepare 1 mL of Ketamine (100 mg/mL) at a final concentration of 10 mg/mL.\nPrepare 0.25 mL of Xylazine (20 mg/mL) at a final concentration of 0.5 mg/mL.",
    "Mix the above with 8.75 mL of saline solution to prepare a final 10 mL anesthetic solution.\n∗The above solutions are prepared under sterile conditions.\nAdminister Ketamine/Xylazine via intraperitoneal (IP) injection.\nMeasure body weight of mice using an animal weighing scale.\nInject mice with the Ketamine/Xylazine solution (10 μL/g body weight).\n∗ Appropriate depth of anesthetizing in mice should be confirmed by verifying a lack of pain response by pinching tails (no longer than 10 min after injection of Ketamine/Xylazine solution).\nCritical: Ketamine is a controlled substance, which should be used following the guidelines of institutional IBC.\nCritical: Mice should be euthanized if they display signs of ketamine overdosage (respiratory depression).\nPosition and shield mice for irradiation.\nPosition the mouse (4 weeks of age) lying prone in a leucite drawer (As shown in Figure 1[href=https://www.wicell.org#fig1]), and make sure that the cerebellum is centered inside of the circular irradiation area.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2593-Fig1.jpg\nFigure 1. Irradiation procedure\n(A and B) Schematic images showing the (A) irradiator and the (B) irradiator control panel.\n(C) An empty leucite drawer showing where to position the mouse skull in the irradiation area (in red).\n(D) An MPG mouse placed in the irradiated area (in red) and covered with lead shields both around the base of the skull and above the tumor area.\n(E) Schematic representation to show placement of lead shield on mouse, allowing for the irradiation exposure of the cerebellar area.\nExpose the cerebellum, but shield the rest of the brain with the lead cover.\nNote: The cerebellum is located between the two lines (Line 1 and Line 2 in Figure 1[href=https://www.wicell.org#fig1]E). Line 1 is between the two eyes, and line 2 is aligned with the base of the skull.\nPerform Irradiation Procedure.",
    "Following approval, irradiation procedure is conducted to reduce tumor burden allowing subsequent tumor relapse.\nObtain instruction and approval from the Institutional Radiation Safety Committee before using the irradiator machine.\nPrepare the irradiator machine as necessary to begin procedures for irradiation of mice (i.e., air tank and pressure valves).\nNote: Be sure there is an air pump to ventilate the drawer for live animals, if necessary.\nRemove lid and place the mouse into the Leucite drawer.\nCenter the base of the skull inside of the circular irradiation area.\nShield the mouse brain using the lead cover, exposing the cerebellum region.\nCover the drawer with mouse inside by replacing the leucite lid.\nSet the irradiation time(s) and begin procedure.\nRemove mouse from the drawer, repeat for additional mice (steps 3–5).\nNote: To maintain a sterile condition, the leucite drawer can be wiped with a biocide solution in between each mouse irradiation.\nSecure irradiator after use.\nNote: If any problems or questions, contact the radiation safety office and read all operating procedures. Do not attempt any adjustment or repairs without authorization.\nCritical: Make sure the mouse does not move at all in the drawer during the irradiation procedure. Any movement could potentially alter the irradiation dosage that the mouse cerebellum has actually received.\nPost-Irradiation Care.\nMice must receive the proper post-irradiation care for their optimal survival throughout the experiment.\nPost irradiation, place mice on top of warm isothermal pad until they regain upright posture and walk normally.\nReturn all of the irradiated mice to a sterilized cage, with adequate food and water.\nRoutinely monitor mice twice daily or more often if poor health is observed (fatigue, ataxia, dehydration or anorexia).\nPart 3: Tumor relapse\nTiming: 20 min (for step 5)\nTiming: 30 min (for step 6)\nTiming: 24–32 h (for step 7)",
    "Timing: ∼24 h (for step 8)\nDetection of relapsed tumor by MRI.\nTumor relapse and tumor volume in MPG mice after the irradiation are measured via MRI.\nAnesthetize the mouse by Ketamine/ Xylazine as described in step 2a.\nVisualize the tumor bearing brain by MRI using a GE MRI scanner (repetition, 3,450 ms; echo time, 159 ms; 12 slices at 0.8 mm per slice).\nAnalyze the obtained MRI images using a T2-fast spin echo sequence.\nTumor Tissue Collection and Processing.\nDissect the mouse brain and minimize disruption of brain tissues during collection.\nEuthanize mice according to the guidelines of the Institutional Animal Care and Use Committee (IACUC). MPG mouse can be euthanized by CO2 or by cervical dislocation following the routine procedure approved by the IACUC at Fox Chase Cancer Center.\nDecapitate the mouse head with a cut posterior from the ears using surgical scissors. Using the scissors, make a midline incision in the skin. Flip the skin over the eyes.\nHold the mouse head with forceps, access the brain by inserting microdissection scissors horizontally into the foramen magnum and cutting straight between the eyes.\nUsing forceps peel away the skull to expose the forebrain and cerebellum. Cut and remove the brain stem (anterior to the cerebellum) and forebrain as much as possible.\nCarefully rinse the cerebellum (containing MB tumor) with PBS.\nPrepare Tumor Tissues for Immunohistochemistry.\nBrain and tumor tissues are processed for further immunohistochemistry analysis.\nCarefully place the cerebellum in a 15 mL tube filled with 4% PFA for fixation, and incubate overnight (∼12 h) at 4°C.\nRemove the cerebellum from 4% PFA solution and transfer to a new 15 mL tube filled with 30% sucrose for dehydration. Incubate at 4°C for 24 h or until the cerebellum sinks to the bottom of the tube.",
    "Embed the cerebellum in optimal cutting temperature compound (OCT compound), and freeze the block at −80°C overnight (∼12 h).\nPlace the block in a −20°C cryostat for at least 1 h to equilibrate the tissue before proceeding to cryosectioning.\nCut 8–12 μm thick frozen sections of the tumor-bearing cerebellum using a cryostat, and mount sections on microscope slides.\nImmunofluorescent Staining.\nBrain tissues are harvested for immunofluorescence and microscopy analysis to detect changes in tumor cell proliferation, apoptosis, and astrocytic trans-differentiation patterns in relapsed tumor.\nRinse the tumor slides with PBST.\nCarefully pipet 100 μL of 10% Normal Goat Serum (NGS) to cover entire section. Incubate for blocking at room temperature (20°C–25°C) for 20–30 min.\nDilute the primary antibody(s) with 10% NGS, and pipet 50–100 μL of diluted primary antibody to cover the entire tissue section.\nIncubate the slides with the primary antibody (Anti-S100 β- 1:400, Anti-Cleaved-Caspase 3- 1:400, Anti-Ki67- 1:250) overnight (∼12 h) at 4°C, in the dark.\nRemove the primary antibody and wash the slides 3× with PBST.\nPrepare secondary antibody(s); dilute 1:500 in 10% NGS.\nIncubate the slides with secondary antibody for 2 h at room temperature (20°C–25°C), in the dark.\nRemove the secondary antibody and wash the slides 3× with PBS.\nCounterstain tumor tissue with DAPI to label cell nuclei.\nMount coverslip on tumor slides using mounting medium.\nImage slides on a fluorescent microscope to analyze staining results."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Isolation",
    "Cancer",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}