{
  "id": 10768,
  "origin_website": "Jove",
  "title": "Rapid Scan Electron Paramagnetic Resonance Opens New Avenues for Imaging Physiologically Important Parameters In Vivo",
  "procedures": [
    "1. Setup of the Rapid Scan Coil Driver at 250 MHz\nCalculation of Rapid Scan Experimental Conditions\n\tNote: The most important parameter in RS-EPR is scan rate, α, which is the product of scan frequency and scan width (Equation 3). For narrow scan widths, faster scan rates are used, and for wider sweep widths, slower scan rates are used. The following instructions step through the latter case and show how to arrive at the experimental coil driver parameters of 7 mT sweep width and 6.8 kHz scan frequency.\n\t\nDetermine the resonator bandwidth (BWRes).\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq1.jpg (1)\n\t\twhere vres is the operating frequency of the resonator and Q is the quality factor. Q = 90, is common for the rapid scan resonator used to obtain the data in Representative Results.\nDetermine the rapid scan rate, α, allowed by the resonator bandwidth imgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq2.jpg (2)\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq3.jpg\n\t\twhere N is a constant often conservatively selected to be 5-6, ΔBpp is the peak-to-peak derivative linewidth in mT, and a is the scan rate if T/s for a Lorentzian linewidth.\n\t\tNote: A common value for the radicals in the representative section is imgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq4.jpg = 0.1 mT. In comparison with earlier rapid scan literature; Equation 2 is derived by setting the signal bandwidth (BWsig) equal to BWRes.\nDetermine the maximum rapid scan frequency allowed by the rate.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq5.jpg (3)\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq6.jpg\n\t\twhere w is the width of the scan and f is the scan frequency. A sweep width of 7 mT will cover 100% of the spectrum for current probes used in vivo. Use this value and the rate calculated in (Equation 2) to determine the scan frequency.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq7.jpg\nSelection of tuning capacitors and tuning of rapid scan coil driver",
    "Note: The rapid scan coil driver is typically run in a resonated mode generating a sinusoidal wave. Resonance occurs at a scan frequency where the inductive and capacitive reactances are of equal magnitude and opposite signs, so that total reactance is close to zero.\n\t\nDetermine the proper capacitance for the frequency determined in 1.1.3 using the inductance, L, of the rapid scan coils and (Equation 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq8.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq9.jpg\nDivide CTOT from (Equation 4) in half to get the capacitor values for each side of the coil driver capacitor box.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq10.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/54068/54068eq11.jpg\n\t\tNote: The rapid scan coil driver has two amplifiers. When selecting a capacitor, the capacitor box needs to be balanced with an equal capacitance on each side of the box. The two sides are in series.\nUnscrew the top cover of capacitor box and insert capacitors on both sides that are equal to the value determined in step 1.2.2.\nReplace the top of the capacitor box and screw it down to ensure it stays on.\nUsing the front panel of the resonated coil driver, adjust the output frequency until the sinusoidal waveform has the maximum amplitude.\n2. Preparation of Reagents and Phantoms\nPreparation of radicals\nRemove 15N-PDT from the freezer and allow the container to come to room temperature (10-15 min).\nWeigh out 1.4 mg of 15N-PDT using an analytical balance.\nAdd 1.4 mg of 15N-PDT to 15 ml de-ionized (DI) H2O for a final concentration of 0.5 mM.",
    "Note: 4-oxo-2,2,6,6-tetra(2H3)methyl-1-(3,3,5,5-2H4,1-15N)piperdinyloxyl (15N-PDT), 4-1H-3-carbamoyl-2,2,5,5-tetra(2H3)methyl-3-pyrrolinyloxyl (15N-mHCTPO) and 3-carboxy-2,2,5,5-tetra(2H3)methyl-1-(3,4,4-2H3,1-15N)pyrrolidinyloxy (15N-Proxyl)25 (Figure 1E-G) radicals have long term stability (2 years) in aqueous solution and at room temperature. Their solid forms are usually stored in a freezer or refrigerator to keep these radicals stable for years. The stability of nitroxide radicals generally make them non-toxic, and their preparation can be done on a normal benchtop when the solvent is water. When using organic solvents, prepare nitroxide solutions inside a fume hood while outfitted with the proper personal protective equipment (PPE).\nPreparation of pH sensitive trityl radicals\nWeigh out 0.7 mg of triaryl methyl radical (aTAM4)26 radical (1,400 g/mol) and dissolve in 200 µl of absolute ethanol.\nWeigh 0.00681 g of KH2PO4 (136.1 g/mol) and dissolve in 50 ml DI water for a final concentration of 1 mM.\nWeigh 2.8 g of KOH (56 g/mol) and dissolve in 50 ml of DI water for a final concentration of 1 M.\nAdd KOH drop wise to the phosphate buffer (2.2.2) to adjust the pH of 7.0.\nAdd 800 µl of 1 mM phosphate buffer and the 200 µl of aTAM4 in absolute ethanol for a final concentration of 0.5 mM in 80:20 buffer:ethanol.\nRepeat steps 2.2.1-2.2.5 to create the aTAM4 sample at pH = 7.2.\nPlace the aTAM4, pH=7.0 and aTAM4, pH=7.2 into separate 6 mm quartz sample tubes.\nPlace both 6 mm quartz EPR tubes into a 16 mm quartz EPR tube, with a 2 mm thick Styrofoam spacer in between.",
    "Note: The walls of the quartz sample tube are 0.5 mm thick, and in addition to the 2 mm spacer yield a 3 mm separation between the aTAM samples. The pH sensitive trityl radicals used were synthesized at the Ohio State University26. The example that was used for imaging is called aTAM4. The reaction which accounts for the pH sensitivity is shown in Figure 1A.\nGeneration of BMPO-OH\nWeigh out 680 mg of KH2PO4 and dissolve in 100 ml DI water for a final concentration of 50 mM.\nAdd 1 M KOH drop wise to the phosphate buffer to pH=7.3.\nWeigh out 50 mg of BMPO (199.25 g/mol).\nCombine the 50 mg of BMPO with 5 ml of phosphate buffer in a 16 mm quartz irradiation tube.\nAdd 100 µl of 300 mM hydrogen peroxide.\nIrradiate the mixture in the 16 mm quartz irradiation tube with a medium pressure 450 W UV lamp for 5 min.\nUsing a glass transfer pipet, transfer 2.5 ml of irradiated BMPO-OH solution out of the quartz irradiation tube and into one side of a 16 mm quartz sample tube with 3 mm divider.\nTransfer the remaining 2.5 ml of irradiated BMPO-OH into the other side of the 16 mm quartz sample tube with 3 mm divider.\nPreparation of dinitroxide radical\nWeigh out 24.7 mg of 2H,15N-disulfide dinitroxide (Figure 1C) in 1 ml DMSO for a stock solution of 47.5 mM.\nPrepare 10 mM Tris buffer and adjust to pH 7.2.\nTake 40 µl dinitroxide stock solution and dilute with Tris buffer to a final concentration of 1 mM.\nPlace 250 µl of dinitroxide solution in buffer in a 16 mm quartz sample tube with a 10 mm divider in the center.",
    "Weigh out 154 mg of glutathione and add to 5 ml of Tris buffer for a final concentration of 100 mM.\nAdd 5 µl of the 100 mM glutathione solution to 250 µl of 1 mM dinitroxide solution on one side of the 10 mm divider to convert the diradical into monoradical.\nPreparation of nitronyl nitroxide\nRemove the radical from the freezer and allow the container to come to room temperature (10-15 min).\nWeigh out 1.9 mg of nitronyl (390 g/mol).\nWeigh out 0.56 mg of KOH and dissolve in 10 ml DI water for a final concentration of 1 mM.\nMix the 1.9 mg of nitronyl into 10 ml of 1 mM KOH solution for a final concentration of 0.5 mM nitronyl.\n\t\tNote: If necessary, use a vortexer or sonicator to speed solvation of the nitronyl.\n3. Setup of the Rapid Scan Instrument at 250 MHz\nNote: Tuning of the resonator with an aqueous sample of nitroxide radical, which has a similar effect on resonator Q and tuning as buffer solution, is a good way to set up for the sample to be imaged\nTune the resonator with an aqueous sample of nitroxide radical.\nInsert the 15 ml of 0.5 mM 15N-PDT in water sample into a 16 mm quartz EPR tube.\nInsert the quartz tube into the detection side of the cross-loop RS-EPR resonator.\nChange the frequency of the instrument source until it matches the frequency of the detection side that contains the sample. Manually change the carrier frequency of the 250 MHz source by entering the desired value in software.",
    "Change the frequency of the excitation side to match the frequencies of the experiment source and detection side of the resonator. Change the frequency of the excitation side by turning a variable capacitor within the resonator cavity according to manufacturer's protocol.\nSet up Instrument Console and Main Magnet\nTurn on the spectrometer and choose an experiment which records transient data with time on the abscissa.\nWithin the software, set the number of points to 65,536 and the time base to 10 nsec.\nSet the number of averages to 10,000 for a strong or narrow signal, and to 45,000 for a broad or weak signal.\nPress the \"engage\" button in the software to send the experimental parameters from the software to the console and energize the main field magnet.\nSet the main magnetic field to 9 mT.\nSet the power attenuation knob to 50 dB, and turn on the 7 W high power amplifier.\n4. Execution of Rapid Scan Experiment\nNote: Specific instructions related to analysis of phantoms containing BMPO-OH24, pH sensitive TAM radicals19,27 and redox sensitive dinitroxides28 are provided in the literature.\nPower saturation of standard nitroxide sample\n\tNote: It is advantageous to do a power saturation curve on a standard nitroxide radical sample under the same experimental conditions which will be used to look at radicals sensitive to pH or redox status.\n\t\nTurn on the rapid scan coil driver, with the values from Section 1 (scan frequency of 6.8 kHz and scan width of 7 mT).\nStarting at 50 dB, collect a rapid scan spectrum with 100k averages. Decrease the attenuation by 3 dB and repeat the measurement. Continue until an attenuator setting of 0 dB, or for as long as the isolation measurement on the bridge readout is < 0.",
    "Transfer the raw rapid scan data into a deconvolution program (for example written in Matlab) and process the raw data into the absorption spectrum.\nEnter the scan frequency, sweep width, number of points and timebase into the program, and run the program to process the raw rapid scan signal into an absorption signal.\nPlot the amplitude of the absorption signal as a function of the square root power (in Watt) incident on the resonator. In the non-saturating regime, the amplitude is linearly dependent on the square root of the incident power.\nFit a trend line starting at 0,0 and include all data points which fall into the linear response region. In the linear response region, signal amplitude increases proportional to the square root of microwave power.\nExtrapolate this trend to higher powers, and compare the EPR signal intensity. Use the highest power for which the signal amplitude does not deviate more than 3% from the extrapolated trend line. In order for the deconvolution of the rapid scan signal to work properly, the signal must still be in the linear response region with respect to incident power.\n\t\tNote: Transfer of the raw rapid scan data can be done over a network connection or via thumb drive. In this case the transfer is necessary because the program to process raw data (Matlab) is not on the same computer which has data collection software. The deconvolution algorithm which processes raw data is described in 29.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}