{
  "id": 19218,
  "origin_website": "Jove",
  "title": "Microvascular Decompression: Salient Surgical Principles and Technical Nuances",
  "procedures": [
    "1. Positioning\nPositioning is an integral component of microvascular decompression. Following induction of anesthesia, the patient is placed in pins while on the operating room table and moved to the lateral park bench position with side of the desired MVD placed up. Of note, JSN prefers to insert a lumbar drain prior to the procedure to allow greater control of intra-op drainage of CSF and cerebellar relaxation (the drain is then removed when the patient is discharged, often on POD2).\nAll pressure points are padded and an axillary roll is placed. The patient's chest and hips are taped securely to the table to allow rotation of the table, if necessary, later in the case. The patient's shoulder is taped down for purposes of visualization. The head is rotated approximately 10-15 degrees away from the affected side and the neck is flexed slightly so that the planned surgical trajectory is now almost orthogonal to the floor. The vertex is tilted slightly down. Special attention is made to ensure that there no pathologic compression of venous drainage from the head. Specifically, there should be room for at least two finger breadths between the mandible and upper thorax. Head rotation should not exceed 30 degrees.\nc. The body is secured prior to three-point head fixation. Electrophysiologic monitoring (brainstem auditory evoked response and facial nerve monitoring) is then secured. Stealth navigation, if used, is registered.\n2. Incision",
    "Prior to prepping and draping, external landmarks are assessed. It is helpful to draw the inion-meatal line with an indelible marker. The iniomeatal line is drawn out first with an indelible marker. This dotted line represents the superficial representation of the location of the transverse sinus. Next, a dotted line is drawn overlying the course of the digastric groove. The portion of this line inferior to the iniomeatal line represents a superficial representation of the location of the sigmoid sinus.\nA curvilinear incision is drawn out approximately two fingerbreadths behind the pinna for the length of the ear. The patient is prepped and draped in the usual fashion.\nUsing a scalpel, the aforementioned incision is deepened. Dissection is carried down to the bone using a scalpel and monopolar cautery. Self-retaining retractors are placed.\n3. Craniotomy and dural opening\nWith the superficial representation of the junction of the transverse and sigmoid sinuses in mind, drilling is initiated.\nPEK prefers to drill the bone away to expose the transverse-sigmoid junction. A 3-cm craniectomy defect is usually created for access to the CP angle. This method avoids the possible risk posed by use of a drill with a footplate adjacent to the venous sinuses, potentially resulting in a dural sinus laceration.\nJSN prefers to use a perforator drill for burr hole placement at the level of the transverse-sigmoid junction. Following this, a 3-cm craniotomy bone flap is created and set aside for replacement at the end of the case. The drill is then used to expose the remainder of the transverse and sigmoid sinuses. This method allows for replacement of the bone flap following the microvascular decompression.",
    "Once the transverse and sigmoid sinuses have been exposed extradurally, the bone edges are waxed thoroughly. It is important to drill far enough laterally to allow proper dural reflection and visualization. When the mastoid air cells are encountered, they are vigorously waxed.\nThe dura is opened in a stellate fashion. The dural leaves are tacked up using 4-0 Nurolon and the dural incision is taken as close to the transverse-sigmoid junction as possible. This allows visualization of a corridor directly adjacent to the junction of the tentorium and petrous temporal bone.\n4. Exposure of the cerebellopontine angle\nAfter the dura has been reflected and sutured, a Leyla retractor is placed with telfa underlying the retractor. The cerebellum is elevated and gently retracted medially. Using suction and bipolar electrocautery, CSF is allowed to egress-resulting in gentle relaxation of the cerebellum.\nWith the cerebellum now having fallen away from the petro-tentorial junction, the retractor is advanced with further gentle elevation of the cerebellum. The superior petrosal vein complex is taken when necessary. When the petrosal vein is sacrificed, coagulation with bipolar cautery is followed by partially division with microscissors. The vessel is then further coagulated and then fully transected to ensure there is no hemorrhage following vessel ligation.\nAs \"the corner is turned\" and the cerebellopontine angle is exposed, the VII-VIII nerve complex is visualized first. During this exposure, vigilant attention is given to BAER (brainstem auditory evoked response) and facial nerve monitoring to guard against retraction injury. Superior and medial to the VII-VIII nerve complex, the trigeminal nerve is then visualized.\n5. Decompression of the trigeminal nerve",
    "Microscissors are used to open the arachnoid around the trigeminal nerve. Sharp dissection is necessary so that the nerve and superior cerebellar artery (SCA) can be inspected circumferentially. Inspection of the trigeminal nerve begins at the site of brainstem exit and proceeds laterally.\nThe most common vessel found in trigeminal neuralgia is a rostroventral loop of the SCA1. This vessel was the causal agent of compression in 53% of patients in this series.\nAfter the causative vessel is identified, dissected, and freed, the vessel loop is mobilized away from the nerve. A small piece of Teflon is then placed underneath the vessel-elevating it off the trigeminal nerve.\nFollowing decompression, the nerve is reexamined on all sides to be certain that no additional compressing vessels are present.\n6. Closure\nThe wound is irrigated with saline and all retractors are removed. The dura is then closed using a running 4-0 Nurolon.\nThe remaining steps of closure differ slightly between attending. For JSN, the patch of the pericranium taken at the beginning of the case can be used to assist with water-tight closure of the dura. Multiple tacking holes are placed in the bone and 4-0 Nurolons are passed from the edge of the dura through the tacking holes and secured. Surgicel and Gelfoam are placed on top of the dura, and the bone flap is replaced with KLS screws and plates. Norian bone cement is then used to close off the remainder of the cranial opening in order to prevent later insertion of the muscle onto the dura. The wound is then copiously irrigated with Bacitracin irrigation and closed in layers with 2-0 Vicryls in multiple layers in the muscle, 3-0 Vicryls in the galea and dermis, and a running 4-0 Monocryl in the skin.",
    "PEK prefers a slightly different method of closure. Following reapproximation of the dura, a piece of Gelfoam is placed overlying the dural incision. Methyl methacrylate is used to fill in the cranial defect and a small KLS plate used to secure the methylmethacrylate prosthetic to the skull. The skin and muscle is then closed as described above and covered with bacitracin ointment.\n7. Representative Results\nUsing a review of CPT codes obtained from the VUMC Billing Department, the medical records of 59 patients who underwent microvascular decompression by one of two functional neurosurgeons (JSN or PEK) at Vanderbilt University Medical Center (VUMC) from the period of time from July 2006 to July 2009 were assessed in a retrospective fashion. Study data were collected and managed using REDCap electronic data capture tools2 (REDCap is a secure, web-based application based at Vanderbilt University designed to support data capture for research studies). A summary of the demographics of this patient population is visible in Table 1.\nRegarding patient demographics (see Table 1), approximately 66% of patients were female. 10% had a history of multiple sclerosis and 19% had a history of previous surgical procedures for TGN (Table 2). Regarding operative results (see Table 3), 93% of patients experienced significant improvement or full resolution of the facial pain at follow-up ranging from 6 weeks to 2 years. Our method of follow-up consisted of a retrospective review of the electronic medical record. 64% of patients reported themselves as pain-free at their most recent clinic visit following the procedure.",
    "Approximately 15% of patients in the series suffered a CSF leak; 6 (10%) of these patients required ventriculoperitoneal shunt insertion (VPSI). Of note, the rate of CSF leak was appreciably higher in the patient population prior to the routine use of bone flap or methylmethacrylate (MM) buttressing of closure. Specifically, 25% of patients who were closed without a bone flap or methylmethacrylate prosthetic flap developed a CSF leak. In contrast, only 8% of patients closed after bone or MM flap placement had evidence of post-operative CSF leakage. In addition to the results described above, Two (3%) of patients suffered a wound infection. There were no instances of cerebellar damage. Two (3%) of patients reported some degree of post-operative hearing loss.\ntable:\n﻿0,1\nPatient Demographics,Patient Demographics\nGender (Male/Female),20/39\nHistory of Multiple Sclerosis (Yes/No),6/53\nHistory of previous surgical procedures for TGN (Yes/No),11/48\nTable 1. Summary of patient demographics.\ntable:\n﻿0,1,2\nPrevious Procedures (11/59),Previous Procedures (11/59),Previous Procedures (11/59)\nType,Number,Results: Pain free (PF) vs. Significantly improved (SI) vs. No improvement (NI)\nGamma knife,5 (8%),\"3 PF, 2 SI\"\nMVD,2 (3%),2 PF\nRFL,1 (2%),PF\nMultiple procedures,2 (3%),\"PF, SI\"\nTable 2. Surgical outcomes of patients who underwent previous procedures prior to undergoing microvascular decompression (MVD) in the current series. Patients are stratified by the specific prior procedure. RFL = radiofrequency lesioning.\ntable:\n﻿0,1\nSurgical Outcome and Complications,Surgical Outcome and Complications\nAverage length of follow-up,4 months\nPain significantly improved or resolved entirely,55 (93%)\nCSF leak,9 (15%)\nAseptic meningitis,8 (14%)\nWound infection,2 (3%)\nCerebellar damage,0 (0%)\nHearing loss,2 (3%)\nTable 3. Summary of surgical outcome and complications.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2590/2590fig1.jpg",
    "Figure 1. Operative results: rate of post-operative CSF leakage found to be heavily influenced by whether or not closure was buttressed with bone flap replacement or placement of methylmethacrylate (MM) flap. As a result, bone/MM flap replacement of craniectomy defect is now standard protocol for closure of these procedures.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2590/2590fig2.jpg\nFigure 2. Stratification of results describing post-operative improvement in pain."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}