{
  "id": 5448,
  "origin_website": "Bio",
  "title": "Nitroxide Labeling of Proteins and the Determination of Paramagnetic  Relaxation Derived Distance Restraints for NMR Studies",
  "procedures": [
    "Figure 1A shows a flow chart of the steps that need to be performed in order to label a protein with MTSL and how PRE-NMR distance restraints can be measured. In the procedure, the MTSL probe is attached via a disulfide bond to a protein containing a single cysteine residue. NMR spectra are then acquired and interpreted to extract distance restraints. In order to interpret the NMR spectra, the backbone chemical shifts of the protein must first be obtained.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170327/20170327015121_1762.jpgFigure 1. A flow chart of nitroxide labeling and representative PRE data. A. A flow chart describing the steps taken when site-specifically labeling proteins with nitroxide spin labels for PRE-derived structural studies. B. Representative [1H-15N]-HSQC spectrum of IsdHN2N3 (see Sjodt et al., 2016 for more information). Boxed regions indicate the representative sections of each PRE probe’s spectra shown in (C) (K499R1 and E559R1). C. Magnified regions showing the selective distance dependent line-broadening for the K499R1 (top) and E559R1 (bottom) probes. For each probe the diamagnetic and paramagnetic spectra are shown on the left and right panels, respectively. D. Representative PRE profile of the E559R1 probe data. Normalized intensity ratios (Iox/Ired) are shown as a function of residue number. The asterisk depicts the location of the probe. Errors of the ratio measurements are approximately 10-15% based on signal to noise of the NMR spectra, which can lead to values in excess of 1. Errors also can occur as a result of manipulating the sample (adding ascorbate to reduce the probe) and instrument instability. These errors are partially accounted for by adding ± 5 Å to the distance restraints that are obtained from the ratio data (Battiste and Wagner, 2000).",
    "Assign the backbone chemical shifts of the native proteinAcquire a high quality 2D [1H-15N]-HSQC spectrum of the native protein to be used as a reference (i.e., a spectrum containing the appropriate number of resolved cross-peaks based on the amino acid sequence of the protein).Assign the backbone amide chemical shifts in the native protein using standard NMR procedures (for standard NMR experiments see Cavanagh et al., 1995).Generate a protein mutant with a single cysteine residueFor these studies, the protein should contain a single cysteine residue. Check the protein’s primary sequence to determine if it contains native cysteine residues that could be inadvertently labeled by the nitroxide probe. If necessary, make conservative mutations to these cysteine residues to prevent non-specific labeling. If biochemical assays are available for the protein, they should be performed to ensure these mutations do not impair its function. Choose the desired location in the protein to which the nitroxide probe will be attached. This location needs to be at a residue whose sidechain is solvent-exposed. The residue should be located in a structured loop or within defined secondary structure. This is important because if the probe is located in a structurally disordered region of the protein, the increased flexibility of the polypeptide backbone can reduce the quantitative strength of the technique.Perform site-directed mutagenesis to incorporate a single cysteine residue at the desired location to which the nitroxide probe will be attached.Purify 15N-labeled protein containing the cysteine mutation. Use buffers that are supplemented with 2.5 mM DTT to prevent formation of inter-molecular disulfide bonds that can lead to protein aggregation (see Note 1). For a review on expression and purification of proteins see Gräslund et al. (2008).Prior to labeling the purified cysteine mutant with MTSL, verify that the cysteine mutation does not affect the structure of the protein.",
    "This can be accomplished by comparing the [1H-15N]-HSQC spectra of the mutant and native proteins. The chemical shift position of the cross-peaks in the spectra should be similar, with only localized changes occurring near the site of the mutation.Site-specific labeling the proteinThe aim of the following steps is to label the 1H-15N labeled purified cysteine mutant of the protein with MTSL. Care is taken to maintain the cysteine mutant under reducing conditions until it is modified with MTSL. The apparatus used to label the protein is shown in Figure 2, and consists of a conical tube and desalting column.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170327/20170327015545_5257.jpgFigure 2. Schematic of the apparatus used to label proteins with MTSLBuffer exchange the 15N-labeled cysteine mutant into labeling buffer that has been supplemented with fresh 2.5 mM DTT. The protein concentration should be at least 250-300 µM.Make a stock solution of MTSL by adding acetonitrile directly to the amber vial in which the MTSL was shipped. The final concentration of the stock solution should be 200 mM MTSL. Store the MTSL stock solution at -20 °C (see Notes 2 and 3).Immediately before starting the labeling reaction, dilute the protein with labeling buffer to a final concentration of 250-300 µM protein. The final volume of the diluted protein solution should be 1 ml. The protein should be diluted with labeling buffer that does not contain DTT. From this step forward, all buffers used in this procedure should not contain DTT.Equilibrate a Zeba spin desalting column with labeling buffer as per the manufacturer’s instructions.Construct the MTSL solution that will be used to label the protein. Pipette 2.5 ml of labeling buffer into a clean 15 ml conical tube. Add MTSL from the stock solution to the conical tube.",
    "The amount added should be sufficient to achieve a final concentration of MTSL that is 10x the molar amount of protein that will be labeled (e.g., if the final concentration of protein in the reaction will be 300 µM then the concentration of MTSL should be 3 mM). Make sure to shield all MTSL solutions from light by covering the tube with foil first.Construct the apparatus that will be used to label the protein (Figure 2). Place the equilibrated desalting column into the conical tube from step C5. The column will rest above the MTSL-containing solution and will leave room for the protein solution to flow through. Slowly pipette the protein onto the center of the column’s resin bed (Figure 2).Centrifuge as per the manufacturer’s instructions. The protein will flow through the column and into the labeling solution, while DTT present in the protein solution will remain on the column. The process is considered complete after the elution of all the protein solution into the MTSL solution at the bottom of the collection tube. This will produce a solution located at the bottom of the conical tube that has a total volume of ~3.5 ml. Discard the desalting column.Cover the conical tube containing the modification reaction with foil and let it incubate under agitation for 15 min at room temperature.After 15 min, add additional MTSL from the stock solution to the modification reaction. The amount of added MTSL should yield a final concentration that is 20x greater than the protein’s concentration in the conical tube.Place tube back onto a rotating device and let the protein:MTSL mixture incubate under agitation overnight at room temperature (~16 h).Buffer exchange the MTSL-labeled protein sample into the desired NMR buffer using a fresh Amicon Ultra-15 centrifugal filter.",
    "This will remove any excess (unligated) MTSL (see Notes 4-6). As mentioned above, the NMR buffer should not contain any DTT.Verify that the protein is labeled with MTSL by MALDI-TOF mass spectrometry. As compared to the unligated protein, the mass of the modified protein should increase by ~186 Da (the weight of the attached probe). Although MALDI-TOF is not quantitative, in the mass spectrum > 90% of the protein should be labeled with MTSL. If biochemical assays are available for the protein, they should be performed on labeled protein to verify that MTSL attachment does not impair its function. For NMR studies, the MTSL modified protein should have a final concentration of ~300 µM (see Note 7). The NMR buffer should contain 8-10% D2O, but be devoid of any DTT. Place the sample in a standard NMR tube and shield from light using foil.NMR data acquisitionUse a standard 2D- [1H-15N]-HSQC pulse sequence to acquire a spectrum of the freshly MTSL-labeled protein. Typically, the 1H and 15N dimensions are defined by 2,048 and 256 complex points, respectively. At this time, the sample is in its paramagnetic state. Its spectrum should be well dispersed, indicating that the modified protein is folded and not aggregating. Make a stock solution of 250 mM sodium ascorbate by dissolving it in NMR buffer.After the [1H-15N]-HSQC spectrum has been acquired of the paramagnetic protein (step D1), remove the NMR tube from the magnet. Using a long pipette that fits into the NMR tube, add sodium ascorbate to a final concentration that is 5x greater than the concentration of the labeled protein. This step should be performed carefully, by pipetting the solution up and down slowly so as to mix the solution, while preventing any sample loss.",
    "Addition of sodium ascorbate will reduce MTSL’s unpaired electron to form the diamagnetic state. Let the sample reduce for a minimum of 3 h at room temperature (no agitation is needed).Acquire a [1H-15N]-HSQC spectrum of the reduced diamagnetic MTSL:protein sample using acquisition parameters that are identical to those used to acquire the paramagnetic spectrum described in step D1."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}