{
  "id": 10727,
  "origin_website": "Jove",
  "title": "A Middle Cerebral Artery Occlusion Technique for Inducing Post-stroke Depression in Rats",
  "procedures": [
    "The Animal Care Committee of the Ben-Gurion University of the Negev, Israel approved all treatment and testing procedures used in this protocol.\n1. Preparation of Rats for the Experimental Procedure\nNOTE: Select adult male Sprague-Dawley rats weighing 300-350 g.\nHouse the rats, four per cage, in a vivarium at 22 °C and 40% humidity, with a reversed 12 h light/dark cycle (lights off at 8:00 a.m.) and unlimited access to food and water.\nRandomly assign the rats to two groups, namely an MCAO group (N = 24) and a Sham group (N = 19).\n2. Preparation of Rats for Surgery\nTo prepare the rats for the modified MCAO procedure, anesthetize each rat for 30 min with a mixture of isoflurane (4% for induction, 2% for surgery, and 1.3% for maintenance) in 24% oxygen (2 L/min) in an induction chamber and allow it to breathe spontaneously29,30.\nNOTE: Stimulate pedal withdrawal reflex by pinching the skin between the toes and/or toe pads using blunt forceps. Consider the depth of anesthesia adequate when the reflex disappears.\nMaintain the core body temperature at 37 °C with a heating plate.\nMeasure the body temperature of all rats through a probe placed in the rat’s rectum before beginning the surgical procedure.\nKeep the body temperature constant (37 °C) for all rats to minimize any hypothermic effect on the neurological outcome and any neurological injury.\nApply artificial tears ointment to both of each animal’s eyes while they lie on the prep table.\nShave the neck of each rat and disinfect the skin with 70% alcohol chlorhexidine (70% alcohol and 0.5% chlorhexidine gluconate). Repeat the disinfection step two more times. \nCover the rats with sterilized surgical drapes.\n3. Surgery (the MCAO Technique)",
    "NOTE: Perform surgery as described by Boyko et al.28 and use the instruments provided by McGarry et al.29 and Uluç et al.30.\nPerform a ventral midline incision and dissect the superficial fascia.\nCarefully perform a sharp and blunt dissection within the three triangle-shaped muscle (the sternohyoid, the digastric, and the sternomastoid muscle) to identify the carotid arteries (the ECA, the ICA, and the common carotid artery [CCA]).\nCarefully dissect and expose the right CCA and the ICA.\nSeparate the right CCA and ICA from the vagus nerve.\nNOTE: Upon identifying the carotid arteries as stipulated in step 3.2, the ICA would be recognized as one-half of the CCA branches alongside the ECA.\nInsert a catheter (heat-blunted or silicone-coated 4-0 nylon) monofilament directly through the ICA, ~18.5-19 mm from the bifurcation point of the right CCA into the circle of Willis until reaching a mild resistance, to occlude MCA.\nNOTE: The heat-blunted filament and the silicone-coated 4-0 nylon play the same role and are the more preferred monofilaments in recent times, given that they provide better occlusion than the plain nylon thread28,30.\nTie a 4-0 silk suture around the ICA just above the right CCA (pterygopalatine artery) bifurcation to block the ICA proximal to the filament insertion point permanently and distal to it temporarily.\nTie the ICA around the intraluminal thread to fasten the silk suture to prevent bleeding.\nSubject the sham-operated rats to the same surgical procedure as the MCAO rats but insert a nylon thread instead28.\nNOTE: The nylon thread, like the silicon-coated nylon, occludes the ICA, but it is not as effective as the latter.\nClose the wound on the rat’s neck after occluding the MCA, turn off the anesthesia, and place the rat in an incubator under observation until it wakes up.",
    "NOTE: The need for the proximal ligation is to occlude the ICA, and that of the additional distal ligation is to reduce the bleeding around the filament and secure it in place. Also, the rat should wake up a few minutes after its wound has been closed.\n4. Post-surgical Recovery\nAdminister 5 mL of 0.9% saline solution to each rat intraperitoneally, immediately after surgery, to prevent dehydration.\nAdminister analgesia unconditionally on the first day post-operation; use meloxicam 1 mg/kg SQ q24 h. Give diluted dipyrone (0.5 g dissolved in 400 mL of drinking water) to rats showing symptoms of pain during the first 3 days.\nSacrifice any rats with seizures (seizures are caused by the increased intracranial pressure from cerebral edema or cerebral hemorrhage28).\n5. Neurological Severity Score31\nNOTE: This procedure is performed by two observers who do not take part in the surgical proceedings; they test the neurological deficits and grade motor deficits on a cumulative score of 0-432. The evaluation of this score may be performed at different time intervals; in this investigation, it was performed 50 min, 24 h, 7, 15, and 30 days post-surgery. Find below the steps for evaluating the NSS. Although not a necessity in this situation, this score is required to ascertain stroke in rodents in order to administer treatment.\nPlace the rat on a ceramic floor and allow it to move about freely for 1 min.\nGently pull the rat backward by the tail and grade as follows.\nGrade the rat with score 0 for no neurological deficit.\nGrade the rat with score 1 for forelimb flexion.\nGrade the rat with score 2 for contralateral weak forelimb grip.\nGrade the rat with score 3 for circling to the paretic side when pulled by the tail.",
    "Grade the rat with score 4 for spontaneous circling32.\nNOTE: If more than one of the reactions are observed, preference is given to the action with a higher score.\n6. Determination of the Infarct Volume (Hhistologic Examination)\nMeasurement of the infarct volume\nNOTE: Perform this procedure as described previously33,34. Measure brain infarct volume using 2,3,5-triphenyltetrazolium chloride (TTC) staining 24 h after reperfusion.\n\t\nEuthanize five rats from each group, 24 h after the last NSS, by exposing them to an isoflurane overdose in an induction chamber.\nDecapitate the rats and quickly isolate their brains using small scissors and forceps.\nWash the isolated brains in 0.9% saline.\nExamine bleeding points on the brains to exclude the mice that underwent subarachnoid hemorrhage at the circle of Willis.\nPlace each brain on a clean glass slide on a -20 °C ice pack and then place them in a -20 °C fridge for 5 min to make the brain easier to slice.\nTake the glass slide with the brain on it out of the -20 °C fridge, put it back on the -20 °C ice pack, and dissect the frontal pole and the cerebellum with blade and forceps.\nSlice the brain sections horizontally into 2 mm thickness with a blade to produce six slices.\nPrepare a 0.05% TTC solution by adding 1.25 g of TTC powder to 500 mL of normal saline solution prior to sacrifice, transfer the solution to a 24-well plate (1 mL per well) covered in foil, and store it at 4 °C.\nNOTE: TTC and tissue stained with TTC are light sensitive.\nUsing forceps, transfer the brain slices to the 24-well plate containing the TTC solution (one slice per well) and stretch out the slices in the solution.",
    "Incubate the plate content at 37 °C in a shallow water bath for 30 min.\nAspirate the TTC solution from the plate with a pipette, wash them with a brainwashing fluid, and incubate at room temperature for 30 min.\nPlace the slices in the order in which they were cut on a laboratory glass and examine the segments with a scanner.\nAnalyze the infarct size as a percentage of the whole brain slice, using ImageJ analysis software, based on visual identification.\nAnalysis of the infarct volume35\nQuantify the infarct volume by using a standard image analysis software (ImageJ) and analyze the infarct brain volume as a percentage of the whole brain size33.\nPlace the brain slices on glass microscope slides and scan them with an optical scanner at a high resolution (1,600 x 1,600 dpi) for an adequate analysis.\nCrop the images and standardize the scale for all images, using the metric ruler included in the scanned image.\nMeasure the area of marked pallor in six consecutive 2 mm coronal sections using a Wand (tracing) tool and freehand selection on the ImageJ 1.37v software36.\nCalculate the indirect infarct volume using the following formula37.\n7. Measurement of Brain Edema38\nNOTE: Brain edema was measured 24 h after the last MCAO.  Euthanize animals with severe neurological deficit interfering with eating and/or drinking for at least three days, more than 20% weight loss, hemiplegia or seizures.\nAssess the magnitude of the edema of the right hemisphere by using the summation of coronally sliced areas to calculate the volumes of the right and left hemispheres in arbitrary units (pixels).",
    "NOTE: Use the ImageJ 1.37v software for this calculation, after optical scanning (resolution: 1,600 x 1,600 dpi). Select the area of interest and use the Measure function from the Analysis menu. Macros were used in our investigation.\nExpress the brain edema area as a percentage of the standard areas in the unaffected contralateral hemisphere.\nCalculate the degree of swelling using the equation developed previously39.\n8. Behavioral Paradigms\nPerform behavioral tests between days 30 and 33 after surgery in a closed, quiet, and light-controlled room.\nAssign investigators blinded to all experimental procedures to videotape all behavioral tests with a commercially available program.\nSucrose preference test40,41\nPlace the rats in individual cages in the same room as where they are housed during the dark cycle.\nFor the next 24 h, place one bottle of 100 mL of 1% (w/v) sucrose solution in each cage with the rat to be tested and allow for the adaptation of the rat.\nAfter 24 h, deprive the rats of food and water for 12 h by removing the bottles.\nThen after 12 h, place two bottles in each cage for 4 h, one containing 100 mL of tap water and another containing 100 mL of sucrose solution (1% [w/v]).\nRecord the amount of sucrose solution and water consumed by rats in milliliters. Calculate the affinity to sucrose preference as follows.\nPorsolt forced swim test42\nNOTE: The Porsolt forced swim test was carried out as described in a previous protocol published by Zeldetz et al.40 and Boyko et al.42. The principle of this test states that, when rats are forced to swim in a restricted area from whence, they cannot escape, they eventually become immobile, ceasing any attempts to escape the water43,44. This test was carried out in a different room during the dark cycle.",
    "Place each rat in a vertical plexiglass cylinder (height: 100 cm; diameter: 40 cm) containing 80 cm of water at 25 °C for 15 min for habituation.\nTake the rat out and allow it to dry for 15 min in a heated enclosure (32 °C).\nReturn the rat to its home (original) cage.\nRepeat step 8.4.1 24 h later, this time for the investigation, for 5 min.\nVideotape the 5 min test and calculate the total duration of immobility during that period.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}