{
  "id": 10166,
  "origin_website": "Jove",
  "title": "Engineered Lung Tissues Prepared from Decellularized Lung Slices",
  "procedures": [
    "All animal experimental procedures described in this paper were approved by the Yale Institutional Animal Care and Use Committee.\n1. Creation of Tissue Culture Cassettes and Seeding Baths\nNOTE: Once made, tissue culture cassettes and seeding baths may be autoclaved and reused for repeated rounds of ELT culture.\nTissue Culture Cassettes\nUse a laser cutter to cut tissue culture cassette frames and clips out of 3/32 inch thick polytetrafluoroethylene (PTFE) according to the designs provided in Supplementary File 1 and Supplementary File 2, respectively. Use a laser cutter to cut tissue culture cassette tabs out of 1/16 inch thick PTFE according to Supplementary File 3. Cut outlines 3x using 80% power and 15% speed (for a 30 W laser cutter).\nSeeding Baths\nUse the seeding bath CAD files (Supplementary File 4 and Supplementary File 5) to 3D print the base and ring of the seeding bath mold, respectively, using clear resin.\nSoak the molds in a solution of 10% poloxamer 407 in distilled water overnight before use to aid in PDMS release. Let air dry, then fit the ring over the base of the mold and wrap in flexible plastic film to help prevent leaking.\nPrepare at least 60 g per mold of polydimethylsiloxane (PDMS) by mixing PDMS elastomer in a 10:1 ratio with curing agent, and pour into the 3D printed mold. Degas the PDMS in a vacuum desiccator for 30 min to remove any air bubbles.\nBake seeding baths at 60 °C for 8 h.\n2. Preparation of Precision-Cut Lung Slices from Rat Lungs\nOrgan Harvest",
    "Prepare a split perfusion system comprising gravity- and pump-driven limbs, as pictured in Figure 1. Connect a pulmonary artery (PA) cannula to the end of the tubing, comprising a 1/16 inch barbed Y-connector attached to a ½ inch length of LS 14 silicone tubing and a 3/32 inch female luer-lock connector (see Figure 1). Do not attach a check valve to the cannula at this time.\nPrime the lines with PBS containing 100 U/mL heparin and 0.01 mg/mL sodium nitroprusside (SNP) for anticoagulation and vasodilation, respectively. Pre-set the perfusion pump to 30 mL/min.\n\t\tNOTE: Add SNP fresh to the heparin solution and keep protected from light.\nDose an adult (8-12 week-old, approximately 300-350 g) Sprague-Dawley rat with an intraperitoneal (IP) injection of 400 U/kg heparin for anti-coagulation, followed by an IP injection of ketamine (75 mg/kg) and xylazine (5 mg/kg) for anesthesia. Confirm a surgical plane of anesthesia via lack of response to noxious stimulus (toe pinch).\nTrim the chest and abdomen of fur using hair clippers. Then spray with 70% ethanol and wipe 3x with 10% povidone-iodine.\nGrasp the skin below the level of the diaphragm with rat tooth forceps. Then make a ½ inch transverse incision in the skin with fine-pointed scissors. Grasp the exposed abdominal fascia with the forceps, make a ½ inch transverse incision in the fascia, and then extend the incision through the skin and fascia across the width of the upper abdomen.\nUse the tip of the fine scissors to make a small incision (not more than 1/8 inch) in the center of the anterior diaphragm, causing the lungs to retract in the thorax. Extend the incision in the diaphragm across the full width of the chest.",
    "Make two vertical incisions through the full height of the ribcage toward the neck, being careful not to damage the lungs. Extend the incision through the left ribs to cut through the collarbone and along the side of the neck to the level of the larynx, exposing the trachea.\nDissect the trachea free from surrounding connective tissue and from the esophagus. Make a transverse incision across the anterior half of the trachea between two cartilage rings, close to the larynx. Thread a 4-0 polypropylene suture behind the trachea, below the level of the incision, and loosely pre-tie the first half of a surgeon's knot with two twists.\nPlace a cannula comprising a 1/16 inch barbed Y-connecter connected to a one-way check valve and a ½ inch length of LS 14 silicone tubing with a 3/32 inch female luer-lock connector (see Figure 1) into the trachea by inserting one limb of the Y-connector into the tracheal incision toward the direction of the lungs.\nPosition the pre-tied suture loop around the trachea at the level of the inserted cannula and tighten around the inserted Y-connector to secure the cannula in place. Add two single-twist throws of the suture to complete the knot.\nFill a 10 mL syringe with air and connect to the luer-lock of the tracheal cannula.\nClamp the inferior vena cava close to the diaphragm using a curved hemostat, then inject the heart with 150 U heparin (1000 U/mL) via the right ventricle (RV).\nPartially open the gravity line stopcock, to produce a slow but steady dripping of PBS/heparin/SNP from the PA cannula prepared in step 2.1.1.",
    "Thread the needle of a 4-0 polypropylene suture behind the base of the PA where it exits the RV. Use the first half of a surgeon's knot to pre-tie a loose loop of suture around the base of the PA.\nMake a small incision (not more than 1/8 inch) in the RV just below and perpendicular to the PA using fine scissors, then insert one limb of the PA cannula Y-connector into the base of the PA. Secure the suture around the PA and the inserted connector and add a single-twist throw to complete the surgeon's knot.\n\t\tNOTE: Cannulating the PA under flow prevents the introduction of air bubbles into the vasculature that can preclude adequate clearing of the lungs.\nAttach a one-way valve to the other end of the PA catheter Y-connector, then cut off the apex of the heart to allow blood flow efflux via the left ventricle.\n\t\tNOTE: Failure to cut off the apex of the heart prior to perfusing via the pump can cause damage to the blood-gas barrier, leading to leakage of fluid into the airspaces.\nSwitch the perfusion line to the pump side using the stopcock connecting the two lines, then turn on the pump at 30 mL/min. While perfusing the lungs via the PA, manually ventilate the lungs via the 10 mL tracheal syringe at approximately 10-15 breaths/min, to facilitate clearing the lungs of blood. Perfuse the lungs until they turn mostly white, usually requiring 40 mL of PBS/heparin/SNP or less.\n\t\tNOTE: Inadequate clearing of the lungs of blood may impair downstream decellularization.\nCut the posterior trachea just above the level of the tracheal cannula, and then dissect the lungs and heart free of all remaining connective tissue and extract the lungs and heart en bloc.",
    "Fill a 10 mL syringe with 2% low melting point agarose in Hank's balanced salt solution (HBSS) without phenol red, prewarmed to 42 °C.\n\t\tNOTE: The exact volume of agarose required will vary by lung size. Larger lungs (i.e., from rats larger than 400 g) will require more than 10 mL agarose.\nManually inflate the extracted lungs 3x with 10 mL of air (i.e., to approximately total lung capacity) via the trachea cannula to help recruit collapsed parenchyma.\nImmediately inflate the lungs with the prepared syringe of agarose by manually injecting the agarose via the trachea cannula at a rate of approximately 40 mL/min, just until the most distal tips of the lung lobes are inflated. If distal regions of lung remain collapsed, inject an additional 1-2 mL of agarose.\nCap the trachea by attaching the white cap from a 4-way stopcock to the female luer-lock of the tracheal cannula. Place the lung in a 150 mm Petri dish on ice to allow the agarose to solidify.\n\t\tNOTE: Inflation of the lung shortly after extraction is critical to ensure uniform filling of the lung parenchyma, and subsequent successful tissue slicing. If the lung inflates very unevenly, do not proceed with lung slicing as slice quality will be poor.\nLung Slicing\n\tNOTE: Exact slicing procedure may need to be adapted based on the vibratory microtome (vibratome) being used; additional examples of PCLS preparation with various tissue slicers have been published previously32,33,34.\n\t\nPre-chill the metal chilling block at -20 °C and keep on ice when not using throughout the slicing procedure.",
    "Use a small drop of cyanoacrylate glue to attach a blade to the blade holder. Carefully attach the blade holder to the vibratome using an Allen wrench so that it just lines up with the end of a specimen tube inserted into the buffer tray.\nPrepare 6-well plates with 3 mL per well sterile ice-cold HBSS without phenol red to collect the slices.\nUsing a scalpel, cut a piece of lung tissue approximately 1-1.5 cm3.\n\t\tNOTE: Lung tissue from the lower and middle portions of the left lobe, as well as from the right middle and bottom lobes, most readily yields larger tissue slices that maximize alveolar area. If uninflated tissue regions or areas of connective tissue are present, either trim off this tissue with scissors or orient downward toward the plunger; such tissue tends not to cut cleanly.\nPlace a small drop of cyanoacrylate glue onto the plunger of the specimen tube. Dab lung tissue on a paper wipe to remove excess moisture, and then immediately place the lung tissue on top of the plunger using a pair of forceps.\nSlide the metal tube of the specimen tube up to the level of the top of the tissue and hold in place, with the plunger receded. Pipette pre-warmed 2% agarose in HBSS into the top of the tube to completely surround the tissue.\nPlace the ice-cold chilling block around the tissue for about 1 min to allow the agarose to solidify.\nInsert the specimen tube into the buffer tray. Fill the tray with ice-cold PBS to mid-way up the tissue block. Turn the motor box switch to fast forward (FF) to advance the motor box plunger so that it is just touching the base of the specimen tube.",
    "Set the desired settings for slice thickness, cutting speed, and oscillation frequency, for example, 450 µm thickness, speed 4 and oscillation frequency 5. Select Continuous mode, and then flip the switch to On to begin slicing.\nAs tissue slices fall into the buffer tray, transfer them to the prepared 6-well plates using an inoculating loop or spatula.\nStop slicing when ~2 mm thickness of tissue remains in the specimen tube, to avoid damaging the blade or cutting tissue containing glue.\nRepeat the above steps to slice additional lung tissue, as desired.\nDecellularize slices immediately for scaffold preparation, or snap-freeze and store at -80 °C for up to 2 months. To freeze, transfer 4-6 slices to a 35 mm Petri dish and carefully aspirate any excess fluid from around the slices. Place the dishes in a bath of dry ice and 100% ethanol to snap-freeze, then wrap in foil, seal in a plastic bag, and transfer to -80 °C.\n\t\t​NOTE: Do not place fresh slices directly into a -80 °C freezer as the relatively slow rate of freezing can cause ice crystals to form that can damage the tissue.\n3. Preparation of Lung Tissue Scaffolds\nPreparation of Materials and Decellularization Solutions\nAutoclave frames, clips, and tabs.\nPrepare decellularization solutions as outlined in Table 1.\n\t\tNOTE: Add benzonase nuclease to pre-warmed buffer immediately before use and sterile filter. Prepare Triton X-100 and sodium deoxycholate (SDC) solutions within 24-48 h of the decellularization procedure. Prepare antibiotic/antimycotic solutions and benzonase buffer up to 30 d in advance and store at 4 °C.\nCutting and Clipping Lung Slices\n\tNOTE: While cutting and clipping may be done non-sterilely on the benchtop, the decellularization steps in section 3.3 and all subsequent handling of the tissue scaffolds must be performed in a laminar flow hood.",
    "Fill a 100 mm Petri dish about one-third full with PBS. Transfer cassettes (frames containing two clips each) and tabs to the dish using forceps.\nIf using frozen slices, thaw one dish at a time by pouring room temperature PBS into the dish to cover the slices. Keep remaining dishes on dry ice.\nTransfer a thawed slice to a 150 mm Petri dish. Gently unfold the slice using fine forceps, if necessary, so that it lies flat, then carefully aspirate excess PBS from around the tissue.\nUse a razor blade, with a ruler as a guide, to cut a 3 mm wide strip from the slice by pressing the full length of the blade firmly against the dish and rocking it slightly side to side with the blade edge held in place. Alternatively, use a rotary cutter retrofitted with 2 parallel blades separated by a 3 mm custom-made spacer (e.g., made of acetal [polyoxymethylene]) to cut tissue strips. Avoid any tears, holes, large airways or vessels, or thick connective tissue.\n\t\tNOTE: For successful clipping, the strip must be at least 9 mm long.\nUsing forceps, transfer the tissue strip to the prepared 100 mm Petri dish.\nClip the tissue strip into the cassette: float the tissue above the cassette, centering the tissue to overhang the holes in the clips at either end. With fine forceps, place a tab partly into the hole at one end, gently straighten the tissue, and then place the second tab. Using forceps in each hand, press each tab in completely to secure the tissue.\n\t\tNOTE: If having difficulty keeping the tissue in place prior to clipping, aspirate some PBS from the dish to lower the fluid level. Be careful not to stretch the tissue in placing the second clip, as this may lead to tearing.",
    "Repeat the thawing, cutting, and clipping procedure in steps 3.2.2-3.2.6 for as many tissues as desired.\nSlice Decellularization\nOnce all slices are clipped, transfer the 100 mm dish containing the cassettes to a laminar flow hood.\nBegin step 1 of the decellularization protocol (see Table 2): using a curved hemostat to grasp the notched sides of each cassette, transfer cassettes to 6-well plates (2 tissues/well) filled with 3 mL of PBS + ions + antibiotics/antimycotics per well (see solution recipe in Table 1).\nPlace well plates on an orbital shaker at 30 rpm for 10 min.\nContinue with step 2 of the decellularization protocol (see Table 2): aspirate the fluid from each well, then replace with 3 mL/well PBS + ions, place plate on orbital shaker at 30 rpm, and incubate for 5 min.\nRepeat step 3.3.4 for each of the solutions and corresponding durations as outlined in the decellularization protocol in Table 2.\nAfter the final rinse step with PBS + antibiotics/antimycotics (step 20 of Table 2), transfer tissues to sterile 6-well plates with fresh PBS + antibiotics/antimycotics, and incubate at 37 °C for 48 h.\n\t\t​NOTE: After sterilization with antibiotics/antimycotics, lung tissue scaffolds can be seeded immediately, or stored at 4 °C for up to 30 d.\n4. Slice Recellularization and Culture\nNOTE: Figure 2 shows a proposed timeline for tissue seeding and culture, in which slices are seeded first with rat lung microvascular endothelial cells and cultured in low-serum endothelial medium; then seeded with rat AEC2s and rat lung fibroblasts with a serum-free AEC2 growth medium (adapted from Jacob et al.13 and You et al.35); see additional notes on cell sources used in Results and culture media details in Table 3. This strategy yields alveolar-like structures containing AEC2 monolayers.",
    "Preparing Tissue Scaffolds for Seeding (Day -4 or -3)\nIf using tissue scaffolds stored at 4 °C, incubate scaffolds overnight at 37 °C with fresh PBS + antibiotics/antimycotics (10% penicillin/streptomycin, 4% amphotericin B, 0.4% gentamicin in PBS) prior to seeding.\nRinse scaffolds 3x with sterile PBS (5 mL/well), 5 min each.\nExamine scaffolds under a phase contrast microscope at 5x magnification to select tissues for seeding.\n\t\tNOTE: The best scaffolds for seeding have no tears or holes and do not contain large airways or vessels. While scaffolds with the features may be seeded successfully, repopulation patterns may differ from those observed in alveolar areas.\nEndothelial Cell Seeding (Day -3)\nCount endothelial cells using a hemocytometer and prepare the endothelial cell suspension in endothelial medium (see Table 3) at 5 x 106 cells/mL, with sufficient cells to seed 500,000 endothelial cells per slice (e.g., for 12 slices, resuspend 6 x 106 cells in 1.2 mL medium).\nPlace autoclaved seeding baths in 100 mm Petri dishes. Transfer rinsed scaffolds upside down to seeding baths: use a fine curved hemostat to grasp a cassette by the notched sides, use a straight hemostat or forceps to grasp one end of the cassette (being careful not to touch the tissue itself) and flip, and then grasp the cassette again with the tips of the fine curved hemostat via the holes along the notched sides, and place in a seeding bath well. Repeat for remaining cassettes.",
    "NOTE: When correctly placed, scaffolds will be centered, upside down, in the bottom of each well. If needed, press down gently on the corner of the cassette with the tips of a hemostat to ensure that the cassette is seated flat in the well. Improper seating of the cassette can lead to poor tissue seeding. It is acceptable if the well contains a small amount of PBS.\nSwirl the prepared cell suspension gently to mix, then use a manual pipette to pipette 100 µL cells directly on top of each tissue at the base of the well, being careful not to damage the tissue with the pipette tip.\nTransfer seeded tissues to the cell culture incubator at 37 °C/5% CO2.\nAfter 2 h, add 900 µL pre-warmed culture medium to each well using a manual pipette, then return to incubator. If a cassette becomes unseated (floats) upon adding medium, gently press down on the corner of the cassette with the pipette tip so that it lies flat in the well.\nChange medium on day -2. Remove medium by tilting the Petri dish and manually pipetting with a pipette tip lightly placed in the corner of the well, so as not to disturb the cassette. Replace with 1 mL of fresh endothelial medium per well.\nAEC2 and Fibroblast Seeding and Tissue Culture (Day 0)\nCount AEC2s and fibroblasts using a hemocytometer. Prepare a 1:1 cell suspension of AEC2s and fibroblasts in AEC2 growth medium (epithelial base medium + AEC2 supplements; see Table 3) at 5 x 106 total cells/mL, with sufficient cells to seed 500,000 cells (250,000 AEC2s and 250,000 fibroblasts) per slice (e.g., for 12 slices, resuspend 3 x 106 AEC2s + 3 x 106 fibroblasts together in 1.2 mL medium).",
    "Pipette out the medium from each well of the seeding bath as described in step 4.2.6. Swirl the prepared cell suspension gently to mix, then pipette 100 µL cells directly on top of each tissue at the base of the well.\n\t\tNOTE: It is acceptable if a small amount of endothelial medium remains in the well prior to AEC2/fibroblast seeding.\nTransfer seeded tissues to the cell culture incubator at 37 °C/5% CO2.\nAfter 2 h, add 900 µL pre-warmed AEC2 growth medium to each well, then return to incubator.\nAfter 24 h of culture (day 1), prepare a 12-well plate with 1 mL of pre-warmed AEC2 growth medium per well per cassette.\nPipette 800 µL of medium from each well of the seeding bath. Remove cassettes from the seeding bath: grasp each with a fine curved hemostat via the holes along the notched sides, transfer to a straight hemostat or forceps to grasp the cassette at one end and flip, then use the curved hemostat to grasp the cassette via the notched sides and transfer right-side-up, one per well, to the prepared 12-well plate.\nChange culture medium in the 12-well plate every other day until day 7 or for the desired length of culture: use a glass Pasteur pipette to aspirate the medium from each well, being careful not to touch the tissue; pipette in 1 mL fresh AEC2 growth medium per well.\n\t\t​NOTE: The degree of tissue repopulation may be monitored via phase contrast microscopy at 5x magnification throughout the duration of culture.\n5. Tissue Harvest and Sample Analysis",
    "To fix ELTs for histology and immunofluorescent staining, transfer tissue culture cassettes to 10% neutral-buffered formalin and incubate for 3-4 h at room temperature on a rocker. Remove tissues from cassettes by using the tip of a fine-pointed forceps to cut the tissue where it meets the tabs. Process tissue according to routine methods for paraffin embedding and histology; no specialized techniques are required.\nTo process ELTs for qRT-PCR, rinse tissues in cassettes in PBS 2x, then remove tissues and snap freeze or proceed with lysis for RNA extraction.\n\tNOTE: Pooling at least 2 slices seeded with 1 x 106 cells and cultured for 7 days should yield ample RNA for downstream PCR analysis."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}