{
  "id": 6499,
  "origin_website": "Bio",
  "title": "Capillary Nano-immunoassay for Quantification of Proteins from CD138-purified Myeloma Cells",
  "procedures": [
    "Proteins extractionThe scheme of the procedure is provided in Figure 1. Collect 5 x 105-5 x 106 cells in one 1.5 ml Eppendorf tube. Centrifuge at 1,200 x g at RT, 3 min.Decant the supernatant and wash with 1 ml of PBS. Centrifuge at 1,200 x g at RT, 3 min.Decant the supernatantResuspend in 350 μl of RLT+. Store at -80 °C, cells can be maintained there for several years.Thaw cells at RT.Pass the cell suspension through the syringe and needle 8 times.Spin at max speed for 5 s in a benchtop centrifuge to eliminate foam.Follow the QIAGEN Allprep protocol[href=https://www.qiagen.com/us/resources/resourcedetail?id=a7303148-4335-4a54-8fed-5b82d9ed2365&lang=en] to extract DNA and RNA. Pass the sample through DNA column, add ethanol to the flow-through according to the procedure, and pass the sample through RNA column. The eluate is the protein sample. In this protocol the first flow-through from RNA column is used (approx. volume 600-700 μl). Add 3.3 μl of 5 M NaCl to each 2 ml Eppendorf tube, previously prepared.Add half of the through-flow from RNA column to each tube from the previous point (300-350 μl of sample per Eppendorf tube).Add 4x volume of ice-cold acetone to each 2 ml Eppendorf from the previous Step (approx. 1,200 μl).Note: The temperature of acetone is extremely important. Place it at -20 °C at least overnight. Mix by inversion 3 times and put on ice immediately until stored.Store at -20 °C, at least overnight.Centrifuge at 16,000 x g at 4 °C for 30 min. Decant the supernatant carefully.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190614/20190614032129_2646.jpgFigure 1. Scheme of the procedure of protein extraction from RLT+ buffer. Refer to Procedure A for detailed description.Fill the tube with 70% ethanol (ice-cold) to wash, mix by inversion 3 times. It is not necessary to vortex.Centrifuge at 16,000 x g at 4 °C for 10 min, decant the supernatant.",
    "Repeat the washing with ethanol.Carefully decant ethanol without losing the pellet, which could be transparent at this point.Air-dry pellet at 37 °C, 30 min (the time depends on the amount of ethanol remained). At this point it is important not to over-dry protein pellet, since it will become insoluble.Rehydrate proteins in 50 μl of 0.2 M NaOH, leave 10 min at RT, carefully vortex from time to time avoiding pellet to be moved to the upper part of the tube.Add 150 μl of sample buffer containing DTT (final DTT concentration 50 mM), and protease-phosphatase inhibitors (10 μl PMSF solution, 10 μl sodium orthovanadate solution and 10 μl protease inhibitor cocktail solution per ml). Leave at least 15 min to dissolve proteins. The volume and time depend on the pellet. Can be vortexed, or mixed.Boil samples at 95 °C for 5 min.Cool to RT. Samples can be stored at -20 °C or at -80 °C (recommended).Note: When the sample is thawed for the subsequent applications, some precipitation can occur. In this case mix the sample well, or heat to 35 °C in a thermoblock for 30-60 min.Preparation of the sample for analysis in WESNote: The following procedure is valid for sample preparation both for total protein assay (TPA) as well as for capillary nano-immunoassay (CNIA). Prepare the 5x Master Mix according to the manufacturer’s procedure. It contains 1 kDa, 29 kDa and 230 kDa fluorescent standards. All reagents, except deionized water are provided in the Wes Separation Module.Open the standard pack clamshell.Pierce the foil of the clear tube with DTT and add 40 μl of deionized water, mix gently.Pierce the foil of the pink tube and add 20 μl of 10x sample buffer and 20 μl of DTT solution from Step B1b, mix gently.",
    "Prepare biotinylated ladder (included in the Wes Separation Module) by piercing foil of the white tube and adding 20 μl of deionized water. Mix gently and transfer to a 1.5 ml Eppendorf tube.Prepare 3 μl of each sample to be quantified in a new 1.5 ml Eppendorf tube.Note: Analyze samples without dilution in TPA assay. In case of CNIA dilute them either in deionized water or in 0.1x sample buffer provided in the Wes Separation Module kit. For CNIA, the final concentration of the sample should be at 0.2 mg/ml. Add 0.75 μl of the 5x master mix to each tube prepared in the previous step.Mix by pipetting.Collect the samples by spinning at max speed for 5 s.Preheat the thermoblock to 95 °C. Place both standard and samples to be analyzed in the thermoblock. Heat at 95 °C for 5 min.Cool to the RT at the bench.Total protein quantificationIn this assay all proteins are biotinylated and detected with streptavidin-HRP chemiluminescent substrate.Prepare the assay template using Compass software according to the Figure 2.Run the Compass software and create new assay (File → New assay → WES → size type: Total Protein Assay → Size range 12-230 kDa → cartridge 25). In a first row label the samples. Save the assay.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190614/20190614032258_8730.jpgFigure 2. Assay template for total protein assay with standard curve and 18 samples of unknown protein content. The recommended volume of each sample and reagents in each well are marked with arrows. The rows correspond to: (A) samples, (B) total protein biotin labeling reagent, (C) antibody diluent, (D) total protein streptavidin HRP, (E) Luminol/peroxidase. First well in the row (A) contains biotinylated ladder, and in the row (B) antibody diluent.",
    "Prepare the samples for standard curve using cell line sample extracted by the conventional protein extraction with RIPA buffer (example of the standard protocol https://www.abcam.com/protocols/sample-preparation-for-western-blot[href=https://www.abcam.com/protocols/sample-preparation-for-western-blot]). Here, the JJN3 cell line is used (5 x 106 cells). Standard curve should be prepared with 5 serial dilutions at concentrations of 0.25 mg/ml, 0.125 mg/ml, 0.0625 mg/ml, 0.03125 mg/ml, 0.0156 mg/ml and 0 mg/ml. Mix them with the Master Mix from Procedure B.Prepare the protein labeling reagent; bring the Reconstitution Reagent 1 and 2 to the RT before use and follow the producer protocol.Prepare the chemiluminescent substrate by mixing in a 1.5-ml Eppendorf tube 200 μl of Luminol-S with 200 μl of Peroxidase, both supplied in the detection module.Remove the upper part of the foil from the plate and pipette the plate according to the template designed in Step C1; add wash buffer according to the separation module leaflet.Centrifuge plate at 1,100 x g for 10 min, at RT, to remove any bubbles. Check for bubbles, if some are still present pinch them with a needle. Make sure that the centrifuge is set at RT (18-25 °C).Open the WES machine. Insert the cartridge with capillaries (included in the Wes Separation Module) to the cartridge holder in the WES machine. The light inside the holder should change from orange to blue.Remove the lower part of the foil from the plate and place it inside the WES machine. Close the machine and click the start button in Compass. After finishing the run retrieve the data and analyze it according to the Data analysis point 1 to calculate the protein concentration in each sample.Antibody optimizationThis step consists of running the assays in the cell line samples at concentration 0.2 mg/ml at four antibody dilutions (1/25; 1/50; 1/100 and 1/200).",
    "In the example two antibodies are shown, anti-GAPDH and anti-Aiolos, and the example of the plate layout is presented in Figure 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190614/20190614032355_4020.jpgFigure 3. Plate layout for anti-aiolos and anti-GAPDH antibody optimization. The rows correspond to: (A) samples, (B) antibody diluent (C) antibody at distinct dilutions (1/25 to 1/200), (D) secondary antibody (E) Luminol/peroxidase. First well in the row (A) contains biotinylated ladder, in the rows (B) and (C) antibody diluent and in the row (D) streptavidin HRP.Create a new assay template using Compass software according to the Figure 3. Run the Compass software and create new assay (File → New assay → WES → size type: Size → Size range 12-230 kDa → cartridge 25). Prepare antibody in antibody diluent by serial dilution method, diluted antibody volume in each well is 8 μl. Pipette the plate according to the template prepared, proceed further as indicated in Steps C4-C8. The standard volumes in each well are: the sample 3 μl; antibody diluent, primary and secondary antibodies 8 μl each; luminol/peroxidase solution 15 μl. Analyze results, according to point 2 in Data analysis.Plot the peak area vs. antibody dilution and find the last antibody concentration at which the curve follows the linear trend line, which means the antibody saturation was reached, like in the example in Figure 4, where in both cases the dilution of 1/100 is considered the optimal.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190614/20190614032514_8431.jpgFigure 4. Result of anti-aiolos and anti-GAPDH antibody optimization. The arrows indicate the selected antibody dilution.Standard curves need to be generated for each protein to evaluate the range of linearity over which the expression of each protein could be quantified. The details with the example of standard curve are provided in Haematologica “Optimization of protein quantification by capillary nano-electrophoresis with immunoassay[href=http://www.haematologica.org/content/103/5/880.long]” section and Figure 3 of Misiewicz-Krzeminska et al. (2018).",
    "Quantification of protein level in the sample is performed using previously set antibody dilutionNote: It is generally advised to measure the level of the protein of interest and the reference protein in the same run. Prepare samples to analyze the protein of interest and the reference protein. In the example, one protein of interest is analyzed and one reference, thus in one run 12 samples are evaluated. Mix 8 μl of sample and 2 μl of Master Mix (when preparing sample for more than one measurement at once, add 10% excess of the sample and master mix). Proceed like described in Procedure B. To analyze the data, proceed like in point 2 of Data analysis section."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}