{
  "id": 9748,
  "origin_website": "Jove",
  "title": "Organotypic Culture of Full-thickness Adult Porcine Retina",
  "procedures": [
    "1. Making a custom-made stand for cell culture inserts \nThe base of a 5 ml pipette tip (ISC BioExpress, #P-3250-19) has an inner diameter of 13 mm, which perfectly matches the bottom size (12.6 mm, outer diameter) of a 10 mm (inner diameter) NUNC cell culture insert (8 μm, Polycarbonate membrane, Thermal, #137443). To make the stand, the pipette was cut off near the base to produce a 6 mm long hollow cylinder. Then, pieces were removed from the side of the cylinder using a flame-heated blade to create 3 legs (4 mm in height) under a ring (2 mm in height), which raised the height of the inserts by approximately 5 mm.\n2. Preparation of sterile filter paper for attachment and culture of porcine retina\nWhatman 4M Filter paper (Cat No. 1004) was cut into a circular shape (6.3 mm in diameter) with a small, triangular handle that was used for moving the filter paper into a glass tube for sterilization or once the retina was attached (as shown in the video). \n3. Preparation of retinal explants",
    "Eyes from 5- to 9-month old, 150-230 lbs, American Yorkshire pigs were obtained from a local abattoir within three hours of enucleation (transported on ice). Upon arrival, eyes were cleaned of extraneous tissue, dipped in betadine solution (10% Povidone-iodine, The Purdue Frederique Company, Stamford, CT) and washed twice in Dulbecco’s Modified Eagle Medium (DMEM  with 1g/L glucose, L-glutamine, and sodium pyruvate, Cellgro-mediatech Inc., Manasses, VA) supplemented with 2.5 μg/ml Amphotericin B (Gibco-Invitrogen, Carlsbad, CA). The anterior segment was removed, exposing the neural retina. Six-mm trephine blades (Storz Ophthalmic-Bausch and Lomb, Manchester, MO) were used to cut equatorial, full-thickness posterior segment explants. The retina was subsequently peeled off by gently applying a piece of dry sterile filter paper onto the ganglion cell layer, lifting off the neural retina, and placing the filter paper with attached retina onto the culture insert, photoreceptors facing up. The insert was then placed into culture medium, making sure to fully cover the retina, in a 12-well culture dish (Fisher). Multiple explants were obtained routinely and cultured from a single eye.\n4. Tissue culture \nThe retinal tissue was cultured in Eagle’s Minimum Essential Medium (MEM, Invitrogen-Gibco-Life Technologies Inc., Rockville, MD), pH 7.4, supplemented with 0.2 mg/ml glutamine, 10 μg/ml porcine insulin, 1 mM pyruvate, 0.1 mM L-ascorbic acid, 100 U/ml penicillin, 100 μg/ml streptomycin, and 250 ng/ml amphotericin B (Antibiotic Antimycotic: Sigma, St. Louis, MO), and aerated with humidified 5% CO2, balance air, at 37 °C. Medium was exchanged every two days.\nTissue can be used, treated with a variety of reagents or probes, or left untreated for subsequent biochemical or morphological analyses. The section below describes procedures to create consistent full-thickness retinal cross-sections.\n5. Sectioning \nUsing a Cryostat\nFix retinal tissue in 4% parafomaldehyde overnight at 4°C;\nRinse tissue briefly with phosphate buffered saline (PBS);",
    "Carefully remove the tissue from the filter paper while it is in PBS in a 35 mm dish using a dissection microscope; \nTransfer tissue to 30% sucrose and keep overnight at 4°C;\nSuction away the excess solution around the tissue, add sufficient Tissue-Tek medium (O.C.T. Compound 4583) to cover tissue, and let it soak at room temperature for 2 hours to permeate the tissue;\nBuild a square frame (10 mm x 10mm, 5 mm height) with dental wax and place it around the tissue; add more Tissue-Tek medium to fill the frame (make sure the tissue sample is flat) and place in a freezer (-20°C) for at least 1 hour;\nTransfer the frozen sample block to a sample platform (make sure the sample block is vertical to the platform); \nMount the sample platform in a pre-cooled cryostat (-20°C, Leica, CM1900) and make sure the block is vertical to the blade;\nRemove the wax and the frame block before sectioning the tissue at desired thickness;\nPlace the sections on gelatin-treated slides.\nUsing a Vibratome\nFix and rinse the tissue as described above for the Cryostat;\nPlace the tissue into pre-heated, melted 4% agar in a small container and keep at 4°C until the agar congeals completely;\nUse a sharp blade to trim the agar into a small block with the tissue sample inside;\nGlue the sample block on a vibratome sample holder with Krazy glue (make sure the piece of tissue sample is vertical to the platform of the sample holder, i.e., perpendicular to the blade) and mount the holder on a vibratome sectioning system (Leica, Series 1000) with the sample block completely submerged in icy water;\nCut the sample block into 50 μm sections and place them on gelatin-treated slides with a soft brush.\n6. Immunohistochemistry",
    "Use any standard protocol. Immunolabeled thick sections can be viewed with a confocal microscope.\n7. Representative Results:\nMorphology was preserved during the seven-day period of culture. Images of retina before and after culturing are available in the video. Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}