{
  "id": 9073,
  "origin_website": "Jove",
  "title": "Non-restraining EEG Radiotelemetry: Epidural and Deep Intracerebral Stereotaxic EEG Electrode Placement",
  "procedures": [
    "Ethics Statement: All animal experimentation was performed according to the guidelines of the local and institutional Council on Animal Care (University of Bonn, BfArM, LANUV, Germany). In addition, all animal experimentation was carried out in accordance with superior legislation, e.g., the European Communities Council Directive of 24 November 1986 (86/609/EEC) or individual regional or national legislation. Specific effort is made to minimize the number of animals used and their suffering.\n1. Experimental Animals\nSelection of experimental animals and species\n\t\nPerform radiotelemetric studies in rodents, i.e., mice and rats that fulfil the requirements of homology, isomorphism and predictability related to a specific human disease 7,9,45,46.\n\t\tNote: Miscellaneous mouse and rat strains available can severely differ in basic physiological and pathophysiological characteristics 47-49.\nConsider or evaluate physiological and pathophysiological characteristics of mouse/rat strains prior to performing subsequent electrophysiological experiments, e.g., response to applicable dosages of anesthetics, sleep architecture and seizure susceptibility 50,51.\nNote gender specific characteristics in study design. The estrous cycle can strongly affect central rhythmicity, its circadian dependency, sleep and seizure activity 52-54. Thus, perform gender specific analysis.\n\t\tNote: If financial and experimental capacity is limited, restriction to male mice is advised.\nAnimal housing and handling\n\t\nHouse mice and rats in filter-top cages or even better in individually ventilated cages.\nTransfer mice from the animal facility to ventilated cabinets placed in special lab rooms exclusively dedicated to implanted animals and their subsequent recording (Figure 1).\nFor acclimatization after ground transportation, place animals for one week in a ventilated cabinet under standard conditions, i.e., 21 ± 2 °C ambient temperature, 50 - 60% relative humidity, and a conventional 12 hr light/dark cycle.",
    "Prior to surgical implantation, house mice in groups of 3 - 4 in clear polycarbonate cages type II (26.7 cm x 20.7 cm x 14.0 cm, area 410 cm2) with ad libitum access to drinking water and standard food pellets. Use clear polycarbonate cages type III (42.5 cm x 26.6 cm x 18.5 cm, area 800 cm2) for rats.\nDo not separate/isolate animals at this stage as isolation can cause stress influencing experimental results later on. However, following surgical instrumentation, house animals separately as the animals tend to manipulate wound stiches/sutures or metal clips (see below).\nAvoid open housing conditions as they are judged inappropriate for a variety of scientific questions, e.g., sleep studies.\nUse mouse and rat specific equipment so that neither mice nor rats can sense the presence of each other as this poses additional stress to the animals.\n2. EEG Radiotelemetry System\nNote: The protocol described is based on a commercially available telemetry systems used for surface and deep intracerebral EEG recordings (Figure 2).\nUse a radiofrequency telemetry implant suitable for implantation in mice or rats, e.g., a one-channel transmitter or a two-channel transmitter.\n\tNote: Both transmitters are capable of measuring various biopotentials, i.e., electroencephalogram (EEG), electrocardiogram (ECG), electromyogram (EMG), but also physical activity and temperature. They have a magnetically actuated on-off mechanism. The transmitter and sensing leads are provided sterile. If the transmitter is to be re-used follow the manufacturers’ instructions for resterilization.",
    "For high-frequency gamma analysis (up to 500 Hz) for example, choose transmitters with higher nominal sampling rate (f, up to 5,000 Hz) and transmitter bandwidth (B, up to 500 Hz). In particular, consider the Nyquist-Shannon sampling limit, i.e., EEG data can be analyzed up to an absolute maximum of f/2, but not beyond. For reliable frequency analysis, a frequency bandwidth (B) of f/10 - f/5 is recommended.\n\tNote: The scientific question to be addressed must meet the technical specifications of the transmitter.\n3. Anesthesia and Pain Management\nUse isoflurane inhalation narcosis.\n\t\nPlace the animal in an \"induction chamber\" filled with 4 - 5% isoflurane and 0.8 - 1% oxygen or carbogen (5% CO2 and 95% O2) L/min. Maintain the desired depth of anesthesia with a silicon facemask providing a flow 1.5 - 3.0% isoflurane and 0.8 - 1% oxygen or carbogen L/min (Figure 3A).\n\t\tNote: The appropriate isoflurane concentration varies according to body weight (distribution volume), age, sex and genetic background of the animal. If gas anesthesia equipment is not available, i.e., \"induction chamber\", carbogen or oxygen supply, flowmeter, isoflurane vaporizer, scavenging system, see section 3.2. A withdrawn by suction system (scavenging system, Figure 3A) is to be installed to avoid isoflurane exposure of the experimenter (the tubing is not shown in the video document for demonstration).\nWhen inhalation aneesthetics are not an option, perform anesthesia by injectable anesthetics. Prepare a combination of esketamine hydrochloride (rodent dosage 100 mg/kg) and xylazine hydrochloride (rodent dosage 10 mg/kg) in 0.9% NaCl and inject the animal intraperitoneally based on its body weight.\nObserve the animals carefully for depth of anesthesia using tail pinch, foot pinch and by monitoring respiration rate (mice 150 - 220 breaths/min; rats 70 - 115 breaths/min). Check for possible gasping.",
    "Note: Different mouse and rat lines can exhibit different sensitivities to anesthesia. The same holds true for transgenic mouse models.\n\tNote: Endotracheal intubation is not a must in rodents. In fact, intubation increases the risk of damage to the trachea.\n4. Surgical Instrumentation — General Aspects\nApply supplemental warmth during and post-surgery using recirculating warm water blankets, electrical warming plates, heat lamps, forced warm air units or pocket warmers to maintain body core temperature. Maintain the latter at 36.5 - 38.0 °C (98.6 - 100.4 °F).\n\tNote: Small rodents are predisposed to hypothermia due to their high ratio of body surface (mouse, 10.5 x (weight in g)2/3; rats, 10.5 x (weight in g)2/3) to body volume.\nAvoid corneal desiccation and cover eyes with petroleum-based artificial tear ointment or dexpanthenol (see video document) during the whole implantation process and early recovery until the blinking reflex is totally restored.\nAutoclave surgical instruments (see Table of Materials) for sterilization or place them in disinfectants.\n\tNote: An elegant and fast way is the usage of a heat-based surgical instrument sterilizer with glass beads.\nHave a binocular surgical magnification microscope and a cold light source available for intense illumination via flexible or self-supporting, movable light guides.\nWear a clean laboratory coat, a facemask, a head cover and sterile gloves.\n\tNote: Optimal supplies and instruments may vary from lab to lab and must meet lab-specific and institutional requirements.\n5. Surgery — Transmitter Placement\nRemove the body hair from the scalp from fully anesthetized mice/rats using a shaver. Clean the shaved area using a disinfectant, e.g., 70% ethanol and an iodine based scrub. Avoid skin irritation or inflammation due to excessive exposure. Place the animal in prone position on a heating blanket to maintain body temperature during anesthesia.",
    "Using a scalpel, make a midline incision on the scalp from the forehead (so that the bregma craniometric landmark becomes visible) to the neck (so that the trapezoid muscle becomes visible). Starting from the nuchal incision site and using a surgical scissor, open a subcutaneous pouch along the lateral flank of the animal by blunt dissection.\nInject 1 ml 0.9% NaCl in the subcutaneous pouch. Place the transmitter with the sensing leads oriented cranially inside the subcutaneous pocket at the flank close to the ventral abdominal region. If the transmitter has a suture tab, fix the transmitter at the dorsal/lateral skin using one or more stiches (over-and-over sutures).\n\tNote that fixation of the transmitter is not a must. Pay special attention to preventing contamination of the surgical site and transmitter implant. Drapes should be used to properly isolate sterile from non-sterile areas.\nFor post-operative care and pain management, see section 8.\n6. Stereotaxic Surface Electrode Implantation\nPlace the animal on the stereotaxic frame under anesthesia and carefully position the head with the help of the bars and the nose clamp so that the bregma and lambda craniometrics landmarks of the skull are at the same level (Figure 3B). Do not damage the inner ear using ear bars. Cover ear bars with cotton balls if necessary. This precautions allows for tight fixation of the head within the stereotaxic frame.\nClean the periosteum with cotton tips without damaging the temporal and occipital muscles. Pre-treat the superficial thin layer of the skull with 0.3% H2O2 for the mouse skull and 3% H2O2 for the rat skull. This procedure clearly exposes cranial suture and craniometrics landmarks such as bregma and lambda (Figure 4B, C).",
    "Use a special, fully equipped stereotaxic setup for mice and rats including stereotaxic frame with ear bars and nose clamp size-adapted for mice and rats, respectively. Ensure that the stereotaxic frame includes a gas anesthetic mask with connections to the isoflurane evaporator and the isoflurane scavenger module.\n\tNote: A computerized 3D stereotaxic setup with a specific mouse and rat brain coordinate software including a user interface for navigation and 3D atlas, allowing axial, coronal and sagittal views is recommended.\nMount a precision drill on the vertical arm of the stereotaxic frame. Use a mounted pencil or pen on the vertical arm leaving a tiny mark at the coordinates of choice on top of the skull if no computerized stereotaxic system is available.\nDrill holes carefully taking into consideration that mice and rats severely differ in the neurocranial bone thickness. In addition, note that the thickness of the murine cranial bones strongly depends on the localization, e.g., in mice, os frontale: midline section: 320-390 μm, lateral section: 300 - 430 μm; os parietale: midline section: 210 - 250 μm, lateral section: 200 - 210 μm; os occipitale: midline section: 600 - 730 μm, lateral section: 380 - 420 μm).\nDrill holes pressure-free at maximum velocity.\n\tNote: This avoids a tonic applanation of the skull, which may result in a sudden breakthrough of the drill head and potential damage mainly in the cortical field. For craniotomy, a neurosurgical high-speed precision motor drill system is highly recommended.\nDrill burr holes at the coordinates of choice with typical drill head diameter of 0.3 - 0.5 mm.\n\tNote: The diameter of the holes might be smaller depending on the electrode diameter. As a general rule, the smaller the diameter, the less damage is produced.",
    "Bend the tip of the transmitters' sensing lead which serves as an epidural electrode and place it directly on the dura mater in the hole at the coordinates of choice. Alternatively, use cortical screws and mechanically attach them to the sensing leads of the transmitter (Figure 4A).\nFor recordings from the surface, e.g., the murine motor cortex M1/M2, position the electrode, e.g., at: cranial 1 mm, lateral 1.5 mm (left hemisphere). Place the epidural reference electrode on the cerebellar cortex: bregma -6 mm, lateral of bregma 1 mm (left hemisphere) or bregma -6 mm, lateral of bregma 1 mm (right hemisphere) (Figure 4D).\n\tNote: The cerebellum serves as a reference as it is an electroencephalographically silent region. Stereotaxic coordinates can be derived from standard stereotaxic atlases for mice and rats.\nFix electrodes with glass ionomer dental cement (water-based), which is extremely hard and gives strong adhesion to the underlying neurocranium.\n\tNote: If glass ionomer dental cement is used, no anchoring screws are necessary to secure the electrodes.\nLeave the cement to dry for 5 min. Close the scalp using over-and-over sutures with non-absorbable 5-0/6-0 suture material. Alternatively, skin glue can be used. Closely monitor the quality of EEG recordings based on the electrode implantation site. Note: Ossification from the drilled holes can occur that has the capability to lift up the electrodes with time. This can result in reduced EEG quality due to EMG and ECG contamination and can thus limit the optimum recording duration.\nFor post-operative care and pain management, see section 8.\nValidate EEG electrode position post mortem.",
    "For euthanasia, place the animal(s) in an incubation chamber and introduce 100% carbon dioxide. Use a fill rate of 10% - 30% of the chamber volume per minute with carbon dioxide added to the existing air in the incubation chamber. This is appropriate to achieve rapid unconsciousness with minimal distress to the animals.\n\t\tNote: Avoid sudden exposure of conscious animals to carbon dioxide concentrations >70% as this has been shown to be distressful.\nObserve each mouse/rat for lack of respiration and faded eye color. Maintain CO2 flow for a minimum of 1 min following respiratory arrest. Expected time to unconsciousness is usually within 2 to 3 min.\nIf both signs are observed, then remove the rodents from the cage; otherwise continue exposing them to CO2. If unconsciousness has not occurred within 2 to 3 min, check the chamber fill rate.\nTo verify the correct electrode placement, extirpate brains post mortem, e.g., following CO2 euthanasia and fix them in 4% paraformaldehyde in PBS (pH 7.4) overnight. Alternatively, perform cardiac perfusion of the animals using ice-cold phosphate-buffered saline (PBS; pH 7.4) followed by 4% paraformaldehyde (PFA) solution dissolved in PBS.\nPostfix brains for 2 - 4 hr in 4% PFA at RT followed by cryoprotection in 30% sucrose in PBS and store brains at 4 °C till further processing.\nUsing specimen matrix for cryostat sectioning, freeze brains onto a stereotactic block and cut 60 µm coronal slices using a cryostat. Mount slices onto glass slides, air dry, and stain with Nissl blue using standard techniques to visualize the branch canal and former electrode position.\n\t\tNote: This approach also reveals whether the surface electrodes have been placed to deep accidentally by leaving a minor impingement on the top of the cortex.\n7. Stereotaxic Deep Intracerebral EEG Electrode Implantation",
    "Pre-treat the scalp and skull of the animal as described in sections 6.1 - 6.2. Select the type of deep electrodes carefully, taking in consideration its material characteristics, e.g., diameter and impedance and possible connection to the transmitter's sensing leads.\n\tNote: Parylene coated steel and tungsten electrodes are commonly used. The electrode characteristics have to fit the individual experimental needs. If the electrodes are not provided sterile, they should be incubated in 70% ethanol before use. As the electrodes are coated for this experimental purpose, a heat-based sterilization is not applicable.\nDrill holes at the coordinates of choice as described in section 6 using the stereotaxic system. To target the murine CA1 region for example, which serves as an intensively investigated brain area, place the differential electrode at the following coordinates referring to bregma: caudal 2 mm, lateral 1.5 mm (right hemisphere) and dorsoventral (depth) 2 mm. Place an epidural reference electrode on the cerebellar cortex, e.g., bregma -6 mm, lateral of bregma 1 mm (left or right hemisphere) (Figure 4D, E).\n\tNote: The cerebellar electrode serves a pseudo-reference electrode on the silent region of the cerebellum. Stereotaxic coordinates can be derived from standard stereotaxic atlases for mice and rats.\nShorten the deep electrodes to the required length depending on how deep into the brain they will be inserted. Connect the extracranial part of the electrode to the stainless steel helix of the transmitter lead by bending both sections to a 90° angle in between.",
    "Clip the deep electrode to the sensing lead of the transmitter mechanically. Do not solder whenever possible as this can induce significant noise in the EEG recording. Expose the stainless steel helix of the transmitter lead by removing a short section of the outer silicone isolation at the tip of the transmitter lead using a sterile scalpel blade.\nRewire the lead of the transmitter to the deep brain electrode. Ensure a suitable and stable connection of both components (Figure 4F). Attach the implanted electrode (which is mechanically connected to the transmitter lead) to the vertical arm of the stereotaxic device.\nFix the electrode with glass ionomer dental cement (water based), which is extremely hard and gives strong adhesion to the underlying neurocranium. Leave the cement to dry for 5 min. Close the scalp using over-and-over sutures with non-absorbable 5-0/6-0 suture material. Alternatively, skin glue can be used.\nClosely monitor the quality of EEG recordings based on the electrode implantation side.\n\tNote: Ossification from the drilled holes can occur that has the capability to lift up the electrodes with time. This can result in reduced EEG quality due to EMG and ECG contamination and can thus limit the optimum recording duration. This is of special relevance for deep electrode placement.\nFor post-operative care and pain management, see section 8.\nValidate EEG electrode placement post mortem as described in section 6.13.\n8. Post-operative Care and Post-operative Pain Management\nDo not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency.\nDo not return an animal that has undergone surgery to the company of other animals until fully recovered.",
    "For post-operative pain management, choose a drug of one of the following groups: narcotic opioids, opioid agonists / antagonists, α2-agonists, local anesthesia and nonsteroidal anti-inflammatory drugs (NSAID). 55-60 Please note that due to the severity of the surgery a 3 day analgesic treatment is recommendable.\n\t\nIf using buprenorphine, administer the following dose: mouse: 0.05 - 0.1 mg/kg, i.p., s.c., every 6 - 12 hr; rat: 0.01 - 0.05 mg/kg, i.p., s.c., every 8 - 12 hr.\nIf using butorphanol, administer the following dose: mouse: 1.0 - 5.0 mg/kg, s.c., every 4 hr; rat: 2.0 - 2.5 mg/kg, s.c., every 4 hr.\nIf using tramadol, administer the following dose: mouse, rat: 10 - 30 mg/kg, i.p.\nIf using flunixin, administer the following dose: mouse: 2.5 mg/kg, s.c., every 12 hr; rat: 1.1 mg/kg, s.c., every 12 hr.\nIf using ketoprofen, administer the following dose: mouse: 5 mg/kg, s.c., every 12 - 24 hr; rat: 5 mg/kg, s.c., every 12 - 24 hr.\nIf using metamizole, administer the following dose: mouse, rat: 100 mg/kg, i.p., every 8 hr.\nIf using meloxicam, administer the following dose: mouse, rat: 1 mg/kg s.c., every 24 hr.\nIf using carprofen, administer the following dose: mouse: 5-10 mg/kg, s.c., every 12 - 24 hr; rat: 2.5 - 5.0 mg/kg, s.c., every 12 - 24 hr.\nIf using acetaminophen, administer the following dose: mouse: 300 mg/kg, p.o., every 4 hr; rat: 100 - 300 mg/kg, every 4 hr.\nIf using lidocaine (as adjunct analgesic), administer the following dose: mouse, rat: 1 - 4 mg/kg s.c.\nWhen using carprofen (rodent dosage 5 - 10 mg/kg s.c., diluted in 0.9% NaCl) for long-lasting post-operative pain management, perform the initial injection 10 - 15 min before the end of the surgical instrumentation and repeat for two subsequent days once a day.",
    "Postoperatively, feed moistened pellets in order to facilitate food uptake. Carefully observe food (~15 g/100 g/d; ~5 g/24 hr) and water (~15 ml/100 g/d; ~5 ml/24 hr) consumption.\nMonitor animals closely for the return of their normal postures and behaviors.\n\tNote: Systemic administration of antibiotics such as enrofloxacin or trimetroprim-sulphonamides is often recommended but not an absolute must unless inflammatory signs of meningitis or encephalitis at the sites of implantations are detected.\nGive mice at least 10 to 14 additional days to fully recover before starting EEG recordings for further analysis.\n\tNote: Specific experimental tasks may require longer recovery periods.\nFollow-up postoperative recovery after implantation by evaluating postsurgical development of body weight. A maximum reduction in body weight is normally observed around day 4 - 5 post surgery followed by a slight, but steady increase of weight during a 10 - 14 day recovery period.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}