{
  "id": 4721,
  "origin_website": "Bio",
  "title": "Two-event Transfusion-related Acute Lung Injury Mouse Model",
  "procedures": [
    "Preparation  All protocols using live animals must be approved by an Institutional Animal Care and Use Committee and must follow officially approved procedures for the care and use of laboratory animals. Furthermore, experimental animals treated with biohazard materials should be handled and disposed using recommended animal biosafety procedures. When appropriate, the person(s) handling the animals must have official certification for performing procedures on animals and for submitting protocols for ethical approval.   Weigh the animal on a balance (grams) in order to calculate the LPS dose required for each mouse.    Prepare LPS stock solution by diluting LPS with sterile water to a concentration of 0.1 mg/ml. Aliquot (500 µl) and store at -80 °C.   Desired LPS priming dose = 0.1 mg/kg. From the body weight of the mouse (measured in grams), convert this number to µl. Pipette this amount from the LPS stock solution to an Eppendorf tube and dilute to 150 μl final volume with sterile PBS. For example, for a 25 gram mouse, add 25 µl of LPS stock solution (0.1 mg/ml) to an Eppendorf tube and dilute to 150 µl final volume.   Prepare MHC Class I mAb or isotype control mAb (0.5-4.5 mg/kg) and dilute to 100 μl final volume.   Prepare a sterile heparin solution (4 units/ml) to flush the PE-10 tubing.   Load insulin syringe with attached needle with sterile heparin solution (4 units/ml) and insert needle into PE-10 tubing (6 inches; 15 cm) on one end, and attach a sterile 30 gauge needle on the opposite end (Figure 1).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150620/20150620201829_6499.jpg Figure 1. Representative setup for jugular vein cannulation      Transfusion-related acute lung injury model First event: immune priming with LPS  Immune priming is necessary to produce robust lung injury when using mice housed in pathogen-free barrier rooms (Looney et al., 2009).",
    "Twenty-four hours prior to challenge with MHC I mAb mice, inject mice with LPS (0.1 mg/kg, i.p.).   Second event: challenge with MHC I mAb All surgical procedures should be performed using standardized aseptic techniques and all surgical tools should be autoclaved following the surgery.   Anesthetize animals with Ketamine (50-80 mg/kg) and Xylazine (8-12 mg/kg) injected intraperitoneal using insulin syringes. The anesthetics may be mixed in the same syringe.    Place the mouse on a warming pad. Check the level of anesthesia using a paw pinch stimulus a few minutes after delivery of the anesthetics. Once adequate anesthesia is observed, immobilize the mouse in the supine position using adhesive tape.    Make a vertical cut (~0.5 cm) to the right of the trachea and isolate the right jugular vein (Figure 2A).   Carefully introduce the needle into the vessel. The needle, syringe, and PE-10 tubing should be filled with a heparin solution (4 units/ml). Aspirate blood from the jugular vein to verify intravascular placement of the needle (Figure 2B).   Remove the syringe with heparin solution and replace with an insulin syringe (with attached needle) that has been preloaded with the MHC Class I mAb vs. isotype control mAb.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150620/20150620201859_1340.jpg Figure 2. Isolation of right jugular vein (A), cannulation and aspiration of blood (B), and removal of needle and placement of cotton-tip applicator (C)    Flush the whole syringe content at a constant and uniform rate with particular care of not introducing any air bubbles.   Carefully remove the needle and apply a cotton-tipped applicator with slight pressure to prevent bleeding (Figure 2C). Pressure should be applied for at least 1 min.   Close the incision with 6-0 silk suture and apply post-operative care based on the institution’s animal care guidelines.",
    "Mice should be kept on a warming pad for the duration of the experiment and closely monitored for evidence of abnormal breathing.   Mice are killed at 2 h after injection of the mAb or when they appear moribund.   After carefully opening the thorax, collect blood from the right ventricle using a 25 gauge needle and a 1 ml syringe.   Remove the lungs by cutting the trachea being careful to not let pulmonary edema fluid escape."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}