{
  "id": 9028,
  "origin_website": "Jove",
  "title": "High-density Electroencephalographic Acquisition in a Rodent Model Using Low-cost and Open-source Resources",
  "procedures": [
    "The studies performed throughout this investigation were in agreement with the National Institutes of Health Guide for the Care and Use of Laboratory Animals and approved by the Institutional Animal Care and Use Committee at the University of Pennsylvania.\n1. Headpiece Design and Construction\nRemove every eighth row of pins from the 2 x 50 pin brick of a 100 position receptacle connector with a pair of tweezers by pushing the receptacle portion of the pin through the plastic brick.\n\tNote: Pins facing downward will be the orientation that will be referenced for the rest of the protocol. (Take note of this specifically in 2.6).\nCover the pins with a very light coat of nail polish to insulate and let the nail polish dry completely.\nRemove the nail polish from the tips of the pins with acetone and a small cloth.\nTrim the excess plastic of the 2 x 7's using a razor blade or wire-cutting pliers. This will result in 2 x 7 bricks that are insulated along the length of the pins and exposed at the pin tip. These will eventually become the transcranial EEG electrodes. Two 2 x 7 bricks are necessary for a complete chronic electrode array (Figure 1A).\nCut two 1 x 2 pin bricks for EMG signal recording. Use the same process of removing unwanted pins with tweezers and cutting the excess plastic away to create the 1 x 2 bricks. Make sure these 1 x 2's have a smooth side to them from the original 100 Position Receptacle as this distance will become the standard pin distance for each headpiece so a single adapter will work for all headpieces (Figure 1A).\nUse 2-part epoxy to attach the 1 x 2 pin piece to the 2 x 7 pin piece (Figure 1D).",
    "As both sets of pins must be in the same orientation, epoxy the 1 x 2 on the lateral side of both halves of the headpiece with the smooth sides of the 1 x 2 and 2 x 7 contacting each other. Align the 1 x 2 pinholes and pins with the posterior-most 2 rows of pins on the 2 x 7.\n\t\tNote: The two halves of the headpiece are not epoxied together. This allows for flexibility within the two halves of the headpiece adapter for easier connection during habituation and during experimental days (Figure 1E).\nLet the headpiece halves cure overnight. Upon completion, the headpiece is bilaterally symmetric. Each half consists of a 2 x 7 pin brick with a laterally attached 2 x 1 pin brick that is in line with the posterior most 2 rows of the 2 x 7 pin brick.\nPrepare wires for EMG signal recording. Single stranded, 31 G perfluoroalkoxy-insulated silver wire is used for EMG signal recording (Figure 1D). However, multi-stranded or other metal wiring can be substituted if desired.\n\t\nTo create thoracic EMG wires take a 3.0 cm long piece of perfluoroalkoxy-insulated silver wire and remove 1 cm of the plastic insulation from one end with a razor blade. Wrap the non-insulated wire around a pair of tweezers twice. Remove the wire from the tweezers and remove 25 mm of insulation on the non-looped end with a razor blade.\nTo construct cervical EMG wires, repeat the process with a 1.5 cm segment of wire. Two cervical EMG wires and two thoracic EMG wires are needed for a complete headpiece.",
    "Remove the lateral pin in the furthest anterior row of both headpieces, which corresponds to a stereotaxic coordinates of 3.3 mm anterior of Bregma and 2.3 mm lateral of Bregma, as there is no brain beneath this location as determined by a mouse brain atlas20 (Figure 2A).\nOn both headpiece halves, cut the pins of the 1 x 2 brick to the plastic base of the headpiece with a pair of wire cutters (3.0 mm from the tip of the pin) and solder the cervical EMG wire to the anterior pin and the thoracic EMG to the posterior pin.\n\t\nCheck that each pin is electrically isolated. Perform a continuity test with a digital multimeter by connecting the two leads of the voltmeter to different pins while in the continuity mode. Electrically isolated pins will not produce an audible beep with this multimeter test; however, electrically coupled pins will. Cover the soldered joints with nail polish and once dry, bend the EMG wires such that they are in parallel to the anterior/posterior axis with minimal lateral displacement.\nTrim pins to a relative length such that they match the surface profile of the brain.\n\t\nWith the aide of a mouse brain atlas, record ventral distance to brain surface from Bregma for each pin coordinate.20 The pin whose ventral distance from Bregma is the largest will serve as the indicator for pin trimming. This pin will not be trimmed while all other pins will be cut with respect to this maximal ventral distance pin (Table 1).",
    "Note: Pins can be grinded down to size but it must be done carefully as the friction between pin and grinding wheel can cause the pins of the headpiece to bend. If a pin is bent, use tweezers to straighten it out. An alternative to grinding the pins down to length is to trim them with a pair of wire cutting pliers.\nCover all of the pin tips with a silver solution using a silver solution pen and let dry. This step lowers electrode impedances to ≤30 kΩ, which increases the signal to noise ratio and simultaneously eliminates the rough edges caused from pin trimming, therefore decreasing chances of tissue damage and accelerating recovery from surgery. A completed headpiece half weights approximately 0.5 g.\n2. Adapter Construction and Channel Mapping\nCut the connector wires of a 36 Position Dual Row Male Nano-Miniature Connector to a uniform length of 2 or 3 cm using a razor blade. For each wire, strip off 2.5 mm of insulation from the end and tin the exposed metal for each wire. Make sure when tinning to have a single, thin strand of tinned wire for each nano adapter wire as this is crucial to isolate pins. Snip off the stripped insulation with wire-cutting pliers (Figure 1C).\nCreate a matching male/male connector to the headpiece using the Conn Strip Header 2 x 50. Cut two 2 x 7's and two 2 x 1's from a 2 x 50 brick. Remove unwanted pins from the 2 x 50 brick by breaking off one of the male pins, and then push the unbroken second half of the same piece off the connector with a pair of tweezers (Figure 1B).",
    "Note: One side of these pins will serve as adapter pins to plug into each headpiece, while the other half will be soldered to the tinned nano connector wires. Be sure to have the flat plastic edges of the 2 x 1 and 2 x 7 touching to guarantee proper mating of the male/male connector with the headpiece created in step 1.\nSolder on one of the ground/reference wires from the nano connector to the desired ground/reference pin. Ground and reference wires are tied together on the RHD2132 amplifier chip. Use the single pin that is 0.60 mm anterior to Bregma and 1.00 mm lateral of Bregma as both reference and ground. (Left headpiece, medial pin of the third most anterior row; however, any other pin could be assigned if preferred, Figure 2.) Note that it is possible to separate ground and reference on the amplifier chip by removing the 0Ω resistor that ties ground and reference together if isolating the two is desired.\nSolder the tinned nano connector wires to the same side of the male/male connectors as the ground/reference pin connection. Each wire maps to a specific channel, so channel setup can be completed at this time. Channel map diagrams for the amplifier headstages are found on the Open Ephys Wiki site (https://open-ephys.atlassian.net/wiki/display/OEW/Home). Solder the corresponding wire whose channel is known to the respective pin to achieve the desired mapping.\nCut off unused wires at the base of the nano connector with the wire cutting pliers.\nUse a voltmeter to ensure that each pin is electrically isolated from all other pins. Once isolation is confirmed, apply a thin coat of nail polish around each soldering joint to further insulate each pin.",
    "Using 2-part epoxy, reinforce the matching nano adapter to the bilateral 2 x 7 and 2 x 1 pins on the male-male bricks.\n\tNote: There will be two halves to this single adapter that match the pin arrangement of the headpiece halves created earlier. It is critical to make sure that the medial portion of each half of the adapter does not have excess epoxy overflowing the plastic edge of the male/male connector, as this will prevent both halves of the headpiece being plugged in simultaneously. Do not allow any epoxy to flow to the underside of the pin adapter portion of the adapter, as this would also prevent proper connections. Use the 2 headpiece halves as a mold for proper connector pin alignment.\nEpoxy both halves of the adapter and epoxy the base of the nano connector to increase its durability. Be sure to cover all soldering joints with epoxy. Let the adapter cure overnight.\nConfirmation of proper channel mapping can be performed using impedance measurements in the Open-Ephys graphical user interface (GUI). A completed adapter weighs approximately 1.3 g (Figure 1F).\n3. Surgery\nPrepare a sterile surgical field.\nWear sterile gloves and other personal protective equipment as required. Sterilize tools in an autoclave. Sterilize the stereotactic frame with a 1.0 mM chlorine dioxide solution. Spray the solution onto the frame and wait 5 min before rinsing with sterile water.\nTo sterilize implantable headpiece parts, spray the components with a 1.0 mM chlorine dioxide solution, and wait 5 min before rinsing with sterile water. Place the now sterile implantable hardware into a sterile petri dish.\nObtain a pre-surgical weight for the mouse, then anesthetize the mouse in a 200 ml induction chamber using 1.5-2.0% isoflurane in 100% oxygen. Use a flow rate into the chamber of roughly 500 ml/min.",
    "Confirm loss of righting reflex by rotating the induction chamber. Remove the mouse from the induction chamber and place into the nose cone on the stereotactic frame without completely securing the mouse's head with the ear bars. Continue to monitor for proper depth of anesthesia by toe pinch assessment while also assessing vital signs.\nMaintain core body temperature at 37 °C with a closed-loop temperature controller, such as a rectal probe and heating pad system. Cover the eyes of the mouse with ophthalmic eye ointment before trimming off the fur on the top of the skull using curved scissors or clippers. Disinfect the head with betadine and allow the betadine to dry completely before proceeding.\nAdminister analgesics and antibiotics along with fluids intraperitoneally. For a 25 g mouse, 0.5 mg cefazolin, 0.125 mg meloxicam, 0.5 ml saline, and 2.5 μg buprenorphine q 4-6 hr prn.\nInject 250 µl 0.25% bupivacaine subcutaneously along midline on the head, and inject 100 µl 0.25% bupivacaine subcutaneously on both zygomatic arches of the mouse.\nSecure the mouse in the stereotaxic frame and expose the skull.\n\t\nSecure the head of the mouse with the stereotaxic ear bars to the stereotaxic frame. Ensure that the mouse is at a surgical plane of anesthesia by confirming the absence of the toe pinch reflex. Create a 1.5-2.0 cm incision along with a No. 11 disposable scalpel along midline of the skull. The incision will start from between the eyes and continue posteriorly to the occiput.",
    "Expose the skull by spreading the skin laterally with micro clamps. Reduce isoflurane concentration from 2.0% to a concentration that maintains a surgical plane of anesthesia, but do not reduce to lower than 1.0% isoflurane in 100% oxygen. Pre-operative analgesia reduces the amount of inhaled anesthetic needed to maintain a surgical depth of anesthesia, and can lead to faster recovery and improved survival outcomes.\nLevel the skull and drill burr holes.\nIdentify Bregma and zero the stereotactic coordinates at Bregma, which becomes the origin of the coordinate system. To level the skull in the medial/lateral axis, move a leveling probe attached to a stereotaxic manipulator arm 1.50 mm laterally in both directions from Bregma and confirm that the dorsal/ventral depth is less than 0.05 mm when the probe contacts the left and right sides of the skull.\n\t\tNote: The 10 µm resolution of the dorsal/ventral manipulator arm used in conjunction with a digital coordinate display simplifies leveling. Leveling the anterior/posterior axis about Bregma follows the same technique. The difference in the ventral distance for contacting Bregma and Lamda should also be less than 0.05 mm.\n\t\t\nAdjust the skull until leveling is complete in both directions so that the transverse plane is parallel to the ground. This allows for true stereotactic coordinates as seen in the mouse brain atlas.20",
    "With a 0.5 mm diameter micro drill bit within a stereotaxic drill, drill burr holes from 3.30 mm anterior to 4.50 mm posterior to Bregma in 1.30 mm increments at 1.00 mm laterally to the midline on both halves of the skull. For the 2.30 mm lateral columns of electrodes, drill burr holes from 2.00 mm anterior to Bregma to 4.50 mm posterior to Bregma in 1.30 mm increments on both sides of midline (Figure 2). The high accuracy and precision that is required for this drilling operation is simplified by the 10 µm resolution of a digital stereotaxic manipulator arm.\n\t\tNote: In order for the pins of the headpiece to properly be implanted, the skull of the mouse must be securely in place within the stereotaxic frame. If the skull moves during drilling, misalignment of the headpiece and burr holes may ensue.\nImplant the headpieces.\nWith straight forceps, prepare EMG wire tunnels for the thoracic EMG wires. Burrow 2.5 cm between the skin and muscle in the back for both the left and right EMG wires. Insert the thoracic and cervical EMGs into the cavity created with the straight forceps first, and then maneuver the EEG brick with curved forceps such that the pins align with the previously drilled burr holes.\nApply slight pressure onto the headpiece and wiggle the pins into the skull. Pin diameter is 0.46 mm. With insulating nail polish, the pins will fit tightly in the drilled burr holes. The headpiece will be stable once it is appropriately inserted. Adjust EMG wires to final positions. Repeat the same process for the headpiece on the other side.\nSecure the headpiece in place using dental cement.",
    "When both headpieces are set in place, mix 1:1 ratio of methyl methacrylate with its crosslinking compound. Apply the mixture such that it covers the exposed skull, nail-polished parts of the pin electrodes, and proximal portion of EMG wires, but does not cover the female receptacles of the headpiece.\nBe sure to not get cement on fur. Do not allow for ridges of cement to form that the mouse will be able to grab onto. Ensure sufficient time for the cement to dry, and then remove the mouse from the stereotactic frame. The total weight that the mouse will have to carry is from the 2 halves of the headpiece and the securing cement is approximately 1.2 g.\nPlace the animal in a clean recovery area.\nMaintain core body temperature with a heating pad. Monitor the mouse until it regains all postural reflexes, signifying emergence from anesthesia. Individual housing is recommended for long-term recovery.\nDaily monitoring for a minimum of 3 days following surgery is recommended with interventional analgesia. Allow 10-14 days of recovery post-operatively before starting a tethered habituation period.\n4. Habituate Animals to Tethering\nConnect the adapter to the mouse using a mouse head restraint (Figure 1G-H). Hold onto opposite corners of the headpieces that are cemented into place with curved hemostats once the mouse is restrained and slowly insert the adapter pins into the implanted headpiece on both sides.\nConnect the 32 channel amplifier to the adapter (Figure 1H). Be sure to align the logos on both the adapter and amplifier in a consistent orientation for both the adapter and the amplifier to prevent channel-mapping errors. Connect the amplifier to a RHD2000 standard serial peripheral interface (SPI) cable. This cable will connect to the acquisition system for signal recording.",
    "Place the mouse within a chamber that has a cantilever arm installed on the chamber wall. Attach the SPI interface cable to the cantilever arm and adjust the tension in the cantilever arm to counteract the weight of the tethered cable. The mouse is able to move freely and is habituated for an hour a day the week before recording.\nTo disconnect the mouse, simply unplug the cable and adapter from the mouse while using a flat stainless steel micro spatula to aide in disconnecting the adapter from the mouse.\n5. Signal Extraction System Setup/Signal Recording\nPlug the constructed adapter into the headpiece of an implanted mouse. Connect a headstage amplifier to the adapter and attach a standard SPI interface cable to the amplifier and to the acquisition board. Have the SPI cable attach to a properly tensioned cantilever so that the additional weight on the mouse's head is minimized.\nPlace a local Faraday cage, created using conducting mesh or aluminum foil, around the headstage and ground the local Faraday cage.\nObtain electrode impedances before the beginning of each recording by selecting a 30 kS/sec sampling rate and measure impedances via the module in the GUI. An impedance value less than or equal to 10 kΩ for an individual pin is required for confirmation of proper electrode contact. Higher impedance values result in rejected data from that electrode.\nFor recording, create a signal chain of Rhythm FPGA, Bandpass Filter, and LFP viewer in the GUI. It is recommended to select a sampling rate of 1.00 kS/s, bandwidth of 0.1-7,500 Hz and deselect DSP. Set the Bandpass filter to 0.1-250 Hz and display the channels by opening the LFP viewer. 250 and 400 µV channel amplitudes with draw method selected best visualizes the data.",
    "Begin recording using the GUI. Create a new folder for each recording and set the path for saving files to that folder. To begin a recording simply hit record. All 32 channels from the the connector are recorded by default, but unwanted channels can be unselected by clicking on the right side of the Rhythm FPGA module before the beginning of the recording.\nImport data into Matlab for analysis. There are a multitude of open-source toolboxes that can be used to help in analysis."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}