{
  "id": 17182,
  "origin_website": "Jove",
  "title": "Erythrocyte Sedimentation Rate: A Physics-Driven Characterization in a Medical Context",
  "procedures": [
    "Blood sample collection and experiments were approved by the \"Ärztekammer des Saarlandes\", ethics votum 51/18, and performed after informed consent was obtained according to the Declaration of Helsinki. Standard measurements should be performed with ethylenediaminetetraacetic acid (EDTA)-anticoagulated blood (standard EDTA concentration of 1.6 mg/mL blood, European norm NF EN ISO 6710), in Westergren tubes. The volume required to fill the Westergren tube depends on the manufacturer (as lower parts sometimes contain a wider reservoir); The volume should be about 1 mL of full blood, and 800 µL for the tubes indicated in the Table of Materials. The method described below is however valid no matter the specific suspension and container shape, as long as the hematocrit of the probed samples is higher than 25%16. Volumes, containers, suspending medium, and additives should therefore be selected according to the specific objectives of the performed research.\n1. Experiments and measurements\nNOTE: Record the sedimentation rate of the sample every minute.\nSample preparation (if required): If a control hematocrit or suspending liquid is required, start by washing the cells and preparing the samples (as an example, we show how to prepare samples with various fibrinogen levels, by mixing autologous serum and plasma). Serum can indeed be approximated as fibrinogen-free plasma26,27, and can be used in order to decrease the aggregation of RBCs, in otherwise physiological conditions. In order to prepare several samples, collect the blood in standard EDTA tubes of 9 mL and the serum in standard serum tubes (with silica beads as clotting activators) of 9 mL.",
    "Centrifuge the blood samples (i.e., 9 mL of standard EDTA and serum tubes in the chosen example) at 3,000 x g for at least 7 min, for optimal compaction of the packed erythrocytes. Replace the supernatant with PBS or the desired suspending liquid, if a sufficient quantity is available. If it is simply required to control the hematocrit in autologous plasma, proceed directly to step 1.1.3. Otherwise, gently mix after inclusion of the supernatant for washing.\nRepeat three times. Perform the last wash with the desired suspending liquid in any case.\n\t\t\nIn the chosen example, prepare mixtures of autologous plasma and serum with determined proportions (e.g., 25%/75%, 50%/50%, or 75%/25% of plasma-serum volume fraction). For example, when preparing 2.5 mL of the 25%/75% plasma-serum mixture, add 0.625 mL of plasma to 1.875 mL of serum.\nExtract the required volume of packed cells and suspend it in the desired liquid. Process the packed cells as a highly viscous liquid (using standard pre-pipetting and/or reverse-pipetting or a positive displacement pipette28). In the chosen example, for a 4 mL sample at a hematocrit of 45%, suspend 1.8 mL of packed cells within 2.2 mL of the plasma-serum mixture.\nIf the hematocrit of the sample is not controlled, determine it by high-speed microcentrifugation (other standard methods are also suitable).\n\t\nExtract the required amount of sample for hematocrit determination: fill the micro-hematocrit capillaries by immersing its lower tip in the liquid. Stop it by covering the top opening when the required amount of sample rises in the tube by capillary suction.\nSeal the capillaries with sealing wax. Place them in the micro-hematocrit centrifuge and run it at 15,000 x g(12,000 rpm) for 5 min, or according to the manufacturer's instructions.\nRead the hematocrit level on the capillary and write it down for reference.",
    "Set up a camera for recording the samples' sedimentation. To avoid overloading the memory or draining the battery, power the device from the mains and save the pictures directly to a computer or external hard drive.\n\t\nSet up a steady camera in front of the holder where the ESR tubes will be left at rest. Use a white, illuminated background (white sheets of paper in the background work perfectly).\nUsing empty Westergren tubes, preferably without markings, set the focus and the field of view of the camera to obtain the highest resolution where the samples will be placed. Preferably, ensure that the borders of the pictures are aligned in the vertical and horizontal direction.\nTake a picture of a scaled tube to extract the pixel resolution. The use of RGB pictures is recommended.\nSet the light and the exposure time of the camera to have a white background, but no saturation. The example in Figure 1 has been obtained using a Canon EOS M50, with an exposure time of 1/15s, an aperture of F8.0, Tungsten white balance, in single shot mode with manual focus, and an ISO speed of 1,000.\nPrepare and place the ESR tubes.\n\t\nFill the bottom container of the Westergren tube with the volume corresponding to the manufacturer's instructions. Insert the Westergren tube in the bottom container as indicated by the manufacturer.\nAs soon as the first tube is ready, place it in the holder and start the camera recording. Recording one picture every minute usually gives a good resolution of the ESR kinetic curve.\nPrepare and place the next samples. Make sure not to stand in front of any sample when a picture is taken.",
    "Let the measurements run for at least 2 h, in order to compare with standard measurements at 30 min, 1 h, and 2 h. However, it is also better to see the saturation and arrest of the sedimentation. For healthy samples, or in case of inflammation, recording the samples overnight, between 12 h and 24 h, is more than sufficient since the curvature of the fastest samples is visible within 3 h13,19. However, if a condition decreases the sedimentation velocity, as a decrease in fibrinogen concentration does (i.e., in the chosen example, high serum volume fraction), recordings of 50 h or more might be required to obtain the most accurate information16,19.\n2. Image analysis\nNOTE: Once the images are recorded, extract the ESR curve. An example of Matlab code is provided as Supplementary File 1 (MatlabCodeImageAnalysisSampled.m).\nSelect or identify a region of interest (ROI) where only one tube is visible, the lower border being located under the lowest position of the erythrocyte cell-free plasma interface but within the sample (see Figure 1A, B). If required, rotate the picture so that the vertical direction is aligned along the first component of the picture.\nConvert the ROI of the RGB picture into a gray-scale picture or matrix Gr. Usually, combining the three-color channels (red [R], green [G] and blue [B]) as Gr = 2 * R - B - G is very efficient with a clear background (see Figure 1C and MatlabCodeImageAnalysisSampled.m lines 121-128).",
    "Binarize the picture. For a healthy sample, using the Otsu threshold29 usually gives a consistent result (see Figure 1D and line 133 of MatlabCodeImageAnalysisSampled.m). For samples with a high hematocrit or with some hemolysis, it might be better to adjust it manually or use another automatic method (as done in lines 129-131 of MatlabCodeImageAnalysisSampled.m), depending on the exact contrast obtained between the various phases inside the tube.\nObtain the average of the pixel (or elements) values of Gr along the horizontal direction. This step minimizes the noise and efficiently averages the possible interface irregularities (see Figure 1E and MatlabCodeImageAnalysisSampled.m line 137).\nBefore computing the variations, smooth the curve with a moving average, especially if the tubes contain some horizontal markings (see Figure 1F). For the provided examples, a moving window of ~2.5 mm (50 pixels) was used for this process (see line 138 of MatlabCodeImageAnalysisSampled.m). Then, identify the interface position as the point with the highest intensity variation (see Figure 1G).\nRepeat for each picture and each sample. For each sample, save the positions of the interface along time in an appropriate format to fit the physical model with any suitably fit software.\n3. Fitting of the physical model",
    "Using any suitably fit software, knowing the hematocrit and the initial height of the blood column h0, find the values of the delay time t0, the dimensionless time γ, and the final packed volume fraction Φm of the erythrocytes that minimizes the sum of squared residual deviations for the physical model17. A Matlab code (ShapeAnalyzerIntegrated.m) is provided as Supplementary File 2 as an example of how to perform such a fit. See Supplementary File 2 for further instructions. As described elsewhere16,17, erythrocytes at physiological hematocrit sediment as a soft particle gel, where the important physical parameters are the difference in density between the plasma and RBCs of the donor Δρ, the RBC characteristic diameter rRBC, the plasma viscosity at room temperature η, and the donor's hematocrit Φ. Using these parameters, and assuming that the gravitational stress is the main driving process for the plasma to flow upward through the porous network formed by the erythrocytes after a delay time t0, one obtains the temporal evolution16,17:\nimgsrc://cloudfront.jove.com/files/ftp_upload/64502/64502eq1v6.png\n\twith imgsrc://cloudfront.jove.com/files/ftp_upload/64502/64502eq2v6.png, imgsrc://cloudfront.jove.com/files/ftp_upload/64502/64502eq3v6.png, and imgsrc://cloudfront.jove.com/files/ftp_upload/64502/64502eq4v6.png being the average disk radius of an erythrocyte. An example of a Matlab code performing this is provided as an attachment (ShapeAnalyzerIntegrated.m fits the function defined in SedimFit.m [Supplementary File 3]). Alternatively, G/γ can also be used directly as a fit parameter with units of 1/t.\nOnce the quantitative curve is extracted from the picture, save the physical parameters of the sample. Traditional ESR values at 30 min, 1 h, or 2 h can still be extracted from the curve for reference (see ShapeAnalyzerIntegrated.m lines 123-132).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}