{
  "id": 925,
  "origin_website": "Nature",
  "title": "Lysophosphatidylcholine-induced demyelination model of mouse",
  "procedures": [
    "_Pre-operation:_\n1. Dissolve LPC in sterile PBS to achieve a final concentration of 1% weight per volume \\(w/v). The solution can be aliquoted and stored at -20°C until use.\n  2. Prepare the capillary for LPC injection. Pull the glass micropipette using the Micropipette Puller using following settings: Heat, 815; Pull, 30; Velocity, 50; Delay, 200; Pressure, 200.\n  3. Remove the needle tube of 23-guage injection needle from plastic needle hab. Insert the needle tube \\(non-needle tip side) into the glass micropipette \\(intact side) to a depth of slightly less than 1 cm. Bond the needle tube and glass capillary with adhesive \\(Fig. 1a). Don’t move the apparatus until the adhesive cures. \n  **TIP:** Keep straight of needle tube after removal from injection needle. A bent needle tube prevents the adequate volume of LPC injection. \n_LPC injection:_\nAdminister anesthetics at least 30 min before surgery. Our labotratory utilizes a mixture of \\(Dormicam, 4 mg/kg; Vetorphale, 5 mg/kg; Domitor 4 mg/kg) administered by intraperitoneal injection.\n**TIP:** Other anesthetics may be used, but timing of injection and dosage should be optimized prior to performing surgery in order to ensure that animals are properly anesthetized.\n1. Set up the instrument for LPC injection. Insert the needle tube \\(needle tip side) conjugated to the glass capillary into the Polyethylene tube. Thirty centimeters of Polyethylene tube is sufficient. \n  2. After connecting the Polyethylene tube with a 1 ml syringe using a 23-guage injection needle, fill the injector \\(capillary and tube) with sterile water by using 1 ml syringe. Subsequently, detach the connection of the 1 ml syringe with Polyethylene tube, and connect the tube with a Microsyringe filled with sterile water.\n  3. Hang the glass capillary on the Stereotaxic Micromanipulator \\(Fig. 1b).\n  **TIP:** Cut the tip of capillary if the tip is too thin.",
    "4. Mouse surgery. Verify that the mouse anesthetized state by checking reflexes using a hind-paw pinch. Shave dorsal body hair and disinfect the skin by iodine tincture. Incise the dorsal skin vertically \\(Fig. 1c) and expose the vertebral column by cutting the muscle on the column \\(Fig. 1d).\n  5. Carefully remove the bones making up the spinal column \\(laminectomy) using micro forceps \\(Fig. 1e).\n  6. Place the mouse on the plate of the Stereotaxic Instrument \\(Fig. 1f).\n  7. Absorb LPC into the capillary. Drain the water by pushing the plunger of the Microsyringe. \n  **TIP:** Keep the filling water in the glass capillary and Polyethylene tube. \n8. Pull back the plunger on the Microsyringe to the 0.8 μl mark. Confirm the entering air on the tip of capillary.\n  9. Drop the proper quantity of LPC solution on parafilm \\(3 - 4 μl). Place the parafilm which put LPC solution under the tip of glass capillary which is set on Stereotaxic Micromanipulator.\n  10. Touch the tip of the glass capillary to LPC solution. Pull back the plunger on the Microsyringe to the end of taking LPC \\(Fig. 1b). \n  **TIP:** Do not suck air into the glass capillary. Success of drawing LPC into the glass capillary is confirmed by the moving the bubble which is formed between LPC solution and water. If it is difficult to take LPC solution into the capillary, cut the tip of capillary to draw the liquid more smoothly.  \n11. Before LPC injection, cut the meninges around the target area of LPC injection using a 26-guage injection needle. \n  **TIP:** Don’t damage the blood vessel which runs on the surface of the spinal cord.",
    "12. Insert the glass capillary into the spinal cord. To cause demyelination of the corticospinal tract, a descending motor tract that mainly runs through dorsal column in mouse, insert the glass capillary to 0.5 mm depth from the surface of dorsal spinal cord tissue. \n  13. Inject 2 µl of 1% \\(w/v) LPC into the dorsal funiculus of the thoracic spinal cord by pushing the plunger of Microsyringe. To prevent back flow of LPC, take at least 2 minutes for LPC injection. \n  14. Withdraw the glass capillary slowly. Sew up the fascia to cover the spinal cord tissue by surgical suture. Close the cut skin and disinfect the skin by iodine tincture.\n  **TIP:** To visualize the demyelination, immunohistochemical analysis of spinal cord sections obtained from the mice which received LPC injection may be helpful. Demyelination and subsequent remyelination can be observed around the site of LPC injection \\(Fig. 2). Confirmation of successful LPC injection into the dorsal spinal cord can also be detected by the behavioral assessment \\(see below).\n**Behavior assessment:** \n_A. Beam walking test_\n1. Assemble the equipment for the beam walking test. Fit the wooden beam \\(1 m long) with the appropriate width into the frame, and place the box for the mouse to enter at the edge of the beam. The height of the beam is 15 cm from the ground \\(Fig. 3a and b).\n  **TIP:** Keep the beam horizontal. \n2. Place the mouse at the edge \\(opposite of box), and allow it to walk on the beam toward the box. Usually the mouse should perform three separate walks per trial.\n  **TIP:** Record the mouse walking from behind using a video camera. \n**TIP:** We usually subject the mice to pre-training sessions \\(three walks at a time, 2 days).",
    "3. Give the score of every footstep of each hindlimb according to the following criteria: 0 = normal, no footslip; 1 = mild footslip, in which a part of foot is seen below the surface of the beam; 2 = severe footslip, in which whole foot is seen below the surface of the beam \\(Fig. 3c). Total scores were created by summing the individual scores. Obtain the data by taking the average of three trials per beam per mouse \\(Fig. 3d) \n  \n_B. Ladder walking test_\n1. Fit the ladder \\(1 m long) into the frame \\(Fig. 3e), and place a refuge \\(home cage) at the end. The ladder should be positioned 15 cm from the ground.\n  2. Insert the metal rung \\(3 mm diameter) to create a floor surface with a minimum distance of 6 mm between rungs. \n  3. Place the mouse at the start of ladder, and walk on the ladder toward home cage \\(Fig. 3f). \n  **TIP:** Change the arrangement of metal rung, which are not spaced equally, for each trial. \n**TIP:** We usually subjected the mice to pre-training sessions \\(three walks at a time, 2 days).\n4. For the test, let mouse transverse the ladder 3 times per trial. \n  **TIP:** Record the mouse walking by using video camera. Position the camera at a slight ventral angle to record the movement of all limbs which are reflected by the mirror at the bottom of ladder.",
    "5. Give the score of every footstep of each hindlimb according to the following criteria: 0 = normal, no footslip; 1 = mild and severe footslip, in which a part of foot or whole foot is seen below the surface of the rung \\(Fig. 3g). Total scores were created by summing the individual scores. Obtain the data by taking the average of three trials per walk per mice \\(Fig. 3h)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}