{
  "id": 17649,
  "origin_website": "Jove",
  "title": "A Syngeneic Murine Model of Endometriosis using Naturally Cycling Mice",
  "procedures": [
    "NOTE: The use of animals in this study was approved by the Institutional Animal Care and Use Committee (IACUC) at the Cleveland Clinic Lerner Research Institute. All publicly available animal care and use standards were performed following guidelines by the National Institutes of Health. This procedure is utilizing aseptic techniques. The Petri dish is sterile. The PBS/saline used is sterile. The surgical instruments for necropsy and tissue dissection are sterilized via autoclave. We use 70% EtOH on the instruments between animal cases (if more than one per session) to decrease contamination.\n1. Preparation of donor and recipient mice (see Figure 1)\nEnsure that appropriate approval is in place to work with laboratory animals.\nDetermine the strain of mouse. In these experiments, wildtype and mutant mice having a C57BL/6J background were utilized, but investigators using similar models report success with other mouse strains such as BALB/c mice10. In addition, donor and/or recipient mice can utilize reporter systems, such as GFP or RFP mice (see Figure 2 and Figure 3).\nFor timing of the endometrial tissue transplant, ensure that the donor mice are between 22-24 days old at the time of gonadotropin injection. This ensures that they are reproductively naïve, e.g., not yet begun estrous cycling.\nEnsure that the recipient mice are reproductively intact (no prior ovariectomy) between 2 to 4 months of age. While not required, it is recommended to place urine-soaked bedding from a male mice cage periodically in the recipient's cage to facilitate ongoing estrous cycling and again at 72 h prior to endometrial tissue transplant.",
    "NOTE: This will not ensure synchronization of estrous cycle of the recipients, as the placement urine-soaked bedding is highly dependent on the amount of male bedding used and has variable results. If synchronization of the estrous cycle is desired, three consecutive subcutaneous injections of 100 ng/100 µL estradiol will bring all animals to the estrous phase. While we found no difference in lesion induction based upon phase of estrous cycle, other groups have found the cycle phase to be important10.\nSubcutaneously inject Pregnant Mare Serum Gonadotropin (PMSG, 2 IU diluted into 200 µL) into donor mice subcutaneously using a fine needle (25-27 G recommended).Do not give PMSG to recipient mice, as it will trigger ovulation and subsequent high progesterone environment, which is less receptive to endometriosis formation.\n\tNOTE: Prior mouse models have utilized either PMSG or estrogen to stimulate endometrial proliferation in the donor mice prior to endometrial harvest23. PMSG is recommended for the following reasons: The half-life of PMSG is 40 h whereas the half-life of 17-beta-estradiol is only 2 h. Utilizing a single subcutaneous injection of PMSG in the donors 40 h prior to procurement of endometrial tissue provides a sustained duration of exposure to gonadotropin stimulation, which acts to stimulate endogenous estrogen. Many preparations of exogenous estrogen require multiple injections to adequately prime the endometrium.\nFollowing PMSG injection, schedule necropsy, procurement, and transplant into the recipient between 38-42 h. Time the endometrial tissue harvest following gonadotropin injection to ensure collection of tissue before ovulation, which occurs at 42 h post injection. Ovulation produces a high progesterone (P4) environment, which would reduce lesion establishment.\n2. Procurement of donor mouse endometrial tissue",
    "After euthanasia of donor mouse (using CO2 chamber followed by cervical dislocation), spray the abdomen with 70% ethanol solution; this serves to reduce contamination of the procured tissue from skin flora and from dislodged hairs. With dissecting scissors, make a shallow transverse snip at midline through the skin and subcutaneous tissue. Then grasping each side of the skin incision, use blunt traction to open the abdomen.\nIdentify the uterus. Before removing the uterus, trim away adjacent connective tissue. Transect each uterine horn just below their respective fallopian tube and then transect the cervix to remove the entire uterus en bloc.\nAfter removal from the abdominal cavity, inspect the uterus carefully and remove any additional peripheral fat or connective tissue. Place the uterus in a droplet of cold PBS on a Petri dish. Determine and document the combined mass of the entire uterus.\nTransect each horn from the uterus fundus, making the transection as close to the fundus as possible so as to maximize the length of each horn. Using the aid of a dissecting microscope, place one blade of the dissecting scissors inside the lumen of the first horn, then cut along the major axis of the tube. Carefully open the tube, keeping in mind which side is the serosa and which side is the epithelium.\nPut 500 cc of saline or PBS on a new Petri dish; the liquid will stay together due to surface tension.\nThen, perform fragmentation of the uterus in a uniform manner. It is better to have fewer larger lesions than many smaller lesions. Begin by separating off the epithelium from the myometrium by grasping the endometrial layer and peeling it away.",
    "Alternately, simply fragment the tissue without separating off the myometrium (as long as the epithelial side is fully exposed), but retaining the myometrium lessens the physiologic relevance of this model to human disease. Ensure that fragments are as large as possible but small enough to pass through an 18 G needle; (1 mm x 1 mm is recommended).\nCollect 10-12 of these 1 mm x 1 mm fragments from the first horn (which roughly corresponds to 40 mg tissue in the C57BL/6J mice). Place collected fragments into the liquid collection.\nPerform the same steps for the other uterine horn for a total of about 24 fragments per mouse. Document the total number of fragments.\n3. Peritoneal injection of tissue fragments into recipient mouse\nAspirate the suspended 1 mm x 1 mm fragments using the blunt end of a 1 cc syringe; the total volume should be 1 mL.\nAttach an 18 G needle to the full syringe and load the fluid into the needle. Consider a mock injection back into the Petri dish to ensure that all the tissue will pass through the needle.\nTake the recipient mouse. Either before or after IP injection, obtain a vaginal smear of the recipient mouse for estrous cycle documentation (10 µL of saline using the bulb syringe at the vaginal orifice and plated on the glass slide with the coverslip).\nPerform intraperitoneal injection of the fragments with the syringe at a 45 degree angle, taking care to not inject subcutaneously.\nIf fragments remain after injection, draw an additional 200 µL of the fluid into the syringe for injection to ensure that all the fragments are successfully injected intraperitoneally.\nOnce assured of no bleeding or complications, place the recipient mice back in their cages and feed a normal diet.\n4. Harvest of endometriotic lesions",
    "Euthanize recipient mice at approximately 21 days following fragment injection post-transplant.\n\tNOTE: From experience and from discussion with collaborators using similar models, the maximum lesion size and number occur at approximately 3 weeks post-transplant; after 3 weeks, lesions begin to regress in size. The IACUC approved method of euthanasia is used. \nFollowing euthanasia and cervical dislocation, spray the animal's abdomen with 70% ethanol and tent the skin to cut superficially with dissecting scissors. Incise the skin and subcutaneous space with scissors to bluntly open the abdomen.\nBefore any further dissection is undertaken, a complete survey for gross lesions is performed, with size measured by calipers and documented as to their anatomical region (see below).\nPerform complete collection of three distinct anatomic regions en bloc (regardless of whether or not lesions can be appreciated grossly). If lesions are seen in other regions (e.g., bowels), these should be ignored and not collected unless the lesion traverses one of the three areas below.\n\t\nA = abdominal wall/peritoneum (can either be flattened into a cassette or rolled up, as long as consistent between samples).\nB = pancreas and mesenteric fat.\nC = parauterine connective tissue and fat (white glistening tissue that surrounds the uterus but does not involve any organs other than the bladder; take care to not mistake the bladder for a lesion).\nPlace each dissected area in a cassette, appropriately labeled, and place it into formalin and process as per lab protocol for histologic sectioning.\nSection formalin blocks in two slides (D1 and D2) per tissue area at two uniform depths.\n5. Scoring of endometriotic lesions\nScan (at 40x magnification) and archive slides.",
    "Use digital slide reading software, define the longest distance (X) between edges of an endometriotic lesion-whether the edge consists of glands or stroma-and mark it. A continuous lesion is defined by glands surrounded by stroma; the line does not necessarily traverse only endometriotic tissue (as in the case of determining endpoints on an irregularly shaped or undulating focus of endometriosis) but the two end points need to be connected by continuous stroma and/or glands (see Figure 4).\nMake a second line (Y) 90 degrees across the first line, with the length of the second line determined following the rules above.\nIf multiple non-contiguous lesions are encountered, give each their own X and Y measurements.\nCalculate the final score for each slide as the summation of areas (X*Y) of each lesion.\nTake the larger of the scores from the two slides (D1 vs D2) as the final score for that region (A, B, C).\nTotal the scores from each region to give the final microscopic score for that animal.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}