{
  "id": 10987,
  "origin_website": "Jove",
  "title": "The Use of the Ex Vivo Chandler Loop Apparatus to Assess the Biocompatibility of Modified Polymeric Blood Conduits",
  "procedures": [
    "1. Modifying Polymeric Surfaces with recCD47\nNOTE: The protocol is summarized schematically in Figure 1. Figure 1A illustrates generation of thiol-reactive polymeric surfaces. Figure 1B illustrates generation of thiol-reactive recCD47.\nDay 1\n\t\nPrepare a solution of PDT-BzPh (1 mg/ml) and potassium bicarbonate (KHCO3) (0.7 mg/ml) in sterile water. Stir overnight at 4 °C (protect from light).\nDay 2\n\t\nCut polymeric tubing into 40 cm long pieces (long enough to fit around rotating wheels).\nSoak tubes in a 0.1% aqueous solution of hexacylpyridinium for 90 min at room temperature on a shaker or on Chandler Loop Apparatus. Rinse the tubes with sterile water 3x after the 90 min soak.\nAcidify the solution of PDT-BzPh from Day 1 by adding 15% aqueous potassium phosphate monobasic (KH2PO4). Add 50 µl KH2PO4 per ml of PDT-BzPh, forming a cloudy micellar solution.\nSoak the tubes in the acidified PDT-BzPh solution for 40 min at room temperature on a shaker or on apparatus.\nRinse the tubes with dilute acetic acid (1:1,000) once.\nExpose the tubes to UV irradiation for a total duration of 60 min. Rotate tubes ¼ turn every 15 min to irradiate the entire surface area.\nSoak the tubes in a solution of 20 mg/ml potassium bicarbonate (KHCO3) for 20 min at room temperature on a shaker or on apparatus.\nRinse the tubes with sterile water 3x and store at 4 °C in sterile water.\nDay 3\n\t\nDissolve 5 mg Sulfo-SMCC in 200 µl Dimethylformamide (DMF) (Caution: Perform in fume hood).\nAdd 50 µl of the Sulfo-SMCC solution prepared in step 1 to 0.1 mg/ml of recCD47 poly-lysine solution, and stir for 60 min at room temperature.\nDuring 60 min stir, degas sterile Dulbecco’s Phosphate Buffered Saline (DPBS) and set aside.",
    "Purify Sulfo-SMCC reacted recCD47 using a 7K molecular weight cut-off spin desalting column per manufacturer’s instructions. Collect final flow-through (high-quality thiol-reactive recCD47) and dilute to a volume necessary to coat the interior of the tube with DPBS.\nRinse the tubes from day 2 with sterile, degassed DPBS 3x.\nReact the modified surface of the tubes with a solution of 20 mg/ml with tris(2-carboxyethyl) phosphine hydrochloride (TCEP) in degassed DPBS for less than 2 min. Rinse the tubes with sterile degassed DPBS 4x.\nAdd the Sulfo-SMCC-reacted recCD47 to the tubes and incubate overnight at 4 °C on a shaker or on apparatus.\n2. Immunoassay Quantification of recCD47 on Modified Surfaces\nRinse modified tubes to be quantified from Day 3 with DPBS 3x. Store tubes not used for quantification in DPBS at 4 °C.\nUse a 4 mm biopsy punch to make duplicate tube samples and place biopsy punches in wells of a 96-well plate.\nPrepare a negative control consisting of an unmodified tube sample not treated with the detection antibody. Prepare an antibody control consisting of an unmodified tube sample treated with the detection antibody. Prepare the modified tubing test samples treated with the detection antibody.\nBlock samples with 0.4% bovine serum albumin (BSA) in DPBS for 60 min at room temperature on a shaker.\nAfter blocking, aspirate BSA and rinse with tris-buffered saline plus 1% Tween-20 (TBST) 3x, 10 min each on a shaker.\nPrepare a working dilution of antibody in 0.4% BSA according to manufacturer’s recommended dilution for immunoassays. Dilute human CD47 Antibody B6H12-FITC 1:100 in 0.4% BSA.\nAdd 200 µl of antibody dilution to appropriate wells. Incubate negative controls with 0.4% BSA only. Incubate at room temperature for 60 min on a shaker (protect from light).",
    "Rinse with TBST 3x, 10 min each on a shaker. Aspirate the last TBST rinse and add 200 µl DPBS to tube sample wells.\nCollect the final flow-through, which is high-quality thiol-reactive recombinant CD47 and dilute to a volume necessary to coat the interior of the tubes with DPBS.\nRead FITC signal intensity using a microplate reader with FITC excitation (485 nm) and emission (538 nm) settings.\nCalculate recCD47 bound to polymeric surface based on standard values, accounting for auto-fluorescence and non-specific binding from the antibody control sample.\n3. Chandler Loop Apparatus Protocol\nSeek Institutional Review Board (IRB) approval of blood collection protocol and informed consent paperwork prior to initiation of collection of human blood samples. Obtain informed consent from a human blood donor.\nNOTE: A diagram depicting the apparatus is shown in Figure 2.\nFill water bath with distilled water until approximately 1/2 of the diameter wheels are submerged. Add enough bleach to the water bath to make a 10% bleach solution. Set water bath to 37 °C and allow temperature to equilibrate.\nGather metal adapters (shown in Figure 1B), unmodified tubing and modified tubing, and assemble around apparatus wheels, as shown in Figure 1C. Ensure that tubing fits snuggly around the wheel with the metal adapter in place.\nObtain 30 ml blood sample using an IRB-approved protocol, in a vial prefilled with 2 ml of citrate or other anticoagulant, and mix by inversion to prevent clotting once the specimen has been collected.\nAdd approximately 10 ml of blood to each tube using the metal valve and syringe, leaving some air in the tube. Secure the valve cap and rotate for 3 hr.\nDrain the blood into a waste beaker treated with a 10% bleach solution (or as required by institutional policy).",
    "Gently rinse tubing interior with DPBS to remove all traces of blood. Collect flow-through in the waste beaker. Dispose of blood in accordance with institutional policy.\nDisinfect the apparatus and any blood contacting surfaces using a 10% bleach solution or according to institutional policy.\nProcess samples for fluorescent microscopy or scanning electron microscopy as described below.\n4. Fluorescent Microscopy and Cell Counting\nPrepare a 4% paraformaldehyde (PFA) solution (Caution: Perform in fume hood).\nIncubate tubing in a 4% PFA solution overnight at 4 °C.\nAfter overnight incubation, remove 4% PFA and rinse films very gently with DPBS.\nCut the tubing into sections to expose the lumen surface for staining.\nStain a section of the tubing with a few drops of mounting media with 4',6-diamidino-2-phenylindole (DAPI) for 30 min at room temperature (protect from light). After staining, rinse the tubing very gently with DPBS to reduce background DAPI signal.\nImage using a fluorescent microscope equipped with a DAPI filter and digital camera to count the number of cells in 9 blindly selected fields of view under 200X magnification.\nRecord cell counts per field of view and perform appropriate statistical analyses to determine statistical significance of results.\n5. Scanning Electron Microscopy\nPrepare a 2% glutaraldehyde solution (Caution: Perform in fume hood).\nIncubate tubing in a 2% glutaraldehyde solution overnight at 4 °C.\nAfter overnight incubation, gently rinse the tubing 3x with DPBS.\nPrepare a 1% solution of osmium tetroxide (Caution: Severe inhalation hazard! Use in fume hood).\nIncubate tubing in a 1% solution of osmium tetroxide for 15 min at room temperature.\nGently rinse the tubing 3x with DPBS.\nPrepare a series of ethanol concentrations (25%, 50%, 75%, 95%, and 100% ethanol).",
    "Dehydrate the tubing by incubation in the series of ethanol concentrations. Incubate in 25%, 50%, 75%, and 95% ethanol for 20 min each. Incubate in 100% ethanol for 30 min.\nSupercritical point dry the tubing with CO2 for 45 min to remove all moisture.\nMount tube sections on a specimen stub with silver paste or graphite.\nCoat tube sections with 12.5 nm of gold-palladium.\nExamine in a scanning electron microscope.   \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}