{
  "id": 3756,
  "origin_website": "Cell",
  "title": "Purification and cryoelectron microscopy structure determination of human V-ATPase",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBelow we provide details about the purification and structure reconstruction of human V-ATPase (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/476-Fig2.jpg\nFigure 2. Schematic of the workflow in this protocol\nExpression and purification of flag-tagged Sidk protein\nTiming: 4–5 days\nPurify the flag-tagged SidK protein, which will be used as an affinity bait for the purification of human V-ATPase (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/476-Fig3.jpg\nFigure 3. Purification of SidK\n(A) The workflow for the purification of SidK.\n(B) The purified SidK on SDS-PAGE.\nExpression of flag-tagged SidK in E. coli\nTransform the recombinant plasmid of pET28a containing flag-tagged SidK into E. coli BL21(DE3) RIPL and grow single colonies on an LB plate with 50 μg/mL Kanamycin.\nInoculate a single colony to 25 mL LB broth with 50 μg/mL Kanamycin for overnight culture at 37°C with shaking at 200 rpm.\nThe 25 mL culture was diluted into 1 L LB broth with 50 μg/mL Kanamycin for further growing at 37°C with shaking at 200 rpm to a density of OD ~0.6.\nAdd 0.5 mM IPTG to the culture for the induction of protein expression at 18°C for 16–20 h.\nHarvest the cultured cells by centrifugation at 180 rcf for 10 min.\nPurification of flag-tagged SidK\nThe harvested cells were resuspended in 30 mL buffer A containing 20 mM Tris-HCl, pH 7.5, 300 mM NaCl, 20 mM Imidazole that was pre-cold at 4°C.\nThe cells were disrupted by sonication (50% power, 5 s on, 5 s off) for 4 min on ice.\nThe cell lysate was centrifuged at 20,000 rcf for 40 min to remove cell debris.\nAfter centrifugation, the supernatant was incubated with 1 mL Ni-NTA resin pre-equilibrated by buffer A at 4°C for 30 min.",
    "The resin was then washed with 10 mL buffer A containing 20 mM Tris-HCl, pH 7.5, 300 mM NaCl, 20 mM Imidazole.\nThe protein was eluted using 4 mL buffer B containing 20 mM Tris-HCl, pH 7.5, 300 mM NaCl, 300 mM Imidazole.\nThe eluted flag-tagged SidK was further purified by gel filtration in buffer C containing 20 mM Tris-HCl, pH 7.5, 150 mM NaCl, 1 mM TCEP.\nAnalyze the purity of the protein by SDS-PAGE (Figure 3[href=https://www.wicell.org#fig3]B).\nPool the protein fractions and concentrate to 2 mg/mL using spin filter concentrator (Company). Protein concentration was quantified by measuring the UV280 absorbance using NanoDrop Spectrophotometer (Thermo Fisher Scientific).\nFreeze 100 μL aliquots of SidK protein in liquid nitrogen and store the protein in −80°C freezer.\nNote: During the wash step in step 2e, up to 20 mL buffer A may be used to wash the resin, which will help to maximally eliminate non-specific bound proteins.\nPurification of human V-ATPase\nTiming: 2–3 weeks\nPurify human V-ATPase from HEK293S cells by affinity purification and glycerol gradient ultracentrifugation (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/476-Fig4.jpg\nFigure 4. Purification of human V-ATPase\n(A) The workflow for the purification of human V-ATPase.\n(B) The purified human V-ATPases on SDS-PAGE.\n293S cell culture\nOne vial of frozen 293S cells were diluted into 25 mL Freestyle 293 medium for centrifugation at 180 rcf for 5 min.\nThe cell pellets were resuspended using 30 mL fresh medium of Freestyle 293 medium supplemented with 10% FBS and 1% antibiotics-antimycotic (anti-anti) in a 200 mL Baffled flask and cultured at 37°C with shaking at 100 rpm in a mammalian cell culture shaker.\nThe cells were diluted into 1.0 million/mL using fresh Freestyle 293 medium with 1% anti-anti when the cell density arrived at 2.0 million/mL to prepare 5 L 293F cell culture.",
    "293S cells were harvested by centrifugation at 180 rcf for 10 min.\nV-ATPase Purification\nIsolation of Membrane Fraction\nThe harvested cells were resuspended in 150 mL buffer D containing 50 mM HEPES, pH 7.5, 50 mM NaCl supplemented with protease inhibitor cocktail and incubated for 2 h on ice.\nThe cells were further disrupted by hand-driven Dounce homogenization (PYREX, Corning).\nThe cell lysate was centrifuged at 20,000 rcf for 30 min to remove cell debris.\nThe supernatant was centrifugated at 200, 000 rcf in a Type 45 Ti rotor (Beckman) for 1 h to obtain the membrane pellet.\nPurification of V-ATPase by anti-Flag Resin\nThe membrane pellet was resuspended in the buffer E containing 150 mM NaCl, 1 mM TCEP, 1% lauryl maltose neopentyl glycol (LMNG), 0.1% cholesteryl hemisuccinate (CHS), protease inhibitor cocktail (Sigma-Aldrich), and 50 mM HEPES at pH 7.4 and homogenized using a hand-driven Dounce homogenizer (PYREX, Corning).\nThe homogenized membrane solution was mixed with 0.1 mg flag-tagged SidK protein and incubated for 4 h at 4°C.\nAfter incubation, the mixture was centrifuged at 20,000 rcf for 30 min to remove insoluble material.\nSupernatant containing solubilized V-ATPase/SidK complex was then incubated with 1 mL anti-Flag resin for 1 h at 4°C.\nThe resin was collected and washed with 10 mL buffer F containing 150 mM NaCl, 1 mM TCEP, 0.1% lauryl maltose neopentyl glycol (LMNG), 0.01% cholesteryl hemisuccinate (CHS), and 50 mM HEPES at pH 7.4\nThe V-ATPase/SidK complex was eluted using 5 mL wash buffer F plus 100 μg/mL 3X FLAG peptide.\nFurther Purification of V-ATPase by Glycerol Gradient Ultracentrifugation\nPrepare 1 mL each of 15%, 30%, 45%, and 60% glycerol solutions in buffer G plus 0.001% lauryl maltose neopentyl glycol (LMNG) and 0.0001% cholesteryl hemisuccinate CHS.",
    "Prepare glycerol gradient by gently injecting 1 mL 15%, 30%, 45%, and 60% glycerol solutions to the bottom of a polyclear centrifuge tube using a 1 mL syringe.\nSlowly load between 100 μL and 500 μL V-ATPase fraction from previous step on top of the glycerol gradient.\nBalance the two tubes before loading them into the swing-out rotor.\nCentrifuge at 171,520 rcf in a Beckman MLS-50 rotor and Beckman Optima MAX ultracentrifuge for 20 h at 4°C.\nAfter centrifugation, manually fractionate by poking a hole at the bottom of the centrifuge tube and collect the first 16 fractions of 250 μL each.\nAnalyze each fraction by SDS-PAGE to select the fractions with intact V-ATPase (Figure 4[href=https://www.wicell.org#fig4]B). The V-ATPase concentration was quantified by NanoDrop Spectrophotometer (Thermo Fisher Scientific).\nNote: The Freestyle 293 medium needs to be pre-warmed to 37°C before use.\nNote: Make sure to add sufficient amount of protease inhibitor to avoid protein degradation by endogenous protease during cell lysis and protein purification processes.\nCritical: When you load the glycerol into the centrifuge tube, be careful to avoid air bubbles and not to disturb the interface.\nCritical: Avoid boiling samples for SDS-PAGE, otherwise the protein complex will form large aggregates that are difficult to enter the gel.\nPause Point: The harvested cells in step 3 or the isolated membrane pellets in step 4a may be stored in −80°C freezer for up to a month before moving on to the next steps.\nGrids preparation and cryo-EM data collection\nTiming: 2–4 days\nPrepare cryo-EM grids of human V-ATPase and collect cryo-EM data for structure reconstruction (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/476-Fig5.jpg\nFigure 5. Grid preparation and data collection\n(A) The workflow for grids preparation and data collection.\n(B) A representative cryo-EM image of human V-ATPase.\nGrid Preparation",
    "Copper grids with less than 3 nm continuous ultrathin carbon and lacey carbon support film was glow-discharged for 1 min at the current of 30 mA.\nA 3 μL drop of purified human V-ATPase sample was applied to the glow-discharged grids and incubated at 4°C for 10 min.\nThe grids were washed for three times using 5 μL buffer G containing 20 mM HEPES at pH 7.5 and 150 mM NaCl to remove the glycerol as much as possible.\nThe grids were blotted using standard vitrobot filter paper (Ted Pella) for 4 s with force of 5 in 100% humidity at 4°C, and plunged into liquid ethane using an FEI Vitrobot Mark IV.\nCryo-EM Data Collection\nGrids screening\nAll the grids were clipped\nThe clipped grids were loaded to FEI Talos Arctica microscope for screening.\nThe grids with good ice and particle distribution were saved for data collection (Figure 5[href=https://www.wicell.org#fig5]B).\nData collection\nGrids for data collection were loaded to FEI Titan Krios microscope with a K3 detector and energy filter.\nData were collected in counting mode, with 40 total frames per movie in 3.2 s, a total dose of 50 electrons per Å2, a physical pixel size of 1.08 Å, and defocus values between 1 nm to 3 nm.\nNote: As the protein concentration is relatively low for preparing cryo-grids, we therefore choose carbon-coated grids that help to concentrate protein particles on the grids.\nCritical: During grids preparation, the elimination of glycerol in samples by washing three times is critical for preparing girds with proper ice.\nPause Point: The prepared grids in step 5 may be stored in liquid nitrogen for screening and data collection.\nCryo-EM data processing\nTiming: 2–3 weeks\nProcess cryo-EM data to obtain cryo-EM density maps of human V-ATPase (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/476-Fig6.jpg",
    "Figure 6. Schematics of structure determination\nBeam-induced motion correction Motion correction was done in RELION by the implementation of UCSF MOTIONCOR2(Zheng et al., 2017[href=https://www.wicell.org#bib12], Scheres, 2012[href=https://www.wicell.org#bib8]).\nCTF estimation Contrast transfer function (CTF) estimation was done by CTFFIND4.1 in RELION (Scheres, 2012[href=https://www.wicell.org#bib8], Rohou and Grigorieff, 2015[href=https://www.wicell.org#bib7]).\nInitial Particle Picking The particle picking was done using a template-free auto-picking procedure based on a Laplacian-of-Gaussian filter to select an initial set of particles (Wagner et al., 2019[href=https://www.wicell.org#bib9]).\n2D Classification The selected particles were used in a 2D classification to generate templates for a second round of auto-picking job.\nSecond round particle picking The particle picking was done by Gautomatch using the templates generated in step 10 as references.\n2D Classification Total 782,583 particles were picked for 2D classification to select good classes for further 3D classification.\n3D Classification The selected particles were 3D-classified into 6 classes and 3 classes out of the 6 are corresponding to the 3 states of the V-ATPase.\n3D refinement The 3 states were selected for non-uniform 3D refinement in cryoSPARC (Punjani et al., 2017[href=https://www.wicell.org#bib6]). The 3D reconstruction resulted in three maps with resolutions of 3.1 Å, 3.4 Å, and 3.6 Å, respectively.\nNote: Regularization parameter Ts for 2D classification (step 12) and 3D classification (step 13) are 2 and 4, respectively.\nModel building and refinement\nTiming: 2–4 weeks\nBased on the cryo-EM maps we obtained above, we built atomic models of human V-ATPase.\nModel Building The initial structure model of human V-ATPase was generated using SWISS-MODEL based on yeast V-ATPase and fitted as rigid bodies into cryo-EM maps using Chimera (Biasini et al., 2014[href=https://www.wicell.org#bib2], Pettersen et al., 2004[href=https://www.wicell.org#bib5]). The structures were further manually adjusted in coot (Emsley and Cowtan, 2004[href=https://www.wicell.org#bib3]).",
    "Refinement Real-space refinement was performed using PHENIX following the routine protocol and the models were validated by PHENIX (Adams et al., 2010[href=https://www.wicell.org#bib1])."
  ],
  "subjectAreas": [
    "Cryo-Em",
    "Protein Expression And Purification",
    "Structural Biology",
    "Molecular Biology",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}