{
  "id": 2833,
  "origin_website": "Cell",
  "title": "Analyzing trogocytosis of T lymphocytes by flow cytometry and confocal microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCritical: To minimize the risk of microbial contamination all cell culture work should be performed in a laminar flow cabinet.\nNote: This protocol describes the workflow for CHO and MEF as donor cells and 58αβ T cells or primary human PBMCs as recipient cells. As different cell types may prefer different culture conditions (e.g., cell culture media, cell densities, etc.), please adjust the protocol to the cells being used.\nCell culture\nTiming: 5–15 min hands-on time for cell splitting + 1 week incubation\nNote: All media, buffers and other solutions used for cell culture handling can be used at normal lab temperatures (19°C–23°C), unless stated otherwise.\nThaw cryo-preserved donor (CHO, MEF) and recipient (58 αβ) cell lines.\ntransfer cells into 15 mL Falcon tube.\nadd PBS to a final volume of 10 mL.\ncentrifuge at 400 × g for 5 min.\nAspirate and discard supernatant.\nresuspend cell pellet in 1 mL of cell culture medium.\ntransfer each cell line into a separate 25 cm2 (or T25) cell culture flask and add 4 mL of culture medium.\nStore cell culture flasks in a humidified 37°C, 5% CO2 incubator.\nOnce the adherent donor cells reach 80%–90% confluence (by visual inspection),\nAspirate medium and rinse donor cells once with 5 mL PBS, then aspirate PBS.\nAdd 0.5–1 mL of 0.05% trypsin and incubate for 2–5 min at 37°C until cells detach from cell culture flask.\nStop trypsinization by adding 4 mL of cell culture medium.\nNote: For larger or smaller sized cell culture flasks scale the amount of Trypsin-EDTA and of cell culture medium accordingly.\nDetach the cells by slowly pipetting up and down, discard 4.5 mL of cell suspension and keep the remaining 0.5 mL.",
    "Add 4.5 mL of fresh cell culture medium to split cells 1:10.\nSplit non-adherent recipient cells when the originally red cell culture medium starts to turn yellowish:\nSlowly pipet up and down, discard 4.5 mL of cell suspension and keep the remaining 0.5 mL.\nAdd 4.5 mL of fresh cell culture medium to split cells 1:10.\nStore the cell culture flasks in a humidified 37°C, 5% CO2 incubator for at least a week and split cells as indicated.\nDay 0\nPoly-L-ornithine coating of cell culture dishes for microscopy\nTiming: 15 min + 1–18 h incubation + 1 h drying\nNote: For flow cytometry-based experiments this step can be omitted.\nNote: There are many different types of coating glass surfaces to facilitate cellular adhesion. While in our experimental setup poly-L-ornithine coating worked well, other coatings may work better for other cell types.\nDilute poly-L-ornithine stock in sterile H2O to a final concentration of 0.01% (w/v 0.1 mg/mL).\nAdd 500 μL 0.01% poly-L-ornithine coating solution to 35 mm glass bottom μ-dishes to coat it. Make sure to cover the entire bottom of the dish.\nIncubate for 1 h at approximately 20°C or for 16–18 h at 4°C.\nAspirate coating solution without scratching the coated surface and dry dish at normal lab temperatures (19°C–23°C) for 30–60 min.\nDay 1\nCounting and plating of donor cells\nTiming: 30 min + 16–18 h incubation\nAspirate medium from donor cells and rinse them once with 5 mL PBS, then aspirate PBS.\nadd of 0.5–1 mL 0.05% Trypsin-EDTA and incubate for 2–5 min at 37°C until cells detach from cell culture flask.\nStop trypsinization by adding 4 mL of cell culture medium.\nNote: For larger or smaller sized cell culture flasks scale amount of trypsin and cell culture medium accordingly.",
    "Harvest cells into 15 mL Falcon tube, pipet up and down several times in order to singulate cells.\nNote: In case singulation of cells turns out to be difficult by trypsinization alone, consider adding a filtering step using a cell filter appropriately sized for the cells used (e.g., Partec Celltrics™ 100 μm filter size).\nCount cells using a Neubauer counting chamber or other suitable counting device.\nAdjust the concentration of cells by dilution with cell culture medium as needed.\nNote: Seeding 1–3.5 × 104 donor cells per well in a 48- or 96-well flat bottom plate often yields a confluent monolayer on the following day, which we found to be optimal for trogocytosis assays measured by flow cytometry. These numbers may differ between cell lines and culture conditions and should thus be optimized.\nCritical: Optimizing the number of donor cells to achieve a confluent monolayer is important for achieving reproducible results across different experiments. This is because the trogocytosis rate of the recipient cells depends on the total amount of ligand molecules available, which scales with the number of donor cells present.\nIn contrast, for microscopic analyses a confluent monolayer may be less desired to allow for visualization of interactions between individual donor and recipient cells. In this case, lower cell densities may be beneficial. In our systems, seeding 0.5–1 × 105 donor cells in a 35 mm glass bottom μ-dish allowed for imaging of individual cells.\nPlate donor cells in 96- or 48-well flat bottom cell culture plate, or - for microscopic analyses – in a suitable, coated glass-bottom plate or dish.\nIncubate for 16–18 h in a humidified 37°C 5% CO2 incubator.\nDay 2\nIsolation of primary recipient cells from human blood\nTiming: 40 min",
    "Note: When using T cell lines like murine 58 αβ or human Jurkat as recipient cells steps 19–26 can be omitted. For studying trogocytosis of human primary T cells, we used leukocyte-enriched blood samples from healthy donors (provided by the Department of Transfusion Medicine of the University Hospital Würzburg). However, fresh blood samples collected in EDTA- or heparin-coated tubes should work as well. Alternatively, primary T cells can be prepared from murine spleens or lymph nodes by immunomagnetic isolation, using commercially available kits.\nTransfer blood sample to a 50 mL Falcon tube.\nAdd 25 mL of Versene buffer to the blood sample.\nFor density-gradient centrifugation, prepare another 50 mL tube filled with 15 mL Histopaque-1077.\nCarefully layer the Versene-diluted blood sample onto the Histopaque using a 25 mL pipette.\nNote: To avoid mixing of blood with Histopaque it can be helpful to hold the tube at a 20–45 degree angle. Then slowly dispense the blood onto the inside of the tube letting it run down the tube wall onto the Histopaque to get two clearly separated layers (Figure 1[href=https://www.wicell.org#fig1]).\nCentrifuge at 1,160 × g for 15 min at normal lab temperatures (19°C–23°C) (no brake).\nCarefully collect the layer of PBMCs, which can be identified as a white band located between the Histopaque and serum layers (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2338-Fig1.jpg\nFigure 1. PBMC preparation with Histopaque before (left) and after (right) centrifugation\nWash PBMC twice with BSS/BSA buffer. Centrifuge settings: 430 × g for 3 min at 4°C.\nResuspend in 10 mL PBMC culture medium.",
    "Note: In our experience non-activated human T cells display only little trogocytic activity, and this can be considerably improved by T cell activation. For this, one may add Anti-human CD3 antibody (clone: HIT3a, final concentration 0.1 μg/mL at recipient cell concentration of 1.5 × 105 cells/mL) to the recipient cells just before co-culturing them with the donor cells. In contrast, we have found murine primary T cells as well as different T cell lines (58αβ, Jurkat) to also efficiently trogocytose ligands without concomitant activation.\nSetting up co-culture of donor and recipient cells\nTiming: 30 min\nAdjust concentration of recipient cells to 1.5 × 105 cells/mL.\nNote: Optimal cell concentrations can vary across different experimental systems and should be optimized accordingly.\nCarefully remove medium from donor cell culture.\nFor experiments using flow cytometry as readout add 3 × 104 recipient cells (=200 μL) to donor cells cultured in 96-well plates.\nFor fluorescence microscopy-based experiments add 1 × 105 recipient cells (=660 μL) to donor cells cultured in 35 mm glass bottom μ-dish.\nNote: For microscopy-based experiments involving subsequent fixation and staining of cells prior to microscopic analysis, serum-free medium can be used as it promotes adhesion of lymphocytes to the coated glass-surface. After fixation this will prevent loss of cells in subsequent sample processing steps.\nIncubate the co-cultured donor and recipient cells in a humidified 37°C 5% CO2 incubator for the desired amount of time. Alternatively, place the cells in the live-imaging compartment of a confocal microscope.",
    "Note: Whereas trogocytosis can be very rapid, i.e., being detectable after a few minutes, the speed of the process can differ substantially depending on the receptor-ligand pair investigated as well as the type and mobility of the cells used. It is advisable to perform a kinetic analysis comparing different incubation periods when establishing the assay. For T lymphocytes we usually employ co-culture periods of 0.25–12 h (rule of thumb: shorter incubation times can be used when studying the actual molecule transfer, longer incubation times should be used if the focus is on the subsequent fate of acquired molecules).\nNote: It takes a few minutes until recipient cells have sunken down onto the donor cells by gravity. A brief centrifugation step (e.g., 200 × g, 30 s, 4°C) can accelerate this. Particularly for short experiments, the centrifugation step promotes homogenous trogocytosis rates among recipient cells within a well by aligning starting times of the process.\nOptional: In case the effect of pharmacological agents on trogocytosis shall be studied, consider that trogocytosis can occur very rapidly, whereas pharmacological agents may take a while to exert their functions. Hence, it may be necessary to expose donor and recipient cells to such agents for a while before co-culture to assess their effects on trogocytosis.\nDepending on whether flow cytometry or fluorescence microscopy shall be used as readout either proceed with paragraph “harvest of recipient cells and staining for flow cytometric analysis[href=https://www.wicell.org#sec3.4.3]” (step 31) or “preparation of cells for fluorescent microscopy[href=https://www.wicell.org#sec3.4.4]” (step 41).\nHarvest of recipient cells and staining for flow cytometric analysis\nTiming: 90 min\nNote: From now on keep cells cooled at all times (on ice or in fridge)!\nCarefully collect and discard 100 μL supernatant from of each well without removing the cells at the bottom.",
    "Per well add 100 μL ice-cold FACS Buffer (aids in detaching the cells from one another).\nCarefully pipet up and down several times.\nNote: Aim the flow generated by pipetting to all areas of the well, but without touching the bottom of the plate, to detach the recipient cells from the donor cells. While the goal here is to detach the recipient but not the donor cells, it is usually unavoidable that also some donor cells are inadvertently harvested during this process. Therefore, implementing strategies to unambiguously distinguish between donor and recipient cells is highly recommended to avoid the unintended inclusion of donor cells in the analysis of recipient cells. This can, for example, be accomplished by antibody-based detection of molecules differentially expressed between donor and recipient cells (e.g., so called “lineage-markers”). Please also see problem 1[href=https://www.wicell.org#sec6.1] in the troubleshooting[href=https://www.wicell.org#troubleshooting] section for further details.\nFor subsequent staining, transfer 200 μL of cell suspension to a new 96-well u- or v-shaped plate.\nPellet the cells by centrifugation (400 × g for 5 min at 4°C).\nDuring the centrifugation, prepare a staining mix of antibodies in FACS buffer.\nNote: For primary human T cells (PBMCs) and the 58αβ T cell lymphoma cell line Anti-human CD4-FITC antibody (1:200 dilution) and Anti-mouse CD8α-APC antibody (1:100 dilution) were used, respectively. Other antibodies can be used to identify cells or interest and discriminate donor and recipient cells. Also a viability dye may be included in the staining mix.\nCarefully remove and discard the supernatant.\nResuspend pelleted cells in 30 μL staining mix and incubate at 4°C for 20–30 min in the dark.\nPer well add 180 μL cold FACS buffer. Then spin down the cells by centrifugation at 400× g for 5 min and carefully discard the supernatant afterward.\nRepeat step 38.",
    "Resuspend cells in 200 μL of ice-cold FACS buffer and analyze them by flow cytometry. Alternatively, cells may now be permeabilized and stained for intracellular molecules (including trogocytosed ligands).\nPreparation of cells for fluorescent microscopy\nFix cells by adding 500 μL of 4% formaldehyde solution to reach a final concentration of 2% formaldehyde and incubate for 15 min at normal lab temperatures (19°C–23°C) in the dark.\nCritical: Carefully add the fixative dropwise to prevent detachment of cells from the coated glass surface or disruption of cell-cell interactions.\nRemove the fixative by carefully pouring it off the dish.\nNote: After fixation cells should stick fairly strong to the coated surface, which facilitates subsequent washing and staining steps.\nWash the dish 3-times with 3 mL PBS.\nFor this, add PBS to the dish without pipetting it directly onto the cell-coated area.\nRemove PBS by pouring it out of the dish.\nNote: By tilting the dish at a 45° angle the residual liquid will form a drop which can be removed with a tissue or pipet.\nNote: While cells can already be imaged at this stage, subsequent labeling of cells (e.g., cell membrane stain with WGA lectin) can help to determine the subcellular localization of trogocytosed molecules.\nRemove all PBS from dish and add 200 μL of 5 μg/mL WGA-CF405S conjugate diluted in HBSS for cell membrane labeling.\nIncubate for 10 min at RT.\nWash cells twice with HBSS as described in step 43.\nAdd 3 mL of fresh HBSS to dish and analyze cells using a fluorescence microscope. If you encounter difficulties to detect trogocytosis by microscopy, please also see problem 4[href=https://www.wicell.org#sec6.7] in the troubleshooting[href=https://www.wicell.org#troubleshooting] section."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Membrane",
    "Flow Cytometry",
    "Cell Biology",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}