{
  "id": 13171,
  "origin_website": "Jove",
  "title": "Cell Dissociation from the Tongue Epithelium and Mesenchyme/Connective Tissue of Embryonic-Day 12.5 and 8-Week-Old Mice",
  "procedures": [
    "Animal use (C57BL/6 mice throughout the study) was approved by the University of Georgia Institutional Animal Care and Use Committee and was in accordance with the National Institutes of Health Guidelines for care and use of animals for research.\n1. Animal usage\nNOTE: Mice were bred and maintained in the animal facility of the Animal and Dairy Science department at the University of Georgia at 22 °C under 12-h day/night cycles.\nDesignate noon of the day of vaginal plug detection in mice as embryonic (E) day 0.5. Use embryos at E12.5 and postnatal mice at 8 weeks of age for the following experiments.\n2. Preparation before experiment\nNOTE: The instruments required for this protocol are listed in the Table of Materials.\nAutoclave instruments before the experiment. Sterilize instruments using a bead sterilizer during the experiment.\nClean the surgical area, the dissecting microscope, and the biosafety cabinet using 70% ethanol wipes. Turn on the UV light of biosafety cabinet and keep it on for 20 min prior to the experimental procedure.\nPrepare an enzyme mixture of 1:1 dispase (5.0 mg/mL) and collagenase (2.0 mg/mL) to a final concentration of 2.5 and 1.0 mg/mL respectively, and filter the solution using 0.22 µm syringe filter7.\n\t\nPrepare 1 mL of enzyme mixture for an adult tongue or 0.5 mL for a specific region of tongue (e.g., posterior, or anterior tongue).\nPrepare 2 mL of enzyme mixture for embryonic tongues.\nMake 10 mL of 2.5% BSA in 0.1 M PBS and filter the solution using 1 mL syringe and 0.22 µm syringe filter.\nMake 500 µL of 5% FBS in DMEM/F12.\nMake 3 mL of DMEM/F12 containing 10% FBS and 1% BSA and filter the solution using 1 mL syringe and 0.22 µm syringe filter.",
    "3. Separation of the tongue epithelium from the mesenchyme/underlying connective tissue\nSeparation of the epithelium from the mesenchyme of an E12.5 mouse tongue\n\t\nEuthanize timed pregnant female mice carrying E12.5 embryos by placing it in a CO2 chamber followed by cervical dislocation.\n\t\tNOTE: Mouse embryos at E12.5 are collected after 12 pm (afternoon) on the 12th day after detection of vaginal plug in the pregnant female mice.\nTransfer mice to the surgical area. Wet the mouse abdomen using 70% ethanol to prevent fur from getting into the operating site.\nOpen the abdomen using dissecting scissors to expose the uterine horns carrying embryos. Dissect the uterine horns using dissecting scissors and transfer it to 15 mL of fresh Tyrode's solution in a 100 mm culture dish.\nDissect the embryos (Figure 1A1) out from uterine horns under a dissecting microscope using mini-scissors and fine forceps.\nCarefully open the mouth cavity wide by using fine forceps and dissect the tongue off from the mandible using mini-scissors (Figure 1A2).\nWash the tongues using 15 mL of fresh sterile Tyrode's solution in a 100 mm culture dish.\nTransfer the tissues to 2 mL of enzyme mixture of dispase (2.5 mg/mL) and collagenase (1.0 mg/mL) in a 35 mm culture dish with a spatula and fine forceps in a biosafety cabinet. Incubate for 20 min at 37 °C.\nTransfer tongues to 15 mL of fresh sterile Tyrode's solution in a 100 mm culture dish and gently remove the mesenchyme from the epithelium from the ventral side using fine forceps.\n\t\t​NOTE: Epithelial sheets may be separated without mechanical force during the incubation.\nWash the separated epithelia and mesenchyme twice in 15 mL of fresh sterile Tyrode's solution in a 100 mm culture dish.",
    "NOTE: The activities of dispase and collagenase will be inhibited by EDTA in the cell dissociation procedure (step 4.1).\nSeparation of the tongue epithelium from the underlying connective tissue of adult mice\n\t\nEuthanize the mouse at 8 weeks of age by placing it in a CO2 chamber. Confirm that the mouse is euthanized with no breaths and forepaw-pinch response.\nTransfer the mice to the surgical area. Wet the mouse head using 70% ethanol to prevent fur from getting into the oral cavity.\nCut the corners of the mouth along the cheek using dissecting scissors to open the oral cavity. Dissect the tongue with mandible (Figure 1B1) and place it in a plastic dish with a layer of plastic wrap.\nUsing surgical forceps to hold the tongue under a dissecting microscope, inject the enzyme mixture of dispase (2.5 mg/mL) and collagenase (1.0 mg/mL) in the sub-epithelial space of tongue through the cutting edge (Figure 1B1, arrows) of the posterior tongue.\n\t\t\nInject 1 mL of enzyme mixture evenly to the whole tongue for tissue collection from both anterior and posterior tongue.\nInject 0.5 mL of enzyme mixture locally to the anterior tongue for tissue collection from tongue tip or to the posterior tongue for circumvallate papilla tissue collection.\n\t\t\t​NOTE: The tongue will swell as the enzyme accumulates (Figure 1B2). Gentle injection of the enzyme can prevent pressure from damaging the epithelium and keep as much enzyme as possible in the tongue.\nWrap the tongue with plastic wrap and incubate the tongue for 30 min at 37 °C.\nUse mini-scissors to dissect the tongue tip and/or circumvallate papilla, and use spatula and fine forceps to transfer tissue to 15 mL of fresh sterile Tyrode's solution in a 100 mm culture dish.",
    "Separate the epithelium from the underlying connective tissue in the enzyme-digested sub-epithelial space using mini-scissors. Trim the tissues to a proper size according to the requirement of downstream experiments.\nWash the separated epithelium and underlying connective tissue twice in 15 mL of fresh sterile Tyrode's solution in a 100 mm culture dish.\n\t\t​NOTE: The activities of dispase and collagenase will be inhibited by EDTA in the cell dissociation procedure (step 4.1).\n4. Cell dissociation\nNOTE: The cell dissociation protocol described here can be applied to the tongue epithelium and mesenchyme/connective tissue in both E12.5 embryonic and 8-week-old mice. To reduce the cell loss during agitation and transfer of cell suspension, use commercial low retention pipette tips or pre-coated pipette tips with 2.5% BSA in 0.1 M PBS at pH 7.48.\nTransfer the tissues using spatula and fine forceps to 3 mL of 0.25% trypsin-EDTA in a new 35 mm culture dish for 30 min at 37 °C. Gently agitate tissues every 5 min with 1 mL pipette tips.\n\tNOTE: Do not cut the pipette tip, as the cutting edge can physically damage the dissociated cells.\nAdd 500 µL of 5% FBS in DMEM/F12 to stop the reaction and transfer the medium to a 5 mL low binding centrifuge tube.\nCentrifuge cell suspension at 200 x g for 8 min at room temperature and remove the supernatant.\nGently re-suspend cells in 3 mL of DMEM/F12 containing 10% FBS and 1% BSA using 1 mL pipette tips and filter the cells using a 70 µm cell strainer, followed by a 35 µm cell strainer.\nCentrifuge cell suspension at 200 x g for 8 min at room temperature. Remove most of the medium and leave 50-300 µL as the final volume to re-suspend cells.",
    "​NOTE: Adjust the concentration of cells according to requirements of downstream experiments by changing the final volume of single cell suspension.\n5. Cell counting and viability test using hemocytometer\nNOTE: To improve measurement accuracy, 3 technical replicates are recommended for each sample.\nGently mix 5-10 µL of the single cell suspension with an equal volume of Trypan blue and add onto hemocytometer.\n\tNOTE: Clean the hemocytometer thoroughly using 70% ethanol before use. Dusts particles on the hemocytometer will be stained in dark blue and affect the accuracy of viability test. Check the hemocytometer under a microscope.\nCount the total cell number, the number of live cells (white), and the number of dead cells (dark blue) stained by Trypan blue (Figure 2, arrows) respectively in 4 squares with 16 grids (Figure 2) using inverted microscope with imaging system.\nCalculate the cell concentration:\n\tCell concentration = imgsrc://cloudfront.jove.com/files/ftp_upload/62163/62163eq01v2.jpg\nCalculate the viability:\n\t\tViability = imgsrc://cloudfront.jove.com/files/ftp_upload/62163/62163eq02.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}