{
  "id": 13663,
  "origin_website": "Jove",
  "title": "Simultaneous Assessment of Cardiomyocyte DNA Synthesis and Ploidy: A Method to Assist Quantification of Cardiomyocyte Regeneration and Turnover",
  "procedures": [
    "Animal work was authorized and approved by Newcastle University Ethics review board. All animal procedures were performed conforming to the guidelines from Directive 2010/63/EU of the European Parliament on the protection of animals used for scientific purposes.\n1. EdU Administration\nDissolve EdU in sterile saline solution (0.9% w/v) at a final concentration of 12.5 mg/ml.\n\t\nHeat the solution to 40 °C and vortex in order to completely dissolve. Store enough EdU/Saline at 4 °C to inject all mice in the study allowing for 6 daily injections.\n\t\tNote: Typically over 6 mice are required for each experimental group. However, power calculations should be performed for independent studies.\nWeigh individual mice. Calculate the required volume to administer 100 µg/g of EdU/saline solution to each mouse (8 µl of stock EdU solution per g).\nDraw the appropriate volume of EdU/saline into insulin syringe with a 25 G needle.\nPerform intraperitoneal (i.p.) injections while handling mice using approved Home Office techniques.\n\t\nPlace a mouse on the cage lid. Gently pull back on the base of the tail and firmly grasp the mouse by the scruff.\nExpose the abdomen for injection by holding the mouse with the index finger and thumb near the base of the head and tipping the animal's head backwards toward the floor.\nWipe the abdomen with 70% alcohol solution. Locate the animal's midline and lower right quadrant. Inject the EdU/Saline solution into the animal into the lower right quadrant.\nInject mice with EdU/saline solution and record the time of day.\nRepeat steps 1.2 to 1.4 at the same time of day, for 6 consecutive days.",
    "Note: As an EdU negative control is required to set the gating for flow cytometric analysis, inject an additional age, gender and experimentally matched mouse with an equivalent volume of saline without EdU. This will provide the required control (no EdU control). This control should be included for every study to allow for variations in batches of reagents and cytometer set up.\n2. Harvesting Hearts\nAt 24 hr after the 6th EdU injection, sacrifice mice using cervical dislocation (or an alternative Schedule 1 Home Office approved method).\nPlace sacrificed animal in a supine position and make skin incision from the mid abdomen to the diaphragm with surgical scissors.\nCut the diaphragm, and holding the sternum away from the body cavity, cut bilaterally to expose the heart.\nLift the heart slightly and cut the major blood vessels of the outflow tract to dissect the heart out of the thoracic cavity.\nImmediately place each heart in to an individual 15 ml centrifuge tube containing 10 ml PBS chilled to 4 °C.\nTransfer hearts to separate 10 cm Petri dishes, using a scalpel cut each heart in two in a sagittal orientation and wash the heart by gently squeezing with a pair of forceps. Then replace the PBS to remove as much blood as possible. Repeat this step twice.\nPlace both parts of each heart into the same individual 1.5 ml microcentrifuge tube.\nContinue to step 3 or alternatively store specimens -80 °C as detailed in steps 2.9 and 2.10.\nUsing a 25 G needle, make a small hole in the microcentrifuge tube lid to prevent the lid from opening due to the expansion of gases when the heart is processed.\nLabel each microcentrifuge tube and place in a container of liquid nitrogen to freeze.\n3. Nuclei Dissociation and Cardiomyocyte Nuclei Labeling",
    "Note: This nuclei dissociation and cardiomyocyte nuclei labeling is adapted from that of Bergmann et al.11 Perform this procedure on all samples injected with EdU and saline injected (no EdU control) negative control. See Table 1 for the recipe of solutions required to perform these steps.\nFor each heart to be analyzed, place 36 ml of 1% BSA/PBS solution into an ultracentrifuge tube, incubate for 30 min, discard the solution and then allow to air dry.\n\tNote: This tube is used in step 3.6.\nPlace individual frozen hearts onto a 10 mm dish on ice and mince using a scalpel allowing the hearts to defrost during the mincing process.\nPlace minced hearts into 15 ml of Cell Lysis Buffer in a 50 ml centrifuge tube and homogenize with a probe homogenizer for 15 sec at 25,000 rpm at room temperature.\nAdd a further 15 ml of Cell Lysis Buffer to the Centrifuge tube and transfer to a 40 ml dounce with a large clearance pestle. Perform 10 strokes with the pestle and filter through a 100 µm then 40 µm cell strainer into a 50 ml centrifuge tube.\nCentrifuge for 10 min at 700 x g at 4 °C and remove the supernatant.\nResuspend the nuclear pellet in 25 ml of Sucrose Gradient Solution and layer the cell nuclei containing solution on top of 10 ml of fresh sucrose gradient solution in the ultracentrifuge tube prepared in 3.1.\nCentrifuge at 13,000 x g for 1 hr at 4 °C using a swing out tube rotor.\nFollowing the centrifugation, discard the supernatant and resuspend the nuclei pellet in 1,300 µl of nuclei storage buffer in a 1.5 ml microcentrifuge tube and label PCM1.",
    "Remove 300 µl of the suspension to a new microcentrifuge tube and add to 700 µl of fresh nuclei storage buffer. Label this tube as ISO control.\nAdd anti-PCM1 at a final concentration of 8 µg/ml to the microcentrifuge tube labeled PCM1 and add Rabbit IgG isotype control antibody at a concentration of 8 µg/ml to the microcentrifuge tube labeled ISO control.\nIncubate overnight at 4 °C. Following incubation, centrifuge at 700 x g for 10 min, discard the supernatant, replace with 1 ml of fresh nuclei storage buffer, resuspend and centrifuge again for 10 min at 700 x g. Discard the supernatant and replace with 1 ml of fresh nuclei storage buffer.\nAdd 1 µl of F(ab')2 Fragment of Goat anti-Rabbit IgG (H+L) antibody (FITC or equivalent green-fluorescent dye) to achieve a final concentration of 2 µg/ml.\n\tNote: The use of a F(ab')2 fragment antibody decreases the potential for non-specific labeling of immune cells including macrophages and B cells.\nWrap tubes in aluminum foil to protect from the light and incubate for 1 hr at 4 °C.\n4. Detection of EdU Incorporation\nDilute 10x concentrated EdU reaction buffer 1:10 with deionized water.\nCentrifuge the PCM-1 and ISO control labeled nuclei suspensions at 700 x g for 10 min, discard the supernatant and resuspend the nuclei pellet in 1 ml of 1% BSA/PBS solution. Wash the nuclei pellet twice.\nAfter the final wash, discard the supernatant and replace with 100 µl of EdU fixative.\nWrap tubes in aluminum foil to protect from the light and incubate at room temperature for 15 min.\nWash the samples twice with 1 ml of 1% BSA/PBS solution, centrifuge at 700 x g and incubate with 1x saponin-based permeabilization solution at room temperature for 15 min.",
    "Prepare 1x EdU labeling cocktail (Table 2). A minimum of 2 reactions will be required to include the no EdU control.\nAdd 500 µl of 1x EdU labeling cocktail directly to each sample already containing nuclei in 100 µl of 1x saponin-based permeabilization solution and incubate at room temperature protected from the light for 30 min.\nCentrifuge at 700 x g and resuspend in 1 ml of 1% BSA/PBS and repeat this step two more times.\nCentrifuge at 700 x g, discard supernatant and replace with 400 µl of DNA staining solution (see Table of Materials).\ntable:\n﻿0\nName of the reagent\n1. Cell Lysis Buffer\n0.32 M sucrose\n10 mM Tris-HCl (pH = 8)\n5 mM CaCl2\n5 mM magnesium acetate\n2.0 mM EDTA\n0.5 mM EGTA\n1 mM DTT\n2.Sucrose Gradient Solution\n2.1 M sucrose\n10 mM Tris-HCl (pH = 8)\n5 mM magnesium acetate\n1 mM DTT\n3. Nuclei storage buffer (NSB)\n0.44 M sucrose\n10 mM Tris-HCl (pH = 7.2)\n70 mM KCl\n10 mM MgCl2\n1.5 mM spermine\nTable 1: Nuclei isolation buffer ingredients. Recipe for all Buffers used in protocol section 3 (Nuclei dissociation and cardiomyocyte nuclei labeling).\n5. Flow Cytometric Analysis\nNote: Perform Flow cytometry on isolated nuclei as described previously7,11,15.\nFirst, create a plot describing Forward Scatter (FSC) and Side Scatter (SSC) to allow the discrimination of nuclei from debris (Figure 2A).\nCreate a plot to discriminate single nuclei from aggregates (Figure 2B) by plotting 4',6-diamidino-2-phenylindole) (DAPI) area (3-405/450/50-A) versus height (33-405/450/50-H). Ensure that the 3-405/450/50-A signal is collected on the linear scale to allow the correct determination of DNA content.\nCreate a plot describing 488/535/30-A (PCM-1) vs SSC and display only events from the singlet gate created in 5.2 in order to assess PCM-1 expression in the singlet population.",
    "Run the Isotype control sample in order to establish a PCM-1 positive gate (Figure 2C). Run a small amount of PCM1 labeled sample to verify the PCM1 expressing population and gating position.\nCreate a plot describing SSC-A vs 405/450/50-A (to detect DAPI). In this plot, display only singlet PCM1 expressing nuclei, using the gates created in 5.3. Use this plot to create an additional hierarchal gate that contains only 2N nuclei (Figure 2D).\nCreate a plot that describes 488/535/30-A vs 1-633/660/20-A to allow the identification of EdU labeling of the PCM1 expressing cardiomyocyte population. Display only nuclei which are singlet, PCM1+ and 2N using the above gating.\nRun heart sample from no EdU control to set the EdU positive gate (Figure 2E). Create the appropriate gate for EdU+ cells.\nRecord and quantify singlet, PCM-1 expressing, 2N nuclei that have incorporated EdU.\nCalculate this population as a percentage of total singlet, PCM1+ nuclei. This will provide the rate of neo-cardiomyocyte nuclei generation, during the 7 day EdU pulse period, as a percentage of total cardiomyocyte nuclei.\n\tNote: As DAPI binding to DNA is stoichiometric the fluorescence intensity is proportional to the amount of DNA. Determine ploidy based on the intensity of the 405/450/50-A signal, as described previously7.\nTo evaluate the ploidy within the total cardiomyocyte population use the plot established in 5.5 and a gating strategy based on DNA concentration7.\nimgsrc://cloudfront.jove.com/files/ftp_upload/53979/53979fig2.jpg",
    "Figure 2: Gating strategy to quantify cardiomyocyte EdU incorporation and ploidy. (A) Nuclei are discriminated from debris based on forward scatter (FSC) and side scatter (SSC). (B) A linear gate is created and the singlet nuclei population is identified based on DAPI labeling and the 405/450/50 height vs area signal. (C) Fluorescent gating allows the separation of cardiomyocyte nuclei (PCM-1-positive) and non-cardiomyocyte (PCM-1-negative) nuclei from heart tissue. (D) Intensity of DAPI signal is used to determine DNA concentration and thereby nuclei ploidy of the PCM1+ cardiomyocyte population. In mouse >80% of cardiomyocyte nuclei are diploid (2n). (E) Fluorescent gating allows the separation of 2N, cardiomyocyte nuclei which have incorporated EdU (PCM+/EDU+ = 0.9%) from 2N, cardiomyocytes which have not incorporated EdU (PCM+EDU-). All steps are detailed in the protocol 5.0. Example shown from mdx-/y mice on the C57/BL10 background. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/53979/53979fig2large.jpg]"
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}