{
  "id": 6713,
  "origin_website": "Bio",
  "title": "High-throughput Site-directed Scanning Mutagenesis Using a Two-fragment PCR Approach",
  "procedures": [
    "Primer design and orderingDownload and open AAscan software (Sun et al., 2013) to design mutagenic primers for the site-directed scanning mutagenesis. A screenshot of the AAscan software interface is shown in Figure 2.Replace the default DNA sequence given in AAscan with a DNA sequence which is to be mutated, including the flanking regions (40-50 nucleotides) at the 5′ and 3′ ends (DNA seq. incl.40-50 nt flanking regions).Define the position of the first nucleotide in the first triplet codon (Nt position of 1st triplet). This relates the given DNA sequence with the amino-acid numbering. In the example given in Figure 2, the 50 nucleotides from the vector upstream of the protein coding sequence are included as a flanking region. Therefore, the nucleotide A from the ATG codon, which corresponds to amino-acid residue 1, is at the position 51. Whenever possible, we recommend using a standard numbering scheme for the protein of interest. This does not have to match the amino-acid numbering in the expressed protein construct (which might include a signal peptide, purification tags, protease cleavage sites, linkers or fusion protein partners).Define up to two codons coding for an amino acid (Xxx) by which you want to replace other amino acids in the scanning mutagenesis, e.g., ‘GCG’ and ‘GCA’ for Ala (mut codon 1 and 2). If only one particular codon is to be used, include it into both mut codon 1 and 2 text fields. We recommend choosing the codons based on their frequency in the expression host and the GC content of the gene of interest. Select those codons which are most frequent in the expression host and, if possible, avoid those with high or low GC content if your gene of interest has a very high (> 60%) or very low (< 40%) GC content, respectively.",
    "For several constructs with GC content in a range 50-55 % which were to be expressed in human cell culture (HEK 293S), we used the most frequent codons for this host: GCC/GCT for Ala, GGC/GGA for Gly, and GTG/GTC for Val. On the other hand, if the gene of interest has a high GC content, it might be better to use codons with lower GC content, i.e., GCT/GCA for Ala, GGA/GGT for Gly and GTT/GTA for Val. Such codon choice minimizes the number of designed mutagenic primers with relatively high annealing temperatures.If a particular amino acid in the scanning mutagenesis region is already Ala, replace it with another amino acid Yyy by defining up to two corresponding codons, e.g., in alanine scanning mutagenesis replacing an existing alanine with a glycine (if Ala, use Gly). In choosing the codons, use the recommendations given in the previous step.Enter an amino acid mutagenesis range (text fields From and To) by using the amino-acid numbering scheme defined in Step A3.Define the primer design parameters. Based on our experience (Sun et al., 2013; Heydenreich et al., 2017), we recommend using the following parameters: minimal primer length (min length)–18 nucleotides (nt); maximal primer length (max length)–60 nt; minimal GC clamp (MinGCclamp)–2; optimized GC clamp (OptimisedGCclamp); minimal primer melting temperature (MinTm)–60 °C; maximal primer melting temperature (MaxTm)–70 °C; maximal difference between melting temperatures of forward and reverse primer (MaxDeltaTm)–5 °C; minimal distance from the mutation codon to the 3′ end of the primer (MinAnnealLen)–15 nt; length of the overlap sequence between the ends of the resulting PCR fragment (MinOverlap and MaxOverlap)–between 15 and 27 nt; the number of primer pairs designed for the mutation of every specified amino acid position (MaxSuggestions)–1.Define the output format. Use separate result columns for forward and reverse primers (Separate F and R).",
    "User can choose among the more (Long1 and Long2) or less (Short and mFASTA) detailed outputs.Click or touch Batch button. This gives two separate lists of the designed forward (‘n_F’) and reverse (‘n_R’) primers including their names and sequences (and other primer properties if output format Long1 or Long2 was chosen). ‘n’ in a primer name corresponds to an amino acid number which is to be mutated by using that primer.Order the designed primers from a company that provides synthesis of DNA oligonucleotides. Such company usually makes available an order sheet template file into which the AAscan output (obtained in Step A10) can easily be copied. When ordering, use a 96-well plate format with forward and reverse primers separated into different 96-well plates, but in such a way that a position of each forward primer corresponds to exactly the same position of the related reverse primer in the other 96-well plate (e.g., primers 103_F and 103_R at the position A6 in each 96-well plate). Order desalted DNA oligonucleotides already dissolved at concentration 100 μM either in nuclease-free water or in some standard buffer provided by the company (usually 10 mM Tris-HCl, 0.1 mM EDTA, pH 7.5); see Note 1.Purchase a pair of the desalted reverse-complementary primers which anneal approximately on the opposite side of the plasmid. It is advisable to choose such primers that bind either to the origin of replication or the antibiotic resistance gene. In this case, only the properly assembled plasmid DNA will allow growing the transformed bacteria on a plate with selection antibiotic. We use origin-of-replication ColE1 primers (see Materials and Reagents).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191230/20191230005316_6070.jpgFigure 2. AAscan software interface. In the example shown, the coding sequence is written in capital letters and the flanking regions are given in small letters (DNA seq incl. 40-50 nt flanking regions).",
    "The first nucleotide in the first triplet codon (ATG) is at the position 51 of the specified DNA sequence (Nt position of 1st triplet). The mutagenic primers designed for amino-acid residues 2-371 are separated into two output windows: the forward primers are listed in the left one and the reverse primers in the right one.PCREach mutation is generated in two separate PCRs (denoted A and B) resulting in two PCR fragments that are combined in subsequent Gibson assembly. Before performing PCR for all of the target mutations, we recommend testing PCR conditions on a small number (20-30) of randomly chosen mutations and modifying the protocol accordingly, as detailed in the original article by Heydenreich et al. (2017). We recommend testing different polymerases and buffer condition as well as DMSO addition. To identify efficient PCR conditions, we analyze each PCR product from the test mutation set in agarose gel electrophoresis. Nevertheless, we do not include this or any other control in the large-scale mutagenesis.Before doing the experiment, check the orientation of the gene of interest in its plasmid. This is important to determine how to combine in PCR mutagenic primers with the origin-of-replication ColE1 primers. A mutagenic primer and the appropriate ColE1 primer should anneal to complementary DNA strands; e.g., if the forward mutagenic primers are combined with ColE1B, the reverse mutagenic primers should be combined with ColE1A (and vice versa).Dilute the plasmid DNA template with nuclease-free water to concentration 1 ng/μl.Dilute the primers ColE1A and ColE1B with nuclease-free water to concentration 6 μM.Dilute the mutagenic primers in a 96-well plate with nuclease-free water to 6 μM.Two sets of PCRs are necessary. For each set of x mutagenesis PCR reactions, prepare a PCR master mix as defined in Table 1.Table 1. PCR master mixes.",
    "Each mixture is enough for x mutagenesis PCRs in 20 μl reaction volume.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191230/20191230005340_3590.jpgTo prepare PCR mixtures A, pipette using a multichannel pipette 19 μl PCR Master Mix A into each used well of a 96-well 200-μl PCR plate on ice and add to it 1 μl mutagenic primer (6 μM) from the appropriate primer set (forward or reverse, as discussed in Step B1). Close the 96-well PCR plate with a PCR seal.Prepare a PCR program as in Table 2 (see Note 2).Table 2. PCR program for DNA multiplication using Phusion polymeraseimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191230/20191230005355_3460.jpg*Size of the longest DNA fragment in kilobase pairs (kbp) to be amplified in PCR; the extension time is 30 s per 1 kbp.Preheat a thermocycler: a block to 98 °C (denaturation temperature) and a lid to 103 °C (see Note 3).Transfer the sealed 96-well PCR plate with the reaction mixtures directly from ice to the preheated thermocycler, close the lid and start the PCR program defined in Step B7.Keep the 96-well PCR plate with completed PCR on ice until further processing.To prepare PCR mixtures B, repeat the Steps B6-B9 by using PCR Master Mix B and the corresponding mutagenic primers (the second mutagenic primer set, as discussed in Step B1).DNA template digestion and reaction clean-upAfter completion of both PCRs A and B, transfer 20 μl PCR mixture A to the corresponding 20 μl PCR mixture B in a 96-well PCR plate using a multichannel pipette. In this step, we combine two fragment PCR products possessing the same mutation.Add 0.5 μl DpnI (20 U·μl-1) to each mixture of fragments, seal the 96-well plates and incubate them at 37 °C to digest methylated DNA template.",
    "DpnI digestion for 1 h is already enough, but the mixtures can be incubated for up to 18 h if this is more convenient in terms of time management.In order to purify the PCR fragments from the reaction mixture after the DpnI digestion, use ZR-96 DNA Clean & Concentrator-5 KitTM (Zymo Research) according to the manufacturer’s protocol, but use 10 μl elution buffer in the last step. This small volume should result in higher DNA concentrations for the subsequent Gibson assembly.Gibson assemblyIn a 96-well PCR plate on ice, mix 1 μl each mixture of cleaned PCR fragments with 3 μl 1.33x Gibson assembly mix (Recipe 2) by pipetting gently up and down ten times using a multichannel pipette set at volume 3 µl to avoid foaming (see Note 4).Transfer the sealed 96-well plate with Gibson assembly reaction mixtures into a preheated thermocycler (a block at 50 °C and a lid at 53 °C) and incubate it for 10 min at 50 °C followed by 1 h at 37 °C and a hold at 10 °C. Alternatively and especially for longer nucleotide overlaps within a pair of mutagenic primers (e.g., 21 or more nt; see Step A8), the Gibson assembly reaction can be conducted for 1 h at 50 °C followed by a hold at 10 °C. Which Gibson assembly conditions are better suited can be checked first on a small number (20-30) of randomly chosen mutations, as detailed by Heydenreich et al., 2017 (see Note 5).Cell transformationThaw chemically competent Escherichia coli XL-1 Blue cell suspension on ice (see Note 6).Onto a 96-well PCR plate on ice, distribute 20 μl cell suspension per each well and mutation using a repeat pipette.",
    "Add 2 μl Gibson assembly mixture to each 20-μl cell aliquot, seal the plate with a PCR plate seal and incubate on ice for 10-20 min.Transfer the 96-well plate with cells-DNA mixtures into a preheated thermocycler (a block at 42 °C and a lid at 42 °C) and incubate it for 60 s at 42 °C.Immediately put the cells-DNA mixtures on ice and incubate for 2-5 min. If the plasmid carries the ampicillin resistance gene, you can proceed immediately to Step E8 (although Steps E6 and E7 increase cloning efficiency in this case as well).Using a multichannel pipette, transfer the transformed cells to a 96-deep-well plate filled with 300 μl SOC media (without any antibiotic), close the plate with a gas-permeable seal and incubate for 1 h at 37 °C while shaking at 160 rpm.Spin down the cells (3,000 x g, 5 min) and carefully remove 220 μl supernatant using a multichannel pipette.Resuspend a cell pellet in the remaining supernatant (ca. 100 μl) by pipetting up and down using a multichannel pipette set at 80 µl (to avoid foaming) until all cell pellets are resuspended without visible clumps during pipetting. Plate the cell suspension onto an LB-agar plate with the appropriate antibiotic. To save some storage space and material, you can plate four different mutants per LB-agar plate (one mutant onto each plate quadrant) or 24 mutants on a 24-well LB-agar plate (one mutant per well) by using an expanding multi-channel pipette.Allow the plates to dry for ca. 10 min and then incubate them upside-down at 37 °C overnight. Next day, you should find bacterial colonies on the LB-agar plates.",
    "Plasmid DNA preparation and sequencingFor high-throughput projects, sequencing companies offer plasmid preparation and sequencing directly from a bacterial colony on 96-well plates without extra costs in comparison to sending already extracted plasmid samples. We strongly recommend this option.Label a position of a selected colony on an LB-agar plate, pick it by a sterile pipette tip or a toothpick and transfer it to LB-agar with the appropriate antibiotic in a 96-well plate. Such plates are usually offered by a sequencing company; if not, you can easily prepare them by your own (Recipe 3).Order the sequencing with the appropriate sequencing primer (forward or reverse). For reliable results, the sequencing primer should anneal at least 30-40 nucleotides upstream from the expected mutation. Depending on a sequencing service, one can usually expect reliable sequence read lengths of at least ca. 600 nucleotides (which corresponds to ca. 200 amino acids). For longer sequences, one should use additional sequencing primer(s) to cover the whole region of interest. Send the 96-well LB-agar plates with one colony per mutant to the sequencing company and wait for the sequencing results. Sending one mutant per sequencing round reduces sequencing costs.Analyze the sequencing results in MutantChecker software (Sun et al., 2013), as detailed in the Data analysis section.If the mutation is not confirmed in a sequencing round, send a new colony in the next sequencing round (see Note 8).You can obtain plasmid solutions in a 96-well plate from the sequencing company. Alternatively or in addition, you can prepare plasmids by yourself from the colonies labeled on LB-agar plates which were positive in sequencing."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}