{
  "id": 8735,
  "origin_website": "Jove",
  "title": "In Vitro Reconstitution of Self-Organizing Protein Patterns on Supported Lipid Bilayers",
  "procedures": [
    "1. Protein Production\nProtein expression\n\t\nTransform E. coli BL21 (DE3) pLysS with the respective plasmid for expression of MinD6, EGFP-MinD29, mRuby3-MinD24, MinE6 or MinC30. For plasmid maps, please see supplementary information.\nInoculate an overnight culture in LB medium with a single colony using the respective antibiotics (e.g.,100 µg/mL Ampicillin or 50 µg/mL Kanamycin) and incubate at 37 °C for 14-16 h while shaking.\nInoculate 500 mL of TB medium containing the respective antibiotic with the overnight culture (1:200 dilution) and incubate culture at 37 °C while shaking at 180 rpm.\nInduce protein expression by adding 0.5 mM IPTG when the culture reaches an optical density at 600 nm of 0.5-0.7. In case of EGFP-MinD or mRuby3-MinD, shift cells to an incubator with 16 °C and grow cells for 14-16 h, and in case of MinC, MinD or MinE, grow cells for 3-4 h at 37 °C after induction.\n\t\tNote: Induction of MinC, MinD or MinE expression is toxic for the cells, as overexpression results in cell division defects; hence, it is important that incubation time at 37 °C is kept below 4 h. If more protein is needed, increase the amount of culture, but not incubation time.\nAfter respective incubation time harvest cells by centrifugation at 4000 x g for 10 min and store the cell pellet at -80 °C until further use.\nProtein purification\n\tNote: Proteins can be purified either using prepacked Ni-NTA columns on an automated protein purification system or using Ni-NTA beads for gravity-flow bench purification.",
    "For purification with prepacked Ni-NTA columns on automated protein purification systems use buffer A1 (50 mM sodium phosphate pH 8.0, 500 mM NaCl, 10 mM imidazole), buffer B1 (50 mM sodium phosphate pH 8.0, 500 mM NaCl, 20 mM imidazole), and buffer C1 (50 mM sodium phosphate pH 8.0, 500 mM NaCl, 250 mM imidazole). For gravity-flow bench purification using Ni-NTA beads use buffer A2 (50 mM Tris-HCl pH 8.0, 300 mM NaCl, 10 mM imidazole), buffer B2 (50 mM Tris-HCl pH 8.0, 300 mM NaCl, 20 mM imidazole), and buffer C2 (50 mM Tris-HCl pH 8.0, 300 mM NaCl, 250 mM imidazole). Supplement all buffers with 10 mM ß-mercaptoethanol or 0.4 mM TCEP (tris(2-carboxyethyl)phosphine) as reducing agent right before use.\nResuspend cells in 20-30 mL of buffer A1 or A2 supplemented with EDTA-free protease inhibitor, 100 µg/mL lysozyme, ~250 U/mL DNase and 0.2 mM Mg2+-ADP (Mg2+-ADP in case of MinD or EGFP-MinD purification only, from a 100 mM ADP stock in 100 mM MgCl2 with pH adjusted to 7.5).\nLyse cells using a tip sonicator (30% amplitude, 2.5 min, 30 s pulse, 30 s off) while keeping the vial containing the cells in an ice bath.\nRemove cell debris by centrifuging the cell lysate for 45 min at 25,000 x g and 4 °C.\nIncubate the supernatant on Ni-NTA column or Ni-NTA beads.\n\t\t\nFor prepacked Ni-NTA columns, load the sample onto the column using the sample pump of an automated protein purification system.\nFor bench-top purification, incubate the sample with Ni-NTA beads in a 50 mL reaction tube on a rotating shaker at 4 °C for 1 h. For the subsequent steps, transfer the Ni-NTA beads into an empty column using a 25 mL pipette.\nWash with at least 5 column volumes of buffer A1 or A2.",
    "Wash with at least 5 column volumes of buffer B1 or B2.\nElute protein with buffer C1 or C2.\nAssess protein purity via SDS-PAGE.\nOptional: Further purify protein by applying it to a gel filtration column equilibrated in storage buffer (50 mM HEPES/KOH pH 7.2, 150 mM KCl, 10% glycerol, 0.1 mM EDTA, 0.4 mM TCEP, (0.2 mM Mg2+-ADP in case of MinD)).\n\t\tNote: Gel filtration is recommended for MinD to remove aggregated protein fraction.\nIf no gel-filtration is employed, exchange Ni-NTA elution buffer to storage buffer (50 mM HEPES/KOH pH 7.2, 150 mM KCl, 10% glycerol, 0.1 mM EDTA, 0.4 mM TCEP, (0.2 mM Mg-ADP in case of MinD)) using a gravity flow desalting column (see Table of Materials).\nShock-freeze proteins in aliquots in liquid nitrogen and store at -80 °C until further use.\nMeasure protein stock concentration using Bradford Assay, and determine protein activity with an ATPase assay20.\n\t\tNote: Do not assess protein concentration using absorption at 280 nm. The presence of nucleotide during MinD purification and the lack of tryptophans in MinE distort A280 concentration measurements. Use Bradford or BCA assays to measure protein concentrations instead.\nProtein labeling\n\tNote: The fusion of a fluorescent protein to the small protein MinE induces major changes to its diffusive properties and function; hence, chemical labeling of the protein (cysteine at position 51) is preferred over fusion to fluorescent proteins.\n\t\nDissolve 0.125 mg of maleimide-dye conjugate in 5-10 µL of DMSO (dimethyl sulfoxide) and add under shaking to a 0.5 mL MinE aliquot in storage buffer at pH 7.2, prepared as detailed above.\nIncubate for 2 h to overnight at 4 °C or 2 h at RT under gentle shaking or stirring.",
    "Separate dye and protein using a gravity flow desalting column equilibrated with storage buffer (50 mM HEPES/KOH pH 7.2, 150 mM KCl, 10% glycerol, 0.1 mM EDTA, 0.4 mM TCEP).\nTo further remove any unattached dye, dialyze the protein against an excess of storage buffer.\nVerify successful labelling by measuring the extinction at the maximum for the respective dye and calculate the estimated labeling efficiency. Please refer to the dye manufacturer’s instructions for a detailed protocol on estimating the degree of labeling. Analyze with SDS-PAGE and determine total mass by mass spectrometry for further useful information about sample homogeneity and labeling success.\n2. Small Unilamellar Vesicle (SUV) Preparation\nGeneration of multilamellar vesicles\n\t\nCalculate the amount of lipid(s) in chloroform for your desired mixture and final SUV volume. The concentration should be 4 mg/mL of lipids in Min buffer (25 mM Tris-HCl pH 7.5, 150 mM KCl, 5 mM MgCl2). For a standard Min assay a mixture of 7:3 DOPC:DOPG (mol percent) is recommended. When using E. coli polar lipid extract, use SLB buffer (25 mM Tris-HCl pH 7.5, 150 mM KCl) for all preparation steps.\n\t\tNote: It is not recommended for first time users to use E. coli polar lipid extract as the generation of homogenous SLBs with this mixture is much more challenging.\nUsing a positive displacement pipette with glass tips, mix the lipids in chloroform in a 1.5 mL glass vial.\n\t\t\nDry the lipids under a slight nitrogen stream while slowly turning the vial. Place the lipids under a stronger nitrogen stream for 10 to 20 minutes. Place the vial containing the dried lipid film in a vacuum desiccator and apply vacuum for at least 1 h.\nRehydrate the lipids in Min buffer by vortexing at room temperature until the mixture is homogeneously opaque.",
    "Note: For generation of small unilamellar vesicles from multilamellar vesicles, lipids can either be extruded as described in 2.2. or sonicated as described in 2.3. In general, extrusion yields a narrower size distribution which can help with formation of supported lipid bilayers.\nSUV preparation by extrusion\n\t\nBreak lipid aggregates and multilamellar structures and further solubilize lipids by freeze-thawing for 7 to 10 cycles.\n\t\t\nPrepare a beaker with water at 70° C to 99° C on a hot plate and a container with liquid nitrogen.\nHold the vial in liquid nitrogen with large tweezers until the nitrogen stops boiling. Then transfer the vial to hot water until the solution is completely thawed. Repeat these steps until the lipid mixture appears clear to the eye, depending on the mixture.\nAssemble a lipid extruder and pre-rinse the system with Min buffer. Extrude the lipid mixture between 35 and 41 times through a membrane of 50 nm pore size. Make sure to end on an odd number of passes to avoid aggregates that never traversed the membrane.\nSUV preparation by sonication\n\t\nTo better dissolve lipids in the buffer, put the glass vial containing the solution in a heat block set to 37 °C and vortex every 20 minutes for 1 minute. Incubate in total for about 1 h.\nImmerse the bottom of the vial in a sonicator bath (in this work 1.91 L, 80 W) by attaching the vial onto a clamp stand at the required height.\nSet the water height in the sonicator bath so that the solution surrounding the vial is thoroughly agitated by the pulses and sonicate the lipid mixture for about 20 minutes. Check for successful sonication by assessing the clarity of lipids.",
    "SUVs can be stored at 4 °C for up to a week or frozen at -20 °C in small aliquots (~20 µL) and stored for several weeks. Thaw vials or tubes at room temperature and sonicate again as described under 2.2.3 or 5.3 until the solution is clear before using SUVs for preparation of supported lipid bilayers (SLBs). Please note that the narrow size distribution of SUVs obtained by extrusion is lost after freezing and subsequent thawing and sonication.\n3. Cleaning Glass Coverslips\nNote: Cleaning and hydrophilization of glass coverslips is an important factor for homogenous and fluid supported lipid bilayers. Glass coverslips can be cleaned using a piranha solution, made from a ratio of 7:2 sulfuric acid to 50% hydrogen peroxide (3.1), or with an oxygen plasma in a plasma cleaner (3.2). Both methods yield similar results.\nPiranha cleaning of coverslips\n\t\nApply piranha solution\n\t\t\nDistribute glass coverslips on an inverted glass Petri dish or other inert surface. With a glass pipette, add 7 drops of concentrated sulfuric acid (98%) to the center of each coverslip.\n\t\t\tCAUTION: Sulfuric acid is strongly acidic and corrosive. Work in a fume cupboard and with proper protective equipment only.\nAdd two drops of 50% hydrogen peroxide to the middle of the acid drops.\n\t\t\tCAUTION: Hydrogen peroxide is corrosive to the eyes and skin.\nCover the reaction and incubate for at least 45 minutes.\n\t\t\tNote: The maximum waiting time here is not critical for the outcome of the experiment and can be extended up to several days.\nWash piranha cleaned coverslips.\n\t\t\nPick up the coverslips individually using tweezers and rinse off acid with ultrapure water. Place the washed coverslips in non-stick holders or similar transportation device.",
    "Rinse each coverslip extensively with ultrapure water and dry the surface with pressurized gas (nitrogen, air only if oil-free). Mark the cleaned side of the coverslip with permanent marker.\nPlasma cleaning of coverslips\n\t\nRinse coverslips with excess ethanol and afterwards with excess ultrapure water. Dry coverslips with pressurized gas. Assemble chamber as described in 4.\nAfter chamber assembly as described in 4 take the coverslips with attached chamber and place in plasma cleaner with oxygen as process gas. Clean coverslips with plasma (in this work 30% power, 0.3 mbar oxygen pressure for 1 min was used). Do the cleaning right before SLB formation as described in 5, as the hydrophilizing effect of plasma cleaning wears off over time.\n\t\tNote: Timing and power of plasma cleaning should be optimized using fluorescently labeled membranes, as too little or excessive plasma cleaning can both lead to immobile membranes or membranes with holes.\n4. Chamber Assembly\nWith sharp scissors, cut off and discard the lid and the conical part of a 0.5 mL reaction tube. Apply UV-glue to the upper rim of the tube and distribute evenly by using a pipette tip.\nGlue the tube upside down to the previously cleaned coverslip. In case of piranha cleaning make sure to glue it to the cleaned side of the glass. Cure the UV-glue by placing multiple chambers underneath a 360 nm lamp or LED for 5 to 15 minutes.\n5. Supported Lipid Bilayer (SLB) Formation\nPre-heat heat block to 37 °C and incubate 2 mL reaction tubes with Min or SLB buffer, 1 tube per chamber.",
    "Blow nitrogen into the assembled and cured chambers to remove any dust or other particles that may have settled during the UV curing and assembly. Plasma clean as described in 3.2 if you have not cleaned your coverslips with Piranha solution (3.1). Place chambers on heat block.\nDilute a 20 µL aliquot of clear lipids (at 4 mg/mL) with 130 µL of Min buffer or SLB buffer in case of E. coli polar lipid extract, yielding a working concentration of 0.53 mg/mL. In case lipids were frozen, sonicate first by holding the tube into a bath sonicator before adding buffer, then sonicate again with buffer.\nAdd 75 µL of lipid mixture to each chamber and set a timer to 3 minutes (for DOPC/DOPG mixtures; longer incubation may be necessary for other lipid mixtures). In case of E. coli polar lipid extract, pipette CaCl2 from a 100 mM stock into the chamber to a final concentration of 3 mM. During the incubation time, the vesicles burst on the hydrophilic glass surface and fuse to form a coherent SLB.\nAfter 60 seconds, add 150 µL of Min buffer to each chamber.\nWashing the chambers: After another 120 seconds (3 minutes total) wash each chamber by adding 200 µL of Min or SLB buffer, carefully pipetting up and down a few times, removing and adding another 200 µL.\n\t\nAfter each chamber has been washed once, proceed to wash the first chamber thoroughly until the 2 mL of buffer are used up. Washing of SLBs needs some experience to perfect the extent of motions in the chamber and find the correct washing intensity.\n\t\tNote: Never remove all liquid from the chamber to avoid drying of the SLB.",
    "Note: On top of washing, membrane properties will vary depending on many additional factors: Type of lipids and their relative concentrations in lipid mixtures, preparation method for SUVs, surface treatment and prior cleaning of support.\n6. Self-organization Assay\nAdjust buffer volume in the chamber to 200 µL Min buffer minus the amount of protein and ATP solution, then add MinD, labeled MinD, MinE, and, if desired, MinC. Gently mix components by pipetting. Example concentrations are 1 µM MinD (doped with 30% EGFP-MinD), 1 µM MinE (doped with 10% chemically labeled MinE) and 0.05 µM MinC, but patterns form over a range of concentrations6,10,20,30.\nAdd 2.5 mM ATP (from 100 mM ATP stock in 100 mM MgCl2, pH 7.5) to start the self-organization of MinDE.\n\tNote: The order of the component addition (MinD, MinE and ATP) can be varied and will not influence the final pattern outcome4.\nObserve MinDE self-organization on the fluorescence microscope (see Table of Materials). MinDE self-organization can also be observed using TIRF microscopy. For imaging eGFP-MinD, use a 488 nm Argon laser or comparable diode laser (e.g., 490 nm). For imaging mRuby3-MinD, it is best to employ a 561 nm diode laser.\n\tNote: Avoid high levels of excitation for longer times as we and others17 have observed phototoxicity in the MinDE system, leading to irreversible protein polymerization on the membrane.\n7. PDMS microstructures\nNote: PDMS (polydimethylsiloxane) is a polymer that can be used for the production of microstructures and microfluidic devices. A patterned silicon wafer serves as a mold for casting the PDMS structures. The PDMS structures then serve as a support for SLB formation and assay setup.",
    "Either produce silicon wafer with microcompartments yourself using photolithography (see Zieske and Schwille for a detailed protocol31 or Gruenberger et al. for a video protocol32) or order your desired silicon wafer from a foundry. For the pattern of the wafer used herein please see supplementary information.\nProduction of PDMS microstructures from patterned silicon wafers.\n\t\nUse a plastic cup to weigh 10 g of PDMS base and 1 g of PDMS crosslinker. Either use a mixing device to mix and degas the PDMS mixture or manually mix the PDMS and then degas under vacuum.\nUse a pipette tip to drop a small amount of PDMS directly onto the structure on the silicon wafer.\n\t\tNote: Be careful not to scratch the silicon wafer.\nImmediately place a #1 coverslip onto the PDMS drop and take the upper end of a clean pipette tip to gently press the coverslip onto the silicon wafer. The PDMS should be spreading thinly between the coverslip and the silicon wafer.\nPlace the wafer with the coverslips into an oven and cure the PDMS for 3-4 hours or overnight at 75 °C. Remove the wafer from the oven and let it cool down to room temperature. With a razor blade, carefully remove the coverslip with the attached PDMS from SI wafer.\n\t\tNote: To prevent the silicon wafer from getting dirty or damaged, always cover the microstructures with PDMS and a coverslip. However, PDMS ages, resulting in cracks in the microstructures, hence do not use PDMS structures that are older than two to three weeks.\n8. Self-organization in PDMS Microstructures\nUse coverslips with PDMS microstructures to attach a chamber as described under 4.\nClean and hydrophilize surface in an oxygen plasma cleaner as described under 3.2.2. Do not piranha clean PDMS substrates.",
    "Setup a MinDE self-organization assay as described under 6.\nAfter setting up the assay, check for regular MinDE pattern formation and properly formed microstructures on the fluorescence microscope.\nWhen regular MinDE patterns have formed (10 - 30 min), gently pipette up and down twice to mix components and then remove the buffer step by step by pipetting. Remove the large bulk of buffer using a 100 µL pipette and then carefully remove the rest using a 10 µL pipette.\n\tNote: This step might need some practice. If too much buffer is taken out or the process takes too long, the microstructures will be dried out; if too little is taken, the proteins will not be confined in the microstructures, but continue to form traveling surface waves.\nImmediately close the chamber with a lid to avoid drying of the residual buffer in the microstructures.\nTo allow for longer imaging times, plug a moistened piece of sponge inside the chamber and then close with lid. Make sure the sponge does not contact the surface of the coverslip.\nBefore imaging of the microstructures check on the surface that the buffer was lowered enough, so that in the surface above the microstructures MinDE pattern formation has halted. Image MinDE oscillations in microstructures. Check that microstructures are not dried out or are drying out during imaging.\n\tNote: Discard coverslips with microcompartments after each use, as cracks in the PDMS form.\n9. Analysis of MinDE pattern formation\nQuantify wave length, wave velocity and wave profiles of the MinDE self-organization on planar supported lipid bilayers. FIJI with the standard set of packaged plugins is sufficient for basic analysis33.\nAnalyze pole-to-pole oscillations in microcompartments by obtaining kymographs and time-averaged protein concentration profiles. Basic kymographs can be obtained by re-slicing a time series along a line selection in FIJI."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}