{
  "id": 7326,
  "origin_website": "Bio",
  "title": "A Novel Method to Make Polyacrylamide Gels with Mechanical  Properties Resembling those of Biological Tissues",
  "procedures": [
    "Glass coverslip functionalizationAdhesive coverslipsPour 100 ml 0.1 M NaOH into a 250-ml glass beaker and preclean each coverslip by immersing in NaOH; allow them to air-dry.Under the chemical hood, pour 100 ml 3-APTMS solution into a 250-ml glass beaker and immerse the coverslips for 3 min.Wash the coverslips 3-5 times with 100 ml MilliQ water until no foam is observed in the water.CRITICAL STEP: Residual 3-APTMS will react with glutaraldehyde in the next step and produce an orange precipitate. If this happens, discard the coverslips and start from step a).Prepare 200 ml 0.5% glutaraldehyde in MilliQ water in a 250-ml glass beaker. Place the coverslips in a mini-rack and immerse in glutaraldehyde solution for 1 h.Air-dry the coverslips and store under vacuum at room temperature.Non-adhesive coverslipsUnder a chemical hood, prepare 100 ml 5% SurfaSil Siliconized Fluid in acetone.Immerse the coverslips in SurfaSil solution for 10 s and agitate to ensure a uniform coat.Rinse the coverslips with clean acetone.Rinse the coverslips with methanol.Air-dry the coverslips and store at room temperature.Preparation of the linear polyacrylamide solutionPrepare a 10% (w/v) solution of APS in H2O before use. For long-term storage, aliquot the solution into 500-µl Eppendorf tubes and store in a -20°C freezer. Avoid freeze-thaw cycles. Solutions stored at room temperature are not stable. For the most effective polymerization, we recommend preparing a fresh 10% (w/v) solution of APS immediately prior to each gel preparation.In a 50-ml glass bottle, mix acrylamide, H2O, TEMED, and 10% APS according to the recipe in Table 1.CAUTION: The linear polyacrylamide solution can be made as inert or activated with the capability of binding adhesive proteins. If you aim to prepare activated linear polyacrylamide, substitute 1 ml H2O with 1 ml 4% NHS-acrylate in DMSO, according to Table 1.",
    "CRITICAL STEP: It is important to use very low amounts of polymerization initiator (APS) to ensure the formation of very long linear polyacrylamide chains with radii of gyration much larger than the mesh size of the crosslinked network of polyacrylamide. This prevents the linear chains from diffusing out of the polyacrylamide network during the time of the experiment.Table 1. Composition of linear polyacrylamide solution in ml for a total volume of 10 mltable:",
    "﻿0,1,2,3,4,5\n,40% acrylamide solution,H2O,TEMED,10% APS,4% NHS in DMSO\nInert,1.25,8.72,0.005,0.025,-\nActivated,1.25,7.72,0.005,0.025,1",
    "Polymerize for 1 h at 37°C.Cover the bottle with aluminum foil to protect it from light. Store at 4°C. If linear polyacrylamide is properly polymerized, it can be stored for months.CAUTION: The linear polyacrylamide solution is highly viscous; therefore, it is difficult to pipette it accurately. We suggest cutting the pipette tip before transferring and transferring the solution slowly. Preparation of viscoelastic polyacrylamide gelsIn an Eppendorf tube, mix acrylamide, bis-acrylamide, linear polyacrylamide, H2O, and 4% NHS-acrylate in DMSO (if applicable) according to the recipe presented in Table 2.CRITICAL STEP: Mix the solution very gently by pipetting it up and down. It is important not to introduce air bubbles into the mixture. If you fail, you might need to degas the solution in a vacuum desiccator. The presence of air bubbles in the mixture will disrupt polymerization and change the mechanical properties of the resulting gels.Table 2. Composition of viscoelastic polyacrylamide gels in µl for a total volume of 500 µl imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210818/20210818191900_5178.png Add TEMED and 10% APS according to Table 2, gently mix and pipet 100 µl gel mix onto the adhesive coverslip, and place the non-adhesive coverslip on top of the droplet.After 15 min, add MilliQ water around the gel to avoid drying on the sides.After an additional 15 min, remove the non-adhesive coverslip from the top of the gel, place the gel in a 6-well plate, and immerse in water.CAUTION: The mechanical properties of the gels depend strongly on the quality of the reagents used for the gel formulation, accuracy in pipetting, and mixing of the mixture. Most of the failures in gel polymerization come from mistakes in APS and TEMED pipetting and mixing or inappropriate storage of these solutions.",
    "Briefly, TEMED should be kept in the dark, and APS, which is not stable in water, should be freshly prepared for the most effective polymerization. We strongly recommend directly measuring the viscoelasticity of the gels using a rheometer after every separate preparation. In our experience, mixing and pipetting is not always identical, and G’ tends to decrease as reagents get old, apparently due to oxidation. Thus, discrepancies in the measured G’ and G’’ values can be as large as 50%. Attachment of the adhesion proteinsViscoelastic polyacrylamide gels consist of an acrylamide and bis-acrylamide network polymerized in the presence of linear polyacrylamide chains that are incorporated into the network, which determine its viscous properties. Our method allows for the covalent binding of proteins to the polyacrylamide network, linear polyacrylamide, or both.Attachment of adhesion proteins to only the linear polyacrylamideTo prepare activated linear polyacrylamide that can be crosslinked to the protein of interest, follow section “B. Preparation of the linear polyacrylamide solution” and the recipe from Table 1 for activated linear polyacrylamide. The resulting linear polyacrylamide chains will covalently bind proteins upon incubation with the protein of interest diluted to 0.1 mg/ml protein in 50 mM HEPES pH 8.2 for 2 h at room temperature or overnight at 4°C (both incubations result in uniform coating). For protein incubation, prepare a minimum of 80 µl 0.1 mg/ml protein solution per 18-mm diameter gel. The larger the gel, the more protein solution is needed.CAUTION: Incubation with the proteins is performed following polymerization of viscoelastic gels using activated linear polyacrylamide chains immediately after their incorporation within the acrylamide/bis-acrylamide network. Linear polyacrylamide chains of the viscoelastic gel cannot be selectively activated after polymerization of the crosslinked network.",
    "After incubation with the protein, rinse the gels 3 times with 100 µl PBS and store in PBS at 4°C until cell seeding, but not longer than a couple of days.Attachment of the proteins to only the crosslinked polyacrylamide network4% NHS in DMSO methodPrepare fresh 4% NHS solution in DMSO.Add 50 µl 4% NHS in DMSO per 500 µl gel mix volume according to Table 2.CAUTION: 4% NHS solution in DMSO is added to the gel mix prior to polymerization. The crosslinked polyacrylamide network of the viscoelastic gel cannot be selectively activated post-polymerization. When APS and TEMED are mixed in, cast the gels between adhesive and non-adhesive coverslips, as previously described (Section C: Preparation of viscoelastic polyacrylamide gels).Once the gel is rinsed and soaked in 50 mM HEPES pH 8.2, illuminate with UV light under the hood for 15 min. From this step forward, gels that will be used for cell seeding should be maintained under aseptic conditions.Immerse the gels in the protein of interest diluted to 0.1 mg/ml protein in 50 mM HEPES pH 8.2 and incubate for 2 h at room temperature or overnight at 4°C (both incubations result in uniform coating).Rinse 3 times with PBS and store at 4°C until cell seeding, but not longer than a couple of days.NHS-acrylate in toluene methodUnder the chemical hood, prepare 0.5 ml 2% NHS-acrylate in toluene solution.Prepare the gel mix without APS and TEMED following the recipe from Table 2, with one modification, i.e., replace 50 µl 4% NHS in DMSO with 50 µl MilliQ water.Add 100 µl 2% NHS-acrylate in toluene solution per 500 µl gel mix and agitate until the solution becomes uniformly turbid.",
    "Leave for 5 min at room temperature and then centrifuge at 10,000 × g for 5 min to separate the toluene from the gel mix.Remove the toluene (upper) layer using a 200-µl pipette and transfer the gel mix to a new tube.Add APS and TEMED to initiate polymerization and cast the gels between adhesive and non-adhesive coverslips, as previously described (Section C: Preparation of viscoelastic polyacrylamide gels).Once the gel is rinsed and soaked in 50 mM HEPES pH 8.2, illuminate with UV light under the hood for 15 min. From this step forward, gels that will be used for cell seeding should be maintained under aseptic conditions.Immerse the gels in the protein of interest diluted to 0.1 mg/ml protein in 50 mM HEPES pH 8.2 and incubate for 2 h at room temperature or overnight at 4°C (both incubations result in uniform coating). For protein incubation, prepare a minimum of 80 µl 0.1 mg/ml protein solution per 18-mm diameter gel. The larger the gel, the more protein solution is needed.Rinse with 100 µl PBS 3 times and store in PBS at 4°C until cell seeding, but not longer than a couple of days.Attachment of proteins to both the linear polyacrylamide and crosslinked polyacrylamide networksSoak the gels in 50 mM HEPES pH 8.2 for 15 min.Prepare 5 mM sulfo-SANPAH in 25% DMSO and 75% 50 mM HEPES pH 8.2 (first dissolve sulfo-SANPAH in DMSO, then add HEPES in MilliQ water). A minimum of 80 µl 5 mM sulfo-SANPAH solution per 18-mm diameter gel is needed.CAUTION: We strongly recommend preparing fresh sulfo-SANPAH solution prior to each gel preparation and not storing it longer than 1 day.",
    "Cover the surface of each gel with 80 µl sulfo-SANPAH solution (for an 18-mm diameter gel) and illuminate with UV light (320-365 nm) for 10-15 min under the hood. From this step forward, gels that will be used for cell seeding should be maintained under aseptic conditions. Properly activated sulfo-SANPAH should change color from bright orange to a darker burnt orange or brown.CAUTION: Do not overexpose the gels to UV light and do not allow the gels to dry during irradiation. Rinse the gels 3-5 times with 100 µl 50 mM HEPES pH 8.2 until all the sulfo-SANPAH has been removed.Immerse the gels in the protein of interest diluted to 0.1 mg/ml protein in 50 mM HEPES pH 8.2 and incubate for 2 h at room temperature or overnight at 4°C (both incubations result in uniform coating). For protein incubation, prepare a minimum of 80 µl 0.1 mg/ml solution per 18-mm diameter gel. The larger the gel, the more protein solution is needed.Rinse 3 times with 100 µl PBS and store in PBS at 4°C until cell seeding.CAUTION: We recommend using the gels within a couple of days of preparation and not placing them in long-term storage. On long time scales (day to weeks), linear polyacrylamide chains can diffuse out of the gel surface and alter their mechanical properties. Cell seedingThirty minutes before seeding the cells, soak the gels in media and keep at 37°C.Trypsinize the cells and prepare a cell suspension at the concentration of interest (to study cell-substrate interactions, single cells are typically needed).Remove the media used for soaking the gels and replace with the cell suspension. Keep the gels in the incubator at 37°C. Cells will start to spread upon contact with the gel surface."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}