{
  "id": 5884,
  "origin_website": "Bio",
  "title": "Analysing Temporal Dynamics of T Cell Division <em>in vivo</em> Using Ki67 and  BrdU Co-labelling by Flow Cytometry",
  "procedures": [
    "In vivo administration of BrdUNotes:  BrdU is initially administered by intraperitoneal injection to enable precise timing of the start of administration. Following this initial injection, mice are maintained on BrdU administered via the drinking water, to avoid undue stress that might be caused by repeated injections.A mouse that has not been fed BrdU should also be included, to allow isolation of BrdU-unlabelled cells from the same population to be used as a negative control to determine background levels of staining for the anti-BrdU antibody. Prepare a working solution of 4 mg/ml BrdU by diluting 10 mg/ml BrdU stock solution (provided in BrdU FITC Flow Kit) in sterile PBS. Note: This can be prepared in advance and aliquots stored at -20 °C for up to two months. Protect from light and avoid repeated freeze-thaw cycles.Inject 200 μl of BrdU working solution (i.e., 0.8 mg BrdU) per mouse via the intraperitoneal route.Dilute 25x BrdU/Sucrose (see Recipes) to 1x in mouse drinking water. The final concentration in drinking water is 0.8 mg/ml BrdU and 0.5% sucrose. Note: Water bottles should be protected from light. Sucrose is included here to ensure palatability of the drinking water containing BrdU. BrdU has a limited stability in drinking water and must therefore be refreshed regularly to maintain the dosage level.Maintain BrdU in drinking water for the desired timeframe, refreshing every 2-3 days.To withdraw BrdU treatment for a delabelling timecourse, at the required timepoint replace the water bottle containing BrdU with a bottle containing normal drinking water.Co-staining with BrdU and Ki67 for flow cytometry analysisNote: Refer to the manufacturer’s instructions in the FITC BrdU Flow Kit. Keep samples on ice (except where indicated) and protect from light. Day 1.",
    "Staining for cell surface markers, fixation and permeabilisationEuthanise BrdU-treated mice by cervical dislocation and remove the organs containing the populations of interest for analysis–for example, lymph nodes. Place the lymph nodes onto a piece of nylon mesh in a Petri dish containing 3 ml of PBS/BSA (see Recipes). Cover with a second piece of nylon mesh and use forceps to apply pressure to this top piece of mesh, gently crushing the organs and releasing the cells into the buffer. Use a pipette to collect the 3 ml of buffer containing the cells in suspension and transfer this cell suspension to a FACS tube.Perform cell counts and transfer 2 million total cells to FACS tubes for staining.Notes:  CD4 effector memory T cells are approximately 1% of total lymph node cells. Staining 2 million total lymph node cells typically permits analysis of at least 10,000 CD4 effector memory T cells.It may be possible to stain fewer cells using this protocol, using the same volumes indicated for 2 million cells, but this has not been tested.Wash cells by adding 1 ml of PBS/BSA to each tube and centrifuge at 300 x g for 5 min at 4 °C. Discard supernatant.Resuspend cells in 100 μl of Surface Marker Antibody Cocktail (see Recipes) and incubate for 1 h on ice.Notes:  The surface marker staining panel described here was used for the identification of CD4 effector memory cells in mouse lymph nodes, but could be adapted as required to study other populations of interest.Staining controls using cells from BrdU treated mice should be processed alongside experimental samples. Staining controls should include: single colour controls for each antibody used, an unstained control, and a fluorescence-minus-one control for Ki67-eFluor660.",
    "Additionally, cells from a mouse not fed BrdU should be stained with all antibodies as a negative control to determine background levels of staining for the anti-BrdU antibody.Wash cells by adding 1 ml of PBS/BSA to each tube and centrifuge at 300 x g for 5 min at 4 °C. Discard supernatant.Fix and permeabilise cells by resuspending in 100 μl Cytofix/Cytoperm buffer (provided in FITC BrdU Flow Kit) and incubate for 30 min on ice.Wash cells by adding 1 ml freshly prepared 1x Perm/Wash buffer (see Recipes), centrifuge at 300 x g for 5 min at 4 °C and discard supernatant.Resuspend cells in 1 ml PBS/BSA and store at 4 °C overnight. Note: Overnight storage is not mandatory, but may be preferable when processing large numbers of samples. Proceed directly from step B1f to step B2c if overnight storage is not required.Day 2. Co-staining for BrdU and Ki67Recover cells from storage and centrifuge at 300 x g for 5 min at 4 °C, discard supernatant.Wash cells by resuspending pellet in 1 ml of freshly prepared 1x Perm/wash buffer, centrifuge at 300 x g for 5 min at 4 °C and discard supernatant. Resuspend cells in 100 μl Cytoperm Permeabilisation Buffer Plus (provided in FITC BrdU Flow Kit) and incubate for 10 min on ice.Wash the Cytoperm Permeabilisation Buffer Plus off the cells by adding 1 ml of freshly prepared 1x Perm/Wash buffer, centrifuge at 300 x g for 5 min at 4 °C and discard supernatant.Repeat fixation by resuspending cells in 100 μl of Cytofix/Cytoperm buffer and incubate for 5 min at room temperature.Wash cells by adding 1 ml of freshly prepared 1x Perm/Wash buffer, centrifuge at 300 x g for 5 min at 4 °C and discard supernatant.",
    "Expose incorporated BrdU by resuspending cells in 100 μl of 300 μg/ml DNase (see Recipes) and incubate for 1 h at 37 °C.Wash cells by adding 1 ml of freshly prepared 1x Perm/Wash buffer, centrifuge at 300 x g for 5 min at 4 °C and discard supernatant.Co-stain for BrdU and Ki67 by resuspending cells in 50 μl 1x Perm/Wash containing anti-BrdU FITC (provided in FITC BrdU Flow Kit) at a dilution of 1:50 and anti-Ki67 eFluor660 at a dilution of 1:200. Incubate for 1 h at room temperature.Wash cells by adding 1 ml of freshly prepared 1x Perm/Wash buffer, centrifuge at 300 x g for 5 min at 4 °C and discard supernatant.Repeat wash to ensure all residual unbound antibody is removed from cells.Acquire samples on a flow cytometer equipped with appropriate lasers and filters for the detection of FITC and eFluor660 fluorescence."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}