{
  "id": 6944,
  "origin_website": "Bio",
  "title": "<em>Candida albicans</em> Agar Invasion Assays",
  "procedures": [
    "Invasion of cells spotted on top of agarNotes: If working with strains from a large collection of mutants, use PCR to confirm that the appropriate genes are deleted in the mutant strains. To help distinguish between mutants that are defective in the initiation or maintenance of invasive growth, cells can be preinduced to form hyphae in liquid by incubation for 90 min at 37 °C in YPD plus 10% BCS or 50 mM GlcNAc prior to application onto the surface of an agar plate (Naseem et al., 2019). (Mutants that are defective in maintenance will not continue to form hyphae. Mutants with a defect in initiation, but not maintenance, can continue to form hyphae if they are first induced under conditions that will stimulate hyphal growth.) Wild type and mutant C. albicans cells are streaked on to YPD plates from frozen stocks and incubated for 2 days at 30 °C.A single colony from freshly streaked overnight culture grown on a YPD plate is transferred with an inoculating loop into 5 ml YPD liquid medium in a 15 ml glass tube. Grow cells overnight in a 30 °C incubator on a roller. Harvest the cells from the overnight culture by centrifuging for 5 min at 1,000 x g in a 15 ml centrifuge tube. Resuspend the pellet in 10 ml PBS and centrifuge it again at 1,000 x g for 5 min. Repeat the same process twice and then resuspend the cells into 5 ml PBS.Adjust the cells to 1 x 107 cells/ml. A convenient way to do this is to use a spectrophotometer at 600 nm wavelength. However, it is necessary to first set up a calibration curve to determine the relationship between cell number and optical density (OD).",
    "The relationship can vary between different spectrophotometers because a spectrophotometer measures light scattering, not absorbance. The final cell density can then be adjusted as follows: [Cell density desired] x [volume 1] = [Cell density initial] x [volume 2]. (Note that the volumes are indicating a ratiometric relationship. Volume 1 is the amount of cells that the investigator wants to use. This depends on how big of an experiment they are doing. Volume 2 is determined by volume 1.)Use a micropipettor to spot a sample of each strain (3 μl of 1 x 107 cells/ml in PBS) onto the surface of a 10 cm agar plate (Figure 2B). Place the spots at least 2 cm apart to prevent inhibition of growth due to nutrient depletion. See Figure 2A for a template.Note: On a typical 10 cm Petri plate we can spot at least 12 strains.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818192001_9836.jpgFigure 2. Spotting cells onto agar. A. Template for spotting cells on a Petri plate. B. Spotting cells onto the surface of a Petri plate with a micropipettor. C. Transferring cells onto the surface of an agar plate with a pinner.Repeat this step to spot the samples onto different types of media to test invasive growth under different conditions, including agar with Bovine Calf Serum (BCS), GlcNAc, alkaline pH, and spider medium. Recipes are described below. The concentration of agar can be varied when preparing the medium to test the effects of differing the rigidity of the surrounding matrix (Douglas et al., 2013) (see Recipe 2 below). Additional types of media that stimulate invasive hyphal growth have also been described (Liu et al., 1994; Biswas and Morschhauser, 2005; Vinces et al., 2006).Invert the plates and incubate plates at 37 °C.",
    "It may be necessary to add a tray of water to the incubator to maintain humidity to prevent the plates from drying out if keeping plates for over 5 days.Monitor the edge of the spots for invasive growth daily by eye (Figure 3A) or use a microscope (Figure 3B). It may be possible to detect initiation of invasive growth with the aid of a microscope after 1 day. Visible signs of invasive growth may take 2 days to one week.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818192027_0999.jpgFigure 3. Invasive growth of C. albicans cells spotted on top of agar. A. The indicated cell types were spotted onto the surface of an agar plate with 4% BCS, and then incubated at 37 °C for 7 days. The plate was then photographed before (left side) or after (right side) washing off the non-adherent cells. B. Higher magnification of the edges of spots showing invasive hyphal growth defect for the rvs161∆ mutant. Panel A: Scale bar = 1 cm; Panel B: Scale bar = 200 μm.Invasion of cells applied to surface of agar with a 48 prong pinnerTo facilitate the analysis of a large set of strains, a 48 prong pinner can be used to transfer cells to the surface of an agar plate (e.g., a Boekel Microplate Replicator). A 48 prong pinner is used because it can transfer cells onto agar in a standard 10 cm-sized Petri plate.Inoculate strains into wells of a 96-well flat bottom polystyrene plate containing 300 µl appropriate liquid medium. Incubate overnight at 30 °C until growth is saturated.Sterilize 48 pin replicator.Assemble four containers together in a row (empty Petri dishes or empty micropipette tip box lids may be used).",
    "Fill containers with 25 ml sterile deionized H2O, 10% bleach, or 97% ethanol in the following order: #1 = H2O, #2 = 10% bleach, #3 = H2O, #4 = 97% ethanol.First, dip replicator into H2O, agitate to clean pins, then blot replicator on Whatman filter paper.Place replicator into 10% bleach for 20-40 s. Blot replicator on filter paper.Transfer to second container of H2O, agitate to rinse pins, blot replicator on filter paper one last time.Dip replicator into 97% ethanol (do not blot).Shake off excess ethanol, and pass through the flame of a Bunsen burner.Once flames have extinguished, turn replicator ninety degrees, dip into 97% ethanol and flame.After cooling, turn replicator ninety degrees once again, dip into 97% ethanol, flame, and cool.Insert cooled sterile replicator into the 48 wells on the left half of the 96-well strain plate.Mix wells of plate with replicator pins, and then press replicator lightly onto Petri plate containing the desired medium (e.g., 2% agar containing 4% BCS). Repeat this procedure to pin cells onto plates containing additional types of media.Repeat sterilization of replicator (Steps B2c to B2i) when switching to new strains.Incubate pinned plates at 37 °C for 48 h and examine for invasive growth as described above (Step A8).Embedding method for analysis of invasive hyphal growthEmbedding cells in agar is an excellent way to determine invasive growth since the cells are surrounded by agar in three dimensions. However, it can be more difficult to compare a set of mutant strains since they each have to be analyzed on a different Petri plate. Thus, a good approach is to screen mutants by spotting on the agar surface and then retesting those with mutant phenotypes by embedding into agar.Grow overnight cultures of the desired strains to be analyzed.",
    "Transfer a single colony from a fresh culture grown on a YPD plate into into 5 ml YPD liquid medium in a 15 ml glass tube. Incubate on a tube roller or in a shaking incubator at 30 °C.Use a spectrophotometer to measure cell density at 600 nm. Adjust the cells to 5 x 105 cells/ml in 15 ml YPD broth (see Step A4).Incubate in an incubator-shaker at 30 °C, 200-250 RPM, for 4 h to obtain log phase cells.During incubation, prepare medium and cool in a water bath adjusted to 50 °C (approximately an hour may be required for cooling).Types of media that may be used include 4% BCS, GlcNAc, alkaline pH, Spider medium, and YP sucrose as these activate a diverse set of different cell signaling pathways (Kornitzer, 2019). As described above, the concentration of agar can be varied to test the effects of differing the rigidity of the surrounding matrix.Warning: Do not add serum to media before autoclaving, as it will denature. After the 4 h incubation, measure density of log phase cells at 600 nm and calculate the volume of culture equivalent to 200 cells. Sample calculation: 2,000 cells/ml x 0.1 ml = 200 cells. See Step A4 for additional information on adjusting cell density.Pour 25 ml of agar medium cooled to 50 °C into a 50 ml centrifuge tube.For serum agar samples, add 1 ml of BCS, previously warmed to 50 °C.Add volume of C. albicans culture equivalent to 200 cells.Mix well (but avoid trapping bubbles) and then pour into a sterile 10 cm-sized Petri dish. Allow to solidify for 1 h.Incubate plates at 37°C except for YP + Sucrose plates, which are incubated at room temperature or in a 25°C incubator.Examine daily for evidence of invasive growth.",
    "Spots on agar were photographed with a digital camera (Figure 3A), or with a microscope using a 40x objective to view invasion extending from the edge of a spot (Figure 3B). The embedded colonies were photographed with a microscope through a 2x lens (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200818/20200818192059_2875.jpgFigure 4. Invasive growth of cells embedded into agar. The indicated strains were embedded into agar containing 4% BCS and then incubated at 37 °C for one week. Scale bar = 1 mm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}