{
  "id": 4385,
  "origin_website": "Bio",
  "title": "Small-scale Triton X-114 Extraction of Hydrophobic Proteins",
  "procedures": [
    "Pre-condensation This is a step to remove hydrophilic components from the detergent so that the amounts of TX114 which unfavorably sequester to the Aq phase are reduced and, at the same time, the clouding point is lowered. Although dibutyl hydroxytoluene is used in the precondensastion procedure in the original protocol, presumably as an antioxidant to prevent auto-oxidation of TX114, eliminating it from this step does not affect the efficacy of phase-separation. One point to note is that certain concentrations of electrolytes are indispensable for efficient phase separation of TX114. We usually use 1-10 mM Tris-HCl or phosphate buffer, depending on the following experiments. Described here is the specific protocol for our experiments. As this step takes hours, we recommend finishing this step at least by the previous day of harvesting the cells.     Place 47 ml of buffer in a graduated 50 ml conical tube, then add 3 ml of TX114. As TX114 is very viscous, repeat pipetting until most of the TX114 is homogenized in the buffer. Then, mix well by vortexing or rigorous shaking.    Clarify the solution on ice or 4 °C, then mix again. This usually takes a few minutes.   Incubate the tube at 37 °C to let the solution phase-separate by gravity. As viscous greasy phase which is heavier than water, the Det phase is formed below the Aq phase. Since the concentration of TX114 in the Det phase after phase separation is ~12% (Bordier, 1981), the volume of the detergent phase is expected to be 24 ml. It usually takes a few hours for the top of the Det phase to descend to this level.    When the Det phase falls to the expected level, aspirate the Aq phase and discard it.",
    "Then, add fresh buffer up to 50 ml, mix well by vortexing and shaking, and clarify the solution on ice again.   Repeat the steps A3-4, 3-4 times. After the last cycle of phase-separation, discard the Aq phase and store in the dark. The precondensed TX114 can be stored at 4 °C in the dark for at least 6 months.         Preparation of TX114 lysis buffer and wash buffer We usually prepare 2% TX114 lysis buffer. As the concentration of TX114 in the precondensed TX114 (detergent phase) is ~12%, we add one part of the precondensed TX114 to five parts of tris- or phosphate-buffered saline (PBS).   Take 37 ml of purified water in a 50 ml conical tube and add 5 ml of 10x PBS and 8 ml of the precondensed TX114. As viscosity of the solution is lower when the solution is turbid, this step is done at RT. Repeat pipetting until the TX114 sticking to inside the pipette is removed.    Clarify the lysis buffer on ice. If it has already phase-separated, mix well then clear it on ice again.    Take 2.5 ml of 2% TX114 lysis buffer and add to 47.5 ml of buffered saline, e.g. 5 ml of 10x PBS + 42.5 ml of purified water, to make “0.1% TX114 wash buffer”.   Store the lysis buffer and the wash buffer at 4 °C.      Lysis of cells As TX114 is a mild detergent, lysis by directly pouring the lysis buffer onto the cells on the plate is inefficient. Therefore, we usually first detach the cells with 3 mM EDTA in Ca/Mg-free PBS, collect the cells in a tube, then lyse them by addition of 2% TX114 lysis buffer.",
    "Remove old culture medium from the N2a cells cultured on a well of a 6-well plate and rinse the monolayer of cells with Ca/Mg-free PBS.    Then, add 3 mM EDTA in Ca/Mg-free PBS (600 µl), and incubate for a few minutes until the cells can be easily detached by pipetting.  Note: Be careful not to incubate too long. Although our N2a cells can be detached by this procedure, more adhesive cells might require cell scrapers for detachment.    After completely detaching the cells by pipetting, collect the cell suspension in a 1.5 ml plastic tube. Rinse the bottom of the well with 400 µl of 3 mM EDTA in Ca/Mg-free PBS and add it to the tube. Keep the cell suspension on ice all along.    Centrifuge the cell suspension at 1,000 x g, at 4 °C, for 5 min. Then, carefully aspirate and discard the supernatant.    Add 300 µl-1,000 µl of phosphate-buffered 2% TX114 lysis buffer and vortex rigorously for ~30 sec. The volume of the lysis buffer to be added depends on the purpose of experiments and the following procedures.   With larger volumes of lysis buffer, volumes of the Det phase after phase-separations are accordingly larger.    Incubate the cell suspension on ice for ~30 min with vortexing for ~5 sec from time to time.     Centrifuge the cell suspension at 16,100 x g for 2 min at 4 °C to precipitate the cell debris.   Make sure that the temperature of the rotor is low enough not to let the lysate phase-separate during the centrifugation.    Although the clouding point of pure TX114 solution is ~22 °C, it tends to be lower with higher concentrations of impurities.     Carefully take the supernatant to a new tube as the TX114 lysate.",
    "Phase separation   Incubate the TX114 lysate at 37 °C for ~10 min until the lysate gets turbid and the Det phase partly precipitates.     Centrifuge at 22,500 x g for 10 min at room temperature. Make sure the rotor is warm enough for efficient phase-separation.    Gently take out the tube and carefully remove the Aq phase. If the hydrophylic proteins in the Aq phase are required for the experiments, put the Aq phase in a new tube.    Add 0.1% TX114 wash buffer and mix well by vortexing and/or shaking. We usually add the same volume as the eliminated Aq phase but different volumes should not cause problems. Then, clarify the lysate on ice.   Incubate the lysate at 37 °C for phase-separation. Repeat steps D1-4 2 more times.      After phase-separation We usually precipitate the hydrophobic proteins extracted to the Det phase by methanol/chloroform precipitation (Taguchi et al., 2013) and then add sample buffer and boil for preparation of the samples for SDS-PAGE and immunoblotting.   However, other usage of the partially purified hydrophobic proteins is possible, if the detergent can be efficiently removed."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}