{
  "id": 4402,
  "origin_website": "Bio",
  "title": "Ciliary and Flagellar Membrane Vesicle (Ectosome) Purification",
  "procedures": [
    "Method 1. Purification of ectosomes  Ectosomes are released by flagella during the incubation period and contain most of the surface-exposed (biotinylated) proteins found on purified flagella (Dentler, 2013).    Harvest 8-16 liters of cells using a Pellicon cassette system. Further concentrate cells by centrifugation (1,500 x g, 4 min) if necessary.     Gently suspend the cell pellets in fresh culture medium.   To avoid deflagellating cells, suspend pellets by gentle swirling or by agitation with a large bore glass or plastic pipette. The total suspension volume depends on the availability of centrifuges.     Each Beckman 35 or 45Ti rotor can hold six 70 ml tubes, for a total volume of 490 ml/centrifuge, so suspend cells in a total volume of 700-900 ml of M medium. If there is access to larger capacity centrifuges or additional centrifuges and rotors, it is best to increase the volume of cells to avoid crowing.   Examine cells by phase contrast microscopy to insure that there are no dividing cells and that nearly 100% of the cells are fully flagellated and motile. If cells are sick or not fully flagellated, the preparations will be contaminated by cell debris or released flagella and it’s best not to proceed with these cells.     Incubate suspended cells in constant light for 6 h or longer.     Cells can be aerated with a sintered glass bubbler in 1 L bottles or can be gently swirled in 2,700 ml Fernbach flasks using an orbital shaker under bright fluorescent light.     At the end of the incubation period, check cells by microscopy to insure that all are intact, flagellated, and motile. At the end of the incubation period, pellet the cells by centrifugation for 1,500 x g, 4 min.",
    "This can be done at 4 °C or at room temperature (~23 °C), the temperature at which the cells were incubated.   Carefully decant the supernatant (containing shed vesicles) to avoid disturbing the cell pellet or aspirate the supernatant from the bottles.    Examine the supernatant by phase contrast microscopy to insure that no flagella are present. If flagella or cells are present, centrifuge the supernatant at 11,000 x g for 10 min. The cell pellets can be gently suspended in M medium and deflagellated to purify flagella (see below).     Pellet the shed membranes by centrifuging the supernatant for 60 min, 125,000 x g, 4 °C.   Remove the supernatant by aspiration. The vesicle-containing pellets are nearly transparent and are easily dislodged. Often, there is a tight green pellet containing cell bodies or chloroplasts that is overlain by a more transparent pellet. Try to suspend the membrane-containing transparent material without disturbing the green pellet. Suspend in a small volume of CWB, keeping the combined volume of all suspended pellets less than 2 ml.     Layer the suspended pellets over ~ 8 ml of CWB with 25% sucrose and centrifuge 3,000 x g, 10 min, 4 °C, in a swinging bucket rotor.   Remove the layer (containing vesicles) above the 25% sucrose/CWB and centrifuge at 46,000 x g for 30 min, 4 °C to pellet membrane vesicles. Suspend the pellet in a small volume of CWB and check for flagella or cell bodies by phase contrast and by negatively staining and examining by transmission electron microscopy.      Method 2. Purification of vesicles from isolated flagella    Flagellar purification - pH shock Flagella can be isolated using dibucaine or pH shock but I’ve found the membrane to be more intact in pH shocked flagella.",
    "For other methods to isolate and fractionate cilia and flagella from various organisms, see Methods in Cell Biology, Vol 47, 1995.   Harvest cells using a pelicon harvester and by centrifugation (see above) and suspend cells in fresh M medium to a final volume of 100-200 ml. The cells used to isolate released membrane vesicles (above) also can be used to isolate flagella.   Using a magnetic stirrer and calibrated pH electrode, deflagellate cells by lowering the pH to 4.0 by dropwise addition of 0.5 N acetic acid. Do not leave cells at pH 4 for longer than 1-1.5 min. Raise the pH to 7.0 by dropwise addition of 0.5 N KOH. For 100 ml of cells in M medium, use approximately 4.5 ml of 0.5 N acetic acid and 5.2 ml of 0.5 M KOH. For most purposes, it is best to monitor the pH change but, for mass-deflagellations in microtitre plates, adding defined quantities of acetic acid and KOH is useful.   Pellet cells by centrifugation at 1,100 x g, 3 min.   Aspirate the supernatant (containing flagella) with a large bore pipette and layer over CWB with 25% sucrose.   Centrifuge in a swinging bucket rotor at 2,500 x g for 10 min, 4 °C.     Flagella will collect at the interface above the 25% sucrose.     Aspirate the white flagella layer, dilute with CWB, and pellet flagella at 17,000 x g, 20 min, 4 °C.   Suspend flagella in CWB using a large bore pipette to avoid breaking flagella and check with phase contrast microscopy to insure the preparation is free of cell bodies or other debris.      For detergent-solubilized membrane + matrix.  Detergent-extraction of cilia and flagella solubilizes most, but not all, of the membrane but also releases soluble ciliary proteins.",
    "Bonafide flagellar trans-membrane proteins can be unambiguously identified if they are biotinylated on intact cells (see Reference 7).   Suspend the flagella in CWB, add 10% Triton X-100 or Nonidet P-40 to a final concentration of 1%, incubate 10-20 min, 4 °C.    Centrifuge for 15 min at 27,000 x g, 4 °C to pellet the detergent-insoluble axonemes and detergent-insoluble membranes. The solubilized membrane and matrix proteins will be in the supernatant.      Vesicle release and purification Purification of membrane vesicles should insure that all of the proteins and lipids are components of the membrane but not the soluble flagellar matrix proteins. However, contamination of the vesicles with soluble flagellar proteins is possible as the membranes are released from flagella and vesiculate, trapping flagellar matrix proteins. Additionally, rubbing membranes off axonemes or freeze-thawing them leads to considerable breakage of the axonemal microtubules and release of axonemal components. Detergent extraction can be done with no significant axonemal breakage. This is a modification of the method used to purify Tetrahymena ciliary membranes (Dentler, 1980; Dentler, 1995). Other methods to release membranes from purified flagella include freeze-thawing and rubbing off membranes (Wang and Snell, 2003; Huang et al., 2007; Pasquale and Goodenough, 1987; Iomini et al., 2006; Snell, 1976) or treatment with low concentrations of detergents (Witman et al., 1972; Bloodgood and May, 1982).   Start with purified flagella (above) suspended in CWB.     Agitate the flagella by shearing with a glass pipette or by vortexing for 1 min, incubate on ice 1 min, and vortex again. Repeat 5-10 times.     Examine by phase contrast microscopy to assay for the formation of small membrane vesicles (will appear as dots) and the membrane-free axonemes (which will be thin and less refractile than intact cilia).",
    "If membranes cannot easily be released, add Nonidet P-40 or Triton X-100 to a final concentration of 0.01-0.02% during vortexing.   Layer the sheared or vortexed flagella over sucrose step gradients composed of 1 ml 20% sucrose (w/v) in CWB, 1 ml of 30% sucrose (w/v) in CWB, and 1.2 ml of 40% sucrose (w/v) in CWB.     Centrifuge in a swinging bucket rotor.  Centrifuge samples at 200,000 x g, 2 h and collect membranes from the interface between the 30% and 40% sucrose layers (Dentler, 1995).   Note: Alternatively, vesicles may be separated from axonemes by layering the sheared flagella over ~8 ml of CWB with 25% sucrose and centrifuging 3,000 x g, 10 min, 4 °C as was done for the released membranes (above). The axonemes with attached membranes will be in the pellets.   Carefully remove membranes from the interfaces, dilute with cold CWB, and pellet vesicles by centrifugation at 48,000 x g for 1 h.    Suspend the vesicles in a small amount of CWB and examine by phase contrast and/or negative staining and transmission electron microscopy to insure that the vesicles are intact and are not contaminated with cell debris or axonemes."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}