{
  "id": 2939,
  "origin_website": "Cell",
  "title": "One-step CRISPR-Cas9-mediated knockout of native TCRαβ genes in human T cells using RNA electroporation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDesign of pST1 eSpCas9(1.1)-P2A-EGFP plasmid\nTiming: 1 day\nIn order to delete native TRAC and TRBC genes in CD8+ T cells with a high degree of efficiency, a rationally engineered version of Streptococcus pyogenes Cas9 (SpCas9) with enhanced specificity (eSpCas9(1.1)) is used.3[href=https://www.wicell.org#bib3] The eSpCas9(1.1) sequence is inserted into a pST1 plasmid vector back-bone.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5] This vector has been optimized for the in vitro transcription (IVT) of mRNA to rapidly and efficiently produce high amounts of synthetic mRNA. The open reading frame of the eSpCas9(1.1) is preceded by a T7 promoter, a 5′ cloning site, a Kozak sequence at the translational start site, and one copy of the monopartite nuclear localization signal of the simian virus 40 (SV40) T-antigen (PKKKRKV) followed by a 32 amino-acid linker.6[href=https://www.wicell.org#bib6] The eSpCas9(1.1) is followed by a copy of the bipartite NLS from nucleoplasmin, a GSG linker, a 2A peptide from a porcine teschovirus-1 (P2A) and an enhanced green fluorescence protein (EGFP) reporter gene and the 3′ cloning site. The P2A sequence allows co-expression of both eSpCas9(1.1) and EGFP by self-cleavage of the P2A peptide during translation.7[href=https://www.wicell.org#bib7] An EGFP reporter gene is added to the construct to determine the transfection efficiency of the mRNA construct after electroporation and can be easily omitted or replaced by a preferred reporter gene. The SV40 NLS-Linker-eSpCas9(1.1)-Nucleoplasmin NLS-GSG-P2A-EGFP (in short, eSpCas9(1.1)-P2A-EGFP) insert has a total length of 5070 nucleotides and was codon optimized for Homo sapiens. The 3′ untranslated region (UTR) present in the pST1 backbone is comprised of two copies of the 3′ UTR from the human alpha globin gene and a 120-nucleotide poly(A) tail, which increase the stability and translational efficiency of the produced mRNA,4[href=https://www.wicell.org#bib4] and a restriction site for a Type IIS restriction enzyme (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2478-Fig2.jpg",
    "Figure 2. Schematic representation of the pST1 eSpCas9(1.1)-P2A-EGFP plasmid vector\nA pST1 plasmid vector containing rationally designed eSpCas9(1.1)3[href=https://www.wicell.org#bib3] linked to an enhanced green fluorescent protein (EGFP) reporter was designed for in vitro production of Cas9 mRNA. The plasmid vector representation was created with SnapGene.\nDesign the eSpCas9(1.1)-P2A-EGFP DNA construct plasmid in silico by combining the segments described above in a plasmid vector of preference.\nConstruct synthesis, cloning and plasmid preparation can be performed in-house or outsourced to commercial providers such as Gene-Art.\nOptional: Any plasmid vector suitable for IVT of mRNA can be used as an alternative for the pST1 plasmid vector.\nOptional: The eSpCas9(1.1)-P2A-EGFP plasmid DNA can be amplified by transforming the plasmid into supercompetent E. coli. The pST1 vector contains both a bacterial origin of replication and a kanamycin resistance gene for use as a selectable marker in bacteria.\nLinearization of the pST1 eSpCas9(1.1)-P2A-EGFP plasmid\nTiming: 2 days\nFor transcription of mRNA in vitro, the plasmid DNA template must be completely linearized with a restriction enzyme downstream of the 3′ UTR of the construct. Circular plasmid templates will generate extremely long, heterogeneous RNA transcripts because RNA polymerases are very processive. Completely linearized plasmid template of highest purity is critical for successful RNA synthesis, since the quality of the template DNA will affect transcription yield and integrity of the synthesized RNA. This step describes the linearization of a circular plasmid DNA using restriction enzymes and precipitation of the linear DNA prior to mRNA IVT.\nClean the DNA bench with DNA Away Surface Decontaminant solution to remove unwanted DNA and DNase.\nCritical: Avoid contact of this DNA Away Surface Decontaminant solution with your own plasmid.\nCritical: During the next steps it is important to work fast and use DNase-free filter pipette tips to avoid degradation of DNA.",
    "Prepare the digestion reaction of plasmid DNA with restriction enzymes.\nCalculate the volumes of plasmid and water needed, according to the plasmid to be digested. For the pST1 plasmid vector, the LguI (SapI) restriction enzyme with a concentration of 5 U/μL is used. Approximately, 1U of enzyme cuts 1 μg of DNA in 1 h.\nHomogenize the plasmid DNA and the Tango buffer and short spin both tubes. Keep the DNA and the Tango buffer on ice.\nAdd the reagents to a sterile 1.5-mL microcentrifuge tube in following order:\ntable:files/protocols_protocol_2478_15.csv\nMix the reagents by pipetting up and down and spin down the microcentrifuge tube. Do not vortex!\nNote: The volumes of the reagents can be downscaled, but in any case, the volume of the Tango buffer should be 1/10 of the final volume as it is a 10× solution.\nIncubate the microcentrifuge tube on a thermoblock for 2 h at 37°C.\nExamine the linearized DNA template in a 1% agarose gel electrophoresis to confirm cleavage of the plasmid is complete (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2478-Fig3.jpg\nFigure 3. Representative 1% agarose gel showing successful linearization of pST1 eSpCas9(1.1)-P2A-EGFP plasmid\n(1) a TrackIt 1 kb Plus DNA Ladder (DNA ladder) is used for sizing of the linearized plasmid DNA. (3) A band representing linear pST1 eSpCas9(1.1)-P2A-EGFP. The linear plasmid DNA has a length of 9026 bases. (5) Non-linearized pST1 eSpCas9(1.1)-P2A-EGFP plasmid DNA. Column 2 and 4 are empty.\nNote: linearized plasmid DNA is precipitated with sodium acetate and ethanol solutions. Ethanol precipitation is a commonly used method to de-salt and concentrate DNA. Nucleic acids are negatively charged due to the presence of phosphate groups, making DNA readily soluble in water. Addition of sodium acetate and ethanol disrupts the hydrate shell and neutralizes the negative charge of DNA, leading to precipitation.",
    "Add 50 μL of 3 M sodium acetate (pH 5.2) to the microcentrifuge tube. This is 1/10 of the final volume used to linearize 50 μg of plasmid DNA.\nAdd 1 mL of absolute ethanol to the microcentrifuge tube. This is 2 volumes of the final volume used to linearize 50 μg of plasmid DNA.\nMix the solution gently by pipetting.\nIncubate 16–24 h at −20°C.\nCentrifuge the microcentrifuge tube at 16,100 × g for 15 min at 4°C.\nRemove the supernatant carefully without disturbing the DNA pellet.\nAdd 1 mL of 70% ethanol solution to the DNA pellet. Do not resuspend the pellet.\nNote: Place the microcentrifuge tube in the same direction in the centrifuge for each centrifugation step in order to know where the DNA pellet is, since sometimes it is difficult to see.\nCentrifuge the microcentrifuge tube at 16,100 × g for 15 min at 4°C.\nRemove supernatant carefully without disturbing the DNA pellet.\nAdd 50 μL of nuclease-free distilled water to dissolve the DNA pellet.\nCaution: Do not pipette up and down the DNA pellet. Instead, leave it for 30 min or longer at 4°C to dissolve.\nDetermine the concentration of linearized plasmid DNA with a NanoDrop (Thermo Fisher) and bring the linearized plasmid DNA to a concentration of 0.5 μg/μL. Approximately 90% of the starting material is recovered after linearization and precipitation.\nPause point: Linear DNA can be directly used for IVT of mRNA or stored at −20°C for at least 1 year.\nIn vitro transcription of eSpCas9(1.1)-P2A-EGFP mRNA\nTiming: 7 h",
    "The eSpCas9(1.1)-P2A-EGFP mRNA is synthesized by IVT using the mMESSAGE mMACHINE T7 transcription kit. The protocol described below is adapted from the manufacturer’s recommendations[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fcms_055516.pdf] (Thermo Fisher Scientific) and uses a T7 enzyme mix containing RNA polymerases to produce large amounts of capped RNA. According to the manufacturer, this kit produces an average yield of 20–30 μg mRNA per 1 μg of linearized plasmid template and the reaction setup showed here is compatible with mRNA of 300 bases to 5 kb in length.\nThaw the frozen agents of the mMESSAGE mMACHINE T7 transcription kit.\nNote: Keep the RNA Polymerase Enzyme Mix and 2× NTP/CAP on ice and keep the 10× Reaction buffer at 19°C–22°C while assembling the reaction.\nCritical: During the next steps it is important to work fast and use RNase-free filter pipette tips to avoid degradation of the RNAs.\nVortex the 10× Reaction buffer and 2× NTP/CAP.\nBriefly spin all reagents to prevent contamination or loss of reagent.\nAssemble the transcription reaction in a sterile 1.5 mL microcentrifuge tube at 19°C–22°C in the following order:\ntable:files/protocols_protocol_2478_16.csv\nNote: The table represents the volumes for 1 IVT reaction with 1 μg of linearized plasmid template. The reactions can be easily scaled up or down.\nGently mix by pipetting and centrifuge briefly.\nIncubate the mix for 2 h at 37°C on a thermoblock.\nAdd 1 μL TURBO DNase per IVT reaction and mix well.\nIncubate the solution for 15 min at 37°C on a thermoblock.\nStop the IVT reaction and precipitate the mRNA by adding 50 μL of LiCl Precipitation Solution per IVT reaction.\nMix thoroughly and incubate for more than 30 min at −20°C.",
    "Note: LiCl precipitation can remove unincorporated nucleotides and most proteins; however, it does not precipitate transfer RNA and it may not efficiently precipitate RNAs smaller than 300 nucleotides. The addition of LiCl will prevent freezing of the solution.\nOptional: LiCl precipitation can be performed overnight at −20°C.\nCentrifuge the suspension at 16,100 × g for 15 min at 4°C.\nRemove the supernatant carefully without disturbing the mRNA pellet.\nWash the mRNA pellet once with 1 mL of 70% ethanol solution and centrifuge at 16,100 × g for 15 min at 4°C. Do not resuspend the pellet.\nRemove the supernatant carefully without disturbing the mRNA pellet.\nLet the pellet dry with the cap open for 2–5 min at 19°C–22°C.\nAdd 10 μL of nuclease-free distilled water per IVT reaction and let the mRNA dissolve in the water at 4°C for ±30 min.\nDetermine mRNA concentration on Nanodrop. Keep the mRNA on ice during the measurement (problem 2[href=https://www.wicell.org#sec6.3]).\nBring the concentration of the mRNA to 2 μg/μL.\nAliquot the mRNA in 20 μL per vial and freeze at −80°C. Frozen mRNA can be stored for 3 years.\nOptional: As quality control, IVT mRNA can be examined in a non-denaturing 1% agarose gel electrophoresis to confirm the integrity and the length of the produced mRNA (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2478-Fig4.jpg\nFigure 4. Representative 1% agarose gel for quality control of in IVT eSpCas9(1.1)-P2A-EGFP mRNA\n(1) A single stranded RNA ladder (ssRNA ladder) with a range of 500 bases to 9,000 bases is used for sizing the mRNA construct. (2) Resulting eSpCas9(1.1)-P2A-EGFP mRNA (mRNA Cas9 EGFP) has a length of 5500 nucleotides.\nActivation of primary CD8+ T cells\nTiming: 3 h",
    "The section below describes an in vitro activation protocol for primary CD8+ T cells via stimulation of the TCR-CD3 complex using plate-bound anti-CD3 and soluble anti-CD28 monoclonal antibodies and stimulatory cytokines. Short-term activation of T cells will enable greater RNA transfection efficiency compared to non-activated T cells and thus subsequent disruption of the native TRAC and TRBC sequences.\nNote: Both MACS-isolated fresh and cryopreserved human CD8+ T cells can be used. When using cryopreserved cells, thaw them in CTL medium and let the cells rest for at least 4 h before activation (problem 3[href=https://www.wicell.org#sec6.5]).\nPrepare a 5 μg/mL solution of no azide (NA)/low endotoxin (LE) anti-CD3 antibody in sterile PBS (1×) buffer. For a T75 cell culture flask, add 50 μL of NA/LE anti-CD3 antibody (1.0 mg/mL) to 10 mL of PBS (1×) buffer.\nAdd the solution to a T75 cell culture flask and incubate the flask horizontally in a humified incubator at 37°C and 5% CO2 for 2 h. Make sure that the entire surface is covered.\nNote: Volume of coating solution is calculated based on the surface area of the culture flask. Downscale or upscale the volume of 5 μg/mL NA/LE anti-CD3 antibody solution according to the surface area of the specific type of flask used for cell culture.\nAspirate the NA/LE anti-CD3 antibody solution and discard.\nCarefully wash the anti-CD3 coated T75 cell culture flask with 10 mL of sterile PBS (1×) buffer. Avoid touching the coated surface of the flask.\nPrepare 20 × 106 viable primary CD8+ T cells.\nCentrifuge the CD8+ T cells and discard the supernatant.\nAdd 20 mL complete CTL medium to bring cell concentration to 106 cells/mL.\nTransfer cells to the anti-CD3 coated T75 cell culture flask.\nAdd 20 μL NA/LE anti-CD28 (1.0 mg/mL) antibody to the culture flask.",
    "Gently tilt the flask to homogenize the suspension.\nIncubate flasks horizontally in a humidified incubator at 37°C and 5% CO2 for 3 days (problem 4[href=https://www.wicell.org#sec6.7]).\nNote: Volumes are adjusted for 20 × 106 primary CD8+ T cells at the beginning of the culture. Up to 30 × 106 primary CD8+ T cells can be cultured in a T75 cell culture flask; in that case, adjust the volumes of NA/LE anti-CD28 antibody and cytokines accordingly.\nGeneration of TKO8 cells with RNA electroporation\nTiming: 2 h\nmRNA electroporation is a powerful tool for transient genetic modification of cells.2[href=https://www.wicell.org#bib2] Combining the CRISPR gene editing tool with mRNA delivery provides a safer modification strategy compared to integrating delivery systems, for example those based on viral vectors.8[href=https://www.wicell.org#bib8] In this step, activated primary CD8+ T cells are electroporated with eSpCas9(1.1)-P2A-EGFP mRNA and two sgRNAs targeting exon 1 of TRAC and exon 1 of TRBC to disrupt the expression of native TCRs (referred to as TKO8 cells). After transfection into CD8+ T cells, translation of eSpCas9(1.1)-P2A-EGFP mRNA will result in transient eSpCas9(1.1) expression together with EGFP. Cas9 protein will then bind to the sgRNAs, which will be transported to the nucleus, and will be guided to the TRAC and TRBC sequences of interest by the sgRNAs; with this construct, EGFP operates as a reporter for transfection efficiency.\nPrepare EP recovery medium and pre-heat 5 mL in a 15 mL tube in a 37°C water bath.\nCarefully resuspend activated CD8+ T cells from the T75 flask by pipetting against the bottom of the flask.\nTake 100 μL of activated cells to determine the cell concentration on an automatic cell counter and to check cell viability with PI (see step 12, before you begin[href=https://www.wicell.org#before-you-begin]). A viability ranging from 90%–99% can be expected.\nCollect 107 viable activated CD8+ T cells.",
    "Optional: This protocol can be upscaled up to 5 × 107 cells in a maximum of 400 μL of electroporation buffer for a 4 mm electroporation cuvette.\nCentrifuge CD8+ T cells at 480 × g for 5 min at 19°C–22°C. Remove supernatant completely.\nWash T cells by adding 10 mL cold serum-free phenol red-free Opti-MEM.\nCentrifuge T cells at 480 × g for 5 min at 19°C–22°C. Remove supernatant completely.\nCritical: During the next steps it is important to work fast and use RNase-free filter pipette tips to avoid degradation of the RNAs.\nResuspend the cell pellet in 200 μL cold serum-free phenol red-free Opti-MEM.\nTransfer the cell suspension to a sterile RNase-free microcentrifuge tube.\nThaw the eSpCas9(1.1)-P2A-EGFP mRNA and TRAC and TRBC sgRNAs. Keep them on ice or in a lab cooler at 0°C.\nCritical: mRNA constructs should be kept on ice at all times as RNA is susceptible to degradation when left at room temperature.\nAdd 10 μg of eSpCas9(1.1)-P2A-EGFP mRNA to the cell suspension (final mRNA concentration: 50 μg/mL).\nAdd 2.5 μg of TRAC sgRNA to the cell suspension (final sgRNA concentration: 12.5 μg/mL).\nAdd 2.5 μg of TRBC sgRNA to the cell suspension (final sgRNA concentration: 12.5 μg/mL).\nMix gently by pipetting up and down.\nTransfer the cell suspension with RNAs to a 4-mm electroporation cuvette.\nCritical: The presence of bubbles in the electroporation cuvette or oil stains on the electrodes of the cuvettes due to handling without gloves can lead to arcing. This phenomenon is a complete or partial discharge of an electric current in a sample easily recognizable as an audible popping sound which negatively impacts cell viability.2[href=https://www.wicell.org#bib2]\nSet up the electroporation settings for transfection of T cells with RNA in the BioRad Gene Pulser Xcell electroporation system.\nSquare wave electroporation protocol.",
    "Voltage: 500 V.\nPulse length: 5 ms.\nNumber of pulses: 1 pulse.\nPulse intervals (sec): 0 s.\nCuvette: 4 mm.\nGently shake the cuvette to evenly distribute the cell suspension and place the cuvette in the ShockPod cuvette chamber.\nPress the pulse button to electroporate the cells.\nAfter electroporation, transfer the CD8+ T cells immediately to the pre-heated EP recovery medium.\nIncubate cells in a humified incubator for at least 2 h at 37°C and 5% CO2.\nAfter 2 h, centrifuge CD8+ T cells at 480 × g for 5 min at 19°C–22°C. Remove supernatant completely.\nResuspend the cell pellet in 5 mL of complete CTL medium.\nTake 100 μL of electroporated cells and transfer to a polystyrene FACS tube to determine the cell number and viability.\nCount cells with an automatic cell counter.\nAdd FACS buffer up to 200 μL to the remaining cell suspension.\nStain cells with 0.5 μL PI and incubate for 1 min at 19°C–22°C.\nMeasure cell viability on a flow cytometer. Expected viability is ranging from 85%–95%.\nBring cell concentration to 0.3–1 × 106 cells/mL with complete CTL medium in a T75 flask and keep in a humified incubator for 72 h at 37°C and 5% CO2, before validating TCR KO efficiency.\nNote: TKO8 cells can be further expanded immediately after electroporation, passaging the cells every 2–3 days with complete CTL medium, to obtain sufficient numbers for downstream applications. Due to the initial activation of primary CD8+ T cells with anti-CD3, anti-CD28 antibodies, IL-2 and IL-15, no second TCR stimulus is needed to further expand TKO8 cells. When expanding, keep TKO8 cell concentration at 0.3–1 × 106 cells/mL. Transfer cells to larger cell culture flasks if needed. In addition, microscopic analysis of the cells can be performed to confirm the formation of T-cell clusters.",
    "Analysis of transfection efficiency\nTiming: 30 min\nTwenty-four hours after electroporation, transfection efficiency can be determined using flow cytometry by measuring the level of EGFP expression in the electroporated CD8+ T cells (Figure 5[href=https://www.wicell.org#fig5]). Expression of EGFP peaks 24 h after electroporation and gradually decreases over time, with almost no expression 96 h after electroporation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2478-Fig5.jpg\nFigure 5. Flow cytometric analysis of EGFP expression as reporter for mRNA transfection efficiency\nPercentage of EGFP+ primary activated CD8+ T cells was evaluated 24 h after electroporation with eSpCas9(1.1)-P2A-EGFP mRNA and TRAC and TRBC sgRNAs. Expected transfection efficiency ranges from 80% to 90%. A mock electroporation without RNA was used as a negative control. EGFP+ cells were determined after gating on the viable cells.\nTake 100,000 of electroporated cells and transfer to a polystyrene FACS tube.\nAdd 2 mL FACS buffer and centrifuge the cells at 480 × g for 5 min at 19°C–22°C. Decant the supernatant after centrifugation.\nResuspend cell pellet in 100 μL FACS buffer.\nAcquire the transfected cells on a flow cytometer and determine the percentage of EFGP+ T cells (Figure 5[href=https://www.wicell.org#fig5]). Expected transfection efficiency (here demonstrated by EGFP+ cells) ranges from 80%–90%.\nNote: EGFP expression levels provide information about eSpCas9(1.1)-P2A-EGFP mRNA transfection efficiency in T cells after electroporation, as well as the correct translation of the mRNA, but it does not provide information regarding the efficiency of the editing.\nValidation of TCR knockout\nTiming: 30 min\nStable TCR knockout efficiencies can be detected 72 h after electroporation. TCR knockout efficiency is validated by analyzing the surface expression of native TCR by flow cytometry using an anti-human TCRαβ monoclonal antibody. Additionally, expression levels of CD3ε are measured to confirm the TCR knockout, as CD3 can only be expressed in the presence of a TCR.",
    "Take 100,000 electroporated cells and transfer to a polystyrene FACS tube.\nAdd 2 mL FACS buffer and centrifuge the cells at 480 × g for 5 min at 19°C–22°C. Decant the supernatant after centrifugation.\nResuspend cells in 100 μL FACS buffer and stain the cell pellet with 5 μL anti-CD8 FITC, 5 μL anti-TCRαβ PE and 5 μL anti-CD3 PerCP.\nIncubate the cells for 15 min at 19°C–22°C in the dark.\nWash the sample by adding 2 mL of FACS buffer and centrifuge at 480 × g for 5 min at 19°C–22°C. Discard the supernatant.\nResuspend cell pellet in 100 μL FACS buffer.\nAcquire the stained cells on a flow cytometer and determine the percentage of viable CD3+CD8+TCR+ T cells. A TCR knockout efficiency ranging from 90% to 99% can be expected (Figure 6[href=https://www.wicell.org#fig6]) (problem 5[href=https://www.wicell.org#sec6.9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2478-Fig6.jpg\nFigure 6. Representative flow cytometric plots of TRAC and TRBC KO in activated primary CD8+ T cells\nNative TCR KO CD8+ T cells (TKO8) cells were generated by electroporating primary 3-day activated CD8+ T cells with eSpCas9(1.1)-P2A-EGFP mRNA and TRAC- and TRBC-directed sgRNAs. A mock electroporation without Cas9 mRNA and sgRNAs was used as a negative control. TCR and CD3 expression is determined after gating on the viable cells.\nNote: Native TCR knockout efficiency could alternatively be assessed on a transcriptomic level using reverse transcription quantitative real-time PCR (RT-qPCR) or on a genomic level using DNA sequencing."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Crispr",
    "Cell Culture",
    "Tissue Engineering"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}