{
  "id": 9042,
  "origin_website": "Jove",
  "title": "Protocol for Isolating the Mouse Circle of Willis",
  "procedures": [
    "All procedures were performed in accordance with European Community standards for the care and use of laboratory animals, with the approval of the local ethics committee for animal experimentation (Ile de France-Paris-Committee, Authorization 4270).\n1. Anesthesia\nInfuse a lethal dose of pentobarbital (up to 1 mg/10 g body weight) intraperitoneally (27-gauge needle and 1-ml syringe) into adult mice before surgery.\n2. Vessel Perfusion\nNOTE: There is no need to apply vet ointment to the eyes during vessel perfusion. This procedure is rapid (5-10 minutes) and ends in the death of the animal. Confirm the lack of response with a toe pinch. \nUsing iris scissors, make an incision, about 4 cm long, into the abdominal wall and peritoneum, just beneath the rib cage.\nMake a small incision (a few millimeters long) in the diaphragm and then continue the incision of the diaphragm along the entire length of the rib cage to expose the pleural cavity.\nLift the sternum away and clamp the tip of the sternum with the hemostat; place the hemostat on the neck. Carefully trim the adipose tissue connecting the sternum to the heart.\nPass the 15-gauge perfusion needle through the left ventricle into the apex of the heart.\nFinally, use scissors to cut one of the liver lobes to create an outlet.\n\tNOTE: An alternative outlet can be created by using iris scissors to create an incision to the right atrium.\nPerfuse the animal with 25 to 50 ml of phosphate-buffered saline (PBS) with a pump operating at a rate of 2.5 ml/min. The liver should blanch as the blood is replaced with PBS.\nAfter approximately five minutes, once the fluid from the liver is completely clear, stop the perfusion.",
    "If immunostaining or regular staining is planned, perfuse the animal with 50 ml of paraformaldehyde (PFA; 4% in PBS) for 15 min.\n\tNOTE: Caution, PFA fumes are toxic. Perfusion of the animal with PFA should be carried out in a ventilated fume hood.\n3. Isolation of the Brain and the Circle of Willis\nIsolation of the brain\nRemove the head with a pair of surgical scissors.\nMake a midline incision with iris scissors, along the skin from the neck to the nose.\nTrim off the skin to expose the skull and remove any residual muscles and adipose tissues with iris scissors.\nPlace the sharp end of the iris scissors into the foramen magnum on one side and carefully slide them along the inner surface of the skull to the external auditory meatus (also known as the ear canal).\nReproduce the incision described in 3.1.4 on the contralateral side and make a midline cut along the inner surface of the inter-parietal bone to the start of the sagittal suture.\nPlant the iris scissors in the frontal bone, right between the eyes, in the sagittal suture and then open them to split the skull in two.\nLift out the brain, grabbing the olfactory bulbs and using the iris scissors to cut off the nerve connections on its ventral surface.\nRemove the brain and place it in a 60-mm Petri dish containing ice-cold PBS for CoW isolation. Completely immerse the brain in the PBS. If the brain was fixed with 4% PFA (for subsequent sectioning and immunostaining or regular staining), keep it in a bath of 4% PFA at 4 °C for 24 hr.\nIsolation of the circle of Willis\n\tNOTE: A dissecting microscope is required for CoW isolation. The brain should be kept at 4 °C throughout the entire procedure.",
    "Put the brain upside down (i.e., on its dorsal surface) to visualize the CoW.\nUse a small forceps to grab the anterior cerebral arteries (ACA) at the base of the olfactory lobes (a, Figure 1) and exert pressure to dissociate them from the vessel continuum. Use the same procedure to cut the middle cerebral arteries (MCA) in b (Figure 1).\nUse the sharp ends of the forceps to lift and remove the major arteries forming the CoW from the cortex.\nLift up the start of the posterior communicating arteries (PCA) to disconnect them from the brain, by gripping the middle cerebral arteries (MCA) with the forceps. Pick up the anterior arteries (ACA and MCA) and pull them gently over the optic chiasm in an anterior-dorsal direction. To prevent disruption of the CoW, interrupt the the procedure to deal with the other arteries.\nRepeat steps 3.2.2 and 3.2.3 for the superior and posterior cerebellar arteries (SCA)/(PCA) (c, Figure 1) and for the basilar artery (BA) (d, Figure 1), pulling them in a dorsal-anterior direction. Stop at the end of the procedure described in 3.2.4.\nRemove the entire CoW by pulling gently with the forceps. Place the CoW in a 60-mm Petri dish filled with ice-cold PBS and remove any remaining attached brain tissue with two forceps, holding the CoW in place with small pins.\nKeep the harvested CoW at -80 °C for subsequent processing for RNA purification (RNA extraction yields large amounts of RNA — approximately 500 ng) or protein extraction.\n\t\tNote: The CoW can be maintained ex vivo for 24 hr, by adapting the organ bath system developed for isolated mouse olfactory artery. 7\nimgsrc://cloudfront.jove.com/files/ftp_upload/54352/54352fig1.jpg",
    "Figure 1: Schematic Diagram of a Ventral View of the Mouse Brain Highlighting the CoW. The CoW is formed from the two internal carotid arteries (MCA), which are derived from the two anterior cerebral arteries (ACA); the basilar artery (BA) branches into the posterior (PCA) and superior (SCA) cerebral arteries, and two vertebral arteries (VA).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}