{
  "id": 3857,
  "origin_website": "Cell",
  "title": "Cyclic uniaxial cell stretching in tissue culture using a LEGO®-based mechanical stretcher and a polydimethylsiloxane stretchable vessel",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of the PDMS vessel\nTiming: One day\nThe goal of this step is to generate the PDMS plate that will be fitted on the LEGO® mechanical stretcher (Figure 1[href=https://www.wicell.org#fig1]). It will be used to grow and stretch cells. The PDMS plate is constituted of three layers of PDMS that are poured and cured successively, upside-down.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/579-Fig1.jpg\nFigure 1. Overview of the cyclic uniaxial cell stretching system\n(A) stretchable PDMS plate and its LEGO® adaptors.\n(B) Mechanical stretcher and its PDMS plate with adaptors.\n(C) System fully assembled.\nPour and cure bottom layer.\nPrepare 15 mL of a 1:20 (w:w) ratio mixture of curing agent to PDMS for each PDMS plate to be cast. Mix extensively either using a magnetic bar and a magnetic stirrer or alternatively, manually using a clean plastic L-shaped bacterial spreader.\nDegas the mixture for 10 min under vacuum at 190mbar. We routinely use a vacuum concentrator in vacuum mode only, at room temperature.\nPour the mixture in the casting mold, avoiding bubbles and taking care not to pour over the central plate of the casting mold which will constitute the bottom of the PDMS plate.\nPlace horizontally in an oven and cure at 80°C for 2 h.\nPour and cure intermediate layer. This layer will constitute the bottom of the plate in contact with cells. The investigator should experimentally assess the stiffness required for its own experimental setup and we provide the protocol for a standard 1:40 ratio mixture.\nPrepare 40 mL of a 1:40 (w:w) ratio mixture of curing agent to PDMS for each PDMS plate to be cast. Mix extensively either using a magnetic bar and a magnetic stirrer or alternatively, manually using a clean plastic L-shaped bacterial spreader.",
    "Degas the mixture for 10 min under vacuum as previously.\nPour the mixture in the casting mold over the previous layer avoiding creating bubbles. This layer should cover the central plate.\nPlace horizontally in an oven and cure at 80°C for 2 h.\nPour and cure top layer. This thin layer is only present to prevent the stickiness of the intermediate layer\nPrepare 5 mL of a 1:20 (w:w) ratio mixture of curing agent to PDMS for each PDMS plate to be cast. Mix extensively either using a magnetic bar and a magnetic stirrer or alternatively, manually using a clean plastic L-shaped bacterial spreader.\nDegas the mixture for 10 min under vacuum as previously.\nPour the mixture in the casting mold over the previous layer avoiding creating bubbles. This layer should cover the central plate.\nPlace horizontally in an oven and cure at 80°C for 2 h.\nDisassemble the casting mold and peel the PDMS plate off the base plate. Such a thick PDMS plate is quite resistant to tear, however, pay attention and caution to the corners of the PDMS plate when peeling off to prevent tearing (Figure 2[href=https://www.wicell.org#fig2]G).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/579-Fig2.jpg\nFigure 2. PDMS plate casting mold assembly and PDMS plate casting\n(A) PDMS casting mold disassembled.\n(B)Casting mold assembled.\n(C) PDMS casting mold with fully cured PDMS plate still assembled.\n(D) disassembled casting mold with PDMS plate.\n(E) zone of potential corner rupture upon excessive pulling during PDMS plate unmolding.\n(F) unmolding of the PDMS plate.\n(G) example of ruptured PDMS plate.",
    "Critical: It is critical to mix properly and extensively the PDMS mixture since the two components are quite viscous and do not mix well. Improper mixing will result in heterogenous mixture that will create zones of different stiffnesses. It is particularly critical to ensure the casting mold is placed horizontal in the oven. Use a bubble level to check horizontality if required. It is also preferable to avoid making bubbles when pouring the liquid mixture in the casting mold. Proceed continuously and slowly when pouring. Finally, as indicated pay extra-caution to the corners of the PDMS plate when peeling off as these may tear upon excessive pulling (Figures 2[href=https://www.wicell.org#fig2]E–2G).\nPause Point: It is possible to pause the protocol at any step of the PDMS plate production.\nNote: On the choice of PDMS formulation and associated stiffness, we have tested formulations ranging between 1:40 to 1:60 (w:w) ratios and we can certify that those allow stretching of the PDMS plate by the mechanical stretcher. Softer formulations (1:n>60) would most likely allow stretching as well although we cannot certify them since we have not tested them. Additionally, investigators should figure out which stiffness would be appropriate to conduct their experiment. Parameters include organ of origin of the cells and its physiological stiffness, experimental assessment of the behavior and fate of the cells on various PDMS surfaces, etc.\nIn case of use of a 3D printed mold, the user should also verify that the material used for the mold will not have any adverse effect on the experiment such as cytotoxicity, autofluorescence, etc.\nFunctionalization and coating of the PDMS plate\nTiming: 1 h",
    "The goal of this step is to chemically functionalize and coat the surface of the PDMS plate with an extracellular matrix (ECM) protein, fibronectin in this particular case, or any other adhesion molecule for the cells to attach to the culture surface. The functionalization and coating should be carried out just prior to cell seeding.\nSilanization of the surface of the PDMS plate. All manipulations should be carried out under a chemical hood and waste disposed of properly through appropriate chemical waste.\nPrepare 2 mL of a 20% dilution of APTES in absolute ethanol per plate under a chemical hood. Cover the surface of each PDMS plate with this solution and incubate for 5 min. Remove excess of solution and dispose in chemical waste. Wash twice with 4 mL of absolute ethanol.\nAir dry the PDMS plate in a chemical hood\nCoating of the surface of the PDMS plate with fibronectin\nPrepare 3 mL of a 10 μg/mL of fibronectin from bovine plasma in PBS containing 0.05% EDC (w/w).\nImmediately add the solution to the surface of the silanized PDMS plate and incubate for 30 min at room temperature.\nWash twice with PBS. Cover with PBS until the plate is used.\nOptional: At this step, it is possible to irradiate the PDMS plates with germicidal UV for 30 min in order to prevent bacterial contamination.\nNote: All manipulations with APTES should be carried out under a chemical hood.\nThe functionalization of the PDMS plate should be carried out just prior cell plating.\nPause Point: It is not recommended to pause at this point, the functionalized PDMS plates should be used immediately and should not be stored for future use.\nCell growth on the PDMS plate\nTiming: 12 h",
    "The goal of this step is to grow cells on the PDMS plate prior to stretching.\nCell splitting\nWe routinely use HeLa cells or fibroblasts. Wash cells with PBS on the tissue culture plate.\nIncubate cells with trypsin EDTA (0.05%) for a few minutes at 37°C. Check cell rounding and detachment under a microscope.\nHarvest cells in complete medium (see recipe in Material and Equipment section).\nCell seeding on the PDMS plate\nThe surface of one PDMS plate is half (40 cm2) that of a 100 mm petri dish. Plate the required number of cells on the PDMS plate in a maximum of 4 mL of complete growth medium. We recommend cells to be 90% confluent at the time of stretching so seed the cells accordingly. For HeLa cells, we would recommend seeding 4 to 5 million cells 12 h prior to stimulation. For immunofluorescence on individual cells, 500 000 cells would constitute a starting point. Troubleshooting 1[href=https://www.wicell.org#sec6.1] and 2[href=https://www.wicell.org#sec6.3]\nNote: In this example, we used epithelial HeLa cells but other cell types can be used such as fibroblasts (NIH 3T3 and murine dermal fibroblasts have been used successfully). Some cell types turned out to be more difficult to use such as bovine aortic endothelial cells for instance.\nIt may be challenging to manipulate the PDMS plate out of the incubator. We routinely use SDS-PAGE glass plates to accommodate the PDMS plate. We use one clean large glass plate as a support for the PDMS plate and a small plate as a lid (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/579-Fig3.jpg\nFigure 3. Practical handling of the PDMS plate for cell culture\n(A and B) The PDMS plate is handled between two glass plates.\nCell stretching on the mechanical stretcher\nTiming: Variable from several minutes to a few hours",
    "The goal of this step is to mount the PDMS plate on the LEGO® mechanical stretcher and to apply cyclic uniaxial stretch to the cells.\nFit the LEGO® adaptors to the PDMS plate (Methods video S1[href=https://www.wicell.org#mmc1])\nCarefully adjust the jaws of the adaptors on the PDMS plate as shown in Figure 4[href=https://www.wicell.org#fig4] and Methods video S1[href=https://www.wicell.org#mmc1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/579-Fig4.jpg\nFigure 4. Preparation of the PDMS plate for mechanical stretching\n(A) individual elements required to assemble one adaptor.\n(B) partially assembled adaptor.\n(C and D) sPDMS plate with one adaptor attached to one side.\n(E) fully fitted PDMS plate attached to the mechanical stretcher via the adaptor.\n(F) entire system ready to stretch in a CO2 incubator.\nFirmly press the two parts against each other and insert the pins as indicated.\nRepeat the procedure with the other adaptor\nMount the PDMS plate on the mechanical stretcher using the LEGO® adaptors (Methods video S2[href=https://www.wicell.org#mmc2])\nPerform cyclic uniaxial cell stretching (Methods video S2[href=https://www.wicell.org#mmc2]).\nPlace the stretcher in the incubator (Figure 4[href=https://www.wicell.org#fig4]F).\nPlug the battery box.\nSwitch the system on to start stretching, monitor time. Troubleshooting 3[href=https://www.wicell.org#sec6.5]\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Installation of the adaptors to the PDMS plate, related to step 9\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Operation of the mechanical stretcher, related to step 10"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}