{
  "id": 3077,
  "origin_website": "Cell",
  "title": "Protocol for casein kinase 1γ3 CSNK1G3 gene knockout and recombinant gene expression in cultured HeLa cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGenome editing in HeLa cells\nTiming: 4–5 days (for step 1)\nTiming: 8–10 days (for step 2)\nTiming: 2–3 weeks (for step 3)\nTiming: 1–2 days (for step 4)\nTiming: 1–2 days (for step 4a)\nTiming: 2 days (for step 4b)\nThe following steps describe how to construct an sgRNA expression vector and use it for establishing genome edited HeLa cells.\nCloning of the sgRNAs in plasmid pSELECT-CRISPR-Cas9 (Figure 1[href=https://www.wicell.org#fig1]).\nDigest the pSELECT-CRISPR-CAS9 plasmid with Esp3I.\nRun the digested plasmid on a 1% agarose gel and excise and purify the linear backbone fragment, which is approximately 7.7 kbp in length (GEL/PCR Purification Mini Kit, Favorgen Biotech).\nNote: Alternative kits such as the QIAquick Gel Extraction Kit (QIAGEN), NucleoSpin Gel and PCR Cleanup (Takara Bio) may be used to purify DNA from agarose gels.\nPrepare an annealed oligonucleotide corresponding to the sgRNA sequence.\nMix complementary oligonucleotides to a final concentration of 22 μM each in 50 μL of buffer [100 mM Tris-HCl (pH 8.0), 100 mM NaCl, 10 mM EDTA].\ntable:files/protocols_protocol_2652_1.csv\nIncubate in a block heater or a thermal cycler as follows:\ntable:files/protocols_protocol_2652_2.csv\nMix the purified digested plasmid with 250 fmol of the annealed oligonucleotides in a ligation reaction. In this protocol, DNA Ligation Kit <Mighty Mix> (Takara Bio) was used. Incubate the ligation reaction at 16°C for 30 min.\nNote: Alternative reagents such as the T4 ligase (Roche Diagnostics) may be used for the ligation reaction.\nTransform 3 μL of the ligated reaction (store the rest at −20°C as backup) into E. coli using competent bacteria. In this protocol, in-house-prepared chemical-competent XL-1 Blue, XL-10 Gold, or DH5α bacteria was used. Plate the transformation mix onto Luria-Bertani (LB) broth agar plates containing 100 μg/mL of puromycin and incubate at 37°C 16–18 h.",
    "Pick at least 10 colonies and re-streak on an LB-agar plate containing 100 μg/mL of puromycin and incubate at 37°C 16–18 h.\nNote: Some of the colonies that appear in step e may carry self-ligated plasmids, which do not contain the sgRNA. Our experience has shown that cloning of sgRNAs using the pSELECT-CRISPR-CAS9 plasmid has a higher probability of self-ligation compared to ordinary cloning. The negative colonies cannot grow when re-streaked in step f and can be excluded.\nInoculate 3–4 grown colonies individually in 3–5 mL of LB medium containing 100 μg/mL of puromycin and incubate at 37°C 16–18 h with vigorous shaking (e.g., 200–250 rpm).\nHarvest the bacterial cells and extract plasmids. In this protocol, we used a Plasmid DNA Extraction Mini Kit (Favorgen Biotech) or Wizard Plus SV Minipreps DNA Purification System (Promega).\nVerify the inserted sequence by Sanger sequencing and identify the positive clones.\nGenome editing (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2652-Fig2.jpg\nFigure 2. Workflow for genome editing and cloning of genome-edited cells\nTransfection of HeLa cells with sgRNA-pSELECT-CRISPR-Cas9 plasmids.\nCulture HeLa cells in D-MEM with 10% (v/v) FBS at 37°C, 5% CO2, and 100% humidity. Seed HeLa cells on a 12-well plate (1.5 × 105 cells/well). Culture at 37°C 18–24 h.\nRefresh the culture medium 30–60 min prior to transfection.\nPrepare transfection mix as indicated below and incubate at 20°C–25°C for 20 min. In this protocol, we used X-tremeGENE HP Transfection Reagent (Roche Diagnostics).\ntable:files/protocols_protocol_2652_3.csv\nAdd the transfection mix dropwise to cells and culture at 37°C 24 h.\nNote: We used HeLa-mCAT#8 clone cells9[href=https://www.wicell.org#bib9] that stably expressed the mouse cationic amino transporter 1, which is the ecotropic receptor of the mouse leukemia virus. This cell line is useful for gene expression using retrovirus-based pMXs vectors.",
    "Note: Before cloning genome-edited cells, it is a good idea to make sure the genome editing is working. See step 4 for methods to verify the genome editing.\nNote: Prepare an extra well for a non-transfected sample. Use this sample as a positive control for puromycin selection in step b.\nTrypsinize the cell monolayers with 200–300 μL of trypsin-EDTA (Sigma-Aldrich) and pour the cell suspension onto a 60-mm dish containing 5 mL of culture medium. Add puromycin to a final concentration of 5 μg/mL.\nNote: The appropriate concentration of puromycin may differ when using different cell lines.\nCulture for 2–3 days at 37°C until the non-transfected HeLa cells have died off completely.\nTrypsinize the cell monolayers and transfer the harvested cells onto a 12-well plate. Culture for 3–4 days to amplify the puromycin-selected cells.\nCloning of genome-edited cells (Figure 2[href=https://www.wicell.org#fig2]).\nTrypsinize the cell monolayers, count the puromycin-selected cells from step 2 and seed 100–200 cells in a 100-mm dish. If possible, proceed with this step in the morning. Spin down the remaining cells, resuspend them in CELLBANKER1 (Zenogen Pharma) and store at −80°C (bulk stock).\nPause point: The bulk stock can be used for future usage.\nUnder a microscope, confirm that the cells have adhered to the dish (late afternoon on the same day as step a or early in the morning on the next day). Use a permanent marker pen to locate at least 10 single cells by drawing a circle around them on the bottom of the dish.\nNote: In this protocol, we used cloning rings to obtain monoclonal cell populations. Alternatively, the limiting diluted cells can be seeded on 96 well plates (corresponds to step a). In this case, please mark the wells that contain a single cell (corresponds to step b).",
    "Culture until the marked cells form colonies consisting of more than 10 cells. This generally takes 10–14 days.\nIsolate the colonies and seed on a 12-well plate and a 24-well plate.\nRemove the medium from the dish.\nApply autoclaved grease on a cloning ring and place it on the dish so that one of the colonies appears inside the cloning ring.\nWash the cells inside the ring with 100 μL of PBS and add 50 μL of trypsin-EDTA. Repeat this procedure for the other colonies.\nCheck under a microscope that the cells are detached from the dish and add 200 μL of fresh medium to each cloning ring.\nHarvest the cells by pipetting up and down. Transfer the cell suspensions into 1.5-mL tubes and spin down the cells. Discard the medium and resuspend the cells in 1 mL of fresh medium. Seed 400 μL and 600 μL of the cell suspension on a 12-well plate and a 24-well plate, respectively. Add an additional 600 μL of fresh medium to the 12-well plate so that the total culture volume of each well is 1 mL. Culture the cells until sub-confluence.\nUse the cells for verification of genome editing. In addition, prepare cell stocks of each clone using CELLBANKER1.\nNote: Cell growth rates vary widely among clones. For ease of analysis after isolation, it is better to eliminate clones that grow too fast or too slowly.\nNote: Cells cultured on 24-well plates are sufficient for verification of genome editing by genome direct sequencing.\nVerification of genome editing.\nGenome direct sequencing.",
    "Trypsinize the cell monolayers and harvest them from the 24-well plate from step 3 in 1.5-mL tubes. Wash the cells twice with 500 μL of PBS and resuspend them in 100 μL of TE buffer [10 mM Tris-HCl (pH 8.0), 1 mM EDTA].\nIncubate at 95°C for 5 min.\nCentrifuge at 16,873 × g for 10 min at 4°C and transfer the supernatant (DNA solution) to new 1.5-mL tubes.\nPrepare the PCR reaction mix indicated below to amplify the target region of genome editing. Use 1 μL of DNA solution and a pair of primers indicated in the key resources table[href=https://www.wicell.org#key-resources-table].\nNote: We did not measure the concentration of DNA solution prepared from cells cultured in 24 well plates, but since there were no problems in the procedures after a-iv, the DNA concentration is considered to be within a certain range.\ntable:files/protocols_protocol_2652_4.csv\ntable:files/protocols_protocol_2652_5.csv\nRun 5 μL of the PCR reaction on a 2% agarose gel to verify the PCR amplification of the target region. The nucleotide lengths of PCR products corresponding to the target regions in exon 5 and exon 12 are 500 bp and 457 bp, respectively.\nPurify the remaining PCR reaction using QIAquick PCR Purification Kit (QIAGEN) and elute the PCR product using 50 μL of H2O.\nNote: Alternative kits such as the NucleoSpin Gel and PCR Cleanup (Takara Bio) may be used to purify the PCR product.\nUse 5 μL of the eluted PCR product and primers indicated in the key resources table[href=https://www.wicell.org#key-resources-table] for Sanger sequencing.",
    "Critical: It is important to know the karyotype of the cells you use. Because HeLa cells are pseudo-triploids, it is necessary to ensure that three or more loci have undergone genome editing. Because different genome edits can occur at each locus, multiple bands of different sizes may be detected in step v. In this case, sequencing analysis is difficult because of the mixture of multiple waveforms. Therefore, it is better to perform a sequencing analysis of each locus after cloning the PCR product of step vii.\nCritical: To eliminate any clonal effects, we recommend using independently isolated multiple clones for at least the initial phenotype analysis.\nLysenin-resistance analysis by MTT assay.\nThe C-terminally truncated CSNK1G3 mutant generated by genome editing exhibits lysenin resistance, whereas the parental HeLa cells and CSNK1G3 knockout mutant are sensitive to lysenin. Thus, measuring sensitivity to lysenin can identify successful C-terminal cleavage genome editing of the CSNK1G3 locus.\nSeed cells from step 3 on a 12-well plate (2.5 × 104[href=https://www.wicell.org#bib4] cells/well). Prepare three wells for each genome-edited cell line or the parental HeLa cells. Culture at 37°C 18–24 h.\nWash the cells once with 1 mL of serum-free medium.\nAdd 500 μL of serum-free medium supplemented with or without lysenin (a gift from Dr. Sekizawa, Zenyaku Kogyo) at a final concentration of 100 ng/mL and culture at 37°C for 2 h.\nDiscard the medium and add 250 μL of fresh serum-free medium to each well.\nAdd 250 μL of MTT solution (5 mg/mL thiazolyl blue tetrazolium bromide in PBS) to each well and mix by swirling the plate. Incubate at 37°C for 3 h.",
    "Add 750 μL of MTT solvent (4 mM HCl in isopropanol) to each well and mix by swirling the plate. Cover the plate with a piece of tin foil to protect the MTT dye from light and incubate at 20°C–25°C for 30 min with shaking on an orbital shaker.\nMeasure the absorbance at OD = 595 nm. The amount of absorbance is proportional to the cell number.\nNote: In our lysenin-resistance assay, the MTT method gave a better S/N ratio than the WST-8/1-Methoxy PMS method. Thus, we chose the MTT method in this protocol.\nNote: Because different cell types have different sensitivities to lysenin, we recommend optimizing the lysenin concentration for each cell line.\nCloning and expression of human CSNK1G1–3 genes in genome-edited cells\nTiming: 4–5 days (for step 5)\nTiming: 10–13 days (for step 6)\nTiming: 7–9 days (for step 7)\nTiming: 10–14 days (for step 8)\nTiming: 2 days (for step 9)\nGenome-editing target gene expression vectors are useful for off-target verification and analysis of gene mutations. Here, we describe the steps involved in constructing expression vectors, producing retroviruses, and introducing CDS into HeLa cells.\nConstruction of the HA-CK1G1 expression plasmid.\nNote: Because we failed to amplify the CSNK1G1 cDNA from total cDNA prepared from Hela cells, which might be due to a low expression level, we constructed a retroviral vector for the expression of an N-terminally HA-tagged CK1G1 by transferring the HA-CK1G1 CDS from a commercially obtained HA-CK1G1/pCMV plasmid (Sino Biological) into pMXs-IRES-IN retroviral vector.\nPrepare the PCR reaction mix indicated below to amplify the HA-CK1G1 coding gene region using a pair of primers indicated in the key resources table[href=https://www.wicell.org#key-resources-table].\ntable:files/protocols_protocol_2652_6.csv\ntable:files/protocols_protocol_2652_7.csv",
    "Run the PCR reaction on a 1% agarose gel and purify the amplified HA-CK1G1 CDS, which is 1333 bp in length, and elute the PCR product using 40 μL of H2O.\nDigest 20 μL of the purified PCR product (HA-CK1G1 coding gene) and 0.5 μg of pMXs-IRES-Neo vector with EcoRI and NotI restriction enzymes.\nAfter ethanol precipitation, dissolve the digested DNA in 5 μL of TE buffer [10 mM Tris-HCl (pH 8.0), 1 mM EDTA].\nRun 1 μL of the DNA on a 1% agarose gel and estimate the amount in comparison with size marker bands. Mix the digested gene products and the pMXs-IRES-Neo vector in an approximately 2:1 molar ratio and prepare a ligation reaction mix. Incubate the ligation reaction at 16°C for 4–5 h.\nTransform 3 μL of the ligation reaction (store the rest at −20°C as backup) into E. coli using competent bacteria. Plate the transformation mix onto LB agar plates containing 100 μg/mL of ampicillin and incubate at 37°C 16–18 h.\nPick at least 10 colonies and subject them to colony PCR to identify positive clones with CSNK1G gene inserts.\nPrepare the following PCR reaction mixture and aliquot 15 μL into PCR reaction tubes. Pick the bacteria from each colony using a disposable tip and suspend them in the PCR reaction mixture.\ntable:files/protocols_protocol_2652_8.csv\ntable:files/protocols_protocol_2652_9.csv\nLoad 5 μL of PCR reaction on a 1% agarose gel and detect positive clones with PCR products of approximately 1.4 kbp.\nInoculate 3–4 positive colonies individually in 3–5 mL of LB medium containing 100 μg/mL of ampicillin and incubate at 37°C 16–18 h with vigorous shaking.\nHarvest the bacterial cells and extract plasmids.\nVerify the inserted sequence by Sanger sequencing and identify positive clones (HA-CK1G1/pMXs-IRES-IN).",
    "Construction of the HA-CK1G2 expression plasmid (Figure 3[href=https://www.wicell.org#fig3]). Sub-clone the CSNK1G2 gene region including the 5′UTR region into pcDNA3.1(+) vector (Invitrogen). Insert an HA-tag CDS between the 5′UTR and the CSNK1G2 CDS by PCR. Transfer the 5′UTR-HA-CK1G2 DNA region into a retrovirus-based pMXs-IRES-Neo vector.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2652-Fig3.jpg\nFigure 3. Workflow for construction of the HA-CK1G2 expression plasmid\nPrepare the PCR reaction mix indicated below to amplify the CSNK1G2 gene region including its 5′ untranslated region using the pMOPBlue/hCKIγ2 plasmid (a gift from Dr. Kusuda, The University of Tokyo)6[href=https://www.wicell.org#bib6] as a template and a pair of primers indicated in the key resources table[href=https://www.wicell.org#key-resources-table].\nNote: The CSNK1G2 cDNA was cloned from a human testis cDNA library.6[href=https://www.wicell.org#bib6]\nNote: Although the 5′UTR sequence included in the pMOPBlue/hCKIγ2 plasmid is partial and not intact, the sequence was sufficient to control and enable the expression of the CSNK1G2 gene.\ntable:files/protocols_protocol_2652_10.csv\ntable:files/protocols_protocol_2652_11.csv\nRun the PCR reaction on a 0.8% agarose gel and purify the amplified CSNK1G2 gene product, which is 1703 bp in length, and dissolve the PCR product using 40 μL of TE buffer [10 mM Tris-HCl (pH 8.0), 1 mM EDTA].\nDigest 5 μL of purified PCR product and pcDNA3.1(+) vector with EcoRI and XhoI restriction enzymes.\nAfter ethanol precipitation, dissolve the digested DNA in TE buffer.\nMix the digested gene product in excess against the pcDNA3.1(+) vector to prepare the ligation reaction mix. Incubate the ligation reaction at 16°C 16–18 h.\nTransform the ligated reaction into E. coli using competent bacteria. Plate the transformation mix onto LB agar plates containing ampicillin and incubate at 37°C 16–18 h.\nInoculate 3–4 colonies individually in 3–5 mL of LB medium containing ampicillin and incubate at 37°C 16–18 h with vigorous shaking.\nHarvest the bacterial cells and extract plasmids.",
    "Verify the inserted sequence by Sanger sequencing and identify positive clones (pcDNA/5′UTR-hCKIγ2).\nInsert an HA-tag sequence in-frame with the CSNK1G2 CDS by PCR using a set of primers indicated in the key resources table[href=https://www.wicell.org#key-resources-table]. Digest the PCR reaction with DpnI restriction enzyme and transform into E. coli. Follow steps g–i to construct pcDNA/5′UTR-HA-hCKIγ2.\nDigest 0.5 μg of pcDNA/5′UTR-HA-hCKIγ2 plasmid and pMXs-IRES-Neo vector with EcoRI and XhoI restriction enzymes. Follow steps d–i to construct the HA-CK1G2/pMXs-IRES-IN plasmid.\nConstruction of the HA-CK1G3 expression plasmid (Figure 4[href=https://www.wicell.org#fig4]). PCR amplify the CK1G3 coding region (CSNK1G3) from total cDNA prepared from HeLa cells and add an HA-tag CDS to the 5′-end by sub-cloning the gene region into pBSnHAcFL vector.7[href=https://www.wicell.org#bib7] Transfer the HA-CK1G3 coding gene into a retrovirus-based pMXs-IRES-Neo vector.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2652-Fig4.jpg\nFigure 4. Workflow for construction of the HA-CK1G3 expression plasmid\nPrepare total RNA from HeLa cells cultured on a 6-well plate using a PureLink RNA Mini Kit (Ambion). Elute total RNA in 30 μL of RNase-free H2O.\nUse 0.5 μg of total RNA and ReverTra Ace qPCR RT Master Mix (Toyobo) to synthesize cDNA.\nPrepare the PCR reaction mix indicated below to amplify the CSNK1G3 gene region. Use 0.5 μL of cDNA solution and a pair of primers indicated in the key resources table[href=https://www.wicell.org#key-resources-table].\ntable:files/protocols_protocol_2652_12.csv\ntable:files/protocols_protocol_2652_13.csv\nRun the PCR reaction on a 1% agarose gel and purify the amplified CSNK1G3 gene product, which is 1277 bp in length, and elute the PCR product using 40 μL of H2O.\nDigest 10 μL of purified PCR product and 0.5 μg of pBSnHAcFL vector with SalI and KpnI restriction enzymes.\nAfter ethanol precipitation, dissolve the digested DNA in 5 μL of TE buffer.",
    "Run 1 μL of the DNA on a 0.8% agarose gel and estimate the amount in comparison with size marker bands. Mix the digested gene products and the pBSnHAcFL vector in an approximately 2:1 molar ratio and prepare the ligation reaction mix. Incubate the ligation reaction at 16°C for 4–5 h.\nTransform 3 μL of the ligated reaction (store the rest at −20°C as backup) into E. coli using competent bacteria. Plate the transformation mix onto LB agar plates containing 100 μg/mL of ampicillin and incubate at 37°C 16–18 h.\nPick at least 10 colonies and subject them to colony PCR to identify positive clones with CSNK1G3 gene inserts.\nPrepare the following PCR reaction mixture and aliquot 15 μL into PCR reaction tubes. Pick bacteria from each colony using a disposable plastic tip and suspend them in the PCR reaction mixture.\ntable:files/protocols_protocol_2652_14.csv\ntable:files/protocols_protocol_2652_15.csv\nLoad 5 μL of PCR reaction on a 0.8% agarose gel and detect positive clones with PCR products of approximately 1.5 kbp.\nInoculate 3–4 positive colonies individually in 3–5 mL of LB medium containing 100 μg/mL of ampicillin and incubate at 37°C 16–18 h with vigorous shaking.\nHarvest the bacterial cells and extract plasmids.\nVerify the inserted sequence by Sanger sequencing and identify positive clones (HA-CK1G3/pBSnHAcFL).\nDigest 0.5 μg of HA-CK1G3/pBSnHAcFL plasmid and pMXs-IRES-Neo vector with EcoRI and NotI restriction enzymes. Follow steps f–l to construct the HA-CK1G3/pMXs-IRES-IN plasmid. In step i, use primers pMX-Fw and pMX-Rv for colony PCR.\nHA-CK1G1–3 CDS transfer to HeLa cells using a retroviral system.\nRetrovirus production.\nSeed Plat-E Retroviral Packaging cells on a 6-well plate (8 × 105 cells/well). Culture at 37°C 18–24 h.\nRefresh the culture medium 30–60 min prior to transfection.",
    "Mix 100 μL of Opti-MEM with 3 μL of FuGENE6 Transfection Reagent (Promega) and incubate at 20°C–25°C for 5 min. Add 1 μg of HA-CK1G/pMXs-IRES-IN plasmid, mix, and incubate at 20°C–25°C for 20 min. Add dropwise to cells and culture at 37°C 24 h.\nRefresh the medium and culture at 37°C 18–24 h.\nNote: Refreshing the medium is recommended at 1 day after transformation to eliminate incomplete virus particles produced immediately after transformation.\nCollect media using a 5-mL syringe and pass through a 0.45 μM filter (virus stock). Aliquot the virus stock into two tubes and store at −80°C.\nNote: The virus stock is stable after several freeze-thaw cycles.\nGene transfer.\nSeed HeLa cells on a 6-well plate (1 × 105 cells/well). Culture at 37°C 18–24 h.\nPrepare the virus solution as indicated below. Discard media and add the virus solution. Prepare one well without the virus solution as a negative control for marker selection in the next step. Incubate at 37°C for 4 h. Refresh the medium and culture the cells at 37°C 18–24 h.\ntable:files/protocols_protocol_2652_16.csv\nTrypsinize the cell monolayers, resuspend the harvested cells in the medium supplemented with 400 μg/mL of G418 (InvivoGen), and transfer to a 60 mm dish. Culture at 37°C for 2–3 days and refresh the medium (supplemented with G418). When the cells are sub-confluent, trypsinize the cell monolayers, resuspend the cells in fresh culture medium, dilute the cell suspension 3- to 4-fold with G418-supplemented medium, and transfer the cell suspension to a new 60-mm dish. Repeat this step until the cells in the control well (without gene transfer) have died off completely.\nNote: Because G418 works while cells are dividing, dilution to reduce cell density is important for efficient drug selection when cells reach sub-confluence.",
    "Prepare cell stocks using CELLBANKER1 and store at −80°C (bulk stock).\nNote: If necessary, proceed to “cloning of genome-edited cells” (step 3) in the “genome editing in HeLa cells[href=https://www.wicell.org#sec2.1]” section.\nExpression verification by western blot (WB) analysis.\nTrypsinize the cell monolayers from a 6-well plate, wash twice with 500 μL of PBS, and resuspend in 100 μL of TBS buffer [25 mM Tris-HCl (pH 7.4), 137 mM NaCl, 2.68 mM KCl] containing 1% (v/v) Triton X-100 and cOmplete Protease Inhibitor Cocktail EDTA-free (Roche Diagnostics). Incubate on ice for 10 min to lyse the cells.\ntable:files/protocols_protocol_2652_17.csv\nNote: Alternatively, wash cells on the 6-well plate twice with 2 mL of PBS and add 100 μL of TBS buffer containing 1% (v/v) Triton X-100 and protease inhibitors. Incubate the plate on ice for 10 min.\nCentrifuge the tubes at 16,873 × g for 10 min at 4°C. Transfer the supernatant to a new tube. Keep the samples on ice.\nQuantify the protein amount in the samples using the Pierce BCA Protein Assay Kit (Thermo Fisher Scientific). Mix 25–50 μg of total protein sample with 12.5 μL of 4× NuPAGE LDS Sample Buffer (Thermo Fisher Scientific) supplemented with 100 mM dithiothreitol and up to 50 μL H2O. The final protein concentration will be 0.5–1 μg/μL. Incubate the sample at 70°C for 5 min to denature the proteins and quickly chill on ice.\nNote: You can also use the Bradford protein assay instead of the BCA protein assay and the Lamili buffer instead of the LDS buffer.\nNote: Quenching the sample on ice after heating can reduce the viscosity of the sample because it inhibits the reannealing of nucleic acids contained in the sample.\nNote: Some proteins aggregate when heated at a high temperature such as 90°C–95°C.",
    "Load 5–10 μg of total protein sample on a 7.5% SDS-polyacrylamide gel. Run the gel at a constant current of 20–30 mA per gel for 60–90 min depending on the gel size.\nTransfer the proteins to a PVDF membrane immersed in transfer buffer [25 mM Tris, 192 mM glycine, 10% (v/v) methanol (pH 8.3)] using Mini Trans-Blot Cell (Bio-Rad Laboratories) at a constant voltage of 30 V for 16–17 h at 4°C.\nNote: Alternatively, proteins can be transferred at a constant voltage of 100 V for 1 h using the same equipment.\nBlock the PVDF membrane with TBS buffer containing 0.1% (v/v) Tween20 (TBS-T) and 5% skimmed milk for 30 min at 20°C–25°C.\nRinse the PVDF membrane with TBS-T and incubate with anti-HA-HRP conjugate antibody (Roche Diagnostics) diluted 5000-fold in TBS-T containing 1% skimmed milk for 1 h at 20°C–25°C.\nWash the PVDF membrane for 5 min at 20°C–25°C with TBS-T. Repeat this wash step two more times.\nVisualize HA-CK1G signals using Immobilon Western Chemiluminescent HRP Substrate (Millipore)."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Gene Expression",
    "Sequencing"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}