{
  "id": 2869,
  "origin_website": "Cell",
  "title": "Protocol for using serial two-photon tomography to map cell types and cerebrovasculature at single-cell resolution in the whole adult mouse brain",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPerfusion, fixation, and brain tissue-processing for STPT imaging\nTiming: 15–20 min per animal perfusion, 24 h for post-fixation (for steps 1 to 28)\nThis protocol describes the procedures for transcardial perfusion and fixation of postnatal mice, including anesthesia, exsanguination, fixation, brain removal, post-fixation, storage, and dissection. Please refer to the key resources table[href=https://www.wicell.org#key-resources-table] and materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for necessary reagents and related recipes. Once fixed and dissected, the brain samples can be utilized for Brain sample embedding, followed by Serial two-photon tomography (STPT) sample setup and image acquisition.\nNote: Personal Protective Equipment (PPE) should be used at all times while operating this protocol.\nRetrieve animals for collection from designated rooms by verifying that the cage card has the same cage number and Mouse IDs as listed on the task.\nMake freshly prepared 4% paraformaldehyde (PFA) – approximately 50 mL per adult mouse, which includes the amount needed for post-fixation.\nTo prepare 4% PFA from a 16% PFA stock, dilute 25 mL of 16% PFA by adding 25 mL of distilled water, creating 8% PFA. Transfer PFA solution to a 100 mL glass bottle with screw cap. Then, add 50 mL of 0.2 M PB to make a 4% PFA in 0.1 M PB solution.\nNote: Normally, 4% PFA is freshly prepared on the day of perfusion. It is advised to make a stock of 16% PFA (25 mL aliquots) kept chilled in 50 mL vials at 4°C until use.\nPrepare a bottle with 0.9% saline – approximately 30 mL per adult mouse.\nAttach a butterfly needle with 23 gauge (23G) to the luer connector by twisting it on tightly.\nTurn the peristaltic pump (Ismatec) on and place the feeding tube into the bottle of 0.9% saline.",
    "Set the flow rate of the pump to 6 mL/min for adult mice and press start, while visually inspecting that the tubing fills with saline.\nPump until saline exits the needle, at least 3–5 mL. This will ensure that no bubbles are introduced from the line and into the mouse cardiovascular system.\nPrepare perfusion board and tray (e.g., polystyrene foam board that is elevated in a plastic tray with raised corners to allow for drainage) and hypodermic needles (BD, 305125) to secure the limbs to the board during perfusion.\nAfter removing the mouse from its cage, confirm the identity to make sure it is consistent with what was requested.\nDeeply anesthetize the mouse via intraperitoneal injection of a mixture of ketamine (KetaVed; Vedco, NDC: 50989-996-06) and xylazine (AnaSed; Akorn, NDC: 59399-110-20) using a 28G insulin syringe (BD, 329424).\nNote: Ketamine dosage: 100–120 mg/kg, Xylazine dosage: 10–16 mg/kg. On average, adult mice will require 0.4 mL of the Ketamine/Xylazine mixture. If there is a need to re-dose for an extended anesthetic effect, supplement the mouse with 1/4 to 1/3 of the original dose of the ketamine/xylazine mixture.\nMonitor animals for respiratory rate and effort and assess the level of anesthesia by loss of pedal reflex (toe pinch).\nUse the toe pinch reflex test to determine whether the mouse is anesthetized to a surgical plane.\nNote: The absence of a response indicates the mouse is ready to perfuse.\nPin all four paws to the perfusion board with clean, hypodermic needles.\nTilt the foam board so the head of the mouse is slightly lifted.\nSpray the mouse body with 70% ethanol in distilled water solution.",
    "Using surgical scissors with one blunt and one sharp tip (Fine Science Tools, 14007-14) perform a lateral and midline cut of the ventral surface of fur and skin, as well as the peritoneum, over the diaphragm (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig4.jpg\nFigure 4. Transcardial perfusion of an adult mouse\n(A) To begin the process of mouse transcardial perfusion, a lateral and midline cut of the ventral surface of fur and skin, as well as the peritoneum, should be made.\n(B) The organs of the abdominal cavity are immediately exposed. By grasping the xyphoid process of the sternum with forceps, it is easier to secure the body for snipping the diaphragm along the bottom of the ribs. Clean cuts should be made along both sides of the rib cage – avoiding the heart, lungs, or the veins along the rib cage.\n(C) Noticeably, a flap of muscle and ribs is present at this point and the top part of the rib cage should be pinned to the perfusion board with a needle, exposing the heart and lungs.\n(D) A small incision is then made in the right atrium (#1). The right atrium is a darker red shade compared to the rest of the heart. A butterfly needle is then inserted into the tip of the left ventricle (#2) and directed toward the aorta to allow the solution or perfusate to pump throughout the entire body and leave from the right atrium.\nExpose the organs of the abdominal cavity.\nGrasp the xyphoid process of the sternum with Graefe forceps and carefully snip the diaphragm along the bottom of the ribs above the liver.\nMake clean cuts along both sides of the rib cage and avoid nicking the heart, lungs, or the veins along the rib cage (Figure 4[href=https://www.wicell.org#fig4]B).",
    "Expose the heart and lungs (Figure 4[href=https://www.wicell.org#fig4]C).\nBend the flap of muscle and ribs (created by the previous step) and pin the top part of the rib cage to the perfusion board with a hypodermic needle.\nCarefully make a small incision in the right atrium using fine scissors (Figure 4[href=https://www.wicell.org#fig4]D, #1).\nNote: The right atrium is a darker red shade compared to the rest of the heart.\nGrasp the heart with forceps and then insert the butterfly needle into the tip of the left ventricle (Figure 4[href=https://www.wicell.org#fig4]D, #2), directing the tip of the needle toward the aorta.\nNote: Exsanguination will not occur if the needle is placed in the right ventricle or if it crosses the septum.\nLay the butterfly needle and tubing flat against the perfusion board and ensure the needle remains in place within the heart during this process.\nTurn on the pump, allowing approximately 20–30 mL of saline to run through the tubing and rinse the circulatory system for about 2 min.\nNote: The liver should transition in color from dark red to light orange/beige.\nOnce the bodily fluid exiting the circulatory system is clear, stop the pump with the tubing still in the bottle of saline, and place the tube into the bottle with 4% PFA.\nTurn on the pump to rinse the circulatory system with 30–40 mL of 4% PFA for 3 min.\nNote: After several seconds, the mouse should begin physically “twitching,” indicating the fixation of the muscle tissue. If the perfusion of the fixative was successful, the body of the animal will be stiff by the end of 3 min.\nGently take out the butterfly needle from the left ventricle.",
    "Remove the tube from 4% PFA solution, allowing a bubble of air into the tubing, and then place the tube back into saline to rinse out the pump.\nEnsure that all PFA is out of the tubing. Then, stop the pump.\nComplete takedown procedure by repeating step 23 after each animal perfusion.\nAfter the last perfusion, clean the peristaltic pump as well as the tubing that was contaminated by blood during the perfusion process.\nPour out any 4% PFA solution caught in the tray into a hazardous waste bottle.\nPlace tray, perfusion board, and surgical dissection tools in the sink and spray with approved disinfectant (i.e., 10% bleach).\nUse water and a brush to remove any debris.\nRinse everything with 70% ethanol and place on absorbent pads to dry.\nRemove all needles from the mouse and decapitate the head.\nDispose of animal carcasses not being used in appropriate animal waste containers.\nFor post-fixation, place the entire head in a vial containing at least 15 mL of 4% PFA and chill upright at 4°C for at least 12 h to overnight.\nThe next day, replace the PFA solution with 0.05 M PB with 0.2% (w/v) sodium azide and store upright at 4°C until ready for brain dissection and embedding.\nMouse brain dissection procedure is as follows:\nPeel off the skin and muscles from the skull of the mouse head.\nNote: It is recommended to use Micro-Adson forceps with serrated tips (Fine Science Tools, 11018-12) (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig5.jpg\nFigure 5. A method for whole mouse brain dissection\n(A) Peel off the skin and muscles from the skull of the mouse head.\n(B) Then, make a small incision starting from the bottom to expose the spinal cord and brainstem.",
    "(C) Make two small incisions, left and right along the lambdoid sutures, and gently peel the skull away from the brain stem and the cerebellum to expose the cerebellum.\n(D) After removing the skull from the top of the cerebellum, make a midline incision along the sagittal suture of the skull.\n(E) From the midline, gently peel away the parietal bones to uncover each hemisphere (left and right) of the cortex. After removing the skull over the cortex, make a cut in front of the olfactory bulbs and remove the cartilaginous remnants (olfactory epithelium) to detach the skull from the nasal bone.\n(F) From the midline of the skull between the coronal sutures and the cut near the olfactory area, gently peel away pieces of the skull in an outward motion on both sides.\n(G) The dorsal surface of the brain should now be exposed. After removing the white matter tracts on the ventral surface, the entire brain can be lifted from the skull.\nCarefully cut the skull in an upward direction starting from the base of the spinal cord to expose both the spinal cord and brainstem (Figure 5[href=https://www.wicell.org#fig5]B).\nNote: Using fine scissors with a sharp tip (Fine Science Tools, 14040-10) for all incisions will facilitate the dissection.\nMake two more small incisions, left and right along the lambdoid sutures.\nGently peel the skull away from the brain stem and the cerebellum (Figures 5[href=https://www.wicell.org#fig5]C and 5D).\nNote: Using Graefe forceps (Fine Science Tools, 11050-10) during this step and forward will allow for finer control during the dissection process.\nAfter removing the skull and exposing the dorsal surface of the cerebellum, make a midline incision right along the sagittal suture of the skull (Figure 5[href=https://www.wicell.org#fig5]D).",
    "From the midline, gently peel away the parietal bones to uncover each hemisphere of the cortex (Figure 5[href=https://www.wicell.org#fig5]E).\nAfter removing the skull over the cortex, make a cut in front of the olfactory bulbs.\nRemove the cartilaginous remnants (olfactory epithelium) to detach the skull from the nasal bone (Figure 5[href=https://www.wicell.org#fig5]E).\nFrom the midline of the skull, between the coronal sutures and the cut made near the olfactory area, peel away the skull in an outward motion on both sides (Figure 5[href=https://www.wicell.org#fig5]F).\nNote: The entire dorsal surface of the brain should now be exposed (Figure 5[href=https://www.wicell.org#fig5]G).\nCarefully remove any dura in between brain tissue areas.\nCut the white matter tracts found along the ventral side of the brain.\nGently scoop out the brain with an Iris spatula (Fine Science Tools, 10093-13).\nPlace the dissected brain in a vial filled with fresh 0.05 M PB with 0.02% (w/v) sodium azide and store at 4°C until ready to embed for STPT imaging.",
    "Note: It is acceptable for brains to be dissected following perfusion but before post-fixation in 4% PFA, or after post-fixation of the whole head and consequent storage in 0.05 M PB with 0.02% (w/v) sodium azide. The dissections might be more feasible if done right away following perfusion. In this case, remember to post-fix the dissected brain in a vial containing at least 15 mL of 4% PFA and chill upright at 4°C for at least 12 h to overnight before replacing the PFA with PB (step 27, above). If you choose to dissect the brain after post-fixation and storage in PB, replace the solution with fresh PB and sodium azide before continuing to the embedding process. Regardless of either method, endogenous fluorophores should be well-preserved and maintained for at least 3–4 months. Since it is natural for fluorophores to weaken over time, thereby decreasing fluorescence intensity, we recommend utilizing mouse brains for STPT imaging immediately after the post-fixation period or within 3–4 months from the date of collection and perfusion.\nPerfusion, fixation, and brain tissue-processing for vascular STPT imaging\nTiming: 1 week (for steps 29 to 38)\nThis section outlines the steps required for transcardial perfusion and fixation of postnatal mice, for the purpose of vascular STPT imaging. Please refer to the key resources table[href=https://www.wicell.org#key-resources-table] and materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for necessary reagents and related recipes. Once brain samples are processed, they can be utilized for Brain sample embedding and Vascular image acquisition using STPT. The following cerebrovascular labeling method has been adopted from a previous study by Tsai et al.10[href=https://www.wicell.org#bib10]\nSimilar to regular tissue processing described above, use a ketamine/xylazine mixture to deeply anesthetize all animals for vascular imaging.",
    "For transcardial perfusion, use a peristaltic pump (Welch) with 0.9% saline followed by 4% PFA at 15 mL/min to remove the blood and properly perform tissue fixation.\nPrior to perfusion procedures, prepare a fluorescein isothiocyanate (FITC) conjugated albumin/gelatin mixture ahead of time.\nKeep this solution heated at 42°C to prevent the gel from solidifying.\nTo make the FITC/gelatin mixture:\nOn a hot plate, add 1× PBS in a glass beaker with a thermometer inserted into the beaker.\nOnce boiling, add 2% (w/v) porcine skin gelatin (Sigma Aldrich, G1890-500G) with a stir bar and mix thoroughly.\nOnce the gelatin is completely mixed and no particles are present in the mixture, reduce the heat to below 50°C.\nUsing a 10 mL luer-lock syringe and a 0.2 μm filter attachment, filter the entire mixture into a new beaker containing a stir bar, and account for any evaporation in terms of total volume.\nOnce the filtered mixture is between 42°C–50°C, add 0.1% (w/v) FITC-conjugated albumin (Sigma Aldrich, A9771-1G) into the gel mixture.\nFilter the solution a second time using a new 10 mL leur-lock syringe and a 0.2 μm filter attachment.\nMake sure to keep the temperature of the solution above 42°C.\nDuring the last minute of 4% PFA perfusion, gradually increase the speed of perfusion from 15 to 30 mL/min.\nWithin the last 30 s of 4% PFA perfusion, tilt the mouse body at a 30° angle to keep the head below the level of the heart.\nNote: Transcardial perfusion of FITC/gelatin occurs for 30 s.\nEnsure that there are absolutely no bubbles in the line before or after perfusion of FITC/gelatin.\nOnce 30 s have elapsed, clamp the heart and major blood vessels (ascending aorta and superior vena cava) with a hemostat to ensure that the gel remains within the vasculature.",
    "Immediately place the entire mouse body, with the head down, into a bucket of ice for 30 min to ensure solidification of the gel within the vasculature.\nAfter 30 min, decapitate and place the entire head in 4% PFA for 1 week at 4°C for post-fixation.\nAfter 1 week, carefully dissect the brain from the skull following the same protocol outlined in the section for regular perfusion and tissue processing.\nNote: The gel, appearing yellow in color, should be presently associated with the dura/meninges, reflecting appropriate filling of the vessels.\nBrain sample embedding\nTiming: 30 min to 1 h (active embedding) plus 12 h to overnight (ready for STPT imaging) (for steps 39 to 59)\nThis section includes step-by-step instructions for mouse brain embedding in 4% oxidized agarose for STPT imaging. A crucial cross-linking reaction between the brain and the oxidized agarose are facilitated by using a sodium borohydrate buffer solution. This process allows for consistent vibratome sectioning of the embedded brain sample. Please refer to the key resources table[href=https://www.wicell.org#key-resources-table] and materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for reagents and recipes used in this section. Also, please see “Methods video S1[href=https://www.wicell.org#mmc1]” as the visualization may prove beneficial.\nObtain the previously perfused and dissected brain stored in 0.05 M PB.\nRemove the brain from the conical tube and dry it using Kimwipes.\nGently dab the brain with a Kimwipe.\nEnsure no moisture or liquid droplets are present on the surface of the brain.\nNote: The oxidized agarose will not adhere well to the surface of the brain if it remains wet.\nCarefully place the brain on top of the slats of the metal embedding platform.\nUse blunt forceps or fingers to position the brain on the slats, which form lanes.",
    "Align the midline of the brain so it is parallel to the lanes (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig6.jpg\nFigure 6. STPT sample embedding process for whole mouse brains\n(A) The first column consists of photos taken during the brain alignment process. The second column adjacent to the photos are depictions of how the brain should be aligned to the parallel slats of the embedding platform.\n(B) A customized 1-inch metal cube serves as the mold, which is placed around the brain on the platform and awaits embedding.\n(C) Photo example of two adult mouse brains embedded in oxidized agarose that has cooled and solidified into blocks after removal of the metal molds.\n(D) Completely embedded brain sample should be trimmed of excessive agarose on the top dorsal side of the brain. Before beginning the crosslinking process with sodium borohydrate, the embedded sample block can be assessed for correct or incorrect alignment.\nMake sure the brain is not tilted in either of the caudal, rostral directions.\nAlign the brain so that when viewing from the back of the cerebellum, the brain is horizontally stabilized on the lanes.\nNote: For smaller brains of younger mice, use 2 instead of all 3 slats.\nCarefully place the metal mold (1″ × 1″ inside diameter) around the brain, such that the sides of the box are parallel to the midline of the brain (Figure 6[href=https://www.wicell.org#fig6]B).\nCritical: The bottom side of the metal mold should be near the spinal cord, but not touching the actual end of the spinal cord. Allow for additional space (1–2 cm) between the tip of the olfactory bulb region and the top side of the metal box for the oxidized agarose.",
    "Note: Once embedded, the side of the solidified oxidized agarose block closest to the olfactory bulb region will be glued to the flat surface of a glass slide to stabilize the vibratome cut during STP imaging (Figure 1[href=https://www.wicell.org#fig1]C).\nTake out one 50 mL vial of prepared 4% oxidized agarose solution in 0.05 M PB that was kept chilled at 4°C.\nMix the solution well by gently shaking and inverting the tube several times.\nNote: At chilled temperatures, oxidized agarose exists as a solid precipitate suspended in PB. It will not readily dissolve in the PB without heating, so it is important to mix the solution immediately before pouring into another container.\nTo embed one brain sample, pour at least 10 mL of well-mixed oxidized agarose solution into a 50 mL glass beaker.\nCritical: It is recommended to use 12–15 mL per sample because the water content in the oxidized agarose solution will evaporate during the heating and boiling processes.\nNote: It is possible to consecutively embed 2 brains (each in an individual sample agarose block). Simply pour approximately 25 mL of oxidized agarose upon mixing. However, embedding more than 2 samples requires a larger volume of oxidized agarose. We find that using volumes greater than 25–30 mL does not stay appropriately heated at the right temperature for the amount of time it takes to embed more than 2 brains at once.\nAt medium power, microwave the solution for about 10 s.\nRotate the beaker with solution in a circular motion to stir the oxidized agarose.\nMicrowave for another 10 s and rotate.\nNote: At this point, the agarose precipitate should start to dissolve.\nMicrowave for about 5–10 s more and rotate, being careful not to let the solution boil over the top of the beaker.",
    "Note: If the solution starts to boil, immediately pause the microwave heating process, and wait for the bubbling to settle.\nMicrowave the oxidized agarose for 2–4 s until completely dissolved.\nRepeat step 48 until there are no visible floating particles in the medium when rotating the beaker to stir the oxidized agarose.\nNote: The solution may boil during multiple rounds of heating in the microwave after a few seconds, but this is acceptable to completely dissolve any remaining particles.\nCritical: Overheating the oxidized agarose can cause an opposite issue, where bubbles or solids may form, and the solution can take on a yellow-tinted color. If this happens, the oxidized agarose is no longer usable and must be discarded as biohazardous waste upon cooling.\nNote: Microwave power may be variable depending on the microwave manufacturer and model. The heating times mentioned in steps 45–48 are an average from using different types of microwave appliances at medium power. Use discretion and keep note of observed details in the steps of this protocol.\nOnce the solution appears visibly clear, transfer the heated beaker from the microwave to a non-cold surface.\nEnsure the temperature of the medium reaches 80°C–85°C.\nNote: A surface that is cold to the touch will accelerate the cooling process and cause premature agarose solidification near the bottom of the beaker. To prevent this, use paper towels or a cotton absorbent pad to act as a buffer between the glass beaker and the benchtop.\nThen, allow the heated mixture to cool from 80°C–85°C to 65°C–70°C.\nWhile using a thermometer to measure the temperature of the solution, keep the tip submerged in the solution without touching the bottom of the beaker, as the temperature may be different.",
    "When ready to perform sample embedding, touch the spout of the beaker to the top of the metal mold side closest to the caudal (spinal cord) end of the brain.\nGently tip the beaker to pour in the melted oxidized agarose – slowly but steadily – and let the mixture slide down the side of the metal box to reach the bottom and slowly come up to envelop the brain (Figure 6[href=https://www.wicell.org#fig6]B).\nAvoid introducing air bubbles when pouring the agarose in the mold.\nThe metal embedding mold should be filled to the top edge.\nCritical: Do not pour directly on the brain. This may result in tissue scalding and irregular solid formation within the block of oxidized agarose. By gently pouring into the bottom first, this allows the agarose to surround the brain without introducing bubbles into the solution. Pouring too little agarose around the brain is also detrimental, leading to incomplete embedding.\nAllow the oxidized agarose in the embedding mold to completely solidify at 20°C–22°C for 15–20 min, but no longer than 1 h.\nNote: The embedding process is finished once the agarose block surrounding the brain sample is completely solidified and not warm to the touch.\nSlowly slide the metal mold out, leaving the agarose-embedded sample block behind on the embedding platform.\nTo prevent the sample block from lifting with the metal cubed mold, place a finger on the top of the agarose block, while using a different hand to gently slide and lift the metal mold off.\nCarefully lift the sample block off the slats of the embedding platform.\nTrim the side of the agarose block closest to the spinal cord and brain stem with a razor blade (Figures 6[href=https://www.wicell.org#fig6]C and 6D).",
    "Use a single cutting motion to trim the agarose with the razor blade, instead of cutting with a back-and-forth motion, as if using a serrated knife.\nCritical: Do not cut the side of the block closest to the olfactory bulbs because this side will be glued onto a glass slide for STPT imaging, which requires a perfectly even and flat surface.\nPlace the agarose-embedded brain into a 50 mL conical tube and add 20 mL of sodium borohydrate buffer to initiate crosslinking between the sample and oxidized agarose.\nCritical: The sample block should be completely submerged in solution, kept upright, and protected from light (i.e., by using an aluminum foil cover).\nSoak the embedded sample in buffer solution at 4°C for at least 12 h before using for STPT imaging.\nAlternatively, leave at 20°C–22°C for 2–4 h.\nNote: The cross-linking of oxidized agarose and brain tissue allows for greater tissue retention during sectioning. Once the cross-linking process is complete, the embedded brain sample can be used for STPT imaging.\nPause point: Embedded brain samples in sodium borohydrate solution can be kept at 4°C whilst shielded from light for 3 days. For example, if embedding occurs on a Friday before the weekend, this batch of embedded samples may be used for STPT imaging on the following Monday without running into any issues.\nNote: If a sample needs to be re-embedded due to misalignment or if the brain lifts from its original position in the oxidized agarose, do not place the embedded sample in sodium borohydrate buffer. Please refer to the Potential Solution to Problem 4 in the troubleshooting[href=https://www.wicell.org#troubleshooting] section for further instructions before proceeding to sample re-embedding.",
    "Note: The cross-linking reaction between the oxidized agarose and brain tissue reverses over time due to the naturally decreasing chemical strength of the sodium borohydrate solution. Therefore, it is recommended to replace the sodium borohohydrate solution in the vial containing the embedded sample block if it is to be used for imaging on the 4th or 5th day post-embedding. Make sure to use sodium borohydrate that is at least one day old from the day of preparation, but not if the solution has exceeded 5 days (refer to the section “preparation of 0.05 M sodium borohydrate buffer[href=https://www.wicell.org#sec1.4]” for greater detail). If an unexpected issue arises where one may need to re-embed a sample after placement in sodium borohydrate, simply replace the solution with 0.05 M PB and incubate for one day before re-embedding.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Whole mouse brain embedding in oxidized agarose for STPT imaging, related to steps 39–59 (Brain sample embedding section)",
    "This video guides you through the major steps necessary to effectively embed PFA-fixed and dissected mouse brains in oxidized agarose for STPT imaging. To describe these steps, the dissected brain is first placed on a metal embedding platform, which should be built with three parallel slats for the brain to rest on (00:00–00:06). Fingers or blunt tweezers should be used to align the brain with the parallel slats (please refer to Figure 5 of this protocol). Once the brain is aligned with the slats, a metal cube-shaped mold is placed around the brain and once again aligned straight (00:07–00:11). Then, a vial of prepared and chilled oxidized agarose was taken out of 4°C storage, shaken until all agarose particles were mixed well, and poured into a small glass beaker – enough for 1 or 2 embedded samples (00:12–00:15). The beaker of oxidized agarose was then heated in the microwave at intervals of 10 s and then 2 s for a total of 40 s, while being careful to not let the melted agarose boil over the edge of the beaker (00:16–00:19). If the melted oxidized agarose still contains floating particles, make sure to stir the mixture well by gently rotating the beaker and placing it back into the microwave for additional heating (00:19–00:26). As shown, the agarose solution should appear clear when ready and not be heated again (00:27–00:29). The temperature of the melted oxidized agarose must reach 80°C–90°C before letting it cool to 70°C (00:30–00:33). Once the mixture has reached 70°C, it is gently poured along the inside of the metal cubed mold such that the solution envelopes the brain sample without any introduction of bubbles (00:34–00:43).",
    "After the oxidized agarose has cooled and solidified, the mold is lifted upward to release the sample block and then the embedded sample itself is gently lifted off the platform using gloved hands (00:44–00:51). The final block should not be rectangular-shaped and have excessive amounts of agarose above the brain. Therefore, the block is trimmed with a razor blade, but only on the top side and never on the surface closest to the olfactory bulb area of the mouse brain (00:52–00:56). The sample embedding process is complete at this point and ready to be placed in sodium borohydrate solution prior to STPT imaging (00:57–01:00).",
    "Serial two-photon tomography (STPT) sample setup and image acquisition\nTiming: 1 h for sample setup, approximately 20 to 24 h for active image acquisition of an adult mouse brain (for steps 60 to 110)\nThis section outlines the setup procedure for whole brain image acquisition with STPT (TissueCyte 1000). For visualizing all cell types, excluding the cerebrovasculature, STPT imaging is conducted at 1 × 1 × 50 μm (x,y,z) resolution, with automated vibratome sectioning at every 50 μm (z). The imaging plane is set at 40 μm deep from the surface of the brain.\nPlease see “Methods video S2[href=https://www.wicell.org#mmc2]” and “Methods video S3[href=https://www.wicell.org#mmc3]” for visualization of brain sample set up, orientation, navigating the TissueCyte 1000 sample stage, and determining the correct imaging depth for STPT acquisition.\nCritical: Before any imaging takes place, make sure all fluorescent lights in the room where the STPT machine is located are turned off to protect the PMT detectors of the two-photon microscope system. Whenever entering the STPT imaging room, assume that active image acquisition is taking place if all lights are turned off. Check that no active image acquisition is occurring before turning on the lights.",
    "Note: The multiphoton, infrared laser of the STPT setup is a Class IV—High Power Laser and safety hazard, requiring appropriate precautions to prevent exposure to direct and reflected beams, all of which may cause severe eye damage. The TissueCyte 1000 is built with secured enclosures and shields for all beam paths, but it is important to take additional steps of precaution while operating the system (e.g., establishing a controlled access area for laser operation, limiting access to those trained in laser safety principles, minimally operating the laser given the requirements of the application, and etc.). Additionally, please research and conform to all individual institutional requirements regarding the use of high laser-powered systems before following this protocol.\nIf a previous imaging session was recently completed or no imaging is currently taking place and the laser photomultiplier tubes (PMTs) are still on, turn the PMTs off by clicking “Off” on the opened computer window.\nCritical: Make sure PMTs are off before turning on any lights in the imaging room.\nNote: If “PMTs ON” is indicated in green, then the PMTs are on. If “PMTs OFF” is indicated in red, then the PMTs are off.\nClose the laser’s shutter by physically clicking the “SHUTTER OPEN” button located on the laser machine (Coherent Inc.).\nNote: The green light on the “SHUTTER OPEN” button should turn off.\nClose all windows except for the Orchestrator program (TissueVision, Inc.) (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig7.jpg\nFigure 7. Display interface of TissueVision’s Orchestrator and Vivace software for TissueCyte 1000",
    "(A) The Services tab on this display is the first window users will see when opening the Orchestrator program. This software must be connected to the TissueCyte system by clicking the buttons “Connect All,” “Connect Client,” and “Reference Stage.” The microtome delay at the bottom left of the window is set to 1 s to allow time between stage movement and the start of sample sectioning.\n(B) The second Protocol tab is where you can save a new protocol or load a previous protocol with saved parameter settings. Under Mosaic Settings, the step size is set to 700 μm for both X and Y, but the number of steps (# Steps) will differ depending on the brain size (refer to Methods video S4[href=https://www.wicell.org#mmc4] for assistance with tile area calculation). Section thickness is normally set to 50 μm and the number of sections will also differ depending on brain size, but for adults it is usually 280 sections. The STPT-acquired images should be directed to a specific folder location with ample disc space and saved with an appropriate title.\n(C) The third Imaging tab is where the laser shutter and power settings are located, as well as the Stage Control and Z-Stage for moving the sample stage in X-, Y-, and Z-directions. If you perform a single click of the “Slice” button under the Microtome panel, the stage will move towards the vibratome blade and begin sectioning for a single round. The “3D” button above 3D Mosaic will begin image acquisition, so do not start until all settings have been confirmed to be correct.",
    "(D) The TissueVision Vivace window allows users to perform a “Single” image capture when the lasers and PMTs are on. The checkmark box next to Save Data is critical, as it should only be checked during imaging and not during any part of the setup process.\n(E) An example of the top of an image display screen (1 of 3) which should be set to manual operation with a minimum and maximum visual range of 0–6,000, respectively.\nIf the blue buffer chamber is still secured on the stage in the microscope (TissueCyte 1000), move the stage down before removing the chamber from the stage (Figure 8[href=https://www.wicell.org#fig8]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig8.jpg\nFigure 8. Setting up the STPT sample chamber and automated vibratome\n(A) STPT sample buffer chamber with an embedded brain sample already glued to a magnetic glass slide for imaging. It is helpful to use a ruler to align the posterior end of the brain so that it is straight.\n(B) Replacing the vibratome blade on the holder requires careful handling as the blade is sharp. Two small hex screws are used to securely fasten the holder around the blade.\n(C) After a fresh blade is put in the holder, the sample buffer chamber is filled with 0.05 M phosphate buffer and placed in the TissueCyte directly underneath the 20× objective lens and the vibratome.\n(D) During sectioning, the objective lens should be submerged in the buffer with no trace of bubbles and the blade should start vibrating a few centimeters away from the edge of the oxidized agarose sample block. It is important that the sectioning quality is consistent at 50 μm before image acquisition.",
    "Critical: Located under “Z-Stage” on the Orchestrator window (Figure 7[href=https://www.wicell.org#fig7]C), it is recommended to set the numeric value to 1,000 microns and click “Down” until you can safely remove the blue buffer chamber without scratching the objective lens. Use additional precaution when moving the stage up or down in the Z-direction, because there is no automatic stopping mechanism. Additionally, it is not possible to reverse the direction of a currently moving stage.\nOnce the stage is lowered and the sample buffer chamber is well-below the objective lens and the vibratome blade, close all open programs, including the Orchestrator and the Orchestrator Client.\nRestart computers to close/reset any potentially open programs that could interfere.\nWith gloves on, remove any used blades from the vibratome blade holder (Figure 8[href=https://www.wicell.org#fig8]B). Be careful not to touch the objective lens.\nUnscrew the two hexagonal screws (3/16 inch) on either side of the blade holder using a hexagonal screwdriver to release the blade.\nDiscard the used blade in a hazardous sharps waste bin.\nPlace a fresh new vibratome blade into the blade holder and tighten the screws (Figure 8[href=https://www.wicell.org#fig8]B).\nWith a screwdriver in hand, tighten the screws just enough such that the blade is firmly in place.\nNote: The screws do not have to be tightened with extreme strength, as this will only strip the inside socket of the screw at a faster rate.\nRemove the blue buffer chamber from the stage and discard any remaining 0.05 M PB and tissue/agarose sections using a fine mesh strainer over a sink.\nNote: Caught tissue sections should be discarded as hazardous waste.\nWash the buffer chamber with water 3–4 times.",
    "Remove the magnetic glass slide designed for imaging from the metal plate in the chamber and scrape off any agarose block leftovers or residue on the slide with a razor blade.\nCompletely dry the slide with a Kimwipe.\nTake a new sample (embedded brain in oxidized agarose block) out of sodium borohydrate buffer solution and pat the surfaces with a Kimwipe until dry.\nCritical: Before gluing the new sample onto the glass slide, keep in mind that brain sample orientation matters for consistent imaging and accurate data processing. To achieve coronal plane slicing, the side of the sample block closest to the brain’s olfactory bulbs should be glued face down onto the slide. The dorsal/superior part of the brain (cortex) should face towards the white frosted end of the glass slide.\nBrush an ample amount of super glue onto the slide and quickly set the dried sample block on top of the glued surface area according to the specified orientation in the Critical note of step 72 (refer to Figure 1[href=https://www.wicell.org#fig1]).\nUse additional glue to seal the edges of the sample block to the glass slide.\nLet the glue dry for at least 10 min.\nWhile the glue is drying, set up the computer program required for STPT imaging.\nRemove all gloves before setting up the computer.\nOn the computer desktop, open the “PMTs” program.\nSet the PMTs to specific voltages for Channels 1, 2, and 3 (usually 850 for all).\nMove the PMTs window to the top right corner, but do not turn the PMTs on yet.\nOpen the image acquisition program called “Orchestrator” (TissueVision) (Figure 7[href=https://www.wicell.org#fig7]).\nOpen a second associated program called “Orchestrator Client” (TissueVision).\nThe landing page should be the Services tab in the Orchestrator window (Figure 7[href=https://www.wicell.org#fig7]A).\nUnder the Initialization panel, click “Connect All.”",
    "The TissueVision Vivace imaging window should open (Figure 7[href=https://www.wicell.org#fig7]D). Move this imaging window to the bottom left for later.\nUnder the same Initialization panel on the Orchestrator window, select “Connect Client” (Figure 7[href=https://www.wicell.org#fig7]A).\nA pop-up window will be generated. Leave this on but do not click any of the buttons.\nUnder the same Initialization panel on Orchestrator, click “Reference Stage” while simultaneously observing physical stage movement in the X-Y direction.\nIf the stage does not move in one or either direction, close all programs and restart the computer before trying again.\nUnder the Microtome panel on the same page, change the “Delay Time” to 1 s.\nSelect the Protocol tab in the Orchestrator window (Figure 7[href=https://www.wicell.org#fig7]B).\nSet up the following parameters:\nThe Step Size should be X = 700 μm, Y = 700 μm.\nThe number of steps (# Steps) required for an adult mouse brain (P56+) should be X = 12, Y = 16, which is based on the tiled area in Figure 9[href=https://www.wicell.org#fig9]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig9.jpg\nFigure 9. Orientation and tiled area of STPT-imaged adult mouse brain\n(A) All three panels consist of STPT-captured and stitched images of a 50 μm-thick coronal section of an adult mouse brain with grid overlay. Each grid square represents a single 700 μm tile, which extends in both X- and Y-directions for calculating the size of the brain and setting the total tile area for image acquisition. From top to bottom: anterior portion of the brain with olfactory bulbs and prefrontal cortex; mid-coronal brain section with view of isocortical layers and subcortical regions; posterior portion of the brain with the cerebellum and brainstem.",
    "(B) The image display here shows the midline or center of the brainstem, as indicated by the magenta-colored arrow, with a part of the cerebellum at the bottom of the screen. This anatomical landmark is identified to familiarize users with the orientation of the 700 μm-sized tile currently being viewed. Users can point to this landmark as a reference while moving the stage during the sample setup process.\nThe Section Thickness should be set to 50 μm.\nThe number of sections (Num Sections) sufficient to capture the whole adult (P56) mouse brain is around 280.\nPlease see Methods video S4[href=https://www.wicell.org#mmc4] for visualization to assist with calculating the tiling area of the brain.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. STPT sample setup and vibratome sectioning, related to steps 83–86 (Serial two-photon tomography (STPT) sample setup and image acquisition)",
    "This video shows the major steps for setting up an embedded brain sample in the TissueCyte 1000 and the necessary steps for achieving consistent serial sectioning with the automated vibratome. To describe these steps, the embedded brain sample is first glued to a prepared magnetic glass slide, which is then placed inside a sample buffer chamber with a strong magnet (00:00–00:10). Then, 950 mL of 0.05 M phosphate buffer (PB) is poured into the sample buffer chamber, allowing the solution to rise around the glass slide with the glued embedded sample (00:11–00:20). Any bubbles formed underneath the glass slide near the magnet of the sample buffer chamber should be completely removed. The PB-filled sample chamber is then secured onto the moving stage of the TissueCyte 1000 and elevated until the surface of the embedded sample can be sliced by the vibratome at 200–300 μm (00:21–00:29). During the initial sectioning process, the spinal cord and brainstem, but not the cerebellum, should be evenly sliced (00:30–00:40). However, if the spinal cord and brainstem are of interest for STPT imaging, then a minimal cut through the spinal cord should work. The final goal is to achieve consistent vibratome sectioning of the embedded brain sample at 50 μm before starting image acquisition (00:41–00:55).\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Operating the STPT sample stage and determining brain imaging depth, related to steps 95–96 (Serial two-photon tomography (STPT) sample setup and image acquisition)",
    "This video helps in visualizing how to control the sample stage’s movement with TissueVision’s Orchestrator software and how to determine the correct imaging depth using the Piezo Amplifier. To move the sample stage in the X- or Y-direction, navigate to the Imaging tab of the Orchestrator window (refer to Figure 6C in this protocol) and the Stage Control panel which allows you to move the stage holding the sample buffer chamber (please refer to steps 95 and 96 for more elaboration on the instructions mentioned in this video). While PMTs are on and the laser shutter is open, you can capture a single image of the sample after moving the stage by clicking the “Single” button (00:00–00:16). It is then necessary to set the surface and imaging depths for image acquisition. As shown in the video, the surface of the brain should appear as imaging depth is gradually increased (00:17–00:27). Once the entire surface of the brain comes into view, the imaging depth in microns is recorded and an additional 40 μm is added to the surface depth for the final imaging depth (00:28–00:44). After image acquisition has begun, monitor the display to ensure that the entire brain section is being properly captured, with no parts of the brain being cut off from the objective’s view (00:45–00:57).\n    Your browser does not support HTML5 video.\n  \nMethods video S4. STPT-imaged coronal Z-stacks of whole adult mouse brain with tile grid, related to step 80a (Serial two-photon tomography (STPT) sample setup and image acquisition)",
    "This video recording (00:00–00:51) demonstrates a completely imaged whole adult mouse brain of a Parvalbumin-Cre mouse co-expressing conditional H2B-GFP reporter using STPT after computational stitching has been performed. Each square of the non-moving grid represents a single 700 μm tile, which spans in both X- and Y-directions for calculating the size of the brain. By using this superimposed grid on a stitched image of an adult mouse brain at varying 50 μm-thick coronal Z sections, you can count how many tiles it takes to cover the entire brain at its widest areas. Calculating the X- and Y-tiling parameters for the tile area setting in Orchestrator (TissueVision) is required for regular and vascular image acquisition (please see steps 81 and 109 of this protocol, respectively).\nUnder the Microtome panel, set the Sectioning Speed to 0.5 mm/s, Frequency to 60 Hz, Microtome Position X to 25 mm, Microtome Position Y to 0 mm, and Sample Length to 30 mm.\nOnce all parameters are set, select “Save Protocol” to load these settings for the next imaging session.\nClick the “Save Path” button under the Save Location panel.\nChoose the appropriate computer location path for the saved imaged data and create a new folder to store the imaged data.\nName the new folder with the designated identification name of the sample.\nExample of file name convention: Date(YYYY/MM/DD)_Initials of Experimenter_Sample ID_Sex_Age_Mouse Line_Experiment/Project_Other Specifics.\nAfter creating a new folder, copy only the sample ID into the “Sample ID” section under the Save Location panel.\nSelect “Update Settings” at the bottom of the page.\nUncheck the checkmark box for “Save Data” on the TissueVision Vivace imaging window (Figure 6[href=https://www.wicell.org#fig6]D). Leave this box unchecked until the end.\nClick the box labeled “Single” in the imaging window.",
    "Three windows will pop up: Channel 1 for excitation wavelengths greater than 560 nm (i.e., signals in the red spectrum such as tdTomato), Channel 2 for wavelengths between 500 nm and 560 nm (i.e., signals in the green spectrum such as GFP), and Channel 3 for wavelengths less than 500 nm (i.e., signals in the blue spectrum such as DAPI).\nFor all 3 channels, change the image display to Manual and set the minimum and maximum to 0 and 6,000, respectively (Figure 7[href=https://www.wicell.org#fig7]E).\nOn the Imaging tab in Orchestrator (Figure 7[href=https://www.wicell.org#fig7]C) under the Shutter panel:\nSelect Automatic from the dropdown box next to the “State” button and click on this button to confirm the choice.\nSet the second laser power (V2) to a specific power value, without changing the value of the first laser power (V1). Then, click the “Set Shutter Voltages” button.\nNote: The lower the power value, the higher the laser power (down to about 1.2, but not lower than that).\nPlace the glass slide with the embedded sample into the blue buffer chamber, while being mindful of the strong magnetic force, and align the slide so that the brain is straight (refer to Figure 1[href=https://www.wicell.org#fig1]B).\nNote: The brain sample, not necessarily the agarose block, should be straight. It is recommended to use a ruler, the physical landmarks of the brain, and the chamber itself as a straight-line reference (Figure 8[href=https://www.wicell.org#fig8]A).\nSlowly fill the blue buffer chamber with 950 mL of 0.05 M phosphate buffer.\nCheck for and remove any bubbles between the bottom of the glass slide and the magnet in the chamber.\nGently shake the chamber or lift and immediately put it down with slight force. Be careful not to spill and phosphate buffer from inside the chamber.",
    "Carefully slide the entire buffer chamber onto the stage in the STPT machine and tightly secure the chamber to the stage by using the red screw located on the left side of the stage.\nNote: From this step forward, gloves do not need to be worn since the remaining procedures for sample setup will be achieved by the computer program.\nNavigate to the Imaging tab in the Orchestrator window to initiate setup for sample sectioning and imaging (Figure 7[href=https://www.wicell.org#fig7]C).\nMove the stage up in 1,000 μm increments using the Z-Stage control until the top of the agarose block is approximately 2 cm away from the objective lens.\nAs the stage gets closer in proximity to the objective lens, move the stage in 300 μm increments to prevent the block from colliding with the lens.\nAs the objective lens becomes submerged in the phosphate buffer within the sample chamber, make sure there are no air bubbles collecting underneath the lens.\nIf bubbles happen to form, move the stage back down and then up again so that the objective lens is lifted out of the buffer before being submerged a second time.\nDuring this process, do not touch the objective lens.\nUnder the Stage Control panel, set the value to 700 μm instead of 1,000 μm and select the Forward button to move the stage in the forward direction (towards you, if you are facing the microscope) until the sample block closely aligned underneath the objective lens and within the width of the vibratome blade.\nIn the Z-Stage control, set the value to 300 μm, which should be the maximum sectioning depth until the brainstem of the sample is reached.",
    "Under the Microtome panel in the same window, click the “Slice” button when ready to perform a single cut with the automated vibratome.\nMove the stage up 200 μm and slice again, while ensuring the blade is appropriately cutting the section and that the whole surface of the sample block is being sectioned.\nRepeat step 86e until the slicing goes through the spinal cord. As you get closer to the cerebellum, move the stage up 100 μm and slice again. Try to avoid sectioning parts of the cerebellum, especially if this is a region-of-interest.\nOnce this point has been reached, change the Z-Stage control value to 50 μm.\nCut using the “Slice” button without moving the stage in the Z direction. Do not click the “Up” button.\nSince the section thickness is set to 50 μm, clicking the “Slice” button will automatically move the stage up 50 μm.\nSlice until the cutting is stabilized (approximately 2–4 cuts).\nReturn to the Protocol tab at the top of the Orchestrator window (Figure 7[href=https://www.wicell.org#fig7]B).\nSelect the “Update Settings” button.\nUncheck the box next to “Save Data” from the TissueVision Vivace imaging window (Figure 7[href=https://www.wicell.org#fig7]D).\nEnsure that no data is being saved during setup.\nIf the box next to “Save Data” is check marked during imaging setup, go to the location of the new sample folder created in steps 80d and 80e and delete any newly created files or subfolders within the new sample folder.\nClose the hood of the STPT machine (TissueCyte 1000).\nSecure all sides with Velcro strips.\nTurn off all the lights in the imaging room.\nLocate the black laser box (Coherent, Inc.).\nSet the wavelength to a specific value.\nUse the knob labeled “ADJUST” to choose the wavelength (nm). Typically, this is set to 910 nm.",
    "To confirm the wavelength choice, click the button under “MENU SELECT” and wait for the “Status: OK” reading to be visible on the digital screen.\nThen, press the “SHUTTER OPEN” button. A green light should turn on.\nCritical: It is crucial that no lights are turned on in the room.\nOn the PMTs control window, click “ON” to turn on the PMTs.\nMake sure the “Save Data” box is unchecked on the TissueVission Vivace window (Figure 7[href=https://www.wicell.org#fig7]D).\nClick on “Single” to capture an image.\nLook around the brainstem and find the center of the brain by locating its midline (Figure 9[href=https://www.wicell.org#fig9]B).\nLocate the Stage Control panel in the Imaging tab (Figure 7[href=https://www.wicell.org#fig7]C).\nMove the stage in X-Y directions by using the MoveRight, MoveLeft, Forward, and Backward buttons. The following stage movements are most easily understood by imagining that the experimenter is facing inward toward the sample chamber in the STPT machine.\nMoveRight – moves stage to the right; navigates upward on the screen.\nMoveLeft – moves stage to the left; navigates downward on the screen.\nBackward – moves the stage backward into the machine; navigates leftward on the screen.\nForward – moves the stage forward away from the machine; navigates rightward on the screen.\nDetermine the imaging depth by using the connected Piezo Amplifier/Servo Controller (PI LVPZT; E-665) to find the surface of the brain.\nChange the depth (μm) of the imaging plane using the DC-OFFSET knob on the right of the controller.\nStart with a shallower depth (i.e., 150 μm) and increase the depth in 5 μm increments until the surface of the brain appears and no parts of the brain appear dark.\nAfter finding the surface, perform one 50 μm slice and find the surface of the brain again as it may have changed.",
    "Then, add 40 μm to that value as the final depth. This is the depth at which imaging acquisition will take place.\nFind the center or midline of the brain stem/spinal cord (Figure 9[href=https://www.wicell.org#fig9]).\nKeeping in mind that each tile being imaged is 700 × 700 μm (X, Y), move the brain up the spinal cord on the screen using 700-μm steps (MoveRight button) such that the bottom of the spinal cord is shown (Figure 9[href=https://www.wicell.org#fig9]B).\nTurn PMTs “OFF” on the computer and click the “SHUTTER OPEN” button on the laser box to turn it off.\nOpen the hood of the STPT machine and carefully inspect the sample with a flashlight.\nDraw an imaginary line from the center of the objective lens down through the sample block.\nNote: The ventral side of the brain should be to the right of this line.\nConsider the current position of the sample stage as 1 step that will be tile-captured as an image.\nTake the total number of X-steps set for the sample, which is 12 for an adult brain, and subtract one step from your total number of X-steps (i.e., 11).\nMove the stage to the left by clicking MoveLeft 11 times.\nNote: The dorsal side of the brain (cortex) should be located to the left of the imaginary line drawn earlier.\nOnce satisfied with the positioning of the sample, move the stage to the right by clicking MoveRight 11 times to return to the original starting area (bottom of the spinal cord).\nClose the hood of the STPT machine and make sure all lights are turned off.\nTurn PMTs “ON” on the computer.\nClick the “SHUTTER OPEN” button on the laser box to turn it on.\nEnsure the entirety of the brain will be captured during image acquisition.",
    "Navigate to the left of the brain on the screen by clicking the Backward button at 700 μm steps.\nTo calculate the number of “Backward” steps required for full brain coverage, first recall the # of Y-steps set for the adult brain in step 80a (Y-step = 16 for P56 adult mouse).\nThe formula for determining the number of 700-μm steps to take is as follows:\n((# Y-steps) – 1) / 2.\nTherefore, if you decide to use 16 Y-steps, the resulting value will be 7.5 steps. As each Y-step is 700 μm, 0.5 steps are equal to 350 μm (700 divided by 2).\nOn the Orchestrator window, return to the Protocol tab and “Update Settings.”\nThis time, checkmark the box next to “Save Data” on the TissueVission Vivace window (Figure 7[href=https://www.wicell.org#fig7]D).\nCritical: This is an important step because if this box is unchecked during imaging, none of the captured images will be saved to the created sample folder.\nOnce you are ready to start imaging, double-check all the parameters and settings on the Orchestrator program window, the laser box, and the Piezo Amplifier.\nMake sure that all lights are turned off.\nNavigate to the Imaging tab (Figure 7[href=https://www.wicell.org#fig7]C) and select the “3D Mosaic” button to begin image acquisition.\nWait for a few minutes to see whether all the images collected for the first two z sections contain images of the brain on the display.\nNote: The edges of the spinal cord/brainstem should come into view if the block was positioned correctly. For an adult P56 mouse brain with X-Y-Z tiling set at 12-16-280, total imaging time may range between 20 and 24 h.\nBefore letting the STPT system continue with automated image acquisition, check the created sample folder for saved image files from the image acquisition process.",
    "Note: Once STPT image acquisition is complete, the Orchestrator’s terminal will state “Finished 3D Mosaic.”\nFor the takedown procedure, proceed by repeating steps 60 through 71 to properly turn off the laser PMTs, remove the sample buffer chamber from the STPT machine, and close all software.\nVascular image acquisition using STPT\nTiming: 3–5 days (for steps 111 to 114)\nThis section outlines the procedure for vascular image acquisition with STPT (TissueCyte 1000). The initial setup is the same as regular sample image acquisition; therefore, the initial steps refer to previous sections of this protocol. However, for vascular imaging, optical imaging (5 μm z step, 10 steps to cover 50 μm in z) is used, producing 1 × 1 × 5 μm (x,y,z) resolution beginning at 20 μm deep from the surface of the brain. This results in an extended amount of time required for whole brain vascular image acquisition. To reduce overall imaging time, an individual brain sample may be imaged through multiple imaging runs according to brain region by adjusting the tile area size (step 114).\nFollow the same procedure in the brain sample embedding[href=https://www.wicell.org#sec3.3] section to embed the brain in oxidized agarose. Please see “Methods video S1[href=https://www.wicell.org#mmc1]” for visualization of the embedding procedure.\nNote: Prior to vascular imaging, the brain sample is embedded in oxidized agarose and cross-linked in 0.05 M sodium borohydrate buffer at 4°C for at least 2 days ahead of STPT imaging.\nFor the first part of imaging setup, follow steps 60–79 in the serial two-photon tomography (STPT) sample setup and image acquisition[href=https://www.wicell.org#sec3.4] section. Please see “Methods video S2[href=https://www.wicell.org#mmc2]” for visualization.\nSetup the Orchestrator for vascular imaging.\nGenerate a protocol with the following settings in the “Scan-settings” under “Z-Scan settings” in Orchestrator (see Figure 7[href=https://www.wicell.org#fig7]B).\nFor ‘Planes,’ enter 10.",
    "For ‘Resolution,’ enter 2.5 Microns. This setting will take 10 optical sectioning images with 5 μm z step size.\nFor ‘Wait time,’ enter 0.\nFor ‘Z position,’ enter 0.\nFor ‘Z Default,’ click the box for ‘Z illumination’ and enter the pathname to a CSV file. This file should be named to reflect the shutter voltage power change such as “2_PowerChange_Optical_Settings.csv.”\nNote: To obtain 5 μm z-resolution, the shutter voltage power range ramps up from 1.6 - 1.2 while scanning to deeper tissues. These parameters may be modified, but this is an automated voltage power change function.\nEnter the path for this folder and click on ‘Set path.’\nBelow is the information that should be present in the protocol set up.\n<Zplanes>10</Zplanes>\n<ZResolution>2.5</ZResolution>\n  <ZWaitTime>0</ZWaitTime>\n  <ZPosition>0</ZPosition>\n  <ZScan>1</ZScan>\n  <ZDefaultVoltage>0</ZDefaultVoltage>\n  <ZScanDirection>1</ZScanDirection>\n<ZIlluminationProfilePath>C:\\TissueVision\\Protocols\\2_PowerChange_PDGFRb-Ai14.csv</ZIlluminationProfilePath>\n  <UseZIlluminationCorrection>true</UseZIlluminationCorrection>\n  <LaserPower>50</LaserPower>\n  <Wavelength>800</Wavelength>\n  <ShutterComPort>COM8</ShutterComPort>\n  <ShutterState>Automatic</ShutterState>\n  <ShutterV1>20</ShutterV1>\n  <ShutterV2>1.6</ShutterV2>\nSetup the Orchestrator for multiple optical imaging runs.\nAdjust the protocol settings for vascular imaging (see Figure 9[href=https://www.wicell.org#fig9]A):\nFor Run 1, i.e., imaging of the cerebellum, set the X-Y tile area settings to 10 × 14 (x, y) and Z range to around 50.\nFor Run 2, i.e., the majority of imaging the cortex, set the X-Y tile area settings to 11 × 16 (x, y) and Z range between 180–200.\nFinally, for Run 3, which involves imaging the olfactory cortex, set the X-Y tile area to 6 × 8 (x, y) and Z range to around 50.\nNote: The tile area size may need to be adjusted/increased if Run 2 is stopped (i.e., while prefrontal cortex is still present).\nIn addition to Figure 9[href=https://www.wicell.org#fig9]A, please see “Methods video S4[href=https://www.wicell.org#mmc4]” for visualization to assist with calculating the tiling area of the brain.\nSTPT image processing and reconstruction",
    "Timing: Varies depending on size of image files, but approximately 2 h for adult mouse brain (for steps 115 to 120)\nThis section outlines the necessary steps and MATLAB code for STPT image processing, which involves stitching individual images together to reconstruct the imaged coronal sections of the mouse brain. Once all images are stitched for a particular brain, they can be used for whole-brain cell type analysis. For non-optical STPT stitching, the code can be executed on a computer of at least 12 CPU cores while optical stitching does require additional computing power and runs best on a computer with at least 20 cores. Relevant codes can be downloaded from https://github.com/yongsookimlab/TracibleTissueCyteStitching[href=https://github.com/yongsookimlab/TracibleTissueCyteStitching].\n(All MATLAB associated codes were developed and executed on 2019b academic institutional license for MATLAB and Simulink provided through Pennsylvania State University. However, we have not come across version dependencies with MATLAB).\nOnce STPT image acquisition is complete for a brain sample, stitch together the captured tiled images by using the MATLAB-based image processing and reconstruction algorithm called “TracibleTissueCyteStitching.”\nThis image stitching algorithm will use the following meta data information from the raw imaged data (found in ‘readMosaic.m’):\n‘Sample ID’.\n‘rows’.\n‘columns’.\n‘mrows’.\n‘mcolumns’.\n‘channels’.\n‘layers’.\n‘sections’.\n‘sectionres’.\nBefore starting, make sure there is enough disk storage in the local computer’s working or temporary drive to make sure there is enough room for the output files.\nNote: At least 500 GB of space must be available per adult brain sample imaging data for non-optical stitching.\nIn your working directory, create a new folder.\nName this folder with the sample ID of the imaged data to be stitched.\nOpen a new window in MATLAB.\nWithin the Current Folder sidebar, locate the code folder named “20191106_YTW_pipeline_non_optical_V2” which should be saved on the local computer.",
    "Double-click on this folder or select “Add to Path” to change to this current folder.\nOpen the MATLAB script named ‘all_in_one_hub_grid_nov.m’ in the Editor window.\nFor the following panel settings, inputting “1” means to turn on the code for the indicated function. “0” means to turn off this function during the code run. all_in_one_hub_grid_nov.m.\n5 > DownloadRenaming = 1;\n6 > Averaging = 1;\n7 > Normalization = 1 8 > GenerateGrid = 1;\n9 > Batch_stitching = 1;\n10 > Shrinking = 1;\n11 > rotate_images = 1;\n12 > lossless_compression = 1;\n13 > Uploading = 0;\nFor all functions except for “Uploading,” set to “1” to generate the appropriate output files.\n16 > Number_of_cores = 30\n17 > Case_Name = ‘20220704_JL_JL0123_F_P56_GAD2-Cre-Ai14C-20’\n18 > boost = 500;\nDepending on the number of processing cores of the computer, set the “Number_of_cores” for usage by the program (Line 16).\nAdjust the “Case_Name” (Line 17) to the specific sample folder name.\nSet the “boost” to 500 for setting average image intensity during normalization.\nDuring image normalization, the called ‘xy_ilumination_v2.m’ function should have a “boost_ratio” set to 500.0, which is applied to imaged data from all channels. xy_ilumination_v2.m.\n4 > boost_ratio = 500.0;\n> ...\n16 > imageData = imread(image);\n17 > processedData = double(imageData) ./ double(templateData).∗ boost_ratio;\nOnce all code parameters are set, click “Run” in MATLAB.\nFor the source/input folder, direct the program to the folder containing the saved raw image files from STPT image acquisition.\nFor the temporary working/output folder, direct the program to the new folder created for the sample output files.\nLet the script run until it finishes.\nNote: This may take approximately 2–3 h.",
    "After the stitching code run is complete, check the output files containing both “warped” (stacks of down sized images) and stitched images for any misalignment or stitching issues.\nWithin the “warping” folder, locate the three image stacks (Tag Image Format or TIF files) of down sized images by a factor of 20 (resolution 20 μm × 20 μm in each image).\nThe “warped” files are labeled with either “ch1,” “ch2,” or “ch3,” reflecting each individual channel or range of excited wavelengths captured.\nFor the complete stitched images, locate the three output folders, one for each acquired channel.\nIn each folder, the number of stitched images (TIF files) should match the number of Z sections obtained during STPT image acquisition (around 280 for an adult mouse brain with 50 μm serial sectioning).\nComplete the following steps for vascular image stitching.\nOpen MATLAB and change the current folder to ‘pipeline_optical_multi_run’ code folder.\nOpen code titled ‘multi_run_hub.m’.\nAdjust the number of iterations according to the number of imaging sessions executed to completely image the full brain (if full brain = 3), the number of cores to run (min of 8 required) and remaining options to 1.\nNote: If the entire brain was imaged in 1 imaging session with the same X-Y tile settings throughout, this step is not necessary.\nClick “Run”.\nNote: MATLAB should open a pop-up window to specify the input folder for each run, followed by an output folder.\nCritical: The output folder must be located within a local drive and contain >3 TB of space available.\nComputational analysis: Cell counting using STPT-imaged data\nTiming: 1 week-1 month (for step 121 to 126)",
    "The steps of this portion of the protocol pertain to building a cell type mapping pipeline using STPT imaging data and a deep learning neuronal network (DLNN)) for neuronal and/or non-neuronal cell types. The below protocol pertains to a per-cell multi-resolution-hybrid ResNet classification method for cell type mapping.1[href=https://www.wicell.org#bib1] There are two main steps to this pipeline, namely generating training datasets for cell type detection and applying it in the pipeline to map target cell density in a reference brain using image registration. In order to generate training datasets, stitched image datasets (images are normalized during stitching) are first processed by “001_Create_Training_Set” which generates a .mat file that contains cropped potential cell locations according to regional maximum signal and the cell size denoted in the code (our setting is 6). Please see “Methods video S5[href=https://www.wicell.org#mmc5]”. After annotating the training datasets using the GUI, the next step is to train the artificial intelligence (AI) using the training network. We tested and built our pipeline using a workstation computer with 32 CPU cores and NVIDIA Quadro P5000 GPU with more than 60 GB RAM. For further information regarding how this pipeline was built, please reference our article by Wu et al.1[href=https://www.wicell.org#bib1] When applying the DLNN using the calling module, this can be done locally or executed on a high-performance computing (HPC) environment. The appropriate codes are labeled in accordance with the steps below. Relevant codes can be downloaded from https://github.com/yongsookimlab/Multi_resolution_DLNN_Cell_Counting[href=https://github.com/yongsookimlab/Multi_resolution_DLNN_Cell_Counting]. Relevant version information can be found in the “README” file within the overall code folder.\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Preparation of human annotated DLNN training datasets for cell counting, related to steps 121–126 (Computational Analysis: Cell counting using STPT-imaged data)",
    "This video recording (00:00–00:57) provides a step-by-step view of how to run steps 1–3 of the cell counting pipeline to supplement the instructions starting with Line 116.\nFull resolution STPT datasets can be downloaded from the Brain Image Library to test the code: https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/[href=https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/].\nFor example, the following folder link contains a STPT dataset from a male, postnatal day 61 mouse (nNOS-CreER;Ai14) at 1 × 1 μm (x,y) with 50 μm z interval: https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/20190612_UC_U380_nNosAi14_M_p61_nov2stitch/[href=https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/20190612_UC_U380_nNosAi14_M_p61_nov2stitch/].\nWithin this folder, subfolder “stitchedImage_ch1” is for tdTomato signal (red channel), “stitchedImage_ch2” is for background signal (green channel), and “stitchedImage_ch3” is for another background signal (blue channel).\nNote: This pipeline is designed to utilize data oriented in STPT format which is typically: x (image top to down) = dorsal to ventral, y (image left to right) = left to right, and z (image stack direction) = posterior to anterior. The resolution this DLNN pipeline will accept is 1 × 1 μm (X,Y) with 50 μm z-spacing.\nCreate the training datasets with local maximum detection: “001_Create_Training_Set”.\nFor setting up the code, open the ‘make_training_set_redo_mod.m’ file in a local drive. This is the user input file that calls 3 functions to generate training datasets (‘disk mask.’, ‘FullDiskMask.m’, and ‘pre_AI_per_image_redo.m’).\nSet the root directory as the main folder where datasets are located, if processing multiple datasets at one time. Alternatively, label with the individual sample datasets that will be used to generate the training datasets.\nSet the “data_set” as the datasets that will be processed.\nNote: Running this code generates all potential cell locations that serve as the input for the next step in this pipeline. Note that the training datasets will be named according to “data_set” information and will be saved to the “001_Create_Training_Set” folder.\nmake_training_set_redo_mod.m.\n3 > root_directory = ‘Z:\\Yongsoo_Kim_Lab\\STP_processed\\2020’;\n4 > data_set = ‘20191119_UC_U458_nNOSAi14_F__p57’;",
    "5 > ‘20191031_UC_U436_nNOSAi14_F_p68’;\n6 >\n7 > threshold = 1250\nAfter image tile stitching, normalize the data. This can be done through use of the “FullDiskMask.m” code included within this pipeline.\nUtilize the main MATLAB script titled ‘make_training_set_redo_mod.m’ which is a function that is automatically called through ‘pre_AI_per_image_redo.m’ and subsequently ‘FullDiskMask.m’.\nNote: This code is essentially generating a mask of the data primarily through the ‘cell’ function in MATLAB and the defined cell size. This allows for appropriate normalization of the background.\npre_AI_per_image_redo.m.\n1 > function[xxx,yyy]=pre_AI_per_image_redo(A,threshold)\n2 >\n3 > cell_size_r= 6;\n4 >\n5 > mask=FullDiskMask(cell_size_r.∗cell_size_r);\n6 >\n7 > BW= imregionalmax (A);\n8 >\n9 >\n10 > cross_center= ceil((cell_size_r.∗2+1).∗(cell_size_r.∗2+1)./2);\n11 >\n12 > local_max_list = find(BW);\n13 >\nNext, place a threshold on the data through finding the local maximum within a radius of 6–8 μm, depending on the size of the defined cell of interest.\nThis value for cell size can be altered by adjusting the number associated with “cell_size_r= __” (i.e., cell_size_r = 8).\nThe remaining code in ‘pre_AI_per_image_redo.m’ helps to execute this task.\nNote: For our STPT data, the 1250 threshold setting was most appropriate, however, this may need optimization for other data sources and imaging equipment.\nFinally, resize the images containing the local maximum threshold values to generate training data sets that contain target values (the locations of potential cell locations; ‘local_max_list’ in line 12), through the subsequent steps in ‘make_training_set_redo_mod.m’.",
    "Note: The image surrounding potential cell locations in two resolutions, including 101 × 101 μm and 501 × 501 μm, will be utilized for generating training datasets and will be later inserted into the network for training the AI. Providing two resolutions allows for the network to obtain characteristics from each zoom level simultaneously and allows further context resulting in more accurate counting.\nUse annotation to create ground truth datasets using the GUI folder: “002_Annotation_GUI”.\nFor supervised generation of training datasets, use at least one human annotator to provide input.\nOpen ‘training_GUI_v2.m’.\nDefine the annotator name (if more than one annotator is utilized) under username {1} (Line 4) of training_GUI_v2.\nRun ‘training_GUI_v2.m’.\nNote: The code will open a window to select the appropriate training dataset to begin with. Keep in mind training datasets are saved to the “001_Create_Training_Set” folder. It is easiest to move the training datasets in this “002_Annotation_GUI” folder with the MATLAB files.\ntraining_GUI_v2.m.\n2 > clear\n3 >\n4 > username{1} = ‘HCB’;\n5 > [file,path] = uigetfile;\n6 > [∼,name,∼] = fileparts(file);\n7 > name = [date, ‘_’, username{1}, ‘_’, name, ‘.mat’ ];\n8 > load([path,file]);\nUse appropriate classification for the cell of interest and everything else (labeled “trash” in the cell type label 3).\nNote: For pericyte counting, we use 2 classifications: “pericyte” labeled as cell type 1, and everything else/trash labeled as cell type 2. For neuronal nitric oxide synthase (nNOS) neurons, we included an additional subtype to differentiate the gray and white matter distributed neuronal populations. This can be adjusted and labeled in Line 10 of ‘training_GUI_v2.m’.\ntraining_GUI_v2.m.\n8 > load([path,file]);\n9 >\n10 > cell_type = {‘Neuron(GM) (1)’; ‘Neuron(WM) (2)’; ‘Trash (3)’};",
    "Note: The GUI will pop up through the function file ‘plot_three_window’. This will present a high-resolution image of the cell and surrounding background at 101 × 101 μm. The GUI in its current set up will also show a slightly zoomed out image, 501 × 501 μm, to provide additional context clues regarding the cell position. Finally, a third window can be used to provide the image of the entire tissue z-slice, to obtain anatomical information regarding cell position within the brain. This is helpful for cell types that are confined to certain anatomical regions or if there is a higher intensity signal outside of the confines of the brain.\nFollow these tips for annotation:\nWhen classifying cells, complete and save a training set in one session.\nTo stop and pick back up where the annotator left off, make sure to click save within the GUI before closing the window; otherwise, annotations may not be saved.\nWhen first annotating, set ii = 1 in Line 13 of the ‘training_GUI_v2.m’ code.\nClick “save” in the GUI.\nNote: The annotator can stop the current session and pick back up where they left off by defining ii = # of the last cell classified+1.\ntraining_GUI_v2.m.\n13 > ii = 1;\n14 > if ∼exist(“yes_no_answers”)\n15 > yes_no_answers = zeros(length(training_set),1);\n16 > end\n17 > s.figure = figure(‘MenuBar’, ‘none’, ‘Name’, ‘Gui01’, ‘NumberTitle’,‘off’, ‘Position’, [20,100,1500,500]);\n18 >\n19 > plot_three_window(training_set(ii));\nRepeat the steps above for the remaining training datasets.\nGenerate H5 files for tensorflow.\nNote: Using the annotated training datasets, this step performs ‘data augmentation’ by appropriately rotating each “cell,” therefore creating additional training data. This process allows the neural network to incorporate/see more views of each training input, thereby expanding the effectiveness of training.\nUtilize the ‘mat2spyder_v4_red_dot_rotate.’",
    "Set the file names to each annotated training dataset.\n“file_names =” should have information for the .mat file generated in “001_Create_Training_Set.”\n“ans_names=” should contain the .mat training dataset generated in “002_Annotation_GUI.”\nTrain the deep learning neural network (DLNN) using tensorflow and associated packages in Python.\nUse Anaconda Navigator to set up an environment (e.g., ‘tensorflow_env’) where all the required python packages will be installed.\nRun python code ‘v5_renet_red_dot.py’ in the ‘tensorflow_env.’\nSet up ‘tensorflow_env’:\nVisit Anaconda’s website (https://www.anaconda.com/[href=https://www.anaconda.com/]), download Anaconda Navigator, and install it.\nStart Anaconda Navigator and select ‘Environments’ (Figure 11[href=https://www.wicell.org#fig11]A; box 1).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig11.jpg\nFigure 11. Detailed instructions for tensorflow set up in order to train the DLNN\n(A) Shows how to generate a new environment using Anaconda navigator. Step one is to click “Environments” and then click “Create” (step 2). Next name the environment (step 3) and click “Create” (step 4). The example provided shows the environment named as “tensorflow_env”, but this can be user defined. Next select the pull-down menu, shown as “Installed” by default (step 5).\n(B) Shows the steps necessary for installing tensor flow within the new environment. Step 6 select “uninstalled” from the pull-down menu from step 5. On the right side of the window search for tensorflow in the search bar (step 7). Next click on the box shown for tensorflow from available packages in step 8. Note that there will be other packages with tensorflow included in the name. Finally click “Apply” to install the package in step 9.\n(C) Shows how to ensure CMD Prompt is also installed under the environment. Step 10 select home and then click “install” located underneath the icon for CMD Prompt in Stell 11.",
    "(D) Shows the final steps for preparing to train the DLNN using tensorflow and the python script detailed within the main text. Next to all applications, select the environment created in earlier steps, in this case “tensorflow_env” and click “Launch” under the CMD Prompt icon. This will open the CMD Prompt under the active environment. Navigate to the appropriate training folder in step 12. Type ‘python v5_renet_red_dot.py’ in step 13 and hit the ‘Enter’ key. For (A–D), all individual steps outlined by boxes in red, are also referred to within the main text.\nClick the ‘create’ button (Figure 11[href=https://www.wicell.org#fig11]A; box 2).\nName a new environment (e.g., tensorflow_env; Figure 11[href=https://www.wicell.org#fig11]A; box 3), select a Python version (e.g., 3.8.13), and click ‘create’ (Figure 11[href=https://www.wicell.org#fig11]A; box 4). Basic packages will be installed.\nClick the ‘Install’ pulldown menu (Figure 11[href=https://www.wicell.org#fig11]; box 5) and select ‘uninstalled’ (Figure 11[href=https://www.wicell.org#fig11]B; box 6).\nType ‘tensorflow’ on the upper right search bar (Figure 11[href=https://www.wicell.org#fig11]B; box 7). Several packages will show up.\nClick on ‘tensorflow’ (Figure 11[href=https://www.wicell.org#fig11]B; box 8) and click ‘Apply’ (Figure 11[href=https://www.wicell.org#fig11]B; box 9). This will install tensorflow and its dependent packages. Now ‘tensorflow_env’ environment is ready.\nClick ‘Home’ (Figure 11[href=https://www.wicell.org#fig11]C; box 10) and install ‘CMD.exe Prompt’ (Figure 11[href=https://www.wicell.org#fig11]C; box 11).\nRun “v5_renet_red_dot.py”:\nStart Anaconda Navigator, if not started.\nSelect ‘tensor_flow’ environment (Figure 10[href=https://www.wicell.org#fig10]D; box 12) and launch ‘CMD.exe Prompt’ (Figure 10[href=https://www.wicell.org#fig10]D; box 13).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig10.jpg\nFigure 10. Example of applying DLNN-based cell counting method to nNOS+ neurons captured by STPT imaging of whole mouse brains",
    "(A) The DLNN-based counting method GUI that annotators will see when utilizing this pipeline. The first window shows the close-up view of the potential cell at the center of the image and only consists of the cell associated with the red crosshairs. The next image to the right shows the zoomed-out context of the potential cell location. Finally, the third image depicts the coronal tissue section to provide anatomical information as well as prevent inclusion of information “outside” the brain.\n(B) Shows the raw image of the coronal section of interest for the “AI result” code. In this case shown is a slice of the cerebellum.\n(C) Shows an overlay of the AI result on the slice shown in (B). The red and green crosses reveal cell locations of two different cell types in the cerebellum. Cell type 3 or trash/not a cell is not depicted for simplicity but can be incorporated to catch false negatives.\nNote: You will see ‘(tensorflow_env)’ in the CMD, which means that ‘tensorflow_env’ was activated and the code will be run under ‘tensorflow_env.’\nNavigate to the folder (Figure 10[href=https://www.wicell.org#fig10]D; box 12). Also, move (or copy) the h5 file that was generated in step 118 to the folder, ‘/004_Tensor_flow_training’.\nType ‘python v5_renet_red_dot.py’ (Figure 10[href=https://www.wicell.org#fig10]D; box 13) and hit the ‘Enter’ key.\nNote: The network will now be trained on 90% of the trained data while 10% will remain unseen for testing the accuracy of the AI.\nRun the AI cell counting script:\nUse the ‘calling_module.m’ script by running it on a local computer drive per sample.\nFollow these steps to use the ‘calling_module.m’ file:\nSet the “call_module_deep_learning_cell_typing” and “call_module_register_and_output” = 1. This will run both the AI application and registration of the brain sample using Elastix.",
    "Before running ‘call_module.m’, alter the name of the dataset on Line 34, as this will title output files, including the ‘cell_count.csv’ output, with the appropriate data name. calling_module.m.\n34 > data_name = ‘20200723_HB_HB203_Pdgfrb-Ai14-5xFAD_M_MUT_p117’;\n35 >\n36 > file_list = dir(‘elastix_temp/cell_count_∗’)\nIf running on the HPC, maintain the “folder_name=pwd”. Otherwise, change the name of the folder to the sample folder being utilized.\nSet “module_deep_learning_cell_typing” to a folder that contains the .h5 trained ResNet network.\nSet “module_register_and_output” to “20200916_register_and_output_allen_correction_2017_2020_v4”.\nNote: This folder contains the necessary components to fully register the entire sample brain to the Allen Common Coordinate Framework at 20 × 20 × 50 μm (x,y,z) resolution using Elastix. Pre-defined registration parameter files (Par0000affine.txt and Par0000bspline.txt) are included in the code. Registration results and mapping results are stored in the “elestix_temp” folder.\nIn in the “elestix_temp” folder, locate the cell density information, which is stored in the ‘∗_cell_count_out.csv’ file. Cell counting per voxel is saved as ‘∗_cell_count_type_1.tif’ and gaussian blurred cell counting per voxel as ‘∗_cell_count_type_ visual_1.tif’ for type 1 cell detection (e.g., pericyte).\nValidate the AI performance through visualization.\nTo manually check the AI’s performance on full brain cell counting, check the voxel file and the AI result.\nTo check the whole brain:\nOpen the voxel file, titled ‘(sample name) _cell_count_type_visual_1.nii’ to scan through the stack.\nFor detailed inspection by slice and ROI:\nRun the ‘PLoting_AI_result_w_GUI.m’ file.\nDefine the input sample data folder by directing to the ‘/deep_learning’ folder within the sample folder.\nAdditionally, define the appropriate threshold, as well as the z section(s) of interest, by incorporating the following code.\nPLoting_AI_result_w_GUI.m.\n12 > load(data_file_deep_learning);\n13 > PLoting_AI_result_w_GUI\n14 > threshhold = 1250;\n34 > for jj= [47] % z slice number. For multiple z,separate with commas\n35 > PLoting_AI_result_w_GUI\n36 > end",
    "Note: Markers for the different cell types can be altered by adjusting the color code and symbol between Lines 34–36.\nPLoting_AI_result_w_GUI.m.\n34 > plot(xxx(predictions_max == 0),yyy(predictions)max ==0), ‘r+’);\n35 > plot(xxx(predictions_max == 1),yyy(predictions)max ==1), ‘g+’);\n36 > plot(xxx(predictions_max == 2),yyy(predictions)max ==2), ‘b+’);\nComputational analysis: STPT vascular tracing pipeline\nTiming: 1 week on HPC, timing locally depends on the computing power of the workstation used (a >20 core machine is recommended) (for steps 127 to 132)\nThe steps of the following pipeline are designed to trace the vasculature of STPT imaging data imaged according to the vascular imaging protocol above. The following generalized steps for this pipeline include binarization, skeletonization and radii measurements.1[href=https://www.wicell.org#bib1] First, autofluorescence is removed by subtracting the background channel (red in this case) from the signal channel (green). Next, voxel binarization involves identifying the vascular signal from background by passing a preset threshold. Either the voxel is above 6× the non-empty space average or it is first passed through a circular 35% local ranking filter and then passes the threshold of 2.4× the non-empty space. Skeletonization of the binarized image uses the 26-neighbor rule.8[href=https://www.wicell.org#bib8] Additional steps include quality control to correct inappropriate disconnections as well as prune nonbiological “furs.” The radii of the vasculature is calculated from both the binarized and skeletonized images. For further information regarding how this pipeline was built, please reference the article by Wu et al.1[href=https://www.wicell.org#bib1] The appropriate codes are labeled in accordance with the steps below and relevant codes can be downloaded from https://github.com/yongsookimlab/MiceBrainVasculatureTracer[href=https://github.com/yongsookimlab/MiceBrainVasculatureTracer].\nFull resolution STPT datasets can be downloaded to test the code from the Brain Image Library: https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/[href=https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/].\nFor example, the following link contains STPT dataset from a male, postnatal day 67 mouse (C57BL/6J) with FITC-filled vascular signal at 1 × 1 μm (x,y) with 5 μm z interval: https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/20191212_UC_U504_C57J_FITC-fill_M_p67_optical/[href=https://download.brainimagelibrary.org/82/0a/820aec4a2b25b348/20191212_UC_U504_C57J_FITC-fill_M_p67_optical/].",
    "Within this folder, subfolder “ch1” is for the background signal (red channel), “ch2” is for the FITC vessel signal (green channel), and “ch3” is for another background signal (blue channel).\nNote: Before inputting any data into the binarization code, which is the initial step of the vascular tracing code, the data must first be stitched and normalized. A representative example of vessel tracing results is shown in Figure 12[href=https://www.wicell.org#fig12]. If using the stitching code provided in this protocol, the normalization will be included during that step.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2373-Fig12.jpg\nFigure 12. Representative example of vessel tracing steps\n(A) Shows one z slice of the stitched data.\n(B) Shows a 25z (125 μm) maximum intensity projection of the stitched data. While this is not a step in the pipeline, it is included to provide context for the binarization and skeletonized images.\n(C) In magenta is the result of the binarization of the image shown in (B), overlayed with the stitched data.\n(D) Shows the vessel tracing result in green. For each image shown in (A–D), a high-resolution view is also provided and the cropped region is shown by the white box in each panel.\nBinarize the data using the first script in the folder: ‘Binarization_22.m’.\nNote: This step also includes background subtraction utilizing the ‘strel’ function and appropriately determined background size. A representative example of the binarization result can be found in Figure 12[href=https://www.wicell.org#fig12]C.\nIf performing binarization locally, adjust the general settings beginning at Line 45.\nMake sure to set the input and output folders accordingly.\nBinarization_22.m.\n59 > dir_in = pwd\n60 > dir_out = pwd, ‘/binarized’];\n61 >\n62 > DirTif = dir([dir_in ‘/ch1/∗.tif’]);\n63 > CropPoint = [1,1,10];\n64 > InterpolationLevel= 5.0;\nAfter binarization, skeletonize the data using the second step: ‘Skeletonize_all_rework_22.m’.",
    "If performing skeletonization locally, use the general settings which begin on Line 18.\nReplace “pwd” with the desired dataset location. An example of the tracing result is shown in Figure 12[href=https://www.wicell.org#fig12]D.\nSkeletonize_all_rework_22.m.\n59 > dir_in = pwd, ‘/binarized’];\n60 > dir_out = pwd, ‘/skeletonized’];\nNext, use the following action steps.\nDilation and erosion: Utilize MATLAB functions ‘imerode.m’ and ‘imdilate.m’ with hard coded “PaddingRange” of 4 pixels.\nPreparing files: Copy the first and last slice in each file to “dir_out” as skeletonization requires +1 for each step.\nSkeletonization: Main script calls ‘Skeleton3D_YTW_sub_sub.m’ which does the heavy lifting of skeletonization.\nObtained radii measurements from the skeleton using ‘radii_from_skele_all_22.m’.\nIf performing this step locally, use the general settings which begin on Line 16.\nReplace “pwd” with the desired dataset location.\nradii_from_skele_all_22.m.\n22 > dir_in = [pwd, ‘/skeletonized’];\n23 > dir_tif= [pwd, ‘/binarized’];\n24 > dir_out= [pwd, ‘/radii’];\nLastly, deploy the ‘Tracking_from_radii_v3_22.m’ script, which completes the final clean-up of the skeleton.\nNote: Within the “private” folder, there are additional scripts that help to remove incorrect nodes, and finding and addressing minor disconnections. These do not require user input and are called through the main sections of the code. There is also a ‘writeTIF.m’ file in this folder that can be used to convert skeleton from “.bin” files to “.tif” format.\nAfter the skeleton has been cleaned up, registration and generation of the statistics file (.csv) are generated without the need for user input. Image registration using Elastix has been implemented at 10 μm isotropic resolution while using the Allen Common Coordinate Framework (CCF) as a reference brain. Image registration parameter files are included in “003_Vasculature_analyzer” folder.\nComputational analysis: Applying cell counting and tracing pipelines to SLURM\nTiming: 1–3 days (for steps 133 to 143)",
    "In this section, the steps outline how both the AI cell counting and vessel tracing pipelines can be adapted for execution on a high-performance computing (HPC) environment. For vessel tracing, if using the Slurm HPC system, the batch file, named ‘mybatch5’, is included in the code folder.\nThe AI cell counting scripts can also be run on HPC by including all contents in the “005_AI_Cell_Counting” and the .h5 file of the trained AI. To run the AI pipeline on an HPC, utilize the file titled ‘RUN_THIS_FILE_slurm_batch’.\nIf running on the HPC maintain the ‘folder_name=pwd’. Otherwise, change the name of the folder to the sample folder being utilized.\nSet “module_deep_learning_cell_typing” to a folder that contains the .h5 trained ResNet network.\nSet “module_register_and_output” to ‘20209016_register_and_output_allen_correction_2017_2020_v4’. This folder contains the necessary components to fully register the entire sample brain to the Allen Common Coordinate Framework.\nIf using a Slurm HPC system, the parallel control code must be included in each of the steps of this pipeline. The coreCount corresponds to the number of cores per node.\nThe example shown below is located in ‘Binarization_22.m’.\n10 > coreCount =22;\n11 > aa = parcluster\n12 > temp_folder = [‘./matlab_cluster_’, datestr(now, ‘yyy-mm-dd-HH-MM-SS-FFF’)];\n13 > aa.JobStorageLocation =temp_folder;\n14 >\n15 > parpool(aa,coreCount, IdleTimeout’,inf)\nTo run the whole pipeline on a Slurm HPC system the scripts to run this pipeline as well as the batch code must be located within the data older copied to the HPC.\nDatasets can be easily copied to the HPC through software such as WinSCP or FileZilla.\nMobaXterm is a recommended interface that allows for ease of navigating the Slurm HPC system.\nFor use of the batch file, named ‘mybatch5’, Lines 2–11 may/will need to be adjusted for use.\nThe account should be adjusted to reflect the HPC user account.",
    "Partition should reflect the desired node to use.\nIt is easiest if the “job-name” is short but contains useful information regarding the sample being run.\n“Mail-user” allows for the HPC to email the user submitting the job about any code failure or when the pipeline is finished running.\nLines 7–8 provide important information in the log and notification regarding which dataset finished and errors encountered.\nLine 11 may need adjustment depending on the number of CPU per desired per task, in accordance with the number of CPU per partition.\nRemaining lines of the code load MATLAB and run each of the 4 scripts described below.\n1 > #!/bin/bash -l\n2 > #SBATCH --account= lab_kim\n3 > #SBATCH --partition= dense\n4 > #SBATCH --job-name= C57_young\n5 > #SBATCH --mail-user= hxb163@psu.edu\n6 > #SBATCH --mail-type= FAIL,END\n7 > #SBATCH --output= GPU_XXX.%j.%N.out\n8 > #SBATCH --output= GPU_XXX.%j.%N.err\n9 > #SBATCH --nodes= 1\n10 > #SBATCH --ntasks=1\n11 > #SBATCH --cpus-per-task=22"
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Computer Sciences",
    "Health Sciences",
    "Microscopy",
    "Neuroscience",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}