{
  "id": 8147,
  "origin_website": "Bio",
  "title": "Generation of Mouse Lung Epithelial Cells",
  "procedures": [
    "Coating tissue culture platesPlates are coated with collagen and fibronectin to facilitate cell adhesion acting as a cellular matrix. Fibronectin specifically aids in anchoring the cells to the collagen.Prepare collagen coating mix under sterile conditions.Add adequate volume of collagen coating mix to cover the bottom of the plate being coated (e.x. 5 ml/10 cm plate).Leave plates covered overnight in the tissue culture hood under the UV light to prevent contamination.The following day aspirate the coating mix.Air-dry the plates in the tissue culture hood.Rinse the plate 2x with D-PBS (2.5 ml/10 cm plate).Air-dry plates in the tissue culture hood.Cover the plates, seal with parafilm, and store at 4 °C until ready to coat with fibronectin (duration of storage has not been tested extensively; however, plates left at 4 °C for one week were successfully used). Prepare fibronectin coating mix.Add adequate volume of fibronectin mixture to cover the bottom of the plate being  coated (e.x. 5 ml/10 cm plate).Incubate coated plates at 37 °C overnight in 5% CO2 cell culture incubator. The following day rinse the plates 2x with D-PBS (leave D-PBS in plates if not using immediately -do not allow plates to dry).Extracting cells from Tumor tissue Individual tumors, small areas of lung tissue, or entire lungs can be used to generate epithelial cells.Sacrifice animals per the university/institute established animal care and use protocol.Open up the thoracic cavity immediately after sacrifice.Perfuse the lungs by slowly injecting 7-10 ml of D-PBS into the left ventricle of the heart using a 25 gauge needle and syringe. Successful perfusion will result in the lungs changing color from pink to white, representing displacing the RBCs. Carefully remove the lungs and place them into D-PBS.",
    "If large tumors are evident dissect them out and proceed; otherwise continue the  procedure using the entire lung (see Figure 1 for lung tumors that can easily be harvested from the lung).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130726/20130726070138_3378.pngFigure 1. A KrasLSL-G12D/+; p53flx/flx mutant mouse was intratracheally infected with adenoviral particles expressing cre-recombinase to induce transgene recombination. Ten weeks following infection the mouse was sacrificed, lungs were perfused and harvested, and imaged. Multiple large tumor nodules are present on the surface. Wash the tumors/lungs by rinsing the exterior 4x with D-PBS.Mince the tissue in and equal volume ice-cold D-PBS with a sterile blade in tissue culture hood until the mass represents a slurry and few if any larger solid pieces are evident; however care should be taken to perform this step in a timely fashion to avoid cell death. The mincing step allows for easier retrieval of individual cells for propagating. Add the minced tissue to an equal volume of RPMI-1640 supplemented with 1 mg/ml collagenase and incubate for 1 h at 37 °C in 5% CO2 cell culture incubator. Remove cells intermittently from supernatant. Do not centrifuge. Let the larger pieces settle and remove the top-half of the supernatant containing individual cells every 10-15 min. Replenish RPMI/collagenase solution as needed and repeat 4-5 times. Pool and spin the collected supernatant at 1,000 x g at 4 °C for 5 min. Remove the supernatant and add 10 ml of RPMI-1640 supplemented with 10% FBS.Remove the D-PBS from the collagen/fibronectin coated plates.Immediately transfer the cell suspension to the coated plates being sure to supplement  with additional RPMI-1640/10% FBS to cover the surface of the plate if necessary (10 ml/10 cm plate).Incubate cells at 37 °C in 5% CO2 cell culture incubator.Continue to passage on coated plates for three passages.",
    "Selecting epithelial cellsOver the course of culturing select epithelial looking colonies. There are a few mechanisms to help in the selection process. Firstly, the fibroblasts are often more sensitive to trypsin and can therefore be removed from the plate while the epithelial cells will adhere for a longer time. This is done by treating the cells with trypsin and removing the first cells begin to slough off the plate as visualized under a microscope. This step helps to increase the epithelial cell population. Secondly, epithelial clones will become visible and are easily discernible from the fibroblast population.Once epithelial clones are evident, the clones are treated directly with a small amount of trypsin (50 μl dispensed directly on the clone) and visualized under a microscope until they begin to round up. The cells are then abducted using a sterile transfer pipette. The bulb of the pipette is squeezed in and held in that position while the tip of the pipette is placed over the individual clone. Once in place the pressure on the bulb is released slowly to encourage the cells to enter into the pipette. The entire contents are then transferred to individual wells in 12-well standard tissue-culture treated plates to further propagate (to enhance visualization of the clones, allow clones to be followed, and increase the abduction step, once identified, clones can be circled on the bottom of the plate with a sharpie).To confirm that cells are of epithelial origin stain with standard markers such as keratins. For the cells described here, keratin 14 was used. Thus far, cells generated by this procedure have been able to propagate beyond 50 passages. Note: It is inherently difficult to generate cultures of normal cells.",
    "All the cells that formed clones and were isolated by this procedure (irrespective of being generated from tumors or the whole lung) were confirmed to be mutant for Kras and p53. This procedure will specifically allow one to \"select\" for epithelial cells that can propagate outside of the organ."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}