{
  "id": 17448,
  "origin_website": "Jove",
  "title": "The Microscopic Transcanal Approach in Stapes Surgery Revisited",
  "procedures": [
    "The local review board of the Bern University (Kantonale Ethikkomission Bern) approved the present study, a formal informed consent was not required for this type of retrospective study.\n1. Indications\nUse the transcanal approach if the diameter of the ear canal is ≥5.5 mm.\n\tNOTE: The anatomy and shape of the outer ear canal might further limit the working space.\nAssess the canal's diameter by placing a 5 mm diameter ear speculum. Ensure that the speculum sits comfortably in the canal.\nDo not use the transcanal approach in anterior perforations with a non-visible anterior rim.\nUse the inside-out-technique11 for middle ear pathologies such as cholesteatomas, which reach the epitympanon beyond the semicircular canal.\n2. Preparation\nPositioning of the patient: Place the operating table at the lowest position, tilted in a reverse Trendelenburg position (Figure 1A) with the angle (α) of the headrest at its maximal reclination (without head hanging).\n\tNOTE: This position is contraindicated in patients with atlantoaxial instability. Finally, rotate the head towards the contralateral side (β, Figure 1B).\nInstruments: Use bent instruments to keep the working field open. Hold the instruments correctly with the fingers, thus preventing any blocked vision (Figure 2 and Figure 3).\n\tNOTE: Black-colored instruments reduce light reflections.\nDisinfection and cleaning of the ear canal: Clean the ear canal thoroughly to avoid any intraoperative infection. Disinfect the canal with diluted Povidone Iodine (2.5%-5% due to toxicity).\n3. Local anesthesia\nPerform local anesthesia in two steps:\n\t\nInject all four quadrants (23 G needle) with Carbostesin 0.25% (50 mg/20 mL) mixed with Adrenalin 1 mg/mL (final concentration 1:200,000 epinephrine).\nInject within the ear canal using a small bent 27 G needle. Be careful when injecting in the anterior-inferior area to avoid facial paresis.\n4. Tympanomeatal flap and speculum holder",
    "Perform a tympanomeatal flap using a u-shape incision with a sickle or a round knife starting at 6' o clock position (inferio-anterior). Detach the ear canal skin with a Rosen knife until the inferior annulus rim is reached.\nInstall the speculum holder (Figure 4).\nInsert the largest possible ear speculum. Make sure that the orientation is correct.\n\tNOTE: Letters indicating the size of the speculum should be placed superiorly.\nComplete the tympanomeatal u-shaped flap by cutting the superior-posterior part with the Belucci scissor. Detach the ear canal skin with a Rosen knife until the superior annulus rim is reached.\nThis step might cause bleeding.\nUse an absorbable gelatin sponge soaked with adrenaline to stop bleeding.\nDetach the whole flap until the edge of the annulus.\n5. Middle ear dissection\nMake sure that facial nerve monitoring is working before entering the middle ear.\n\tNOTE: The patient should have recovered from any neuromuscular block, which can be assessed by neuromuscular monitoring (4 TOF, train of four).\nEnter the middle ear at the posterior-superior part of the annulus since it is easier to detach at this position.\n\t​NOTE: Large cholesteatomas or granulation tissue around the middle ear ossicles might hide any anatomical landmark. In this case, inferio-posterior entering of the middle ear might be advised to find other landmarks (CAVE: jugular bulb).\nDissect and visualize the anatomical middle ear structures. Visualize the chorda tympani, promontory, incudostapedial joint, stapedial tendon, and the facial nerve (tympanic segment).\nWiden the posterior-superior part of the ear canal with a bone curette or a 2 mm rough diamond drill (low speed) if any of the above structures are not sufficiently exposed. Put an absorbable gelatin sponge in the middle ear to prevent the entrance of bone dust into the middle ear.\n6. Stapes suprastructure removal",
    "Disconnect the incudostapedial joint with a small 0.3-0.6 mm hook or a sickle knife and make an anterior movement to prevent breaking of the footplate.\nTest the mobility of all the three ossicles by touching each ossicle with a needle to confirm isolated ankylosis of the stapes.\nUse protection glasses or filters integrated into the microscope.\nDissect the stapedial tendon with the laser (e.g., diode laser, CO2-Laser). Test the strength of the laser during this procedure. Use a FOX laser with 2.5-3 W energy in pulse mode (30-50 ms); however, this value depends on the device and its probe.\nDissect the posterior crus of stapes near the attachment of the footplate ± anterior crus if the footplate is too mobile.\nRemove the stapes suprastructure. Brake the stapes away from the facial nerve towards the promontory if the anterior crus is still intact. Keep the footplate intact.\n\t​NOTE: The footplate should not move while breaking the suprastructure. There is a risk of a longitudinal fracture of the footplate during this procedure.\n7. Footplate perforation\nUse the FOX laser to carbonize/weaken the footplate (2 W, 30 ms pulse mode) by making a rosette pattern.\nUse a perforator microdrill (skeeter 0.6 mm) to perforate the last shell of the footplate in the posterior third section.\nIf the footplate is too thick, use a diamond microdrill to thin out the footplate until a blue shimmering structure is visible (also known as blue lining).\nDo not use the suction in the area of the footplate once the footplate is open.\n8. Stapes prosthesis insertion\nMeasure the distance between the long process of the incus and the footplate using a measurement instrument with a 4 mm measuring mark. Use a 0.25 mm longer prosthesis than measured.",
    "Hold the prosthesis hook with a small alligator ear forceps using a predefined angle of orientation (~20°) prior to insertion.\nCrimp the stapes hook on the long process of the incus.\n\tNOTE: The front tine of the crimping instrument moves while the back tine remains stable on the incus.\nCheck the movement of the prosthesis by moving the malleus handle.\nAvoid the prosthesis from touching the promontory or the facial nerve.\nConsider using otologic cement if there is an interplay between prosthesis and incus process.\nAvoid over-crimping since there is a risk for incus necrosis in the long term.\nSeal the perforated footplate with small water-soaked absorbable gelatin sponge.\n9. Wound closure/dressing\nReposition the tympanomeatal flap, adapt with silk dressing, and pack with absorbable gelatin sponge soaked with a solution of hydrocortisone 10 mg (1%)/neomycin 3.5 mg/polymyxin B sulfates 10,000 Units.\nUse a 10 cm ribbon gauze soaked with the same solution for ear canal packing."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}