{
  "id": 17411,
  "origin_website": "Jove",
  "title": "High-Throughput Optical Controlling and Recording Calcium Signal in iPSC-Derived Cardiomyocytes for Toxicity Testing and Phenotypic Drug Screening",
  "procedures": [
    "Left ventricular non-compaction cardiomyopathy (LVNC) patient iPSC-derived cardiomyocytes (iPSC-CM) were provided by the National Taiwan University Hospital. The collection of patient samples for reprogramming to iPSC and the maintenance protocols14 for research purposes followed the WMA Declaration of Helsinki (ethical principles for medical research involving human subjects) and were approved by Institutional Review Board: Research Ethics Committee Office at NTUH (#201612099RINC). Other iPSC-CM's were obtained from commercial vendors. The use of iPSC derivatives does not require specific permissions in our institution.\n1. iPSC derived cardiomyocytes preparation\nPrepare the multi-well plate before iPSC-CM is removed from cold storage for thawing. Coat each well of the 96-well microplate with 100 µL of 50 µg/mL fibronectin/0.2% gelatin solution (see Table of Materials) to cover all surfaces thoroughly.\nIncubate the plate at 37 °C for 1 h in a humidified incubator.\nWarm the medium (see Table of Materials) to room temperature for 30 min before cell thawing.\n\tNOTE: The present protocol describes room temperature as 25 °C.\nTransfer the iPSC-CM from the liquid nitrogen storage tank to a 37 °C water bath.\n\tNOTE: iPS-CMs are typically shipped on dry ice by academic or commercial sources. They are transferred to liquid nitrogen storage on receipt until use.\nRemove the vial before the ice melts entirely and spray the vial with 75% ethanol.\nTake the vial to a Class II biosafety cabinet and gently transfer the contents to a new 15 mL conical tube containing 9 mL of room temperature medium.\nCentrifuge the cells at 200 x g for 3 min at room temperature.\nDiscard the supernatant by pipette and gently resuspend the cells in 1 mL of medium with 10 µM of ROCK inhibitor (Y27632) (see Table of Materials).\n\tNOTE: Avoid repeated pipetting of thawed cells to ensure maximum cell recovery.",
    "Remove the coating solution from the well and add 50 µL of medium with 10 µM of ROCK inhibitor quickly.\nConfirm the number of viable cells using the trypan blue exclusion method with a hemocytometer15.\nPlate cells in coated 96-well plate at a density of 100,000-150,000 cell/cm2,as per manufacturer's instructions16.\nAfter 24 h, ensure that the cells attached to the surface of the plate are in contact with other cells.\n\tNOTE: Single cells survive poorly in long-term culture and typically behave more variably.\nReplace pre-warmed maintenance medium every 2 days.\n\t​NOTE: For long-term drug treatment, the LVNC iPSC-CM were changed with half medium replacements with, or without, small molecule drugs every 2 days.\n2. Expression of genetically encoded calcium indicators\nAfter plating the cells for 72 h, thaw the GECIs viral kits (see Table of Materials) on ice.\nPrepare a 2x viral kit stock solution with the maintenance medium.\nPrepare the cells for infection by adjusting the medium volume to 100 µL per well. Add 100 µL of the pre-mixed viral solution and incubate for 8-16 h at 37 °C.\nReplace with 200 µL pre-warmed medium after incubation.\nVisualize the GECIs expression 24 h post-transduction using an imaging system (see Table of Materials).\n\tNOTE: The expression level reaches the maximum at 48-72 h post-transduction. Cells can be imaged from the 24 h time-point. However, the signals obtained from GECIs sustain for more than one month.\nMaintain cells in the humidified incubator before functional assays are performed.\nInfect the iPSC-CMs (LVNC patient-derived iPSC-CMs) with ChR2-K-GECO viral kit (see Table of Materials) at day 25 post differentiation using the infection protocol (step 2.1-2.6).\n3. Dye-based calcium imaging using Fluo-4\nDissolve Fluo-4 powder (see Table of Materials) in DMSO as a stock solution (5 mM).",
    "Dilute the stock solution to a concentration of 10 µM Fluo-4 in Tyrode's buffer.\n\tNOTE: Tyrode's buffer consists of 1.0 g/L of sodium bicarbonate, 0.2 g/L of calcium chloride, 0.1 g/L of magnesium chloride, 0.2 g/L of potassium chloride, 8.0 g/L of sodium chloride, 0.05 g/L of sodium phosphate monobasic, and 1.0 g/L of D-glucose.\nReplace half medium with 10 µM of Fluo-4 solution (giving a final concentration of 5 µM).\nIncubate the cells at 37 °C for 30 min.\nWash the cells with pre-warmed Tyrode's buffer and replace them with the medium before image acquisition.\nStart recording with the stream acquisition protocol.\n\t​NOTE: Stream acquisition is continuously acquiring images without interval time. The beating frequency of iPSC-CM is about 1 Hz, and this stream acquisition protocol is used for collecting beating patterns.\n4. Image acquisition and functional assays for toxicity test and phenotypic screening\nSwitch on all the devices of the High-Content Imaging System (see Table of Materials).\nVerify that the chamber temperature reaches 37 °C, with 5% CO2 supplementation. Keep the system at equilibrium for 2 h before image acquisition.\n\tNOTE: Thermal drift is a significant problem for long-term live-cell observations, 1 °C can change the focal plane by ~1 µm, so allowing the lens, and stage, to reach the target temperature is essential before image acquisition.\nOpen the imaging software (see Table of Materials) and choose the plate setting for a 96-well plate.\nPlace an unlidded 96-well plate into the chamber and load with the live-cell sealing ring on top.\n\tNOTE: The live-cell sealing ring is an adapter for reaching environmental equilibrium.\nChoose the 20x (Figure 1 and Figure 2), 60x (Figure 3 and Figure 4), and 20x (Figure 5) water immersion objective lens according to the spatial resolution required.",
    "Adjust the focus to take clear images before experimental acquisition.\nSelect 3-5 regions randomly per well for calcium activity recording.\n\tNOTE: Every region must include at least 20 cells (n ≥ 20).\nChoose appropriate filters for different indicators. FITC 475/536 for mNG-GECO, mtGCEPIA3, and Oria1-G-GECO; Cy5 631/692 for NIR-GECO2; ER 530/593 for ER-LAR-GECO; Texas Red 560/624 for K-GECO.\nSet the appropriate light-emitting diode (LED) power for each imaging channel used.\n\tNOTE: When optimizing LED power for imaging acquisition by signal (detected intensity of object) to noise (detected intensity of background) ratio, the S/N ratio should be higher than 2. In this protocol, 10% LED power for TRITC and FITC; 20% for Cy5 was typical.\nSet the camera exposure time to a maximum of 40 ms (25 Hz) and a recording duration of 30 sfor stream acquisition to observe calcium transients reported by mNG-GECO and K-GECO probes expressed in cardiomyocytes (Figure 1-3 and Figure 5). Increase the LED power if the signal/noise is <2 at higher frame rates.\nFor optogenetic stimulation (Figure 2 and Figure 3C,D), optimize the power (typically 5%-10%) and frequency of blue light at 1 Hz.\n\tNOTE: Generally, human iPSC-CM beats spontaneously around ~ 1 Hz, and the operator needs to pace faster than the spontaneous rate.\nIf sequential (Figure 3) or extended (Figure 4) measurements are planned, avoid phototoxicity at all costs. This may mean reducing illumination power intensity and compensating for this by increasing camera exposure time, for example, to 100 ms with the time-lapse protocol used for three-channel real-time observation of subcellular Ca2+ signals (Figure 4).\nUse the asynchronous dispense protocol for 10 mM caffeine addition via the auto microfluidics system (see Table of Materials) (Figure 4).",
    "NOTE: The asynchronous dispense protocol allows image acquisition to occur while drugs such as caffeine are added, without gaps between images.\nStart acquisition.\n5. Small molecule preparation\nResuspend the E4031, dofetilide, and verapamil in DMSO and dilute them with Tyrode's buffer. The final concentration of DMSO in the medium was 0.1% (v/v).\nPrepare the compound solutions at the double (i.e., 2x) the desired working concentration and equilibrate at 37 °C before addition.\n\tNOTE: Minimizing temperature fluctuations following medium addition is vital as contractility is temperature-dependent, and the effect of changing temperature is rapid.\nArrange compounds to the corresponding target well.\nAdd 100 µL of the double strength (2x) compounds via the auto microfluidics system (see Table of Materials) into the wells and start acquisition after the desired (typically 15 min) incubation period.\n6. Imaging processing and analysis\nIsolate the signal area from the background by detecting the feature of the pulse over time-revolution automatically with the software.\nUse the Calcium peak analysis software (see Table of Materials) to analyze Beating frequency (BPM), Peak signal (Amplitude), Calcium transient duration 50% (CTD50), Calcium transient duration 90% (CTD90), rise time, and decay time (Figure 1C).\n\tNOTE: In these settings, photobleaching was apparent over the first 10 s, and the signals are stabilized after that. Thus, the calcium peak was analyzed from 11-30 s. In three-channel recordings (Figure 4), the cell contour is bordered manually for measuring intensity change."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}