{
  "id": 19378,
  "origin_website": "Jove",
  "title": "Measuring O2 Consumption in Drosophila melanogaster Using Coulometric Microrespirometry",
  "procedures": [
    "1. Fly rearing and collection\nMaintain flies at 25 °C in narrow vials containing standard Drosophila food.\n\tNOTE: The sample size for each genotype should comprise at least nine replicates, each consisting of a single respirometer chamber containing 15-25 flies, set up as described below.\nTransfer the flies every 2-3 days.\nAnesthetize flies with CO2, collect groups of 15-25 males of each genotype, and place each group into fresh, unyeasted food vials.\n\tNOTE: Males were used to reduce variability due to reproductive status. The method applies to both sexes.\nAllow the flies to recover at 25 °C for at least 24 h.\n\tNOTE: By the time of the experiment, flies should be 1-4 days old. The frequency of collections described in step 1.3 can be set to narrow the age range of the flies.\n2. Setup and assembly of respirometer chamber\nTurn on the water bath and set it to the desired temperature for the experiment.\n\tNOTE: The experiments below were conducted at 25 °C using 50 mL Schlenk tubes as chambers. Components are to be assembled as shown in Figures 1A, 1B, and 1C.\nClean the ground glass joints of chambers and sensor plugs thoroughly by spraying 70% ethanol onto a laboratory wipe (not directly onto the joint) and wiping dust and old grease from the sensor plug (Figure 1A). Wipe off ethanol with a fresh laboratory wipe.\nPlace 1 cm piece of cotton roll soaked in purified water into the bottom of the chamber to stabilize the humidity.\n\t\nAdd enough water (~0.5 mL) to form a small pool at the bottom of the cotton roll.\nWipe off any water that has spilled onto the joint of the chamber.\nTransfer the flies to labeled polypropylene tubes using a funnel.\n\t\nPlug the tube with a cotton roll.",
    "NOTE: Tubes consist of a 5 mL polypropylene test tube, trimmed to 5.5 cm in length and perforated with a hot knife to allow the free exchange of air with the experimental chamber. CO2 anesthesia is known to cause metabolic abnormalities, so flies are transferred without anesthesia which requires more care to avoid losing the flies.\nAdd one ventilated tube with flies into each respirometer chamber (on top of wet cotton).\nFill soda lime cartridges (4-5 pellets per tube) and place them on the top of the tube containing flies inside the chamber.\n\tNOTE: Soda lime cartridges consist of 800 µL centrifuge tubes perforated 4-5 times with a power drill.\nFill O2 generators with saturated copper sulfate (CuSO4) solution below level of vent holes\n\tNOTE: O2 generators consist of screw-cap centrifuge tubes with 4 holes drilled below the threads. Platinum (Pt) and Copper (Cu) electrodes are soldered to two-pin connector, inserted into holes drilled in cap, and affixed with epoxy. Electrolysis of CuSO4 generates the O2 consumed by the experimental organism. CuSO4 is toxic to invertebrates, avoid spills or leakage and clean up immediately.\nConnect the filled O2 generator to two-pin connector on the sensor plug.\n\tNOTE: The copper cathode must connect with the negative output of the controller and the platinum anode to the positive wire. Reversed connections will cause the failure of the experiment.\nPlace two small dabs of clear silicone grease on opposite sides of the ground glass joint of the sensor plug.\nInsert the plug into the chamber and rotate the plug (or chamber) with moderate pressure to spread the grease in the joint.\n\t\nWipe off excess grease with a laboratory wipe.\nSnap plastic Keck clamps onto joints to secure plugs in chambers. The assembled chamber should look like Figure 1C.",
    "Repeat the above steps for the number of chambers used for the day's experiment.\n\tNOTE: The number of chambers that can be recorded is limited by the number of available chambers, controllers and USB inputs to the computer. For the present experiments, seven chambers were normally run in parallel. Experimental flies such as mutants should be matched with appropriate controls. A chamber set up identically but without flies should be included in each experiment as a control for environmental variation. Chambers containing different treatments (mutant, wildtype, no-fly) should be rotated between experiments.\nPlace assembled chambers into a rack in the water bath with stopcocks open (Figure 1E).\n\tNOTE: To avoid circadian variation, chambers were placed into the bath between 9:30 and 9:50 am for all experiments described here.\nLeave stopcocks open (Keep the handle parallel to the stopcock).\n\tNOTE: Be careful not to allow water to enter the stopcocks.\nAllow the chambers to equilibrate with stopcocks open for about 30 min.\n\t​NOTE: While the chamber is equilibrated, connect the electronics and set up data acquisition as described below.\n3. Setting up controllers and computer\nBe sure that the switches supplying current to the O2 generators are in the OFF position (away from the connector; Figure 1D).\nPlug each controller box into an available Universal serial bus (USB) port.\n\tNOTE: Construction and programming of controller units described elsewhere12.\nConnect controllers to respirometer chambers using 6-conductor cables.\nCheck that the organic light emitting diode (OLED) displays of the controllers (Figure 1D) are displaying environmental parameters.\nBriefly turn on O2 generators using the switch on the controller (Figure 1D).\n\t\nIf the current value increases from zero to between 35 and 55 mA, the controller and chamber are ready for experiments.\nDetermine which COM ports are being used by the controllers, as described below.,",
    "Click the Start Icon in Microsoft Windows.\nClick the Settings Icon.\nClick Bluetooth and Devices.\nEnsure that the controllers and their COM ports appear in the list of devices.\nOpen PuTTY on the desktop and set up a log file for each channel of the respirometer as described below.\n\tNOTE: PuTTY is a free secure shell and telnet client that is used to transfer data to the computer via COM ports.\n\t\nSelect COM port for a controller by typing the number of the port in the \"Serial line\" box (Figure 2A).\nClick on Logging.\nSelect Printable Output in \"Session logging\" (Figure 2B).\nUnder Log File Name click Browse.\nIn the folder of the choice, create a filename containing descriptive information (e.g., date, species, COM port number).\nClick Save.\nClick Open. A window will open showing comma-delimited data being logged (Figure 2C).\nRepeat for all other controllers in use for the experiment. Input to each COM port will appear as a separate window (Figure 2D).\n4. Running experiments\nOnce chambers have equilibrated for 30 min, seal them by closing stopcocks.\nCover the bath and chambers with a polystyrene foam box to maintain a stable environment.\nAllow to equilibrate for another hour.\nTurn on the current to the O2 generator of each chamber using the switch on the controller box.\nOnce the O2 generators are activated, ensure that the pressure increases to pre-set OFF pressure.",
    "NOTE: 1017 hPa, which is slightly above atmospheric pressure, was used as the \"OFF\" pressure in this series of experiments. Return to the ambient pressure will indicate leakage of gas from the chambers. Further, it allows the same pressure to be used across experiments regardless of ambient barometric pressure. The \"ON\" pressure was 1016 hPa, meaning that pressure only needed to drop 1 hPa before the O2 generator was activated. This provided adequate sensitivity to measure O2 consumption in Drosophila. Once a chamber is pressurized to the \"OFF\" setting, current should drop to zero.\nLet the experiment run for 3 or more h.\n\tNOTE: Higher VO2 at elevated temperatures can allow for shorter experiment times. Monitor occasionally to ensure that equipment is functioning but avoid excessive activity near the chambers that may affect temperature stability.\n5. Finishing experiment\nTurn off O2 generators on all controllers.\n\tNOTE: Do first to avoid running the O2 generators while the chambers are open.\nOpen the stopcocks to unseal the chambers.\nLeave the PuTTY windows open for another 5-15 min to provide a final baseline.\nClose the PuTTY window for each controller, ending recordings.\n\t​NOTE: All experiments ended between 4:50 and 5:10 pm.\nDisconnect sensors from cables.\nMove chambers to dry rack.\nRemove sensor plugs one at a time from the chambers.\nDisconnect the O2 generators and place them in the tube rack.\nWipe grease off the sensor plug and keep it in the rack.\nClean grease from chamber joints and remove tubes with flies and soda lime.\nAnesthetize flies in each tube with CO2, tap onto a weight boat and weigh on a microbalance.\n\t\nLog the weight and number of flies for each tube.\nDiscard flies or set them aside for additional procedures.\nDump soda lime from cartridges into the waste container.",
    "Open the O2 generator and discard the CuSO4 solution into the waste container.\n\t\nRinse electrodes and tube with purified water.\nPlace the tube racks for drying.\n6. Analysis of charge transfer data\nImport Data as comma-delimited text into a spreadsheet, with each record comprising a separate worksheet.\nRecord the current and time data for each pulse of the O2 generator. Starting with the first pulse after the chamber was pressurized, record the start time and end time (as row numbers) of each current pulse. That is the row number when the current goes above zero (usually to about 45-50 mA) to the last row that is above zero.\nMake a table on the worksheet to record the following data:\n\t\nThe average current amplitude during the pulse: = AVERAGE([first row of pulse]:[last row of pulse]) for each pulse (from the current column).\nPulse duration: ([Last row of pulse] - [first row of pulse[-one row]])/1000 for each pulse (from the time in milliseconds column).\nTotal experiment time: [time at start of last pulse] - [time at end of first pulse after chamber pressurized] (from the time in minutes column).\nThen calculate charge transfer (Q) for each pulse (average current X duration)\nSum the charge from all pulses to calculate Total Charge (Qtot).\n7. Analysis of O2 consumption\nSet up a new spreadsheet for all data and enter or calculate the following for each chamber:\n\t\nQtot (total charge)\nMoles (= Q ÷ 96485 × 4)\nmL O2 (= moles × 22413 mL/mol)\nTotal time (from the data analysis above)\nmL min-1 (= ml O2 ÷ total time)\nWeight in grams (flies anesthetized and weighed measured after the experiment)\nmL min-1 g-1 (= mL min-1 ÷ weight in grams)\nmL/h/g (the above × 60)\nmg/fly (= weight of flies ÷ number of flies)",
    "μL fly-1 h-1 (= (mL min-1 × 3600) ÷ number of flies).\nTabulate data for each treatment (genotype, e.g.)\nCompare treatments using ANOVA, t-test, or Mann-Whitney u-test 13.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}