{
  "id": 9728,
  "origin_website": "Jove",
  "title": "Methods for Experimental Manipulations after Optic Nerve Transection in the Mammalian CNS",
  "procedures": [
    "1.  Surgical Technique\nExperiments should be carried out using aseptic technique and following the animal use protocols of your specific institution. Instruments and materials (solutions, test substances, tracers, needles, etc.) coming into contact with living tissue must be sterile to prevent infection and adverse impacts on animal welfare and potential negative impacts on the study.\n2.  Anesthesia\nRats will be anaesthetized using a veterinary isoflurane vaporizer system. Use medical grade oxygen at a rate of 0.8 L/min to vaporize the isoflurane gas. Place the animal in the attached anesthesia box and dial in an isoflurane concentration of 4% until the breathing has slowed and the animal is sedate.\nNext, switch the gas flow to the gas mask attachment for the stereotaxic frame and place the animal in the stereotaxic apparatus.  Turn the isoflurane concentration down to 2% and monitor anesthesia. Larger animals (>300g) may require a higher concentration of isoflurane. Anesthesia should be monitored during surgery and isoflurane dosage adjusted accordingly. Depth and rate of breathing should be constantly evaluated, and toe pinch evaluation (every 5 min) for the absence of deep pain should be performed.\nOnce the surgery is complete, turn off the isoflurane and allow the animal to breath oxygen for several minutes prior to removal from the stereotaxic device. Body temperature should be maintained by covering the animal with a surgical blanket and/or using a regulated heating blanket during surgery.\n3.  Syringe Preparation for Intraocular Injections\nFirst, assemble the syringe system for performing the intraocular injections. A 10  μL RN Gastight 1701 Hamilton Syringe is used for injection. Remove any needle or RN nut present on the end of the syringe.",
    "Insert the PFA ferrule into the PEEK cup ferrule of the compression fitting. Then insert the complete fitting into the end of the syringe and loosely screw the RN nut over top.\nInsert one end of the 1/16 inch PEEK tubing into the compression fitting, through the opening in the RN nut. Make sure the PEEK tubing is fully seated. Tighten the RN nut to compress the ferrule, sealing the PEEK tubing.\nPerform Step 3.2 on both ends of the Dual RN glass coupler. Attach the free end of the PEEK tubing to one end of the Dual RN glass coupler by tightening the RN nut.\nA pulled glass micropipette will form the needle and barrel for the injection system. Use 1.5 mm O.D. thick walled glass capillary tubing to fabricate the glass pipettes, and insert the glass pipette into the free end of the Dual RN glass coupler. Tighten the RN nut to fix the pipette in place.\nThe fine tip of pulled glass micropipettes is typically too small for performing intraocular injections. In order to create a tip of appropriate diameter, break the tip of the glass pipette under visual guidance, using a surgical microscope. The frosted end of a glass specimen slide is well suited to break the pipette. Hold the pipette at an angle and rub the tip along the glass frosting to create a break. Ideally, the final tip should be slightly bevelled. It may take a few attempts to produce a good tip, so pull multiple pipettes prior to use.",
    "The injection system is hydraulic. Therefore, the syringe, PEEK tubing linker, Dual RN glass coupler and the glass micropipette must be filled with mineral oil prior to use. Using the Priming kit from Hamilton Syringe Co. (PRMKIT), fill the priming syringe with mineral oil. Use a large diameter needle to allow easy passage of the viscous oil. Replace the needle with the Hamilton 90030 needle that fits inside the barrel of the 10  μL Hamilton syringe. Next, place a rubber septum over the Hamilton 90030 needle, in order to provide a seal while injecting the mineral oil.\nInsert the Hamilton 90030 needle of the priming syringe into the back of the barrel of the 10  μL Hamilton syringe of the injection system. Press the septum tightly against the end of the syringe to create a seal.\nSlowly depress the plunger. You will see the mineral oil pass through the glass elements of the injection system, and finally filling the glass pipette. Push all of the oil through the injection system in order to remove any air bubbles along the tract. If the filling syringe is running out of mineral oil, slowly withdraw the needle while constantly dispensing oil to prevent air bubble formation. Refill the priming syringe and inject again.\nWhen the entire system is filled with mineral oil and bubble free, insert the original plunger of the 10  μL Hamilton syringe. Depress the plunger until the end of its travel in order to remove additional mineral oil from the system. Wipe the glass micropipette clean and the end of the syringe clean with 70% ethanol.",
    "Withdraw the plunger of the syringe to the 2  μL mark on the barrel. The end of the glass micropipette will fill with air providing a buffer zone between the mineral oil and the desired fluid to be injected. The pipette barrel can now be filled by placing the end of the micropipette in the desired solution and withdrawing the plunger of the Hamilton syringe. Do not inject more than 4-5  μL of solution into an adult rat eye.\n4.  Intraocular Injection Procedure: Targeting the Retina Globally\nWith the animal anesthetized and secured in the stereotaxic frame (as described in Section 2), use Alcaine eye drops to topically anesthetize the cornea. Open the eyelids with your fingers and place one drop of the anesthetic solution on the surface of the cornea.\nInjection requires two people: one to insert the glass pipette into the vitreous chamber and maintain pipette position, and another to depress the plunger on the syringe which delivers the desired solution.\nUnder a surgical microscope, grip the glass micropipette and Dual RN glass coupler with your fingers. Spread the eyelids with the fingers of your free hand, forming a \"V\" shape opposite the injection site. By applying traction to the eyelids, the eye will be elevated out of the orbit, exposing the posterior surface behind the limbus.  By creating a \"V\" shape with the fingers opposite the injection site, a cradle is formed for the eye providing stability when injecting.\nGently insert the tip of the glass micropipette through the conjunctiva, in an area devoid of blood vessels, and through the sclera, at a downward angle. You should feel a small \"pop\" when the pipette penetrates the sclera. Inserting the pipette at a slightly downward angle reduces the chance of hitting the lens when inserting the needle.",
    "The person holding the syringe should now inject the 4  μL of solution by depressing the plunger to the 2  μL mark on the syringe. The injection should take approximately one to two seconds in total. Injecting at a very slow rate >3 seconds reduces the initial spread of the solution through the vitreous chamber. You will be able to see the injected solution flushing through the vitreous chamber under the microscope, thereby verifying the success of the procedure.\nHold the micropipette steady for approximately 5 seconds and then withdraw, in the same direction as the needle was inserted. The conjunctiva will flap back over the small opening, helping to seal the scleral puncture.\nCover the surface of the cornea with ophthalmic eye ointment (Tears Naturale P.M.) in order to prevent corneal drying during recovery, and return the animal to a recovery cage.\nPost- surgical analgesics should be administered according to the guidelines of your animal care authorities, and animals should be carefully monitored after surgery.\n5.  Selectively Targeting Retinal Ganglion Cells from the Optic Nerve Stump\nApplying tracers, drugs, plasmids, siRNAs or viral vectors to optic nerve stump, following axotomy, directly targets retinal ganglion cells through retrograde transport. This is accomplished by first performing an optic nerve transection according to the \"Optic Nerve Transection Protocol\"22.\nThere are two main methods to accomplish this procedure: using gelfoam, or direct injection into the optic nerve.\nThe gelfoam method is similar to retrograde tracing, however when delivering experimental treatments at the optic nerve it is desirable to pre-label the retinal ganglion cells by injecting retrograde tracers into the superior colliculus 1 week prior to axotomy. This is important for cell tracing because, in some instances neuronal tracers can interfere with the retrograde transport of experimental substances or vice versa.",
    "Immediately after the optic nerve is cut, a small piece of gelfoam soaked in the experimental solution is placed over the transected optic nerve stump. The orbital contents are then returned to their previous location. When the eye is returned to a neutral position it is necessary to use forceps to push the piece of gelfoam down into the orbit, ensuring that it remains over the end of the optic nerve.\nThe injection technique is more effective for the delivery of substances that must gain access to the cytoplasm of the axon in order to be retrogradely transported by axoplasmic flow. This includes siRNAs and plasmids, and in some cases viral vectors. A 5-10  μL Hamilton syringe is used to inject the desired solution into the transected optic nerve.\nGrip the edge of the optic nerve with fine tip Dumont forceps. Insert the end of the needle into the optic nerve, parallel with the nerve, until the bevel is no longer visible. The inserted needle will be encased on all sides by the nerve. A needle with a short bevel is desirable.\nOnce the needle is inserted into the nerve, gently squeeze the sides of the nerve with the fine tip forceps and inject one quarter of the solution while rotating the syringe one quarter turn clockwise or counter clockwise.\nContinue repeating Step 5.7 until you have completed a full rotation of the needle and injected the entire contents of the syringe. For best results inject a total of 10  μL of solution using a gastight 10  μL Hamilton syringe.\nRemove the tip of the syringe from the nerve. Leave the excess injected fluid that has refluxed from the nerve within the orbit as this will form an additional pool for uptake by the ends of the axons.",
    "Return the orbital contents to their original position, close the wound, and allow the animal to recover.\nPost- surgical analgesics should be administered according to the guidelines of your animal care authorities, and animals should be carefully monitored after surgery.\n6.  Representative Results:\nIntraocular injections target all cells in the retina globally, and work well for the delivery substances to injured RGCs since ganglion cells are located in the innermost neuronal layer of the retina, adjacent to the vitreous chamber.  RGCs can also be directly targeted by delivering substances to the transected optic nerve stump. Fluorogold retrogradely labeled RGCs can be targeted using peptides, drugs, vectors, plasmids, or siRNAs from the nerve stump as illustrated in Figure 1. Figure 1A-C demonstrates the localization of a Cy3 labeled peptide in the somata of RGCs that were pre-labeled by injecting Fluorogold into the superior colliculus. Cy3 labeled peptides were injected into the optic nerve immediately after axotomy, and the retina was imaged alive in order to prevent the peptides from leaching out of the tissue during fixation. Figure 1D-F demonstrates the localization of Cy3 labeled siRNAs and the retrograde tracer Fluorogold in axotomized RGCs. Cy3 labeled siRNAs were injected into the optic nerve stump immediately after axotomy, and the retina was imaged alive.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2261/2261fig1.jpg",
    "Figure 1. Epifluorescence micrographs of RGCs in flatmounted retinas at 1 day after axotomy and injection of either labeled peptides or siRNAs into the optic nerve stump.  (A) Fluorogold retrograde labeling in axotomized RGCs at 1 day postaxotomy (B) Cy3 fluorescence in RGCs following retrograde transport of labeled peptides, 1 day after axotomy and peptide injection into the optic nerve. (C) Overlay of (A) and (B) demonstrating the selective localization of Cy3 labeled peptides in Fluorogold labeled RGCs. (D-F) The cell bodies of Fluorogold labeled RGCs (D) are also filled with Cy3 labeled siRNAs (E) injected into the optic nerve stump 24 hours earlier, as shown in the overlay (F). Scale bar in A-C is 50 μm. Scale bar in D-F is 20 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}