{
  "id": 3538,
  "origin_website": "Cell",
  "title": "Protocol for the saturation and multiplexing of genetic variants using CRISPR-Cas9",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCloning of sgRNA\nThe protocol below describes steps for cloning 20 bp oligos into a sgRNA cassette and into the PX458-Cas9-2A-GFP plasmid. However, we have also used this protocol to clone into PX330-Cas9 and PX459-Cas9-2A-Puromycin.\nDay 1 step by step method to clone sgRNA\nTiming: 5 h\nAnneal oligonucleotides and clone in PX458-Cas9-2A-GFP vector.\nNote: Thaw all the reagents on ice and keep the enzyme in a StrataCooler benchtop cooler during sample preparation. If multiple sgRNAs are to be cloned, prepare the master mix as shown below and add each forward and reverse oligo pair into the appropriate PCR tube.\nBriefly spin down the lyophilized oligo tubes prior to opening them.\nAdd non-DEPC treated water to lyophilized primers to equal a 100 μM concentration, vortex, and briefly centrifuge the tube. For example, if the oligo is 29.2 nmol, add 292 μL of distilled water to equal 100 μM.\nLabel a PCR tube for each sgRNA oligo pair and add reagents below:\ntable:files/protocols_protocol_3109_4.csv\n∗Do not use T4 PNK buffer as this buffer does not contain ATP; T4 ligation buffer is essentially the same composition but contains ATP.\nBriefly centrifuge PCR tube & run on thermocycler using the following program:\ntable:files/protocols_protocol_3109_5.csv\nAt the end of run, briefly centrifuge tubes. The annealed phosphorylated oligos can be stored at -20°C.\nAdd 1 μL of annealed product to 199 μL of distilled water in a 0.2 mL PCR-strip tube. Vortex properly and briefly centrifuge the strip-tube before use.\nSet up digestion/ligation reaction\nLabel a PCR tube for each oligo duplex and add reagents below:\ntable:files/protocols_protocol_3109_6.csv\nInclude a negative control that is 2 μL of water instead of annealed oligo.\nBriefly centrifuge tube & run on thermocycler using the following program.\ntable:files/protocols_protocol_3109_7.csv\nSet up exonuclease Reaction.",
    "Label a PCR tube for each ligation reaction and add reagents below:\ntable:files/protocols_protocol_3109_8.csv\nBriefly centrifuge tube & run on thermocycler using the following program:\ntable:files/protocols_protocol_3109_9.csv\nUse One Shot Top10 competent cells to transform the ligation mix.\nNote: Ampicillin-containing LB plates must be prepared and stored at 4°C before transformation. One Shot Top10 competent cells must be taken out of −80°C and immediately put on ice.\nAdd 1 μL of product from step-3b above and 10 μL of One Shot Top10 competent cells into a 1.5 mL Eppendorf tube.\nIncubate the tube on ice for 10 min.\nPerform heat shock step by adding the tube to a 42°C water bath for 30 s.\nImmediately incubate the tube on ice for 2 min.\nAdd 100 μL of SOC (without antibiotic) to the tube and incubate for 1 h in a 37°C bacterial incubator.\nLabel Ampicillin-containing LB plates and pre-warm in a 37°C bacterial incubator.\nAfter incubation, transfer all of the mixture from the 1.5 mL Eppendorf tube to the Ampicillin LB plate and using a bacterial spreader, evenly spread the mixture on top of the LB agar.\nIncubate the plates overnight in a 37°C bacterial incubator.\nDay 2: Bacterial colony screening\nTiming: 30 min\nObserve the colony numbers in the bacterial plates. Ideally the sgRNA cloning plates should have 5–10 times more colonies than the control plates. (See troubleshooting 1[href=https://www.wicell.org#troubleshooting]).",
    "Using a sterile 10 μL pipet tip, pick up a colony, add to a bacterial culture tube containing 3 mL of LB and 3 μL of (1000×) Ampicillin and incubate overnight in a 37°C bacterial shaking incubator. Repeat picking 5 colonies total for each bacterial plate. In addition, make a replicate plate by adding a small volume of each picked colony to a second Ampicillin-containing LB plate. Label the plate at the spot where each clone was deposited and incubate the plate overnight in a 37°C bacterial incubator.\nDay 3: Plasmid isolation and Sanger sequencing\nTiming: 6 h\nIsolate plasmid DNA and confirm presence of correct sgRNA insert by Sanger sequencing.\nAfter overnight culture, centrifuge the tubes at 4500 × g for 10 min to pellet the bacterial cells.\nPause point: The tubes can be stored at -20°C for a few weeks after removing the supernatant.\nIsolate the plasmid using the QIAprep Spin Miniprep Kit using the manufacturer's instruction https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiaprep-spin-miniprep-kit[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiaprep-spin-miniprep-kit]. Elute the plasmid DNA in 50 μL of distilled water.\nQuantify the concentration of the plasmid using a Nanodrop and perform a Sanger sequencing using the U6 forward primer. Human U6 promoter forward primer: GACTATCATATGCTTACCGT.\nUsing 4Peaks (or other sequencing analysis software like SnapGene or ApE-A plasmid Editor), check for the insertion of 20 bp sgRNA sequence following CACCG-sequence.\nDay 4: MaxiPrep to produce high yield of plasmid DNA for nucleofection\nTiming: 6 h\nAfter identifying the clone with correctly inserted sgRNA, pick the same clone from the replicate dish and add to 50 mL of Superbroth containing 50 μL of 1000× Ampicillin in a 200 mL flask. Incubate overnight in a shaking 37°C bacterial incubator.",
    "Note: LB medium can be used as a substitute if Superbroth is not accessible, however, it is worth noting that using Superbroth has been observed to result in higher plasmid concentrations.\nCollect the 50 mL bacterial culture in a falcon tube.\nMake a glycerol stock of each sgRNA clone by adding 500 μL of bacterial culture containing sgRNA from the 50 mL tube with 500 μL of 80% glycerol in a labeled 1.5 mL Eppendorf tube. Vortex the tube and store at −80°C freezer for future use.\nCentrifuge the 50 mL falcon tube for 20 min at 15000 g in an ultracentrifuge.\nAfter centrifugation, discard the supernatant and either proceed with plasmid isolation or store the pellet at −20°C.\nIsolate the plasmid using the QIAGEN Plasmid Maxi kit using the manufacturer’s instruction. https://www.qiagen.com/us/resources/resourcedetail?id=0bc0a0fe-480e-4e5e-b6e2-e75a654dd791&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=0bc0a0fe-480e-4e5e-b6e2-e75a654dd791&lang=en]. Ideally 300 μg of endotoxin-free plasmid DNA should be obtained from 50 mL of overnight culture.\nCheck the concentration and quality of the plasmid DNA using NanoDrop. The A260/280 ratio should be 1.9.\nStore the isolated plasmid DNA in −20°C in 50 μL aliquots to reduce multiple freeze thaw cycles.\nSaturation genome editing of BRCA2\nSaturation genome editing (SGE) is a powerful high-throughput genome editing technique designed to systematically introduce every possible nucleotide variant at a specific genomic location. It leverages the precision of the CRISPR-Cas9 technology and employs synthetic donor molecules to facilitate the targeted mutation process.",
    "In the SGE workflow, cells are transfected with a sgRNA-Cas9 plasmid and successful transfection is identified by the presence of GFP fluorescence at day 3. The cell population is then divided into two groups: one for immediate genomic DNA isolation to determine the initial variant composition and another cultured until day 14 and in the presence of DNA damaging agents like cisplatin and olaparib. After day14 genomic DNA was isolated to assess the abundance of variants that may have been lost or maintained over time (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3109-Fig2.jpg\nFigure 2. Experimental schematic showing different steps of saturation genome editing (SGE)\nIn this experimental workflow, mouse embryonic stem cells (mESCs) were initially nucleofected with a combination of sgRNA and a plasmid carrying GFP-tagged-Cas9 along with single-stranded DNA oligo donors. At day 3 post-nucleofection, GFP-expressing mESCs were FACS-sorted and half of this population was utilized for genomic DNA isolation. The edited locus was amplified with screening primers and subsequently deep sequencing was performed via Next-Generation Sequencing (NGS) to quantify the abundance of variants generated after CRISPR-SGE.The remaining GFP+ cells were cultured and treated with cisplatin and olaparib treatment from day 8 to day 14, aiming to induce DNA damage and evaluate the response of edited cells to these compounds. After the treatment period, genomic DNA was once again isolated from these cells at day 14 and the edited locus was amplified with the screening primers. Deep sequencing via Next-Generation Sequencing (NGS) was performed to calculate the dropout frequency of the genetic variants, providing comprehensive insights into the outcomes of genome editing and the cellular response to DNA-damaging agents.",
    "The key principle of SGE imparts that variants exhibiting a loss in abundance over time are considered non-functional, indicating that they negatively impact cell fitness. Conversely, variants that do not show a fitness defect are deemed functional. This systematic approach allows for the classification of genetic variants based on their effect on cell fitness. Furthermore, multiplexing enables the study of numerous variants simultaneously within a single experiment.\nNucleofection of sgRNA and donor library\nNote: To reduce variability of knock-in efficiency, the same set of sgRNA and oligo library is used for three nucleofections each containing 3.3 million mESCs. A total of 10 million mESCs from these three replicates were pooled into one 10 cm dish after nucleofection which represents replicate 1. The same experimental strategy is repeated to yield a replicate 2.\nmESCs preparation and nucleofection\nDay 0\nTiming: 1 h\nNote: Before starting nucleofection, add 10 mL of fresh media to the appropriate number of 10 cm feeder plates and keep 5 mL of warm media in a 37°C water bath. All the reagents for nucleofection are kept on ice and the cell culture medium is warmed up before adding to the cells.\nPrepare mESC and the sgRNA for nucleofection.\nPrepare sgRNA mix for nucleofection by adding the following reagents in a 1.5 mL Eppendorf tube. Store all tubes at RT.\ntable:files/protocols_protocol_3109_10.csv\nNote: Keep the plasmid concentration and the oligo donor concentration at 2 μg/μL such that the total volume to be added in step-9d is less than 15 μL.",
    "Trypsinize mESCs and collect the cells in a 15ml falcon tube. Do not centrifuge the cells. Quantify the cell number in the trypsin/media/cell mixture using a cell counter apparatus. Calculate the volume needed to equal 10 million cells. Add the cells to a new 15 mL falcon tube and centrifuge at 100 × g for 8 min more than 1x.\nDiscard the media and add 280 μL of nucleofector solution to the cell pellet containing 10 million ESCs. Gently mix to resuspend the mESC pellet.\nAdd the sgRNA-Cas9 plasmid/oligo donor library mix from step-9a to the cell suspension and gently mix.\nTransfer 100 μL of the cells/plasmid mix to the bottom of a nucleocuvette and give a gentle tap such that the entire solution settles to the bottom.\nRepeat step-9e for the other two nucleocuvettes.\nSet up the Lonza nucleofector 2B machine with program A030 and transfect each cuvette.\nImmediately add 500 μL of warm mESC maintenance media (from the 15 mL falcon tube incubated in the 37°C water bath) to each nucleocuvette. Collect the transfected cells from the 3 nucleocuvettes and transfer them all into the 10 cm feeder dish. Incubate the dish in a cell-culture incubator.\nKeep a small dish of mESCs as a non-transfected control for gating cells during FACS on day 3.\nDay 1\nTiming: 30 min\nNote: Before you start, warm up the fluorescence microscope for 15 min for the laser to strike off.\nAfter 24 h, observe the mESCs under a fluorescence microscope to check for GFP+ cells. Compare the transfected cells dish with the untransfected control. However, the number increases after 48 h. Cell death is also evident at 24 h post nucleofection. (see troubleshooting 2[href=https://www.wicell.org#troubleshooting]).\nFACS sorting for GFP+ mESCs post nucleofection\nDay 3\nTiming: 5 h",
    "Note: Six 6 cm feeder dishes with 5 mL of fresh mES cells maintenance media are required.\nBefore you start, warm up the fluorescence microscope for 15 min for the laser to strike off.\nRe-feed the 6 cm dish with fresh mES cells maintenance media and incubate the dish in a cell-culture incubator.\nObserve the increase in GFP+ mESCs in the 10 cm dish.\nAspirate the media on the dish, then wash the cells with 2 mL of DPBS. Gently overlay the DPBS onto the cells making sure to not allow detachment of the cells from the dish. Aspirate the DPBS and repeat once more.\nAdd 2 mL of 0.05% trypsin/EDTA such that it covers the entire cell surface area. Incubate the dish in a 37°C incubator with 5% CO2 for 10 min. Gently tap the sides of the cell culture dish and observe under the microscope to determine if the cells are detached from the dish.\nAdd 5 mL of mESC maintenance media to stop the action of trypsin. Gently pipette to break up the ES colonies making a single cell suspension.\nCollect the cells in a 15 mL falcon tube and centrifuge at 200 × g for 5 min to remove the residual trypsin.\nDiscard the supernatant, add 1 mL of PBS and resuspend the pellet.\nGently pass the cell suspension through 40 μm cell filter to remove ESC clusters.\nUsing forward vs. side scatter and the intensity of GFP fluorescence, sort all the GFP+ cells using BD FACS Flow cytometer (Figure 3[href=https://www.wicell.org#fig3]) (see troubleshooting 3[href=https://www.wicell.org#troubleshooting]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3109-Fig3.jpg\nFigure 3. Gating strategy to collect GFP+ mESCs post nucleofection using FACS",
    "(A) Mouse embryonic stem cells (mESCs) were initially nucleofected with sgRNAs, which were cloned into the Px458 plasmid. This plasmid carried Cas9 fused with 2A-GFP. At day 3 following nucleofection, transfected mESCs were selected based on the expression of GFP using Fluorescence-Activated Cell Sorting (FACS). Cells were gated initially using forward vs. side scatter parameters, and subsequent gating included considerations for cell size and exclusion of doublets.\n(B) Untransfected cells that did not exhibit any GFP fluorescence were utilized as a reference to establish gating parameters for GFP fluorescence.\n(C) Cells displaying high GFP expression were gated, and individual cells were sorted into separate tubes. It’s noteworthy that the transfection efficiency for this procedure typically ranged from 8% to 15% of the total cell population.\nCount the total number of GFP+ mESCs and collect directly into mESC maintenance media. Do not centrifuge the cells after FACS sorting. Collect 106 mESCs for genomic DNA isolation, centrifuge to pellet the cells and store at −80°C until all time points have been completed.\nIn addition, re-plate 1–1.5 million mESCs into one new 6 cm feeder dish for subsequent culture and addition of drug at day 8.\nRe-feed the 6 cm dish with mESC maintenance media on day 4 and day 6.\nTesting drug sensitivity of variants\nDay 7\nTiming: 1 h\nNote: Prepare six 10 cm feeder dishes with 10 mL of fresh mESC maintenance media per replicate.\nPrepare variant-containing mESCs to test their sensitivity to cisplatin and olaparib.\nAspirate the media on the dish, then wash the cells with 1 mL of DPBS. Gently overlay the DPBS onto the cells making sure to not allow detachment of the cells from the dish. Aspirate the DPBS and repeat once more.",
    "Add 1 mL of 0.05% trypsin/EDTA such that it covers the entire cell surface area. Incubate the dish in a 37°C incubator with 5% CO2 for 10 min. Gently tap the sides of the cell culture dish and observe under the microscope to determine if the cells are detached from the dish.\nAdd 4 mL of mESC maintenance media to stop the action of trypsin. Gently pipette to break up the ES colonies making a single cell suspension.\nCollect the cells in a 15 mL falcon tube and centrifuge at 200 × g for 5 min to remove the residual trypsin. Add 5 mL of mES cell maintenance media and pipette gently to resuspend the cell pellet.\nCount the total number of cells present in each sample using preferred cell counter.\nAdd 1 million cells into six 10 cm feeder dishes making sure to distribute the cells evenly over the dish. Two dishes are used each for DMSO (control), cisplatin and olaparib treatment. Incubate the dishes in a 37°C incubator with 5% CO2.\nTreatment with DNA damaging drugs\nDay 8\nTiming: 1 h\nMake working concentrations for cisplatin and olaparib as follows.\ntable:files/protocols_protocol_3109_11.csv\ntable:files/protocols_protocol_3109_12.csv\ntable:files/protocols_protocol_3109_13.csv\nNote: The working concentration tubes can be stored at 4°C for a week.\nAspirate media from each of the dishes and add 0.4 μM final concentration of cisplatin or 50 nM final concentration of olaparib in the appropriate dishes. For the DMSO control dishes, add the same volume as the cisplatin drug.\nFor example, make 25 mL of media containing the drugs and add 10 mL of media to the appropriate dish per drug condition.\nAdd 302.5 μL of 33 μM cisplatin solution to 25 mL of mESC maintenance media.\nAdd 125 μL of 10 μM olaparib solution to 25 mL of mESC maintenance media.",
    "Add 302.5 μL of DMSO solution to 25 mL of mESC maintenance media.\nAdd 10 mL of drug-containing media to the appropriate dish.\nIncubate in 37°C incubator with 5% CO2.\nReplace media with fresh cisplatin-containing, olaparib-containing or DMSO-containing media on day 10 and day 12.\nNote: Add the same volume of media containing the drugs each day the media is replaced.\nCollecting cells after drug treatment\nDay 14\nTiming: 3 h\nOn day 14, collect the mESCs for genomic DNA isolation.\nAspirate the media on the dish, then wash the cells with 2 mL of DPBS. Gently overlay the DPBS onto the cells making sure to not allow detachment of the cells from the dish. Aspirate the DPBS and repeat once more.\nAdd 2 mL of 0.05% trypsin/EDTA such that it covers the entire cell surface area. Incubate the dish in a 37°C incubator with 5% CO2 for 10 min. Gently tap the sides of the cell culture dish and observe under the microscope to determine if the cells are detached from the dish.\nAdd 5 mL of mESC maintenance media to stop the action of trypsin. Gently pipette to break up the ES colonies making a single cell suspension.\nCollect the cells in a 15 mL falcon tube and centrifuge at 200 × g for 5 min to remove the residual trypsin.\nDiscard the media and wash once with 10 mL of DPBS. Centrifuge the tubes at 200 × g for 5 min, discard the supernatant and store the cell pellet in −80°C for genomic DNA isolation.\nNote: The cell pellets can be stored for 4–5 months if kept at −80°C.\nIsolation of genomic DNA\nTiming: 3 h",
    "In this protocol, the genomic DNA is isolated using a Zymo Quick DNA miniprep kit. Other genomic DNA isolation kit or in-house prepared reagents can be used for isolation, but the quality of genomic DNA plays a major role in PCR and for NGS library preparation.\nBuffer preparation: Add β-mercaptoethanol (BME) to the genomic lysis buffer (Zymo) to a final dilution of 0.5% (v/v). Add 250 μL per 50 mL of BME.\nIsolate genomic DNA from cell pellets collected at day 3 and at day 14 from DMSO control, cisplatin and olaparib treatment.\nThaw the falcon tubes containing cell pellets at room temperature after removing from −80°C freezer.\nAdd 10 mL of Genomic lysis buffer to the cell pellet. Mix completely by vortexing for 10–20 s and mix the entire suspension using a 10 mL serological pipette, then let stand for 5 min at room temperature. Repeat vortexing for 10 s and then let stand for another 5 min at room temperature.\nNote: The solution becomes viscous during lysis step so caution must be taken to reduce loss of sample.\nTransfer 500 μL of the mixture to twenty Zymo-spin IICR columns in collection tubes. Centrifuge at 10000 × g for 4 min and discard the flow through.\nAdd 300 μL of DNA pre-wash buffer to the spin column. Centrifuge at 10000 × g for 2 min and discard the flow through.\nAdd 500 μL of g-DNA wash buffer to the spin column. Centrifuge at 10000 × g for 4 min and discard the flow through.\nCentrifuge the empty column at 10000 × g for 1 min and discard the residual flow through.",
    "Transfer the spin column to a new 1.5 mL microcentrifuge tube. Add 40 μL of nuclease-free water and incubate at room temperature for 5 min to completely saturate the column.\nCentrifuge at 16000 × g for 1 min and collect the genomic DNA from all twenty columns.\nUsing a NanoDrop UV-Vis spectrophotometer quantify the DNA concentration and the quality using A260/280 ratio. For example, using 107 mESCs you would expect a concentration of 350–500 μg/μL in a total volume of 800 μL. (see troubleshooting 4[href=https://www.wicell.org#troubleshooting]).\nStore the genomic DNA at 4°C if used for PCR in a week or store in a −80°C freezer for long-term storage.\nPCR to amplify edited region of interest\nIn this protocol, we have used Platinum Taq Hifi DNA polymerase. Other polymerases can be used but caution must be taken to ensure the Taq polymerase does not introduce nucleotide errors. Screening primers were designed using Primer 3 Plus software such that the amplicon size ranges between 250-450 bp. For screening exon 13 we have used the following primers:\nExon 13_Screening_forward: TTGAGCATCTGTTACATTCACTG.\nExon 13_Screening_reverse: TGAGAAAAGTCTCGTTTTTATAAATGA.\nThe size of the amplicon will be 265 bp.\nPrepare PCR master mix\nLabel 6 tubes corresponding to D1, C1, O1 and D2, C2 and O2 corresponding to DMSO-replicate-1, Cisplatin-replicate-1, Olaparib-replicate-1, DMSO-replicate-2, Cisplatin-replicate-2, Olaparib-replicate-2. Mix the following reagents for each samples using the following reagents-\ntable:files/protocols_protocol_3109_14.csv\nAdd 25 μg of genomic DNA per condition to each tube, vortex the tubes followed by quick spin.\nUsing a stepper pipette add 32 μL of PCR mix into 32 wells of a 96 well plate (as described in Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3109-Fig4.jpg\nFigure 4. Experimental set up for isolating genomic DNA and purification of PCR amplicons",
    "(A) On day 14 post-nucleofection, cell pellets from both replicates (R1 and R2) were collected for each of the following conditions: DMSO treatment, cisplatin treatment, and olaparib treatment. Genomic DNA was isolated from these cell pellets. For each condition, PCR amplification was performed and distributed across 32 wells. A 96-well plate was employed for the PCR, partitioned into three sections, each designated for DMSO, cisplatin, or olaparib. Subsequently, the PCR products were purified, and their separation was achieved through agarose gel electrophoresis and a TapeStation.\n(B) An illustrative electropherogram was provided, demonstrating the successful separation of purified PCR products obtained from the day 14 samples.\nPCR and purification of amplicon.\nSpin the 96 well plate & run on thermocycler using the following program.\ntable:files/protocols_protocol_3109_15.csv\nPause point: At the end of run, quick spin the PCR plates and the plates can be stored at 4°C overnight.\nNote: Hifi Taq polymerase is optimized for 55°C annealing and this temperature must be optimized if different polymerase like Q5 (NEB) is used. The number of cycles must not be increased more than 24 as they may increase the chance of preferential amplification.\nCollect the PCR product from individual wells of a 96 well plate into a 15 mL falcon tube corresponding to individual samples. PCR purify the product using QIAGEN PCR purification kit as per manufacturer’s protocol. https://www.qiagen.com/us/resources/resourcedetail?id=95f10677-aa29-453d-a222-0e19f01ebe17&lang=en[href=https://www.qiagen.com/us/resources/resourcedetail?id=95f10677-aa29-453d-a222-0e19f01ebe17&lang=en].\nNote: PCR primers must be optimized such that a single band of the amplicon is obtained. If multiple bands are observed, then design a new pair of primers or use gel extraction to purify the band of interest.\nElute the PCR product with 30 μL of nuclease-free water and run 2 μL of product on 1% agarose gel to confirm correct size of the amplicon.",
    "The amplicon products are sent for Next Generation Sequencing and DNA libraries are prepared with Illumina adapters."
  ],
  "subjectAreas": [
    "Genomics",
    "Bioinformatics",
    "Crispr",
    "Cancer",
    "Genetics",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}