{
  "id": 8975,
  "origin_website": "Jove",
  "title": "Quantification of Endosome and Lysosome Motilities in Cultured Neurons Using Fluorescent Probes",
  "procedures": [
    "All animal procedures were performed with the approval of the University of Tsukuba Animal Care and Use Committee (IACUC).\n1. Dissection\nTo prepare embryonic day 13-14 ICR or C57BL/6 fetuses, euthanize pregnant mice by cervical dislocation. Remove the uterus and put it into a petri dish with Hank's Balanced Salt Solution (HBSS). Rinse it well to remove the blood.\nUsing forceps, transfer the uterus to a new petri dish with 70% ethanol to sterilize.\nTransfer the uterus to a new petri dish with HBSS. Remove the fetuses from the uterus using sterilized dissecting forceps and surgical scissors.\nDecapitate the fetuses using surgical scissors. Place them into a new petri dish with HBSS.\nRemove the skin and skull and take out the brains using sterilized dissecting forceps. Put them into a petri dish with HBSS.\n\tNOTE: From this step on, it is best to conduct the procedure on a clean bench.\nRemove the meninges using sterilized dissecting forceps under a stereo microscope. Cut off the basal ganglia, hippocampus, and cerebellum using forceps. Using curved-tip forceps, transfer the cortices to a new petri dish with HBSS.\nCollect all cortices using a disposable dropper or a 25 mL pipette. Put them into a 15 mL tube and then remove the HBSS by pipetting.\nAdd 3 mL of cerebral cortical enzyme solution to the tube containing the cortices. Put this tube into a water bath and incubate at 37 °C for 5 min.\n\tNOTE: Prepare a cerebral cortical culture enzyme consisting of Phosphate-Buffered Saline (PBS) with 0.25% trypsin and 1 mM EDTA. Sterilize with a 0.22 µm filter.\nAdd a further 3 mL of cerebral cortical enzyme solution into the tube containing the cortices and incubate at 37 °C in a water bath for an additional 5 min.",
    "Remove the cerebral cortical enzyme solution using a 5 mL pipette and add 5 mL of Dulbecco's Modified Eagle Medium (DMEM) containing 10% Fetal Bovine Serum (FBS).\nDissociate the cortices by gently pipetting up and down using a 5 mL pipette with a sterile P1000 tip. Pipette again using a 5 mL pipette with a P200 tip.\nPut a 40 µm nylon cell strainer on a 50 mL tube and filter the suspension to remove the debris.\nCentrifuge at 420 x g for 5 min at RT and then remove the DMEM medium.\nAdd 5 mL of cerebral cortical culture medium and gently resuspend the cell pellet.\n\tNOTE: Prepare a cerebral cortical culture medium consisting of neuron basal medium supplemented with 1x B-27 supplements, 2 mM L-glutamine, and 100 U/mL penicillin streptomycin.\nCount the cells using a hemocytometer and adjust the cell concentration (as desired) using the cerebral cortical culture medium.\nPlate 3.0 × 106 cortical neurons in 2.0 mL per coated 35 mm glass-bottomed dishes.\n\tNOTE: Before plating, coat the 35mmm glass-bottomed dishes with 0.1 mg/mL Poly-D-Lysine hydrobromide (PDL) or 0.01% Poly-L-Ornithine (PLO). Incubate for 3 h – O/N at 37 °C and wash with PBS at least 3x.\n2. Imaging Vesicle Motility\nPrepare the plasmids that will label each type of vesicle. For instance, use EGFP-Rab5 for early endosomes, EGFP-Rab7 for late endosomes, LAMP-EGFP for lysosomes, and EGFP-LC3 for autophagosomes8,13.\n\tNOTE: These plasmids are available on request from tsuruta.fuminori.fn@u.tsukuba.ac.jp. Typically,3 -5 days in vitro (DIV) neurons can be transfected with these plasmids using transfection reagents.\nMix 4.0 µg of plasmids with 200 µL of serum-free medium by pipetting. In a separate tube, dilute 8 µL of transfection reagent (see Table of Materials) in 200 µL of serum-free medium. Incubate for 5 min at RT.",
    "Mix the plasmid solution and transfection regent solution in step 2.2 by pipetting. Incubate for 20 min at RT.\nAdd serum-free medium and 400 µL of the plasmid solution from step 2.3 to each coated glass-bottom dish. Incubate the neurons at 37 °C in a 5% CO2 incubator for 30 min. Replace the medium with 2 mL of cerebral cortical culture medium. Incubate the neurons at 37 °C in a 5% CO2 incubator for 1-2 days.\nAfter 1 - 2 d of transfection, select the transfected cells for image acquisition.\n\tNOTE: Premature neurons less than 7 DIV have a tendency to exhibit dynamic vesicle motility. Select neurons that moderately express the fluorescence probe because clear images cannot be obtained when a highly expressing neuron is selected. Also, select a typical neuronal shape, such as pyramidal neurons, which have long axons and intricate dendrites, for ease of identification of the axon and dendrites (see Figure 1A).\nImage acquisition using a time-lapse imaging system:\n\tFor imaging, use a fluorescence microscope equipped with a Charge-Coupled Device (CCD) camera with 40X Plan Apo 0.95NA or 100X Plan Apo VC NA1.4 objective lenses. Control the temperature at 37 °C using an incubation system. Acquire neuron images at one frame/5 s over a 100 s period controlled by the image acquisition software. Alternatively, acquire images at shorter intervals and for longer time periods, such as at one frame per 2 s over a 300-s period.\n\tNOTE: A variety of applications are available for taking sequential images, many of which would be suitable for this method. Therefore, no particular application is recommended; rather, each researcher should use whatever application is available.\n3. Image Analysis\nOpen all sequential images in ImageJ software with Manual Tracking14.",
    "NOTE: To date, Manual Tracking has been widely used in tracking experiments15,16,17,18,19. Manual Tracking was developed by Dr. Fabrice Cordelières. Detailed written instructions are available online20. For the analysis, the quality of the imaging data is improved with a sufficient number of images. It is recommended to use more than 20 images.\nTo combine the sequential images, choose <Image> → <Stacks> → <Images to Stack>. Click <OK>.\nChoose <Plugins> → <Manual Tracking>; a tracking window will pop up.\nClick on the checkbox of <Show Parameters?> and define the tracking parameters in the parameters section.\n\tNOTE: Several parameters can be set, including time interval, x/y calibration, z calibration, search square size for centering, dot size, line width, and font size. In this simplified assay, both time interval and x/y calibration were defined. Under other experimental circumstances, it may be necessary to define other parameters as well. The parameters used here are as follows: the <Time interval> is 5 s, and the <x/y calibration> is either 0.26642 µm for a 40X Plan Apo 0.95NA objective lens or 0.10657 µm for a 100X Plan Apo VC NA1.4 objective lens.\nAfter the parameters are defined, click on <add Track> to start a new track.\nAfter determining the vesicles of interest (e.g., the vesicles indicated by blue and red arrowheads in Figure 1A (right panel)), click on the center of the signals in the sequential images to record the xy coordinates. The results of the recorded xy coordinates, distance, and velocity show up in a new window.\n\tNOTE: In the case of lysosomes, large bright fluorescent signals (e.g., Figure 1A (right panel), orange arrowhead) are often observed in neurons. As these signals occasionally exhibit either accumulated vesicles or pathological varicosities, these signals should be avoided for quantifying motility.",
    "Repeat step 3.6 to collect the xy coordinates of vesicles from all sequential images; each image automatically advances to the successive image after the reference point is selected.\nExport these data to a new table (e.g., a spreadsheet). Use an appropriate software to create a suitable graph (see Table of Materials).\n\tNOTE: To analyze the data, select the <Distance> column, sum up all values of this column, and show a motility distance as a bar graph, such as in Figure 1B. Additionally, repeat this step, calculate the average of the total motility distance, and show as a bar graph, as in Figure 1C. The software to create a bar graph and waveform data are shown in the Table of Materials.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}