{
  "id": 2613,
  "origin_website": "Cell",
  "title": "Protocol for laser-induced chronic ocular hypertension and intracameral injection in nonhuman primates",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1: Laser-induced COHT in nonhuman primates\nTiming: 30–60 min (for step 1)\nThis section presents the detailed procedures to create a COHT model in rhesus monkeys by laser photocoagulation of the trabecular meshwork.\nAnesthesia and eye treatment for pupil contraction.\nAfter 6–8 h of fasting, perform deep general anesthesia via an intramuscular anesthesia of ketamine hydrochloride (5 mg/kg) plus medetomidine (0.05 mg/kg).\nNote: This procedure is performed by a veterinarian.\nAdminister pilocarpine nitrate eye drops (Zhenrui ®; Bausch & Lomb, China) locally for pupil contraction.\nNote: The lacrimal sac area should be pressed after the local application of the pilocarpine nitrate eye drops, and the drug should not be used too many times (using 1–2 drops of mydriasis medicine 10–15 min before photocoagulation is recommended), so as to prevent excessive secretion of saliva, which might affect respiration. After 10–15 min, the pupil shrinks to 1–2 mm.\nUse Oxybuprocaine Hydrochloride Eye Drops (Santen Pharmaceutical Co., Ltd, Japan) locally for topical anesthesia.\nPositioning fixation.\nPosition the rhesus monkey subsequently as shown in Figure 1[href=https://www.wicell.org#fig1]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2110-Fig1.jpg\nFigure 1. Methods of laser-induced COHT model\n(A) An operation picture of laser photocoagulation in a rhesus monkey.\n(B) Anterior chamber angle structure of rhesus monkey and positioning of trabecular meshwork under gonioscopy using a smartphone camera. Scale bar 1 mm.\n(C) A diagram of anterior chamber angle structure in rhesus monkeys.\n(D) The laser spot location and a bubble generation.\nNote: A researcher is required to help fix the rhesus monkey head position to facilitate the examination and operation.\nLaser photocoagulation.\nAfter placing the gonioscope, photocoagulate the whole middle trabecular meshwork of the rhesus monkeys in a dark room by a TX532 laser photocoagulation instrument (Oculight TX; IRIDEX).",
    "The laser parameters are as follows: 50 μm spot size, 0.1–0.5 s duration, and 800–1,000 mW laser power.\nLocate the trabecular meshwork accurately (Figures 1[href=https://www.wicell.org#fig1]B and 1C).\nNote: The structure of the rhesus monkeys' anterior chamber angle is similar to that in humans. To ensure an optimal tissue response, it is essential to accurately focus the aiming beam on the trabecular meshwork (a well-defined dot).\nAdjust laser power and exposure time according to the spot’s reaction.\nNote: The optimal signs of a successful trabecular meshwork reaction after the photocoagulation include whitening, slight shrinkage, depigmentation at the points, and particularly the generation of a bubble (Figure 1[href=https://www.wicell.org#fig1]D).\nTreatment in the 360° range.\nNote: It usually requires 150–250 continuous and non-overlapping light spots on the trabecular meshwork. Histopathological analysis showed that there was still some remaining trabecular meshwork and Schlemm's canal with light structural damage, which might still have a partial function, although laser photocoagulation of the middle trabecular meshwork was performed in the entire circumference (Sun et al., 2022[href=https://www.wicell.org#bib14]).\nAvoid photocoagulation in blood vessels.\nNote: If bleeding occurs, press the gonioscope at the corresponding direction to the bleeding for a short time (just a few seconds) to stop bleeding.\nThe focus avoids damage to the ciliary body band.\nNote: It may lead to partial cyclodialysis, which makes it difficult to increase IOP.\nPostoperative medication.\nTopical application of Tobramycin and Dexamethasone Eye Ointment (Tobramycin®; Alcon, USA) and Compound Tropicamide Eye Drops (Zhuobian®; Sinqi, China) for 3–7 days after photocoagulation can alleviate non-infectious inflammation.\nNote: Significant fibrous exudation in the anterior chamber usually occurs on the first postoperative day.\nMonitor IOP changes.\nMeasure IOP in a specific time window (10–12 a.m.) on the first day after photocoagulation and every 3–7 days.",
    "Note: IOP is likely to be lower than normal on the first postoperative day.\nRepeat photocoagulation if necessary.\nIf the IOP is not consistently increased (>21 mmHg), repeated photocoagulation is required at intervals of three weeks.\nNote: The baseline IOP of rhesus monkeys is similar to that of humans (Lin et al., 2021[href=https://www.wicell.org#bib6]; Pasquale et al., 2021[href=https://www.wicell.org#bib8]; Quigley and Hohman, 1983[href=https://www.wicell.org#bib10]; Tu et al., 2019a[href=https://www.wicell.org#bib16], Tu et al., 2019b[href=https://www.wicell.org#bib17]).\nIt is generally necessary to perform 2–4 laser photocoagulation sessions.\nNote: It is usually difficult to obtain continuous high IOP (>21 mmHg at least for 1 month) after one-time laser photocoagulation according to previous literature and based on our experience (Quigley and Hohman, 1983[href=https://www.wicell.org#bib10]; Sun et al., 2022[href=https://www.wicell.org#bib14]; Tu et al., 2019a[href=https://www.wicell.org#bib16]). High IOP usually occurs 1–2 weeks after the second photocoagulation session, and some eyes may gradually return to the normal IOP range after 1–2 weeks, and require further laser photocoagulation, while others may maintain high IOP for several weeks to several months. In addition, locating the trabecular meshwork is more accurate and simpler when laser photocoagulation is repeated, especially in the inferior of globe, where there are more pigments attached to the trabecular meshwork (pigment particles from the previous photocoagulation accumulated here).\nCritical: Use Levofloxacin Hydrochloride Eye Gel locally in both eyes to keep the ocular surface hydrated and prevent infection during anesthesia. It is recommended to use covers and bedding made of disposable sterile surgical towels for the operated monkey to keep rhesus monkeys warm throughout the process.\nPart 2: Intracameral injection\nTiming: 10–20 min (for step 7)\nAfter successfully established COHT model in rhesus monkeys, this section provides detailed steps for intracameral injection of anti-glaucoma drugs.\nSlit-lamp biomicroscopy examination before intracameral injection.\nVerify that rhesus monkeys are free from infectious inflammation such as conjunctivitis, keratitis, and dacryocystitis.",
    "Prepare drugs to be validated according to experimental requirements.\nIκBα-siRNA plus Lipofectamine® RNAiMAX Reagent were used in our study.\nAnesthesia.\nAfter 6–8 h of fasting, perform intramuscular anesthesia by a veterinarian, and then use Oxybuprocaine Hydrochloride Eye Drops for topical anesthesia.\nPositioning fixation.\nPlace the rhesus monkey in a supine position on the operating table, and position the sterile sheet (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2110-Fig2.jpg\nFigure 2. Procedure of intracameral injection\n(A) Intracameral injection operation.\n(B) Using antibiotic eye drops to prevent infection.\n(C) Local disinfection.\n(D) Needle tip position in intracameral injection. Scale bar 1 mm.\n(E) Using antibiotic eye ointment after operation.\nPreoperative measures to prevent ocular infection.\nAdminister Tobramycin Eye Drops (Tobrex®, Alcon, USA) topically (Figure 2[href=https://www.wicell.org#fig2]B).\nUse an eye speculum (Suzhou Mingren, China) to open the upper and lower eyelids of the rhesus monkey after disinfecting the periorbital skin;\nAdd povidone iodine to the conjunctival sac to completely cover the conjunctiva and cornea for 1 min (Figure 2[href=https://www.wicell.org#fig2]C), and rinse the conjunctival sac with a large amount of normal saline.\nIntracameral injection.\nFix the eyeball with ophthalmic microforceps (Xiehe Medical Instruments, China) under the ophthalmic surgical microscope (Carl Zeiss, Germany).\nUse an insulin syringe and insert the needle approximately 1 mm along the corneal tangent direction on the contralateral upper temporal or nasal side and then parallel to the iris to create a self-sealing opening.\nNote: Keep away from limbal vessels during puncture to avoid bleeding. Besides, keep the bevel oriented upward (toward the corneal endothelium) into the anterior chamber to avoid damage to the cornea, iris, and lens.\nInsert 1 mm inside the limbal of the cornea to release about 40 μL of aqueous humor by siphoning through an empty needle.",
    "Note: The speed of anterior chamber paracentesis should be slow, to avoid the sudden shallowing of the anterior chamber and scratching the iris and lens with the tip of the needle.\nDeliver the drug to the anterior chamber using a Hamilton glass syringe (50 μL volume) with a 30G sharp needle (Hamilton, Reno, NV, USA) or insulin syringe through the same puncture port (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: The inclined plane of the needle should be inserted completely into the anterior chamber, not too deep, keeping the tip of the needle over the iris and not over the pupil. The intracameral injection speed should not be too fast, avoiding the anterior chamber deepens suddenly, so as to lest the anterior chamber fluctuation, and the lens-iris diaphragm moves back sharply.\nWithdrawing the needle.\nGently withdraw the needle and massage the puncture port with ophthalmic microforceps to prevent or minimize the efflux of aqueous humor containing drugs.\nPostoperative medication.\nAdminister Tobramycin Eye Ointment (Tobrex®, Alcon, USA) topically to prevent ocular infection and, finally, remove the eyelid opener (Figure 2[href=https://www.wicell.org#fig2]E).\nApply Tobramycin Eye Ointment locally for 7 days after intracameral injection."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}