{
  "id": 5215,
  "origin_website": "Bio",
  "title": "Cytohistological Analyses of Mega-sporogenesis and Gametogenesis  in Ovules of <em>Limonium</em> spp.",
  "procedures": [
    "Collect flower buds at different developmental stages ranging from 2 to 6 mm in length (Figure 1A, left – young stage; right – mature stage) using forceps. Flower buds are fixed in 1 ml FAA solution in a watch glass for 24 h at 4 °C. The fixed material may be stored in 1 ml 70% ethanol at -20 °C until use for 3 months. To this end, after fixation the flower buds should be dehydrated in a series of water/ethanol (v/v) solutions, 30%, 50%, 70%, shaking for 30 min each before storage.Note: As the flowering season occurs during a short period of the year, storage can be useful to save flower buds for further use.Dissect pistils from flower buds with forceps onto a microscope slide using a stereomicroscope. Make a sharp longitudinal incision in the ovary (Figure 1B, incision arrowed) with a needle to help subsequent ovule fixation in 1 ml FAA solution for 14-18 h, at 4 °C.Note: Alternatively, big ovaries (> 5 mm) can be dissected directly in a drop (5 μl) of FAA, and then proceed to step 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161027/20161027192330_2316.jpg Figure 1. Dissection procedure and obtainment of digested ovules of Limonium spp. A. Flower buds at different developmental stages ranging from 2 to 6 mm (Figure 1A: left – young stage; right – mature stage). B. Pistil showing a longitudinal incision in the ovary (arrowed). C. Stained ovule immediately after dissection. D. Digested ovule mounted in a drop of chloral hydrate, in well of a multiwell slide.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20161027/20161027192411_6497.jpgFigure 2. Examples of meiotic and ameiotic ovules and embryo sacs cleared in chloral hydrate and observed under differential interference contrast (DIC) optics. Figures A-E show sexual diploid (2n = 2x = 16) Limonium ovalifolium plants: accession numbers 2009I4SR (Sra.",
    "Remédios, Peniche), and 2009I1PL (Praia da Luz, Lagos), 2009I1PL (Praia da Luz, Lagos). Figures F-J were taken from apomictic tetraploid (2n = 4x = 35, 36) Limonium multiflorum plants: accession numbers 2009I4VF (Vale dos Frades, Lourinhã), 2009I9CR (Cabo Raso, Cascais), 2009I4VF (Vale dos Frades, Lourinhã). A. Megaspore mother cell at interphase with one nucleolus (arrowed). B. Coenomegaspore with four unreduced nuclei, each nucleus with two nucleoli (arrowed) (4-nucleated stage; tetrasporic development). C. Coenomegasporocyte at the beginning of gametogenesis with a cruciate nuclear arrangement. D. Megaspores in a bipolar 1 + 3 arrangement (arrowed) with the embryo sac showing extended vacuolization. E. Detail of an embryo sac of Adoxa-type with the egg cell and inferior polar nuclei arrowed. F. Megasporocyte within ovule showing one nucleolus (arrowed). G. Restitution nuclei after first meiotic division (meiotic diplospory). Nucleoli with distinct dimensions within the same nucleus are arrowed. H. Coenomegasporocyte at the beginning of gametogenesis. I. Detail of the egg cell apparatus (encircled by dashed lines) in a mature embryo sac; antipodal cells towards the chalazal pole are arrowed. J. Parthenogenetic embryo formation within a mature sac. Bars = 10 μm.Note: Each image is oriented so that the micropyle is towards the top of the page and the chalaza is towards the bottom. Figures abbreviations: e – embryo; ii – integuments; n – nucleus; nl – nucleolus; nc – nucellus; rn – restitution nucleus; Syn – synergid.Afterwards, hydrate pistils in watch glasses in a series of progressive 1 ml water/ethanol solutions, 50%, 75% and 100%, shaking for 30 min each.Stain pistils with 1 ml pure Hemalum Mayer’s solution for 24-48 h in a watch glass, and then place them in 1 ml 0.1% chloral hydrate in a new watch glass during 1-2 h, at room temperature.",
    "Note: If the ovaries are small (< 3 mm) 24 h in the staining solution are required; for bigger ones 48 h may be needed. Thereafter, dissect ovules from ovaries (Figure 1C) onto a glass slide under a stereomicroscope. Then, place them in a watch glass for digestion with 500 μl of an enzyme mixture 2% (w/v) cellulase, 2% (w/v) cellulase ‘Onozuka R-10’, and 2% (v/v) pectinase in 1x EB, for 10 (young stages) to 20 min (mature stages) at 37 °C, inside a box on a paper humidified with distilled water.Remove the enzyme mixture by a micropipette and wash ovules in a watch glass, in 1 ml 1x EB solution for 3-5 min, at room temperature.Finally, mount ovules in multiwell slides in a drop (5 μl) of chloral hydrate, under a coverslip (Figure 1D). When the procedure is completed, cytohistological observations are made using a fluorescence microscope with DIC optics using 20x and 100x objectives (Figure 2).Images are collected with a digital camera and if necessary further processed using Adobe Photoshop 5.0."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}