{
  "id": 1823,
  "origin_website": "Cell",
  "title": "Acquisition, processing, and single-cell analysis of normal human breast tissues from a biobank",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFigure 1[href=https://www.wicell.org#fig1] provides a schematic view of major steps associated with this protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1302-Fig1.jpg\nFigure 1. Complete overview of the study starting with tissue collection to data analysis\nLIQ, Lower Inner Quadrant; LOQ, Lower Outer Quadrant; UIQ, Upper Inner Quadrant; UOQ, Upper Outer Quadrant.\nBreast tissue collection\nTiming: 30 min\nBreast Tissue is acquired following proper consent, medical questionnaire, risk review and eligibility confirmation from the healthy volunteer donors during a Komen Tissue Bank collection event. https://komentissuebank.iu.edu/donate-tissue/donation-procedure.php[href=https://komentissuebank.iu.edu/donate-tissue/donation-procedure.php]. Necessary tubes, labelling material for cryopreservation, and growth media for cryopreservation are prepared prior to the tissue collection event. However, cryopreservation media (50% growth media plus 50% BioWhittaker cryoprotective media) is made fresh the day of tissue collection.\nTake a predetermined number of core samples from the upper outer quadrant of the normal breast, (donor and/or MD choice left or right), using the ATEC® Breast Biopsy System (Hologic Inc.) and ATEC 9G × 12 cm biopsy needle (Figure 1[href=https://www.wicell.org#fig1]). Breast tissue volume from this Bx system averages 120 mg/core based on our lab measurements.\nRemove the cores from the biopsy hand piece, place them on telfa pad, spray with wound wash saline and place into a specimen cup. Then, transport the cores to the tissue processing area within 10 min (or less) of procurement.\nImmediately place one core in a 50 mL conical tube prepared with 5 mL Lonza BioWhittaker Cryoprotective Media for cryopreservation processing.\nIf a fresh core is requested, place one core in a 50 mL conical tube prepared with 5 mL researcher provided growth media described above.\nCryopreservation of normal breast tissue\nTiming: 5 h\nCryopreservation of a single approximately 120 mg core of normal breast tissue into 3 aliquots.",
    "In a sterile environment, pour the growth media with a single core sample into a fresh sterile petri dish. Transfer the core to the petri dish lid or a new dish to separate the core from the media.\nWith a sterile scalpel, cut the core into multiple small pieces (<2 mm).\nUsing sterile forceps, divide the cut pieces into 3 equal aliquots. Add each tissue aliquot to one of three labelled cryotubes prepared with 1 mL Freezing Media.\nDiscard media remaining in the petri dish into a media waste bottle.\nPlace the 3 cryotubes with tissue and freezing media into slots in a Corning® CoolCell FTS30 Cryo Container following manufacturer instructions for controlled-rate freezing. Once the cryo-container is full (30 tubes/10 tissue samples) it is placed into dry ice until it can be transferred to the −80°C freezer. If less than 30 vials are to be frozen, fill the empty positions with blanks containing 1 mL freezing media. Our collection event typically collects tissues from ∼100 donors in six hours and all can be cryopreserved.\nAfter at least 4 h in −80°C, or within one week, transfer cryotubes to Liquid Nitrogen vapor phase freezer for long term storage (−140°C to −190°C).\nPreparing single cells from cryopreserved or freshly collected breast biopsies\nTiming: 4 h\nThaw cryopreserved tissue in a 37°C water bath with rigorous shaking for 3–5 min. As with cell lines, thawing has to be quick.\nTransfer tissue to petri dish with 30 mL of PBS using a forceps. Wash tissues by shaking in PBS for 10 s. Transfer tissues to the petri dish lid or a new petri dish.\nChop tissues into tiny pieces using a scalpel or blade.\nUse human tumor dissociation kit (Miltenyi Biotec) to dissociate the tissue.",
    "To remove erythrocytes, add 10 mL 1× red blood cell lysis solution (Miltenyi Biotec) and follow the protocol from Miltenyi Biotec for red blood cell lysis (https://www.miltenyibiotec.com/upload/assets/IM0022139.PDF[href=https://www.miltenyibiotec.com/upload/assets/IM0022139.PDF]).\nExamine cells under the microscope for live cells and debris. We use DeNovix cell drop FL (Fluorescence cell counter) for both live cell counting and debris visualization. If a lot of debris is still left, filter the sample through 30 μm filters from Celltrics. If still dead cells are left, use the dead cell removal kit from Miltenyi Biotec and follow their protocol (https://www.miltenyibiotec.com/upload/assets/IM0013462.PDF[href=https://www.miltenyibiotec.com/upload/assets/IM0013462.PDF]).\nCount the cell number. Resuspend cells at 700–1200 cells per microliter.\nFollow the 10× Genomics protocol for chromium next GEM (Gel Bead-in-Emulsion) single cell 3′ kit (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v3-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v3-chemistry]).\nSingle cell cDNA synthesis\nTiming: 2 h, 8 samples can be run at a time, but our experience is up to four samples at a time\nSingle cell cDNA preparation is performed as per protocol described in the 10× Genomics protocol for chromium next GEM single cell 3′ kit without any modifications. Although the protocol suggests using ∼1200 cells per microliter for targeted recovery of 10,000 cells, we have performed the assays with cells as low as 100 cells per microliter for targeted cell recovery of 2000 cells.\nCritical: The protocol describes with figures where this process can go wrong. Reagents need to be added in a specified row and in a specific order for GEM generation. After the run, check the volume in row 3. Less than 100 μL of GEMs in row 3 indicates a clog in wells of row 1 or row 2.\nGEM-RT cleanup and cDNA amplification\nTiming: 1.5 h\nPerform GEM-RT Cleanup and cDNA amplification as described in the 10× Genomics protocol for chromium next GEM single cell kit (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v3-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v3-chemistry]).\ncDNA cleanup, QC and quantification",
    "Timing: 1 h\nPerform cDNA cleanup as per the protocol described in the 10× Genomics protocol for chromium next GEM single cell kit.\nPerform Quality Control (QC) and quantification using the Agilent Bioanalyzer High Sensitivity kit and reagents (https://www.agilent.com/en/product/automated-electrophoresis/bioanalyzer-systems/bioanalyzer-dna-kits-reagents/bioanalyzer-high-sensitivity-dna-analysis-228249[href=https://www.agilent.com/en/product/automated-electrophoresis/bioanalyzer-systems/bioanalyzer-dna-kits-reagents/bioanalyzer-high-sensitivity-dna-analysis-228249]). Assays are done as per manufacturer’s instructions (https://www.agilent.com/cs/library/usermanuals/public/HighSensitivity_DNA_KG.pdf.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/HighSensitivity_DNA_KG.pdf.pdf]). Representative cDNA prep quality is shown in Figure 2[href=https://www.wicell.org#fig2]. Size of cDNA ranged from 500 bp to 10,000 bp.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1302-Fig2.jpg\nFigure 2. Quantification and quality assessment of single cell cDNA\nThe majority of cDNAs were 500–2000 bp long. The bottom panel shows distribution patterns of cDNAs based on size. BP, base pair.\n3′ gene expression dual index library construction\nTiming: 4 h\nPrepare Index library using the protocol suggested by 10× Genomics without any modifications (https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v3-chemistry[href=https://support.10xgenomics.com/single-cell-gene-expression/library-prep/doc/user-guide-chromium-single-cell-3-reagent-kits-user-guide-v3-chemistry]).\nDetermine fragment size using the Agilent Bioanalyzer High Sensitivity kit and reagents. Representative library size is shown in Figure 3[href=https://www.wicell.org#fig3] (400–600 base pair range).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1302-Fig3.jpg\nFigure 3. Quantification and quality assessment of 3′ Gene Expression dual index library before sequencing\n(A) Gel electrophoresis of the library.\n(B) Size distribution of DNA in the library. Peak size was 500 bp.\nSequencing, mapping and data analysis\nSequencing and data analysis\nSequence the final libraries on a NovaSeq 6000 (Illumina) with the sequencing configuration: read 1, 26 or 28 cycles; i7 index read, 8 cycles; read 2, 91 cycles.",
    "After the sequence data are generated, use CellRanger mkfastq (https://support.10xgenomics.com/single-cell-gene-expression/software/pipelines/latest/using/mkfastq[href=https://support.10xgenomics.com/single-cell-gene-expression/software/pipelines/latest/using/mkfastq]) to demultiplex the raw base sequence calls into sample-specific FASTQ files. Apply cellranger count (https://support.10xgenomics.com/single-cell-gene-expression/software/pipelines/latest/using/count[href=https://support.10xgenomics.com/single-cell-gene-expression/software/pipelines/latest/using/count]) to align the data to the human reference genome GRCh38 and generate gene-cell barcode count matrices. Cellranger count was run on the Indiana University’s high-throughput computing clusters with 8 cores and memory of 64 G. In most cases, the default parameters are sufficient. To download and install Cell Ranger, there are detailed step-by-step instructions at the 10× genomics website (https://support.10xgenomics.com/single-cell-gene-expression/software/pipelines/latest/installation[href=https://support.10xgenomics.com/single-cell-gene-expression/software/pipelines/latest/installation]).\nUse Seurat v3 (Butler et al., 2018[href=https://www.wicell.org#bib2]; Stuart et al., 2019[href=https://www.wicell.org#bib12]) (https://satijalab.org/seurat/index.html[href=https://satijalab.org/seurat/index.html]) to further analyze the filtered gene-cell barcode matrices generated with CellRanger. The following steps are performed for each dataset:\nFirst step is to implement quality control (QC) of the data using the isOutlier function from the R package scatter (McCarthy et al., 2017[href=https://www.wicell.org#bib8]) (https://github.com/jimhester/scater[href=https://github.com/jimhester/scater]) together with visual inspection of the distributions of number of genes, Unique Molecular Identifiers (UMIs), and mitochondrial gene content. One can follow the Seurat tutorial for single sample analysis at https://satijalab.org/seurat/articles/pbmc3k_tutorial.html[href=https://satijalab.org/seurat/articles/pbmc3k_tutorial.html].\nNormalize the gene expression levels for each cell with the Normalize Data function (normalization.method = “LogNormalize”) in Seurat. Default parameters can be applied.\nIdentify highly variable features using the FindVariableFeatures function in Seurat. Default parameters can be applied.\nTo integrate the single cell data from individual donor samples, the following steps are performed (Seurat tutorial for integration analysis: https://satijalab.org/seuratarticles/integration_introduction.html[href=https://satijalab.org/seuratarticles/integration_introduction.html]):\nApply functions FindIntegrationAnchors and IntegrateData from Seurat.\nScale the integrated data and run principal component analysis (PCA) with the Seurat functions ScaleData and RunPCA. Determine the appropriate number of PCs to use.",
    "Carry out graph-based clustering analysis. Identify clusters with the Seurat functions FindNeighbors and FindClusters using a resolution of 0.8 and 36 PCs. Don’t want to over-cluster or under-cluster the cells. However, there is no easy way to determine the number of dimensions to use. Different resolutions and number of PCs can be tried. There are few recommendations in the Seurat website (https://satijalab.org/seurat/articles/pbmc3k_tutorial.html[href=https://satijalab.org/seurat/articles/pbmc3k_tutorial.html]).\nDetect cell type marker genes with the Seurat function FindConservedMarkers.\nVisualize cell clusters using the Uniform Manifold Approximation and Projection (UMAP). A representative UMAP is shown in Figure 4[href=https://www.wicell.org#fig4]. Please also refer to Figures 1[href=https://www.wicell.org#fig1]A, 3[href=https://www.wicell.org#fig3]C, and 4[href=https://www.wicell.org#fig4] of Bhat-Nakshatri et al. for detailed UMAP of breast tissue (Bhat-Nakshatri et al., 2021[href=https://www.wicell.org#bib1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1302-Fig4.jpg\nFigure 4. A representative UMAP of breast tissues obtained from a 35 years-old woman of European Ancestry.\nAnnotate cell clusters using the cell-type specific marker genes identified and known canonical marker genes. For example, for breast epithelial cells, CD49f/EpCAM expression pattern can classify them into basal (CD49f+/EpCAM-), luminal progenitor (CD49f+/EpCAM+), and mature luminal (CD49f-/EpCAM+) cells (Lim et al., 2009[href=https://www.wicell.org#bib5]; Visvader and Stingl, 2014[href=https://www.wicell.org#bib14]). Further validation of this classification could be achieved based on the expression patterns of ESR1 and FOXA1 (mature luminal), CD117, ELF5, and EHF (luminal progenitor) and TP63 and NFIB (basal cells) (Lim et al., 2009[href=https://www.wicell.org#bib5], 2010[href=https://www.wicell.org#bib6]; Pellacani et al., 2016[href=https://www.wicell.org#bib11]). Similarly endothelial cells can be annotated using PECAM, CDH5 and VWF expression pattern (Zhao et al., 2021[href=https://www.wicell.org#bib16]). Fibroblasts can be annotated using Collagen 1A2 (COL1A2) and COL3A1 expression pattern (Muhl et al., 2020[href=https://www.wicell.org#bib9]). Adipocytes express ADIPOQ and Apolipoprotein E (APOE) (Zhong et al., 2020[href=https://www.wicell.org#bib17]).\nUse R packages ggplot2 (Wickham, 2016[href=https://www.wicell.org#bib15]) and Seurat FeaturePlot to generate plots of specific genes."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Sequence Analysis",
    "Health Sciences",
    "Cancer",
    "Cell Biology",
    "Molecular Biology",
    "Gene Expression",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}