{
  "id": 16654,
  "origin_website": "Jove",
  "title": "Spectrophotometric Methods for the Study of Eukaryotic Glycogen Metabolism",
  "procedures": [
    "1. Determination of glycogen synthase activity\nPrepare stock solutions of required reagents as indicated in Table 1 (prior to the experimental day).\ntable:\n﻿0,1,2\nComponent,Directions,Directions\n50 mM Tris pH 8.0,Dissolve 0.61 g of Tris base in ~ 80 mL of water. Chill to 4 °C. Adjust the pH to 8.0 with HCl and make the volume up to 100 mL with water.,Dissolve 0.61 g of Tris base in ~ 80 mL of water. Chill to 4 °C. Adjust the pH to 8.0 with HCl and make the volume up to 100 mL with water.\n20 mM HEPES buffer,Dissolve 0.477 g of HEPES in ~ 80 mL of water. Adjust the pH to 7.0 with NaOH and make up the volume to 100 mL with water.,Dissolve 0.477 g of HEPES in ~ 80 mL of water. Adjust the pH to 7.0 with NaOH and make up the volume to 100 mL with water.\n132 mM Tris/32 mM KCl buffer pH 7.8,Dissolve 1.94 g of Tris base and 0.239 g of KCl in ~90 mL of water. Adjust pH to 7.8 with HCl and make up the volume to 100 mL with water.,Dissolve 1.94 g of Tris base and 0.239 g of KCl in ~90 mL of water. Adjust pH to 7.8 with HCl and make up the volume to 100 mL with water.\n0.8% w/v oyster glycogen,Weigh out 80 mg of oyster glycogen and add to water. Make the final volume up to 10 mL with water and warm gently/mix to fully dissolve glycogen.,Weigh out 80 mg of oyster glycogen and add to water. Make the final volume up to 10 mL with water and warm gently/mix to fully dissolve glycogen.",
    "100 mM UDP-glucose,\"Dissolve 0.31 g of UDP-glucose in water and make the final volume up to 1 mL. Store in aliquots, frozen at -20 °C. Stable for several months.\",\"Dissolve 0.31 g of UDP-glucose in water and make the final volume up to 1 mL. Store in aliquots, frozen at -20 °C. Stable for several months.\"\n50 mM ATP,Dissolve 0.414 g of ATP in ~ 13 mL of water. Adjust the pH to 7.5 with NaOH and make up the volume to 15 mL with water. Store in aliquots frozen at -20 °C. Stable for several months.,Dissolve 0.414 g of ATP in ~ 13 mL of water. Adjust the pH to 7.5 with NaOH and make up the volume to 15 mL with water. Store in aliquots frozen at -20 °C. Stable for several months.\n100 mM glucose-6-phosphate pH 7.8,Dissolve 0.282 g of glucose-6-phosphate in ~ 7 to 8 mL of water. Adjust the pH to 7.8 with NaOH. Make the volume up to 10 mL with water. Store frozen in aliquots at -20 °C. Stable for at least six months.,Dissolve 0.282 g of glucose-6-phosphate in ~ 7 to 8 mL of water. Adjust the pH to 7.8 with NaOH. Make the volume up to 10 mL with water. Store frozen in aliquots at -20 °C. Stable for at least six months.\n40 mM phosphoenolpyruvate,Dissolve 4 mg of phosphoenolpyruvate in 0.5 mL of 20 mM HEPES buffer pH 7.0. Store at -20 °C. Stable for at least 1 week.,Dissolve 4 mg of phosphoenolpyruvate in 0.5 mL of 20 mM HEPES buffer pH 7.0. Store at -20 °C. Stable for at least 1 week.\n0.5 M MnCl2,Dissolve 9.90 g of MnCl2 in a final volume of 100 mL water.,Dissolve 9.90 g of MnCl2 in a final volume of 100 mL water.",
    "NDP kinase,\"Reconstitute lyophilized powder with sufficient water to give 1 U/µl solution. Prepare aliquots, freeze in liquid nitrogen, and store at -80 °C. Stable for at least 1 year.\",\"Reconstitute lyophilized powder with sufficient water to give 1 U/µl solution. Prepare aliquots, freeze in liquid nitrogen, and store at -80 °C. Stable for at least 1 year.\"\nTable 1: Stock solutions required for the assay of glycogen synthase activity.\nOn the day of the assay, prepare a fresh working solution of 4 mM NADH by dissolving 4.5 mg of NADH in 1.5 mL of 50 mM Tris-HCl, pH 8.0. Store on ice, protected from the light.\nThaw stock solutions of UDP-glucose, ATP, phosphoenolpyruvate, and NDP kinase on ice.\nPre-heat a water bath to 30 °C.\nSet up each glycogen synthase assay in a 1.5 mL tube by adding the reaction mixture reagents listed in Table 2.\ntable:\n﻿0,1\nComponent,Volume (µl)\n160 mM Tris/32 mM KCl buffer pH 7.8,250\nWater,179\n\"100 mM glucose-6-phosphate, pH 7.8\",58\n0.8 % w/v oyster glycogen,67\n50 mM ATP,80\n4 mM NADH,80\n100 mM UDP-glucose,28\n40 mM phosphoenolpyruvate,20\n0.5 M MnCl2,8\nFinal volume,770\nTable 2: Composition reaction mixture for assay of glycogen synthase activity.\nNOTE: To facilitate the set-up, a master mix can be made containing enough of each of the above-listed reagents to complete the number of assays planned.\nPrepare a blank reaction, where the NADH in the above mixture is replaced with water. Transfer to a disposable methacrylate cuvette and use this to set the zero on the spectrophotometer at 340 nm.\nTake one 770 µL of the aliquot of reaction mixture in a 1.5 mL tube. Add 2 µL of NDP kinase and 2 µL of pyruvate kinase/lactate dehydrogenase mixture, mix gently, and incubate at 30 °C for 3 min to pre-warm the reaction mixture.",
    "Add 30 µL of the sample containing glycogen synthase in 20 mM Tris buffer, pH 7.8; mix, and transfer the reaction mixture to a disposable methacrylate cuvette.\nPlace the cuvette into the spectrophotometer and record the absorbance at 340 nm at timed intervals for 10 to 20 min. Plot the absorbances obtained against time.\n\tNOTE: A reaction in which the glycogen synthase sample is replaced with 20 mM Tris buffer should be conducted to control for non-enzymatic oxidation of NADH. Depending upon the purity of the sample, other control reactions may be required. See Discussion for details.\nDetermine the reaction rate (see Results for details).\n2. Determination of glycogen phosphorylase activity\nPrepare stock solutions as indicated in Table 3 (prior to experimental day).\ntable:\n﻿0,1,2\nComponent,Directions,Directions\n125 mM PIPES pH 6.8,Dissolve 3.78 g of PIPES in water. Adjust the pH to 6.8 with NaOH and make up the volume to 100 mL with water.,Dissolve 3.78 g of PIPES in water. Adjust the pH to 6.8 with NaOH and make up the volume to 100 mL with water.\n8% w/v oyster glycogen,Weigh out 0.8 g of oyster glycogen and add to water. Make the final volume up to 10 mL with water and warm gently/mix to dissolve glycogen. Store frozen at -20 °C.,Weigh out 0.8 g of oyster glycogen and add to water. Make the final volume up to 10 mL with water and warm gently/mix to dissolve glycogen. Store frozen at -20 °C.\n200 mM Na phosphate pH 6.8,Dissolve 2.63 g of Na2HPO4.7H2O and 1.41 g of NaH2PO4.H2O in water. Bring the volume up to 100 mL with water.,Dissolve 2.63 g of Na2HPO4.7H2O and 1.41 g of NaH2PO4.H2O in water. Bring the volume up to 100 mL with water.",
    "\"1 mM glucose-1,6-bisphosphate\",\"Dissolve 2 mg of glucose-1,6-bisphosphate in 4 mL of water. Aliquot and store frozen at -20 °C. Stable for at least several months.\",\"Dissolve 2 mg of glucose-1,6-bisphosphate in 4 mL of water. Aliquot and store frozen at -20 °C. Stable for at least several months.\"\n10 mM NADP,Dissolve 23 mg of NADP in 3 mL of water. Aliquot and store frozen at -20 °C. Stable for at least several months.,Dissolve 23 mg of NADP in 3 mL of water. Aliquot and store frozen at -20 °C. Stable for at least several months.\nTable 3: Stock solutions required for the assay of glycogen phosphorylase activity.\nPre-heat a water bath to 30 °C\nSet up each glycogen phosphorylase assay in a 1.5 mL tube by adding the reaction mixture reagents listed below (Table 4).\ntable:\n﻿0,1\nComponent,Volume (µl)\n125 mM PIPES buffer pH 6.8,160\nWater,70\n8% w/v oyster glycogen,100\n200 mM Na phosphate 6.8,400\n\"1 mM glucose-1,6-bisphosphate\",20\n10 mM NADP,20\nFinal volume,770\nTable 4: Composition reaction mixture for assay of glycogen phosphorylase activity.\nNOTE: To facilitate the set-up, a master mix can be made containing enough of each of the above-listed reagents to complete the number of assays planned.\nPrepare a blank reaction containing the components listed in Table 4 but add an additional 30 µL of 25 mM PIPES buffer, pH 6.8 (prepared by diluting 125 mM PIPES buffer 1/5 with water). Transfer to a disposable methacrylate cuvette and use to set the zero on the spectrophotometer at 340 nm.\nTake one 770 µL aliquot of reaction mixture in a 1.5 mL tube. Add 1 µL of glucose-6-phosphate dehydrogenase and 1 µL of phosphoglucomutase, mix gently, and incubate at 30 °C for 3 min to pre-warm the reaction mixture.",
    "Add 30 µL of the sample containing glycogen phosphorylase in 25 mM PIPES buffer, pH 6.8. Mix and transfer the reaction mixture to a disposable methacrylate cuvette.\nPlace the cuvette into the spectrophotometer and record the absorbance at 340 nm at timed intervals for 10 to 20 min. Plot the absorbances obtained against time.\n\tNOTE: A reaction in which glycogen phosphorylase is replaced with 25 mM PIPES buffer should be included. Depending upon the purity of the glycogen phosphorylase sample, other controls may also be needed (see Discussion for details).\nDetermine the reaction rate (see Representative Results for details).\n3. Determination of glycogen debranching enzyme activity\nPrepare stock solutions as indicated in Table 5 (prior to the experimental day).\ntable:\n﻿0,1,2\nComponent,Directions,Directions\n100 mM maleate buffer,Dissolve 1.61 g of maleic acid in ~ 80 mL of water. Adjust the pH to 6.6 with NaOH and make the final volume up to 100 mL with water.,Dissolve 1.61 g of maleic acid in ~ 80 mL of water. Adjust the pH to 6.6 with NaOH and make the final volume up to 100 mL with water.\n300 mM triethanolamine hydrochloride/ 3 mM MgSO4 pH 7.5,Dissolve 27.85 g of triethanolamine hydrochloride and 0.370 g of MgSO4.7H2O in ~ 400 mL of water. Adjust the pH to 7.5 with NaOH and make up to a final volume of 500 mL with water.,Dissolve 27.85 g of triethanolamine hydrochloride and 0.370 g of MgSO4.7H2O in ~ 400 mL of water. Adjust the pH to 7.5 with NaOH and make up to a final volume of 500 mL with water.",
    "150 mM ATP/12 mM NADP,Dissolve 1.24 g of ATP in ~ 10 mL of water. Monitor the pH and add NaOH to maintain a pH of ~ 7.5 as the ATP dissolves. Add 0.138 g of NADP. Adjust the pH to ~ 7.5 with NaOH and make up to a final volume of 15 mL with water. Store in aliquots at – 20 °C. Stable for several months.,Dissolve 1.24 g of ATP in ~ 10 mL of water. Monitor the pH and add NaOH to maintain a pH of ~ 7.5 as the ATP dissolves. Add 0.138 g of NADP. Adjust the pH to ~ 7.5 with NaOH and make up to a final volume of 15 mL with water. Store in aliquots at – 20 °C. Stable for several months.\n50 mM Na phosphate buffer pH 6.8,Dissolve 32.81 g of Na2HPO4.7H2O and 17.61 g of NaH2PO4.H2O in water. Bring the volume up to a final volume of 5 L with water.,Dissolve 32.81 g of Na2HPO4.7H2O and 17.61 g of NaH2PO4.H2O in water. Bring the volume up to a final volume of 5 L with water.\nTable 5: Stock solutions required for the assay of glycogen debranching enzyme activity.\nPrepare phosphorylase limit dextrin\n\t\nDissolve 0.3 g of oyster glycogen in 10 mL of 50 mM sodium phosphate buffer, pH 6.8.\nDissolve sufficient lyophilized phosphorylase A powder to yield 60 U of activity in 50 mM phosphate buffer, pH 6.8.\n\t\tNOTE: Depending upon the lot of phosphorylase A purchased, the mass needed will vary but is generally between 5 and 10 mg of powder.",
    "Add 60 U of phosphorylase A to the glycogen solution and transfer to a dialysis bag. Dialyze at room temperature against 1 L of 50 mM sodium phosphate buffer, pH 6.8 for 8 h. Change to the fresh dialysis buffer and continue the incubation overnight.\nAdd another 10 U of phosphorylase A and change to fresh dialysis buffer. After 8 h, again change to fresh dialysis buffer and continue the incubation overnight.\nTransfer the contents of the dialysis bag to a centrifuge tube and boil for 10 min. Chill on ice, and then centrifuge at 10,000 x g for 15 min.\nTransfer the supernatant to a dialysis bag and dialyze for 8 h against three changes of 2 L of distilled water.\nTransfer the contents of the dialysis bag to a 50 mL centrifuge tube. Measure the volume and add two volumes of ice-cold absolute ethanol to precipitate the limit dextrin. Let the tube stand on ice for 30 min.\n\tNOTE: A white precipitate should begin to form immediately upon the addition of ethanol but, if it does not, add a drop of 3 M NaCl.\nCentrifuge at 15,000 x g for 15 min and discard the supernatant. Rinse the white pellet of limit dextrin twice with 66% v/v ethanol, using ~30 mL for each rinse.\nTransfer the limit dextrin to a mortar and allow to air dry completely. When the limit dextrin is dry, grind to a powder with a pestle and transfer to a suitable vessel for storage; dry at 4 °C.\nFor use as debranching enzyme substrate, prepare a 1% w/v solution in water.\nPre-heat a water bath to 30 °C.\nPre-heat a heating block or water bath to 95 °C.",
    "Prepare four 1.5 mL tubes each containing 100 µL of maleate buffer, 80 µL of phosphorylase limit dextrin, and 10 µL of water. These tubes will be used to conduct the debranching enzyme assay. Label two of the tubes Reaction and the other two tubes Control.\nAt timed intervals, add 10 µL of the debranching enzyme sample to the Reaction tubes and 10 µL of buffer which was used to prepare the branching enzyme sample to the Control tubes. Incubate at 30 °C.\nAt defined time points (e.g., 5-, 10-, and 20-min incubation), withdraw 50 µL from each Reaction and Control tube and immediately place into the heating block or water bath at 95 °C. Heat for 3 min.\nCentrifuge at 15,000 x g for 2 min in order to remove precipitated protein.\n\tNOTE: At this point, the procedure can be halted if needed. The heated samples can be stored frozen at -20 °C until proceeding to the measurement of released glucose (step 17, below).\nMeasurement of released glucose\n\t\nTransfer 40 µL of the supernatant from the heated samples to disposable methacrylate cuvettes and add 833 µL of triethanolamine hydrochloride/magnesium sulfate buffer, 67 µL of NADP/ATP mix, and 60 µL of water. Mix by pipetting up and down gently, being careful not to introduce air bubbles.\n\t\tNOTE: To facilitate the set-up, a master mix can be made containing enough of each of the above-listed reagents to complete the number of assays planned.\nPrepare a blank reaction by combining 100 µL of maleate buffer, 80 µL of phosphorylase limit dextrin, and 20 µL of water. Mix well, and transfer 40 µL to a disposable methacrylate cuvette. Add 833 µL of triethanolamine hydrochloride/magnesium sulfate, etc. as described in step 3.17.1.",
    "Set the zero on the spectrophotometer at 340 nm using the blank reaction.\nAdd 0.5 µL of glucose-6-phosphate dehydrogenase to each cuvette. Mix gently by pipetting up and down slowly. Incubate at room temperature for 10 min, and then record the absorbance at 340 nm.\n\t\tNOTE: The absorption values should be low, signifying little contamination of the samples with glucose-6-phosphate.\nAdd 0.5 µL of hexokinase to each cuvette. Mix gently by pipetting up and down slowly. Incubate at room temperature for 15 min, and then record the absorbance at 340 nm.\nContinue the incubation at room temperature for an additional 5 min. Record the absorbance at 340 nm once again. If the absorption has increased from that recorded at 15 min, continue incubation for a further 5 min and again check the absorption. Record the final absorption at 340 nm obtained.\nFor each sample, subtract the absorbance at 340 nm recorded after the addition of glucose-6-phosphate dehydrogenase from the final absorbance obtained after addition of hexokinase. Plot the values obtained against the length of time that the corresponding sample had been incubated with debranching enzyme.\n4. Determination of glycogen branching enzyme activity\nPrior to the experimental day, prepare iodine/KI solution by first dissolving 2.6 g of KI in 10 mL of water. In a fume hood, weigh out 0.26 g of iodine and add to the KI solution.\n\tCAUTION: Iodine is harmful when in contact with the skin or if inhaled. Mix to dissolve the iodine and store at 4 °C, protected from the light. Also prepare 125 mM PIPES buffer, pH 6.8 (see Table 3).\nWhen beginning experiments, make a working stock of acidified iodine reagent.",
    "Take 45.7 mL of water in a 50 mL tube and add 150 µL of iodine/KI solution followed by 150 µL of 1 M HCl.\nMix well and store at 4 °C, protected from the light. The solution is stable for at least 3 days under these conditions.\nOn the day of the experiment, make a fresh 10 mg/mL solution of amylose.\n\t\nWeigh out 50 mg of amylose and transfer to a 15 mL tube.\nAdd 200 µL of absolute ethanol and shake gently.\nAdd 500 µL of 2 M KOH and shake gently.\n\t\tCAUTION: KOH causes severe skin burns and eye damage. Use appropriate personal protective equipment.\nAdd 0.5 mL of water while shaking gently. If the amylose does not dissolve completely, add an additional 0.5 mL of water.\nAdjust the pH to ~6.5 to 7.0 with 1 M HCl.\n\t\tCAUTION: HCl may cause eye, skin, and respiratory tract irritation. Use appropriate personal protective equipment.\nAdd water to reach a final volume of 5 mL.\nSterilize by passage through a 0.2 µm syringe end filter and store at room temperature. Do not chill or freeze.\nPre-heat a water bath to 30 °C.\nPrepare twelve 1.5 mL tubes, each containing 1 mL of acidified iodine reagent. Set aside on the bench. These will be used to stop the branching enzyme reaction.\nPrepare four 1.5 mL tubes each containing 150 µL of amylose, 150 µL of PIPES buffer, and 45 µL of water. These tubes will be used to conduct the branching enzyme assay. Label two of the tubes Reaction and the other two tubes Control.",
    "At timed intervals, add 5 µL of branching enzyme sample to the Reaction tubes and 5 µL of buffer which was used to prepare the branching enzyme sample to the Control tubes. Incubate at 30 °C.\nAt defined time points (e.g., 5, 10, and 15 min incubation), withdraw 10 µL from each Reaction and Control tube and add to the 1.5 mL tubes that contain 1 mL of acidified iodine reagent. Add an additional 140 µL of water and mix well. Transfer to disposable cuvettes.\n\tNOTE: The samples should be blue in color and the solution should be free of any precipitate. The color formed is stable for at least 2 h at room temperature.\nPrepare a sample that contains 1 mL of acidified iodine reagent and 150 µL of water. Mix well and transfer to a cuvette. Use this cuvette to set the zero on the spectrophotometer at 660 nm.\nRead the absorbance of each of the twelve samples at 660 nm. Determine the rate of the branching enzyme reaction by subtracting the absorbance obtained in the presence of branching enzyme (Reaction) from the absorbance when no branching enzyme is present (Control) at each time point. See Representative Results for details.\n5. Qualitative assessment of glycogen branching\nPrepare saturated calcium chloride solution by adding 74.5 g of anhydrous calcium chloride to ~40 mL of water and stirring. Add a little more water and continue to stir. Make the volume up to 100 mL with water and continue stirring until the CaCl2 is fully dissolved.",
    "Prepare a working stock of iodine/CaCl2 color reagent by mixing 50 µL of KI/iodine stock solution (see step 4.1, above) with 13 mL of saturated CaCl2 solution in a 15 mL tube. Mix well and store at 4 °C, protected from the light. The solution is stable for at least 1 week under these conditions.\nDetermination of branching\n\t\nIn a 1.5 mL tube, combine 650 µL of iodine/CaCl2 color reagent stock with 100 µL of water and mix thoroughly. Transfer the solution to a disposable methacrylate cuvette.\n\t\tNOTE: The solution in the cuvette should be clear and pale yellow in color.\nPlace in the spectrophotometer and, running in a wavelength scanning mode, collect a background spectrum from 330 nm to 800 nm.\nIn a 1.5 mL tube, combine 650 µL of working iodine/CaCl2 color reagent with 50 µg of oyster glycogen. Bring the final volume to 750 µL with water and mix thoroughly. Transfer the solution to a disposable methacrylate cuvette.\n\t\tNOTE: The solution in the cuvette should be clear and a deep orange/brown color.\nPlace in the spectrophotometer and collect an absorption spectrum from 330 nm to 800 nm.\nRepeat steps 4.4.3 through 4.4.4 with 50 µg of amylopectin and 30 µg of amylose.\n\t\tNOTE: The amylopectin sample should be yellow/green and the amylose sample should be green/blue. Both samples should be clear. The colored complexes formed are stable, with no change in absorption spectrum, for at least 1 h at room temperature.\nTo obtain an indication of the branched structure of an uncharacterized glycogen sample, combine 25 µg to 50 µg of glycogen with 650 µL of working iodine/CaCl2 color reagent. Proceed as above, bringing the volume to 750 µL with water, mixing thoroughly, and transferring to a methacrylate cuvette.",
    "NOTE: The glycogen sample should yield a yellow/orange to orange/brown color depending upon the degree of branching (length of outer chains) of the glycogen present. Again, the sample should be clear. See Representative Results for details.\nCollect the absorption spectrum.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}