{
  "id": 15125,
  "origin_website": "Jove",
  "title": "High-Density DNA and RNA microarrays - Photolithographic Synthesis, Hybridization and Preparation of Large Nucleic Acid Libraries",
  "procedures": [
    "1. Microarray design\nWrite the sequences to be synthesized in a text editor, 5'→3', one line per sequence. For the quality control 25mer, use the sequence \"GTCATCATCATGAACCACCCTGGTC\". Use A, C, G and T letters for DNA nucleotides and 5, 6, 7 and 8 numbers for RNA nucleotides.\nIn the case of library preparation, add an extra number (i.e., 9) at the 3' end of each sequence. This will correspond to the coupling of the base-sensitive monomer.\nEach sequence must be followed by a comma. Assign a name to each sequence after the comma, and verify that each lane follows the [sequence,#sequence_name] format (without brackets). Save the list of sequences as a .txt file.\nStart MatLab then load the program ChipDesign.m. Run the program.\nIn the Property Panel window, load the microarray EntireChip layout file. Load the MilliChip layout file if the aim is to synthesize the entire array at four identical locations.\nIn the Property Panel window, under Chip Specification, select Select Container then Synthesis Area. Under Pattern, select the pattern that yields the correct amount of addressable features, counting the number of sequences × number of replicates. For the quality control 25mer, select the 25:36 pattern.\nUnder Select Container, select Fiducial. Fiducial features are usually synthesized at the corners of the synthesis area and are used to extract hybridization data. With Fiducial selected, write a sequence (5'→3') that will be synthesized on fiducial features and which can act as a positive control. For the 25mer experiment, use the same DNA sequence.\nUnder Sequence, load the text file containing all written sequences. Make sure Randomize is selected. Give a title to the experiment in Project Title and, in Linker Sequence, write TTTTT (corresponding to a T5 linker).",
    "Press Generate, then find the array design files and masks (Figure 2) under MaskGen_delta_rc1/Designs folder. Make sure it contains a display script, a flow sequence and a design file.\nFor library preparation, open the display script. Add an extra line at the bottom of the display script that copies exactly the first line of the script (e.g., display First_Mask.bmp 150). This will remove the terminal photoprotecting group at the 5' end of all oligonucleotides.\nStart the job creator AutoJob program, load a template by clicking on Load Template, then click on Display Script to load the display script file that was generated by MatLab. Press Generate. This step will create a series of instructions, called a jobfile, that will control the communication of the computer with the micromirrors and the DNA synthesizer.\n2. Slide preparation and functionalization\nDrill one slide at two positions corresponding to the location of the inlet and outlet tubing on the synthesis cell. Use a 0.9 mm diamond bit on a CNC router to precisely and reliably drill. Rinse the drilled slides with ultrapure water and arrange them in a slide rack.\nClean the surfaces by sonicating the slides in a water bath containing 5% of an ammonia-based special purpose cleaner for 30 min at 35 °C. Rinse the slide with double-distilled H2O and transfer them in a clean, dry rack.\nArrange drilled and undrilled microscope slides in a slide rack. In a large graduated cylinder, prepare the functionalization solution by mixing 475 mL of ethanol (EtOH) with 25 mL of ddH2O, 10 g of silanizing reagent (N-(3-triethoxysilylpropyl)-4-hydroxybutyramide) and 1 mL of acetic acid. Stir well until homogeneous then transfer in a suitable, closed container.",
    "Place the loaded rack in the container, close the lid and let the container rock gently on an orbital shaker for 4 h at room temperature.\nAfter 4 h, discard the functionalization solution and replace with 500 mL of wash solution, consisting of 475 mL of EtOH, 25 mL of ddH2O and 1 mL of acetic acid. Agitate slowly for 20 min at room temperature, then discard and replace with 500 mL of fresh wash solution.\nAfter an additional 20 min at room temperature, discard the solution, dry the slides with a stream of argon and cure them in a pre-heated vacuum oven at 120 °C. After 2 h, switch off the oven and the vacuum pump but leave the slides under reduced pressure overnight. Then, bring the oven back to atmospheric pressure and store the slides in a desiccator until further use.\n3. Preparation of synthesis reagents and reactants\nBring the phosphoramidite powders (Figure 1) from their storage temperature (-25 or -45 °C) to room temperature in a desiccator.\nWhen the phosphoramidites reached room temperature, dissolve the powder with a volume of ultra-dry acetonitrile (<30 ppm H2O) in order to reach 30 mM concentration for standard DNA and RNA phosphoramidites, and 50 mM for the base-sensitive dT monomer (library preparation). Add a small molecular sieves bag to trap any trace of humidity.\nPrepare a solution of 1% (w/w) imidazole in DMSO by dissolving 11 g of imidazole into 1 L of dry DMSO. Shake well until completely dissolved. Attach the solution to the auxiliary port of the DNA synthesizer. This will be the exposure solvent necessary for complete removal of the 5′-photoprotecting group.",
    "For the synthesis of libraries, prepare a solution of 1% (w/v) β-carotene in dichloromethane by dissolving 100 mg of β-carotene in 10 mL of dichloromethane. Shake well in an amber glass bottle then wrap in aluminum foil.\n4. Preparation and monitoring of microarray synthesis.\nRecord temperature and humidity in the microarray fabrication room and make sure the DNA synthesizer is under sufficient helium pressure.\nTurn on the UV-LED and its cooling fan. Attach a UV intensity meter at the focal plane of incoming UV light and turn it on (Figure 3A).\nOn the computer, start the jobfile/micromirror/synthesis files controller software (named WiCell). Turn on then initialize the micromirror device and load an all-white mask file by right-clicking on DMD, then selecting Load Image.\nRight-click on the UVS icon and select UV Shutter Open. Read the power value (in mW/cm2) on the intensity meter and count 60 s. After 60 s, read the power value again and note down the beginning and end values. Close the shutter by selecting UV Shutter Close and turn off the intensity meter. Calculate the average UV intensity value in mW/cm2.\nCalculate the exposure time necessary to reach a radiant energy of 6 J/cm2 for 5'-NPPOC photodeprotection (DNA and RNA microarrays) and 3 J/cm2 for 5'-BzNPPOC photodeprotection (DNA libraries), simply following the imgsrc://cloudfront.jove.com/files/ftp_upload/59936/59936eq1.jpg relationship.\nIn the DNA synthesizer Workstation software, create a sequence file in the Sequence Editor by copying and pasting the contents of the flow sequence generated by MatLab. Add an extra two washing steps at the 3' end (default cycle letter: \"s\") to wash the surface of the substrates before moving on to the first coupling. Save and export the sequence file.",
    "In the Protocol Editor of the Workstation software, create a protocol that contains a dedicated cycle named after each of the letters and numbers present in the sequence file (e.g., if a sequence file contains only letters A, C, G and T, then the protocol file must contain four cycles, named A, C, G and T).\nSet the coupling time for DNA phosphoramidites (cycles A, C, G and T) to 15 s, to 120 s for rU phosphoramidite (cycle 8) and to 300 s for rA, rC and rG phosphoramidites (cycles 5, 6 and 7). For library preparation, set the coupling of the base-sensitive, cleavable dT monomer to 2 × 120 s (Table 1 and Table 2).\nMake sure the wait time between two Event 2 Out communication events in each cycle corresponds to the calculated UV exposure time to reach the necessary radiant energy. As for the sequence file, save and export the protocol file.\nIn the WiCell software, load the job, sequence and protocol files in their respective sub-windows then click Send to send the sequence and protocol files to the DNA synthesizer.\nIn the sequence file, count the number of couplings for each phosphoramidite.\nTo measure the required volume (in µL) of phosphoramidite solution needed to perform each synthesis, multiply the number of couplings by 60. Add 250 µL to each volume for safety and priming of the line on the DNA synthesizer. Use a base volume of 250 µL for phosphoramidites requiring a single coupling only.\nQuickly transfer the solution into the vials on the DNA synthesizer corresponding to the port letter/number in the protocol cycles.\nPrime the ports with the phosphoramidite solutions with 10 prime pulses each in order to fill the lines with reagent. Prime the acetonitrile wash line before attaching the reaction cell.",
    "To assemble the synthesis cell, place a thick (250 µm) perfluoroelastomer (FFKM) gasket first on the quartz block of the cell. Place a drilled, functionalized microscope slide on top of the first gasket, and verify that the holes on the slides connect with the inlet and outlet tubing of the synthesis cell.\nPlace a second, thin (50 µm) polytetrafluoroethylene (PTFE) gasket over the drilled slide, surrounding the two holes. Finally, place a second, functionalized but undrilled slide atop the second gasket (Figure 3B). Place a 4-screw metal frame on top of the assembled double-substrate cell and tighten the screw to the same clamping force (0.45 Nm) using a torque screwdriver.\nAttach the inlet and outlet tubing to the DNA synthesizer. Prime the acetonitrile wash line and verify the proper flow of acetonitrile (ACN) through the substrates. Disassemble and reassemble the cell if any leakage of ACN can be observed at this stage. Measure the volume of ACN at the waste line after going through 7 cycles of ACN priming. This volume should be 2 mL.\nAttach the synthesis cell at the focal plane of incoming UV light. In the case of library preparation, attach an extra inlet and outlet line to the back of the cell and fill the back chamber with the β-carotene solution (2 mL of solution is sufficient). Make sure there is no leakage (Figure 3C).\nStart the synthesis by first clicking on Run in the WiCell software. At the first WAIT command in the job file, press Start on the DNA synthesizer.\nDuring synthesis, regularly verify that the display of mask files coincides with UV exposure and opening of the shutter.",
    "After synthesis of regular microarrays, disconnect the cell from the synthesizer, disassemble the cell and use a diamond pen to etch the synthesis number onto the glass slides. Etch the number on the non-synthesized face of each slide. Transfer the slides into 50 mL centrifuge tubes and store in a desiccated area until further use.\nAfter the synthesis of library microarrays, first drain the β-carotene solution out of the chamber then wash it by flowing 2 × 5 mL of CH2Cl2, then drain. Proceed with disassembling as per step 4.21. The synthesized array may be visible to the naked eye (Figure 4).\n5. DNA microarray deprotection\nFill a staining glass jar with 20 mL of EtOH and 20 mL of ethylenediamine (EDA). Place the DNA-only microarrays vertically in the jar, close the lid, and leave the slides to deprotect for 2 h at room temperature.\n\tCAUTION: EDA is an acutely toxic, corrosive and flammable liquid. Work with gloves in a well-ventilated fume hood.\nAfter 2 h, retrieve the slides using tweezers and rinse them thoroughly with double-distilled H2O.\nDry the slides in a microarray centrifuge for a few seconds then store in a desiccator.\n6. RNA microarray deprotection\nIn a 50 mL centrifuge tube, prepare a dry solution of 2:3 triethylamine/ACN (20 mL and 30 mL of each, respectively). Transfer one RNA microarray slide into the centrifuge tube, close the lid then wrap with plastic sealing film. Gently shake the centrifuge tube on an orbital shaker for 1h and 30 min at room temperature.\nAfter 1h and 30 min, remove the slide, wash with 2 × 20 mL dry ACN then dry in a microarray centrifuge for a few seconds.",
    "CAUTION: Triethylamine is an acutely toxic, corrosive and flammable liquid. Acetonitrile is toxic and flammable. Work with gloves in a well-ventilated fume hood.\n\tNOTE: First deprotection step complete.\nPrepare a 0.5 M hydrazine hydrate solution in 3:2 pyridine/acetic acid. First, mix 20 mL of acetic acid and 30 mL of pyridine in a graduated cylinder. Wait for the solution to cool down before adding 1.21 mL of hydrazine hydrate. Transfer around 40 mL of the resulting solution into a 50 mL centrifuge tube.\n\tCAUTION: Hydrazine hydrate is an acutely toxic and corrosive liquid. Pyridine is highly flammable and acutely toxic. Acetic acid is flammable and corrosive. Work with gloves in a well-ventilated fume hood.\nAfter the first deprotection step, transfer the RNA slide into the hydrazine hydrate solution, close the lid and wrap with plastic sealing film. Gently shake the tube on an orbital shaker for 2 h at room temperature. After 2 h, remove the slide, wash with 2 × 20 mL of dry ACN then dry in a microarray centrifuge for a few seconds.\n\tNOTE: Second deprotection step complete.\nIf the RNA microarray also contains DNA nucleotides, proceed with a third deprotection step. In a 50 mL centrifuge tube, mix 20 mL of EDA with 20 mL of EtOH. Add the DNA/RNA microarray to the 1:1 EDA/EtOH solution and leave at room temperature for 5 min.\nAfter 5 min, remove the slide, wash with 2 × 20 mL of sterile water then dry in a microarray centrifuge and store in a desiccator.\n7. Hybridization with a fluorescently-labelled complementary strand\nThaw acetylated bovine serum albumin (10 mg/mL) and the Cy3-labelled complementary strand (100 nM) and warm up to room temperature.",
    "In a 1.5 mL sterile microcentrifuge tube, mix 150 µL of 2x MES buffer (200 mM 2-(N-morpholino)ethanesulfonic acid; 1.8 M NaCl; 40 mM EDTA; 0.02% Tween-20) with 26.7 µL of Cy3-labelled DNA, 13.4 µL of acetylated BSA and 110 µL of sterile H2O. Mix and vortex. Double the volume if both slides are to be used for hybridization.\nPre-warm a hybridization oven to a temperature below the Tm of the duplex but high enough to ensure good discrimination between full-match and non-match sequences. For the quality control 25mer, set the temperature to 42 °C (Tm of 59 °C).\nCarefully place a self-adhesive 300 µL hybridization chamber over the synthesis area on each slide and pipet in the hybridization solution prepared above. Cover the holes of the chamber with adhesive dots and wrap the entire slide in aluminum foil.\nPlace the microarray slide into the hybridization oven, cover and let it gently rotate at the selected hybridization temperature for 2 h.\nAfter 2 h, detach the slide, remove the aluminum foil and carefully tear off the hybridization chamber. Transfer the slides into a centrifuge tube containing 30 mL of Non-Stringent Wash Buffer (NSWB; 0.9 M NaCl, 0.06 M phosphate, 6 mM EDTA, 0.01% Tween20, pH 7.4) and shake vigorously for 2 min at room temperature.\nTransfer the slide into a centrifuge tube containing 30 mL of Stringent Wash Buffer (SWB; 100 mM MES, 0.1 M NaCl, 0.01% Tween20) and shake vigorously for 1 min.\nFinally, transfer the slide into a centrifuge tube containing 30 mL of Final Wash Buffer (FWB; 0.1x sodium saline citrate) and shake for a few seconds. Dry the slide in a microarray centrifuge.",
    "Place the dry microarray, synthesis area facing down, in the slide holder of the microarray scanner. For Cy3-labelled duplexes, scan at 5 µm resolution with a 532 nm excitation wavelength, a 575 nm filter and a photomultiplier of 350. Save the high resolution scan as a .tif image file (Figure 5A).\n8. Data extraction and analysis\nPrior to data extraction, rotate the saved array scan in an image editor so as to situate the longest chain of fiducial features at the top-left corner of the scan. Save the rotated image.\nStart NimbleScan, then press File | Open and load the array scan. Then, by clicking Browse in the Design file subsection, load the .ndf design file that was automatically generated during the design of the microarray experiment. Then click Open.\nIn View, click Auto Contrast/Brightness. Click on the icon Manually align above the scan. Place four square-shaped markers at the four corners of the scan, then click the now green icon again. Extract the hybridization data by clicking on Analysis, Reports then Probe Report.\nOpen the .probe report file in a spreadsheet editor. Keep columns B and I and discard the rest before proceeding with calculating average values and standard deviation from the extracted data (Figure 5B).\n9. Library deprotection, cleavage and recovery\nTo deprotect and cleave DNA libraries, prepare a solution of 1:1 dry EDA/toluene in a 50 mL centrifuge tube. Immerse the slide into the cleavage solution, close the slide and wrap with plastic sealing film, then gently rotate in an orbital shaker for 2 h at room temperature.\nAfter 2 h, remove the slide and wash with 2 × 20 mL of scrupulously dry ACN. Remove the slide and let it air dry.",
    "With a pipette, apply 100 µL of sterile H2O over the now discernable synthesis area. Pipet the solution up and down a few times before transferring it into a 1.5 mL microcentrifuge tube. Repeat the process and combine the microarray eluate into the same tube (Figure 6).\nEvaporate the 2 × 100 µL of chip eluate to dryness then redissolve into 10 µL of nuclease-free H2O. Measure the absorbance on a UV-Vis spectrophotometer.\nDesalt the DNA library on a 10 µL pipette tip equipped with C18 resin. First, transform the chip eluate into a 0.1 M triethylammonium acetate (TEAA) buffered solution.\nWet the resin by aspiring 3 x 10 µL of H2O/ACN 1:1, and equilibrate the resin by washing with 3 x 10 µL of 0.1 M TEAA buffer. Bind the DNA by pipetting the chip eluate 10 times up and down through the resin. Wash the resin with 3 x 10 µL of 0.1 M TEAA buffer, 3 x 10 µL of H2O.\nElute the desalted DNA from the tip by washing the resin with 10 µL of H2O/ACN 1:1. Dry the desalted solution down and redissolve into 10 µL of sterile H2O. Measure the absorbance on a UV-Vis spectrophotometer (Figure 7). Evaporate the library to dryness and store at -20 °C until further use."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}