{
  "id": 5161,
  "origin_website": "Bio",
  "title": "<sup>59</sup>Fe Uptake Assays in <em>Paracoccidioides</em>  Species",
  "procedures": [
    "Grow the Paracoccidioides spp. cells (from a stock* grown in BHI with 4% glucose medium for at least 72 h at 36 °C) in 200 ml BHI with 4% glucose medium for 72 h at 36 °C with shaking (around 300 rpm). After this, collect 5 x 106 viable cells counted in a hemocytometer with Trypan blue solution** and transfer to 30 ml of SC medium with no supplementation or supplemented with 200 μM BPS or 10 μM FeCl3 for 24 h at 36 °C with shaking.*Note: This stock remains viable until seven days. After this, a new culture has to be initiated in tubes containing fresh BHI with 4% glucose medium.** Note: To count the viable cells, dilute the cells in 0.9% NaCl solution 100 times (it could be two 1:10 serial dilutions). After the dilution, get 10 μl of the cells and mix with 10 μl of Trypan blue solution. This corresponds to a 1:200 final dilution. Get 10 μl of this mixture and count the cells using a hemocytometer. The viable cells will not uptake the blue dye and will stay colorless.Collect 20 ml of cells into a conical tube by centrifugation at 1,200 x g for 10 min at 4 °C and wash cells once with 1 mM EDTA in citrate uptake buffer.Wash cells twice with citrate uptake buffer (pH 6.0).Re-suspend cells to a final volume of 15 ml with citrate uptake buffer.Transfer 7 ml of cells into a scintillation vial. You’ll need more than 7 ml of cells if you have more than two time points.Incubate cells for 15 min at 36 °C with shaking prior to addition of 59Fe. While shaking cells, take an aliquot (100 μl) from each scintillation vial and count the viable cells by a hemocytometer with Trypan blue solution.",
    "Note: This step is important to data normalization at the end of the experiment, since the data will be presented as pmol 59Fe/106 viable cells/time.For reductase-independent 59Fe uptake, add 140 μl 1 M ascorbic acid in distilled H2O to each scintillation vial (20 mM final concentration). Note: The ascorbic acid solution should be made just prior to use.To begin uptake, add 70 μl of 20 μM 59Fe solution to each of the scintillation vials.At each time point (be sure to have a zero time point), stop shaker, carefully remove the scintillation vials, and pipet 1 ml of cells into 13 x 100 mm test tubes containing 3 ml of ice-cold 1x quench buffer on ice. Do this in triplicate for each time point (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160911/20160911195532_5647.jpgFigure 1. Quenching uptake samples. At each time point 1 ml samples are withdrawn from the uptake vials and quenched in 3 ml ice-cold quench buffer. It is important to add the quench buffer immediately after collecting 1 ml sample.For filtration and washing of cells, pre-soak filters in 1x quench buffer in a Petri dish.Using the microfine forceps, carefully place 12 filters on the manifold (hold only the outer edges of the filters) (Figure 2). Place the top on the manifold and tighten it down with the blue plastic screw. Apply vacuum to the filter manifold using cold water to form a vacuum. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160911/20160911195620_5660.jpgFigure 2. Placing filters on the Millipore manifold. Prior to initiating the 59Fe-uptake by your fungal samples, the filters are wetted in quench buffer and then placed on each of the manifold’s frits with the help of tweezers. The top on the manifold is then placed and tighten it down with the blue plastic screw. Apply vacuum to the filter manifold using cold water to form a vacuum.",
    "When all the samples have been collected, wash quenched samples on the Millipore manifold (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160911/20160911195716_1801.jpgFigure 3. Filtering quenched cell samples. After collecting and quenching all of the uptake samples, they are filtered and washed on the manifold for three times. It is important to wash filters in a series of # 1-12. Do not wash filter # 1 three times and then proceed to wash # 2 three times. If collecting more than the number of wells on the manifold, the first 12 filter set is removed for counting and replaced with fresh filters to continue the washing of additional samples.Pour samples over each filter. Rinse the test tube once with 3 ml ice-cold 1x quench buffer. Pour that over each corresponding filter. Rinse each filter three times with 3 ml ice-cold 1x quench buffer. Wash filters in a series of 1-12. For example, do not wash filter in position 1 three times and then proceed to wash the filter in position 2 three times. Leave manifold under vacuum until you have filtered and washed all samples.Leaving the manifold under vacuum, allow filters to dry (~30 sec) after the last wash.Using the forceps, remove each filter by folding it in on itself (NEVER touch the middle or top of the filter) and placing it in a 12 x 75 mm glass test tube.Continue with steps 11-15 until all of the samples have been processed.Using a wooden applicator, gently push the filters to the bottom of the test tube.Place the test tubes in the g counter carrier racks and count samples including 59Fe standards prepared in 12 x 75 mm test tubes. Use at least five points for standards, such as 20 μM, 10 μM, 1 μM, 0.1 μM and 0.05 μM (Figure 4).",
    "Dispose of radioactive waste as per institutional environmental health and safety regulations."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}