{
  "id": 2344,
  "origin_website": "Cell",
  "title": "OMiCC: An expanded and enhanced platform for meta-analysis of public gene expression data",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHerein we provide users with a clear, step-by-step workflow for performing a complete analysis in OMiCC, from study selection to meta-analysis, as well as walk users through the new features of OMiCC.\nRegister\nTiming: 5 min\nThis step describes how to register for an account on OMiCC.\nTo utilize the full functionality of the website, register for a free account with OMiCC.\nGo to https://omicc.niaid.nih.gov/[href=https://omicc.niaid.nih.gov/] and click the “Register” button.\nEnter an account name, password, name, and email.\nUsers enter information about their area of expertise and organization, and can link to a professional home page, PubMed search term, LinkedIn ID, or ResearchGate ID.\nAn email is sent to the address provided to complete the registration process.\nSearch for studies and existing CGPs or compendia using the “search” tab\nTiming: 15 min\nThis step describes how to search for gene expression studies on OMiCC, and how to search for existing CGPs and compendia created by other users.\nUnder the “Search” tab/menu at the top:\nSelect “On Study” to search for GEO or SRA studies using keywords extracted from the study and filtering by subject or technology platform (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1834-Fig1.jpg\nFigure 1. Search for studies\nUsers can search for studies using keywords on all fields or restricted data fields. The search results are presented in a list format, while detailed information can be displayed without leaving the search result list.\nThe search can be restricted to human or mouse only, or to specific platforms.\nSelect “Studies with public Comparison Group Pairs” to search studies with at least one publicly available CGP.\nAfter applying a filter, click “Search”.\nTo get a list of all studies in the OMiCC database, click “Search” without any keywords or click “Browse All”.",
    "Expand the study by clicking on the “+” icon to view study details.\nClick the icon under the “Study” column to be linked to the study on the GEO website to view experimental details, study design and contributors, and any available citations.\nSave studies by clicking on “Save to my study list” to return to these studies later.\nSelect “On Sample Groups” to search for sample groups by using keywords extracted from sample group annotations or metadata associated with the sample group, such as the user ID of the owner.\nSelect the “Public Groups” option to show only sample groups that an owner makes public.\nClick “Search” after applying a filter.\nSelect “On Comparison Group Pairs” to search for comparison group pairs (CGPs) by using keywords extracted from the CGP title, the user ID of the owner, or the MeSH terms that are used to annotate the sample groups.\nSelect “Public CGPs” to show only CGPs that the owner makes public.\nClick “Search” after applying a filter.\nSelect CGPs and click the “Add to Compendium” button to add them to an existing compendium.\nSelect “On Compendia” to search for compendia using keywords extracted from the compendia name, description, or user ID of the owner.\nSelect “Public Compendia Only” to search on compendia that the owner makes public.\nClick “Search” after applying a filter.\nTo add CGPs to your own compendium, click the “+” button in front of the compendium name, then check the specific CGPs to add.\nTo add all the CGPs in a compendium, select the associated checkbox to the left of the compendium name and click the green “Add to the Compendium” button.\nCreate sample groups\nTiming: 30 min\nThis step describes how to create sample groups from publicly available gene expression data.",
    "From the study search results, click on the Study ID to access the study page.\nTo create your own sample group, select samples to form a group (i.e., cases or controls).\nUse the filter to identify samples of interest.\nFor example, if you are interested in samples from systemic lupus erythematosus (SLE) patients, enter “SLE” into the filter to display only those samples.\nAt least 3 samples are required for each sample group (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1834-Fig2.jpg\nFigure 2. Create sample groups\n(A) Operations on a specific study can be followed with the green and blue arrows at the top of the page. To view sample metadata, users can click the “+” and select samples to add to a Sample Group. Filter for samples of interest by inputting key words. Select the samples to include (a minimum of 3 samples) in a sample group by checking the boxes. Once created, the sample group name appears in the sample group list alongside previously created sample groups created by other OMiCC users. (B) Upon clicking the “Create a Sample Group” button, a pop-up panel appears where the user can add annotations (a minimum of 2 annotation tags) to the selected samples. To copy the annotation tags to another group, click the “Copy Tags” button, then the “Paste Tags” button in the other group. You can change the group name by clicking the “Update” button. After saving the Sample Group, the user can proceed to the “Make Comparison Group Pairs” step by clicking the “Next” button.\nAfter selecting the samples, click the “Create a Sample Group” button. A pop-up window appears for the new sample group (Figure 2[href=https://www.wicell.org#fig2]B).\nEnter at least two annotations for the sample group.\nWe provide a controlled vocabulary (MeSH) to annotate sample groups.",
    "MeSH annotation suggestions appear as you type into the annotation box.\nWhile any text is allowed, we encourage users to use the MeSH terms.\nClick the “Add Annotations” button after entering in the annotations.\nThe sample group name generates automatically based on the annotations.\nTo change the sample group name, click the “Update” button, type in the desired group name, then click “Save”.\nTo remove unwanted annotations, click the “X” next to the annotation term.\nTo copy the annotation tags to another group, click the “Copy Tags” button, then the “Paste Tags” button in the other group.\nTo make the sample group public, click the “Change” button next to the “Is Public” field.\nOnce a sample group is saved and public, the sample group cannot be edited.\nIf the sample group is not being used by any other OMiCC user, the owner of the group can change the status back to private and edit it.\nClick “Save” to create the sample group.\nIf at least 3 samples are not added to the sample group, the “Save” button is opaque and cannot be clicked.\nIf other users create sample groups using the study, the sample groups show up in bold in a pane on the right side of the browser.\nClick the purple “Detail” button to view annotations and sample details.\nAt least two sample groups are needed to create a CGP. Once at least two sample groups are listed under the “Sample Group” panel on the right side, click the “Next” button.\nCreate comparison group pair (CGP)\nTiming: 15 min\nThis step describes how to create comparison group pairs (CGPs) using the previously created sample groups.\nChoose two sample groups to add to the CGP.",
    "Select a sample group from the list of existing sample groups, then click on the “Add to Comparison Group Pair” button.\nAssign the selected sample group as “Condition 1” or “Condition 2 (reference)” (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1834-Fig3.jpg\nFigure 3. Create a comparison group pair (CGP)\n(A) Users can select a sample group and add it either “As Condition 1” or “As Condition 2 (Reference)”.\n(B) Upon adding sample groups to both Condition 1 and Condition 2, a pop-up panel appears where the user can modify the CGP. If samples are paired, the user can add indices to indicate which samples are paired, which is used later in the analysis.\nAfter both conditions are assigned, a pop-up window appears (Figure 3[href=https://www.wicell.org#fig3]B).\nBy convention, OMiCC treats the “Condition 2” sample group as the reference group for downstream differential expression analysis. A positive change in gene expression means that the transcript level is higher in Condition 1 than Condition 2 and vice versa for down-regulated transcripts.\nOptionally, samples in the two groups of a CGP can be paired (Figure 3[href=https://www.wicell.org#fig3]B).\nFor example, samples obtained before and after a perturbation from the same subject should be paired.\nIf the samples are paired, paired analyses are performed downstream, for example, a paired t-test.\nIf the samples to be paired are in the same order, click on “Set Default Sample Pair Index” to automatically create the pair index.\nThe pair indices can also be manually changed.\nPairing can only be done when the CGP is private. If the CGP is public, it must be made private for pair indices to be changed.\nClick “Save Sample Pair Index” to save the pair index for the samples.\nTo make the CGP public, click the “Change” button next to the “Is Public” field.\nClick “Close” to save the CGP.",
    "If other users create CGPs using the study, they appear in bold under “Comparison Group Pairs” at the bottom of the page.\nClick the green “CGP Detail” button to view sample details (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1834-Fig4.jpg\nFigure 4. Create a compendium and run analysis\n(A) Users can add CGPs to an existing compendium or create a new compendium.\n(B) Users can compute Differential Expression Profiles (DEPs). Users can choose which studies or platforms to include, as well as modify the statistical significance testing method, multiple testing correction, statistic to use for DEP matrix generation, and differential gene thresholds.\n(C) Users can perform meta-analysis. Users can choose the meta-analysis method to use, as well as the differential gene thresholds.\nClick “Next” on the study page to add CGP(s) to a compendium.\nCreate compendium\nTiming: 5 min\nThis step describes how to create a compendium using the previously created CGPs.\nSelect the CGP(s) to add to a compendium (Figure 4[href=https://www.wicell.org#fig4]A).\nChoose an existing compendium or click the “Create New Compendium” button.\nClick the green “Add to Compendium” button.\nAfter adding CGPs to a compendium, you can go back to the search study page, create more sample groups in the current study, or go to the compendium to perform analyses. The toolbar on the top of the page can also be used to navigate the website.\nCompute differential expression profiles (DEPs)\nTiming: 15 min\nThis step describes how to compute differential expression profiles (DEPs) between the sample groups in a CGP.\nClick on “My Compendia” on the toolbar to see a list of all compendia.\nClick on the desired compendium.\nOn the “Compendium” page, the “CGPs” tab lists the CGPs that are in the compendium.",
    "This tab includes the number of samples in each condition of the CGP, the number of features, the number of genes, the study of origin, platform, and whether it is public.\nClick the “Make Public” button to make CGPs public.\nTo export the raw expression data, select the desired CGPs and click the “Export Raw Data On” button and choose whether to export the data in probe or gene space.\nWhen the selected CGPs originate from different platforms or from RNA-seq studies, users can only export data in gene space.\nTo compute DEPs with default settings, click the “Compute DEPs with Default Settings” button.\nThe default settings use limma with BH multiple-testing correction, using normalized GEO data.\nSee “quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]” section below for more information on normalization methods) and using t-statistics to generate a gene-by-CGP matrix (i.e., the DEP matrix).\nCGPs with studies using platforms with missing probe-to-gene mapping information or where normalized GEO data is unavailable cannot be analyzed using this “one-click” approach.\nTo change the default settings used to compute DEPs, click on the “Compute Differential Expression Profiles (DEPs)” tab (Figure 4[href=https://www.wicell.org#fig4]B).\nFilter by organism, studies, or platform using the drop-down menus.\nChoose the statistical parameters for performing differential analysis. Select from the following (Table 1[href=https://www.wicell.org#tbl1]):\ntable:files/protocols_protocol_1834_1.csv\nClick on the check box next to the CGP to include that CGP in the DEP analysis.\nIf the CGP is generated from a study using a microarray platform, choose the data source (GEO, RMA normalized, or normalized GEO) and whether to perform analysis in gene or probe space.\nIf the CGP is generated from RNA-seq data, the data is normalized internally, and analyses are done in gene space.\nClick the “Compute DEP(s)” button.\nPerform meta-analysis\nTiming: 15 min",
    "This step describes how to perform meta-analysis of the studies in a compendium. Users can choose between two methods – RankProd and MetaIntegrator.\nOn the “Compendium” page, click on the “Meta-analysis” tab (Figure 4[href=https://www.wicell.org#fig4]C).\nSelect which meta-analysis method to use, RankProd (rank product method) or MetaIntegrator (random effect model).\nIf the CGPs in the compendium are generated from studies using a microarray platform, select to perform the analysis in gene or probe space.\nIf working with RNA-seq data, analysis is performed in gene space.\nIf using RankProd, select p-value or adjusted p-value and a threshold for differential expression analysis. Default is an adjusted p-value threshold of 0.05.\nSelecting the adjusted p-value uses the percentage of false positive predictions (pfp) value. RankProd calculates the pfp value as the estimated percentage of false predictions.\nIf using MetaIntegrator, select FDR or effect size and a threshold for differential expression analysis. Default is an FDR threshold of 0.05.\nClick on the check box next to the CGP to select CGPs to include in the analysis.\nIf the CGP is generated using a study using a microarray platform, select the data source (GEO, RMA normalized, or normalized GEO).\nSelect the reference condition for each CGP so the comparison is biologically consistent across CGPs.\nFor example, one CGP has patients with a disease status labeled as “Condition 1” and healthy subjects as “Condition 2”. In a second CGP, healthy subjects are “Condition 1” and disease subjects are “Condition 2”.\nThe reference conditions need to be made uniform to either the healthy or disease groups.\nCritical: The reference conditions need to be standardized correctly for the results to have biological significance.\nClick the blue “Run Meta-analysis” button.\nAccess and interpret analysis results\nTiming: 10 min",
    "This step describes how to view and download the results from both differential expression analysis and meta-analysis. The outputs of both analyses are described here.\nOn the “Compendium” page, click on the “Analysis Results” tab to see all analyses performed for a compendium (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1834-Fig5.jpg\nFigure 5. Access analysis results\n(A) Users can view results of any analyses under the “Analysis Results” tab in a compendium.\n(B) For DEP analysis, users can download results for each individual CGP by clicking on the black download icons corresponding to each type of result. If multiple CGPs were included, additional results are available.\n(C) For meta-analysis, users can download the output file of the chosen meta-analysis method, as well as lists of differentially up-regulated or down-regulated genes or probes.\nFilter analyses by run type (Derive DEPs or Meta-analysis) or run status (queued, running, completed, failed).\nClick on a run ID to see the detailed results for those analyses.\nClick the green “Generate” button in the “Public Access URL” field to generate a URL to share the analysis results.\nFor DEP analysis, download results for each CGP or the DEP matrix (Figure 5[href=https://www.wicell.org#fig5]B).\nClick the black download icon next to each output type to download the results for each CGP.\nClick the heatmap icon to view a heatmap of differentially expressed genes in a pop-up window.\nThese are the outputs (Table 2[href=https://www.wicell.org#tbl2]):\ntable:files/protocols_protocol_1834_2.csv\nClick the green “Download CGP Information” button to download an Excel file with information about each CGP used in the analysis (e.g., the number of subjects, platform, samples included).\nClick the green “Download Zip File For” button and select to download data for all differential expression profiles, all differentially expressed genes or probes, all heatmaps, or all GenePattern input files.",
    "Additional outputs are available if two or more CGPs are included. Click the black download icon to download files. Click on the heatmap icons to view the graphs in a pop-up window.\nThese are the outputs (Table 3[href=https://www.wicell.org#tbl3]):\ntable:files/protocols_protocol_1834_3.csv\nFor meta-analysis, click on the black download icons to download the output of the chosen method (Figure 5[href=https://www.wicell.org#fig5]C).\nThe output file has these fields if the user selects the RankProd method (Table 4[href=https://www.wicell.org#tbl4]):\ntable:files/protocols_protocol_1834_4.csv\nThe output file has these fields if the user selects the MetaIntegrator method (please see MetaIntegrator paper (Haynes et al., 2017[href=https://www.wicell.org#bib10]) for more details) (Table 5[href=https://www.wicell.org#tbl5]):\ntable:files/protocols_protocol_1834_5.csv\nClick on the black download icons to download lists of differentially up-regulated or down-regulated genes or probes.\nClick the green “Download CGP Information” button to download an Excel file with information about each CGP in the analysis (e.g., the number of subjects, platform, samples included).\nOpen any of the downloaded tables in Excel or a similar program to inspect the results of your analysis further.\nRESTful API\nTiming: 10 min\nThis step describes how to access OMiCC data using an API. A RESTful API (application programming interface) defines a set of functions through which users can interface directly with the OMiCC software from their computer to receive information from OMiCC.\nIn the toolbar, click “Document” then “RESTful APIs” for a list of API functions to access OMiCC’s internal data, such as GEO studies, samples, platforms, public sample groups and CGPs.\nUsing the APIs requires users to acquire an access token from OMiCC. Use the following URL to get the token: https://omicc.niaid.nih.gov/api/login[href=https://omicc.niaid.nih.gov/api/login] with your username and password in the request. For details, please refer to the RESTful API documents."
  ],
  "subjectAreas": [
    "Genomics",
    "Gene Expression",
    "Rnaseq",
    "Bioinformatics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}