{
  "id": 5364,
  "origin_website": "Bio",
  "title": "Force Measurement on <em>Mycoplasma mobile</em> Gliding Using Optical Tweezers",
  "procedures": [
    "Coating polystyrene beads with avidinWarm polystyrene beads, coupling buffer and PBS to room temperature (RT).Centrifuge 60 µl polystyrene bead suspension at 2,000 x g for 6 min at RT.Discard supernatant, resuspend the pellet in 400 µl of coupling buffer and centrifuge it at 2,000 x g for 6 min at RT.Discard supernatant, resuspend the pellet in 160 µl of coupling buffer.Just before use, dissolve 11.7 mg of EDAC in 50 µl of coupling buffer, add 20 µl of this solution to the suspension and incubate for 5 min at RT.Dissolve 0.4 mg of avidin in 10 µl of coupling buffer to be 0.13 mM as the final concentration, add the avidin solution to the suspension and incubate it with gently end-over-end mixing for 3 h at RT.Centrifuge the suspension at 2,000 x g for 6 min at RT, discard the supernatant and resuspend the pellet in 450 µl of PBS. Repeat this step five times.Transfer the suspension to new microtube and storage it at 4 °C until use (it can be stored for 6 months).Biotinylation of M. mobile cell surfaceInoculate 1 ml of frozen stock of M. mobile into 10 ml of Aluotto medium in a 25 cm2 tissue culture flask and statically cultivate it at 25 °C to reach an optical density at 600 nm of 0.06-0.08.Collect 9 ml of cultured cells by centrifugation at 12,000 x g for 4 min at RT, discard supernatant, resuspend the cell pellet in 900 µl of PBS/G and centrifuge it at 12,000 x g for 4 min at RT (Note 2).Just before use, prepare a 0.5 mM of Sulfo-NHS-LC-LC-biotin solution by dissolving 0.3 mg of Sulfo-NHS-LC-LC-biotin in 1 ml of PBS/G.",
    "Discard supernatant of step B2, resuspend the cell pellet (Note 2) in 300 µl of Sulfo-NHS-LC-LC-biotin solution and incubate the cell suspension for 15 min at RT (Hiratsuka et al., 2006).Centrifuge the suspension at 12,000 x g for 4 min at RT, discard supernatant, and resuspend the cell pellet (Note 2) in 300 µl of PBS/G. Repeat this step three times.Force measurement by using optical tweezersPrepare a tunnel chamber (5-mm interior width, 18-mm length, 60-μm wall thickness) composed of two cover glasses from box, and double-sided tapes (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170203/20170203182056_2573.jpgFigure 1. Tunnel chamber (step C1)To coat the glass surface with glycoproteins, inject 20 µl of 10% horse serum in PBS/G into the tunnel chamber and incubate it for 15 min at RT (Note 3).Dilute the suspension of biotinylated cell with a 10 to 20-fold volume of PBS/G.Wash the tunnel chamber by flowing 40 µl of PBS/G, inject 20 µl of the diluted cell suspension into the tunnel chamber and incubate it for 15 min at RT.To remove floating cells, insert 20 µl of PBS/G into the tunnel chamber.Add the avidin-coated beads in PBS to the same volume of PBS containing 40 mM glucose, for adjusting glucose concentration to 20 mM.Dilute the bead suspension with PBS/G to get an appropriate bead density (10-20 beads per a 125.4 x 70.6 µm field of view) for the force measurements.Transfer 40 µl of bead suspension to a new microtube and sonicate it for 20 sec.Inject sonicated bead suspension into the tunnel chamber and seal both ends with nail polish.Set and fix the tunnel chamber by mending tapes onto the stage of inverted microscope equipped with optical tweezers (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170203/20170203182236_0663.jpgFigure 2.",
    "Setting tunnel chamber on microscope stage (step C10)Trap a floating bead near the bottom of glass surface by focused laser beam, start to record the bead movements at 200 frames per second and immediately attached the bead to the back end of the gliding cell through the avidin-biotin interaction. The cell pulls the bead from trap center of optical tweezers and finally stalls (Video 1). The recording should be continued at least 30 sec after the start of stall (Note 4). After recording, turn off the laser beam.Remove the tunnel chamber and objective lens, turn on the laser beam to the same power as the step C11 and measure the applied laser power of the parallel light, which was achieved by the removal of objective lens, with using a power meter.Trace the bead movement from the trap center of optical tweezers and calculate the force from the distance between centers of the bead and the laser beam, by using ImageJ and IGOR Pro, as previously described (Tanaka et al., 2016).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Trapping of bead and attachment to gliding cell (step C11). Focused point of laser beam is indicated by a red circle, marked ‘Trap center’. At 5 sec, a flowing bead came from the right side and trapped at the beam. At 18 sec, a gliding cell was moved into the field by stage handling. At 27 sec, the bead was attached to the gliding cell. The cell pulled the trapped bead and stalled from 33 sec to the end."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}