{
  "id": 4017,
  "origin_website": "Cell",
  "title": "Protocol to analyze circulating small non-coding RNAs by high-throughput RNA sequencing from human plasma samples",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCollection of human peripheral blood and plasma isolation and storage\nTiming: 2 h maximum\nThis step describes how to properly isolate plasma from human whole blood in order to avoid pre-analytical biases leading to discrepancies in the downstream analyses.\nDraw blood using BD vacutainer Safety-Lok butterflies in order to avoid hemolysis of blood samples. For sncRNA analysis, blood should be collected in K3 or K2-EDTA Vacutainer tubes (suggested: BD Vacutainer K2-EDTA tubes, 3.0 mL).\nInvert K2-EDTA Vacutainer tubes 10 times. Blood tubes can be stored upright at room temperature (15°C–25°C) for maximum 2 h.\nProcess blood samples to isolate plasma within 2 h from blood draw, according to the following steps:\nCentrifuge blood containing K2-EDTA Vacutainer tubes at 1800×g for 10 min at room temperature.\nNote: at this stage, centrifuging at room temperature is important in order to avoid platelet activation (Tablin et al., 2000[href=https://www.wicell.org#bib18]). Activated platelets can release microvesicles containing sncRNAs thus biasing the original content of the sample (Diehl et al., 2012[href=https://www.wicell.org#bib5]; Xia et al., 2018[href=https://www.wicell.org#bib22]).\nNote: blood processing at 4°C appears to be attractive, because enzymatic degradation processes are reduced at low temperatures. However, platelets become activated at low temperatures (as reported in Tablin et al., 2000[href=https://www.wicell.org#bib18]) and release intracellular proteins, enzymes and microvesicles-containing small RNAs, which significantly affect samples composition. Thus, blood processing at low temperatures should be performed only after platelets removal. Since one centrifugation step may not be enough for depletion of platelets below 10 cells/mL, a second centrifugation step [usually between 1,200–2,500×g for 15 min at room temperature (in our protocol 1200g×g for 20 min)] or filtration step may be required to obtain platelet poor plasma.\nTransfer the plasma layer into a nuclease- and pyrogen-free tube (Eppendorf style) for second centrifugation.",
    "Note: Plasma should be transferred in a way to avoid possible contamination. Please wear lab coats and gloves, carefully clean the work bench before and after, with an appropriate cleaner (EtOH 70% and RNAse ZAP-like solution). Please, use nuclease-free sterilized filter tips (RNase-, DNase-, DNA- and pyrogen-free) ensuring the use of clean pipettes, change the pipette filter tip after each sample when collecting plasma; be aware not to touch the buffy coat layer with pipette tip in order to avoid blood cell contamination.\nCollect plasma in a 2.0 mL sterile and nuclease-free tube (Eppendorf style tube) (Expected 600 μL to 1 mL of plasma for a total of 3–5 aliquots depending on the initial blood sample volume).\nCheck plasma and note state, as shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig2.jpg\nFigure 2. Plasma state\nPicture showing normal and hemolyzed plasma samples collected in a 2.0 mL tube after the first centrifuge.\nCentrifuge collected plasma samples at 1200×g for 20 min at 10°C.\nNote: this second centrifugation step is necessary to remove eventual contaminant cells, cell debris and remaining platelets (Shin et al., 2017[href=https://www.wicell.org#bib16]; Zheng et al., 2013[href=https://www.wicell.org#bib23]).\nCollect plasma aliquots (220 μL) into new nuclease-free sterile collection tubes and temporarily store them on ice while transferring to −80°C freezer.\nStore plasma aliquots at −80°C until use.\nPlease, refer to Figure 3[href=https://www.wicell.org#fig3] for a rapid overview of blood collection and plasma isolation protocol.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig3.jpg\nFigure 3. Blood collection and processing workflow\nFollowing plasma isolation, hemolysis rate should be evaluated, according to the following steps (Shah et al., 2016[href=https://www.wicell.org#bib15]):\nUsing a drop spectrophotometer (e.g., Nanodrop, Nanovue, etc.), read the plasma (2 μL) absorbance at 414 nm wavelength (hemoglobin absorbance peak).\nIf absorbance is lower than 0.072 absorbance unit (AU), the sample is not considered hemolyzed.",
    "If absorbance is comprised between 0.072 and 0.3 AU it could be low-moderate hemolyzed. In this case, consider including it in your analysis with reserve to further check the small RNAs profile upon sequencing for relevant global changes of small RNAs.\nIf absorbance is higher than 0.3 AU, the sample is highly hemolyzed and should be excluded from further analysis.\nCritical: aliquots should be prepared by considering a volume of 220 μL (10% volume excess). Multiple aliquots from the same plasma sample should be prepared in order to avoid freeze-thaw cycles, which affect sncRNA stability and the following recovery and analyses. Plasma aliquots must be transferred and stored at −80°C to preserve RNA integrity (Sourvinou et al., 2013[href=https://www.wicell.org#bib17]).\nCritical: it is important to process plasma samples within 2 hours from collection since the expression of some miRNAs could be modified in a time-dependent fashion (e.g., miR-15b and miR-191) (Khan et al., 2017[href=https://www.wicell.org#bib10]).\nCritical: EDTA tubes are absolutely preferred to other anticoagulants. Indeed, heparin should be avoided due to its ability to inhibit enzymes used in downstream reactions, thus leading to miRNAs expression modifications. Additionally, sodium citrate is not recommended due to its ability to enhance sensitivity to hemolysis (Cui et al., 2011[href=https://www.wicell.org#bib4]; Khan et al., 2017[href=https://www.wicell.org#bib10]).\nRNA extraction\nTiming: 1 h 30 min\nRNA extraction is performed from 200 μL of plasma using Plasma/Serum RNA Purification Mini Kit from Norgen (see Key Resource Table) following manual’s instructions (https://norgenbiotek.com/sites/default/files/resources/Plasma-Serum-RNA-Purification-Kit-PI55000-5.pdf[href=https://norgenbiotek.com/sites/default/files/resources/Plasma-Serum-RNA-Purification-Kit-PI55000-5.pdf]) with minor modifications.",
    "Optimal and best performing RNA extraction method was selected among three different candidate protocols following an explorative sncRNA sequencing experiment performed on plasma samples deriving from a healthy subject. Briefly, total RNA was extracted from 200 μL of human plasma using n=3 different RNA extraction kits (200 μL/each kit): a) Advanced miRNeasy, b) Machery-Nagel and c) Norgen. sncRNA libraries were generated through QIASEQ miRNA library kit, and subsequently sequenced using MiSeqDX platform. In details, data analyses showed that all RNA extraction kits were able to generate sncRNA libraries (Figure 4[href=https://www.wicell.org#fig4]A). Sequencing primary analysis revealed that Machery-Nagel resulted in 4.07×106reads/sample, Norgen libraries returned 3.91×106 reads/sample and Advanced MiRNeasy resulted in 3.55×106reads/sample (Figure 4[href=https://www.wicell.org#fig4]B). Among total reads, Machery-Nagel resulted in 26% of mapped miRNAs (normalized ratio on total reads), Norgen returned 44% miRNAs composition rate and Advanced MiRNeasy returned 49% miRNAs (Figure 4[href=https://www.wicell.org#fig4]C). In this set of experiments, both Norgen and Advanced MiRNeasy kits outperformed similarly, then they can be both adopted in this workflow. In our standardized protocol, we adopted Norgen kit and further described its specific procedure below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig4.jpg\nFigure 4. RNA extraction kits\nFigure showing the results of small RNA sequencing on RNA extracted from plasma (200 μL) of a single human healthy subject with n=3 different RNA extraction kits. (A) Bioanalyzer electropherograms showing profiles of libraries generated using miRNeasy Advanced protocol (Average peak 175 bp), Machery-Nagel protocol (Average peak 183 bp) and Norgen protocol (Average peak 182 bp). Sequencing primary analysis revealed that (B) Machery-Nagel RNA libraries resulted in 4.07×106 reads; Advanced miRNeasy RNA libraries resulted in 3.55×106 reads and Norgen RNA libraries resulted in 3.91×106 reads. Among total reads (C) Machery Nagel enriched for 26% of miRNAs, Advanced miRNeasy enriched for 49% miRNAs, and Norgen enriched for 44% miRNAs. This latter was chosen as RNA extraction protocol.",
    "Thaw plasma samples (200 μL) on ice.\nNote: Complete thawing of a 200 μL plasma aliquot on ice requires approximately 30 minutes.\nPrepare complete Lysis Buffer A: warm Lysis Buffer A (included in the Norgen kit) at 60°C for at least 20 min to dissolve eventual precipitates. When at room temperature, add 10 μL of β-Mercaptoethanol for each mL of Lysis Buffer A.\nCritical: Please ensure that Lysis Buffer A is completely resuspended, and no further precipitate is visible before proceeding. An uncomplete resuspension of Lysis Buffer A as well as non-addition of β-Mercaptoethanol could result into an inefficient lysis leading to a low RNA recovery. See Figure 5[href=https://www.wicell.org#fig5] for a complete resuspended Lysis Buffer A working solution.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig5.jpg\nFigure 5. Norgen Lysis Buffer A\nNorgen Lysis Buffer A working solution should appear clear, transparent and without precipitates before proceeding to RNA extraction.\nCentrifuge plasma samples 400×g for 2 min at room temperature before processing.\nNote: this step is critical to further remove cell debris and larger particles from plasma samples.\nTransfer 200 μL of centrifuged plasma sample into a new 2.0 mL tube (sterile, nuclease-free, pyrogen-free).\nAdd a volume of 600 μL of Lysis Buffer A + β-Mercaptoethanol. Mix well by vortexing for 10 s.\nAdd 800 μL of 96–100% ethanol. Mix well by vortexing for 10 s.\nTransfer 650 μL of the resulting mixture into a Micro Spin column (included in Norgen kit). Centrifuge 3,300×g for 2 min. Discard the flow-through and reassemble the spin column with its collection tube.\nRepeat this step twice more, until the whole mixture has been transferred to the Micro Spin column.\nAdd 400 μL of Wash Solution A to the column and centrifuge for 30 s at 3,300×g; discard the flow-through and reassemble the spin column with its collection tube.",
    "Repeat this step twice more, for a total of three washes.\nSpin the column, empty, for 2 min at 13,000×g. Discard the collection tube.\nTransfer the spin column to a fresh 1.5 mL elution tube.\nElute by adding 20 μL of Elution Solution A to the column and let stand at room temperature for 2 min.\nCentrifuge for 1 min at 400×g, followed by 2 min at 5,800×g.\nTransfer the eluted volume back to the column and let stand at room temperature for 2 min.\nCentrifuge for 1 min at 400×g, followed by 2 min at 5,800×g.\nApproximately, a final eluted volume of 18 μL should be present in the tube.\nMaintain the tube on ice until storage at −80°C.\nNote: it is not helpful to quantify extracted total RNA from 200 μl of human plasma samples since the absolute quantity is generally too low for commonly used RNA quantification methods (e.g., Spectrophotometer, Spectrofluorometer or capillary electrophoresis) (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig6.jpg\nFigure 6. Bioanalyzer 2100 electropherograms\nBioanalyzer 2100 electropherograms showing (A) the enrichment of sncRNA species (blue rectangle) in RNA extracted from 50 μL of murine plasma, (B) undetectability (below detection limit and similar to a negative CTR) of sncRNA species in RNA extracted from 50 μL of human plasma (blue rectangle). In order to consistently quantify (ng) circulating sncRNA species in human plasma samples, RNA should be extracted at least from 1.0 mL of human plasma (C).\nSncRNA library preparation and quality controls (QCs)\nTiming: 2 days for 8–16 samples/each lab operator",
    "In this section, we describe a systematic protocol to prepare sncRNA libraries using Qiaseq miRNAs Library kit (see Key Resource Table[href=https://www.wicell.org#key-resources-table]) following manufacturer’s instructions (https://www.qiagen.com/us/resources/resourcedetail?id=f0b9d117-f8c6-4825-9069-3236ed65521d[href=https://www.qiagen.com/us/resources/resourcedetail?id=f0b9d117-f8c6-4825-9069-3236ed65521d]) with modifications. This library preparation kit was chosen based on the large use of QIASeq MicroRNA kit reported in literature, where it is reported as the most performant kit (Heinicke et al., 2020[href=https://www.wicell.org#bib9]) (Wong et al., 2019[href=https://www.wicell.org#bib21]), as well as based on a previous set of experiments on murine plasma samples, aimed at comparing different sncRNAs library preparation kits, and showing that QIASeq returned the best results in terms of quality and yield (data not shown).\nThe following protocol (see Summarizing scheme below) is designed for optimal preparation of eight samples/reaction. Based on our experience we suggest processing no more than sixteen samples/reaction, since some steps require quick and straightforward handling; however, here we consider libraries preparations standardized on 8 samples/reaction. Delays in completing some steps (e.g., cDNA cleanup) significantly affect the quality of cDNA libraries preparation.\ntable:files/protocols_protocol_732_2.csv\nPerform 3′ Adapter ligation reaction (for 8 samples) as follows:\nThaw at room temperature: 3′ Adapter, 3′ Buffer, 2× Ligation Activator (located at −20°C) and then resuspend the reagents by flicking and briefly centrifuging the tubes.\nThaw RNA samples on ice, resuspend them by flicking, and briefly centrifuge the tubes; then put RNA samples on ice.\nDilute 3′ Adapter 1:5 in a 0.5 mL tube: 2 μL 3′ Adapter + 8 μL nuclease-free water (keep at room temperature). Spin down, resuspend up and down (15 times) with pipette volume set to 8 μL and spin down again.\nPrepare 3′ Adapter ligation mix on ice and add components according to the following order:\ntable:files/protocols_protocol_732_3.csv\naFinal volumes include a 5% excess calculation.",
    "bNote: The input RNA volume is 5 μL/18 μL of total eluted RNA per sample. Increasing input RNA quantity by performing a Speedvac (10 minutes room temperature) step (18 μL→5 μL) of the total eluted RNA, in order to load the entire volume of extracted RNA, did not improve sncRNA libraries yield, QC, sequencing metrics and reads distribution of Small RNA species (Figure 7[href=https://www.wicell.org#fig7]).\nBriefly centrifuge, pipette up and down 15 times with a micropipette set to 120 μL, centrifuge again.\nPrepare 2 rows of a 96-well plate (Figure 8[href=https://www.wicell.org#fig8]A). Use the right-sided row of the well plate and mark it with a pen marker. Place them into a cooler (Figure 8[href=https://www.wicell.org#fig8]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig7.jpg\nFigure 7. Reads distribution\nStacked bars showing reads distribution of small RNA libraries generated from 5 μL of RNA concentrated through Speedvac vacuum centrifuge extracted from plasma of n=28 healthy subjects. MiRNAs are the more represented species of small RNA, corresponding to a mean of 23.6%.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig8.jpg\nFigure 8. Plates preparation\n(A) Before cutting the 2 rows from the plate, apply a PCR adhesive film on it in order to avoid contamination.\n(B) 2 rows of a 96 well plate prepared for 3′ Adapter ligation reaction for 8 samples. Place the 2 rows in a thermo cooler rack in order to keep a low temperature of the reactions.\nAdd 15 μL/well of MIX to the bottom of the well.\nAdd 5 μL of RNA sample per well.\nResuspend 15 times with multichannel micropipette set to a 10 μL volume.\nCap with a row of strips and briefly spin down.\nStart the reaction according to the following thermal cycler steps:\ntable:files/protocols_protocol_732_4.csv\nCritical: this reaction is very viscous due to the Ligation activator reagent. Pipette slowly and carefully.",
    "Critical: the efficiency of the thermal cycler may affect the yield of the libraries. For the present protocol we adopted the SimpliAmp thermal cycler (see Key Resource Table) with the following specifications: 96-well 0.2 mL Veriflex Block; Max block Ramp rate: 4°C/second; Max sample ramp rate: 3°C/sec; Temperature accuracy: ± 0.25°C (35.0°C–99.9°C); Temperature Uniformity: <0.5°C.\nCritical: in order to avoid contamination between samples and libraries, it is essential to clean gloves with 70% EtOH every time you cap and uncork the wells with the strips. Maintain this caution for all libraries preparation steps.\nNote: for all reactions, enzymes should be thawed at the time of use and immediately put on ice.\nPerform 5′ Adapter ligation reaction (for 8 samples) as follows:\nThaw at room temperature the 5′ Adapter and 5′ Buffer reagents. Bring them to room temperature. Resuspend and spin down.\nDilute 5′ Adapter 1:2.5 in a 0.5 mL tube: 4 μL 5′ Adapter + 6 μL nuclease-free water. Resuspend 15 times by pipette with volume set to 8 μL and spin down again.\nPrepare reaction mix on ice and add components according to the following order:\ntable:files/protocols_protocol_732_5.csv\naFinal volumes include a 5% excess calculation.\nPipette 15 times with multichannel pipette volume set to 140 μL.\nRemove 3′ Ligation reactions from thermal cycler, briefly spin down and place back into cooler.\nUncork the strip from 3′ Ligation reactions and add 20 μL of MIX to each well.\nResuspend 15 times with 30–300 μL multichannel pipette with volume set to 35 μL.\nCap again with a new strip, briefly spin down and start the reaction according to the following thermal cycler steps:\ntable:files/protocols_protocol_732_6.csv\nCritical: in order to avoid freezing of samples, remember (from this reaction onward) to put 96-well thermal cooler at room temperature few minutes before starting the reaction.",
    "Prepare and activate beads (for 8 samples) as follows:\nTake DynaMag2 Magnet (16 positions for 2.0 mL tubes).\nTake Beads bottle and Beads Binding Buffer bottle (both at +4°C).\nConsider 400 μL beads/sample×8 = 3,200 μL to distribute in 2 × 2.0 mL tubes (1,600 μL/each tube).\nVortex bottle beads for about 1 min.\nAdd 1,600 μL of beads into the first tube by making two 800 μL pipettings (pipette slowly).\nVortex the beads bottle again for about 30 s and add another 1,600 μL into the second tube by performing two pipettings of 800 μL (pipette slowly).\nPlace the 2 tubes into the Dynamag2 magnet. The beads will migrate in about 15–20 min.\nBriefly vortex the Bead Binding Buffer.\nRemove the supernatant from the beads with the p1000 set to 800 μL, very slowly and with the tubes still on the magnet. Be sure not to remove the beads and make sure the beads have fully migrated.\nRemove the tubes from the magnet and add 600 μL of Beads Binding Buffer (150 μL Beads Binding Buffer/sample: ×4/tube = 600 μL /each tube from 2.0 mL) directly onto the beads.\nVortex the two tubes for about 1 min at high speed and briefly spin down.\nPlace the two tubes back on the magnet for about 10–12 min or until the beads have migrated.\nRemove the supernatant very slowly avoiding taking beads away (check the tip).\nVortex the Beads Binding Buffer.\nPull the tubes away from the magnet.\nAdd 1,600 μL of Bead Binding Buffer/sample (400 μL Beads Binding Buffer/sample: ×4/× tube = 1,600 μL/each tube from 2.0 mL) directly onto the beads.\nVortex until the beads are homogeneously resuspended (example in Figure 9[href=https://www.wicell.org#fig9]) and store at +4°C.",
    "Critical: in order to avoid carry away beads thus modifying their concentration, leave a minimal liquid volume in the first step of supernatant elimination following beads complete migration. Also avoid letting beads go into the cap; if they do go into the cap briefly spin down.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig9.jpg\nFigure 9. Beads resuspension state\nPictures show different levels of beads resuspension.\n(A) Beads not resuspended not usable for cleanup.\n(B) Beads not completely resuspended showing a small pellet, not usable for cleanup.\n(C) Beads completely resuspended usable for cleanup.\nNote: prepared and activated beads can be stored at +4°C and used within 1 week.\nPerform Reverse transcription (RT) initiation reaction:\nThaw at room temperature RT Initiator reagent, resuspend by flicking and briefly spin down.\nThaw the following reagents: RT Buffer, RT Primer, resuspend and briefly spin down.\nTake the 5′ Ligation reaction out of the thermal cycler and briefly spin down. Store into a thermal cooler.\nRemove the strips from the wells and add 2 μL of RT Initiator/Sample.\nResuspend 15 times with multichannel micropipette set to 35 μL.\nPut new strips and briefly spin down; start the reaction according to the following thermal cycler steps:\ntable:files/protocols_protocol_732_7.csv\nNote: RT Buffer and RT Primer could be thawed together with RT initiator; indeed, since RT initiation reaction takes circa 20 minutes, in this time the operator can start to dilute RT primers and to prepare RT mix for the following reaction.\nPerform RT reaction:\nDilute RT Primer 1:5 in nuclease-free water. For 8 samples: 4 μL RT Primers + 16 μL nuclease-free water; resuspend for 15 times and briefly spin down.\nPrepare RT MIX (for 8 samples) and maintain it on ice:\ntable:files/protocols_protocol_732_8.csv\naFinal volumes include a 5% excess calculation.\nResuspend 15 times with a multichannel pipette with volume set to 140 μL.",
    "Remove RT Initiator reactions from the thermal cycler, spin down, place it back into a cooler and remove strips.\nAdd 18 μL of RT mix/sample.\nResuspend 15 times with multichannel pipette set to 53 μL.\nStrip the tubes, spin down and start the reaction according to the following thermal cycler steps:\ntable:files/protocols_protocol_732_9.csv\nPerform cDNA cleanup:\nFreshly prepare 80% EtOH in nuclease-free sterile water.\nVortex beads for at least 1 min at a low vortex speed.\nFrom now on work at room temperature. Add 143 μL of previously activated beads/well. Vortex beads every 2 wells.\nResuspend 20 times with multichannel micropipette set at 190 μL and incubate 5 min at room temperature.\nPlace samples to the 96-well magnet and do not remove until the end of the procedure.\nIncubate 15 min to allow complete migration of the beads.\nAdd 5.0 mL of 80% EtOH into the reservoirs and remove supernatant with multichannel micropipette set at 190 μL. Aspirate slowly and leave a small volume.\nAdd 200 μL 80% EtOH/sample.\nRecover all 80% EtOH with volume set to 200 μL and repeat step h. and i.\nCap with strips. Very briefly spin down and put back on magnet 1 min.\nAspirate remaining volume with 10 μL multichannel pipette (several times if needed).\nPerform air dry 10–12 min (beads drying shown in Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig10.jpg\nFigure 10. Beads drying state\nThis picture shows 3 different levels of beads drying. From right to left: those named ‘cracked beads’ are too much dried and cannot further be considered to elute the sample; those named ‘wet beads’ have not yet completely dried, thus containing ethanol which can influence sequencing analyses; those named ‘dry beads’ are completely dried but not cracked and are perfect to be hydrated with water to perform elution step.",
    "Add 17 μL of nuclease-free water directly onto the beads (without touching them with the tip).\nRemove from magnet and resuspend by pipetting 20 times.\nIncubate 2 min at room temperature.\nPlace back on magnet for 2 min.\nRecover 15 μL/sample and transfer to another sterile well of 96 wells plate (as previously shown in Figure 8[href=https://www.wicell.org#fig8]).\nCritical: do not pass with anything (pipette, hands, etc.) over the reservoir containing EtOH; if EtOH is contaminated, also libraries will be contaminated.\nCritical: prepare 10 mL of 80% EtOH, of which 5.0 mL are used for the first cleanup and the remaining 5.0 mL are used for the second cleanup. However, immediately following usage, EtOH-remaining-volume must be para-filmed, otherwise its concentration will be reduced due to evaporation.\nCritical: air dry is a critical step, since the not complete dry (which means EtOH-remaining volume) could influence the following sequencing analyses; on the other side, too much dried beads will result in a low libraries recovery and low libraries concentrations.\nPause Point: the eluted material can be stored at −20°C before to proceed to the next step the next day. In our experience, stopping at this step results in a higher libraries concentration (Average 120 nM vs average 30 nM) (Example in Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig11.jpg\nFigure 11. Quality control of libraries following pause point step\nExamples of (A) n=3 electropherograms in which storage at −20°C pause point has been performed following cDNA cleanup and of (B) n=3 electropherograms in which storage at −20°C pause point has not been performed following cDNA cleanup. While libraries profiles were acceptable in both cases, the concentration is strongly reduced without pause point application (mean value w/ −20°C storage: 119,6 nM vs 79,45 Mean w/o −20°C storage).\nPerform cDNA amplification:",
    "Thaw at room temperature the Amplification Library Buffer reagent and nuclease-free water (troubleshooting: problem 1[href=https://www.wicell.org#sec7.1]).\nThaw Index Plate and place it into the cooler for few minutes. Cut the wells of interest (use fine scissors - e.g., from surgery) (Figure 12[href=https://www.wicell.org#fig12]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig12.jpg\nFigure 12. Index plate wells cutting\nPicture of index plate wells cutting.\nThaw cDNA and place it into the cooler.\nPrepare MIX (8 samples) in the following order:\ntable:files/protocols_protocol_732_10.csv\nResuspend by pipette 15 times with volume set at 185 μL.\nAdd 25 μL of MIX to each well of the cut index well (DO NOT PIPETTE).\nSpin down cDNA samples.\nTransfer 15 μL of each cDNA sample to its respective position in the index row.\nResuspend by pipette 25 times with pipette set to 34 μL. Do not spin (no new strips can be inserted).\nWith the tips still into the wells, set multichannel pipette volume to 42 μL. Transfer to a new well taking care to recover all the volume (repeat with multichannel at 10 μL if necessary).\nPut new strips onto the wells, spin down and start the reaction according to the following thermal cycler steps:\ntable:files/protocols_protocol_732_11.csv\nNote: the direction of the index row is indicated by the presence of numbers at the bottom.\nCritical: index plate should be left in thermal cooler for some minutes, otherwise the wells could break while being cut.\nCritical: indexes corresponding to a specific sample must be annotated, in order to associate each index to a sample for the following sequencing.\nCritical: it is necessary (although not planned by manual’s instructions) to transfer the reaction into new wells since caps of provided index plate are not airtight, and, consequently, the reaction could evaporate.\nPerform amplification product cleanup:",
    "Pull out prepared and activated beads from +4°C at least 5 min before starting.\nVortex the beads for 1 min to resuspend them and briefly spin down.\nRemove amplification reactions from thermal cycler, briefly spin down and put them in a rack at room temperature.\nVortex beads again (vortex high speed for few seconds and then low speed for 1 min).\nFrom now on work at room temperature.\nAdd 37.5 μL beads/sample (Vortex beads every two samples).\nResuspend 15 times with multichannel pipette set at 70 μL and incubate 5 min at room temperature.\nTransfer to the magnet and incubate at least 5 min or until complete migration is achieved.\nRecover all the supernatant by setting multichannel micropipette to 80 μL and transfer to new sterile wells placed on the rack. Carefully inspect whether no libraries volume is left in the wells: if necessary, recover the remaining volume with 10 μL multichannel pipette, then throw away beads.\nVortex beads bottle as previously done and add 65 μL beads/sample by vortexing every 2 samples.\nResuspend 15 times with multichannel pipette set at 120 μL and incubate 5 min at room temperature.\nTransfer to magnet and incubate for at least 10 min.\nTransfer 5.0 mL 80% EtOH into a new sterile reservoir.\nEliminate supernatant from the beads, taking care not to take away the beads, setting pipette to 135 μL.\nAdd 200 μL 80% EtOH/sample on the opposite side of the beads.\nRemove 80% EtOH and add 200 μL 80% EtOH again.\nRemove all the volume, cap with new strips and briefly (no more than 1 s) spin down.\nPlace back the plate on magnet and remove any residual volume.\nAir Dry 10–12 min on the magnet.\nAdd 17 μL nuclease-free water on the beads and remove from magnet.",
    "Resuspend about 20 times, setting pipette to 15 μL and incubate for 2 min at room temperature.\nTransfer the plate again onto the magnet for 2 min at room temperature.\nRecover 15 μL supernatant and transfer to a new sterile plate.\nMaintain samples into the cooler or store the samples at −20°C.\nMeasure libraries concentration using QUBIT 3.0 spectrofluorometer:\nWork with light off.\nFor each sample prepare working solution by adding 1 μL DNA high sensitivity QUBIT fluorescent reagent to 199 μL DNA high sensitivity QUBIT buffer (if you are going to analyze more samples, always calculate an extra sample for working solution preparation).\nTransfer 199 μL working solution into a QUBIT 0.5 mL new sterile tube and add 1 μL of each library; to read the standards, transfer 190 μL working solution into a QUBIT 0.5 mL new sterile tube and add 10 μL of each standard (#1 and #2).\nResuspend, spin down and incubate 2 min at room temperature.\nRead samples concentration with the program DNA → High sensitivity, selecting 1 μL as volume (troubleshooting: problem 2[href=https://www.wicell.org#sec7.3]).\nNote: it is not necessary to read standards every time. It is needed when more than one week from the last read passed, or if last time you have read samples with another kit (RNA, protein, etc.).\nPerform libraries quality control (QC) through Bioanalyzer 2100 by using dsDNA high sensitivity kit:\nBring to room temperature all reagents (ladder, marker, gel matrix and dye) at least 30 min before chip loading.\nPrepare gel dye mix by adding 15 μL blue dye into 300 μL gel matrix, vortex 30 s and briefly spin down.\nLoad the prepared gel dye mix onto dedicated filter and centrifuge 2,240×g 10 min.\nPrepare empty chip for electrodes wash by adding 450 μL of nuclease-free water.",
    "Remove and discard the filter from gel dye mix prepared tube.\nLoad 9 μL gel dye mix into the G chip well and perform chip priming (Figure 13[href=https://www.wicell.org#fig13]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig13.jpg\nFigure 13. Bioanalyzer 2100 dsDNA chip\nPicture showing Bioanalyzer 2100 dsDNA chip and different wells to perform chip priming and samples loading. In details, G wells (as indicated in the main text) are marked in pink, G well (as indicated in the main text) for chip priming is marked in red, and ladder well is marked in orange.\nLoad 9 μL gel dye mix into the G chip wells (n=3) (Figure 13[href=https://www.wicell.org#fig13]).\nLoad 5 μL marker in every well apart for G wells (n=4).\nLoad 1 μL samples into the appropriate wells and 1 μL ladder into the well illustrated in Figure 13[href=https://www.wicell.org#fig13].\nWash electrodes by applying wash chip (loaded with nuclease-free water) for 1 min, closing the instrument door; then allow electrodes to dry by leaving open the instrument door for 1 min.\nMeanwhile vortex the loaded chip for 1 min into the appropriate IKA MS3 vortex At 2400 RPM.\nLoad the chip onto the instrument.\nStart the run.\nFor specific results see “expected outcomes[href=https://www.wicell.org#expected-outcomes]” section (troubleshooting: problem 3[href=https://www.wicell.org#sec7.5])\nCritical: chip priming is an essential and critical step; plunger should return to at least 0.3 mL (usually 0.5 mL of the syringe plug scale), otherwise repeat chip priming on a new chip. Another critical step is sample loading; avoid bubbles and, above all, quickly load samples following marker loading, otherwise reagents will wear out in the meantime, resulting in a wrong run.\nPause Point: at this point libraries can be directly normalized or stored at −20°C (stable for several weeks).",
    "Note: prepared gel-dye mix is sufficient for five chips loading and can be used within 6 weeks from date of preparation.\nCalculate concentration, normalize and pooling libraries\nUse the following formula to calculate nM concentration of each Library sample:\n   Q U B I T  c o n c e n t r a t i o n    n g   μ l        A v e r a g e  p e a k  o f  s m a l l  R N A s  o f  B i o a n a l y z e r  2100    x  660   ×  10 6  \nNote: to select the correct Average peak of small RNAs please refer to the electropherogram and instructions shown in Figure 14[href=https://www.wicell.org#fig14].\nNormalize libraries concentration by dilution in nuclease-free water until 2.0 nM and performing an intermediate step to 10 nM if libraries are concentrated more than 20 nM.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig14.jpg\nFigure 14. Selection of region of interest in 2100 Expert software\nIn 2100 Expert software, the region of interest can be selected in the sheet ‘Region Table’ (red rectangle; selection of the region should consider the main peak starting from the beginning of this peak to the beginning of the hump at 290–300 bp (vertical blue lines). Following this selection, the Average Size in bp will be returned (green rectangle).\nRead Libraries concentration using QUBIT 3.0 after each intermediate or final dilution step and then proceed with further dilution or directly to pooling step.\nPool all normalized libraries using at least 3 μL of each diluted/normalized library.\nRead again the concentration obtained from the libraries multiplexed pool using QUBIT 3.0 spectrofluorometer as previously described.\nIf needed adjust the final concentration of the libraries pool (2 nM) by further diluting it with nuclease-free water.",
    "Critical: for libraries pooling, at least 3 μL of each library are required since smaller volumes result in a higher final concentration error. For libraries normalization consider an error range of ±0.3 nM (from 1.7 to 2.3 nM). A high variability between sample concentration could affect the equilibrium among different samples and the quality of small RNA sequencing (troubleshooting: problem 4[href=https://www.wicell.org#sec7.7]).\nSequencing sample sheet preparation\nTiming: variable, depending on samples number\nCreate an Illumina Account on Illumina website (URL: https://login.illumina.com[href=https://login.illumina.com]).\nDownload the latest version of Illumina Experiment Manager (IEM) software (v1.19.1) at the following link: https://emea.support.illumina.com/sequencing/sequencing_software/experiment_manager/downloads.htmL[href=https://emea.support.illumina.com/sequencing/sequencing_software/experiment_manager/downloads.html].\nInstall Illumina Experiment Manager software following instructions.\nFollowing installation, a folder named ‘Illumina’ will be generated in PC storage disk ‘C:Program Files (x86)’.\nThe ‘Illumina’ folder contains another folder named ‘Illumina Experiment Manager’ in which there are other sub-folders: ‘Applications’, ‘Genomes’, ‘IndexKits’ and ‘SamplePrepKits’.\nIn ‘SamplePrepKits’ folder, paste the ‘.txt’ file attached to this paper as Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Mmc1.zip] (Deposited as a dataset on Mendeley Data with the https://doi.org/10.17632/7zcb24xbmy.1[href=https://doi.org/10.17632/7zcb24xbmy.1], URL: https://data.mendeley.com/datasets/7zcb24xbmy/1[href=https://data.mendeley.com/datasets/7zcb24xbmy/1]).\nIn ‘Applications’ folder, paste the ‘.txt’ file attached to this paper as Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Mmc2.zip] (Deposited as a dataset on Mendeley Data with the https://doi.org/10.17632/74msx7j24b.1[href=https://doi.org/10.17632/74msx7j24b.1], URL: https://data.mendeley.com/datasets/74msx7j24b/1[href=https://data.mendeley.com/datasets/74msx7j24b/1]).\nOpen IEM software and select ‘Create Sample Plate’.\nSelect QIASEQ small RNA index adapters and press NEXT; rename the plate and press NEXT.\nRename your samples ID and assign to each sample the specific QIASEQ index used during amplification reaction; press finish.\nSave the plate template in a folder easy to find (the suggested folder is hidden, and it is difficult to find).\nNote: if you are going to sequence more than 96 samples you have to prepare more than one plate.",
    "Critical: be careful not to use the same QIAGEN index for two or more samples that will be sequenced in the same pool/lane of the Flow Cell! IEM will return an error, and Sample Sheet will not be generated.\nRe-open IEM software and select ‘Create Sample Sheet’\nThen select ‘NovaSeq’ instrument and press NEXT\nChoose ‘NovaSeq FASTQ only’ and press NEXT\nSelect the right Run parameters as indicated in Figure 15[href=https://www.wicell.org#fig15] and press NEXT:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig15.jpg\nFigure 15. Sample Sheet parameters\nSample Sheet parameters to be set on Illumina Experiment Manager software.\nNote: the option ‘Adapter Trimming’ indicates the trimming of the 3′Adapter, while ‘Adapter Trimming Read 2’ indicates the trimming of the 5′ Adapter.\nCritical: if you plan to perform reads mapping and primary analysis through GeneGlobe QIAGEN online software, deselect ‘Adapter Trimming’, since QIAGEN software algorithm requires 3′ Adapter to recognize a correct processed ‘.fastq’ file. Indeed, if 3′Adapters sequences are previously trimmed, Gene Globe analysis generates an error, and the files cannot be further processed.\nPress ‘Select Plate’: in the box at right all the samples you listed in the previously prepared plate will appear.\nSelect all the samples that will be sequenced in the same lane of the Flow Cell and select the lane; then press ‘Add selected samples’ and ‘Finish’.\nSave the prepared Sample Sheet in ‘.csv’ format.\nDO NOT OPEN the Sample Sheet in Excel when the software asks.\nNote: if it is necessary to open and check the Sample Sheet, open it as ‘.txt’ file, otherwise it will not be recognized later on by NovaSeq 6000 instrument.\nNovaSeq 6000 sncRNA sequencing using NovaSeq XP protocol\nTiming: 1 day\nThe day before sequencing prepare and autoclave:\nNaOH 1N in nuclease-free water.\nTris-HCl 400 mM pH 8.0 in nuclease-free water.",
    "Tris-HCl 10 mM pH 8.5 in nuclease-free water.\nNote: following protocol and data have been set up using SP flow cell. In order to optimize the protocol on the other flow cells (S1, S2 or S4), please refer to Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_732_12.csv\nThaw SBS and Cluster cartridges by placing them in a room temperature water bath (19°C–25°C) by submerging approximately halfway for 3 h.\nNote: Use cartridges within 4 hours from the complete thawing.\nDilute libraries and PhyX control and pool them (the following steps refer to SP/S1 Flow cell loading concentration and volumes):\nThaw Library pool and PhiX 10 nM on ice.\nPrepare 3 clean sterile 1.5 mL nuclease-free tubes.\nFinal loading concentration of Library pools is 175 pM.\nNormalize/dilute Library pool as following (Final concentration: 0.95 nM): 9.5 μL of 2 nM Library pool+10.5 μL TrisHCl 10 mM pH 8.5.\nDilute 10 nM PhiX control until 0.25 nM (1:40) in TrisHCl 10 mM pH 8.5: 1 μL of 10 nM PhiX + 39 μL TrisHCl pH 8.5.\nMix 2.25 μL of diluted PhiX control with 15.75 μL of 0.95 nM normalized Library pool (PhiX control 6 %, Final Volume=18 μL).\nBefore to proceed to denaturation:\nThaw DPX1, DPX2 and DPX3 ExAmp reagents at room temperature for 15 min, then place them on ice.\nPut Flow Cell at room temperature for 30 min before loading.\nNote: use Flow Cell within 12 hours!\nDenature libraries and PhyX pool:\nDilute 1N NaOH solution (to be diluted immediately before the use) until 0.2 N in nuclease-free water by mixing 2 μL of 1N NaOH with 8 μL of nuclease-free water.",
    "Denature normalized/diluted Library pool (A and B) and PhiX control mix (Vol=18 μL) by adding 4 μL of 0.2 N NaOH to each mix; then cap the tube, briefly vortex and centrifuge 280×g for 1 min; allow the denaturation by incubating the sample 8 min at room temperature.\nAdd 5 μL of 400 mM TrisHCl pH 8.0; then cap the tube, briefly vortex and centrifuge 280×g for 1 min to obtain a final volume of 27 μL.\nPlace the denatured Library pool on ice.\nPrepare Flow cell:\nPlace the NovaSeq Xp flow cell dock (see Key Resource Table) on a flat surface and keep it until the loading onto the instrument.\nWear a new clean pair of gloves not to contaminate the glass of flow cell dock and remove the clear plastic by peel opening the foil from the corner tab.\nRemove the flow cell dock from the package by touching it by the sides not to touch the glass.\nInspect the dock is free from particulate; if particulate is present clean the surface with a lint-free alcohol wipe.\nInvert the flow cell so that the top surface faces downward (with the movement indicated in Figure 16[href=https://www.wicell.org#fig16]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig16.jpg\nFigure 16. Flow cell inversion movement\nMovement by which flow cell should be inverted.\nNote: in this case, pool A contains n=28 libraries whose preparation has been performed using 5/18 μL of RNA; pool B contains n=28 libraries whose preparation has been performed using 5 μL of concentrated RNA from the total 18 μL of eluted RNA (test performed as reported in 3′ Adapter Ligation note).\nSlip the outlet end of the flow cell under the bracket and place it onto the dock.",
    "Load the Novaseq Xp manifold over the inlet end of the flow cell (be careful that the manifold fit securely).\nClose the clamp to block flow cell and manifold and seal the gaskets.\nPrepare ExAmp Master Mix:\nBriefly vortex DPX1, DPX2 and DPX3 reagents and briefly centrifuge it.\nIn a sterile nuclease-free 1.7 mL tube mix: 126 μL of DPX1, 18 μL of DPX2 and 66 μL of DPX3 to obtain a final volume of 210 μL of ExAmp Master Mix (the mix could appear cloudy: it is normal).\nMix the reagent by slowly pipetting with a p200 micropipette and vortex 30 s.\nCentrifuge the mix at 280×g for 1 min and immediately proceed to the loading.\nCritical: DPX2 and even more DPX3 are very viscous reagents: be careful to take the right volume.\nLoad libraries onto the Flow Cell:\nAdd 63 μL ExAmp Master Mix in the tube containing 27 μL of denatured Library pool, vortex for 30 s and centrifuge at 280×g for 1 min.\nSlowly load 80 μL of mixed Sample + ExAmp mix to each Novaseq Xp manifold well; avoid touching the filter.\nWait 2 min to allow the mixture to reach the opposite side of the lane (do not touch the flow cell!).\nNote: the manifold wells are reversed, so be sure to load the right sample in the right well (as indicated in Figure 17[href=https://www.wicell.org#fig17]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/732-Fig17.jpg\nFigure 17. Flow cell inverted order\nFigure representing the inverted order of the two lanes of the flow cell.\nNote: Do not tilt the flow cell.\nPrepare thawed SBS and Cluster cartridges\nCarefully inspect the cartridges that should be free of ice and water.\nInvert the cartridges 10 times to mix reagents, and gently tap the cartridges to break all bubbles.\nLoad empty Library tube",
    "Uncap the Library tube provided with the NovaSeq 6000 reagent kit.\nInsert in position #8 the uncapped empty Library tube.\nSet up a sequencing run\nFrom the Home screen select Sequence and then select A or B (A+B to select a dual flow cell run).\nSelect OK to acknowledge the warning and open the flow cell door.\nLoad the flow cell onto the instrument\nInspect the flow cell stage that should be clean; if particulate is present clean the entire stage, including glass, fluidic interface and flow cell holder with alcohol and dry with lint-free wipe.\nRemove the flow cell from the dock:\nOpen the clamp that blocks flow cell and manifold.\nCarefully remove and discard the manifold.\nClean the flow cell with alcohol and dry with lint-free wipe if liquid drops are present.\nRemove the flow cell by grasping it from the sides.\nClean the gaskets (without touching them) with alcohol and dry with lint-free wipe if liquid drops are present.\nInvert the flow cell as previously described in Figure 16[href=https://www.wicell.org#fig16].\nClean the dock with alcohol and dry with lint-free wipe if particulate is present.\nAlign the flow cell over the four raised clamps and place it on the flow cell stage.\nSelect Close Flow Cell door (the flow cell ID will appear on the screen).\nLoad the SBS and Cluster Cartridges:\nOpen the liquid compartment doors and then open the reagent chiller door.\nLoad the cartridges (the SBS cartridge with the gray label into the left position, and the cluster cartridges with the orange label into the right position).\nSide the drawer into the chiller and close the reagent chiller door (The Library tube ID will appear on the screen).\nLoad the buffer cartridges and start run:\nPull the metal handle to open the buffer drawer.",
    "Place the buffer cartridge into the buffer drawer so that the Illumina label faces the front of the drawer and align the cartridge.\nSelect the button Log In to sign in to BaseSpace Sequence Hub.\nTo send run data to BaseSpace Sequence Hub for remote monitoring and data analysis, select Run Monitoring and Storage (this option requires a Sample Sheet).\nEnter your BaseSpace Sequence Hub username and password and select Sign In.\nIf prompted, select a workgroup to upload run data to and select Run Setup.\nSelect a workflow type (in this case NovaSeq Xp) and rename the run.\nEnter the number of cycles and index length. Read1 76 cycles Index1 8 Read2 0 Index2 0\nSelect Advanced options, select Sample Sheet and Browse to upload your ready Sample Sheet (.csv).\nSelect Start Run and wait about 5 min until the pre-run check is completed.\nNote: although the sequencing run is 1×75, when setting the parameters in the instrument, one more cycle should be considered; indeed, one more cycle is required for instrument phasing and prephasing calculations (Kircher et al., 2011[href=https://www.wicell.org#bib11]).\nCritical: In order to correctly perform data analysis using BaseSpace and then GeneGlobe QIAGEN miRNA quantification:\nUse Illumina Experiment Manager (IEM) to generate the Sample Sheet.\nRename the Sample Sheet as “SampleSheet.csv” in order to be recognized by BaseSpace.\nDo not open the file using excel or other software. If needed, use only notepad.\nBe sure to include the sequences of 5′ or 3′ Adapter you want to be Trimmed out by BaseSpace.",
    "Since Gene Globe QIAGEN miRNA quantification online tool have a Trimming tool included and instructed to trim out 3′ Adapters, if your FastQ files contain reads already trimmed out for both adapters, the algorithm generates an error (“>95% Reads of Sample X did not have custom sequencing adapter”) and does not proceed to the analysis.\nSingle assay validation of selected miRNAs\nTiming: variable, depending on number of miRNAs to validate\nSince sncRNA sequencing analysis required 5 out of 18 μL of total eluted RNA extracted from plasma samples, the same RNA aliquot can be used to perform the subsequent validation. The following validation protocol is based on the use of Stem-Loop RT Primers and Taqman Assays RT-Real Time PCR (Chen et al., 2005[href=https://www.wicell.org#bib3]).\nPerform Multiplex Custom miRNAs Reverse Transcriptase (RT) reaction:\nPrepare custom Stem-Loop RT primer pool by diluting each 5× RT primer 1:100 (ex: 5 μL of each primer in a total volume of 500 μL of TE 1×; 5 μL of primer 1 + 5 μL of primer 2 + 5 μL of primer 3 + 485 μL of TE 1×) in TE 1×. Up to 96 RT Stem-Loop primers can be multiplexed.\nPrepare the RT reaction mix on ice in a 1.5 mL tube as follows:\ntable:files/protocols_protocol_732_13.csv\nMix thoroughly and briefly spin down the tube.\nIn a 0.2 or 0.1 mL tube (depending on the thermal cycler), add 12 μL of RT reaction mix into each tube and add 3 μL of total RNA per reaction into each tube containing RT reaction mix for a total reaction volume of 15 μL.\nResuspend and briefly spin down the samples. Perform RT at the following thermal cycling conditions:\ntable:files/protocols_protocol_732_14.csv",
    "Important: include a negative control reaction (3 μL nuclease-free water reaction) in order to evaluate potential cross-primers effects and external/carry-over contaminations (troubleshooting: problem 5[href=https://www.wicell.org#sec7.9]).\nPerform Custom miRNAs PreAmplification:\nPrepare custom PreAmp primer pool by diluting each 20× TM primer 1:100 (ex: 5 μL of each primer in a total volume of 500 μL of TE 1×) in TE1×. Up to 96 TM primers can be multiplexed.\nPrepare the reaction mix in a 1.5 mL tube as follows:\ntable:files/protocols_protocol_732_15.csv\nIn a 0.2 or 0.1 mL tube (depending on the thermal cycler), transfer 22.5 μL of the PreAmp reaction mix and 2.5 μL of each RT product into each well or tube.\nStart run according to the following thermal cycler conditions:\ntable:files/protocols_protocol_732_16.csv\nRemove the samples from the thermal cycler and put on ice.\nDilute samples 1:8 by adding 175 μL of 0.1× TE pH 8.0 to each tube. This is the diluted PreAmp product (Final Volume = 200 μL) that can be used for qRT Real-Time PCR.\nImportant: include a negative control reaction (2.5 μL nuclease-free water reaction) in order to evaluate potential cross-primers effects and external/carry-over contaminations independent from RT reactions.\nPerform Real Time PCR:\nPrepare a mix for each microRNA as follows:\ntable:files/protocols_protocol_732_17.csv\nLoad 2 μL of PreAmplified cDNA (diluted 1:8) in each well of a 96 well plate in duplicate.\nAdd 18 μL of the previously prepared mix.\nStart run according to the following thermal cycling conditions:\ntable:files/protocols_protocol_732_18.csv\nNote: if a higher output is needed for low expressed microRNAs, a higher amount of cDNA can be loaded considering that: to obtain 1 Ct decrease you need to load 2× cDNA; to obtain 3.32 Ct decrease you need to load 10× cDNA.\nNote: we used a Viia7 qPCR instrument (Thermo Fisher), by performing a fast run protocol.",
    "Note: always consider to add a No Template Control (NTC) sample, loading 2 μL of nuclease-free water (instead of sample) and 18 μL of mix."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Molecular Biology",
    "Sequencing",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}