{
  "id": 16972,
  "origin_website": "Jove",
  "title": "Immunomagnetic Isolation of the Vascular Wall-Resident CD34+ Stem Cells from Mice",
  "procedures": [
    "This study was approved, and the animals were handled in accordance with the Guidelines for the Management and Use of Laboratory Animals in China. The research strictly adhered to the ethical requirements of animal experiments, with approval from the Animal Ethics Committee (Approval Number: SWMU2020664). Eight-week-old healthy C57BL/6 mice of either gender, weighing between 18-20 g, were utilized for the present study. The animals were housed at the Laboratory Animal Center of Southwest Medical University (SWMU).\n1. Tissue block culture of adventitia from Aorta and mesenteric arteries\nResident CD34+ VW-SCs isolation\n\t\nAnesthetize two mice with 3% isoflurane inhalation (following institutionally approved protocols). Confirm adequate anesthesia by toe-pinch. Open the thoracic and abdominal cavities using sterile ophthalmic scissors and forceps to expose the heart and intestines. Rapidly dissect off the fat around the aorta and mesenteric arteries.\nTransfer the dissected tissues to a 6 cm Petri dish containing 1% Penicillin-Streptomycin-Amphotericin B solution (see Table of Materials). After rinsing twice, transfer the arteries to a tissue culture hood under a stereo microscope.\nCut the arteries longitudinally and use fine forceps to peel off the outer layer of the aorta and the first branch of mesenteric arteries. Transfer the outer layers to a 3.5 cm Petri dish containing 0.1-0.2 mL of culture medium (see Table of Materials). Cut the outer layers into tiny pieces (about 1 mm3).\nTransfer the tissue pieces into a gelatin-coated T25 flask, ensuring even distribution on the flask's bottom. Maintain a moderate distance between tissue pieces to facilitate cell crawling and growth. Place the flask vertically in an incubator (37 °C, 5% CO2) for 3 h to allow tissue blocks to adhere to the flask's bottom.\nAfter 3 h, add 5 mL of DMEM high glucose growth medium to submerge the tissue blocks.",
    "NOTE: The medium should contain 20% fetal bovine serum, 0.2% Leukemia Inhibitory Factor (LIF), 0.2 mM β-Mercaptoethanol, and 1% penicillin/streptomycin (see Table of Materials). Fetal bovine serum supports cell proliferation, while LIF and β-Mercaptoethanol impede cell differentiation7,8.\n\t\t\nOrient the T25 flask horizontally. Monitor cell migration around tissue blocks through a microscope at 3-day intervals.\nWhen cells in the T25 flask reach about 80% confluence, passage and culture them into one or two T75 flasks. Subculture the cells over five passages to ensure proper growth and health.\nMagnetic separation of resident CD34+ stem cells\n\t\nWhen the cells in one or two T75 flasks reach 80% confluence, dissociate the cells with Trypsin, and resuspend them in 1 mL of sorting buffer (2 mM EDTA and 0.5% FBS). Determine the cell number (107/T75 flask) and centrifuge the cell suspension at 300 x g for 5 min (at room temperature).\nDiscard the supernatant completely and resuspend the cell pellet in 98 µL of sorting buffer per 107 total cells. Add 2 µL CD34 antibody (see Table of Materials). Mix well and incubate for 30 min at 4°C in the dark with occasional shaking.\nWash cells by adding 2 mL of sorting buffer and centrifuge at 300 x g for 10 min at room temperature.\nRemove the supernatant carefully and completely, and resuspend the cells in 80 µL of sorting buffer.\nAdd 20 µL Anti-FITC MicroBeads (per 107 total cells, see Table of Materials) into the buffer. Mix well by repetitive pipetting and incubate for 15 min at 4 °C in the dark with intermittent shaking.\nWash the cells twice by adding 2 mL of buffer and centrifuge at 300 x g for 5 min to repellet cells. Discard the supernatant completely and resuspend the cells in 1 mL of buffer.",
    "Position one MS column within the magnetic field of an appropriate separator, ensuring that a collection tube (e.g., a 15 mL centrifuge tube) is placed beneath the MS column to collect the separated components. (see Table of Materials). Rinse the column with 500 µL buffer and wait until it has completely run through.\nLoad the cell suspension into the column and collect the flow-through containing unlabeled cells into the 15 mL tube.\nRemove the column from the separator and place it on a new 15 mL centrifuge tube. Introduce 500 µL of buffer into the column, then promptly flush out the magnetically labeled cells by pushing the plunger into the column.\nTo enhance the purity of CD34+ cells, the eluted fraction can undergo enrichment using a second MS column.Repeat the separation process as mentioned above. Assess the purity of the sorted cells via flow cytometry.\n\t\t​NOTE: Typically, 10%-20% CD34+ cells are obtained, with around 70%-80% negative cells, and approximately 10% loss due to staining and centrifuge procedures.\nTo further confirm the purity of vascular wall CD34+ stem cells, identify the sorted cells by flow cytometry. The present study showed a purity of more than 90%.\n2. Cell identification by immunofluorescence\nSeed cells on coverslips (diameter 8 mm) pre-coated with 0.04% gelatin.\nWhen the cells reach about 60%-70% confluence, rinse two times with PBS and fix the cells with 4% paraformaldehyde for 10 min.\nWash cells with PBS for 3 min (3 times), and permeabilize the cells with 0.2% Triton X-100 (in PBS) for 5 min at room temperature.\nWash cells with PBS for 3 min (3 times), and block the non-specific binding of the antibodies with 5% donkey serum (in PBS) for 1 h.",
    "Remove the blocking buffer by holding each coverslip on its edge with forceps and draining it onto a sheet of lint free wipe.\nIncubate the cells in 100 times diluted primary antibodies (CD34, Flk-1, c-kit, Sca-1, Ki67, see Table of Materials) in 1% BSA (in PBS) overnight at 4 °C.\nDecant the solution and wash the cells with PBS for 3 min (3 times). Incubate the cells with Alexa Fluor 488 labeled secondary antibody (1:200 in 1% BSA) (see Table of Materials) for 1 h at room temperature in the dark.\nPerform DAPI counterstaining by diluting DAPI stock solution to 0.5 µg/mL in PBS and incubating cells for 5 min.\nRinse with PBS and seal the coverslips with antifade reagent. Capture images under the laser scanning confocal microscope.\n3. Induced differentiation and characterization of CD34+ VW-SCs\nSeed CD34+ stem cells at an appropriate density (40%-50% confluence) on coverslips and 6-well plates, respectively.\nInduce endothelium cell-oriented differentiation from CD34+ cells by culturing cells in endothelial cell culture medium EBM-2 (see Table of Materials) for 1 week.\nInduce fibroblast cell-oriented differentiation from CD34+ cells by culturing cells in fibroblast cell culture medium FM-2 (see Table of Materials) for 3 days.\nSubject the undifferentiated and differentiated cells to immunofluorescence staining (as mentioned in step 2) at laser excitation of 488 nm and a 40x objective. Detect the expression of endothelial cell markers (CD31, VWF) and fibroblast cell markers (PDGFRα, Vimentin) (see Table of Materials).\nDissociate the cells with Trypsin and obtain the cell pellet by centrifugation (300 x g, 5 min, room temperature). Resuspend cells with 100 µL of sorting buffer. Preincubate the cell suspension with purified anti-mouse CD16/CD32 mAb (1 µg) (see Table of Materials) at 4 ˚C for 5 min.",
    "Add 2 µL of PE Rat anti-Mouse CD34 (1:50), CD31 (PECAM-1) Monoclonal Antibody APC (2 µL, 1:50), and CD140a (PDGFRa) Monoclonal Antibody FITC (2 µL, 1:50) directly to preincubated cells in the presence of Mouse Fc Block and further incubate at 4 °C for 15 min.\nWash the cells twice by adding 2 mL of buffer and centrifuge at 300 x g for 5 min (room temperature) to repellet the cells. Discard the supernatant completely and resuspend the cells in 300 µL of buffer. Put flow tubes with stained cells into an icebox ready for Flow cytometry.\n4. Detection of intracellular Ca2+ signaling in vascular CD34+ stem cells\nSeed cells on coverslips 10 h before experiments at a density up to 70% confluence.\nTake out the coverslips and affix them to the bottom of a custom chamber with any petroleum jelly.\nWash the coverslips once with PBS, replace with Fura-2/AM (5 µM) in Tyrode's solution (NaCl 137 mM, KCl 5.4 mM, MgCl2 1.2 mM, glucose 10 mM, HEPES 10 mM, CaCl2 2.4 mM) (see Table of Materials), and incubate cells for 30 min in the dark.\nRemove the dye by treating with Tyrode's solution for 10 min to allow for fura-2/AM de-esterification.\nMount the chamber on the stage of an inverted fluorescence microscope equipped with a wide-field imaging system containing a monochromator and a CCD camera (see Table of Materials).\nOpen the main window, go to the Grab Settings dialog and camera page, and press the live button for live image display.\nChoose the fluorescence image type, set the 340 nm/380 nm loop repeat times, image size, and camera exposure time at 380 nm and 340 nm to achieve optimal image brightness.",
    "Take single snapshots, and draw several freehand lines to circle the cells with different colors and predefine Region of Interests (ROIs), indicating the background as ROI 0.\nRe-edit an already embedded protocol in the workspace view and create a new workspace.\nExecute the protocol, and the \"Fluorescence 340 nm div Fluorescence 380 nm (Live Kinetic)\" will display the online kinetic graph.\nIn the numerical view, a spreadsheet will be visible, presenting columns of gray-scale values and corresponding time information. Export the spreadsheet data by using the clipboard.\nCalculate F340 nm/F380 nm indicating intracellular Ca2+ changes after subtracting the background fluorescence (ROI 0).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}