{
  "id": 7207,
  "origin_website": "Bio",
  "title": "Analysis of Monocyte Cell Fate by Adoptive Transfer in a Murine Model of TLR7-induced Systemic Inflammation",
  "procedures": [
    "Induction of systemic inflammation using imiquimodNotes: Experimental procedures can only be performed after approval by the local Animal Care Committee. Perform experiments with 8-12-week-old mice. Reporter mice are B6.129P-Cx3cr1tm1Litt/J, obtained from the Jackson Laboratory (Jung et al., 2000; Gamrekelashvili et al., 2016 and 2020). IMQ-treated mice must be kept separately from the Vaseline (Sham) group. Mix blood thoroughly with Heparin-PBS or K3EDTA to avoid coagulation. Pre-warm RBC lysis buffer at room temperature to achieve efficient lysis. Induction of systemic inflammation using IMQ (Figure 1)On Day -1, weigh the mice, record the weight, and intraperitoneally inject Ketanest (Esketamin 80 mg/kg), Rompun (Xylazin 2.5 mg/kg), and Dormicum (Midazolam 2.5 mg/kg) in 0.9% NaCl solution to anesthetize the mice (injection volume 10 µl/g mouse weight, using a 1-ml syringe and 27 G needle).Apply a drop of Bepanthen eye ointment from the tube to the eye to avoid dry eyes, and test paw reflexes to make sure the mouse is sleeping.Shave the back (appr. 3 cm2) of the mice with an electric shaver and apply the depilating cream.Keep the mice for appr. 2 min on a heat pad and wipe away the depilating cream with a spadel.Wash and rinse the back of the mice with warm water to remove the remaining depilating cream.Keep the mice on the heat pad until awake and then transfer to cages with ad libitum access to food and water.Two days later (Day 1), weigh the mice, record the weight, and place each mouse separately in a glass jar with appr. 200-300 µl isofluran for 10-15 s.Place each dizzy/sleepy mouse on the heat pad, measure the thickness of the ear using a caliper, and quickly apply 50 mg IMQ (Aldara) cream or an equal amount of Vaseline to the back and the right ear using a stainless-steel spadel.",
    "Repeat the same procedure for 3-4 consecutive days (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4007/bioprotoc-11-09-4007-g001.jpgFigure 1. Experimental set-up for the induction of inflammation Mouse preparation and analysis of systemic inflammationOn Day 5, 7, or 12, anesthetize the mice by intraperitoneal injection with Ketanest (Esketamin 80 mg/kg), Rompun (Xylazin 2.5 mg/kg), and Dormicum (Midazolam 2.5 mg/kg) in 0.9% NaCl solution (injection volume 10 µl/g mouse weight, using a 1-ml syringe and 27 G needle).Check the footpad reflex to confirm that the mouse is sleeping.Fix the sleeping mice to the pad, open the abdomen, and collect the blood from the inferior vena cava using a 1-ml syringe with a 25 G ×5/8’’ needle (Braun Melsungen) (Figure 2):300 µl blood (PB) in 100 µl Heparin-PBS (250 U/ml) for cell analysis.50 µl blood in K3EDTA-containing tubes for blood counts.The remaining blood without heparin for serum collection and analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4007/bioprotoc-11-09-4007-g002.jpgFigure 2. Schematic representation of the mouse abdominal situs, ventral view. After opening the abdominal cavity of deeply anesthetized mice, collect blood from the inferior vena cava.Euthanize the mice, open the abdomen, excise the spleen (Spl), and place in PBS on ice.Cut and remove the skin from the hind limb and collect the hind limb with the muscles on a paper towel.Carefully remove the muscles using scissors. Clean the rest of the muscles and soft tissue with a paper towel and isolate the bones [one tibial (Tibia) and one femoral (Femur) bone (Figure 3)].imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4007/bioprotoc-11-09-4007-g003.jpgFigure 3. Schematic representation of the bones of the mouse hindlimb (A) and forelimb (B). The Ilium, Femur, Tibia, and Humerus are collected for bone-marrow isolation and analysis.Pre-weigh the 1.5-ml Eppendorf collection tube of the custom-made bone-marrow (BM) isolating device (Figure 4). Cut one end of the bone, place in a 0.",
    "5-ml tube with a hole in the bottom, and collect the BM by centrifugation of the isolating device in a table-top centrifuge at 5,000 × g for 20 s.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4007/bioprotoc-11-09-4007-g004.jpgFigure 4. Assembly and use of the custom-made BM isolating device. A. Perforation of a 0.5-ml tube with a 21 G needle for BM isolation. B. Bones cleaned from muscles and placed in a 0.5-ml tube. C. Assembly for centrifugation. D. Isolated BM in a 1.5-ml collection tube after centrifugation.Weigh the collection tube again, record the difference in weight to define the BM weight and place on ice.Resuspend BM in 10 ml PBS, filter through a 70-µm nylon mesh, and wash by centrifugation at 400 x g for 7 min.Aspirate the supernatant, resuspend the cell pellet in 10 ml PBS, and repeat the filtration and washing step once more.Weigh the spleen, prepare a single-cell suspension by passing through a syringe plunger in a 6-well plate and filtering through a nylon mesh, and centrifuge at 400 × g for 7 min.To remove the erythrocytes, resuspend the PB and Spl pellets in 5 ml or 1 ml room-temperature RBC lysis buffer and incubate for 17 min or 1 min, respectively.Stop the lysis procedure by adding 10 ml PBS, filter the suspension through a nylon mesh, and centrifuge at 400 × g for 7 min.Repeat the washing-filtration-centrifugation step once more.Resuspend the Spl, BM, and PB in PBS (10 ml, 10 ml, or 5 ml, respectively) and count the cells in an automated cell counter to define the absolute cell number.Resuspend the cells in FCS-EDTA-PBS buffer and place ≤1 × 106 cells per sample in a 96-well V-bottomed plate for staining and subsequent flow cytometry analysis.",
    "Adoptive transfer of monocytes into IMQ-treated mice and monocyte differentiation analysisNotes: Experimental procedures can only be performed after approval by the local Animal Care Committee. Perform experiments with 8-12-week-old mice. Use B6.SJL-PtprcaPepcb/BoyJ (CD45.1+) mice as recipients (Jackson Laboratory). Collect no more than 2 × 106 sorted monocytes in 2 ml collection buffer and carefully mix the collection tube every 20-30 min to avoid excess stress to the cells. This step enhances cell viability and ensures a high yield of donor cells for analysis after adoptive transfer. For successful flow cytometry analysis of transferred cells, it is important to deplete recipient cells from recipient Spl and BM but not from peripheral blood. It is critical to remove erythrocytes using density centrifugation with Histopaque 1083 and not RBC lysis for successful analysis of transferred donor cells. Cell enrichment on magnetic columns must be performed with ice-cold FCS-EDTA-PBS buffer. Avoid excess air bubble and foam formation. Induction of systemic inflammation using IMQDepilate and treat recipient CD45.1+ mice on days 1-4 with IMQ as described in A and Figure 1.Isolation and adoptive transfer of inflammatory monocytes on day 2Euthanize 4-5 donor CX3CR1-GFP+ CD45.2+ mice and isolate the bones (hips (Ilium), femoral (Femur), tibial (Tibia), and brachial (Humerus) bones from both sides, 8 bones/mouse total, Figure 3). Clean the muscles from the bones using scissors and a paper towel. Collect the cleaned bones in PBS and keep on ice.Dip the bones in 70% EtOH for 3-5 s and dry on EtOH-sterilized dry paper towel. Cut one end of the bone and put 4 bones/tube in 0.5-ml Eppendorf tubes with a hole in the bottom created using a 21 G needle (Figure 4).Close the tube and place in another 1.5-ml collection tube.",
    "Centrifuge this device in a table-top centrifuge with a fixed-angle rotor at 5,000 × g for 20 s.Collect the bone marrow, resuspend in 50 ml PBS, filter through a 100-µm sterile cell strainer, and centrifuge in a swinging-bucket rotor at 400 × g for 7-8 min to collect the pellet.Resuspend the cell pellet from 4-5 mice in 6-8 ml PBS, overlay 3-4 ml suspension on 3 ml Histopaque 1083 in 15-ml tubes, and centrifuge in a swinging-bucket rotor at 420 × g for 20 min without the brake.Collect the interphase (appr. 5 ml) containing the cells in a 15-ml tube, fill the tube with PBS, and wash by centrifugation at 400 × g for 7 min.Resuspend the pellet in 600 µl FCS-EDTA-PBS and add 3 µl Fc block (TruStain FcX). Incubate the tube at 4°C for 12-15 min.Without washing, add PE-labeled anti-mouse CD3- (1.5 µl), CD19- (1.5 µl), B220- (0.75 µl), Ly6G- (0.75 µl), Ter119- (0.75 µl), CD90.2- (0.75 µl), NK1.1- (3 µl), CD49b- (3 µl); anti-mouse CD11b-Pacific Blue (3 µl), and anti-mouse Ly6C-PE-Cy7 (0.43 µl) antibodies (Table 1) to the 600 µl cell suspension and incubate for an additional 15 min.Wash the cells twice in 10 ml buffer, filter through a 40-µm cell strainer, resuspend in 2 ml FCS-EDTA-PBS buffer, and sort Lin-CD11b+CX3CR1-GFPloLy6Chi cells. Collect ~2 × 106 sorted cells in 2 ml ice-cold 20% FCS-PBS and mix the collection tube every 20-30 min during sorting.Immediately after sorting, wash the sorted cells twice with 10 ml PBS each, resuspend in PBS, and intravenously inject 0.7 × 106-2 × 106 cells per mouse in 100 µl volume into the tail vein using a 1-ml syringe and 27 G needle. To dilate the tail vein and facilitate injection, prewarm the tail in warm water.Isolation and analysis of donor-derived CD45.",
    "2+ monocytes from CD45.1+ recipients 3 days after adoptive transfer.Euthanize recipient mice in deep narcosis, collect blood in 200 µl Heparin-PBS, collect the spleen and 8 bones (hips, femoral, tibial, and brachial bones).Prepare a single-cell suspension from Spl by passing through a 5-ml syringe into a 6-well plate, resuspending in 4 ml PBS, and filtering through a 70-µm nylon mesh.Isolate BM as described in Figure 4, resuspend in 4 ml PBS, and filter through a 70-µm nylon mesh.Dilute the blood (PB) with PBS to 7 ml.Load Spl, BM, and PB separately onto 2.5 ml Histopaque 1083 in 15-ml tubes and centrifuge in a swinging-bucket rotor at 420 × g for 20 min without the brake.Collect the interphase (appr. 5ml) containing the cells in a clean 15-ml tube, fill up the tube with PBS, and wash once by centrifugation at 400 × g for 7 min.Resuspend the cell pellet in 100 µl (BM, Spl) or 50 µl (PB) FCS-PBS-EDTA buffer supplemented with Fc block (1:200 dilution) and incubate at 4°C for 15 min. Without washing the Fc block, add biotin-labeled antibodies consisting of anti-mouse CD45.1, CD3, CD19, B220, Ly6G, and Ter119 to the final dilution indicated in Table 2, but do not add the biotinylated anti-mouse NK1.1 at this stage.Quickly vortex the tube and incubate at 4°C for 15 min.Fill the tubes with 5 ml FCS-EDTA-PBS buffer and centrifuge at 400 × g for 8 min.Wash PB once more with 5 ml FCS-EDTA-PBS buffer and transfer the pellet to a 96-well V-bottomed plate for further staining.Resuspend the Spl and BM pellets in 240 µl FCS-EDTA-PBS buffer, add 60 µl anti-biotin microbeads, and incubate at 4°C for 15 min. Fill the tubes again with FCS-EDTA-PBS buffer to wash the excess beads and centrifuge at 400 × g for 7-8 min.",
    "Place the LS columns in the Quadro MACS separation unit and equilibrate with ice-cold FCS-EDTA-PBS buffer (1 ml buffer per column).Resuspend the Spl and BM pellets in 2 ml FCS-EDTA-PBS buffer and load onto the pre-equilibrated LS columns.Wash the columns twice with 2 ml FCS-EDTA-PBS buffer, collect the flowthrough, pellet by centrifugation at 400 × g for 7 min, transfer to a 96-well V-bottomed plate, and stain in 30 µl volume with the appropriate antibody cocktail (Table 2).Resuspend the cells after staining and wash in FCS-EDTA-PBS buffer. Add propidium iodide (PI 1 mg/ml stock in PBS, 1:12,000 final dilution) prior to acquisition and acquire flow cytometry data for further analysis."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}