{
  "id": 8332,
  "origin_website": "Jove",
  "title": "Heterologous Expression and Functional Analysis of Aedes aegypti Odorant Receptors to Human Odors in Xenopus Oocytes",
  "procedures": [
    "The protocol for this procedure, the Care and Use of Laboratory Animals, is approved and monitored (Auburn University’s Institutional Animal Care and Use Committee: approved protocol # 2016-2987).\nNOTE: Custom gene synthesis is a viable alternative to cloning for mosquito OR genes.\n1. Mosquito and Olfactory Appendages (Antennae) Collection\nMaintain Ae. aegypti mosquitoes (obtained from Dr. James Becnel, USDA, ARS, Mosquito and Fly Research Unit) at 25 ± 2°C and a photoperiod of 12: 12 (L:D) h (lights on 8 am).\nAnesthetize ~800 4-6-day old female mosquitoes without blood feeding using CO2. Cut the mosquito antennae (olfactory tissues) under a microscope (40x) using a pair of scissors and collect in a 1.5 mL centrifuge tube kept on dry ice.\n\tNOTE: The collected antennae can be stored in a freezer at -80 °C or be used immediately.\n2. OR Cloning from Antennae of Ae. aegypti\nExtract total RNA from the antennae using a commercially available total RNA kit following the manufacturer’s protocol.\nDigest the total RNA using the commercial DNA-free kit in order to remove DNase and other ions following the manufacturer’s protocol.\nSynthesize cDNA from 1.5 µg of DNA-free RNA using the Oligo d(T)20-primed SuperScript IV First-Strand Synthesis System13,30.\nDesign PCR primers for the OR genes according to the sequences available at VectorBase (https://www.vectorbase.org/) and the special requirements of the enzyme cutting site. Add a Kozak sequence (GCCACC), which initiates translation in most eukaryotic organisms, between the cutting site and the start codon in each forward primer30.\nClone the coding sequences of the OR genes by PCR using gene-specific primers containing restriction endonuclease sites and the Kozak sequence following the manufacturer’s protocol.\nDetect PCR products through a 1% agarose gel and purify using a commercial gel extraction kit following the manufacturer’s protocol.",
    "Perform recombinant plasmid construction through cloning of PCR products into a pT7Ts vector after digestion by restriction enzymes following the manufacturer’s protocol.\nVerify the recombinant plasmids by Sanger sequencing and confirm using the VectorBase database.\n3. cRNA Synthesis\nLinearize the constructed plasmids with specific restriction enzyme(s).\n\tNOTE: Plasmid DNA must be linearized with a restriction enzyme downstream of the gene to be transcribed.\nUse the linearized plasmids to synthesize cRNAs with a commercial T7 kit following a previous description13,30.\nPremix cRNA of OR and Orco (1:1) in a centrifuge tube and aliquot the mixed cRNA into a 2 μL volume (250 ng/µL/each) for each PCR tube. Store the aliquoted cRNA at -80 °C before use.\n4. Xenopus Oocyte Collection\nNOTE: The procedure is following the instruction of Schneider et al.38.\nAnesthetize Xenopus laevis for 20-30 min in 1 L of ultra-purified water with 1 g of ethyl m-aminobenzoate methanesulfonate salt (Figure 1A). Pinch one of the frog’s toes using fingers; if there is no response, the frog is sufficiently anesthetized and ready for surgery. Transfer the anesthetized frog on the ice bed.\nThe surgery\n\t\nRub the frog ventral area with 10% povidone-iodine solution and wipe the solution with clean cotton balls. Repeat this step 2 times.\nMake a small abdominal incision (10-15 mm, Figure 1B) with a disposable scalpel. Penetrate skin, fascia-muscle layer separately. The incision is in the lower part of the abdomen, lateral to the midline.\n\t\tNOTE: Do not injury internal organs.",
    "Grasp parts of ovarian lobes with forceps and pull to the exterior gently. Lift the ovary and cut it off at the body wall level with scissors. Repeat several times until get enough ovarian materials (~200 eggs, Figure 1C). Transfer the ovarian materials into washing buffer (96 mM NaCl, 2 mM KCl, 5 mM MgCl2•6H2O, 5 mM HEPES sodium salt, 10 µg/mL gentamycin, pH 7.6).\nClose the surgery wounds (both muscle and skin) with absorbable sutures that typically degrade and fall out naturally in 10-14 days.\nAfter each surgery, place the frog in 1 L of recovery solution (containing 3.4 g of canning & pickling salt and 2 g of instant ocean sea salt) until it wakes up and then return it back to the frog facility.\n\t\tNOTE: Up to 4 surgeries can be performed on each frog. The operation interval of each frog should be more than 2 months.\nEnzymatic defolliculated digestion and oocytes culturing\n\t\nSeparate the oocytes (~200 eggs, Figure 1C) into small pieces.\nTransfer all oocytes into a digestion solution, including 10 mL of washing buffer (Section 4.2.3) and 2 mg/mL collagenase B for 40-60 min at ambient temperature in order to remove follicular cell layers. Examine the samples under a microscope to determine whether 80% of the oocytes have been fully defolliculated; if not, check every 10 min till most of the oocytes are ready.",
    "Rinse the oocytes with 1x Ringer’s solution (96 mM NaCl, 2 mM KCl, 5 mM MgCl2·6H2O, 5 mM HEPES sodium salt, pH 7.6), washing buffer (Section 4.2.3), modified Barth’s saline (78 mM NaCl, 1 mM KCl, 0.33 mM Ca(NO3)2·4H2O, 0.41 mM CaCl2·2H2O, 0.82 mM MgSO4·7H2O, 2.4 mM NaHCO3, 10 mM HEPES sodium salt, 1.8 mM sodium pyruvate, 10 µg/mL gentamycin, 10 µg/mL streptomycin, pH 7.6) in sequence (5 times for each buffer, using 10 mL each time). Rinsing the oocytes extensively with buffers to remove immature and poor-quality oocytes.\nHarvest oocytes at stage V-VI according to Dumont’s classification. Transfer health/good quality oocytes at stage V-VI with a clear white/dark division and no visually obvious damage (Figure 1D) into a 100 mm x 15 mm Petri dish containing modified Barth’s saline (Section 4.3.3). Discard the bad quality oocytes (Figure 1E). Maintain digested oocytes in insect growth chambers at 18 °C for about 24 hours before microinjection.\n5. cRNA Microinjection and Expression of Odorant Receptors (ORs) and OR Co-receptors (Orco) in Xenopus Oocytes\nPut a metal matrix into the 100 mm x 15 mm Petri dish, adding modified Barth’s saline (Section 4.3.3) until the matrix is submerged. Transfer oocytes on the matrix, and discard the oocytes that do not meet the size. Arrange the oocytes with the vegetal poles on the upper side (Figure 1F).\nPull a fresh glass capillary (1.0 mm OD x 0.5 mm ID, length = 100 mm) for each sample using a micropipe puller (Heat = 525, Pull = 50, Velocity = 50, Time = 250) and sharpen with a micropipette beveler at an angle of 25°. Mount the capillary tube on the nanoliter injector.",
    "Before injection, remove one tube of premixed cRNAs of OR and Orco (Section 3.3) from the freezer and place it on ice until completely dissolved. Fill the capillary tube with the OR/Orco mixture by pressing the Fill button of nanoliter injector.\nInject 10 ng (5ng OR + 5ng Orco; ~20 nL) of the premixed cRNA for each oocyte with a nanoliter injector at a RNAse-free station. (Figure 1F).\n\tNOTE: Before injection, we press the EMPTY button to discharge little mixture to ensure the capillary tube is not blocked. Waiting for about 5 seconds to let the cRNAs enter the oocyte entirely.\nAfter injection, store oocytes on a sterile 24-well cell culture plate with modified Barth’s saline at 18°C for 3-7 days before whole-cell recording.\n6. Whole-cell Current Recording using a Two-electrode Voltage-clamp system (Figure 2)\nBefore the two-electrode Voltage-clamp recording, dissolve the individual odorant compounds in dimethyl sulfoxide (DMSO) to obtain a series of stock solutions (100 μg/μL). Dilute these stock solutions with 1x ND96 buffer (91 mM NaCl, 2 mM KCl, 1.8 mM CaCl2·2H2O, 2 mM MgCl2·6H2O, 5 mM HEPES sodium salt, pH 7.6) 1000-fold to obtain a set of working solutions (0.1 μg/μL).\nEnsure that everything on the TMC vibration isolation table, including the metal shield, microscope, light source, and waste pump, is carefully grounded to reduce the effect of external electrical noise on the whole-cell signal recording.\nPrepare microelectrodes by pulling a glass capillary (1.20 mm OD x 0.94 mm ID, length = 750 mm) using a micropipe puller (Heat = 525, Pull = 50, Velocity = 50, Time = 250). Fill the capillaries with 3 M KCl. Chloridize the Ag/AgCl wires for 2-5 min in 10% chlorine bleach until they turn a dark grey color (pale grey Ag/AgCl wires need to be chloridized).",
    "Turn on the machine by switching on the Oocyte Clamp and Digidata Digitizer (Figure 3A). Open the software (e.g., Clampex 10.3) and click the Record button. Turn on the switch for the 1x ND96 buffer (Section 6.1) and the pump for the waste buffer.\nConduct a pre-test by inserting microelectrodes into the flowing buffer and then pressing the Vm Electrode Test button and the Ve Electrode Test button to check the resistance of the microelectrodes. Vm should be < 40 mV and Ve should be < 40 μA. Switch off the 1x ND96 buffer (Section 6.1) flow and the waste pump after the pretest.\nPlace each oocyte in the perfusion chamber (Figure 2) filled with 1x ND96 buffer (Section 6.1) and gently position the oocytes with the vegetal poles facing up by the glass caterpillar. Insert the electrodes slowly into the oocyte (Figure 3B). Adjust the Vm parameter to 0 and then the Ve parameter to 0. Change the Clamp button from OFF to FAST. Adjust the Gain button to ~ -80 mV.\nCheck the value of Ve, which should be constant. If not, there is a leak in at least one of the two microelectrodes. If this happens, replace any faulty components with new capillaries.\nRecord whole-cell currents from the injected oocytes with an oocyte clamp at a holding potential of ~−80 mV (Figure 2).\nPerform data acquisition and analysis.\n\t\nResume the flow of the 1x ND96 buffer (Section 6.1) and turn on the waste pump.\nOdorant solution application via the perfusion system: switch off the 1x ND96 buffer (Section 6.1) and flow the odorant solution for 10 seconds. Then record the peak value. To obtain the response of the OR to the test odorant, subtract the baseline value from the peak value.",
    "Stop the flow of odorant solution and switch to the 1x ND96 buffer (Section 6.1). Wash the oocyte using the buffer until the current trace recovers from the previous odorant stimulation. The oocyte is then ready for stimulation by another odorant solution. Generally, one oocyte can be used to detect 20-30 chemical stimulations.\n\t\tNOTE: When testing the concentration-dependent response, the lowest concentration should always be applied first before moving on to the higher concentrations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}