{
  "id": 3546,
  "origin_website": "Cell",
  "title": "Protocol for simultaneous detection of dual subcellular localized dengue virus protease by co-transfection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCo-transfection\nTiming: 40 min\nThis method is described for co-transfecting two recombinant plasmids.\nObserve the cells (HEK) seeded in 12 well plates and the 60 mm dishes under the microscope.\nNote: The required confluency is 70%–80%.\nMix 400–600 ng of vector/recombinant vectors (pEGFP-N1 Vector, pEGFP N1-NS2BNS3 and pEGFP-N1-NS3pro helicase) with 400–800 ng of Mito RFP.\nDilute the above mix with serum free DMEM/Opti-MEM (Mix-1).\nSimilarly, mix Lipofectamine 2000 with serum free DMEM or Opti-MEM (Mix-2).\nIncubate both mixes separately at 25°C for 5 min.\nThe above plasmids were used to analyze the expressed protein of interest which is fused with GFP tags (See the troubleshooting 2 & 3).\nNote: The required volume of Lipofectamine to prepare Mix 2 is according to the concentration of plasmid used. In this protocol, 1 μg:2 μL was used.\nAdd Mix-1 to Mix-2 and incubate again for 20 min and then add to the cells.\nAllow the cells to grow for 4–6 h at 37°C in a CO2 incubator.\nNote: Transfect the above vector/recombinant vectors (pEGFP-N1, pEGFP-N1 NS2BNS3 and pEGFP-N1 NS3pro helicase) into the cells of 60 mm dishes by following the same transfection method but without MitoRFP for subcellular fractionation analysis.\nReplace the serum free medium with fresh complete DMEM after 5 h, and allow the cells to grow for 48 h for the GFP/MitoRFP expression analysis (See the troubleshooting 3).\nPermeabilization and fixation\nTiming: 45 min\nThis method is described for slide preparation for confocal microscopy.\nWash the cells by adding 500 μL of 1X PBS.\nFix the cells by using 500 μL of 4% paraformaldehyde (or 10% Formalin).\nIncubate for 10–20 min at 25°C.5[href=https://www.wicell.org#bib5]\nPermeabilize the cells with 0.25% Triton X- 100 buffer.\nIncubate for 3–5 min at 25°C.",
    "Wash the cells with 500 μL of 1X PBS 2–3 times until Triton X-100 buffer was completely removed.\nStain the cells with 200 μL of Hoechst stain (for nuclear staining) and incubate in dark for 3 min at 25°C.\nWash the cells with 1X PBS; remove excess PBS by gently tapping the coverslips onto the tissue paper. Air dry the coverslips and add a drop of glycerol for mounting.\nAnalyze the transfected cells using a laser scanning confocal microscope (Carl Zeiss, LSM710) at 20X and 60X magnifications using the fluorescence filters for green (GFP), red (MitoRFP), and blue (Hoechst stain) colors.\nThe captured images were merged in order to observe the co-localizations.\nNote: In this step, the permeabilization step can be omitted as the fluorescence expressed by the GFP and MitoRFP was analyzed but not with the specific antibodies. The permeabilization step is crucial for the indirect immunostaining method.\nSubcellular fractionation\nTiming: 45 min (for step 12)\nTiming: 30 min (for step 13)\nTiming: 45 min (for step 14)\nTiming: 2 h\nThe protocol for subcellular fractionation was followed as per the earlier described methods4[href=https://www.wicell.org#bib6],6[href=https://www.wicell.org#bib4],7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8] but with minor modifications. This section describes the detailed fractionation steps for whole cell lysate, cytoplasmic and nuclear fractionations. Perform all the steps at 4°C. Buffers should be sufficient and must be pre-cooled while conducting the experiments.\nIn order to continue the steps 1–4 under co-transfection experiment, harvest the cells after 48 h by scraping and centrifugation at 800 × g for 5 min. Wash the above obtained cell pellets with 1 mL of 1X PBS by centrifugation at 800 × g for 5 min. Use these cell pellets for the preparation of whole cell lysate/cytoplasmic/nuclear extracts.\nPreparation of whole cell lysate.",
    "Resuspend the above cell pellet in 100–120 μL of Radio Immunoprecipitation Assay buffer (RIPA buffer).\nAdd 10 μL of protease inhibitor cocktail (10X) to 100 μL of lysate and incubate on ice for 30 min.\nNote: Add protease and phosphatase inhibitors to avoid proteolysis.\nVortex the lysate 2–3 times with an interval of 15 min in order to suspend the pellet completely.\nCentrifuge the above suspension at 20,000 × g for 15 min and collect the supernatant as the whole cell lysate.\nPreparation of cytoplasmic /mitochondrial fraction.\nWash the cell pellets with 1 mL of ice-cold 1X PBS and incubate on ice for 5 min.\nAdd 100 μL of hypotonic buffer, homogenize gently with micropipette.\nIncubate on ice for 10 min.\nCentrifuge the lysate at 2000–3000 × g for 10 min at 4°C; collect the supernatant as cytoplasmic fraction.\nProcess the pellet further to obtain the nuclear extract.\nCritical: Mild homogenization is crucial for obtaining pure cytoplasmic fractions. The speed of centrifugation varies for each cell line used. For HEK, we have used speed up to 3000 × g.\nPreparation of Nuclear Extract.\nWash the nuclear pellet obtained in the above fractionation twice with 1 mL of 1X PBS.\nResuspend in 100 μL of 1X RIPA buffer. ii. Incubate the suspension for 30 min on ice with vortexing at 5 min intervals.\nCentrifuge at 20,000 × g for 15 min and collect the supernatant as a nuclear fraction.\nOptional: For nuclear fraction, hypertonic buffer can be used. Here we described the extraction with RIPA buffer as it is rapid (30 minutes), easy and efficient for solubilizing nuclear proteins.\nPause points: The fractionated lysates can be stored directly in ‒80°C, if not used immediately or make aliquots of each fraction in small 0.5 mL tubes to avoid repeated free thaw.",
    "Western blotting\nTiming: ∼9 h\nIn this section, we have described the protocol of immunoblotting for the above fractionated lysates.\nQuantify the above obtained whole cell lysate, nuclear and cytoplasmic fractions using Bradford reagent and subject to western blotting or store at ‒80°C until further use.\nResolve the total proteins (60 μg of each) of whole cell lysate, cytoplasmic and nuclear extracts on 10% SDS-PAGE.\nTransfer the resolved proteins onto polyvinylidene fluoride (PVDF) membrane at 80 V current for 2–3 h (or 12 h at 50 V) using western blot transfer unit in 1X transfer buffer.\nStain the membrane with Ponceau S and record the images. Wash the membranes with 1X PBST until the Ponceau was removed completely.\nNote: Ponceau stain must be removed as it may hinder the blocking step.\nBlock the membrane using 5%–7% blocking buffer for 2 h at 25°C with gentle rocking.\nNote: Blocking step must be optimized for each antibody. (See the troubleshooting 4).\nDilute the primary antibodies in 1X PBST or 2% blocking buffer.\nRinse the membrane with 1X PBST and incubate in primary antibody solution for 2 h at 25°C or 12–14 h at 4°C under gentle rocking. (See the troubleshooting 5).\nNote: Incubation time and dilution of antibodies must be optimized as per manufacturer’s instructions.\nWash the membrane three times with 1X PBST each for 10 min on a rocker.\nIncubate the membrane in secondary antibody solution for 2 h at 25°C.\nWash the membrane three times with 1X PBST each for 10 min on a rocker.\nDevelop the membrane with western blot developing solution (femtoLUCENT PLUS-HRP, G-Biosciences) and record the images using ChemiDoc Image System (Bio-Rad)."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}