{
  "id": 18882,
  "origin_website": "Jove",
  "title": "Videomorphometric Analysis of Hypoxic Pulmonary Vasoconstriction of Intra-pulmonary Arteries Using Murine Precision Cut Lung Slices",
  "procedures": [
    "1. Preparation of Gas Mixtures, Equipment, Instruments, and Solutions\nThis section describes the necessary equipment and set-up for the protocol. Additional details and manufacturer information can be found in the accompanying table.\nObtain or prepare the following gas mixtures:\n\t\t\nTwo bottles with normoxic gas mixture composed of 21% O2, 5.3% CO2, 73.7% N2.\nOne bottle with hypoxic gas mixture composed of 1% O2, 5.3% CO2, 93.7% N2.\nGather the following equipment:\n\t\t\nA microwave oven, for melting the agarose.\nA heating cabinet, for washing out the agarose from the lung sections (see below). Insert a tube connected to a bottle with normoxic gas mixture into the cabinet.\nA vibratome with appropriate razor blades, for cutting the lungs into 200 μm thick slices. It is advantageous if the vibratome is furnished with a refrigerating set to cool down the buffer in the vibratome basin.\nA flow-through superfusion chamber mounted on an inverted microscope, for analysis of HPV of intrapulmonary arteries.\n\t\t\t\t\nTo facilitate fixation of the lung sections to the bottom of the chamber, connect nylon strings to a platinum ring (self-constructed). Join the perfusion chamber to a peristaltic pump with flow rates adjusted to 0.7 ml/min and 6 ml/min, respectively.\nAssemble the equipment so that during the experiments the media are stored in a 37 °C water bath and bubbled with normoxic or hypoxic gas using 21 G x 4 ¾ cannulas. Additionally use a second connection from the gas bottle to allow the normoxic/hypoxic gas mixtures to be fed into the air space of the perfusion chamber. Ensure that all tubes of this system are gas tight.\nA CCD-camera mounted on an upright inverted microscope to record images of the artery analyzed.\nPrepare the following instruments:",
    "For preparation of the lungs: a sterile dissecting set including a rough scissor and two pairs of forceps, a fine scissor for opening of the chest, a microscissor to cut a hole into the trachea for filling in the agarose, and sewing cotton (about 20 cm) for ligation of the trachea to prevent outflow of the agarose.\nFor filling of the airways with agarose: connect a 2 ml syringe to the flexible plastic pipe of an IV indwelling cannula (20 G x 1 ¼).\nFor perfusion of the lungs with buffer: fix a 50 ml syringe as a buffer reservoir about 40 cm above the working place for the mouse preparation.\nFor outflow of the buffer: connect the syringe to a tube to which a 25 G x 1 cannula is attached. Use a clamp at the tube to adjust the outflow to about 1 drop/sec (about 0.3-0.4 ml/min).\nPrepare the following buffers and media:\n\t\t\t\t\nMake 1,000 ml HEPES-Ringer buffer (10 mM HEPES, 136.4 mM NaCl, 5.6 mM KCl, 1 mM MgCl2•6H2O, 2.2 mM CaCl2•2H2O, 11 mM glucose, pH 7.4). Store the sterile filtrated buffer (pore size of filter: 0.2 µm) at 4 °C.\nAbout 30 min before starting the isolation of the lungs prepare the following solutions:\n\t\t\t\t\nDissolve 1.5% w/v low melting point agarose in HEPES-Ringer buffer (total volume 10 ml) and melt it by cooking in a microwave oven. Subsequently, cool it down to 37 °C by storage in a heating cabinet. Prewarm the 2 ml syringe for filling the agarose into the pulmonary airways.",
    "Take 20 ml of the HEPES-Ringer buffer, add heparin to a final concentration of 250 I.U./ml, and heat the buffer to 37 °C. Immediately before use add sodium nitroprusside to a final concentration of 75 µM. This is the perfusion buffer for running off the blood from the pulmonary vasculature.\nPut 200 ml HEPES-Ringer buffer in a glass beaker and store it on ice. This buffer will be needed for cooling down the agarose-filled isolated lungs.\nFill about 200 ml MEM supplemented with 1% penicillin/streptomycin in a glass beaker and store it at 37 °C in the heating cabinet. Bubble the medium with normoxic gas mixture. This will be used for removal of the agarose from the lung sections.\nPrewarm 2 bottles of MEM supplemented with 1% penicillin/streptomycin in a water bath to 37 °C and bubble them with normoxic and hypoxic gas mixture, respectively, for at least 2 hr before starting the videomorphometric measurements. Approximately 250 ml MEM will be required per measurement.\nGather the following additional materials:\n\t\t\t\t\n70% EtOH for disinfection.\nStock solution of heparin (25.000 I.U./5 ml), stored at 4 °C (see above).\nStock solution of the NO donor sodium nitroprusside (Nipruss): 10 mM in H2O, stored on ice (see above).\nStock solution of thromboxane analog U46619: 10 µM in ethanol, stored on ice.\nSuperglue.\nSewing cotton for ligation of the trachea after filling with agarose.\n2. Animals\nUse mice (for instance of the strain C57Bl6) of both genders at an age of 10-25 weeks. HPV can also be analyzed in knockout strains and the corresponding wild type strains.\nAll experiments were performed according to the NIH guidelines for the care and use of experimental animals, and were approved by the local institutional boards.\n3. Isolation of Murine Lungs and Preparation of Precision Cut Lung Slices (PCLS)",
    "Kill the mouse by cervical dislocation. Immediately after killing, sterilize the ventral body surface with 70% EtOH and use the rough scissor to cut the skin along the ventral midline from the chin to the pelvis.\n\t\tNote: Since it is known that inhalative anesthetics such as isoflurane have an impact on the vascular tone18,19, do not use volatile anesthetics.\nAfter opening of the abdominal cavity, put the intestinal loops aside and sever the large abdominal vessels for bleeding. After penetrating the diaphragm with the fine scissor, the lungs will collapse as a result of air entry into the pleural cavity. Use the scissor to detach the diaphragm from the inferior thoracic aperture. Cut the ribs and the clavicle laterally to remove the ventral part of the rip cage.\n\t\tNote: It is important that the lungs are not damaged in this step since otherwise bloating of the lungs with agarose will be impossible! Use only sterile instruments and laboratory glassware.\nBefore starting the perfusion of the pulmonary vasculature, cut a small hole into the left ventricle of the heart for discharge of the buffer. Fill the syringe reservoir with warm (37 °C) HEPES-Ringer buffer containing heparin and sodium nitroprusside (perfusion buffer) and perfuse the pulmonary vasculature slowly via the right ventricle.\n\t\tNote: Perfusion is efficient when the lungs change their color and get a white appearance. In this step it is important to add sodium nitroprusside into the perfusion buffer; this prevents the pre-acinar arteries from ripping off from the surrounding tissue.\nRemove the salivary glands, small muscles and connective tissue from the trachea. Disconnect the trachea from the surrounding connective tissue and thread sewing cotton between esophagus and trachea for later ligation.",
    "Use the microscissor to cut a small hole into the upper part of the trachea between two neighboring tracheal cartilages. Now insert the flexible plastic pipe of an IV indwelling cannula via the small hole into the trachea and carefully fix it with the sewing cotton. Slowly fill the airways with the warm (37 °C) low melting point agarose. Observe the lungs: At first the right lung starts to expand followed by the left lung. Filling is completed when both lungs are inflated to a volume comparable to the in vivo situation (about 1.2-2.0 ml depending on gender, age, and weight).\n\t\tNote: If only one lung expands, the plastic pipe may have been inserted too deep so that it has reached the bronchus. In this case, it has to be pulled out a little bit. Keep in mind that the agarose will solidify when it gradually cools down.\nWhen the lungs are full, simultaneously pull out the plastic pipe and ligate the trachea with the sewing cotton to prevent outflow of the agarose. Subsequently, cut the trachea above the ligature and detach lungs and heart on bloc from the chest.\n\t\tNote: For beginners, it may be helpful to ask a colleague for support in the ligation step.\nTransfer the organ packet into ice-cold HEPES-Ringer buffer to solidify the agarose. This happens within a few minutes.\nSeparate the individual lung lobes and fix one lobe with superglue on the specimen holder of the vibratome.",
    "Note: It is helpful to stick a piece of a champagne cork on the holder which serves as skewback during cutting of the elastic lung tissue. Depending on the lung lobe used and on its orientation on the specimen holder, the PCLS obtained may be more suited for analysis of small or large vessels. Mostly we use the left lobe and the right cranial lobe for the preparation of the PCLS. To get cross-sectioned small intra-acinar arteries, glue the cranial right lobe with the hilum to the holder and slice from the periphery. To get cross-sectioned pre-acinar arteries, align the hilum of the right lobe with the champagne cork.\nUse a vibratome equipped with a fresh razor blade to cut the lung lobe into 200 μm thick slices (speed: 12 = 1.2 mm/sec; frequency: 100; amplitude: 1.0). Collect the PCLS in the vibratome basin filled with 4 °C cold HEPES-Ringer buffer.\n\t\tNote: Cooling of the HEPES-Ringer is recommended but nonessential.\nFor removal of the agarose, transfer the organ sections into a glass beaker filled with about 200 ml 37 °C warm MEM. Put the beaker into the heating cabinet into which a tube joined to a bottle with normoxic gas mixture is inserted. Bubble the MEM with the normoxic gas so that the lung sections are slowly moving in the medium. After about 2 hr, the \"agarose plaques\" filling the airspaces will be removed from the lung tissue. This can be recognized by the fact that the sections are no longer swimming on the top of the medium but settle on the bottom of the beaker.\n4. Videomorphometric Analysis of Intrapulmonary Arteries of PCLS",
    "For videomorphometric analysis of intra-pulmonary arteries, transfer one PCLS into the flow-through superfusion chamber filled with 1.2 ml normoxic gassed MEM. Fix the PCLS at the bottom of the chamber with nylon strings connected to a platinum ring (outer/inner diameter: 14/10 mm).\nScan the PCLS microscopically for cross-sectioned arteries with inner diameters between 20-100 µm.\n\t\tNote: The lumen of the arteries is lined by flat endothelial cells. The surrounding smooth muscles cells can be identified in the phase contrast image as a \"dark ring\" surrounding the lumen (see phase contrast images in Figure 2). In contrast, airways can be identified by the initially pseudostratified columnar epithelium which transits on the way to the pleural surface into a simple columnar epithelium followed by a simple cuboidal epithelium.\nMeasure the inner diameter at the beginning of each experiment.\n\t\t\t\tNote: In slightly obliquely cut vessels, the true inner diameter of the tubular structure can be determined in a 90° angle to the longest axis of the lumen. Large pre-acinar arteries with inner diameters >40 µm run adjacent to bronchi and bronchioles. Small intra-acinar arteries with inner diameter <40 µm are located at gussets of alveolar septa next to alveolae and alveolar ducts6.\nExperimental design:\n\t\t\nBegin each experiment with an \"adaptation phase\" in which the chamber is perfused with normoxic gassed medium (flow rate: 0.7 ml/min; 10 min). Next, test the viability of the vessel: Analyze contractility of the artery by the addition of 12 µl of 10 µM U46619 (final concentration 0.1 µM; 10 min; no flow).\n\t\t\t\tNote: For this work, a vessel is defined as viable when the luminal area is reduced by at least 30% (for method of measurement see below).",
    "After washing out the drug with normoxic gassed medium (flow rate: 6 ml/min; 10 min) dilate the artery by application of 3 µl of 10 mM Nipruss (final concentration 25 µM; 10 min; no flow).\nAgain, remove the drug by a 10 min wash with normoxic gassed medium (flow rate: 6 ml/min) followed by 10 min at a flow of 0.7 ml/min.\nInduce hypoxic pulmonary vasoconstriction by incubation of the PCLS with hypoxic gassed medium (flow rate: 0.7 ml/min; 40 min). By an additional tube system, feed the hypoxic gas mixture into the air space of the perfusion chamber.\nRemove the hypoxic medium by a 20 min wash with normoxic gassed medium (flow rate: 6 ml/min).\nAt the end of each experiment, add 1.2 µl of 10 µM U46619 (final concentration 0.01 µM; 20 min; no flow) to the perfusion chamber to induce vasoconstriction.\n\t\t\t\tNote: This final step allows determination of whether a change in the hypoxic response (for instance induced by simultaneous application of a drug in the hypoxic phase or observed in a PCLS prepared from a knockout mouse strain) is specific for the hypoxia-induced constriction or whether it reflects a general impact on contractility. The concentration of 0.01 µM corresponds to the EC50 value of U46619 which was estimated in previous concentration-contraction measurements (not published).\nUse another PCLS to perform control experiments with normoxic instead of hypoxic gassed MEM and normoxic gas mixture in the air space of the perfusion chamber.\n5. Analysis of Vasoreactivity and Graphic Presentation\nUsing suitable software take pictures from the cross sectioned artery every minute during the entire experiment.\nUsing suitable software evaluate changes of the luminal area of the vessels by lining the inner boundaries by hand using full-screen pictures.",
    "Note: It is sufficient to analyze every second picture to get clear graphs. However, when one condition in the flow-through superfusion chamber is changed to another, analyze every picture. The remaining pictures serve as back-up in case one photograph can not be analyzed.\n\t\tUnfortunately, this time consuming step has to be done by hand and not by appropriate programs since sometimes blood cells are attached to the vascular wall which are moving during the measurement or it is not a perfect cross section of the vessel but a tangential section in which a reliable localization of the inner boundaries can only be done under visual control.\nDefine the value obtained for the area of the vessel lumen at the beginning of the experiment as 100% and express vasoconstriction or dilatation as relative decrease or increase of this value.\nFor each experiment plot the relative luminal area against time using suitable software.\nTo summarize several experiments, plot the means of the relative luminal areas +/- standard error of the mean (SEM) against time.\n\t\tNote: For a clear presentation of the effects of various substances on hypoxia- or U46619-induced pulmonary vasoconstriction or of the hypoxic response of knockout mouse strains, the initial phase of the experiments, in which the viability of the vessel is tested, can be omitted from the graph. In this case, the values obtained at the beginning of the exposure to reduced oxygen are defined as 100%.\n6. Statistical Analysis\nAnalyze differences among experimental groups with the Kruskal-Wallis- and the Mann-Whitney-test, with p≤0.05 being considered significant, and p≤0.01 highly significant.\n\t\tNote: For additional information on the preparation and operational use of PCLS see also20,21."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}