{
  "id": 4051,
  "origin_website": "Cell",
  "title": "A two-photon FRAP protocol to measure the stereociliary membrane diffusivity in rat cochlear hair cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare the system for FRAP acquisition\nTiming: 20 min\nOn the day of the experiment, turn on the two-photon acquisition system.\nTune the laser to 860 nm.\nTest the laser power for Pphotobleaching and Pimaging.\nIn our study, the Pockels cell values are set for the Pphotobleaching and Pimaging and the laser power reading on the power meter installed along the laser pathway is confirmed to read the previously determined values.\nTest the photobleaching.\nAlign the optics to focus on a chroma slide.\nTest the Mark Point functionality to perform point bleaching. Refer PrairieView manual for details, [https://eliceirilab.org/sites/default/files/PrairieViewManual_5_2013_0.pdf[href=https://eliceirilab.org/sites/default/files/PrairieViewManual_5_2013_0.pdf]].\nPrepare extracellular solution\nTiming: 30 min\nThe aim of this part is to prepare fresh extracellular solution in which the tissue is placed throughout the experiment.\nMeasure 25 mL of 10× extracellular stock solution prepared previously with volumetric flask.\nAdd to 250 mL beaker with 200 mL milli-Q H2O.\nAdd 74.5 mg creatine monohydrate, 270 mg glucose and 0.5 mL of 1M/1M of pyruvate/ascorbate.\nAdjust pH to 7.4 with 1M NaOH.\nUse volumetric flask to raise volume of solution to 250 mL with milli-Q H2O.\nCheck osmolality. Raise to 304–307 with NaCl if needed.\nPrepare working dye solution of di-3-ANEPPDHQ\nTiming: 5 min\nThaw a vial of 2 μl aliquot of 30 mM di-3-ANEPPDHQ stock solution.\nAdd 1 mL extracellular solution to the stock to make di-3-ANEPPDHQ concentration of 60 μM.\nPipette 100 μl of the 60 μM solution, transfer it to 1 mL vial and add 900 μl of extracellular solution and vortex it.\nThis will result in a final di-3-ANEPPDHQ concentration of 6 μM.\nKeep it in the dark at room temperature (19°C–22°C) until used.",
    "Store the remaining 60 μM stock solution in the freezer at −20°C until the next experiment for up to 3 months.\nCochlear explant preparation, incubation, and mounting\nTiming: 30 min\nDissect the apical turn of isolated organ of Corti from Sprague Dawley rat pups at postnatal day 8 (P8) to P9 of either sex as described in Ricci et al. (2005)[href=https://www.wicell.org#bib12] and (Beurg et al., 2009[href=https://www.wicell.org#bib4]). It is not necessary to take off the tectorial membrane to expose the stereocilia.\nIncubate the dissected tissue in the 6 μM di-3-ANEPPDHQ working solution for 5 min at room temperature (19°C–22°C), while protecting from light.\nTransfer the tissue into the recording chamber with dye-free extracellular solution.\nPlace the tissue above the angled cover slip and orient the tissue so that the stria vascularis is at the top and the organ of Corti at the bottom (as shown in step 2 of the graphical abstract).\nPlace the top dental floss on the stria vascularis and the bottom dental floss near the epithelial ridge area, ideally close to the IHC row.\nOnce both dental flosses are on the tissue, pull the bottom one even lower to stretch the tissue to ensure that the IHC bundles are oriented vertically.\nCritical: It is important to orient the hair cell bundles vertically to perform FRAP experiments at the stereocilia tip. Angled coverslip on the recording chamber and placing the dental floss as close as possible to the IHC row are critical in achieving the vertical orientation of the hair bundles (Figure 4[href=https://www.wicell.org#fig4]).\nTwo-photon FRAP acquisition\nTiming: 1 h",
    "In this section, we describe in detail how to perform two-photon FRAP experiments on cochlear IHC stereocilia using a Bruker Ultima two-photon system coupled with an Olympus BX 61WI microscope, with a light-shielded cage. Di-3-ANEPPDHQ is excited at 860 nm. The fluorescence emission is collected through a 100× 1.0 NA water dipping objective lens and redirected to a 700 nm primary dichroic and then to a GaAsP photo multiplier tube using a 645/65 nm bandpass filter. The data acquisition is driven by the software PrairieView.\nPosition the recording chamber with the mounted tissue under the microscope.\nAlign the optics and focus the tissue with 100× objective lens.\nPick the hair bundle to image in the standard bright field illumination mode.\nSet the Ultima system to operate as a laser scanner system.\nAdjust the Pockels cell control value corresponding to Pimaging and set the GaAsP PMT gain to 800 V.\nFocus just above the tip of the IHC bundle and take intensity images in the live scan mode while moving down in z-axis slowly along the bundle tip using the remote focus control (Figure 4[href=https://www.wicell.org#fig4]A).\nPick the focal plane at the bundle tip where the fluorescence intensity of the stereocilia is at least 3 times that of the background (Figures 4[href=https://www.wicell.org#fig4]A and 4B).\nSelect a small image frame that incorporates the ROI to perform FRAP. The frame should be small enough to perform fast image acquisition and large enough to view the ROI.\nIn our study, we selected a 2.3 μm by 3.3 μm region that enabled a frame period of 72 msec as well as image 5–6 stereocilia at the same time.\nSet the following FRAP protocol sequences (Figure 3[href=https://www.wicell.org#fig3]B) using the T-series functionality:\nPre-bleach cycle of duration = 5 s and frame rate = 1 fps",
    "Photobleaching pulse of duration = 100 ms\nPost-bleach cycle of duration = 1 s and frame rate = 5 fps\nPost-bleach cycle of duration = 11 s and frame rate = 1 fps\nTo set up the photobleaching cycle, use the Mark Point functionality.\nMark a point at the tip of the stereocilia to be bleached (see PrairieView manual for more details).\nSet the Pockels cell control value corresponding to Pphotobleaching as the laser power.\nMake sure the Pockels cell control value on the main window is set to Pimaging.\nRun the T-series.\nCritical: Appropriate laser safety warning signs and “laser in use” sign for Class 4 laser should be used before and during the two-photon FRAP experiment to indicate the laser system is in use. The experiment should be performed in a light controlled cage to protect the highly sensitive GaAsP PMTs from excessive light exposure.\nData analysis\nTiming: 30 min\nIn order to obtain quantitative information from the FRAP images acquired, further analysis of the images is necessary.\nImport all the images from one FRAP sequence together using ImageJ.\nGo to File -> Import -> Image Sequence. Select the first image in the sequence. Enter the number of images in the sequence in the pop-up window and click OK.\nRun the StackReg Plugin in ImageJ [https://imagej.net/StackReg[href=https://imagej.net/StackReg]] to align the images in case the images are not aligned in x and y axis due to motion artefact.\nMark all the ROIs for the average fluorescence intensity to be measured: the bleached region (BL), a reference region (REF) which is a neighboring unbleached stereocilia and a background region (BK) as illustrated in Figure 4[href=https://www.wicell.org#fig4]B.",
    "Measure the average fluorescence intensity of all the regions: the average fluorescence intensity within the bleached spot (   I  B L    ), the reference region (   I  R E F   )   and the background (   I  B K    ). An example is shown in Figure 4[href=https://www.wicell.org#fig4]C.\nGenerate a FRAP curve with normalized fluorescence intensity on the y-axis and time on the x-axis, where t = 0 is the first post bleach measurement (Figure 4[href=https://www.wicell.org#fig4]D). This can be done with custom code implemented in Igor Pro (available through the authors).\nFirst, subtract    I  B K     from    I  B L     and    I  R E F   .  \nNext, normalize the background-subtracted intensity values at each time point to the pre-bleached intensity averaged from the first 5 images just preceding the photobleaching, such that average pre-bleach intensity is set to 1.\n   I  B  L  n o r m      ( t )  =    I  B L    ( t )  −  I  B K    ( t )    I  B L _ P r e b l e a c h     \n   I  R E  F  n o r m      ( t )  =    I  R E F    ( t )  −  I  B K    ( t )    I  R E F _ P r e b l e a c h     \nFinally, to account for the limited bleaching that occurs during recovery, normalize the normalized intensity from the bleached ROI (   I  B  L  n o r m      ) to the intensity from the reference ROI (   I  R E  F  n o r m      ) at each time point to generate the FRAP curve as given below:",
    "I  F R A P  c u r v e    ( t )  =    I  B  L  n o r m      ( t )     I  R E  F  n o r m      ( t )     \nConfirm that the photobleaching of di-3-ANEPPDHQ is irreversible\nTiming: 3 h\nFollowing Axelrod et al. (1976)[href=https://www.wicell.org#bib2], it is presumed the photobleaching is a simple irreversible reaction. The fluorescence recovery that we observe with FRAP should be due to the diffusion of the unbleached fluorophore into the bleached region instead of the bleached fluorophore recovering from the photobleached state. Therefore, it is important to test if the photobleaching of the dye that is being used is irreversible and does not contribute to the fluorescence recovery. Here, we describe how to test if the photobleaching of di-3-ANEPPDHQ is irreversible using a simple membrane model system of pure DOPC vesicles. We select vesicles of size < 0.5 μm, which is the smallest bleach size possible with our optics, so that we can achieve complete bleaching of the vesicle and any observed fluorescence recovery after photobleaching would be contributed only by the reversible photobleaching of the fluorophore.\nAliquot 0.1 mL of 10 mg/mL pure DOPC (1,2-dioleoyl-sn-glycero-3-phosphocholine) in chloroform to a glass vial.\nEvaporate the lipid stock solution by vacuum for 30 min to leave a dried lipid film.\nHydrate the dried lipids in 0.25 mL of 100 mM KCl, 10 mM HEPES, pH 7.4 for an hour.\nOnce the sample is fully hydrated, extrude the solution using the Mini extruder through a 200 nm polycarbonate membrane 11 times.\nAdd 41.6 μL of 60 μM di-3-ANEPPDHQ stock to the lipid solution to make [dye: lipid] ratio of 1:1000.\nKeep the lipid dye solution at 4°C, protected from light.",
    "Mount the DOPC vesicles on a slide in 0.5% agarose gel at 1:1 ratio to keep them mechanically stable.\nTune the laser to 860 nm and align the optics to focus within the vesicles.\nPick a vesicle of size < 0.5 μm. This is to make sure that complete bleaching of the vesicle can be achieved.\nRun the FRAP protocol sequences as described earlier (Figure 3[href=https://www.wicell.org#fig3]B) which includes the prebleach, bleach and postbleach cycles using the FRAP parameters determined previously (steps 4–26).\nAnalyze the FRAP data to generate FRAP curve using Image J.\nIrreversible bleaching of di-3-ANEPPDHQ should show no recovery in the fluorescence signal after photobleaching (see Figures S1C and S1D in George et al. (2020)[href=https://www.wicell.org#bib7]).\nDetermine parameters for the FRAP diffusion model\nTiming: 6 h\nIn this section, we describe the important parameters needed for an accurate estimation of the diffusion coefficient D from the FRAP curve extracted from the IHC stereocilia. For the detailed description of how to calculate the diffusion coefficient D using Mathematica, please refer to George et al. (2020)[href=https://www.wicell.org#bib7] and the code associated to the implementation of the model is available through Mendeley Data [Mendeley Data: https://doi.org/10.17632/3wrd9xp4gc.1]. The model is based on the pure-diffusion model from Axelrod et al. (1976)[href=https://www.wicell.org#bib2].\nThe time course of FRAP recovery can be greatly influenced by the initial bleach volume. It is also important to develop a morphologically accurate model to correct for the geometry of the investigated system. We describe here how to calculate the initial axial extent of photobleaching at the tip of the stereocilium and the length of the stereocilium.\nMount a 250 μm Z-axis Piezo Drive on the microscope.",
    "Dissect and mount the organ of Corti incubated in 6 μM of di-3-ANEPPDHQ for 5 min as described in Ricci et al. (2005)[href=https://www.wicell.org#bib12] and Beurg et al. (2009)[href=https://www.wicell.org#bib4].\nSelect the ROI at the tip of one stereocilium.\nBleach the tip with the bleaching parameters determined previously in steps 4–20, followed by taking a fast z-stack image series with step size of 0.5 μm.\nMeasure the degree of bleaching at each z-plane.\nNormalize the degree of bleaching at each z-plane to that at the plane of bleaching i.e., the stereocilium tip and plot against the position along the z-axis relative to the bleach spot.\nUse Gaussian fitting to measure the effective axial extent of bleaching.\nNote: For an accurate estimation of the bleach volume, it is important to acquire the z-stack at a fast rate to minimize the recovery of fluorescence during the data acquisition. Adjust the imaging parameters such as image size, pixel size, dwell time etc to get a short frame period. In our setup, the frame period was 15 ms enabling us to take the z-stack of the stereocilium within 60 to 75 ms.\nIncubate the organ of Corti tissue in 6 μM di-3-ANEPPDHQ and mounted in a recording chamber such that the stereocilia is oriented to stand up.\nTake live-cell z-stack images of the hair bundle using a high-resolution microscope.\nWe used LSM 880 confocal microscope (Zeiss) in Airy-scan mode with a water immersion 40× 1.0 NA objective (Zeiss).\nCreate 3D reconstruction of the hair bundle and measure the stereocilia length (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/763-Fig5.jpg\nFigure 5. Confocal z-stack images of live IHBs stained with di-3-ANEPPDHQ",
    "The z-stack images are used to create a 3D reconstruction of the hair bundle to measure the length of the stereocilia. The 3D image of the bundle is viewed from different sides to mark the top point “A” and the bottom point “B” of a particular stereocilia to estimate its length.\nWe used the image processing software Imaris 9.3.1 (Oxford Instruments; https://imaris.oxinst.com/support/imaris-release-notes/9-3-0[href=https://imaris.oxinst.com/support/imaris-release-notes/9-3-0])."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Molecular/Chemical Probes",
    "Cell Membrane"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}