{
  "id": 9458,
  "origin_website": "Jove",
  "title": "Enrichment of Detergent-insoluble Protein Aggregates from Human Postmortem Brain",
  "procedures": [
    "Ethics Statement: All brain tissues were obtained from the Emory Alzheimer's Disease Research Center (ADRC) Brain Bank. Human postmortem tissues were acquired under proper Institutional Review Board (IRB) protocols.\n1. Homogenization and Fractionation\nTissue selection\n\tNOTE: Frozen postmortem frontal cortex tissue from healthy control (Ctl) and pathologically confirmed AD cases were selected from the Emory ADRC brain bank (n=2). Post-mortem neuropathological evaluation of amyloid plaque distribution was performed according to the Consortium to Establish a Registry for Alzheimer's Disease semi-quantitative scoring criteria24, although neurofibrillary tangle pathology was assessed in accordance with the Braak staging system.16\nObtain frozen postmortem brain tissue from healthy control (Ctl) and pathologically confirmed AD cases. Utilizing containers of dry ice, forceps and a razor blade, excise ~ 250 mg portions of grey matter from each tissue sample on tared disposable weigh boats, taking care to prevent the tissue from thawing. Record the weight of each piece to be homogenized.\nExcise ~ 250 mg of grey matter using forceps and razor by visually inspecting to locate the interface between the outer grey matter and inner white matter. Avoid white matter and more importantly, any large blood vessels or bloody regions, meninges, or arachnoid mater. Keep the tissue frozen during the cutting process by working quickly and frequently placing weighing boat with brain tissue into polystyrene containers with dry ice.\nRecord the exact weight of grey matter excised from each frozen piece using an analytical balance. Calculate the volume of low salt (LS) buffer (see Table 1) needed for dounce homogenization (5 mL/g or 20% w/v).\nPrepare 10 mL LS buffer with 1x protease and phosphatase inhibitor cocktail and chill on ice.",
    "Remove weighed tissue and weighing boat from dry ice and dice into roughly 2 x 2 mm pieces as it thaws. Transfer to a 2 mL pre-chilled dounce homogenizer tube on ice.\nAdd 5 mL/g (20% w/v) of ice-cold low salt (LS) buffer with 1X protease and phosphatase inhibitor cocktail.\nHomogenize the brain tissue on ice using approximately 10 strokes of high clearance pestle A and 15 strokes of low clearance pestle B.\nTransfer all homogenate to a 2 mL polypropylene tube using a glass Pasteur pipette. Label the tube with “TH” (Total Homogenate), the tissue case number, and homogenate volume.  Aliquot 0.8 mL into a labeled 1.5 mL tube. Any excess homogenate can be similarly aliquoted and stored at -80 °C.\nTo each 0.8 mL aliquot, add 100 µL each of 5 M NaCl and 10% (w/v) sarkosyl to concentrations of 0.5 M and 1% w/v, respectively. Mix tubes well by inversion and incubate on ice for 15 min. Label tubes with \"TH-S\" (Total Homogenate-Sarkosyl) to indicate that the homogenates are in sarkosyl-buffer (Table 1).\nSonicate each tube for three 5 s pulses at 30% amplitude on ice (maximum intensity = 40%) using a microtip probe. \nDetermine the protein concentrations of the homogenates using the bicinchoninic acid (BCA) assay25 method.\n\t\tNOTE: The average protein concentration of TH-S homogenates prepared at 5 mL LS per gram of tissue is 15-20 mg/mL. The homogenates can be fractionated immediately or stored at -80 °C until use.\nDilute TH-S homogenates to 10 mg/mL using ice-cold sark buffer (Table 1) with 1x protease and phosphatase inhibitors.",
    "Transfer 5 mg protein (0.5 mL) of each TH-S homogenate into 500 µL polycarbonate ultracentrifuge tubes and pair-balance with sark-buffer. Load tubes into a pre-chilled rotor and ultracentrifuge at 180,000 x g for 30 min at 4 °C. Transfer the sarkosyl-soluble supernatants (S1) to 1.5 mL tubes and store at -80 °C.\n\t\tNOTE: (Optional wash) Add 200 µL of sark-buffer to the ultracentrifuge tubes containing the detergent-insoluble fractions (P1) and dislodge the pellets (P1) from the bottom of the ultracentrifuge tubes using a 200 µL pipette tip.\nBriefly pulse-spin the inverted tubes for 2-3 s (≤2,500 x g) on a microcentrifuge to transfer the pellets (P1) and buffer to the 1.5 mL tubes below. Resuspend the insoluble pellets (P1) in the sark-buffer by pipetting up and down to ensure the pellet is disrupted.\nPair-balance, and centrifuge at 180,000 x g for an additional 30 min at 4 °C. \nDiscard the optional wash supernatant (S2) and incubate the sarkosyl-insoluble pellets (P2) in 50-75 µL of urea buffer (Table 1) with 1x PIC (protease and phosphatase inhibitor cocktail) for 30 min at room temperature to solubilize the pellet.\n\t\tNOTE: Warm urea buffer to room temperature before use to avoid SDS precipitation. For detergent-sensitive applications, omit SDS from urea buffer and consider washing the insoluble pellet (P2) in low salt buffer before resuspending in urea buffer.\nTransfer the resuspended pellets (P2) to 0.5 mL tubes and use brief (1 s) microtip sonication at 20% amplitude (maximum intensity = 40%) to fully solubilize the pellets.\nDetermine the protein concentrations of the sarkosyl-soluble (S1) and -insoluble (P2) fractions using the BCA assay method. Use these fractions immediately or store at -80 °C until use.\n2. Immunoblotting\nWestern blotting\n\tNOTE: Western blotting was performed according to previously reported procedures with slight modifications.5,10",
    "Prepare 40 µg samples of total homogenates (TH-S), sark-soluble (S1) and sark-insoluble (P2) fractions in 1X Laemmli SDS-page sample buffer with 5 mM TCEP pH 7. Incubate samples at 95 °C for 5 min.\nLoad samples on a precast 10-well 4-12% Bis-Tris SDS-PAGE gel. Electrophorese at 80 V for the first centimeter (10 min) and 120 V for the remainder (60 min) or until the tracking dye reaches the bottom of the gel.\nUse a fresh razor blade and gel knife to split-open the pre-cast gel cassette. Gently cut away the combs and very bottom of the gel with a fresh razor blade.\nResuspend the insoluble pellets (P1) in 200 µl sark-buffer with 1x PIC by pipetting up and down.\nTransfer to a 0.2 µm nitrocellulose membrane using a dry transfer method on a blotting machine (see the Materials Table).\nBlock the membrane in blocking buffer (BB) without Tween 20 for 30 min, followed with BB with 0.05% Tween 20 (BB/T) for 30 min. After blocking, rinse the membrane in TBS/T (0.1% Tween 20) for 5 min to remove excess blocking buffer.\nPrepare 1:1,000 dilutions of the primary antibodies pT231, Tau-2 (pan tau), AT8 and EEA1 in BB/T (0.05% Tween 20).\nIncubate the membranes in primary antibody solution overnight at 4 °C with circular agitation. Rinse the membrane in TBS/T for 3 x 15 min.\nProbe the membrane with a 1:20,000 dilution of the fluorescently-labeled near-IR secondary antibody in BB/T for 60 min at room temperature in darkness on shaker. Rinse the membrane for 3 x 10 min in TBS/T and 2 x 5 min in TBS.",
    "Scan the membrane using an infrared imaging system at the appropriate excitation wavelength (e.g. 700 nm (red channel) for infrared dye 680 goat anti-mouse IgG (H+L) secondary and 800 nm (green channel) for infrared dye 790 donkey anti-rabbit IgG (H+L) secondary).\nUse the imaging software to quantify signal intensities and perform densitometry measurements as per the manufacturer's instructions, ensuring auto-background setting is set to average the entire background.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}