{
  "id": 11232,
  "origin_website": "Jove",
  "title": "Parallel-plate Flow Chamber and Continuous Flow Circuit to Evaluate Endothelial Progenitor Cells under Laminar Flow Shear Stress",
  "procedures": [
    "1. Endothelial progenitor cell isolation\nPrior to any collection of peripheral human blood, submit your research protocol to your Institutional Review Board (IRB), and after its approval, obtain the volunteer donors' informed consent (peripheral blood collection and EPC isolation had been approved by the Duke University IRB and is in full compliance with U.S. regulatory requirements related to the protection of human research participants).\nWhen working with animal-derived EPCs, have your research protocol approved by your Institutional Animal Care and Use Committee (IACUC). All our porcine experiments had been approved by the Duke University IACUC and were conducted in accordance with the highest standards of humane care.\nFor isolation of endothelial progenitor cells, collect 50 ml of peripheral blood via standard phlebotomy technique from a consented volunteer donor into blood collection bags filled with the anticoagulant citrate phosphate dextrose and dilute the solution 1:1 with Hank's buffered salt solution (without CaCl2, MgCl2, MgSO4) and layer on equal volumes of Histopaque to create well-defined layers.\nCentrifuge (30 min, 740 g, low break setting) and collect the mononuclear cell (MNC) (buffy coat) layer. Resuspend and wash MNCs x 3 with Dulbecco's Phosphate Buffered Saline (DPBS) with 10% Fetal Bovine Serum (FBS) x 10 min, 515 g, before plating into two 12-well plates in full EPC growth medium (MCDB-131 medium with 5 ml of 200 mM L-glutamine, 10% FBS and EGM-2 SingleQuots) at 37 °C, 5% CO2.",
    "Slowly change medium every 24 hours for the first 7 days, then every other day. EPC colonies can be identified after an average time of 14 days based on their cobblestone morphology. Once EPCs in culture cover ¼ of the 12-well surface area, expand cells and confirm EPC identity with flow cytometry by testing for presence of surface markers CD31 and absence of CD14, CD45 as previously described 6. Other assays that may be performed include cell morphology and labeling with DiI-Ac-LDL.\nFor the experiments described herein, expand isolated EPCs until they are nearly confluent in 3 T-75 cell culture flasks in EPC medium in a humidified incubator at 37 °C, 5% CO2.\n2. Shear stress calculation\nWe recommend that these calculations are performed before manufacturing the chamber and channel to have a thorough understanding of the conditions that can be achieved. Calculate the flow rate of the perfusate in your circuit based on the desired shear stresses to be applied to the cells according to equation 1 1,\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349eq1.jpg\nwhere Q is the desired flow rate, τ is the target shear stress acting tangentially on the cells, w is the width of the flow chamber, h is the height of the flow chamber, and μ is the viscosity of the perfusate (flow medium).\nA typical value of viscosity (μ) for medium used is 0.9 cP (0.009 g   cm-1   s-1). Note that the viscosity can also be raised by using high molecular weight dextran, if so desired 7. A typical value of target shear stress (τ) used is 15 dynes/ cm2, (typical arterial shear stress) or 100 dynes/cm2, if supra-physiological shear stress is desired. Our chamber typically has a width (w) of 1.9 cm and height (h) in the range of 166 - 267 μm.\n3. Flow chamber manufacturing",
    "Cut the top and bottom plates of the chamber from aluminum alloy 6061 rectangular stock with top dimension of 7 x 2 x 0.5\" and bottom dimensions of 7 x 2 x 0.25\".\nRecess the top plate in the center portion to 0.125\" deep, leaving 0.950\" per end for 1.375\" wide x 0.3125\" deep fluid reservoir.\nDrill 1/16\" wide x 0.625\" long slots from the underside in order to penetrate to the reservoir on the inflow and outflow ends.\nAt the end of each top plate, drill a centrally located 10/32\" tracks per inch (T.P.I.) hole for polypropylene 1/8\" hose barb to penetrate the fluid reservoir. On the inflow end, create a side plug with 10/32\" T.P.I through hole for polypropylene 1/8\" hose barb.\nTaper the top underside from the fluid inflow to the glass viewing window at 0.518 degrees for adequate mixing of fluid.\nCut a glass slide window into the bottom plate in line with the top viewing window. Using aquarium cement, glue a glass slide into the chamber. Allow to cure for at least 24 hours. Ensure that the viewing window is recessed so that a 75 x 25 x 1 mm microscope glass slide will sit flush in the chamber.\nCreate a recess for an O-ring around the underside of the top and bottom plates such that they are spaced apart by 0.02\". Insert the rubber O-rings.\nDrill 10 matching 8/32\" T.P.I. holes in top and bottom chambers for use with 8/32\" flat head screws.\n4. Flow circuit assembly\nAssemble the entire flow circuit first, then proceed with its sterilization.\nAttach a 36\" segment of hard tubing to one end of the pulse dampener (via 1/8\" connection). To the other end, attach an 18\" segment of soft tubing.",
    "Place a 1/8\" male luer adaptor at the end of the 18\" soft tubing section, mentioned in step 4.2. Connect the male luer to a 1/8\" female luer adaptor. Attach the female luer to a new 18\" segment soft tubing.\nDrill three holes into a 250 ml glass beaker cap in order to fit tubing. Insert a 1.5\" segment of soft tubing (as air vent) into one hole and the free ends of the hard and soft tubing through the other 2 holes in the cap into the 250 ml glass bottle (as reservoir) (Fig. 2). Ensure that the hard tubing reaches the bottom of the reservoir (as outflow tubing from the reservoir).\nSterilize the above parts by steam autoclaving at 121 °C for 60 min. Additionally autoclave one complete flow chamber, 3 x 2\" segments of soft tubing, 1 male and 1 female 1/8\" luer adaptor, 4 x ½\" and 6 x 5/16\" 8-32 flat head screws, 1 pair of tweezers, one 75 x 25 x 1 mm glass slide (or other desired cell surface material), and 2 surgical towels.\nPlace sterile towels into laminar flow hood. Place the flow circuit, flow chamber, 4 x 4-way stopcocks, 1 x 1-way stopcock, and all the sterilized parts from step 4.5 onto this sterile field.\nNow use sterile gloves to connect two 4-way stopcocks. Place caps on the open sample ports.\nDetach the male and female luer adaptors attaching the two soft tubing segments of the flow circuit and insert the connected stopcocks (Fig. 3).\nAttach the soft tubing inserted into the reservoir to a 30 ml syringe and remove the syringe piston. Fill the bottle with 125 ml of EPC medium    (Fig. 4).\nPlace a sterile syringe filter into the air vent (Fig. 4).",
    "Move the flow circuit into a humidified incubator at 37 °C, 5% CO2.\nClamp the hard tubing into the roller pump head indicated for use with this type of tubing (Fig. 5). Ensure that the tubing does not overlap with the roller pump mounting tracks. Mark the tubing where it exits the pump head on either side with a marking pen.\nEnsure that all stopcocks are closed off towards the sample ports and open along the flow circuit. Start the pump. Verify the direction of flow. The perfusate should move from the glass reservoir through the hard tubing into the pulse dampener.\n5. EPC fluorescent labeling\nWhile the flow circuit warms to 37 °C, prepare the cells for seeding onto the slide. Note that fluorescent labeling is required if cells are to be visualized on opaque materials, e.g. titanium (Ti).\nCreate a 1 mM stock solution of Cell Tracker Orange (CTO) by diluting 50 μg CTO powder with 90 μl of dimethyl sulfoxide (DMSO). Be sure to shield this mixture from light exposure (turn off light while working under flow hood).\nCreate a 2 μM working solution of CTO by diluting 36 μl of CTO stock solution into 18 ml of serum-free MCDB-131 medium.\nRinse EPCs in 3 near confluent T-75 cell culture flasks with 10 ml DPBS (without Ca or Mg).\nAdd 6 ml of the 2 μM CTO working solution to each flask. Incubate for 15 min at 37 °C. Rinse each flask x 2 with 10 ml DPBS (without Ca or Mg).\nAdd 4 ml of Trypsin to each flask. Incubate at 37 °C for 3 min. Neutralize with 8 ml of Trypsin Neutralization Solution.\nWash by centrifugation x 5 min at 600g and resuspend in 5 ml of EPC medium.",
    "6. Cell seeding of slide prior to flow chamber assembly\nA slide made out of glass, titanium, or other material can be used, and the slide surface can be modified by spin coating with polymer or adding a layer of metal. Place the slide into a sterile rectangular four-chamber cell culture vessel (or use tissue culture slide flask if polystyrene surface is desired). Count cells and seed 1.5 x 106 cells onto the slide in 5 ml of EPC medium x 6 hr if a confluent cell layer is desired at the initiation of flow (Fig. 11A).\nIn order to test cell spreading and adhesion under fluid shear stress, allow 3 x 106 cells to adhere for only 15 min before commencement of flow (quick-seeding) (Fig. 11B).\n7. Flow chamber assembly\nUsing sterile gloves, connect one 2\" soft tubing segment to a 1/8\" female luer adaptor. Connect another 2\" soft tubing segment to a 1/8\" male luer adaptor.\nAttach the 2\" soft tubing with female luer adaptor to the inflow port. Attach the 2\" soft tubing with male luer to the outflow port. Attach 4-way stopcocks to both of these luer adaptors. Connect the remaining 2\" soft tubing piece to the side port connector coming off the bubble trap and attach a 1-way stopcock (Fig. 6).\nUsing sterile tweezers, remove the cell-seeded slide from the cell culture vessel (or if using a slide flask, remove the flask on slide) and place it into the recess on the bottom plate of the flow chamber. Make sure that the slide is placed with the cell-seeded side facing up.\nPipet 10 ml of warm EPC medium onto the slide. Allow the medium to cover the slide and flow chamber, but do not spill the medium over the O-ring on the bottom plate.",
    "Place the top plate of the flow chamber onto the bottom plate, aligning the screw holes. Take care not to introduce air bubbles into the chamber during this step by keeping the two plates parallel.\nScrew plates together (an automatic battery-operated screwdriver speeds up this process).\nRemove air bubbles from inflow bubble trap by opening the 1-way stopcock attached to the inflow-side bubble trap port and gently flush the inflow tubing with EPC medium using a 10 ml syringe. Then close off this stopcock and cap it (Fig. 7).\nNow remove air bubbles from the chamber channel by opening the outflow port 4-way stopcock and by gently flushing EPC medium through the flow chamber, again using a 10 ml syringe. If large bubbles remain, raise the outflow end of the chamber to a 45° angle (Fig. 8).\nCap all of the 4-way stopcock connections and close them off. Move the flow chamber into the incubator with the assembled flow circuit ( Fig. 9).\nPause the flow circuit pump. Close off the flow circuit stopcocks in the direction of flow to prevent leakage and to keep the inside of the chamber sterile. Transport the flow chamber from the flow hood to the flow circuit. Connect the flow chamber to the flow circuit. Open the stopcocks in the direction of flow. Resume the flow pump. Ensure that the perfusate flows in the correct direction. Adjust the flow rate to the desired shear stress.",
    "During the flow experiment, the flow chamber can be removed from the circuit to image the cells via light or fluorescent microscopy. In order to do so, disconnect the flow chamber from the flow circuit at the stopcock-stopcock connections. To maintain sterility of the chamber, close off the flow circuit stopcocks and flow chamber stopcocks in the direction of flow and cap all stopcocks prior to removing the flow circuit from the incubator (Fig. 9).\n8. Perfusate sample collection\nFor easy collection of perfusate samples for analysis, (e.g. nitric oxide synthesis), first pause the pump.\nClose the stopcock located closest to the pulse dampener. Remove its protective cap and insert a small size syringe, e.g. 3 ml syringe, into the sample port. Keep cap and ensure that it will not become contaminated by placing it upside down.\nClose the stopcock in the direction of the flow chamber, keeping the sample port and circuit in the direction of the pulse dampener open.\nDraw desired amount of sample, e.g. 150 μl, from the circuit. Close off the stopcock towards the sample port before removing the syringe. Store the perfusate sample in a labeled vial and freeze at - 80 °C (for nitric oxide determination at a later time point).\nRecap the sample port and ensure that all stopcocks are open before commencing flow.\n9. Representative results\nUsing our quick-seed method, human blood-derived endothelial progenitor cells can be seeded onto titanium slides for 15 minutes and adhere under physiological (arterial) shear forces of 15 dynes/cm2.",
    "As shown in Figure 10, EPCs spread under the influence of flow from 210 ± 11.4 μm2, immediately after seeding, to 657 ± 39.1 μm2 after 3 hours, and to 1152 ± 55.3 μm2 after 24 hours of fluid shear stress of 15 dynes/ cm2 (difference between the groups is statistically significant with p < 0.0001, 1-way ANOVA). Parallel to the increase in cell area, which can be imaged through the transparent chamber with either light or fluorescent microscope, the roundness calculated according to equation 2 6\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349eq2.jpg\ndecreased from 878 x 10-3 ± 5.9 x 10-3, immediately after seeding, to 671 x 10-3 ± 19.2 x 10-3 after 3 hours, and to 526 x 10-3 ± 19.2 x 10-3 after 48 hours of the same fluid shear stress exposure (difference between the groups is again statistically significant with p < 0.0001, 1-way ANOVA).\nFigure 11D illustrates that EPCs align and orient in the direction of flow after 48 hours of fluid shear stress at 15 dynes/cm2 as compared to their random orientation after a static seeding period of 6 hours, shown in Figure 11A.\nOur method also allows for obtaining samples of the perfusate at predetermined time points for the analysis and/or quantification of secreted cell metabolites. As a representative example we depict the production of nitrite (NO2-) during a 48 hour flow experiment with porcine EPCs in Figure 12. We directly measured this primary oxidation product of nitric oxide (NO) as a surrogate marker for NO in medium samples collected from the flow circuit at the different time points to be 12.0 nmol at 6 hours, 13.1 nmol at 12 hours, 16.3 nmol at 24 hours, and 24.6 nmol after 48 hours for 1 x 106 cells at 15 dynes/cm2 6.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig1.jpg",
    "Figure 1. Schematic showing an overview of the flow circuit assembly and flow experiment. (A) Flow circuit assembly without the flow chamber. Included here are the reservoir, pulse dampener, hard tubing, soft tubing, 4-way stopcocks and connected luer adaptors, as well as air filter. (B) Connecting the flow chamber via the hard tubing segment to the flow pump head. (C) Insertion of the EPC-seeded slide into the bottom plate of the flow chamber (D). Complete assembly of the flow circuit with the flow chamber.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig2.jpg\nFigure 2. Completely assembled flow circuit for sterilization.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig3.jpg\nFigure 3. Assembled flow circuit after sterilization with stopcocks included.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig4.jpg\nFigure 4. Filling the glass reservoir with 125 ml of EPC medium.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig5.jpg\nFigure 5. Flow circuit clamped into the flow pump head prior to flow chamber insertion.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig6.jpg\nFigure 6. Top chamber plate assembly.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig7.jpg\nFigure 7. Flushing the bubble trap with EPC medium to remove bubbles from inflow side of the chamber.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig8.jpg\nFigure 8. Flushing the chamber with EPC medium to remove bubbles from the slide and outflow side of the chamber.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig9.jpg\nFigure 9. Completely assembled flow circuit with inserted flow chamber during a flow experiment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig10.jpg\nFigure 10. EPC area (in μm2) increases over the time course of the flow experiment.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig11.jpg",
    "Figure 11. (A) Light microscope image of HUCB EPCs seeded onto a fibronectin coated glass slide x 6 hours prior to flow at 100 x magnification. (B) HUCB EPCs labeled with CTO and quick-seeded onto a Ti slide x 15 min prior to flow, visualized with fluorescent microscopy at 100 x magnification. (C) The same Ti slide with HUCB EPCs as under (B), after 3 hours of flow at 100 dynes/ cm2 and imaged through the transparent chamber at 100 x magnification. Note the spreading of cells but still random orientation after 3 hours of flow. (D) The same Ti slide, now after 48 hours of flow exposure at 100 x magnification. EPCs are labeled with CTO and cell nuclei are stained with Hoechst dye (blue) after flow. Note the alignment of cells in the direction of flow. (E) Porcine EPCs for comparison on Ti after 48 hours of flow and 15 dynes/ cm2 of shear stress exposure. Cell borders were stained with anti-PECAM stain (green) and nuclei with Sytox Orange Nucleic Acid stain. Note the alignment of cells into the direction of flow.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig12.jpg\nFigure 12. Graph depicts NO production of porcine EPCs during 48 hours of flow. A primary oxidation product of NO, nitrite (NO2-), was measured as a surrogate marker for NO from medium samples collected at different time points during flow.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3349/3349fig13.jpg",
    "Figure 13. The flow chamber is made from aluminum alloy 6061 rectangular stock, with the top section (A) being 0.5\" x 2\" x 7\" and the bottom section (B) 0.25\" x 2\" x 7\" in dimension. The top is planed on its underside O-ring contact surface to 0.45\" in order to insure flatness for sealing. The top part is recessed in its center portion to 0.125\", which leaves 0.95\" per end for a 0.3125\" x 1.375\" fluid reservoir. The top section's reservoir is threaded 3/8-24 T.P.I. and 0.25\" deep to receive threaded stainless steel plugs. Slots measuring 1/16\" x 0.625\" were machined into the underside that penetrate to the reservoir. The inflow side plug has a 10/32\" through hole for a polypropylene 1/8\" hose barb to attach to a stopcock. Each unit end has a centrally located threaded 10/32 T.P.I. by 0.25\" deep portion for a polypropylene 1/8\" hose barb in the 0.45\" x 2\" end. The ends use a 0.07\" hole from the bottom of threads through to penetrate the reservoir. The underside of the top section has a tapered area 0.6875\" wide, 0.518 degrees from the center of an LH slot for a distance of 1.460\". This taper blends to a flat area 0.6875\" wide x 0.0118\" deep and 0.590\" from the end of the glass (or other surface, e.g. titanium slide) recess. This flat must be flush with the glass (or other surface, e.g. titanium slide) once the slide is installed. The taper and flat are polished. The surface of the slide is 0.0118\" recessed from the underside surface. The 0.0118\" recess continues to the reservoir slot on the RH end. An O-ring is recessed entirely around slots and slide leaving 0.020\" of original surface between the O-ring groove and slide.",
    "The top and bottom units are drilled for ten holes. The top section has clearance holes for 8/32 T.P.I. countersunk flat head screws. The bottom section has holes placed matching the top holes and are threaded 8/32 T.P.I.. The bottom unit has a clear glass slide window recessed flush with its surface located over the cell surface glass slide (or titanium slide). The unit has an O-ring groove which encompasses slots in the top unit with width to leave 0.04\" of original surface between the bottom slide and the inner O-ring groove. The O-rings are red silicone AS568A, Dash Number 044 for the top section and 046 for the bottom section. Please click here[href=http://www.jove.com/files/ftp_upload/3349/3349fig13_lg.jpg] to see a larger version of figure 13."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}