{
  "id": 10451,
  "origin_website": "Jove",
  "title": "Visualization of Germinosomes and the Inner Membrane in Bacillus subtilis Spores",
  "procedures": [
    "1. B. subtillis Sporulation (Timing: 7 Days Before Microscopic Observation)\nDay 1\nStreak a bacterial culture on a Luria-Bertani Broth (LB) agar plate (1% tryptone, 0.5% yeast extract, 1% NaCl, 1% agar)13 and incubate overnight at 37 °C to obtain single colonies. Use the B. subtilis KGB80 (PS4150 gerKA gerKC gerKB-mCherry cat, gerD-gfp kan) strain and its parent background strain B. subtilis PS4150 (PS832 ΔgerE::spc, ΔcotE::tet) as described previously7.\nNOTE: The use of spores with the ΔcotEΔgerE background is essential in germinosome visualization, in order to minimize the autofluorescence of the spore coat layers7.\nSterilize all media, tubes, pipets and other culture materials to be used with appropriate methods.\nDay 2\nInoculate a single colony into 5 mL of LB medium early in the morning and incubate the culture under continuous agitation in a screw cap tube at 200 rpm/min and 37 °C until the OD600 reaches 0.3-0.4 (approximately 7 h).\nMake 500 mL of MOPS medium (pH 7.5) containing 3 nM (NH4)6Mo7O24·4H2O, 0.4 μM H3BO3, 30 nM CoCl2·6H2O, 10 nM CuSO4·5H2O, 10 nM ZnSO4·7H2O, 1.32 mM K2HPO4, 0.4 mM MgCl2·6H2O, 0.276 mM K2SO4, 0.01 mM FeSO4·7H2O, 0.14 mM CaCl2·2H2O, 80 mM MOPS, 4 mM Tricine, 0.1 mM MnCl2·2H2O, 10 mM D-glucose-monohydrate, and 10 mM NH4Cl.\nPrepare in screw cap tubes 10-1- 10-7 serial dilutions of the LB culture in 5 mL MOPS medium each and incubate the cultures overnight under continuous agitation at 200 rpm/min and 37 °C.\nNOTE: The serial dilutions prepared here aim to obtain a dilution in early exponential phase in the next morning. This step and the next step are necessary to allow the cells to adapt to the MOPS buffered growth medium.\nDay 3",
    "Select one of the MOPS dilutions with an OD600 of 0.3-0.4. Inoculate 0.2 mL of the culture to pre-warmed (37 °C) 20 mL of MOPS medium in a conical 250 mL flask and incubate under continuous agitation until the OD600 reaches 0.3-0.4 (~7 h).\nInoculate the MOPS based sporulation medium (250 mL) with 1% (v/v) pre-culture from step 1.3.1 and incubate for 3 days at 37 °C in a conical liter flask under continuous agitation. For FM4-64 staining of PS4150 spores, add 2 µg/mL FM4-64 probe (see Table of Materials) to the sporulation medium 1 or 2 h after reaching the peak OD600 value of vegetative growth (generally approximately 2) and allow the culture to subsequently sporulate whilst protecting it from light5.\nDay 7: Harvesting of spores\nDetermine the sporulation yield (spores vs vegetative cells) using phase contrast microscopy at 100X magnification to distinguish the phase bright spores from phase dark cells and possibly non-mature spores. A 90 % phase bright spore yield is expected.\nPellet the spores at 4,270 x g for 15 min at 4 °C in round bottom centrifuge tubes. Wash the spore pellet 2-3 times with 40 mL of sterile ultra-pure Type 1 demineralized water in 50 mL conical centrifuge tubes (see Table of Materials). Spin-down at each wash at 4,270 x g for 15 min (4 °C).\nDay 7: Spore purification",
    "Spore purification: Suspend the spore pellet in 750 µL of 20% nonionic density gradient medium (see Table of materials) and load onto 800 µL of 50% nonionic density gradient medium in sterilized microcentrifuge tubes. Centrifuge for 60 min at 21,500 x g. The pellet obtained contains the free spores. Suspend the spore pellet in 200 µL of 20% nonionic density gradient medium and load onto 1 mL of 50% nonionic density gradient medium in a microcentrifuge tube, and centrifuge for 15 min at 21,500 x g.\nWashing the final spore preparation and storage: The pellet obtained contains the purified dormant spores. Wash the spore pellet 2-3 times with 1.5 mL of sterile ultra-pure Type 1 water (see Table of Materials) and spin-down in between at 9,560 x g for 15 min at 4 °C. Finally, suspend the pellet in sterile ultra-pure Type 1 water to a final OD600 of approximately 30. Aliquots of the spores can be stored at -80 °C for 8 weeks14.\n2. Decoating\nTreat PS4150 spores with 0.1 M NaCl/0.1 M NaOH/1% sodium dodecyl sulfate (SDS)/0.1 M dithiothreitol (DTT) at 70 °C for 1 h. Wash the spores 10 times with sterilized ultra-pure Type 1 water15,16. By doing so, any adsorbed FM4-64 probe in spore’s outer membrane and outer layers will be removed.\n3. Coverslip and Slide Preparation11 (Timing: 1 H Before Observation)\nPre-clean high precision coverslips (see Table of materials) with 1 M HCl for 30 min in a gently shaking water bath. Wash the coverslips twice in ultra-pure Type 1 water, and store them in 100% (vol/vol) EtOH. Let them dry and verify their clarity before use. Pre-clean the glass slides in 70% EtOH. Let them dry and verify their clarity before use.",
    "4. Sampling Fluorescent Microspheres or Spores in the Gene Frame Slide10 (Timing 15 Min)\nPre-warm two 70% EtOH cleaned and air dried glass slides (see Table of materials) for several seconds on a 70 °C heating block, drop 65 μL of sterilized 2% agarose held at 70 °C on top of one glass slide and place the other glass slide on top to spread the agarose between the slides. The agarose patch will dry in approximately 5 min.\nCut the agarose patch into a 1 x 1cm section after removing one of the glass slides, add 0.4 μL of sample (fluorescent microspheres or spores of ~108/mL), and transfer the patch onto the high precision coverslip by placing the coverslip onto the patch and sliding it off.\nFix a Gene Frame (1.5 x 1.6 cm2, 65 µL) onto the dried slide, onto which the coverslip is placed closing all corners of the frame, thus completing the slide for use in microscopy.\n5. Imaging11,17(Timing: 1 H)\nCapture the transmission and fluorescence images of spores as well as a mixture of red and yellow-green carboxylate-modified fluorescent microspheres on a Structured Illumination Microscope (see Table of materials) equipped with a 100x oil objective (Numerical Aperture = 1.49), a CCD camera and image analysis software (see Table of materials). Generate all images at room temperature without the disturbance of ambient light. Make sure to always clean the 100x objective and the slide with 75% ethanol before imaging.\nFocus on 100 nm (diameter) fluorescent microspheres and optimize the point spread function (psf) by adjusting the correction ring on the 100x objective until a symmetric psf is obtained, thus minimizing blurring of the image. The psf is the impulse response or the response of an imaging system to a point source or point object.",
    "Select a field of view with approximately 10 round fluorescent microspheres. Apply a grating focus adjustment for both 561 nm and 488 nm excitation wave lengths as the guide for the image analysis software.\nFocus the spores with the transmission light and capture a transmission light image in the 16× average mode with 200 ms exposures for each image.\nCapture 3D-SIM raw fluorescent images of the spores with the illumination mode “3D-SIM”, the camera settings to readout mode Electron Multiplying (EM) Gain 10MHz at 14-bit, and EM gain at 175. Excite the FM4-64 probe in PS4150 spores with 561 nm laser light at 20% laser power, and an illumination time of 400 ms.\nExcite the GerKB-mCherry and GerD-GFP in KGB80 spores with, respectively, 561 nm laser light at 30% laser power for 1 s, and 488 nm laser light at 60% laser power for 3 s. Z-Stack settings are in the top to bottom mode, 0.2 µm/ step, 7 steps and 20 steps for germinosome and IM analysis, respectively.\nNOTE: These laser parameters were applied in order to assure a maximum brightness value of the histogram window of around 4,000.\n6. Reconstruct 3D-SIM Raw Images of FM4-64 Stained PS4150 Spores\nPerform the N-SIM Slice Reconstruction for the FM4-64 stained PS4150 spores’ raw data. Click the Param button for Reconstruct Slice on the N-SIM pad tab sheet to open the N-SIM Slice Reconstruction window.\nSet the reconstruction parameters in the N-SIM Slice Reconstruction window. To get perfect reconstructed images, follow the suggestion of the N-SIM instructions and click on the appropriate controls in the N-SIM Slice Reconstruction window to set the Illumination Modulation Contrast (IMC) to Auto, High Resolution Noise Suppression (HRNS) to 1.00 and Out of the Focus Blur Suppression (OFBS) to 0.05 as starting points.",
    "Click the Reconstruct Slice button in the N-SIM Slice Reconstruction window to reconstruct the image. Evaluate the quality of the reconstructed images by the Fast Fourier Transformed (FFT) images and reconstruction score, which display after reconstruction12.\nAdjust the HRNS from 0.10 to 5.00 and OFBS from 0.01 to 0.50 by clicking on the appropriate controls in the N-SIM Slice Reconstruction window until the best parameter settings are obtained.\nClick the Apply button in the N-SIM Slice Reconstuction window to apply changed parameters. Click Close button to close the window.\nMake a FM4-64 stained PS4150 spores raw image active and click the Reconstruct Slice button on the N-SIM Pad tab sheet to execute Slice Reconstruction. Save the reconstructed image.\n7. Image Analysis\nConvert Pseudo-Widefield images of the KGB80 germinosome\nConvert 3D-SIM raw images of KGB80 into Pseudo-Widefield images by activating with a left click the ImageJ plugin SIMcheck utility Raw Data SI to Pseudo-Widefield12. Pseudo-Widefield averages images from raw SIM data and assembles, for comparison, an image equivalent to conventional widefield illumination12. For ImageJ itself see https://imagej.net/Welcome. Randomly select ~25 spores in each inverted transmission image for later germinosome analysis in the fluorescent Pseudo-Widefield images.\nSelect in total approximately 350 (in this example, 346) KGB80 spores in 14 fields of view from two slides. The GerD-GFP and GerKB-mCherry fluorescent foci numbers in selected KGB80 spores should be counted independently by two researchers. The researcher can refer back to the 3D-SIM raw images whenever in doubt of the presence of separate fluorescent germinosome foci in spores.\nAssess the maximum intensities of each GerD-GFP and GerKB-mCherry focus and the integrated intensity of each KGB80 spore’s 3D image with ImageJ.\nAnalyze Pseudo-Widefield images of the KGB80 germinosome",
    "Use the mean integrated intensity value of 7 stacks as the integrated signal intensity of the KGB80 spore. Determine background intensities by imaging the background strain PS4150 using identical settings. Regard fluorescent spots in individual KGB80 spores as germinosome foci when they are clearly distinguishable from the background.\nApply one-way ANOVA-tests for significance determination with software Origin 9.0. considering P values <0.05 as statistically significant. Use the Spearman’s rank correlation coefficient18 to evaluate the correlation of GerD-GFP and GerKB-mCherry foci number and the measurements of the integrated signal intensity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}