{
  "id": 17094,
  "origin_website": "Jove",
  "title": "Intradermal Microdialysis: An Approach to Investigating Novel Mechanisms of Microvascular Dysfunction in Humans",
  "procedures": [
    "All procedures are approved by the Institutional Review Board of the Pennsylvania State University prior to participant recruitment.\n1. Equipment setup\nTurn on the local heating unit and the laser Doppler flowmeter.\n\tNOTE: Both should be calibrated prior to data collection according to the manufacturer's instructions. The laser Doppler flowmeter should be connected to data acquisition hardware with sampling at 100 Hz (100 samples/min) and continuous recording in a data acquisition software. While other data acquisition hardware and software can be used, for simplicity, the remaining instructions reflect the PowerLab hardware and LabChart software capabilities.\nOpen a LabChart software file.\n\tNOTE: A reference file with the desired data input and continuous data collection capabilities should be made in advance. There should be one panel for each laser Doppler and local heater that corresponds to each microdialysis site, and the panels should correspond to the appropriate channel inputs in the data acquisition hardware unit.\n2. Microdialysis fiber placement\nIdentify the large, visible blood vessels of the skin in the ventral aspect of the forearm, and indicate them with a permanent marker (utilize a tourniquet to visualize the vessels if necessary; identifying vessels in darkly pigmented skin may require greater reliance on palpation).\nSwab the area encompassing the marks and a generous portion of the surrounding area using betadine swabs. Wipe away the betadine with alcohol swabs. Cover the sterilized area of skin with a sterile drape, and apply ice for ~5 min to numb the area.",
    "Remove the ice, and insert an introducer needle (23 G, 25 mm length), bevel facing upwards, into the dermal layer of the skin at a depth of 2-3 mm (depending on the individual skin thickness). Advance the needle, being careful to remain in the dermal layer, and exit the skin ~20 mm from the point of insertion.\n\tNOTE: To confirm the proper depth of placement in the skin, the shape of the needle should be visible and easily palpable, but the color of the needle should be concealed. If more than one microdialysis probe is required for the experiment, any two introducer needles will need to be placed ≥2.5 cm apart and positioned prior to microdialysis probe insertion. Probes should not be placed along the same major vessel.\nLeaving the needle in place, connect the probe (via the Luer lock) to a syringe containing lactated Ringer's solution. Feed the opposite end of the probe through the introducer needle until the semipermeable membrane of the probe is near but still outside of the opening of the introducer needle. Slowly perfuse a small amount of Ringer's solution through the fiber until the solution is visibly perfused through the pores of the membrane to confirm the integrity of the membrane.\nIf using a Harvard Bioscience microdialysis probe and introducer needle, follow steps 2.5.1-2.5.2.\n\t\nUpon confirmation of the probe function, further feed the probe through the introducer needle until the membrane is completely contained in the dermal layer of the skin within the introducer needle.\nUsing a finger, secure the probe in place proximal to the needle, and withdraw the needle in the opposite direction from insertion. Tape the external portion of the fiber in place on the skin to prevent displacement of the semipermeable membrane during the experiment.",
    "If using a Bioanalytical Systems microdialysis probe and introducer needle, follow steps 2.6.1-2.6.2.\n\t\nUpon confirmation of the probe function, take hold of the hub of the introducer needle and the distal portion of the microdialysis probe in one hand, and simultaneously withdraw the needle opposite to the direction of insertion, moving the microdialysis probe into place.\nAdjust the probe as needed to ensure the semipermeable membrane is buried in the skin completely. Tape the external fiber in place on the skin to prevent displacement of the semipermeable membrane during the experiment.\n3. Hyperemia\nWhile waiting for the hyperemic response to needle insertion to subside (~60-90 min), place the single-use syringe in the syringe-holder tray on the microinfusion pumps. Perfuse lactated Ringer's solution, saline, or vehicle solution (the solution in which the experimental pharmacological agent is dissolved; 2 µL/min) during the hyperemia phase.\n\tNOTE: While the microdialysis probes cannot be removed during this ~60-90 min phase, the participant can adjust their body position or move their hand, or the Luer lock of the probe can be removed from the syringe and secured with tape to the participant's arm to allow them free range of motion to briefly stand. Once instrumented with local heaters and laser Doppler flowmetry (LDF) probes and once data collection has begun, the LDF probes cannot be moved.\nWhen the skin redness, which is an indicator of the hyperemic response to needle trauma, has subsided, attach the local heating unit to the skin covering the semipermeable membrane via the probe adhesive disc, ensuring that the center of the heater aligns with the path of the microdialysis probe.",
    "Place the LDF probe into the opening in the center of the local heater so that the laser is directly perpendicular to the surface of the skin. Once the LDF probes are placed and secured, click on start on the data acquisition software to continuously record and display the red blood cell flux values (RBC flux; perfusion units, PUs). If hyperemia has completely subsided, the RBC flux will be stable at ~5-20 PU (the pulsatility of the vessels below the LDF probe may be reflected by slight elevations in the PU that coincide with the heartbeats).\nPlace an automatic blood pressure cuff on the arm of a subject which has not been instrumented.\nSet the local heaters to 33 °C to clamp the skin temperature within a thermoneutral range25, thus removing any variations in the influence of thermal stimuli. To add a comment to the continuous recording in the data acquisition software to denote events in the experiment, click on the text box in the top-right corner of the screen, type a comment, select which channels should receive the comment, and click on add.\n4. Acetylcholine dose-response protocol\nOnce the RBC flux has stabilized in response to the 33 °C local heat, begin baseline data collection, distinguished in the data acquisition software file by a comment begin baseline. At least a minimum of 5-10 min of stable baseline is required for data analysis; restart the baseline at any time during this point in data collection if needed, and mark this in the LabChart file. In the final minute of baseline, collect a blood pressure measurement, and enter the values in a comment in the LabChart file.",
    "At the end of the 5-10 min of baseline data collection, measure and record the baseline blood pressure, and enter the comment end baseline into the data acquisition software.\nTurn off the microinfusion pumps, and exchange the syringes full of lactated Ringer's solution for the syringe filled with the lowest concentration of ACh (10−10 M).\nSecure the new syringes in place, and confirm the perfusion of the fluid through the end of the probe before turning the microinfusion pumps on again. Enter the comment begin −10 into the data acquisition software recording.\nEach concentration of ACh will be perfused for 5-10 min at 2 µL/min. In the final minute of perfusion, for every concentration, measure and record the blood pressure. Once the perfusion time for a given concentration has ended, replace the syringe with the next highest concentration (e.g., 10−10 M ACh solution is exchanged for 10−9 M ACh solution), as described in steps 4.2-4.4.\nImmediately after perfusing the final concentration of ACh (10−1 M), replace the ACh syringe with one containing Ringer's solution, and increase the local heater temperature to 43 °C. Once the RBC flux has stabilized, replace the Ringer's solution with sodium nitroprusside (28 mM) to produce both a heat-induced and pharmacologically induced maximal local vasodilation. Measure and record the blood pressure every ~3 min during this maximal vasodilation phase.\nOnce a maximal RBC flux plateau has occurred (~5 min stable PU), end the experiment. Select stop in the bottom-right corner of the data acquisition software to end the continuous data collection.\n5. Local heating protocol",
    "Once the RBC flux has stabilized following hyperemia, begin the baseline data collection, and indicate this in the data acquisition software file with a comment. In the final minute of baseline, collect a blood pressure measurement, and enter the values in a comment into the data acquisition software file.\nIncrease the local heaters to either 39 °C or 42 °C, depending on the protocol's needs (explained in the discussion section).\nOnce the RBC flux has plateaued in response to local heat application (~40-60 min heating), perfuse NG-nitro-l-arginine methyl ester (L-NAME; 15 mM dissolved in Ringer's solution; 2 µL/min; a NO synthase inhibitor) through the microdialysis probe(s).\nOnce the RBC flux has plateaued in response to L-NAME (~15-25 min of perfusion), increase the local heaters to 43 °C.\nOnce the RBC flux has plateaued in response to 43 °C (a ~2-5 min plateau occurs after ~20-45 min of heating), perfuse sodium nitroprusside (28 mM dissolved in Ringer's solution) through the microdialysis probe(s).\nOnce a maximal RBC flux plateau has occurred (~5 min stable PU), end the experiment. Select stop in the bottom-right corner of the data acquisition software to end the data collection.\n6. Removing the microdialysis probes\nFollowing the termination of the experiment, use a pair of surgical scissors to cut the microdialysis probes. Carefully remove the LDF probes from the heaters, and remove the heaters from the skin. Gently remove the tape holding the probes in place on the skin.\nVisually identify which puncture site on either side of the probe has formed the smallest blood clot. Cut the portion of the probe near the site with the smaller clot, leaving ~1 in of the probe outside of the skin uncut.",
    "Clean the portion of the skin surrounding the entry and exit sites of the probe with an alcohol swab, as well as the ~1 in length of probe left on the less-clotted site.\nAllow the alcohol to dry on the skin. Then, grasp the portion of the probe extending from the puncture site with the greater clot, opposite the ~1 in portion on the less-clotted end. Slowly pull the probe toward the larger blood clot.\nPlace sterile gauze over any bleeding that results from the probe removal, and apply pressure.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}