{
  "id": 17942,
  "origin_website": "Jove",
  "title": "The Left Pneumonectomy Combined with Monocrotaline or Sugen as a Model of Pulmonary Hypertension in Rats",
  "procedures": [
    "The procedures described below have been approved by the Institutional Animal Care and Use Committee (IACUC) of the Icahn School of Medicine at Mount Sinai. All rats received humane care in compliance with the Mount Sinai “Guide for the Care and Use of Laboratory Animals”.\n1. Preparation for Surgery\nAutoclave Cooley-Mayo curved scissors (large scissors), straight Iris scissors (small scissors), McPherson-Vannas Iris scissors (back scissors), Wangensteen tissue forceps (atraumatic forceps), Gerald tissue forceps, plain wire speculum (self-retaining retractor), small vessel cauterizer, gauze, double-ended probe, thin vascular needle holder, and Micro-Jacobson mosquito hemostatic forceps (mosquito).\n2. Preparation and Intubation of Rats\nAdminister a subcutaneous injection of buprenorphine analgesia (0.1 mg/kg) in 6–8 week old male, Sprague-Dawley rats, 30 min prior to surgery.\nPlace the rat individually in a chamber exposed to isoflurane 4% and oxygen (1 L/min) for 3–4 min until the rat is properly anesthetized (i.e., unconscious, breathing slowly, and unresponsive to touch or sound).\nIntubation of Rats\nRemove the rat from the chamber and tape the rat to a board so the rat lays flat on its back, with the mouth at the edge of the board. Use string to hold the rat by the two front teeth so that the neck remains flat/straight.\nPlace a fiber optic goose light source above the neck over the larynx, lift and hold the tongue with fingers, and move the epiglottis up to visualize the vocal cords. The trachea should be brightly lit behind the vocal cords; adjust the position of the light until the trachea is bright.\nIntubate the rats by inserting a 16 G catheter into the larynx within 60 s of removing the rat from the chamber as they wake quickly. If the rat wakes before successful intubation, put the rat back and repeat.",
    "Immediately connect the rat to the ventilator to resume isoflurane and oxygen delivery. Confirm the intubation using a cold mirror to observe condensation of the humidity in the exhaled breath from the catheter. Make sure the animal is still breathing by the expansion of the chest.\nConnect the rat to the ventilator. Set the oxygen to flow at 1 L/min. Set the ventilation rate to 70 breaths/min with a tidal volume of 0.35–0.45 mL. Set positive end expiratory pressure (PEEP) to 2–4 cm H2O. Reduce isoflurane to 2–3%.\nPlace the rat under the microscope in the right decubitus position on a heating pad at 37 °C. Tape the front legs down. Shave the left thorax behind the front leg until the end of the rib cage with clippers. Clean the surgical area with gauze and 10% povidone-iodine solution, followed by 70% ethanol (three times).\nPlace the pulse oximeter on the rat’s foot and monitor the heart rate and oxygen saturation throughout the surgery. Heart rate should be between 200–500 bpm and oxygen saturation should be >95%.\n3. Preparation of Sterile Environment\nVisualize the surgical area under the microscope. This must be done first because the microscope cannot be adjusted once the environment is sterile.\nPut on sterile, surgical gloves. Do not touch anything besides the sterilized instruments, the surgical drapes, and the surgical area of the rat’s body.\nPlace a sterile drape over the rat’s body and on the instrument tray to create a sterile environment.\nWith sterile gloves, place sterile instruments on the sterile instrument tray.\n4. Left Pneumonectomy Surgical Procedure",
    "Use Cooley-Mayo scissors and Gerald tissue forceps to cut a small hole in the surgical drape. The hole should be about 2–3 cm in diameter to fully visualize the incision but not too large so that only sterilized skin is exposed.\nMake a 2 cm long lateral incision in the left thorax using a surgical blade. Use gauze and the electrocautery pen to manage bleeding/maintain hemostasis. Use the Cooley-Mayo scissors to cut each layer of tissue until the ribs and intercostal muscles are exposed.\nEntering Intercostal Space\nUse the mosquito to make a hole through the muscle of the third intercostal space.\nUse the double-ended probe to move the lung out of the way to visualize the pulmonary artery. The investigator may enter another intercostal space if the pulmonary artery is not accessible.\nUse iris scissors and McPherson-Vannas iris scissors (back scissors) to open the intercostal muscles to about 1–2 cm. Use the electrocautery pen to stop any bleeding.\nPlace a small, self-retaining retractor to hold the ribs and muscles open.\nOpen only the left pleura and move the left lung down lower in the abdomen to allow access to the pulmonary artery and bronchus. Load a medium hemoclip into the ligating clip applicator.\nLigation of the Left Main Bronchus and Left Main Pulmonary Artery\nLift the upper portion of the left lung carefully with the Wangensteen atraumatic forceps to expose the pulmonary artery.\nClip the pulmonary artery by closing the clip and applicator around the artery. Be careful not to close or rupture the left azygos vein. Do not clamp too forcefully otherwise, the vessel can rupture.\nOpen the incision further using the tonsil to separate the muscle fibers.\nLoad another medium hemoclip into the ligating clip applicator so that it is ready.",
    "Use the atraumatic forceps to lift the lower portion of the lung out of the incision until the left main bronchus and left pulmonary vein are visualized. Atraumatic forceps must be used pull to move the lung up and out of the incision. Since the lung is too large to be pulled out in one motion without tearing the tissue, the issue forceps are necessary to hold the lung in place while the atraumatic forceps are used carefully to pull more lung out.\nLigate the left main bronchus and left main pulmonary vein together by closing the applicator around them. Do not clamp the vein and bronchus too forcefully otherwise, the vessel can rupture.\nRemove the lung with scissors. Be careful not to cut or tear out the clip. Use a small piece of sterile gauze to absorb any blood and make sure there is no bleeding.\nClosure of the Ribs and Intercostal Muscles\nBefore closing the intercostal muscles, insert a 16 G catheter into the thoracic cavity away from the surgical incision and into the seventh intercostal space. Make sure the investigator can visualize the needle so as not to puncture any vital organs or vessels.\nImmediately remove the needle, leaving the catheter in place. This will be used as a chest tube.\nClose the ribs and intercostal muscles with a 4-0 prolene suture.\nClose the skin and subcutaneous space with a running 5-0 suture (Table of Materials).\nPlace a 5-0 suture (Table of Materials) into the skin and around the chest tube so when the chest tube is removed, the hole will be tied shut.",
    "Evacuate the air from the pleural cavity with a 3 mL syringe through the catheter to regain the negative normal pressure in the thorax. Immediately clamp the catheter with a needle holder to prevent air from going back into the thoracic cavity. Quickly remove the catheter and tie the suture to close the hole.\n5. Post-operative Recovery\nPlace the animal in the sternal position. Turn off the isoflurane but continue giving the rat oxygen via endotracheal tube. Do not leave the animal unattended at any point until it has regained sufficient consciousness to ambulate and the animal is safely in its cage.\nAdminister 2–3 mL of sterile lactated Ringer’s solution subcutaneously.\nMonitor the heart rate (≈200–500 bpm), oxygen saturation (≥95%), and animal color to confirm the animal is breathing well.\nWhen the animal starts making spontaneous breathing motions and neck movements and responds to physical stimuli (such as eyes widening, nose moving, and ears responding to sound), extubate the animal by pulling out the catheter and disconnect the ventilator.\nReturn the animal to an empty cage, away from the company of other animals. The animal should be alone for at least 3 days.\nFor pain control, administer 0.1 mg/kg of Buprenorphine subcutaneously every 12 h for 3 days.\n6. Administration of “Second Hit” MCT or Sugen\nAdminister 1 mL of MCT (60 mg/kg) or 1 mL of Sugen (25 mg/kg) via subcutaneous injection, 1 week after the surgery.\n7. Terminal Harvest\nSeven weeks after MCT or Sugen administration, place the animal in a chamber with flowing oxygen (1 L/min) and 4% isoflurane.\nConnect the animal to the ventilator via nose cone. Keep oxygen flowing and lower the isoflurane to 2.5–3%. Lay the animal on his back and tape down all limbs.\nShave the animal along the entire abdomen.",
    "Opening the Chest\nMake an incision down the chest with a scalpel from the subclavian notch to the xyphoid.\nUse the tissue forceps to hold the xyphoid. Cut through the sternum with the Cooley-Mayo scissors until the heart and pulmonary artery are fully accessible. Use the electrocautery to stop the bleeding. Hold the ribs open with a retractor.\nIdentify the pulmonary artery. Adjust the orientation of the heart, if necessary, by adding gauze underneath. Use a 20 G IV catheter to puncture the pulmonary artery between the pulmonary valve and the bifurcation of the main pulmonary artery. Advance only the 20 G catheter into the artery and remove the needle. Advance the 1.2 Fr transonic pressure catheter into IV catheter that is in the pulmonary artery. Once the PA curve is steady, record the pressure for at least 10 s. Repeat these steps to record the pressure in the right ventricle.\nRemove the heart and lungs. Place pieces of the lung in formalin to be fixed in paraffin and stained with hematoxylin and eosin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}