{
  "id": 9619,
  "origin_website": "Jove",
  "title": "Analysis of Neural Crest Migration and Differentiation by Cross-species Transplantation",
  "procedures": [
    "1. Incubate chick and quail eggs to the desired stage\nFor HH9 embryos, typical incubation times range from 29-33 hours at 38 °C.63\nWash any debris from the eggs with tepid water.\nArrange chicken eggs on tray horizontally. Mark the side facing up with pencil; this will correspond to the region where the embryo will be localized. Incubate quail eggs blunt end up.\nPlace in 38 °C humidified incubator. Turn on rocking function.\n2. Prepare eggs for windowing and dissection\nRemove eggs from incubator, and sterilize the tops with 70% ethanol. It is best to spray on the ethanol and wipe it off quickly with a paper towel or Kimwipe to avoid any absorption of ethanol through the eggshell.\nPlace chicken egg onto an individual egg holder (we use a Petri dish lined with folded paper towels, e.g., \"Kimwipes\"). Using AA forceps, tap a small hole into the upper surface of the eggshell at the pointed end of the egg.\nRemove 1.5-3mL of light albumin from the chicken egg with an 18½ G hypodermic needle and 5 mL syringe. It is best to insert the needle vertically into the hole, with the bevel facing the pointy end of the egg (Figure 2A). This way, when albumin is withdrawn, there is little risk of accidentally damaging the yolk via suction. Discard the albumin. This step will lower the yolk and embryo within the egg to allow for a window to be opened in the eggshell.\nWipe the hole with 70% ethanol as described above and seal it with Scotch tape. It is important that the eggshell surrounding the hole is completely devoid of albumin and dry or the adhesive will not seal.",
    "With the AA forceps, tap another hole into the marked upper surface of the horizontal egg, not quite at the apex. Take care not to let the forceps go too far through the eggshell to avoid damaging the yolk or embryo.\nInsert one side of the curved iris forceps into the hole parallel to the eggs shell. Pinching down on the shell, working in a circular motion to break a ~2 cm in diameter window in the chicken egg shell. Discard the removed eggshell. Alternatively, cover the upper surface of the egg with packing tape and use a pair of scissors to cut out the window. This minimizes the chance of eggshell debris falling into the egg. The embryo should appear as an opaque disc on top of the yolk. Discard any unfertilized eggs (identified by small white spot on surface of yolk, or absence of blastoderm).",
    "Inject a small amount of India ink (diluted 1:10 in sterile Ringer's solution containing \"Pen/Strep\" antibiotic: final concentration 100 μg/mL penicillin and 100 μg/mL streptomycin) beneath the blastoderm to assist with staging the embryo. Use a 1 mL syringe and 26½ G hypodermic needle, bent into a 45° angle at the base of the needle, with the bevel facing up; alternatively, one may use a pulled glass Pasteur pipet and mouth pipetting apparatus (wear eye protection when bending hypodermic needle or breaking glass needle). Puncture the yolk membrane outside the perimeter of the blastoderm and slide the tip of the needle beneath the embryo, close to the surface of the yolk but not in the embryonic layers (Figure 2B). Inject just enough ink to outline the embryo, then carefully withdraw the needle (Figure 2C). Injecting too much ink can lead to embryo death. It is important not to inject any air bubbles beneath the embryo, as this can be a source for contamination. NB: All Ringer's solution used in this procedure is sterilized and contains Pen/Strep as defined above. Sterile phosphate buffered saline (PBS) is also an acceptable alternative to Ringer's solution in all steps of this protocol.\nStage the embryo according to Hamburger and Hamilton63 and record the stage on the eggshell in permanent ink or pencil. Stages are best assessed under stereomicroscopy, with fiber optic \"gooseneck\" light sources which have a limited heat load.\nApply 2-3 drops warm sterile Ringer's solution to the surface of the embryo to prevent dehydration and contamination. Temporarily seal the window with parafilm stretched over the surface of the egg.\nRepeat steps 2.2-2.9 with all chick eggs before beginning the transplant experiments.",
    "Since quail embryos are only used for donor tissues, in ovo steps 2.2-2.9 may be omitted. For ex ovo preparation of donor embryos, quail eggs are incubated blunt side up and opened in this region with curved forceps to reveal the embryo. Using dissecting scissors, make four cuts in the shape of a square through the vitelline membrane and blastoderm outside the embryo (make sure that all cuts meet). Using a curved iris forceps, gently grasp one cut edge and lift the embryo from the egg and transfer it to Ringers solution in a Petri dish. Alternatively, one may use the curved iris forceps to lift the excised embryo from beneath, or an embryo spoon or plastic transfer pipette cut through the wider part of the cylinder, may be used to transfer the embryo out of the egg. Gently remove the vitelline membrane with #5 forceps. Collect the remaining quail embryos as above, and stage them under a dissecting microscope.\n3. Prepare the host embryo to receive the graft\nRemove parafilm from the host (chick) embryo and using a sharpened tungsten needle or #5 forceps, tear a small hole in the vitelline membrane at the desired region of the neural tube (Figure 3A).\nAdd a drop of Ringer's solution to the embryo. Take care to keep the embryo completely submerged in Ringer's solution during the entire procedure to prevent dehydration of the tissue. Keep adding drops of Ringer's solution to the surface of the embryo via transfer pipette if necessary.",
    "Using a pulled glass needle, carefully make rostral and caudal transverse incisions corresponding to the length and region of interest in the dorsal neural tube. (Pulled glass needles are generated from silicon glass capillary tubes which have been pulled under heat with a needle pulling apparatus.) For unilateral grafts the incisions should only extend to the lumen of the dorsal neural tube, and for bilateral grafts, make the incisions across the entire dorsal neural tube. Then cut bilaterally between the dorsal neural tube and the paraxial mesoderm.\nCarefully separate the excised explant from the neural tube then remove it from the embryo by aspirating into a glass micropipette (Figure 3B).\n4. Prepare the donor graft tissue\nChoose a stage-matched quail embryo. Hold the embryo down with AA forceps, remove the vitelline membrane, and excise a similar-sized region of neural tube as described above (3.3-3.4) (Figure 3A'-B'). Depending on the needs of your experiment, this region may be a complementary region of the host (chick) neural tube or from a different region along the rostro-caudal axis. (NB: for larger regional grafts, including complete neural tube grafts, researchers may wish to add a protease digestion at this step to remove any adherent mesenchymal tissue from the donor tissue prior to transplantation. However, for small dorsal neural tube grafts at early stages, as is detailed here, protease digestion is not necessary as the neural tube is easily separated from adjacent mesenchyme by strictly surgical techniques.)\n5. Graft the tissue\nAspirate the donor explant into a glass micropipette containing Ringer's solution. Be careful not to introduce any bubbles into the pipette.\nTransfer the explant adjacent to the excised region of the chick host. Using pulled glass needle, orient the explant and gently guide it into the ablated region (Figure 3C).",
    "Carefully add a few drops of Ringer's solution to the embryo to prevent dehydration. Take care to avoid dropping liquid directly on the graft site as this may dislodge the graft.\nSeal the window with packing tape. Make sure that the tape seals the entire region of the windowed egg. This prevents dehydration and contamination of the embryo during subsequent incubation.\nReturn the egg to the incubator until the desired stage. Make sure that the \"rocking\" function is turned off while incubating the chimeras. Eggs may be gently turned by hand two times a day as this may increase their viability if later stages of development are targeted.\n6. Prepare chimeric embryos for sectioning\nAt the experimental endpoint, cut away the tape covering the window using fine scissors.\nGrasp the edge of the blastoderm with curved iris forceps (easiest to do with serrated tips), then cut the embryo away from the yolk with 4 large cuts outside the boundaries of the blastoderm.\nTransfer the embryo to a Petri dish containing Ringer's solution. Take care to minimize exposure of the embryo to air in order to avoid dehydration of the tissue.\nUnder stereomicroscopy, gently separate the vitelline membrane from the blastoderm using #5 forceps.\nCarefully arrange the embryo in the dish so that the embryo is in the same orientation as it was in the egg, with surrounding membranes laid out flat.\nUse dissecting needles made from tungsten wires64 to cleanly remove the surrounding blastoderm from the embryo by arranging the needle at the boundary of the embryo and extraembryonic tissues, with the length of the tungsten wire parallel to the bottom of the dish. Use a gentle sawing motion to cut through the tissues.",
    "Carefully remove the amnion with #5 forceps. At this point you may, wish to either further dissect the region of your interest, or leave the embryo whole.\nTransfer the embryo to ice cold 4% paraformaldehyde and rock overnight at 4 °C.\nPrepare samples and embed for cryo- or paraffin sectioning.\nTrace the grafted tissue within the host embryo. There are several techniques for identifying quail tissue within a chick embryo, including detection of quail nucleoli by hematoxylin staining (quail nuclei have very large, darker staining inclusions than chick nuclei), the Feulgen-Rossenbeck reaction, acridine-orange or biz-benzamide stain combined with electron microscopy, or immunolabeling for quail-specific antigens3,47,65,66. Here we use QCPN antigen and standard whole-mount or section immunofluorescence techniques to identify quail neural crest cells in quail-chick chimeras (Figure 4). This technique provides the most flexibility in experimental design, as the QCPN immunofluorescence may also be combined with other antibodies to identify differentiated cells derived from the donor (quail) tissue. Use standard whole-mount or section immunofluorescence techniques to label quail-derived cells in chimeras.\n7. Representative Results\nA representative image of the grafted region of the neural tube after 6h of re-incubation (to HH11) shows expected incorporation of the grafted donor (quail) tissue into the host (chick) neural tube (Figure 4A). Embryos showing incomplete integration of the graft, or asymmetric development of the cranial region or somites after reincubation should be discarded.\nCross section through the grafted region at HH11 show NCCs labeled with HNK-1 migrating laterally away from the neural tube. Quail cells contributing to the NCC migratory stream, and to the neural tube, are clearly labeled with QCPN (Figure 4B).",
    "At later stages, quail NCC-derived cells can be traced to their final target tissue. QCPN labeled cells are interspersed within the chick embryo mesenchyme of the maxillary process at E5 (Figure 4C).\nThe QCPN antibody can be easily combined with other antibodies to examine the differentiation of quail-derived NCCs in the host environment. Quail NCC-derived trigeminal sensory neurons are labeled by QCPN and Tuj1 antibodies (Figure 4D).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3622/3622fig1.jpg\nFigure 1. Overview of experimental procedure and necessary instruments.  A) Host (chick) and donor (quail) embryos should be stage matched. To label the NCC stream that contributes to the trigeminal ganglion and maxillo-mandibular region, HH9 is ideal. At HH9, the neural tube is beginning to close in the rostral region, but is not yet completely sealed. The gray line in the diagrams represents the midline of the closing neural tube. The dotted white lines indicate the cut lines for excising a midbrain region of the right side of the neural tube from host and donor embryos. The excised region of the host embryo is discarded and the donor tissue transplanted in to generate the chimeric embryo. B) Necessary instruments include: a) 5mL syringe with 18½ G hypodermic needle, b) 1 mL syringe with 26½ G hypodermic needle bent at 45° angle, c) India ink, d) clear packing tape, e) glass pipette with mouth pipetting apparatus, f) 60 mm-Petri dish, g) AA forceps, h) curved iris forceps with serrated tips, i) #5 forceps, j) fine scissors, k) sharpened tungsten wire, l) pulled glass needle, m) parafilm squares.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3622/3622fig2.jpg",
    "Figure 2. Preparation of eggs and embryos. A) Cross-sectional diagram of the egg, including ideal insertion point of 18½ G hypodermic needle for withdrawal of light albumin. B) After withdrawing ~3mL of light albumin, the yolk and embryo lowers within the egg, allowing the researchers to cut a \"window\" (arrows) in the eggshell to access the embryo. India ink, diluted 1:10 in sterile Ringer's solution, can then be injected beneath the blastoderm to provide contrast for easy staging of the embryos. C) Chick embryo after inking.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3622/3622fig3.jpg",
    "Figure 3. Schematic and examples of HH stage 9 donor and host embryos at each step of the grafting procedure.  A) Chick host embryo. Dashed lines in diagram indicate where the vitelline membrane should be torn to access the cranial region for grafting. Once torn the triangular flap of vitelline membrane should be peeled caudally. Box in image indicates inset used in (B-C). A') Quail donor embryo. Image is of donor embryo excised from egg and placed into Petri dish for dissection of the graft tissue. Box in image indicates inset used in (B'). Dashed lines in schematic diagram (A') indicate where the vitelline and yolk membranes should be cut in order to remove the embryo from the egg. B) Host embryo with unilateral midbrain region of neural tube excised (white arrows) awaiting graft. Dotted line in schematic diagram indicates where cuts should be made to excise the neural tube in the midbrain region. B') Donor embryo with dorsal neural tube graft tissue excised (graft tissue indicated by black arrowheads). Dotted line in diagram indicates where cuts should be made in the quail embryo to excise the donor tissue for unilateral grafting of the midbrain region of the neural tube. C) Chimeric embryo after grafting of quail dorsal neural tube explant into the chick midbrain region.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3622/3622fig4.jpg",
    "Figure 4. Immunofluorescence detecting quail-specific nuclear antigen QCPN in donor-derived cells in the chimeric embryo.  A) Whole-mount image of HH11 chimera (grafted at HH9) showing QCPN staining in red, and HNK-1 staining (a marker of migrating NCCs) in green. 10X magnification, dorsal view. B) Cross section through embryo in (A), showing QCPN-positive quail derived cells in the neural tube and migratory NCC co-stained with HNK-1 (green). 40X magnification. C) Cross-section through maxillary process of E5 chimera (incubated for 3 days post graft), showing QCPN-positive NCC-derived cells (red) which have migrated from the grafted region of the neural tube to their final location in the embryo. 10X magnification. D) Section through E5 chimera showing contribution of quail derived NCC to the trigeminal ganglion (red) and differentiation into TuJ1-positive neurons (green). 40X magnification. *, NCCs; MP, maxillary process; NT, neural tube; TG, trigeminal ganglion.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}