{
  "id": 13378,
  "origin_website": "Jove",
  "title": "Immunohistochemical Detection of 5-Methylcytosine and 5-Hydroxymethylcytosine in Developing and Postmitotic Mouse Retina",
  "procedures": [
    "All procedures with mice were performed in accordance with protocols approved by the Children's Hospital Oakland Research Institute animal care and use committee and adhered to the Association for Research in Vision and Ophthalmology (ARVO) statement for the use of animals in ophthalmic and vision research.\n1. Tissue Preparation for Immunostaining\nEuthanize C57 BL/6J mice at embryonic day (E) 16, postnatal day (P) 0, P15 and P90 by carbon dioxide (CO2) followed by decapitation (E16 and P0 mice).\nImmediately enucleate mouse eyes punctured with 29G1/2 needle on the dorsal side of the eye. Incubate for 5 minutes (min) in 1 mL of 4% paraformaldehyde (PFA) in phosphate-buffered saline (1x PBS) pH 8.0 at room temperature.\nTo make eye cups from P0, P15 and P90, dissect out cornea and lens with fine ophthalmic scissors while eyes are in the 4% PFA.\n\tNOTE: Skip this step for E16 eyes as the eyes are too small.\nFix the eye cups (P0, P15 and P90) and the whole eyes (E16) in 4% PFA for 20 min at room temperature. Then wash the eye cups and whole eyes twice in 1 mL of 1x PBS for 10 min at room temperature.\nCryoprotect the eye cups and whole eyes in 1xPBS, pH 8.0 containing 10% sucrose for 1 hour. Keep in 20% sucrose in 1x PBS for 1 hour and then saturate in 30% sucrose in 1x PBS overnight at 4 °C.\nThe next day, embed the eye cups and the whole eyes in optimal cutting temperature compound (OCT), (500 µL) in cryomolds, snap-freeze in a dry ice/ethanol bath, and store at -80 °C.\nRemove the molds with embedded eye cups and whole eyes from -80 °C and allow to equilibrate to -20 °C for 1 hour before cryosectioning.",
    "Cut retinal cross sections (12 µm thick) parallel to the temporonasal axis through the optic nerve head using a cryostat at -20 °C.\nMount retinal sections on microscope slides53 and store at -80 °C.\n2. Immunostaining with 5-mC and 5-hmC Antibodies\nEncircle the retinal sections mounted on slides with a hydrophobic barrier pen. The hydrophobic barrier pen reduces the volume of antibody required to stain the tissue.\nWash the retinal sections once with 200 µL of 1x PBS for 10 min.\nPermeabilize the retinal sections with 200 µL of 0.1% Triton X-100 in 1x PBS (PBS-T) for 10 min at room temperature.\nDenature retinal sections for 30 min with 200 µL of freshly made 2 N hydrochloric (HCl) acid in 1x PBS in a 37 °C incubator.\n\tNOTE: Careful titration of HCl treatment is needed to optimize the 5mC signal.\nAlways include biological replicates (3-4) while optimizing 5mC signal54.\n\tNOTE: We did antigen retrieval at 4 time points (15 min, 30 min, 1 h and 2 h) and found 30 min incubation is optimal for 5mC signal. Longer incubation with HCl degrades the structure of nuclei leading to inability to localize 5mC signal to the nucleus.\nAfter denaturation, neutralize retinal sections by adding 100 µL of 0.1 M Tris-HCl (pH 8.3) on retinal sections for 10 min.\nIncubate the sections in 500 µL of blocking solution (5% preimmune normal goat serum in 0.1% Triton X-100 in 1x PBS) for 1 h at room temperature in a humidity chamber.\nAfter blocking, add anti-5mC; anti-5hmC antibodies diluted 1:500 in blocking solution to the retinal sections.\nIncubate retinal sections overnight at 4 °C in humidity chamber.",
    "The next day wash, retinal sections 3 times (10-15 min each time) with 0.1% PBS-T and then incubate in blocking solution with the corresponding secondary antibodies (Goat Anti-Rabbit and Goat Anti-Mouse IgG, diluted; 1:1000), containing DAPI ( 4', 6-diamidino-2-phenylindole) solution (1 µg/mL) at room temperature for 1 h in blocking solution.\n\tNOTE: Avoid drying of sections during all stages of immunodetection.\nWash the slides three time with 1 mL of 0.1% PBS-T.\nAfter the last wash, mount the sections with aqueous mounting medium under a coverslip and seal with colorless nail polish.\n3. Confocal Immunohistochemistry\nOrient the sections to have the retinal pigment epithelium side of the optic cup always facing one way (e.g., up), for consistency.\nPerform image capture of immunostained retinal sections at 63X (magnification of an objective lens) with 2X or 3X zoom.\nGenerate multiple optical sections of each selected image (z-stacks) in all 3 channels (Red, Green and Blue, RGB) using 0.35 µm step.\n\tNOTE: The final magnification of a specimen visualized at 10-20X (magnification of an objective lens) will be 63X, respectively, when combined with a (typically used) 10X ocular lens.\n\tVisualize compressed optical stack to locate the 5mC and 5hmC signal"
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}