{
  "id": 3991,
  "origin_website": "Cell",
  "title": "Rapid assessment of DCLK1 inhibitors using a peptide substrate mobility shift assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nRun a real-time reaction to establish DCLK1 activity\nTiming: 6 h\nPrepare buffers, assay chip and the EZ Reader instrument.\nAdd DTT to 1× Kinase Buffer to a final working concentration of 2 μM.\nRemove the chip from the container and place the chip in holder filled with ultrapure deionized water. Dump out the EDTA solution from the chip wells. Rinse with water 3 times and with Reaction Buffer 3 times.\nDry the top and bottom surfaces of the chip using vacuum suction. This step is very important. Leaving any water on the surfaces will result in equipment failure.\nMake 2× Peptide Mix in Reaction Buffer. 1× Peptide Mix: 1 μM of peptide 12 and 100 μM of ATP.\nMake 1× Trough Buffer. Dilute 0.5 mL of Peptide Mix with 0.5 mL of Reaction Buffer. Add 450 mL to each side of EZ Reader Trough.\nRefer to the EZ Reader user manual for additional details.\nPerform the reaction in 384-well plates in a total volume of 80 μL. The reaction comprises recombinant DCLK1, ATP and one FAM-labeled peptide substrate (peptide 12 for DCLK1) in Reaction Buffer.\nPrepare 2× DCLK1 solution. Typically, the highest final enzyme concentration will be 10 nM, therefore 2× is 20 nM. Make 400 μL of 2× Reaction Buffer with DCLK1 enzyme included. Use this to create 1:1 dilutions in 40 μL volumes. A typical dilution experiment will involve 6 total concentrations (A1-A6) with duplicates (E1-E6).\nPrepare the instrument to receive the plate. Select wells, set voltages and pressure, and choose a number of cycles that gives a one-hour time course.",
    "Add 40 μL of 2× peptide mix (peptide 12) to wells to initiate reaction. The final concentrations of DCLK1 are 10 nM, 5 nM, 2.5 nM, 1.25 nM, 0.625 nM and 0.3125 nM. Peptide 12 (substrate) is 1 μM and ATP is 200 μM.\nPlot the results to determine a DCLK1 concentration that converts 30% of substrate to product in 1 h. Other time points could be used, but 1 h is generally convenient. Also, the reaction rate should be linear (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/709-Fig1.jpg\nFigure 1. Concentration-dependent conversion rates of DCLK1\nCritical: Establishing an acceptable DCLK1 concentration is crucial to subsequent steps. Repeat this step multiple times to confirm it is reproducible in your personal workflow. You may need to titrate the ATP concentration to confirm you are working at the Michaelis constant, denoted by Km, for ATP. To determine the Km, we performed a dose response experiment starting at 150 μM and diluting 1:2. Km, the substrate concentration that gives the half maximal velocity, is calculated using GraphPad Prism (Motulsky, 2016[href=https://www.wicell.org#bib6]). We chose concentration of DCLK1 that gave ∼30% conversion at 1 h from step 3. Run the kinetics reaction and determine the Km for ATP. Also note that for screening we work in small volumes to conserve sample. This involves addition of 20 μL of peptide mix to 20 μL of reaction buffer. Because of this small volume, it is best to keep time courses relatively short to avoid changes in the assay volume due to evaporation. For DCLK1, we use a 1-h kinase-substrate reaction. The stability of enzyme at room temperature should also be considered. Adjust the reaction velocity and reaction time based on protein stability.\nRun a one-time reaction to measure IC50 of DCLK1 inhibitors\nTiming: 3 h",
    "Setup the DCLK1-DCLK1 substrate reaction with potential DCLK1 inhibitors in 384 plates.\nSet up the reaction plates.\nOur typical plate layout provides for an 8-point dose curve from 432 nM to 0.25 nM. (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/709-Fig2.jpg\nFigure 2. Layout of the reaction plate\nThe reaction is based on 8-point dose response design in triplicate. The positive control is a known DCLK1 inhibitor at a concentration that completely inhibits DCLK1 activity. The negative control is no enzyme. 14 inhibitors per plate can be tested in this format.\nPrepare 2× Enzyme (DCLK1) Mix. Use the DCLK1 concentration that can convert 30% of substrate to product in one hour as described above. Make 2× DCLK1 in Reaction Buffer. For example, if the reaction concentration is 5 nM, the 2× Enzyme Mix contains 10 nM of DCLK1 in Reaction Buffer.\nAdd 20 μL of 2× Enzyme Mix to appropriate wells on screening plate. The “no enzyme” control will contain only Reaction Buffer.\nAdd Inhibitors, positive controls and negative controls. To determine the IC50 of inhibitors, do an inhibitor dose titration. Figure 2[href=https://www.wicell.org#fig2] gives an example of 8-point dose response in triplicate using a 384-well plate to test 14 inhibitors. The positive control and DMSO control use only one concentration instead of a dose range (Figure 2[href=https://www.wicell.org#fig2]).\nAllow to reach room temperature.\nPrepare 2× Peptide Mix.\nMake 2× Peptide Mix. 1× Peptide Mix: Peptide 12 (DCLK1) at 1 μM; ATP at 100 μM\nStock solution: Peptide 12 at 3.0 mM; ATP at 100 mM\nStart the enzyme-substrate reaction.\nAfter 1 h incubation from step 1, add 20 μL of 2× Peptide Mix into each well and start the enzyme-substrate reaction.\nQuench the reaction with 40 μL of 1× Separation Buffer that includes 40 mM EDTA.",
    "Pause Point: Quenched reactions can theoretically be stored at 4°C, but we found this occasionally degraded the peptide fluorescence signal.\nSetup the post-run analysis.\nChoose the 100% inhibition column, which is the positive control column from Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/709-Fig3.jpg\nFigure 3. Post-run analysis setup\nChoose the 0% inhibition column, which is the DMSO column from Figure 3[href=https://www.wicell.org#fig3]."
  ],
  "subjectAreas": [
    "High Throughput Screening",
    "Molecular/Chemical Probes",
    "Protein Biochemistry",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}