{
  "id": 8571,
  "origin_website": "Jove",
  "title": "In Vivo Intracerebral Stereotaxic Injections for Optogenetic Stimulation of Long-Range Inputs in Mouse Brain Slices",
  "procedures": [
    "All procedures were performed in accordance with the European Community Council Directive (2010/63/EU) and approved by the ethics committee of Paris Descartes University. The experimenter must obtain authorization for the procedure to comply with local regulations.\n1. Planning of the experiment\nDefine the brain area to be targeted. Determine the stereotaxic coordinates of the injection site with the help of a mouse brain atlas15. For the right antero-dorsal thalamic nucleus (ADN), the coordinates are: -0.82 posterior, 0.75 lateral, -3.2 depth (mm) relative to bregma. Coordinates may need to be adjusted for animals of different age, sex, or strain.\nConfirm and document the exactitude of the coordinates by injecting a fluorescent tracer (150 to 300 nL) observable with an epifluorescence microscope in a pilot experiment (Figure 1A,B).\nDefine the type of virus to be injected. Store the virus in 6 µL aliquots at -80 °C as recommended by the producer. Bring 1 aliquot placed on ice to the surgery room, for injection of one to six animals on a given day. Biosafety regulations for the use of AAV may depend on the country or institution, and the use of a PSM 2 hood may be required.\n\tNOTE: Here, we use a AAV2/5 serotype expressing Chronos, a fast channelrhodospin-2 variant, fused to green fluorescent protein under the control of the Synapsin promoter: AAV5.Syn.Chronos-GFP.WPRE.bGH.\n2. Stereotaxic surgery\nInstall a stereotaxic frame equipped with a pump holder on a stable standard laboratory bench. Adjust stereoscope so as to clearly see the zone where the animal’s head will be placed. Use a LED light source for illumination. Rotate the stereoscope away to access the pump holder, which is not needed for the first steps of the surgery.",
    "Install a 10 µL Hamilton syringe equipped with a 33 G beveled metal needle in the pump holder. Test the ejection system with water.\nAnesthetize a 4- to 5-week old C57BL6 mouse with an intraperitoneal injection of a mix of ketamine hydrochloride and xylazine (100 mg/kg and 10 mg/kg, respectively). Prepare a mix of 1 mL of ketamine and 0.5 mL of xylazine in 8.5 mL of 0.9% NaCl. This will result in 10 mg/mL ketamine and 1 mg/mL xylazine in the mix. Of this mix, inject intraperitoneally 10 µL per gram of the animal’s body weight. Duration of anesthesia is about 1 h.\nVerify that the animal is well-anesthetized with a toe pinch. Then, pull out the tongue to facilitate breathing. Shave the cranial hair.\nInject 20 µL of lidocaine hydrochloride (4 mg/mL; 2 mg/kg) under the skin of the head for local anesthesia and wait 5 min for the effect to begin. To avoid eye damage due to dryness, cover the eyes with topical ophthalmic ointment.\nTo expose the skull, create a straight cut in the scalp with small surgery scissors. Place the animal in a stereotaxic frame, inserting the ear bars slightly rostral to the actual ear to rest on the bone and pull down the skin, which should create good access to the skull. Tighten into place. Install the nose piece.\nMaintain the body of the animal horizontally at the level of the head using a height-adjusted support. Place a heating pad under the mouse to keep it at physiological temperature.\nClean the skull by applying 0.9% NaCl with a cotton swab to remove soft tissue from the bone. Use the stereoscope for the rest of the surgery.",
    "Adjust the skull so that the bregma-lambda axis is level, moving up or down the nose and teeth piece. This necessitates iterative measures of bregma and lamba, as both will change following adjustment of the nose level.\nFind the location of the injection site on the skull. Adjust the injection needle above the injection site according to posterior and medial coordinates and mark the skull with a disposable needle. Move the injection needle upward by 4 cm.\nUse a 0.5 mm burr with a drill to realize a 1 mm diameter craniotomy on the mark, at one-half of maximum speed. Swab eventual bleeding with a paper tissue.\nEmpty the water contained in the Hamilton syringe for storage by completely ejecting it with the pump. Only the needle will still be filled with water. The needle is washed between each use with pure deionized water. Sterilization is not required.\nTake the aliquot of virus that is to be used for this day. Make sure that the viral solution is not frozen anymore but has remained cooled (close to 0 °C, on ice). Only briefly remove from the ice to obtain 700 nL with a micropipette for small volumes. Deposit the drop on a 5 cm x 5 cm piece of paraffin film. Avoid creating bubbles. Put the remaining viral solution back on ice.\n\tNOTE: The drop volume should be greater than the desired injection volume (700 nL for 200 nL injected). This will give a safety margin in case some of the liquid is lost during the transfer and allows performing a small test ejection (step 2.16) before proceeding.\nPlace the paraffin film on top of the craniotomy. Plunge the needle in the drop of viral solution without changing the antero-posterior and lateral position.",
    "Use the \"withdraw\" function of the pump to fill the syringe with about 500 nL of viral solution disposed on the paraffin film.  Do this under visual control (stereoscope), watch the drop disappear, and make sure not to aspirate air.\nMake sure the syringe has been filled correctly. Verify the functioning of the ejection system by driving down the plunger to test eject a small drop of liquid of 50 nL under visual control. Wipe the drop.\nInsert the needle into the brain to the chosen depth, by turning the knob controlling the dorso-ventral axis of the stereotaxic apparatus clockwise. Push the \"run\" button (speed 15 nL/min per volume of 150 nL injected). A small volume (50-300 nL, depending on the virus used) is slowly ejected over 10 min with an automatic pump.\nWait 10 min after the injection to avoid leaking from the injection site. Then, slowly remove the needle over 3-5 min by turning the knob controlling the dorso-ventral axis counterclockwise.  \nRotate the vertical part of the stereotaxic frame with the syringe away from the animal. Immediately wash the needle in clean distilled water by filling-emptying it several times, in order to avoid clogging. Store the syringe filled with water.\nRemove the mouse from the stereotaxic frame. Suture the skin with 4-0 polyamide suture filament. Make three or four stiches, tied with 2-1-1 standard surgical knots.\nPlace the mouse in a heated cage until it completely wakes up from anesthesia, and provide water and soaked food in a Petri dish placed on the ground. If the heat source is below the cage, use a spacer grid to avoid overheating.  \n\tNOTE: According to local guidelines, a single dose of ketoprofen (2-5 mg/kg, subcutaneously) or buprenorphine (0.05-0.1 mg/kg, subcutaneously) may be applied to prevent pain.",
    "When the animal is fully awake, return it to its home cage and monitor its well-being, particularly on the day following injection. Check for signs of pain. If any behavioral modification is observed, the animal is weighed to monitor its body weight.\nDepending on the virus used, the time for full expression may vary. Here, we allow 3 weeks for expression of AAV5.Syn.Chronos-GFP.\n3. Solutions for acute slice recordings and fixation\nPrepare stock solutions of 10x concentrated cutting solution (125 mM NaCl, 25 mM sucrose, 2.5 mM KCl, 25 mM NaHCO3, 1.25 mM NaH2PO4, and 2.5 mM D-glucose) and artificial cerebrospinal fluid (ACSF) solution (124 mM NaCl, 2.5 mM KCl, 26 mM NaHCO3, 1 mM NaH2PO4, and 11 mM D-glucose) in pure deionized water prior to electrophysiology experiments. Store these solutions at 4 °C in 1 L bottles without CaCl2 and MgCl2.\nOn the day of the experiment, dilute the stock solutions of cutting solution and ACSF 10x to a final volume of 0.5 L each. Agitate with a magnetic stirrer and oxygenize by bubbling with 95%/5% O2/CO2. Add divalent ions to obtain final concentrations of 0.1 mM CaCl2 and 7 mM MgCl2 for the cutting solution, and 2 mM CaCl2 and 2 mM MgCl2 for ACSF.\nPrepare the potassium-gluconate based pipette solution to contain: 135 mM K-gluconate, 1.2 mM KCl, 10 mM HEPES, 0.2 mM EGTA, 2 mM MgCl2, 4 mM MgATP, 0.4 mM Tris-GTP, 10 mM Na2-phosphocreatine, and 2.7–7.1 mM biocytin for post-hoc cell morphology revelation. Adjust the solution’s pH to 7.3 and osmolarity to 290 mOsm. Store 1 mL aliquots at -20 °C.\nPrepare 0.1 M PBS by diluting BupH PBS dry-blend powder pouches in 500 mL of distilled water, resulting in 0.1 M sodium phosphate, 0.15 M NaCl, pH 7.2.",
    "To prepare 1 L of 4% PFA solution, dilute 111 mL of 36% liquid PFA and 90 mL of 10x PBS solution in distilled water.\nPrepare 30% sucrose solution containing 150 g of sucrose in 500 mL of 0.1 M PBS.\n4. Preparation of brain slices\nPrepare the bench space with absorbent bench paper before perfusion.\nInstall a drip about 1 m above the bench for gravity-fed perfusion. Attach a 24 G butterfly needle.\nSurround the cutting chamber of the vibratome with ice and store it in a freezer.\nAnesthetize the mouse with intraperitoneal injection of the same ketamine-xylazine mixture used for surgery. Assess the stage of the anesthesia by pinching the toe with forceps. When fully asleep, inject 100 µL of heparin (5000 U.I./mL) intraperitoneally.\nFix the animal with adhesive tape on the absorbent paper, lying on its back. Open the thoracic cage by cutting the ribs on the left and right sides with small scissors, from the diaphragm upwards. Maintain the thoracic cage open with the help of adhesive tape.\nClamp the descending aorta with a hemostat and perfuse via the left ventricle of the heart with 4 °C cooled and oxygenated (95%/5% O2/CO2), cutting the solution through the 24 G butterfly needle. After 5 s, open the right atrium with small scissors.\nAfter 5 min of perfusion, when the organs are bloodless, stop the perfusion. Decapitate the animal with big scissors and immerge the head into 4 °C cooled and oxygenated cutting solution in a Petri dish.\nTo extract the brain, cut the skin from neck to nose, then section the last vertebrae from the skull with scissors. Manually retract the skin and use small scissors to open the skull, cutting it along the midline, from caudal to rostral, upward to between the eyes.",
    "Carefully remove the parietal bone and caudal part of frontal bone with curved or bone forceps. Extract the brain with a small rounded spatula by inserting the instrument between the brain and the cranial floor, sectioning the olfactory bulb, optic nerve and other cranial nerves, and cerebellum.\nGently submerge the brain in ice-cold cutting solution (4 °C) in a beaker. Position the brain on filter paper to gently dry the cortical surface. Glue the brain cortex-down to the specimen holder of a vibratome, with the caudal side facing the blade, in order to cut horizontal brain slices.\nFill the cutting chamber with ice-cold oxygenated cutting solution so the brain is fully immerged. Make a cut on the left hemisphere (contralateral to the injected side) to avoid potential left-right ambiguity on slices.\n\tCAUTION: Always oxygenate the solution and protect slices from light exposure.\nCut 300 µm thick slices with the vibratome, at a speed of 0.07 mm/s at 1 mm amplitude. At this stage, it is recommended to briefly check the Chronos-GFP expression in the thalamus using a fluorescent flashlight (440-460 nm) and corresponding filter glasses (500 nm long pass).\nIsolate the hippocampal region with a scalpel and transfer it to a chamber positioned in a beaker filled with bath-warmed (34 °C), oxygenated (95%/5% O2/CO2) ACSF.\nAfter 15 min, take the chamber out of the heated water bath and let the slices rest at room temperature, still oxygenated for at least 45 min until use.\n5. Whole-cell patch-clamp recording",
    "Gently transfer a brain slice containing the hippocampal complex with a custom-made glass transfer pipette to the recording chamber mounted on an upright microscope. A transfer pipette is made of a shortened Pasteur pipette (inner diameter 6.5 mm) attached to a rubber pipette bulb. Continuously perfuse the recording chamber (3 mL) with 34 °C (warmed) ACSF bubbled with 95%/5% O2/CO2. Set the speed of the peristaltic pump to 2-3 mL/min.\nBriefly examine Chronos-GFP expression in axon terminals in the region of interest with blue LED illumination (470 nm) and observe with a 4x objective. GFP fluorescence is visualized through an appropriate emission filter, with a CCD camera image displayed on a computer screen.\nPlace a slice anchor made from a U-shaped platinum wire with tightly spaced nylon strings (\"harp\") on the slice to maintain it.\nChange to a 63x immersion objective and adjust the focus. Check for axons expressing Chronos-GFP and choose a pyramidal neuron for patch recording.\nMove the objective upward.\nPull pipettes using a Brown-Flaming electrode puller from borosilicate glass. The puller is set to produce pipettes with approximately 1 μm in tip diameter. Fill the pipettes with K-gluconate-based internal solution.\nMount the pipette in the pipette holder on the head-stage. Lower the pipette in the chamber and find the tip under the objective. Pipette resistance should be between 3–8 MΩ. Apply a light positive pressure with a syringe so as to see a cone of solution outflow out of the pipette and progressively lower the pipette and objective to the surface of the slice.",
    "Patch the cell in voltage-clamp configuration: approach the identified neuron and delicately press the pipette tip onto the soma. The positive pressure should produce a dimple on the membrane surface. Release the pressure to create a giga-ohm seal (>1 GΩ resistance). Once sealed, set the holding voltage to -65 mV. Break the membrane with a sharp pulse of negative pressure: this is achieved by applying strong suction to a tube connected to the pipette holder.\nRecord in whole-cell current clamp mode the responses of the neuron to hyperpolarizing and depolarizing current steps (Figure 2A).\n\tNOTE: This protocol will be used to determine active and passive intrinsic properties of the cell. Custom-written MATLAB routines are used for off-line analysis10,16.\nRecord in current- or voltage-clamp postsynaptic responses to whole-field 475 nm LED stimulation of afferent fibers expressing Chronos. Stimulate with trains of 10 stimulations of 2 ms durations at 20 Hz (Figure 2B,C). Light intensity may vary from 0.1–2 mW.\n\tNOTE: Light intensity was measured with a digital handheld optical power console equipped with a photodiode sensor, positioned under the objective. Response latencies of 2–4 ms are characteristic for a monosynaptic connection.\nTo investigate the nature of the synaptic transmission between the long-range afferents and the recorded neuron, different pharmacological agents may be used. To pharmacologically distinguish direct, monosynaptic responses from indirect responses via network activation, add 1 µM TTX and 100 µM 4-AP to the ACSF.",
    "NOTE: Bath application of glutamate receptor blockers allows to determine the nature of the neurotransmitter that is released and the identity of postsynaptic receptors. For example, AMPA type glutamate receptors will be blocked by NBQX (10 µM) and NMDA receptors by APV (100 µM). Depending on the aim of the study, protocols may be conceived to investigate voltage dependence of synaptic responses or response dynamics over time.\nWash with original ACSF solution to patch another cell, or transfer the slice containing a biocytin-filled neuron in a small vial filled with 4% PFA.\nAfter overnight fixation in 4% PFA, wash the slice in 0.1 M PBS (2x for 5 min, 1x for 20 min).\nStore in 30% sucrose at 4 °C.\n6. Biocytin revelation\nTransfer the fixed slices containing biocytin-filled neurons onto a glass blade in a drop of 30% sucrose and perform three cycles of freezing-thawing: place the blade onto dry ice disposed in a styrofoam box for 1 min until drops of sucrose are completely frozen, then press the blade against the hand palm to thaw.\nWash the slice 3x in 0.1 M PBS (2x for 5 min, 1x for 1 h and 50 min), gently agitated. Do not exceed 2 h for the last washing.\nPre-incubate the slice at RT for 2 h in agitated buffer solution containing 2% milk powder (0.4 g in 20 mL) to saturate non-specific sites and 0.5% Triton X100 (0.1 mL in 20 mL) to permeabilize the membranes in 0.1 M PBS.\nIncubate overnight at 4 °C in a solution containing 2% milk powder, 1% Triton X100, streptavidin-Cy5 conjugate (1/500), and DAPI (1/1000) in 0.1 M PBS, gently agitated.",
    "Wash the slice three times in 0.1 M PBS (2x for 5 min, 1x for 2 h). The last wash can last longer, up to 4 h, to reduce background staining.\nBefore mounting the slice, use an epifluorescence microscope at 10x magnification configured to observe Cy5 fluorescent markers in order to identify the side of the slice containing the marked cell in a chamber filled with PBS.\nTransfer the slice onto a blade, cell-side up, dry it with a paper tissue, and mount it using high-resistance mounting medium.\nUse an epifluorescence microscope at 10x magnification in Cy5 and DAPI configuration to examine the cell body location, and in GFP configuration to observe the marked afferents, or a high-resolution confocal microscope at 20x for detailed somatic, axonal, and dendritic morphology (Figure 2D,E). Filter settings are detailed in the Table of Materials.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}