{
  "id": 5795,
  "origin_website": "Bio",
  "title": "Generation of <em>Caenorhabditis elegans</em> Transgenic Animals by DNA Microinjection",
  "procedures": [
    "Preparing the DNA and the injection unitFollow the instructions of the QIAGEN-tip 20 miniprep kit for DNA purification (see Notes).At the final step, elute the DNA in distilled H2O and determine the concentration with a spectrophotometer.Prepare a mix of 50 ng/µl of the DNA of interest and the co-transformation marker each (see Table 1) in a 100 µl volume.Centrifuge the solution in a microcentrifuge at maximum speed for 15 min, preferably at 4 °C. This step is necessary to precipitate floating particles in the DNA solution to prevent clogging of the microinjection capillary.Pipette 5 µl from top of the DNA solution to a new reaction tube and directly use it for microinjection. Any left-over can be frozen at -20 °C for later use.A few minutes prior to the injection procedure, switch on the microscope for microinjection, the microinjector unit and the micromanipulator (overview in Figure 2). Follow the instructions of the microinjector unit to pressurize and adjust the system. Set the ‘inject’ function to release a volume of approx. 10 picoliter (pl).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170921/20170921000510_5809.jpgFigure 2. Basic components of a setup for C. elegans microinjection. A. Overview over the setup and all its components: (a) light microscope with a 10x and a 40x objective and DIC optics, (b) microinjector unit for pressure appliance, (c1) micromanipulator control for all three dimensions (x, y, z axis) with fine and coarse control, (c2) micromanipulator-controlled capillary (needle) holder, (d) gliding table to flexibly move immobilized animals into the needle, (e) stereomicroscope for mounting the animals on agarose pads and recovery after injection, (f) optionally a monitor, connected to a camera for recording and demonstration purposes, (g) glass capillary (injection needle). B. Detailed view on the gliding table (d), the needle holder (c2) and the needle (g) attached. C.",
    "Close-up on the injection needle (Femtotips II, Eppendorf), which can be filled by microloader pipette tips.Use the microloader pipette tips to pipette 1 µl of the clean DNA solution into a microinjection capillary (see Notes). This volume is enough to inject more than a hundred animals. Carefully remove the cover of the capillary and screw it into the needle holder of the micromanipulator. The capillary force will collect the solution in the tip of the needle.Preparing the animals for injectionOne day prior to the injection procedure, use a stereoscope and a wormpick to transfer 40 L4 stage animals from a mixed population to freshly OP50-seeded NGM agar plates (see Recipes).Grow the animals at 20 °C overnight into young gravid adults with a fully developed germline (Figure 1A).One hour prior to the injection procedure shift the animals to 15 °C. This reduces the agility of animals, making them easier to handle for the injection.Place a drop of about 50 µl halocarbon oil on a 2% agarose pad (see Recipes) next to the agarose area. Under the stereoscope, transfer 10-20 worms into the oil (dipping the worm pick into the oil makes it easier to transfer the worms). Let the animals move in the oil for 5-10 min to remove bacteria that are attached to their cuticle as bacterial remnants can quickly clog the microinjection capillary.Place another small drop of about 20 µl halocarbon oil on the surface of the agar pad.Use the hairpin pick (see Recipes) to transfer one animal from the halocarbon oil next to the agarose into the drop on the surface of the agarose pad. Use the maximum magnification of the stereoscope to gently press the animal to the agarose surface with the hairpin pick. The animals will attach to the dry agarose surface (Figure 3).",
    "Place the agarose pad on the gliding table of the microscope for microinjection and swiftly commence with the injection procedure, as the animals will desiccate within approx. 10-15 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170921/20170921000633_0104.jpgFigure 3. An animal immobilized on a 2% agarose pad and ready for injection. The arrows indicate the preferred sites for injection in the gonad. Scale bar is 50 µm.Injection procedureUse the 10x objective to localize the immobilized animal in the halocarbon oil drop on the agarose pad.Use the micromanipulator in ‘coarse’ mode to move the tip of the injection capillary along the x-y axis in close proximity of the worm and then use the ‘fine’ mode of the micromanipulator z-axis control to roughly bring the tip of the needle in focus (Video 1).Adjust the position of the worm to a 20-40° angle relative to the needle by turning the gliding table (Figure 1A). The steep angle is necessary to prevent injuries in the cuticle.Switch to the 40x objective and focus on the cytoplasmic core of the distal germline of the animal. Then bring the tip of the needle close and in focus by using the micromanipulator in ‘fine’ mode.Move the animal by gently tapping the gliding table towards the tip of the needle. We move the animal into the needle, not the other way around, as this is easier and more precisely to handle. The needle tip has to be placed inside the cytoplasmic core of the distal gonad (Figures 1A and 1B).Press the ‘Inject’ button on the Microinjector unit to release a specified volume of DNA solution into the gonad. The liquid will slightly blow up the gonad (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. The injection procedure.",
    "The video shows (1) The localization of the needle and test release of injection mix, (2) Localization of the target animal and placing it into position for injection by rotating the gliding table, (3) Adjusting the needle position to target the gonad, (4) Switching to the 40x objective and centralize the position of the needle, (5) Focusing on the syncytium of the distal gonad, (6) Moving the animal into the needle and injecting the injection mix, as well as three more examples for the procedure. Gently move the gliding table in the opposite direction to remove the needle from the animal.Use the micromanipulator to move the needle up along the z-axis but leave it in the same x-y position for the next rounds of injection. Remove the agarose pad from the gliding table.Under the stereoscope, pipette a drop of 10 µl M9 buffer (see Recipes) on the injected animal to remove it from the agarose pad. Let the animal recover for 2 min in the M9 buffer before transferring it with a hairpin pick to an OP50 seeded NGM agar plate.Repeat the injection procedure with a new animal (go to step B5). Inject 20-25 animals in total. With increasing experience and injection speed, several animals can be immobilized on the agarose pad and injected sequentially. In that case, align the animals close to each other under the stereoscope. Upon successfully injecting the first animal move the injection needle out of focus up along the z-axis, move the gliding table to focus on the next animal (switching to the 10x objective might be required) and repeat the injection procedure.Selecting transgenic animals and maintaining stabile transgenic linesAfter the injection procedure grow the animals for 3-5 days at 20 °C.",
    "During that time, monitor the F1 progeny for the distinct phenotypic features caused by the expression of the co-transformation marker (see Table 1). This might require observation under a fluorescent stereomicroscope to detect expression of fluorescent proteins. The injection efficiency can broadly vary between 1-10% and more.Single out transgenic F1 progeny as soon as they reach the L4 or adult stage by picking them each to a new OP50 seeded NGM plates with a wormpick. Keep maintaining them at 20 °C and monitor the F2 generation for the transgenic phenotype. Approx. 5-10% of the transgenic F1 animals will stably inherit the extrachromosomal array in a non-Mendelian fashion. Hence, it is recommended to monitor at least 30-50 F1 transgenics for stabile inheritance.Stably inheriting transgenic lines have to be maintained by picking 10-30 transgenic animals to fresh OP50 seeded NGM plates every 3-5 days. The transmission efficiency across generations can vary as much as 5-80%. Maintain at least three independent stable lines for phenotypic analysis when over-expressing or ectopically expressing genes or dsRNA constructs. For CRISPR/Cas9 side-directed mutagenesis other maintenance and selection criteria will apply, which are summarized elsewhere (Dickinson and Goldstein, 2016)."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}