{
  "id": 19791,
  "origin_website": "Wiley",
  "title": "Small Interfering RNA Delivery Into Primary Human Natural Killer Cells for Functional Gene Analyses",
  "procedures": [
    "This protocol provides instructions for the enrichment of CD3– CD14– CD19– CD56+ NK cells from human PBMCs by negative selection through magnetic labeling and depletion of non-NK cell populations. Alternatively, NK cells or specific NK cell subsets can be purified by other ways such as fluorescence-activated cell sorting (FACS).\nMaterials\nHuman PBMCs (e.g., obtained by density gradient centrifugation and used directly [see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0004]] or cryopreserved and thawed [see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0005]])\nTrypan blue solution (e.g., Gibco, cat. no. 15250061)\nMACS buffer (see recipe)\nNK Cell Isolation Kit, human (e.g., Miltenyi Biotec, cat. no. 130-092-657) containing:\n               \nNK Cell Biotin-Antibody Cocktail\nNK Cell MicroBead Cocktail\nPhosphate-buffered saline (PBS), pH 7.4 (e.g., Gibco, cat. no. 10010023)\nHemocytometer\n15-ml conical tubes (e.g., Corning, cat. no. 352096)\nCentrifuge\nQuadroMACS Separator (e.g., Miltenyi Biotec, cat. no. 130-090-976)\nMACS MultiStand (e.g., Miltenyi Biotec, cat. no. 130-042-303)\nLS columns (e.g., Miltenyi Biotec, cat. no. 130-042-401)\nInsulated ice container for wet ice (e.g., NeoLab cat. no. 2-4994)\nPrepare PBMCs\n1. Obtain human PBMCs by method of choice.\nHuman PBMCs can be obtained with various methods. A protocol for isolation of human PBMCs from leukocyte concentrates (“buffy coats”) is provided in Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0004]. Isolated PBMCs can be used directly or cryopreserved. A protocol for thawing and recovering human PBMCs after cryopreservation is provided in Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0005]. Alternatively, human PBMCs can be obtained by other methods of choice.\n2. Determine number of viable PBMCs by trypan blue exclusion in a hemocytometer.\nCorrectly determining cell counts is critical for negative selection procedures. Incorrect cell counts can result in overlabeling and decreased yield (NK cells retained on the column) or underlabeling and decreased purity (non-NK cells not retained on column).\n3. Transfer 50 × 106 viable PBMCs to a 15-ml conical tube.",
    "If working with other PBMC numbers, scale all volumes up or down accordingly.\n4. Centrifuge 10 min at 300 × g, 4°C.\n5. Remove supernatant completely, and resuspend cell pellet in 200 µl cold MACS buffer.\nLabel PBMCs\n6. Add 50 µl cold NK Cell Biotin-Antibody Cocktail and mix carefully.\n7. Incubate for 5 min at 4°C.\n8. Without centrifugation, add 150 µl cold MACS buffer and 100 µl cold NK Cell MicroBead Cocktail and mix carefully.\n9. Incubate for 10 min at 4°C.\n10. During incubation, prepare for magnetic enrichment:\n         \na.Place a QuadroMACS separator on the MACS MultiStand.\nb.Insert an LS column into the separator.\nc.Place a bucket with wet ice under the separator.\nd.Rinse column with 3 ml cold MACS buffer and discard flow-through.\ne.Prepare a new 15-ml conical tube for collection of the enriched NK cells by coating the walls of the tube with cold MACS buffer. Place coated tube below the column into the ice bucket.\nCoating the wall of the tube reduces cell loss. Add ∼2 ml cold MACS buffer to the conical tube, and rotate carefully until all areas are covered with liquid.\nDeplete non-NK cells\n11. At the end of the incubation period, transfer suspension of magnetically labeled PBMCs to the column.\nLoad a maximum of 100 × 106 PBMCs onto one LS column. If working with more cells, use several LS columns in parallel, and combine the obtained cells after enrichment.\n12. Let suspension run through the column by gravity without applying force, and collect flow-through, which contains the non-labeled NK cells.\nApplying force onto to the column may impair retention of labeled non-NK cells and decrease purity of the obtained NK cells.\n13. Rinse column with 3 ml cold MACS buffer.",
    "It is recommended to add the buffer stepwise, using 1 ml per step.\n14. After rinsing is completed, carefully remove 15-ml conical tube containing the flow-through, and centrifuge 10 min at 300 × g, 4°C.\n15. Remove supernatant and resuspend enriched NK cells in 1 ml warm PBS.\nNK cells in warm PBS are ready for immediate siRNA delivery (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0003]). If the NK cells are not to be used right away, it is recommended to resuspend the cells in medium of choice and to culture the cells at 37°C and 5% CO2 in a tissue culture incubator until use.\n16. Determine number of obtained viable NK cells by trypan blue exclusion in a hemocytometer.\nThe frequency of NK cells within PBMCs displays high donor variability and can range from 1% to 15% with a mean of about 6%. Thus, the number of enriched NK cells can range from 0.5–7.5 × 106 when starting with 50 × 106 PBMCs.\nIt is recommended to evaluate the purity of the obtained NK cells (Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0006]). A purity of 90% to 98% CD14– CD19– CD3– CD56+ NK cells should be routinely obtained.",
    "This protocol provides information for reconstituting lyophilized Accell siRNA. Successful reconstitution is critical for downstream applications. Reconstitution of siRNA can be performed immediately before siRNA treatment of enriched NK cells. Alternatively, reconstitution can be performed beforehand, and the reconstituted siRNA can be stored at –20°C until treatment of NK cells.\nMaterials\n5× siRNA buffer (e.g., Horizon Discovery, cat. no. B-002000-UB-100)\nRNase-free water (e.g., Horizon Discovery, cat. no. B-003000-WB-100)\nAccell siRNA of choice (e.g., Horizon Discovery)\nMicrocentrifuge\nLaboratory shaker\nSpectrophotometer\nRNase-free reaction tubes (e.g., Sarstedt, cat. no. 72.706.200)\nNOTE: This protocol assumes familiarity with standard molecular biology techniques and the availability of equipment for such procedures including a centrifuge and an orbital shaker suitable for 1.5-ml reaction tubes, RNase-free environment, and PCR-grade pipet tips.\n1. Bring 5× siRNA buffer and RNase-free water to room temperature.\n2. Dilute 5× siRNA buffer with RNase-free water to 1× siRNA buffer.\n3. Briefly centrifuge vial containing lyophilized siRNA at 14,000 × g, room temperature.\n4. Add 50 µl of 1× siRNA buffer to 5 nmol lyophilized siRNA to obtain a stock concentration of 100 µM.\nWhen working with other amounts of siRNA, adjust the volume accordingly. For example, add 200 µl of 1× siRNA buffer to 20 nmol siRNA.\n5. Mix by carefully pipetting up and down five times without introducing air bubbles into the solution.\n6. Incubate solution for 30 min at room temperature while shaking at 50 rpm.\nShaking ensures complete reconstitution. If a shaker is not available, gently flick the vial repeatedly during the incubation period.\n7. Briefly centrifuge vial containing the siRNA solution at 1000 × g, room temperature, to collect any drops that may have formed during reconstitution.\n8. Verify reconstitution by determining the concentration of siRNA in solution (e.g., using a spectrophotometer).",
    "Reconstitution can be quality controlled by standard UV-vis spectrophotometry or other appropriate methods. Stock solutions of 100 μM siRNA contain ∼1350 ng/μl RNA, but this concentration varies depending on the sequence and the molecular weight of the siRNA in question. Refer to the product transfer sheet for siRNA sequence and molecular weight. Moreover, absorption is strongly influenced if the siRNA is fluorescently labeled (e.g., FAM-labeled Accell Green Nontargeting Control siRNA; Horizon Discovery, cat. no. D-001950-01-20).\n9. Use reconstituted siRNA immediately for delivery into NK cells (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0003]), or aliquot into RNase-free reaction tubes to minimize freeze-thaw cycles, storing at −20°C until use.\nMinimizing freeze-thaw cycles is recommend, although Accell siRNA remains functional after up to five freeze-thaw cycles.",
    "This protocol details the delivery of Accell siRNA into enriched human NK cells. Uptake of Accell siRNA is a passive process and does not require electroporation, transfection reagents, or viral vectors. Serum-free Accell siRNA delivery medium strongly enhances siRNA uptake and, when supplemented with low doses of recombinant human IL-15 as a prosurvival factor, does not compromise the viability of human NK cells throughout the treatment period.\nMaterials\nPBS, pH 7.4 (e.g., Gibco, cat. no. 10010023)\nAccell siRNA delivery medium (e.g., Horizon Discovery, cat. no. B-005000-100)\n10,000 U/ml penicillin/10,000 μg/ml streptomycin (e.g., Gibco, cat. no. 15140122)\nRecombinant human IL-15, premium grade (e.g., Miltenyi Biotec, cat. no. 130-095-762)\nEnriched NK cells (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001])\n37°C water bath\n15-ml conical tubes (e.g., Corning, cat. no. 352096)\nCentrifuge\n96-well U-bottom tissue culture plates (e.g., Corning, cat. no. 353077)\n37°C tissue culture incubator, 5% CO2, 95% humidity\n1. Bring PBS and Accell siRNA delivery medium to 37°C using a water bath.\n2. Supplement warm Accell siRNA delivery medium with 100 U/ml penicillin, 100 μg/ml streptomycin, and 1 ng/ml recombinant human IL-15.\nThe addition of penicillin and streptomycin is optional. Because of the extended culture period, the addition of these antimicrobial agents is recommended to reduce the risk of contamination.\nThe optimal concentration of recombinant human IL-15 should be determined empirically for the desired application and may vary depending on the biological activity of IL-15. Concentrations ranging from 0.5 to 5 ng/ml have been tested, and it was found that 1 ng/ml optimally sustains NK cell viability over a culture period of up to 96 hr. Alternatively, other prosurvival factors such as recombinant human IL-2 may be considered to maintain viability during the siRNA treatment period.",
    "3. Transfer 1 × 106 enriched NK cells into a 15-ml conical tube, and add 5 ml warm PBS. Centrifuge 10 min at 300 × g, room temperature.\n4. Remove supernatant from the cell pellet completely.\nRemoving serum and excess protein present in the medium or MACS buffer from upstream procedures is important for efficient delivery of siRNA through passive uptake.\n5. Resuspend NK cells in 1 ml warm Accell siRNA delivery medium containing all desired supplements.\nA cell density of 1 × 106 cells/ml has proven optimal for delivery of siRNA and consistent recovery of NK cells after up to 96 hr of culture.\n6. Dispense 100 μl cell suspension (containing 1 × 105 NK cells) into the wells of a 96-well U-bottom plate.\nAll desired conditions including treatment with control nontargeting siRNA or additional wells required for downstream assays should be considered when determining the number of cells to be cultured.\n7. Add 1 μl Accell siRNA directly into the wells containing the cell suspension and mix.\nIf preferred, the appropriate volumes of Accell siRNA may be added directly to the NK cell suspension before dispensing rather than adding to individual wells. For example, 10 μl Accell siRNA can be added to 1 ml NK cell suspension, followed by mixing and dispending into a tissue culture plate. Because of loss of volume during dispensing, it is recommended to prepare 10% to 20% more cell suspension than will be required.\n8. Incubate plate in a tissue culture incubator at 37°C with 5% CO2 and 95% humidity for 48 to 96 hr.",
    "Culture time varies depending on the target gene and the intended downstream analysis. It is recommended that the time of siRNA treatment required for knockdown be determined separately for each gene of interest. We have generally observed efficient knockdown at the transcript level within 48 to 72 hr and at the protein level within 72 to 96 hr of siRNA treatment.",
    "This protocol describes the isolation of human PBMCs from leukocyte concentrates (“buffy coats”) through density gradient centrifugation. At step 13, the obtained PBMCs can be used directly for downstream applications (e.g., Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]). Alternatively, PBMCs can be cryopreserved for later use.\nPlease note that several other methods are available for isolation of PBMCs.\nMaterials\nBuffy coat (obtained from volunteer blood bank donors)\nPBS, pH 7.4 (e.g., Gibco, cat. no. 10010023)\nFicoll-Paque PLUS (e.g., Cytiva, cat. no. 17144002)\nTrypan blue solution (e.g., Gibco, cat. no. 15250061)\nCryostorage medium (see recipe)\n175-cm2 flask (e.g., Corning, cat. no. 431080)\n50-ml conical tube (e.g. Corning, cat. no. 352098)\nCentrifuge\nHemocytometer\nCryotubes (e.g., Sarstedt, cat. no. 72.377.002)\nAlcohol-resistant, low-temperature-stable marker or label maker\nAlcohol-free cell freezing container (e.g., Corning, cat. no. 432004)\nLiquid nitrogen storage container\nIsolate PBMCs\n1. Transfer entire buffy coat sample to a 175-cm2 flask.\nWe routinely work with buffy coat samples of ∼50 ml volume. When working with other volumes, scale up or down as necessary.\n2. Add PBS to the sample, and dilute to a final volume of 140 ml.\n3. Add 15 ml Ficoll-Paque PLUS to four 50-ml conical tubes.\n4. Carefully layer 35 ml diluted buffy coat sample onto the Ficoll-Paque PLUS in each tube.\nIt is critical to maintain layers of Ficoll-Paque and sample for successful separation. It is recommended to set the pipetting device to low pipetting speed to avoid agitation and mixing of Ficoll-Paque with the buffy coat sample. Handle carefully to not disturb the layers.\n5. Centrifuge 20 min at 800 × g, room temperature, with deceleration turned off.\nIt is critical to turn off brakes and deceleration of the centrifuge to avoid disruption of the formed layers by high deceleration forces",
    "6. Remove and discard the top 20 to 25 ml plasma layer.\n7. Carefully collect PBMC layer at the interface of the plasma layer and Ficoll-Paque, and transfer to a new 50-ml conical tube.\nIt is important to not aspirate the Ficoll-Paque PLUS layer, which contains granulocytes, since presence of granulocytes can lead to formation of clumps (e.g., due to rapid NETosis of neutrophils) and can considerably impair downstream applications such as magnetic enrichment of NK cells.\n8. Add PBS to a final volume of 50 ml, and centrifuge 10 min at 300 × g, room temperature.\n9. Remove supernatant.\n10. Resuspend cell pellet in 50 ml PBS, and centrifuge 15 min at 200 × g, room temperature.\nThis step effectively removes thrombocytes and improves samples quality.\n11. Remove supernatant.\n12. Resuspend cell pellet in 50 ml PBS.\n13. Determine number of viable PBMCs by trypan blue exclusion in a hemocytometer.\nThe number of obtained PBMCs is highly variable between individual donors. A range of 200–1000 × 106 cells has been obtained with this protocol.\nIsolated PBMCs can be used immediately for downstream procedures such as enrichment of NK cells (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]) or cryopreserved for later use (see steps 14 to 21).\nOptional: Cryopreserve PBMCs\n14. Prepare cryostorage medium.\n15. Prepare appropriate number of cryotubes, and label with an alcohol-resistant, low-temperature-stable marker or printed label.\nIt is recommended to cryopreserve PBMCs at densities ranging from 20–100 × 106 cells/ml and in a volume of 1 ml per cryotube.\nFor example, 500 × 106 PBMCs can be cryopreserved at 100 × 106 cells/ml in five tubes and at 20 × 106 cells/ml in 25 tubes. The number of PBMCs desired after thawing should be considered when deciding on cell density and number of cryopreserved aliquots",
    "16. Centrifuge PBMC suspension 10 min at 300 × g, room temperature.\n17. Remove supernatant completely.\nIt is critical to remove any remaining buffer from the cell pellet.\n18. Resuspend cell pellet in an appropriate volume of cryostorage medium and mix carefully.\nHomogenous cell suspensions in cryostorage medium during cryopreservation improves cell recovery after thawing.\n19. Dispense 1 ml cell suspension into the prepared cryotubes.\n20. Immediately transfer cryotubes to an alcohol-free cell freezing container, and place container at −80°C.\nAlcohol-free cell freezing containers provide cooling rates of −1°C/min because of their material composition and enable consistent and reproducible freezing of cells.\n21. After 3 to 16 hr, transfer cryovials to liquid nitrogen storage (less than −140°C) for long-term storage.\nWith a cooling rate of −1°C/min, a temperature of −80°C is routinely achieved within 3 hr. Extended storage (>3 days) of cryopreserved PBMCs at −80°C impairs cell viability and recovery and should be avoided.",
    "This protocol describes a procedure for thawing and recovering previously cryopreserved PBMCs. At the final step of the protocol, the obtained PBMCs can be used directly for downstream applications such as enrichment of NK cells (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]).\nMaterials\nCulture medium (see recipe)\n250 U/μl benzonase nuclease (e.g., Merck, cat. no. E1014-5KU)\nCryopreserved PBMCs (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0004])\nTrypan blue solution (e.g., Gibco, cat. no. 15250061)\n37°C water bath\n50-ml conical tube (e.g., Corning, cat. no. 352098)\nCentrifuge\n70-µm cell strainer (e.g., Corning, cat. no. 352350)\nHemocytometer\n6-well tissue culture plate (e.g., Corning, cat. no. 353046)\n37°C tissue culture incubator, 5% CO2, 95% humidity\nThaw PBMCs\n1. Prepare culture medium, and bring to 37°C using a water bath.\n2. For each sample, transfer 20 ml culture medium to a 50-ml conical tube.\nDimethyl sulfoxide (DMSO) present in the cryostorage medium is toxic to cells at high concentrations. It is recommended to use 20 ml culture medium per 1 ml cryostorage medium to achieve an initial dilution of 1:20.\n3. Add 2 μl benzonase nuclease to the culture medium.\nBenzonase is an endonuclease that efficiently degrades extracellular DNA and RNA. Addition of benzonase considerably reduces clumping and improves cell viability and recovery. Handle benzonase with care, and immediately return to storage at −20°C after addition to maintain enzymatic activity.\n4. Collect cryopreserved PBMC samples from liquid nitrogen storage.\n5. Immediately place sample into a 37°C water bath.\n6. Quickly thaw cells until only a small piece of ice remains visible.\nCompletely thawing the sample will result in impaired viability. Thawing is quick and usually takes <2 min. Do not vortex the sample.\n7. Transfer thawed cells dropwise to the tube with warm culture medium containing benzonase.\n8. Add 1 ml warm culture medium containing benzonase to the cryovial.",
    "9. Pipet up and down once to thaw remaining ice, and transfer thawed cells to the tube with culture medium containing benzonase.\n10. Centrifuge 10 min at 300 × g, room temperature.\nThe centrifugation serves as an incubation period for nuclease activity and is simultaneously used to remove DMSO.\n11. Remove supernatant.\n12. Resuspend cell pellet in 20 ml warm culture medium without benzonase, and strain cell suspension through a 70-µm cell strainer.\n13. Centrifuge 10 min at 300 × g, room temperature.\n14. Remove supernatant.\n15. Resuspend cell pellet in 20 ml warm culture medium.\nRecover thawed PBMCs\n16. Determine number of viable PBMCs by trypan blue exclusion in a hemocytometer.\nAt this stage, a recovery of 80% to 90% of the cell number that wase initially cryopreserved is expected. The viability of the freshly thawed cells can vary considerably and ranges between 60% and 90%.\n17. Adjust cell density to 5 × 106 cells/ml, and dispense 5 ml to wells of a 6-well tissue culture plate.\n18. Incubate plate in a tissue culture incubator at 37°C with 5% CO2 and 95% humidity for 2 to 18 hr.\nThe incubation serves as resting phase for the thawed PBMCs.\n19. After incubation, gather cells from plate, and transfer to a 50-ml conical tube.\n20. Determine number of viable PBMCs by trypan blue exclusion in a hemocytometer.\nAfter the resting period, a recovery of 60% to 70% of the cell number that was initially cryopreserved is expected. The rested PBMCs are expected to display high and consistent viability of 85% to 95%. The cells are now recovered from cryopreservation and can be used for downstream applications such as enrichment of NK cells (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]).",
    "This protocol describes a flow cytometric evaluation of viable CD14– CD19– CD3– CD56+ NK cells following magnetic enrichment (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]) to determine the purity of the obtained population.\nMaterials\nViability dye (e.g., LIVE/DEAD Fixable Aqua Dead Cell Stain Kit; Invitrogen, cat. no. L34957)\nFluorochrome-conjugated antibodies:\n               \nV500-conjguated anti-human CD14, clone M5E2 (e.g., BD Biosciences, cat. no. 561391; RRID AB_10611856)\nBV570-conjugated anti-human CD19, clone HIB19 (e.g., BioLegend, cat. no. 302236; RRID AB_2563606)\nPE-Cy5-conjguated anti-human CD3, clone UCHT1 (e.g., Beckman Coulter, cat. no. A07749; RRID AB_2827419)\nBUV737-conjugated anti-human CD56, clone NCAM16.2 (e.g., BD Biosciences, cat. no. 612767; RRID AB_2860005)\nPBS (e.g., Gibco, cat. no. 10-010-23)\nEnriched NK cells (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001])\nFixation buffer (e.g., Cytofix; BD Biosciences, cat. no. 554655)\nFACS buffer (see recipe)\n96-well conical microwell plate with lid (e.g., Nunc, cat. nos. 249570 and 263339, respectively)\nCentrifuge\nFlow cytometer and analysis software\nCAUTION: When working with fixatives that contain paraformaldehyde, proper safety precautions and waste handling steps must be followed.\n1. Prepare staining solution containing viability dye and fluorochrome-conjugated antibodies at optimal dilutions in PBS.\nThe manufacturers provide a recommended dilution for each antibody. However, additional titration is required to define the optimal working concentration for each reagent. The following dilutions have been identified as optimal in our laboratory: fixable viability dye, 1:100; anti-human CD14-V500, 1:50; anti-human CD19-BV570, 1:50; anti-human CD3-PE-Cy5, 1:100; and anti-human CD56-BUV737, 1:200.\nFor each sample, 50 μl solution is required. To account for volume loss during pipetting, it is recommended to prepare 10% to 20% excess solution.\n2. Transfer 1–5 × 105 enriched NK cells to a 96-well conical microwell plate with lid.",
    "Enriched NK cells are expected to contain low frequencies of CD14+, CD19+, and CD3+ cells because these cells are depleted during the enrichment procedure. It is recommended to use a PBMC sample without enriching for NK cells as a control to determine the detection of otherwise depleted cell types, especially when establishing the flow cytometric analysis.\n3. Add PBS to each well to a final volume of 200 μl.\n4. Centrifuge 5 min at 300 × g, room temperature.\n5. Remove supernatant.\n6. Add 50 μl staining solution to the cell pellet.\n7. Mix well and incubate for 20 min at room temperature in the dark.\n8. Wash cells twice in PBS:\n         \nFor the first wash, add 150 μl PBS to the wells. Centrifuge 5 min at 300 × g, room temperature, and remove supernatant.\nFor the second wash, resuspend cell pellet in 200 μl PBS. Centrifuge 5 min at 300 × g, room temperature, and remove supernatant.\n9. Resuspend cell pellet in 100 μl fixation buffer.\n10. Incubate for 15 min at 4°C in the dark.\n11. Wash cells twice in FACS buffer:\n         \nFor the first wash, add 150 μl FACS buffer to the wells. Centrifuge 5 min at 500 × g, room temperature, and remove supernatant.\nFor the second wash, resuspend cell pellet in 200 μl FACS buffer. Centrifuge 5 min at 500 × g, room temperature, and remove supernatant.\n12. Resuspend cell pellet in 100 μl FACS buffer.\n13. Analyze sample by flow cytometry.\nThe fixed sample is ready for immediate analysis using a flow cytometer of choice. Alternatively, the fixed sample can be stored at 4°C in the dark for up to 24 hr until analysis.\n14. Use analysis software to evaluate the purity of viable CD14– CD19– CD3– CD56+ NK cells within single-lymphocyte events.",
    "A representative example of NK cell purity is shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-fig-0001].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/2af3292a-705b-4ea1-8105-21bba7000642/cpz1613-fig-0001-m.jpg</p>\nFigure 1\nPurity of NK cells after magnetic enrichment. Representative purity evaluation of enriched NK cells after magnetic labeling and depletion of non-NK cell populations according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]. Enriched NK cells were stained for surface markers, and the frequency of single viable CD14– CD19– CD3– CD56+ events was analyzed by flow cytometry according to Support Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0006]. FSC, forward scatter; FSC-A, FSC area; FSC-H, FSC height; NK, natural killer; SSC, side scatter; SSC-A, SSC area; SSC-H, SSC height.",
    "This protocol details a procedure to assess the knockdown efficiency of primary human NK cells treated with different siRNA reagents that target transcripts of the B2M gene. For assessment of knockdown efficiency, β2m protein expression at the cell surface is analyzed by flow cytometry. In parallel, cell surface expression of human leukocyte antigen (HLA) class I protein, which is stabilized in the presence of β2m, is also determined on the siRNA-treated cells. Various other methods are available to assess knockdown efficiency, both at transcript level (e.g., reverse-transcription quantitative PCR) or protein level (e.g., immunoblot). Choosing an appropriate method for determining knockdown efficiency will be highly dependent on the nature of the gene of interest and the study design.\nIn this example, human PBMCs were isolated from buffy coats and cryopreserved (Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0004]), thawed and recovered (Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0005]), enriched for NK cells (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001]), and treated with siRNA (Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0003]).\nTreatment with siRNA was performed with the following conditions:\n         \n(1) control nontargeting siRNA (siRNA with minimal targeting of human genes to determine baseline responses to treatment);\n(2) B2M siRNA SMARTpool (pool of four siRNA sequences [nos. 13, 14, 15, and 16] that target the B2M gene);\n(3) B2M siRNA individual sequence 13;\n(4) B2M siRNA individual sequence 14;\n(5) B2M siRNA individual sequence 15; and\n(6) B2M siRNA individual sequence 16.\nMaterials\nViability dye (e.g., LIVE/DEAD Fixable Aqua Dead Cell Stain Kit; Invitrogen, cat. no. L34957)\nFluorochrome-conjugated antibodies:\n               \nPE-Cy5-conjguated anti-human CD3, clone UCHT1 (e.g., Beckman Coulter, cat. no. A07749; RRID AB_2827419)\nBUV737-conjugated anti-human CD56, clone NCAM16.2 (e.g., BD Biosciences, cat. no. 612767; RRID AB_2860005)\nAPC-conjugated isotype control, clone MOPC-21 (e.g., BioLegend, cat no. 400119; RRID AB_2888687)\nFITC-conjugated isotype control, clone MOPC-21 (e.g., BioLegend, cat. no. 400107; RRID AB_326429)",
    "APC-conjugated anti-human β2m, clone 2M2 (e.g., BioLegend, cat. no. 316312; RRID AB_10641281)\nFITC-conjugated anti-human HLA class I, clone W6/32 (e.g., BioLegend, cat. no. 311404; RRID AB_314873)\nPBS (e.g., Gibco, cat. no. 10-010-23)\nNK cells treated with the following siRNA (see Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0003]):\n               \nNontargeting control siRNA (e.g., Horizon Discovery, cat. no. D-001910-10-05)\nB2M siRNA SMARTpool (mix of four siRNA sequences; e.g., Horizon Discovery, cat. no. E-004366-00-0005)\nB2M siRNA individual 13 (e.g., Horizon Discovery, cat. no. A-004366-13-0005)\nB2M siRNA individual 14 (e.g., Horizon Discovery, cat. no. A-004366-14-0005)\nB2M siRNA individual 15 (e.g., Horizon Discovery, cat. no. A-004366-15-0005)\nB2M siRNA individual 16 (e.g., Horizon Discovery, cat. no. A-004366-16-0005)\nFixation buffer (e.g., Cytofix; BD Biosciences, cat. no. 554655)\nFACS buffer (see recipe)\n96-well conical microwell plate plus lid (e.g., Nunc, cat. nos. 249570 and 263339, respectively)\nCentrifuge\nFlow cytometer and analysis software\nCAUTION: When working with fixatives that contain paraformaldehyde, proper safety precautions and waste handling steps must be followed.\n1. Prepare staining solutions containing viability dye and fluorochrome-conjugated antibodies at optimal dilutions in PBS:\n         \na.Prepare a staining solution containing viability dye, anti-human CD3-PE-Cy5, anti-human CD56-BUV737, isotype control-APC, and isotype control-FITC.\nb.Prepare a staining solution containing viability dye, anti-human CD3-PE-Cy5, anti-human CD56-BUV737, anti-human β2m-APC, and anti-human HLA class I-FITC.\nIsotype controls indicate the unspecific fluorescence signal and thus serve as important controls for determining baseline signals in the evaluation of knockdown efficiency.\nThe manufacturers provide a recommended dilution for each antibody. However, additional titration is required to define the optimal working concentration for each reagent. The following dilutions have been identified as optimal in our laboratory: fixable viability dye, 1:100; anti-human CD3-PE-Cy5, 1:100; anti-human CD56-BUV737, 1:200; anti-human β2m-APC, 1:200; and anti-human HLA class I-FITC, 1:200.",
    "For each sample, 50 μl solution is required. To account for volume loss during pipetting, it is recommended to prepare 10% to 20% excess solution.\n2. Transfer 1 × 105 siRNA-treated NK cells to a 96-well conical microwell plate with lid.\nStaining with solutions containing isotype control antibodies to determine baseline signals should be considered when determining the number of conditions required.\n3. Add PBS to each well to a final volume of 200 μl.\n4. Centrifuge 5 min at 300 × g, room temperature.\n5. Remove supernatant.\n6. Add 50 μl staining solutions to the appropriate cell pellets.\n7. Mix well and incubate for 20 min at room temperature in the dark.\n8. Wash cells twice in PBS:\n         \nFor the first wash, add 150 μl PBS to the wells. Centrifuge 5 min at 300 × g, room temperature, and remove supernatant.\nFor the second wash, resuspend cell pellet in 200 μl PBS. Centrifuge 5 min at 300 × g, room temperature, and remove supernatant.\n9. Resuspend cell pellet in 100 μl fixation buffer.\n10. Incubate for 15 min at 4°C in the dark.\n11. Wash cells twice in FACS buffer:\n         \nFor the first wash, add 150 μl FACS buffer to the wells. Centrifuge 5 min at 500 × g, room temperature, and remove supernatant.\nFor the second wash, resuspend cell pellet in 200 μl FACS buffer. Centrifuge 5 min at 500 × g, room temperature, and remove supernatant.\n12. Resuspend cell pellet in 100 μl FACS buffer.\n13. Analyze sample by flow cytometry.\nThe fixed sample is ready for immediate analysis using a flow cytometer of choice. Alternatively, the fixed sample can be stored at 4°C in the dark for up to 24 hr until analysis.",
    "14. Use analysis software to evaluate the expression of β2m and HLA class I protein on viable CD3– CD56+ NK cells.\nA representative example of the expression levels upon treatment with different siRNA reagents is displayed in Figure 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-fig-0002]. Figure 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-fig-0002]-Figure 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-fig-0002] contains summaries of six individual donors analyzed in two independent experiments to highlight expected variation.\nDepending on the gene of interest studied, it may be valuable to evaluate the frequency of protein-expressing cells or the level of protein expression per cell as mean fluorescence intensity (i.e., Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-fig-0002] and 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-fig-0002]).\nIf desired, the knockdown efficiency can be reported as fold-change, percent knockdown, or percent remaining expression.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/887b9921-18c2-41b7-9bd3-fe8082068337/cpz1613-fig-0002-m.jpg</p>\nFigure 2",
    "Assessment of knockdown efficiency. Enriched NK cells were treated with either nontargeting control siRNA, with a pool of siRNA containing four sequences targeting B2M (B2M siRNA pool), or with individual siRNA sequences targeting different regions of B2M (B2M siRNA nos. 13, 14, 15, and 16) according to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0001], Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0002], and Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0003]. After treatment for 96 hr, NK cells were stained for surface expression of β2m and HLA class I protein or with isotype control antibodies to determine baseline signals and analyzed by flow cytometry according to Support Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.613#cpz1613-prot-0007]. (A) Representative β2m and HLA class I protein expression gated on viable CD3– CD56+ NK cells. Numbers indicate frequency and MFI. (B) Summary of β2m protein expression. Left: Frequency of β2m-expressing cells within viable CD3– CD56+ NK cells. Right: MFI of β2m expression levels of viable CD3– CD56+ NK cells. Bars indicate mean, and dots represent individual donors (n = 6 in two independent experiments). (C) Summary of HLA class I protein expression. Left: Frequency of HLA class I–expressing cells within viable CD3– CD56+ NK cells. Right: MFI of HLA class I expression levels of viable CD3– CD56+ NK cells. Bars indicate mean, and dots represent individual donors (n = 6 in two independent experiments). HLA, human leukocyte antigen; MFI, mean fluorescence intensity; NK, natural killer; siRNA, small interfering RNA."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}