{
  "id": 1822,
  "origin_website": "Cell",
  "title": "Cryo-EM analysis of Ebola virus nucleocapsid-like assembly",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPurification of recombinant Ebola nucleoprotein\nThis protocol is optimized for preparation of Ebola virus nucleoprotein (eNP) constructs, among which eNP-2 (residue 25–457) formed nucleocapsid-like assembly for cryo-EM study (Su et al., 2018[href=https://www.wicell.org#bib18]).\nTiming: 2 days\nCritical: Protein purification is conducted at 4°C to reduce protein degradation. Addition of protease inhibitors (1 μg/L leupeptin, 1 μg/L antipain, 1 μg/L benzamidine, 0.5 μg/L pepstatin) to buffers will also help to limit protein degradation.\nLyse cells using an EmulsiFlex-C5 homogenizer (Avestin).\nCentrifuge lysates at 30,000×g at 4°C for 40 min. Gently transfer the supernatant to a clean container.\nNote: Before proceeding to the next step, filter the supernatant with a 1.2 μm filter to avoid clogging the column.\nPurify eNP-2 using a series of affinity and ion exchange chromatographic columns.\nLoad the supernatant on a 15 mL Ni6FF column (Cytiva) equilibrated in lysis buffer. Wash the column with 3 column volumes of lysis buffer and then elute the bound protein with 3 column volumes of elution buffer.\nTake the eluted sample and load onto a 15 mL amylose column (NEB). Wash the column with 3 column volumes of wash buffer and then elute the bound protein with 3 column volumes of amylose column elution buffer .\nApply eluted protein to a 8 mL Source15Q ion exchange column (Cytiva). Wash column with 3 column volumes of Source15Q ion exchange column wash buffer. Elute protein with a linear gradient of NaCl up to 1 M in 5 column volumes.",
    "The maltose-binding protein and six consecutive histidine residues (MBP-His6) tag is cleaved with TEV protease to obtain the target protein with three tag-derived residues (GHM) at the N-terminus. Add TEV enzyme and target protein at a ratio of 1:100 (protein concentration is approximately determined by A280 absorbance), and digest for 12–16 h at 25°C.\nDilute the digested protein sample with wash buffer to conductivity of approximately 8 mS/cm, load the sample onto a Source15Q ion exchange column to separate undigested protein, MBP-His6 tag, and Tev from the cleaved protein. Elute protein with a linear gradient of NaCl up to 1 M in 5 column volumes.\nNote: Additional steps onto an amylose affinity column and/or Ni column can be used here to further eliminate any remnants of fusion protein or MBP-His6 tag.\nConcentrate eNP-2 protein and load onto a 120 mL 10/300 SD200 gel filtration column (Cytiva) for final purification with 1 column volume of storage buffer.\neNP-2 protein elutes in two peaks. Peak 1 that elutes earlier (∼52 mL) usually contains eNP-2 protein oligomers, assembly, or aggregates whereas peak 2 contains monomeric eNP-2. Peak 1 is collected and concentrated using a 30 kDa ultrafiltration centrifuge tube (Millpore Amicon® Ultra) to a final concentration of 10 mg/mL as determined by NanoDrop One (Thermo Fisher Scientific).\nFinally, the purity of eNP-2 assembly is determined to be about >95% by a Coomassie blue stained SDS-PAGE gel, and the purified eNP-2 assembly is promptly used for negative stain and cryo-EM studies. The sample can be stored at 4°C for no more than a week. It is not recommended to freeze the sample for storage as freeze and thaw may disrupt protein assembly.\nNegative stain\nTiming: 0.5–1 h\nThis step describes observation of eNP-2 assembly under negative stain at room temperature (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1301-Fig1.jpg",
    "Figure 1. Schematic diagram of the sample preparation process\n(A) Negative stain sample preparation, scale bar 100 nm.\n(B) Cryo-EM sample preparation, scale bars 500 Å.\nApply 2 μL of eNP-2 sample at 1 mg/mL in PBS to a glow-discharged (40 s) copper grid coated with continuous carbon film (Ted Pella) and wait for 1 min.\nBlot the grid from the side with a piece of filter paper for 5–10 s.\nApply 4 μL PBS to the grid and repeat step 10.\nStain with 2% uranyl acetate (UA). Prepare three droplets of roughly 20, 20, and 60 μL UA on a piece of parafilm. Touch the grid to first two 20 μL UA droplets sequentially for 3 s and repeat step 10 in between. Then wash the grid in the 60 μL UA droplet for 30 s, repeat step 10 and airdry the grid before loading into the microscope.\nNote: You may speed up the air-dry procedure by gently swinging the grid in air.\nAlternatives: Other staining reagent such as uranyl formate (UF) can be used as alternatives in negative stain.\nCritical: UA (and UF) is radioactive and toxic, safety precautions should be taken to reduce inhalation and contamination by using the fume hood (for aqueous solution preparation), wearing the appropriate PPE, and ensuring proper disposal procedure for radioactive waste.\nLoad the negative stained grid from step 12 into the room temperature side-entry holder of JEOL JEM-1400plus Transmission Electron Microscope operating at 80 kV and recorded with an AMT XR111 high-speed 4k × 2k pixel phosphor-scintillated 12-bit CCD camera at 30,000× magnification (corresponding to a pixel size of 4 Å).\nCryo-EM sample preparation\nTiming: 1–1.5 h",
    "This step describes standard cryo-EM sample preparation procedure using Mark IV Vitrobot (Figure 1[href=https://www.wicell.org#fig1]B). Before starting, liquid ethane is prepared using a designed foam container with liquid nitrogen surrounded as coolant, a spider-like metal piece that conducts heat, and a blue button ready for grid storage (Figure 2[href=https://www.wicell.org#fig2]A). Quantifoil R 1.2/1.3 Cu grids (200 mesh) are glow discharged for 40 s (Figure 2[href=https://www.wicell.org#fig2]B). Mark IV Vitrobot is set to 4°C and 100% humidity in the chamber, one blot for 3 s, no wait time, no drain time, zero offset. These parameters can be adjusted based on the resulting ice thickness and distribution (e.g., blot time and offset can be increased when ice is too thick; glow discharged time can be increased when ice distribution is not even).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1301-Fig2.jpg\nFigure 2. Cryo-EM sample preparation in practice\n(A) Liquid nitrogen cools down ethane in the middle metal container using a spider-like piece for heat conduction in a designed foam container. The blue button is for grid storage.\n(B) The grids are glow discharged.\n(C) The grid is loaded on the tweezer and lifted into the MarkIV vitrobot chamber, the liquid ethane container is lifted to the bottom of the chamber.\n(D) Load the sample from one side of the chamber onto the grid, blot the grid with filter papers.\n(E) Plunge the grid into liquid ethane and transfer to the blue grid button for storage.",
    "Critical: Ethane gas is flammable and explosive at room temperature, safety precautions should be taken to ensure complete closure of the ethane pressure gas tank everytime after usage. Ethane’s melting point is higher than nitrogen, which will lead to solidification of ethane under liquid nitrogen temperature. Formation of white solid in liquid ethane container is a sign for reaching ethane’s melting point and ready for vitrification. One should avoid accumulating too much ethane solid that will bend the grid during plunge freezing.\nNote: When too much ethane solid is observed, one can use a room temperature spider-like metal piece up-side down to warm up and remove excess ethane solid.\nGlow discharged grid is loaded on the tweezer into the chamber, liquid ethane container is raised to the bottom of the chamber (Figure 2[href=https://www.wicell.org#fig2]C).\nApply 2 μL of eNP-2 assembly sample to the grid from the side of the chamber (Figure 2[href=https://www.wicell.org#fig2]D).\nThe grid is blotted for 3 s and plunged into liquid ethane (Figure 2[href=https://www.wicell.org#fig2]E).\nThe liquid ethane container is lowered. Now transfer the grid to the button for storage until future use.\nNote: Detailed cryo-EM sample preparation procedure with videos was previously described (Meyerson et al., 2011[href=https://www.wicell.org#bib10]). Other resources can also be found online.\nPause point: Frozen grids can be stored in liquid nitrogen for years before loading onto the microscope.\nCryo-EM data acquisition\nTiming: 8 days\nThis step describes manual cryo-EM single particle data acquisition for eNP-2 assembly, which is necessary due to scarcity of helical tubes found under the microscope.",
    "Note: For samples that appear to be more concentrated, automated data acquisition may be used with latest data acquisition software (e.g. EPU2, Tomo4, SerialEM, etc.), which may significantly reduce the timing estimated for data collection, whereas percentage of high quality images may decrease so further selection is required in the later data processing steps.\nPause point: Depending on the microscope schedule, data acquisition can be paused at any time and the grid can be recovered for future use.\nLoad frozen grids into JEM3200FSC (JEOL) operated at 300 kV with 70 μm condenser lens aperture, 60 μm objective lens aperture, spot size 1, and with 30 eV in-column energy filter.\nSet search mode magnification 3,000× for eNP-2 helical tube visualization (Figure 3[href=https://www.wicell.org#fig3]A), and imaging mode magnification to 30,000× (corresponding to a calibrated sampling of 1.2 Å per pixel) for data acquisition (Figure 3[href=https://www.wicell.org#fig3]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1301-Fig3.jpg\nFigure 3. Cryo-EM sample preparation condition screening\n(A) eNP-2 helical tube visualization at low magnifications (blue box), scale bars 500 nm and 100 nm.\n(B) Representative cryo-EM micrograph that shows side views of long helical tubes and top views of short helical tubes or rings (yellow box), scale bar 100 nm.\n(C) Thin ice disrupts a helical tube (red box), scale bar 100 nm.\n(D) Thick ice allows additional flexibility of a helical tube (green box), scale bar 100 nm.\nNote: Imaging parameters change with different microscopes, the parameters in this protocol are practical determined for JEM3200FSC, whereas different parameters may be used for other microscopes. Only regions with proper ice thickness are selected for data acquisition. Thin ice results in disruption of eNP-2 assembly (Figure 3[href=https://www.wicell.org#fig3]C), whereas thick ice allows additional flexibility of the eNP-2 assembly (Figure 3[href=https://www.wicell.org#fig3]D). See troubleshooting[href=https://www.wicell.org#troubleshooting] for suggestions on how to optimize ice thickness in sample freezing and screening.",
    "Micrographs are recorded with a K2 Summit direct electron device (Gatan) operating in super resolution mode at a recording rate of 5 raw frames per second and exposure rate of 3 e-/Å2 per second. The total exposure time is 8 s, yielding 40 frames per movie stack and a total dose of 24 e-/Å2.\nDefocus values are set to -1.0 to -2.0 μm and a total of 1,266 images are collected manually in two sessions.\nHelical reconstruction\nTiming: 4 days\nThis step describes data processing and helical reconstruction of the cryo-EM micrographs for eNP-2 assembly. In general, cryo-EM data processing requires CPU and GPU computing resources (e.g., workstation, cluster). The timing given in this step is estimated based on a workstation with 40 CPU cores and 8 GPUs. Using more computing resource decreases the amount of time in this step.\nNote: The timing specified here is typical for helical reconstruction with known helical parameters. Additional days to weeks may be needed if the helical parameters need to be determined from scratch.\nPause point: This process can be paused at any time.\nImport the raw movie frames into Relion 2.1 (He and Scheres, 2017[href=https://www.wicell.org#bib3]; Scheres, 2012[href=https://www.wicell.org#bib16]).\nNote: This protocol is carried out in Relion 2.1, in which the helical reconstruction suite is first introduced. Minor changes have since been made in later versions such as Relion 3 and Relion 4.\nMicrographs are motion corrected using Motioncorr v2.1 (Li et al., 2013[href=https://www.wicell.org#bib7]) with default parameters except that “Number of patches X, Y” is set to “5, 5” and “Iter” is set to 10 (15 min).",
    "Contrast transfer function (CTF) is estimated using CTFFIND4 (Rohou and Grigorieff, 2015[href=https://www.wicell.org#bib15]) with the corresponding microscope parameters and other default parameters except that “Amount of astigmatism” is set to 1000 (8 min), 1,113 micrographs with visible thon rings at better than 6 Å resolution are selected (2 min).\nHelical tubes in the selected micrographs are manually selected using e2helixboxer.py in EMAN2.12 (Tang et al., 2007[href=https://www.wicell.org#bib19]) with “helix-width” set to 400. The output txt files that contain start and end point coordinates of each helical tube are imported in Relion 2.1 (2–3 h).\nA total of 200,691 segments is extracted in Relion 2.1 with “Particle box size” set to 528, “Re-scaled size” set to 132, “Tube diameter” set to 500, “Number of asymmetrical units (ASUs)” set to 5, “Helical rise” set to 2.65, and other parameters remain default. This corresponds to 1,003,455 ASUs (10 min).\nTwo-dimensional (2D) class averaging is performed with “Number of classes” set to 200, “mask diameter” set to 600, “Limit resolution E-step” set to 10, “Tube diameter” set to 500, and other parameters remain default (12 h). Good 2D class averages and corresponding particles are selected (3 min).\nNote: Here we also included some top-viewed ring-like particles in 2D class averages to provide additional information to guide helical parameter determination as described in step 29 (Figure 3[href=https://www.wicell.org#fig3]B bottom right).\nNote: The initial 2D class averages did not yield distinguished protein features (Figure 4[href=https://www.wicell.org#fig4]A). We used e2proc2d.py in EMAN2 to clip 192 pixels along the tube axis in the middle of the particles. The orientation alignment of the clipped particles focus on the central region that result in 2D class averages with improved protein features (Figure 4[href=https://www.wicell.org#fig4]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1301-Fig4.jpg\nFigure 4. 2D class averages of eNP-2 helical tube segments\n(A) Initial 2D class averages showed no high-resolution features.",
    "(B) 2D class averages of masked particles showed improved high-resolution features.\nPrepare initial model in e2initialmodel.py in EMAN2 with default parameters using selected 2D class average images as input (10 min).\nNote: Alternatively, an existing cryo-EM helical reconstruction map with similar diameter low-pass filtered to 60 Å, or simply a cylindrical density with the same diameter generated in EMAN2 and other software can be used as initial models.\nDetermine helical parameters (3 days)\nFourier transform of a few segments (normally < 100) can be coherently summed to generate a layer line image (Figure 5[href=https://www.wicell.org#fig5]A) (5 min).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1301-Fig5.jpg\nFigure 5. Determination of helical parameters\n(A) Layer line indexing of eNP-2 helical tube, whereas l is the layer line number, n is order of the layer line, blue dashed lines form the reciprocal lattice.\n(B) Using the selection rule l=tn+um with input of l and n will yield the results of the number of ASUs (u) in the number of helical turns (t).\n(C) Refinement of helical parameters using six different ASU per turn numbers. The red arrow points to the spike-like defects on inner side of the tube. The yellow arrow points to the spike-like defects on outer side of the tube.\nThe layer line indexing result can be generated by selection rule and used as initial guess for helical parameter refinement. In this eNP-2 assembly case, we estimated there were approximately 40 ASUs per helical turn based on 2D averaging result of the assembly top views (Figure 3[href=https://www.wicell.org#fig3]B, bottom right), which was used as input for the selection rule (Stewart, 1988[href=https://www.wicell.org#bib17]) and resulted in -8.96° in twist, corresponding to 40.2 ASUs per helical turn (Figure 5[href=https://www.wicell.org#fig5]B). (10 min).",
    "A subset of 20,000 segments is used for helical parameter refinement in EMAN (Ludtke et al., 1999[href=https://www.wicell.org#bib8]) integrated with iterative helical real space reconstruction (IHRSR) (Egelman, 2007[href=https://www.wicell.org#bib2]). We performed three-dimensional (3D) auto-refinement using six different helical parameters as initial input, which correspond to 39.2, 40.2, 41.2, 42.2, 43.2 and 44.2 ASUs per turn. Helical reconstruction of 42.2 ASUs per helical turn reveals best high-resolution features in 2D projection along Z-axis, whereas 2D projections of 3D reconstructions using other helical parameters show spike-like defects on inner side of the tube (39.2 and 40.2 ASUs per turn), on outer side of the tube (43.2 and 44.2 ASUs per turn), or less high-resolution features (41.2 ASUs per turn) (Figure 5[href=https://www.wicell.org#fig5]C). The final refined helical parameters are 2.65 Å in rise and -8.53° in twist (see also troubleshooting[href=https://www.wicell.org#troubleshooting] for alternates) (2–3 days).\nSelected particles from 2D class averages are subjected to 3D auto-refinement in Relion 2.1 with “Mask diameter” set to 600, “Initial angular sampling” set to 1.8, “Local searches from auto-sampling” set to 0.9, “Tube diameter-inner, outer” set to 250, 500, “Number of asymmetrical units” set to 5, “Initial twist, rise” set to -8.53, 2.65, “Twist search-min, max, step” set to -8.74, -8.33, 0.004, “Rise search-min, max, step” set to 2.59, 2.71, 0.001 and other parameters remain default (3–4 days).\nThe auto-refinement result is subjected to postprocess in Relion 2.1 using the default parameters except that the “inimask_threshold” is set to 0.008 (5 min).\nSegmentation and modeling\nTiming: 1 days\nThe reconstructed density of the helical tube was segmented using the Segger plugin in UCSF Chimera (Pettersen et al., 2004[href=https://www.wicell.org#bib12]; Pintilie et al., 2010[href=https://www.wicell.org#bib14], 2016[href=https://www.wicell.org#bib13]).\nSmoothing and grouping (5 steps, step size 1) was applied to get an approximate segmentation of each eNP-2 molecule (Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1301-Fig6.jpg",
    "Figure 6. Segmentation and modeling steps\n(A) Cryo-EM reconstruction at 5.8 Å.\n(B) Segger segmentation result.\n(C) Extracted segmentation for one protein monomer in the asymmetric unit of two monomers.\n(D) Existing monomeric protein model.\n(E) Fitting of the model to the segments of one protein monomer.\n(F) Fitting of the model to the cryo-EM density of one protein monomer.\n(G) Extraction of additional segments based on the model.\n(H) Fitting of the model to the newly extracted cryo-EM density of one protein monomer.\n(I) Extraction of additional segments based on the model of the other protein monomer in the asymmetric unit.\n(J) Fitting of the model to the cryo-EM density of the other protein monomer in the asymmetric unit.\nThe crystal structures of several eNP-2 (PDB: 4YPI) were then rigidly fitted by alignment to segments corresponding to individual eNP-2 (Figures 6[href=https://www.wicell.org#fig6]C–6E) (Kirchdoerfer et al., 2015[href=https://www.wicell.org#bib5]).\nSecondary structure elements in the fitted model matched those visible in the density, indicating correct fits (Figure 6[href=https://www.wicell.org#fig6]F).\nFlexible fitting and modeling\nTiming: 1 days\nFirst, the rigidly fitted crystal structure was flexibly fitted to the corresponding extracted density of each eNP-2 in one ASUs using MDFF (Trabuco et al., 2009[href=https://www.wicell.org#bib20]); this moves helices a21 and a22 and the b-hairpin motif into the density. MDFF was run 10 times starting with the crystal model, which produces 10 slightly different results (Figures 6[href=https://www.wicell.org#fig6]G and 6H).\nThe resulting 10 structures were then put into ProMod to create an average model and to calculate uncertainty in residue positions (Peitsch, 1996[href=https://www.wicell.org#bib11]).",
    "For one of the eNP-2, the loop and helix a23 were then added based on the segments and density nearby (Figure 6[href=https://www.wicell.org#fig6]I). The entire sequence of the protein was obtained by BLAST with the sequence of the modeled residues. This entire sequence contained unmodeled residues at the C terminal end. The sequence was input into secondary structure prediction method PSIPRED (McGuffin et al., 2000[href=https://www.wicell.org#bib9]). A helix was predicted in the unmodeled region, consisting of 19 residues, separated from the modeled helix a22 by a loop of 8 residues. The residues predicted to form a helix were modeled into the tubular density using Build Structure in Chimera.\nThe loop connecting a22 and the new a23 was then also modeled within Chimera.\nThe resulting model was flexibly fitted 10 times to the density using MDFF; Promod was then applied to the 10 resulting models to estimate the average model and uncertainties at each residue position (Figure 6[href=https://www.wicell.org#fig6]J)."
  ],
  "subjectAreas": [
    "Cryo-Em",
    "Structural Biology",
    "Microbiology",
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}