{
  "id": 7286,
  "origin_website": "Bio",
  "title": "Antisense Oligo Pulldown of Circular RNA for Downstream Analysis",
  "procedures": [
    "Oligo designObtain the mature sequence of the circRNA of interest from the RNA sequencing data or the UCSC genome browser using the genome coordinates of backsplice sites. Here, we retrieved the sequence of mouse circHipk2 (chr6|38818229|38819313|-) from the mouse mm10 UCSC genome browser (Figure 1).Note: The mature splice sequence of multiexonic circRNA can be obtained by combining all the exon sequences between the genomic coordinates of the backsplice site. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4088/bioprotoc-11-14-4088-g001.jpgFigure 1. Design of the divergent primers and biotin-labeled antisense oligo targeting circHipk2As shown in Figure 1, join the last 15 nucleotides of the circRNA sequence to the upstream of the first 15 nucleotides to obtain the 30-nucleotide sequence spanning the circRNA backsplice junction.To design ASO, generate the reverse complement sequence of the 30-nucleotide junction sequence using GeneRunner. Have this sequence synthesized with biotin-TEG added to the 3’ end by the preferred vendor.Design primers for the target housekeeping gene mRNAs or rRNAs using the Primer 3 web tool.Design the divergent primer for the target circRNA as described previously (Panda and Gorospe, 2018) or using the circinteractome website for human circRNAs (Dudekula et al., 2016).Cell lysisTake one 100-mm dish of ~70% confluent βTC6 cells and discard the culture media.Note: A minimum of 5 million cells should be used for the pulldown assay. A higher amount of cells may help to obtain better pulldown of rare or low copy number circRNAs. Wash the cells three times with 5-10 ml ice-cold 1× PBS.Harvest the cells by trypsinization or scraping with a cell scraper.Pellet the cells by centrifuging at 1,000 × g for 2 min at 4°C and discard the supernatant.Resuspend the cell pellet in 1 ml ice-cold polysome extraction buffer (PEB).Note: Lysis with PEB releases the cytoplasmic fraction, not the nuclear fraction. Immediately add 5 µl RNase inhibitor and 50 µl 20× protease inhibitor.",
    "Mix well by pipetting ten times and keep on ice for 15 min, pipetting or vortexing for a few seconds every 4-5 min until the cells are lysed.Centrifuge the lysate at 12,000 × g for 10 min at 4°C.Collect 900 µl supernatant and proceed to the hybridization step (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4088/bioprotoc-11-14-4088-g002.jpgFigure 2. Schematic of the pulldown of circRNA using biotinylated-ASO targeting circHipk2Antisense oligo hybridizationAdd an equal volume (900 µl) of ice-cold 2× Tris, EDTA, NaCl, Triton (TENT) buffer to the supernatant collected in the above step in a 2-ml microcentrifuge tube.Divide the mixture into two tubes (one for the control-ASO pulldown and the other for the circRNA-ASO pulldown).Add 1 µl 100 µM (100 pmol) ctrl-ASO and circRNA-ASO to the control and circRNA pulldown tube, respectively.Note: The manufacturer's datasheet gives the streptavidin bead binding capacity. The ASO amount should be less than the streptavidin bead binding capacity for the pulldown in the next step. A higher amount of ASO may reduce the pulldown efficiency. Incubate the reactions on a rotor at 30 rpm for 90 min at 4°C.Note: The ASO hybridization reaction can be performed at room temperature or at 37°C to facilitate ASO binding to target circRNA; however, this may affect RNA integrity in samples with high levels of endogenous RNase. Streptavidin bead preparationStart the streptavidin bead preparation 15 min before the ASO hybridization step is completed.Mix well and place 100 µl magnetic streptavidin beads (50 µl for each reaction) into a new tube.Place the magnetic beads on a magnetic stand for 30 s and discard the supernatant.Resuspend the magnetic beads in 500 µl ice-cold 1× TENT buffer and place the tube on the magnetic stand for 30 s.Rotate the tubes 180º on the magnetic rack twice to wash the beads (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Magnetic beads washing Discard the supernatant.",
    "Repeat the washing steps (Steps D4-D6) twice.Resuspend the magnetic streptavidin beads in 100 µl ice-cold 1× TENT buffer.Circular RNA pulldownAdd 50 µl washed magnetic streptavidin beads into each hybridization reaction tube (mentioned in Step C4) after completing the 90-minute hybridization step.Add 1 µl RNase inhibitor and 5 µl 20× protease inhibitor to the tubes and mix well by pipetting.Rotate both the control and circRNA ASO tubes at room temperature for 30 min on a tube rotator at 30 rpm.Centrifuge the tubes briefly to bring all the liquid samples to the bottom of the tube without pelleting the beads.Note: High-speed centrifugation may pellet the beads, which may affect the washing steps. Place the tubes on a magnetic rack for 30 s and discard the supernatant.Resuspend the magnetic beads in 500 µl ice-cold 1× TENT buffer and place the tube on the magnetic stand for 30 s.Rotate the tube twice on the magnetic stand to wash the beads (Video 1).Allow the beads to settle toward the magnet and discard the buffer.Repeat the washing steps (steps 6-8) twice.Note: The number of washes may be decided depending on the fold enrichment of the target circRNA. We found that two to three washes are suitable to enrich circHipk2 in our pulldown assays. After the last wash, centrifuge the tube for a few seconds to settle the beads at the bottom.Place the tube on the magnetic stand for 30 s and discard the remaining supernatant.Resuspend the beads in 30 µl ice-cold PEB.Take 15 µl beads to a fresh tube for RNA isolation and RT-qPCR to analyze the pulldown efficiency of circRNA using the ASO and to detect the circRNA-associated miRNAs.Add 7 µl 3× SDS loading dye to the remaining 15 µl beads and mix by pipetting, then heat at 95°C for 5 min.",
    "This sample can be immediately used for western blotting to identify interacting RBPs or stored at -20°C.RNA and cDNA preparation from the pulldown sampleAdd 250 µl TRIzol reagent to the 15 µl beads for RNA isolation and mix well by pipetting.Note: Any similar RNA isolation reagent such as TriSure, RNAzol, TRI reagent, or TriPure can be used to prepare RNA. Column-based RNA isolation kits should be avoided since miRNAs are not purified well using the standard RNA isolation kits. Otherwise, use a kit that can isolate both long RNAs and miRNAs together. Add 50 µl chloroform and vortex for 15 s.Centrifuge at 12,000 × g for 15 min at 4°C, then collect 100 µl aqueous layer into a new tube.Add 100 µl isopropanol and 0.5 µl glycoblue as a co-precipitant.Mix well and keep at room temperature for 10 min, then centrifuge at 12,000 × g for 10 min at 4°C.Discard the supernatant, add 500 µl 75% ethanol to the RNA pellet, and vortex the tube for a few seconds.Centrifuge at 12,000 × g for 5 min at room temperature.Discard the supernatant and air-dry the RNA pellet for 3-5 min with the lid open.Note: Excessive drying of the RNA pellet or residual ethanol may inhibit the solubility of the pellet. Dissolve the pellet in 20 µl nuclease-free water. The RNA can be stored at -20°C for future use or used immediately for cDNA synthesis.Prepare a 20-μl cDNA synthesis reaction containing 13 μl prepared RNA, 0.5 μl Maxima reverse transcriptase, 0.5 μl RNase inhibitor, 1 μl 10 mM dNTP mix, 1 μl random primers, and 4 μl 5× RT buffer.Note: The cDNA can be prepared using any standard reverse transcription kit and random primers. Mix the reaction gently and incubate for 10 min at room temperature followed by 1 h at 50°C.",
    "Incubate the reaction at 85°C for 5 min to inactivate the reverse transcriptase.Dilute the cDNA with 250 µl nuclease-free water. This can be stored at -20°C or used immediately for PCR analysis.circRNA enrichment analysis by RT-qPCRMix 10 μl 100 μM forward and reverse primer stock with 980 μl nuclease-free water to obtain a final concentration of 1 μM primer mix.Prepare 20-μl reactions in a 96-well plate containing 5 μl cDNA, 5 μl primer mix, and 10 μl 2× SYBR Green mix. Three technical replicates should be prepared.Seal the plate with an optical adhesive cover and vortex for a few seconds.Centrifuge the plate for a few seconds to bring the reactions to the bottom of the wells.Perform quantitative PCR on a QuantStudio 3 Real-Time PCR System with the following reaction setup: initial cycle for 2 min at 95°C followed by 40 cycles of 5 s at 95°C and 20 s at 60°C.Obtain the average Ct value of the technical replicates for each target in the control and circRNA pulldown samples.Calculate the percentage (%) enrichment of the target circRNA in the pulldown sample as compared with the control pulldown sample using the delta-CT method (Figure 3) (Livak and Schmittgen, 2001).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4088/bioprotoc-11-14-4088-g003.jpgFigure 3. Example data showing the percentage enrichment of circHipk2 in the circRNA-ASO pulldown sample relative to the control ASO pulldown sampleDetection of interacting miRNAs and RBPsAfter confirming the enrichment of target circRNA in the circRNA ASO pulldown sample, associated miRNAs and RBPs can be analyzed.The miRNAs associated with the target circRNA can be analyzed by RT-qPCR. The RNA prepared in the above step can be used to produce miRNA cDNA followed by qPCR analysis to study their specific enrichment in the circRNA pulldown samples.Perform standard western blotting to detect circRNA-associated RBPs.",
    "Briefly, subject the input, control ASO, and circRNA ASO pulldown samples mixed with SDS dye to SDS-PAGE, and transfer the proteins to nitrocellulose membrane. Incubate the membrane with primary antibody against the predicted RBP followed by the appropriate secondary antibody and detect the chemiluminescence signals."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}