{
  "id": 19602,
  "origin_website": "Jove",
  "title": "Modulation of the Neurophysiological Response to Fearful and Stressful Stimuli Through Repetitive Religious Chanting",
  "procedures": [
    "This ERP study was approved by The University of Hong Kong Institutional Review Board. Before participating in this study, all participants signed a written informed consent form.\n1. Experimental design\nRecruit participants\n\t\nRecruit participants with at least 1 year (~ 200-3,000 h) of experience in chanting the name of \"Amitabha Buddha\" for this study.\n\t\tNOTE: In the present study, 21 human participants ranging from 40-52 years old were selected; 11 were males.\nReligious chanting vs. nonreligious chanting\n\t\nChant the name of \"Amitabha Buddha\" for 40 s. First 20 s with the image of Amitabha Buddha and the next 20 s with IAPS images.\n\t\t\nChant only four characters of the name of \"Amitabha Buddha\" while viewing the image of the Amitabha Buddha in Pureland school14.\nChant the name of Santa Claus (non-religious chanting condition) for 40 s. First 20 s while viewing the image of the Santa Claus and the next 20 s with IAPS images.\n\t\t\nChant only four characters of the name of Santa Claus and imagine the Santa Claus.\nKeep silent for 40 s. First 20 s with a blank image for control purpose and the next 20 s with IAPS images.\n\t\tNOTE: No chanting.\nEEG recording system\n\t\nRecord EEG data using a 128-channel EEG system that consists of an amplifier, headbox, EEG cap, and two desktop computers (see Table of Materials).\nStimuli presenting system\n\t\nUse stimulus presentation software (see Table of Materials) to show neutral and negative pictures from the IAPS on a desktop computer.\nECG recording system\n\t\nUse a physiological data recording system to record ECG data (see Table of Materials).\n2. Affective modulation experiment",
    "NOTE: The experiment had two factors with a 2 x 3 design: The first factor was the picture type: neutral and negative (fear- and stress- provoking). The second factor was the chanting type: chanting \"Amitabha Buddha\", chanting \"Santa Claus\" and no chanting (silent view).\nUse a block design, as it may more effectively elicit emotion-related components15.\n\tNOTE: There were six conditions, and the sequences were randomized and counterbalanced between the participants (Figure 1). The six conditions were as follows: religious chanting while viewing negative pictures (AmiNeg); religious chanting while viewing neutral pictures (AmiNeu); no chanting while viewing negative pictures (PasNeg); no chanting while viewing neutral pictures (PasNeu); nonreligious chanting while viewing negative pictures (SanNeg); and nonreligious chanting while viewing neutral pictures (SanNeu).\nimgsrc://cloudfront.jove.com/files/ftp_upload/62960/62960fig01.jpg\nFigure 1: The experimental procedure. There were six pseudorandomized conditions, and each participant received a pseudorandomized sequence. Each condition was repeated six times in two separate sessions. This figure has been adapted from Reference3. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62960/62960fig01large.jpg]\nShow each picture for ~1.8-2.2 s, with an interstimulus interval (ISI) of 0.4-0.6 s.\n\tNOTE: There were 10 pictures of the same type (neutral or negative) in each session.\nAllow a rest period of 20 s after each session to counter the potential residual effects of chanting or picture viewing on the next session.\nPresent the pictures on a CRT monitor at a distance of 75 cm from the participants' eyes, with visual angles of 15° (vertical) and 21° (horizontal).\nAsk the participants to observe the pictures carefully.\nProvide a brief practice run to the participants to allow them to familiarize themselves with each condition. Use a video monitor to ensure that the participants do not fall asleep.",
    "Give the participants a 10 min rest in the middle of the 40 min experiment.\n3. EEG and ECG data collection\nNOTE: Before coming to the experiment, ask each participant to wash their hair and scalp thoroughly without using a conditioner or anything else that may increase the system's impedance. Collect the EEG and ECG data simultaneously by two separate systems.\nInform each participant of the experimental procedures, that is, that effective pictures were viewed under different chanting conditions.\nSet the sampling rate to 1,000 Hz, and maintain the impedance of each electrode below 30 kΩ whenever possible or according to the system's requirements.\nCollect physiological data, including ECG data using a physiological data recording system (see Table of Materials).\n4. EEG data analysis\nProcess and analyze the EEG data with EEGLAB (see Table of Materials) , Supplementary File 1-2, an open-source software16 following the steps below.\nUse the EEGLAB function \"pop_resample\" to resample the data from 1,000 Hz to 250 Hz to maintain a reasonable data file size. Click on Tools > Change sampling rate.\nUse the EEGLAB function \"pop_eegfiltnew\" to filter the data with a finite impulse response (FIR) filter with 0.1-100 Hz passband. Click on Tools > Filter the data > Basic FIR filter (new, default).\nFilter the data again with a nonlinear infinite impulse response (IIR) filter with a 47-53 Hz stopband to reduce the noise from the alternating current. Click on Tools > Filter the data > select Notch filter the data instead of pass band.\nVisually inspect the data to remove strong artifacts generated by eye and muscle movements. Click on Plot > Channel data (scroll).\nVisually inspect the data again for any consistent noise generated by any channel, and the bad channels were noted.",
    "Reconstruct the bad channels using spherical interpolation. Click on Tools > Interpolate electrodes > Select from the data channels.\nRun independent component analysis (ICA) with the open-source algorithm \"runica\"16. Click on Tools > Run ICA.\nRemove the independent components (ICs) corresponding to eye movements, blinks, muscle movement, and line noise. Click on Tools > Reject data using ICA > Reject components by map.\nReconstruct the data using the remaining ICs. Click on Tools > Remove components.\nFilter the data with a 30 Hz low-pass filter. Click on Tools > Filter the data > Basic FIR filter (new, default).\nObtain ERP data by extracting and averaging time-locked epochs for each condition with a time window of -200 to 0 ms as the baseline and 0 to 800 ms as the ERP. Click on Tools > Extract epochs.\nRe-reference the ERP data with the average of the left and right mastoid channels. Click on Tools > Re-reference.\nRepeat the above steps for the datasets from all participants and compare the differences between conditions using the t-test or repeated-measures ANOVA in a statistical analysis software (see Table of Materials).\nDefine time windows for N1 and LPP based on established theories8,17and the current data3.\n\tNOTE: In this work, N1 was defined as 100-150 ms, while LPP as 300-600 ms from stimulus onset; LPP is most prominent in the central-parietal region (Figure 2).\nFind the neutral vs. negative picture difference at the N1 component using paired t-test among three conditions (Figure 3).\nFind the neutral vs. negative picture difference at the LPP component using paired t-test among three conditions (Figure 4).\nPerform region of interest (ROI) analysis on N1 and LPP components by averaging relevant channels to represent a region.",
    "NOTE: To select ROI, the epochs of all three conditions were averaged to calculate those channels where the neutral and negative pictures had a difference that was significant in the specific time window (e.g., for N1 or LPP).\nCompare the difference at N1 and LPP separately, using repeated measures ANOVA and post hoc statistics in statistical analysis software.\n\tNOTE: Use post hoc analysis (Bonferroni correction) and determine significant differences between the two conditions separately if the model was significant. The significance threshold was set at p < 0.05.\n5. ERP source analysis\nPerform the ERP source analysis18 with the SPM19 open-source software (see Table of Materials) following the steps below.\nLink the EEG cap sensor coordinate system to the coordinate system of a standard structural MRI image (Montreal Neurological Institute (MNI) coordinates) by landmark-based co-registration. In SPM, click on Batch > SPM > M/EEG > Source reconstruction > Head model specification.\nPerform forward computation to calculate the effect of each dipole on the cortical mesh imposed on the EEG sensors. Under the same Batch Editor, click on SPM > M/EEG > Source reconstruction > Source inversion.\n\tNOTE: These results were placed in a G matrix (n x m), where n is the number of sensors (EEG space dimension) and m is the number of mesh vertices (source space dimension). The source model was X = GS, where X is an n x k matrix denoting the ERP data of each condition, k is the number of time points, and S is an m x k matrix indicating the ERP source.",
    "Use the greedy search-based multiple sparse priors algorithm (since S is unknown) in the third step (among the many algorithms available) to perform the inverse reconstruction because it is more reliable than other methods20. Choose MSP (GS) for the Inversion type in the Source Inversion window.\nDetermine the difference between conditions using general linear modeling in SPM. Set the significance level to p < 0.05. Under Batch Editor, click on SPM > Stats > Factorial design specification.\n6. ECG data and behavioral assessment analysis\nUse physiological and data processing software to process and analyze the ECG data (see Table of Materials). Calculate the mean scores for each condition. In EEGLAB, click on Tools > FMRIB Tools > Detect QRS events21.\n\tNOTE: Similar to the ERP amplitude analysis, statistical software was used to further analyze the data with repeated measures ANOVA. Post hoc analysis was performed to determine the significant differences between the two conditions separately if the model was significant. The significance level was set to p < 0.05.\nAsk the participants to rate their belief in the efficacy of chanting the subject's name (Amitabha Buddha, Santa Claus, etc.) on a 1-9 scale, where 1 is considered weakest and 9 the strongest."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}