{
  "id": 9795,
  "origin_website": "Jove",
  "title": "Measuring G-protein-coupled Receptor Signaling via Radio-labeled GTP Binding",
  "procedures": [
    "1. Expression of Recombinant HA-MOR1 in Cultured Cells\nNOTE: Follow all cell culture protocols in a sterile laminar flow hood.\nSterilize the cell culture laminar flow hood with 70% ethanol and maintain sterile technique throughout the cell culture.\nPrepare human embryonic kidney cells 293 (HEK293) cell culture medium, complete Dulbecco's-modified Eagle Medium (DMEM): DMEM, pH 7.4, supplemented with 2 mM L-glutamine, 1% penicillin/streptomycin, and 10% fetal bovine serum (FBS).\nPlate 2.5 x 106 HEK293 cells onto a 10 cm tissue culture plate in 10 mL of complete DMEM and incubate at 37 °C and 5% CO2 until 70-80% confluency is reached (O/N).\n\tNOTE: To collect enough protein for a complete GTP-binding experiment, plate at least 3 x 10 cm plates of cells.\nTransfect the cells with HA-MOR1 using a transfection reagent of choice and by following the manufacturer's guidelines. Incubate for 36-48 h.\n\tNOTE: Human MOR-1 cDNA (NCBI Reference Sequence: NM_000914.4) was a generous gift from Gavril Pasternak and was cloned into pCMV-HA.\n2. Cell Fractionation and Membrane Collection\nPrepare the following lysis buffers:\nBuffer 1: 10 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES), pH 7.4; 1 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid (EGTA); 10% sucrose; protease inhibitor cocktail; and 1 mM dithiothreitol (DTT). Add the DTT fresh on the day of membrane isolation.\nBuffer 2: 10 mM HEPES, pH 7.4; 1 mM EGTA; 1 mM MgCl2; and 1 mM DTT. Add the DTT fresh on the day of membrane isolation.\nRemove the transfected cells from the incubator (step 1.4), aspirate the medium, and rinse the cells with 5 mL of ice-cold Phosphate-buffered Saline (PBS). Aspirate the PBS and excess liquid from the plate.",
    "Add 600 µL of Buffer 1 to the cells. Using a cell scraper, dislodge the cells from the plate surface and pipette the cell suspension into a 1.6 mL microcentrifuge tube.\nImmediately snap-freeze the microcentrifuge tube in liquid nitrogen. Once the samples are frozen, thaw the lysates on ice or place them at -80 °C for long-term storage.\nRepeat steps 2.3 and 2.4 with all plates of cells.\nOnce the lysates have thawed, use a single-pulse micro-tube homogenizer to break open the cells. Pulse the homogenizer 3-5 times for 10 s, placing the tube back on ice for 30 s between pulses.\nCollect 20 µL as whole cell fraction.\nCentrifuge the remaining sample for 10 min at 1,000 x g and 4°C. Collect the supernatant and place in a new 1.6 mL microcentrifuge tube on ice.\nResuspend the pellet in 100 µL of Buffer 1 and rehomogenize with a pestle. Pulse the homogenizer 3-5 times for 5 s, placing the tube back on ice for 30 s between pulses.\nCentrifuge the sample a second time for 10 min at 1,000 x g and 4 °C. Combine the supernatant with the supernatant from step 2.7.\n\t\tNOTE: The remaining pellet contains nuclear and membrane proteins.\nCentrifuge the combined supernatants for 20 min at 11,000 x g and 4 °C. Separate the supernatant (the cytosolic fraction) into a new 1.6 mL microcentrifuge tube.\nResuspend the pellet in 200 µL of Buffer 2. Homogenize the pellet by triturating it 3-5 times. Centrifuge the sample for 20 min at 21,100 x g and 4 °C. Aspirate the supernatant. Resuspend the pellet containing the crude membrane fraction in 50 µL of Buffer 2.\nImmediately proceed to the GTPγS binding experiments (section 3) or snap-freeze in liquid nitrogen and store at -80 °C.\n3. [35S]GTPγS Binding",
    "NOTE: Use standard radiochemical safety protocol when handling [35S]GTPγS and when conducing [35S]GTPγS binding experiments. Wear protective gloves and a lab coat at all times. Check the packaging material for leaks or cracks. Dispose of waste and excess reagents according to institutional protocols.\nPrepare Incomplete Binding Buffer (IBB) by mixing 50 mM HEPES, pH 7.4; 5 mM MgCl2; 100 mM NaCl; and 1 mM ethylenediaminetetraacetic acid (EDTA) in distilled water.\nDilute stock [35S]GTPγS to 50 nM in 10 mM Tris-HCl, pH 7.6, and 10 mM DTT. Make 500 µL aliquots and store them at -80 °C. Use only a freshly thawed aliquot immediately before initiating the experiment. Thaw the aliquots on ice.\nPrepare nonradio-labeled GTPγS by dissolving 1 mg of GTPγS powder in 177.62 µL of pure water for a stock concentration of 10 mM. Make 10-µL aliquots and store them at -20 °C.\nPrepare complete binding buffer (CBB) by supplementing IBB to include a final concentration of 1 mM DTT, 0.1% (wt/vol) bovine serum albumin (BSA), 10 µM GDP, and 0.1 nM [35S]GTPγS.\n\tNOTE: The CBB now contains radiolabeled GTP. Take appropriate safety precautions while working with radioactive solutions.\nThaw the membrane fraction from step 2.11 on ice.\nQuantify the protein concentration of the membrane fraction via a Bradford protein assay using a spectrophotometer at 595 nm.\nPrepare a dilution series of BSA protein standards with Buffer 2, at final concentrations of 0, 250, 500, 750, 1,500, 2,500, and 5,000 µg/mL.\nAdd 2 µL of each standard or membrane to 1 mL of Bradford reagent in a cuvette. Mix thoroughly by vortexing.\nAdjust the spectrophotometer to a wavelength of 595 nm and blank using the cuvette with 0 µg/mL protein.\nWait 5 min and read each of the standards and each of the samples at a 595 nm wavelength.",
    "Plot the absorbance of the standards versus the concentration. Using the Beer-Lambert Law (A = εcl, where ε = extinction coefficient, l = length of cuvette, and c = concentration), calculate the concentration of the membrane samples.\nDilute the membrane fractions to a concentration of 100 µg protein/mL in IBB.\n\tNOTE: One 10 cm dish of HEK293 cells typically yields between 1 & 3 mg protein/mL.\nPrepare the following experimental conditions in individual 1.6 mL microcentrifuge tubes: a ligand dilution series, a basal activity condition to measure basal GTP binding, and a nonspecific binding condition to measure nonspecific GTP binding.\nFor the ligand dilution series, prepare a dilution series of the ligand of interest in a final volume of 100 µL of CBB. Prepare the ligand series at 2x the desired final concentrations. Space the ligand concentrations to adequately cover a range of responses.\n\t\t\nTo assay the effect of DAMGO on GTP binding via MOR1, prepare DAMGO dilutions of 2 mM, 200 µM, 20 µM, 2 µM, 200 nM, 20 nM, 2 nM, 200 pM, 20 pM, and 2 pM in CBB (final volume: 100 µL).\n\t\t\tNOTE: For example, if the ligand of interest has an expected EC50 value of 10 µM, prepare ligand dilutions of 200 nM, 2 µM, 20 µM, 200 µM, and 2 mM. These five conditions cover a wide range of concentrations and are 2x the concentration desired for the assay.\nFor basal binding, prepare a tube with 100 µL of CBB only.\nFor nonspecific binding, prepare a tube with 99 µL of CBB supplemented with 1 µL of 2 mM nonradio-labeled GTPγS.\nAdd 100 µL of the diluted membrane solution (step 3.7) to each experimental condition.",
    "Incubate the membranes with the various experimental conditions in 1.6 mL microcentrifuge tubes for 30 min at 25 °C in a thermomixer or on an orbital shaker.\n4. Membrane Filtration\nPrepare wash buffer by combining 50 mM Tris-HCl, pH 7.4; 5 mM MgCl2; and 50 mM NaCl in distilled water.\nPresoak the glass fiber filters in water for 10 min.\n\tNOTE: Filters have a pore size of 1 µm, a diameter of 2.1 cm, and a thickness of 675 µm.\nRemove the samples from the thermomixer or orbital shaker (step 3.10). Briefly pulse-spin the samples for 5 s to collect each sample at the bottom of the tube.\nRemove the lid of the vacuum filtration apparatus. Lay the presoaked filters onto the vacuum ports of the apparatus. Re-secure the apparatus lid to form a vacuum seal. Turn on the vacuum.\nPipette 195 µL of each 200 µL experimental condition onto filters to minimize error from adsorption to the walls of the tube and/or from pipetting.\nWash the filters three times with 1 mL of ice-cold wash buffer.\n5. Liquid Scintillation Counting\nPlace 5 mL scintillation counting vials in a counting rack. Add 5 mL of scintillation fluid to each vial.\nTurn off the vacuum (step 4.4). Remove the lid of the vacuum filtration apparatus. Using tweezers, pick up the filters from the vacuum ports of the filtration apparatus and drop each filter into an individual 5 mL scintillation vial.\nPrepare one vial with 195 µL of CBB to determine the maximal signal.\nCap each vial securely. Incubate the vials on an orbital shaker at 25 °C for 10 min.\nTurn on the scintillation counter. Program the scintillation counter to measure 35S isotope emission for 5 min per sample using the standard associated scintillation program.\nPress \"Start\" to take a count.",
    "When the counting is done, dispose the counted vials as hazardous waste.\n6. Data Analysis\nEnter the data into statistics and analysis software.\nSubtract the non-specific binding from each of the other measurements to determine the specific binding.\n\t\tNOTE: The degree of nonspecific binding is determined by the sample incubated with non-radiolabeled GTPγS (step 3.8.3).\nOpen the statistics and analysis software and select an XY dataset entry.\nEnter the specific binding data from the [35S]GTPγS-binding experiments into a data table in the statistics and analysis software. Enter the agonist concentrations, as molar concentrations, in the \"X\" column. Enter the associated 35S counts as \"Y\" values.\nTransform the data.\nConvert the X values to their respective logarithm by clicking \"Analyze.\" Select \"Transform\" from the built-in analyses.\nWithin the \"Transform\" dialog box, select \"Transform X values using\" and select the function \"X=log(X).\" Choose to create a new graph of the results.\nClick \"OK.\"\nNormalize the Y-values.\nWith the transformed results displayed, click \"Analyze.\" Select \"Normalize\" from the built-in analyses.\nWithin the \"Normalize\" dialog box, select the radio button to define 0% as the \"smallest value in each data set\" and 100% as the \"largest value in each data set.\" Select the box to present the results as percentages. Select the box to create a new graph of the results.\nClick \"OK.\"\nFit a nonlinear regression curves to the plotted data. Perform a nonlinear regression analysis.\nWith the normalized results displayed, click \"Analyze.\" From the built-in analyses, select \"Nonlinear regression (curve fit).\"\nIf investigating an agonist, select \"log(agonist) vs. normalized response - variable slope\" from the dialog box.\nIf investigating an antagonist, \"select log(antagonist) vs. normalized response - variable slope\" from the dialog box.\nClick \"OK.\"",
    "Review the graph and results to ensure that the fit and data are in reasonable agreement. Ensure that the regression matches the general pattern of the plotted data and that the residuals are not so large that they render the dose-response curve flat.\n\tNOTE: The software will summarize the results of the nonlinear regression and details the concentration that elicits the half-maximal response (EC50), Hill coefficient (nH), and half-maximal inhibitory concentration (IC50).\nDerive agonist/antagonist parameter potency.\nDerive the agonist equilibrium dissociation constants (Kb) from either of the following experiments16,17,18\nAssess the shift in the dose-response of an agonist in competition with a fixed concentration of antagonist. Here, EC50' = EC50 (1 + [antagonist]/antagonistKb), where EC50' is the right-shifted EC50.\nAssess [35S]GTPγS binding with varying concentrations of antagonist in competition with a fixed concentration of agonist. Here, Kb = IC50/ (2 +([agonist]/agonist EC50)n)1/n - 1, where n is the Hill coefficient of the agonist.\nDepending upon the variability of the data, repeat the experiment (steps 3.8-5.6) for each ligand approximately 3-5 times and average the results using a statistics and analysis software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}