{
  "id": 3046,
  "origin_website": "Cell",
  "title": "Evaluation of post-natal angiogenesis in a mouse hind limb ischemia model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCareful adherence to the following procedure, resulted in efficient resection of the femoral artery and vein with minimal bleeding while yielding a significant reduction of blood perfusion in the peripheral districts of the limb. The first step to induce the HLI is to prepare the animal model by inducing perioperative analgesia and shaving the limbs. The second step is to perform the HLI surgery (Figure 3[href=https://www.wicell.org#fig3]). The third step is to follow the degree of ischemia using the Laser Doppler System and eventually sacrifice the animals to perform further analysis over time.\nPreparation of the animal: Preemptive analgesia, anesthesia and shaving\nTiming: 15 min (for steps 1 to 4)\nThis section describes the preparation of the animal before the induction of the hind limb ischemia, focusing the attention on the analgesia, anesthesia and the shaving conditions.\nInject each mouse with preemptive analgesia 30 min before the surgery, 2- and 24 h after the induction of the HLI.\nNote: Each mouse received 50 μL injection per injection (using an insulin syringes) of Altadol® (with a final concentration of 5 mg/kg) intraperitoneally. Altadol® (tramadol, 50 mg/kg) is an analgesic indicated for the management of moderate to severe pain.\nAlternatives: Sedaxylan® could be used to control the pain with a final concentration of 10 mg/kg.\nInduce sedation by placing the animal in the induction chamber saturated with 5% isoflurane.\nNote: To assess the presence of anesthesia, animals should not show pedal reflex after a firm toe pinch. Adjust the timing of anesthesia induction to achieve complete mouse sedation.\nTransfer the animal to the surgical table (Figure 1[href=https://www.wicell.org#fig1]D) in supine position with a mask delivering a 1–3% isoflurane in 100% O2 at a flow rate of 1L/min to maintain anesthesia.",
    "Note: The surgical table and the surgical instruments to perform the HLI procedure should be disinfected with ethanol 70%.\nShave the hair of the hind limbs both on the ventral side (for the surgical procedure) and in dorsal side (for imaging acquisition with the Laser Doppler) up to 0.5 cm above the groin using an electric shaver.\nThereafter, thoroughly remove any excess hair by applying a thin layer of hair removal cream (i.e., Veet™ Figure 1[href=https://www.wicell.org#fig1]A) for 2–3 min without irritating the skin. Gently remove any excess of hair removal cream with a paper towel damped with warm water.\nNote: The complete removal of hairs from the hind-limbs ease the surgical procedures and reduce the preparation time for the doppler imaging during the follow-up. Take care to remove enough hair while doing the work safely, efficiently, and with minimum hassle during the procedure.\nHLI surgical procedure\nTiming: 30–45 min (for steps 5 to 14)\nThis section describes the procedure step-by-step to induce a severe hind limb ischemia in different mice strains.\nAfter the shaving step, keep the animal in a supine position with a mask delivering 1–3% isoflurane in 100% O2 at a flow rate of 1L/min. When performing ischemia on the right hindlimb, place the animal with its right side facing the operator.\nExtend the right limb by 90° and secure it by placing a piece of tape on the paw with the plantar side facing upwards (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2589-Fig2.jpg\nFigure 2. Induction of the hind limb ischemia\n(A) 1 cm surgical incision on the right leg.\n(B) Separation of the fat pad from the muscle with a swab.\n(C) Fat pad Capillary exposure.\n(D) Exposure of fat pad vessel.\n(E) Capillary cauterization with bipolar forceps.\n(F) Cut the fat pad.\n(G) Femoral artery exposure.",
    "(H) Separation of the nerve from the femoral artery.\n(I) Underneath the femoral artery and vein with the curve forceps.\n(J) Cauterization of the femoral artery with the bipolar forceps.\n(K) Remove the femoral artery after the cauterization.\n(L) Close the animal with the stapler.\nScale bar 1cm.\nNote: The operator should face the animal’s right limb and the surface of the animal's right limb should be disinfected using a cotton swab moistened with povidone/iodine.\nNote: The surgical area should be disinfected using a paper towel embedded with 70% ethanol.\nThen, using fine forceps and surgical scissors, make a small (1 cm) clipped vertical incision at the level of the groin between the left inguinal fat pad and the peritoneum to expose the underlying fat pad covering the femoral artery (Figure 2[href=https://www.wicell.org#fig2]A).\nNote: We recommend starting the incision on the side of the left inguinal pad.\nUsing PBS-moistened cotton swabs, gently brush away the subcutaneous fat tissue surrounding the thigh muscle to separate the fat pad from the muscle (Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nRemove the excess of subcutaneous fat tissue surrounding the femoral artery with the bipolar forceps taking care to cauterize any blood vessel (Figures 2[href=https://www.wicell.org#fig2]D and 2E).\nGently cut the remaining pads of subcutaneous adipose tissue (Figure 2[href=https://www.wicell.org#fig2]F).\nNote: The subcutaneous fat cauterization process needs a gentle tap with the bipolar forceps to avoid bleeding. If during the procedure you burn any surrounding tissue, you should remove the necrotic tissue with surgical scissors.\nCritical: Be careful when you perform the incision and remove the subcutaneous fat because the fat pad tissue contains a significant number of blood vessels. The vessels can be easily excised, by using an electrocauterization device to control the bleeding before removing the fat pad with the scissor.",
    "Gently extend the incision through the skin until you reach the popliteal bifurcation. Use straight Micro-Mosquito tweezers to gently clamp and flip the inguinal muscle and to obtain a better view of the upper extremity of the vasculature (Figure 2[href=https://www.wicell.org#fig2]G).\nNote: As a reference, you should easily identify the inguinal ligament. Moreover, to better visualize the tissue you should use the stereomicroscope from this point onwards.\nThe dissection of the femoral artery and vein involves the following steps:\nFirst, put a Forceps clamp to easy open and catch the tissue with a locking mechanism to retain the fat pad in place to better visualize the femoral artery.\nThen, using PBS-moistened cotton swabs, brush away the connective tissue surrounding the femoral artery (Figure 2[href=https://www.wicell.org#fig2]G).\nAfterward, with a pair fine forceps carefully dissect and separate the femoral nerve from the femoral artery and vein. You can also use a swab to help you with the dissection (Figure 2[href=https://www.wicell.org#fig2]H).\nFinally, carefully separate and dissect the femoral artery and vein from the lateral muscular planes. At this point of the procedure, the femoral nerve should be clearly dissected from the artery and vein.\nAfter the dissection, pass the closed tip of a curved fine forceps underneath the femoral artery and vein before performing the electrocauterization (Figures 2[href=https://www.wicell.org#fig2]I and 2J). Then, remove with the scissors the cauterized portion of the vessels (Figure 2[href=https://www.wicell.org#fig2]K).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2589-Fig3.jpg\nFigure 3. Schematic representation of HLI\nSchematic drawing about the structure of the vasculature and two pictures showing the femoral artery and vein before HLI and after the procedure. Scale bar 1 cm.\nNote: Figure 3[href=https://www.wicell.org#fig3] represents the anatomy without the femoral artery and vein.",
    "Critical: Be careful with the electrocauterization of the femoral artery and vein as bleeding might occur if the vessels are not cauterized well. To reach a good cauterization you should tap 1 cm of the femoral artery and vein. To obtain a reproducible degree of ischemia, the length of electrocauterization must be consistent. As reference, you should cauterize the vessels between the inguinal ligament and the popliteal bifurcation (Figure 2[href=https://www.wicell.org#fig2]I). It is recommended that the time of cauterization do not exceed more than 10 s for each application. The user should also optimize the power used to cauterize to avoid the necrosis of the tissue while obtaining an optimal vascular cauterization.\nNote: If your cauterization time is too long you can break the blood vessel before clotting properly the vessel, in this case bleeding may occurs.\nUse PBS-moistened cotton swabs to clean the area from any blood leaking and check the correct removal or the femoral artery and vein.\nCritical: Ensure that there are no blood leaks, clots or necrotic debris before closing the incision with the stapler.\nCarefully remove the clamp and moisturize the clamped tissue with PBS to reduce tissue necrosis and then close the incision using a surgical stapler with sterilized clips (Figure 2[href=https://www.wicell.org#fig2]M).\nWhen the HLI procedure is finished (Figure 3[href=https://www.wicell.org#fig3]), remove the mice from the flow of isoflurane® and place the mouse on top of a draped heated pad in a recovery cage. Monitor continuously the mice mouse until they wake up from the Isoflurane®.\nNote: After the HLI procedure the mice should move freely showing a modest limp. In addition, mice display a tremendous ability for spontaneous recovery after ischemic manipulations.",
    "Critical: Note that the mice should be injected with analgesic of choice 2 h and 24 h post-ischemia to avoid or minimize discomfort, distress and pain.\nLaser Doppler perfusion images\nTiming: 15 min per mouse (for steps 15 to 21)\nTo confirm the induction of the hind limb ischemia and follow-up the recovery of the perfusion we suggest performing the laser Doppler Blood Perfusion Images at 1, 7, 14, 21-days post-ischemia (Figures 4[href=https://www.wicell.org#fig4] and 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2589-Fig4.jpg\nFigure 4. Laser Doppler perfusion acquisition images\nRepresentative image of the LDPI blood perfusion program and quantification.\nTo obtain Doppler Blood Perfusion Images:\nPlace the mouse on a 37°C heated surface with a non- reflective light- absorbing surface such as a green-colored surface in the supine position.\nInduce sedation by placing the animal in the induction chamber saturated with 5% isoflurane.\nTransfer the animal to the table in a supine position with a mask delivering a 1–3% isoflurane in 100% O2 at a flow rate of 1L/min.\nNote: By placing the tissue on a red light-absorbing surface (avoid black or a glossy surfaces) during the acquisition of the images, the amount of back-scattered light from each site can be used to discriminate the tissue (high back-scattered light level) from the background (low back-scattered light level).\nThe ischemic and non-ischemic hind limb should be gently extended to the same length, and the palm of the feet should be placed upwards and secured in place by using a small piece of tape underneath.\nSwitch on the PeriScan PIM II Opto-Isolation Unit and switch on the computer and initialize the acquisition software (PeriScan System Software – LDPIwin).\nSelect and click the “Mark Area button” so that the laser beam shows the boundaries of the scanned area.",
    "Note: It is highly recommended to keep the field of scan and the resolution mode consistent between different sets of to make future analyses comparable. Ensure that both the ischemic and non-ischemic legs are recorded in the same field of scan as suggested in Figure 4[href=https://www.wicell.org#fig4].\nStart the acquisition by clicking “Start”. The laser will start to scan the area of interest.\nCritical: Avoid performing the scanning under strong direct ambient light (i.e. surgical lamp) as it might interfere with the laser and produce perfusion artifacts.\nThe perfusion will be shown as color-graded images of the sample on a gray background. Canonically, the perfusion ranges from blue (low) to red (high). It is recommended to acquire multiple scanning of each sample to compensate for adaptations and stochastic changes in perfusion (Figure 4[href=https://www.wicell.org#fig4]).\nThen, proceed with quantification (see section 4 - Perfusion quantification and statistical analyses; Figure 4[href=https://www.wicell.org#fig4]).\nNote: The perfusion scale can be set to a specific perfusion range to compensate for background noise and help with the comparison between the data obtained for different animals.\nWhen the data acquisition is complete, you can save the file in your folder. After completing the recording, return the animal to the recovery cage and monitor the animal continuously until the animal is awake from the isoflurane®.\nHistological and immunological studies\n21 days after HLI, the gastrocnemius (GN) and semimembranosus (SM) muscles are collected. We performed eosin-hematoxylin (H & E) staining for histopathological assessment of muscle injury while immunofluorescence (IF) can be used to quantify post-ischemic angiogenesis.\nTotal timing for histological and immunological studies: 3–4 days for H & E staining and the immunofluorescence procedure.\nMuscle collection\nTiming: 15 min (for steps 22 to 27)\nThis section describes the procedure step-by-step to collect and storage the gastrocnemius and semimembranosus muscles.",
    "Humanely sacrifice the mouse. Make a small incision along the skin of the lower leg around the ankle and then tear off the entire skin covering the leg (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2589-Fig5.jpg\nFigure 5. Collection of gastrocnemius and semimembranosus muscle\n(A–L) For the collection of the gastrocnemius: Perform a small incision on the ankle (A), and firmly pull the skin to expose the underlying skeletal muscle (B). Reverse the animal on the dorsal side and firmly insert the tweezers between the bone and the calcaneal tendon to detach the gastrocnemius (C). Keep the tweezers in place to help with the cut of the tendon. Lift the gastrocnemius from the distal portion of the tendon to reveal the underlying soleus muscle, which is evident from its bright red color (D). Gently split the soleus from the gastrocnemius (E) before cutting the gastrocnemius (F). Cross-sectional view (G) and lateral view (H) of a gastrocnemius trimmed to be included and embedded with paraffin. For the collection of the semimembranosus: Remove the posterior portion of the tight, exposing the sciatic nerve (I). Ventral view with the indication (dashed square) (J) of the portion of the semimembranosus muscle that will be harvested (K) and (L). Scale bar 1 cm.\nGently separate the calcaneal tendon from the bone (Figure 5[href=https://www.wicell.org#fig5]B), clamp the tendon very distally underneath the heel using forceps, and cut with scissors.\nPull and separate the posterior gastrocnemius muscle from the bone with the forceps (Figure 5[href=https://www.wicell.org#fig5]C).\nDissect the soleus, which can be easily identified by its bright red color, from the posterior muscle by pulling the soleus from its proximal tendon until the distal tendon and cut out the soleus using a scissors (Figures 5[href=https://www.wicell.org#fig5]D and 5E).",
    "To collect the semimembranosus muscle remove the posterior portion of tight to expose the sciatic nerve (Figure 5[href=https://www.wicell.org#fig5]G). Then flip the animal ventrally (Figure 5[href=https://www.wicell.org#fig5]H) and remove a portion of the semimembranosus muscle (Figure 5[href=https://www.wicell.org#fig5]I).\nNote: this portion of skeletal muscle is quite soft and needs to be handled gently to preserve structural integrity.\nStore the dissected gastrocnemius muscle for further histological studies (Figures 5[href=https://www.wicell.org#fig5]F and 5J).\nMuscle histomorphology studies: Tissue processing, paraffin embedding and sectioning\nTiming: 3 to 4 days (for steps 28 to 38)\nHematoxylin and Eosin (H & E) staining is used to quantify necrotic and regenerating muscle fibers. Tissue necrosis and inflammation are identified by morphological alterations of the cytoplasm of the myofibers, by the presence of cellular debris and by the presence of inflammatory cells infiltrating the interstitial space. According to the time point at which the analysis is performed, different subsets of inflammatory cells can be identified, whilst regenerating myofibers are identified by the presence of centrally-located nuclei.\nNote: For the histological assessment, samples are fixed and embedded in paraffin following the next steps.\nFix the muscles immediately after collection in pH 7, buffered with 4% paraformaldehyde solution for 24 h in a cold room (4°C).\nNote: The volume of paraformaldehyde (4% PFA) must cover completely the specimen volume.\nDehydrate the muscles in ascending ethanol solutions 50%, 70%, 80% and finally 100% by placing the muscle in a 24-well cell culture plate.\nKeep the muscles in each solution for 10 min at room temperature (22°C–25°C) with low agitation.\nImmerse the samples in xylene 3 times by placing the muscle in a 24-well cell culture plate.\nKeep the muscles in each solution for 10 min at room temperature (22°C–25°C) with low agitation.",
    "Trim the muscle to avoid samples thicker than 4 mm (Figures 5[href=https://www.wicell.org#fig5]F–5H). This would severely impair paraffin inclusion.\nPlace the samples in the embedding cassette and immerse the samples in paraffin at 56°C overnight (16–18 h), or in an automated inclusion machine.\nWhen paraffin inclusion is complete, place the sample in the paraffin mold and pour the paraffin to embed the sample in the block.\nCritical: Note that the muscle should be placed in the paraffin mold in the correct orientation. Carefully, using warm forceps, transfer the GN muscle into the mold, placing the cut side down. Canonically, muscles are sectioned transversally to appreciate the cross-sectional area of the fibers. Let the paraffin block containing the tissue solidify overnight (16–18 h).\nPause point: The samples can be stored at room temperature (22°C–25°C).\nThen, cut the sample into 10-μm-thick sections using a microtome.\nNote: To optimize the quality of the sections, it is recommended to cool the paraffin blocks at −20°C before sectioning (for 30 min) or place the blocks in slushed crushed ice for 10 min.\nBefore performing the H & E staining, the samples must be deparaffined and rehydrated.\nPlace the slides for 5 min on a 60°C heated surface or in an oven to spread out the sections.\nRemove paraffin with 3 washes with p-Xylene for 5 min each.\nRehydrate the sections in decreasing concentrations of ethanol: 100%, 90%, 70%, 50% and finally clean with PBS 1× for 5 min each.\nImmerse the histological sections in hematoxylin for 10 min. Then, rinse the slides in tap water for 5 min three times.\nNote: The time for the hematoxylin staining can be adjusted according to the tissue or your batch of hematoxylin.",
    "Afterward, immerse the sections in a basic water solution (pH 9), which is a component of the H & E kit. Then, wash the tissue in running tap water for 5 min.\nImmerse the sections in eosin for 1 min. Then, rinse the slides in tap water for 5 min.\nNote: the time for eosin staining can change according to the tissue or your batch of eosin.\nDehydrate the histological section in increasing concentrations of ethanol, 50%, 70% and 100% for 5 min each, by dipping the slides in the coplin jar.\nNote: Drain the excess ethanol gently tapping the slides on a paper towel and rinse the slide in coplin jar containing xylol for three times, 5 min each.\nFinally, drain the excess xylol and mount by adding 10 μL of a xylol-based mounting buffer on each tissue portion. Put the coverslip and let the slides dry completely.\nNote: Nail polish is often used as a sealer for cover glasses.\nImmunological studies\nTiming: 3 to 4 days (for steps 39 to 47)\nThis section describes the immunofluorescence (IF) staining procedure. For immunological studies the samples are embedded in optimal cutting temperature medium (OCT) and frozen to obtain cryosection and avoid antigen masking due to fixation and paraffin inclusion.\nAfter the removal of the GN and the SM muscles, embed the tissues immediately in OCT and freeze them in nitrogen-cooled isopentane. Finally, store the muscles at −80°C.",
    "Critical: Avoid immersing the tissue in 1× PBS after the removal, since PBS increases the possibility to form ice crystal that will ruin the section. Fix the whole muscle in 4% PFA for 45 min at room temperature (22°C–25°C) and then immerse the muscle in 30% Sucrose in PBS 1× overnight (16–18 h), to displace the water with the sucrose solution and avoid freezing artifacts. The following day you can freeze the muscle in liquid nitrogen -cooled isopentane.\nNote: Freezing by direct immersion in liquid nitrogen is common, although it is more damaging to the tissue. Rapid freezing in isopentane results in less tissue damage.\nPause point: The samples can be stored at −20°C up to 2 years.\nCut the cryopreserved GN and SM muscles in 10-μm-thick transverse sections using a cryostat.\nNote: The sections can be stored for short term (≤30 days) at −20°C. For long-term storage, −80°C is recommended.\nBefore performing immunofluorescence, bring the sections to room temperature (22°C–25°C) and wash in a coplin jar with 1× PBS for 5 min. Then, fix the tissues in 4% PFA for 10 min at room temperature (22°C–25°C) and wash twice for 5 min with 1× PBS.\nIncubate the sections with a blocking solution (see key resources table[href=https://www.wicell.org#key-resources-table]) for 1 h at room temperature (22°C–25°C) in a black humidified chamber.\nNote: You can use a pap pen, which is a water-repellent barrier pen to keep the reagents localized on tissue slides, prevent mixing of the reagents and reduce the blocking solution volume.\nSubsequently, incubate the sections with different primary antibodies (see key resources table[href=https://www.wicell.org#key-resources-table] for working dilutions) diluted in blocking solution, overnight (16–18 h) at 4°C. Incubate negative control sections in the antibody diluent solution without antibody addition.",
    "The following day (after 16–18 h), wash sections twice for 5 min in a coplin jar containing 1× PBS at room temperature (22°C–25°C), and incubate with the proper secondary antibody for 1 h at room temperature (22°C–25°C) in a dark and black humified chamber.\nThen, wash sections by dipping 3 times in a coplin jar containing 1× PBS, followed by an incubation with DAPI for 15 min at room temperature (22°C–25°C) in the dark humified chamber.\nFinally, mount sections using Fluoromount-G and coverslips. Stained sections should be kept at 4°C in a dry box in the dark for a minimum of 24 h.\nAcquire immunofluorescence with an inverted widefield fluorescence microscope (i.e., Zeiss Observer). Take the images at 20× and 40× magnification with oil immersion objectives."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Metabolism",
    "Microscopy",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}