{
  "id": 8441,
  "origin_website": "Jove",
  "title": "In Vitro Wedge Slice Preparation for Mimicking In Vivo Neuronal Circuit Connectivity",
  "procedures": [
    "All experimental procedures were approved by the National Institute of Neurological Disorders and Stroke/National Institute on Deafness and Other Communication Disorders Animal Care and Use Committee.\n1. Experimental preparations\nNOTE: Details regarding slice preparation including slicing solution, slicing temperature, slice incubation temperature and apparatus (etc.) are specific for brainstem preparation performed in this experiment. Slice incubation details can be altered per laboratory experience.\nPrepare internal solutions for patch-clamping.\n\t\nPrepare voltage clamp solution containing (in mM) 76 Cs-methanesulfonate, 56 CsCl, 1 MgCl2, 1 CaCl2, 10 HEPES, 10 EGTA, 0.3 Na-GTP, 2 Mg-ATP, 5 Na2-phosphocreatine, 5 QX-314, and 0.01 Alexa Fluor-488 hydrazide. Adjust the pH to 7.2 with CsOH.\nPrepare current clamp solution containing (in mM) 125 K-gluconate, 5 KCl, 1 MgCl2, 0.1 CaCl2, 10 HEPES, 1 EGTA, 0.3 Na-GTP, 2 Mg-ATP, 1 Na2-phosphocreatine, and 0.01 Alexa Fluor-488 hydrazide. Adjust the pH to 7.2 with KOH.\nPrepare 100 mL of 4% agar by adding 4 g of agar to 100 mL hot (near boiling) water. Place on heated stir plate to maintain temperature and stir until completely dissolved. Pour into 100 mm plastic Petri dishes to approximately 1 cm depth and let cool. Refrigerate until needed.\nPrepare 1 L artificial cerebrospinal fluid (ACSF) containing in mM: 124 NaCl, 1.2 CaCl2, 1.3 MgSO4, 5 KCl, 26 NaHCO3, 1.25 KH2PO4, and 10 dextrose. Bubble with carbogen (5% CO2 / 95% O2) for at least 10 min, then adjust final pH to 7.4 with 1 M NaOH if needed. Maintain oxygenation and pH of solution by bubbling continuously with carbogen throughout experiment.\nPrepare 200 mL slicing solution by adding 1 mM kynurenic acid to ACSF. Sonicate solution in a sonicating water bath for 10 min until kynurenic acid is dissolved. Continuously bubble with carbogen and place on ice.",
    "CAUTION: Use appropriate personal protective equipment when handling kynurenic acid.\nMount an appropriate blade in the vibratome following the manufacturer’s instructions. Chill vibratome slicing chamber by surrounding it with ice.\n2. Brain removal with intact auditory nerve root for stimulation\nNOTE: Mice for these experiments were obtained by crossing ChAT-IRES-Cre transgenic mice on a C57BL/6J background with tdTomato reporter mice (Ai14). Mice used for histology and electrophysiology were post-hearing onset (P14-P23), which is around P12 in mice. Neurons expressing tdTomato in the ventral nucleus of the trapezoid body (VNTB) have been previously characterized as MOC neurons in this mouse line57.\nEuthanize (e.g., CO2 asphyxiation) and decapitate the animal using approved institutional procedures.\nUsing a razor blade, cut the skin at the midline of the skull from the nose to the back of the neck. Peel back skin to expose the skull.\nUsing small scissors, make an incision in the skull through the midline starting at the base (caudal end near spinal cord) of the skull and continuing towards the nose.\nAt the lambda suture, make cuts in the skull from the midline, lateral toward the ear on both sides. Peel back the skull to expose the brain.\nStarting at the rostral end, gently lift the brain away from the skull with a small lab spatula or blunt forceps. Cut the optic nerve and continue to gently work the brain backwards, exposing the ventral surface.\nCut the trigeminal nerves by pinching them with fine forceps near the ventral surface of the brainstem.\n\tNOTE: Do this carefully as the vestibulocochlear nerve lies just below this and needs to be intact for eventual stimulation.\nPlace the preparation in a glass Petri dish filled with cold slicing solution. Place the dish under a dissecting microscope. Gently bubble with carbogen.",
    "Trim the facial nerve close to the brainstem and expose the vestibulocochlear nerve.\nUsing fine forceps, push the tips into the foramina where the vestibulocochlear nerve exits the skull as far as possible and pinch the nerve to sever it, leaving the nerve root attached to the brainstem. Repeat this on the other side.\nOnce both nerve roots are free, remove the meninges and vasculature from the ventral surface of the brainstem near the trapezoid body.\nFree the brain completely from the skull by pinching the remaining cranial nerves and connective tissue taking care to preserve the remaining spinal cord if possible.\n3. Block and mount brain on stage (magnetic disc)\nPrepare the surface of the brain to fix to the stage by blocking the brain at the level of the optic chiasm.\n\t\nWith the ventral surface up, stabilize the brain using a blunt tool to gently immobilize the spinal cord so that the brain does not tilt during the following step.\nAt the level of the optic chiasm, use open forceps to create the plane for blocking the brain by inserting through the brain down to the bottom of the dish. Insert the forceps at an angle of approximately 20˚ from vertical so that the tips exit the dorsal surface of the brain caudal to the optic chiasm.\nCut along the forceps using the razor blade.\nGlue the brain to the surface of the stage.\n\t\nPrepare a small block (~1 cm3) of 4% agar for supporting the brain.\nPlace a small drop of glue on the stage and spread it into a rectangle so both the brain and agar block can be glued down.",
    "Using forceps, carefully lift the brain and gently dab the excess liquid using the edge of a paper towel. Place the blocked surface onto the glue, ventral surface will be towards the blade during slicing.\nPush the agar block gently against the dorsal surface of the brain to support it during slicing and to ensure proper brain positioning (i.e., angle).\n4. Slice brain to create wedge slice\nNOTE: Prepare a brain slice using vibratome that has the cochlear nerve root on the thick side and medial olivocochlear (MOC) neurons and the medial nucleus of the trapezoid body (MNTB) on the thin side.\nPlace the magnetic disc with attached brain onto the stage base and place it in the slicing chamber with the ventral surface of the brain oriented towards the blade.\nFill the chamber with ice cold slicing solution and bubble with carbogen.\nLower the blade into the solution and cut slices caudal to the region of interest to make sure the slices are symmetrical. If the slices appear asymmetrical, tilt the stage slightly to obtain symmetry.\n\tNOTE: Blade speeds between 0.05-0.10 mm/s were effective for cutting healthy slices and may vary depending on animal age and brain region.\nOnce the slices are symmetrical, shift the stage ~15˚ (corresponding to approximately 3 concentric rings on the stage base) to one side.\n\tNOTE: Shift the stage away from the auditory nerve root that you want to preserve in the slice.\nContinue slicing carefully until the auditory nerve root is close to the surface on one side, and the facial nerve can be seen at the surface of the other side.\nShift the stage back 15˚ to the original position.",
    "Move the blade away from the tissue and spin the stage base 90° so that the lateral edge of the thin side is facing the blade. Lower the blade several hundred microns and then slowly bring the blade close to the edge of the tissue. Repeat this until the blade touches the lateral edge. Lower the blade to the desired thickness of the thin edge of the slice, here an additional two hundred microns.\n\tNOTE: The resulting slice is ideally ~300 mm thick at the level of the ventral nucleus of the trapezoid body (VNTB) on the side where patch clamping will take place.\nMove the blade back away from the tissue and spin the stage base back so that the ventral surface is facing it.\nMake the cut that designates the rostral surface of the wedge slice. Transfer the slice to a piece of interface paper (1 cm2) caudal surface down. Move the slice to the incubation chamber or other suitable incubation apparatus for recovery (30 min at 35 °C).\n\tNOTE: The facial nerve should be visible on both hemispheres of the slice on the rostral surface (see Figure 1B).\n5. Electrophysiology set-up and recording\nPlace the wedge slice in the recording chamber and secure slice with a harp or stabilizing system. Perfuse the tissue continuously at a rate of 7-10 mL/min with warm (35 °C) ACSF bubbled with carbogen.\nIdentify genetically labeled MOC neurons in the VNTB using epifluorescence with 561 nm emission filters for patch-clamp recordings. Flip slice if there are no potentially patchable cells.\nUsing DIC optics, focus on the auditory nerve root on the thick side of the slice and use a micromanipulator to move the bipolar tungsten stimulating electrode down to the auditory nerve root and gently into the surface of the tissue.",
    "NOTE: Suction electrodes have been used in auditory nerve stimulation experiments in other labs. Theta glass electrodes, or optical stimulation methods can be employed if applicable to other specific preparations.\nMove the field of view back to the VNTB to choose an MOC neuron to target for patch clamp electrophysiology.\nFill a recording pipette with appropriate internal solution for the proposed experiment.\nPatch and record from the MOC neuron in the whole-cell configuration. Compensate membrane capacitance and series resistance if required.\nAdjust electrical stimulation amplitude of the auditory nerve root to obtain consistent postsynaptic events in the MOC neuron.\n\tNOTE: It may be necessary to move the stimulation electrode.\nRun appropriate stimulation protocols to observe evoked synaptic currents in MOC (voltage clamp) or action potential patterns (current clamp).\n\tNOTE: The wedge slice preparation can be used with any typical patch-clamp tools such as loose patch recordings, pharmacology, optogenetics, calcium imaging, neurotransmitter uncaging, etc.\n6. Histological confirmation of brainstem nuclei\nNOTE: This is done with cresyl violet staining, in fixed, re-sectioned wedge slice. This method allows for visualization of nuclei which are contained in the slice.\nAfter preparing a wedge slice, submerge slice in fixative (4% PFA in PBS) overnight. Rinse the slice 3x for 10 min in PBS (room temperature on a shaker), then place in 30% sucrose in PBS overnight at 4 °C to cryoprotect.\nRe-section the slice on a freezing microtome (40-70 mm) and collect serial sections in a 24 well plate in PBS.\nMount sections on gelatin coated slides and let dry completely. Place slides in slide carriage.\nPrepare cresyl violet solutions\n\t\nPrepare 1% cresyl violet acetate by mixing 5 g cresyl violet acetate in 500 mL dH2O",
    "Prepare acetate buffer by first preparing 90 mL solution A (540 mL glacial acetic acid + 89.46 mL dH2O) and 10 mL solution B (136 mg sodium acetate in 10 mL dH2O). Combine solution A and solution B yielding the acetate buffer.\nCombine 1% cresyl violet acetate with the acetate buffer 1:1 for 0.5% cresyl violet in acetate buffer. Filter before use.\nPrepare 95% and 70% ethanol by diluting 100% ethanol with appropriate volumes of dH2O\nPerform cresyl violet staining protocol. Move the slide carriage through solution trays, blotting excess solution on a paper towel between trays: xylene – 5 min; 95% ethanol – 3 min; 70% ethanol – 3 min; dH2O – 3 min; 0.5% cresyl violet solution – 8-14 min monitoring frequently until nuclear staining becomes dark purple; dH2O – 3 min; 70% ethanol – 3 min; 95% ethanol – 1-2 min; 100% ethanol – dip slides twice; xylene – 5 min; xylene: 25 min until mounting is performed.\n\tCAUTION: Use xylenes only under a fume hood.\nRemove slides from xylene one at a time and immediately place cover slips on slides using mounting medium. Allow mounting medium to dry (overnight).\nImage sections.\n7. Biocytin labeling for anterograde tracing of axons in live, unfixed tissue\nPrepare a wedge slice as above (Steps 2-4).\nTransfer the slice to interface paper (~1 cm2). Under a dissecting microscope, locate the CN on the thick side of the slice.\nCarefully remove excess ACSF from the area surrounding the slice by twisting up a corner of a tissue paper to draw the ACSF away from the tissue. This prevents the biocytin from spreading to surrounding areas of the slice which could lead to uptake into cells outside the CN.",
    "With fine forceps, select a small crystal of biocytin and place it on the surface of the CN. Gently press the crystal into the tissue to promote contact with neurons and subsequent uptake into somata. Repeat this step to cover the desired region of interest, in this case CN regions containing T-stellate and GBC neurons.\nPlace the slice in an incubation chamber. Allow the slice to incubate for 2-4 h at 35 °C to allow for the uptake and transport of the biocytin. After incubation, rinse the slice in ACSF to remove any biocytin particles.\nPlace slice in fixative (4% PFA in PBS) overnight. Rinse 3x for 10 min in PBS.\nCryoprotect slice in 30% sucrose in PBS overnight at 4 °C or until the slice sinks.\nResect the tissue to produce transverse sections on a freezing microtome at 70-100 mm.\nProcess tissue using standard immunohistochemical methods with a fluorescently conjugated streptavidin.\n\tNOTE: Additional immunohistochemistry can be performed on the sections if helpful for labeling presynaptic cell bodies, axons, receptors, or other synaptic molecules important for circuit visualization (i.e., primary antibody steps should not adversely affect biocytin secondary visualization).\nImage the tissue.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}