{
  "id": 3078,
  "origin_website": "Cell",
  "title": "TissUExM protocol for ultrastructure expansion microscopy of zebrafish larvae and mouse embryos",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe steps from embryo rehydration to gelation are specific to TissUExM.1[href=https://www.wicell.org#bib1] From the denaturation step, gel handling is similar to U-ExM2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3] but the incubations time and solution volumes are scaled up for whole embryos.\nEmbryos rehydration and anchoring – Day 1\nTiming: 1 h preparation, 3 d incubation\nStored embryos are first rehydrated to reach a near-native fixed state in PBS. The anchoring step consists in anchoring acrylamide (AA) to primary amines from the sample.\nEmbryos rehydration in a 2 mL tube, at RT, with orbital agitation.\n5 min in 500 μL 75%–25% methanol-PBS.\n5 min in 500 μL 50%–50% methanol-PBS.\n5 min in 500 μL 25%–75% methanol-PBS.\n5 min in 500 μL PBS.\nIndividual embryo anchoring.\nUnder a fume hood, prepare 1 mL of the anchoring solution in a 1.5 mL Epi-tube, aiming for 500 μL/embryo. Vortex.\ntable:files/protocols_protocol_2653_16.csv\nCoat a plastic pipette with PBS-Tween 0.1% (PBS-T).\nTransfer each embryo to an empty 2 mL tube. Remove the excess of liquid.\nAdd 500 μL of crosslinking solution to each embryo.\nSeal the tube with parafilm. Invert multiple times.\nPlace at 37°C for 72 h. Gently invert the tube occasionally.\nCritical: It is crucial that AA is evenly distributed and reaches all the tissues of the embryo. This will affect the embedding homogeneity in the following next step. The volume of anchoring solution should be in excess compared to embryo size. If larger samples are used, do not hesitate to scale up the volume and incubation time.\nGelation preparation – Day 4\nTiming: 30 min preparation, overnight incubation\nThis step allows a first penetration of the gelation components in the tissues, prior to the rigidification of the gel matrix.\nEmbryos wash.\nUnder a fume hood, remove the crosslinking solution.",
    "Rinse 3 × 5 min with 500 μL of PBS-T at RT with orbital agitation.\nGelation preparation.\nUsing a plastic pipette coated with PBS-T, transfer each embryo to a clean 2 mL tube.\nAdd 90 μL of inactivated monomer solution (MS).\nIncubate overnight at 4°C.\nGelation chamber preparation.\nPlace one clean layer of parafilm on the top part of the gelation chamber (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2653-Fig1.jpg\nFigure 1. How to prepare the gelation chamber\n(A) Place a clean parafilm on the lid and humidify the paper with water on the bottom part.\n(B) Put the closed box at −20°C overnight.\nAnnotate the parafilm if necessary.\nHydrate the tissue paper on the bottom part with ddH20.\nClose and place the box at −20°C overnight (Figure 1[href=https://www.wicell.org#fig1]B).\nGelation – Day 5\nTiming: 4 h\nThis step requires careful handling of the sample, to determine embryo orientation and ensure gel integrity. The processing should not take more than 30 min. Every step should be performed rapidly and precisely. We suggest preparing the gelation station (binocular, gelation chamber, tweezers, coverslips, …) in advance, with every tool ready to minimize waiting times (Figure 2[href=https://www.wicell.org#fig2]A). The inactivated MS should be thawed shortly before use. During activation, keep the MS tube open and vortex between each step. Rapidly place the activated solution onto the dried embryos (Methods video S1[href=https://www.wicell.org#mmc1], Embedding, related to step 2).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2653-Fig2.jpg\nFigure 2. How to prepare the gelation\n(A) Gelation station with binocular, lid of the gelation chamber, pair of tweezers and coverslips ready-to-use.\n(B) Inset on the two embryos placed directly on the parafilm.\n(C) Ice box to thaw gelation activators. On the left side, PBS and 4OH-tempo do not require fast addition. On the right side, TEMED and APS must be pipetted fast. Vortex with tube open after adding each component.",
    "(D) Inset on two embryos covered by a gelation drop and coverslips, to be incubated for gel polymerization.\nActivators preparation.\nTo prepare two gels, thaw one aliquot of ∼3.5 μL of 4OH-TEMPO, one aliquot of ∼3.5 μL TEMED and one aliquot of ∼3.5 μL APS.\nEmbryos wash.\nFrom the tubes at 4°C, remove the inactivated MS solution.\nRinse 3× with 500 μL PBS-T with orbital agitation.\nEmbryos orientation.\nTake the gelation chamber out of −20°C. Place the bottom part with parafilm under a binocular microscope.\nWith a plastic pipette coated with PBS-T, transfer each embryo onto the parafilm, in the smallest volume possible (Figure 2[href=https://www.wicell.org#fig2]B).\nMonomer solution activation.\nThaw one aliquot of inactivated MS.\nRapidly add directly to the tube and in this order: 3 μL PBS, 2 μL 4OH-TEMPO, 2.5 μL TEMED, and 2.5 μL APS. Vortex between each addition (Figure 2[href=https://www.wicell.org#fig2]C).\nEmbryos gelation.\nRapidly remove the excess liquid from the embryo.\nAdd 45 μL of activated gelation solution to each embryo.\nReorient the embryo with a lash if necessary. Place it in the center of the drop. Pop the bubble if any. Let the embryo stabilize.\nFlip a 12 mm coverslip on each embryo, making sure it did not slide to the edge. Replace the coverslip if necessary (Figure 2[href=https://www.wicell.org#fig2]D).\nWait 5 min for stabilization. Close the gelation chamber and gently place it at 4°C.\nIncubate 1 h.\nGently transfer the entire box from 4°C to 37°C.\nIncubate 2 h, troubleshooting 1[href=https://www.wicell.org#sec6.1].\nOptional: Collagenase VII digestion.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Embedding, related to step 2: How to perform embedding",
    "For ZF larvae older than 3 dpf, place the gel in an Epi-tube containing 1 mL of 1000 U of Collagenase VII, diluted in calcium-containing buffer. Incubate 24 h at 37°C. The next day, wash 15 min in calcium-containing buffer and 15 min in PBS before proceeding to denaturation.\nNote: Individual embryos should not be on the edge of the coverslip, but rather in the center.\nCritical: Embryo orientation in the gel is determined from the moment the coverslip flattens the gelation drop. It will be impossible to change the orientation of the embryo after that step. Bubbles should be avoided. If bubbles are visible, you can remove the coverslip, place the embryo back in the center of the gelation solution drop and add a new coverslip.\nDenaturation – Day 5\nTiming: 15 min preparation, 3 d incubation\nThis step inhibits mechanical resistance generated by the specimen when the gel will expand. It is based on temperature and pH to denature the tertiary structures of proteins in the embryo. Only AA-anchored amines will remain, maintaining the relative position of each protein to one another. This step also includes delipidating, leading to the optical clearing of the embryo.\nGel detachment.\nSet a Thermoblock at 70°C.\nIn a 35 mm dish or a 6-well plate, add ∼2 mL of the denaturation buffer.\nUsing forceps, gently detach the coverslip and the gel from the parafilm.\nTransfer the coverslip and gel to the well with the denaturation buffer. The coverslip is placed downward so that the gel can detach and float in the denaturation buffer (Methods video S2[href=https://www.wicell.org#mmc2], Gel detachment, related to step 3).\nIncubate 10 min at RT with 100 rpm orbital agitation, troubleshooting 2[href=https://www.wicell.org#sec6.2].\nEmbryo denaturation.\nFor each embryo, fill a 1.5 mL Epi-tube with ∼1.2 mL of the denaturation buffer.",
    "Using a spatula, transfer each gel detached from its coverslip and place it in the tube. Complete with ∼100 μL to fill the tube (Methods video S3[href=https://www.wicell.org#mmc3], Transfer to tube, related to step 3).\nIncubate at 70°C for 72 h.\nNote: Denaturation buffer contains SDS, which is an irritant. Handle tubes with gloves and avoid spilling when closing the tube.\n    Your browser does not support HTML5 video.\n  \n      Methods video S2. Gel detachment, related to step 3: How to detach the gel from the gelation chamber\n    \n    Your browser does not support HTML5 video.\n  \n      Methods video S3. Transfer to tube, related to step 3: How to transfer the gel in a tube for denaturation\n    \nGel equilibration and control – Day 8\nTiming: 3 h\nThis step marks the end of gel preparation. We provide tips to control gel integrity and trimming.\nGel equilibration.\nTake tubes out of the Thermoblock.\nPrepare 35 mm dishes or a 6-well plate and add ∼2 mL of denaturation-like buffer.\nUsing a plastic pipette, gently remove all the denaturation buffer, pipetting from the bottom of the tube, limiting contacts with the gel (Methods video S4[href=https://www.wicell.org#mmc4], Transfer from tube, related to step 3).\nTransfer the gel to the well.\nIncubate 15 min at RT at 100 rpm with orbital agitation.\nRemove the denaturation-like buffer and add ∼2 mL of PBS.\nIncubate 15 min at RT at 100 rpm with orbital agitation, troubleshooting 3[href=https://www.wicell.org#sec6.3].\nPause point: Gels can be stored in PBS at 4°C for a month from now. Consider adding 0.05% sodium azide to prevent from contamination.\nGel control.\nOption1, for beginners: ATTO 647N NHS-ester.\nPrepare a solution of ATTO 647N NHS-ester/PBS (1:2000).\nIn the gel-containing well, replace PBS with ATTO647N NHS-ester/PBS. Protect from light with aluminum foil.",
    "Incubate 2 h at RT at 100 rpm with orbital agitation (or 16–72 h at 4°C, with optional shaking).\nReplace with PBS and verify embryo integrity within the gel, with or without a binocular, troubleshooting 4[href=https://www.wicell.org#sec6.4].\nIf validated, proceed to trim, as described in section 17.\nNote: This step is not compatible with further antibody staining, as most epitopes will be masked by the dye. The fish will become blue and visible directly by eye in the gel.\nOptional: Blocking.\nIf future antibody staining requires a blocking step, it is possible to perform it along DAPI labeling, for 2 h at RT. By default, we use the following blocking solution:\ntable:files/protocols_protocol_2653_17.csv\nFilter (0.45μm) and keep at 4°C for 6 months.\nPause point: Gels can be stored in PBS at 4°C and protected from light, for 2–3 weeks.\nOption2, routine.\nPrepare a solution of DAPI/PBS (1:2000).\nIn the gel-containing well, replace PBS with DAPI/PBS, Protect from light with aluminum foil.\nIncubate 2 h at RT at 100 rpm with orbital agitation.\nReplace with PBS.\nMeasure the gel diameter. The diameter should consistently be between 26-30 mm.\nOptional: Place the gel in an Attofluor chamber with a 24 mm coverslip if controlled is performed with an epifluorescence microscope,\nControl embryo positioning and orientation in the gel, troubleshooting 5[href=https://www.wicell.org#sec6.5].\nOptional: Trimming.\nIf antibody concentration or cost is a limiting factor, it is possible to trim the gel at that step and reduce its size to fit in a smaller well (2 mL in a 6-well plate, 1 mL in a 12-well plate). However, we recommend beginners to not trim, as the gel can be more difficult to extract from a 12-well format). If trimming is chosen, please refer to section 17.",
    "Pause point: Gels can be stored in PBS at 4°C and protected from light, for 1–2 weeks.\n    Your browser does not support HTML5 video.\n  \n      Methods video S4. Transfer from tube, related to step 3: How to extract the gel from the tube\n    \nImmuno-labeling – Day 8\nTiming: 1 week, including 2 × 4 h of preparation and 4 + 3 d of incubation\nThis step consists of the immunofluorescence, as for cleared samples. We use passive labeling, but other groups have described active labeling options based on the electrophoresis of the antibodies.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5]\nAntibody staining.\nTransfer individual gels in a 6-well plate or individual 2 mL tubes, depending on incubation limitations.\nIncubate each gel in 2 mL PBS-BSA 2% or blocking buffer with primary antibodies. The default dilution is 1:100. Incubate 4 d at 37°C and 100 rpm orbital agitation. We suggest using a shaking incubator with temperature controlled.\nWash 3 × 45 min with PBS-T at RT at 100 rpm with orbital agitation.\nIncubate each gel in 2 mL PBS-BSA 2% with secondary antibodies. The default dilution is 1:250. Incubate 3 d at 37°C and 100 rpm orbital agitation. We suggest using a shaking incubator with temperature controlled.\nWash 3 × 45 min with PBS-T at RT with 100 rpm with orbital agitation.\nReplace the last washing solution with 2 mL of PBS.\nStaining control.\nPlace individual gels in an Attofluor chamber.\nControl staining efficiency using an epifluorescence microscope, troubleshooting 6[href=https://www.wicell.org#sec6.6].\nIf necessary, try to retain which orientation of the gel is optimal for visualization of the tissue of interest (= which side of the gel should be closer to the objective, if the working distance is limiting).",
    "Note: Samples will be brighter in PBS-state gels (∼2,2× expansion) than in water (4× expansion). We recommend beginners to stain for acetylated-tubulin or polyglutamylated-tubulin as centriolar markers, which are used as landmarks to control intracellular isotropic expansion.\nSecondary antibodies should be coupled to fluorophores that remain stable in water, such as Alexa 488, 555, or 568. For example, Rhodamine fluorescence is lost when placed in water.\nOptional: ATTO 647N NHS ester labeling, as in section 14.\nWe recommend beginners to add this step to visualize the embryo in the gel and trim it easily. Note that NHS ester labeling provides limited subcellular information combined with 4× expansion of whole embryos.\nTrimming.\nPlace individual gels on a parafilm.\nMeasure their individual diameter (value should be ∼26–30 mm) (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2653-Fig3.jpg\nFigure 3. How to handle the gel\n(A) ATTO 647N NHS-ester labeled gel, in PBS-state, measured prior to trimming.\n(B) Same gel measured after trimming.\n(C) Mounting set up on a plastic box covered with a parafilm and Attofluor chamber. Plastic scalpels and spatula allow gel handling. Kimwipe should be used to blot the excess water from the gel.\n(D) Same gel after water immersion, measured when fully expanded.\nTrim the gel excess to obtain a rectangle of ∼12–15 mm (Figure 3[href=https://www.wicell.org#fig3]B) (Methods video S5[href=https://www.wicell.org#mmc5], trimming, related to step 5).\nMeasure the new size for future calculation of the expansion factor.\nNote: As the gel is deformable and soft, trimming is not very precise. Prefer keeping an excess of gel rather than cutting too close to the embryo. Performing the trimming on a parafilm will ease the gel manipulation.\nPause point: Gels can be stored in PBS at 4°C and protected from light, for 1–2 weeks.\n    Your browser does not support HTML5 video.",
    "Methods video S5. Trimming, related to step 5: How to trim the gel\n    \nExpansion – Day 15\nTiming: 3 h minimum, overnight preferred\nThis step involves the physical and maximal expansion of the gel, to reach 4× expansion compared to its size at gelation.\nWater exchanges.\nUse a 6-well plate for trimmed gels smaller than 13 mm. For larger gels, use a bigger container, like a 100 mL or a 250 mL beaker.\nTransfer each gel and cover it with an excess of water.\nIncubate 1 h at RT, protected from light.\nReplace the water. Incubate between 1 h and 16 h, protected from light. We recommend overnight incubation whenever possible.\nReplace the water one last time. Incubate 1 h.\nPlace the gel on a parafilm and measure its final size (Figure 3[href=https://www.wicell.org#fig3]C).\nNote: Water-rehydrated is the most unstable state for antibodies and fluorophores. Expand only prior to imaging and prefer PBS immersion for storage.\nCritical: Do not let the gel dry, otherwise it will fragilize its structure, make it brittle, and eventually break. If the gel becomes opaque and porous during one of the transfer steps, rehydrate with a few drops of water. The gel should become translucent again instantly.\nMounting for imaging\nTiming: 10 min\nThis step is usually performed at the microscope once the optimal orientation of the gel has been defined. You will have to consider the working distance of the objectives, which can be a major limitation. We detail the mounting for inverted microscopes here. We recommend using Attofluor chambers for two reasons: 1/ PDL-coated coverslips can easily be prepared and replaced, 2/ the weight of the chamber helps stabilize the sample, compared to a plastic confocal dish. Mounting is a crucial step to prevent the gel from drifting while imaging.\nMounting.",
    "Prepare the mounting station with a parafilm, Kimwipes, and a spatula Figure 3[href=https://www.wicell.org#fig3]D).\nPlace a PDL-coated coverslip in the Attofluor chamber.\nWith a spatula, dry the gel on a Kimwipe by blotting it several times on a Kimwipe. It is essential to remove as much water as possible to favor grip on the coverslip.\nPlace the gel in the chamber. Press very gently if air bubbles are between the coverslip and the gel, troubleshooting 7[href=https://www.wicell.org#sec6.7].\nOptional: trim the corners of the gel if needed to close the chamber.\nAdd 1–2 drops of water on top of the gel. The gel is now ready to be imaged (Methods video S6[href=https://www.wicell.org#mmc6], mounting, related to step 5).\nCritical: Make sure the gel stays hydrated by adding a drop of water every ∼30 min during the imaging session. Artifacts such as sudden drift or fluorescent increase may mean that the gel is shrinking due to dehydration. In this case, rehydrate the gel and wait 5 min until the gel stabilizes before imaging more.\nNote: Once adherent to the PDL-coated coverslip, the gel will be difficult to detach. You can use a pipet to add water between the gel and the coverslip. When detaching, be very gentle not to break the gel.\n    Your browser does not support HTML5 video.\n  \n      Methods video S6. Mounting, related to step 5: How to mount the gel before imaging on an inverted microscope"
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Microscopy",
    "Model Organisms",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}