{
  "id": 7567,
  "origin_website": "Bio",
  "title": "Conditional Human BRD4 Knock-In Transgenic Mouse Genotyping and Protein Isoform Detection",
  "procedures": [
    "Part I: Genotyping Procedure NOTE: A downloadable Mouse Genotyping Excel spreadsheet[href=https://os.bio-protocol.org/attached/file/20220222/Genotyping%20and%20PCR%20Spreadsheet.xlsx] containing all the tables needed for organization and calculations in this procedure is attached to this protocol. Mouse Tail Tissue Acquisition – Day 0 A basic level of mouse maneuvering and husbandry abilities (e.g., scruffing, handling and restraining, sexing, mouse ear tagging, among others) is needed before performing this procedure.Start genotyping the mice around 2–3 weeks after birth, according to the regulations of your institutional ethics committee on animal experimentation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220330/20220330041111_8236.jpg Figure 4. MMTV-Cre mice have a light-yellow fur color due to a physically linked K14-Agouti cassette which codes for a 131-aa protein regulating pheomelanin (yellow pigment) production (Hustad, 1995).Decide which mice to genotype. NOTE: Typical Mendelian inheritance is observed with all genes mentioned in this procedure. Thus, a Punnett square is used to predict the genotypes of any potential offspring from each breeding pair, if the genotypes of its parents are already known. Mice that do not come from parents that are homozygous for a gene typically need to be genotyped, except for MMTV-Cre offspring, which exhibit a “yellow” coat when crossed with a mouse in a B6-WT background due to the K14-Agouti transgene that is jointly inherited with the MMTV-Cre gene (Yuan et al., 2011). Thus, these mice can be visually selected solely based on the color of their fur (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220330/20220330041327_2591.jpg Figure 5. Mouse tail tissue acquisition. (A) Microscissors, tweezers, and an ear-tag applicator. (B) Styptic powder. (C) Labeled PCR tubes. (D) Restrained and scruffed mouse with ear tag. (E) Length of a typical mouse tail. (F) Mouse tail snipping. (G) Length of a 2-mm mouse tail tissue sample. (H) Mouse tail covered with styptic powder. (I) Harvested mouse tail-tip sample.Tag the mice, if not already tagged (Figure 5A and 5D).",
    "Label a set of PCR tubes with each corresponding mouse’s tag number (Figure 5C). Restrain and scruff the mouse (Figure 5D). Using sharp surgical scissors, snip approximately 2 mm of the tail (Figure 5A, 5E–5G). Note: No more than 5 mm of the tail should be removed from each animal during its entire lifetime (see the ruler in Figure 5E, and the tail length in Figure 5G). Anesthesia should be used while obtaining tail-tip tissue from mice older than 28 days. Apply styptic powder to the end of the mouse’s tail to reduce bleeding (Figure 5B and 5H). Return the mouse to its cage.Use tweezers to place the tail clipping directly into its corresponding PCR tube (Figure 5I). Disinfect the surgical scissors with isopropyl alcohol.Repeat the above steps for all mice that need to be genotyped. Place the mouse tail samples at 4°C, if they are not going to be lysed immediately; if longer than a day, store them at -20°C for up to six months (avoid multiple freeze-thaw cycles). Prepare Lysis Reaction Working Solution – Day 1 For a 2-mm mouse tail tissue, 70 µL of Direct PCR Lysis Reaction (Tail) solution (see step C1 below) containing 0.4 mg/mL Proteinase K (see Recipes) is needed for each 0.2 mL PCR tube.Calculate the total amount of Direct PCR Lysis Reaction solution (Lysis Rxn Sol.) needed to lyse all the tail samples.e.g., 70 µL × 8 samples = 560 µL of Direct PCR Lysis Reaction Solution NOTE: Do not use Direct PCR Lysis Reaction solution that has been open for more than 1 year. Proteinase K is stable in Direct PCR Lysis Reaction solution for approximately 24 h. For every 1 mL of Direct PCR Lysis Reaction solution, 20 µL of Proteinase K solution is needed.",
    "Calculate the total amount of Proteinase K solution needed, based on the total amount of Direct PCR Lysis Reaction solution. NOTE: If frozen Proteinase K solution is used, thaw the solution in a 37°C water bath and invert intermittently to suspend the precipitated SDS into solution. Wait until the SDS has been re-dissolved into solution – which will become clear – before adding it to the Direct PCR Lysis solution.e.g., (560 µL Lysis Rxn Sol.)((1 mL Lysis Rxn Sol.)/(1000 µL Lysis Rxn Sol.))((20 µL Proteinase K Sol.)/(1 mL Lysis Rxn Sol.))=11.2 µL of Proteinase K Sol. Add the total amount of Proteinase K solution calculated above to the total amount of Direct PCR Lysis Reaction solution to prepare the Lysis Reaction Working solution.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220330/20220330041455_0564.jpgLyse the Tail-Tip Tissues – Day 1Add approximately 70 µL of the Lysis Reaction Working solution to each snipped mouse tail.Incubate each sample in the thermal cycler at 55°C for 12 h (step 1), followed by 85°C for 45 min (step 2), and then hold at 4°C or 12°C (depending on the default temperature for the specific PCR machine, step 3). Note: Complete tail tissue lysis is important. If some tail tips are not fully in contact with the solution, reposition the samples by gently tapping each PCR tube. The lysed tail samples can also be kept at 4°C overnight before PCR analysis.Process Crude Tissue Lysate – Day 2 Take the samples out of the thermal cycler and precipitate any remaining debris by centrifugation at 123 × g for 1 min.Label a new set of 1.5 mL microcentrifuge tubes with each mouse’s tag number.Transfer the crude lysate to the labeled microcentrifuge tubes.Note: Make sure not to pipette any of the mouse tail tissue debris with the lysate.",
    "If not immediately used, store the lysates at 4°C for up to one week, or at -20°C for up to six months.Note: Some of the components in the Direct PCR Lysis Reaction solution may interfere with PCR, especially during hBRD4-S gene amplification. To increase the PCR product yield, particularly for hBRD4-S, the crude lysate can be diluted 10-fold with nuclease-free water and then used for PCR. If PCR fails, the stored crude lysate solution can be used to re-start the procedure from this step.Primer Selection – Day 2 Decide the total number of PCR samples needed to genotype each mouse. Refer to Section A2 regarding which mice need to be genotyped. These criteria will also dictate which genes need to be confirmed by PCR.In general, mice that do not come from parents that are homozygous for a gene will need to be genotyped for the presence of that gene; the exception being mice that have “yellow” coats indicating the presence of the MMTV-Cre gene (see Figure 4; Yuan et al., 2011).To properly determine the zygosity of the BRD4-L and BRD4-S transgenes (if both the parents are not homozygous for either hBRD4 isoform, and the offspring have the potential of being heterozygous for either BRD4 transgene allele), PCRs with BRD4-L or -S primer pairs are used to confirm knock-in, and then further validated by another PCR with the Rosa26 primer pair. Interpretation of the Rosa26 PCR results is as follows:For mice with homozygous hBRD4-L/L, hBRD4-S/S, or heterozygous hBRD4-L/S, no Rosa26 DNA band will appear in the agarose gel when the Rosa26 primer pair is used (Figure 3B, Rosa26 gel).",
    "For mice without BRD4-KI, or heterozygous Rosa26 mice with one copy of the BRD4 transgene, a Rosa26 PCR band will appear in the agarose gel when the Rosa26 primer pair is used (Figure 3B, Rosa26 gel).An optional BRD4-Pan primer pair can be used to confirm/exclude the presence of either BRD4 transgene, along with the Rosa26 primer pair (Figure 3B, hBRD4-Pan gel).PCRs with the MMTV-PyMT primer pair (Reference 18) are always included to confirm the presence of the MMTV-PyMT gene, because all our PyMT breeders carry only one copy of the MMTV-PyMT gene (Figure 3B, MMTV-PyMT gel).Positive and negative control samples with known genotypes need to be included for each PCR primer pair.Master Mix Solution Preparation – Day 2The Master Mix solution for all primers is a mixture of 7.5 µL of 2× SYBR® Green mix, 1.5 µL of the respective PCR Primer Working solution (at a concentration of 5 µM; see Recipes), and 5 µL of nuclease-free water, for a total volume of 14 µL of Master Mix solution in each PCR tube (Table 3). Note: The reagents used to make the Master Mix are relatively unstable and should always be kept on ice. To avoid contamination, the Master Mix should never be prepared directly from the original reagent containers, but rather from an already aliquoted secondary container. It typically takes about 30 min to thaw all the reagents on ice. After thawing, remember to always vortex (or invert) before aliquoting.Table 3. Sample Mouse Genotyping Matrix illustrating one way to organize the total number of PCR tubes needed to genotype several different types of transgenic mice. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220330/20220330041722_8007.pngIn this example, 8 transgenic mice are being genotyped. The green font indicates the PCR tube is optional.",
    "Note: The BRD4-Pan primer pair can be used to confirm the presence of the BRD4-L and/or BRD4-S isoforms. In general, the MMTV-Cre PCR tube is optional, as mice carrying the MMTV-Cre gene exhibit a “yellow” coat when crossed with a mouse in a B6-WT background (Yuan et al., 2011) and thus can be visually selected without the need for genotyping (see Figure 4). Calculate the amounts of each reagent needed to prepare each respective Master Mix, as shown in Table 3. Remember to consider approximately 10–30% more solution volume for a margin of error.To aid in organization and sample calculation, a mouse genotyping Excel spreadsheet[href=https://os.bio-protocol.org/attached/file/20220222/Genotyping%20and%20PCR%20Spreadsheet.xlsx] is set up in Microsoft Excel as shown in Table 4, with the PCR Master Mix calculations illustrated in Table 5.Table 4. Mouse Genotyping Matrix spreadsheet.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220330/20220330044435_9210.pngTable 5. PCR Master Mix spreadsheet for sample calculation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220330/20220330043625_1867.png Total up the amounts needed for each reagent, and verify that all reagents are present in sufficient quantities before advancing.Prepare each Master Mix solution.Label a new set of PCR tubes with the corresponding tube numbers from the Mouse Genotyping Matrix (Table 3).For each primer set, add 1 µL of crude lysate to the bottom of each PCR tube, followed by the addition of 14 µL of Master Mix solution. This order of addition helps distinguish added from unadded samples.Repeat the same steps for all other primer sets.Store any remaining crude lysate at -20°C for up to six months.Note: If PCR fails, the stored crude lysate solution can be used to re-start the reaction. Making aliquots helps avoid sample degradation caused by multiple freeze-thaw cycles. Centrifuge the samples at 123 × g for 1 min in the Allegra X-22R centrifuge at room temperature (RT).",
    "Polymerase Chain Reaction (PCR) – Day 2For BRD4 transgene detection, set the PCR protocol to 94°C for 3 min (step 1), 94°C for 10 s (step 2), 60°C for 30 s (step 3), and 72°C for 30 s (step 4). Repeat steps 2–4 for 35 cycles. Finish the protocol sequence at 72°C for 3 min, and then hold at 4–12°C. Note: Step 1 – 94°C for 3 min – is to increase DNA denaturation and heat-activate the Sso7d fusion DNA polymerase included in the Universal SYBR® Green Supermix.  Load all PCR tubes for BRD4 transgene amplification into the thermal cycler.Press Run, set the PCR volume to 15 µL when prompted by the instrument, and then press OK.Perform PCR for the other samples using another thermal cycler with the settings as described in step G1, but repeat steps 2–4 for 40 cycles.This PCR procedure will take approximately 1.5 h to finish.If not for immediate use, place the finished PCR samples at 4°C for up to one week, or at -20°C for up to six months.Note: Sections H through N, included below for beginners, are not specific to this procedure and may be replaced by your own lab protocols. Prepare Agarose Gel Solution – Day 3Weigh out approximately 3.0 g of agarose, add it to 200 mL of 1× TAE buffer (pH 8.3, see Recipes), and stir to make a 1.5% agarose solution.Note: This recipe is intended for a 15 × 25 cm gel-casting tray. Heat the solution in a microwave for approximately 3 min, or until the agarose is fully dissolved.Add 15–20 µL of a 5 mg/mL solution of ethidium bromide (see Recipes) to the agarose solution.Let the solution stir at RT until lukewarm.",
    "Gel Casting – Day 3Use tape to cover the ends of the gel-casting tray, making sure to seal the outer edges.Evenly place four 15-well combs (for a total of 60 wells) into the gel-casting tray.Pour all the 1.5% gel solution into the gel-casting tray – enough so the solution reaches a height of 0.6–0.8 cm from the bottom.Remove any bubbles and evenly distribute the liquid.The gel takes approximately 20–25 min to set.Gel Loading – Day 3Remove the tape from each side of the gel-casting tray and place the tray in an electrophoresis tank.Remove the gel-casting combs and submerge the gel in 1× TAE buffer (pH 8.3). If not for immediate use, place the gel slab in 1× TAE buffer (see Recipes), and store at 4°C.Take the PCR samples from the refrigerator, and add 3 µL of 6× gel-loading dye to each sample.Load samples in groups, each with the 1 kb Plus DNA ladder in the beginning lane, and positive and negative controls in the last two lanes of each PCR primer group. Skip a well after each primer set and start loading the following set of samples. Normally, 8 µL of DNA ladder and 10 µL of each PCR sample is enough to produce prominent bands in the gel; however, this amount can vary depending on the amount of the PCR product produced.After loading the samples, connect the black/cathode (-) and red/anode (+) cables to the electrophoresis tank, and turn on the power supply. The current in the gel runs from cathode to anode (black→red) – the same direction the DNA samples migrate through the gel. Be careful not to switch the electrode power cables.Set the voltage (V) to 150 volts – the amperage (A) will then change to 2.",
    "00 A – and let the gel run for 30–45 min, or until the two dyes in the sample loading buffer are well separated.Gel Imaging – Day 3Take the gel out of the gel-casting tray and submerge it in distilled water.Turn on the BioSpectrum AC Image System, if not already on.Open the unit and clean the glass with 70% ethanol (see Recipes).Place the gel on the surface of the gel scanner and close the door.Launch the VisionWorks program and log in.Under the Lighting tab, turn the transillumination device onto UV light.Press Acquisition and Preview.Under the Lighting Tab, adjust the Zoom and Focus to sharpen the image.Under the Camera tab, adjust the exposure time (minutes and seconds) to change the intensity of the image.Press Capture to get the image.Under the Edit tab, rotate the images.Press Align to further adjust the angle, then crop the image.Click File and Save As.Save the image with the following format: DD MM YY, Initials, Mouse Genotyping Gel #.Gel Disposal – Day 3Due to the toxicity of ethidium bromide, any gel containing this chemical should be disposed of in an approved waste container.Gel Processing – Day 3Using Adobe PhotoshopNote: ImageJ may be used instead of Adobe Photoshop to process the gel images. Open the scanned image in Adobe Photoshop. Under the Image panel, click on Image Rotation to properly orient the image. For 180 degrees, click 180°. For a particular angle, click Arbitrary.After proper orientation, click on the Image tab and then Mode; and click Greyscale.A pop-up box with Disregard Changes will come up, so click Discard.In the pane to the right, click Adjustments and select Invert.Toggle the contrast and brightness of the image under the Adjustments panel by clicking Brightness/Contrast.Save the image as a JPEG or TIFF file.",
    "Microsoft PowerPointPlace the black-and-white gel images from Adobe Photoshop into PowerPoint and label the gel lanes with the proper PCR tube numbers from the Mouse Genotyping Matrix (Table 3).Label the names of each primer set, positive control (P), negative control (N), and the molecular weight markers (M) where they correspond.Gel Interpretation – Day 4Refer to Figure 3B as a guide for proper band identification.Read the results for each PCR tube as laid out in the Mouse Genotyping Matrix (Table 3).Record the genotype of each mouse.Tumor Dissection & Tissue Processing for Western Blotting Tumor DissectionEuthanize the tumor-bearing mouse (Figure 6A and 6B). Collect extra tail tissue for backup genotyping, and store at -20°C.Make a 5-mm horizontal incision at the top of the mouse’s abdomen, using microscissors to pierce the mouse’s skin (Figure 6C).Pull the skin below the incision caudally to expose the abdominal-pelvic cavity (Figure 6D).The tumors will be located in the fat pad tissue surrounding the peritoneum (Figure 6E).Remove the tumors from mammary fat pads #4 and #5, being careful not to take any of the surrounding tissue (Figure 6F). Note: Avoid rupturing any veins and arteries, because the bleeding will make the procedure difficult (see Figure 6E).  Now pull the remaining skin above the primary incision cranially, until exposing the entire thoracic cavity (Figure 6G).The tumors will be located in the fat pad tissue attached to the posterior side of the skin flap (Figures 6H, I, and J).Remove the tumors from mammary fat pads #3, #2, and #1, respectively, being careful not to take any of the surrounding tissue (Figure 6K). Note: Avoid rupturing any veins and arteries because the bleeding will make the procedure difficult (see Figure 6G).",
    "Use an analytical balance to record the individual tumor weight and the aggregate tumor weight for all the mammary fat pad tumors (see Figure 6K).Place each of the tumors in labeled microcentrifuge tubes (with mouse tag number, mammary fat pad location, date, and sample type). If the tumor is too large to fit into the microcentrifuge tube, cut it into pieces and place it in the tube.Submerge the sample microcentrifuge tubes in liquid nitrogen to snap freeze the samples, and store them at -80°C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4374/bioprotoc-12-07-4374-g006.jpgFigure 6. Mouse mammary PyMT tumor acquisition. (A) CO2 euthanasia system. (B) Euthanized mouse with mammary fat pads #1–5 labeled. (C) Mouse with incision located at its midline. (D) Mouse with a skin flap below the midline incision pulled caudally to reveal the peritoneum. (E) Abdominopelvic tumors. (F) Harvested PyMT tumors from mammary fat pads #4 and #5. (G) Mouse with a skin flap above the midline incision pulled cranially to reveal the thoracic cavity. (H) Mouse with the superior anatomical right side exposed to reveal mammary fat pad tumors #1–3. (I) Mouse with the superior anatomical left side exposed to reveal mammary fat pad tumors #1 and #2. (J) Mouse with the superior anatomical far left side exposed to reveal mammary fat pad tumors #2 and #3. (K) Total mammary fat pad tumors harvested. Abbreviation: MFP, mammary fat pad; L, left; R, right.Tumor ProcessingTake the frozen samples out of -80°C and place them in dry ice.Transfer the frozen tissue to a CKMix tissue homogenization tube (2 mL), and add mRIPA (400 mM) buffer (see Recipes – important to properly dissociate BRD4 from chromatin).Note: Add approximately 0.2–0.3 mL of mRIPA (400 mM) solution to each 40–60 mg tumor sample, enough to immerse the whole tissue. Homogenize the tumor tissues with the PreCellys Evolution Tissue Homogenizer.",
    "Turn on the PreCellys Evolution Tissue Homogenizer.Fill the top of the machine with dry ice and close the lid.Go to the Home Screen and select the Soft Protocol (with the following specifications: Tube Volume – 2 mL; Rotation Speed – 5,800 rpm; Cycle – 2 × 15 s; Pause – 30 s; Cryolysis – On; Temperature – 4°C; and Mode – Auto), Start, and press OK.Note: If a pressure error occurs, take all the samples out of the instrument and run the protocol again without samples; this should de-pressurize the machine. Alternatively, remove the dry ice chamber atop the machine and shake it, allowing the machine to de-pressurize. Make sure the samples are fully homogenized (i.e., no large tumor chunks are visible in the liquid). If not, run the Soft Protocol again.Once finished, leave the lid on halfway to let the dry ice evaporate in the cooling chamber, and turn off the machine.Place the samples on ice.Transfer the samples to a set of labeled, 1.5-mL microcentrifuge tubes. Take as much liquid as possible from each homogenized sample.Note: Be careful not to transfer any of the beads or residual mammary fat to the new sample tubes, as this can interfere with assay performance. Centrifuge the samples at 20,000 × g and 4°C for 30 min.After centrifugation, transfer at least 50 µL of supernatant to a second set of labeled tubes. Make additional 50–100 µL aliquots as needed.Keep one sample aliquot for each tumor sample to determine the protein concentration, snap freeze the remaining sample aliquots in liquid nitrogen, and store them at -80°C.Perform a Bradford assay to measure the approximate protein concentration of each sample aliquot. For this, prepare a 1x solution from the Bio-Rad Protein Assay Dye Reagent concentrate (5×) according to the manufacturer’s instructions.",
    "Note: For cell line samples, ~1 × 106 cells are washed with 1× cold PBS and lysed in a 2–5 fold volume of mRIPA (400 mM; see Recipes) buffer, and then mildly sonicated at 4°C (e.g., 3 pluses of 20% amplitude with a 1/8” microtip) to shear the genomic DNA and thus reduce viscosity for easy gel loading. The protein concentration of the cell lysate is determined by using the 1× Bio-Rad Protein Assay Dye Reagent.  For the Bradford assay calibration curve, prepare BSA protein standards with the 1× Bradford dye.Western Blotting Procedure Prepare 25–50 µg protein samples, from either cell line (see the preceding Tumor Processing section Note in Step B9), or PyMT tumor that has been homogenized using mRIPA (400 mM) buffer. For normal tissues, ~50 µg of protein sample are needed for endogenous BRD4-S detection.Cast 8% SDS-PAGE gels, or use 4–20% pre-made gradient gels.Load 5–10 µL of 5 mg/mL protein samples and pre-stained standards (usually 5 µL, depending on company sources).Perform gel electrophoresis. When using in-house 8% gels, start at 100V and then increase to 200V, once the pre-stained standards enter the resolving gel. Follow the manufacturer’s instructions for running pre-made gels.Cool the 1× Wet Transfer buffer (see Recipes) down to 4°C during gel running (important). Perform wet transfer using the Bio-Rad Mini Trans-Blot Module:When assembling the protein-transfer apparatus, be careful not to create bubbles in the 1× Wet Transfer buffer, as these will interfere with protein transfer and could possibly prevent proteins from transferring completely.Place the transfer cassette case on its clear side.Submerge one thin wet sponge in cold 1× Wet Transfer buffer and place it in the middle of the cassette.",
    "Next, submerge one thick piece of filter paper in cold 1× Wet Transfer buffer and place it on top of the sponge, making sure to center them as best as possible. Cut as needed.Use a roller to remove any air bubbles from the filter paper.Place one sheet of nitrocellulose membrane immersed in cold 1× Wet Transfer buffer on top of the filter paper and remove any air bubbles.Place the SDS-PAGE gel on top of the nitrocellulose membrane and remove any air bubbles. Note: Try to orient the SDS-PAGE gel as best as possible on the nitrocellulose membrane, being careful not to accidentally tear the gel. The best way to place the gel onto the nitrocellulose membrane is to let it swim atop the membrane in the 1× Wet Transfer buffer – in the liquid, the gel moves more freely. From there, jointly place both the membrane and the gel on the filter paper. Layer one more piece of thick filter paper immersed in cold 1× Wet Transfer buffer on top of the gel and remove any air bubbles.Finally, place one thin sponge immersed in cold 1× Wet Transfer buffer on top of the filter paper and close the cassette sandwich.Place the cassette in the apparatus so the black side of the cassette faces the black side of the protein transfer apparatus.Repeat the previous steps for any subsequent gels and then place an ice pack next to the black side of the protein transfer apparatus.Top off the protein transfer apparatus with any remaining cold 1× Wet Transfer buffer and place the apparatus at 4°C.Place the lid on top of the transfer apparatus and connect it to the power supply.Turn on the power supply and set the voltage to 50 V for 720 min (important).",
    "Press the Run button to start the wet protein transfer.Note: If done correctly, bubbles should be seen rising from the bottom of the buffer solution and the amperage should be around 0.25–0.30 Amp for two Western blots and 0.5–0.6 Amp for four Western blots. The apparatus will automatically turn itself off when finished.Remove the transfer device from 4°C and place each of the membranes in a solution of 5% skimmed milk diluted with 1x TBS-T buffer (see Recipes) at RT for 10 min.Note: Prior to milk blocking, an intermediate step can be included to check for the presence of bubbles that potentially block the transfer of protein from the gel to the membrane by brief staining (~2 min) of the blot in a 0.1% Reactive Brown 10 (or 0.01% Ponceau S) solution, followed by destaining with water. This additional step helps determine whether the experiment should be continued if most of the protein is not successfully transferred. Calculate the amount of each antibody and the diluent needed for dilution. Primary BRD4 antibodies: 1:2,000 for anti-BRD4-N (used to detect both BRD4-L and BRD4-S) and anti-BRD4-L antibodies, and 1:1,000 for the anti-BRD4-S antibody (e.g., add 3 µL of anti-BRD4-N antibody to 6 mL of 5% skimmed milk).Incubate the membrane in primary BRD4 antibody with gentle rocking at 4°C overnight (or 2 h at RT for detection of the more abundant BRD4-L protein).Following overnight incubation, take the blots out of 4°C, decant the 5% skimmed milk solution, and delicately remove any residual milk solution with four deionized water rinses.Decant the water from each blot, and replace it with 8–16 mL of 1× TBS-T buffer (see Recipes; the exact volume depends on the size of the chamber/tray used), allowing the membrane to float freely in the liquid.",
    "Let the blots rock at RT for 5 min.Wash all the blots with 1× TBS-T buffer, for a total of three times.Place the blots back in the 5% skimmed milk in 1× TBS-T solution, and add the secondary antibody at a 1:10,000–4,000 dilution (e.g., in 6 mL of 5% skimmed milk, add 0.6 µL of secondary antibody for a 1:10,000 dilution, and 1.5 µL of secondary antibody for a 1:4,000 dilution).Incubate the secondary antibody with gentle rotation on an orbital shaker at RT for 1 h.Decant the milk, and wash four times with deionized water, followed by four 1× TBS-T rinses, with a 5-min incubation in between as described in steps 10–13.After the final TBS-T wash, replace the solution with 1× PBS (pH 7.4), as this solution is more compatible with fluorescent signals (e.g., the Li-Cor Odyssey imaging system). Alternatively, add the ECL detection reagent, if using chemiluminescence detection by an X-ray film that is developed with the Konica tabletop film processor. Note: For low-abundant BRD4-S detection, use a high-sensitive ECL detection reagent, e.g., Thermo ScientificTM SuperSignalTM West Femto Chemiluminescent Substrate (Cat. #: PI34095).  Representative images of BRD4 protein isoform detection can be found in Figure 7.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4374/bioprotoc-12-07-4374-g007.jpgFigure 7. Western blots showing conditionally-induced human BRD4-S overexpression in three PyMT tumors from three representative Cre-expressing mice. PyMT tumors from three mice with no Cre expression are included as controls. Protein size markers (in kDa) are indicated on the left of each gel image."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}