{
  "id": 18024,
  "origin_website": "Jove",
  "title": "Clinical Protocol of Producing Adipose Tissue-Derived Stromal Vascular Fraction for Potential Cartilage Regeneration",
  "procedures": [
    "The approval and consent to report following case reports were waived by Myongji University Institutional Review Board committee (MJUIRB). Further, this clinical protocol was in compliance with the Declaration of Helsinki and regulation guidelines of the KFDA. For the procedures, informed consents were obtained from the patients.\n1. Liposuction\nNOTE: Perform with sterile technique.\nUse the following inclusion criteria: (1) MRI evidence of stage 3 OA; (2) either male or female; (3) over 18 years of age; (4) sufficient (100-110 g) adipose tissue for liposuction; (5) unwillingness to proceed with surgical intervention; (6) failure of conservative management; and (7) ongoing disabling pain.\nUse the following exclusion criteria: (1) active inflammatory or connective tissue disease thought to impact pain condition (i.e.,, lupus, rheumatoid arthritis, fibromyalgia); (2) active endocrine disorder that might impact pain condition (i.e.,, hypothyroidism, diabetes); (3) active neurological disorder that might impact pain condition (i.e.,, peripheral neuropathy, multiple sclerosis); (4) active pulmonary disease requiring medication usage; and (5) no history of steroid joint injections past 3 months.\nBring the patient into an operating room with a biohazard class A hood and place him (or her) in a supine position.\nClean the abdominal area of the patient with 5% betadine (povidone-iodine) and drape the patient using the sterile technique, exposing the cleaned area of the abdomen for liposuction.\nApproximately 5 cm infero-laterally from the umbilicus, anesthetize two sites (the one on the left and the other on the right side of the umbilicus) of incision to-be-made using 2 mL of 2% lidocaine without epinephrine with a (25 gauge, 1½ inch) needle in a 5-mL syringe by injecting each site at the epidermal level.",
    "Anesthetize the site of incision to-be-made using 5 mL of tumescent solution (500 mL of normal saline, 40 mL of 2% lidocaine, 20 mL of 0.5% bupivacaine, 0.5 mL of 1:1000 epinephrine) in a 10-mL syringe with a needle (25 gauge, 1½ inch).\nMake 2 incisions of 0.5 cm approximately 5 cm below the umbilicus laterally by pinching the skin to raise the depth of the subcutaneous level.\nUsing No. 11 blade, poke the raised skin to penetrate through to the subcutaneous level but not to penetrate through the abdominal wall.\nBy using 20 cm 16-gauge cannula, anesthetize the subcutaneous level of the whole lower abdomen area, which is to-be-liposuctioned, with 700 to 800 mL of the tumescent solution.\nAfter finishing infiltration of the whole lower abdomen with the tumescent solution, prepare a liposuction apparatus by connecting a 3.0 mm cannula connected to a 60 mL (or a 30 mL) syringe for manual liposuction or a specially designed 3.0 mm cannula connected to a centrifuge kit, a closed-system syringe for the purpose of keeping the sterility, connected to a vacuum machine for vacuum-assisted liposuction.\nPerform liposuction to obtain 100-110 g of adipose tissue excluding tumescent solution. When performing liposuction, adipose tissue will be obtained along with the tumescent solution, which should be separated and removed.\nTo separate the tumescent solution, first by gravity, transfer the adipose tissue in the centrifuge kit to a 60 mL syringe and place the syringe down (i.e., the portion of the syringe is at the bottom). By waiting 5-6 min, the adipose tissue and the tumescent fluid will be separated. Remove the fluid at the bottom of the syringe by pressing on the top part of the syringe plunger.",
    "Perform the above Steps 1.9-1.11 until a total of 100-110 g of adipose tissue (lipoaspirates) per knee has been accumulated.\n2. Preparation of ASC/ECM Mixture with Sterile Closed System\nAfter separating the tumescent solution by gravity and accumulating 50-55 g of lipoaspirates per each 60 mL centrifuge kit, a sterile closed system, place the 2 centrifuge kits into a centrifuge container bucket and spin at 1600 x g for 5 min, condensing the lipoaspirates and separating fluid from the adipose tissue. In this process of further condenses, the lipoaspirates may produce fatty oil in certain cases.\nBeing cautious not to shake, remove the safety cap and the plug at the bottom of the centrifuge kit.\nRemove the bottom fluid by slowly pressing down on the top of the plunger of the centrifuge kit.\nOn separate 60 mL syringe, dissolve 10 mg of collagenase (5 mg of collagenase specific for connective tissue24 and 5 mg of collagenase specific for adipose tissue25) with 50 mL of normal saline.\nMix approximately 25-30 mL of condensed lipoaspirate with dissolved collagenase (5 mg of collagenase specific for connective tissue and 5 mg of collagenase specific for adipose tissue) at a ratio of 1:1 (v:v) by connecting the 60 mL syringe to a centrifuge kit by using a specialized connector.\nThoroughly mix the condensed lipoaspirate and the collagenase by pushing the content between the 60 mL syringe and the centrifuge kits by using a rod or a pusher.\nTransfer the mixture of the lipoaspirate and the collagenase back to 60 mL syringes.\nConnect each 60 mL syringe containing the mixture with a tissue homogenizer which contains blades.\nConnect an empty 60 mL syringe to the other end of the homogenizer.",
    "Push the mixture to the other 60 mL syringe through the homogenizer for 4 -6 times, resulting in cutting and mincing of the lipoaspirate.\nTransfer the homogenized lipoaspirate and the collagenase mixture back to 60 mL centrifuge kits through a specialized connector\nPlace the centrifuge kits in a container to be placed in an incubator that has been pre-heated at 37 °C.\nIncubate the two centrifuge kits with the homogenized mixture at 37 °C for 40 min while rotating at 45 rpm.\nAfter the 40 min of incubation, remove the container from the incubator in a sterile fashion. Then, remove the centrifuge kits and place them in a centrifuge machine.\nCentrifuge the mixtures at 800 x g for 5 min to separate the adipose tissue-derived SVF.\nAfter the centrifuge, remove the supernatant (which includes collagenase and digested adipose tissue) from each centrifuge kits by removing the syringe cap on the top of the plunger and placing a 30 mL syringe on the plunger opening via syringe lock connection.\nSlowly press down the barrel part of the 30 mL syringe for the supernatant to fill into the 30 mL syringe.\nPress down the 30 mL syringe barrel all the way down to the last 3-4 mL of the bottom of the centrifuge kit, leaving only the last 3-4 mL of adipose tissue-derived SVF. The supernatant is discarded.\nRemove the 30 mL syringe from the top of the plunger and fill the syringe with 5% dextrose in lactated Ringer's solution (D5LR).\nBy attaching the 30 mL syringe filled with D5LR on the top of the plunger opening, fill the centrifuge kits, containing 3-4 mL of adipose tissue-derived SVF, with D5LR up to 55 mL.",
    "Remove the 30 mL syringe, cap the plunger, and centrifuge the centrifuge kits again at 300 x g for 4 min.\nRepeat Steps 2.17-2.21 for a total of 4 washings. The used collagenase is xenogenic. Therefore, most collagenase is removed by 4 washings. However, for FDA approval, fine-tuning of the protocol may be necessary to completely remove the collagenase residues in the final volume, although the current amount of collagenase residues may be negligible enough for the patients that do not have any clinical side effects.\nAfter the 4th centrifugation, in order to obtain the final SVF for injection, remove the safety cap and the plug at the bottom opening of the centrifuge kit, without shaking or turning the centrifuge kit.\nAttach a 20 mL syringe to the centrifuge kit bottom opening by using a specially designed connector.\nPull the plunger of the syringe several times back and forth to shake up the cells that have settled on the bottom of the centrifuge kit.\nRemove the desired total volume of the SVF containing both ASCs and ECM along with other cells and tissue (usually about 3-4 mL from each centrifuge kit for knee joint injections).\n3. PRP Preparation with Sterile Technique\nWhile preparing the ASCs and ECM, draw 30 mL of autologous blood with 2.5 mL of anticoagulant citrate dextrose solution.\nTransfer the drawn blood to the 60 mL centrifuge kits.\nCentrifuge the drawn blood at 730 x g for 5 min and remove the supernatant into a new 60 mL centrifuge kit. Centrifuge the supernatant at 1300 x g for 4 min, resulting in 3-4 mL of PRP.\nRight before the injection, add 3% (w/v) calcium chloride at a ratio of 10:2 (PRP: calcium chloride, v:v) to the PRP to activate it.",
    "Add 0.5% (w/v) HA, as a scaffold, to the PRP activated with calcium chloride. These ASCs with ECM, along with PRP, activated by calcium chloride, and HA stand for the ASC/ECM mixture.\n4. ASC/ECM Mixture-Based Treatment\nClean the knee of the patient with 5% betadine and drape it in a sterile manner.\nPalpate the anterior of the knee for the joint space between the tibial and femoral bones.\nAnesthetize the injection site superficially with diluted lidocaine (1 mL of 1% lidocaine diluted with 4 mL of normal saline) from the skin to just outside of the joint capsule.\nAnesthetize the inside of the joint capsule with diluted ropivacaine (1 mL 0.75% ropivacaine diluted with 3 mL of normal saline).\nMix 2 mL of HA to the 6-8 mL of SVF contained in a 20 mL syringe through the syringe-to-syringe connector.\nBy using a syringe-to-syringe connector, add 0.4 mL of calcium chloride to the 3-4 mL of autologous PRP that has been already prepared and being ready in a 5-mL syringe.\nCombine 3.5 - 4.5 mL of PRP/calcium chloride in a 5 mL syringe with 8-10 mL of HA/SVF mixture in a 20 mL syringe via syringe-to-syringe connector.\nImmediately inject the mixture (about 12-15 mL) slowly into the anterior tibio-femoral joint of the knees using 38-mm 18-gauge needle with or without the ultrasound guidance.\nAfter the injection, bandage the injection site with pressure by folding 4x4 cotton gauze 4 times and placing tapes over the folded 4x4 gauze.\nInstruct the patient to remain still for 60 min to allow for cell attachment.\nInstruct the patient to limit activities for minimal of 1 week after discharge from the clinic.\nReturn to the clinic for three additional injections of PRP activated by calcium chloride over 3 weeks.\n5. Post-Treatment Follow Up",
    "Assess patient at the week of 2, 4, and 16 (18 or 22) for pain improvement in terms of visual analog scale (VAS) and function improvement in terms of physical therapy parameters. Determine functional rating index (FRI), VAS, and range of motion (ROM) as previously described26,27.\nFollow the patient by post-treatment MRI 3 months after the treatment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}