{
  "id": 17570,
  "origin_website": "Jove",
  "title": "Fat-Covered Islet Transplantation Using Epididymal White Adipose Tissue",
  "procedures": [
    "The following procedure is performed in three steps. The first step includes the induction of diabetes in the recipient mice and the isolation of donor islets. The second step involves the preparation of islets before transplantation. In the third step, islet transplantation onto epididymal adipose tissue and covering of the islets using the adipose tissue is performed. After that, the therapeutic effects were assessed. The handling of the mice and the experimental procedures performed in this study comply with the ''Principles of Laboratory Animal Care'' (Guide for the Care and Use of Laboratory Animals, National Institutes of Health publication 8th edition, 2011), and the experimental protocol was approved by the Animal Care and Use Committee of Fukuoka University (approval number: 186018).\n1. Surgical preparation\nInduction of diabetes: Induce diabetes in 20-25 g body weight, 8-12-week-old recipient male mice through intravenous injection of 18 mg/mL streptozotocin solution prepared in 0.1M citrate buffer (180 mg/kg body weight). Mice with blood glucose levels exceeding 400 mg/dL are considered to be diabetic. Use diabetic mice within 1 week after diabetes induction before excessive atrophy of the epididymal white adipose tissue for covering islets.\nIslet isolation: Perform murine islet isolation one day before transplantation following Gotoh's method27 for islet isolation.\nIn brief, digest pancreatic tissue using collagenase solution. Isolate islets by density gradient centrifugation using an appropriate cell separation solution. Then culture islets overnight in an incubator at 22 °C and 5% CO2 (culture at <37 °C has been reported to prevent islet death28,29,30,31).\n\tNOTE: Handle the purified islet cultures in a safety cabinet. Filter-sterilize all solutions used for islet isolation and culture using a 0.22 µm filter.\n2. Preparation of islets for transplantation\nGather the appropriate instruments and materials as indicated in Figure 1A.",
    "As digestive enzymes such as amylase and lipase may result in injury to the isolated and transplanted islets and a loss of islets can occur from being trapped in contaminating fibrous tissues within the culture dish, prior to transplantation, use forceps to handpick any extra-islet components from the pancreas, including acinar and fibrous tissues (Figure 1B), under a dissecting microscope. After picking, use a cell strainer to filter out single acinar cells.\nTransfer the filtered islets to a new culture dish containing any appropriate culture medium or buffer solution (e.g., DMEM with low glucose, RPMI1640, CMRL1066, or HBSS) supplemented with bovine serum or albumin to prevent islet attachment to plastic and swirl the dish to position the islets in the center of the dish (Figure 1C). Using a P200 micropipette and the microscope, pick the individual islets into an appropriate collection tube (Figure 1D).\nPlace a new, 40 μm cell strainer on top of a 50 mL plastic tube (Figure 1E left and center) and wash the filter with fresh medium (Figure 1E right).\nUse a 1000 μL pipette to add the islets to the strainer to separate the islets and single acinar cells (Figure 1F1 and Figure 1F2).\n\tNOTE: The purified islets on cell strainer will be approximately 100% pure.\nUse forceps to invert the strainer on a new 60- or 100-mm sized non-treated culture dish containing culture medium or an appropriate buffer solution supplemented with bovine serum or albumin (Figure 1F3 and Figure 1F4). Use fresh medium/buffer to flush the islets into a new culture dish. Then add enough medium/buffer to the culture dish to reach a total volume of approximately 20 mL.",
    "Count the islets under a microscope and divide the number of islets equally between individual 1.5 mL plastic centrifuge tubes according to the number of donor animals (Figure 1G). For example, two hundred, 100-200 µm islet equivalents (IEQ) from two mice would be added to each of two tubes.\nCentrifuge the islets at 2,100 x g within 1 minute at room temperature and discard the supernatant. Around 20-30 µL of residual solution will typically remain in the tube (Figure 1H).\n3. Islet transplantation onto epididymal adipose tissue and covering with epididymal white adipose tissue\nBefore the surgery, collect an anesthesia machine for small animals, stereo microscope, light source, 50-200 µL micropipette with 200 µL micropipette tips, cotton swabs, a 4-0 suturing set, and disinfected surgical instruments (Figure 2A). Autoclave the cooper scissors, ophthalmic scissors, Pean forceps, tweezers, and needle holders. After autoclaving, immerse the equipment in a 1% povidone-iodine solution (Figure 2A). Use cotton swabs for mobilization of the epididymal white adipose tissue and for hemostasis in cases of bleeding. Use a micropipette with a 50-200 µL tips for islet transplantation.\nDeliver anesthesia to the diabetic recipient mouse using an inhaled anesthetic agent (2% isoflurane in oxygen). Apply ophthalmic lubricant to both eyes to prevent drying. Then place the mouse in the supine position (Figure 2B left) and remove the hair from the abdomen to prevent infection using hair clippers and/or depilatory cream. Disinfect the abdomen and the inguinal region using at least three alternating rounds of a povidone-iodine solution followed by 70% ethanol (Figure 2B right). Before the surgery, confirm anesthesia depth via the absence of a toe pinch reflex. Provide intra-operative thermal support using a heating pad and use a surgical drape to secure the sterile surgical area.",
    "Incise the skin at the lower median area (Figure 2C left). A skin incision that is approximately 2 cm in length is recommended. Clamp the left abdominal wall with the Pean forceps (atraumatic forceps or retractor can also be used) and pull the tissue to the left side of the mouse to secure the surgical field (Figure 2C right). After laparotomy, decrease the percentage of isoflurane to 1.0-1.5% for anesthesia maintenance.\nUse a cotton swab to mobilize the small and large intestine to the right side of the mouse (i.e., left side of the operator). The left epididymal white adipose tissue in the abdominal cavity are located in the left inguinal area. Mobilize the epididymal white adipose tissue and the left testis to outside of the abdomen (Figure 2D left) and stretch out the tissue (2D right).\nUse a P200 micropipette equipped with a 200 µL pipette tip to collect the entire volume of islets from one 1.5 mL tube with gentle pipetting (Figure 2E left), taking care that no islets are left in the tube upon collection. Allow the collected islets to settle to the tip of the pipette by gravity (Figure 2E right).\nPlace the micropipette tip lightly onto the distended adipose tissue. Taking care to prevent excessive flushing of the medium/buffer in the tip, carefully seed the islets onto the tissue (Figure 2F left). After seeding, confirm a correct placement of the islets under a dissecting microscope (Figure 2F right).\nCover the islets with the epididymal white adipose tissue (Figure 2G). The use of sutures or biobinding agents is not needed.",
    "Place the left testis under the epididymal white adipose tissue and return the tissues to the intraperitoneal cavity (Figure 2H). Close the skin in two layers (peritoneum, then muscle and skin) using a 4-0 suture (any sutures such as nylon or absorbable sutures can be used) (Figure 2I). Inject acetylsalicylic acid (300 mg/kg; SQ) near the wound for postoperative analgesia. Then place the mouse under a heat lamp and monitor until full recovery.\n4. Monitoring after Islet transplantation (Summary)\nAssess the therapeutic effects of islet transplantation by monitoring blood glucose, glucose tolerance test and histological assessment at postoperative day (POD) 28.\n\t\nMonitor the blood glucose, including the measurements of blood glucose at glucose tolerance test, using a small glucose meter.\nCollect the blood samples (a little microliters) from tail vein. Regarding histological assessment, murine insulin (for detecting engrafted islets) and von Willebrand factor (for detection of vessels, which is an evidence for islet engraftment) were detected in transplanted islets in the recovered epididymal adipose tissue by immunohistochemistry.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}