{
  "id": 16510,
  "origin_website": "Jove",
  "title": "Chemical Modification of the Tryptophan Residue in a Recombinant Ca2+-ATPase N-domain for Studying Tryptophan-ANS FRET",
  "procedures": [
    "1. Determination (in silico) of the ANS and SERCA N-domain interaction\nGenerate a three-dimensional (3D) structure of the protein (SERCA N-domain) by molecular modeling using the preferred protein modeling software50.\nIdentify the amino acid residues that form the nucleotide-binding site using the preferred molecular structure software51, and determine the presence of Arg and Lys residues35; these are required for ANS binding and to increase the fluorescence intensity (quantum yield).\nPerform molecular docking (using the preferred docking software)52,53,54 to determine the interactions of ATP, fluorescein isothiocyanate (FITC) (which forms a covalent bond with Lys515 labeling the nucleotide-binding site), and ANS with amino acids residues in the nucleotide-binding site (Figure 1).\nCalculate the molecular distance (Å) between Trp residue and bound ANS using the measurement tool in the preferred software.\nPerform molecular dynamics simulation of ANS-N-domain complex to determine the stability of the interaction52,54. Then, perform the in vitro experiments when the stability of the complex has been confirmed.\n2. Expression and purification of the recombinant N-domain\nSynthesize the gene coding for N-domain40.\nDesign and construct the plasmid that contains the synthetic gene that codes for the N-domain40.\nExpress and purify by affinity chromatography (Ni-NTA), the engineered recombinant N-domain. Perform an SDS-PAGE of the purified protein to determine the purity (Figure 2)40.\nDetermine the protein concentration by studying the absorbance at λ of 280 nm with the N-domain extinction coefficient (ε= 11,960 M-1·cm-1)40.\n3. Monitor the formation of the ANS-N-domain complex based on ANS and N-domain fluorescence intensity changes.\nPrepare an ANS stock solution in N,N-dimethylformamide.\n\t\nWeigh a small amount (1-5 mg) of ANS, and dissolve it in 1 mL of the final volume of N,N-dimethylformamide, e. g., 3.2 mg (10.69 mM final concentration).",
    "Prepare a 100 µM ANS aqueous stock solution using the ANS solution in N,N-dimethylformamide, e. g., add 9.4 µL of the 10.69 mM ANS solution to 990.6 µL of 50 mM phosphate buffer with pH 8.0 to obtain a final volume of 1 mL.\nMix the solutions by vortexing 3 - 5 times for 15 s.\n\t\tNOTE: In the following experiment, use only the ANS aqueous stock solution. Freshly prepare the ANS aqueous stock solution before initiating the experiments.\nPrepare the NBS stock solution in N,N-dimethylformamide.\n\t\nWeigh a small amount (1-5 mg) of NBS, and dissolve it in 1 mL of N,N-dimethylformamide, e. g., 5.3 mg in 1 mL (29.78 mM final concentration).\nPrepare a 1 mM NBS aqueous stock solution using the NBS solution in N,N-dimethylformamide, e. g., add 3.36 µL of the 29.78 mM NBS solution to 96.64 µL of 50 mM phosphate buffer with pH 8.0 to obtain a final volume 0.1 mL.\nMix the solutions by vortexing 3 - 5 times for 15 s.\n\t\tNOTE: Freshly prepare the NBS aqueous stock solution before starting the experiments.\nTitrate the N-domain with ANS, and record the fluorescence spectra by excitation at λ=295 nm at 25 °C.\n\t\nObtain the fluorescence spectrum baseline.\n\t\t\nPlace 1 mL of 50 mM phosphate buffer with pH 8.0 in a 1 mL fluorescence quartz cuvette.\nPosition the cell in the thermo-stated cell chamber (25 °C) of the spectrofluorometer and set the excitation λ to 295 nm.\nRecord the fluorescence spectrum (305 - 550 nm).\n\t\t\tNOTE: The fluorescence spectrum of the 50 mM phosphate buffer with pH 8.0, which serves as the blank sample, is subtracted from all obtained fluorescence spectra.\nObtain the intrinsic fluorescence spectrum of the N-domain.\n\t\t\nPlace 900 µL of 50 mM phosphate buffer with pH 8.0 in a fluorescence quartz cuvette.",
    "Add 100 µL of N-domain (10 μM) suspension to obtain a 1 μM N-domain final concentration in a 1 mL final volume.\nGently homogenize using a micropipette 20 times to ensure the homogeneity of the solution.\n\t\t\tNOTE: The protein should be freshly purified to obtain high-quality intrinsic fluorescence spectra, e. g., the purified recombinant N-domain may only be used for a week after purification.\nPosition the cell in the thermo-stated cell chamber (25 °C) of the spectrofluorometer and set the excitation λ to 295 nm.\nRecord the N-domain intrinsic fluorescence spectrum (305-550 nm).\nAdd ANS, and obtain the fluorescence spectrum by excitation at λ=295 nm.\n\t\t\nAdd a 2 µL aliquot of 100 µM ANS aqueous stock solution to the suspended N-domain (1 μM) to obtain a 0.2 µM ANS final concentration.\nGently homogenize using a micropipette 20 times to ensure the homogeneity of the solution.\nPosition the cell in the thermo-stable cell chamber (25 °C) of the spectrofluorometer and set the excitation λ to 295 nm.\nRecord the fluorescence spectrum (305-550 nm).\nRepeat the ANS additions and fluorescence spectra recording above 1:1 molar relationship ANS:N-domain.\nSubtract the blank spectrum from each spectrum using suitable software.\nPlot all the spectra in a single graph.\nDetermine whether the spectra form a FRET-like pattern. The ANS-N-domain fluorescence spectra form a FRET-like pattern (Figure 3A).\n4. N-domain intrinsic fluorescence titration by Trp chemical modification with NBS.\nRepeat steps 3.3.1 and 3.3.2.\nAdd a 1 µL aliquot of 1 mM NBS aqueous stock solution to the suspended N-domain (1 μM) to obtain a final concentration of 1 µM NBS.\nGently homogenize by using a micropipette 20 times to ensure the homogeneity of the solution.\nPosition the cell in the thermo-stable cell chamber (25 °C) of the spectrofluorometer and set the excitation λ to 295 nm.",
    "Record the fluorescence spectrum (305-550 nm) (Figure 3B).\nRepeat the NBS addition and fluorescence spectra recording until minimal N-domain intrinsic fluorescence quenching is observed40. In the N-domain, this usually occurs at a molar ratio of 5-6 NBS/N-domain40.\n\tNOTE: NBS rapidly quenches (<5 s) the intrinsic fluorescence of the N-domain; a decrease in fluorescence intensity is observed. Proceed immediately to the next step, as NBS may also react with other amino acid residues47.\nSubtract the blank spectrum from each spectrum using suitable software.\nPlot all spectra in a single graph (Figure 3B).\n5. Titrate the NBS-modified N-domain with ANS by recording fluorescence spectra at 25 °C.\nPerform Step 3.3.3 using the NBS modified N-domain that was generated in Step 4.\nSubtract the blank spectrum from each spectrum using suitable software.\nPlot all spectra in a single graph (Figure 3C).\nThe generated fluorescence spectra (Figure 3C) support or refute the occurrence of FRET, i.e., when FRET occurs, the ANS fluorescence does not increase and vice-versa.\n6. Evidence of ANS binding to the chemically modified N-domain by excitation at λ=370 nm.\nPerform Step 3.3.3 using the NBS modified N-domain that was generated in Step 4 but changing the excitation λ to 370 nm.\nSubtract the blank spectrum from each spectrum using suitable software.\nPlot all spectra in a single graph (Figure 3D).\nConfirm ANS binding to the N-domain by observing the increase in ANS fluorescence intensity. ANS binding to the N-domain shows a fluorescence increase when excited at λ=370 nm (Figure 3D). As a control, the fluorescence spectrum of ANS (alone) in 50 mM phosphate buffer with pH 8.0 was obtained exciting at λ of 295 and 370 nm (Figure 4, not shown in video).",
    "NOTE: The stoichiometric relationship of NBS:Trp that is required for chemical modification depends on the degree of burying of the Trp residue(s) in the protein under study46,47,55,56. Therefore, it is recommended to determine the NBS:protein/(Trp) molar ratio, beforehand.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}