{
  "id": 9047,
  "origin_website": "Jove",
  "title": "Enumeration of Neural Stem Cells Using Clonal Assays",
  "procedures": [
    "The treatment of animals was performed in accordance with the IACUC and NACLAR guidelines and approved by the animal department ((http://www.brc.astar.edu.sg/index.php?sectionID-11).\nNOTE: Neurosphere cultures were prepared from the forebrain of embryonic (E14) C57BL/6 mice as previously described5.\n1. Culture of Clonal Sample Neurospheres (Day 1)\nPrepare NSC growth medium by combining Dulbecco's Modified Eagle's Medium/Nutrient F-12 (DMEM/F12) medium with B27 supplement (final concentration: 1x), EGF (final concentration: 20 ng/mL), bFGF (final concentration:10 ng/mL) and penicillin/streptomycin (final concentration:1x).\nDissociate E14.5 mouse neurospheres in 1 mL NSC growth medium and 1 mL 0.05 N Sodium Hydroxide for 7 min at RT. Pipette cells up and down occasionally to keep cells in suspension. Add 1 mL of 0.05 N Hydrochloric acid to neutralize the alkali.\n\tNOTE: Neurosphere cells are seeded at 20,000 cells/mL in a 10 cm culture dish and are cultured for 5 d at 37 °C, 5% CO2. The expected yield after is about 10 million cells per 10 cm dish. These cells are then dissociated and seeded at clonal density as described in steps 1.2 and 1.3, respectively.\n\t\nPerform cell count using Trypan Blue staining and a hemocytometer.\nSeed single E14.5 mouse neurosphere cells at a density of 50 cells/mL or below in 100 µL NSC growth medium in a 96-well dish. Incubate the cells at 37 °C, 5% CO2 for 1 w to generate clonal neurospheres.\n\tNOTE: Clonality is ensured during neurosphere formation at this density as the cells do not contact each other.\n2. Culture of Neurospheres for Conditioned Medium (Day 3)\nDissociate E14.5 mouse neurospheres as described in step 1.2.",
    "Seed single cells from E14.5 mouse neurospheres at a density of 20,000 cells/mL in a 10 mL NSC growth medium in a 10 cm culture dish. Incubate the cells at 37 °C, 5% CO2 for 5 d to generate bulk cultured neurospheres.\n3. Preparation of Neurosphere Conditioned Medium (Day 8)\nPrepare coating solution by mixing 700 µL of 0.01% Poly-L-Lysine (PLL), 70 µL of 1 mg/mL Laminin and 6,230 µL of Phosphate Buffered Saline (PBS).\nCoat a 10 cm culture dish with 7 mL of PLL/Laminin solution for 2 h at 37 °C.\nUsing a 10 mL serological pipette, transfer all the bulk cultured neurospheres to a 15 mL conical centrifuge tube. Centrifuge the neurospheres at 171 x g for 1 min at RT and remove the supernatant completely.\nPrepare NSC differentiation medium by combining DMEM/F12 medium with B27 (final concentration: 1x) and Fetal Bovine Serum (FBS) (final concentration: 0.5%) Add 10 mL of NSC differentiation medium to neurospheres. Pipette up and down a few times to resuspend the neurospheres.\nAspirate PLL/Laminin from the 10 cm culture dish and wash once with 10 mL PBS. Transfer all the neurospheres to the PLL/Laminin-coated 10 cm culture dish. Incubate O/N at 37 °C, 5% CO2 for the neurospheres to adhere to the dish.\n4. Determination of NFU of Sample Neurospheres (Day 8)\nCount the number of neurospheres (seeded on day 1; section 1) formed in each well under a microscope.\n\tNOTE: Determine the number of neurospheres formed per 100 cells plated, which gives the NFU.\n5. Transfer of Sample Neurospheres to 50-well Chambered Coverslip (Day 8)\nCoat each well of a 50-well chambered coverslip with 10 µL of PLL/Laminin coating solution for 2 h at 37 °C.\n\tNOTE: Prepare coating solution as described in step 3.1.",
    "Prepare 3 x 50 mL conical centrifuge tubes containing 30 mL of PBS each. Using sterile forceps, remove the coated 50-well chambered coverslip. Dip the chambered coverslip into the first tube of PBS, followed by the second and then the third tube of PBS, to wash off the coating solution.\nAspirate any remaining liquid from the wells of the chambered coverslip.\nGently pipette all medium and neurospheres from each well of the 96-well dish and transfer it to a single 10 cm culture dish.\nUnder a microscope, pick a sample neurosphere using a P10 micropipette fitted with a 10 µL pipette tip. Ensure that only a single neurosphere is picked each time by setting the pipette column to 2 µL. Use a new pipette tip for each neurosphere.\nTransfer the neurosphere onto the center of a well of the coated 50-well chambered coverslip.\nRepeat steps 5.5 and 5.6 until each well of the chambered coverslip contains a neurosphere.\n\tNOTE: The neurospheres may be picked under a microscope placed in a laminar flow hood or on a benchtop.\nAdd 10 µL of NSC differentiation medium to each well of the chambered coverslip. Place the chambered coverslip in a 10 cm culture dish and pipette PBS along the edges of the dish to prevent drying of the NSC differentiation medium. Place up to two chambered coverslips in one 10 cm culture dish. Incubate the chambered coverslip (contained in the 10 cm culture dish) overnight at 37 °C, 5% CO2.\n6. Differentiation of Sample Neurospheres (Day 9)",
    "Transfer the differentiation medium from the bulk cultured neurospheres (from section 3) to a 15 mL conical centrifuge tube. Ensure that 2-3 mL of differentiation medium remains in the culture dish to prevent adhered cells from detaching. Using a 20 mL sterile syringe, pass the differentiation medium through a 0.2 µm filter to remove any cells or debris.\nTransfer the filtered differentiation medium back to the 10 cm culture dish containing the adhered cells.\nUsing sterile forceps, gently place the chambered coverslip onto the differentiation medium in an inverted manner such that the sample neurospheres are facing downwards. Incubate the chambered coverslip with the differentiation medium for 3 d at 37 °C, 5% CO2.\n\tNOTE: The sample neurospheres are in contact with the differentiation medium but not in contact with the differentiating cells beneath.\n7. Fixing of Differentiated Neurospheres (Day 12)\nGently remove the chambered coverslip from the 10 cm culture dish using sterile forceps. Gently dip the coverslip into PBS to wash off the conditioned medium.\nPeel off the silicone gasket from the coverslip. Perform this gently and slowly to avoid breaking the coverslip. Take note of the side where the differentiated neurospheres are adhered.\nPipette 1 mL of 4% paraformaldehyde (PFA) onto a piece of paraffin film cut to the size of the coverslip. Gently place the coverslip on the paraffin film with the neurospheres facing downwards in contact with the PFA. Fix the neurospheres for 20 min at RT.\n\tCaution: PFA is toxic both in liquid and vapor form and is combustible. Avoid inhalation of vapor and contact with skin and eyes. Always handle PFA in a ventilated fume hood.",
    "Pipette 1 mL of PBS onto a piece of paraffin film. Wash the neurospheres by gently placing the coverslip with the neurospheres facing downwards in contact with PBS for 10 min at room temperature.\nRepeat step 7.4 two more times.\n8. O4 Staining of Differentiated Neurospheres (Day 12)\nPrepare 3% bovine serum albumin (BSA) in PBS. Pipette 1 mL of the 3% BSA onto a piece of paraffin film. Block the neurospheres by gently placing the coverslip (with the neurospheres facing down) in contact with the BSA for 30 min at RT.\nPipette 1 mL of mouse anti-O4 IgM antibody (1:300 dilution in the 3% BSA) onto a piece of paraffin film and place the coverslip on the paraffin film with the neurospheres facing downwards in contact with the antibody. Allow O4 staining to occur for 2 h at RT.\nWash the coverslip twice with PBS as described in step 7.4.\nPipette 1 mL of green fluorescent dye conjugated-anti-mouse IgM secondary antibody (1:500 dilution in the 3% BSA) onto a piece of paraffin film and place the coverslip on the paraffin film with the neurospheres facing downwards in contact with the antibody. Leave for 1 h at RT in the dark.\n\tNOTE: Perform immunostaining in a dark environment from this step onwards.\nWash the coverslip twice with PBS as described in step 7.4.\n9. Tuj1 and Glial Fibrillary Acidic Protein (GFAP) Staining of Differentiated Neurospheres (Day 12)\nPrepare permeabilizing solution by adding Triton-X 100 (final concentration: 0.5%) to the 3% BSA. Pipette 1 mL of permeabilizing solution onto a piece of paraffin film. Place coverslip on the paraffin film with the neurospheres facing downwards in contact with the permeabilizing solution for 20 min at RT.\nWash the coverslip twice with PBS as described in step 7.4.",
    "Pipette 1 mL of mouse anti-Tuj1 IgG2a antibody (1:500 dilution in the 3% BSA) and rabbit anti-GFAP IgG antibody (1:1,000 dilution in the 3% BSA) onto a piece of paraffin film and place coverslip on the paraffin film with the neurospheres facing downwards in contact with the antibodies. Allow Tuj1 and GFAP staining to occur for 2 h at RT.\n\tNOTE: Both antibodies can be prepared as a single solution.\nWash the coverslip twice with PBS as described in step 7.4.\nPipette 1 mL of red fluorescent dye conjugated-anti-mouse IgG2a (1:500 dilution in the 3% BSA) and far red fluorescent dye conjugated-anti-rabbit IgG (1:500 dilution in the 3% BSA) secondary antibodies onto a piece of paraffin film and place coverslip on the paraffin film with the neurospheres facing downwards in contact with the antibodies. Leave for 1 h at RT.\n\tNOTE: Both antibodies can be prepared as a single solution.\nWash the coverslip twice with PBS as described in step 7.4.\nDilute 4',6-diamidino-2-phenylindole (DAPI) stock solution to 300 nM in PBS. Pipette 1 mL of DAPI onto a piece of paraffin film and place coverslip on the paraffin film with the neurospheres facing downwards in contact with DAPI for 2 min at RT for nuclei staining.\nWash the coverslip once with PBS and twice with deionized water as described in step 7.4. Mount the coverslip on a glass slide using a suitable mounting medium and allow to dry O/N at RT.\n10. Imaging of Differentiated Neurospheres (Day 13)\nImage neurospheres under a confocal microscope using a 40X. Use the lasers at 488 nm, 594 nm and 647 nm to detect oligodendrocytes, neurons and astrocytes, respectively.\nDetermine the percentage of unipotent, bipotent and tripotent neurospheres.",
    "NOTE: Potency is determined by the ability of the neurosphere to differentiate into the three neural lineages - oligodendrocytes, neurons and astrocytes5,14,15,26. Oligodendrocytes are identified by positive staining for O4 (section 8). Neurons are identified by positive staining for Tuj1 (section 9). Astrocytes are identified by positive staining for GFAP (section 9). A unipotent neurosphere differentiates into only one of the lineage and should positively stain for either O4, GFAP or Tuj1. A bipotent neurosphere differentiates into any two lineages and should positively stain for O4 and GFAP or O4 and Tuj1 or GFAP and Tuj1. A tripotent neurosphere differentiates into all three lineages and should positively stain for O4, GFAP and Tuj1.\nDetermine NSC frequency in the population of interest by using the following formula:\n\tNSC frequency = (NFU x % of tripotent neurospheres) / 100%."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}