{
  "id": 11792,
  "origin_website": "Jove",
  "title": "Glioblastoma Relapse Post-Resection Model for Therapeutic Hydrogel Investigations",
  "procedures": [
    "All the animal experiments were approved and supervised by the Institutional Review Board and the Animal Ethics Committee of Nanjing Medical University (IACUC-1904004). C57BL/6J female mice, aged 6-8 weeks old, were used for the present study. The animals were obtained from a commercial source (see Table of Materials).\n1. Animal preparation\nWeigh the mice, and anesthetize them with an intraperitoneal injection of 50 mg/kg pentobarbital sodium (see Table of Materials). Administer meloxicam (5mg/kg; i.p.) for perioperative analgesia. House the mice in a cage under a 12 h/12 h light/dark cycle, an ambient temperature of 24 °C, and a relative humidity of 50%.\n\t​NOTE: For the present study, the initial weight of the mice was about 22 g.\nRemove the hair on the head of a mouse using a laboratory animal shaver, and fix the head and limbs on the stereotaxic apparatus (see Table of Materials).\n\tNOTE: Sterilize all equipment before use.\nDisinfect the head of the mouse with at least three alternating rounds of chlorhexidine or povidone-iodine scrub followed by alcohol, and cover the mouse with a sterile surgical drape. Apply ophthalmic ointment on both eyes to prevent drying.\nCut the scalp of the mouse about 1 cm along the midline on the top of the right forehead with ophthalmic scissors.\n\tNOTE: Confirm the surgical plane of anesthesia by the absence of pedal reflex before making the incision.\nTune the stereotaxic apparatus to ensure the herringbone seam and the front fontanel point are located at the same level.\n2. Construction of the orthotopic intracranial GBM model\nMark the point 1 mm to the front side of the front fontanel, 1.8 mm to the right side of the front fontanel, and 3 mm down from the front fontanel using a cotton swab dipped with gentian violet2 (see Table of Materials).",
    "Drill the point using a 1 mm diameter mini cranial drill (see Table of Materials) to create a pore size of about 1 mm diameter and 1 mm depth.\nRemove the exuded cerebrospinal fluid with a sterile cotton swab.\nAspirate 5 µL of tumor cell suspension (GL261-Luci, 5 × 105 cells suspended in 5 µL of PBS) with a microsyringe.\n\tNOTE: The GL261-Luci was obtained from a commercial source (see Table of Materials).\nAlign the needle tip of the microsyringe vertically with the skull drilling hole, insert until the needle tip enters the skull plane for 3 mm, and return the needle by 0.5 mm7.\nOpen the microsyringe, and inject with a speed of 1 µL/min.\nRetain the needle for 10 min after injection.\nWithdraw the microsyringe slowly, and press the injection point with a sterile dry cotton ball.\nSuture the scalp with a nonabsorbable surgical suture (10-0, see Table of Materials), and disinfect the incision again.\nMonitor the animal's health, and keep it in warm conditions.\nMove the mouse back to the housing cage after the mouse wakes up.\nImage the mouse with an in vivo bioluminescent imaging system (see Table of Materials) to detect the transplanted tumor on the 10th day after tumor-bearing.\n\tNOTE: Luciferase loaded in the GBM cells, GL261, was used for the bioluminescent imaging. \n\t\nAnesthetize the mouse with 1.5% isoflurane with an oxygen flow rate of 0.6L/min. After confirming anesthesia depth via lack of pedal reflex, inject the mouse intraperitoneally with potassium fluorescein (10 mg/mL, see Table of Materials), and 11 s later, perform the in vivo bioluminescent imaging. When the fluorescence value reaches ~5 × 105, the procedure is successful.\n\t\tNOTE: Anesthetize the animal before imaging. Maintain anesthesia via nose cone supplied with vaporized isoflurane.",
    "Select the mice with successful tumor-bearing to construct the GBM relapse post-resection model.\n3. Construction of the GBM relapse post-resection model\nWhen the tumor size in the orthotopic intracranial GBM model mice becomes ~6.5 × 105, select the mice for the postoperative relapse model.\nWeigh the orthotopic intracranial GBM model mice, and anesthetize the mice with an intraperitoneal injection of 50 mg/kg pentobarbital sodium.Administer meloxicam (5mg/kg; i.p.) for perioperative analgesia. \nRepeat the process of steps 1.2−1.5.\nSeparate the scalp tissue and skull, and check the drilling hole used to build the orthotopic intracranial GBM model. If the hole has healed, identify the hole using stereotactic apparatus, and follow the procedure mentioned in steps 2.1-2.3.\nExpand the hole diameter to 5 mm with a skull drill, and remove the exuded cerebrospinal fluid with a sterile cotton swab.\nFocus the microscope on the head of the mouse, and adjust the settings to ensure the drilling hole is located in the center of the field of vision.\nCut the meninges with microscissors, and remove part of the tumor tissue with a micro curette and a micro scalpel under the microscope.\n\tNOTE: Regarding the meninges, when the skull is opened, the thin membrane close to the brain tissue is the meninges.\nStop the bleeding with sterile gauze, and wash the incision with sterile physiological saline.\nInject the commercially available hydrogel (10 µL, see Table of Materials) into the resection cavity with a 1 mL syringe, suture the scalp with a nonabsorbable surgical suture (10-0), and disinfect the incision again (Figure 1).\nMonitor the animal's health, and keep the mouse warm.\nMove the mouse back to the housing cage after the mouse wakes up.",
    "Perform in vivo bioluminescent imaging to detect the transplanted tumor 1 day later to quantify the size of the residual tumor (Figure 2 and Figure 3).\nWeigh the mice every 2 days until the terminal endpoint.\n\tNOTE: For the present study, the terminal endpoint was day 30, and the mice were euthanized by an overdose of pentobarbital sodium with an intraperitoneal injection."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}