{
  "id": 5009,
  "origin_website": "Bio",
  "title": "Cloud-point PEG Glass Surfaces for Imaging of Immobilized Single Molecules by Total-internal-reflection Microscopy",
  "procedures": [
    "Piranha preparation and treatment to clean cover glassesNote: Be very careful as the Piranha solution used in this step is extremely corrosive. Follow your institution’s safety regulations. We recommend, at least, wearing a lab coat, a full-length rubber apron coat, long-sleeve butyl gloves, a full-face splash shield, and working under a chemical fume hood free of flammable organic chemicals. Use PYREX glassware for preparation of Piranha solutions (regular soda-lime glass beakers may crack upon heating when Pirahna solutions are prepared).Place 12 coverslips into ceramic rack using flat-tip tweezers. In a designated chemical fume hood, place two clean 250 ml PYREX beakers (beaker 1 and 2) in two separate crystallization dishes. The dishes serve as secondary containers to ensure safety.Very carefully add 1 part (50 ml) of 30% hydrogen peroxide (H2O2) to beaker 1, followed by 3 parts (150 ml) of concentrated sulfuric acid (H2SO4). Gently stir to mix the solution with a clean glass rod. The solution will immediately form bubbles and heat up to ~100 °C.Using forceps, very carefully transfer the rack with the coverslips into beaker 1 and incubate for 30 min. To ensure safety, leave a note indicating that Piranha is in use. Repeat Piranha treatment one more time with a fresh Piranha solution in beaker 2.Transfer the coverslips from beaker 2 into a Nalgene 125 ml polypropylene jar filled with double-distilled water. Dispose of piranha waste according to your institution’s regulations. Rinse the coverslips copiously with double-distilled water until pH stabilizes (verified by pH paper). The cleaned coverslips can be stored in double-distilled water without noticeable changes in reactivity and fluorescent background for at least 1 month. Quality control.Surface hydrophilicity.",
    "Piranha-treated coverslips become uniformly hydrophilic, which can be qualitatively verified by dipping a coverslip in water using flat-end tweezers, taking it out vertically, and observing water slowly receding as a uniform sheet, and forming Young’s rings before drying out. In contrast, untreated coverslips form patches of water when dipped into and taken out of waterFluorescent background. After Piranha treatment, blow-dry a coverslip with pressurized pure nitrogen (see step C12) and place it onto a total-internal-reflection microscope. One should observe essentially no fluorescent spots (<3 identifiable ‘spots’ per 100 x 100 micron area) under typical single-molecule imaging conditions (excitation with 532 and 640 nm sources at density ~0.5 kW/cm2, imaging in 580/60 nm and 670/45 nm optical bands, sampling rate 2.5 Hz).Mild KOH etching to maximize the density of silanol groups on the glass surface (Iler, 1979) Transfer the Piranha-treated coverslips from water to a clean 250 ml polypropylene jar containing 125 ml of 0.5 M KOH, then sonicate for 1 h in a bath sonicator. Be sure that the water level is up to the marked operating level, and is about level with the solution inside the jar. Ensure that the temperature does not exceed 40 °C by supplying ice (100~200 g by estimation) at t = 0 and t = 30 min during sonication. Otherwise the bath will heat up, which accelerates etching of the coverslips and creates micron-size pits in the glass surfaces. Transfer the coverslips back into the polypropylene jar containing water and copiously rinse the coverslips with double-distilled water until pH stabilizes, as verified by pH paper.Silanization to create amine groups on glass surfaceNote: In this step, the glass surface is functionalized with amine groups by incubating in a solution of APTES.",
    "Although APTES is one the best studied silanization agents, there is currently no consensus on the best method to cost-effectively create molecularly homogenous, reactive, stable APTES films. The parameter space for APTES deposition conditions is vast, as the quality of films has been shown to depend on the substrate (e.g. glass, silica, or oxidized silicon), surface cleaning method, deposition phase (e.g. liquid or vapor), water content of the solvent and the surface, concentration of APTES, temperature, incubation times, and annealing conditions [for references, see Kim et al. (2009)]. Our procedure is based on the simple technique introduced to the single-molecule imaging field by Ha and colleagues (Ha et al., 2002). In our hands, more sophisticated deposition methods did not create APTES surfaces superior to the ones prepared per Ha et al. (2002).Under a fume hood, prepare three clean 125 ml polypropylene jars (maximal capacity of ~170 ml) containing 125 ml acetone. Connect a non-coring needle to a 10 cc gas-tight glass syringe via a PTFE valve. Close the PTFE valve. Insert the needle through the septum of the APTES bottle and ensure that the needle orifice is below the surface of the APTES. Create slight positive pressure inside the APTES sealed bottle using a nitrogen line and a second non-coring needle. Open the PTFE valve. Withdraw 3.75 ml of APTES with the syringe and close the PTFE valve. Remove the needle from the bottle, open the PTFE valve, and add the APTES into the 125 ml of acetone in one of the jars. Gently stir to prepare 3% APTES. Using forceps, remove the rack with coverslips from double-distilled water, and dip the rack successively into the two 125 ml polypropylene jars containing acetone, spending ~10 sec in each jar with gentle agitation.",
    "Then transfer immediately into the freshly prepared 3% APTES solution. Do not allow acetone to dry between transfers. Place the APTES container on a horizontal platform shaker and incubate for 1 h. Note: Immediately after use, during silanization, rinse the syringe, the syringe needles, and the PTFE valve sequentially with acetone and double-distilled water, and then blow with dry nitrogen. Also, during silanization, prepare PEG solutions (steps D14-15).After silanization, wash the coverslips with acetone by dipping the rack in the two jars containing acetone (see step C11) in reverse order and place the rack back into double-distilled water. Copiously rinse with double-distilled water. Do not let the coverslips spend more than 5 min in water. Blow the coverslips dry one-by-one with nitrogen. To that end, hold a coverslip on its corner with the flat-end tweezers, and direct the nitrogen gas flow across the surface of the coverslip towards the corner held by the tweezers. When dry, place the coverslip on a piece of Parafilm positioned on a flat, clean surface. Mark the upper surface of the coverslip by scoring the upper-left corner with a diamond scriber. The coverslips are now ready for PEGylation. Notes: We usually carry out PEGylation in a clean environment (e.g., a positive-pressure HEPA-filtered room), but we also have had success in a regular environment if PEGylation was carried out immediately after treatment by APTES. We typically do not store amine-treated coverslips. Many APTES deposition protocols include a high-temperature curing step following silanization, meant to form stable covalent bonds between physisorbed APTES molecules (Plueddemann, 1982). However, on the molecular scale, curing may lead to lateral rearrangement of APTES molecules and create islands of unmodified glass (Kim et al., 2009).",
    "In our hands, curing offered no additional improvement in surface quality in terms of preventing non-specific adsorption of biomolecules. Quality control: Concentration of amine groups. You can measure the concentration of amine groups on coverslip surfaces using TRIONE ninhydrin reagent. To that end, crush one coverslip by placing it into a 50 ml Falcon tube and centrifuging at 2,000 x g in a swing-bucket centrifuge for 1 min. Then fill the tube with 1 ml of the ninhydrin reagent and follow the manufacturer’s protocol to spectrophotometrically quantify the average density of amine groups on the coverslip surface (for 24 x 40 mm coverslips, with the thickness of ~0.15 mm, the total surface area is 1,940 mm2). Using standard dilutions of APTES as create a calibration curve, we typically get 3 amine groups per nm2.Treatment of amine-glass surfaces with NHS-PEG at cloud-point conditionsNotes:The procedure builds upon the method introduced by Ha et al. (2002), with modifications to maximize the density of PEG molecules, and to block and neutralize positively charged amine groups after PEG deposition (section E). Thus, amine-treated coverslips are coupled to succinimidyl-PEG at pH 9.0 in a bicarbonate buffer containing 0.45 M K2SO4, at 10.0 % NHS-PEG (w/v). The high salt and the high PEG concentration bring the PEG solution just below its ‘cloud point’, which maximizes the density of the PEG layer on the surface (Kingshott et al., 2002).NHS group hydrolyzes in aqueous buffers, which makes NHS-PEG non-reactive. The lifetime of the NHS group is between a few seconds and a few minutes, depending on the nature of the NHS-PEG linker, pH, and temperature (Hermanson, 2008). For example, we found that NHS-SVA hydrolyses with a half-life of ~5 min at pH 9.",
    "0 at room temperature, which is a good compromise between the reactivity of the NHS group and the reactive species lifetime. Thus, our protocol minimizes the time the reactive NHS-SVA species spends at pH=9.0 prior to addition to the amine-glass surface. Specifically, we initially dissolve dry PEG-SVA at pH 6.0, at which the NHS group remains unhydrolyzed for at least 1 h. Then, immediately before addition of the PEG solution to the glass surface, we bring the pH up to 9.0. If you are using a non-SVA linker, you have to optimize the pH of the reaction to achieve the NHS lifetime of ~5 min. The lifetime of the reactive NHS group can be measured spectrophotometrically by monitoring the kinetics of accumulation of free NHS upon hydrolysis [free NHS strongly adsorbs at 260 nm (Miron, 1982)]. We also highly recommend measuring the percentage of reactive PEG-NHS in new batches of purchased PEG reagents. We have had cases in which completely hydrolyzed, non-reactive PEGs had been shipped by major suppliers. This step is best done during the APTES incubation at step C11. Take out 6 single-use aliquots of dry mPEG-SVA from storage at -80 °C. Each aliquot should be about 5 mg, which is sufficient to treat two coverslips. The mass of dry mPEG-SVA in the 6 aliquots should have been pre-written on each tube with 0.1 mg accuracy prior to storage at -80 °C (e.g., 4.9, 5.0, 5,1, 4.9, 5.0, and 5.1 mg for 6 tubes). In addition, take out 1-2 mg of biotin-PEG-SVA from storage. Let all tubes warm up to room temperature. This step is best done during the APTES incubation at step C11. Calculate the volume of 0.5 M K2SO4 solution to add to each mPEG-SVA tube by multiplying the aliquot mass by 8 (e.g.",
    ", the tube containing 4.9 mg will require 4.9 x 8 = 39.2 μl of K2SO4 solution) and record all volumes in a notebook. Sum up all the volumes, to get the minimal volume of 0.5 M K2SO4 required to make six PEG solutions [e.g., for 6 tubes containing 4.9, 5.0, 5,1, 4.9, 5.0, and 5.1 mg mPEG-SVA one needs (4.9 + 5.0 + 5.1 + 4.9 + 5.0 + 5.1) x 8 = 240 μl of K2SO4]. Based on the calculated minimal volume, prepare sufficient amount of 0.5% biotin-PEG-SVA solution in 0.5 M K2SO4 (e.g., dissolve 1.3 mg of biotin-PEG-SVA with 260 μl 0.5 M K2SO4). Pipet the pre-calculated volumes of the 0.5% biotin-PEG-SVA solution into each of the 6 mPEG-SVA aliquots (e. g. add 39.2 μl to the 4.9 mg tube, and so on), vortex for 10 sec, and briefly spin with a tabletop centrifuge. Each tube now should have a clear solution and a small (~5 μl in volume) pellet of PEG on the bottom. Note: PEG precipitation is expected, because the PEG solution is currently at 11.6% concentration (w/v), which is above its ‘cloud point’ (10% w/v).  The tubes can remain at room temperature for at least 1 h without appreciable hydrolysis of the NHS group while the coverslips are being treated with APTES and laid out for PEGylation.With all APTES-treated coverslips laid out for PEGylation, set up the PEGylation reactions using one PEG-NHS aliquot at a time. To that end, add 1/8 of 1 M NaHCO3 (pH 9.0) to the PEG solution in K2SO4 (e.g. add 4.9 μl of NaHCO3 to a tube that originally contained a 4.9 mg mPEG-SVA aliquot, and now contains 39.",
    "2 μl of the biotin-PEG-SVA solution), quickly mix by pipetting up and down, and deposit the whole solution in the center of a dry APTES-treated coverslip. Cover the drop with another coverslip carefully, making sure that the scored surfaces of both coverslips face towards the PEG solution, and avoiding formation of bubbles (by practicing). Repeat for the rest five pairs of coverslip and incubate for 30 min at room temperature.Note: The PEG solution appears clear after addition of NaHCO3, because the total PEG concentration is now just below the ‘cloud point’. We noticed that additional coating of coverslips with a fresh solution of PEG does not improve the quality of surfaces (in terms of non-specific adsorption of biomolecules). Carefully separate the coverslip pairs using tweezers and place individual coverslips back into the ceramic rack in the double-distilled water. Rinse extensively with water until there is no more foaming of the solution. Quality control: Density of PEG molecules. You can estimate the packing density of the PEG molecules on the glass surface by depositing fluorescein-PEG-NHS in the same conditions as described above, and measuring the absorbance at 494 nm using a high-sensitivity double-beam spectrophotometer (e.g., Perkin Elmer Lambda 35). The molecules density = [(OD494/extinction coefficient) x 6.02 x 1023 mol−1]/area. By this estimation, the average packing density should be consistent with the radius of gyration of a Mw = 5,000 PEG molecule at cloud point [R = 2.8 nm (Dalsin et al., 2005)].Blocking of unreacted amines with acetyl groupsNote: Due to the bulkiness of PEG molecules, only a fraction of amine groups on the surface reacts with NHS-PEG. As a result, the remaining amines contribute to non-specific adsorption of negatively charged molecules, such as DNA, which is problematic in buffers of low ionic strengths.",
    "Thus, we cap the unreacted amines with NHS-acetate to convert them to neutral, stable amides.Blow-dry 12 PEGylated coverslips as described in step C12. Place dry coverslips on Parafilm, with the PEGylated surface facing up. Immediately prior to use, dissolve 3 mg of sulfo-NHS-acetate in 300 μl of 0.1 M NaHCO3 (pH 9.0), deposit 50 μl drops of the solution onto the 6 PEG coverslips, and cover with the remaining 6 coverslips, with the PEGylated surface facing the solution. Incubate for 30 min at room temperature. Rinse coverslips with double-distilled water, blow-dry, and store dry at -80 °C.Testing fluorescent background of PEGylated surfaces and non-specific absorption of biomoleculesNote: The following protocol is for a rapid test of non-specific ‘stickiness’ of the surface to fluorescently labeled biomolecules. However, this test does not address the biological activity of surface-immobilized molecules (for instance, the activity of a transcription factor on a surface-immobilized DNA). Thus, the most relevant test of surface quality is a biochemical assay of the activity of surface-bound biomolecule, performed side-by-side with a positive control in which the activity of the same amount of biomolecules is measured in solution-based conditions (Revyakin et al., 2012). Create 5 open wells on a coverslip using 1 mm-wide strips of double-sided tape (by simply sticking 6 strips on to the modified side), and place the coverslip on an objective-type TIRF microscope. The 5 wells allow testing of 5 different biomolecules. Deposit a 5 μl drop of PBST into a well, turn on the excitation laser, and focus the microscope onto the surface. Acquire a movie to measure the fluorescent background on the surface, under single-molecule imaging conditions (e.g., excitation with 532 and 640 nm sources at density ~0.5 kW/cm2, imaging in 580/60 nm and 670/45 nm optical bands, sampling rate 2.5 Hz).",
    "In our hands, silanization and PEGylation increase the number of fluorescent background spots ~3 fold in comparison to Piranha-treated glass (i.e., an increase from ~3 spots to ~10 spots per 100 x 100 μm field of view), which is an acceptable level of background for most single-molecule imaging experiments. Allow the background spots to photobleach. Prepare a 10 nM solution of the fluorescently labeled test protein in PBST, and deposit 20 μl of the solution on top of the 5 μl PBST drop already in the well. Acquire a movie to quantify the non-specific adsorption of the molecule to the surface. For simplicity, in this test we do not supply oxygen scavenger to the solution of test protein. Thus, to avoid immediate photobleaching upon sticking of a molecule to the surface (which will lead to over-estimation of surface quality) use minimal laser power (30~100 W/cm2) and fluorescent labels that photobleach in >5 seconds in the absence of oxygen scavengers (e.g., Cy3 and Atto633). For a good-quality surface, we typically observe a ‘cloud’ of 10 nM biomolecules rapidly diffusing in the bulk solution (at 2.5 Hz acquisition rate), and ~10 single-molecule limited spots in any given movie frame (100 x 100 μm field of view). No additional accumulation of spots should be observed within 10 min (with the excitation light switched off, and then turned back on again), indicating that non-specific adsorption is rare and reversible. Repeat the test with other biomolecules of interest using the remaining 4 wells."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}