{
  "id": 17132,
  "origin_website": "Jove",
  "title": "Selection of Transporter-Targeted Inhibitory Nanobodies by Solid-Supported-Membrane (SSM)-Based Electrophysiology",
  "procedures": [
    "1. Membrane protein reconstitution\nMix 3 mL of E. coli polar lipids with 1 mL of phosphatidylcholine in a round bottom flask under a ventilated hood.\nDry the lipid mixture for 20 min under vacuum using a rotary evaporator and a water bath at 37 °C to remove chloroform. If needed, dry further under nitrogen or argon gas.\nUsing TS buffer (20 mM Tris-HCl pH 8.0, 150 mM NaCl) containing 2 mM β-mercaptoethanol, resuspend lipids to 25 mg/mL.\nAliquot lipids in 500 µL aliquots, flash freeze in liquid nitrogen, and store at -80 °C.\nThaw one 500 µL aliquot of lipids and dilute 1:1 using TS buffer containing 2 mM β-mercaptoethanol.\nExtrude the lipid suspension 15 times using a 400 nm membrane.\nDilute the lipid suspension to have a final lipid concentration of 4.4 mg/mL.\nAdd n-dodecyl-β-D-maltoside (DDM) to have a final concentration of 0.2% and leave it rotating for 1 h at 200 rpm at room temperature (RT).\nAdd the purified protein to the lipids using a lipid-to-protein ratio between 1:10 and 1:100 (w:w).\n\tNOTE: The ratio needs to be adjusted depending on the strength of the signal detected in SSM-electrophysiology measurements of substrate transport (see below). To obtain larger signals, use smaller lipid-to-protein ratios.\nIncubate the mixture rotating at 200 rpm for 1 h at RT.\nAdd 30 mg/mL of polystyrene adsorbent beads, pre-washed in TS buffer.\n\tNOTE: Add polystyrene beads stepwise.\nIncubate the beads-lipids mixture for 30 min at RT under slow stirring.\nTo remove the beads, let the beads-lipids mixture stand so that the beads settle down. Transfer the solution to a new tube and leave the beads behind. Add 30 mg/mL of fresh polystyrene adsorbent beads to the separated lipid mixture.\nIncubate the mixture for 1 h at 4 °C under slow stirring.",
    "Separate the beads from the mixture as described in step 1.13 and add 30 mg/mL of fresh polystyrene adsorbent beads.\nIncubate the mixture for 16 h at 4 °C.\nSeparate the beads from the mixture as described in step 13 and add 30 mg/mL of fresh polystyrene adsorbent beads.\nIncubate the mixture for 2 h at 4 °C for a fourth and final wash.\nCentrifuge at 110,000 x g for 30 min at 4 °C.\nWash the pellet with 500 µL of TS buffer containing 2 mM β-mercaptoethanol.\nCentrifuge again at 110,000 x g for 30 min at 4 °C.\nResuspend the pellet to a final lipid concentration of 25 mg/mL in TS buffer with 2 mM β-mercaptoethanol.\nEstimate the protein concentration using an in-gel or amido black assay36.\nAliquot the proteoliposomes, flash freeze in liquid nitrogen, and store at -80 °C.\n2. Chip preparation\nFill a single sensor chip with 50-100 µL of 0.5 mM 1-octadecanethiol solution (resuspended in isopropanol).\nIncubate the chip with the solution for 30 min at RT.\nRemove the thiol solution by tapping the chip on a tissue.\nRinse the sensor 3 times with 5 mL of pure isopropanol.\nRinse the sensor 3 times with 5 mL of double distilled water.\nDry the sensor by tapping on a tissue paper.\nApply 1.5 µL of 7.5 µg/µL 1,2-diphytanoyl-sn-glycero-3-phosphocholine (lipids dried in a rotatory evaporator and resuspended in n-decane).\nImmediately after, fill the sensor with 50 µL of non-activating SSM buffer, which does not contain the substrate. This will lead to a spontaneous formation of the SSM layer.",
    "NOTE: The SSM buffer should be optimized beforehand to determine optimal conditions that have low background noise. A general buffer containing 30 mM HEPES pH 7.4, 5 mM MgCl2, 140 mM NaCl, can be used as a starting point. The SSM buffer without the substrate is used for washing before and after the measurement (non-activating buffer). To avoid buffer mismatch, use the non-activating buffer to prepare the buffer containing the substrate (activating buffer). The substrate can be added either directly as a powder or in a small volume from a high concentration stock to avoid dilutions.\nThaw proteoliposomes from step 1.24 at RT.\nDilute proteoliposomes between 1:5 and 1:100 (proteoliposomes:buffer, (v:v)) in the non-activating SSM buffer (here 1:20).\nSonicate proteoliposomes for 20-30 s or 3 times for 10 s, placing on ice in between sonication, if necessary. Here a water bath sonicator at 45 kHz was used.\nApply 5-10 µL of the diluted sonicated proteoliposomes sample on the surface of the sensor without touching it.\nCentrifuge the chips with the solution at RT for 30 min using a speed between 2,000 and 3,000 x g.\n\tNOTE: Use 50 mL tubes with a flat bottom. Carefully place the sensor chips upright using tweezers. 6-well plates and a centrifuge with a plate holder can also be used.\nUse the sensor chips on the same day.\n3. Measuring the solute transportation: determination of saturation conditions\nNOTE: As proof-of-principle, these experiments were performed using a bacterial choline transporter reconstituted in liposomes following the protocol described above. The step-by-step process of determining saturating conditions of the substrate choline prior to the measurement of inhibition by nanobodies is shown here.\nPrepare 1-2 L of the non-activating SSM buffer.\n\tNOTE: Prepare and use the same SSM buffer stock for all activating and non-activating buffers throughout all measurements.",
    "Take 10 clean tubes and transfer 10 mL of the non-activating SSM buffer into each.\nAdd the substrate into the tubes from step 3.2 using a series of concentrations around the expected half maximum concentration (here 15, 10, 5, 1, 0.5, 0.1, 0.05, 0.01, 0.005, 0.001 mM of choline) to prepare the activating SSM buffers. Use a high concentration stock to avoid dilutions.\nSwitch on the SSM machine.\nStart the SSM software and let the machine initialize automatically. Set the saving path for data and confirm by hitting the OK button. Select the standard Initial Cleaning Protocol in the workflow options and click Run.\nMount the proteoliposome coated chip on the socket, move the arm to lock the chip, and close the mounted chip with the cap.\nSelect the program CapCom in the workflow and let it Run to determine the conductivity and capacitance. Confirm that the conductivity is below 5 nS and the capacitance is between 15 and 35 nF before using it for the measurement.\n\tNOTE: A capacitance value of 15-35 nF and conductance below 5 nS are recommended by the manufacturer when using a 3 mm chip.\nTransfer the activating solutions into vials and position the buffers in the probe sampler.\nTransfer the non-activating buffer into a reservoir and position it next to the chip holder at the reservoir position on the right.\nCreate a protocol for the workflow using a sequence of non-activating (B), activating (A), and non-activating (B) solutions (B-A-B sequence) and a loop that performs three measurements and moves to the next activating buffer for all 10 buffers prepared in step 3.3. Use the default flow rate at 200 µL/s using 1 s - 1 s - 1 s flow times for the B-A-B sequence. Click Play to start the measurement.",
    "NOTE: A typical experiment consists of the sequential flow of non-activating (B), activating (A), and non-activating (B) solutions (written as B-A-B; see Figure 1A). The immobilized proteoliposomes on the sensor will be washed with the solutions. Therefore, the B-A solution exchange generates a substrate concentration gradient, which drives the electrogenic transport reaction.\nSave the protocol and let the workflow run by clicking on the Play button. Perform the same type of experiment but using protein-free liposomes. This is highly important as it would show the intensity of background currents. This should be considered when analyzing data of electrogenic transport measured with proteoliposomes (Figure 1C).\nUse any preferred software for data analysis to plot the measured current versus time. Read out the peak current manually, or if using the software, use the function for peak height estimation in the range of the addition of the activating buffer.\nPlot the peak current against the substrate concentration to determine the EC50 of the substrate via the nonlinear regression (Figure 1B,C). Read out the lowest concentration at which the peak current reaches a maximum value, this concentration corresponds to saturating conditions.\n\t​NOTE: It is important to consider that the number of proteoliposomes that remain immobilized varies from chip-to-chip. This variation is evident as the peak currents at identical measurement conditions will show different amplitudes. Therefore, it is necessary to normalize the current amplitudes of measurements performed on each chip separately before comparing measurements among different chip preparations.\n4. Serial classification of inhibitory and non-inhibitory nanobodies\nNOTE: This section shows how to measure choline transport in the presence of nanobodies that bind specifically to the bacterial choline transporter. Smaller peak currents in the presence of nanobodies indicate transport inhibition. Non-inhibitory nanobodies will not impact substrate transport, i.e., no decrease of the peak current signal.",
    "Prepare 1-2 L of non-activating SSM buffer.\nTransfer 50 mL of the non-activating SSM buffer into a clean tube. Add the substrate choline to a final concentration of 5 mM (saturating conditions). Use this for a positive control measurement.\nTransfer 10 mL of the non-activating SSM buffer into a clean tube. Add the substrate choline to a final concentration of 5 mM (saturating conditions) and add nanobody to a final concentration of 500 nM.\nRepeat step 4.3 for each nanobody to prepare the activating solutions.\n\tNOTE: If the purified nanobodies are resuspended in a different buffer than the SSM buffer, their addition to the activating and non-activating buffers will lead to a buffer mismatch. A buffer mismatch should be avoided since it can lead to high noise. Exchanging the buffer of the purified nanobodies with the SSM buffer can help to avoid this issue. Furthermore, using nanobody concentrations that allow to reach saturating conditions is recommended. Considering that the binding constants of nanobodies are generally below 100 nM, a nanobody concentration of 500 nM is recommended for this experiment. However, it is important to pre-screen for optimal concentrations.\nStart the SSM machine and measure the capacitance and conductivity of the proteoliposome coated chip as described in steps 3.4-3.7.\nTransfer the activating solution without a nanobody into a vial and place the buffer in the probe sampler. Transfer the non-activating buffer without a nanobody into a reservoir and position it in the probe sampler.\nTransfer the activating solutions containing nanobodies into vials and position the buffers in the probe sampler. Transfer the non-activating buffers containing nanobodies into vials and position the buffers in the probe sampler.\nCreate a protocol for the workflow using a sequence of non-activating (B), activating (A), and non-activating (B) solutions (B-A-B sequence).",
    "Create a loop that performs the following: three measurements of the B-A-B sequence using buffers without nanobody, two measurements of the B-A-B sequence with buffers containing a nanobody, 120 s delay time for incubation with the nanobody, then 3 measurements of the B-A-B sequence with buffers containing the nanobody.\nSave the workflow and let it run by clicking the Play button.\n\tNOTE: This workflow will measure the initial conditions of the transport without inhibition by running the B-A-B protocol 3 times using non-activating (B) and activating buffers (A) without the nanobody (Figure 1B,C), followed by the measurement of the nanobody effect on the transport by running the B-A-B protocol 5 times with the non-activating and activating buffers containing nanobodies (Figure 2A). The second order binding kinetics dictate the interaction of nanobodies and their target proteins. Therefore, it is important to use a time delay in the B-A step in order to give enough time for nanobodies to bind to transporters in proteoliposomes on the chip. Optimal times depend on the nanobody concentration i.e., at lower concentrations longer times are required. The first two measurements are required to adapt the system to the new conditions and the second run should be performed after a delay time of 120 s. Only the following three measurements should be used for data analysis.\nCreate a new protocol for the workflow using a sequence of non-activating (B), activating (A), and non-activating (B) solutions (B-A-B sequence) and a loop of 5 measurements to wash out the reversibly bound nanobody.\n\tNOTE: Optionally, include an incubation step to allow dissociation of nanobodies with slow kinetics.\nSave the workflow and let it run by clicking the Play button.",
    "Compare the last peak current of the measurements with the initial substrate-only measurement in step 4.10. The nanobody has been successfully washed out and the initial conditions have been reestablished if the peak current reaches the initial value, otherwise repeat steps 4.12-4.13 or change to a new chip.\nRepeat steps 4.6-4.13 and use individual chips for each nanobody screen (Figure 2C) or repeat with multiple nanobodies using the same chip (Figure 2D).\nUse any preferred software for data analysis to plot the measured current versus time. Read out the peak current manually, or if available, in the used software, automatically select the function for peak height estimation in the range of the addition of the activation buffer.\nNormalize the peak current in presence of the nanobody, based on the preceding substrate-only measurement. Plot the peak currents in a histogram and compare the peak currents of the substrate only measurements to the peak currents measured in the presence of nanobodies (Figure 2C,D) to identify inhibitory nanobodies.\n\tNOTE: Normalization of the determined peak currents of each individual run with a nanobody should be performed considering the peak current in the absence of the nanobody from the preceding measurement. Also, since the number of proteoliposomes that remain immobilized vary from chip-to-chip, it is important to normalize the current amplitudes of measurements performed on each chip separately before comparing measurements among different chip preparations.\n5. IC50 measurement with inhibitory nanobodies\nNOTE: After identifying inhibitory nanobodies, it is possible to determine their half maximal inhibitory concentration (IC50). This is done by measuring the transport of choline at constant concentration, while varying concentrations of the inhibitory nanobody.\nPrepare 1-2 L of the non-activating SSM buffer.",
    "Transfer 50 mL of the non-activating SSM buffer into a clean tube. Add the substrate choline to a final concentration of 5 mM (saturating conditions). Use this as the activating solution for positive control.\nTake 8 clean tubes and add 5 mL of the non-activating solution into each. Add the substrate choline to a final concentration of 5 mM (saturating conditions). Add the inhibitory nanobody to the tubes at concentrations in the expected IC50 range (here 500 nM - 1 nM).\nTake 8 clean tubes and add 10 mL of the non-activating solution into each. Add inhibitory nanobody to each tube individually at the same concentration as in step 5.3. This corresponds to the non-activating buffer.\n\tNOTE: This will generate a series of activating and non-activating buffer pairs at different concentrations of the same inhibitory nanobody.\nStart the SSM setup and measure the capacitance and conductivity of the proteoliposome coated chip as described in steps 3.4-3.7.\nTransfer the activating solution without nanobody into a vial and place it in the probe sampler. Transfer the non-activating buffer without nanobody into a reservoir and position it at the reservoir position next to the chip holder on the right.\nTransfer the activating solutions containing nanobodies into vials and position the buffers in the probe sampler. Transfer the non-activating buffers containing nanobodies into vials and position the buffers in the probe sampler.",
    "Create a protocol for the workflow using a sequence of non-activating (B), activating (A), and non-activating (B) solutions (B-A-B sequence). Include a loop to measure each concentration 2 times, incubate for 120 s and measure 3 more times. The workflow will start with the positive control of substrate-only followed by the lowest concentration of the nanobody. Each nanobody measurement will be followed by a subsequent measurement of the positive control with substrate-only to restore the initial peak amplitude, before moving to the next higher nanobody concentration.\n\tNOTE: The second order kinetics dictate the binding of nanobodies. Therefore, it is important to use a time delay in the B-A step. Optimal times depend on the nanobody concentration i.e., at lower concentrations longer times are required; here 120 s was used with satisfactory results.\nUse any preferred software for data analysis to plot the measured current versus time. Read out the peak current manually, or if using software, select the function for the peak height estimation in the range of the addition of the activation buffer (Figure 3A). Plot the peak currents against the nanobody concentration to determine the IC50 via non-linear regression (Figure 3B).\n\t​NOTE: Normalize the current amplitudes of measurements performed for each individual chip before comparing measurements among different chip preparations.\n6. Cleaning of sensors\nRinse the single sensor chips after use with 10 mL of distilled water.\nDry the chip by tapping it on a tissue paper.\nFill the sensor cavity of the chip with 100 µL of pure isopropanol and incubate for 10 min at RT.\nPlace a cotton swab in pure isopropanol and incubate for 1-3 min.\nUse the presoaked cotton swabs and gently rotate on the sensor's surface without pressure to remove residues.\nRinse the sensor with 5 mL of pure isopropanol.",
    "Rinse the sensor with 10 mL of distilled water.\nDry the sensor by tapping the chip on a tissue.\nLet the sensor dry overnight at RT, and store at RT under dry conditions.\n\tNOTE: Sensors can be re-used up to 4-5 times when cleaned and stored properly.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}