{
  "id": 13015,
  "origin_website": "Jove",
  "title": "Optogenetic Signaling Activation in Zebrafish Embryos",
  "procedures": [
    "Zebrafish research protocols were reviewed and approved by the NICHD Animal Care and Use Committee at the National Institutes of Health (ASP 21-008). All zebrafish studies were carried out in compliance with the Guide for the Care and use of Laboratory Animals.\n1. Building a light box\nTo control light exposure and temperature, construct a light box that uses a light-emitting diode (LED) microplate illuminator as a light source (Figure 2A, Table of Materials, Supplementary File 1 , Supplementary File 2). This customizable illuminator provides dynamic, programmable control over multiple wavelengths.\n\tNOTE: There are many possible strategies to build a light box, and an alternative approach may be more appropriate (see e.g., Gerhardt et al.51, Bugaj et al.52, Kumar and Khammash53, and more at https://www.optobase.org/materials/).\nInclude the following features in the light box: Temperature control (28 °C is ideal for zebrafish embryos), exclusion of unwanted light (e.g., room light and sunlight), uniform delivery of blue light that covers the target area (e.g., 6-well plate), and control over light intensity and exposure dynamics.\n\tNOTE: bOpto-BMP/Nodal are activated by blue light, but some optogenetic tools respond to other wavelengths. Use the appropriate wavelength for the optogenetic tool.\nDrill a hole through the top of an incubator (Figure 2B) that is slightly wider than the LED output lens.\n\t\nEnsure there are no electrical components in the top of the incubator that will be destroyed by drilling (Table of Materials). This can be ascertained by contacting the incubator manufacturer and asking directly.\nIf there is an existing hole on the incubator's top panel, use a step drill to increase the hole size to 1.25 inches. Otherwise use a 1.25 inch hole saw with arbor.",
    "If there are internal panels that block the light source, drill the appropriate hole size to ensure the light cone is not blocked (Figure 2A). Panels are typically made of thin sheet metal, so use slow speeds and metal drill bits to prevent damage (cobalt drill bit recommended).\nConstruct an LED holder to secure the LED microplate illuminator to the top of the incubator (Figure 2C, Supplementary File 3, Supplementary File 4, Supplementary File 5, Supplementary File 6, Supplementary File 7, Supplementary File 8).\n\t\nMount four M3 cube standoffs to the vertical bracket piece using M3 screws.\nAttach the two side brackets to the left and right of the vertical bracket's cube standoffs. Mount another cube standoff to the leftover hole on the side brackets.\nMount the vertical bracket piece to LED microplate illuminator assembly (Table of Materials) using M6 screws. Place the LED lens gasket over the LED system lens.\nMount the assembled pieces to the incubator panel mount, then to the M3 standoffs on the vertical and side brackets. Place the incubator gasket over the drilled hole on top of the incubator.\nPlace the incubator panel mount on top of the incubator gasket, ensuring the gasket and panel openings are concentric with the incubator's hole. Mount panel to incubator top using no. 8 screws. Ensure this seal is light-tight.\nPlace a 6-well plate on the top shelf of the incubator. Determine whether the light beam uniformly covers the plate (Figure 2A). Use a sheet of paper to visualize light coverage.\nIf the entire plate is not covered by the beam, increase the distance between the LED and plate by moving the shelf down. For the system described here, ~14 inches between the LED and shelf is sufficient.",
    "Use a light meter to determine the irradiance level and spatial uniformity (Table of Materials).\nTo avoid inadvertent sunlight and room light exposure, use weather stripping to ensure that the incubator door is light-tight (Figure 2A).\nZebrafish embryos develop robustly at 28 °C54. Use a memory card thermometer to ensure that the light box holds 28 °C.\n2. Generating mRNA for injection\nNOTE: pCS2+ is the vector backbone for bOpto-BMP constructs38 and bOpto-Nodal constructs39. This vector is ampicillin resistant. bOpto-BMP is composed of three constructs (Figure 1B): BMPR1aa-LOV (Addgene # 207614): Putative kinase domain of the type I BMPR1aa receptor (also known as Alk3) fused to LOV; Acvr1l-LOV (Addgene # 207615): Putative kinase domain of the type I Acvr1l receptor (also known as Alk8) fused to LOV; and BMPR2a-LOV (Addgene # 207616): Putative kinase domain of the type II BMPR2a receptor and following C-terminal domain fused to LOV. bOpto-Nodal is composed of two constructs (Figure 1E): Acvr1ba-LOV: Putative kinase domain of the type I Acvr1ba receptor (also known as Acvr1b) fused to LOV; Acvr2ba-LOV: Putative kinase domain of the type II Acvr2ba receptor (also known as Acvr2b) fused to LOV.\nTo linearize plasmids, digest between 2-5 µg plasmid DNA using NotI restriction enzyme at 37 °C for 1-3 h (Table of Materials).\n\tNOTE: It is also possible to generate linearized DNA using the plasmid as PCR template.\nPurify DNA using a standard column-based purification kit (Table of Materials).\nUse an in vitro SP6 transcription kit such as a mMessage mMachine kit to transcribe RNA from the linearized template (Table of Materials). Set up two reactions according to manufacturer's recommendations to ensure higher yield.\nPurify RNA using a standard column-based RNA cleanup kit (Table of Materials). It is also possible to purify via precipitation.\n3. Injecting mRNA",
    "At least 1 day in advance of injections, make injection dishes and agarose-coated 6-well plates.\n\t\nPrepare 200 mL of 1% agarose in zebrafish embryo medium and microwave until the agarose has dissolved completely. Any standard zebrafish embryo medium should be acceptable; however, exclude methylene blue from embryo medium as it can affect downstream imaging in other applications.\nCarefully pour molten agarose into 100 mm x 15 mm plastic petri dishes. Fill the dishes halfway.\nRinse an injection dish mold with embryo medium and place gently onto molten agarose, ensuring no bubbles are trapped between the mold and agarose. Use tape to make a tab on the back of the mold for easy placement and retrieval.\nThe mold should float in the molten agarose. If the mold sinks, carefully remove from the molten agarose and repeat step 3.1.3.\nAfter agarose has solidified, use the tab to gently remove the mold. This can be accelerated by placing the dish at 4 °C.\nMake agarose-coated 6-well plates if working with dechorionated embryos for immunofluorescence experiments.\nUse a disposable 10 mL plastic pipette to transfer enough molten agarose to cover the bottom of each well of a 6-well plate.\nStore injection dishes and 6-well plates at 4 °C. They can be used immediately or stored until the agarose is dried out or contaminated (usually 2-3 weeks).\nPrepare flamed glass pipette tips if working with dechorionated embryos for immunofluorescence experiments.\nInsert the end of a glass pipette into a Bunsen burner flame and rotate continuously until the edges are smooth. Dechorionated embryos must comfortably fit through the end of the pipette. Do not allow the opening to shrink below the diameter of an embryo.",
    "Either purchase or pull microinjection needles (Table of Materials). It is advisable to have extra needles available on the day of injections in case a replacement is necessary.\nThe day before injections, set up zebrafish breeders according to the institute's standard operating procedures (SOPs). Keep males and females separated.\n\t\nSwitch on the light box temperature regulator to maintain 28 °C. To ensure the light box temperature stays at 28 °C, monitor temperature using a memory card thermometer (Table of Materials).\nPrepare mRNA injection mix(es). Inject equimolar amounts of each construct. It is necessary to empirically determine what amount to inject.\nbOpto-BMP transcript sizes are as follows:\n\t\tAcvr1l-LOV = 2007 nucleotides (nt)\n\t\tBMPR1aa-LOV = 1983 nt\n\t\tBMPR2a-LOV = 3409 nt\nTo inject equimolar amounts, inject 1.01x more of the Acvr1l construct than BMPR1aa; inject 1.72x more of the BMPR2a construct than BMPR1aa.\nbOpto-Nodal transcript sizes are as follows:\n\t\t​Acvr1ba-LOV and Acvr2ba-LOV are both 1962 nt.\nTo inject equimolar amounts, inject same amount of each construct.\nPrepare equimolar injection mixes, combining all mRNAs targeting one pathway into one injection mix. Include phenol red injection tracer if desired. For the data shown in Figure 4, 15 pg of each bOpto-Nodal construct (Acvr1ba-LOV and Acvr2ba-LOV) was used, and for bOpto-BMP 7.8 pg Acvr1l-LOV and BMPR1aa-LOV, and 13.4 pg BMPR2a-LOV was used.\nStore injection mixes at -20 °C. Once the optimal concentration of injection mix has been determined, make 5-10 µL aliquots and store at -20 °C or -80 °C.\nInjection day\n\t\nIf performing a phenotyping assay (Figure 3A), inject through the chorion directly into the center of the cell at the one-cell stage according to your lab's SOP. The chorion protects embryos from environmental stressors and keeps lysed embryos contained. This is helpful during scoring for accurate quantification of lysed embryos (Figure 4A,B).",
    "If performing an immunofluorescence assay (Figure 3B), embryos will eventually need to be dechorionated for imaging (Figure 4C). Therefore, inject directly into the center of the cell of dechorionated embryos at the one-cell stage (see Rogers et al.55 for dechorionating protocol). Alternatively, embryos can be manually dechorionated after fixation, but this is more cumbersome than dechorionating with pronase.\nUse flamed glass pipettes to handle dechorionated embryos (step 3.1.10). Take care to not expose dechorionated embryos to air or plastic, which will cause embryos to lyse. Handle dechorionated embryos gently.\nPrepare an extra dish of non-injected embryos as a proxy to evaluate stage progression (see step 4.3.5). Ensure proxy embryos are from the same set of experimental embryos, such that all embryos were fertilized at the same time from the same parents. This is useful for the immunofluorescence assay where stage is relevant but is unnecessary for the phenotyping assay.\nUse the following conditions for both the phenotyping and immunofluorescence assays: 1) non-injected, unexposed, 2) non-injected, exposed to light, 3) injected, unexposed, 4) injected, exposed to light. Select at least 30 embryos per condition. For optimal embryo health, do not incubate more than 30 embryos per well in a 6-well plate.\nAfter injection, transfer embryos to labeled Petri dishes or agarose-coated 6-well plates (for dechorionated embryos) and incubate at 28 °C. Embryos are not yet light sensitive. Treat injected embryos as though they are light sensitive after 1.5 hours post-fertilization (hpf).\n4. Light exposure experiment\nNOTE: Exposure to ~450 nm light with an irradiance of 45 W/m2 robustly activates bOpto-BMP/Nodal without obvious phototoxicity (for light meter information, see Table of Materials). The level of optogenetically activated signaling can be tuned by changing irradiance values38. However, phototoxicity will need to be assessed at higher irradiances.",
    "Time-sensitive step. At the 4- to 16-cell stage, around 1.5 hpf, remove unfertilized and unhealthy embryos. Redistribute if necessary to ensure the same number of embryos in each well (no more than 30).\n\tNOTE: It is important to perform this step around the 4- to 16-cell stage because embryos will become light sensitive as the injected mRNA is translated to protein. We have not observed evidence that embryos are significantly light sensitive prior to 1.5 hpf. To minimize inadvertent photoactivation if assessing embryos after 1.5 hpf, use red lights, or cover light sources-including microscope stages-with red gel filter paper that blocks LOV-dimerizing blue wavelengths (Table of Materials).\n\t\nEvaluate embryos consistently to ensure unbiased distributions between conditions and experiments.\nFor the phenotyping assay, use the following 1-day light exposure protocol starting at 1.5 hpf (Figure 3A).\n\t\nWrap the unexposed control plate in aluminum foil. This plate should include both non-injected and injected embryos. Be sure the plate is entirely covered and take care not to introduce tears into the foil. Place this plate on the lower shelf of the 28 °C light box (Figure 2A).\nPlace the exposed plate on the top shelf of the 28 °C light box (Figure 2A). Ensure the cover is on the dish to avoid embryo medium evaporation. Turn on the blue light (an irradiance of 45 W/m2 robustly activates signaling).\nClose the light box door to avoid inadvertent room light exposure. If desired, include a memory card thermometer inside the light box before closing the door. Do not open the door until phenotype scoring at 1-day post-fertilization (dpf; see step 5.1).",
    "For the immunofluorescence assay, expose embryos to blue light for 20 min starting around 40% epiboly56 (~6 hpf) and fix immediately after light exposure, together with the unexposed controls (Figure 3B). A 20 min blue light exposure at 40% epiboly reproducibly activates signaling.\n\t\nAround 1.5 hpf, separately wrap both the exposed and unexposed dishes in aluminum foil. Be sure the dishes are entirely covered and take care not to introduce tears into the foil. Leave the proxy dish unwrapped. Place the wrapped dishes and the unwrapped proxy dish in the 28 °C light box (Figure 2A). Do not turn on the LED yet.\nIf testing more than one mRNA amount, for the unexposed condition, sort embryos injected with different amounts into individual agarose-coated 6-well plates, which will help minimize inadvertent light exposure during subsequent fixation.\nClose the light box door to avoid inadvertent room light exposure.\nDilute formaldehyde stock to 4% in 1x phosphate-buffered saline (PBS) and aliquot 1 mL into pre-labeled 2 mL round bottom microcentrifuge tubes, one tube per condition. Store at 4 °C.\nAround 5 hpf, remove the proxy dish containing non-injected embryos and assess the developmental stage using a dissecting scope. The stage of the proxy embryos should reflect the stage of the light-sensitive embryos in the wrapped dishes.\nRemove the wrapped dishes as well, so all dishes experience the same temperature. Repeat until proxy embryos have reached 40% epiboly (~6 hpf). Embryogenesis progression is temperature-sensitive54; therefore, the longer the dishes are outside of the incubator, the longer it will take for the embryos to reach 40% epiboly.",
    "Once the proxy embryos have reached 40% epiboly, unwrap the exposed dish and place it on the top shelf of the light box (Figure 2A). Leave the unexposed dish(es) wrapped and place on the lower shelf. Immediately turn on the blue light, close the door, and set a timer for 20 min (an irradiance of 45 W/m2 robustly activates signaling).\nTo prepare for fixation, eliminate as much room light as possible (close window blinds, turn off the overhead lights, turn off screens, etc.). Ensure the formaldehyde-containing tubes are appropriately labeled. Immediately before fixation, remove formaldehyde-containing tubes from 4 °C and place next to the light box.\nTime- and light-sensitive step. Be prepared to move quickly at the end of the 20 min light exposure. After 20 min, open the light box door and remove the unexposed dish.\nUse a flamed glass pipette tip to transfer light-sensitive embryos quickly but gently into the prepared corresponding tube of 4% formaldehyde.\nMinimize the transfer time (<45 s) of light-sensitive embryos to avoid inadvertent light exposure. Ensure there are no air bubbles in the pipette. Air exposure will destroy dechorionated embryos.\nTo eject embryos into formaldehyde, submerge the glass pipette tip in the formaldehyde and allow the embryos to sink into the liquid. Minimize the amount of embryo medium that is transferred to the formaldehyde by keeping the embryos at the end of the tip.\nAfter embryos are transferred, return the pipette to the same well and pipette up and down to dislodge any stuck embryos. This prevents embryos from multiple conditions accidentally ending up in one tube.\nImmediately repeat steps 4.3.11-4.3.13 for the unexposed, non-injected embryos, followed by the exposed embryos (injected and non-injected).\nStore fixed embryos at 4 °C overnight.\n5. Experiment evaluation\nPhenotype scoring and imaging",
    "At 1 dpf, ideally between 24-32 hpf, remove embryos from the light box to assess phenotypes using a dissecting scope and create a scoring rubric. This is the experimental endpoint; inadvertent photoactivation is no longer a concern.\nScore embryos while still in the chorion for ease. Use a pipette or probe to move embryos in order to view from multiple angles.\n\t\t\nEmbryos experiencing excess BMP signaling will be ventralized with varying degrees of severity as described in detail in Kishimoto et al. 199746 (Figure 4A, left panel). Embryos experiencing excess Nodal signaling will have a range of developmental defects related to excess mesendoderm (Figure 4A, right panel)1,3,47,57,58,59,60. They will often have lysed by 1 dpf.\nScore each embryo in all conditions (Figure 4B). Acquire an overview image of all embryos in each well. If desired, dechorionate and image individual representative embryos in methylcellulose (Figure 4A).\nImmunofluorescence staining and imaging\n\t\nAfter incubating embryos in 4% formaldehyde at 4 °C overnight, remove formaldehyde and wash 3-5x with 1x phosphate-buffered saline with Tween20 (PBST). Remove PBST and add 100% methanol.\nClose tubes and gently invert them to mix residual PBST and methanol. Wash 2x with methanol and store at -20 °C for at least 2 h up to years.\nFor pSmad1/5/9 (BMP) immunofluorescence protocol see Rogers et al.38. For pSmad2/3 (Nodal) immunofluorescence protocol see van Boxtel et al.17 and Rogers et al.47.\nImage immunostained embryos, using a microscope capable of optical sectioning (e.g., a confocal or light sheet microscope). Avoid saturation and maintain identical imaging conditions between all samples stained with the same antibody.\nImage within 5 days of completing the immunofluorescence staining because fluorescence may fade over time."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}