{
  "id": 5008,
  "origin_website": "Bio",
  "title": "Procedure for Rhamnolipids Quantification Using Methylene-blue",
  "procedures": [
    "P. aeruginosa PAO1 culture and rhamnolipids extractionP. aeruginosa PAO1 was grown with agitation (175 rpm) at 37 °C for 18 h in a sterile culture tube (14 ml) containing 5 ml LB-MOPS medium (initial A600 of the culture was between 0.020 and 0.025). After incubation, culture of P. aeruginosa in mid-stationary phase was centrifuged (3,200 x g, 24 °C, 5 min) to obtain supernatant and pellet. 4 ml of supernatant was filtered (0.1 µm filters, 20 x g) to remove cells. Then, pH of cell-free supernatant was adjusted to 2.3 ± 0.2 using 1 N HCl (≈ 80 µl). Rhamnolipids were extracted by mixing 4 ml of supernatant with 4 ml of ethyl acetate. The non-miscible mixture was vigorously vortexed (600 rpm) for 20 sec and phase separation was realized by centrifugation in a tabletop centrifuge at speed 100 x g for 1 min. The upper, rhamnolipid-containing organic/ethyl acetate phase was transferred to a new reaction tube (30 ml). Ethyl acetate phase should be carefully removed without taking any liquid from the top aqueous layer. Extraction procedure was repeated three times and ethyl acetate extracts were combined in the reaction tube and evaporated to dryness in speedvac centrifugal evaporator (generally evaporated in 30 min at 200 x g speed) and immediately quantified.Rhamnolipids quantificationFormation of chloroform-methylene blue complex Dry rhamnolipid-extract was dissolved in 4 ml chloroform and mixed with 400 µl methylene blue solution (freshly prepared). Tubes were vigorously mixed by vortexing for 5 min, then incubated at ambient temperature for 15 min to allow for color formation.Note: The chloroform phase will develop a blue color, proportional to the concentration of rhamnolipids. Cover tubes with aluminum foil to minimize chloroform evaporation during incubation [Figure 1(d)].imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160329/20160329070338_0925.jpgFigure 1. Expected results during chemical complexation reaction step. (a).",
    "Methylene blue complexation in chloroform containing 100 µg/ml of rhamnolipids (1) and chloroform without rhamnolipids (2) at T5 min. (b). Methylene blue complexation in chloroform containing 100 µg/ml of rhamnolipids (1) and chloroform without rhamnolipids (2) at T10 min. (c). Methylene blue complexation in chloroform containing 100 µg/ml of rhamnolipids (1) and chloroform without rhamnolipids (2) at T15 min. (d). Methylene blue aqueous solution (MB) and chloroform containing 100 µg/ml, 50 µg/ml, 25 µg/ml, 12.5 µg/ml and 0 µg/ml of rhamnolipids complexed with methylene blue. T represents incubation time for complexation.Measurements stepOne ml of the chloroform (lower) phase was transferred in a clear microcentrifuge tube (2 ml) and mixed by vortexing for 20 sec with 500 µl of HCl 0.2 N. Phase separation was then realized by centrifugation in a tabletop centrifuge at speed 100 x g for 1 min and the solution was left at room temperature for 10 min to optimize methylene blue extraction in HCl. Finally, 200 µl of the upper acidic phase, containing a portion of the complexed methylene blue, was transferred in a 96-well microplate and the absorbance was measured at 638 nm with SpectraMax M2 device against an HCl 0.2 N blank.Rhamnolipids calibration curve generationRhamnolipids standard solution was prepared by dissolving 8 mg of rhamnolipids in 4 ml of chloroform. This solution is used to generate different concentration of rhamnolipids by dilution in chloroform (i.e. 12.5 µg/ml, 25 µg/ml, 50 µg/ml, 100 µg/ml and 200 µg/ml). For each concentration, formation of chloroform-methylene blue complex and measurements steps were carried out to generate calibration curve equation (Figure 2; Table 1)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}