{
  "id": 17833,
  "origin_website": "Jove",
  "title": "CO2-Lasertonsillotomy Under Local Anesthesia in Adults",
  "procedures": [
    "1. Patient Selection\nConsider inclusion of patients with the following tonsil-related diseases: recurrent tonsillitis; dysphagia caused by large tonsils; tonsil stones; obstructive sleep apnea related to tonsils.\nInclude only adult patients.\nCheck for allergies, specifically to local anesthetics.\nAssess the gag-reflex intensity using the GSI (Table 1). For adequate CO2LT treatment, full visualization of the tonsils is required and patients need to be able to hold their breath for at least 15 s at a time.\nIn patients with a GSI > 2 consider the following exercise to decrease the gag-reflex intensity.\n\t\nInform the patient that the gag-reflex can be (partially) faded-out by training.\nExplain to the patient that the exercise will be uncomfortable in the first few days to weeks.\nAdvise the patient to use their toothbrush to gently touch / brush their tongue base and tonsils each time they brush their teeth (preferably twice a day). Instruct the patient to increase pressure when performing this procedure each sequential day.\nExclude the following patients: with Friedman grade IV (kissing) tonsils; with undertreated coagulation disorders; using any form of anticoagulants; with an active tonsil infection / peritonsillar abscess; women who are pregnant; those who are uncooperative during tonsil examination.\n2. Informed Consent and Pre-operative Instruction Visit\nObtain written informed consent including the following.",
    "Explain the intervention to the patient as follows: \"The tonsil(s) will be partially evaporated using a laser beam. Local anesthesia will be used to numb the tissue and therefore you will be fully awake and mentally present during treatment. No pain is expected during treatment and low to moderate pain may occur in the first days after treatment. Treatment will take approximately 10-15 min per tonsil. If no complications occur, admission to the floor after treatment is not necessary and you will be able to leave the hospital in 30 min to an hour after treatment, accompanied by a friend or relative that is able to drive you.\"\nExplain alternative treatment options (where applicable: expectant management, conventional tonsillectomy or antibiotics).\nExplain possible complications of the CO2LT including: per- and post-operative bleeding, infection, incomplete resolution of tonsil disease; need for a second tonsillotomy or a tonsillectomy, pain, allergic reaction to anesthetic, temporary change of taste, (temporary) damage to surrounding structures.\nInstruct the patient not to eat any heavy meals on the day of treatment.\nInstruct the patient to take 1,000 mg acetaminophen (paracetamol) 30 min before treatment if acetaminophen is not contraindicated in that specific patient (including, but not limited to active liver disease and liver failure).\nAsk patients with a troublesome gag-reflex during examination to reduce the gag-reflex by rubbing their tongue base and tonsils with their toothbrush at least twice a day for 1 min, preferably for at least 2 weeks.\n3. Preparation of Patient and Equipment\nAttach the laser pen to the CO­2-laser machine.",
    "Make sure that the correct settings are chosen (Figure 1) such as (i) continuous laser beam, (ii) 15-30 W intensity depending on the size of the tonsil; generally, start at 18 W and increase the power up to 30 W depending on the size of the tonsils and patient's cooperation, (iii) shape-size of 2-4 mm depending on the size of the (remainder of the) tonsil, (iv) shape: round.\nMake sure that the surgeon, the surgical technologist, and the patient are wearing laser safety glasses.\nMake sure that the surgeon and the surgical technologist are wearing appropriate protective surgical masks.\nConfirm that the headlight for the surgeon is working.\nConfirm that a pulse oximeter for patient monitoring is present.\nConfirm that wooden tongue depressors are within reach.\nCAUTION: Do not use metal depressors, since they can reflect the laser beam.\n4. Time-out Procedure\nAsk the patient for their name and date of birth.\nAsk the patient for the intervention that will take place.\nAsk the patient for the side of treatment.\nAsk the patient for any allergies, specifically for local anesthetics and medications.\nCheck with the surgical technologist if all equipment is present.\nCheck if the laser-indication light of the operating room is switched on and all windows are covered for laser safety.\n5. Patient Instructions Before Surgery\nAsk the patient to inhale deeply, followed by breathing out slowly during treatment.\nExplain to the patient that he/she is in control and can signal at any time, which will lead to a pause of the laser-treatment.\nInstruct the patient to use his/her hand to signal if they wish to pause treatment by tapping the surgeon’s leg.",
    "Instruct the patient not to swallow any liquids during treatment to prevent aspiration and laryngospasms. Provide a kidney basin to the patient to spit any liquids into when necessary.\nReassure the patient not to panic if they experience a feeling as if their airway is blocked, as this is due to local anesthesia of the pharynx region. Remind the patient again that the treatment can be paused at any moment.\n6. Positioning the Patient and Inspection of the Tonsils\nPlace the pulse oximeter on the patient's index finger and confirm that it is functioning correctly.\nPosition the patient in an upright position using the chair / table controls.\nSet the height of the chair / table so that the surgeon can stand straight comfortably while performing the laser treatment.\nAsk the patient to make any adjustments to the seating to ensure comfortable and safe positioning.\nInspect both tonsils and exclude active inflammation.\nAssess the gag-reflex using the GSI and judge the feasibility of the laser treatment. For adequate CO2LT treatment, the surgeon should be able to fully visualize the tonsils and patients need to be able to hold their breath for at least 15 s.\n7. Anesthesia of the Tonsil\nTell the patient that the tonsils will be anesthetized one at a time.\nIn case of a significant gag-reflex (GSI grade 2-3) use xylocaine-spray or superficial anesthesia of the tongue-base and pharynx to reduce the gag-reflex.\nTake an ampule with local anesthetic and inject ~0.2 mL slowly into the upper pole, ~0.2 mL into the mid-pole and 0.2 mL into the lower-pole of the tonsil.\nNOTE: Optionally, the tonsil-pillars can be infiltrated as well. This is recommended when the tonsils are hidden behind the pillars or to decrease the gag-reflex.",
    "Instruct the patient not to swallow any local anesthetic, but to spit it out.\nReassure the patient that any feeling of throat tightness is due to the anesthetic; not due to any actual obstruction.\n8. Laser-treatment of the Tonsil\nAsk the patient to breathe in deeply and exhale slowly.\nHave the surgical technologist hold the smoke suction close to the opening of the mouth, without blocking the surgeon's view.\nUse two wooden tongue blades to depress the tongue / tongue-base and expose the tonsil.\nDuring the patient’s exhalation, laser the lymphatic tissue of the lobules in a sweeping motion.\nStop when the patient taps your (the surgeon's) leg.\nLet the patient catch his/her breath again and repeat steps 8.1–8.4 until complete cryptolysis is accomplished.\nIf necessary, inject extra local anesthetic (with or without epinephrine).\n9. Tips for Laser Treatment\nIn case of peroperative hemorrhage: laser the spot that is bleeding \"out of focus\". This will lead to burning of the lymphatic tissue with crust formation with a similar effect as coagulation (opposed to evaporation when using the laser 'in focus'). Alternatively, use a (bipolar) coagulation device to stop the bleeding.\nUse the wooden tongue blades to press against the anterior tonsillar pillar to expose the tonsil further.\nUse the wooden tongue blades to press against the upper part of the tonsil pillars to expose the upper lobule of the tonsil.\nUse the wooden tongue blades to scoop up the lower tonsil lobule and expose it for laser treatment (one can leave them scooped up on the tongue blades).\n10. Instructions After Treatment\nGive the patient a popsicle for a minimum of 30 min of postoperative observation.\nInstruct the patient not to drink or eat anything else for 2 h until the local anesthetic has worn off to prevent aspiration.",
    "Instruct the patient not to drink / eat hot (temperature) or spicy drinks/food or food with hard crusts for a week to prevent postoperative bleeding.\nTell the patient to take pain medication only if necessary.\nNOTE: We advise a maximum of 1,000 mg acetaminophen (paracetamol) 4 times a day, if necessary.\nTell the patient to refrain from strenuous physical exercise for a week.\nAdvise the patient to go to the nearest emergency department in case a postoperative bleeding occurs. Advise the patient to contact the ENT department in case of a postoperative infection (e.g., fever)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}