{
  "id": 1896,
  "origin_website": "Cell",
  "title": "AdenoBuilder: A platform for the modular assembly of recombinant adenoviruses",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAssembly of HAd5 genome\nTiming: 3 h\nAd5 genomes are assembled in vitro from plasmid blocks. In most cases, a vector will be assembled from a combination of pre-made and user-customized plasmids.\nDigest a DNA mixture containing 500 fmol of each of the plasmid DNAs.\nAdd 500 fmol of each plasmid to a single 1.5 mL tube. The conversion of dsDNA mass units to fmol is easily performed with the NEBiocalculator.\nPrepare a 100 μL digestion reaction.\nTo the pooled plasmid DNAs, add 10 μL of 10× CutSmart buffer, provided with the BstBI enzyme.\nAdd UltraPure distilled water to a total volume of 95 μL.\nAdd 5 μL of restriction enzyme BstBI (20 Units/μL).\nVortex briefly, then pulse centrifuge to collect the liquid at the bottom of the tube.\nIncubate the reaction in a 65°C heating block or water bath for 30 min.\nPrecipitate digested plasmid DNAs.\nAdd 25 μL of 7.5 M Ammonium Acetate and 300 μL of 100% ethanol to the 100 μL digest. Vortex briefly.\nCentrifuge at room temperature for 5 min at maximum speed.\nDecant the supernatant.\nAdd 500 μL of 70% ethanol to wash the pelleted DNA. Centrifuge at maximum speed for 1 min at room temperature. A small pellet should be visible.\nCarefully decant the supernatant and use a pipette to remove remaining liquid, taking care not to disturb the DNA pellet. Air-dry the pellet at room temperature for 15 min, or until the last visible traces of ethanol have evaporated.\nDissolve the DNA pellet in 5 μL of ultrapure distilled water. Incubate the capped tube at 37°C for 30 min to ensure that the pellet is completely in solution.\nSet up the DNA Assembly reaction",
    "Add 5 μL of 2× NEBuilder HiFi DNA Assembly Master Mix to DNA, vortex briefly and centrifuge to bring all liquid to the bottom of the tube.\nIncubate the reaction at 45°C in a heating block or water bath for 1 h.\nFollowing incubation, put the assembled DNA on ice or store at −20°C for subsequent electroporation.\nCritical: Do not extensively dry the DNA pellet with heat or under vacuum. Removal of all moisture may make it difficult to fully dissolve the DNA. While the standard NEBuilder plasmid protocol calls for incubation at 50°C, conducting the assembly at 45°C results in increased production of full length genomes. Confirm the temperature of the water bath or heating block beforehand.\nNote: The total amount of DNA in the digest should range between 15 and 17 μg. It is not necessary to purify the assembled DNA before electroporation.\nElectroporation of packaging cells\nTiming: 45 min (+ 5 days)\nHEK293 cells are electroporated with the 4D-Nucleofector system equipped with the X module, using the materials provided with the SF Cell Line Kit. Use the CM130 program, as recommended for HEK293 cells. Turn on the 4D-Nucleofector System and set up the program in advance. Supplement the SF solution as per manufacturer’s instructions. Add 4 mL culture medium to a fresh T-25 flask and prewarm in the incubator.\nNote: HEK293 are maintained in DMEM cell culture medium supplemented with 6% fetal bovine serum and 1% penicillin-streptomycin. Approximately 2 × 106 cells should be freshly seeded in a T-25 flask the day prior to electroporation so that the cells are near confluence at the time of collection. We recommend using HEK293 cells that have been continuously passaged no more than 10 times.",
    "Aspirate medium. Detach HEK293 cells in 1 mL 0.05% trypsin/EDTA by incubation at 37°C for 5 min, or until they detach. Add 4 mL complete medium and gently swirl the flask to assure that all cells are detached. Count cells and transfer a calculated volume containing 2 × 106 cells to a 15 mL tube.\nCentrifuge cell suspension at 90 g for 10 min at room temperature. Aspirate and discard the supernatant.\nGently resuspend the cell pellet with 5 mL PBS at room temperature, centrifuge again, and discard the supernatant.\nTo the 1.5 mL tube containing the assembled DNA (10 μL) add 90 μL of supplemented Nucleofector SF solution.\nAdd DNA/SF solution mixture (100 μL) to the cell pellet. Resuspend cells by gently pipetting up and down and transfer to a 100 μL cuvette.\nGently tap the cuvette on a solid surface to dislodge any bubbles, and place into the 4D Nucleofector.\nElectroporate the cells with the preprogrammed pulse CM130.\nImmediately following electroporation, transfer the cells to the pre-warmed growth medium in the T25 flask. Return the flask to the incubator.\nCritical: The CO2 level in the cell culture incubator must be at 5% to ensure efficient virus packaging. We have found that packaging efficiency is dramatically reduced when CO2 levels are 3% or below. For consistent results, incubators should be calibrated regularly.\nAlternatives: Lipofection can be performed instead of nucleofection. We find that the titers of the primary lysates obtained after lipofection are usually lower. We recommend Lipofectamine 3000 Transfection Reagent (ThermoFisher cat# L3000001), used according to the manufacturer’s instructions, for this purpose.\nHarvesting virus\nTiming: 1 h",
    "Packaging cells may exhibit cytopathic effects, including significant amounts of detachment, 5 days after electroporation. If the desired virus retains wild type E1 genes, the cytopathic effects will be pronounced and the medium may acidify, turning from red to yellow (Figure 3[href=https://www.wicell.org#fig3]). Cytopathic effects are typically less obvious when packaging recombinant viruses in which the E1 region has been replaced. Proceed with the harvest on day 5 regardless of the appearance of the cells. Equilibrate a dry ice/ethanol bath and a 37°C water bath in advance.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1376-Fig3.jpg\nFigure 3. Packaging synthetic HAd5 genomes\nIn this experiment, a wild type HAd5 genome (containing unmodified Block 1) and a recombinant genome that expresses GFP from a transgene cassette (containing Block 1 ΔE1-GFP) were assembled in parallel from six plasmids. Following electroporation, cells were transferred to a T25 flask (step 11) and monitored for 5 days. Cytopathic effects were most apparent in the wild type HAd5 flask. Despite the absence of clear cytopathic effects, the levels of GFP increased in the flask with the recombinant genome lacking adenovirus E1 (E1-GFP). Acidification of the medium, indicated by the yellow color, was most striking in the wild type HAd5 flask but was also apparent in the E1-GFP flask. Following harvest, the viral content of the primary lysates were estimated by the rapid fluorescence focus-formation assay (steps 24–36). Magnification, 10×, Scale bar = 400 μm.\nWithout removing the medium, use a disposable cell scraper to detach the cells. Transfer all cells and culture media into a single 15 mL conical tube.\nVortex the cell suspension for at least 15 s and immediately freeze the cells by placing the tightly capped tube in the dry ice/ethanol bath.",
    "Completely thaw the lysate in a 37°C water bath. Remove when the lysate is just thawed and vortex for at least 15 s.\nRepeat freeze-thaw-vortex cycle two additional times.\nFollowing the last thaw and vortex, centrifuge the lysate at 10,000 g for 10 min at 4°C.\nTransfer the virus-containing supernatant to a new 15 mL conical tube.\nNote: Cells may detach completely by day 5. Proceed with step 12 regardless.\nPause point: The primary viral lysate can be stored at −80°C until ready for analysis or amplification.\nViral amplification\nTiming: 3–5 days\nOne or more rounds of amplification are usually required for the generation of high-titer recombinant adenovirus stocks. To amplify the primary lysate, seed approximately 5–6 × 106 HEK293 cells in a T-75 flask containing 10 mL culture medium one day before infection.\nInfect cells with 2 mL of the primary viral lysate from step 17.\nPeriodically monitor cells under the microscope for evidence of cytopathology, beginning at 3 days post infection. Handle flasks with care to avoid dislodging the cell monolayer.\nWhen cytopathic effects are evident, but before the cells fully detach, gently aspirate the medium. Do not wash the monolayer.\nAdd 0.5 mL of PBS (room temperature) and collect the cells with a cell scraper. Transfer the cell suspension to a 15 mL conical tube.\nLyse the cells by the freeze-vortex-thaw method, as described in steps 13–16.\nRemove the virus-containing supernatant and aliquot into screw-top cryotubes.\nPause point: The amplified viral lysate can be stored at −80°C until ready for analysis or further amplification.\nNote: Amplified viral lysates are often yellow due to acidification of the medium during packaging. This is a reliable indication of a relatively high viral titer. In this case, use 0.2 mL of the primary lysate for amplification.",
    "Optional: Amplified lysates can be used directly for many applications without further purification. If desired, a more concentrated and pure virus stock can be generated after one additional round of amplification. We recommend a simplified cesium chloride gradient centrifugation method for virus concentration and purification detailed in Luo et al. (2007)[href=https://www.wicell.org#bib5].\nEstimation of viral titers\nTiming: 3 days\nViral titers can be estimated by a simple focus-formation assay in which infected cells are fixed, permeabilized and stained with a fluorescent anti-hexon antibody. Plate HEK293 cells in a 48-well cell culture plate (∼5 × 104 cells in 0.5 mL medium/well) 48 h prior to infection.\nLabel four tubes for virus dilution. Add 1, 5, 25, or 125 μL of primary lysate to each tube. Bring the total volume in each tube to 125 μL by adding PBS.\nPrior to infection, remove the medium from each well. Replace with 200 μL fresh cell culture medium.\nAdd 125 μL of diluted (or undiluted) virus to each of four wells. Gently pipet up and down to mix. Incubate for 24 h.\nCarefully remove the medium and wash the monolayers once with 0.5 mL PBS.\nFix the cells with 200 μL 4% paraformaldehyde in PBS solution for 10 min.\nWash twice with 0.5 mL PBS.\nPermeabilize the cells with 0.5 mL 0.125% Triton-X100 in PBS for 10 min at room temperature.\nWash twice with 0.5 mL PBS.\nBlock with 2% BSA in PBS solution for 30 min.\nIncubate the cells with a FITC-conjugated antibody against the Ad5 hexon protein for 1 h at room temperature.\nDilute the antibody (1:100) in 2% BSA/PBS solution.\nAdd 100 μL diluted antibody/well.\nCarefully remove antibody solution and wash cells once with 0.5 mL PBS.",
    "Visualize and count the stained cells for at least three separate fields per well under fluorescence.\nDetermine the average number of positive cells per well. Multiply by the dilution factor to obtain an approximate value of Infectious units (IU)/mL.\nNote: We recommend the EVOS Cell Imaging System, which has an automated counting mode that is useful for the assessment of viral titer. The Ad5 reference material from ATCC is the ideal standard.\nAlternatives: The QuickTiter Adenovirus Titer Immunoassay Kit can be used for quantification in place of immunofluorescence. Adenovirus titers can be determined with greater precision by the traditional plaque-forming assay (Baer and Kehn-Hall, 2014[href=https://www.wicell.org#bib1]), or by an end-point dilution method combined with quantitative PCR (Lock et al., 2019[href=https://www.wicell.org#bib4])."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biotechnology And Bioengineering",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}