{
  "id": 19565,
  "origin_website": "Jove",
  "title": "Using High Content Imaging to Quantify Target Engagement in Adherent Cells",
  "procedures": [
    "1. Seeding of Cells\nNOTE: For a general overview of the workflow see Figure 1. A detailed list of materials and reagents are available in the Table of Materials.\nPrior to seeding of the cells, drill holes with a standard drill in the frame of black 384-well imaging assay plates to avoid air bubbles being trapped under the plate later during the heating step. To avoid plastic particles entering the wells during this step and to maintain sterile conditions, seal the plates with an adhesive aluminum foil or cover the plate prior to drilling in a tissue culture hood. Typically, 3 holes with a diameter of 3.5 mm on each of side of the plate (short edge) suffice.\nPrepare a laminar flow bench by cleaning with 70% ethanol. Following standard aseptic tissue culture techniques, remove media from cell flask or dish. Wash cells with 5-10 mL of phosphate-buffered saline (PBS) and then add 2 mL trypsin to the flask. Incubate the flask at 37 °C until the A-431 cells detach. Count the cells either using a haemocytometer or cell counter. Prepare a cell suspension of 50,000 cells/mL in culture medium.\nDispense 40 µL of cell suspension (giving a final cell density of 2,000 cells per well) into each well of an assay plate using a bulk reagent dispenser or a multichannel pipet, depending on the scale of the experiment. Briefly move the plate from side-to-side to disperse cells evenly on the bottom of the plate.",
    "To minimize plate-edge effects, allow the cells to settle at the bottom of the assay plate for 20 minutes at room temperature in the back of the laminar flow hood. Then, place the plate in a plastic container with damp paper towels to ensure a humid atmosphere. Prior to use, wipe the plastic container with 70% ethanol.\nIncubate the box with the assay plate for 2-3 days at 37 °C and 5% CO2 in a conventional humidified incubator. Monitor confluency of the cells until 50-75%, as assessed by visual inspection with a light microscope.\n2. Compound Treatment\nOn the day of the experiment, aspirate the medium from each well using a plate washer. Place the plate on the plate washer and select the aspiration program. If a plate washer is not available, then the liquid can be removed by inverting the plate with a rapid hand twist over a waste tray or sink. Complete removal of liquid is essential for good performance. Any excess liquid is then removed by dabbing with paper towels.\nAdd 30 µL of compounds diluted to the appropriated concentration in cell culture medium using automated dispensing or a multichannel pipette depending on the scale of the experiment. Ensure to add a negative (DMSO) and positive (known ligand) control to several wells on each assay plate. Since this is a thermal shift assay, it is necessary that the compound concentration exceeds the dissociation constant to observe protein stabilization. Thus, a rough guideline for compound concentration is 50-100 times the IC50, but more detail descriptions for compound concentrations are found in the Discussion section.\n\tNOTE: DMSO tolerability of the cell lines should be tested prior to the experiment.",
    "Seal the compound-treated assay plate with a breathable plate seal and incubate at 37 °C and 5% CO2 in a humidified incubator for 30 minutes.\n3. Heat Challenge\nFirst, set the water bath to the desired temperature. Note that the final temperature that is reached inside the wells of the assay plate can be different from the final temperature in the water bath. Investigate the offset beforehand with a dummy plate and thermocouple thermometer. It typically takes 30 minutes for the bath to stabilize at the desired temperature.\nTo verify that the desired temperature is reached in the wells of the assay plate during the heating step, prepare an unsealed dummy plate containing the same volume of medium as the assay plate.\nRemove the assay plates from the incubator. Take off the breathable seal and re-seal the assay plate containing the compound-treated cells with a tight adhesive aluminum foil to ensure that no water will leak into the wells during the subsequent heating in the water bath. Ensure that the drilled holes in plate frame are accessible.\nPlace the assay plate and the dummy plate in the water bath with the bottom of the plate angled towards the water surface to force any remaining air out from under the plates.\nMonitor the temperature inside the wells of a new dummy plate using a thermocouple thermometer.\nHeat the assay plate in the water bath for 3 minutes. Immediately transfer the assay and dummy plate to another water bath with room-tempered water to cool down for 5 minutes. The assay plate is now ready for further processing.\n4. Fixation\nDispense 10 µL 16% (w/v) paraformaldehyde (PFA) directly to the assay plate using a bulk reagent dispenser or a multichannel pipet. Incubate at room temperature for 20 minutes.",
    "Note: Some fixatives are classified as carcinogenic and institutional safety regulations should be followed.\nAspirate the PFA solution and wash the cells with 300 µL PBS using a plate washer. Place the plate on the plate washer and select the aspiration program.\n\tNOTE: This procedure has been optimized using an overflow protocol on the plate washer in which liquid is simultaneously dispensed and removed. If a plate washer or similar procedure is not available, the washing step can alternatively be done manually.\nManual washing procedure: Remove the liquid from the wells by inverting the plate with a rapid hand twist over a waste tray or sink. Complete removal of liquid is essential for good performance. Add 80 µL of PBS with a multichannel pipette and invert the plate again as described above, repeat the washing procedure two times. After the last wash, blot the plate against clean paper towels to remove any excess liquid.\n5. Permeabilization\nAdd 20 µL of 0.1% (v/v) NP-40 to the wells with a multichannel pipet and incubate at room temperature for 10 minutes. Wash the cells using the same procedure as described above (step 4.2).\nAlternatively, when appropriate, apply an antigen retrieval protocol, e.g.:\n\t\nAdd 20 µL of 1% SDS to the wells with a multichannel pipet. Incubate at room temperature for 5 minutes and wash according to the same procedure described above (step 4.2).\nAdd 80 μL of 10 mM glycine at pH 7.2 and incubate for 10 minutes at room temperature. Aspirate the glycine solution using a plate washer by placing on the plate washer and selecting the aspiration protocol. See notes in 2.1 and 4.2 if a plate washer is not available.\n6. Blocking",
    "Add 15 µL of 1% (w/v) bovine serum albumin (BSA) in PBS to the wells using a bulk reagent dispenser or a multichannel pipet. Incubate the plate at room temperature for 1 hour or overnight at 4 °C with an aluminum foil plate seal.\n7. Primary Antibody\nAspirate the blocking solution using a plate washer by placing on the plate washer and selecting the aspiration protocol. See notes in 2.1 and 4.2 if a plate washer is not available.\nAdd 10 µL of primary antibody diluted accordingly in 1% (w/v) BSA in PBS to the wells using a multichannel pipet. Incubate the plate at room temperature for 1 hour or overnight at 4 °C with an aluminum foil plate seal.\n8. Secondary Antibody\nAspirate the primary antibody solution and wash the wells according to same procedure as described above (step 4.2).\nAdd 10 µL of Alexa 488 secondary antibody diluted accordingly in 1% (w/v) BSA in PBS. Incubate at room temperature for 1 hour. Seal the plate with an adhesive aluminum foil seal to protect from light.\n\tNOTE: Protect the plate from light during this and subsequent steps.\n9. Nuclear Staining and Cell Mask\nAdd 10 µL of nuclear dye diluted to 0.05 mg/mL in PBS to the wells using a multichannel pipet. Incubate at room temperature for additional 10 minutes.\nAspirate the secondary antibody and Hoechst solution and wash the wells using the same procedure as described above (step 4.2).\nAdd 10 µL of cell mask diluted to 200 ng/mL in PBS to the wells using a multichannel pipet. Incubate at room temperature for 30 minutes.\nAspirate the cell mask solution and wash the wells using the same procedure as described above (step 4.2).",
    "Dispense 60 µL of PBS to all wells using the plate washer, a bulk reagent dispenser, or a multichannel pipet, and seal the plates with an adhesive aluminum foil.\n10. Image Acquisition and Analysis\nCapture images on a high content imager using 3 fluorescent channels: DAPI (387/447), GFP (472/520), and TexasRed (562/624). Acquire 4 images per well using 10X objective. Use automated laser autofocus and apply binning 2 during acquisition. Store images as 16 bit, gray scale tiff files along with metadata.\nAnalyze images using available software. Identify cell boundaries using a Cell Scoring algorithm with DAPI (nucleus) and TexasRed (cytoplasm).\nExtract average intensity for all acquired wavelengths for further data analysis.\nCalculate the Z-factor to ensure the robustness of the assay.\nCalculate % stabilization using the following formula: 100*(1-(well intensity – average well intensity negative control)/(average intensity positive control-average intensity negative control)). Here negative control is DMSO and positive control is the reference substance. Since the maximum stabilization between compounds can vary and in fact be greater than the positive control for ITDRF curves, the maximum and minimum stabilization intensities for each compound are sometimes used in place of the intensity values of the control wells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}