{
  "id": 4170,
  "origin_website": "Cell",
  "title": "In utero intraocular AAV injection for early gene expression in the developing rodent retina",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of mice for surgery\nTiming: [30–40 min]\nPlace a bottle of sterile saline on the bottle warmer and allow the saline to reach 37°C.\nWeigh the mouse and administer analgesic. In Yasuda et al. (2021)[href=https://www.wicell.org#bib6], 5–10 mg/kg of Meloxicam was injected subcutaneously.\nAlternatives: Other analgesics approved by the respective institutional animal care and use committees may be used for this protocol.\nNote: Intraperitoneal injections into pregnant females should be avoided as they may harm the embryos. Additionally, this protocol requires the opening up of the abdominal cavity. This may render the analgesic less effective.\nAnesthetize a pregnant mouse in an induction chamber with 1 l/min flow rate of 3% Isoflurane until the animal is anesthetized completely.\nNote: Check that the mouse is fully anesthetized by monitoring breathing rate and assessing the toe pinch reflex.\nApply eye lubricant to the eyes to prevent dry eyes.\nPlace the mouse on a surgical drape-lined operating stage under a dissection microscope (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/932-Fig2.jpg\nFigure 2. Preparation of pregnant female mouse for surgery and exposure of embryos\n(A) Method of preparing the pregnant female for surgery. Place an anesthetized pregnant female on the operating stage. Shave all fur from the abdomen and sterilize abdomen by scrubbing with alternating Povidone-iodine (Betadine) and 70% ethanol wipes three times. Cover the mouse with sterile surgical drapes. Make a 20–30 mm long incision of the skin followed by the abdominal wall along the midline. Cover the area with sterile gauze.\n(B) Method of exposing embryos. Expose the embryos by gently lifting the abdominal wall with Adson forceps and pulling the uterus out by holding the uterine wall between embryos using ring forceps.",
    "Attach a nose cone (VetEquip) to the mouse’s nose. Adjust the isoflurane settings such that the mouse receives 2–3% isoflurane at a rate of 0.5–1 l/min.\nCritical: Monitor breathing rate (about 50–70 breaths per minute) (Ewald et al., 2011[href=https://www.wicell.org#bib1]) during the entire procedure to avoid isoflurane overdose.\nRemove all fur on the abdomen with a razor (Figure 2[href=https://www.wicell.org#fig2]A).\nScrub the abdominal skin with Povidone-iodine (Betadine) followed by 70% ethanol. Repeat three times.\nCover the mouse with a sterile drape that has a 40 mm × 40 mm opening centered over the abdomen (Figure 2[href=https://www.wicell.org#fig2]A).\nExposure of embryos\nTiming: [5 min]\nCut the skin from anterior to posterior along the midline (20–30 mm), then cut the abdominal wall (muscles and peritoneum; 20–30 mm) with fine scissors (Figure 2[href=https://www.wicell.org#fig2]A).\nCover the abdomen with sterile gauze that has a 40 mm-long cut at the center. Moisten the gauze around the cut site with saline.\nLift the abdominal wall with Adson forceps and gently pull out the embryo-containing uterus, starting with the embryo nearest to the opening. Hold the uterine wall between two embryos with ring forceps and gently pull (Figure 2[href=https://www.wicell.org#fig2]B). When two embryos are pulled out, hold on to the uterine wall between the next two embryos and gently pull another embryo out. Repeat this until all embryos are exposed.\nNote: Keep the uterus wet throughout the procedure by gently pipetting warm sterile saline onto the uterus. Avoid damaging the placenta and blood vessels with forceps.\nIntraocular AAV injection\nTiming: [20–25 min]\nLoad (up to 0.5 μL) virus solution colored with fast green (0.1%) to micropipette.",
    "Note: For high levels of viral transduction, we injected 0.2 μL of a high titer AAV (1×1012 gc/mL). If the viral titer is lower or multiple AAVs need to be injected, a larger volume, up to 0.5 μL of viral solution, may be injected per eye. If the injected volume exceeds 0.5 μL, the viral solution may leak from the injected eye.\nNote: This protocol may be used to inject only one eye or both eyes.\nAdjust the embryo within the uterine wall by gently pushing the back of the embryo until the eye is facing up. Gently stabilize the embryo by holding the uterine wall just under the embryo’s head with ring forceps. Maintain the width between the ring forceps’ tips at about 50–70% the width of the embryo (Figures 3[href=https://www.wicell.org#fig3]A and 3B)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/932-Fig3.jpg\nFigure 3. Identification of the embryonic eye and AAV injection\n(A) Image shows an exposed CD1 embryo positioned for injection. Hold the embryo with ring forceps and gently position the embryo as close to the uterine wall as possible.\n(B) Higher-magnification images of an embryo from the boxed region in (A). The overlaid trace in the right image shows the location of the embryonic eye and lens.\n(C) Method of AAV injection. AAV with 0.1% fast green is injected using a glass micropipette inserted into the eye just outside the lens.\n(D) A successful injection is indicated by the fast green dye staying within and uniformly filling the embryonic eye.\n(E) Image shows an exposed C57BL/6J embryo positioned for injection. The pigmented eye is clearly visible.\n(F) Images show uninjected (left panel) and CTB488 injected (right panel) C57BL/6J embryos viewed under goggles (FHS/EF-2G2; BLS LTD., Hungary). Co-injection of a fluorescent dye can be used to assess the success of viral injections into pigmented eyes.",
    "Gently push the embryo up from under the embryo’s head with the ring forceps (maintaining the width between the tips) to move the embryo as close to the uterine wall as possible (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nCritical: Do not hold or damage the placenta as this would induce a miscarriage.\nLocate an eye under the dissection microscope (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: Ensure aseptic technique. To avoid contaminating the sterile gloves, we use sterilized aluminum foil or sterile drapes to handle any non-sterile surfaces.\nAdjust the angle of the fiber optic light source cables to make the embryo’s eye more visible.\nNote: Usually, light directly onto the side of the embryo’s body gives better visibility of the eye (Figures 3[href=https://www.wicell.org#fig3]A and 3C). The angle of the light source will need to be adjusted for each embryo.\nHolding the glass micropipette with your hand, insert the tip of the micropipette at a ~45° angle from the line of sight into the eye just outside the lens (~0.1 mm away from the lens) (Figure 3[href=https://www.wicell.org#fig3]C).\nInject up to 0.5 μL of viral solution at a rate of 0.05 μL/s into the vitreous using the syringe pump.",
    "Note: In mice with non-pigmented eyes (e.g., CD1), a successful injection is indicated by the fast green dye staying inside the eye (Figures 3[href=https://www.wicell.org#fig3]D and 4[href=https://www.wicell.org#fig4]A). If the injection is unsuccessful, the dye will diffuse outside the eye and not be visible. If this occurs, move on to the next embryo. This pup will need to be later excluded from analysis as it would likely have viral transduction in cells in the brain/outside the retina. As unsuccessfully injected embryos cannot be removed during surgery and will have to be identified after the pups are born, we always co-inject an AAV encoding a fluorescent protein. After birth, goggles (e.g., FHS/EF-2G2; BLS LTD., Hungary) can be used to identify and exclude unsuccessfully injected animals.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/932-Fig4.jpg\nFigure 4. Efficient viral transduction in the early postnatal retina following in utero intraocular viral injections\n(A) Embryo injected with AAV-DJ-CAG-EGFP (with 0.1% fast green dye) at E13.5.\n(B) Expression of EGFP in a P0 pup eye taken with a goggle (FHS/EF-2G2; BLS LTD., Hungary) and Sony Xperia camera.\n(C) Whole mount images of the injected retina. EGFP is highly and uniformly expressed in the retina at P3 and P15.\n(D) Cross section image of the injected retina at P15. In utero intraocular injections of AAV-DJ-CAG-EGFP effectively labels RGCs and displaced amacrine cells in the GCL. Horizontal cells, amacrine cells and bipolar cells in the INL, and photoreceptors in the ONL are also infected. Scale bar, 50 μm.\nImages in Figures 4[href=https://www.wicell.org#fig4]B and 4C are from Yasuda et al., 2021[href=https://www.wicell.org#bib6].\nNote: For mice with pigmented eyes (e.g., C57BL/6), instead of fast green, fluorescent dyes in combination with goggles (e.g., FHS/EF-2G2) can be used to confirm successful injections (Figures 3[href=https://www.wicell.org#fig3]E and 3F).\nRepeat steps 13–19 with the other embryos.",
    "Critical: Longer procedure (>30 minutes from the exposure of embryos) decreases the survival rate. If the procedure time has reached 30 minutes, stop the injections to additional embryos and proceed to step 21.\nSuturing and post-operative care\nReturn the uterus into the abdominal cavity and fill the abdominal cavity with warm saline.\nSuture to close the abdominal wall and then the skin.\nAlternatives: The skin layer may be closed with wound clips.\nPlace the mouse back in its home cage that is on a heating source (37°C, recirculating water heating pad) until the mouse recovers.\nInspect the mouse every day and provide analgesia for three days after surgery. The mouse should be inspected for any abnormalities to the surgical lesion (including wound dehiscence, swelling, discharge, rubbing or scratching of the surgical site) and for animal behavior (including appetite, grooming, and movement).\nNote: In Yasuda et al. (2021)[href=https://www.wicell.org#bib6], 5–10 mg/kg of Meloxicam was administered subcutaneously every 24 hours for three days as an analgesic. Other analgesics may be used, and the required dose should be administered as approved by the respective institutional animal care and use committees.\nIf fluorescent protein-expressing AAV was injected, at postnatal day 0 (P0), successful viral transduction can be determined using goggles (e.g., FHS/EF-2G2) (Figure 4[href=https://www.wicell.org#fig4]B)."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Developmental Biology",
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}