{
  "id": 1736,
  "origin_website": "Cell",
  "title": "Fast-dissociating but highly specific antibodies are novel tools in biology, especially useful for multiplex super-resolution microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1: Subculturing hybridoma clones #1\nTiming: 3 h, see Figure 2[href=https://www.wicell.org#fig2] for details\nThe procedure to subculture hybridoma cells is described in Figure 2[href=https://www.wicell.org#fig2]A. Prepare three non-treated 96-well tissue culture plates for each 96-well plate used to culture hybridoma clones. A total of thirty 96-well plates are necessary if hybridomas are initially seeded on ten 96-well plates.\nNote: In our protocol, hybridomas are cultured in 300 μL of culture medium in each well of a 96-well plate.\nNote: Growth rates of hybridoma cells can vary among clones. In the previous study, we waited until a colony attained a size of 1–2 mm in diameter in one half to two-thirds of the wells with hybridoma cells. Ignore wells without hybridomas or with only fibroblasts. Two or three colonies usually form in each well. Overgrowth damages hybridomas. Start subcultures when the growth medium color is red to orange or when colonies grow in diameter to 1–2 mm. Do not let cells grow until the medium becomes yellow (pH < 7.0), which indicates that the buffering capacity of the medium is exhausted.\nPut 200 μL of fresh culture medium in each well of the new plates (shown in Figure 2[href=https://www.wicell.org#fig2]B, right panel).\nDetach hybridoma clones from the tissue culture plates by suspending culture medium in each well using a multichannel pipette (Figure 2[href=https://www.wicell.org#fig2]B, left panel). The fluid jet from the pipette should be gentle enough to prevent splashing and contaminating the culture medium from one well to another. Hybridomas weakly adhere to the 96-well plate treated for tissue culturing. Cells can be detached by gently flowing the culture medium against the surface of wells. Detachment of cells from the well bottom can be seen with the naked eye.",
    "Critical: Use a new pipette tip for each well. Cross-contamination between hybridoma clones can result in the loss of an antibody-secreting clone, which can be outcompeted in growth by non-antibody secreting cells.\nTo avoid considerable repetitive hand movements, if available, use a multichannel automated pipettor, such as an Eppendorf epMotion96 (Figure 2[href=https://www.wicell.org#fig2]B, center and right panels):\nAttached new 300-μL tips to the automated pipettor.\nSuspended the detached hybridomas by aspirating and dispensing 250 μL of culture medium three times for each well.\nAspirate a total 300 μL of cell suspension from each original well and dispense 100 μl into each of three wells of three 96-well plates.\nCulture the hybridomas at 37°C for 2 days in a 5% CO2 humidified atmosphere.\nDay 2: Crosslinking of protein A/G to 96-well glass-bottom plates\nTiming: 4–6 h, see Figure 1[href=https://www.wicell.org#fig1] for an overview\nPrepare amine-functionalized 96-well glass-bottom plates, which are available from several manufacturers such as Matsunami Glass IND LTD and Corning. From Matsunami, we purchased custom requested 96-well plates with a glass bottom equivalent to a high-precision No. 1.5 coverslip and with a low-bottom plastic frame designed with dimensions so as to avoid interference with the typical wide barrel of a high NA 100× objective (Figure 1[href=https://www.wicell.org#fig1]C).\nCritical: Prepare additional 96-well plates for positive control antibodies and antibody-free culture medium as a negative control. Commercial antibodies can be used as positive controls. If the EGFP-antigen has an epitope tag for purification, such as a FLAG-tag, an antibody recognizing the tag can be a positive control.",
    "For one plate, prepare 10 mL of the 10 mM sulfo-SANPAH solution. Weigh 4.93 mg of sulfo-SANPAH in a 15 mL conical tube. Add 100 μL of DMSO and completely dissolve the sulfo-SANPAH using a vortex mixer for 15–30 s. Then, add 10 mL of PBS, pH 7.0 and vortex the solution once again for 15–30 s.\nCritical: Sulfo-SANPAH is sensitive to moisture. Keep sulfo-SANPAH at −20°C and avoid humid air. Prepare the sulfo-SANPAH solution immediately before use.\nNote: Sulfo-SANPAH is poorly soluble in water. A small amount of sulfo-SANPAH may gradually precipitate after adding PBS at pH 7.0 and sometimes may appear on the glass surface of the 96-well assay plate. It is unnecessary to remove the precipitate since it is completely removed from the glass surface of the 96-well assay plate after the rinsing step below and does not affect the success of the methodology described here.\nNote: The pH of PBS was adjusted to 7.0 which appears to increase the stability of the N-hydroxysuccinimide (NHS) ester group of sulfo-SANPAH (Hermanson, 2013[href=https://www.wicell.org#bib11]).\nApply 100 μL of sulfo-SANPAH solution to each well. Wrap the plates with an aluminum foil to shield from light and incubate the plates at 20°C–25°C for 2 hours (h) gently mixing the solution on a shaker at ∼10 rpm.\nNote: Sulfo-SANPAH is a bifunctional crosslinker. At this step, the NHS ester side of sulfo-SANPAH reacts with the amine groups on the glass surface of glass-bottom plates. Until the Protein A/G crosslinking is completed as described below, shield the sulfo-SANPAH and plate from light to protect the other side of sulfo-SANPAH, which is a photoactivatable nitrophenyl azide.",
    "Remove the sulfo-SANPAH solution from each well with a multichannel aspirator, such as ASPIT-8S (OptoCode), and rinse wells three times with PBS pH 7.0. Incubate for 3 min at 20°C–25°C for each rinse.\nAdd 300 μL of 10 mg/mL Protein A/G stock solution to 10 mL PBS, pH 7.0 to prepare the 0.3 mg/mL solution. Mix by gently inverting the tube. Do not vortex. Apply 100 μL to each well.\nPlace the plates on a UV transilluminator. For MUV21-365 (NIPPON Genetics), select “High” and incubate for 30 min. Do not expose your eyes to the UV light from the transilluminator.\nNote: Optimal strength and duration of UV illumination differ between UV transilluminators. Thermo Fisher Scientific provides a technical tip to determine the UV parameters (https://assets.thermofisher.com/TFS-Assets/LSG/Application-Notes/TR0011-Photoactivate-aryl-azides.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/Application-Notes/TR0011-Photoactivate-aryl-azides.pdf]).\nGently rock the plates on a shaker for 30 min at 20°C–25°C.\nNote: Our transilluminator uses UV lamps that will warm the plates. Therefore, plates are cooled down during this step by incubating at 20°C–25°C while gently rocking. Recent transilluminators with LEDs that produce little heat may not require a cooling step.\nRemove the Protein A/G solution from each well.\nBlock the non-specific protein binding sites in each well by adding 300 μL of 3% BSA dissolved in PBS and incubate the plate for 16–18 h at 4°C with gentle shaking.\nDay 3: Subculture of hybridomas #2 and sampling of culture supernatants\nTiming: 2 h, see Figure 2[href=https://www.wicell.org#fig2] for details",
    "In this step, hybridoma clones cultured in one 96-well plate on day 1 is subcultured in a set of three plates (see Figure 2[href=https://www.wicell.org#fig2]A). Prepare three new 96-well non-treated tissue culture plates for each 96-well plate of hybridomas to be subcultured. Aliquot 200 μL of culture medium to each well. In other words, hybridoma cells initially cultured in one well are now cultured in triplicate using three wells of three separate 96-well plates.\nNote: For example, hybridomas initially cultured in the wells of 10 plates are now cultured using 30 plates (10 sets of 3 plates). At this step, one plate in each set (for a total 10 plates) is subcultured into three fresh plates. The remaining twenty plates are used as a source of hybridoma culture supernatant containing the monoclonal antibodies and are not used to subculture hybridomas.\nUsing a 96-well multichannel pipetting instrument, suspend hybridoma clones in the 96-well plates and dispense 100 μL to each of three 96-well tissue culture plates containing 200 ul of fresh culture medium in each well (Figure 2[href=https://www.wicell.org#fig2]B, center and right panels).\nNote: Hybridomas can be easily suspended by gentle pipetting because the cells are cultured using non-treated tissue culture plates. The procedure to detach cells, such as a fluid jet as described above and in the left panel of Figure 2[href=https://www.wicell.org#fig2]B, is not necessary.\nCulture the hybridomas at 37°C in 5% CO2 while the antibodies are being screened over a period of 4 and 5 days.\nAfter finishing the subculture steps described above, sample culture supernatants by suspending cells in the plates not used for subculture using a 96-well multichannel pipettor. Aspirate cell suspensions and transfer them into 96-1-mL deep-well plates. Centrifuge the plates at ∼180 × g for 2 min to pellet the cells.",
    "Aspirate the culture supernatants and store in new 96-1-mL deep-well plates. To prevent evaporation of supernatants, apply a sealable lid and store the plates at 4°C.\nNote: Add 1/100 volume of 3% sodium azide (NaN3) to each well for long-term storage of culture supernatants. Handle powdered sodium azide carefully. It is odorless and is a potentially deadly chemical. Dispose of sodium azide according to the chemical waste requirements of your institution.\nNote: Cell pellets can be suspended in a cell cryopreservation medium for storage at –80°C. CELLBANKER1 (AMSBIO) worked well. Barcoded cryopreservation tubes (Thermo Fischer Scientific, Cat#3744) are a good way to keep track of your inventory of cells. A barcode reader for these tubes is also available from Thermo Fischer Scientific (Cat#3125).\nRinse each well of the 96-wells glass-bottom plates (prepared on day 2) using PBS. Incubate for 3 min at 20°C–25°C for each rinse.\nApply 300 μL of culture supernatant for each well of the glass-bottom plates and incubate for 16–18 h at 4°C.\nCritical: Prepare positive control wells immobilizing positive control antibodies and negative control wells treated with antibody-free culture medium. These control wells function as standards to evaluate the quality of the assay plates and to identify antibodies showing positive responses to confronted EGFP-antigens.\nDays 4 and 5: Screening monoclonal antibodies and selection of clones\nTiming: 1 h per plate, see Figure 3[href=https://www.wicell.org#fig3] for representative images",
    "Power up the TIRF microscope and adjust the angle of laser light to achieve TIRF illumination. Place a new 96-well glass-bottom plate and add a solution of calibration beads to a few wells. Tilt the laser angle stepwise from the epi-fluorescence position to find the narrow range of angles where the background fluorescence intensity suddenly decreases. Avoid an angle of TIRF illumination that results in interference fringes (Mattheyses et al., 2010[href=https://www.wicell.org#bib24]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1191-Fig3.jpg\nFigure 3. Representative images of screening\nBinding of anti-FLAG tag antibodies with FLAG-EGFP antigens are shown (Miyoshi et al., 2021[href=https://www.wicell.org#bib26])\n(A) Images from the initial screening showing positive responses of three anti-FLAG tag antibodies to FLAG-EGFP. Antibodies were numbered from FLAG-1 to FLAG-3, from high density to a low density of bound FLAG-EGFP molecules. Bound FLAG-EGFP molecules are visualized as fluorescent spots for FLAG-2 and FLAG-3 (magenta circles), while each molecule is hardly distinguishable for FLAG-1 due to the high density of bound FLAG-EGFP molecules. Antibody-free glass surface treated only with fresh culture medium did not show binding of FLAG-EGFP in this image. FLAG-EGFP, 30 nM. Exposure, 50 ms. Bar, 2 μm.\n(B) Time-lapse images acquired during the initial screening indicated fast-dissociation of FLAG-2 and FLAG-3 antibodies. Bound FLAG-EGFP molecules are frequently exchanged. Bound FLAG-EGFP molecules are indicated by circles: red (new binding), blue (disappears in the next frame) and orange (remains bound). Molecules that remain bound for only one frame are indicated by circles composed of red and blue arcs. FLAG-EGFP, 30 nM. Time-lapse, every 50 ms. Bar, 2 μm.\n(C) Time-lapse images used to determine the dissociation rates (koff). Acquisition intervals are adjusted to visualize a 30%–50% exchange of bound FLAG-EGFP molecules in each time-lapse image. FLAG-EGFP, 0.1 nM for FLAG-1, 0.3 nM for FLAG-2 and 30 nM for FLAG-3. Bar, 2 μm.",
    "(D) Fitting a one-phase decay model to the regression of bound FLAG-EGFP. The FLAG-2 and FLAG-3 antibodies show faster dissociations from epitopes than the FLAG-1 antibody consistent with data from the initial screening. Images and graphs are reproduced from our previous study with permission from Elsevier (Miyoshi et al., 2021[href=https://www.wicell.org#bib26]). See Methods video S1[href=https://www.wicell.org#mmc1], S2[href=https://www.wicell.org#mmc2], S3[href=https://www.wicell.org#mmc3] and S4[href=https://www.wicell.org#mmc4].\nRemove the unbound components of culture supernatants by rinsing the wells of the 96-well glass-bottom three times for 3 min using 300 μL of HEPES-KCl-Tx buffer.\nPrepare EGFP-antigen solutions as described in the materials and equipment section.\nCritical: The concentration of EGFP-antigen directly affects the sensitivity of the screening assay. We used 20–30 nM of EGFP-antigen solution. However, some EGFP-antigens cannot be used at this concentration due to aggregation of the protein and/or to non-specific binding to the glass surface. Before developing hybridoma clones, we recommend testing (1) the EGFP-antigen using an antibody-free glass surface, specifically wells treated with culture medium, and (2) the glass-surface with an immobilized positive control antibody, for example, against the antigen of interest. If the EGFP-antigen has an epitope tag for purification, such as a FLAG-tag, antibodies against the tag, such as an anti-FLAG tag antibody, can be the positive control. Apply EGFP-antigen at various concentrations and determine the maximum concentration at which the EGFP-antigen does not show non-specific binding. Set up the imaging condition, such as laser power and exposure time, to detect bound single EGFP-antigens molecules using the positive control antibody.\nBefore applying EGFP-antigen solution, place the glass-bottom plate upside-down on a paper towel and thinly spread the immersion oil on the lens-side of the entire glass-bottom.\nWithout disturbing or accidentally blotting the immersion oil, place the glass-bottom plate in an upright position and add 100 μL of EGFP-antigen solution to each well.",
    "Acquire short time-lapse movies sequentially for each well, for example, for 50 frames. We set the exposure time to 50 ms and the laser power (473 nm) to 4–6 mW, both of which are minimized to reduce photobleaching. The Evolve 512 EMCCD camera was used with EM Gain (EM = 300, Gain State 3, 10 MHz). We used a MetaMorph macroinstruction to control the automated stage and the autofocusing device.\nCritical: Scan a plate treated with positive and negative controls before scanning antibodies of interest to exclude the possibility of troubles with the TIRF microscope, assay plates or EGFP-antigen.\nNote: The concentration of EGFP-antigen may gradually decrease by being adsorbed to the glass surface and walls of wells. We started scanning within 5 min after adding EGFP-antigen solution to each well and finished the screening within 1 hour. You can scan the 96 wells group-by-group, for example, with every 24 wells consisting of three columns and eight rows and apply EGFP-antigen solution before scanning each group of wells.\nCompare the density of bound EGFP-antigen in each well with a negative control well that was treated with antibody-free culture medium. If the density of bound EGFP-antigen is larger than that in a negative control well, antibodies immobilized in the well can be identified as “showing a positive response” to the EGFP-antigen. See Figures 3[href=https://www.wicell.org#fig3]A and 3B) and Methods video S1[href=https://www.wicell.org#mmc1] for representative images.\nNote: Fast-dissociating antibodies usually show frequent exchange of bound EGFP-antigen molecules during the screening. Further evaluation using diluted EGFP-antigen is necessary if the density of bound EGFP-antigen is too high to observe the exchange of EGFP-antigen.",
    "Identify and subculture “positive” clones (see the third and fourth panels in Figure 2[href=https://www.wicell.org#fig2]A). For each clone, suspend cells in three wells in all of the three tissue culture plates (total ∼900 μL) and put them in a well of a non-treated, 24-well plate. Add 2 mL of fresh culture medium to the well and subculture the hybridomas by dispensing 1 mL of the total ∼3 mL into two unused wells.\nNote: In our protocol, hybridomas identified by the screening are cultured in ∼1 mL of culture medium using non-treated, 24-well tissue culture plates.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Fast-dissociating anti-FLAG tag antibodies identified in initial screen, related to step 28\nTime-lapse movie corresponding to data in Figure 3[href=https://www.wicell.org#fig3]B. FLAG-EGFP molecules show frequent binding and dissociation from immobilized FLAG-2 and FLAG-3 antibodies. Bound FLAG-EGFP molecules are indicated by the circles: red (new binding), blue (disappear in the next frame) and orange (remain bound). Molecules that remain bound for only one frame are indicated by circles composed of red and blue arcs. Time-lapse, every 50 ms. FLAG-EGFP, 30 nM. Bar, 2 μm. The movies, S1 and S3–S5, are reproduced from our previous study with permission from Elsevier (Miyoshi et al., 2021)\nDay 7 and thereafter: Cryopreservation and isolation of monoclonal populations\nTiming: 2 h\nEach identified hybridoma clone is cultured using two or three wells of a 24-well tissue culture plate. Use cells in one well for subculture and cells in the remaining one or two wells for cryopreservation. Add 2 mL of culture medium to one well, suspend gently and subculture them in three wells.\nCryopreserve cells that were not used for subculture in the previous step. CELLBANKER1 (AMSBIO) worked effectively for us to preserve hybridomas by performing the following steps:",
    "Centrifuge the cell suspension at ∼180 × g for 2 min.\nRemove the culture medium supernatant.\nAdd 1 mL of CELLBANKER1 to the cells from one well and gently suspend (i.e., use 2 mL of CELLBANKER1 for cells collected from two wells).\nTransfer the cell suspension to cryotubes and freeze at −80°C in a microtube storage box.\nNote: CELLBANKER1 does not require step-down freezing reducing the time to handle a large number of clones and eliminating the purchase of a device for stepping down the temperature at one degree per minute.\nNote: We usually collect culture supernatants after cells are centrifuged for cryopreservation and use them to evaluate the antibody secretion of cryopreserved clones and to synthesize Fab probes. Culture supernatants can be stored up to ∼1 month at 4°C after adding 1/100 volume of 3% sodium azide (NaN3). Aliquot and freeze hybridoma supernatants at −20°C or preferably at −80°C for longer-term storage. Some antibodies are sensitive to freeze-thaw cycles. Be sure to check a small quantity of each of your monoclonals for retention of function following a freeze thaw.\nRepeat the previous step for subculture and additional cryopreservation of hybridoma clones. We usually prepare 4–6 tubes of cryopreserved cells for each hybridoma clone. Subsequently, to obtain monoclonal antibodies, hybridoma clones were subcultured until we obtained ∼12 mL of culture supernatant.\nCritical: Hybridoma clones sometimes lose their antibody secretion abilities. Therefore, cryopreserve hybridoma clones as early as possible in their passage number and definitely avoid repeated passaging of hybridomas. It is safer to perform limiting dilution (described below) to isolate monoclonal populations while cells are being cryopreserved.\nIsolate monoclonal populations using a limiting dilution technique. Both cells currently cultured and cells recovered from cryopreservation are available for isolating cells to grow into monoclonal populations.",
    "Suspend cells gently using a pipette and determine the density of cells. We used an EVE automatic cell counter (EVE-MC, NanoEnTek) after trypan blue staining. An inexpensive hemocytometer can also be used to count cells.\nDilute a cell suspension to achieve ∼1 cell per 100 μL of culture medium. For example, a cell suspension containing 1 × 104 cells/mL should be diluted by one to a hundred (i.e., add 10 μL of cell suspension to 1 mL of culture medium) to achieve 100 cells/mL.\nAdd 10 μL of diluted cell suspension to 10 mL of culture medium to achieve one cell per 100 μL (0.1 cell/mL).\nAliquot 100 μL of this suspension to each well of a 96-well tissue culture plate to start culturing from single cells. To increase the probability of having only one cell per well, adjust the dilution of cells for a target of ∼0.5 cells per well since the number of cells in a well follows a Poisson distribution.\nAdd 100 μL of fresh culture medium two days later and then again at four days after starting the limiting dilution. Incubate the plate until cells proliferate. Medium exchange is not necessary.\nIdentify wells in which cells proliferate and subculture the monoclonal populations. Cryopreserve the cells and obtain hybridoma culture supernatants for evaluation.\nOption #1: Determination of koff between antibodies and epitopes\nTiming: 2–3 h (except for the preparation of Protein A/G-coated glass-bottom plates), see Figure 3[href=https://www.wicell.org#fig3] for representative images\nPrepare a new Protein A/G-coated glass-bottom plate. Apply hybridoma culture supernatants containing antibodies and incubate for 16–18 h at 4°C to immobilize the antibodies.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1191-Fig4.jpg\nFigure 4. Synthesis of fluorescently-labeled Fab fragments (Fab probes)",
    "(A) Diagram illustrating the protocol to synthesize Fab probes. Antibodies in culture supernatants are captured on Protein-A beads and labeled via free cysteine residues using fluorescent dyes coupled with maleimide, such as DyLight488-maleimide and DyLight550-maleimide. Fab probes are obtained from antibodies by proteolytic cleavage with Papain. Specificity of Fab probes can be tested, for example, by preparing cultured cells ectopically expressing target antigens or epitopes. We used Xenopus XTC cells, which were fixed and permeabilized with 3.7% paraformaldehyde supplemented with 0.5% Triton X-100 for 20 min at 20°C–25°C, and then blocked with 3% BSA in PBS for 30 min at 20°C–25°C. Recognition of epitope tagged actin filaments are shown.\n(B) Fast-dissociating anti-epitope tag Fab probes showing frequent binding and dissociation against epitope-tagged actin expressed in Xenopus XTC cells. Three Fab probes, named as FLAG-2, S-1 and V5-3 in our previous study, recognize FLAG-actin, S-actin and V5-actin, respectively. Time-lapse images, every 200 ms. Fab probes, 1 nM. Bars, 5 μm and 2 μm.\n(C) Super-resolution images of XTC cells expressing epitope-tagged actin acquired using these Fab probes. Thin actin fibers are visualized at high-density labeling (between arrowheads) reflecting the frequent binding and dissociation of these Fab probes. Images are reconstructed from 160,000 frames acquired every 50 ms. Fab probes, 1 nM. Bars, 5 μm and 1 μm. Diagrams and images are reproduced from our previous study with permission from Elsevier (Miyoshi et al., 2021[href=https://www.wicell.org#bib26]). See also Methods video S5[href=https://www.wicell.org#mmc5].\nRemove the unbound components of culture supernatants by rinsing the wells using 300 μL of HEPES-KCl-Tx buffer. Incubate for 3 min at 20°C–25°C for each rinse.",
    "Place the 96-well glass-bottom plate on the stage of the TIRF microscope. Just prior to starting acquisition of time-lapse images, remove the HEPES-KCl-Tx buffer and apply diluted EGFP-antigen. We usually dilute the EGFP-antigen to 0.1 nM–1 nM to decrease the density of bound EGFP-antigen molecules.\nAcquire time-lapse images at appropriate intervals. Try several time-intervals, typically in the range of 50 ms to 10 s, and find an interval to achieve a 30%–50% exchange of bound EGFP-antigen molecules per frame. For fast-dissociating antibodies, we acquired images using the stream acquisition mode of MetaMorph at 50–300 ms intervals. For slow-dissociating antibodies, we acquired images every 500 ms to 10 s with a 50-ms exposure time using a time-lapse acquisition mode of MetaMorph. We set the laser power (473 nm) to 4–6 mW, which was adjusted depending on the exposure time. The Evolve 512 EMCCD camera was used with EM Gain (EM = 300, Gain State 3, 10 MHz). The appropriate interval of acquisition was determined by tracking the regression of bound EGFP-antigen molecules and fitting a one-phase decay model as described below. See Figure 3[href=https://www.wicell.org#fig3]C and Methods video S2[href=https://www.wicell.org#mmc2], S3[href=https://www.wicell.org#mmc3] and S4[href=https://www.wicell.org#mmc4] for representative images.\nTrack the regression of bound EGFP-antigen molecules. Our custom-made Python scripts (https://github.com/takushim/tanitracer[href=https://github.com/takushim/tanitracer]) are available to automatically track the spots of single molecules.\nFit a one-phase decay model to the regression curve of bound EGFP-antigen molecules to determine the koff between antibodies and epitopes. We used GraphPad Prism software for kinetic analyses. Multi-phase decay model may better fit the data for some antibodies although the physiological meaning of a more complex model would need to be considered. See Figure 3[href=https://www.wicell.org#fig3]D for representative graphs.",
    "Note: Determine the photobleaching rate with the same illumination condition and minimize it by reducing the laser power and exposure time. We prepared weakly-fixed Xenopus XTC cells expressing EGFP-actin and immersed the cells in HEPES-KCl-Tx buffer supplemented with glucose, glucose oxidase and catalase as described in the preparation of EGFP-antigen solution (Miyoshi et al., 2021[href=https://www.wicell.org#bib26]). We set the laser power and the exposure time to cause photobleaching at a rate approximately 10-fold slower than the koff.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Slow dissociation between FLAG-1 antibody and FLAG-EGFP, related to step 37\nTime-lapse movie corresponding to data in Figure 3[href=https://www.wicell.org#fig3]C. FLAG-EGFP is applied to FLAG-1 antibody immobilized from hybridoma culture supernatant. Images were acquired every 5 s using 0.1 nM of FLAG-EGFP. Exposure, 100 ms. Color key for circles is the same as in Methods video S1[href=https://www.wicell.org#mmc1]. Bar, 2 μm\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Fast dissociation between FLAG-2 antibody and FLAG-EGFP, related to step 37\nTime-lapse movie corresponding to data in Figure 3[href=https://www.wicell.org#fig3]C. FLAG-EGFP is applied to FLAG-2 antibody immobilized from hybridoma culture supernatant. Images were acquired every 300 ms using 0.3 nM of FLAG-EGFP. Color key for circles is the same as in Methods video S1[href=https://www.wicell.org#mmc1]. Bar, 2 μm\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Extremely fast dissociation of FLAG-3 antibody and FLAG-EGFP, related to step 37\nTime-lapse movie corresponding to data in Figure 3[href=https://www.wicell.org#fig3]C. FLAG-EGFP is applied to FLAG-3 antibody immobilized from a hybridoma culture supernatant. Images were acquired every 50 ms using 30 nM of FLAG-EGFP. Color key for circles is the same as in Methods video S1[href=https://www.wicell.org#mmc1]. Bar, 2 μm\nOption #2: Synthesis of Fab probes labeled at free cysteine residues",
    "Timing: 3 h (except for antibody collection using Protein A beads), see Figure 4[href=https://www.wicell.org#fig4] for the overview and representative images\nFor 2 mL of hybridoma culture supernatant, add 20 μL of Protein A beads (Cytiva) suspended in PBS (40 μL of the beads in PBS for a 50% slurry) and incubate for 16–18 h at 4°C with gentle rotation at 10–15 rpm.\nNote: This step assumes that 5–10 μg of antibody is contained in 1 mL of hybridoma culture supernatant. Increase the volume of culture supernatant if the antibody concentration is less than 5–10 μg/mL.\nMove the beads to 500 μL microtubes and wash three times in 500 μL of PBS-EDTA pH 7.0. Centrifuge at 500 × g for 1 min. Save the pellet and resuspend in 70–80 μL of PBS-EDTA pH 7.0. The total volume will be ∼100 μL.\nNote: Maleimide-conjugated dyes, such as DyLight488-maleimide and DyLight550-maleimide, selectively react with cysteine residues at pH 7.0 (Hermanson, 2013[href=https://www.wicell.org#bib11]). EDTA is supplemented to prevent metal-catalyzed oxidation of the sulfhydryl group of cysteine residues (Wallace, 2002[href=https://www.wicell.org#bib42]). Under these conditions, the dyes are selectively conjugated to free cysteine residues in mouse IgG (Huh et al., 2013[href=https://www.wicell.org#bib14]) although labeling of some amine groups may occur.\nDissolve 50 μg of DyLight488-maleimide or DyLight550-maleimide (Thermo Fischer Scientific) in 5 μL of DMSO to obtain 10 μg/μL dye solution. Mix well using a vortex machine for 30–60 s.\nNote: DyLight488-maleimide or DyLight550-maleimide (Thermo Fischer Scientific) are currently supplied as 1 mg dry powder. To prepare aliquots, dissolve the dyes in 300 μL methanol, dispense the solution by 15 μL in Eppendorf tubes and evaporate the methanol under reduced pressure. Close the cap tightly and store in the dark at −20°C with desiccant.",
    "Add 5 μL of dye in DMSO to the bead suspension. Shield from light and incubate the beads for 2 h at 20°C–25°C gently mixing using a rotator at 10–15 rpm.\nNote: Maleimide dye reacts with Protein A and antibodies on beads. The amount of Protein A is ∼60 μg for each 20 μL of beads as indicated on the product sheet from Cytiva, which is 1.42 nmol using a molecular weight of 42 kDa for Protein A (Bjork et al., 1972[href=https://www.wicell.org#bib1]). Antibodies should weigh 10–20 μg, which is 0.066–0.13 nmol using an IgG molecular weight of 150 kDa (Janeway et al., 2001[href=https://www.wicell.org#bib15]). The molar quantities of dyes are 56 and 50 nmol for DyLight488-maleimide (888 Da) and DyLight550-maleimide (1,000 Da), respectively (product sheet, Thermo Fischer Scientific). The molar ratio between protein and dye is adjusted to be ∼1:30 although the exact ratio is hard to estimate due to the small amount of antibody compared with that of Protein A on the beads. Most antibodies are successfully labeled at a lower molar ratio of protein to dye, for example, at 1:10–1:15 in order to conserve expensive dyes.\nNote: NHS-ester dyes, such as DyLight488-NHS-ester or DyLight550-NHS-ester (Thermo Fischer Scientific), are available to label antibodies via lysine residues. Labeling with these dyes requires careful optimization of the amount of dye. An excess amount of dye increases the labeling ratio of a Fab probe and may decrease their specificity of interaction with the epitope.\nRemove the unreacted dye with five washes of the beads in 500 μL of PBS.\nRemove the supernatant. Add 20 μL of 0.01 mg/mL of Papain solution and incubate at 37°C in a water bath for 1 h. Shield from light and tap the tubes every 15 min to suspend the beads.",
    "Centrifuge the beads to recover supernatant containing Fab probes. Add 2 μL of 0.1 mg/mL Leupeptin dissolved in PBS, which will inhibit the proteolytic activity of papain. Aliquot the Fab probe solution and store at −80°C. See Figure 4[href=https://www.wicell.org#fig4] and Methods video S5[href=https://www.wicell.org#mmc5] for fast exchange of Fab probes on epitopes and super-resolution images acquired using the Fab probes.\nNote: In our super-resolution microscopy, we used Fab probes diluted at 1:200 to 1:2000. Although the amount of Papain in the working solution is low (5–50 ng/mL), Leupeptin is a competitive inhibitor of serine proteinases including Papain and not an irreversible inhibitor of Papain. Thus, we supplemented an additional 1 μg/mL of Leupeptin to the working solutions of Fab probes, for example, when we perform multiplex super-resolution microscopy (Miyoshi et al., 2021[href=https://www.wicell.org#bib26]).\n    Your browser does not support HTML5 video.\n  \nMethods video S5. Fast exchange of fast-dissociating Fab probes, related to step 46\nTime-lapse movie corresponding to data in Figure 4[href=https://www.wicell.org#fig4]B. FLAG-2, S-1 and V5-3 Fab probes were applied to fixed XTC cells expressing FLAG-actin, S-actin and V5-actin, respectively. Images were acquired every 200 ms using 1 nM of Fab probes. Color key for circles is the same as in Methods video S1[href=https://www.wicell.org#mmc1]. Bar, 2 μm"
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Antibody",
    "Single-Molecule Assays",
    "Microscopy",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}