{
  "id": 18870,
  "origin_website": "Jove",
  "title": "Detecting Abnormalities in Choroidal Vasculature in a Mouse Model of Age-related Macular Degeneration by Time-course Indocyanine Green Angiography",
  "procedures": [
    "1. Preparation of Instruments\nThe procedure is performed in a procedure room in an animal facility.\nWear facemasks, hair bonnets, surgical gowns, sterile foot-covers, and gloves before beginning the experiment.\nHeat water in a beaker to ~40 °C on a hotplate.\nPlace a sterile blue pad on top of a heating pad that will be used later to maintain the mouse's body temperature during imaging. Turn on the heating pad.\nPrepare the Imaging System:\n\t\nRemove the dust cover and turn on the laser.\nTake out the 55° lens and mount it onto the machine.\nOpen the imaging software from the computer and input the information of the mouse for imaging under a new patient's sheet (e.g. genotype, age, etc.). Under \"device type\", choose Infrared (IR) mode.\nNote: It has been reported that the use of an external double aspheric lens can improve the image quality17-20 although we have no problem in obtaining high quality images by IV-ICGA without using external lenses (see representative results, Figures 1-4).\n2. Tail Vein Injection of ICGA\nDilate mouse eyes with 1% Tropicamide ophthalmic solution and wait 5 min.\nWeigh the mouse to determine the amount of anesthesia (Ketamine/Xylazine/Acepromazine 65-100/10-20/1-3 mg/kg) needed.\nRetrieve a sterile 1-ml syringe along with a 32 G needle. Inject the mouse intraperitoneally with the anesthetics (13 mg/ml Ketamine, 2.6 mg/ml Xylazine, 0.3 mg/ml Acepromazine in sterile PBS). Wait until the mouse is fully anesthetized (~5 min).\nPlace the mouse tail into 40 °C warm water to cause vasodilatation of the vein.",
    "Retrieve a 1 ml syringe with a 32 G needle. Withdraw the desired amount of ICG, typically 50 μl of 1 mg/ml ICG, which is sterile filtered with a 0.2 µM syringe filter into a sterile tube, for a 25 g mouse (2 mg/kg). Be careful not to introduce any air into the syringe.\nWipe the tail with an alcohol swab to sterilize the area to be injected.\nHold the tail with one hand so that the lateral tail vein is upward. With the bevel of the needle facing upward, inject the needle ~2 mm into the vein at a minimal angle. Be careful not to perforate the vein. Draw back on the syringe slightly and look for traces of blood flow into the needle hub, which indicates that the needle was successfully inserted into the vein.\nSlowly inject ICG into the vein. There should be minimal resistance when injecting. Remove the needle and apply an alcohol swab directly to the injection site for ~5-10 sec to stop any bleeding. The mouse is then ready for imaging. In order to catch the early phase (0-4 min after injection), it is essential to image the mouse quickly.\nNote: Mouse eyes can easily get dry and can develop cataract under anesthesia. It is important to keep the eye moist by applying sterile PBS during the procedure. Wipe off excess PBS with a sterile cotton swab before ICGA recording. Other labs have used a contact lens to avoid dehydration of the cornea17-20.\n3. ICG Angiography",
    "Start to take images 30-40 sec after ICG injection, which permits the capture of the early phase of choroidal filling until retinal and choroidal circulations are at maximum brightness (0-4 min). The retinal vasculature is best visualized at focus ~35-45 diopters and choroidal vasculature is visualized at 10-15 diopters.\nNote: During the first examination of an animal model, it is recommended to capture images from all angles (nasal, temporal, dorsal and ventral) to identify all possible abnormalities in the vasculature. During the early phase, both medium and large choroidal arteries and veins are well visualized. In the animal model used in this protocol, choroidal lesions (e.g. polypoidal dilations) may start to appear 1 min into the early phase.\nSet the image focus on the vasculature. Control for brightness and focus using the control module and focus knob, respectively. These values are adjustable digitally and are easily kept constant. Keep the distance from the mouse eye to the camera lens constant to ensure image quality is reproducible using the technique that follows.",
    "Note: Since the device can only image a portion of the posterior eye, we try to keep the focus, brightness, and the distance between the camera lens and the mouse eye constant as we image the entire posterior eye from different angles. The key to this is to align the circle-shaped luminescence emitted by the ICG through the eye with the field of view of the camera. This is accomplished by making left-to-right, up-and-down, and in-and-out adjustments of the camera position until the entire image has no dark areas. When the luminescence and the field of view of the camera are lined up, the distance from the eye to the lens will be reproducible for the next set of images as well as at an optimal distance for quality imaging.\nOnce the vasculature is in focus, capture the image frames by pressing the round black button on the acquisition module. The round black button can also be used to reduce or enhance the signal of ICG for best image quality.\nDetermine the optimal view angle and focusing depth to image choroidal lesions. It is important to keep the position of the eye, the focusing depth, and other device settings fixed for the entire time-course ICGA. The images are saved by pressing acquire button on the touch screen panel of the acquisition module.\nAcquire images in the middle phase at 6-15 min after injection.\nNote: Both the choroidal and retinal vessels become less distinct. Choroidal vasculature appears as diffuse fluorescence. Choroidal lesions exhibiting hyperfluorescence emerge in contrast to the fading surrounding normal background fluorescence.\nAcquire images in the late phase at 17-25 min after injection.",
    "Note: Hyperfluorescence fades. Both choroidal and retinal vessels are no longer visible. The optic nerve head becomes black. Hyperfluorescent choroidal lesions have maximal contrast with the fading background.\nAfter finishing the acquisition of images, apply a clear lubricant eye gel to mouse eyes and leave the mouse on a heating pad for recovery.\nReturn mice to their cages and holding area. Export images as Tiff or JPEG files for further analysis.\nNote: The timing of each phase is not absolute. We found that the timing of each phase might change depending on the amount of ICG injected. More ICG tends to prolong each phase. The best way to define a phase is according to the key features of each phase listed above.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}