{
  "id": 14776,
  "origin_website": "Jove",
  "title": "RBDT: A Computerized Task System based in Transposition for the Continuous Analysis of Relational Behavior Dynamics in Humans",
  "procedures": [
    "Both protocols follow university guidelines to conduct behavioral research with human participants. RBDT software and the user's manual can be downloaded from https://osf.io/7xscj/\n1. Experiment 1: Relational behavior under different relational criteria without restriction of active patterns of behavior\nNOTE: Five elementary school children, between 10 to 11 years-old, volunteered to participate in this study, with the informed consent of their parents and teachers.\nApparatus and experimental situation\n\t\nUse five Pentium laptop computers, each one with a 14\" monitor, keyboard, and optic mouse as response device.\nProgram the experimental task in Java as it automatically records responses and presents a graphical representation of data. The program to conduct the experimental task will be available for download.\nPerform experimental sessions daily between 9 and 11 am, in individual stations of the Sidney W. Bijou mobile laboratory at University of Veracruz.\nUse stations equipped with one-way mirrors, air conditioning, desks, and chairs, and the before mentioned computers.\nExperimental design and task\n\t\nIn the experimental task, present 15 stimulus objects (SOs) consisting of different shapes. Five of these SOs were relevant to the completion of the task and 10 were irrelevant, as shown in the left part of Figure 1.\n\t\t\nUse five different shapes as relevant stimulus objects: pentagon, rectangle, horizontal rhomboid, parallelogram, and figure in V.\nUse ten different shapes were used as irrelevant stimulus objects: hexagon, triangle, circle, trapezoid, oval, rhombus, square, vertical rhomboid, trapeze, and irregular figure in L.\nVary the SOs in color saturation or size. In this experiment, we employed SOs with four different degrees of saturation: black (#000000), dark gray (#474747), gray (#A7A7A7) and light gray (#E7E7E7). The size remained constant.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62285/62285fig01.jpg",
    "Figure 1. Example of relevant and irrelevant figures used as stimulus objects (SOs) in each experiment. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62285/62285fig01large.jpg]\nPresent the SOs in a computer screen, divided in three zones, as shown in the left part of Figure 2.\n\t\nIn the upper left part of the screen, present the zone of Sample Relational Compounds 1 and 2 (SRC 1, 2). Show two different pairs of figures that set a relationship criterion. Each pair exemplified two degrees of saturation relationship \"darker or lighter than\" with the same shape.\nIn the lower left part of the screen, present the zone of Comparison Relational Compounds 1 and 2 (CRC 1, 2). Show two pairs of empty spaces in this zone. The participant had to form two new pairs of figures that fulfilled the exemplified criteria by choosing figures from the Bank.\nOn the right side of the screen, present the Bank zone. In each trial, the bank contained 18 different figures that acquired different relational properties, depending on the criteria exemplified by the SCR 1, 2.\n\t\t\nNOTE: Six figures met the criteria set by the SRC (permutable figures), six figures were eligible to be used correctly but under another criteria (non-permutable figures), and six figures did not meet the criteria set by the SRC (irrelevant figures).\nTo place the figures in the CRC zone, have the participant select the figure with the mouse pointer and drag it to the blank spaces in the CRC zone. Placements of figures could be in different sequences and they could be changed.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62285/62285fig02.jpg",
    "Figure 2. Screens showing a comparison trial in Experiment 1 and 2. In the upper left zone are located the sample relational compounds (SRC), in the bottom zone the boxes to complete de comparison relational compounds (CRC), and in the right section the bank of stimuli. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62285/62285fig02large.jpg]\nUse a single-subject AB design with two replications and three phases (Table 1). Each phase consisted of three training sessions: S1 to S3 (phase 1), S4 to S6 (phase 2), and S7 to S9 (phase 3), consisting of 36 trials (18 \"darker than\" and 18 \"lighter than\", randomized) per session (a total of 108 training trials per phase), and one test session consisting of 36 trials (18 \"darker than\" and 18 \"lighter than\", randomized).\n\tNOTE: Each phase involved a different relationship criterion in terms of the SOs being used. Examples of the screens of each relationship criteria are shown in Figure 3.\nDuring training, give the participant feedback after completing the CRC 1, and 2. After each trial, present the word \"correct\" or \"incorrect\" depending on if the CRC conformed fulfilled the criteria exemplified by the SRC 1, 2.\n\t\nUse a corrective procedure when the CRC was incorrect. Display the same trial up to two more times (these trials were called corrective trials). If the answer was wrong again, display a new trial. If the answer was correct, display a new trial immediately.\nPresent test trials without feedback and show only once.\nEach phase involved a different relationship criterion in terms of the SOs being used.\nBefore the first experimental phase, conduct one session of an \"ordering task\" to verify that participants could place each type of stimulus component along a saturation continuum.\ntable:\n﻿0,1,2,3,4,5\nPhase 1,Phase 1,Phase 2,Phase 2,Phase 3,Phase 3",
    "S1 to S3,Test 1,S4 to S6,Test 2,S7 to S9,Test 3\nSimilar stimulus objects,Similar stimulus objects,Different stimulus objects,Different stimulus objects,Different stimulus objects in each CRC,Different stimulus objects in each CRC\nTable 1. Design of Experiment 1\nimgsrc://cloudfront.jove.com/files/ftp_upload/62285/62285fig03.jpg\nFigure 3. Examples of screen of each relationship in the three phases of the Experiment 1. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62285/62285fig03large.jpg]\nProcedure\n\t\nOrdering task\n\t\t\nPresent the ordering task on a screen with two zones, as shown in the left part of Figure 4. The upper zone of the screen showed a row of four empty boxes.\nIn the lower zone, show four figures with each varying on a saturation continuum.\nHave participants order, from \"darker to lighter\" (or vice versa), the four figures in each one of the upper empty boxes, using the mouse pointer.\nWhen stimuli were correctly placed, present a new trial. If stimuli were incorrectly ordered, withdraw the stimuli and have a text indicating \"incorrect\" in the right upper side of the screen. Then repeat the trial two more times.\nAfter this, present a new trial.\nPresent two blocks of 6 different trials, one for the \"darker to lighter\" sequence and one for the \"lighter to darker\" sequence.\nAt the beginning of the task, present participants with the following instructions on the screen: \"In the upper section of the screen four empty spaces are presented, you must fill them by placing in order the figures located in the lower section.\" When the ordering criterion changed, present a text informing that figures should be place in the opposite order.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62285/62285fig04.jpg",
    "Figure 4. Examples of screen in ordering task in Experiment 1 and 2. In the upper zone are the empty spaces to order the figures shown in the lower zone. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62285/62285fig04large.jpg]\nComparison task\n\t\nHave participants form two relational compounds (CRC) involving two stimuli, each one according to the exemplified relation shown by a pair of sample relational compounds (SRC).\nForm comparison compounds by placing stimulus objects taken from the bank zone.\nArrange stimuli according to the features above described in terms of modality, absolute value, and relational value relative to a relationship criterion, in this case, saturation.\nForm each comparison compound (CRC) with the same stimulus object (shape) but with two different values in saturation, according to a \"darker than\" or \"lighter than\" relationship criteria shown by SRC.\nIn each experimental phase, a different relationship criterion applied regarding the stimulus objects being compared (Table 1).\n\t\t\nIn the first phase, have each trial include a similar stimulus object in terms of its shape in the four compounds (left screen in Figure 3).\nIn the second phase, use a different stimulus object (shape) for the sample and comparison compounds (middle screen in Figure 3).\nIn the third phase, have both sample and comparison compounds include different stimulus objects in each of the two relational pairs (right screen in Figure 3).\nVary stimulus shapes in every trial from a set of five relevant shapes.\nPlace stimuli in each box of the comparison compound by using the mouse pointer.\nThere was no restriction regarding the order of placements in CRC. The set of placements to complete each trial was called a placement sequence.\nHave participants make as many placements and stimulus changes as they wanted before placing the fourth stimulus and completing both CRC.",
    "The minimum number of placements to complete a trial was four, one placement for each empty box in the CRC zone. Changes of placed figures were called excessive placements.\nAt the beginning of the first training session, present participants with the following instructions on the screen: \"There are two spaces in the upper left part of the screen, each with a pair of figures that exemplify how the figures have to be set. In the lower left part of the screen there are two spaces, each with two empty boxes, you must fill these boxes with two figures that go together, as the ones in the upper left, you do this by selecting the figures from those presented in the right side of the screen. To select the figures, place the cursor on the figure you want to use, click on the figure with the left mouse button and drag it to the space where you want to place it. Release the left mouse button, the figure will be placed in the space you choose. If you want to change the figure you chose, follow the same procedure, and place the new figure on the space of the previous figure. If your answer is correct, you will advance to the next window. If your answer is incorrect, the word \"incorrect\" will appear in the upper right part of the screen, the figures will disappear from the spaces where you had placed them and you will have to choose other figures, following the same procedure. For each window you have a maximum of 3 possible errors, if you accumulate 3 errors, you will automatically advance to the next window\".",
    "At the beginning of the first test session, present participants with the following instructions on the screen: \"Solve the task in the same way as in the previous block. When you have completed all four spaces with the arrangement that you consider correct, click the \"Continue\" button, located at the bottom right of the screen to proceed to the next window. This time you will not be told if your answer is correct or incorrect\".\n2. Dynamics of relational behavior under restriction of behavioral patterns\nNOTE: Two sophomore students, 19 and 21 years old, respectively, participated. Students were awarded an extra point in one of their subjects, regardless of their scores obtained in the experiment.\nApparatus and experimental situation\n\t\nUse the same ones described in Experiment 1.\nExperimental design and task\n\t\nUse the task as described in Experiment 1.\n\t\tNOTE: The difference was that in this experiment, the employed SOs varied in four different sizes: smaller (50 x 33 pixels), small (66 x 42 pixels), large (82 53 pixels), and larger (106 x 66 pixels), with four different colors randomly assigned: blue, yellow, red, and black, as shown in the right part of Figure 1.\nPresent SOs in a computer screen, divided in three zones, as shown in the right part of Figure 2. In this case SRC 1 and 2 exemplified two degrees of size relationship \"larger or smaller than\" with the same shape.\nAs in Experiment 1, in order to place the figures in the CRC zone, have the participant select the figure with the mouse pointer and drag it to the blank spaces in the CRC zone.",
    "Place figures in different sequences (called placement sequences) and change (figure changes were called excessive placements) depending on the experimental condition. Placement sequences and excessive placements were considered as local patterns.\nTwo sub-experiments of restriction of local patterns were used (Table 2), each participant was assigned to one of two sub-experiments.\n\t\t\nConform each sub-experiment according to the combination of restrictions or non-restrictions of placement sequences and excessive placements.\nIn both sub-experiments, employ three training sessions with 36 trial each (18 \"larger than\" and 18 \"smaller than\", randomized), and one test session consisting of 36 trials each (18 \"larger than\" and 18 \"smaller than\", randomized). In addition, training and test sessions involved a relationship criterion in terms of the SOs being used.\n\t\t\tNOTE: An example of the screen of relationship criteria is shown in Figure 5.\nDuring training, after each trial, present the word \"correct\" or \"incorrect\", depending on the CRC conformed.\n\t\t\nIf the answer was correct, display a new trial. If the answer was wrong, display the same trial up to two more times (corrective trials).\nPresent test trials without feedback and show only once.\nAs in Experiment 1, before the first experimental phase, conduct one session of an \"ordering task\". In this case, participants could place each type of stimulus component along a size continuum.\ntable:\n﻿0,1,2\nSub-Experiments,,\nP1 No restriction of placement sequences and excessive placements,Training,Test\nP2 Restriction of placements sequences and restriction of excessive placements,Training,Test\nTable 2. Design of Experiment 2​\nimgsrc://cloudfront.jove.com/files/ftp_upload/62285/62285fig05.jpg\nFigure 5. Example of screen of relationship criteria in the four sessions of the Experiment 2. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62285/62285fig05large.jpg]\nProcedure\n\t\nOrdering task",
    "Use the ordering task as described in Experiment 1. The difference was that four figures shown in the lower zone varied on a size continuum. So, participants had to arrange the figures from \"larger to smaller\" (or vice versa), as shown in the right part of Figure 4.\nComparison task\n\t\t\nUse the task as described in Experiment 1, the difference was that in each condition, in training and test sessions, a relationship criterion was set in terms of the size (larger or smaller than) and the type (shape) of SOs (see Table 2).\nHave the stimulus objects used in the CRC zone comply with the \"larger or smaller than\" relationship, had to vary the degrees of size and be different in shape with respect to the SRC (see the right part of Figure 2).\nDiffer each sub-experiment in terms of restriction or not of local patterns: 1) in the first one, the placement sequences could vary, and it was allowed to have excessive placements, 2) in the second one, placement sequences and excessive placements were restricted. In the condition with restrictions participant were not informed about it.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}