{
  "id": 1958,
  "origin_website": "Cell",
  "title": "LiverClear: A versatile protocol for mouse liver tissue clearing",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: Unless otherwise stated, all storage, wash and incubation steps should be completed with a volume of solution that occupies at least 3 volumes of tissue. For example, if a tissue occupies approximately 2 mL of volume, all wash and incubation steps should be completed with >= 6 mL of solution.\nHarvesting and fixing liver tissue\nTiming: 2 days\nMice should be housed, fed, and monitored in accordance with the protocols approved by the Institutional Animal Care and Use Committee. Mice should be euthanized humanely before the livers are removed. All mice used in this protocol were treated in accordance with the protocols approved by the Institutional Animal Care and Use Committee at the University of Pittsburgh School of Medicine.\nOptional: Perfusion of the liver as described previously (Seglen, 1976[href=https://www.wicell.org#bib14]; Gores et al., 1986[href=https://www.wicell.org#bib5]) may be performed if desired, first with 1× PBS followed by 4% PFA in 1× PBS, prior to liver harvesting. This step, while optional, is strongly recommended, because it will remove any blood in circulation which facilitates tissue clearing by reducing the starting level of heme-containing compounds. Perfusion-fixation will result in rapid preservation and help maintain better tissue integrity over the course of clearing.\nFix fresh tissue (whole liver or individual lobes, 5 mm thickness or less) in 4% PFA in 1× PBS for 24–48 h at 4°C.\nNote: This step should be completed even following the above optional step of liver perfusion. Strong fixation is necessary to maintain tissue integrity during the clearing process.\nAlternative: Tissues may also be fixed in 10% formalin. This is most applicable for human liver tissue which may be processed by a clinical pathology laboratory.",
    "Wash tissue with PBSA 3 times for 15 min each at room temperature (25°C–37°C) on a rotating nutator, or longer if desired. Fixed tissues can be stored at 4°C in PBSA for up to a year. It is imperative to store tissue in PBSA which includes sodium azide as a preservative to prevent growth of fungus or bacteria in the tissues (see problem 1[href=https://www.wicell.org#sec7.1]).\nHydrogel embedding of liver tissue\nTiming: 2 days\nIn this step, the tissue is embedded in an acrylamide-based hydrogel which is crosslinked to proteins within the tissue and holds them in place to preserve the overall tissue architecture. This is essential to ensure that structures are visualized in their native spatial relationships and to minimize structural disruption caused by the next steps of the clearing process.\nIncubate the tissue in hydrogel solution overnight (for at least 12 h and up to 24 h) at 4°C in a 50 mL Falcon container, making sure the tissue is fully submerged. This solution should be made fresh each time and can be stored at 4°C for about a week.\nPolymerize the hydrogel by placing the 50 mL container with tissue and hydrogel solution into a water bath at 37°C for 2.5 h. The hydrogel should be neither firm nor runny, with a gelatin-like texture.\nRemove polymerized hydrogel containing the tissue from the container and rub off excess hydrogel surrounding the tissue. Wash the tissue with 1× PBS.\nPause point: If necessary, tissues may be kept at 4°C in polymerized hydrogel solution overnight.\nElectrophoresis-based tissue clearing and depigmentation\nNote: This protocol refers to the X-CLARITYTM clearing system. See the other resources section for information on alternative clearing systems.\nEquipment setup\nTiming: 3–4 h\nSet up X-CLARITYTM Electrophoretic Tissue Clearing System.",
    "Run distilled water through the system 2 times to ensure that it is clean. Ensure there are no leaks in any of the tubing connecting the main system, the sample holder, and the buffer reservoir.\nPlace 1–1.5 L of Electrophoretic Clearing SolutionTM (or see alternative electrophoresis clearing buffer in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section) into the reservoir and run the system at temperature 37°C, voltage 70 V, pump speed 100 rpm, and current ∼1.2 Amps for 20 min to ensure that the temperature is maintained at or below 37°C.\nElectrophoresis-based tissue clearing and depigmentation\nTiming: 5–9 days depending on tissue size and composition\nDuring this stage, the tissue is submerged in a buffered solution containing the detergent SDS. An electrophoretic gradient is applied to facilitate removal of lipids from the tissue. At the same time, we add N,N,N′,N′-tetrakis(2-hydroxypropyl)ethylenediamine (Quadrol) to the solution, which contributes to the depigmentation of heme-containing macromolecules within the liver.(Susaki et al., 2014[href=https://www.wicell.org#bib15])\nBegin active tissue clearing process.\nTurn on the X-CLARITYTM Tissue Clearing System (set up as per manufacturer specifications).\nAdd 1.5 L of X-CLARITYTM Electrophoretic Tissue Clearing Solution to the reservoir. Then add 10–20 mL of Quadrol to the reservoir. Quadrol is very viscous. Do not try to dissolve the Quadrol manually, it will gradually dissolve over time when the buffer begins to circulate.\nPlace the tissue into the desired sample holder (see 3D-printing instructions in the other resources section) and place it into the ETC chamber of the X-CLARITYTM system.\nCritical: Make sure the tissue is secured and cannot float out of the chamber as this could block the buffer from circulating freely and raise the pressure inside the chamber which may cause it to crack and leak. Also make sure the chamber lid and reservoir lids are sealed securely to prevent leaks.",
    "Adjust the settings on the X-CLARITYTM system to set the temperature at 37°C, voltage at 70 V, pump speed at 100 rpm, and current at ∼1.2 Amps (both voltage and Amps will vary as the buffer is consumed). Set the machine to constant current.\nBegin the run by starting the X-CLARITYTM system and selecting ETC Active Clearing.\nReplace the tissue clearing solution every 24–48 h.\nCritical: How long the tissue will take to clear depends on the dimensions of the tissue as well as the composition of the tissue which may be influenced by genetic, environmental and experimental factors. A small chunk of liver 2 mm in thickness may clear in 48–72 h, while a whole median lobe, left lobe, or right lobe of murine liver may clear in 1–2 weeks, after which it will reach a steady state and is unlikely to clear any further. The Quadrol will initially turn the tissue into a brown/green color due to dissolved heme, but as the clearing proceeds, the color will be released into solution and the liver will begin to turn pale. Under most circumstances, the color will never be fully removed from the liver at this stage. You can expect the tissue to have a light red/brown hue. The liver will not appear clear at this stage. (See problem 2[href=https://www.wicell.org#sec7.3]).",
    "Critical: The tissue clearing solution will turn yellow over time and should be replaced every 24–48 h to encourage continuous dissolution and removal of lipids from the tissue into circulation. The tissue can be cleared for up to 2 weeks if needed with regular changes of clearing solution. You may pause the run at any time to visually check on the state of the sample. If clearing multiple tissues at a time, you may need to change the buffer more frequently. Additionally, when clearing multiple samples simultaneously, it may be helpful to rotate samples into different compartments within the clearing chamber to ensure uniformity of clearing among the samples. An opportune time to rotate samples is during changes of clearing solution.\nWhen the color of the liver has reached a steady state (see the note above), stop the run, drain the sample chamber and turn off the X-CLARITYTM system. Remove the sample from the sample holder and wash the tissue in PBSA.\nPause point: The tissue can be stored at this point in PBSA at 4°C for up to 1 year.\nAmmonium hydroxide treatment (optional for mouse liver; recommended for human liver)\nTiming: 24–72 h, depending on tissue size and composition\nNext, the tissue is treated with ammonium hydroxide to further dissolve heme and further decolorize the tissue (Jing et al., 2018[href=https://www.wicell.org#bib8]).\nWash the tissue in PBSA for 2 h on a shaker.\nPlace the tissue in a solution of 5% ammonium hydroxide for 24–72 h on a gently rotating shaker at 30°C–37°C. Change the solution every 12–24 h.\nNote: Step 11 can be repeated several times. The tissue should appear yellowish-white after this step. However, once no obvious improvement in color is seen after repeating step 11, then continue to step 12.",
    "Pause point: The tissue can be stored at this point in PBSA at 4°C for up to 1 year.\nHydrogen peroxide bleaching\nTiming: 24–72 h, depending on tissue size and composition\nNext, the tissue is bleached with hydrogen peroxide which will further eliminate light absorption. Treatment with substances like hydrogen peroxide can contribute to bleaching of pigments through oxidation and structural degradation (Tainaka et al., 2016[href=https://www.wicell.org#bib17]). The duration of treatment can be adjusted based on the size of the tissue.\nWash the tissue in PBSA for 2 h on a shaker.\nPlace the tissue in a solution of 3% hydrogen peroxide for 24–72 h. Change the solution every 6–12 h.\nNote: Step 13 can be repeated several times. The tissue should appear yellow/white after this step. However, once no obvious improvement in color is seen after repeating step 13, then continue to step 14. (See problem 2[href=https://www.wicell.org#sec7.3]).\nWash the tissue in PBSA for 2 h on a shaker.\nPause point: The tissue can be stored at this point in PBSA at 4°C for up to 1 year.\nImmunofluorescence staining\nTiming: 2–3 weeks",
    "At this stage, the cleared tissue can be used for immunofluorescent labeling. We have based our method on the SWITCH protocol (Murray et al., 2015[href=https://www.wicell.org#bib12]), which has been shown to improve the distribution of antibody throughout thick tissue samples while reducing antibody-antibody aggregates which may contribute to artifacts during imaging. This method uses SDS to prevent antibody binding while the antibodies are diffusing through the sample to achieve an even distribution of stain throughout the tissue. Upon removal of the SDS the antibodies can then bind to their targets. The antibodies used here are the same as those used in conventional immunolabeling, and protocols should be optimized accordingly (see problem 3[href=https://www.wicell.org#sec7.5], problem 4[href=https://www.wicell.org#sec7.7], and problem 5[href=https://www.wicell.org#sec7.9]). Concentrations of antibody in LiverClear should remain the same or be increased relative to conventional immunofluorescence staining protocols to account for the size of the sample that is being stained and the commensurate increase in antigen. In general, the total amount of antibody used is generally much greater than for conventional staining. We suggest optimizing on smaller fragments of cleared tissues prior to scaling up. After staining, the samples are post-fixed in paraformaldehyde to lock the antibodies in place long-term which enables prolonged imaging sessions and storage of the sample.\nNote: Since hydrogen peroxide is reactive, it is suggested that each antibody be tested on tissue sections to determine whether it still performs as expected after hydrogen peroxide treatment. Hydrogen peroxide did not affect the performance of antibodies used in our studies.\nPrimary antibody stain:\nAcclimate the tissue in IHC buffer with SDS / SWITCH-OFF for 1 h – overnight. See note included with the SWITCH-OFF solution recipe regarding the flexibility of SDS concentration. SDS concentration in SWITCH-OFF should be tested for each antibody combination.",
    "Incubate tissue in SWITCH-OFF along with primary antibodies of choice for 4–7 days depending on the size of the tissue. The tissue should be kept on a shaker rotating gently at a temperature ranging from 25°C–37°C. Multiple primary antibodies can be added at the same time, as with conventional immunofluorescence staining protocols.\nCritical: Tissues should be incubated in wide-bottom tubes (such as 50 mL Falcon containers) to allow for free circulation of the solution containing antibodies all around the tissue. The tissue should be fully submerged. The volume should be only enough to cover the whole tissue to minimize antibody waste and maximize antibody concentration.\nWash the tissue in IHC buffer / SWITCH-ON without antibodies for 24 h, on a shaker at a temperature ranging from 25°C–37°C.\nWash the tissue in SWITCH-ON solution 3 times for 2 h each, on a shaker at a temperature ranging from 25°C–37°C.\nSecondary antibody stain:\nAcclimate the tissue in SWITCH-OFF buffer for 1 h – overnight.\nIncubate tissue in SWITCH-OFF solution as well as secondary antibodies conjugated to fluorophores of choice for 4–7 days depending on the size of the tissue. The tissue should be kept on a shaker rotating gently at a temperature ranging from 25°C–37°C. Keep the tissue shielded from light by covering the container in aluminum foil.\nNote: At this stage nuclear stains like ToPro3 and DRAQ5/7 can be added. These stains are compatible with SWITCH and it is suggested that you use SWITCH when using these dyes in large cleared samples. Avoid DAPI for the reasons discussed in the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section.\nIncubate tissue in SWITCH-ON for 24 h, on a shaker at a temperature ranging from 25°C–30°C.",
    "Wash the tissue in SWITCH-ON or PBSA 3 times for 2 h each, on a shaker rotating gently at a temperature ranging from 25°C–37°C.\nIncubate the tissue in 4% PFA for 2 h on a shaker rotating gently at a temperature ranging from 25°C–30°C. This step fixes the antibody stain in place and enable the sample to undergo prolonged imaging sessions and storage.\nWash tissue in PBSA for 1 h on a shaker rotating gently at a temperature ranging from 25°C–30°C.\nPause point: It is strongly suggested to continue to the next steps to get the best imaging results. However, the tissue can be stored at this point in PBSA at 4°C for up to 1 year. Prolonged storage is likely to result in signal degradation.\nCUBIC R2 clearing\nTiming: 24 h–2 weeks (or storage for 1–2 years)\nThe final stage of clearing involves submerging the tissue in CUBIC R2 solution, which has a refractive index similar to liver tissue. The tissue will appear more transparent the longer it is left in the CUBIC R2 solution. Clearing is usually complete within a few days but can require up to 2 weeks for large samples.\nNote: CUBIC R2 solution contains urea which will cause the liver tissue to expand over time. Expansion of the tissue will improve clearing, but because the tissue is physically larger it may be less amenable to imaging on some microscope platforms.\nPlace tissue in CUBIC R2 solution at room temperature for at least 24 h. Change the solution every 24–48 h until the desired clarity is achieved.",
    "Pause point: It is strongly suggested to continue to the next steps to get the best imaging results; however, the tissue can be stored at this point in CUBIC R2 at room temperature in the dark for up to 1–2 years.\nMicroscopy and image processing\nTiming: 1 week\nIn this study, we used ribbon-scanning confocal microscopy (Watson et al., 2017[href=https://www.wicell.org#bib20]) outfitted with a Nikon CFI90 20XC Glyc objective. Fluorescent imagery in all figures was generated in Bitplane Imaris. LiverClear samples can be imaged on any microscope platform designed for large cleared tissue."
  ],
  "subjectAreas": [
    "Microscopy",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}