{
  "id": 18562,
  "origin_website": "Jove",
  "title": "Surgical Models of Gastroesophageal Reflux with Mice",
  "procedures": [
    "All the animal experiments have been approved by the Institutional Animal Care and Use Committee.\n1. Mouse Preparation\nUse mice over ~20 g in body weight or above ~6 weeks in age for surgery.\nBefore surgery, give mice a laboratory chow and water ad libitum and maintain on a 12:12 hr light-dark cycle.\nShave the surgical area with a hair clipper. Anesthetize mice by intraperitoneal injection of 80 mg/kg ketamine and 12 mg/kg xylazine. This dose puts mice into sleep in a few minutes and provides sufficient anesthesia for the following surgical procedures.\nConfirm proper anesthetization based upon the absence of corneal reflex and limb retraction when the footpad is pinched. Apply lubricating ophthalmic ointment on eyes to prevent dryness.\nSterilize skin with betadine solution.\n2. Gastric Reflux Model (Figure 1B)\nMake an upper midline incision of ~2 cm starting from the xiphoid pointing to the anus.\nOpen up the abdominal cavity through the midline. Remove the xiphoid to enhance exposure with a pair of scissors.\nSeparate and cut the connective tissues between the liver and the stomach. Ligate and cut the vessel bundle between the spleen and the fundus in order to completely free up the fundus.\nTurn the fundus slightly to the left and expose the left side of the gastroesophageal junction in the field. Make a 5 mm longitudinal incision on the muscle along the distal esophagus using a pair of sharp scissors to expose the epithelium.\nCut open the epithelium along the same direction (incision 1, Figure 1B). Make three incisions on the forestomach (incision 2, 3 and 4, Figure 1B) to cut off most of the forestomach with sharp operating scissors. If the stomach is not empty, carefully remove gastric contents.",
    "Place an 8-0 prolene suture (with a taper point needle) through Point a (on the esophagus) and Point a’ (on the forestomach) with accurate mucosal to mucosal opposition. Likewise place sutures through Point b and Point b’, and other pairs of Points, respectively. Evenly space these sutures 3-4 mm from each other.\nWash the abdominal cavity with normal saline to clean up blood and gastric contents. Close the abdominal wall with silk sutures and the skin with metal clips.\n3. Mixed Reflux Model (Figure 1C)\nFollow steps 2.1 to 2.4 to expose the gastroesophageal junction.\nGently separate the dorsal side of the esophagus from the blood vessels behind the esophagus. Pass a small cotton tip between the esophagus and blood vessels.\n\tNote: Cotton may be partially removed from the tip to reduce its size. This cotton tip serves two purposes, lifting up the esophagus and protecting the blood vessels.\nMake two 5 mm longitudinal incisions each on the gastroesophageal junction and the proximal end of duodenum adjacent to the pylorus with sharp operating scissors. For the incision on the duodenum, avoid blood vessels and place on the anti-mesenteric border.\nAnastomose the incisions with accurate mucosal to mucosal opposition with interrupted 8-0 Prolene sutures. Usually place 3-4 sutures on the dorsal side and 2-3 sutures on the front side.\nRemove the cotton tip. Wash the abdominal cavity with normal saline and close the abdominal wall and the skin.\n4. Duodenal Reflux Model (Figure 1D)\nFollow step 3.1 to 3.4 to generate mixed reflux.",
    "Carefully lift up the stomach to expose its back side. A lobe of the liver may be caught by connective tissues between the liver and the back of the stomach. Carefully cut the connective tissues, properly protect the liver, and expose the blood vessels on the dorsal side of the esophagus.\nLigate and cut the blood vessels. Ligate and cut the esophagus at the gastroesophageal junction.\nLigate the duodenum at the pylorus. Ligate and cut the mesenterium. Remove the whole stomach.\nWash the abdominal cavity with normal saline. Close the abdominal wall and the skin.\n5. Post-surgical Treatment\nAfter surgery maintain body temperature with a heating pad. Only after regaining sternal recumbency, place the mice back with other animals.\nGive antibiotics and analgesic to prevent infection and alleviate pain. Inject Baytril (10 mg/kg, i.p., q.d, for 3 days) to prevent infection, and Buprenorphine hydrochloride (0.05 mg/kg, s.c., b.i.d. for two days) as painkiller. Fasting is not necessary after surgery.  \n\tA liquid or soft diet may be given. \nAssess the general health condition on daily basis.If the mice show the following signs (dramatic weight loss >15%, lack of appetite, vocalization, discharge from the mouth, nose or eyes, hunched gesture, inactivity, abnormal grooming activity), euthanize the mice.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}