{
  "id": 8960,
  "origin_website": "Jove",
  "title": "Acute In Vivo Electrophysiological Recordings of Local Field Potentials and Multi-unit Activity from the Hyperdirect Pathway in Anesthetized Rats",
  "procedures": [
    "Experimental procedures were conducted in accordance with the German Animal Welfare Act (last revised in 2014) and European regulations (2010/63/EU). Experiments were approved by the local animal welfare authority (LaGeSo, Berlin), and conformed to local department and international guidelines.\nNOTE: In the presented method two models of electrodes are used to record from the hyperdirect cortico-basal ganglia pathway that connects the primary motor cortex (M1) with the subthalamic nucleus (STN) and the substantia nigra pars reticulate (SNr). For epidural electrocorticogram (ECoG) recordings from the M1 custom-made low-impedance Ag/AgCl electrodes are used. The recordings from the STN and SNr are performed with commercially available high-impedance tungsten electrodes.\n1. Construction of Epidural Ag/AgCl Epidural Electrodes\nTake an approx. 5 cm long strip of 99.99% pure silver wire with a diameter of 200 µm and remove any coating if necessary.\nHold the wire tip with the tip downwards into a flame of a lighter or candle until the tip starts to melt. Wait until the tip is ball-shaped and has a diameter of approximately 1 mm. Cut off the preformed electrode to a total length of 15 mm from the beginning of the ball-shaped tip to the wire end.\nSolder a precision connector to the wire end, which fits the used electrophysiological recording system. Cover the soldering point from the wire end to the connector with conductive silver varnish. This helps conductivity and results in a better signal quality.\nAfter the conductive varnish has dried, cover the soldering point with a 3 mm to 1 mm heat shrinking tube. Carefully use a watchmaker's hammer to flatten the ball-shaped tip to half the thickness.\nPut on examination gloves and take a lint-free cleaning cloth with 100% ethanol to remove any dirt and grease.",
    "Put the electrodes in a 15 mL centrifuge tube or cell culture tube and fill it up with household chlorine bleach (CAUTION; containing 2.8 g of sodium hypochloride per 100 g solvent) until the ball-shaped tip is fully covered.\n\tCAUTION: Chlorine bleach is corrosive; always follow the manufacturer's safety instructions.\nTake the electrodes out after 23 min and flush them generously with distilled water. The successful application of a silver chloride layer appears as a homogenous purple change in color.\nDry in air. After fully dried, take the electrodes with fine tweezers. With a fine paintbrush, apply liquid electrical insulation. Start on the wire directly behind the electrode tip and cover everything up to the heat shrinking tube. Let the insulation dry for at least 2 h.\nFor quality control, perform a check of electrical conductivity with a multimeter. If available, perform impedance testing at 1 kHz using an appropriate impedance meter, while the electrode and test probe are put together in a 0.9% NaCl containing H2O solution without touching each other. Impedance values at 1 kHz should be approximately 8 kΩ.\n2. Affixing the Electrodes to a Stereotaxic Holder",
    "NOTE: To record MUA and LFPs at the same time, use tungsten microwire electrodes with an impedance of 1.5 MΩ. If the focus of the recordings is on high quality recordings of single units, choose microwire electrodes with a higher impedance (>5 MΩ). If the aim of the study is solely directed at LFPs, electrodes with lower impedances can be acceptable. For small structures, for which dorsoventral stereotaxic adjustments are often necessary, use pairs of electrodes with a suitable dorsoventral tip separation (in this case 250 µm). Furthermore, this provides the advantage of a more local reference electrode, if needed. The stereotaxic coordinates are always measured from the lowermost electrode and are calculated in reference to the bregma.\nTake a standard stereotaxic electrode holder with an acrylic block and clamp and lay it securely on a flat surface in the field of view of a surgical microscope.\nLoosely fix the first pair of electrodes to the acrylic block of the holder with pieces of adhesive tape (3 mm x 8 mm) using fine tweezers. The electrodes should protrude the acrylic block approx. 12 mm.\nCarefully fix the second bipolar electrode next to the first electrode. For targeting the structures of the hyperdirect pathway, the distance should be 2 mm (Figure 1). For most standard stereotaxic electrode holders, this is the adjacent recess. Use a caliper gauge to verify. Different networks can be approached the same way. For this, the acrylic block may be turned to a certain degree.\nAdjust the second pair of electrodes by sliding it carefully to a position, in which the most ventral tip is approximately 200 µm recessed compared to the first electrode (Figure 1). Do this under microscopic vision. For this, use a 30 G cannula (outer diameter 300 µm) to better estimate the distance.",
    "Press on the adhesive tape, and then secure with the holder's metal clamp.\n3. Surgery\nFor electrophysiological recordings, use urethane (CAUTION) for anesthesia.\n\tCaution: Urethane is toxic and carcinogenic, so always adhere to the safety regulations and data sheet given by the substance's manufacturer.\nPrepare a solution of 200 mg/mL urethane in 0.9% NaCl medical saline solution.\nAdminister a total of 1.3 g/kg bodyweight urethane intraperitoneally (IP). Depending on the rat strain it might be reasonable to split the dose into two doses with a 15 min interval in between the injections in order to enhance the safety of the anesthesia.\nCheck the depth of anesthesia by using pedal-withdrawal reflex and other suitable reflexes. If the anesthesia is not deep enough to perform surgery, inject 0.15 g/kg bodyweight of urethane IP and wait another 15 min.\nApply an eye ointment to prevent corneal dehydration.\nConstantly monitor respiratory rate and pedal withdrawal reflex during anesthesia. Use a small animal heating pad with temperature control to ensure that a physiological body temperature is maintained throughout the surgery. Before the start electrophysiological recordings, change to a non-electrical alternative (e.g. sodium acetate head pad).\nShave the fur alongside the dorsal side of the head to achieve a clean surgical field. Disinfect around the incision site with appropriate surgical disinfectant. Fix the animal in the stereotactic frame.\nPerform a 2-cm long incision of the scalp in sagittal direction with a scalpel. Use a scalpel to slightly scrape off the skull aponeurosis and disinfect the skull. Use cotton buds soaked in 3% H2O2 to remove any remaining tissue.\nUse an electrocauter or thermocauter to control bleeding, if necessary. Stop bleedings from the skull bone and hypoderm, if the bleeding does not stop spontaneously after 1-2 min and hinders sight onto the skull.",
    "Adjust the incisor bar until the head is positioned in flat skull position, which means the bregma and lambda as stereotaxic reference points are in the same plane. This is most important to achieve high surgical precision. Use a standard stereotaxic rat alignment tool, calibrate the designated tip to the bregma under microscopic vision and adjust the incisor bar until the designated points for the bregma and lambda on the tool touch the skull at the same time.\n\tNOTE: A view from one side with focused light from the other may help to determine this condition. Alternatively, take a stereotaxic holder with a fine cannula and measure the dorsoventral coordinates of Bregma and lambda under microscopic vision. Adjust the incisor bar until the dorsoventral coordinates of Bregma and lambda are the same.\nUse a stereotaxic holder with cannula, calibrate to the bregma and then calculate the position of all drill holes on the skull. Using the stereotaxic holder, mark the positions of the holes to be drilled either by carefully scratching the skull or by using a surgical color marker. The coordinates for this depend on the targets, coordinates with reference to the bregma are given for the hyperdirect pathway in Table 1, including the suggested coordinates for cerebellar reference electrodes.\nUsing a microdrill carefully drill all holes. For the STN and SNr, drill a common hole (approximately 2 mm x 3 mm in size). All other drill holes should have a diameter of about 1 mm.\nTake two fine cannulas (at least 27 G) and bend their tips to form a hooked shape, using a hard surface or tweezers. Use these to remove any debris from the drill holes, and carefully cut and remove the dura mater in the common STN/SNr hole.",
    "Flush the drill holes with physiologic saline. Apply a drop of physiologic saline every 15 min to the drill holes to prevent the brain and dura from drying-out.\nTake a microdrill and matching stainless steel micro-screw (e.g. a M 1.2 mm x 2 mm screw), drill a hole and screw in a micro-screw in between the drill holes of the reference epidural electrodes above cerebellum, do the same for the M1 epidural electrodes.\nSlide the self-built Ag/AgCl epidural electrodes into the drill holes for the reference electrodes and M1 electrodes. Guide the electrode tip with fine tweezers and slide it directly below the skull bone into the drill hole.\nFix all epidural electrodes with two-component dental acrylic. Make sure not to cover the bregma point nor affect the common STN/SNr hole.\nInsert the prepared holder with the tungsten microwire electrodes into the stereotaxic frame.\nCalibrate the most ventral electrode, which is intended to target the STN, to the bregma. Adjust to the calculated position above the common STN/SNr hole and lower the electrodes down to the brain under microscopic vision. Make sure that the tungsten microwire electrodes go inside the brain smoothly.\n4. Electrophysiological Mapping and Recordings\nNOTE: For this step, a Faraday cage and a multi-channel electrophysiological recording system with recording software capable of online-filtering and online spike-sorting is necessary. Preferably use a system that works with a preamplifier positioned near the head of the animals to keep electrical noise and artifacts to an absolute minimum. Besides the tungsten microwire electrodes, at least one epidural and one reference electrode are necessary to perform recordings of the hyperdirect pathway. It is recommended to insert epidural and reference electrodes pairwise without them touching each other, this helps in case of malfunctioning and allows for different types of referencing in data analysis.",
    "Put a mobile Faraday cage above the stereotaxic frame. If only a stationary Faraday cage is available, carefully move the stereotaxic frame into the Faraday cage while making sure deep brain electrodes are not lowered into the brain until the stereotaxic frame is in its final position.\nConnect the electrodes to the headstage of the electrophysiological setup. Make sure the reference electrodes are connected to appropriate reference channels.\nSet up the recording software: Bandpass filter (0.05-8,000 Hz) and amplify (gain 1,500-2,000x) the raw data signal. Use an online LFP and spike filter with appropriate settings (bandpass filter 0.05-250 Hz for LFPs, bandpass filter 300-8,000 Hz for MUA). For all filters, use a butterworth-type filter.\nSet up a spike threshold, if applicable, for online spike sorting. Most recording software allows for setting up of a spike threshold, which is an amplitude value above which a signal is marked as a spike by the software. This threshold can either be determined mathematically as a factor or standard deviation of the mean amplitude of the filtered spike signal, or can preferably be determined by visual inspection of data segments <500 ms and set up as a line above the signal noise in a graphical user interface.\n\tNOTE: The intention in setting up a spike threshold is to count spikes and sort units in order to provide information on how many neurons are presently recorded and how their spikes are shaped.\nSlowly lower the tungsten microwire electrodes to 1 mm dorsal of the target, which is STN for hyperdirect pathway. Wait for the signal to stabilize if necessary.",
    "For the electrophysiological mapping, advance the electrodes ventrally in steps of 100 µm. At each step, evaluate the firing pattern, firing rate and shape of spikes. Compare those with the typical examples given in Figure 2. Commonly, dense nuclei show fast and continuous spiking over several dorsoventral steps, whereas fiber-rich structures show low firing rates and less homogenous spike activity in subsequent ventral steps.\nFor the hyperdirect pathway, make sure that the most ventral electrode is inside STN.\n\tNOTE: The STN is reached when a considerable increase in MUA is detected ventral of the Zona incerta. Ventral to the STN, spiking stops almost completely because the electrode has reached the internal capsule. When the most ventral electrode is in STN, the configuration of the tungsten microelectrodes ensures the posterior, second electrode is in SNr. Dorsoventral fine-tuning in small increments might be necessary to record typical MUA in STN and SNr at the same time. Note that the frequency of MUA depends on the number of neurons actually recorded and on the level brain activation.\nOnce the electrodes are in the desired structures, set up online filtering and spike-sorting (see Figure 4), and then start the recording of the data. Typical examples for the different cortical synchronization states that can be identified in the LFP recordings are shown in Figure 3.\n5. End of Experiment\nWhen recordings are done, slowly raise the electrodes out of the brain and instantaneously flush them with physiological saline. The electrodes can be reused after thorough flushing and visual inspection. Discharge bend electrodes.\nEuthanize the animals by an IP injection of an overdose of urethane (2.5 g/kg bodyweight).\n\tNOTE: Urethane should only be used for final procedures.",
    "If histological verification of the electrode position or other histological staining procedures is required, remove the brain from the skull and process the tissue appropriately.\n\tNOTE: Depending on the intended staining methods, transcardial perfusion may be necessary. For post-mortem verification of the electrode position, a standard Nissl staining is sufficient in most cases to visualize the electrode trajectory in e.g. coronal brain sections. Further approaches to facilitate histological target verification include the use of electrically induced lesions to the brain tissue by applying electrical current via the recording electrodes or the application of biocompatible dye prior to electrode insertion16,17.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}