{
  "id": 3845,
  "origin_website": "Cell",
  "title": "Cell population analysis of the adult murine subependymal neurogenic lineage by flow cytometry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThere are two slightly different variants of this protocol. Both share the core procedure, but differ in a few critical steps, as well as in the type of analysis that they are intended for. Protocol A consists in the labeling and analysis of the SEZ lineage in non-fixated samples and can be employed for both quantitative analysis of the SEZ populations by flow cytometry or to isolate specific cell types by Fluorescent Activated Cell Sorting (FACS) for subsequent in vitro culture or molecular analysis. Protocol B includes the additional in vivo incorporation of the artificial thymidine analog EdU (5-ethynyl-2′-deoxyuridine) during the S-phase of the cell-cycle for assessment of the cycling dynamics of the identified populations. Because EdU detection requires the use of a fixative agent, this protocol is only suitable for quantitative analysis within populations. Since this protocol variant requires some exclusive extra steps, for clarification, they will be indicated as ‘only in Protocol B’ along the step-by-step method details.\nNote: As indicated in the key resources table[href=https://www.wicell.org#key-resources-table], this protocol has been set up using the gentleMACS Octo Dissociator (Miltenyi) which can homogenize up to 8 samples simultaneously. Accordingly, timing for each step of the protocol has been calculated assuming that 8 mice are processed. The procedure could be adapted to use other dissociation systems, but considerable differences in yield and population resolution might be expected.\nEdU pulse and chase (only in protocol B)\nTiming: variable (depending on pulse-chase regimen)",
    "Proliferation assessment in Protocol B is based on a classical pulse-chase experimental paradigm, adapted to work in combination with the cell-classifying analysis of SEZ populations. It relies on the incorporation of EdU by actively proliferating cells during a defined period of time (pulse) in which the nucleoside analog is administered intraperitoneally in a single or repeated doses that are followed by different chase regimes, depending on the experimental purpose and design. For instance, a single pulse plus 1-h chase will provide a proliferative labeling index for each cell population, whereas repeated pulses (usually 7, one every two hours, or 7×) followed by long chase times can be used to detect cells with low proliferative activity, commonly known as label-retaining cells (see, for example, Ferrón et al., 2007[href=https://www.wicell.org#bib6]; Belenguer et al., 2021[href=https://www.wicell.org#bib3]). The 7× pulse regime followed by a 12-h chase reveals transitions among NSC states (Belenguer et al., 2021[href=https://www.wicell.org#bib3]).\nPrepare EdU at 10 mg/mL dissolved in sterile 0.9% saline solution.\nInject EdU intraperitoneally at 50 mg/kg body weight (number and frequency of pulses can be varied). Use saline as vehicle for EdU-negative control samples.\nHouse injected mice in disposable or dedicated cages during the chase period and dispose of the soiled bedding as cytotoxic residues.\nDissection and tissue digestion\nTiming: 3 h (15 min/brain for dissection + 22 min for automatic dissociation + mice and sample handling)\nSacrifice mice according to current regulatory guidelines and institutionally approved protocols.\nCarefully extract the brains and keep them in ice-cold sterile 1× DPBS during the whole process in the appropriate plastic ware.\nDissect the SEZs as previously described (Belenguer et al., 2016[href=https://www.wicell.org#bib2]) and shown in Methods video S1[href=https://www.wicell.org#mmc1]. Keep them in ice-cold sterile 1× DPBS too.",
    "Critical: Carrying on excessive non-SEZ tissue during dissection will have a negative impact on the resolution of the analyses, so keep dissected pieces very thin, with minimal visible striatal fibers attached, and as homogeneous as possible between samples (Belenguer et al., 2016[href=https://www.wicell.org#bib2]; Figures 1[href=https://www.wicell.org#fig1]A–1D; Methods video S1[href=https://www.wicell.org#mmc1]). Dissection time has been calculated assuming an average-skilled experimenter.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. SEZ precise dissection, related to step 6\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/567-Fig1.jpg\nFigure 1. Example of the expected thickness of the dissected SEZ tissue\n(A) Frontal view of the dissected piece (SEZ ventricle face).\n(B) Rear view of the dissected piece (striatum face). Note that, although several striatal white fibers remain attached to the SEZ, they are scarce and it is possible to visualize areas of clean tissue between them.\n(C) A partial lateral view showing the expected thickness of the tissue piece.\n(D) The same frontal view as in A, showing that the dissected tissue should be thin enough to be translucent.\n(E and F) Bright-field images of SEZ homogenates showing expected viable cell (orange arrowheads) to debris ratio in a suboptimal (E) vs. optimal (F) preparation.\nScale bars: A–D, 1 mm; E and F, 50 μm.\nNote: In order to set the fluorescence threshold of CD9, the marker that separates non-neurogenic astrocytes from NSCs (see step 49g below), it will be necessary to include a tissue sample from a non-neurogenic region. We recommend processing a piece of cortex of similar size that can be easily obtained during the SEZ dissection (see Methods video S1[href=https://www.wicell.org#mmc1]).\nMince each dissected tissue into 5–6 smaller pieces.\nPrepare C tubes (GentleMACS) and the enzymes included in the Neural Tissue Dissociation kit (T). The gentleMACS Octo Dissociator can homogenate up to 8 samples simultaneously. For each processed sample prepare:",
    "MIX A: 1,750 μL buffer X + 200 μL enzyme T\nMIX B: 20 μL buffer Y + 10 μL enzyme A.\nNote: Check the provider protocol for further information:\nhttps://www.miltenyibiotec.com/DE-en/shop/comMiltenyiDatasheet/product?productId=70[href=https://www.miltenyibiotec.com/DE-en/shop/comMiltenyiDatasheet/product?productId=70]\nTransfer SEZ pieces from both hemispheres to a C tube with a plastic Pasteur pipette. Remove all the DPBS with a p1000 micropipette and leave only the tissue.\nOptional: In case of working with experimental conditions in which the total number of SEZ cells are expected to be low or if you are performing Protocol A to isolate high numbers of cells by FACS, it is possible to pool the SEZ from several mice and process them in the same C tube. According to the manufacturer’s instructions, as much as 1,600 mg of tissue can be digested in a single tube. We have successfully performed this protocol by pooling up the SEZs of three mice per tube at the most. As a reference to decide if your experiment requires to pool samples, take into account that we usually obtain around 100,000 live cells per mice that are further stratified in the different populations (see ‘Cytometry Analysis’ section below).\nAdd to each C tube: 1,950 μL of MIX A and 30 μL of MIX B. Work as fast as possible and proceed immediately to the next steps to minimize the action of trypsin outside the automatic dissociator.\nMake sure to tighten the cap of each C tube and carefully turn them upside down. All pieces must fall onto the blades of the cap so check that none remains attached to the walls of the tube.\nPlace the C tubes on the GentleMACS Octo Dissociator, place the heaters over each C tube and start preset program ‘37 NTDK’.",
    "Critical: Take into account that the panel of markers used in this protocol to stratify SEZ populations was optimized for trypsin digestion. The use of a different enzyme might also be possible, but be aware that the combination of surface antigens is greatly dependent on the digestion conditions. For instance, using the Miltenyi’s equivalent papain-based digestion kit with the same GentleMACS program, we found that several of the panel markers could no longer be used to identify and separate the SEZ populations as described (Belenguer et al., 2021[href=https://www.wicell.org#bib3]).\nSingle cell suspension\nTiming: 30 min\nPrepare one 15-mL collection tube per sample and place a 40 μm cell strainer on each one of them.\nAdd 1 mL of washing buffer with a p1000 micropipette so as to leave a small drop at the center of each strainer (do not discard the flow-through).\nPrepare 3 mL/sample of washing buffer supplemented with 100 μg/mL trypsin inhibitor.\nOnce the GentleMACS program is finished, remove the heaters and the C tubes. Turn the tubes upside down and make sure all the pieces fall to the bottom of the tube.\nCritical: Do not leave the samples waiting after the GentleMACS incubation, since trypsin overdigestion will have a negative impact on the surface antigen availability.\nAdd 3 mL of trypsin inhibitor-supplemented washing buffer to each C tube. Close the tube and carefully turn it upside down to wash the walls and the blades.\nCentrifuge 1 min at 100 × g to pull down all the sample.\nMechanically dissociate the remaining tissue chunks by pipetting up and down 20–30 times through a plastic Pasteur pipette (sample should appear cloudy but homogeneous). Avoid making bubbles and foam formation.\nTransfer the homogenate to the pre-wet cell strainer and collect the filtered solution in the 15-mL tube.",
    "Add 7 mL of washing buffer to each C tube rinsing it as in step 17 and pass it through the strainer. At this point, the volume of filtered sample should be of ≅ 11 mL.\nNote: This is the best moment to split the samples in case different combinations of antibodies need to be applied to the same sample. Take into account that, as in any other FACS experiment, the necessary single-stained and fluorescence minus one (FMO) controls will be required during the analysis step. Therefore, reserve a small portion of the experimental samples to be used as controls. Usually 1/10 of a 2-SEZ homogenate is sufficient for a single-stained control, whereas we recommend 1/3 for FMO controls. Be aware that at least half of each sample must be left for experimental data acquisition. Therefore, we recommend making a pool with an aliquot of each sample, taking into account the indicated proportions, and then split it into the desired controls. Once the samples have been distributed into new 15 mL tubes, add washing buffer up to 7 mL and proceed to step 22. Alternatively, when processing less than 8 samples or when analyzing a strain/phenotype in which cell yield might be limiting, include an extra wild-type mouse to be used exclusively to generate all the necessary staining controls.\nCentrifuge collection tubes to sediment cells at 300 × g, 10 min.",
    "Optional: During the initial setting up and optimization of this protocol, we used to include at this point an additional cleaning step with the Miltenyi’s Dead Cell Removal Kit, following the manufacturer's instructions. This procedure, that takes about 30 min, reduces the presence of dead cells and of cell and myelin debris in the sample, consequence of the enzymatic and mechanical disaggregation. The recognition and retention of dead cells and membrane fragments is performed by means of magnetic beads, so it requires a magnet (OctoMACSTM separator in key resources table[href=https://www.wicell.org#key-resources-table]) and suitable magnetic columns (MS columns in the key resources table[href=https://www.wicell.org#key-resources-table]), also provided by the kit manufacturer. As a result, initial FACS dot plots appear cleaner and the population of SEZ cells established by SSC-A vs. FSC-A gating (see step 49a below) is more clearly defined, but be aware that application of this procedure reduces the cell yield (up to 30% reduction) due to column retention and extra centrifugation steps. Therefore, we only recommend including this step in case you are not experienced at cytometry analysis or while optimizing the protocol. On the other hand, if you are performing Protocol A not just to obtain quantitative data but to isolate specific populations by FACS, it is critical to clean the sample. However, instead of using the Dead Cell Removal Kit, we recommended the use of Miltenyi’s Myelin Removal Kit, following the manufacturer’s instructions. Take into account that this procedure requires the use of a MidiMACSTM separator and LS columns (see ‘Other (optional)’ in the key resources table[href=https://www.wicell.org#key-resources-table]). Moreover, depending on the number of cells per population to be retrieved, it may be necessary to pool several mice per sample. In this case, myelin removal is absolutely necessary.",
    "Although the cell yield is similarly reduced, this step clearly improves the quality of the sorted samples.",
    "Note: Check the provider protocol for the Dead Cell Removal and Myelin Removal Kits for further information:\nhttps://www.miltenyibiotec.com/DE-en/shop/comMiltenyiDatasheet/product?productId=100[href=https://www.miltenyibiotec.com/DE-en/shop/comMiltenyiDatasheet/product?productId=100]\nhttps://www.miltenyibiotec.com/ES-en/products/myelin-removal-beads-ii-human-mouse-rat.html#200-ul[href=https://www.miltenyibiotec.com/ES-en/products/myelin-removal-beads-ii-human-mouse-rat.html#200-ul]\nOptional: If the experimental design requires that the total number of cells in the homogenate be estimated, remove supernatant and resuspend the pellet in washing buffer (approximately, 250 μL/SEZ). Count the number of viable cells with the method of your choice (see the expected viable cell to debris ratio in a suboptimal vs. optimal preparation in Figures 1[href=https://www.wicell.org#fig1]E and 1F). As mentioned before, a homogenate of the two SEZs from a 2-month-old wild-type C57Bl6/J mouse, without any magnetic cleaning step, yields around 100,000 total live cells in the 500 μL. Before continuing with the protocol, add FACS buffer up to 6 mL and perform again step 22.\nAntibody staining\nTiming: 40–50 min\nCritical: Sedimented cells from step 22 must be immediately incubated with the antibody mix, so have it prepared by the end of the centrifugation. In case of requiring more time to make calculations and mix the different antibodies, it is better to pause at step 21 and keep samples on ice. Start centrifugation once assured that the mix will be ready.\nPrepare 100 μL per sample of FACS buffer with antibodies and other labeling reagents (see Table 1[href=https://www.wicell.org#tbl1]). The presence of BSA in the buffer increases viscosity and, hence, tip retention during pipetting, so consider adding 10–15 μL of excess per sample. Prepare all the required mixes for both samples and controls.\ntable:files/protocols_protocol_567_3.csv\naIn protocol B, antibodies to detect O4 and CD24 have been substituted because the signal from AF405 and PerCEP-Cy5.5 fluorochromes is greatly quenched as a result of fixation. Instead, the combination of biotinylated anti-O4 with BV421-Streptavidin and BB700-conjugated anti-CD24 provides a strong fixative-resistant signal using the same laser/filter cytometer configuration.\nMix thoroughly but avoid foam formation.",
    "Once the sample is centrifuged, aspirate supernatant until 0.5–1 mL is left in the tube.\nWait approximately 1 min to let the remaining liquid over the tube wall to slide down.\nCarefully remove all the remaining buffer without disturbing the pellet.\nAdd 100 μL of antibody mix and resuspend the pellet by gently pipetting up and down. Make sure to bring back all cells to suspension, but avoid making bubbles.\nIncubate for 30 min on ice and in darkness.\nAdd 2 mL of FACS buffer.\nCentrifuge at 300 × g, 10 min.\nRemove supernatant as in steps 25–27.\nIf performing Protocol A, resuspend the pelleted cells in 0.5 mL of FACS buffer and proceed to analysis (steps 46–49). In the case of Protocol B, the sample requires fixation and Click-iT reaction for EdU visualization (steps 34–45) before the analysis.\nSample fixation and EdU click-it reaction (only in protocol B)\nTiming: 90 min\nCarefully vortex the pellet from step 32 to avoid aggregates during fixation.\nAdd 100 μL of CytoFix/CytoPerm and resuspend cells in the fume hood.\nIncubate 20 min at 4°C in darkness.\nAdd 2 mL of FACS buffer.\nCentrifuge at 300 × g, 10 min.\nPause Point: At this point, supernatant can be removed and fixed cells can be resuspended in FACS buffer and stored at 4°C in darkness for several days if analysis is not performed immediately.\nPrepare the Click-iT reaction buffer following manufacturer instructions: Click-iTTM Plus EdU Alexa FluorTM 647 Flow Cytometry Assay Kit.\nNote: Check the provider protocol for further information: https://assets.thermofisher.com/TFS-Assets/LSG/manuals/mp10637.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/mp10637.pdf]\nOnce centrifuged, remove supernatant as in steps 25–27. It is critical to dry all pellets similarly.\nAdd 100 μL of Click-iTTM reaction buffer, resuspend cells, and incubate for 30 min at 18°C–22°C and in darkness.\nAdd 2 mL of FACS buffer.",
    "Centrifuge at 300 × g for 10 min.\nRemove supernatant as in steps 25–27.\nResuspend in 0.5 mL of FACS buffer and proceed to analysis.\nCytometry analysis\nTiming: 5 min/sample (depending on the flow speed)\nThis procedure stratifies the cell suspension obtained from the SEZ tissue into the following populations, according to the expression of the selected markers as indicated in Figure 2[href=https://www.wicell.org#fig2]A. Lin+ cells include CD45+ microglia and circulating leukocytes, CD31+ endothelial cells, Ter119+ erythrocytes, and O4+ oligodendrocytes, usually non-relevant to the analysis of the neurogenic lineage. Once Lin+ excluded, Lin‒ cells can be stratified into: (1) neuroblasts (NBs: GLAST‒/CD24high) that are further separated into: NB1 (EGFR+) and NB2 (EGFR‒/low); (2) neural progenitor cells (NPCs) comprised of two different subpopulations: NPC1 (GLAST‒/CD24‒/low) and NPC2 (GLAST+/CD24high), both EGFR+; (3) non-neurogenic astrocytes (GLAST+/CD24‒/low/CD9low), and (4) neural stem cells (NSCs: GLAST+/CD24‒/low/CD9high) which are further divided into quiescent (qNSCs: GLASThigh/EGFR‒/low), primed (pNSCs: GLASTlow/EGFR‒/low) and activated (aNSCs: GLASTlow/EGFR+).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/567-Fig2.jpg\nFigure 2. Comprehensive classification of subependymal cells\n(A) Defined flow cytometry panel with the specific combination of markers used to identify the different SEZ populations.\n(B) Initial steps to select Lin– cells after excluding cell aggregates and discarding CD45/O4/CD31/Ter119-positive and dead cells.\n(C) Representative FACS plot showing GLAST and CD24 staining levels in the Lin– fraction and segregation of the cells into four categories.\n(D) Based on the expression of the activation marker EGFR, the GLAST–CD24–/low region defines EGFR+ NPC1 (left), the GLAST+CD24high fraction corresponds to EGFR+ NPC2 (center) and the GLAST–CD24high region contains EGFR+ NB1 and EGFR– NB2 (right).\n(E) Among the GLAST+CD24–/low fraction, CD9high levels distinguish between GLAST+ NSCs from non-neurogenic GLAST+ astrocytes. CD9 plot for cortex astrocytes is adapted from Belenguer et al., 2021[href=https://www.wicell.org#bib3].\n(F) GLAST and EGFR levels define three NSC populations: qNSC (GLASThighEGFR–/low), pNSC (GLASTlowEGFR–/low) and aNSC (GLASTlowEGFR+).",
    "(G) Estimated number of cells for each SEZ population considering an approximate total viable cell yield of 100,000 cells per brain.\n(H and I) Representative FACS plots showing EdU staining in the Lin– fraction following two different pulse and chase regimes described in Belenguer et al., 2021[href=https://www.wicell.org#bib3]: 1 shot of EdU followed by 1 h chase (H) and 7 injections of EdU (q2 h: one every 2 h) followed by a 12 h chase (I). aNSC and NB2 populations are included as examples for these two regimes.\nNote: There is a small percentage of cells (around 3% of all SEZ cells) that appear negative for all the considered markers. RNA-seq profile of this population (“other”, see Belenguer et al., 2021[href=https://www.wicell.org#bib3]) reveals that it most probably contains a heterogeneous mixture of different cell types: either unidentified cells that do not express the selected population-defining surface markers or low-expressing cells that fall under the positive threshold as a consequence of their antigens being affected by the enzymatic digestion.\nNote: The whole set of appropriate controls for each of the fluorophores (single-stained and FMO) should be included for the setting up of this strategy.\nMix the sample thoroughly and filter it through a 40 μm strainer.\nAdd DAPI (4′, 6-diamidino-2′-phenylindole, dihydrochloride; 0.1 μg/mL) and mix briefly (only in Protocol A) for dead cell exclusion.\nLoad the sample on the cytometer.\nStratify the populations as described in the following gating strategy:\nGate a region that excludes debris and most of the dead cells and erythrocytes on a SSC-A vs. FSC-A dot plot. Label the selected population as ‘SEZ cells’ (Figure 2[href=https://www.wicell.org#fig2]B).\nGate on singlets using SCC-H and SCC-A (Figure 2[href=https://www.wicell.org#fig2]B).\nDiscard dead cells by gating DAPI-negative cells (Figure 2[href=https://www.wicell.org#fig2]B). This will define the ‘live cells’ population (only in Protocol A).",
    "To set the Lin‒ population (Ter119‒, O4‒, CD31‒, and CD45‒), gate AF405 and BV421-negative cells (Figure 2[href=https://www.wicell.org#fig2]B).\nDivide Lin‒ cells into four quadrants according to GLAST and CD24 expression (Figure 2[href=https://www.wicell.org#fig2]C).\nSeparate cells according to EGF binding (AF488) in the GLAST‒/CD24‒/low to obtain NPC1, in the GLAST+/CD24high quadrant to obtain NPC2, and in the GLAST‒ /CD24high quadrant to obtain EGFR+ NB1 and EGFR‒ NB2 (Figure 2[href=https://www.wicell.org#fig2]D).\nFrom the GLAST+/CD24‒/low population, gate CD9high cells to separate NSCs from non-neurogenic astrocytes (Figure 2[href=https://www.wicell.org#fig2]E).\nGate on three distinct populations of NSCs on the basis of GLAST levels and EGF binding (Figures 2[href=https://www.wicell.org#fig2]A and 2F).\nOptional: (only for Protocol A) If your final purpose is to purify specific populations by FACS, perform the analysis (steps 48 and 49) in a properly equipped cell sorter (see key resource table[href=https://www.wicell.org#key-resources-table]) and adapt the sorting protocol according to your subsequent analysis (e.g., sort cells directly on the appropriate culture medium for in vitro analysis or on lysis buffer for RNA or protein extraction).\nOptional: (only for Protocol B) To determine the EdU labeling index in each population, gate positive cells (AF647) according to an adequate FMO control from non-injected mice. This control sample must have been fixated and treated as the other samples (steps 34–45).\nTo obtain the percentage of each population relative to all ‘live cells’, make sure that you reverse calculate the percentage of the percentage for each of the gates that were required to define each population, until you get to the ‘live cells’ gate (Protocol A). When working with fixed cells (Protocol B), percentages can only be calculated relative to Lin- cells."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Flow Cytometry",
    "Cell Biology",
    "Neuroscience",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}