{
  "id": 2387,
  "origin_website": "Cell",
  "title": "Experimental and computational workflow for the analysis of tRNA pools from eukaryotic cells by mim-tRNAseq",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTotal RNA isolation under mild acidic conditions\nTiming: 2–3 h\nThis section describes total RNA isolation from cultured mammalian cells under conditions that preserve tRNA charging.\nCritical: Working at low pH and maintaining samples at <4°C is essential for preserving tRNA charging. Avoid processing more than 8 samples at a time to decrease handling time.\nAlternatives: If quantitation of tRNA charging is not of interest for the research question, total RNA can be extracted with the standard TRIzol protocol or other protocols or commercial kits that efficiently recover RNAs of <200 nt in length. In this case, proceed directly to step 46.\nNote: RNA yield varies substantially depending on sample source, organism and cell type, and growth conditions. Commonly used human cell lines typically yield 15–30 μg of total RNA per 1 × 106 cultured human cells with TRIzol-based protocols.\nNote: In our hands, RNA isolation with column-based commercial kits can lead to significant sample loss and poor recovery of small RNAs. We recommend avoiding the use of such kits, particularly when starting with low cell numbers.\nCarefully aspirate all culture medium.\nAdd 1 mL of TRIzol Reagent per 1 × 105–1 × 107 cells directly to the culture dish.\nPipet the lysate up and down several times to homogenize and transfer to a 1.5 mL microfuge tube.\nSnap-freeze samples on dry ice or in liquid nitrogen.\nPause point: Samples can be stored at −80°C for several months.\nThaw samples at room temperature (20°C–26°C).\nIncubate at room temperature for 5 min to dissociate nucleoprotein complexes.\nAdd 0.2 mL of 1-bromo-3-chloropropane (BCP) per 1 mL of TRIzol Reagent used for lysis, then securely cap the tube.\nVortex briefly and incubate for 2 min at room temperature (20°C–26°C).",
    "Centrifuge the sample for 15 min at 12,000 × g at 4°C in a pre-chilled centrifuge.\nPlace tubes on ice. Transfer the aqueous phase containing the RNA to a new 1.5 mL microfuge tube.\nAdd 0.5 mL of BCP per 1 mL of TRIzol Reagent used for lysis, then securely cap the tube. Vortex briefly.\nCentrifuge the sample for 5 min at 12,000 × g at 4°C.\nPlace samples on ice. Transfer the aqueous phase containing the RNA to a new 2 mL microfuge tube.\nPrecipitate RNA by adding the following amounts per 1 mL of TRIzol Reagent used for lysis:\n25 μg glycogen.\n100 μL 3 M sodium acetate (pH=4.5).\n1.25 mL of ice-cold 100% ethanol.\nVortex well and incubate at −20°C for at least 30 min.\nPause point: Samples can be stored at −20°C indefinitely.\nCritical: The use of ethanol instead of isopropanol for RNA precipitation improves the recovery of RNAs <200 nt in length.\nCentrifuge for 20 min at 12,000 × g at 4°C.\nCarefully remove the supernatant with a 1-mL pipette tip.\nAdd 1 mL of ice-cold 80% ethanol containing 50 mM sodium acetate, pH=4.5.\nVortex the sample briefly, then centrifuge for 5 min at 7,500 × g at 4°C.\nCarefully remove the supernatant with a 1-mL pipette tip.\nBriefly spin down and remove all remaining liquid with a 10-μL pipette tip.\nAir-dry the pellet for 2–3 min.\nResuspend in 30 μL 50 mM sodium acetate (pH=4.5), 1 mM EDTA per 1 mL of TRIzol Reagent used for lysis.\nMeasure RNA concentration on a NanoDrop or an equivalent UV spectrophotometer.\nPause point: Aliquot and store at −80°C for up to six months. Avoid repeated freeze-thaw cycles.",
    "Note: We recommend assessing the integrity of the extracted total RNA on a TapeStation system or by electrophoresis on a 10% denaturing polyacrylamide gel (steps 56–65). The tRNA cluster should be clearly visible at 60–100 nt and there shouldn’t be any smearing that is indicative of RNA degradation.\nPeriodate oxidation and β-elimination\nTiming: 4–6 h\nThe 3′ ends of tRNAs that carry an amino acid are protected from periodate oxidation. When followed by β-elimination, this treatment leads to the removal of the 3′ nucleotide in uncharged tRNAs. The proportion of transcripts that end with 3′-CCA versus those that end with 3′-CC after periodate oxidation and β-elimination can thus be used to quantify the fraction of aminoacylated tRNA molecules (Dittmar et al., 2005[href=https://www.wicell.org#bib8]; Evans et al., 2017[href=https://www.wicell.org#bib10]).\nCritical: This part of the protocol requires total RNA isolated under mild acidic conditions as input.\nNote: The starting concentration of RNA in the oxidation reaction should be 0.25–1 μg/μL.\nAssemble the oxidation reaction in 1.5-mL microfuge tubes.\ntable:files/protocols_protocol_1874_8.csv\nIncubate for 30 min at 22°C in a Thermoblock.\nNote: During the incubation time, prepare one Micro Bio Spin-30 column per sample according to the manufacturer’s protocol.\nStop reaction by adding 2.4 μL 1 M glucose. Incubate for 5 min at 22°C in a Thermoblock.\nClean up reactions with Micro Bio Spin-30 columns according to the manufacturer’s protocol. The recovered volume will be ∼25 μL.\nTo each tube, add:\n65 μL RNase-free water.\n10 μL 3 M sodium acetate (pH=4.5).\n25 μg glycogen.\n300 μL ice-cold 100% ethanol.\nVortex well and incubate at −20°C for at least 30 min.\nPause point: Samples can be stored at −20°C indefinitely.\nPrecipitate RNA by centrifuging for 30 min at 16,000 × g at 4°C.",
    "Carefully remove the supernatant with a 1-mL filter pipette tip. Briefly spin down and remove all residual liquid with a 10-μL filter pipette tip.\nResuspend pellets in 20 μL RNase-free water.\nTo perform β-elimination, mix the RNA with 30 μL freshly prepared 100 mM sodium tetraborate (pH=9.5).\nIncubate at 45°C for 90 min in a Thermoblock.\nNote: During the incubation time, prepare one Micro Bio Spin-30 column per sample according to the manufacturer’s protocol.\nClean up reactions with Micro Bio Spin-30 columns according to the manufacturer’s protocol. The recovered volume will be ∼50 μL.\nTo each tube, add:\n35 μL RNase-free water.\n10 μL 3 M sodium acetate (pH=4.5).\n25 μg glycogen.\n300 μL ice-cold 100% ethanol.\nVortex well and incubate at −20°C for at least 30 min.\nPause point: Samples can be stored at −20°C indefinitely.\nPrecipitate RNA by centrifuging for 30 min at 16,000 × g at 4°C.\nCarefully remove the supernatant with a 1-mL filter pipette tip. Briefly spin down and remove all residual liquid with a 10-μL filter pipette tip.\nAir-dry pellet for 2–3 min.\nResuspend pellets in 15 μL RNase-free water.\nMeasure RNA concentration on a NanoDrop or an equivalent spectrophotometer.\nCritical: The column purification and RNA precipitation steps are necessary to prevent carry-over of sodium periodate and sodium tetraborate. These reagents can inhibit the enzymatic removal of the RNA 3′ phosphate resulting from β-elimination with T4 polynucleotide kinase (PNK) in steps 49–56. This will lead to an underrepresentation of reads from uncharged tRNA in the final sequencing library and thus an overestimation of charged tRNA fractions.\nSpike-in addition and tRNA deacylation\nTiming: 1 h",
    "The spike-in RNA added in this step is intended to be used as an internal control for 3′-CCA quantitation. This is achieved by adding two synthetic tRNAs that differ by a single nucleotide at the 3′ end (E.coli tRNA-Lys-UUU-CCA and tRNA-Lys-UUU-CC; for sequences, see Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1874-Mmc1.xlsx]) in a 3:1 ratio to total RNA.\nAlternatives: Spike-in addition can be omitted if measurements of charging fractions are not performed.\nNote: Following library construction and analysis by mimseq, the relative quantities of each spike-in RNA can be checked in the CCA plots to ensure the expected 3:1 ratio is recovered.\nNote: We have successfully constructed tRNA sequencing libraries starting with 0.5 μg of total RNA. If input amounts are not limiting, we recommend starting with 2.5–5 μg of total RNA.\nDilute 2.5 μg total RNA in 18 μL RNase-free water in a 1.5-mL tube.\nAdd 0.75 μL of synthetic E.coli tRNA-Lys-UUU-CCA (7.5 ng/μL) and 0.75 μL of synthetic E.coli tRNA-Lys-UUU-CC (2.5 ng/μL).\nNote: If starting with RNA that has been subjected to periodate oxidation and β-elimination, the next step is not necessary; proceed directly to step 49.\nAdd 1.5 μL of 1 M Tris-HCl (pH=9.0) and 0.5 μL SUPERase·In.\nMix and incubate at 37°C for 45 min to deacylate tRNA.\nProceed to step 49.\nNote: This step ensures the presence of a free 3′ OH group in tRNAs, which is a prerequisite for efficient ligation of a 3′ adapter in step 50. Although most tRNAs in total RNA samples isolated using standard protocols are likely to be deacylated, the stability of the acyl linkage can vary by an order of magnitude for different aminoacyl-tRNAs (Peacock et al., 2014[href=https://www.wicell.org#bib23]).\nRNA 3′ dephosphorylation\nTiming: 1.5 h\nThis step entails the enzymatic removal of RNA 3′ phosphates resulting from β-elimination.",
    "Note: We also perform this reaction when starting with total RNA that has not been subjected to oxidation and β-elimination. This serves to ensure that tRNAs with 3′ ends cleaved during stress (Czech et al., 2013[href=https://www.wicell.org#bib7]) or as a result of ribosome-associated quality control (Yip et al., 2020[href=https://www.wicell.org#bib31]) are also represented in sequencing libraries.\nAssemble the following reaction in a 1.5-mL microfuge tube:\ntable:files/protocols_protocol_1874_9.csv\nIncubate at 37°C for 45 min.\nTo each tube, add:\n10 μL 3 M sodium acetate (pH=4.5).\n25 μg glycogen.\n300 μL ice-cold 100% ethanol.\nVortex well and incubate at −20°C for at least 30 min.\nPause point: Samples can be stored at −20°C indefinitely.\nPrecipitate RNA by centrifuging for 30 min at 16,000 × g at 4°C.\nCarefully remove the supernatant with a 1-mL filter pipette tip. Briefly spin down and remove all residual liquid with a 10-μL filter pipette tip.\nResuspend pellets in 5 μL RNase-free water.\nAdd 5 μL 2 × RNA loading buffer without dyes.\nCritical: Commonly used dyes such as xylene cyanol or bromophenol blue can co-migrate with RNA or DNA fragments of interest. Their co-purification with nucleic acids after gel extraction may interfere with downstream enzymatic reactions. Therefore, we recommend that these dyes be present only in the loading buffer added to marker samples or in empty wells.\nPurification of tRNA from total RNA by gel size selection\nTiming: 30 min–1 h",
    "Transfer RNAs are 70–90 nt in length and run as a discrete cluster on denaturing 10% polyacrylamide gels. Gel size selection of 60–100 nt RNAs is a cost-effective approach to purify mature, intact tRNAs from total RNA preparations and to separate them from other highly abundant short RNAs with a similar size (e.g., 5S rRNA, 5.8S rRNA, snRNAs) or potential tRNA fragments and degradation intermediates, which would co-elute in small RNA fractions obtained by column-based commercial kits.\nNote: The presence of RNA transcripts with substantially fewer RT-blocking modifications that tRNAs may result in their preferential use as templates for cDNA synthesis in steps 102–107.\nBriefly soak glass plates in 1% SDS and rinse with RNase-free water.\nCast a 10% denaturing polyacrylamide gel and let it polymerize for 30 min to 1 h.\nPlace gel in an appropriate tank and pre-run at 20 mA in 1 × TBE for at least 30 min.\nNote: Pre-running is critical for heating up urea-containing polyacrylamide gels, which aids RNA denaturation, and for removing excess urea from the wells, which can otherwise lead to band distortion.\nPrepare gel size marker by mixing 1 μL NEB Low Range ssRNA ladder with 4 μL RNase-free water and 5 μL 2 × RNA loading buffer supplemented with xylene cyanol (0.005%) and bromophenol blue (0.01%).\nDenature ladder and samples from step 30 at 90°C for 3 min and place immediately on ice.\nTurn off the gel tank power supply.\nRinse gel wells to remove excess urea immediately before loading.\nLoad ladder and samples on gel and run at 20 mA until the bromophenol blue from the marker sample reaches the bottom of the gel.\nPlace gel in an RNAse-free container with SYBR Gold (1:10 000) in 1× TBE for 3 min on a platform shaker.",
    "Note: Longer staining periods do not improve signal substantially and may result in fuzzy bands and sample loss.\nPlace gel on a clean foil on top of a blue light transilluminator to visualize RNA (for an example, see Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1874-Fig2.jpg\nFigure 2. Typical gel images of key steps during mim-tRNAseq library construction\nGel regions to be excised are indicated by a red bracket.\n(A) Total RNA after step 66.\n(B) Adapter-ligated tRNA after step 92.\n(C) cDNA after successful reverse transcription in steps 105–113.\n(D) Library DNA after step 135.\n(E) cDNA after suboptimal reverse transcription in steps 105–113.\nCritical: Visualization of total RNA on a denaturing gel is a useful indicator of RNA quality. Transfer RNAs, 5S rRNA, and 5.8S rRNA should be visible as discrete bands. Band smearing is indicative of RNA degradation, which can occur during sample collection and/or RNA isolation.\nUse a clean scalpel blade to cut out the gel region corresponding to tRNA (∼60–100 nt).\nPlace the gel fragment in a 1.5-mL microfuge tube.\nElute RNA from gel slice (steps 70–83, resuspend the pellet in 8 μL RNAse-free water).\nElution of RNA from gel slices\nTiming: 30 min–overnight\nInefficient recovery of RNA from gel slices is a major source of sample loss in sequencing library construction workflows that require gel size selection. We optimized this step to increase the yield of eluted RNA from ∼20% in the classical “crush and soak” method (Green and Sambrook, 2019[href=https://www.wicell.org#bib11]) to ∼70%–80%.\nCrush gel slice with a disposable 1.5-mL tube pestle.\nAdd 400 μL RNA gel extraction buffer.\nIncubate tubes at 65°C for 10 min and 2000 rpm in a Thermoblock.\nAlternatives: Gel slurry can also be incubated at 65°C in a water bath. In this case, mix slurry by inverting tubes several times every 2–3 min.",
    "Snap-freeze gel slurry on dry ice or in liquid nitrogen.\nThaw gel slurry at 65°C for 5 min and 2000 rpm in a Thermoblock.\nElute RNA overnight at room temperature with gentle mixing on a rotating wheel.\nCritical: Omitting the freeze-thaw cycle substantially decreases RNA elution efficiency.\nAlternatives: An incubation time of ∼2 h at room temperature in the final step is sufficient to achieve an elution efficiency of 40%–50%.\nRemove gel pieces by centrifuging slurry through a SpinX filter at 10,000 × g for 30 s.\nTransfer flow-through to a new 1.5-mL microfuge tube.\nAdd 25 μg glycogen and 1 mL ice-cold 100% ethanol.\nVortex well and incubate for at least 30 min at −20°C.\nPause point: Samples can be stored at −20°C indefinitely.\nPrecipitate RNA by centrifuging for 30 min at 16,000 × g at 4°C.\nCarefully remove the supernatant with a 1-mL filter pipette tip. Spin down briefly and remove all residual liquid with a 10-μL tip.\nAir-dry pellets for 2–3 min and resuspend in the indicated volume of RNase-free water.\nMeasure RNA concentration on a Nanodrop or an equivalent spectrophotometer.\nPause point: Samples can be stored at −80°C for several months.\nAdapter ligation to tRNA 3′ ends\nTiming: 4 h\nThis step adds a barcoded 3′ adapter oligonucleotide (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1874-Mmc1.xlsx]) to tRNAs to serve as a priming site for cDNA synthesis by TGIRT.\nCritical: Select a distinct barcoded adapter (I1 to I8) for each sample that will be pooled prior to reverse transcription.\nCritical: Use block design (Auer and Doerge, 2010[href=https://www.wicell.org#bib1]) to minimize the potential for differences between samples to be confounded by technical variation. For example, do not pool all replicates of a control condition in RT reaction 1 and all replicates of a treatment condition in RT reaction 2.",
    "Assemble the 3′ adapter ligation reaction.\ntable:files/protocols_protocol_1874_10.csv\nCritical: The 50% PEG-8000 stock solution is very viscous, which impacts pipetting accuracy. Inaccurate pipetting can decrease 3′ adapter ligation efficiency, which strongly depends on the concentration of PEG-8000 (Heyer et al., 2015[href=https://www.wicell.org#bib15]). For best results, equilibrate the 50% PEG-8000 stock solution at room temperature and pipet slowly and/or or use wide bore pipette tips. PEG-8000 should be added to each reaction tube separately rather than being included in a master mix.\nMix each reaction by carefully pipetting the entire volume up and down several times.\nIncubate at 25°C for 3 h.\nPool reactions from samples with different barcodes and purify adapter-ligated tRNA with Zymo Oligo Clean & Concentrator kit according to the manufacturer’s protocol.\nElute in 10 μL RNase-free water.\nAdd 10 μL 2 × RNA loading buffer without dyes.\nPrepare a 10% denaturing polyacrylamide gel and a ladder sample as in steps 57–60.\nDenature ladder and samples from step 88 at 90°C for 3 min and place immediately on ice.\nSeparate ligation products from excess adapter by running samples on the gel as in steps 62–65.\nCut out bands corresponding to adapter-ligated tRNA (∼110–125 nt, for example see Figure 2[href=https://www.wicell.org#fig2]B) and put each gel fragment in a clean, low-biding RNase-free tube.\nRecover adapter-ligated tRNA from gel slices as in steps 70–83.\nCritical: Reverse transcription by TGIRT is inhibited by trace amounts of ethanol. Ensure that all liquid is removed after precipitating adapter-ligated tRNA.\nResuspend pellets in 2.5 μL RNase-free water per sample pooled in step 87.\nMeasure RNA concentration on a Nanodrop or an equivalent spectrophotometer.\nPause point: Samples can be stored at −80°C for several months.",
    "Alternatives: The gel purification step to remove excess 3′ adapter (steps 92–94) can be replaced by 5′-deadenylase treatment followed by digestion of the unligated adapter with the 5′–3′ ssDNA exonuclease RecJ (McGlincy and Ingolia, 2017[href=https://www.wicell.org#bib20]). This alternative substantially increases the cost of library construction and is very inefficient in our hands.\nPrimer-dependent reverse transcription of tRNA pools with TGIRT\nTiming: 30 min–overnight\nIn this step, adapter-ligated tRNA pools are used as templates for primer-dependent cDNA synthesis by TGIRT, an engineered version of a bacterial group II intron-encoded reverse transcriptase (Mohr et al., 2013[href=https://www.wicell.org#bib21]; Qin et al., 2015[href=https://www.wicell.org#bib24]), under reaction conditions that we optimized to favor tRNA modification readthrough.\nCritical: TGIRT cannot be substituted with commercially available reverse transcriptases of retroviral origin (e.g., ProtoScript II, SuperScript IV) since these enzymes have a much lower readthrough efficiency of modified sites in tRNAs.\nAlternatives: Other group II intron- or retroelement-encoded enzymes such as MarathonRT (Zhao et al., 2018[href=https://www.wicell.org#bib32]) and an engineered version of the B. mori R2 retroelement reverse transcriptase (Upton et al., 2021[href=https://www.wicell.org#bib28]) have also been reported to efficiently read through RNA modifications (Guo et al., 2020[href=https://www.wicell.org#bib13]; Gustafsson et al., 2022[href=https://www.wicell.org#bib14]). These enzymes are not commercially available at this time, and protocols for their use may need to be further optimized for tRNA templates.\nPrepare 100 mM DTT fresh from powder (0.0154 g/mL in RNase-free water).\nPre-warm a Thermocycler block at 82°C.\nAssemble the primer hybridization reaction in a low-binding PCR tube:\ntable:files/protocols_protocol_1874_11.csv",
    "Note: Including a control reaction with only unligated 3′ adapter as a template can be useful to gauge RT efficiency, as the RT primer binds to the last 15 nucleotides of the 34 nt-long adapters. The product of this control reaction can be used as a marker during the size selection of cDNA products on the gel in step 113.\nDenature at 82°C for 2 min and incubate at room temperature for 5 min.\nIn the meantime, pre-warm a Thermocycler block at 42°C (with lid temperature at 48°C).\nAssemble the RT reaction by mixing the adapter-ligated tRNA:RT primer duplexes with the following components:\ntable:files/protocols_protocol_1874_12.csv\nMix each reaction by pipetting the entire volume up and down several times.\nIncubate at 42°C for 10 min in a Thermocycler.\nAdd 1 μL 25 mM dNTPs to each tube.\nMix each reaction by pipetting the entire volume up and down several times.\nIncubate at 42°C for 16 h in Thermocycler.\nCritical: Incubation times as short as 1 h can yield a substantial proportion of full-length cDNA products from tRNA pools with lower modification frequency and complexity, e.g., from budding or fission yeast. An extended reaction time, however, is particularly important for the efficient recovery of cDNA from tRNAs with multiple RT-blocking modifications, which is characteristic of many human tRNAs. The integrity of tRNA templates is not compromised under these reaction conditions (Behrens et al., 2021[href=https://www.wicell.org#bib2]).\nCritical: Efficient cDNA synthesis from endogenously modified tRNA requires a molar excess of TGIRT, so we highly recommend adhering to the template:TGIRT molar ratios described here.\nCritical: TGIRT is inhibited by trace amounts of ethanol. Ensure that all residual liquid is removed after precipitation of adapter-ligated tRNA in step 94.\nPre-warm a Thermocycler block at 95°C.\nAdd 1 μL 5 M NaOH to each reverse transcription reaction.",
    "Incubate at 95°C for 3 min to hydrolyze the RNA template.\nAdd 20 μL 2 × RNA loading buffer to each reaction.\nDenature cDNA at 95°C for 5 min and place samples immediately on ice.\nSeparate cDNA from unextended RT primer by running reactions alongside NEB Low Range ssRNA ladder (and optionally the 3′ adapter-only control reaction) on a 10% denaturing gel as in steps 57–65.\nExcise the entire gel region above the unextended RT primer (or adapter-only RT product), which will correspond to all cDNA lengths derived from tRNA reverse transcription (for an example, see Figure 2[href=https://www.wicell.org#fig2]C).\nPut each gel fragment in a new 1.5 mL microfuge tube.\nCrush gel slice with a disposable plastic pestle.\nAdd 400 μL 10 mM TE, pH=8.0, and snap-freeze gel slurry on dry ice or in liquid nitrogen.\nIncubate gel slurry for 1 h at 70°C/2000 rpm in a Thermoblock to elute cDNA.\nCritical: Omitting the freeze-thaw cycle substantially decreases cDNA elution efficiency.\nRemove gel pieces by centrifuging slurry through a SpinX filter at 10,000 × g for 30 s.\nTransfer flow-through to a new 1.5-mL microfuge tube.\nAdd 25 μg glycogen, 40 μL 3 M NaCl, and 1 mL ice-cold 100% ethanol.\nVortex well and incubate for 30 min on ice.\nPause point: Samples can be stored at −20°C indefinitely.\nPellet DNA by centrifuging for 30 min at 4°C and 16,000 × g.\nCarefully remove the supernatant with a 1-mL pipette tip. Briefly spin down and remove all remaining liquid with a 10-μL pipette tip.\nResuspend pellets in 5.5 μL water and proceed with cDNA circularization.\nPause point: Samples can be stored at −20°C for several weeks.\nCircularization of cDNA\nIn this step, cDNA is circularized with CircLigase to provide a template for library construction by PCR.",
    "Pre-warm a Thermocycler block at 60°C (lid temperature of 65°C).\nAssemble cDNA circularization reaction in a low-binding PCR tube:\ntable:files/protocols_protocol_1874_13.csv\nMix each reaction well by pipetting up and down.\nIncubate at 60°C for 3 h in a Thermoblock.\nIncubate at 80°C for 10 min to inactivate the enzyme.\nPause point: Circularized cDNA can be stored at −20°C for several weeks.\nCritical: We do not recommend using CircLigase II as it has much lower ssDNA circularization efficiency in comparable library construction protocols (Heyer et al., 2015[href=https://www.wicell.org#bib15]).\nNote: Under the reaction conditions in step 102, TGIRT adds one to three non-templated adenosines to the 3′ ends of most cDNAs (Behrens et al., 2021[href=https://www.wicell.org#bib2]), resulting in a nearly identical 5ʹ – 3′ circularization sequence context.\nLibrary construction PCR\nTiming: 30 min–1 h\nThe circularized single-stranded cDNA is used as a template for the construction of a double-stranded DNA library with an appropriate structure for sequencing on Illumina platforms.\nCritical: Use reverse library PCR primers with distinct 6-nt indexes to amplify different libraries that will be sequenced on the same flow cell.\nSet up a 50-μL PCR reaction to construct libraries from circularized cDNA.\ntable:files/protocols_protocol_1874_14.csv\nCritical: The use of other DNA polymerases or buffers can result in the preferential amplification of cDNAs with a shorter length or lower GC content (Quail et al., 2011[href=https://www.wicell.org#bib25]), which introduces bias in tRNA abundance measurements.\nNote: Circularized cDNA does not need to be purified prior to PCR amplification if its volume does not exceed 10% of the final PCR reaction volume.\nAmplify for 4–6 cycles at a ramp rate of 3°C/second with the following settings:\ntable:files/protocols_protocol_1874_15.csv",
    "Note: When performing RT of adapter-ligated tRNA and cDNA circularization according to steps 97–130, we find that 4–5 PCR cycles are sufficient to obtain DNA libraries of 2–5 nM, which is within the optimal concentration range for Illumina sequencing platforms. If more than 6 PCR cycles are necessary to achieve this yield, we recommend increasing the starting amount of circularized cDNA template in the PCR reaction or optimizing the reverse transcription reaction (see problem 1[href=https://www.wicell.org#sec7.1]). Performing further PCR amplification will exacerbate bias as small differences in amplification efficiency of DNAs with different length and GC content will accumulate over multiple PCR cycles (Quail et al., 2011[href=https://www.wicell.org#bib25]; van Dijk et al., 2014[href=https://www.wicell.org#bib29]).\nPurify PCR products with Zymo DNA Clean & Concentrator kit according to the manufacturer’s instructions.\nElute in 12 μL 10 mM Tris-HCl, pH=8.0.\nUse 2 μL to measure DNA concentration with the Qubit dsDNA HS kit.\nNote: The DNA concentration of samples is too low to be accurately quantified by UV spectrophotometry.\nNote: This step efficiently separates the double-stranded DNA libraries (210–225 bp) from PCR buffer components, excess dNTPs, and unused PCR primers (which are ∼50 nucleotides and therefore below the retention cutoff). Primer removal will be less efficient if longer oligonucleotides are used for PCR. In this case, libraries should be purified by size selection on a non-denaturing polyacrylamide gel (McGlincy and Ingolia, 2017[href=https://www.wicell.org#bib20]). Prior to electrophoresis, we recommend that DNA clean-up is performed as in step 133 since the presence of the KAPA HiFi GC buffer causes band distortion. For an example of a typical gel image of a DNA library, see Figure 2[href=https://www.wicell.org#fig2]D.\nPause point: Purified DNA can be stored in low-binding tubes at −20°C indefinitely.\nAssess DNA size and purity by non-denaturing polyacrylamide gel electrophoresis on an 8% non-denatring polyacrylamide gel.",
    "Alternatives: Library size can be analyzed on a High Sensitivity D1000 ScreenTape on an Agilent 2200 TapeStation Nucleic Acid System.\nCritical: If purifying libraries by gel size selection, we recommend cutting out fragments of ∼150 bp to ∼230 bp in length. This will ensure the inclusion of fragments resulting from premature termination of cDNA synthesis at (hyper)modified sites. These fragments may not be visible as discrete bands after SYBR Gold staining of RT or library PCR samples (Figures 2[href=https://www.wicell.org#fig2]C and 2D) since they originate from the very few remaining RT roadblocks in a small subset of tRNA transcripts (e.g., ms2t6A37 in human tRNA-Lys-UUU). Failure to include these fragments in the sequencing run, however, will lead to underestimating the abundance of the tRNAs that give rise to them.\nLibrary sequencing on Illumina platforms\nThe libraries generated with this protocol should be sequenced on an Illumina platform with a single-end run of >=100 bp. The minimal sequencing read length can be determined by adding 12 nt to the longest predicted tRNA transcript in the organism of interest. This accounts for the supplementary sequences added during library construction and required for demultiplexing samples pooled prior to reverse transcription.\nNote: Given the high quality scores of single-end reads with a length of 100–150 nucleotides on current Illumina platforms, paired-end sequencing is not required for the analysis of tRNA-derived libraries.\nPool and dilute sequencing libraries according to the requirements of your preferred Illumina sequencing provider.\nNote: The common range of starting library concentration prior to cluster generation on Illumina sequencing platforms is 1 nM–4 nM.\nNote: For NextSeq 550, the loading concentration of tRNA libraries to achieve an optimal cluster density (∼220 k/mm2) is 2 pM.",
    "Note: Most organisms encode only a few hundred tRNA transcripts and the libraries generated with this protocol consist almost exclusively of tRNA-derived reads. We, therefore, find that a sequencing depth of 3–5 million reads per sample is sufficient for most analyses. This should be scaled by the number of individual samples pooled prior to reverse transcription, i.e., 40 million reads for a library that contains eight samples, each with a unique barcoded 3′ adapter.\nDemultiplexing and adapter trimming of sequencing reads\nTiming: 30 min–1 h\nUsing fastq files as an input, library demultiplexing and trimming extra sequences at the 3′ and 5′ added during library construction is performed with cutadapt v3.5 (or newer).\nPrepare a file of barcodes for demultiplexing.\nNote: barcodes.fa should be a fasta-formatted file with one user-selected header and sequence per barcoded adapter used in library construction. To ensure an efficient match to sequences in reads, we extend the sequence to 10nt (instead of only the 5nt barcode sequence itself). Therefore, each sequence in the file contains the common 5′-GAT sequence + unique barcode + CA-3ʹ. Below is an example of barcodes.fa:\n# Example barcodes.fa file for demultiplexing\n>I1\nGATATCGTCA\n>I2\nGATAGCTACA\n>I3\nGATGCATACA\n>I4\nGATTCTAGCA\nNote: The names of the barcodes in barcodes.fa can be chosen freely and will be present in the names of the demultiplexed fastq files.\nDemultiplex fastq files with the following command:\n# Demultiplex each sample fastq file using barcodes.fa\n> for i in ∗.fastq.gz\n      do fn=$(basename $i .fastq.gz)\n        cutadapt --no-indels -q 30,30 --trimmed-only -j 10 -a file:barcodes.fa -m 10 -o $fn'_{name}_trim.fastq.gz' $i 1> $fn'_log.txt'\n      done",
    "Note: This command uses a for loop to process each fastq file similarly. First, we create a filename variable $fn for more appropriate output file names lacking the file type xlsx and any other uninformative information (the basename command might need to be modified depending on the naming conventions of your files). Cutadapt is then used to quality-trim each read end with a threshold of 30 (-q 30,30) before demultiplexing according to barcodes.fa. Additionally, we discard trimmed reads shorter than 10 nt (-m 10) and prohibit indels in matches to barcode sequence (--no-indels).\nNote: All reads of >= 100 nt should contain an adapter sequence since mature tRNAs are <=90 nts, and so only reads with a detected adapter which have been trimmed are kept (--trimmed-only).\nCritical: Adjust -j to a suitable number of processors for demultiplexing according to your system capabilities.\nNote: An output log.txt file will be produced for each sample processed above (with 1> $fn’_log.txt’). We highly recommend assessing these files for trimming efficiency. Typically, the vast majority of reads should contain barcodes and adapters (as described above), and so the “Reads with adapters” value reported in the log should reflect that (i.e., at least 80% of reads containing adapters). Low values may suggest issues in library construction, because of e.g., the presence of no-insert libraries due to low RT efficiency.\nTrim the two additional nucleotides introduced at the 5′ of reads following cDNA circularization.\n# Trim 2× 5ʹ random nucleotides\n> for i in ∗trim∗.fastq.gz\n      do fn=$(basename $i trim.fastq.gz)\n      cutadapt -j 10 -m 10 -u 2 -o $fn'_trimFinal.fastq.gz' $i\n      done",
    "Optional: Demultiplexing and trimming are now complete. However, you may wish to rename the “trimFinal.fastq.gz” files according to the samples they represent. For this, a table of which samples were multiplexed during library preparation, and which barcodes were used for each is useful to track which final trimmed fastq file represents each sample and/or condition.\nPreparing mimseq input files\nTiming: 15 min–days for custom references\nOptional: Building custom references for mimseq.\nmimseq contains pre-generated input files for multiple reference genomes. These are named using the first letter of the genus and the first three of the species. For example, Homo sapiens is given as Hsap. For a complete list of available species, please see the -s/--species section of the mimseq help page (mimseq –help) or the corresponding section in the documentation (https://mim-trnaseq.readthedocs.io/en/latest/start.html#pre-built-references[href=https://mim-trnaseq.readthedocs.io/en/latest/start.html#pre-built-references]). These references also contain the sequence for the synthetic E. coli tRNA-Lys-UUU spike-in that is added in step 45 (http://gtrnadb.ucsc.edu/genomes/bacteria/Esch_coli_K_12_MG1655/genes/tRNA-Lys-TTT-1-1.html[href=http://gtrnadb.ucsc.edu/genomes/bacteria/Esch_coli_K_12_MG1655/genes/tRNA-Lys-TTT-1-1.html]).\nNote: For species without pre-generated references, custom input files can be given. Ideally, the species will have predicted tRNAs on GtRNAdb (http://gtrnadb.ucsc.edu/[href=http://gtrnadb.ucsc.edu/]). This data can be downloaded, and the respective tRNA fasta file and intron information file (.out file) can be specified to mimseq with -t and -o, respectively. If available, mitochondrial and/or plastid tRNA sequences (in the case of plant species) from the mitochondrial tRNA database (mitotRNAdb; http://mttrna.bioinf.uni-leipzig.de/mtDataOutput/[href=http://mttrna.bioinf.uni-leipzig.de/mtDataOutput/]) and PtRNAdb (http://14.139.61.8/PtRNAdb/index.php[href=http://14.139.61.8/PtRNAdb/index.php]) can be given in space-separated format with -m. Plastid sequences, in the case of plant species, can also be specified with -m.\nNote: tRNAScan-SE2.0 (Chan et al., 2021[href=https://www.wicell.org#bib4]) can be used to predict tRNA genes de novo and to generate the outputs used in mimseq.",
    "Critical: The formatting of output files and tRNA names must follow the convention as in GtRNAdb files and other mimseq prebuilt references. As an example, see the S. cerevisiae sacCer3 reference (https://github.com/nedialkova-lab/mim-tRNAseq/tree/master/mimseq/data/sacCer3-eColitK[href=https://github.com/nedialkova-lab/mim-tRNAseq/tree/master/mimseq/data/sacCer3-eColitK]).\nNote: The use of custom input files for species not currently included in mimseq has not been extensively tested and might lead to errors at runtime. See troubleshooting problem 3[href=https://www.wicell.org#sec7.5] for advice on how to overcome those.\nNote: For species that have pre-built references in mimseq, or once the necessary inputs have been generated, the only input file needed for mimseq operation is one that specifies the sample data. This is a tab-separated file with two columns; the first specifies the path to the trimmed fastq files from step 3, and the second specifies the condition or treatment group of the sample.\nNote: From here on, protocol details are given in reference to running the example data present in the mimseq GitHub repository (https://github.com/nedialkova-lab/mim-tRNAseq[href=https://github.com/nedialkova-lab/mim-tRNAseq]; see mimseq_hek_1.fastq.gz, mimseq_hek_2.fastq.gz, mimseq_k562_1.fastq.gz, mimseq_k562_2.fastq.gz and sampleData_HEKvsK562.txt). These data are a subset of human HEK293T and K562 data generated (Behrens et al., 2021[href=https://www.wicell.org#bib2]).\nCreate and save sample data tab-separated text file.\n./mimseq_hek_1.fastq.gz    HEK293T\n./mimseq_hek_2.fastq.gz    HEK293T\n./mimseq_k562_1.fastq.gz    K562\n./mimseq_k562_2.fastq.gz    K562\nRunning mimseq\nTiming: 15 min–1 h\nusage: mimseq [options] sample data\nThe mimseq pipeline and its most important parameters are schematically outlined in Figure 3[href=https://www.wicell.org#fig3].\nRunning the mimseq command only requires that the sample data input file is specified last. All other parameters can occur in any order.\nCustomize [optional] parameters.\nNote: Listed below are the major customizable parameters that should be considered. This is not an exhaustive list; please see mimseq –help for all parameters. Parameters that are required are indicated.\n-n: Experiment name. Output files and indices will have this prefix. REQUIRED.",
    "--out-dir: Output directory name. This directory cannot exist. If it does, for example, from a previous mimseq run, please remove it and rerun mimseq. Default is the current directory.\n--species or -t, -o and -m: Select species/genome of interest (see https://mim-trnaseq.readthedocs.io/en/latest/start.html#pre-built-references[href=https://mim-trnaseq.readthedocs.io/en/latest/start.html#pre-built-references]), or specify input files (see preparing mimseq input files[href=https://www.wicell.org#sec5.2]). REQUIRED; either –species, or -t and -o.\n--control-condition: Specify the condition you would like to use as the control. All comparisons in DESeq2 and differential modification analysis will be reported relative to the control. This must match one of the conditions listed in the sample data file exactly. REQUIRED.\n--threads: Total available processors to use during analysis (particularly alignment). Please scale according to resource availability on your server/computer.\n--cluster-id: Cluster identity threshold for tRNA clustering, between 0 and 1. This is a genome-specific parameter that needs to be determined for the specific needs of the user. Generally, a good choice will maximize uniquely mapping reads and minimize multi-mapping reads with little compromise to total deconvoluted sequences. In our experience, this value usually lies between 0.90 (e.g., yeast tRNAs) and 0.97 (human tRNAs).\nNote: When analyzing your own data for the first time, we recommend performing several mimseq runs with –cluster-id set to 0.90, 0.93, 0.95, 0.97, or 1, and otherwise identical settings. Inspect alignment rate plots and deconvoluted transcript fractions printed in the log file to identify the optimal settings for your datasets, biological question, and organism of interest. A --cluster-id 1 run is equivalent to the commonly used tRNA read alignment strategy of collapsing multi-copy tRNA genes into a single reference. In our experience, this results in up to 25% of multi-mapping reads, depending on the organism.",
    "--deconv-cov-ratio: Threshold of the required ratio between coverage at 3′ end and mismatch used for deconvolution. Coverage reductions greater than the threshold will result in non-deconvoluted sequences. This should be adjusted according to the general coverage quality of your libraries (see plots in the cov/ output folder and expected outcomes). Low sequence coverage at 5′ ends with a high –deconv-cov-ratio will result in more non-deconvoluted sequences.\n--max-mismatches and --remap-mismatches: Controls the proportion of mismatches allowed as a fraction of read length in the first and second round of alignment, respectively (excluding known and predicted modification sites). Due to new modification detection after the first round of alignment, it is generally advisable to reduce –remap-mismatches relative to --max-mismatches to reduce spurious and inaccurate read alignment in the second round. Setting either parameter higher than 0.1 is not advisable!\nNote: When analyzing your own data for the first time, we recommend performing several mimseq runs with --max-mismatches set to 0.075 or 0.1 and --remap-mismatches set to 0.05 or 0.075 and otherwise identical settings. Inspect alignment rate plots and deconvoluted transcript fractions printed in the log file to identify the optimal settings for your datasets, biological question, and organism of interest.\n--min-cov: Minimum coverage per unique tRNA after deconvolution required for inclusion in coverage plots, modification analysis, and 3′-CCA analysis. This can be a fraction of total mapped reads between 0 and 1 or an integer representing absolute coverage. Note that all clusters are included for differential expression analysis with DESeq2. Default = 0.0005 (0.05% mapped reads).\n--max-multi: Maximum number of bam files to process simultaneously. Increasing this number reduces processing time but increases total memory usage. Default is 3, maximum is the total number of samples.",
    "Note: Processing too many files at once can cause termination of mim-tRNAseq due to insufficient memory. If mim-tRNAseq fails during coverage calculation, lower this parameter.\n--misinc-thresh: Required fraction of reads per cluster or transcript containing a given mismatch to pass the novel modification detection threshold. Default is 0.1, i.e., 10% of cluster/transcript aligned reads must contain a given mismatch to call a new modification.\nRun mimseq.\nNote: An example of a mimseq command is given below using the example data in the GitHub repository. This utilizes the Hsap (hg38) reference with clustering at 97% sequence identity, allows 10% mismatches per read length on round 1 of alignment, and subsequently 7.5% on realignment, and filters all tRNAs with less than 0.05% total mapped reads from plots.\n> mimseq --species Hsap --cluster-id 0.97 --threads 15 --min-cov 0.0005 --max-mismatches 0.1 --control-condition HEK293T -n hg38_test --out-dir hg38_HEK239vsK562 --max-multi 4 --remap --remap-mismatches 0.075 sampleData_HEKvsK562.txt\nNote: The above command will utilize the example data supplied in the GitHub repository. Please download the four fastq files and sampleData_HEKvsK562.txt file if you want to reproduce this analysis.\nCluster deconvolution\nBy clustering tRNAs within an anticodon family by a sequence identity threshold, reads are aligned to a representative cluster parent, which substantially reduces multi-mapping for reads from nearly identical tRNA transcripts (Behrens et al., 2021[href=https://www.wicell.org#bib2]). To restore single-transcript resolution for subsequent analyses, we developed a cluster deconvolution algorithm which reassesses aligned reads and reassigns them to tRNA transcripts based on mismatch patterns to the cluster parent sequence.",
    "Note: Since the original publication, we have introduced several major updates to the cluster deconvolution algorithm (Figure 4[href=https://www.wicell.org#fig4]A). Since v0.3, the set of all mismatches between each unique tRNA transcript and the cluster parent are considered, rather than single mismatches as in earlier versions. From the full set of mismatches, unique 3′ subsets are determined, and aligned reads are searched for these mismatches to reassign them to unique transcripts within a cluster. This theoretically allows the distinction and deconvolution of all unique tRNA transcripts. When analyzing tRNA pools from an organism that encode a high number of highly similar tRNA transcripts, such as mammals, a small proportion of clusters, or particular transcripts within a cluster, cannot be deconvoluted due to three main reasons (Figure 4[href=https://www.wicell.org#fig4]B):\nA small subset of clusters may still exhibit 3′ coverage bias due to modifications that induce stops to RT, such as the rare ms2t6A/ms2i6A (Behrens et al., 2021[href=https://www.wicell.org#bib2]). Complete deconvolution of reads for such clusters might not be possible if coverage is significantly lower at mismatches required for deconvolution than at the 3′ end of the tRNA. To overcome this, the --deconv-cov-ratio parameter can be used to set a threshold for this difference in coverage (see running mimseq[href=https://www.wicell.org#sec5.3]). Coverage at positions required for deconvolution not passing this threshold will result in the transcript being marked as not deconvoluted.\nSome tRNA transcripts are only distinguishable from the parent by positions that might also be modified sites (for example, G26 or A58). In these cases, it is impossible to tell if a mismatch in a read is due to mismatches between cluster members or if it is due to misincorporations at the modified nucleotide. Such tRNA transcripts (and the parent of the cluster) are also labeled as not deconvoluted.",
    "Thirdly, reads that cannot be assigned to a transcript within a cluster are by default left assigned to the parent sequence. In very rare cases, these parent-assigned reads also contain mismatches that do not pass our modification calling criteria, which indicates that they might not originate from the parent transcript either. If 10% or more parent-assigned reads contain such mismatches, the entire cluster is not deconvoluted.\nTranscripts that are not deconvoluted are grouped and their count and modification data are aggregated. These are then renamed to provide information on which transcripts remain clustered, and are treated similarly to other single transcripts for differential expression analysis, modification profiling, and other downstream analyses (Figure 4[href=https://www.wicell.org#fig4]B). For further information on non-deconvoluted transcripts and clusters, please refer to the annotation/∗unsplitClusterInfo.txt output file."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Bioinformatics",
    "Molecular Biology",
    "Gene Expression",
    "Sequencing"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}