{
  "id": 6153,
  "origin_website": "Bio",
  "title": "Bioluminescence Resonance Energy Transfer (BRET) Assay for  Determination of Molecular Interactions in Living Cells",
  "procedures": [
    "Cell culture   The PS1/PS2-deleted HTL cells are routinely grown in DMEM medium supplemented with 10% (v/v) Fetal Clone II and including 1x penicillin-streptomycin (see Recipes) at 37 °C under a humidified 5% CO2 atmosphere.   Treat the cells with 0.05% trypsin-EDTA for 5 min at 37 °C in an incubator to lift the cells. Wash the cells with medium, and count them to allow a plating density of 1.5 x 106 cells per 100 mm dish one day prior to transfection.    In preparation for transfection, visualize the confluence of the cells and their health using a cell culture microscope with phase optics.      Transfection   To a sterile 5 ml tissue culture tube, add 1.5 ml DMEM medium without serum.   Add 75 µl DEAE-dextran solution and mix well.    Add 1.0 µg of total DNA (0.5 µg of donor + 0.5 µg of acceptor prepared using standard DNA isolation techniques) and mix well.    Use a micropipette to transfer 1.575 µl of DNA-DEAE-dextran complex to each plate.    Incubate at 37 °C in a tissue culture incubator for 2 h without shaking.   Aspirate the medium from each plate, add 4 ml of DMEM containing 10% DMSO and incubate at room temperature for 2 min without shaking.   Aspirate the medium from each plate, add 4 ml of DMEM containing 0.1 µM chloroquine and incubate for 2 h at 37 °C without shaking.   Aspirate the medium from each plate, and add 8 ml of serum-containing complete DMEM medium (see Recipes).   Incubate the cells in the incubator at 37 °C in a humidified atmosphere containing 5% CO2 for 48 h.      Luminescence and fluorescence measurement   48 h post-transfection, remove the medium from the cultured cells using a Pasteur pipette attached to a vacuum source and gently add 5 ml of PBS (see Recipes) to each plate to rinse the cells.",
    "Dispense 1 ml of enzyme-free cell dissociation solution into each plate and incubate without shaking for 5 min at 37 °C in tissue culture incubator to release the cells.   Transfer the cells into a 15 ml conical tube and centrifuge the cells at 175 x g for 5 min at room temperature.    Resuspend the cell pellet in approximately 1 ml of Kreb’s-Ringers-HEPES medium, pH 7.4 (see Recipes) to achieve a density of 0.20 x 106 cells per ml. Keep this tube at room temperature in preparation for the assay.   Dispense 100 µl of cell suspension (approximately 20,000 cells) into a white 96-well OptiPlate, add 5 µl coelenterazine h (see Recipes), mix the cells by swirling the plate, and measure both the luminescence signal and the YFP fluorescence signal using an Envision Plate Reader with a BRET module.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116012713_3080.jpg    Luminescence and fluorescence signals should be collected immediately after the addition of coelenterazine h solution. The spectrofluorometer instrument should be set up for the specific pair of donor and acceptor chosen. Here, for the proposed BRET studies, luminescence emission should be collected using a dedicated filter set (460 nm, with bandwidth 25 nm) and the fluorescence emission should be collected simultaneously using a dedicated filter set (535 nm, bandwidth 25 nm). The measurement time is 0.2 sec and measurement height is 6.5 mm. (Harikumar et al., 2007). In the example, YFP fluorescence was measured by exciting the sample at 475 nm (bandwidth 25 nm) and the emission was collected at 535 nm (bandwidth 25 nm), with detector gain 150 and number of flashes 20.    A representative example of data collection and analysis follows: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171116/20171116012745_2444.jpg  Calculated BRET ratio: 1.23 - 0.70 = 0.53"
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}