{
  "id": 1764,
  "origin_website": "Cell",
  "title": "Generation of mixed murine organoids to model cellular interactions",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOrganoid culture\nTiming: 7 days\nThis section describes the culture steps in preparation of small intestine wild-type and cancer organoids for generation of mixed cultures. For complete details on the isolation and culture of murine small intestine organoids please refer to (Sato et al., 2009[href=https://www.wicell.org#bib15]; Sato and Clevers, 2012[href=https://www.wicell.org#bib14]; Andersson-Rolf et al., 2014[href=https://www.wicell.org#bib1]). For optimal and efficient execution of this protocol it is essential that the organoids have adapted to the experimental culture medium and are in a healthy state (Figure 2[href=https://www.wicell.org#fig2]) prior to the start of the experiment.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1217-Fig2.jpg\nFigure 2. Input organoid cultures\n(A and B) Mature murine wild-type (A) and Cancer (B) organoid cultures passaged 3 days prior to the start of the experiment. Pay attention to the morphology of the organoids, which should have a smooth epithelium and lack apoptotic cells in their lumen. 2–6 crypt-like structures are optimal for wild-type small intestine cultures. (A) Membrane-bound tdTomato labelled wild-type cells (Krotenberg Garcia et al., 2021[href=https://www.wicell.org#bib10]) were derived from healthy small intestine tissue. (B) Dendra2 labelled cancer cells were derived from Apc−/−KrasG12D/WTTrp53-/R172H small intestinal tumors (Fumagalli et al., 2017[href=https://www.wicell.org#bib4]).\nScale bars = 100 μm\nCulture the organoids in 3D in BME2 for at least 7 days in ENR culture medium. There is no maximum duration of this adaptation time. Passage the cultures when the lumen fills with apoptotic cells, approximately once every 3–4 days.",
    "Critical: It is essential that the experimental culture medium is uniform for all organoid cultures in the experiment and contains a combination of all factors that are required for the individual cultures. For example, the cancer population described in this protocol does not require hEGF or RSPO1, but is cultured in ENR medium, in order to avoid phenotypic changes during the experiment that could be caused by growth factors.\nPassage organoid cultures 2–3 days prior to the start of the experiment until mature and healthy organoids are formed (Figure 2[href=https://www.wicell.org#fig2]). Refer to Table 2[href=https://www.wicell.org#tbl2] for guidance on input material.\nNote: We have not observed differences in outcome between early and late passage cultures. However, depending on the organoid cultures of choice the use of early passages might be required.\nPreparation of organoids\nTiming: 15–30 min\nThis section describes the preparation of small intestine wild-type and cancer organoids for mixed cultures. After Step 7, organoids are ready to proceed to generation of 3D mixed organoids (Part A) or generation of mixed enteroid monolayers (Part B).\nNote: Organoid cultures are very sensitive to fluctuations in temperature. Therefore, we recommend to use ice-cold reagents, keep cells on ice in between steps and use centrifuges that are cooled to 4°C throughout the protocol.\nHarvest organoids by scraping the bottom of the well and pipetting up and down with a p1000 pipette using ice-cold Basic culture medium.\nCollect the organoid suspension in 15 mL centrifuge tubes and keep on ice.\nOptional: To ensure harvest of all organoids, it is recommended to wash the well with another 1 mL of ice-cold Basic medium and collect leftovers.\nCentrifuge at 300×g at 4°C for 5 min. Three clear layers should be formed; medium, BME2 and the pellet of organoids (top-to-bottom, Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1217-Fig3.jpg\nFigure 3. Preparation of organoids",
    "Overview of the three phases formed by centrifugation of an organoid suspension. Medium (top), BME2 (middle) and organoid pellet (bottom).\nCarefully remove the medium and BME2 layers without disrupting the organoid pellet.\nResuspend the pellet in 1 mL of ice-cold Basic culture medium.\nPart A. Generation of 3D mixed organoids\nTiming: 2–3 h\nThis section describes the main steps to generate 3D mixed organoids from small intestine wild-type and cancer cells. Once the 3D mixed organoids are formed, they can be used in different techniques such as cell sorting, immuno-fluorescence and time-lapse imaging, described later in this protocol.\nUse a fire-polished glass Pasteur pipet to mechanically disrupt the organoids. Pipette up and down 10–20× while pressing the pipet tip against the bottom of the tube, until no clear structures are visible by eye. The suspension now contains clumps of 50–150 cells (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1217-Fig4.jpg\nFigure 4. Generation of organoid clump suspension\nBright field examples of mechanically disrupted organoid cultures. Depicted are fragments that need more disruption (left), of optimal size (middle, indicated by arrow heads) or were disrupted too much (right).\nScale bar = 100 μm\nNote: Immediately before use, sterilize glass Pasteur pipets by briefly passing them through a flame and coat the inside walls of the pipet by aspiration of Basic culture medium to avoid attachment of the organoids.\nCritical: Optimal breaking of the organoids is essential. Therefore, it is recommended to monitor the status at a microscope after every 5–10× of pipetting. Stop the breaking of the organoids before they are single cells (Figure 4[href=https://www.wicell.org#fig4]).\nCentrifuge at 300×g at 4°C for 5 min.\nAspirate supernatant and resuspend the pellets in 300 μL ice-cold Basic culture medium.",
    "Critical: The final ratio of cells in the mixed organoids is dependent on the input of the different cell populations (see Table 2[href=https://www.wicell.org#tbl2]). Therefore, it is important to compare the pellet size and adjust the amount of Basic culture medium that is added in Step 10 accordingly (add 300 μL to the smallest pellet, increase volume X times for a X times bigger pellet).\nPrepare one Eppendorf tube for each of the conditions (Pure population A, Pure population B and Mix Population A : B) and add the correct amount of cell clump suspension (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1217_9.csv\nNote: The efficiency of generating mixed organoids is not 100%. Therefore, it is recommended to include duplicates of mixed conditions in order to generate equal numbers of pure and mixed organoids.\nNote: The optimal ratio for mixing is dependent on the characteristics of the individual cultures, such as differences proliferation rate. It is recommended to include multiple ratios and validate the optimal mix conditions experimentally.\nCentrifuge at 300×g at 4°C for 5 min\nCarefully aspirate the supernatant with a p200 pipette and resuspend the small pellet in 10 μL of ENR medium.\nIncubate the Eppendorf vials containing the concentrated cell clump suspensions at 37°C for 30 min to promote cell aggregation.\nCritical: Aggregation of cells in a small volume is essential for efficient formation of mixed organoids. Do not increase the volume to more than 25 μL.\nAfter the incubation time, dilute the aggregates with ENR medium (see Table 2[href=https://www.wicell.org#tbl2] for volume).\ntable:files/protocols_protocol_1217_10.csv\nAdd double the volume of BME2 (compared to the diluted aggregates) to achieve a final ratio of 1:2 (see Table 2[href=https://www.wicell.org#tbl2] for volume) and keep on ice.",
    "Plate drops of 12 μL per well of an imaging-compatible plate. Output and drop size are based on use of a 96-well imaging plate (IBIDI). Adapt when different plates are used.\nNote: For sorting of cells from 3D organoids it is recommended to plate mixed organoids in a 6 well format to increase yield\nNote: The input material is indicated per one well, this is sufficient for four conditions (1× each of pure populations and 2× mix)\nNote: The volumes in Table 2[href=https://www.wicell.org#tbl2] are guidelines. To avoid crowding it is recommended to plate one drop in a separate dish and monitor organoid density (Figure 5[href=https://www.wicell.org#fig5]). Adjust the volume if needed.\nNote: The indicated drop size is optimized for plating of a single drop per well of a 96-well imaging plate (IBIDI). It is recommended to adjust the size when other plate types are used.\nInvert the plate and let the drops solidify in a 37°C incubator for 10–30 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1217-Fig5.jpg\nFigure 5. Plating density\nBright field examples of cell aggregates that are plated at an optimal density (left) or a density that is too concentrated (right).\nScale bar = 100 μm\nCarefully add 150 μL room temperature ENR medium per well, do not disrupt the drops, and return the plate to the incubator (37°C, 5% CO2).\nNote: At this stage chemical manipulation can be started, for example by addition of small molecule inhibitors to the culture medium.\nPart B. Generation of mixed enteroid monolayers\nTiming: 2–3 h\nThis section describes the main steps to generate mixed enteroid monolayers (Thorne et al., 2018[href=https://www.wicell.org#bib18]) from individual small intestine wild-type and cancer cells. Once the monolayers are formed, they can be used in different techniques such as immuno-fluorescence and time-lapse imaging, described later in this protocol.\nCoat imaging plates:",
    "Dilute BME2 to a final concentration of 0.8 mg/mL in ice-cold Basic culture medium and keep on ice.\nAdd 50–150 μL of diluted BME2 per well (see Table 3[href=https://www.wicell.org#tbl3] for appropriate volume) and incubate for 1 h at 37°C\ntable:files/protocols_protocol_1217_11.csv\nWash the coated wells twice with Basic culture medium and use the plate within 2 h. Keep the plates at room temperature until use.\nContinue with resuspended pellet (Step 7) and use a fire-polished glass Pasteur pipet to mechanically disrupt the organoids by briefly pipetting up and down.\nNote: Immediately before use, sterilize glass Pasteur pipets by briefly passing them through a flame and coat the inside walls of the pipet by aspiration of Basic culture medium to avoid attachment of the organoids.\nCentrifuge at 300×g at 4°C for 5 min.\nAspirate the supernatant and add 1 mL of TrypLE at room temperature.\nDissociate the broken organoids by pipetting up and down using a fire-polished glass Pasteur pipet.\nOnce a single cell suspension is formed (after ± 3 min at room temperature) immediately add 10 mL of cold Basic culture medium and keep on ice.\nNote: TrypLE is sufficiently inactivated by dilution. Additional inactivation steps (e.g. addition of serum or an inhibitor) might be required when other dissociation reagents are used. Check recommendations of the supplier.\nCritical: Some organoid cultures are very sensitive to dissociation. It is recommended to reduce the incubation time in TrypLE to less than 5 min. This can be achieved by processing few samples simultaneously and repeated monitoring at a microscope until a single cell suspension is reached (similar to the right panel in Figure 4[href=https://www.wicell.org#fig4]).\nCentrifuge at 300×g at 4°C for 5 min.\nAspirate the supernatant and add 200 μL of ice-cold Enteroid plating medium.",
    "Count cells using a Bürker Türk Counting Chamber or automated cell counter\nDilute and plate cells in ice-cold Enteroid plating medium in an imaging compatible plate according to Table 3[href=https://www.wicell.org#tbl3].\nLet the cells adhere in an incubator (37°C, 5% CO2).\nReplace the medium with 37°C ENR medium after 16–24 h and refresh every 2–3 days.\nNote: At this stage chemical manipulation can be started, for example by addition of small molecule inhibitors to the culture medium.\nImmuno-fluorescence staining\nTiming: 2 days\nThis section describes how to proceed with Immuno-fluorescence staining of mixed organoids or enteroid monolayers. The indicated volumes are based on use of a 96-well imaging plate (IBIDI) and can be adapted accordingly when different plates are used.\nCarefully aspirate culture medium without disturbing the drop of BME2 or the monolayer.\nAdd 100 μL Fixation solution (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section) and incubate at room temperature for 20 min.\nNote: It is not required to include an additional wash step prior to fixation.\nAspirate the Fixation solution once the drop of BME2 is completely dissolved (Figure 6[href=https://www.wicell.org#fig6]) and wash twice with 100 μL PBS.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1217-Fig6.jpg\nFigure 6. Fixation of mixed organoids\nDrop of BME2 containing mixed 3D organoids before fixation (left) and after dissolving in fixation solution (right). The BME2 drop, before and after disruption, are outlined by a dashed line.\nScale bar = 1 mm\nNote: If the drop is not completely dissolved, the fixation can be prolonged for up to 30 min.\nNote: The organoids are now attached to the bottom of the well.\nPause point: After fixation organoids can be stored in PBS for 2/3 weeks, protected from light at 4°C before continuing with immuno-staining.",
    "Add 100 μL blocking solution (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section) and incubate at room temperature for at least 30 min to block and permeabilize organoids.\nNote: This step can be prolonged for several hours when convenient.\nAdd the appropriate primary antibodies diluted in Antibody incubation solution (50 μL per well) and incubate at 4°C protected from light overnight (8–16 h) or for up to several days.\nNote: See “expected outcomes[href=https://www.wicell.org#expected-outcomes]” section for examples of antibodies that can be used.\nWash three times for 5 min with 100 μL Washing solution at room temperature.\nAdd the appropriate secondary antibodies diluted in Antibody incubation solution (50 μL per well) and incubate at room temperature protected from light for at least one hour.\nNote: At this step other dyes such as DAPI or phalloidin can be included. Selection of secondary antibodies should be based on the expression of fluorophores by the organoid cultures to avoid cross-talk.\nNote: This step can be prolonged for up to several days. Incubate at 4°C when exceeding 5 hours.\nWash three times with 100 μL Washing solution for 5 min each at room temperature.\nRinse twice with 100 μL PBS and leave the organoids in PBS.\nPause point: Stained organoids can be can be stored in the dark at 4°C. To prevent loss of signal, we recommend proceeding with image analysis within one week. Ensure the organoids do not dry out by adding enough PBS and/or sealing plates with parafilm.\nProceed to imaging using a platform of choice. A confocal based platform is recommended, using a high NA 20–25× objective.\nAcquire Z-stacks, see notes for recommendations.",
    "Note: For 3D mixed organoids the thickness of Z-slices should be determined based on the detail of information that is needed for further analysis. For example, a thickness of 5 μm is sufficient for analysis at a cellular resolution. For optimal 3D reconstruction without loss of data, a system calculated optical slice thickness can be used.\nNote: For enteroid monolayers, it is recommended to acquire Z-stacks covering the total thickness of the monolayer (approximately 20 μm) to avoid loss of 3D information. Data can be further analyzed via 3D reconstruction or Z-projection.\nTime-lapse imaging of mixed organoids\nTiming: 1–4 days\nThis section describes how to proceed with time-lapse imaging of mixed organoids or enteroid monolayers. Ensure cells are plated in an imaging-compatible plate at Step 17 or 29.\nRefresh the medium 1 day after plating.\nAdd PBS to the surrounding empty wells to avoid evaporation.\nProceed to imaging using a platform of choice that is equipped with a CO2 and 37°C incubator. A (spinning-disk) confocal based platform is recommended, using a high NA 20–25× objective.\nAcquire images with a maximum time interval of one hour and a maximum Z-slice thickness of 5 μm for tracking of single cells in 3D.\nNote: Organoids can be imaged for up to 72 hours. A change of medium is necessary for longer experiments.\nSorting cells from mixed organoids\nTiming: 2–4 h\nThis section describes how to process previously mixed 3D organoids for cell sorting.\nHarvest organoids by scraping the bottom of the well and pipetting up and down with a p1000 pipette using ice-cold Basic culture medium.\nCollect the organoid suspension in 15 mL centrifuge tubes.\nCentrifuge at 300×g at 4°C for 5 min. Three clear layers should be formed; medium, BME2 and the pellet of organoids (top-to-bottom, Figure 3[href=https://www.wicell.org#fig3]).",
    "Carefully remove the medium and BME2 layers without disrupting the organoid pellet.\nResuspend the pellet in 1 mL of ice-cold Basic culture medium.\nMechanically disrupt the organoids by briefly pipetting up and down using a fire-polished glass Pasteur pipet.\nCentrifuge at 300×g at 4°C for 5 min.\nAspirate the supernatant and add 1 mL of TrypLE at room temperature.\nDissociate the broken organoids by pipetting up and down using a fire-polished glass Pasteur pipet.\nOnce a single cell suspension is formed (after ± 3 min) immediately add 10 mL of ice-cold Basic culture medium and keep on ice.\nNote: TrypLE is sufficiently inactivated by dilution. Additional inactivation steps (e.g. addition of serum or an inhibitor) might be required when other dissociation reagents are used. Check recommendations of the supplier.\nCentrifuge at 300×g at 4°C for 5 min.\nResuspend pellet in 250 μL ice-cold FACS buffer and pass through a 35 μm cell strainer.\nKeep cells on ice and immediately proceed to cell sorting using a platform of choice."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cancer",
    "Cell Culture",
    "Cell Biology",
    "Organoids"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}