{
  "id": 1873,
  "origin_website": "Cell",
  "title": "Immunization of mice with the self-peptide ACBP coupled to keyhole limpet hemocyanin",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nKLH-ACBP conjugation\nTiming: 6 h\nGlutaraldehyde is used as crosslinker that reacts with the amine groups of both proteins. Excess aldehyde groups are then saturated with glycine, and the reaction is stopped by formaldehyde.\nGlutaraldehyde conjugation\nPipet the KLH-ACBP mix into the 3mL glass vial and start to stir (approx. 500 rpm) 18°C–25°C.\nSlowly add 500 μL of 1 % glutaraldehyde.\nCritical: Proceed drop by drop. Do not hesitate to pipet 20 μL at a time for more precision.\nStir 2 h at 18°C–25°C.\nNote: The solution will turn light yellow for KLH and dark yellow-to-brown for KLH-ACBP.\nGlycine quenching\nAdd 250 μL of 1 M glycine.\nStir 30 min at 18°C–25°C.\nWashes\nTransfer the vial content to an Amicon® Ultra-15 Centrifugal Filter Unit.\nCentrifuge 10 min at 4000 g.\nRinse the walls of the chamber with 2 mL borate buffer.\nCentrifuge 10 min at 4000 g.\nRinse the walls of the chamber with 2 mL borate buffer.\nCentrifuge 10 min at 4000 g.\nFormaldehyde quenching\nAdd 2 mL of 0.2 % formaldehyde solution.\nLeave 30 min at 18°C–25°C.\nAdd 250 μL 1 M glycine.\nLeave 30 min at 18°C–25°C.\nWashes\nCentrifuge 10 min at 4000 g.\nRinse the walls of the chamber with 2 mL borate buffer.\nCentrifuge 10 min at 4000 g.\nRinse the walls of the chamber with 2 mL borate buffer.\nCentrifuge 10 min at 4000 g.\nCarefully resuspend the content of the chamber in 1 mL PBS.\nQuantify the protein concentration by the method of your choice: bicinchoninic acid (BCA) assay, absorbance…\nPause point: The solution can be stored at 4°C for the whole duration of the protocol (up to two months).\nConjugation control",
    "To verify the conjugation of the peptide antigen with KLH, a SDS-Page followed by Coomassie blue staining or Western Blot can be performed. Carefully adapt the procedure to account for the large size of these proteins (> 390 kDa).\nSample preparation\nDilute the KLH and KLH-ACBP to a concentration of 0.2 μg/μL in LDS-reducing buffer.\nDenature the proteins by warming 5 min at 100°C.\nPlace the samples in ice until same-day use or keep them at −20°C for later processing.\nMigration\nRinse a 7 % Tris-Acetate gel to ensure the wells are clean.\nImmerse the gel in the MOPS buffer and load 10 μL of each sample per lane.\nNote: Duplicate all lanes to be able to do both Coomassie-blue staining and immunoblotting.\nRun for 2h30 under a constant voltage of 140 V.\nCoomassie-blue staining\nCut half the gel for Coomassie blue staining and keep the other half for step 4.\nIncubate for 1 h in Coomassie blue.\nRinse in water.\nTake a picture of the Coomassie-blue stained gel to compare protein weights.\nNote: The differences in height are subtle due to the very high protein weights.\nImmunoblotting\nTransfer to an ethanol-activated 0.22 μm PVDF membrane for 2h30 in 1× Tris-Glycine buffer containing 10 % ethanol, under a constant voltage of 100 V.\nBlock the membrane with TTBS + 5 % skimmed milk for 1 h at 18°C–25°C.\nRinse the membrane 3 times 5 min with TTBS.\nIncubate 12–15 h at 4°C with primary antibodies diluted in TTBS + 5 % BSA (anti-DBI 1:1000, anti-KLH: 1:500).\nRinse the membrane 3 times 5 min with TTBS.\nIncubate 1 h at 18°C–25°C with the secondary antibodies (anti-DBI: goat anti-rabbit AF594-conjugated 1:5000; anti-KLH: goat anti-mouse HRP-conjugated 1:5000).\nReveal the membrane by immunofluorescence reading (anti-DBI), then chemiluminescence after a 1-min ECL incubation (anti-KLH).",
    "Note: If immunofluorescence is not available for western blot revelation, the membrane can be revealed twice with chemiluminescence, with stripping and blocking steps in between.\nVaccination\nTiming: 4 weeks\nTo vaccinate the mice, KLH-ACBP aqueous solution is brought to emulsion in the mineral oil adjuvant Montanide ISA 51 VG. The detailed protocol of emulsification can be provided by the manufacturer Seppic (protocol #5559).\nKLH-ACBP + Montanide emulsion\nDilute KLH-ACBP solution to the desired concentration according to Table 1[href=https://www.wicell.org#tbl1]. Load the aqueous phase (max. 1 mL) in a 2 mL luer lock syringe.\nCritical: Prepare the double amount of emulsion you will use. The final product is viscous and major loss can occur during syringe loading and injections.\nNote: If the final mix volume is greater than 3 mL, 5 mL syringes can be used at this step instead of the reference given in the key resources table[href=https://www.wicell.org#key-resources-table]. The emulsion step will have to be carried out rigorously, meaning that larger volume requires more physical strength to achieve correct emulsification.\nLoad 1 mL of Montanide into another 2 mL luer lock syringe.\nConnect the two syringes with a double female luer-lock connector as shown in Figure 1[href=https://www.wicell.org#fig1]B.\nCritical: Make sure not to trap any air bubble in the system, since this can affect emulsion quality.\nSlowly transfer the liquid content from one syringe to the other, then back to the first side. Repeat this cycle 20 times.\nPerform the same movement as fast as possible 40 extra times.\nNote: The emulsion will become white and thicker, which can be noticed by an increased resistance of the plunger.\nLoad the emulsion in a 1 mL syringe by plugging it on one side of the double female luer-lock connector.\nInject intraperitoneally 100 μL to each mouse with a 25 G needle.",
    "Repeat these steps once weekly for 4 weeks using the doses presented in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_1353_11.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1353-Fig1.jpg\nFigure 1. Verification of the KLH-ACBP conjugation after glutaraldehyde crosslinking\n(A) Molecular weights were compared by SDS-PAGE followed by Coomassie blue staining while the presence of ACBP in the conjugate was confirmed by immunoblotting against KLH and ACBP. A polyclonal primary antibody directed against ACBP was chosen to detect the various epitopes present on the KLH-ACBP conjugate.\n(B) Schematic view of the emulsification protocol.\nImmunization test\nTiming: 3 days\nThe presence of antibodies directed against ACBP is tested by immunoblotting the recombinant target protein with plasma. The presence of anti-ACBP antibodies is revealed by means of a secondary anti-mouse immunoglobulin G (IgG) antibody coupled to horseradish peroxidase (HRP).\nPlasma “primary” solution\nAfter the fourth week of immunization, take 100–150 μL samples of blood from the submandibular vein in lithium-heparinized tubes. Centrifuge them 10 min at 2000 g to recover plasma.\nDilute 50 μL plasma in 450 μL of TTBS-BSA. Place this solution in a non-treated 12-wells plate, one well per mouse, and incubate 12–15 h at 4°C.\nPause point: Remaining plasma can be stored at −80°C for subsequent analysis, such as ELISA quantification of circulating ACBP.\nOvernight step\nRecombinant protein immunoblotting\nLoad 4–12% Bis-Tris acrylamide precast gels with one in two wells containing 2 μg of recombinant ACBP and the alternates wells with protein ladder. Run one pair of ladder wells + ACBP for each vaccinated mouse.\nTransfer the proteins in the gel to 0.2 μm PVDF membranes, then use Ponceau S staining to cut 1.2 cm-wide squares including the ladder and the ACBP protein.\nTake a photography of the Ponceau S staining for quantification of protein content.",
    "Rinse the Ponceau S out and place each square in TTBS-BSA for 1–2 h of blocking. Use numbered 12-wells plates with 500 μL of TTBS-BSA in each well to keep track of the correspondence between Ponceau S pictures and final results.\nTransfer the squares to their corresponding plasma solution in the 12-wells plates. Incubate 12–15 h at 4°C.\nOvernight step\nRinse each well for 5 min with 500 μL TTBS. Repeat this operation three times.\nIncubate 1 h at 18°C–25°C with 500 μL anti-mouse IgG HRP-conjugated secondary antibody (1:5000 dilution in TTBS-BSA).\nRinse each well for 5 min with 500 μL TTBS. Repeat this operation three times.\nReveal the squares with ECL substrate and an adequate chemiluminescence camera.\nELISA quantification of circulating ACBP\nTiming: 2 days\nThe neutralization of ACBP by the autoantibodies can be quantified by measuring the concentration of free ACBP in the plasma after immunization.\nCapture antibody coating\nFill the adequate number of wells in 96-wells high-binding plates with 200 μL anti-ACBP capture antibody, diluted in PBS to a final concentration of 0.5 μg/mL.\nNote: Reliable quantification can be achieved by performing duplicate measurements and two standard curves per plate (total 16 wells + 2 x number of samples).\nIncubate 12–15 h at 4°C. Overnight step.\nBlocking\nWash the plate twice with 300 μL washing buffer.\nNote: Tape the plate dry on absorbent paper between each step and make sure to eliminate any drops or bubbles at the bottom of the plate.\nAdd 200 μL blocking buffer per well.\nIncubate 2 h at 18°C–25°C under gentle agitation.\nSamples loading\nWash 4 times with 300 μL washing buffer.\nAdd 100 μL of sample or standard, diluted in the ELISA reaction buffer.\nIncubate 2 h at 18°C–25°C under gentle agitation.",
    "Note: Plasma dilution ranges should be optimized in-house, but we recommend using a 1:20 dilution in PBS as a start. The recommended standard dilution range is 0–10 ng/mL, use the same recombinant protein as the one used in the vaccine preparation.\nDetection with biotin-conjugated antibody\nWash 4 times with 300 μL washing buffer.\nAdd 100 μL biotin-conjugated anti-ACBP antibody, diluted to 1 μg/mL in ELISA reaction buffer.\nIncubate 2 h at 18°C–25°C under gentle agitation\nHRP-Avidin conjugation\nWash 4 times with 300 μL washing buffer.\nAdd 100 μL HRP-avidin, diluted to 1:1000 in ELISA reaction buffer.\nIncubate 30 min at 18°C–25°C under gentle agitation\nSubstrate addition\nWash 5 times with 300 μL washing buffer.\nAdd 100 μL of 1-Step Ultra TMB-ELISA.\nIncubate 5–20 min at 18°C–25°C in the dark, until coloration.\nStop reaction\nAdd 50 μL of stop solution, i.e., 2 M H2SO4.\nMeasure absorbance at 450 nm using a microplate reader."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Metabolism",
    "Immunology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}