{
  "id": 3729,
  "origin_website": "Cell",
  "title": "Fabrication of a microfluidic device for studying the combinatorial effect of physical and chemical cues on cell migration",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTiming: preparation time of substrates to a complete migration experiment requires 2 days\nPreparation of PDMS substrates of varying stiffness\nTiming: 10–12 h\nPreparation of substrates of varying stiffness, which will serve as a base stiffness during cell migration (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/449-Fig3.jpg\nFigure 3. PDMS substrate preparation\nPrepare Sylgard 527 by mixing part A and part B in a 1:1 ratio. Also, prepare Sylgard 184 by mixing base:crosslinker 10:1. Mix the two Sylgards in 5:1 and 50:1 ratios. After mixing, coat the prepared Sylgard mixture (PDMS mixture) on a glass coverslip and bake at 70°C for 10–12 h.\nNote: Use two different PDMS (Sylgard 184 and 527) for preparing substrates of varying stiffness (Palchesko et al., 2012[href=https://www.wicell.org#bib2]).\nPrepare Sylgard 527 by vigorously mixing equal mass of Part A and Part B provided by the manufacturer. Prepare Sylgard 184 by mixing 10 parts of base to one part of curing agent, followed by vigorous mixing and subsequent degassing for 20–30 min.\nTo make substrates of two different stiffnesses, mix above-prepared solutions of Sylgard 527 and Sylgard 184 in ratios of 5:1 and 50:1, respectively. The obtained stiffness from these two ratios are 30 kPa and 3 kPa, respectively.\nNote: Other ratios can also be prepared for getting a wide range of stiffnesses.\nFor fabricating 2D PDMS substrates of these two different stiffnesses, spin coat the PDMS mixture (mix of Sylgard 527 and 184) on glass coverslips/slides using a spin coater (spinNXG-P2, Apex India) at 600 rpm for 30 s to obtain a uniform surface coating of 150 μm. To cure the coated PDMS, heat PDMS coated glass coverslips at 70°C in a hot air oven for 10–12 h.",
    "Note: Always cover the spin-coated surface to avoid dust and particle deposition. One would need to adjust speed to obtain coatings of different thicknesses.\nNext day, the cured PDMS substrates of different stiffnesses are ready for use.\nNote: Substrate stiffness and surface property could be characterized using a rheometer and a goniometer, respectively.\nFabrication of the microfluidic device\nTiming: 6–7 h\nPreparation of microfluidic device for chemotaxis assay (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/449-Fig4.jpg\nFigure 4. Soft-lithography process\nPour PDMS (Sylgard 184) on a silicon master containing the desired design. After PDMS addition, incubate the wafer at 50°C–70°C in a hot air oven for 6–7 h. After 7 h, peel off the PDMS device (top view) bearing the design from the master.\nNote: Use the device master prepared by photolithography (as described in Before you begin[href=https://www.wicell.org#before-you-begin] section) is used to fabricate the PDMS-based microfluidic devices.\nPrepare Sylgard 184 for fabricating microfluidic devices:\nPrepare PDMS (Sylgard 184) by mixing 10 parts of the base to one part of the curing agent, followed by subsequent degassing.\nPour the above degassed PDMS on the silicon wafer master (degas again if air bubbles appear post pouring). Heat at 50°C–70°C for 6–7 h in a hot air oven.\nNote: This process of making a PDMS-based microfluidic device is called soft-lithography.\nAfter 7 h, peel off the cured PDMS from the silicon master and cover it with scotch tape until further use to avoid dust deposition.\nNote: Fabricated devices need to be free of dust particles to avoid blockages in the channels. Use Scotch tape to clean the devices.\nBefore use, punch the inlets and outlets in the device using an appropriate biopsy punch (we have used 3 mm).\nNote: Inlets and outlets can be punched immediately after peeling off the PDMS device.",
    "Optional: For long-duration cell culture purposes, autoclave microfluidic devices to avoid contamination during culture time.\nPause Point: The prepared microfluidic devices can be stored at room temperature (22°C–28°C) until further use.\nAssembling PDMS substrates and microfluidic devices\nTiming: 5–10 min\nAssembly of microfluidic device and PDMS substrates of varying stiffness for studying the combined effect of stiffness and chemical gradient on cell behavior (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/449-Fig5.jpg\nFigure 5. Device assembly\nPunch the prepared PDMS device at the inlet and outlet using a biopsy puncher. Expose the punched device and prepared substrates to plasma for 1 min. After 1 min, the device and substrate are bonded together to form a complete device (side view).\nCheck the devices and substrates under an inverted microscope prior to assembly to avoid dust/dirt/particle deposition (clean with scotch tape if required).\nTo irreversibly bind the microfluidic device and different stiffness substrates, expose both of them to reactive oxygen plasma (Harrick-Plasma, PDC-32G) (exposure duration: 1 min).\nExtracellular matrix (ECM) coating of the assembled microfluidic device\nTiming: 10–12 h\nECM protein coating of assembled microfluidic device for cell attachment.\nAdd ECM protein (i.e., collagen I, 50 μg/mL) to the above assembled microfluidic device through one inlet port. Incubate the coated device for 10–12 h at 4°C.\nCritical: Devices need to be coated with ECM protein within 15 min of assembly; otherwise, devices will gain hydrophobicity. Once the PDMS regains hydrophobicity, it is difficult to perfuse the ECM protein solution through the device.\nNote: Different concentrations of collagen I ranging from 5 μg/mL to 50 μg/mL works in this system (Saxena et al., 2018[href=https://www.wicell.org#bib3]). According to available literature, various other ECM proteins (laminin, fibronectin etc.) can also be used for coating PDMS-based substrates (Jastrzebska et al., 2018[href=https://www.wicell.org#bib1]; Wang et al., 2010[href=https://www.wicell.org#bib4]).",
    "Next day, before cell seeding, wash the device with PBS two times, followed by media perfusion through the inlet ports.\nNote: Washing step is necessary to remove unbound ECM protein.\nCell seeding and experimental setup for chemotaxis assay\nTiming: 8 h (cell seeding and adhesion) + 12 h for motility\nSeeding of cells inside the ECM coated device to investigate the combinatorial effect of stiffness and chemokine gradient on cell migration (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/449-Fig6.jpg\nFigure 6. Cell seeding and chemotaxis assay\nSeed hMSCs from the cell seeding port (inlet1) on one side of the channel. Allow cells to adhere for around 6 h with continuous replenishment of media after every 1–2 h. Once attached, generate the EGF (chemokine) gradient in the device. Capture images for 12 h at 15 min intervals using an inverted microscope equipped with an onstage incubator.\nHuman mesenchymal stem cells (hMSCs) are cultured in a tissue culture flask with Dulbecco's modified Eagle's medium (DMEM) supplemented with 16% fetal bovine serum (FBS).\nNote: Culture media and FBS may vary for different cell types.\nTake trypsinized single-cell suspension and count the number of cells.\nNote: Steps 14 and 15 need to be carried within small duration of time to keep the cells on one side of the channel.\nTake 10 μL of resuspended suspension media containing ∼10,000 cells and introduce through one of the inlets.\nFrom the other inlet, add 10 μL of complete media only and wait for 5 min to obtain pressure balance and incubate the device at 37°C.\nCritical: For performing chemotaxis assay, it is essential to have a sizable cell population on one side of the channel (if using a device design similar to ours).",
    "Once the cells have adhered to the substrate (after ∼6 h), introduce EGF as a chemokine through opposite channel inlet (in the cell-free side) for chemotaxis assay.\nNote: Cells can be stained with Hoechst 33342 for 20 min before starting the experiment (as nucleus stain helps in cell tracking inside the channels).\nTo capture cell motility in the presence of EGF gradient and substrate stiffness, perform time-lapse microscopy for 12 h and capture images at a 15-minute time interval. For this time-lapse study, use an inverted microscope equipped with an onstage incubator to maintain 370 C and 5% CO2 (Evos FL Auto, Life Technologies).\nTo quantify the cell motility, use manual cell tracker plugin of Image J (NIH)."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Cancer",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}