{
  "id": 10099,
  "origin_website": "Jove",
  "title": "Microfluidic Tools for Probing Fungal-Microbial Interactions at the Cellular Level",
  "procedures": [
    "NOTE: A summary of the procedures outlined in this protocol are visually depicted in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63917/63917fig02.jpg\nFigure 2: Schematic representation of the presented methodology consisting of five major sections detailed in this protocol. Device designs are created using computer aided design (CAD) software and a master mold manufactured using photolithography (1). This is used to cast poly(dimethylsiloxane) (PDMS), which is then diced into slabs and bonded to glass-bottomed Petri dishes to form the microfluidic devices (2). Microbes to be included in the study are cultured (3) and used to inoculate the devices (4). Interactions are studied using microscopy and quantified using image analysis techniques (5). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63917/63917fig02large.jpg]\n1. Master mold fabrication\nPhotomask production\n\t\nGenerate microfluidic device designs using computer aided design (CAD) software. The dimensions of the presented devices are given in Figure 1 and more details about the specific design features are comprehensively listed in the respective publications40,41.\nExport the CAD design file using an appropriate format (e.g., .dwg, .dxf). Print a film photolithography mask by sending the exported CAD design file to a commercial provider for printing.\nPhotolithography\n\tNOTE: The following steps should be conducted within a dust-free and light-controlled environment, such as a laminar flow hood or clean room facility. The experimental conditions provided here are given as a guide and should be optimised in-house. The authors recommend seeking specific training and consulting established protocols42.\n\t\nPrepare a 100 mm silicon wafer by baking in an oven at 200 °C for 2 h. Spin-coat the silicon wafer with SU-8 2010 photoresist, aiming for a target thickness of 10 µm, using the following conditions: 500 rpm for 10 s (acceleration 100 rpm/s) and 3,000 rpm for 45 s (acceleration 300 rpm/s).",
    "CAUTION: SU-8 photoresist is hazardous, take care when handling and prevent inhalation and contact with skin. It is flammable, potentially carcinogenic and toxic to the environment.\nBake the coated silicon wafer at 95 °C for 2.5 min (soft bake). Expose the photoresist to ultraviolet (UV) light, using the film photolithography mask and an energy dose of 140 mJ/cm2 at 365 nm wavelength using a mask aligner.\nBake the coated silicon wafer at 95 °C for 3.5 min (post exposure bake). Immerse and agitate the silicon wafer in developer solution for 3 min to reveal the microfabricated structures by removing the unexposed photoresist.\n\t\tCAUTION: The developer solution can be flammable, take appropriate precautions when handling and storing.\nRinse with fresh developer solution for 10 s. Rinse with isopropyl alcohol for 10 s and air dry. Use filtered, compressed air to ensure structures are thoroughly dry. Measure the height of the SU-8 structures, for example, using a profilometer.\nSilanize each master mold with 50 µL of chlorotrimethylsilane by applying a vacuum pressure of 50 mbar for 2 h. The authors note that re-silanisation of the master mold was not found to be necessary.\n\t\tCAUTION: Chlorotrimethylsilane is a hazardous substance. Wear appropriate personal protective equipment (PPE) and handle with care. Avoid contact with skin and eyes and prevent inhalation. Keep away from sources of ignition and use in a well-ventilated area.\n2. Device fabrication\nNOTE: The following steps should be conducted within a dust-free environment, such as a laminar flow hood.\nPreparation of poly(dimethylsiloxane) (PDMS) slabs",
    "Prepare approximately 40 g of PDMS by thoroughly mixing the base and curing agent in a 10:1 ratio using a spatula in a clean plastic cup. Degas the mixture to remove all air bubbles by placing the plastic cup containing the PDMS into a vacuum chamber (vacuum pressure = 50 mbar) for 1 h.\nSecure the master mold into a plastic mount using clear tape. Clean using compressed filtered air to remove any dust particles.\n\t\tNOTE: Alternatively, aluminium foil can be shaped around a glass Petri dish, and then used to house the master mold and contain the PDMS43.\nPour the PDMS mixture onto the centre of the master mold, ensuring it is on a level surface, and allow to settle.\n\t\tNOTE: The PDMS mixture should be poured as closely as possible to the surface of the master mold and a continuous flow maintained to minimize the introduction of air bubbles. Air bubbles can be removed by directing compressed air over the bubble or by scooping them out using a fine needle.\nCover the master mold loosely with a plastic lid to prevent dust particles from settling on the surface of the PDMS. Transfer the master mold to an oven and cure overnight at 70 °C.\nRemove the master mold from the oven and allow to cool. Peel the cured PDMS away from the master mold and plastic frame, taking care to avoid damaging the master mold/PDMS.\nPlace clear tape over the microchannels embossed into the PDMS to maintain a dust free surface. Ensure the tape is removed prior to bonding.",
    "Cut the PDMS into slabs (i.e., if multiple devices are included in the design on the master mold, many can be fabricated from a single casting) as designated by the design using a mounted guillotine or razor blade. When cutting the lateral opening of the BFI PDMS slab, ensure that the microchannels are fully open (Figure 1A). For the FFI PDMS slab, ensure each corner is trimmed to enable it to fit into the glass-bottomed Petri dish shown in Figure 1D.\nPunch desired inlet/outlet holes according to the device design. Use a precision cutter to punch inlet holes of 3.18 mm and 4.75 mm for the exemplar BFI and FFI devices, respectively.\nBonding of PDMS slabs to create devices\n\tNOTE: The following washing steps (2.2.1-2.2.2) use an ultrasonic cleaner filled with purified water (ddH2O) at 37 kHz. Washing the PDMS slabs helps to enhance successful bonding44 and reduce the risk of contamination. To manipulate the PDMS slabs, use clean forceps and lift using the inlet holes to avoid damage to the microchannels or device surface.\n\t\nSubmerse the PDMS slabs in 0.5 M NaOH and sonicate for 5 min. Rinse with sterile ddH2O. Transfer PDMS slabs into 70% ethanol solution and sonicate for 5 min. Rinse with sterile ddH20.\nImmerse PDMS slabs into sterile ddH2O and sonicate for 5 min. Remove the PDMS slabs from the sterile ddH2O, dry using filtered compressed air, and place into a sterile square Petri dish.\nPlace the square Petri dish containing the PDMS slabs into an oven at 70 °C for 1 h to dry. Remove from the oven and allow to cool in a dust-free environment. Clear any dust from the surface of the PDMS slabs using tape and/or filtered compressed air.",
    "Activate the surfaces of the PDMS slabs and glass-bottomed Petri dishes to be bonded using a plasma cleaner with the following settings: vacuum pressure 0.75 mbar, power 50%, coating time 1 min. Place the surfaces to be activated (and subsequently bonded) facing upward in the plasma cleaner.\nRemove the PDMS slabs and glass-bottomed Petri dishes from the plasma cleaner and bond by gently placing the activated surfaces into conformal contact with one another. Bond the BFI and FFI PDMS slabs to the 35 mm and 50 mm diameter glass-bottomed Petri dishes (glass thickness 0.17 mm), respectively.\n\t\tNOTE: Take care not to apply too much pressure when bonding, as this can result in collapse of the microchannels.\nCheck for successful bonding by simply trying to pull the PDMS slab off the glass-bottomed Petri dish with tweezers. Visualize the devices by eye or using generic microscopy to ensure no collapse of the inoculation inlets or microchannels.\n\t\t​NOTE: For saturated conditions (i.e., water-saturated and/or nutrient-rich conditions), include step 2.2.7 of the protocol. If water-unsaturated conditions are required, proceed to step 2.2.8. Devices can be filled with water or media.\nFill the devices immediately after bonding by pipetting 100 µL of the desired solution for the BFI device (bacterial inlet and lateral opening) or 30 µL of media into each inlet (60 µL total) for the FFI device. If air bubbles are present, these will dissipate around 10 min after filling as PDMS is porous.\nAdd sterile ddH2O (~100-200 µL) in the Petri dish to maintain humidity.\n3. Microbial culture",
    "NOTE: The following steps provide a general microbiological procedure for fungal and bacterial culture and should be carried out under sterile conditions (i.e., using a flame or microbiological safety cabinet) appropriate for the level of containment required for the desired microbes. Specific examples are given at the end of each section for a species of interest.\nFungal culture\n\t\nPrepare desired culture medium supplemented with agar. Autoclave the medium at 121 °C for 15 min. Allow the medium to cool to 50 °C and pour into 9 cm diameter Petri dishes, maintaining sterile conditions.\nUse a cork borer to remove a 4 mm diameter plug of agar containing mycelium from a fridge stock colony of the desired fungal strain to activate the isolate. This is conducted to ensure standardized and vigorous growth of the fungus prior to device inoculation.\n\t\tNOTE: The microbes can also be activated from a glycerol stock, i.e., fungal isolates stored on agar plugs in 50% glycerol solution at -70 °C41.\nPlace the side of the plug with mycelium in contact with the agar surface in the center of the uninoculated Petri dish. Replace the lid on top of the Petri dish and seal before incubating at the appropriate temperature for the desired strain for the required amount of time, typically, around 3 to 4 days.\n\t\tNOTE: Example culture conditions for Trichoderma rossicum: Malt extract agar, incubated at 25 °C in the dark for 48 h.\nBacterial culture\n\t\nStreak out the desired bacterial isolate from the source stock (e.g., glycerol stock or single colony from the agar plate) onto an agar plate to achieve single bacterial colonies and ensure no contamination45. Seal the plate with film.\nIncubate at a temperature and duration specific to the isolate of interest until individual colonies are observed.",
    "Prepare the desired culture broth. For instance, add 10 g of tryptone, 10 g of NaCl and 5 g of yeast extract per 1 L of ddH2O to prepare LB medium for the culture of B. subtilis. Autoclave the medium at 121 °C for 15 min.\nAllow the medium to cool to room temperature. Add the medium to a sterile culture flask inside a sterile environment.\nTouch a single bacterial colony from the agar plate using a sterile inoculation loop. Transfer the inoculated loop into the sterile culture medium by briefly touching the liquid with the loop.\nSeal the flask using a sterile lid or foil, and place inside a shaking incubator overnight using the settings appropriate for the selected species.\n\t\t​NOTE: Example culture conditions for B. subtilis: i) liquid culture - aerobic growth at 37 °C at 200 rpm in LB medium and ii) plate culture - room temperature on LB agar plate. Refer to the FFI/BFI papers40,41 for further details of culturing different fungal strains.\n4. Device inoculation\nNOTE: The following steps should take place inside a laminar flow hood using sterile equipment.\nFungal inoculation\n\t\nUse a sterilized cork borer (ø = 4 mm) to remove an agar plug from the colony on the periphery of a 3-day-old culture (step 3.1). Ensure that the growing hyphal front remains intact.\nIntroduce the plug into the fungal inlet, mycelium side down, with the growth direction of the hyphal front oriented toward the microchannel openings to encourage hyphal infiltration of the channels.\nRepeat steps 4.1.1-4.1.2 for the second fungal species (if using the FFI device), introducing the plug into the opposite inlet. If using the BFI device, omit this step and continue to step 4.1.4.",
    "Seal the Petri dish with transparent film and incubate at 25-28 °C in the dark until imaging commences. Determine the pre-imaging incubation time depending on the intended biological event to be observed, e.g., fungal-fungal confrontations, and the growth rate of included species within the device.\nBacterial inoculation\n\t\nDilute the bacteria from an overnight culture (step 3.2) in a 1:25 ratio using the same culture medium as detailed in step 3.2.3. Culture for 3 h at 37 °C.\nWash the bacteria by pelleting culture using a centrifuge at 2000 x g for 10 min. Discard the supernatant and resuspend the cells in desired volume of 0.9% w/v sodium chloride solution.\nCentrifuge again to obtain a pellet. Discard the supernatant and resuspend the cells in liquid medium (e.g., C. cinerea minimal medium to an OD600 of 1). Optimize the OD600 value for the bacterial strain in question.\nRemove the BFI device from the incubator and open it in a sterile environment. Pipette 10 µL of suspension into the bacterial inlet.\n\t\t​NOTE: Optimise the exact inoculation timings for the bacterial-fungal interactions in question. For example, introduce bacteria into the BFI device 18 h post-fungal inoculation if using C. cinerea.\nSeal the Petri dish with a transparent film and incubate at 25 °C in the dark until imaging commences. Store the device upright.\n5. Microscopy and image analysis\nMicroscopy\n\tNOTE: The researcher should select the appropriate method of imaging concordant with the nature of the experiment to be conducted, for example, an inverted wide-field epifluorescence or confocal microscopy. A general overview has been provided here, as specific details will depend upon the attributes of the chosen microscopy set up.",
    "Turn on the microscope computer, microscope main body (if applicable), camera, temperature-controlled incubator, and light source(s). Ensure that the microscope has been set up correctly, e.g., Köhler illumination has been correctly applied for even illumination of the sample. Initiate the imaging software package.\n\t\tNOTE: When using a temperature-controlled incubator, it is important to allow the microscope temperature to equilibrate for several hours before starting an experiment.\nMount the microfluidic device into the stage insert. Ensure that the device is well secured, i.e., with tape, to prevent dislodging the device during active stage movement.\nAcquire images of the inoculated devices, e.g., either single-point or time-lapse experiments. Comprehensive imaging specifications relevant to the experiments conducted with the BFI and FFI devices are provided in the respective aforementioned publications40,41.\n\t\tNOTE: Brightfield images were acquired by using phase contrast microscopy to visualize hyphal proliferation through the growth channels using autofocus software and either 10x magnification, 0.30 NA (numerical aperture) or 20x magnification, 0.45 NA objective lenses. Excitation of fluorescent reporter proteins was achieved using a high-power light emitting diode light engine with wavelengths specific to the fluorophore.\nExport images into a suitable format for subsequent image processing. For example, .tiff.\nImage analysis\n\tNOTE: The authors recommend Fiji46 as a tool for image analysis, but other software packages are available. The following are examples of image analyses conducted using Fiji from the presented BFI and FFI device publications. These steps are specific to a Mac and may differ slightly if using a PC.\n\t\nHyphal growth rate measurements\n\t\tNOTE: This method was used in the BFI manuscript40 to measure the growth rates of individual hyphae.",
    "Download, install, and launch Fiji. Import the image sequence from a time-lapse experiment by selecting File > Import > Image Sequence. Locate the folder where the data is stored and select Open. In the Sequence Options window, select Preferences, and then OK.\nSelect the Straight Line icon from the main tool bar. Position the beginning of the straight line at the tip of the growing hyphal tip by clicking and then concomitantly dragging the cursor to another point within the window. A yellow line will appear with three boxes indicating the beginning, mid-point, and end of the line.\nMove to the next frame in the image sequence by pressing and holding Ctrl and >. Position the end of the straight line at the tip of the growing hypha by selecting and dragging the square box to the correct position.\nPress and hold Ctrl and M to measure the length of the line in pixels. A Results window will appear with the measured data. Define the data displayed in the Results window as follows: click on the Results window, and then select Results > Set Measurements.\nMove to the next frame in the image sequence by pressing and holding Ctrl and then >. Position the beginning of the straight line at the tip of the growing hypha by selecting and dragging the square box to the correct position.\nPress and hold Ctrl and then M to measure the length of the line in pixels. A Results window will appear with the measured data.\nRepeat steps 5.2.1.5-5.2.1.6 until finished measuring the growth of the hypha in pixels.",
    "Select all of the data in the Results window. Copy and paste into another software programme, e.g., a spreadsheet, to process the data. Plot the hyphal growth (in pixels or micrometres) as a function of time and calculate the average growth rates. Perform at least three biological replicates per experiment.\nFluorescence intensity measurements\n\t\tNOTE: This method was used in the FFI publication41 to assess the change in fluorescence intensity in hyphae of Fusarium graminearum 8/1-wt-GFP upon contact with Clonostachys rosea 016 as a function of time.\n\t\t\nDownload, install, and launch Fiji. Import image sequence from a time-lapse experiment by selecting File > Import > Image Sequence. Locate the folder where the data is stored and select Open. In the Sequence Options window select Preferences and then OK.\nSpecify a region of interest (ROI) to measure the absolute fluorescence intensity of a hypha using the rectangular tool, located in the main tool bar. The size of the square can be defined exactly as follows: Edit > Selection > Specify; the ROI can also be saved for future reference in the ROI Manager by selecting Edit > Selection > Add to Manager.\nMeasure the absolute fluorescence intensity (mean gray value) within the defined ROI for each image in the entire image sequence or stack as follows: Image > Stacks > Measure Stack. The Results window will open automatically once all of the images in the stack have been processed.\n\t\t\tNOTE: The data displayed in the Results window can be defined as follows: click on the Results window and then select Results > Set Measurements. Ensure that Mean Gray Value has been selected.",
    "Select all of the data in the Results window. Copy and paste into another software programme, e.g., a spreadsheet, to plot the absolute fluorescence intensities of the specified ROI as a function of time.\nRepeat steps 5.2.2.2-5.2.2.4 to collect absolute fluorescence intensity measurements for each ROI, i.e., on the hypha of interest, next to the hypha of interest or within the corresponding control channel.\nCalculate the appropriate relative fluorescence intensities in arbitrary units (AU), e.g., by dividing the absolute fluorescence intensity of the ROI [hypha of interest] by the absolute fluorescence intensity of the ROI [control channel]. Consult the FFI publication41 for more specific details.\nPerform at least three biological replicates per experiment and plot the relative fluorescence intensities as a function of time.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}