{
  "id": 4876,
  "origin_website": "Bio",
  "title": "Locomotor Coordination Assay in Rats",
  "procedures": [
    "Motor coordination is assessed 21 days (P28) after HI insult [see Vannucci et al. (1999) for a description of HI protocol] as modified by us (Ferrari et al., 2010). Briefly, pregnant Wistar rat dams at gestational age E17 are housed in 12 h light-dark cycle with ad libitum access to food and water. The day of birth is postnatal day 0 (P0) and on P1 the litters are culled to 10 pups per dam and randomly mixed amongst dams to yield 20 pups per experiment. On day P7 all pups are removed from dams, weighed, sexed and randomly assigned to a group: sham- or HI-treated. They are then anesthetized and the left carotid artery isolated and permanently ligated. Sham pups are only anesthetized, an incision is made, immediately sutured and the wound cleaned without any further manipulation. Upon recovery, pups are returned to dams for 90 min and then they are removed and exposed to 8% oxygen for 90 min at which point they are returned to dams.Bar holding test and wire mesh ascending testAt P21 the pups are weaned and randomly separated into 5 pups per cage. All behavioral training and testing is carried between 8 am and 4 pm, and pups are brought to the testing room at least 30 min prior to the motor evaluations in order to minimize stress-related confounds. Each pup is trained 5 times per day for 3 consecutive days prior to each one of the two tests. On the day of testing, each test is performed with five separate trials per animal with a resting time of 5 min between trials.",
    "For the bar holding test, the pups spend their resting time in their home cage and for the wire mesh ascending test, the pups spend their resting time in the enclosed platform at the top of the mesh. All pups are placed back in their original cages immediately after each training and testing event. Bar holding test As previously described by Tchekalarova et al. (2005) and slightly modified by Ferrari et al. (2010) and Infante et al. (2013), pups are allowed to grasp a wooden bar of 1cm in diameter and 30 cm long that is suspended 50 cm above a padded soft surface. The time spent on the bar grasping bar with forelimbs is measured for a maximum of 120 sec. Results shown are an average of the 5 recordings per pup (Sham, n=11; HI, n=23). This assay addresses motor coordination and function impairment.Wire mesh ascending test As previously described (Tchekalarova et al., 2005; Thonhoff et al., 2007; Ferrari et al., 2010; Infante et al., 2013), a pup is placed at the bottom of a mesh and the time that it takes a pup to ascend the mesh is measured for up to 120 sec. The 1 cm thick plastic mesh is 45 cm long and 15 cm wide and is placed at an angle of 70° in contact with an elevated enclosed platform at the top and a padded soft surface at the bottom. As a stimulus to ascend, the littermates are placed on the enclosed platform above and allowed to acclimatize to the surroundings for 5 min before testing. Results shown are an average of the 5 recordings per pup (Sham, n=19; HI, n=25). This assay addresses both motor coordination impairment and social drive."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}