{
  "id": 11805,
  "origin_website": "Jove",
  "title": "Spontaneous Murine Model of Anaplastic Thyroid Cancer",
  "procedures": [
    "The animal procedures described here were performed with the approval of the Animal Ethics Committee of West China Hospital, Sichuan University, Chengdu, Sichuan, China.\n1. Induction of TBP mice\nIdentify mice genotype\n\t\nAt around 3 weeks, separate the female mice from the male mice. At the same time, use ear tag clamp to fix an ear tag. Place the ear tags in the lower half and on the middle third of the ear, making sure to avoid the area with the highest concentration of capillaries.\nGently but securely restrain the mice. Grasp firmly at the base of the mouse tail. Place the mice on a surface that will allow them to grip.\nGently but firmly place the free hand over the shoulders, then quickly grasp the scruff of the neck between the thumb and forefinger. Hold the tail with the little finger.\nSwab the tail with alcohol. Use sterile scissors to snip the skin sample <5 mm and put it into a clean sample container with a label. It is not necessary to remove the fur of the mice. Compress the tail with sterile sponges to attain hemostasis.\nNext, lyse the murine tail and perform polymerase chain reaction (PCR) to identify the genotype.\n\t\tNOTE: After cutting one murine tail, the surface of the scissors must be wiped with alcohol cotton to avoid mutual contamination of genes between murine tails. After placing them in their cage, the mice must be watched for 5 min to look for any signs of bleeding at the wound site. Refer to Table 1 for the list of primers and the PCR settings used in this study.\nTamoxifen-induced TBP mice",
    "Weigh 0.3 g of tamoxifen and dissolve it in 15 mL of corn oil by ultrasound (power = 20%, duration = 20 min, temperature = 4 °C), at a concentration of 20 mg/mL. Store at 4 °C.\n\t\tNOTE: Tamoxifen is sensitive to light and needs to be placed in a brown container.\nAt around 8 weeks, weigh the mice with electronic scales and give them an i.p. injection of tamoxifen at a dose of 150 mg/kg, administered twice with a 1 week interval.\n2. Dissection and imaging of mouse thyroid tumors and metastatic tumors\nPreparation\n\t\nPrepare the dissection tools: sterile scissors and forceps, sterile blade, 75% alcohol spray bottle, 20 cm straightedge, vernier calipers, paper towels, and alcohol cotton.\nMouse tissue fixing solution: prepare 4% paraformaldehyde tissue fixing solution.\nClean a 10 cm dish filled with about 10 mL of sterile phosphate buffered saline (PBS) for temporary tissue storage, and wash the blood on the surface of the tissue.\nThyroid extraction\n\t\nEuthanize the mice with carbon dioxide at a flow rate of 2.0 L/min for 5 min. Remove the mice from the cage and perform cervical dislocation.\nPlace the mouse on the dissecting board with the ventral side facing up and the head away from the experimenter, and fix the limbs on the dissecting board with sterile syringe needles. For a more convenient removal of thyroid tissue, use another sterile syringe needle to fix the head.\nDisinfect the neck with three alternating rounds of a chlorhexidine or povidone-iodine scrub followed by 75% alcohol. Then, make a small incision above the center of the clavicle with sterile scissors and forceps.",
    "Continue the incision midline up to the mouth. Find the submandibular gland and remove it to expose the anatomical location of the thyroid, which is placed near the thyroid cartilage and trachea.\nFind the thyroid, carefully dissect the thyroid from the rest of the neck region with sterile scissors, then put the removed thyroid in a 10 cm dish filled with 10 mL of sterile PBS.\n\t\tNOTE: During removal of the thyroid gland, be gentle and slow and avoid cutting the neck blood vessels. If the neck vessels are cut, the neck will be immediately filled with blood, and the blood must be promptly removed with alcohol sponges to expose the anatomical location of the thyroid. Before removing the thyroid tissue, carefully observe the characteristics of the left and right lobes of the thyroid (size, shape, etc.) to avoid being unable to distinguish between the left and right lobes of the thyroid after removal.\nIn sterile PBS, remove the blood from the surface of the thyroid tissue with sterile scissors and carefully cut off the trachea. Then, put the thyroid tissue on a sterile cloth, and measure the size of the left and right lobes of the thyroid gland with vernier calipers.\nDivide the left and right lobes of the thyroid gland into two parts with a sterile blade. Put one part into 2 mL of 4% paraformaldehyde solution for fixation, and put the other part into liquid nitrogen for preservation.\nExtraction of lung and liver\n\t\nDisinfect the abdomen with three alternating rounds of a chlorhexidine or povidone-iodine scrub and 75% alcohol. Then, pinch just above the mouse's penis and make a small incision, cut along the midline of the abdomen to the subclavian bone, and expose the abdominal cavity.",
    "Find the liver in the upper part of the abdomen and carefully remove it. Place the liver into sterile PBS.\nCarefully cut the diaphragm along the ribs to expose the thoracic cavity. Next, grab hold of the sternum and pull up to widen the space even more. Find the lung and remove it. Put the removed lung into sterile PBS.\nGrossly observe whether there are metastases in the lung and liver. Count the number of metastases and take a digital record. After that, use a sterile blade to divide the lung and liver tissues into two parts. Put one part into 3 mL of 4% paraformaldehyde solution for fixation and another part into liquid nitrogen for preservation.\nTissue dehydration\n\t\t\nPut the tissues into the dehydration box. Put the dehydration box into the basket at gradient alcohol dehydration as follow: 70% alcohol for 1 h; 80% alcohol for 1 h; 95% alcohol for 30 min; 95% alcohol for 30 min; anhydrous ethanol I for 30 min; anhydrous ethanol II for 30 min; xylene I for 20 min; xylene II for 20 min; paraffin wax I for 30 min; paraffin wax II for 1 h; paraffin wax III for 30 min.\nEmbed the wax-impregnated tissues in the embedding machine.\n\t\t\nPut the melted wax into the embedding frame first. Before the wax solidifies, remove the tissue from the dehydration box and put it into the embedding frame, then attach the label.\nAllow the wax to cool at -20 °C on the freezing table. After the wax solidifies, remove the wax block from the embedding frame and trim it.",
    "Place the trimmed wax block on a paraffin slicer, set at a thickness of 5 µm and a size of 2 cm x 2 cm. After sectioning, allow the sections to float on a spreader with warm water at 45 °C to flatten the tissue. Pick up the tissue with a slide, and bake the slices in an oven at 65 °C for 2 h.\nAfter the water dries and the wax melts, remove the slide with the tissue and use it for hematoxylin and eosin (HE) and immunohistochemical (IHC) staining16. Make sure that the sections are adhered to the slides for staining.\n3. HE staining of the primary tumor and lung\nDewaxing\n\t\nPut the slides with the sections in xylene for 10 min.\nMove into anhydrous alcohol (100%) (two bottles) for about 3 min each.\nMove into 95% alcohol (two bottles) for about 3 min each.\nMove into 80% alcohol for about 3 min.\nMove into 50% alcohol for about 3 min.\nMove into the tap water, and wash away the alcohol for about 1 min.\nStaining\n\t\nMove the slides into hematoxylin for 8 min.\nMove the slides into the water for 1 min to wash away the hematoxylin; the tissue changes from blue to red.\nMove the slides into 1% hydrochloric acid alcohol for about 30 s.\nMove the slides into the water, washing for 5 min.\nMove the slides into eosin for 90 s, then wash them with water for 5 min.\nMove the slides into 50% alcohol, 80% alcohol, 95% alcohol (two bottles), and anhydrous alcohol (100%) (two bottles), for 1 min each.\nMove the slides into xylene for 5 min.\nAfter the slides are dry, seal them with neutral resin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}