{
  "id": 8312,
  "origin_website": "Jove",
  "title": "A Common Marmoset Model of Mother-Infant Intervention for Breastfeeding Disorders in the Presence of Paternal Inhibition and Maternal Neglect",
  "procedures": [
    "This study protocol was approved by the Institutional Animal Care and Use Committee of Saitama Medical University (2476).\n1. Animals\nHouse a pair of parents with their first-time infants of common marmosets (Callithrix jacchus) who have no experience raising any infants in a light-sealed incubated cage sized according to their welfare guidelines, maintaining constant temperature (25-30 °C), and a 12 h light/dark cycle). Set light intensity per cage at 750-930 lx during the light period and 0 lx during the dark period. Ensure that the parents are healthy with respect to feeding and cleaning.\n2. The diagnosis of underweight and parental infant-rearing abnormality\nRefer to the general diagnosis and intervention flows visualized in Figure 1 (A: Infant, B: Mother). When the infant is found to be underweight, choose intervention methods for the infant based on the presence or absence of five infant behaviors (crying, clinging to mother, head control, routing reflex, sucking) and for the mother based on the presence or absence of five maternal behaviors (the will to feed, breast enlargement, infant's sucking acceptance, milk secretion, and pain expression).\n\t​NOTE: Take care throughout to not cross-contaminate the animals' scent.\n3. Animal characteristics\nGestational age at birth\n\t\nMake a note of the common marmoset's full-term gestation period of approximately 140-150 days. This compares to the human standard full term 17.\nBirth and developmental weight\n\t\nAge and sex definition\n\t\t\nAs a day-old notation, define birthdays as postnatal day 0 (PD 0). Define the sex of the infant by examination of external genitalia.\nIdentification of congenital malformations or diseases\n\t\t\nExamine the infant to identify any congenital malformations or diseases, paying particular attention to those that might cause feeding difficulties (e.g., cleft palate).\nBody weight measurement",
    "Weigh the infant daily using a scale with 0.1 g increments to check their feeding volume. Prepare a clean plastic box or bowl lined with soft tissue paper to hold the infant and maintain its body temperature during weighing. Tare the prepared box or bowl on the scale, place the infant in the prepared container, and record the body weight. Weigh daily at approximately the same time to compare with the standard 15,16.\nBody weight gain graph\n\t\t\nVisualize a graph of body weight gain per day. The weight at birth and on the second day is expected to be more than 27 g and to then increase by approximately 1 g per day according to the colony records of neonatal infants' weight required for survival (Figure 2).\nAssessment of milk intake volume\n\t\t\nAssess milk intake volume by weighing the infant both before and after feeding. However, be aware that separating the infant from the parent for weighing may itself cause stress and interfere with nurturing behavior. If normal breastfeeding and growth are expected, reduce weight measurements to once daily for the first week.\nCrown, rump, and length measurement (CRL)\n\t\t\nMeasure CRL by laying the infant flat in the prone position against a ruler and determining the length from the top of the head to the base of the tail (Supplemental Figure S1).\nBreastfeeding behavior of the infant\n\t\nConfirm that the infant is performing four behavioral patterns (Figure 1A).\n\t\t\nDetermine whether the infant is clinging to the mother's body sufficiently.\nObserve whether the infant's head is bent forward to the mother's body by its own whole body muscle tension.\nNote whether the infant explores and reaches the mother's nipple by itself as a human sucking \"routing\" reflex with some parental help.\nVocalizing a phee call11,12 loudly when separated from its parents.",
    "Mother's breastfeeding behavior and function\n\t\nConfirm these behavior patterns and functions in the mother (Figure 1B).\n\t\t\nConfirm the mother's cooperative acceptance of the newborn for breastfeeding.\nConfirm that when the mother's breast becomes taut, the mother encourages the infant to suckle, and then the breast becomes less taut and the teat protrudes.\nSupport the mother's breastmilk secretion by pressing the breast side with the fingers (Figure 3A). Check that the breast tension is not too hard and is without engorgement.\n\t\t\tNOTE: Wear soft and thick cowhide gloves to prevent the mother from biting and hold the mother using the nondominant hand.\nObserve the mother's expression and look for signs of pain as the cause of her refusal of the infant suckling.\nFather's parenting behavior\n\t\nObserve the father's parenting behavior. Observe whether the father is carrying the infant excessively and interfering with nursing. The father's assistance to carry the infants is usually limited.\nIntervention targeting both the mother and infant to reestablish spontaneous breastfeeding\n\t\nWhen an underweight infant ( less than 27 g ) is found, observe the family relationship and search for any abnormal parental infant-rearing behavior. Potential parental abnormal behaviors pose a high risk of harming the infant or interfering with feeding (abuse) or abandonment of feeding (neglect).\nWhen the infant is too weak to explore or cling to the mother and initiate nursing by itself, separate it from the mother and give it a minimal amount of formula (e.g., 0.5 mL of Lebens Haihai, Wakodo at two-thirds concentration) by oral syringe, as needed based on body weight (Figure 1A,B).",
    "As the first intervention step aimed at the mother, soften the hardened nipple area by pressing and massaging in three steps from the areola base toward the nipple between fingers to open the milk duct (Figure 3B). Exude milk slightly from the teat for the odor to encourage the infant to explore.\nNext, hold the mother's body softly and lay the infant near the mother's breast to encourage it to search for the mother's nipple (Figure 1C). Guide the mother to raise her arms to improve nipple access for the infant. After the infant finds the nipple, continue the breast massage to assist with milk secretion. Confirm that the mother's breast is relieved of pressure, likely relieving the pain and the teat is protruding.\nDuring the intervention, provide occasional handling and build rapport with the family.\nRepeat this intervention one or more times per day until the mother voluntarily allows feeding and the infant learns to suck spontaneously. When the infant's feeding is inhibited by the father, remove the father from the family until the infant's development improves.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}