{
  "id": 15280,
  "origin_website": "Jove",
  "title": "Generating Transgenic Plants with Single-copy Insertions Using BIBAC-GW Binary Vector",
  "procedures": [
    "1. Inserting Sequences of Interest into Binary Vector\nPrepare the Gateway Entry and binary vectors.\nIsolate the Gateway Entry vector containing a DNA fragment or gene of interest using a mini-prep kit according to the suggestions of the supplier.\n\t\tNOTE: BIBAC-GW vectors require the use of kanamycin (Km) for selection in bacteria, therefore, use an Entry vector with another resistance marker instead of kanamycin. For instance, the pENTR-gm vector, carrying a Gentamicin resistance gene, is a good choice12.\nPropagate and isolate the BIBAC-GW vector of interest. Use an E. coli strain that is resistant to the toxicity of the ccdB gene present within the Gateway cassette. Isolate BIBAC-vectors using protocols or kits specifically designed for large plasmids according to the suggestions of the supplier.\nCarry out a Gateway reaction.\nPrepare the LR recombination reaction according to the suggestions of the supplier. Mix the following components in a 1.5 mL microcentrifuge tube at room temperature (RT): 100–300 ng Entry clone (supercoiled), 300 ng of BIBAC-GW vector, LR Clonase reaction buffer (final concentration: 1x). Adjust the volume of the mixture to 16 µL with TE (10 mM Tris, 1 mM of EDTA, pH 8.0). Finally, add 4 µL of LR Clonase enzyme mix, and mix by vortexing. Incubate the mixture at 25 °C for 1 h.\nTerminate the LR reaction by adding 2 µL of Proteinase K solution (2 µg/µL) to the mixture prepared in step 1.2.1. Mix and incubate at 37 °C for 10 min.\nTransform E. coli with the Gateway reaction mixture by electroporation.\nDesalt the LR reaction mixture prior to electroporation.\n\t\tNOTE: This step is critical for successful electroporation. Below a dialysis method is described, but other methods such as precipitation with sodium acetate and ethanol can also be used.",
    "Prepare the setup for filter dialysis of the LR reaction. Pour 20 mL of ultrapure deionized water into a sterile Petri dish. Place a membrane filter disk (pore size = 0.025 µm) on the water surface.\nPipette the entire LR reaction carefully on top of the membrane and allow the mixture to dialyze at RT for 1 h.\nAdd 5 µL of the desalted LR mix to electro-competent DH10B cells in an electroporation cuvette (0.1 cm). Electroporate the cells (1.5 V/cm, resistance 200 Ω, capacitance 25 µF), and immediately add 1 mL pre-warmed Super Optimal Catabolite repression (SOC) medium to the cells, followed by incubation at 37 °C for 45 min, 180 rpm. (SOC medium, 1 L: 20 g of Bacto tryptone, 5 g of Yeast extract, 0.5 g of NaCl, 2.5 mL of 1M KCl, 20 mL of 1 M filter-sterilized Glucose).\n\t\tNOTE: DH10B cells can be substituted for other E. coli cells that stably maintain large plasmids.\n\t\tNOTE: The optimal electroporation conditions are dependent on the electroporation device used.\nPellet bacteria at maximum speed for 30 s using a microcentrifuge, remove excess SOC, and resuspend the pellet in approximately 50-100 µL of Luria-Bertani (LB) medium. Spread the bacteria on kanamycin-LB (Km-LB) plates (Km concentration, 40 µg/mL), and incubate the plates at 37 °C overnight. (LB medium, 1 L: 10 g of Bacto tryptone, 5 g of Yeast extract, 10 g of NaCl. For solid medium add agar, 15 g/L).\nIdentify the recombined BIBAC-GW derivatives and isolate plasmid DNA.",
    "To be able to grow on Km-LB plates, the E. coli cells should contain the recombined BIBAC-GW plasmid in which the ccdB sequence is substituted with the desired insert. Use colony Polymerase Chain Reaction (PCR)15 to check if the bacteria colonies on the plate contain the correct plasmids, having the BIBAC-GW backbone and the insert of interest.\n\t\t\nTo identify the pBIBAC-BAR-GW backbone, perform a PCR15 reaction with the primers DM1969 5'-GCGACGAGCCAGGGATAG-3' and DM1970 5'-ATCAGTGCGCAAGACGTGAC-3'. This primer set amplifies a 563 bp fragment of the bar gene.\nTo check for the presence of the BIBAC-RFP-GW backbone, perform a PCR15 reaction, using primers M737 5'-CGTGTAAAAAGCTTAGACTG-3' and M892 5'-AACAGATGGTGGCGTCCC-3'. This primer combination amplifies a 791 bp fragment overlapping the cruciferin promotor and rfp sequence.\nPerform PCR15 reactions using gene-specific primers to check for the presence of the insert of interest.\nInoculate a single positive colony in 2–5 mL of LB medium containing kanamycin (40 µg/mL) for DNA isolation16. Incubate at 37 °C on an orbital shaker at 180 rpm, overnight.\nIsolate the plasmid DNA (see step 1.1.2).\n2. Preparation of A. tumefaciens for Floral Dipping of Arabidopsis\nTransform BIBAC-GW derivatives to A. tumefaciens.\nPrepare electro-competent cells of A. tumefaciens strain C58C1 carrying the pCH32 helper plasmid7. Grow bacteria in the presence of tetracycline (5 µg/mL) and rifampicin (100 µg/mL) to select for pCH32 and ensure growth of only Agrobacterium cells.\nAdd 0.25–0.5 µg DNA of a pBIBAC-GW derivative, pre-dissolved in 10–20 µL sterile ultrapure deionized water, to 20 µL competent Agrobacterium cells in electroporation cuvettes (0.1 cm). Keep cells on ice.\nElectroporate the cells (1.5 V/cm, resistance 400 Ω, capacitance 25 µF). Immediately after electroporation, add 1 mL pre-warmed (28 °C) SOC medium to the bacteria and incubate the cells at 28 °C for 60–90 min.",
    "Spread 100 µL and the rest of the bacteria on separate LB plates containing rifampicin (100 µg/mL), tetracycline (5 µg/mL), and kanamycin (40 µg/mL), and incubate in the dark at 28 °C for 1-2 days.\nPrepare the Agrobacterium suspension.\nCheck by PCR a couple of the A. tumefaciens colonies from the plate prepared in step 2.1.4, for the presence of the correct vector (see step 1.4.1).\nStreak a single colony confirmed to contain the binary vector with the appropriate insert on an LB plate containing antibiotics (see step 2.1.4). Grow at 28 °C overnight.\nRepeat the streaking with a single colony obtained in step 2.2.2.\nInoculate a single colony in 2.5 mL of LC medium supplemented with antibiotics (see step 2.1.4) for preculture. Incubate at 28 °C for at least 8 h or overnight, at 180 rpm. (LC medium, 1 L: 10 g of Bacto tryptone, 5 g of Yeast extract, 0.5 g of NaCl, 2.5 g of MgSO4 · 7H2O, 2 g of Maltose).\nAdd the preculture from step 2.2.4. to 250 mL LC supplemented with antibiotics (see step 2.1.4) and grow at 28 °C, at 180 rpm, overnight.\nPellet the culture by spinning at 5,500 x g for 12 min. Re-suspend the pellet in 100 mL solution containing 5% sucrose, 0.05% Silwet L-77, 0.5x MS. Pour the suspension into a sterile container for floral dipping of the plants.\n3. Arabidopsis Transformation\nPrepare the Arabidopsis plants for transformation.\nGrow Arabidopsis plants in a greenhouse or climate controlled growth chamber until they are flowering (12 pots with 9 plants each per dipping).\nClip the first bolts to allow more secondary bolts to emerge. Plants are ready for dipping 4–6 days after clipping, when the plants have many immature flower heads and not many fertilized siliques.\nFloral dipping",
    "Dip inflorescences for 5–10 s in Agrobacterium suspension prepared in step 2.2.6. Use gentle agitation.\nWrap the above-ground parts of the plants in cling film to keep the humidity high, and cover the plant pots with a box to keep the plants in the dark. Incubate the plants for 2 days in a greenhouse/growth chamber.\nRemove the box and the cling film and grow the plants to maturity in a greenhouse/growth chamber.\n\t\tNOTE: To increase the efficiency of transformation, the same plants can be re-dipped 7 days after the first dipping.\nHarvest the seeds. Pool and analyze the seeds (T1) of plants, transformed with the same construct, as a single set.\nScreen for transgenic plants.\nTo screen for transgenic plants transformed with a pBIBAC-RFP-GW derivative, analyze the seeds using fluorescence microscopy. In order to detect DsRed expression in seed coats, image the seeds at an excitation of 560 nm and emission of 600–650 nm. Separate the fluorescent seeds from non-fluorescent counterparts using forceps.\nTo screen for transgenic plants transformed with a pBIBAC-BAR-GW derivative, sow the seeds in trays filled with soil (~2,500 seeds/0.1 m2). To ensure an even spreading of seeds over trays, suspend seeds in 0.1% agar in 0.5x Murashige Skoog medium (MS), and spread the seeds using a 1 mL pipette.\n\t\tNOTE: To stimulate the seeds to germinate in a synchronous manner, incubate the seeds for at least 2 days at 4 °C. This can be done before or after sowing the seeds.\n\t\t\nSpray the seedlings with 0.5% Glufosinate-ammonium solution 2 weeks and 3 weeks after sowing in trays. Use 500 mL of Glufosinate-ammonium solution per 1 m2.\nTransfer surviving seedlings to individual pots. A typical image of a tray with seedlings before and after (second) Glufosinate-ammonium treatment are shown in Figure 3.",
    "Analyze the Glufosinate-ammonium-resistant plants by PCR for the presence of the construct of interest (see step 1.4.1. for primers).\n\t\t\t\nIsolate the genomic plant DNA for PCR using the method described by Edwards et al.17\n4. Characterizing Transgenics for the Number and Integrity of T-DNA Integrations\nStrategy of restriction digestions\n\tNOTE: Determine the number of T-DNA integrations and their integrity by DNA blotting using restriction enzymes. This method allows to identify single, but also repeated integrations at the same or different loci in the genome.\n\t\nUse a series of restriction digestions to identify the different integration patterns possible:\n\t\t\nSelect an enzyme that cuts once in the middle of the T-DNA, to be able to independently probe sequences upstream and downstream of the restriction site (Figure 4A and Figure 7A-C). See Figure 4A, and the figure legend for the expected results and interpretation.\nSelect an enzyme or combination of enzymes cutting out the entire sequence of interest at once (Figure 4B and Figure 7A-D). Any deviation from the known length indicates truncation of the integrated cassette.\n\t\t\tNOTE: Take care to only use restriction enzymes that are not sensitive to cytosine methylation.\nPrepare the genomic DNA samples.\nIsolate the genomic DNA from plants carrying the construct of interest. A CTAB DNA miniprep method can be used for DNA isolation18. For DNA blot analysis of Arabidopsis DNA, 2–2.5 µg of genomic DNA is needed. Dissolve the DNA in 50 µL of TE.\nCheck the DNA integrity by gel electrophoresis16. Intact genomic DNA migrates as one discrete band at the top of the gel. DNA degradation can be recognized as the presence of a smear. To avoid DNA damage due to repeated freezing-thawing, genomic DNA samples are kept at 4 °C.",
    "Digest the genomic DNA (2–2.5 µg in the case of Arabidopsis genomic DNA) in a total volume of 50 µL, overnight, using buffer conditions suggested by the enzyme supplier.\n\t\t\nIn a test tube, mix 2–2.5 µg of Arabidopsis genomic DNA, 5 µL 10x restriction buffer, and 5 U restriction enzyme in a total of 50 µL ultrapure deionized water.\nAdd loading dye (1x final concentration) to the restriction samples before loading on a gel. For good visual tracking, use one of the following: comigrating with small fragments (Bromophenol blue, 350–400 bp), or comigrating with larger fragments (Cylene cyanol, 3–4 kbp).\nRun the DNA gel.\nPrepare a long (20 cm) 0.5x TBE agarose gel19. The percent of agarose in the gel depends on the fragment sizes expected. 0.8–1% optimally separates fragments >1 kb in size. Use 1–1.5% agarose for fragments <1 kb. Do not add Ethidium Bromide to the gel. (5x TBE, 1 L: 54 g of Trizma base, 27.5 g of Boric acid, 3.75 g of EDTA).\n\t\tNOTE: To prevent DNA contamination, use gel trays that are not used to fractionate plasmid and PCR amplified DNA.\nLoad the samples on gel19.\nAdd DNA markers to the gel that are in the size range of the expected fragments. Load approximately 1 µg of marker (50-250 ng of different sized fragment) on the gel to allow visualization by UV light.\nSize-fractionate the DNA at a low voltage (40–50 V/500 mA) overnight.\nPrepare for transfer of the DNA from the agarose gel to the nylon membrane.\nTransfer the gel to a separate tray, and stain it for 20–25 min in 0.5x TBE containing Ethidium Bromide (5 µg/mL) by rotating at 40 rpm on an orbital shaker.",
    "Visualize the gel on a UV transilluminator. Verify the size separation of the genomic DNA, including visibility of discrete satellite bands (Figure 5A). A smear towards lower molecular weight sizes indicates DNA degradation.\nOn the UV transilluminator, lay a transparency over the gel, and mark the position of the slots and the marker bands with a marker pen (Figure 5B). This will facilitate determining the size of the hybridized fragments later in case the marker sequences do not hybridize specifically with the probe DNA. By indicating the marker fragments at this step, it is possible to track the size of the hybridizing fragments.\nPlace the gel back into the tray, rinse with ultrapure deionized water, and submerge it in 0.25 M HCl for 15 min to fragmentize the DNA within the gel. Wash with ultrapure deionized water. Use enough HCl and water to cover the gel in the tray, and rotate the tray with the submerged gel at 40 rpm on an orbital shaker.\nIncubate the gel in Denaturation buffer for 30 min. Wash with ultrapure deionized water. Use enough buffer and water to cover the gel in the tray, and rotate the tray with the submerged gel at 40 rpm on an orbital shaker. (Denaturation buffer: 0.5 M NaOH, 1.5 M NaCl).\nIncubate the gel in Neutralization buffer for 30 min. Wash with ultrapure deionized water. Use enough buffer and water to cover the gel in the tray, rotate the tray with submerged gel at 40 rpm on an orbital shaker. (Neutralization buffer: 0.5 M Tris, 1.5 M NaCl, 220 mM HCl, pH 7.6).\nTransfer the DNA to a nylon membrane.",
    "Prepare the setup for capillary transfer of the genomic DNA. Place a plastic plate (approximately the size of the gel or bigger) over a tray filled with 20x saline-sodium citrate (SSC). Fold a piece of thick filter paper over the tray, so that both of its ends are hanging in the SSC. Cut a gel-sized piece of positively charged nylon membrane Hybond N+, and 2 pieces of thick filter paper. (20x SSC: 3 M NaCl, 0.3 M Sodium Citrate).\nPrepare the blotting setup (Figure 6) by placing the gel, slots down on the top of the filter paper on the plastic plate. Place a Hybond N+ membrane on top, followed by 2 layers of filter paper. Pre-wet each layer in 20x SSC before adding them to the assembly. Make sure to remove any air bubbles in between layers as these impede the DNA transfer.\nCover the assembly with a thick layer of tissue paper. Place a plastic plate with a weight, such as a small bottle, on top. Make sure the pressure is equally divided over the gel. This will ensure proper transfer of the DNA.\n\t\tNOTE: The weight should be about 200–300 g; heavy weights hamper the DNA transfer.\nCover the area surrounding the assembly, including exposed filter paper, with cling film (Figure 6) to avoid evaporation of the 20x SSC buffer and target the capillary forces towards the nylon membrane. Blot overnight.\nMark the position of the slots, name, and/or date on top of the membrane with pencil, and remove the membrane from the assembly. Note that the bottom side that has been in contact with the gel, carries the DNA.\nImmediately fix the DNA to the membrane by UV irradiation (2,400 µJ/m2) using a UV Crosslinker.\n\t\tNOTE: Crosslinking conditions depend on the type of membrane used.",
    "NOTE: At this point the membrane can be stored at -20 °C and used for hybridization with a probe later. Rinse the crosslinked membrane in 2x SSC and seal it in pre-folded heat-sealable polyethylene tubing before placing it at -20 °C.\nPrepare the probe for hybridization.\nAmplify the sequence to be used as the probe for DNA blotting by PCR20. 50-100 ng of a 250 bp-2 kbp PCR fragment is used as a probe. Two separate probes, one hybridizing to the Right border proximal region and the other to the Left border proximal region of the T-DNA, can be used to assess the presence of the entire T-DNA (Figure 4A and Figure 7).\nDilute 50-100 ng of PCR product in 24 µL of ultrapure deionized water in a test tube.\nDenature the diluted PCR product by boiling it for 5 min in a beaker of water or heat block, then cool directly on ice.\nThaw premade GCT-mix on ice. (GCT-mix: dGTP, dCTP, dTTP (all 0.5 mM), random hexamers 43.2 ng/µL, Acetylated BSA 1.33 mg/mL, 33 mM of β-mercaptoethanol, 0.67 M Hepes, 0.17 mM Tris pH 6.8, 17 mM MgCl).\nAdd 21 µL of the GCT-mix and 2 U of Klenow fragment to the PCR product.\nAdd 2 µL of [32P]ATP to the mix and incubate at 37 °C for 1 h.\n\t\tCAUTION: All steps involving [32P]ATP need to be carried out in an environment designated for radioactive work while using the appropriate protection.\n\t\tNOTE: Make sure the [32P]ATP is fresh (not more than 1 half-time has passed).",
    "Prepare a Sephadex G-50 (coarse or medium) column21 for purifying the labeled probe from unincorporated (radioactive) nucleotides. Take a 2 mL syringe, and cover the outlet with a small circle of thick filter paper. Add 2 mL of Sephadex G-50 dissolved in TE into the syringe, and remove all liquid from the column by spinning.\nPlace the column into a 15 mL plastic tube, load the labeled probe on the column, and spin at room temperature (set the centrifuge at 750 x g, allow the rpm to increase until 750 x g is reached, then stop the centrifuge and allow the rotation to decline to 0 x g) to elute the probe. Add 200 µL of TE to the column and spin to elute the remaining probe; repeat once. In these conditions, labeled DNA fragments are excluded from the Sephadex matrix and elute, while free nucleotides remain in the column.\nUse 300 µL of the labeled probe per hybridization tube. Keep the remaining labeled probe at -20 °C for later usage. However, keep the half time of [32P]ATP in mind.\nHybridize the DNA blot.\nHeat 2x SSC and Hybridization buffer (15 mL per hybridization tube, maximum of 2 blots per tube) to 65 °C. (Hybridization buffer: 10% dextran sulphate, 1% SDS, 1 M NaCl, 50 mM Tris pH 7.5, dissolve at 65 °C, keep aliquots at -20 °C).\nPre-heat the hybridization oven to 65 °C.\nPlace nylon mesh in a tray with a little bit of heated (65 °C) 2x SSC to cover the tray. Place the DNA blot on top of the mesh, with the DNA side up. Roll the blot together with the mesh and insert the roll into a hybridization tube. Pour off the excess 2x SSC.",
    "In a microcentrifuge tube, boil 150 µL of Salmon Sperm DNA (concentration 10 mg/mL) per hybridization tube for 5 min (see also step 4.6.3). Cool immediately on ice and add to the pre-heated Hybridization buffer.\nAdd the Hybridization buffer-Salmon Sperm solution to the tube with the blot. Pre-hybridize at 65 °C for at least 1 h in a rotating wheel, at 12 rpm.\nWhen the pre-incubation in step 4.7.5. is almost finished, boil 300 µL of the labeled probe for 5 min (see also step 4.6.3) and add immediately to the blot after the incubation.\nHybridize overnight in the rotating wheel at 63 °C, 12 rpm. Do not pipette the probe directly on the blot, but into the Hybridization buffer-Salmon Sperm solution.\nWash the blot.\nPreheat the washing solutions (1x SSPE, 0.1% SDS and 0.1x SSPE, 0.1% SDS) to 65 °C. (20x SSPE: 3 M NaCl, 230 mM NaH2PO4, 20 mM EDTA, pH 7.0).\nDispose the hybridization solution and add about 100–150 mL of 1x SSPE, 0.1% SDS solution to the hybridization tube, close the tube, and rotate by hand. Pour the hybridization and washing solution in the appropriate liquid radioactive waste.\nAdd about 100–150 mL of 1x SSPE, 0.1% SDS solution to the tube, close, and incubate the tube for 15 min at 63 °C in the rotating wheel, 12 rpm. Discard the washing solution appropriately.\nAdd about 100–150 mL of 0.1x SSPE, 0.1% SDS solution to the hybridization tube, close, and rotate the tube for 5 min at 63 °C, 12 rpm. Discard the washing solution appropriately.",
    "Take the blot out of the tube and place it in a tray containing sufficient preheated 0.1x SSPE, 0.1% SDS, and shake for 3 min in a shaking water bath at 65 °C. Meanwhile, rinse the mesh in a tray filled with water.\nTake the blot out, place it in between pre-folded plastic (polyethylene tubing), carefully wipe excess liquid off, and let the blot dry briefly. Note that liquid will ruin the phosphorimager screen.\nSeal the blot in plastic on the three sides. Remove all excess liquid surrounding the blot and close the plastic tube by sealing the fourth side. Cut off the surplus of plastic. Make sure the sealed blot is not leaking and that the plastic is dry on the outside.\nExpose the phosphorimager screen.\nPlace the sealed blot in a phosphorimager cassette, with the phosphorimager screen facing the DNA side of the blot. Close the cassette and leave for ± 2–4 days, depending on the strength of the radioactive labeling and sensitivity of the phosphorimager.\nScan the phosphorimager screen using a phosphorimager. Take care to expose the screen as little as possible to light before scanning. Save the image. Erase the screen from signal by exposing it to bright light.\nAnalyze the blot.\nThe analysis depends on the restriction strategy used in step 4.1. When analyzing the blot prepared according to the strategy shown in step 4.1.1.1 (Figure 4A), count the number of the fragments detected. In this strategy, the number of hybridized fragments refers to the number of T-DNA integrations.\n\t\t\nCompare the number of the fragments detected with a probe for the left (Figure 7B) and the right (Figure 7C) part of the T-DNA.",
    "NOTE: If a different number of hybridizing fragments is detected, then either i) multiple T-DNA copies (either in inverted or direct orientation) or ii) incompletely integrated T-DNAs are present.\nEstimate the sizes of hybridized fragments on the blot based on the size of the marker bands, and compare the sizes of hybridized fragments with the expected fragment sizes calculated based on the restriction strategy of tandem insertions (Figure 4A) to identify possible tandem arrangement of the T-DNAs. Use the Figure 4A as a guide to calculate the size of expected fragments.\n\t\t\tNOTE: If the size of hybridized fragments does not agree with calculated ones, then most likely one of the integrations present is not complete.\nWhen analyzing the blot prepared according to strategy shown in step 4.1.1.2 (Figure 4B), estimate the size of the hybridizing fragment on the blot based on the size of marker bands, and compare it with the expected size. An intact insertion yields a single fragment with a defined length. Any deviation of the expected length indicates incomplete integration (Figure 7D).\nStrip the blot for re-hybridization (optional).\n\tNOTE: The same blot can be hybridized consecutively with different probes. Before continuing with a new probe, strip a previous hybridized probe from the blot.\n\t\nTo remove the probe from the blot, place the blot in a tray with its DNA-side facing down. Pour a surplus of 0.5% SDS into the tray. Boil the membrane for 2–5 min. The duration of the treatment depends on the size and GC-content of the probe used. Longer and GC-richer probes need a longer treatment.\nAfter stripping, hybridize the blot with another probe, or seal and store at -20 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}