{
  "id": 12045,
  "origin_website": "Jove",
  "title": "Using Human Induced Pluripotent Stem Cells for the Generation of Tumor Antigen-specific T Cells",
  "procedures": [
    "1. Culturing Human iPSCs (hiPSCs) on Mouse Embryonic Fibroblasts (MEF)\nNOTE: Alternative methods for culturing hiPSCs can also be used, including but not limited to: seeding onto a 6 well plate pre-coated with gelatin, a gelatinous protein mixture, recombinant laminin 511, or any other extracellular matrix used in hiPSC expansion, and cultured using defined media specially formulated for human pluripotent stem cell culture.\nCulturing MEF\nCoat a 10 cm cell culture Petri dish with 4 mL of 0.1% gelatin and incubate for 30 min at 37 °C.\nThaw a vial of 4 x 106 irradiated MEF quickly into 10 mL of 37 °C MEF media (DMEM + 10% FBS + 1x penicillin-streptomycin + 1x L-glutamine supplement). Centrifuge at 300 x g for 5 min at 4 °C. Aspirate the supernatant and resuspend the cell pellet in 9 mL of MEF media.\nRemove the gelatin-coated dish from the incubator. Aspirate gelatin and add 7 mL of MEF media. Plate 3 mL of MEF suspension (from step 1.1.2) onto the gelatin-coated dish. Rock the dish side-to-side and front-to-back to ensure even distribution of MEF over the dish. Incubate at 37 °C for 8-36 h.\nPassaging hiPSC on MEF\n\tNOTE: The data was generated using MART-1 iPSC derived from long-term cultured melanoma TIL, which specifically recognize MART-1 peptide in the context of HLA-A*02:01, as previously described18. \n\t\nPassage hiPSCs when colonies are between 0.8 - 1.2 mm in diameter. Prior to passaging, check hiPSC colonies in a stereo-microscope and remove any areas of differentiation from the culture using the plastic edge of a 200 µL tip.\nAspirate spent media and add 10 mL hiPSC media (human ES culture media [Table of Materials] + 10 ng/mL human basic fibroblast growth factor [hbFGF]) supplemented with 10 μM ROCK inhibitor.",
    "Hold the cell culture dish in one hand and roll a disposable cell passaging tool across the entire dish in one direction. Apply enough pressure so that the entire roller blade touches the culture dish and maintain a uniform pressure during rolling action.\nRotate the culture dish 90° and repeat step 1.2.3. View the plate in the microscope to visually confirm proper cutting of the colonies, which should appear checkered. Detach cut colonies by gentle mechanical flushing using a 200 μL pipette. \nNOTE: Detachment of cut colonies by mechanical flushing must be done immediately after cutting colonies with the roller, because after 3 min the cut colonies will start to reattach to the dish, and it will become difficult to detach colonies of homogeneous size by flushing.\nTransfer 350 - 600 clumps of cut colonies onto a new 10 cm dish of MEF (plated 8 - 36 h prior to hiPSC passaging) with 10 mL of fresh hiPSC media supplemented with 10 μM ROCK inhibitor. Incubate at 37 °C.\nNOTE: 600 clumps represents approximately 1.0 x 106 MART-1 iPSC and will yield 0.5-1.0 x 106 DP cells on day 35. However, expected numbers will vary depending on the potency of the starting cell line and culture conditions.\nThe following day, aspirate spent media and add 10 mL of fresh hiPSC media. Change hiPSC media every 1-2 days depending on hiPSC growth rate.\n2. Preparation of OP9/DLL1 Cells for Co-culture with hiPSCs\nCulture OP9/DLL1 cells in OP9 media [α-minimum essential medium (α-MEM) + 20% fetal bovine serum (FBS) + 1x penicillin-streptomycin] at 37 °C. When OP9/DLL1 cells reach confluency, aspirate media and wash once with 5 mL of 1x magnesium, calcium, and phenol red-free phosphate buffered saline (PBS).",
    "Aspirate PBS and add 2 mL of 0.05% Trypsin-EDTA.  Incubate for 5 min at 37 °C. Then, add 4 mL of OP9 media and mechanically dissociate the cell layer by pipetting to make a single-cell suspension.\nTransfer the cell suspension into a 50 mL conical tube through a 100 μm cell strainer to avoid cell clumps. Centrifuge at 300 x g for 5 min at 4 °C. Aspirate the supernatant and resuspend in 12 mL of OP9 media. \nAdd 8 mL of OP9 media to each of six new 10 cm cell culture Petri dishes. Plate 2 mL of OP9/DLL1 cell suspension from step 2.3 onto each new 10 cm dish. Rock the dish side-to-side then front-to-back to ensure even distribution of OP9/DLL1 over the dish.\nIncubate at 37 °C. Repeat passage every 2 - 3 days when cells reach confluency.\nNOTE: It is important to make enough frozen stock of OP9/DLL1 cells and thaw a new stock every 4-6 weeks.\n3. In Vitro Differentiation of hiPSCs into CD8αβ+ Single Positive (SP) T Cells\nPrepare gelatinized OP9/DLL1 dishes one week prior to co-culture with hiPSCs. To prepare 0.1% gelatin solution, add 5 mL of room temperature (RT) tissue-grade stock gelatin solution to 500 mL of PBS.\nCoat 3 new 10 cm cell culture Petri dishes by adding 4 mL per dish of 0.1% gelatin.  Incubate 30 min at 37 °C. \nAspirate gelatin and add 8 mL of OP9 media to each dish. Passage one confluent dish of OP9/DLL1 (as done in section 2 above) to three gelatin pre-coated dishes.\nAfter 4 days, add 10 mL of OP9 media to each 10 cm dish of OP9/DLL1 on gelatin, for a total of 20 mL of media per dish.",
    "After 7 - 8 days, begin the hiPSC co-culture on OP9/DLL1 confluent dishes (differentiation day 0).\nAspirate spent media from confluent 10 cm dish of hiPSCs on MEF. Add 10 mL of OP9 media. Cut and detach hiPSC colonies using a disposable cell passaging tool as done in steps 1.2.3 and 1.2.4.\nTransfer 350 - 600 clumps of cut colonies onto a 10 cm pre-gelatinized OP9/DLL1 dish (step 3.1) with 10 mL of fresh OP9 media using a 200 μL pipette. Rock the culture dish side-to-side then front-to-back to ensure even distribution of colonies.\n\t\tNOTE: Alternatively, pre-formed hiPSC embryoid bodies (EBs) or small clump suspension may be used.  However, the use of a disposable cell passaging tool or EB formation system is preferred to produce hiPSC clumps of uniform size.\nOn day 1, aspirate spent media and replace with 20 mL of fresh OP9 media. hiPSC clumps co-cultured on OP9/DLL1 for 1 day will appear as small round monolayer colonies (Figure 1).\nOn day 5, aspirate 10 mL of spent media and add 10 mL of fresh OP9 media. hiPSC colonies will begin to differentiate into primitive mesoderm, which is characterized by a multilayered dark center.\nOn day 9, aspirate 10 mL of spent media and add 10 mL of fresh OP9 media. At this point, multilayered center structures will evolve into dome-like shapes, and a peripheral network-like area will start to become evident.\nOn day 13, harvest hematopoietic progenitor cells (HPCs) (Figure 1). hiPSC-derived structures on day 13 are characterized by a dark central organoid surrounded by a network of dome-like areas, representative of hematopoietic zones (HZs) previously reported to enclose human embryonic stem cell-derived hematopoietic progenitors21.",
    "NOTE: The presence of the dome-like structures indicates a successful process even in the absence of dark centers. The inability to produce HPCs may be due to poor quality of OP9/DLL1, quality of FBS lot, confluency of iPSC clumps seeded onto OP9/DLL1 (350-600 clumps is optimal), and/or variations in potency of iPSC lines to produce hematopoietic precursors.\n\t\nAspirate spent media and wash 1x with 5 mL of 1x phenol red-free Hanks' balanced salt solution modified with calcium and magnesium (HBSS). \nAspirate HBSS and add 250 μL of 5000 Units/mL collagenase IV in 10 mL of HBSS. Incubate at 37 °C for 45 min. Aspirate HBSS with collagenase IV and wash once with 5 mL of PBS.\nAspirate PBS and add 5 mL of 0.25% Trypsin-EDTA. Incubate at 37 °C for 20 min. Then, add 4 mL of OP9 media and dissociate the cell layer by pipetting to make a single-cell suspension.\nTransfer the cell suspension into a 50 mL conical tube through a 100 μm cell strainer.  Centrifuge at 300 x g for 5 min at 4 °C. Aspirate the supernatant and resuspend in 10 mL of OP9 media. \nPlate cell suspension onto a new gelatinized 10 cm cell-culture Petri dish (see steps 3.1.1 and 3.1.2). Incubate at 37 °C for 45 min. Then, collect non-adherent cells by gentle pipetting.\nTransfer collected cell suspension into a 50 mL conical tube through a 100 μm cell strainer.  Centrifuge at 300 x g for 5 min at 4 °C. Aspirate the supernatant and resuspend in 10 mL of differentiation media [OP9 media with 5 ng/mL human stem cell factor (hSCF), 5 ng/mL human Flt3 ligand (hFLT3L), and 5 ng/mL human interleukin 7 (hIL-7)].\nPlate the cell suspension onto a new 10 cm OP9/DLL1 confluent dish. \nOn day 16, passage the cells.",
    "Mechanically detach non-adherent cells by gentle pipetting and filter through a 100 μm cell strainer. Centrifuge at 300 x g for 5 min at 4 °C. Aspirate the supernatant and resuspend in 10 mL differentiation media.\nPlate the cell suspension onto a new 10 cm OP9/DLL1 confluent dish. \nContinue passaging non-adherent cells every 5-7 days thereafter by repeating step 3.8.\nOn day 35, enrich CD4+CD8+ double positive (DP) population and stimulate to produce CD8αβ+ SP T cells (Figure 2).\nMechanically detach non-adherent cells by gentle pipetting and filter through a 100 μm cell strainer to remove cell clumps. Enrich CD4+ cell population by CD4 magnetic bead isolation according to the manufacturer’s protocol.\n\t\tNOTE: The rationale for using CD4 magnetic beads is to remove CD4-CD8- DN cells from the culture, as these have been demonstrated to cause direct killing of CD4+CD8+ DP cells after stimulation22.\nCount live CD4 enriched cells using a Neubauer hemocytometer and Trypan blue dye.  Suspend in OP9 media at total concentration 0.5 x 106 cells/mL. Aliquot 1 mL of the cell suspension (0.5 x 106 cells) into each well of a tissue culture flat bottom 24 well plate of confluent OP9/DLL1.\nAdd 100 IU human interleukin 2 (hIL-2), 5 ng/mL hIL-7, 500 ng/mL anti-human CD3 antibody, and 2 μg/mL anti-human CD28 antibody, then culture at 37 °C.\nOn day 4 - 7 after stimulation, collect cells for molecular analysis (Figure 3) or co-culture with peptide-pulsed antigen presenting cells (APCs).\n4. Measuring Antigen Specificity of hiPSC Derived CD8αβ+ SP T Cells",
    "NOTE: The type of APCs to be used for this experiement is dependent on the MHC restriction of hiPSC-derived T cells. Here, T2 cell line is used, which is a hybrid of T and B lymphoblastoid cell lines. T2 cells express HLA-A*02:0123, which is recognized by JKF6 cells from which MART1-iPSC was derived18. This T2 cell line can be expanded in RPMI 1640 + 20% FBS + 1x penicillin-streptomycin and is passaged when cells reach a density of 5 x 105 cells/mL.\nCount live HLA-A*02:01+ T-B hybrid lymphoblastoid T2 cells using a Neubauer hemocytometer and Trypan blue dye. Incubate APCs in 24 well tissue culture plate with 1 μg/mL MART-1 peptide for 2 h at 37 °C.  \nNOTE: Optimal peptide concentration is variable, depending on cell line and antigen specificity.\nCollect APCs and wash 2x with 10 mL of PBS to remove any extra peptide.\nCount APCs and suspend at 2 – 5 x 105 cells/mL in OP9 media with 100 IU IL-2 and 5 ng/mL IL-7. Aliquot 100 μL of cell suspension (2-5 x 104 cells) into each well of an ultra-low attachment U bottom 96 well plate or directly into a pre-coated ELISpot plate.\nSort hiPSC-derived CD8αβ+ SP T cells (1 week after anti-human CD3/CD28 antibody stimulation) using a cell sorter and suspend at 1 x 106 cells/mL in OP9 media with 100 IU IL-2 and 5 ng/mL IL-7. Aliquot 100 μL of cell suspension (1 x 105 cells) into each well of APCs and culture for 16 - 20 h at 37 °C.\nAfter 16 - 20 h, analyze the cytokine secretion profile by ELISpot assay per the manufacturer's protocol (Figure 4)."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}