{
  "id": 3014,
  "origin_website": "Cell",
  "title": "Protocol for monitoring and analyzing single nucleotide incorporation by S.&nbsp;cerevisiae RNA polymerases",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrepare quench-flow (QF)\nTiming: 15 min\nThis step describes how to prepare the QF (Figure 4[href=https://www.wicell.org#fig4]) for use.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2557-Fig4.jpg\nFigure 4. Diagram of the quench-flow (QF) loaded with reaction components required for single nucleotide addition time course\nTurn on 25°C water bath and QF instrument.\nReplace the 18 MΩ water from the quench drive syringe with 1 M HCl using 10 mL syringes.\nLower drive platform to contact the drive syringes.\nExchange the residual 18 MΩ water in the quench line for 1 M HCl.\nSet all valves to FIRE.\nInput any reaction time into the QF keypad. We choose 0.005 s because it is a short reaction time. Move the 8-way valve to the reaction loop indicated upon input of reaction time into the QF computer.\nPosition an empty 1.5 mL collection tube at the end of the exit loop to collect expelled reaction solution.\nPress GO on the keypad.\nCollect four more identical reactions in the same 1.5 mL tube and discard.\nSet drive valves to LOAD and EC/NTP valves to FLUSH.\nAttach vacuum to EC and NTP flush lines.\nWash each reaction loop and sample loops with ≈ 500 μL 18 MΩ water and then ≈ 500 μL MeOH.\nNote: For each QF wash step, allow the system to dry for 30 s.\nWash EC and NTP sample loops through their respective ports with 1 mL syringes loaded with ≈ 1 mL 18 MΩ water and then ≈ 1 mL MeOH.\nAssemble elongation complexes (ECs)\nTiming: 1.5 h\nThis step describes how to assemble ECs in vitro (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2557-Fig5.jpg\nFigure 5. Schematic of elongation complex (EC) assembly\nThaw DTT (20 mM), BSA (2 mg mL-1), RNA:DNAt, DNAnt (10 μM), heparin (1 mg mL-1), and ATP on ice.",
    "Note: Thaw the RNA:DNAt stock by immersing it deeply into ice. It is imperative that the RNA:DNAt is not allowed to warm above 4°C because the Tm of the hybrid is low until bound by the Pol. See problem 2[href=https://www.wicell.org#sec7.3] in troubleshooting[href=https://www.wicell.org#troubleshooting] for more details.\nWhile frozen reagents are thawing, label 1.5 mL tubes required for one time course.\nFour mix tubes: EC mix, NTP mix, label mix, and chase mix.\nEighteen QF collection tubes: two time zeroes and 16 time points.\nEighteen dye tubes: two time zeroes and 16 time points.\nAliquot 40 μL of bromophenol blue loading dye into each tube.\nStore these tubes at −20°C until time course collection.\nAdd 18 MΩ water to EC mix tube and place on ice. The volumes in the recipes below are sufficient to collect 18 time points.\ntable:files/protocols_protocol_2557_20.csv\nOnce reagents are thawed, add 10 × buffer A, DTT, and BSA to the EC mix tube.\nAdd RNA:DNAt to the EC mix tube and mix by pipetting.\nImmediately return the RNA:DNAt to the −20°C freezer.\nAdd Pol fraction to the EC mix tube, mix by pipetting, and leave on ice for 10 min.\nImmediately return the Pol fraction to the −20°C freezer.\nOnce 10 min have elapsed, move the EC mix tube to a tube rack for a 20 min incubation at ≈ 20°C.\nOnce 20 min have elapsed, add DNAnt and mix by pipetting. Incubate at ≈ 20°C for 40 min.\nNote: After starting the 40 min DNAnt incubation, continue to the next steps.\nRemove α-32P-CTP from −20°C freezer to thaw at ≈ 20°C behind plexiglass shielding.",
    "Critical: From this point onwards, radioactive materials are involved, proceed with caution. Those handling radioactive materials should follow all radiation safety guidelines for their institution. Ensure that workspaces are covered in bench protectors and plexiglass shielding is in place. Individuals should use PPE (gloves, lab coat, closed-toed shoes, and safety goggles). While working with α-32P-CTP, use a Geiger counter to monitor for radioactive spills. Following the completion of the experiment, conduct a wipe test of all relevant areas and equipment.\nPrepare NTP, label, and chase mixes\nTiming: 15 min\nThis step describes how to assemble the remaining mixes for the in vitro experiment.\nPrepare NTP mix and place on ice.\ntable:files/protocols_protocol_2557_21.csv\nPrepare label mix and place on ice.\nAdd α-32P-CTP once thawed.\nOnce α-32P-CTP is added, place label mix on ice behind plexiglass shielding.\ntable:files/protocols_protocol_2557_22.csv\nPrepare chase mix and place on ice.\ntable:files/protocols_protocol_2557_23.csv\nCollect time course using QF\nTiming: 1 h\nThis step describes the labeling and chasing of ECs, loading of the mixes into the QF, and time course collection using the QF (Figure 4[href=https://www.wicell.org#fig4]). Each reaction time is entered by the individual. The following steps describe the collection of an example Pol I time course, (0, 0, 0.005, 0.007, 0.01, 0.02, 0.03, 0.04, 0.05, 0.1, 0.2, 0.3, 0.4, 0.5, 1, 2, 6, 10) s.\nLabel ECs with α-32P-CTP. This step allows elongation competent ECs to extend the 9-mer RNA to a radiolabeled 10-mer RNA.\nContinuing from step 15, once 40 min incubation with DNAnt has elapsed, transfer 29.5 μL of label mix to the EC mix tube. Mix by pipetting.\nAllow labeling reaction to occur for 10 min behind plexiglass shielding at ≈ 20°C.\nWhile labeling is ongoing, place NTP mix at ≈ 20°C.",
    "After 10 min, add 29.5 μL of chase mix to the EC mix to stop the labeling reaction. Mix by pipetting.\nCollect time zero reactions by mixing radiolabeled EC mix with 1 × buffer A.\nInput 0.005 s into QF keypad. Based on the QF calibration, it will denote what reaction loop to use. Move the 8-way valve to that loop.\nNote: The purpose of the time zero reaction is to gage the amount of starting 10-mer RNA following EC labeling, therefore, the specific time input into the keypad is irrelevant. We choose to use 0.005 s because it is a short reaction time.\nLoad EC mix into the QF.\nRemove vacuum.\nTransfer EC mix to a 1 mL syringe via a P1000 pipette.\nNote: Remove any bubbles from the syringe by gently tapping the syringe and moving the syringe plunger back and forth.\nAttach the syringe to the EC port, set EC valve to LOAD, and inject EC solution up to the ferrule going into the 8-way valve.\nSet EC valve to FIRE.\nLoad 1 × buffer A opposite of the EC mix in the QF in the NTP port.\nTransfer ≈ 200 μL of 1 × buffer A to a 1 mL syringe via a P1000 pipette.\nAttach the syringe to the NTP port, set NTP valve to LOAD, and inject 1 × buffer A up to the ferrule going into the 8-way valve.\nSet NTP valve to FIRE.\nSet drive syringe valves to FIRE.\nPosition the time zero collection tube at the end of the exit loop to collect expelled reaction solution.\nPress GO on the keypad.\nCollect reaction solution and place collection tube aside at ≈ 20°C.\nClean the reaction loop and sample loops.\nMove all drive valves to LOAD and EC/NTP valves to FLUSH.",
    "Attach vacuum.\nWash reaction loop and sample loops with ≈ 500 μL 18 MΩ water and then ≈ 500 μL MeOH to dry.\nAdd equalizing 1 M HCl (varying volumes depending on calibration, see Table 1[href=https://www.wicell.org#tbl1] for an example) to the collection tube containing the reaction solution. Mix by pipetting.\ntable:files/protocols_protocol_2557_24.csv\nAdd 115 μL neutralization buffer to the collection tube. Mix by pipetting.\nTransfer 20 μL to its labeled dye tube containing pre-aliquoted 40 μL bromophenol blue loading dye. Leave dye tube at ambient room temperature until the full time course is collected.\nCollect the second time zero reaction.\nRemove vacuum.\nSet EC valve to LOAD and inject EC solution up to the ferrule going into the 8-way valve.\nSet EC valve to FIRE.\nSet NTP valve to LOAD and inject 1 × buffer A up to the ferrule going into the 8-way valve.\nSet NTP valve to FIRE.\nRepeat previous steps 21 d–21 k.\nCollect individual time points (0.005–10) s by mixing radiolabeled EC mix with NTP mix.\nClear 1 × buffer A from the QF.\nSet NTP valve to LOAD and inject remaining 1 × buffer A solution into the sample loop.\nRemove empty syringe.\nLoad ≈ 500 μL 18 MΩ water into a 1 mL syringe and inject it through the NTP port to clean the NTP sample loop. Repeat with ≈ 500 μL of MeOH.\nRandomly select the next time point, enter the reaction time into the keypad, and move the 8-way valve to designated reaction loop.",
    "Note: To ensure that the time course is not influenced by a time bias, we randomize the collection order of time points (0.005–10) s. As the same EC mix and NTP mix are used to collect the entire time course, it is possible that the EC mix or NTP mix may change over the duration of the experiment (e.g. proportion of elongation competent ECs). Therefore, we collect each time course in triplicate with randomized time points. In our experience, there is no evidence of EC/NTP mix aging when the time course is collected in < 2 h.\nLoad NTP mix into the QF.\nRemove vacuum.\nTransfer NTP mix to a 1 mL syringe via a P1000 pipette.\nAttach the syringe to the NTP port, set NTP valve to LOAD, and inject the NTP solution up to the ferrule going into the 8-way valve.\nSet NTP valve to FIRE.\nInject EC mix up to the 8-way valve.\nSet EC valve to LOAD and inject the EC mix up to the ferrule going into the 8-way valve.\nSet EC valve to FIRE.\nCollect time point.\nSet drive syringe valves to FIRE.\nPosition the collection tube at the end of the exit loop.\nPress GO on the keypad.\nCollect reaction solution and place collection tube aside.\nClean reaction loop as described for time zeros (step 21 h).\nAdd equalizing 1 M HCl (varying volumes depending on calibration, see Table 1[href=https://www.wicell.org#tbl1] for an example) to the collection tube containing the reaction solution. Mix by pipetting.\nAdd 115 μL neutralization buffer to the collection tube. Mix by pipetting.\nTransfer 20 μL to its labeled dye tube.\nRepeat the following steps for the remaining time points.\nRemove vacuum.",
    "Randomly select the next time point, enter the reaction time into the keypad, and move the 8-way valve to designated reaction loop.\nInject the NTP mix up to the ferrule going into the 8-way valve.\nSet NTP valve to FIRE.\nRepeat steps 22 d–22 i.\nOnce the full time course is collected, store dye tubes at −20°C.\nClean QF.\nRefill EC and NTP drive syringes with 18 MΩ water.\nWash EC and NTP sample loops through their respective ports with a 1 mL syringe loaded with ≈ 1 mL of 1 M NaOH. Repeat with ≈ 1 mL of 18 MΩ water and then ≈ 1 mL of MeOH.\nWash quench drive syringe with 18 MΩ water and store in 18 MΩ water.\nExchange the residual HCl in the quench line for 18 MΩ water.\nWash each reaction loop with 1 M NaOH, 18 MΩ water, and MeOH.\nTurn off 25°C water bath, vacuum, and QF instrument.\nGel electrophoresis and imaging\nTiming: 2 days\nThis step describes how to separate RNAs by PAGE and how to visualize the gel via phosphor imaging.\nPAGE separation of RNAs.\nPour 28% acrylamide gel.\nPrepare running buffers.\nAnode buffer is 1 × TBE.\nCathode buffer is 1 M NaOAc in 1 × TBE.\nSet up gel rig with the polymerized gel and running buffers (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2557-Fig6.jpg\nFigure 6. 28% acrylamide gel electrophoresis set up\nUse a syringe with a needle tip to evict any bubbles from the bottom of the plates submerged in the cathode buffer.\nAttach a heat dispersion plate to the back of the gel plates.\nAttach temperature probe to the front of the gel plates.\nHeat dye tubes at 95°C for 5 min.",
    "While heating samples, remove comb from the gel and use a syringe with a needle tip to evict residual urea from each well.\nLoad 15 μL bromophenol blue loading dye in well 1 and 20.\nLoad 15 μL of each sample in wells 2–19.\nReturn samples to −20°C for storage.\nRun gel at 50°C and 50 W until the dye front reaches the bottom of the heat dispersion plate.\nBreak down gel.\nTurn off power.\nRemove heat dispersion plate, temperature probe, and anode/cathode leads.\nUse a Geiger counter to evaluate if either the anode or cathode buffer is radioactive.\nIf they are, extract the radioactive buffer with a syringe into a shielded container and then rinse the gel rig with deionized water in the sink.\nIf they are not, rinse the gel rig with deionized water in the sink.\nNote: Please see radioactive waste handling and regulations for your location.\nRemove gel plates from the gel rig.\nSeparate the gel plates, revealing the gel.\nTransfer the gel to a piece of Whatman filter paper.\nWrap with plastic wrap, ensuring full coverage. Any radioactive liquid will render the phosphor screen unusable.\nClean gel area.\nUse a Geiger counter to scan all gel equipment and bench area.\nRinse gel plates, spacers, and comb in deionized water and store.\nExpose gel to phosphor screen.\nBlank phosphor screen on a white light box for 10 min.\nPlace plastic wrapped gel in a phosphor cassette and place the freshly blanked phosphor screen on top.\nClose the cassette and place on a flat surface for exposure.",
    "Note: Our standard exposure time is (12–18) h. If for any reason the gel needs to be exposed for a shorter or longer duration, re-blank the screen and re-expose the gel. We determined that image quality improves over longer exposures, but after 72 h, the quality does not change.\nScan phosphor screen with the GE Typhoon or equivalent.\nScan phosphor screen using the Phosphor Imaging mode.\nSave a ∗.gel file for further analysis."
  ],
  "subjectAreas": [
    "Chemistry",
    "Protein Expression And Purification",
    "Protein Biochemistry",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}