{
  "id": 10456,
  "origin_website": "Jove",
  "title": "A Reliable and Reproducible Critical-Sized Segmental Femoral Defect Model in Rats Stabilized with a Custom External Fixator",
  "procedures": [
    "The rats used in this study received daily care in accordance with the AVMA Guidelines for the Euthanasia of Animals: 2013 Edition16. The Institutional Animal Care and Use Committee at the University of Wisconsin-Madison evaluated and approved this experimental protocol before the project began.\n1. Animals\nUse the outbred Sprague-Dawley male rats weighing approximately 350 g.\n2. Preparation of Bone Morphogenetic Protein-2 (rhBMP-2) soaked sponge scaffolds\nNOTE: Scaffold preparation should occur just before implantation in the femur (see Step 6.14).\nFollow manufacturer instructions for the use of an established rhBMP-2 bone graft kit containing a collagen sponge, lyophilized rhBMP-2, and sterile water for reconstitution17. Maintaining sterility, reconstitute the rhBMP-2 with the sterile water to a concentration of 1.5 mg/mL.\nUsing sterile scissors and a sterile ruler, trim the rhBMP-2 soaked collagen sponge to reshape to fit a 5 mm x 3 mm x 3 mm defect.\nUsing a syringe, distribute the rhBMP-2 solution evenly over the collagen sponge so that it is absorbed.\n3. Preparation of custom external fixation device\nNOTE: See Figure 1A for the more complete listing of dimensions.\nCut aluminum sheet stock (type 6061, 0.088” thickness) to two pieces (1.4” x 6”) using a jigsaw or other appropriate tool.\nMount one piece in the milling machine and, using a 1/8” 90°-point carbide drill mill, cut four 'V' grooves (0.035” deep) lengthwise. Leave the other piece free of cuts.\nCut individual plates of 0.3” width from the two pieces (Figure 1B). Measure and drill screw holes for 4-40 thread. Tap plate with ‘V’ grooves with the 4-40 thread. Drill the plate without grooves for a #4 screw body drill.\nSand both pieces to round corners and reduce weight (Figure 1C).",
    "Screw pieces together with 4-40, 18-8 stainless steel button head cap screws (0.25”) so that grooves are flush against the plain plate (Figure 1D)\n4. Anesthetic procedure and analgesia\nInduce anesthesia by placing the rat in induction chamber delivering 4 L O2/min with 4% isoflurane.\n\tCAUTION: Research personnel must avoid inhalation of anesthetic gas and maintain proper hood and ventilation in the laboratory.\nRemove the rat from the chamber after the rat loses righting reflex, attach a nose cone and place at the maintenance dose of anesthesia through the nose (O2 delivery rate to 2-3 L/min and 0.8% isoflurane).\nPlace the rat on the heating pad or under the warming light to prevent hypothermia.\nConfirm the adequate depth of anesthesia by pinching the toe or testing the palpebral reflex.\nApply lubrication to eyes to prevent drying out of the cornea.\nDeliver a subcutaneous injection of extended-release buprenorphine (1 mg/kg) on the trunk/dorsum of the rat, far from the surgical site, to provide analgesia for up to 3 days following surgery.\n5. Aseptic preparation and antibiotic preventatives\nShave area around hindleg using the 13th rib, the foot, the dorsal midline, and the ventral midline as margins.\nScrub shaved area using sterile 2 x 2 gauze soaked with 10% povidone-iodine followed by 70% EtOH (4 times each, alternating).\nAdminister an intramuscular injection of cefazolin (20 mg/kg) into the operative quadriceps.\nAdminister enrofloxacin (0.25 mg/ml) in drinking water for 7 days postoperatively for continued antibiotic protection.\nPlace rats on medicated feed (e.g., Uniprim) for the duration of the study to prevent pin tract infections.\nApply double antibiotic ointment to the skin-pin interface once daily for 3 days postoperatively.\n\tNOTE: Avoid any external fixation pin or clamp loosening which can contribute to the development of an infection.\n6. Surgical procedure",
    "NOTE: Make a concerted to effort to maintain a sterile field and workspace and follow sterile technique throughout the entirety of the case.\nExtend shaved leg through fenestrated, clear sticky drape and cover surgical bench in sterile towels to create a sterile field.\nPalpate the femur and use a #15 blade to create an anterolateral incision through the skin extending from the patella to the greater trochanter at the proximal femur.\nCarefully incise the lateral leg fascia along the intermuscular septum to separate the vastus lateralis muscle of the quadriceps anteriorly from the hamstrings posteriorly until the lateral femur is exposed. Preserve the abductor gluteal tendon insertion on the greater trochanter.\nPerform a careful, atraumatic circumferential soft tissue dissection and expose the femur at its mid-diaphysis starting on the lateral surface. To do this, use a #15 blade to gently cut the muscle away from the underlying bone by keeping the blade parallel against the contour of the bone surface. Use a periosteal elevator to lift the muscle away from the exposed bone as it is dissected and proceed around the femoral shaft until 7-10 mm of central diaphysis has been cleared of soft tissue on all sides to prepare for ostectomy.\n\tNOTE: Avoid injury to the medial femoral neurovascular bundle.\nInsert four 1.0 mm Kirschner (k) wires: 2 proximal and 2 distal in the femur perpendicular to the lateral femur, directed straight lateral to medial. Ensure all pins engage both cortices (bicortical) for adequate stability (Figure 2A).\nStart with the distal-most pin first, just at the level of the lateral epicondyle. Place jig flush to the lateral distal femur and insert a 1.0 threaded tip k-wire.",
    "Maintaining the position of the jig on the bone, identify where the most proximal pin will enter the bone based on the jig holes. Once the position is determined, carefully incise parallel to the fibers of the gluteal tendon as needed to create a small gap in the tissue for the proximal pin to pass through, thus minimizing iatrogenic damage to the tendon. Drill a 1.0 mm non-threaded k-wire in this gap, again ensuring the pin engages both cortices (Figure 2B).\nMaintain the jig’s position in contact with the bone and drill two 1.0 mm threaded k-wires, one on either side of the future defect site. Ensure pins engage both cortices (Figure 2C).\nPlace the external fixator bar level 1 cm above skin and screw tightly, locking the bar in place. Clip the excess pin lengths (Figure 2D).\nPrepare for the ostectomy (defect creation) by placing a small, curved retractor around the anterior and posterior femur to protect the surrounding soft tissue, muscle, and neurovascular bundle. Utilizing a ~5 mm sagittal oscillating saw blade, very cautiously create a 5 mm segmental defect through the mid-diaphysis. Apply a light, even pressure with the saw to avoid unnecessary fracture (Figure 2E).\nApply small amounts of irrigation (room temperature 0.9% sterile normal saline (NS)) as needed while creating defect to avoid thermal necrosis of the bone.\nFlush the wound using 10 mL of NS after creating the defect.\nAdminister 0.1 mL of a 0.25% bupivacaine with epinephrine (1:200,000) to the wound as an analgesic and vasoconstrictor.\nInsert the scaffold (5 mm x 3 mm x 3 mm) of collagen sponge or rhBMP-2 soaked sponge (from Step 2) into the defect. Each scaffold should be sized appropriately to span the length and volume of the defect, helping the sponge stay in position.",
    "NOTE: At this point, mRNA complexes may be prepared and injected as outlined in Steps 7.1-7.3 below if performing bioluminescence imaging.\nClose the muscle plane using the simple interrupted pattern with 4-0 absorbable suture. Close the skin layer using a running subcuticular pattern with 4-0 absorbable suture and skin glue to close gaps around the protruding pins.\nRemove the rat from the nose cone, remaining on the heating pad, and monitor continuously until the rat is able to consistently maintain an upright posture. At this point, place in a clean cage to recover.\n7. Preparation of complexed mRNA and bioluminescence imaging\nNOTE: Transfection with mRNA complexes should be performed during surgery 1 day before luminescence imaging. Use sterile techniques when handling mRNA.\nMix 10 µL of mRNA encoding for Gaussia luciferase (stock concentration of 1 µg/µL) with 30 µL of the lipidic transfecting agent.\nAllow for the mRNA-lipid complexes to form by incubating for at least 5 min at room temperature. The lipidic transfecting agent will condense the mRNA molecules, stabilizing them and enhancing transfection efficiency.\n\tNOTE: If the complexes are not used immediately, store them in ice for a maximum of 1 h.\nUsing a 20 µL pipette equipped with filtered tips, inject half of the volume of mRNA complexes to the distal and proximal ends of the defect, respectively.\nThe following day, 3 min before imaging, anesthetize the rat using inhaled isoflurane as previously described in Step 4.1.\nPosition the rat in an in vivo imaging chamber equipped with a nose cone delivering maintenance isoflurane (0.8% isoflurane, O2 delivery rate of 2-3 L/min).\nInject coelenterazine resuspended in saline at a dose of 4 mg/kg body weight in the proximity of the defect.\nAcquire bioluminescence images with the in vivo imaging system (IVIS) according to the manufacturer’s instructions18.",
    "8. Imaging Protocol\nAfter calibrating the plain radiographic machine, an X-ray system19, anesthetize rat using inhaled isoflurane as previously described (see Step 4.1) and position the rat in a nose cone with inhaled isoflurane (0.8% isoflurane, O2 delivery rate of 2-3 L/min) for an anteroposterior (AP) femur radiograph.\n\t\nWhile the rat is in sternal recumbency, advance the surgical hindlimb forward, flexing at the hip and stifle joint. Flex the stifle joint to approximately 90°. Tape the paw plantar side down, close to the body wall. Position the tibia forward from the femur to eliminate the possibility of superimposing the bones. To provide slight abduction of the hip, place a translucent sponge (approximately 15 mm thick) in the groin region. Then obtain an anterior-posterior (cranial-caudal) image of the femur.\nRepeat this AP femur radiographic view immediately following surgery, 4 weeks, and 12 weeks. Use tape and gauze to appropriately position the animal’s extremity for quality and consistent imaging.\nRemove the rat from the nose cone and monitor continuously until the rat is able to consistently maintain an upright posture. Then, place back into the cage.\n9. Histological Procedure\nEuthanize rats in a chamber with inhaled CO2 according to AVMA ethical standards16.\nFollowing euthanasia, shave the hindlimb, remove the skin from the operative extremity and disarticulate femur at the hip. Carefully remove all soft tissue from the operative femur (including all muscles, tendons, and ligaments). Leave only a thin layer of muscle surrounding the defect site to protect the healing region from inadvertent damage during dissection.\nPlace the femur in 10% Neutral Buffered Formalin at room temperature for 3-4 days to allow for fixation. Keep a 15:1 formalin to tissue volume ratio. Change the solution once halfway through the fixation process.",
    "Decalcify the femur in a 15% Ethylenediaminetetraacetic acid (EDTA) pH 6.5 solution for 3-4 weeks. Collect serial radiographs to determine decalcification endpoint.\nBisect the femur longitudinally with a cut from anterior to posterior in the mid-sagittal plane. Submit tissue for standard paraffin embedding and hematoxylin and eosin (H&E) staining.\nSend H&E slides to a pathologist for histological assessment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}