{
  "id": 19111,
  "origin_website": "Jove",
  "title": "Roux-en-Y Gastric Bypass Operation in Rats",
  "procedures": [
    "1. Preoperative Care\nRemove food from rat overnight prior to surgery.\nInduce anaesthesia in chamber with 4-5% isoflurane and O2 flow of 2 l/min.\nShave abdomen from sternum to pelvis using electric razor.\nPlace anaesthetised rat in supine position on isothermal heating pad.\nApply eye ointment (Vitagel) before placing the rats' snout in nosecone.\nMaintain anaesthesia with isoflurane concentration of 2-3% and O2 flow of 2 l/min.\nDisinfect skin with Betadine-Solution.\nConfirm depth of anaesthesia with forceps pinch between toes of hind leg.\nAdminister 5.7 mg/kg Enrofloxacin intraperitoneally as perioperative antibiotic prophylaxis, and 1 mg/kg Flunixin for analgesia.\n2. Median Laparotomy\nPerform midline incision using scalpel starting just below xyphoid process (Blade No. 10).\nMobilise skin circumferentially from underlying abdominal muscles using Metzenbaum scissors.\nOpen abdominal cavity.\nInstall retractors to facilitate best possible exposure of the operation field.\n3. Biliopancreatic and Alimentary Limb\nIdentify where the duodenum or proximal jejunum passes under the colon.\nTransect small bowel about 10 cm aborally from here and ligate both ends of the gut (PDS 5-0).\nPlace proximal stump of the two ends in left upper quadrant of abdomen as it will be later used to form the biliopancreatic limb of Roux-en-Y reconstruction.\nPlace distal stump of the two ends in right upper quadrant of abdomen as it will be later used to form the alimentary limb of Roux-en-Y reconstruction.\n4. Jejuno-Jejunostomy\nIdentify caecum with ileocoecal valve and ileum.\nFollow ileum orally for approximately 25 cm. The Jejuno-Jejunostomy will be placed here as starting point of the common channel of Roux-en-Y reconstruction.\nRetrieve biliopancreatic limb from left upper quadrant of abdomen and position it next to common channel where you plan to perform Jejuno-Jejunostomy.\nSecure biliopancreatic limb and common channel with retention stitch (PDS 6-0).",
    "Incise both loops over approximate 10 mm by using micro scissors.\nCreate Jejuno-Jejunostomy by performing side-to-side anastomosis using interrupted sutures (PDS 6-0).\nFirst complete dorsal side and then ventral side of anastomosis.\n5. Gastric Pouch\nIdentify gastro-oesophageal junction.\nMobilise this area by dissecting gastro-hepatic and gastro-splenic ligaments using Metzenbaum scissors.\nMove left gastric artery and vagal fibres of left para-oesophageal bundle laterally to prevent major bleedings and vagal nerve damage when small gastric pouch is created.\nExpose gastro-oesophageal junction by placing cotton swab retro-oesophageally.\nCoagulate small vessels of frontal stomach by using commercially available cautery device - also to prevent bleedings.\nTransect stomach approximately 5 mm below gastro-oesophageal junction creating gastric pouch of a size of no more than 2-3% of original stomach size using delicate, curved scissors.\nClose gastric remnant (PDS 5-0).\n6. Gastro-Jejunostomy\nRetrieve alimentary limb from right upper quadrant of abdomen and position it next to gastric pouch.\nCreate Gastro-Jejunostomy by performing end-to-side anastomosis (PDS 7-0).\nFirst complete back side and then front side of anastomosis.\n7. Abdominal Closure\nReduce anaesthesia by reducing isoflurane concentration to 1.5%.\nClose muscle layer of abdominal wall using continuous sutures (PDS 4-0).\nAdminister 100 μl of 0.3 mg/ml buprenorphine solution subcutaneously for analgesia.\nFurther reduce isoflurane concentration down to 1%.\nClose the skin using interrupted sutures (Vicryl 4-0).\n8. Postoperative Care\nStop isoflurane and continue with O2.\nAdminister 5 ml of warm saline for fluid replacement in three subcutaneous depots.\nPosition rat under red light until full recovery.\nReturn the rat to home cage.\n9. Representative Results\nAnimals and housing",
    "Male Wistar rats (Harlan Laboratories Inc., Blackthorn, UK; Elevage Janvier, Le-Genest-St. Isle, France) weighing between 350 and 500 g were individually housed under a 12 h /12 h light-dark cycle at a room temperature of 21±2 °C. Water and standard chow were available ad libitum, unless otherwise stated. All experiments were performed under a license issued by the Home Office, UK (PL70-6669) or approved by the Veterinary Office of the Canton Zurich, Switzerland. All rats were given one week of acclimatization before being randomized to gastric bypass or sham-operation. After surgery, rats received liquid diet for 3 days before access to normal chow was reinstalled.\nBody weight\nData of our rat gastric bypass model are consistent with previous findings that gastric bypass surgery is effective to reduce body weight and especially to maintain body weight loss (Figure 2). Average pre-surgical body weight of rats used for gastric bypass and sham-operations was similar (sham: 433.4 ± 8.3 g vs. bypass: 420.7 ± 8.4 g, p= 0.28). Five days after surgery sham-operated controls weighed significantly more compared to gastric bypass rats (sham: 422.2 ± 8.3 g vs. bypass: 374.7 ± 7.6 g, p<0.001). On postoperative day 60, difference in body weight was almost 170 g (sham: 533.2 ± 8.1 g vs. bypass: 366.2 ± 10.8 g, p<0.001).\nFood intake\nFood intake followed similar patterns as body weight and was reduced in gastric bypass rats when compared to sham-operated ad libitum fed rats. Figure 3 shows the average daily food intake for both groups (postoperative day 1-60). Daily food intake was consistently lower after gastric bypass (sham: 29.9 ± 0.2 g vs. bypass: 25.7 ± 0.3 g, p<0.001).\nGut hormones",
    "Blood from all rats was collected on the day of study termination 8,16. Animals had ad libitum food access the night before and were decapitated at the beginning of the light cycle on postoperative day 60. Blood was obtained, immediately centrifuged at 3000 rpm for 10 minutes at 4°C, and stored at -20°C until the samples were assayed in duplicate in a single run. PYY-like immunoreactivity was measured with a specific and sensitive radioimmunoassay, which measures, both the full length (PYY1-36) and the fragment (PYY3-36). GLP-1 was measured by established in-house radioimmunoassays17,18. Differences in food intake may be partly explained by increased postprandial plasma levels of peptide YY (PYY) and glucagon-like peptide 1 (GLP-1) as gastric bypass rats showed significantly higher levels for PYY (sham: 26 ± 2 pmol/L vs. bypass: 141 ± 14 pmol/L, p<0.001) and GLP-1 (sham: 40 ± 5 pmol/L vs. bypass: 215 ± 23 pmol/L, p<0.001; Figure 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3940/3940fig1.jpg\nFigure 1. Gastric bypass anatomy. Schematic illustration of the small bowel anatomy before (A) and after (B) gastric bypass operation. The different shades of red approximately represent corresponding segments of the small bowel with the medium red representing the foregut (oesophagus, stomach duodenum and proximal jejunum), the light red representing the midgut (proximal and mid jejunum, proximal ileum) and the dark red representing the hindgut (ileum, caecum).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3940/3940fig2.jpg\nFigure 2. Body weight loss after gastric bypass surgery in rats. Body weight change for a representative group of rats after gastric bypass (-   -) (n=52) and sham-operated rats (-   -) (n=52) throughout an observation period of 60 days. Data were pooled from previous publications6,8-10 and are shown as mean values ± SEM (*** = p<0.001).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3940/3940fig3.jpg",
    "Figure 3. Average food intake after gastric bypass surgery in rats.  Average daily food intake of a representative group of rats after gastric bypass (black, n=52) and sham-operated rats (white, n=52) throughout a postoperative period of 60 days. Data were pooled from previous publications6,8-10 and are shown as mean values ± SEM.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3940/3940fig3.jpg\nFigure 4. Postprandial PYY and GLP-1 serum levels after gastric bypass surgery in rats. Postprandial PYY and GLP-1 serum level for gastric bypass rats (black, n=18) and sham-operated rats (white, n=22). Data were pooled from previous publications8,16 and are shown as mean values ± SEM.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}