{
  "id": 12248,
  "origin_website": "Jove",
  "title": "Evaluating In Vitro DNA Damage Using Comet Assay",
  "procedures": [
    "1. Prepare Reagents\n1x PBS\nDilute 100 mL 10x PBS with 900 mL dH2O and adjust the pH to 7.4 using a pH meter. Store at room temperature.\nLysis solution (LS)\nPrepare 2.5 M NaCl, 100 mM disodium EDTA, 10 mM Tris base, and 200 mM NaOH in 900 mL dH2O; it commonly takes about 20 min to allow the mixture to fully dissolve. Adjust the pH to 10 using a pH meter. Add 1% sodium lauryl sarcosinate and 1% Triton X-100, and adjust the final volume to 1,000 mL. Cool to 4 °C for at least 30 min before use.\nAlkaline electrophoresis solution (AES), pH >13\nPrepare 200 mM NaOH and 1 mM disodium EDTA in 800 mL dH2O. Adjust the pH and make sure that it is pH >13. Adjust the final volume to 1,000 mL. Make fresh before use and cool to 4 °C for at least 30 min before use.\nNeutral electrophoresis sollution (NES)\nPrepare 1,000 mL neutral electrophoresis buffer by mixing 100 mM Tris base and 300 mM sodium acetate to 1,000 mL dH2O. Adjust the pH to 9.0 with glacial acetic acid. Cool to 4 °C for at least 30 min before use.\nDNA precipitation solution (DPS)\nPreparation of 10 mL 7.5 M ammonium acetate stock. For 50 mL of DNA precipitation solution, mix 6.7 mL 7.5 M ammonium acetate with 43.3 mL 95% ethanol. Store at room temperature.\nStaining solution\nAdd 1 µL 10,000x green fluorescent nucleic acid stain (e.g., SYBR Green) in 30 mL Tris-EDTA buffer (10 mM Tris-HCl, 1 mM disodium EDTA, pH 7.4) and store at 4 °C. Protect from light.\n1% low melting agarose",
    "Melt 1% low melting point agarose (1 g in 100 mL dH2O) in a microwave. Swirl the agarose every 15-20 s to make sure that the agarose is completely molten. Place the agarose in 37 °C water bath for at least 20 min before use.\nPre-warm pipette tips\nCut off the narrow ends of P200 pipette tips by 3 mm and warm at 37 °C before pipetting agarose.\n2. Prepare Comet Slides\nSlide coating\nMelt 1% agarose (1 g in 100 mL dH2O) in a microwave for 2 - 3 min or until the agarose is completely molten. Dip the glass microscope slides into the agarose and wipe one side of the slide using a lint-free wipe.\nLay the slides on a flat surface to air-dry or heat at 50 °C for faster drying; a transparent agarose film should be formed after drying. Place the coated slides in 37 °C before use.\nPreparation of single cell suspensions\nCulture and treat the glioma cell\n\t\t\nCulture the U251 MG cells in DMEM-Ham F-12 medium supplemented with 10% FBS, 100 U/mL penicillin, and 10 µg/mL streptomycin at 37 °C with 5% CO2.\nDigest the cells using 1 mL trypsin for 3 min, and neutralize trypsin using DMEM-Ham F-12 medium with FBS. Collect in 15 mL tube, spin at 300 x g for 4 min, aspirate the medium, and suspend cells at 2 x 105 cell/mL in 1x PBS.\n\t\t\tNOTE: The cell sample should be prepared immediately before starting the assay and all samples should be handled in a dark or dimmed environment to prevent DNA damage from light.",
    "Combine the cell suspension with 1% molten low melting point agarose (at 37 °C) at a ratio 1:10 (v/v), mix gently by pipetting up and down, and immediately pipette 30 µL onto a slide. Use the side of the the pipette tip to spread the agarose/cell mixture to ensure the formation of a thin layer.\nPlace the slide flat at 4 °C in the dark for 10 min. Increasing the gelling time to 30 min improves adherence of samples in high humidity environments.\nImmerse the slide in 4 °C LS in the dark for 1 h to overnight.\n3. Single Cell Electrophoresis\nProceed to alkaline (step 3.2) or neutral (step 3.3) comet assay\nFor alkaline comet assay\nGently remove slides from the LS, drain excess buffer, and gently immerse in AES for 1 h at 4 °C to allow DNA unwinding. Keep the slides in the dark.\nAdd pre-chilled AES in the electrophoresis slide tray, do not exceed 0.5 cm above the slides (this depends on the size of the electrophoresis units), place the slides inside and cover with a cap. Set the power supply voltage to 1 V/cm (the length between electrodes) and run for 30 min at 4 °C.\nDrain excess electrophoresis solution from slide. Gently immerse slides twice in dH2O for 5 min each at room temperature.\nGently immerse slides in 70% ethanol for 5 min at room temperature. Proceed to step 4.\nFor neutral comet assay\nGently remove the slides from the LS, drain excess buffer, and gently immerse in NES for 30 min at 4 °C. Keep the slide in the dark.",
    "Add pre-chilled neutral electrophoresis buffer in the electrophoresis slide tray, do not exceed 0.5 cm above slides (this depends on the size of the electrophoresis units), place the slides inside and cover with a cap. Set the power supply voltage to 1 V/cm (the length between electrodes) and run for 45 min at 4 °C.\nDrain excess buffer from the slides. Gently immerse slides in DPS for 30 min at room temperature.\nGently immerse the slides in 70% ethanol for 30 min at room temperature. Proceed to step 4.\n4. Stain Comet Slides\nDry slides at 37 °C for 10 - 15 min in the dark.\nPlace 50 - 100 µL green fluorescent nucleic acid staining solution onto each dried agarose and stain for 15 min at room temperature in the dark.\nRinse the slides briefly in dH2O and dry completely at 37 °C in the dark. Proceed to image acquisition and analysis.\n5. Image Acquisition and Analysis\nNOTE: The visualization and quantification of DNA breaks are based on epifluorescence microscopy and the comet assay software (see Table of Materials)12.\nPlace the slides on the microscope with a slide holder. Ensure the agarose gel is facing to the objective lens. Randomly capture images from the stained comet slides using a fluorescence microscope with a 10x objective lens. Avoid the edges and the areas around any air bubbles.\nEnsure each comet tail is horizontally distributed. Comet heads should originate from the left and the tail from the right.\nSave each picture in a binary TIF format with bright DNA stain and dark background. Load images to the software using the \"Select files to analyze\" button, which is located on the left of the toolbar. An image view window should appear (Figure 1).",
    "Draw a measurement frame on the screen and adjust its size in accordance with the comet of the cell. Click the \"Adjust\" button to set up the threshold of the head, comet, and tail according to the image, then click the \"Start measurements\" button (Figure 1).\nSelect a cell using the frame and activate the measurement by clicking with the mouse on the \"Assay the comet\" button; an intensity image shows up on the \"profiles\" window with the selected measurement parameters. The results can be saved by clicking the \"store result\" button (Figure 1).\n\tNOTE: The software calculates the parameters including the length of the comet tail, the percentage of the tailed DNA, the tail moment (TM) and the Olive tail moment (OTM). The tail moments are calculated by the formulas as follow:\nimgsrc://cloudfront.jove.com/files/ftp_upload/56450/56450eq1.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/56450/56450eq2.jpg\nAnalyze at least 50 cells per treatment.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}