{
  "id": 12097,
  "origin_website": "Jove",
  "title": "Longitudinal Intravital Imaging of Brain Tumor Cell Behavior in Response to an Invasive Surgical Biopsy",
  "procedures": [
    "All experiments were carried out in accordance with the guidelines of the Animal Welfare Committee of the Royal Netherlands Academy of Arts and Sciences, the Netherlands. The experimental protocols used in this manuscript were approved by the Centrale Commissie Dierproeven (CCD) and the Instantie voor Dierenwelzijn (IvD).\n1. Tumor cell implantation and cranial imaging window preparation\nSurgical preparation\nUse adult mice (>6 weeks old) of any strain or gender. Sedate a mouse by injecting (fluanisone [neuroleptic] + fentanyl [opioid]) (0.4 mL/kg) + benzodiazepine sedative (2 mg/kg) at a dose of 1:1:2 in sterile water. Assess the animal’s sedation state by toe pinch.\n\t\tNOTE: In this protocol, both female and male C57BL/6 mice were used due to the same genetic background of the tumor cell line used in these experiments (GL261). The mouse will stay fully sedated for 1.5 h. Alternatively, use inhalation anesthesia such as isoflurane (1.5%–2% isoflurane/O2 mixture).\nMount the mouse on a stereotactic frame and secure the head using a nose clamp and two ear bars.\nUse a heating lamp to preserve body temperature. Heating lamp should be used with caution, alternatively water recirculating heating pads can be used.\nApply eye ointment to protect the mouse’s corneas from drying.\nUse sharp scissors to shave the fur on the skull (dorsal area from the mouse’s eyes to the base of its skull) and disinfect the exposed skin with 70% ethanol.\nCut the skin in a circular manner with sharp scissors and scrape away the periosteum underneath with a cotton swab. Apply a drop of lidocaine 1% + epinephrine 1:100,000 for 5 min, and remove the excess with a cotton swab.\nGlue the edges of the skin to the skull with cyanoacrylate glue.\nPlace the stereotactic frame under a dissection stereo microscope with 4x magnification.",
    "Visualize the skull through the dissection microscope and drill a circular groove of 5 mm in diameter over the right parietal bone. Perform this step carefully and only superficially, avoiding any pressure on the skull.\nApply a drop of cortex buffer (125 mM NaCl, 5 mM KCl, 10 mM glucose, 10 mM HEPES buffer, 2 mM MgSO4, and 2 mM CaCl2 [pH 7.4]) and lift the bone flap using thin forceps.\nFor the following steps, keep the brain surface covered with cortex buffer unless indicated otherwise.\nUnder the dissection microscope, visualize the brain surface and remove the dura mater using curved, tapered, very fine point tweezers. If bleeding occurs at this stage, use an absorbable gelatin sponge to stop it.\nTumor cell injection\nResuspend the desired amount of fluorescent tumor cells in ~3 μL of PBS (e.g., for the experiments shown in this protocol, 1 x 105 GL261 cells were injected).\n\t\tNOTE: While any fluorescent marker can be used, a nuclear marker is strongly advised, to track individual tumor cells during analysis. Additionally, a histone-linked fluorescent marker, such as H2B, can be used to visualize chromosome condensation and, thus, to monitor cell division. The use of a photo-switchable marker, such as Dendra2, allows the photo-marking and tracking of tumor cells over several days4,13.\nLoad the tumor cells in a 10 μL gas-tight syringe with a point style 2 needle and fix it on the stereotaxic manipulator arm.",
    "Remove the cortex buffer. Place the tip of the syringe in the middle of the craniotomy and insert it at a depth of 0.5 mm from the surface of the skull. Optionally, create a small space in the brain to accommodate the tumor cell suspension. For this, insert the syringe up to a depth of 1 mm and then retrieve it up to 0.5 mm before the injection.\nApply a drop of cortex buffer.\nSlowly inject the cell suspension using a microsyringe pump injector (250–400 nL/min). Remove the syringe and use an absorbable gelatin sponge to stop any bleeding, if necessary.\nCranial imaging window preparation\nRemove the cortex buffer and place a drop of silicone oil on the craniotomy site to avoid air bubbles under the window.\nSeal the exposed brain with a 6 mm coverslip. Apply cyanoacrylate glue between the coverslip and the skull. Gently press the coverslip against the skull with the help of fine tweezers to ensure minimal distance between the brain and the coverslip.\nApply dental acrylic cement on the skull’s surface, covering the edge of the coverslip. Place a thin stainless-steel ring (1.5 mm in outer diameter, 1 mm in inner diameter) around the craniotomy and allow the dental cement to dry. Optionally, add some glue on the border to secure the ring on the top of the head.\n\t\tNOTE: This head fixation system is optimal for imaging on an inverted microscope: small magnets embedded in the imaging box facilitate the cranial imaging window (CIW) fixation. In the experiments shown in this protocol, an inverted microscope was used. For upright microscopes, fixation can be achieved by means of a bar or a ring with grooves that can be attached to the microscope with the help of screws or a plate that fits the ring.",
    "For pain management, inject a single dose of 100 μg/kg buprenorphine subcutaneously and allow the animal to recover on a heating pad.\nPlace the mouse in an individual cage with shredded paper for enrichment. Closely monitor the mouse daily for the first few days and 2x per week, thereafter, for normal behavior, reactivity, and appearance.\n2. Intravital imaging\nNOTE: The time interval between the tumor cell injection and the first intravital imaging session is dependent on the type of tumor cell line used. For the experiments shown in this protocol, 1x 105 GL261 cells were injected and imaged 10 days later.\nImaging preparation\nSedate the mouse using isoflurane inhalation anesthesia through a face mask (1.5%–2% isoflurane/O2 mixture).\nInject the mouse subcutaneously with 100 µL of saline buffer to prevent dehydration.\n\t\tNOTE: For long-term imaging, the mouse can be hydrated through a subcutaneous infusion pump.\nPlace the mouse face-up in an imaging box. Use a metal plate with a 1 mm-diameter hole and small magnets embedded around the aperture to provide fixation of the CIW to the imaging box. Introduce isoflurane through a facemask and ventilate by an outlet on the other side of the box (0.8%–1.5% isoflurane/O2 mixture). Optionally, use tape to fix the body of the mouse.\n\t\tNOTE: Fluorescently labeled dextran for blood vessel visualization or other dyes may be injected intravenously at this point.\nOptionally, use a pulse oximeter and a heating probe to monitor the mouse’s vitals.\n\t\tNOTE: In this experiment, it was not necessary to use a pulse oximeter and a heating probe since the mouse was stable throughout the imaging time period (2–3 h). However, for longer imaging times, more thorough monitoring may be needed.",
    "Set the 25x (e.g., HCX IRAPO NA0.95 WD 2.5 mm) water objective to the lowest z-position and add a large drop of water.\n\t\tNOTE: The use of a water immersion micro dispenser is highly advised for long term experiments since it allows scientists to add water during the experiment. Alternatively, a dry objective can be used.\nTransfer the imaging box onto the microscope equipped with a dark climate chamber kept at 37 °C. Bring the objective to the CIW coverslip until the water drop touches it.\nUsing the epifluorescence mode, observe the tumor through the eyepiece and bring the cells into focus.\nTime-lapse image acquisition\nSelect several positions of interest to image, and record their coordinates in the software. Ensure that the selected positions are representative positions from different sites of the tumor (each tumor can be different, but to ensure consistency, select the same amount of positions that are central to the tumor core and to the edges across all mice).\n\t\tNOTE: A tile scan of a part of the tumor or of the whole visible tumor may be performed; however, if the tumor is large, this method will increase the time-lapse between images. In addition, if the tumor cells move fast, it can be challenging to track the same cells over time.\nSwitch to multiphoton mode and tune the laser to the correct wavelength. Note that, to avoid photodamage, higher wavelengths are desired.\n\t\tNOTE: For Dendra2 imaging, a 960 nm wavelength was used. With the objective used in these experiments, a zoom of 1.3 was sufficient to get a good resolution of the tumor nuclei and scan a representative area of the tumor.",
    "Go to the live mode and define a z-stack for each position in order to acquire the maximal volume of tumor cells without compromising the tumor cell resolution. Define the step size between the images as 3 µm.\nUse the bidirectional mode to increase the scanning speed. The image resolution should be at least 512 x 512 pixels.\nAcquire images of the tumor volume at different positions every 20 min for 2 h. Add water to the objective before each image acquisition.\n\t\tNOTE: Time-lapse images can be automatically acquired by setting the right time-lapse in the software. However, the mouse can move, and the position or z-stack can shift over time, causing data loss. Therefore, it is recommended to perform the time-lapse manually and to check and adjust for xyz shifts in between acquisitions.\nAt this step, optionally, photo-switch the Dendra2 fluorescent marker.\n\t\tNOTE: As opposed to time-lapse imaging (which allows studying individual tumor cells properties and how they change over time), this will allow studying the area of tumor cell infiltration in the brain over several days4. A detailed explanation of this step is described by Gligorijevic et al.13.\nAfter the last image is acquired, remove the mouse from the stage and allow it to recover on a heating pad. To prevent dehydration, 100 µL of saline can be given subcutaneously. Place the mouse in its cage until the biopsy-like injury is performed.\n3. Biopsy-like injury and CIW replacement\nCreate a biopsy-like injury at the tumor site 1 day after the first imaging session.\n\tNOTE: Alternatively, another procedure, like partial tumor removal, can be performed.\n\t\nSedate the mouse using isoflurane inhalation anesthesia as previously described in step 2.1.1.",
    "NOTE: While injectable anesthesia can be used, this procedure is shorter than the CIW implantation, and inhalation anesthesia makes it possible to precisely control and to reduce the time the mouse remains sedated.\nPlace the mouse on a stereotaxic frame and secure its head with two ear bars and a nose clamp. Check the depth of anesthesia by the lack of pedal reflexes. Use an anesthesia mask for stereotaxic surgery to keep the mouse sedated during the procedure.\nSoak a cotton swab in acetone and spread it around the edge of the coverslip to soften the glue that holds the coverslip against the brain.\nSlide thin point forceps under the coverslip to lift it. If the coverslip breaks at this point, use the forceps to remove the pieces of glass.\nApply cortex buffer to keep the brain moist.\nDip a 25 G needle in the tumor to a depth of 1 mm. Remove the needle and stop the bleeding, if necessary, by applying a gelatin sterile sponge.\n\t\tNOTE: This step can be performed under a fluorescent stereomicroscope to more accurately identify the tumor area (if the tumor is too small). Additionally, a 1 µL solution of fluorescent polystyrene 1 µm beads can be injected during the puncture to identify the biopsied area.\nSeal the brain surface with silicone oil and glue a 6 mm coverslip on the top.\n4. Repeated imaging\nOne day after inflicting the biopsy-like injury (and on consecutive days if needed), repeat intravital imaging as described in Step 2 above to assess how the tumor cell behavior changes over time. Select several positions of the tumor that would be representative of the whole tumor area.",
    "NOTE: If fluorescent beads were used to identify the biopsied area, localize them to image tumor cell behavior in the biopsied regions compared to non-biopsied regions.\n5. Image analysis\nIf the time-lapse images were acquired manually, combine them into one folder.\n\t\nOpen the time-lapse LIF file in the commercial software associated with the microscope (e.g., LasX or LAS AF). Select the tab Process > Process Tools > Merge. Select the first image of the time sequence and click First. Select the second image of the time sequence and click Second. In Merge Dimensions, select t for time. Click Apply. A new file with two timepoints will be generated. Repeat this process for all the timepoints, using the newly generated file as the first image of the sequence.\nCorrect the acquired z-stacks for any xyz shift.\n\tNOTE: For the experiments described in this protocol, a custom-designed Visual Basic software program was used for correction. Alternatively, other available software can be used, such as ImageJ or Imaris.\n\t\nExport the TIFF files from the software by right-clicking on the merged time-lapse file. Select Save RAW Data. The exported files will be exported to one folder named according to the channel, time, and z-position.\nOpen the TIFF files in the custom-designed Visual Basic software program.\nDefine the number of timepoints, z-stacks, and channels.\nAssign a color to each channel by the order of appearance.\nIn the Form Show panel, for each timepoint, correct the shift in the z by clicking on the up (U) or down (D) buttons.\nIn the Intravital image building panel, select the channel to be used to correct for the xy shift. Select the green channel to correct, based on the signal from the tumor cells. Click Automatic for xy correction.",
    "Export the corrected images as a maximum projection of three consecutive z-stacks. In the panel Selection, introduce the numbers of the first (Begin) and the last (End) z-slices to be exported. Select Max. Select Separate folders for Z. Click Do. For each of them, three z-stacks, time-lapse images will be exported to a separate folder.\nOptionally, correct for the tissue elastic deformation.\n\tNOTE: For tissue elastic deformation experiments, a match motion compensation software program was used to correct for rigid and elastic tissue deformation14.\nTrack single cells in the complete z-stack in the time-lapse movie.\n\tNOTE: Tumor cells can be tracked manually using, for instance, an ImageJ plugin (MTrackJ). While accurate, this is limited to the xy plane and is very time-consuming. Alternatively, tumor cells can be tracked automatically throughout the full z-volume, using tumor cell segmentation (e.g., Imaris software). However, in highly dense tumors, automated tracking is less accurate and can give rise to more tracking errors.\n\t\nOpen and track each time-lapse series (for three consecutive z-stacks) separately. Drag the folder containing the time-lapse images to ImageJ.\nSelect the tab Plugins > Tracking > MtrackJ. Track each individual cell by selecting Add and clicking on each cell at each timepoint.\nExtract the measure of the tracks by clicking on Measure and saving the file."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}