{
  "id": 17478,
  "origin_website": "Jove",
  "title": "An Epithelial Abrasion Model for Studying Corneal Wound Healing",
  "procedures": [
    "All animal protocols were approved by the Institutional Animal Care and Use Committees at the University of Houston and Baylor College of Medicine. The guidelines outlined in the Association for Research in Vision and Ophthalmology (ARVO) statement on the use of animals in vision and ophthalmic research were followed in handling and using the mice.\n1. Preparation\nPreparation of fluorescein solution\n\t\nPrepare 1% fluorescein solution by dissolving 10 mg of sodium fluorescein salt in 1 mL of sterile saline or sterile 1x phosphate buffered saline (PBS).\n\t\tNOTE: Prepare sodium fluorescein solution on the day of use or a day before to avoid microbial contamination. When prepared a day before use, store fluorescein solution at 4 °C away from light. Wrap tubes with aluminum foil to prevent photobleaching.\nDivide the solution into aliquots suitable for use in a single experiment. 1-1.5 µL of fluorescein solution is used per mouse per time point. Use the following formula to calculate the volume of aliquot appropriate for a single experiment:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63112/63112eq01.jpg\n\t\tNOTE: For example, if six mice are studied in a single experiment with wound size monitored at five time points, the volume of aliquot suitable for that single experiment would be:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63112/63112eq02.jpg\nPreparation of ketamine/xylazine cocktail for anesthesia of mice.\n\t\nTo prepare 10 mL of cocktail, mix 2.0 mL of ketamine (100 mg/mL) with 1.0 mL of xylazine (20 mg/mL), and add 7.0 mL of sterile PBS. Prepare ketamine/xylazine cocktail a day before or on the day of the surgery.\n\t\tNOTE: All solutions should be used at room temperature unless stated otherwise.\n2. Anesthesia",
    "Weigh the mouse (8-12 weeks old C57BL/6 wildtype mice) to determine the appropriate amount of anesthetic to administer. Use the two-handed mouse restraint technique to restrain and handle mice for the injection of the anesthetic18. Administer ketamine/xylazine cocktail intraperitoneally (i.p.) at a final concentration of 80 mg/kg of ketamine and 8 mg/kg of xylazine.\nWait until complete anesthesia is achieved before performing corneal wounding on the mouse. Evaluate the depth of anesthesia by assessing the pedal reflex after toe pinch. When adequate anesthesia is achieved, the mouse should not move upon toe pinch.\n\t​NOTE: Because mice quickly lose body heat during anesthesia, it is important to provide a source of warmth for mice to prevent hypothermia. Place mice on a heat source (heating pad) during anesthesia and recovery stages.\n3. Creation of corneal wound\nWound the right or left eye only. Maintain consistency with the eye (i.e., left or right) that is wounded when moving from mouse to mouse.\n\tNOTE: Because abrasions damage corneal nerves and reduce acuity, wounding both eyes can cause significant discomfort and impairment. Since analgesics have the potential to suppress inflammatory responses, their use may be a confounder in certain experiments aimed at understanding corneal inflammation. Avoiding analgesics in corneal wound experiments was approved by our Institutional Animal Care and Use Committee (IACUC).\nTo create the epithelial corneal wound\n\t\nUnder a dissecting microscope, use the 2 mm diameter trephine (see Figure 1) to demarcate the center of the cornea, keeping the eye wide open using the thumb and index finger to hold the eyelids. Gently twirl the trephine to make an impression on the corneal epithelium.",
    "NOTE: Care must be taken to not apply excessive pressure when using the trephine as this can result in corneal perforation. Also, care must be taken to position the trephine centrally. The pupils can be used as a landmark to locate the center of the cornea.\nUnder a dissecting microscope, hold the blunt golf club spud (see Figure 1) at approximately 45° from the surface of the cornea within the area demarcated with the trephine. Carefully and continuously scrape the epithelium within the demarcated area with the spud to debride the epithelium.\n\t\t​NOTE: Do not apply excessive force in debridement as that can also cause corneal perforation. The eyes of mice can dry up during the wounding process, making debridement difficult. In such a case, apply sterile PBS to the ocular surface to maintain optimal hydration.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63112/63112fig01.jpg\nFigure 1: 2 mm trephine and blunt golf club spud. The trephine is used to demarcate a circular region at the cornea center, and the golf club spud is used to remove the epithelium within the demarcated region. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63112/63112fig01large.jpg]\n4. Monitoring of wound closure and re-epithelialization\nPipette 1-1.5 µL of 1% fluorescein solution onto the wounded surface and image cornea using a digital microscope with a blue light source.\nAcquire images within the first minute of fluorescein solution addition to avoid spreading to surrounding epithelium leading to overestimation of wound size. Wounded corneas are imaged at specific times (i.e., 0 h, 12 h, 18 h, 24 h, and 30 h) after wounding.",
    "NOTE: At all time points, imaging is performed under anesthesia; ketamine/xylazine is used at the time of wounding while isoflurane is used at subsequent timepoints. Mice are housed individually in separate cages for the duration of wound closure monitoring. When housed together, mice tend to lick littermate's eyes, a behavior which has been shown to affect wound healing in different tissues19,20.\nAnalyze captured images, tracing wound area using an image analysis software. The wound area for each time point is expressed as a percentage of the original wound area at 0 h.\n5. Immunofluorescence imaging and analysis\nEuthanize mice by an IACUC-approved method (in this case, carbon dioxide overdose followed by cervical dislocation) at desired time points after wounding.\nHarvest eyeballs by gently pressing on the lateral canthus to displace the eyeball using iris curved scissor. Guide the scissors behind the eyeball to firmly grasp the optic nerve, and then cut the nerve, which allows the eyeball to be removed.\nFix each eyeball in 1 mL of 1x PBS containing 2% paraformaldehyde for 1 h at room temperature, and then wash three times in 1 mL of 1x PBS for 5 min each.\nUnder a dissecting microscope, use a surgical blade to make an incision in the sclera, about 500 µm distal to the limbus, and then cut through the globe. Using forceps, gently remove the iris matter from the cornea, and then carefully trim the scleral tissue away, making sure to leave the limbus intact.\nMake four partial radial cuts, each approximately 1 mm in length, which extend from the peripheral cornea and stop short of the center to allow the cornea to flatten.",
    "Permeabilize and block corneas in 1 mL of 2% bovine serum albumin (BSA) and 0.01% TritonX -100 in 1x PBS for 15 min followed by blocking in 2% BSA in 1x PBS for an additional 45 min at room temperature.\nIncubate corneas overnight at 4 °C in a cocktail of directly labeled unique fluorochrome conjugated antibodies prepared in 1x PBS containing 2% BSA.\n\tNOTE: Antibodies are targeted to label specific cells and tissues of interest. For example, endothelium, neutrophils, and platelets are labeled with anti-CD3121,22, anti-Ly-6G23,24, and anti-CD4125,26 antibodies, respectively. 4',6-diamidino-2-phenylindole (DAPI) is added to the antibody cocktail to visualize nuclei.\nAfter incubation, wash corneas three times in 1x PBS for 15 min each.\nMount corneas on a microscope slide in a drop of anti-fade fluorescence mounting medium, cover with a coverslip, and image with the desired magnification (4x to 100x objective) using a fluorescence light microscope. Take full-thickness images of the cornea across different regions as illustrated in Figure 2A.\n\tNOTE: The pattern of microscopic analysis illustrated in Figure 2A is used for analyzing specific regional changes in inflammation and cell division. Both DAPI and Ly-6G staining are used to identify the extravascular neutrophils. With DAPI staining, spherical neutrophils have a distinct horseshoe or donut shaped nucleus (Figure 2B).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63112/63112fig02.jpg\nFigure 2: Corneal imaging strategy and neutrophil infiltration after central abrasion. (A) Schematic representation of a cornea wholemount showing nine microscopic fields across the diameter of the cornea. The gray area represents the original wound area. The width of each region is 500 µm. (B) Note the distinct horseshoe or donut shape of neutrophil nuclei with DAPI staining. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63112/63112fig02large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}