{
  "id": 8111,
  "origin_website": "Bio",
  "title": "Indole Derivative Feeding Test and Detection of TRP and Indole derivatives by Thin Layer Chromatography",
  "procedures": [
    "Collect spores from 3 to 4 weeks old Piriformospora indica CM agar plate cultures grown at 28 °C (see Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130617/20130617081220_2163.jpgFigure 1. Four-week-old P. indica agar plate Pour approximately 5 ml sterile 0.002% Tween water 20 on 3-4 weeks old P. indica plate under sterile condition at room temperature (RT). Scratch plate with Drigalski spatula and/or scalpel and mix.Pour spore solution through miracloth filter and collect flow through in 50 ml falcon tube.Centrifuge for 7 min at 3,500 rpm, discard supernatant.Wash pellet with 5-10 ml 0.002% Tween water 20.Centrifuge for 7 min at 3,500 rpm, discard supernatant.Wash pellet with 5-10 ml 0.002% Tween water 20.Centrifuge for 7 min at 3,500 rpm, discard supernatant.Resuspend spore pellet in 10 ml 0.002% Tween water 20, count spores with counting chamber (e.g. Neubauer improved) and dilute to requested spore concentration (e.g. 500,000 spores ml-1).Inoculate 50 ml “complete medium” CM liquid medium (Pham et al., 2004) with 400 μl of 500,000 spores/ml spore solution in 100 ml Erlenmeyer flask.Let spores germinate for 1 week at 28 °C and 130 rpm.Inoculate with 2.5 mM TRP (prepare the stock 1 day before, dissolve slowly; work in darkness auxin is light sensitive).Incubate cultures in darkness (alternatively wrap flasks with aluminium foil) for 3 days.Collect 11 ml supernatant through miracloth filter (check the mass of each filter) into 15 ml falcon tube:Wash mycelium with 0.9% NaCl and let the whole miracloth filter with fungal biomass dry overnight in oven (85 °C).15 μl aliquot of the culture supernatant can be used for the determination of TRP and indole derivatives by LC-MS/MS (see Hilbert et al., 2013\") From the falcon tube take 1 ml into glass test tube for Salkowski test.",
    "Salkowski test: Mix 1 ml supernatant with 2 ml Salkowski reagent and 50 μl of 10 mM orthophosphoric acid, incubate for 25 min at RT, measure OD530. Add 5 ml ethyl acetate to the remaining 10 ml of supernatant and incubate for 3 to 4 h at 200 rpm in darkness (supernatant can be frozen at -20 °C overnight).For good phase separation centrifuge 5 min at 4 °C at 3,500 rpm (if needed leave falcons overnight at 4 °C in darkness).Transfer 2 ml of organic phase (upper phase) into a 2 ml eppendorf tube and evaporate in SpeedVac concentrator for 30 min with medium heating.Add 2 ml of the remaining organic phase to the pellet and repeat the SpeedVac process. Resuspend pellet in 60 μl ethyl acetate (Storage in -20 °C).Calculate the dry biomass.Fill the TLC chamber with Whatman paper.Saturate TLC chamber for approximately 1 h with approximately 200 ml of running buffer chloroform: ethanol: water (84:14:1).Load extracted samples onto the TLC plate in a volume, that each spot represents the amount of indole derivatives obtained from the samples of equal biomass (use not more than 6 μl for loading on TLC plate).Use commercially available indole derivatives as marker control (e.g. TRP, IAD and IAA). Let TLC run for 1 to 1.5 h in darkness.Dry TLC plate for 5 min at RT for approximately 2 to 5 min.Develop TLC plate by spraying on it a mixture of van Urk and Salkowski reagents in the proportion of 1:3 (Ehmann, 1977) and incubate in an incubator at 90 °C up to 10 min.Calculate retention factor (Rf) for each spot (the distance travelled by the compound divided by the distance travelled by the solvent) and compare it with Rf calculated for each indole derivative control."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}