{
  "id": 9408,
  "origin_website": "Jove",
  "title": "The Optokinetic Response as a Quantitative Measure of Visual Acuity in Zebrafish",
  "procedures": [
    "All animal husbandry and experiments should be approved and conducted in accordance with guidelines set forth by the Institutional Animal Care and Use Committee of the respective institution or other legal requirements.\n1. Zebrafish Care\nMaintain zebrafish under standard conditions at 28.5 °C on a 10 hr dark-14 hr light cycle16.\nKeep adult zebrafish at a tank density of about 3 fish/L.\n2. Optokinetic response (OKR)\nBuild the custom OKR recording device using a 14.5 cm diameter rotating drum, a stereo microscope with adjustable light intensity settings (300-8,000 lux) and a computer (Figure 1a).\n\t\nAttach a camera to the microscope that will provide a live feed onto an adjacent monitor and allow for image capture and recording.\nControl the rotating drum using a microcontroller linked to a computer which will accommodate various speed and direction selections.\nAnesthetize the fish in 0.016% tricaine for 2-3 min and then place the fish on a small platform with the eyes and gills suspended over the edge.\nPlace a thin sponge/towel over the body of the fish and pin 2-3 pieces of foam, shaped to accommodate the fish, over the fish to keep it immobilized. Limiting the movement of the tail of the fish was found to be a crucial aspect for immobilization without causing injury to the fish, and was best achieved using a flat piece of foam. (Figure 1b)\nPosition the fish within a cylindrical water-filled tank, that fits inside the rotating drum of the OKR recording device. Use magnets on the platform to position the fish upright, with the eyes approximately 7.3 cm from the edge of the drum. The fish should revive from the anesthesia within a few minutes - normal breathing will resume and random eye movements should be observed.",
    "Place a base grating of 0.07 cycles per degree (cpd) into the rotating drum and engage the computer controls to begin rotation and video capture (a speed of 12 rpm was used for this paper, but speeds of 8-16 rpm should give similar results).\nOnce an initial OKR is elicited by the base grating, pause the rotation briefly, and replace the grating with a smaller grating (higher spatial frequency).\nRepeat this process until an OKR can no longer be elicited. Retest with the smallest grating that caused an OKR following a modified staircase approach and then repeat using the grating that failed to elicit a response to verify the loss of the OKR. This process may be repeated to verify a true response to the smallest detectable grating if the final grating changed relative to the first extinction event.\nObtain monocular acuity measurements by placing a black plastic occluder over the stripes adjacent to the opposite eye. Repeat the procedure above (steps 2.6-2.7).\nObtain the acuity of the opposite eye by repositioning the occluder and repeating the steps 2.6-2.7 again.\nNote the distance each eye is from the stripes during the testing procedure by using the reference measuring strip beneath the fish tank so that accurate acuity measures can be calculated in the following steps.\n3. Calculating Visual Acuity\nObtain the visual acuity by calculating the cpd: imgsrc://cloudfront.jove.com/files/ftp_upload/50832/50832eq1.jpg where a is the distance from the center of the lens to the grating, and h is the length of one cycle of the smallest grating at which OKR was observed (Figure 1c).\nFor combined visual acuity measurements, the averaged a-value from both the left and right eye is used."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}