{
  "id": 18856,
  "origin_website": "Jove",
  "title": "Bronchoalveolar Lavage (BAL) for Research; Obtaining Adequate Sample Yield",
  "procedures": [
    "1. The Subjects are Met on Arrival by the Respiratory Research Nurse\nThe subject has been fasting for >4 hr for solid food and 2 hr for clear fluids1.\nThe procedure is performed as a day case with appropriate pre- and post-procedure checks (as per standard hospital policy).\nThe subject wears a hospital gown.\nA small gauge cannula is inserted (ideally into the left hand) and remains in situ until the end of the post-procedure recovery period1.\nPreprocedure observations are taken (blood pressure, heart rate, oxygen saturations [sats]).\nThe subject is transferred to the bronchoscopy suite.\n2. The Subject is Prepared for the Procedure in the Suite by a Respiratory Research Clinician Experienced in Bronchoscopy\nMonitoring equipment is attached including; 3-lead ECG, pulse oximeter1,10 and sphygmomanometer. Anesthetic support is not needed including written informed consent.\nOxygen may be delivered via nasal cannula at up to 4 L/min, to achieve sats >90%1.\nThe operator checks the bronchoscope, this includes ensuring effective suction by aspirating sterile normal saline.\nTopical anesthesia with lidocaine is achieved in the nasal passages (using Instillagel1) and the oral mucosa (using xylocaine)\nIf sedation is appropriate and requested by the subject, intravenous midazolam is administered1. An appropriate reversal agent (flumazenil) is immediately available.\nResuscitation equipment should be readily available1,10.\n3. The Bronchoscope is Inserted and Positioned\nIntubation is usually via the nose. If this is not possible due to nasal polyps, inflamed turbinates, or any discomfort then the subject is intubated via the mouth (a mouth-guard is used to prevent damage to the scope or the subject's teeth).\nTopical anesthesia at the larynx is completed using 4% lidocaine, usually a total of 4-6 ml is used. Commonly this causes coughing on instillation.",
    "The vocal cords are passed, and further mucosal anesthesia using 2 ml aliquots of 2% lidocaine at the carina, at the division of the right lower lobe (RLL) and right middle lobe (RML) and at the RML entrance.\nThe bronchoscope is positioned within the RML, ideally in the medial segment, in a position where it is distal enough to be in a secure position but not too distal so that the airway collapses when suction is applied ('Wink test' using the suction button).\nGood positioning is indicated during the wink test by a bronchoscope that can be fully maintained in position by the bronchoscopist and an airway that does not fully close immediately on gentle suction.\n4. The BAL is Performed\nFour 60 ml syringes are prefilled with warmed normal saline -  60 ml, 50 ml, 50 ml, and 40 ml in successive syringes. When the subject and bronchoscopist are ready the first syringe of saline is instilled by the bronchoscopy assistant whilst the bronchoscopist maintains the position in the RML.\nGentle hand suction is then performed by the assistant using the same port and 50 ml syringe.\nThis procedure is then repeated a further 3x, with a maximal volume of 200 ml used in our specific technique.\nThe retrieved BAL fluid is expelled gently into labelled containers already held on melting ice. Glass containers may be presiliconized in order to inhibit cell attachment and maximize cell return.\nThe BAL fluid appears hazy against the light with surface soap bubbles formed by surfactants.\nThe bronchoscope is slowly fully withdrawn.\nThe BAL fluid is transported without delay on ice for immediate processing.\n5. Subject Recovery\nThe subject is recovered for 2-4 hr by the respiratory research nurse on a ward.",
    "During this time they are allowed to rest and then only eat and drink >60 min1 after the procedure (when their swallow is assessed as safe), in order reduce the risk of aspiration.\nPost procedural observations are monitored and recorded. A clinical examination occurs prior to discharge.\nThe subject is briefed predischarge about the common side effects (fever, mild right submammary chest discomfort, sore throat) and given a contact number in case significant side effects occur1.\nThe subject is followed-up at 1-5 days post-procedure with a clinical contact. This may be either over the telephone or in person.\n6. Cells are Isolated in the Laboratory – Perform on Melting Ice Where Possible\nThe volume of BAL fluid is recorded and filtered through a double layer of sterile gauze swab to remove mucus plugs into prechilled, sterile 50 ml centrifuge tubes.\nCells are pelleted by centrifugation at 500 x g at 4 °C for 5-10 min and washed by vortexing in 50 ml cold normal saline. Centrifugation is repeated once.\nCells are resuspended in culture medium (RPMI-1640 + 10% fetal bovine serum + 2 mM L-glutamine + penicillin [40 IU/ml], streptomycin [75 IU/ml], and amphotericin B [0.5 IU/ml]) and differential counting performed using an equal volume of trypan blue and a hemocytometer.\nThe cell suspension is normalized to the required density (we use 1 x 106 cells/ml), introduced by pipetting into appropriate tissue culture plates, and incubated at 37 °C for 3 hr to allow macrophage adherence. 1 ml of this cell suspension per well is appropriate for 24-well culture plates.",
    "For lymphocyte work, after 3 hr of incubation, the culture medium is gently pipetted up and down 3x, and collected. This medium contains lymphocytes and nonadherent macrophages and may be used to assess lymphocyte function; it may also be used in purification steps e.g. with CD14 magnetic beads to remove macrophages.\nFor macrophage work, after 3 hr of incubation, the medium is carefully removed with minimal pipetting and replaced with fresh, warm medium without antibiotics (RPMI 1640 + 10% fetal bovine serum + 2 mM L-glutamine). The macrophages are adherent to the tissue culture plate (see Figure 1)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}