{
  "id": 2962,
  "origin_website": "Cell",
  "title": "Visualization of α-synuclein trafficking via nanogold labeling and electron microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThis protocol explains the conjugation of PFFs to nanogold beads while preventing PFFs from aggregating into longer or more aggregated fibrils. Once the nanogold PFFs are generated, the protocol describes the use of EM to visualize their internalization into cells and their subsequent cellular trafficking. This protocol can be used to visualize the cellular trafficking itineraries of numerous proteins. Furthermore, this protocol can be used to examine the internalization of PFFs and trafficking in various cell types, provided that the appropriate changes are made to facilitate cell attachment to the plate (e.g., poly-L-ornithine and Laminin would be used instead of poly-L-lysine for neuronal cultures).\nPFFs are conjugated with 5 nm nanogold beads, and a small portion of the conjugated sample is prepared and characterized using EM (steps 1–3: PFFs conjugation and characterization[href=https://www.wicell.org#sec3.1]). Provided that the nanogold-labeled PFFs match the ideal criteria (see below for details), cells are plated onto poly-L-lysine treated Nunc 8-well Permanox plates, and nanogold-PFFs are added to the cells (steps 4–8: cell attachment, culturing, and PFFs administration[href=https://www.wicell.org#sec3.2], fixation). Finally, a brief description of the processing of the cell monolayers for EM is provided (steps 9 and 10: processing samples and imaging with EM[href=https://www.wicell.org#sec3.3]).\nThe main advantage of an EM approach to protein internalization is that the specific details involved in internalization (e.g., membrane ruffling and the attachment of proteins to cell membrane) can be visualized directly, rather than using fluorescent microscopy and antibodies or more indirect approaches. We hope that this protocol can be used to elucidate other trafficking pathways for other proteins, specifically those involved in neurodegenerative diseases.\nPFFs conjugation and characterization\nTiming: 1 day",
    "In this section, we explain the protocol used to conjugate PFFs to 5 nm nanogold beads (Cytodiagnostics). We altered and optimized the standard conjugation protocol provided by the manufacturer (see product sheet on the manufacturer’s website: https://www.cytodiagnostics.com/collections/NHS-Activated-Gold-Nanoparticles[href=https://www.cytodiagnostics.com/collections/NHS-Activated-Gold-Nanoparticles]).\nNote: Since PFFs are very susceptible to aggregation, the nanogold-PFFs need to be administered to cells immediately after conjugation. Prepare the cells such that they are ready to coincide with the conjugation of PFFs to nanogold. Following the administration of PFFs to cells, proceed to prepare grids to characterize the nanogold-PFFs.\nNote: all of step 1 should be performed in a tissue culture hood.\nThe conjugation of PFFs with 5 nm nanogold.\nAdd 48 μL of 5 mg/mL PFFs to 60 μL of the reaction buffer provided with the nanogold conjugation kit.\nThaw reaction buffer for 1 h on ice.\nRetrieve 48 μL of 5 mg/mL PFFs (stored at −80°C) and immediately add 60 μL of ice-cold reaction buffer to the aliquot.\nIncubate for 2 min at room temperature.\nSlowly pipette the mixture up and down.\nAdd the reaction buffer-PFFs mixture to 1 vial of 5 nm nanogold.\nIncubate for 1 h at 18°C.\nAdd 10 μL of quencher buffer (provided by the manufacturer) to the mixture.\nSlowly pipette up and down using a p10 pipette set at 10 μL.\nAvoid creating bubbles in the solution.\nIncubate at room temperature for 5 min.\nNote: the amount of reaction buffer and quencher buffer used, the amount and concentration of protein used, are all specified by the manufacturer (Cytodiagnostics). The steps above are an adaptation of their protocol for our specific conjugation assay.\nNote: for PFFs visualization (labeled with nanogold beads, use a magnification between ×30,000 and ×68,000).",
    "Critical: Avoid rapid pipetting of the samples or sudden movements of the experimental microtube as they will aid in protein aggregation.\nCharacterization of conjugated PFFs.\nPrepare a diluted sample of PFFs with a 1 mg/mL concentration.\nDilute using ddH2O.\nPlace one drop of diluted PFFs on a carbon/formvar covered copper grid and allow the sample to sit for 10 min at room temperature.\nUsing a Whatman filter paper, remove the drop from the grid.\nFix the PFFs sample on the grid using 2% PFA (retrieved immediately from storage at 4°C).\nPlace one drop onto the grid and let the sample sit for 10 min at room temperature.\nRemove PFA drop using filter paper.\nAdd one drop of ddH2O onto the grid for 1 min at room temperature.\nRemove with filter paper.\nRepeat once more.\nStain the grid with Uranyless.\nCentrifuge 1 mL of Uranlyess at 14,000 × g.\nadd one drop of the supernatant to the grid and wait for 5 min at room temperature.\nWash grid with ddH2O as detailed in d.\nRemove the drop using a Whatman filter paper.\nLet the grid sit overnight on parafilm at room temperature.\nCritical: place grids in a box/chamber for their storage overnight to avoid the addition of contaminants (such as bacteria, dust, etc.) to the EM grid.\nVisualize using EM to assess and measure the length of fibrils.\nSee Figure 2[href=https://www.wicell.org#fig2] for an example:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2500-Fig2.jpg\nFigure 2. Electron micrograph of nanogold conjugated PFFs\nUranyless was used for staining. Arrowheads point to a few examples of conjugated nanogold beads. Arrows indicate optimal examples of nanogold-labeled PFFs: small size and the appropriate amount of conjugation (>1 and <20 beads per PFFs). Scale bar = 100 nm.\nCriteria for successful/ideal PFFs conjugation:",
    "The majority of PFFs should have a length of less than 100 nm.\nMost PFFs should be conjugated with at least one nanogold bead.\nOnly 1 in 20 nanogold beads should be unconjugated (free-floating).\nCell attachment, culturing, and PFFs administration\nTiming: ∼3 days\nHere, we will be culturing and plating cells onto Nunc 8-well Permanox plates previously treated with poly-L-lysine. The protocol described below uses U2OS cells; however, this protocol can be adapted for use with other cell types. We have used the same protocol to examine the internalization of PFFs in primary human astrocytes and glioblastoma cell lines (i.e., U87 and U251).\nTreat 8-well Permanox plates with poly-L-lysine.\nWash wells with 100% ethanol.\nRepeat 3 times.\nWash wells with ddH2O.\nRepeat 3 times.\nAdd 200 μL of 0.01% poly-L-lysine (stock concentration and working concentration) to each well.\nIncubate wells for 1 h at 37°C.\nWash wells with ddH2O.\nRepeat 3 times.\nCritical: For better attachment, allow cells to grow in wells for over 48 h. Allowing cells 48 h between passaging and experimentation will result in healthier cells, which will improve experimental results (i.e., PFFs uptake) and a lower incidence of cells lifting due to fixation.\nSubculture U2OS cells.\nTrypsinize U2OS cells currently in culture, pellet, remove supernatant, resuspend with growth media.\nPlate ∼50,000 cells per well.\nA total of 150–200 μL of media per well is optimal.\nIncubate for 48–72 h.\nNote: Before the experiment, use the mycoplasma kit to test samples for mycoplasma infection. The presence of mycoplasma could have effects on cellular processes, altering your experimental results.\nAdd 5 μL of conjugated PFFs to each well (assuming a final concentration of 2 mg/mL of conjugated PFFs).\nFollowing the addition of conjugated PFFs to each well, incubate cells for 30 min at 37°C.\nRemove cell media.",
    "The following step is optional as it details our exclusion assay involving the use of trypsin to wash off extracellular PFFs.\nPlace cells on ice and administer 200 μL of ice-cold trypsin (0.05% Trypsin/EDTA 0.53 mM) to each well.\nIncubate for 60–90 s on ice.\nexposure time may need to be adjusted to prevent the lifting of cells.\nremove trypsin and wash cells with 200 μL of ice-cold PBS.\nwash cells gently with PBS.\nSample fixation.\nfix cells with 2.5% glutaraldehyde (in sodium cacodylate buffer) supplemented with 2 mM Calcium chloride (CaCl2).\nCaCl2 is used to aid in membrane preservation during fixation. The concentration might need to be optimized for specific cell types.\nFix cells at 4°C overnight (a minimum of 2 h of fixation is recommended at 4°C).\nWash cells with 0.1 mM sodium cacodylate buffer (dilute stock solution using ddH2O).\nRemove fixative solution.\nAdd 200 μL of sodium cacodylate buffer to each well.\nAspirate the buffer.\nReplace with 200 μL of sodium cacodylate buffer.\nNote: a more detailed description of handling the samples will be provided in step 9.\nProcessing samples and imaging with EM\nTiming: 2–3 days\nHere, we discuss the steps to process the monolayer samples for EM imaging. This should be conducted following overnight fixation of samples in 2.5% glutaraldehyde.\nNote: post-fixation and block staining should be done in a fume hood.\nProcessing samples for EM.\nWash out glutaraldehyde fixative.\nRemove fixative.\nAdd 300 μL of 0.1 M sodium cacodylate buffer.\nIncubate for 10 min at room temperature.\nRepeat i-iii twice.\nPost-fix samples using 1% osmium tetroxide and 1.5% potassium ferrocyanide (diluted in ddH2O).\nAdd potassium ferrocyanide powder in ddH2O.\nAdd the appropriate amount of osmium tetroxide to the mixture (based on the concentration used).\nAdd 200 μL of the mixture to each well.",
    "Incubate at 4°C for 1–2 h.\nWash out the post-fixative solution.\nWash cells with ddH2O.\nIncubate for 10 min at room temperature.\nRepeat i and ii twice.\nGradual dehydration of samples.\nAspirate ddH2O.\nAdd 30% ethanol/ddH2O (dilute using pure ethanol).\nIncubate at room temperature for 10 min.\nRepeat i-iii using 50%, 60%, and 70% ethanol solutions.\nBlock staining with uranyl acetate.\nPrepare a solution of 2% uranyl acetate in 70% ethanol.\nAdd 200 μL of staining solution to each well (200 μL volume should be used for all the following steps).\nIncubate at 4°C for 2 h\nWash out the staining solution.\nAspirate samples.\nWash samples twice with 70% ethanol.\nContinue sample dehydration.\nAspirate wells.\nAdd 80% ethanol solution to each well.\nIncubate for 10 min at room temperature.\nRepeat i-iii once more, and remove the solution.\nAdd 90% ethanol solution to each well.\nIncubate for 15 min at room temperature.\nRepeat v-vi once more, and remove the solution.\nAdd 100% ethanol solution to each well.\nIncubate for 15 min at room temperature.\nRemove solution.\nRepeat viii-x twice more.\nInfiltration with Epon-812.\nAdd a 50% solution of Epon-812 (diluted in 100% ethanol) to each well.\nIncubate at room temperature for 1 h.\nAspirate wells.\nAdd a 75% solution of Epon-812/ethanol to each well.\nIncubate at room temperature for 1 h.\nAspirate wells.\nAdd a 100% solution of Epon-812 to each well.\nIncubate at room temperature for 1 h.\nAspirate wells.\nAdd a 100% solution of Epon-812 to each well.\nIncubate samples with Epon-812 at 60°C for 48 h.\nAllow samples to cool at room temperature overnight before sectioning.\nTrim and section prepared blocks.\nTrim the block to a small area of interest (use a light microscope to find regions of interest).",
    "Use a diamond knife to section samples (Ultra 35°) – samples will end up floating in the ddH2O-filled boat of the diamond knife where they can be collected.\nPlace one section onto a grid using the Perfect Loop tool.\nPlace the grid onto a Whatman filter paper and allow it to dry.\nNote: ideally, each section should be 70–100 nm thick.\nStain grids with uranyl acetate and lead citrate (concentration is based on tissue and staining preferences).\nNote: our grid staining protocol is based on a previously published paper by Santhana Raj et al.4[href=https://www.wicell.org#bib4]\nNote: EMbed 812 is a suitable alternative to Epon-812.\nCritical: Do not let samples dry out. Ensure that they do not go without a covering of liquid for more than 10 s.\nImage grids using a transmission EM at ×9300 to ×18500 magnification (allowing imaging of the fibrils along with cellular structures).\nNote: Electron micrographs can be viewed and analyzed with ImageJ or GMS software, both freely available at the links mentioned in the key resources table[href=https://www.wicell.org#key-resources-table]."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Neuroscience",
    "Microscopy",
    "Molecular/Chemical Probes"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}