{
  "id": 6945,
  "origin_website": "Bio",
  "title": "BRIDGE: An Open Platform for Reproducible Protein-Ligand Simulations and Free Energy of Binding Calculations",
  "procedures": [
    "System Preparation with Alchemical SetupLogin to the BRIDGE server.To start preparing the simulation of lysozyme (protein, or receptor) and the benzene ligand, click on the Alchemical Setup tool to set up the simulation (Figure 3). Nine outputs will be generated–one report, four structures and four topologies. A structure and topology are created for the Ligand 1 to alchemically transform to Ligand 2 and vice versa in water and the protein.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902025810_5060.jpgFigure 3. The Alchemical Setup tool. A protein and two ligands are specified and GROMACS compatible outputs will be generated.Type in the PDB ID for T4 lysozyme: “181L” (https://www.rcsb.org/structure/181L[href=https://www.rcsb.org/structure/181L]).Choose “Upload files” and change to “No”.Choose the “Ligand Reference” as “400”. This is a benzene molecule in the active site (residue ID is 400). We are going to map the two ligands (benzene and p-xylene) onto this benzene. Therefore, Ligand Reference should be given as “400”.ProtoCaller can build ligands using the SMILES notation of a molecule. Insert a SMILES string for Ligand 1–use benzene “C1=CC=CC=C1”. This string can be generated using molecular software or an online database.Insert a SMILES string for Ligand 2 -use p-xylene \"CC1=CC=C(C=C1)C.Choose the “PDB chain ID” as chain “A”.Choose the “Protein force field” as “ff14SB”. This is the AMBER Force Field that has been developed for proteins, and alternative force fields can be selected.Change any mutated selenomethionines back to methionine Set this option to “Yes\".Set “delete any atoms with alternate locations (altLoc B)” to “Yes”. Only the primary coordinates will be used.Select “gaff2”, the General Amber Force Field 2, for “Ligand force field”.The protein-ligand complex will need to be solvated in a box of water molecules. Choose the box dimension for the protein-ligand system to be “7” nm. The longest side of lysozyme is approximately 5 nm and we use nonbonded cutoffs of 1.2 nm.",
    "We need to leave a buffer region for the protein to move freely in the water box and ensure there is sufficient space so that it does not interact with its periodic image. Adjust this value depending on the system under consideration.The ligand will also be solvated in a water box. Choose the size of the simulation box. “4” nm will be sufficient for most ligands, but this can be increased if the ligand is longer than 2.5 nm. Simulations of larger water boxes will take more time to complete.The last option is to define the concentration of ions to place inside the water box. By default, “0.154” M of sodium (Na+) and chloride (Cl-) ions are included, which is the physiological concentration.Click the “Execute” button to run this tool.The simulation will have started and will appear in the history panel. The files created are the GROMACS topology (.top) and structure (.gro) files required for the Alchemical Run tool. This will generate files to perturb Ligand 2 into Ligand 1 inside the protein and in a water box in both forward and backward directions.Check the progress of the simulations by clicking the eye icon in the report. This will take some time. The time taken will depend on available compute resources and may also be due to tool dependency checking and installation. This tool is parameterizing the ligand force field, which should take less than 20 minutes. If the history items remain grey for more than 1 day, contact a Galaxy Admin. e.g., via Gitter (https://gitter.im/galaxycomputationalchemistry/Lobby[href=https://gitter.im/galaxycomputationalchemistry/Lobby]).The simulation is finished when the history items turn green.",
    "Relative free energy simulations in protein (Ligand 2 to Ligand 1) with Alchemical RunOnce complete with setup, the alchemical free energy simulations for each ligand are started and these are needed to calculate the ligand perturbation in water and the active site. The alchemical simulation is carried out in four steps for each free energy window, energy minimization, MD simulations in the Canonical ensemble (NVT) ensemble followed by Isothermal-Isobaric ensemble (NpT) ensemble. This pre-equilibration is vital to remove any Hamiltonian lags. Finally, the production simulation is carried out in an NpT ensemble. These steps are all carried out by the Alchemical Run tool in Galaxy (see Figure 4). It is from these simulations that the relative binding free energies can be calculated. Here, a simple perturbation of p-xylene (Ligand 2) to benzene (Ligand 1) will be carried out, and we choose a short simulation length for the purposes of illustrating the protocol. In reality, lengthier simulations are required. Often production simulations are at least 1 ns for free energy runs. For our converged lysozyme simulations we used the following parameters: Minimization steps:10000, NVT steps: 500000 (500 ps), NpT steps: 500000 (50 ps), MD (production) steps: 1000000 (1000 ps), time step: 0.001 ps. Whichever parameters are chosen the analysis tools must be used to check convergence.Select the Alchemical Run tool. This tool requires the topology and structure outputs from the alchemical setup tool.Select the “Structure file” to be “Ligand 2 to Ligand 1 in Protein Structure”.Select the “Topology file” to be “Ligand 2 to Ligand 1 in Protein Topology”.Set the number of “Minimization steps” to “10000”.Set the number of “NVT equilibration steps” to “500” (1 ps).Set the number of “NpT equilibration steps” to “500” (1 ps).Set the number of “MD (production) steps” to “1000” (2 ps).",
    "The “seed” is set to 19880924 by default and it must be changed. This is the seed to start the random number generator for molecular dynamics, change this to the current date or any random number, for example, “20200130”.Set the “time step” to “0.002” ps.Create hydrogen bond constraints. Choose “Yes” to apply constraints to the ligands and choose “H-bond constraints”. Choose “LINCS order” “4”, “LINCS iterations” “1”, “LINCS maximum angle” “30”.Select the free energy perturbation (FEP) path and choose to go from a larger ligand (p-xylene) to a smaller ligand (benzene).Type in “39” for the “number of free energy windows”. The more windows, the more likely the simulations will overlap and converge. The number of windows is zero-indexed, typing in 39 means there are 40 windows. First the charges are perturbed, then the Van der Waals and Bonding terms are perturbed. Here we are alchemically perturbing from Ligand 2 (0.00) to Ligand 1 (1.00) on a scale from 0 to 1. Any number between 0 and 1 represents how the charges, Van der Waals, Bonding interactions are scaled to form a hybrid system.Scale the charges of molecules in the simulations for the first 10 windows from 0.00 to 1.00 in increments of 0.11. The rest of the free energy windows are not perturbed. The exact lambda values must be described, by typing in the following 40 numbers: “0.00 0.11 0.22 0.33 0.44 0.56 0.67 0.78 0.89 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00 1.00”.Scale the Van der Waals interaction in the simulations for the final 29 windows after the charge has been perturbed. These are scaled from 0.00 to 1.00 in increments of 0.",
    "04 and then the change tapers to 0.02 and 0.01 at the end point to prevent end point catastrophes. The exact lambda values must be described, type in the following 40 numbers: “0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.04 0.08 0.11 0.15 0.19 0.23 0.27 0.30 0.34 0.38 0.42 0.46 0.49 0.53 0.57 0.61 0.65 0.68 0.72 0.76 0.80 0.84 0.87 0.91 0.95 0.97 0.98 0.99 0.99 1.00”.Scale the Bonding terms in the simulations in tandem with the Van der Waals interaction scaling. The exact lambda values must be described, type in the following 40 numbers: “0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.00 0.04 0.08 0.11 0.15 0.19 0.23 0.27 0.30 0.34 0.38 0.42 0.46 0.49 0.53 0.57 0.61 0.65 0.68 0.72 0.76 0.80 0.84 0.87 0.91 0.95 0.97 0.98 0.99 0.99 1.00”.Use the default free energy options.Set the temperature to “300” K and the pressure to “1” bar.Choose “Perform the simulation”. The input files can be generated and simulated outside of Galaxy if required.Click “Execute”.Check the report in your history for the simulation progress. Output will also include ‘.tar’ files (archives) of the FEP/TI (Thermodynamic Integration) data and trajectories. View these trajectories to ensure no unphysical events have occurred during the FEP calculations.Optional: Repeat this for Ligand 1 to Ligand 2 in protein.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902025746_0307.jpgFigure 4. The Alchemical Run tool. This tool is used to run the minimization, equilibration and production simulations in GROMACS for the alchemical transformation between the ligands in a particular environment.Relative free energy simulations in water (Ligand 2 to Ligand 1) with Alchemical Run As for B, but choose the “Structure file” as “Ligand 2 to Ligand 1 in Water Structure” and the “Topology File” as “Ligand 2 to Ligand 1 in Water Topology”.",
    "Optional: Repeat this for Ligand 1 to Ligand 2 in water.Analysis and convergence testing of Ligand 2 to Ligand 1 in the protein with Alchemical AnalysisThe Alchemical Analysis tool (Figure 5) provides a comprehensive analysis (although the GROMACS inbuilt bar module can be used). The data.tar file from the Alchemical Run tool is a required input. The expected tool outputs are as follows:•Report and free energy outputs.•Overlap matrix of free energy windows (as PNG).•Convergence plot (as PNG).•Curve Fitting Method (CFM) based consistency inspector (as PNG).•Free energy change breakdown (as PNG).•Thermodynamic Integration plot (as PNG).For more details about Alchemical Analysis, read the article (Klimovich et al., 2015) and the code repository (https://github.com/MobleyLab/alchemical-analysis[href=https://github.com/MobleyLab/alchemical-analysis]).Open the Alchemical Analysis tool.Select the Protein data output; this will be in the “tar” format.Set the prefix to “md”, the alchemical run uses the prefix md to save the simulation data by default.Set the temperature to “300” K.The “Equilibration time” is set as “0” ps. This can be changed to discard some simulation data. It would be useful in a scenario where the simulations are found not to have converged and the first few ps need to be removed.Report energies in “kcal”.If required, include lambda states to skip. By default, none are skipped.Click “Execute”.Optional: Repeat for Ligand 1 to Ligand 2 in protein.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902030245_8336.jpgFigure 5. The Alchemical Analysis tool. This tool is used to analyze free energy simulations. The user provided simulation data from GROMACS in tar format along with further simulations details such as the temperature. The outputs provided assist the user in evaluating if the calculations have converged.Analysis and convergence testing of Ligand 2 to Ligand 1 in water with Alchemical AnalysisAs for D but choose the Ligand 2 to Ligand 1 in Water data output.Optional: Repeat for Ligand 1 to Ligand 2 in Water.",
    "Interpret the analysis for Ligand 2 to Ligand 1 in the proteinCheck the results of the calculated free energy values with different estimators and methods (Thermodynamic integration [TI], Deletion exponential averaging [DEXP], Insertion exponential averaging [IEXP], Bennett acceptance ratio [BAR], Multistate Bennett acceptance ratio [MBAR]); see Figures S1 and S2[href=https://os.bio-protocol.org/attached/file/20200818/3731 Supplementary Supporting Information.docx].Check the free energy change dF(t) output which is a text file containing the calculated free energies as a function of time in both forward and backward directions. The backward direction simulation was not run but this tool can extract that data from the forward direction simulation.Check the Convergence Plot dG(t) to see if the simulation has converged. The forward and reverse ΔG should be the same within tolerance, preferably within the purple shaded band (Figure 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200902/20200902030210_0669.jpgFigure 6. Free Energy Convergence plot. This plot is used to confirm the forward and reverse ΔG values fall within tolerance.Check the Overlap Matrix which shows the overlapping of each free energy window in the simulation. There should be a good overlap between neighbouring free energy windows. If so, this indicates the stratification (number of free energy windows) is sufficient for the simulation.Consider the Free energy change breakdown. This gives the visualization of the calculated free energy for each window using each free energy estimator used. This plot shows that the IEXP exhibits a huge deviation from the other methods.Consider the Thermodynamic Integration Plot. This visualization of the data is useful for calculating free energy using TI.Consider the Curve Fitting Method based consistency inspector. This will indicate if all simulations have converged.",
    "If not, the simulations can be rerun using a longer simulation time (repeat protocol B with a longer simulation time) or the unconverged fraction of data of the simulation can be removed using alchemical analysis (rerun protocol D and set the equilibration time to be an appropriate number of ps.We have completed the analysis of the perturbation from Ligand 2 to Ligand 1 in the protein.Optional: Repeat for Ligand 1 to Ligand 2 in protein.Interpret the analysis for Ligand 2 to Ligand 1 in waterAs for F but choose the Ligand 2 to Ligand 1 in Water analysis results.Optional: Repeat for Ligand 1 to Ligand 2 in water.Calculate the relative free energy of Ligand 2 to Ligand 1Find the free energy estimated with MBAR for Ligand 2 to Ligand 1 in protein (10.212 ± 0.278 kcal/mol).Find the free energy estimated with MBAR for Ligand 2 to Ligand 1 in water (10.600 ± 0.258 kcal/mol).Calculate the relative free energy of binding (the difference), -0.388 ± 0.379 kcal/mol. This value is negative, which means that Ligand 1 (benzene) binds more favorably than Ligand (2) p-xylene. This compares well to the experimental difference, which is -0.52 ± 0.17 kcal/mol (Morton et al., 1995).Optional: Carry out a trajectory analysis of the first and last free energy windows."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}