{
  "id": 6183,
  "origin_website": "Bio",
  "title": "Measuring CD38 Hydrolase and Cyclase Activities: 1,N<sup>6</sup>-Ethenonicotinamide Adenine Dinucleotide (ε-NAD) and Nicotinamide Guanine Dinucleotide (NGD) Fluorescence-based Methods",
  "procedures": [
    "The CD38 activity assay can be done mainly with three different sources of CD38, cells, tissues, and recombinant enzyme. We are going to describe the procedure for cells and tissues first, and then describe the procedure using recombinant CD38 enzyme. The assay is performed in a 96-well white opaque plate (refer to Notes for plate information), at least in duplicates, with a final volume of 200 μl per well.Cell and tissue samplesIt is necessary to lyse the cells and tissue samples to be able to measure CD38 activity. To do so, we lyse the samples in sucrose buffer with sonication. The optimal volume of buffer should be empirically determined for each cell type and pellet size, as well as tissue weight, to ensure efficient lysis and an optimal final concentration of proteins in the lysate. We normally use 300 μl for 20 mg of tissue, and 100 μl of sucrose buffer if using cells from a 60 mm dish (2-3 x 106 cells). Keep buffer and samples on ice during all the assay steps.Sample preparationCells: wash cells in PBS, collect them according to standard procedures suitable for each cell type (adherent cells via scraping or trypsinization; cells that grow in suspension via transferring and pelleting) in 1.5 ml tubes and pellet them by centrifugation (30 sec, at 11.7 x g). Aspirate supernatant, re-suspend cells with 100 μl of sucrose buffer, if using 2-3 x 106 cells) and sonicate the samples at 30-50 W of power and 20 kHz of frequency on ice, for 3 times of 5 sec each.Tissue: in a 2 ml tube, add the piece of tissue (approx. 20 mg), add 300 μl of sucrose buffer and homogenize with scissors and a mechanical homogenizer until there are no visible chunks. Then, sonicate as explained above for cells.",
    "Remember to keep samples on ice during this process to avoid that the heat generated degrades the CD38 enzyme. After sonicating, centrifuge samples for 10 min at 13.8 x g, and at 4 °C. Transfer supernatant to a new tube for protein measurement by the Bio-Rad protein assay, and following steps. Discard pellet.Normalizing samplesNormalize samples with sucrose buffer to obtain a mass of 20-100 μg of protein if tissue is the source of enzyme, or 50-100 μg of protein per well if cells are being used. The volume of sample to be pipetted into each well is 100 μl. For tissues with high CD38 expression, like spleen, aim to the lower end of the interval. Proceed to “Prepare reaction mix” step.Recombinant CD38 enzymeIf using commercially available recombinant CD38 enzyme, the preparation of the assay differs from how it is done with cells and tissues. The total volume in the well is maintained at 200 μl, the reaction mix is the same (100 μl) but the volume of enzyme mix can vary if one wants to test an inhibitor or activator. This method can also be adapted to use with cells or tissue samples, although our group normally treat cells or animals previously with inhibitors/activators and proceed as described above.Prepare test compounds/inhibitorsPrepare a dilution of the test compounds 4x of the desired final concentration in sucrose buffer to a volume of 50 μl per well. Also, prepare a blank sample, with 50 μl of sucrose buffer and no test compounds. We recommend the use of a known CD38 inhibitor, such as 78c (50 nM final), or anti-CD38 antibodies as a control for the CD38 activity and test compounds.",
    "For human samples or human recombinant CD38 enzyme we suggest the use of Isatuximab (1 μg/ml), a well-known monoclonal anti-CD38 antibody already in Phase 3 clinical trials for Multiple Myeloma.Prepare enzyme mixThe enzyme mix, which contains Recombinant enzyme (10 ng/μl), BSA (40 mg/ml in water) and sucrose buffer, will have a total volume of 50 μl per well. We suggest an incubation period of 15 min at room temperature if antibodies are being used, based on our experience. For 78c no incubation is required, since this molecule only binds to the enzyme-substrate product. Calculate the number of wells that are going to be used and use the following proportion to prepare the enzyme mix: Recombinant enzyme 1 μl/well; BSA 4 μl/well; and sucrose buffer 45 μl/well.Note: The following steps are common for both samples type. Prepare reaction mixBased on which CD38 activity one wants to measure, two different substrates are added to sucrose buffer. For the hydrolase/NADase activity, ε-NAD is used. For the cyclase activity, NGD is the substrate of choice.Prepare the reaction mix based on the number of wells to be used, considering 100 μl of reaction mix per well. For each 1 milliliter of total reaction mix, 5 μl of 10 mM ε-NAD and 40 μl of 10 mM NGD should be added, in order to achieve a final concentration of 50 and 200 μM, respectively. Vortex the tube and leave it at room temperature.Setting up the reactionBefore start pipetting samples to the plate, make sure that the plate reader is properly configured. Set up machine to read fluorescence at 300 nm excitation and 410 nm emission.",
    "Configure settings of plate type (96-well opaque), analysis type (kinetics), time of analysis (at least 1 h, readings every 30 sec), define area to be read on plate, and set it up to shake once for 5 sec before start reading.Finally, pipet 100 μl of normalized samples, or 50 μl of recombinant enzyme mix plus 50 μl of inhibitor/activator tested, at least in duplicates. It is advised to pipet sucrose buffer in a set of wells as a blank. Then, quickly add with a repeater pipette 100 μl of reaction mix to all wells, load plate on reader tray, and read."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}