{
  "id": 6680,
  "origin_website": "Bio",
  "title": "Mitochondrial Respiratory Measurements in Patient-derived Fibroblasts",
  "procedures": [
    "See Figure 1 for an overview of the complete protocol. The overall procedure involves plating human fibroblasts into a Seahorse XF96 cell culture plate at low density, followed by 4-6 days of pharmacological treatment. After treatment, a Seahorse XF assay is first run to collect data on oxygen consumption rates. After completion, cell quantities are normalized on a per well basis to account for differences in cell viability and growth.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191202/20191202190504_4463.jpgFigure 1. Timing and overview of protocol. On Day 1, cells are plated and allowed to attach overnight (Step 1). Drug treatment occurs for 4-6 days, starting on Day 2 (Step 2). A 6-day treatment is depicted in this figure. On the last day of treatment (Day 7), the Seahorse sensor cartridge is hydrated overnight (Step 3). The Seahorse assay is performed on Day 8 (Steps 4-6). Cells are fixed after assay completion on Day 8, and normalization is performed on Days 8-10 (Step 7). Step numbers refer to the main text.Plate human fibroblasts into a Seahorse XF96 cell culture plate (Step 1)Note: Perform all steps using sterile technique. Pre-warm culture media, PBS, and Trypsin-EDTA solution to 37 °C. Wash adherent, cultured fibroblasts with PBS. Add trypsin-EDTA solution. Wait for cells to detach (3-5 min at 37 °C). Add an equal volume of culture media to neutralize trypsin. Resuspend cells in culture media/trypsin-EDTA mix, and transfer to a 15 ml conical tube.(Optional Step): Wash cells by pelleting cell suspension at 1,000 x g (5 min, 20 °C), removing supernatant, and resuspending the cell pellet in 2-3 ml of culture media.Count cells on a hemocytometer in triplicate. Resuspend cells at a final concentration of 5,000 cells per 80 µl of culture media.Plate 80 µl of cell suspension per well into a Seahorse XFe96 cell culture plate.",
    "Leave the 4 corners without cells (i.e., wells A1, A12, H1, H12 are filled with 80 μl of culture media with no cells).To promote even plating, let the culture plate sit for 30-60 min in the tissue culture hood without being disturbed.Transfer the plate to a 37 °C, 5% CO2 incubator overnight.Drug treatment (Step 2)Note: Perform all steps using sterile technique. Prepare fresh culture media containing drug (e.g., 1 nM NMS-873, 50 nM ML240) or vehicle (equivalent amount of DMSO). Prepare enough volume for 80 µl/well.With a vacuum, remove media from each well, and replace with fresh culture media containing drug or vehicle.Return plate to 37 °C, 5% CO2 incubator overnight.Repeat Steps 2a-2c every 24 h for the duration of the drug treatment (e.g., 4-6 days).Hydrate sensor cartridge and stabilize instrument (Step 3)Note: Perform one day prior to respiration measurements. Open a Seahorse XFe96 FluxPak. Remove the sensor cartridge (green), from the 96-well utility plate. Note: Make sure not to scratch the printed fluorophores on the sensor cartridge by placing the cartridge upside down on a flat surface. Using a 8-channel multichannel pipette, add 200 µl calibrant solution to each well of the utility plate.Carefully return sensor cartridge to the utility plate. Make sure not to scratch the fluorophores.Incubate Sensor cartridge and utility plate overnight in a 37 °C, non-CO2 incubator.Turn on Seahorse XF96 instrument and start up WAVE software. Ensure computer is connected to the instrument, and the temperature is set to 37 °C. Leave instrument on overnight to maintain temperature stability.Wash cells into Seahorse assay media (Step 4)Note: Perform approximately 60 min prior to start of assay. Using a vacuum, remove media from each well of the Seahorse XFe96 culture plate. Using an 8-channel multi-channel pipette, add back 150 µl of warm Seahorse assay media. Repeat three times.",
    "On the last wash, remove as much media as possible, and add 150 µl of assay media.Place the plate in a 37 °C, non-CO2 incubator for approximately 60 min prior to measurements.Load cartridge with desired compounds (oligomycin, CCCP, antimycin A) (Step 5)Note: Final drug concentrations will be 5 µM oligomycin, 10 µM CCCP, and 1 µM antimycin A after each sequential injection. Prepare the following solutions (with drugs diluted from frozen stocks):2 ml of Seahorse assay media containing 80 µM oligomycin2 ml of Seahorse assay media containing 170 µM CCCP2 ml of Seahorse assay media containing 18 µM antimycin AUsing a 2-20 µl multichannel pipette, load 10 µl of oligomycin solution into port A of each well. Using a 2-20 µl multichannel pipette, load 10 µl of CCCP solution into port B of each well.Using a 2-20 µl multichannel pipette, load 10 µl of antimycin A solution into port C of each well.Tap down sensor cartridge gently to ensure solution reaches bottom of each port.Run Assay (Step 6)Within the WAVE software, set up the following protocol:CalibrationEquilibrationBasal measurements: 4 cycles of Mix (3 min) and Measure (3 min)Injection (port A), followed by 4 cycles of Mix (3 min) and Measure (3 min)Injection (port B), followed by 4 cycles of Mix (3 min) and Measure (3 min)Injection (port C), followed by 4 cycles of Mix (3 min) and Measure (3 min)Start assay and insert sensor cartridge (loaded with drugs) into instrument on top of utility plate containing calibrant solution. Ensure no lids or drug loading guides are present.Allow instrument to calibrate (15-20 min).After the instrument has completed calibration, remove the utility plate and insert Seahorse XFe96 cell plate. Ensure no lids are present.",
    "Normalization (Step 7)Notes: Normalization of Seahorse data can be performed using multiple methods, including cell counting, cell staining, and protein measurements. Here, we describe a Sulforhodamine B staining protocol for normalization (Vichai et al., 2006), based on the ability of sulforhodamine B to bind protein-components present in fixed cells. Use a multichannel pipette for each addition (#1-5) of the normalization process.After assay is complete, fix cells by adding 50% TCA solution directly to each well, to a final concentration of 10%. Incubate plate at 4 °C for 1-24 h.Wash cell culture plate 5 times with distilled water to completely remove all TCA solution. Dry plate completely (overnight at room temperature).Stain cells by adding 25 µl per well of SRB (Sulforhodamine B) solution. Incubate at room temperature for 30 min, with rocking.Wash plate 5 times with 1% acetic acid to remove any residual SRB. Dry plate completely (overnight at room temperature in the dark).Add 100 µl of 10 mM Tris solution per well to solubilize stain. Incubate plate at room temperature for 30 min with rocking.Measure absorbance at 510 nm, using a microplate reader. Signals for each well should be subtracted from absorbance signals for the background wells (A1, A12, H1, H12). Background-corrected absorbance values can be input into WAVE software to normalize rate measurements.Calculation of basal oxygen consumption rates (Basal OCR; Figure 2) is as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191202/20191202190948_2028.jpgThe residual OCR (post injection of antimycin A) is considered the background or non-mitochondrial OCR.Calculation of maximal oxygen consumption rates (Max OCR; Figure 2) is as follows:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191202/20191202191034_6971.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20191202/20191202191116_8972.jpgFigure 2. Schematic of sample oxygen consumption data. Normalized Oxygen consumption rates (OCRs) are plotted versus time over the course of a typical Seahorse experiment (Step 6). Drugs (red) are injected at the indicated times, including oligomycin, CCCP, and antimycin A.",
    "Basal OCR and Maximal OCR are calculated as depicted (Step 7). Basal oxygen consumption rate (Basal OCR) is the average OCR of the first 4 measurements (prior to injection of oligomycin) minus the average OCR of the last 4 measurements (post injection of antimycin A). Maximal OCR is the max OCR of the four measurements post injection of CCCP minus the average OCR of the last 4 measurements (post injection of antimycin A)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}