{
  "id": 2078,
  "origin_website": "Cell",
  "title": "A protocol for imaging calcium and chloride in C. elegans glia upon touch stimulation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of the probes for mechanical stimulation\nTiming: 30 min\nThis step describes how to prepare probes for nose touch stimulation.\nPlace a 15 cm length borosilicate capillary glass in the Sutter P-1000 micropipette puller to fabricate two needles using the following settings:\ntable:files/protocols_protocol_1562_9.csv\nNote: The exact settings on the Sutter P-1000 are determined by the heating filament. Follow the manufacturer’s instructions to test the filament and to establish the exact settings. The “heat” parameter is the one that most likely will require the most adjustment.\nNote: Other types of pullers can be used. The goal is to fabricate needles with a long tip, like the ones used for injections in C. elegans or Xenopus oocytes.\nNote: A borosilicate glass (OD=1.50 mm and ID=0.86 mm) with standard wall with filament was used in this study. Other borosilicate glasses can be used but they will need to be tested under the same experimental conditions first.\nNote: Pull 8–10 needles as they are easy to break during the manipulation steps.\nUsing the fire polisher, heat the tip of the needles to melt it into the shape of a bulb of the size of 10–20 μm (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1562-Fig3.jpg\nFigure 3. Photograph of the tip of a glass needle used as probe to mechanically stimulate the nose of the worm\nScale bar is 10 μm.\nNote: This shape of the probe works well for nose touch stimulation. Other shapes may be used for touch stimulation to other parts of the C. elegans’ body (Suzuki et al., 2003[href=https://www.wicell.org#bib11]; O'Hagan et al., 2005[href=https://www.wicell.org#bib8]; Kindt et al., 2007[href=https://www.wicell.org#bib6]; Kang et al., 2010[href=https://www.wicell.org#bib5]; Geffeney et al., 2011[href=https://www.wicell.org#bib3]; Han et al., 2013[href=https://www.wicell.org#bib4]).\nPreparation of the agarose pads\nTiming: 30 min",
    "This step describes the process of making 2% agarose pads on which worms are glued.\nAdd 1 g agarose to 50 mL of imaging buffer (2% w/v) and heat the mix in a microwave until fully dissolved.\nNote: You can leave the heated agarose at room temperature for 2–3 min while you prepare the coverslips to allow some cooling. Cooler agarose will make slightly thicker pads that will stay moist for longer.\nNote: The flask in which the agarose was heated can be sealed with parafilm and stored at 4°C for up to a month. When reheating the agarose, use reduced microwave power to avoid water evaporation and consequently agar concentration. Limit to 2–3 reuses of the same agarose.\nPlace ∼25 18 × 18 mm cover glass on a flat surface and with a disposable Pasteur pipette add one drop (∼100 μL) of 2% agarose on the center of one slide. Immediately after, while the agarose is still in liquid form, take a 22 × 22 mm cover glass and gently lay it down on top of the agarose drop. The weight of the top cover glass will be enough to create a thin pad. Repeat with the next cover glass until finishing the 25 slides (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1562-Fig4.jpg\nFigure 4. Preparation of the agarose pads\n(A) 18 × 18 mm glass coverslips are laid out on a clean piece of printer paper (left), a drop of 2% agarose is then placed in the center of each coverslip and 22 × 22 mm coverslips are placed on the agarose drops (middle), finally, the top larger coverslips are removed (right).\n(B) Closeup of the procedure described in (A) for one coverslip.\nNote: Using two different sizes of cover slides will facilitate the separation of the two glasses in the next step.",
    "With the help of a razorblade, carefully separate the bigger cover glass from the smaller one, making sure the pad remains on the small glass.\nNote: By the time you are done with step 4, the glass cover slides are ready to be separated.\nNote: Sometimes the pad remains on the larger cover glass. If that happens, drag the smaller one on top of the pad in small circles until it is separated from the larger glass.\nStore the pads in a 150 mm petri dish and use them immediately.\nNote: A wet wipe tissue can be placed in the middle of the dish (not in contact with the pads) to keep the pads moist. Store the pads in the dish containing the wet wipe tissue at 4°C for up to a week.\nCritical: The pads can easily dehydrate depending on the storage conditions. Always check for dryness before using. Make them fresh every 2–3 days for better performance.\nGluing worms\nTiming: 2 min\nThis step describes the process of gluing worms onto agarose pads so they can be immobilized for imaging. See also Methods video S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1562-Mmc1.zip].\nWith an eyelash, pick a fluorescent young adult and place it on the agarose pad.\nNote: To facilitate worm picking, the day before the recordings you can pick several fluorescent L4 onto a fresh plate. Alternatively, you can pick fluorescent Day 1 adults into a new plate before the recordings.\nCritical: Pick and transfer the worms very gently to avoid stimulation of the AMsh glia.\nCarefully dip the tip of a probe like the ones used for nose touch stimulation into the glue (Gluture) and place a drop of glue on the pad, close to the tail of the worm.",
    "With the probe still covered in glue, touch the tail of the worm so it is glued onto the agarose pad, and it stops moving forward.\nDip the probe in the drop of glue and start gluing one of the sides of the worm until the glue has reached the tip of the nose but it has not covered it (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1562-Fig5.jpg\nFigure 5. Glued worm head\nClose up of the head of a worm glued onto an agarose pad. The dotted line indicates the borders of the glue. Note that the glue does not cover the tip of the nose. Scale bar is 20 μm.\nNote: Under our conditions, the posture of the worm when it is glued is not relevant to the outcome of the recordings.\nCritical: Gluing worms is the most important step in this protocol as the tip of the nose must remain exposed (not glued).\nCritical: Placing small amounts of liquid glue close to the posterior part of the worm will allow the glue to travel to the anterior part of the body by capillarity. This ensures better gluing without too much mechanical stimulation of the body of the animal. If the drop of glue is too big, it may move too fast to the nose and cover it.\nNote: Gluing worms requires a lot of practice but, once the skills are acquired, gluing a worm should take only 20–30 s.\nPlace the cover glass containing the pad with the glued worm in the calcium imaging chamber.\nFill the chamber with imaging solution.",
    "Critical: Sometimes air bubbles get stuck onto the nose of the worm because air gets trapped under the glue. It is easy to remove the bubbles using the probe once the worm is placed under the microscope. This requires a careful manipulation of the probe (it is recommended to use the probe manipulator) to avoid stimulating the nose of the worm, otherwise it will affect subsequent experiments.\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Representative recording of how to glue worms, related to Figure 5 and steps 7–10\nImage acquisition\nTiming: 2 min\nThis step describes the process of image acquisition at baseline and during nose touch stimulation.\nOpen micromanager or another software that controls the microscope.\nOpen PIMikroMove or another software that controls the movement of the probe.\nUsing bright field illumination and a low magnification objective, find the worm. Position it so the tip of the nose faces the probe at the desired angle. Focus on the tip of the nose.\nNote: The angle of the probe with respect to the nose of the worm is very important to achieve the correct stimulation and may vary depending on the cell of interest. In our experience, ASH neurons respond to a wide range of angles of stimulations, from 0° to up to a 90° angle (perpendicular to the nose). On the contrary, AMsh glia respond to stimulations from 0° to up to a 35° angle (Figure 6[href=https://www.wicell.org#fig6]).\nMove the probe close to the tip of the nose and adjust the angle of action to achieve the best results (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1562-Fig6.jpg\nFigure 6. Position of the probe for nose touch stimulation",
    "The probe is placed close to the nose of a glued worm, it is retracted 150 μm for 30 s, and then pushed forward 200 μm. Finally, the probe is retracted 200 μm. AMsh glia are best stimulated by a probe placed straight on the nose of the worm like shown in this picture. Scale bar is 20 μm.\nCritical: Setting the Z axis for the probe position is essential to get a good activation of the cell of interest. If the position of Z axis is too high, then the probe will end up brushing the top of the worm body without directly stimulating the nose. If the Z axis position is too low, then the probe will brush the agarose pad, thus decreasing the force applied to the nose. Using the two black parallel lines of the mouth of the worms as a point of reference is helpful.\nAdjust the focus on the computer view and position the probe as close as possible to the nose of the worm without touching it.\nChoose your emission and excitation filters. For GCaMP-6s in AMsh glia, we used the YFP excitation filter and no emission filters since there is not overlap with any other fluorophore. For SuperClomeleon, we used the CFP excitation filter and the CFP and YFP emission filters to record CFP and YFP fluorescence separately.\nSwitch to fluorescence and focus again on your cell of interest. Adjust the exposure time that better suits your experiment.",
    "Note: For AMsh glial cells expressing GCaMP-6s we used 50 ms exposure time. For chloride imaging using animals expressing SuperClomeleon in AMsh, we used 20 ms. In our experience though, smaller cells such as ASH neurons require longer exposure time (100 ms). These settings may vary depending on the power of your imaging set up, the expression level of your fluorophore, and the size of the cell of interest.\nStart the recording and the mechanical stimulation protocol (see code below for PIMikroMove software). The protocol that was used in this study consisted in retracting the probe 150 μm for 30 s and then pushing it forward 200 μm. Finally, the probe is retracted 200 μm, ready for subsequent touch stimulations.\nMVR A 0.15\nWAC ONT? A = 1\nDEL 30000\nMVR A -0.200\nWAC ONT? A = 1\nDEL 0\nMVR A 0.200\nNote: The length of the recording may vary depending on the type of experiment. For longer recordings, it is recommended that the frequency of acquisition is reduced to limit photobleaching, unless short transient changes in intracellular calcium or chloride are expected. For AMsh glia we acquired at a frequency of 1 and 2 Hz (1 and 2 frames per second) for SuperClomeleon and GCaMP-6s recordings respectively.\nNote: The time the probe spends on the nose will be important depending on the type of cells that the researcher is stimulating, as they have different sensitivities. For ASH and AMsh it is enough with just the touch and 0 s spent during the indentation. Other cells may need to readjust this time as they will need a constant stimulation for them to get activated.",
    "Critical: Since the movement of the probe and the image recording are controlled by two separate software, it is important to synchronize the initiation of the two programs. Set the software buttons always at the same distance. This will facilitate the start of both programs virtually at the same time and will also ensure that touch is delivered always on the same frame number from the start. However, this must be double checked during data analysis.\nCritical: The protocol used for touch stimulation will determine the force used to stimulate the nose of the worm. To calculate the force, use the following Equation 1:\n  F = m ⋅ a  \nWhere m is the mass of the probe. In this study, the probe weighted 145 g. The weight included the glass probe and probe holder. The acceleration (a) is calculated using Equation 2:\n   V f  =   V 0  + a ⋅ t  \nIn this study the velocity of the probe was 300 μm/s, the time that the probe took to travel the 150 μm distance was 0.5 s and the velocity of the probe at time 0 (V0) was 0 μm/s. Thus:\n  a  =     V f  −  V 0   t  =   300  μ m / s   0.5  s   = 600 μ m /  s 2   \nIf we apply the calculated acceleration to Equation 1, then:\n  F = 145  g ⋅ 600 μ m /  s 2  = 87  μ N  \nUsing the code for nose touch stimulation shown above and modifying the mass of the probe, speed of the probe, and distance, one can adjust the force applied.",
    "Once the recording is finished, save it, and start the following recording if you want to record the response to a second touch stimulation (steps 13–17). Alternatively, you can discard the current pad, clean the chamber with some imaging buffer, and start with a new worm (step 7).\nNote: The repetition of the recordings in the same animal may vary depending on the type of stimulation, the cell of interest and the imaging equipment. For ASH and AMsh, recordings of 3–4 consecutive stimulations can be achieved if the worm is well glued and healthy. However, due to the length of the recordings, consecutive stimulations should require the implementation of additional steps to avoid starvation or structural damages."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}