{
  "id": 2128,
  "origin_website": "Cell",
  "title": "Protocol for Titrating Gene Expression Levels in Budding Yeast",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nRecombinant Plasmid Construction\nTiming: 2–3 days\nConstruct the recombinant plasmid to add one copy of target gene into the yeast genome. Insert one copy of target gene (including its promoter), fluorescent protein ORF and target gene terminator into single-integrating plasmids pNH603 (HIS3), pNH604 (TRP1) and pNH605 (LEU2), respectively. These plasmids are specifically designed for single copy insertion, and were kind gifts from the Wei Laboratory (Mitchell et al., 2015[href=https://www.wicell.org#bib2]). Use the auxotrophic marker as a selection marker, transform the yeast strain that bears the corresponding auxotrophic mutation with this recombinant plasmid, and insert the expression cassette of target gene tagged with the fluorescent protein into the genomic site of the auxotrophic mutation. But other appropriate plasmids that provide selection markers can be used as well.\nDay 0: Prepare a 50 μL PCR (polymerase chain reaction) in a PCR tube to amplify each DNA insert from the corresponding template. PCR as depicted in Table 1[href=https://www.wicell.org#tbl1]. Mix the reaction and run following Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_161_3.csv\ntable:files/protocols_protocol_161_4.csv\nRun PCR to amplify the target gene promoter together with its open reading frame (ORF) from the extracted yeast genome (fragment A, Figure 1[href=https://www.wicell.org#fig1]i).\nRun PCR to amplify the target gene terminator from the yeast genome extracted before the you begin (fragment C, Figure 1[href=https://www.wicell.org#fig1]ii).\nRun PCR to amplify the fluorescent protein ORF from the corresponding plasmid (fragment B, Figure 1[href=https://www.wicell.org#fig1]iii).\nLinearize the plasmid pNH603. Set up a microcentrifuge tube and add 50 μL of restriction enzyme digestion reaction as depicted in Table 3[href=https://www.wicell.org#tbl3], mix and incubate for 3 h or for ∼12 h at the incubation temperature using the corresponding restriction enzymes.\ntable:files/protocols_protocol_161_5.csv\nPause Point: The PCR products and the restriction enzyme digestion mixture after heat inactivation can be frozen and stored at −20°C for several days.",
    "Load the PCR products and restriction enzyme digestion mixture in 1%–2% agarose gel. Run DNA electrophoresis.\nIsolate the corresponding DNA (i.e., DNA inserts and the linearized plasmid vector)\nCut out the gel band and put into a microcentrifuge tube.\nUse QIAquick PCR Purification Kit to purify the DNA inserts.\nUse QIAquick Gel Extraction Kit to purify the linearized cloning vector.\nResuspend the DNA in elution buffer in a microcentrifuge tube.\nUse the NanoDrop Spectrophotometer to measure the concentration of the purified DNA.\nPause Point: The purified PCR products and the linearized vector can be frozen and stored at −20°C for several months.\nCritical: To verify the concentration of the corresponding DNA solution, elute the 50 μL PCR product and restriction enzyme reaction to a smaller volume (e.g., 30 μL). Then adjust the concentration to a final concentration 50–100 ng/μL for DNA inserts and 20–50 ng/μL for vectors for a high efficiency of the subsequent DNA ligation.\nLigate the 3 DNA inserts with the linearized cloning vector all at once using the Gibson assembly protocol.\nSet up a PCR tube and add a 10 μL of Gibson assembly reaction as depicted in Table 4[href=https://www.wicell.org#tbl4]. The appropriate final concentration for the DNA inserts and linearized vector should be adjusted according to their lengths as depicted in Table 4[href=https://www.wicell.org#tbl4]. Mix the reaction.\ntable:files/protocols_protocol_161_6.csv\nIncubate the reaction mixture at 50°C for 15 min and then immediately place it on ice.\nTransform competent Escherichia coli (E.coli) with the Gibson assembly reaction mixture.\nTake the competent cells out of −80°C. Add 50 μL in each microcentrifuge tube for one transformation and thaw the cells on ice for 20–30 min.\nAdd 5 μL cloning reaction mixture to 50 μL competent cells and place the mixture on ice for 30 min.",
    "Incubate the mixture at 42°C for 45 s and then immediately place it on ice for 2 min.\nAlternatives: A recovery step can be performed to increase the efficiency of transformation. Add 900 μL SOC or LB media to the mixture and incubate at 37°C for 30–60 min. This step is important for the cells to build ampicillin expression before getting transferred to the selection plate.\nPlate the mixture onto a 10 cm selection plate. Here we use LB agar plate containing the 100 μg/mL antibiotic ampicillin for the selection of colonies containing the recombinant plasmid selection.\nIncubate the transform plate at 37°C for ∼12 h.\nAlternatives: If recover step is performed, the ∼1 mL mixture should be plated on 2 different selection plates in 1:10 and 9:10 dilutions to prevent bacterial lawn.\nPause Point: The transform plate on which colonies grow out can be stored at 4°C for at least several days.\nDay 1: Isolate the correct recombinant plasmid in which all the three DNA inserts are correctly inserted by performing colony PCR.\nSet up a PCR tube and add 20 μL fresh selection liquid medium (LB medium containing 100 μg/mL ampicillin) in each tube.\nSet up the colony solution for the colony PCR. Use a 10 μL autoclaved pipette tip to pick a colony from the selection plate and pipette the selection liquid medium in the PCR tube.\nRepeat for as many colonies as desired.\nPrepare a 20 μL PCR for each colony PCR as depicted in Table 5[href=https://www.wicell.org#tbl5]. Add 2 μL colony solution to each PCR. Mix the reaction.\ntable:files/protocols_protocol_161_7.csv\nRun the colony PCR following Table 6[href=https://www.wicell.org#tbl6].\ntable:files/protocols_protocol_161_8.csv",
    "Load 5–10 μL of each PCR mix into in 1%–2% agarose gel and run electrophoresis to visualize the colony PCR products for each colony on the gel. Look for the DNA bands showing the expected size and distinguish the positive colonies.\nPause Point: The PCR mixture can be stored at −20°C for several days.\nRecombinant plasmid extraction.\nPipette the rest colony solution of the positive colony and put it into 10 mL selection liquid medium in a test tube. Shake the culture in the incubator at 250 rpm at 37°C for ∼12 h.\nDay 2: In the morning, use the QIAprep Spin Miniprep Kit to extract the plasmid from the culture. Elute the plasmid in a smaller volume of elution buffer (e.g., 50 μL) in a microcentrifuge tube from each 10 mL culture. Then adjust its final concentration to about 100 ng/μL. Use the NanoDrop Spectrophotometer to measure the concentration of the extracted plasmids.\nPause Point: The extracted plasmids can be stored at −20°C for several months.\nTake some of the plasmid solution for sequencing and store the rest at −20°C.\nDistinguish the correctly constructed recombinant plasmid according to the sequencing results. The recombinant plasmid should contain one copy of the target gene tagged with a fluorescent protein gene and an auxotrophic marker. This plasmid is to be used to integrate one copy gene tagged with a fluorescent protein gene into the corresponding auxotrophic marker locus in the yeast genome.\nNote: As the junction points between DNA inserts are prone to mutations, primers that read through these regions should be designed for sequencing.",
    "Repeat this construction procedure for constructing other two recombinant plasmids using other two plasmid backbones containing different auxotrophic markers. Obtain 3 recombinant plasmids with 3 different auxotrophic markers (e.g., His3, Leu2 and Trp1), namely, plasmid 1, plasmid 2 and plasmid 3. Performing the subsequent steps to sequentially transform these recombinant plasmids to the corresponding yeast strain can generate yeast strains with 2, 3 and 4 copies of the target gene.\nNote: Using the Gibson assembly protocol to ligate multiple DNA fragments into one vector may induce mutations. Thus, sequencing the positive plasmid according to the colony PCR results is necessary for the subsequent yeast transformation.\nYeast Transformation\nTiming: 2–3 days\nTransform the yeast strain with the recombinant plasmid (plasmid 1) to add one copy of the target gene into a 1-copy strain (background strain for transformation). The yeast transformation protocol used in this protocol is based on the previous one (Gietz and Woods, 2006[href=https://www.wicell.org#bib5]). Here we have made 3 changes: 1) we use 100 mM Lithium acetate to wash the yeast culture instead of sterile water to increase the permeability of yeast cell (step 18), 2) we include a step of incubating the mixture at 30°C for 30 min to increase the exposure of cells to the transformation mixture (step 23), and 3) we reduce the time of heat-shock at 42°C from 20 min to 15 min to decrease the heat-shock damages to the yeast cell (step 23).\nDay 3: Use an autoclaved 10 μL pipette tip to pick a single colony of the yeast strain which contains one copy of the target gene, pipette gently into 5 mL YPAD medium in a test tube and incubate at 30°C at 220 rpm for ∼12 h.]",
    "Day 4: In the morning, dilute the culture 1/20 into 10 mL YPAD medium in a flask. Incubate the culture at 30°C until it reaches at the mid-log phase (OD600 ≈ 0.6) (The number of yeast cells of 1 OD is ∼2×107/mL). The time for incubating varies dependent on the doubling time of the strain. A 3 mL culture is used for each transformation.\nNote: After diluting the culture, use the spectrophotometer to measure the OD600. The OD600 should be 0.05–0.2.\nTake salmon sperm DNA out of −20°C, thaw and dilute to 2 mg/mL. Boil salmon sperm DNA at 100°C for 5 min, immediately put it on ice, cool for at least 15 min before use.\nNote: The salmon sperm DNA is boiled every time for yeast transformation.\nPrepare the transformation mixture as depicted in Table 7[href=https://www.wicell.org#tbl7]. Vortex until the components are thoroughly mixed.\ntable:files/protocols_protocol_161_9.csv\nNote: PEG is a hygroscopic chemical and absorbs a lot of moisture. To make a 50% w/v concentration of the PEG solution, the volume of water should be increased slightly. We suggest place 10 g PEG3350 in a 100 mL glass beaker and add 12 mL ddH2O to appropriately provide a 50% w/v concentration. Stir for 1–2 h with a magnetic stirring bar until dissolved. Sterilize the PEG solution by filtration and store at ∼25°C.\nLinearize the recombinant plasmid in the restriction enzyme reaction as depicted in Table 3[href=https://www.wicell.org#tbl3].",
    "Note: The cut site of the recombinant plasmid should be chosen appropriately to make sure that the gene copy can be integrated at the specific marker locus in the yeast genome. Take one recombinant plasmid that we constructed to integrate WHI5 copy gene for example. The integrating plasmid should have 5′ UTR of HIS3, Candida Glabrata HIS3 (including promoter and terminator), WHI5 gene, tdTomato ORF, WHI5 terminator and 3′ UTR of HIS3 after linearization. So that the WHI5 gene copy can be inserted into the HIS3 locus in the yeast genome locus by homologous recombination.\nSet up a 15 mL centrifuge tube and add 3 mL cell culture. Pellet cells by centrifugation at 2,500 × g at ∼25°C for 5 min. Use the pipette to remove the supernatant.\nUse 300 μL 100 mM Lithium acetate (sterilized by filtration) to wash cell pellet from 3 mL cell culture. Gently pipette the cells using Lithium acetate and centrifuge at 2,500 × g at ∼25°C for 5 min. Use the pipette to remove the supernatant. Repeat this step once.\nNote: Use a 200 μL pipette tip to remove all the supernatant. Leftover of the supernatant can reduce the efficiency of yeast transformation.\nResuspend cells in 30 μL 100 mM Lithium acetate. Gently pipette the cells.\nSet up a microcentrifuge tube and add the cell solution.\nAdd 153 μL transformation mixture into each microcentrifuge tube. Mix by gently pipetting.\nAdd ∼400 μg digested plasmid into each microcentrifuge tube and mix by vortexing briefly.\nIncubate the mixture at 30°C for 30min and then at 42°C for 15min.\nCentrifuge the mixture at 2,500 × g for 1min. Use a 200 μL pipette tip to discard the supernatant. Resuspend cells into 100 μL YPAD medium by gently pipetting.",
    "Incubate the resuspended cells at 30°C for 3–4 h to increase the transformation efficiency.\nUse an autoclaved glass spreader to plate the cells on the selective plate. Incubate the plate at 30°C for 2–3 days. See Materials and Equipment[href=https://www.wicell.org#materials-and-equipment] for recipe for the selective plate.\nCritical: Be sure to make selection plates suitable for the plasmid being transformed (e.g., transformation with the plasmid constructed based on pNH603, omit Histidine in the medium when making the selection plate.)\nPause Point: The transform plate on which colonies grow out can be stored at 4°C for at least several days.\nNote: Make liquid stocks of the corresponding ingredients needed for making synthetic complete (SC) media and sterilize them by filtration. Dissolve 20 g agar in ddH2O, autoclave, then add the stocks of rest ingredients, and fully mixed, cool to 60°C, then pour the plates. Omit the amino acid for the transformation of plasmid that bears the corresponding auxotrophic marker. Recipe for SC media is included in Materials and Equipment[href=https://www.wicell.org#materials-and-equipment].\nDay 5–6: Verify the transformation of the recombinant plasmid into the yeast genome by performing PCR.\nSet up a PCR tube that contains a 20 μL colony PCR in each tube as depicted in Table 5[href=https://www.wicell.org#tbl5].\nUse a 10 μL autoclaved pipette tip to gently pick trace amount of colony from the selection plate and briefly swirl it in the PCR tube.\nRepeat for as many colonies as desired. Store the transform plate at 4°C.\nRun the colony PCR following Table 6[href=https://www.wicell.org#tbl6].\nLoad 5–10 μL of each colony PCR products into 1%–2% agarose gel and run DNA electrophoresis to visualize the colony PCR products for each colony on the gel. Check correct insertion by looking for the DNA bands showing the expected size and distinguish the positive colonies.",
    "Note: To amplify DNA fragments >1,000 bp, one should extract the genome of the corresponding colony to prevent the failure of PCR. The genome extraction step as depicted in the “Genome Extraction” section.\nAlternatives: The plasmid integration locus can be verified by DNA sequencing instead of using PCR.\nPause Point: The PCR products can be stored at −20°C for several days.\nMeasurement of Fluorescent Intensity Level\nTiming: 1–2 days\nUse the fluorescent microscope and ImageJ to measure the fluorescent intensity level of each positive colony. Use the fluorescent intensity level as a quantitative readout of the expression level of the target gene in each strain.\nInoculate the positive colonies from the transformation plate (stored at 4°C). Inoculate the control strain which contains 1 copy of the target gene fused with the same fluorescent protein from the plate stored at 4°C. Each single colony is inoculated from the corresponding agar plate with a pipette tip into a test tube containing 4 mL selective liquid medium and incubate at 30°C at 220 rpm for ∼12 h.\nAlternatives: If the strain is stored on glycerol at −80°C or −70°C, scrape off a small amount of frozen glycerol stock with a sterile inoculator or pipette tip and patch onto a YPAD plate. Keep the stock frozen. Incubate at 30°C for 2–3 days. When single colonies are visible, streak out on YPAD plate and incubate at 30°C for 1–2 days. Inoculate a single colony from this plate. This plate can be stored at 4°C for future use.\nDay 7–8: In the morning, dilute the culture 1/20 into 10 mL YPAD medium in a flask. Incubate the culture at 30°C until it reaches at the mid-log phase (OD600 ≈ 0.6). The time for incubating varies dependent on the doubling time of the strain.",
    "Acquire images of the fluorescent cells by the fluorescence microscope.\nDrop about 10 μL cell culture on a glass slide and apply a cover slip.\nAcquire images of the fluorescent cells using a Nikon Eclipse TiE microscope with an Apo 100×/1.49 oil TIRF objective. Exposure times of 50–100 ms are typically used in the fluorescent channel. A 540–580 nm excitation and a 600–660 nm barrier filter is typically used to detect tdTomato signals. A 465–495 nm excitation and a 515–555 nm barrier filter is typically used to detect GFP signals.\nUse ImageJ to quantify the fluorescent level of fluorescent cells.\nSelect the cell and measure its area and total fluorescent intensity.\nSelect 3 regions in the fluorescent image that has no fluorescence. These regions are the background. Measure the mean fluorescent intensity of the 3 regions and calculate the mean value (Vm). Vm is used to correct the total fluorescent intensity for each cell on the same fluorescent image.\nCorrect the total fluorescent intensity for each cell by this formula: corrected total fluorescent intensity = total fluorescent intensity – (area of selected cell × Vm).\nQuantify multiple cells of each strain. Calculate the averaged value of the mean fluorescent intensity of each strain (Va). Va is the quantitative readout of the fluorescent intensity level of the target gene in the corresponding strains.\nDistinguish transformants which shows a Va ∼1 fold higher than the Va of the control strain. Strain contains 2 copies of the target gene is obtained.\nAdd the third copy of the target gene to the 2-copy strain to generate 3-copy strain.\nRepeat steps 12–27 to transform the 2-copy strain with another recombinant plasmid (plasmid 2) to generate the 3-copy strain.",
    "Note: Perform PCR to check after each transformation if the previous copy that has been integrated before is still in the corresponding marker locus in the yeast genome.\nRepeat steps 28–33 to measure the fluorescent intensity of the positive transformants. Distinguish the transformant which shows a higher Va compared to the Va of the 2-copy strain. The strain that contains 3 copies of the target gene is obtained.\nAdd the fourth copy of the target gene to the 3-copy strain to generate 4-copy strain.\nRepeat steps 12–27 to transform the 3-copy strain with plasmid 3 to generate the 4-copy strain. Use the recombinant plasmid that contains a different auxotrophic marker to perform the yeast transformation.\nRepeat steps 28–33 to measure the fluorescent intensity of the positive transformants. Distinguish the transformant which shows a Va ∼1 fold higher than the Va of the 3-copy strain. The strain that contains 4 copies of the target gene is obtained. Then 3 different strains that contain 2, 3 and 4 copies of the target gene are constructed."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}