{
  "id": 12167,
  "origin_website": "Jove",
  "title": "Neutrophil Extracellular Traps Generated by Low Density Neutrophils Obtained from Peritoneal Lavage Fluid Mediate Tumor Cell Growth and Attachment",
  "procedures": [
    "LDN were obtained from patients enrolled in this study and were approved by the Institutional Review Board of Jichi Medical University.\n1. Isolation of LDN from Abdominal Cavity Lavages and NET Detection\nSample acquisition\n\t\nInfuse 1,000 mL of normal sterile saline directly into the abdominal cavity before wound closure in patients who have undergone abdominal surgery due to gastrointestinal malignancy.\n\t\tNOTE: Samples were obtained from patients who underwent a gastrectomy, colectomy, or esophagectomy without bias based on age or sex. Saline was transferred into a container and poured into the whole abdomen within one minute. This is routinely performed as a postoperative peritoneal washing without significant effects on patients.\nLavage the abdominal cavity extensively for at least 1 min.\n\t\tNOTE: It is recommended that the infused fluid is slowly stirred with the surgeon's hands so that the samples are uniform.\nRecover 200 mL of lavage fluid with four 50 mL syringes.\n\t\tNOTE: Sometimes a rubber connector is used to take up the fluids.\nPerform purification of peritoneal LDN using granulocyte specific mAb, CD66b16.\n\tNOTE: Because the intermediate layer after density gradient centrifugation contains many mononuclear cells, positive selection of polymorph neutrophils using CD66b mAb was performed.\n\t\nTransfer the peritoneal lavage fluid to a 50 mL tube.\n\t\tNOTE: In this step, pass the fluids through a 100 µm nylon filter to remove impurities.\nCentrifuge the peritoneal fluid at 270 x g for 7 min at RT.\nResuspend the pellets in 5 mL of PBS with 0.02% EDTA.\nCarefully overlay the 5 mL of cell suspension on a 3 mL density gradient solution.\nCentrifuge at 1,700 x g for 15 min at RT without any breaks.",
    "Harvest the ~2 - 3 mL of solution containing the intermediate layers (Figure 1A) using a pipette and mix it with 10 mL of PBS with 0.02% EDTA.\nCentrifuge the peritoneal fluid at 400 x g for 7 min at RT and discard the supernatant.\nAdd another 10 mL of PBS with 0.02% EDTA, and centrifuge at 270 x g for 7 min at RT. Discard the supernatant.\nDissolve the cell pellet (1 x 107) in 60 µL of buffer for the magnetic cell separation kit.\nAdd 20 µL of Fc block to the pellets and incubate for 10 min at 4 °C.\nAdd 20 µL of the anti-CD66b conjugated with microbeads and incubate for an additional 10 min at 4 °C.\nWash and re-suspend the pellets in 500 µL of MACS buffer.\nApply the cell suspension to a magnetic column in the magnetic field of a suitable magnetic separator and collect the flow-through containing CD66b(-) cells by washing the column with 15 mL of buffer.\nRemove the column from the magnetic separator and immediately flush out the magnetically labeled CD66b(+) cells by firmly pushing the plunger into the column.\n\t\tNOTE: The CD66b(+) cell population consists mostly of neutrophils as determined by FACS analysis indicating that >95% of the CD66(+) fraction are positive for CD11b, CD15, and CD16, but negative for CD14.\nGeneration of NETs\n\t\nAfter centrifugation at 270 x g for 7 min at RT, re-suspend the isolated LDN (5 x 106) in 1 mL of RPMI1640 with 10% FCS.\nCulture the LDN on a 6-well poly-L-lysine coated plate (6 cm in diameter) for 2 h at 37 ˚C in 5% CO2.\nAdd the green fluorescent counterstain (a membrane-impermeable dye to stain the nucleus and chromosomes) at the final concentration of 5 µM.",
    "Immediately observe the morphology of NETs (the extracellular DNA components expelled from the LDN under fluorescence microscopy).\n2. Staining of Tumor Cells with Red Fluorescent Cell Linker Dye\nPrepare human cancer cell lines MKN45, NUGC, and OCUM-1.\nWash 1 x 107 cells with PBS + 0.02% EDTA in a 15 mL tube and centrifuge at 270 x g for 7 min at RT.\nAdd 1 mL of solution for dye staining to the pellets, and pipette gently.\nDissolve 4 µL of Red Fluorescent Cell Linker dye in 1 mL of solution for staining and mix with the cell suspension from step 2.2.\nIncubate the pellets for 4 min at RT.\nAdd 4 mL of DMEM (10% FBS) to stop the staining reaction.\nCentrifuge 270 x g for 7 min and discard the supernatant.\nRepeat steps 2.6 and 2.7 twice.\nCheck with a fluorescence microscope (excitation = 551 nm, emitting = 567 nm) that the tumor cells are stained red.\n3. Analysis of Tumor Cell Adhesion to NETs\nRe-suspend the red fluorescent stained tumor cells (1 x 106) in 1 mL of RPMI 1640 supplemented with 0.1% BSA.\nAdd the tumor cells to the LDN culture that produced the NETs as described in step 1.3.\nIncubate for 5 min at 37 ˚C, which enables the tumor cells to contact the NETs.\n\tNOTE: Long incubation induces tumor cell adhesion to LDN or to the plates.\nRemove the medium and gently wash the wells by adding 2 mL of prewarmed media (0.1% BSA + RPMI 1640) and swirling the dish.\nRepeat the washing procedure in step 3.4 twice.\n\tNOTE: Since NETs weakly attach to the plate, washing should be done as gently as possible to avoid removal of the NETs themselves.",
    "Add the green fluorescent dye for staining the nucleus and chromosomes at a final concentration of 5 µg/mL for visualization of the NETs.\nObserve the NETs and attached tumor cells using the appropriate filters (green, excitation = 504 nm, emitting = 523 nm; red, excitation = 551 nm, emitting = 567 nm).\nMerge the figures to show the tumor cells that are trapped by the NETs.\n\tNOTE: In some experiments, DNA degradation enzyme was added to the LDN culture (final concentration of 100 U/mL) 5 min before co-incubation for 5 min.\n4. Time Lapse Video Analysis of the Trapped Tumor Cells\nCulture the peritoneal LDN in a 35 mm round dish coated with poly-L-lysine as described in step 1.3.\nAdd the green fluorescent dye for staining the nucleus and chromosomes to visualize NETs as described in step 1.3.\nAfter 1 min of incubation, remove the media and add 2 mL of 0.1% BSA + RPMI 1640.\nRemove the media and add unstained 1 x 106 MKN45 cells suspended in 0.1% BSA + RPMI 1640. Incubate for 5 min at RT.\nRemove any unattached tumor cells by gently washing as described in step 3.4 and add DMEM with 10% FCS supplemented with 100 u/mL Penicillin and 100 µg/mL streptomycin.\nMount the culture dish in a whole-view cell observation system and select the appropriate field in which tumor cells are trapped by the NETs.\nContinue to co-culture for an additional 2 days and take continuous photos of the field every 6 min under normal light and fluorescence, which detects MKN45 cells and NETs, respectively.\nSuperimpose the images at each timepoint and construct time-lapse videos using Image Viewer software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}