{
  "id": 15123,
  "origin_website": "Jove",
  "title": "Navigating MARRVEL, a Web-Based Tool that Integrates Human Genomics and Model Organism Genetics Information",
  "procedures": [
    "1. How to begin a search\nFor the human gene and variant-based search, go to steps 1.1.1.-1.1.2. For human gene-based search (no variant input), go to step 1.2. For model organism gene-based search, refer to steps 1.3.1.-1.3.2.\n\t\nGo to the home page of MARRVEL4 at http://marrvel.org/. Start by entering a human gene symbol. Ensure that the candidate gene names are listed below the input box with each character entry. If the search comes back negative, make sure the gene symbol used is up to date using the HUGO Gene Nomenclature Committee website5 (HGNC; https://www.genenames.org/).\nEnter a human variant. The search bar is compatible with two types of variant nomenclature: genome location similar to how variants are displayed on ExAC and GnomAD6 and transcript-based nomenclature according to HGVS guidelines. Examples of such formats are shown in grey text within the search box. For genomic location nomenclature, use the coordinates according to hg19/GRCh37. Proceed to step 2.\n\t\tNOTE: If a search returns an error, the most common problems are either the gene symbol is not up to date or the variant nomenclature is incorrect. In those cases, the HGNC (https://www.genenames.org/), Mutalyzer7 (https://www.mutalyzer.nl/), and TransVar8 (https://bioinformatics.mdanderson.org/transvar/) websites are great resources to correct the error. HGNC provides official gene symbols and their aliases for all human genes.     \nIf still encountering error messages after confirming the gene name is up to date, use Mutalyzer and TransVar to check and convert variant nomenclature.\nIn some situations, such as a very recent gene symbol change in HGNC, try using a synonym for the gene and please contact the MARRVEL operating team using the \"Feedback\" tab so to update the source data, as MARRVEL may not provide the correct information due a lag in data update.",
    "Enter a human gene symbol and leave the human variant search bar blank. If an error is encountered, go to HGNC (https://www.genenames.org/) to check for the official gene symbol or try an older gene symbol.\n\t\nClick on Model Organisms Search tab on the top banner (Figure 1) or go to http://marrvel.org/model. Select the model organism of choice and enter a model organism gene symbol. Click on the gene symbol as the name is autocompleted and then click Search. If the search result is negative, check the official gene symbol that is used in model organism databases (Table 1).\nIf the search result is still negative, access DIOPT (DRSC Integrative Ortholog Prediction Tool, https://www.flyrnai.org/cgi-bin/DRSC_orthologs.pl) and HCOP (https://www.genenames.org/tools/hcop/) to assess if there are no good predicted orthologs for the gene of interest. DIOPT is an ortholog prediction search engine run by the DRSC (Drosophila RNAi Screening Center) and HCOP is a similar suite developed by HGNC.\n\t\tNOTE: Additional searches using BLAST (https://blast.ncbi.nlm.nih.gov/Blast.cgi) may allow users to find orthologs that may be missed by prediction algorithms used in DIOPT and HCOP.\nClick on the MARRVEL it at the bottom for the predicted human ortholog of choice. Check the DIOPT score9 and Best score from Human gene to model organism? for the selection of the human gene. Proceed to step 2.",
    "NOTE: DIOPT score9 (https://www.flyrnai.org/cgi-bin/DRSC_orthologs.pl) is a value of how many ortholog prediction algorithms predict a pair of genes in two organisms to be orthologous to one another. For more information about these values and the specific algorithms used to calculate this score, refer to Hu et al9. When Best score from Human gene to model organism? is Yes, it indicates that the human gene is more likely a true human orthologs of the gene of interest but there could be exceptions, especially when multiple human genes are orthologous to multiple model organism genes due to gene duplication events during evolution. If the gene of interest is a member of a complex gene family that have undergone divergent evolution in multiple species, users should identify a publication that has performed an extensive phylogenetic analysis of the gene family of interest to identify the most likely ortholog candidate gene.\n2. How to interpret MARRVEL human genetics outputs for a gene and variant search\nNOTE: On the results page, there are seven human databases that are displayed (Table 1, Figure 1). For each output box, there is an External link button (small box with a diagonal arrow) on the upper right-hand corner that will link to the original database for more details.\nClick OMIM (Online Mendelian Inheritance in Man, https://www.omim.org/)10, the first database that is displayed.\n\tNOTE: OMIM is a manually curated database that aggregates and summarizes information on genetic diseases and traits in the human.\n\t\nUse the Human Gene Description box from OMIM for a short summary of what is known about the gene and gene product.\nUse the Gene-Phenotype Relationships box to determine if this gene is a known disease-causing gene or not. This box provides manually curated known disease or phenotype associations with the gene of interest.",
    "Use the Reported Alleles from OMIM box to get a list of pathogenic variants curated by OMIM.\n\t\tNOTE: Since manual curation of a publication regarding a new disease gene discovery is necessary for any gene-disease association to appear in OMIM, some time lag and/or missed publications may lead to misconception. It is recommended that users perform PubMed (https://www.ncbi.nlm.nih.gov/pubmed/) searches to look into recent literature as well (See 4.1.2.). For additional information curated in OMIM, refer to Amberger10,11.\nClick ExAC (Exome Aggregation Consortium, http://exac.broadinstitute.org/)6 and gnomAD (genome Aggregation Database, http://gnomad.broadinstitute.org/), large population genomics databases based on WES and WGS of people who are selected to exclude severe pediatric diseases.\n\tNOTE: ExAC contains ~60,000 WES whereas gnomAD contains ~120,000 WES and ~15,000 WGS. Both ExAC and gnomAD can be used as a control population database, especially for severe pediatric disorders, but its interpretation requires some degree of caution. In general, gnomAD can be considered as an updated and expanded version of ExAC since most cohorts that are included in ExAC is also included in gnomAD. However since there are some exceptions (see cohort information in http://exac.broadinstitute.org/about and http://gnomad.broadinstitute.org/about, respectively), MARRVEL displays data from both sources.\n\t\nUse the Control Population Gene Summary box to obtain gene-level statistics such as the probability of finding the loss of function (LOF) alleles in the general population. This is called the pLI (probability of LOF Intolerance) score in ExAC and can be used to infer how likely a single copy of a LOF allele for a specific gene may cause a dominant disease through haplo-insufficient mechanisms.",
    "NOTE: Looking at the pLI score of a gene has value, especially when dealing with dominant disorders that present as severe pediatric diseases associated with de novo variants. If a gene has a pLI score of 0.00, it means it is highly tolerant of LOF variants thus the gene unlikely cause disease via a dominant haploinsufficiency mechanism. This does not, however, necessarily rule out other dominant gain of function (GOF) or dominant negative mediated mechanisms may cause disease. In addition, genes that cause the recessive diseases may have low pLI scores since careers are expected to be found in the general population. On the other hand, if a gene has a pLI score of 1.00, it is possible that the loss of one copy of this gene is detrimental for human health. Additional searches in websites such as DOMINO (https://wwwfbm.unil.ch/domino/) may also be used in combination to assess the likelihood of a variant in a specific gene causing a dominant disorder.\nUse the next two boxes to obtain the allele frequencies of the variant of interest in ExAC and gnomAD, respectively to help interpret whether or not the variant may be pathogenic depending on if the patient has the dominant or recessive disease. This box will only be displayed when the user inputs variant information when initiating the search.",
    "NOTE: If one hypothesizes a recessive disease scenario and the pLI score of the gene of interest is low, one should pay attention to the allele frequency listed here. Some geneticists may establish a cut-off point of 0.005 to 0.0001 as the maximum allele frequency for pathogenic variants that can cause a severe recessively inherited disease2. On the other hand, if one hypothesizes a dominant disease scenario, it is less likely to find the identical or similar variant in a control population. Again, this requires caution because individuals with late-onset disorders, diseases with mild presentation, psychiatric disorders or diseases not screened by the ExAC/gnomAD researchers may be still included and the variant may still be a dominant pathogenic variant. Also, there have been some instances of variants linked to pediatric conditions found in a few individuals in these databases12,13,14, potentially due to incomplete penetrance or somatic mosaicism13,15,16. In addition, although ExAC and gnomAD will display variants that are found in a homozygous state, it will not indicate whether any of the variants are found in a compound heterozygous state. Finally, some variants found in these databases are tagged as low confidence due to technical challenges in sequencing (e.g. low sequence coverage, repetitive sequence). To look more carefully into these data sets, users are recommended to use the external link button to visit the original ExAC and gnomAD websites to gain additional information.\nClick Geno2MP (Genotype to Mendelian Phenotype Browser, http://geno2mp.gs.washington.edu/Geno2MP/), a collection of WES-based data from the University of Washington Center for Mendelian Genetics. It contains about 9,600 exomes (as of 1/18/2019) of affected individuals and unaffected relatives with some phenotypic descriptions (Figure 1).\n\t\nUse the Disease population box to obtain the allele frequency of the variant of interest in this cohort.",
    "Use the Gene-Phenotype Relationships box to obtain HPO (human phenotype ontology)17 terms for the individuals with the variant of interest. This is one of many ways for one to look for patients that may have the same disease.\n\t\tNOTE: If a gene of interest is suspected to be associated with a patient’s disease and there are matches found in Geno2MP, additional important information may be present in the data source beyond what is displayed.\n\t\t\nClick the external link button to the gene-specific page on Geno2MP, filter for mutations that are similar to those of the patient (e.g., missense, LOF), and carefully review the lists of variants. Take note of the variants with high CADD18 scores and click into the HPO profiles. For example, CADD scores higher than 20 are within the top 1% of all variants predicted to be deleterious, CADD scores that are higher than 10 are within the top 10%. HPO terms provide a standardized description of human phenotypes. Here, make sure to check if the variant was identified in an affected individual or in a relative.\nIf variants are found in patients that are affected in the same organ system as the patient, consider using the e-mail form to contact the physician that submitted these cases to Geno2MP using the feature provided on the Geno2MP website.\n\t\t\tNOTE: Not all physicians respond to such queries, so one should explore other avenues of patient matchmaking. Other ways to gather a cohort of patients affected by the same diseases is to use tools such as GeneMatcher19 (https://www.genematcher.org/) and other databases that are part of the Matchmaker Exchange19,20 (https://www.matchmakerexchange.org/). See accompanying JoVE article for more information on matchmaking21.",
    "Use the ClinVar (https://www.ncbi.nlm.nih.gov/clinvar/)22 database, supported by the National Institutes of Health (NIH), where researchers and clinicians submit variants with or without determination of pathogenicity, for checking single nucleotide variants (SNV), small indels and larger copy number variations (CNV).\n\t\nUse the top row to review a summary of the number of each type of variants reported in ClinVar (Figure 1).\nCheck the list of variants below in the box Reported Alleles from ClinVar.\n\t\tNOTE: If a variant was included in the initial search, the highlighted variants in teal are all variants that include the genomic location of the variant of interest [including large CNVs, which are often labeled as; genomic coordinate…x1 (deletion) and …x3 (duplication)].\nUse DGV23 (Database of Genomic Variants, http://dgv.tcag.ca/dgv/app/home) and DECIPHER24 (DatabasE of genomiC varIation and Phenotype in Humans using Ensembl Resources, https://decipher.sanger.ac.uk/), both collections of CNVs. DGV is the largest public-access collection of structural variants from more than 54,000 individuals. This database includes samples of reportedly healthy individuals, at the time of ascertainment, from up to 72 different studies. Similarly, the data displayed from DECIPHER includes common variants from the control population.\n\tNOTE: Since MARRVEL does not have permission to display patient derived data from DECIPHIER, users are encouraged to directly visit the DECIPHER website to access potentially pathogenic CNV information.\n\t\nClick the Copy Number Variation in Control Population (DGV Database) box to obtain variants that contain the gene of interest. Information such as the size, subtype, and reference of the copy number variation can be found in the same box.\nClick the Common Copy Number Variants (DECIPHER Database) box to obtain variants that contain the genomic location of the variant of interest. This information may help determine if the gene is duplicated or deleted in the control individuals.",
    "NOTE: If the gene of interest is deleted in many individuals in the control population, it means that this gene is likely to be highly tolerant of LOF variants. Like low pLI scores, this suggests that a single copy loss of this gene is less likely to cause a severe disease via a haploinsufficiency mechanism. This does not, however, necessarily rule out other dominant gain of function or dominant negative mechanisms (e.g. antimorphic, hypermorphic and neomorphic alleles) caused by specific missense and truncation alleles.  Possible limitations to these data include variation in source and method of the data acquired, lack of information regarding incomplete penetrance of pathogenic CNVs, and whether individuals developed certain diseases subsequent to data collection.\n3. How to use model organism data in MARRVEL\nUse the Gene Function Table to obtain the following information for eight model organisms including human (human, rat, mouse, zebrafish, Drosophila, C elegans, budding yeast and fission yeast):\n\t\nGene name: Since each gene name is hyperlinked to gene pages on respective model organism databases, click on these links to find out more about the phenotypic information and resources available for each model organism. For example on FlyBase25 (http://flybase.org/), there will be a list of all alleles that have been generated, their respective phenotypes and the availability of each allele from public stock centers.\nPubMed link: Click on the PubMed link to go to a list of publications that relates to the gene of interest in each organism. Without using these links, searching for the human gene directly in PubMed may lead to missing some publications that used an old gene alias to refer to the human gene. Similarly, model organism gene names may have fluctuated historically.",
    "DIOPT9 score: Check this column for a score of how many ortholog prediction algorithms predict the gene is likely to be an ortholog of the human gene of interest. One may use a DIOPT score of 3 or above as a reasonable cut-off to identify solid ortholog candidates. However, there are cases where genuine orthologs only have a DIOPT score of 1 due to limited homology. At the top of the gene function table, un-check the \"Show only best DIOPT score gene\" box to display all candidates that typically include homologous genes that are not necessarily orthologs.\nExpression: Check this column for the list of the tissues where the gene or protein of interest has been reported to be expressed in human or model organism databases. Human gene and protein expression data are from GTEx26 (https://gtexportal.org/) and Human Protein Atlas27 (https://www.proteinatlas.org/), respectively. Some have a button with pop-up links, such as for human and for fly that display the expression pattern using a heat map, whereas others are hyperlinked to respective model organism databases pages.\nGene Ontology28 (GO) terms: Filter by experimental evidence codes and obtain from respective human or model organism databases. GO terms based on \"computational analysis evidence codes\" and \"electronic annotation evidence codes\" (predictions) are not displayed. Please visit each model organism website to gather this information if necessary.",
    "Other links such as Monarch Initiative29 (https://monarchinitiative.org/) and IMPC30 (http://www.mousephenotype.org/): Use the Monarch Initiative hyperlink to navigate to the Phenogrid page for the specific human gene, a chart that provides a quick comparison between the phenotypes associated with the gene of interest to known human diseases and model organism mutants that have phenotypic overlaps. If a mouse gene has a knockout mouse made or planned by the International Mouse Phenotyping Consortium (IMPC), the \"IMPC\" links to the page that details the phenotype of the knockout mouse and its availability from public stock centers.\nHuman Protein Domains: Use the human gene protein domains box to obtain predicted protein domains of the human gene. The data are derived from DIOPT, which uses Pfam (https://pfam.xfam.org/) and CCD (Conserved Domains Database, https://www.ncbi.nlm.nih.gov/Structure/cdd/cdd.shtml). A single residue maybe annotated more than once due to some overlap in domains annotated in the two sources.\nUse the Multiple Protein Alignment box to obtain the amino acid multiple alignment generated by DIOPT9  which includes human (hs), rat (rn), mouse (mm), zebrafish (dr), fruit fly (dm), worm (ce), and yeasts (sc and sp). To highlight the amino acid of interest, scroll down to the bottom of the box and enter the amino acid numbers below and the amino acids of interest will be highlighted in teal. The alignment is provided by DIOPT and uses MAFFT aligner (Multiple alignment program for amino acid or nucleotide sequences, https://mafft.cbrc.jp/alignment/software/31).",
    "NOTE: If the amino acid that is highlighted based on the number is not the one expected, it may be due to different splicing isoforms used for the alignment. In principle, DIOPT uses the longest isoform to display in this box. Also, for segments of genes that are not well conserved, alignment of multi-species sequences using default parameters may not be optimal. We recommend using other websites and software like Clustal Omega and ClustalW/X (http://www.clustal.org/)32 to optimize the alignment parameters and matrices accordingly.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}