{
  "id": 19798,
  "origin_website": "Wiley",
  "title": "Methods to Evaluate the Potential Clinical Significance of Antibodies to Red Blood Cells",
  "procedures": [
    "MMA is an in vitro assay which is used to predict blood transfusion outcomes in patients with auto- or alloantibodies to RBCs. In this assay, anti-RBC antibodies are assessed for their Fcγ receptor (FcγR)-mediated phagocytosis. Through serological methods, compatibility testing or crossmatching is performed. Once the presence of antibodies to RBCs is detected, MMA can be further used to identify the clinical significance of the anti-RBC antibody by testing them against specific RBC antigens (e.g., opsonizing Kell positive RBCs with anti-Kell antibody). The phagocytosis results from the MMA can help reduce the risk of post-transfusion hemolysis. Cells of interest in the MMA are the peripheral blood mononuclear cells (PBMCs) due to the mononuclear phagocyte system's involvement in mediating the extravascular hemolysis of antibody-bound RBCs. Apart from predicting post-transfusion survival or clearance of RBCs, MMA can be used to study other aspects of the IgG antibody and FcγR interaction that induce phagocytosis.\nThis protocol is modified from the work by Tong and Branch (2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-bib-0025]).\nMaterials\nRPMI-1640 complete culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-rec-0004])\nCytiva Ficoll Paque PLUS, density 1.077 g/L (Thermo Fisher Scientific, 17-1440-03)\nFresh whole blood collected in acid-citrate-dextrose (ACD) tubes (yellow-top tubes; minimum of two blood tubes should be collected for MMA)\nFresh whole blood collected by venipuncture into red-top (no additive) serum separator tubes\nRh positive (R2R2) red blood cells (control; Blood Collection Center, Canadian Blood Services; also commercially available)\nAnti-Rh(D):\n               \nCommercial source of Rh immune globulin (e.g., WinRho® SDF CDN, Saol Therapeutics, 1003092)\nRh immune globulin (to opsonize control red blood cells; R2R2 RBCs)\nACK lysis buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-rec-0001])\n1× PBS, pH 7.4, without Ca2+/Mg2+ (Wisent Bioproducts, 311-425-CL)\nRed blood cell storage/stabilization solution: ID-CellStab (Bio-Rad, 005650 05740)\n100% methanol\nAnti-Human Globulin (AHG; commercial source)\nElvanol mounting medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-rec-0002])\nTrypan Blue solution (Thermo Fisher Scientific, 15250061)",
    "Nunc® Lab-TekTM II Chamber SlideTM with Cover, RS Glass Slide Sterile (Thermo Fisher Scientific, 154534)\nCoverslips (24 × 50 mm; VWR, 48393-081)\nManual cell counters\nIsolate PBMCs\n1. Obtain human whole blood from donor or patient in ACD tubes and red-topped serum tubes. Store whole blood in ACD tubes at room temperature (18°C to 22°C) and red-topped serum tubes at 4°C to allow separation of serum.\nIt is recommended, for optimal function, that the PBMCs from whole blood ACD tubes be isolated and used within 36 hr of collection.\n2. Transfer room temperature blood from whole blood ACD tubes to 50-ml Falcon tubes (approximately one 50-ml Falcon tube for every two ACD tubes). Add equal volume of the room temperature RPMI-1640 complete medium to the blood (1:1 ratio of whole blood to medium), for a final volume of 35 ml.\n3. Add 15 ml room temperature Ficoll Paque Plus to a new 50-ml Falcon tube.\n4. Carefully layer the 1:1 diluted whole blood on top of the Ficoll Paque Plus density gradient to minimize amount of mixing at the interface for optimal separation of blood.\nThe 50-ml Falcon tube can be tilted at a 45° angle and blood can be added dropwise by placing pipet tip close to the density gradient and enabling blood mixture to run down the side of the tube very slowly. Typically, 10 ml of whole blood yields 10 million PBMCs with some donor-to-donor variation.\n5. Centrifuge the layered mixture at 700 × g for 30 min with brakes OFF.\nThe density gradient centrifugation will separate the mixture into (from top to bottom; Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0001]):\nPlasma (top),\nBuffy coat (containing PBMCs),\nDensity gradient material (Ficoll Paque Plus),\nGranulocytes,\nRed blood cells (bottom).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/144ada97-fb23-4f53-abe1-60c4c4b7e3f7/cpz1504-fig-0001-m.jpg</p>\nFigure 1",
    "General experimental flow diagram of the monocyte monolayer assay (MMA). PBMCs isolated from whole human blood are seeded onto chamber slides to allow monocyte adherence for 1 hr. Opsonized RBCs are then added to the monocytes for the phagocytosis to occur. After 2 hr incubation, the chamber slides are washed, and the phagocytic index is determined by counting phagocytosis events under the microscope. Results are considered significant when the phagocytic index exceeds 5 phagocytosed RBCs in 100 monocytes. Abbreviations: PBMCs, peripheral blood mononuclear cells; RBCs, red blood cells.\n6. Aspirate and discard the majority of the topmost layer (supernatant) which is plasma, leaving 1-2 ml remaining above the buffy coat layer, and carefully retrieve the buffy coat (PBMCs) layer. (Using plastic or glass Pasteur pipets with a suction bulb while performing circular motions is recommended.) Transfer the retrieved PBMCs into a new 15-ml tube.\n7. Wash the isolated buffy coat layer two times with pH 7.4 PBS solution for 10 min at 350 × g with full brakes ON in between washes.\n8. Lyse any RBCs carried over with ACK lysis buffer. Add 5-10 ml ACK lysis buffer, depending on pellet size, and incubate at room temperature for 5 min. After incubation, top up with pH 7.4 PBS and centrifuge 10 min at 350 × g with full brakes ON and wash one more time.\n9. Reconstitute PBMC pellet in 3-7 ml (depending on the size of the pellet) RPMI-1640 complete medium.\n10. Count PBMCs using a hemocytometer in a 1:1 staining ratio with trypan blue by only counting the cells not stained with trypan blue. Reconstitute PBMCs to 1,750,000 cells/ml in RPMI-1640 complete medium.",
    "11. Seed 400 μl (700,000 cells) using a micropipet into each well of the 8-well chamber slide and incubate at 37°C, 5% CO2 for 1 hr in a humidified tissue culture incubator.\nPre-treatment of adhered monocytes\nSteps 12-13 are only necessary if trying to inhibit or enhance phagocytosis.\n12. Adhered monocytes can be pre-treated with any drug(s) or compound(s) of interest. Reconstitute the test material in RPMI-1640 complete medium to the desired concentration.\nFor example, 200 μg/ml of IVIg can be used to achieve a 95% to 100% of inhibition of phagocytosis when using human monocytes.\n13. Aspirate any non-adhered PBMCs from the wells using a micropipet and discard. Add 400 μl of test material and incubate at 37°C, 5% CO2 for 1 hr.\nIt is recommended that solutions be aspirated and added gently by tilting the slides in such a manner so that the tip of the pipet only touches a corner and does not disturb the weakly adhered cells. Because each treatment can be performed in technical triplicates, it is also recommended that three wells at a time be used when aspirating and adding solutions to avoid drying the wells.\nOpsonization of Rh(D)+ R2R2 red blood cells\nR2R2 RBCs are used as a positive control for FcγR-mediated phagocytosis. R2R2 RBCs can be centrifuged at 870 × g for 15 min with brakes ON and reconstituted in ID-CellStab (RBC storage/stabilization solution) and stored at 4°C for up to a month.\nAlthough we use D+ R2R2 RBCs for opsonization with anti-D for our positive control, any Rh+ RBCs could be used and do not have to be phenotyped.",
    "14. Wash R2R2 (cDE/cDE) RBCs in pH 7.4 PBS three times by centrifugating at 350 × g for 5 min each time. (You may need to wash more than three times if hemolysis or red supernatant observed.)\nAlways wash an excess amount of RBCs because RBCs can be lost during the washes while aspirating the washed supernatant. The amount of RBCs to be used is typically 1.25% per well. If, for example, the treatments are being replicated in triplicates with four treatments and one control that would make a total of five tests and fifteen wells (three wells per one test). That would mean a total of 75 µl RBCs are needed for opsonization. In that case, 150 µl of RBCs can be washed to account for any losses during the wash steps. One 1.5-ml Eppendorf tube can be used to opsonize each test (three wells). Because each well will need 1.25% of the opsonized RBC mixture, a total of 15 µl of packed RBCs can be opsonized.\n15. Opsonize R2R2 RBCs with anti-Rh(D) at 100 ng/ml and incubate at 37°C, 5% CO2 for 1 hr. Intermittent reconstitution by mixing is recommended as RBCs settle at the bottom (e.g., vortex every 15 min). A five percent RBC suspension for opsonization is recommended (e.g., 15 μl of packed RBCs in 300 μl antibody mixture).\n16. Wash opsonized R2R2 RBCs with pH 7.4 PBS three times by centrifugating at 350 × g for 5 min each time.\nTo check if RBCs are opsonized successfully, perform an indirect antiglobulin test (IAT) by adding secondary opsonizing anti-human antibody (anti-human globulin) to the primary opsonizing antibody (anti-Rh(D)) on the RBC surfaces. Hemagglutination or clumping of RBCs can be observed and interpreted as a successful opsonization.",
    "17. Reconstitute washed opsonized R2R2 RBCs to 1.25% (v/v) using RPMI-1640 complete medium, for example, 1,200 μl medium to 15 μl RBCs to achieve 1.25% (v/v) per well.\nFc receptor-mediated phagocytosis\n18. Aspirate pre-treatment test material (if added) or non-adhered cells (if not added) and discard, following gentle aspiration and adding technique (see step 13).\n19. Gently wash wells one time with pH 7.4 PBS.\n20. Add 400 μl of 1.25% (v/v) opsonized R2R2 RBCs mixture to each well of the triplicate. Incubate at 37°C, 5% CO2 for 2 hr undisturbed.\n21. After incubation, prepare two beakers with 150 ml pH 7.4 PBS in each beaker. Invert the 8-well chamber slides to discard non-phagocytosed RBCs into one of the beakers. Remove chambers using the manufacturer's adaptors. Dab off excess on paper towel while keeping slides moist.\n22. Submerge slide into the beaker with the discarded supernatants and wash slide by moving it back and forth slowly (20-30 strokes) to remove any remaining non-phagocytosed RBCs.\n23. Using the other beaker without any discarded supernatants, submerge slide and wash slowly for 20-30 strokes more.\n24. Remove slide from PBS and dab off excess on paper towel. Air dry slide.\n25. When almost dry, fix by submerging in 100% methanol for 45 s then air dry.\n26. Mount slide using an in-house made Elvanol mounting medium and add coverslips (24 × 75 mm).\n27. Allow mount to dry overnight before quantification.\nQuantification of phagocytosis\n28. Using a phase contrast microscope and 40× objective lens, quantify phagocytosis using a manual cell counter.\nAlthough we use phase-contrast microscopy to count the RBCs phagocytosed in 100 monocytes, hematological stains such as Wright-Giemsa can also be used (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0001]).",
    "Have two manual cell counters in each hand to count phagocytosed RBCs in one and total number of monocytes in the other (300 monocytes should be counted per well).\n29. Calculate average phagocytic index (PI) per test (across triplicates) by dividing the number of phagocytosed RBCs by the number of total monocytes counted and multiplying by 100:\n(Number of phagocytosed RBCs/Number of total monocytes counted) × 100.\nExpress data as average PI ± the standard error of the mean (SEM).\nInterpretation of results\nWe and others have found that a PI >5 is correlated with clinically significant antibodies. The MMA may not correlate with serologic results as shown in Figure 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0001]. In this result, the antibody (anti-Cartwright (Yta)) reacts by IAT serology with the Yt(a+) RBCs but not with Yt(a-) RBCs. This would suggest that this antibody is clinically significant and only Yt(a-) blood should be selected for transfusion. Despite the IAT reactivity, the MMA assay indicates that the PI is <5 and the antibody is, thus, considered clinically insignificant and that all these serologically incompatible donor bloods can be transfused into this patient without sequalae. Indeed, this patient was transfused with Yt(a+) blood and did not have any problems.",
    "Natural killer (NK) cells are classical mediators of ADCC through the interaction of their low affinity Fcγ receptor CD16 with IgG antibodies present in circulation. Some of these antibodies (alloantibodies) can lead to unwanted reactions in the case of patients receiving a transfusion thus matching between recipient and blood donor is required. Therefore, as a complementary method to determine the clinical significance of antibodies in transfusion reactions, and test for compatibility between donor and recipient, we evaluate the capacity of NK cells to mediate ADCC against red blood cells, when the latter have been exposed to a specific human serum.\nMaterials\nRPMI-1640 complete culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-rec-0004])\nCytiva Ficoll Paque PLUS, density 1.077 g/L (Thermo Fisher Scientific, 17-1440-03)\nFresh whole blood collected into acid-citrate-dextrose (ACD) tubes (yellow-top tubes; minimum of nine to ten blood tubes should be collected for NK cell-mediated ADCC assays; store blood at room temperature up to 48 hr)\nFresh whole blood collected by venipuncture into red-top (no additive) serum separator tubes\nIsolation buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-rec-0003])\n1× PBS, pH 7.4, without Ca2+/Mg2+ (Wisent Bioproducts, 311-425-CL)\nPatient's isolated serum (for opsonization), or utilize patient's plasma or a purified antibody of your interest\n51Cr (Na2CrO4, sodium chromate), 1 mCi (37 Mbq; PerkinElmer, NEZ030S001MC), lead-protected at room temperature; use within 2 half-lives\n1 N HCl\nCell purification kits: \n               \nEasySep™ Human NK Cell Isolation Kit (Stemcell Technologies, 17955) or\nEasySep™ Human NK Cell Enrichment Kit (Stemcell Technologies, 19055)\nRadioactivity counter (e.g., MicroBeta2 Microplate Counter for Radiometric and Luminescence Detection, PerkinElmer)\nLumaPlate-96, shallow wells, White Opaque 96-well Microplate with Scintillant Coated on the Bottom, sample capacity:100 µl (PerkinElmer, 6006633)\n96-well suspension culture plates, U-bottom (Greiner Bio-One, 650 185)\nOptimization of number of RBCs to use in the ADCC assay\nOptimization steps should be done just once at the beginning of the study.",
    "1. Wash RBCs with PBS three times by centrifugating at 350 × g for 5 min at room temperature each time.\n2. Count 1 × 107 RBCs, centrifuge to remove PBS, and resuspend in 50 μCi of 51Cr.\n1 × 107 RBCs are usually enough for most applications; adjust cells proportionally in case more cells are needed.\nIncubate 1 hr in a 37°C incubator, 5% CO2. Resuspend RBCs every 15 min by tapping the tube on the side. Radionuclide should be used within 2 half-lives (27.71 days), adjusting the amount used based on radioactivity levels at the time of the assay.\n3. Add 5 ml complete culture medium, centrifuge at room temperature (423 × g, 5 min), discard supernatant, and repeat for a total of three washes.\n4. Resuspend washed RBCs in complete RPMI and adjust the cell concentration (in volume of 100 µl) to the highest number of cells that will be included in your titration curve (∼ 250,000 RBCs/well).\n5. Seed at least six wells (two sets of triplicates) of the 51Cr loaded RBCs in round-bottom 96-well plates and do serial dilutions (by a factor of 2) starting from your most concentrated RBC sample down to 976 RBCs/well.\nFinal volume should be 100 µl per well.\n6. Lyse one set of triplicates for each dilution by adding 100 µl 1 N HCl and add 100 µl RPMI in the other set of triplicates.\nHCl is used to determine the maximum release (MR) of 51Cr from the target cells. Other reagents can be used, e.g., 1% Triton X-100, 0.2 % SDS.\n7. Incubate plate at 37°C, 5% CO2 for the duration of the assay (usually 4 hr).",
    "8. After 4 hr, take plate out of the incubator and carefully collect 50 μl cell-free supernatant from each well (with a multichannel pipet), and transfer to LumaPlates.\n9. Let the LumaPlates dry overnight.\n10. Count (1 min/sample) in a radioactivity counter (e.g., MicroBeta2 Microplate Counter).\nOther radioactivity counters may be used.\n11. Calculate the ratio of dead versus alive cells [divide the counts per minute (cpm) of the dead cells by the cpm of the alive cells] and plot in an xy graph against the corresponding cell number (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0002]). Select the most adequate number of cells for your subsequent experiments.\nConsidering the effector cells’ availability, the number of RBCs to use should be determined individually for the specific assay. In this case, we used the lowest number of RBCs that yielded the highest radioactivity readouts (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/35aab7f1-62a8-46c7-8706-819bae820bf7/cpz1504-fig-0002-m.jpg</p>\nFigure 2\nSpecific lysis of human RBCs mediated by peripheral blood mononuclear cells (PBMCs) and NK cells. (A) Determination of the required number of cells (30,000 cells, circled in red) for detection of RBC lysis with a maximal release of 51Cr. RBC after cells were lysed with 1 N HCl and radioactivity measured in a MicroBeta2 microplate counter. (B) Cytotoxicity of PBMCs compared to NK cells against RBC opsonized or not with an anti-D antibody (WinRho), at the indicated effector/target (E/T) ratios, as assessed in a 51Cr release assay. Average of at least three independent donors are shown.\nPurify NK cells\n12. Perform PBMC isolation as described in monocyte monolayer assay (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-prot-0001]).\n13. Count isolated PBMCs and adjust to 50 × 106 cells/ml in isolation buffer to proceed with the NK purification.\n14. Purify NK cells using the NK isolation kit or the NK enrichment kit (Stemcell Technologies; EasySepTM) according to the manufacturer's instructions (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0003]).",
    "If NK cell isolation kits are not available, the assay can be done using the whole PBMC fraction. However, the level of cytotoxicity obtained when using PBMC is significantly lower than the cytotoxicity observed with purified NK cells (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f0952c15-639a-4ef2-aefa-d127909e93f3/cpz1504-fig-0003-m.jpg</p>\nFigure 3\nGeneral experimental flow diagram of the antibody dependent cellular cytotoxicity assay (ADCC). NK cells are isolated from whole fraction PBMCs by negative selection. In parallel, RBCs are opsonized with antibodies of interest and loaded with radioactive 51Cr. Thereafter, NK cells and radiolabeled RBCs are co-cultured for 4 hr allowing NK cell-mediated lysis of the RBC. The supernatant containing the radioactive 51Cr released from lysed RBC is collected and dried on LumaPlates for posterior quantification of the released radioactivity. Abbreviations: PBMCs, peripheral blood mononuclear cells; RBCs, red blood cells.\n15. Count purified NK cells (ready to use) and resuspend in complete RPMI at the desired concentration.\nFor the quantification and correct interpretation of results, different effector/target ratios of cells should be used. Serial dilution of effector cells should be made in triplicate on the 96-well round-bottom microtiter plate of the assay.\nTarget cell labeling\n16. Patient RBCs are washed and opsonized as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.504#cpz1504-prot-0001], steps 14-17.\n17. Count RBCs and add 50 μCi of 51Cr per 1 × 107 cells.\n1 × 107 RBCs are usually enough for most applications; adjust cells proportionally in case more cells are needed.\nIncubate for 1 hr in a 37°C incubator, 5% CO2. Resuspend every 15 min by tapping the tube on the side.\n18. Add 5 ml complete medium, centrifuge (423 × g, 5 min), discard supernatant, and repeat for a total of three washes.\n19. Resuspend washed RBCs in complete RPMI and adjust cell concentration to 30,000 cells in 100 µl.",
    "Considering the effector cells availability, the number of RBCs to be use should be determined individually for the specific assay. In this case, we used the lowest number of RBCs that yielded the highest radioactivity readouts (Figure 2A).\nNon-opsonized RBCs can be used as a negative control for the ADCC.\nCytotoxicity assay\n20. Plate 100 μl effector cells (at the desired concentrations) in triplicates on a 96-well round-bottom microtiter plate.\n21. Add 100 μl radiolabeled target cell suspension to the wells already containing 100 μl of effector cells and to six additional wells.\n22. Add 100 μl complete RPMI (spontaneous release) to three of the six additional wells and 100 μl 1 N HCl solution to the remaining three wells (maximum release).\nTo understand if a specific treatment or stimuli is affecting the viability of your RBCs, spontaneous and maximum release wells should be measured for all the conditions included in the assay. For example, three wells spontaneous release and three wells maximum release for opsonized cells, and three wells spontaneous release and three wells maximum release for non-opsonized cells.\n23. Incubate 4 hr (5% CO2 at 37°C).\n24. Carefully collect 50 μl cell-free supernatant (with a multichannel pipet) and transfer to LumaPlates.\n25. Let the LumaPlates dry overnight.\n26. Count (1 min/sample) in a radioactivity counter (e.g., MicroBeta2 microplate counter).\nOther radioactivity counters may be used.\n27. Determination of specific 51Cr release assay and calculation: The percent of specific 51Cr release (equivalent to specific lysis) is calculated as: (Experimental value-spontaneous release)/(Maximum release-spontaneous release) × 100. Each value is calculated as the mean of triplicates."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}