{
  "id": 13120,
  "origin_website": "Jove",
  "title": "An Explant System for Time-Lapse Imaging Studies of Olfactory Circuit Assembly in Drosophila",
  "procedures": [
    "1. Preparation of reagents\nNOTE: All the steps in this protocol are carried out at room temperature (20-25 °C) unless explained otherwise.\nTo prepare the culture dish for immobilizing the explant during time lapse imaging, lay 0.5 cm thick Sylgard (thoroughly mix two liquid components at 10:1 ratio before use) on the bottom surface of a 60 mm x 15 mm Petri dish and let it cure for 48 h at room temperature (Figure 2A, referred as Sylgard plate in the following text).\nTo prepare micro pins for immobilizing explant on this plate, use a pair of forceps to stick multiple micro pins on a tape with the sharp ends aligned on one side (Figure 2B). Use a pair of scissors to cut ~2 mm from the sharp ends of the micro pins (Figure 2B'). Use forceps to hold the cut micro pins and insert into the Sylgard layer of a pre-made Sylgard plate (Figure 2C). Two micro pins are used to immobilize one explant.\nUse a brush to collect white pupae, which form puparium within 1 h, of hsFLP, pebbled-GAL4/+; UAS-FRT100-stop-FRT100-mCD8-GFP8 genotype and transfer them to new vials. Heat shock in 37 °C water bath for 40 min to induce sparse ORN clones from random types. After heat shock, put the vials at 25 °C for 30 h, resulting in pupae aged at 30 h after puparium formation (APF).\nTo prepare the culture medium for explant, add 5 mL of Penicillin-Streptomycin (10,000 U/mL) to 500 mL Schneider's Drosophila Medium. Filter the medium and make 45 mL aliquots in 50 mL conical tubes. The medium can be stored at 4 °C for 1-2 months.",
    "On the day of imaging, take one tube of 45 mL of Schneider's Drosophila medium and add 5 mL of Fetal Bovine Serum (10% v/v), 125 µL of 4 mg/mL human insulin stock solution (10 µg/mL final concentration), 50 µL of 1 mg/mL 20-hydroxyecdysone stock solution dissolved in ethanol (1 µg/mL final concentration). Mix well and transfer 15 mL of full medium into a new 50 mL conical tube. The rest of the full medium can be stored at 4 °C for a week. Fetal Bovine Serum, human insulin stock solution and 20-hydroxyecdysone stock solution are aliquoted and stored at -20 °C.\nOxygenate the 15 mL full medium by pumping oxygen bubbles from an oxygen cylinder under the liquid surface through a sterile 5 mL pipette tip at the rate of one bubble/s for 20-30 min. Use a paraffin film to cover the opening of the tube during this process.\nSterilize the dissection well surface and the Sylgard plate (with micro pins inserted on the Sylgard layer, prepared in steps A1 and A2) with 70% ethanol. Let them dry before use.\n2. Explant dissection\nUse a brush to transfer 30 h APF (30 h after puparium formation) pupae to a paper tissue and dry the external surface of the pupae for 5 min.\nPut a piece of double-sided tape on a glass slide. Carefully attach the dried pupae on the sticky surface of the tape with the dorsal side facing upward. Gently press the pupae with a brush to help the ventral side of the pupae attach well to the tape (Figure 3A). Do not damage the pupa.",
    "Use a pair of forceps to remove brown pupal case covering the dorsal side of the head (Figure 3A,B). Insert one sharp tip of the forceps between the brown pupal case and the pupa from the lateral side and carefully break the brown pupal case through a line to the posterior end of the pupa (Figure 3B,C). Open the brown pupal case. Use a pair of forceps to gently hold the pupa and transfer to the dissection well with 1 mL of oxygenated full medium. Submerge floating pupa on the medium surface to help it sink to the bottom of the well (Figure 3D).\n\tNOTE: Do not insert the forceps tip too deeply inside the brown pupal case to prevent injuring the pupa with the forceps.\nTo dissect the antennae-brain explant from the pupa, use forceps to gently hold the pupa with one hand and use a pair of microscissors to cut a small hole from the posterior side of the pupa with the other hand (Figure 3E). This small hole releases the high pressure inside the pupa.\nCut through the ventral midline of the pupa from the hole until the neck (the narrow structure that connects the head and the thorax) with the microscissors (Figure 3F). Then, cut through the circumference of the neck to detach the head from the body of the pupa (Figure 3G). Remove the body and place it in a different well.\n\tNOTE: Do not cut the neck directly from the dorsal/ventral side of the pupa, which may squeeze the brain.",
    "Cut the transparent cuticle that covers the dorsal side of the brain (Figure 3H). This will expose the fat body on top of the brain. Keep some cuticle to which the retina and antennae attach. Repeat the same procedure to the ventral side of the brain.\n\tNOTE: Do not insert the blade of the scissors too deeply under the cuticle as this will cause severing of the antennal nerves connecting the antennae and brain (Figure 3H').\nUse a P10 pipette to gently wash out the fat body that covers the brain and antennae by pipetting the medium toward the open regions on the dorsal and ventral sides of the head (Figure 3I).\n\tNOTE: Be very gentle when pipetting the medium as the brain can easily be detached from the cuticle. Make sure all fat body is removed during this step. Arrested development of ORN axons were observed when fat body was not cleaned well, probably due to poor oxygen access from the medium.\nTo study the interaction of bilateral ORN axons or ORN axons to PN dendrite targeting, sever one or two antennal nerves with the microscissors during this stage8 (Figure 3J). Carefully place the blades of the scissors between the cuticle and the brain and sever interested antennal nerves.\nTo transfer the dissected explant to the Sylgard plate, place a droplet of oxygenated full medium (~200 µL) on the Sylgard surface. Coat the inner surface of a 200 µL wide tip pipette tip with the fat body from the dissected trunk (step 1.6) by pipetting the fat body several times, which prevents the explants from sticking the pipette tip during transfer. Then, use this wide tip pipette tip to transfer the explant from the dissection well to the medium droplet on the culture plate (Figure 3K).",
    "Use forceps to pin the explant on the Sylgard layer in the two optic lobes (Figure 3L). Carefully position the Sylgard plate on the imaging station and immobilize the plate with tapes. Slowly add 10 mL of oxygenated full medium to the Sylgard plate using P1000 pipette.\n\t​NOTE: Avoid disrupting the explant when adding the medium to the Sylgard plate.\n3. Two-photon microscopy-based live imaging\nTo perform time-lapse imaging, use a two-photon microscope, a Ti:Sapphire laser, a 20x water-immersion objective (1.0 NA) and an imaging software. Use the excitation wavelength at 920 nm for imaging GFP proteins. Adjust the pixel dwell time to 10 µs.\nAdjust the imaging station position so that the explants are roughly under the objective. Use 70% ethanol to sterilize the lens before imaging. Slowly lower the objective under the medium close to the explants. Check whether there is any bubble on the lens of objective.\n\t\nIf so, lift the objective above the medium and repeat this until the bubble is gone. Find the explants using the eyepiece and center one explant in the field.\nTo ensure an explant with a few ORNs sparsely labeled for time lapse imaging, dissect ~10 explants each time and align on y axis on the culture plate. Screen all explants by moving the objective along y axis and choose an explant in which a few single ORN axons have just reached the antennal lobe for imaging (Figure 4A).\n\t\nRecognize the antennal lobe by its oval shape and the ORN axons that are beginning to circumnavigate it. Image a ~150 µm x 150 µm area in the xy plane (3x zoom with the 20x objective). Estimate the boundary of the two antennal lobes and center them in the imaging area.",
    "Select an initial imaging region along the z axis by defining the bottom section and top section of scanning. Set up imaging area along the z axis. Set the deepest section with ORN axon signals as the first imaging session and the session 100 µm above (more superficial side) as the last imaging session (Figure 4B).\n\tNOTE: This leaves some sections on top (superficial side) of the ORN axons and avoids shifting of ORN axons upward outside the imaging area due to the growth of the brain during culture.\n\t\nImage at 2 µm intervals. Set automatic imaging scanning at the frequency of every 20 min using imaging software.\nShift the imaging region 20 µm upward along the z axis after the first 4 h imaging and another 20 µm upward along the z axis after 16 h imaging. This can be achieved by setting a script and different z stacks in the imaging software.\nCulture the explant for an additional period post imaging (up to 24 h ex vivo) before fixation and staining with N-cadherin, a neuropil marker, to reveal the genetic identity of each single ORN by the glomerulus it targets to.\n4. Image processing\nTo process z stack images from section series taken at each time point using the Fiji software, open image section series, click on Image | Stacks | Z project [/].\nTo correct lateral drift of the sample during culture, install TurboReg Plugin in Fiji.\n\t\nOpen a z stack image series and a single z stack image from the series. Open Plugins | Registration | TurboReg.\nSelect the z stack image series in Source and the single z stack image in Target | Translation. Click on the Batch button to register all the images from the opened z stack image series.",
    "To maximize the utility of imaged samples, separate sparsely labeled single axons in the vicinity to each other from the z stack images following 3D image sections.\n\t\nTo extract single ORN axons from a few axons in the same image, open the image section series, click on Plugins | Segmentation | Segmentation Editor [/]. Select the brush tool and mask interested ORN axon in the Segmentation Editor working window using Select \"+\" or \"-\" buttons on each image section.\nClick on Process | Image Calculator [/]. Select \"Image X\" in Image 1, \"Multiply\" in Operation, \"Image X. labels\" in Image 2, [/]. This generates a new image series file with the interested axon only. Perform step 4.1 to process the z stack image. Repeat this step for all time points to generate a time series image file.\nTo pseudocolor different axons from the same image, first perform step 4.3 to generate the time series image file of each axon separately. Open the time series image files for different single axons from the same raw data image. Click on Image | Color | Merge Channels. Select different time series image files in different color channels and click OK.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}