{
  "id": 9333,
  "origin_website": "Jove",
  "title": "Two-Photon in vivo Imaging of Dendritic Spines in the Mouse Cortex Using a Thinned-skull Preparation",
  "procedures": [
    "Approval needs to be obtained from home institutions before commencement of the surgery and imaging study. Experiments described in this manuscript were performed in accordance with the guidelines and regulations from the University of California, Santa Cruz Institutional Animal Care and Use Committee.\n1. Surgery\nAutoclave all surgical instruments and sterilize the workspace with 70% alcohol thoroughly before surgery.\nAnesthetize the mouse by intraperitoneal (IP) injection of KX anesthetic solution (200 mg/kg ketamine and 20 mg/kg xylazine) according to the mouse’s body weight. Note: KX dosage may be adjusted according to the strain, age, and health status of the mice. Veterinary consultation to determine the optimal dose is also recommended.\nPerform a toe-pinch test periodically by pressing the mouse’s toes and checking for a reflexive response to monitor the anesthesia status. Make sure that the mouse is fully anesthetized before starting the surgery. Note: During prolonged imaging sessions, check the mouse’s anesthesia status periodically, administrate additional KX if necessary.\nPlace the mouse on a heating pad to maintain the body temperature during the surgery.\nShave the head of the mouse using a razor blade to expose the scalp.\nSterilize the shaved area by wiping the skin with alternating alcohol pads and betadine. Remove any residual hair clippings.\nGently apply eye ointment to lubricate both eyes, therefore preventing permanent damage caused by dehydration during the experiment.\nMake a straight incision along the midline of the scalp, and move the skin laterally towards the edges of the skull.\nRemove the connective tissue attached to the skull.\n2. Thinned-skull Preparation\nIdentify the imaging region based on stereotaxic coordinates. Note: Try to avoid large blood vessels, which block light penetration and blur the imaged structures. Vasculature is best observed when the skull is moist with sterile saline.",
    "Use the high-speed micro drill to thin a circular region of skull (0.5-1.0 mm diameter). Move the drill parallel to the skull surface, rather than holding it against the skull and pressing down. Drill until both the outer compact bone layer and the middle spongy bone layer are removed. Note: To prevent damage caused by overheating, avoid prolonged contact between the drill bit and the skull.\nContinue thinning the inner compact bone layer with a microsurgical blade in the center of the drill-thinned region. Hold the microsurgical blade at an angle of approximately 45° to scrape the skull without pressing down against the skull until an evenly thinned small region (200-300 μm diameter) with a thickness of approximately 20-30 μm is obtained. Due to the auto-fluorescence of the skull, the thickness can be measured by scanning the distance between upper and lower surface of the skull under the two-photon microscope. Note: although a skull thickness of less than 20 μm provides good imaging quality, it is not recommended because it makes the thinning process in subsequent re-imaging sessions difficult. To avoid over-thinning, the thickness of the skull needs to be checked periodically during the surgery (see Discussion).\n3. Immobilization\nCarefully remove bone debris.\nPlace a small drop of cyanoacrylate glue on each edge of the center opening of the sterile head plate, which has been autoclaved (see Figure 1). Hold the head plate tightly against the skull with the thinned region located in the center of the opening. Note: If the glue contaminates the thinned region by accident, remove it carefully with the microsurgical blade.\nGently pull the skin from the sides of the skull to the edges of the center opening of the head plate.\nWait approximately 10 min until the head plate is well attached to the skull.",
    "Place the head plate on two lateral blocks of the holding plate and then tighten the screws over the edges of the head plate to immobilize the mouse on the holding plate (see Figure 1). Note: Make sure that there is no skin or whiskers between the head plate and the blocks before tightening the screws. A good immobilized preparation should show no observable movement of the skull under the dissecting microscope when the back of the animal is gently patted.\nRinse the exposed skull with saline to remove unpolymerized glue. Note: It is important to remove any remaining glue, as unpolymerized glue blurs images and damages microscope objectives.\n4. Imaging\nTake a photo of the vasculature of the exposed skull with the thinned region as Map 1, which is used to relocate the imaged region in subsequent imaging sessions (see Figure 2).\nPlace the mouse under the imaging microscope. Locate the thinned area under a 10X air objective using epifluorescence and move the thinnest area to the center of the view.\nAdd a drop of saline on the top of the skull and switch to the 60X objective, which has been rinsed with sterile water. Select a region where individual dendritic spines are clearly visualized along dendrites. Identify and label the corresponding region on Map 1 by comparing vasculature between the epifluorescent view and the vasculature photo.\nTune the two-photon laser wavelength according to the fluorophores. For instance, 920 nm for YFP; 890 nm for GFP; 1,000 nm for DsRed and tdTomato24.\nAcquire image stacks with 2 μm steps along the z-axis using the 60X objective. This image stack covers an approximately 200 μm x 200 μm area (512 x 512 pixels) and is used as Map 2 for relocation during subsequent imaging sessions (see Figure 2).",
    "Acquire nine image stacks within Map 2 using 3X digital zoom. Each image stack covers an approximate area of 70 μm x 70 μm (512 x 512 pixels), with 0.7 μm steps along the z-axis. Note: The intensity of the laser should be below 40 mW when measured at samples to minimize phototoxicity.\n5. Recovery\nFollowing imaging, gently detach the head plate from the skull.\nThoroughly clean the skull and the skin to remove all the remaining glue. Note: Any remaining glue on the skin will cause irritations and slow down skin healing while any remaining glue on the skull will cause erosion of the skull and angiogenesis in the newly grown bone layer, making subsequent relocation and re-imaging difficult.\nRinse the skull and the skin with saline several times.\nSuture the scalp with sterile surgical suture.\nKeep the animal on a heating pad in a separate cage. Administer buprenorphine analgesic (0.1 mg/kg) subcutaneously to mitigate post-operative pain. Return the animal to the home cage after full recovery. Monitor the animal closely (check at least once daily) until the incision is healed and sutures are removed. Administer subsequent injections of buprenorphine analgesic if needed.\n6. Reimaging\nRepeat Steps 1.1-1.8.\nRepeat Steps 3.1-3.6\nLocate previously imaged region by comparing the vasculature pattern to Map 1 and the dendritic branch pattern to Map 2.",
    "If reimaging is performed within 1 week, repeat Step 2.3 to remove the thin layer of newly grown bone on top of the thinned region using the microsurgical blade. If reimaging is performed after more than 1 week, repeat Steps both 2.2 and 2.3. Note: The newly grown bone layer consists of a less condensed structure compared to the original compact bone layer, leading to reduced image quality. Therefore, to acquire the same quality, it is necessary to thin the skull slightly more than the previous imaging session.\nAdjust the position and orientation to obtain image stacks that match previously taken image stacks under the two-photon microscope.\nAcquire images as in Step 4.6.\nRepeat Steps 5.1-5.5 after imaging.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}