{
  "id": 18416,
  "origin_website": "Jove",
  "title": "Depletion of Mouse Cells from Human Tumor Xenografts Significantly Improves Downstream Analysis of Target Cells",
  "procedures": [
    "All animal experiments were performed in accordance with local ethical and legal guidelines of Regierungspräsidium Freiburg Referat 35.\n1. Reagent Preparation\nNOTE: Before starting the experiment, prepare the following reagents from the dissociation kit:\nTo prepare enzyme H dissolve each vial of the lyophilized powder in 3 ml of RPMI 1640 Roswell Park Memorial Institute 1640 (RPMI 1640) or Dulbecco's modified Eagle medium (DMEM). In order to avoid repeated freezing and thawing prepare suitable aliquots (e.g., 200 µl) and store them at - 20 °C for up to 6 months.\nTo prepare enzyme R dissolve the vial of the lyophilized powder in 2.7 ml of RPMI or DMEM medium. In order to avoid repeated freezing and thawing prepare suitable aliquots (e.g., 100 µl) and store them at - 20 °C for up to 6 months.\nTo prepare enzyme A dissolve the vial of the lyophilized powder in 1 ml of Buffer A supplied with the kit without vortexing. In order to avoid repeated freezing and thawing prepare suitable aliquots (e.g., 25 µl) and store them at - 20 °C for up to 6 months. Make sure to thoroughly mix this suspension immediately before withdrawing the required reaction volume.\nPrepare 250 ml buffer (1x  PBS with 0.5% BSA) for cell separation procedure and antibody staining.\n\tNOTE: When culturing cells after removal of mouse cells filter all buffers and enzyme solutions through a 0.22 µm filter.\n2. Tumor Dissociation Protocol\nNOTE: In this study patient-derived xenografts of non-small cell lung cancer (NSCLC), renal cancer and bladder were used. The tumors were generated by implanting xenografts of non-small cell lung cancer (NSCLC) renal cancer and bladder in 4 - 6 weeks old female NMRI nu/nu mice as described previously13.",
    "NOTE: As this protocol is completely independent of the tumor type, it can be used for any kind of patient or cell line-derived tumor as well as other types of human xenotransplanted tissue without modification of the protocol.\nPrepare 5 ml of digestion mix per tissue sample (up to 1 g) freshly by adding 4.7 ml of RPMI 1640 or DMEM, 200 µl of enzyme H, 100 µl of enzyme R, and 25 µl of enzyme A into a cellular dissociation tube (C Tube). Make sure to thoroughly mix enzyme R suspension before withdrawing the required volume.\nSacrifice the animals by cervical dislocation under anesthesia. Disinfect mouse by spraying with small amount of 80% v/v ethanol.\nHarvest subcutaneous tumor from the mouse flank using forceps and scissors in a tissue culture hood. Cut the skin open in place of the tumor using scissors and then separate the tumor from adjacent healthy tissue using forceps and scissors.\n\tNOTE: Depending of the purpose of the experiment perform this and following steps under aseptic conditions. In this study all steps were carried out in a cell culture hood under aseptic conditions in order to being able to cultivate the cells.\nPrepare the tumor sample for digestions by removing fat (as this will make the sample float) and necrotic areas (as this will result in decreased viability) by cutting it away using forceps and a scalpel. Mince the tissue into pieces of 2 - 4 mm by using scalpels and forceps.\nTransfer the tissue pieces into the C Tube containing the digestion mix.\nClose the C Tube and make sure it is tightly closed. Attach it upside down onto the sleeve of the benchtop tissue dissociator and make sure that the tissue pieces are located in the area of the rotor/stator.",
    "Choose the mode \"h_tumor_01\" by pressing the \"up\" or \"down\" button until the mode appears in the display and then pressing the \"start\" button.\n\t\nIf using the heating function of the benchtop tissue dissociator, make sure to also attach the heater. Then run mode 37C_h_TDK_1 (for soft tumors), 37C_h_TDK_2 (for medium tumors) or 37C_h_TDK_3 (for hard tumors) by clicking the folder symbol on the touchscreen until the folder \"Miltenyi\" appears.\nTo choose the mode, click the up or down arrow until the dissociation mode 37C_h_TDK_2 is highlighted. The sleeves of the benchtop tissue dissociator are depicted as positions on the display of the device. Choose the positions samples are run on by clicking them on the touchscreen. Press \"start\" to run the mode and continue with step 2.16.\n\t\tNOTE: Depending on the tumor type another dissociation program might be suitable (see step 2.7.1).\nObserve a window showing \"Termination of the program\" on the screen. After termination of the program, detach C Tube from the benchtop tissue dissociator.\nIncubate sample for 30 min at 37 °C under continuous rotation, e.g., by using a tube rotator.\nAfter incubation attach C Tube upside down onto the sleeve of the benchtop tissue dissociator. Again make sure that the sample material is located in the area of the rotor/stator.\nRun the dissociation program h_tumor_02 (for soft and medium tumors) or h_tumor_01 (for hard tumors) as described in step 2.7.1.\nAfter termination of the program, detach C Tube from the benchtop tissue dissociator.\nIncubate sample for 30 min at 37 °C under continuous rotation.\nAttach C Tube upside down onto the sleeve of the benchtop tissue dissociator after incubation. Again make sure that the sample material is located in the area of the rotor/stator.",
    "Run the dissociation program h_tumor_03 (for soft tumors), h_tumor_02 (for medium tumors) or h_tumor_01 (for hard tumors) as described in step 2.7.\nTo collect the sample material at the tube bottom perform a short centrifugation step (at 100 x g for 10 sec).\nResuspend the cells and apply to a cell strainer with 70 µm nesh size placed on a 50 ml tube. Wash the cell strainer with 20 ml of RPMI 1640 or DMEM.\nCentrifuge cell suspension at 300 x g for 7 min. Aspirate supernatant completely.\nResuspend cells in 5 ml of buffer for counting. Proceed with Mouse Cell Depletion by magnetic cell separation (section 3).\n3. Mouse Cell Depletion by Magnetic Cell Separation Technology\nNOTE: Volumes for magnetic labeling given below are for up to 2 x 106 tumor cells or 107 total cells including red blood cells. Depending on the tumor size lower or higher cell numbers will be obtained. In case of fewer cells, use the same volumes as indicated. When using higher cell numbers, scale up all reagent volumes and total volumes accordingly (e.g., for 4 x 106 tumor cells or 2 x 107 total cells, use twice the volume of all indicated reagent volumes and total volumes).\nDetermine cell number of an aliquot from cell suspension in step 2.21 using a microscope and suitable chamber for counting.\n\tNOTE: At this point the cell suspension consists of a heterogeneous mixture of human tumor cells as well as mouse stromal and blood cells, including red blood cells. The composition of the cells strongly depends on tumor type and region for transplantation.",
    "When performing flow cytometric analysis after removal of mouse cells withdraw 100 µl aliquots to suitable tubes for an unstained and two single color control staining's for flow cytometric analysis. Store them in a refrigerator at 2 - 8 °C until further staining steps (section 4).\nCentrifuge cell suspension at 300 x g for 10 min. Discard the supernatant.\nResuspend cell pellet in 80 µl of buffer per 2 x 106 tumor cells or 107 total cells Add 20 µl of the magnetic labeling reagent for mouse cells.\nMix well and incubate for 15 min in the refrigerator (2 - 8 °C). During magnetic labeling, prepare large scale columns (LS columns) for magnetic separation, by placing it in the magnetic field of a suitable magnet (see Table of Materials and Equipment) according to the manufacturer's protocol. Rinse the column with 3 ml of buffer.\nAdjust the sample volume to 500 µl using buffer for up to 2 x 106 tumor cells or up to 107 total cells. (Up to 1 x 107 tumor cells or up to 5 x 107 total cells can be processed on one LS Column. When working with more cells split the sample onto multiple LS Columns).\n\t\nWhen performing flow cytometric analysis, molecular analysis or comparing fractions in cultures, withdraw a 50 µl aliquot as unsorted sample. Store it in a refrigerator at 2 - 8 °C until further processing.\nApply 500 µl of the cell suspension onto the previously prepared column. Collect flow-through containing unlabeled target cells, representing the enriched human tumor cells.\n\tNOTE: When working with higher cell numbers up to 2.5 ml of cell suspension that was prepared according to step 3.5 can be applied to one column.",
    "Wash column with 2 x 1 ml of buffer. Collect the cells that pass through and combine with the flow-through from step 3.6. Perform washing steps by adding the 1 ml buffer aliquots as soon as the column reservoir is empty.\n\tNOTE: The flow-through contains purified human tumor cells.\nTo also collect the mouse cells retained in the column, remove column from the separator and place it on a suitable tube. Pipette 3 ml of buffer onto the column and immediately use the plunger to flush out the mouse cells by firmly pushing it into the column.\nSpin down the fractions and control samples at 300 x g for 10 min. Aspirate supernatant completely and resuspend cells in buffer, culture medium or freeze pellet in liquid nitrogen, depending on the desired downstream application.\n4. Downstream Analyses\nStaining for Flow Cytometric Analysis\n\tNOTE: Before carrying out further downstream analyses, a part of cells obtained from mouse cell depletion procedure can be analyzed (e.g., assess purity and yield) in flow cytometry.\n\t\nFor flow cytometric analyses, spin at least 10% of negative and positive fraction obtained from magnetic cell separation procedure (section 3) as well as the control samples from step 3.2 and 3.5 at 300 x g for 10 min.\nDiscard the supernatant. Resuspend the cell pellet of the staining control samples from step 3.2 in 90 µl of buffer. Resuspend the fractions obtained from magnetic cell separation procedure in 80 µl of buffer.\nAdd 10 µl of mouse FcR Blocking Reagent to all samples. Mix well and incubate for 5 min at 2 - 8 °C in a refrigerator.",
    "Add 10 µl of anti-human EpCAM-PE (equals antibody dilution of 1:10) and 25 µl of anti-mouse-APC cocktail (equals antibody dilution of 1:4) to the samples from section 3. Add 10 µl of anti-human EpCAM-PE to one single color control sample (equals antibody dilution of 1:10) and 10 µl of anti-human EpCAM-APC to the other (equals antibody dilution of 1:10). Mix all samples and incubate for 10 min at 2 - 8 °C in a refrigerator.\n\t\tNOTE: EpCAM is not suitable as tumor cell marker of any tumor type. For the tumors used in this study EpCAM expression was known.\nTo wash the samples, add 1 ml of buffer each and spin at 300 x g for 5 min.\nDiscard the supernatant and resuspend the cell pellet to a concentration for flow cytometric analysis. To exclude dead cells add propidium iodide (1 µg/ml).\nPerform flow cytometric analysis using a suitable flow cytometer according to manufacturer's protocols.\nCultivation of Human Tumor Cells\n\tNOTE: In addition to flow cytometry, cells obtained from the separation procedure can be cultured and used for further assays in vitro.\n\t\nResuspend the sorted fraction from section 3 in culture medium to a concentration of 5 x 105 cells/ml.\n\t\tNOTE: Depending on the tumor type coating, suitable seeding density, and cultivation conditions can differ.\nAdd 500 µl of cell suspension into the wells of a 24 well plate coated with 0.1% gelatin.\nIncubate cells in a cell culture incubator at 37 °C and 5%.\n\t\tNOTE: Optimal culture conditions depend on the tumor type used. Therefore, apply culture conditions suitable for the tumor type used.\nImmunofluorescence Staining of Cultured Cells\nPrepare blocking solution by adding 10% FCS and 0.1% Triton X-100 to 1x PBS.",
    "Discard culture medium. Add 500 µl of 1x PBS per well to wash cells. Incubate for 2 min at room temperature (RT), then discard 1x PBS completely.\nFix cells by adding 300 µl of 4% PFA solution. Incubate at RT for 15 min.\nDiscard PFA solution. Wash fixed cells 3 times as indicated in step 4.3.2.\nPerform permeabilization and blocking by adding 300 µl of blocking per well. Incubate at RT for 30 min.\nDiscard blocking solution. Wash cells as indicated in step 4.3.2.\nAdd 300 µl of primary antibody diluted in blocking solution to the cells. Anti-human EpCAM antibody is diluted 1:40, Vimentin antibody is diluted 1:200. Incubate overnight at 2 - 8 °C.\n\t\tNote: The antibodies used are not suitable for any tumor type as EpCAM might not be expressed on tumor cells and/or vimentin is also expressed by the tumor cells. Make sure the antibodies used are suitable for the xenograft model.\nDiscard primary antibody solution. Wash cells 3 times as indicated in step 4.3.2.\nAdd 300 µl of secondary antibody diluted in blocking solution to the cells. Both antibodies, anti-rabbit IgG-Alexe594 and anti-mouse IgG-Alexa488 are diluted 1:400. Incubate for 1 hr in the dark at RT.\nDiscard secondary antibody solution. Wash cells 2 times as indicated in step 4.3.2.\nAdd 300 µl of DAPI solution (0.1 µg/ml) to each well. Incubate for 10 min in the dark at RT.\nDiscard DAPI solution. Wash cells 3 times as indicated in step 4.3.2.\nAdd 500 µl of 1x PBS to each well. Perform fluorescence microscopy using a suitable microscope.\nWhole Exome Sequencing\nFor Whole exome sequencing (WES) freeze pellets from step 3.9 in liquid nitrogen. Store and collect samples at -80 °C.",
    "After collecting the cells, perform exome capturing and whole exome sequencing in accordance to manufacturer's instructions of the respective kit (see Table of Materials and Equipment)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}