{
  "id": 19405,
  "origin_website": "Jove",
  "title": "In Vivo Whole-Brain Imaging of Zebrafish Larvae Using Three-Dimensional Fluorescence Microscopy",
  "procedures": [
    "All zebrafish experiments were approved by the Institutional Animal Care and Use Committee (IACUC) of KAIST (KA2021-125). A total of 12 adult zebrafish with pan-neuronal expression of the calcium indicator GCaMP7a [Tg(huc:GAL4);Tg(UAS:GCaMP7a)] on a casper [mitfa(w2/w2);mpv17(a9/a9)] background were used for breeding. This group consisted of eight females and four males, with ages varying from 3 to 12 months. Imaging experiments were performed on larval zebrafish at 3-4 days post fertilization (d.p.f.), a stage during which their sex cannot be determined.\n1. Zebrafish sample preparation\nCollect embryos after breeding adult fish of a desired transgenic line, such as Tg(huc:GAL4);Tg(UAS:GCaMP7a)20,21,22, in a Petri dish filled with egg water (see Table of Materials). Place the embryos in an incubator at 28 °C and raise them to 3-4 d.p.f. larvae23,24,25.\n\t\nIf the zebrafish background is not albino, to inhibit a formation of pigmentation, transfer the embryos at 24 h post fertilization (h.p.f.) into the Petri dish filled with egg water containing 200 µM of 1-phenyl 2-thiourea (PTU; see Table of Materials)25,26. Every 24 h, transfer the fish into a new dish with fresh egg water containing 200 µM of PTU.\n\t\tNOTE: The zebrafish are maintained under standard conditions at 28 °C and a 14:10 h light:dark cycle. The PTU treatment is known to affect the behavior and thyroid function of larval zebrafish27,28. Therefore, it is important to use the PTU with caution and to carefully control for potential confounding factors in any experiments.\nTo find the sample expressing fluorescent proteins of interest (e.g., pan-neuronal GCaMP7a), screen the sample under an epi-fluorescence microscope and select a sample with a bright expression.\nPrepare the selected 3-4 d.p.f. zebrafish sample in the Petri dish filled with egg water (Figure 2A).",
    "NOTE: To record spontaneous neuronal activity, it is recommended to use samples aged between 80-100 h.p.f., as the level of spontaneous activity is low before 80 h.p.f. and pigmentation development, even with a casper background, may degrade image quality after 100 h.p.f.\nPrepare a 0.25 mg/mL pancuronium bromide solution14,19,29,30,31 by adding 1 mL of a 2.5 mg/mL stock solution (see Table of Materials) to 10 mL of the egg water. Aliquot the pancuronium bromide solution into 1.5 mL microcentrifuge tubes.\nTransfer the pre-screened sample into the Petri dish using a transfer pipette.\n\tNOTE: Try to carry over a minimum volume of egg water with the sample.\nTransfer 0.1 mL of the pancuronium bromide solution into the Petri dish for paralyzation.\n\t​NOTE: Pancuronium bromide has a potential dampening effect on neural activity in larval zebrafish32. It is essential to consider the concentration and duration of exposure to pancuronium bromide carefully.\n2. 2% (wt/vol) agarose gel preparation\nTurn on a heat block and set the target temperature to 37 °C. Wait for the unit to heat up and equilibrate at the set temperature.\nDissolve 0.2 g of low-melting point agarose powder (see Table of Materials) in 10 mL of egg water.\nHeat the agarose solution in a microwave and mix it by shaking and vortexing until the agarose is completely dissolved.\nAliquot the agarose gel into 1.5 mL microcentrifuge tubes and store the microcentrifuge tubes on the heat block (Figure 2B).\n\t​NOTE: Check if the bubbles in the agarose gel have disappeared.\n3. Sample mounting and positioning\nCheck the sample under a stereomicroscope to verify that larvae movement has stopped and to evaluate the sample's health visually by checking its heartbeat (Figure 2C). If the heartbeat is too slow, discard the sample.",
    "NOTE: If the heartbeat of the fish being imaged is too slow (e.g., below 60 beats per minute), it may not be possible to perform long-term imaging. To assess the wellness of the fish, the heart rate can be visually checked by comparing it to other fish in the same Petri dish. This will help ensure that the fish being imaged is healthy and stable enough for the imaging procedure.\nUsing the transfer pipette, place a single larval zebrafish into the agarose gel in the 1.5 mL microcentrifuge tube (Figure 2D).\n\tNOTE: Ensure to discard the pipette after transferring the sample.\nPour the agarose gel into the Petri dish to make a 1-2 mm coat. Transfer the sample in the microcentrifuge tubes to the Petri dish using the transfer pipette, so that the larva is placed in the center of the dish.\n\tNOTE: If there is dust and bubbles in the agarose gel, remove them using the transfer pipette.\nUse forceps to position the sample in the desired orientation so that the head and tail are flat (Figure 2E).\nRotate the sample using forceps so that both eyes are level (Figure 2F).\n\tNOTE: Aligning procedures (position and rotation) should be completed before the agarose gel starts to solidify.\nAfter the alignment, wait until the agarose gel has solidified (Figure 2G,H).\n\tNOTE: The waiting time for the agarose gel to solidify can range from 5-10 min, depending on the volume and size of the gel.\nAfter solidification of the agarose gel, fill the Petri dish with egg water and place the Petri dish with the embedded sample on the microscope stage (Figure 2I).\n4. Image acquisition\nTurn on the microscope system (e.g., lasers, confocal controllers, microscope, and computer; see Table of Materials) and verify that the whole system is working.",
    "Select a low-magnification objective lens and locate the sample at the center of the field of view.\nSelect a water-immersion or water-dipping objective lens with proper magnification (e.g., 16x 0.8 numerical aperture (NA) water-dipping lens; see Table of Materials). Make fine adjustments to the field of view.\nSet the imaging parameters (e.g., image size, laser power, exposure time, number of frames) using image acquisition software.\n\tNOTE: Set the imaging parameters to achieve the best possible results for specific needs (see the setup for image acquisition in the representative results section). If the image is saturated, reduce the laser power.\nFind the brain of the sample by moving the stage and determine its thickness using live view mode in the software by changing the focal planes manually up and down. Set the lower and upper limits of the volume.\n\tNOTE: Ensure that the entire brain is contained in the field of view along both the lateral and axial directions.\nSet a z-step size considering the axial resolution of the microscope.\n\tNOTE: The optimal z-step size for imaging the larval zebrafish brain depends on the imaging modality and the resolution of the microscope. As an example, a z-step size of 5 µm was used considering the thickness of the light sheet and the average diameter of the cell bodies10.\nProceed with the image acquisition for the set field of view.\n\t\nFor volumetric structural imaging, acquire a 3-D image (x,y,z) of the entire brain by changing the focal planes and obtaining 2-D images of each z-plane sequentially.\nFor functional imaging of a single z-plane, acquire time-series images (x,y,t) of the neuronal activity of the brain at a certain depth.\nFor volumetric functional imaging, acquire a 4-D image (x,y,z,t) of the neuronal activity in the entire brain by obtaining 3-D images sequentially.",
    "NOTE: Set the number of frames considering the available memory size of the computer. An acquisition time of less than 1 h is recommended due to the duration of the effect of pancuronium bromide.\nAfter acquiring images, save the results and record the imaging parameters (e.g., pixel size, z-step size, frame rate, laser power) for image analysis.\nExport the images in an appropriate format for data rendering and image analysis.\n\t​NOTE: Exporting images in tagged image file (TIF) format format is recommended. TIF supports lossless image compression and is compatible with most image processing software and programming languages. Additionally, the TIF format supports the inclusion of metadata, such as acquisition parameters, image resolution, and other relevant information that can aid in data interpretation and reproducibility.\n5. Setup for visualizations using napari\nNOTE: napari is an open-source multi-dimensional image viewer in a Python environment with graphics processing unit (GPU)-based rendering33. The napari-animation plugin provides a programmatic creation of movies. Using Fiji, an open-source image processing program, is recommended for general purpose image processing, such as filtering and geometric transformation (see Table of Materials). The source code used for the visualization using napari is available on GitHub (https://github.com/NICALab/Zebrafish-brain-visualization).\nInstall napari and napari-animation using either pip or conda. After installation, create a new jupyter notebook file.\n\tNOTE: Running with jupyter notebook, which is an interactive tool for Python, is recommended over the Python script.\nImport napari and napari-animation.\n6. Visualizing structures using napari\nTo visualize images and create movies of the rendered zebrafish brain, load the 3-D image (x,y,z) and open the napari window. Connect the napari-animation plugin (Figure 3A).\nSet parameters such as voxel size, colormap, and contrast limits in the layer controls.\nAdjust the viewer settings (e.g., perspective, angles) in the canvas.",
    "To capture the rendered image, press the capture button in the animation wizard.\nTo generate movies of the rendered volume, modify the viewer settings and add key frames (Figure 3B).\nAfter adding key frames, set the number of frames (steps) between key frames in the animation wizard. Save the rendered animation.\n7. Image processing and visualizing neuronal activity using napari\nNOTE : To visualize the time-series images of neuronal activity as overlaid images of a static background and activity, a decomposition algorithm must be applied to the raw images. Use a MATLAB implementation of a decomposition algorithm called BEAR24. The MATLAB version of BEAR is available on GitHub (https://github.com/NICALab/BEAR).\nTo decompose the static background and neuronal activity, apply BEAR to the raw time-series images (x,y,t or x,y,z,t). After the decomposition, save the images of the background and neuronal activity as TIF files (Figure 3C).\nLoad the background and neuronal activity images and open the napari window. Connect the napari-animation plugin.\nUse a gray colormap for background images and a hot colormap for neuronal activity images (Figure 3C).\nSet parameters such as opacity and contrast limits in the layer controls.\nTo generate movies of neuronal activity, modify the viewer settings and add key frames to render the animation.\nAfter adding key frames, set the number of frames (steps) between key frames in the animation wizard. Save the rendered animation."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}