{
  "id": 3636,
  "origin_website": "Cell",
  "title": "A mouse model of Citrobacter rodentium oral infection and evaluation of innate and adaptive immune responses",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOral infection of mice with Citrobacter rodentium\nTiming: 21 days\nOne day pre-infection (day −1).\n8–9 weeks old mice are chosen for infection.\nRecord the weight of mice.\nFast the mice for 16 h with water given ad libitum before infection.\nAt day 0.\nOrally gavage the mice with 5 × 106 CFU of C. rodentium in 200 μL PBS using the gavage needle (8#) (as shown in Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/323-Fig2.jpg\nFigure 2. Oral inoculation with C. rodentium\n(A) The gavage needle.\n(B) The procedure of oral gavage.\nInsert the needle parallel to the upper jaw until the throat. Verticalize the needle and insert along the esophagus without any obstruction, until almost the whole needle is inserted (as shown in Figure 2[href=https://www.wicell.org#fig2]B).\nInject 200 μL of bacteria gently with no liquid overflowed from the mouth.\nResume the diet.\nAt day 1 to day 21.\nRecord the weight of mice every day, analyze the weight change according to the weight at day −1. See Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nObserve the stool consistency and recorded as the scoring criteria (0: normal, 1: loose stool, 2: shapeless loose stool, 3: diarrhea, 4: diarrhea with bleeding).\nCollect feces into sterile microcentrifuge tubes every other day. Detect the CFU of C. rodentium in the feces as the protocol of “Determine the C. rodentium CFU in the feces\".\nDetect the ILC3s response at day 5 as the protocol of “Assessment of the ILC3s response\".\nDetect the adaptive T cell response at day 10 and the antibody response at day 21 as the protocol of “Assessment of the adaptive humoral immune response\".",
    "Critical: 1. The gavage needle is stainless steel in material, 45 mm in length, and straight. 2. To make sure that the feces could be collected, avoid frightening the mice by moving the cage or making noise before the collection. 3. It is better to fetch the feces directly by attaching the microcentrifuge tube against the anus. When infected at a high dose or around day 5–7 post infection, the feces may be difficult to collect because of the dysentery. Watery stools can be scraped into the tube and estimate the volume instead of the weight.\nDetermine the C. rodentium CFU in the feces\nTiming: 1 h\nMake normalized fecal homogenate.\nWeight the feces using an analytical balance and transfer it to a sterile 5 mL tube.\nAdd 1 mL PBS buffer to every 50 mg feces.\nHomogenize the samples thoroughly using a tissue grinder.\nCount the CFU of C. rodentium in the feces.\nPrepare a U-bottom 96-well plate, 2 multichannel pipettes, and PBS buffer.\nAdd 180 μL PBS to interlaced column of the 96 well plate.\nAdd 20 μL of the sample to the first column. Mix with pipettes and transfer 20 μL to the next column, and so on.\nFor each sample, dot 10 μL of each well by the multichannel pipette with interlaced tips on the MacConkey Agar plate (as shown in Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/323-Fig3.jpg\nFigure 3. CFU counting of C. rodentium in the feces\n(A and B) The model for the dilution of fecal homogenate (A) and CFU of C. rodentium dot on the MacConkey Agar plate in 10-fold dilution gradient (B).\n(C) Other bacteria colonies like E. coli showing on the plate (black arrow).\nIncubate the plate in 37°C for 12–16 h.",
    "Count CFU of the last two countable dots on the plate (as shown in Figure 3[href=https://www.wicell.org#fig3]B). See Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nCalculate the concentration of C. rodentium in the feces according to the formula:\nC (CFU/g) = CFU in the dot × 2 × 10(n+3), n= the order of the dot counted. Take the samples shown in Figure 3[href=https://www.wicell.org#fig3]B, the CFU=5 × 2 × 10(4+3) = 1 × 108 CFU/g.\nCritical: 1. In step 1, wash the tissue grinder with ethanol twice and water twice between samples. In step 2, the data will be reliable if the ratio of two adjacent dots is approximately 10. 2. Other bacteria colonies should be excluded (as shown in Figure 3[href=https://www.wicell.org#fig3]C).\nAssessment of the ILC3s response\nTiming: 5 h\nIsolation of the lamina propria lymphocytes (LPLs) from the colon (Guo et al., 2016[href=https://www.wicell.org#bib6]).\nAt day 5 post infection, euthanize the mice by cervical vertebra dislocation and isolate the colon. Remove the content in the gut thoroughly by scraping, sliver the colon, and cut the tissues into 0.5 cm pieces.\nWash the tissues with 20 mL PBS in a 50 mL centrifuge tube by vertexing to clean up the content remained and transfer the tissues to Wash Buffer I.\nWash the tissues with 15 mL Wash Buffer I in 37°C, shake at 200 rpm on a shaking table for 20 min, twice.\nWash the tissues with 15 mL Wash Buffer II in 37°C, shake at 200 rpm on a shaking table for 20 min.\nDigest the tissues in 2.5 mL digestion buffer in a C-tube in 37°C, shake at 150 rpm on a shaking table for 30 min.\nHomogenize the tissues with the gentleMACS Dissociator for 1 minute and add 10 mL 1640 buffer to stop the digestion.",
    "Apply the samples to the 70 μm cell filter to make single cell suspension.\nCentrifuge the samples in 4°C, 650 × g for 5 min, resuspend the cells with 1 mL DMEM buffer and mix with 1 mL 80% Percoll solution (to make 40% Percoll solution) in a 5 mL tube.\nCarefully add 1 mL 80% Percoll solution at the bottom of the suspension. The clear separation of layers should be observed (as shown in Figure 4[href=https://www.wicell.org#fig4]A).\nCentrifuge the samples in 4°C, 950 × g with no brake for 20 min. The cell cloud between 40% Percoll and 80% Percoll is the LPLs (as shown in Figure 4[href=https://www.wicell.org#fig4]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/323-Fig4.jpg\nFigure 4. Isolation of LPLs by Percoll\nThe LPLs isolation from the colon before (A) and after (B) the centrifugation with Percoll.\nCarefully remove the top layer of epithelial cells and upper 40% Percoll, collect the LPLs with the micropipette into a 5 mL tube.\nWash the cells with 4 mL FACS buffer by centrifuging at 4°C 650 × g for 5 min, twice. Discard the supernatant and resuspend the cells with 1 mL FACS buffer.\nMix 10 μL 0.4% Trypan Blue with 10 μL cells mixture, and count the unstained cells (living cells) with the hemocytometer. See Troubleshooting 3[href=https://www.wicell.org#sec6.5] and 4[href=https://www.wicell.org#sec6.7].\nCritical: 1. Store the tissues in PBS on the ice until the Wash Buffer I. 2. If the gentleMACS Dissociator is not available, cutting the tissue until homogenized by scissors is an option. In that case, the cutting step should be done before the digestion. 3. The viability of LPLs should be over 90% for further analysis. The average number of LPLs is usually about 1 × 106–5 × 106 per colon.",
    "For all wash steps that are not mentioned specifically in this section, cells should be centrifuged at 4°C 650 × g for 5 min.\nExamine ILC3 in the LPLs.\nFor quantifying ILC3s:\nResuspend 2 × 106 LPLs with 50 μL Blocking buffer to block Fc receptor internalization.\nFor staining ILC3s, incubate the LPLs with Antibody Mixture 1 in 4°C for 30 min.\nWash the cells with FACS buffer.\nFix the cells with 100 μL fixation buffer at room temperature (20°C–25°C) for 20 min.\nWash the cells with 200 μL permeabilization buffer at room temperature (20°C–25°C) for 3 times.\nIncubate the cells with Antibody Mixture 2 in room temperature (20°C–25°C) for 30 min.\nFor function of ILC3s:\nResuspend 2 × 106 LPLs with 200 μL 1640 medium with 10% FBS, 10 mM HEPES and 1 mM Penicillin-Streptomycin and incubate at 37°C with 5% CO2. Stimulate with PMA (20 ng/mL) and Ionomycin (750 ng/mL) for 2 h, and add BFA for another 2 h.\nWash the cells with FACS buffer and incubate the LPLs with Antibody Mixture 1 in 4°C for 30 min.\nWash the cells with FACS buffer.\nFix the cells with the IC fixation buffer at 4°C for at least 12 h.\nWash the cells with the permeabilization buffer at room temperature (20°C–25°C) for 3 times.\nIncubate the cells with Antibody Mixture 3 in room temperature (20°C–25°C) for 30 min.\nWash and then resuspend the cells with FACS buffer, and detect the ILCs by flow cytometry.\nFirstly, define lymphocytes by gating CD45+ population and exclude dead cells by gating V780− cells. In the colon, ILCs can be gated as CD3−CD90+CD127+. In ILCs, RORγt+ cells are defined as ILC3s. See Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nAssessment of the adaptive humoral immune response\nTiming: 4.5 h",
    "For all wash steps in this section, cells should be centrifuged at 4°C, 650 × g for 5 min.\nDetection of GCB and TFH response in the mesentery lymph nodes (mLNs) (Melo-Gonzalez et al., 2019[href=https://www.wicell.org#bib10]). In mLNs, the germinal center is the place where B cells become mature in stimulation, which could be regulated by TFH cells. TFH and GCB can promote the production of high affinity antibodies to maintain intestinal homeostasis (Hepworth et al., 2015[href=https://www.wicell.org#bib4]).\nAt day 10 post infection, euthanize the mice by cervical vertebra dislocation and isolate the mLNs (as shown in Figure 7[href=https://www.wicell.org#fig7]A).\nGrind the mLNs to make single cell suspension.\nResuspend 2 × 106 lymphocytes with Blocking buffer to block Fc receptor internalization.\nTo stain GCB, incubate the lymphocytes with Antibody Mixture 4 in 4°C for 30 min.\nTo stain TFH, incubate the lymphocytes with biotin-labeled CXCR5 antibody in 4°C for 30 min.\nWash the cells FACS buffer in 4°C for twice, and then incubate the cells with Antibody Mixture 5 in 4°C for 30 min.\nWash and then resuspend the cells with FACS buffer, and detect the lymphocytes by flow cytometry.\nAnalysis of C. rodentium-specific antibodies in the serum (Wang et al., 2020[href=https://www.wicell.org#bib12]).\nAt day 21 post infection, collect the peripheral blood from epicanthic intravenous by the MiniCollect Capillary Blood Collection (0.9–1.1 mm inner diameter, 100 mm length). Euthanize the mice by cervical vertebra dislocation.\nStore the blood in 4°C for at least 12 h, and then centrifuge in 4°C, 2500 × g for 30 min.\nCarefully collect the supernatant and then centrifuge in 4°C, 13000 × g for 5 min. Collet the serum and store in 4°C for immediately usage or −80°C for longer storage.",
    "Resuspend 1 × 108 C. rodentium with 100 μL PBS buffer with proteinase inhibitor. Dissociate C. rodentium by ultrasonication on the ice for 3 times, 1 minute per time. Add 300 μL B-PER Complete Bacterial Protein Extraction Reagent.\nMix with gentle vortex for 30 min at room temperature (20°C–25°C). Centrifuge in 4°C, 16000 × g for 20 min to remove the cell debris.\nQuantify total protein with the BCA protein assay.\nCoat C. rodentium antigens at 5 μg/mL in 100 μL coating buffer on 96-well plates at 4°C for at least 16 h, and then wash the plate with PBST buffer.\nIncubate the diluted serum on the plate and detect IgG using HRP-labeled antibodies (SouthernBiotech) following the instruction of the kit.\nDevelop the plate with ABTS substrate (SouthernBiotech). Detect OD at 405 nm with an ELISA reader (BioTek).\nCritical: (1) To find out the mLNs, you can firstly find the cecum and search upstream along the mesenteries. The mLNs are always located in the central point of the mesenteries, umbraculiferously connecting the small intestine (as shown in Figure 7[href=https://www.wicell.org#fig7]A). All the mLNs should be collected. (2) When washing the biotin-labeled antibody, wash thoroughly by FACS buffer to avoid unspecific staining."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cell Isolation",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}