{
  "id": 7742,
  "origin_website": "Bio",
  "title": "Modelling Graft-Versus-Host Disease in Mice Using Human Peripheral Blood Mononuclear Cells",
  "procedures": [
    "Experimental Timeline Day -1: Prepare miceDay 0: Inject PBMCsDay 2 onwards: Monitor until endpointDay 7 onwards: Weekly bleeding to monitor engraftmentDetailed procedure Day -1: Prepare mice for infusion of PBMCs Create experimental groupsEar notch mice for identification.Randomly allocate mice to experimental groups. Mice should be housed under sterile conditions according to institutional guidelines and local ethical approvals. For reference, we house 2–4 mice per cage (UBC Animal Care Committee approval A18-0180). For the best practice, randomize mice and group them in a blinded fashion. Allocate littermates of the same cage to different experimental groups to control for cage-to-cage variation.Note: Tail marking may be used instead of ear notch, but this is short-lasting and requires repeated application. Weigh miceWipe a weighing bucket with 70% ethanol and place on a portable balance in a biosafety cabinet.Gently transfer a mouse to the weighing bucket and record the weight.Wipe the weighing bucket and gloves with 70% ethanol between cages.OPTIONAL: Irradiate miceKeeping the mice in their cage, irradiate with 150 cGy (150 rad) X-ray irradiation (exposure time to obtain 150 cGy varies between machines and should be established in consultation with local animal facility staff). Confirm the total accumulated dose using a dosimeter.Note: Preconditioning mice with X-ray irradiation is optional. The recommended dose is sublethal and considered as mild (Gibson et al., 2015). Irradiation facilitates faster and more consistent engraftment and significantly accelerates the onset of xenoGvHD (King et al., 2009). Monitor miceCheck mice for signs of stress/discomfort immediately after irradiation and 4 h later. Examples of such signs are provided in Table 1. If signs of stress/discomfort are observed, consult the veterinarian of your animal facility or euthanize the animal.Irradiation may cause minor (<10%) weight loss, which should be regained within five days.",
    "If the weight loss continues, humanely euthanize the animal and remove from the study.Table 1. Animal monitoring sheet with xenoGvHD scoring guide table:",
    "﻿0,1,2,3,4\n,xenoGvHD score guide,xenoGvHD score guide,xenoGvHD score guide,xenoGvHD score guide\n,0,1,2,3\nWeight loss (%),<5%,5%–10%,10%–15%,>15%\nActivity,\"Bright and alert; interested in the environment; interacts with casemates; looks at observer; when nudged, moves away or sniffs observer.\",\"Less interested in the environment; interacts less with casemates; disregards observer; when nudged, reluctantly moves away or hyperactive.\",\"Isolated from casemates; sits in corner of cage; does not readily move when cage is disturbed (only moves when touched); when nudged, pauses before moving away slowly.\",\"Immobile or hyperreactive, even when nudged; cannot right itself.\"\nHunch,Normal posture.,Mild or occasional hunching (round).,Moderate hunched posture (easily noticed).,Severe hunched posture (tip toe gait).\nFur/skin,\"Shiny, well-kept coat.\",\"Unkempt, dull, or soiled coat, ruffled fur; skin is mildly inflamed (mildly red).\",\"Fur loss (may be generalized with skin exposed by caressing or localized and presenting as alopecia—especially on face, neck, hinds); skin is moderately inflamed or affects face or footpads.\",\"Fur loss on 25% of mouse, soiled dull fur; skin is ulcerated (face, footpads). Note: conjunctivitis is also a sign of GvHD (1 = discharge, pus; 2 = closing, whitening of cornea).\"\nPain,,,\"Self-trauma; facial grimace: narrow or closed eyes, bulge on top of nose (mice), flattening of bridge of nose (rat), cheek convex (mice: between eye and whiskers), ears back or flat, whiskers pointing back or “standing out on end”. Other: muscle twitching or flinching, staggering, back stretch (like cat), abdominal writhing, abdominal pressing.\",\"Self-trauma; facial grimace: narrow or closed eyes, bulge on top of nose (mice), flattening of bridge of nose (rat), cheek convex (mice: between eye and whiskers), ears back or flat, whiskers pointing back or “standing out on end”. Other: muscle twitching or flinching, staggering, back stretch (like cat), abdominal writhing, abdominal pressing.\"\n,\"Nothing additional, monitor as per protocol\",\"Nothing additional, monitor as per protocol\",Monitor mice every day,Euthanize immediately",
    "Animals with a score of 2 in any one category: score every day. Experimental endpoints: cumulative score of six or seven weeks after injection of cells. Humane endpoints: score 3 in any one category.,Animals with a score of 2 in any one category: score every day. Experimental endpoints: cumulative score of six or seven weeks after injection of cells. Humane endpoints: score 3 in any one category.,Animals with a score of 2 in any one category: score every day. Experimental endpoints: cumulative score of six or seven weeks after injection of cells. Humane endpoints: score 3 in any one category.,Animals with a score of 2 in any one category: score every day. Experimental endpoints: cumulative score of six or seven weeks after injection of cells. Humane endpoints: score 3 in any one category.,Animals with a score of 2 in any one category: score every day. Experimental endpoints: cumulative score of six or seven weeks after injection of cells. Humane endpoints: score 3 in any one category.",
    "\"Other endpoints: Mice showing any signs of infection or severe condition such as eyelids closed, changes in respiration, loss of fur, unusually apprehensive or aggressive, scratching, biting or self-mutilation, hunched posture, aggressive vocalization, separation from group, or sunken or distended abdomen will be euthanized.\",\"Other endpoints: Mice showing any signs of infection or severe condition such as eyelids closed, changes in respiration, loss of fur, unusually apprehensive or aggressive, scratching, biting or self-mutilation, hunched posture, aggressive vocalization, separation from group, or sunken or distended abdomen will be euthanized.\",\"Other endpoints: Mice showing any signs of infection or severe condition such as eyelids closed, changes in respiration, loss of fur, unusually apprehensive or aggressive, scratching, biting or self-mutilation, hunched posture, aggressive vocalization, separation from group, or sunken or distended abdomen will be euthanized.\",\"Other endpoints: Mice showing any signs of infection or severe condition such as eyelids closed, changes in respiration, loss of fur, unusually apprehensive or aggressive, scratching, biting or self-mutilation, hunched posture, aggressive vocalization, separation from group, or sunken or distended abdomen will be euthanized.\",\"Other endpoints: Mice showing any signs of infection or severe condition such as eyelids closed, changes in respiration, loss of fur, unusually apprehensive or aggressive, scratching, biting or self-mutilation, hunched posture, aggressive vocalization, separation from group, or sunken or distended abdomen will be euthanized.\"",
    "Day 0: Preparation and injection of PBMCs Prepare PBMCs in a biosafety cabinet: either freshly isolated or thawed PBMCs may be used.Fresh cells: Isolate PBMCs from human peripheral blood using LymphoprepTM, according to established protocols (https://protocols.io/view/can-asc-consensus-protocol-isolation-cryopreservat-brrsm56e.pdf[href=https://protocols.io/view/can-asc-consensus-protocol-isolation-cryopreservat-brrsm56e.pdf]). PBMCs can be infused immediately after isolation or stored at 4 °C overnight and infused the following day. For the latter, cells should be stored in a 50:50 mixture of PBS and Immunocult-XF at a concentration of 10 × 106 cells/mL in a 50 mL Falcon tube laid horizontally.Frozen cells: Frozen PBMCs can be thawed on the day of infusion. Using batch frozen PBMCs allows the cells to be characterized before experimentation and can reduce experimental variability. An example of the variability that can result from using PBMCs from different donors is shown in Figure 1. An intravenous infusion of 5 × 106–10 × 106 PBMCs should achieve an engraftment level of >20% human CD45+ cells in the peripheral blood 14 days post infusion and xenoGvHD symptoms should be evident within 3–4 weeks. Using PBMCs that do not achieve these criteria may yield sub-optimal results.Note: Number of PBMCs may be a limiting factor. For large experiments, commercial leukopaks can be used as a frozen source of PBMCs. Prepare Immunocult-XF T-cell expansion media with 1% P/S. Warm up the media to 37 °C in a water bath. Add 10 mL of the media to 15 mL Falcon tubes. Prepare one 15 mL Falcon tube for each cryogenic vial.Note: We use Immunocult-XF T-cell expansion media to avoid the use of human serum, which often shows batch variations in composition. Any other T-cell expansion medium can be used here for the thawing process. Thaw cryovials in a 37 °C water bath until almost completely thawed.",
    "Add 1 mL of warm thawing media dropwise to cryotubes, then carefully transfer cells to a 15 mL Falcon tube containing 9 mL of warm media.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4566/bioprotoc-12-23-4566-g001.jpgFigure 1. PBMC donor variation in inducing xenoGvHD. Five million PBMCs from four different donors (PBMC A: male; PBMC B: female; PBMC C: male, and PBMC D: female) were tested for their ability to induce xenoGvHD. (A) % weight loss relative to day of PBMC infusion (day 0). (B) % mouse survival. (C) Cumulative GvHD score. (D) Engraftment of human (h) CD45+ cells as a proportion of total live CD45+ (mouse and human) cells.Note: For mice that were terminated before the endpoint (D42), the end date value for the calculation was carried forward in subsequent time points. Centrifuge cells at 450 × g for 5 min and discard the supernatant. To reduce cell clumping, resuspend the cells in 10 mL of Immunocult-XF + 1% P/S with DNase I at a concentration rate of 10 µg/mL, gently mix by pipetting, take a sample for counting, and incubate for 10 min at room temperature.Centrifuge cells at 450 × g for 5 min, discard the supernatant, and resuspend the PBMCs in sterile PBS at a concentration of > 100 × 106 cells/mL (approximately 120 × 106/mL).Pass cells through a 70 µm cell strainer, recount, and adjust the cell concentration to 100 × 106 cells/mL.Note: The cell concentration adjusted here is for a dose of 10 × 106 PBMCs in 100 µL injection volume. If you intend to inject a different number of cells, adjust the cell number such that 100 µL of PBS contains the desired number of cells. The number of cells required for inducing xenoGvHD varies between PBMC donors, thus a pilot study to assess the engraftment capacity of cryopreserved PBMC aliquots is strongly recommended.",
    "If additional agents or cells of interest (e.g. Tregs) are co-administered with the PBMCs, the final infusion volume should not exceed 1% of the mouse body weight (i.e., 200 µL for a 20 g mouse). Follow guidelines from your animal ethical committee for the maximum injection volume via tail vein. Just before cell injection, transfer cells to a 1.5 mL tube and store on ice until injection to minimize the time between cell storage on ice and cell injection.Note: On the day of injection the viability of PBMC should be higher than 70%. PBMC injection: Remove cells from ice 10–15 min before injection to warm up the cell suspension to room temperature. Gently mix the PBMCs by inverting the 1.5 mL collection tube. Draw 100 mL of cells into an insulin syringe and ensure no bubbles are present. Inject directly in the tail vein with the bevel pointing upwards, following the method below:Notes:  1) The temperature of circulatory blood in the mouse tail vein is approximately 37 °C. Warming up cells to 37 °C or room temperature before adoptive transfer minimizes the heat shock to cells and ensures better survival in vivo. 2) Limit drawing the cells up and down into the syringe as much as possible; instead, mix by inversion. Repeatedly drawing the cells in and out of the syringe exposes them to unnecessary sheer stress that reduces viability. If you are injecting any other cells with the PBMC, cells can be mixed together and injected as a single inoculation in a total volume of 200 µL. Vasodilate the tail vein of mice prior to intravenous injections to help with visualization. This can be performed using one of the following approaches:Place half of the cage on top of a safe heat source such as a heat pad.",
    "Only half of the cage should be on the heat source so that there is a cooler half of the cage where mice can move to in case of overheating.Apply heat directly to the tail itself using a glove filled with lukewarm water. Make sure the water is not too hot to avoid burn injury.Any of the above methods can be used for efficient vasodilation, but never leave mice unattended around heating sources.Place mice in a restrainer if injecting conscious, or in a warmed anesthetizing induction chamber if injecting anesthetized mice.Note: If injecting an anesthetized mouse, make sure to inject as quickly as possible since the anesthetic agents can cause vasoconstriction making it difficult to find the vein. Hold the warmed tail with the non-dominant hand and locate one of the two lateral tail veins. Swab the tail with 70% ethanol (avoid applying too much alcohol, which may cause vasoconstriction) to disinfect and increase the visibility of the vein. Then, insert the needle bevel up into the distal portion of the middle third of the tail with the dominant hand.Slowly press the plunger to test if you are in the vein. If the needle is in the vein there will be no resistance; however, you will feel resistance if it is not in the vein. Once confident that you are in the vein, gently inject 100 µL of cell suspension. Keep the needle in place for 2–3 s to limit backflow of the injected cells, then remove the needle and press the injection site with a sterile gauze to stop bleeding and limit backflow of cell suspension. Monitor the animals for 5–10 min for any sign of discomfort or bleeding.",
    "Note: While injecting cells in the tail vein do not pull the plunger back, as this may cause clumping of cells. We recommend using insulin syringes for injections as there is less dead space, which minimizes volume loss during injection. See Yano et al. (2020) for a detailed video protocol. Day 2 to endpoint: Monitoring Monitor body weight and health status of mice according to the approved animal use protocol. For our protocol (UBC Animal Care Committee approval A18-0180), this is three times per week.Bleed mice by puncturing the saphenous vein once every seven days post cell injection to monitor cell engraftment.Euthanize mice and end experiment according to approved animal protocol. In our case, this is when any of the following criteria are achieved: i) >15% body weight loss, ii) any health score category is ≥3, or iii) the cumulative health score is ≥6 (Table 1).Day 7 onward: Weekly bleeding to check engraftment Collect blood from the lateral or medial saphenous veins following the steps below:Prepare blood collection tubes (1.5 mL Eppendorf) by adding 3 µL of heparin (50 mg/mL) into separate tubes for each animal.Place a mouse in an appropriate restrainer with your non-dominant hand, ensuring that the animal’s leg remains extended.Locate the medial (inner) or lateral (outer) saphenous vein and remove the hair using the electric shaver. Swab the intended puncture area with a cotton tipped applicator moistened with 70% ethanol and apply a thin film of petroleum jelly.Using a sterile 27 G needle, puncture the blood vessel perpendicular to the skin at the most proximal visible area of the vein. Keep the needle in the vein for 2–3 s to allow the skin to stretch around the puncture site.",
    "Collect blood (approximately 50–70 µL) in a heparinized capillary tube by gently touching the end of the capillary tube to the blood drop. Transfer the blood from the capillary to the blood collection tubes. Store tubes at room temperature until further processing.Press the puncture site with a sterile gauze for at least 30 s or until bleeding stops. Transfer mice to cage and monitor for 10 min to ensure complete cessation of bleeding.Processing and flow staining of peripheral blood Transfer 50 µL of blood to a 96-well V-bottom plate and add 150 µL of PBS.Centrifuge the plate at 1,065 × g for 3 min and pipette off supernatant. Meanwhile, prepare 1× RBC lysis buffer in distilled water and warm up in a 37 °C water bath.First RBC lysis: Resuspend blood cell pellet in 180 µL of 1× RBC lysis buffer, mix well, incubate 3 min at room temperature, centrifuge at 1,065 × g for 3 min, and pipette off supernatant.Second RBC lysis: Resuspend the cell pellet in 180 µL of 1× RBC lysis buffer, incubate 3 min at room temperature, centrifuge at 1,065 × g for 3 min, and pipette off supernatant.Note: Cell pellet remains loosely attached during RBC lysis. To avoid cell loss, pipette off supernatant carefully. First wash: Resuspend the cell pellet in 180 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Second wash: Resuspend cell pellet again in 180 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Dilute mouse Fc Block in PBS (see Table 2), add 25 µL/well, and incubate for 10 min at room temperature.Table 2. Panel for weekly and endpoint engraftment testing table:",
    "﻿0,1,2,3,4,5,6\nType,Marker,Clone,Fluor,Dilution (2×),Supplier,Cat. No.\nSurface,Mouse Fc Block,2.4G2,-,1: 50,BD Biosciences,553142\nSurface,FVD,-,eF780,1: 500,eBioscience,65-0865-18\nSurface,mCD45,30-F11,AF700,1: 50,BD Biosciences,560510\nSurface,hCD45,HI30,V500,1: 50,BD Biosciences,560777\nSurface,hCD4,SK3,BV785,1: 50,BD Biosciences,563877\nSurface,hCD8,RPA-T8,BV711,1: 100,BD Biosciences,563677\nSurface,hCD3,UCHT1,BB515,1: 100,BD Biosciences,564466\nSurface,hHLA-A2,BB7.2,APC,1: 100,Invitrogen,17-9876-42\nIntracellular,hFoxp3,236A/E7,PE-Cy7,1: 50,eBioscience,25-4777-42\nIntracellular,hHelios,22F6,AF488,1: 50,BioLegend,137223",
    "Meanwhile, prepare the surface staining mixture in PBS as per Table 2. Top up wells with 25 µL/well of staining mix, mix well, and incubate for 20 min at room temperature in the dark.Top up each well with 150 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Note: Optional additional steps for intracellular staining, e.g. to measure FOXP3 expression:  9a. Prepare 1× fix/perm buffer (one part fixation/permeabilization concentrate, three parts fixation/permeabilization diluent). 9b. Resuspend cell pellet in 100 µL of fix/perm buffer and incubate at room temperature for 45 min in the dark. 9c. Meanwhile, prepare 1× permeabilization buffer in distilled water. 9d. Top up the well containing cell pellet with 100 µL of permeabilization buffer, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant. 9e. Resuspend cell pellet in 100 µL of permeabilization buffer a second time, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant. 9f. Prepare intracellular staining mix in 1× permeabilization buffer as per the dilution in Table 2. 9g. Resuspend in 25 µL of staining mix and incubate for 40 min at room temperature in the dark. 9h. Top up wells with 180 µL of permeabilization buffer, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant. Top up each well with 180 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Resuspend cells in 150 µL of FACS buffer (PBS + 1% FBS + 5 mM EDTA) and transfer cells to micro test tubes.Note: To obtain absolute cell concentrations, 10,000 counting beads may be added to each micro test tube at this point. Make sure to vortex beads very well as they settle quickly.",
    "Set the voltages of forward scatter (FSC) and side scatter (SSC) such that both cells and beads are visible. Beads fluoresce strongly in both FITC/PE channels. Ensure bead fluorescence in these channels are on scale before acquiring samples. Endpoint preparation of leukocytes for flow cytometry Collection of cardiac blood and spleen Prepare 1.5 mL Eppendorf tubes with 3 µL of heparin for cardiac blood and 1 mL of PBS for spleen.Put mouse into surgical plane of anesthesia using isoflurane vaporizer gas anesthesia chamber.Move mouse to nose cone, rinse a 1 mL syringe fitted with 27 G needle with heparin, perform cardiac puncture, and extract approximately 100 µL of blood.Perform cervical dislocation and harvest spleen avoiding the pancreatic tissue (pancreatic enzymes may cause damage to T cells).Processing and flow staining of cardiac blood and spleen Blood:  Perform lysis and flow staining of 70 µL of blood as described in the section “Processing and flow staining of peripheral blood.”Spleen:  Record the weight of the whole spleen, cut a small piece (approximately 15 mg) of spleen tissue, and mash on a pre-wet (with PBS) 70 µm cell strainer fitted on a 50 mL Falcon tube with a 1 mL syringe plunger. Rinse the filter with PBS until no visible particulate is present.Note: Alternatively, mash the whole spleen, then take a portion of the cells (i.e. mash, centrifuge cells at 450 × g for 5 min, resuspend the cells in 1 mL PBS and take 20 µL for 1/50 of the total splenocytes).Centrifuge the cell suspension at 450 × g for 5 min, discard supernatant by pouring, and transfer (approximately 200 µL) to a 96-well V-bottom plate.Centrifuge the plate at 1,065 × g for 3 min and pipette off the supernatant.",
    "Perform RBC lysis once by resuspending cell pellet in 180 µL of 1× RBC lysis buffer and incubate for 3 min at room temperature.Resuspend cell pellet in 180 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off supernatant.Resuspend cell pellet again in 180 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off and discard the supernatant.Dilute mouse Fc block in PBS (see Table 2), add 25 µL/well, and incubate for 10 min at room temperature.Meanwhile, prepare the staining mixture in PBS as per Table 2, add 25 µL of staining mix per well, and incubate for 20 min at room temperature in the dark.Top up each well with 150 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Wash cells by resuspending in 150 µL of FACS buffer, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Resuspend the cell pellet in 150 µL of FACS buffer and transfer to micro test tubes.OPTIONAL: Processing and flow staining of laminar propria lymphocytes (LPL):  A major symptom of xenoGvHD is the manifestation of intestinal inflammation and colitis-like pathology. This can be further investigated by analyzing lymphocytes in the colon using the following protocol:Collect colon: Open abdomen and collect entire colon from the rectum to the cecum. Gently remove fecal material by pushing along the colon towards the rectum. Place the colon into a 50 mL Falcon tube with 15 mL of cold RPMI supplemented with 10% FBS, 2 μM Gibco GlutaMax, 1× P/S, 25 mM HEPES, and 55 μM β-mercaptoethanol and store on ice.Intestinal epithelial cell wash: Carefully discard the RPMI medium, add approximately 25 mL of PBS, and vortex for 2–3 s to wash the colon.",
    "Repeat this wash with an additional ~25 mL of PBS. Discard the PBS and add 15–20 mL of warm (37 °C) RPMI supplemented with 5% FBS, 1 mM DTT, and 1 mM EDTA. Vortex for 2–3 s and shake tubes at 37 °C for 10 min.Intraepithelial lymphocyte wash: Carefully discard the RPMI/DTT mixture and add 15–20 mL of cold (4 °C) RPMI + 2% FBS. Vortex for 2–3 s to wash the colon, discard supernatant, and repeat this wash step with an additional 15–20 mL of RPMI + 2% FBS. Discard the supernatant and add 15–20 mL of warm (37 °C) RPMI supplemented with 5% FBS, 1 mM DTT, and 1 mM EDTA. Vortex for 2–3 s and shake tubes at 37 °C for 20 min.Colon digestion: Carefully discard the RPMI/DTT mixture and add 15–20 mL of cold (4 °C) RPMI + 2% FBS. Vortex for 2–3 s to wash colon, discard supernatant, and repeat this wash step with an additional 15–20 mL of RPMI + 2% FBS. Discard supernatant and add 14 mL of warm (37 °C) RPMI supplemented with 0.5 mg/mL collagenase VIII + 20 µg/mL DNase I. Shake at 37 °C for 30 min to digest the colon.Pour the media and digested colon over a fresh 70 µm cell strainer into a fresh 50 mL Falcon tube. Mechanically disrupt the remaining colon with a syringe plunger against the cell strainer and wash the cell strainer with additional cold RPMI + 2% FBS to a final volume of 35 mL. Pellet the cells at 500 × g for 10 min.Lymphocyte enrichment: Make an isotonic Percoll solution (nine parts Percoll to one part 10× PBS) and use this to dilute with 1× PBS to yield 40% and 80% Percoll solutions.",
    "Add 3 mL of 80% Percoll to 15 mL Falcon tubes. Resuspend the cell pellet from step 5 in 4 mL of 40% Percoll and carefully overlay onto the 80% Percoll. Centrifuge at 652 × g at room temperature with brake off.Remove the lipid-like top layer to prevent contamination and collect the interphase containing LPLs (approximately 3 mL) into a fresh 15 mL tube.Top up with PBS to wash and pellet the cells at 652 × g for 5 min at 4 °C. Repeat this wash step and proceed to stain the enriched LPLs.Dilute mouse Fc block in PBS (see Table 2), add 25 µL/well, and incubate for 10 min at room temperature.Meanwhile, prepare the staining mixture in PBS as per Table 2, top up with 25 µL/well of staining mix, and incubate for 20 min at room temperature in the dark.Top up each well with 150 µL of PBS, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Wash cells by resuspending in 150 µL of FACS buffer, centrifuge at 1,065 × g for 3 min, and pipette off the supernatant.Resuspend the cell pellet in 150 µL of FACS buffer and transfer to micro test tubes. Add 10,000 counting beads if an absolute cell count is desired."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}