{
  "id": 17998,
  "origin_website": "Jove",
  "title": "Virtual Hand with Ambiguous Movement between the Self and Other Origin: Sense of Ownership and 'Other-Produced' Agency",
  "procedures": [
    "All methods described here were approved to follow the Code of Ethics of the World Medical Association (Declaration of Helsinki) and approved by the Independent Ethics Committee of Nagaoka University of Technology. No identifying information was collected from the undergraduates. Participants were given detailed information about the experiments before participating and were required to sign a written acceptance statement. Written informed consent was obtained from all subjects and was stored at Nagaoka University of Technology.\n1. Preparing seven kinds of videos\nNOTE: In total, create seven videos for a pre-experimental session (one video) and for experimental sessions in the “stable”, “slow” and “fast” conditions (Figure 1) for each gender (three times two videos).\nIn an experiment room, set a table and two chairs, a hand rest (approximately 35 x 60 cm white cushion tilted approximately 25 degrees) and a display on the table (Figure 2). Mark these positions to be able to reproduce accurately in the experimental session.\nPlace a 360° camera at eye level when the participants are sitting in the chair (Figure 2).\nStart to record the camera with nobody in the video for approximately 20–30 s for a pre-experimental session to ensure that there is reasonable visibility for each participant.\nFor the video to show male participants, let a male experimenter (Experimenter A) wear a lab coat, sit in the chair and put on his left hand on the hand rest with the palm up, taking care that the fingers do not touch each other nor touch the hand rest.\nPlay a 60 bpm 4-beat reference tone using a metronome application and a smartphone.\nLet another experimenter (Experimenter B) sit facing Experimenter A, with a paint brush in Experimenter B’s hand (Figure 3).\nStart to record the camera for the video to use the “stable” condition.",
    "Using the reference tone, let Experimenter B stroke all of Experimenter A’s fingers for 80 s. At the same time, let Experimenter B memorize the trajectory to reproduce it later.\nBy the third experimenter, show an action that an approximately 30 cm kitchen knife (20 cm blade) appears, slashes Experimenter A’s left wrist and disappears, taking 5 s (Figure 4).\nAfter 5 s of margin duration, stop the camera.\nStart to record the camera for the video to use the “slow” condition.\nRepeat step 1.8 while changing the brush trajectory to avoid monotony.\n60 s after the start, let Experimenter A close and open the five fingers at a consistent slow speed for 20 s (20 s/close and open cycle, approximately 1.3 mm/s; Figure 5(A)).\nRepeat steps 1.9 and 1.10.\nStart to record the camera for the video to use the “fast” condition.\nRepeat steps 1.12 to 1.14 while changing the finger speed from slow to fast (2 s/open and close cycle, approximately 35 mm/s; Figure 5(B)).\nRepeat steps 1.4 to 1.16 while changing from a male Experimenter A to a female Experimenter A to produce another three videos for the female participants.\nRemove the camera. Check that the videos do not diverge from the real world, using the HMD and sitting the chair and putting left hand on the hand rest.\nIf necessary, practice reproducing the trajectory of the brush accurately.\n2. Experimental procedure\nUse more than 18 participants who are healthy adults (approximate ages of 18–25 and a gender ratio of 50% are better) without history of major illness and naïve to the experiment and speaking the same native language to collect subjective reports. Experiment with each participant separately.\nRHI with/without finger movement sessions and SCR measurements",
    "Conduct the following steps that include the role of interacting with the participant by the same experimenter with the same looks as Experimenter B in the videos to use. Use assistance if necessary.\nAsk a participant to wear a lab coat and sit the chair. Attach Ag–AgCl electrodes connected with an SCR data acquisition device to the index and ring fingers of the participant’s right hand after polishing those fingers. Keep the hand down while not touching anything. Set the sampling rate at 500 samples/s, and start to record the SCR data.\nGive to the participant the following three instructions:\n\t\t1. “Your task is put your left hand on the hand rest with the palm facing up and keeping the hand stable”\n\t\t2. “Please try to relax.”\n\t\t3. “When wearing the HMD, please look at your left hand”.\nHave the participant wear an HMD with a black screen. Mirror the screen on the HMD to the display on the table until the end of the experiment.\nShow the video for the pre-experimental session on the HMD after announcing that. Ask the participant to look around and ensure that the view is natural. If something is wrong, adjust the HMD or the seat height until the participant is comfortable.\nShow a black screen on the HMD, and ask the participant to put his/her left hand on the hand rest with the palm up. Help the participant, and take care that the fingers are not touching each other or the hand rest.\nSit facing the participant with headphones and a paintbrush. Prepare for one video for one of the three conditions with the left hand of the same gender as the participant.",
    "Begin the first trial with one condition randomly selected from the three. After announcing that the session is beginning, start the video. Brush the participant’s left hand with the same timing and position as s/he is watching, checking the mirroring display on the desk and the reference tone, until the knife cuts in (Figure 3(B)).\nShow a black screen on the HMD 2 minutes to allow SCR to return to normal.\nRepeat steps 2.2.8 to 2.2.10 for the remaining five times (a total of six times; two trials of each of the three conditions) in random order. Ask the participant after every two trials whether anything is wrong with the physical condition.\nStop recording the SCR data. Remove the HMD and SCR data acquisition device.\nFace-to-face interviews: Pose the following questions to the participant and collect the answers orally while recording them.\n\t\nAsk “Did you see that the hand was moved?” [Q1: For confirmation]\n\t\tIf the answer is not “Yes”, go to step 2.3.4.\nAsk “Did you see the movement of the two speeds? [Q2: For confirmation]\n\t\tIf the answer is not “Yes”, go to step 2.3.4.\nAsk “What did you think about the slower hand movement?” [Q3: For SoA evaluation]\nAsk “Could you tell me if you felt anything during the experiment.” [Q4: Free report]\n3. Data analysis\nSCR data\n\t\nIdentify the SCRs for each trial in the following manner19,21,22: the difference in amplitude between the maximal and minimal value that occurred during all of 2–10 s in the last 5 s (knife threat; for evaluation of SoO) and immediately after 5 s.\nCalculated the magnitude of amplitudes according to a pre-established method23 as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61755/61755equ01.jpg",
    "Conduct the Shapiro–Wilk test on all data. If it is confirmed that some data were not normally distributed, use nonparametric statistical tests to process the data; otherwise, use parametric statistical tests. In all statistical tests, set alpha to 5%.\nEvaluate the difference among the three conditions with a multiple comparison.\nFace-to-face interviews\n\t\nDivide the data of those who answered “No” to Q1 and/or 2.\nCompare the answers to Q3 with the following three statements that have been used to measure participants’ SoA in the RHI study13.\n\t\tStatement 1: The hand moved just like I wanted it to, as if it was obeying my will.\n\t\tStatement 2: I felt as if I could control the movements of the hand.\n\t\tStatement 3: I felt as if I could cause the movement I saw.\nClassify the answers to Q3 from a summary of each, and analyze the overall trend."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}