{
  "id": 5847,
  "origin_website": "Bio",
  "title": "Quantification of <em>Trypanosoma cruzi</em> in Tissue and <em>Trypanosoma cruzi</em> Killing Assay",
  "procedures": [
    "Preparation of bone marrow-derived macrophages Note: The following protocol referred to a previous report (Weischenfeldt and Porse, 2008).    Euthanize mice with isoflurane inhalation solution.   Sterilize the hind legs and abdomen with 70% ethanol.   Make an incision in the midline of the abdomen.    Clip outward to expose the hind legs.   Remove all muscle from the bone using scissors and cut off the bones at the root of the femurs.   After cutting the bone at both lower extremities, separate the femur and tibia by cutting at the knee joint in a Petri dish.   Flush the bones with HBSS using a 10 ml syringe and a 26 G needle.    Pass the bone marrow cells through a cell strainer in 50 ml tubes.    Centrifuge at 240 x g for 5 min at 4 °C.   Aspirate the supernatant and add 1 ml ACK lysing buffer (see Recipes) for the lysis of red blood cells at room temperature.   After 3 min, add 9 ml cold PBS.   Centrifuge at 240 x g for 5 min at 4 °C.   Aspirate the supernatant.   Culture 2 x 107 bone marrow cells isolated from the lower extremities of a mouse in 10 ml RPMI 1640 culture medium (see Recipes) supplemented with 10 ng/ml GM-CSF in a 10 cm culture dish.   Wash the cells with PBS twice every 2 days and add fresh RPMI 1640 culture medium with 10 ng/ml GM-CSF.   After 6 days, aspirate the supernatant and add 10 ml PBS.   Aspirate the PBS and add 1 ml 0.25% trypsin containing 0.02% EDTA. Incubate at 37 °C for 5 min.   Add 10 ml RPMI 1640 culture medium and scrape the cells with a scraper.   Collect the cells in RPMI 1640 culture medium into 50 ml tubes.    Centrifuge at 240 x g for 5 min at 4 °C.   Aspirate the supernatant.",
    "Place the glass coverslips, sterilized by autoclave treatment, into the wells of a 24-well plate.   Plate 5 x 104 bone marrow-derived macrophages on glass coverslips with 500 μl RPMI 1640 culture medium containing 10 ng/ml GM-CSF.   After 18 h, bone marrow-derived macrophages are used in the T. cruzi killing assay.      T. cruzi killing assay   Bone marrow-derived macrophages prepared as in steps A23-A25 are cultured with 500 μl RPMI 1640 culture medium for 18 h in the presence of 0, 1, 10, or 100 ng/ml IFN-γ, which enhances parasite-killing activity in phagocytic cells.    Aspirate the supernatant and wash with 500 μl PBS five times.   Add 500 μl RPMI 1640 culture medium with 10 ng/ml GM-CSF.   Infect 5 x 104 T. cruzi trypomastigotes with macrophages for 6 h (MOI = 1).   After washing with 500 μl PBS three times, add 500 μl RPMI 1640 culture medium with 10 ng/ml GM-CSF and culture for 72 h.   Aspirate the culture medium and wash with 500 μl PBS.   Fix cells with 500 μl 4% paraformaldehyde and incubate for 10 min at room temperature.   To visualize intracellular amastigotes, stain the cells using Diff-Quik kit.   Apply a coverslip onto a slide glass using forceps.   Count the number of intracellular amastigotes (Figure 5) under a microscope.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115001809_5433.jpg Figure 5. The intracellular parasites. Bone marrow-derived macrophages infected with T. cruzi for 6 h in the presence or absence of IFN-γ were rigorously washed and cultured for 72 h. The cells were fixed and stained with Diff-Quik. Original magnification, 400x. * Indicates nucleus. An arrowhead indicates amastigotes.    The intracellular parasite numbers in 200 macrophages are counted under a light microscope (Figure 6).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115001847_6204.jpg Figure 6. The number of intracellular amastigotes. The number of parasites per 200 macrophages. Graph represents the mean ± SD from three independent experiments. *P < 0.",
    "05. Differences between the control and experimental groups were evaluated using Student’s t-test. Differences of P < 0.05 were considered significant."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}