{
  "id": 11998,
  "origin_website": "Jove",
  "title": "In Vivo Targeting of Xenografted Human Cancer Cells with Functionalized Fluorescent Silica Nanoparticles in Zebrafish",
  "procedures": [
    "All animal procedures were approved by the Institutional Animal Care and Use Committee (IACUC) at Boston University School of Medicine under the protocol #: PROTO201800543.\n1. Generation of Casper zebrafish embryos\nChoose adult Casper fish that are at least 3 months of age for natural breeding to generate transparent Casper zebrafish embryos.\nFill two-chamber mating tanks with fish water in the evening, separate the upper tanks using dividers, place one male fish into one side of the chamber and one or two female fish into the other side of the chamber, and leave the fish separated overnight by dividers.\nPull out the dividers the next morning at 8:00 AM when the lights are on. Add artificial enrichment plants and tilt the top chamber slightly to create a shallow area of water. Allow the fish to breed for 3-4 h.\nLift the top chambers of the mating tanks that contain the fish and return them to their original tanks.\nCollect eggs located in the bottom chambers by pouring the water through a mesh net. Transfer eggs to a sterile Petri dish at a density no greater than 200 eggs per dish. Remove any dead or unfertilized eggs and fill the dish 2/3 full with fresh fish water.\n\tNOTE: Fertilized and healthy eggs should be translucent and round. Any eggs that are cloudy, white, or disfigured should be removed. Fish water is obtained from fish tanks in the fish facility.\nIncubate embryos in the incubator at 28.5 °C overnight.\nBleach the embryos the next morning using the standard protocol as described in The Zebrafish Book16, and put the embryos back to the incubator (optional step).\nTake the 24 hpf embryos out of the incubator in the afternoon and dechorionate the embryos using pronase.",
    "Remove as much fish water as possible from the embryos in the Petri dish and add a few drops of the pronase solution (1 mg/mL in fish water) to the dish. Gently swirl the Petri dish. Once the chorions show signs of disintegration, pipette the embryos up and down a few times to break down the chorions to release the embryos.\nAdd fresh fish water immediately into the Petri dish to terminate the process once a majority of the embryos are out of the chorions. Rinse the embryos 3x more using fish water to remove the floating chorions. Return the embryos to the incubator.\n2. Preparation of human cancer cells for transplantation\nSet the incubator temperature to exactly 35.5 °C. Monitor the incubator to ensure a consistent and stable temperature using a thermometer inside the incubator.\nAutoclave 1 L of fish water in a glass bottle. Make a 3% agarose solution by adding 3 g of electrophoresis-grade agarose to 100 mL of autoclaved fish water and microwaving until the agarose is completely dissolved.\n\t\nPour hot agarose solution into a Petri dish until it is 3/4 full. Place the microinjection mold on the agarose. Ensure that the mold is not in contact with the bottom of the Petri dish and no bubbles form underneath.\nAllow the solution to solidify and carefully remove the mold from the plate. Fill the plate with autoclaved fish water and store the plate at 4 °C. Prewarm the agarose plate and fish water in the 35.5 °C incubator before harvesting HeLa cells.",
    "Pull 1.0 mm O.D. x 0.78 mm borosilicate glass capillaries on a pipette puller using the following settings: pressure at 500, heat at 560, pull at 100, velocity at 100, and time/delay at 200. Store needles on putty in a large Petri dish that has been wiped with an ethanol towel.\n\tCAUTION: Pulled needles are very sharp and fragile. Use caution when handling.\nPrepare a stock solution of tricaine methanesulfonate (MS222, 4 mg/mL) by dissolving MS222 into autoclaved fish water. Vortex well before use. Dilute MS222 stock solution 1:100 in fish water (i.e., add 200 µL of MS222 stock solution to 20 mL of fish water to a final concentration of 40 µg/mL) to anesthetize embryos for the following procedures.\nCulture hLabel HeLa cells by transducing them with PLenti6.2_miRFP670 lentivirus using the protocol described17. Harvest RFP+ HeLa cells 30 min-1 h before the transplantation.\n\tNOTE: Human HeLa cells have been cultured in a tissue culture incubator up to 70% confluency in complete growth medium (DMEM medium with 10% FBS) at 37 °C supplemented with 5% CO2.\n\t\nRemove the HeLa cell medium by aspiration in a tissue culture hood. Briefly rinse the cell layer with sterile PBS to remove all traces of the serum.\nAdd 3.0 mL of sterile Trypsin-EDTA solution to a T-75 flask and place the cells back into the 37 °C tissue culture incubator for 3-5 min to facilitate enzymatic digestion. Observe the flask under the microscope until ~80% of the cells become suspended.\nAdd 6-8 mL of complete growth medium into the flask. Collect the cells into a 15 mL sterile tube by gently pipetting. Centrifuge at 135 x g for 5 min.",
    "Aspirate the supernatant and resuspend HeLa cells in 3 mL of complete growth medium. Repeat the above washing step 2x. Resuspend the cells in 1 mL of complete growth medium and count the cells under the microscope using a hemocytometer.\nSpin the cells down again, remove the supernatant, and resuspend the cells in a 1.5 mL microcentrifuge tube at a concentration of 5 x 107 cells/mL. Keep the cells warm by holding the tube in one hand when transporting to the fish facility.\n\t\tNOTE: Always keep the cells warm by storing the cells inside the 35.5 °C incubator before or during injecting the embryos.\n3. Transplantation of human cancer cells\nClean up the work area using ethanol towels before transplantation (e.g., scissors, tweezers, plastic pipettes, razor blades).\nAlign embryos within the grooves of the agarose plate using a plastic pipette. Lay embryos on the side with the anterior facing forward.\n\tNOTE: Make sure that the fish water covers the embryos. Set some embryos aside to not inject cancer cells and use as controls.\nTurn on the air source and microinjector. Take HeLa cells out of the incubator and pipette the cells up and down 20-30x using a P200 tip. Load 3 µL of cell mixture immediately into a needle using a gel loading tip with a cut end. Carefully insert the tip toward the sharp bottom end of the needle. If needed, shake the needle to ensure the cell mixture moves down the needle to fill up the sharp end.",
    "Insert the needle into the needle holder. Use a pair of tweezers to carefully break open the tip of the needle. Adjust the pressure and duration of time on the microinjector to push out all of the air bubbles inside the needle tip. Reduce the pressure and injection duration time until the size of the injection droplets is ~1 nL.\nPlace the injection plate under the microscope in an appropriate position to have the yolk side of embryos facing the needle. Anesthetize the embryos by adding five drops of the diluted MS222 solution (40 µg/mL).\nPosition the injector and allow the needle to touch the perivitelline cavity of each embryo.\nInject the cell mixture into the embryos at the vascularized area under the perivitelline cavity by pressing the foot pedal.\nUse the nondominant hand to move the injection plate to the next embryo. Use the dominant hand to extend and retract the injector while pressing the foot pedal simultaneously to continue the injection. Pipette a few drops of sterile fish water onto embryos that have been injected. Once the injection of all embryos on the plate is completed, wash the embryos off with sterile fish water, put them on a sterile Petri dish and immediately move them to the 35.5 °C incubator.\nAfter 3 h, examine the injected embryos and remove the dead ones.\nReturn the live embryos to the 35.5 °C incubator and incubate them for 20-24 h to allow the HeLa cells to spread from the injection site to other parts of the body.\n\tNOTE: Embryos are kept in 35.5 °C incubator to allow the survival and migration of human cancer cells because the cells do not do well at 28.5 °C, the temperature fish embryos are normally incubated.\n4. Injection of nanoparticles or vehicle",
    "Anesthetize the transplanted embryos the next morning with five drops of diluted MS222 solution. Do not to add too much MS222, because this will kill the embryos. Under a fluorescent microscope, carefully pick up embryos with tail metastasis of RFP+ HeLa cells and place them into a new Petri dish with sterile fish water.\nMake the injection needles as previously described in section 2 using the following settings: pressure at 500, heat at 645, pull at 60, velocity at 50, and time/delay at 100.\nFollow the procedures in steps 3.1-3.3 to align embryos and load vehicle (e.g., H2O) or the nanoparticle solution into the needle.\nInject 0.5 nL of 1 mg/mL nanoparticle solution behind the eye and continue the injection as described in steps 3.5-3.6 (Figure 1B). This location behind the eyes is enriched with capillaries, allowing the nanoparticles to enter circulation.\nFollowing a similar procedure, inject the vehicle (e.g., H2O) that was used to suspend the nanoparticles into embryos with HeLa cells transplanted and those without (i.e., controls) (Figure 1A, C).\nIncubate all injected embryos at 35.5 °C.\n5. Imaging and tracking of nanoparticles and cancer cells\nExamine injected embryos under a fluorescent microscope at 0, 30, 60, 90, 120, 180, and 210 min postinjection of nanoparticles to monitor their distribution in circulation and the degree of cancer cell targeting. The targeting of cancer cells by nanoparticles can be observed as early as 30 min postinjection depending on the type of nanoparticle tested.\nPipette 2-3 embryos into a Petri dish and immobilize them by adding five drops of diluted MS222 solution (40 µg/mL). Once the embryos stop swimming, remove most of the water to allow the embryos to lie on their sides.",
    "Use a pipette with a thin, soft brush attached to its end to align the embryos so they lie on their sides with the anterior facing forward and only one eye visible.\nImage the embryos in red, blue, and brightfield channels at low magnification (2x) to capture the whole embryo and repeat at higher magnification (6.4x) to capture the tail area. Focus the embryo under the red channel to avoid the bleeding of nanoparticles.\n\tNOTE: The embryos must not move during imaging. Any movement will lead to blurry images and the inability to overlap images from different channels.\nAdd fresh fish water to the embryos immediately after imaging and return them to the incubator. Repeat steps 5.2-5.4 to image the embryos at different time points.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}