{
  "id": 3247,
  "origin_website": "Cell",
  "title": "Studying naturalistic human communication using dual-EEG and audio-visual recordings",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nParticipants recruitment\nTiming: 1–3 months (for steps 1 to 2)\n    \n      This section describes important aspects to consider for participant\n      recruitment.\n    \n        Determine in- and exclusion criteria for participation:\n        \nDetermine the age range of interest.\n            Epilepsy should be an exclusion criterion, based on EEG safety\n            guidelines.\n          \n            Determine language of interest.\n            \n                Determine the proficiency level of interest: for instance,\n                second-language learners or proficient speakers.\n                \nNote: For the mentioned\n                  studies, only native speakers were selected, since this\n                  selection option is available in our recruitment database.\n                  Alternatively, LexTALE21[href=https://www.wicell.org#bib21] is a\n                  standardized test of vocabulary knowledge for proficient\n                  speakers of English as a second language and it could be used\n                  to evaluate participants’ proficiency. However, it is only\n                  available for a small set of languages (English, German and\n                  Dutch).\n                \n            Determine potential disorders, which could affect your population\n            results, such as hearing and sight abilities, neurological and\n            language disorders.\n          \n            Determine if the degree of relationship between conversational\n            partners is an important factor for the research question.\n            \nNote: Previous research suggested\n              that inter-brain synchrony is influenced by social closeness.8[href=https://www.wicell.org#bib8],22[href=https://www.wicell.org#bib22] If you would like\n              to investigate inter-brain synchrony under specific conditions,\n              you should first exclude potential effects driven by social\n              closeness.\n            \n                If it is an important factor: determine the desired degree of\n                relationship (e.g., strangers, acquaintances, friends, family,\n                partners) or treat it as a variable in the analyses by asking\n                participants to fill in a questionnaire.\n              \n        Participant recruitment:\n        \n            Determine the desired sample size.\n            \n                The sample size can be calculated with a power analysis or it\n                can be based on previous similar research.\n                \nNote: For inter-brain\n                  analyses, keep in mind that each dyad is treated as a unit of\n                  observation and, as a consequence, a larger sample size is\n                  needed. Namely, if the common sample size for a standard EEG",
    "study is 30 participants, the sample size for a dual-EEG\n                  experiment will need to be 30 dyads (60 participants)\n                  to result in similar power.\n                \n            Determine if participants will be coupled by the experimenter and/or\n            if they can choose their own experimental partner.\n            \nNote: If you plan to only include\n              participants with a specific degree of relationship (e.g. friends\n              or partners), the dyad will be already formed and recruited\n              directly. However, if you plan to include also strangers, the\n              experimenter will need to couple them to form a dyad. Consider\n              that recruiting dyads can take longer than recruiting single\n              participants and this could also affect the procedure: opening the\n              experiment to both strangers and acquaintances may speed up the\n              recruitment process. For the experiments on which the current\n              protocol is based, both strangers and acquaintances were included,\n              so they were either matched by the experimenter or one participant\n              would bring along the second participant (e.g. their partner, a\n              friend or a family member).\n            \n                If participants are coupled by the experimenter: determine if\n                the process will be randomized or determine any relevant\n                criteria for coupling (e.g., age difference, gender).\n              \n            Develop a specific procedure for participant recruitment:\n            \n                Prepare standard e-mails to explain the study procedure and\n                risks to interested participants.\n              \n                Keep track of the recruitment process, including nr. of tested\n                participants, nr. of interested participants, nr. of excluded\n                participants, and nr. of participants to re-contact.\n              \nExperiment room preparation\nTiming: 45 min (for steps 3 to 7)\n    \n      This section describes the preparation of the setup for data collection,\n      including dual-EEG electrode placement.\n    \n        Prepare the experiment room:\n        \nTurn on the recording and the stimulation computers.\n            Turn on the cameras, and check that the SD cards are inside and that\n            the cameras are working well.\n          \n            Referential communication task:\n            \nSwitch the microphone on.",
    "Adjust the volume knob of the audio mixer to the desired level\n                (Figure 5[href=https://www.wicell.org#fig5]).\n              \n            Check the condition order, the speaker-listener order, and the\n            speaker-listener position order for the dyad.\n          \n            Open BrainVision Recorder on the recording computer.\n            \nOpen the experiment workspace.\n            Open the program Presentation on the stimulation computer.\n            \n                Turn off the network connection to improve the precision of the\n                timing of stimuli presentation.\n              \n                Open the experiment file and check that all the settings are\n                correct.\n              \n        Prepare the EEG supplies:\n        \n            Fill conductive gel in two syringes and attach the needles to them.\n          \n            Prepare scrub (NuPrep), alcohol pads, electrode stickers, cotton\n            pads, white tape (to keep electrodes sticking to the skin), and\n            measuring tape for head circumference.\n          \nInsert charged batteries in the two control boxes.\nPlug a power pack into each amplifier.\n            Check and change desired target impedance on the ActiCAP Control\n            software.\n            \n                Connect one ActiCAP control box (with charged batteries) to the\n                recording computer using the provided USB cable.\n              \n                Open the ActiCAP Control software and select Impedance check (Figure 8[href=https://www.wicell.org#fig8]).\n                \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fig8.jpg\n                      Figure 8. Selection of the target impedances on the\n                      ActiCAP Control software\n                    \nClick on Impedance ON.\n                Select the threshold for ‘Good level’ impedances (e.g.,\n                20 kOhm).\n              \n                Select after how long the impedance check will time out on the\n                control box (e.g., 5 min).\n              \n        Meet participants:\n        \nAsk them to turn off their phones.\n            Ask them to read the informed consent and give them the opportunity\n            to ask questions.\n          \n            Give them the opportunity to give their consent to participation and\n            data usage and storage by signing the consent form.\n          \n        Cap and electrode placement. The steps described below need to be\n        performed separately for each participant.\n        \nNote: Preparing one participant for\n          EEG takes about 25 minutes with 32 electrodes, therefore we suggest\n          having two experimenters available to speed up the process: each",
    "experimenter prepares one participant.\n        \n            Place the reference electrodes: depending on your research question,\n            you may select different reference channels. We used mastoid\n            channels to obtain a symmetrical signal on the scalp and to properly\n            capture activity over the midline.\n            \n                Use the reference electrode and choose another electrode from\n                the set (e.g., TP10) to be placed on the left and right\n                mastoids. We suggest to re-reference the data to both mastoids\n                during pre-processing, to avoid a hemispheric bias in the\n                recorded activity.\n              \nClean the skin with scrub and alcohol pads.\nDry the skin and attach the electrode with a sticker.\n                Fill the electrode with conductive gel and distribute it well.\n                \nNote: An alternative to\n                  placing the mastoid electrodes directly on the skin is to\n                  insert them in the EEG cap at positions TP9 and TP10.\n                  Attaching the mastoid electrode directly to the skin has the\n                  advantage of a better and more stable reference signal. The\n                  reference position can also be modified depending on your\n                  research question.\n                \n            Measure the participant’s head from nasion (i.e., nasal bridge) to\n            inion (i.e., bony protuberance in the occipital bone) and select the\n            right cap size (e.g., 54 cm/56 cm/58 cm/60 cm, for ActiCAP).\n          \n            Place the cap on the participant’s head and attach the chin strap:\n            it should not be too tight nor too loose.\n          \n            Center the cap over the head using the measuring tape: the electrode\n            Cz must be in the middle between nasion and inion and in the middle\n            between left and right ear tops.\n          \n            Insert the electrodes in the (green) holders of the EEG cap (for\n            ActiCap with 32 electrodes).\n          \n            For each participant, connect the electrode set cable and the\n            reference and ground cables to the control box.\n          \n            Reduce impedances:\n            \n                Start with the reference and the ground electrode: fill the\n                electrode with gel.",
    "Check the impedances by clicking on the symbol Z on the\n                control box (for ActiCAP active electrodes) or by clicking the\n                symbol\n                imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fx4.jpg\n                on BrainVision Recorder (for passive electrodes).\n              \n                In either case, distribute the gel with a circular motion of the\n                needle until the electrode light (active electrodes) or color\n                (passive electrodes) becomes green (below 5kohm for passive\n                electrodes and below 20kohm for active electrodes) (see\n                problem 5[href=https://www.wicell.org#sec6.9] in the\n                troubleshooting[href=https://www.wicell.org#troubleshooting] section).\n                However, do not insert excessive amount of gel to avoid bridges\n                between electrodes.\n              \nRepeat the same procedure for all the electrodes.\n                Once the electrode lights are all green, click again on the\n                symbol Z on the control box or on the symbol on\n                BrainVision Recorder to interrupt the impedance check.\n              \nStructured dialogue: place EOG electrodes to record eye\n            movements (Figure 9[href=https://www.wicell.org#fig9]):\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fig9.jpg\n                  Figure 9. EOG and EMG electrodes placement for the recording\n                  of eye (orange) and mouth (purple) movements, respectively\n                \nClean the skin with the scrub and alcohol.\n                Dry the skin and place two electrodes above and below one eye\n                (for vertical eye movements) and two electrodes near the outer\n                canthus of each eye (for horizontal eye movements).13[href=https://www.wicell.org#bib13],23[href=https://www.wicell.org#bib23]\n                Fill the electrode with gel and distribute it until the desired\n                impedance is reached.\n              \nReferential communication task: place EMG electrodes to\n            record mouth movements (Figure 9[href=https://www.wicell.org#fig9]):\n            \nRepeat the same procedure for the EMG electrodes.\n                Place one electrode near the orbicularis oris superior muscle\n                and one near the orbicularis oris inferior muscle, both on the\n                same side of the mouth.\n              \n                Place a third electrode on the right cheek.24[href=https://www.wicell.org#bib24]\n        Prepare the setup to start the recording:\n        \n            Switch on the two amplifiers and connect the amplifier connection\n            cables to the respective control box.\n          \n            Ask the participant to stay steady and relaxed, click on the symbol\n            imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fx5.jpg",
    "on BrainVision to display the electrodes’ signal, and check whether\n            the signal is clear and unperturbed.\n          \nReferential communication task: place the headphones on top\n            of the EEG cap for each participant.\n          \n            Check the view from each camera: one should point at participant A,\n            one at participant B and one should include both participants.\n          \nData collection\nTiming: 1 h/dyad (for steps 8 to 15)\n    \n      This section describes the experiment procedure to collect dual-EEG and\n      audio-visual data.\n    \n        Give participants instructions:\n        \n            Explain what they need to do during the experiment (e.g., have a\n            free conversation, plan an event, play a game) and the rules of the\n            task (e.g., what they are and are not allowed to do).\n          \n            Explain that they should minimize laughing and moving their bodies\n            rhythmically, as to not distort the EEG signal. For participants\n            with previous EEG experience it may be easier to limit their body\n            movements throughout the experiment.\n          \n        Start the experiment:\n        \n            First, start the video recording on each camera and check that both\n            the video and audio signals are being recorded correctly.\n            \n                You can check this directly on the camera or on the audio mixer:\n                check if the audio signal changes whenever participants say\n                something.\n              \n            Start the recording on BrainVision Recorder by clicking on the\n            symbol\n            imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fx6.jpg.\n            \n                Save the recording with an anonymized acronym name, including\n                dyad code, session and condition (e.g.,\n                PPdyadnumber_conditioncode).\n              \n                Check that the EEG is being recorded: on the BrainVision\n                Recorder window, below the EEG signal, you should see the words:\n                imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fx7.jpg.\n              \nInform participants that the experiment is about to start.\n            Start the experiment on Presentation:\n            \n                On the stimulation computer, click on the button ‘Run’ on\n                the Main section.\n              \n                In the pop-up window click on the button ‘Run scenario’.\nInsert the block code and press enter.\nCritical: Check that the triggers are",
    "sent correctly to the EEG recording.\n    \n        During the experiment\n        \n            Check the EEG signal:\n            \n                If the signal of one or multiple electrodes looks noisy, write\n                it down in the data collection logbook and, if possible, further\n                lower the impedances during experiment breaks.\n              \n            Check participants’ performance:\n            \n                If participants are not performing the task correctly, inform\n                them and, if necessary, repeat or clarify the instructions.\n                Remember to pause the experiment before interrupting the\n                participants.\n              \n            Write down in the data collection logbook any other issues or\n            troubles.\n          \n        At the end of the block\n        \n            If you specified the length of the block in Presentation, you will\n            see a black screen once the time has run out. If you would like to\n            stop the experiment before the time has run out, click on the space\n            bar on the stimulation computer.\n          \n            Stop the recordings:\n            \n                Stop the EEG recording on BrainVision Recorder by clicking on\n                imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2813-Fx8.jpg.\n              \nStop the video recording on each camera.\nRepeat the same procedure for each block of the experiment.\n        After the experiment\n        \n            Collect additional data of interest (e.g., behavioral\n            questionnaires)\n            \n                Ask participants to fill in the questionnaire truthfully and\n                give them specific instructions.\n              \n                When the participants finalized the questionnaire, explain to\n                them the goal of the study or give them a debriefing form.\n              \n                If you recorded sensitive data and would like to use it in a\n                (scientific) publication and/or at conferences, ask participants\n                to sign a consent form where they inform you how you can use\n                their data. Make sure to check the latest privacy regulations\n                for participants testing in your country on how to handle the\n                data and the participants’ consent.\n              \n            Remove electrodes and caps:\n            \n                Remove facial and mastoid electrodes from the participants’ skin\n                and take off the caps with the electrodes.\n              \n            Restore the experiment room to its initial state:",
    "Switch on the network connection for the stimulation computer.\n              \n                Switch off the amplifiers and unplug the cables connecting power\n                packs and amplifiers.\n              \nCharge the power packs.\n                Remove the batteries from the control boxes and charge them.\n              \nFollow the cleaning procedure of your EEG laboratory.\n        Saving the data:\n        \n            Check that the EEG recordings were saved correctly.\n            \n                The EEG recording from BrainVision Recorder consists of three\n                files: the header file (.vhdr), the marker file (.vmrk) and the\n                data file (.eeg). Check that the marker file contains the\n                triggers information in the desired order.\n              \nSave the questionnaire data with an anonymized acronym.\n            Remove the SD cards from the camera and save the videos using an\n            anonymized acronym.\n            \n                Check that the video and audio have been recorded correctly\n                (e.g., you can see and hear both participants well).\n              \n                Once the videos have been backed up, erase the video recordings\n                from the SD cards and insert the cards back into the cameras.\n              \nNote: Check your institute’s guidelines\n      regarding the anonymization of the files. In some cases, it is acceptable\n      to use the same acronym for different files, in other cases it is not\n      acceptable.\n    \n        Audio-visual data pre-processing:\n        \n            If you plan to analyze the EEG data in relation to the audio-visual\n            data, make sure to trim the audio and the video data so that they\n            start at the EEG recording start cue."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}