{
  "id": 9044,
  "origin_website": "Jove",
  "title": "Patch Clamp Recording of Starburst Amacrine Cells in a Flat-mount Preparation of Deafferentated Mouse Retina",
  "procedures": [
    "Ethical approval – procedures involving animal subjects were conducted in accordance with the rules and regulations of the National Institutes of Health guidelines for research animals, as approved by the institutional animal care and use committee of Baylor College of Medicine.\n1. External and Internal Solutions\nUse mammalian Ringer's solution during retina dissection and as the external solution in subsequent electrophysiological recording. Prepare the mammalian Ringer's solution from 10x stock solution (without calcium) on the day of recording, and add CaCl2 drop-wise after 15 min of carbogenation (95% O2 and 5% CO2). The final 1x solution contains (in mM): 120 NaCl, 5 KCl, 25 NaHCO3, 0.8 Na2HPO4, 0.1 NaH2PO4, 2 CaCl2, 1 MgSO4 and 10 D-glucose.\nUse two internal solutions to characterize SAC oscillations. Test the usefulness of prepared solutions in prolonged whole-cell patch clamp recordings on adult mouse RGCs and store the verified batches in 500 µl aliquots at -20 °C until use.\n\t\nFor recording membrane potential oscillation, use a potassium-based internal solution that contains (in mM): 125 K-gluconate, 8 NaCl, 4 ATP-Mg, 0.5 Li-GTP, 5 EGTA, 10 HEPES and 0.2% biocytin (w/v). Adjust pH to 7.3 with KOH.\nFor recording excitatory and inhibitory postsynaptic currents, use a cesium-based internal solution that contains (in mM): 100 Cs-methanesulfonate, 8 NaCl, 4 ATP-Mg, 0.5 Li-GTP, 5 EGTA, 10 HEPES and 0.2% biocytin (w/v). Adjust pH to 7.3 with CsOH.\n2. Preparation for the Day of Recording\nTo prepare a nitrocellulose membrane with open holes, manually punch the membrane with a customized puncher made from a blunted 16 G syringe needle and flatten the membrane between two clean glass plates. For a whole-mount retina, make a central hole 0.2 mm in diameter and surround it by 4 larger holes that are 1-1.2 mm in diameter.",
    "To make a customized backfill filament for loading internal solution into electrodes, melt a 10 µl pipette tip in the middle and gently lengthen the melted portion until it cools and hardens. Just prior to use, use a clean razor blade to trim the filament until it is slightly longer than the patch pipettes.\nPull patch pipettes in a programmable puller from borosilicate glass tube with an internal filament. Manufacture the micropipettes on the day of experiment and use them immediately.\n\tNOTE: For recording SACs, we use the following puller setting: heat: 484; pull: 0; velocity: 25; delay time: 1; pressure: 400 and a ramp value of 462. The O.D. and I.D. of the borosilicate tubes are 1.65 mm and 1.0 mm, respectively. Resistance of the pipettes is 10-14 MΩ.\nOne hr before tissue harvest, thaw a tube of internal solution by shaking it on a vortex for >30 min.\n3. Retina Dissection\nAnesthetize the animal by 4% isoflurane in oxygen until the animal loses responsiveness to a toe pinch. Sacrifice the animal by cervical dislocation.\nCut both eyeballs off the optic nerves at 1-2 mm away from the optic nerve heads with straight-pointed iris scissors.\nRoll the eyeballs on a clean paper towel to remove blood and then immerse them in carbogenated mammalian Ringer's solution. Punch a hole on the limbus with a 23 G needle and bisect the eyeballs by cutting along the limbus with micro-scissors. Remove the cornea and lens using fine forceps.\n\t\nFor retinal whole-mount, gently peel the entire retina off the pigmented epithelium with fine forceps and make four 1.5-2 mm orthogonal cuts from the edge toward the optic nerve head.",
    "Immerse a punched nitrocellulose membrane into the dish and gently drag the retina over it with the GCL side up. Place the optic nerve head into the center hole when preparing a whole-mount retina. Transfer the membrane with the retina into another clean dish. Gently flatten the retina with a fine paint brush to look like a Maltese cross and lay all four edges over the holes.\n\t\nIf a fraction of the retina is to be examined at a time, cut each eyecup prepared from Step 3.3 into 3-4 pieces with a razor blade with the pigmented epithelium remains attached. Protect the unused pieces from light in carbogenated external solution and use them within 12 hr.\nBlot the nitrocellulose membrane with a piece of dry filter paper and remove the vitreous and inner limiting membrane with forceps and a paint brush.\nMake sure that all retinal edges are fully attached to the membrane before transferring the assembly into the recording chamber with a sealed glass cover slip at the bottom. Secure the membrane with vacuum grease to the cover slip and rehydrate the retina with the external solution. Be careful not to trap any air bubbles underneath the assembly.\nSet the chamber onto the stage of an upright microscope. Perfuse the chamber with warm (34-35 °C) carbogenated external solution at a rate of ~3 ml per min.\nExamine the retina under a 10x objective lens first, and then use a 60x water-immersion lens to see GCL and INL neurons under differential interference contrast (DIC) and/or epifluorescence. To visualize tdTomato-expressing SACs, use a white LED light source in combination with an excitation filter of 554 nm and an emission filter of 581 nm.\n4. Whole-cell Patch Clamp Recording from Flat-mount Retina",
    "Filter the internal solution through a syringe filter into the custom backfill filament.\nInsert the filament into a freshly pulled micropipette and dispense the internal solution near the tip until the solution covers the silver electrode wire for >5 mm. Fasten the micropipette onto an electrode holder with a suction pole, through which pressure inside the electrode can be adjusted by pushing or pulling the plunger of a tube-connected 10 ml plastic syringe.\nFind the pipette under the objective and bring it down to ~100 µm above the retina. Under the current-follower mode (I = 0), use DC offset to zero the standing DC voltage signal. Measure the pipette resistance under the current clamp (IClamp) mode by injecting fixed amplitude square wave currents through the pipette while it is in the bath and neutralize the difference by turning the Raccess knob. Use the reading on the Raccess knob to calculate pipette resistance by the Ohm's law.\nSlowly bring the electrode to ~10 µm above the retina. Apply positive pressure to the electrode. Watch the reflection change near the pipette tip as it approaches the retina. Quickly but gently force the pipette into the GCL and reduce the positive pressure immediately.\nMove the pipette toward a labeled neuron. Avoid contacting other neurons, blood vessels and endfeet of Muller cells. Apply more positive pressure if needed to prevent electrode clogging.\nPosition the pipette tip near the midline of a labeled neuron until a dimple is visible. Release the positive pressure and allow the plasma membrane to bounce back onto the pipette tip.",
    "Apply 20 to 120 pA negative currents to the pipette to help the formation of a giga-ohm seal. Apply a gentle suction if necessary to pull the plasma membrane into the pipette. Wait 5 min after seal formation to rupture the cell membrane. This allows the spilled internal solution to be cleared by superfusion. Rupture the membrane by a gentle suction.\nAfter the membrane rupture and while in the current clamp mode, switch on bridge balance and adjust it using the Raccess knob.\n\tNOTE: For a small cell like the SAC, only slight adjustment is needed, if any. Alternatively, record excitatory and inhibitory postsynaptic currents in the voltage clamp mode (VClamp) by holding the cell at reversal potentials of chloride (around -75 mV) and glutamate (around 0 mV), respectively. Check and adjust pipette position if needed to accommodate occasional retina and/or micromanipulator drift.\nTo record membrane potential or current change before, during and after pharmacological treatment, prepare synaptic blockers (e.g., CNQX, AP5, picrotoxin, tubocurarine, etc.) and channel modulators (e.g., flupirtine, dopamine, meclofenamic acid, etc.) fresh on the day of experiment from frozen stocks. Dilute the drugs with carbogenated Ringer's solution. Apply them in a batch manner through perfusion.\nAfter recording, gently remove the pipette from the soma. Transfer the assembly from the chamber to a clean dish. Detach and re-attach the retina onto another flattened nitrocellulose membrane without punched holes to ensure retina flatness during fixation.",
    "Fix the retina by immersing it in 4% paraformaldehyde for 30 min at RT. Remove the retina from the nitrocellulose membrane and rinse it extensively with 1x PBS. Reveal the morphology of the recorded cells by O/N staining with dye-conjugated streptavidin diluted in 1x PBS with 0.4% Triton X-100 at 4 °C14. Mount the retina in antifade medium and observe recorded cells using a scanning confocal microscope.\n\tNOTE: Procedures involving paraformaldehyde, which is volatile and toxic, should be conducted in a draft chamber for safety.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}