{
  "id": 4412,
  "origin_website": "Bio",
  "title": "Plant Sequence Capture Optimised for Illumina Sequencing",
  "procedures": [
    "Concentration of genomic DNAThe genomic DNA should be isolated using standard methods for barley (e.g. Stein et al., 2001). Dissolve DNA in TE (pH 8.0). It is important to make sure that the genomic DNA is completely dissolved. Any insoluble matter should be removed by centrifugation (16,000 x g, 10 min, RT). The soluble supernatant is transferred into a fresh tube for fragmentation.Determine precisely the concentration of genomic DNA [dissolved in TE (pH 8.0)] using a system specific for dsDNA. The basic quantification protocol is described here for the Qubit 2.0 fluorometer. Any other picogreen-based assays may be used as well. Depending on the DNA starting concentration use the HS Assay (0.2 ng– 100 ng) or the BR Assay (2 ng-1,000 ng), respectively. For the Qubit device 1 µl genomic DNA is diluted with 199 µl Working Solution (1 µl dye/200 µl buffer, equilibrated to RT) in Qubit assay tubes.Dilute in Qubit assay tubes 10 µl of the two standards with 190 µl Working Solution.Vortex Qubit assay tubes, incubate for 2 min and measure the DNA concentration. Note: To ensure reproducibility of the measurements make 3 independent quantifications.Using TE (pH 8.0) adjust the DNA concentration to 1 µg in a total volume of 53 µl and store the sample on ice for fragmentation.DNA fragmentationFor DNA fragmentation a Covaris S220 device is employed. The instrument generates adaptive focused acoustic energy resulting in mechanical disruption of DNA. Operate the instrument according to the manufacturer instructions. Fill the water bath of the Covaris S220 according to the water level indicator on the front of the water bath (“FILL” column) to the “12” level. Use deionized or distilled water. The water bath must be degassed and cooled (7 °C) for proper operation of the device. Preparation of the instrument will take about 40 min.",
    "Use the following fragmentation parameters (Mascher et al., 2013): 175 W ultrasonic power 10% duty factor200 cycles per burst and 50 sec treatment, 30 sec pause followed by additional 50 sec treatment.Pipette the genomic DNA (1 µg in 53 µl) into the Covaris microTUBE (precooled on ice). Insert the tube into the holder and fragment the DNA.  Transfer the fragmented DNA into a fresh 96-well plate. The DNA can be stored at -20 °C or used for subsequent capture library construction.Analyse the fragments (1 µl) electrophoretically with an Agilent 2100 Bioanalyzer (High Sensitivity DNA Chip). The size peak should be between 200 and 300 bp (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706184620_9978.jpgFigure 1. Typical size profile of fragmented genomic DNA. Following fragmentation with the Covaris S220 device, the genomic DNA (1 µl) was size-fractionated using the Agilent 2100 Bioanalyzer. The lower (LM) and upper marker peaks (UM) are indicated. FU: Fluorescence unit.Options for Capture library constructionThe capture libraries can be made using:Illumina TruSeq DNA [Low-Throughput (LT) Protocol; gel method] TruSeq DNA PCR-free sample preparation kits following the manufacturer instructions (Illumina, Inc., San Diego, CA). The final library is eluted in 30 µl Resuspension Buffer. Notes: For sequencing pooled captured Illumina libraries the appropriate index adapters must be selected according to the “Pooling Guidelines” (e.g. see Reference 2).If option a. or b. is chosen, prepare the libraries according to the manufacturer`s instructions, skip steps D to G and continue with step H. “Gel-purification of the library”. Alternatively, the library can be prepared based on a protocol for DNA Illumina multiplex (IM) libraries (Meyer and Kircher, 2010). This approach is transparent and avoids expensive components such as sequencing library construction kits and commercial reagents for Solid-Phase Reversible Immobilization (SPRI). Flexibility in experimental design is given by a large number of possible indices.",
    "As an example 33 indices for the generation of sequencing libraries are provided (Table 1 in Supplementary Material). Rules for pooling indices are described elsewhere (Meyer and Kircher, 2010). If deeper multiplexing is required, additional index sets with the corresponding blocking oligos can be created (Meyer and Kircher, 2010). Libraries can be prepared in single tubes as well as in 96-well plates using multichannel pipettes. Steps D to G describe the construction of DNA Illumina multiplex (IM) libraries using 96-well plates.Blunt-end repairNote: Prepare the adapter mix P57 required for adapter ligation. A purified PCR product [Test fragment for DNA Illumina multiplex (IM) libraries; see Recipies] should be included as a positive control. EBT buffer serves as a negative control. The controls are added to empty wells and are subjected to all manipulations during library preparation, thereby permitting to monitor the success of the enzymatic reactions. Prepare a master mix from the following reagents (volume per sample). Add the components in the order indicated:table:",
    "﻿0,1\nWater,7.12 µl\n10x Buffer Tango,7.00 µl\ndNTPs (25 nM each),0.28 µl\nATP (100 mM),0.70 µl\nT4 polynucleotide kinase (10 U/µl),3.50 µl\nT4 DNA polymerase (5 U/µl),1.40 µl",
    "Mix the components by flicking the tube gently. Caution: Vortexing may inactivate the enzymes.Add 20 µl of the master mix to the DNA (50 µl). Mix gently by pipetting.Seal the plate and incubate the samples (70 µl) in a PCR-cycler 15 min at 25 °C, 5 min at 12 °C and keep at 4 °C.Immediately proceed to the sample clean-up by adding 126 µl MagNA beads (equilibrated to RT and vortexed). The suspension is mixed to homogeneity by pipetting (5x) and incubated for 5 min at RT.The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the beads carrying the DNA from the solution. The supernatant is removed completely using a pipette while the 96-well plate remains in the MPC96.Leave the plate in the MPC96 and wash the beads with 150 µl freshly prepared 70% ethanol. Wait for 1 min and remove the supernatant completely using a pipette.Repeat step D7 once. Air-dry the beads completely for ~ 30 min while the open plate is located in the MPC96.Remove 96-well plate from MPC96 and elute the DNA in 22 µl EBT. Pipette up and down (10x) to resuspend the beads. Incubate for 1 min (RT). Take care that the liquid is located in the bottom of the well. If this is not the case, close the plate with adhesive tape and spin down all droplets using a centrifuge with a swing-out rotor (1,000 x g, 2 min, RT).The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the eluted DNA from the beads. 20 µl DNA are transferred into a new well. Subsequent reactions are not impeded by small carryover of beads.Sealed 96-well plates can be stored at -20 °C.",
    "Adapter ligationSet up a master mix from the following reagents (volume per sample). Add the components in the order indicated:table:",
    "﻿0,1\nWater,10.0 µl\n10x T4 DNA ligase buffer,4.0 µl\nPEG 4000 (50%),4.0 µl\nAdapter mix P57 (100 µM each),1.0 µl\nT4 DNA ligase (5 U/µl),1.0 µl",
    "Note: If a white precipitate is observed, incubate the 10x T4 DNA ligase buffer 5 min at 37 °C. Vortex until the buffer is clear. The master mix should be vortexed after the addition of the viscous PEG 4000 (50%) solution. After the final addition of the T4 DNA ligase the master mix should be mixed gently by flicking the tube. Caution: Vortexing may inactivate the enzyme.Add 20 µl of the master mix to the DNA (20 µl). Mix gently by pipetting.Seal the plate and incubate the samples (40 µl) in a PCR-cycler 30 min at 22 °C and keep at 8 °C.Immediately proceed to the sample clean-up by adding 72 µl MagNA beads (equilibrated to RT and vortexed). The suspension is mixed to homogeneity by pipetting (5x) and incubated for 5 min at RT.The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the beads carrying the DNA from the solution. The supernatant is removed completely using a pipette while the 96-well plate remains in the MPC96.Leave the plate in the MPC96 and wash the beads with 150 µl freshly prepared 70% ethanol. Wait for 1 min and remove the supernatant completely using a pipette.Repeat step E7 once. Air-dry the beads completely for ~ 30 min while the open plate is located in the MPC96.Remove 96-well plate from MPC96 and elute the DNA in 22 µl EBT. Pipette up and down (10x) to resuspend the beads. Incubate for 1 min (RT). Take care that the liquid is located in the bottom of the well. If this is not the case, close the plate with adhesive tape and spin down all droplets using a centrifuge with a swing-out rotor (1,000 x g, 2 min, RT).",
    "The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the eluted DNA from the beads. 20 µl DNA are transferred into a new well. Subsequent reactions are not impeded by small carryover of beads.Sealed 96-well plates can be stored at -20 °C.Adapter fill-in Prepare a master mix from the following reagents (volume per sample). Add the components in the order indicated:table:",
    "﻿0,1\nWater,14.1 µl\n10x ThermoPol reaction buffer,4.0 µl\ndNTPs (25 mM each),0.4 µl\n\"Bst polymerase, large fragment (8 U/µl)\",1.5 µl",
    "Note: After the final addition of the enzyme, the master mix should be mixed by flicking the tube gently.  Caution: Vortexing may inactivate the enzyme.Add 20 µl of the master mix to the DNA (20 µl). Mix gently by pipetting.Seal the plate and incubate the samples (40 µl) in a PCR-cycler 20 min at 37 °C and keep at 8 °C.Immediately proceed to the sample clean-up by adding 72 µl MagNA beads (equilibrated to RT and vortexed). The suspension is mixed to homogeneity by pipetting (5x) and incubated for 5 min at RT.The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the beads carrying the DNA from the solution. The supernatant is removed completely using a pipette while the 96-well plate remains in the MPC96.Leave the plate in the MPC96 and wash the beads with 150 µl freshly prepared 70% ethanol. Wait for 1 min and remove the supernatant completely using a pipette.Repeat step F7 once. Air-dry the beads completely for ~ 30 min while the open plate is located in the MPC96.Remove 96-well plate from MPC96 and elute the DNA in 22 µl EBT. Pipette up and down (10x) to resuspend the beads. Incubate for 1 min (RT). Take care that the liquid is located in the bottom of the well. If this is not the case, close the plate with adhesive tape and spin down all droplets using a centrifuge with a swing-out rotor (1,000 x g, 2 min, RT).The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the eluted DNA from the beads. 20 µl adapter ligated DNA are transferred into a new well. Subsequent reactions are not impeded by small carryover of beads.",
    "Sealed 96-well plates can be stored at -20 °C.The performance of the enzymatic reactions should be monitored by separating 20 µl of the positive and negative controls next to the initial purified PCR-product with A-overhanging ends and a DNA ladder using a 2% agarose gel (Figure 2). The size of the ethidium bromide stained positive control (adapter ligated test fragment) should be 67 bp larger than the initial test fragment. Determine the concentration of the adapter ligated DNA using the Qubit HS assay. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706165224_5198.jpgFigure 2. Controls for the adapter ligation. Test fragment (T; 750 ng) with A-overhanging ends was size-fractionated along with the test fragment provided with adapters (positive control; P, 20 µl) and a negative control (N, 20 µl). In the negative control the test fragment was replaced by EBT buffer. The samples were separated using standard agarose (2%) electrophoresis and stained with ethidium bromide. L: DNA ladder. The size of the standards is indicated (bp).Indexing PCR and reaction clean-up of the library Add 8 µl containing 20 - 100 ng adapter ligated DNA (template) to a new well in the PCR plate.Note: It is sufficient to use part of the adapter ligated DNA for the PCR. The remaining material can serve as a back-up or can be labelled later with a different index (if required). Index selection rules for pooling and additional index sets are described elsewhere (Meyer and Kircher, 2010).Add 1.4 µl of the appropriate (index) primer (10 µM) from the Index primer 7001 to 7033 series (Table 1 in Supplementary Material).Prepare a master mix from the following reagents (volume per sample). Add the components in the order indicated and mix:table:",
    "﻿0,1\nWater,28.7 µl\n5x Phusion HF buffer,10.0 µl\ndNTPs (25 mM each),0.4 µl\nPrimer IS4 (10 µM; Table 1 in Supplementary Material),1.0 µl\nPhusion Hot Start Flex DNA polymerase (2 U/µl),0.5 µl\nDistribute 40.6 µl of the master mix into the wells containing the template and Index primer (50 µl reaction), mix by pipetting gently and cover the plate with an adhesive tape for PCR.Perform PCR using the following conditions:table:\n﻿0,1,2\n-Denaturation,98 °C,30 sec\n12 cycles of:table:\n﻿0,1,2\n-Denaturation,98 °C,10 sec\n-Annealing,60 °C,20 sec\n-Elongation,72 °C,20 sec\nAnd a final extension:table:\n﻿0,1,2\n-Elongation,72 °C,10 min",
    "The reactions are kept at 8 °C.Proceed to the sample clean-up by adding 90 µl MagNA beads (equilibrated to RT and vortexed). The suspension is mixed to homogeneity by pipetting (5x up and down) and incubated for 5 min at RT.The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the beads carrying the DNA from the solution. The supernatant is removed completely using a pipette while the 96-well plate remains in the MPC96.Leave the plate in the MPC96 and wash the beads with 150 µl freshly prepared 70% ethanol. Wait for 1 min and remove the supernatant completely using a pipette.Repeat step G9 once. Air-dry the beads completely for ~ 30 min while the open plate is located in the MPC96.Remove 96-well plate from MPC96 and elute the DNA in 27 µl EBT. Pipette up and down (10 x) to resuspend the beads. Incubate for 1 min (RT). Take care that the liquid is located in the bottom of the well. If this is not the case, close the plate with adhesive tape and spin down all droplets using a centrifuge with a swing-out rotor (1,000 x g, 2 min, RT).The 96-well plate is placed on a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 5 min to separate the eluted DNA from the beads. 25 µl indexed library DNA are transferred into a new well, and sealed 96-well plates can be stored at -20 °C.Quality and quantity of randomly selected PCR products is controlled by standard agarose gel electrophoresis (Figure 3). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706165250_6342.jpgFigure 3. Products of the indexing PCR reactions. PCR products from randomly selected samples (3 µl, step G15) were size-separated using standard agarose (2 %) gel electrophoresis and stained with ethidium bromide. L: GeneRuler 50 bp DNA ladder.",
    "The size of the ladder is indicated (bp).Gel-purification of the libraryNote: The gel-purification is required for all types of libraries in order to make sure that appropriately sized DNA fragments are used for the pre-capture library amplification. DNA is revealed in agarose gels using SYBR-Gold dye and visible blue light emitted from a “Dark reader” transilluminator as the excitation source.  Caution: Do not use ethidium bromide stained gels. Ultra-violett radiation used for excitation of ethidium bromide will damage the DNA. Prepare a 2% agarose gel: Melt 3 g UltraPure Agarose in 150 ml 1x TAE using an Erlenmeyer flask (500 ml) and a microwave. Make sure that the agarose is completely dissolved and cool down the solution to 60 °C. Add 15 µl SYBR-Gold, swirl gently without forming bubbles and cast the gel using standard equipment (15 cm x 15 cm tray, comb etc.). Protect the gel from light by covering with aluminium foil. Let the gel solidify.Dilute the GeneRuler 50 bp DNA ladder: Take 250 ng ladder, 4 µl 6x loading dye and fill up the volume to 24 µl using EBT (ladder for one lane). Add 5 µl 6x loading dye to the indexed library DNA (25 µl), mix gently. Remove the comb and place the gel into the electrophoresis chamber.Fill the tank with 1x TAE until the gel is covered with buffer.Load each library in two adjacent slots of the agarose gel (2x 15 µl). Load the diluted ladder between two different libraries to prevent contaminations by spill-over.Perform electrophoresis for 2 h with 4 V/cm (distance between anode and cathode). Protect the gel from light during electrophoresis.Reveal the DNA using a “Dark reader transilluminator” and use a clean scalpel to excise the region of interest (320 to 430 bp). A typical result is shown in Figure 4.",
    "Place the agarose block into a clean 2 ml (or 5 ml) tube. Determine the volume of the block using a balance (e.g. 240 mg corresponds to 240 µl).Purify the DNA using the Qiagen MinElute kit (spin column) essentially as described by the manufacturer.Add 6 volumes QG buffer to the block (e.g. 240 µl block: 1,440 µl QC buffer).Dissolve the gel (RT) completely under gentle agitation.Add one volume isopropanol (e.g. 240 µl block: 240 µl isopropanol) and mix by inverting (5x).Apply 700 µl of the mixture to a MinElute column placed in a collection tube and spin (16,000 x g, 1 min).Discard the flow-through.Stepwise apply the remainder to the column by repeating steps H14-15.Add 740 µl PE to wash the column, incubate for 3 min at RT and spin the column (16,000 x g, 1 min).Note: Place the columns in the rotor consistently, since the columns will be turned 180° in step H19.Discard the flow-through.Turn the column (180°) in the rotor and spin (16,000 x g, 1 min) to remove traces of the PE buffer.Discard the collection tube, place the MinElute column into a clean 1.5 ml tube and add 21 µl EB to the center of the resin to elute the DNA.Incubate for 1 min and spin the column (16,000 x g, 1 min).The eluted DNA can be stored at -20 °C.Determine the DNA concentration using the Qubit BR assay. Expected concentrations: TruSeq libraries (15-50 ng/µl) and DNA Illumina multiplex (IM) libraries (0.5-10 ng/µl).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706165326_8887.jpgFigure 4. Gel-purification of the libraries. Libraries (1, 2) were size-separated using standard agarose gel electrophoresis (2% agarose, 1xTAE buffer) and stained with SYBR Gold. The DNA was revealed using a visible blue light emitting “Dark reader transiIlluminator”. A gel image is shown after electrophoresis (A.",
    ") and after the isolation of the area between 320 and 430 bp (B.). R: Ruler (cm), L: GeneRuler 50 bp DNA ladder. The size of the ladder is indicated (bp).Pre-capture library amplification using LM-PCRTo enrich for correctly ligated DNA fragments the library [TruSeq DNA, TruSeq DNA PCR-free or DNA Illumina multiplex (IM) libraries] is used as a template in the pre-capture LM-PCR (ligation-mediated PCR). Prepare a master mix (80 µl per reaction) by adding the reagents in the order indicated and mix well by pipetting:table:",
    "﻿0,1\n2x Phusion High-Fidelity PCR Master Mix,50 µl\nPCR-grade water,26 µl\nTS-PCR Oligo 1 (100 µM; Table 1 in Supplementary Material),2 µl\nTS-PCR Oligo 2 (100 µM; Table 1 in Supplementary Material),2 µl\nDistribute 80 µl of the master mix to PCR tubes and add 20 µl of the library. Mix by pipetting (5x up and down) the reagents. LM-PCR cycling, clean-up and elution of the sample were essentially as described (Haun et al., 2011).Perform PCR using the following conditions:table:\n﻿0,1,2\n-Denaturation,98 °C,30 sec\n8 cycles of:table:\n﻿0,1,2\n-Denaturation,98 °C,10 sec\n-Annealing,60 °C,30 sec\n-Elongation,72 °C,30 sec\nAnd a final extension:table:\n﻿0,1,2\n-Elongation,72 °C,5 min",
    "The reactions are kept at 8 °C.Transfer the amplified library into a 1.5 ml tube and add 5 volumes (500 µl) Qiagen buffer PBI. Mix by pipetting (5x up and down).Transfer the mixture to a QIAquick column placed in a collection tube and centrifuge 16,000 x g (1 min). Discard flow-through.Add 740 µl PE wash buffer and centrifuge 16,000 x g (1 min). Note: Place the columns in the rotor consistently, since the columns will be turned 180° in step I8.Discard the flow-through.Turn the column (180°) and centrifuge the column 16,000 x g (1 min) to remove residual PE wash buffer.Discard the collection tube, place the MinElute column in a new 1.5 ml tube and elute the DNA by adding 50 µl of PCR-grade water to the column matrix. (Caution: Do not use TE or EB for elution.) Incubate 1 min at RT.Centrifuge the column 16,000 x g (1 min) to collect the pre-capture LM-PCR amplified library.Perform quality checks:Quantify the amount of library using a Qubit device or a picogreen based assay. The yield should be > 1 µg.Determine the size profile of the sample library (1 µl) electrophoretically with an Agilent 2100 Bioanalyzer and a DNA 7500 chip. The fragments of the sample library should be between 250 and 500 bp (Figure 5).If the pre-capture LM-PCR amplified library meets the quality requirements, proceed to the hybridization of the sample library to exome library. Optional: Store the sample at -20 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706184432_3748.jpgFigure 5. Typical size profile of the purified pre-capture PCR amplified library. Following pre-capture PCR and reaction clean-up of the amplified library, the DNA (1 µl) was size-fractionated using the Agilent 2100 Bioanalyzer. The lower (LM) and upper marker peaks (UM) are indicated. FU: Fluorescence unit.",
    "Hybridization of sample library to exome library Add 1 µg of the pre-capture LM-PCR amplified library and 10 µl of Roche NimbleGen`s proprietary Sequence Capture Developer Reagent to a 1.5 ml tube. Note: Several pre-capture LM-PCR amplified libraries provided with different indexes can be pooled (total amount 1 µg). Sequence Capture Developer Reagent was previously known as Plant Capture Enhancer (PCE) from Roche NimbleGen. Add 1 µl TruSeq HE Universal Oligo 1 (1 mM). Note: The TruSeq HE Universal Oligo 1 was designed to block the universal segment of TruSeq DNA and DNA Illumina multiplex (IM) library adapters during sequence capture hybridization. For TruSeq DNA or TruSeq DNA PCR-free libraries (pre-capture LM-PCR amplified)Add 1 µl of the appropriate 1 mM TruSeq INV-HE Index Oligo. Note: The TruSeq INV-HE Index Oligos were designed, to block the corresponding indexed segment of the TruSeq DNA library adapters AD002, AD004, AD005, AD006, AD007 and AD012 during sequence capture hybridization, respectively. For DNA Illumina multiplex (IM) libraries (pre-capture LM-PCR amplified)Add 1 µl of the appropriate 1 mM IM INV-HE Index Oligo. Note: The IM INV-HE Index Oligos were designed, to block the corresponding indexed segment of the IM DNA library adapters (Indices 7001 to 7033) during sequence capture hybridization, respectively. Important: If pooled pre-capture LM-PCR amplified libraries are used, the amount of the corresponding blocking oligos is proportional to the concentration of the sample in the pool. Example: If four pre-capture LM-PCR amplified libraries provided with TruSeq adapter (AD002, AD004, AD005 and AD007) are pooled (0.25 µg/library) for hybridization, use 1 µl TruSeq HE Universal Oligo 1 (1 mM) together with 0.25 µl TruSeq INV-HE Index Oligo 2 (1 mM), 0.25 µl TruSeq INV-HE Index Oligo 4 (1 mM), 0.25 µl TruSeq INV-HE Index Oligo 5 (1 mM) and 0.",
    "25 µl TruSeq INV-HE Index Oligo 7 (1 mM), respectively. Lock the tube, puncture the lid with a clean needle and dry down the mixture in a SpeedVac at 60 °C. Pre-heat a heating block (95 °C).The tube contains now the following dried-down components (example for one TruSeq DNA library):table:",
    "﻿0,1\nSequence Capture Developer Reagent,10 µl (dried-down)\nPre-capture LM-PCR amplified library (TruSeq DNA),1 µg (dried-down)\n1 mM TruSeq HE Universal Oligo 1,1 µl (dried-down)\n1 mM Appropriate IM INV-HE Index Oligo,1 µl (dried-down)\nReplace the punctured lid by an intact lid. Add to the dried-down components:table:\n﻿0,1\n2x Sequence Capture (SC) Hybridization Buffer (tube 5),7.5 µl\nHybridization Component A (tube 6),3.0 µl\nThe cocktail (total volume 10.5 µl) is vortexed for 10 sec and collected by centrifugation (RT, 10 sec, 16,000 rpm).The cocktail is denatured in a heating block (95 °C, 10 min).Collect the sample by centrifugation (RT, 10 sec, 16,000 rpm).Transfer the entire sample to a 0.2 ml PCR tube containing 4.5 µl Exome Library (liquid array) per capture. Mix by pipetting up and down gently (10x). Make sure that the entire sample is located at the bottom of the tube.Hybridize the sample (15 µl) in a thermocycler at 47 °C for 64-72 h (lid heated to 57 °C).Affinity purification of the captured libraryDilute 10x Wash Buffers (tubes 1, 2 and 3), 10x Stringent Wash Buffer (tube 4) and 2.5x Bead Wash Buffer (tube 7) to 1x working solutions. Use PCR-grade water as diluent. Volumes per reaction:table:\n﻿0,1,2\nStock,PCR-grade water,1x working solution\n30 µl 10 x Wash Buffer I (tube 1),270 µl,300 µl\n20 µl 10 x Wash Buffer II (tube 2),180 µl,200 µl\n20 µl 10 x Wash Buffer III (tube 3),180 µl,200 µl\n40 µl 10 x Stringent Wash Buffer (tube 4),360 µl,400 µl\n200 µl 2.5 x Bead Wash Buffer (tube 7),300 µl,500 µl",
    "Note: Set a water bath to 47 °C and verify the temperature with an external calibrated thermometer. Pre-heat the 1x working solutions (Wash Buffer I and Stringent Wash Buffer) for 2 h prior to use.            Equilibrate Streptavidin Dynabeads to RT, vortex 10 sec and aliquot 50 µl (per hybridization) into a new 1.5 ml tube. Place the tube into a DynaMag-2 magnet for 2 min, discard the clear liquid, and add 100 µl of Bead Wash Buffer.Remove the tube from the magnet, vortex (10 sec) and collect the suspension to the bottom of the tube.Place the tube into a DynaMag-2 magnet for 2 min, discard the clear liquid, and add 100 µl of Bead Wash Buffer.Remove the tube from the magnet, vortex (10 sec) and collect the beads by centrifugation (5 sec, 16,000 x g). Place the tube into a DynaMag-2 magnet for 2 min, discard the clear liquid, and add 50 µl of Bead Wash Buffer.Remove the tube from the magnet, vortex (10 sec) and reclaim the beads by centrifugation (5 sec, 16,000 x g). Transfer the resuspended Dynabeads into a PCR plate. Collect the Dynabeads in a DynaMag-96 Side Skirted Magnetic Particle Concentrator (MPC96) for 2 min and discard the clear liquid.Note: Keep the temperature of the PCR-plate containing the wet Dynabeads as close as possible to 47 °C by using a pre-warmed heating block. Dynabeads should not dry down.Add the hybridization sample (15 µl) to the wet Dynabeads (pre-warmed 47 °C) in the PCR plate. Mix gently by pipetting up and down (5x). Proceed swiftly.Note: The volume of the hybridization sample may now be < 15 µl. However, this does not interfere with subsequent steps.",
    "Using a pre-heated thermocycler (57 °C lid temperature) the (biotinylated) captured sample is bound to the (streptavidin- coated) Dynabeads at 47 °C for 45 min. Vortex the plate for 3 sec in 15-min intervals to make sure that the Dynabeads remain in suspension and collect droplets to the bottom of the plate by a quick centrifugation (swing-out rotor) without pelleting the beads.Add 100 µl 1x Wash Buffer I (pre-heated in a water bath to 47 °C) to the Dynabeads plus bound DNA and vortex for 10 sec. Collect the suspension to the bottom of the plate by a quick centrifugation (swing-out rotor) without pelleting the beads.Transfer the suspension to a new 1.5 ml tube. Place the tube into a DynaMag-2 device to reclaim the Dynabeads plus bound DNA for 1 min. Discard the supernatant. Remove the tube from the magnet.Add 200 µl 1x Stringent Wash Buffer (pre-heated in a water bath to 47 °C) to the Dynabeads plus bound DNA and mix by pipetting thereby avoiding a major temperature drop and incubate for 5 min (47 °C, 300 rpm).Place the tube into a DynaMag-2 device to collect the Dynabeads plus bound DNA for 1 min. Discard the supernatant. Remove the tube from the magnet.Repeat washing with 1x Stringent Wash Buffer once (steps K14-15).Add 200 µl Wash Buffer I (room temperature) to the Dynabeads plus bound DNA and vortex for 2 min. Collect the suspension to the bottom of the tube by a quick centrifugation without pelleting the beads.Place the tube into a DynaMag-2 device to collect the Dynabeads plus bound DNA for 1 min. Discard the supernatant. Remove the tube from the magnet.Add 200 µl Wash Buffer II (room temperature) to the Dynabeads plus bound DNA and vortex for 1 min.",
    "Collect the suspension to the bottom of the tube by a quick centrifugation without pelleting the beads.Place the tube into a DynaMag-2 device to collect the Dynabeads plus bound DNA for 1 min. Discard the supernatant. Remove the tube from the magnet.Add 200 µl Wash Buffer III (room temperature) to the Dynabeads plus bound DNA and vortex for 30 sec. Collect the suspension to the bottom of the tube by a quick centrifugation without pelleting the beads.Place the tube into a DynaMag-2 device to collect the Dynabeads plus bound DNA for 1 min. Discard the supernatant. Remove the tube from the magnet.Resuspend the washed Dynabead-bound captured library in 50 µl PCR-grade water and determine precisely the volume using a pipette (storage at -20 °C possible).Post-capture library amplification using LM-PCRSet up a master mix for the PCR reaction (volume for one reaction):table:",
    "﻿0,1\n2x Phusion High-Fidelity PCR Master Mix,100 µl\nPCR-grade water,42 µl\nTS-PCR Oligo 1 (100 µM; Table 1 in Supplementary Material),4 µl\nTS-PCR Oligo 2 (100 µM; Table 1 in Supplementary Material),4 µl\nMix the mastermix carefully by pipetting up and down (8x).Add the Dynabead-bound captured library (50 µl). The final volume is 200 µl.Mix carefully by pipetting up and down (8x). Avoid the formation of foam.Distribute 100 µl of the mixture into two 0.2 ml-PCR tubes.Perform PCR using the following conditions:table:\n﻿0,1,2\n-Denaturation,98 °C,30 sec\n18 cycles of:table:\n﻿0,1,2\n-Denaturation,98 °C,10 sec\n-Annealing,60 °C,30 sec\n-Elongation,72 °C,30 sec\nAnd a final extension:table:\n﻿0,1,2\n-Elongation,72 °C,5 min",
    "The reactions are kept at 8 °C.Combine the two samples (total 200 µl) into a 1.5 ml tube and add 1 ml Qiagen buffer PBI. Mix by pipetting (5x up and down).Transfer 600 µl of the mixture to a QIAquick column placed in a collection tube and centrifuge 16,000 x g (1 min). Discard flow-through.Repeat step L5 with the remaining mixture.Add 740 µl PE wash buffer and centrifuge 16,000 x g (1 min). Discard flow-through.Centrifuge the column 16,000 x g (1 min) to remove residual PE wash buffer.Turn the column 180° and centrifuge the column 16,000 x g (30 sec) to remove traces of PE wash buffer. Place the column into a new 1.5 ml tube.For elution add 50 µl EB (pre-heated to 50 °C) to the column matrix, incubate for 1 min. Centrifuge the column 16,000 x g (1 min) to reclaim the post-capture LM-PCR amplified library (exome capture library). Re-eluate the column by adding 50 µl of the first eluate to the column again. Incubate 1 min. Turn the column (180°) and reclaim the DNA by centrifugation (1 min, 16,000 x g). Store the library at -20 °C.Characterization of the library:Use e.g. a Nanodrop Spectrophotometer device to determine the A260/A280 ratio from 1 µl of the exome capture library (A260/A280 should be 1.7-2.0).Determine the size profile of the exome capture library (1 µl) electrophoretically with an Agilent 2100 Bioanalyzer and a DNA 7500 chip. The fragments should be between 250 and 500 bp (Figure 6).Measure the DNA concentration using a picogreen-based assay (e.g. Qubit BR). The expected yield is > 500 ng.Quantify the exome capture library using Real-Time PCR as described previously (Mascher et al., 2013). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140706/20140706181932_7754.jpgFigure 6. Typical size profiles of final capture libraries.",
    "Following post-capture PCR and reaction clean-up, libraries (1 µl) were size-fractionated using the Agilent 2100 Bioanalyzer. As examples, three libraries (a, b and c) derived from three independent preparations are shown. The lower (LM) and upper marker peaks (UM) are indicated. FU: fluorescence unitSequencing-by-synthesis and data evaluationSequencing-by-synthesis (paired-end, 2x 100 cycles) using e.g. a HiSeq Illumina system is performed as described previously (Mascher et al., 2013). Analyse data as described previously (Mascher et al., 2013)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Plant Science",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}