{
  "id": 6943,
  "origin_website": "Bio",
  "title": "Measuring Cell Growth and Junction Development in Epithelial Cells Using Electric Cell-Substrate Impedance Sensing (ECIS)",
  "procedures": [
    "Electrode stabilization with cysteine pretreatmentPretreat electrodes with 200 μl of filtered 10 mM L-cysteine for 15 min at room temperature.Aspirate the cysteine solution and wash with 200 μl of autoclaved dH2O twice. Do not wash electrodes with PBS.Air dry the electrodes before seeding cells. Alternatively, the treated and dried electrodes can be stored at room temperature till its expiry.Splitting epithelial cells for transfection with siRNAGrow LLC-PK1 cells in low glucose DMEM supplemented with 10% FBS and 1% Pen-Strep in an incubator at 37 °C with 5% CO2.Split cells when they are grown to about 90% confluence.Seed cells for transfection in 6-well plates using standard cell culture procedures.Use 2 ml antibiotic-free, serum-containing DMEM/well to seed cells. Aim at obtaining 30-40% confluence the next day.Transfecting cellsThe following day (16-24 h later) transfect cells with 100 nM of the negative control (non-related, NR) or claudin-2-specific siRNA using the Lipofectamine RNAiMAX transfection reagent as follows:Mix reagents:Tube A: For each condition (well) to be transfected, prepare siRNA: dilute 2.4 μl of 100 nM stock siRNA duplex in 200 μl Opti-MEM medium without serum in a sterile microcentrifuge tube. Mix gently. For more wells, scale up amounts as needed.Tube B: For each condition (well) prepare LipofectamineTM: add 3 μl LipofectamineTM RNAiMAX to 200 μl Opti-MEM medium. Mix gently. For more wells, scale up amounts as needed.Incubate the tubes for 5 min at room temperature.Mix the content of tube A and B to generate the siRNA-Lipofectamine complex. Incubate for 15 min.At the end of the incubation time, add 400 μl of the siRNA-Lipofectamine mix to the corresponding well. Gently shake to mix and return to the incubator.Grow cells for 24 h.",
    "Seeding cells on the electrode arraysThe next day, prepare the electrode arrays for seeding:Add 400 μl pre-warmed complete culture medium (growth medium with serum and antibiotics) to the wells, and place into the incubator for 15 min prior to seeding cells. This will coat the surface with serum and warm the array to reduce convection of the medium/cell suspension due to heat differences, that affects even settling of cells on the electrode.Trypsinize cells transfected with control siRNA and claudin-2-specific siRNA. When cells are floating, add warm medium, collect, and spin down cells using 300 x g. Resuspend in fresh medium. Keep warm while performing the cell counting.Count cells using the Countess automated cell counter:Using a sterile tip remove 10 μl of the cell suspension and mix with 10 μl of Trypan blue in a microcentrifuge tube. Add to a CountessTM Cell Counting Chamber Slide and count cells using the automated cell counter to obtain number of viable cells.Note: Manual counting can be used instead of the Countess. Adjust volume using warm medium to obtain a total of 0.5 x 105 cells/electrode in a final volume of 400 μl.Remove array from the incubator and aspirate the medium from the wells. Add 400 μl of cell suspension to each well.Insert the electrode into the ECIS array holder in the incubator and screw the holder tight.Software setup and acquiring dataTurn on the computer and the ECIS Zθ machine.Open the ECIS software. Click the “Setup” button. The system will check the connection. If the connection is good, the wells show up as green. If the connection is bad (red wells), reinsert the electrode, then click “Check” to confirm connectivity of all electrodes by using the “Check” button.Select the type of electrode.",
    "Choose the “Multiple Frequency/Time (MFT)” option (the required frequency can be selected during analysis).Click on “Start”. Enter the file name and any comments you want to save. Collect data for 24-48 h.As cells grow, C at high frequency (32 or 64 kHz) decreases (see Note 6 for comments on the choice of frequency). Confluence is achieved when C is stable at the minimum. At this point, the measurement can be stopped."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}