{
  "id": 17694,
  "origin_website": "Jove",
  "title": "A Novel Right Ventricular Volume and Pressure Loaded Piglet Heart Model for the Study of Tricuspid Valve Function.",
  "procedures": [
    "The protocol and procedures in this manuscript were developed under the supervision of a veterinarian and performed in compliance with the guidelines of the Canadian Council on Animal Care and the guide for the care and use of laboratory animals. The protocol was approved by the institutional animal care committee at the University of Alberta. All individuals involved in the manuscript procedures received appropriate biosafety training.\n1. Pre-procedure preparation, anesthesia and access\nAnimal inclusion and exclusion criteria.\n\t\nInclusion criteria: Use both female and male Duroc crossbred piglets between four to five weeks of age for this model. Piglets of this age have a human maturity equivalent to infants between four to six months of age.\nExclusion criteria: Exclude piglets with atrial septal defect and/or patent ductus arteriosus (assessed by echocardiography), cardiac or extracardiac malformation, or where infectious disease was suspected.\nTransfer piglets to the housing facility at least five to seven days prior to surgery for acclimatization.\nA day prior to surgery, examine the piglet to ensure fitness for surgery and absence of signs of illness, such as coughing, emesis, diarrhea, paleness, weakness, lethargy, or skin lesions.\nFast piglets from solid feed for at least three hours prior to surgery, allowing access to water up to the time of surgery.\nTransfer piglet to the surgical procedure room.\nAdminister procedural premedication of atropine (0.04 mg/kg), midazolam (0.2 mg/kg) and ketamine (2 mg/kg) through an intramuscular injection. Also, administer a slow-release preparation of buprenorphine (0.01 mg/kg) subcutaneously for perioperative analgesia.\nOn the operating table, place a recirculating water blanket and set the water temperature initially at approximately 40 °C. Adjust the water blanket temperature to maintain core body temperature between 38.0 to 39.5 °C in the piglet.",
    "Once the jaw is fully relaxed, spray the larynx with 1% lidocaine. Perform standard endotracheal intubation with portable pulse oximeter monitoring.\nCheck, attach and ensure proper function of monitoring equipment: pulse oximeter, capnograph, ECG telemetry leads and temperature probe.\nGive the piglet inhaled isoflurane (2-5%) for anesthetic during the surgical procedure, adjusted depending on the depth of anesthesia. Monitor the depth of anesthesia through assessment of heart rate, respiratory rate and breathing pattern, oxygen saturation, eyelid and withdrawal reflex.\nUse the following initial ventilator settings: PEEP of 4 cmH2O, tidal volume between 8-10 mL/kg and an inspiratory to expiratory ratio of 1:1. The ventilator rate ranges between 26-36/min, adjusted to achieve pCO2 between 35-42 mmHg on an arterial blood gas analyzed using a point-of-care blood gas analyzer.\nPlace the piglet in a supine position. Apply sterile ophthalmic ointment to both eyes for lubrication during procedure.\nShave hair over the surgical site. Using sterile gauze and disinfectant scrub (povidone-iodine 7.5%), disinfect the chest in a circular movement from inside to outside three times. Wipe away the excess scrub solution with sterile gauze. Using aseptic technique, drape the surgical sites (neck and left side of chest) and surrounding area.\nUsing a modified Seldinger technique, place central catheters in both the carotid artery (3.5 French single lumen catheter or 24 gauge IV catheter) and internal jugular vein (five or six French double or triple lumen catheter) for pressure monitoring, blood sampling and venous access during the procedure for medication delivery.\nAdminister an intravenous dose of cefazolin (30 mg/kg) for perioperative sepsis prophylaxis and ranitidine (1 mg/kg) for stress ulcer prophylaxis. Initiate intravenous maintenance fluid (D5WNS) through the central venous catheter.\n2. Bioptome disruption of pulmonary valve cusps",
    "After confirmation of surgical plane, perform a left thoracotomy at the third intercostal space to ensure adequate exposure to visualize main pulmonary artery.\nUsing sterile gel and a sleeve, perform epicardial echocardiographic study through the left thoracotomy to assess for presence of atrial septal defect, patent ductus arteriosus, and then sweep through the pulmonary and tricuspid valves to assess for congenital abnormalities.\nThrough the left thoracotomy incision, place purse-string sutures on the main pulmonary artery (MPA) and attach to a snare.\nUsing a needle introducer, puncture the MPA in the middle of the purse-string sutures and advance a wire. Over the wire, advance a custom-designed flanged seven-French catheter sheath through the MPA incision. Securely anchor the catheter on the surface of the MPA by wrapping purse-string sutures around the catheter flange, and snare can be tightened down (Figure 1).\nIntroduce a bioptome into the sheath and advance under epicardial echocardiographic guidance to the pulmonary valve.\nUnder direct epicardial echocardiographic visualization, use the bioptome to secure bites in the pulmonary valve cusps. Withdraw the bioptome result in cusp tears and disrupt the pulmonary valve.\n\t\nRepeat this process as needed to achieve moderate to severe pulmonary regurgitation. This is assessed using pulse-wave Doppler interrogation in the branch pulmonary arteries. We aim to achieve a reverse to forward velocity time integral (VTI) ratio between 0.6 to 0.7 at the time of the procedure. Once satisfied, withdraw the bioptome.\nDuring procedure, administer intravenous infusions of epinephrine (0.05 - 0.15 µg/kg/min) and/or norepinephrine (0.05 - 0.15 µg/kg/min) as required to maintain normal blood pressure during procedure (mean systemic arterial blood pressure between 60 – 80 mmHg).\n3. Placement of pulmonary artery band",
    "Insert a single lumen five-French umbilical catheter through the previously placed sheath and advance it into the right ventricle (RV) for RV pressure monitoring during the placement of a pulmonary artery band.\nWeave either silk or a synthetic, braided non-absorbable suture through the middle of a silastic band for reinforcement and strength. Wrap this silastic band around the MPA in between the pulmonary valve and proximal to the catheter puncture site.\nThrough direct RV pressure measurement, tighten the pulmonary artery band and adjust using a vascular clip to achieve ≥60% systemic RV systolic pressure. Once the desired pressure is reached, tie sutures to secure the pulmonary artery band.\nAdvance the umbilical catheter across the pulmonary artery band and into the distal MPA for a pull-back pulmonary artery band gradient. Remove the umbilical catheter and sheath.\nTie off the purse-string suture to close the MPA puncture site (Figure 2).\nClose the left thoracotomy incision in three layers using nonabsorbable sutures for the first layer and then absorbable sutures to close the muscle layers. Apply skin staples to close the skin layer.\nInfiltrate around the skin incision with Bupivacaine (0.5%, max dose 2 mg/kg) for local analgesia. Administer a single intravenous dose of meloxicam (0.2 mg/kg) for postoperative analgesia in addition to the previously given subcutaneous slow-release buprenorphine.\nRemove both the arterial and venous central lines and tie off the vessels to ensure hemostasis.\nApply Hibitane cream (1% chlorhexidine) to the incisions and secure a bandage dressing to cover the incision.\nTurn off inhaled isoflurane. Once piglet is breathing on its own with adequate airway protection mechanisms, extubate with postoperative recovery monitoring and care.\nFor prophylaxis of incisional infection, give an empiric five-day course of oral cephalexin 30 mg/kg BID to the piglet.\n4. Echocardiographic assessment",
    "Qualitatively assess pulmonary regurgitation by color Doppler and grade from 0 to 4 [0 = none, 1 = trivial (single narrow jet), 2 = mild (single slightly broader jet with jet length < 10 mm, proximal jet width to RV outflow tract ratio < 0.25), 3 = moderate (single or multiple jets with the combined proximal jet width to RV outflow tract ratio between 0.25 to 0.65), and 4 = severe (wide jet with proximal jet width to RV outflow tract ratio > 0.65)].\n\t\nIn the intervention group, semi-quantify the pulmonary regurgitation by measuring a reverse to forward velocity time integral (VTI) ratio using pulse-wave Doppler in the branch pulmonary artery (Figure 3).\nQualitatively grade the severity of tricuspid regurgitation from 0 to 4 through color Doppler assessment [0 = none, 1 = trivial (single narrow jet), 2 = mild (multiple narrow jets), 3 = moderate (wide jet reaching the midportion of the right atrium), and 4 = severe (wide jet reaching the back wall of the right atrium)]. Both the pulmonary and tricuspid valve regurgitation grading systems are in accordance with current guidelines14,15,16,17,18,19.\nAssess right ventricular systolic function using right ventricular fractional area change (﻿RV FAC), which was measured by tracing the area bound by endocardial borders of the right ventricle at end-diastole and end-systole in the apical four-chamber view. Calculate the RV FAC as the difference between the two areas, expressed as a percentage of the end-diastolic RV area. An RVFAC value < 35% represents abnormal RV systolic function20.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}