{
  "id": 3395,
  "origin_website": "Cell",
  "title": "Assessing mRNA translation in mouse adult microglia and bone-marrow-derived macrophages",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEach sample will require the following conditions: 1) cells treated with Cycloheximide (CHX) and OPP (hereafter defined as “CHX+OPP”) as a control for reduced translation; 2) cells treated with OPP (hereafter defined as “OPP”); 3) cells not treated with OPP but subsequently treated with FAM-Azide (defined as “no OPP”); 4) cells used as “unstained control” and “live/dead control”, only for FACS analysis (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2976-Fig1.jpg\nFigure 1. Visual summary of steps required in the protein synthesis assay\nImage created with BioRender.com.[href=http://BioRender.com]\nNote: If the number of cells is limited, conditions 3) and 4) can be obtained by mixing cells from multiple samples.\nFlow cytometry-based translation assay in adult microglia\nTiming: 5 h\nThe following protocol describes the steps needed for determining the translation rate in adult mouse brain cells. Previous steps 1–6 were described in section “before you begin[href=https://www.wicell.org#before-you-begin]”, isolation of brain cells from adult mice[href=https://www.wicell.org#sec1.2].\nPlate 100 μL of brain cell suspension per condition in a V-bottom plate.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant and immediately proceed to next step. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nCycloheximide (CHX) pre-treatment, only for CHX+OPP control sample\nAdd 100 μL of Cycloheximide solution to CHX+OPP samples (control for reduced translation). Mix well and avoid generating bubbles when pipetting up and down with a P200 pipette.\nAdd 100 μL of Microglia medium (MM) to all other samples and resuspend with a P200 pipette.\nIncubate cells in a cell culture incubator at 37°C for 15 min. After treatment, proceed immediately to point 4.\nO-Propargyl-Puromycin (OPP) incubation\nAdd 10 μL of OPP stock solution only to samples designated as “OPP” and “CHX+OPP”. Mix well by pipetting up and down without generating bubbles.",
    "To the remaining samples, add 10 μL of media. Incubate cells in a cell culture incubator at 37°C for 1 h. Each sample now has a final volume of 110 μL.\nNote: the FACS staining stock solution can be prepared 10–15 min before the end of the OPP treatment.\nSurface marker staining.\nAdd 10 μL of the previously prepared FACS staining stock solution to each condition (no OPP, OPP and OPP + CHX) but not the unstained controls.\nMix to get a single cell suspension by gently pipetting without generating bubbles.\nFor the unstained control well, use 10 μL of MM only and for the live/dead control, use 10 μL of MM containing only the live/dead staining dye.\nProtect plate from light and incubate for 10 min at 37°C.\nSpin down the plate at 400 × g for 5 min at RT and carefully aspirate the supernatant.\nNote: If channel compensation on the flow cytometer is not performed with beads, samples with single stains and Fluorescent Minus One (FMO) stains will be required.\nCritical: Fluorescently labeled antibodies used for FACS analysis are light-sensitive. Therefore, it is advisable to perform the following steps shielding samples from light. In order to achieve this, cover the plate with parafilm (to avoid spillages in neighboring wells) or a 96-well plate lid; then cover the plate with aluminum foil.\nCritical: Aspirating supernatant with a vacuum pump should be avoided in order to reduce the risk of aspirating cells. This step can be carried out with a pipette, using a multichannel pipette if working with a considerable number of samples. The same applies to the subsequent steps.\nCell Fixation.",
    "Resuspend cells in 100 μL of 4% PFA/PBS per well. Mix gently to ensure a single cell suspension. Protect plate from light and incubate at 18°C–24°C for 5 min. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.\nWashing cells with Cell-Based Assay Wash Buffer.\nResuspend cells in 200 μL of Cell-Based Assay Wash Buffer provided with the kit. Mix to ensure a single cell suspension and incubate the plate protected by light at RT for 5 min.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.\nRepeat cell washes steps (7a and 7b) for a total of three times.\nNote: Cell-Based Assay Wash Buffer contains 0.1% of Polysorbate 20 (also known as Tween 20), a nonionic surfactant required for cell permeabilization,9[href=https://www.wicell.org#bib9] in order to allow FAM-Azide to enter cells and encounter OPP-conjugated nascent peptides.\nFAM-Azide staining.\nNote: During the last centrifugation steps (7a-c), start preparing the 5 FAM-Azide staining solution in a tube, protected from light.\nCritical: FAM-Azide is light sensitive. Carry out the following steps without direct exposure to light.\nGently resuspend cells in 100 μL of 5 FAM-Azide Staining Solution in order to obtain a single cell suspension. Incubate cells for 30 min in the dark at 18°C–24°C.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.\nResuspend cells in 200 μL of Cell-Based Assay Wash Buffer provided with the kit. Mix gently to ensure a single cell suspension and incubate the plate protected from light at 18°C–24°C for 5 min.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.",
    "Repeat washing steps (8c and 8d) for a total of three times.\nResuspend cells in 200 μL of previously prepared Assay Buffer (1X). Mix well by pipetting up and down to get a single cell suspension. Transfer the sample to a FACS tube and proceed immediately to analyze the sample by Flow cytometry. An example of the gating strategy is reported in Figure 2[href=https://www.wicell.org#fig2]. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2976-Fig2.jpg\nFigure 2. Expected outcomes of the protein synthesis assay in untreated (no OPP), Cycloheximide- and OPP-treated (CHX+OPP), OPP-treated (OPP) adult microglia or BMDMs\n(A) Gating strategy applied for the identification of adult microglia cells: a) Forward scatter (FSC-A) – Side scatter (SSC-A) plot of cells contained in brain cell suspension; b) FSC-H – FSC-A plot to identify single cells; c) SSC-A – LIVE/DEAD plot to identify viable cells (=negative cells) ; d) dot plot for CD11b and CD45 channels, microglia are identified based on their high expression of CD11b and intermediate expression of CD45; e) histograms for 5-FAM channel; top panel: cells with no OPP and therefore no staining; middle panel: cells with OPP but treated with CHX, showing reduced translation when compared with cells not treated with CHX (bottom panel); bottom panel: cells treated with OPP showing full translation rate. Median Fluorescence Intensities (MFI) of no OPP, CHX+OPP and OPP are reported in in the table below the histograms.\n(B) Relative fluorescence intensity (RFU) of the protein synthesis rate in wild-type BMDMs at steady state and after stimulation with 100 ng/mL LPS for 3 h and assessed with a fluorescent plate reader. Data adjusted from Keane et al.1[href=https://www.wicell.org#bib1] and displayed as mean ± SEM (n = 3). P adjusted value (P): ∗∗P < 0.01, ∗∗∗∗P < 0.0001, 2-way ANOVA with Tukey correction for multiple comparisons.",
    "Optional: To maximize cell recovery in step 8f, resuspend cells in 100 μL of Assay Buffer (1X); transfer sample to the corresponding FACS tube and keep the tube on ice and in the dark. Then use an extra 100 μL of Assay Buffer to further wash the well, collecting any remaining cell and transferring it into the corresponding sample tube.\nIn-vitro translation assay for cultured bone marrow-derived macrophages (BMDMs)\nTiming:  > 5 h\nThis section describes the steps needed for determining the translation rate in differentiated BMDMs. Previous steps 1–26 were described in section “before you begin[href=https://www.wicell.org#before-you-begin]”, bone marrow-derived macrophages culture protocol[href=https://www.wicell.org#sec1.3].\nSpin down the plate with BMDMs at 400 × g for 5 min at 18°C–24°C, carefully aspirate the supernatant and proceed immediately to the next step. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nNote: Although BMDMs are strongly adherent cells, we follow the Protein Synthesis Assay manufacturer’s recommendation to centrifuge the plate, as described in the assay protocol related to plate reader detection.\nNote: if working with a considerable number of samples, the supernatant can be removed more quickly by using a multichannel pipette. The same applies to the subsequent steps.\nO-Propargyl-Puromycin (OPP) incubation with or without Cycloheximide.\nAdd 100 μL of DMEM to the negative control (“no OPP”), 100 μL of OPP working solution (“OPP”) and 100 μL OPP working solution with cycloheximide (“CHX+OPP”), previously prepared, to the respective cell-containing wells.\nNote: For BMDMs, no pre-treatment with Cycloheximide with our time point of 3 h was required.\nIncubate cells in a cell culture incubator at 37°C/5% CO2 for 2 h.\nAfter treatment, spin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant. Proceed immediately to step 30.\nCell Fixation.",
    "Add 100 μL of 4% PFA/PBS to each well and incubate at 18°C–24°C for 5 min.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nWashing cells with Cell-Based Assay Wash Buffer.\nAdd 100 μL of Cell-Based Assay Wash Buffer provided with the kit and incubate the cells at 18°C–24°C for 5 min.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.\nRepeat washing steps (4a and 4b) for a total of three times.\nNote: Cell-Based Assay Wash Buffer contains 0.1% of Polysorbate 20 (also known as Tween 20), a nonionic surfactant required for cell permeabilization,9[href=https://www.wicell.org#bib9] in order to allow FAM-Azide to enter cells and encounter OPP-conjugated nascent peptides.\nNote: During the last centrifugation steps (4a-c), start preparing the 5 FAM-Azide staining solution in a tube protected by light.\nCritical: FAM-Azide is light sensitive. All the next steps must be performed without direct exposure to light. Perform incubations in the dark.\nFAM-Azide staining.\nAdd 100 μL of 5 FAM-Azide Staining Solution and incubate cells for 30 min in the dark at 18°C–24°C.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.\nAdd 100 μL of Cell-Based Assay Wash Buffer provided with the kit and incubate the plate protected from light at 18°C–24°C for 5 min.\nSpin down the plate at 400 × g for 5 min at 18°C–24°C and carefully aspirate the supernatant.\nRepeat cell washes steps (5c and 5d) for a total of three times.\nAdd 100 μL of previously prepared Assay Buffer (1×). Proceed immediately to measure the fluorescence intensity with a fluorescent plate reader using a filter designed to detect FITC (excitation/emission = 485/535 nm). Troubleshooting 2[href=https://www.wicell.org#troubleshooting]."
  ],
  "subjectAreas": [
    "Immunology",
    "Neuroscience",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}