{
  "id": 7716,
  "origin_website": "Bio",
  "title": "Site-specific Incorporation of Phosphoserine into Recombinant Proteins in <em>Escherichia coli</em>",
  "procedures": [
    "4-Day expression process Day 1: Transformation Notes:  Fresh double plasmid transformations must be performed for each expression. Never freeze expression cells containing plasmids; after freezing for storage, the cells will grow with the antibiotics, but they will not express protein. Do not sequentially transform plasmids. To standardize this protocol in your lab, run control expressions with sfGFP wt and sfGFP-150TAG first, to verify you can achieve the reference expression benchmarks, and ensure that pSer suppression of the TAG site is functioning as expected with a model protein. The protocol below contains information for a standard 50-mL test expression, as well as a 1-L expression, as is often used for target proteins once the system is known to be working. Expression volumes can be scaled as needed. Ensure a water bath is available at 42 °C. A water bath is important to ensure rapid heat transfer for the heat shock step.For each expression, add 2 μL each of pKW2-EFSep and the desired pRBC plasmid into a 1.7-mL Eppendorf tube.This should be ~50–200 ng of each plasmid.Place tube on ice for 5 min to pre-chill.Thaw aliquot(s) of B95(DE3) ∆A ∆fabR ∆serB or BL21(DE3) ∆serB competent cells.Add 50 μL of competent cells to each tube with plasmids, gently mix cells with plasmids, and place back on ice for 30 min.After 30 min on ice, heat shock cells by placing the tube in the water bath at 42 °C for exactly 45 s.Immediately place tube back on ice, and incubate for 2 min.Add 1 mL of SOC media.Note: make sure SOC is not contaminated from prior use.Allow cells to recover with shaking at >200 rpm at 37 °C. It is convenient to simply tape Eppendorf tubes horizontally to shaker deck.For B95(DE3) ∆A ∆fabR ∆serB, recover for 120 min.",
    "For BL21(DE3) ∆serB cells, recover for 90 min.Note: Longer recovery times for the B95(DE3) ∆A ∆fabR ∆serB are suggested, due to the slightly slower growth rates and metabolism of this strain. Plate the recovered culture onto LB/agar/ampicillin/chloramphenicol plates appropriate for the chosen expression strain: 25 μg/mL ampicillin + 7 μg/mL chloramphenicol for B95(DE3) ∆A ∆fabR ∆serB, and 100 μg/mL ampicillin + 25 μg/mL chloramphenicol for BL21(DE3) ∆serB cells.To ensure a sufficient number of colonies, plate all cells. To do this, centrifuge cells at 3000 rcf for 3 min, remove the top 900 μL of supernatant, resuspend the cell pellet by gentle pipetting in the remaining 100 μL of supernatant, then plate and spread the fully resuspended cells.Let plate(s) dry with lid partially open for ~20 min near a flame (maintaining sterility), and then incubate plate(s) upside down at 37 °C overnight.Day 2: Starter culture Notes:  Volumes of media can be changed depending on the scale of expression desired. Described below are volumes for a 50-mL sfGFP test expression and a 1-L target protein expression. This protocol requires overnight non-inducing starter cultures to reach stationary phase. Starter cultures that do not reach stationary phase may not express target protein appropriately in auto-inducing media. Remove LB/agar plates from the incubator at 37 °C, and place them at room temperature or 4 °C for the day.~20–100 colonies should have grown for B95(DE3) ∆A ∆fabR ∆serB cells (Figure 1). If no colonies grew, check that the correct antibiotic concentrations were used (25 μg/mL ampicillin, 7 μg/mL chloramphenicol). If correct concentrations were used, the cells may not have been made sufficiently competent.Note: Concentrations of antibiotics for this strain are adjusted to facilitate faster-growth on LB/agar plates. These concentrations were chosen to be approximately one quarter (25%) that used with standard strains.",
    "~100–500 colonies should have grown for BL21(DE3) ∆serB cells (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4541/bioprotoc-12-21-4541-g001.jpgFigure 1. Representative LB/agar plates after co-transformation of pRBC-sfGFP and pKW2-EFSep into B95 ∆A ∆fabR ∆serB (left) and BL21(DE3) ∆serB strains and growth at 37 °C overnight (~18 h). Note that the B95 ∆A ∆fabR ∆serB strain contains ~10-fold fewer colonies, due to the lower transformation efficiency of this strain compared to BL21(DE3) ∆serB.At the end of the day (~3–5 p.m.), prepare ZY-NIM starter culture:Prepare 50 mL of ZY-NIM with appropriate antibiotics.For B95(DE3) ∆A ∆fabR ∆serB, use 50 μg/mL ampicillin and 13 μg/mL chloramphenicol.Note: Concentrations of antibiotics for this strain in liquid media are adjusted to be approximately one half (50%) of that used with standard strains. For BL21(DE3) ∆serB, use 100 μg/mL ampicillin and 25 μg/mL chloramphenicol.Scrape several dozen colonies from overnight LB/agar plate, and use them to inoculate:For a ≥ 1 L expression: 50 mL of ZY-NIM starter culture in a 250-mL baffled flask. Add 1–2 drops of antifoam B.For a 50 mL expression: 5 mL of ZY-NIM in a 15-mL sterile culture tube.Grow starter culture(s) with shaking at ~250 rpm at 37 °C overnight.Day 3: Expression Prepare expression culture:Note: Baffled flasks are highly recommended, to ensure sufficient aeration for auto-induction cultures. Overnight ZY-NIM should have grown to saturation overnight (OD600 ~3–8). If it did not reach OD > 3, either culture did not grow for long enough or media/antibiotic concentrations may not have been correct.Prepare ZY-AIM according to the recipe below.Note: It is recommended that you make all media required in a single batch and then divide into appropriate culture flasks, to ensure all expressions contain the same media. For a 1-L expression: prepare ZY-AIM in a baffled 2.8-L Fernbach flask.For a 50-mL test expression: prepare ZY-AIM in a 250-mL baffled flask.",
    "Add antibioticsFor B95(DE3) ∆A ∆fabR ∆serB, use 50 μg/mL ampicillin and 13 μg/mL chloramphenicol.For BL21(DE3) ∆serB, use 100 μg/mL ampicillin and 25 μg/mL chloramphenicol.Add Antifoam B: ~5–7 drops for a 1-L culture, or 1–2 drops for a 50-mL culture.Add ~1% inoculum of ZY-NIM culture to the ZY-AIM culture (e.g., 10 mL into 1 L, or 0.5 mL into 50 mL).Grow at 200–250 rpm and 37 °C until OD600 is ~1.5.This should take about 3–4 h for BL21 cells, or 4–5 h for B95 cells.Note: The linear range of spectrophotometers is 0.1–1.0 when reading OD600, so a 5- or 10-fold dilution of the culture will be necessary for accurate measurements of cell density, once they grow above 1.0. Once OD600 reaches ~1.5, add more antifoam: ~5 drops for a 1-L culture; or ~1–2 drops for a 50-mL culture.Reduce temperature as needed for effective target protein expression. For sfGFP and sfGFP-150TAG expressions, cultures can be kept at 37 °C.For B95(DE3) ∆A ∆fabR ∆serB, expressions can go as low as 18 °C, but 22–25 °C may be preferable for “cold temperature” expressions. Temperatures as high as 37 °C are acceptable.For BL21(DE3) ∆serB, expressions as low as 18 °C and as high as 37 °C are acceptable.Continue shaking at 200–250 rpm for ~16–20 h.Day 4: Expression analysis and harvesting of cells sfGFP control protein expression analysis. Approximately 16–20 h after cells reached OD ~1.5; the control culture cells should be visibly green. Measure OD600 and fluorescence of both sfGFP and sfGFP-150TAG cultures using a fluorometer. Since sfGFP chromophore formation requires synthesis of full-length protein, fluorescence of whole cells provides a convenient strategy to evaluate the efficiency of sfGFP TAG codon suppression, and therefore pSer incorporation. Fluorescence can be measured with any fluorimeter capable of detecting sfGFP fluorescence (ex/em: 488/510nm).",
    "Diluting the culture 1:10 to 1:100 in a buffer (e.g., 100 μL of culture + 1,900 μL of PBS for a 1:20 dilution) prior to fluorescence measurements may be necessary to obtain a signal within the detection limits of the fluorometer. The OD600 values will vary depending on target protein. Normal values will range from ~2.5 to 15. Final OD600 values below 2 are indicative of poor cell growth or toxicity due to target protein expression.Test Expression Benchmarks:  Carrying out 50-mL test expressions for the wild-type sfGFP and the sfGFP-150TAG constructs ensures that the protocol is properly implemented. The benchmark yields listed in Table 1 are based on 50-mL culture volumes, expressed exactly as described in this protocol (37 °C expression temperature, ZY-AIM).Table 1. Benchmarks for sfGFP-WT and 150TAG protein expression yields, based on culture fluorescence table:",
    "﻿0,1,2,3,4\n,Strain,Fluorescence of culture#,mg of sfGFP per liter culture*,OD600\nwt sfGFP,B95,\"9,550 (6,000–10,000)\",550 (340–600),8.0\nsfGFP 150TAG,B95,\"2,900 (2,000–3,000)\",180 (120–200),8.5\nwt sfGFP,BL21,\"8,500 (6,000–10,000)\",480 (340–600),11.0\nsfGFP 150TAG,BL21,\"1,300 (1,000–2,500)\",80 (60–150),12.1\n#The range indicated in parenthesis is considered normal depending on the day and reagent preparation. Fluorescence values reported here were obtained on a hand-held PicoFluor fluorometer (Turner Biosystems) by diluting cells directly from the culture into PBS (1:20). Fluorescence values are arbitrary and will depend on the fluorometer used. Important is that the relative ratio of sfGFP-150TAG and sfGFP-WT culture fluorescence is consistent with the above values (i.e., the fluorescence of the sfGFP-150TAG protein expression cultures should be ~1/4 to 1/2 that of WT sfGFP).*Yield of sfGFP in milligrams per liter was determined using a fluorescence standard curve of purified sfGFP.Harvest cells by centrifugation if OD600 > ~2 at 5,000 rcf for 15 min. Pour off culture supernatant and resuspend in appropriate buffer.The choice of buffer depends on the protein of interest, the downstream purification strategy, and the application, and should be determined by the user.Adding a cryoprotectant [e.g., 10% (v/v) glycerol] to this buffer can help to minimize adverse effects associated with freezing for sensitive or unstable proteins. The addition of phosphatase inhibitors (see Recipes) to the buffer is recommended for all steps of purification. Cells can be flash frozen in liquid nitrogen and stored at -80 °C, or you can proceed with purification.For His6 tagged proteins to be purified via TALON resin, a recommended resuspension/lysis buffer would be 50 mM Tris pH 7.5, 500 mM NaCl, 10% (v/v) glycerol, 5 mM imidazole, 50 mM NaF, 5 mM sodium pyrophosphate, and 1 mM sodium orthovanadate."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}