{
  "id": 9859,
  "origin_website": "Jove",
  "title": "Selection of Aptamers for Amyloid β-Protein, the Causative Agent of Alzheimer's Disease",
  "procedures": [
    "Part 1: Protein preparation and cross-linking\nInitially, the protein used for SELEX is pretreated with 1,1,1,3,3,3-hexafluoro-2-propanol (HFIP) to obtain homogeneous, aggregate-free preparations, as described previously23. This step is necessary because pre-formed aggregates induce rapid aggregation of amyloidogenic proteins, resulting in poor experimental reproducibility24, and are undesirable for selection of aptamers for unaggregated, non-fibrillar forms of the protein.\nWeigh out ~800 μg (~180 nmol) pure Aβ40 using a microbalance. Transfer the dry lyophilized peptide into labeled, silicon-coated, low-adsorbent 1.6-ml microfuge tubes. \nDissolve the peptide in 100% 1,1,1,3,3,3-hexafluoro-2-propanol (HFIP, 400 μl) to obtain 0.5 mM peptide solution as described previously23.\nDivide this solution into four 100-μl aliquots such that each tube contains ~45 nmol Aβ40 nominally. Proceed to removal of HFIP as described previously23. \nBefore solubilizing the HFIP-treated peptides in buffer for cross-linking reactions, prepare the cross-linking and quenching reagents. Weigh out ammonium persulfate (APS, MW 228.2 g/mol) and prepare a solution of 40 mM in 10 mM sodium phosphate, pH 7.4. Mix using a vortex until the solution is clear.\nPrepare 2 mM solution of Tris(2,2-bipyridyl)dichlororuthenium(II) hexahydrate (RuBpy, MW 748.63 g/mol) in 10 mM sodium phosphate, pH 7.4. Mix using a vortex and verify complete dissolution. Protect the tube from light using aluminum foil.\nPrepare the quenching reagent. Weigh out dithiothreitol (DTT, MW 154.5 g/mol) and dissolve in deionized water or in 10-mM sodium phosphate, pH 7.4, to 1 M. \nDissolve the HFIP-treated peptide exactly as described previously23,25 but aim to obtain ~60 μM peptide solution.",
    "Perform PICUP to generate a mixture of oligomeric Aβ40 as described previously23. A typical PICUP reaction is performed in a volume of 20 μl where the final concentrations of protein, RuBpy, and APS are 30 μM, 0.05 mM, and 1 mM, respectively23. Here, the mixture used for PICUP contains 108 μl protein, 6 μl RuBpy, 6 μl APS, and 1 μl DTT and the concentration of protein, RuBpy, and APS are all doubled relative to the typical reaction. This reduces the number of PICUP reactions to be performed and increases the protein concentration for desalting.\nPart 2: Desalting the protein preparation\nBefore using the protein for SELEX, desalting is performed to remove the cross-linking reagents used for PICUP. This PICUP reaction mixture contains the cross-linking reagents and ~55 μM protein (nominal concentration).\nRemove the top cap off a 5-ml desalting column, support the column by a stand, place a beaker below the column outlet, and remove the outlet plug. Let the storage buffer flow through and collect into the beaker.\nEquilibrate the column in 10 mM ammonium acetate, pH 8.3. Add 5 resin-bed volumes (25 ml) of this buffer in 3-ml aliquots to the column and allow it to flow through. \nMeanwhile, label 8 low-adsorbent, silicon-coated 1.6-ml tubes and place them in a tube rack.\nAfter the column is equilibrated, apply a 0.5-0.7-ml aliquot of the PICUP reaction mixture per column per single desalting use (columns can be washed, stored, and equilibrated for later uses). Allow the protein mixture to soak into the column resin and discard the flow-through in the beaker. \nPlace the first collection tube below the column outlet. Add 0.5 ml acetate buffer to the column and collect the first 0.5-ml fraction flowing through.",
    "Repeat steps 2.4 and 2.5, and collect up to eight 0.5-ml fractions in the corresponding tubes. \nNumber another set of 8 low-adsorbent, silicon-coated, small 0.6-ml tubes and place them in a rack. Label another tube as \"blank.\" Take out 150 μl of each fraction and transfer into the labeled 0.6-ml tubes. Use 20 μl for SDS-PAGE analysis (Figure 1) as shown previously23. \nTransfer 150 μl 10 mM ammonium acetate, pH 8.3, into the blank tube. Use this tube to set the blank in a spectrophotometer. \nMeasure the absorbance in 130 μl of each fraction at λ=280 nm in a Quartz cuvette. \nAfter the absorbance is measured, combine the fractions with the highest protein content (typically fractions 3-5), gently mix using a pipette, and keep a 10-μl aliquot for amino acid analysis to determine the actual protein concentration (not shown). \nDivide the sample into multiple aliquots of ~2 nmol protein per tube and lyophilize the samples in a lyophilizer. \nAfter completion of lyophilization, treat the samples with 100% HFIP as before. \nStore the tubes at -20 °C. Use one tube for each SELEX cycle (below).\nPart 3: Amplification of the synthetic random ssDNA library by PCR\nThe synthetic ssDNA library used here for SELEX included 49 randomized nucleotides (A:T:G:C=25:25:25:25%) flanked by constant regions comprising cloning sites (BamHI, EcoRI) and a T7 promoter, as described previously26.\nTo amplify the library, set up a standard PCR reaction as follows: 202 μl deionized water, 40 μl 10x Taq DNA polymerase buffer, 2 μl ssDNA template (0.5 nmol), 120 μl 25 mM MgCl2, 28 μl 10 mM deoxynucleoside triphosphate mix (dNTPs), 1 μl forward primer (300 pmol), 1 μl reverse primer (300 pmol), and 4 μl Taq polymerase.",
    "Perform the PCR reaction using a thermal cycler with the following settings: 5 min at 94 °C for initial denaturation, 20 cycles each of 94 °C for 30 sec, 52 °C for 30 sec for annealing, 72 °C for 30 sec for extension, and final extension at 72 °C for 7 min.\nAfter the completion of the PCR reaction, purify the amplified DNA product using the Qiagen QiaQuick PCR purification kit as per the manufacturer's instructions. Generally, in these experiments the concentration and yield of DNA are 160 ± 10 ng/μl in 50 μl.\nVerify the amount of DNA after PCR by 2% agarose gel electrophoresis.\nPart 4: Generation of 32P-labeled RNA by in-vitro transcription\nSet up the transcription reaction in an O-ring-capped, 1.6-ml tube according to the manufacturer's instructions with some modifications as follows: 20 μl 5x T7 transcription buffer, 7.5 μl each of 100 mM rATP, rGTP, rUTP, 1 μl 100 mM rCTP, 2 μl α32P-CTP (3000 Ci/mmol), 5-10 μg purified DNA template (~30-40 μl of purified DNA product), 10 μl enzyme mix, and make up the final volume to 100 μl by adding nuclease-free water.\nMix the solution gently by a pipette, centrifuge the mixture, and incubate at 37 °C overnight.\nAt the end of the reaction, the DNA template has to be removed. Add RQ1 RNase-free DNase to a concentration of 1 U/μg of template DNA and incubate for 4 h at 37 °C to digest the DNA template.\nAfter 4 h, extract the RNA by adding 1 volume of citrate-saturated phenol:chloroform:isoamyl alcohol (125:24:1, pH 4.7). Mix by a vortex for ~1 min and centrifuge at 16,000 g for 2 min.",
    "Transfer the upper, aqueous phase to a fresh tube or discard the bottom phase by aspiration using a micropipette. Add 1 volume of chloroform:isoamyl alcohol (24:1), mix by a vortex for 1 min and centrifuge as described in 4.4. \nTransfer the upper, aqueous phase to a fresh tube or discard the bottom phase by aspiration using a micropipette. Residual chloroform can be removed by performing a quick spin (10 seconds) in a microcentrifuge and removal of the bottom phase with a micropipette. In this step, it is easier to remove the bottom phase rather than the supernate.\nTo precipitate the RNA, add 0.1-volume equivalent of 3M sodium acetate, pH 5.2, and 1-volume equivalent of 2-propanol. Mix and place in a -20 °C freezer for 15 min. \nAfter 15 min, spin at top speed, preferably in a refrigerated microcentrifuge at 4 °C, for 20-30 min to precipitate the RNA product.\nAspirate the supernate carefully, wash the RNA pellet with 0.5 ml of 70% ethanol, centrifuge at 4 °C and discard the ethanol by aspiration.\nTransfer the tube containing the RNA pellet to a heat block and dry the pellet at 37 °C for 5 min.\nDissolve the RNA sample in 150 mM STE buffer, pH 8.0 (provided with the illustra ProbeQuant G-50 microcolumns) or nuclease-free water to a volume identical to that of the in-vitro transcription reaction i.e., 100 μl (step 4.1). \nHeat the tube containing the RNA product at 70 °C for 10 min in a heat block and mix by a vortex to facilitate RNA dissolution.\nCentrifuge at top speed for 1 min at room temperature.\nKeep a 1-μl aliquot of RNA in a labeled 0.6-ml tube for scintillation counting and TBE-urea polyacrylamide gel electrophoresis (Part 6).\nPart 5: Removal of unincorporated nucleotides, RNA desalting, and scintillation counting",
    "To remove the unincorporated nucleotides, use two G-50 columns according to the manufacturer's instructions.\nInvert columns and mix by a vortex to resuspend the resin.\nSnap off the bottom closure of the columns at perforation using the plastic tool provided in the kit and make sure to leave the outlet untouched. Loosen the cap a quarter turn and place the columns into clean collection tubes provided in the G-50 kit. \nSpin the columns in the collection tubes at 730 g for 1 min to remove the storage buffer. \nTransfer columns to two new O-ring-capped, 1.6-ml tubes and load 50 μl of 32P-labeled RNA sample per column directly onto the resin without perturbing the resin. \nSpin at 730 g for 2 min to collect the purified labeled RNA. After this step, discard the columns.\nTransfer 1 μl of G-50-purified RNA to a 0.6-ml tube for scintillation counting and electrophoresis (Part 6). Store stock RNA at -20 °C until use for SELEX. It is desirable that RNA is used within 2 days after labeling to avoid its degradation and loss of activity.\nUse the two 1-μl RNA aliquots from steps 4.14 and 5.6 to measure the counts per min (cpm/μl) using a scintillation counter. Here, we use the Triathler bench-top scintillation counter. \nTransfer the tubes containing the RNA sample inside the plastic adaptor used for 32P counting, provided with Triathler. Put the tube and the adaptor inside the counting chamber, close the lid of the chamber, choose 32P counting, and press start to begin counting. \nCalculate % label incorporation i.e., % incorporation of α32P-CTP = (cpm/μl for \"G-50\" sample ÷ cpm/μl for \"TOTAL\" sample) x 100. TOTAL sample is the sample before G-50 purification.",
    "After scintillation counting and calculation of percent incorporation, calculate the yield of RNA and specific activity of RNA. For example, if the counts for a pool of RNA before (237370 cpm/μl) and after G-50 purification (191330 cpm/μl) yield 81% incorporation, then the following are calculated before obtaining the yield of RNA:\nFrom step 4.1, the amount of α32P-CTP at 3000 Ci/mmol and 10 μCi/μl is:imgsrc://cloudfront.jove.com/files/ftp_upload/1955/eq2.png.The amount of unlabeled CTP used is:imgsrc://cloudfront.jove.com/files/ftp_upload/1955/eq1.png.Total amount of CTP used is 100006.7pmol. The molecular weight of RNA is calculated as followsimgsrc://cloudfront.jove.com/files/ftp_upload/1955/eq3.pngwhere 321.45 g/mol27 is the average mass of rNTPs, 100 bp is the number of bases in the sequence, and 17 bp is the number of bases in the T7 promoter that are not transcribed. Subtraction of 61.96 g/mole from the oligonucleotide molecular weight takes into account removal of HPO2 (63.98) and the addition of two hydrogen atoms (2.02)27. Because, of the 4 rNTPs, CTP is the limiting reagent, if all the CTP were to be incorporated the theoretical mass of RNA produced would have been:imgsrc://cloudfront.jove.com/files/ftp_upload/1955/eq4.png. However, because of 81% incorporation, this mass is now 2156 μg. Counts per μg of RNA would then beimgsrc://cloudfront.jove.com/files/ftp_upload/1955/eq5.pngwhere 100 μl is the transcription reaction volume, and in terms of moles: 26618.4 μg/μmol x 8874 cpm/μg=2.4x108 cpm/μmol. From here, the amount of RNA in nmol and its appropriate volume used for incubation with protein can be calculated e.g., 5 μl RNA will contain ~4 nmol RNA, i.e.,imgsrc://cloudfront.jove.com/files/ftp_upload/1955/eq6.pngIn these experiments, 300 pmol to 1 nmol protein and 4 nmol to 100 nmol RNA were used21.\nPart 6: Characterization of the RNA product by electrophoresis and autoradiography",
    "To prepare the samples for electrophoresis, use the 1-μl aliquots of RNA before and after G-50 purification from steps 4.14 and 5.6, respectively. Add 4 μl STE buffer and 5 μl 2x Novex TBE-Urea Sample Buffer.\nHeat the samples at 70 °C for 5 min as usually recommended for RNA electrophoresis (heating was found to be unnecessary because the gel resolution of the RNA samples with and without heating is the same in this experimental setup). \nAssemble a 6% TBE-urea-polyacrylamide gel in the gel-running apparatus, fill the inside and outside chambers with 1x Novex TBE-Urea Running Buffer. Rinse the wells of the precast gel using the buffer by a 1-ml pipette. \nCentrifuge the RNA tubes and load the samples (10 μl total) using gel-loading tips. Run the gel at 180 V for 50 min.\nAfter 50 min, disassemble the gel by breaking apart the plastic mold, remove and discard only the shorter backing of the gel mold, but leave the longer backing as a support for the gel.\nClean the surface of the work area with Decon (or other appropriate radioactivity decontaminant) making sure all the contaminating radioactive spots are removed. \nLay out two layers of plastic Saran wrap; wrap the gel and the plastic backing in the two-plied plastic wrap.\nExpose the gel wrapped in plastic to a sheet of autoradiography x-ray film inside an exposure cassette in the dark room, under safe light. Leave the cassette at -20 °C for 60-90 min. \nDevelop the film in the dark room under safe light after 60-90 min using an automatic film developer (Figure 2).\nPart 7: RNA protein incubation and filter binding",
    "First, the RNA and protein are incubated in solution and then the RNA sequences that bind to the protein are separated from the non-binders. As SELEX cycles progress, filter binding will give an indication of protein RNA binding enrichment.\nIncubate the RNA at 90 °C for 10 min for denaturation and then at room temperature for 10 min for slow renaturation.\nDissolve the protein from step 2.12 in 8 μl 60 mM NaOH and add 36 μl nuclease-free deionized water. Sonicate the mixture for 1 min and add 36 μl 2x RNA binding buffer (20 mM Tris, 300 mM NaCl, 10 mM MgCl2, pH 7.5).\nMix the appropriate amount of RNA with 20 μl 10x RNA binding buffer and make up the volume to 200 μl by adding nuclease-free water. Label the tube \"negative control.\"\nMix 20 μl protein and the desired amount of RNA with 20 μl 10x RNA binding buffer and make up the volume to 200 μl with nuclease-free water. Label the tube \"reaction\".\nMix and incubate the tubes for 30 min at room temperature. Meanwhile prepare the filters and the filter-binding setup for the next step.\nAttach a 125-ml side-arm flask to a vacuum inlet. Place a pre-cleaned, porous glass support for the filter on the side-arm flask.\nEquilibrate 3 filter membranes in 2-3 ml of 1x RNA binding buffer in a 35x10-mm Petri dish for 10-15 min. The first filter will be used for adjusting the vacuum suction, the second will be used for RNA-alone, negative-control filter binding, and the third will be used for filter binding of the RNA-protein mixture.\nAfter 30 min, centrifuge the binding reaction and the control tubes at top speed for 5 min at room temperature.",
    "Turn on the vacuum and place the first membrane on the porous glass. Using a micropipette, drip 0.5 ml of RNA binding buffer onto the membrane and adjust the vacuum to allow slow flow of each buffer drop through the membrane. \nPlace the second membrane onto the porous glass and using the same flow rate, apply the negative-control onto the membrane. \nApply 4x0.5-ml aliquots of 1x RNA binding buffer to wash the membrane and discard the flow-through. Note that if pre-clearing is desired, the flow-through is kept for RNA extraction. Pre-clearing removes RNA sequences that bind to the filter.\nRemove the negative-control membrane and place into a correspondingly-labeled 1.6-ml tube for scintillation counting.\nReplace the porous glass with a pre-cleaned second porous glass support.\nPlace the third disk onto the porous glass and apply the reaction mixture. Wash the filter as in step 7.11 and discard the flow-through. The number of washes can be increased in later SELEX cycles to increase the stringency of SELEX conditions.\nRemove the filter disk and place into a 1.6-ml tube labeled \"reaction mixture\" and keep for scintillation counting.\nPerform scintillation counting as in step 5.8 and note down the counts for the respective filters.\nCalculate the level of the filter-bound radioactivity compared to the total amount of radioactivity applied to the membranes (% binding). This will give an indication of binding enrichment as SELEX progresses.\nPart 8: RNA extraction from the filters\nRNA is extracted from the filters to obtain the sequences that bind to the protein. These sequences are amplified for the next SELEX cycle.\nAfter scintillation counting, remove the binding-reaction filter from the tube (from step 7.15) and place into a clean, dry, 35x10-mm Petri dish.\nUse a clean scalpel and a pair of tweezers to cut the membrane in small pieces.",
    "Using the tweezers, replace the cut pieces of the membrane in the same labeled tube from step 8.1.\nAdd 400 μl elution buffer (7 M urea, 3 mM EDTA, 100 mM sodium citrate, pH 5.0) and incubate the tube at 95 °C for 10 min.\nCentrifuge the tube at top speed at room temperature, aspirate, and collect the extraction butter into a new labeled tube.\nMeasure the remaining radioactivity counts in the tube containing the membrane pieces by scintillation counting to assess the extraction efficiency.\nRepeat the extraction process (steps 8.4-8.6) thrice. The efficiency after 3 extractions is usually ~95-96%.\nIn the tubes containing the RNA extracts, add 1 volume (400 μl) of citrate-saturated (pH 4.7) phenol:chloroform:isoamyl alcohol (125:24:1). Mix by a vortex for ~1 min and centrifuge at 16,000 g for 2 min.\nTransfer the upper, aqueous phase to a fresh tube or discard the bottom phase by aspiration using a micropipette. \nAdd 1 volume of chloroform:isoamyl alcohol (24:1), mix by a vortex for 1 min and centrifuge at 16,000 g for 2 min. \nTransfer the upper, aqueous phase to a fresh tube or discard the bottom phase by aspiration using a micropipette. \nTo precipitate the RNA, add 0.1 volume of 3 M sodium acetate, pH 5.2, 3-4 μl glycogen (10 μg/μl) as RNA coprecipitant, and 1 volume equivalent of 2-propanol. Mix and place in a -20 °C freezer overnight. \nSpin at top speed, preferably in a microcentrifuge at 4 °C, for 20-30 min to precipitate the RNA from step 8.12.\nAfter centrifugation, the RNA separates in a liquid phase that is barely visible. Aspirate the supernate carefully without dislodging this barely visible precipitant phase at the bottom of the tube.",
    "Wash the RNA \"pellet\" with 0.5 ml of 70% ethanol, centrifuge for 5 min at top speed at 4 °C and discard the ethanol by aspiration without dislodging the barely visible precipitant phase.\nDissolve the RNA pellet in 50 μl STE buffer and proceed to G-50 purification as in step 5.\nPart 9: Reverse transcription and PCR for continuing SELEX cycles\nTo proceed to the next cycle of SELEX, RNA has to be reverse-transcribed to DNA and amplified by PCR.\nIn 5 labeled 0.6-ml tubes, mix 3 μl of the purified, G-50-desalted RNA with 2 μl of 8-fold-diluted reverse primer. Label one tube  'negative control.'\nIncubate the mixture at 70 °C for 5 min, and then on ice for another 5 min to allow hybridization of the primer to the RNA.\nTo this mixture on ice, add 6.4 μl nuclease-free water, 4 μl ImProm-II 5x reaction buffer, 1.6 μl 25 mM MgCl2, 1 μl 10 mM dNTP mix, 1 μl RNasein Ribonuclease Inhibitor, 1 μl ImProm-II Reverse Transcriptase making up a total of 15 μl. \nFor the negative control, add 7.4 μl nuclease-free water and leave out the reverse transcriptase. Label the tubes accordingly. The negative control is included to verify that contaminating DNA from a previous cycle is not amplified for the next SELEX cycle. This step tests the effectiveness of the digestion of DNA template by RQ1 RNase-free DNase in step 4.3.\nUse a thermal cycler to incubate the reaction mixture at 25 °C for 5 min, 42 °C for 1 h for annealing and extension of first-strand DNA, respectively, followed by 70 °C for 15 min to inactivate the reverse transcriptase.",
    "After the reverse-transcription reaction, set up the PCR mix. Add 30 μl nuclease-free water, 10 μl 10x Taq buffer, 30 μl 25 mM MgCl2, 7 μl 10 mM dNTP mix, 1 μl of each primer, and 1 μl Taq polymerase in all the tubes. \nRun the PCR program as in Part 3 for 9-14 cycles.\nPurify the DNA product as in step 3.3.\nMix 8 μl of DNA product with 2 μl DNA loading dye and electrophorese on 2% agarose at 100 V for 15-20 min (Figure 3).\nDNA product is ready to be transcribed to labeled RNA as in Part 4 and used for the next cycle of SELEX.\nPart 10: Representative Results\nIn SELEX experiments, the nature of Aβ40 oligomers used as the target, the quality of RNA used for each cycle, and successful RNA extraction and amplification after each cycle are important. We used PICUP to generate an oligomeric Aβ40 mixture for SELEX after purification and removal of the cross-linking reagents. The desalting experiments described in Part 2 usually lead to 50-55% protein loss. The protein amount and quality can be assessed using absorbance measurements (λ=280) and SDS-PAGE (Figure 1). The average absorbance profile of Aβ40 eluates from 5 individual experiments overlaying a typical SDS-PAGE profile of Aβ40 eluted in one of those experiments are shown in Figure 1. The data show that the protein consistently elutes off the column in fractions 3-5 and the cross-linking reagents elute after fraction 6 (increased absorbance in fraction 7, Figure 1). SDS-PAGE shows the typical Aβ40 oligomer distribution22. This distribution was reproducible after the protein fractions were lyophilized (2.11), treated with HFIP (2.11), resolubilized (7.1), and re-analyzed by SDS-PAGE.",
    "Integrity of RNA for each SELEX cycle is also important for iterative progression of SELEX, especially when nuclease-susceptible ribo-oligonucleotides are used. After RNA amplification and labeling (Part 4), the quality of labeled RNA can be assessed by TBE-urea-polyacrylamide gel electrophoresis. A typical profile of an intact labeled RNA product before and after G-50 purification (Part 5) is shown in Figure 2.\nAfter each SELEX cycle, RNA is extracted from the membrane after filter binding (Part 8) and reverse-transcribed (Part 9) to DNA for PCR amplification (Step 9.5). The DNA template from a previous cycle is then used to generate 32P-labeled RNA (Part 4) for the next cycle. If some contaminating DNA template from a previous cycle persists in the labeled RNA product after in-vitro transcription reactions (Part 4), the efficiency of SELEX cycles will be reduced, demanding more cycles. To control for this, after each SELEX cycle and the corresponding reverse-transcription PCR reaction, agarose electrophoresis is performed (9.12). Absence of DNA product in the negative-control reaction tubes (9.4) indicates successful removal of the DNA template originating from a previous SELEX cycle (Figure 3). If DNA amplification by PCR is observed in the negative-control tube, it is advised that the duration of incubation with RQ1 DNase (4.3) be prolonged. The manufacturer-recommended incubation duration with RQ1 DNase is 15 min, however, we found that longer incubations (4-5 h) were required to remove the template DNA completely (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/1955/1955fig1.jpgFigure 1. SDS-PAGE and absorbance profile of PICUP-generated, desalted Aβ40 oligomers. The absorbance profile from 5 individual desalting columns was averaged and overlain on a representative gel. Molecular weight markers are shown on the right.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1955/1955fig2.jpgFigure 2. TBE-urea-polyacrylamide gel electrophoresis of RNA product before and after G-50 purification. The migration direction of RNA product is from cathode to anode as indicated.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1955/1955fig3.jpgFigure 3. Agarose gel electrophoresis of DNA product after reverse-transcription and PCR amplification.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}