{
  "id": 18095,
  "origin_website": "Jove",
  "title": "Development and Functional Characterization of Murine Tolerogenic Dendritic Cells",
  "procedures": [
    "All studies were performed in compliance with procedures approved by the Case Western Reserve University School of Medicine's Institutional Animal Care and Use Committee.\n1. Prepare Bone Marrow-derived Dendritic Cells (BMDCs)\nSterilize all the surgical instruments via autoclaving and perform the experiment in class II biological safety cabinet with appropriated safety procedures.\nEuthanize C57BL/6 mice 8 - 10 weeks of age by using CO2 chamber. Place the mouse on a dissecting board and rinse with 70% ethanol. Excise tibia-fibula and femur bones by using a surgical scissor and place them with 70% ethanol in a 10 cm culture dish.\nUse surgical blades and forceps to dissect tissue away as much as possible on the lid of the 10 cm culture dish and isolate tibias and femurs to place them with 70% ethanol in a 6 cm culture dish.\nUse surgical blades to trim both ends of tibias and femurs. Use 3 mL PBS in 3 ml syringe with a 23G needle to flush the contents of marrow from one end of bones to a conical tube containing 12 ml PBS. Repeat this step 3x for each end of bones.\nCentrifuge the cell suspension at 300 x g for 5 min.\nRemove the supernatant and resuspend the cell pellet with 1 ml ACK lysing buffer for 5 mins to remove red blood cells.\nAdd 9 ml PBS to dilute ACK lysing buffer and centrifuge at 300 x g for 5 mins.\nRemove the supernatant and resuspend with 10 ml culture medium (RPMI-1640 plus L-glutamine, 10% FBS, 1% non-essential amino acid (100x), 10 mM HEPES, 50 nM β-mercaptoethanol, and 5% penicillin/streptomycin).\n\tNOTE: Endotoxin level has to be less than 0.1 EU/ml in FBS.",
    "Pass the cell suspension through a 40 μm cell strainer and take 20 µl of cell suspension and mix with 80 µl of trypan blue to count the number of live cells by using cytometer.\nAdjust the cell number to 1 x 106 cells/ml with 15 ng/ml GM-CSF and 10 ng/ml IL-4.\nPlate 3 ml of 1 x 106 cells/ml in each well of 6-well plate and incubate the cells at 37°C, 5% CO2, and 95% humidity in the CO2 incubator.\n\tNOTE: The bone marrow cells from one mouse is around 3 - 5 x 107 cells, indicating that it can be placed from 2 to 3 6-well plates.\nOn day 3, remove all 3 ml culture medium from each well, add 2 ml fresh PBS in each well, and then gently swirl the plate to ensure removing all the non-adherent cells.\nReplace 3 ml fresh culture medium with 15 ng/ml GM-CSF and 10 ng/ml IL-4 in each well. Incubate the cells at 37 °C, 5% CO2, and 95% humidity in the CO2 incubator.\nOn day 5, directly add another 3 ml fresh culture medium with 15 ng/ml GM-CSF and 10 ng/ml IL-4 in each well. Incubate the cells at 37°C, 5% CO2, and 95% humidity in the CO2 incubator.\n\tNOTE: The total volume in each well is now 6 ml.\nOn day 7, put the entire plate on ice for 10 mins. Gently pipette the culture medium in each well to dislodge the loosely-adherent BMDCs as iDCs into suspension.\n\tNOTE: The adherent macrophages are still attached to the plate. Low temperature and gently procedures are the key to avoid DC activation to affect further experiments.\nCentrifuge the cell suspension at 300 x g for 5 mins and resuspend with fresh culture medium for further experiments.",
    "NOTE: BMDCs can be identified with fluorescence-labeled CD11c antibody by flow cytometry and we showed our gating strategy of BMDCs for further experiments in Figure 1.\n2. Characterize TolDC Gene and Protein Profile\nPlate 2 ml of 1 x 106 BMDCs/ml per well in 6 well-plate with culture medium in the presence or absence of 100-400 nM CDDO-DFPA for incubating 1 h at 37°C, 5% CO2 and 95% humidity in the CO2 incubator.\n\tNOTE: CDDO-DFPA, a synthetic triterpenoid, is a nuclear factor (erythroid-derived 2)-like-2 factor (Nrf2) inducer and nuclear factor-κB (NF-κB) inhibitor. Apply other agents for induction of TolDCs from iDCs, such as IL-10, vitamin D3, dexamethasone or BAY 11-7085, and modify this step to an optimal condition for each agent.\nAdd 10 or 100 ng/ml of LPS for incubating 4-24 hrs to induce mDCs (incubation time is different due to mRNA or protein measurement).\nGently pipette the culture medium in each well and harvest the cell suspension by using 1 ml pipette. Centrifuge at 300 x g for 5 mins to collect the cells and supernatant, respectively.\nAnalyze the surface ligands from the cell pellets by flow cytometry, such as stimulatory ligands: CD40, CD80, CD86, MHC-II, OX40L, ICOSL, or inhibitory ligands: PD-L1, PD-L2, ILT3, ILT4.\nIsolate the RNA from the cell pellets and analyze the RNA and supernatant samples for the cytokine profile and gene and protein levels by quantitative real-time PCR (qRT-PCR) and ELISA, respectively.\n\tNOTE: For example, inflammatory cytokines: TNF-α, IFNγ, EDN-1, IL-6, IL-12, and IL-23, or anti-inflammatory cytokines: IL-4, IL-10, IL-15, TGF-β1, and HO-1.\n3. Evaluate the Function of TolDCs In Vitro and In Vivo\nT-cell Syngeneic Proliferation Assay\nSterilize all the surgical instruments via autoclaving and perform the experiment in class II biological safety cabinet with appropriated safety procedures.",
    "Prepare MACS buffer using 0.5% bovine serum albumin (BSA) and 2 mM EDTA in 500 ml PBS. Sterilize the buffer by filtering through a 0.2 µm filter.\n\t\tNOTE: Keep the buffer on the ice during the following experiment.\nTo obtain CD4+ T cells, euthanize OT-II T-cell receptor (TCR) transgenic mice 8-10 weeks of age by using CO2 chamber. Place the mouse on a dissecting board and rinse with 70% ethanol. Isolate the spleen from the left side of the abdomen by using surgical scissors and forceps.\nPut the spleen with 2 ml PBS in a 6 cm culture dish and use the back of push-stick of 3 ml syringe to mince the spleen by passing a 40 μm cell strainer.\nCollect the cell suspension and centrifuge at 300 x g for 5 mins.\nResuspend the cell pellet in 400 μl of MACS buffer.\nAdd 100 μl of CD4+ T Cell Biotin-Antibody Cocktail at 4°C for 5 mins.\n\t\tNOTE: The antibody cocktail binds on other cell types except CD4+ T cells, such as CD8a, CD11b, CD11c, CD19, CD25, CD45R (B220), CD49b (DX5), CD105, Anti-MHC class II, Ter-119, and TCRγ/δ.\nAdd 300 μl of MACS buffer and 200 μl of Anti-Biotin beads (Table of Materials) at 4°C for 10 mins.\nPlace the column composed of ferromagnetic spheres (Table of Materials) and Pre-Separation Filter together in the magnetic field and rinse it with 3 ml of MACS buffer.\nAdd 9 ml of MACS buffer in the cells and centrifuge at 300 x g for 5 mins.\nResuspend the cell pellet in 3 ml of MACS buffer and apply onto the column. Collect flow-through containing CD4+ T cells.\nWash column with another 3 ml of MACS buffer and also collect the flow-through.",
    "To obtain splenic pan DCs, euthanize C57BL/6 mice 8-10 weeks of age by using CO2 chamber. Place the mouse on a dissecting board and rinse with 70% ethanol. Isolate the spleen from the left side of the abdomen by using surgical scissors and forceps. Put the spleen in a 6cm culture dish containing 2 ml of collagenase D solution (2 mg/ml collagenase D dissolved in HBSS containing calcium, magnesium).\nInject 1 ml of collagenase D solution to the spleen two times with a 1 ml syringe and a 25G needle. Cut the spleen into small pieces with small scissors.\nShake and incubate at room temperature for 25 mins.\nAdd 500 μl of 0.5 M EDTA at room temperature for 5 mins.\n\t\tNOTE: The steps from 3.1.13-3.1.14 are critical for increasing the yield of DCs.\nNow use the back of push-stick of 3 ml syringe to mince the spleen slurry by passing a 40 μm cell strainer and collect the cell suspension by centrifuging at 300 x g for 5 mins.\nResuspend the cell pellet in 350 μl of MACS buffer, 50 μl of FcR Blocking Reagent, and 100 μl of Pan Dendritic Cell Biotin-Antibody Cocktail at 4°C for 10 mins.\n\t\tNOTE: The antibody cocktail against antigens that are not expressed by DCs.\nWash the cells by adding 9 ml of MACS buffer and centrifuge at 300 x g for 5 mins.\nResuspend the cell pellet in 800 μl of MACS buffer and add 200 μl of Anti-Biotin beads at 4°C for 10 mins.\nRepeat the steps from 3.1.9-3.1.11 to collect DCs.\nWash column with another 3 ml of MACS buffer two times and also collect the flow-through.",
    "Treat the 2 x 105 DCs/ml in the presence or absence of 100-400 nM CDDO-DFPA at 37°C for 1 hr. Seperately, label the CD4+ T cells (1 x 107/ml) with 1 μM CFSE at 37°C for 15 mins, wash with PBS, and readjust the volume to get final concentration at 2 x 106 T cells/ml.\nNext, in a 96-well plate, co-culture 100 μl of the treated dendritic cells with the same volume of CFSE-labeled CD4+ T cells, both collected from the above steps to get 1:10 ratio. Now add 100 ng/mL ovalbumin (OVA) peptide 323-329 per well and measure the CFSE intensity of the T cells by flow cytometry after 2-3 days of incubation.\n\t\tNOTE: The cell numbers and ratio of DCs and T cells have been optimized from our previous work37.\nInduce Passive EAE by Injecting BMDCs Pulsed with Myelin Oligodendrocyte Glycoprotein (MOG) (35-55)\nPlate 2 ml of 1 x 106 BMDCs/ml per well in 6 well-plate with culture medium in the presence or absence of 100-400 nM CDDO-DFPA for incubating 1 hr.\nAdd 10 ng/ml of LPS for incubating 24 hrs.\nAdd 100 μg/ml of MOG (35-55) for incubating 4 hrs.\nHarvest the cell suspension and centrifuge at 300 x g for 5 mins.\nResuspend the cell pellet with PBS and count the cells.\nSubcutaneously inject 200 μl of 2 x 106 cells to 8-10 weeks old female C57BL/6 mice (100 μl into each hind leg).\nOn the day of BMDC injection and 48 hrs. later, inject 200 ng of pertussis toxin (PTX) in each mouse.\nRepeat steps 3.2.6-3.2.7 once each week for 4 consecutive weeks.",
    "Evaluate the clinical symptoms of EAE daily by using standard criteria37 (0.5-limp tail end, 1-limp tail, 2-moderate hind limb weakness, 3-severe hind limb weakness, 4-complete hind limb paralysis, 5-quadriplegia or moribund state, 6-death).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}