{
  "id": 9066,
  "origin_website": "Jove",
  "title": "Intracerebroventricular and Intravascular Injection of Viral Particles and Fluorescent Microbeads into the Neonatal Brain",
  "procedures": [
    "All the experimental protocols were approved by the Animal Care Committee of Hamamatsu University of School of Medicine.\n1. Preparation of MCMV (Smith strain) and Recombinant M32-enhanced Green Fluorescent Protein (EGFP)-MCMV\nGenerate recombinant M32-EGFP-MCMV according to the method as follows (1.2 - 1.9) and as previously described8.\nUse recombinant viruses derived from the Smith strain of wild-type MCMV (accession number: U68299). Insert EGFP (4,361 base pairs; bp) between 37,089 and 41,450 bp (M32 - M31 locus) in the MCMV genome by homologous recombination.\nAmplify by polymerase chain reaction the MCMV M32 (41,450 - 39,286 bp, left flanking sequence and M31 (37,089 - 39,246 bp, right flanking sequence gene loci using the following primers: M32, 5′-CTACTAGCTAGCCTTCCGCGAGTCGCTGTATT-3′ (forward primer), 5′-CTACTAGCTAGCCTTCCGCGAGTCGCTGTATT-3′ (reverse primer); M31, 5′-CTAAATTAACTTAAGTCGTCCTCTTCGTCTCACAA-3′ (forward primer), 5′-AACTAGTCTAGATCGCTCCTGGTTGGTTTTTA-3′ (reverse primer).\nInsert the M32 locus into the EGFP-expressing vector using NheI and BamHI restriction sites. Insert the M31 locus into the M32-EGFP-recombinant plasmid using AflII and XbaI sites. Cleave the M32-EGFP-M31 sequence with NheI and AflII from the M32-EGFP-M31 recombination plasmid and dissolve in H2O.\nTransfect the cleaved construct into the nuclei of MCMV (Smith strain)-infected NIH3T3 cells 24 hr post-infection (hpi) using an electroporation system to induce homologous recombination.\nAt 3 days post-infection, co-culture the cells with uninfected mouse embryonic fibroblasts (MEFs) at a ratio of 1/1,000 in six-well plates and screen for EGFP-expressing foci of infected cells.\nHarvest the virus-containing supernatants from the wells containing green fluorescent foci and dilute tenfold. For purification, choose wells that display single green fluorescent foci.\nWhen all foci resulting from the limiting-dilution infection display EGFP expression, the virus preparation is pure, indicating that no wild-type virus remains. Quantify the virus by the plaque-assay method as previously described17.\nTreat MCMV in certified biosafety cabinets at biosafety level 2 wearing gloves and mask.",
    "Passage MCMV (Smith strain) and recombinant MCMV in MEFs prepared from 12-day-old ICR mouse embryos as previously described17.\nRemove cells from the supernatants of infected MEF cultures by centrifugation at 3,000 × g for 20 min at 16 °C.\nUltracentrifuge the supernatants for 40 min at 70,000 × g. Resuspend the pellets containing virions in 1 ml of Tris-buffered saline and transfer onto a preformed linear sorbitol gradient (25% - 70%). Ultracentrifuge again at 70,000 x g for 60 min18.\nHarvest the virion-containing band with a syringe. Pellet the harvested virions by an additional ultracentrifugation step at 70,000 × g for 40 min.\nResuspend the pellet in 1 ml of phosphate-buffered saline (PBS) and store at -80 °C until the infection experiments.\nQuantify the virus titer by the plaque-assay method as previously described19.\nVisualize the EGFP expression of the recombinant MCMV particles (excitation at 489 nm, emission at 508 nm) by fluorescent microscopy (Figure 1A) and the particle structure by transmission electron microscopy (TEM)8 (Figure 1B).\n2. Preparation of Nile Red Fluorescent Microbeads\nPurchase carboxyl fluorescent Nile red microbeads and place 500 µl of microbeads into tubes according to diameter (0.04 - 0.06 µm, approximately 3.63 × 1012 particles; 0.1 - 0.3 µm, approximately 5.75 × 1010 particles; and 1.7 - 2.2 µm, approximately 6.85 × 107 particles).\nTreat beads with 500 µl of 0.1 M NaOH for approximately 1 day to remove any endotoxins and resuspend the beads in sterile water at RT.\nAdsorb the beads O/N with 10% mouse serum obtained from C57BL/6 mice at RT prior to use.\nTo separate aggregates, vortex the beads and sonicate thoroughly before use.\n3. ICV Injection of MCMV and Fluorescent Microbeads into Neonatal Mice",
    "Maintain normal pregnant ICR mice in a temperature-controlled facility under a 12 hr light/dark cycle. The neonates are designated as P 0.5 on the day of birth.\nSterilize a 10-µl syringe and a 27 G needle with 70% alcohol.\nLoad the injection solution (5 µl) containing MCMV or fluorescent microbeads into the needle by carefully pulling the plunger of the syringe.\nRestrain neonatal mouse (P 0.5) by putting the mouse on ice for 3 - 4 min. Once the animal is under anesthesia, use the toe-pinch response method to determine the depth of anesthesia.\nMark the injection site with a non-toxic laboratory pen at a location approximately 0.7 - 1.0 mm lateral to the sagittal suture and 0.7 - 1.0 mm caudal from the neonatal bregma (Figure 2A).\nInsert the needle 2 mm deep, perpendicular to the skull surface at the marked injection site. For reference, mark 2 mm from the tip of needle with a non-toxic maker.\nSlowly inject 5 µl of MCMV (approximately 5 × 105 PFU) into the lateral ventricle without opening the scalp (Figure 2B).\nIn another group of mice, inject a 5 µl solution containing fluorescent microbeads (0.1 - 0.3 µm, approximately 5.75 × 108 particles) by the same method.\nSlowly remove the needle 10 - 20 sec after discontinuing the plunger movement to prevent backflow.\nTo recover, keep the mice for 5 - 10 min in a warm container until movement and general responsiveness are restored.\nHarvest the brains as described in section 5 at a range of time points (3, 12, 24, 48, and 72 hr) post-injection.\n4. IV Injection of MCMV or Fluorescent Microbeads into Neonatal Mice\nRestrain neonatal mouse (P 0.5) by putting the mouse on ice for 3 - 4 min.",
    "Use a 1-ml syringe with a 35 G needle to perform the intravenous injection of MCMV in P 0.5 neonates.\nUse a transilluminator (vein finder) to visualize the superficial temporal (facial) vein. Before injection, secure the neonate to the transilluminator using surgical tape (Figure 2C).\nWhile wearing magnifying glasses (1.5X), slowly infuse 50 µl of MCMV (approximately 5.45 × 109 particles) or fluorescent microbeads (0.04 - 0.06 µm, approximately 3.63 × 1011 particles; 0.1 - 0.3 µm, approximately 5.75 × 109 particles; and 1.7 - 2.2 µm, approximately 6.85 × 106 particles) into the superficial temporal vein (Figure 2D).\nAfter removing the needle, use gauze containing 70% alcohol to apply pressure to the injection site until the bleeding ceases.\nGive the neonate approximately 5 min in a warm container to recover before returning it to the cage.\nHarvest the brains as described in section 5 at a range of time points (3, 12, 24, and 72 hr) post-injection.\n5. Brain Tissue Sample Preparation for Paraffin Sections\nPlace the injected neonates in a small plastic dish on crushed ice.\nOnce the animal is under anesthesia, use the toe-pinch response method to determine the depth of anesthesia.\nMake one central or two end horizontal end cuts through the rib cage to open up the thoracic cavity.\nMake a cut in the atrium with sharp scissors. Infuse 4% paraformaldehyde (PFA) solution into the atrium. Stop perfusion when spontaneous movement (PFA dance) and lightened-color of the liver are observed. Do not exsanguinate.\nDissect the neonate (as previously described20) by first removing the head using a pair of scissors.\nMake a midline incision along the integument from the neck to the nose to expose the skull.",
    "Place the sharp end of a pair of iris scissors into the foramen magnum on one side, carefully sliding along the inner surface of the skull.\nMake a cut extending to the distal edge of the posterior skull surface, and make an identical cut on the contralateral side. Clear away the skull around the cerebellum.\nCarefully peel back the skull on one side to prevent damage to the brain. Repeat this procedure on the other side of the brain.\nUsing a spatula, sever the olfactory bulbs and nervous connections along the ventral surface of the brain.\nGently separate the brain from the head, trimming any dura that still connect the brain to the skull using scissors, and remove the brain.\nPlace the brain in a vial of fixative containing 4% PFA at least 10 times the volume of the brain for 24 hr at 4°C.\nDehydrate the tissue through a series of graded ethanol baths to displace the water, and then infiltrate with paraffin wax, forming a block. Cut the paraffin block with a microtome into slices 4 µm thick21.\nDeparaffinize and rehydrate the slides of the infected brains22. Proceed to in situ hybridization for paraffin embedded sections.\n6. Brain Tissue Sample Preparation for Frozen Sections\nRemove the brain following the steps outlined in 5.1 - 5.11.\nTo observe the fluorescent microbeads and M32-EGFP-MCMV, place the resected brain on flat bottom cryomolds. Add embedding medium to completely cover the brain sample. Snap freeze the cryomolds in precooled n-hexane (-80 ºC), using forceps to hold the edge of the cryomolds prior to attaching it to the chuck.",
    "For sectioning, attach the frozen tissue block on the precooled cryostat chuck. Transfer the frozen tissue with the chuck into a cryostat chamber and lower the temperature to between -10 and -20 °C, and cut the slices approximately 8 - 10 µm thick23.\nFix the sections with cytofixative (mixture of isopropyl alcohol and polyethylene glycol) by spraying. Air dry the sections for 30 min at RT immediately after spraying, and store them at - 80 ºC until further use.\nEquilibrate the sections back to RT and wash three times with PBS.\nStain the sections with fluorescein isothiocyanate (FITC)-conjugated Griffonia simplicifolia isolectin B4 at a concentration of 1:100 for 10 min in PBS at RT (Figure 5) or with PE-conjugated CD31 antibody at a concentration of 1:100 for 30 min in PBS at RT (Figure 6).\nWash the sections with PBS three times.\nAfter the washing, stain the sections with 4′,6-diamidino-2-phenylindole (DAPI) to visualize cell nuclei. Mount the sections in anti-fade reagent and image DAPI (excitation at 345 nm, emission at 455 nm), EGFP (excitation at 489 nm, emission at 508 nm), and Nile red (excitation at 553 nm, emission at 637 nm) with a fluorescent microscope (Figures 3, 5, 6).\n7. Fluorescent in situ Hybridization (FISH) for Paraffin Embedded Sections\nPrepare the FISH probe labeled directly with fluorophore for DNA in situ hybridization by nick translation using a bacterial artificial chromosome containing the whole MCMV DNA genome (pSM3fr)19. The concentration of the FISH probe is 0.1 µg/µl.\nDeparaffinize and rehydrate the slides of the infected brains22.\nTreat the tissue sections with RNase (100 µg/ml in PBS) to detect viral DNA.\nPerform antigen retrieval with a 0.05% NP40, 0.01 M citrate buffer (pH 6.0) at 95 - 98°C for 20 min. Cool the slides down to RT for 20 min.",
    "In a glass Coplin staining jar, wash the slides in pure water three times for 2 min each time. Perform an additional antigen retrieval step with a 0.06% pepsin, 0.01 N HCl solution for 5 min at 37 °C.\nRinse slides three times in pure water for 2 min each time in a glass Coplin staining jar.\nDehydrate the tissue sections again by transferring the slides from 70% ethanol, to 85% ethanol, and then to 100% ethanol.\nFor preparing 10 ml of the hybridization buffer, mix 1.25 ml in situ hybridization salts (3 M NaCl, 100 mM Tris-HCl pH 8.0, 100 mM sodium phosphate pH 6.8, 50 mM EDTA) with 5 ml deionized formamide, 2.5 ml 50% Dextran sulfate, 250 µl 50x Denhardt's solution, 125 µl 100 mg/ml tRNA, and 875 µl H2O.\nDilute the DNA probe directly labeled with fluorophores that recognize the whole MCMV genome randomly in the hybridization buffer. The final volume should be 10 µl (7 µl hybridization buffer, 1 µl probe (0.1 µg/µl), and 2 µl distilled water).\nAdd the probe mix (10 µl) to each slide and cover with a coverslip (15 × 15 mm). Seal the coverslip with rubber cement. Denature the probe mix for 5 min at 85 °C, and complete the hybridization step O/N at 42 °C.\nWash the slides with 0.3% NP40, 0.4x SSC at 73°C for 2 min; with 0.1% NP40, 0.4x SSC at 73 °C for 1 min; and with 2x SSC twice.\nCounterstain the nuclei with DAPI (10 ng/ml) and cover the slide with a coverslip.\nMount the sections in anti-fade reagent and image DAPI (excitation at 345 nm, emission at 455 nm) and EGFP (excitation at 489 nm, emission at 508 nm) with a fluorescent microscope (Figure 4).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}