{
  "id": 11807,
  "origin_website": "Jove",
  "title": "Automatic Separation and Collection of Cancer-Related Substances from Clinical Samples",
  "procedures": [
    "All whole blood samples were obtained from lung cancer patients. The research and analysis at Clinomics are carried out by the Cancer Genomics Research Institute, and IRB research approval by the government is led by the Asan Medical Center Institutional Review Committee (IRB NO. 2021-0802) with the IRB number registered for research at Clinomics.\n1. Sample preparation\nCollect 9 mL of whole blood into an EDTA or cfDNA-stable blood collection tube.\nMix well by flipping the tube up and down approximately 10 times.\nStore the samples at room temperature (RT; for short-term storage) or 4 °C (for long-term storage). Do not freeze and thaw.\n2. Device preparation\nPress the power switch to turn on the instrument.\n\tNOTE: A loading screen appears on the touchpad, and the instrument is initialized. Keep hands away from the instrument during the initialization. The cartridge selection screen appears after the instrument initialization is completed.\nSelect the sample mode to be used. Change the number of samples by pressing the arrow.\n3. Device operation and sample collection\nLoading of the LBx-1 cartridge\n\t\nSelect the cartridge type on the touchscreen panel of the instrument. Change the number of samples by pressing the arrow button.\nOpen the door of the instrument and insert all the cartridges to be used in order of the number on the cartridge holder. Make sure to correctly insert the cartridge and the cartridge holder. If the cartridge is not inserted correctly, it may cause considerable damage to the instrument.\nFor a total of four cartridges, place the dummy cartridge in the empty space of the cartridge holder.\nUse the support wheel to mount the cartridge and tighten the lock nut to secure it.",
    "Close the door and press the RUN button on the touchpad screen. The instrument closes the valves on the cartridges, which takes approximately 30 s.\nFollow the message to open the door, remove the support wheel, and remove the valve-closed cartridge from the cartridge holder.\nPlace the cartridge on the table and prepare to inject the whole blood sample. Pipette a maximum of 10 mL of whole blood sample using a serological pipette.\n\t\tCAUTION: Dangers of handling blood. During the entire procedure of handling blood samples and reagents, it is important to wear a laboratory coat and laboratory gloves. The provided MSDS should be thoroughly studied by the laboratory workers.\nInsert the pipette tip deep into the sample inlet of the cartridge and slowly inject the whole blood sample.\n\t\tNOTE When using more than or equal to 9 mL of whole blood sample, no phosphate buffered saline (PBS) addition is necessary. When using less than 9 mL of whole blood sample, add PBS to make the total volume to 9 mL. For example, when using 7.2 mL of whole blood, please add 1.8 mL of PBS into the sample inlet. A serological pipette or a pipette tip can be used for the injection of whole blood and PBS. When using less than 8 mL of whole blood sample, the buffy coat may not be recovered even by adding 1 mL of PBS. For gDNA prep, use 200 µL of whole blood, which was separated before this step.\nInsert the cartridges to be used in order of the number on the cartridge holder. Use the support wheel to mount the cartridge and tighten the lock nut to secure it. Close the door and press the OK button.",
    "NOTE: Plasma and buffy coat are separated from whole blood automatically, which takes approximately 30 min.\n\t\tCAUTION Danger during operation. Opening the door or touching the instrument during high-speed rotating operations can cause serious injuries. There is also a risk of injury due to asymmetric loading of the rotor. If unusual vibrations and noises occur when the instrument starts at assisted cell enrichment or expert mode, cartridge placement may be asymmetrical. Immediately press the power key to stop and properly install the cartridge.\nLook for the message on the screen accompanied by an alarm sound, which appears when the separation of plasma and buffy coat is complete.\nStop the alarm by opening the door or pressing the STOP button. Open the door, remove the cartridge, and place it on the table.\nRecover 3 mL of plasma from the plasma outlet using a 1 mL pipette tip. Recover the buffy coat of 3 mL from the buffy coat outlet using a 1 mL pipette tip.\nLoading the LBx-2 cartridge\n\t\nSelect the cartridge name on the touchscreen panel of the instrument. Change the number of samples by pressing the arrow button.\nOpen the door and insert the cartridges to be used in order of the number on the cartridge holder.\nFor a total of four cartridges, place the dummy cartridge in the empty space of the cartridge holder.\nUse the support wheel to mount the cartridge and tighten the lock nut to secure it. Ensure to correctly insert the cartridge in the cartridge holder. If the cartridge is not inserted correctly, it may cause considerable damage to the instrument.\nClose the door and press the RUN button on the touchpad screen. The instrument closes the valves on the cartridge, which takes approximately 30 s.",
    "Follow the message to open the door, remove the support wheel, and remove the valve-closed cartridge from the cartridge holder and place it on the table.\nPlace the cartridge on the table and prepare to inject the density gradient solution and the whole blood sample. Check the volume of the density gradient solution and PBS to be injected depending on the volume of the whole blood sample (Supplementary Table 1).\nPipette the density gradient solution using a serological pipette. Insert the pipette tip deep into the inlet of the cartridge and slowly inject the density gradient solution.\nAfter injecting the density gradient solution, pipette the whole blood sample using a serological pipette. Insert the pipette tip deep into the sample inlet of the cartridge and slowly inject the whole blood sample.\n\t\tNOTE: When using less than 9 mL of the whole blood sample, add PBS by referring to this table (Supplementary Table 1).\nInsert the cartridges to be used in order according to the number on the cartridge holder. Use the support wheel to mount the cartridge and tighten the lock nut to secure it. Close the door and press the OK button.\nPlasma and PBMC are separated from whole blood automatically, which takes approximately 30 min. Look for the message that appears accompanied by an alarm sound, when the separation of plasma and PBMC is complete.\nStop the alarm by opening the door or pressing the STOP button. Open the door, remove the cartridge, and place it on the table.\nRecover 3 mL of plasma from the plasma outlet using a 1 mL pipette tip. Recover 3 mL of the PBMC from the PBMC outlet using a 1 mL pipette tip.\nLoading the FAST-auto cartridge",
    "Select the cartridge on the touch screen panel of the instrument. Change the number of samples by pressing the arrow button.\nOpen the door and insert the cartridges to be used in order of the number on the cartridge holder. For a total of four cartridges, place the dummy cartridge in the empty space of the cartridge holder.\nUse the support wheel to mount the cartridge and tighten the lock nut to secure it.\nClose the door and press the RUN button on the touch pad screen. The instrument closes the valves on the cartridge, which takes approximately 30 s.\nFollow the message to open the door, remove the support wheel, and remove the valve-closed cartridge from the cartridge holder.\nPlace the cartridge on the table and prepare to inject the PBS solution and whole blood sample. Pipette 6 mL of PBS solution using a serological pipette. Insert the pipette tip deep into the PBS inlet of the cartridge and slowly inject 6 mL of the PBS solution.\nAfter injecting the PBS solution, pipette 3 mL of whole blood or PBMC sample obtained from LBx-2 using a serological pipette, which was previously rinsed with 1% BSA to prevent sticking of the residue. Insert the pipette tip deep into the sample inlet of the cartridge and slowly inject the whole blood sample.\nInsert the cartridges to be used in order of the number on the cartridge holder. Use the support wheel to mount the cartridge and tighten the lock nut to secure it. Close the door and press the OK button.",
    "CTCs are enriched from whole blood automatically, which takes approximately 15 min. Look for a message that appears accompanied by an alarm sound when the enrichment of CTCs is complete. Stop the alarm by opening the door or pressing the STOP button.\nOpen the door, remove the cartridge, and place it on the table. Insert the back plate remover (BPR) into the four holes on the front of the cartridge. Press the dark blue wing with the thumbs of both hands, and then press the light blue body until it clicks.\nCarefully remove the cartridge body by lifting it up. Very gently pick up the filter membrane by the edge using a tweezer. Please make sure to use the outer rim (the 1 mm wide edge part) of the filter membrane to pinch and hold the filter membrane.\nCarefully place the filter membrane (on which enriched CTCs are residing) into a 1.5 mL tube for nucleic acid preparation. If necessary, recover the filtered blood to the blood outlet using a 1 mL pipette tip.\n4. Maintenance of the system\nPreparation for cleaning and disinfection of the instrument\n\t\nClean all the accessible surfaces of the instrument and the accessories once a week using ethanol and dried tissue, and also immediately when contaminated.\nClean the bowl and rotor shaft regularly using alcohol (ethanol and isopropanol) or alcohol-based disinfectants.\nCleaning and disinfecting the instrument\n\tNOTE: For general troubleshooting and other notes on the machine, refer to Supplementary Table 2.\n\t\nSwitch off the instrument using the main power switch. Disconnect the power plug from the power supply.\nOpen the door and clean and disinfect all the accessible surfaces of the instrument, including the power cable, using a damp cloth and the recommended cleaning agents.",
    "Check the rotor shaft for damage. Inspect the instrument for corrosion and damage.\nConnect the instrument to the power supply only if it is fully dry inside and out.\nDisconnect the main power plug and remove the fuse holder. The fuse holder is located above the power socket. Replace the used fuse with a spare one from the container.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}