{
  "id": 15976,
  "origin_website": "Jove",
  "title": "Production of siRNA-Loaded Lipid Nanoparticles using a Microfluidic Device",
  "procedures": [
    "1. Fabrication of the iLiNP device\nNOTE: The iLiNP device is fabricated using the standard soft lithography method18. The detailed fabrication protocol was reported previously10,13.\nSU-8 mold fabrication\n\t\nPour SU-8 3050 onto a 3-inch silicon wafer. Spin coat the silicon wafer to obtain a 100 µm thick SU-8 layer.\nBake the silicon wafer by placing on a hotplate at 65 °C for 5 min and 95 °C for 45 min.\nAfter baking, place the silicon wafer on the stage of a desktop maskless lithography system.\nExpose the silicon wafer to UV light at 365 nm for 1.5 s per one position.\n\t\tNOTE: A desktop maskless lithography system was used in this experiment. The system automatically exposes UV light at a divided irradiation area (one position) of the microchannel.\nAfter UV irradiation, bake the silicon wafer on the hotplate at 65 °C for 1 min and 95 °C for 5 min.\nCool the silicon wafer, and then soak in a SU-8 developer for 15 min to remove unexposed SU-8.\nTreat the SU-8 mold withvapor of Trichloro(1H,1H,2H,2H-perfluorooctyl)silane using a desiccator and vacuum pump.\nFabrication of the iLiNP device\n\t\nMix the silicone base and polydimethylsiloxane (PDMS) curing agent in a 10:1 ratio (w/w).\nDegas the mixture using a vacuum pump and a desiccator.\n\t\t​NOTE: PDMS was degassed using a vacuum pump for 10 min at room temperature.\nPour the degassed PDMS onto the SU-8 mold in a 100 mm Petri dish up to 0.5 to 1 cm thickness, followed by baking in an oven at 80 °C for 1 h.\nCool the mold, and then peel the PDMS substrate from the SU-8 mold using a tweezer.",
    "Punch three holes (0.5 mm) in the PDMS substrate. Bond the PDMS substrate and a glass slide using an oxygen plasma cleaner to build an iLiNP device (see Figure 1)13.\nConnect three PEEK capillaries (I.D. 0.3 mm, O.D. 0.5 mm) to the inlets and outlet of the iLiNP device and cure with a superglue.\n\t\t​NOTE: The length of the PEEK capillaries is adjustable and depends on the experiment.\n2. Preparation of lipid solutions\nPrepare lipid/ethanol solutions: 13.4 mM 1-palmitoyl-2-oleoyl-sn-glycero-3-phosphocholine (POPC), 10 mM 1,2-Distearoyl-sn-glycero-3-phosphocholine (DSPC), 20 mM 1,2-dioleoyloxy-3-trimethylammonium propane (DOTAP), 5 mM 1,2-dimyristoyl-rac-glycero-3-methoxypolyethylene glycol-2000 (DMG-PEG2k), and 20 mM cholesterol. Store the stock solutions at -20 °C prior to the experiment.\nTo produce the siRNA-loaded LNPs, mix DOTAP, DSPC, cholesterol, and DMG-PEG2k solutions at a molar ratio of 50/10/38.5/1.5. The total lipid concentration is adjusted to 8 mM.\n3. Preparation of aqueous solutions\nPrepare aqueous solutions: 154 mM NaCl (saline), 25 mM acetate buffer at pH 4.0 using DNase/RNase-free distilled water.\nFilter the solutions through 0.2 µm sized membrane filters or syringe filters.\n4. Preparation of the siRNA/buffer solution\nDissolve 70 µg of siGL4 into 1 mL of 25 mM acetate buffer (pH 4.0).\n\tNOTE: siGL4 is used for the knockdown of luciferase gene.\n5. Set up of the iLiNP device and production of LNPs\nNOTE: See Figure 1 for the schematics.\nFill 1 mL glass syringes with lipid and aqueous solutions (from steps 3.1 and 4.1 in individual syringes), respectively.\n\tNOTE: Adjust the lipid and aqueous solution volume depending on the amount required for the LNP evaluation experiment.\nConnect the glass syringes to the PEEK capillaries using syringe connectors.\nSet the flow rate of the lipid and aqueous solutions.\n\tNOTE: The flow rate ratio (FRR) of the aqueous phase to the lipid phase is ranged from 3:1 to 9:1.",
    "Introduce the lipid and aqueous solutions separately into the iLiNP device using syringe pumps.\nCollect LNP suspensions in a microtube from the outlet of the iLiNP device (Figure 1).\n6. Dialysis of the LNP suspension and LNP size measurement\nDialyze the LNP suspension using a dialysis membrane (12−14 kDa MW cutoffs) at 4 °C overnight against saline or D-PBS for POPC LNPs and siRNA-loaded LNPs, respectively.\n\tNOTE: POPC is not dissolved into saline (Please see 2.1). POPC/ethanol solution is diluted with saline in the iLiNP device.\nCollect the dialyzed LNP suspensions in microtubes.\nPipette 20-30 µL of the LNP suspension to a micro quartz cell.\nMeasure the LNP size, LNP size distribution, and polydispersity index by dynamic light scattering (DLS).\n7. Measurement of Z-potential of the LNP\nNOTE: For the measurement of Z-potential, a particle analyzer (see Table of Materials) was used following the manufacturer's instruction.\nDilute the LNP suspension obtained from step 6.1, 35 times with 10 mM HEPES buffer (pH 7.4).\nPipette 700 to 1000 µL of the diluted LNP suspension to a capillary cell.\nMeasure the Z-potential as per the manufacturer's instruction.\n8. siRNA encapsulation efficiency by RiboGreen assay\nNOTE: Ribogreen assay is performed to evaluate the siRNA encapsulation into LNPs19. Ribogreen assay can measure the amount of RNAs inside and outside of LNPs with/without a surfactant (e.g., TritonX-100).\nDilute 2 mg/mL of siGL4 with 10 mM HEPES buffer (pH 7.4) to 500 ng/mL siGL4 solution.\nPrepare the dilution series (0, 12.5, 25, 50, 100, 200 ng/mL) of siGL4 solution to make a calibration curve for Triton (+) and Triton (-) samples.\nDilute the LNP suspension 100 times with 10 mM HEPES buffer (pH 7.4).",
    "Mix the following for Triton (+) solution: 980 µL of 10 mM HEPES (pH 7.4), 20 µL of 10% w/v TritonX-100, and 1.25 µL of RiboGreen for 10 wells of a 96-well microplate.\nMix the following for Triton (-) solution: 1000 µL of 10 mM HEPES (pH 7.4) and 1.25 µL of RiboGreen for 10 wells of a 96-well microplate.\nPipette 100 µL of the dilution series of siGL4 solution and diluted LNP suspensions into the wells of a black 96-well microplate.\n\tNOTE: The dilution series of siGL4 solution and diluted LNP suspensions were dispensed into four microwells per condition.\nPipette 100 µL of the detection solution (TritonX-100 (+) or Triton (-)) into the wells.\n\tNOTE: The detection solution (TritonX-100 (+)) was dispensed into two wells per sample per condition, and the TritonX-100 (-) solution was dispensed into the remaining two wells per sample condition.\nIncubate the microplate for 5 min at room temperature.\nMeasure the fluorescence intensity using a microplate readerat a wavelength of 475 nm.\nCalculate the siRNA encapsulation efficiency from the following equation19.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62999/62999eq01.jpg\n9. Cell culture\nPrepare a growth medium containing DMEM, heat-inactivated 10% FBS, 100 U/mL penicillin, 100 µg/mL streptomycin, and 400 µg/mL G418.\nCulture HeLa cells stably expressing firefly and Renilla luciferase (HeLa-dluc) in a 100 mm TC-treated cell culture dish containing the growth medium at 37 °C in a 5% CO2 incubator.\n10. Cell viability assay\nSeed 100 µL of a suspension of HeLa cells in the growth medium (6 x 103 cells/well) in a 96-well microplate.\n\tNOTE: Cells were counted using a cell counter plate and a microscope.\nIncubate the microplate for 24 h at 37 °C in a 5% CO2 incubator.\nDilute the siRNA-loaded LNPs with DMEM (FBS (-)) at the concentrations of 10 and 100 nM siRNAs.",
    "Dispense 100 µL of the diluted siRNA-loaded LNP suspension per well.\nIncubate the microplate for 4 h at 37 °C in a 5% CO2 incubator.\nRemove the LNP suspension and add 100 µL of DMEM (FBS (+)).\nIncubate the microplate for 20 h at 37 °C in a 5% CO2 incubator.\nMeasure the cell viability using a commercially available kit according to the manufacturer's protocol.\n\tNOTE: D-PBS (-) was used as the negative control.\n11. Luciferase gene knockdown assay\nSeed 75 µL of a suspension of HeLa cells in the growth medium (4.5 x 103 cells/well) in a 96-well microplate.\nIncubate the microplate for 24 h at 37 °C in a 5% CO2 incubator.\nDilute the siRNA-loaded LNPs with DMEM (FBS (-)) at the concentrations of 10 and 100 nM siRNAs.\nDispense 75 µL of the diluted siRNA-loaded LNP suspension per one well.\nIncubate the microplate for 4 h at 37 °C in a 5% CO2 incubator.\nRemove the LNP suspension and add 75 µL of DMEM (FBS (+)).\nIncubate the microplate for 20 h at 37 °C in a 5% CO2 incubator.\nMeasure the luciferase expression using a commercially available kit according to the manufacturer's protocol.\n\tNOTE: We used D-PBS (-) as the negative control."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}