{
  "id": 7780,
  "origin_website": "Bio",
  "title": "Continuous Measurement of Reactive Oxygen Species Formation in Bacteria-infected Bone Marrow–derived Macrophages Using a Fluorescence Plate Reader",
  "procedures": [
    "Precautions Note:  Salmonella enterica serovar Typhimurium is a biosafety level 2 bacterium with low-to-moderate hazard potential to personnel and the environment. Make sure to follow all relevant national and institutional regulations. Contact the Institutional Biosafety Committee (IBC) before planning the work with Salmonella enterica serovar Typhimurium (Burnett et al., 2009; Byrd et al., 2019)Use appropriate personal protective equipment and disinfectantsWork in a biosafety level 2 laminar flow cabinetCollect and autoclave wasteGenerate the bone marrow–derived macrophages (BMDM) as described in Brigo et al. (2022) Note: Perform next steps in a sterile laminar flow cabinet. Anesthetize a wildtype C57BL/6N mouse by injecting 50 µL of 100 mg/kg ketamine + 10 mg/kg xylazine intraperitoneally.Note: A video demonstrating the general procedure can be found at: Intraperitoneal Injection in the Mouse: https://researchanimaltraining.com/articles/intraperitoneal-injection-in-the-mouse/[href=https://researchanimaltraining.com/articles/intraperitoneal-injection-in-the-mouse/].Euthanize the deeply anesthetized mouse by cervical dislocation. Thereafter, place a large tweezer behind the base of the anesthetized mouse's skull and pull back sharply on the tail at a 45° angle.Fix the animal on a Styrofoam panel and spray the surface of the animal with 75% alcohol.Remove skin and muscle tissue from the leg by cutting upwards from the heel with sterile scissors.Cut around the femur head.Cut in the middle of the knee joint. Make sure that the bones are not damaged.Cut the ankle joint.Remove excess muscles with a tissue paper.Pull on the upper leg to remove the femur head from the hip joint.Place the bones into PBS containing 1% penicillin and 1% streptomycin (Pen-Strep) on ice.The next steps should be performed on ice.Open the ends of the bones by cutting with a pair of sterile scissors.Place a 40 µm cell strainer on a 50 mL polypropylene tube.Flush out the bone marrow:Use a disposable hypodermic needle and a 5 mL syringe.Fill the syringe with PBS containing 1% penicillin and 1% streptomycin.",
    "Place a needle on one end of the opened bone.Flush the bone marrow out onto the 40 µm cell strainer.Repeat flushing of the bone until it is completely white.Wash the cell strainer with 10 mL of PBS containing 1% penicillin and 1% streptomycin.Use the plunger of the syringe to strain the cells through the cell strainer.Wash the cell strainer with 10 mL of PBS containing 1% penicillin and 1% streptomycin.Centrifuge the 50 mL polypropylene tube containing the flushed bone marrow at 300 × g for 5 min at 4°C.Dilute the M-Lyse buffer concentrate (10×) from the mouse erythrocyte lysis kit 1:10 with aqua bidest.Discard the supernatant.Resuspend the pellet in 2 mL of diluted M-Lyse buffer concentrate (1×).Incubate at room temperature for 3 min. Add 15 mL of PBS containing 1% penicillin and 1% streptomycin on top of the M-Lyse buffer concentrate (1×).Centrifuge the 50 mL polypropylene tube containing the flushed bone marrow at 300 × g for 5 min at 4°C.Discard the supernatant.Resuspend the pellet in 15 mL of PBS containing 1% penicillin and 1% streptomycin.Centrifuge the 50 mL polypropylene tube containing the flushed bone marrow at 300 × g for 5 min at 4°C.Discard the supernatant.Resuspend the pellet in 15 mL of PBS containing 1% penicillin and 1% streptomycin.Centrifuge the 50 mL polypropylene tube containing the flushed bone marrow at 300 × g for 5 min at 4°C.Discard the supernatant.Resuspend the cell pellet in 45 mL of DMEM supplemented with 10 % FBS, 1% L-glutamine, 1% penicillin, 1% streptomycin, and 50 ng/mL of recombinant murine M-CSF.Pipette 15 mL of the cell suspension into three 15 cm dishes and place them into a cell incubator with the following growth conditions: 5% CO2, 37°C, and 95% humidity.Change the medium every second day.On day 5, cells can be harvested.",
    "Harvesting, counting, and seeding of cells Note: Perform next steps in a sterile laminar flow cabinet. Remove the culture medium from the 15 cm cell culture dish using a cell culture aspiration pump.Wash the cells twice with 10 mL of PBS.Add 8 mL of DMEM supplemented with 10% FBS and 1% L-glutamine.Scrape the cells using a disposable cell scraper.Transfer the cells into a 50 mL polypropylene tube.Wash the dish with another 2 mL of DMEM.Transfer the washing medium into the 50 mL polypropylene tube containing the cells.Close the tube and invert the cells 2–3 times.Take 9 µL of the cell suspension and place it in a 0.5 mL Eppendorf tube.Mix 1 µL of the acridine orange/propidium iodide stain solution to the cell aliquot.Pipette 10 µL of the mixture into a Luna cell counting slide.Measure the cell number using the LUNA automated cell counter.Seed the cells at a density of 1.5 × 105 cells/mL in a 24-well plate. Note: Approximately 4.5 × 107 cells are gained from one mouse after isolating and culturing the bone marrow of both hind legs.   Preparation of Salmonella Typhimurium (S.tm) stock as described in Brigo et al. (2022)  Take an aliquot of Salmonella enterica serovar Typhimurium ATCC14028 from the -20°C storage.Thaw the aliquot at room temperature.Note: Perform next steps in a sterile biosafety level 2 laminar flow cabinet. Pipette 10 µL of S.tm into 10 mL of LB medium in a 250 mL Erlenmeyer flask and cover the top of the flask using a tin foil.Incubate at 37°C overnight in a shaking incubator at 200 rpm.The following day, pipette 50 µL of the overnight culture into fresh 10 mL of LB medium in a 250 mL Erlenmeyer flask and cover the top with tin foil.Dispose of the remaining overnight culture of S.",
    "tm and wash and sterilize the 250 mL Erlenmeyer flask.Incubate the culture at 37°C for 1–2 h at 200 rpm in a shaking incubator.Calibrate a photometer using 500 µL of LB medium in a disposable cuvette as blank.Measure OD600 to check if S.tm reached 0.5.Note:  S. tm reaches the optimal logarithmic growth phase when OD600 is between 0.5 and 0.7. If the OD600 value is below 0.5, continue the incubation of the culture in the 250 mL Erlenmeyer flask as described above until the OD600 value of 0.5 is reached. Of note , S. tm density duplicates every 20 min. If the OD600 value is above 0.7, dilute the culture 1:1 with LB medium and incubate the culture in the 250 mL Erlenmeyer flask until an OD600 value of 0.5.  Transfer the culture into a 50 mL Falcon tube.Centrifuge the S.tm culture at 4,600 × g for 5 min at room temperature.Remove the supernatant by using a vacuum pump.Resuspend the pellet in 1 mL of freshly prepared LB medium with 30% glycerol.Prepare 50 µL aliquots in 0.5 mL Eppendorf tubes.Store the aliquots at -20°C. Culturing and counting of S.tm  Notes:  Perform next steps in a sterile biosafety level 2 laminar flow cabinet. The procedures of culturing and counting of S.tm have been recently described in Brigo et al. (2022). Thaw an aliquot of S.tm at room temperature.Pipette 10 µL of the S.tm aliquot to 10 mL of LB medium in a 250 mL Erlenmeyer flask overnight at 37°C in a shaking incubator at 200 rpm after covering the top with tin foil.The next day, prepare 10 mL of LB medium and pipette 50 µL of the overnight culture in a fresh 250 mL Erlenmeyer flask.Dispose of the remaining overnight culture and wash and sterilize the Erlenmeyer flask.",
    "Incubate at 37°C with shaking for 1–2 h.Measure OD600:Calibrate a photometer by measuring the blank with 500 µL of LB medium in a disposable cuvette.Pipette 500 µL of the S.tm culture in a new disposable cuvette and measure.OD600 should be between 0.5 and 0.7; in this state, S.tm are in their logarithmic growth phase.Pipette 5 µL of the S.tm culture to 10 mL Casy Ton buffer in a Casy cup and count living S.tm. Keep the remaining bacteria on ice until the infection of the cells is performed. Counting of viable S.tm using a Casy counting system  Note: The procedure along with the employment of the specific programs for the Casy counting system have been recently described in Brigo et al. (2022). Use the 45 µm capillary.Measure the background by placing a new Casy cup with fresh 10 mL of Casy Ton buffer under the measuring unit.Select Program for the background measurement.Measure the background activity. It should be below 30 counts and 1 µm size. Otherwise, wash the Casy counting system.Prepare a new Casy cup with 10 mL of Casy Ton buffer and add 5 µL of S.tm OD600 0.5.Shake gently.Place the sample in the measuring unit.Select the program for measuring between 1 and 3 µm.Measure.Click Next to get the number of viable counts/mL = viable S.tm /mL.Note: Viable counts from a freshly prepared S.tm culture with an OD600 of 0.5 is between 2.5  ×  108 and 3  ×  108 viable counts/mL.   Staining with CellROXTM and infection with S.tm   Note: Perform the next steps in a sterile biosafety level 2 laminar flow cabinet. The antioxidant NAC is used as a negative control, as it drastically decreases ROS stress in cells. Importantly, NAC is added before the infection or other treatments, to increase the antioxidant capacity of cells.",
    "We recommend at least triplicate well replicates per each treatment condition (e.g., four wells each of uninfected control, uninfected + NAC, infected, and infected + NAC, as depicted in Figure 1).  Add 5 µL of 500 mM antioxidant NAC (final concentration: 2.5 mM) to the negative control samples (Figure 1).Incubate the cells for 15 min at 37°C and 5% CO2 in a cell incubator.Pipette 1 µL of CellROXTM Deep Red reagent to each well (final concentration 2.5 µM).Incubate the cells for 15 min at 37°C and 5% CO2 in an incubator.Infect the cells with S.tm using a multiplicity of infection (MOI) of 10; therefore, 10 times more S.tm than cells are added to each well.Example for calculation of S.tm:To gain a MOI10, multiply the cell number by 10: 1.5 × 105 × 10 = 1.5 × 106 Divide the calculated cell number by the gained viable Salmonella count (e.g., 2.5 × 108): 1.5 × 106 viable counts/mL: 2.5 × 108 viable counts/mL = 0.006 mL = 6 µLAdd the calculated amount of S.tm directly into the cell culture wells containing 1 mL of DMEM containing 1% L-glutamine and 10% FBS.Immediately after infection, place the plate into a pre-heated plate reader (TECAN Spark).Setup of the plate reader (TECAN Spark) and measurement of the infection phase  Note: A captured image of the setup screen is displayed in Figure 2.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4604/bioprotoc-13-03-4604-g002.jpgFigure 2. Screenshot of the plate reader (TECAN Spark) method editor setup  Open the plate reader method editor.Select a 24-well plate.Note: Select the correct model of the 24-well plate to avoid inaccurate measurements in “bottom read mode” and to avoid damaging the detector. Select measurement “Fluorescence Intensity.”Set the instruments temperature to 37°C.Set the CO2 flow to 5%.Change the mode to “Bottom” for fluorescence intensity bottom reading.Change the Fluorophore Setting to “other.",
    "”Set the fluorophore parameters to:Monochromator 625 nm excitation; bandwidth 20 nmMonochromator 670 nm emission; bandwidth 20 nmSet “Flashes” to 60.Select cycles:Repeat the measurement every 5 min.Cycles: 12Change the gain to “manual” and use 130.Set the z-position to “manual.”Note: The z-position can be calibrated right before the measurement and changed if needed (see step G19). Select “multiple reads” per well:User definedType: filled circles (4 × 4)Border: 800 µMSave the setup.Open the plate reader dashboard control.Load the CellROXTM measurement setup.Confirm that the temperature is at 37°C and CO2 is at 5%.Place the 24-well plate into the plate reader.Let the z-position be calibrated by the machine (Figure 3):Select “z-position” in the menu on the bottom left.In the Scan sub-menu, select wells for signal detection.Click the Scan button on the bottom left.In the resulting graph, signal strength for different z-positions is visible.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4604/bioprotoc-13-03-4604-g003.jpgFigure 3. Screenshots of the plate reader dashboard control  Apply automatically suggested z-position or enter a manual value. Close the Scan sub-menu.Click “Start.”After the measurement is completed, an Excel file will open automatically.Save the Excel file and proceed to data analysis.Take the 24-well plate out of the plate reader and continue with the gentamicin neutralization assay.Long-term measurement of ROS in the presence of gentamicin (clearance phase)  Note: Perform next steps in a sterile biosafety level 2 laminar flow cabinet. Use this assay to avoid uncontrolled proliferation of bacteria that were not phagocytosed by macrophages. Gentamicin is not able to penetrate eukaryotic cells and therefore cannot affect internalized bacteria. Treatments or positive control (IFNγ) is typically added during this bacterial clearance phase, as depicted in Figure 1.  Pre-warm the medium and PBS in a water bath at 37°C to avoid additional stress to the cells.Remove the medium containing non-phagocytosed S.tm using a cell culture aspiration pump.",
    "Wash the cells twice with 1 mL PBS + 25 µg/mL gentamicin.Add 1 mL of DMEM supplemented with 10% FBS, 1% L-glutamine, and 25 µg/mL gentamicin.Add 100 ng/mL IFNγ to the positive control samples.Add 5 µL of 500 mM of the antioxidant NAC (final concentration 2.5 mM) to the negative control samples.During the bacterial clearance phase, incubate the cells for up to 24 h in a cell culture incubator (37°C, 5% CO2, 95% relative humidity). Remove the cell culture plate only for hourly measurements.Setup of the plate reader (TECAN Spark) and measurement of the clearance phase  Note: During the bacterial clearance phase, we recommend single individual measurement in the plate reader. In between these measurements, the cell culture plate is kept in a cell culture incubator to ensure optimal environmental conditions for cells (37°C, 5% CO2, 95% relative humidity). Furthermore, it is advised to keep the plate reader’s temperature at 37°C and atmosphere at 5% CO2 all the time.  Open the plate reader (TECAN Spark) method editor.Load the “Setup” from section G into the method editor.Remove “Select cycles” (step G10) to perform only single fluorescence measurements.Use the parameters of the previous “Setup” (Section G).Save the setup.Open the plate reader control.Load the CellROXTM measurement setup.Confirm that the temperature is at 37°C and CO2 is at 5%.Place the 24-well plate into the plate reader.Let the z-position be calibrated by the machine.Apply the new z-position if wanted.Click “Start.”After the measurement is completed, an Excel file will open automatically.Save this Excel file and proceed to data analysis. Note: Alternatively, the plate reader can also be set up for hourly measurements during the entire 24 h bacterial clearance phase with constant incubation of the 24-well plate in the plate reader, to minimize hands-on time.",
    "In this case, we recommend using a humidity cassette as well as the same environmental conditions as in the cell culture incubator (37°C, 5% CO2)."
  ],
  "subjectAreas": [
    "Immunology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}