{
  "id": 18966,
  "origin_website": "Jove",
  "title": "Bioluminescent Orthotopic Model of Pancreatic Cancer Progression",
  "procedures": [
    "The protocol being demonstrated is performed under the guidance and approval of the author's institution's animal care and use committee. All experiments are executed in compliance with all relevant guidelines, regulations and regulatory agencies.\n1. Transducing Pancreatic Cancer Cell Lines\nTransduce pancreatic cancer cells to express luciferase as previously described.12,13 Panc-1 and Capan-1 pancreatic cancer cell lines transduced with firefly luciferase are used here.\nNote: Renilla luciferase or bacterial luciferase may also be used.\n2. Pancreatic Cancer Cell Preparation\nCulture transduced pancreatic cancer cells until 70% confluent.\nLift the pancreatic cells and ensure viability is greater than 90%.\nResuspend at 2 x 107 cells/ml in a 3:2 mixture of chilled Matrigel:Phosphate buffered saline (PBS).\nKeep the Matrigel-cell suspension on ice prior to injection into the pancreas.\nNotes: To ensure rapid solidification of Matrigel, reduce the PBS volume to account for the volume of the cell pellet. Handle Matrigel using ice-cold instruments and syringes at all times to prevent solidification prior to injection. The suggested cell number is a guide and should be determined empirically for each cell line.\n3. Mouse Preparation\nAnesthetize the mouse using inhaled 2-3% isoflurane. Determine depth of anesthesia by lack of pedal reflex to a gentle toe pinch.\nApply lubricant to the eyes to prevent desiccation.\nPosition the mouse on its back on a 37 °C heating pad and gently turn the mouse to raise the left side of the abdomen.\nPrepare the abdomen with a 10% povidone iodine solution.\nNotes: Injectable anesthesia may be used instead of inhaled anesthesia. Pre-operative fasting is not necessary.\n4. Laparotomy\nUsing sterile surgical instruments make a 1.5 cm incision in the skin approximately 1 cm left lateral from the midline.\nMake a 1.5 cm incision in the underlying abdominal muscle.",
    "Locate the spleen using the forceps and gently remove the spleen from the abdominal cavity. Secure the spleen along a sterile cotton bud to expose the underlying pancreas.\nLocate the tail of the pancreas adjacent to the spleen.\nUsing a 29 G 0.3 ml insulin syringe, inject 20 μl of the Matrigel-cell suspension into the pancreas.\nFollowing injection, hold the syringe in the pancreas for 30-60 sec until the Matrigel has solidified. This important step minimizes cell leakage.\nInspect the site of injection to ensure no leakage occurred.\nReturn the spleen and pancreas to the abdominal cavity.\nNote: Take care to avoid puncturing the dorsal side of the pancreas which may be thin.\n5. Abdominal Wall Closure\nClose the abdominal musculature of the mouse with an absorbable braided 4-0 suture with a round needle using a continuous stitch.\nClose the external skin with a non-absorbable monofilament 6-0 suture with a cutting needle using a continuous stitch.\nRemove the mouse from the inhaled anesthetic and injected 0.05-0.1 mg/kg buprenorphine subcutaneously.\nAllow the mouse to recover in its cage placed on a 37 °C heating pad with free access to food and water. If mice demonstrate signs of pain such as hunching or reduced mobility, buprenorphine may be given every 12 hr over a 36 hr period.\nAfter wound healing (7-10 days), anesthetize the mouse and remove the external sutures.\n6. Bioluminescent Tracking of Pancreatic Cancer Progression\nAnesthetize the mouse using inhaled isoflurane.\nInject 150 mg/kg D-luciferin via tail vein.\nPlace the mouse in the bioluminescent imaging system and capture white-light and bioluminescence images as previously described.14,15\nRemove the mouse from the inhaled anesthetic and allow it to recover in its home cage.",
    "Note: Bioluminescent imaging is non-invasive and can be conducted periodically to investigate tumor growth kinetics. To image tumor in the pancreatic tail it is important to put the mouse on its left side, so the tumor points towards the camera. We imaged once per week with the frequency increased up to three times per week prior to the experimental endpoint using a Lumina II imaging system (Perkin-Elmer, formerly Caliper Life Sciences) running Living Imaging 4.3.1 software with binning 4, FOV 12.5, F-stop 1, exposure 1 - 60 sec (determined by the highest exposure without pixel saturation).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}