{
  "id": 3556,
  "origin_website": "Cell",
  "title": "Antigen density quantification of cell-surface immunotherapy targets by flow cytometry: Multi-antigen assay of neuroblastoma bone marrow metastasis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\n      This section defines the activities on the day of actual experiments with\n      patient specimens, assuming the assay is fully developed as outlined in\n      the sections above.\n    \n      Prepare and run control samples, compensation, and quantitation bead tubes\n      for proper instrument setup\n    \nTiming: 4 h\n      In order to keep the processing time for clinical samples to a minimum\n      (from thawing to data acquisition) in this step, the instrument setup\n      including compensation and acquisition for all control samples is\n      performed prior to thawing any patient samples.\n    \n        Prepare all sample tubes required for this step.\n        \n            Stain all positive and negative control cell lines and spike-in\n            controls samples according to steps outlined in section ‘test antibody panel on spike-in control bone marrow samples[href=https://www.wicell.org#sec1.6]’ above.\n          \n            Prepare compensation tubes containing compensation beads or\n            ST16-BM4045 cells as outlined in the same section above.\n          \n            Prepare BD quantitation beads for the assay as outlined in the ‘prepare quantitation beads[href=https://www.wicell.org#sec1.7]’\n          \n        Set up flow cytometer and run compensation control samples as well as\n        quantitation beads as outlined in section ‘set up the flow cytometer including compensation and run control\n          samples and quantitation beads[href=https://www.wicell.org#sec1.8]’\n      \nThaw patient samples and stain with antibody panel\nTiming: 45–60 min\n    \n      This step serves to thaw, process, stain, and wash the patient samples\n      with the entire antibody panel.\n    \nCritical: Because viability of patient\n      samples decreases rapidly after thawing, we recommend staining and running\n      all control samples including flow cytometer setup and compensation prior\n      to thawing the patient samples.\n    \n        Thaw the bone marrow samples and bring into single-cell suspensions.\n        \n            Get the samples from the liquid nitrogen and place on dry ice.\n          \nPlace samples in the 37°C water bath and thaw quickly.\n            Transfer each sample to a 15 mL conical tube and resuspend in 10 mL\n            of 4°C cold RPMI complete media.\n          \nPerform centrifugation step.",
    "Resuspend cell pellets in 1 mL of Cellstripper a non-enzymatic\n            dissociation reagent to break up tumor cell spheres and incubate\n            samples for 2 min.\n          \n            Add 2 mL of FACS buffer, perform centrifugation step, and wash cells\n            twice.\n          \n        Stain patient samples with the entire antibody panel.\n        \n            Follow the staining procedure specified above under ‘Stain control\n            cell lines and compensation tubes’.\n          \nPass cells through FACS tube strainer caps before running.\nNote: The bone marrow patient samples used\n      for this assay contained a total of 1‒5 × 106 frozen cells and\n      viability can be quite low (∼20%) due to Ficoll-processing before freezing\n      and decreases post thaw. The tumor infiltration based on the pathology\n      report in our samples ranged between 1% and 80%. We generally stain the\n      entire sample with our antibody panel, yet if cells are viable and\n      abundant and the expected tumor burden is high, we recommend aliquoting\n      1 × 106 cells for staining.\n    \n      Run patient samples on the flow cytometer and analyze data\n    \nTiming: 1 h\n      In this step data acquisition and analysis of antigen density\n      quantification of the patient samples are described.\n    \n        Run patient samples and acquire data.\n        \n            Confirm that gates capture the cell population without debris (FSC-A\n            vs. SSC-A) and include single cells rather than doublets (FSC-A vs.\n            FSC-H) and capture viable cells (SSC-A vs. eF780) only.\n            \n                Exclude CD45+ hematopoietic cells and CD13+\n                neuroblastoma-mimicking bone marrow stromal cells by gating on\n                the CD45/CD13 double-negative population.\n              \n                Identify the tumor cell population by further sub-gating on\n                NCAM+ and GD2+ (Figure 3[href=https://www.wicell.org#fig3]).\n              \n            Run the entire tube of each sample as opposed to collecting a\n            certain number of events to ensure all tumors cells present in the\n            sample are captured.\n          \n        Export data and perform data analysis including quantitation.\n        \n            Export the data and open FCS files in FlowJo software (BD",
    "Biosciences). Gate on the tumor cell population as outlined\n            previously and shown in Figure 3[href=https://www.wicell.org#fig3].\n          \n            In each Quantitation Bead Tube, gate on the singlet population of\n            the beads by FSC-A vs. SSC-A and create a fluorophore histogram\n            plot. In the histogram, create a separate gate for each of the bead\n            populations present in the sample.\n          \n            Using the ‘Table Editor’ function in FlowJo software, export the\n            geometric mean values of the fluorescent intensity of each antigen\n            and the respective quantitation bead populations.\n          \n            For manual data analysis, use an Excel spreadsheet.\n            \n                enter the exported MFI values of each quantitation bead\n                population in an X-axis column and the lot-specific number of\n                fluorophore molecules provided in the Technical Data Sheet (TDS)\n                in a Y-axis column.\n              \n                Plot a linear regression of MFI (X-axis) vs. Fluorophore\n                Molecules (Y-axis) using the linear equation ‘Y = aX + c’ where\n                Y equals the number of fluorophore molecules and X equals MFI\n                value (Figure 4[href=https://www.wicell.org#fig4]). Alternate regression\n                analyses can also be considered.\n                \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3125-Fig4.jpg\n                      Figure 4. Conversion of mean fluorescent intensity of\n                      quantitation bead populations into molecules per cell\n                    \n                      Representative Histograms of Quantitation Beads of each\n                      fluorophore (first panel from the left), mean fluorescent\n                      intensity of each bead population and pre-defined\n                      LOT-specific fluorescent molecules/bead for each\n                      population (second panel) to set up the equation (third\n                      panel) for converting mean fluorescent intensity of each\n                      antibody signal into molecules of fluorophore/cell.\n                      Representative histograms of each antigen of a patient\n                      neuroblastoma-infiltrated bone marrow sample gated\n                      according to Figure 3[href=https://www.wicell.org#fig3] (fourth panel)\n                      used for example calculation adjusted for F:P ratios in\n                      Table 3[href=https://www.wicell.org#tbl3].\n                    \n                To determine the number of fluorophores for an unknown cell\n                population, substitute the cell population MFI value in the\n                equation and solve for the number of fluorophore molecules and",
    "divide the resulting value by the F:P ratio (Table 3[href=https://www.wicell.org#tbl3]). Given that antibody concentrations are saturating, the\n                assumption is made that antibodies bound per cell provide a\n                reasonable estimate of antigens per cell. If autofluorescence or\n                other background effects are substantial, they can first be\n                subtracted.\n                table:files/protocols_protocol_3125_4.csv\n                  Representative data of one patient sample according to the\n                  equations shown in Figure 4[href=https://www.wicell.org#fig4].\n                \nNote: For example, in the case of ALK-APC,\n      if the MFI value of the patient’s tumor cell population is 4057, and using\n      the equation generated for APC fluorescence quantitation, the formula is\n      ‘Y = 6.2572 × (4057) – 3063.1’, resulting in 22322 molecules of APC bound\n      per cell for the cell population of the interest. To arrive at antibodies\n      bound per cell, this value must be divided by the F:P ratio (which is 3.34\n      for ALK-APC), resulting in 22322 molecules of APC divided by 3.34 APC per\n      antibody equals 6683 antibodies bound per cell (Table 3[href=https://www.wicell.org#tbl3]; Figure 4[href=https://www.wicell.org#fig4])."
  ],
  "subjectAreas": [
    "Immunology",
    "Flow Cytometry",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}