{
  "id": 12037,
  "origin_website": "Jove",
  "title": "Studying the Effects of Tumor-Secreted Paracrine Ligands on Macrophage Activation using Co-Culture with Permeable Membrane Supports",
  "procedures": [
    "All procedures related to the harvest and use of murine peritoneal macrophages were conducted at the University of North Carolina at Chapel Hill (UNC) and were approved by the UNC Institutional Animal Care and Use Committee (IACUC).\n1. Macrophage culture\nNOTE: This procedure can utilize primary peritoneal macrophages (described in detail below), bone marrow-derived macrophages, or macrophage cell lines such as J774 (ATCC) or RAW264 (ATCC).\nHarvest peritoneal macrophages as previously described16,17 and plate directly into the upper chamber(s) of a 0.4 µm polyester membrane insert co-culture 6 well plate (Figure 1A).\n\tNOTE: The approximate yield of macrophages from each isolation is 1 x 106 cells total, so the average number of cells per well is ~1.5–1.6 x 105 cells in a 6 well plate.\nCulture the harvested macrophages in Dulbecco’s Modified Eagle Medium (DMEM)/F12, 10% Fetal Bovine Serum (FBS), 1x penicillin/streptomycin, 20 ng/mL macrophage colony stimulating factor (M-CSF) for 3 days at 37 °C, 5% CO2.\n\tNOTE: The upper chamber contains 1 mL of culture medium while the lower chamber is filled with 1.5 mL. The medium must be added to each chamber.\n2. Coculture of tumor cells with macrophages\nPrior to use, culture commercially available tumor cells in their respective medium following ATCC-recommended tissue culture methods.\nWash adherent tumor cells once with phosphate buffered saline (PBS), add 0.05% trypsin + ethylenediaminetetraacetic acid (EDTA), and incubate at 37 °C until the cells detach. Resuspend the cells in FBS containing medium, quantitate the total number of cells using a hemocytometer or cell counter, and then centrifuge for 5 min at 220 x g to pellet.\nDuring centrifugation, aspirate the medium from the upper and lower chambers of the macrophage-containing permeable membrane support plates and replace with fresh medium.",
    "For lower chambers where tumor cells will be plated, fill with 1 mL of medium instead of 1.5 mL to allow for sufficient volume for cell addition.\nAspirate medium from pelleted tumor cells and resuspend cells in DMEM/F12 with 10% FBS, 1x penicillin/streptomycin, and 20 ng/mL M-CSF at a concentration of 3 x 105 cells/mL.\nAdd 0.5 mL of 3 x 105 cells/mL tumor cells to the lower chamber of desired wells (Figure 1B).\n\tNOTE: Cells can be treated immediately.\n3. Treatment of co-cultured cells\nTo induce macrophage pro-inflammatory gene expression, treat singly or co-cultured macrophages by adding 100 ng/mL IFNγ and 50 ng/mL LPS.\n\t\nVary the duration of treatment times in culture as needed. Macrophage activation occurs within 2 h and some tumor-mediated suppression occurs by 8 h. Co-culture for 24 h yields robust and consistent tumor-derived suppression.\n\t\tNOTE: Alternatively, macrophages can be induced to adopt a pro-wound healing phenotype through the addition of factors such as interleukin-10 (IL10), and the effect of the tumor-secreted ligand assessed.\nAs a negative control, culture macrophages singly and leave untreated. As a positive control, treat singly cultured macrophages with 100 ng/mL IFNγ and 50 ng/mL LPS.\n4. Downstream analysis of co-cultured cells\nAfter desired incubation time has elapsed, isolate the cell lysate or conditioned culture medium as desired, depending on testing needs.\nTo isolate the cell lysate for quantitative polymerase chain reaction (qPCR) analysis, aspirate the media from both chambers of the well and wash once with 2 mL of PBS. Apply RNA lysis buffer to the top chamber containing the macrophages. Gently scrape the membrane to release the cell lysate, and transfer to a collection tube for further processing according to the RNA isolation kit manufacturer’s protocol.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}