{
  "id": 8355,
  "origin_website": "Jove",
  "title": "Detecting Amyloid-β Accumulation via Immunofluorescent Staining in a Mouse Model of Alzheimer's Disease",
  "procedures": [
    "All experimental procedures were performed with the approval of the Institutional Animal Care and Use Committee of Xuzhou Medical University and in accordance with the guidelines of the Chinese governmental regulations for the care and use of laboratory animals.\n1. Perfusion of Mice\nNOTE: More details of the perfusion procedure can refer to the video from Wiliam Shain's lab 11.\nAnesthetize 5×FAD (C57BL/6J) transgenic mice with 1% pentobarbital sodium (50 mg/kg body weight) by intraperitoneal injection12,13. Loss of response to hind paw-pinching indicates proper anesthetization. Do not start perfusion before the mouse is properly anesthetized.\nUse four pins to fix the limbs on the polyfoam plank. Set the abdomen of the anesthetized mouse upwards, with its limbs adequately stretched. Use a pair of iris scissors to make an incision at the xiphoid process. Then the diaphragm will be exposed.\nUse surgical scissors to make an incision on the diaphragm, and carefully continue the diaphragm incision to the upper bound of the rib cage. Cut the ribs and thoracic muscles, dissect the attached tissues to expose the heart.\nFind the right atrium of the mouse. Cut open the right atrium using iris scissors.\nInject 20 mL of 37 °C PBS (0.01 M, pH 7.2-7.4) from the left ventricle of the heart to flush out blood. Then slowly inject 20 mL of 4% PFA of room temperature from the left ventricle to fix the tissues. The injection rate of PBS and 4% PFA is around 5 mL/min. Fixation tremors should be observed within seconds.\n\tCAUTION: 4% PFA can irritate eyes and airways, and may provoke allergic reactions. This step should be done in ventilated places, and the operator should wear safety goggles and face masks.",
    "Use surgical scissors to cut off the head, and carefully remove the cranium use dissecting forceps and extract the brain. Then submerge the brain into 4 mL of 4% PFA in a 5 mL plastic tube for 12-24 h at 4 °C.\n2. Embedding and Cryosectioning\nAfter fixation in 4% PFA, transfer the brain into 4 mL of 15% sucrose in a 5 mL plastic tube at 4 °C. After 12-24 h, the brain should sink to the bottom.\nTransfer the brain into 4 mL of 30% sucrose in a 5 mL plastic tube at 4 °C for 12-24 h. Then the brain is ready for embedding. The purpose of 15% and 30% sucrose stepwise soaking is to dehydrate the brain, which avoids the formation of ice crystals inside the cells during embedding and cryosectioning. The dehydrated brain can be stored at 4°C for one week.\nLeave roughly 1 mL of sucrose with the brain in the tube. Then add the same volume optimal cutting temperature (OCT) compound into the tube and mix properly. This helps OCT compound to wrap the brain more sufficiently.\nMount a thick layer of OCT compound on the knob surface and freeze at -21 °C before cryosectioning. Cut the brain sagittally from the middle; use either half for sectioning in a cryostat.\nAfter the OCT compound solidifies, mount the knob on the specimen head and trim it into a platform surface. Lay one half of the brain on the trimmed surface with the middle side downwards.\nPut a tinfoil ring around the brain to avoid leakage of OCT compound, and then fill the ring with OCT compound until the brain is submerged. When OCT compound embedding solidifies, it is ready for sectioning.",
    "Set the thickness of the section to 20 µm. Set the chamber temperature to -21 °C, and the specimen head temperature to -19 °C. Section the brain from the rostral end to the caudal end.\nBrush some PBS on the glass slides. Pre-coat the glass slides in poly-lysine to prevent the sections from peeling off. Attach the section onto the slide. If the section is folded, use a soft brush to unfold the sections with PBS.\nDry the sections overnight at room temperature and store at -20 °C. Sections can be kept at -20 °C for up to one month before Aβ staining.\n3. Aβ Staining Procedure\nWarm up the sections at room temperature, dry the slide surface, and use a hydrophobic pen to draw a circle around the section for antibody incubation.\nSoak the slide in PBS in a 30 mL plastic staining box to wash off OCT compound. Use at least 20 mL of PBS.\nAdd 100 µL of 1x antigen retrieval solution for frozen sections onto the slide. Incubate for 5 min at room temperature.\nWash the retrieval solution with at least 20 mL of PBS of room temperature for 3 times (5 minutes for each).\nAdd diluted primary antibody (6E10) on the sections and incubate at 4 °C for 16-24 h in a wet, dark box (primary antibody dilution solution: 1% BSA, 0.3% Triton X-100, 0.01% sodium azide in PBS, 1:500 dilution). BSA functions as blocking agent.\nWash the sections with PBS for 3 times, 5 min each time.\n\tNOTE: Perform steps 3.7, 3.8 and 3.9 in a dark place.\nIncubate sections in secondary antibody solution (Goat anti-Mouse IgG (H+L) Alexa Flour 594, diluted with PBS 1:200) for 1 h at room temperature in a wet, dark box.",
    "Wash the secondary antibody off the sections with at least 20 mL of PBS for 3 times, 5 min each time.\n\tNOTE: Do not pour PBS onto sections during washing to prevent sections peeling off. Keep the sections wet.\nAbsorb the liquid around sections and add a drip of mounting medium on each section. Seal the sections with cover glass, avoiding bubbles.\nObserve the stained sections with a fluorescence microscope. Keep the imaging parameters consistent to avoid derivation. Keep the slides at 4°C in a dark place. Analyze the sections within one week, since the staining will fade with time.\n4. Imaging and Quantification of Aβ accumulation by ImageJ\nCapture images by a fluorescence microscope connected with a digital camera and imaging software. We used Image Pro Plus software and the imaging parameter was set as follows: Exp Pvw: 450 ms, Exp Acq: 450 ms; Pvw: 1 × 1, Acq: 1 × 1; Pvw Resolution: Width 1 × Height 1, Acq Resolution: Width 1 × Height 1; Capture Depth: 8-bit mono; Gain: Pvw: 13, Acq: 13, Gamma: Pvw: 1, Acq: 1, Offse: Pvw: -700, Acq: -700.\nIn ImageJ Fiji 2.0.0 (https://imagej.net/Fiji), select Plugins | Stitching | MosaicJ in the menu. Then select Files | Open Image Sequence to open the images to be stitched (Figure 1A).\nAll the selected images will be displayed on the bottom. After stitching the images manually, select File | Create Mosaic (Figure 1B, C, D).\nSelect Image | Adjust | Brightness/Contrast …, and adjust the brightness and contrast of the image (Figure 3A). Then the image is able to be saved (Figure 1E).\nTo quantify the accumulation of Aβ, open the image through File | Open… in the menu (Figure 2A).",
    "Select Image | Type | 8-bit to adjust the image to 8-bit. Then choose the area intended to be counted using Polygon selection (Figure 2B).\nSelect Image | Adjust | Threshold to select the proper threshold of signals. Threshold can be adjusted via dragging the scroll bars or change the numbers directly in the textbox (maximum: 255, minimum: 0). When all the Aβ signals in the section has become red, the threshold is appropriate for measurement (Figure 2C). Make sure that Dark Background box is checked.\nSelecting Analyze | Set Measurement… in the menu to choose the parameters that will be shown in the results. Confirm that Integrated density and Limit to Threshold is selected. Integrated density (total intensity) is the target of the measurement (Figure 2D).\nSelect Analyze | Measure to get the results. The results will be displayed and ready for statistical analysis (Figure 2E).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}