{
  "id": 2288,
  "origin_website": "Cell",
  "title": "Live imaging of Drosophila melanogaster neural stem cells with photo-ablated centrosomes",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCollecting larvae expressing fluorescent proteins\nTiming: 15 min\nLarval collection.\nStart collecting wandering third instar larvae with fine forceps 96–120 h after egg laying.\nLeave each larva in 0.1 mL drops of PBS in a Petri dish for subsequent brain dissection.\nNote: Note that all larvae express one copy of the GFP-AurA, H2A-GFP, PH-PLCδ-GFP and α-tubulin-RFP proteins. We recommend using young wandering third instar larvae. Brain lobes contain a defined number of NSCs (≈100). These 100 cells are spatially much closer to each other in younger brains compared to older brain that have generated much more GMCs. Therefore, young wandering third instar larvae offer a better chance to isolate NSCs and greatly facilitate the subsequent imaging steps.\nLarval brain dissection and mounting on the incubation chamber\nTiming: 20 min\nNote: Culture medium must be pre-heated to 25°C prior to dissection and centrifuged at × g for 1 min to remove debris.\nLarval brain dissection.\nWash the larvae 3 times in PBS and transfer the larvae in 200 μL of culture media.\nRemove the brain and surrounding tissues under a binocular using fine tweezers.\nSeparate the brain from the salivary glands and surrounding tissues.\nBrain mounting in the incubation chamber.\nGently aspirate the brain with a 200 Eppendorf pipet tip containing 50 μL of culture media and transfer the brain in the central well of the incubation chamber (Figure 1[href=https://www.wicell.org#fig1]C).\nImmediately cover the brain with 200 μL of mineral oil in the incubation chamber.\nRemove excess culture medium by aspiration with a fine homemade glass capillary through the mineral oil layer (Figure 1[href=https://www.wicell.org#fig1]D).\nCritical: Cut the end of the pipette tip off with a razor blade to avoid brain deformation during pipetting as the brain size may exceed the tip diameter.",
    "Note: Excess removal of culture media can trigger too much brain flattening on the coverslip and impair cell division. Aspiration is controlled under the binocular and should be stopped as soon as the brain lobes start to flatten.\nNote: Medium aspiration has the advantage of gently flattening the lobes and maintaining many NSCs in a close focal plane.\nCentrosome photo-ablation\nNCS Imaging and centrosome photo-ablation.\nImage larval brain explants under an inverted Leica SP5 confocal microscope maintained at 25°C.\nPerform photo-ablation with a Mai-Tai two-photon infrared laser on a 2 × 2 μm region of interest at the centrosome in metaphase cells.\nNote: Use the following parameters for the multi-photon ablation; Trans: 80%, Gain: 100, offset: 36, iterations: 3 × 100 ms.\nNote: NSCs can be distinguished as being the largest spherical cells, with a diameter of 10–15 μm. They are positioned in the central part of the brain and located below the brain surface. We found that a plasma membrane marker such as PH-PLC-GFP is the best marker to accurately identify NSCs for non-experts.\nNote: Centrosomes are identified by the presence of GFP-AurA dots located in the center of the RFP-α-tubulin microtubule aster during pro-metaphase and metaphase (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: Apical and basal NSC centrosomes can be differentiated by their respective size; the apical centrosome recruits more peri-centriolar components (e.g., GFP-AurA) and appears larger and brighter than the basal centrosome (Rebollo et al., 2007[href=https://www.wicell.org#bib14]; Rusan and Peifer, 2007[href=https://www.wicell.org#bib16]). In addition, the location of the GMCs that originate from previous NSC divisions (visible with the PH-PLCδ-GFP marker) enables to determine the position of the NSC basal side.\nCritical: To avoid tissue damage and photo bleaching, a maximum of 4 photo-ablation experiments are performed on different neuroblasts from the same brain.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1755-Fig2.jpg\nFigure 2. Laser ablation in NSCs",
    "(A) Control of centrosome ablation by immunostaining. The right panels show two metaphase NSCs from the same brain lobe. The centrosome of the right metaphase NSC was laser-ablated (right, Centr2) while the other was left intact (right, Centr1). Enlargement view of Centr1 and Centr2 regions corresponding to the “ablated” metaphase is also shown on the left. Tubulin is shown in red, centrosomin (Cnn) is shown in cyan and the phosphorylated Ser10 of Histone H3 (H3-Ph) is shown in green. Cnn and tubulin are also shown in monochrome in the middle and lower panels. Scale bars 5 μm (left panels) and 1 μm (right panels).\n(B) Dividing larval NSC expressing H2A-GFP, GFP-AurA, PH-PLCδ-GFP and RFP-α-tubulin subjected to centrosome ablation from metaphase to early anaphase. Pre and post-ablation images are shown in the green GFP channel to show disappearance of the centrosome labeled by GFP-AurA. The NSC is then imaged every 30 s to show RFP-α-tubulin and the GFP labeled proteins. Note that RFP-α-tubulin is also shown in monochrome in the lower panels. Scale bar: 10 μm. Time is min:s. The blue arrowhead shows the loss of the centrosome aster. The purple arrowhead shows the control non-ablated centrosome aster.\n(C) Cell division in a control NSC (top panels) and in NSCs in which the apical (middle panels, same cell shown in panel A) or the basal centrosomes (lower panels) were photo-ablated. The blue and orange arrowheads show the position of the centrosome before and after photo-ablation, respectively. GFP-AurA, H2A-GFP and PH-PLCδ-GFP are shown in monochrome. Scale bar: 10 μm.",
    "(D) Dot plot showing the mean (± s.d.) NSC diameter/GMC diameter ratio in controls (2.31 ± 0.22, n=15), in NSCs where the apical (2.05 ± 0.22, n=15) or the basal centrosomes (2.04 ± 0.19, n=12) were ablated. ∗∗: p<0.01 (Mann-Whitney test). Note that Figure 2[href=https://www.wicell.org#fig2]B, C and D are reused data or panels from Thomas et al., 2021[href=https://www.wicell.org#bib17].\nNSC imaging\nRecord NSC divisions with a 60 × 1.3 NA objective.\nNote: Acquire ten Z-series of 1 μm steps are acquired at 700 Hz (zoom 4) just before and after the photo-ablation at 30 s intervals. The image size acquired is 8 bits, 512 × 512 pixel, 2 frame-average (Figure 2[href=https://www.wicell.org#fig2]C and Methods video S1[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Asymmetric cell division in a control NSC or after basal centrosome ablation, related to Figure 2 and step 8\nThe left panel shows a control NCS. The right panel shows a NSC in which the basal centrosome was ablated. First and second images show pre- and post-ablation images respectively before acquisition. GFP-AurA, GFP-H2A and PH-PLCδ-GFP are displayed in gray. Scale bar: 10 μm. Time is min:s.\nVerification of centrosome ablation by immunostaining\nBrains can be fixed immediately after photo-ablation to confirm centrosome depletion by immunostaining (Figure 2[href=https://www.wicell.org#fig2]A).\nGently aspirate the photo-ablated brain using a Pasteur pipette containing 50 μL of culture medium.\nTransfer the brain directly in 1 mL of fresh fixative solution (Bonaccorsi et al., 2011[href=https://www.wicell.org#bib4]).\nReturn the tube 3 times and incubate at 25°C for 20 min.\nLet the sample sink by capillarity and remove the fixative.\nWash the fixed sample 3 times for 10 min on a rotating wheel in 1 mL of PBST.",
    "Process the brain for immunofluorescence using rabbit anti-Cnn (Zhang and Megraw, 2007[href=https://www.wicell.org#bib18]), rat anti-tubulin and mouse anti-phosphorylated Histone H3 (Ser10) antibodies (Figure 2[href=https://www.wicell.org#fig2]A) (Gallaud et al., 2014[href=https://www.wicell.org#bib8]; Thomas et al., 2021[href=https://www.wicell.org#bib17]).\nImage analysis\nAfter recording, analyze NSCs divisions using the Fiji (ImageJ) software (Hiner et al., 2017[href=https://www.wicell.org#bib10]; Rueden et al., 2017[href=https://www.wicell.org#bib15]). The NCS and the GMC outskirts are visualized using the plasma membrane PH-PLCδ-GFP marker. The diameters of the newborn NSC and the GMC after cytokinesis are measured using the “line” tool on Fiji. The mean of at least two diameter measurements is performed for each cell. We use Fiji to make movies in controls and photo-ablated NSCs (Methods video S1[href=https://www.wicell.org#mmc1]).\nPlot the data and perform appropriate statistical analyses using Prism (Figure 2[href=https://www.wicell.org#fig2]D).\nSelect relevant time-lapse images to make figures and/or to export into videos (Figure 2[href=https://www.wicell.org#fig2] and Methods video S1[href=https://www.wicell.org#mmc1])."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Microscopy",
    "Cell Biology",
    "Neuroscience",
    "Developmental Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}