{
  "id": 7338,
  "origin_website": "Bio",
  "title": "Solubilization Method for Isolation of Photosynthetic  Mega- and Super-complexes from Conifer Thylakoids",
  "procedures": [
    "Sample harvestingMature needles were cut from branches with a pair of scissors, collected into a glass beaker, and kept on ice (T ≤ 0°C) in the dark.Needles were harvested on sunny days during June and July from south-facing branches of five different P. sylvestris and P. abies trees growing in the Umeå University campus (63.8202° N, 20.3054° E).Upon cutting, the samples were collected into a glass beaker (a separate icebox for each biological replicate was used) and placed in an icebox (35-40 cm deep; ¾ filled with ice and ¼ headspace).After collection of approximately 3-4 small branches (10-15 g of needles), the whole icebox was covered with a double layer of thick-black cloth to ensure darkness in the sunny summer days during the 2-5 min transportation time to the laboratory.In the laboratory, samples were immediately subjected to isolation in the cold room (T ≤ 4°C) under dim green light. At no point from collecting branches until completion of isolation were samples moved from either icebox/cold room or darkness (see Figure S1[href=https://os.bio-protocol.org/attached/file/20210816/4144 Supplementary information m1.docx] for sampling collection process and working setup).Thylakoid isolationNote: This step must be performed in a cold room. (Buffers required - B1, B2, and B3; water and buffers were kept in the cold room overnight)Samples were prepared according to Bag et al. (2020) with slight modifications to maximize protein complex isolation.",
    "Briefly, approximately 10-15 g (fresh weight) of needles were washed in ice-cold distilled water; then, 100-150 ml of ice-cold Grinding buffer (B1) was added (1:10 ratio of needles to buffer), and the mixture blended with a high-speed blender and pre-cooled at 4°C for 15 s in five repetitions, with a 30-s gap between each blending step [a high number of blending steps (5-6) at low blending time (15-20 s) and time lapse between each blending steps (25-40 s) are important for isolating intact higher-order complexes].The blended needles were filtered through two layers of miracloth (Merk Millipore) and centrifuged (4,500 × g for 8 min, at 4°C). The obtained pellet was resuspended in 30-35 ml Shock buffer (B2) and centrifuged (4,500 × g for 8 min, at 4°C).A subsequent resuspension, this time on Storage buffer (B3), was followed by a two-step centrifugation, first at low speed (200 × g for 2 min, at 4°C, discard pellet), then at higher speed (4,500 × g for 8 min, at 4°C).The final obtained pellet was resuspended on 800 µl of B3 buffer, aliquoted in small fractions (50-100 µl), and either used immediately or frozen in liquid nitrogen and stored at -80°C for further use. In all steps, the pellet was resuspended with thin hair paintbrushes to prevent excessive mechanical shearing, which might damage the higher-order protein complexes.Chlorophyll concentration determinationConsidering the stoichiometric relationship between Chlorophyll and Chl-binding proteins, the sample concentration is expressed as milligrams of Chls in a milliliter of sample.Chlorophyll concentration was calculated from 10 µl of samples extracted in 0.99 ml of 80% ice-cold acetone (1 ml final volume) by rigorous vortexing until no clumps could be seen (approximately 2 min; more time may be needed if the sample is very thick).",
    "After vortexing, tubes were centrifuged at 8,000 × g for 5 min and measured according to Porra et al. (1989).Sample preparation, electrophoresis, and isolation of protein complexes in native conditionsNote: This step must be performed in a cold room. Major optimization methods for conifer samples start from this part. From here onwards, steps are denoted chronologically using the same numbers as they appear on the graphical illustration (Figure 1). The volumes and concentrations of the samples, buffers, and detergents only focus on the optimal detergent concentrations that allow maximum separation. Samples, buffers, and detergents required for different tested detergent concentrations are provided in Tables 1 and 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4144/bioprotoc-11-17-4144-g001.jpgFigure 1. Graphical illustration of the solubilization, gel running, and band identification Table 1. Solubilization with increasing concentrations of α-DDM.  The table shows the volumes of solubilizing buffer (SB) and volumes/concentrations of α-DDM used for obtaining the increasing detergent to chlorophyll ratios presented in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210831/20210831202931_5862.png *The volumes are referred to the 100 mM α-DDM working solution (see Recipes).Table 2. Solubilization with increasing concentrations of digitonin.  The table shows the volumes of SB and volumes/concentrations of digitonin used for obtaining the increasing detergent to chlorophyll ratios presented in Figure 3. Here, a two-steps solubilization was applied: first, 5 mM α-DDM, denoted as a constant +1 µl in the detergent volume column, were added 5 min prior to digitonin, which is added according to the desired concentration (changing volumes in the detergent volume column).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210831/20210831203233_5270.png*The volumes are referred to the 100 mM digitonin working stocking solution (see Recipes).Washing thylakoid samples(Buffers required - WB1, WB2, and WB3)Considering the high tannin and polyphenolic contents in conifer needles, separation of native complexes needs several washing steps before solubilization; otherwise, the detergent activity becomes limited. Here, we used three different washing buffers before solubilization.",
    "First, 250 µl of WB1 was aliquoted in Eppendorf tubes and a certain volume of thylakoids corresponding to 10 µg of chlorophylls was suspended by mixing by swirling the pipette in the tube (vortexing or pipetting up and down is strictly prohibited since this can destroy protein complexes). After that, the sample was centrifuged (3,000 × g for 2 min, at 4°C) and the supernatant discarded. Then, the same process was repeated twice, once with WB2 and once with WB3.Thylakoid solubilization(Buffers required - SB)For thylakoid solubilization, two different approaches are followed based on the detergent used.First, for α-DDM solubilization, we solubilized the washed thylakoid pellet in 8-9 µl of SB (depending on pellet size, the bigger the pellet, the smaller the volume of SB that should be added) to obtain 10 µl final volume of the resuspended washed thylakoids. In this way, the chlorophyll concentration of the sample becomes 1 mg/ml. After solubilization in SB, 100 mM of n-dodecyl-α-D- maltoside (α-DDM) is added at equal volume (obtaining a final chlorophyll concentration equal to 0.5 mg/ml and a detergent to chlorophyll ratio of 50:1) and solubilized on ice for 30 min at 4°C.The fractional solubilization process was applied as digitonin solubilization was reported to be unsuccessful in Arabidopsis protocols (Järvi et al., 2011; Rantala et al., 2017). First, thylakoids were solubilized in SB as before to a chlorophyll concentration of 1 mg/ml, then 1 µl of 100 mM n-dodecyl-α-D- maltoside (α-DDM) was added and the sample kept on ice for 5 min. Then, 6 µl of 100 mM digitonin was added and the final volume filled to 20 µl with SB (the final chlorophyll concentration was 0.5 mg/ml and the detergent to chlorophyll ratio 30:1).",
    "Gentle shaking was applied to tubes (max 200 rpm in OrbitTM Digital Microtube and Microplate Shake) and solubilization performed for 25 min at 4°C.Finally, both solubilized samples were centrifuged (14,000 × g for 25 min, at 4°C) and the obtained supernatant was used as for all analyses presented in this work.BN-PAGE processBlue-Native Polyacrylamide Gel Electrophoresis(Buffer required - LB and RB)BN-PAGE was carried out using 3-12% w/v gradient and 1.0 mm thickness pre-casted 10 well gels. Before loading, samples were prepared at a ratio of 1:10 in loading buffer. A sample volume of 16 µl was loaded, which corresponds to a final concentration of 8 µg/ml Chls in each electrophoretic lane. Before loading the samples on the gel, the precast gels need to be installed on the electrophoretic chamber and the tank needs to be filled with running buffer and cooled down to 4°C. For our samples, we used a sub-zero water bath to keep the temperature of the electrophoretic system continuously below 2°C throughout the running period.Native electrophoretic conditionsThe run was performed on a Hoefer electrophoretic chamber at 65 V for 14 h (or overnight) at 4°C in the dark. The running buffer had the same composition for both anode and cathode, but before use, the cathode buffer was supplemented with loading buffer at a ratio of 1:1,000.Post BN-PAGE processesSoft staining and gel image acquisitionAfter the run, the gels were unmounted from the electrophoretic chambers and casting plates and washed in distilled water, fixed, and stained. BN-PAGEs were stained with the soft-staining solution (Figure 2) according to the procedure described by Farci et al. (2017). Gels were imaged on a white-light LED trans-illuminator using a digital camera (Canon EOS RP digital).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4144/bioprotoc-11-17-4144-g002.jpgFigure 2. Solubilization of pine (A, B) and spruce (C, D) thylakoids with different concentrations of α-DDM.",
    "A and C are RGB images of soft-stained gels taken with a digital camera. B and D are Coomassie-stained images of the same gels.2D Denaturing Polyacrylamide Gel ElectrophoresisFor 2D separation, denaturing Sodium-Dodecyl-Sulfate polyacrylamide gel electrophoresis (SDS-PAGE) was carried out according to Haniewicz et al. (2013). Briefly, the strips from the BN-PAGE were excised and denatured with Rotiload (Roth) at room temperature for 20 min. After denaturation, the strips were placed on top of a 10% denaturing SDS-PAGE (1.5 mm thickness) and sealed with 0.5% (w/v) agarose in cathode buffer. The molecular weight of the complexes isolated by 2D SDS-PAGE was estimated by plotting the retardation factor values (Rf, length of the band migration/length of the dye front) versus the log of the molecular weight of the molecular marker using a polynomial curve fit (second-order polynomial best-fit), according to the manufacturer's instructions. The obtained curve was used for calculating the apparent masses at the equivalent Rf of the 2D SDS-PAGE spots (data not shown). The masses were combined with western-blotting data for the identification of PSI and PSII subunits (see Step 5b).Denaturing electrophoretic conditionsThe run was performed on a Bio-Rad electrophoretic chamber and was carried out at 75 V for 3 h, at 4°C, in the dark. Freshly made cathode and anode running buffers were used.Post 2D SDS-PAGE processesStaining and gel image acquisitionAfter the run, the gels were unmounted from the electrophoretic chambers and casting plates and washed in distilled water, fixed, and stained. 2D SDS-PAGEs were stained with SYPRO-ruby staining (Figures 4 and 5) according to the manufacturer’s protocol. Gels were imaged on a white-light LED trans-illuminator using a digital camera (Chemidoc imaging system).",
    "Western blotting analysisAfter 2D SDS-PAGE, proteins were transferred on PVDF membranes and further used for western blotting analysis and identification of PSI and PSII antibodies, as described in Bag et al. (2020)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}