{
  "id": 18675,
  "origin_website": "Jove",
  "title": "Orthotopic Injection of Breast Cancer Cells into the Mammary Fat Pad of Mice to Study Tumor Growth.",
  "procedures": [
    "Animal experiments were approved by the animal welfare committee of the Leiden University Medical Center(LUMC).\n1. Preparation of Cells, Instruments and Mice\nA day before operation, shave the NOD/SCID gamma (NSG) mice from the fourth nipple to the midline and weigh the mice to verify that all mice have roughly comparable weights.\nAutoclave a scissor, two tweezers and two straight mosquito forceps (Figure 1A) .\nOn the day of operation, wash the human breast adenocarcinoma (MDA-MB-231) cells that will be injected once with phosphate buffered saline (PBS), pH 7.4 and trypsinize the cells. Quench the trypsin by adding 10 ml serum-containing DMEM media on top of the cells. Centrifuge the cells at 1,200 rpm for 7 min at RT to remove serum by resuspending the cells either in PBS or in media without serum. Centrifuge them again to remove traces of serum completely. Resuspend the cells in PBS or media.\nCount the cells with a hemocytometer and calculate the amount of cells. Use 500,000 cells/mouse in not more than 150 μl. Optional to PBS or media, resuspend the cells in matrigel.\n\tNOTE: Determine the amount of cells depending on the cell type used.\nPlace cells in a sterile microcentrifuge tubes and keep them on ice.\nFill one 50 ml conical centrifuge tube with 35 ml of PBS pH 7.4 and another 50ml conical centrifuge tube with 70% ethanol. Soak cotton swabs into each tube.\n2. Orthotopic Injection\nPerform the surgery in a sterile hood to maintain a sterile atmosphere. Anesthetize the mouse by subcutaneously injecting Xylazin/Ketamine mix at a dose of 10mg/kg, 100 mg/kg body weight respectively. Fix the mouse on a heating pad. Confirm the success of anesthesia by the lack of reaction to toe pinch.",
    "NOTE: If one is not very familiar with surgical procedures, surgery may take longer. Arrange the anaesthesia dose accordingly.\nApply ophthalmic ointment on the eyes of mice, to prevent the eyes from drying out.\nClean the shaved area by using the cotton swab dipped into ethanol prepared in step 1.6.  Alternating scrubs using betadine and alcohol three times in a circular fashion rotating away from the planned incision site should be performed.  Alternatively, use ionophore as a disinfectant.\nMake a small incision between the fourth nipple and the midline with a scissor and make a pocket by inserting the cotton swab moistened with PBS pH 7.4.\nUse a tweezer to expose the mammary fat pad. Observe the fat pad by its white colour.\nSqueeze the fat pad with the other tweezer from its base; by doing this, fully expose the fat pad (Figure 1B) to perform injections easily.\nHomogenize the cell mixture by pipetting up and down. Gently aspirate 50 µl of cell suspension into an insulin syringe and inject into the mammary fat pad by holding the needle horizontally. Confirm successful injection by checking for swelling of the fat pad.\nRelease the fat pad gently.\nSuture the incision by using a needle driver.  Make three throws by turning the suture around the needle driver in clockwise, anti-clockwise and clockwise direction.  Two knots per suture should be used.\n\tNOTE: Make sure the knots are tight otherwise mice can open up the sutures.\nAfter surgery, inject an analgesic, such as temgesic at 0.05-0.1 mg/kg bodyweight, subcutaneously in order to relieve the pain.\nDo not leave the animals unattended until they gain consciousness and maintain sternal recumbence. Place all the animals into different cages until they are fully recovered.",
    "To maintain sterility, use autoclaved cages and water. Change the cages every three days to keep the atmosphere clean.\n3. Harvesting Organs for Analysis\nAt the day of harvest, 8 weeks after the implantation of the cells, fill 15 ml conical centrifuge tubes with 3 ml Bouin’s solution for each mouse. In addition, use two 15 ml tubes filled with 5 ml formalin solution per mouse.\nAnesthetize the animals by injecting Xylazin/Ketamine, at a dose of 10 mg/kg 100 mg/kg body weight subcutaneously. Wait until the animal loses toe pinch withdrawal reflex.\nFix the animal with needles on a base. Make a long, vertical midline incision with scissors. Make two horizontal incisions right below the front leg and above the rear leg. Expose the tumor by pinning the skin to the base. Measure the tumor volume by using a caliper.\nDissociate the tumor from the skin using scissors. Snap freeze a part of the tumor in liquid nitrogen for RNA isolation. Place the other part, into the conical centrifuge tube filled with formalin to perform immunohistochemistry following paraffin embedding.\nGently take out the lungs. Place the left lung into Bouin’s solution. Keep the lung in solution for 3 days. Observe superficial metastatic foci clearly to naked eye. Optionally, place the right lung into formalin to verify micrometastasis using haematoxylin and eosin (H&E) staining.\n\tNOTE: Although, lung metastasis observed frequently in breast cancer, one might also want to collect bone, liver, brain and spleen to analyse metastasis. The cells at the metastatic area are denser and morphologically different and therefore can be distinguished easily from lung tissue.\nA day after harvest, aspirate the formalin solution from 15 ml tubes and replace with 70% ethanol. Embed the tissues in paraffin and perform immunohistochemistry studies.",
    "For blood analysis, open up the chest cavity with scissors. Withdraw 450 µl blood via cardiac puncture. Place blood sample in a microcentrifuge tube containing 50 µl of 3.2% sodium citrate. After blood is collected, spin it at 2,000 x g for 10 min. Store the plasma samples at -20 °C until further use.\n\tNOTE: There are several other blood collection techniques commonly used in practice20 and the technique that needs to be used depends on experimental setup and scientist’s choice. If blood sample is not required, euthanize the animal according to the animal protocol or as per the institution guidelines.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}