{
  "id": 19893,
  "origin_website": "Wiley",
  "title": "Ultrasound-Guided Approaches to Improve Orthotopic Mouse Xenograft Models for Hepatocellular Carcinoma",
  "procedures": [
    "The Huh-7-Luc human tumor cell line is transplanted into anesthetized 6-week-old mice weighing between 25 and 30 g by echo-guided intrahepatic injection with a high-resolution ultrasound imaging system. Injection of drugs into the tumor uses the same protocol. In this protocol one can expect that a tumor will be visible and measurable by ultrasounds 2 weeks after injection. One can follow growth until the ethical endpoint is reached, leading to sacrifice. Treatment efficacy is also discussed.\nMaterials\nDoxorubicin hydrochloride powder (e.g., Sigma-Aldrich, cat. no. D1515-10MG)\n0.9% (w/v) NaCl (saline), sterile\nHuh-7- Luc cells\nCell culture medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-rec-0001])\n0.25% Trypsin-EDTA (e.g., Thermo Fisher Scientific, cat. no. 25200072)\nDulbecco's phosphate-buffered saline (PBS) without calcium or magnesium (e.g., Eurobio, cat. no. CS1PBS01-01)\n0.4% Trypan blue (e.g., Bio-Rad, cat. no. 1450021)\nIsoflurane, for anesthesia induction\n6-week-old, 25 to 30 g, female NMRI-nu (Rj:NMRI-foxn1nu/nu) nude mice (e.g., Janvier Labs)\nHair removal cream\nLubricating eye gel\nUltrasound gel (e.g., EDM Medical Imaging)\nBuprenorphine\n1.5-ml microcentrifuge tubes\n37°C, 5% CO2 cell culture incubator\n37°C water bath\nCentrifuge and microcentrifuge\n75-cm2 cell culture flask (e.g., Falcon, part no. 353024)\nLight microscope\n15-, 30-, or 50-ml centrifuge tubes\nAutomated cell counter (e.g., Bio-Rad TC20) with corresponding counting slides (e.g., Bio-Rad, cat. no. 1450011)\nRodent anesthesia induction system with vaporizer/manifold\nHigh-resolution ultrasound system with imaging station (e.g., VisualSonics Vevo), including microinjection apparatus, mouse handling thermally regulated table with real-time monitoring of key physiologic parameters (respiration, heart rate), rectal temperature probes, and anesthesia line connected to anesthesia face mask\nUltrasound transducer, 25 to 55 MHz for abdominal scanning (e.g., MS550D)\n1-ml syringe with 30-G, 1-in. needle\nComputer running ultrasound imaging software (e.g., Vevo LAB VisualSonics imaging software version 3.0.0)\nHeating pad\nPrepare doxorubicin",
    "1. Dissolve 10 mg doxorubicin powder in 5 ml of 0.9% sterile NaCl to obtain a soluble, clear solution at a final concentration of 5 mg/ml. Prepare 5 aliquots with 1 ml stock solution, and store at −20°C for up to 12 months.\nDoxorubicin requires handling under a chemical extractor with adequate personal protective equipment (e.g., laboratory coat, gloves, masks).\nPrepare Huh-7-Luc cell line\n2. Produce 4 × 106 viable Huh-7-Luc cells per mouse.\nThis represents the target number of cells for this protocol. With the goal of injecting 20 mice, this protocol should be started ∼10 days before planning the injection. The results of this protocol will be 20 1.5-ml microcentrifuge tubes (1 per mouse) with a viable cell suspension that is ready for injection.\nHuh-7-Luc cells were generated in Thomas Baumert's laboratory as previously described (Wu et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-bib-0011]). Briefly, HuH-7 cells (Japanese Collection of Research Bioresources Cell Bank, Osaka, Japan) were transduced with a retrovirus produced from a luciferase-encoding pCLNCX vector and cloned by limited dilution. These cells are available upon request to Thomas Baumert ([email protected][href=https://currentprotocols.onlinelibrary.wiley.com/cdn-cgi/l/email-protection#3c485453515d4f125e5d4951594e487c4952554f484e5d125a4e]).\n3. Cultivate Huh-7-Luc cells as adherent cells in culture medium in a 37°C incubator with 5% CO2. To keep cell growth dynamic, do not allow cells to grow to complete confluency. Renew culture medium every 2 to 3 days. Perform trypsinization when cells reach around 90% confluency.\n4. Thaw cryovial of 2 million (2 × 106) Huh-7-Luc cells in a 37°C water bath until only a small block of ice remains (around 30 sec). Transfer cells as quickly as possible to culture medium, and centrifuge 3 min at 300 × g, 21°C to 23°C, to remove DMSO. Resuspend cell pellet into 15 ml culture medium, and transfer to a 75-cm2 culture flask. Incubate flask in a cell culture incubator.",
    "5. Check cell growth and morphology at least every 2 days under a microscope.\nHuh-7-Luc cells have the same morphology as HuH-7 cells, whose representative images can be found at https://clsgmbh.de/p7178_HuH7.html[href=https://clsgmbh.de/p7178_HuH7.html]. We view the cells under the microscope to check confluency of cells and to verify that no contamination (e.g., bacteria, fungi) has occurred.\n6. Remove culture medium, and wash with around 5 ml PBS. When cells reach ∼90% confluency (generally after 3 days), harvest cells by adding 3 to 5 ml warmed trypsin to the side wall of the flask, and gently swirl to cover the cell layer. Pipette up and down with a 10-ml pipette to detach cells and obtain a unicellular suspension. Add 5 to 10 ml culture medium to inactivate trypsin.\nCells can be harvested earlier than 3 days to keep on a weekend-free schedule if convenient.\n7. Transfer cell suspension to a centrifuge tube (15-, 30-, or 50-ml volume, as convenient), and centrifuge 3 min at 300 × g, room temperature. Remove supernatant and gently resuspend cells in 10 ml culture medium.\n8. Determine number of viable cells. To do so, take a 10-µl aliquot of cell suspension, and add 10 µl Trypan blue. Load 10 µl of this mixture on a counting slide, and proceed to counting. Determine percentage of viable cells and number of viable cells per ml. Multiply this number by 10 (volume in ml of cell suspension) to obtain the number of viable cells in the flask.\nThe percentage of viable cells should be >95%, and it is generally 99%.\nIn our hands, the expected number of viable cells is 8–12 × 106 per 75-cm2 flask at this first passage after thawing. For subsequent passages, the expected number of cells is around 15–20 × 106 per 75-cm2 flask depending on confluency.",
    "9. Split cells in as many 75-cm2 flasks as needed considering that you add 2–2.5 × 106 cells per 75-cm2 flask. Incubate in cell culture incubator.\n10. Repeat steps 4 to 9 until enough cells are produced, considering that 4 × 106 cells need to be produced per injected mouse.\nIt is recommend to produce more cells than needed (around 10% more), in order to ensure you have enough cells the day of injection.\nAs an example, a weekend-free schedule for injecting 20 mice would begin with mouse injection on a Thursday, which then allows for starting tumor imaging during the week (4 to 5 days later). To prepare cells for injection on a Thursday, one would begin 10 days prior: On day 0 (Tuesday), thaw 2 × 106 cells and transfer to a 75-cm2 flask. On day 3 (Friday), transfer cells to 3 different 75-cm2 flasks with 2 × 106 cells per flask (throw away remaining cells). On day 6 (Monday), transfer cells to 7 to 8 different 75-cm2 flasks with 2–2.5 × 106 cells per flask (throw away remaining cells). On day 9 (Thursday), perform injection (see step 14).\n11. Repeat steps 4 to 9, when enough cells are produced, the day of mouse injection. Then, resuspend Huh-7-Luc cells in culture medium at a concentration of 20 × 106 cells/ml.\n12. Aliquot cell suspension into sterile 1.5-ml microcentrifuge tubes (4 × 106 cells in 200 µl culture medium). Prepare, at a minimum, 1 microcentrifuge tube per mouse to inject (generally 20).\nThis volume of cell suspension takes into account the dead volume of the injection syringe/needle. For each mouse, only 50 µl cell suspension (1 × 106 cells) will be injected.\n13. Store tube on ice, and immediately proceed to step 14.",
    "Cells stored on ice can be kept for up to 4 hr, which is roughly the time required to inject all 20 mice.\nPrepare nude NMRI mouse\n14. Set up heating platform at 37°C.\n15. Place animal platform in an orientation that allows for correct placement of the MS550D imaging probe in front of the abdomen of the mouse and the isoflurane anesthesia nose clamp (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]A,B).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/83201a37-d6ab-40aa-9046-bbca7b218830/cpmo62-fig-0001-m.jpg</p>\nFigure 1\nUltrasound-guided injection setup and optimal positioning of mouse. (A) Mouse position and needle orientation. (B) Integrated rail system necessary for alignment of injection syringe and ultrasound scan head. (C) Animal platforms and ultrasound scan head controls. (D) Injection syringe controls.\n16. Anesthetize mouse in induction chamber with 3% to 5% isoflurane, and turn on flow meter between 500 and 1000 ml/min.\nThese parameters do not need to be adjusted based on body weight.\nWe recommend a minimum of 8 mice per condition to have statistically relevant results.\n17. Place mouse on the platform, and maintain anesthesia with a nose cone delivering 1% to 3% isoflurane at a rate of 100 to 200 m/min to prevent movement during the imaging session.\n18. Remove abdominal hair with hair removal cream, and apply lubricating gel to both eyes to prevent drying of the sclera.\n19. Gently insert rectal temperature probe, and tape paws to the echography electrodes after having applied ultrasound gel for electrical contact.\nPrepare coordinate of injection using the imaging station\n20. Prepare 1-ml syringe with 30-G, 1-in. needle.\n21. Place empty syringe with sheathed needle, bevel side oriented upward, in syringe clamp, and secure ultrasound transducer probe in the scan head clamp (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C).\n22. Align transducer parallel to the axis of the needle under visual control using fine manipulation.",
    "23. Fix scan head position by tightening the clamp (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C).\n24. Cover head of the transducer tip with ultrasound gel along the ultrasound emission beam.\nBe sure not to move the needle/transducer horizontally to ensure that you do not disturb horizontal alignment.\n25. Scan superior abdominal area with the transducer to obtain a coronal section of the liver.\n26. Move transducer in the anterior direction from the animal platform using the scan height control (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C).\nThis will not disrupt the x-axis alignment of the transducer to the long axis of the needle (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]B).\nSpecific areas of the liver (right lobe) can be targeted for injection by changing the vertical (y-axis) position of the needle and/or by moving the animal platform. This part of the liver offers suitable accessibility for injection by keeping the mouse in front of the operator.\n27. Load a new needle and syringe with injectate (see cell preparation in steps 2 to 14) to the final target volume. Be sure to remove air bubbles.\n28. Place syringe into the syringe clamp without adjusting the x-axis alignment.\nInject mouse\n29. Lower transducer onto the abdominal area using the scan head height control of the animal platform.\n30. Use animal platform adjustment controls (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C) to adjust the field of view and to target any desired injection site in the liver.\n31. With syringe in the fully retracted syringe clamp, slowly advance syringe towards the mouse's abdomen by turning the injection control clockwise (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]D). To permit clear ultrasound visualization of both the liver and the needle tip as it approaches the abdomen, use ultrasound gel over the left side of the abdomen, and optimize the acoustic window by setting a wide field of view on the echography control panel.",
    "32. Set focal point/zone at the target site for injection.\nMinor adjustments to the needle mount controls can optimize the image of the needle along its length.\n33. Activate needle guide software function to digitally extend a line along the long axis of the needle through to the target. Check that the tip of the needle is not in a large vessel (portal vein or inferior vena cava; Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0002]A).\nIt is safer to place the needle far from large vessels.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f8f22cfc-0cf9-434a-a2e1-17ccee8c02f6/cpmo62-fig-0002-m.jpg</p>\nFigure 2\nRepresentative ultrasound images of echo-guided injection and tumor. (A) Optimal position and alignment of the needle for injection of Huh-7-Luc tumor cells with 30-G needle buried within the right lobe of the liver. (B) Completed contour of tumor formation at 2 weeks after cells injection (2D area in blue). (C) Once contours have been drawn around the tumor in each slice, the software can reconstruct the tumor and quantify the volume.\n34. When tip is in the desired location, deliver injectate by pushing on the syringe plunger. Deliver 50 μl injectate (1 × 106 cells/ml complete medium) slowly over 5 to 30 sec.\nIn preliminary experiments, the site of injection was optimized and checked by injection of the same volume of Evans blue. This enabled verification that the product remained in the right lobe of the liver and that there was no leakage.\n35. Once injectate has been administered, slowly withdraw needle by counter-clockwise rotation of the injection control knob.\n36. Gently remove ultrasound gel from the tissue, and remove mouse from the anesthesia unit.\n37. Put mouse in cage placed on a heating pad until full recovery (i.e., normal movements and response to noise).\n38. Inject 0.1 mg/kg buprenorphine to minimize postprocedural pain.",
    "39. Place mouse into its home cage with full access to water and food.\n40. At 2 weeks after cell injection and when the tumor reaches 50 mm3, dilute doxorubicin stock solution to 4 different concentrations (4, 2, 1, and 0.5 mg/kg), and inject solution following the same technique as detailed in steps 14 through 39.",
    "At 4 to 5 days after tumor cell injection, we image the organ of interest using 2D and 3D imaging modes. We scan the changes in liver tissue, indicative of a potential tumor. The 3D mode allows for measurement of area, height, length, and volume of the tumor.\nMaterials\nInjected mouse (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-prot-0001])\nIsoflurane, for anesthesia induction\nUltrasound gel (e.g., EDM Medical Imaging)\nRodent anesthesia induction system with vaporizer/manifold\nHigh-resolution ultrasound system with imaging station (e.g., VisualSonics Vevo), including mouse handling thermally regulated table with real-time monitoring of key physiologic parameters (respiration, heart rate), rectal temperature probes, and anesthesia line connected to anesthesia face mask\nUltrasound transducer, 25 to 55 MHz (e.g., MS550D for abdominal scanning)\n3D motor assembly (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C)\nComputer running ultrasound imaging software (e.g., Vevo LAB VisualSonics imaging software version 3.0.0)\n1. Place anesthetized mouse on the animal platform in a similar way as described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-prot-0001], steps 14 to 17, for injection, and visualize liver tissue, vessels, and abdominal organs.\nAs in human HCC, tumors formed after Huh-7-Luc cell injection appear as nodules that are more echogenic (brighter) than surrounding normal tissue (Figs. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0002]B and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0003]A).\nIn some cases, areas of necrosis appear as black holes in the tissue, which can be confirmed by histology (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0003]B). An acoustic interface (i.e., a difference in contrast between two regions due to a shift in the speed of the ultrasound in the tissue) can also be observed between normal and tumor tissues. This difference is converted into brightness (white versus black) and can be converted by the system in acoustic intensity (e.g., 1400 W/cm2 in a region of interest in a tumor versus 100 W/cm2 in surrounding normal tissue).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/acdcaab0-e7e8-4c05-a839-252021b5e1d5/cpmo62-fig-0003-m.jpg</p>\nFigure 3",
    "Longitudinal follow-up of tumor growth. (A) Tumor formation at 1, 2, 3, and 4 weeks after injection (2D area in blue) and histogram for the surrounding area representative of the pixel count. (B) Histological stain of the tumor.\n2. Locate a putative tumor, and adjust the x- and y-axis for optimal image quality. Then, scan the entire tumor volume.\n3. Clip transducer onto the 3D motor. After adjusting the x- and y-axis positions, locate the tumor region, placing it in the center of the image display. Use the micrometer adjustors for fine adjustment (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C).\nThe 3D motor assembly for imaging of the tumor (see Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0001]C) is used for 3D reconstruction. Briefly, the probe is placed in a fixed arm that is then displaced by a step-by-step motor in a way to obtain a 2D image every 0.076 mm on a scan of 15-mm length. Then, 3D reconstruction is performed by superimposing these pictures on a z-axis using the Vevo LAB VisualSonics imaging software version 3.0.0.\n4. Observe tumor image from distal to proximal, and note length and position of the transducer at the midpoint.\n5. Scan a distance equal to the tumor length plus 3 to 4 mm on both sides.\n6. Review images and save the scan only if the whole tumor was scanned.\n7. Return mouse into its home cage.\n8. Use the software study management function for 3D volumetric analysis. Load desired 3D scan file for analysis, and initiate the volumetric analysis function.\n9. Trace tumor/tissue border around the perimeter of the tumor, and left-click to anchor specific points. When the entire border is traced, right-click to close the circle\n10. Add the region of interest on every each slice (z-axis) through the tumor depth in both directions.",
    "11. Complete volumetric analysis to derive a final, calculated tumor volume, and view as a solid surface.\nDue to an absence of tumors, it is not possible to quantify tumors in control mice. Nevertheless, a qualitative classification scheme can be designed: 0 (absence of tumor), + (small tumor), ++ (medium-sized tumor), and +++ (large tumor). This qualitative classification is based on the calculation of the tumor volume. We estimate a volume between 10 and 200 mm3 as small tumor, one between 200 and 500 mm3 as a medium tumor, and one >500 mm3 as a large tumor.\nWe use B-Mode imaging to acquire 2D and 3D images of an area of interest and for identification of anatomical structures. 2D quantification of tumor sizes is based on tracing the tumor/tissue border around the perimeter of the tumor (Figs. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0002]A and 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0003]A). Two diameters (D1 and D2) on both sides of the tumor are obtained, and the volume is extrapolated based on the following formula that assumes the tumor as a sphere: tumor volume = π/6 × (D1 × D2)3/2. 3D quantification of the tumor is obtained as described above using the tomographic reconstruction process (see postacquisition volumetric analysis; Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpmo.62#cpmo62-fig-0002]C). A linear regression between 2D and 3D measures showed a very good correlation up to a tumor volume of 1000 mm3 (n = 22, r = 0.9569, p < 0.0001)."
  ],
  "subjectAreas": [
    "Mouse Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}