{
  "id": 8902,
  "origin_website": "Jove",
  "title": "A Yeast 2-Hybrid Screen in Batch to Compare Protein Interactions",
  "procedures": [
    "1. Preparation of Media and Plates\nNOTE: All plates need to be made minimally 2 days before beginning the protocol. The media can be made at any point. However, the buffered yeast extract peptone dextrose adenine (bYPDA) needs to be made the day of which it will be used. Some media is made using a supplement mix containing a level of adenine that is larger than what is typically used. Most minimal media supplements specify 10 mg/L adenine. Supplements labeled '+40Ade' specify a total of 40 mg/L adenine.\nPrepare Glucose Solution (50% w/v). For 1 L, dissolve 500 g of D-(+)-Glucose in 800 mL of distilled water in a 1,000 mL beaker. Adjust volume to 1,000 mL of using a graduated cylinder and filter through a 0.2 µm sterile filter into a sterile 1,000 mL media storage bottle.\nPrepare Yeast extract peptone dextrose (YPD) plates. For 1 L, dissolve 20 g of Peptone and 10 g of Yeast Extract in 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder, fill up to 960 mL with distilled water. Pour into a 2,000 mL Erlenmeyer flask and add 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Use a pipette to add 40 mL of 50% glucose. Mix well by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.",
    "Prepare Complete synthetic minimal media (CSM)-Trp plates. For 1 L, dissolve 6.7 g of Yeast Nitrogen Base without amino acids into 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder, fill up to 960 mL of with distilled water. Pour into a 2,000 mL of Erlenmeyer flask and add 0.7 g of -Trp -Met dropout mix, 20 mg of methionine, and 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Use a pipette to add 40 mL of 50% glucose. Mix well by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.\nPrepare CSM-Leu-Met plates. For 1 L, dissolve 10.05 g of Yeast Nitrogen Base without amino acids into 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder and fill up to 940 mL of with distilled water. Pour into a 2,000 mL of Erlenmeyer flask and add 1.005 g of -Leu -Met dropout mix and 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Use a pipette to add 60 mL of 50% glucose. Mix well by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.",
    "Prepare CSM-Leu-Trp plates. For 1 L, dissolve 10.05 g of Yeast Nitrogen Base without amino acids into 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder, fill up to 940 mL of with distilled water. Pour into a 2,000 mL of Erlenmeyer flask and add 1.005 g of -Trp -Leu+40Ade dropout mix, 240 mg of adenine, and 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Use a pipette to add 60 mL of 50% glucose. Mix well by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.\nPrepare CSM-Leu-Trp-His plates. For 1 L, dissolve 10.05 g of Yeast Nitrogen Base without amino acids into 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder, fill up to 940 mL of with distilled water. Pour into a 2,000 mL of Erlenmeyer flask and add 0.975 g of -Trp -Leu-His+40Ade dropout mix, 240 mg of adenine, and 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Use a pipette to add 60 mL of 50% glucose. Mix well by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.",
    "Prepare CSM-Leu-Trp-His-3AT plates. For 1 L, dissolve 10.05 g of Yeast Nitrogen Base without amino acids into 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder, fill up to 940 mL of with distilled water. Pour into a 2,000 mL of Erlenmeyer flask and add 0.975 g of -Trp -Leu-His+40Ade dropout mix, 240 mg of adenine, and 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Use a pipette to add 60 mL of 50% glucose. Mix in 100 µL of a 1 M sterile stock of 3-amino-1,2,4 triazole (3AT) by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.\nPrepare LB-Kanr plates. For 1 L, dissolve 10 g of Tryptone, 5 g of Yeast extract and 10 g of NaCl in 800 mL of distilled water in a 1,000 mL beaker. Pour into a graduated cylinder, fill up to 1,000 mL of with distilled water. Pour into a 2,000 mL of Erlenmeyer flask and add 15 g of agar. Autoclave and cool in 37 °C water bath until water bath temperature has cooled to approximately 42 - 50 °C. Add 50 mg Kanamycin and mix by swirling.\n\t\nPour a series of 100 mm plates with 20 mL of media by pipette.\nPrepare YPD, CSM-Leu-Met, CSM-Trp, CSM-Leu-Trp and CSM-Leu-Trp-His media. Use the procedure above for plates except instead of pouring into an Erlenmeyer flask, pour into a media storage bottle and omit the agar.\nPrepare bYPDA (buffered YPDA). Take sterile YPD media and add 200 mg/L adenine in sterile distilled water. Adjust pH to 3.7 with HCl. Filter through a 0.2 µm sterile filter into a sterile bottle.",
    "Prepare Transformation Buffer: 2 M sorbitol, 1 M lithium acetate dihydrate, 10 mM Tris pH 7.6, 0.5 mM EDTA, 0.2 mM calcium chloride in distilled water. Filter through a 0.2 µm sterile filter into a sterile bottle.\nPrepare PEG solution: 70% w/v polyethylene glycol 3350 in distilled water. Sterilize by autoclave.\nPrepare Twirl: 8 M urea, 4% w/v SDS, 50 mM Tris pH 6.8, 10% v/v glycerol, 0.02% w/v bromophenol blue in sterile distilled water.\nPrepare sTE (strong TE): 50 mM Tris, 20 mM EDTA, pH 8.0 in distilled water. Filter through a 0.2 µm sterile filter into a sterile bottle.\nPrepare Zymolase stock solution: 10 mg/mL Zymolase 100T in 50 mM potassium phosphate dibasic pH 7.5, 50% v/v glycerol buffer in sterile distilled water (stored at -20 °C).\n2. Cloning and Verification of Bait Plasmids",
    "NOTE: Construction of Gal4-DNA-binding domain Plasmids. Currently, there are a variety of commercially available and academically available Y2H systems. DEEPN can accommodate many of these provided that the bait plasmid expressing the protein of interest fused to a DNA-binding domain is in a TRP1-containing plasmid. Other downstream requirements are that the sequence immediately upstream of the prey library insert is known and that a positive Y2H interaction can be scored by the production of His3 allowing for selection in media lacking histidine. Here we will describe use of a new Y2H bait plasmid (pTEF-GBD, Figure 2), however, other Y2H bait plasmids including pGBKT7 can be used as well. For construction and evaluation of bait plasmids, we will describe use of pTEF-GBD. As a general note, we recommend gene synthesis to produce an open-reading frame that adheres to the yeast codon bias to help ensure good expression and ease with cloning. Ensure that the cloning scheme allows for the bait to be in-frame with the Gal4 DNA-binding domain and that when cloning into the 3' site, a stop codon follows the bait-coding region.\nPrepare the plasmid vector. Plasmid pTEF-GBD allows for cloning a fragment encoding the protein of interest either 5' or 3' of the region encoding the Gal4 DNA-binding domain using a rapid assembly method. For insertion at the 5' site, digest 3 µg of pTEF-GBD with NarI and EcoRI or for insertion at the 3' site, digest with BamHI and XhoI for 2 - 4 h. Electrophorese sample in 1% DNA agarose gel containing 0.2 - 0.5 µg/mL ethidium bromide (EtBr) at 100 V. Excise the cut 5,630 bp TEF-GBD and purify using a DNA gel extraction kit in accordance to the manufacturer's instructions and quantify DNA by absorbance at 260 nm by spectrophotometer12.",
    "NOTE: Generation of bait-encoding inserts. DNA fragments encoding proteins or protein fragments of interest can be made using gene synthesis and available as uncloned fragments. It is recommended that codons are optimized for expression in Saccharomyces cerevisiae and online tools for codon optimization are included in the list of materials.\nFor 5' insertion, flank the DNA fragment encoding an ATG start codon by 5'-TTAAGAAAAACAAACTGTAACGAATTC-3' and 5'-GCGCCTATGTGTGAACAAAAGCTTATT-3', respectively. For 3' insertion in frame with the Gal4 DNA binding domain, flank the encoding fragment by 5'- ctgcatatggccatggaggccgaa -3' and 5'-tagtaactagcataaccccttggggcc-3'.\nFor plasmid construction, use the rapid assembly method as specified in manufacturer's directions for cloning fragments into cut pTEF-GBD.\n\t\nPlate all transformed E. coli onto LB-Kanr plates and incubate for 16 - 20 h at 37 °C. Colonies housing pTEF-GBD with the desired insert can be identified by PCR amplification using the oligonucleotides: 5'- CGGTCTTCAATTTCTCAAGTTTCAG -3' and 5'-GAGTAACGACATTCCCAGTTGTTC-3' for 5' insert and 5'-CACCGTATTTCTGCCACCTCTTCC-3' and 5'-GCAACCGCACTATTTGGAGCGCTG-3' for 3' insert. These oligonucleotides can also serve as primers for sequencing the insert.\nPlan on preparing >10 µg of each pTEF-GBD derivative and pTEF-GBD alone to provide material for sequencing and yeast transformations.\nUse the following PCR conditions: 3 min at 98 °C, followed by 25 cycles of 30 s at 98 °C, 30 s at 55 °C, and 2 min at 72 °C, followed by 5 min at 72 °C using a buffer containing 2.5 mM MgCl2, 0.5 U/100 µL DNA polymerase, and proprietary buffer.\n3. Expression of Gal4-DNA-binding Domain Fusion Proteins\nMake Competent Yeast.",
    "Streak out PJ69-4A yeast onto a YPD plate by taking a sterile wooden applicator, scraping 1 mm3 of a -80 °C frozen stock and rubbing it gently across the YPD plate. Move the wooden applicator down the plate so that each pass goes across an untouched part of the media surface. Incubate the YPD plate at 30 °C for 2 days or until single colonies are visible. Make the frozen stock of PJ69-4A yeast by suspending yeast in water or growth media, supplementing with DMSO to 7%, and storing at -80 °C.\nInoculate a single colony in 5 mL of culture of YPD in a 20 mm x 150 mm culture tube using a sterile wooden applicator and grow overnight at 30 °C in a shaking incubator at 200 rpm.\nInoculate 50 mL of YPD in a 250 mL of sterile Erlenmeyer flask with 4 mL of the overnight culture of PJ69-4A yeast strain. Grow in a shaking incubator at 30 °C, 200 rpm to an optical density (OD600) of approximately 1.2, as determined by spectrophotometry with a standard 1 cm light path. Growth usually takes 5 - 7 h.\nIsolate yeast by sedimentation in a 50 mL of conical tube at 4,696 x g for 5 min at room temperature in a benchtop centrifuge. Discard supernatant by dumping into liquid waste. Using a pipette, resuspend the pellet in 5 mL of transformation buffer and transfer to 15 mL of conical tube. Resediment to discard supernatant, and resuspend the yeast in 1 mL of final volume of transformation buffer with a 1000 µL pipette.\nIncubate yeast cells for 60 min at 30 °C while shaking at 200 rpm and then place on ice for 30 - 90 min.\nYeast plasmid transformation.",
    "In 1.5 mL of sterile microcentrifuge tube, add 1 µg of pTEF-GBD-based plasmid and 5 µL of 10 mg/mL Salmon sperm carrier DNA solution. Also include a tube containing only Salmon sperm carrier DNA as a negative transformation control. Add 100 µL of the ice-cold yeast cell suspension to each tube by pipette. Add 100 µL of 70% PEG solution with a 1000 µL pipette and mix gently by flicking the tube 5 - 10 times (do not vortex).\nIncubate at 30 °C, in a shaking incubator at 200 rpm for 45 min.\nHeat shock at 42 °C for 15 min.\nSediment in a microcentrifuge at 845 x g for 3 min at room temperature, pipette off and discard supernatant, resuspend pellet in 150 µL of sterile water by pipetting up and down, and spread over the surface of an CSM-Trp plate.\nPlace plates right side up in 30 °C incubator and incubate for 2-3 days until colonies are visible. Plates may be turned upside down to avoid condensation on the plate surface after incubation at 30 °C for 6 - 12 h.\nTake 2 - 3 colonies per transformation and streak as a patch onto a CSM-Trp plate using a sterile toothpick. Allow to grow for 24 h at 30 °C.\nMake lysates for protein expression.\n\t\nInoculate 3 mL of CSM-Trp liquid media with a match-head-size of yeast from the patch and grow overnight at 30 °C in a 20 mm x 150 mm culture tube, while shaking at 200 rpm. Make two overnight cultures per bait and empty pTEF-GBD vector.\nAdd 1 mL of YPD to each 3 mL of CSM-Trp overnight culture. Grow for 1 h at 30 °C, while shaking at 200 rpm. Check the OD of cells by spectrophotometer.",
    "Sediment an equivalent number of cells, normalizing according to the OD. Use sterile 1.5 mL of microcentrifuge tubes with a 5 min spin at 2,348 x g at room temperature in a microcentrifuge. Use a pipette to discard supernatant. The final stock corresponds to a minimum of 2.1 OD.\n\t\tNOTE: When calculating equivalent number of cells, it can occur that different volumes may be required from each overnight culture to achieve the minimal 2.1 OD.\nResuspend the pellet in 450 µL of 0.2 M NaOH by pipetting up and down. Incubate for 5 min at room temperature. Recentrifuge cells for 2 min at 2,348 x g at room temperature, and discard the supernatant by pipette.\nResuspend the pellet with 50 µL of TWIRL buffer by pipetting up and down carefully as to not make bubbles. Heat sample for 5 min at 70 °C.\nCheck for protein expression by SDS-PAGE.\n\t\nUse a gradient gel of 4 - 20% to ensure a large range of molecular weights can be resolved. Load equivalent amount (same OD) of samples into an SDS-PAGE gel and be sure to include at least one sample containing the unmodified pTEF-GBD vector13,14,15.\nAfter electrophoretic separation, transfer gel to nitrocellulose and immunoblot using anti-myc monoclonal or polyclonal antibodies and ECL detection solution (Figure 3).\n4. Self-activation Test\nStreak out the MATalpha yeast from the -80 °C stock corresponding to the strain housing the prey library of interest onto a YPD plate by taking a sterile wooden applicator, scraping a small amount of yeast out of the vial and streaking it across the YPD plate. Incubate the YPD plate at 30 °C for 2 days or until single colonies are visible. Patch a couple single colonies onto a YPD plate and incubate overnight at 30 °C.",
    "NOTE: The new strain developed here to house prey library is PLY5725 whereas some compatible commercially available Y2H libraries are housed in Y187.\nFollow the procedures in 3.3.1 - 3.3.4 to transform PLY5725 with the LEU2-based plasmid used to house the desired prey library. For libraries developed here, the corresponding plasmid is pGal4AD (pPL6343). To recover yeast transformants, plate onto CSM-Leu-Met plates. After colonies arise, streak as patches onto a CSM-Leu-Met plate and incubate for 24 h at 30 °C.\nFollow the protocol in 3.4 to confirm expression of pPL6343 empty vector using anti-HA monoclonal or polyclonal antibodies and ECL detection solution.\nStreak each of the transformed PJ69-4A yeast in a cross pattern with PLY5725 constructs on a YPD plate that was confirmed to express protein in protocol section 3.4 and 4.3 and incubate at 30 °C overnight. Take 1 mm3 of the cells where the two strains have grown together and patch onto separate CSM-Leu-Met, CSM-Trp, and CSM-Trp-Leu plates and grow 24 h.\n\tNOTE: Desired diploids will grow on the CSM-Trp-Leu plates. Growth on CSM-Leu-Met and CSM-Trp plates serve as a positive control for yeast growth.\nGrow diploids in 1 mL of CSM-Trp-Leu media overnight at 30 °C. Sediment 500 µL cells in a 1.5 mL of microcentrifuge tube at 2,348 x g, 3 min at room temperature in a microcentrifuge. Discard supernatant by pipette. Resuspend the cells in 1 mL of sterile water and repeat sedimentation and resuspension. Check the OD600 of cells.",
    "Make a series of 1:10 serial dilutions of each cell suspension using sterile water with the starting most concentrated solution of each at an OD of 0.5. Spot 5 µL of each dilution onto a CSM-Leu-Trp plate, a CSM-Leu-Trp-His plate, and a CSM-Leu-Trp-His+3AT plate. Incubate at 30 °C and inspect for growth daily over 3 days (Figure 4).\n\tNOTE: For the 1:10 serial dilution, pipette 10 µL of the tube containing an OD 0.5 into 90 µL of water and mix by pipetting up and down. Continue to make 1:10 serial dilutions until there is a total of six different concentrations to spot.\n5. Create Yeast Populations with Bait and Prey Library\nNOTE: The Y187 strain that houses commercial prey library plasmids does not mate well. Thus, the following optimized conditions are required to maintain complexity of the library. The PLY5725 strain containing Y2H prey libraries mates better and the same mating procedure can be used with this strain (Figure 5).\nInoculate a 3 mL of cultures of each of the PJ69-4A transformants carrying the various TRP1-containing pTEF-GBD bait plasmid in CSM-Trp media in a culture tube. Include two separate cultures containing the pTEF-GBD vector plasmid alone to serve as procedural controls. Incubate cultures at 30 °C, 200 rpm for 6 h and then dilute into a 25 mL of culture in a sterile Erlenmeyer flask for overnight growth.\nThaw a frozen (-80 °C) vial of the MATalpha cells containing the LEU2-carrying \"prey\" library at room temperature. Inoculate a 125 mL of CSM-Leu-Met media in a sterile Erlenmeyer flask with the whole thawed vial. Grow all cultures overnight at 30 °C with shaking at 200 rpm.\n\tNOTE: The OD600 of the overnight cultures needs to range between 1.0 to 1.5 before proceeding to next steps.",
    "Centrifuge 21 OD equivalents of each of the PJ69-4A transformant cultures with a 5 min spin at 4,696 x g at room temperature. For every 10 mating reactions desired, pellet 39 OD600 equivalents of the MATalpha strain carrying the library plasmids in separate 50 mL of conical tubes.\n\t\nResuspend cells in 10 mL of sterile water and re-pellet in new 50 mL of conical tube 4,696 x g 5 min at room temperature in a benchtop centrifuge. Using a pipette, gently remove the supernatant without disrupting the pelleted cells.\nResuspend pellets of PJ69-4A cells in 4 mL of and PLY5725 cells in 10 mL of bYPDA (pH 3.7).\nTo set-up mating reactions, add 1 mL of PJ69-4A transformed cells, 1 mL of MATalpha library-containing cells, and 1 mL of bYPDA pH 3.7 to new 50 mL of conical tube. Incubate at 30 °C with gentle orbital agitation (100 - 130 rpm) for 90 min.\n\t\nCentrifuge cells for 5 min at 4,696 x g, at room temperature in a benchtop centrifuge. Remove supernatant by pipette and resuspend the pellet in 2 mL of 1:1 bYPDA:YPD. Plate all 2 mL of onto a 100 mm YPD plate by pipette and incubate at 30 °C for approximately 20 h.\nHarvest cells from the YPD plates using a cell scraper to dislodge the cells into 2 - 3 mL of CSM-Leu-Trp media. Pipette dislodged cells into a 50 mL of conical tube. Rinse the plates 4 - 5 times with 2 - 3 mL of CSM-Leu-Trp media by pipetting up the media using a 1000 µL pipette and gently ejecting the media across the YPD plate surface.",
    "Centrifuge cells for 5 min at 4,696 x g at room temperature in a benchtop centrifuge. Discard supernatant by pipette and resuspend the cells in 40 mL of CSM-Leu-Trp media by pipetting up and down (do not vortex).\nTo estimate the number of diploid cells formed, dilute 4 µL of the diploid mixture into 200 µL and 2000 µL CSM-Trp-Leu media. Plate 200 µL of each dilution onto a CSM-Leu-Trp plate.\n\tNOTE: The two plates represent a 1:10,000 and 1:100,000 fold dilution of the stock of diploids harvested and yielding an expected ~9,000 - 27,000 colonies on the 1:10,000 dilution plate after incubation at 30 °C for 36 - 40 h. Check plates after step 5.7. A minimum number of 200 colonies on the 1:10,000 dilution plate is required to proceed to step 5.8\nImmediately take the remainder of each 40 mL of cell resuspension and inoculate a 1,000 mL of Erlenmeyer flask containing 500 mL of CSM-Leu-Trp media. Take an initial OD600. Incubate these flasks at 30 °C with shaking at 180 rpm until they reach saturation (~2.0 OD/mL). This typically takes about 36 - 40 h. Monitor growth at 24 h then again at 36 h by OD600.\nUsing a pipette, remove 20 mL of aliquots from each of the saturated 500 mL of cultures and innoculate 2,000 mL of Erlenmeyer flasks, one containing 750 mL of CSM-Leu-Trp media and the second containing 750 mL of CSM-Leu-Trp-His with the lowest level of 3AT that eliminates background (previously determined in Section 4.5). Mix the new cultures (770 mL) well by swirling and take an initial OD600.",
    "Incubate cultures at 30 °C while shaking at 180 rpm until reaching saturation, which typically occurs within 24 h for the unselected CSM-Leu-Trp culture and can take over 70 h for cultures under selection for Y2H interactions.\nOnce cultures have reached saturation (OD ~2.0), remove 11 mL of by pipette, sediment the cells with a 5 min spin at 4,696 x g at room temperature, discard supernatant by pipette, and freeze at -20 °C or continue onto DNA extraction. The selected and unselected samples will both be used for deep sequencing.\n6. Sample preparation for DEEPN Deep Sequencing\nDNA extraction.\n\t\nUse a pipette to resuspend cell pellets from protocol section 5.7 in 500 µL of sTE buffer and transfer to a 1.5 mL of microcentrifuge tube. Add 3 µL of betamercaptoethanol and 10 µL of Zymolase stock. Mix well and incubate in the 37 °C incubator for 24-36 h.\nExtract the sample two times with 500 µL phenol/chloroform/isoamyl alcohol while using a fume hood16.\nAdd 7 µL of 4 M NaCl, 900 µL of ice cold 100% ethanol (ETOH), mix by inversion and either freeze -20 °C or continue to sediment DNA by spinning at 21,130 x g for 10 min at room temperature in a microcentrifuge.\nDiscard supernatant by pipette. Wash the pellet thrice with 900 µL of 70% ETOH.\nSediment pellet 21,130 x g for 2 min and remove residual ETOH wash by pipette. Dry pellet for 7 min at 42 °C.\nResuspend pellet in 120 µL of 0.1x sTE in a 37 °C water bath for 90 min, flick the tubes to mix every 30 min.",
    "Pipette 60 µL of extracted DNA into a sterile 1.5 mL of microcentrifuge tube. Add 120 µL of sTE, 3.5 µL of RNase A stock, flick to mix and incubate at 37 °C for 1 h.\nEthanol precipitate as previously done in Section 6.1.3 - 6.1.5, but use 7 µL of 5 M ammonium acetate instead of 4 M NaCl.\nResuspend RNase A-treated DNA in 55 µL of 0.1x sTE in a 37 °C water bath for 90 min, flick the tubes to mix every 30 min. Quantify DNA by absorbance at 260 nm on a spectrophotometer.\nPCR cDNA inserts.\n\t\nPerform two, 50 µL PCR reactions per DNA sample. Each reaction contains 25 pmol of each forward and reverse primer matching the prey-library plasmid (see materials). Reactions also contain 25 µL of High-Fidelity 2x PCR Master Mix, 5 µg of DNA sample, and water up to 50 µL. Amplify reactions for 25 cycles with extension times of 3 min at 72 °C, an anneal temperature of 55 °C for 30 s, and denaturing at 98 °C for 10 s. Precede cycling by a 30 s denaturation at 98 °C and follow with a 5 min incubation at 72 °C.\nAnalyze 4 µL of each PCR reaction by 1% DNA agarose gel electrophoresis with the DNA agarose gel containing 0.2 - 0.5 µg/mL EtBr17. Visualize DNA sample by UV transillumination. Samples will show a smear of DNA around 1 - 3 kb, where the banding pattern may be found for samples where a Y2H interaction was selected (Figure 6).\nCombine duplicate PCR samples and purify using the PCR purification kit in accordance to the manufacturer's instructions and quantify DNA by absorbance at 260 nm on a spectrophotometer.\n7. Deep sequencing",
    "NOTE: Sample preparation and sequencing on a deep sequencing platform is typically available in commercial and academic DNA sequencing core facilities.\nShear 600 ng of PCR product using a high performance ultra-sonicator to give fragments of an average length of ~300 bp.\nGenerate indexed sequencing libraries using a preparation kit for deep sequencing that adds linkers encoding barcodes, priming sites, and capture sequences asymmetrically on the ends of the DNA fragments.\nPerform library preparation according to manufacturer's instructions. Pool indexed libraries and sequence as long paired-end reads on a deep sequencing platform (e.g., 2 x 150 bp PE reads). The desired number of reads targeted for each sample is between 10 and 40 million, with more reads desired for the unselected populations that are typically more complex. We recommend at least 20 million or more reads for the unselected populations.\n8. Bioinformatic Processing and Verification\nProcess DNA sequencing data in the form of fastq with a set of stand-alone software programs built to (1) map sequence read files in a universal SAM format (2) quantify gene enrichment between datasets (3) perform statistical analysis of data in order to rank which candidate genes are positive for Y2H interaction (4) provide information as to what region(s) and what translational frame each of the prey cDNA per gene fragments that yield positive Y2H interactions are comprised, and (5) provide tools to reconstruct not only the 5' but also the 3' end of the interacting fragments allowing their reconstruction and verification in a traditional Y2H format. Operation of these programs is detailed in the accompanying study.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}