{
  "id": 10570,
  "origin_website": "Jove",
  "title": "Co-transplantation of Human Ovarian Tissue with Engineered Endothelial Cells: A Cell-based Strategy Combining Accelerated Perfusion with Direct Paracrine Delivery",
  "procedures": [
    "All procedures involving animal subjects have been approved by the Institutional Animal Care and Use Committee (IACUC) at Weill Cornell Medical College. All xenotransplantation experiments using ovarian tissue were performed in accordance with relevant guidelines and regulations. Human ovarian tissue was collected from patients scheduled for chemotherapy or radiotherapy for cancer treatment or prior bone marrow transplantation. The institutional review board (IRB) Committee of Weill Cornell Medical College approved the collection of tissue for potential autologous use, and upon the patient's informed consent a donation of up to 10% of their ovarian tissue for research use was performed.\n1. Collection of Human Ovarian Tissue\nNOTE: When an ovarian tissue is transported from a remote facility transit, time should not exceed 5 h18,19.\nCollect the ovarian tissue and rinse with a sterile saline solution.\nPlace the ovary in a sterile container.\nPour Leibovitz's L-15 medium until the ovary is completely immersed in the medium.\nClose and seal the container.\nTransport the container on ice.\n2. Processing the Procured Ovarian Tissue, Adapted from Schmidt et al.18\nPreparations for ovarian processing and freezing\nPrepare 100 mL of medium for processing: Leibovitz's L-15 medium 99 mL + 1 mL antibiotic-antimycotic solution. Filter media using 0.2 µm filter. Keep the medium refrigerated.\nPrepare 100 mL of freezing solution using DMSO as a cryo-protectant. Add 69.64 mL Leibovitz's L-15 medium, 17.66 mL fetal bovine serum (FBS), 3.42 g of sucrose (to create a final concentration of 0.1 mol/L), 10.65 mL DMSO (to create a final concentration of 1.5 mol/L), and 1 mL antibiotic-antimycotic solution. Filter the medium using a 150 mL filter unit, 0.2 µm. Store the medium at 4 °C.\nSterilize the surgical tools using an autoclave programmed for a wrapped solids sterilization cycle.\nUpon arrival of the tissue",
    "Set the sterile surgical tools in the biosafety cabinet: scalpel with blade number 21, sharp fine curved scissors and forceps at varied sizes: long (about 150 mm length) and 2 medium-sized (about 110 mm length).\nWear sterile gloves, open the container within the biosafety cabinet. Take the ovary and place it in a 150 mm Petri dish and pour cold medium prepared in step 2.1.1 on top of the ovary to prevent dehydration of the ovarian tissue.\nIsolate the ovary from any residual tissue and rinse it with cold medium until it's devoid of tissue and blood.\nPlace the ovary in a clean 150 mm Petri dish, add cold medium, prepared in step 2.1.1 until the ovary is half submerged in it.\nDissection of the ovarian tissue\nBisect the ovary and remove the medulla first by sharp dissection, using curved fine scissors. Then scrape the medulla away, using a sterile scalpel with a blade number 21. Precede until the cortical tissue is 1-1.5 mm in thickness.\nCut the cortical tissue into slivers of 2-3 mm in width, the length of the strip will be the entire length of the ovarian piece that was processed.\n3. Ovarian Tissue Slow Freezing, Adapted from Newton et al. and Oktay et al.6,20\nPreparation for freezing\nLabel cryovials (1.8 mL).\nAdd 1.5 mL of the freezing solution prepared in step 2.1.2 to each vial.\nTransfer one cortical strip per cryogenic vial containing the freezing solution.\nEquilibrate the cortical strip for 20 min on a rotating plate, apply gentle agitation at 4 °C.\nSlow freezing of ovarian tissue\nLoad the cryovials into a programmable planer freezer starting at 0 °C.\nCool at 2 °C/min to -7 °C.\nKeep the tissues at this constant temperature for 10 min.",
    "Perform manual seeding for ice crystal nucleation induction, by touching each cryovial with a cotton tip immersed in liquid nitrogen (LN2).\nContinue to cool at 0.3 °C/min until sample temperature reaches -40 °C.\nCool at a faster rate of 10 °C/min to -140 °C.\nTransfer cryovials to the dewar for storage in LN2 (-196 °C).\n4. Preparations for the Surgeries (Bilateral Oophorectomy and Co-transplantation)\nPreparation of plates\nA day prior to thawing the ovarian tissue for transplantation\n\t\t\nPlace a piece of a plastic paraffin film at the bottom of a 50 mm Petri dish, spray it with 70% Ethanol until it will be completely covered.\nLeave the Petri dishes overnight in the biosafety cabinet. Prepare 2 Petri dishes per mouse.\nAt the day of surgeries\n\t\t\nAspirate the ethanol from the Petri dish containing the plastic paraffin film within the biosafety cabinet.\nLeave the Petri dish lead half open until ethanol evaporates completely.\nClose the lid of the Petri dish when the plastic paraffin film is completely dry. Keep it within the biosafety cabinet.\nLabel wells of a 6 well plate accordingly, 0.1 mol/L Sucrose+ 1 mol/L DMSO, 0.1 mol/L Sucrose+ 0.5 mol/L DMSO, 0.1 mol/L Sucrose, Basic Thawing Solution (BTS), Medium.\nPreparation of the solutions\nPrepare 100 mL of BTS: Leibovitz's L-15 medium 79 mL + FBS 20 mL + Antibiotic-Antimycotic solution 1 mL. Filter with a 0.22 µm filter system.\nPrepare 10 mL of BTS with 0.1 mol/L Sucrose. Scale 0.342 g of Sucrose and add 10 mL of BTS prepared in step 4.2.1, Agitate gently until the Sucrose is completely dissolved. Filter the solution using a syringe filter 0.22 µm.\nPrepare the solutions according to Table 1. Cover tubes containing DMSO with aluminum foil. Keep refrigerated until use.\n5. Ovarian Tissue Rapid Thawing",
    "Take out of the LN2 dewar a vial containing frozen ovarian tissue and keep it at room temperature for 30 s.\nWipe the vial clean using a tissue paper.\nImmerse the vial in a 30 °C water bath for 1-2 min until its' content is thawed.\nOpen the vial and place the cortical strip in the first well that contains 3ml of the first solution (0.1 mol/L Sucrose+ 1 mol/L DMSO, prepared in step 4.2.3).\n\tNOTE: All steps involving opening the lid of the plate will be done under laminar flow.\nIncubate the 6 well plate on a rotating plate at 4 °C for 5 min. Keep the plate covered with aluminum foil for this step.\nTransfer the cortical strip into the second well containing 3 mL of the second solution (0.1 mol/L Sucrose+ 0.5 mol/L DMSO, prepared in step 4.2.3).\nIncubate the 6 well plate on a rotating plate for gentle agitation at 4 °C for 5 min. Keep the plate covered with aluminum foil for this step.\nTransfer the cortical strip into the third well, containing 4 mL of solution (BTS with 0.1 mol/L Sucrose, prepared in step 4.2.2).\nIncubate on a rotating plate for gentle agitation at 4 °C for 5 min.\nTransfer the cortical strip into the fourth well containing 4 mL of solution (BTS, prepared in step 4.2.1).\nIncubate on a rotating plate for gentle agitation at 4 °C for 5 min.\nTransfer the cortical strip into the last well containing 4 mL of cold medium (prepared in step 2.1.1). Keep thawed ovarian tissue on ice until performing the transplantation.\n6. Encapsulation of the Ovarian Tissue\nPrepare the following solutions\nPrepare 25 mL of 20 mmol/L HEPES buffer in 0.9% saline. Filter and store at 4 °C.",
    "Prepare 1 mL of CaCl2 at the concentration of 1 mol/L. Filter and store at 4 °C.\nPrepare a Fibrinogen 50 mg/mL stock solution\nAdd 1 g of Fibrinogen into 20 mL of 20 mmol/L HEPES buffer in 0.9% saline by slowly mixing fibrinogen into the HEPES buffered saline over several hours at 37 °C.\nLabel 1.7 mL micro-centrifuge tubes.\nFilter the solution through a 0.45 µm syringe filter and then through a 0.2 µm syringe filter.\nAliquot the solution into 200 µL into micro-centrifuge tube and store at -20 °C.\nPrepare a Thrombin 100 U/mL stock solution\n\tNOTE: Thrombin solutions adsorb to glass, aliquot the solution in plastic tubes/vials.\n\t\nAdd 2.5 mL of 0.9% sterile saline to 250 U of Thrombin.\nGentle shake until the solution to completely dissolve.\nLabel 1.7 mL micro-centrifuge tubes.\nFilter through a 0.2 µm syringe filter, aliquot 50 µL into micro-centrifuge tubes and store at -80 °C.\nMake a Fibrin clot of 70 µL, obtaining a final concentration of 10 mg/mL fibrinogen and 5 U/mL Thrombin\n\tNOTE: Make sure to work fast, the solution clots in a few seconds. Also, avoid the addition of bubbles to the mixture.\n\t\nPrepare a Fibrinogen solution in a 1.7 mL micro-centrifuge tube.\n\t\t\nAdd 360 µL of 20 mmol/L HEPES Buffer in 0.9% saline solution to the aliquoted 200 µL of the Fibrinogen stock, prepared in step 6.2.4.\nMix by gentle pipetting.\nKeep it on ice.\nPrepare a Thrombin solution in a second micro-centrifuge tube.\n\t\t\nAdd 148.7 µL of DMEM to the aliquoted 50 µL of the Thrombin stock, prepared in step 6.3.4.\nMix by gentle pipetting.\nAdd 1.3 µL of 1 mol/L CaCl2.\nMix by gentle pipetting.\nKeep it on ice.\nPrepare a single cell suspension, In a third micro-centrifuge tube.",
    "Detach the engineered endothelial cells from the plate using an enzyme cell detachment medium.\nSpin down the and count the cells using a hemocytometer with a cover glass.\nUse 20,000 cells per every 1 mm2 of ovarian tissue. Calculate 20,000x area of ovarian tissue in mm2.\nSpin down the engineered endothelial cells and re-suspend it in basic medium (DMEM) to reach a total volume of 16.8 µL.\nKeep it on ice.\nPlace a piece of ovarian tissue on a sterile gauze sponge to dry it for a few seconds.\nPlace the piece of ovarian tissue on top of the plastic paraffin film within the 50 mm Petri dish.\nAdd 39.2 µL of the Fibrinogen solution, prepared in step 6.4.1.2, into the cell suspension prepared in step 6.4.3.4, mix by gentle pipetting. Keep it on ice.\nAdd 14 µL of the Thrombin solution prepared in step 6.4.2.4. Mix gently by pipetting once. Work fast.\nPlace the mixture on top of the ovarian tissue, pipet it in the form of an elongated droplet.\nPlace the Petri dish with the clot in the incubator at 37 °C.\n7. Bilateral Oophorectomy and Co-transplantation of Human Ovarian Tissue with Engineered Endothelial Cells to NSG Mice\nNOTE: Ten to fourteen-week-old female NSG mice21 were used (Jackson Labs).\nPrepare all surgical tools, as elaborated in step 2.1.3, make sure you have all sutures, pads, and surgical tapes handy.\nAnesthetize the mouse using an anesthesia system with Isoflurane.\nPlace the mouse in the induction chamber, close lid and open the appropriate stopcock.\nOpen flowmeter to 1,000 mL/min. Turn on the vaporizer and set it to deliver 2-3.5%.\nObserve effects of anesthesia; loss of consciousness, slow and regular breaths.\nTransfer to the nose cone to maintain anesthesia. Turn the vaporizer to deliver 1-3%, depending on vital signs.",
    "Verify absence of pedal or tail reflex. If the reflex is present, increase isoflurane until it's absent.\nTrim the mouse's back hair, from the tail up to the clavicles line, using an electric hair trimmer.\nPlace the mouse in a prone position on the surgical platform.\nFix the nose cone to the surgical platform using a surgical tape.\nTape the mouse's limbs gently to the surgical platform using a 1.25 cm-wide surgical paper tape.\nUse a sterile lubricant jelly and insert a thermometer PR. Fix the thermometer by taping it to the surgical platform using a 1.25 cm wide perforated plastic surgical tape.\nTape the tail to the surgical platform by using a 2.5 cm wide surgical paper tape.\nHeat, using an infrared or a hot water heating pad, and monitor the mouse's body temperature throughout the procedure. Keep body temperature within the range of 35-37 °C.\nClean the trimmed area with a sterile Povidone-Iodine Solution swab stick and wipe using sterile alcohol prep.\nRepeat step 6.9 twice more.\nPlace a drop of sterile ocular lubricant vet ointment over each of the mouse's eyes to protect from dehydration and damage to the cornea.\nCover the mouse using a sterile surgical drape.\nInject Buprenorphine (1 mg/Kg) sub-cutaneous (S/C).\nPerform a longitudinal medial dorsal incision using a scalpel (blade #21).\nPerform a bilateral oophorectomy, use a dorsal approach.\nFree the subcutaneous connective tissue by blunt dissection using the scissors.\nPinch the fascia laterally to the midline make an incision and reach the peritoneal cavity using the sharp scissors.\nGrab the ovarian fat pad and the ovary gently with tweezers and pull it out of the abdominal cavity.\nGrasp the ovary and the fat pad with a vascular clamp.",
    "Ligate the ovary and the fat pad using a 4/0 monofilament absorbable suture at the base of the ovary, distal to the fallopian tube.\nClip the ovary distal to the tie. Make sure there is no bleeding from the base of the stump.\nPlace the tissue back into the abdominal cavity and suture the fascia using a 6/0 braided absorbable suture.\nRepeat stages 7.15.1-7.15.7 at the contralateral side.\nCo-transplant the ovarian tissue.\nPerform a horizontal incision in the fascia above the Gluteus Maximus, at the length that fits the clots dimensions. Create a pocket within this virtual space by opening the scissors underneath the fascia.\nPick up one piece of encapsulated cortical tissue, as prepared in step 6.4.8 and place it in this pocket.\nSuture the fascia using a 6/0 braided absorbable suture.\nRepeat stages 7.16.1-7.16.3 at the contralateral side as well.\nClose the dorsal wall using simple interrupted stitches with a 4/0 monofilament absorbable suture.\nInject Lidocaine 0.5% (1.2 mL/Kg) S/C at the incision site.\nUse a sterile alcohol prep to clean the skin.\nTurn off the isoflurane while monitoring the mouse's temperature.\nProvide 1-2 min of O2, without Isoflurane. Keep on warming the mouse until it starts to move and return to consciousness.\nPlace the mouse in a clean recovery cage and later house the mouse in a separate cage until the complete healing of the surgical wound.\nInject Buprenorphine (1 mg/Kg) S/C as needed every 8-12 h, for 24 h postoperatively.\nKeep the mice in separate cages when all food, water, bedding, and cages are autoclaved, until the end point of the experiment. Keep the cages in a pressurized ventilated room. Use personal protective equipment whenever handling the mice.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}