{
  "id": 6641,
  "origin_website": "Bio",
  "title": "Optogenetic Food Odor Avoidance Assay",
  "procedures": [
    "Fiber optic creation (Figures 1A and 1B)Cut ~4-5 inches of the optic fiber, providing you with ample material to work with for your implant. Strip ~2” of optic fiber with T10S13 micro-strip stripping tool. The exact length doesn’t matter, as long as it’s longer than the length of the ceramic ferrule, which is 6.4 mm.Line the stripped part of fiber with the Bondic liquid plastic welder, and insert the optic fiber into the large bore side of the ceramic ferrule. Slide the stripped fiber through the ferrule until it naturally comes to a stop at the non-stripped portion of the fiber.Secure the optic fiber in the ceramic ferrule by curing the liquid plastic with UV light. This takes about 2 min.Cleave off the excess stripped fiber from the small-bore end of the implant using a diamond knife. To cleave, gently score the fiber perpendicular to the implant, and then pull off excess fiber using the bare fiber gripper.Cleave the optic fiber at the large bore end, which is the portion of the fiber optic that is inserted into the brain, to the correct length for your implant site using a diamond knife. Ensure the length is approximately 300 µm above the target brain region. In other words, the total length of the non-stripped fiber = x µm - 300 µm (where x is the appropriate target depth). For example, to target a region 3 mm ventral from the skull, the fiber optic should measure 2.7 mm. Measure the length accurately using a caliper. Best cleavage is obtained by gently scoring the fiber perpendicularly, and then pulling straight away from the cleavage site, causing the excess fiber to “pop” off. After cleavage, this end of the fiber should be a smooth, flat circle without shards or cracks.",
    "Poor cleavage will result in poor light output, as this end of the implant cannot be polished.Using a polishing disk and a hemostat to hold the implant in place, polish the ferrule tip (small-bore end) on polishing paper (placed on top of the rubber polishing mat) proceeding from high to low grit (30 µm down to 0.02 µm) in a Figure 8 motion. Spend about 1-2 min on each grit. The higher grit polish paper is used to fix and chips or shards in the fiber, creating a flat surface. Once the surface of the fiber is smooth and level, progress in descending grit order to continue polishing the fiber, ensuring maximum light output by going from a rough surface to a smooth surface. The small-bore end of the fiber should be very shiny and clear once it is properly polished.Confirm transmittance of the optic fiber. Check the shape of the laser beam and power output. The shape of the laser beam should be a circle, and if it is polished nicely you will even see concentric circles (Figure 1B). Depending on the light source/power used, the minimum light output should be 1 mW. You can check light output using an optical power meter. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191016/20191016024748_8355.jpgFigure 1. Fiber Optic implantation in Mouse. A. Ceramic ferrule orientation for optic fiber and example final optic fiber implant. B. Optimal laser beam shape after polishing is a clean circle with high light output, and if polished and cleaved well, contains concentric circles. In comparison, poor laser beam shapes are fuzzy or misshaped circles with lower light output. C. Mouse skull exposed with diagram indicating bregma and lambda for stereotaxic injection. D. Mouse with bilateral fiber optic implants, pink skull cap (acrylic), and metal holding bar (18G needle).",
    "Surgery preparationSterilize surgery area using 70% ethanol, and sterilize surgical instruments using disinfectant (Germinator500) followed by 70% ethanol.Treat mouse with 5 mg/kg meloxicam and 10 mg/kg sterile saline subcutaneously 30 min prior to surgery. Repeat meloxicam injection every 24 h for a minimum of 72 h while monitoring animal for signs of pain or distress. Prepare your micropipette for injection. Pull a 3.5” glass pipette with a glass pipette puller, with the tip being about 1 cm long. Once pulled, snip off about 1 mm of the glass tip with surgical scissors to ensure the end of the tip is open. Back-fill the glass pipette using a MicroFil 28 gauge/67 mm needle and 1 ml syringe filled with sterile mineral oil to prevent contamination, and load the pipette onto the Nanoject II. Empty the pipette of mineral oil and then re-fill with the desired volume of virus, depending on your region of interest. Small regions may require as little as 20 nl, while larger regions may require 500 nl or more. Weigh the mouse and sedate with sufficient isoflurane (1-4% isoflurane diluted in 100% oxygen), monitoring vitals of the animal. Shave the mouse’s scalp and clean with alcohol/povidone-iodine swab (70% and 10% respectively).Place the animal on the stereotaxic rig by hooking their front incisor teeth into the mouth bar. Straighten the animal, and then fix the ear bars into the ear canals. Once secure, tighten the nose bar firmly over the nose, without blocking airflow.Maintain the animal under anesthesia using 1-3% isoflurane diluted with 100% oxygen using a Vetequip vaporizer. The dosage of isoflurane depends on the physiological state of the animal as monitored by response to tail pinch. Maintain proper thermoregulation during surgery by using a heat pad set to 37 °C.",
    "Apply ophthalmic ointment to mouse’s eyes to prevent dryness and discomfort during surgery.Viral vector injection (Figure 1C)Make an incision in the scalp with surgical scissors at the posterior end of the brain, and cut anteriorly towards the olfactory bulb in a straight line. Use bulldog clamps to pull the skin away from the skull, exposing the skull. Keep the skull moist during surgery with sterile saline. To calibrate the Leica Angle Two Stereotax system, locate Bregma and then lower the tip of the micropipette, mounted onto the Nanoject II on the stereotaxic holder, to rest lightly on it. Then click “at Bregma” in the software. After identifying Bregma, raise the needle, and check the z coordinates by moving 1.5 mm to the left and right of Bregma, lowering the micropipette to touch the skull carefully, and take note of the z coordinate. The skull will need to be adjusted until the tilt is level, with a margin of error of ± 0.03 mm. After establishing the medial-lateral axis using Bregma, Lambda is used to establish the anterior-posterior axis. Once again, lower the micropipette to lambda and take note of the z coordinate. Adjust the skull until the dorsal/ventral coordinates of Lambda and Bregma are within ± 0.03 mm of each other, selecting “At Lambda” once level. Identify your injection site using coordinates from the Allen Brain Atlas (installed in the Leica Angle Two software). It is best to validate coordinates empirically before beginning an experiment. Make a small burr hole craniotomy (< 1 mm) over the injection site using a hand-held dental drill with a 0.5 mm drill bit. Clear bits of skull away from the center of the craniotomy.",
    "Lower the micropipette slowly to the injection site (~3 mm/min) and upon arrival at the target site, wait 5 min before injecting virus to allow the brain to settle. Inject discrete volumes of virus every 30 s (100 nl or less) using the Nanoject II. Once the total volume of virus has been injected, wait another 5 min before slowly raising the needle out of the brain. Note: Ensure that the micropipette does not become clogged or break during the surgery. To check for a clogged micropipette, eject a small volume of virus before lowering the micropipette into the brain, and ensure that virus flows out of the micropipette. If no virus appears, snip the end of the micropipette and re-calibrate Bregma.  If you are doing bilateral injections, repeat Procedure C for the opposite side. Keep skull moist during injections using sterile saline.Fiber implantation Remove the Nanoject II from the stereotaxic frame and attach a stereotaxic cannula holder onto frame. Etch a checkered pattern on skull surface with a 28 gauge needle. This “scoring” of the skull increases surface area for cement to bind, increasing durability of the implant. Wash any debris away with sterile saline and dry thoroughly. The skull must be dry for cement to bind. Insert the fiber optic cannula into the cannula holder. Locate Bregma with the fiber optic implant and select “At Bregma” once more. Then go to the coordinates of your injection site. If the fiber optic implant site is different from the injection site, drill holes over the target stimulation site(s).Lower the fiber optic implant to the target stimulation site. Lower the implant at a slow rate of 1-2 mm/min. In one well of a cold ceramic plate, place 4 drops of Metabond solvent and 1 drop of Metabond catalyst and mix well.",
    "Apply the liquid solution from well #1 to the base of the ceramic ferrule and the skull surface using a sterile applicator.In another well (#2), place 4 drops of Metabond solvent, 2 scoops of Metabond cement powder, and 1 drop of Metabond catalyst. Mix well.Apply a thin, even layer of dental cement (well #2) across the skull and lower portion of the implant, creating support around the base of the implant. Continue applying even layers until the cement in well #2 is used up.Allow dental cement to dry completely. Repeat Steps D3-D10 for the second implant if doing bilateral implants.Note: You will not be able to re-establish Bregma; thus, guide the implant through the second craniotomy and calculate the required distance in the z direction to reach the stimulation target using the Angle 2 software. Cut an 18 gauge needle to 1.5 cm in length using wire cutters at each end. Squeeze ends with a plier to dull them. Combine liquid and powder components of cross-linked flash acrylic to create a liquid jelly. Apply a final, even acrylic layer over the dental cement, ensuring the implants are well-secured. Build a mound of acrylic at the posterior end of the skull, placing the clipped 18 gauge needle at this position and securing it in place with further layers of acrylic. This will allow you to use ring-end forceps to grasp the mouse without having to scruff the animal (Figure 1D).Allow the mouse to recover in a clean cage on a heating pad. Monitor the animal every 15 min for 4 h, looking for signs of pain or distress. If they are not recovering as expected, euthanize humanely. Passive odor associationAfter one day of recovery, begin passive odor association, which is where mice learn to associate food with a specific odorant.",
    "Choose two odors to be used in the experiment: one for association with food, and the other one as a novel odorant that will serve as a control during testing. If possible, you may want to choose an odor that has an enantiomer and is neither appetitive, nor aversive, or a “neutral” odorant (Devore et al., 2013). One good odor pair is R and S-Limonene, which are enantiomers. Methyl and ethyl acetate may also work well, as they have similar structures and are relatively neutral. Dissolve odorant to be associated with food in 5 ml of mineral oil to create a 2% by volume odor mixture. Mineral oil is odorless, so it is only used to dilute the concentrated odorant. Using a dropper, place 2 ml of odor mixture onto roughly 15 g of mouse chow pellets. Add odor-spiked chow to feeding hatch, or wherever the mouse normally receives food.Change out food with fresh odorant every 2 days, repeating for a total of 2 weeks. Use the same odorant throughout the training process. House mice in their normal home cage during this association process.Behavior assay habituation–6 daysNote: This can be completed during passive food odor association.Create a behavior box (11 x 11x 12 inches) with 4 corners containing a 1.5 ml tube secured to the wall with tape (Figure 2B). Place a cotton swab in each 1.5 ml tube (you may need to alter the length to fit in the 1.5 ml tube). (Figure 2A)Place animals in the behavior box arena for 30 min for 3 days. Place animals in the behavior box arena for 30 min for 3 days while being tethered to fiber optic patch cords.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191016/20191016024818_3543.jpgFigure 2. Behavior box construction. A. Cotton swab trimmed to the appropriate length and placed in a 1.",
    "5 ml tube for future odor presentation. B. Four odor presentation tubes taped to the 4 corners of a square behavior box. Behavior assay testing (Figure 3)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191016/20191016024832_3270.jpgFigure 3. Behavior testing paradigm. Testing paradigms indicating odor placement and photostimulation for each scenario.For the testing phase, you will compare the time optogenetically-implanted mice spend investigating the food-associated odor with and without photostimulation. This is to observe the effect of activating a neuronal population of interest on food odor processing, as food odors are normally appetitive. As a control, animals are also presented a novel, non-trained odor during photostimulation, to ensure that the difference in investigation time during photostimulation is specific to food odors alone. For testing, divide mice into 2 groups: Group A and Group B. Group A animals will go through testing in order 1, 2, 3, while group B will go in reverse order 3, 2, 1. This is to prevent habituation to odors. Randomize mice to these two groups by numbering mice and using a randomization generator (available in Graphpad). Have a labmate number each mouse so that the experimenter is blind during the experiment and analysis. Mice are fasted overnight prior to testing and are allowed to rest for 5 min in the behavior arena between testing scenarios. Test Scenario #1Cotton Swabs are dipped in mixture of mineral oil + food associated odor (2% by volume) and placed in 3 of the 4 tubes. One tube has a cotton swab dipped in mineral oil only, which is the odorless control. Mice are attached to patch cords and placed in the behavior arena for 10 min while being video recorded. Test Scenario #2Same as #1 however mice are photostimulated at a frequency ideal for activation of the neuronal population of interest.",
    "Mice are video recorded for 10 min during this photostimulation.Test Scenario #3Same as scenario #2, however three cotton swabs are dipped in 2% mixture by volume of a novel, non-conditioned odorant. It may be helpful to choose an odorant that is similar to the food-associated odor. Mice are video recorded for 10 min during this photostimulation. During all scenarios, video record mice for post-hoc tracking analysis. Utilize a minimum video recording rate of 4 Hz. Higher rates can be used for finer detection, but will require greater computer memory and processing power. Ensure cages are evenly lit and videos have enough contrast that mice can easily be seen and that there are no large shadows in the cages."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}