{
  "id": 7033,
  "origin_website": "Bio",
  "title": "Magnet-assisted Flow Cytometry of <em>in vivo</em> Tumors to Quantitate Cell-specific Responses to Magnetic Iron Oxide Nanoparticles",
  "procedures": [
    "Preparation of digestion mediaPrepare digestion media just before use. Fresh media has to be used for each experiment. To DMEM high glucose media, add 10% heat inactivated FBS (HI-FBS), 0.1% collagenase Type 4 and 0.005% hyaluronidase. Both collagenase Type 4 and hyaluronidase are in powder form, weigh and add directly to the media. Mix with gentle agitation until all ingredients dissolve. Aliquot 25 ml to each conical tube for each sample.Sample preparationEuthanize animals previously injected with iron oxide nanoparticles. Excise tumors and record their weight.Mince completely with a razor blade in a Petri dish.Use a syringe plunger to mash the tumor.Transfer to the conical tube containing 25 ml digestion media (25 ml per 150-200 mg tumor weight).Rotate at 37 °C for 30 min and filter through a 100 µm filter while mashing with a syringe plunger.Centrifuge at 335 x g at 23 °C for 10 min.Wash with 25 ml DMEM/tumor with 10% HI-FBS. Resuspend with a pipette and centrifuge again at 335 x g at 23 °C for 10 min.Discard the supernatant and add 3 ml ACK (Ammonium-Chloride-Potassium) lysing buffer. ACK lysing buffer is used to lyse red blood cells from flow preparation. It is commercially available, but can also be prepared with ammonium chloride, potassium bicarbonate, and sodium EDTA. Resuspend with a pipette and leave at room temperature for 3-5 min.Add DMEM with 10% HI-FBS up to 25 ml and centrifuge at 335 x g at 23 °C for 10 min and discard the supernatant.Magnetic separationAdd 4 ml DMEM with 10% HI-FBS.Resuspend and transfer all 4 ml to labeled flow tubes.Keep all tubes upright on a rare earth permanent magnet and incubate for at least 30 min in 37 °C incubator with 5% CO2.After magnetic separation, carefully collect supernatant into another tube.",
    "Add 4 ml of DMEM with 10% HI-FBS to the magnetically attached fraction and resuspend.Centrifuge all tubes at 335 x g at 23 °C for 10 min and discard supernatant. A schema of the method is given in Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3822/bioprotoc-10-22-3822-g002.jpgFigure 2. Overall scheme of magnet-assisted cell sorting from tumor for flow cytometry Staining and fixationWash sedimented cells (pellet) with 2 ml of PBS by resuspending using a pipette.Centrifuge at 335 x g at 23 °C for 10 min.Add adequate amount of PBS (usually 1 ml) to enable cell counting, and count cells after dilution.Transfer 2 million cells from each tube and into fresh tubes.Separately, reserve 1-2 million cells for unstained control, live/dead control and for each FMO tubes (FMO: Fluorescence Minus One) for compensation and gating.Centrifuge at 335 x g at 23 °C for 5 min.Discard the supernatant and add 100 µl live/dead solution (stock in DMSO) (1 µl/100 µl PBS) and incubate at room temperature in dark for 30 min.Centrifuge at 335 x g at 23 °C for 3 min.Wash with 100 µl PBS by resuspending with a pipette and centrifuge at 335 x g at 23 °C for 3 min.Discard the supernatant and add 100 µl Fc blocker (1 µl/100 µl PBS) and incubate on ice for 10 min.Centrifuge at 335 x g at 23 °C for 3 min.Wash with 100 µl PBS with 5% HI-FBS by resuspending with a pipette.Centrifuge at 335 x g at 23 °C for 3 min.Add one drop of single stain beads to new tubes without cells.Prepare antibody cocktails (50 µl/sample) in biosafety cabinet in dark.All dilutions are made in PBS with 5% HI-FBS on ice:For test samples–add all antibodies in appropriate dilution.For single stain beads–single antibody in appropriate dilution.For FMO–all antibodies minus one antibody in appropriate dilution (e.g.",
    ", if using 12 antibodies, 12 separate antibody cocktails should be prepared each with all 11 antibodies without 1 antibody).Add 50 µl of the antibody cocktail to their respective tubes, and mix gently with pipette and incubate at room temperature in dark for 30 min.Centrifuge at 335 x g at 23 °C for 3 min.Wash with 100 µl PBS with 5% HI-FBS by resuspending using a pipette.Centrifuge at 335 x g at 23 °C for 3 min.Prepare fixation/ permeabilization (fix/perm) solution by mixing 1 part of concentrate with 3 parts of diluent as per manufacture protocol.Resuspend in 50 µl of fix/perm solution and incubate at room temperature in dark for 30 min.Centrifuge at 335 x g at 23 °C for 3 min.Wash with 100 µl PBS with 5% HI-FBS by resuspending using a pipette.Centrifuge at 335 x g at 23 °C for 3 min.Discard the supernatant and add 200 µl PBS with 5% HI-FBS. Run samples in flow cytometer  LSR-II  (BD Biosciences, San Jose, CA).Can be stored in dark at 4 °C covered with aluminum foil for running next day (within 24 h).Data AcquisitionAcquire data in LSR II using BD FACSDiva software. First, run single stain controls to set up negative and positive gates. Then run FMOs and samples to record data collected from minimum of 200,000 events per sample. Export data as FCS files after compensation in BD FACSDiva software (         Staats et al., 2019        )."
  ],
  "subjectAreas": [
    "Immunology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}