{
  "id": 1803,
  "origin_website": "Cell",
  "title": "Orthotopic T-cell receptor replacement in primary human T cells using CRISPR-Cas9-mediated homology-directed repair",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThawing and resting PBMCs overnight\nTiming: 1 day\nWhen working with frozen PBMCs, these steps prepare the cells for subsequent stimulation. The overnight rest is not necessary when working with freshly isolated PBMCs.\nWarm complete RPMI medium in water bath set at 37°C.\nThaw PBMCs as quickly as possible to reduce the time that the cells spend in freezing medium (containing DMSO).\nHold cryovials in water bath until cells start thawing. Then pipette thawing cell suspension up and down to speed up the thawing process.\nTransfer thawed cells into 50 mL tube with pre-warmed complete RPMI medium.\nWash cells twice by centrifuging (480 × g, 7 min, 20°C–22°C), discarding supernatant and resuspending in pre-warmed complete RPMI medium.\nCount cells and seed at 2 × 106 cells/mL in complete RPMI medium supplemented with 50 U/mL IL-2.\nIncubate cells 18–24 h at 37°C, 5% CO2.\nOptional: Instead of working with frozen PBMCs, PBMCs also can be freshly isolated (by density gradient centrifugation) from a healthy donor and directly activated (without overnight rest).\nCoating of plates with anti-CD3/CD28 antibodies\nTiming: 2 h - 1 day\nThis step prepares the tissue-culture plates and/or flasks for activation of PBMCs by coating them with anti-CD3 and anti-CD28 antibodies. The required volume of coating solution depends on the cell numbers to be activated and therefore on the number of wells (more precisely, the area) to be coated. Here, we describe the process for the 24-well plate format. To adapt activating antibody-coating and T cell activation to different formats (e.g., 48-well plates of T25-flasks), calculate the area in relation to the surface of a 24-well plate well and adjust required volume of coating solution and cell suspension accordingly.",
    "Alternatives: Dynabeads® Human T-Activator CD3/CD28 which are covalently coupled to anti-CD3 and anti-CD28 antibodies can be used for polyclonal T cell activation (Roth et al., 2018[href=https://www.wicell.org#bib7]).\nDilute anti-CD3 and anti-CD28 antibodies to a final concentration of 1 μg/mL in sterile PBS buffer.\nCoat 24-well plate with 500 μL/well.\nSeal plates with Parafilm® to avoid evaporation and ensure sterile conditions.\nKeep plates at 4°C 18–24 h.\nOptional: Antibody coating can also be performed for 2 h at 37°C.\nT cell activation\nTiming: 2 days\nFor activation of T cells, PBMCs are incubated on tissue-culture plates with surface-bound anti-CD3 and anti-CD28-antibodies. Interleukins (IL-2, IL-7 and IL-15) are added to the culture medium.\nPer CRISPR sample, 1 × 106 cells are electroporated. In addition to the OTR samples, control samples (TCR KO and mock) are included in the experiment. TCR KO (KO of endogenous α-chain and β-chain) samples are required to evaluate the efficiency endogenous TCR KO and while mock samples (unedited cells) serve as negative control.\nCount PBMCs.\nResuspend PBMCs at 1 × 106 cells/mL in complete RPMI medium supplemented with 300 U/mL IL-2, 5 ng/mL IL-7 and 5 ng/mL IL-15.\nCritical: During the activation, usually up to half of the PBMCs do not survive and it is therefore important to account for this cell death at this activation step. When working with frozen PBMCs, activate at least 2.5 × 106 cells per CRISPR sample (2.5 × the amount of cells required for electroporation).\nWash 24-well plates twice with PBS without letting the wells dry out.\nAdd 1.5 mL of the PBMC suspension from step 11 per well to the coated 24-well plates.\nIncubate at 37°C, 5% CO2 for two days (48 h).",
    "Optional: To improve T cell viability after electroporation and TCR re-expression rates, the addition of DNA-sensing inhibitors has been reported to be beneficial (Kath et al., 2021[href=https://www.wicell.org#bib3]). DNA-sensing inhibitors like RU.521 (small-molecule inhibitor of cyclic GMP-AMP synthase (cGAS)) and the synthetic oligonucleotide ODN A151 (TLR9 antagonist and inhibitor of other cytosolic DNA-sensors) can be added 6 h before the end of incubation to increase survival and TCR re-expression rates (Kath et al., 2021[href=https://www.wicell.org#bib3]).\nPreparation of electroporation\nTiming: 30 min\nT cell activation is stopped and cells are prepared for electroporation by transferring them into a 96-well plate (‘cells plate’).\nAdditionally, antibiotic-free SC- medium is prepared. The SC- medium comprises the same ingredients and supplements as complete RPMI medium except for antibiotics (penicillin-streptomycin, gentamicin). As each CRISPR sample is seeded at 1 × 106 cells/mL after electroporation, 24-well plates with 1 mL SC- medium per well are prepared and pre-warmed in the incubator.\nNote: The viability of KI cells is higher when the cells are cultivated in antibiotic-free SC- medium for 12–16 h after electroporation. After 12–16 h, cell culture is continued in complete (antibiotics-containing) RPMI medium (SC+).\nCheck for cell cluster formation under an inverse microscope.\nCritical: Cluster formation is crucial as this indicates the intended T cell activation, which is a prerequisite for successful genetic editing.\nRecover the activated cells from the wells and pool them into a 50 mL tube.\nWash cells by centrifuging (480 × g, 7 min, 20°C–22°C), discarding the supernatant and resuspending in complete RPMI medium.\nCount PBMCs.",
    "Note: Cell numbers are usually lower than before activation as only T cells among PBMCs are being activated and some T cells may also undergo activation-induced cell death. Apoptotic bodies were removed during the washing steps and cell number calculations for the subsequent steps were based on the cell count of live cells. No further steps (e.g. FACS sorting) were performed to separate dead from live cells.\nCentrifuge (480 × g, 7 min, 20°C–22°C), discard supernatant and resuspend at a density of 5 × 106 cells/mL in complete RPMI medium.\nSeed 1 × 106 cells (200 μL of cell suspension) per CRISPR sample into a 96-well V-bottom ‘cells plate' well.\nNote: At this step, the plate layout is important. Make sure to choose a plate layout that is appropriate for the use of a multi-channel pipette, which allows a fast transfer to NucleocuvettesTM (e.g., when working with 16-well NucleocuvetteTM Strips, prepare the cells in rows of 8).\nKeep the 96-well plate at 37°C, 5% CO2 until further use.\nCells of the mock samples can be resuspended to a density of 1 × 106 cells/mL in complete RMPI medium supplemented with 180 U/mL IL-2 and directly transferred into the 24-well plate.\nNote: Mock samples are not being electroporated in this protocol as previous data have shown that electroporation itself (without the addition of DNA or RNPs) has no considerable effect on the endogenous TCR expression.\nPer CRISPR sample, prepare 1 mL of SC- medium for cell cultivation after electroporation (at 1 × 106 cells/mL) by supplementing RPMI 1640 medium with 10% heat-inactivated FBS, 5% SC- (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and 180 U/mL IL-2.\nDistribute 1 mL SC- medium per well into 24-well plates and keep the plate at 37°C, 5% CO2 until further use to pre-warm the medium.\nRNP production",
    "Timing: 60–90 min\nCRISPR-Cas9-mediated OTR requires hTRAC and hTRBC RNPs for simultaneous editing of TCR α- and β-chains. Both RNPs are complexes of Cas9 protein and gRNA. Respective gRNAs consist of target-specific hTRAC or hTRBC crRNA sequences, directing Cas9 nuclease to the respective genetic loci, as well as of tracrRNA, serving as scaffold for the Cas9 protein.\nFor final electroporation, 3 μL of each RNP (final concentration 20 μM) are needed per sample. Here, we first produce 40 μM gRNAs by mixing equimolar amounts of tracrRNA with hTRAC or hTRBC crRNA. After the addition of electroporation enhancer (to enhance editing efficiency), the RNP production is concluded by mixing and then incubating equal volumes of gRNA and Cas9 protein (see Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1282-Fig4.jpg\nFigure 4. Workflow of hTRAC and hTRBC ribonucleoproteins (RNPs) production\ntracrRNA (black) is mixed with respective crRNA (hTRAC crRNA, light orange or hTRBC crRNA, dark orange) to produce gRNA. Electroporation enhancer (green asterisk) and then Cas9 protein (grey) are added to conclude RNP production.\nOptional: The addition of poly-L-glutamic acid (PGA) to RNPs has been described to improve editing efficiency and cell survival rates (Kath et al., 2021[href=https://www.wicell.org#bib3]; Nguyen et al., 2020[href=https://www.wicell.org#bib5]).\nNote: Due to working with small volumes, pipetting errors and inaccuracies can have a considerable effect. We therefore advise to prepare additional 10% of RNPs to account for pipetting errors.\nMix equal volumes of tracrRNA (80 μM stock) with hTRAC or hTRBC crRNA (80 μM stock), respectively, to prepare 40 μM hTRAC and 40 μM hTRBC gRNA. Mix well by pipetting.\nIf necessary, shortly spin down to ensure the complete reaction mixture is at the bottom of the tube.\nHeat at 95°C for 5 min in PCR cycler and then allow RNPs to cool to 20°C–22°C on bench top.",
    "Alternatives: Run gRNA production protocol by 95°C for 5 min, followed by hold at 21°C. Using a 1.3 °C/s ramp (maximal ramp for this specific PCR cycler) we were able to produce gRNA for the RNPs which yielded very high TCR KO efficiencies.\nStore gRNA on ice if you do not continue directly.\nDilute Cas9 nuclease to 6 μM with commercial PBS buffer.\nCritical: Minimize the time that Cas9 nuclease is at room temperature (20°C–22°C) and return to -20°C as quickly as possible. Take from stock only what you need for the experiment. Do not dilute the stock.\nCalculate required volumes of Cas9 protein (62 μM stock) and commercial PBS buffer.\nPrepare tube with required volume of PBS buffer.\nSet up pipette for the required volume of Cas9 nuclease.\nQuickly take Cas9 stock from −20°C. To avoid foaming, do not mix the Cas9 stock before taking out the required volume to prepare the dilution.\nSlowly add Cas9 with prepared pipette and swirl slowly while pipetting.\nNote: When adding the nuclease, you will see streaks of the Cas9 stock in the PBS buffer. After having added the required volume of Cas9, make sure to thoroughly mix by pipetting until all streaks have disappeared.\nKeep diluted Cas9 on ice if you do not continue directly, otherwise bring it to 20°C–22°C for RNP assembly.\nAdd electroporation enhancer (400 μM stock) to gRNAs for a final concentration of 20 μM.\nTo mix equal volumes of diluted Cas9 nuclease (6 μM) and gRNA (40 μM), very slowly add Cas9 to the gRNA while moving pipette tip in cycles.\nCritical: Always add diluted Cas9 protein to gRNA solution, not the other way around.\nMix by pipetting.\nCheck if RNP solution is clear and does not contain any precipitate.\nIncubate RNPs for 15 min at 20°C–22°C.",
    "Keep RNPs on ice until further use if they are processed the same day.\nOptional: Store RNPs at −80°C if they are not processed the same day.\nPrepare electroporation buffer\nTiming: 10 min\nPrepare 20 μL P3 electroporation buffer (Lonza) per condition. As this buffer is toxic for cells, the time cells spend in this buffer should be kept to a minimum.\nPer sample, 20 μL P3 buffer are prepared by mixing 16.4 μL P3 with 3.6 μL supplement.\nKeep at 20°C–22°C or on ice, if needed later.\nOptional: To reduce costs, Lonza NucleocuvettesTM can be washed with ethanol and reused. When working with reused NucleocuvettesTM, the self-made buffers such as ‘1M’ (Chicaybam et al., 2013[href=https://www.wicell.org#bib1]) can be used instead of commercial P3 electroporation buffer. However, reuse of NucleocuvettesTM increases the risk of error codes during electroporation.\nElectroporation\nTiming: 30–60 min (hands-on) + 12–16 h (additional cell culture)\nFor electroporation, activated T cells are resuspended in electroporation buffer and then mixed with HDR template and RNPs (Figure 5[href=https://www.wicell.org#fig5]). After transfer into the 16-well NucleocuvetteTM Strip, cells are electroporated in the Lonza 4D-NucleofectorTM. By electroporation, RNPs and template DNA are delivered into the nucleus of T cells where genetic editing occurs.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1282-Fig5.jpg\nFigure 5. Genetic engineering of T cells via CRISPR-Cas9-mediated TCR KI",
    "Activated T cells with endogenous TCRs (orange) are required for successful editing. In preparation for electroporation, the linearized double-stranded DNA template is mixed with hTRAC and hTRBC RNPs. T cells resuspended in electroporation buffer are mixed with the DNA-RNPs mixture and electroporated. Respective crRNAs direct the Cas9 nuclease either to the TRAC or TRBC locus and allow for CRISPR-Cas9-mediated DNA double-strand breaks (right). At the TRAC locus, homology-directed repair (HDR) results in the targeted KI of the HDR template DNA encoding the full transgenic αβ TCR which leads to a simultaneous KO of the endogenous TRAC (black triangle). At the TRBC locus, the double-strand break is resolved by non-homologous end-joining leading to the KO of the endogenous TRBC (black cross). On the surface of edited T cells only the transgenic TCR (blue) is expressed.\nWhen working with 16-well NucleocuvetteTM Strips, cells are prepared in the ‘cells plate’ (Figure 6[href=https://www.wicell.org#fig6]) in rows of 8 (see step 20). To minimize the time that cells spend in the electroporation buffer, only (up to) 8 samples are electroporated at a time. In preparation for electroporation, respective cells are transferred to the ‘centrifugation plate’ (Figure 6[href=https://www.wicell.org#fig6]) and spun down. After centrifugation, cells are resuspended in P3 electroporation buffer, mixed with DNA/RNP-mix in the ‘pipetting plate’ (Figure 6[href=https://www.wicell.org#fig6]) and transferred to NucleocuvetteTM Strip.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1282-Fig6.jpg\nFigure 6. Workflow of preparing samples for electroporation",
    "Step 1: The targeting construct mix is prepared in the ‘pipetting plate’ (blue plate) by mixing DNA template and RNPs (light blue wells). Additionally, 20 μL P3 buffer is added to the plate (light green wells). Cells to be electroporated are transferred from the ‘cells plate’ (orange plate) to the ‘centrifugation plate’ (grey plate). Step 2: After centrifugation, the supernatant in the ‘centrifugation plate’ is discarded. Step 3: Cell pellets are resuspended in 20 μL of P3 electroporation buffer. Step 4: 25 μL of resuspended cells (dark green) are transferred to the DNA/RNP-mix wells in the ‘pipetting plate’ and mixed. Step 5: 32 μL of cells/DNA/RNPs-mix (dark blue) is transferred to the 16-well NucleocuvetteTM Strip. Step 6: NucleocuvetteTM Strip is placed in the NucleofectorTM and cells are electroporated. Afterwards, cells are transferred to the 24-well plate with pre-warmed SC- medium (not shown). Step 7: Process is repeated for remaining samples.\nCritical: For electroporation, all reagents and cuvettes need to be at room temperature.\nSwitch on and set up NucleofectorTM.\nSelect wells to be electroporated.\nSelect electroporation program using the pulse sequence EH100.\nAlternatives: Different pulse sequences can be used (e.g., the use of EH115 has been successfully applied (Roth et al., 2018[href=https://www.wicell.org#bib7]). After testing various pulse settings, we found that EH100 yields the best combination of editing efficiency and cell viability in our setting.\nPrepare electroporation buffer for samples of the first electroporation (up to 8 samples). Distribute 20 μL of P3 electroporation buffer per well into a V-bottom 96-well plate (‘pipetting plate’) following the layout of the ‘cells plate’ (Figure 6[href=https://www.wicell.org#fig6]).\nPrepare targeting construct mix for the first OTR samples in the ‘pipetting plate’:",
    "First, add 0.5 μg template DNA to the wells of the ‘pipetting plate’. Volume of DNA depends on the concentration after purification. Values should range between 0.5 and 1.5 μL.\nAdd 3.0 μL hTRAC RNP + 3.0 μL hTRBC RNP to the template DNA (see problem 2[href=https://www.wicell.org#sec6.3]).\nFor the TCR KO sample, mix only 3.0 μL hTRAC RNP + 3.0 μL hTRBC RNP in the ‘pipetting plate’ to prepare targeting construct mix. Afterwards, treat TCR KO sample exactly as the OTR samples.\nAlternatives: When working with ssDNA templates, higher amounts of template can be used since ssDNA demonstrates less toxicity (Roth et al., 2018[href=https://www.wicell.org#bib7]). However, the use of ssDNA templates increases the complexity of the protocol as templates need to be singularized.\nIncubate at 20°C–22°C for at least 30 s.\nTransfer cells to be electroporated to the 96-well V-bottom ‘centrifugation plate’ and spin down.\nCentrifuge for 3 min at 480 × g, 20°C–22°C.\nSwiftly discard remaining supernatant.\nSet multichannel to 20 μL and take up 20 μL P3 buffer ‘pipetting plate’ (see problem 3[href=https://www.wicell.org#sec6.5]).\nResuspend cell pellet in 20 μL P3 buffer. Avoid air bubbles and be cautious not to create any foam.\nIncrease pipetting volume to 25 μL. This 5 μL-increase in volume accounts for the left-over supernatant in the well.\nTake 25 μL of resuspended cells of the ‘centrifugation plate’ and transfer to DNA/RNP-wells of the ‘pipetting plate’.\nMix by carefully pipetting up and down. Avoid air bubbles or foam.\nIncrease pipetting volume to 32 μL. This 7 μL-increase in volume accounts for the 2 × 3 μL of RNPs and the approx. 1 μL of DNA.\nQuickly transfer cells/DNA/RNP-mix to fresh 16-well NucleocuvetteTM Strip.\nPlace lid on top and tap NucleocuvetteTM Strip on the bench to remove any air bubbles (see problem 3[href=https://www.wicell.org#sec6.5]).",
    "Place NucleocuvetteTM Strip into NucleofectorTM.\nStart electroporation program: EH100 (see problem 4[href=https://www.wicell.org#sec6.7])\nTransfer electroporated cells to SC- medium.\nAdd 80 μL of pre-warmed SC- medium (from the 24-well plate (step 24) to the NucleocuvetteTM well and mix (to dilute P3 buffer).\nTransfer cells to 24-well plate with 1 mL of pre-warmed SC- medium per well to seed the cells at a density of 1 × 106 cells/mL.\nTake some SC- medium from the same well to flush NucleocuvetteTM well to collect any left-over cells.\nIncubate cells at 37°C, 5% CO2 for 12–16 h.\nAddition of antibiotics\nTiming: 10 min (hands-on) + 3 days (additional cell culture)\nViability of KI cells is higher when they are cultivated in antibiotic-free SC- medium for 12–16 h after electroporation. Afterwards, SC- medium can be replaced by complete RPMI medium (including antibiotics) or the SC- medium can simply be supplemented with an antibiotic mix to produce complete RPMI medium.\nHere, the SC- medium is supplemented with 5% antibiotics mix (see materials and equipment[href=https://www.wicell.org#materials-and-equipment]) 12–16 h after electroporation.\nPer well, add 50 μL of antibiotics mix to the 1 mL SC- medium.\nAs the mock sample was already cultured in complete RPMI medium, no antibiotics need to be added here.\nNote: Since the mock sample is not electroporated, mock cells tend to proliferate faster than those of electroporated samples. Therefore, it might be necessary to split mock sample cells (or at least add some fresh medium) if the medium starts to turn yellow.\nIncubate the cells at 37°C, 5% CO2 for another 3 days until flow cytometry analysis.\nValidation of TCR KI by flow cytometry analysis\nTiming: 4 h - 1 day",
    "Since RNPs are stable for around 72 h, flow cytometry analysis can be performed from day 3 after electroporation onwards. Transgene expression levels can be slightly higher at later time points, but are not expected to change substantially. To evaluate the efficiency of transgenic TCR re-expression and endogenous TCR KO, cells are stained for transgenic and endogenous TCR and analyzed by flow cytometry. As the transgenic TCR is equipped with a murine TCR β constant region (mTRBC), staining of mTRBC allows identification of transgenic TCRs and differentiation from endogenous TCRs (hTCR). Additionally, CD8 and/or CD4 expression (here: CD8) is analyzed. Our target population is the mTRBC+hTCR- population of (in this case) CD8+ cells. This population is made up of cells expressing the transgenic TCR (mTRBC+) with simultaneous KO of the endogenous TCR (hTCR-).\nAlternatives: When working with an HDR template containing fully human TCR sequences, transgenic TCRs can be identified and differentiated by antigen-specific peptide-MHC (pMHC)-multimer staining. Another approach, albeit less precise, would be antibody staining for the specific Vβ-chain of the transgenic TCR.\nNote: Staining is performed on ice.\nResuspend cells in the cell culture well before taking an aliquot for staining.\nRecover 25–50 μL of cells per sample (including TCR KO and mock samples) and transfer sample to a 96-well V-bottom plate.\nReturn the plate with the remaining cells to the incubator (at 37°C, 5% CO2) until further use.\nAdditionally, recover mock cells for single color (S.C.) stainings and add them to the plate.\nNote: 100,000 cells per S.C. are sufficient to set up the instrument and create compensation controls.\nWash 2.5 × with FACS buffer:\nFill wells to 200 μL with cold FACS wash buffer, centrifuge (3 min, 480 × g, 4°C), discard supernatant (= 0.5 × wash step).",
    "Resuspend pellet in 200 μL cold FACS buffer, centrifuge, discard supernatant (= 1 × wash step). Repeat this washing step once.\nPrepare antibody master mix for 50 μL staining volume per sample by adding antibodies (anti-CD8-PE, anti-hTCR-FITC and anti-mTRBC-APC/Fire750) in their respective dilution to the FACS buffer.\nOptional: CD3-staining can be included to facilitate the identification of cells expressing the transgenic TCR as these cells should be CD3+mTRBC+ double positive.\nResuspend cell pellets of samples in 50 μL antibody master mix.\nResuspend cell pellets of S.C. in 50 μL FACS buffer and add one of the S.C. antibodies (anti-CD8-PE, anti-hTCR-FITC, anti-CD45-ECD and anti-mTRBC-APC-eFluor780) per well in the respective dilution.\nMix samples by pipetting and incubate 20 min on ice in the dark.\nFill wells to 200 μL with FACS buffer, centrifuge (3 min, 480 × g, 4°C) and discard supernatant.\nResuspend CRISPR-samples (excluding S.C.) in 50 μL of Propidium Iodide (PI) solution (2 μg/mL) and incubate for 3 min on ice in the dark.\nOptional: PI can be added to the CRISPR-samples 3 min before the end of the incubation. After 3 min of incubation with PI, samples can be washed 2.5 ×.\nWash 1.5 × with FACS buffer (see step 63).\nResuspend the sample in 200 μL FACS buffer and filter through a nylon mesh (mesh width: 100 μm).\nAcquire samples at flow cytometer.\nQuantify percentages and counts of CD8+ mTRBC+hTCR- cells (see problems 5[href=https://www.wicell.org#sec6.9] and 6[href=https://www.wicell.org#sec6.11])."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Biotechnology And Bioengineering",
    "Immunology",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}