{
  "id": 7061,
  "origin_website": "Bio",
  "title": "Preparation of Bacterial Outer Membrane Vesicles for Characterisation of Periplasmic Proteins in Their Native Environment",
  "procedures": [
    "Gene cloning and transformationThe complete gene coding for the protein of interest including its preceding periplasmic export signal should be cloned into a suitable plasmid backbone of the pET expression system (such as pET21a). Thereby, additional features such as affinity tags are not necessary and should be omitted. The final plasmid should be transformed into an OMV-overproducing strain such as BL21(DE3)ompA (Fantappiè et al., 2014). These steps can be carried out following standard molecular biology techniques. The description of detailed cloning and transformation procedures lies outside the scope of this protocol.Preparation of growth media and buffersPer sample requirements are: 5 ml LB medium, 1 L M9 medium, 25 ml DPBSS, 0.2 ml NMR sample buffer (see Recipes for formulations). Supplement growth media with appropriate antibiotics for selection of the strain/plasmid used for expression. When using the pET expression system, use Ampicillin to a final concentration of 100 µg ml-1 or Kanamycin to a final concentration of 50 µg ml-1. Stock solutions of antibiotics (Ampicillin: 100 mg ml-1; Kanamycin: 50 mg ml-1) and IPTG (1 M) can be prepared in H2O/D2O, corresponding to the solvent used for growth media.Bacterial growthInoculate 5 ml LB medium with a single colony.Grow shaking at 37 °C for 10 h.Inoculate 100 ml M9 in a 500 ml baffled culture flask using 1 ml of the culture grown in LB medium.Grow shaking at 37 °C overnight (~80 rpm, 25 mm orbit).Add the entire preculture to 900 ml M9 in a 5,000 ml baffled culture flask.Grow shaking at 37 °C (~80 rpm, 25 mm orbit).Check the optical density OD600 every 30 min.When the optical density reaches OD600 ~0.4 add IPTG to a final concentration of 0.2 mM to induce protein expression.Continue to monitor the optical density OD600 every 30 min.",
    "When bacterial growth ceases (after ~3 h in H2O/~5 h in D2O based media, see Figure 1) remove the cells by centrifugation at 10,000 x g for 10 min at 10 °C.Filter the supernatant with 0.45 µm vacuum filtration units. The filtered supernatant can be stored at 4 °C for up to 24 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3853/bioprotoc-10-24-3853-g001.jpgFigure 1. Media-dependent growth behavior. Exemplary growth curves in H2O based (dark blue) and D2O based (light blue) M9 minimal media. Triangles mark the time of induction, squares mark the time of harvest.OMV PreparationCollect OMVs from the filtered supernatant by centrifugation at 38,400 x g for 2 h at 10 °C. After centrifugation, centrifuge bottles should contain a small but clearly visible whitish, slightly cloudy pellet (Figure 2A).Immediately discard the supernatant (OMV pellets will begin to suspend shortly).Resuspend OMV pellets in a total volume of 25 ml DPBSS by pipetting.Filter the OMV suspension with a 0.45 µm syringe filter.Collect OMVs by centrifugation using a single centrifuge tube at 74,500 x g for 45 min at 10 °C (Figure 2B).Immediately discard the supernatant.Resuspend the OMV pellet in 200 µl NMR sample buffer by gentle vortexing.Save 2 µl of the OMV suspension for subsequent analysis and transfer the remaining suspension to a microscale NMR tube (Figure 2C). OMV suspensions are in our hands stable at 4 °C for up to 2 weeks.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3853/bioprotoc-10-24-3853-g002.jpgFigure 2. Preparation of OMVs. OMV pellets after the first (A) and second centrifugation (B), and resuspended in NMR buffer in a 5 mm Shigemi NMR tube (C).OMV AnalysisDilute 2 µl of the final OMV suspension with 18 µl DPBSS.Record a UV-Vis spectrum of the dilute OMV suspension using a microvolume spectrophotometer (range: 220-360 nm) and export the spectrum data for further analysis.",
    "Correct the exported spectrum for the light-scattering contribution of the OMVs and estimate the protein concentration from the absorbance at 280 nm (see Data analysis and Figure 3A). OMV preparations should contain >15 mg/ml total protein to yield NMR spectra of good quality.Prepare two samples for SDS page using denaturing Laemmli Sample Buffer, containing ~6 µg total protein each.Heat-denature one of the samples at 98 °C for 15 min, keep the second sample at room temperature.Analyze samples by SDS page. Samples of protein-enriched OMVs should result in two prominent bands. One band corresponding to the major porins OmpF/OmpC present in the OMV membrane runs at 37 kDa in the heat-denatured sample and results in a contorted, ladder-like pattern between 60 and 70 kDa in the non-heated sample (Figure 3B). A second band, usually not subject to heat-modifiability, should be present at the weight of the overexpressed protein of choice, indicating successful enrichment in the OMVs (Figure 3B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3853/bioprotoc-10-24-3853-g003.jpgFigure 3. Analysis of OMVs by spectrophotometry and SDS-page. A. Exemplary UV-Vis spectrum of a dilute OMV suspension before (dashed line) and after light-scattering correction (solid line). B. Exemplary SDS page gel of OMVs enriched with a periplasmic protein (dark blue triangle). Major porins OmpF/OmpC are marked by the light blue open triangles."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}