{
  "id": 11471,
  "origin_website": "Jove",
  "title": "Visual Classical Conditioning in Wood Ants",
  "procedures": [
    "1. Maintaining Formica rufa Colonies\nNote: The wood ant (Formica rufa, L.) colonies used for this study were collected from Ashdown Forest, Sussex, UK (N 51 4.680, E 0 1.800). Within the UK, F. rufa colonies should be collected between July and August. A good proportion of the nest must be removed, including several hundred workers and brood, to ensure the colony is sustained and active for longer periods of time (up to one year). Permission should be sought from the concerned authorities before nest removal.\nHouse the wood ant colonies in a wide box (around 135 cm x 70 cm x 35 cm) with walls covered with polytetrafluoroethylene (PTFE) resin (e.g., Fluon) to prevent ants from escaping, at 21°C, under a 12-h light:12-h dark cycle.\n\t\nProvide sucrose (333 g/L) and water to the ants, using water dispensers. To ensure the ants’ diet is rich in protein, feed the colony with frozen crickets 2x a week. Spray the nest with water every day to keep it humid.\nTo improve the sanitary conditions of the colony, add pine resin when necessary; pine resin reduces parasitism in wood ant colonies17. Place a small container (around 15 cm in diameter and 5 cm deep) inside the nest so that ants can deposit any dead colony members in it.\nKeep ants under the afore-mentioned conditions for at least 2 weeks after collecting before attempting any experiments. Remove the sucrose from the nest to starve the ants 2 d prior to the experiments, thereby improving their motivation.\n2. Selecting and Harnessing Ants",
    "Note: For harnessing ants, a custom-made holder is needed. This can be constructed using modeling clay and a cardboard with a cut opening attached to it horizontally. The upper surface of the cardboard should be partially coated with wax, permitting insect pins to be attached during fixing. Careful handling is necessary for every step of this protocol (including maintenance, transport, and experiment), but in particular when harnessing ants, to avoid subjecting them to high levels of stress prior to training.\nTo select ants that are motivated to eat, place a slide with a drop of sucrose (200 g/L) inside a small box (around 14 cm x 8 cm x 5 cm) with walls covered with PTF resin to prevent escape. Do not select ants that are carrying wood or dead ants from the nest. Instead, take ants that are crawling up the walls of the nest, because these are more likely to be foragers trying to leave the nest to search for food.\nPlace each ant in the box and wait to see if it feeds on the sucrose drop. If it does, transfer it immediately to another empty box to prevent satiation.\nTransfer each ant to a separate tube. Place each tube in the freezer for 1 - 2 min, or in crushed ice for up to 5 min, to immobilize the ant.\nPlace the immobilized ant in the holder, through the cut on the cardboard, by the joint between its head and thorax. Ensure the antennae remain on the side of the head, using insect pins embedded in the wax layer on top of the cardboard.",
    "Use a custom-made heating element to wax the tip of an insect pin to the ant’s head, parallel to the cardboard. During this procedure, do not touch the antennae with the heating element wire to avoid incurring any damage to them.\nAfter the wax dries, remove the insect pins holding the antennae and carefully remove the ant from the holder.\nFix the insect pin holding the ant in a modeling clay cylinder and fix a custom-made plastic holder beneath it, ensuring the ant maintains a typical standing posture and that the whole body is free to move except the head.\nKeep the harnessed ants in darkness for at least 2 h prior to training.\n3. Training and Testing\nSet-up, conditioned stimulus, and unconditioned stimulus\nConduct the experiments in a white acrylic box (50 x 50 x 50 cm), open at the front to permit access for the experimenter. Record the ant’s behavior with a camera.\n\t\t\nPlace the camera with a macro lens directly above the ant, through a hole in the upper surface of the box.\nTo reduce any extraneous visual cues, keep the room in darkness except for a light source pointing directly to the top of the acrylic box (two 26-W lights).\nUse as a visual cue (the CS) a bright blue (spectrum in Figure S1) cardboard rectangle (60 x 45 mm) attached at its center to a needle, connected to a syringe (2 mL) with which the US (sucrose 200 g/L) is manually delivered to the ant (Figure 1A and 1B).\n\t\tNote: The sucrose solution can be made with any white sugar, provided that it does not have color and odor when dissolved in water.\nConduct two types of training in parallel, paired and unpaired (see the explanation below), in a randomized order.",
    "Note: In this study, we did not pay attention to the nature of the visual cue. Only the association between the cue and the reward were taken into account. Color and shape were not tested, and it is likely that a CS with other features would produce similar results. Nevertheless, the blue color was picked because ants from the same genus have been shown to be sensitive to wavelengths that cover the blue color18.\nPaired training\n\tNote: In paired training, the CS and US are presented in every trial, associated with each other (Figure 1C).\n\t\nStart recording the ants 10 s before presenting the CS to ensure that ants are not spontaneously performing MaLER before the presentation. If ants do perform MaLER during this period, postpone the trial for a few seconds. If any ant shows this behavior continuously, exclude it from the analysis.\nMove the syringe + CS in front of the ant for ~10 s, with the tip of the needle kept between the ant’s face and a maximum of 5 mm above and to each side. During this time, move the tip of the needle as close as possible to the ant’s head but without touching the antennae (Figure 1B).\n\t\tNote: Motion was included when presenting the CS because it has been shown to play a role in visual associative learning in honeybees6.\nApply pressure to exude a single drop of sucrose from the syringe tip and place the drop of sucrose next to the antennae and mouthparts to allow the ant to detect the sucrose. Allow the ant to feed for about 5 s.",
    "Note: The amount of sucrose ants consumed in each trial was not controlled in these experiments. The drop of sucrose on which ants feed should be large enough to allow them to freely feed for about 5 s.\nRepeat this procedure 10x, with an ITI of 5 min.\n\t\tNote: In these experiments, ants were always turned to the right, with their right eye close to the open side of the acrylic box. Therefore, the CS always approached the ants from their right side. Though this does not invalidate learning, these experiments can be conducted by turning half of the ants to the left and half to the right, to avoid any possible lateralization effect.\nUnpaired training\n\tNote: This training consists in presenting to the ants either the CS or the US separately, these two stimuli being, thus, dissociated from each other over time (Figure 1D).\n\t\nStart recording the ants 10 s before each trial.\nPresent the CS in the same manner as in paired training but do not deliver the sucrose to the ant.\nAfter 2.5 min, deliver the US directly to the mouthparts (also touching the antennae) using a syringe without the CS attached.\nStart with a CS trial and repeat this procedure 10x for each type of trial, intercalating them with an ITI of 2.5 min.\nTesting\n\tNote: A test should be conducted only 1x, either 10 min or 1 h after the last training trial; a test in which the ant is presented with the CS but not with the US could cause the extinction of the associative memory formed previously.\n\t\nStart recording the ants 10 s prior to testing.\nPresent the CS to the ant for about 10 s.\nEnsure that the ant is still motivated to feed by delivering sucrose after the test.",
    "4. Data Collection and Analysis\nRecord the ant’s behavior, from above, 10 s before each trial and during the CS and US presentations. Ensure that all trials and tests are recorded for posterior analysis.\nUsing the recordings made during training and testing, score the ants’ responses during the 10 s of CS presentation.\nSeparate the ants’ responses during the CS presentation into three types of behavior, depending on the extension and movement of the mouthparts: Full Extension with Movement (FEM) as if feeding, Full Extension without movement (FE) or Partial Extension (PE) of the maxilla-labium or maxillary palps (Figure 2A - 2D). For analysis, group all MaLER types as a single response (Figure 2E).\nExclude any ant that did not feed in every trial and test.\n\tNote: For analysis, a statistical test that takes individual ants into account is recommended, thereby accounting for variability within individuals. When classifying ants’ responses during training in a binary manner (1 for positive responses and 0 for no response), logistic regression with mixed effects is advisable16,19. For comparing the proportion of ants responding in each training trial or test, a G-test or Fisher’s exact test is recommended, depending on the number of ants analysed16,20."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}