{
  "id": 6119,
  "origin_website": "Bio",
  "title": "Intracellular and Mitochondrial Reactive Oxygen  Species Measurement in Primary Cultured Neurons",
  "procedures": [
    "In this protocol, we introduce two types of ROS measurement in primary neuronal cells under oxidative stress.In advance, a 35 mm plate for live cell imaging, is coated with 2 ml poly-D-lysine solution at 4 °C for 24 h.Optional: Instead of using 35 mm dish for ROS measurement, the following method is possible. Place the sterile cover glasses slip flat into each well of a 6-well plate. Add 2 ml of Poly-D-lysine solution to each well and coat at 4 °C for 24 h.Remove the poly-D-lysine solution and wash twice with cold PBS.Dry the coated plate on a bench while E17 rat embryo is being prepared.Carefully take out the E17~E18 embryos from the Sprague Dawley rat using Dressing Scissors (Equipment 3) and Spring Dressing Forceps Blunt (Equipment 7). Place them in a Petri dish filled with cold Prep medium (Figures 2A-2D). Note: In this experiment, the pregnant Sprague Dawley rats were anesthetized with CO2 and euthanized using CO2 after embryos extraction. All experimental procedures were conducted after approval of Institutional Animal Care and Use Committee of Sungkyunkwan University.Using Dissecting Scissors (Equipment 5) and Spring Dressing Forceps Sharp (Equipment 6), carefully take out individual embryo from uterus and embryonic sack (Figures 2E-2F).Using Dissecting Scissors (Equipment 4) and Multi Purpose Forceps Pointed (Equipment 8), excise the scalp and skull of the E17-E18 embryos and pull out the whole brain. Place the extracted brain in Prep medium (Figures 2G-2I).Note: For proper cell conditions, this process (Steps 4-6) should be finished within 15-20 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531034247_4800.jpgFigure 2. The process of embryo extraction in pregnant Sprague Dawley rat (E17-E18) (Steps 4-6)After taking out the embryo's brain, place it in the prep medium as shown in Figure 3A.Dissect the cerebral cortex from the whole brain as Figure 3B.",
    "Note: When separating the cortex from the embryo’s brain, you must be careful not to separate other parts together. When you progress from Step 7 to Step 8 (Figure 3A to Figure 3B), insert the micro forceps between the inner side of the cortex and the outer part of the striatum, and then cut cortex from embryo’s brain. As you see in Figure 3A, the cortex is on the surface as it envelops other parts of the brain. There is a striatum on the inner side just below the cortex.Remove meninges and blood vessels outside the cerebral cortex (Figure 3C). Place the cerebral cortex in Prep medium as Figure 3D.Notes: After removing the meninges and blood vessels as shown in Figure 3, remove the hippocampus part that is attached to the inner side of the cortex. You can use the cortex part for cortical neuron cell culture or you can conduct hippocampal neuron cell culture with the hippocampus part.For proper cell conditions, this process (Steps 7-9) should be done within 20-25 min. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531034429_0673.jpgFigure 3. The process of extracting cortex region from the extracted whole brain (Steps 7-9)Transfer the cerebral cortex to a conical tube (15 ml size) filled with 2 ml of Prep medium and add 300 μl of trypsin solution to make final concentration about 10% (Figure 4A).Place the conical tube in a 37 °C incubator or water bath and gently tapping it periodically (Figure 4B).After about 15 min, carefully suspend the cells using a 10 ml disposable pipette (Figure 4C).Put 400 μl of FBS in the tubes to 10% concentration and carefully suspend the cells again.Filter the cells through a 70 μm nylon cell strainer to obtain single cell suspension (Figure 4D).",
    "Seed the cells at 1 x 106 cells in a 35 mm dish after diluting the cells with 2 ml Culture medium and incubate the cells in an incubator at 37 °C for 18 h (Figures 4E and 4F).Replace Culture medium in the dish with 2 ml of Maintain Culture medium.Note: If cells are maintained in the Culture medium for too long, other brain cell types including microglia and astrocyte are likely to grow up. Therefore, Culture medium should be replaced with Maintain culture medium 12-18 h after the cell seeding.Replace the half of the media in the 35 mm dish with the new 1 ml Maintain culture medium every other day.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531034644_3423.jpgFigure 4. The Process of making single cells of brain tissue and preparing for cell seeding (Steps 10-17)Grow the cells for at least 7 days after the seeding for experiments (Figure 5).Note: When you seed the cells, various brain cells (neuron, microglia, astrocytes) are present in the medium. However, after replacement with the Maintain culture medium, only the neuron cells remain specifically because all other types of cells except for the neuron cell are removed by the B-27 constituting the Maintain culture medium.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531034749_4038.jpgFigure 5. Cell morphology at the 1st day (A) and after 8 days (B). Scale bars, A = 500 μm; B = 200 μm.Incubate the cells in ROS inducing conditions for about 24 h.Note: 5 μM of oligomeric Aβ1-42 was added to induce ROS in this protocol, but it may vary depending on your experimental conditions. Aβ1-42 is already known to induce ROS (Andrey et al., 2004, Shelat et al., 2008).And then treat with 1 μl of CM-H2DCFDA solution (5 mM) or MitoSOXTM Red solution (5 mM) for 20 min.",
    "Note: MitoSOXTM is a specific indicator for mitochondrial superoxide and CM-H2DCFDA is more sensitive to oxidation by H2O2 than superoxide (O2•−). Therefore, even if two chemicals are processed at the same time, they are labeled with different ROS. However, it is difficult to distinguish exactly two types of ROS and analyze fluorescence in the confocal image. We recommend preparing samples separately and conduct each experiment.Optional: This section provides another option for preparing samples to capture live cell images. If you have cultured cells on a coverslip, carefully put the coverslip into a new 35 mm live cell imaging dish. Put the side of coverslip that cells are attached to the bottom surface.Replace with the new 2 ml of Maintain culture medium. Note: Pre-set the condition for taking live cell imaging; 37 °C and 5% CO2 is required because we want to keep the growing conditions for primary neuron cells. Using confocal microscope, measure the fluorescence mediated by MitoSOXTM (510/580 nm, see Figure 6) or CM-H2DCFDA (495/520 nm, see Figure 7). Since the fluorescence will not last long, it is recommended to measure within 30 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531035057_2479.pngFigure 6. Detection of superoxide in rat primary neuronal cells’ mitochondria with MitoSOXTM Red. Oxidation of MitoSOXTM Red reagent by superoxide produces red fluorescence. A. Bright field rat primary cell images; B. Red fluorescence generated by superoxide; C. Merged image. Scale bars = 50 μm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531035149_5270.pngFigure 7. Measurement of ROS in intracellular compartment induced by Aβ in rat primary cells using CM-H2DCFDA. Green fluorescence represents intracellular ROS level of Aβ or vehicle treated sample. A. Vehicle-treated sample; B. 5 μM of Aβ treated sample. Scale bars = 50 μm.Confocal image measurement settingYou can follow the processes in Figure 8 to measure the level of ROS using confocal microscope:Run the Zen black edition.",
    "Click the ‘Smart Setup’ button in ‘Acquisition’ tab to choose the appropriate excitation/emission wavelengths of the dye (MitoSOXTM or CM-H2DCFDA) (Figure 8 A1).Set the appropriate excitation/emission wavelengths of the dye and choose the image colors in the ‘Search’ tab (Figure 8C 2).Click the ‘Best signal’ button.Put the sample on the live cell imaging chamber (Figure 1C).Click the ‘Locate’ tab and adjust the focus of confocal microscope (Figure 8B 3).After setting the focus of the microscope, click the ‘Set Exposure’ button in ‘Acquisition’ tab.Note: ‘Set Exposure’ automatically adjusts the detector Gain value (Figure 8A). Click the ‘Live’ button (Figure 8A).Note: ‘Live’ performs constant scanning of real-time image.To get clearer and more accurate images in 'Live' conditions, adjust each value of ‘Gain’, ‘Digital offset’, ‘Digital Gain’, ‘Pinhole’, and laser power (Figure 8D 5). You can also adjust ‘Speed’ and ‘Averaging’ to acquire better images.Note: In this experiment, ‘Speed’ was set to 7 and ‘Averaging’ number was set to 8. (Figure 9)Click the ‘Snap’ button to acquire the image (Figure 8A).Note: All samples should be measured under the same conditions. The measurement method was based on the instructions of the confocal equipment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531035301_4281.pngFigure 8. Flow chart of measuring method of ZEN black version of image measurement programimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531035435_1284.jpgFigure 9. The tab to control 'speed' and 'averaging' in ZEN black version"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}