{
  "id": 13030,
  "origin_website": "Jove",
  "title": "Preparation and Immunofluorescence Staining of Bundles and Single Fiber Cells from the Cortex and Nucleus of the Eye Lens",
  "procedures": [
    "Mice have been cared for based on an animal protocol approved by the Institutional Animal Care and Use Committee at Indiana University Bloomington. The mice used to generate representative data were control (wild-type) animals in the C57BL6/J background, female, and 8-12 weeks old. Both male and female mice can be used for this experiment, since the sex of the mice is very unlikely to affect the experiment's outcome.\n1. Lens dissection and decapsulation\nEuthanize mice following the National Institutes of Health's \"Guide for the Care and Use of Laboratory Animals\" as well as animal use protocols approved by the institution.\n\tNOTE: For the present study, mice were euthanized by CO2 overdose followed by cervical dislocation in accordance with an approved animal protocol (Indiana University).\nEnucleate the eyes from the mice using curved forceps by depressing the tissue around the eyes with one side of the forceps to displace the eye out of the socket. Next, close the forceps underneath the eye and lift to remove the eye from the socket. Transfer the eyes to fresh 1x phosphate-buffered saline (PBS) in a dissection tray.\nCut the optic nerve with ultra-fine scissors as close as possible to the eyeball. Carefully insert fine-tip, straight tweezers into the eyeball through the optic nerve's exit at the posterior of the eye.\nCarefully insert scissors at the same location as the tweezers in step 1.3 and begin cutting an incision from the posterior toward the corneal-scleral junction.\n\tNOTE: Rodent lenses occupy ~30% of their eyes. Accidental damage will occur if the tweezers or scissors are inserted too deep into the eye.\nContinue cutting along the corneal-scleral junction until at least half of the junction has been separated.",
    "Use tweezers to gently push on the cornea so that the lens can exit through the incision made with steps 1.4 and 1.5.\nCarefully remove any large pieces of tissue from the lens using fine-tip, straight tweezers. Inspect the lens to find the equatorial region.\nShallowly pierce the lens using fine-tip, straight tweezers, and then remove the lens capsule. The mass of lens fiber cells will remain intact, and the lens epithelial monolayer will remain attached to the lens capsule. Discard the lens capsule.\n2. Lens single fiber cell staining\nTransfer the lens fiber cell mass to a well plate with 500 µL of freshly made 1% paraformaldehyde (PFA; in 1x PBS) solution and incubate the samples at 4 °C overnight with gentle nutation (Figure 2A).\n\tNOTE: The volumes for the solutions given are optimized for 48-well plates. If another size well-plate or tubes are used, adjust the volumes of the solutions accordingly. Fixation, blocking, and washing (1x PTX, 0.1% Triton X-100 in 1x PBS) solutions were made with 10x PBS and double distilled water (ddH2O) to a final concentration of 1x PBS.\nTransfer the lens fiber cells to a 60 mm dish with 1% PFA. Use a sharp scalpel to split the ball of fiber cells in half along its anterior-posterior axis (Figure 2B). Cut the halves in half again along the same axis to produce quarters.\n\tNOTE: The anterior-posterior axis is easily recognized by the direction of the fiber cells in the tissue mass.\nUse straight tweezers to remove the nucleus region from the lens fiber cell quarters (Figure 2C).\n\tNOTE: The lens nucleus region is rigid in rodent lenses, and the center of the lens will separate from the softer cortical fibers easily.",
    "Post-fix the quarters of the lens cortex region in 200 µL of 1% PFA for 15 min at room temperature (RT) with gentle shaking (300 rpm on a plate shaker).\nWash the tissue quarters twice in 750 µL of 1x PBS for 5 min each with gentle shaking at RT.\nBlock the samples using 200 µL of blocking solution (5% serum, 0.3% Triton X-100, 1x PBS) for 1 h at RT with gentle shaking.\n\tNOTE: For the representative data in this protocol, the samples were not stained with primary or secondary antibodies. After the blocking step, the samples were incubated with wheat germ agglutinin (WGA; 1:100) and phalloidin (1:100) (see Table of Materials) for 3 h at RT with gentle shaking and protection from light. Primary antibody staining has been demonstrated in previous publications22,23.\nIncubate with 100 µL of primary antibody solution overnight at 4 °C with gentle shaking.\n\tNOTE: The antibodies are diluted in blocking solution. Compared to slides with tissue sections, there are more cells in this type of preparation. Primary antibody concentrations should be increased to provide ample antibodies to stain more cells. Doubling the antibody concentration from what is used on tissue sections is recommended. The same applies to secondary antibodies.\nWash the tissue quarters three times with 1x PTX (0.1% Triton X-100, 1x PBS) for 5 min each at RT with gentle shaking.\nIncubate the fiber cells with 100 µL of secondary antibody/dye solution for 3 h at RT with gentle shaking. Protect the samples from light during this and subsequent steps.\n\tNOTE: WGA, phalloidin, and other fluorescent dyes can be added to the secondary antibody solution for simultaneous labeling of the cell membrane, cytoskeleton, or other organelles while also labeling the primary antibody.",
    "Wash the fiber cells four times with 1x PTX for 5 min each at RT with gentle shaking.\nAdd one drop or 50 µL of mounting media onto a plus-charged microscope slide before transferring the tissue quarters to the slide.\nUse tweezers to gently separate the fiber cells from each other and try to limit overlapping of the cell bundles.\nGently apply a #1.5 coverslip on top of the sample in mounting media. The mounting media should spread to the edge of the coverslip; if this does not occur, add some additional mounting media to the edge of the coverslip. Aspirate away any excess mounting media around the edge of the coverslip and use nail polish to seal the edges of the coverslip on the slide.\n\t​NOTE: Any type of mounting medium that is formulated for confocal microscopy can be used for these experiments.\n3. Lens nucleus single fiber cell staining\nComplete the dissection outlined in section 1.\nMechanically remove the cortical fibers from the ball of the lens fiber cells, leaving the lens nucleus, by gently transferring the fiber cell mass to wet, gloved fingertips and gently rolling the tissue mass.\n\tNOTE: In mouse lenses, rolling the ball of lens fiber cells between gloved fingertips is an effective method for removal of the cortical fiber cells from the hard lens nucleus28,30. For lenses where this mechanical method is not effective, careful dissection or a vortexing method29 may be used to remove the cortical fiber cells.\nTransfer the lens nucleus to freshly made 1% PFA solution in a well-plate and incubate overnight at 4 °C with gentle shaking.",
    "Transfer the sample to a 60 mm dish with 1% PFA and use a sharp scalpel to split the lens nucleus along the anterior-posterior axis. Halve the tissue samples again to produce nucleus quarters.\nFollow the process outlined in steps 2.4-2.13 for immunostaining and sample mounting.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65638/65638fig02v2.jpg\nFigure 2: Graphical summary detailing the preparation and immunostaining of lens fiber cells. (A) This 48-well plate has been color-coded by column to demonstrate a sample plate setup for the described methods, allowing easy transfer of samples between the various immunostaining steps by gentle handling using forceps. While the representative data for this protocol is not incubated with a primary antibody, the diagram includes a column for primary antibody incubation, and the wells for washing can be reused after removing used wash buffers by aspiration. (B) After fixation of the lens fiber cell mass, the tissue is split along the anterior-posterior axis (red dashed lines) to preserve the original structure of the cells. Once the tissue mass has been halved, the samples are rotated and the halves split into quarters along the anterior-posterior axis (red dashed lines). (C) Removing the lens nucleus region (in pink) is easily done using tweezers to dig out the dense central tissue from the cortical fiber cells (in blue). Cartoon diagrams were partially created using BioRender.com and not drawn to scale. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65638/65638fig02large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}