{
  "id": 10703,
  "origin_website": "Jove",
  "title": "An Experimental and Finite Element Protocol to Investigate the Transport of Neutral and Charged Solutes across Articular Cartilage",
  "procedures": [
    "NOTE: The protocol presented here is adopted from the experimental and computational procedures of recent research papers 6,8,9. The protocol is illustrated in Figure 1.\nThe cadaveric materials were collected with permission from veterinary faculty of Utrecht University.\n1. Sample and Bath Preparation\nDrill out cylindrical osteochondral plugs (diameter of 8.5 mm) from cadaveric equine femoral condyles using custom-made drill bit (Figure 1) while spraying cool Phosphate-buffered Saline (PBS) to prevent overheating and subsequent cartilage damage.\nHeat-shrink the osteochondral plugs with a plastic shrinking sleeve to minimize the lateral diffusion of the overlaying bath.\n\t\nMount the osteochondral plug with cartilage at the top initially inside the plastic shrinking sleeve and follow by blowing hot air to it. Add wet cotton pieces on the surface of cartilage to prevent heat-related damage.\nPrepare finite-baths of charged (e.g., 650 µL, 420 mM, ioxaglate, Molecular Weight (MW) = 1,269 Da, charge = -1) and neutral (650 µL, 420 mM, iodixanol, MW = 1,550 Da) solutes separately.\nLoad the prepared finite-baths on the surface of cartilage using a syringe and place a cork plug on the wrapped sample to prevent evaporation during experiments at RT (Figure 2A). To study the neutral solute transport, place the iodixanol bath and to study the negatively charged solute transport place ioxaglate bath onto the cartilage surface.\n2. Imaging and Image Processing\nPlace the wrapped samples isolated with cork plug on a custom-made holder attached to the motorized stage of a micro-CT. Place the sample so that cartilage surface covered with contrast agent solution is facing upward.",
    "Scan using the micro-CT (voxel size of 40 × 40 × 40 µm3, scan time of 2 min , tube voltage of 90 kV and tube current of 180 µA) a field of view consisting of cartilage, subchondral plate, and finite-bath in several time points until equilibrium state (48 h) is reached (Figure 2A). The equilibrium state is achieved when concentration values do not change over time.\nRegister the 3D images in different time points based on the initial image to facilitate positioning of the Region of Interest (ROI) using manufacturer's software (e.g., Analyze).\nConvert the 3D reconstructed micro-CT images into 2D Tagged Image File Format (TIFF) stack before processing them using manufacturer's software.\nGlobally segment (ImageJ>Adjust>Threshold) the cartilage from the subchondral bone and overlying bath in the software.\nObtain the average grey value of cartilage at different time points (ImageJ>Analyze>Measure) using the generated cartilage mask in the previous step.\nGiven the initial bath concentration and initial contrast agent concentration in the cartilage, use a linear calibration curve to convert the average grey values to the actual concentration of solutes. Previous data support the fact that grey values maintain a linear relationship with the concentration of contrast agents.\nPlot the solute concentrations versus experimental time points.\n3. Computational Modeling\nNOTE: The diffusion in this problem is assumed to take place in 1D (along the z-axis), which complies with the experimental boundary condition. Therefore, the geometry could be arbitrarily created.\nBuild finite-bath based cartilage multi-zone models: 1) cartilage consisting of superficial zone (20% of the total cartilage thickness), middle zone (50% of the total cartilage thickness) and deep zone (30% of the total cartilage thickness) 12 and 2) finite-bath in FEBio 13,14 (Figure 2B).",
    "Assign the mechanical and physical properties of different zones of cartilage and bath in FEBio. Young's modulus (10 MPa) was assumed to be high enough to resist the osmotic pressure exerted by the overlying bath and therefore protect the cartilage from excessive deformations.\n\t\nUse a hydraulic permeability of 10-3 mm4/Ns and Poisson's ratio of 0. Use actual solute diffusion coefficient of the bath in the simulations 8,9.\nGenerate mesh (8-node trilinear hexahedral elements) and refine it near the boundaries (Figure 2B) 8,9.\nBiphasic-solute model\n\t\nApply initial solute concentration in the bath and effective pressure corresponding to it. Look at the description of effective pressure in 9,15.\nRun the model in transient mode to obtain solute concentration versus time curves according to the prescribed diffusion coefficients in different cartilage zones.\nMultiphasic model\n\tNOTE: The electric fluctuation between bath and tissue can be circumvented by adding two monovalent counter-ions to both the bath and the tissue.\n\t\nFor steady-state models: use the same effective fluid pressures and concentrations in cartilage and overlying bath while increasing FCD to its desired value.\nFor transient models: create a well-stirred finite-bath by keeping the solute diffusion coefficient in the bath sufficiently high. Inject the solute from the bath-air interface into the bath to reach its desired concentration value.\nTransient: remove the prescribed solute concentration boundary condition in the previous step and revert the diffusion coefficient of the finite-bath to its actual diffusion coefficient.\nRun the model to obtain solute concentration-time curves based on applied FCDs and diffusion coefficients in different cartilage zones.\nFEBio-MATLAB interface\n\t\nDevelop a MATLAB code to automatically perform simulation in FEBio and plot concentration-time curves (FEBio-MATLAB interface) 8,9.\nChange diffusion coefficients and FCDs in cartilage zones using FEBio-MATLAB interface. Run models in FEBio and extract solute concentration-time curves 8,9.",
    "Compare the obtained solute concentration-time curves with the experimental data and obtain sets of diffusion coefficients and FCDs in different cartilage zones based on minimum root mean square error (RMSE) 8,9.\nimgsrc://cloudfront.jove.com/files/ftp_upload/54984/54984fig1.jpg\nFigure 1: Experimental Setup. A) Sample extraction procedure using a custom-made drill bit. B) Micro-CT imaging procedure to monitor diffusion process. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54984/54984fig1large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/54984/54984fig2.jpg\nFigure 2: Schematic. A) Experimental design. B) Multi-zone computational model consisting of the finite bath, superficial, middle and deep zones of cartilage and associated mesh. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/54984/54984fig2large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}