{
  "id": 8548,
  "origin_website": "Jove",
  "title": "A Preclinical Model to Assess Brain Recovery After Acute Stroke in Rats",
  "procedures": [
    "The procedure and use of animal subjects have been approved by the National Institute of Health for the care and use of laboratory animals. This protocol is specifically adjusted for the tests of middle cerebral artery occlusion/reperfusion (MCAO/R) and sensorimotor function.\n1. Experimental design and grouping\nUse a rat MCAO/R model to screen a rat brain ischemic model method with more severe brain injury and greater model success ratio using Longa's score and TTC staining.\n\t\nPerform the experiment on male Sprague-Dawley rats weighing 260−330 g that are 7−9 weeks of age. The real rat weight is 275 ± 15 g for 275 g, 300 ± 10 g for 300 g, and 320 ± 10 g for 320 g.\nUse the following seven groupings (weight, thread bolt type, infarct time): group 1 with 15 rats (275 g, 2636, 2 h); group 2 with 15 rats (275 g, 2636, 3 h); group 3 with 15 rats (275 g, 2838, 2 h); group 4 with 15 rats (275 g, 2838, 3 h); group 5 with 13 rats (300 g, 3040, 3 h); group 6 with 10 rats (320 g, 3040, 3 h); group 7 with 13 rats (300 g, 3043, 3 h).\nStudy the brain recovery status by TTC staining, and use suitable sensorimotor function tests to indicate the long-term functional deficits by the bilateral asymmetry test, grid-walking test, rotarod test and lifting rope test after 1, 35, 60, 90 days of MCAO/R.\n\t\nUse male Sprague-Dawley rats weighing 300 ± 10 g that are 8−9 weeks of age.\nUse the following five groupings: a control (normal) group with 20 rats; a 1 day group with 16 rats; a 35 day group with 16 rats; a 60 day group with 17 rats; and a 90 day group with 19 rats.",
    "After the Longa's score in step 1.1 or sensorimotor functional tests in step 1.2, anaesthetize and decapitate all rats for TTC staining.\n2. Establishment of a unilateral MCAO/R model in rats9\nNOTE: During the operation, use the microforceps gently to prevent breakage of the blood vessel. Avoid damage to the nerves and other blood vessels in the neck of the rat when the vessel is isolated. Care must be taken to present appropriate aseptic technique for all survival surgical procedures. The technique illustrated later in the video should be practiced through the entire procedure.\nThroughout the surgery, maintain the body temperature of the rats at 37.0 ± 0.5 °C in a small animal thermostat. Prepare four 6 cm 5-0 sutures.\nSet the oxygen flow rate of a small animal anesthesia machine (with a waste gas treatment device) at 0.4−0.6 L/min and the concentration of isoflurane to be 5%. Place the rat in the anesthesia machine.\nAfter the animal has fainted, place the rat on a surgical fixing table. Connect the mouth of the rat to the mask of the anesthesia machine (the oxygen flow rate remains unchanged; adjust the concentration of isoflurane to be 3%). Confirm that the animal has entered deep anesthesia by observing a lack of extremity tension, corneal reflexes, and pain.\nFix its limbs to lie on the operating table with paper bandages (or other tools).\nRemove the neck coat with an electric shaver and sterilize with 75% alcohol (iodophor is better). Fix the mouth of the rat with a hook.\nCut 2−3 cm along the central longitudinal shape of the neck with ophthalmic scissors.",
    "Separate the common carotid artery. Separate the subcutaneous muscle with ophthalmic forceps. Use homemade retractor to fully expose the field of vision. After separating the anterior muscle of the trachea with ophthalmic forceps, separate along the right sternocleidomastoid tendon until the common carotid artery is visible.\nIsolate the common carotid artery, the external carotid artery and the internal carotid artery with ophthalmic forceps. Ligate the common carotid artery (hard knot), external carotid artery far from the heart end (hard knot), and internal carotid artery (loose knot) with 5-0 sutures. Line the external carotid artery near the heart end with 5-0 sutures.\nInsert a thread bolt. Cut a small opening in the external carotid artery using ophthalmic scissors and gently insert a thread bolt. Ligate the suture of the external carotid artery that has been in loose knot and cut off the external carotid artery.\n\t\nLoosen the loose knot of the internal carotid artery and continue inserting the thread bolt to the beginning of the middle cerebral artery (suture marked). Then cut off the exposed thread bolt.\nAfter the ischemic time is reached (2-3 h), fix the fracture of the external carotid artery with one microforceps, and gently pull out the thread bolt with another microforceps. When the front end of the thread bolt is completely withdrawn from the internal carotid artery, ligate the external carotid artery that was lined with 5-0 sutures, and then pull out the thread bolt completely.\nLoosen the common carotid artery, and daub ~50,000 U of penicillin sodium powder on the surface of the wound to prevent infection. Suture subcutaneous muscles and skin with 4 sutures.",
    "Give ~0.2 mL of sterile saline to the rat orally using a 1 mL syringe (SQ-PEN injection is better) to prevent postoperative water shortage after placing the rat back to the cage.\nChoose the animals after 24 hours of reperfusion according to the Longa's score10. Select animals with a Longa's score of 1−3 for the next TTC staining in step 1.1, and animals with a Longa's score of 2−3 score for the 1, 35, 60, 90 days study in step 1.2.\n\tNOTE: Longa's score10: 0 score, no neurological deficit; 1 score, failure to extend left foreclaw; 2 score, circling to the left; 3 score, falling to the left; 4 score, cannot walk spontaneously and has a depressed consciousness.\nAnalyze the Longa's score by one-way ANOVA. Values shown represent mean ± S.D. P < 0.05 indicate difference.\n3. TTC staining\nNOTE: The rat brain slice mold and blade must be pre-cooled in a -20 °C refrigerator before use to prevent adhesion caused by a large temperature difference. During staining, prevent adhesion between the brain slices and the culture plate, which can result in insufficient staining.\nAnesthetize the rat by intraperitoneal injection of 400 mg/kg chloral hydrate after the Longa's score in step 1.1 or sensorimotor functional tests in step 1.2.\nDecapitate the rat with surgical scissors or with a rat decapitation apparatus. Remove the brain with surgical scissors and hemostatic forceps.\nPut the brain in the refrigerator at -20 °C for 30 min to facilitate slicing.\nRemove the brain from the refrigerator and place it in pre-cooled rat brain slice mold. Cut the brain into six 2-mm-thick consecutive sections with a pre-cooled blade.\nStain the sections with 2% 5-triphenyl-2H-tetrazolium chloride (TTC) in a 6-well culture plate.",
    "Culture the sections for 30−60 min at 37 °C in a shaking bed. Flip the sections every 10 min until the brain ischemia area and the normal area are clearly white and red.\nLine the brain slices vertically in order from the back to the front of brain. Use a ruler to ensure that the total length of each line is same. Take pictures with digital camera.\nAnalyze the infarct volume.\n\t\nPre-treatment the photo with photoshop software\n\t\t\nImport the photo using photoshop CS6. 00:00-00:14\nClick Select to select the brain slices, click Select | Inverse. 00:15-00:36\nClick Foreground to select black and click OK. 00:37-00:42\nPress Alt +Delete to fill the background color, and CTRL +D to deselect. 00:43-00:46\nClick File | Save to desktop. 00:47-01:08\nPre-treatment the photo with Image Pro Plus software.\n\t\t\nOpen Image Pro Plus 6.0 software and import the photo. 01:09-01:24\nFor defect modification, adjust the brightness with the Contrast Enhancement tool, so that the background is black. 01:25-01:37\nUse the Median tool in Filter to remove the highlights. 01:38-01:46\nCalculate the left (normal) brain area with Image Pro Plus software\n\t\t\nSelect color using Segmentation and adjust the value of H/S/I, so that the brain slices are separated from the black background. 01:47-02:12\nReturn to Count | Size. 02:13-02:16\nClick on Count | Split Objects in Edit to separate the brain from the midline. The software will automatically distinguish the left and right brain areas. 02:17-02:49\nCalculate the right infarct brain area with Image Pro Plus software\n\t\t\nImplement step 3.8.1-3.8.2. 02:50-03:14\nSelect Count | Size. 03:15-03:21\nClick on Draw | Merge Objects tool in Edit. Manually select the ischemic area and click Count to calculate the ischemic area. 03:16-05:31\nCalculate the health brain area with Image Pro Plus software\n\t\t\nImplement step 3.8.1-3.8.2. 05:32-06:44",
    "Select color using Segmentation and adjust the value of H/S/I, so that the normal part of brain slices are separated from the black background. 06:45-07:10\nReturn to Count | Size and click on Count to calculate this area. 07:11-07:21\nClick on Split Objects in Edit to separate the brain from the midline. The software will automatically distinguish the left and right brain areas. 07:22-08:08 ​\nCalculate the infarct volume (%) and infarct and shrink volume (%):\n\tInfarct volume (%) = [right infarct area/(2 x left brain area)] x 100.\n\tInfarct and shrink volume (%) = [(left brain area - right health brain area) / (2 x left brain area)] x 100.\n\tNOTE: The right brain is the injured part. The data were analyzed by one-way ANOVA. Values shown represent mean ± S.D. P < 0.05 indicate difference.\n4. Assessment of sensorimotor function\nNOTE: Rats (300 g, 3040 thread bolt, 3 h brain infarct time) with a Longa's score of 2−3 were selected to perform the sensorimotor function experiments from 1-90 days. Keep quiet and do not disturb the animals during this period of study. The data were analyzed by two-way ANOVA. Values shown represent mean ± S.D. P < 0.05 indicate difference.\nBilateral asymmetry test11\nWrap paper tape (5 cm long, 0.8 cm wide) on the saphenous part of each foreclaw of a rat three times with equal pressure.\nFor each rat, record the number of times each foreclaw is contacted and tape removed in 5 min with camera, including unaffected paw times and affected paw times.\nAfter 30 min, repeat steps 4.1.1 and 4.1.2 again.\nCalculate the average value of the sensorimotor bias (%):\n\t\tSensorimotor bias (%) = (unaffected paw times - affected paw times)/(unaffected paw times + affected paw times) x 100\nGrid-walking test",
    "Place the rat in the center of an elevated grid surface platform (area: 1 m2; height: 90 cm) with grid openings of 2.5 cm2.\nPush the rat's hips lightly to encourage the rat to traverse the grid surface.\nRecord the number of foot faults made by the unaffected (right) and affected (left) limbs and the total step number in 1 min with camera.\nCalculate the error times:\n\t\tError times (%) = [unaffected (right) limb - affected (left) limb]/total step number x 100.\n\t\tNOTE: Total number of steps below 20-step data were removed.\nRotarod test12,13\nSet up the rat rotating bar fatigue apparatus (diameter 90 mm) of rats using the supporting software to a speed of 13 rpm over a 5 min period on the computer.\nStart the computer programs and place the rat on the rotarod rungs at the same time.\nEnd a trial if the rat falls off the rung or keeps walking for 5 min and record the rotating time.\nHave the rat rest for 30 min.\nRepeat steps 4.3.2−4.3.4 twice more and choose the maximum value to be the last rotating time.\nLifting rope test14\nPlace the lifting rope instrument (70 cm high; the rope is 0.2 cm in diameter and 40 cm long) on the desk.\nHave the rat grip the rope with its forelimbs and hang the rat.\nRecord the time of hanging and calculate the scores.\n\t\tNOTE: A score of 3: 0−2 s on the rope; A score of 2: 3−4 s on the rope; A score of 1: 5−6 s on the rope; A score of 0: more than 7 s on the rope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}