{
  "id": 7197,
  "origin_website": "Bio",
  "title": "Screening for Lysogen Activity in Therapeutically Relevant Bacteriophages",
  "procedures": [
    "Coincubation of phages and bacterial hosts (spot assay)Note: The estimated time to complete this section is 45 min of benchwork followed by overnight incubation. In a sterile glass test tube, mix 1 ml bacterial culture with 3 ml molten top agar.Note: The top agar can be liquified using a microwave. Be careful: too hot a temperature of the top agar will kill the bacterial population, resulting in a poor lawn. The top agar should be liquid but pleasantly warm to the touch (approximately 50°C). Pour the mixture onto a room-temperature LB agar plate and allow to solidify.Prepare two or three serial dilutions (~ 1 ml) of the high-titer phage lysate in PBS.Note: We recommend using at least two concentrations of phage, for example 108 and 106 PFU/ml. Spot 10-μl drops of each phage lysate dilution onto the surface of the prepared plate.Note: Spots of further dilutions or replicates of the same dilutions can be added to the same plate. Leave the plate, lid partially on, close to a Bunsen burner until the spots are completely dry; this can take up to 30 min. Alternatively, the plates can be left to dry in a biosafety hood.Incubate at 37°C for up to 4 days, with daily checks to assess the formation of “mesas” (Figure 1A) (Pope et al., 2013).Note: Mesas are zones of confluent bacterial growth in the center of the lysis spots. Bacteria growing on mesas have become resistant to the phage, possibly (but not exclusively) due to homoimmunity. While checking for mesas, also look for agar dehydration due to prolonged incubation, which could hamper bacterial viability. Desiccation can be further avoided by incubating the plates in a sealed container with a wet paper towel, creating a humid chamber.",
    "Using a sterile wire loop, scrape one loopful of bacterial growth from a mesa and use it as the primary inoculum for a streak plate on fresh LB agar (see Graphical abstract). Repeat for each mesa.Incubate at 37°C overnight. Assess the growth of clearly isolated colonies.Note: Any of these colonies could contain the integrated prophage. We routinely test 10 colonies obtained from each of at least two mesas, for a total of at least 20 colonies. Patch plate screenNote: The estimated time to complete this section is 30 min of benchwork and multiple overnight incubations. Label and divide two LB agar plates into a grid with as many sections as colonies to be screened. Number the sections on both plates identically from 1 to 20.Note: A single plate can comfortably fit 20 colonies. Prepare one of the plates with a lawn of bacterial host following Steps A1 and A2. The other plate is used without further preparation.Using a sterile wire loop, a disposable pipette tip, or a sterile toothpick, take a random colony from the streak plate (prepared in Step A7), gently patch it onto section 1 of the LB plate, and then onto its corresponding section of the LB plate with the bacterial host lawn (Step B2).Note: Avoid tearing the delicate agar while performing the patches. Repeat Step B3 with as many colonies as needed.Incubate the plates at 37°C for up to 2 days, with daily checks for interpretation.To interpret the test, look closely at the plate with the host lawn. Positive colonies, those potentially harboring the prophage, will present signs of lysis (plaques, halos, loss of turbidity) on the lawn around them, which is caused by the spontaneous release of the phage (Figure 1B).",
    "Note: If all the screened colonies are negative for the patch test, it can be concluded that the phage is unable to lysogenize the host (see Table 1). False positive results here are possible due to carry-over of phage particles from the mesa onto the streak plate (Step A7). For each positive colony, return to the LB plate without the host lawn (prepared in Steps B3-B4), pick a section of the patch with a wire loop, and streak onto a fresh LB plate.Incubate overnight at 37°C.Pick a single colony with a wire loop and re-streak onto a fresh LB plate.Incubate overnight at 37°C.Note: You have now performed a double single-colony purification. Using colonies from this plate (B9), repeat Procedure B (Figure 1C) and perform tests C and D to confirm lysogenic behavior. Spontaneous phage release in liquid culture test (Supernatant assay)Note: The estimated time to complete this section is 45 min of benchwork followed by overnight incubation. Following purification of the colony of interest with two consecutive streak plates, inoculate the colony into a 10-ml Falcon tube containing ~4 ml LB.Incubate overnight at 37°C with aeration.Note: Aeration, achieved by leaving enough head space in the tube and incubating on a shaking platform at 150 rpm, is needed for optimal growth of the host used in this example. Growth conditions can be modified to cater to different hosts. Centrifuge the culture at 3,500 × g for 10 min.Collect the supernatant using a 10-ml syringe.Attach a 0.2-μm filter to the syringe and carefully depress the plunger to filter the supernatant into a fresh tube.Note: This step is optional. If not performed, we recommend repeating Steps C3 and C4. Perform a spot assay (Procedure A), replacing the phage lysate with the filtered supernatant from C5.",
    "For test interpretation, look for signs of lysis on the spot assay caused by the spontaneous release of phages from the lysogens into the supernatant of the liquid culture (Figure 1D).Immunity assayNote: The estimated time to complete this section is 15 min of benchwork followed by overnight incubation. Perform a spot assay (Procedure A) replacing the original bacterial host with the candidate lysogen purified in Step B9.For test interpretation, look for the absence of lysis caused by homoimmunity (no clearing, plaques, or loss of turbidity on the bacterial lawn) (Figure 1E).Note: An immunity assay showing resistance to the original phage, without positive findings of lysogeny on Procedures B and C, is suggestive of alternative mechanisms of phage resistance. Conversely, a confirmed lysogen will test positive in Procedures B, C, and D. For an expanded explanation regarding interpretation of the procedures, see Figure 1 and Table 1. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3997/bioprotoc-11-08-3997-g001.jpgFigure 1. Screening for lysogenic behavior of phage øCO01 (Gordillo Altamirano et al., 2021) on host strain Acinetobacter baumannii A9844 (Peleg et al., 2008) and phage øFG-VRE (unpublished) on host strain Enterococcus faecium ST796 (Buultjens et al., 2017). A. Spot assay with droplets of 108 and 106 PFU/ml phage lysate after a 48-h incubation. Black stars denote mesas. B. First patch assay using plates with and without lawns of the bacterial hosts. Black arrows (colonies 9, 13, and 15 on A. baumannii and colony 11 on E. faecium) show bacterial growth with surrounding lysis, indicating the presence of phage, possibly released from a lysogen. Zoomed sections are provided as examples of positive and negative colonies. For A. baumannii, the panel only shows half the total screened colonies (18/36). C. Second patch plate, after two rounds of single-colony purification of colonies 9, 13, and 15 (A. baumannii) and colony 11 (E.",
    "faecium), without indication of phage presence when patched onto plates containing bacterial host lawns. D. Spot assay performed with the filtered supernatant from cultures of the putative lysogenic colonies, with no indication of spontaneous phage release. E. Immunity assay of colonies 9 and 13 (A. baumannii) and colony 11 (E. faecium) indicates sensitivity to their respective phages, thereby excluding homoimmunity; for colony 15 (A. baumannii), the test demonstrates resistance to the phage, most likely due to a mechanism other than homoimmunity (see Table 1 for interpretation). Taken together, the tests demonstrate the inability of phages øCO01 and øFG-VRE to lysogenize host strains A. baumannii A9844 and E. faecium ST796, respectively. For assays with E. faecium, LB was replaced with BHI (brain heart infusion) media. Scale bars = 0.5 cm."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}