{
  "id": 3689,
  "origin_website": "Cell",
  "title": "Measuring protein levels in planarians using western blotting",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAcrylamide gel casting: day 1\nTiming: 0.5–1 h\nCasting acrylamide gels by hand is a cheaper alternative to purchasing pre-casted gels. The benefit to casting your own gels is the flexibility to change the percentage of acrylamide depending on the size of the proteins you are interested in. The process of casting gels is straight forward and can easily be done if the gel casting equipment is in relatively good condition.\nFirst, ensure that gel casting equipment is clean, wash off with DI water if necessary. Assemble glass gel plates (spacer plate and short plate) together by locking them firmly in the casting frame.\nNote: Make sure glass plates align on the bottom and glass is not severely chipped, this will prevent leaking.\nSet up gel casting module in the fume hood by first placing rubber gaskets in the casting stand, then clamping in the casting frame with glass gel plates (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/376-Fig1.jpg\nFigure 1. Gel casting system\nImage displaying the acrylamide gel casting system. The red arrows indicate the fill line for the acrylamide gel preparation and the green arrows indicate the top of the of the short plate.\nCritical: To avoid excessive cleaning, place paper towels under the gel casting module in case of leakage. Casting acrylamide gels uses toxic chemicals and all steps should be performed in the fume hood.\nPrepare the acrylamide gel solution in a 15 mL conical tube. Add the MilliQ water, 30% acrylamide, 1.5 M Tris (pH 8.8), 10% SDS, 10% APS, and TEMED in the order listed. Refer to Materials and equipment[href=https://www.wicell.org#materials-and-equipment] for the acrylamide gel recipe.\nVortex acrylamide gel solution for 5–10 s. Using a serological pipette, transfer acrylamide gel solution between casting plates, stopping ∼2–3 cm from the top of the short plate.",
    "Note: It is important not to go higher than 2–3 cm from the top. You will need sufficient room to add the acrylamide stack solution and the comb (Figure 1[href=https://www.wicell.org#fig1]).\nAdd 500 μL of Isopropanol on top of acrylamide gel solution, between the glass plates, and evenly distribute to remove all air bubbles. Gels will require 15–45 min to solidify.\nNote: If gel casting begins leaking from the bottom, carefully transfer spilled solution back into the 15 mL conical tube used to prepare the mix. Let the gel completely solidify before removing the gel mixture, which will prevent further spilling over the casting module. Once the gel has solidified, carefully use the gel releaser to transfer the gel into the proper disposal container. Glass plates can be cleaned first using Isopropanol, followed by DI water. Ensure that both the rubber gasket and glass plates are fully dried before going back to step 1.\nOnce the gel has completely solidified, carefully remove all Isopropanol. This can be done with a paper towel or piece of blotting filter paper.\nPrepare the acrylamide stack solution in a 15 mL conical tube. Add the MilliQ water, 30% acrylamide, 1.5 M Tris (pH 8.8), 10% SDS, 10% APS, and TEMED in the order listed. Refer to Materials and equipment[href=https://www.wicell.org#materials-and-equipment] for the acrylamide stack solution recipe.\nVortex acrylamide stack solution for 5–10 s. Use a transfer pipette to transfer the acrylamide stack solution between the casting plates. Fill the plates to the top of the short plate, ensuring there are no air bubbles remaining on top.\nPlace the comb into the acrylamide stack solution and let the acrylamide stack solution solidify ∼5–10 min.",
    "Note: Transfer any spilled acrylamide stacking solution back into the 15 mL conical tube used to prepare the mix. You do not want the spilled solution to solidify on the outside of the gel casing. Remaining acrylamide stack solution should be properly disposed; this includes toxic chemicals.\nOnce the acrylamide stack has solidified, carefully release gel from the casting and place into a bag containing ∼50–100 mL of 1× Running buffer. Refer to Materials and equipment[href=https://www.wicell.org#materials-and-equipment] for the 1× Running buffer recipe.\nPlace the gel flat in a 4°C fridge, submerged in the 1× Running buffer. The gel needs to set for at least 8 h and not exceeding 7 days before being used.\nNote: It is best to clean off gel casting components immediately. Use Isopropanol followed by DI water to prevent buildup of solidified acrylamide solutions.\nProtein extractions: day 2\nTiming: 1.5–3 h\nThe precision of the protein extractions is the most critical part of this protocol. The quality of the protein and the correct measurement of protein levels in samples will ultimately determine the quality of the western blotting. For beginners, try minimizing the number of samples to reduce error.\nPrepare the 1× RIPA buffer by adding MilliQ water, 10× RIPA buffer, 100 mM DTT, 100 mM PMSF, Protease Inhibitor Cocktail, and if needed Phosphatase Inhibitor Cocktail, into a 1.5 mL centrifuge tube and store on ice. Refer to Materials and equipment[href=https://www.wicell.org#materials-and-equipment] for the 1× RIPA buffer recipe.",
    "Note: 100 mM PMSF will need to be rocked at room temperature or heated to 37°C to go into solution. 100 mM DTT, 10× RIPA buffer, and Protease Inhibitor Cocktail can thaw on ice. Proteases (PMSF and Protease Inhibitor Cocktail) should be added last to the 1× RIPA buffer solution. If protein of interest is phosphorylated, add the Phosphatase Inhibitor Cocktail last. Depending on the number of samples, volumes of 1× RIPA buffer can be adjusted accordingly.\nUse a transfer pipette to place 10–30 starving animals into labeled 1.5 mL centrifuge tubes. Leave ∼300 μL of water behind.\nNote: Having more remaining water will slow down the process of removing water between samples. Having not enough water will cause animals to stress and secrete excess mucus.\nQuickly remove remaining water and add 150–200 μL of 1× RIPA buffer to the sample. Keep sample on ice.\nRepeat step 13 for each sample.\nNote: The animals being referenced here are the asexual strain Schmidtea mediterranea. Please take into consideration the length of the animals when performing this on either Schmidtea mediterranea or other planarian species, as this factor may influence the amount of 1× RIPA buffer being required for each sample. For fewer or smaller animals (<3 mm length), use ∼100–150 μL of 1× RIPA buffer (see Troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 1[href=https://www.wicell.org#sec7.1] for details). For more or larger animals (>8 mm length), use∼150–300 μL of 1× RIPA buffer.\nUsing a motorized pestle, homogenize each sample for ∼10–20 s on ice.\nNote: To avoid contamination, use a new sterile pestle for each sample and discard after use.\nIncubate samples on ice for 45 min.\nUsing a pre-cooled centrifuge, spin the samples at 20,817 × g for 20 min at 4°C.",
    "Carefully remove the supernatant from the sample and transfer into a clean, labeled 1.5 mL centrifuge tube.\nNote: Avoid removing supernatant too close to the pellet, this may result in debris contaminating samples.\nSet up the Bradford Assay.\nLabel 0.2 mL PCR tubes for triplicates/sample (ex. Sample 1A, Sample 1B, Sample 1C, etc.).\nAdd 95 μL of MilliQ water to each 0.2 mL tube.\nAdd 5 μL of sample protein extract to each of the corresponding labeled tubes.\nBriefly vortex samples and placed on ice.\nAdd 20 μL of the BSA standard (0–10 μg/μL) into wells of the 96 well plate in triplicates (3 wells/standard).\nAdd 20 μL of the sample extraction into wells of the 96 well plate in triplicates (3 wells/0.2 mL sample tube).\nUse a multichannel pipette to add 200 μL of Bradford Reagent into each well. Carefully mix each well, while avoiding air bubbles.\nNote: The set up above would provide corresponding values between BSA standards and sample protein extraction. For example, the BSA standard 1 μg/μL would have a total of 20 μL/well and hence 20 μg of total protein in that well. The sample protein extract is diluted 1:20 (5 μL/95 μL) and 20 μL would be added to that well. If the sample protein extract had the sample corresponding value as the 1 μg/μL BSA standard, the sample protein extract would contain 1 μg/μL of total protein.\nUse a plate reader with a 595 nm wavelength to read the 96 well plate.\nInclude the transformations in the software: Blank correction (all wells corrected by a common blank group), standard curve fit (linear regression with standard), %CV (calculates %CV of concentrations).\nExport the 96 well plate reads as an excel file.",
    "Use Excel to average sample protein extracts between the triplicates (see Table1[href=https://www.wicell.org#tbl1] for an example).\ntable:files/protocols_protocol_376_10.csv\nCalculate 50 μg of total protein (in μL) for each sample.\n1× Laemmli buffer (in μL) needs to be included for each sample, using the same amount across the samples.\nUse MilliQ water to create equal volumes across the samples.\nNote: You want loading volumes to be identical across samples. Once the volume of loading is determined, you can calculate the amount of 6× Laemmli buffer needed to make the samples 1×, and the amount of MilliQ water that needs to be added to each sample. This means that MilliQ water will be added variably to samples. Aim to load wells with less than 20 μL of sample, so there will be minimal risk of samples leaking into neighboring wells. Loading volumes can be altered depending on the size of the gel (see Troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 1[href=https://www.wicell.org#sec7.1] for details).\nWestern blotting: days 2–4\nTiming: 2–3 days\nThe results of western blotting depend heavily on the transfer of proteins from the acrylamide gel to the membrane.\nPrepare 50 μg samples for loading in 1.5 mL centrifuge tubes, from calculations in step 22. Mix samples by gently pipetting up and down between solutions.\nHeat samples at 94°C for 10 min.\nNote: Depending on the size, total number, or strain of planarians, longer boiling times may be required, as mucus content may interfere with SDS-PAGE results.\nAllow samples to cool down to room temperature.\nQuickly spin down samples using a centrifuge.\nNote: Do not over-centrifuge samples, otherwise you will produce a pellet in the sample.\nSet up gels in the buffer tank.\nRemove gel(s) from the 4°C fridge and quickly wash with DI water.\nCarefully remove the comb and rinse the wells with DI water, to remove debris.",
    "Assemble the gel running module by placing gels in the correct orientation, across from one another (short plates facing inward).\nFill the running module with 1× Running buffer and buffer tank to the fill line with 1× Running buffer.\nNote: If only one gel is being run, place a plastic buffer dam in place of the second gel.\nLoad the acrylamide gel(s).\nLoad each sample into the wells.\nLoad 2.5 μL of protein ladder to the bordering wells.\nRun gel(s) for 1.5–2 h using a voltage ∼125 V.\nNote: Cut off the power supply when the dye front reaches the very bottom of the gel. This may occur before or after 1.5–2 h.\nActivate the PVDF membrane\nSubmerge the membrane in 100% methanol while rocking at room temperature for 1 min.\nTransfer the membrane and submerge into 1× PBS while rocking at room temperature for 1 min.\nTransfer the membrane and submerge into 1× Transfer buffer and rock at room temperature for 10 min.\nNote: Try to flip the membrane over halfway through each of the solution incubations listed above.\nPrepare the transfer sandwich.\nCut out blotting filter paper to be slightly larger than the size of the membrane, and soak in 1× Transfer buffer.\nSoak sponges in 1× Transfer buffer.\nCarefully pry open the gel casing, remove the stacking portion and bottom of the gel (dye front). Place the gel in 1× Transfer buffer.\nOpen the transfer cassette, placing the black side in front of you. Do this on a surface that will keep liquid from spilling.\nTo the black side of the transfer cassette, place a soaked sponge, followed by a soaked piece of blotting filter paper.",
    "Carefully place the membrane on top of the filter paper, followed by the gel, with the low molecular weight markers facing out and the high molecular weight markers facing the clear side of the transfer cassette. Keep in mind the orientation of the gel, in terms of samples.\nCarefully place a soaked blotting filter paper on top of the gel, followed by a soaked sponge.\nGripping the left and right side of the sandwich, flip the sandwich so that the gel is now on the bottom with the membrane on top, and the low molecular weight marker is now facing the inside of the transfer cassette.\nAdd a small amount of 1× Transfer buffer on top of the sandwich and remove air bubbles by using a roller.\nCarefully close the transfer cassette and place it inside the transfer module, with the black portion of the transfer cassette facing the black portion of the module.\nSet up the Transfer.\nFill a large ice bucket with ice and place the buffer tank in the center.\nAdd the transfer module and frozen ice pack into the buffer tank.\nAdd 1× Transfer buffer into the buffer tank, until the transfer module is submerged.\nPlace the lid on the buffer tank and cover the buffer tank with additional ice.\nRun the transfer for 1 h using a voltage ∼55 V.\nRemove the transfer cassette, and carefully remove the membrane from the sandwich. Place the membrane into a western blot incubation box containing 5 mL 1× TBST, with the protein side of the membrane facing up.\nPrepare 10 mL primary blocking solution (1× TBST, 5% BSA w/v).\nNote: It is important to not use nonfat dry milk powder for detecting phosphorylated proteins. Milk contains phosphorylated proteins, such as casein which can produce increased background upon detection.",
    "Remove 1× TBST from the membrane and replace with 5 mL of primary blocking solution.\nIncubate membrane for 1 h, rocking at room temperature.\nPrepare primary antibody.\nDilute Anti-Caspase-3, 1:500 into 5 mL primary blocking solution.\nNote: Determination of the appropriate dilution ratio will need to be established when testing primary antibodies for the first time (see Troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 2[href=https://www.wicell.org#sec7.3] for details).\nRemove primary blocking solution from the membrane and replace with 5 mL of primary antibody.\nIncubate primary antibody for 16 h, rocking at 4°C.\nPause Point: continue with further incubation and washes the next day.\nAlternatives: Instead of incubating the primary antibody for 16 h at 4°C, 4 h at room temperature will suffice.\nRemove the primary antibody and replace with 5 mL of 1× TBST.\nPerform (4×) 20-min washes with 5 mL of 1× TBST, while rocking the membrane at room temperature.\nPrepare secondary antibody.\nDilute Anti-HRP, Goat-Anti-Rabbit, 1: 4,000 in 5 mL 1× TBST-SDS, 5% nonfat dry milk powder w/v).\nRemove 1× TBST and replace with secondary antibody.\nIncubate secondary antibody for 1 h, rocking at room temperature.\nRemove secondary antibody and replaced with 5 mL of 1× TBST.\nPerform (4×) 20-min washes with 5 mL of 1× TBST, while rocking the membrane at room temperature.\nRemove 1× TBST and replace with 5 mL of 1× PBS.\nPerform (2×) 5-min washes with 5 mL of 1× PBS, while rocking the membrane at room temperature.\nChemiluminescence detection.\nPlace sample tray for chemiluminescence detection on to the ChemiDoc imager.\nPlace a clear piece of plastic onto the chemiluminescence detection tray.\nCarefully place the membrane protein side up, on top of the clear plastic.\nUsing a paper towel, carefully remove remaining liquid.\nAdd 250 μL of HRP chemiluminescence substrate on top of the membrane.",
    "Carefully place another piece of plastic on top of the membrane, spreading the substrate to remove air bubbles.\nImage blot under chemiluminescence, using the Optimal Auto-exposure setting with higher resolution for detection of antibody bound protein.\nImage blot under colorimetric, using the Optimal Auto-exposure setting with higher resolution for detection of molecular weight marker.\nOn the ChemiDoc, merge the files together.\nNote: A plastic zip-lock bag with the all but one side removed works excellent for chemiluminescence detection.\nCarefully transfer the membrane back into the western blot incubation box.\nPerform (2×) 5-min washes with 5 mL of 1× PBS, while rocking the membrane at room temperature.\nRemove 1× PBS and replace with 5 mL of western blot stripping buffer.\nIncubate western blot stripping buffer for 15 min, while rocking the membrane at room temperature.\nRemove western blot stripping buffer and replace with 5 mL 1× PBS.\nPerform (4×) 5-min washes with 5 mL of 1× PBS, while rocking the membrane at room temperature.\nReplace 1× PBS with 5 mL of 1× TBST.\nRepeat steps 34–36.\nPrepare primary antibody.\nDilute Anti-Actin, 1: 3,000 into 5 mL primary blocking solution.\nRepeat steps 39–41.\nPrepare secondary antibody.\nDilute Anti-HRP, Goat-Anti-Mouse, 1: 10,000 in 5 mL 1× TBST-SDS, 5% nonfat dry milk powder w/v).\nRepeat steps 43–49.\nNote: Internal control band intensities should be relatively similar between all sample and not over saturated. If the band intensities greatly differ, this may indicate unequal protein loading. Over saturation of bands may lead to inaccurate quantification (see Troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 3[href=https://www.wicell.org#sec7.5] for details)."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Protein Biochemistry",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}