{
  "id": 11082,
  "origin_website": "Jove",
  "title": "Improved Method for the Preparation of a Human Cell-based, Contact Model of the Blood-Brain Barrier",
  "procedures": [
    "1. Cell Culture (3-7 Days Prior to BBB Assembly)\n1.1. Primary Human Brain Microvascular Endothelial Cells (BECs)\nBECs were commercially obtained. The cells were produced by dispase dissociation of normal human brain cortex tissue and provided frozen at passage 3 (<12 population doublings).\nSubstratum: Coat tissue-culture vessels with \"Attachment Factor\" as per the manufacturer instructions.\nCell maintenance: Maintain BECs in serum-containing complete medium. For experimentation, culture BECs in complete serum-free medium. Maintain the cells in a humidified 5% CO2, 21% O2 incubator at 37 °C\nNote: As an alternative to specialized reagents, 0.1% (w/v) gelatine solution can serve as a coating reagent while DMEM/F-12 supplemented with 15 mM HEPES, 10% (v/v) fetal calf serum (FCS), 2 mM L-glutamine, 50 µg/ml gentamycin, 20 µg/ml heparin and 20 µg/ml endothelial cells growth supplement can be used for BEC maintenance.\nSub-culturing for experimentation: Split confluent BECs at a ratio of 1:3 to 1:6, depending on the intended time for next use (3-7 days). Change the maintenance medium every 3 days. Use BECs up to 15 passages.\n1.2. SVG Human Fetal Astroglial Cell-line\nSVG human fetal astroglial cells22 were originally derived from primary cultures of human fetal brain transformed with replication-deficient simian virus 40.\nMaintenance: Culture SVG cells in minimum essential medium with Earle's balanced salt solution supplemented with 20% (v/v) FCS (same serum percentage used to maintain their parental primary cells 22), 2 mM L-glutamine, 50 U/ml penicillin and 50 µg/ml streptomycin. Maintain the cells in a humidified 5% CO2, 21% O2 incubator at 37 °C.",
    "Sub-culturing for experimentation: Split confluent SVGs at a ratio of 1:5 to 1:10, depending on the intended time for next use (3-7 days). Removal of trypsin is not required due to the high content of serum in the medium. Change the medium every 3 days. Use SVGs up to 20 passages.\n2. Assembly and Coculturing of the Human In vitro BBB Model (Day 0)\nComment: The human in vitro contact BBB model is prepared according to published protocols 13,23, with modifications.\n2.1. Coating of Inserts\nPlace tissue-culture inserts (6.5 mm in diameter with polyester porous membrane, 3 µm pore-size) in the wells of the supplied 24-well plate. Coat the luminal surface of the inserts overnight in a humidified 37 °C incubator with rat collagen I (20 µg/cm2; 50 µl of 132 µg/ml collagen I in 0.02% acetic acid in Milli-Q water (MQH2O)). Wash the inserts once (both from the abluminal and luminal side) with MQH2O to remove the residual acid.\nNote: Basement membrane of brain capillaries contains no collagen I but mainly laminins, collagen type IV isoforms, nidogens, and heparan sulfate proteoglycans9. For this reason, some researchers utilize coating agents such as collagen IV, fibronectin13, or Matrigel (BD biosciences)16 for a more authentic BBB modeling.\n2.2. Seeding SVGs on the Underside (Abluminal) Membrane Surface\nInvert the insert and gently fit around the rim of the porous membrane a short piece of elastic silicone tubing (\"external tubing\"; ~10 mm long, 8 mm internal diameter, 1.6 mm wall), creating essentially a new well above the abluminal surface (Figure 2A).",
    "The underside of the insert needs to be sealed to avoid media leakage. First, prepare a plug (Figure 2A and 2B) made of a silicone tubing (termed \"internal tubing\"; ~8 mm long, 3.2 mm internal diameter, 1.6 mm wall; Figure 2B), sealed at one end with a plastic sealing cone (~3mm long; prepared by cutting the bottom of a 0.2 ml polymerase chain reaction (PCR) tube; Figure 2B). This cone not only seals the internal tubing lumen, but also widens its edge for tighter fitting into the insert. Next, using a sterile forceps, insert the silicone plug into the luminal cavity and advance it until it reaches up-to ~1-2 mm from the membrane (Figure 2A).\nNext, seed 4 x 104 SVG cells in 200 µl SVG maintenance medium (section 1.2.2 above) directly into the silicone well above the abluminal membrane surface (Figure 2A). Allow SVGs to adhere for at least 4 hr in the incubator.\nNote: To maintain sterility transport the assembled inserts in between two 6-well plates (one plate inverted over the other; Figure 2C) to minimize exposure to unfiltered air during the procedure. Silicone tubes and plugs are washed in ethanol and autoclaved for later use.\nNote: Use plugs (section 2.2.2) only for inserts with membrane pore sizes larger than 1 µm. Membranes with pore diameter ≤1 µm rarely leak and require only the fitting of the external silicone tubing (section 2.2.1). In addition, some coating agents other than collagen I (see note to section 2.1) may prevent leakiness even through 3 µm pores. Determine this empirically.",
    "In order to monitor the adherence state of your astrocytes, seed in parallel into a standard 96-well an identical volume of the astrocyte cell-suspension. This well has the same surface area as the 6.5 mm insert (0.33 cm2) and permits easier visualization of cells by phase-contrast microscopy than the insert membrane. When you observe sufficient adherence of the astrocyte in the control 96-well, the astrocytes have adequately adhered also to the insert membrane.\nWhen astrocytes have sufficiently adhered in the control 96-well, transfer the insert assemblies to the tissue culture hood (see note above) and gently remove the external silicone tubing and plugs. Return inserts to the normal (i.e. upright) orientation into the supplied wells containing 800 µl/well of BEC maintenance medium (section 1.1.2 above).\n2.3. Seeding of BECs into the Luminal Chamber above the Astrocytes\nSeed 2x104 BECs in 200 μl onto the collagen-coated luminal surface and return the inserts into the incubator.\n2.4. Coculturing\nCoculture the SVG/BEC-seeded inserts for 3 days in BEC medium without media change before experimentation.\n3. Experimentation with the Human BBB Model (Day 3)\nTo stimulate the in vitro BBB first wash cells by replacing the abluminal and luminal media with 600 µl and 100 µl of serum-free BECs medium, respectively.\nAspirate the luminal medium again and replace with 100 µl of serum-free medium with stimulating agents.\nNote: If stimulation of the abluminal chamber is required (to activate the in vitro BBB from the astrocytic compartment), aspirate the abluminal medium and replace with 600 ul of serum free medium with stimulating agents.\nTest each experimental group in triplicate (hence, if luminal stimulation is performed, which requires 3 x 100 µl, we recommend diluting the reagents to their final concentrations in 350 µl of serum-free medium per group to minimize pipetting errors between wells).",
    "Perform standard paracellular and/or transcellular permeability assays of labeled tracers 16,24 (for the latter we use fluorescein isothiocyanate (FITC)-conjugated albumin) and/or measurement of TEER 13,16,25 as previously described.\nTo account for fluctuations in baseline permeability between experiments, analyze changes in permeability relative to a coated insert without cells (which serves as a reference for maximal permeability) and to the vehicle-treated group using the formula: permeability (% of max) = (permeability value of experimental insert - average permeability value of the vehicle group) / (permeability value of the blank insert - average permeability value of the vehicle group) X 100.\n4. Visualization of Cells on Porous Membranes\nComment: Unstained cells on insert membranes are difficult to observe by phase contrast or differential interference contrast (DIC) microscopy since the membrane is quite opaque and interferes with light transmission. To deal with this issue we developed various staining procedures of cells on inserts, which greatly enhance cell appearance on the membrane. Generally, stain the insert membranes while still attached to the insert, in the wells. The membranes should be removed only at the end of the staining procedure for mounting purposes.\n4.1. Hematoxylin Staining\nFix inserts with ice-cold 4% (w/v) paraformaldehyde (PFA) in phosphate-buffered saline (PBS; 130 mM NaCl, 10 mM Na2HPO4, 10 mM NaH2PO4, pH 7.2) for 20 min. Wash once in PBS.\nSubmerge the insert in 0.1% Mayer's hematoxylin solution for 2 min.",
    "Gently wash the insert with tap water (by submerging the insert in a beaker containing tap water and gently pipetting the excess water out). Transfer the insert to Scott's tap water solution (2 g/L NaHCO3, 20 g/L MgSO4) for ~20 sec until the desired blue color develops. Wash the insert again with tap water (section 4.1.3). An optional eosin stain can be introduced here by dipping the insert in 1% eosin solution for 10 sec followed by a tap water wash.\nAir-dry the insert membrane. Using a scalpel (cutting around the membrane edge) remove the membrane and mount it on a glass slide for bright-field imaging\nNote: If di-N-butylphthalateinxylene (DPX) mounting medium is utilized wash the insert with 100% ethanol followed by xylene before removing and mounting the membrane.\n4.2. Scanning Electron Microscope (SEM)\nFix inserts with ice-cold 4% (w/v) PFA in PBS for 20min. Wash three times in PBS.\nPost-fix the membranes for 30 min in 1% (w/v) osmium tetroxide in MQH2O.\nWash inserts in water (section 4.1.3) and dehydrate in an escalating ethanol gradient (50%, 70%, 90% for 5 min each, then 3x with 100% ethanol for 10 min per interval).\nTreat dehydrated inserts with a mixture of hexamethyldisilazane (HMDS):ethanol (1:2 then 2:1 for 5 min).\nTreat inserts with 100% HMDS for 5 min, air-dry and store under desiccated conditions.\nRemove the membrane using a scalpel (cutting around the membrane edge). Examine membranes by scanning electron microscopy.\n4.3. Immunofluorescence\nFix inserts with ice-cold 4% (w/v) PFA in PBS for 20 min, wash once in Tris-buffered saline (TBS; 50 mM Tris-HCl pH 7.6, 154 mM NaCl, 0.22 µm filtered ).\nPerform immunostaining of the cells on the insert membrane as previously described26.",
    "Remove the membrane using a scalpel (cutting around the membrane edge) and mount it on a glass slide with fluorescence mounting medium. Examine membrane by fluorescent microscopy.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}