{
  "id": 13159,
  "origin_website": "Jove",
  "title": "Three and Four-Dimensional Visualization and Analysis Approaches to Study Vertebrate Axial Elongation and Segmentation",
  "procedures": [
    "Experiments involving animals followed the Portuguese (Portaria 1005/92) and European (Directive 2010/63/EU) legislations concerning housing, husbandry, and welfare. The project was reviewed and approved by the Ethics Committee of 'Instituto Gulbenkian de Ciência' and by the Portuguese National Entity, 'Direcção Geral de Alimentação e Veterinária' (license reference: 014308).\n1. Sample preparation for 3D and 4D imaging\nNOTE: Here we provide a detailed description on how to dissect and prepare mouse E8.25 to E10.5 embryos for live imaging (1.1), E7.5 to E11.5 embryos for whole mount immunofluorescence microscopy (1.2) and fetuses for optical projection tomography (1.3).\nSample preparation for live imaging\n\t\nMouse embryo dissection and preparation for live imaging (e.g., LuVeLu reporter 23).\n\t\t\nDissect mouse embryos between E8.25 and E10.5 in pre-warmed M2 medium (37 °C). Gently remove the yolk sac using clean forceps and wash the embryo once with fresh M2 medium to remove blood and debris produced during dissection.\n\t\t\tNOTE: It is important to avoid damaging the embryo in any way, otherwise it will not develop properly during the live imaging procedure.\nDuring the live imaging procedure, incubate embryos in a heated chamber (37 °C), in a 65% O2 and 5% CO2 environment (N2 balanced), in low glucose DMEM medium supplemented with 10% HyClone defined fetal bovine serum, 2 mM L-glutamine and 1% penicillin-streptomycin.\n\t\t\tNOTE: These culture conditions allow embryonic development to occur for around 10 h. Other protocols9,10, using different culture conditions, might allow even longer periods.\nSample preparation for immunofluorescence microscopy\n\t\nMouse embryo dissection and fixation procedure\n\t\t\nDissect mouse embryos from E7.5 to E11.5 in either cold (4 °C) phosphate buffered saline (PBS) or M2 medium. After removal of all extra-embryonic membranes (e.g., Reichart's membrane or yolk sac) wash the embryo in fresh PBS to remove blood and debris produced during the dissection procedure.",
    "Fix embryos at 4 °C, in 4% paraformaldehyde (PFA) in PBS, for the time specified in Table 1.\n\t\t\tCAUTION - PFA should be handled inside a fume hood\n\t\t\ttable:\n﻿0,1\nDevelopmental stage,Recommended fixation time (PFA 4%)\nE7.5,1h30\nE8.5,2h\nE9.5,3h\nE10.5,4h\nE11.5,4h\nTable 1 - Fixation times for embryos at different developmental stages\nAfter fixation, wash embryos at least twice (5-10 min each) in PBS to remove PFA completely. At this point, embryos can be taken straight into the immunofluorescence staining protocol (Step 1.2.2) or can be dehydrated and stored for future use (Step 1.2.1.4).\nIf needed, store embryos at -20 °C in 100% methanol for long periods.\n\t\t\t\nTo improve tissue preservation, dehydrate the embryo gradually with 10% increases in methanol concentration (diluted in PBS), each step 10 min at room temperature (RT) on a shaker, until reaching 100% methanol. Replace the 100% methanol once using a fresh aliquot.\nRecover frozen embryos by rehydration following a reverse methanol/PBS series, each step 10 min at RT on a shaker, and with final washes in PBS (twice, 5-10 min each) before entering the immunostaining protocol.\n\t\t\t\tCAUTION - Methanol should be handled inside a fume hood.\nWhole-mount immunofluorescence staining\n\t\tNOTE: The following immunofluorescence staining protocol was adapted from the procedure described in Osorno et al.24. All washes should be performed on a shaker. After the blocking step, incubations are performed at 4 °C to ensure antibody integrity/preservation.\n\t\t\nWash embryos three times (30 min each) in PBS containing 0.1% Triton X-100 (0.1% PBST) and then once in 0.5% PBST for 1 hour (RT) to improve permeabilization.\nTo reduce nonspecific binding, wash in 1 M glycine in PBS (pH 7.5) for 30 min at RT.\nWash three times in 0.1% PBST for 30 min to completely remove the glycine.",
    "Incubate the embryos overnight at 4 °C in blocking solution containing: 3% of serum (from the animal species in which the secondary antibodies were produced), 1% of bovine serum albumin (BSA) and 0.1% of Triton X-100, in PBS.\nDilute primary antibodies in blocking solution (normally 1:200 for T and Sox2 antibodies) and incubate for two to three days at 4 °C.\nBefore adding the secondary antibodies, wash embryos three times (30 min each) in 0.1% PBST at 4 °C. Dilute secondary antibodies in blocking solution (1:1000) and incubate for 2 days at 4 °C, protected from light.\nWash embryos six times (30 min each) in 0.1% PBST at 4 °C.\nFor nuclear counterstaining, incubate embryos in 4',6-Diamidino-2-Phenylindole, Dihydrochloride (DAPI), diluted 1:500 in PBST, overnight on a shaker at 4 °C, protected from light.\nFinally, wash embryos three times (30 min each) in 0.1% PBST at 4 °C.\nTissue clearing and slide preparation\n\t\t\nTissue clearing using methyl salicylate or a mixture of benzyl alcohol with benzyl benzoate (BABB)\n\t\t\t\nBefore clearing using methyl salicylate or BABB, completely dehydrate embryos by bringing them to 100% methanol, through a methanol/PBS series consisting of successive 10% increases in methanol concentration (incubation times of 10 min each at 4 °C). To achieve complete dehydration, replace the 100% methanol for a fresh one and wait for additional 10 min.\nPerform embryo clearing by embedding in a series of methyl salicylate or BABB in methanol with 20% successive increases in concentration, 20 minute incubation for each step. When the methyl salicylate or BABB solution reaches 100% make two additional changes for a fresh solution.\n\t\t\t\tCAUTION: Both methyl salicylate and BABB should be handled inside a fume hood.",
    "​NOTE: For proper clearing, it is essential that embryos are fully dehydrated. It is also essential that the methanol is fully mixed with methyl salicylate or BABB in the clearing solution series.\nAfter the embryos become completely transparent, handle them individually, using preferentially a fluorescence stereoscope, to reduce the chances of tissue damage.\nFor imaging, mount embryos in either a 75 mm x 25 mm depression concave glass slide or a 20 mm x 60 mm #1.5 coverglass. The latter option will allow imaging from both sides, if necessary, but it is much more fragile and difficult to seal. Transfer embryos to the microscope slides using a toothpick, a fine cotton tip, a Pasteur pipette or any other similar instrument.\nTo avoid compressing the embryos, add spacers made from #1 coverglass shards (170 µm thick), silicone or thin metal washers. Then add a drop of mounting medium, cover with a #1 or #0 20x20 mm coverglass and seal.\nIf using glass or metal spacers, seal with melted paraffin to better stabilize the preparation - do not seal with nail-polish because it dissolves with methyl salicylate or BABB. To avoid bubbles, place the coverslip on one side and then, gradually and gently slide it sideways; add more medium if necessary.\n\t\t\t\tNOTE: Please see the video to better understand how to manipulate the cleared embryos and how to mount them on the microscope slide.\nTissue clearing with RapiClear\n\t\t\t\nWhen using RapiClear, embryo dehydration is not required. After Step 1.2.2.9, place embryos in the center of a 75 mm x 25 mm depression concave glass slide, remove all the PBST in the microscope depression slide and add 200 µL of clearing solution.",
    "After 10 min protected from light, when embryos start to become transparent, replace the clearing solution, wait additional 20 min (protected from light) and then top with a coverslip, starting from one side and gently moving towards the other.\n\t\t\t\tNOTE: The time to fully clear the embryo may go from a few minutes to overnight depending on the stage and size of embryos. Also, the entire process should be done under a stereomicroscope. To better understand the clearing and the microscope slide preparation, please see the video protocol.\nSample preparation for optical projection tomography\n\t​NOTE: The following procedures were adapted from previous protocols19,25,26. The protocol will be described for the analysis of E18.5 mouse fetuses.\n\t\nMouse fetus dissection and fixation procedure\n\t\t\nDissect E18.5 mouse fetuses in cold (4 °C) PBS, remove all extra-embryonic membranes and then wash the fetuses several times in fresh PBS to remove blood and debris produced during the dissection procedure.\nFix fetuses in 4% PFA made in PBS, at 4 °C for 5 to 7 days.\nWash fetuses once (15 min) in PBS and then three times (30 min each) in demineralized water or PBS. Perform the washes on a shaker.\nDehydrate the fetuses by incubation (25 min series at RT on a shaker) in methanol solutions of increasing concentrations (10% increases diluted in demineralized water or PBS) until 100% methanol.\nChange the 100% methanol solution (use a fresh aliquot) three times (20 min each) to ensure complete dehydration. Embryos can then be stored at -20 °C or be taken directly (one day later) to the bleaching process (Step 1.3.2).\nBleaching process",
    "To remove the natural pigmentation, incubate fetuses (separately) on a shaker, first for one day in 5% H202 in methanol and then in 10% H202 in methanol for up to 3 days until the embryos lose all the natural pigmentation.\n\t\t\t​CAUTION: H2O2 should be handled gently inside a fume hood. The bleaching solution containing H2O2 when in contact with the specimen creates vapors and, therefore, the tube containing the fetuses should remain open during the entire bleaching procedure. Some bleaching protocols suggest the combination of H2O2 with formamide. If this alternative is used, extra-care must be taken, as adding H2O2 to undiluted formamide can result in an explosion.\nGradually rehydrate the embryos in a reverse methanol series (with 10% decrease) in demineralized water, each incubated for 20 min at RT on a shaker, and finally wash three times (30 min each) in demineralized water. Wait one day, change the demineralized water and proceed further.\n\t\t\tNOTE: See Supplemental Figure 1 for a representative result of the bleaching process.\nDemineralization protocol\n\t\tNOTE: Demineralization is optional but recommended for fetuses or pups.\n\t\t\nPerform demineralization by washing the fetuses in 0.1 M EDTA at 42 °C for a few hours [see also Cho et al.27] followed by five washes (20 min each) with demineralized water to completely remove the EDTA. Perform all procedures on a shaker.\nSample preparation for clearing\n\t\t\nEmbed fetuses in a 1% agarose block. To prepare these blocks fill a 50 mL plastic tube or syringe (building a cylindrical space by cutting off the syringe's exit side and using the plunger to block the opposite side) with melted agarose, place the fetus in the agarose in a vertical position and keep this position at the center of the block with the aid of forceps during solidification of the agarose.",
    "Place the mold with the block at 4 °C (30 min) for the agarose to fully jellify. In case of incorrect positioning of the fetus within the block or the appearance of air bubbles, melt the agarose by placing the block at 50 °C overnight, and repeat the procedure on the next day.\nRemove the agarose block with the fetus from the mold and place it in a container with demineralized water. Replace with fresh demineralized water after 15 min.\nBefore clearing with BABB, dehydrate the specimen. To better preserve tissue integrity, perform fetus dehydration gradually with 10% increases in methanol concentration (diluted in demineralized water or PBS), each step for more than 45 min at RT on a shaker, until reaching 100% methanol.\nChange the 100% methanol (use a fresh aliquot), first four times in one hour intervals and then again on the following day to ensure complete dehydration.\nClearing process and sample mounting for OPT imaging\n\t\t\nClear the fetuses on a shaker through a series (2.5 hours each) of BABB solution in methanol, with 25% increases in BABB concentration, until reaching 100% BABB.\nReplace the BABB solution with a fresh one every day, until the fetus is completely transparent. This process might take 3 to 5 days. Keep the block containing the fetus, on a shaker during the entire procedure. Fetuses can stay in 100% BABB solution for long periods.\n\t\t\t​NOTE: If the fetus is not correctly dehydrated it will become slightly translucent (\"whitish\" emulsion) after first adding BABB. If this happens, step back into pure methanol and perform two additional washes in fresh methanol. Never refrigerate samples while performing dehydration and clearing, as the changes in temperature may lead to water condensation.",
    "Attach the cleared agarose block to the motor axis of the OPT scanner, adjust optics to obtain an image of the whole fetus and proceed to acquiring a full projection dataset19,28.\n2. Microscope/Image acquisition\nFor correct 3D and 4D imaging, choose the microscope that best fits the experimental goal. Table 2 provides general information to guide through the selection.\ntable:\n﻿0,1,2\nOptical microscopy techniques,Imaging principle,Experimental goal and considerations\nWidefield imaging,\"Uses fluorescence, reflected or transmitted light.\",\"Ideal for a quick and general overview of the embryo (e.g. for screenings and to assess developmental stages and obvious phenotypes). The reduced depth-of-field, compared to the observable thickness at high magnifications does not allow accurate interpretation or analysis of 3D morphology.\"\nConfocal (laser scanning; CLSM),Uses laser scanning illumination and detection of fluorescence through a pinhole.,\"Allows imaging of optical slices of fluorescently-labelled samples, ideally with a strong signal. Imaging through a pinhole removes the signal from out of the depth-of-field, thereby allowing accurate discrimination of information in 3D. The acquisition is orders of magnitude slower than widefield, but with unparalleled contrast and 3D discrimination of morphology. High temporal resolution is not achievable because images are acquired 1-pixel at a time. Good for 3D imaging of fixed mouse embryos up to E9.5. Imaging through the whole presomitic mesoderm or somites requires tissue-clearing, because of light-scattering in deeper tissues. Phototoxicity and bleaching is a consideration. Photobleaching can, within limits, be compensated a posteriori. However, phototoxic effects in live samples cannot, and often are not easy to determine. This is more obvious if samples show low expression, and high-laser powers are needed.\"",
    "Two-photon excitation fluorescence (TPEFM),It uses pulsed near-infrared (NIR) laser excitation instead of visible laser illumination.,\"TPEFM allows optical slicing through thicker samples than CLSM. Resolution is slightly lower, but the contrast in deeper tissues is considerably better, making it ideal for live imaging of mouse embryos. Although TPEFM is often considered less phototoxic than conventional CLSM, it requires high laser powers which may also have deleterious effects on cells and tissues. Ideal for 3D imaging of embryos up to E11.5, although imaging through the whole presomitic mesoderm still requires tissue-clearing.\"\nConfocal (spinning disk),\"A form of confocal which, instead of a single laser, uses multiple point-like sources.\",\"The use of multiple point-like structures allows faster creation of optical slices (several frames per second or stacks per minute are achievable) than CLSM. The acquisition is practically as fast as widefield, with reasonable 3D discrimination. However, it only allows imaging of the most superficial tissues of the mouse embryo. Allows more sensitive detection than CLSM, making it an alternative for embryos with low expression of fluorescence proteins.\"\nLight-sheet / single plane (LSFM/SPIM),\"Instead of widefield or point-like illumination, the sample is illuminated one orthogonal plane at a time. In most configurations, it allows imaging from multiple angles.\",\"Also requires fluorescently-labelled samples. Acquisition of optical slices acquisition is extremely fast (multiple frames per second) and has reduced effects of phototoxicity or bleaching. However, if multiview is required, subsequent dataset pre-processing steps may require hours/days of computation. LSFM/SPIM allows better detection of lower expression levels than CLSM. Ideal for 3D imaging of in toto mouse embryos during gastrulation. Samples often need to be mounted and maintained in suspension (unconventional preparation).\"",
    "Optical projection tomography (OPT),Optical slices are not detected but calculated from a series of widefield images of the whole embryo from different angles (the “projections”).,\"Ideal for 3D imaging of later stage mouse embryos/fetuses (>5mm), but only fixed and cleared. Has the advantage of producing 3D stacks of optical slices of both fluorescent and non-fluorescent samples. Datasets are isometric (slices with equal resolution in all three dimensions) making it ideal for anatomical analysis. Acquiring a projection dataset may require only a few minutes, followed by 15-30 min of reconstruction.\"\nOptical Coherence Tomography (OCT),Uses NIR illumination through the sample to obtain optical slices based on interference with light reflection.,\"OCT allows easy imaging through live tissue (a few millimeters deep into the sample without fluorescent contrast) with a few dozen micrometers resolution. The acquisition is very fast (a few slices per second). Although it is a possible alternative for OPT, this technique is not commonly available.\"\n\"Super-resolution (SR), atomic force (AFM) or near-field imaging (NSOM)\",SR is normally based on single-molecule localization and AFM/NSOM on scanning surfaces at sub-diffraction resolutions (few nanometers).,\"Allows imaging at sub-diffraction level (<200nm resolution), often with the intent to detect single molecules or molecules at the cell surface. Not ideal for morphological analysis of large samples such as mouse embryos. The acquisition is typically a slow process (seconds to minutes per image).\"\nTable 2 - Generic information to guide the selection of the imaging technique/microscope more suitable for the researcher's specific experimental goal.\n3. Image dataset pre-processing",
    "NOTE: Here we highlight some of the key steps of image dataset pre-processing, namely noise reduction (3.1) and deconvolution (3.2), and provide algorithms that allow proper preparation and pre-processing of 3D datasets time-series (3.3) and whole-mount immunofluorescence stainings (3.4). Finally, we indicate references that describe in detail a protocol for OPT dataset pre-processing and reconstruction.\nNoise reduction\n\t\nIf the images show reduced signal-to-noise ratio, consider applying a classical method such as a \"Median\" filter or \"Anisotropic diffusion\" available in Fiji/ImageJ29, or a more elaborate method based on Machine Learning such as \"CARE\"30 or \"Noise2Void\"31.\n\t\t​NOTE: This is especially relevant for live imaging datasets, where the photobleaching and photodamage is a major concern, and lower exposures and higher detector gains are necessary.\nDeconvolution\n\t\nIf the images were acquired with high-resolution (near or at Nyquist sampling) consider performing image restoration with deconvolution to enhance the quality of the dataset before analysis. Beware that some deconvolution tools also include a denoising step.\n\t\tNOTE: This has been extensively addressed in Krull et al.32 and in documentation available at the Huygens deconvolution software website (https://svi.nl/HomePage).\nPreparing a 3D dataset time-series for proper visualization and analysis\n\tNOTE: Often embryo or stage drift can occur during time-lapse imaging. This needs to be corrected before performing analysis. Sometimes, the drift is severe enough that the acquisition needs to be interrupted and adjustments made. In this case, it is best to keep the same X, Y and Z dimensions.",
    "Separate 4D stacks can be concatenated into a single 4D hyperstack using Fiji's \"concatenate\" function. However, this tool does not handle composite/hyperstacks, so it is necessary to convert all 4D segments into simple stacks using the operation Image | Hyperstacks | Hyperstack to stack. Keep some numbering system to maintain the order of these 4D segments and take note of the information about each one (channels, slices, time-points). Repeat the procedure for all segments and then concatenate them using the procedure Image | Stacks | Tools | Concatenate.\nReconstruct the concatenated hyperstack with the operation Image | Hyperstacks | Stack to Hyperstack and choose the correct order of the different dimensions. Inspect the Hyperstack to make sure all dimensions are correctly sequenced.\n\t\tNOTE: The number of Channels (c) and Slices (z) should be the same for all 4D segments; the number of (time) Frames (t) should be equal to the total of time points added for all 4D segments. It is important to browse through the stack to understand how the different dimensions are interpolated, before performing the conversion to hyperstack. Fiji/ImageJ default is alternating channels, then alternating Z slices, and then alternating time-points (\"XYCZT\"). Confirm that this applies to the data generated by the microscope.\nChoose Composite as the Display mode and save as Tagged Image File Format (TIFF). For large datasets, consider converting to BigDataViewer33 format, by performing the operation Plugins | BigDataViewer | Export Current Image as XML/HDF5. This generates a dataset that can be browsed more efficiently and in 3D using the BigDataViewer and can be handled by other Fiji/ImageJ tools for big-data datasets.",
    "Register the concatenated hyperstack (time-series of 3D stacks) to compensate for embryo/stage drift using either the \"Correct 3D Drift\" ImageJ plugin34 or the BigStitcher plugin35, depending on the degree of the drift correction needed. XML/HDF5 files can be opened with BigStitcher.\n\t\t​NOTE: It is necessary to perform the registration of 3D time-lapses that show embryo drift before any attempt to perform cell tracking or movement analysis; correcting for drift is also necessary to properly interpret morphogenetic movements.\nPre-processing of datasets of immunofluorescence imaging\n\t\nZ-depth signal attenuation\n\t\t​NOTE: Although the method we propose to correct signal attenuation can be useful, this should be used carefully, as often less signal in depth may actually reflect a biological and not an optical phenomenon. Consider measuring the decay in an area of tissue where the molecule of interest is not expected to be present or expressed and adjust the compensation for that area. If there is still a lower positive signal in depth, it may reveal an actual biological phenomenon. Consider also that some areas of the sample may produce more scattering or laser attenuation than others, and that it will not be fully corrected with this simple method.\n\t\t\nFor thicker/late-stage embryos, beam attenuation, photobleaching and spherical aberration caused by mismatch of refractive indices (between the mounting medium and the microscope objective) can result in datasets where the fluorescence intensity is greatly attenuated in the deeper slices of the Z-stack. Therefore, compensate for this loss of signal before analysis. Determining analytically the most accurate attenuation is complex and highly sample dependent36, but a quick approximation can be determined empirically in ImageJ/Fiji using the Process | Math | Macro function and clicking on Preview.",
    "Load the Z-stack in Fiji/ImageJ and then perform the procedure Image | Stacks | Reslice. Start at: top, keep Avoid interpolation ticked and OK. Now the \"Z\" will be the \"Y\" axis. Next, do Image | Lookup tables (LUT) | Fire (or any other multi-colored LUT). This will help to assess visually the best compensation during the next steps. Switch to a slice in the middle of the embryo, where the effects of attenuation in depth are clearly visible (the intensity drops from the top [superficial] to the bottom [deeper]).\nProceed to determining the correction of the vertical (\"y\") intensity drop with the procedure Process | Math | Macro, and add the following \"Code\" exactly as written here:\n\t\t\t​v = v * A * exp ( B * y/h )\n\t\t\tIn this expression, \"v\" is the variable for pixel intensity (which will be adjusted as a function on depth), \"y\" the variable for depth, and \"h\" for full depth, and \"exp\" is an exponential function; \"A\" should be replaced with a number between 0.5 and 1.0 (choose lower values to avoid oversaturation of the top layers of the Z-stack); B replaced with a number between 0.5 and 2.0, depending on how severe the Z-depth attenuation is - ideally it should be 1, however in some cases less (or more) is necessary to correctly compensate the bottom layers; a higher value of B will result in more attenuation compensation. Click on Preview to make a first assessment. Test different values of A and B until obtaining adequate compensation from top to bottom of the image (the \"Fire\" LUT can be helpful for this assessment). When satisfied, apply the settings by clicking OK.",
    "​NOTE: This must be performed in each channel individually, because red-shifted dyes and lasers may attenuate less, and some dyes bleach faster than others. Keep in mind that this procedure might not be accurate enough to allow reliable quantification of fluorescence intensity variations in depth, although it is certainly more reliable than performing quantifications directly in the original 3D dataset that is severely affected by attenuation of signal in depth. One way to identify and control for this effect, is to compare imaging different embryos from the dorsal or ventral sides.\nRestore the original geometry of the compensated Z-stack by doing Image | Stacks | Reslice, start at top, keep Avoid interpolation ticked, and now the \"Y\" must become the \"Z\" plane again; replace the color by performing \"Image | Lookup tables | Grays\" (or the other LUT of choice). Discard the original non-compensated z-stack and save the compensated version.\n\t\t\tNOTE: See Supplemental Figure 2 as a representative result of the Z-depth signal attenuation method.\nZ-axis scaling correction\n\t\t\nIf imaging with an objective designed for a refractive index different to that used for mounting the embryos, it is necessary to perform re-scaling of the slice thickness, otherwise measurements in depth will be incorrect (potentially by 50% if using a \"dry\" objective on a tissue-cleared embryo). This is explained, reviewed and the different methods discussed, in 37 and 38. Determining analytically the actual Z-axis distortion scale is complex, but an acceptable approximation can be easily determined by finding the ratio between the refractive index of the sample and the refractive index of the objective (e.g., 1.53/1.0 for a methyl salicylate-cleared embryo imaged with a dry 20 x objective, or 1.56/1.33 for an embryo cleared with BABB and imaged with a water immersion objective).",
    "With the Z-stack dataset already opened in Fiji/ImageJ (for multichannel images, after they were assembled as \"composite\" with all channels), go to Image | Properties and change the Voxel depth to the slice thickness obtained during image acquisition multiplied by the Z-axis scaling correction determined in the previous step (4.2.1; \"Image dataset pre-processing\" section). Confirm the result using the Image | Stacks | Orthogonal Views.\nRepositioning of embryo to an anatomically standard position using Fiji/ImageJ\n\t\tNOTE: Repositioning the embryo (see the advantages highlighted in Supplemental Figure 3) into a standardized anterior-posterior [A-P] and dorsal-ventral [D-V] axis position using Fiji/ImageJ, requires the installation of the TransformJ 39 suite of plugins from Fiji's \"ImageScience\" update website.\n\t\t​NOTE: This technique is preferable to rounds of rotations in the three planes which would introduce aliasing artifacts and degradation of resolution. However, because the Fiji/ImageJ 3D viewer plugin cannot handle properly datasets larger than 200-300 Mb (the plugin may not render or show unpredictable behavior when trying to rotate the viewing angle), the original 3D dataset must be down-sampled first.\n\t\t\nStart by reducing the dataset size in Fiji's Image | Scale and then insert the X, Y and Z \"scale\" values necessary to reduce the dataset to less than 200 Mb (for example a 0.5 x 0.5 x 0.5 down-sampling will result in a dataset 8 times smaller). Make sure the Create new window option is ticked.",
    "Then go to Plugins | 3D viewer. Inside the 3D viewer window, click over the embryo to select it, and a red 3D box should appear. When using this mode (with the red box activated), the rotation of the dataset can be controlled with the mouse, in contrast to the default behavior, which is to rotate the viewing angle. When repositioning the embryo with the mouse, never click outside or the dataset will be deselected.\nWhen satisfied with the new position of the embryo, select Edit | Transformation | Export transformed image in the menu of the \"3D viewer\" window. To inspect the different orthogonal planes go to Image | Stacks | Orthogonal Views. If the embryo is not correctly positioned, close the window and go back to the 3D viewer window and re-adjust. Repeat step 4.3.2.\nWhen the embryo is correctly positioned, select from the \"3D viewer\" window menu Edit | Transformation | Save transform and save the transformation matrix to a text file with the *.mat extension. Open this text file using Fiji/ImageJ, remove the first two lines (text) and re-save. This creates a transformation matrix file compatible with the \"TransformJ\" plugin described in 39.\nSwitch to the full-resolution dataset (can be a multi-channel composite hyperstack) and perform the operation Plugins | TransformJ | TransformJ affine. In the new window, browse to search for the matrix file previously saved, select the Cubic B-Spline interpolation | resample isotropically | OK.",
    "​NOTE: This operation is memory and CPU intensive. Depending on the workstation and dataset size, the operation may take from minutes to hours. The use of the resample isotropically option guarantees that no resolution is lost during the transformation operation, so the dataset will increase in size significantly and will no longer be anisotropic like the original confocal z-stack; it is to be expected that the number of slices in the Z-axis increases to the same number of X and Y pixels of each slice, and the stack bloated to 5-10x the original size. This is necessary to guarantee that no information is lost in the course of interpolation of voxels during rotation and translation.\nOnce the embryo is properly repositioned it is often possible to trim most of the empty space created around the embryo. Perform a full Z-projection Image | Stacks | Z Project… and choose Maximum intensity; draw the minimum ROI that contains the whole embryo in X and Y. Switch to the original dataset image windows, go to Edit | Selection | Restore selection, and crop by selecting Image | crop.\nTrim the slices in the beginning and end that do not intersect embryo tissues. For this, select Image | Stacks | Tools | Slice remover and specify the first and last slice to remove, making sure to change the \"increment\" to 1 (otherwise it removes only every other slice).\nAfter repositioning and trimming the new dataset make sure to save as a new TIFF file. If this dataset is too large (more than the GPU RAM) consider using BigDataViewer to export as XML/DHF5, as explained in step 3.3 (from the \"Image dataset pre-processing\" section).\nOPT dataset pre-processing and reconstruction",
    "Use the protocol for OPT dataset pre-processing and reconstruction described in Martins et al.19 and Gualda et al.28.\n4. 3D rendering, visualization and analysis\nNOTE: Here we provide a list of possible applications of different software tools, that allow or enhance the visualization and analysis of 3D imaging datasets.\n3D rendering and visualization using Drishti\n\tNOTE: Drishti40 is a free scientific visualization software designed to explore and present 3D and 4D datasets from micro-CT, confocal/multiphoton and light-sheet microscopy. Here we use this software for 3D rendering and visualization of whole-mount immunofluorescence staining (Step 2; \"Sample preparation for 3D imaging\" section). There are multiple tutorials online to help users understand how to operate Drishti; search online for \"Ajay Limaye Drishti 3D tutorials\". Drishti cannot directly read stacks of TIFF files, so they must be converted first to the native \"pvl.nc\" format.\n\t\nRun the \"drishtiimport.exe\" tool, located in the Drishti installation folder: Files | Load | Files | choose \"Grayscale TIFF image files, and load a single-channel 3D stack, as saved from Fiji/ImageJ. In the case of a multi-channel composite stack, split the channels in Fiji/ImageJ and save each individually. Voxel type is \"ushort\"; \"File\"...\"Save as\"...\"TIF\", reply \"y\" to all questions. In the Additional information window asking for voxel size make sure to add the correct \"X Y Z\" voxel sizes.\nLoading *.pvl.nc files into Drishti and rendering: In the main window of Drishti, File | Load | Load 1 ( - 4 ) volumes depending on the number of channels available (as separate files). After loading, press F2 for high-quality render. This action requires a powerful GPU card. Information to handle the rendering parameters, Transfer function editor, search on the online tutorials. Once satisfied with the rendering properties proceed to generating an animated rendering.",
    "Go to View and activate the Keyframe editor. Handle the embryo and position it in the desired starting position. Use the right-mouse button to \"drag\" the embryo to the center if necessary, or the mouse scroll to zoom. Hit set keyframe in Keyframe editor, then choose another position, angle or zoom, drag the time-line marker to a different time point and Set keyframe again. Now there are 2 keyframes where the embryo is represented in 2 different positions/angles/zoom, and a number of frames in between. Pressing the Play button, Drishti can interpolate the missing conditions and play it as an animation. Go to File | Save image sequence to save the animated sequence of all frames. This frame sequence can later be opened in Fiji/ImageJ and saved as AVI (File | Import | Image sequence ... File | Save As | JPEG compression with a reasonable frame rate (we suggest 15 - 30).\n\t\tNOTE: Although Drishti allows the saving of *.wmv videos, it is advisable to instead save as separate frames and only later convert the series to AVI or MOV video format (this can be done using Fiji/ImageJ).\n3D reconstitutions and manual segmentation of tissues using Amira\n\tNOTE: This commercial software allows, manual or automatically/semi-automatically, 3D segmentation of embryonic tissues in 3D datasets. There is an online \"Learning Center\" for this software with multiple tutorials available 41. Below are described the basic steps required to manually segment embryonic tissues from immunofluorescence-stained embryos (step 1.2). Manual segmentation is much easier after the embryo is correctly positioned in a standard A-P/D-V axis (see the\" Image dataset preprocessing\" section, step 4.3).\n\t\nLoad a 3D TIFF dataset. Make sure to specify the correct voxel dimensions, when asked. Create and connect a visualization module (e.g, \"Orthoslice\" or \"Volren\") and inspect the dataset in 3D.",
    "Connect the Label field (or Edit New Label Field in newer versions of Amira). In this software, results of manual segmentation are stored in \"materials\", so create one material for each tissue of interest. Use the \"lasso\" tool for manual segmentation. There are several tutorials available explaining how to perform this (search online for \"Amira Segmentation Editor tutorial\").\nWhen finished with segmentation of all tissues of interest, exit the Segmentation Editor by switching back to Project mode. Having created a new version of the dataset (the \"labels field\", which is now attached to the original dataset module) in which pixels belonging to each material have the same value.\nConvert these \"materials\" into 3D objects by generating 3D surface models from the \"Labels\" dataset. This can be done by attaching a \"Generate Surface\" module, adjusting parameters as necessary (activate the \"compactify\", \"border\", \"Adjust coords\" and \"Unconstrained Smoothing\" options). Click Apply and a new module *.surf is generated.\nVisualizing the surface objects, extracting and exporting individually as *obj files. Attach a Display | SurfaceView module to the *.surf module, and inspect in the main viewer. In the \"properties\" panel of the \"SurfaceView\" module, in the \"Materials\" property select All + All and click remove, so the viewer's buffer is emptied. Then in the second pull down of the Materials property select only one material and click Add to the buffer; only that material should be visible.\nIn the property Draw style click in more options | create surface and a new *.surf module is created and added to the project. Rename it to the name of the tissue (press F2 on the keyboard), and File | Export Data As... and Save as type: Wavefront (*.obj). Repeat the operation for each material.",
    "NOTE: These *.obj files, each containing one of the tissues segmented in Amira, can be used by other tools (\"3Dviewer\" plugin from Fiji/ImageJ and SimLab).\nInteractive 3D visualization within in a portable document format (PDF) using SimLab Composer\n\tNOTE: This 3D Computer Graphics software facilitates the creation of surface rendered images, animations and simulations. Useful tutorials can be found on line 42. Here we describe how this software enables the creation of 3D PDF interactive illustrations, using the wavefront (*.obj) 3D surface files created with Amira (Step 2.3; \"3D rendering, visualization and analysis\" section).\n\t\nGo to File | New and create an empty scene. Then File | import and import the 1st *.obj file saved from Amira. Keep all options of the Import file window unticked and click OK.\nIf nothing appears in the Composer's display window, click Ctrl+F or the icon to Fit all. Now the segmented object should appear in the center of the window. Repeat the process to add another segmented object and confirm its position relative to the 1st one (for example, 2 adjacent somites).\nSelect one of the objects in the display window by clicking with the left mouse button, change its name to reflect the name of the anatomical structure or tissue, then switch to the \"3DGeom~1\" representation, and using the Materials panel, change the color by altering the R,G,B values.\nRepeat for all objects, until the 3D illustration is fully assembled. Note that some materials can also be made transparent by manipulating the \"Alpha\" channel, next to the RGB values, and thereby allow observation of internal or occluded objects.",
    "With this software the assembled embryo illustration can be exported as a \"3D PDF\" file, which can be included in publications. First create a \"template\" with text and active links to change \"Scene states\" to be able to include instructions and three different stages in the same illustration. This can be done by switching from \"Scene building\" to \"Sharing\" mode (buttons on the left of the Composer window), then clicking in Show PDF settings, and creating a new page template. To create a simple interactive figure to include in a manuscript, do not use a template and simply Export PDF.\n\t\tNOTE: Use Adobe Acrobat Reader software to interact with the 3D PDFs (operability of the functions in the interactive 3D PDF illustration may vary depending on versions of Acrobat Reader available). Most other viewers are not compatible with the 3D PDF format, including web browsers. Such 3D PDF interactive illustrations can be included in publications; ask editors about this possibility in advance.\n3D visualization and analysis using Imaris\n\tNOTE: This software allows comprehensive imaging visualization, analysis and interpretation of 2D-4D microscopy datasets, with intuitive interface and workflows. There are several useful tutorials online on how to get started with this software, available at the website (https://imaris.oxinst.com/tutorials). To load and interact more effectively with large datasets in Imaris (typically, those larger than the GPU memory) it is advisable to convert the dataset first to “*.ims”, using the “ImarisFileConverter.exe” program installed in the Imaris installation folder. The ImarisFileConverter can read many microscopy image formats, including OME and “h5” files as saved by Fiji’s BigDataViewer.\n\t\n3D visualization",
    "This software can render a 3D visualization of the dataset using the \"3D View\" mode and the user is able to make several adjustments to how the dataset is displayed [e.g., choose between MIP (Maximum intensity Projection) or blend mode (better rendering with depth cues and shadows)].\nOrthogonal views\" mode - With proper embryo positioning (Step 4.3; \"Image dataset pre-processing\" section) one can use the \"Section\" tab and navigate through the entire embryo and see optical sections from the normal planes (transverse, coronal and sagittal). If embryos are not properly repositioned, interpreting their anatomy with orthogonal planes is extremely difficult (see Supplemental Figure 3). Although Imaris has a function known as \"reference frame\" to work around this problem when analyzing 3D embryos, it is preferable to reposition the datasets a priori.\n3D analysis\n\t\t​NOTE: This software also has several tools for analyzing morphology and fluorescence intensities. As an example, here we describe a simple workflow to analyse tissue fluorescence intensity variations over time using the Imaris \"Spots\" tool, where the user manually places spherical regions of interest (ROIs) in the embryo in 3D, and Imaris can then measure the tissue fluorescence inside these spherical ROIs.\n\t\t\nLoad a 3D or 4D dataset in Imaris and add new spot in the 3D view mode. Then, one can select specific points of the embryo (also during several time points if one uses a 4D dataset) and quantify inside those spots, for example, the intensity mean.\n\t\t\tNOTE: This software also allows plotting the intensity over time. This allows the user to easily answer questions like: \"how does the fluorescence change inside a somite over time?\".",
    "Add the spot module by clicking on the Add new spot button or selecting 3D view | Spots in Imaris menu. Choose Skip automatic reaction, edit manually. Switch the Imaris pointer mode from Navigate to Select (this can also be done by hitting the ESC key on the keyboard).\nOn the Spots properties window, select the Specific channel to which the spot will be attached (e.g., \"Channel 1\"), and activate in Manual tracking the Auto-connect to selected spot and the Enable delay before auto-advancing options.\nMove the mouse cursor to the visualization window and the cursor should change to a hollow yellow wire sphere. Go to time-point 1 and add a spot (=sphere) by clicking in the tissue of interest. The sphere (\"Spot\") is only added if clicking while holding the shift key. Repeat for all the desired time points making sure to track the same portion of tissue over time.\nIn the Spots Properties window, switch to the Statistics tab, and inside the Statistics switch from Overall to Detailed statistics. From the first pulldown choose Specific values, and from the second pulldown choose \"Intensity mean Ch=*...\", where Ch* is the channel in which the measurement will be performed. A button right to the \"Click to open time-plot panel\" will be found in the bottom left of the spots properties window. Clicking this button opens up a plot with the median fluorescence intensity inside the \"spots\", plotted over time. These values can also be exported to a spreadsheet for further analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}