{
  "id": 3585,
  "origin_website": "Cell",
  "title": "Protocol to visualize ion channel trafficking in acutely isolated rodent neurons using live-cell immunocytochemistry",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nApplying experimental treatment and primary antibody\nTiming: 30–150 min (variable with desired outcome)\nThis protocol requires an antibody directed against an extracellular epitope of the protein of interest. Our protocol was performed on live cells at 21–23  °C   and it was therefore necessary to ensure that all solutions used prior to fixation (e.g., treatment solution, blocking solution, washing solution, primary antibody solution) are at 100% oxygenation. This protocol could, however, be modified for use with cells at elevated temperatures, with constant perfusion, and/or in an incubator.\nApply oxygenated treatment solution.\nNote: In our experiments we used isotonic, hypertonic, and either isotonic or hypertonic with an inhibitor.\nCarefully apply 2 mL of solution to each dish.\nLet sit for 30 min at   21 °C  − 23  °C  .\nRepeat the treatment application every 30 min with freshly oxygenated solution.\nNote: If the treatment time is longer than 30 min prior to blocking, remember that the blocking and primary antibody solutions will also contribute to the treatment time.\nCritical: Observe caution when pipetting solutions into and out of the dish prior to fixation as the number of viable cells will decrease with each wash.\nCarefully remove the treatment solution from the outside of each dish.\nPipette 200   μ  L of treatment solution out of each well.\nSlowly pipette in 200 μL of the appropriate oxygenated blocking solution to each well.\nLet sit for 30 min at   21 °C  − 23  °C  .",
    "Critical: When pipetting in and out of the well, begin pipetting the new solution in prior to completing the removal of the old solution to prevent the well from drying out. It is also important to pipette slowly (each plate should take around 20 s to exchange solutions in the well). Each plate should be completed individually for steps that involve pipetting into and out of the well. Make sure that the cells loosely attached to the bottom of the well do not become dislodged by a high flow rate from the pipette tip and that the well always has some small volume of liquid in it to avoid cell lysis.\nPipette out 200 μL of blocking solution from each well.\nPipette in 200 μL of the appropriate oxygenated primary antibody solution into each well.\nLet sit for 30 min at 2  1 °C  − 23  °C  .\nNote: This step is where we changed the recovery solution from hypertonic to isotonic to begin the 30-min recovery period while simultaneously applying the primary antibody.\nWashing and fixation\nTiming: 30 min\nThis step washes extra primary antibody from the cells and fixes them in place for permeabilization and application of the secondary antibody.\nCarefully add 2 mL of the appropriate oxygenated 1× PBS to each dish.\nRemove and repeat a second time.\nOptional: Though it is standard procedure to wash away primary antibody with 1× PBS 3 times,4[href=https://www.wicell.org#bib4] we observed no noticeable change in immunofluorescence after 2 washes. We also noticed that the cell number was reduced after 3 washes compared with 2.\nRemove the 1× PBS from the outside of each dish being mindful not to disturb the well.\nPipette in 2 mL of cold (4  °C  ) 4% PFA to each well.",
    "Let sit for 20 min at 2  1 °C  − 23  °C  5[href=https://www.wicell.org#bib5].\nCritical: 4% PFA is a dangerous material and appropriate PPE should be worn when handling and disposing it. Please read the Material Safety Data Sheet (MSDS) for 4% PFA for further information on handling, storage, and disposal.\nPermeabilization and secondary antibody\nTiming: 75 min\nThis step utilizes the detergent Triton X-100 to permeabilize the now-fixed cells and administers the secondary antibody.5[href=https://www.wicell.org#bib5],6[href=https://www.wicell.org#bib6]\nCritical: This step and onward should be conducted with minimal light as the secondary antibody is photosensitive.\nRemove the 4% PFA from the outside of each dish.\nPipette in 2 mL of PBST.\nRemove and repeat a second time.\nRemove the PBST from the outside of each dish.\nCarefully remove 200 μL of PBST from each well\nPipette in 200 μL of secondary antibody solution.\nLet sit for 60 min at 2  1 °C  − 23  °C  .\nFinal wash and imaging prep\nTiming: 10 min\nThis step washes the excess secondary antibody from the cells and administers an antifade solution to prevent early photobleaching when imaging and to preserve the cell quality.\nRemove the 4% PFA from the outside of each dish.\nPipette in 2 mL of PBST.\nRemove and repeat a second time.\nRemove the PBST from the outside of each dish.\nWash with 2 mL of 1× PBS.\nRemove and repeat a second time.\nRemove the 1× PBS from the outside of each dish.\nCarefully remove 200 μL from each well.\nApply 2–3 drops of antifade solution (we used Citifluor AF-1).7[href=https://www.wicell.org#bib7]\nOptional: You may choose a different antifade solution or to coverslip the well of the dish and seal with nail polish.7[href=https://www.wicell.org#bib7]\nCover the plates with the dish lids and store at 4   °C   in an opaque container until ready to image."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Isolation",
    "Neuroscience",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}