{
  "id": 9321,
  "origin_website": "Jove",
  "title": "Testing Drosophila Olfaction with a Y-maze Assay",
  "procedures": [
    "1. Before Starting\nUse an isogenized reference stock bearing stable and robust behavioral phenotypes. There is no general rule for choosing this stock, since all potential controls may carry heterogeneous background alleles.\nUse this control strain to backcross every other stock necessary for later steps. This backcrossing step is typically represented by at least 5 successive crosses of a single virgin female (to allow possible crossing-over between homologous chromosomes) to 2–3 isogenic reference males5. This step is important to homogenize the genetic background between the different fly stocks.\nMaintain Drosophila stocks on a standard corn flour (9%), yeast (10%), and agar medium (1.5%) complemented with antibiotic (0.4% methyl para-hydroxy-benzoate) in a 12-hr light/dark cycle at 25 °C.\nAchieve chemosensory experiments in a temperature-controlled room (25 °C) under far red light (to eliminate the contribution of visual cues, and to focus on chemosensory signals). Regularly renew the air of the room to ventilate the area between each experiment.\n2. Olfactory Response using a Y-maze Assay\nStarve the flies for 16–18 hr at 25 °C in glass tubes containing wet paper towel before testing.\nJoin a Y-shape connector to two glass vials and to a smaller plastic vial (loading vial). Use 1 ml pipette tips that pass through the foam stoppers to link the connector to the three vials, and to obtain a tightly sealed Y-maze. Cut the narrow ends of two pipette tips (~2 mm diameter, to avoid any return of the fly once it has made its decision) to form two “trap” vials, and a large end of one pipette tip to form the “loading” tube (Figure 1A).",
    "Just before connecting the “trap” vials (Figure 1B), place one ~6 mm diameter filter paper in each vial. Add 40 μl of odorant solution on one filter paper, and 40 μl of the corresponding solvent on the second filter paper.\nIntroduce ten 4 to 9 day-old flies into the “loading” vial. Do not use CO2 anesthesia during this transfer, since it has a strong effect on behavior10. Rather use brief cooling on ice. Proper manipulation of anaesthetized flies is important to limit stress on the subjects as much as possible.\n\t\nPerform a series of Y-maze tests at 25 °C under far-red light (using LED bulbs to limit possible heating source) to avoid visual stimuli as much as possible. Be careful to alternate the orientations of the Y-mazes (odorant containing tube on the left, or on the right, and loading tube in front or in the back; Figure 1C).\nAllow several hours for the flies to enter in the trap vial containing the odorant or the solvent. Count flies after 24 hr to increase the participation up to more than 80% and provide the maximum olfactory index value (Simonnet, personal communication).\nCalculate the resulting olfactory index using the following formula: (number in the odor tube - number in the solvent tube)/total number of loaded flies.\nWash Y-maze set-up as follows: soak the dismantled set-up in RBS 35 MD overnight. Thoroughly rinse out with tap water. Finally rinse with deionized water and let dry out.\n3. Statistical Analysis of the Data\nPerform a t-test, a one-way ANOVA or a two-way ANOVA depending on data and variables.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}