{
  "id": 7128,
  "origin_website": "Bio",
  "title": "Extraction and Quantification of Sphingolipids from Hemiptera Insects by Ultra-Performance Liquid Chromatography Coupled to Tandem Mass Spectrometry",
  "procedures": [
    "Insect samples collectionThe laboratory strain of N. lugens (brown planthopper) used in this study originated from a field population in the Huajiachi campus of Zhejiang University, Hangzhou, China. The BPHs (brown planthopper) were reared on susceptible rice seedlings cv.Taichung Native 1 (TN1) at 27 ± 1 °C, 70% relative humidity and a 16:8 h light:dark photoperiod.About 2 g fresh weight of insects was determined and collected at different development stages (e.g., eggs, first-fifth instar nymphs, female and male adults) in labeled 2 ml tissue grinding tubes. Samples were then stored at -80 °C after quickly freezing in liquid nitrogen. The sample was set for three biological repeats.Total sphingolipids extraction (Figure 1)Sphingolipids were extracted from insects according to Bielawski’s method (Bielawski et al., 2010). Details were prepared as follows:Note: All following steps were performed at room temperature if not stated otherwise. The samples were taken out from the -80 °C freezer and dissolved the melted samples in 1 ml solvent extraction solution A (see Recipe 1), to which 10 μl Internal standard had been added (see Recipe 5).Samples were next grounded twice in tissue homogenizer with grinding beads, each time for 20 s.Note: In the case of plant material, clean and pre-cooled mortars and pestles were used to grind the samples in liquid nitrogen, and the powder was then transferred to a 15 ml glass tube. The sample was homogenized into a fine powder and that powder was kept frozen at every homogenization step. The purpose of the griding bead is to facilitate insect tissue grinding, so it is okay just to cover the bottom layer for the amount of griding beads per mass of sample and total volume. Powdered tissue was vortexed vigorously for 5 min and centrifuged for 5 min at 1,000 × g.",
    "After centrifugation, the solvent from the upper lipid-containing phase was transferred to a 15 ml sterilized glass bottle.Note: The vial label was protected with a clear tape to avoid being wiped off by the solution. The extraction was repeated by adding 1 ml solvent extraction solution A (see Recipe 1) to the remaining aqueous phase, and the organic layers were combined and concentrated under a stream of nitrogen gas.The dried lipid fractions were re-suspended into 500 μl solvent extraction solution B (see Recipe 2), and immediately sufficient liquid was transferred to glass vials and caped tightly.The solvent was transferred into a labeled 1.5 ml microcentrifuge tube, centrifuge the samples at 12,000 × g for 5 min at room temperature.Note: The tube was caped tightly to avoid leakage of liquid during centrifugation. The reconstitution solution was finally transferred to a mass spectrometer flask with an internal cannula and stored at -20 °C for machine test.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3923/bioprotoc-11-04-3923-g001.jpgFigure 1. Workflow of sphingolipids extraction from Insect sample Sphingolipids detection and identificationSphingolipids were analysed on an AB Seriex 5600+quadrupole Time-of-Flight (Q-TOF) Premier mass spectrometer combined with a Water Acquity Ultra Performance liquid chromatography.HPLC-programSolvent A (see Recipe 3)Solvent B (see Recipe 4)Constant flow at a rate of 0.3 ml/min stated by solvent A was running in a Waters UPLC (Waters Corp, Milford, MA, USA) coupled with an AB Triple TOF 5600 plus System (AB SCIEX, Framingham, MA, USA).The changes in gradient were comprised of an increase in solvent B (methanol) from 80 to 99% over 20 min and then from 99 to 100% over 15 min, followed by a reduction back to 80% over 1 min. The percentage of solvent B was then held at 80% for the last 9 min.The reversed-phase analytical column (Zorbax sb-C8, 2.1 × 150 mm, 3.",
    "5 μm; Agilent, Palo Alto, CA, USA) was used to separate ceramides.10 μl of the samples were applied to the column.The column was kept at 35 °C during the whole procedure.The mass spectrum was acquired with an electrospray ionization (ESI) ion source in the positive ionization mode and following settings (Table 2).Table 2. The instrument settings for sphingolipids analysis imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218181918_5507.jpgSphingolipids profiling parameters for detectionThe C18 column was used as the separation column on the Aligent 6460+ triple four-pole liquid mass spectrometer to explore the optimal detection conditions of each standard sample. The profiling parameters include precursor ion/targeted ion, retention time, fragmentor, and collision energy. Cer (d18:0/12:0) was used as the internal standard. The scanning parameters for each lipid class were listed in Table 3.Table 3. Scanning parameters for sphingolipids detection imgsrc:https://en-cdn.bio-protocol.org/attached/image/20210218/20210218181938_3522.jpgMethod optimization notes: For samples containing large amounts of low volatility compounds, the HPLC-program can be made more stringent by increasing the rate flow and by increasing the sampling time. HPLC-program can be adjusted as appropriate for specific analytes and columns by altering holding times. For a few analytes which degrade at high temperatures, it may be desirable to reduce Ion source heater temperatures to 550-580 °C. The timed MS parameters may be used to reduce or eliminate signal from very abundant peaks or contaminants. Those sphingolipids that have different chain lengths, branching, or unsaturation will fragment to yield ions of different m/z. Thus, different precursor ion scans would be necessary to determine the corresponding molecular species. Furthermore, the scan range and collision energy will vary depending on the size and substitution of the various subspecies. All such method adjustments should only be undertaken with the assistance of an experienced MS user."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}