{
  "id": 6806,
  "origin_website": "Bio",
  "title": "Real-time Fluorescence Measurement of Enterovirus Uncoating",
  "procedures": [
    "Sample preparationPlace the 96-well plate on ice to cool down.Note: You can use a metal plate on top of ice to make the surface even and the plate easy to handle. Cool down the solution(s) of interest on ice.Make 1:10 dilution from the 10,000x SYBR Green II stock solution. You can use ddH2O or the solution of interest to make the dilution. If the solution of interest is very exactly defined, then preferably use it for the dilution to keep the conditions unchanged (as ddH2O will change/dilute the solution). Avoid exposing the SYBR Green II to bright light.Pipette 450 µl of the solution of interest into two 1.5 ml tubes. You can have many different solutions of interest in one 96-well plate measurement. i.e., many pairs of 1.5 ml tubes. Up to seven different solutions of interest can be applied into one 96-well plate (see Figure 1 for example).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200327/20200327230513_2211.jpgFigure 1. Example of 96-well plate with 7 different solutions of interest (highlighted with different colors) and three replicates of virus with a background control without virus, all measured with and without RNase. Rows A and H, and columns 1 and 12 are left empty.Add 4.5 µl of the previously diluted SYBR Green II into both 1.5 ml tubes.Add 4.5 µl of the RNase A into one of the 1.5 ml tube in a final concentration of 10 µg/ml. Preferably use high concentrated stock to negate the buffer effect to the solution of interest. We use pre-diluted 1 mg/ml RNase stock in 150 mM NaCl, i.e., 1 µl of RNase in 100 µl of solution of interest. Add 4.5 µl of 150 mM NaCl solution without RNase A into the other tube to keep the ion concentrations identical.Mix the 1.",
    "5 ml tubes well and pipette 100 µl into four adjacent wells of the 96-well plate. Keep the plate on ice. Do not use rows A and H and columns 1 and 12 since the proximity of the plate edge might affect the measurement. See Figure 1 for an example. Avoid bubbles. Easiest way to avoid them is to use reverse pipetting for mixing and placing the liquid into the wells. In reverse pipetting, press the pipette cylinder all the way down before taking the adjusted volume inside the tip, resulting in extra volume inside the tip when mixing the solution. Then the volume only up to the first step is pipetted out in the well before sucking in the next volume etc. (For further details, see for example Good Laboratory Pipetting Guide https://assets.thermofisher.com/TFS-Assets/LSG/brochures/D16542.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/brochures/D16542.pdf].)Add 1 µg of virus into each of the three first wells of a solution and leave the fourth well without the virus to measure the background fluorescence of the solution. Somewhat lower virus amount, at least down to 0.5 µg, may also be applicable. However, if the solution of interest contains molecules that cause background fluorescence (such as BSA in our case) the signal-to-noise ratio might be low and the results less reliable. Also, preferably use a concentrated virus stock so that adding of the virus in a buffer will not change the chemical concentrations too much. On the other hand, too concentrated stock may add to the pipetting error. Optimal virus stock concentration would be around 1 µg/µl, i.e., 1 µl of the virus stock would be added per well.Mix the wells. Avoid bubbles. Easiest way is to use 8-channel multipipette and reverse pipetting.Keep the plate on ice, cover with aluminium folio and transfer to the fluorescence plate reader.",
    "Sample preparation in short:Take 450 µl of solution of interest in two 1.5 ml tubes, tube A and tube B. Keep the tubes on ice.Add 4.5 µl of pre-diluted 1,000x SYBR Green II in both tubes A and B.Add 4.5 µl of RNase A from 1 mg/ml stock only into tube B to a final concentration of 10 µg/ml.Mix both tubes carefully and transfer 100 µl of the solution into four adjacent wells from each tube, i.e., 8 wells in total.Pipette 1 µg of virus into 3 first wells transferred from tube A and leave the fourth well without virus. Do the same for the wells transferred from tube B that has the RNase A.Mix well and avoid air bubbles. Protect from light, keep on ice and transfer to the measurement device.Fluorescence measurementPrepare a measuring protocol using appropriate filters to measure SYBR Green II. With the Perkin Elmer 2030 Multilabel Reader Victor X4 use CW-Lamp Filter F485 and emission filter F535. Use CW-Lamp energy of 14,592 (or similar value around 15,000) and counting time of 1 second. Use measurement height with “user defined” -option of 13 mm and Plate type of “Generic 8x12 size plate”. Save the protocol for later use.Mark the wells to measure, measure each plate 90 times (Using 90 repeats and two-minute gap between the repeats results in total of 3-hour measurement. To use some other total measuring time adjust the field of “measure each plate” accordingly) and delay between repeats 0 s. Pre-run the protocol and time how long one round of measurements takes. To measure each well every two min, subtract the time taken by one round of measurements from 120 s and place the result into “delay between repeats” -field.",
    "For example, if the time to measure the wells in your experiment takes 30 s, subtract this from 120 s and place the resulting 90 s into “delay between repeats”. In this way the plate reader waits 90 s after the first round of measurements before starting to take the next ones and, as a result, every well is measured exactly every 2 min. Note, that when changing the amount of wells in your measurement, the “delay between repeats” needs to be adjusted accordingly.Pre-heat the plate reader to +37 °C or to any other temperature you wish to measure in. The plate reader takes some time to heat up, so do this before starting to prepare the samples and the plate.Place the previously prepared plate inside the plate reader with the lid on, but without the aluminium folio.Start the protocol.Data handlingExport the data into Excel.Subtract the fluorescence background of each solution at each time point from the fluorescence of the same solution with the virus. Do this for all three replicates.Calculate average of the three replicates. Calculate the standard deviation and the standard error of the mean.Plot the data into a graph."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}