{
  "id": 10287,
  "origin_website": "Jove",
  "title": "Homogeneous Glycoconjugate Produced by Combined Unnatural Amino Acid Incorporation and Click-Chemistry for Vaccine Purposes",
  "procedures": [
    "1. Synthesis of the UAA: propargyl-lysine (PrK)\nSynthesis of Nα-Boc-propargyl-lysine18\nDissolve 500 mg of Boc-L-Lys-OH (2.03 mmol) in a mixture of aqueous 1 M NaOH (5 mL) and THF (5 mL) in a flask and fit the flask with a silicon septum.\nCool the flask in an ice bath and then add 158 µL of propargyl chloroformate (1.62 mmol) dropwise (over a 2-3 min period) using a microsyringe while stirring.\nWarm the reaction mixture to room temperature and continue stirring for 10 h.\nCool down solutions of 50 mL of diethyl ether, 50 mL of aqueous 1 M hydrochloric acid and 60 mL of ethyl acetate in an ice bath.\nCool the crude reaction mixture in an ice bath and pour the mixture into a separation funnel. Extract the mixture with 50 mL of diethyl ether. Discard the organic layer.\nCautiously add aqueous 1 M hydrochloric acid to the aqueous phase in the separation funnel. Then extract the aqueous layer twice using 30 mL of ethyl acetate. Verify the presence of N-Boc-propargyl-lysine in the organic phase by TLC using CH2Cl2-methanol (9:1) as eluent.\nDry the combined organic layers over MgSO4, filter off the solid phase and concentrate the filtrate under reduced pressure on a rotary evaporator.\nDissolve a sample of the crude oily Nα-Boc-propargyl-lysine in deuterated chloroform (CDCl3) and control its identity by 1H NMR.\n\t\tCAUTION: Extraction may result in a buildup of pressure. Release any pressure buildup frequently.\nSynthesis of the unnatural amino acid propargyl-L-lysine (PrK)\n\t\nIntroduce Nα-Boc-propargyl-lysine in a round bottom flask equipped with a septum.\nAdd 4 mL of anhydrous dichloromethane (CH2Cl2) to the flask under argon to dissolve the Nα-Boc-propargyl-lysine.\nAdd 4 mL of trifluoroacetic acid (TFA) dropwise using a syringe while stirring.",
    "Stir the reaction mixture for 1 h at RT. Monitor the reaction by TLC using CH2Cl2-methanol (9:1) as eluent.\nConcentrate the reaction mixture under reduced pressure.\nAdd diethyl ether to the crude residue and incubate it at 4 °C for 1 h to precipitate the PrK. When working on higher scale, if the PrK is not completely precipitated, triturate to precipitate it and extend the incubation time if needed.\nFilter the PrK in the form of a white solid on a fritted-glass.\nDissolve an aliquot of the PrK in D2O. Then carry out NMR analyses to control its identity and purity.\nFor further use, dissolve the unnatural amino acid PrK in distilled water at a final concentration of 100 mM and store at -20 °C as 1 mL aliquots.\n2. Production of the recombinant protein modified by PrK\nPlasmid preparation\n\t\nConstruct an expression plasmid (pET24d-mPsaAK32TAG-ENLYFQ-HHHHHH) that contains the target mature Pneumococcal surface adhesin A (mPsaA) gene (pET24d-mPsaA-WT) followed by a Tobacco Etch Virus (TEV) protease sequence by cloning the insert between the BamHI and XhoI restriction sites of the pET24d plasmid. This will introduce a His6 tag at the C-terminus of the protein. Replace the codon of lysine-32 with the amber codon (TAG), using conventional site-directed mutagenesis technique.\nConstruct a second expression plasmid (pEVOL-MmPylRS) containing two copies of the gene coding for the pyrrolysyl-tRNA synthetase from Methanosarcina mazei (MmPylRS) and the gene coding for the corresponding tRNAPyr as previously described19. Use this specially designed plasmid vector, pEVOL, for efficient incorporation of UAAs.\n\t\tNOTE: The detailed plasmids information is described in Supplemental File 1.\nCo-transformation of plasmids into the expression strain\n\t\nThaw a 100 µL aliquot of chemically competent Escherichia coli BL21(DE3) on ice for 5 min.",
    "Add 1 µL of each plasmid (50-100 ng of each) into the cells and incubate for 30 min on ice.\nTransfer the 1.5 mL microtube with the thawed competent cells in an incubator at 42 °C for 45 s and then move it back to ice for 2 min.\nAdd 900 µL of LB medium and incubate under shaking for 1 h at 37 °C to allow antibiotic expression. Then plate the bacteria onto LB agar with 25 µg/mL of kanamycin and 30 µg/mL of chloramphenicol. Allow bacteria growth overnight at 37 °C.\nExpression of proteins modified with PrK\n\t\nInoculate a single co-transformed colony in 5 mL of LB medium with antibiotics (25 µg/mL of kanamycin and 30 µg/mL of chloramphenicol). Incubate overnight at 37 °C with shaking.\nDilute the primary culture (5 mL) into 500 mL of auto-induction medium containing antibiotics, 0.02% of L-arabinose and 1 mM of the unnatural amino acid PrK and incubate it at 37 °C for 24 h with shaking. Include a negative control by performing the culture without PrK in parallel and a positive control by performing the culture of a clone containing the wt protein.\nAliquot 5 mL out of the 500 mL culture medium and centrifuge for 10 min at 5,000 x g. Discard the supernatant and freeze the pellet at -20 °C. Harvest cells from the remaining 495 mL by centrifugation for 10 min at 5,000 x g. Discard the supernatant and freeze the pellet at -20 °C.\nAnalyze crude cell extracts from the 5 mL culture samples by SDS-PAGE and western Blot analysis\n\t\nResuspend 5 mL cell pellets into 250 µL of lysis buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, pH 8, 5 mM imidazole, 0.2 mM PMSF) and transfer it into a 1.5 mL microtube.",
    "Lyse cells by freezing the tubes in liquid nitrogen, thawing it in a 42 °C bath and vortexing at high speed for 30 s. Repeat this step 3 times.\nCentrifuge samples at 17,000 x g for 10 min to eliminate cell debris.\nTake 10 µL of the supernatant and add 5 µL of water and 5 µL of loading buffer (bromophenol blue, SDS, β-mercaptoethanol). Heat the samples for 5 min at 100 °C and carry out SDS-PAGE and western Blot analyses.\nProtein purification by gravity flow-bench affinity chromatography using Nickel-NTA beads\n\t\nResuspend the cell pellets (from the 495 mL culture) into 20 mL of lysis buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, pH 8, 5 mM imidazole, 0.2 mM PMSF).\nAdd 5 µL of DNase I (1 mg/mL) and 500 µL of lysozyme (50 mg/mL) into the suspension and allow lysis by incubating the suspension at 37 °C during 30 min.\nSonicate the cells during 5 min (cycles of 5 s-5 s, amplitude 50%) and then remove the cell debris by centrifugation at 20,000 x g for 30 min followed by filtration on 0.45 µm filter.\nAdd Ni-NTA resin to the suspension (500 µL for 500 mL of cell culture) and mix gently at 4 °C for 1 h.\nPour the suspension into a polypropylene column and collect the unbound fraction.\nWash the resin with 10 mL of washing buffer containing 50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, 10 mM imidazole. Wash the resin a second time with 5 mL of washing buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, 20 mM imidazole). Collect the wash fractions.\nElute the his-tagged protein with 1 mL of elution buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, 300 mM imidazole). Repeat this step 4 times and collect all the elution fractions.",
    "Analyze the crude lysate as well as the 7 purification fractions by SDS-PAGE on a 12% acrylamide gel.\nCombine the fractions containing pure His-tagged protein and dialyze it against 1 L of TEV protease buffer (50 mM Tris-HCl, 0.5 mM EDTA, pH 8) overnight by using a dialysis membrane (cut-off MW 6000-8000 Da). Measure the concentration of the protein at 280 nm with a molar extinction coefficient of 37 360 cm-1∙M-1 and a molecular weight of 34.14 kDa for mPsaA.\n3. Removal of the histidine tag by TEV protease digestion\nCollect the protein sample into a 50 mL tube and add TEV buffer (50 mM Tris HCl, 0.5 mM EDTA, pH 8) up to 1 mL at a concentration of 2 mg/mL.\n\tNOTE: The concentration may vary according to previous results. Protein concentrations that we have tested are in a typical 2-3 mg/mL range.\nAdd 100 µL of TEV protease (add 1 µL containing 10 units of TEV protease for 20 µg of protein to digest).\nAdd 50 µL of 0.1 M dithiothreitol (DTT).\nComplete with TEV buffer (50 mM Tris HCl, 0.5 mM EDTA, pH 8) up to 5 mL.\nIncubate overnight at 4 °C with slow shaking.\n\tNOTE: If digestion is not complete, add more TEV protease, incubate for longer time or at higher temperature up to 30 °C.\nDialyze the digested protein to remove EDTA at 4 °C overnight by using a dialysis membrane (cut-off 6000-8000 Da) against phosphate buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, 5 mM imidazole).\nTo eliminate the TEV protease and the undigested protein, incubate the mix with Ni-NTA beads and mix gently for 1 h at 4 °C.",
    "Pour the suspension into a polypropylene column. Collect the unbound fraction and wash the column with 5 mL of washing buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, 10 mM imidazole)\n\tNOTE: The protein of interest should be recovered in the unbound and washing fractions.\nElute the TEV protease and the undigested protein by adding 5 mL of elution buffer (50 mM Na2HPO4/NaH2PO4, 150 mM NaCl, 300 mM imidazole) on the column. Check the fractions for protein contents at 280 nm and by SDS-PAGE analysis.\nCheck the efficiency of the digestion by loading digested samples on an SDS PAGE with the undigested protein as a control.\nDialyze the digested protein against 1 L of click buffer (50 mM Na2HPO4/NaH2PO4, pH8) at 4 °C overnight with a dialysis membrane (cut-off 6000-8000 Da) to remove imidazole as well as to exchange the buffer, and measure the concentration of the protein at 280 nm with molar extinction coefficient and molecular weight of mPsaA (37 360 cm-1∙M-1 and MW 34.14 kDa).\n4. Assessment of the unnatural amino acid propargyl-lysine accessibility and functionality for click chemistry\nNOTE: Conjugate the mPsaA with 6-hexachloro-fluorescein-azide using the protocol described by Presolski et al.20 for click chemistry.\nTake 432.5 µL of PrK-mutated protein at a concentration of 57.8 µM into a 2 mL microtube.\n\tNOTE: A minimum concentration of 2 µM of alkyne is acceptable. If the protein concentration is lower, concentrate it with a centrifugal concentrator or favor the balance of the reaction by increasing azide/alkyne molar ratio.\nAdd 10 µL of 5 mM 6-hexachloro-fluorescein-azide and then add a premix of 2.5 µL of CuSO4 solution at 20 mM and 7.5 µL of Tris(benzyltriazolylmethyl)amine (THPTA) at 50 mM (stock solutions concentrations).\n\t\nAdd 25 µL of aqueous 100 mM aminoguanidine hydrochloride.",
    "Add 25 µL of 20 mg/mL an extemporaneously prepared aqueous solution of sodium ascorbate.\nClose the tube, mix by inverting several times and incubate at room temperature for 2 h.\nStop the reaction by adding 50 µL of 0.5 M EDTA.\nTake 15 µL of the reaction mixture and put it a microtube, add 5 µL of loading buffer (bromophenol blue, SDS, β-mercaptoethanol), heat the mixture at 100 °C for 5 min, and then load it into a 12% acrylamide gel. After migration, visualize the fluorescent conjugate on the gel under UV light at 312 nm.\n5. Conjugation of mPsaA with an azido-functionalized carbohydrate antigen (Pn14TS-N3) by click chemistry\nCoupling\n\t\nTake 432.5 µL of PrK-mutated protein at 57.8 µM into a 2 mL microtube.\nAdd 10 µL of 5 mM Pn14TS-N321 in water then add a premix of 2.5 µL of CuSO4 solution at 20 mM and 7.5 µL of THPTA at 50 mM.\n\t\tNOTE: Synthesis of Pn14TS-N3, a tetrasaccharide mimicking the Streptococcus pneumoniae serotype 14 capsular polysaccharide, has been described in reference 21. Theoretically, any carbohydrate antigen containing an azide function can be used.\nAdd 25 µL of 100 mM aminoguanidine hydrochloride.\nAdd 25 µL of 20 mg/mL extemporaneously prepared aqueous solution of sodium ascorbate.\nClose the tube, mix by inverting several times and incubate at RT during 2 h.\nStop the reaction by adding 50 µL of 0.5 M EDTA.\nTake 15 µL of samples and analyze by SDS-PAGE.\nGel filtration purification of the glycoconjugate\n\t\nPurify the glycoconjugate by applying it to a steric exclusion agarose column (15 x 600 bed dimensions, 3,000-70,000 fractionation range), equilibrated with 100 mM PBS buffer, pH 7.3 at a 0.8 mL/min flow with detection at 280 nm.\nCollect the fractions containing the glycoconjugate.",
    "NOTE: For prolonged storage, dialyze the glycoconjugate against 1 L of H2O twice for 2 h and then overnight at 4 °C by using dialysis membrane (cut-off Mw 6000-8000 Da), then freeze-dry and store the glycoconjugate at -80 °C.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}