{
  "id": 10077,
  "origin_website": "Jove",
  "title": "Experimental Quantification of Interactions Between Drug Delivery Systems and Cells In Vitro: A Guide for Preclinical Nanomedicine Evaluation",
  "procedures": [
    "1. Choosing the appropriate stream\nFollow the decision tree outlined in Figure 1 to determine the best workflow (stream) (Figure 2) for the experimental setup used. Refer to the discussion for further comments on this choice of stream.\nIf following the Cytometer Stream, continue with steps 2.1.1-2.2.7. If following the Bulk Stream, continue with steps 3.1.1.1-3.1.5.7.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259fig01.jpg\nFigure 1: Workstream decision tree. The decision as to which Stream to use depends primarily on the carrier type of interest. Larger carriers and carriers with high scattering properties can more easily be detected individually on cytometers, thus making them suitable for quantification using the Cytometer Stream. The Bulk Stream is suitable for all other carrier types. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64259/64259fig01large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259fig02.jpg\nFigure 2: Overview of workstreams. This protocol is split into two different Streams. The Cytometer Stream uses a sensitive cytometer to count the carriers in suspension, measure their individual fluorescence, and then determine the fluorescence of cells incubated with carriers. The Bulk Stream uses non-cytometry-based techniques, such as Nanoparticle Tracking Analysis, to count the carriers in suspension. The individual carrier fluorescence is then quantified using a microplate reader or spectrofluorometer. The use of the flow cytometer is, therefore, restricted to measuring the final fluorescence of cells incubated with carriers, a measurement that can be done on a wider range of cytometers and that is independent of the carrier type used. Abbreviations: MESF = Molecules of Equivalent Soluble Fluorochrome; MFI = median fluorescence intensity. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64259/64259fig02large.jpg]\n2. The Cytometer Stream\nCarrier counting",
    "NOTE: Any flow cytometer can be used for this measurement, provided the flow rate (µL/s) is known. If the flow rate is unknown and cannot be determined, do not proceed with this step. Instead, proceed with step 3.1. Counting the carriers in suspension allows accurate and reproducible determination of the number of carriers incubated in each cell experiment.\n\t\nSet up the cytometer to detect carriers, both by an optical scattering channel (typically side scatter [SSC]) and fluorescence. Make sure to adjust the threshold to allow detection of the carriers.\n\t\tNOTE: Iteration through different optical scattering channels may be required if SSC does not provide a clear signal (e.g., forward scatter [FSC]).\nRun a diluent-only sample to quantify the background event count in both the SSC and fluorescent channels.\n\t\tNOTE: Ideal background event counts are <100 events/s.\nPrepare the carriers for flow cytometry.\n\t\t\nEnsure the carriers are well suspended by vortexing or sonication, depending on the carrier system involved.\nIf possible, ensure the carrier concentration is between 1,000 carriers/µL and 10,000 carriers/µL. An event count of one to two orders of magnitude higher than the background is a good start. If the order of magnitude of the carrier concentration is unknown, a good start is to prepare a 1:1,000 dilution from stock. Use the initial results as feedback to inform future sample dilutions.\n\t\t\tNOTE: A cloudy suspension is generally too concentrated.\nLoad the first carrier sample onto the cytometer and start recording.\nCompare event counts resulting from both the SSC and fluorescence channels; these should be approximately equal (<10% difference). If not, check the cytometer settings, e.g., photomultiplier tube (PMT) settings and laser intensity for the fluorescent channel. Alternatively, use other methods such as confocal microscopy to validate that the fluorescent labeling of the carriers is present and uniform.",
    "Repeat steps 2.1.3-2.1.5 two or more additional times with different dilutions from the stock. Ensure that the event count in each sample is at least one order of magnitude higher than the background event count.\nVerify that three or more samples show a linear trend, that is, a two-fold sample dilution should result in a corresponding two-fold reduction in the measured carrier concentration.\nUse the samples within the linear range, corresponding dilution factors, and the known cytometer flow rate to calculate the stock carrier concentration according to equation (1):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259eq01.jpg     (1)\n\t\twhere C is the stock carrier concentration in carriers/mL. It is recommended to use the event count derived from optical scattering detection rather than fluorescence.\nFlow cytometry readout of the carrier-cell experiment, including determination of fluorescence intensity per carrier\n\tNOTE: Ideally, the fluorescent intensity per carrier will be determined as close as possible to the carrier-cell experiment. This is to ensure that the MFIs obtained for individual carriers can directly be compared to the MFIs of cells associated with the carriers. In practice, a cytometer will usually generate similar results when used on consecutive days using the same PMT voltages, but this cannot be guaranteed.\n\t\nDesign the carrier-cell experiment. Use the carrier concentration determined in step 2.1 to administer the desired dose of carriers.\nSet up the flow cytometer for the final carrier-cell experiment by determining optimal PMT voltage settings in the relevant channels. Set the thresholds to allow carrier detection.\nRun the carriers in suspension to determine the fluorescence intensity per carrier under the current PMT settings.\nIf needed, change the cytometer thresholds to detect the cells and not the carriers.\nRun a negative control sample-cells not incubated with carriers-to determine the background fluorescence (autofluorescence) of the cells.",
    "Run the carrier-cell samples to determine the fluorescence intensity per cell. This fluorescence is a linear combination of cellular autofluorescence and the presence of fluorescent carriers.\nCalculate the number of carriers per cell using the following equation (2):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259eq02.jpg     (2)\n\t\twhere Passoc is the number of carriers associated per cell, FIcell is the MFI of cells incubated with carriers, FIbackground is the MFI of cells not incubated with carriers, and FIcarrier is the MFI of carriers in suspension.\n3. The Bulk Stream\nCarrier counting: nanoparticle tracking analysis\n\tNOTE: In the Bulk Stream, carrier counting is a necessary step to quantify the absolute fluorescence intensity per carrier (see step 3.1.4). In addition, counting the carriers in suspension allows the accurate and reproducible determination of the number of carriers incubated in each cell experiment.\n\t\nPreparation\n\t\t\nMount the flow cell onto the laser module and lock the entire laser module in place inside the instrument.\nSlowly (not faster than 0.1 mL/s) flush the flow cell with ~1 mL of distilled water. If bubbles form within the flow cell, retract the suspension partially to merge the bubble with the air-liquid interface before proceeding.\nStart the camera roughly halfway through flushing; be sure to confirm that carrier debris is washed out. Select Capture to open the Capture Settings tab and click Start Camera.\nDry the system with 1 mL of air. If any static carriers are visible on the screen, clean the flow cell according to the manufacturer's instructions.",
    "Prepare the carriers for Nanoparticle Tracking Analysis by ensuring the carriers are well suspended via vortexing or sonication, depending on the carrier system involved. If the order of magnitude of the stock concentration is unknown, prepare a 1:100 dilution from the stock and use the initial results as feedback to inform future sample dilutions. Dilute the carriers in water and not phosphate-buffered saline (PBS) to prepare at least ~0.6-1 mL of each sample with a carrier concentration between 1 × 107 carriers/mL and 1 × 109 carriers/mL.\n\t\t\tNOTE: A cloudy suspension is generally too concentrated. Buffers and salts can generate high background noise.\nMeasurement\n\t\t\nTake out the laser module and place it upright.\nDraw up the first carrier sample into a 1 mL syringe. Attach the syringe to the tube inlet and carefully load the sample into the flow cell. If bubbles form within the flow cell, retract the suspension partially to merge the bubble with the air-liquid interface before proceeding. Ensure the entire flow cell is filled with liquid, then pause.\nAdjust the camera focus if needed to visualize individual carriers. Make coarse focus adjustments with the rotating knob on the right-hand side of the instrument. Make finer adjustments by selecting the Hardware tab | Pumps/Stage. Change the focus by adjusting the Focus slider.\nAdjust the camera level to make sure there is no oversaturation. Within the Capture tab, select the optimal Camera Level by adjusting the slider.\nIf the instrument is equipped with this accessory, load the syringe containing the carrier sample into the Syringe Pump to ensure continuous sample flow during measurements.",
    "Under the SOP tab, select Standard Measurement to take five captures of 30 s each. Enter Base filename and, if desired, add additional sample information by clicking the Advanced button (which opens a modal dialogue with a variety of choices).\n\t\t\tNOTE: If a dilution factor is entered, the final carrier concentration measurement will be adjusted automatically by the software. Entering this factor is advised against. Instead, perform the adjustment manually, which facilitates the analysis and allows the assessment of whether each dilution falls within the dynamic range of the instrument (step 3.1.3.4).\nPress Create and Run Script and wait for a pop-up to appear asking to Please advance sample.\nIf using the Syringe Pump, select the Hardware tab | Syringe Pump tab | set the Infusion Rate at 30-80 and press Infuse. If not using the Syringe Pump, manually advance the sample.\nIn the pop-up window, select OK to start capturing. After each of the five captures, when the Please advance sample pop-up reappears, check that the sample is still moving through the flow cell, either manually or via the Syringe Pump. Then, select OK to proceed with the next capture.\n\t\t\tNOTE: After five captures, the software automatically opens the Process tab and opens a pop-up asking to adjust the process settings.\nAnalysis\n\t\t\nIn the Process tab, adjust the Detection Threshold slider (between 4 and 8) to correctly identify distinct carriers visible on the screen. Adjust the Screen Gain too to aid visualization; it will not affect the downstream analysis. Use the slider under the capture screen to scroll through multiple frames of the video to aid detection threshold setting.\n\t\t\tNOTE: The detection threshold should be set once and, subsequently, should not be altered between measurements or samples.",
    "In the pop-up (note after step 3.1.2.9), press OK to initiate tracking analysis. Monitor the progress of the analysis by clicking on the Analysis tab | Single Analysis tab.\nOnce the analysis is finished, look for an Export Settings prompt to appear, in which Include PDF and Include Experiment Summary should be selected by default. Select any other export formats as desired.\nIn the Results section of the PDF data export, to ensure the concentration measured is reliable, verify that the measured carrier concentration is between 1 × 107 carriers/mL and 1 × 109 carriers/mL-the dynamic range of the instrument-and check for any error messages or messages of caution underneath the concentration measurement result.\nRepeat steps 3.1.2.1-3.1.3.4 two or more times with different dilutions from the stock. Ensure that the concentration of each sample falls within the linear range of the instrument.\nSelect three or more samples that show a linear trend, that is, a two-fold sample dilution should result in a corresponding two-fold reduction in the measured carrier concentration. Use the selected samples and corresponding dilution factors to calculate the stock carrier concentration.\nDetermination of the absolute fluorescence intensity per carrier\n\t\tNOTE: Since the fluorescence of individual carriers in this stream cannot be characterized directly, the fluorescence intensity is quantified in bulk. This method relies on the fact that fluorescence intensity is linearly related to the fluorochrome concentration according to the Lambert-Beer law. When such bulk quantification of carriers in suspension is done on a suspension of known carrier concentration (see step 3.1), the fluorescence per carrier can be derived. This step can be done on either a fluorescence plate reader or a spectrofluorometer. The fluorescence intensity is compared to a standard curve of samples with known absolute fluorescence, given in number of MESFs.",
    "Use a solution of the free fluorochrome to label the carrier: resuspend the dye in the appropriate buffer (e.g., DMSO) and perform further dilutions in the same buffer as the carrier diluent. Alternatively, use a solution of an antibody conjugated to the fluorochrome. Calculate the concentration of the stock solution (MESF/mL) from the concentration in mg/mL, the molecular weight in mg/mole, and Avogadro's number using equation (3). Perform a serial dilution in the carrier diluent to generate standard curve samples.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259eq03.jpg     (3)\n\t\t\tNOTE: Use a fluorochrome-conjugated antibody only if the degree of labeling, i.e., the molar ratio between the fluorochrome and antibody in the solution, is known. Initially, generate a standard curve with a wide range, as the fluorescence intensity of the carrier sample is still unknown. From here, narrow it down to include the range required.\nPrepare the carrier samples.\n\t\t\tNOTE: The best practice is to test two or more carrier dilutions to validate that the measurements are linear and fall within the range of the standard curve.\nMeasure the fluorescence of equal volumes of each sample, i.e., both carrier and standard curves.\nGenerate a standard curve and deduct the bulk absolute fluorescence intensity in MESF/mL for the carrier samples measured.\nCalculate the absolute fluorescence intensity per carrier (MESF/carrier) by dividing the bulk fluorescence (MESF/mL) by the carrier concentration (carriers/mL) as in equation (4):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259eq04.jpg     (4)\nCell experiment (including the determination of the equivalent fluorescence intensity per carrier)",
    "NOTE: In this step, flow cytometry quantitation beads are used to generate a standard curve of the relationship between MESF and MFI. These quantitation beads consist of multiple bead populations with a known number of MESF per bead, and these individual beads can be detected by any cytometer. Ideally, the MESF standard curve is determined at the same time as the readout of the carrier-cell experiments. This is to ensure that the MFI values calculated for individual carriers can directly be compared to the MFI of cells associated with carriers. In practice, a cytometer will usually generate similar results when used on consecutive days using the same PMT voltages, but this cannot be guaranteed.\n\t\t\nDesign the carrier-cell experiment. Use the carrier concentration determined in section 3.1.3 to administer the desired dose of carriers.\nSet up the flow cytometer for the final carrier-cell experiment by determining optimal PMT voltage settings in the relevant channels.\nRun a negative control sample, that is, cells not incubated with carriers, to determine the background fluorescence.\nPrepare and resuspend the flow cytometry quantitation beads. Use the same buffer as used for the cell samples (e.g., PBS). If the bead populations are provided separately, pool them together.\nRun the flow cytometry quantitation bead sample.\nRun the carrier-cell samples to determine the fluorescence intensity per cell.\nUse the quantitation bead sample to generate a standard curve converting the absolute fluorescence intensity (MESF) into MFI. Use this standard curve and the results from step 3.1.4 to calculate the theoretical MFI of the carriers. Calculate the number of carriers per cell using equation (5):\nimgsrc://cloudfront.jove.com/files/ftp_upload/64259/64259eq05.jpg     (5)",
    "Where Passoc is the number of carriers associated per cell, FIcell is the MFI of cells incubated with carriers, FIbackground is the MFI of cells not incubated with carriers, and FIcarrier is the calculated MFI of carriers in suspension (step 3.1.4).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}