{
  "id": 15306,
  "origin_website": "Jove",
  "title": "A Universal Protocol for Large-scale gRNA Library Production from any DNA Source",
  "procedures": [
    "1. Digestion of DNA with Micrococcal Nuclease\nPerform an optimization reaction for each new batch of micrococcal nuclease enzyme (MNase).\n\tNOTE: The number of units of MNase used should be tested (using a serial dilution, Figure 2A). Usually, 5-10 U of MNase digest 1 µg of purified genomic or BAC DNA down to a range of 5-100 bp with the conditions described below.\nPer reaction, set up 1 µL of 10x MNase Buffer, 1x bovine serum albumin (BSA), 1 µg of target DNA, 1 µL of MNase (0.1-50 units) in a 10 µL reaction volume.\nIncubate at 37 °C for 15 min.\nImmediately inactivate the enzyme by adding 1 µL of 500 mM ethylene glycol-bis(β-aminoethyl ether)-N,N,N',N'-tetraacetic acid (EGTA).\n2. Separation of DNA Fragments Using Polyacrylamide Gel Electrophoresis (PAGE)\nAdd sample buffer/gel loading dye to DNA samples and load onto a 20% PAGE gel. Load an appropriate DNA ladder for sizing (5 bp DNA Ladder). Do not overload the gel (1 µg DNA per well).\nRun gels in appropriate 1x TRIS-Borate-EDTA (TBE) running buffer at 150 V (constant) for around 1.5 h or until the lower dye front (bromophenol blue, dark blue color) that travels at around 15 bp, reaches the lower end of the gel.\nStain the gel using an ultra-sensitive nucleic acid stain and visualize under UV light.\nFrom the gel image, determine the optimum concentration of MNase for digesting DNA down to 20-30 bp in size.\nUse the optimized concentration of MNase to digest the target DNA by repeating steps 1.2-2.2. Usually, setting up 10-12 reactions (i.e. 10-12 µg of total starting material) will yield enough digested DNA following PAGE gel extraction to proceed to subsequent steps.",
    "Using a sterile scalpel, cut the gel next to the marker lane and stain only the part of the gel containing the ladder with fresh 1x TBE running buffer containing 1X of an ultra-sensitive nucleic acid stain. Visualize the DNA ladder and excise MNase-digested DNA fragments in the size range between approximately 18-30 bp using a razor blade.\n\tNOTE: Avoid exposing the MNase digested fragments to UV light. It is possible to use a blue light source (instead of UV) or take an image of the ladder under UV, print it to scale and use this to guide excision of MNase-digested DNA fragments). This step avoids staining and exposure of DNA fragments to UV light. Always use an unused, sterile disposable scalpel or razor blade for this step to avoid contamination.\nTransfer the gel slice to a microcentrifuge tube.\nStain the remainder of the gel with nucleic acid stain as above, expose to UV light and record an image to keep a record of the gel excision step.\n3. Isolation of DNA Fragments from PAGE-gels Using the Crush and Soak Method\nNOTE: This step has been adopted from Sambrook et al.11\nPrepare PAGE gel solubilization buffer (1.88 mL of 4 M ammonium acetate, 150 µL of 1 M magnesium acetate, 30 µL of 0.5 M ethylenediaminetetraacetic acid (EDTA) (pH 8) in ultrapure H2O to a total volume of 15 mL).\nCrush the excised gel slice against the wall of the micro-centrifuge tube using a sterile pipette tip.\nAdd 2 gel volumes of PAGE solubilization buffer and incubate at 37 °C for 16 h on a rotating platform.\nCentrifuge the samples for 1 min at maximum speed in a microcentrifuge. Transfer the supernatant to a new microcentrifuge tube, taking care not to transfer any crushed gel pieces.",
    "Add 0.5 volumes of PAGE solubilization buffer to the gel pellet, vortex, and repeat the centrifugation (step 3.4). Combine the supernatants.\nExtract the DNA fragments using standard phenol-chloroform extraction.\n\tCAUTION: Phenol is toxic if it comes into contact with skin or if swallowed. Safety precautions such as gloves, protective eyewear, a lab coat, and working in a fume hood are critical. Dispose of all phenol-containing waste according to the institute's regulations.\n\t\nAdd one volume of phenol:chloroform:isoamyl alcohol (25:24:1) to the sample and vortex thoroughly.\nCentrifuge for 10 min at maximum speed (16,000 x g) in a tabletop centrifuge at room temperature. Carefully transfer the upper aqueous phase to a fresh microcentrifuge tube. Take care not to carry over any phenol during pipetting.\nRepeat steps 3.6.1 and 3.6.2 once.\nAdd a small amount (0.2 µL) of glycogen, 0.1 volumes of 3 M sodium acetate (pH 5.2) and 2 volumes of 100% ethanol (EtOH).\nVortex and incubate at -20 °C for several hours or overnight.\nCentrifuge for 30 min at maximum speed at 4 °C using a tabletop centrifuge.\nCarefully remove the supernatant and wash the DNA pellet with 70% EtOH.\nCentrifuge for 30 min at maximum speed at 4 °C using a tabletop centrifuge.\nRemove the supernatant and air-dry the DNA pellet. Make sure all the EtOH has evaporated but be careful not to over-dry the pellet.\nDissolve DNA pellet in 12 µL of H2O.\n\t\tNOTE: PAGE gel extraction is very inefficient. For every 10 µg of starting DNA digested with MNase, expect to recover 1-20 ng of purified fragments after gel extraction. Control amount and integrity of fragments by loading 1/6th (2 µL) on a PAGE gel (Figure 2C).\n4. End Repair of MNase-digested, Gel-purified Fragments",
    "Set up the following reaction using a DNA blunting kit: 10 µL of purified DNA from step 3.6.10, 1.5 µL of 10X blunting buffer, 1.5 µL of 1 mM dNTP mix, 0.6 µL of blunting enzyme, 1.4 µL of H2O.\nIncubate at 22 °C for 30 min, and then heat-inactivate the enzyme by incubation at 70 °C for 10 min.\nAdd 85 µL of H2O and perform a reaction clean-up using standard phenol/chloroform- extraction and EtOH-precipitation (as described in section 3.6). Proceed immediately to linker ligation.\n5. Linker Generation\nNOTE: Linkers need to be amplified in parallel with section 3 to be able to proceed immediately with linker ligation. Primer sequences used below must be appropriate for the chosen gRNA expression vector. Those presented here have been designed for the vector pgRNA-pLKO.1.9 For amplification of the 5' linker from pgRNA-pLKO.1, use the primer sequences 5'-linker-F (TTGGAATCACACGACCTGGA) and 5'-linker-R (CGGTGTTTCGTCCTTTCCAC), yielding a 689 bp amplicon. For amplification of the 3' linker from pgRNA-pLKO.1, use the primers 3'-linker-F: (GTTTTAGAGCTAGAAATAGCAAGTTAAAATA) and 3'-linker-R: (ACTCGGTCATGGTAAGCTCC), which yield an 848 bp amplicon.\nPCR-amplify the adapter sequences from the gRNA expression vector (using reagents of choice and custom primer sequences, if necessary). For pgRNA-pLKO.1 set up the following 50 µL PCR reaction: 25 µL of PCR master mix, 2.5 µL of primer F (10 µM), 2.5 µL of primer R (10 µM), 0.1 ng of gRNA expression vector (pgRNA-pLKO.1) in H2O.\nIncubate reactions on a thermocycler using the following conditions: 1 cycle 98 °C for 30 s, 32 cycles 98 °C for 10 s, 59 °C for 10 s, 72 °C for 30 s, 1 cycle 72 °C for 10 min.\nPurify PCR reactions using solid phase reversible immobilization beads according to the manufacturer's instructions. Elute in 30 µL of H2O.",
    "To enforce directional ligation of the linker to the end-repaired, MNase-digested DNA fragments, digest linkers with appropriate restriction enzymes (here HindIII and SacII). Set up the following reactions:\nFor digestion of 5' linker with HindIII, use 30 µL of purified 5' linker amplicon from step 5.3., 5 µL of Buffer, 3 µL of HindIII (20U/µL), and 12 µL of H2O.\nFor digestion of 3' linker with SacII, use 30 µL of purified 3' linker amplicon from step 5.3., 5 µL of Buffer, 3 µL of SacII (20 U/µL), and 12 µL of H2O.\nIncubate digests at 37 °C for 3 h.\nAdd DNA gel loading dye and run the restriction enzyme digests on a 1% agarose gel. Excise the bands at 637 bp (5' linker digest) and 295 bp (3' linker digest).\nPurify the DNA from the excised gel pieces using a gel extraction kit.\n6. Linker Ligation and Amplification of Inserts\nSet up a 14 µL ligation reaction using equimolar amounts of MNase-digested, end-repaired fragments and linker sequences.\n\tNOTE: Linker to fragment ratios may be optimized. It is recommended to include a no-fragment control (NFC) reaction.\n\t\nUse 5 ng of MNase-digested fragments (end-repaired and purified), 120 ng of 5'linker (HindIII digest, purified), 55 ng of 3' linker (SacII digest, purified), 1.4 µL of T4 ligase Buffer, and 1.4 µL of concentrated T4 DNA ligase in H2O.\nIncubate the ligation reactions at 16 °C for 16 h. Do not heat-inactivate the enzyme. Proceed immediately to nick-translation.\n\tNOTE: The end-repaired MNase-digested fragments provide the 5' phosphates necessary for ligation of linkers, as the linker themselves are un-phosphorylated.",
    "To the ligation reaction (and the NFC reaction) add the following: 25 µL of Taq 2X master mix (capable of nick translation), 2.5 µL of primer Linker-Minus450-F (10 µM, GGGCAAGTTTGTGGAATTGG), 2.5 µL of primer Linker-Plus275-R (10 µM, AAGTGGATCTCTGCTGTCCC) and 6 µL of H2O.\nInclude a no-template control (NTC). Incubate reactions on a thermocycler using the following conditions: 1 cycle (nick translation): 72 °C for 20 min, 1 cycle: 95 °C for 5 min, 3-4 cycles: 95 °C for 15 s, 58 °C for 15 s, 72 °C for 30 s, 1 cycle: 72 °C for 5 min.\nPerform a reaction clean-up using solid phase reversible immobilization beads with a sample to bead ratio of 1:1. Elute in 40 µL of H2O.\nFurther amplify the desired fragment (5' linker + MNase fragment +3' linker) using appropriate PCR reagents and the following primers:\nUse 12.5 µL of PCR master mix, 1.25 µL of primer Linker-Minus450-F (10 µM, GGGCAAGTTTGTGGAATTGG), 1.25 µL of primer Linker-Plus275-R (10 µM, AAGTGGATCTCTGCTGTCCC), 2.5 µL of purified nick translation product from step 6.4. and 7.5 µL of H2O. Use the following conditions: 1 cycle: 98 °C for 30 s, 10-16 cycles: 98 °C for 10 s, 63° C for 10 s, 72° C for 15 s, 1 cycle: 72 °C for 10 min.\n\t\tNOTE: If necessary, several reactions can be set up in parallel to ensure there is enough PCR product for subsequent steps. To visualize small amounts of the PCR product on an agarose gel, set up additional reactions as in step 6.5 and increase the cycle number from 15 to 32. This reaction can be used as quality control, if amplicons are not visible after 15 cycles. Include also a no template control (NTC).\n7. Size Selection",
    "NOTE: This step separates MNase-fragments with the correctly attached 5' and 3' linker from fragments with two 5' or two 3' linkers based on size.\nCombine all 15-cycle PCR reactions from step 6.5., add DNA loading dye and run on a 0.8% agarose gel. Excise the prominent band at 869 bp and purify DNA using a gel extraction kit.\nQuantify the amount of DNA (e.g. using a spectrophotometer).\n8. Cloning of PCR-amplified Fragments into the gRNA Expression Vector by Gibson Assembly\nPrepare assembly master mix as follows:\n\tNOTE: The following steps are adapted from Gibson et al.12.\n\t\nCreate 6 mL isothermal reaction buffer by combining 3 mL of 1 M Tris(hydroxymethyl)aminomethane (Tris)-HCl pH 7.5, 300 µL of 1 M MgCl, 60 µL of 100 mM deoxyguanosine triphosphate (dGTP), 60 µL of 100 mM deoxyadenosine triphosphate (dATP), 60 µL of 100 mM deoxythymidine triphosphate (dTTP), 60 µL of 100 mM deoxycytidine triphosphate (dCTP), 300 µL of 1 M dithiothreitol (DTT), 1.5 g of polyethylene glycol (PEG)-8000, 300 µL of 100 mM nicotinamide adenine dinucleotide (NAD) in ultrapure H2O.\n\t\tNOTE: This buffer can be aliquoted and stored at -20 °C.\nCreate 1.2 mL assembly master mix by combining 320 µL of 5X isothermal reaction buffer, 3 µL of 10 U/µL T5 exonuclease, 20 µL of 2 U/µL DNA polymerase, 160 µL of 40 U/µL DNA ligase in ultrapure H2O. Use 15 µL of assembly master mix with 5 µL of insert.\n\t\tNOTE: The assembly master mix can be aliquoted and stored at -20 °C, where it is stable for more than a year and can tolerate multiple freeze-thaw cycles. The chosen amount of T5 exonuclease is ideal for use with long overhangs.\nVector backbone digestion",
    "NOTE: Make sure to digest a sufficient amount of vector as input for the desired number of assembly reactions in step 8.3.\n\t\nPer reaction, add the following: 1.5 µg of gRNA expression vector (pgRNA-pLKO.1), 5 µL of buffer, 1.5 µL of AgeI (5U/µL), and 38.5 µL of H2O. Incubate digest at 37 °C for 2 h.\nDephosphorylation of the linearized vector.\n\tNOTE: This step is advised, but not strictly necessary. T5 exonuclease in the master mix will mostly remove the AgeI overhangs before the Taq DNA ligase has had a chance to act. Therefore, excessive re-ligation of the vector is not expected.\n\t\nAdd 2.5 µL of shrimp alkaline phosphatase enzyme (rSAP, 1 U/µL).\nIncubate at 37 °C for 30 min, and then inactivate the enzyme by incubating at 65 °C for 5 min.\nPerform DNA purification\n\tNOTE: It is recommended to perform an agarose gel extraction step. Alternatively, column- or bead purification can be used. It is important to check that the vector digestion is complete, e.g. by agarose gel electrophoresis. For comparison, undigested vector should be run in parallel.\nQuantify the amount of purified digested vector in the sample.\nSet up the assembly with 2-fold molar excess of inserts to vector. Per 20 µL reaction use 100 ng of vector (AgeI digest from step 8.5), 12.2 ng of insert (from step 7.1.), 15 µL of assembly master mix from step 8.1.2. in H2O.\nIncubate at 50 °C for 1 h.\nPurify the reactions using column purification. Resuspend the DNA in 75 µL of H2O (or appropriate volume depending on scale of electroporation).\n\tNOTE: The transformation efficiency is greatly dependent on DNA purity. Additional purification steps (e.g. phenol/chloroform extraction) might improve efficiency.\n9. Preparation of Electro-competent TG1 E. coli Cells",
    "Ensure that all centrifuge bottles and flasks are free from detergents by rinsing and subsequent filling with distilled water before autoclaving.\n\tNOTE: This step helps to remove any impurities which may affect transformation efficiency. Water should be discarded immediately before use. Alternatively, use of disposable centrifugation bottles might be advisable.\nEnsure that centrifuge bottles, tubes and solutions used for the preparation of electrocompetent cells are chilled on ice prior to use. It is best to conduct the following steps in a cold room to minimize temperature fluctuations which may affect the transformation efficiency.\nPrepare 2TY medium. To 16 g of bacto tryptone, 10 g of yeast extract, and 5 g of NaCl, add distilled water to 1 L, mix and autoclave. Store medium at room temperature.\nPrepare 2TY-agar coated bioassay dishes and 10 cm Petri dishes containing the appropriate antibiotic. Store plates at 4 °C.\n\tNOTE: The choice of antibiotic depends on the nature of the gRNA expression vector, use 100 µg/mL ampicillin for pgRNA-pLKO.1.\nScrape from a glycerol stock of TG1 cells to inoculate 10 mL of 2TY medium (without antibiotics).\nIncubate culture at 37 °C overnight (~16 h) with shaking at 225 rpm.\nInoculate 1 L of 2TY medium (without antibiotics) with the 10 mL of overnight culture (1/100 dilution) and divide it equally between two 2 L flasks (containing baffles).\nIncubate culture at 37 °C, 225 rpm until an OD600 nm of 0.55 is reached (approximately after 1.5 - 2 h). Use a spectrophotometer to check OD600 nm regularly.\nChill cultures on ice for 30 min.\nSplit the culture equally between four 500 mL centrifuge bottles (pre-chilled on ice).\nCentrifuge for 15 min at 4,000 x g at 4 °C in a pre-chilled centrifuge.",
    "Decant supernatants and add 1 volume (i.e. 250 mL) of pre-chilled ice-cold sterile distilled H2O to each of the centrifuge bottles. Resuspend the bacterial pellet by swirling or inverting the bottle (or by gentle pipetting, if necessary).\n\tNOTE: It is easier to resuspend the pellet by first adding a small volume of water. Ensure the pellet is completely resuspended eventually.\nCentrifuge for 15 min at 4,000 x g at 4 °C.\nRepeat the wash two times (steps 9.12. and 9.13). Remove the supernatant. Be careful when decanting as the bacterial pellet becomes increasingly loose after washing.\nResuspend the pellet in 50 mL of sterile, ice-cold 10% glycerol and transfer it to a pre- chilled 50 mL centrifuge tube.\nCentrifuge cells for 15 min at ~4,000 x g at 4 °C. Carefully remove the supernatant.\nGently resuspend the bacteria in 2 mL of ice-cold sterile 10% glycerol.\nKeep on ice if the cells are to be used immediately for electroporation.\n\tNOTE: The cells can be frozen in aliquots of 50 µL in 0.5 mL tubes in a dry-ice ethanol bath and stored at -80 °C, but this is not recommended.\n10. Electroporation of TG1 Electrocompetent E. coli Cells\nNOTE: Electroporation is one of the bottlenecks in comprehensive library generation. To preserve the library representation, it is recommended to conduct as many individual electroporation reactions as necessary/practicable and to perform the quality control steps described below (10.6. and 10.8.).\nAliquot the purified reactions (from step 8.8) into sterile and pre-chilled PCR tubes and keep them on ice (1 µL per tube). Chill 1 mm gap electroporation cuvettes on ice.",
    "Add 25 µL of freshly prepared TG1 cells directly to one aliquot of DNA and immediately transfer the mixture into an electroporation cuvette. Flick or tap the cuvette to ensure the cells/DNA mix is distributed along the length of the cuvette chamber (without any trapped air or bubbles).\nPlace the cuvette in the slide chamber and start the appropriate electroporation program (e.g. 1 pulse of 1.8 kV (EC1)).\n\tNOTE: The time constant should lie between 5.7 and 6.0 ms. In case the electroporator arcs, flick the cuvette, ensure there are no air bubbles in the chamber and try again.\nImmediately add 975 µL of room temperature 2TY medium to the cuvette.\nUsing a transfer pipette, move the electroporated bacteria to a 50 mL tube. Repeat from step 10.2. and collect all cells transformed with one library in one 50 mL tube.\nDocument the total volume.\nQuality control step\nTo quantify the competence of the freshly generated electro-competent cells, perform a separate electroporation reaction using a defined quantity of uncut plasmid DNA (e.g. 10 pg pUC19 control plasmid). Transfer this to a 1.5 mL microfuge tube.\n\t\tNOTE: The competency should be at least 1010 colony-forming units (cfu) per µg DNA. Freshly prepared cells usually perform better than this.\nIncubate transformed bacteria at 37 °C for 60 min shaking at 225 rpm.\nQuality control step:\nPlate a defined small amount of bacteria transformed with the library (e.g. 10 µL of a 10-100 fold dilution) on a 10 cm agar plate with the appropriate antibiotic selection.\n\t\tNOTE: Knowing the total culture volume (from step 10.6.), the obtained colony number can be used to estimate the total number of colonies for the entire library. 20-30 fold representation of the library should ideally be maintained.",
    "Disperse the remainder of the bacteria onto 2TY agar coated bioassay dishes containing the appropriate antibiotic selection.\n\tNOTE: The volume of the culture can be reduced by centrifugation at ~4,000 x g for 10 min (or until a visible pellet has formed and the supernatant appears clear). This reduces the time plates need to dry after spreading of the culture. Use of plates rather than liquid culture minimizes disproportionate growth of individual colonies.13\nSpread an appropriate volume of the pUC19 control electroporation reaction on an additional 10 cm agar dish with appropriate antibiotic selection.\nIncubate agar plates overnight (16 h) at 37 °C.\nCount obtained colonies on the control plates (pUC19 and control library plate) to estimate CFU/µg DNA for the bacteria as well as library complexity.\n11. Extraction of Plasmid DNA\nAdd 10 mL of 2-TY media to the overnight plates, scrape the bacterial layer off the plate using a disposable spreader and collect it in a 50 mL tube. Repeat a few times until all of the plate appears clean.\nExtract DNA using a Plasmid Maxi kit (2-3 columns needed per Bio-assay plate)."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}