{
  "id": 1731,
  "origin_website": "Cell",
  "title": "Spatial analysis of organ-wide RNA, protein expression, and lineage tracing in the female mouse reproductive tract",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation of female mouse reproductive tract tissue\nTiming: 1 h\nEuthanize the experimental mice according to the ethically approved technique.\nFix the mice to the dissection platform with the ventral side facing up and pin the legs with wall needles.\nSterilize the entire surface of the mouse with 70% ethanol.\nLift the skin of the abdomen and abdominal muscles with a pair of forceps.\nMake a small cut giving an incision extending down to the genital opening.\nGive transverse incisions along the length of the limbs.\nPin down the separated skin and the muscular folding to the dissection platform (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1187-Fig2.jpg\nFigure 2. Isolation of FRT and preparation for IHC and smRNA-ISH\n(A) Euthanized mice dissected.\n(B) The isolated FRT.\n(C) FRT tissue placed on a sponge inside the embedding cassette (left) and a closed cassette containing FRT tissue sandwiched between sponges (right).\n(D) Tissue processor.\n(E) The embedding station (left) and FRT tissue placed inside a paraffin embedding mold (right).\n(F) FRT tissue placed inside an embedding mold with molten paraffin.\n(G) Tissue embedding cassette placed in the embedding mold with FRT tissue.\n(H) Paraffin-embedded FRT tissue block.\n(I) Microtome for sectioning of paraffin blocks and a slide containing a 5 μm section of the FRT tissue.\n(J) Whole tissue images of FRT tissue stained with antibody against cytokeratin 5 (KRT5) expressed exclusively in the stratified epithelia of ectocervix and vagina (upper panel) and cytokeratin 8 (KRT8) expressed exclusively in the columnar epithelium of the upper FRT, including endocervix and uterus (lower panel). Nuclei are shown in blue. (K) Whole FRT tissue smRNA-ISH images of Krt5 (upper panel) and Krt8 (lower panel). Nuclei are shown in blue. Images in J and K are acquired with AxioScan imager.",
    "Carefully remove the entire female mouse reproductive tract (FRT) from the abdominal cavity (Figure 2[href=https://www.wicell.org#fig2]B).\nPlace the FRT tissue in a Petri dish and clear off any adipose and connective tissue surrounding the FRT.\nTransfer the tissue to a Falcon tube and wash tissue with PBS by inverting the tube several times.\nPreparation of paraffinized tissue\nTiming: 1 day\nTransfer the entire tissue to a 50 mL Falcon tube containing 3.7% PFA prepared in sterile 1× PBS and keep for 14 h at 25°C (Figures 1[href=https://www.wicell.org#fig1] and 2[href=https://www.wicell.org#fig2]B).\nDiscard the PFA, wash tissue thrice with 10 mL sterile PBS.\nCritical: Tissue used for IHC can be stored in PBS at 4°C for 1 week until the next step. The tissue used for smRNA-ISH should be processed immediately for the next step.\nCritical: PFA is highly toxic. Use protective gloves and a mask.\nPlace the tissue between the sponges inside the embedding cassette. Label the cassette with a pencil (Figure 2[href=https://www.wicell.org#fig2]C) (troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nPlace the cassette inside the processing chamber of the tissue processor (Figure 2[href=https://www.wicell.org#fig2]D).\nImmerse the tissue in each reagent for 1 h with agitation (Series of regents to include: 50% ethanol, 70% ethanol, 90% ethanol, 100% ethanol X 2, 100% isopropanol X 2,100% Xylene and Molten paraffin).\nCritical: Xylene causes systemic toxicity by ingestion or inhalation. Use protective gloves and a mask.\nEmbed dehydrated and paraffinized tissue using a paraffin embedding machine (Figures 2[href=https://www.wicell.org#fig2]E–2H).\nCritical: Place the entire FRT horizontally and ensure the whole tissue is in the same plane before adding the paraffin.\nCool the paraffin block on the cooling pad.\nAfter cooling, remove the paraffin-embedded tissue with cassette from the metal jar using a scalpel blade.\nThe paraffinized tissue blocks can be stored for years at 25°C.",
    "Sectioning of paraffinized tissue for immunohistochemistry and single molecular RNA in situ hybridization\nTiming: ∼2 h\nKeep the paraffinized tissue block on ice for at least 30 min (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nCut 5–7 μm thick sections for the IHC and 10 μm sections for the smRNA-ISH using a microtome (Figure 1[href=https://www.wicell.org#fig1]).\nCritical: Sharp blade: contact may result in injury.\nPlace the sections on the water bath with the temperature set to 40°C for at least 5–10 min (Figure 2[href=https://www.wicell.org#fig2]I).\nCritical: For smRNA-ISH, clean water bath with autoclaved distilled water and fill with fresh autoclaved distilled water each time (troubleshooting 3[href=https://www.wicell.org#sec6.5]).\nUsing a glass slide, fish out tissue sections onto the middle of the slide.\nCritical: Use “SuperFrost Plus” adhesion slide.\nPlace the slide on top of a heating plate at 37°C until sections dry completely.\nFor IHC, the section can be stored at 25°C for years.\nFor smRNA-ISH, prepare fresh sections (troubleshooting 4[href=https://www.wicell.org#sec6.7]).\nDeparaffinization and antigen retrieval of tissue section for immunohistochemistry\nTiming: ∼ 3 h\nPour 250 mL of DAKO target retrieval solution into a glass jar and place it in a water bath. Set the temperature to 95°C (Figure 1[href=https://www.wicell.org#fig1]).\nKeep the slides with tissue sections in an oven for 1 h at 60°C.\nImmerse slides through a series of reagents as follows inside the fume hood:\ntable:files/protocols_protocol_1187_10.csv\nMove the slides up and down at least 5 to 10 times, every 2–3 min in each step.\nCritical: Xylene causes systemic toxicity by ingestion or inhalation. Use protective gloves and a mask.\nImmerse slides in target retrieval solution, close the lid, and incubate for 30 min.\nCritical: Make sure water bath temperature has reached 95°C.\nAfter boiling, keep the target retrieval solution with slides for 20 min at 25°C.",
    "Remove the slides and wash 5 times with tap water by dipping up and down 3 to 4 times per wash.\nOne-step immunohistochemistry staining\nTiming: 1 day\nNote: All the primary antibodies targeting different proteins and raised in different species without a directly coupled fluorochrome can be incubated together in the one-step IHC. Then followed by respective fluorochrome tagged secondary antibodies (steps 23–36). In the two-step IHC protocol, all the primary antibodies not coupled to fluorochrome are first incubated with the tissue, followed by their respective fluorochrome coupled secondary antibodies. Next, the primary antibody that targets a different protein and is coupled directly to a fluorochrome is incubated together with DNA staining dye (steps 37–40) (Figure 1[href=https://www.wicell.org#fig1]).\nCritical: The two-step IHC protocol greatly reduces the non-specific staining of tagged primary antibodies.\nRemove slides and carefully wipe the slides with tissue paper to remove the moisture without disturbing the tissue section.\nUsing a Pap pen or Immedge hydrophobic barrier pen, draw a circle around the tissue section.\nCritical: Make sure not to touch the tissue section with the Pap pen.\nAdd 50–100 μL of PBS on top of the tissue section to prevent it from drying out.\nNote: Volume of the PBS depends on the size of the tissue section.\nRemove PBS and add 50–100 μL of IHC blocking solution onto the tissue section.\nIncubate for 60 min at 25°C in a moisture chamber (to prevent drying).\nRemove IHC blocking solution and add 50–100 μL of primary antibodies (without a directly coupled fluorochrome) diluted in IHC blocking solution, incubate for 14 h at 4°C in a moisture chamber.\nCritical: Make sure the tissue section is completely covered with antibody solution.\nWash the tissue section 5 times with PBS for 2–5 min at 25°C each time.",
    "Add 50–100 μL of fluorochrome-linked secondary antibodies diluted in IHC blocking solution and your choice of DNA dye (Eg: Draq5 (1:1000), Hoechst (1:2000)).\nCritical: From this step onwards, work in low light.\nIncubate for 60 min at 25°C in a moisture chamber in the dark.\nWash the tissue section 5 times with PBS for 2–5 min at 25°C each time.\nWash the tissue section once with distilled water.\nRemove the excess water with tissue paper.\nCritical: Do not touch the tissue region and do not let the tissue section dry.\nAdd 3 to 4 drops of Mowiol on top of the tissue section, place a coverslip (24 × 60 mm) above, gently squeeze out excess Mowiol using the backside of bent forceps.\nCritical: Do not press hard as this may break the coverslip or disrupt the tissue. Make sure that no air bubbles are trapped near the tissue section.\nKeep the slides for 14 h at 25°C in a dark place (troubleshooting 5[href=https://www.wicell.org#sec6.9]).\nPause point: Store at 4°C in the dark until fluorescence microscopy (troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nTwo-step immunohistochemistry staining\nFor staining, which includes both antibodies with unconjugated and conjugated fluorochromes, follow protocol steps 23–32.\nAfter the wash in step 32, add 50–100 μL of IHC blocking solution onto the tissue section, incubate for 60 min at 25°C in a moisture chamber in the dark.\nRemove IHC blocking solution and add directly tagged primary antibody diluted in IHC blocking solution and your choice of DNA dye (e.g., Draq5 (1:1000), Hoechst (1:2000)).\nFollow steps 31–36.\nLineage tracing and tissue preparation",
    "Here, we described the protocol for the lineage tracing of squamous epithelial marker KRT5 by utilizing mice expressing Krt5-CreERT2; Rosa26-tdTomato to visualize directly the endogenous tdTomato fluorescence in the FRT. Further, the protocol describes co-immunostaining of the lineage traced tissue to visualize additional proteins of interest. For lineage tracing, use four-week-old female mice housed in a BSL 2 level animal laboratory and provided with sterile drinking water and chow.\nNote: Timing varies for lineage tracing depending on the experimental requirements.\nFor lineage traced tissue preparation\nTiming: 1 h\nPrepare fresh tamoxifen solution in corn oil before starting the experiment (see materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nInject 50 μL of tamoxifen solution per mouse (0.25 mg/g body weight) intraperitoneally.\nRepeat the injection 2 times on consecutive days.\nCritical: Wipe the abdominal surface with 70% ethanol before injection and observe the health of the mice daily.\nAs per the requirement, euthanize mice (between 1 week to 20 weeks post-tamoxifen injection) according to standard ethically approved procedure.\nIsolate FRT following steps 1–7.\nProceed for sectioning (steps 50–57, steps 58–62) and detect lineage traced cells directly (steps 47–49) or by co-immunohistochemistry according to the procedure below steps 58–65.\nDilute choice of DNA Dye in permeabilization buffer (Draq5 (1:1000), Hoechst (1:2000)), add 100 μL per tissue section, incubate for 30 min at 25°C.\nFollow steps 31–36.\nVisualize the lineage traced cells by standard microscopic methods (troubleshooting 7[href=https://www.wicell.org#sec6.13]) (Figure 3[href=https://www.wicell.org#fig3]J).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1187-Fig3.jpg\nFigure 3. Preparation of fresh frozen tissues for analyzing lineage tracing and co-immunostaining\n(A–C) Prepare a freezing apparatus as shown.\n(D) FRT tissue isolated freshly and fixed.\n(E) FRT tissue placed in a cryomold overlaid with OCT medium.\n(F) Cryomold containing FRT tissue and OCT medium placed on the isopentane containing tray over the dry ice and isopropanol mixture for freezing.",
    "(G) Fresh frozen tissue block in the cryomold ready to be stored or sectioned.\n(H) Cryostat for sectioning fresh frozen tissues (left) and FRT tissue section placed on a slide.\n(I) IHC or smRNA-ISH staining followed by imaging.\n(J) FRT tissue showing the lineage traced stratified epithelia using a KRT5-tdTomato shown in red and the co-staining of the section with an antibody against KRT8 specific to columnar epithelium shown in green. Image in J is obtained with an AxioScan imager.\nFresh frozen tissue preparation for immunohistochemistry\nTiming: ∼3 h\nThis protocol is applicable for the lineage traced fresh frozen mouse tissue.\nIsolate FRT following steps 1–7.\nPlace the tissue in 10 mL of 2% PFA solution in a 50 mL Falcon tube, incubate for 1 h at 25°C in a dark place.\nCritical: PFA is highly toxic; avoid contact with skin and eyes. Use suitable protective gloves and a mask.\nRemove the PFA and wash tissue 3 times with 1× PBS and immediately proceed for freezing the tissue.\nKeep ready the freezing apparatus as follows inside a fume hood (Figures 3[href=https://www.wicell.org#fig3]A–3C).\nFill a small icebox 1/4th with dry ice and add an equal volume of isopropanol (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nPlace a small plastic box filled with 5 mL of isopentane on top of isopropanol, incubate for 15 min to cool down (Figure 3[href=https://www.wicell.org#fig3]C).\nRemove tissue from the PBS and dry excess liquid using a tissue pad (Figure 3[href=https://www.wicell.org#fig3]D) (troubleshooting 8[href=https://www.wicell.org#sec6.15]).\nSpread a small amount of OCT medium inside the plastic cryomold.\nPlace the tissue in the cryomold, add OCT medium until the tissue is completely covered (Figure 3[href=https://www.wicell.org#fig3]E).\nPlace the cryomold on top of pre-cooled isopentane in the freezing apparatus and incubate until OCT medium has hardened (Figures 3[href=https://www.wicell.org#fig3]F and 3G) (troubleshooting 9[href=https://www.wicell.org#sec6.17]).",
    "Pause point: Immediately store frozen tissue at −80°C for long-term storage.\nCryosectioning and immunohistochemistry staining of fresh frozen tissue\nTiming: ∼2 h\nCut 5–7 μm thick tissue sections in the cryotome. Place the tissue sections on the “SuperFrost Plus” adhesion slides (Figure 3[href=https://www.wicell.org#fig3]H).\nCritical: Always use SuperFrost Plus Slides.\nAir-dry the slides at a dark place and proceed immediately for smRNA-ISH procedure described in steps 66–82 or step 60 for IHC.\nPause point: Can store for up to one month at 4°C before proceeding to step 60.\nBefore starting IHC, keep the slides inside an oven for 20 min at 40°C.\nWash slides 5 times with 1× PBS for 3 min at 25°C each time.\nUsing a Pap pen circle around the tissue section.\nAdd 50–100 μL of PBS on top of the tissue section to prevent it from drying out.\nRemove PBS and add 50–100 μL of permeabilization solution for 1 h at 25°C.\nProceed for either the one-step IHC procedure described above in the protocol steps 23–36 or the two-step IHC procedure described above in steps 37–40.\nCritical: Use permeabilization buffer instead of IHC blocking solution to prepare primary or secondary antibody dilutions.\nSingle molecular RNA in situ hybridization\nTiming: 3 days\nFor smRNA-ISH, the RNAscope protocol from the ACDBio (https://acdbio.com/sites/default/files/322360-USM%20RNAscope%202.5%20HD%20RED%20Pt2_11052015.pdf[href=https://acdbio.com/sites/default/files/322360-USM%20RNAscope%202.5%20HD%20RED%20Pt2_11052015.pdf]) was adapted with modification for the FRT (Figure 1[href=https://www.wicell.org#fig1]). Following protocol works for both fresh-frozen and paraffinized tissue sections.\nCritical: Autoclave equipments used for the smRNA-ISH protocol. Use sterile filter tips. Work in a place dedicated to RNA work.\nIsolate FRT following steps 1–7.\nProcess intact FRT for paraffinization and sectioning (steps 8–16) or fresh frozen tissue preparation and sectioning (steps 51–59).\nDAY-1\nFollow the same procedure outlined below for both the paraffin and fresh frozen sections.",
    "Bake slides in a dry oven for 1 h at 60°C for the paraffin section and 20 min at 40°C for the fresh frozen sections.\nIn a fume hood:\nCritical: This step is only for the deparaffinized tissue section. For the Fresh frozen section, skip this step\nIncubate the slides 2 times in Xylene for 5 min at 25°C each time.\nIncubate the slides 2 times in 100% Ethanol for 1 min at 25°C each time.\nAir-dry the slides for at least 5 min at 25°C or until completely dry.\nCritical: Xylene causes systemic toxicity by ingestion or inhalation. Use protective gloves and a mask.\nFreshly prepare 1× RNA scope Target Retrieval reagent (refer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nApply RNAscope Hydrogen Peroxide.\nIncubate slides with RNAscope Hydrogen Peroxide for 10 min at 25°C.\nCritical: Make sure that the Hydrogen Peroxide solution covers all the tissue regions.\nKeep the slide on the slide rack and immerse in the beaker containing distilled water.\nWash slides 2 times in distilled water for 5 min at 25°C each time.\nApply RNAscope Target Retrieval Reagents.\nVery slowly submerge the slide rack containing the slides into boiling RNAscope 1× target retrieval reagent solution.\nCover the beaker with aluminum foil and boil the slides for 20 min.\nCritical: Do not boil less or more than 20 min. This step is optimized for the FRT to remove crosslinks, preserve tissue morphology, and efficient target RNA accessibility.\nWash slides 2 times in distilled water for 5 min at 25°C each time.\nWash slides once with fresh 100% EtOH.\nDry the slides completely at 25°C.\nCreate a barrier.\nDraw a barrier 2 times around each section with the Immedge hydrophobic barrier pen.\nCritical: Do not let the barrier touch the tissue section.",
    "Dry slides for 14 h to use the following day.\nDAY-2\nEquilibrate equipment.\nTurn on the HybEZ oven and set the temperature to 40°C.\nPlace a humidifying paper in the humidity control tray and wet thoroughly with distilled water.\nCritical: Warm the tray for 30 min at 40°C before use; keep the tray in the oven when not in use. Do not allow slides to dry in between the incubation and washing steps.\nKeep 1× wash buffer ready (can be prepared on day 1 (refer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] section)).\nPrepare counterstaining reagents, hematoxylin staining solution, and Ammonia water (refer to materials and equipment[href=https://www.wicell.org#materials-and-equipment] section).\nEquilibrate reagents.\nCritical: Remove AMP 1 to 6 reagents from the refrigerator and place them at 25°C.\nCritical: Ensure HybEZ oven and prepared humidity control tray are at 40°C.\nApply RNAscope Protease Plus.\nPlace dried slides on the HybEZ slide rack.\nAdd RNA scope protease plus to cover each tissue section entirely.\nInsert tray with slides back into the oven.\nIncubate at 40°C for 25 min.\nCritical: The duration of 25 min in this step is optimized for the FRT to remove crosslinks, preserve tissue morphology, and efficient target RNA accessibility. Do not change the timings of the incubation period to avoid insufficient or over digestion (troubleshooting 10[href=https://www.wicell.org#sec6.19]).\nWash slides by immersing them 5 times in distilled water.\nHybridization and signal Amplification.\nHybridize probe.\nCritical: Before each use, warm the target and control probes for at least 10 min at 40°C in a water bath or incubator. Swirl gently to mix.\nAdd 3 drops of the appropriate probe to cover each tissue section entirely.\nCover the HybEZ humidity control tray with a lid and insert it into the oven for 2 h at 40°C.",
    "Wash slides two times in 1× wash buffer for 2 min at 25°C each time\nHybridize AMP.\nCritical: During the washing step, always keep the tray inside the oven to maintain the temperature at 40°C.\nAdd ∼2–3 drops of AMP1 to cover each section entirely.\nClose the tray and insert it into the oven for 30 min at 40°C.\nWash slides two times in 1× wash buffer for 2 min at 25°C each time.\nAdd ∼2–3 drops of AMP2 to cover each section entirely.\nClose the tray and insert it into the oven for 15 min at 40°C.\nWash slides two times in 1× wash buffer for 2 min at 25°C each time.\nAdd ∼2–3 drops of AMP3 to cover each section entirely.\nClose the tray and insert it into the oven for 30 min at 40°C.\nWash slides two times in 1× wash buffer for 2 min at 25°C each time.\nAdd ∼2–3 drops of AMP4 to cover each section entirely.\nClose the tray and insert it into the oven for 15 min at 40°C.\nWash slides two times in 1× wash buffer for 2 min at 25°C each time.\nCritical: Do not insert the tray into the HybEZ oven for the rest of the procedure.\nAdd ∼2–3 drops of AMP5 to cover each section entirely.\nIncubate for 45 min at 25°C.\nWash slides two times in 1× wash buffer for 2 min at 25°C each time.\nAdd ∼2–3 drops of AMP6 to cover each section entirely.\nIncubate for 15 min at 25°C.\nWash slides two times in 1× wash buffer for 2 min at 25°C each time.\nSignal detection.\nCritical: Use the Fast RED-B solution within 5 min. Do not expose to direct sunlight or UV light.",
    "Prepare sufficient RED working solution per section by using a 1:60 ratio of Fast RED-B to Fast RED-A (2 μL of Red B to 120 μL of Red A)\nPipette ∼ 100 μL RED solution onto each tissue section.\nIncubate for 10 min at 25°C.\nWash twice with Milli Q water\nCounterstain the slides.\nImmerse slides in 50% Hematoxylin solution for 1 min at 25°C (troubleshooting 11[href=https://www.wicell.org#sec6.21]).\nWash 1 s with Milli Q water.\nWash 5 times with tap water for 3 min each time (sections appear purple).\nReplace tap water in the staining dish with 0.02% ammonia water, incubate for 1 min (Section color turns to blue).\nReplace ammonia water with Milli Q water, wash slides 3 to 5 times\nMounting the samples.\nDry the slides at 60°C inside the dry oven for at least 15 min.\nBriefly dip the slide into fresh, pure xylene and immediately place 1–2 drops of Eco mount on the slide before the xylene dries.\nPlace a coverslip over the tissue section, gently press with the help of the backside of bent forceps to squeeze out excess eco mount, avoid the formation of air bubbles.\nAir dry slides for at least 1 h and store at 25°C until microscopy.\nCritical: Xylene causes systemic toxicity by ingestion or inhalation. Use protective gloves and a mask."
  ],
  "subjectAreas": [
    "Gene Expression",
    "Microscopy",
    "In Situ Hybridization"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}