{
  "id": 3047,
  "origin_website": "Cell",
  "title": "Protocol for Bulk-ATAC sequencing in head and neck squamous cell carcinoma",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of cells for transposition\nTiming: 30 min–1 h\nHarvest the cells.\nPlate adherent cells (namely, Cal33, and FaDu) in 10 cm culture dishes overnight (>16–18 h) and treat with DMSO or JQ1 (1 μM) for 6 h or 24 h (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2590-Fig1.jpg\nFigure 1. Cell morphology was visualized under microscope\n60%–70% confluence of CAL33 cells after JQ1 treatment, this is the best to harvest the cells to avoid changes expression of certain genes in the cells through contact inhibition. Images were taken before harvesting the cells. Scale bar indicates 100μM.\nAspirate media at the end of 6 h or 24 h treatment the media\nWash cells twice with 5 mL pre-warmed PBS.\nAdd 1mL 0.25% Trypsin-EDTA to the plate for a period of 3–5 min.\nStop digestion by adding 5 mL complete medium.\nTransfer the cell suspension to a 15 mL conical centrifuge tube with a pipette.\nCentrifuge at 240–250 g for 5 min at 4°C.\nWash cell pellets twice with ice-cold PBS.\nTransfer the cells to 1.5 mL Eppendorf tube with 1 mL ice-cold PBS.\nTake 20 μL cell suspension and mix with 20 μL 0.4% trypan blue for cell counting.\nPrepare cells for transposition.\nPellet 50,000 or 100,000 viable cells (> 95% live cells) at 500 g at 4°C for 5 min in a fixed angle centrifuge.\nAspirate supernatant carefully avoiding visible cell pellet, using two pipetting steps (aspirate down to 100 μL with a p1000 pipette and remove final 100 μL with a p200 pipette).\nThe cell pellet is ready for transposition.\nTransposition and tagmentation\nTiming: 1 h–2 h\nAdd 50 μL cold lysis buffer (using freshly prepared resuspension buffer from table in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and mix 3 times with a pipette.",
    "Note: Use the lysis and resuspension buffer within 6 h after preparing it, and keep it ice cold on an ice bucket.\nPrepare triplicates of 50,000–100,000 cells each and add 50 μL lysis buffer to each sample at the same time.\nUse one of the triplicate samples to check the nuclei lysis process, and then proceed with the experiment using the remaining duplicate samples.\nIncubate on ice for 3–4 min.\nUse one of the samples to visualize the nuclei under a microscope using trypan-blue staining.\nStop the transposition in the other two samples, once the nuclei become blue but still in a well-kept round shape as visualized in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2590-Fig2.jpg\nFigure 2. Optimization of incubation time for the nuclei digestion\n(A and B) Cal33 and (C and D) FaDu cells were digested for different time points to select the optimum time required for the lysis.\nWash out the lysis buffer with wash buffer (table in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) and invert the tube 3 times to mix.\nNote: Use the wash buffer within 6 h after preparing it, and keep it ice cold on an ice bucket.\nCentrifuge the nuclei at 500 g for 10 min at 4°C at a fixed angle.\nAspirate the supernatant carefully by avoiding nuclei pellet, using two pipetting steps.\nResuspend the cell pellets in 50 μL of transposition mixture by pipetting up and down 6 times.\ntable:files/protocols_protocol_2590_4.csv\nTo be freshly prepared and stored on ice for immediate use\nIncubate the reaction at 37°C for 30 min in a thermomixer set at 1000 rpm to mix the reaction mixture.\nPurify DNA immediately using Zymo DNA clean and concentrator kit. Isolated DNA can be stored at −20°C\nAnalyze the DNA concentration using Qubit ds DNA high sensitivity kit.",
    "Critical: Optimize incubation time based on cell type; over-digestion can result in loss of nuclei and largely affect the yield. The nuclei pellet may not be visible after transposition. (Figure 2[href=https://www.wicell.org#fig2])\nBarcoding\nTiming: 30 min–1 h\nTransfer 10 μL of each cleaned-up transposed DNA sample to a 200 μL PCR tube.\nPrepare an amplification master mix for the barcoding of the transposed DNA.\ntable:files/protocols_protocol_2590_5.csv\nTo be freshly prepared and stored on ice for immediate usage.\nPerform the amplification in a thermocycler using the following cycling conditions.\ntable:files/protocols_protocol_2590_6.csv\nRemove the tubes from the thermocycler and place them on ice. Immediately proceed to the next steps.\nLibraries amplification\nTiming: 1 h–4 h\nMake 10 μL qPCR reactions using the NEB next High Fidelity 2× PCR Master Mix in a 384-well plate. Run all samples, the four standards, and negative control without DNA template in technical duplicate.\ntable:files/protocols_protocol_2590_7.csv\nTo be freshly prepared and stored on ice for immediate usage.\nSeal the plate, mix thoroughly by vortexing, pulse spin to collect sample at the bottom of each well, and run according to the following cycling conditions.\ntable:files/protocols_protocol_2590_8.csv\nAfter the qPCR is complete, use the amplification plot to estimate how many additional cycles are required to obtain a final yield. Calculate the number of cycles based on the cycle number where the fluorescence intensity is 1/4th of the total intensity (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2590-Fig3.jpg\nFigure 3. Evaluating the additional PCR cycle numbers required for ATAC-Library amplification\nqPCR analysis of the partially amplified library for determination of additional cycle. Amplification plot observed for CAL33 after 6 h (A and B) and 24 h (C and D) treatment by DMSO and JQ1 (1μM).",
    "Place the tubes containing the pre-amplification reaction from step 15 (now containing 45 μL) in a thermocycler without addition of any additional reagents. Continue with the PCR with additional cycles.\ntable:files/protocols_protocol_2590_9.csv\nRemove the PCR tubes from the thermocycler and prepare for purification.\nLibrary purification\nTiming: 30 min–1 h\nWarm AMPure XP beads to room temperature (20°C–25°C), and vortex to resuspend.\nFor single left-sided bead purification (to remove primer dimers): Transfer each PCR sample to a 1.5 mL tube, add 1.8× volume (81 μL) AMPure XP beads, and mix 10 times by pipetting.\nIncubate at room temperature (20°C–25°C) for 10 min.\nPlace the tubes in a magnetic rack for 5 min. Discard the supernatant.\nWash the beads with 200 μL of 80% EtOH (freshly prepared).\nRemove as much EtOH possible by pipetting.\nLeave tubes open on a magnetic rack for 10 min and let air dry to ensure that all residual EtOH is evaporated.\nResuspend the beads in 20 μL nuclease-free H2O and mix thoroughly 10 times. Place the tubes in the magnetic rack for 1–5 min.\nTransfer the supernatant to a new tube. Ensure the sample name and the date are marked correctly.\nMeasure the concentration of the libraries using Qubit ds High sensitivity kit and QC the libraries using Tapestation or Bioanalyzer (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2590-Fig4.jpg\nFigure 4. Quantification of size distribution profile of an ATAC-seq library by TapeStation\nThe ladder pattern of ATAC-seq libraries. The band sizes corresponding to ATAC-seq libraries tend to display nucleosomal patterns. The peak height can occasionally vary among different libraries depending on the transposition (A–D.).\nCritical: Do not over-dry beads in step 27 to ensure maximum elution of the fragments. Low yield and more DNA damage will occur if overdried.\nNext generation sequencing and data analysis\nTiming: 1 week",
    "Next-seq platform (Illumina) can be utilized for the sequencing of the libraries. Following the sequencing of the libraries:\nTrim the reads from ATAC-seq samples from the paired-end fastq files for adapter contamination and low quality using Trimgalore (v0.4.3), (https://github.com/FelixKrueger /TrimGalore[href=https://github.com/FelixKrueger%20/TrimGalore]).\nMap the reads to the human genome (hg19 assembly) using BWA (v0.7.15).6[href=https://www.wicell.org#bib6]\nAlign the reads to CPM for the normalized bigwig pileup diagrams using the BamCoverage tool in DeepTools.7[href=https://www.wicell.org#bib7] Keep the bin size to 10.\nPerform the quality controls for ATAC-seq samples including the removal of mitochondrial reads using the R package ATACseqQC.8[href=https://www.wicell.org#bib8]\nCall the differential peaks using MACS2 (v2.0.10) with a q value cutoff 0.059.\nBin the genome into 2 kb segments and compute the coverage of each peak using bedtools (v2.27.1).10[href=https://www.wicell.org#bib10]\nCompute the differential peaks using the R package ChIPseeker.11[href=https://www.wicell.org#bib11]\nGenerate ATAC-seq plots for differential peaks using IGV software.12[href=https://www.wicell.org#bib12]"
  ],
  "subjectAreas": [
    "Genomics",
    "Molecular Biology",
    "Sequencing",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}