{
  "id": 17840,
  "origin_website": "Jove",
  "title": "Invasive Hemodynamic Assessment for the Right Ventricular System and Hypoxia-Induced Pulmonary Arterial Hypertension in Mice",
  "procedures": [
    "The animal protocol was reviewed and approved by the Institutional Animal Care and Use Committee at Fuwai Hospital, Chinese Academy of Medical Science, Peking Union Medical College (NO.0000287). The experimental animals were housed and fed according to the guidelines of animal welfare in China.\nNOTE: Eight- to 12-week-old male C57BL mice were housed in an environment with a 12 h dark/ 12 h light cycle. The PAH mice were housed for 4 weeks under an oxygen concentration of 10%, maintained by an oxygen-controlled hypoxia chamber to induce pulmonary hypertension, and control mice were housed in room air (21% oxygen) under identical conditions. RVP and PAP measurements were performed at the end of the 4 weeks of hypoxia challenge.\n1. Preoperative preparation\nSoak the pressure transducer catheter (size: 1 Fr) in 0.9% saline at room temperature for at least 30 min before the hemodynamic experiment.\nFilter 2,2,2-Tribromoethanol solution with 0.22 μm filter and store in 4-degree refrigerator.\nPrepare cleaned surgery tools and supplies such as gloves for surgery.\nPrepare 10 mL of 1.0% digestive enzyme solution for catheter cleaning.\nConnect the pressure transducer catheter to a pressure-volume system.\nCalibrate the pressure transducer prior to obtaining pressure measurements for each mouse.\n\t\nTurn the calibration knob to 0 mmHg and 25 mmHg to send a verification pressure signal to the data acquisition software and configure the calibration setting in the software.\nTurn the knob to Transducer and adjust the Balance knob to zero baseline.\nSet up a standard stereomicroscope and a temperature-controlled small animal surgical table for body temperature maintenance during the surgery.\nSet up a light illumination system for microsurgery to provide enough light over the surgical area.\n2. Open-Chest surgery and hemodynamic measurement",
    "Anesthetize mice with 250 mg/kg of 2,2,2-Tribromoethanol via intraperitoneal (i.p.) injection. If needed, repeat supplemental doses at 1/3 to 1/2 of the original dose during the procedure.\nRemove chest and neck fur using a shaver and hair removal lotion (Figure 1A, 2A).\nSecure each mouse in the supine position on a temperature-controlled small animal surgical table to help maintain body temperature (37 °C) during surgery.\nClean the surgical site with 70% ethanal.\nOnce anesthesia is in effect, confirm adequate anesthesia induction using a toe pinch.\nMake a midline incision on the neck skin (Figure 1A).\nDissect the skeletal muscle using curved forceps and expose the trachea (Figure 1B, 1C).\nPerform intubation through the mouth using a modified 22 G intravenous sheath catheter. Confirm that the tubing is in the trachea using forceps (Figure 1D).\nConnect the tubing to a small animal ventilator. Calculate and set respiration rate and tidal volume based on body weight according to the ventilator user manual10. For example, set respiration rate to 133/min and tidal volume to 180 μL for a 30 g mouse based on the described calculation.\nSecure the tubing for ventilation using tape.\nConfirm adequate anesthesia induction using a toe pinch.\nMake a midline incision on the chest skin and carefully dissect the chest muscles using a cautery tool (Figure 2B, 2C).\nCut the sternum using scissors across the middle and expose the thoracic cavity (Figure 2D).\nPrevent any bleeding using the cautery tool during the open-chest surgery procedure.\nExpose the right ventricle with retractors (Figure 2E).\nInsert the saline-soaked pressure transducer catheter through a small tunnel created with a 25 G needle into the right ventricle to measure RVP (Figure 2F and Figure 3A, 3C).",
    "Hold the catheter cable and cross the pulmonary valve in a coaxial manner with the pulmonary artery. Observe the pressure waveform and obtain a stable PAP signal (Figure 3B, 3D).\nRecord hemodynamic data using the data acquisition system and software.\nAfter the final measurements, euthanize mice humanely through i.p. injection of an excess dose of 2,2,2-Tribromoethanol solution.\nCarefully remove catheter from the right heart system and place into a 1 mL syringe containing 1% digestive enzyme solution.\nUse distilled water to continuously flush the catheter carefully and store it in the original box.\n3. Data analysis for hemodynamics\nNOTE: The hemodynamic data were recorded and analyzed using analysis software11 (Table of Materials).\nFor each mouse, select at least 10 continuous and stable heartbeat cycles without noise to obtain the average data of RVP or PAP data for each parameter.\nUse Student’s t-test to compare the normal air control and hypoxia groups. NOTE: p < 0.05 was considered statistically significant. Data are presented as the mean ± SD.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}