{
  "id": 3466,
  "origin_website": "Cell",
  "title": "Protocol for establishing a global ischemia model using a 4-vessel occlusion in rats",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTiming: 2 days (overall)\nThe 4-VO model in this protocol involves a 2-day procedure inducing transient forebrain ischemia by permanent coagulation of the vertebral arteries and transient occlusion (10 min) of the common carotid arteries.\nStage I - Permanent occlusion of vertebral arteries (VAs): DAY 1\nTiming: 20 min\nAnesthetize the rat with 5% isoflurane mixed in oxygen at the flow rate of 0.8 L/min in the anesthesia chamber.\nUsing a hair clipper, shave the incision regions on the rat, which includes the back of the head and the front of the neck.\nTransfer the rat to a stereotaxic apparatus, and fix the rat’s head with ear bars (Figure 2[href=https://www.wicell.org#fig2]A) (troubleshooting 1[href=https://www.wicell.org#sec6.1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3042-Fig2.jpg\nFigure 2. Procedures of permanent occlusion of VAs\n(A) The rat’s head was fixed in the stereotaxic apparatus.\n(B) An incision was made vertically on the back head of the rat.\n(C) The paraspinal muscles were separated.\n(D) The alar foramen of the first cervical vertebra (C1) was exposed with a retractor.\n(E) Enlarged images in (D). The black arrows indicate the alar foramen of the first cervical vertebra.\n(F) Bleeding was induced by making a puncture in the left VA. Simultaneously, blood was aspirated by the glass pipette connected to the bench-top vacuum system.\n(G) The left VA was cauterized by electrocoagulation.\n(H) Bleeding was induced by making a puncture in the right VA and cauterized by a Bovie cautery.\n(I) The cauterization of both VAs was confirmed (no bleeding from the VAs).\n(J) Enlarged images in (I).",
    "Note: Adjust the anesthesia machine between 2% to 3% isoflurane for maintenance depending on the rat’s condition; while maintaining 2% isoflurane is recommended during the surgery process, increase it to 3% at the moment when the rat seems not fully anesthetized and then reduce back to 2% once the rat becomes stable.\nApply the eye lubricant ointment to the rat’s eyes.\nApply Betadine to the back of the head, and wipe with alcohol pads (repeat).\nMake an incision up to 2 cm from the base of the skull using a scalpel blade (Figure 2[href=https://www.wicell.org#fig2]B).\nSeparate the paraspinal muscles from the midline with scissors and find the base of the skull and alar foramen.\nExpose the left and right alar foramen of the first cervical vertebra (C1) by scrapping the muscles and connective tissues from the alar foramen with forceps (Figure 2[href=https://www.wicell.org#fig2]C).\nSeparate the skins and muscles to the left and right with a retractor (Figure 2[href=https://www.wicell.org#fig2]D).\nInsert a stainless-steel probe vertically through the inside of the foramen and induce bleeding by making a puncture in the VA (Figures 2[href=https://www.wicell.org#fig2]E and 2F) (troubleshooting 2[href=https://www.wicell.org#sec6.3]).\nAlternatives: A syringe with a needle (26 Gauge) can be used instead of a stainless-steel probe.\nWhen bleeding occurs from the artery, aspirate blood to clear the surgical region with a glass pipette connected to a benchtop vacuum valve and cauterize the VA with a Bovie cautery (Figures 2[href=https://www.wicell.org#fig2]F and 2G).\nTo confirm that the artery is completely occluded, insert a stainless-steel probe a few times to the cauterized spot and ensure there is no bleeding from the cauterized artery (troubleshooting 3[href=https://www.wicell.org#sec6.5]).",
    "Note: Perform steps 10‒12 on one side of the VAs and then the contralateral side (Figures 2[href=https://www.wicell.org#fig2]H and 2I). These steps are the most critical and challenging part to block blood flow from the VAs. If the VAs are not completely occluded, the results of the global ischemia will be variable and lack robustness.\nAfter cauterization of both VAs (Figure 2[href=https://www.wicell.org#fig2]J), close the wound with a clip applier.\nAlternatives: A suture can be used instead of wound clips.\nLooping of bilateral common carotid arteries (CCAs): Immediately after the permanent occlusion of VAs\nTiming: 10 min\nTransfer the operated rat onto a surgical board with a heating pad and continue anesthesia.\nApply the front neck with Betadine, and wipe with alcohol pads (repeat).\nMake a midline vertical skin incision of about 1.5 cm.\nSeparate the fat, connective tissues, and sternocleidomastoid muscle around the trachea.\nUnder the microscope, isolate the CCA from the nerves and veins surrounding them (Figures 3[href=https://www.wicell.org#fig3]A and 3C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3042-Fig3.jpg\nFigure 3. The procedure of looping of bilateral CCAs\n(A) The right CCA was isolated.\n(B) A knot was made by looping the right CCA loosely using a 4‒0 silk suture.\n(C) The left CCA was isolated. (C′) The left CCA is next to the trachea.\n(D) A knot was made by looping the left CCA loosely using a 4‒0 silk suture.\n(E) The knotted sutures were covered with tissues and skin.\nPass one end of the silk suture underneath the CCA and make a knot as in Figures 3[href=https://www.wicell.org#fig3]B–3D. Put the knotted sutures inside the skin (Figure 3[href=https://www.wicell.org#fig3]E).\nClose the incision region with clips and clean it.\nFollow the post-operative care as described below.\nNote: Rats may be fasted overnight in order to maximize the condition of glucose deprivation.\nStage II - Transient occlusion of CCAs: DAY 2",
    "Timing: 15 min\nAnesthetize the rat in an anesthesia chamber.\nTransfer the rat to the surgical board.\nInsert the rectal temperature probe to monitor the rat’s body temperature.\nRemove wound clips from the incision region of the front of the neck and open the wound.\nFind the knotted sutures placed around each CCA. Clean each CCA with the forceps to avoid any unknown debris being clasped together with CCA in the next step.\nClasp bilateral CCAs using two vessel clamps per each CCA (troubleshooting 4[href=https://www.wicell.org#sec6.7] and 5[href=https://www.wicell.org#sec6.9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3042-Fig4.jpg\nFigure 4. The pupil’s dilation during 4-VO\n(A) Scores according to the pupil’s dilation size.\n(B and C) The rat’s pupil dilation (white dotted line) is of a score of 1 (B) and a score of 4 (C).\nAlternatives: The vessel clamp can be used once per CCA.\nNote: Remove the rat from the nose cone and anesthesia. Do not leave the animal under the anesthetic condition; immediately keep the rat far enough away from the anesthesia equipment. In this way, you will be able to discern that the rat is unconscious as a result of the 4-VO and not by anesthesia.\nNote: Count for 10 minutes and measure the pupil’s dilation score every minute (must lose righting reflex after CCAs occlusion if the animal undergoes global ischemic condition, Figure 4[href=https://www.wicell.org#fig4]).\nCritical: It is possible that respiratory failure occurs within ∼3 seconds after clipping of CCAs (Details of the symptoms are shown in Methods video S1[href=https://www.wicell.org#mmc1]) in some animals. This phenomenon usually occurs for 1 min and the animal starts breathing again after but remains unconscious for 10 min. The pupil dilation reaches score 4 at the moment that breathing is stopped and slowly gets back to score 1–2 during the remaining time. This condition can be considered as severe ischemia.",
    "After 10 min, remove the vessel clamps, close the incision region with a clip applier, and clean it.\nFollow the post-operative care as described below.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Condition of the animal after clasping bilateral CCAs (an episode of 4-VO), related to step 27\n    \nPost-operative procedures and care\nTiming: 15 min\nThis step is performed every time after surgery is finished.\nApply lidocaine ointment to reduce pain in the incision regions and administrate flunixin meglumine (2.2 mg/kg), the non-steroidal anti-inflammatory analgesic agent to the operated rat.\nAlternatives: Carprofen, ketoprofen, and meloxicam (non-steroidal anti-inflammatory drugs, NSAIDs) can be used instead of flunixin. These agents may have the duration of analgesic action up to 24 hours. Therefore, they can be injected once daily for three days.\nPlace the operated rat in an empty cage under a heating lamp and monitor it every 5 min until recovered from the anesthesia. Return the rat to the home cage (troubleshooting 6[href=https://www.wicell.org#sec6.11]).\nPut hydrogels and feed on the cage bottom."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Behavior",
    "Cognitive Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Ecology & Environmental Biology"
  ]
}