{
  "id": 4648,
  "origin_website": "Bio",
  "title": "Membrane Flotation Assay",
  "procedures": [
    "Huh7.5 or HCV replicon cells are grown in DMEM supplemented with 10% FBS, 1x Pen/Strep, 1x Glutamine for 4-5 days from 20% to a 80% final confluency in T175 flasks (will need 5 flasks per cell type). The medium for HCV replicon cells is additionally supplemented with 800 μg/ml of G418.   Cells are harvested by washing once with 10 ml of PBS (add PBS to flask, agitate by hand 2-3 times and aspirate PBS off), then trypsinized with 4 ml of trypsin per T175 flask (incubate cells with trypsin at 37 °C for 3-5 min, take off cells with 6 ml of PBS by washing the walls of the flask and transferring to a 50 ml cornical tube). Cells are spun down for 5 min at 400 x g, the supernatant is aspirated off, and cells are washed once with 30 ml PBS by resuspending cells in PBS and spun down again for 5 min at 400 x g, then resuspended in 10 ml PBS, and counted in a hematocytometer. A total of 3 x 107 cells for each sample are resuspended in 3.5 ml pre-chilled PBS/Sucrose plus protease inhibitor cocktail (diluted 1:100) and immediately stored on ice.   The cells are lysed with 200 passages in a tight-fitting dounce homogenizer, while keeping the homogenizer on ice.  Note: Be careful not to lift the pestle above the surface of the lysate to minimized creation of air bubbles.   Check that cells are over 90% lysed by mixing 10 μl of the lysate with 10 μl Trypan Blue stain, then checking the sample in the microscope. Dead cells will be stained blue. If not enough cells are lysed, lyse cells with additional passages in the dounce homogenizer, and check every 50 passages that cell lysis was successful.",
    "The cell lysate is spun at 2,500 x g for 10 min at 4 °C to pellet cellular debris and nuclei.    Transfer the supernatant (referred to as crude lysate) to a fresh tube and keep on ice.    Measure total protein concentration in the crude lysate using Bio-Rad Protein Assay according to the manufacturer’s protocol.   Take 5 mg of protein for each sample and add PBS/Sucrose to a total volume of 2 ml. Freeze the rest of the crude lysate mixed 1:1 with 2x Laemmli buffer as a control.   Mix 2 ml of sample 1:1 with 2 ml of 60% iodixanol (pre-chilled at 4 °C) to get 4 ml of sample at a final concentration of 30% iodixanol.   Put the 4 ml of 30% iodixanol/lysate mixture on the bottom of a centrifuge tube. Overlay carefully with 4 ml of 20% iodixanol (pre-chilled), then overlay with 4 ml of 10% iodixanol (pre-chilled). Then fill the tube with 10% until the level reaches 1 mm below the rim of the centrifuge tube. (Overlay with a P1000 pipette by cutting off 1 cm of the pipette tips, then pipette slowly 1 ml at the time right into the middle of the centrifuge tube right on top of the gradient level, to minimize mixing.) Make sure the tubes are balanced well for centrifugation, add carefully 10% Iodixanol on top to balance tubes if necessary.   Spin at 209,000 x g (35,000 rpm) overnight (16 h) at 4 °C in an SW41T rotor.   Next day: Collect 22 fractions (500 μl) each from top to bottom.",
    "Use cut off pipette tips of P1000 and carefully take off 500 μl from the middle by just touching the pipette tip to the surface of the gradient, then lowering the tip slowly to stay right at the surface of the gradient while taking off the sample very slowly. The increased width of the pipette tip decreases a whirlpool effect and minimizes mixing of the gradient layers.    Mix fractions 1:1 with 2x Laemmli buffer, and freeze, preferable in aliquots, at -80 °C.    Samples can then be analyzed via SDS-PAGE and Western blots [see results in Vogt et al. (2013)]."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}