{
  "id": 10340,
  "origin_website": "Jove",
  "title": "Standard Test Method ASTM D 7998-19 for the Cohesive Strength Development of Wood Adhesives",
  "procedures": [
    "1. Preparation of substrates\nUse a substrate surface that is suitable for the application. For wood, use a sliced veneer of about 0.6 to 0.8 mm thick from a reliable producer because these veneers are used for plywood and laminated veneer lumber (LVL) manufacturing. These are obtained from a veneer supplier, as sheets of 0.6 to 0.8 mm thickness and cut into 305 mm on a side. A consistent substrate is a hard maple (Acer saccharum) face veneer because of its surface smoothness and consistent thickness, and it is a diffuse porous and high modulus hardwood. Maple face veneers are commonly used in cabinetry construction and are usually free from defects.\nCondition the wood, unstacked, at 21 °C and 50% relative humidity (RH) for at least a day prior to use. Avoid veneers that are excessively wavy, have an uneven surface, and contain defects including discoloration.\n\tNOTE: Other wood species can be used to understand the bond performance of the adhesive with these species. However, diffuse-porous hardwoods and softwoods with a gradual earlywood-to-latewood transition are recommended for their uniformity. Take care because wood can be acidic or basic or have extractives on the surface that can alter the adhesive curing process. In addition, the processing of the tree from time of cutting to the veneer production can alter the bond strength12,13. Because the ABES uses a small amount of wood, it is less affected by wood variations that occur with other tests, such as wood moisture content and veneer check depth.\nEnsure that the sides of the veneer are free of any loose fibers along the edge and the bonded product does not have any significant adhesive squeeze out as these will tend to overestimate the bond strength since there is no post bonding modification of the samples.",
    "2. Preparation of specimens\nCondition the wood specimens at 21 °C and 50% RH for at least a day. Check the veneer for any cracks, discoloration, or grain irregularities to be avoided when cutting the specimens.\nMake sure that the pneumatically driven specimen cutting device is operational.\nUse a special die cutter that cuts the required specimen size of 20 mm by 117 mm from 0.6 to 0.8 mm thick maple veneer (Figure 1, Table of Materials).\n\t\nPlace a piece of veneer, at least 150 mm by 300 mm, under the cutting blades so that the veneer grain is parallel with the long direction and depress the air pressure button to cut each piece of wood of 20 mm by 117 mm.\nMove the piece of veneer under the cutting blades to an uncut area and depress the button again to cut another piece of wood. Continue until the piece of veneer is completely cut into pieces.\n\t\tNOTE: If the long direction of the specimen is not parallel with the grain direction, during a test early fracture can occur in the wood away from the bonded portion.\nFor materials other than wood, cut the specimens using the appropriate techniques. If the material cannot be cut with the specimen cutter, use whatever will cut the material to cut it to the required size. Due to the small bonding area, it is important that cutting be accurate and the specimens free of debris along the edges and on the bonding surfaces.\n3. Operability of the equipment",
    "For the bonding process, make sure that the ABES equipment is operating properly according to a standard operating procedure11. The settings on the front of the ABES unit for bonding and breaking samples are: LP Press 0.2 MPa, HP Press 0.2 MPa, Pull 0.65 MPa, and Cool Air 0.2 MPa.\nUse air supply pressure of at least 0.62 MPa (90 psig) because pressure that is too low will cause the gripping clamps and platens to close too slowly or unevenly on the sample resulting in incorrect bond strengths (Figure 2, top).\nClean the platens of any adhesive resulting from squeeze out from the prior sample. Adjust the temperature of the platens to the desired temperature and equilibrate before bonding samples.\nTo bond wood, operate the equipment in a room that is at 21 °C and 50% RH. If this is not possible, keep the conditioned specimens in a plastic bag until bonding because of the rapid change in wood moisture due to the small size of the specimens.\nFor obtaining kinetic cure data, design the method such that the mechanical and electronic speeds are sufficient to collect data accurately as outlined in ASTM D7998-1911.\n4. Bonding of specimens with the adhesive\nNOTE: The application of the adhesive is a critical issue for wood adhesives because of the wide variation in viscosity and percent solids going from a lamination adhesive as in plywood to a spray able adhesive for binder applications. Wood adhesives are generally water-borne so evaporation is only a minor problem. However, water soaking into the porous wood is important.",
    "Spread 5 mg of the adhesive being studied over the terminal 0.5 cm sufficiently to cover the bonding area and transfer to the other specimen but without excessive squeeze out. To obtain a relatively constant adhesive spread rate, tare the wood specimen on a balance and re-weigh after adhesive application.\nExercise great care in distributing the adhesive, overlapping the specimens and making sure the two specimens are aligned, since a small bonding area is used and strengths are determined as the pull force over the bonded area (Figure 2 bottom). Different bonding areas can be used, but the strength is not necessarily comparable due to variation in the mechanics of lap shear tests.\n\tNOTE: The literature recommends several ways to apply the adhesive to the wood depending on the adhesive consistency. The originally recommended adhesive application method used a purpose-designed microspraying device10, but this was found to be messy, slow, and very dependent on the adhesive rheology. Although this method applied the adhesive as discrete dots as used in binder applications for particleboard and oriented strandboard, a printing method seems more reliable14. The micro-pipette application method can supply a reproducible volume of adhesive10, but it is somewhat difficult to distribute evenly. The spatula method has worked the best for obtaining an even distribution of the adhesive on the bonding area, and a microbalance for obtaining a measured amount is recommended11.\nFinal strength data",
    "Bond the specimens at 120 °C for 2 min and condition them overnight at 21 °C and 50% RH since the hot pressing during bonding dries out the wood. To bond the wood, lock a sample in place by closing the grips on the ABES tester, making sure that the sample is aligned with the tester. Then press the start button on the machine to have the 120 °C platens press on the overlapped section for 2 min, before retracting the platens and loosening the grips so that the samples can be removed.\n\t\tNOTE: The time and temperature for curing are dictated by the application and adhesive chemistry. The bonding temperature and time should be optimized so that the strength reaches the highest plateau by using different bonding temperatures and times to determine conditions for maximum strength. For wood bonds, testing dry shear strength is valuable, but wet testing is generally more critical to determine adhesive durability and requires a 4 hour room temperature soak of the sample in water.\nFor testing, lock a sample in place by closing the grips on the ABES tester making sure that the sample is aligned with the tester. Then by pressing the start button, the instrument pulls on one end through a servodrive while the other end of the sample pulls on a load cell attached to the grips. This pulling continues until the bond breaks. The computer records the maximum force the sample can withstand, which is recorded as bond strength.",
    "Use the same procedure for the dry and water-soaked samples. In measuring the breaking force, take care to ensure that the grips hold the wood tightly because if the adhesive is very strong, the wood might slip. If the sample breaks outside the bonded area, discard the value since this is measuring the wood strength, not the adhesive.\nKinetic strength development\n\t\nDetermine the rate of strength development of an adhesive to estimate the press time required for large scale products. Follow the same procedure as in step 4.3, except vary the temperature and time. Begin the testing of strength at 100 °C platen temperature, using bonding times of 10, 30, 60, 90, 120, 150, 180, and 210 seconds. Subsequently, raise the temperature by 10 °C, and repeat the bonding times until there is no longer any linear section of strength versus time at the low bonding times.\nAfter bonding, retract the platens and use the air cooling feature of the ABES to cool the sample to near room temperature and then measure the sample strength. By starting at a low pressing time and increasing first the time for subsequent samples, collect the strength versus time data until increasing time results in little or no increasing strength. Then doing the same sequence at higher temperatures will yield the resulting plot of strength versus time and the cure rate as the slope (Figure 3).",
    "NOTE: The phenolic adhesive data in Figure 3a10 shows the effect of temperature on the strength development at different times. Figure 3b shows the regressed isothermal strength development rate versus temperature. To obtain the isothermal strength development, the sample was cooled before testing. A few adhesives, such as urea formaldehyde15, have an optimum bonding time and temperature before degradation starts to take place. This method can detect this problem and determine optimum conditions.\nHeat resistance\n\t\nIf the product needs to meet a certain temperature resistance, clamp the bonded sample into the ABES unit. After the platens are heated to that temperature, for example 220 °C, above which wood starts to degrade, close them onto the pre-bonded sample for 2 min and then open to measure the bond strength as in 4.3.2 to determine any thermal softening of the adhesive compared to the bonding temperature of 120°C.\nRepeat this test except that the platens are closed on the sample for 30 min and then tested for strength to determine strength if the adhesive is thermally degraded. Release of the platens and testing strength will determine the heat resistance of the sample compared to the value before heating. This type of procedure was used to test wood adhesives16. Since the ABES uses rapid heating and can measure strength while hot without moving the sample to another machine, it can be used to differentiate between the two modes of failure (i.e., thermal softening or degradation). Thermal softening produces strength loss immediately upon heating, and is typically recoverable. Chemical degradation occurs gradually over time at high temperature and does not recover mechanical strength on cooling.",
    "NOTE: Adhesive manufacturers need to differentiate whether strength loss is from thermal softening or chemical degradation, because these problems require different solutions. There are many methods which can measure softening transitions including other thermal analyses, but they do not distinguish between a change in mechanical properties and chemical structure.\n5. Image analysis of failed bonding surface\nBecause the main objective is to determine the adhesive strength or rate of cohesive strength development, make sure that failure is within the adhesive and not with adhesion to the substrate (Figure 4) or substrate failure. If substrate failure occurs, then the adhesive has sufficient strength. Alternatively, cohesive failure in the bulk adhesive indicates adhesive weakness. However, deciding between adhesion and adhesive interphase failure can be difficult17. A variety of methods have been developed for wood analysis18.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}