{
  "id": 5981,
  "origin_website": "Bio",
  "title": "Assaying Thermo-nociceptive Behavior in <em>Drosophila</em> Larvae",
  "procedures": [
    "All fly stocks were maintained at 25 °C and 70% humidity with a 12 h dark/light cycle on standard fly food. All experiments were performed using 3rd instar larvae at 96 h (hours) after egg laying (AEL). In order to ensure that all larvae were about the same age, the egg laying was restricted to 4-6 h. Experimental crosses were raised on standard fly food at 25 °C with 70% humidity and a 12 h light/12 h dark cycle. Prepare your genetic crosses 2 days before staging with approx. 20-30 virgins and 10-15 males each (more if you are using weak genotypes). After 2 days, transfer flies to a fresh food vial for timed egg-laying for 4-6 h at 25 °C (Figure 2A). Transfer the adult flies to a fresh vial (for another round of staging on the same or next day). The original vial is maintained at 25 °C until 96 ± 3 h AEL. All larvae should be in the third instar (L3) foraging stage and not yet leave the food (Figure 2B).Note: Precise staging is important, as nociceptive responses of larvae are reduced after 120 h AEL, likely due to the transition to the wandering stage and preparation for pupariation. The density of larvae in the food will also affect staging: too few animals cannot efficiently process the food, while having too many larvae will result in competition for food, both of which is affecting developmental progression and will broaden the developmental stage of the larval population.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180210/20180210235539_7127.jpgFigure 2. Correct staging and larval density. A. Photograph of appropriate embryo numbers for the used vial size (approx. 100-150 embryos laid within 4-6 h). B. At 96 h AEL, larvae should have processed the food well and still be in the foraging stage.",
    "Prepare the hot probe by dialing at the desired temperature (generally 46 °C) and wait until it stabilizes (5 min).Distribute 250 µl of dH2O on a 2% agar plate to create a thin water film, which enables the animals to crawl freely and perform their rolling behavior (Figure 3C). Without water, the larvae are not fully mobile and do not display consistent behavioral responses.Note: the water film evaporates over time which can affect the behavioral response. Replace the plate after every assay. The setup should be placed in a vibration free environment under the stereoscope, as vibration can affect nociceptive behavior.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180210/20180210235621_8758.jpgFigure 3. Larval transfer and water film on agar surface. A and B. The assay is prepared by gently placing 10-20 staged 3rd instar larvae on a 10 cm 2% agar plate using a brush. C. A thin water film of 0.25 ml (colored magenta for illustration) is necessary for consistent behavioral responses.Prepare about 20 staged larvae by washing in dH2O to remove any residual food and place them gently on the agar plate using a brush (Figures 3A and 3B). Let the animals acclimatize for at least 1 min.Place the agar plate with the larvae under a stereoscope connected to a camera. Start videotaping using the mounted camera and a capturing software (e.g., Streampix) using avi-format (25 frames per second) so the reaction to the hot probe can be analyzed offline by video (Figures 4A and 4B). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180210/20180210235706_6924.jpgFigure 4. Thermo-nociception setup. A. The thermo-nociception assay requires a stereoscope, connected to a camera and white light illumination light source. B. Larvae are placed on a freshly prepared agar dish with water and tested for thermo-nociceptive responses using the hot probe.",
    "Touch a forward locomoting larva with the 46 °C hot probe laterally on abdominal segment 4-6 at a 45° angle (Figures 5A and 5B). Typically, larvae react with a stereotyped rolling escape response within less than 10 sec. Keep the hot probe in direct contact with the larva for at least 10 sec or until it performs the rolling behavior. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180211/20180211000448_4259.jpgFigure 5. Procedure for hot probe positioning. A. Schematic depiction of how to apply the hot probe laterally on abdominal segment 4-6 at a 45° angle. B. Still frame of an actual video showing the position where the hot probe should touch the animal.Remove the animal directly after testing to avoid double sampling.Stop videotaping and proceed with the next batch of animals or video analysis. For each experiment, sample a minimum of 60 larvae to get sufficient statistical power."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}