{
  "id": 11203,
  "origin_website": "Jove",
  "title": "Use of Human Perivascular Stem Cells for Bone Regeneration",
  "procedures": [
    "1. Perivascular Stem Cell Isolation\nThis is described in details in the adjacent article \"Purification of Perivascular Stem Cells from Human White Adipose tissue\", by M. Corselli et al.\n2. Scaffold Creation\nScaffolds are custom-made per previously published protocol from poly(lactic-co-glycolic acid) (PLGA, Burmingham Polymer) with hydroxyapatite coating4-6. Apatite-coated PLGA scaffolds are fabricated from 85/15 PLGA by solvent casting and a particulate leaching process. Scaffolds are created in a spherical shape (2-mm diameter) for muscle pouch implantation, a discoid shape (4 mm in diameter) for calvarial implantation, or cylindrical (4 mm in diameter, 6 mm in length) for femoral segmental defects.\nBriefly, PLGA/chloroform solutions mixed with sucrose (polymer/sucrose ratio 5/95, w/w) are cast into a 200-300-μm diameter Teflon mold to create the custom-made construct. After freeze-drying overnight, scaffolds are removed from the Teflon mold and immersed in ddH2O to dissolve the sucrose. Scaffolds are disinfected by immersion in 70% ethanol for 30 min, followed by three rinses of ddH2O.\nFor apatite coating, a simulated body fluid (SBF) solution is prepared by sequentially dissolving CaCl2, MgCl2•6H2O, NaHCO3, and K2HPO4•3H2O in ddH2O. Solution pH is lowered to 6 by adding 1M hydrochloric acid to increase the solubility. Na2SO4, KCl, and NaCl are added and the final pH is adjusted to 6.5 (SBF 1).\nMg2+ and HCO3- free SBF (SBF 2) is prepared by adding CaCl2 and K2HPO4•3H2O in ddH2O and pH is lowered to 6. KCl and NaCl are added and the final pH is adjusted to 6.8. All solutions are sterile filtered through a 0.22 μm PES membrane (Nalgene). Immediately prior to the coating process, the dried PLGA scaffolds are subjected to glow discharge argon plasma etching (Harrick Scientific) to improve wetting and coating uniformity.",
    "Etched scaffolds are then incubated in SBF 1 for 12 h and changed to Mg2+ and HCO3- free SBF 2 for another 12 h at 37 °C under gentle stirring. Coated scaffolds are washed with ddH2O to remove excess ions and lyophilized prior to further studies.\n3. The Muscle Pouch Model Implantation\n100 μl of a PSC suspension in PBS (phosphate buffered saline) are gently dropped onto the spherical PLGA-based implant immediately prior to implantation. Cells have been pre-labeled by lentiviral insertion of Firefly luciferase, so as to permit in vivo tracking post implantation. Cell density is 2.5 x 105 per implant.\nSCID (severe combined immunodeficient) mice are used at 6 weeks of age. Animals are anesthetized by isoflurane inhalation and premedicated with buprenorphine (Bedford Labs). After standard Betadine preparation, bilateral incisions in the hindlimbs are made (longitudinal and 2 mm in length).\nPockets are cut in the biceps femoris muscles by blunt dissection parallel to the muscle fiber long axis. For each mouse, the PLGA-based implant with PSCs is inserted, and the fascia overlying the muscle is sutured with 5-0 Vicryl (Ethicon).\nThe skin is next closed with 5-0 Vicryl in a subcuticular pattern. Animals are treated postoperatively with buprenorphine for 48 hours and TMP/SMX (Trimethoprim/ Sulfamethoxazole; Qualitest) for 10 days.\n4. The Calvarial Defect Model Implantation\nAfter isoflurane anesthesia of SCID mice (12-14 weeks old), the hair is clipped and the skin disinfected with betadine per protocol.\nA 8-mm skin incision is made along the mid-sagittal suture of the mouse calvarium. Next, the calvarial periosteum is gently removed by Q-tip application.\nNext, using diamond-coated trephine bits in a high-speed dental drill, a 4-mm parietal bone defect is created. The defect is full thickness - however care is taken not to injure the underlying dura mater.",
    "The custom-made PLGA-based implant with engrafted PSCs is then placed gently in the defect site. Cell density is 2.5 x 105 per implant. Finally, the skin is sutured with 6-0 Vicryl. Animals are treated postoperatively with buprenorphine for 48 hours and TMP/SMX for 10 days.\n5. The Femoral Segmental Defect Model Implantation\nAthymic rats (12-14 weeks old) are anesthetized under isoflurane inhalation. The femur is scrubbed and prepared per standard protocol with betadine (Figure 1).\nA 27-30-mm longitudinal incision is made over the anterolateral aspect of the femur. The femoral shaft is then exposed by separating the vastus lateralis and biceps femoris muscles (Figure 2).\nTo maximize consistency of bone regeneration, the periosteum overlying the femoral defect is completely removed with the resected femoral segment.\nA polyethylene plate (length, 23 mm; width, 4 mm; height, 4 mm) is placed on the anterolateral surface of the femur. The plate contains six pre-drilled holes to accommodate 0.9 mm diameter threaded Kirschner wires (Zimmer). Taking the plate as a template, six threaded Kirschner wires are drilled through the plate and both cortices (Figure 3).\nNext, with a small oscillating saw blade (Stryker, MI), a 6-mm mid-diaphyseal defect is created. Segmental defects are then treated by the insertion of PLGA based implants which have been laden with cells as per protocol (Figure 4).\nThe overlying muscle and fascia are closed with 4-0 Vicryl absorbable sutures to secure the implant in place, and the skin is sutured.\n6. In Vivo Assessments",
    "Radiographic assessments are performed in a longitudinal manner by both high resolution XR and high resolution μCT (micro computed tomography) analysis. For μCT analysis (Skyscan 1172F), images are scanned at a resolution of 19.73 μm (100 kV and 100 mA radiation source, using a 0.5 mm aluminum filter). Images are analyzed using DataViewer, Recon, CTAn, and CTVol softwares.\nBioluminescence imaging is also done in a serial manner to assess cell engraftment, viability, proliferation and exclude migration out of the implant site. Bioluminescence imaging is performed using an IVIS Lumina II device (Caliper Life Sciences). Light outputs are quantified using Living Image software (Xenogen). Total light output is recorded in photons/second/sq cm/steradian.\nHistological and histomorphometric analysis is performed postmortem. Routine stains employed include Masson's trichrome, aniline blue, pentachrome, and Picrosirius red. Histomorphometric analysis is performed easily with either aniline blue or pentachrome stains, in which osteoid appears dark blue and yellow, respectively. Pixels per high powered field are calculated using the magic wand tool in Adobe Photoshop.\n7. Representative Results\nAs both the calvarial and femoral defects are critical-sized, no significant healing should be expected without treatment with growth factors or exogenous stem cells.",
    "In terms of surgical maneuvers, the muscle pouch dissection should be along fascial planes and thus minimal bleeding should be encountered. Even though the muscle pouch model is performed bilaterally, the mouse should be walking with ease on postoperative day 1. For the calvarial defect, bleeding is encountered but can be soaked with a Q-tip. Extreme care should be taken not to injure the underlying dura mater - as this will interfere with normal healing. For the FSD model, care is taken not to injure the major blood vessels so as not to cause excessive bleeding or the femoral nerve to prevent neurologic damage. Kirschner wires are drilled with gentle pressure so as not to damage the cortical bone in the process.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2952/2952fig1.jpg\nFigure 1. Preoperative preparation for Femoral Segmental Defect (FSD) in Athymic Rats. Male rats (12-14 weeks old) are anesthetized under isoflurane inhalation. The femur is scrubbed and prepped per standard protocol with betadine.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2952/2952fig2.jpg\nFigure 2. Surgical exposure for Femoral Segmental Defect (FSD) creation. A 27-30 mm longitudinal incision is made over the anterolateral aspect of the femur. The lateral aspect of the femoral shaft is then exposed by separating the vastus lateralis and biceps femoris muscles.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2952/2952fig3.jpg\nFigure 3. Fixation for Femoral Segmental Defect (FSD) creation. A polyethylene plate (length, 23 mm; width, 4 mm; height, 4 mm) is placed on the anterolateral surface of the femur. The plate contains six pre-drilled holes to accommodate 0.9 mm diameter threaded Kirschner wires. Taking the plate as a template, six threaded Kirschner wires are drilled through the plate and both cortices. Next, a 6 mm mid-diaphyseal defect is created. Once this is performed, a custom-made scaffold is directly inserted which exactly fits the defect site (not shown).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2952/2952fig4.jpg",
    "Figure 4. Example of Calvarial Defect Postoperative. A 4 mm, circular calvarial defect is created in the right parietal bone in athymic mice. Imaged here is a defect site implanted with PSCs at 8 weeks postoperative. Note the presence of new bone within the defect site."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}