{
  "id": 4326,
  "origin_website": "Bio",
  "title": "Transpharyngeal Exposure of GnRH Neurons",
  "procedures": [
    "Note: Build the apparatus on a mobile metal plate so that the whole apparatus can be moved from the binocular microscope to the upright microscope.    Make 1 liter of aCSF and oxygenate it with 5% CO2 carbogen.    Fill 1 ml syringe with aCSF and keep it on ice (= chilled aCSF).    Turn on the heat pad under the binocular scope.   Prepare the ventilation catheter.   Cut to about 6 cm long.   Bend it with a lighter in the middle at 90 degrees.   Cut it with an angle (45 degrees) at about 0.4 cm from the middle bend.   Attach it to the ventilator tubing.     Prepare a piece of cotton thread, 10 cm long.   Prepare another piece of cotton thread, 10 cm long, and make a loop with it.   Prepare pieces of tape for paws (about 3 cm long each).   Inject the mouse intraperitoneally (IP) with pentobarbital [PB (10 mg/ml); 0.4 mg/10 g body weight].   Place it as soon as possible on the heat pad (pentobarbital evokes hypothermia); and secure it with a piece of tape across the tail as it becomes fully anesthetized.   Place the mouse on its back, its head on one of the stainless steel blocks.  Note: For a right-handed experimenter, the head is on the left, the tail on the right for an optimal drilling angle.   Place the rectal probe and secure it with a piece of tape with the tail on the pad.   Tape the front paws on the block (view in Figure 6 at the end).    Add PB intramuscularly (10 mg/ml) (0.05 ml of each leg).   Place the looped thread behind the front teeth.   Use the second block to pull the thread back and maintain the neck extended; the trachea should bulge a little.   Check the mouse is deeply anesthetized by toe pinching.",
    "Use the suprasternal notch as an inferior boundary and the chin as a superior boundary for the initial incision.   Make a hole in the skin above the suprasternal notch with the small scissors.   Continue the incision along the midline to the chin but avoid cutting the pink (non-furry) skin of the chin itself as this bleeds.   Cut the skin laterally on each side, above the suprasternal notch and towards the cheeks (see Figure 5).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140312/20140312043808_4788.jpg Figure 5. Incisions    Place the subcutaneous ECG electrodes in the right arm and the left leg (lead II) to monitor the heart rate.   Tape all the cables to the metal plate.   Separate the salivary glands with the 2 pairs of forceps and move them to either side to expose the muscles overlying the trachea.   Hold the muscles and dilacerate them above the sternum.   Lift them progressively until reaching the hyoid bone where they can then be cut off.   Expose and hold the conjunctive tissue above the trachea, lift it gently with one pair of forceps and pass the second pair (hold it closed) beneath.   When the forceps tip has passed behind the trachea, separate the tips gently to detach the trachea underneath. Note: Do not lose the sight of the forceps tips because the carotids are very close.   Take the second cotton thread, hold it with the forceps tips and pull it back underneath the trachea.    Prepare a first knot.   Make a hole in the trachea above the first or the second cartilage ring above the sternum with the micro scissors.   Insert the catheter, secure it with the knot.   Tape securely the ventilator tubing on the plate.   Start the ventilator and adjust catheter until the breathing is regular.",
    "Put some glue on the knot, the area the catheter enters in the trachea and on the beginning of the threads to have them well secured.   Cut the threads above the glue to avoid snagging them on the drill later.   Remove the thread from the teeth, tilt the head towards the body, pinch the skin above the scalp with the forceps and make a small incision.   Open the skin to expose the base of the skull, put some glue on the skull and use the jaws to press the head into the stainless steel “pillow” for few seconds. Note: Wiggle the teeth to make sure the head is not moving as loose subcutaneous conjunctive tissue can remain.   Detach the thyroid glands from the trachea and flip each of them on the side.   Cut the trachea above the catheter and as it retracts, the esophagus becomes visible.   Hold the esophagus with the forceps, lift it and cut it.   Lift the trachea and the esophagus together and cut them out with the larynx using the micro scissor.   Cut the digastric muscles with the micro scissor at the level of the tendons on both sides and lift them up towards the lips. Note: Cut as superficially as possible otherwise it will bleed.   Cut the hyoid bone with the bone scissors down the middle and place the central separator at the back of the tongue. Note: This cut is likely to bleed, be prepared to place the retractor very fast; it will apply pressure and help stop bleeding almost immediately.   Cut the soft palate to expose the nasal cavity with the micro scissor.   Make a tiny cotton bud on the tip of a pair of forceps and rub the roof of the nasal cavity to expose the sphenoid bone.   Place the Agricola retractor.",
    "Note: It is likely to touch blood vessels as it opens, do not try to move it around otherwise it will bleed.   Identify the anatomical landmarks: rostrally, the transverse sinus of the sphenoid bone (dark blue about 0.8 mm wide, transversal to the nasal cavity) and caudally, the bone junction (thin white line, transversal to the nasal cavity, at the end of it).   Make a bigger cotton bud on the forceps and on one side, break the internal pterygoid process by applying a constant pressure and rolling motion towards the bone (the right side, closest to the experimenter gives a better access).  Note: Control this motion carefully as the bone may break suddenly and  cause major bleeding; minor bleeding is still possible without a sudden break, check it slowly before releasing the pressure of the cotton bud.   Prepare about 10 balls of bone wax (about 0.5 mm diameter) and pick up the first one with the forceps.   Start drilling caudally to the transverse sinus of the sphenoid bone and move very slowly rostrally.   Drill superficially, not more than the depth of the drill head, and only drill horizontally.   Stop as often as possible using the size of one drill head as a measure of progress, add one ball of bone wax and pack it with a mini cotton bud to infiltrate the bone layers. Add more balls of bone wax as needed until the sinus is well clogged.   Continue drilling rostrally using the hard palate above as a landmark.   Start drilling caudally stopping before the bone junction.   Start drilling vertically and slowly to thin the bone until it becomes transparent.  Note: The red microvasculature on the white optic chiasm is visible through the thinned bone, the sides are lined by the posterior communicating arteries, bulging further on the right side.",
    "Wash thoroughly the whole surgical area with aCSF and the 23 G-needle dental vacuum before removing the thinned bone and exposing the brain.    Make sure to remove all remaining wax, bone dust and fur that could contaminate the exposed brain area.   Grip the side on the thinned bone with the needle hook, lift it up to break it and remove the bone fragment.   Repeat these steps until the optic chiasm is exposed and the very end of the optic tracts are visible. Note: Keep the hook pointing towards the midline to avoid touching the posterior communicating arteries; do not hook anything on the front edge of the cavity as the posterior communicating arteries join at the front to circle the optic chiasm.   Inject chilled aCSF under the meninges wrapping the optic chiasm to stiffen both the meninges and the optic chiasm, and fill the whole cavity with the remaining chilled aCSF.   Bring the 23 G-needle dental vacuum vertically and perpendicularly into the hole and suck out the optic chiasm at the center, lift it and progressively tear apart the meninges that are pulled with it on both sides and caudally with the tip of the #5 forceps.   Progress rostrally towards the optic tracts being pulled; pinch them to cut them.   Switch to a 30 G-needle dental vacuum to take the remaining meninges; the exposed cavity is about 2.0 mm long and 0.8 mm wide.   Place the aCSF inflow through a catheter, up in the surgical area (home-made magnetic holder on the plate) to avoid drops.   Place the 23 G-needle outflow as close as possible from the surface of the brain in the rostral side of the exposed area (home-made magnetic holder on the stainless steel “pillow”).   Move the apparatus under the microscope and visualize the GnRH neurons under blue fluorescence.",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140312/20140312044218_2352.jpg Figure 6. Apparatus"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}