{
  "id": 8145,
  "origin_website": "Bio",
  "title": "Maize Kernels – Fixation in FAA, Embedding, Sectioning and Feulgen Staining",
  "procedures": [
    "Fixation in FAAAliquot FAA fixative in glass vials (~20 ml vials, 10 ml fixative). Keep vials on ice, fixative should be cold when you put tissue in. Cut tissue with a scalpel or razor blade into pieces, that have at least one dimension smaller than 2 or 3 mm, and immediately immerse in cold fixative. Note: When cutting the tissue take into consideration the type of sections you wish to obtain.Place open vials with fixed material in the vacuum desiccator and expose them to moderate vacuum for 15 min to pull the air out of the tissue. If the tissue doesn't sink when you release vacuum, apply and release the vacuum one more time. After vacuuming, replace fixative in vials with fresh fixative.Fix overnight at 4 °C (refrigerator).Dehydration in a series of TBAKeep pure TBA (1 L) in a warm place before use (e.g. on the top of an incubation oven), it freezes below 25 °C. Prepare dehydration solutions and store solutions a – e on room temperature (RT) and f – h on the incubating oven. Dehydrate tissue in each step for an hour to one day, depending on tissue size (6 DAP maize kernels for half a day, 12 DAP maize kernels for one day each step). Steps with dehydration solution a – e should be on RT, steps f – h in the incubation oven at 56-60 °C.Use a plastic Pasteur pipette to pull the old solution from the vial, then replace with equal amount of next solution (you need a relatively much larger volume of dehydrating solution compared to your sample). Mark dehydration progress on the label on vial. Alternatively, you can pour the old solution out of the vial and replace with a new one (you don't need to completely drain the vial).",
    "Work in a fume hood. In the last change of TBA, fill the vial only to the half of the vial volume, so that you will leave enough room for the adding of the Paraplast Plus in the next step. Embedding in paraffin (Paraplast Plus)Keep molten Paraplast Plus and plastic pipettes in the incubation oven at 56-60 °C. You need a large stock of molten paraffin, because it takes a long time to melt (e.g. two rectangular histology staining dishes holding ~300 ml).Add pellets of Paraplast Plus wax in vials half filled with TBA. Alternatively, you can add equal volume of molten wax to the TBA in the vials. Paraplast Plus has a fine structure and additives (DMSO), which help in better penetration into the tissue, which is very important for trouble-free sectioning. Keep in 56-60 °C oven, with the vial cap attached and mix a few times, when the wax is completely melted. Leave in the oven overnight. The next day, pour or pipette away the TBA/wax mixture in a waste container in a fume hood (you can make a small waste container out of aluminum foil). Add fresh molten wax, and leave in oven overnight with vials open, so that all the TBA evaporates. The next day change the wax with fresh one several times (use a warm transfer pipette or pour away), for example twice a day for two days.Casting wax blocksSet air condition in the lab on warmer (if it is too cold, the wax will solidify too quickly).",
    "Equipment:Hot plate (set on low – around 68 °C), with aluminum foil tent to keep the heat insideMetal forceps (use dedicated forceps for wax work, they are difficult to clean)Alcohol burnerPlastic or metal moldsEmbedding rings or embedding cassete basesA small beaker with molten Paraplast Plus (also has to be dedicated for wax work)A tray with a thin layer of cold water (cool it by adding ice)An ice buckets filled with iceFlat ice packet (frozen cooling pack) or brass plate (optional)Keep a small amount of molten wax in a beaker in the aluminium foil tent in the hot plate. We also protect the hot plate with a layer of aluminium foil to keep it clean from wax. If the plate is not precisely thermo-regulated check the plate temperature all the time – if it gets too hot to touch, you have to turn it off and then turn it on when the wax starts to solidify. Prolonged temperatures over 62 °C will damage Paraplast Plus. Also, if using metal molds, keep them on a hot plate before using them.Take one vial with samples out of the oven at a time, and place it on the hot plate. Label the same number of embedding rings as the number of samples with a pencil or waterproof marker. Pour some wax in the mold, take one sample out of the vial with forceps warmed in a flame of alcohol burner. Note: Be careful, just pass forceps through the flame for a short time, if smoke is coming off the forceps, they are too hot. Orient the sample in the mold on the hotplate considering the type of sections you wish to obtain later.",
    "Carefully transfer the mold on the brass-plate/ice-packet or just on the table, so that the bottom layer of wax solidifies and fixes the sample in place. If the sample is difficult to position on the hot plate, you can position it now, when the bottom layer of wax is solid. Fill the mold with molten wax to the edge, and cover with the labeled embedding ring. Then transfer the mold into the tray with cold water and ice and leave it there for about 10 min so that wax solidifies completely. Then put the mold on the ice, wait for a few minutes and then remove the wax block from the mold (the cooling with ice helps the block getting loose from the mold). Put the mold back on a hotplate to re-use it. We usually process 5 to 10 blocks at a time. Store the blocks in the refrigerator at 4 °C (see Figure 1). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140807/20140807174400_6436.jpgFigure 1. Schematic drawing of workplace organization for embedding tissue samples in paraffin.SectioningEquipment:Rotary microtomeDisposable microtome bladesA small brushA forceps with sharp endsA single-edged razorbladeDark cardboard plate (for putting the sections on and observing them)A stereomicroscope (optional but recommended)Hot plate set on 40 °CA small jar with distilled waterA plastic pipetteCleaned objective microscope slides, frosted on one edgeA pencilTrim the wax block around the sample with a single-edged razor blade so that the upper and lower edges are parallel, and the left and right edges are at an angle, so that the lower edge of the block is longer than the upper. Also the sides of the block should not be vertical but inclined – always cut the block with the razor blade away from the sample in clean cuts from the top to the bottom of the block (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130726/20130726050242_3236.pngFigure 2.",
    "Sectioning paraffin-embedded tissue samples. Top: Directions of trimming the paraffin around the sample. Bottom: sectioning on the microtome and arranging the sections on a slide. Fix the embedding ring with the sample in the sample holder on the microtome. Set the thickness of sections (usually 10 to 20 μm) and the cutting angle (around 7 degrees). Start sectioning; the first few sections won't be good, so remove them with a small brush, always away from the blade, not towards it! When the surface of the sample evens, the ribbon will start forming. Cut enough sections to fit them on a dark cardboard, and cut the ribbon with a razor blade. Cut several ribbons, until you are sure that you have cut the region of interest, and then look at the sections with a stereomicroscope, to locate the interesting sections (e.g. median longitudinal sections of the kernel).Label the objective slides with a pencil, put them on a hot plate (at 40 °C) and apply some water on them (to almost cover them). Cut the ribbon in smaller regions with two or three sections, and apply two sets of sections on each slide (one will be used for the experiment and the other will serve as a control). The water area should be larger than the size of the ribbon, so the sections have room to spread and even out. Optionally you can drain excess water from the slides using filter paper. Leave the sections on the hot plate overnight to dry and attach to the slides. Store them in slide boxes on room temperature or in the refrigerator at 4 °C.Feulgen stainingThe Feulgen reaction (Feulgen and Rossenbeck, 1924) quantitatively stains DNA. The nuclei become purple, while the rest of the cell is clear.",
    "The staining is done in Coplin jars (the volume of staining solution is 40 ml). Sections on objective slides are dewaxed in xylene, rehydrated through an ethanol series to water, hydrolyzed in 5 M HCl for 75 min at 20 °C, stained with Feulgen reagent for 120 min at 20 °C, washed for 45 min in six changes of SO2-water, dehydrated in an ethanol series, then mounted in DPX mounting medium.Feulgen staining protocol (adapted from Greilhuber and Ebert, 1994)table:",
    "﻿0,1,2,3\nRehydration,100% xylene,RT,Date of solution preparation:\n,100% xylene,5 min/step,Feulgen:\n,absolute ethanol,,HCl:\n,96% ethanol,,SO2 water:\n,70% ethanol,,Xylene:\n,30% ethanol,,Ethanols:\n,distilled water,,\n,,,\nHydrolysis,5 M HCl,20 °C,75 min for FAA fixed\n,(in a water bath),____ min,Paraplast embedded\n,,,samples\n,distilled water,4 °C,\n,(cold water stops hydrolysis),5 min,\n,,,\nFeulgen,Feulgen,20 °C,\nStaining,(water bath),120 min,\n,,,\n,,,\nWashing,SO2 water,RT,250 ml SO2 water\n,(work in fume hood!),3 x 2 min,247.5 ml dH2O\n,,2 x 10 min,2.5 ml 5 M HCl\n,,20 min,1.25 g K2S2O2\n,,,\nDehydration,distilled water,RT,\n,30% ethanol,5 min/step,\n,70% ethanol,,\n,96% ethanol,,\n,absolute ethanol,,\n,100% xylene,,\n,100% xylene,,\n,,,\nMounting,DPX + cover slip,,"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}