{
  "id": 17389,
  "origin_website": "Jove",
  "title": "Retinal Pathophysiological Evaluation in a Rat Model",
  "procedures": [
    "This protocol follows all the animal care guidelines provided by Institutional Animal Ethics Committee, BITS-Pilani, Hyderabad campus.\n1. Retinal histology\nEnucleation and fixation of the eye\n\t\nEuthanize a 2 to 3-month-old diabetic Wistar male rat along with the age-matched control (14 to 15 weeks old) using a high dose of pentobarbital (150 mg/kg) injected through the intraperitoneal route. No detectable heartbeat confirms the death within 2-5 min.\nEnucleate the eye by making incisions using a scalpel blade on the nasal and temporal regions of the eye. Then cut along its edges using forceps and micro scissors to remove the eye from the orbital socket.\n\t\tNOTE: Before sacrificing rats, keep the fixative solutions ready.\n\t\tCAUTION: Formaldehyde irritates the skin, eye, nose, and respiratory tract. It can also cause cancer as it is a potent skin sensitizer. Wear gloves and handle it under the hood21.\nWash the eye thoroughly with 10 mL of phosphate-buffered saline (PBS) solution in a Petri dish to remove blood. Remove the excess fat surrounding the eye for easy penetration of the fixative solution.\nImmediately place the eye in 5 mL of fixative solution with the help of forceps, and make sure it is not stuck to walls of glass vials. Stir gently for a few seconds and replace the cap with proper labeling. Incubate eye in fixative solution for 24 to 48 h in dark conditions at room temperature.\nTrimming of tissue\n\t\nAfter fixation, remove the eye from the fixative solution, wash with 10 mL of PBS, and place it in a Petri dish containing 10 mL of PBS chilled at 4 °C.",
    "Using micro forceps, hold the eye with the optic nerve and make a nick at pars plana with the help of micro scissors. Cut through the entire margin of the cornea to separate the anterior cup of an eye. Using forceps, pick the lens gently, discard it, and cut the optic nerve.\nUsing curved micro scissors, make a longitudinal section of the posterior eyecup, passing through the optic disc dividing it into two halves. Place it in the base of the cassette and close the lid properly without any disturbance to the tissue. Label the cassettes with the tissue sample name and date.\nDehydration, clearing, and paraffin impregnation of tissue\n\t\nDehydrate the trimmed tissue by gradual transfer in 80 mL of 50%, 70%, 90%, and 100% ethanol. While transferring the cassettes from one concentration to another, make sure to dab them on clean tissue paper to minimize contamination.\n\t\tNOTE: Allow the tissue to stand in each transfer for 30 min (twice). The total time consumed for this step is approximately 4 h.\nUpon dehydration, transfer the cassettes into 80 mL of xylene for 30 min (twice) to replace the ethanol with xylene.\n\t\tNOTE: After incubation with xylene, the tissue becomes translucent.\n\t\tCAUTION: Xylene is an aromatic compound with a benzene ring. It irritates the eye and mucous membrane and may also cause depressions.\nFinally, impregnate the tissue with pre-heated paraffin at 60 °C to replace xylene in the tissue. Dab the cassettes several times on tissue paper to minimize the xylene content and place in 200 mL of paraffin (liquid at 60 °C) for 2 h (1 h x 2).\n\t\t​CAUTION: Avoid inhaling melted paraffin, as it produces tiny lipid droplets which may cause respiratory discomfort.\nParaffin embedding",
    "Turn on the paraffin embedding machine at least 1 h before use to melt the paraffin and for the stations to reach desired temperatures. Fill a steel mold with melted paraffin wax by placing it on a hot surface, then remove one cassette at a time from the paraffin container.\nMove the steel mold from a hot to a cold surface (4 °C). At this point, the wax in the mold will start to solidify. Before it solidifies completely, place the tissue in wax with the help of forceps and orient the tissue so that the optic disc portion of the posterior cup is facing the base of the mold.\n\t\tNOTE: Ensure that the tissue does not move and keep its desired orientation. If not, put the mold back onto the warm work surface until the whole paraffin liquefies, then start again with step 1.4.2.\nAs the wax in the mold starts solidifying, immediately place the cassette base on top of the mold. Carefully fill the mold with paraffin above the upper edge of the cassette and slowly transfer it to a cold surface (near -20 °C) for rapid solidification. Until it solidifies, repeat the process with other cassettes from step 1.4.2.\nOnce all the molds are solidified, separate the steel mold from the cassette. If it is hard, wait a bit longer and try again (do not remove it forcefully). Separation becomes easier upon complete solidification. Now the cassette becomes the base of the paraffin block to be held during sectioning by microtome.\n\t\tNOTE: This block can be stored at room temperature for further use. At this point, the process can be stopped and continued later (if required).\nSectioning",
    "Install a disposable microtome blade in the blade holder. Remove excess paraffin wax around cassettes so that both the upper and lower portions of the blocks remain parallel to the knife. Fit the block on to cassette holder.\nUnlock the hand-wheel to advance it until the surface of the block is in contact with the edge of the knife. Trim the excess paraffin wax on the block until the tissue is visualized on the surface of the block. Set the section thickness to 5 µm and cut a ribbon of five to six sections.\nUsing forceps, gently transfer the ribbon onto the surface of the pre-warmed water bath (around 50 °C) to unfold the ribbon. Collect sections on a glass slide coated with Mayer's albumin by holding the slide beneath the section. Gently lift the sections and allow the slides to dry horizontally overnight at 37 °C.\n\t\t​NOTE: Slides can be stored at room temperature in dry boxes for several months. At this step, the process can be stopped and continued later.\nStaining\n\t\nHeat the slides to be stained in a hot air oven at 60 °C for 1 h before use for the paraffin to melt, and follow the steps as mentioned in Table 1.\n\t\tCAUTION: Hematoxylin and Eosin stains are toxic when inhaled or ingested. They have been reported to be carcinogenic.\ntable:\n﻿0,1,2\nReagent,Standing Time,Repetition (Number of times)\nXylene,5 min,2\n100% Ethanol,5 min,2\n90% Ethanol,5 min,2\n70% Ethanol,5 min,2\n50% Ethanol,5 min,2\nWater,5 min,2\nHematoxylin,4 min,1\nWater wash,Water wash,Water wash\n1% Acid alcohol in 70% Ethanol,30 s,1\nWater wash,Water wash,Water wash\nScott's water,1 min,1\nWater wash,Water wash,Water wash\n50% Ethanol,1 min,1\n95% Ethanol,1 min,1\n0.25% Eosin,5 s,1\nWater wash,Water wash,Water wash\nWater,2 min,1\n95% Ethanol,1 min,1\n100% Ethanol,1 min,1\nXylene,5 min,2",
    "Mountant and coverslip,Mountant and coverslip,Mountant and coverslip\nTable 1. Hematoxylin and Eosin staining procedure\n2. Blood-brain barrier breakdown assay\nBlood and vitreous collection\n\t\nAnesthetize a 2 to 3-month-old diabetic Wistar male rat along with the age-matched control (14 to 15 weeks) using ketamine (80 mg/kg) and xylazine (8 mg/kg). Confirm the anesthetic state by pedal withdraw reflex (toe pinch). Immediately collect 1 mL of blood by cardiac puncture into an ethylenediaminetetraacetic acid (EDTA) coated tube to separate plasma from whole blood.\nEuthanize the rat using a high dose of pentobarbital (150 mg/kg), injected through the intraperitoneal route. No detectable heartbeat confirms the death within 2-5 min. Enucleate the eye and immediately place it on dry ice.\nPlace the eye in a clean Petri dish above dry ice (recommended) and start dissecting the eye as mentioned in step 1.2.2.\nRemove the lens, pull the vitreous carefully from the posterior cup using micro forceps and place it in a homogenization tube containing three to four glass beads (2-4 mm).\n\t\t​NOTE: Dissection on dry ice is recommended as removing the lens and vitreous is easier under freezing conditions.\nPreparation of samples\n\t\nHomogenize vitreous humor in a bead homogenizer at medium speed for 10 s.\nTransfer the blood (1 mL) and vitreous samples (10-20 µL) into the microcentrifuge tubes and centrifuge both the samples at 5200 x g for 10 min at 4 °C.\n\t\t​NOTE: In the case of successful homogenization, vitreous has uniform consistency after centrifugation. However, in the case of non-uniform consistency of vitreous, repeat from step 2.2.1 with increased homogenization time.\nCollect supernatant from both samples, and dilute vitreous humor and plasma samples in 1:10 and 1:20 ratio, respectively, with PBS.\nProtein quantification and vitreous-plasma protein ratio",
    "To quantitate protein concentration in vitreous humor and plasma samples, add 5 µL of diluted samples to 250 µL of Bradford reagent, mix well, and read the absorbance at 590 nm within 40 min.\n\t\tNOTE: If the absorption value of the samples is above 1.0, dilute the samples further and repeat the procedure from step 2.2.3.\nNormalize the vitreous protein level to plasma protein level from the same rat and measure the fold difference between healthy vs. diabetic rats.\n3. Fluorescence angiography\nFITC-dextran70000 dye injection\n\t\nAnesthetize a 2 to 3-month-old diabetic Wistar male rat along with the age-matched control (14 to 15 weeks) using 3% isoflurane and confirm the pedal withdrawal reflex (toe pinch). Dip the tail in a beaker containing warm water (37-40 °C). Clean the tail with 70% ethanol before injecting the dye. Locate the tail's lateral vein and mark the injection position in the lower portion of the tail.\n\t\tNOTE: If the insertion of the needle fails, try to insert in another location above the current position (tip to the base of tail). However, it is advised to inject once as repeated pricking may lead to stress development in the rat, which could cause vasoconstriction.\nInject 1 mL of 50 mg/mL FITC-dextran70000 dye solution through the tail vein and allow the dye to circulate for 5 min. Euthanize the rat with a high dose of pentobarbital (150mg/kg), injected through the intraperitoneal route. No detectable heartbeat confirms the death within 2-5 min. Enucleate the eye as mentioned in step 1.1.1.\n\t\tNOTE: If required, the eye can be fixed in 4% formaldehyde solution, for no more than 30 min.\nFlat mount preparation",
    "For preparing flat mounts, keep the dissecting tools ready along with the slides and coverslips. Place the eye in a Petri dish filled with chilled PBS and start dissecting the eye as mentioned in step 1.2.2.\nNow place the tip of a pointed forcep between the sclera and retina. Gently move it all along the rim of the cup, making sure the retina is not attached to the sclera at any point. If there is any obstruction, slowly cut that portion along the rim using curved micro scissors.\nOnce it is confirmed that the retina is not attached to the sclera from any side, cut near the optic disc, making a small hole such that the retina completely detaches from the sclera. Slowly push the retina into PBS solution and place it on a clean flat slide with the help of a spatula or forceps.\nUsing micro scissors or scalpel blades, make minor cuts in the retinal tissue, dividing it into four quadrants. Make sure that the cuts are at least 2 mm away from the hole left by the optic disc at the center, as shown in Figure 1.\nRemove excess PBS from the sides of tissue using 0.2 mL tips without disturbing the flat mount.\nPlace a drop of anti-fading mounting medium (50 µL to 100 µL) on a flat mount, cover with a coverslip, and visualize immediately under a confocal microscope.\n\t\tNOTE: Maintain minimum light during the entire procedure.\nVisualization of flat mount",
    "Visualize the flat mount under 10x objective of a confocal microscope. Perform tile scanning to capture the entire flat mount as a single image. The number of tiles depends upon the size of the retinal flat mount. Also, perform Z-stacking to visualize the veins and arteries in different foci (preferred size for Z-stack is 5 µm, depending on which, the number of Z-stack steps varies).\nUse PMT and HyD detector at % gain as 700-900 and 100-150, respectively. Choose emission range between 510-530 nm for FITC-dextran dye.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}