{
  "id": 3309,
  "origin_website": "Cell",
  "title": "Protocol for detection of ferroptosis in cultured cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nQuantification of cell death in 2D models\nTiming: 4+ days\nThis section describes methods to seed cells, treat cells with cell death inducers and inhibitors, and use the STACK and CellTiter-Glo assays to measure cell death and viability, respectively. The results of these assays will demonstrate which cell death inhibitor(s) inhibit death caused by a cell death inducer of interest. Because this protocol focuses on ferroptosis, we used two ferroptosis inducers, erastin2 and RSL3, which act via distinct mechanisms. Note that erastin2 exhibits greater potency and ferroptosis induction than erastin, the analog from which erastin2 was derived.\nDay 1: Seed cells (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2898-Fig1.jpg\nFigure 1. Cell viability and cell death assay workflows\n(A) Schematic overview of the protocol workflow for 2D (top row) and 3D (bottom row) cultures. Cells are seeded in either flat or U-bottom plates. Cell death inducers and inhibitors are added the following day. Cell death and viability are measured by live cell imaging (including STACK) and CellTiter-Glo, respectively.\n(B) Preparation of the cell death inducer dilutions. Prepare 10-point two-fold serial dilutions for each cell death inducer. Transfer 20 μL to the assay plate.\nDesign your plate layout.\nNote: A suggested 384-well plate layout used for the experiments in this protocol is depicted in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2898-Fig2.jpg\nFigure 2. Plate layout used in this protocol for cell viability and cell death studies",
    "Cells were seeded into the wells colored orange, green, blue, and red. The wells depicted in gray were filled with growth medium only. The opacity of the well colors represents the concentration of the added cell death inducers (orange- erastin2, green- RSL3, blue- CIL56, red- bortezomib). Cells in columns 12 and 23 were treated with DMSO as the vehicle control. Cell death inhibitors (DMSO, deferoxamine, ferrostatin-1, Q-VD-OPh, and TOFA) were added to the indicated wells at a fixed concentration.\nDetermine the volume of growth medium required to seed the 384-well plate.\nVolume = (20 μL per well × number of wells) + overage.\nCollect cells from a T-75 flask into a 15 mL conical tube.\nDetermine the concentration of cells using a manual or automatic cell counter.\nKeeping in mind the volume calculated in step 1(b)(i), use growth medium to dilute an appropriate volume of harvested cells to a concentration of 1,500 cells per 20 μL in a sterile trough.\nNote: This cell seeding density has been optimized for HT-1080N cells and a treatment duration of 48 h.\nUsing a 384-well compatible multichannel pipette, seed 20 μL of the cell solution per well of a black, clear bottom 384-well plate.\nCritical: If performing cell viability measurements with CellTiter-Glo, leave at least three wells empty. These wells will serve as blanks.\nSpin the plate for 3 s at 58 × g to ensure cells adhere to the bottom of the wells.\nPlace the plate in a sterile 37°C CO2 tissue culture incubator for 16–32 h.\nCritical: Cell seeding densities could affect cell death sensitivity. It is therefore important to maintain consistency in the incubation time prior to cell death inducer treatment. The incubation should be kept consistent among replicates (e.g., 24 h).",
    "Day 2: Treat cells with cell death inducers and inhibitors and perform live cell imaging (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nPrepare the cell death inducers.\nDetermine the volumes of growth medium and cell death inducer required to prepare a solution three times more concentrated than the desired highest dose.\nNote: As an example, our calculations are provided in the table below (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_2898_3.csv\nIncluded are calculations to compute the required volumes of cell death inducer stock solution and cell growth medium for the STACK and CellTiter-Glo experiments described in this protocol.\nNote: Adjust volumes to avoid pipetting < 0.5 μL.\nFor each cell death inducer, volume of growth medium = (number of cell death inhibitors × 100 μL) + overage.\nVolume of each cell death inducer = (concentration of desired highest dose × 3) × (volume of growth medium) ÷ concentration of the stock solution.\nDetermine which cell death inducer solution requires the largest volume of stock solution (in this case, erastin2, RSL3, or CIL56) and add an equivalent volume of DMSO for the 3× DMSO solution.\nIn 1.5 mL Eppendorf tubes, prepare the 3× solutions of each cell death inducer.\nCritical: If there is precipitate in a cell death inducer stock solution, ensure that the compound has been resuspended in the appropriate solvent, according to its known solubility.\nUsing a multichannel pipette, add 50 μL of growth medium to columns 3‒11 and 14‒22 of a 384-well storage plate.\nPipette 100 μL of each 3× cell death inducer solution (except DMSO) into the appropriate wells in columns 2 and 13.\nUsing a multichannel pipette, pipette 50 μL of the 3× cell death inducer solution from column 2 into column 3 to achieve a two-fold dilution. Pipette up and down six times to mix.",
    "Repeat the previous step until you have reached column 11, which will result in a 10-dose serial dilution.\nRepeat steps 2(a)(viii) and 2(a)(ix) with new pipette tips for columns 13‒22.\nAdd 40 μL of the 3× DMSO solution to the appropriate wells in columns 12 and 23.\nPrepare the cell death inhibitors.\nDetermine the volumes of growth medium and cell death inhibitor required to prepare a solution three times more concentrated than the desired final concentration.\nNote: As an example, our calculations are provided in the table below (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_2898_4.csv\nIncluded are calculations to compute the required volumes of cell death inhibitor stock solution and cell growth medium for the STACK and CellTiter-Glo experiments described in this protocol.\nNote: Adjust volumes to avoid pipetting < 0.5 μL.\nFor each cell death inhibitor, volume of growth medium = (number of cell death inducers × 11 wells) × (20 μL per well) + overage.\nVolume of each cell death inhibitor = (desired final concentration × 3) × (volume calculated in previous step) ÷ concentration of the stock solution.\nDetermine which cell death inhibitor solution requires the largest volume of stock solution (in this case, deferoxamine) and add an equivalent volume of DMSO for the 3× DMSO solution.\nIf measuring cell death via STACK, make a 60 nM solution of SYTOX Green using growth medium (this is 3× the desired final concentration of 20 nM SYTOX Green).\nNote: Volume of 60 nM SYTOX Green solution = total volume of all cell death inhibitor solutions + overage.\nIn small sterile troughs, prepare the 3× solutions of each cell death inhibitor.\nUsing a multichannel pipette, add 20 μL of each cell death inhibitor solution to the appropriate wells of the assay plate.",
    "Similarly, pipette 20 μL of the cell death inducer solutions from the storage plate to the appropriate wells of the assay plate.\nIf using both STACK and CellTiter-Glo, add 60 μL 20 nM (1×) SYTOX Green solution per well to three wells without cells.\nNote: These wells will serve as blanks for the CellTiter-Glo cell viability assay.\nIf using only CellTiter-Glo, add 60 μL growth medium (without SYTOX Green).\nIf using only STACK, skip this step.\nTo make a 1× SYTOX Green solution, combine 100 μL 60 nM (3×) SYTOX Green solution with 200 μL growth medium.\nSpin the assay plate down for 3 s at 58 × g.\nPlace the assay plate in a sterile 37°C CO2 tissue culture incubator for 48 h.\nNote: If using cell death inducers not described in this protocol, it may be necessary to extend the treatment duration.\nIf using a Sartorius S3 Live Cell Analysis Instrument or similar imager to conduct STACK, place the assay plate in the machine housed within an incubator (Figure 1[href=https://www.wicell.org#fig1]A).\nNote: Set up image acquisition and analysis using the parameters described in the Materials and equipment section as well as a published protocol for STACK.5[href=https://www.wicell.org#bib5] We recommend image acquisition at 4 h intervals, starting immediately.\nCritical: Set the red channel acquisition time to 800 ms, the green channel acquisition to 400 ms, and the spectral unmixing parameter to 8% of red contributes to green, 0% of green contributes to red.\nDay 4+: Measure cell viability and/or death.\nIf relevant, use the 2D CellTiter-Glo assay to measure cell viability upon completion of the treatment (Figure 1[href=https://www.wicell.org#fig1]A).\nNote: The day prior, thaw the CellTiter-Glo Luminescent Cell Viability Assay reagent (hereafter referred to as CellTiter-Glo reagent) at 4°C.",
    "Note: The CellTiter-Glo reagent is relatively expensive. If desired, there are different approaches one can take to reduce the required volume of CellTiter-Glo. First, one could remove a greater volume from each well prior to the addition of CellTiter-Glo. For instance, if 45 μL medium were removed (leaving 15 μL behind), each well would require only 15 μL CellTiter-Glo reagent. This approach maintains the recommended 1:1 ratio of medium to CellTiter-Glo reagent. Alternatively, one could increase the ratio of medium to CellTiter-Glo reagent. For either approach, the method should be validated using an ATP standard curve to ensure that data integrity is not compromised.\n30 min before the treatment is complete, warm the plate and CellTiter-Glo reagent to approximately 21°C.\nCritical: If you are performing STACK in addition to CellTiter-Glo, do not remove the plate from the imaging machine until the final scan has been completed.\nRemove 35 μL from each well of the 384-well assay plate, including the three blank (cell-free) wells, leaving approximately 25 μL in each well.\nAdd 25 μL CellTiter-Glo reagent to each well, including the three blank wells.\nPlace the plate on an orbital shaker for 2 min to lyse the cells.\nPlace the plate on a benchtop and incubate at approximately 21°C for 10 min.\nRecord luminescence using a microplate reader, using settings described in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nAnalyze the CellTiter-Glo results.\nCalculate the mean luminescence signal of the three blank wells.\nSubtract the mean blank signal (calculated in the previous step) from the luminescence signals of each experimental well.\nCalculate the mean luminescence signal of the control wells (wells for which DMSO served as the control for both the cell death inducer and cell death inhibitor).",
    "Divide the blank-corrected luminescence values of each well by the mean control signal (calculated in the previous step) to obtain the relative cell viability.\nCritical: Look closely at the data to confirm that the cell viability quantifications match the observed cell phenotypes and to look for any potential issues (see problem 2[href=https://www.wicell.org#sec7.3]).\nGenerate dose-response curves for each cell death inducer by log10 transforming the cell death inducer concentrations and using the GraphPad Prism software ‘log(inhibitor) vs. response – Variable slope (four parameters)’ analysis to calculate the nonlinear regression best-fit curve (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2898-Fig3.jpg\nFigure 3. Determination of cell death mechanism via cell viability and death assays in 2D cell culture\n(A) Dose-response curves depicting HT-1080N cell viability (left) and cell death (right) after 48 h of treatment with a cell death inducer (erastin2, RSL3, CIL56, bortezomib, or DMSO) and a cell death inhibitor (deferoxamine, ferrostatin-1, Q-VD-OPh, TOFA, or DMSO). Viability measurements were obtained using the CellTiter-Glo assay. Lethal fraction was calculated using STACK.\n(B) Lethal fraction kinetics for erastin2 (era2), RSL3, CIL56, and bortezomib (btz) at the concentration used to approximate the EC90. Cells were co-treated with cell death inhibitors or DMSO (vehicle control). Time elapsed indicates hours post-cell death inducer and inhibitor treatment.\n(C) Images of HT-1080N cells after 48 h of treatment with a cell death inducer and cell death inhibitor. Red color indicates mKate2-positive cells. Green color indicates SYTOX Green-positive cells. Scale bar = 50 μm. All data represent mean ± SD, N = 3 biological replicates.\nIf relevant, analyze the STACK results.\nLaunch the image analysis using parameters described in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nCopy and paste the mKate2+, SYTOX Green+, and Yellow+ (red and green overlap) object counts per mm2 into a spreadsheet.",
    "Determine the ‘lethal fraction’ for each condition, which represents the proportion of dead cells in a population:\nL\ne\nt\nh\na\nl\nf\nr\na\nc\nt\ni\no\nn\n=\n1\n−\nm\nK\na\nt\ne\n2\n+\n−\nY\ne\nl\nl\no\nw\n(\nm\nK\na\nt\ne\n2\n+\n−\nY\ne\nl\nl\no\nw\n)\n+\nmax\n⁡\n(\nS\nY\nT\nO\nX\nG\nr\ne\ne\nn\n+\n)\nNote: Max(SYTOX Green+) refers to the maximum SYTOX Green+ count observed between times t = 0 and t = n, where n is the elapsed time in one time course experiment in a given population of cells. It is also possible to compute the lethal fraction at a single timepoint (e.g., 24 h or 48 h) using the SYTOX Green+ counts, but it is possible that some dead cells will be unaccounted for due to loss of SYTOX Green signal from long-dead cells.\nCritical: Look at the images (e.g., Figure 3[href=https://www.wicell.org#fig3]C) to confirm that the cell death quantifications match the observed cell phenotypes and to look for any potential issues (see problems 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5]).\nGenerate dose-response curves for each cell death inducer by log10 transforming the cell death inducer concentrations and using the GraphPad Prism software ‘log(inhibitor) vs. response – Variable slope (four parameters)’ analysis to calculate the nonlinear regression best-fit curve (Figure 3[href=https://www.wicell.org#fig3]A).\nGenerate time-course graphs for each cell death inducer at a chosen concentration, with time on the X-axis and lethal fraction on the Y-axis.\nNote: The GraphPad Prism software ‘Plateau followed by one phase association’ analysis can be used to calculate the best-fit curve. The calculated X0 value represents the death onset (Figure 3[href=https://www.wicell.org#fig3]B and Table 4[href=https://www.wicell.org#tbl4]).\ntable:files/protocols_protocol_2898_5.csv",
    "Data obtained from 2D STACK analysis were used to compute the values provided in the table. The equation ECF = EC50 × (F ÷ (100-F))1/H, where H is the Hill slope and F = 90, was used to calculate EC90 values for cells treated with a cell death inducer (erastin2, RSL3, CIL56, or bortezomib) and DMSO as a vehicle control for the cell death inhibitor treatment condition. To approximate the death onset at the EC90 concentration, we chose a concentration (from the dose-response) close to the calculated EC90 value whose cell death induction was consistent with an EC90 dose (i.e., generated 90% of the maximal observed death). The death onset for this approximate EC90 concentration was then calculated as described in the quantification of cell death in 2D models[href=https://www.wicell.org#sec3.1] section.\nNote: For the ‘Plateau followed by one phase association’ analysis parameter X0, set the constraint type to ‘no constraint’.\nNote: Please refer to a published protocol for STACK for more detailed step-by-step instructions.5[href=https://www.wicell.org#bib5]\nQuantification of cell death in 3D models\nTiming: 4+ days\nThe Dixon lab has previously published methods for measuring cell viability in cells grown in 3D culture.3[href=https://www.wicell.org#bib3] This section describes these methods in greater detail.\nDay 1: Seed cells (Figure 1[href=https://www.wicell.org#fig1]A).\nDesign your plate layout.\nNote: A suggested 384-well plate layout used for the experiments in this protocol is depicted in Figure 2[href=https://www.wicell.org#fig2].\nDetermine the volume of growth medium required to seed the plate.\nVolume = (20 μL per well × number of wells) + overage.\nHarvest cells from a T-75 flask and obtain cell counts using a manual or automatic cell counter.\nKeeping in mind the volume calculated in step 4(b)(i), use growth medium to dilute an appropriate volume of harvested cells to a concentration of 2,500 cells per 20 μL in a sterile trough.",
    "Note: This cell seeding density has been optimized for HT-1080N cells and a treatment duration of 48 h.\nUse a multichannel pipette to seed 20 μL of the cell solution into the appropriate wells of a 384-well ultra-low attachment U-bottom assay plate (Figure 1[href=https://www.wicell.org#fig1]A).\nCritical: If performing cell viability measurements with the 3D CellTiter-Glo Viability Assay, leave at least three wells empty, as these wells will serve as blanks.\nSpin the plate down at 350 × g for 5 min.\nPlace the plate in a sterile 37°C CO2 tissue culture incubator for 16–32 h.\nCritical: Cell seeding densities could affect cell death sensitivity; it is therefore important to maintain consistency in the incubation time prior to cell death inducer treatment. The incubation should be kept consistent among replicates (e.g., 24 h).\nDay 2: Treat cells with cell death inducers and inhibitors and perform live cell imaging (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nCritical: Prior to treatment with cell death inducers and inhibitors, check cells under the microscope to ensure that they have formed spheroids.\nPrepare the cell death inducers and inhibitors as described in the previous section for 2D cell culture (Figure 1[href=https://www.wicell.org#fig1]B).\nAdd 20 μL of the 3× cell death inhibitors and 20 μL of the 3× cell death inducers (prepared in 3× SYTOX Green medium) to the assay plate to obtain a final concentration of 1× for all compounds (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nOmit SYTOX Green if live cell imaging will not be used to assess cell death.\nIf using 3D CellTiter-Glo to assess cell viability, add 60 μL of 20 nM (1×) SYTOX Green solution per well in three wells without cells.\nNote: These wells will serve as blanks for the 3D CellTiter-Glo assay.",
    "If monitoring cell death by live cell imaging, place the assay plate into the Sartorius S3 Live Cell Analysis Instrument or similar imager housed within a tissue culture incubator (Figure 1[href=https://www.wicell.org#fig1]A). Otherwise, carefully place the assay plate into a sterile 37°C CO2 tissue culture incubator for 48 h.\nCritical: For live cell imaging, set the red channel acquisition time to 800 ms, the green channel acquisition to 400 ms, and the spectral unmixing parameter to 12% of red contributes to green, 0% of green contributes to red.\nNote: If using cell death inducers not described in this protocol, it may be necessary to extend the treatment duration.\nDay 4+: Measure cell viability using the CellTiter-Glo 3D Cell Viability Assay (Figure 1[href=https://www.wicell.org#fig1]A).\nNote: The day before, thaw an aliquot of CellTiter-Glo 3D Cell Viability Assay reagent (hereafter referred to as 3D CellTiter-Glo reagent) at 4°C.\nNote: The 3D CellTiter-Glo reagent is relatively expensive. If desired, there are different approaches one can take to reduce the required volume of 3D CellTiter-Glo reagent per well. First, one could remove a greater volume from each well prior to the addition of 3D CellTiter-Glo. For instance, if 40 μL medium was removed (leaving 20 μL behind), each well would require only 20 μL 3D CellTiter-Glo reagent. This approach maintains the recommended 1:1 ratio of medium to 3D CellTiter-Glo reagent. However, removing a greater volume of medium from each well may increase the risk of spheroid disruption. Alternatively, one could increase the ratio of medium to 3D CellTiter-Glo reagent. For either approach, the method should be validated using an ATP standard curve to ensure that data integrity is not compromised.\n30 min before the treatment is complete, warm both the 3D CellTiter-Glo reagent and the plate to approximately 21°C.",
    "Remove 30 μL from each well of the 384-well assay plate, including the three blank, cell-free wells. Approximately 30 μL should remain in each well.\nCritical: Be very careful to not disturb or pipette up the spheroids. While spheroids are visible to the naked eye, using a light to illuminate the bottom of the plate can improve spheroid visualization.\nThoroughly mix the 3D CellTiter-Glo reagent by inversion.\nAdd 30 μL of the 3D CellTiter-Glo reagent to each well of the assay plate, including the three blank wells.\nCover the plate with foil and shake on an orbital shaker for 5 min to lyse the cells.\nIncubate the plate on a benchtop at approximately 21°C for 25 min.\nRecord luminescence using a microplate reader, using the settings described in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nAnalyze the CellTiter-Glo results as described above for 2D culture (see Figure 4[href=https://www.wicell.org#fig4]A and problem 2[href=https://www.wicell.org#sec7.3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2898-Fig4.jpg\nFigure 4. Determination of cell death mechanism in 3D cell culture\n(A) Dose-response curves depicting HT-1080N spheroid cell viability after 48 h of treatment with a cell death inducer (erastin2, RSL3, CIL56 or bortezomib) and a cell death inhibitor (deferoxamine, ferrostatin-1, Q-VD-OPh or TOFA). Viability measurements were obtained using the 3D CellTiter-Glo assay.\n(B) Images of HT-1080N spheroids after 48 h of treatment with a cell death inducer and cell death inhibitor. Red color indicates mKate2-positive cells. Green color indicates SYTOX Green-positive cells. Scale bar = 400 μm. DFO: deferoxamine, Fer-1: ferrostatin-1. All data represent mean ± SD, N = 3 biological replicates.\nValidation 1: Western blotting for cleaved caspase-3\nTiming: 5+ days",
    "Caspase-3 and caspase-7 are cleaved during apoptosis but not ferroptosis.7[href=https://www.wicell.org#bib6],6[href=https://www.wicell.org#bib7] Probing for cleaved caspase-3 via western blot can distinguish apoptotic and non-apoptotic cell death. Q-VD-OPh is a pan-caspase inhibitor that serves as a control because it inhibits apoptotic, but not other forms, of cell death.\nNote: The following protocol has been optimized for HT-1080N cells grown in 2D culture and for a treatment period of 48 h.\nCritical: Before conducting validation experiments, it is important to determine the optimal dose and treatment duration for each cell death inducer. Because cell death is a destructive process, it is important to choose a dose and a time point at which the cells are on the verge of dying (to ensure that a given lethal mechanism is fully activated) but have not yet undergone membrane permabilization. To this end, use the kinetic dose-response data obtained from the STACK experiment to define ideal timepoints for sample collection. Specifically, for each cell death inducer, plot the dose-response data at 48 h in GraphPad Prism and fit a nonlinear regression curve (see Quantification of cell death in 2D models section, step 3(d)). Use the resulting computed values (EC50 and Hill slope) to determine the EC90 dose. Next, plot the kinetic data for one or more concentrations near the EC90. Use the GraphPad Prism ‘Plateau followed by one-phase association’ model to generate a model fit to the kinetic data (see Quantification of cell death in 2D models section, step 3(e)). From this model one can extract the X0 value, which represents the death onset. For the validation experiments, select a time point approximately 30 min before death onset for each cell death inducer. Example values used for the experiments in this protocol are listed in Table 4[href=https://www.wicell.org#tbl4].",
    "Seed 150,000 cells in 2 mL growth medium per well of a 6-well plate.\nNote: Seed enough wells to account for all conditions. For every apoptosis inducer, include two wells: one for the cell death inducer alone and one for co-treatment with a pan-caspase inhibitor. Additionally, include one well for treatment with the pan-caspase inhibitor alone. If a preliminary experiment results in the detection of cleaved caspase-3 in any wells treated with a cell death inducer not previously known to induce apoptosis, repeat the experiment and include a condition in which cells are co-treated with the cell death inducer and the pan-caspase inhibitor. The results should indicate whether the detected cleaved caspase-3 signal is due to unreported pro-apoptotic activity of the cell death inducer.\nAllow the cells to adhere and proliferate for 2 d total (including the cell death inducer treatment).\nTreat the cells with each cell death inducer for a period equal to the death onset minus 30 min (see Table 4[href=https://www.wicell.org#tbl4] for death onset values).\nAspirate medium from each well and replace with 2 mL of the appropriate cell death inducer (and, if applicable, inhibitor) solution.\nStagger each treatment such that all treatments end 48 h after cell seeding.\nAfter the treatments are complete, place the plate on ice.\nRemove the growth medium from each well and add 1 mL of ice-cold PBS.\nRemove the PBS and add another 1 mL of ice-cold PBS.\nScrape the cells into the PBS with a cell scraper.\nCollect the cell solutions into 1.5 mL Eppendorf tubes. Centrifuge at 300 × g for 5 min.\nDuring the centrifugation step, prepare the lysis buffer:\nMake enough RIPA buffer (0.1% SDS) with protein and phosphatase inhibitors (5 mM of NaF phosphatase inhibitor and 1:200 P8340 protease inhibitor cocktail) for 100 μL per sample.",
    "Remove the PBS from the cell pellets.\nPause point: The cell pellets can be frozen at −80°C.\nResuspend the cell pellets in 100 μL RIPA cocktail (see step 15(a)).\nSonicate the samples at 60% amplitude (1 s on, 1 s off) for 10 cycles.\nCentrifuge the samples at maximum speed for 15 min at 4°C.\nTransfer the supernatants to new Eppendorf tubes.\nQuantify the protein concentration using a BCA assay.\nPrepare samples containing 25 μg protein each. Add 4× Bolt loading dye and 10× reducing agent to achieve final concentrations of 1×.\nBoil the samples for 5 min at 95°C.\nLoad 80% of the sample (20 μg protein) into a polyacrylamide gel.\nRun the gel at 100 V for 1 h 45 min.\nUse the iBlot 2 Gel Transfer Device to transfer the proteins from the gel to a nitrocellulose membrane.\nProbe the membrane in a hybridization bag with a 1:1,000 dilution of rabbit anti-cleaved caspase-3 antibody and a 1:2,000 dilution of mouse anti-tubulin antibody in Intercept Blocking Buffer.\nIncubate at 4°C on an orbital shaker for 16–32 h.\nThe following day, wash the membrane three times (5 min each) at approximately 21°C with 1× TBST.\nAdd a 1:15,000 dilution each of donkey anti-rabbit IgG antibody and donkey anti-mouse IgG antibody in Intercept Blocking Buffer.\nIncubate at approximately 21°C for 1 h on an orbital shaker in a hybridization box.\nWash the membrane three times (5 min each) at approximately 21°C with 1× TBST.\nQuickly rinse the membrane once with deionized water and store the membrane in deionized water until imaging.\nImage the membrane using a LI-COR imager in the 700 nm and 800 nm channels to detect cleaved caspase-3 and tubulin signals, respectively (see Figure 5[href=https://www.wicell.org#fig5]A and problem 4[href=https://www.wicell.org#sec7.7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2898-Fig5.jpg\nFigure 5. Western blotting for cleaved caspase-3",
    "(A) Representative western blot of HT-1080N cells treated with cell death inducers, the pan-caspase inhibitor Q-VD-OPh, or the vehicle control DMSO. For the apoptosis inducer bortezomib, cells were either co-treated with bortezomib and DMSO or bortezomib and Q-VD-OPh. Blots were probed for tubulin (loading control) and cleaved caspase-3. Asterisk indicates a non-specific band that occurs in conditions of apoptosis inducer and pan-caspase inhibitor co-treatment, as reported previously.8[href=https://www.wicell.org#bib9]\n(B) Quantification of (A). Cleaved caspase-3 signal was normalized to tubulin signal. Asterisk indicates p < 0.05 for a t-test for difference of means between each condition and the bortezomib alone condition (positive control). All data represent N = 3 biological replicates.\nExport the images for each channel in black and white.\nUse an image analysis software to measure the cleaved caspase-3 signals for each condition. Normalize these values to the respective tubulin signals by division (Figure 5[href=https://www.wicell.org#fig5]B).\nAlternatives: This western blot protocol was developed using the following reagents and equipment: RIPA lysis buffer, Pierce BCA assay, Bolt gel running system, iBlot 2 dry transfer system, and LI-COR imager. While other methods could also be used to detect cleaved caspase-3, it is important to optimize each step that varies from this established protocol.\nValidation 2: C11-BODIPY(581/591) imaging for lipid peroxidation\nTiming: 3+ days",
    "Because lipid peroxidation is a hallmark of ferroptosis, C11-BODIPY(581/591) is useful for the identification of ferroptosis. C11-BODIPY(581/591) is a fluorescent fatty acid analog used to detect lipid peroxidation.9[href=https://www.wicell.org#bib8] Oxidation of the unsaturated portion of the molecule alters its emission wavelength. The unoxidized molecule emits in the red spectrum and the oxidized molecule emits in the green spectrum; this shift can be detected using laboratory techniques such as flow cytometry or fluorescence microscopy, as described in this protocol. Because of overlapping emmissions it is recommended that BODIPY assays be performed using cells that do not express nuclear-localized mKate2.\nNote: The following protocol has been optimized for HT-1080 cells grown in 2D culture and for a treatment period of 48 h.\nSeed 50,000 cells in 1 mL growth medium per well of a 12-well plate.\nNote: Each condition requires one well. The number of conditions is dependent on the number of cell death inducers and cell death inhibitors used in this experiment. For ferroptosis inducers, include one well with a ferroptosis inhibitor and one without. In addition, reserve a well for the ferroptosis inhibitor alone. If a preliminary experiment results in the detection of a high oxidation ratio in any wells treated with a cell death inducer not previously known to induce ferroptosis, repeat the experiment and include a condition in which cells are co-treated with the cell death inducer and the ferroptosis inhibitor. The results should indicate whether the detected oxidation is due to unreported pro-ferroptotic activity of the cell death inducer.\nAllow the cells to adhere and proliferate for a total of 2 d (including the cell death inducer treatment).\nTreat the cells with each cell death inducer for a period equal to the death onset minus 30 min (see Table 4[href=https://www.wicell.org#tbl4] for death onset values).",
    "Aspirate medium from each well and replace with 1 mL of the appropriate cell death inducer (and, if applicable, inhibitor) solution.\nStagger each treatment such that all treatments end 48 h after cell seeding.\n30 min before the treatments are complete, prepare the C11-BODIPY(581/591) and Hoechst solution in PBS.\nPrepare enough PBS for 500 μL per condition.\nAdd C11-BODIPY(581/591) for a final concentration of 1.5 μM.\nAdd Hoechst for a final concentration of 1 μg/mL.\nApproximately 15 min before the treatments end, remove the growth medium from the wells.\nAdd 500 μL of the C11-BODIPY(581/591) and Hoechst solution to each well.\nCritical: For these steps, work in a dark, sterile biosafety cabinet (the cabinet light should be off, but lights in the room may be left on). This will ensure sterility and prevent photobleaching of the light-sensitive compounds.\nCritical: The timing of the C11-BODIPY(581/591) experiment is crucial. An insufficient cell death inducer treatment duration could result in a lack of oxidized lipid detection in conditions that should induce lipid peroxidation. An excessive cell death inducer treatment duration could lead to cell death. Work reasonably quickly and ensure that the images are obtained at precisely the intended time point (calculated death onset minus 30 min).\nIncubate the plate in a sterile 37°C incubator for 10 min.\nRemove the C11-BODIPY(581/591) and Hoechst solution. Add 500 μL pre-warmed PBS to each well.\nImage cells on a Lionheart instrument or similar imager using Texas Red, DAPI, and GFP filter cubes (see Figure 6[href=https://www.wicell.org#fig6]A and problem 5[href=https://www.wicell.org#sec7.9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2898-Fig6.jpg\nFigure 6. C11-BODIPY(581/591) imaging for lipid peroxidation",
    "(A) Representative images of HT-1080 cells treated with cell death inducers, the lipophilic antioxidant ferrostatin-1 (Fer-1), or the vehicle control DMSO. For the ferroptosis inducers erastin2 and RSL3, cells were either co-treated with the ferroptosis inducer and DMSO or the ferroptosis inducer and ferrostatin-1. Scale bar = 20 μm.\n(B) Quantification of the C11-BODIPY(581/591) oxidation ratio for a representative biological replicate depicted in (A).\n(C) Mean C11-BODIPY(581/591) oxidation ratio for three biological replicates. Single asterisk indicates p < 0.05 and double asterisks indicate p < 0.01 for a t-test for difference of means between the two conditions for each given comparison.\nCalculate the C11-BODIPY(581/591) oxidation ratio for each condition (Figures 6[href=https://www.wicell.org#fig6]B and 6C).\nNote: See the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for details on image acquisition and calculation of the C11-BODIPY(581/591) oxidation ratio."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cell-Based Assays",
    "Cell Culture",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}