{
  "id": 17457,
  "origin_website": "Jove",
  "title": "Employing the Forced Oscillation Technique for the Assessment of Respiratory Mechanics in Adults",
  "procedures": [
    "The following protocol was approved by Rutgers University Institutional Review Board. All volunteers participating in this study provided written informed consent prior to all testing.\n1. Pre-test preparation\nAssess the individual for allergies or sensitivity to mouthpiece or nose clip materials, for oral or facial pain preventing proper seal on the mouthpiece, for an ability to follow directions, and for known sensitivity to the bronchodilating agent that will be used.\nEnsure that the individual dresses comfortably and refrains from exercising or ingesting a heavy meal before testing. Refer to local laboratory policies regarding the use of caffeine, tobacco products, or inhaler before testing.\nPerform FOT first in situations of multiple pulmonary function tests requiring deep breaths.\nPerform testing in a quiet and comfortable environment. Prepare supplies and materials prior to the individual's arrival.\n\t\nProvide an adjustable chair without wheels to ensure that the individual's feet are flat against the floor.\nProvide the individual with a disposable anti-bacterial filter and nose clip to be used for testing.\nAdhere to local laboratory procedures for donning personal protective equipment when testing.\n2. Verification with impedance test load\nLocate the test load object before testing the individual.\n\tNOTE: Static test loads are manufacturer-supplied objects with known impedance (preferably with resistive, elastic, and inertial components) that are specific to each device. Use a test load with an impedance of approximately 15 hPa·s·L-1, which exceeds the expected Zrs for adults.\nEnsure that the test load is factory calibrated (if applicable).\n\tNOTE: Some test loads require annual factory recalibration, so follow the protocol outlined in the device manual.\n\t\nConsult the manual or contact the manufacturer if the test load for verification is accidentally dropped or visually appears damaged.\nOpen the calibration or verification menu within the software.",
    "Firmly insert the test load device into the FOT device and complete the verification procedure according to the manufacturer's recommendations.\nReview and save the verification results.\n\tNOTE: A successful verification ensures that the measured values match the test load within a tolerance of ≤+10% or ±0.1 hPa·s·L-1. If the verification fails or gives errors, ensure that the test load was properly seated into the FOT device and there is no obstruction in the flow. Consult the manual for troubleshooting tips.\nVerify the device with the test load daily, or immediately before testing.\n3. Test procedure\nProvide standardized instructions and demonstration for the individual.\n\t\nLet the individual know about the approximate duration of a single acquisition and the number of replicates that will be taken (see step 3.2).\nLet the individual know about the sensations that they will experience from the oscillations, e.g., fluttering or vibrations in the chest and mouth.\nLet the individual know that the device will start oscillations after a brief period of observation to regulate breathing.\nInstruct the individual to avoid swallowing during the testing period.\nInstruct the individual to sit upright with the feet flat on the floor and the chin facing up for the duration of the testing period.\nInstruct the individual to create a seal with the lips and teeth on the mouthpiece via a demonstration.\nInstruct the individual to keep the tongue relaxed.\nInstruct the individual to firmly place open palms against cheeks with fingertips near the temple and thumbs following the mandibular line. Instruct the individual to keep the elbows slightly flared in a comfortable position to ensure chest expansion.\nInstruct the individual to maintain regular quiet breathing on the mouthpiece until asked by the technician to stop.\nPerform measurement session\n\t\nAdhere to hygiene and infection control standards as described for spirometry15.",
    "Attach the anti-bacterial filter to the device.\n\t\tNOTE: Use filters that meet ATS/ERS guidelines with a resistance <1.5 hPa·s·L-1 at a flow rate less than 14 L/s as verified by the manufacturer.\nProvide instructions as described in step 3.1 and ensure that the individual is positioned correctly with the nose clip in place and mouth tightly sealed around the mouthpiece of the device.\nAfter the individual completes several respiratory cycles of stable, passive, and comfortable tidal breathing, ensure that the device automatically begins acquiring data. Alternatively, the technician may trigger data acquisition using the software.\nInstruct the individual to come off the mouthpiece after at least three artifact-free breaths are acquired during a single acquisition.\n\t\tNOTE: To achieve three artifact-free breaths, a minimum recording duration of 30 s is recommended. Some FOT devices' settings will automatically stop at a pre-defined recording duration and/or achievement of a certain number of breaths (see section 4 for details on identifying artifacts).\nAdjust the rest intervals between replicate measurements (approximately 60-90 s) as needed to avoid any physical discomfort.\nOptionally, assess the bronchodilator response.\n\t\nAdminister salbutamol to the individual in accordance with standard laboratory procedures for aerosol medications (e.g., metered dose inhaler, nebulizer) and wait for 15 min16.\n\t\tNOTE: If using a metered dose inhaler with a spacer, administer four separate doses of 100 µg.\nRepeat the same procedures as before (see step 3.2) to obtain post-bronchodilator replicates.\n4. Determining acceptable measurements\nIdentify artifacts through visual inspection. To do so, monitor the depth (tidal volume; Vt) and rate of breathing (respiratory frequency; fR) in real-time during acquisition to visually ensure stable and quiet breathing patterns from replicate to replicate.",
    "NOTE: For each replicate, the average Vt, fR, or their product (minute ventilation, V̇E) will be displayed within the software. Compare this value between replicates in order to provide individual feedback on the depth and rate of breathing, if necessary.\nInspect the replicate manually to exclude artifacts such as cough, swallowing, leak, or other interruptions to flow and pressure traces that can be viewed in real-time.\nDiscard any replicates containing negative resistances.\nReview automatic software detection of artifacts.\n\tNOTE: Manufacturers employ software algorithms for detecting artifacts and excluding whole or partial breaths (i.e., inspiration and expiration). Get familiarized with the algorithms applied and report this when summarizing data from a measurement session. Often, these algorithms involve identifying Rrs, Xrs, and breathing patterns outside of normal physiological ranges as well as outliers when comparing breath-by-breath.\nAssess variability\n\t\nAcquire at least three acceptable replicates (i.e., those containing ≥3 artifact-free breaths). Calculate the within-session coefficient of variation (CoV) for total Rrs at the lowest frequency (e.g., Rrs at 5 Hz).\n\t\tNOTE: CoV is calculated using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63165/63165eq01.jpg\nAs the acceptable within-session CoV for adults is ≤10%, obtain additional replicates if the CoV is >10% or proceed to step 5 if CoV is ≤10%.\n\t\tNOTE: Achieving CoV ≤10% may be difficult in individuals with airway disease.\n5. Reporting data\nInclude the following details when reporting FOT results.\n\t\nInclude the device name, model, software version, and manufacturer.\nInclude input stimulus frequency waveform (e.g., pseudo-random noise, multi-frequency) and associated frequency range.\nInclude the details on subjective and automatic quality control procedures used to determine acceptable replicates and the number of artifact-free replicates included.\nInclude the repeatability or precision of measurement (CoV) and cut-off.\nReport the mean of the replicate measurements that were free of artifact and provided a CoV ≤10% for FOT parameters.",
    "Adhere to laboratory standards regarding which FOT parameters to report.\n\t\tNOTE: While there is currently no consensus on which FOT variables to include, the ERS Technical Standard provides an example of what parameters might be reported as shown in Table 1 for the case example results presented below.\nUtilize reference equations from the population being studied using the same FOT device (if available).\n\tNOTE: Many reference equations will assume accurate recording of age, sex, height, and weight14.\nOptionally, report both the absolute and relative difference if FOT was performed before and after a bronchodilator. Also, include the dose of salbutamol.\n6. Quality control and maintenance\nEmploy a quality control program using biological controls (i.e., ≥2 healthy non-smoking individuals) that involves routine testing on a periodic basis.\n\t\nEstablish a baseline (mean ± SD) through the acquisition of 10-20 artifact-free replicate measurements on different days (acquired within 2 weeks) from each biological control.\nSelect a low- (5 Hz) and mid-frequency (20 Hz) parameter for resistance and reactance to follow for quality control. On subsequent routine periodic testing, compare the results to the baseline measures.\n\t\tNOTE: Refer to recommended guidance for pulmonary function laboratories17 for additional details on how to assess and enact quality assurance standards. The frequency of biological control testing (e.g., weekly, monthly) should reflect the volume of testing in the laboratory.\nFollow the manufacturers' recommendations on regular maintenance such as cleaning, air filter change, software updates, and factory calibration."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}