{
  "id": 3454,
  "origin_website": "Cell",
  "title": "Conditional knockdown protocol for studying cellular communication using Drosophila melanogaster wing imaginal disc",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nGeneration of fly lines\nTiming: 4–6 weeks\nTo investigate the spatiotemporal roles of specific genes within a particular tissue, we employ the UAS/GAL4/GAL80ts system, which provides precise control over gene expression through temperature manipulation. Additionally, we utilize tissue-specific drivers that are accessible in fly genetics. To generate the required fly lines for the experimental setup, a series of meticulously planned crosses is executed in the following manner:\nTo establish the host stock (ex-lacZ, ptc-GAL4, UAS-EGFP/CyO; tubP-GAL80ts/ Tm6B, Sb Tb), perform the following fly crosses:\nIn the first cross, obtain female flies with the genotype of Krlf-1/CyO; GAL80ts/Tm6B, Tb.\nCollect female virgin flies with the genotype of Krlf-1/CyO; +/Tm6B, Tb and cross them with +/CyO; tubP-GAL80ts male flies (Figure 2.1[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig2.jpg\nFigure 2. Generation of host stock\nThe figure shows the crossing scheme to obtain balanced fly host stock that has ex-lacZ, ptc> Gal4 driver, UAS-EGFP under tubP-GAL80ts control.\nIn the second cross, obtain flies with the genotype of ex-lacZ, ptc-GAL4, UAS-EGFP/CyO; tubP-GAL80ts/Tm6B, Sb Tb.\nCross virgin female flies with the genotype Krlf-1/CyO; tubP-GAL80ts/Tm6B, Tb (from step a.i) with male flies with the genotype ex-lacZ, ptc-GAL4, UAS-EGFP/CyO; +/Tm6B, Sb Tb genotype (Figure 2.2[href=https://www.wicell.org#fig2]).\nNote: To accurately collect the desired offspring (ex-lacZ, ptc-GAL4, UAS-EGFP/CyO; tubP-GAL80ts/ Tm6B, Sb Tb), ensure to discard flies displaying Krlf-1, which can be identified by their distinct abnormal eye phenotype.\nSelect virgin female and male flies with the genotype of ex-lacZ, ptc-GAL4, UAS-EGFP/Cyo; tubP-GAL80ts/Tm6B, Sb Tb and maintain them as the host stock for subsequent experiments.",
    "Note: Since the selected offspring (1.c) cannot be identified by phenotype on the third chromosome, it is essential to confirm their genotype of tubP-GAL80ts through an additional cross with a fly stock known to exhibit a strong phenotype. By performing this cross between the selected offspring (1.c) and the fly stock with a known phenotype, any strong wing phenotype observed in the resulting progeny will indicate the presence of tubP-GAL80ts on the third chromosome, verifying the desired genotype of ex-lacZ, ptc-GAL4, UAS-EGFP/Cyo; tubP-GAL80ts/Tm6B, Sb Tb.\nNote: Dominant markers on balancers located on different chromosomes facilitate the identification of desired genotypes based on the phenotypes. This efficient approach expedites the selection process, allowing for easy identification and isolation of progeny with the intended genotype. However, in the event that the flies become homozygous viable, there is a possibility that certain balancers may be lost over time. To ensure the continued presence of balancers, it is recommended to periodically assess the final host fly lines.\nNote: To maintain a clean stock, it is advisable to reintroduce the balancers as necessary. This helps preserve the integrity of the stock and ensures the availability of the desired genotypes for future experiments and breeding.\nGenerating flies for the experiments.\nscrib RNAi flies (ex-lacZ, ptc-GAL4, UAS-EGFP/+; UAS-scrib RNAi/tubP-GAL80ts).\nCross female virgin flies with the genotype ex-lacZ, ptc-GAL4, UAS-EGFP/CyO; tubP-GAL80ts/Tm6B, Sb Tb (flies from cross 1) with UAS-scrib RNAi male flies (Figure 3.1[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig3.jpg\nFigure 3. Generation of UAS-scrib RNAi or UAS-mCherry RNAi flies\nThe figure shows crossing scheme to obtain flies that have ex-lacZ, ptc-Gal4 driver, UAS-EGFP and UAS-scrib RNAi (1) or UAS-mCherry RNAi (2) transgenes under tubP-GAL80ts control.\nNote: When collecting scrib RNAi flies, pick only larvae, which are GFP positive and without Tm6B, Sb Tb balancers.",
    "UAS-mCherry RNAi flies (ex-lacZ, ptc-GAL4, UAS-EGFP/+; UAS-mCherry RNAi/ GAL80ts).\nCross female virgin flies with the genotype ex-lacZ, ptc-GAL4, UAS-EGFP/Cyo; tubP-GAL80ts/Tm6B, Sb Tb (flies from cross 1) with UAS-mCherry RNAi male flies (Figure 3.2[href=https://www.wicell.org#fig3]).\nNote: When collecting mCherry RNAi flies, pick only larvae, which are GFP positive and without Tm6B, Sb Tb balancers.\nCritical: When collecting virgin females, it is important to ensure that they exhibit the phenotypic characteristics typical of virgin flies. These characteristics include the presence of meconium on the abdomen, unfolded wings, and/or a clear and swollen abdomen. To maximize accuracy, it is recommended to collect virgin females within 4–6 h after they have hatched from the pupal case.\nNote: To enhance the yield of progeny, we suggest adding yeast to the vials prior to initiating the crosses. This addition serves to increase the nutrient availability, promoting optimal conditions for the flies and resulting in a higher number of offspring.\nConditional knock-down (KD) of host stocks\nTiming: 6–8 days\nThe application of conditional knockdown (KD) techniques offers a valuable approach to unravel the spatiotemporal roles of genes within specific tissues. By utilizing compartment-specific drivers, it is possible to investigate the mechanisms of intercellular communication operating within that tissue. This method provides a powerful tool to dissect gene functions and understand their contributions to tissue dynamics and development in both physiological and pathological conditions.\nEgg laying.\nPlace the male and female adult flies together in a fresh vial and incubate at 25 degrees for 24 h (Figure 4[href=https://www.wicell.org#fig4]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig4.jpg\nFigure 4. Schedule for conditional KD using UAS/GAL4/GAL80ts system and ptc-GAL4 driver",
    "(A) Schematic of the UAS/GAL4/GAL80ts system. At lower temperatures (18°C–21°C), GAL80ts (red) binds to and inhibits the transcriptional activator GAL4 (green), preventing the expression of RNAi. At higher temperatures (27°C–29°C), GAL80ts disassociates from GAL4, allowing GAL4 to activate transcription and initiate RNAi expression (red).\n(B) Schedule for conditional KD. (I) Flies are maintained at 25°C for 24 h to promote optimal conditions for egg laying. (II) Vials containing embryos are transferred to RT (21°C) for 3 days. (III) After 3 days, the vials are shifted to a 29°C incubator for 2–4 days. (IV) Following the temperature shift, late 3rd instar larvae are collected 2–4 days later for subsequent analysis.\nAfter 24 h, transfer the adult flies to another new vial (Figure 4[href=https://www.wicell.org#fig4]BI).\nNote: The same adult flies can be used for subsequent experiments.\nRaising the flies.\nPlace the vial(s) containing fertilized eggs at 21 degrees for 3 days (3D) (Figure 4[href=https://www.wicell.org#fig4]BII).\nTemperature shift for conditional KD.\nTransfer the vial(s) to 29-degree incubator for a period of 2–4 days (2D/3D/4D) (Figure 4[href=https://www.wicell.org#fig4]BIII).\nCritical: Maintaining consistent timing throughout all the steps is of utmost importance. To ensure that the dissected 3rd instar larvae are at a similar developmental stage (Figure 4[href=https://www.wicell.org#fig4]BIV), it is recommended to synchronize the temperatures and starting time points across all collected samples (Figure 4[href=https://www.wicell.org#fig4]BI–IV). Starting all the steps at the same time of the day can be particularly helpful in achieving this synchronization. By adhering to this approach, you can minimize variations in larval developmental stages and obtain more reliable and comparable results for your experiments Troubleshooting 1, 2.",
    "Note: To ensure precise timing for the dissection of wing imaginal discs, it is advisable to establish three separate vials of the same host stock in parallel for each time point in a given experiment. By following this approach, you can obtain samples from multiple vials at different time points within the 2–4 day period.\nSample preparation\nTiming: 2 days\nIn the subsequent step, a series of procedures are undertaken to prepare the samples for imaging. The sample preparation process encompasses several essential steps, including dissection, fixation, staining, and mounting (Figures 5[href=https://www.wicell.org#fig5], 6[href=https://www.wicell.org#fig6], 7[href=https://www.wicell.org#fig7], and 8[href=https://www.wicell.org#fig8]). These sample preparation procedures ensure that the samples are optimally prepared and ready for imaging, allowing for detailed examination and analysis. The quality of the sample preparation significantly influences the accuracy and interpretability of the subsequent imaging results, making this step a crucial determinant of the overall success of the experimental investigation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig5.jpg\nFigure 5. Materials and equipment needed for sample dissection and fixation\nThe figure shows the following items needed for sample preparation: (1) Sample of larvae (2) 1×PBT (3) 1×PBS (4) Forceps (tip size 0.1 × 0.06 mm) (5) Glass bottom dish (35 mm) (6) 100–1000 μL tips (7) 20–200/300 μL tips (8) 100–1000 μL pipette (9) 20–200 μL pipette (10a) Silicone plate (10b) Cavity well microscope slide (11) Stereo microscope (12) Ice container (13) Nitrile or latex gloves (14) 37% formaldehyde (15) 1.5 mL Eppendorf tubes.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig6.jpg\nFigure 6. First dissection to expose the wing discs\n(A) Position the larva on a silicon or glass plate.\n(B) Remove roughly one-third of the posterior end of the larva.\n(C) Expose the wing discs (wd) located on the anterior part of the larva.",
    "(D) A closer view of the exposed wing disc. A – anterior. P – posterior. Wd – wing disc. Scale bar 1 mm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig7.jpg\nFigure 7. Sample mounting for imaging\nThe figure shows the following items used for mounting the sample: (1) A microscope side tray (2) 70% ethanol (3) Kim Wipes (4) Superfrost microscope slides (5) Transparent tape (6) Scalpel (blaze size 10) (7) Scissors (8a) A cavity well microscope slide (8b) A silicone plate (9) A permanent marker (10a) Commercial mounting solution (10b) 70% glycerol in 1× PBS (11) Forceps (tip size 0.1 × 0.06 mm) (12) Cover slips (13) Transparent nail polish (14) 2–200 μL tips (15) 2–20 μL pipette (16) 20–200 μL pipette (17) Stereo microscope.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig8.jpg\nFigure 8. Microscope slide preparation for sample mounting\n(A) Use a positively charged microscope slide to facilitate proper sample adhesion. (B) Position a piece of tape at the center of the slide ensuring it adheres securely. (C) Use a scalpel to create a gap in the center area of the tape providing a defined area for the sample. (D) After adding the mounting solution and sealing the cover glass with transparent nail polish, the prepared sample is now ready for imaging.\nFirst dissection to expose the wing discs.\nBegin by carefully collecting the larvae displaying the desired phenotype and transfer them into a suitable container, such as a glass bottom dish (GBD), containing 1× Phosphate-buffered saline (PBS)\nPlace the GBD with larvae onto a bed of ice.\nNote: This cooling technique serves two purposes. Firstly, it minimizes the mobility of the larvae, making the subsequent dissection process more manageable and precise. Secondly, the cold temperature slows down the developmental processes, allowing for extended dissecting time.",
    "Gently transfer the larvae from the container onto a puddle of 1×PBS on a glass or silicone plate (Figure 6[href=https://www.wicell.org#fig6]A, Methods video S1[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Dissection of wing imaginal discs by employing “Opening of the window” technique, related to steps 6 and 8\n    \nUtilize the “Opening the window” technique as the initial dissection approach for the larvae.\nUse forceps to carefully remove approximately one-third of the posterior end of the larvae (Figure 6[href=https://www.wicell.org#fig6]B, Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: The selective removal of one-third of the posterior end effectively eliminates a significant portion of the intestines while preserving the anterior part housing the wing discs, ensuring optimal isolation of the wing discs while minimizing interference from other tissues.\nUse forceps to gently expose the wing discs located on the anterior part of the larvae (Figures 6[href=https://www.wicell.org#fig6]C and 6D, Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: The “Opening the window” technique facilitates the visualization and accessibility of the wing discs, which should naturally pop out to the sides on the anterior part of the larvae. This technique enables a clear view of the targeted tissue and ensures that the subsequent experimental procedures can be conducted with greater ease and accuracy.\nCarefully transfer the anterior part of the larvae, containing the exposed wing discs, into a 1.5 mL Eppendorf tube containing 1×PBS (Figures 6[href=https://www.wicell.org#fig6]C and 6D, Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: It is recommended to place the Eppendorf tubes containing wing discs onto a bed of ice. This additional cooling step helps to minimize any potential damage or degradation of the tissue. The cold temperature aids in preserving the wing discs' integrity until the fixation process is initiated.\nFixation of exposed wing discs.\nBegin by preparing a 3.7% formaldehyde (FA) solution in a separate 1.5 mL Eppendorf tube.",
    "Note: To create the 3.7% fixation solution from the original 37% FA, combine 900 μL of 1×PBT and 100 μL of 37% FA.\nCritical: It is of utmost importance to exercise caution and follow proper safety measures when working with FA, as it is a toxic irritant and carcinogen. All procedures involving FA must be conducted in a laminar hood, ensuring proper ventilation, and wearing appropriate protective gloves to minimize exposure risks.\nCarefully remove the 1× PBS from the tube containing the exposed wing discs.\nAdd the prepared FA solution to the tube containing the exposed wing discs.\nIncubate the tube with the FA solution at RT for 20 min to allow proper fixation of the wing discs.\nCarefully remove the FA solution from the tube, taking care not to disrupt the wing discs during the removal process.\nProceed to wash the sample by performing three consecutive washes, each lasting 5 min, using 1×PBT.\nSecond dissection to obtain the wing imaginal discs.\nTransfer the anterior part of the larvae, containing the exposed wing discs, to a puddle of 1× PBS on a glass or silicone plate (Methods video S1[href=https://www.wicell.org#mmc1]).\nCarefully dissect one wing disc from each larva (Methods video S1[href=https://www.wicell.org#mmc1]).\nCollect the dissected wing discs and transfer them to a separate Eppendorf tube containing 1× PBT (Methods video S1[href=https://www.wicell.org#mmc1]).\nNote: To ensure gentle and precise handling of the wing discs during the transfer phase, we recommend utilizing 1 mL pipette tips. These pipette tips provide a controlled and consistent flow, minimizing the risk of sample damage or disruption.\nPerform three consecutive washes of the samples by immersing them in 1× PBT for 10 min each time.",
    "Note: It is important to allow sufficient time (10 min) between washes to allow the wing discs to settle at the bottom of the Eppendorf tube, minimizing the loss of samples during the washing process.\nAfter the final wash, leave the washed wing discs in 1× PBT for an additional 15 min.\nImmunostaining.\nBlocking buffer (BB).\nTo minimize nonspecific binding and prevent antibodies from binding to nonspecific sites, blocking of the wing discs is performed using normal goat serum (NGS).\nPrepare a 5% NGS in 1× PBT in a separate 1.5 mL Eppendorf tube by adding 95 μL of 1× PBT and 5 μL of NGS.\nNote: In our experience, 100 μL of BB solution is sufficient for one sample.\nRemove 1× PBT from the tube containing washed wing discs and add the BB solution to the sample.\nIncubate the BB at RT for 1 h.\nPrimary antibody staining.\nRemove the BB solution (9.a) from the sample.\nNote: Alternatively, an efficient approach is to use the same BB solution and incorporate primary antibodies (ABs) into it.\nPrepare the antibody (AB) solution by diluting the desired primary AB(s) in a separate Eppendorf tube, ensuring a final volume of 100 μL containing 5 μL of NGS and 95 μL of 1×PBT.\nThe dilution ratios for different ABs are as follows: rabbit anti-Scribble (1:200), mouse anti-β-Galactosidase (1:500), mouse anti-Dlg (1:50), rabbit anti-aPKC (1:100), and rat anti-DE-Cad (1:50).\nNote: The selected antibodies target specific proteins of interest. Rabbit anti-Scribble recognizes Scribble protein, mouse anti-β-Galactosidase functions as a readout for Yorkie (Yki) signal (ex-LacZ), mouse anti-Dlg serves as an ABP marker for Dlg protein, rabbit anti-aPKC identifies the apical marker aPKC, and rat anti-DE-Cad recognizes DE-Cadherin localized at adherens junctions.\nAdd the primary AB solution to the tube containing the wing discs.",
    "Allow the primary AB staining to incubate overnight at 4 degrees.\nGently remove the primary AB staining from the wing discs.\nPerform three consecutive 10-min washes of the sample using 1× PBT at RT.\nNote: The 10-min intervals between washes allow adequate time for the wings to settle at the bottom of the tube and prevent any loss of sample.\nSecondary antibody staining.\nPrepare the AB solution by diluting the desired secondary ABs (1:200) in a separate Eppendorf tube, ensuring a final volume of 100 μL. This solution should consist of 5 μL of NGS and 95 μL of 1×PBT.\nAfter washing away the excess primary AB solution, remove 1×PBT from the tube containing wing discs.\nAdd the secondary AB solution to the sample.\nCritical: The secondary AB(s) recognize the primary AB(s), enabling the detection and visualization of the target proteins. It is essential to ensure compatibility between the primary and secondary antibodies before proceeding, based on the host species of the primary antibody.\nIncubate the secondary AB solution for 2 h at RT.\nNote: The secondary AB staining should be done in the dark.\nMounting of the sample(s).\nPreparing the microscopy slide.\nPlace a piece of tape at the center of a positively charged microscopy slide (LabSolute Cat# 765019) (Figures 8[href=https://www.wicell.org#fig8]A and 8B).\nUse a scalpel to carefully create a gap in the center portion of the tape (Figure 8[href=https://www.wicell.org#fig8]C).\nNote: Alternatively, use two pieces of tape with a gap between them.\nClean the designated sample area on the slide using a Kimwipe sprayed with 70% ethanol.\nNote: Use a small amount of 70% ethanol to avoid disrupting the charge on the slide.\nMounting the sample on the slide.\nTransfer the wings from the Eppendorf tube onto a separate glass or silicone plate using a 20–200 μL pipette.",
    "Note: Employ a careful pipetting technique to ensure the precise and delicate transfer of the wing samples, while also avoiding the transfer of excess liquid to the microscopy slide.\nCarefully transfer the wings onto the gap of the microscopy slide.\nNote: Avoid transferring excessive liquid, as it may be challenging to remove later.\nRemove any excess liquid from the sample using a Kimwipe.\nNote: Alternatively, use a pipette to suction up the extra liquid.\nAdd a drop of mounting solution to the center of the sample.\nNote: Use either a commercial mounting solution or prepare 70% glycerol in 1×PBS.\nCritical: If using 70% glycerol as a mounting solution, ensure that the pH is correct (optimal 7.5).\nPlace a cover glass over the sample using forceps.\nNote: Start by touching one edge of the cover glass to the slide first, and then slowly lower the other edge to avoid air bubbles.\nSeal the edges of the cover glass with transparent nail polish to secure it in place (Figure 8[href=https://www.wicell.org#fig8]D).\nImaging\nTiming: 1–2 days\nTo analyze the staining patterns and intensity of the target proteins in the wing imaginal disc, the prepared slides are subjected to imaging using a confocal microscope. This allows for precise visualization and assessment of the presence and distribution of the target proteins. The choice of wavelengths for the confocal microscope is determined based on the specific fluorescent proteins and antibodies employed in the staining process.\nWhen initiating the imaging process, select the excitation wavelengths based on the absorption and fluorescent proteins used (Leica SP8 confocal microscope).\nDetermine the appropriate zoom level for imaging the wings.\nFor imaging the entire wing disc, we recommend using a 20× zoom objective.\nFor imaging at the (sub)-cellular level, a 60×/90× zoom objective is recommended.",
    "Note: Different objectives can be applied depending on the specific region of interest.\nUtilize Z-stack imaging.\nZ-stack imaging involves capturing multiple images of the same sample on different focal planes along Z-axis. This technique enhances better visualization and subsequent analysis within the tissue.\nSet the starting and end point for the Z-stack to cover the entire Z-axis (the vertical axis) of the wing imaginal disc.\nThe choice of Z-stack step depends on the desired information from the image.\nNote: For high quality images, we recommend using Z-stack step of 1 μm. If the goal is to analyze the image on a sub-cellular level, a step size of 0.5–0.7 μm can be implemented.\nSelect the appropriate pixel count for the images.\nChoose the proper pixel count depending on the imaging goal.\nNote: For high quality images, a pixel count of 1054 × 1054 is suitable. However, it is important to consider that higher pixel counts will require more time to capture the images.\nImage analysis\nTiming: 1–7 days\nTo facilitate the analysis of confocal microscope images obtained through Z-stack imaging and multi-color fluorescence, a combination of ImageJ/Fiji and CorelDRAW software is utilized. These tools provide functionalities such as merging of channels, Z-stack compression, and enabling subsequent analysis by marking regions of cells expressing GFP within the Ptc domain.\nMerging channels using ImageJ/Fiji.\nDrag and Drop the confocal image into the ImageJ/Fiji software (Figure 9[href=https://www.wicell.org#fig9]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig9.jpg\nFigure 9. Process of channel merging and Z-stack compression using ImageJ/Fiji",
    "Drag and Drop the confocal image into ImageJ/Fiji (A). Select Split channels (B). To merge the channels, navigate to Image menu, select Color, and Merge Channels (C). Verify the appropriate starting and ending points for Z-stacks before proceeding with compression (D-E). To compress the channels, select desired slices within the Image menu, under the Stacks option, and choose Z- Project (F). Specify the starting and stopping slices for compression (G).\nNote: If you use multiple channels, we recommend selecting “Split channels” (Figure 9[href=https://www.wicell.org#fig9]B).\nNavigate to the Image menu, select “Color”, and then choose “Merge channels” (Figure 9[href=https://www.wicell.org#fig9]C).\nFrom the available options, select appropriate channels.\nNote: We recommend selecting the appropriate channel colors from the source image channels.\nZ-stack maximum intensity projection by utilizing ImageJ/Fiji.\nSelect the Image menu, go to “Stacks”, and choose “Z Project” (Figure 9[href=https://www.wicell.org#fig9]F).\nNote: Prior to performing the compression, it is advisable to ensure the accurate selection of the appropriate starting and ending points for the Z-stacks (Figures 9[href=https://www.wicell.org#fig9]D and 9E).\nSelect the starting and ending stacks and compress the stacks (Figure 9[href=https://www.wicell.org#fig9]G).\nSave the image.\nAfter the channel merging and Z-stack compression, navigate to the File menu within ImageJ/Fiji.\nChoose a suitable file format.\nNote: We suggest using TIFF (Tagged Image File Format) as it provides a high-quality image.\nSpecify the desired file name.\nMarking the GFP expression region in CorelDRAW.\nStart a new document in CorelDRAW, specifying the desired width and height for the document (Figure 10[href=https://www.wicell.org#fig10]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig10.jpg\nFigure 10. Marking the GFP expression region using CorelDRAW software",
    "(A–F) Specify the desired width and height for the new document to create an appropriate canvas (A). Import the image into CorelDRAW (B). Utilize the Freehand tool located in the left-hand panel to draw the line along the GFP expression region (C). Customize the line by setting the desired outline width and selecting a suitable line style (D). Modify the drawn line further by selecting the Shape option in the left-hand panel (E). Choose a color that effectively highlights the GFP expression region by selecting the desired color from the available options in the right-side panel (F).\nImport the image into CorelDRAW by dragging and dropping it onto the canvas (Figure 10[href=https://www.wicell.org#fig10]B).\nSelect the Freehand tool from the left-hand panel (Figure 10[href=https://www.wicell.org#fig10]C).\nNote: Holding down the left mouse button allows for drawing the line directly.\nSet the desired outline width and choose a line style to customize the appearance of the line (Figure 10[href=https://www.wicell.org#fig10]D).\nTrace and mark the GFP-positive area by drawing a line.\nSelect the Shape option in the left-hand panel (Figure 10[href=https://www.wicell.org#fig10]E) to modify the drawn line, such as adding curves or altering its shape.\nChoose the desired color for the line from the options provided in the right-hand panel (Figure 10[href=https://www.wicell.org#fig10]F).\nSave the image.\nOnce the GFP positive area has been marked, navigate to the File menu, choose the Save as option and save the image with the marked GFP-positive area.\nVerification of wing disc phenotypes by various antibodies\nTiming: 1–2 days",
    "To investigate the growth regulatory mechanisms within the wing imaginal disc in the context of ABP, a range of selected antibodies targeting specific proteins of interest can be utilized. These antibodies play a crucial role in elucidating various phenotypes by providing valuable insights into protein distribution with precision and comprehensiveness. Additionally, Phalloidin staining can be employed to selectively bind and stain filamentous actin (F-actin) in cells, allowing for examination of the tissue architecture of the wing imaginal disc. These approaches enable the verification of the phenotypes, including assessing polarity, proliferation, and tissue architecture of the wing disc.\nThe antibodies used for verification and their respective roles are as follows.\nRabbit anti-Scribble:\nThe Scribble antibody specifically recognizes the Scribble protein (Figures 11[href=https://www.wicell.org#fig11]A and 11B). It aids in visualizing the distribution pattern of Scribble and provides information about its overall abundance within the wing disc. Utilizing conditional KD of scrib enables investigation of the potential mechanism of Scrib-mediated tissue growth and homeostasis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3031-Fig11.jpg\nFigure 11. Verification of the phenotype of the wing disc epithelium using antibody staining (from Huang et al.1[href=https://www.wicell.org#bib1])\n(A) Scribble antibody (magenta) is used to visualize the distribution pattern of Scrib in the wing disc. The loss of Scrib in adjacent cells from the Ptc-GFP domain (green) suggests a potential mechanism of cell-cell communication to disrupt ABP, ultimately leading to the neoplasia phenotype (4D ATS) Troubleshooting 3.\n(B) DE-Cad antibody (green) targeting AJs (adherens junctions) can be used alongside Scrib staining (gray) to visualize the loss of epitheliality. Double knockdown (dKD) of scrib and DE-cad leads to the disruption of DE-Cad and loss of Scrib.",
    "(C) The use of aPKC (green) and Dlg (magenta) antibodies are used as ABP markers. Disruption or absence of aPKC and/or Dlg, which are normally located at the apical side, indicate loss of ABP. DAPI staining (blue) aids visualizing nuclei of wing disc epithelia. The presence of multicellular tissue architecture is characteristic to neoplasia in scrib mutant tissue (scrib2/scrib5). (D) Phalloidin stain (green) targeting F-actin is used to visualize the wing epithelial sheet. In a normal wing disc (scrib2/+), the epithelial sheet is a monolayer of epithelial cells. The presence of multicellular tissue architecture confirms neoplasia phenotype in scrib mutant tissue (scrib2/scrib5). Ex-LacZ staining (magenta) is used as a readout of Yorkie (Yki) signaling. The upregulation of the Yki signal indicates increased proliferation and serves as an indicator to verify the neoplasia phenotype in scrib mutant tissue (scrib2/scrib5). Scale bars, 50 μm (A), 20 μm (B, C), 100 μm (D).\nMouse anti-Dlg:\nMouse anti-Dlg serves as a crucial marker for the ABP protein Dlg (Figure 11[href=https://www.wicell.org#fig11]C). Its application ensures accurate identification and localization of Dlg protein, thus validating the effectiveness of the ABP marker. The absence of Dlg indicates loss of ABP, thereby serving as an indicator of polarity disruption.\nMouse anti-β-Galactosidase:\nMouse anti-β-Galactosidase staining is used as a readout for Yorkie (Yki) signaling due to LacZ reporter of Yki target gene expanded (ex) (Figure 11[href=https://www.wicell.org#fig11]D). Presence of Yki staining indicates higher proliferation in the wing disc, making it a reliable marker for verifying the neoplasia or hyperplasia phenotype in the wing imaginal disc.\nRabbit anti-aPKC:",
    "Rabbit anti-aPKC is capable of identifying the apical marker protein aPKC (Figure 11[href=https://www.wicell.org#fig11]C). This antibody provides insights into the normal ABP, if present within the wing imaginal disc. The absence of aPKC at the apical side of the wing indicates disrupted polarity, allowing for phenotypic verification of loss of APB.\nRat anti-DE-Cad:\nRat anti-DE-Cad recognizes Drosophila DE-Cad/Shotgun, which is localized at adherens junctions in the wing epithelial cells (Figure 11[href=https://www.wicell.org#fig11]B). DE-Cad staining can be utilized to assess the loss of epitheliality during neoplasia formation.\nPhalloidin:\nPhalloidin selectively binds to F-actin and is widely used to visualize cytoskeletal organization, cell shapes, and the integrity of wing epithelial sheet (Figure 11[href=https://www.wicell.org#fig11]D). Since the wing disc is normally a monolayer, the presence of a multicellular tissue architecture indicates a neoplasia phenotype.\nDAPI.\n4′,6-diamidino-2-phenylindole (DAPI) is a highly specific DNA stain that preferentially binds to AT-rich regions of the DNA molecule and visualizes cell nuclei (Figure 11[href=https://www.wicell.org#fig11]C). DAPI staining enables the visualization and identification of the location and morphology of cell nuclei within the wing disc."
  ],
  "subjectAreas": [
    "Microscopy",
    "Developmental Biology",
    "Genetics",
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}