{
  "id": 8969,
  "origin_website": "Jove",
  "title": "Anatomically Inspired Three-dimensional Micro-tissue Engineered Neural Networks for Nervous System Reconstruction, Modulation, and Modeling",
  "procedures": [
    "All procedures involving animals were approved by the Institutional Animal Care and Use Committees at the University of Pennsylvania and the Michael J. Crescenz Veterans Affairs Medical Center and adhered to the guidelines set forth in the NIH Public Health Service Policy on Humane Care and Use of Laboratory Animals (2015).\n1. Development of the Agarose Hydrogel (Acellular Component of micro-TENNs)\nAgarose solution preparation\nWithin a biosafety cabinet, prepare reservoirs for the micro-columns by transferring 20 mL of Dulbecco's phosphate-buffered saline (DPBS) to each of two 10-cm Petri dishes. Sterilize fine forceps and microscalpels with a hot bead sterilizer.\nWeigh 3 g of agarose and transfer it to a sterile beaker inside the biosafety cabinet. Add 100 mL of DPBS for a final concentration of 3% weight/volume (w/v). Include a clean magnetic bar and cover the beaker with aluminum foil.\nWith a hot plate/stirrer, warm the beaker at 100 °C and stir at 120-200 rpm to completely dissolve the agarose (the solution will turn from cloudy to clear). Maintain the heating and stirring afterwards to prevent gelation and change the heating temperature as necessary to avoid burning the agarose.\n\t\tNOTE: Fabrication with both the laser-cut device and capillary tubes is presented below in sub-sections 1.2 and 1.3, respectively. Proceed to sub-section 1.4 after finishing the steps described in either sub-section. For both micro-column fabrication methods, add the liquid agarose quickly, as agarose solidifies rapidly as it cools. When sterilizing with an autoclave in any of the following steps, use the standard conditions applied to glassware.\nMicro-column preparation using a laser-cut device",
    "NOTE: The laser-cut device is cut from transparent acrylic using a commercial CO2 laser cutter. The fabrication of structures and devices through laser cutting is well-documented for a range of engineering and research applications45,46,47. This mold (Figure 3) consists of an array of five cylindrical channels, each with a diameter of 398 µm and a length of 6.35 mm. These cylindrical arrays are formed along their length by two pieces: a bottom half (length: 25.4 mm, width: 6.35 mm, height: 6.0 mm) and a top half (length: 31.5 mm, width: 6.35 mm, height: 12.7 mm), as shown in Figures 3A and 3B, respectively. The two halves can be clamped together by the anterior and posterior caps observed in Figure 3C (length: 31.5 mm, width: 6.35 mm, height: 12.7 mm), which feature four alignment holes that coincide with two holes each on the top and bottom pieces and that help secure all the parts together when screwed. These caps also include five holes, concentric to the cylindrical channels, into which the acupuncture needles can be inserted to form the lumen of the micro-columns.\n\t\nSterilize the device shown in Figure 3 by covering it with aluminum foil and autoclaving. Assemble the device as shown in Figure 3D by aligning the anterior and posterior caps with only the bottom-half piece and securing the three parts with two #4-40 screws and nuts (thread diameter: 3.05 mm) in the bottom alignment holes.\nFully introduce an acupuncture needle (diameter: 180 µm, length: 30 mm) into the needle holes on either the anterior or posterior cap of the device (Figure 3D). With a micropipette, pour enough liquid agarose (~1 mL for the five channels) on the bottom-half piece to completely fill each of the cylindrical channel halves.",
    "Immediately place the top-half piece of the device over the bottom half and apply pressure until it is firmly in place to complete the cylindrical channels (friction between the caps and the top piece will keep the latter in place). Wait ~5 min at room temperature after agarose addition to permit its gelation inside the channels of the device.\nManually extract the needle from each of the holes on the caps of the device. Remove the screws and manually separate the two caps and the top half from the bottom-half piece, where the latter will be holding the hydrogel micro-columns.\nUse fine forceps to gently remove the micro-columns from the channels on the bottom-half piece and place them into the previously prepared Petri dish containing DPBS (step 1.1.1). Reutilize the device for another round of micro-column fabrication. Proceed to sub-section 1.4.\nMicro-column fabrication using capillary tubes\nTransfer glass capillary tubes (diameter: 398.78 µm, length: 32 mm) to the inside of the biosafety cabinet. Manually break the long tubes into 2.0–2.5-cm fragments and fully insert one acupuncture needle (diameter: 180 µm, length: 30 mm) into each fragment (Figure 2A).\nTransfer 1 mL of liquid agarose from the beaker to the surface of an empty Petri dish. Holding the capillary tube and the introduced needle, place one end of the tube in contact with the liquid agarose pool to fill it by capillary action. Agitate the tube to promote capillary rise.\n\t\tNOTE: Fill the capillary tubes with liquid agarose as high as the capillary action permits; afterwards, these micro-columns can be cut into smaller constructs depending on the desired length. The 1-mL agarose pool is typically used for only one tube, since the agarose cools and gels rapidly, preventing further capillary action.",
    "When the liquid ceases to rise, remove the capillary tube from the pool and place it horizontally on the surface of a Petri dish. Wait for 5 min to let the agarose gel inside the tubes.\nSituate the thumb and index finger on either side of the tube and press against it. Use the other hand to quickly pull the needle out while using the thumb and index finger to prevent the micro-column itself from sliding out of the tube. Insert a 30-gauge needle into the capillary tube to slowly push the micro-column out into a dish containing DPBS (step 1.1.1).\nMicro-column trimming and sterilization\nDelicately transfer one micro-column from DPBS to an empty dish using fine forceps. Add 10 µL of DBPS to the top of the micro-column with a micropipette to prevent drying. Place the latter dish below a stereoscope for visual guidance.\n\t\tNOTE: Throughout the protocol, micro-column drying or dehydration refers to the acquisition of a crumpled structure that is visually distinguishable from the typical, hydrated appearance of these constructs. Dehydrated micro-columns firmly attach to the surface of Petri dishes and cannot be easily moved, whereas hydrated constructs tend to slide across the surface after being manipulated with forceps. A phase-contrast image of a completely dried micro-column is shown in Figure 8A.\nTrim the micro-column with a microscalpel to shorten it to the desired length (here, 2-5 mm). Transport the trimmed micro-column with fine forceps to the other DPBS Petri dish prepared in step 1.1.1.\nRepeat steps 1.4.1 and 1.4.2 for each fabricated micro-column.\nSterilize the micro-columns in the DPBS-containing Petri dishes under ultraviolet (UV) light for 1 h. Store the Petri dishes at 4 °C prior to ECM addition and cell plating.\n2. Primary Neuron Culture and Forced Cell Aggregation Method",
    "Preparation of the pyramidal micro-well array\n\tNOTE: This section employs a 3D-printed mold consisting of a cylindrical base (diameter: 2.2 cm, height: 7.0 mm) and nine square pyramids on top (side length: 4.0 mm, slant angle: 60°), organized in a 3 x 3 array, as shown in Figure 3E. The additive manufacturing process using commercially available 3D printers is well-documented. Computer-aided design software can be used to design the mold. The resultant design file can then be digitally converted into a tool-path for a 3D printer. Each printer has different specifications, and the instructions for setting up and operating a 3D printer vary accordingly.\n\t\nUse a 3/32\" drill bit to puncture 16 holes in a 4 x 4 array (side length: 4 cm, hole separation: 1 cm), centered in the lid of a 10 cm Petri dish. Inside a chemical fume hood, use the bottom piece of the Petri dish to weigh 27 g of polydimethylsiloxane (PDMS) and 3 g of curing agent (for a 1:10 ratio). Stir with a micro-spatula to distribute the agent evenly.\nCover the PDMS/curing agent with the punctured lid. Connect one end of a hose to the vacuum port of the fume hood and insert the other end into the stem of a funnel (mouth diameter: 10 cm, stem length: 3 cm, stem diameter: 1.5 cm).\nMake an opening with a 3/32\" drill bit at the top of a 1 mL pipette bulb and insert and secure a 1,000 µL micropipette tip into the opening (with the pointed end upwards). Place the bulb and tip into the hose and pull the hose upwards until the bulb seals the hose into the stem of the funnel.",
    "Place the funnel on the punctured dish lid and secure the hose with an available sturdy support. Open the vacuum valve for 5 min to suction and bring the air bubbles to the surface.\nClose the valve, remove the funnel, and hit the Petri dish against the surface of the fume hood ~3 times to burst any remaining air bubbles.\nPlace a pyramidal-well 3D-printed mold into each of the wells in a 12-well culture plate, with the pyramids pointing up. Pour the PDMS/curing agent on top of the molds until each well of the plate is filled. Cover the 12-well plate with its lid and transfer it to an oven for 1 h at 60 °C to dry.\nCarefully remove each PDMS micro-well array (Figure 3F) from the plate with a micro-spatula. Cover the PDMS arrays with aluminum foil and sterilize by autoclaving. Inside a biosafety cabinet, insert one micro-well array into each well of a 12-well plate (Figure 2B).\nCortical neuron isolation from rat fetuses\nAdd ~20 mL of Hank's balanced salt solution (HBSS) to each of four to six 10 cm Petri dishes (one for each dissected tissue) inside a biosafety cabinet. Transfer these dishes to a dissection hood and place them on ice. Sterilize dissection instruments, such as microscalpels, scissors, and forceps, with a hot bead sterilizer.\nPre-warm embryonic neuron basal medium + 2% serum-free supplement + 0.4 mM L-glutamine (referred to as \"culture medium\" hereafter) and 0.25% trypsin + 1 mM ethylenediaminetetraacetic acid (EDTA) at 37 °C. Thaw deoxyribonuclease (DNase) I by placing it at room temperature. Prepare 1.5 mL of a 0.15 mg/mL DNAse I solution in HBSS and maintain the solution on ice.",
    "Euthanize a timed-pregnant embryonic-day-18 rat by carbon dioxide inhalation and confirm death by decapitation. Transfer the carcass to a sterile dissection hood and lay it ventral-side up. Rinse the abdomen thoroughly with 70% ethanol.\nOpen the uterus and remove the fetuses (usually ~11) from the amniotic sacs with scissors and transfer them with forceps to a Petri dish containing cold HBSS, as described48. Place a chilled (-20 °C) granite block below the stereoscope. Place the Petri dish on the surface of this cold block to conserve the low temperature of the HBSS throughout the dissection procedure.\nRinse the pups by swishing the HBSS around and then transfer them to the next clean dish containing HBSS. With the aid of the stereoscope and the dissection instruments, sequentially remove the heads, cerebral hemispheres, and cortices of the fetuses and transfer each tissue with forceps to a new HBSS-filled dish after each dissection48.\nAspirate only the cortices with a Pasteur pipette and place the tissue into a sterile 15 mL centrifuge tube. Discard the other dissected tissues. Rinse the cortices three times by sequentially adding and removing ~5 mL of HBSS with a serological pipette. Place the tube on ice when not in use.\nTransfer the cortices with a Pasteur pipette to a 15 mL tube containing pre-warmed trypsin-EDTA (4-6 cortices per 5 mL of trypsin-EDTA). Manually agitate the tube once and place it at 37 °C. Invert the tube every 3 min to prevent the tissue from clumping.\nStop the exposure to trypsin after ~10 min by removing the tissue with a Pasteur pipette and transferring it to a clean 15 mL centrifuge tube. Add the 0.15 mg/mL DNase I solution (1.5 mL) to the tube with a pipette.",
    "Use a Pasteur pipette to manually break up tissue clumps and then vortex (~30 s) until the solution appears homogeneous and there are no remaining tissue fragments in the liquid. If it is not possible to completely homogenize the solution, extract the insoluble fragments by pulling them into the tip of a Pasteur pipette.\nCentrifuge the homogeneous cell solution obtained in step 2.2.9 at 200 x g for 3 min. Remove the supernatant with a Pasteur pipette, taking care not to disturb the pelleted cells. Add 2 mL of culture medium with a serological pipette and vortex to resuspend the cells.\nCount the number of cells in the solution prepared in step 2.2.10 using a hemocytometer; the expected yield is 3.0-5.0 x 106 cells/cortical hemisphere. Prepare 1 mL or more of cell suspension in culture medium, with a density of 1.0-2.0 x 106 cells/mL.\nFormation of neuronal cell aggregates\nWith a micropipette, add 12 µL of the 1.0-2.0 x 106/mL cell suspension into each micro-well of the PDMS array (that was placed in the plate in step 2.1.7).\n\t\tNOTE: The cell concentration can be adjusted depending on micro-column ID and the desired cell aggregate size, as higher concentrations yield larger aggregates.\nCentrifuge the plate at 200 x g for 5 min to force the aggregation of cells at the bottom of the micro-wells (Figure 2B). Carefully add ~2 mL of culture medium to the top of each PDMS array to cover all the seeded micro-wells, taking care not to disturb the aggregated cells.\nIf cells will not be transduced with a viral vector, incubate the plate for 12-24 h at 37 °C and 5% CO2 and then proceed to section 3. If the aggregates will be transduced, skip the incubation and proceed to section 2.4.",
    "Transduction with a viral vector to observe calcium signaling\n\tNote: These steps are performed to transduce neurons with a viral vector containing a genetically encoded calcium indicator (GECI). The results shown in this article were obtained using a commercially available adeno-associated virus (AAV) (serotype 1) with GCaMP6f, a GECI with fast kinetics consisting of green fluorescent protein (GFP), calmodulin (CaM), and the M13 peptide, driven by the human Synapsin I promoter. The viral vector solution may require dilution in sterile DPBS prior to transduction, depending on the concentration of the stock solution. Cell health/morphology and GCaMP6f signal strength must be observed over time for a range of vector concentrations. This optimization procedure must be performed by each investigator to determine the appropriate titer for their own cell cultures. The typical GCaMP6f expression time is 7-8 days following the transduction that occurs during the incubation done in step 2.4.2.\n\t\nWith a micropipette, add the required volume of viral vector solution (for a final concentration of ~3.0 x 109 genomic copies per aggregate) to the culture medium, covering the aggregates. Slowly pipette up and down to ensure that that the vector solution is homogeneously distributed throughout the culture medium.\nIncubate the plate with the seeded pyramidal micro-wells for 24 h at 37 °C and 5% CO2 to allow for the viral transduction of GCaMP6f.\n\t\t \n3. Development of the Cellular Component of micro-TENNs\nECM core fabrication\nAfter aggregate incubation, add type I collagen and laminin to the culture medium (for a concentration of 1 mg/mL each) in a microcentrifuge tube to prepare the ECM solution. Perform steps 3.1.2-3.1.4 at room temperature, but maintain the tube with ECM on ice when not in use to prevent premature gelation.",
    "NOTE: The typical expenditure is 4 µL of ECM solution for each micro-column (length: 5 mm, ID: 180 µm).\nAdjust the pH of the ECM solution by transferring 1-2 µL to litmus paper to verify the initial pH, adding 1 µL of 1 N sodium hydroxide (NaOH) and/or 1 N hydrochloric acid (HCl) to the ECM, as needed, and repeating until the pH is 7.2-7.4. Ensure homogenization of the ECM solution by pipetting up and down while avoiding the formation of air bubbles.\nTransfer the micro-columns with sterilized forceps from the dishes in step 1.4.3 to empty 35- or 60-mm Petri dishes. Work on 4-5 micro-columns at a time to prevent dehydration. Attach a 10-µL tip attached to a 1,000-µL tip to a micropipette. Using the stereoscope for visual guidance, place the tip at one end of the micro-columns and suction to extract residual DPBS and air bubbles from the lumen.\nQuickly draw up 4-5 µL of ECM in a micropipette. Observing under a stereoscope, place the tip of the micropipette at one of the ends of the micro-columns and discharge enough ECM to fill the lumen. Confirm the absence of air bubbles in the lumen, as these may inhibit axonal outgrowth through the ECM. If air bubbles exist, remove the ECM, as explained in step 3.1.3, and add the ECM again.\nTo prevent dehydration, add ~2 µL of ECM around each micro-column. Incubate the hydrogel/ECM micro-columns in the Petri dishes at 37 °C and 5% CO2 for 25 min. Proceed to cell seeding immediately after incubation.\n\t\tNOTE: The incubation period in step 3.1.5 is intended to allow time for the polymerization of collagen and laminin inside the micro-columns.\nNeuronal cell seeding in the micro-columns",
    "NOTE: To change the culture medium of the transduced aggregates, tilt the plate, use a micropipette to remove the medium that pools on the wall of the well, and then slowly add ~1 mL against the wall (to avoid disturbing the aggregates in the pyramidal micro-wells). Repeat this medium change a second time.\n\t\nFollowing the incubation period in step 3.1.5, transfer approximately 10-20 µL of culture medium to two free areas in the Petri dishes holding the micro-columns. Use a micropipette to individually transfer the aggregates to the Petri dish containing the constructs and move them with forceps to one of the small pools of culture medium to preserve cell health.\nWhile observing under a stereoscope, insert an aggregate at each end of the micro-columns for bidirectional micro-TENNs or at one end for a unidirectional architecture (as desired) using forceps. Confirm the placement of the aggregates inside the micro-columns using the stereoscope. Use forceps to move the seeded micro-columns to the other small pool of culture medium to avoid dehydration and to preserve aggregate health.\nIncubate at 37 °C and 5% CO2 for 45 min to allow the aggregates to adhere to the ECM. Verify that the aggregates remain at the ends of the micro-columns using the stereoscope; reintroduce the cell aggregates and repeat the incubation step as necessary.\nCarefully flood the Petri dishes containing the micro-TENNs with culture medium (3 or 6 mL for a 35 or 60 mm Petri dish, respectively) using a serological pipette. Place the dishes in an incubator at 37 °C and 5% CO2 for long-term culture.",
    "Perform half-media changes every 2 days with culture medium. Carefully remove half of the old medium with a pipette and use the stereoscope for visual guidance to avoid suctioning the micro-TENNs. Replace by slowly adding fresh, pre-warmed medium with a pipette.\nTo reutilize the PDMS micro-well arrays, remove the culture medium, boil the arrays in deionized water for 30 min, and sterilize in an autoclave for another round of aggregate formation and culture.\n\t\tNOTE: At desired timepoints, the cytoarchitecture of micro-TENNs can be verified using phase-contrast microscopy. Here, an exposure time of 5-8 ms and 10X (0.64 µm/pixel) and 20X (0.32 µm/pixel) objectives were utilized to capture the phase-contrast images. The fluorescence associated with calcium concentration changes in virally transduced micro-TENNs was captured using a high-speed fluorescence microscope with a 50 ms exposure time, a 10X objective (0.64 µm/pixel), and solid-state light with bandpass filters of ~480 nm and ~510 nm for excitation and emission, respectively, to visualize the GCaMP6f fluorescence signal.\n4. Immunocytochemistry for In Vitro Studies\nNote: For the images shown here, the following primary antibodies were used: mouse anti-Tuj-1/beta-III tubulin (1:500) and rabbit anti-synapsin-1 (1:500) for the labeling of axons and pre-synaptic boutons, respectively. The secondary antibodies were donkey anti-mouse 568 (1:500) and donkey anti-rabbit 488 (1:500). The requisite volumes of the prepared primary and secondary antibody solutions, as well as the volumes of the formaldehyde, horse serum, and detergent solutions, depend on the volume required to entirely cover the constructs. These volumes may be minimized using a hydrophobic barrier pen to limit the area surrounding each micro-column.",
    "CAUTION: This section employs formaldehyde and Hoechst. Formaldehyde is a toxic compound known to be carcinogenic, and Hoechst is a known mutagen. Therefore, these compounds must be disposed of in an appropriate waste container. Always handle them in a chemical fume hood while using appropriate personal protection equipment, such as a lab coat, safety glasses, and gloves.\nPrepare a 4.0% volume/volume (v/v) formaldehyde solution in 1x phosphate-buffered saline (PBS) inside a chemical fume hood.\nRemove the culture medium from the Petri dishes containing the micro-TENNs with a micropipette. Add enough volume of the formaldehyde solution to the dishes to completely cover the micro-TENNs. Soak the micro-TENNs in the formaldehyde solution for 35 min at 18-24 °C to fix the cells within the micro-columns.\nRemove the 4.0% formaldehyde solution from the Petri dishes with a pipette and discard following appropriate hazardous material disposal guidelines.\nPerform two quick rinses by adding enough PBS to entirely cover the fixed micro-TENNs and then removing the PBS with a pipette. Perform a third long rinse by soaking the constructs in the PBS for 10 min.\n\tCAUTION: Discard the PBS used for rinsing as possibly containing traces of formaldehyde.\nPrepare a 0.3% v/v solution of non-ionic detergent in 4% v/v horse serum in PBS. Remove the PBS from the Petri dishes containing the fixed micro-TENNs and add a sufficient volume of the 0.3% detergent solution to cover the constructs. Soak for 60 min at 18-24 °C to permeabilize the cells.\nRemove the detergent solution with a pipette. Perform two quick rinses by adding and subsequently removing the PBS. Afterwards, perform three longer rinses by soaking the constructs in PBS for 5 min during each rinse.",
    "Dilute primary antibodies in 4% horse serum. Remove the PBS from the Petri dishes containing the fixed and permeabilized micro-TENNs. Add enough primary antibody solution to the micro-columns to cover them completely. Seal the Petri dishes with parafilm to prevent evaporation and incubate overnight (12-16 h) at 4 °C.\nRemove the primary antibody solution from the dishes and rinse as explained in step 4.6. In the dark, prepare the secondary antibody solution in 4.0% horse serum. Add enough secondary antibody solution to fully cover the constructs, cover the dishes with aluminum foil, and incubate for 2 h at 18-24 °C.\nPrepare the Hoechst solution (1:10,000) in PBS to stain the nuclei.\nRemove the secondary antibody solution and incubate the micro-TENNS in the Hoechst solution for 10 min at 18-24 °C. Perform five rinses with PBS, each for 5-10 min. Flood the Petri dish with PBS to cover the stained micro-TENNs, wrap the dish in aluminum foil, and store at 4 °C until imaging is performed.\n\tNOTE: Images for the immunolabeled micro-TENNs were taken with a laser confocal microscope with a resolution of 2,048 (~8 s/frame), a 10X objective (0.64 µm/pixel), 487-nm excitation and ~525 nm emission wavelengths for green fluorescence, 561 nm excitation and ~595 nm emission wavelengths for red fluorescence, and ~3.22 µm/slice with ~60 slices on average for the z-stacks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}