{
  "id": 2610,
  "origin_website": "Cell",
  "title": "Biosensor Cell-Fit-HD4D for correlation of single-cell fate and microscale energy deposition in complex ion beams",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConstruction of Cell-Fit-HD4D\nTiming: 15 min to replace glass bottom of a 6-well imaging plate with the FNTD wafer; 5 min dry incubation; overnight incubation to remove potentially residual glue remains and confirm complete sealing.\nTiming: 15 min; 4–12 h (overnight) for attachment and morphological inspection for step 2\nThe Cell-Fit-HD4D biosensor combines the physical (FNTD) with the biological (cells) compartment and is optimized for long-term observation of irradiated cells at cell culture conditions.\nNote: We would like to refer to the Methods video S1[href=https://www.wicell.org#mmc1]. All steps are performed in a sterile environment of a laminar flow hood. If the CLSM is equipped with a polarized excitation laser beam make sure that the optical axis of the FNTD is in parallel with the polarized excitation laser beam to maximize the readout signal (Greilich et al., 2013[href=https://www.wicell.org#bib8]).\nExchange of glass bottom with FNTD wafer (physical compartment).\nRemove the glass bottom of a 6-well plate by applying physical force with a forceps. Ensure complete removal of residual glass and thoroughly clean the adhesive surface from residual glue using 70% EtOH and low-lint laboratory tissues.\nNote: A spatial buffer between wells to be irradiated and non-irradiated control-wells is favorable to minimize risk of scatter radiation. The complete plate can be utilized for the experiment.\nApply small drops of tissue glue around the adhesive surface edge of the well using a micropipette (take up tissue glue directly from the tube using the pipette). A good estimate for one well are 8 drops of approximately 1 μL in total.\nPlace the well plate upside down and gently attach the dry FNTD wafer to the well bottom using forceps or a suction contact lens holder.",
    "Critical: Any glue, even non-visible micro particles of glue within the well causes substantial cytotoxicity. Avoid sidewise movement of the FNTD wafer once attached. Reduce deployed glue volume if necessary.\nIncubate the plate upside-down at 37°C in a cell culture incubator for approximately 3 min for the tissue glue to polymerize.\nSterilize the modified wells with 70% EtOH (ethanol) and wash 1× with PBS. Perform these procedures on a tissue paper to directly notice potential leakages.\nNote: While leakages might be successfully spot-repaired using additional glue, successful sealing is not guaranteed and can lead to excessive glue within the well. Gently removal of the wafer and restart of the construction protocol might be considered.\nFill the modified wells with cell culture medium or PBS and place the plate on several tissue sheets in an incubator at 37°C for a recommended minimum of 6 h–12 h (overnight) to guarantee complete, durable sealing and bind potential glue particles in the fluid.\nAspirate the medium.\nGently wipe the back side of the FNTD wafer with 70% EtOH. Retrace the marks of the optical axis of the FNTD wafer for later readout.\nCell seeding (biological compartment).\nNote: In this protocol we describe the cell seeding for A549 cells transduced with a mCherry-TP53BP1 fusion gene (Dimitrova et al., 2008[href=https://www.wicell.org#bib4]). Yet, several cell lines were previously tested in terms of viability when cultured on the FNTD (Niklas et al., 2013c[href=https://www.wicell.org#bib20]).\nWash, trypsinize, collect and count cells according to standard cell culture procedure.\nSeed suitable cell numbers in standard medium in the modified wells. A non-modified well with glass bottom might be utilized as a positive control for normal cell physiology.",
    "Note: The seeded cell number directly determines the yielded data points per imaging tile as well as the robustness of automatic cell tracking. For A549 cells, we found 125,000–150,000 cells/ well to present an adequate density for image acquisition up to five days when irradiating with 1 Gy carbon ions.\nIncubate the Cell-Fit-HD4D plate at room temperature for approximately 20 min to obtain homogenous cell distribution within the well.\nIncubate under cell culture conditions (37°C, 5% CO2 for most cell lines) for a minimum of 4 h for cell attachment.\nMonitor cells using a brightfield microscope (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2108-Fig1.jpg\nFigure 1. Cell coating of Cell-Fit-HD4D\n(A and B) Exemplary comparison of a healthy cell layer (A) and cells showing abnormal morphology as a consequence of suboptimal construction of Cell-Fit-HD4D (B). Images were taken three days after seeding. Residual glue in contact with the medium leads to impaired proliferation as well as enlargement and elongation, indicating physiologic stress. Here, higher cell numbers were seeded for demonstration.\nCritical: After overnight incubation, disturbed cell homeostasis as a consequence of residual glue should be observable based on abnormal cell morphology. In this case, a successful experimental run of long-term imaging is unlikely.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Construction of the biosensor Cell-Fit-HD4D, related to steps 1 and 7\nSetup of imaging program\nTiming: 15 min\nPre-setup of a suitable imaging protocol with appropriate parameters is crucial for immediate imaging start following irradiation as well as for reasonable analysis of biologic readouts.",
    "Note: Optimal image acquisition parameters depend on the observed subject and experimental question. In general, a balance of overall light exposure and imaging duration needs to be found to avoid observation of phototoxicity-related phenomena. The basic protocol for Cell-Fit-HD4D however always consists of the initial readout; the recording of a z-stack which covers the FNTD of ∼100 μm in axial dimension as well as the overlying cell layer for later ion track reconstruction, followed by long-term imaging of the cell layer only (Figure 2[href=https://www.wicell.org#fig2]). In consequence, at least two imaging programs for the very same positions are compiled.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2108-Fig2.jpg\nFigure 2. Readout protocol for the biosensor Cell-Fit-HD4D\nIn the initial readout the so-called initial stack, the FNTD and the tumor cells are scanned in a single step. Thus, the earliest cellular response irradiation and the spinels (indicated by black discs), acting as landmarks for later image registration are recorded. The initial stack typically comprises an image stack of ∼ 30 imaging planes (2.). In a second step live-cell imaging comprising an image stack of ∼3 imaging planes of the biological compartment (cell layer) is performed by widefield microscopy (3.) After imaging, the Cell-Fit-HD4D is transferred to confocal microscopy to read out the FNTD. Using image registration routines, each ion track (red arrows) can be reconstructed into the cell layer recorded in the initial readout. The tilt between cell layer plane and confocal planes indicates the separate acquisition on two different microscopes, followed by post-acquisition stitching and image registration. Figure and figure caption were taken from (Niklas et al., 2022[href=https://www.wicell.org#bib15]).\nSet up initial readout imaging program.\nDefine positions to be scanned based on a 6-well plate dummy or the Cell-Fit-HD4D plate.",
    "Note: The delay between irradiation and the initial stack scan increases with each additional position, which potentially can decrease the precision of single cell energy deposition computation. Ensure that non-irradiated control wells are scanned last.\nSet the z-stack range with intervals of ≤ 3 μm to ensure focused acquisition of the cell layer. The z-range of the initial stack can be set by introduction of an offset based on the autofocus of the cell layer, or via manual determination by use of the actual Cell-Fit-HD4D plate.\nSelect light channels for visualization of the cell layer and determine proper exposure time(s). Select transmitted light channel to visualize the spinels (small and randomly distributed artefacts within the FNTD crystal structure), which will later serve for image registration, best.\nNote: The spinels can principally be weakly visualized in the red spectrum, and can be enhanced by image post-processing. Transmitted light exposure should be kept to a minimum, and might be disregarded for long-term imaging due to excess phototoxicity. The exposure time of the cell imaging channel can be lower compared to the time-lapse imaging, as initial imaging only serves segmentation instead of data yield.\nSet all remaining parameters such as autofocus, image save location etc. according at discretion, and save program.\nSet up time-lapse imaging program.\nEnsure that exactly the same imaging positions are taken over from the initial stack.\nSelect light channels and determine proper exposure time(s).\nSelect scanning intervals.\nNote: Scanning intervals mostly depend on your experimental question. Distinct scanning intervals might be chosen for different time points. In general, however, a balance needs to be found between phototoxicity (short intervals) and decreasing cell traceability (long intervals). We applied scanning intervals between 15–45 min.",
    "Set all remaining parameters such as autofocus, z-stacks, image save location etc. according at discretion, and save program.\nLoad imaging programs into a successive queue and prepare everything in a way that an instant image acquisition is guaranteed.\nIrradiation of Cell-Fit-HD4D\nTiming: 5 min for Cell-Fit-HD4D preparation; 20 min for irradiation setup; 2 min for irradiation (depending on the size of the irradiation field and planned physical dose level).\nThe ion irradiation deposits the physical energy in the seeded cells via ions, whose trajectories later can be visualized and correlated with biologic readouts.\nNote: We describe the irradiation of Cell-Fit-HD4D which is aligned perpendicular to an incident horizontal carbon ion beam (Figure 3[href=https://www.wicell.org#fig3]). In this protocol the cell layer was positioned in the middle of a 1 cm wide spread-out Bragg peak (SOBP) of carbon ions at a water equivalent depth of ∼ 3.5 cm. Planned physical dose levels were 1 Gy and 0.5 Gy, respectively resulting in expected carbon ion beam fluences of 8.43 ∗ 106 cm-2 and 4.16 ∗ 106 cm-2, respectively (Niklas et al., 2022[href=https://www.wicell.org#bib15]). Our irradiation plan was similar to (Dokic et al., 2016[href=https://www.wicell.org#bib5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2108-Fig3.jpg\nFigure 3. Exemplary irradiation setup for Cell-Fit-HD4D\nThe biosensor is aligned perpendicular to the incoming ion beam. Additional stopping material in front of the well plate comprising the FNTD wafer coated with a single cell layer enables to locate the cell in the desired position of a Bragg peak. Figure and figure caption were taken from (Niklas et al., 2022[href=https://www.wicell.org#bib15]). The irradiation setup was similar to (Dokic et al., 2016[href=https://www.wicell.org#bib5]).",
    "The irradiation setup principally depends on beam-specific circumstances at the irradiation site and on the desired irradiation geometry. Start the heating of the microscope 2–4 h prior to irradiation to avoid spatial errors especially in the vertical dimension due to thermal expansion during imaging. Set up and save the imaging program prior to irradiation to minimize the interval between irradiation and imaging.\nPrepare irradiation according to your planned physical dose level: position and potential stopping material (e.g., PMMA) to achieve desired linear energy transfer (LET) and desired ion beam fluence in the FNTD and in the cell layer. Shield the positions of control wells with additional stopping material.\nSeal the Cell-Fit-HD4D plate in the laminar hood.\nNote: A switch to phenol-free medium at this point will markedly improve the signal-noise ratio in the red channel.\nRemove the plate lid and span a single piece of flexible wax-polyolefin film over the wells. Apply gentle pressure on the well edges.\nPlace a tissue with the approximate size of the plate on top of the wax sealing to maintain pressure during irradiation.\nClose the plate lid and seal the plate by wrapping the sides in flexible wax-polyolefin film while applying firm pressure to the lid.\nIncubate the Cell-Fit-HD4D plate at cell culture conditions until irradiation.\nPosition the Cell-Fit-HD4D plate perpendicular to the ion beam path, with the FNTD wafers in direct contact with the phantoms. Confirm sealing of the plate.\nStart irradiation program. Here, a physical dose level of 1 Gy was delivered to Cell-Fit-HD4D using a carbon ion beam. The biosensor was placed in the mid of SOBP and 3 cm of PMMA was used as stopping material in front of the biosensor.\nInitial widefield image acquisition and live-cell microscopy\nTiming: up to 5 days of live-cell imaging depending on experimental purpose.",
    "The initial widefield image acquisition serves the rapid determination of the observed cell positions on the FNTD. Z-stacks of the FNTD as well as the superimposed cells allow for precise re-identification of imaged positions. Live-cell microscopy over the course of days enables long-term tracking of cellular responses.\nTransfer the Cell-Fit-HD4D plate to the widefield microscope as quickly as possible.\nCritical: While many molecular and cellular readouts might not require straightaway acquisition, the slight cell movements within minutes distort the spatial correlation of cells and ion tracks in the FNTD. As a consequence, the precision of dose deposition computation is negatively influenced by any delay between irradiation and initial acquisition.\nRemove the sealing from the Cell-Fit-HD4D plate and place it in the microscope stage. Apply the lid of a potentially associated micro incubator.\nStart program. The number of recorded positions depend on the desired number of cells to be imaged. A recording of high number of positions will decrease precision in computation of physical energy deposition in the cells (see step 3 and paragraph limitations[href=https://www.wicell.org#limitations]).\nFixation and immunofluorescent staining of cells (optional)\nTiming: 20 min to 12 h (overnight) for fixation dependent on method, 6–24 h for staining depending on incubation time\nPost-imaging staining provides the possibility to yield additional endpoint readouts of single imaged cells.\nNote: Avoid long exposure of the FNTD to bright light during the procedure.\nMove the Cell-Fit-HD4D plate from the microscope stage to a workbench and aspirate medium.\nWash 1× with PBS.\nApply fixation method of choice, mostly depending on which works best for the selected antibodies. Here, for staining of p21 using the listed antibody, EtOH-fixation was chosen, which occurs at −20°C overnight.\nWash 1× with PBS.\nApply blocking/ permeabilization buffer (1% Triton-X-100, 3% BSA in PBS) for 20 min at RT (room temperature).",
    "Cover the FNTD wafer with sufficient volume of primary antibody diluted in washing buffer (blocking buffer 1:5 diluted in PBS, approximately 100 μL/well), and incubate overnight at 4°C. Alternatively, incubation at RT for 3–4 h might produce similar results.\nNote: To reduce required antibody solution volume and to circumvent capillary/ surface tension effects, consider covering the central growing area (=FNTD) with wax-polyolefin film for equal liquid distribution.\nWash 2× in washing buffer, 5 min incubation each.\nCover the FNTD wafer with secondary antibody diluted in washing buffer (blocking buffer 1:5 diluted in PBS, approximately 100 μL/well), and incubate 4–6 h at 4°C. Alternatively, incubation at RT for 1 h might produce similar results.\nNote: Applications of fluorophores with excitation and emission spectra in the near-far red region and beyond are recommended to avoid conflict with the FNTD emission spectrum or fluorescent proteins expressed by the cells when performing live-cell imaging with widefield microscopy. A short wavelength excitation of cells is still feasible if the FNTD is scanned prior to cell layer. For details see paragraph limitations[href=https://www.wicell.org#limitations].\nWash 1× in washing buffer, 5 min. Add DAPI or alternative nuclear dyes with longer emission wavelength such as DRAQ5 or phosphatinositol if desired. For details see paragraph limitations[href=https://www.wicell.org#limitations].\nWash 1× in PBS, 5 min.\nStore in PBS at 4°C until imaging.\nNote: Reload previously imaged positions from the saved setup applied for time-lapse microscopy. Alternatively, yield staining signals after FNTD scan on the laser scanning microscope.\nReadout of the FNTD\nTiming: 2–16 h (overnight) dependent on number and dimension of the imaging areas, desired SNR which is affected by the ion beam quality.",
    "The microscopy acquisition of the ion trajectories in the FNTD in form of track spot (radiochromic transformed color centers) recording enables the calculation of deposited energy patterns in single cells. Concurrent acquisition of spinels allows precise image registration on previously acquired widefield imaging of cells.\nNote: A detailed description of FNTD readout by CLSM including imaging parameters as well as image registration is presented in (Greilich et al., 2013[href=https://www.wicell.org#bib8]; Niklas et al., 2016[href=https://www.wicell.org#bib17], 2022[href=https://www.wicell.org#bib15]; Klimpki et al., 2016[href=https://www.wicell.org#bib9]). The working distance of the objective should be compatible with the thickness of the wafer. An oil objective should be favored to realize a numerical aperture (NA) which is close to the NA (1.76) of the FNTD. The FNTD can also be readout by widefield microscopy decreasing the readout time by a factor of 11 (Walsh et al., 2020[href=https://www.wicell.org#bib26]). The SNR of the readout signal and its comparison to confocal readout data (up to now gold standard) is subject to current investigations.\nPlace the Cell-Fit-HD4D plate including PBS in case of cells to be imaged in the stage of the CLSM.\nLocate the areas imaged in the initial readout.\nNote: It is recommended using the coordinate system of the microscope stage to note down the approximate positions of the well/ the FNTD which were imaged to speed up the process of re-finding them on the CLSM. Cells might be used to identify the scanned areas. Spinel constellations present unique landmarks to guarantee correct position scanning.",
    "Scan the imaged area of the FNTD. Ensure that the entire imaging area acquired in the initial readout is covered. We used a 40× oil objective with sufficient field of view (∼220 × 220 μm2) in order to limit the number of tiles needed for the entire imaging area (∼660 × 660 μm2) in the initial readout. Make sure that the single imaging tiles have sufficient overlap (here: ∼20 μm) for subsequent stitching to gain the complete imaging field. The main imaging parameter in CLSM, namely laser power, dwell time and number of re-scans have to adjusted accordingly to gain sufficient signal-to-noise ratio. For subsequent analysis of the intensity distribution of the track spots and LET computation (see paragraph data processing: physical compartment[href=https://www.wicell.org#sec3.10]) the measured count rate by the microscope’s detection unit (here APDs) should be in a linear relationship to the expected count rate. The upper limit of the measured count rate is ∼5 MHz in our imaging setup. Hence a saturation of the detection unit is avoided. This is achieved by a limitation of the laser power, dwell time and number of re-scans. In case of increased detected count rates the APD saturation can be corrected by mathematical transformation prior to any quantitative analysis. For a detailed description we refer to (Greilich et al., 2013[href=https://www.wicell.org#bib8]; Klimpki et al., 2016[href=https://www.wicell.org#bib9]).\nReadout of immunofluorescent staining of cells (optional)\nTiming: 2 min to 1 h dependent on number and dimension of the imaging areas\nPlacing the stained cells on the previously utilized widefield microscope and reuse of the very same, saved positions of the time lapse microscopy allows for obtaining additional information of the irradiated and observed cells.",
    "Scan the cell layer, if cells have been stained for additional biomolecules. Statistically relevant cell numbers are required for informative analyses. Recommended tile number to be scanned therefore is dependent on cell confluency. To allow a correlation of the recorded signal of additional biomolecules with the physical energy deposition in the object of interest (e.g., cell nucleus) positions have to be identical to the one of the recorded stacks in live-cell microscopy.\nCritical: Imaging the cell layer with excitation wave length close to 405 nm prior to the FNTD readout can cause substantial bleaching and thus deletion of the detected ion traversals in the FNTD. This is not compatible with precise ion track reconstruction. For details see paragraph limitations[href=https://www.wicell.org#limitations].\nRegistration of ion trajectories to cells\nTiming: dependent on the performance of the computer used for image processing and on the corresponding software\nRegistration of the images acquired via confocal microscopy (FNTD, ion tracks) to the ones obtained in the initial stack by widefield microscopy (cells) enables the precise determination of energies deposited in single cells.",
    "Note: We outline the ion track reconstruction in the cell nuclei - our target of interest. The entire data processing including stitching and registration of the data sets gained by the FNTD readout as well as by the initial readout is described in detail in (Niklas et al., 2016[href=https://www.wicell.org#bib17], 2022[href=https://www.wicell.org#bib15]). For the principle of ion track reconstruction using the FNTD readout signal see (Niklas et al., 2013a[href=https://www.wicell.org#bib18]; Klimpki et al., 2016[href=https://www.wicell.org#bib9]). A detailed description of the cell tracking software LevelSet Tracker in Matlab for nucleus segmentation and -tracking can be found in (Dzyubachyk et al., 2010[href=https://www.wicell.org#bib6]). In principal each tracking software can be used. For the image processing, including linear regression analysis each dedicated software like R (RStudio Team, 2020[href=https://www.wicell.org#bib24]) or Matlab can be used. Fundamental algorithms we developed for the registration of ion trajectories to cells were uploaded on Mendeley Data (see key resources table[href=https://www.wicell.org#key-resources-table]).\nData processing: Biological compartment\nAnalysis of imaged cells includes segmentation and tracking, as well as registration of mitotic events and DNA damage/ RIF. This enables the correlation of molecular and cellular responses with respectively deposited energies days after irradiation on the single cell level.\nCombine the data sets of the cell layer acquired in the initial readout and subsequent live-cell imaging. We performed maximum intensity z projections of the acquired image stack for each time point. Segment and track cells/ cell nuclei using LevelSet Tracker or other tracking algorithms which register mitotic events to gain time series of the black white (BW) masks of the cross-sectional areas of the tracked objects. Export single frame images to a distinct folder designated for each single cell.\nCritical: Precise segmentation of the nuclei in the initial readout is crucial for correct ion track-cell-assignment. Manually control cell masks and adjust tracking algorithm parameters if necessary.",
    "Note: Long-term cell fate tracking can be conducted manually/ user-guided, or automatically, and any suitable program for automatic cell tracking can principally be utilized. We applied an algorithm which recognizes the topological changes of mitotic cells to follow up cell progenies (Dzyubachyk et al., 2010[href=https://www.wicell.org#bib6]), which was complemented by user-guided control and correction for high cell densities. We tracked cells based on the pan-nuclear signal of the 53BP1-mCherry fusion protein (Dimitrova et al., 2008[href=https://www.wicell.org#bib4]). Tracking algorithms and parameters need adjustment according to the respective cell signals.\nAnalyze RIF for single cells over time. Here, RIF number, size, and signal intensity was quantified.\nNote: While we used trainable WEKA segmentation for ImageJ (Arganda-Carreras et al., 2017[href=https://www.wicell.org#bib3]), any approach for RIF segmentation and measurement based on single cell, single frame images can be applied including macro scripts, machine learning, and neural networks. Other or additional live-cell readouts can be analyzed. Extra-nuclear readout signals require cell-based instead of nuclear-based segmentation, which e.g., can be achieved using transmitted light channel.\nApply the cell mask of the last scanned time-lapse frame on the post-time-lapse staining (if performed) channel and measure respective signal. Here, nuclear p21 signal was quantified and correlated with initially deposited energies to determine potential energy-dependent growth arrest (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2108-Fig4.jpg\nFigure 4. Fluorescent readout signal of the cell layer\n(A) Representative fluorescent images of the cell cycle inhibitor p21, 53BP1 and DAPI. Cell-Fit-HD4D allows to identify p21 induction in a subpopulation of cells in response to irradiation.\n(B) Histogram of p21 mean intensities in single cell nuclei (IR: C-12 irradiation 1 Gy, spread-out Bragg peak, Ctrl: control) including thresholding (66 a.u.) for p21-positive cells. Figure and figure caption were taken from (Niklas et al., 2022[href=https://www.wicell.org#bib15]).\nData processing: Physical compartment",
    "The recorded track spots are used for ion track reconstruction in the FNTD and extrapolation into the cell layer. Extrapolated ion tracks are assigned to cell nuclei. The intensity of the track spots is used to compute the energy deposition in individual cell nucleus.\nPerform stitching of the recorded FNTD data sets according to (Niklas et al., 2016[href=https://www.wicell.org#bib17]) to gain a single data set simplifying subsequent ion track reconstruction.\nNote: Here, a single imaging field of ∼ 660 × 660 μm2 recorded in the initial readout with widefield microscopy using a 20× objective requires 4 × 4 confocal tiles using a 40× objective to ensure a complete coverage. An overlap of ∼20 μm of the single tiles was used to ensure high accuracy in the stitching procedure. It is important to test for optical aberrations of the applied objectives and to limit them (e.g., by reducing the imaging field) to gain a stitching of high accuracy. Principally, all these read-out parameters depend on the specifications of the utilized microscope.\nUse the in-house software FNTD package (Kouwenberg et al., 2016[href=https://www.wicell.org#bib12]), a plugin for the ImageJ/ Fiji software (Arganda-Carreras et al., 2017[href=https://www.wicell.org#bib3]) to identify and to link the track spots for subsequent reconstruction of the ion tracks in the FTND.\nPerform linear regression analysis to fit the ion trajectory into a line based on the linked track spots. Use the slopes of the trajectory in both xz and yz directions to extrapolate the ion trajectories into the cell layer.",
    "Note: By applying maximum intensity z projections we reduced the dimensionality of the cell layer from 3D to 2D. To account for this reduction we extrapolated the ion tracks into the center of the cell layer in the vertical position of e.g., 2 μm (implying a thickness of cell layer ∼ 4 μm) with respect to the FNTD surface.\nTo assess the number of ion traversals in each cell nucleus apply image registration of the data sets gained by widefield (cell layer) and confocal (FNTD) microscopy (step 3 in Figure 2[href=https://www.wicell.org#fig2]). Calculate the intersection of the extrapolated ion trajectories with the BW masks of the cell nuclei (a logical AND operation) in the very first time point after irradiation, i.e., the initial readout.\nFor the calculation of the ions LET and deposited dose in the cell nucleus or object of interest we refer to (Rahmanian et al., 2017[href=https://www.wicell.org#bib23]; Greilich et al., 2018[href=https://www.wicell.org#bib7]; Niklas et al., 2022[href=https://www.wicell.org#bib15]). Briefly, the track spot intensity allows for computation of the LET of the corresponding ion. This is done by matching the intensity distribution of the detected track spots with a Monte Carlo generated LET distribution of the applied irradiation setup (Figure 5[href=https://www.wicell.org#fig5]). For the ion beam fluence calculation the number of ion hits intersecting the BW mask of a cell nucleus/ object of interest are counted.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2108-Fig5.jpg\nFigure 5. Exemplary intensity-to-LET conversion\n(A) The LET-distribution by Monte Carlo simulation considering all ion types in the spread-out-Bragg peak (SOBP) of a carbon ion beam of 1 Gy is shown. The peak at 50 keV/μm correspond mainly to primary ions (carbon ions), the other peaks correspond to fragments.\n(B) The individual distributions (carbon ions: C, fragments: B, Be, H, He, Li) constituting the peak at 50 keV/μm are depicted. The carbon ions dominate.",
    "(C) Intensity distribution of ion traversals detected by the FNTD is shown. Intensity-based thresholding was applied to distinguish between primary ions (carbon ions, C) and fragments.\n(D) Only the carbon ions (Experiment) were considered in the in the LET calculation. The intensity distribution of the carbon ions were mathematically transferred by   L E  T j  =   10   1 a   − b   to match the peak at 50 keV/μm in the LET distribution in (A) with I: track intensity of the ion, LETj: LET of the ion j, a and b: parameters adjusted to match intensity- and LET distribution. According to this transfer the intensity values were converted into LET values. For detailed description we refer to (Klimpki et al., 2016[href=https://www.wicell.org#bib9]; Rahmanian et al., 2017[href=https://www.wicell.org#bib23]; Greilich et al., 2018[href=https://www.wicell.org#bib7]; Niklas et al., 2022[href=https://www.wicell.org#bib15]).\nNote: The entire assessment of the physical energy deposition is based on the hit statistics gained in the previous step. In contrast to a simplified projection of the ions into the BW mask of a nucleus, an ion track reconstruction considering the incident angle of the ion is increasing the accuracy in dose calculation.\nData processing: Combination of physical and biological compartment\nPhysical beam parameters are correlated to biological readout parameters to resolve the cell’s individual response chain triggered by the physical energy deposition in its nucleus.\nFuse the data on energy deposition and molecular dynamics/ gene expression/ cellular fate.\nCorrelate biological readouts to physical beam parameters."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Biotechnology And Bioengineering",
    "Cancer",
    "Molecular Biology",
    "Single Cell",
    "Biophysics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}