{
  "id": 17022,
  "origin_website": "Jove",
  "title": "Isolation and Identification of Limbal Niche Cells",
  "procedures": [
    "Limbus tissue from donors aged between 50 and 60 years was obtained from the Red Cross Eye Bank, Tongji Hospital (Wuhan, China). The protocol was approved by the Tongji Ethics Committee and was conducted in accordance with the Declaration of Helsinki.\n1. Isolation\nObtain limbus tissue from intermediate-term corneal storage medium and operate under aseptic conditions on an ultra-clean workbench.\nScrape and remove the iris and endothelium around the cornea using a sterile surgical round blade.\nCut limbus tissue into twelve equally sized pieces with a surgical blade with 1 mm left on both sides of the cornea and sclera.\nTransfer limbus tissues to a 3.5 cm culture plate, add 1 mL of collagenase A (2 mg/mL, in DF-12 medium), to immerse all of the tissues for digestion.\nPut the plate into the 37 °C cell incubator, digest the limbal tissues for 18 h.\n\tNOTE: Follow-up procedures are usually performed on the second day.\nPrepare a 5% basement membrane matrix (Matrigel) coated 6-well culture plate.\n\t\nCoat 5% basement membrane matrix (dissolved in MESCM [Table 1]) at the bottom of the well.\nPrepare 200 μL and 1 mL tips, one 15-mL centrifugal tube, and one 6-well plate in a sterilized bag.\nPut the sterilized bag (including tips and centrifugal tube) and a new 6-well plate at -20 °C or -80 °C environment for 20 min. Thaw the basement membrane matrix in the refrigerator at 4 °C.\nTake out the pre-cooled tips, centrifugal tube, and 6-well plate from the -20 °C or -80 °C environment, and then perform the following operations on the ultra-clean workbench.\nTransfer 50 µL 5% basement membrane matrix to 1 mL MESCM using a 200 μL tip, and mix them gently and evenly.",
    "Transfer 5% basement membrane matrix (dissolved in MESCM) to one well of a 6-well culture plate using the pre-cooled 1 mL tip.\nShake the 6-well plate gently and horizontally, put the 6-well culture plate in the 37 °C cell incubator for approximately 1 h, and then perform the next step.\nAfter 18-h digestion, take out collagenase A-digested limbal tissue, only some visible small clusters and undigested scleral tissues will remain.\n\tNOTE: High-magnification microscopy reveals a cluster composed of many densely packed cells (including LNCs).\nUse a 200 µL pipette tip to detach the clusters from undigested scleral tissues under the stereomicroscope.\nTransfer the clusters to the 3.5-cm culture plate and immerse them in 0.25% TE, and then place the plate in the cell incubator for 15 min.\nAdd 1 mL MESCM with 10% knockout serum to stop cell digestion and gently pipette up and down to resuspend the clusters into individual cells using a 1-mL pipette tip.\nTransfer the cell suspension to a 15-mL centrifugal tube and centrifuge at 200 x g for 5 min.\nRemove the supernatant carefully without disturbing the cell precipitation, and then add 1 mL MESCM to resuspend the cells.\nPipette up and down 2-3 times until the bottom cell precipitation is evenly suspended in the MESCM using 1 mL pipette tip, and take 20 µL cell suspension for cell counting.\nTransfer the cell suspension to the 5% basement membrane matrix-coated 6-well plate with a 1-mL pipette tip and increase the volume of MESCM to 2.5 mL.\nGently shake the 6-well plate horizontally to evenly distribute the cells.\nTransfer the cells to the culture incubator after being imaged and recorded. Observe and photograph the cells daily, and change the medium every 3-4 days.\n2. Identification of LNC\nImmunofluorescence staining",
    "Digest the LNCs from the bottom of the plate using 1 mL 0.25% TE for 5 min in the 37°C cell incubator.\nTerminate the digestion by adding 1 mL MESCM (containing knockout serum), centrifuge the cell suspension at 200 x g for 5 min, and aspirate the supernatant carefully.\nAdd 1 mL MESCM to resuspend the cells in suspension. Prepare 80 µL cell suspension (4 × 103 cells per slide) for 4 slides (20 µL/slide) and use centrifuge system to deposit cells onto microscope slides as per the manufacturer's instructions.\nFix cells (adhered to slides in step 3) using 4% paraformaldehyde for about 10 min, and then permeabilize cells on the slides with 0.2% Triton X-100 in PBS for 15 min.\nBlock the cells for 1 h with 2% bovine serum albumin (BSA) before incubating them with primary antibodies (Pan-CK [1:1000], Vim [1:100], CD90 [1:100], CD105 [1:200], SCF [1:100], PDGFRβ [1:100]) on a shaker overnight at 4 °C. After the incubation, remove unbound primary antibodies by washing (5 min/wash, 3x) the slides with PBST (PBS + 0.1% Tween 20).\nIncubate the corresponding secondary antibodies (donkey anti-mouse IgG secondary antibody TRITC [1:1000], donkey anti-rabbit IgG FITC [1:500], donkey anti-mouse IgG 488 [1:300], donkey anti-rabbit IgG 594 [1:400]) for 1 h with suitable IgG nonspecific IgG antibodies. Remove the unbound secondary antibody using PBST (5 min/wash, 3x).\nCounterstain the nuclei with 5 µg/mL DAPI (4',6-Diamidino-2-Phenylindole ) and seal the slides.\nPerform fluorescence imaging using a fluorescence microscope (Magnification: 400x; Exposure time: 50 ms).\nQuantitative real-time polymerase chain reaction (qPCR)\n\t\nTake RNA Isolation Kit to extract the total RNA as per the manufacturer's instructions.\nUse a high-capacity cDNA Transcription Kit to reverse transcribe 1-2 µg of total RNA to cDNA.",
    "Perform the reverse transcription (42 °C, 2 min; 50 °C , 85 min) and qPCR ( 95 °C, 5 min; 95 °C, 10 s, 40 cycles) in a 20-μL solution containing cDNA (100 ng), TaqMan Gene Expression Assay Mix (1 μL), universal PCR Master Mix (10 μL) and ddH2O (to 20 µL).\nUse the comparative CT technique (ΔΔCT)4,9 to examine the relative gene expression.\n3. Characterization of LNC\nCell counting (hemocytometer)\n\t\nDigest the LNCs from the bottom of the plate using 0.25% TE for 5 min in the 37 °C cell incubator.\nTerminate the digestion by adding 1 mL MESCM (containing knockout serum), centrifuge the cell suspension at 200 x g for 5 min, and aspirate the supernatant carefully.\nAdd 1 mL MESCM to resuspend the cells, then take 10 μL cell suspension in a 0.5 mL centrifuge tube. Add an equal volume of 0.4% Trypan blue staining solution.\nPlace 10 μL stained cell suspension on the counting area of the hemocytometer and cover it with a coverslip for counting.\n\t\tNOTE: The number of cells in the five middle square areas is defined as \"A\"; the cell number in 1 mL is calculated as 5A × 104 × 2.\nExamination of LNC and BMMSC markers with flow cytometry15\nDetect the expression of SCF, CD73, CD90, and CD105 in the LNCs and BMMSCs using Flow cytometry15 (2-4 × 106 events/sample, 2,000 cells were obtained from each of the samples, totaling 550,000 cells that were gated simultaneously).\nCollect and stain the cells at 20-30 °C for 15 min in a blocking buffer (3% BSA and 0.05% Tween-20 in PBS) using prelabeled antibodies (SCF [1:50], CD70 [1:50], CD90 [1:50], and CD105 [1:50]) as per the kit instructions.",
    "Perform fluorescence-activated cell sorting (FACS) analysis using a flow cytometer. In this study, FACS Diva software and FlowJo software were used. For each sample, record 10,000 events and gate and analyze live cells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}