{
  "id": 5134,
  "origin_website": "Bio",
  "title": "Determination of the H<sup>+</sup>-ATP Synthase and Hydrolytic Activities",
  "procedures": [
    "ATP hydrolysis by the enzyme can be determined spectrophotometrically following the changes in Absorbance at 340 nm (A340). The basis of this method is the coupling of the enzymatic reactions catalyzed by lactate dehydrogenase (LDH) and pyruvate kinase (PK) to the hydrolytic activity of the ATP synthase (Barrientos et al., 2009). The ADP generated by the hydrolysis of ATP allows PK to transform 1 mole of phosphoenolpyruvate (PEP) into 1 mole of pyruvate. Pyruvate is then used by LDH to generate lactate oxidizing a molecule of NADH to NAD+ in the process. By each ATP molecule hydrolyzed one molecule of NADH is oxidized, allowing the detection of the reaction by a diminution in A340.Determination of the hydrolytic activity of the H+-ATP synthase is assayed on isolated broken mitochondria by three cycles of freezing and thawing the mitochondrial preparation in liquid nitrogen and at 37 °C, respectively.30-50 µg of isolated mitochondria are resuspended in 20 µl of Reaction Buffer (RB) with 1x phosphatase and protease inhibitors. The luminometer plate-reader is set up to measure absorbance at 340 nm in kinetic mode (10 flashes per well) and the change in the absorbance is measured through constant intervals of time (15 sec). With these conditions it is possible to measure 24 samples simultaneously. 80 µl of complete RB (containing PK and LDH) and 20 µl of the mitochondria prepared as on step 3 are added in each 96 well black clear bottom plate and the reaction is recorded. When enough ATP hydrolysis has been produced (2-5 min), 30 µM oligomycin is added to each well. The addition of oligomycin inhibits the activity of the mitochondrial ATP synthase/hydrolase providing confirmation of the specificity of the assay.",
    "The ATPase activity of isolated mitochondria is expressed in nanomoles of NADH oxidized/min/mg of mitochondrial protein which is calculated using the Lambert-Beer equation and a molar extinction coefficient of NADH of 6.22 x 103 M-1 cm-1.N = ΔA340/(ε340 x l) where N is the concentration of NADH oxidized, ΔA340 is the decrement in absorbance between two given time-points, ε340 is the Molar extinction coefficient of NADH at 340 nm and l is the light path length of 1 cm."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}