{
  "id": 9772,
  "origin_website": "Jove",
  "title": "High Sensitivity 5-hydroxymethylcytosine Detection in Balb/C Brain Tissue",
  "procedures": [
    "1. DNA Glucosylation and Control Reactions\nIn a 1.5 milliliter reaction tube on ice, mix 5-10 micrograms of genomic DNA (for a final concentration of 30 micrograms /milliliter), 12.4 microliters of UDP-Glucose (for a final concentration of 80 micromolar), 31 microliters of NEBuffer 4 and up to 310 microliters nuclease-free water to bring the total volume to 310 microliters.\nSplit this reaction mixture into two tubes of 155 microliters each.\nThen add 30 units, or 3 microliters, of T4-β-glucosyltransferase to one tube. Mix well by gently pipetting up and down. The second tube is the control reaction, so add 3 microliters of water, instead of T4-BGT.\nIncubate both tubes at 37 degrees Celsius for 12 to 18 hours, during which time the T4-BGT will add glucose to the hydroxyl group of 5-hydroxymethylcytosine groups in the sample.\n2. Restriction Enzyme Digestion\nLabel three 0.2 milliliter PCR-strip tubes numbers 1 through 3. Aliquot 50 ul of the reaction mixture into each.\nLabel three 0.2 milliliter PCR-strip tubes numbers 4 through 6. Aliquot 50 ul of the control mixture into each.\nAdd 100 units, or 1 microliter, of MspI into tubes 1 and 4. Mix well by gently pipetting up and down.\nAdd 50 units, or 1 microliter, of HpaII into tubes 2 and 5. Mix well by gently pipetting up and down.\nDo not add anything to tubes 3 and 6, as they are controls.\nIncubate all 6 tubes at 37 degrees Celsius for at least 4 hours.\nAdd 1 microliter of Proteinase K into each tube and incubate at 40 degrees Celsius for 30 minutes.\nInactivate the Proteinase K by incubating at 95 degrees Celsius for 10 minutes.\n3. Analyze DNA by PCR/qPCR",
    "This protocol uses NEB's LongAmp Taq for end-point PCR which has been shown to perform well. Other PCR protocols can be substituted.\nAdd the following components to a 0.2 milliliter PCR reaction tube on ice: 10 microliters of 5X LongAmp Taq Reaction Buffer, 1.5 microliters of 10 millimolar dNTPs, 1 microliter of 10 micromolar Forward Primer, 1 microliter of 10 micromolar Reverse Primer, 3 microliters of template DNA from the previous steps, 1 microliter of LongAmp Taq DNA Polymerase, and nuclease-free water up to 50 microliters. These volumes may change according to the PCR protocol used.\nGently mix the reaction. If necessary, collect all liquid to the bottom of the tube by a quick spin.\nOverlay the sample with mineral oil if using a thermocycler without a heated lid.\nTransfer the PCR tubes from ice to a thermocycler with the block preheated to 94 degrees Celsius and start the cycling program. For a routine 3-step PCR, there should be one initial denaturation step at 94 degrees Celsius for 30 seconds followed by 30 cycles of 94 degree Celsius denaturation for 15 seconds, 55 to 65 degree Celsius annealing for 30 seconds, and 65 degree Celsius extension for 20 seconds, or 50 seconds per kb. This should be followed by one final extension at 65 degrees Celsius for 5 minutes. Real-time PCR can also be performed to quantitate amounts of 5-methylcytosine and 5-hydroxymethylcytosine. Please refer to the product manual, found on neb.com for specific information.\n4. Representative Results:\nimgsrc://cloudfront.jove.com/files/ftp_upload/2661/2661fig1.jpg\nFigure 1.Comparison of 5-hydroxymethylcytosine amounts at locus 12 in different mouse Balb/C tissue samples. (A), End-point PCR. (B), Real time PCR.",
    "DNA from four mouse tissues was analyzed. For comparative purposes, real time PCR data were normalized to uncut DNA. A standard curve was used to determine copy number. The samples could be normalized by dividing the copy number of samples No 1-6 by the copy number of the control that is undigested (No 5). Boxed gel lane shows variation in 5-hmC present."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}