{
  "id": 6643,
  "origin_website": "Bio",
  "title": "Isolation and Imaging of His- and RFP-tagged Amyloid-like Proteins from <em>Caenorhabditis elegans</em> by TEM and SIM",
  "procedures": [
    "This protocol describes the preparation of worms for imaging techniques. For protocols on the number of worms to grow, growth conditions, collection and freezing of worms please refer to William B. W. (1988) and Groh et al. (2017).Lysis of C. elegans Defrost pellets of C. elegans expressing KIN-19::Hisavi and expressing RHO-1::Hisavi, these should ideally have been frozen in PBS with protease inhibitors (one protease inhibitor tablet per 10 ml of PBS, PBS is made with 1 tablet in 100 ml H2O). To reduce C. elegans protein adherence to the microcentrifuge tubes, all tubes used in the experiments need to be incubated with 10% BSA in PBS for 10 min to coat the tubes.Using a pipette with the end cut off giving a wide pore to allow easy mixing of the suspension, resuspend the worm pellet mixture in a 1:1 ratio with radioimmunoprecipitation assay (RIPA) buffer with protease inhibitor tablets to a volume of 250 μl. In a 1.7 ml microcentrifuge tube sonicate the suspension at an amplitude of 10 microns for 10 s on, 30 s off, 10 s on, on ice or in a cold room and further homogenise it manually with a plastic pestle for 10 strokes.Centrifuge the tubes for 1 min at 800 x g at 4 °C. The pellet contains the unwanted cuticle fragments and unlysed worms, carefully remove the supernatant. Then further centrifuge the supernatant at 21,000 x g for 15 min at 4 °C. Carefully transfer the supernatant and resuspend the remaining pellet in 250 μl of PBS with protease inhibitors.Push and pull the resuspended pellet through a 30 G needle three times.",
    "Isolation of aggregated RHO-1 and KIN-19 by nickel beadsBy cutting the end of a HisTrap FF Crude column remove 20 µl of precharged Nickel Sepharose 6 Fast Flow beads and incubate them with the resuspended pellet overnight at 4 °C on a fixed speed rotator at 20 rpm. Note: Any nickel bead will likely work. The next day centrifuge the tubes at 800 x g for 1 min remove the supernatant (containing unbound proteins) to leave the His-tagged proteins, fibrils and beads.To remove the His-tagged aggregates and fibrils from the beads add 60 µl of 500 mM imidazole in PBS pH 8.0 (adjust pH with HCl) and incubate overnight at 4 °C on a fixed speed rotator at 20 rpm. To isolate eluted aggregates and fibrils, centrifuge the beads at 800 x g for 1 min and collect the supernatant containing the aggregates and fibrils which are then used for imaging experiments. Note: We tried shorter times for His-tagged protein/fibril adherence to the beads and for elution, but this was not as successful as the overnight incubations. Unsuccessful elution protocol: incubate precharged Nickel Sepharose 6 Fast Flow beads with resuspended worm pellets for 15 min on a vortex mixer (Stuart, SA8) at 400 rpm. Then centrifuge the beads to pellet them at 800 x g for 1 min and remove the supernatant. Add 60 µl of 500 mM imidazole in PBS pH 8 (adjust pH with HCl) to the beads and incubated for 3 min on a vortex mixer at 400 rpm, but this was not long enough to successfully remove fibrils, shown by Western Blot and TEM in Figures 1A and 1B.",
    "Confirming protein capture and release with nickel beads by Western blotWe tested the capture of protein aggregates and fibrils to the nickel beads and their successful elution by Western blot. Incubate 5 µl of crude worm pellet + 5 µl PBS, 3 µl of nickel beads after incubation + 7 µl PBS, 10 µl of supernatant after incubation and 10 µl of eluted aggregates with 4x LDS buffer at 100 °C in a heat block for 5 min. Use 10 µl of the sample to separate by 4-12% Bis-Tris SDS-PAGE gel and then transfer to a PVDF membrane for Western blotting. Block the membrane with 5% BSA in PBS with 0.05% Tween-20 for 30 min to reduce background signal.Incubate the membrane with anti-6xHis tag primary antibody at 1:1000 with PBS and 0.05% Tween-20 on a roller for 1 h. Then wash the membrane three times in PBS and 0.05% Tween-20 for 5 min each time.Incubate the secondary antibody, anti-mouse-HRP, with the membrane at 1:1000 with PBS and 0.05% Tween-20 on a roller for 1 h. Wash the membrane five times in PBS and 0.05% Tween-20.Incubate the membrane with Supersignal West PicoPLUS Chemiluminescent Substrate for 5 min before imaging using the G:Box Chemi imager (Figure 1A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028022025_3930.jpgFigure 1. Representative Western blot and TEM images of successful and unsuccessful binding and elution of aggregated His-tagged proteins to nickel beads. A. Western blot using an α-6xHis primary antibody to show representative successful (lanes under blue line) elution of His-tagged RHO-1 and unsuccessful (lanes under black line) elution of KIN-19 from nickel beads. The α-6xHis has identified 6xHis-tagged RHO-1 and KIN-19 of varying sizes indicating the presence of aggregates as well as degraded protein.",
    "Negative-stain transmission electron micrographs showing (B) unsuccessful elution of KIN-19::His protein from nickel beads and (C) successful capture and elution of RHO-1::His (RHO-1 fibrils indicated by a blue arrow) and (D) KIN-19::His (KIN-19 fibrils indicated by a blue arrow). Grids are negatively stained using 2% uranyl acetate. Scale bar = 100 nm.Imaging isolated protein aggregates by TEM Glow discharge the carbon coated copper grids using argon gas on a Quorum Technology K100X at 25mAmps for 2 min.Add 10 µl of protein sample to the grid and incubated for 1 min.Wash the grid twice for 5 min in dH2O by making a 200 μl droplet of dH2O and placing the grid in the droplet.Incubate the grid once in 10 μl 2% uranyl acetate for negative staining for 30 s before drying it by blotting with filter paper. A Tecnai G2 80-200kv TEM at the Cambridge Advanced Imaging Centre was used for imaging the grids (Figures 1B-1D).The Tecnai imaging software allows you to do point-to-point measurements of fibril widths and lengths, the diameters of the RHO-1 and KIN-19 fibrils were ~15-20 nm. Point-to-point measurements can be used to determine periodicity/helicality of fibrils, although periodicity was not observed in the RHO-1 or KIN-19 fibrils.Note: We attempted to immunolabel the fibrils with the anti-6x His tag primary antibody and a secondary antibody conjugated to 10 nm gold beads, but the fibrils had been washed off the grids at the end of the staining process. It might be useful to not glow discharge the grids to keep it hydrophobic, allowing the fibrils to adhere better.Preparation of C.",
    "elegans protein extracts for imaging by SIMWe initially tried to image RHO-1::His aggregates that were fluorescently labelled with antibodies, using the Anti-6x His tag primary antibody and the Goat anti-Mouse Alexa Fluor® 647 conjugate secondary antibody, but the extensive washing involved in antibody staining meant many aggregates were washed off the chamber slides and very few remained for imaging (Figure 2A). To obtain more aggregates and fibrils for fluorescence imaging, we instead used RHO-1::tagRFP worms which were already fluorescently labeled, and control worms which did not contain any amyloid aggregates as confirmed by the absence of ThT staining, fem-1(-). Process the worms as per Protocol A, Lysis of C.elegans, and use the crude worm pellet for imaging using SIM.Coat Nunc Lab-Tek II Chamber Slide wells with 0.1% poly-L-Lysine for 30 min at RT before incubating 200 μl of the resuspended crude worm pellets in the wells along with 50 µM of ThT in PBS for 1 h at RT, keep the chamber slide under foil to keep in the dark (ThT powder added to PBS and filtered through a 0.22 μm filter). Remove the non-adhered pellet by pipetting and wash three times with 200 μl PBS by pipette before imaging (Figure 2B). Note: The ThT stock solution must be within its recommended usage period and freshly prepared for optimal binding and fluorescence. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191028/20191028022057_4022.jpgFigure 2. SIM imaging to confirm the presence of RHO-1 positive amyloid structures. Extracts from C. elegans worms were stained for amyloid structures using ThT and examined for colocalization with RHO-1. A. SIM showed colocalization of ThT positive structures and His-tag immunostained RHO-1 proteins. B. We also observed colocalization of ThT positive structures with RHO-1::RFP and observed both fibrillar and inclusion body-like structures. Scale bar: 1 μm.",
    "Imaging protein aggregates by SIMTo visualize amyloids from worm extracts, we used our custom-built SIM providing a spatial resolution approaching 90 nm at frame rates reaching 22 Hz3.Objective-60x water.Exposure time: 25 ms for each channel.Wavelengths used:561 channel for RFP-Rho1488 channel for ThT647 channel for immuno-labeling with secondary antibody conjugated to AF647 dye.Hardware control and image reconstruction were performed with software written in LabView and Matlab (Ströhl and Kaminski., 2015). For visualization, Fiji was used."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}