{
  "id": 9668,
  "origin_website": "Jove",
  "title": "Investigating the Neural Mechanisms of Aware and Unaware Fear Memory with fMRI",
  "procedures": [
    "1. Psychophysiology\nThe Biopac Systems, Inc. physiological monitoring system (see Table of specific equipment) is non-standard equipment in most imaging facilities. Schedule 15-30 minutes prior to participant arrival to set up physiological monitoring and other equipment described in this protocol (Figure 1).\nConnect a control room computer operating AcqKnowledge (Biopac Systems, Inc.) physiological monitoring software to the Biopac MP150 (MP150WSW) using a standard Ethernet crossover cable (CBLETH2).\nConnect the Biopac Isolated Digital Interface (STP100C) to a control room computer operating Presentation (Neurobehavioral Systems, Inc; Albany, CA) software using a DB25 M/F ribbon cable.\nConnect the Biopac GSR amplifier (EDA-100C-MRI) to the RF interference filter (MRIRFIF) within the control room using a shielded extension cable (MECMRI-3).\nConnect the RF interference filter (MRIRFIF) to a shielded extension cable (MECMRI-1) within the MRI scanning chamber.\nConnect the shielded extension cable to carbon fiber lead wires (LEAD 108) that attach to radio translucent electrodes (EL508). Note: Twisting the leads in a tight spiral reduces artifacts in the skin conductance data that can be created during scanning.\nAttach radio translucent electrodes (EL508) to the distal phalanx of the middle and ring fingers of the participant's left hand.\nDue to the nature of scanning equipment, MRI chamber room temperatures are often set below 21°C. Cover the participant with a blanket to maintain hand temperature.\n2. Behavioral Responses (Joystick) \nConnect a control room computer operating Presentation software (Neurobehavioral Systems, Inc; Albany, CA) to the joystick's fORP Interface Unit (Current Designs, Inc; Philadelphia, PA) using a USB-mini cable.\nConnect a fiber optic cable to the fORP Interface Unit within the control room, then pass the cable through a wave guide into the MRI chamber.\nConnect the fiber optic cable to the MR-compatible joystick.\nDirect participants to place the joystick in a comfortable and easy to reach position.",
    "3. Stimulus Presentation\nConnect a control room computer operating Presentation software to the external VGA and audio ports of the IFIS-SA (Invivo Corp., Orlando, FL) control room console (Figure 1).\nCheck the fiber optic cable connections between the IFIS control room console and the IFIS Peripheral Interface Unit within the MRI chamber, as well as the connections between the Peripheral Interface Unit and the Audio/Visual Display Unit.\nPlace the Audio/Visual Display Unit behind the head-coil such that the participant can view the monitor through a mirror attached to the head-coil. \nConnect the Audio/Visual Display Unit's acoustic interface box to the IFIS system's MR-compatible stereo headphones using vinyl tubing.\nCalibrate the volume of auditory stimuli using a sound pressure level meter.\n4. Experimental Procedure \n Inform participants that 2 tones will be presented several times during the study, and that the volume of the tones will vary above and below their perceptual threshold (Figure 2).\n Direct participants to push a button on the joystick box immediately upon hearing either tone, then to update their expectation of receiving the UCS by moving the joystick to control the position of a rating bar on a 0 to 100 scale (Figure 3). \n Instruct participants to rate their UCS expectancy on a continuous scale from 0 to 100. Inform them that ratings of 0 indicate they are certain the UCS will not be presented, ratings of 50 indicate they are uncertain whether the UCS will be presented, and ratings of 100 indicate they are certain the UCS will be presented. Direct participants to use other values on the scale to indicate intermediate expectations. Then, allow participants to practice using the joystick to make ratings.",
    "Expose participants to a differential fear conditioning procedure using 2 tones (700 & 1300 Hz; 10s duration; 20s ITI) as the conditioned stimuli (CS) and a loud white-noise (100dB, 500ms) as the UCS. \nPresent 60 trials of the CS+ (coterminating with the UCS) and 60 trials of the CS- (presented without the UCS) in a pseudorandom order such that no more than 2 trials of the same CS are presented consecutively. \nCounterbalance the tones that serve as the CS+ and CS- across participants.  \nModulate the volume of the CS+ and CS- independently. Adjust CS volume on the subsequent trial with the same CS. Decrease CS volume 5dB if a button press is made (i.e. following a perceived trial). Increase the volume 5dB if a button press is not made (i.e. following an unperceived trial).   \n5. Scanning Procedure \nCollect standard high resolution T1-weighted structural images (e.g. MPRAGE) to serve as an anatomical reference for functional data.\nCollect BOLD fMRI of the whole brain during the conditioning procedure. Thirty six, 4mm thick slices should be sufficient to cover the brain with relatively standard imaging parameters (e.g. TR = 2000ms, TE = 30ms, FOV = 24cm, 64x64 matrix). Synchronize the fMRI acquisition with stimulus presentation using an fMRI trigger box.\n6. SCR Data Acquisition & Analysis\nSample skin conductance at 2,000 Hz using AcqKnowledge software and the MR-compatible Biopac physiological monitoring system described in section 1. \n Apply a 1 Hz Infinite Impulse Response (IIR) low pass digital filter to the skin conductance data to reduce artifacts produced during imaging (see Figure 4).\nResample the skin conductance data at 250 Hz. \nCalculate SCR as the difference in skin conductance level from response onset to response peak.\nSCR data can be square root transformed to normalize the distribution of response amplitudes prior to statistical analysis.",
    "7. UCS Expectancy Data Acquisition & Analysis\nSample (40 Hz) and record UCS expectancy data using Presentation software.\nCalculate UCS expectancy as the average (1s sample) response during the last second of CS presentation.\n8. Functional MRI Data Acquisition & Analysis\nComplete standard preprocessing of brain imaging data (e.g. slice timing correction, image registration, spatial smoothing) using a functional imaging analysis software package (e.g. AFNI 18).\n Create standard nuisance (e.g. motion) and stimulus-based regressors for perceived and unperceived trials of the CS+ and CS-, as well as the UCS.\n Create a motor response-based reference waveform to serve as a nuisance regressor to account for motor activity related to button press responses.\n \nCreate a stick function that codes for the timing of button press responses.\nConvolve the button press stick function with the canonical hemodynamic response function (HRF).\nCreate motor response-based reference waveform to serve as a nuisance regressor to account for motor activity related to joystick responses.\nCreate a stick function that codes for the timing of changes in the slope (e.g. slope absolute value > 10) of UCS expectancy ratings.\nConvolve the joystick slope stick function with the canonical HRF.\nPerform first level analyses using all stimulus-based and nuisance regressors.\nPerform a second level repeated measures ANOVA to identify regions in which activation shows a main effect of CS type, a main effect of perception, or a CS type X perception interaction.\n9. Representative Results:",
    "The methodology presented here typically results in relatively high UCS expectancy ratings during perceived CS+ trials and low ratings during perceived CS- trials (Figure 5) 10,15,19. Such results indicate participants are aware of CS-UCS contingencies. On unperceived trials, UCS expectancy ratings typically remain unchanged from pre-CS ratings. UCS expectancies on these unperceived CS+ and CS- trials typically fall near 50 indicating participants are unsure of whether the UCS will be presented 10,15,19 (Figure 5). This inability to produce differential UCS expectancy ratings to the unperceived CS+ and CS- indicates that participants are unable to express their contingency awareness on unperceived conditioning trials (Figure 6). In contrast, learning-related changes in SCR have been observed during both perceived and unperceived conditioning trials 10,15,19. Specifically, SCRs were larger to the perceived CS+ than to the perceived CS-. Similarly, larger SCRs have been demonstrated during unperceived CS+ than unperceived CS- trials 10,15,19 (Figure 6). Taken together, these behavioral and autonomic data demonstrate fear conditioning with contingency awareness on perceived trials, and fear conditioning without contingency awareness on unperceived trials. The functional imaging research using this methodology has demonstrated learning-related hippocampal activation on perceived, but not unperceived conditioning trials15 (Figure 7). In contrast, differential amygdala activity was observed on both perceived and unperceived conditioning trials 15. These findings are consistent with the view that the hippocampus supports processes related to contingency awareness, while the amygdala supports CR expression with and without awareness.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig1.jpg",
    "Figure 1. Diagram of basic equipment for stimulus presentation and behavioral/psychophysiological response monitoring. Presentation software is used to present audio-visual stimuli and monitor UCS expectancy ratings made by moving a joystick with the right hand. AcqKnowledge software and Biopac equipment are used to monitor skin conductance from the left hand. Solid (Biopac), single dashed (IFIS Audio-Visual), and double dashed lines (Fiber optic joystick) depict cables for distinct stimulus presentation and response monitoring systems.  Black arrows indicate direction of information flow. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig2.jpg\nFigure 2. Conditioned Stimuli. Present the CS+ and CS- in a pseudorandom order such that no more than 2 trials of the same CS are presented consecutively. Vary the volume of the CS+ and CS- independently. If a CS is perceived (indicated by a button press), decrease CS volume 5dB on the subsequent trial of the same CS. If a CS is unperceived (indicated by no button press), raise CS volume 5db on the subsequent trial with the same CS. \nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig3.jpg\nFigure 3. UCS expectancy rating scale. Instruct participants to rate their expectation of UCS presentation on a 0 to 100 scale. Ratings of 0 indicate certainty the UCS will not be presented, ratings of 100 indicate certainty the UCS will be presented, and ratings of 50 reflect uncertainty as to whether the UCS will be presented. Intermediate ratings should be used to indicate gradations in UCS expectancy.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig4.jpg\nFigure 4. Comparison of raw and filtered skin conductance data. a) Raw skin conductance data collected during fMRI. b) Skin conductance data after application of a 1Hz IIR low pass filter.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig5.jpg\nFigure 5. UCS expectancy ratings. -Participants typically report high UCS expectancies on perceived CS+ trials and low expectancies on perceived CS- trials. UCS expectancies on unperceived CS+ and CS- trials do not differ.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig6.jpg",
    "Figure 6. UCS expectancy and SCR. Differences in UCS expectancy are typically observed on perceived CS+ and CS- trials indicating participants are aware of the stimulus contingencies. On unperceived trials, UCS expectancy ratings typically do not differ indicating participants are unable to express their contingency awareness. In contrast, differences in conditioned SCRs are usually observed on both perceived and unperceived conditioning trials. Such findings reflect learned fear expression with (i.e. on perceived trials) and without (i.e. on unperceived trials) contingency awareness.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3083/3083fig7.jpg\nFigure 7. Functional MRI of the hippocampus and amygdala. Hippocampal responses are typically larger to the CS+ than CS- on perceived, but not unperceived conditioning trials. Differential amygdala responses are typically observed on both perceived and unperceived conditioning trials. These findings are consistent with the view that the hippocampus supports processes related to contingency awareness, while the amygdala supports fear expression with and without awareness.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}