{
  "id": 17735,
  "origin_website": "Jove",
  "title": "Development of a Novel Task-oriented Rehabilitation Program using a Bimanual Exoskeleton Robotic Hand",
  "procedures": [
    "The training protocol and informed consent document were reviewed and approved by the Institutional Review Board of the Chang Gung Medical Foundation. The details of the study and the procedures were clearly explained to each subject.\n1. Recruitment of three healthy adults\nPerform the screening process using the following inclusion criteria: (1) age 20–60 years, (2) already signed informed consent, (3) normal function in upper limbs, (4) Mini-Mental State Examination (MMSE) score ≧24.\nConduct Trial 1: manipulating objects without wearing the robotic hand system.\n\t\nInstruct the subject to sit upright in a chair with a firm back and no armrests. Seat the subject in front of a table. Stand by the subject’s non-dominant side.\nTeach the subject how to manipulate the designed objects for 5 min. Include a palmar prehension to pick up the peg, a lateral prehension to pick up the rectangular cube, a three-point chuck to pick up the cube, a spherical grasp to pick up the ball, and a cylindrical grasp to pick up the cylindrical bar.\n\t\tNOTE: The objects are shown in Figure 1A. The experimental setup is shown in Figure 1B. The subjects learned the specific grasp patterns for each object. The grasping pattern is shown in Figure 2.\nPlace two bases bilaterally in front of the subject’s hands. Place each object used in the rehabilitation on top of these bases to assist manipulation. For all the objects, repeat the following sequences 20 times. Ask the subjects to grasp the objects in the starting area of the base, lift, and move them to the midline and release using their non-dominant hands.",
    "At the same time, measure the success rate for these 20 attempts. Perform this procedure on 3 consecutive days. The success rate is the number of successful manipulations per 20 attempts x 100%. Successful manipulation is defined as when the subjects are able to complete the sequences with specific grasp pattern according to the objects and without dropping them.\nConduct Trial 2: manipulating objects using robotic hand system (Figure 3).\n\tNOTE: The mechanisms of the robotic hand system are as follows. In the exoskeleton hand, the joints in each finger module are designed in mechanical linking and driven by an individual linear actuator with a constant speed of 10 mm/s. The exoskeleton has different ranges of motion in each finger module (thumb: MCP= 0° to 55°, DIP= 0° to 70°; index and middle fingers: MCP= -10 ° to 55°, PIP=0° to 35°, DIP=0° to 35°; ring and little fingers: MCP= -5 ° to 55°, PIP= 0° to 35°, DIP= 0° to 35°). In the sensor glove, each finger module is installed with a flex sensor which measures the joint angle and sends input signals to the control box through cables.\n\t\nSensor glove setup (Figure 1B,b)\n\t\t\nPut the sensor glove on the subject’s dominant hand. Use the Velcro to secure the wrist.\nExoskeleton setup (Figure 1B,b)\n\t\t\nUse a clean pad to wrap the non-dominant hand. Fasten the Velcro snugly.\nLoosen the thumb mechanism of the exoskeleton hand to allow adjustment of the thumb-opening angle. Place the non-dominant hand in the exoskeleton hand. Fasten the Velcro to the palm through the fastening ring. Fasten the fingers one by one, beginning with the forefinger and finishing with the thumb.",
    "Then, fasten the Velcro parallel to the wrist through the fastening ring. Adjust the thumb to a comfortable angle and then tighten the thumb mechanism.\nControl box setup (Figure 1A,c)\n\t\t\nInsert the cables for the exoskeleton hand and sensor glove into the sockets in the exoskeleton hand and sensor glove, respectively. After that, insert the cables for the exoskeleton hand and sensor glove into the socket in the control box. Finally, insert the power cable into the control box and connect it to an outlet with the correct voltage.\nConduct a warm-up session (The PROM mode)\n\t\t\nSwitch on the control box and adjust the mode to Five Fingers. This mode allows the exoskeleton hand to move the subject’s fingers passively. Ask the subject to perform a grasp-and-release task guided by the exoskeleton hand for 2.5 min.\nSwitch the mode to Single Finger and let the exoskeleton hand move the subject’s fingers individually and passively. Ask the subject to extend and retract individual fingers for 2.5 min, guided by the exoskeleton hand.\nConduct a robot-assisted bimanual movement session.\n\t\t\nSwitch the mode to Mirror. In this mode, the movement of the dominant hand wearing the sensor glove controls the exoskeleton hand’s movements. Any movement that is made by the sensor glove is mimicked and mirrored by the exoskeleton hand. For example, a flexion of the sensor glove’s index finger corresponds to a flexion of the exoskeleton’s index finger.\nInstruct the subject to perform a grasp-and-release task for 2.5 min and make individual finger movements for a further 2.5 min while wearing the sensor glove. This action is mirrored by the exoskeleton hand, which guides the subject’s non-dominant hand in performing the required tasks.\nConduct the task-oriented session.",
    "Teach the subject how to manipulate the designed objects using the robotic hand system for 5 min. Include a palmar prehension to pick up the peg, a lateral prehension to pick up the rectangular cube, a three-point chuck to pick up the cube, a spherical grasp to pick up the ball, and a cylindrical grasp to pick up the cylindrical bar.\nPlace two bases bilaterally in front of the subject’s hands. Place each object used in the rehabilitation on top of these bases to assist manipulation. For all the objects, repeat the following sequences 20 times. Ask the subjects to grasp the object in the starting area of the base, lift, and move them to the midline and release using the robotic hand system.\nAt the same time, measure the success rate for these 20 attempts. Perform this procedure on 3 consecutive days. The success rate is the number of successful manipulations per 20 attempts x 100%. Successful manipulation is defined as when the subjects are able to complete the sequences with specific grasp pattern using the robotic hand system and without dropping them.\n\t\tNOTE: The success rate will be used to assess the feasibility of the bimanual robotic hand system in healthy subjects.\n2. Recruit three stroke patients to determine the applicability of the training program\nPerform the screening process using the following inclusion criteria: (1) age 20–60 years; (2) signed informed consent; (3) diagnosed with unilateral stroke ≧ 1 month (4) Modified Ashworth Scale (MAS) score ≦2; (5) Brunnstrom stage ≦2; (6) MMSE score ≧24.\nConduct Trial 1: manipulating objects when not using robotic hand system (Figure 2).",
    "Let the subject sit upright in a chair with a firm back and no armrests. Seat the subject in front of a table. Stand by the subject’s affected side. Place a sling under the subject’s elbow and exoskeleton hand to support his/her affected arm.\nTeach the subject how to manipulate the designed objects for 5 min. Include a palmar prehension to pick up the peg, a lateral prehension to pick up the rectangular cube, a three-point chuck to pick up the cube, a spherical grasp to pick up the ball, and a cylindrical grasp to pick up the cylindrical bar.\nPlace two bases bilaterally in front of the subject’s hands. Place each object used in the rehabilitation on top of these bases to assist manipulation. Ask the subject to manipulate the five different objects using his/her affected hand 20 times. Support the subject in moving his/her upper arm if needed.\nAt the same time, measure the success rate for these 20 attempts. Perform this procedure on 3 consecutive days.\nConduct Trial 2: manipulating objects using robotic hand system (Figure 3).\n\t\nFit the exoskeleton hand to the subject’s affected hand and the sensor glove to the unaffected hand. Repeat steps 1.3.1–1.3.3. Place a sling under the subject’s elbow and exoskeleton hand to support his/her affected arm.\nConduct a warm-up session (The PROM mode).\n\t\t\nSwitch on the control box and adjust the mode to Five Fingers. Ask the subject to perform a grasp-and-release task guided by the exoskeleton hand for 2.5 min.\nSwitch the mode to Single Finger. Ask the subject to extend and retract individual fingers for 2.5 min, guided by the exoskeleton hand.",
    "Switch the mode to Mirror. Instruct the subject to perform a grasp-and-release task for 2.5 min and make individual finger movements for a further 2.5 min while wearing the sensor glove. This action is mirrored by the exoskeleton hand, which guides the subject’s affected hand in performing the required tasks.\nConduct a task-oriented session.\nTeach the subject how to manipulate the designed objects using the robotic hand system for 5 min. Include a palmar prehension to pick up the peg, a lateral prehension to pick up the rectangular cube, a three-point chuck to pick up the cube, a spherical grasp to pick up the ball, and a cylindrical grasp to pick up the cylindrical bar.\nPlace two bases bilaterally in front of the subject’s hands. Place each object used in the rehabilitation on top of these bases to assist manipulation. For all the objects, repeat the following sequences 20 times. Ask the subjects to grasp the objects in the starting area of the base, lift, and move them to the midline and release using the robotic hand system.\nAt the same time, measure the success rate for these 20 attempts. Perform this procedure on 3 consecutive days. The success rate is the number of successful manipulations per 20 attempts x 100%. Successful manipulation is defined as when the subjects are able to complete the sequences with specific grasp pattern using the robotic hand system and without dropping them.\n\t\tNOTE: The success rate will be used to assess the feasibility of the robotic hand system in stroke patients.\n3. Patient evaluation\nTo assess acceptability, ask the subjects following questions at the end of each session: (1) was the robotic hand system helpful for you to manipulate the objects? (2) were there any adverse events happened during or after the training program?",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}