{
  "id": 4324,
  "origin_website": "Bio",
  "title": "Human Astrovirus Propagation, Purification and Quantification",
  "procedures": [
    "Propagating human AstrovirusSeed T-75 flask(s) with 2.5-5 x 106 Caco2 cells in cell culture medium. Grow at 37 ºC in 5% CO2 for 3-5 days until cells reach 100% confluence.Rinse confluent Caco2 cells 1x with 3-4 ml PBS.Incubate cells for 1 h at 37 ºC, 5% CO2 in SF Caco2 Medium containing 5 µg/ml porcine trypsin.All subsequent steps should be performed in a certified biosafety cabinet by personnel wearing disposable gloves and a labcoat working under BL2 conditions.Remove media and infect cells with astrovirus in 5 ml SF Caco2 Medium with 5 µg/ml porcine trypsin for 90 min at 37 ºC, 5% CO2 (see Notes 1 and 2).Remove the infection media and replace with 6 to 7 ml SF Caco2 Medium with 10 µg/ml porcine trypsin (see Note 3). Use extreme caution as the cells will begin to detach due to the trypsin.Incubate at 37 ºC, 5% CO2 for 3 to 4 days, then collect supernatant and cells.To increase yield, sonicate 4 x 15 sec. Alternatively, pellet cells by centrifuging for 5 min at 4,000 rpm. Remove all but 1 ml of supernatant and freeze-thaw the cell pellet 3 times by freezing in liquid nitrogen and thawing at 37 ºC. Centrifuge again to pellet cell debris and combine supernatants.Aliquot the virus and stored at -80 ºC.Purification of AstrovirusPre-clear astrovirus solution by centrifuging at 4,000 rpm to pellet cellular debris.For each tubePipet 4 ml of 15% sucrose (w/v) in TN buffer into a 12 ml Beckman ultra-clear 9/16 x 3 ½ in ultracentrifuge tube.Underlay with 2 ml of 50% sucrose (w/v) in TN buffer.Pipet approximately 6 ml of pre-cleared astrovirus supernatant (or PBS/TN buffer if a balance is needed) on top of the 15% sucrose layer (Figure 1A).",
    "Spin in SW41 ultracentrifuge rotor at 34,000 rpm for 3 h at 4 °C.Remove virus by puncturing the side of the tube with a syringe just under the virus band (white cloudy band at the 15%/50% interface; Figure 1B; see Note 4).Insert virus into Slide-A-Lyzer 10K dialysis cassette. Remove excess air in the cassette.Dialyze virus in PBS + 10 mM MgCl2 for at least 4 h with 2 buffer changes (2 L total) or overnight in 2 L buffer at 4 ºC.Remove virus using a syringe. Aliquot and freeze at -80 ºC.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140313/20140313013628_6958.jpgFigure 1. Schematic of sucrose gradient. Schematic of gradient loading (A) and the viral band after centrifugation (B).Astrovirus Fluorescent Focus AssaySeed a 96-well plate with 2 x 104 Caco2 cells/well. Grow 3-4 days until cells reach 100% confluence.Gently rinse cells 2x with sterile PBS. Trypsinize and count 2-3 wells to calculate the number of cells/well.Add 100 µl of SF Caco2 media (supplemented with 0.3% BSA) and incubate for 1 h at 37 °C, 5% CO2.Prepare ten-fold viral dilutions in SF Caco2 media containing 0.3% BSA.Remove media from cells and add 100 µl of serial dilutions to cells. Each sample should be assayed in triplicate.Incubate 1 h at 37 °C, 5% CO2. Remove media and replace with SF Caco2 media containing 0.3% BSA.Incubate plate at least 10 h at 37 °C, 5% CO2, but not more than 24 h.Remove media. Rinse cells gently 3x with PBS.Fix in 100 µl of 4% formaldehyde/PBS at room temperature for 20 min.Rinse 3x with ~100-200 µl of PBS. All rinses should be performed with this approximate volume. Permeabilize for 10 min at room temperature with 100 µl of PBS containing 0.5% TritonX-100.Rinse 3x with PBS.Block 1 h in 100 µl of 5% normal goat serum in PBS at room temperature.",
    "Plate can be gently rocked if desired.Rinse 3x with PBS.Incubate with primary mouse anti-HAstV-1 capsid protein (8E7) 1:100 in 50 µl 1% normal goat serum in PBS for 1-2 h at room temperature or overnight at 4 °C. Plate can be gently rocked if desired.Rinse 3x with PBS.Incubate with secondary goat anti-mouse AlexaFluor 488 1:100 in 50 µl 1% normal goat serum in PBS+ 1 µg/ml DAPI. Keep plate away from light from this step forward. Plate can be gently rocked if desired.Rinse 3x with PBS. Add ~200 µl PBS to each well and visualize on fluorescent microscope (Figure 2).Calculate fluorescent focus units per ml (FFU/ml): %FITC+ cells x average number of cells/well x dilution factor = FFU/Mlimgsrc:https://en-cdn.bio-protocol.org/attached/image/20140313/20140313013906_6461.jpgFigure 2. Example of Astrovirus staining. IFA staining of uninfected (left) and astrovirus infected (right) Caco2 cells.Astrovirus capsid is shown in green, and cell nuclei in blue."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}