{
  "id": 7842,
  "origin_website": "Bio",
  "title": "A Simple, Reproducible Procedure for Chemiluminescent Western Blot Quantification",
  "procedures": [
    "The composition of solutions and buffers used are shown below under the section “Recipes”. Western blot  Since this protocol aims to quantify the signal from membranes, we provide here a general western blotting guideline, based on which each user should apply the optimal conditions for his or her interest. In brief, proteins are electrophoretically separated in an acrylamide gel according to their size and then transferred to a membrane, to be probed with antibodies that recognize specifically antigenic epitopes displayed by the target protein.The steps are the following:Extract proteins from HEK293FT cells (at 80% confluency) seeded in a 6 cm plate adding 500 µL of cold lysis buffer with protease inhibitors and incubate for 30 min at 4 °C with gentle shaking. Collect the solution with the cells in a cold Eppendorf tube and centrifuge at 16,000× g for 10 min at 4 °C. Note: To avoid protein degradation, include protease inhibitors and work in cold conditions, at 4 °C. Lysis can be performed using different lysis buffers including RIPA if e.g., immunoprecipitation will be performed.  Quantify protein concentration. Note: Quantification of proteins needs to be done with an appropriate method depending on the lysis buffer used, i.e., BCA protein assay (for SDS-containing lysis buffer) and protein assay dye reagent concentrate (lysis buffer without SDS).  Collect the desired quantity of lysates (15–50 µg) in a new Eppendorf, add Laemmli buffer to a final 2× concentration up to 25 µL of volume, and mix well. Then, boil samples at 100 °C for 6 min, let them cool at room temperature and centrifuge at 16,000× g for 30 s. Note: Samples can be stored at -20 °C if not used immediately.  Load the desired quantity of protein lysates in the corresponding acrylamide gel to perform SDS-PAGE.",
    "Place the gel in the tank filled with MES-SDS running buffer and apply current to allow protein separation until the front dye reaches the bottom of the gel (Figure 1). Note: Depending on the size and proteins to be detected, the percentage and kind of acrylamide gels to be used will be different. For example, to detect proteins with high molecular weight (above 80 kDa), 6%–8% acrylamide gels are preferred. In case it is necessary to detect low (below 30 kDa) and high molecular weight proteins in the same gel, it is recommended to use gradient gels with a percentage of acrylamide from 4% to 12%. Depending on whether the acrylamide gel is a Bis-Tris or Tris-Glycine, the resolving range and the time required to run the samples will vary (30–40 min in Bis-Tris gels at 200 V to 75–120 min in Tris-Glycine gels at 90 V).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4667/bioprotoc-13-09-4667-g001.jpg Figure 1. SDS-PAGE gel running; at loading (left panel) and after running for 30 min (middle panel) and 90 min (right panel).  Note the molecular weight standards (blue) appearing on the left and right edges once the samples have run. Arrows point to the front dye and arrowheads to 75 kDa molecular weight marker.Transfer proteins from gel to PVDF membranes. Before obtaining the gel, label and activate the PVDF membrane by soaking it in methanol for a few seconds, rinse twice with ddH  2  O for 3–4 min, and incubate with transfer buffer until use. Stop current once the front dye has reached the bottom part of the gel. Assemble the transfer cassette in a container with transfer buffer as shown in Video 1. Note: It is crucial to avoid air bubbles when setting the cassette by covering the sponge, Whatman paper, and the gel with transfer buffer.",
    "Failure to remove air bubbles in the assembled cassette will jeopardize the detection of proteins. After placing each component, remember to run the blot roller gently to avoid the presence of air bubbles during the transfer. Be careful with the orientation of the gel so as not to lose the order in which the samples were loaded; a different volume of molecular weight marker can be added in the first and last lane to aid this purpose.  <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Transfer preparationPlace the cassette in the frame in the right orientation located in the chamber filled with transfer buffer and an ice package. Include a magnetic stirrer and stir while applying a 200–400 mA current for at least 1.5 h in a cold room to avoid overheating. After that, remove PVDF membrane with the proteins attached and start the procedure to detect them. Note: Protein transfer from gel to membrane can be done with different equipment, including semi-dry transfer. Insertion of the cassette in the wrong orientation will make proteins from the gel to migrate in the opposite direction of the PVDF membrane; therefore, proteins will be lost.  Block membrane with blocking solution with agitation for at least 30 min at room temperature. Note: Blocking solution will depend on the primary antibody to be used. Check manufacturer datasheet for that info.  Incubate the membrane with the primary antibody in blocking solution with agitation for 2–3 h at room temperature or overnight at 4 °C. Note: The quality of the signal and the amount of background will depend in a great manner on the quality/affinity of the antibodies. If possible, use antibodies that have been previously tested by you or other laboratories.",
    "Wash with gentle agitation at least three times with TBST solution for at least 15 min, block membrane using TBST + 5% non-fat milk for 10 min with agitation, add the corresponding secondary antibody conjugated with HRP, and incubate for at least 45 min. Note: The secondary antibody to be used can be coupled with different fluorophores instead of HRP, but extra care must be taken with light to avoid bleaching of signal.  Repeat the washes with TBST and leave the membrane in this solution until development.Set up the settings for image acquisition in the MicroChemi apparatus using different exposure times. Note: Acquisition of images can be performed with other equipment. The exposure times will depend on the quantity of protein and/or selectivity of the primary antibody. Routinely, we set time differences between exposures in the Chemidoc program of 1, 3, 5, 15, 30, 60, 180, 300, 600, and 900 s. The signal of each image corresponds to the accumulated time from the beginning, i.e., images 3 and 4 will have an exposure of 9 and 24 s, respectively.  Incubate membrane with the WesternBrightTM  ECL HRP Substrate for 1 min.Place the membrane in the MicroChemi chamber and acquire images (Figure 2). Note: At the end of the experiment, take a picture with bright light to save an image with the molecular weight markers position in the membrane. This will help identifying the bands of interest.  Copy images and transfer to a computer with ImageJ program to process them.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4667/bioprotoc-13-09-4667-g002.jpg Figure 2. Images obtained with MicroChemi equipment and GelCapture software.",
    "Western blots for actin in HEK293FT cell lysates with different exposure times (from 1 to 4,128 s) showing original images (two left panels, the first being inverted), saturation image profile (third panel from the left), and pseudo color image (fourth panel from the left). Note that the signal becomes saturated (red signal) in 37.5 µg sample with 828 s of exposure. Image processing and band quantification  The aim is to obtain a numerical value for the intensity of each band in each image captured during membrane exposure, using the analysis tools of ImageJ program (Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Band quantificationOpen all images using ImageJ with the commands: File > Import > Image Sequence… choosing the folder directory where the images are located, the first one to start with, and the number of photos to import. Note: Do not include the “Molecular Weight Markers Picture” taken with clear light, only the ones acquired with chemiluminescence.  Choose the parameters of interest to be recorded from the images. To do this, select Analyze > Set Measurements… clicking the ones that ImageJ should record for the analysis. Note: In our case, we have selected Area, Mean gray value, Integrated density, and Display label. The analysis is going to be performed with Integrated density values, but as many parameters as desired can be recorded.  Select an image with visible bands, but not saturated (Figure 2, overexposure images), and delimit a rectangle that fits one of them with the \"Rectangle\" tool. Then, move the rectangle over an area of the membrane close to the bands but without signal, to capture the background.",
    "Record the measurements with the commands: Image > Stacks > Measure Stack… Note: The less the area of the rectangle fits the band, the greater the possibility of introducing deviations due to the background (Gassmann et al., 2009). The size of the rectangle should not be modified, so that the same area is always quantified for all bands. If there are free wells in the gel, a lane with the same lysis buffer and Laemmli buffer can be included, which will serve to quantify the background.  Move the rectangle over each band and repeat the same commands to obtain measurements. As a result, a table with all the values collected for each of the bands in each sequence image will appear. Note: Consider the order in which the bands have been quantified to know to which of the samples the value corresponds.  Save the data in .csv format with the commands File > Save As… Linear model optimization  The aim of the analysis is to obtain a representative value for each band in the western blot. This value will be the slope of the signal increment within the linear range of the selected band.Load the required packages for R software to work. Note: If the packages are not installed, the command install.packages() needs to be used before loading them.  my_packages <- c(\"dplyr\", \"ggplot2\", \"openxlsx\") lapply(my_packages, require, character.only = TRUE) Set the working directory, the folders where the data file is located, and where the result of the analysis is going to be exported. Note: Remember that quotation marks should be used.  WorkingDirectory <- \"/Users/xxxxx/Desktop/Folder1/Folder2/Actin\" setwd(WorkingDirectory) Load the data from the image analysis in .csv format, copying the file name in the corresponding lane. Note: Quotation marks should be used.  File_Name <- \"Results.csv\" Results <- read.",
    "table(file = File_Name, sep = \",\", header = T) Define the conditions of the experiment: the background and the samples that have been loaded on the gel. The script is going to assign each name to each set of measurements in a new column called “conditions”. Note: Be careful to write them in the same order in which the quantification has been done from the images and use quotation marks so that R interprets them as text.  conditions <- c(\"Background\", \"6μg\", \"9μg\", \"15μg\", \"18μg\", \"22.5μg\", \"30μg\", \"37.5μg\")  Results$Conditions <- factor(x = rep(conditions, each = max(Results$Slice)), levels = conditions) Introduce the exposure time for each image that has been quantified. The script is going to assign each value to its corresponding image in a new column called “Exposure.” Note: Remember that it is not the value that has been introduced in the Chemidoc software, but the accumulated time from the beginning. The units to be used can be seconds or minutes; if using minutes, convert the values to decimal system and use “.” for decimals.  Exposure <- c(1, 3, 8, 18, 33, 63, 108, 168, 228, 288, 408, 588, 828, 1128, 1428, 1728, 2028, 2628, 3228, 4128)  Results$Exposure <- rep(exposure, times = length(conditions)) Perform background correction. The code will subtract the signal from the background of each image in all analyzed bands. The result will be written in a new column called “BckgCorrect.”Results$BckgCorrect <- rep(0, dim(Results)[1])  for  (i  in  1 :dim(Results)[1]) {  Bkgnd <- Results$Conditions == \"Background\" &    Results$Exposure == Results[i,\"Exposure\"]   Results$BckgCorrect[i] <- Results[i,\"IntDen\"] - Results[Bkgnd,\"IntDen\"] } Represent the data in a scatterplot, with the exposure time as the independent variable and the background corrected signal as the dependent one (Figure 3). The purpose of the graph is to determine visually the linear range for the increment of the signal.",
    "ggplot(Results, aes(x = Exposure, y = BckgCorrect, color = Conditions))+    geom_point() + geom_line() + theme_classic() imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4667/bioprotoc-13-09-4667-g003.jpg Figure 3. Representation of band quantifications.  The signal of each band (y-axis) with respect to the exposure time (x-axis) is shown. Note that in the samples with higher protein content (22.5, 30, and 37.5 µg) the linearity between exposure time and signal is lost at certain exposure time.Optimize the model by manually selecting the first and last exposure time to be considered that stays within the linear range for all conditions of interest. The script will define a new data frame with the filtered data between these two points, named “Results_filtered.”First_Expossure = 63 Last_Expossure= 828 Results %>% filter(between(Exposure, First_Expossure, Last_Expossure)) -> Results_filtered Build the linear model using simple linear regression, with exposure time as predictor variable and corrected signal as response variable. The script will calculate the regression parameters for each condition of the experiment, obtaining a new data frame with the value of the slope of the regression line, the R-squared coefficient of determination to evaluate the goodness of fit, and the p-value to evaluate its statistical significance (Table 1). It will also generate a new scatterplot with the filtered data (Figure 4).<- data.frame(t(mapply(unlist, by(Results_filtered, Results_filtered$Conditions,  function (x) summary(lm(BckgCorrect~Exposure, x)))))) %>%   select(slope = coefficients2, adj.r.squared, p.value = coefficients8) ggplot(Results_filtered, aes(x = Exposure, y = BckgCorrect, color = Conditions))+    geom_point() + geom_line() + theme_classic() knitr::kable(Results_model) imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4667/bioprotoc-13-09-4667-g004.jpg Figure 4. Adjusted representation of band quantifications.  After removing the samples with lower and/or higher exposure (in which linearity was lost), linearity for different amounts is kept and will allow to accurately calculate the slope for each concentration. Table 1. Regression parameters for each condition of the experiment  table:",
    "﻿0,1,2,3\nConditions,Slope,Adj. r. squared,p. value\nBackground,0,,\n6 μg,1157.633,0.9988883,2.704757e-10\n9 μg,3156.074,0.9993988,4.277239e-11\n15 μg,16760.63,0.9986983,4.34215e-10\n18 μg,26829.65,0.9994091,4.061036e-11\n22.5 μg,57338.1,0.9993725,4.864208e-11\n30 μg,121563.9,0.9989834,2.068317e-10\n37.5 μg,223579.3,0.9998507,6.546559e-13",
    "If the regression coefficient is not close enough to 1 and/or the scatterplot does not fit the linear range, go back to step C8, and adjust the exposure values again.Export the analysis results. The script will overwrite the initial excel file, saving all the data in a sheet named “DATA,” the filtered data between exposure times in a sheet named “DATA_FILTERED,” and the coefficients of the linear model in a sheet named “MODEL.” Note: Remember that these are chemiluminescent signal values. Western blotting is a semiquantitative technique, so the next step in interpreting the results should be to compare these values with a housekeeping or a reference protein (protein of interest/reference protein).  write.xlsx(list(DATA = Results, DATA_FILTERED = Results_filtered, MODEL = Results_model), file = \"File_Name\", row.names =  T) Example  As an example of the method described here, complementary to that published in Sánchez-Sánchez et al. (2023), we show the quantification of TrkA activation after stimulation with nerve growth factor (NGF) for different times. Briefly, we used primary cultures of sensory neurons enriched in TrkA-positive neurons selected with NGF for 5–6 days. We then deprived the culture of neurotrophin for 4 h and stimulated with NGF (50 ng/mL) for the corresponding time. We collected cell lysates and performed western blotting using pTrkA (for activated receptor) (Figure 5A, left panels) and TrkA (Figure 5B, left panels) antibodies, taking the top 140 kDa band as the reference protein. We quantified the signals from the pTrkA and TrkA bands as described in this protocol. We measured the signal intensity of different images for each sample (Figures 5A and 5B, exposure blots) and, together with the exposure time settings, defined the combined linear range for each protein (Figures 5A and 5B, right plots). As described above, we built a linear regression model.",
    "We used the slope as a representative value to calculate the ratio of pTrk to TrkA and plotted the results of independent experiments (Figure 5C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4667/bioprotoc-13-09-4667-g005.jpg Figure 5. Example of signal quantification.  Images with different exposures showing pTrkA (panel A) and TrkA (panel B) signals were quantified in cultured sensory neurons after NGF stimulation for different stimulation times. The colored rectangles in both panels represent the membrane areas used for quantification. A rectangle of another region without signal was utilized as background (not shown in the images). Note that saturation can be detected at higher exposures of the TrkA blot in the pseudo color images (red color). On the right side of each panel there is a graph showing the signal increase curve for each time point. The range between dashed lines indicates the exposures taken to optimize the linear regression model and to perform the quantification within linearity. Note that the saturation in the pseudo color images matches the flattering of the curves in the plots. (C) Quantification of TrkA activation (pTrkA/TrkA ratio). Normalization was performed using the 5 min time point of NGF stimulation. Each colored line represents the results obtained in a single experiment (n = 3). Panels A and B correspond to experiment c in panel C. Useful tips  It is important to include control and experimental/problem samples in the same membrane, to be able to compare since there is always some variability between membranes, even with those carried out in parallel for the whole experiment.Total protein to be loaded in the gel (usually between 15 and 50 µg) will depend on the abundance of the protein of interest to be detected and the affinity of the antibodies to be used.",
    "Loading an excess of total protein can also saturate the membrane during the transfer, and differences between samples could be misleading.Remember that western blot is a semiquantitative technique and a loading control, housekeeping protein, or reference protein are always needed to normalize the data.The quality of the signal and the amount of background will depend in a great manner on the quality/affinity of the antibodies. If possible, use antibodies that have been previously tested by you or other laboratories.When working with R software, do not forget to use quotation marks in what should be text."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}