{
  "id": 19292,
  "origin_website": "Jove",
  "title": "Assessing Endothelial Vasodilator Function with the Endo-PAT 2000",
  "procedures": [
    "I.Prepare the Patient for an Endo-PAT Study\nPrior to the study, ensure the patient has fasted for at least 4 hours, and has refrained for at least 8 hours from caffeine, tobacco, vitamins or medications that might affect vascular tone. The patient may wish to use the restroom prior to the study.\nThe Endo-PAT study should be conducted in a quiet, dimly lit, temperature-controlled exam room to reduce fluctuations in vascular tone.\nCell phones or paging devices should be silenced, and restrictive clothing that could interfere with blood flow to the arms should be removed. The patient should also remove watches, rings, or other jewelry on the hands or fingers.\nInspect the patient's fingers for any deformities or injuries that could affect the study. Do not place the probes on a finger that is cut or injured. Fingernails should not extend more than 5mm or 1/5 of an inch beyond the tip of the finger tissue. Trim or file fingernails if necessary to avoid damaging the internal membranes of the PAT probes and displacing the finger from the sensing region of the probe.\nThe index finger is recommended for the study; however, if this finger is unsuitable, a different digit (except the thumb) may be used, as long as the same finger is used on both hands.\nThe patient should be supine and comfortable for 15 minutes so as to attain a cardiovascular steady-state. Place the two arm supporters along each of the patient's sides.\nMeasure the blood pressure using the control arm (the arm that is not occluded during the Endo-PAT study.\nPlace a blood pressure cuff on the arm to be occluded during the Endo-PAT study. Apply the cuff snugly, but without excess pressure. Do not inflate the cuff at this time.\nII.Prepare the Endo-PAT System for Study",
    "Launch the Endo-PAT 2000 software and click the \"Patient Information\" icon on the tool bar to create a new patient file.\nComplete the Patient Information dialog box, including patient ID, name (optional), age, gender, height, weight, systolic and diastolic blood pressures. Optional fields allow for free text comments.  Select your name from the pre-defined list in the Patographer name field. If your name has not been inserted add it the list and select.\nSelect two new PAT probes and connect to the pneumo-electrical tubing. To connect the probes, insert the connector tab into the probe slit and gently press the connector onto the probe until it clicks into place.\nPlace the connected probes into the sockets of the arm-supports and press the \"Deflate\" button on the top of the Endo-PAT 2000 device.\nIII.Conduct an Endo-PAT Study\nPlace the patient’s index fingers completely into the probes, confirm with the patient that he or she can feel the very end of the probes, and press the \"Inflate\" button on the top of the Endo-PAT 2000 device.\nPlace a foam anchor ring at the base of the adjacent middle finger. Ensure that the foam ring and the PAT sensor do not touch. Otherwise the ring may mechanically interfere with the sensor.\nCreate an approximately 7-10cm loop with the pneumo-electrical tubing. The loop should extend from the PAT sensor and return to the foam ring on the adjacent finger while the rest of the tubing that connects to the EndoPAT device is pointing out tubing to the tip of the finger.",
    "Position the patient's arms so the forearms are supported on the arm supports and the fingers dangle freely off the edge of the support. Make sure the probes are not in contact with any object, including the arm support, foam ring, tubing, the mattress or another finger.\nAsk the patient to refrain from moving the fingers, as this will create mechanical artifacts. It is important for the patient to be relaxed throughout the study. Explain to the patient that during the test you will inflate the arm cuff, and during that time they may feel some discomfort, numbness, or tingling.\nClick the \"Standby\" icon on the Endo-PAT's computer interface. Adjust the time base to 1 minute and adjust the signal gain on the screen to maximize signal clarity. Inspect the tracings of the PAT signals from the two probes to confirm that they are free of artifactual signals. If artifactual signals are present, veriify that the probes are not touching anything and that the patient is not moving the fingers.\nTo begin the study, click the \"Go\" icon on the computer interface. Start the stopwatch, by clicking the \"Start/Stop Timer\" icon. This will initiate a five minute count down for the baseline recording period. After five minutes, stop the stopwatch by clicking the \"Start/Stop Timer\" icon.\nTell the patient that you are going to inflate the cuff for the occlusion phase and that he or she should stay relaxed and not move the fingers.",
    "Rapidly inflate the blood pressure cuff to a supra-systolic pressure of 60mmHg above the patient's systolic pressure or 200mmHg, whichever is higher and start the stopwatch again. Complete cessation of blood flow to the hand is verified by the absence of a PAT signal from the occluded arm. To confirm occlusion increase the gain on the screen of the channel of the occluded side to 20,000 while keeping the gain of the contra-lateral side constant. Decrease the time base of both channels to 30 seconds. Verify that you do not observe any signals at a periodicity that matches the signal from the control arm as this indicates an incomplete occlusion. If this is the case then further inflate the cuff until no signals are seen. The cuff may be inflated to a maximum of 300mmHg.\nThis will initiate a five minute count down for the arterial occlusion recording period. Toward the end of the occlusion period tell the patient you are going to release the cuff and that they should continue to refrain from moving their fingers. After exactly five minutes, deflate the cuff abruptly as quickly as possible and stop the stopwatch by clicking the \"Start/Stop Timer\" icon.\nClick the \"Start/Stop Timer\" icon again to initiate a five-minute post occlusion recording period. Stop the timer after five minutes and click the \"Test Stop\" icon to complete the study. The probes will automatically deflate.\nRemove the probes, tape, and foam rings from the patient's fingers and disconnect the PAT probes from the pneumo-electrical tubing. Discard the used probes.\nIV.Review and Analysis",
    "Load the study file to the screen using the load icon. To run the automatic analysis, click the \"magician stick\" icon. The occlusion period will be highlighted in blue and the test result will be displayed, including the Reactive Hyperemia Index (RHI) and Heart Rate (HR), in the right hand column of the screen.\nTo review additional data, including study parameters, calculated variables, patient information, and measures of signal quality, click the \"Open Results of Last Calculation\" icon. This will open a spread sheet with study parameters and results for all analyses performed to date, with the last line in the table containing data from the most recent analysis.\nV.Representative Results\nA representative Endo-PAT screen of a study performed on an individual with normal endothelial vasodilator function is shown in Figure 1. A representative screen of an Endo-PAT study performed on an individual with endothelial vasodilator dysfunction is shown in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2167/2167fig1.jpg\nFigure 1: Normal Endothelial Vasodilator Function. Representative recording of an individual with normal endothelial vasodilator function, characterized by an increase in the signal amplitude after cuff release relative to baseline.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2167/2167fig2.jpg\nFigure 2: Endothelial Vasodilator Dysfunction. Representative recording of an individual with endothelial vasodilator dysfunction."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}