{
  "id": 3431,
  "origin_website": "Cell",
  "title": "An optimized protocol for chromatin immunoprecipitation from murine inguinal white adipose tissue",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue preparation and fixation\nTiming: 60 min\nThe protocol below is for 1 ChIP assay. The starting material is 8 iWAT depots (coming from four 10-weeks old mice) with an average mass of 120 mg each.\nCritical: A parallel control ChIP assay using IgG is required. Double the starting material and the amounts of the buffers described below respectively.\nNote: Ιn case that the starting material comes from an iWAT of different weight, the amounts of the following chemical solutions/ buffers must be re-calculated accordingly.\nAnaesthetize mice using sevoflurane, sacrifice them, remove iWAT depots surgically and place them in ice-cold PBS (Troubleshooting 1).\nNote: Perform all of the following steps on ice unless otherwise stated.\nTransfer fat pads in a 1.5 mL eppendorf tube and dissect them into very small pieces (between 1-3 mm3) using a pair of scissors.\nFat tissue pieces should be further processed in 1.5 mL PBS using a dounce glass grinder (perform 10 strokes with a tight pestle and for each stroke plunge the pestle to the bottom of the tube and rotate 180°).\nPass sample through a 200 μm cell strainer and place it in a 15 mL conical tube.\nAdd PBS up to 10 mL.\nWorking in a fume hood, add 0.270 mL of 37% formaldehyde (final concentration 1%).\nPlace on a rotating platform at 20°C–25°C for 15 min to perform chromatin crosslinking/ fixation.\nQuench crosslinking reaction by adding 0.513 mL 2.5 M glycine (final concentration 0.125 M).\nPlace on a rotating platform at 20°C–25°C for 7 min.\nCentrifuge at 3.450 g for 5 min at 4°C, carefully discard the interphase and add 10 mL PBS.\nRepeat above wash step one more time for a total of 2 washes.\nChromatin extraction and shearing\nTiming: 90 min",
    "Note: Perform all of the following steps on ice unless otherwise stated\nAdd 400 μL of lysis buffer supplemented with protease inhibitors (PI) and phosphatase inhibitors (PhoI) and pipette to mix.\nIncubate for 15 min at 4°C.\nMeanwhile, mix the lysate by pipetting, using a 200 μL tip, every 5 min.\nWash nuclei by centrifuging at 3.450 g for 10 min at 4°C, aspirate supernatant and re-suspend nuclei pellet in 1 mL wash buffer\nCritical: Supernatant should be removed carefully, to avoid disturbance of the pellet.\nRepeat the above washing step two more times for a total of 3 washes.\nCritical: Additional wash steps may be needed to remove excess lipid droplets.\nNote: Nuclei can be stored at -80°C or continue with sonication steps below.\nPause point: Crosslinked nuclear pellets can be stored frozen by placing them directly at -80οC for several months.\nTurn on sonicator cooling system.\nNote: Frozen nuclei pellets should be thawed on ice.\nCarefully add 0.5 mL sonication buffer and very gently turn tube sideways and twist to “wash” all the wash buffer off from the side of the tube while leaving the pellet completely intact.\nCentrifuge at 3.450 g for 5 min at 4°C and carefully discard the supernatant.\nRepeat steps 18 and 19 one more time.\nResuspend nuclei pellet in 120 μL sonication buffer and incubate at 4°C for 10 min.\nPipette to mix.\nNote: A clumpy suspension is normal to be noticed.\nCentrifuge to collect the liquid at the bottom of the tube.\nTransfer sample to a microTUBE AFA Fiber Pre-Slit Snap-Cap 6 × 16 mm, being sure to fill tubes completely.",
    "Sonicate using the S220 Focused-ultrasonicator at 4°C for 12 min (duty factor, 75; peak power, 25; cycles per burst, 200) allowing the shearing of chromatin within a range of 250–500 bp DNA fragments.\nTransfer sample to a 1.5 mL eppendorf tube.\nNote: In case that more than one ChIP reaction is performed, repeat sonication using the rest of the sample and combine them.\nCentrifuge sample at 16.060 g for 30 min at 4°C and collect supernatant in a new 1.5 mL eppendorf tube. This step is required to remove non-sonicated and non-fragmented chromatin.\nNote: Chromatin samples can be stored at -80οC or continue with the immunoprecipitation steps below.\nIsolate 10 μL of chromatin preparation for reverse crosslink reaction (see below), quantitation and electrophoresis analysis with a 2% agarose gel.\nPause point: Sheared chromatin can be stored at -80οC for several months.\nQuality validation and quantification of sheared chromatin\nTiming: 2 days\nNote: It is highly recommended to examine the fragmentation of chromatin prior to continuing with the IP.\nIncubate chromatin samples (step: 28, section: chromatin extraction and shearing[href=https://www.wicell.org#sec3.2]) with 20 mg RNase A (add 1 μL of 20 mg/μL RNase A) at 37°C for 30 min.\nAdd 30 mg proteinase K (1 μL of 30 mg/μL proteinase K) and incubate the sample at 50°C for 30 min.\nAdd 8 μL of 5 M NaCl (final concentration 0.8 M NaCl) and incubate for 16 h at 65°C.\nTo purify the DNA sample, add 100 μL of NucleoMag beads and incubate at 20°C–25°C.\nPlace tube in the magnetic holder until all the beads are separated to the edge of the tube.\nWhile keeping the tubes in the holder, carefully remove the supernatant with a pipette.\nCritical: Do not disturb the beads while removing the supernatant.",
    "Wash by adding 300 μL of 80% ethanol.\nRemove tube from the magnetic holder and invert tube for 30 s.\nPlace tube into magnetic holder and repeat the above wash step one more time for a total of 2 washes.\nDiscard the final wash and add 25 μL ddH2O.\nMix by pipetting and incubate for 5 min at 20°C–25°C.\nPlace tube into magnetic holder and incubate for 2 min.\nCollect the supernatant in to a new 1.5 mL eppendorf tube.\nQuantify DNA concentration using a NanoDrop spectrophotometer (Troubleshooting 2).\nLoad 500 ng of DNA on a 2% agarose gel with 1 Kb plus ladder (Troubleshooting 3).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3009-Fig1.jpg\nFigure 1. Shearing DNA sample run on a 2% agarose gel with 1 Kb ladder\nFragments between 250 and 500 bp are required for ChIP.\nNote: To proceed with IP, DNA should be sheared in size ranging from 250–500 bp (Figure 1[href=https://www.wicell.org#fig1])\nImmunoprecipitation and purification\nTiming: 3 days\nThe following steps detail the immunoprecipitation of protein/DNA complexes from sonicated nuclear extracts. Using the starting material of this protocol (8 inguinal iWAT depots with an average mass of 120 mg each), 50 μg of sheared chromatin could be isolated. This protocol is standardized for 1 ChIP reaction.\nNote: Frozen sheared chromatin samples should be thawed on ice.\nAdd 11 μL 10% Triton-X (final concentration 1% Triton-X) and 3.3 μL 5 M NaCl (final concentration 150 mM NaCl) in the sheared chromatin solution (Use sheared chromatin from step: 27, section: chromatin extraction and shearing[href=https://www.wicell.org#sec3.2])\nNote: The starting material of this section is 50 μg of sheared chromatin in a final volume of 110 μL.\nAliquot 50 μL protein G-Dynabeads into 1.5 mL eppendorf tube.\nPlace tube on the magnetic rack and allow beads to separate for 2 min.\nCarefully discard supernatant using a pipette.",
    "Add 50 μL of immunoprecipitation buffer and mix by inverting for 30 s.\nNote: 50 μL of protein G-Dynabeads corresponds to 10 μg of antibody according to the manufacturer’s guidelines (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0015809_Dynabeads_Protein_G.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0015809_Dynabeads_Protein_G.pdf]).\nPlace tube on magnetic rack and repeat the above 2 steps for one more time.\nRemove tube from magnetic rack and resuspend beads in 50 μL immunoprecipitation buffer.\nAdd 50 μg of sheared chromatin (step 44, section: immunoprecipitation and purification[href=https://www.wicell.org#sec3.4]) and place tube on an orbital mixer at 4°C for 90 min.\nNote: Pre-clearing step is used to minimize non-specific binding of protein-G beads.\nPlace sample on the magnetic rack for 2 min\nCollect supernatant into a new 1.5 mL eppendorf tube.\nRemove 10 μL of the sample and store at -80°C.\nCritical: This sample is the input and will be used in the next steps as a control. Note the fraction of the sample, which is collected as an Input. For example, herein we collected 10 out of 120 μL.\nAdd 10 μg of the antibody and incubate at an orbital mixer at 4°C for 16 h.\nNote: Using ChIP-grade antibodies is highly recommended. If a ChIP-grade antibody is not available, the ability of the antibody to pull down the target protein of interest under crosslinking conditions should be previously tested. In this protocol, we used antibodies against PPARγ and H3K27ac.\nNote: The amount of primary antibody is required for a high signal-to-noise ratio varies and should be tested in case that a different antibody from the ones described in this protocol is used.\nCritical: Setting aside a ChIP reaction using the same starting material and 10 μg IgG antibody as control is required.\nRepeat steps: 45–50, section: immunoprecipitation and purification[href=https://www.wicell.org#sec3.4].",
    "Incubate beads with the chromatin-antibody solution (step: 12, section: immunoprecipitation and purification[href=https://www.wicell.org#sec3.4]) in an orbital mixer at 4°C for 4 h.\nPlace tube on the magnetic rack and allow beads to separate for 2 min.\nDiscard supernatant and wash the recovered resin with 500 μL wash buffer A by pipetting.\nMove the resin with wash buffer from the previous step to a new eppendorf tube, incubate for 2 min on ice, place the tube on the magnetic rack and discard supernatant.\nRepeat the above washing step for 3 more times for a total of 4 washes.\nDiscard supernatant and add 500 μL of wash buffer B.\nMix by pipetting and place the resin on a new eppendorf tube.\nPlace tube on the magnetic rack and discard supernatant.\nRepeat the above washing step for one more time, for a total of 2 washes.\nDiscard supernatant and add 500 μL of TE buffer.\nPlace the resin with TE buffer in a new eppendorf tube.\nPlace tube on the magnetic rack and discard supernatant.\nAdd 25 μL of elution buffer.\nElute the captured chromatin fragments by incubating sample at 65°C for 30 min with occasional rigorous 10 s vortexing every 5 min.\nProceed to the reverse cross-linking reaction and purification of the eluted DNA, following the 29–41 steps of “quality validation and quantification of sheared chromatin[href=https://www.wicell.org#sec3.3]” section.\nQuantify DNA concentration using a Qubit fluorometer (or an equivalent technology), according to manufacturer’s protocol (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0017209_Qubit_4_Fluorometer_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0017209_Qubit_4_Fluorometer_UG.pdf], Troubleshooting 4).\nCritical: To proceed with library preparation and sequencing at least 500 pg of purified DNA is required.\nStore at -20οC or continue with the library preparation and sequencing.\nPause point: DNA samples can be stored at -20οC for several months.\nDownstream assays for analysis\nTiming: 4 days\nTiming: 2 days (for step 74)",
    "Timing: 120 min (for step 75)\nTiming: 2 days (for step 76)\nAnalysis of ChIP results can be achieved using qRT-PCR and/or NGS sequencing. In case that several DNA targets of the protein of interest have been previously reported, the relative enrichment of these areas can be checked by qRT-PCR to confirm a successful ChIP reaction, before proceeding to sequencing.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3009-Fig2.jpg\nFigure 2. Analysis of the quality and size distribution of the ChIP-seq library\n(A and B) Electropherogram and (B) gel image coupled with the Agilent DNA1000 ladder for size reference. Those results were obtained using the Agilent Bioanalyzer DNA1000 kit.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3009-Fig3.jpg\nFigure 3. ChIP-seq analysis depicting the genome-wide and locus-specific binding of PPARγ and H3K27ac\nChIP-seq was performed using the iWAT of WT mice (A) Tornado plot depicting PPARγ DNA binding and H3K27ac distribution throughout their respective peaks (±3 kb from peak center) and (B) chromatin binding of PPARγ and H3K27ac modification at the promoters of Pdk4, Tmem245, Dnajp1 and Cbx7. The relative length of the represented genomic loci is also indicated.\nSequencing.\nOptimally begin NGS library preparation with 10 ng for each ChIP / input reaction, with the NEBNext Ultra II DNA Library Prep Kit, following the manufacturer’s protocol (https://international.neb.com/-/media/nebus/files/manuals/manuale7103-e7645.pdf?rev=de09eaf8fcdf45e0ac8a66bf6fee75fb&hash=4617FF2DC70A34462B8C24A16123353B[href=https://international.neb.com/-/media/nebus/files/manuals/manuale7103-e7645.pdf?rev=de09eaf8fcdf45e0ac8a66bf6fee75fb&hash=4617FF2DC70A34462B8C24A16123353B]).\nQuantify libraries using the Qubit dsDNA HS fluorometric assay.\nCritical: Minimum material required for library prep is 500 pg and maximum is 1 μg ChIP/input DNA.\nNote: Each ChIP-seq library that will be sequenced in the same sequencing run must be ligated with a different indexed adapter, in order to distinguish the raw fastq data of each sample.\nCheck the quality and size distribution of the libraries with Agilent Bioanalyzer DNA1000 (https://www.agilent.com/cs/library/usermanuals/public/G2938-90014_DNA1000Assay_KG.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/G2938-90014_DNA1000Assay_KG.pdf]) or HS kit (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FQubit_dsDNA_HS_Assay_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FQubit_dsDNA_HS_Assay_UG.pdf]), following the manufacturer’s instructions.",
    "Critical: Electropherogram of the libraries should optimally depict a distribution from 200–700 bp, with maximum peak at 250–300 bp and no visible peaks of primer dimers (∼120 bp) and adapter dimers (∼140 bp) (Figure 2[href=https://www.wicell.org#fig2]). Maximum peak distribution can vary from 250–700 bp, but not exceed that range, in order for Illumina sequencing to be performed successfully.\nPool indexed libraries together in equimolar amounts.\nSequence the pool of indexed libraries at the Illumina NovaSeq 6000 sequencer.\nNote: Sequencing mode can vary depending on the sequencer and the sequencing cartridge used, but in general Single End, 75–100 bp read length is more than enough for ChIP-seq analysis.\nCritical: Ideally, at least 20 Million 75–100 bp Single End Reads per sample should be obtained.\nSequencing analysis. (Troubleshooting 5, 6)\nPerform Quality Control using FastQC using the following steps:\nCommand.\n>fastqc ∗.gz\nNote: FastQC is a quality control tool for high-throughput sequence data, which allows the performance of quality control checks on raw sequence data. Herein, we used the fastq.gz files.\nAssessment of results is performed with Per Base Sequence quality module of FASTQC. BoxWhisker type plot is drawn for each position (x-axis), while the y axis represents the quality scores (Q score). Ideally, mean quality should be over 28, which represents the green area of the graph. Positions with Quality score below 20 must be removed by trimming, which can be performed either from the alignment tool or from specific trimming tools like fastx_trimmer (FASTX-Toolkit, Cold Spring Harbor).\nBuild the genome index following the steps below.\nCommand.\n>bowtie2-build mm10.fa mm10\nNote: Bowtie2 is a memory efficient tool for aligning the short reads to reference genomes.2[href=https://www.wicell.org#bib2] Input file should be in fasta format. Herein, the mouse genome downloaded from UCSC (mm10 version) is used to build the genome index.\nPerform alignment using Bowtie2",
    "Command.\n>bowtie2 -p 6 -5 3 -3 3 -x mm10 -U sample.fastq.gz -S\nsample.sam;\nNote: In this example, 6 threads are used, and every read is trimmed in 5′ and 3′ prime removing 3 bases, to increase sensitivity.\nPreprocess the aligned files.\nNote: This step is performed with SAMtools3[href=https://www.wicell.org#bib3] and BEDtools4[href=https://www.wicell.org#bib4] commands. Both are tool packages to handle SAM, BAM and BED files. Briefly, low-quality reads, duplicates, mitochondrial DNA and blacklist region annotations are removed. The SAM file is converted to BAM file and eventually to BED file. Before every step, the BAM file is indexed and sorted. The final BED file is also sorted.\nConvert SAM file to BAM file.\nCommand.\n>samtools view -bS -F 4 -q 20 -@ 8 sample.sam >\nsample.bam\nSort BAM file.\nCommand.\n>samtools sort -@ 5 -m 4G sample.bam -o samplesort.bam\nRemove duplicate reads.\nCommand.\n>samtools rmdup -s samplesort.bam sampledup.bam\nIndex new file.\nCommand.\n>samtools index sampledup.bam\nGenerate stats for file and remove Mitochondrial DNA annotations.\nCommand.\n>samtools idxstats sampledup.bam | cut -f 1 | grep -v\nchrM | xargs samtools view -@ 5 -b sampledup.bam > xh.bam\nIndex new file.\nCommand.\n>samtools index xh.bam\nRemove blacklist region annotations.\nCommand.\n>bedtools intersect -abam xh.bam -b mm10.blacklist.bed.gz\n-v > final.bam\nIndex new file.\nCommand.\n> samtools index final.bam\nSort final BAM file.\nCommand.\n>samtools sort -n -@ 5 -m 4G final.bam -o finalsort.bam\nConvert BAM file to BED file.\nCommand.\n>bamToBed -i finalsort.bam > final.bed\nSort final BED file.\nCommand.\n>sort -k1,1 -k2,2n h5.bed > finalsort.bed\nAfter the completion of the preprocessing for both Treatment and Input files, perform peak calling using MACS2.5[href=https://www.wicell.org#bib5]\nFor transcription factors, the following command is used, generating short peaks.\n>macs2 callpeak -f BED -g mm --keep-dup all --call-\nsummits -t IP.bed -c Input.bed -p 0.01 --bdg -n\npeaks",
    "For histone modification marks, the following command is used, generating broad peaks.\n>macs2 callpeak -f BED -g mm --keep-dup all -t\nIP.bed -c Input.bed --broad --broad-cutoff 0.1 --bdg\n-n peaks\nGenerate bigwig files.\nSubtract input signal from IP signal, using the macs2 bdgcompare tool.\nCommand.\n>macs2 bdgcompare -t IP.bdg -c Input.bdg -m\nsubstract -o IPsubstract.bdg\nSort the generated bdg files and then convert them to bigwig with bedGraphToBigWig tool.\nNote: For the last step, the mm10.chrom.sizes file is needed from the UCSC. The generated files can be loaded at a Genome Viewer (herein, IGV).\nCommand.\n>sort -k1,1 -k2,2n IPsubstract.bdg > IPsubsorted.bdg\n>bedGraphToBigWig IPsubsorted.bdg mm10.chrom.sizes\nIpfinal.bw\nVisualize the IP signal at selected regions (Figure 3[href=https://www.wicell.org#fig3]).\nNote: Herein, the PPARγ and H3K27ac signal is depicted at their respective peaks with descending order in terms of signal power.\nGenerate matrices using the deepTools6[href=https://www.wicell.org#bib6] command computeMatrix. Reference-point mode is used, with the window of base pairs defined ± from the peak center.\nCommand.\n>computeMatrix reference-point -b 5000 -a 5000\n--SortRegions descend -S Ipfinal.bw -R peakfile.bed\nNote: This command generates a matrix.mat.gz file which is used at the next command\nGenerate summary and tornado plot with plotHeatmap.\nCommand.\n>plotHeatmap -m matrix.mat.gz --heatmapWidth 8 --\nheatmapHeight 24 --dpi 300 --ColorMap ‘Blues’ -out\nplot.png\nNote: At this step, you can add in the command the option --outFileSortedRegions which generates a list of the coordinates used for the visualization.\nqRT-PCR.\nNote: This step is recommended to validate the ChIP results.\nDesign and test qRT-PCR primers.",
    "Note: Use primerBlast to design pairs of primers targeting the area of interest. Ideally, Tm of primers should be over 60°C and not exceeding 72°C, with minimal difference (0.5°C–1°C) between the forward and the reverse primer. Self-complementarity scores should be retained below 2. The amplicon should not exceed 150 bp to achieve maximum efficiency.\nSet up qRT-PCR reactions using primers targeting the region of interest.\nNote: The samples to be analyzed include the eluted DNA from IP, the eluted DNA from IgG antibody, and the Input DNA.\nUse 1 μL of each sample for every qRT-PCR reaction (step 72, section: immunoprecipitation and purification[href=https://www.wicell.org#sec3.4]) as templates and perform qRT-PCR reactions using KAPA SYBR Fast Master Mix and a Bio-Rad CGC96 Real-Time System, following the manufacturer’s protocol (https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/418/169/sflckb.pdf[href=https://www.sigmaaldrich.com/deepweb/assets/sigmaaldrich/product/documents/418/169/sflckb.pdf]).\nNote: Input sample can be accordingly diluted to adjust into the detection Ct value range of the primers.\nPCR reactions should be set in at least duplicates, and Ct values should have minimal variance across samples.\nPerform a reaction consisting of 40 cycles followed by melting curve generation, using the following PCR reaction conditions:\n3 min initial denaturation at 95°C.\nStart of Cycle.\n15 s at 95°C.\n30 s at 60°C.\nFluorescence identification.\nEnd of Cycle.\nMelting curve step.\n0.5°C increments with Fluorescence identification, from 60°C to 95°C.\nAnalyze qRT-PCR results\nNote: In this paper, we used the Input percentage method for the quantitation of ChIP-PCR. The Input percentage analysis shows the amount of DNA pulled down by the antibody of interest used in the IP reaction, compared to the amount of starting sample (Input sample)\nThe formula for the calculation is:\nΔCt=CtIP - CtInput - Log2 (Dilution Factor).\nDilution Factor is defined by the percentage of starting material which is used as an Input, multiplied by the times the input sample is diluted.",
    "For example, we used 10 μL out of 120 μL (thus, the Input fraction is 8.33% times of the starting material) and we performed a ten-fold dilution for the qPCR. Therefore, the dilution factor is 12 × 10 = 120 and the log2(120) = 6.9 must be subtracted from the Ct value of input.\nFinally, the formula is:\nInput percentage = 2-ΔCt ∗ 100."
  ],
  "subjectAreas": [
    "Genomics",
    "Sequence Analysis",
    "Metabolism",
    "Chipseq",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}