{
  "id": 18599,
  "origin_website": "Jove",
  "title": "A Semi-Quantitative Drug Affinity Responsive Target Stability (DARTS) assay for studying Rapamycin/mTOR interaction",
  "procedures": [
    "1. Collect and lyse cells\nGrow 293T cells using Dulbecco's modified Eagle medium (DMEM) with 10% fetal bovine serum, 2 mM glutamine and 1% antibiotics. Incubate cultures at 37 °C under 5% CO2.\n\tNOTE: The growth state of the cells may affect the stability of subsequent experiments.\nExpand cells in culture until reaching 80‒90% confluence.\nMix 345 μL of cell lysis reagent (see the Table of Materials) with 25 μL of 20x protease inhibitor cocktail, 25 μL of 1 M sodium fluoride, 50 μL of 100 mM β-glycerophosphate, 50 μL of 50 mM sodium pyrophosphate, and 5 μL of 200 mM sodium orthovanadate. Keep the lysis buffer chilled on ice.\n\tNOTE: Other lysis buffers with various detergents (e.g., Triton X-100 or NP-40) can be used with DARTS as long as they are non-denaturing. Membrane proteins or nuclear proteins can be extracted by adding 0.4% Triton X-100 or 0.4% NP-40 to the cell lysate.\nWash the cells twice with cold phosphate-buffered saline (PBS).\nUse a cell scraper to collect the cells in an appropriate amount of cell lysis buffer and transfer the lysing cells into a 1.5 mL tube.\n\tNOTE: The number of cells needed for each DARTS experiment will vary based on how much protein can be extracted from various cell lines. In general, the protein concentration of the lysate used is between 4‒6 μg/μL. One 10 cm plate of 293T cells at 85‒90% confluency, lysed with 300 μL of lysis buffer typically results in a lysate with a protein concentration of ~5 μg/μL.\nMix the lysis buffer/lysing cells well and incubate the tube on ice for 10 min.\nCentrifuge the tube at 18,000 × g for 10 min at 4 °C.\nTransfer the supernatant into a new 1.5 mL tube and keep chilled on ice.",
    "Perform a BCA assay to approximate the protein concentration of lysates.\n2. Incubate protein lysates with the small molecule\nSplit 99 μL of the lysates into two 1.5 mL tubes.\nMake a starting stock concentration of 10 mM small molecule. When performing DARTS, one may begin with a higher concentration of the small molecule (5‒10x the EC50 value) to ensure optimal binding.\n\t\nAdd either 1 μL of solvent that the small molecule is soluble in or 1 µL of small molecule stock solutions to each aliquot of lysate. Incubate cell lysate with the solutions for 30‒60 min at room temperature with shaking.\nOn ice, establish serial dilutions (1:200, 1:400, 1:800 and 1:1600) of freshly thawed pronase solution in 1x TNC (For 1 mL of 10x TNC buffer, mix 300 μL of ultrapure water with 100 μL of 5 M sodium chloride, 100 μL of 1 M calcium chloride, and 500 μL of 1 M Tris-HCl, pH 8.0).\nExamine a wide-breadth of pronase:protein ratios (e.g., spanning from 1:100 to 1:2000) to guarantee observability of the step-wise effect of pronase on target(s).\n\tNOTE: To calculate pronase concentrations (example): 5 μg/μL protein concentration x 20 μL sample = 100 μg protein. For a pronase:protein ratio of 1:100 we need 0.5 μg/μL (100 μg ÷ 100 ÷ 2 μL) pronase solution. This experiment may have to be repeated several times to obtain a suitable range of pronase:protein ratios.\n3. Perform proteolysis\nNOTE: For proteolysis, steps are carried out at room temperature unless otherwise noted\nFollowing incubation with the small molecule, divide each aliquot into 20 μL samples.\nAdd 2 μL of the range of pronase solutions in each sample at specific intervals (every 30 s). Use an equal volume of 1x TNC buffer to establish an undigested control sample.",
    "After 5‒20 min, halt digestion via addition of 2 μL of cold 20x protease inhibitor cocktail every 30 s. Mix well and incubate on ice for 10 min.\nDilute samples with the appropriate volume of 5x SDS-PAGE loading buffer and boil at 95 °C for 5 min.\nCarry out the next portion of the experiment or store the protein sample at −80 °C.\n4. Quantification and analysis\nAfter DARTS, perform Coomassie blue staining according to the previously published protocol22.\nThe stained protein bands should be very clear after destaining. Pour off the used destain solution and add fresh 1% acetic acid solution to cover the gel. Put the gel under the light to observe the bands with significant differences between groups with (sample group) or without (control group) the small molecule.\nCut the two corresponding bands from the gel with a sterile instrument and perform LC-MS/MS immediately.\n\tNOTE: LC-MS/MS needs to be done as soon as possible because the proteins in the gel will degrade continuously.\nDigest the bands, extract peptides and perform LC-MS/MS analysis23.\n\t\nTo analyze LC-MS/MS data, first identify all the proteins in the individual band. Second, use peptide spectrum match (PSM) to represent the abundance of each protein.\n\t\tNOTE: PSM provides the total number of identified peptide sequences for the protein, including those redundantly identified. In general, how often a peptide is identified/sequenced can be used as a rough estimate of how abundant the protein is in the sample. Proteins enriched in the sample group over the control group are proteins of interest.\nProcure the primary antibodies of the selected proteins. Perform western blot to verify that the small molecule can bind directly to the potential target proteins24.",
    "Load equal amounts of protein into the wells of an 8% SDS-PAGE gel, along with an appropriate molecular weight marker. Run the gel for 30 min at 80 V, then adjust the voltage to 120 V and continue running for 1‒2 h.\nQuantify the different target protein bands using image processing and analysis software (see the Table of Materials).\nAnalyze the data and draw the curves.\n\t\nDetermination of the proteolytic curve for a target protein\n\t\t\nThe pronase:protein ratio is varied when performing proteolysis. Normalize data from image analysis by attributing the band intensity values corresponding to the undigested bands to 100%.\nUse nonlinear regression analysis of the statistical analysis and drawing software to plot a curve of normalized data for relative band intensity and pronase:protein ratios.\nFirst, open the software, select the type of table and graph as XY and allow for 3 replicate values in side-by-side subcolumns. Then enter the corresponding data in the space below x and y. Under x, input the numbers 0, 1, 2, 3, 4, 5 (as place holders corresponding pronase:protein ratios).\nIn the y column, enter the normalized data for relative band intensities. Perform “Nonlinear regression” and implement a “Dose-response-Stimulation” using the “Log (agonist) versus response—Variable slope (four parameters)” equation.\nConvert the annotations of the X-axis in the curve to the corresponding pronase:protein ratios.\nDetermination of the dose-dependence curve for a target protein\n\t\tNOTE: For dose-dependence analysis, the molarity of the small molecule is differed across samples. The stable pronase:protein ratio should be informed by analysis of proteolysis data. The pronase:protein ratio that showed maximal difference in target protein intensity during the proteolytic curve should be used for the dose-dependence experiment.",
    "Quantify the different target protein bands using an image analysis software. As in generation of the dose-dependence curve, normalize data from image analysis by attributing the band intensity values corresponding to the least digested band to 100%.\nApply the nonlinear regression analysis within the statistical analysis and drawing software to the normalized data. First, open the software, select the type of table and graph as XY, and enter 3 replicate values in side-by-side subcolumns.\nThen, enter the corresponding data in the space below x and y. For the ‘x’ variable, input different concentrations of the small molecule; ‘y’ includes the corresponding normalized data for relative band intensity.\nTransform x values using X = Log(X). Finally, employ nonlinear regression, and implement a dose-response stimulation using the “Log (agonist) versus response—Variable slope (four parameters)” equation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}