{
  "id": 11482,
  "origin_website": "Jove",
  "title": "An Electrophysiology Protocol to Measure Reward Anticipation and Processing in Children",
  "procedures": [
    "Procedures involving human participants were approved by the Human Subject Research Ethics Committee/Institutional Review Board at University of California, Riverside and University of California, San Diego.\n1. Stimuli Preparation\nNote: The procedures described below are specific to a commercially available editing suite (see Table of Materials); however, other photo editing software can certainly be used.\nPrepare a set of emotional face photographs25 categorized into two facial expressions (happy and sad). Using previously collected behavioral ratings, choose photographs with highly accurate emotion ratings (in which over 80% of participants identified the emotion correctly)25.\n\tNOTE: In our protocol, there were 33 chosen adult faces (18 female, 15 male). Of the 18 females, 9 are Caucasian, 4 are African American, and 5 are Asian American. Of the 15 males, 9 are Caucasian, 6 are African American, and none are Asian American. In this case, photos have already been cropped and placed on a white background. It is important to note that the NimStim set of facial expressions was rated and normed by adults25. Thus, it is possible that children or adolescents may perceive facial expressions differently than the adults who normed the images.\nStandardizing the emotional expression stimuli\nUsing a photo editing suite, edit the photographs to be in grayscale, then save them (in the software used here, this is done by selecting Image | Mode | Greyscale).\nMake sure that the resolution is 72 pixels/inch and that the file width is 8.5 inches and height is 11 inches.\nUsing a ruler, change the width of the photograph (in pixels) until the face measures 11 cm from the outside of the hair on one side to the outside of hair on the other side, and 14 cm from the start of hairline to the bottom of the chin.",
    "Creating the scrambled face arrow stimuli\nDownload the \"scramble\" plugin (http://telegraphics.com.au/sw/product/Scramble).\nExtract the ZIP and move it into \"plug-ins\" inside the editing suite's application folder.\nIn the photo editing program, create a \"custom shape\" in the shape options. Make sure that the shape is an arrow.\nOpen the emotional face images one at a time. Use the selection tool to select only the face and not the background.\nSelect Filter | Telegraphics | Scramble | OK.\nSelect Window | Layers (this should produce a \"layers\" window to the side).\nDouble click background, then click ok and rename it to layer 0 (any name is fine).\nRight click on the shape tool in the left-hand menu bar and choose the custom arrow shape.\nDrag the arrow shape into the middle of the scrambled image.\nUse Ctrl + T to drag the arrow to the middle of the image and adjust the size so it is the same as the face image (e.g., 11 x 14 cm).\nUse the angle tool to ensure that for happy faces the arrow faces upwards and for sad faces the arrow faces downwards.\nClick layer 0 or the name given in step 1.3.7.\nSelect Layers | Group with previous.\nClick Select-all | Edit | Copy merged.\nCreate a new file with the arrow on a white background by selecting File | New. The new file should be 8.5 x 11 inches at a resolution of 72 pixels/inch.\nSave the files.\n\t\tNOTE: After these are saved, there should be photographs of individuals with sad expressions, happy expressions, and the scrambled versions. The scrambled photograph with the upwards pointing arrow is the nonsocial image for happy, and the scrambled photograph with the downwards pointing arrow is the nonsocial image for sad.\nCreating the reward images",
    "Find an image of a goldfish cracker (without anything else in the frame) and download it to the computer.\nOpen the goldfish cracker image in a photo editing suite and edit it to be in grayscale.\nCreate two goldfish cracker images: 1) one in grayscale and 2) one that is crossed out (e.g., has a surrounding circle/oval with a line through the middle).\nUsing Copy | Paste, place images of the intact goldfish cracker around the happy images (e.g., both the upwards pointing arrow and smiling people).\nUsing Copy | Paste, place images of the crossed-out goldfish cracker around the sad images (e.g., both the downwards pointing arrow and frowning people).\nPreparing the stimuli in electrophysiology (EEG) presentation software\nCreate two blocks of stimuli in an EEG presentation software package. One block will be social (e.g., pictures of smiling and frowning faces) and the other will be nonsocial (e.g., pictures of upwards and downwards facing arrows).\nPseudo-randomize the order of stimuli in each block such that no image occurs more than once in a row, and such that the participant does not see more than three sad/downwards facing arrows or happy/upwards facing arrows in a row.\nSet up each trial to contain the following: a fixation cross; 2 boxes with question marks (the participant will use a button press to indicate a choice between the left and right box); an arrow pointing to the box the participant choses via the button press; and feedback (the stimuli created above).",
    "NOTE: Although participants are choosing the left or right box, whether correct (e.g., happy face or upwards facing arrow surrounded by intact goldfish) or incorrect (e.g., sad face or downwards facing arrow surrounded by crossed out goldfish) feedback shown is pre-programmed by the randomization described in step 1.5.2. Thus, participants may feel that they are guessing correctly or incorrectly, but in reality the choice does not affect which feedback image is shown.\nDisplay each trial based on the following durations: 1) fixation cross for 500 ms, 2) two boxes with question marks inside for 3000 ms, 3) two boxes with question marks inside, with an arrow pointing towards the box chosen by the participant for 2000 ms, and 4) feedback (e.g., face or scrambled face images) for 1000 ms. See Figure 1.\n\t\tNOTE: If participants fail to respond (via the button press) within 3000 ms, the trial ends and the next trial begins. The anticipated visual angle is a horizontal visual angle of 14.5° and vertical visual angle of 10.67°.\n2. Behavioral Procedures\nRecruit participants with and without ASD diagnoses based on the Institutional Review Board guidelines.\nAdminister cognitive tests (e.g., Wechsler Abbreviated Scale of Intelligence, WASI26) to all participants to confirm that children have cognitive scores within the low-average to average range (e.g., a full-scale IQ of at least 70).\n\tNOTE: It was determined that children with full-scale IQs below 70 would likely have difficulty understanding and remembering task directions. Therefore, an IQ cut-off of 70 was chosen as an exclusionary criterion for participation.\nFor participants with a previous diagnosis of ASD, administer the autism diagnostic observation schedule (second edition, ADOS-2)27 to confirm their eligibility.\n3. EEG Recording\nSet up the participants.",
    "Ensure that each participant sits in a comfortable chair in a dimly lit room and adjust the chair so individuals are 72 cm away from the computer screen. Provide a brief tutorial about the procedure.",
    "NOTE: In this study, participants were told the following: \"You will be playing a guessing game - just like pick-a-hand, except on the computer. You will see 2 boxes with question marks in them, and then you will use this button box to choose whether you think the right or left box is the right one. If you think the left box is the right one, press the left button. If you think the right box is the right one, press the right button. Once you pick, you'll see the boxes with question marks and an arrow in the middle showing which one you picked. Then you'll see if you got it right. For each one you get right, you'll get 1 goldfish cracker. If you don't like goldfish, you can trade for fruit snacks. When you get it right, you'll see a ring of goldfish crackers. That means you get a goldfish cracker! When you get it wrong, you'll see a ring of crossed out goldfish crackers. When you get it wrong, you won't lose any goldfish, you just won't gain any that time. The computer will keep track of how many goldfish you get, and then I'll give you that many after we are all done.\" After the tutorial, ask participants, \"Ok, so what are you going to do?\" followed by, \"What will you see when you get it right?\" and \"What will you see when you get it wrong?\" to confirm that they understand the task. If they do not seem to understand, explain it again until they are able to answer those questions correctly.\nUse an EEG cap with 32 Ag/AgCl electrodes in the international 10-20 system, with additional vertical (VEOG) and horizontal (HEOG) electrodes to capture eye movement.",
    "Measure the participant's head to determine which size cap is appropriate for the head size.\nUsing a blunt needle, pre-gel the cap by injecting conductive gel into the electrodes.\nConnect the EEG cap to the amplifier with a low-pass filter at 70 Hz, a directly coupled high pass (DC) filter, a 60Hz notch filter, and 500 Hz sampling rate.\nFit the EEG cap to the participant's head such that the \"Cz\" electrode is placed at the middle of the scalp (e.g., middle of nasion to inion) as per the 10-20 system.\nUsing a blunted needle or sterile wooden stick, swirl inside the electrode to move any hair and allow the gel to contact the scalp.\nUse an impedance meter (or the EEG computer) to ensure that impedance is below 10 KΩ for a low impedance system and below 50 KΩ for a high impedance system.\nOnce all the electrodes on the cap show acceptable impedance levels, place the HEOG and VEOG electrodes. Place the HEOG electrodes at the canthus of each eye, and VEOG electrodes above and below the eye.\nIf any electrodes have impedance levels above the acceptable thresholds noted above, record them in a notebook or on the computer.\nBegin the experimental blocks, counterbalancing the order of blocks (e.g., social and nonsocial) between participants. Ensure that the EEG computer is recording, the EEG computer and recording computer are synchronized, and the events are being sent correctly.\nGive the participants 30-second breaks after every 15 trials (approximately every 2-3 minutes) to allow them to move around if needed.\n\tNOTE: Although no explicit directions were given to children regarding movement, participants were told to use breaks to \"get the wiggles out\", \"get some energy out\", or to perform any other movements they wanted to.",
    "Between blocks, give participants a longer break (about 5 minutes). After each block, have participants fill out a 4-question Likert scale about how much they enjoyed the guessing game and how often they felt they could get correct answers.\nAfter both blocks are completed and participants have filled out both Likert questionnaires, take off the EEG cap and allow them to wash their hair.\n\t\nProvide payment (or an equivalent \"prize\") to the participants and their families.\nClean and sterilize the EEG cap.\n4. Processing EEG Data\nNote: The procedures and commands described in this section are specific to EEGLAB and ERPlab toolboxes28.\nIn ERPlab, filter the EEG data using a high-pass filter of .01 Hz and low-pass filter of 30 Hz.\nDiscard (in ERPlab) or interpolate (in EEGLAB) bad channels that appear to have high impedance and/or were problematic during recording (e.g., lost contact with the skin during recording).\nUsing the EEG channel operations GUI (in ERPlab), re-reference the EEG data using the average of the left and right mastoid electrodes (mastoid electrodes were chosen as the reference due to not having a dense electrode array; in which case, experts sometimes suggest using the average reference29, and because using the average of both mastoid electrodes is less problematic for laterality effects versus a single mastoid30).\nIf using the average of mastoid electrodes for re-referencing, those two electrodes must provide a clear signal. If either mastoid electrode has a poor-quality signal (e.g., with high impedence or lost contact with skin during recording), do not use the participant's data for analysis.\nUse the EVENTLIST dropdown menu in ERPlab to create an EEG Eventlist, and assign codes from the stimulus computer to bins using BINLISTER.",
    "Using the extract bin-based epochs dropdown menu in ERPlab, segment the continuous EEG data into stimulus-locked epochs and baseline correct. To measure the stimulus-preceding negativity (SPN), use epoch from -2200 to 100 ms (baseline of -2200 to -2000 ms). To measure reward processing or post-stimulus brain activity, use epoch from -200 to 800 ms (baseline of -200 to 0 ms).\nPlot the data in EEGlab, and mark and discard epochs that appear to contain non-eye blink artifacts (e.g., excessive noise or motor movement).\nChoose Run ICA on the epoched data.\nPlot the independent components (select Plot | Component activations) and identify any artifacts from eye movement and blinks.\nRemove the components identified as eye movements or eye blink artifacts. To check whether the components marked for removal are responsible for eye movement, choose plot single trial data to visualize the data with the identified components removed. Once the blinks and eye movements are removed, accept the removal of the identified components.\nIn ERPlab tools, select Artifact rejection in epoched data | Moving window peak-to-peak procedure. In the current study, a 200 ms moving window, 100 ms window step, and 150 mV voltage threshold were utilized.\nCompute the average ERPs. Make sure to use the default settings, which state that all epochs marked for removal will be discarded from the averaged ERP.\nTo analyze average brain activity occurring prior to the onset of the stimuli, extraction (in step 4.11) should occur during the last 200 ms prior to stimulus onset (e.g., -210 to -10 ms) from the electrodes of interest.\n\t\nIn the case of stimulus-preceding negativity (SPN), electrodes of interest include: F3/F4, C3/C4, P3/P4, and T5/T6 (note that in some systems, temporal electrodes in this region are labeled T6/T7 or T3/T4).",
    "NOTE: -210 to -10 ms was chosen in this protocol rather than -200 to 0 ms to avoid contamination by brain activity not related to the SPN (e.g., the beginning of neural activity when the feedback stimuli is shown at 0 ms).\nTo export numeric data for analysis, use the ERP measurement tool.\n\tNOTE: This tool allows researchers to specify latency or amplitude information, the time windows of interest, and the electrodes of interest. Amplitude can be calculated either as the local peak in a given time window, or as the mean amplitude of a given time window.\nDownload the numeric data as a .txt file. As needed, export the data into excel or copy and paste it into a statistical analysis program (e.g., SPSS or JMP).\n5. Processing Differences for ERSP Analysis\nBegin with the file created in step 4.11 (e.g., the epoched file with all artifact rejection procedures complete).\nUtilize the EEGlab \"newtimef\" plug-in to obtain a time x frequency transform with values for each time point, frequency, and trial.\nTo measure anticipatory alpha band activity, calculate the average values from 8 to 12 Hz.\nCalculate the average activation prior to feedback onset (e.g., -2200 to -100 ms with baseline of -2200 to -2000 ms) in the same electrodes used for the SPN.\nTo calculate alpha asymmetry prior to feedback, subtract the log power in the left hemisphere from the right hemisphere.\n\tNOTE: To calculate ERSP activation after feedback onset, data would need to be re-analyzed and re-grouped into epochs using a different time window (e.g., -200 to 800 ms with baseline of -200 to 0 ms).\n6. Statistical Analysis\nPaste the numeric data extracted in section 4 (steps 4.11 and 4.12) into a statistical program (e.g., SPSS or JMP).",
    "Conduct repeated measures ANOVA in the statistical software to the mean values of ERPs to compare brain activity between hemispheres (left, right), electrode positions (frontal, central, temporal, parietal), conditions (face, arrow) and groups (autism spectrum disorder, typically developing).\n\tNOTE: Hemisphere, electrode position, and condition are within-subjects factors, and group is a between-subjects factor.\n\t\nIf hemisphere or electrode position is not statistically significant, collapse across for future analysis.\nIf the relationship between behavioral measures (e.g., ADOS severity score) and ERPs is of interest, correlation analyses can be run."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}