{
  "id": 10398,
  "origin_website": "Jove",
  "title": "3D Imaging of Soft-Tissue Samples using an X-ray Specific Staining Method and Nanoscopic Computed Tomography",
  "procedures": [
    "Caution: Please consult all relevant material safety data sheets (MSDS) before use. Several of the chemicals used in the protocol are acutely toxic and carcinogenic. Please use all appropriate safety practices when performing the staining protocol including the use of engineering controls (fume hood, glovebox) and personal protective equipment (safety glasses, gloves, lab coat, full length pants, closed-toe shoes).\nAnimals Used:\nAnimal housing was carried out at the Klinikum rechts der Isar, Technical University of Munich in accordance with the European Union guidelines 2010/63. Organ removal was approved from an internal animal protection committee of Klinikum rechts der Isar, Munich, Germany (internal reference number 4-005-09). All procedures were in accordance with relevant guidelines and regulations. All laboratories are inspected for accordance with the OECD principles of good laboratory practice.\n1. Eosin staining protocol\nTo fixate soft-tissue samples, fill a 50-mL centrifuge tube with a fixative solution containing 9.5 mL of 4% (v/v) formaldehyde solution (FA) and 0.5 mL of glacial acetic acid (AA).\n\tNOTE: Prepare the FA solution freshly from a 37% acid free FA solution stabilized with approximate 10% methanol. Dilute the FA solution further with Dulbecco’s phosphate buffered saline (DPBS). Choose DPBS without calcium and magnesium. Keep the dilute FA solution no longer than one month. During acidification the pH of the fixative solution is changing from neutral to approximately 3.\n\tCAUTION: Because FA is acute organ toxic, corrosive and carcinogenic, the use of a fume hood is mandatory and appropriate protective personal equipment must be used.\n\t\nAdd the freshly removed soft-tissue sample to a 50-mL centrifuge tube and refrigerate the 50-mL centrifuge tube for 24-72h.\n\t\tNOTE: The protocol can be paused here.\nWash the soft-tissue sample with DPBS solution for 1h.",
    "To stain the fixated soft-tissue sample (e.g., a whole mouse kidney), place the soft-tissue in 2 mL of eosin Y-staining solution and incubate the sample for 24 h. Keep the sample on a horizontal shaking plate for a smooth rocking (ca. 60 rpm) during the incubation process.\n\tNOTE: The eosin Y-staining solution has a concentration of 30% (w/v) in distilled water. Choose the volume of the staining solution in such a way that the sample is completely covered by the staining solution and allow the sample to move freely within the sample container. The incubation time may differ for other samples and has to be adjusted accordingly.\nAfter staining, remove the soft-tissue sample carefully from the sample container.\n\t\nCarefully remove excess of staining agent with cellulose tissue paper.\nPlace the soft-tissue sample in a conical sample container above an ethanol vapor phase for storage and further use.\n\t\tNOTE: The conical sample container must always contain a few drops of 70% (v/v) ethanol at the bottom of the tube to keep the soft-tissue sample moist and prevent artifacts.\n2. X-ray microCT imaging\nNOTE: The X-ray microCT measurements were performed with a microCT scanner, which offers overview CT measurements (the ability to image the entire sample within the field of view (FOV)) and the performance of high-resolution CT measurements (the ability to focus in on one desired volume of interest (VOI) of the very same sample) down to 1 µm.\nMount the soft-tissue sample to an appropriate sample holder. Ensure a tight fit of the sample on the sample holder to prevent the sample from moving during the X-ray CT measurements.",
    "In case of the stained mouse kidney: Prepare a sample holder with two centrifuge tubes, whereby the bottom of one tube is cut off. Glue the two centrifuge tubes together using two-component adhesive. Ensure a straight alignment of the centrifuge tubes around the rotation axis. Wait for the adhesive to harden.\nOnce the sample holder is ready for use, transfer the mouse kidney into the intact centrifuge tube, which holds a few drops of 70% (v/v) ethanol at the bottom of the tube.\n\t\tNOTE: Stability of the sample is crucial. Take time to prepare the sample for X-ray CT measurements. The soft-tissue sample is kept over an ethanol vapor phase to keep the sample moist during the X-ray CT measurements and prevent the soft-tissue sample from shrinkage and other artifacts. The soft-tissue sample should not be in contact with the solvent to obviate accumulation of the solvent around the sample during X-ray CT measurement, which might lead to sample movement during the measurement or might cause problems during reconstruction. If the sample holder does not allow to hold solvent at the bottom, a cellulose paper moistened with 70% (v/v) ethanol can be placed in the sample holder. It should be noted that shrinkage artifacts due to the solvent ethanol were not observed.\n\t\tNOTE: The protocol can be paused here.\nAfter careful alignment of the sample, choose acquisition parameters for best image quality. In case of the presented microCT data, acquire the scan at a peak voltage of 50 kV, a current of 3.5 W using 1601 projections equally distributed over 360°.",
    "NOTE: The acquisition parameters for the overview CT scan were chosen for best image quality. As such the 0.39x camera objective was chosen to cover the whole sample within the field of view (FOV). This resulted in an effective pixel size of 12 µm. The exposure time of 2 s per projection provided a good signal to noise ratio. The ROI for the high-resolution CT scan was identified using the microCT data from the overview scan. MicroCT scanners often incorporate an integrated software tool, which allows for the precise selection of the determined ROI. For the high-resolution CT data, the 4x camera objective was chosen resulting in an effective pixel size of 3.3 µm. Here, an exposure time of 15 s per projection was needed.\n\tNOTE: The protocol can be paused here.\nAfter acquisition of the X-ray CT data, process the projections accordingly for reconstruction of the 3D volume. In case of the presented microCT data: Reconstruct the X-ray CT data with the integrated software.\n\tNOTE: The volume renderings of the microCT data shown in Figure 1 and Figure 2 were generated using a visualization software.\n\tNOTE: The protocol can be paused here.\n3. X-ray nanoCT imaging\nNOTE: The X-ray nanoCT scanner has been developed inhouse. The lens free instrument is equipped with a nanofocus X-ray source and a single-photon counting detector. 3D data with resolutions down to 100 nm can be generated10. Generally, nanoCT systems including those with X-ray optics are commercially available and not limited to the described nanoCT scanner.\nNanoCT sample preparation",
    "Prepare VOIs of the soft-tissue sample. Cut the soft tissue into very small pieces of approximately 0.5 mm edge length using a scalpel and a stereomicroscope. In case of the mouse kidney: Cut the mouse kidney into two halves along the longest axis. Take one half of the mouse kidney and prepare different anatomical regions such as renal cortex and renal medulla.\n\t\tNOTE: The other halve of the mouse kidney was transferred to histopathology, where the sample was embedded into paraffin and processed accordingly to yield the typical histological sections as seen in Figure 3c and Figure 3d.\nTransfer the small pieces before the first dehydration step to a new Petri dish, where they remain for all subsequent steps.\nDehydrate the samples using concentrations (all v/v) in %: 50, 60, 70, 80, 90, 96 and 100 ethanol balanced with distilled water. Perform each dehydration step for 1 h each.\n\t\tNOTE: The protocol can be paused here. Keep the small tissue pieces in 100% ethanol overnight.\nCritical point dry (CPD) the small tissue pieces.\n\t\tNOTE: The application of CPD enables the complete dehydration of the tissue sample by exchanging the solvent (here ethanol) with the drying agent (here CO2). This has been necessary to ensure that the sample can be mounted to the sample holders of the nanoCT, is not moving during the measurement and can be positioned very close to the X-ray source to allow for best geometrical magnification. The nanoCT setup is based on mere geometrical magnification, with the magnification factor being defined as the source-to-detector distance over the source-to-sample distance. The drying technique was first introduced by Anderson to preserve the 3D structure of biological specimens for electron microscopy28. An overview of the technique is provided by Bray29.",
    "Prefill the vacuum chamber with 100% ethanol. Transfer the small tissue pieces into a micro-porous capsule and place it in the vacuum chamber of the CPD. Close the system.\n\t\t\tNOTE: Since high pressure is involved in the CPD process, ensure all parts of the CPD, in particular the fittings, are intact and the system is properly closed.\nCool the chamber to 6- 8°C and fill up with liquid CO2.\nWhile stirring, wait 3 min to allow for proper mixing of the two components. Carefully drain the chamber. Ensure the sample holder is still covered with solvent. Repeat this step ten times to allow complete replacement of ethanol with CO2 within the sample.\nAfter the final filling of the chamber with CO2, heat the machine to the critical point of CO2 (31 °C and 73.8bar) followed by very slow release of the gaseous CO2 over a time of 30 min.\n\t\t\tNOTE: The release of the gas should be undertaken very slowly as otherwise condense water can form on the sample. Ensure that the temperature does not drop below the critical point of CO2. Only open the CPD machine when all pressure has been released from the system.\nRemove the CPD tissue pieces quickly from the machine and keep them in a new Petri dish stored in a desiccator prior to further use.\n\t\t\tNOTE: The protocol can be paused here.\nMount the CPD tissue pieces to an appropriate sample holder. Ensure a tight fit of the sample on the sample holder to prevent the sample from moving during the CT measurements. In case of the CPD mouse kidney tissue pieces: Glue the tissue pieces with superglue to a sample holder.",
    "NOTE: Any undesired movement of the sample during CT measurements can cause problems during volume reconstruction - especially when acquiring a data set with nanometer voxel size.\n\tNOTE: The protocol can be paused here.\nAfter careful alignment of the sample, choose acquisition parameters for best image quality. In case of the presented nanoCT data: Acquire projections at a peak voltage of 60 kV with 1599 projections equally distributed over 360° and a voxel size of approximately 400 nm.\n\tNOTE: A single CT measurement acquired at 400 nm voxel size has a FOV of 75 µm in the direction of the rotation axis (vertical) and approximately 560 µm in the direction perpendicular to the rotation axis (horizontal). To investigate larger volumes, an extension of the FOV along the rotation axis can be achieved by combining multiple scans at different vertical positions. Additionally, local tomography scans can be performed to measure samples with a larger sample diameter perpendicular to the rotation axis than given by the FOV of a global CT scan. The nanoCT data was acquired with an exposure time of 4 s per projection. As such the total acquisition time per data set was approximately 3.5 h.\n\tNOTE: The protocol can be paused here.\nAfter acquisition of the CT data, process the projections accordingly for reconstruction of the 3D volume.\n\t\nIn case of the presented nanoCT data, normalize the acquired projections with flatfield images. Enhance the sharpness of the projections by using a Richardson-Lucy deconvolution algorithm30,31. Use a rotationally symmetric Gaussian function with a standard deviation of one pixel as deconvolution kernel.\nApply Paganin’s phase-retrieval algorithm to the sharpened images to increase the soft-tissue contrast. Set the parameters of the algorithm to optimize the image quality32. Reconstruct the preprocessed projections with a state-of-the-art filtered backprojection algorithm.",
    "NOTE: Figure 3 evaluates the obtained nanoCT data with corresponding histological sections, which were approximately 7 µm thick. Therefore, minimum intensity projection slices of 18 adjacent nanoCT slices with a virtual thickness of approximately 7 µm were generated by means of calculating the minimum value for each pixel in the relevant slices. A visualization software was used to render the volume of the nanoCT data, which is displayed in Figure 4."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}