{
  "id": 18030,
  "origin_website": "Jove",
  "title": "A Metadata Extraction Approach for Clinical Case Reports to Enable Advanced Understanding of Biomedical Concepts",
  "procedures": [
    "1. Document and Annotation Identification\nNote: Values in this category support the annotation process.\nUsing the annotation template, provide an identifier specific to this metadata set, e.g., Case123. The identifier format should be consistent throughout the project (e.g., Case001 through Case500).\nSpecify the date on which a document was read and annotated. Use a format resembling “Jan 10 2018” for consistency and readability.\n2. Case Report Identification\nNote: Values in this category provide document-level features and contribute to a document’s findability.\nBe consistent with the format of each field across all annotations, e.g., individual values should be separated by semicolons without following spaces in all entries. Use identical formats to those used in the original document or those used in a bibliographic database such as MEDLINE.\nProvide the title of the document.\nProvide the names of all authors of the document in the provided order. Normalize the format of all names, such that all names take the form of a single last name followed by any number of initials, e.g. Jane B. Park becomes Park JB. Do not include titles. Separate multiple authors with a semicolon without additional punctuation, such that John A. Smith, Jane B. Park takes a form of Smith JA;Park JB. \nProvide the year of publication of the document.\nProvide the full title of the journal in which the document was published. A list of controlled journal names is provided by the NLM Catalog (https://www.ncbi.nlm.nih.gov/nlmcatalog).\nProvide the address of the home institution of the authors of the document, as specified in the document. This may include departments, geographic locations, and postal address details.",
    "If multiple locations are provided (e.g., if affiliations differ between authors), specify only details for the corresponding author. If a corresponding author cannot be identified, use that of the first author, or do not specify an institution. If a corresponding author has multiple affiliations, specify both and separate with a semicolon.\nProvide the corresponding author of the document, as specified within the document heading using the same format as that used in the Authors data type.\nProvide a document identifier (e.g., a PMID).\nProvide a Digital Object Identifier, where possible and available, resolvable to the document URL (through https://www.doi.org/), not a PubMed Central page.\nProvide a stable URL to the full text of the document, if available. To maximize accessibility, this may refer to the PubMed Central version.\nProvide the document language. For documents available in multiple languages, provide both, separated with a semicolon.\n3. Medical Content\nNote: Values in this category identify document-level, concept-level, and text-level features. They serve to enhance a document’s accessibility, interoperability, and reusability. These features provide ways to observe conceptual and semantic similarities between document content, with a focus on biomedical topics and events. Most categories in this section can include multiple text statements and each should be separated using a semicolon.\nInclude contextual detail in each field (e.g., “mother had breast cancer at age 50”) rather than providing only terms from a controlled vocabulary (e.g., not “breast cancer” alone). Do not include extensive detail beyond each observation.",
    "Omit commonly repeated words and phrases (e.g., pronouns, the word “patient”, and the phrases “complained of” or “presented with”). Though subjectivity across multiple annotators is likely, it may be reduced by having multiple annotators for each document and through automated normalization after data collection. Computational post-processing approaches will vary by subsequent analysis needs and are not discussed here in detail.\nProvide the following information in the annotation template.\n\t\nProvide specific terms identified within a document, usually in its header, as key terms. Separate with a semicolon as terms may include other punctuation.\nProvide demographic values, specifically any text statements describing a patient's background, including sex and/or gender, age, ethnicity, or nationality.\nProvide geographic locations mentioned within the clinical narrative, other than specific institution addresses. This should not include anatomical locations/parts, but may include any geographic locale where the patient resides or travels.\nProvide life style values, including any text statements describing frequent patient activities or behaviors relevant to their general health. In practice, this frequently involves smoking or alcohol consumption habits, but may also include sun exposure, diet, or frequency of specific types of physical activity.\nProvide medical history values referring to family history. Include any text statements describing clinical observations of and events experienced by siblings, parents, and other family members. This includes genetic conditions and negative observations (i.e., family history was negative for a disease).\nProvide values referring to Social History, including any text statements describing patient background not covered in Demography or Life Style. There may be overlaps in content between these categories. The statements may include occupational history and social habits.",
    "Provide values referring to the patient’s medical and surgical history. Include any text statements describing any medical observations, treatments, or other events taking place prior to the beginning of the clinical presentation. This includes obstetric history and periods of good health, where noted.\nSpecify one or more of the following 16 disease system categories. Note that these values are categorical rather than free-text. Categories are not comprehensive but should indicate most systems impacted by the events described in the clinical presentation and diagnosed disease.\n\t\t\nFollow a specific set of categories, based on the categories used in the International Statistical Classification of Diseases and Related Health Problems, revision 10 (ICD-10) code system. See Table 1 for the list of disease system categories along with corresponding ICD-10 code ranges.\nProvide details of all signs and symptoms. Include any text statements describing any medical observations of signs or symptoms beginning at initial presentation, including their onset, duration, severity, and resolution, if provided. Do not include symptoms described in the outcome. These values may overlap with other types if symptoms continue from history to initial presentation.\nProvide details of any comorbidities. Include any terms or phrases describing distinct diseases present at the time of initial clinical presentation. There is likely overlap between these values and those in clinical history, though Comorbidity should not include terms identical to those in the Diagnosis.\nProvide details of all diagnostic techniques and procedures. Include the names of medical procedures done for diagnostic purposes, including examinations, tests, and imaging, as well as the conditions under which these tests were performed and relevant anatomical locations (e.g., “upper extremity venous ultrasound”). Exclude test results.\nProvide details of diagnosis. Include any text statements describing diagnoses of disease, even if the final diagnosis is ambiguous.",
    "Provide all laboratory values and test results. Include names of diagnostic tests, their values, and conditions under which they were performed. This will involve overlap with terms used in the Diagnostic Techniques and Procedures data type. Both numerical and qualitative values (e.g., complete blood count was within normal limits) are acceptable. If the names of diagnostic tests are not provided, use terms describing the results (e.g., leukopenia), though they should also be included in the Signs and Symptoms.\nProvide details of pathology. Include any text statements describing results of pathology and histology studies, including gross pathology, immunology, and microscopy studies. Terms may overlap with those used in Diagnostic Techniques and Procedures (step 3.11), e.g., with the procedures performed to obtain samples such as biopsy.\nProvide all pharmacological therapies. Include any text statements describing drug therapies used in the course of treatment, including general terms such as antibiotics or specific drug names. Also, include descriptions of when and how drug therapies were stopped.\nProvide all interventional procedures. Include any text statements describing therapeutic procedures used in the course of treatment, including invasive procedures, implantation of medical devices, and procedures done to facilitate other therapies. Also, include descriptions of when and how ongoing therapeutic procedures were stopped, if necessary.\nProvide the patient outcome. Include any text statements describing health of the patient as of the end of the clinical presentation described in the report, including any follow-up tests.\nProvide counts of all diagnostic images, figures, videos/animations, and tables. Include all counts of visual media included in the report, in the following format: Count of images; Count of figures; Count of videos or animations; Count of tables.",
    "Distinguish between images and figures in this way: images include any products of clinical diagnostics, including photographs, micrographs, electrocardiogram rhythm images, and other products of diagnostic imaging, while figures are all other images, generally including data plots and illustrations.\nProvide evidence of relationships to other CCRs. This field may include identifiers (e.g., PMIDs) of other reports in the data set cited by or referencing this report.\nProvide evidence of relationships to clinical trials. This field may include identifiers of clinical trials citing this CCR. Identify trials by their ClinicalTrials.gov identifiers, preceded by NCT, or other stable identifier.\nInclude database crosslinks corresponding to this document, including identifiers, preferably as database names and stable URLs.\n4. Acknowledgements\nNotes: Values in this category identify document-level features yet have little consistent structure across publications. They provide details regarding the organizations providing support for a CCR and related work. This category also includes a field for the total count of references cited by an article: this is intended to provide a rough metric of the degree to which a document has conceptual relationships with other biomedical documents of any type. Within the four data types in this section, provide the following.\nSpecify all funding sources supporting the work and corresponding PI as well as relevant award numbers. The first value, Funding Source, should include the names of all organizations providing financial support for the work.\n\t\nSeparate organizations with semicolons and spaces, e.g., National Institutes of Health/National Cancer Institute; DOE; Smith-Park Foundation.",
    "For the following value, Award Number, specify any award numbers or specific designations provided along with the recipients of the awards, where appropriate, as initials of the recipients in parentheses, e.g., R01HL123123 (to JP), NS12312 (to JP, JS), research training fellowship (to JS). Authors may explicitly state that no corresponding information is available (e.g., “no funding was received”); in these cases, use the text provided by the authors as the Funding Source value. Otherwise, the value should be NA.\nSpecify disclosures/conflicts of interest as specified by the authors, e.g., JP is a consultant for DrugCo. Authors may explicitly state that no corresponding information is available (e.g., “no conflict of interest is declared”); in these cases, use the text provided by the authors as the Disclosures/Conflict of Interest value. Otherwise, as above, the value should be NA.\nSpecify a numerical count of all references cited by the document, not including those provided in any supplementary material. No reference text should be included in this field."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}