{
  "id": 10979,
  "origin_website": "Jove",
  "title": "Combination of Microstereolithography and Electrospinning to Produce Membranes Equipped with Niches for Corneal Regeneration",
  "procedures": [
    "Ethics Statement: The eyes used in this study were used according to the Declaration on Openness on Animal Research:\n1. Fabrication of PLGA Biodegradable Membranes Equipped with Micropockets\nThe ring scaffolds were created by a combination of microstereolithography and electrospinning techniques31. In essence, the process can be summarized in 2 parts (i) creation of PEGDA templates by microstereolithography and (ii) electrospinning onto the templates for reproduction of the underlying PEGDA structure (in this case a microfabricated ring). These two steps are described in detail below (Figures 1 and 2).\n\t\nFabrication of PEGDA templates by microstereolithography (microSL)\n\t\t\nFabricate the rings using a 2 layer model, with the first layer (L1) being the base of the structure and the second layer (L2) presenting 6 micropockets with horseshoe morphologies in a range of sizes from 300-500 µm. The fabrication of PEGDA rings was recently described by this group22.\n\t\t\t\nCreate L1 by drawing a 1.2 cm black circle using any suitable drawing program.\nCreate L2 in the same way but include 8 white 0.5 x 0.35 mm horseshoe-shaped structures. Distribute the small white horseshoe shapes within the black circle structure.\nSave L1 and L2 in JPEG format.\nIn a dark glass vial, mix polyethylene glycol diacrylate (PEGDA, Mn = 250 g/mol) with 1% w/w Camphorquinone, a photoinitiator, on a magnetic stirrer for 20 min.\nExpand the laser beam of the microstereolithography set-up using a telescopic lens arrangement and then project it onto a computer programmable digital multimirror device (UV-enabled DMD starter kit). NOTE: The DMD reflects the image (in this case a ring) onto a mirror via a 10 cm focal length tube lens. The image is then directed by the silver-coated mirror into a vial containing the photocurable polymer (PEGDA).\nAdjust and carefully clean the optics of the microstereolithography set up.",
    "Put 300 µl of the PEGDA mixture into a well of a 12-well tissue culture plate. Make sure the wells are pre-coated with Teflon or other non-stick material for easy removal of the structure after curing.\nSwitch on the blue laser (MBL-III 473 nm; 150 mW) and upload L1 into the ALP3-basic software previously installed on the PC. Irradiate the first layer for 60 sec. NOTE: ALP3-basic is a USB interface that provides the link between the PC and the Digital micromirror device.\nAdd to the well 250 µl more of the PEGDA, upload L2 as described above and irradiate L2 for 60 sec.\nRemove the uncured polymer and wash the ring with isopropanol O/N.\nFabrication of Biodegradable PLGA membranes using electrospinning\n\t\tNOTE: The PEGDA rings were used as templates over which PLGA was electrospun with the PLGA reproducing the underlying topography as it is spun over these templates. After spinning, the sheet of PLGA polymer was peeled from the collector. The final PLGA membrane did not contain the PEGDA rings which were left attached to the metallic collector.\n\t\t\nDistribute the PEGDA rings on an electroplated aluminum sheet (12 cm x 20 cm) for creating a static electrospinning collector.\nAttach the rings using conductive carbon tape. NOTE: These rings once formed can be re-used as templates for electrospinning.\nPrepare the polymer solution for spinning. Dissolve PLGA (50/50 DL-lactide (52 mol%): glycolide (48 mol%), 44 kg/mol) in dichloromethane (DCM) at 20% w/w concentration.\nStir O/N before use.\nPlace 4 insulin syringes (blunt ended, 0.8 cm inner diameter needles) on a syringe pump. NOTE: Four syringes ensured more rapid electrospinning than working with a single syringe.\nLoad 2.5 ml of PLGA solution in each syringe.",
    "Electrospin using a 30 µl/min flow rate and voltages ranging from 12 to 15 kV. Leave a distance between the needles and the collector of 15 cm.\nElectrospin for 1 hr and 30 min and finally carefully peel the PLGA electrospun sheet from the collector supporting the PEGDA rings.\nCut the electrospun scaffolds into 22 mm diameter circles using a circular hole punch and leaving the ring structure positioned in the center.\n2. Long-term Storage of PLGA Microfabricated Membranes\nNote: The PLGA rings were fabricated and sterilized by accredited external companies; samples were irradiated at an external dose range of 25-40 KGy.\nMount the membrane in a small container (Plastic petri dish) and place it inside a medical grade bag.\nUse filter paper to create small filter bags for the desiccants. To create the bags, fold the filter paper (125 mm diameter) and cut the resulting semicircle in half; then seal the ends together using tape.\n\t\nFill three filter paper bags with 1 g of silica orange, cobalt (II) chloride, and copper (II) sulfate, respectively.\nPut the three bags of desiccant inside the medical grade bag along with the electrospun membrane.\nAdd to the bag a commercially available six spot humidity indicator card to detect any moisture accumulation during the storage period.\nUse a vacuum heat seal machine to vacuum and seal the bag.\nSend the ring membranes to an external company for γ-irradiation.\nStore γ-irradiated PLGA membranes at a wide range of temperatures from -20 °C to +37 °C in a moist environment within an incubator containing 5% CO2.\nPost storage, examine the humidity indicator to confirm that the level of humidity is beneath 30%.\nUse Scanning Electron Microscopy (SEM) to assess fiber integrity.\n3. Isolation of Limbal Explants",
    "Rabbit limbal explants were isolated from rabbit eyes (obtained from a farm where rabbits are bred for consumption).\nDisinfect the rabbit eyes using antiseptic solution (3%).\nClean the eyes by removing any excess tissue surrounding the cornea.\nSeparate the limbal region (identified as a thin circular area between the cornea (transparent) and the sclera (white)) from the rest of the cornea using a dissection microscope.\nCut into segments (around 1.5 cm long) under the dissection microscope.\nDisinfect the limbal segments in 1.5% antiseptic solution for 1 min.\nCut the limbal segments into small pieces (100-500 µm) with a scalpel blade.\nStore the small pieces of tissue in culture media (DMEM+Glutamax: Ham´s F12 (1:1), 10% fetal bovine serum, 1 U/ml penicillin, 100 mg/ml streptomycin, 2.5 µg/ml amphotericin, 10 ng/ml of EGF, and 5 µg/ml of insulin) at 37 °C and 5% CO2 until use (no more than 60 min).\n4. Outgrowth of Cells from Limbal Explants\nRabbit limbal explants were placed on both freshly spun microfabricated membranes and membranes which were vacuum-packed and stored for 6 months at -20 °C.\nCoat the ring scaffolds with 15 µl of fibrin glue (1:1 mixture of fibrinogen from human plasma at a concentration of 18.75 mg/ml and thrombin from human plasma at a concentration of 2.5 U/ml) using a cell scraper for distributing the fibrin evenly.\nPlace the tissue explants directly on the PLGA micropockets using a 25 G needle and a dissecting microscope.\nAdd cell culture media very gently to avoid detaching the explants.\n\t\nChange media every 3 days (media recipe described in section 3.7) and keep in culture for 2 weeks at in a humidified incubator at 37 °C and 5% CO2.\nFix the samples with 3.7% buffered formaldehyde for 10 min followed by 3 washes with PBS.",
    "Counterstain by incubation in 1 µg/ml of 4',6-diamidino-2-phenylindole (DAPI) or propidium iodide (PI) for 10 min at RT.\nWash 3 times in PBS and store the samples covered with foil.\nImage the samples using a fluorescence microscope at wavelengths of 543 nm and 800 nm (two-photon).\n5. Setting-up Rabbit Wounded Cornea 3D Models\nClean and disinfect the rabbit eyes as described above.\nWound the rabbit eyes by immersing them in 0.14% ammonium hydroxide for 5 min.\nRinse the eyes in PBS and scrape away the epithelium with a sclerotome knife.\nCut and isolate the cornea-scleral button removing any remaining tissue.\nPlace the corneas epithelial side down onto a sterile cup and fill with 0.5% agar made in DMEM.\nOnce set, put the corneas epithelial side up, in small petri dishes and add culture media (recipe described above) up to the limbal area. NOTE: Do not cover the whole cornea; keep the organ culture at the air-liquid interface.\n6. Isolation of Limbal Explants and Inclusion of Ring Scaffolds in Rabbit Cornea 3D Models\nCoat the ring membranes with 15 µl of fibrin glue (1:1 mixture of fibrinogen at a concentration of 18.75 mg/ml and thrombin at a concentration of 2.5 U/ml).Use a cell scraper as described above.\nPlace the tissue explants directly on the PLGA micropockets using a 25 G needle and a dissecting microscope.\nPlace the rings with the tissue explants on the denuded corneas with the explants facing up and at air-liquid interface conditions. (These conditions have been previously described22).\nMaintain the organ culture models for 4 weeks in a humidified incubator at 37 °C and 5% CO2 changing the media every 2 days.\n7. Assessment of Corneal Regeneration and Stem Cell Maintenance\nAfter 4 weeks, fix the corneas using 3.7% formaldehyde.",
    "Process the corneas for conventional histology to produce 6 µm paraffin sections.\nStain with hematoxylin and eosin (H&E).\nFor immunocytochemistry, dewax the sections in xylene (3min) and rehydrate in 100% ethanol (1 min), 70% ethanol (1 min), and distilled water (2 min).\nDelineate the sections using a Dako pen to delimit small areas and avoid excessive use of antibody.\n\t\nTreat the delineated areas with 0.05% trypsin (100 µl) for 20 min (37 °C).\nWash thoroughly with PBS and add 100 µl of 10% goat’s serum (blocking) for 1 hr.\nIncubate the samples with 100 µl of mouse monoclonal antibody cytokeratin 3 (CK3) and 100 µl of p63 in 1% goat’s serum O/N at 4 °C.\nWash with PBS and treat with 100 µl of biotinylated secondary anti-mouse antibody (1:1,000 in 1% goat serum) for 1 hr at RT.\nAdd 100 µl of FITC-streptavidin (1:100 in 1% goat serum) for 30 min at RT.\nTreat the samples with DAPI as described above.\nImage the samples using a fluorescence microscope at wavelengths of 800 nm (two-photon) and 488 nm."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}