{
  "id": 7352,
  "origin_website": "Bio",
  "title": "Glucose Starvation, Magnesium Ion Starvation, and Bile Stress Assays",
  "procedures": [
    "Note: All the bacteriological growth and survival assays should be carried out in an aseptic environment, inside a Class II-Biosafety Cabinet. Use sterile micro tips, culture medium, flasks, and Petri dishes in all experiments. Storage of bacterial strains (S. Enteritidis)Grow the Salmonella strains in nutrient-rich LB medium at 37°C and 150 rpm until the logarithmic (log)-phase is achieved.Store bacteria in 50% glycerol. Add 300 µl of (log)-phase culture to 700 µl of 50% glycerol. Mix it gently by inverting the cryo-chill tubes.Streak S. Enteritidis and its derivative strains before initiating experiments on LB agar plates containing 50 µg/ml Streptomycin (see Recipes). You can streak with micro-tips or a sterile inoculation loop.Grow the strains by placing the streaked LB plates in the incubator at 37°C overnight.Note: The time required to reach a particular O.D. may vary depending on the incubator, temperature, and rpm used to culture the bacterial strains. Thus, it is necessary to determine the growth curve pattern of the strains before conducting stress survival assays, especially if the role of the target genes during stress is growth phase-dependent. Growth curve analysis of bacterial strainsPick one bacterial colony from the bacterial LB agar plates with sterile 200 µl micro-tips [For example, S. Enteritidis (WT) and S. Enteritidis (mutant X) will serve as the representative strains for the protocols in this article].Inoculate the bacterial strains (one colony each) in 5 ml of growth medium (LB or M9 minimal medium) in culture test tubes.Culture the strains overnight (12-16) h at 37°C and150 rpm.Sub-culture from the overnight bacterial culture in sterile conical flasks containing 100 ml of growth medium at 1:100 ratio (1 ml of overnight bacterial culture in 100 ml of LB or M9 minimal medium).Collect 1 ml of the culture of each bacterial strain in 1.",
    "5 ml microcentrifuge tubes at 0 h (just at the time of sub-culturing), 1 h, 2 h, and up to 24 h.Measure the O.D. of the cultures at an hourly interval (0 h, 1 h, and up to 24 h) in a UV-Spectrophotometer at λmax of 600 nm.Take note of the O.D. at different time points in an excel sheet.Repeat the experiment in biological replicates on different days. Acquire the data and save the raw data in an excel sheet.Plot the O.D.600 of the strains versus the time (in hours) using GraphPad Prism (see Figure 1 and Figure 2).Take note of the time and the culture growth conditions required to reach a particular desired O.D. to carry out the subsequent experiments.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4157/bioprotoc-11-18-4157-g001.jpgFigure 1. Representative growth curve analysis of S. Enteritidis strains in LB medium (A) and M9 minimal medium (B). The graph represents the O.D. of the bacterial strains (representative S. Enteritidis WT and mutant strains) across different time points up to 12 h.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4157/bioprotoc-11-18-4157-g002.jpgFigure 2. Representative growth curve analysis of S. Enteritidis strains in LB medium (A) and M9 minimal medium (B). The graph represents the logCFU/mL of the bacterial strains (representative S. Enteritidis WT and mutant strains) across different time points up to 12 h. The approximate doubling time of WT is 22.2 min in LB medium and 20.3 min in M9 minimal medium.You can collect 200 µl of culture at the indicated time points (above) for assessing the CFU of the strains at the corresponding O.D. and time points.Serially dilute all the cultures collected with 1× PBS at 10-1, 10-2, 10-3, 10-4, and 10-5 dilution (100 µl culture+ 900 µl 1× PBS).Place the LB agar plate containing Streptomycin (50 µg/ml) on the turntable.",
    "Spread plate 50 µl of each dilution onto the LB agar plates with a sterile cell spreader. Label the bottom of each LB agar plate with the organism name, time, and the dilution factor.Note: Dry the plates completely to avoid condensation on the lid of the Petri dish. Bring the plates to room temperature before spread-plating. Incubate the plates at 37°C overnight to obtain the bacterial colonies.Glucose Starvation AssayPick one bacterial colony from the bacterial LB agar plates with sterile 200 µl micro-tips.Inoculate the bacterial strains (one colony each) in 5 ml of M9 minimal medium (0.4% glucose) in culture test tubes (see Recipes).Culture the strains overnight (12-16) h at 37°C and 150 rpm.Sub-culture from the overnight bacterial culture in two sets of sterile conical flasks containing 100 ml of M9 minimal medium (0.4% glucose) at a 1:100 ratio (1 ml of overnight bacterial culture into 100 ml of M9 minimal medium) at 37°C and 150 rpm.Monitor the O.D.600 of strains intermittently, until an O.D.600 of 0.4 (early log phase) is reached.Note: Most stress response genes are growth phase-dependent. Depending on your study requirement, choose your growth phase to carry stress response survival assays. In this protocol, we have conducted stress response assays in early log phase culture, which is denoted by O.D.600 of 0.4. Culture one set of flasks with strains in 100 ml of M9 minimal medium (0.4% glucose) at a 1:100 ratio, at 37°C and 150 rpm for the entire experiment. It will serve as an experimental control to monitor the growth rate of the pathogen, which should be similar (not growth defective) under normal culture conditions.To achieve this, transfer one set of log-phase bacterial cultures obtained from step 4 into 50 ml Falcon tubes.",
    "Recover all the bacterial cells from the culture by centrifuging at 3,000 rpm for 10 min at room temperature. Remove the media supernatant.Wash the cells twice with M9 buffer (M9 minimal medium without casamino acids and glucose) by resuspending the bacterial pellet in 20-30 ml of M9 buffer. Centrifuge at 3,000 rpm for 10 min at room temperature. Remove the M9 buffer supernatant. This step is done to remove M9 minimal medium traces from the bacterial cells.Resuspend the washed pellet in 1 ml of M9 buffer. Transfer the culture into a sterile conical flask with M9 minimal medium containing 0.4% glucose. At this point, collect the culture for serial dilution and plating on LB agar immediately. This time point will serve as 0 h.The growth will be monitored by collecting the cultures at 1 h, 2 h, 3 h, and 4 h of growth in normal M9 minimal medium. Serially dilute them and plate them on LB agar containing Streptomycin (50 µg/ml). The CFU at these time points will serve as control compared to the CFU of strains grown in glucose-starved conditions.To create glucose-starved medium, transfer the second set of log-phase cultures obtained from step 4 into 50 ml Falcon tubes. Recover all the bacterial cells from the culture by centrifuging at 3,000 rpm for 10 min at room temperature. Remove the media supernatant.Wash the cells twice with M9 buffer (M9 minimal medium without casamino acids and glucose) by resuspending the bacterial pellet in 20-30 ml of M9 buffer. Centrifuge at 3,000 rpm for 10 min at room temperature. Remove the M9 buffer supernatant. This step is done to remove M9 minimal medium traces from the bacterial cells.Resuspend the washed pellet in 1 ml of M9 buffer.",
    "Transfer the culture into a sterile conical flask with M9 minimal medium containing 0.03% glucose (see Recipes). This medium will serve as the glucose-starved medium for the strains. Collect the culture for 0 h time point.Culture the strains in glucose-starved medium at 37°C and 150 rpm. Collect the cultures after 1 h, 2 h, 3 h, and 4 h of exposure to get the glucose starvation data.Note: You can collect for longer time points if the bacterial cells are surviving beyond 4 h. The time of analysis is subjected to the survival of your bacterial strain post-exposure to stress. Serially dilute all the cultures collected at different time points with 1× PBS at 10-1, 10-2, 10-3, 10-4, and 10-5 dilution (100 µl culture+ 900 µl 1× PBS).Place the LB agar plate containing Streptomycin (50 µg/ml) on the turntable. Spread plate 50 µl of each dilution onto the LB agar plates with a sterile cell spreader. Label the bottom of each LB agar plate with the organism name, time following treatment with stress, and the dilution factor.Note: Dry the plates completely to avoid condensation on the lid of the Petri dish. Bring the plates to room temperature before spread-plating. Incubate the plates at 37 °C overnight to recover the surviving bacterial colonies.Magnesium (Mg2+) Starvation AssayPick one bacterial colony from the bacterial LB agar plates with sterile 200 µl micro-tips.Inoculate the bacterial strains (one colony each) in 5 ml of M9 minimal medium (Optimal working concentration of MgSO4: 200 µM) in culture test tubes (see Recipes).Culture the strains overnight (12-16) h at 37°C and 150 rpm.",
    "Sub-culture from the overnight bacterial culture in two sets of sterile conical flasks containing 100 ml of M9 minimal medium (200 µM MgSO4) at 1:100 ratio (1 ml of overnight bacterial culture into 100 ml of M9 minimal medium) at 37°C and 150 rpm.Monitor the O.D.600 of strains intermittently, until an O.D.600 of 0.4 (early log phase) is reached.Culture one set of flasks with strains in 100 ml of M9 minimal medium (200 µM MgSO4) at a 1:100 ratio (1 ml of overnight bacterial culture into 100 ml of medium) at 37°C and 150 rpm for the entire experiment. It will serve as an experimental control to monitor the growth rate of the pathogen, which should be similar (not growth defective) under normal culture conditions.To achieve this, transfer one set of log-phase bacterial cultures obtained from step 4 into 50 ml Falcon tubes. Recover all the bacterial cells from the culture by centrifuging at 3,000 rpm for 10 min at room temperature. Remove the media supernatant.Wash the cells twice with M9 buffer (M9 minimal medium without casamino acids, glucose, and MgSO4) by resuspending the bacterial pellet in 20-30 ml of M9 buffer. Centrifuge at 3,000 rpm for 10 min at room temperature. Remove the M9 buffer supernatant. This step is done to remove M9 minimal medium traces from the bacterial cells.Resuspend the washed pellet in 1 ml of M9 buffer. Transfer the culture into a sterile conical flask with M9 minimal medium containing 200 µM MgSO4. At this point, collect the culture for serial dilution and plating on LB agar immediately. This time point will serve as 0 h.Growth will be monitored by collecting cultures at 1 h, 2 h, 3 h, and 4 h of growth in normal M9 minimal medium.",
    "Serially dilute them and plate them on LB agar containing Streptomycin (50 µg/ml). The CFU at these time points will serve as a control compared to the CFU of strains grown in Mg2+ starved conditions.To create Mg2+ starved medium, transfer the second set of log-phase cultures obtained from step 4 into 50 ml Falcon tubes. Recover all the bacterial cells from the culture by centrifuging at 3,000 rpm for 10 min at room temperature. Remove the media supernatant.Wash the cells twice with M9 buffer (M9 minimal medium without casamino acids, glucose, and MgSO4) by resuspending the bacterial pellet in 20-30 ml of M9 buffer. Centrifuge at 3,000 rpm for 10 min at room temperature. Remove the M9 buffer supernatant. This step is done to remove M9 minimal medium traces from the bacterial cells.Resuspend the washed pellet in 1ml of M9 buffer. Transfer the culture into a sterile conical flask with M9 minimal medium containing 20 µM MgSO4 (see Recipes). This medium will serve as the Mg2+ starved medium for the strains. Collect culture for 0 h time point.Note: You change MgSO4 of concentration (2 to ≤20 µM) in M9 minimal medium to mimic the Mg2+ starved environment in vitro. Culture the strains in Mg2+ starved medium at 37°C and 150 rpm. Collect the cultures after 1 h, 2 h, 3 h, and 4 h of exposure to Mg2+ starvation.Note: You can collect for longer time points. The time of analysis is subjected to the survival of your bacterial strain post-exposure to stress. Serially dilute the cultures collected at different time points with 1× PBS at 10-1, 10-2, 10-3, 10-4, and 10-5 dilution (100 µl culture+ 900 µl 1× PBS).Place the LB agar plate containing Streptomycin (50 µg/ml) on the turntable.",
    "Spread plate 50 µl of each dilution onto the LB agar plates with a sterile cell spreader. Label the bottom of each LB agar plate with the organism name, time following treatment with stress, and the dilution factor.Note: Dry the plates completely to avoid condensation on the lid of the Petri dish. Bring the plates to room temperature before spread-plating. Incubate the plates at 37°C overnight to recover the surviving bacterial colonies.Bile Stress AssayNote: The sensitivity to bile salts may vary depending on the bacterial strain and the commercial source. Before conducting assays with compounds that exhibit bactericidal/toxicity against the bacteria (like bile salts), determine the minimal inhibitory concentration (MIC) of the compound and use a concentration below it for studying the stress response of target strains against the reference strain. Reference the research articles by Hernández et al. (2012) and Wiegand et al. (2008) to calculate the MIC of bile salts for S. Enteritidis and other culturable (aerobic) micro-organisms. We calculated the MIC of bile salts for S. Enteritidis from 0.4 OD culture to be 30% (data not shown). Therefore, we took a Bile salt concentration of 15% for our experiment. Pick one bacterial colony from the bacterial LB agar plates with sterile 200 µl micro-tips.Inoculate the bacterial strains (one colony each) in 5 ml of LB medium in culture test tubes (see Recipes).Culture the strains overnight (12-16) h at 37°C and 150 rpm.Sub-culture from the overnight bacterial culture in sterile conical flasks containing 100 ml LB medium at 1:100 ratio (1 ml of overnight bacterial culture into 100 ml of LB medium) at 37°C and 150 rpm.Monitor the O.D.600 of strains intermittently, until an O.D.600 of 0.4 (early log phase) is reached. At this point, collect 100 µl of culture.",
    "Serially dilute the culture in 1× PBS at 10-1, 10-2, 10-3, 10-4, and 10-5 dilution (Mix 100 µl culture+ 900 µl 1× PBS). Plate 50µl of each dilution onto LB agar plate containing Streptomycin (50 µg/ml). This will serve as the reference CFU of culture before treatment with bile stress (control, 0 h time point).Collect 1 ml of log-phase culture for each strain in three individual 2 ml micro-centrifuge tubes. Add Bile salts to a final concentration of 15% from the 30% bile salts stock solution [1 ml of bile salts (30%) + 1 ml of bacterial culture].Incubate the strains at 37°C for 1 h, 2 h, 3 h, and 4 h following treatment with bile salts.Note: You can collect for longer time points. The time of analysis is subjected to the survival of your bacterial strain post-exposure to stress. Serially dilute the cultures following treatment at the indicated time points with 1× PBS at 10-1, 10-2, 10-3, 10-4, and 10-5 dilution (100 µl culture+ 900 µl 1× PBS). Plate 50µl of each dilution onto LB agar plate containing Streptomycin (50 µg/ml).Place the LB agar plate containing Streptomycin (50 µg/ml) on the turntable. Spread plate 50 µl of each dilution onto the LB agar plates with a sterile cell spreader. Label the bottom of each LB agar plate with the organism name, time following treatment with stress, and the dilution factor.Incubate the plates at 37°C overnight to recover the surviving bacterial colonies.Estimation of bacterial survival following stress treatments by of CFU/ ml calculationThe next day after the stress assay, you should have isolated colonies for each bacterial strain and the control strain (surviving colonies) on the LB agar plates at an appropriate dilution factorCount the number of colonies using a Hand Tally Counter (Humboldt).",
    "Digital counters or image-based counters can also be used.Make an entry of the number of colonies recovered before and after treatment with stress in an excel sheet. Save the raw data for each technical replicate and biological replicate of the experiment.The number of surviving bacteria is calculated as described below.If “X\" is the number of bacterial colonies obtained on an LB agar plate at the dilution factor “Y” after plating 50 µl on an LB agar plate, thenCFU per 50 µl = X * 10Y CFU per 1 µl= X * 10Y/ 50 µlCFU per ml = (X * 10Y/ 50 µl) * 1000 µl                     = (20 * X * 10Y) CFU/mlNote: For a representative image, please see Figure 1B (Glucose starvation assay), 1C (Mg2+ starvation assay), and 1D (Bile stress assay) from Arunima et al. (2020a)."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}