{
  "id": 4368,
  "origin_website": "Bio",
  "title": "Extraction and Measurement the Activities of Cytosolic Phosphoenolpyruvate Carboxykinase (PEPCK) and Plastidic NADP-dependent Malic Enzyme (ME) on Tomato (<em>Solanum lycopersicum</em>)",
  "procedures": [
    "Extraction for measuring PEPCK activity This protocol applies to extraction of PEPCKs from plant tissues.   Collect the sample and freeze immediately in liquid N2. Store at -80 °C until use.   Add small amount of liquid N2 and frozen sample into a mortar. Grind the tissue until the sample is a fine powder. Carefully add more liquid N2 if needed to keep frozen.   Weight 500 mg of tissue into microfuge tube and add 900 µl of extraction buffer 1 (EB1) (for fruit tissue the ratio of powered tissue/EB is 1:1.8, w/v. This ratio may need to be increased to 1:3 for leaf tissue).   Keep on ice while preparing all samples and vortex for 30 sec.   Centrifuge 15 min at 4 °C and 13,000 x g. Remove 500 µl supernatant (clarified extract) to a fresh microfuge tube and add 850 µl of extraction buffer 2 (EB2), to give a final concentration of 35% PEG (mix well).   Incubate on ice for 10 min and centrifuge for 20 min at 13,000 x g. The supernatant is discarded.   Re-suspend the pellet in 100 µl of buffer 3 (B3) and keep on ice. Measure immediately PEPCK activity or the aliquots of clarified extracts can be snap frozen in liquid N2 and stored at -80 °C for future use.       PEPCK activity The activity of PEPCK is measured in carboxylation direction by following oxidation of NADH at 340 nm at 25 °C. Briefly, a continuous assay is used in which OAA produced by PEPCK is immediately reduced to malate, and this is achieved by the inclusion of malate dehydrogenase. The oxidation of NADH by malate dehydrogenase is measured at 340 nm using a spectrophotometer.   Accurately pipette 2-10 µl of clarified extract into a microplate well.",
    "Use repeat pipetor to add 150 µl PEPCK assay mix 1 to each well and immediately place in microplate spectrophotometer. Continuously monitor NADH oxidation to NAD+ as a decline in absorbance at 340 nm (A340), taking readings every 5-10 sec for up to 5 min (the samples need to shake while reading).   Correct for background NADH oxidation by omitting PEP from the reaction mixture. Ensure that the decline in A340 (amount of NADH being oxidized; ε340 = 6,220/M/cm) is proportional to assay time and concentration of enzyme assayed. Dilution of clarified extract in extraction buffer may be necessary for samples containing abundant PEPCK activity.  Note: One international unit (U) of enzyme activity is defined as the amount of enzyme resulting in the production of 1 µmol of product per min at 25 °C. PEPCK activity in (U/ml clarified extract) = (ΔA340/min x clarified extract dilution factor)/6.22. Thus, if 3.0 μl of clarified extract mixed with 150 μl of PEPCK reaction mixture yields a ΔA340/min of 0.2 at 340 nm, then the PEPCK activity = (0.2 x 50)/6.22 U/ml = 1.6 U/ml.      Extraction for measuring NADP-ME activity This protocol applies to extraction of NADP-MEs from plant tissues.   Collect the sample and freeze immediately in liquid N2. Store at -80 °C until use.   Add small amount of liquid N2 and frozen sample into a mortar. Grind the tissue until the sample is a fine powder. Carefully add more liquid N2 if needed to keep frozen.   Weight 100 mg of tissue into microfuge tube and add 200 µl of extraction buffer 4 (EB4) (for fruit tissue the ratio of powered tissue/EB is 1:2, w/v. This ratio may need to be increased to 1:3 for leaf tissue).   Keep on ice while preparing all samples and vortex for 30 sec.",
    "Centrifuge 10 min at 4 °C and 13,000 x g. Transfer the supernatant to a fresh microfuge tube. Measure NADP-ME activity immediately or the aliquots of clarified extracts can be snap frozen in liquid N2 and stored at -80 °C for future use.       NADP-ME activity The activity of NADP-ME is based upon the reduction of NADP+ at 340 nm at 25 °C. Briefly, a continuous assay is used in which malate is oxidized to pyruvate and CO2, and NADP+ is reduced to NADPH. The reduction of NADP+ by NADP-ME is measured at 340 nm using a spectrophotometer.   Accurately pipette 5-10 µl of clarified extract into a microplate well.   Use repeat pipetor to add 100 µl NADP-ME assay mix 1 to each well and immediately place in microplate spectrophotometer. Continuously monitor NADP+ reduction to NADPH as an increase in absorbance at 340 nm (A340), taking readings every 5-10 sec for up to 5 min (the samples need to shake while reading).   Correct for background NADP+ reduction by omitting L-malate from the reaction mixture. Ensure that the increase in A340 is proportional to assay time and concentration of enzyme assayed. Dilution of clarified extract in extraction buffer may be necessary for samples containing abundant NADP-ME activity.  Note: One international unit (U) of enzyme activity is defined as the amount of enzyme that catalyzes the formation of 1 µmol of NADPH/min under the specified conditions. NADP-ME activity in (U/ml clarified extract) = (ΔA340/min x clarified extract dilution factor)/6.22. Thus, if 2.0 μl of clarified extract mixed with 100 μl of NADP-ME reaction mixture yields a ΔA340/min of 1.5 at 340 nm, then the NADP-ME activity = (1.5 x 50)/6.22 U/ml = 12.5 U/ml.",
    "Bradford assay of protein concentration   For preparing the BSA standard curve: Make 1 ml stock solution of 10 mg BSA/200 ml phosphate buffered saline (PBS) (pH 7.4) and prepare a duplicate standard curve, using template below:  table:",
    "﻿0,1,2,3\nFinal concentration (ng/µl),Vol. (µl) BSA stock (0.05 mg/ml),PBS (µl),µg protein/well\n0,0,200,0\n6.25,25,175,1.25\n12.5,50,150,2.5\n18.7,75,125,3.75\n25.0,100,100,5\n    Pipette 50 µl of aliquot supernatants (or its dilutions) or BSA standards to each well.   Add 130 µl Bradford stock solution (see Materials and Reagents section) previously dissolved in distillate water (dilution 1/5).   Shake briefly and wait 5 min. Determinate the OD at 595 nm. Use slope and blank obtained from the calibration to determinate the protein concentration in each extracts."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}