{
  "id": 8817,
  "origin_website": "Jove",
  "title": "An Improved Method for Collection of Cerebrospinal Fluid from Anesthetized Mice",
  "procedures": [
    "All animal experiments were performed in accordance with the policies of the Society for Neuroscience (USA) and Fudan University (Shanghai, China) ethical committees. This procedure is for a non-survival surgery.\n1. Setup of CSF Collection Apparatus\nPull the glass capillary (inner diameter 0.75 mm, outer diameter 1.0 mm) using a micropipette puller (as shown in Liu et al.10; sharpened capillary is shown in Figure 1).\nPlace a sharpened glass capillary into the capillary holder firmly mounted on a micromanipulator (Figure 1A).\nBreak the tip of the sharpened capillary with straight forceps under a dissecting microscope, so that the inner diameter of the broken tip is about 10-20 µm (Figure 1C).\nAttach a thin tube and a syringe to the other end of the capillary holder, and connect the thin tube and the syringe with a three-way valve.\nShift the three-way valve to open and plunge the syringe to blow air from the syringe through the tubing to the glass capillary to expel any contaminants and create positive pressure in the capillary tube.\nRepeat this a few times by dis-connecting and re-connecting the syringe to the three-way valve, and drawing the syringe up ~ 100-200 µL before the last re-connection of the syringe with the three-way valve (Figure 1B).\nMove the micromanipulator with the glass capillary to the side to prevent damage during mouse dissection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56774/56774fig1.jpg",
    "Figure 1. Microscope, micromanipulator, and capillary setup. (A) Microscope and micromanipulator with capillary attached setup, as well as a closer image of (B) the connected syringe and three-way valve to open (shown here) or close the piping, and (C) an unbroken (right) and broken (left) capillary tip ready for CSF collection. Once broken, the tip of the capillary should have an inner diameter of 0.75 mm, outer diameter of 1.0 mm. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56774/56774fig1large.jpg]\n2. Mouse Dissection\nAnesthetize the mouse.\n\tNOTE: For this protocol, C57BL/6 and amyloid precursor protein/presenilin 1 (APP/PS1) transgenic (Alzheimer's disease mouse model) mice were used and anesthetized with 4% chloral hydrate (in dH20) at 10 µL/g of mouse weight via intraperitoneal injection.\nWhen fully anesthetized, ensure that the mouse is adequately anesthetized. The withdrawal response to toe pinch, by slightly extending the hind limbs and pinching the toes and watching for a withdrawal response, is performed to assure adequate anesthesia. Check by pinching all four limbs; if there is no reaction the mouse is properly anesthetized. Cut and trim the hair at the back of the head of the mouse from above the eyes, between the ears to the bottom of the neck using dissecting scissors (Figure 2A). Alternatively, clippers or depilatory cream can be used to aid in hair removal.\nSecure the head of the mouse using a mouse adapter (back of the head facing up with the nose pointed down at ~ 45 °, Figure 2A). Fix ear bars between the ears and eyes of the mouse and tighten. Make sure the head cannot move and is secured tightly in the adapter by gently pushing down onto the head of the mouse.",
    "Recheck withdrawal response to toe pinch prior to making surgical incision and regularly thereafter to assure surgical plane of anesthesia. Visually note any change in respiratory rate during the procedure to indicate changes in planes of anesthesia. A clean, non-aseptic, technique can be used for this short non-survival surgery. Using scissors and curved forceps, cut through the skin and the first layer of muscle until the base of the skull is exposed with only a thin layer of muscle.\n\tNOTE: Cut through the mouse skin across the back of the neck and then cut the skin down the middle of the skull between the ears and eyes of the mouse. Skin and tissue can then be pulled apart and out of the area over the cisterna magna.\nWhile viewing through the dissecting microscope, carefully dissect away the last thin layers of muscle over the base of the skull using forceps and move these layers of muscle to the side and out of the area of interest. If there is bleeding, use cotton buds to remove and help stop the bleeding.\nOnce the dura over the cisterna magna is exposed (triangular in shape with usually 1-2 large blood vessels running through the area; either side of or between the blood vessels is optimal for capillary insertion and CSF collection, Figure 2B), use a wet cotton bud to wipe the membrane clean and then use a dry cotton bud to dry the area.\nimgsrc://cloudfront.jove.com/files/ftp_upload/56774/56774fig2.jpg",
    "Figure 2. Mouse and dissection setup with representative images of capillary insertion for CSF collection. Setup of mouse ready for CSF extraction with (A) shaved head clamped in place for dissection and (B) detailed image (10x view) of a dissected mouse dura covering the cisterna magna (dashed arrow shows a blood vessel running through the area and solid arrow shows area optimal for capillary insertion). Detailed images (10x view) of (C) sharpened tip of glass capillary aligned against dura of cisterna magna, (D) the point at which the capillary almost punctures the dura, with some resistance from dura, and (E) the capillary tip tapped through the dura to collect CSF. CSF should be a clear liquid collected in the glass capillary (dotted arrow). All scale bars at the bottom right of each microscope image indicate 100 µm. Please click here to view a larger version of this figure.[href=https://www.jove.com//cloudfront.jove.com/files/ftp_upload/56774/56774fig2large.jpg]\n3. CSF Collection from Anesthetized Mouse\nAlign the glass capillary to the back of the mouse head so that the sharpened point is just behind the membrane at a ~ 30-45 ° angle (Figure 2C).\nPlunge the syringe once or a few times and draw the syringe up ~ 100-200 µL (to make sure there are no contaminants and there is negative pressure in the glass capillary).\nUsing the micromanipulator, move the capillary tip closer to the membrane until resistance can be seen, but not puncturing it (Figure 2D).\nOnce resistance is seen between the tip of the capillary and the membrane, gently tap the capillary tube through the membrane by knocking on the micromanipulator controls. Use the microscope to see the sharpened point of the capillary puncture into the cisterna magna. CSF should automatically be drawn into the capillary tube once the opening has been punctured (Figure 2E).",
    "Leave the capillary to slowly collect CSF. If the CSF has stopped drawing out, draw the syringe up a small amount slowly (~ 50 µL) to create more negative pressure in the capillary to extract out the CSF.\n\tNOTE: Alternatively, the capillary can be gently and slowly pulled out of the brain using the fine micromanipulator controls to allow CSF to flow into the capillary again. A total amount of ~ 10-15 µL of CSF (~ 3-4 cm in the capillary) takes ~ 10-30 min, and occasionally 20 µL or more can be collected. Although not absolutely necessary, it is recommended to use a heat pad during CSF collection. CSF collection was performed at room temperature (~ 23 °C).\nOnce the amount of desired CSF is collected, close the tubing by shifting the three-way valve to close (to stop drawing out the CSF).\nTake out the syringe connected to the tubing, and open and then close the tubing (to create equalized pressure in the capillary, tubing, and the area outside the capillary). Reconnect the syringe with the three-way valve, but do not plunge the syringe.\nGently remove the glass capillary from the mouse using the micromanipulator.\nPlace the collection tube (1.5 mL microtubes with 1 µL of 20x protease inhibitor) under the sharpened point of the glass capillary.\nOpen the tubing and gently plunge the syringe: the CSF should flow out of the capillary and into the collection tube.\nAfter collection, quickly centrifuge (pulse spin for 5 s at maximal speed using a mini centrifuge) the CSF to mix the sample with the protease inhibitor at the bottom of the collection tube.",
    "NOTE: CSF samples can be aliquoted and then stored for further analysis at -80 °C. The rest of the mouse can be dissected for other tissues, such as brain and spinal cord. The mouse is still alive at this stage and thus blood can also be collected, if needed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}