{
  "id": 18094,
  "origin_website": "Jove",
  "title": "Intestinal Stem Cell Isolation and Culture in a Porcine Model of Segmental Small Intestinal Ischemia",
  "procedures": [
    "For these experiments, all animal studies were approved by the Institutional Animal Care and Use Committee (IACUC) of North Carolina State University.\n1. Preparation for Culture\nNOTE: All reagents are listed in the Table of Materials. Specific growth factor concentrations are listed in Table 1.\nPrepare a 0.5 M ethylenediaminetetraacetic acid (EDTA) solution in distilled deionized water (ddH2O). Mix adequately and adjust the pH to 7.4 using NaOH and/or HCl solutions.\n\tNOTE: Make up EDTA stock solution fresh before each experiment.\nPrepare dissociation reagent #1 (DR #1) as follows and place on ice: Combine phosphate buffered saline without Ca2+ and Mg2+ (PBS), 0.5 M EDTA, 1M 1,4-Dithiothreitol (DTT), 10 µM Y27632 and 1X Antibiotic-Antimycotic solution (Anti-Anti) containing penicillin, streptomycin and amphotericin B.\n\tNOTE: Add Y27632 immediately prior to tissue collection.\nPrepare dissociation reagent #2 (DR #2) as follows and place in a 37 °C water bath: Combine PBS without Ca2+ and Mg2+, 0.5 M EDTA, 10 µM Y27632 and 1X Anti-Anti. NOTE: Add Y27632 immediately prior to tissue collection.\nPrepare intestinal epithelial stem cell (IESC) media as follows: Mix 25 mL advanced DMEM/F12 medium with 1X N2 supplement, 1X B-27 supplement, 10mM HEPES, 2mM Glutamax and 1X Anti-Anti. Store at 4 °C until use.",
    "Prepare a master mix of reduced growth factor basement membrane matrix (matrix) and supplemental growth factors as follows: Thaw the matrix on ice. In a microcentrifuge tube, add 100 ng/mL recombinant human Noggin, 500 ng/mL recombinant human R-Spondin 1, 50 ng/mL recombinant human epidermal growth factor (EGF), 100 ng/mL recombinant human Wnt3a, 10 mM Nicotinamide, 10 nM gastrin, 500 nM A-83-01, 10 µM Y-27632, 10 mM SB202190, 500 nM LY2157299 and 2.5 µM glycogen synthase kinase 3 inhibitor (GSK3i, CHIR99021). When the matrix is thawed, supplement with the growth factor mix (making master mix) and store on ice.\n\tNOTE: Be careful to avoid introducing air bubbles as this will create artifact within the matrix patty during plating.\nPre-warm a 24-well tissue culture dish in a 37°C incubator prior to starting cell isolation procedures.\n2. Surgical Model of Ischemia and Tissue Collection\nUse eight to ten-week-old Yorkshire crossbred pigs of either sex (recommended). Remove all feed 16-18 h prior to surgery. Allow pigs access to water at all times.\nSchedule the pigs to arrive at least 48 h before the experiments to allow for environmental acclimation.\n\tNOTE: Trained veterinary and/or laboratory technicians supervised by a licensed veterinarian provide routine animal care and assistance with anesthetic procedures.\nPremedicate the pig with xylazine (1.5 mg/kg intramuscularly (IM)) and ketamine (11-20 mg/kg (IM))15. Once sedate, intubate the pig orotracheally.\nMaintain pigs under general anesthesia with isoflurane (2-5%) vaporized in 100% O2 until the time of euthanasia.\nPlace an intravenous (IV) catheter (ear vein recommended) and administer a replacement fluid such as lactated ringers solution at a maintenance rate of 15 mL/kg/h.",
    "Perform routine anesthetic monitoring including pulse oximetry, electrocardiography and indirect blood pressure measurements15. Monitor the pig’s respiratory rate and effort and ventilate manually or mechanically as needed if end tidal CO2 rises above 55-60 mmHg.\n\tNOTE: Appropriate anesthesia is confirmed by continual monitoring of trends in heart rate (range 80-130 beats/min), non-invasive blood pressure (mean arterial pressure 75-100 mmHg), and respiratory rate (10-25 breaths/min)16, and periodic checking for absence of jaw and anal tone. Depth of anesthesia can also be judged by degree of muscle relaxation and muscle fasciculation following surgical stimulus. Ocular reflexes are usually of no value16. Analgesia can be provided as directed by the institutions IACUC policy. In this case, an opioid, such as buprenorphine, can be administered during surgery. \nPlace the pig on a heating pad and restrain in dorsal recumbency for the surgical procedure.\nShave the ventral abdomen and prep using surgical scrub (chlorhexidine solution) and isopropyl alcohol.\nMake an 8-10-cm ventral midline incision using a scalpel blade centered at the umbilicus to access the abdomen.\nIdentify the small intestine (jejunum) approximately 40 cm oral to the ileocecal junction. Delineate ten-cm long loops of jejunum by circumferentially ligating the bowel twice, one cm between each ligature, prior to creating subsequent loops 10 cm located orally (Figure 1).\nCreate two loops per time point of ischemia adjacent to each other, one for ischemia and one for ischemia with an additional 1h of reperfusion if desired. To create complete ischemia (no flow of either arteries or veins), clamp or ligate the mesenteric vasculature using bulldog vascular clamps, curved Halstead mosquito hemostats, or 2-0 non-absorbable silk for 1, 2, 3, and 4h and then remove clamps for 1h of reperfusion, if desired.",
    "NOTE: The authors created all loops of ischemia in order starting with the 4h ischemic loop and progressed moving proximally (to minimize total surgery time). To address the possibility that neighboring ischemic intestinal segments may damage adjacent loops, the order of the ischemic loops can be varied. This may alter total surgical time.\n\tNOTE: The time frame of reperfusion can be varied based on the research question of interest or if therapies wish to be tested during the reperfusion period. However, as tissue damage becomes more severe from increasing durations of ischemia alone, reperfusion injury likely does not contribute to further epithelial injury. Reperfusion does likely play a role following mild periods of ischemic injury.\nIn between ischemia time points, keep the abdomen covered or closed using a sterile towel and/or a towel clamp.\n\tNOTE: Within a single animal for this experiment, eight ischemic segments can be created. Identify an additional jejunal segment, at least 5-10 cm proximal to the last ischemic loop, that will serve as an internal normal control.\nObstruct approximately three mesenteric vessels per bulldog vascular clamp or curved Halstead mosquito hemostat. Care must be taken during hemostat application because the vessels are easily traumatized. Try to stack the vessels within the jaws of the clamps.\nAt the end of the experiment, following euthanasia with pentobarbital 85-100 mg/kg IV, collect all loops of tissue using metzenbaum scissors, after death has been confirmed with no heartbeat auscultated and loss of the corneal reflex. Start by collecting a control piece of normal jejunum at least 5- 10 cm proximal to the last ischemic loop.\nSeparate and store the loops from each injury time point in small containers of ice cold PBS until ready for crypt isolation.",
    "NOTE: If desired, make ischemic loops long enough to divide into separate samples for histology and intestinal stem cell culture; however, the authors have found that loops greater than approximately 10 cm long are most likely to become hemorrhagic.\n3. Crypt (Stem Cell) Isolation from Ischemic and Control Loops\nInvert each loop of small intestine using a 20-gauge wire and tissue forceps to expose the mucosal surface. Tie the top and bottom of the loop securely to the wire using suture (2-0 non-absorbable silk or equivalent).\nFollowing inversion, rinse each loop in ice cold PBS to remove luminal debris.\nPlace samples immediately into 50 mL conical tubes containing DR #1 on ice for 30 min.\nCollect loops beginning with control and follow with loops of incrementally increasing durations of ischemia. Loops from less damaged tissue (i.e. control and 1 h ischemic tissue) can be shaken forcefully, snapping the wrist for best results. Tissues from severely damaged tissue (3 and 4 h of ischemia) should be gently rocked or inverted only as too much shaking will cause crypt disruption and additional tissue destruction. Tubes should be shaken or inverted every 5 min while on ice.\nTransfer samples into DR #2 for 10 min in a 37°C water bath. Shake or invert tubes every 5 min.\nAfter transferring the tissues, centrifuge the conical tubes containing DR #1 from the 2-4 h damaged loops to remove the EDTA supernatant (200 x g for 5 min). As these tissues are highly damaged it is possible the crypts have already become dissociated. Remove supernatant and resuspend pellet with a small volume of PBS (5 mL) and proceed to step 3.9.",
    "Remove samples from DR #2 and place tissue samples directly into 25 mL of cold PBS on ice (label as Wash #1). Place the samples on an orbital shaker on ice at 60 rpm. Continue to shake or invert each tube for 30 s every 2 to 5 min.\nAfter transferring the tissues, spin the conical tubes containing DR #2 from the 2-4 h damaged loops to remove the EDTA supernatant (200 x g for 5 min). As these tissues are highly damaged it is possible that the crypts have become dissociated. Remove supernatant and resuspend pellet with a small volume of PBS (5 mL) and proceed to step 3.9.\nRemove a 50 µL aliquot from Wash #1 (or from the DR) to check for the degree of crypt dissociation and amount of debris. Place tissue into a new 50 mL conical tube (Wash #2, #3, etc.) filled with 25 mL of cold PBS and shake until intact crypts are isolated with minimal debris and villi.\n\tNOTE: The goal is to be able to isolate a clean fraction with intact crypts and minimal debris. Each additional wash will clean the cells however too much shaking will begin to result in secondary tissue/cell damage. Furthermore, the best results with least contamination will be achieved if crypts are plated from a wash step and not from a dissociation reagent step.\nRemove the remaining tissue and centrifuge the 50 mL conical tubes at 200 x g for 5 minutes to remove supernatant, then resuspend remaining the crypt pellet in smaller volume of PBS (5 mL).\nUsing an inverted microscope, examine 50 µL aliquots of each sample to determine number of crypts/fraction. The goal is 50-100 crypts/50 µL, as this will be the size of the final matrix patty.",
    "NOTE: If the sample is too concentrated, continue to add cold PBS until desired concentration is reached. If sample is too dilute, determine number of aliquots needed to reach desired crypt yield and adjust.\nAliquot appropriate volume(s) of crypts (determined by aliquot observations) into a microcentrifuge tube. For example, if sample contains 50 crypts/50 µL then aliquot 50 µL per patty X 3 replicates = 150 µL/ microcentrifuge tube. If the sample only contains 25 crypts/50 µL then 2 aliquots needed/patty X 3 replicates= 300 µL/tube.\nPellet crypts at 200 x g for 5 min at 4°C.\nGently resuspend pelleted crypts with appropriate volume of master mix (50 µL per well). Mix thoroughly by rapidly pipetting 15 times without creating air bubbles.\n\tNOTE: Pre-cool the pipette tip with cold sterile PBS prior to aspirating the master mix. This will help keep the master mix from spreading out. Tips can also be kept in the refrigerator and placed in the hood immediately prior to use.\nDispense a 50 µL master mix plus crypt droplet into center of each well of a pre-warmed 24 well plate.\nIncubate the culture plate for 30 min at 37 °C.\nOverlay each matrix patty with 500 µL/ well of IESC media (no additional growth factors needed on day 0 as they are contained within the master mix).\nAdd 500 µL sterile PBS to any unused wells left on the plate to maintain humidity.\nCount number of plated crypts on Day 0.\n\tNOTE: It is helpful to pre-grid each cell culture plate into quadrants to help ensure more accurate counting.\nCount number of enterospheres every 24 h and monitor for enteroid development daily.",
    "Add growth factors to each well every 48 h. Remove the IESC media every 96 h and replace with 500 µL fresh media (growth factors must then be added to media)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}