{
  "id": 5053,
  "origin_website": "Bio",
  "title": "Hemagglutination Inhibition (HI) Assay of Influenza Viruses with Monoclonal Antibodies",
  "procedures": [
    "Preparation of erythrocytesPrepare the diluted RBC for washing step: 5 ml of RBC + 45 ml of 1x PBS (room temperature).Washing step (just one time): Centrifuge the diluted RBC, 2,000 x g, 10 min, 25 °C.Discard supernatant and then suspend the RBC pellet with 20 ml (initial volume) of 1x PBS.1:100 dilution (0.5 ml of RBC suspension from step A3 + 49.5 ml of 1x PBS).Transfer 10 μl of RBC from step d onto a hemocytometer and count the RBC in each of the 4 squares to calculate the final volume of RBC.Calculate the final volume of RBC by formula below (Manual for the Laboratory Diagnosis and Virological Surveillance of Influenza, WHO).Formula Final volume = total number of cells counted X initial volume /160Example of calculation Initial volume =20Total number of RBC = 320Final volume = 320 x 20/160 (160 is used as constant when use avian red blood cells; Chicken or turkey) = 40 Then, add 20 ml of 1x PBS to 20 ml of RBC to make 40 ml and use it for HI assay.Hemagglutination titration of viral antigen (Serial dilution is described in Figure 1)Add 50 μl of PBS to the V bottom 96 wells in column 2 to 12.Add 100 μl of each antigen to the first wells of rows.Make serial 2-fold dilutions by transferring 50 μl from the first to successive wells of each row using multi-channel pipette.Discard the final 50 μl.Add 50 μl of prepared RBCs to each well.Incubate the plate at room temperature for 30 min to 1 h.Record the HAU results (refer to Example of HAU titers as shown in Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160602/20160602184135_0308.jpgFigure 1. Serial dilution of test sample for HAU titration.",
    "Add 50 μl of PBS to all wells in column 2 to 12 of a v-bottom 96-well plate and then add 100 μl of test sample to the first well of each row. Transfer 50 μl of sample to the next wells using a multi-channel pipette to make a 2-fold dilution. Dilution factor is 1 to 2,048.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160602/20160602184159_1016.jpgFigure 2. Example of HAU titers. Hemagglutinin on the surface of influenza virus binds to the sialic acid receptors of red blood cells and creates a lattice structure. The agglutinated lattice maintains the red blood cells in a suspended and shows as a reddish solution.  HAU titer is the dilution factor of the last well showing reddish solution. HAU titer of sample 1 to sample 8 is 16, 8, 32, 32, 32, 16, 32 and 64.Preparation of standardized antigen for HI testPrepare 4 hemagglutination units (HAU) of antigen by dilution of antigen.Example of dilution: If antigen HAU is 16, 4 fold dilution with 1x PBS for 4 HAU.Hemagglutination inhibition (HI) test (Serial dilution is described in Figure 3)Add 25 μl of PBS to the V bottom 96 wells in column 2 to 12. Add 50 μl of the antibody (diluted with PBS, 1:10) to the well in row A1 to H1.Transfer 25 μl of the antibody from column 1 to 12 for 2 fold serial dilution.Add 25 μl of standardized antigen to all wells of plates.Mix the plates using a laboratory shaker for 10 sec or by manually agitating the plates thoroughly.Cover the plates and incubate at room temperature for 30 min. Add 50 μl of prepared RBC to all wells and incubate at room temperature for 30 min.Observe the hemagglutination inhibition. If sample inhibits hemagglutination, RBCs appear as a dot by sink to bottom of well.",
    "Record the results by refering to Example of HI titers as shown in Figure 4.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160602/20160602184229_0381.jpgFigure 3. Serial dilution of test sample for HI assay. Add 25 μl of PBS to all wells in column 2 to 12 of a V-bottom 96-well plate and then add 50 μl of test sample (pre diluted 1:10) to the first well of each row. Transfer 25 μl of sample to the next wells using a multi-channel pipette to make a 2-fold dilution. Dilution factor is 10 to 20,480. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160602/20160602184250_1917.jpgFigure 4. Example of HI titers. If antibodies bind to the viral particles, the influenza virus is effectively blocked from causing hemagglutination. The HI titer value is the last dilution factor of antibody showing completely inhibited hemagglutination. HI titer of sample 1 to sample 8 is 160, 80, 80, 320, 80, 160, 80 and 80."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}