{
  "id": 17853,
  "origin_website": "Jove",
  "title": "Technical Detail for Robot Assisted Pancreaticoduodenectomy",
  "procedures": [
    "This protocol follows the guidelines of the University of Pittsburg Medical Center human research ethics comittee (Institutional Review Board: PRO15040497)\n1. Preoperative workup and selection\nCheck the triphasic CT scan (i.e., chest, abdomen, and pelvis with the primary imaging modality) to evaluate the extent of disease, rule out metastasis, and delineate aberrant or anomalous arterial vasculature. \nPerform EUS and endoscopic retrograde cholangiopancreatography (ERCP) for the tissue diagnosis and biliary decompression, especially in the setting of the planned neoadjuvant chemotherapy for pancreatic cancer.\nCheck for the relative contraindications for RPD, including tumor involvement of the portal vein or SMV that necessitates a vascular resection and reconstruction, previous upper gastrointestinal reconstruction (e.g., gastric bypass), extensive adhesions, and BMI > 40.\n2. Anesthesia\nConsider all patients for the institutional enhanced recovery pathway after the surgery (ERAS) with multimodal analgesia, including regional nerve blockade or intrathecal morphine, gabapentin, nonsteroidal analgesia, minimization of narcotic administration, and intraoperative goal-directed fluid resuscitation13.\nPerform deep venous thrombosis prophylaxis with a subcutaneous unfractionated heparin 5000 U injection and pneumatic placement of sequential compression devices prior to the induction. Place an arterial line (central lines are not routinely placed).\nAdminister preoperative antibiotics, typically with 4.5 g piperacillin/tazobactam, or 1–2 g ceftriaxone and 500 mg metronidazole, or 150 mg clindamycin and 500 mg metronidazole, 1 h prior to incision. \nPlace oral gastric tube following intubation and remove after the case.\n3. Patient positioning\nPosition the patient in a supine position on a split-leg table with the right arm tucked and secured to the table with pressure points padded (Figure 2).\nTurn the operating table approximately 45˚ counterclockwise from anesthesia to accommodate the docking of the Si robot. Dock the Xi robot from the side, as this does not require the turning of the table.\n4. Placement of ports and liver retractor",
    "Establish the access to the intraabdominal cavity by utilizing a 5 mm optical separator trocar in the left upper quadrant, midclavicular line, one hand’s breadth to the left of the umbilicus. Advance the laparoscope into the abdominal cavity and perform a full inspection to rule out any peritoneal or visceral metastasis.     \nUpsize this trocar to an 8 mm robotic cannula (Arm 1 or A1). \n\t\nPlace the remaining ports as depicted in Figure 3. Place two 8 mm robotic ports in the right upper abdomen: place arm 2 (A2) in the midclavicular line, place arm 3 (A3) in the subcoastal anterior axillary line.\nPlace a 12 mm camera port approximately 2 cm above and to the right of the umbilicus.\nPlace a 12 mm laparoscopic assistant port in the left lower quadrant/midclavicular line, one hand’s breadth lower than the upper robotic ports and between A1 and the camera port.\nPlace a 5 mm laparoscopic assistant port is placed in the right lower quadrant, one hand’s breadth lower than the upper robotic ports and between A2 and the camera port.\nFinally, place a 5 mm laparoscopic port for a liver retractor in the left anterior axillary line. Place the liver retractor to the leftmost lateral port. Ensure that the liver retractor is able to retract the gall bladder and lifts the liver superiorly during the entirety of the resection period.\nPlace the patient in a steep reverse Trendelenburg position and dock the robot.\n5. Resection phase\nThe robotic instruments \nEnsure that A1 is equipped with hook cautery.\nEnsure A2 is equipped with fenestrated bipolar forceps.\nEnsure A3 is equipped with bowel grasping forceps (robotic instrument catalog number 470049).",
    "NOTE: The bedside assistant (two lower assistant ports) utilizes any combination of laparoscopic atraumatic grasper, laparoscopic suction irrigator, and laparoscopic blunt tip vessel sealing device.\nEntrance into the lesser sac and mobilization of the right colon\nGrasp the anterior stomach and retract anteriorly and cephalad with A3. \nGain access into the lesser sac through the greater omentum below the gastroepiploic pedicle using A1 and A2. The assistant provides a gentle caudal counter-retraction.\nCarry out the dissection along the greater curvature towards the pylorus. Ensure that the right colon flexure is fully mobilized off the duodenum.\nPreserve the gastroepiploic pedicle and do not transect it at this point.\nKocherization of the duodenum and dissection of the ligament of Treitz (LOT)\nGrasp the lateral fibers of the duodenum with A2 and transect with A1. The bedside assistant provides gentle medial counter-retraction of the duodenum.\nCarry out the mobilization of the duodenum including its 3rd and 4th portions to the LOT. \n\t\tNOTE: Dynamic anterior and cranial retraction of the duodenum with A3 is key to an excellent exposure of the LOT. Extensive kocherization allows for the full visualization of the inferior vena cava, insertion of the left renal vein, and aorta.\nPerform the complete release of LOT with A1 to allow for the exposure of the proximal jejunum.\nExtract the proximal jejunum through the LOT defect into the right supracolic upper quadrant (creation of the neoduodenum for the reconstruction phase). \nTransection of the proximal jejunum\nMeasure the jejunum approximately 10 cm distal to the LOT.\nTransect the jejunum 10 cm distal to the duodenojejunal junction using a 60 mm curved tip vascular linear stapler.\nLinearization of the duodenum\nDivide the mesentery of the proximal jejunum by a sequential ligation with a blunt tip vessel-sealing device up to the uncinate process.",
    "Take extreme care during this dissection because hemorrhage from the branches of the SMV can occur due to the lateral traction of the duodenum.\nTransection of the distal stomach\nTake care to not injure an aberrant or accessory left hepatic artery if present. While A1 and A2 are utilized for the dissection, use A3 to further retract the liver anteriorly.\n\t\tNOTE: A3 releases the duodenum and stretches the pars flaccida underneath. The lesser sac is accessed superiorly through the pars flaccida.\nMark the stomach with a 60 mm thick linear stapler 5 cm proximal to the pylorus to perform the classic PD.\nLigate the right gastroepiploic vessels (RGEV) with the blunt tip vessel-sealing device at the corresponding area of the greater curvature. Transect the stomatch utilizing a thick linear stapler.\nDissection and transection of right gastric vessels\nLigate the right gastric artery (RGA) with laparoscopic titanium vascular 10 mm clips close to where it branches off from the proper hepatic artery.\nTransect the RGA with the blunt tip of the vessel sealing device at the lesser curvature 5 cm proximal to the pylorus.\nDissection and excision of common hepatic artery lymph node \nUse A3 to grasp the distal gastric staple line and retract the specimen laterally and inferiorly, putting the common hepatic artery (CHA) and the porta hepatis under tension. Continue the dissection through the superior border of the pancreas and into the porta hepatis. Use the energy function of both A1 and A2 to completely dissect the CHA, gastroduodenal artery (GDA), and RGA.\nExcise the CHA lymph node, which allows complete exposure of the CHA. Retrieve it with a 10 mm laparoscopic specimen retrieval bag and send the specimen for permanent pathologic analysis. This allows for the full visualization of the GDA.\nDissection and transection of GDA",
    "Identify the GDA where it branches off from the CHA. Utilize the robotic hook to fully circumferentially dissect the GDA.\nPass a vessel loop around the GDA. A test clamp may be used with confirmation of flow using visualization from a robotic ultrasound (US) probe. Transect the GDA with a vascular stapler. The proximal stump is reinforced with laparoscopic titanium vascular 10 mm clips.\nNow identify the portal vein (PV) above the neck of the pancreas.\nDissection and transection of the common bile duct (CBD)\nDissect the PV for 2–3 cm in a cephalad direction. Identify the plane between the CBD and the PV and develop it posteriorly. Dissect all intervening portal lymph nodes and reflect towards the specimen. \nEncircle the CBD/CHD with a vessel loop. If present, take care not to injure a replaced right hepatic artery behind the CBD/CHD.\nTransect the CBD/CHD with a 60 mm curved tip vascular linear stapler above the level of the biliary stent (if present) to minimize bile spillage and field contamination.\nDissection of SMV and creation of the superior tunnel \nDissect the lateral border of the portal vein using the robotic hook cautery.\nLigate the superior pancreaticoduodenal artery, which is often encountered during this procedure, utilizing the assistance of the blunt tip vessel sealing device. Continue the superior-to-inferior dissection of the portal vein up to the superior border of the pancreas. This dissection allows for the exposure of the superior tunnel.\nDissection of the SMV and creation of the inferior tunnel \nUsing A3, grasp and retract the distal gastric staple line laterally and cephalad to stretch the gastroepiploic vein (GEV) as it enters the anterior SMV. Open the fatty tissue near the pancreatic inferior border using electrocautery in A1. The SMV is now visible.",
    "Identify the gastrocolic trunk (Trunk of Henle). Occasionally, there can be a right branch of the middle colic vein (RBMCV) that drains into the trunk. If present, dissect and transect it with the blunt tip vessel sealing device. Trace the GEV to its insertion into the SMV and transect with the blunt tip vessel sealing device. \nDissect off the SMV from the inferior border of the pancreas and create a retropancreatic neck tunnel between the pancreas and SMV/PV.\nPancreatic parenchymal transection and placement of pancreatic duct (PD) stent\nUsing A3, now retract the specimen laterally to stretch the pancreatic neck. Control the superior and inferior longitudinal pancreatic arteries with the bipolar in A2, thus obviating the need for transfixation sutures.\nTransect the pancreatic neck using monopolar curved scissors in A1 and take care to identify the main duct. The assistant provides anterior lift of the pancreas off the SMV using suction during the parenchymal transection. \nTransect the main PD with monopolar curved scissors without electrocautery. \nPlace a 4–5 Fr pancreatic duct stent into the PD to ensure its identification. Transect the remaining pancreatic parenchyma using an electrocautery.\nDissection and division of the uncinate process \n\tNOTE: This portion of the resection requires slow and meticulous dissection, because significant hemorrhage may occur in absence of operative precision. The key to head and uncinate dissection during this phase is the judicious use of A3, which provides superior and lateral retraction of the specimen.\n\t\nKeep A3 dynamic during the resection and make frequent readjustments to ensure appropriate retraction in an ‘up and out’ orientation, analgous to a surgeon’s left hand in an open PD.\nEnsure that all three layers are dissected while performing the uncinate process dissection.",
    "Transect the first layer using a hook cautery in A1. The first layer consists of filamentous fibers between the SMV/PV and the head/uncinate. This layer is devoid of any major vascular branches.  \nUse a combination of the hook cautery in A1 and the assistant’s blunt tip vessel sealing device for dissection and ligation of the second layer. The second layer consists of the first jejunal vein (coursing lateral then posterior to the SMA), the Vein of Belcher/posterosuperior pancreaticoduodenal vein (entering the PV at the superior portion of the head/uncinate) and small uncinate branches. Preserve the first jejunal vein.\nTransect with a curved tip vascular stapler if it requires ligation due to tumor involvement. Transect the Vein of Belcher with the blunt tip vessel sealing device. Take extreme care during this dissection, because avulsion of any of those vessels will result in significant hemorrhage.\nIdentify the third layer, which is the SMA/retroperitoneal margin. Rotate the SMV/PV medially with the help of an assistant (using the 12 mm right lower quadrant laparscopic port), while continuing to pull the specimen up and out with A3. Visualize the SMA and dissect along the plane of Leriche utilizing the robotic hook in A1 and the assistant’s blunt tip vessel sealing device (in the left lower quadrant 5 mm laparoscopic port). Identify the inferior PDA in this layer and take with the blunt tip vessel sealing device or between clips.  \nFollowing the completion of the uncinate dissection, perform the cholecystectomy.\nSpecimen extraction\nPlace the specimen into a laparoscopic 15 mm specimen extraction pouch through a 4 cm extraction incision in the left midclavicular line.",
    "Place the multi-instrument laparoscopic advanced access gel port through the extraction site and initiate the reconstruction phase. Reinsert a 12 mm laparoscopic port through the gel port to facilitate the passage of sutures for reconstruction.\n6. Reconstruction phase\nMain robotic instruments\nEnsure A1 is armed with a large dual function needle driver with suture scissors. This is frequently switched to monopolar curved scissors to perform an enterotomy/gastrotomy.\nEnsure A2 is equipped with a large needle driver.\nEnsure A3 is equipped with fenestrated bipolar forceps used to grasp the pancreaticobiliary limb and steady it in the right upper quadrant during the pancreaticojejunostomy and hepaticojejunostomy. \nPancreaticojejunostomy (PJ)\nPerform the PJ in a two-layer, end to side, duct to mucosa method, with the modified Blumgart technique. Use A3 to grab the previously placed sutures to provide cranial retraction and exposure. \nPlace 2–0 silk transpancreatic horizontal mattress sutures to secure the pancreas parenchyma to the jejunum. Place three sutures: one above, one below, and one straddling the pancreatic duct. Tie all three sutures, and keep the needles on the sutures. Take care when tying the middle suture, which straddles the main PD, to avoid accidental ductal ligation.  \nUse a 4–5 Fr pancreatic duct stent to interrogate the patency of the duct. Switch A1 to the monopolar scissors that are utilized to perform the enterotomy. Then replace again with the large dual function needle driver with suture scissors. \nUse interrupted 5–0 polydioxanone (PDS) sutures to approximate the jejunal mucosa to the pancreatic duct. Place a minimum of six sutures (two posterior, two lateral, and two anterior). More sutures can be placed if larger ducts are encountered.",
    "Reuse the same three silk needles, previously used for the posterior layer, for the anterior layer of the PJ as well. Place them in a simple fashion in the jejunum and tie these to complete the anastomosis. \nHepaticojejunostomy (HJ)\nPerform the HJ approximately 10 cm distal to the PJ, and in a single layer either in interrupted (5–0 PDS) or running (4–0 barbed sutures) fashion.\nUse A1 with monopolar curved scissors to transect the CBD staple line and to perform the enterotomy. Replace A1 and A2 with a large dual function needle driver with suture scissors and large needle driver, respectively. \nPerform the anastomosis using 5–0 poly(p-dioxanone) sutures in an interrupted fashion for ducts measuring <1 cm. For larger ducts, use two running 4–0 barbed sutures in a single layer, continuous fashion. Place both sutures at the 9 o’clock position and ensure that they run in opposite directions towards the 3 o’clock position. Tie the sutures after the completion of the anastomosis.\nFor interrupted anastomosis, first place and tie the posterior sutures. For ducts measuring <1 cm, employ 4–5 Fr stents to keep the patency of anastomosis. Next, place additional 5–0 PDS sutures to complete the anterior anastomosis. Once all the sutures are in place, tie the sutures and complete the anastomosis.\nGastrojejunostomy (GJ)\n\tNOTE: The GJ is a handsewn, antecolic, end-to-side, isoperistaltic anastomosis.\n\t\nPlace two 3–0 silk marking stitches on the jejunum approximately 40–60 cm distal to the HJ to mark the bowel as proximal and distal, respectively, denoting afferent and efferent limbs of the jejunum. Replace A1 and A2 with bowel grasping forceps #1 and #2 (robotic instrument catalog number 470093 and 470049, respectively). The laparoscopic assistant reflects the omentum and mesocolon cephalad, which allows the surgeon to locate the neoduodenum.",
    "Reduce the distal jejunum and place it back into the infracolic compartment. Identify the two marking stitches, and bring the jejunum in an antecolic, isoperistaltic fashion up to the stomach.\nReplace A1 and A2 with a large dual function needle driver with suture scissors and a large needle driver, respectively. Place an interrupted outer layer with 2–0 silk sutures. Hold the most cephalad suture by A3 and use it as a retraction suture. Replace A1 with monopolar curved scissors. \nTransect 6 cm of the gastric staple line with scissors electrocautery and perform a corresponding jejunal enterotomy. Perform the inner layer using two 3–0 barbed sutures in running Connell fashion. Place the interrupted outer layer, 2–0 silk sutures to complete the second layer. \nDrain placement \nFollowing the completion of the anastomosis, place a 19 Fr round channel drain posterior to the HJ and anterior to the PJ. A falciform ligament flap may be utilized to cover the GDA stump.\nRemove the instruments and liver retractor, and undock the robot. \nClose the fascia and incisions in layers.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}