{
  "id": 2949,
  "origin_website": "Cell",
  "title": "Protocol to characterize Gi/o and Gs protein-coupled receptors in transiently transfected cells using ELISA and cAMP measurements",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1: Cell seeding\nTiming: 1 h\nHarvest the cells from the 75 cm2 cell culture flask and seed them in 25 cm2 cell culture flasks for transfection the following day.\nHarvest the cells from the cell culture flask.\nRemove the medium.\nWash the cells once with sterile D-PBS.\nHarvest the cells by adding trypsin-EDTA to cover the surface (e.g., 1 mL per 75 cm2 flask) and incubate at room temperature (RT, 18°C–24°C) for 2–5 min.\nStop trypsinization by adding the cell culture medium supplemented with 10% FBS and 1% penicillin/ streptomycin (growth medium) to the flask, resuspend the cells and transfer the cell suspension into a 15 mL tube. Use DMEM/ F12 for CHO-K1 cells and DMEM for HEK293-T cells.\nCount cells and check viability following the previously described protocol.9[href=https://www.wicell.org#bib9]\nSeed cells in 25 cm2 flasks: 0.9 × 106 cells for CHO-K1 and 1.6 × 106 for HEK293-T, respectively.\nIncubate in a humidified CO2 (5%) incubator at 37°C overnight (∼16 h).\nNote: Avoid the use of cells that exceed 40 passages, because we observed that thereafter cells may grow faster negatively affecting the transfection efficiency and the assay outcome.\nDay 2: Transient transfection\nTiming: 45 min + 5 h incubation\nTransiently transfect cells in 25 cm2 cell culture flasks to ensure homogenous transfection efficiency. Always include the transfection with an empty vector as a reference. If other transfection procedures/reagents shall be used, optimize transfection by transfecting a plasmid encoding a fluorescent protein (e.g., GFP) and subsequently analyze transfection efficiency, i.e., what percentage of cells is transfected, using a fluorescent microscope.\nEnsure that the cells are 70%–80% confluent on the day of transfection.\nPrepare transfection mix.",
    "In the first tube, add 3 μg (CHO-K1) or 4 μg (HEK293-T) of plasmid DNA, i.e., plasmid encoding for GPCR of interest or empty vector, to a final volume of 500 μL Opti-MEM.\nMix well by inverting.\nDo not vortex because plasmids can linearize or nick due to shear stress.\nIn the second tube, prepare the Lipofectamine 2000 dilution.\nAdd 10 μL Lipofectamine 2000 to 500 μL Opti-MEM per transfected 25 cm2 flask.\nMix by inverting 3–4 times and incubate at RT for 3–5 min.\nAdd the mixture of Opti-MEM and Lipofectamine 2000 (second tube) to the first tube containing Opti-MEM and plasmid DNA.\nMix by inverting 3–4 times. Incubate at RT for 20 min.\nNote: Tubes containing Lipofectamine 2000 (i.e., second tube and final transfection mix) should not be vortexed. Mix by inverting only. The amount of plasmid to be transfected was optimized in our lab for GPCRs cloned in the plasmid pcDps,10[href=https://www.wicell.org#bib10] which contains an SV40 promoter upstream of the gene of interest. We observed the optimal transfection efficiency with the least cell toxicity for the indicated amounts of cells, Lipofectamine 2000 and the amount of plasmid. Transfection reagent manufacturers provide detailed guides for the optimization of transfection. Here, we state what works in our hands.\nAspirate the medium from the 25 cm2 flask cell culture flasks and add 1 mL Opti-MEM per 25 cm2 flask.\nAdd the transfection mix (from step 6h) and incubate at 37°C with 5% CO2 for 4–6 h.\nAfter that incubation time, add 3 mL of growth medium per 25 cm2 flask and leave the cells in a humidified CO2 (5%) incubator at 37°C overnight (∼16 h).\nDay 3: Cell seeding in plates\nTiming: 90 min cell harvest and seeding/ 6 h growing/ 30 min medium change",
    "During this step, harvest the cells from the 25 cm2 flasks and subsequently seed the cells in different plates, depending on the assay that will be performed: for cAMP measurements, seed cells in 96-well plates; for GPCR plasma membrane expression analyses, seed cells in 48-well plates and for sandwich ELISA to determine total expression levels of the receptor, seed cells in 6-well plates.\nCheck cell viability in the 25 cm2 flask under the microscope before starting to harvest the cells.\nNote: Transfection is always stressful for the cells, so potentially there will be more dead cells floating around than in the normal passaging process. However, the majority should still be adherent. In addition, some receptors may cause cell death in the transfected cells, which can distort results.\nFor HEK293-T cells, coat plates with Poly-L-lysine (96-well plate: 50 μL/w, 48-well plate: 200 μL/w, 6-well plate: 500 μL/w), diluted 1:50 in D-PBS for at least 30 min at 37°C. Remove the Poly-L-lysine solution by aspiration before seeding the cells.\nHarvest the cells and count them.\nRemove the medium.\nWash once with sterile D-PBS.\nAdd 1 mL of Versene per 25 cm2 flask, gently move the flask back and forth until the whole area has been rinsed once.\nSubsequently, remove Versene immediately again before cells detach. Leave flasks for 2–5 min at RT to let cells detach.\nNote: In contrast to trypsinization, harvest cells with Versene only after transfection. EDTA is sufficient to detach the cells. GPCRs expressed at the plasma membrane are not affected by Versene, while trypsin may cause digestion of the GPCR.\nAdd respective growth medium to the 25 cm2 flasks to harvest cells.",
    "Note: If there are several flasks to count, it is recommended to directly count the first tube before harvesting the remaining flasks. This way, the harvesting volume can be adjusted to a countable cell number.\nTransfer the cell suspension to a 15 mL tube and count them using the method established in your lab.\nTypically, countable cell numbers are reached in a volume of around 6 mL.\nNote: A detailed protocol for counting cells and assessment of cell viability has been previously published.9[href=https://www.wicell.org#bib9]\nPrepare a master mix for seeding the cells in growth medium. Cell numbers are listed in the following table.\ntable:files/protocols_protocol_2488_12.csv\nSeed the cells in a total volume of 200 μL/w in 96-well plates, 500 μL/w in 48-well plates and 1 mL/w in 6-well plates.\nNote: Prepare about 10% more cell suspension than needed, because cells are seeded with a multi-dispensing pipette.\nSeed cells in the respective well format.\nMix cell suspension again before seeding.\nSeed cells in triplicates for cAMP and GPCR plasma membrane expression measurements and one well for each construct for total expression level analyses.\nNote: Avoid using the outer wells of the 96-well and 48-well plates but fill those wells with sterile H2O.\nIncubate the 96-well plates in a humidified incubator with 5% CO2 at 37°C for approximately 6 h.\nNote: After seeding, the cells should have time to attach to the plate for at least 5 h before changing the medium to serum-free, optimal are 6 h or more. We observed in our lab that the outer wells are more prone to evaporation compared to the interior wells. Cell densities in the outer wells were observed to be lower than in the interior wells which may hamper the results. A detailed analysis of this phenomenon has been previously published.11[href=https://www.wicell.org#bib11]",
    "Incubate the 6-well plates and 48-well plates in a humidified incubator with 5% CO2 at 37°C until the following day.\nNote: The medium of cells seeded for ELISA analyses is not exchanged.\nFor cAMP measurements:\nRemove the growth medium.\nReplace it with the respective serum-free cell culture medium.\nStarve cells overnight for 16 h at 37°C in a humidified incubator (5% CO2).\nNote: We observed that activation of Gαi/o-coupled receptors is more reliably detectable when cells are serum-starved overnight. The measurement window is increased as compared to cells grown in a medium containing 10% FBS. On the other hand, serum starvation did not affect the relative expression of the GPCRs we analyzed so far. Thus, the media of cells seeded for relative expression analyses is not changed. After seeding, the cells should have time to attach to the plate for at least 5 h before changing the medium to serum-free.\nDay 4: ELISA to determine N-terminal HA-tagged GPCR plasma membrane expression\nTiming: 4 h\nDuring this step, the plasma membrane expression of the overexpressed unstimulated GPCRs is determined. The protocol is adapted from Schöneberg et al.12[href=https://www.wicell.org#bib12]\nCarefully aspirate the medium from the cells.\nAdd 500 μL 4% formaldehyde in PBS per well and fix the cells under light orbital shaking (0.16 rcf) for 20 min at RT.\nWash cells twice with 500 μL PBS per well and dry by tapping the inverted plate on a paper towel.\nBlock the wells by adding 500 μL cell culture medium with 10% FBS for 1 h at 37°C under light orbital shaking (0.16 rcf).\nNote: All wells of the plate should contain 500 μL medium.\nDilute the Anti-HA-peroxidase antibody 1:1000 to a final concentration of 50 mU/mL in cell culture medium with 10% FBS.",
    "Remove the blocking medium and add 100 μL of the prepared antibody solution per well.\nIncubate for 1 h at RT under light orbital shaking (0.16 rcf). All wells of the plate should contain 100 μL medium.\nWash cells three times with 500 μL PBS per well for 5 min each under moderate orbital shaking (approximately 0.3 rcf).\nRemove all residual PBS and ensure that wells are dry.\nPrepare the detection solutions (starting solution and stopping reagent).\nThe starting reagent contains 10 mg o-phenylenediamine, 25 mL substrate buffer and 40 μL H2O2.\nCritical: o-phenylenediamine is highly carcinogenic. It is highly recommended to work under a flow bench from this step on.\nThe H2O2 should be added just before starting the detection.\nThe stopping reagent contains 0.12 M Na2SO3 diluted in 1 M HCl.\nAdd 200 μL starting solution per well and incubate at RT for 2–20 min under moderate shaking. Stop the reaction by addition of 100 μL stopping reagent per well.\nNote: The time indicated in this step is only an approximate indication because it is dependent on the respective GPCR. It is highly recommended to observe the change in color by placing the plate on a white surface. The observed color should not be too dark yellow, i.e., exceed the linear range of detection, because this may skew the results, and differences in plasma membrane expression will be difficult to detect. The addition of the stopping reagent will further darken the solution. In some cases, dilution of the final solution/well or transfer of less than 200 μL may improve the results.\nTransfer 200 μL of each well to a non-sterile 96-well plate and measure the absorbance in absorbance units (measurement wavelength: 492 nm, reference wavelength: 620 nm) in a suitable plate reader.",
    "Note: These analyses will only yield information about relative but not absolute expression levels.\nDay 4: Stimulation of cells with ligand dilutions\nTiming: 3 h\nIn this step, stimulate the cells transiently overexpressing a Gαs- or Gαi/o-coupled GPCR to subsequently (day 5) determine the intracellular cAMP levels. Stimulate Gαs-coupled receptors in presence of 3-isobutyl-1-methylxanthine (IBMX), a nonspecific inhibitor of phosphodiesterases, alone. Stimulate Gαi/o-coupled receptors in presence of IBMX and forskolin, an unspecific activator of adenylyl cyclases.\nCritical: IBMX is also an antagonist for adenosine receptors, which thus may skew results for these GPCRs. Thus, the performance of the experiments in absence of IBMX may serve as a control.13[href=https://www.wicell.org#bib13]\nPreparation of ligand dilutions:\nPrepare HBSS/ HEPES with 1 mM IBMX.\nFor Gαi/o-coupled receptors: Prepare HBSS/ HEPES containing 1 mM IBMX and 2 μM forskolin.\nPrepare serial ligand dilutions in a deep well plate. Dilute ligands in HBSS/ HEPES + IBMX (Gαs) or HBSS/ HEPES + IBMX + forskolin (Gαi/o).\nCritical: In case the agonist stock is not dissolved in H2O or buffer, a vehicle, i.e., solvent control has to be included. The concentration of solvent should be the same in all dilutions of agonist matched to the highest solvent concentration used in the assay. Ethanol or DMSO may receptor-specific affect the assay performance.\nStimulation of cells in 96-well plate:\nRemove the medium from the cells.\nAdd 50 μL HBSS/ HEPES + IBMX per well and incubate for 5 min at RT.\nDiscard HBSS/ HEPES + IBMX from plates.\nAdd 50 μL of ligand dilutions in HBSS/ HEPES + IBMX (Gαs) or HBSS/ HEPES + IBMX + forskolin (Gαi/o) per well and incubate plates at 37°C for 15 min. Use a multi-channel pipette for better workflow.\nPlace plates on ice and gently aspirate medium twice.",
    "Critical: This is important because the cells have to be absolutely dry before being lysed in the following step in an exact volume. Tilting the plates on ice facilitates the complete removal of the assay buffer.\nAdd 50 μL of LI buffer per well and freeze plates at −20°C for at least 30 min or overnight.\nDay 4: Sandwich-ELISA – Cell harvest and coating of a 96-well with anti-FLAG-antibody\nTiming: 2 h\nDetermine the total protein expression levels of the N-terminally HA- and C-terminally FLAG-tagged receptor using a Sandwich-ELISA with Anti-HA and Anti-FLAG monoclonal antibodies.\nHarvest cells from the 6-well plate and solubilize protein.\nRemove the medium from the 6-well plate and add 1 mL H2O per well.\nUse a cell scraper to harvest the cells.\nOption: You can either freeze the plates at this step (−20°C) or continue with the protocol. When frozen, resuspend cells by pipetting up and down.\nTransfer the H2O/cell suspension to a 2 mL tube.\nCentrifuge for 5 min at top speed at RT.\nDiscard supernatant using a pipette.\nGently resuspend the cell pellet in 150 μL lysis buffer using a pipette (Do not vortex!).\nSolubilize for 1 h at RT and then overnight at 4°C under light shaking.\nPrepare plate for immobilization of FLAG-tagged receptor protein.\nCoat 96-well plate (Maxi-Sorp for antibody adsorption) with Anti-FLAG-M2 monoclonal antibody (10 μg/mL in coating buffer, which is equivalent to a 1:100 dilution).\nAdd 100 μL/w of the 10 μg/mL Anti-FLAG-M2 monoclonal antibody solution.\nAttention: Each sample from the 6-well plate will be added to the plate in triplicates the following day!\nShake for 1 h at RT and subsequently at 4°C overnight.\nDay 5: Sandwich-ELISA – Measurement to determine total receptor protein expression levels\nTiming: 4 h\nAspirate antibody dilution from 96-well Maxi-Sorp plate.",
    "Wash plate 3× for 5 min with 200 μL PBS-T at RT, and tap dry between washing cycles.\nBlock with 200 μL cell culture medium containing 10% FBS for 1 h at 37°C under light orbital shaking (0.16 rcf).\nRemove the medium from the plate and repeat step 33.\nIn the meantime, centrifuge solubilized cells (from step 30g) for 10 min at top speed (minimum 13.000 rcf) at RT.\nTransfer supernatant (∼ 130 μL) to a new tube and add 300 μL PBS-T. Discard pellet.\nTransfer 100 μL of the diluted supernatant to a 96-well Maxi Sorp plate (after completion of step 31).\nEach sample is measured in triplicates, i.e., transfer 3 × 100 μL from one tube containing the solubilized protein to separate wells of the plate.\nThe plate is then incubated for 1 h at 37°C under light shaking (0.16 rcf) to enable adsorption of FLAG-tagged receptor protein solubilsate to the immobilized Anti-FLAG antibody.\nRemove the supernatant from the plate and repeat step 33.\nDilute the antibody (Anti-HA-peroxidase) 1:1000 to a final concentration of 50 mU/mL in PBS-T.\nAdd 100 μL per well.\nAlso, fill the surrounding wells with liquid.\nIncubate under light shaking (0.16 rcf) for 1 h at RT.\nRemove the antibody solution from the plate and repeat step 33.\nPerform steps 25–26. Use 150 μL of starting reagent and 50 μL stopping reagent per well.\nMeasure the absorbance (measurement wavelength: 492 nm, reference wavelength: 620 nm) in a suitable plate reader.\nNote: These analyses will only yield information about relative but not absolute expression levels.\nDay 5: Measurement of intracellular cAMP levels\nTiming: 2.5 h\nIn this step, the cAMP content in the lysate of the ligand-stimulated GPCR-expressing cells is determined.",
    "Thaw the 96-well plates from step 29f while shaking them moderately (approximately 0.3 rcf) on an orbital shaker for 30 min at RT to homogenously lyse the cells and distribute the cAMP in LI buffer.\nPrepare the cAMP standard curve as described in the protocol provided by the manufacturer https://resources.perkinelmer.com/lab-solutions/resources/docs/MAN_AlphaScreen_cAMP_6760635DMR.pdf[href=https://resources.perkinelmer.com/lab-solutions/resources/docs/MAN_AlphaScreen_cAMP_6760635DMR.pdf].\nNote: It is possible to freeze the cAMP standard curve and store it at −20°C. For acceptor and donor bead solution, always calculate for 10% more points to compensate for dead volumes. Seal and spin down the 384-well plate briefly, not faster than 400 rcf otherwise the plate might break, after the addition of acceptor/donor beads.\nTransfer 5 μL lysate from each well of the 96-well plate to a 384-well white opaque Opti-Plate (see Figure 2[href=https://www.wicell.org#fig2] for an example plate map using a 12-channel transfer pipette, 0.5–10 μL).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2488-Fig2.jpg\nFigure 2. Example for transfer of lysate from 96-well plates to a 384-well Opti plate for cAMP measurement\nAdd triplicates of each concentration of the standard curve (see Figure 2[href=https://www.wicell.org#fig2]). Seal and spin down (not faster than 400 rcf otherwise the plate might break).\nFrom now on, work in a dark room with only dim green light.\nThe assay is performed as described in the manufacturer’s protocol: https://resources.perkinelmer.com/lab-solutions/resources/docs/MAN_AlphaScreen_cAMP_6760635DMR.pdf[href=https://resources.perkinelmer.com/lab-solutions/resources/docs/MAN_AlphaScreen_cAMP_6760635DMR.pdf].\nIf possible, use an automatic multi-channel pipette for better workflow and reproducibility.\nMeasure the 384-well plate using a plate reader able to detect the AlphaScreen technology (excitation 680 nm; emission 520–620 nm)."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Cell Culture",
    "Cell Biology",
    "Cell-Based Assays",
    "Signal Transduction",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}