{
  "id": 2202,
  "origin_website": "Cell",
  "title": "Protocol for using organic persulfides to measure the chemical reactivity of persulfide sensors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOrganic thiol persulfide reactivity experiments\nTiming: 3–4 h\nThe organic thiol persulfide (CysSSH or GSSH) stock solution prepared above should be used immediately in reactions with a protein of interest. This step is carried out entirely in an anaerobic glovebox to prevent the reaction of protein-derived cysteines with molecular oxygen. The same protocol is used for SqrR and CstR as outlined below.\nTransport an aliquot of protein of interest into the glovebox.\nBuffer exchange the protein into the persulfide reactivity buffer detailed above, stored at 22°C–26°C for two months, using a PD MiniTrap G-25 spun-column (GE, Boston, Massachusetts[href=https://www.cytivalifesciences.com/en/us/shop/chromatography/prepacked-columns/desalting-and-buffer-exchange/pd-minitrap-desalting-columns-with-sephadex-g-25-resin-p-06174]). This is essentially a gel filtration column with low resolution that can be used for buffer exchange. Alternatively, Amicon filters can be used (Amicon filter protocol[href=https://www.emdmillipore.com/US/en/product/Amicon-Ultra-0.5mL-Centrifugal-Filters-for-DNA-and-Protein-Purification-and-Concentration,MM_NF-C82301?CatalogCategoryID=&bd=1]).\nThe protocol for exchanging the protein buffer into the persulfide reactivity buffer is provided by the manufacturer and followed precisely. The column is first equilibrated in the persulfide reactivity buffer, then the protein sample in the original buffer is loaded, and finally, the protein is eluted with persulfide reactivity buffer, and the salts are retained in the column. If a reducing agent, TCEP or dithiothreitol, is still present after buffer exchange, the desired reaction products will not form with the addition of the persulfide. It is therefore useful to have a positive control that can be used to evaluate the integrity of the reactant, prior to starting the reaction.\nSet up 13 microfuge tubes (39 total tubes if the experiment is performed in triplicate, which is recommended to reach significant conclusions) to accommodate reactions run for specific time durations ranging from 0 to 3 h. These can be set up while the protein is exchanged into the intended buffer.",
    "In a typical experiment, timepoints were taken at these specified times; 0 s, 30 s, 1 min, 5 min, 10 min, 15 min, 30 min, 45 min, 1 h, 1.5 h, 2 h, 2.5 h, 3 h. However, these can be varied depending on the rates of reaction.\nNote: For an initial trial, it would be best to start with a simple end point assay, with a sample taken at a single (long) timepoint, 3 h timepoint for example, and subjected to MS-based analysis (see below).\nPrepare a stock solution of Iodoacetamide (IAM) at a concentration where when used as a quenching solution, it would result in a 900-fold molar excess over protein thiolates. IAM caps any unreacted cysteine thiolates and persulfides that form during the course of the reaction.\nEnsure that the reduced protein can be fully capped before starting the reaction by mixing the protein of interest with IAM and analyzing through LC-ESI-MS. With the two persulfide sensors discussed here, the cysteines are readily capped, but this may not be true for other proteins. The molar excess of IAM can also be optimized empirically with the reduced protein of interest.\nAdd 50 μL of the 900-fold molar excess IAM stock into each labeled microfuge tube.\nCalculate the volume of protein, persulfide solution and buffer needed for the reaction and mix the protein and buffer in a separate microfuge tube.\nThe final concentration of the protein used is typically 60 μM.\nThe final concentration of persulfide corresponds to a 20-fold molar excess over the protein, or 1.2 mM.\nBefore adding persulfide to the reaction mixture, remove 50 μL unreacted protein and add to the first tube containing 50 μL of IAM, which will be labeled as the 0 s timepoint.",
    "If done in triplicate, make sure to adjust volumes to ensure sufficient sample for three sets of timepoints. For example, if 13 points are run in triplicate, a total volume of 2000 mL of reaction mixture will be used.\nAdd the calculated volume of persulfide to start the experiment. Start the timer with the addition of persulfide to the reaction mixture.\nAt each specified timepoint, remove 50 μL from the reaction mixture and add to a microfuge tube containing 50 μL of IAM to quench the reaction.\nRepeat this step for each timepoint.\nClean-up step(s) can be added after quenching the reaction to minimize any reaction of IAM with other residues beyond Cys.\nOnce all timepoints are collected, all quenched samples can be removed from the glovebox.\nAll cysteines in the protein have either reacted with CysSSH or GSSH to generate a product and/or have been capped with IAM, preventing any oxidation with molecular oxygen.\nClean-up step for the preparation of persulfide reactions for LC-ESI-MS analysis\nTiming: 1–2 h\nThis step allows for the removal of excess persulfides and IAM to prepare samples for ESI-MS injection and downstream analysis. This clean-up step should be performed right after the quenching occurs to prevent additional undesired modifications with IAM. This step can be removed if no additional peaks appear in the chromatogram.\nObtain a 10 kDa mini-concentrator (MilliporeSigma, Burlington, Massachusetts) for each sample obtained from the reactivity experiments described above.\nSince the molecular weights of reduced CstR and SqrR are approximately 40 kDa (tetramer) and 24 kDa (dimer) respectively, 10 kDa mini-concentrators were used. Other molecular weight cut-off filters can be used depending on the native molecular weight of the protein of interest.\nMake sure to label each mini-concentrator identically to each timepoint used.",
    "Add 400 μL of persulfide reactivity buffer to each tube containing the 100 μL mixture of IAM and oxidized protein.\nThe persulfide reactivity buffer used in this clean-up step is the same as the persulfide reactivity buffer used in the reaction mixture.\nAny excess buffer within the glovebox can be transported out with the reacted protein to be used in the clean-up steps.\nRemove all the solution (500 μL) from each timepoint sample and add to the labeled 10 kDa mini-concentrator corresponding to the same timepoint.\nPlace all tubes into a tabletop microcentrifuge and spin samples for 10 min at 15,871 × g.\nNext, remove the flow-through and add an additional 400 μL of buffer to all samples and repeat. Repeat this step at least two more times to ensure removal of all unreacted cysteine persulfide and IAM.\n5 μL of each sample was aliquoted into a screwcap vial (Waters, Milford, Massachusetts) with 45 μL of persulfide reactivity buffer and analyzed by LC-ESI-MS as described below. Samples are stable at this point and can be stored at –80°C prior to analysis if needed.\nThe mass spectrometer used is a Waters/Micromass LCT Classic time-of-flight (TOF, Milford, MA) mass spectrometer with a CapLC inlet following chromatography on a 50 μm Agilent BioBasic C4 reversed-phase column (5 μm particle size, 300 Å pore size).\n5 μL of each sample is injected and subjected to a 10 min linear gradient from Solvent A (5% acetonitrile, 95% water, 0.1% formic acid) to Solvent B (95% acetonitrile, 5% water, 0.1% formic acid) with the elution monitored at 215 nm. Data were acquired and analyzed using MassLynx Software (Waters, Milford, MA).",
    "Pause point: There are places to pause briefly after determining the concentration of the persulfide and after cleaning up all samples with buffer, prior to the mass spectrometry.\nQuantification and statistical analysis of LC-ESI-MS data\nTiming: 2–3 days\nThis section outlines the steps that we routinely take to convert the raw “intact protein” LC-ESI-MS chromatograms into progress curves that present the fractional population of all significant features as a function of reaction time t.\nChromatograms are processed individually by calculating peak intensities for those features that are characterized by an intensity that is ≥20% that of the most intense feature in each chromatogram.\nAs the peak intensities will depend on the mass of covalently linked unit, a factor that takes into account the differential ionization efficiencies of the monomeric species vs. oligomers need to be estimated to calculate the relative concentrations in solution from the individual peak intensities. e.g., a disulfide bond linking two Cys from opposite protomers would give rise to a dimeric peak of relative less intensity compared to the same concentration of reduced monomer.\nNote: This factor can be determined empirically by measuring the peak intensities associated with the monomeric vs dimeric species. For example, it can be calculated as the ratio between the intensity of the reduced and IAM-capped monomer and the intensity fully oxidized dimeric species, e.g., obtained with excess hydrogen peroxide or with the potent oxidant tetrathionate. This factor was found to be 4 for the CstR systems we have studied in detail and was found to be independent of the CstR species (data not shown).",
    "The adjusted peak intensities are summed, and fractional peak intensities obtained and averaged for individual features (defined on a basis of mass, ±1 Da) from triplicate experiments with standard deviations of the mean and then plotted as function of reaction time, t.\nNote: The multiplicative factor is introduced to account for the different ionization efficiencies of each covalent oligomeric species. The total signal should remain constant among all time points and no significant deviations in signal over time should be detected.\nFor CstRs, which harbor a cysteine pair across the protomer interface on each end of the dimeric unit, we binned individual features into one of five (minimal) species that share an underlying common structural feature but are otherwise heterogeneous with respect to the number of sulfur additions or mixed di- and trisulfide linkages to the organic thiol.\nThese five species are (1) underivatized, IAM-capped monomer (starting material); (2) derivatized monomer, typically characterized by per- and polysulfide chains on one or both cysteines; (3) closed/open dimeric species, in which one side of the dimer is crosslinked across the protomer interface, where on the other side, are not disulfide crosslinked, but chemically modified; (4) di/di species, corresponding to disulfide crosslinks on both sides of the dimer; and (5) closed/closed species, which contain more complex tri- and tetrasulfide crosslinked species on both sides of dimer.\nNote: How one bins MS features is completely operationally defined by the user. Our goal was to use a kinetic model(s) to analyze the progress curves for individual species globally, thus motivating the use of a minimal number of “species”, or more accurately a reduced representation “meta-species node” approach. This reduced representation approach readily permits comparisons between different proteins or a mutant vs. a wild-type protein, while also minimizing the possibility of “over-fitting” the data.",
    "Note: Although we could detect no crosslinked tetrameric species in these reactions, this should be carefully evaluated. All data are analyzed with the simplifying assumption that the individual dimer units react independently of one another within the tetramer.\nThe resulting progress curves are then globally analyzed (no weighting function was used) by applying the simplest possible kinetic model, e.g., a linear model, unless otherwise stated, using DynaFit (Kuzmic, 1996[href=https://www.wicell.org#bib4]). Schematic representations of these fitting models are shown in each case. Data were fitted using a pseudo-first order reaction, justified by the ≈20-fold molar excess of oxidant to protomer or ≈10-fold molar excess of oxidant to Cys residues."
  ],
  "subjectAreas": [
    "Mass Spectrometry",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}