{
  "id": 928,
  "origin_website": "Nature",
  "title": "Injection of virus vectors into the neocortical layer 1",
  "procedures": [
    "**Sharpening of glass needles**\n1. Set glass capillaries to the puller.\n  2. Pull the glass capillaries at the adequate magnet and heater strength.\n  3. Mount the resulting glass needles on the needle holder.\n  4. Match the grinding angle at 40°.\n  5. Fill the syringe of the grinder with dH<sub>2</sub>O, which is filtered to remove dust.\n  6. Sharpen the tip of the glass needle for 20 min, pouring dH<sub>2</sub>O from the syringe.\n  TIP: dH<sub>2</sub>O can protect the tip of the glass needle from the frictional heat and vibration.\n7. Observe the tip of the glass needle with microscope and make sure that the tip is sharpened and not broken.\n  \n**Injection of virus solution into the neocortical layer 1**\n1. Anesthetize rats or mice with chloral hydrate \\(350 mg/kg body weight, i.p.). It takes about 10 minutes until the animal is deeply anesthetized.\n  2. Fix the head of animal to the stereotaxic instrument.\n  3. Shave the surface of the head with electric hair clippers.\n  4. Disinfect the dissection area with 70% ethanol.\n  5. Cut the scalp at the midline sagittal suture, peel the periosteum off, and expose the skull.\n  6. First put the sign on the bregma. Further, mark the insertion positions of the needle. Before marking the insertion positions, make sure precise coordinations by using a brain atlas<sup>9</sup>.\n  7. Make a hollow in the area marked on the cranial bone with a hand drill, under the observation with the stereomicroscope.\n  Caution: saline or PBS should be poured while the hollow is being made, since the frictional heat gives the brain tissue serious damage.\n8. Remove carefully the thinning skull with fine forceps.\n  Caution: note that the blood vessels are not damaged. Especially, the hemorrhage from the vicinity of injection sites remarkably decreases the infection efficiency of virus vectors.",
    "9. Fill the virus solution to the glass needle, using a P2 pipetteman with a microloader tip.\n  10. Attach the glass needle to the needle holder of the pressure injector.\n  11. Set the needle holder to the manipulator of the stereotaxic instrument.\n  12. Match the tip of the needle to the bregma: zero-correction.\n  13. Set the tip of the needle to the injection point by operating the manipulator. At this time, the tip of glass needle is just set on the surface of the brain.\n  14. Read the depth of the needle tip and advance the needle to the target position.\n  15. Inject the solution, pushing the button of the injector. First, the injection time is set to the minimum duration, such as for 2 ms, and afterwards fine-tuned.\n  16. Leave it for 10-15 min during the solution permeates the brain tissue, after the injection ends.\n  17. Pull the needle out carefully.\n  18. Suture the scalp after the antibiotic solution is infused to the wound.\n  19. Remove the animal from the stereotaxic instrument and return it to the cage.\n  \n**Immunohistochemistry**\n1. Anesthetize animals with chloral hydrate \\(500 mg/kg body weight, i.p.).\n  2. Perfuse aminals through the heart with the prewash solution \\(0.15 M NaCl) and then with 4% PFA in 0.1 M phosphate buffer, pH 7.4.\n  3. Remove the brains and cut into blocks 5-mm thick.\n  4. Immerse the tissue blocks in the same fixative at 4 <sup>o</sup>C for overnight.\n  5. Transfer to 30% sucrose in PBS.\n  6. Mount the tissue blocks with Tissue-Tek, frozen in a dry-ice acetone bath and store at -80 <sup>o</sup>C until use.\n  7. Cut the sections at 35-50 &#x3BC;m with the cryostat.\n  8. Wash the sections for 30 min with PBS.",
    "9. Preincubate with PBS containing 4% normal goat serum and 1% bovine serum albumin for 2 h.\n  10. Incubate the sections for 24 h at room temperature with a primary antibody.\n  11. Wash the sections for 30 min with PBS.\n  12. Incubate the sections for 2 h at room temperature with a secondary fluorescent antibody.\n  13. Wash the sections for 30 min with PBS.\n  14. Mount the sections on glass slides and dry up.\n  15. Embed the sections with Permafluor.\n  16. Air-dry the specimens well.\n  17. Observe the specimens with the fluorescence microscope or the confocal fluorescence microscope."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}