{
  "id": 4629,
  "origin_website": "Bio",
  "title": "Citrus Fruit Ascorbic Acid Extraction and Quantification by HPLC ",
  "procedures": [
    "Ascorbic acid extractionResuspend frozen ground citrus flavedo or pulp tissue (0.5 g) in 4 ml 0.1% MPA in a 15 ml disposable plastic tube and keep it on ice. The frozen tissue was previously ground using mortar and pestle chilled with liquid nitrogen.Homogenize the tissue for 1 min using a Polytron homogenizer at maximum speed (30,000 rpm).Centrifuge the homogenate for 10 min at 4,000 x g at 4 °C.Collect the supernatant and keep it in a fresh 15 ml disposable plastic tube on ice.Activate the Sep Pak C18 cartridges using 4 ml methanol and subsequently wash them with 4 ml Milli-Q water and 4 ml 2% MPA. Discard the solution from the washing steps.For the ascorbic acid determination in flavedo take 1 ml of supernatant and mix it with 3 ml 0.1% MPA (1:4 dilution). For ascorbic acid determination in pulp do not dilute it, just continue with the protocol using the whole supernatant.Filter the solutions obtained in step A4 (pulp) or A6 (flavedo) through a previously activated C18 Sep Pak cartridge using a syringe. Collect the filtrate in a fresh 15 ml disposable plastic tube.Wash the C18 Sep Pak cartridge with 4 ml 2% MPA. Collect the eluate together with the solution from step A7.Filter the solution from step A8 through a 0.45 μm nylon filter using a syringe. This step is added to make sure the solution is clean of any particles that could damage the HPLC column.Wash the filter with 4 ml 2% MPA and collect it together with the filtrate solution from step A9.Measure the final volume and take it into account together with the initial dilution (in the case of flavedo samples) for the calculations of ascorbic acid concentration.",
    "Prepare an amber HPLC vial with 1 ml of the final extract (from step A10) for the ascorbic acid measurement.Dehydroascorbic acid extractionDehydroascorbic acid is converted to ascorbic acid by the addition of DTT, then the amount of total ascorbic acid (dehydroascorbic acid + ascorbic acid) is measured and the dehydroascorbic acid concentration results from the substraction of ascorbic acid to total ascorbic acid (see step D3).Transfer a 200 μl aliquot of the final extract (step A10) to an amber HPLC vial.Incubate it for 15 min at room temperature with 100 μl of 200 mM DTT in 400 mM Tris base (pH 8.5).Stop the reaction by acidification with 100 μl of 8.5 % orthophosphoric acid.Ascorbic acid and dehydroascorbic acid HPLC measurementsTo quantify the ascorbic acid concentration inject 10 μl of the solution obtained from step A10 in a HPLC equipped with a photodiode array detector and an Ultrabase C18 column (100 x 4.6 mm, 2.5 μm). Set column temperature at 35 °C. Use an isocratic mobile phase of methanol: Milli-Q water (pH 2.5) (15:85, v/v, pH adjusted with MPA) at 0.2 ml/min flow.Quantify the area under the peak that displays a maximum at 248 nm (ascorbic acid absorbs between 210 and 300 nm with a maximum at 248 nm). This area is applied to the formula described in D2 to calculate the ascorbic acid concentration of the sample. Measure the spectrum between 200 and 450 nm with a PDA detector to confirm the quantification of pure ascorbic acid.To obtain the dehydroascorbic acid concentration inject 10 μl of the solution obtained from step B3 using the same equipment and conditions described in step C1.Quantify the area under the peak that displays a maximum at 248 nm.",
    "Apply this area to the formula described in D3 to calculate the dehydroascorbic acid concentration of the sample. Measure the spectrum between 200 and 450 nm with a PDA detector to confirm the quantification of pure ascorbic acid.Ascorbic acid and dehydroascorbic acid quantificationPrepare a calibration curve using a series of ascorbic acid dilutions as described in Table 1 and measure the peak area following the same procedure as described in section C. Adjust the linear function of ascorbic acid concentration vs. peak area and use the slope to calculate the concentration of the unknown samples as described in the formula:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150302/20150302182528_5988.jpgDehydorascorbic acid concentration: imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150306/20150306005545_7078.pngThe x2 is included in the formula because it is the dilution factor due to the addition of 200 μls of extra volume in steps B2-3."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}