{
  "id": 18504,
  "origin_website": "Jove",
  "title": "Modeling Chemotherapy Resistant Leukemia In Vitro",
  "procedures": [
    "1. Advanced Preparation\nPreparing dextran G10 particles.\n\t\nPrepare G10 slurry by adding 50 ml 1x PBS to 10 g G10 particles. Mix by inversion and allow G10 to settle out of phosphate buffered saline (PBS) at 4 °C O/N.\nThe day of G10 column separation, aspirate PBS from settled G10 particles and add 50 ml fresh PBS. Mix by inversion. Repeat twice, adding 50 ml fresh PBS to settled G10 particles and store at 4 °C until ready to use.\nCulturing BMSC and OB.\n\t\nMaintain both BMSC or OB at 37 °C in 6% CO2 and grown on 10 cm tissue culture plates until 90% confluency is reached.\nTrypsinize BMSC or OB cells and split 1:2 onto new 10 cm plates. The cells are grown to these standards until needed for leukemic co-culturing.\n2. Establishing and Maintaining Co-culture\nAdd 5-20 x 106 leukemic cells in 10 ml of tumor specific culture media onto an 80%-90% confluent BMSC or OB plate.\nNOTE: Our lab maintains co-cultures at 37 °C in 5% O2 to better recapitulate the bone marrow microenvironment which has been shown to range from 1% to 7%16-18 . However, maintaining co-cultures at this oxygen tension is not critical for the establishment of the three leukemic subpopulations and is at the discretion of the lab.\nEvery 4th day remove all but 1 ml of media (including leukemic cells in suspension) and replace with 9 ml fresh leukemic culture media. When removing 9 ml of media from plate, be careful not to disturb the BMSC or OB adherent layer.",
    "Remove media by tilting plate to the side and aspirate media in the corner of the plate. Additionally, when adding fresh media, be sure to add drop wise in the corner of the plate against the sidewall to ensure minimal disruption of the BMSC or OB adherent layer.\nAfter the 12th day of co-culture, rinse leukemic cells from BMSC or OB layer by pipetting culture media from dish up and down gently over the dish approximately 5 to 10 times and then collect in 15 ml conical tube. Reseed onto new 80%-90% confluent BMSC or OB plate as described in step 2.1.\nNOTE: The gentle rinsing of the co-culture as described in step 2.3 will remove S and PB leukemic cells without disrupting the BMSC or OB monolayer. This allows only tumor cells to be transferred to the next co-culture plate. This 12 day cycle can be repeated as many times as needed based on user needs.\n3. Preparing G10 Bead Columns\nNOTE: If sterile downstream analysis or culturing is required following G10 column separation the following steps should be carried out using sterile technique and G10 columns should be setup in a sterile biological hood.\nPre-warm cell culture media to 37°C in water bath (~30 ml per column). Using a 10 ml disposable syringe, remove and discard plunger. Add glass wool to syringe.\nUsing tweezers, pull apart glass wool into thin loose strands. Add multiple layers of lightly packed glass wool to the syringe until 2/3 of the syringe is filled with glass wool.\nNOTE: The glass wool is crucial to prevent loose G10 particles from contaminating the leukemic cell collection. Make sure glass wool is packed enough to support the G10 particles, but not too densely packed to block media flow through the column.",
    "Attach 1-way stopcock to the tip of the syringe in the closed position.\nClamp syringe column to ring stand high enough so a 50 ml conical tube (collection tube) can be placed underneath stopcock. Place collection tube under syringe column.\nUsing a 10 ml pipette add, drop-wise, G10 particles resuspended in PBS to the column on top of the glass wool. Continue adding G10 particles until a ~2 ml pellet (as measured by graduations on syringe) of G10 particles forms on top of the glass wool.\nEquilibrate the G10 column with pre-warmed media.\n\t\nAdd 2 ml of pre-warmed media to column. Open stopcock valve slowly so that media flows out of the column drop-wise.\nRepeat step 3.6.1 until a total of 10 ml of pre-warmed media have been ran across the column.\nNOTE: If G10 particles are seen in the flow through in the collection tube, either 1) add more G10 particles to maintain ~2 ml pellet making sure no additional G10 particles escape from the column or 2) replace column with an unused one and repeat steps 3.4-3.6.1.\nAfter the pre-warmed media drains from the column, close the stopcock and discard collection tube with flow through. Add new collection tube under column. Column is ready to be loaded with media + cell mixture.\nNOTE: Columns should be used immediately and not allowed to dry.\n4. Separating 3 Subpopulations within Co-culture\nCollection of suspension (S) tumor subpopulation.\n\t\nAspirate media from co-culture plate with pipette and gently re-apply the same media to rinse the plate and collect media containing leukemic cells in a 15 ml conical tube. The leukemic cells collected are the S subpopulation.\nCollection of Phase Bright (PB) tumor subpopulation.",
    "Add 10 ml fresh media back onto co-culture plate. Rinse vigorously by pipetting added media up and down approximately 5 times to remove adherent leukemic cells but not hard enough to dislodge adherent BMSC/OB component.\nAspirate with pipette and collect media in a 15 ml conical tube. The collected cells are the PB subpopulation.\nCollection of Phase Dim (PD) tumor subpopulation.\n\t\nRinse plate with 1 ml PBS to remove remaining media. Trypsinize co-culture plate with 3 ml trypsin and place into 37 °C incubator for 5 min.\nRemove plate out of incubator and gently tap sides of the plate to dislodge adherent BMSC/OB.\nAdd 1 ml fetal bovine serum (FBS) and pipette up and down 3-5 times to break apart large cell aggregates.\nCollect media with cells in a 15 ml conical tube. These cells are the unpurified PD subpopulation with BMSC/OB as well.\nCentrifuge 3 isolated subpopulations at 400 x g for 7 min. Aspirate and discard supernatant then individually resuspend pellets in 1 ml pre-warmed media. Cells are ready to be loaded onto a G10 column.\n5. Loading Co-culture Cells onto G10 Column\nNOTE: Make sure stopcock is completely closed before adding media containing cells to G10 column. Also, each subpopulation must be ran over a separate G10 column so not to introduce any bias between populations in downstream analysis.\nUsing a 1,000 µl pipette, add 1 ml of each cell subpopulation in pre-warmed media to a separate G10 column drop-wise. Ensure that the media containing the cells remains on top or within G10 pellet. Allow cells to incubate on G10 pellet for 20 min at RT.\nNOTE: Stopcock remains closed for duration of incubation.\n6. Collecting Leukemic Cells from G10 Column",
    "Add 1-3 ml pre-warmed media to each G10 column. Open stopcock valve and allow media to slowly exit the column drop-wise.\nNOTE: It is crucial to maintain a slow flow rate from the column or the G10 pellet containing BMSC/OB can wash out of the column and contaminate the isolated leukemic cells.\nContinue to add pre-warmed media in small increments (1-2 ml) to G10 column until a total of 15 to 20 ml has run through column and has been collected. Close stopcock valve and cap collection tube.\nNOTE: If a G10 particle pellet is seen at the bottom of collection tube, gently remove media from the tube leaving G10 particle pellet undisturbed and transfer to new tube.\nCentrifuge collected media at 400 x g for 7 min at RT. Remove supernatant and resuspend cell pellet in buffer appropriate for downstream application.\nCells are now a pure population of leukemic cells free of BMSC or OB contamination and are ready to be applied to downstream applications at user discretion.\nNOTE: Leukemic cell viability should remain unchanged when passing cells through G10 columns.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}