{
  "id": 13538,
  "origin_website": "Jove",
  "title": "Analysis of Protein-protein Interactions and Co-localization Between Components of Gap, Tight, and Adherens Junctions in Murine Mammary Glands",
  "procedures": [
    "All animal protocols used in this study were approved by the University Animal Care Committee (INRS-Institut Armand-Frappier, Laval, Canada).\n1. Identifying Protein Co-localization\nFrom tissue to microscopic slides\n\tNOTE: Tissues and sections should be handled on dry ice.\n\t\nExcise the mammary glands from an animal (for a complete description of this procedure, refer to Plante et al.)14.\nEmbed the excised tissue in freezing/mounting medium on dry ice. Add enough medium to cover the gland. When the medium is solidified, transfer the tissues to a freezer at -80 °C for later use9.\nUsing a cryomicrotome set at ≤ -35 °C, cut the tissues into 7-10 μm-thick sections and place them on microscope slides.\n\t\tNOTE: When possible, place two sections on each slide; the left section will be used as a negative control to verify the specificity of the antibodies and the autofluorescence of the tissue, while the right side will be labeled with the antibodies.\nKeep the sections at -80 °C for later use.\nCo-IF staining\nRetrieve the appropriate microscopic slides from the freezer and immediately fix the sections by immersing them in formaldehyde 4% for 15 min at room temperature (RT).\nThen immerse the slides in phosphate-buffered saline (PBS) at RT. Leave the slides in PBS at RT until proceeding to the next step.\nCircle each section of the slide using a commercially available hydrophobic barrier or a water-repellent lab pen (see the Table of Materials). Be careful not to touch the tissue. Immediately add drops of PBS to the tissue and place the slide in a humid histology chamber for the remainder of the procedure.\n\t\tNOTE: The tissue sections must remain moisturized. Alternatively, use a box with a lid and place wet paper towels on the bottom.",
    "Block each tissue section with 100-200 µL of 3% bovine serum albumin (BSA)-Tris-buffered saline (TBS)-0.1% polysorbate 20 (see the Table of Materials) for 30 min at RT. While the samples are blocking, prepare the primary and secondary antibody solutions by diluting the antibodies in TBS-0.1% polysorbate 20.\n\t\tNOTE: The required concentration for the antibody is provided by the manufacturer; see the Table of Materials and Figures 1 and 2 for examples, as well as Dianati et al.9. Although it is not necessary to work in the dark when using most fluorophore-conjugated antibodies, avoid exposing the antibody solutions or stained tissues to intense, bright light.\nRemove the blocking solution by aspiration and incubate the sections in 100-200 µL of the diluted primary antibody for 60 min at RT. Alternatively, incubate with the primary antibody overnight at 4 °C.\nRemove the primary antibody solution by aspiration and wash the sections with 250-500 µL of TBS-0.1% polysorbate 20 for 5 min. Remove the wash solution by aspiration and repeat the wash twice.\nRemove the wash solution by aspiration and incubate the sections with 100-200 µL of the appropriate fluorophore-conjugated secondary antibody for 60 min at RT.\nRemove the secondary antibody solution by aspiration and wash the sections with 250-500 µL of TBS-0.1% polysorbate 20 for 5 min. Remove the wash solution and repeat twice.\nRepeat step 2.5-2.8 using the appropriate combination of primary and secondary antibodies for the subsequent protein(s) of interest.\nRemove the wash solution by aspiration and perform the nuclei staining by incubating the section with 100-200 µL of 1 mg/mL 4',6-diamidino-2-phenylindole (DAPI) in TBS-0.1% polysorbate 20 for 5 min at RT.\nRemove the DAPI solution by aspiration and mount the slides using a water-soluble, non-fluorescing mounting medium (see the Table of Materials) and coverslips. Proceed one slide at a time.",
    "NOTE: Incubating the nucleus stain for more than 5 min will not change the intensity of the staining. Alternatively, remove the DAPI solution on all slides and incubate the tissues in PBS while mounting the slides.\nPlace the slides flat in a 4 °C refrigerator for at least 8 h. Proceed to the fluorescence microscopic imaging (see Figures 1 and 2).\nMicroscopic imaging\nVisualize the fluorophore-conjugated secondary antibodies using a confocal microscope equipped with the various lasers required to excite the fluorophores at their specific wavelengths.\n\t\tNote: To be able to visualize ducts and alveoli, a 40X objective with a numerical aperture of 0.95 is suggested. An example of the specific settings is provided in Figure 1.\nVerify the localization of each protein individually by scanning the image one wavelength at the time.\n\t\tNote: At this stage, it is important to critically analyze the localization of the junctional proteins. To be able to form junctional nexuses, these proteins must be localized at the plasma membrane.\nDetermine the co-localization of proteins by merging the images scanned with the lasers at the different wavelengths.\n\t\tNote: Protein co-localization can be visualized by the change of color resulting from the emission of two or more fluorophores at the same location and can be measured using the appropriate software (Figures 1 and 2; also see Reference 9).\n2. Studying PPIs\nNOTE: Abdominal mammary glands should be used to study PPIs, as thoracic glands are in close association with the pectoral muscles. Excise the mammary glands (for a complete description of this procedure, refer to Plante et al.)14 and keep them at -80 °C for later use.\nLysate preparation\nPlace weighing paper and 2 mL microcentrifuge tubes on dry ice to pre-cool them before proceeding with the next steps.",
    "Take the mammary gland tissue from -80 °C and keep them on dry ice.\nWeigh the tissues on the pre-chilled weighing papers and then transfer the tissue to 2 mL microcentrifuge tubes (handle on dry ice). Use between 50 and 100 mg of tissue per sample. Keep the tissue on dry ice until step 2.1.5.\nPrepare the required amount of triple detergent lysis buffer supplemented with NaF, NaVO3, and protease/phosphatase inhibitor, as indicated in the Table of Materials, using the following formulas. Mice: required buffer (µL) = mouse tissue weight (mg) x 3; Rat: required buffer (µL) = rat tissue weight (mg) x 5.\nAdd the required amount of ice-cold lysis buffer (calculated in step 2.1.4) to the 2 mL tube containing the tissue.\n\t\tNOTE: In steps 2.1.5-2.1.6, proceed with one single tube at a time.\nHomogenize the tissue for 30-40 s using continuous homogenization on a tissue grinder; always keep the tube on ice. Adjust the tissue homogenizer to medium speed and gently move the grinder up and down inside the tube.\nRepeat steps 1.6 and 1.7 with the other tubes.\nIncubate the lysates on ice for 10-30 min.\nCentrifuge the tubes at 170 x g for 10 min at 4 °C.\nMeanwhile, identify 6-10 microcentrifuge tubes (0.6 mL) for each sample and keep them on ice.\nOnce the centrifugation is done, check the tubes. Ensure that they contain a top layer of fat, clear, yellow-to-pink lysates (depending on the stage of development) and a pellet.\nCreate a hole in the lipid layer using a 200-µL pipette tip to access the liquid phase. Change the tip and collect the lysate without disturbing the pellet or aspirating the lipid layer. Aliquot the lysate in pre-labeled tubes on ice (step 2.1.11) and store them at -80 °C.",
    "Use an aliquot to quantify the protein concentration using an appropriate commercially available kit (see the Table of Materials).\nIndirect immunoprecipitation\nOn ice, thaw two aliquots of the total mammary gland lysates prepared previously.\n\t\tNOTE: One aliquot will be used for the IP of the target protein, while the other will serve as the negative control.\nCollect 500-1,000 µg of the lysate and dilute it in PBS to reach a final volume of 200 µL in each 1.5 mL tube.\n\t\tNOTE: The amount of lysate to be used depends on the abundance of the protein of interest and the efficiency of the antibody (see Figure 3 for an example, as well as the Table of Materials). To optimize for each target, different amounts of lysate (i.e., 500, 750, and 1,000 µg) and antibody (i.e., 5, 10, and 20 µg) should be used. Proceed with the following steps (2.2.3-2.3.7.4).\nAdd the antibody against the antigen of interest to the first tube of lysate and keep it on ice.\n\t\tNOTE: The required amount is usually suggested on the instruction sheet provided by each company (see the Table of Materials).\nIn the second tube, prepare a negative control by adding the same concentration of isotype IgG control as the antibody used in step 2.2.3.\nIncubate the tubes overnight at 4 °C on a tube roller-mixer at low speed.\nThe following day, add 50 µL of magnetic beads to new 1.5 mL tubes for pre-washing.\n\t\t\nSelect either Protein A or Protein G magnetic beads based on the relative affinity to the antibody.\nIt is important to avoid using aggregated beads; gently mix the bead suspension until it is uniformly re-suspended before adding it to the tubes.",
    "Place the tubes containing the beads on the magnetic stand and allow the beads to migrate to the magnet. Remove the storage buffer from the beads using a 200 µL pipette.\nWash the beads by adding 500 µL of PBS-0.1% polysorbate 20 and vortex the tubes vigorously for 10 s.\nPut the tubes back on to the magnetic stand and allow the beads to migrate to the magnet.\nRemove the excess wash buffer by pipetting with a 200 µL pipette.\nAdd the reaction complex (lysate-antibody) from step 2.2.5 to the beads and incubate for 90 min at RT on the roller mixer.\nPlace the tubes on the magnetic stand and allow the beads to migrate to the magnet. Using a 200 µL pipette, aspirate and discard the lysate and place the tubes on ice.\nWash the beads by adding 500 µL of PBS, placing the tubes on the magnetic stand, and removing the liquid using a 200 µL pipette. Repeat this wash step. During the wash steps, avoid vortexing and keep the samples on ice.\nWash the beads once with PBS-0.1% polysorbate 20 without vortexing and discard the last wash buffer using a 200 µL pipette tip.\nTo elute, add 20 µL of 0.2 M acidic glycine (pH = 2.5) to the tubes and shake them for 7 min on the roller mixer.\nCentrifuge at high speed for a few seconds (quick spin) and collect the supernatant in a fresh ice-cold tube.\nRepeat steps 2.2.14 and 2.2.15 for each tube.\n\t\tNOTE: The final volume will be 40 µL.\nAdd 10 µL of 4x Laemmli buffer to the 40-µL eluted sample from step 2.2.16.\n\t\tNOTE: The color will turn yellow due to the acidic pH.",
    "Immediately add 1 M Tris (pH = 8), one drop at a time, to the eluted sample from step 2.2.18 until its color turns blue. Proceed to the next tubes.\nBoil the samples from step 2.2.18 at 70-90 °C for 10 min. Proceed immediately to gel electrophoresis. Alternatively, transfer the samples to a freezer at -80 °C until loading.\nDownstream application: gel electrophoresis followed by Western blot\nPrepare separating and stacking SDS-PAGE acrylamide gels (1.5 mm thickness) following standard procedures15.\n\t\tNOTE: The choice of gel (8-15% acrylamide, gradient: see the Table of Materials) should be determined based on the molecular size of the protein to be precipitated and of the potential binding partners to be analyzed. These proteins must be resolved from each other to allow for proper immunodetection.\nThaw the immunoprecipitation (IP)-eluted samples (step 2.2.20) on ice.\nPrepare protein lysates from the same samples (used for the IP procedure above). Use 50 µg of total lysate and add 4X Laemmli sample buffer. Boil the samples at 70-90 °C for 5 min and place on ice until loading.\n\t\tNOTE: These samples will be loaded beside the eluted IP sample to demonstrate the presence of precipitated proteins in the total lysate.\nLoad the prepared lysates from step 2.3.3 and the precipitated samples from step 2.2.20 side-by-side in an acrylamide gel and run them in running buffer (10x running buffer: 30.3 g of Tris, 144.1 g of glycine, and 10 g of SDS in 1 L of distilled water) at 100 V for approximatively 95 min, or until the edge of the migrating proteins reaches the bottom of the gel.\nTransfer the gels to a nitrocellulose or PVDF membrane using a standard protocol9,15.",
    "Block the membrane for 1 h on a rocker on low speed in 5% dry milk-TTBS (20 mM Tris, 500 mM NaCl, and 0.05% polysorbate 20).\nIdentify whether the precipitation was successful.\n\t\t\nProbe the membrane using the first antibody against the precipitated protein, diluted in 5% dry-milk-TTBS at the concentration recommended by the manufacturer, overnight at 4 °C on a rocking platform with slow agitation.\n\t\t\tNOTE: See the Table of Materials for recommendations.\nThe following day, wash the membrane 3 times for 5 min each with TTBS on a rocking platform with high agitation.\nIncubate the membrane in the appropriate secondary antibody conjugated with horseradish peroxidase (HRP), diluted in TTBS, for 1 h at RT on a rocking platform with slow agitation.\n\t\t\tNOTE: Alternatively, a secondary antibody conjugated with a fluorochrome can be used if an appropriate apparatus to detect the signal is available.\nPerform 3 to 6 washes, each for 5 min, with TTBS on a rocking platform with high agitation. Analyze the signal of the secondary antibody by incubating the membrane with a commercially available luminol solution (see the Table of Materials) and follow the manufacturer instructions. Detect the signal using a chemiluminescence imaging system (see the Table of Materials).\n\t\t\tNOTE: For a detailed protocol on Western blot analysis, see Reference 16.\nTo identify interacting proteins, perform steps 2.3.7.1-2.3.7.4 using the appropriate antibodies on the same blot.\n\t\tNOTE: If proteins are interacting, the binding partners will be co-immunoprecipitated with the target protein and will thus be detectable by Western blotting. Step 2.3.8 can be repeated with more antibodies to determine whether other proteins reside in the same proteins complex, as long as the molecular weights of the proteins differ enough to be well-separated on the gel and membrane.",
    "To confirm that the identified binding partners are not artifacts, reciprocal IP should be performed.\n\t\tNOTE: This is performed by repeating steps 2.2.1-2.2.20 with the same lysate but precipitating one of the binding partners identified in step 3.8. Then, steps 3.1-3.8 are repeated using the primary antibody against the first protein of interest.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}