{
  "id": 4124,
  "origin_website": "Cell",
  "title": "Protocol for Dissection and Dissociation of Zebrafish Telencephalon for Single-Cell Sequencing",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nCerebroventricular Microinjection (CVMI)\nTiming: 30–60 min\nBy using CVMI, one can deliver any substance into the zebrafish brain. Here, we describe how to use CVMI to deliver amyloid-β42, IL4, and PBS. This technique has been described in detail previously (Bhattarai et al., 2020[href=https://www.wicell.org#bib2]; Bhattarai et al., 2016[href=https://www.wicell.org#bib3], 2017a[href=https://www.wicell.org#bib4], 2017b[href=https://www.wicell.org#bib5]). This step is not a requirement. Any desired solution can be injected into the adult zebrafish brain using the CVMI method. The experimental protocol and troubleshooting options for CVMI were described in detail previously (Bhattarai et al., 2016[href=https://www.wicell.org#bib3], 2017a[href=https://www.wicell.org#bib4], 2017b[href=https://www.wicell.org#bib5]; Cosacak et al., 2019[href=https://www.wicell.org#bib6]). After the injection, wait for the desired duration to reach the experimental time point.\nDissolve Aβ42 and IL4 in PBS and inject into the zebrafish cerebroventricular fluid at 20 μM and 1 μM, respectively, as described before (Bhattarai et al., 2016[href=https://www.wicell.org#bib3], 2017b[href=https://www.wicell.org#bib5]).\nKeep the fish in water system for 24 h in 14/10 hours light/dark cycle as recommended (Alestrom et al., 2019[href=https://www.wicell.org#bib1]).\nPreparation of Single-Cell Suspension\nTiming: 2–3 h\nThis is the main focus of this protocol. Here, we describe how to dissect the zebrafish telencephalon and dissociate it into single-cell suspension followed by flow cytometry-based sorting (from this point on: FACS). We provide important hints to enhance the dissociation and sorting.\nCritical: After starting the dissociation of cells, the protocol has NO STOP until encapsulation of cells and cDNA synthesis. This experiment must be planned for approximately 60 min deviation.\nCritical: Before you start, make sure that you will have access to the equipment at the time you need (e.g., the flow cytometer, centrifuges, or the single cell sequencing facility).",
    "Critical: It is always better to first optimize the dissociation and sorting of cells. Determine the optimum number of cells sorted and the percentage of these cells that survive after sorting (should not be less than 95%).\nNote: Here, we describe our protocol for dissociation of the telencephalon in the adult zebrafish brain.\nCritical: Animals have to be euthanized according to the permission and ethical rules of local authorities.\nCritical: Before the step 3.b, animals must be sacrificed, and all further procedures will be performed post-operationally.\nDissecting Zebrafish Brain (1–2 min per fish) (Video S3[href=https://www.wicell.org#mmc3])\nEuthanize the fish according to the permissions and ethical rules of local authorities.\nGenerate a slit at the caudal of the skull and remove the right flank of the skull carefully.\nThen remove the left flank carefully.\nRemove any extra tissues (fat or meninges) carefully.\nCRITICAL STEP: Cut the telencephalon at the border of the optic tectum and telencephalon.\nLift the telencephalon.\nOlfactory bulb will be automatically released while lifting the telencephalon. If not, remove it carefully.\nGently transfer the telencephalon into Buffer Mix-I.\nLet the telencephalon rotate in a rotator at a temperature between 26.0 and 28.5°C.\nContinue with the next fish as above.\nCell Dissociation (90 min) (Video S4[href=https://www.wicell.org#mmc4])\n        Your browser does not support HTML5 video.\n      \nVideo S3. Dissecting Zebrafish Brain (1–2 min per Fish) (Associated with Step 3)\nRotate the brains for 10 min.\nTriturate (5 times) with a glass capillary to help physical dissociation (Repeat this step 3 times using the normal orifice size).\nCritical: From now on trituration must be slow and gentle.\nAdd 20 μL of Buffer-Y mix (Video S4[href=https://www.wicell.org#mmc4]).",
    "Critical: Glass capillary helps physical dissociation. However, if the orifice size is too small it will induce disruption of the cell. In general, liquid must pass easily through the orifice of the capillary. The tissue chunks should pass easily through the opening. If the orifice is too wide, it can be narrowed down by heating.\nIncubate for 10 min. Triturate (5 times). Repeat this step 3 times, the orifice can be narrowed down as the chunks get smaller.\nAt the last step, triturate 5 times. If there are still visible chunks, incubate another 10 min.\nCritical: Do not use small orifice sizes that might damage the cells (e.g., shearing the cell membrane).\nStraining and Pelleting the cells (30 min) (Video S5[href=https://www.wicell.org#mmc5])\n        Your browser does not support HTML5 video.\n      \nVideo S4. Dissociating Cells to Single-Cell Suspension (Associated with Step 4)\nPut a cell strainer (40 μm) in a 50 mL tube.\nPass 5 mL of 4% BSA through the cell strainer for equilibration.\nCritical: Always use BSA to prevent cell lysis or adherence of cells to the walls of the tubes. BSA prevents cellular stress and improves the viability significantly.\nPass all cell suspension through the strainer using 1 mL pipette tips. Pipetting should be done gently and slowly.\nPass 4 mL 1x PBS through the cell strainer to dilute the BSA to 2% BSA.\nRecycle the extra liquid from the cell strainer to elute all cells.\nCentrifuge in a benchtop centrifuge at 300 g for 10 min at +4°C.\nNote: Another round of centrifugation can decrease the number of particles. This will speed up the FACS, as the number of superfluous events (e.g., cell debris) will be decreased and intact cells will be enriched.\nNote: One can remove myelin by using commercial kits.\nRemove supernatant carefully by inverting the tube.",
    "Critical: Do not keep cells on ice for longer times. Longer time on ice induces cell death.\nNote: In order to understand the sensitivity of the cells, one can try keeping cells on ice for 10, 20 and 30 min and then check the percentage of dead cells by using cell viability dyes (e.g., vibrant dye).\nAdd 10 mL 2% BSA. Gently re-suspend the cells.\nCentrifuge the cells at 300 g for 10 min at +4°C.\nRemove supernatant carefully by inverting the collection tube.\nRemove extra liquid and re-suspend the cell pellet in 4% BSA.\nPut cells on ice until sorting.\nProceed as soon as possible to flow cytometry-based sorting.]\nFlow cytometer-based cell sorting (15 min)\nAdd cell viability dye (Propidium iodide,1:500 dilution)\nUse 200 μL tubes. Add 2μL of the encapsulation buffer.\nCritical: The maximum volume of cell suspension that can be encapsulated in a single 10X Genomics channel is 45 μL. If using a 100 μm nozzle for sorting, this means a maximum of 15,000 cells or particles can be sorted into one tube for a single channel.\nPerform cell sorting according to the optimized settings of your machine.\nCritical: For our publication, we used only one fish. However, if more cells are required, more telencephali must be used.\nCritical: First optimize the sorting settings. Here, it is better to test how long the cells survive on ice. If the cells die quickly, try optimizations on every previous step.\nCritical: As soon as the cells are sorted, proceed to the cell encapsulation and single-cell sequencing.\n        Your browser does not support HTML5 video.\n      \nVideo S5. Straining and Pelleting the Cells (30 min) (Associated with Step 5)"
  ],
  "subjectAreas": [
    "Single Cell",
    "Sequencing",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}