{
  "id": 6433,
  "origin_website": "Bio",
  "title": "Biofilm Assays on Fibrinogen-coated Silicone Catheters and 96-well Polystyrene Plates",
  "procedures": [
    "The individual steps of this protocol are summarized in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190314/20190314173923_6272.jpgFigure 1. Protocol layout Bacterial growthStreak the bacterial species on a BHI agar plate using a sterile inoculation loop.Incubate bacteria overnight at 37 °C.Add 10 ml of BHI media into a 15 ml conical tube.Using a sterile inoculation loop, pick a single E. faecalis colony to inoculate the media.Incubate the bacterial culture for 18 h at 37 °C under static conditions (target OD600 = 1.0).Catheter and microplate preparationCatheterCut the silicone tubing in 1 cm pieces.Cut in half the 1 cm pieces (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190314/20190314174002_4264.jpgFigure 2. Preparation of 1 cm silicone pieces. A. Silicone tubing. B. 1 cm silicone pieces. C. 1 cm pieces in half.Put the resulting pieces in an open Petri dish.UV-sterilize the pieces overnight (Biological Safety Cabinet standard UV settings)Use sterile forceps to transfer each silicone piece into sterile 5 ml glass test tube and cap it. Note: Fibrinogen is a sticky protein. Therefore use of a glass tube will reduce binding of fibrinogen to the tube walls.  Thaw the fibrinogen stock solution at 37 °C, and bring the 1x PBS solution to 37 °C. Fibrinogen is soluble at body temperature; therefore, keep it at 37 °C until you add it to the silicone pieces. Prepare a working solution of 100 µg/ml of fibrinogen in 1x PBS. Add 1 ml of the fibrinogen solution to the test tube containing the silicone piece. Incubate the silicone pieces at 4 °C overnight under static conditions to allow fibrinogen to coat the catheter. Microplate Dispense 100 µl of the 100 µg/ml fibrinogen solution (Step B7) into each well of the 96-well polystyrene plates (Grenier Bio-One CellSTAR). Seal the plate with a sterile plate sealing tape.Incubate the microplate at 4 °C overnight to allow fibrinogen to coat the bottom of the well.",
    "Culture preparationCentrifuge the overnight culture (Step A5) for 10 min at 7,000 rpm (7,505 x g).Remove supernatant.Resuspend the bacterial pellet with 10 ml of 1x PBS solution. Then centrifuge again for 10 min at 7,000 rpm (7,505 x g). Wash the bacterial cells by resuspending the bacterial pellet with 10 ml of 1x PBS solution. Repeat this step 3 times.Dilute 1 ml of bacterial solution into 9 ml of 1x PBS solution (dilution 1:10). This step is necessary to ensure the accuracy of the measurement.Take 1 ml of the diluted solution and put it into a cuvette. Measure optical density (OD600) by using the spectrophotometer.Note: Multiply the OD600 value by 10 (dilution factor) to obtain the final optical density of the culture.  Dilute the culture to a final OD600 of 1.0.Supplement fresh filter-sterilized urine (see Recipe 2) with 20 mg/ml of BSA. Filter sterilize the supplemented urine using bottle top filter. Inoculate 1:100 of normalized culture (Step C7) into the filter-sterilized urine supplemented with BSA. Catheter Fg-dependent biofilm setupAfter overnight incubation at 4 °C, remove the test tubes containing the Fg-coated silicone pieces (Step B9). Aspirate the fibrinogen solution gently using a 1,000 µl pipette. Add 1 ml of the bacteria-containing urine (Step C10). As negative control, incubate three Fg-coated pieces with only BSA-supplemented urine (no bacteria).Incubate the tubes under static conditions at 37 °C for 24 h (or as needed). Assessment of the catheter biofilmAfter overnight incubation at 4 °C, remove the Fg-coated plates (Step B12). Peel off the plate sealing tape. Aspirate the fibrinogen solution gently using a pipette.Add 200 µl of the bacteria-containing urine (Step C10). As negative control, incubate 8 Fg-coated wells (one column of the microplate) with only urine (no bacteria).Cover the plate with a sterile lid.",
    "Incubate the microplate tubes under static conditions at 37 °C for 24 h (or as needed). Assessment of the microplate biofilmAspirate the bacterial culture from the tube using a 1,000 µl pipette.Remove the unbound bacteria by pipetting vigorously using 1 ml of 1x PBS at room temperature. Repeat this step 3 times.Assessment of biofilm formation by colony forming units  Transfer the silicone piece with sterile forceps (from Step F2) into a 15 ml conical tube. Add 1 ml of 1x PBS. To detach the bacterial biofilm from the catheter, vortex for 30 s (maximum vortex’s speed) at room temperature. Put conical tube into the Branson ultrasonic bath for 5 min at room temperature (40 kHz frequency), and vortex for another 30 s.Take a 200 µl sample and serially dilute it with PBS (1:10).Plate dilutions on BHI agar plates.Incubate the plates at 37 °C overnight. Quantify colony forming units (Figure 3).Assessment of biofilm formation by immunostaining After washing the silicone pieces (Step F2), transfer them to a 12-well plate.Fix the silicone pieces by adding 5 ml of 10% neutralizing formalin solution for 20 min.Remove the formalinWash the pieces by adding 5 ml of PBS (repeat 3 times). All washes in this protocol are done under static conditions at room temperature unless otherwise noted.Block the pieces by adding 5 ml blocking solution for 1 h at room temperature (or at 4 °C overnight).Wash the pieces with 5 ml wash solution. Repeat this step 3 times.Add 5 ml of the primary antibody solution. Incubate for 2 h at room temperature under static conditions.Wash the pieces with 5 ml wash solution. Repeat this step 3 times.Add 5 ml of the secondary antibody solution. Cover the plate with aluminum foil (secondary antibody is sensitive to light).",
    "Incubate for 1 h at room temperature under static conditionsWash the pieces with 5 ml wash solution. Repeat this step 3 times.Transfer the pieces into a new 12-well plate.Let them dry overnight.Visualize the biofilm using the Odyssey imager (detection at 700 nm near-infrared region) (Figure 4). Colorimetric assessment of biofilm formation by crystal violet  After washing the silicone pieces (Step F2), transfer them to a 12-well plate.Let pieces air dry. Add 5 ml of 0.5% of crystal violet solution.Stain for 10 min under static conditions at room temperature.Wash the pieces with distilled water (repeat this step 3 times).Add 1 ml of 33% acetic acid to solubilize the crystal violet staining.Incubate for 15 min at room temperature under static conditions.Transfer 200 µl of the solubilized crystal violet into a new microplate.Quantify absorbance at 595 nm using a plate reader. As a blank, use the 33% acetic acid in water. Serial dilution may be required to fall into the linear range of the plate reader. Assessment of the microplate biofilm After incubation (Step E6), remove the culture by inverting the plate. Wash the unbound cells by submerging the plate in a small container full of water. Shake the plate gently and shake out the water. Repeat this step 3 times.Dry the plate by tapping gently on a paper towel to remove residual liquid.Let the plate air dry.Add 200 µl of 0.5% of crystal violet solution.Stain for 10 min under static conditions at room temperature.Rinse by submerging the plate into the container full of water. Once submerged, shake the plate vigorously, dump the liquid, and tap the plate on a paper towel to remove the residual liquid. Repeat this step 3 times.Add 200 µl of 33% acetic acid to solubilize the crystal violet staining.",
    "Incubate for 15 min at room temperature under static conditions.Transfer 200 µl of the solubilized crystal violet into a new microplate.Quantify absorbance at 595 nm using a plate reader. As a blank use the 33% acetic acid in water. Serial dilution may be required to fall into the linear range of the plate reader."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}