{
  "id": 4281,
  "origin_website": "Bio",
  "title": "Neuron Culture from Mouse Superior Cervical Ganglion",
  "procedures": [
    "Note: All solutions and equipment coming into contact with cells must be sterile. Aseptic technique is critical throughout the procedure; thus, dissection taking place in a tissue culture hood modified for the use of a stereoscopic microscope may yield the best results.    Preparation of glass coverslips   Place coverslips in ceramic racks and rinse with water. Clean in concentrated nitric acid for 48 h in fume hood.    Remove coverslips from acid and soak in MilliQ water for 1 h. Repeat three times.   Cover racks in foil and place in hot air sterilization oven at 200 °C overnight.   Place coverslips together in one 150 mm plastic Petri dish. Add ~50 ml of a filter-sterilized solution of 1 mg/ml poly-D-lysine (PDL) in borate buffer and leave overnight at RT.   Rinse with sterile MilliQ water for 1 h. Repeat three additional times.   Transfer individual coverslips to 35 mm or 6-well TC plates. Let dry completely.  Note: Dried PDL-coated slips can be stored for weeks at 4 °C in sterile conditions.   Apply ~400 μl laminin (10 μg/ml in sterile PBS) to coverslips intended for immediate use and incubate at 4 degrees until plating (≥ 4 h). Ensure that laminin doesn’t wick off the slips by centering them in the plates. 30 min before plating cells, place coverslips with laminin in tissue culture hood to bring to room temperature. Rinse slips 3 times with sterile PBS at room temperature. Do not allow coating to dry before plating neurons.      Dissection   Euthanize pregnant female and remove string of embryos or gather postnatal pups and euthanize in accordance with the requirements of your Institutional Animal Care and Use Committee. Place the pups or embryos in 100% ethanol to sterilize and then transfer to sterile PBS. In the case of embryos, placenta and other tissue can be removed in PBS.",
    "Allow pups or embryos to dry in a sterile 100 mm Petri dish.   Decapitate pups/embryos into L15 remembering to clip the tails and reserve for later digestion if genotyping of animals is desired. The SCG are located in the bifurcation of the carotid arteries bilaterally coursing through neck region of the animal; decapitate animals as close to the “shoulder” area as possible to ensure full capture of the SCG (Figure 1A).   Place the head with the cut surface up on a sterilized rubber dissection plate. Pin the head in place using two 26 gauge needles and flush with sterile PBS to clear the dissection field for viewing (Figure 1B).   Under a stereoscopic microscope, locate the remnant of the common carotid artery and follow it deep into the head until the bifurcation is clearly seen. The SCG is stereotypically found at this junction between the internal and external carotid arteries and can be distinguished as a white to translucent, discrete spindle-shaped mass (Figure 1C-D). Often a large nerve can be seen branching from the superior aspect.   Scoop beneath the SCG with fine forceps to gently remove the ganglion in one piece and place in a labeled plate with L15.   Remove any excess tissue and debris from ganglia and place at 4 °C until dissociation. Note: Intact SCG can be stored in sterile conditions for up to 4 days at 4 °C in L15 without appreciable loss in subsequent quality of culture.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140113/20140113062935_1328.jpg                          Figure 1. Dissection of the superior cervical ganglion from a postnatal day 0 (P0) mouse pup. A. Whole P0 pup anesthetized and sterilized before dissection. Dotted line shows approximate level for decapitation. B. Inferior aspect of the isolated head.",
    "The cut trachea (arrowhead) is visible just superior to the bilateral zones (asterisk) where the carotid arteries will be located once surrounding tissue is removed. C. The trachea has been displaced upward and excess tissue removed from the dissection field, exposing the SCG (dotted outline). D. Image showing two dissected ganglia with small remnants of surrounding tissue attached.  Scale bars = 1 mm (B, C, and D).      Dissociation and plating   Place SCG into ~500 μl collagenase enzyme solution for 30 min in 37 °C water bath. Agitate every 5-10 min.   Remove collagenase and replace with 500 μl pre-warmed 0.25% trypsin. Place in 37 °C water bath for 15-20 min, agitating every 5 min.   Remove trypsin and rinse ganglia 3 times in L15.   Replace L15 with approximately 500 μl pre-warmed regular plating medium. Triturate with reduced bore siliconized Pasteur pipets. 60-70 times should be sufficient if single cells are desired.   Transfer 500 μl of the dissociated neuron suspension to uncoated 35 mm Petri dish, keeping drop in center of plate. This pre-plating step assists in the removal of glial cells before culturing the neurons. Glial cells will adhere to the uncoated dish while neurons will remain in suspension.  Incubate 1 h in 37 °C incubator.   Recover ~500 μl of the cell suspension with pipet tip. Dish can be gently tapped on the side to ensure good recovery of dissociated cells. Neurons can be spun down at 1,000 rpm for 10 min and re-suspended in pre-warmed medium as needed for high density (e.g., 2 SCG/70 μl for a 35 mm plate) or low density (e.g., 2/3-1 SCG/70 μl for a 35 mm plate) plating.   After re-suspension, plate the cells on poly-D-lysine/laminin coated coverslips in 35 mm dishes or 6-well plates. Allow the neurons to adhere to the glass for 1.",
    "5-2 h in the incubator, then add 1.5-2 ml pre-warmed medium gently down the side of the dish with a serological pipet (dropwise). Incubate in 37 °C/5% CO2.   If long-term culture is desired, new medium supplemented with 2 μM cytosine arabinoside (AraC) can be added at 3 days in vitro (DIV). Change the medium every 2-4 days thereafter to eliminate non-neuronal cells. Neurons can be cultured up to 28 DIV.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140113/20140113063407_6809.jpg Figure 2. Image of cultured neurons of the superior cervical ganglion. Representative image showing neuronal class III β-tubulin (Tuj1) labeled SCG neurons at 48 h post-plating."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}