{
  "id": 2162,
  "origin_website": "Cell",
  "title": "Primary culture of tracheal aspirate-derived human airway basal stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of 804G-conditioned medium\nTiming: 10–15 days\nThis step contains information on how prepare 804G-conditioned medium from the 804G rat bladder epithelial cell line. The 804G-conditioned medium is used to coat cell culture vessels to promote airway BSC attachment (Levardon et al., 2018[href=https://www.wicell.org#bib1]).\nRemove the freezing vial (2.1 × 106 cells) from liquid nitrogen and thaw at 20°C–22°C.\nTransfer the cell solution from the freezing vial to a 15 mL conical tube and add 5 mL neutralization medium (store in 4°C until expiration date) to the tube.\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant.\nResuspend the cell pellet with 10–15 mL RPMI medium (store in 4°C until expiration date) and plate into the T75 flask.\nStore the plate into a 37°C incubator with 5% CO2 and change SAGM medium daily.\nCheck the flask carefully for proper cuboidal cell shape and cell confluency, as well as any possible contamination.\nIf the cells have a proper cuboidal shape, the flask is 90% confluent, and there is no contamination, proceed to step 8.\nIf the cells are not confluent enough, change SAGM medium and check the flask in 24 h.\nDiscard the SAGM medium from the T75 flask and add 5 mL 0.5% Trypsin to the T75 flask.\nThere is no need for a PBS wash.\nIncubate the flask at 37°C until the cells dissociate from the flask (5–10 min).\nIf the cells have not dissociated after 5 min, lightly tap the side of the flask to force dissociation.\nCheck under the microscope to confirm that the cells have completely dissociated from the flask.\nTransfer the cell suspension to a 15 mL conical tube and add 7 mL neutralization medium to the tube.",
    "Centrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant, resuspend the cell pellet with 10–15 mL SAGM medium (store in 4°C until expiration date), plate into a T175 flask.\nStore the plate into a 37°C incubator with 5% CO2.\nTo grow and maintain the cells in culture, change SAGM medium 1 day after seeding and every other day thereafter.\nMonitor the flask for proper cuboidal cell shape and any possible contamination every day.\nCheck the flask under a 5×, 10×, 20×, and 40× magnification to better visualize the cells and detect contamination.\nOnce confluency is reached, add 60 mL RPMI medium to the T175 flask and change media every other day for 8 days.\nCritical: After every 2 days, collect the supernatant — this is the 804G-conditioned medium. Sterilize the supernatant with 0.22 μm vacuum filter and store at 4°C for up to 1 month or −20°C for up to 1 year.\nIsolation of airway BSCs from human TA samples\nTiming: 15–20 min\nThis step contains information on how to isolate airway BSCs from human TA samples collected in mucus traps and maintain them in culture.\nNote: This protocol yields best results when the TAs are freshly isolated. These samples can also be stored at 4°C for up to 24 h after collection, but efficiency decreases over time. If possible, use a separate hood from regular cell culture work for TA isolation to reduce the risk of contamination for the other samples in culture.\nOptional: Before proceeding with the protocol, if the sample has an abundance of mucus, treat with 5 mL 0.1 mg/mL DTT in 1×PBS (from 10 mg/mL stock DTT solution). Incubate for 5 min at 20°C–22°C under the hood.",
    "Add 1×PBS to the mucus trap until the 5 mL mark to dilute the sample. Mix well using a 1 mL pipette.\nUsing sterilized forceps, place the 70 μm cell strainer on top of a 50 mL conical tube and lubricate with 2 mL PBS.\nCarefully pipette the sample from the mucus trap through the 70 μm cell strainer to the 50 mL conical tube (1 mL at a time).\nDiscard the cell strainer and centrifuge the sample at 1,500 × g for 5 min at 20°C–22°C.\nDiscard the supernatant and the 804G-conditioned medium from the pre-coated T25 flask.\nOptional: If the sample contains too many erythrocytes (indicated by a red cell pellet), a red blood cell lysis buffer may need to be used. Under the hood, add 1 mL of the red blood cell lysis buffer and incubate for 5 min at 20°C–22°C. Centrifuge the sample at 1,500 × g for 5 min at 20°C–22°C and discard the supernatant.\nOptional: EpCAM selection of airway BSCs can be utilized to purify the cells that will be plated. Refer to the “EpCAM selection of airway BSCs from human TA samples[href=https://www.wicell.org#sec3.3]” protocol for directions on purification.\nResuspend the cell pellet with 5 mL SAGM medium and plate into the T25 flask.\nNote: The pellet can also be frozen down directly and stored in liquid nitrogen until isolation, but this decreases efficiency of BSC derivation.\nStore the plate into a 37°C incubator with 5% CO2.\nTo grow and maintain the cells in culture, change SAGM medium 1 day after isolation and every other day thereafter.\nMonitor the flask for proper cuboidal cell shape and any possible contamination every day.\nCheck the flask under a 5×, 10×, 20×, and 40× magnification to better visualize the cells and detect contamination.",
    "See Figure 1[href=https://www.wicell.org#fig1]A for a time course of BSC cultures after isolation and Figure 1[href=https://www.wicell.org#fig1]B for a P63 (BSC marker) staining in culture.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1640-Fig1.jpg\nFigure 1. Human airway BSCs isolated from TA samples\n(A) Representative images of BSC cultures 1, 2, 7, and 14 days after isolation and EpCAM+ selection. Scale bar, 100 μm.\n(B) P63 (basal stem cell marker) staining of patient-specific TA-derived BSCs in culture. Scale bar, 100 μm.\nEpCAM selection of airway BSCs from human TA samples\nTiming: 2 h\nThis step contains information on how to purify and enrich the human TA sample using EpCAM magnetic bead selection to target and isolate airway BSCs.\nAfter centrifugation, remove the supernatant and gently resuspend the cell pellet with 80 μL MACS buffer (store in 4°C until expiration date).\nAdd 2 μL biotin-conjugated EpCAM antibody and mix the solution by horizontal hand shaking and incubate at 20°C–22°C under the hood for 30 min.\nAdd 2 mL MACS buffer and centrifuge at 1,200 × g for 5 min.\nDiscard the supernatant and gently resuspend the cell pellet with 80 μL MACS buffer.\nAdd 20 μL anti-biotin magnetic microbeads and mix the solution by horizontal hand shaking and incubate at 20°C–22°C under the hood for 15 min.\nDuring the incubation period, set up the MACS column apparatus under the hood. Place a 15 mL conical tube underneath the MACS column for collection.\nNote: Refer to Graphical Abstract step 2 to see the appropriate setup for the MACS column apparatus.\nCritical: Use sterilized forceps and careful aseptic technique as this is the step that has the most risk of contamination. Avoid contact with the plunger tip, as this is the region most susceptible to introducing contamination.\nAdd 1.5 mL MACS buffer to the cells and mix gently.",
    "Add 500 μL MACS buffer to the column for initial lubrication.\nAfter about 80% of the initial lubrication MACS buffer has been filtered, add 500 μL cell mixture at a time to the MACS column and allow the solution to flow through to the 15 mL tube. Each time, wait until 80% of the solution is filtered before adding the next 500 μL. Repeat 2 more times until all 1.5 mL solution is filtered.\nNote: The cells in the flowthrough are the EpCAM- cells.\nAfter all the solution has flowed through, quickly detach the column from the magnet and place it on top of a new 15 mL conical tube.\nCritical: In one motion, add 500 μL 1× PBS to the top of the column and immediately push the plunger down to release the solution into the 15 mL conical tube.\nNote: The cells in the flowthrough are the EpCAM+ cells.\nPassaging human TA-derived airway BSCs\nTiming: 15–20 min\nThis step contains information on how to pass human TA-derived airway BSCs from a T25 flask to a T75 flask when 90% confluency is reached and maintain them in culture. See Figure 2[href=https://www.wicell.org#fig2]A for examples of healthy vs. non-healthy BSC cultures.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1640-Fig2.jpg\nFigure 2. Human airway BSCs expanded in culture and seeded in ALI differentiation culture\n(A) Representative images of healthy vs. non-healthy BSC cultures. Scale bar, 100 μm.\n(B) Representative images of healthy vs. non-healthy BSC ALI differentiation cultures. Scale bar, 100 μm.",
    "Note: It is important to note that the proliferative capacity and differentiation efficiency of human TA-derived airway BSCs likely decreases after every passage. For functional assays and omics analysis, it is best to use airway BSCs before passage 5. Additionally, while this protocol is specific to passaging from a T25 flask to a T75 flask, this general concept can be applied to passaging between any two cell culture vessels. Refer to Table 1[href=https://www.wicell.org#tbl1] for the exact measurements for the most common cell culture vessels.\nCheck the flask carefully for proper cuboidal cell shape and cell confluency, as well as any possible contamination.\nIf the cells have a proper cuboidal shape, the flask is 90% confluent, and there is no contamination, proceed to step 34.\nIf the cells are not quite confluent enough, check the flask in 24 h.\nDiscard the SAGM medium from the T75 flask and add 2 mL 0.5% Trypsin.\nThere is no need for a PBS wash.\nIncubate the flask at 37°C until the cells dissociate (5–10 min).\nIf the cells have not dissociated after 5 min, lightly tap the side of the flask to force dissociation.\nCheck under the microscope to confirm that the cells have completely dissociated from the flask.\nTransfer the cell suspension to a 15 mL conical tube and add 4 mL neutralization medium to the tube.\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant and the 804G-conditioned medium from the T75 flask.\nResuspend the cell pellet with 10–15 mL SAGM medium and seed into the T75 flask.\nStore the plate into a 37°C incubator with 5% CO2.\nTo grow and maintain the cells in culture, change SAGM medium 1 day after seeding and every other day thereafter.",
    "Monitor the flask for proper cuboidal cell shape and any possible contamination every day.\nCheck the flask under a 5×, 10×, 20×, and 40× magnification to better visualize the cells and detect contamination.\nDifferentiation of human airway BSCs using the air-liquid interface (ALI) and sample preparation for cryosectioning\nTiming: 23–25 days\nThis step contains information on how to seed human TA-derived airway BSCs from a T75 flask into ALI culture for differentiation for 21 days, maintain them in culture, and prepare the sample for cryosectioning.\nBefore beginning, coat the 24-well inserts with 400 μL 804G-conditioned medium.\nCheck the flask carefully for proper cuboidal cell shape and cell confluency, as well as any possible contamination.\nIf the cells have a proper cuboidal shape, the flask is 90% confluent, and there is no contamination, proceed to step 43.\nIf the cells are not quite confluent enough, change SAGM medium and check the flask in 24 h.\nDiscard the SAGM medium from the T75 flask and add 5 mL 0.5% Trypsin.\nThere is no need for a PBS wash.\nIncubate the flask at 37°C until the cells dissociate from the flask (5–10 min).\nIf the cells have not dissociated after 5 min, lightly tap the side of the flask to force dissociation.\nCheck under the microscope to confirm that the cells have completely dissociated from the flask.\nTransfer the cell suspension to a 15 mL conical tube and add 7 mL neutralization medium to the tube.\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant and resuspend the pellet with 1 mL SAGM medium.\nAliquot 10 μL of the cell suspension and count the cells using a hemocytometer. Dilute the cells in SAGM medium to 1 × 106 cells/mL.\nRemove the 804G-conditioned medium from each pre-coated insert.",
    "Seed 300 μL of the cell suspension (3 × 105 cells) to the insert. Add 150 μL SAGM medium to the insert and add 750 μL SAGM medium to the well.\nThe total volume in the insert should be 400 μL and the total volume in the well should be 750 μL.\nRefer to Table 2[href=https://www.wicell.org#tbl2] for an example of ALI Seeding Calculations.\ntable:files/protocols_protocol_1640_9.csv\nNote: For a 12-well insert, seed 500 μL of the cell suspension (5 × 105 cells) to the insert and add 1 mL SAGM medium to the well. The total volume in the insert should be 500 μL and the total volume in the well should be 1 mL.\nStore the plate into a 37°C incubator with 5% CO2.\nTo freeze the remaining cells, refer to the “freezing human TA-derived airway BSCs[href=https://www.wicell.org#sec3.6]” protocol.\nThe day after seeding, check under the microscope to see if the cells are confluent in the insert.\nIf they are not confluent, refeed the cells with SAGM medium (400 μL SAGM medium to the insert and add 750 μL SAGM medium to the well) and check again the next day.\nIf they are confluent, replace the SAGM medium with PneumaCult medium with inhibitors (400 μL to the insert, 750 μL to the well).\nNote: Add 500 μL PneumaCult medium with inhibitors to the insert and 1 mL to the well for a 12-well insert.\nThe day after the exchange of the medium to PneumaCult, remove the medium from the insert and from now on, only apply medium to the well.\nChange medium every day for the first 7 days.\nFrom days 7–21, change medium every other day.",
    "Critical: For the first 7 days, use PneumaCult medium with inhibitors. For the last 14 days, use PneumaCult medium without inhibitors (store in 4°C until expiration date). This is more important for cilia functional analysis, but less important for differentiation, as the inhibitors compromise cilia motility if treated for an extended period of time in culture.\nOptional: On days 14 and 21, perform an apical PBS wash to remove excess mucus. Add 400 μL sterile 1× PBS to the insert and incubate in a 37°C incubator with 5% CO2 for 30 min. After incubation, carefully remove the PBS from the insert without touching the membrane. Touching the membrane can result in cell detachment.\nNote: See Figure 2[href=https://www.wicell.org#fig2]B for examples of healthy vs. non-healthy BSC ALI cultures. Cell detachment is signified by holes in the membrane, as seen in the non-healthy BSC ALI culture.\nOn day 21 of differentiation, remove the medium and add 400 μL 4% PFA in 1× PBS to the insert and 750 μL 4% PFA in 1× PBS to the well for cell fixation. Incubate for 20 min in the dark under the hood.\nWash 3 times for 5 min with 1 mL 1× PBS in the insert and well.\nNote: Proceed to step 56 for immediate sectioning. The inserts can also be stored in 1× PBS in 4°C for later processing.\nUsing a scalpel and blunt forceps, carefully cut half of the membrane from the bottom of the insert transfer it into a 1.5 mL microcentrifuge tube.\nNote: Only touch one corner of the membrane while handling to prevent cell detachment.",
    "Pause point: The other half of the membrane can be stored in 1× PBS in 4°C for sectioning at a later time. These membranes can be stored for up to a year in the 4°C without any negative effects on sectioning and staining.\nIncubate the membrane in 10%, 15%, and 20% sucrose in 1× PBS on ice for 1 h each.\nIncubate the membrane in 1:1 20% sucrose:OCT in 4°C for 10 h.\nAdd 1:3 20% sucrose:OCT to halfway fill a cryomold on dry ice.\nNote: While loading the cryomold with 1:3 20% sucrose:OCT, it is important to avoid loading bubbles, as they can prevent quality sectioning.\nOnce the solution turns opaque, place the membrane flat on top, noting its orientation.\nNote: It is important for the cryomold to be completely flat on the dry ice to prevent sample misorientation while the OCT solidifies.\nAdd 1:3 20% sucrose:OCT to fill the rest of the cryomold and incubate for 15 min or until solid.\nPerform cryosectioning.\nFreezing human TA-derived airway BSCs\nTiming: 15–20 min\nThis step contains information on how to freeze human TA-derived airway BSCs from a T75 flask when 90% confluency is reached.\nCheck the flask carefully for proper cuboidal cell shape and cell confluency, as well as any possible contamination.\nIf the cells have a proper cuboidal shape, the flask is 90% confluent, and there is no contamination, proceed to step 64.\nIf the cells are not quite confluent enough, change SAGM medium and check the flask in 24 h.\nDiscard the SAGM medium form the T75 flask and add 5 mL 0.5% Trypsin.\nThere is no need for a PBS wash.\nIncubate the flask 37°C until the cells dissociate from the flask (5–10 min).",
    "If the cells have not dissociated after 5 min, lightly tap the side of the flask to force dissociation.\nCheck under the microscope to confirm that the cells have completely dissociated from the flask.\nTransfer the cell suspension to a 15 mL conical tube and add 7 mL neutralization medium to the tube.\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nResuspend the pellet with 1 mL SAGM medium.\nAliquot 10 μL of the resuspension and count the cells using a hemocytometer. Calculate the number of freezing vials required according to Table 2[href=https://www.wicell.org#tbl2].\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant and resuspend in the appropriate volume of freezing medium to reach 1 million cells per 1 mL.\nAliquot 500 mL of the resuspended solution into each freezing vial.\nPlace each freezing vial in the Mr. Frosty and into −80°C for 12 h.\nTransfer cells from the Mr. Frosty to liquid nitrogen the next day.\nPause point: TA BSCs can be stored in liquid nitrogen for long period of time.\nThawing human TA-derived airway BSCs\nTiming: 5–10 min\nThis step contains information on how to thaw human TA-derived airway BSCs from liquid nitrogen to a T25 flask.\nRemove the freezing vial from liquid nitrogen and thaw at 20°C–22°C.\nTransfer the cell solution from the freezing vial to a 15 mL conical tube and add 5 mL neutralization medium to the tube.\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant and the 804G-conditioned medium from the pre-coated T25 flask.\nResuspend the cell pellet with 5 mL SAGM medium and plate into the T25 flask.\nStore the plate into a 37°C incubator with 5% CO2.\nImmunofluorescence staining of human TA-derived airway BSCs",
    "Timing: 2 days\nThis step contains information on how to perform immunofluorescent characterization of cultured human TA-derived airway BSCs on coverslips from a frozen vial in liquid nitrogen.\nUsing sterilized forceps, gently place the coverslip to the 24-well plate.\nNote: In most cases, there is a specific cell culture-treated side for the coverslip. Ensure that this is the side facing up when the coverslip is placed in the well.\nRemove the freezing vial from liquid nitrogen and hand-thaw.\nTransfer the cell solution from the freezing vial to a 15 mL conical tube and add 5 mL neutralization medium to the tube.\nCentrifuge the sample at 1,200 × g for 5 min at 20°C–22°C.\nDiscard the supernatant. And resuspend the pellet with 1 mL SAGM medium.\nAliquot 10 μL of the resuspension and count the cells using a hemocytometer. Calculate the volume of suspension required for each well. Refer to Table 1[href=https://www.wicell.org#tbl1] for exact seeding measurements.\nAliquot the calculated volume of suspension to a separate 15 mL conical tube.\nRemove the 804G-conditioned medium from the pre-coated well.\nAliquot the appropriate volume of the resuspension for each well and seed. Add enough SAGM medium to the well to make a total volume of 1 mL.\nNote: To freeze the remaining cells, refer to the “freezing human TA-derived airway BSCs[href=https://www.wicell.org#sec3.6]” protocol.\nTo grow and maintain the cells in culture, change SAGM medium 1 day after seeding and every other day thereafter.\nMonitor the flask for proper cuboidal cell shape and any possible contamination every day.\nCheck the flask under a 5×, 10×, 20×, and 40× magnification to better visualize the cells and detect contamination.\nOnce the coverslip is 90% confluent, fix the cells on the insert using 1 mL 4% PFA in 1× PBS for 15 min.",
    "Wash with 1× PBS for 5 min twice.\nNote: The plate can now be taken out of the cell culture hood, as it no longer needs to be handled under aseptic conditions.\nContinue with the standard protocol for immunofluorescence staining: blocking (blocking buffer can be stored in 4°C until expiration date), primary antibody, secondary antibody, and DAPI/any other nuclear stain.\nOnce the staining protocol is complete, add a drop of Fluoromount-G to a microscope slide.\nNote: Other mounting reagents, such as xylene-based reagents, can also be used.\nUse forceps and a pipette tip to carefully transfer the coverslip from the 24-well plate onto the microscope slide for imaging.\nNote: Ensure that the cell culture-treated side is placed down onto the microscope slide.\nAllow the coverslip to dry completely before imaging.\nNote: Before imaging, you may need to wipe the coverslip with a wet paper towel to eliminate any salt precipitate (as a result of the final PBS wash)."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Cell Biology",
    "Cell Isolation",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}