{
  "id": 2516,
  "origin_website": "Cell",
  "title": "Protocol to detect in vitro and in cell ubiquitylation of mitochondrial DNA polymerase gamma by mitochondrial E3 ligase MITOL",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn vitro ubiquitylation assay of PolγA\nTiming: 3 days\nThe following protocol uses Ube1 (as the E1), UbcH5a (as the E2), MITOL (as the E3) and PolγA (as the substrate) in presence of ATP (in concentration mentioned above in the in vitro ubiquitylation assay buffer) and ubiquitin.\nIt is essential to determine the exact concentrations of lab purified recombinant proteins MITOL (WT and CD). For this purpose, the two lab purified recombinant proteins were electrophoresed in SDS-PAGE. In the same SDS-PAGE gel, known amounts of Bovine Serum Albumin (BSA) protein were also electrophoresed. The entire gel was stained by Coomassie. The exact concentrations of MITOL WT and MITOL CD were determined by comparing the relative intensity of their bands with the bands of the BSA gradient using a densitometer. Instead of BSA any other easily available marker proteins can also be used.\nNote: While a range of BSA (1 μg–5 μg) as standard was used to measure protein concentrations of MITOL WT and MITOL CD, this range of BSA standards may have to be varied depending on the concentration of the purified proteins.\nPerform in vitro ubiquitylation assay.\nPrepare in vitro ubiquitylation assay mix as follows:\ntable:files/protocols_protocol_2023_8.csv\nNote: Advantage of using In vitro transcription cum translation system (TNT) is that it mimics eukaryotic transcription and translation with post-translational modifications on target protein. If the ubqituitylation of target protein is post translational modification dependent, then it is preferable to use TNT produced target proteins. Alternatively, E.coli purified recombinant proteins can also be used.\nIncubate the mix at 30°C for 2 h with mild shaking in a temperature-controlled mixer or circulating water bath.",
    "Add 20 μL of 2×SDS loading dye to stop the reaction. Mix well and boil the sample in boiling water or heat block (at 100°C) for 10 min.\nBriefly spin down the samples and separate them on 10% SDS PAGE gel.\nAnalyze ubiquitylation of substrate protein by Western blot using an antibody against Ubiquitin. To determine that under all conditions equal amounts of PolγA (WT or K1060R) was used an anti-PolγA blot also needs to be done.\nNote: 1. If PolγA is ubiquitylated, it will be detected as a smear above 150 kDa. Equal levels of the substrate protein (i.e., PolγA) should also be visualized in western blot (Figure 1[href=https://www.wicell.org#fig1]).\nNote: 2. The above in vitro ubiquitylation protocol has used recombinant wildtype ubiquitin. To determine the ubiquitin linkages, specific commercially available antibodies or affimers are to be used. Alternately commercially available recombinant ubiquitin mutants can also be used.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2023-Fig1.jpg\nFigure 1. MITOL ubiquitylates PolγA in vitro\nIn vitro ubiquitylation was carried out using in vitro transcribed and translated PolγA (WT and KK1060R) as the substrate and recombinant wildtype (WT) or catalytically dead (CD) MITOL. (Top panel) Post-reaction, The ubiquitylated products were detected by carrying out Western blot analysis with anti-Ub (P4D1) antibody. (Bottom panel) Equal amounts of substrates used in each condition was determined by carrying out westerns with anti-PolγA antibody. This figure is reproduced from (Hussain et al., 2021[href=https://www.wicell.org#bib2]) where it was presented as Figure S3A.\nIn cell ubiquitylation assay of PolγA\nTiming: 3 days\nThe following protocol is a detailed procedure to analyze the in cellulo ubiquitylation of PolγA using the transient transfection method in HEK293T cells. Following steps are performed in laminar air flow hood.\nPlasmid transfection.",
    "Seed 0.1 × 106 HEK293T cells in a 6 well cluster plate 24 h before transfection. Grow the cells in a 37°C incubator having 5% carbon dioxide.\nNext day the cells should be in 60%–70% confluent. Pre-warm Opti-MEM media; keep the plasmids and lipofectamine reagents ready for transfection.\nAdd 250 μL Opti-MEM in Tube A.\nAdd 1 μg Flag-PolγA, 1 μg Myc-MITOL WT and MITOL CD and 100 ng His-Ubiquitin plasmids to Tube A and mix well.\nAdd 250 μL Opti-MEM to Tube B.\nAdd a 1:3 ratio of Lipofectamine 2000 to Tube B and mix well and incubate the reaction at room temperature for 5 min (For example, if 2.1 μg of total plasmid per well is used in Tube A, the Lipofectamine 2000 to be used in Tube B will be 6.3 μL per well).\nTransfer Tube B solution to Tube A (hence total volume total 500 μL) and mix well.\nIncubate the reaction at room temperature inside the hood for 25 min. Meanwhile, aspirate complete media from 6 wells in the cluster plate and add 1.5 mL Opti-MEM to the wells.\nAdd plasmids-Lipofectamine 2000 complex to the cells (total 500 μL/well). Gently swirl and return the plate to the CO2 incubator.\nAfter 6 h remove the Opti-MEM from the wells and replace it with complete media (2 mL/well) and put back the cells in the incubator.\nPrepare the lysate from the cells 24 h post-transfection.",
    "Note: Steps mentioned here are for transfection of three different plasmids in a single well. Make sure to add proper controls for this experiment like His-Ubiquitin alone, His-Ubiquitin with E3 ligase without substrate and all three together. If the protocol is being adapted for other substrates or other E3 ligases, the amounts of plasmids to be transfected, the ratio of the plasmid to Lipofectamine 2000 and the time of incubation for the expression of proteins will have to be standardized. Certain E3 ligases ubiquitylate substrate protein and target the substrate for degradation. Hence, it is important to check different time points after transfection. Alternatively, the cells should be grown in presence of 10 μM of MG132 (a proteasome inhibitor) for the final 5 h of cell growth before lysates were prepared. This treatment will inhibit proteasomal degradation of the target protein.\nLysate preparation.\nAspirate the media and wash the cells twice with 2 mL of ice-cold 1×PBS.\nAdd 200 μL/well of M2 lysis buffer supplemented with 1× protease inhibitor cocktail (from 100× stock as recommended by the manufacturer) and PMSF (1 mM) to the cells.\nScrape and transfer the cells from each well to one tube.\nVortex at high speed for 30 s.\nIncubate on ice for 10 min.\nCentrifuge the sample at 17,000 × g, 4°C for 10 min.\nTransfer the supernatant to a fresh prechilled tube and label it as cell lysate.\nNote: Aliquoting is the preferred option for the storage of the supernatant. Ideally 50 μL aliquots should be made. A part of the supernatant (around 5–10 μL can be kept aside for protein estimation at this stage). Cell lysates can be stored for up to one month at −80°C. Avoid multiple freeze-thaw cycles. Not more than three freeze thaw cycles should be done.",
    "Check the protein concentration using Bradford or BCA protein estimation method.\nConfirm expression of the proteins by Western blot before proceeding to immunoprecipitation.\nWestern blot to check for PolγA expression in the lysates.\nCells of each well were processed separately and equal amounts (typically 40–60 μg) of cell lysates were run in the 10% SDS-PAGE gel.\nThe proteins were transferred onto the nitrocellulose membrane using Bio-Rad transfer apparatus using an overnight wet transfer protocol (at 40 mA per gel for 16 h).\nThe membrane was blocked using 5% skim milk in 1× TBS + 0.1% Tween 20 and incubated in anti-Flag (1:1,000 dilution) or anti-Myc antibody (1:1,000 dilution), overnight with gentle rocking at 4°C. Substrate specific, anti-PolγA antibody can also be used to detect the levels of overexpressed PolγA.\nNext day, the blots were incubated in respective secondary antibodies (1:20,000 dilution) for an hour with gentle rocking at room temperature.\nThe blots were washed and developed using an immobilon western chemiluminescent HRP substrate (from Millipore). Substitutes of the chemiluminescent HRP substrate are also available with Merck and Cell Signaling Technologies.\nImmunoprecipitation followed by Western blot to detect ubiquitylated PolγA.\nFor each reaction, equilibrate 5 μL of anti-Flag M2 affinity gel along with 10 μL of Sepharose CL6B (acting as inert support beads) in 500 μL M2 lysis buffer for 5 min.\nNote: Sepharose CL6B beads are recommended to be used along with the anti-Flag M2 affinity beads. Sepharose CL6B beads are used to visualize the Flag beads since anti-Flag affinity beads are translucent and it is hard to visualize the pellet during the aspiration step later in the protocol.",
    "Add the equilibrated anti-Flag M2 affinity beads and Sepharose CL6B into 100 μg–300 μg of cell lysates (the amount of cell lysate will depend on the level of expression of the PolγA as seen in via Western blot). This must be standardized if other substrates are used. Make up the volume to 500 μL using M2 lysis buffer.\nIncubate the sample at 4°C on an end-to-end rotor for 2 h.\nAfter incubation, wash the beads three times at 226 × g, 4°C with 1 mL of chilled M2 lysis buffer.\nRemove the supernatant completely without disturbing the beads. Add 10–20 μL of 2× SDS loading dye to the sample. Boil in boiling water for 10 min (a heating block can also be used).\nNote: The buffer removed in this step can be stored. In case the immunoprecipitation is not optimal – then the supernatant should be check for the unbound protein. In case the Flag tagged PolγA, is not immunopurified optimally, the pH of the M2 lysis buffer should be re-checked and/or the amount of anti-Flag M2 affinity gel increased to 7.5 μL or 10 μL per reaction.\nSeparate immunoprecipitated samples along with a pre-stained protein marker on 10% SDS PAGE gel (SDS-PAGE gel was electrophoresed at 30 mA and gel was run out till 18 kDa protein to allow the visualization of the high molecular weight PolγA and its ubiquitylated forms). The proteins in the gels were transferred to a 0.45 μM nitrocellulose membrane (Bio-Rad).\nFor Western blot, block the membrane using 3% skim milk powder in 1×TBS+ 0.1% Tween 20 for approximately one hour at room temperature with gentle shaking.",
    "Use anti-Flag antibody (1:2,000 in 1×TBS + 0.1%Tween 20) antibody to detect the polyubiquitylation of PolγA. Alternately anti-PolγA or anti-Ubiquitin antibodies (both at 1:1,000 in 1×TBS+0.1%Tween20) could have been used to detect the polyubiquitylation of PolγA. Incubate the membranes with either of the antibodies at 4°C with gentle shaking overnight.\nWash the membranes three times with (1×TBS+0.1%Tween 20).\nIncubate washed membranes with HRP-conjugated secondary antibodies (1:20,000 in 1×TBS+0.1%Tween 20) (details in key resources table[href=https://www.wicell.org#key-resources-table]) for 1 h at room temperature with gentle rocking.\nWash the blots three times and develop using an immobilon western chemiluminescent HRP substrate (details in key resources table[href=https://www.wicell.org#key-resources-table]).\nAfter developing all the blots, the membrane was washed for 2 h with 1×TBS+0.1%Tween20 (every wash 15 min duration). Alternately the blot can be stripped with a commercially available stripping buffer (detailed in the key resources table[href=https://www.wicell.org#key-resources-table]) for 15 min at 37°C. In either case the blot was incubated only with the HRP-conjugated secondary antibody and the blot was developed to detect the antibody light chain. The light chain was probed to determine whether equal amount of antibody was used for each immunoprecipitation reaction.\nNote: In cellulo ubiquitylation of FLAG-tagged PolγA is detected by using anti-Flag antibody (Figure 2[href=https://www.wicell.org#fig2]). For PolγA we have also detected its ubiquitylated form using a substrate specific PolγA antibodies (detailed in Recourse table). However, not all the target-specific antibodies can detect the ubiquitylated forms. Hence it is important to try multiple antibodies against the substrate being tested. Alternatively, anti-ubiquitin-specific antibodies can be used. While P4D1 has been successfully tested for PolγA, other anti-ubiquitin which may be recommended are FK1 and FK2.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2023-Fig2.jpg\nFigure 2. MITOL ubiquitylates PolγA in cellulo",
    "(Top) Whole cell extracts were made from HEK293T cells transfected with His-tagged Ubiquitin (His-Ub), wildtype (WT) or catalytically dead (CD) Myc-tagged PolγA (Flag PolγA). Using the extracts western blots were carried out with antibodies against Flag, Myc tag and hsp60. Expression of hsp60 was monitored for equal protein loading control. (Bottom) Immunoprecipitations were carried out using anti-Flag beads. The immunoprecipitates were probed with antibody against Flag. Both ubiquitylated Flag-PolγA and the non-ubiquitylated Flag-PolγA have been indicated. The light chain was probed to show that equal amount of antibody was used for each immunoprecipitation reaction. This figure is reproduced from (Hussain et al., 2021[href=https://www.wicell.org#bib2]) where it was presented as Figure 2B."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}