{
  "id": 3253,
  "origin_website": "Cell",
  "title": "Protocol for neonatal respiratory syncytial virus infection in mice and immune analysis of infected lungs and bronchoalveolar lavage fluid",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSetting up the work bench\nTiming: 0.5 h\nThese steps will help prepare the work bench for intranasal infection (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2819-Fig1.jpg\nFigure 1. Anesthesia setup\n(A) Set up the anesthesia machine on the left adjacent to the air flow cabinet if you are right-handed.\n(B) Set up a 3× magnification LED lamp inside the right side of the hood with appropriate pipette controller.\n(C) Set up the small animal heating pad right in front of the lamp and nose cone in the back. Additionally, you can make paper towel V- shape huts if the air flow cabinet is too cold and use it to protect neonates from direct air exposure to cold air until they wake up.\n(D) Visual of complete anesthesia setup.\nCritical: Follow the BSL-2 safety procedure when you enter the room. All the locations mentioned below will make your work easy, but it is not mandatory. You might have to work the other way around if you are left-handed.\nSetup the isoflurane machine outside of the hood. Preferably on the left side.\nPlace the anesthesia chamber inside the hood (on the left).\nPlace the small animal heating pad on the middle (front) of the hood and connect it to the electric port.\nSetup the nose cone in the middle (back) of the heating pad.\nPlace the infectious agent (RSV-A2) on the back right of the hood inside the mini cooler.\nSetup the pipettor, tips, waste container and animal markers on the right of the bench.\nPlace the lamp with the magnification glass (3× zoom preferred) near the heating pad and nose cone.\nPlace the mouse cage on the left back behind the anesthesia chamber.\nMark neonates according to your treatment group and take weight before you start the next step.",
    "Critical: RSV aliquot should be kept in a cold container like dry ice or mini cooler all the time. Only thaw 1 vial every time before you inoculate.\nAnesthesia and intranasal inoculation with RSV\nTiming: 2.5 h\nThese steps will guide you through neonatal anesthesia procedure and handling of neonates during the pre-intranasal period. The required time is for 8 neonatal intranasal inoculations.\nTurn on the anesthesia machine (details on the note below) and set it to 2.5% isoflurane in fast mode.\nUse a small anesthesia chamber as much as possible for faster effect.\nPlace a single mouse pup inside the chamber and wait for 4–5 min.\nWatch for breathing, as the pups are deeply anesthetized, they will breathe slower clearly visible in chest movement.\nLoad your sample to be inoculated on the pipette right before you take out the pup from the chamber.\nRemove the pup from the chamber and hold them right below the back of neck (dorsal) gently, keep them straight facing upward.\nWait 4–5 s and inoculate 5 μL of inoculum on the first nostril looking through a 3× magnification lensed lamp, release steadily until you see complete inoculation.\nNote: If you want to be faster for the overall experimental group this is the right time to place another neonate in the anesthesia machine before you hold another pipette with your right hand.\nWait for 4–5 s let pup stretch to take the inoculum into the lungs.\nKeep the pup in an upright position and place them in the nose cone before it wakes up but with little hold time after the inoculation.\nFor the second nostril inoculation, insert the sample dropwise every 10–15 s and keep exposing pup to nose cone for anesthesia frequently until you complete the step.",
    "Once you are finished, hold the pup for about 30 s upright in the nose cone.\nHold another 30 s without the nose cone upright.\nLet it breathe and watch for leg movement.\nNote: This final step ensures all the inoculum is gone through the nostrils.\nPlace the pup in the heating pad facing the ventral side upward until they wake up.\nCover with a boat shaped paper towel or with similar objects to avoid direct air exposure above the heating pad.\nMake sure the towel is not in direct contact with the pup.\nCritical: Heating pads are recommended. Isoflurane tends to cause hypothermia.5[href=https://www.wicell.org#bib5] Since these are small neonates, heating pads will help neonates survive better and recover faster. Also, these neonates really like to stay in the heating pad longer when recovering from anesthesia.\nNote: Regarding anesthesia details, VetEquip RC2 Machine and Tec 3 Isoflurane Vaporizer were used to place the mice under general anesthesia. Mice were induced in a small chamber at 2.5% isoflurane set at oxygen flow of 1 mL/circuit flow and transferred into a nose cone mask set at 2.5% isoflurane with 1 mL/circuit flow of oxygen.\nAlternatives: Other anesthesia machines can be used as a replacement, but it might need adjustment of the flow rate and the chamber size for faster anesthesia effects.\nDaily weight monitoring\nTiming: 0.5 h\nThese steps will guide you through neonatal weight monitoring and calculations. Approximate time required is calculated for 8 neonatal weight monitoring.\nSet up the weight balance inside the hood.\nWeigh each neonate daily.\nCalculate the percent weight change/gain.\nSet the weight of infection day (Day 0) to 100% for each neonate.\nConvert everyday weight change to percent change by using the following formula e.g., Day 10.\nC\nu\nm\nu\nl\na\nt\ni\nv\ne",
    "%\nw\ne\ni\ng\nh\nt\nc\nh\na\nn\ng\ne\n(\nf\no\nr\nD\na\ny\n10\n)\n=\n(\nW\ne\ni\ng\nh\nt\n@\nD\na\ny\n10\n/\nw\ne\ni\ng\nh\nt\n@\nD\na\ny\n0\n×\n100\n)\nPlot the graph accordingly (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2819-Fig2.jpg\nFigure 2. Weight change results\nWeight change difference between infected (Red) and uninfected (Blue) neonates in percent original weight scale on the Y-axis and number of days post infection in x- axis are shown in Mean ± SEM. Two-way ANOVA with Sidak’s post-test was used for statistical analysis to compare differences in overall weight change versus time. Significant differences between mean comparison of two groups were observed starting from 1 day post infection until day 14 post infection and are shown in asterisks. Asterisks shown in lower row in figure is for odd days and in upper row is for even days. ∗P < 0.05, ∗∗P < 0.01, ∗∗∗P < 0.01.\nNote: Weight of neonates does not decrease with the infection because they are in the developmentally active phase. However, we can observe a difference in the weight gain between infected and non-infected groups.\nWhole lung collection\nTiming: 2 h\nThese steps will guide you through neonatal euthanasia procedures for whole lung isolation used for H&E staining and plaque assay. The timing mentioned above is the approximation of required time for 8 neonate whole lung collections.\nSet up the carbon dioxide chamber and place neonate inside it to euthanize.\nTurn on the gas and manually watch for neonatal breathing inside the chamber.\nWait until the neonate completely stops breathing.\nNeonatal euthanasia usually takes longer than adults, approximately 5–8 min.\nTake neonate out and lay it over the dissection board.",
    "Open the skin in the abdomen and continue towards the neck.\nOpen the peritoneal cavity and make the incision in the diaphragm and cut the chest rib.\nSlowly remove the lower ribs and diaphragm from both sides.\nOpen the rib all the way to the neck.\nRemove thyroid gland and locate the trachea.\nSlowly remove attached tissues in the neck around the trachea.\nMove gently towards the lung lobes without damaging lobes until you detach the lung from the diaphragm.\nPlace the collected lung in the ice or directly to 10% buffered formalin.\nNext, follow the procedure for plaque assay by preparing lung homogenate by preparing tissue lysate.\nWhole lung can also be processed for H&E sectioning by collecting lung in 10% buffered formalin.\nAlternatives: Whole lung tissue can be directly lysed using 1 mL of TRIzol reagent for RNA isolation and stored at −80°C for viral load determination or by using a lysis buffer in the manufacturer provided RNA isolation kits.\nNote: For RSV plaque assay, we have followed the previously published protocol (Bouillier et al., 2019).6[href=https://www.wicell.org#bib6]\nBronchoalveolar lavage fluid (BALF) collection\nTiming: 2.5 h\nThese steps will guide you through BALF collection after neonatal euthanasia procedure (Figure 3[href=https://www.wicell.org#fig3]). The timing above is approximately the required time for 8 neonatal BALF collections.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2819-Fig3.jpg\nFigure 3. Dissection setup and BALF isolation\n(A) Set up the work bench for dissection inside the hood with required tools.\n(B) Expose the abdomen and chest all the way to trachea.\n(C) Cut peritoneum, diaphragm, and chest rib cavity all the way to the neck without disturbing lungs and trachea.\n(D) Expose lungs and trachea clearly.\n(E) Insert catheter to the trachea.\n(F) Lavage lung with BALF buffer using 1 mL syringe multiple times, keep your eyes on lung inflation (as seen in picture).",
    "(G) Collect lavage in a 1.5 mL microcentrifuge tube and place on ice.\n(H) Centrifuge the lavage and follow the BALF analysis procedure.\nTurn on the gas and wait until the neonate stops breathing.\nTake it out and lay it over the dissection board.\nOpen the skin in the abdomen and continue towards the neck.\nOpen the peritoneal cavity, make the incision in the diaphragm, and cut the chest rib.\nSlowly remove the lower ribs and diaphragm on both sides.\nRemove thyroid gland and locate the trachea.\nInsert the catheter in the trachea (22G is recommended) and lavage the lung with 200 μL BAL buffer three to four times and then transfer the fluid to the collection tube.\nRepeat step 26.f. once again.\nPlace the collected fluid in the microcentrifuge tube on ice until further processing.\nFlow cytometry analysis procedure of BALF immune cells\nTiming: 3 h\nThese steps will guide you through BALF processing for single cell flow cytometry analysis to determine the changes in immune cell population. Timing for 8 sample processing in a single experiment may vary depending on the automation.\nNote: Follow the required media/buffer preparations prior to starting the procedure that are mentioned in the materials and equipment section.\nTransfer the supernatant from the previous step to a 1.5 mL microcentrifuge tube.\nCentrifuge the BALF at 1500 rpm (× 400 g) for 5 min at 4°C and discard the supernatant.\nAlternatives: Supernatant can be used for BALF cytokine analysis if desired.\nAdd 300 μL (for each sample) of 1× RBC lysis buffer to the pellet and mix gently to remove the RBC from the pellet.\nIncubate for 10 min in ice and add 1 mL of wash buffer to the tube.",
    "Centrifuge the mixture at 1500 rpm (× 400 g) for 5 min at 4°C and discard the supernatant.\nResuspend the pellet in a 1 mL wash buffer and wash the cells one more time.\nDiscard the supernatant and resuspend the pellet in 200 μL wash buffer.\nCount the cells using trypan blue and seed up to one million cells per well in 96 well V-bottom plates.\nCentrifuge the 96 well plate at 1500 rpm (× 400 g) for 5 min at 4°C and discard the supernatant.\nResuspend the cell pellet in a premade antibody cocktail prepared using FACS staining buffer (100 μL per well) as prepared in the materials and equipment section and incubate on ice for 25 min.\nAlternatives: Cell pellets can be directly resuspended in FACS staining buffer (100 μL per well) and stained with desired panel of antibody.\nCover the plate and keep it in the dark to protect it from direct light.\nAlternatives: Use aluminum foil to cover the plate.\nAdd 100 μL FACS staining buffer to each well, centrifuge at 1500 rpm (× 400 g) for 5 min at 4°C and discard the supernatant.\nFix the cells in 200 μL of fixative buffer and transfer the cells to 5 mL FACS tubes or transfer it to 96 U-well plates in an automated plate reader enabled flow cytometer.\nGently keep FACS tube/96 U-well plate on ice until you are ready to acquire data in the flow cytometer, acquiring data on the same day of the experiment is recommended.\nMake separate templates for uninfected and infected cells (Figures 4[href=https://www.wicell.org#fig4]A and 4B) and use proper gating for your panel when you acquire the data for efficient data acquisition.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2819-Fig4.jpg\nFigure 4. Gating strategy for BALF immune analysis and expected results",
    "The gating strategy for monocytes, neutrophils, alveolar macrophages, interstitial macrophages, B cells, CD4+ T cells and CD8+ T cell populations. First gated on lymphocytes with SSC and FSC, and single cell gate by SSC-H/SSC-W and FSC-W/FSC-H. Then, live cells were selected by excluding Am Cyan positive cells. Next, CD45 positive cells for pan-leukocytes were gated, then CD11b and Siglec-F were used to differentiate Siglec-F positive cells which were again gated for CD11c and F4/80, giving us the double positive population as alveolar macrophage. On the next side, Siglec-F intermediate were gated for Ly6C and CD11c where negative cells were further gated for side scatter. High side scatter cells were selected as eosinophils. On the other side, CD11b positive cells were gated for F4/80 where positive cells were identified as interstitial macrophage and negative gate was used in Ly6G gating. Furthermore, the positive population was identified as neutrophil, and the negative population was gated using a Ly6C marker giving us Ly6Chi and Ly6C lo monocytes. On the third side, CD11b negative population was gated for B220/SSC-H, positive population was labeled as B cells, negative population was gated for CD4/CD8 gate to identify CD8 positive cells (Q1) and CD4 positive cells (Q3). (A) Uninfected, (B) RSV infected.\nVortex each sample before you take the reading in the flow cytometer, all fluorochrome in the antibody table above can be detected by Violet (405 nm), Blue (488 nm), Yellow green (561 nm), Red (640 nm) lasers.\nOnce finished recording, export the FCS file to the desired drive or location.\nAnalyze data using software that can open the FCS file.\nUse statistical analysis software together with the cell count data to create a graph for percent cells and absolute numbers.",
    "Note: RBC lysis time might need to be adjusted depending upon the experiment. Expect to optimize volume and duration of incubation. It is normal if you do not see any pellets in some samples. Make sure you aspirate out liquid completely from the microcentrifuge tube after RBC lysis. This gating strategy (Figure 4[href=https://www.wicell.org#fig4]) will help identify leukocytes such as neutrophils, alveolar and interstitial macrophage, eosinophils, monocytes, B cells, CD4+ and CD8+ T cells.\nPause point: Sometimes mice might wake up early if they are not deeply anesthetized, you can hold intranasal and put them back in the nose cone after the first inoculation. Don’t place them back in the chamber. They might bubble out the inoculum.\nAlternatives: Fc blockers can be used instead of BSA.U-well 96 plates can be used as an alternative to FACS tubes in an automated system. Different fluorochrome on the marker antibodies can be used if signals need to be optimized for specific cell type detection. Flow cytometers from different companies should also work with these fluorochromes since we have successfully used it in multiple systems. FCS files can be analyzed using other open or paid software. Statistical software that can do unpaired t-test and Two-way ANOVA analyses can be used."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Immunology",
    "Microbiology",
    "Flow Cytometry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}