{
  "id": 7950,
  "origin_website": "Bio",
  "title": "Protocol for the High-quality Plasmid Isolation from Different Recalcitrant Bacterial Species: <em>Agrobacterium</em> spp., <em>Rhizobium</em> sp., and <em>Bacillus thuringiensis</em>",
  "procedures": [
    "Note: All steps are carried out at room temperature (RT) unless otherwise stated. Streak the bacterial species: EHA105, AGL1, GV3101, and LBA4404 strains on solid LB Agrobacterium media supplemented with 20 mg/L rifampicin and 25 mg/L chloramphenicol; Bacillus thuringiensis on LB solid medium; A. rhizogenes strains ATCC15834 and A4 on YM solid medium with 50 mg/L kanamycin; and Rhizobium sp. on YM solid medium (see Recipes). Incubate for two days at 28 °C in an incubator.Transfer bacterial culture from step 1 into 5 mL of liquid media in 14 mL bacterial culture tubes with appropriate antibiotics as above specified to each strain and incubate at 28 °C overnight on an orbital shaker at 250 rpm.Note: Transfer a single colony for A. tumefaciens, Rhizobium, and Bacillus, and 2–3 colonies of A. rhizogenes from the solid medium to 5 mL liquid medium. Check the OD of the culture using the spectrophotometer; use culture media with no bacteria as blank. Cultures of A. tumefaciens with OD 0.5–0.7 and an OD of 0.8–1.0 for other strains are used for plasmid extraction. A 10 mL culture of slow-growing or low-copy number plasmid results in a high yield. Centrifuge the cultures at 9,000× g (8,000 rpm) for 5 min.Decant the supernatant. Remove the liquid media completely by pipetting out or by keeping the tube upside-down on a Kimwipe for 2–5 min. (Caution: do not disturb the pellet.)Add 250 μL of resuspension solution (P1 buffer containing RNase and Blue lysate of QIAprep Spin Miniprep kit) into each tube and vortex to resuspend the cell pellet completely.Transfer the resuspended bacterial pellet into 1.5 mL Eppendorf tubes using a pipette.Add 250 μL of lysis solution (P2 buffer of QIAprep Spin Miniprep kit) and mix by gently inverting the tubes 5–6 times.",
    "The solution quickly turns blue and viscous, indicating bacterial lysis.Add 350 μL of neutralizing solution (N3 buffer of QIAprep Spin Miniprep kit) and mix by inverting the tubes 5–6 times. The blue solution turns white, and the bacterial chromosomal DNA appears as a white precipitate.Centrifuge the tubes at 20,000× g (15,000 rpm) for 10 min.Carefully transfer the supernatant into new 1.5 mL Eppendorf tubes using a pipette. (Caution: do not disturb the white precipitate.)Add an equal volume of absolute ethanol into each tube and mix by inverting the tubes a few times.Centrifuge the tubes at 20,000× g (15,000 rpm) for 5 min.Decant the supernatant and carefully remove the liquid completely using a pipette or by leaving the tube upside-down on a Kimwipe for 1–3 min.Add 300 μL of TE buffer (pH 8.0) (see Recipes), 0.5 vol (150 μL) of 5 M NaCl, and 0.1 vol (45 μL) of 20% SDS. Mix by inversion and incubate at 65 °C in a heating block for at least 10 min.Note: Make sure the DNA is completely dissolved in TE. If not, increase the volume of TE. If using 10% SDS, add 0.2 vol. Add an equal volume (500 μL) of CIA (see Recipes) and keep shaking on a Nutating Mixer for at least 5 min.Centrifuge at 20,000× g (15,000 rpm) for 7–10 min.Carefully transfer the upper phase (~400 μL) into new 1.5 mL Eppendorf tubes, add 16 μL (20 mg/mL) of RNase, mix well by inversion, and incubate at 37 °C in a heated block for at least 15 min. Add an equal volume of CIA and keep shaking on a Nutating Mixer for at least 5 min.Note: Take the heat block and keep it at RT after step 14 for a few minutes.",
    "Incubation of the vial after adding RNase in the block will also work. Centrifuge at 20,000× g (15,000 rpm) for 7–10 min.Carefully transfer the upper phase (300 μL) into new 1.5 mL Eppendorf tubes, add an equal volume of absolute ethanol, and mix well by inversion.Centrifuge at 20,000× g (15,000 rpm) for 7–10 min.Carefully decant or pipette out the liquid phase and add 500 μL of 70% ethanol. Tap the tube to release the pellet.Centrifuge at 20,000× g (15,000 rpm) for 1–2 min and repeat step 21.Centrifuge as above, pipette out the liquid completely, and air dry by keeping the tube open at RT for 2–5 min.Add 50 μL (if the pellet is large, add more volume) of TE. Completely dissolve the pellet by finger tapping.Measure the quantity of the plasmid DNA using NanoDrop (Figure 1A–1D; Table 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4788/bioprotoc-13-15-4788-g001.jpgFigure 1. NanoDrop quantitation of the isolated plasmids. A. A4; B. Rhizobium; C. EHA105; and D. Bacillus thuringiensis. The x-axis represents the wavelength (nM), and the y-axis represents the 10 mm absorbance.Table 1. Purity and quantity of the plasmid isolated from different bacterial strains using Qiagen protocol for Agrobacterium (Weber et al., 1998) and the optimized protocol table:",
    "﻿Bacterial strain,A260/280 ratio,A260/230 ratio,Yield (ng/μL),Unnamed: 4,Unnamed: 5,Unnamed: 6\nControl (Qiagen),Optimized protocol,Control (Qiagen),Optimized protocol,Control (Qiagen),Optimized protocol,\nA. tumefaciens EHA105,1.61 ± 0.03,1.91 ± 0.08,1.60 ± 0.04,2.10 ± 0.05,32 ± 1.8,232.4 ± 10.5\nA. tumefaciens AGL1,1.40 ± 0.19,2.0 ± 0.05,1.52 ± 0.10,2.21 ± 0.1,24 ± 4.8,185 ± 8.6\nA. tumefaciens GV3101,1.51 ± 0.07,1.93 ± 0.06,1.51 ± 0.07,2.09 ± 0.08,34 ± 1.4,212 ± 9.2\nA. tumefaciens LBA4404,1.38 ± 0.14,2.05 ± 0.07,1.40 ± 0.10,1.98 ± 0.07,26 ± 3.4,176 ± 7.2\nA. rhizogenes A4,1.49 ± 0.05,1.97 ± 0.08,1.49 ± 0.05,2.28 ± 0.1,22 ± 2.0,192.2 ± 9.8\nA. rhizogenes ATCC15834,1.36 ± 0.11,1.99 ± 0.05,1.21 ± 0.08,2.15 ± 0.09,20 ± 3.1,183.1 ± 9.1\nRhizobium sp.,1.59 ± 0.03,1.89 ± 0.08,1.53 ± 0.04,2.11 ± 0.07,37 ± 4.3,372.0 ± 11.2\nBacillus thuringiensis,1.47 ± 0.12,1.91 ± 0.04,1.38 ± 0.11,2.10 ± 0.09,31 ± 3.5,211.7 ± 10.8\nE. coli*,1.94 ± 0.06,-,2.09 ± 0.05,,245 ± 8.1,-",
    "Data represent the mean ± SE of five replicates. The purity and quantity of plasmid isolated using PureLink Quick Plasmid Miniprep kit, which also served as the control, are not significantly different from that of the Qiagen protocol; hence, it is not shown. The same plasmid of that in A. tumefaciens strains in E. coli served as the positive control*.Load 100 ng of plasmid DNA mixed with 6× loading dye (1× final) on a 0.8% agarose gel and run at 100 V for 25 min (Figure 2).Document the gel using the Gel DocTM EZ Imager with the Image Lab 6.0 program.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4788/bioprotoc-13-15-4788-g002.jpgFigure 2. Gel electrophoresis of the isolated plasmids from different bacterial strains. EHA: EHA105, LBA: LBA4404, GV: GV3101, and AGL: AGL1 (all are A. tumefaciens); A4: A. rhizogenes A4; ATC: A. rhizogenes ATCC15834; Rhi: Rhizobium; Bt: Bacillus thuringiensis (shows two bands). PC: positive control of the same plasmid from E. coli using QIAprep Spin Miniprep kit; M: Lambda DNA/EcoRI Plus HindIII marker."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}