{
  "id": 2285,
  "origin_website": "Cell",
  "title": "Protocol for evaluating CD8+ T cell-mediated immunity in latently SHIV-infected rhesus macaques with HIV fusion-inhibitory lipopeptide monotherapy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEvaluation of SIVmac239 gag-specific CD8+ T cell responses after LP-98 withdrawal\nTiming: 3 days\nTiming:  13-17 h to thaw and recover PBMCs\nTiming: 7 h for stimulation of PBMCs\nTiming: 4 h for staining with fluorescent antibodies for flow cytometry\nTiming: 1 day to acquire flow cytometry data\nPBMCs are obtained from blood samples taken from the macaques after LP-98 treatment cessation, to explore the effects of LP-98 therapy on CD8+ T cells and the underlying mechanisms. PBMCs are stimulated with the SIVmac239 Gag peptide pool to evaluate the SIVmac239 Gag-specific CD8+ T cell responses (Xue et al., 2022[href=https://www.wicell.org#bib12]). Degranulation (CD107a), cytokine (IFN-γ, TNF-α and IL-2) and chemokine production (MIP-1β) were chosen as indicators to determine SIVmac239 Gag-specific CD8+ T cell function (Betts et al., 2006[href=https://www.wicell.org#bib3]; Nguyen et al., 2019[href=https://www.wicell.org#bib9]). All steps are performed in biosafety cabinet using sterile reagents and plastic consumables.\nThaw and recover PBMCs.\nPrepare 15 mL tubes labeled with PBMC IDs.\nTransfer 9 mL complete RPMI 1640 medium to 15 mL tubes.\nPlace cryovials containing cryopreserved PBMCs in a 37°C water bath.\nTake cryovials out of the water bath once cells are almost thawed (about 1–2 min) with a small piece of ice remaining.\nTransfer 1 mL cell suspensions into 15 mL tubes containing complete RPMI 1640 medium. Mix the cells by pipetting up and down gently.\nCount cells.\nPipet 10 μL of resuspended cells to stain with trypan blue.\nTransfer the cells into the wells of a Glasstic Slide 10 with counting grids.\nCount and calculate the total PBMCs for each sample.\nCentrifuge 15 mL tubes at 400 × g for 10 min at 4°C.",
    "Remove and discard supernatants and gently tap the bottom of the tubes to resuspend the cells in the liquid remaining at the bottom of the tubes.\nSuspend PBMCs at a concentration of 2 × 106/mL in complete RPMI 1640 medium.\nPrepare 48-well plates labeled with ‘negative’, ‘SIVmac239 Gag peptide pool’ and ‘positive’ for each sample.\nSeed 500 μL (1 × 106) of PBMCs into each well of 48-well plates.\nCulture cells at 37°C in a 5% CO2 incubator for about 12–16 h.\nNote: The cell concentration does not have to be 2 × 106/mL in step (i). Users can choose a different cell concentration as long as it is sufficient to ensure seeding 106 PBMCs in each well in step (k). The volume of cells and complete RPMI 1640 medium added to each well depends on the cell concentration, and make sure that there are 106 PBMCs in 500 μL of complete RPMI 1640 medium.\nNote: The thawed PBMCs need to be recovered overnight for the SIVmac239 Gag peptide pool stimulation assay. We recommend that cryopreserved PBMCs be thawed in late afternoon and allowed to recover for about 12–16 h.\nNote: Please refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 1[href=https://www.wicell.org#sec7.1]) for concerns if the number of viable PBMCs after thawing is too low.\nStimulation of PBMCs.\nRemove 50 μL solution from each well.\nAdd 50 μL of SIVmac239 Gag peptide pool working solution (2.5 mg/mL) into each well of the SIVmac239 Gag peptide pool group (at a final concentration of 0.25 mg/mL).\nAdd 50 μL of complete RPMI 1640 medium per well for the negative group.\nAdd 50 μL 10 × cell stimulation cocktail solution (at a final concentration of 1 ×) per well for the positive group.",
    "Add 2 μL 250 × brefeldin A solution (at a final concentration of 1 ×) to each well in all experimental groups.\nAdd 5 μL of BV786 anti-human CD107a antibody per well in all experimental groups.\nMix the reagents and cells by pipetting up and down and culture the cells at 37°C, in a 5% CO2 incubator for 6 h.\nNote: In place of SIVmac239 Gag peptides, the SIVmac239 Env peptides, SIVmac239 Pol peptides, SIVmac239 Nef peptides or SIVmac239 Vif peptides can also be used for antigenic stimulation to measure SIVmac239-specific CD8+ T cell immune response. It may be better to test different peptides to reflect the function of CD8+ T cells more broadly.\nNote: Users can choose to add costimulatory antibodies (anti-human CD28 antibody and anti-human CD49d antibody) to both negative, positive and SIVmac239 Gag peptide pool groups to yield clearer results in terms of promoting the production of IFN-γ, MIP-1β, TNF-α, IL-2 and CD107a by SIV Gag-specific CD8+ T cells.\nNote: Brefeldin A is commonly used to block protein transport processes so that intracellular cytokines accumulate at the Golgi complex/endoplasmic reticulum for better staining.\nNote: Users can add GolgiStop to all wells to allow accumulation of intracellular cytokines in the Golgi complex, enhancing the cytokine staining signals for flow cytometric analysis.\nNote: We recommend adding anti-CD107a antibody at the start of stimulation because of the transient nature of the surface expression of CD107a on CD8+ T cells. CD107a is located primarily on lysosomal/endosomal membranes, and is rapidly removed via the endocytic pathway in stimulated CD8+ T cells (Betts et al., 2003[href=https://www.wicell.org#bib2]).",
    "Note: We chose six hours as the optimal stimulation time based on pilot experiments, consistent with that reported in the previous reference (Passaes et al., 2020[href=https://www.wicell.org#bib10]). Users should perform pilot experiments to determine the optimal incubation time following SIVmac239 Gag peptide pool stimulation that will vary according to the experimental conditions.\nCritical: Cells will settle to the bottom after 12–16 h of incubation. Users must gently remove the medium at step (a) to avoid cell loss from the bottom of 48-well plates.\nStaining with fluorescent antibodies for flow cytometry.\nPrepare round-bottom polystyrene tubes labeled with ‘negative’ and ‘SIVmac239 Gag stimulated’ and ‘positive’ for each PBMC sample.\nAfter stimulation, transfer cells from 48-well plates to tubes.\nWash cells.\nAdd 2 mL PBS to wash cells.\nCentrifuge cells at 350 × g for 5 min at 25°C.\nRemove and discard supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nViability stain.\nResuspend cells in 100 μL PBS.\nAdd 1 μL Zombie NIR fixable viability kit (BioLegend) at a final concentration of 1:100.\nMix cells by vortexing gently and incubate at 25°C for 20 min in the dark.\nWash cells twice.\nAdd 2 mL FACS washing buffer.\nCentrifuge cells at 350 × g for 5 min at 4°C.\nRemove and discard the supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nRepeat step (i-iii).\nPrepare extracellular staining solution.\nCalculate the total volume of extracellular staining solution needed according to number of samples (see ‘materials and equipment[href=https://www.wicell.org#materials-and-equipment]’ section for composition).\nAdd required volume of FACS washing buffer to a new tube labeled with extracellular staining solution.",
    "Add required volume of BV605 anti-human CD3 antibody and FITC anti-human CD8 antibody to the tube.\nMix extracellular staining solution by vortexing.\nStain extracellular markers.\nResuspend cells in 100 μL extracellular staining solution.\nMix cells by vortexing gently and incubate at 4°C for 30 min in the dark.\nWash cells twice.\nAdd 2 mL FACS washing buffer.\nCentrifuge the cells at 350 × g for 5 min at 4°C.\nRemove and discard the supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nRepeat step (i-iii).\nFix and permeabilize the cells.\nAdd 250 μL of fixation/permeabilization solution (BD Biosciences) to each tube.\nMix cells by vortexing gently and incubate at 4°C for 20 min in the dark.\nWash cells twice.\nAdd 2 mL 1 × Perm/wash buffer (BD Biosciences) to each tube.\nCentrifuge the cells at 350 × g for 5 min at 4°C.\nRemove the supernatant and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nRepeat step (i-iii).\nPrepare intracellular staining solution.\nCalculate the total volume of intracellular staining solution needed according to number of samples (see ‘materials and equipment[href=https://www.wicell.org#materials-and-equipment]’ section for composition).\nAdd required volume of 1 × Perm/wash buffer to a new tube labeled with intracellular staining solution.\nAdd required volume of Brilliant Stain Buffer Plus to the tube.\nAdd required volume of BV711 anti-human IFN-γ antibody, BV421 anti-human MIP-1β antibody, PE/cyanine7 anti-human IL-2 antibody and BV650 anti-human TNF-α antibody to the tube.\nMix intracellular staining solution by vortexing.\nStain intracellular markers.\nResuspend cells in 100 μL intracellular staining solution.\nMix cells by vortexing gently and incubate at 4°C for 30 min in the dark.\nWash cells twice.",
    "Add 2 mL of 1 × Perm/wash buffer to each tube.\nCentrifuge the cells at 350 × g for 5 min at 4°C.\nRemove and discard the supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nRepeat step (i-iii).\nFix cells.\nAdd 300 μL of 1% paraformaldehyde to each tube.\nMix cells by vortexing gently and incubate at 4°C for 15–20 min in the dark.\nWash cells twice.\nAdd 2 mL FACS washing buffer to all tubes.\nCentrifuge the cells at 600 × g for 3 min at 4°C.\nRemove and discard the supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nRepeat step (i-iii).\nResuspend cells in 300 μL PBS.\nStore the cells at 4°C in the dark and plan to acquire the data from the experimental cells on the BD Aria II flow cytometer within 24 h.\nNote: The viability dye and antibody can be conjugated to different fluorophores depending on the lasers available on the type of flow cytometer used.\nNote: When removing the supernatant after centrifugation, remove residual solution by pressing the mouth of the tube on a paper towel for 1–2 s.\nNote: Dissolve one vial of Zombie NIR fixable viability dye in 100 μL DMSO at 25°C, and dilute at 1:100–1000 in PBS. The optimum concentration is determined before the experiment by measuring the effect of different concentrations on live cell identification.",
    "Note: In consideration of biosafety in handing samples from SHIVSF162P3 infected rhesus macaques, we choose to fix samples with 1% paraformaldehyde to inactive the SHIV, protecting operators and BD Aria II flow cytometer against SHIVSF162P3 infection. In addition, treating samples with 1% paraformaldehyde can maintain the stability of fluorescence signals among large-sample detection by flow cytometer so that users can acquire enough time to get stable data from cell samples.\nAlternatives: FACS washing buffer can be substitute for the commercial cell staining buffer that is useful for the dilution of fluorescent reagents as well as for the suspension, and washing of cells destined for flow cytometric analysis, such as Cell Staining Buffer (Biolegend, Cat#: 420201), Stain Buffer (BD Biosciences, Cat#: 554657), et al.\nCritical: Before staining with the Zombie NIR fixable viability dye, cells must be washed and resuspended in PBS without Tris buffer or proteins like BSA.\nAcquire flow cytometry data.\nAdjust fluorescence detector voltage and compensation appropriately by using a blank tube and positive single fluorescence tubes.\nRecord data from BD Aria II flow cytometer.\nRecord data from fluorescence-minus-one (FMO) tubes to define gates for the positive cell populations.\nAcquire data from experimental cells in labeled tubes.\nAnalyze data using FlowJo v10.0 software as outlined in the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section.\nNote: Mix cells by vortexing the tubes briefly before running on the flow cytometer to ensure accuracy and reproducibility of data.\nNote: Refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 2[href=https://www.wicell.org#sec7.3]) for concerns if the fluorescence of stained intracellular cytokines is not detected.\nNote: Refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 3[href=https://www.wicell.org#sec7.5]) for concerns regarding inconsistent functional molecule production by SIVmac239 Gag-specific CD8+ T cell in different separate experiments.\nAdoptive infusion of anti-CD8 antibody in SVC macaques after cessation of LP-98 treatment\nTiming: 8 days",
    "Timing: 8 days to deplete CD8+ T cells\nTiming: 3 h to count CD8+ T cells\nTiming: 3 h to measure plasma virus RNA\nTo determine if the fact that the plasma virus of stable virologic control (SVC) macaques remains undetectable after LP-98 treatment cessation was related to a strong CD8+ T cell immune response, we depleted CD8+ T cells by using adoptive infusion of anti-CD8 antibody in SVC macaques. Dynamic changes in CD8+ T cell counts and plasma virus loading were monitored to directly assess the role of CD8+ T cell response (Cardozo et al., 2018[href=https://www.wicell.org#bib4]).\nDeplete CD8+ T cells. SVC macaques were treated by adoptive infusion of anti-CD8 alpha [MT807R1] to deplete CD8+ T cells after LP-98 withdrawal. All animals were anesthetized with 10 mg/kg intramuscular ketamine hydrochloride before performing the following two steps.\nInject anti-CD8 alpha [MT807R1] subcutaneously into SVC monkeys on day 0.\nShave nape of the neck with hair clipper.\nLift the skin and inject 10 mg/kg of anti-CD8 alpha [MT807R1] with needle held horizontally.\nInject anti-CD8 alpha [MT807R1] intravenously into SVC monkeys on days 3 and 7 after the initial anti-CD8 antibody infusion.\nShave hind limb with hair clipper.\nInject 5 mg/kg of anti-CD8 alpha [MT807R1] slowly into the obvious vein on the hind limb (Figure 1[href=https://www.wicell.org#fig1]).\nNote: We strictly recommend injecting anti-CD8alpha [MT807R1] subcutaneously first followed by two intravenous infusions according to previous reports (Amara et al., 2005[href=https://www.wicell.org#bib1]; Lifson et al., 2001[href=https://www.wicell.org#bib7]). We recommend injecting anti-CD8 alpha [MT807R1] subcutaneously at multiple spots at the initial infusion for better absorption.\nCount CD8+ T cells.\nPrepare round-bottom polystyrene tubes marked with the animal codes.\nPipet 50 μL of peripheral blood into the bottom of each tube.\nPrepare extracellular staining solution.",
    "Calculate the total volume of extracellular staining solution needed for the number of samples (see ‘materials and equipment[href=https://www.wicell.org#materials-and-equipment]’ section for composition).\nAdd required volume of PBS to a new tube labeled with extracellular staining solution.\nAdd required volume of APC-anti-NHP CD45 antibody, PerCP-anti-human CD3 antibody, and PE-anti-human CD8 antibody to the tube.\nMix extracellular staining solution by vortexing.\nStain extracellular markers.\nAdd 50 μL extracellular staining solution to each tube.\nMix cells by vortexing gently and incubate in the dark at 4°C for 30 min.\nAdd 1 mL of 1 × FACSTM lysing solution to each tube to lyse red blood cells for about 3 min.\nAdd 1 mL PBS to each tube to stop lysis once liquid becomes clear.\nCentrifuge cells at 1100 × g for 5 min at 4°C.\nRemove and discard the supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nWash cells twice.\nAdd 2 mL PBS to each tube.\nCentrifuge cells at 1100 × g for 5 min at 4°C.\nRemove and discard the supernatants and gently tap the bottom of the tubes to resuspend cells in liquid remaining at the bottom of the tubes.\nRepeat step (i-iii).\nAdd 1 mL of Staining buffer (BD Biosciences) and resuspend cells.\nPrepare TrucountTM Tubes (BD Biosciences) labeled with the animal codes.\nTransfer 500 μL of cell suspension to TrucountTM Tubes.\nAcquire and analyze the data from experimental cells on BD Accuri C6 flow cytometer in time.\nNote: Mix peripheral blood fully before pipetting it into the tubes in step (b).",
    "Note: Users should always pay attention to the change of liquid clarity when adding 1 × FACSTM lysing solution to tubes in step (e) and add PBS immediately to prevent excessive lysis and protect lymphocytes in step (f).\nNote: Lysing solutions from different suppliers may have different cell lysis capabilities, therefore the incubation time of different lysing solution before the liquid become clear in step (e) should be determined by pilot experiments.\nNote: After discarding the supernatants after centrifugation, remove residual solution by pressing the mouth of the tube on a paper towel for 1–2 s.\nMeasure plasma virus RNA.\nThe specific steps are the same as those described in “determination of plasma viral RNA level[href=https://www.wicell.org#sec1.3]” in the “before you begin[href=https://www.wicell.org#before-you-begin]” section.\nNote: Refer to the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 4[href=https://www.wicell.org#sec7.7]) for concerns regarding lack of fluctuation in plasma vRNA after adoptive infusion of anti-CD8 alpha [MT807R1]."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Microbiology",
    "Molecular Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}