{
  "id": 18688,
  "origin_website": "Jove",
  "title": "Medium Preparation for the Cultivation of Microorganisms under Strictly Anaerobic/Anoxic Conditions",
  "procedures": [
    "1. Preparation of medium\nPrepare redox indicator stock solution (0.1 g of resazurin/100 mL aqueous solution).\nPrepare vitamin solution (Table 1).\nPrepare trace element solution (Table 2).\n\tNOTE: The order of addition is important; please refer to Table 2 and respective protocols.\nPrepare reducing agent stock solution (60 g Na2S/L aqueous solution).\nWeigh medium ingredients (mineral salt medium, Table 3) in an appropriate flask (e.g., 1 L screw cap lab flask).\n\tNOTE: Depending on the experimental setup, the addition of a separate carbon source might be necessary.\nAdd half-volume of distilled water (Table 3) and dissolve the ingredients.\nAdd 1 mL of redox indicator solution according to Table 3.\nAdd vitamin and trace element solution according to Table 3.\nAdjust the pH according to medium/organism requirements in Table 3.\n\tNOTE: Color of redox indicator is pH dependent and might require some time to adjust.\nBring to a final volume of 1 L with distilled water.\n\tNOTE: Vitamin and trace element solutions can also be added after autoclaving by aseptically adding a filter-sterilized aliquot (diluted solutions, filter pore size < 0.2 µm) into previously closed and autoclaved serum flasks. However, this approach bears an elevated risk of contamination.\n2. Filling of cultivation flasks\nThoroughly clean and dry 120 mL serum flasks.\n\tNOTE: Serum flasks are available in different volume capacities (e.g., 20, 60, 120, 250 mL).\nThoroughly clean and dry butyl rubber septa.\nWeigh additional medium components (e.g., phenyl acid precursor substrates) in the cultivation flasks.\n\tNOTE: Additional components depend on experimental setup and hypothesis.\nFill the serum flasks with 50 mL of medium.\n3. Reduction/removal of oxygen in the liquid phase\nPrepare a ~100° C water bath.",
    "Set filled serum flasks in the water bath and incubate for approx. 20-30 min to reduce the solubility of O2 in the liquid phase.\nFlush the headspace immediately with N2 gas or alternatively with other gas or gas mixtures like N2/CO2.\n\tCAUTION: Take care of appropriate room ventilation.\nClose the flasks with butyl rubber septa and fix with aluminum caps.\n\tNOTE: Rubber septa might often fit better onto the neck of the flask by adding a drop of water/medium while drilling it in.\nAdd 0.1 mL of reducing agent (stock solution) to each flask filled with 50 mL of medium to further reduce the redox potential (0.1 mL of reducing agent per 50 mL of medium).\nAutoclave for 20 min at 121 °C.\n\tCAUTION: An autoclave certified for the sterilization of closed vessels has to be used. Otherwise, overpressure derived from temperature increase might cause serum flasks to explode.\n4. Inoculation of the medium\nPrepare inoculum from anaerobic digester.\n\t\nAdd 400 mL of distilled water into a flask and bring it to boil.\nCool it down (< 30 °C) while permanently flushing the headspace with N2.\nAdd approx. 100 g of sludge derived from an anaerobic digester.\n\t\tNOTE: Avoid excessive contact of sludge with oxygen.\nRecord the exact mass of added sludge for the exact determination of dilution.\nExchange the flask’s headspace with N2 and close it with a butyl rubber septum.\nShake the flask for 30 min at 120 rpm.\nRemove 5 mL inoculum by using syringe + cannula and inject it into prepared serum flasks as described in step 1-3.\n5. Incubation, sampling, and analysis\nIncubate inoculated serum flasks at a temperature that is appropriate for the respective experiment.\n\tNOTE: Incubation temperature is dependent on experimental setup and used inoculum.",
    "Drain overpressure resulting from the temperature increase using syringe + cannula, when the liquid in the serum flasks has equilibrated to incubation temperature (about 15 – 30 min, depending on incubation temperature).\n\t\tCAUTION: Depending on the applied substrate, its concentration, temperature, incubation time, inoculum type and concentration, overpressure within flasks can rise by up to > 2 bar pressure and might cause serum flaks to explode. Monitoring the overpressure by using a manometer and subsequently draining overpressure with a cannula is therefore mandatory.\nEvaluate biogas production and composition during incubation time.\n\tNOTE: Incubation period can span a few days to several weeks.\n\t\nRecord current atmospheric pressure.\nPrepare a manometer and evaluate the pressure within the flasks derived from microbial activity.\nShake the flasks.\nRemove 1 mL of headspace gas using a syringe + cannula, and measure the H2, O2, CH4, and/or CO2 concentrations via gas chromatography.\n\t\tNOTE: For the qualification and quantification of H2, O2, CH4, and CO2, a gas chromatograph was used applying operation temperatures of 160 °C (column oven), 100 °C (injector), and 180 °C (thermal conductivity detector, TCD). N2 was used as a carrier gas. For details, refer to previous studies10.\nMonitor concentrations of volatile fatty acids (VFA) and phenyl acids. For VFA and phenyl acid analysis, use a HPLC system equipped with an UV-detector (at 220 nm) running with 5 mM H2SO4 as a mobile phase. For method’s details and additional information on sample storage, please refer to previous studies11.\n\tNOTE: The analysis of VFA is exemplary for many other physico-chemical analyses or microscopic evaluations. Moreover, molecular biological methods targeting the abundance of specific microorganisms and/or composition of the microbial community at a certain point of the experiment can be applied using the described procedure.\n\t\nRemove 1 mL of liquid with syringe + cannula.",
    "NOTE: Samples can be frozen (-20 °C) immediately after withdrawal and analyzed at the end of the experiment11.\nCentrifuge at 15,000–20,000 x g and pass through 0.2 µm RC (regenerated cellulose) filters.\nInject 5-20 µL onto a HPLC system and analyze for VFA composition and concentration of phenyl acids.\nDrain flask’s overpressure using a cannula.\n\tNOTE: After determining the pressure and gas composition as well as taking any necessary sample, place the cultivation flask back on respective temperature and do not drain overpressure before the liquid has achieved the incubation temperature.\nCalculate biogas and methane production VCH4N considering the ideal gas law using Equation 1-3. Please also refer to Table 4.\n\tEquation 1: imgsrc://cloudfront.jove.com/files/ftp_upload/60155/60155eq1v2.jpg\n\twhereby\n\tEquation 2: imgsrc://cloudfront.jove.com/files/ftp_upload/60155/60155eq2v2.jpg\n\tand\n\tEquation 3: imgsrc://cloudfront.jove.com/files/ftp_upload/60155/60155eq3v3.jpg\n\tNOTE: For the calculation of the total biogas production, the amount of CH4% and CH4%X in equation 2 and 3 has to be set to 100. NmL: normalized gas volume under standardized conditions (0 °C, 1 atm), under which the molar gas volume is 22.414 NmL/mmol."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}