{
  "id": 19114,
  "origin_website": "Jove",
  "title": "Enhancement of Apoptotic and Autophagic Induction by a Novel Synthetic C-1 Analogue of 7-deoxypancratistatin in Human Breast Adenocarcinoma and Neuroblastoma Cells with Tamoxifen",
  "procedures": [
    "Introduction\nApoptosis, or type I programmed cell death, is a physiological process that can operate extrinsically, via binding of a death ligand to a death receptor, or intrinsically. The intrinsic pathway of apoptosis is initiated by intracellular stress such as DNA damage and mitochondrial dysfunction; this ultimately leads to the permeabilization of the mitochondria, dissipation of mitochondrial membrane potential (MMP), release of apoptogenic factors from the mitochondrial intermembrane space, and subsequent execution of apoptosis1.\nAutophagy is a process in which a cell breaks, degrades, and recycles its own intracellular components while maintaining plasma membrane integrity; it is triggered by different types of cellular stresses including oxidative stress, hypoxia, protein aggregates, nutrient deprivation, growth factor deprivation, and damaged organelles2. In the initial stages of this process, cytosolic material is engulfed by autophagosomes, double-membraned vesicles, which fuse to lysosomes to form autolysosomes. Post lysosomal fusion, cytosolic materials previously taken up by autophagosomes are degraded by lysosomal enzymes2. Extensive activation of this pathway yields extensive degradation of intracellular components which may lead to autophagic cell death or type II programmed cell death3.",
    "Evasion of cell death has been considered one of the hallmarks of cancer4. Cancer is a disease characterized by uncontrolled cell growth and proliferation5. In particular, neuroblastoma arises from developing nerve cells of the sympathetic nervous system from the neural crest6. It is the most common solid tumor occurring in young children, accounting for approximately 9% of all childhood cancers7. Although much progress has been made to date, this disease remains problematic to both basic scientists and clinicians. On the other hand, breast cancer is the most common cancer amongst females8. Tamoxifen (TAM) has been frequently used for therapy in hormone-responsive breast cancers as an estrogen receptor (ER) antagonist9. Nonetheless, other reports provide evidence of additional independent mechanisms of apoptosis induction by TAM. In particular, TAM interacts with Complex I of the mitochondrial respiratory chain (MRC) at its flavin mononucleotide (FMN) site10.\nPST is a natural compound isolated from the Hymenocallis littoralis plant. Contrasting from many chemotherapeutics currently in use, it has been shown to induce apoptosis, in a non-genotoxic manner, selectively in various cancer cell types via mitochondrial targeting11-15. However, preclinical and clinical work has been hindered by its availability; it is present at very low amounts in its natural source and many complications burden its chemical synthesis. We have synthesized and screened synthetic analogues of 7-deoxypancratistatin and observed similar anti-cancer activity in a C-1 acetoxymethyl derivative, JC-TH-acetate-4 (JCTH-4)16. We now have in hand a synthetic PST analogue with potent anti-cancer activity. Its synthesis has been standardized and can be scaled up to produce sufficient quantities for preclinical and clinical work. Since natural PST and TAM both target the mitochondria, it would be interesting to investigate the combined effect of a synthetic analogue of PST on human breast cancer and neuroblastoma cells in combination with TAM.",
    "Herein, we report selective cytotoxicity of JCTH-4 in human neuroblastoma (SH-SY5Y) and breast adenocarcinoma (MCF7) cells. JCTH-4 was able to induce apoptosis in both cell lines by mitochondrial targeting; JCTH-4 caused dissipation of MMP and an increase in reactive oxygen species (ROS) production in isolated mitochondria from these cancer cells. Furthermore, autophagy was induced by JCTH-4 in MCF7 cells. Interestingly, the addition of TAM to JCTH-4 insult enhanced the aforementioned effects of JCTH-4 in SH-SY5Y and MCF7 cells. Morphological changes induced by JCTH-4 and TAM alone and in combination in MCF7 cells were monitored via time-lapse microscopy of phase contrast or bright field pictures. Normal human fetal fibroblasts (NFF) exhibited a marked decrease in sensitivity to JCTH-4 both alone and in combination with TAM. Therefore, these observations suggest JCTH-4, alone and in with TAM, to be a safe and effective chemotherapeutic agent against breast cancer and neuroblastoma.\nMaterials and Methods\n1. Cell Culture\nGrow and culture SH-SY5Y human neuroblastoma cells (ATCC, Cat. No. CRL-2266, Manassas, VA, USA) with Dulbecco's Modified Eagles Medium F-12 HAM (Sigma-Aldrich, Mississauga, ON, Canada) supplemented with 2 mM L-glutamine, 10% fetal bovine serum (FBS) and 10 mg/ml gentamicin (Gibco BRL, VWR, Mississauga, ON, Canada). Maintain cells at 37 °C and 5% CO2.\nGrow and culture MCF7 human breast adenocarcinoma cells (ATCC, Cat. No. HTB-22, Manassas, VA, USA) in RPMI-1640 medium (Sigma-Aldrich Canada, Mississauga, ON, Canada) supplemented with 10% FBS standard (Thermo Scientific, Waltham, MA) and 10 mg/mL gentamicin (Gibco BRL, VWR, Mississauga, ON, Canada). Maintain cells at 37 °C and 5% CO2.",
    "Grow and culture the apparently normal human fetal fibroblast (NFF) cell line (Coriell Institute for Medical Research, Cat. No. AG04431B, Camden, NJ, USA) in Dulbecco's Modified Eagle's Medium, High Glucose (Thermo Scientific, Waltham, MA, USA) supplemented with 15% FBS and 10 mg/mL gentamicin (Gibco BRL, VWR, Mississauga, ON, Canada). Maintain cells at 37 °C and 5% CO2.\n2. Drug Preparation\nWeigh out tamoxifen (TAM) citrate salt (Sigma-Aldrich, Cat. No. T9262, Mississauga, ON, Canada) and dissolve it in DMSO to prepare a 10 mM stock solution. Store stock solution at -20 °C until use. All vehicle controls used in this study contained DMSO at less than 0.5%.\nRepeat step 2.1 to prepare a 1 mM stock solution dissolved in DMSO of JC-TH-acetate-4 (JCTH-4), produced by chemoenzymatic synthesis from bromobenzene as previously described16. Store stock solution at -20 °C until use. All vehicle controls used in this study contained DMSO at less than 0.5%.\n3. Time-Lapse Microscopy\nPlate approximately 2.0 x 105 MCF7 cells in 35 mm glass bottom culture dishes (MatTek Corporation, Cat. No. P35G-014-C, Ashland, MA, USA) in sterile conditions of a class II biosafety cabinet and allow them to grow at 37 °C and 5% CO2.\nWhen cells reach 60 to 70% confluence, treat them with 1 μM JCTH-4 using a 1 mM stock solution dissolved in DMSO and 10 μM TAM using a 10 mM stock solution dissolved in DMSO, alone and in combination in a class II biosafety cabinet.\nAfter treatment of cells for 48 hours, place cells in a heated chamber at 37 °C with 5% CO2 on a stage of a Leica DMI6000 fluorescent microscope (Leica Microsystems, Wetzlar, Germany).\nUsing LAS AF6000 software, set the microscope to take phase contrast or bright field micrographs at 400x magnification every 5 minutes for 18 hours.",
    "4. Nuclear Staining\nPlate approximately 2.0 x 105 MCF7 or SH-SY5Y cells in each well of a 6 well clear bottom tissue culture plate in a class II biosafety cabinet and allow them to grow at 37 °C and 5% CO2.\nWhen cells reach 60 to 70% confluence, treat them with 1 μM JCTH-4 using a 1 mM stock solution dissolved in DMSO and 10 μM TAM using a 10 mM stock solution dissolved in DMSO, both alone and in combination in a class II biosafety cabinet.\nIncubate cells with the aforementioned treatments at 37 °C and 5% CO2 for 48 hours (SH-SY5Y cells) or 72 hours (MCF7 cells).\nAfter treatment and incubation of cells with drugs, directly add Hoechst 33342 dye (Molecular Probes, Eugene, OR, USA) to the media of the treated cells to a final concentration of 10 μM to stain the nuclei.\nIncubate the cells with the Hoechst dye for 5 to 10 minutes protected from light.\nPlace the plate on the stage of a Leica DM IRB inverted fluorescence microscope (Leica Microsystems, Wetzlar, Germany).\nTake fluorescent and phase micrographs at 400x magnification.\n5. Annexin V Binding Assay\nPlate approximately 5.0 x 105 MCF7, SH-SY5Y, or NFF cells in 10 mL tissue culture plates in a class II biosafety cabinet and allow them to grow at 37 °C and 5% CO2.\nWhen cells reach 60 to 70% confluence, treat them with 1 μM JCTH-4 using a 1 mM stock solution dissolved in DMSO and 10 μM TAM using a 10 mM stock solution dissolved in DMSO, both alone and in combination in a class II biosafety cabinet.\nIncubate cells with the aforementioned treatments at 37 °C and 5% CO2 for 48 hours (SH-SY5Y cells) or 72 hours (MCF7 and NFF cells).",
    "Prepare Annexin V binding buffer in ddH2O with 10 mM HEPES, 10 mM NaOH, 140 mM NaCl, and 1 mM CaCl2 at pH 7.6 and store at 4 °C until use.\nAfter treatment and incubation of cells with drugs, remove the media from the plates containing suspended cells and place it into a separate 15 mL conical tube for each different treatment group labelled with the proper treatment.\nDetach adherent cells from the plates using trypsin.\nAfter the cells lifted from the plate as a result of the trypsin, aspirate the media placed in the 15 mL conical tube in step 5.4 and place it back in their original plates with the trypsin suspended cells.\nWith the electronic pipette filler and serological pipettes, mix the media with the trypsin cell solution and place this mixture back into the corresponding 15 mL conical tubes.\nCentrifuge the cells at 600 x g for 5 minutes at 4 °C, remove the supernatant from each tube, and resuspend cells in PBS.\nCentrifuge the cells at 600 x g for 5 minutes, remove the supernatant from each tube, and resuspend cells in labelled microfuge tubes with about 50 to 70 μL of Annexin V binding buffer.\nAdd Annexin V AlexaFluor-488 (1:50) (Sigma-Aldrich, Mississauga, ON, Canada) and Hoechst dye to a final concentration of 10 μM and incubate for 15 minutes protected from light.",
    "Following incubation, vortex one of the microfuge tubes, add 7 to 10 μL of the cell mixture to a microscope slide, place a coverslip overtop of the cell mixture on the microscope slide and take fluorescent micrographs, both Annexin V and Hoechst images for each view, at 400x magnification on a Leica DM IRB inverted fluorescence microscope (Leica Microsystems, Wetzlar, Germany). Repeat for each experimental sample in each of the remaining microfuge tubes.\n6. Water Soluble Tetrazolium Salt (WST-1) Assay for Cell Viability\nTrypsinize a confluent T75 flask or 10 cm tissue culture dish of MCF7, SH-SY5Y, or NFF cells in a class II biosafety cabinet.\nAfter the cells have been lifted, add 5 to 10 mL of media to the trypsin and place the media cell suspension in a 15 mL conical tube.\nCentrifuge the cells at 600 x g for 5 minutes, place the tube back into the biosafety cabinet, remove the supernatant from each tube, and resuspend the cells in about 1 to 3 mL of media depending on the cell pellet size.\nPlace 10 μL of the cell suspension in a microfuge tube, add 10 μL of Trypan Blue dye (Sigma-Aldrich, Mississauga, ON, Canada), and mix with a micropipette.\nLoad 10 μL of Trypan Blue suspended cells on a haemocytometer (Hausser Scientific, USA), count the cells, and calculate the concentration of cells of the cell suspension in the original 15 mL conical tube.\nUse this concentration to determine the volume of original cell suspension needed to create diluted cell suspensions with concentrations of 1.5 x 105 cells/mL for MCF7 and SH-SY5Y and 5.0 x 104 for NFF cells needed for plating.",
    "Use the diluted cell suspensions to plate 15 x 103 MCF7 or SH-SY5Y cells/well or 5.0 x 103 NFF cells/well by adding 100 μL of the diluted cell suspensions to each well of a 96 well clear bottom tissue culture plate. Incubate the cells at 37 °C and 5% CO2 overnight.\nTreat the cells with 1 μM JCTH-4 and 10 μM TAM both alone and in combination in a class II biosafety cabinet for 72 hours for MCF7 and NFF cells, and for 48 hours for SH-SY5Y cells.\nAfter treatment and incubation of drugs, add 10 μL of WST-1 reagent (Roche Applied Science, Indianapolis, IN, USA) to each well and incubate the plate for 4 hours at 37 °C and 5% CO2.\nTake absorbance readings at 450 nm on a Wallac Victor3 1420 Multilabel Counter (PerkinElmer, Woodbridge, ON, Canada) and express them as percentages of the solvent control groups.\n7. Tetramethylrhodamine Methyl Ester (TMRM) Staining\nPlace a coverslip into each well of a 6 well clear bottom tissue culture plate and plate MCF7 cells in each well of a 6 well tissue culture plate in a class II biosafety cabinet. Allow them to grow at 37 °C and 5% CO2.\nWhen cells reach 60 to 70% confluence, treat them with 1 μM JCTH-4 using a 1 mM stock solution dissolved in DMSO and 10 μM TAM using a 10 mM stock solution dissolved in DMSO, both alone and in combination in a class II biosafety cabinet.\nIncubate cells with the aforementioned treatments at 37 °C and 5% CO2 for 72 hours.",
    "After treatment and incubation of cells with drugs, directly add Hoechst 33342 dye (Molecular Probes, Eugene, OR, USA) to the media of the treated cells to a final concentration of 10 μM to stain the nuclei as well as tetramethylrhodamine methyl ester (TMRM) (Gibco BRL, VWR, Mississauga, ON, Canada) at a final concentration of 200 nM.\nIncubate the cells with the dyes at 5% CO2 and 37 °C for 45 minutes protected from light.\nPipette 8 μL of media or PBS onto a microscope slide and take a coverslip from the 6 well plate and place it on top of the media or PBS on the microscope slide with the cells facing downwards with tweezers.\nTake fluorescent micrographs, both Hoechst and TMRM micrographs for each view, with a Leica DM IRB inverted fluorescence microscope (Leica Microsystems, Wetzlar, Germany) at 400x magnification.\n8. Mitochondrial Isolation\nPrepare about 10 mL of hypotonic buffer (1 mM EDTA, 5 mM Tris-HCl, 210 mM mannitol, 70 mM sucrose, 10 μM Leu-pep, 10 μM Pep-A, and 100 μM PMSF) and reaction buffer and keep both solutions on ice.\nWith about 8 to 10 confluent T75 tissue culture flasks of SH-SY5Y cells, trypsinize the cells, add media to neutralize the trypsin, collect the cell suspensions in 50 mL conical tubes, and centrifuge the tubes at 600 x g for 5 minutes at 4 °C.\nRemove the supernatant and resuspend cell pellets in about 10 to 20 mL of cold PBS, centrifuge the tubes at 600 x g for 5 minutes at 4 °C, and repeat this wash process once.\nRemove the supernatant and resuspend the cells in cold hypotonic buffer. Homogenize cells manually with a glass tissue grinder and centrifuge the cell lysate at 600 x g for 5 minutes at 4 °C.",
    "Centrifuge the resultant supernatant at 15,000 x g for 15 minutes at 4 °C. Remove the cytosolic supernatant and resuspend the mitochondrial pellet in cold reaction buffer.\n9. Amplex Red Assay\nAfter isolating mitochondria from cells, estimate the concentration of protein of the sample of isolated mitochondria using a standard curve of known concentrations of 1mg/mL BSA (Bovine Serum Albumin) with the BioRad protein assay (Bio-Rad Laboratories, Hercules, CA USA).\nUsing the estimated concentration of protein of the isolated mitochondria solution, calculate the volume of this solution to give 20 μg of protein. Pipette this volume into each well of an opaque 96-well plate to load 20 μg of protein/well.\nFill each well in the plate to a total volume of 100 μL with reaction buffer, drug treatment (with a final concentration of 1 μM JCTH-4, and/or 10 μM TAM, or 250 μM PQ (Sigma-Aldrich, Mississauga, ON, Canada) used as a positive control), Amplex Red reagent at a final concentration of 50 μM, and horseradish peroxidase (HRP) (Sigma-Aldrich, Mississauga, ON, Canada) in the ratio of 6 U/200 μL.\nAfter a 2 hour incubation, take fluorescence readings at Ex. 560 nm and Em. 590 nm on a spectrofluorometer (SpectraMax Gemini XPS, Molecular Devices, Sunnyvale, CA, USA).\n10. Cellular Lysate Preparation\nGrow MCF7 cells to 60 to 70% confluence in 10 cm tissue culture plates.\nTreat cells with 1 μM JCTH-4 and 10 μM TAM alone and in combination for 72 hours with about 10 to 15 plates per treatment group.\nPrepare cell lysis buffer (10 mM Tris HCl at pH 7.2, 5 mM KCl, 1 mM MgCl2, 1 mM EGTA, 1% Triton-X-100; 10 μM Leu-pep, 10 μM Pep-A, and 100 μM PMSF) and store at 4 °C until use.",
    "Mechanically dislodge cells from the plate surfaces with a cell scraper and collect cells in labelled 50 mL conical tubes.\nCentrifuge the tubes at 600 x g for 5 minutes at 4 °C, remove the supernatant and resuspend cell pellets in about 10 to 20 mL of cold PBS, centrifuge the tubes at 600 x g for 5 minutes at 4 °C, and repeat this wash process once.\nRemove the supernatant and resuspend the cells in cold cell lysis buffer. Homogenize cells manually with a glass tissue grinder and centrifuge the cell lysate at 600 x g for 5 minutes at 4 °C.\nDiscard the pellets and store the cell lysates at -20 °C until use.\n11. Western Blot Analyses\nDetermine the protein concentration of cell lysates using the BioRad protein assay (Bio-Rad Laboratories, Hercules, CA USA). Subject the protein samples to SDS-PAGE and transfer protein to a nitrocellulose membrane.\nAfter transfer, block membranes with a 5% w/v milk TBST (Tris-Buffered Saline Tween-20) solution for 1 hour.\nProbe membranes with an anti-LC3 antibody raised in rabbit (1:500) (Novus Biologicals, Cat. No. NB100-2220, Littleton, CO, USA), or an anti-β-Actin antibody raised in mouse (1:1000) (Santa Cruz Biotechnology, Inc., Cat. No. sc-81178, Paso Robles, CA, USA) overnight at 4 °C.\nSubject membranes to one 15 minute and two 5 minute washes in TBST and incubate with an anti-mouse (1:2000) or an anti-rabbit (1:2000) horseradish peroxidase-conjugated secondary antibody (Abcam, Cat. No. ab6728 & ab6802, Cambridge, MA, USA) for 1 hour at 4 °C.\nSubject membranes to three consecutive 5 minute washes in TBST and visualize protein bands with enhanced chemiluminescence reagent (Sigma-Aldrich, CPS160, Mississauga, ON, Canada).\nPerformed densitometry analyses using ImageJ software.\n12. Monodansylcadaverine (MDC) Staining",
    "Place a coverslip into each well of a 6 well clear bottom tissue culture plate and plate MCF7 cells in each well of a 6 well clear bottom tissue culture plate in a class II biosafety cabinet. Allow them to grow at 37 °C and 5% CO2.\nWhen cells reach 60 to 70% confluence, treat them with 1 μM JCTH-4 using a 1 mM stock solution dissolved in DMSO and 10 μM TAM using a 10 mM stock solution dissolved in DMSO, both alone and in combination in a class II biosafety cabinet.\nIncubate cells with the aforementioned treatments at 37 °C and 5% CO2 for 72 hours.\nAfter treatment and incubation of cells with drugs, directly add Monodansylcadaverine (MDC) (Sigma-Aldrich, Mississauga, ON, Canada) to a final concentration of 0.1 mM to each well for 15 min.\nIncubate the cells with the dye at 5% CO2 and 37 °C for 15 minutes protected from light.\nPipette 30 μL of media or PBS onto a microscope slide and take a coverslip from the 6 well plate and place it on top of the media or PBS on the microscope slide with the cells facing downwards with tweezers.\nTake fluorescent MDC and phase micrographs, for each view, with a Leica DM IRB inverted fluorescence microscope (Leica Microsystems, Wetzlar, Germany) at 400x magnification.\n13. Representative Results\nSelective Induction of Apoptosis in Human Breast Adenocarcinoma and Neuroblastoma Cells by JCTH-4: Enhancement of Activity by TAM",
    "Selective induction of apoptosis was shown in various cancer cells by natural PST (Fig. 1a)11-13. Because of the low availability of PST, we have synthesized analogues of 7-deoxypancratistatin (JCTH-4, Fig. 1b) and screened them for similar anti-cancer activity in human breast adenocarcinoma (MCF7) and neuroblastoma cells (SH-SY5Y). In the first phase of experiments, we wanted to monitor morphological changes over time following treatment with JCTH-4 and TAM alone and in combination in MCF7 cells. MCF7 cells were monitored for 18 hours, as seen in Video 1 produced by time-lapse microscopy with phase contrast pictures, with solvent treatment (control) for 48 hours; these cells exhibited no major changes in morphology. In contrast, after 48 hours of 1 μM JCTH-4 treatment, these cells exhibited morphological changes associated with apoptosis such as shrinkage, blebbing, apoptotic body formation as seen in Video 2. On the other hand, TAM treatment alone in MCF7 cells produced a very distinct morphology including punctate inclusions indicative of autophagosomes associated with autophagy (Video 3). Very minimal apoptotic morphology was observed and cells generally exhibited healthy morphology comparable to the solvent control treated MCF7 cells. Interestingly, in the presence of TAM, the apoptotic induction by JCTH-4 was drastically enhanced as indicated by increased apoptotic morphology in MCF7 cells after 48 hours as illustrated in Video 4.",
    "In the second phase of experiments we utilized fluorescent dyes to evaluate the induction of apoptosis. After 72 hours and 48 hours of 1 μM JCTH-4 treatment in MCF7 and SH-SY5Y cells respectively, Hoechst dye was used and to monitor nuclear morphology. Results indicated condensed, brightly stained nuclei accompanied by apoptotic bodies in MCF7 and SH-SY5Y cells, indicative of apoptotic induction (Fig. 2a, b). TAM treatment alone yielded minimal apoptotic nuclear morphology in MCF7 and SH-SY5Y cells; nuclei were large, round, and dimly stained with Hoechst comparable to solvent control group (Fig. 2a, b). In agreement with Video 4, nuclei of MCF7 and SH-SY5Y cells displayed a marked increase in apoptotic morphology with the combination treatment after 72 hours (Fig. 2a, b).\nTo verify apoptotic induction, cells were evaluated for phosphatidylserine externalization, a marker for apoptosis, via an Annexin V binding assay17. MCF7 and SH-SY5Y cells treated for 72 and 48 hours respectively with 1 μM JCTH-4 alone and in combination with 10 μM TAM were positive for Annexin V binding, indicated by the green fluorescence, confirming the induction of apoptosis (Fig 3a, b). No evident externalization of phosphatidylserine was observed in MCF7 and SH-SY5Y cells treated with TAM alone, as well as in NFF cells treated with all the aforementioned treatments groups after 72 hours (Fig. 3c). Therefore, JCTH-4 alone and in combination with TAM selectively induces apoptosis in MCF7 and SH-SY5Y cells.",
    "To quantify the effect of JCTH-4 alone and in combination with TAM, a WST-1 based colorimetric assay for cell viability, an indicator of active cell metabolism, was performed on MCF7 and NFF cells treated for 72 hours and SH-SY5Y cells treated for 48 hours. Compared to the solvent control groups, 1 μM JCTH-4 decreased active cell metabolism by over 50%, while 10 μM TAM alone exhibited no significant difference in both MCF7 and SH-SY5Y cells (Fig. 4a, b). Interestingly in MCF7 and SH-SY5Y cells, the addition of TAM to JCTH-4 insult resulted in a synergistic decrease in cell metabolism. NFF cells were drastically less sensitive to both JCTH-4 alone and JCTH-4 with TAM (Fig. 4c). Hence, JCTH-4 demonstrates selective synergistic activity with TAM in MCF7 and SH-SY5Y cells.\nMitochondrial Targeting of JCTH-4\nTo see if JCTH-4 is targeting the mitochondria to induce apoptosis mitochondrial membrane potential in whole cells and ROS generation in isolated mitochondria was monitored. MCF7 cells were treated for 72 hours and stained with TMRM. 1 μM JCTH-4 decreased MMP, indicated by the loss of red fluorescence (Fig. 5a). However, with the addition of 10 μM TAM, a greater dissipation of MMP was observed, while 10 μM TAM alone had no evident effect on MMP.\nAs increases ROS generation have been associated to mitochondrial membrane permeabilization and apoptosis induction, the production of ROS was assessed with Amplex Red dye in isolated mitochondria from SH-SY5Y cells treated with 1 μM JCTH-4 and 10 μM TAM, alone and in combination18-20. Fluorescence readings were expressed as relative fluorescence units (RFU). Increases in ROS generation were observed with JCTH-4 and TAM alone (Fig. 5b). Interestingly, combination treatment yielded a greater increase in ROS production. A well-known inducer of ROS production in mitochondria, PQ, was utilized as a positive control.",
    "Induction of Autophagy by JCTH-4 and TAM\nAutophagic induction has been associated to chemotherapeutic insult by many different compounds3. To evaluate the induction of autophagy, MDC staining was performed on MCF7 cells treated with 1 μM JCTH-4 and 10 μM TAM alone and in combination for 72 hours. Blue punctate fluorescence, indicative of autophagosomes, was present in MCF7 cells treated with JCTH-4 and TAM alone and in combination (Fig. 6a). Notably, the intensity of MDC staining was greatest with the combination treatment, followed by TAM alone, and JCTH-4 alone.\nDuring autophagy, microtubule-associated protein 1 light chain 3 (LC3) normally situated in the cytosol (LC3-I), is lipidated with phosphatidylethanolamine and subsequently localized to the autophagosomal membranes (LC3-II)2. To verify the induction of autophagy, levels of LC3-II were assessed in MCF7 cells treated for 72 hours via western blot analyses. 1 μM JCTH-4 slightly induced the conversion of LC3-I to LC3-II while 10 μM TAM produced a greater autophagic response (Fig. 6b). Interestingly, combination treatment resulted in the greatest induction of autophagy, yielding a LC3-II to LC3-I ratio greater than 3. Therefore, these results demonstrate autophagic induction in MCF7 cells by JCTH-4 and TAM alone and in combination, with the greatest response in cells with the combination treatment.\nSupplemental Video 1. Cellular morphology of MCF7 cells treated with solvent control. MCF7 cells were monitored between 48 and 66 hours post solvent control treatment (DMSO) using time-lapse microscopy with phase contrast pictures. Cells were maintained at 37 °C and 5% CO2. Images were captured at 400x magnification. Click here to watch video[href=http://www.jove.com/files/ftp_upload/3586/Control.dv].",
    "Supplemental Video 2. Induction of apoptotic cellular morphology in MCF7 cells treated with JCTH-4. MCF7 cells were monitored between 48 and 66 hours post treatment with 1 μM JCTH-4 using time-lapse microscopy with phase contrast pictures. Cells were maintained at 37 °C and 5% CO2. Images were captured at 400x magnification. Click here to watch video[href=http://www.jove.com/files/ftp_upload/3586/1um_C4.dv].\nSupplemental Video 3. Induction of autophagic cellular morphology in MCF7 cells treated with TAM. MCF7 cells were monitored between 48 and 66 hours post treatment with 10 μM TAM using time-lapse microscopy with phase contrast pictures. Cells were maintained at 37 °C and 5% CO2. Images were captured at 400x magnification. Click here to watch video[href=http://www.jove.com/files/ftp_upload/3586/10_um_TAM_MCF7.dv].\nSupplemental Video 4. Enhanced apoptotic morphology by JCTH-4 with TAM in MCF7 cells. MCF7 cells were monitored between 48 and 66 hours post treatment with both 1 μM JCTH-4 and 10 μM TAM using time-lapse microscopy with phase contrast pictures. Cells were maintained at 37 °C and 5% CO2. Images were captured at 400x magnification. Click here to watch video[href=http://www.jove.com/files/ftp_upload/3586/MCF-7_Combo_Death_Movie_1_um_C4_10_um_TAM.dv].\nimgsrc://cloudfront.jove.com/files/ftp_upload/3586/3586fig1.jpg\nFigure 1. Structural comparison of PST to a synthetic 7-deoxy analogue. (a) Chemical structure of pancratistatin (PST). (b) Chemical structure of JC-TH-acetate-4 (JCTH-4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3586/3586fig2.jpg\nFigure 2. JCTH-4 induces nuclear apoptotic morphology with enhanced activity with TAM. Nuclear morphology of (a) MCF7 and (b) SH-SY5Y cells treated for 72 and 48 hours respectively with the indicated concentrations of TAM and JCTH-4 stained with Hoechst dye. Control groups were treated with solvent (DMSO). Images were taken at 400x magnification on a fluorescent microscope. Scale bar = 15 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3586/3586fig3.jpg",
    "Figure 3. JCTH-4 causes phosphatidylserine externalization alone and in combination with TAM selectively in cancer cells. Annexin V binding to externalized phosphatidylserine was evaluated to verify induction of apoptosis induction in (a) MCF7 (72 hours), (b) SH-SY5Y (48 hours), and (c) NFF (72 hours) cells treated with JCTH-4 and TAM at the indicated concentrations. Control groups were treated with solvent (DMSO). Images were taken at 400x magnification on a fluorescent microscope. Scale bar = 15 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3586/3586fig4.jpg\nFigure 4. TAM enhances viability decrease by JCTH-4 selectively in cancer cells. 96-well plates were seeded with (a) MCF7, (b) SH-SY5Y, and (c) NFF cells and treated with JCTH-4 and TAM at the indicated concentrations. MCF7 and NFF cells were treated for 72 hours and SH-SY5Y were treated for 48 hours. Post drug treatment and incubation, WST-1 reagent was added to each well, and absorbance readings were taken at 450 nm and expressed as a percentage of the control (DMSO). Statistics were performed using GraphPad Prism version 5.0. Values are expressed as mean ± SD from quadruplicates of 3 independent experiments. MCF7: *p<0.001, **p<0.0001 versus control; #p<0.05 versus 1 μM JCTH-4; †p<0.0001 versus 10 μM TAM. SH-SY5Y: *p<0.0005 versus control; #p<0.005 versus 1 μM JCTH-4; †p<0.005 versus 10 μM TAM. NFF: *p<0.005 versus 10 μM TAM + 1 μM JCTH-4 in MCF7 cells; #p<0.01 versus 10 μM TAM + 1 μM JCTH-4 in SH-SY5Y cells.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3586/3586fig5.jpg",
    "Figure 5. JCTH-4 and TAM act on the mitochondria. (a) MCF7 cells were grown on coverslips and treated with the indicated concentrations of drugs for 72 hours and stained with TMRM to evaluate MMP. Cells of the control group were treated with solvent (DMSO). Images were captured at 400x magnification on a fluorescence microscope. Scale bar= 15 μm. (b) Isolated mitochondria from SH-SY5Y cells were treated with JCTH-4 and TAM at the indicated concentrations and ROS production was assessed with Amplex Red substrate in presence of horseradish peroxidase (HRP). The control group cells were treated with solvent (DMSO). Paraquat (PQ) was used at a concentration of 250 μM as a positive control. Fluorescence readings were obtained after 2 hours of treatment at Ex. 560 nm and Em. 590 nm and expressed as relative fluorescence units (RFU). Statistics were obtained using GraphPad Prism version 5.0. Data is representative of 3 independent experiments with similar trends. Values are expressed as mean ± SD of quadruplicates of 1 independent experiment. *p<0.05, **p<0.005, ***p<0.001 versus control; #p<0.05 versus 1 μM JCTH-4; †p<0.05 versus 10 μM TAM; @p<0.05 versus 250 μM PQ.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3586/3586fig6.jpg",
    "Figure 6. TAM enhances autophagic induction of JCTH-4. (a) MCF7 cells were grown on coverslips and subjected to JCTH-4 and TAM insult at the indicated concentrations for 72 hours. Control group cells were treated with solvent (DMSO). Post treatment, MCF7 cells were stained with MDC to detect autophagic vacuoles. Images were captured at 400x magnification on a fluorescence microscope. Scale bar= 15 μm. (b) Western blot analyses were carried out for LC3 and β-Actin on cell lysates of MCF7 cells treated with the indicated concentrations of drugs for 72 hours. Densitometric analyses were executed using ImageJ software. Statistics were performed using GraphPad Prism version 5.0. Values are expressed as mean ± SD. *p<0.05, **p<0.005, ***p<0.0005 versus control; #p<0.001 versus 1 μM JCTH-4; †p<0.001 versus 10 μM TAM.\nList of Abbreviations.\ntable:\n﻿0,1\nER,estrogen receptor\nFMN,flavin mononucleotide\nJCTH-4,JC-TH-acetate-4\nLC3,microtubule-associated protein 1 light chain 3\nMDC,monodansylcadaverine\nMMP,mitochondrial membrane potential\nMRC,mitochondrial respiratory chain\nNFF,normal human fetal fibroblast\nPQ,paraquat\nPST,pancratistatin\nRFU,relative fluorescence units\nROS,reactive oxygen species\nTAM,tamoxifen\nTMRM,tetramethylrhodamine methyl ester\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}