{
  "id": 11208,
  "origin_website": "Jove",
  "title": "Attaching Biological Probes to Silica Optical Biosensors Using Silane Coupling Agents",
  "procedures": [
    "1. Background\nThe biotin is attached to the surface of these devices through a simple, three-step process (Figure 1). First, we clean the surface and populate it with hydroxyl groups by exposing the devices to either oxygen plasma or piranha solution. Second, we use vapor deposition to attach the silane coupling agent terminated with a primary amine to the hydroxyl groups through hydrolysis and condensation reaction. Third, we attach biotin to the surface via N-hydroxysuccinimide (NHS) ester chemistry. We direct the interested reader to our previous work for more information about the development of these techniques, as well as an explanation of our motivation for choosing these techniques.8\nThe success of these reactions can be evaluated through optical and fluorescence microscopy after the addition of the primary amine, as well as after the addition of the biotin. While optical microscopy can be used to determine if the surface functionalization protocols resulted in damage to the microsphere surface, or even contamination, fluorescence microscopy is used to verify the quality and uniformity of surface coverage of the biotin molecule, as well as the capability of the biotin on the surface to bind with (strept)avidin. To evaluate the coverage of amines on the surface, we used fluorescein isothiocyanate (FITC) fluorescent dye, which reacts with primary amines to form stable, covalent thiourea linkage to the microsphere. Texas Red fluorescent dye that has been conjugated to avidin is used to label the biotin groups on the surface through the biotin-avidin interaction. In both cases, dyes were chosen that can interact (through either receptor-ligand interactions or covalent bonding) with the functional groups on the surface.",
    "Here, the silane coupling agent, which has three leaving groups and one functional group, provides the bridge between the inorganic surface and organic probe molecule. The primary amine functionality reacts quantitatively with NHS esters to form stable amide bonds. In this case, we use a biotin probe molecule whose valeric side chain has been modified with an NHS ester group. Realistically, any probe molecule to which an NHS ester group can be added to the surface using the following protocols. Additionally, these protocols are general, and can be used to functionalize any silica device surface with biotin.\nThe primary challenge with these protocols is not actually in the chemistry itself, but rather in the handling of the silica microspheres. Please note that, throughout the protocols, the microspheres should be handled by grapsing their stems lightly with sharp-tipped tweezers. This keeps the tweezers well away from the microspheres themselves, and allows for easy transport between steps. Many steps in the protocol below are specifically designed to address this factor.\n2. Microsphere Fabrication\nBuild the storage housing for the microspheres.\n\t\nUsing an exacto knife, cut a ¼ in thick piece of cardboard into a 1 in x 1 in square; tape this onto a regular-sized glass slide, and attach a 1 in section of scotch tape, with its ends meeting to form a roll, to the cardboard.\nThis creates a platform on which the microsphere can be elevated and isolated from the surrounding environment, and prevents damage to their surface.\nUsing scissors, cut a 3 inch section of optical fiber from a spool of optical fiber.",
    "Using a No-Nik fiber-stripper, strip the protective polymeric coating from the last 0.5 inches of the end of the cut piece of fiber, leaving just the silica core. Clean the surface of any remaining polymer with a Kimwipe dampened with methanol by gently wiping the fiber with the Kimwipe.\nUsing a bare fiber cleaver, trim the stripped end so that only about 1 millimeter of stripped fiber remains on the end of the fiber.\nPlace the stripped end of the optical fiber into the path of a CO2 laser, taking care to vertically align the fiber such that its stripped end is facing down.\nTurn on the CO2 laser, and direct it to the surface of the stripped end of the optical fiber. The laser will melt the stripped end of the fiber into a sphere using approximately 3.5% power in 2 seconds.\nUsing tweezers, carefully grasp the stem (the non-stripped portion of the optical fiber) of the microsphere. Attach the stem to the tape roll on the microsphere housing. The glass slide may be itself stored in a petri dish. This allows for safe storage of the microsphere.\n3. Populating the Surface with Hydroxyl Groups\nUsing piranha solution:\n\t\nIn a 60 mL polypropylene vial with a hinged cap, prepare a piranha solution (70:30 by volume fuming H2SO4:H2O2 (30 wt%)) by adding 5 ml of hydrogen peroxide to the vial, followed by 11.6 mL of fuming sulfuric acid. CAUTION: wear acid-resistant gloves.\nTransfer the glass slide, holding at least 1 microsphere, to the vial. The microsphere should be in contact with the liquid, but the liquid should not touch the cardboard. Adjust the volume of the solution if needed.",
    "Gently remove the glass slide from the vial, and insert it into another plastic vial containing DDI H2O. Let the samples sit in the solution for 5 minutes.\nGently remove the glass slide from the vial, and place it an oven at 80 °C for 10 minutes to dry the surface.\nUsing oxygen plasma treatment:\n\t\nTransfer the glass slide containing at least one microsphere to the oxygen plasma chamber.\nSet the oxygen pressure to 200 mTorr, and the power to 120 W. Expose the sample to the oxygen plasma for 2 minutes.\nRemove the glass slide from the plasma chamber.\n4. Attaching Silane Coupling Agents to the Surface\nPlace the glass slide, containing at least one microsphere, into a vacuum desiccator in a fume hood.\nAlso in the fume hood, open the silane coupling agent bottle (in this case, aminopropyltrimethoxysilane (APTMS) was used), and place the opened bottle in the desiccator.\nReplace the lid on the vacuum desiccator, and attach the outlet port to an aspirator or house vacuum line.\nTurn on the house vacuum or the water line, and evacuate the vacuum desiccator. Once a vacuum seal is formed between the lid and the base, begin timing the reaction. This will deposit the silane coupling agent onto the surface as a thin film.\nAfter 15 minutes, turn off the vacuum, and slowly open the port to let air into the desiccator. For this coupling agent, 15 minutes is sufficient to form a uniform monolayer on the surface. For other coupling agents, the time may need to be adjusted.\n5. Attaching Biotin to the Surface\nApproximately one hour before attaching the biotin, prepare a 10 mM solution of N-hydroxylsuccinimide biotin (NHS-biotin) in anhydrous dimethylsulfoxide (DMSO) in a 60 mL polypropylene vial with a hinged cap.",
    "If the NHS-biotin has been stored cold, allow it to equilibrate to room temperature before massing it out.\nSonicate the solution for 1 hour to fully dissolve the NHS-biotin powder in the solvent.\nTransfer the glass slide containing the microsphere into another plastic vial, with the microspheres at the bottom, and stems at the top of the vial.\nTransfer, using a plastic pipet, an appropriate volume of the NHS-biotin solution down the side of the vial, behind the glass slide (so the solution does not touch the microsphere as it is being added to the vial). Add enough solution to cover the microsphere surface.\nPlace the vials now containing the microspheres and NHS-biotin in DMSO solution onto a rocking incubator (tilt tray) for 30 minutes at room temperature, with the speed and angle of tilt at 5 rpm and 5 degrees, respectively.\nGently remove the glass slide from the vial, and gently slide it into another vial filled with DDI H2O. Place the vial on the tilt tray for another 10 minutes at the same speed and tilt angle as before. Repeat this step twice with fresh water each time. This helps remove excess DMSO from the surface, and removes any physically-adsorbed biotin that did not actually graft to the surface.\nRemove the glass slide from the vial, and place it in an oven at 80 °C for 10 minutes, or until all water droplets are removed from the surface.\n6. Fluorescent labeling of amine-terminated silica\nTo label the amine groups present after treatment with APTMS, prepare the FITC solution in a darkened room by dissolving 1 mg FITC in 1 mL anhydrous DMSO.\nDilute the solution in 6.1 by adding 50 μL of the FITC solution to 1 mL of 0.1 M sodium bicarbonate buffer.",
    "Place the solution in a 60 mL polypropylene vial with a hinged cap, and gently slide the amine-terminated microspheres, housed again on the glass slide, into the vial.\nPlace the vial in an ice bath, and let the sample react with the FITC solution for a minimum of 4 hours in the dark.\nRemove excess fluorophore through two, 10 minute rinses of the microspheres in sodium carbonate buffer. As before, fill a 60 mL polypropylene vial with a hinged cap with the buffer, and gently slide the glass slide into the solution, taking care that the solution only covers the microsphere, and not the cardboard housing. Cover the vial with aluminum foil, and place the vial on a tilt tray set at 5 degrees and 5 rpm, as before.\nGently remove the glass slide from the vial, and gently slide it into another vial filled with DDI H2O and covered with aluminum foil. Place the vial on the tilt tray for another 10 minutes at the same speed and tilt angle as before. Repeat this step twice with fresh water each time. This helps remove excess dye from the surface.\nGently remove the glass slide from the vial, and dry in an oven set at 80 C for 10 minutes before imaging.\n7. Fluorescent labeling of biotin-terminated silica\nPrepare a 10 μg/mL solution of Texas-Red avidin in phosphate buffered saline.\nAdd the solution to a 60 mL polypropylene vial with a hinged cap, and gently slide the glass slide containing a biotin-terminated microsphere into the solution, so that the microsphere is just covered by the solution.\nReact for 30 minutes at room temperature in the dark.\nRemove excess fluorophore through two, 10 minute rinses of the microspheres in PBS buffer.",
    "As before, fill a 60 mL polypropylene vial with a hinged cap with the buffer, and gently slide the glass slide into the solution, taking care that the solution only covers the microsphere, and not the cardboard housing.\nCover the vial with aluminum foil, and place the vial on a tilt tray set at 5 degrees and 5 rpm, as before.\nGently remove the glass slide from the vial, and gently slide it into another vial filled with DDI H2O and covered with aluminum foil. Place the vial on the tilt tray for another 10 minutes at the same speed and tilt angle as before. Repeat this step twice with fresh water each time. This helps remove excess dye from the surface.\nGently remove the glass slide from the vial, and dry in an oven set at 80 °C for 10 minutes before imaging.\n8. Representative Results\nCorrectly functionalized microspheres can be identified through optical and fluorescence microscopy. If the surface functionalization is done correctly, it should result in a uniformly dense coverage of biotin molecules on the surface, and the surface should remain defect- and contaminant-free after functionalization in order to maintain their high sensitivities during detection experiments. Optical microscopy can be used to probe the latter, while fluorescent microscopy can probe the quality and uniformity of surface coverage. In Figure 2, we show examples of correctly functionalized microspheres. These images show that there is no surface damage or contamination due to functionalization (Fig. 2a), and that the microspheres show a uniform, consistent coverage of either amine groups (Fig. 2b) or biotin groups (Fig. 2c) on the surface.",
    "If the microspheres have not been functionalized correctly, the optical microsphere images will exhibit surface contamination, clumping or non-uniform coverage, and obvious defects in the surface, like surface cracks (Figure 3). Here, we see a common example of surface contamination, resulting from clumping of reagents on the surface.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3866/3866fig1.jpg\nFigure 1. 3-step reaction scheme for attaching probe molecules to the surface of silica microspheres.  Click here to view larger figure[href=http://www.jove.com/files/ftp_upload/3866/3866fig1large.jpg].\nimgsrc://cloudfront.jove.com/files/ftp_upload/3866/3866fig2.jpg\nFigure 2. Silica microspheres. a) Optical micrograph of silica microsphere populated with hydroxyl groups via exposure to oxygen plasma; b) Fluorescent micrograph of silica microsphere populated with primary amines and labeled with FITC dye; c) Fluorescent micrograph of silica microsphere populated with biotin and labeled with Texas Red-avidin conjugate. Reprinted with permission from Soteropulos, C. E., Hunt, H. K. & Armani, A. M. Determination of binding kinetics using whispering gallery mode microcavities. Appl. Phys. Lett. 99, 103703-103703 (2011). Copyright 2011, American Institute of Physics.17\nimgsrc://cloudfront.jove.com/files/ftp_upload/3866/3866fig3.jpg\nFigure 3. Optical micrograph of improperly functionalized sphere. Here, you can see dust on the top right surface, as well as contamination extending off the surface. Additionally, the right side of the optical microsphere shows a small divot on the surface.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}