{
  "id": 15265,
  "origin_website": "Jove",
  "title": "Exploring the Root Microbiome: Extracting Bacterial Community Data from the Soil, Rhizosphere, and Root Endosphere",
  "procedures": [
    "1. Collection and Separation of Root Endosphere, Rhizosphere, and Soil Samples\nPrior to entering the field, autoclave ultrapure water (at least 90 mL of water per sample) to sterilize. Prepare epiphyte removal buffer (at least 25 mL per sample) by adding 6.75 g of KH2PO4, 8.75 g of K2HPO4, and 1 mL of Triton X-100, to 1 L of sterile water. Sterilize the buffer using a vacuum filter with 0.2 µm pore size.\n\t\nFor steps 1.2 to 1.5, wear clean gloves sterilized with ethanol at all times and replace the gloves between each sample to prevent contamination. Sterilize all equipment with 70% ethanol and wipe clean all equipment between samples. Before sampling, determine the optimal sampling depth for your experiment, and be consistent with all soil and root collections.\nTo collect bulk soil samples, use an ethanol-sterilized soil core collector to obtain soil that is free of plant roots by collecting a core approximately 23 to 30 cm from the base of the plant.\nTransfer the soil to a plastic bag, homogenize the soil by gentle shaking, and transfer an aliquot of the soil sample (approximately 600 mg) to fill one 2 mL tube. Immediately place the 2 mL tube on dry ice or flash freeze the tube in liquid N2 until ready to proceed with DNA extraction (step 2).\n\t\nIn some environments, the surrounding soil can contain plant material. In this case, use a sterilized 2 mm sieve to separate the plant debris from the soil prior to placing it in the plastic bag.",
    "To collect the root and rhizosphere, use an ethanol-sterilized shovel to dig up the plant, taking care to obtain as much of the root as possible. Depth is dependent upon the plant. While small plants such as wheat can be removed by digging several centimeters, larger plants such as sorghum may require 30 cm or more. Gently shake off excess soil from the roots until there is approximately 2 mm of soil adhering to the root surface.\n\tNOTE: Take care when working with small plants, with fragile roots, or in dry, high-clay content soils. Ideally, there should only be a thin layer of soil remaining on the roots after shaking. If large aggregates of soil remain, a rubber mallet can be used to dislodge the soil by gently hitting the base of the shoot. If the amount of soil remaining after this process exceeds or falls short of 2 mm, the approximate thickness should be noted.\nFor large plants, use sterile scissors and/or shears to cut a representative subsection of roots and place a minimum of 500 mg of root tissue into a 50 mL conical vial. For smaller grasses, place the entire root system into the vial. Add enough epiphyte removal buffer to cover the roots, then immediately place the sample on dry ice or flash freeze the sample in liquid N2.",
    "NOTE: Take care not to overfill the 50 mL conical vial, as it will make washing step difficult. There should be enough empty space such that the epiphyte buffer is able to flow to the bottom, surround the roots throughout the vial, and cover the top. Because some grasses have more root biomass than will fit into a 50 mL conical vial, a subsection of the roots should be collected. However, it should be noted that cutting the roots could lead to endophytic bacteria being washed out into the rhizosphere fraction, so breaking roots should be minimized. If samples are not processed immediately after returning to lab, they can be stored at -80 °C.\nTo separate the rhizosphere from the roots, thaw the root sample on ice, then sonicate the root samples at 4 °C for 10 min with pulses of 160 W for 30 s, separated by 30 s. Transfer the roots into a chilled (4 °C), clean 50 mL tube using sterile forceps. Do not dispose the original tube with buffer and soil, which is the rhizosphere fraction (Figure 1).\nCentrifuge the tube containing buffer and rhizosphere for 10 min at 4 °C, 4,000 x g. Decant the supernatant, flash freeze the tube containing the rhizosphere fraction in liquid N2, and store the rhizosphere fraction at -80 °C until ready to proceed with DNA extraction (step 2).\nTo wash the roots, add approximately 20 mL of chilled (4 °C) sterile water to the root fraction. Wash the root by shaking vigorously (by hand or mixer, for 15 - 30 s), and then drain the water.",
    "Repeat this step at least twice, until no soil remains on the root surface. If the DNA extraction (step 2) is not performed immediately, wrap the roots in sterile aluminum foil, flash freeze the roots in liquid N2, and store the samples at -80 °C until ready to proceed with DNA extraction.\n2. DNA Extraction\nNOTE: Throughout steps 2 and 3, clean gloves sterilized with ethanol should be worn at all times and all work should be performed on a surface sterilized with ethanol.\nExtract DNA from the soil and rhizosphere samples.\n\t\nUse a sterile spatula to quickly transfer 250 mg of soil and rhizosphere from steps 1.3 and 1.7 into separate collection tubes provided in a commercial DNA isolation kit designed for extraction from soil, then proceed with DNA isolation using the kit supplier's protocol.\nAfter eluting the DNA in the elution buffer supplied by the DNA isolation kit, store the DNA at -20 °C until ready to proceed with step 3.\nExtract DNA from the root samples.\n\t\nChill a sterilized mortar and pestle using liquid N2. Measure out 600 to 700 mg of root tissue and place the tissue into the mortar. Carefully, add enough liquid N2 to cover the roots.\nGrind the roots into small pieces. Continue the process of adding liquid N2 and grinding (at least two times, be consistent between samples), until the roots are a fine powder. Ensure that the root tissue does not thaw during this step.\n\t\tCaution: Use appropriate personal protective equipment (lab coat, protective eyewear, and cryogenic gloves) when working with liquid N2.\n\t\tNOTE: For a low-quality DNA extraction, it can be beneficial to grind excess roots into powder and store the powder at -80 °C.",
    "Quickly, before the root powder begins to thaw, use a sterile spatula to transfer the root powder into pre-weighed 1.5 mL tubes on ice. Record the weight of the tube and powder. Typically, 300 - 400 mg of powder is transferred.\nUse a sterile spatula to quickly transfer 150 mg of root powder to the collection tube provided in a commercial DNA isolation kit designed for extraction from soil, then proceed with DNA isolation using the kit supplier's protocol.\n\t\tNOTE: For some root samples, there can be a high concentration of organics remaining in the DNA pellet, which prevents the amplification of the DNA during PCR, especially when a different DNA extraction protocol (e.g., CTAB extraction) is used. If necessary, clean the DNA by following the instructions provided in the environmental DNA clean-up kit.\nMeasure the concentration of all DNA samples using a high-sensitivity benchtop fluorometer.\n\t\nAdd 1 - 20 µL of each eluted DNA sample into tubes provided in the dsDNA high-sensitivity assay kit. Add fluorometer working solution (1:200 dye:buffer) up to 200 µL.\nPrepare two additional tubes containing 10 µL of DNA standard 1 (0 ng/µL DNA) or 10 µL of standard 2 (100 ng/µL), and add 190 µL of fluorometer working solution to each standard.\nMeasure the concentration of the standards and each sample. If it is not done automatically, calculate the DNA concentration from the absorbance output by a linear regression of the two standards.\n3. Amplicon Library Preparation and Submission\nSet up materials for the amplification reaction.\n\t\nThaw DNA samples at 4 °C and keep them on ice throughout step 3. Randomize the order of DNA samples to minimize bias due to the location on the PCR plate (Table 2.)",
    "In a 96-well PCR plate, dilute DNA from each sample in molecular-grade water to 5 ng/µL in a total volume of 20 µL. Add 20 µL of molecular-grade water to the four corner wells as negative controls for amplification (blanks) (Table 2).\nArrange the barcoded primers (10 µM) in either PCR strip tubes or a 96-well plate such that they can be added with a multi-channel pipette (Figure 2).\nPrepare sufficient PCR master mix to amplify each DNA sample in triplicate. Prepare 1.5 µL of BSA (20 mg/mL), 37.5 µL of pre-made 2x master mix (composed of PCR buffer, MgCl2, dNTPs, and Taq DNA polymerase), 0.57 µL of chloroplast PNA (100 µM), 0.57 µL of mitochondrial PNA (100 µM), and 25.86 µL of molecular grade water.\nPour the master mix into a sterile 25 mL of multichannel pipette reservoir and distribute 66 µL of master mix into each well of a new 96-well PCR plate using a multichannel pipette.\n\t\tNOTE: When calculating reagent volumes for the master mix, make sure to also include the 4 blank wells per plate.\nUsing a multi-channel pipette, add 6 µL of 5 ng/µL DNA (from the normalized DNA plate) to the master mix plate. Then add to the master plate 1.5 µL of 10 µM forward primer such that each column has a different forward barcode, and 1.5 µL of 10 µM reverse primer such that each row has a different reverse barcode (Figure 2).\n\t\tNOTE: Prior to adding primers, the randomized plates and master mix could be used to amplify the ITS or ITS2 fungal genes if different primers were added. If this is the case, a similar primer design can be used.",
    "Spin down the plate briefly at 3,000 x g. Use a multi-channel pipette to mix gently, then divide into three plates with 25 µL of reaction mixture.\n\t\tNOTE: Although three replicates are not strictly necessary, it decreases the impact of technical variability.\nAmplify the DNA in each plate using a thermocycler set to the following conditions: 180 s at 98 °C, 30 cycles of: 98 °C for 45 s (denaturing), 78 °C for 10 s (PNA annealing), 55 °C for 60 s (primer annealing), and 72 °C for 90 s (extension), then 600 s at 72 °C followed by a 4 °C hold step. After the amplification, pool the three replicate plates into one single 96-well plate.\nQuantify the DNA using high-sensitivity fluorometer reagents in a 96-well plate reader.\n\t\nAdd 2 µL of each PCR product to a 96-well microplate, along with 98 µL of fluorometer working solution (1:200 dye:buffer). Include 4 wells as standards: 5 µL of DNA standard 1 (0 ng/µL DNA), 1 µL of standard 2 (10 ng/µL), 2 µL of standard 2 (20 ng/µL), and 5 µL of standard 2 (50 ng/µL). Then add fluorometer working solution for a final volume of 100 µL.\n\t\tNOTE: Each sample can be measured using a benchtop fluorometer as described in step 2.3 if a plate reader is not available.\nCalculate the DNA concentration from the absorbance output by a linear regression of the four standards.\nFor the successfully amplified barcoded products (those that have a concentration greater than 15 ng/µL), pool 100 ng of each sample into a single 1.5 mL tube (Table 2).\nCalculate the average volume of samples added to the pool by using the =AVERAGE() function in a spreadsheet program. Add the volume of the \"blank\" PCR products to the pooled samples.",
    "NOTE: Since the \"blank\" PCR products have their own unique barcode combinations, they can be sequenced to check for any laboratory contaminants.\nMeasure the concentration of the pooled product using a benchtop fluorometer as described in step 2.3, and take 600 ng of DNA and dilute in molecular-grade water to a final volume of 100 µL in a 1.5 mL tube. Store the remaining pooled product at -20 °C.\nWash the 600 ng DNA aliquot by following the established PCR purification process with paramagnetic purification beads in a 96-well format with a few exceptions.\n\t\nMake a fresh 600 µL aliquot of 70% ethanol. Shake the bottle of magnetic beads to re-suspend beads that settle to the bottom.\nAdd 1x volume (100 µL) of bead solution to the 600 ng aliquot of DNA. Mix thoroughly by pipetting 10 times. Incubate for 5 min at room temperature.\nPlace the tube onto the magnetic stand for 2 min (or until solution is clear) to separate beads from solution. While the tube is still in the magnetic stand, aspirate the clear supernatant carefully without touching the magnetic beads, and discard the clear supernatant.\n\t\tNOTE: At this point, the amplicon products are bound to the magnetic beads. Any beads that are disturbed or lost during aspiration will result in a loss of DNA.\nLeave the tube in the magnetic stand and add 300 µL of 70% ethanol to the tube; incubate at room temperature for 30 s. Aspirate out the ethanol and discard. Repeat this process, and remove all ethanol after the second wash. Remove the tube from the magnetic stand, and air dry for 5 min.",
    "Add 30 µL of molecular-grade water to the dried beads and mix by pipetting 10 times. Incubate at room temperature for 2 min. Return the tube to the magnetic stand for 1 min to separate the beads from solution. Transfer the eluate to a new tube.\n\t\tNOTE: Magnetic beads will not affect downstream reactions.\nMeasure the final concentration of cleaned, pooled DNA using a benchtop fluorometer as described in step 2.3. Dilute an aliquot to 10 nM in a final volume of 30 µL, or to the concentration and volume preferred by the sequencing facility.\nUtilize the services of a sequencing facility to sequence the DNA on a NGS platform, 2 x 300 bp paired-end sequencing.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}