{
  "id": 18834,
  "origin_website": "Jove",
  "title": "Modeling Spontaneous Metastatic Renal Cell Carcinoma (mRCC) in Mice Following Nephrectomy",
  "procedures": [
    "1. Orthotopic Kidney Tumor Implantation\nCell Culture\n\t\nPrior to orthotopic implantation, grow mouse RENCALUC cells as a monolayer to 75% confluency.\nFollowing trypsinization and resuspension in 5% FBS containing media, centrifuge cells at 1,000 rpm, 4 °C for 5 min, repeating 3 times to wash in PBS. Then resuspend the cells in serum-free media to a concentration of 5 x 104 RENCALUC/5 μl serum-free media.\nNote: Depending on the variant or cell line used, cells can be resuspended in a 1:1 ratio of matrigel and serum free media to slow highly aggressive mouse cell growth and dissemination after implantation. \nSurgery and cell implantation\nNote: All animal studies described therein, including maintenance and determination of experimental endpoints, were performed according to an Institutional Animal Care and Use Committee (IACUC) protocol approved by Roswell Park Cancer Institute.\nAnesthetize one Balb/C mouse using Isoflurane (2-3%). Pinch foot and check for reflex to ensure sufficient anesthetization. Apply vet ointment to the eyes to prevent drying. Place mouse in right lateral recumbency and shave left side between fore- and hind-limb. Apply alcohol and iodine along dorsal lumbar area to aseptically prepare area for incision.\nUse surgical scissors to initiate a 1 cm skin incision in a longitudinal direction between the last rib and the hip joint. Loosen connective tissue under the skin using a blunt dissection scissor. Use surgical scissors to make a 0.5 cm incision in a longitudinal direction in the abdominal wall. Use curved forceps to gently push down around open wound – this will exteriorize the kidney and allow for gentle immobilization of organ prior to injection.\nLoad the Hamilton syringe with 5 μl the prepared cell mixture. For sub-capsular implantations, two implantation methods can be employed:",
    "Superficial:  Running parallel to the longitudinally orientated kidney, insert needle under the kidney capsule (but above the parenchyma) with the beveled edge up. Once needle is in place, inject all of the cells until small white bubble forms. Slowly remove needle from capsule and immediately blot over injection with a sterile cotton tipped applicator to absorb any leakage and prevent cell dissemination.\nInternal: With beveled edge up and starting from the side of kidney opposite to final implantation site, insert needle through interior of kidney until needle is visible (but not puncturing) the sub-capsular space. Inject all of the cells until white bubble forms and swab injection site to prevent any leakage.\nGently return the kidney to the body cavity. Close the abdominal body wall using absorbable 5-0 Vicryl suture. Once complete, pull the skin layer together and place 2-3 wound clips. Ensure clips are firm and evenly spaced to ensure no wound exposure. Prior to recovery administer 500 μl of 0.9% NaCl and 100 μl of Buprenorphine (0.01 mg/ml) subcutaneously using a 25 G needle. Routinely monitor clip placement and stability, and remove after 10 days.\n2. Nephrectomy/Primary Tumor Removal\nFollow identical protocol for mouse anesthetization, immobilization, incision, and exposure of kidney as described in sections 1.2.1 and 1.2.2 (above).",
    "Use a second pair of forceps to isolate the kidney by gently removing the connecting fat tissue from the caudal end and the adrenal gland from the cranial end of the kidney. While gently grasping the kidney, use absorbable 5-0 Vicryl suture to make a double knot around the ureter, renal artery, and vein. Slowly secure and then cut above the knot to remove the kidney. If any sign of immediately blood loss, or there is a risk of insufficient hold of suture on ureter, artery, and vein, then use cauterizer instead of  scissors to cut above knot.  \nOnce kidney is removed, carefully check for any bleeding from the tied artery and use cauterizer if necessary. Close the abdominal body wall using 5-0 Vicryl. Pull the skin layer together and place 2-3 wound clips following same precautions as described in 1.2.4. Closely monitor animal daily following surgery for signs of distress, bleeding, or limited mobility. Follow institutional guidelines for animal safely.\n3. Monitoring Metastatic Progression and Localization at Endpoint\nMetastatic disease quantification: Bioluminescent monitoring\n\t\nSee methodology previously described in JOVE for monitoring metastasis using cells transfected with luciferase and quantified using the Xenogen IVIS imaging system 11,12.\nVisual necropsy guide for comparative assessment of metastatic distribution\n\t\nSacrifice animals according to institutional guidelines using endpoints including signs of distress, labored breathing, weight loss, etc.\nNote: Close monitoring of animals is critical as spontaneous metastatic progression can be highly variable and rapid. \nUse surgical scissors to initiate an incision above the urethra that continues up the thoracic cavity to lower mandible. Use blunt-ended scissors to separate the skin from the muscle of the abdominal wall.",
    "Initiate incisions along arms and legs. Peel skin away. Closely examine the skin fascia and abdominal wall for nodules, then the superficial lymph nodes: inguinal, brachial, axillary and superficial cervical.\nMake an incision in the abdominal wall and cut along the left and right lateral sides up to the diaphragm. With one horizontal cut remove the front portion of the abdominal wall to bare the viscera.\nExamine the undisturbed appearance of the viscera for grossly notable tumors. Also note the contents of the stomach and intestines; if they are empty, the mouse may not have been able to eat. If the contents are dark, this may indicate evidence of upper/lower gastrointestinal hemorrhage.\nVisually score each organ for tumor presence or absence, assigning a total score for each mouse group (4 animals per group is used as example in Figure 1D-i).\nNotes: 1) Enlargement of lymph nodes does not necessarily mean that it is a tumor growth; if it is greatly sized, very firm, and a whitish color, it is likely a metastatic nodule. 2) Excessive milky or cloudy liquid in the abdomen indicates ascites. Ascites may include solid accumulations on the abdominal organs, particularly between the lobes of the liver and the stomach. 3) for organs such as the lungs, multiple nodules can be present and counted for comparisons between individual animals (see 13 for example).\nIdentify gross tumors or abnormalities of the individual abdominal organs: liver, spleen, kidneys and pancreas by carefully removing and washing with PBS from a squirt bottle.\nAfter removing the abdominal organs, inspect the abdominal lymph nodes, including the lumbar, sacral, renal, and mesenteric lymph node.\nAssess diaphragm for evidence of metastatic spread.\nNote: Extensive spread on the diaphragm can cause it to lose its contractility, leading to labored or loss of breathing.",
    "Remove diaphragm and make two lateral incisions in the thoracic cavity, removing the frontal portion to expose the lungs and heart.\nRemove lungs and heart by gently grasping and lifting the esophagus and cutting the trachea above the heart. Assess tissues for nodules. Squeeze heart. Lack of springy consistency may indicate tumor present.\nUse surgical scissors to cut linearly through skull. Gently remove small pieces of cranium until the whole brain is exposed. Look throughout brain for visible nodules or abnormalities discolorations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}