{
  "id": 15555,
  "origin_website": "Jove",
  "title": "Nucleoside Triphosphate Hydrolases Assay in Toxoplasm gondii and Neospora caninum for High-Throughput Screening using a Robot Arm",
  "procedures": [
    "1. Expression and purification of recombinant TgNTPase-I and NcNTPase\nPrepare the expression plasmid and introduce it to the E. coli. strain BL21.\n\t​NOTE: Detailed information on constructs and procedures is shown in a previous report14. In this study, both TgNTPase-I and NcNTPase constitutively active mutants were kindly gifted by Prof. Asai and Prof. Harada.\n2. Preparation and placement of biofluorescent reaction solution onto the plate\nPrepare 2x biofluorescent reaction solution as described in Table 1 for 2 mL of master mix for a 400-well assay in 384-well format.\nPrepare stock solutions using distilled water (DW) for each indicated concentration with the exception of Resazurin and N-ethylmaleimide. Dissolve the remaining two reagents with DMSO in the appropriate concentration. Then, store the reagents at -30 °C until the time to conduct the experiments.\nAdd 15 µL of 2x biofluorescent reaction solution to each of the 368 wells (384 well format).\n\t​NOTE: The first plate serves as a reservoir to have enough of the reagent to conduct experiments twice.\n3. Put test compounds or extracts onto the bottom of each well in the assay plate\nPut 0.5 µL of each compound onto the bottom of the plate using a robot arm from the library mother plate, including test compounds.\nAdd 0.5 µL of DMSO to both negative and positive control.\n4. Preparation of enzyme reaction mixture and the beginning of the reaction\nPrepare enzyme reaction solution as given in Table 2.\nAdd NTPase (Final concentration is 0.0002 µg/mL) to 50 mL of the enzyme reaction mixture, mix quickly and transfer to a plastic reservoir.\nProceed to simultaneously inject 4.5 µL into each well except for the negative control line using the robot arm.\nAdd the same amount of the enzyme reaction mixture with PBS instead of the enzyme preceded by the simultaneous injection.",
    "Place the plate in an incubator at 37 °C for 10 min.\n5. Conduct real-time measurement of enzymatic activities using a microplate reader\nAfter 10 min of incubation, simultaneously add 5 µL of 2x biofluorescent reaction solution to each well immediately using the robot arm.\nTemporarily stop the robot arm to hold the solution in each tip over the location where the plate is to be placed.\nOnce the assay plate is in place, restart the robot arm.\n\tNOTE: To avoid saturation of the generated ADP, immediately measure the fluorescent intensity.\nQuickly spin down (200 x g for 1 min) the plate, and place the plate in the plate reader.\nStart the real-time measurement of fluorescence at 540 nm/590 nm (excitation/emission) every minute for 1 h.\n6. Analysis of results\nCalculate values as the mean ± standard error of the mean (SEM) from the indicated and replicated samples in each experimental group; replicate experiments to ensure consistency.\nPerform statistical significance using a Student's t-test.\nCalculate values as statistically significant if the P values are P < 0.05.\nCalculate Signal-to-Background ratio (S/B), Signal-to-Noise ratio (S/N) and Z'-factor using the following formulae:\n\tS/B = Average ligand/Average vehicle\n\tS/N = (Average ligand - Average vehicle)/Standard deviation vehicle\n\tZ'-factor = 1 - (3 x Standard deviation ligand + Standard deviation vehicle)/(Average ligand - Average vehicle)\nEnsure that S/B, S/N, and Z'-factor are more than 3, 10 and 0.5, respectively.\n\tNOTE: Confirm whether each experiment meets the general criterion sufficient to do HTS as stated in previous reports23,24.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}