{
  "id": 2181,
  "origin_website": "Cell",
  "title": "An antibody-based proximity labeling protocol to identify biotinylated interactors of SARS-CoV-2",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nConstruction of viral protein expression vectors\nTiming: 6 weeks\nTo express TurboID-tagged viral proteins, SARS-CoV-2 protein coding sequences were integrated into TurboID expression vectors and their expressions were validated.\nIntroduce the synthesized ORF encoding sequences of SARS-CoV-2 (GenBank: NC_045512.2) into pcDNA3.1-myc-TurboID, pcDNA6B-TurboID-myc or pCAG-TurboID-myc vector by homologous recombination.\nLinearize the vectors by the indicated restriction endonucleases, and SARS-CoV-2 ORFs are integrated into the vectors using a Seamless Cloning Kit (Beyotime Biotechnology, China) (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1659-Fig1.jpg\nFigure 1. Construction of TurboID-tagged SARS-CoV-2 expression vectors\nSchematic illustration of TurboID-tagged viral proteins with different promoters and fusion patterns. The sequencing primers are indicated as red font. The SARS-CoV-2 protein encoding sequencings were homologous recombined with the linearized vectors digested by the corresponding endonucleases listed in Table 1[href=https://www.wicell.org#tbl1].\nFor the details of designing primers, follow the protocol provided by the manufacture (https://www.beyotime.com/product/D7010M.htm[href=https://www.beyotime.com/product/D7010M.htm]).\nVerify the cDNA sequences of viral genes are in frame with the TurboID tag without any mutations by DNA sequencing.\nThe details of vector construction were listed in Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_1659_6.csv\nUse the sequencing primers listed in the key resources table[href=https://www.wicell.org#key-resources-table] for sequencing the integration of viral ORFs.\nNote: All of the constructs are available from the lead contact[href=https://www.wicell.org#sec8.1] upon request.\nTransfect the constructs into HEK293T cells to validate their expression before proximity labeling (Figure 2[href=https://www.wicell.org#fig2]A).\nHEK293T cells were cultured in DMEM medium supplemented with 10% fetal bovine serum and 1% penicillin-streptomycin and maintained in a humidified incubator at 37°C with 5% CO2.\nApproximately 2 × 105 HEK293T cells were seeded into each well of 24-well plate in 1 mL culture medium the day before transfection.",
    "For each well, mix 1 μg plasmid with 5 μL Polyetherimide (PEI, 1 μg/mL) at a 1:5 (M/V) ratio in 100 μL serum-free DMEM medium, incubate the mixture for 20 min at room temperature (RT; 18°C–23°C). Troubleshooting 1[href=https://www.wicell.org#sec7.1].\nAlternatives: Transfection reagent can be replaced by Lipofectamine 2000 or Turbofect listed in the key resources table[href=https://www.wicell.org#key-resources-table].\nAdd the transfection mixture into each well and incubate the plate at 37°C with 5% CO2 incubator.\n24–48 h after transfection, cell lysis was analyzed by western blot as described below. For the detection of plasmids expression, the nitrocellulose membrane was blocked by 5% milk, followed by incubation with Myc-HRP (with a dilution ratio of 1:1000) antibody and visualized with ECL. Troubleshooting 2[href=https://www.wicell.org#sec7.3].\nNote: For the specificity of proximal labeling interactors of viral proteins, an appropriate control is required. In this protocol, we used TurboID protein expressed by pcDNA3.1-myc-TurboID vector to enrich non-specific binding partners of proximity proteome, which facilitates the identification of high-confident interactors of the virus.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1659-Fig2.jpg\nFigure 2. Proximity labeling by TurboID-tagged SARS-CoV-2 proteins\nRepresentative detection of 5 out 29 TurboID-tagged viral proteins and their proximity labeling proteins.\n(A) The expression of TurboID-tagged viral proteins was detected by anti-Myc-HRP antibody. The target proteins were indicated by the red arrow.\n(B) The biotinylated proteins by TurboID or TurboID-tagged viral proteins were detected by streptavidin-HRP (Strep) after incubation with biotin.\nProximity labeling by TurboID-tagged viral proteins\nTiming: 1 week\nTurboID-tagged viral expression vectors were transfected into HEK293T cells to biotinylate proximal proteins.\nApproximately 5 × 106 HEK293T cells were seeded on each of two 10 cm plates in 10 mL DMEM medium supplemented with 10% fetal bovine serum and 1% penicillin-streptomycin the day before transfection.",
    "For each labeling assay, mix 14 μg TurboID tagged viral protein vectors with 70 μL PEI in 1,400 μL serum-free DMEM medium, followed by incubation for 20 min at RT and introduce the mixture into two plates of HEK293T cells at the confluence of 80%.\n24 h after transfection, remove the culture medium and change for DMEM with 10% FBS and 50 μM biotin and incubate the plates at 37°C with 5% CO2 incubator for 10 min.\nCritical: To prevent cell loss, pay extra cautions when changing culture medium, since HEK293T cells are easily detached from plates.\nRemove the medium and gently resuspend the cells with 5 mL cold PBS for each plate and centrifuge the cells with Beckman Allegra X-15R by using a SX4750A rotor at 200 × g for 3 min at 4°C. Wash the cell pellets with 1 mL cold PBS twice.\nResuspend the cells with 600 μL RIPA lysis buffer supplemented with protease inhibitor cocktail for each plate.\nSonicate the resuspended cells on ice (30 W, 3 min, with a 4 s pulse on, 4 s pulse off) using ultrasonic homogenizer (Scientz-IID).\nNote: The power capacity and pulse time of the sonication may be adjusted until the cell lysis becomes clear. Keep the cell lysis on ice during sonication.\nPause point: The cell lysis can stay up to a month at −80°C.\nCentrifuge the cell lysis from two plates with Eppendorf centrifuge 5417R by using a F45-30-11 rotor at 16,500 × g for 10 min at 4°C, combine the supernatant into a new 1.5 mL Eppendorf tube.\nCombine 30 μL cell lysis with 30 μL of 2 × SDS-PAGE loading buffer and boil it at 95°C for 10 min. Load 5 μL sample on a 10% SDS-PAGE gel for protein separation.",
    "Transfer the proteins to the nitrocellulose transfer membrane, block the membrane by using BSA blocking buffer on a shaker at 40 rpm for 30 min at RT.\nIncubate the membrane with streptavidin-HRP diluted in BSA blocking buffer (with a dilution ratio of 1:40000) for 40 min at RT on a shaker.\nCritical: The BSA blocking buffer and streptavidin-HRP should be prepared freshly.\nWash the membrane with PBST (PBS with 0.1% Tween 20) on a shaker at 70 rpm for 10 min, repeat this step twice to remove unbound streptavidin-HRP.\nAdd the chemiluminescent substrate (ECL) to the membrane for the detection of biotinylated proteins (Figure 2[href=https://www.wicell.org#fig2]B). Troubleshooting 3[href=https://www.wicell.org#sec7.5] and 4[href=https://www.wicell.org#sec7.7].\nDetermine the protein concentration by the BCA assay. Generally, a 10 cm plate of cells can produce about 3 mg protein after lysis.\nNote: Three biological replicates were carried out by using 2 mg protein from each replicate.\nProtein digestion by filter aided sample preparation (FASP)\nTiming: 2 days\nCell lysis proteins were reduced, alkylated and digested in Centrifugal Filter Units. The digested peptide mixtures were collected and dried.\nFor each sample, reduction was carried out by adding 12 μL dithiothreitol (DTT, 1 M) into 600 μL cell lysis that contains 2 mg protein with a final concentration of 20 mM, then incubating for 30 min at 56°C.\nNote: The dithiothreitol solution should be prepared freshly.\nTransfer 600 μL lysis buffer into 2 Amicon Ultra-0.5 Centrifugal Filter Units equally.\nAdd 200 μL urea buffer into the filter, centrifuge it by Eppendorf centrifuge 5417R with a F45-30-11 rotor at 14,000 × g for 15 min at RT, discard the flow-through. Repeat this step.",
    "Add 100 μL iodoacetamide solution (IAA) into the filter, gently pipetting the mixture and keep away from light for 30 min and centrifuge at 14,000 × g for 10 min.\nNote: The iodoacetamide solution should be prepared freshly and avoided from light.\nAdd 200 μL urea buffer into the filter, centrifuge at 14,000 × g for 15 min. Repeat this step and discard the flow-through.\nAdd 200 μL 50 mM of triethylammonium bicarbonate buffer (TEABC) into the filter, centrifuge at 14,000 × g for 15 min. Repeat this step.\nTransfer the filter into a new 1.5 mL Eppendorf tube.\nAdd 100 μL 50 mM of TEABC and 20 μg trypsin into the filter, gently mixed and incubate at 37°C overnight (16 h). Wrap the filter unit with parafilm to avoid sample evaporation.\nAfter trypsin digestion, add 100 μL water and centrifuge the tube at 14,000 × g for 15 min. Repeat this step and save the elution.\nDry the elution in a vacuum centrifuge (Eppendorf Concentrator plus) at 45°C for 2 h.\nPause point: The peptide samples can stay up to 24 hours at 4°C or at −80°C within a month.\nNote: A schematic overview was illustrated for the clarity of the FASP steps (Figure 3[href=https://www.wicell.org#fig3]).\nCritical: Owing to the high concentration of TEABC, do not dry up the elution, leave about 20 μL sample in the tube to prevent sample spurting out.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1659-Fig3.jpg\nFigure 3. A step-by-step illustration of protein digestion by filter aided sample preparation (FASP)\nPeptide enrichment and desalt\nTiming: 2 days\nDigested peptides were enriched by anti-biotin antibody, the eluted peptides were desalted by StageTips and dried by vacuum centrifugation.\nUse 1 mL IAP buffer to pipette the dried peptides up and down at RT until they dissolved.",
    "Wash 100 μg biotin antibody conjugated beads with 500 μL IAP buffer, centrifuge at 1,000 × g for 1 min at 4°C, discard the supernatant. Repeat this step twice.\nNote: The ratio of digested proteins with biotin antibody was set to 20:1.\nCombine the dissolved peptides with the washed beads and rotate the mixture at 4°C overnight (16 h) to enrich the biotinylated peptides.\nCentrifuge the tubes at 1,000 × g for 1 min at 4°C, discard the supernatant.\nWash the beads with PBS at 4°C with rotation for 8 min and centrifuge the tubes at 1,000 × g for 1 min, discard the supernatant. Repeat this step three times.\nWash the beads with 50 μL 0.15% trifluoroacetic acid and centrifuge at 1,000 × g for 1 min at 4°C, collect the elution into a new tube. Repeat this step.\nPause point: The samples can stay up to 24 hours at 4°C or at −80°C within a month.\nCritical: When using trifluoroacetic acid, work under a chemical fume hood with protective gloves and eye protection.\nLoad the two-layer C18 StageTip (AXYT400 pipette tips filled with C18) onto a 1.5 mL Eppendorf tube, add 100 μL acetonitrile into the C18 StageTip, centrifuge the tube at 200 × g for 3 min at RT, discard the flow-through.\nAdd 100 μL 50% acetonitrile into the C18 StageTip, centrifuge at 200 × g for 3 min at RT, discard the flow-through.\nAdd 100 μL 0.1% trifluoroacetic acid into the C18 StageTip, centrifuge at 200 × g for 3 min at RT, discard the flow-through. Repeat this step.\nLoad the elution from step 32 onto the C18 StageTip, centrifuge at 200 × g for 3 min, discard the flow-through.",
    "Add 100 μL 0.1% trifluoroacetic acid into the C18 StageTip, centrifuge at 200 × g for 3 min at RT, discard the flow-through. Repeat this step.\nTransfer the C18 StageTip into a new tube, add 50 μL 50% acetonitrile with 0.1% trifluoroacetic acid, centrifuge at 200 × g for 3 min at RT. Repeat this step and save the elution.\nDry the elution in a vacuum centrifuge at 45°C.\nPause point: The samples can stay up to a week at 4°C or at −80°C within a month.\nMass spectrometry and data analysis\nTiming: 1 week\nDissolve the peptide with 8 μL 0.1% formic acid (FA) and analyze by liquid chromatography-tandem mass spectrometry (LC-MS/MS). In our experiments, the peptides were analyzed by a Q-Exactive HF-X coupled to an UltiMat 3000 RSLCnano system using an 88 min method with a linear gradient of solvent A (0.1% FA) and solvent B (0.1% FA and 80% acetonitrile). For the separation of the peptide, the flow rate for the first 10 min was 300 nL/min and 600 nL/min for the rest 78 min, gradient elution was set by increasing solvent B from 6% to 40% in 80 min and maintained 95% for 5 min, then move back to 6% for 3 min.\nSearch the MS data by Mascot software, using the reviewed Uniprot human database, including SARS-CoV-2 proteins with TurboID tag. The parameters are listed in Table 2[href=https://www.wicell.org#tbl2]. The qualification and the quantification of peptides and proteins were analyzed by Pepdistiller and PANDA with a false discovery rate of 0.01, respectively. Troubleshooting 5[href=https://www.wicell.org#sec7.9].\ntable:files/protocols_protocol_1659_7.csv",
    "To identify high-confidence SARS-CoV-2 protein proximal interactors, we used SAINTexpress to score the identified interactors, these with a cut-off value ≥ 0.6 were further ranked by occurrence, and the top 5th percentile proteins that regarded as non-specific contaminations were removed. The proteins from sample were compared with control by using biotinylated site numbers with a ratio > 2 as the cutoff value. Filtered proteins were regarded as proximity interactors of SARS-CoV-2 proteins."
  ],
  "subjectAreas": [
    "Proteomics",
    "Mass Spectrometry",
    "Microbiology",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}