{
  "id": 13587,
  "origin_website": "Jove",
  "title": "Small-scale Propagation of Human iPSCs in Serum-free Conditions for Routine Immunocytochemical Characterization",
  "procedures": [
    "hiPSCs were derived from human dermal fibroblasts isolated from 4 mm skin punch biopsies and reprogrammed in house via Sendai virus-mediated reprogramming11. The University of Arizona Institutional Review Board approved all procedures for subject recruitment and biopsy collection.\n1. Preparation of Extracellular Matrix Coated Surface for iPSC Culture\nOne day prior to the confluence of hiPSC cultures growing on iMEFs, prepare extracellular matrix (Matrigel) coated plates.\nSlow thaw an aliquot of the extracellular matrix (lot dependent, follow instructions on the specification sheet) on ice in 4 °C for 2 h.\nIn a biosafety hood, using cold pipet tips (stored at -20 °C), add 1 aliquot of extracellular matrix to cold Dulbecco's Modified Eagle Medium/Nutrient Mixture F-12 (DMEM/F12/HEPES) according to the lot specific dilution factor.\nDispense ~ 600 µL of extracellular matrix per well of each new cell culture treated 12-well plate needed.\nIncubate the plate at room temperature for several hours. Here, use a 3 h incubation time.\n\tNOTE: Plates can be used immediately or stored at 4 °C for up to two weeks.\n2. Transfer of hiPSCs Grown on iMEF Feeder Cells onto Extracellular Matrix for Propagation\nOn the day of passaging, remove the matrix coated plate from 4 °C and allow the plate to acclimate to room temperature for 1 h in the tissue culture hood.\nAspirate the medium from 1 well of a 6-well plate of hiPSC culture growing on iMEFs and replace with 500 µL collagenase dissociation reagent (1 mg/mL in basal culture medium).\nIncubate at 37 °C for ~ 10 - 30 min until the edges of the iPSC colonies appear to lift slightly.\n\tNOTE: Incubation time is line dependent and will vary. Monitor dissociation under a microscope.\nCarefully aspirate the dissociation reagent and wash gently 2 times with phosphate buffered saline (PBS, pH 7.4).",
    "Add 1 mL of room temperature mTeSR1 complete medium with 10 ng/mL Rho-associated protein kinase inhibitor (Y-27632 ROCK inhibitor) to the well.\n\tNOTE: Using a 50:50 mixture of iMEF-conditioned medium and mTeSR1 during this initial passage is suggested and can be beneficial for the survival of the hiPSCs during this media transition.\nUsing a small phase contrast microscope placed partially inside the hood, manually score and pick 1 - 2 hiPSC colonies (~ 700 - 1,000 µm in diameter) using a syringe and needle (25 G, 1½ in). Push off the scored pieces of the colony into the medium with a P200 pipet tip.\nAspirate and dispose of the matrix from the new plate, being careful not to disturb the coating.\nTransfer 1 mL of the cell suspension from the old well containing the scored iPSCs into the new matrix coated well.\nPlace the plate in the incubator at 37 °C, 5% CO2. Rock the plate in several quick, back-and-forth, and side-to-side movements to evenly spread out the cells. Do not disturb the plate for 24 h.\nPerform daily full media changes with mTeSR1 complete medium (addition of Y-27632 ROCK Inhibitor is not needed after the initial plating in step 2.5).\n3. Small-scale Passaging of hiPSCs on Matrix-coated Plates\nNOTE: Generally, after the initial transfer of the hiPSCs to matrix coated plates, the cells should be passaged once more in a similar manner to ensure all iMEFs have been eliminated and cells have adapted to feeder-free conditions.\nOne day prior to iPSC confluency prepare freshly coated matrix plates as discussed in section 1.\nOn the day of passage, remove the matrix coated plate from 4 °C incubation and allow the plate to acclimate to room temperature for 1 h in the tissue culture hood.",
    "Aspirate the medium from 1 well of a 6-well plate of hiPSCs (originally transitioned from feeder to matrix) and replace with 500 µL cell dissociation buffer.\n\tNOTE: The commercial cell dissociation buffer used here (see Materials Table) is more suitable for use with mTeSR1 medium compared to collagenase.\nIncubate at room temperature for 3 - 7 min until the edges of the iPSC colonies appear to lift slightly. As mentioned before, the incubation time is line dependent and variable. Therefore, monitor the cellular dissociation under a microscope to determine the optimal time.\nCarefully aspirate the dissociation buffer and wash gently 2 times with PBS.\nAdd 500 µL of room temperature mTeSR1 complete medium with 10 ng/mL Y-27632 ROCK inhibitor to the well.\nInstead of scoring colonies as in Step 2.6, push the desired number of colonies into the media using a P200 tip and gently triturate the cell suspension 2 times against one corner of the well to break the hiPSC colonies into clumps of ~ 50 - 200 µm in size. For example, for a 12-well plate, pick 1 - 2 colonies to transfer into each 1 new well. Transfer the cell suspension from the old well into a single new well of a 12-well plate.\nRock the plate in several quick, back-and-forth, and side-to-side movements to evenly spread out the cells, and let the plate rest for 24 h in a 37 °C, 5% CO2 incubator.\nPerform daily full media changes with mTeSR1 complete medium. As mentioned before, it is not necessary to add Y-27632 ROCK Inhibitor after the initial plating.\n\tNOTE: Unused iPSC colonies from Step 3.7 may be easily cryopreserved at this point.\n4. Preparation of Chamber Slides and Coverslips for Seeding of hiPSCs for Immunocytochemistry",
    "NOTE: The following protocol utilizes 4-well plastic chamber slides and 12 mm glass coverslips with appropriate volumes of media in the multi-wells to support cost-effective immunocytochemistry. However, media volumes can be increased if the use of larger well and coverslip sizes is desired.\nOne day prior to hiPSC confluence, prepare chamber slides freshly coated with extracellular matrix as discussed in section 1. Add enough matrix solution (~ 300 - 500 µL per well of a 4-well chamber slide) to fully coat each well without any concern of evaporation. Alternatively, after placing 1 cleaned and sterilized coverslip into each well of a 24-well plate, coat with 500 µL extracellular matrix and make sure the coverslip is not floating on top of the solution.\nOn the day of passage, remove the coated chamber slides/coverslips from 4 °C and allow acclimation to room temperature for 1 h in the tissue culture hood.\nAspirate the medium from 1 well of a 12-well plate of hiPSCs and replace with 500 µL dissociation buffer.\nIncubate at room temperature for ~ 3 - 7 min until the edges of the iPSC colonies appear to lift slightly.\nCarefully aspirate the dissociation buffer and add 1 mL of room temperature mTeSR1 complete medium with 10 ng/mL Y-27632 ROCK Inhibitor to the well.\nUsing a small phase contrast microscope placed inside the tissue culture hood, manually pick 1 colony/new well of a 4-well chamber slide or 1 new coverslip to be plated (~ 1,000 - 1,500 µm in diameter) using a P200 pipet tip by pushing it off the plate surface into the medium.\nAspirate the matrix from the new chamber slide/coverslip, being careful not to disturb the coating.",
    "Gently triturate the cell suspension 2 times against one corner of the well to break the hiPSC colonies into clumps of ~ 50 - 200 µm in size. Transfer 250 µL of the cell suspension from the old well into each new well of a 4-well chamber slide/coverslip.\nBring the volume of each new well up to 500 µL with mTeSR1 containing 10 ng/mL Y-27632 ROCK Inhibitor.\nPlace the chamber slide/coverslips in the incubator at 37 °C, 5% CO2.\nAfter 24 h, perform daily full media changes with mTeSR1 complete medium. Again as mentioned previously, the addition of Y-27632 ROCK Inhibitor is not necessary after the initial plating.\n5. Preparation of iPSCs for Immunocytochemistry\nOnce confluent, preserve the hiPSC colonies via fixation by removing the media from the wells and adding pre-warmed CAUTION 4% paraformaldehyde (~ 300 µL/well of a 4-well chamber slide/coverslip). Incubate at room temperature for 20 min.\nDiscard the paraformaldehyde appropriately according to institutional biohazard and chemical safety guidelines.\nWash the cells 3 times for 5 min each on a bench-top shaker with PBS.\n\tNOTE: Cells on chamber slides/coverslips can be stored with ample PBS at 4 °C indefinitely at this stage. Alternatively, they can be immediately used for ICC.\n6. Immunostaining of hiPSCs with Pluripotency Markers\nNOTE: Immunostain hiPSCs with standard pluripotency antibodies. As an example, here cells are double-stained with antibodies targeting one 1 surface and 1 intracellular antigen in a sequential manner as follows: Anti-Stage-Specific Embryonic Antigen-4 (SSEA4) with anti-Octamer-binding protein 4 (OCT-4) and anti-Tra-1-60 with anti-SRY related HMG BOX gene 2 (SOX2) (Please see the Materials Table for antibody details).\nAspirate the PBS from the wells and add in 500 µL/well Blocking Solution without Triton-X-100. Incubate for 1 h at room temperature.",
    "Prepare a pre-determined concentration (here, use 1:200) of the surface antibodies, either SSEA4 or Tra-1-60, by diluting in Blocking Solution without Triton X-100.\n\t\nFor chamber slides, prepare 300 µL/well of a 4-well chamber slide by mixing 298.5 µL of Blocking Solution above and 1.5 µL of anti-SSEA4 or Tra-1-60 primary antibody.\nFor coverslips, prepare 40 µL/coverslip by mixing 199 µL of Blocking Solution and 1 µL of anti-SSEA4 or Tra-1-60 primary antibody.\nAspirate the Blocking Solution from the chamber slide and dispense the primary antibody into appropriate wells. For coverslips, place a piece of parafilm firmly inside a Petri dish and dispense 40 µL of the primary antibody on top as a droplet. Using a bent syringe needle and forceps, carefully lift the coverslip out of the culture well and place it cell side down onto the drop of antibody on the parafilm. Incubate overnight at 4 °C.\nThe next morning, wash the cells 3 times, 5 - 10 min each, by removing the antibody from the chamber slide and adding in PBS. For coverslips, lift each one off the parafilm and place it back in a well of a 24-well plate, cell side up. Carefully add PBS.\nPrepare appropriate secondary antibodies at 1:500 in the Blocking Solution.\n\t\nFor chamber slides, prepare 300 µL/well of a 4-well chamber slide by mixing 499 µL of Blocking Solution and 1 µL of goat anti-mouse IgG3 Alexa Fluor 488 (for SSEA4) or 1 µL of goat anti-mouse IgM Alexa Fluor 488 (for Tra-1-60).\nFor coverslips, prepare 40 µL/coverslip by mixing 499 µL of Blocking Solution and 1 µL of goat anti-mouse IgG3 Alexa Fluor 488 (for SSEA4) or 1 µL of goat anti-mouse IgM Alexa Fluor 488 (for Tra-1-60).",
    "Aspirate the PBS from the chamber slide and dispense the secondary antibody into appropriate wells. For coverslips, following Step 6.2, invert the coverslips onto the antibody solution placed on parafilm at room temperature for 2 h.\n\tNOTE: If using fluorescent tagged secondary antibodies, the cells must be protected from light. Place the chamber slides and the coverslips in a dark environment during incubations and washes.\nWash the cells 3 times for 5 - 10 min each by removing the antibody from the chamber slide and adding in PBS. For coverslips, lift each one carefully from the parafilm and place back in a well of a 24-well plate, cell side up. Gently add PBS during washes.\nPrior to probing for the second antigen, intracellular OCT-4 or SOX2 in this case, incubate again in Blocking Solution made with permeabilization reagent (Triton-X-100) for 1 h at room temperature.\nTo immunostain for OCT-4 or SOX2, simply follow the methodology described in Steps 6.1-6.6 for applying the primary and secondary antibodies. For the purposes of this protocol, use OCT-4 and SOX2 at a concentration of 1:200 and the secondary antibody goat anti-rabbit IgG Alexa Fluor 594 at 1:500.\nAfter the abovementioned primary and secondary antibody treatments, wash the cells 3 times for 5 - 10 min each with PBS and counterstain with 4',6'-diamidino-2-phenylindole, dihydrochloride (DAPI) following standard protocols if nuclear visualization is desired.\n7. Preparation for Viewing\nFor chamber slides, carefully remove the upper chamber from the slide, following the manufacturer's instructions. Then, rinse in distilled water, and add mounting medium and a coverglass to enable microscopy.\nFor coverslips, invert the coverslips on to a drop of mounting medium placed on a glass microscope slide.\nImage under a standard or confocal fluorescence microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}