{
  "id": 6768,
  "origin_website": "Bio",
  "title": "Production, Purification and Characterization of Recombinant Biotinylated Phytochrome B for Extracellular Optogenetics",
  "procedures": [
    "Note: If not stated otherwise, perform all steps at room temperature. Production of PhyB-AviTag in E. coliTransformation of E. coli BL21 Star (DE3) with plasmid pMH1105 encoding PhyB(1-651)-AviTag-His6 and the biosynthesis enzymes HO1 and PcyA:Thaw 1 aliquot (50 µl) of E. coli BL21 Star (DE3) cells on ice.Add 1 µl of pMH1105 plasmid DNA with a concentration of 10-1,000 ng/µl to the thawed bacteria and mix by gently tapping the tube.Incubate on ice for 20 min.Incubate in a Thermoshaker/heat block at 42 °C for 45 s.Incubate on ice for 2 min.Add 500 µl LB medium and incubate for 1 h in a Thermoshaker at 37 °C, 750 rpm.Transfer bacteria to a 50 ml conical centrifuge tube containing 10 ml LB medium supplemented with 100 µg/ml streptomycin.Incubate bacteria overnight (~15 h) at 37 °C, 150 rpm.On the next day, inoculate 100 ml of LB medium supplemented with 100 µg/ml streptomycin in a 500 ml baffled flask with the overnight culture (pre-culture).Incubate at 37 °C, 150 rpm for 4 h.Inoculate 6 flasks of 1 L LB medium supplemented with 100 µg/ml streptomycin in 2 L baffled flasks with each 10 ml of the pre-culture (expression cultures).Grow at 30 °C, 150 rpm until an OD600 of 0.6-0.8 is reached. Use cuvettes and a photometer to measure optical density at 600 nm using the same LB medium as blank.Induce protein production by adding 1 ml of 1 M IPTG stock solution to each expression culture (Final concentration = 1 mM).Add 10 ml of 5 mM biotin solution to each expression culture (Final concentration = 50 µM).Incubate at 18 °C, 150 rpm in the dark for 20 h (see Note 1).Harvest bacteria (expression culture should be slightly green, Figure 1A) by centrifugation at 6,500 x g for 10 min at 4 °C.",
    "Resuspend bacterial pellet (should be green, Figure 1B) in lysis buffer (30 ml lysis buffer per 1 L expression culture).Aliquot resuspended bacteria in 50 ml conical centrifuge tubes, shock freeze in liquid nitrogen and store at -80 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200228/20200228013115_7060.jpgFigure 1. Pictures of A. the PhyB-AviTag-producing E. coli culture before harvesting, B. the corresponding bacterial pellet and C. the purified PhyB-AviTag protein. The culture had a green shading whereas the bacterial pellet was clearly green. Purified PhyB-AviTag (3 mg/ml) had a turquoise color.Purification of PhyB-AviTagThaw tubes with the resuspended bacteria in a 37 °C water bath and immediately transfer them on ice once they are thawed.Lyse bacteria by 3 cycles in a high pressure homogenizer/French press at 1,000-1,500 bar (see Note 2).Clarify lysate by centrifugation at 30,000 x g for 30 min at 4 °C.Purify PhyB-AviTag from the supernatant by immobilized metal affinity chromatography (IMAC) using an FPLC/Äkta system at 4 °C (see Note 3):Connect the Ni-NTA Superflow column to the system. For the purification process, use a flow rate of 5 ml/min. Monitor absorbance at 280 nm.Load the lysate on the column. Load ~90 ml of lysate (equals ~3 L expression culture) per run.Wash the column with 100 ml (equals 20 column volumes (CV)) lysis buffer.Elute the protein with 50 ml (equals 10 CV) of elution buffer. Collect fractions (~2 ml) and merge the PhyB-AviTag containing turquoise colored fractions (Figure 1C).Optional: Concentrate the protein using a centrifugal concentrator at 8,000 x g. The buffer of up to 10 ml PhyB-AviTag can be exchanged in one desalting run (see next step).Exchange buffer of PhyB-AviTag to protein buffer using an FPLC/Äkta system:Connect the HiPrep 26/10 desalting column to the system. For the buffer exchange, use a flow rate of 10 ml/min. Monitor absorbance at 280 nm and conductivity.",
    "Equilibrate the column with 200 ml of protein buffer.Load up to 10 ml of the (concentrated) IMAC eluate on the column.Wash the column with 200 ml of protein buffer. Collect fractions (~4 ml) for the first 50 ml and merge the PhyB-AviTag containing turquoise colored fractions of the 280 nm absorbance peak (exclude fractions of the conductivity peak).Concentrate the protein using a centrifugal concentrator at 8,000 x g to a concentration of 1-5 mg/ml. Determine protein concentration by Bradford assay using BSA as standard (see Note 5).Optional: Freeze protein (see Note 6):Add glycerol to a final concentration of 10% (v/v) to the protein.Aliquot the protein solution in 1.5 ml microcentrifuge tubes, shock freeze in liquid nitrogen and store at -80 °C.When needed, thaw the protein at 37 °C in a water bath or heat block. Once the protein is thawed, centrifuge protein at 20,000 x g for 5 min to pellet precipitates and store the supernatant at 4 °C.Analysis of purified PhyB-AviTagSDS-PAGE analysis of PhyB-AviTag (for representative results see Figure 2):Mix 80 µl protein solution (~0.2 mg/ml) with 20 µl of 5x SDS loading buffer and incubate at 95 °C for 5 min in a Thermoshaker/heat block.Separate protein samples by SDS-PAGE (10-15% (w/v) polyacrylamide gel) and continue with zinc and Coomassie staining (Step C1c) or detection of biotinylated protein (Step C1d).Zinc and Coomassie staining:Incubate the gel for 15 min in zinc solution and visualize zinc-induced fluorescence of the chromophore phycocyanobilin (PCB) upon illumination with UV light on a standard ethidium bromide agarose gel imaging system.Incubate the gel for 1 h in Coomassie solution.Incubate the gel overnight in destaining solution.Detection of biotinylated protein:Transfer proteins onto a PVDF membrane by electroblotting.Block membrane by incubation for 1 h in blocking buffer.Incubate membrane with Avidin-HRP diluted 1:2,000 in blocking buffer.",
    "Wash membrane 3x for 5 min with washing buffer.Visualize Avidin-HRP using ECL reagent and a chemiluminescence imaging system.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200228/20200228013230_5027.jpgFigure 2. SDS-PAGE analysis of PhyB-AviTag and GFP-PIF6. The different fractions of the PhyB-AviTag purification process and purified GFP-PIF6 were separated by SDS-PAGE (15% (w/v) polyacrylamide) and stained for the chromophore phycocyanobilin (PCB, Zn2+-staining), proteins (Coomassie-staining) and biotin (Avidin-HRP). P, insoluble fraction of E. coli lysate; S, soluble fraction of lysate; F, flow-through of Ni-NTA column; W, wash of column; E, eluate of column. M, protein size marker. Expected PhyB-AviTag mass: 74 kDa. Expected GFP-PIF6 mass: 40 kDa.Estimation of biotinylation efficiency (for representative results see Note 7):Transfer 400 µl of streptavidin agarose slurry (equivalent to 200 µl settled beads) into a 1.5 ml microcentrifuge tube and pellet beads by centrifugation at 500 x g for 3 min.Wash beads by removing supernatant, resuspending beads in 1 ml beads buffer and pelleting beads again by centrifugation. Repeat this washing step 3 times.Remove supernatant and resuspend beads in 200 µl beads buffer.Dilute PhyB-AviTag in beads buffer to a concentration of ~80 µg/ml and make 200 µl aliquots into 6x 1.5 ml microcentrifuge tubes.Add each 100 µl of beads suspension to 3 PhyB-AviTag containing tubes and each 100 µl of beads buffer to the 3 remaining tubes.Incubate for 1 h while mixing tubes every 15 min.Pellet beads by centrifugation and transfer 200 µl of the supernatants each into a new 1.5 ml microcentrifuge tube.Pellet remaining beads by centrifugation and transfer 100 µl of the supernatants each into a well of a black 96-well plate. Transfer 100 µl of the PhyB-AviTag samples without beads each into a well of the same plate.Illuminate proteins in the plate for 3 min with 740 nm light (intensity: 100 µmol/(m2·s)).",
    "Transfer the plate in the dark (only dim green safe light) into the microplate reader and measure phytochrome fluorescence of the 6 samples (excitation: 635 nm, emission: 680 nm). Estimate the ratio of non-biotinylated PhyB-AviTag as the quotient of the fluorescence of the beads and the buffer samples.Spectral analysis of PhyB-AviTag photoswitching (for representative results see Figure 3):Transfer 200 µl of PhyB-AviTag in protein buffer (concentration: ~1 mg/ml) into a well of a UV-transparent 96-well plate.Illuminate protein for 3 min with 660 or 740 nm light (intensity: 100 µmol/(m2·s)).Transfer the plate in the dark (only dim green safe light) into the microplate reader and measure absorbance spectra (250-900 nm, step size: 1 nm).Repeat the measurement for the other illumination wavelength using the same sample.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200228/20200228013438_0923.jpgFigure 3. Spectral analysis of PhyB-AviTag photoswitching. PhyB-AviTag (1 mg/ml, never frozen A. and frozen and thawed B. was illuminated for 3 min with either 660 or 740 nm light (intensity: 100 µmol/(m2·s)) before acquisition of the absorbance spectra (left panels). The absorbance spectra in A. and B. were each normalized to 1 at 280 nm absorbance of the corresponding 740 nm spectrum to compensate for slight protein concentration variations. The difference spectra (right panels) were calculated by subtracting the 660 nm spectra from the corresponding 740 nm spectra. The peak wavelengths of the main peaks and of the isosbestic point are indicated. Freezing and thawing PhyB-AviTag once did not affect its absorbance spectra.Analysis of light-dependent PhyB-AviTag/PIF6 interaction by size exclusion chromatography (SEC, for representative results see Figure 4):Produce and purify GFP-PIF6 as described for PhyB-AviTag with the following modifications:Transform plasmid pHB111 (encoding GFP-PIF6(1-100)-His6, (Beyer et al., 2018b) into E. coli BL21 (DE3)pLysS and select for transformed cells with 100 µg/ml ampicillin and 34 µg/ml chloramphenicol.",
    "After induction, incubate at 30 °C and 150 rpm for 6 h before harvesting.Determine protein concentration of PhyB-AviTag and GFP-PIF6 by Bradford assay (see Procedure B).Mix PhyB-AviTag (final concentration: ~2 mg/ml) with an equimolar amount of GFP-PIF6 in protein buffer (total volume: 800 µl) and distribute solution equally into 2x 1.5 ml microcentrifuge tubes. For the molecular weights of both proteins, see legend of Figure 2.SEC analysis:Protect SEC column from light with aluminum foil and connect it to an FPLC/Äkta system equipped with a 200 µl sample loop.Equilibrate column with 30 ml of protein buffer.Load protein solution from one microcentrifuge tube into a transparent syringe and illuminate the protein for 3 min with 660 nm or 740 nm light (intensity: 100 µmol/(m2·s)).Inject the protein in the dark (only dim green safe light) into the sample loop and start SEC run. Use a flow rate of 1 ml/min and monitor absorbance at 280 nm, 488 nm (GFP) and 671 nm (PhyB-AviTag). Once the protein is completely on the light-protected column (usually after a few ml), the room light can be switched on again.Calibrate the column by performing one run with a gel filtration standard.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200228/20200228013650_5542.jpgFigure 4. Analysis of light-dependent PhyB-AviTag/PIF6 interaction by size exclusion chromatography (SEC). A, B. 200 µl of an equimolar mixture of PhyB-AviTag (2.2 mg/ml) and GFP-PIF6 (1.2 mg/ml) was illuminated for 3 min with 660 or 740 nm light (intensity: 100 µmol/(m2·s)) and analyzed by SEC in the dark. Never frozen PhyB-AviTag and GFP-PIF6 A. and frozen and thawed proteins B. were analyzed. Freezing and thawing PhyB-AviTag and GFP-PIF6 once did not affect their light-dependent interaction. C. As control, 200 µl of never frozen PhyB-AviTag (2.2 mg/ml) was analyzed alone.",
    "The absorbance was monitored at 280 nm (total protein), 488 nm (absorption maximum of GFP-PIF6) and at 671 nm (isosbestic point of PhyB-AviTag). Calibration of the column with a gel filtration standard is indicated by the dotted line."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}