{
  "id": 6624,
  "origin_website": "Bio",
  "title": "Isolation, Purification, and Characterization of Ginger-derived Nanoparticles (GDNPs) from Ginger, Rhizome of <em>Zingiber officinale</em>",
  "procedures": [
    "Isolation (see Note 1) (Figure 1)Note: Approximate amounts of GDNPs 2 acquired from 1 kg of ginger is 50-100 ng/ml.  Wash 1 kg of roughly peeled ginger thoroughly with tap water.Grind sliced ginger with blender to obtain juice.Centrifuge approximately 550 ml of the ginger juice at 3,000 x g for 20 min at RT.Centrifuge again at 10,000 x g for 2 h at RT to remove large fibers.Collect the supernatant and equally distribute (~45 ml) into twelve 70 ml capacity tubes. Ultracentrifuge the collected supernatant at 4 °C, 150,000 x g for 2 h (Use Type 45 Ti 45,000 RPM). Ultracentrigfuge 6 tubes two times.Remove supernatant and suspend the pellet in each tube in 5 ml PBS through ultrasonic dispersion. After proper pipetting, all the nanoparticle pellets should be well suspended in PSC solution. If insoluble pellet exists, a cell strainer can be used to remove the insoluble pellet before loading to the gradient centrifugation. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190925/20190925232848_2593.jpgFigure 1. Ginger juice extraction. Sliced ginger is squeezed in the juicer to obtain juice for nanoparticle isolation and purification.PurificationPrepare twelve 38.5 ml capacity tubes filled with 10 ml of each sucrose solution in the order of 8%, 30% and 45% from top to bottom.Transfer 5 ml of the PBS suspended pellet from each tube to discontinuous sucrose gradient (8%, 30%, 45% [gram/volume]) in the 12 tubes and ultracentrifuge with SW 32 Ti rotor at 4 °C, 150,000 x g for 2 h (see Recipe 1). Ultracentrigfuge 6 tubes two times.Collect ~2 ml of band 2 and ~0.6 ml of band 1 respectively from 8/30% and 30/45% interfaces by gently dipping pipette tips into the sucrose gradient solution (see Data analysis).Ultracentrifuge the collected bands at 4 °C, 100,000 x g for 45 min (use Type 45 Ti 30,000 RPM), remove the supernatant.",
    "Wash the pellet with 1 ml PBS to remove the remaining sucrose and then suspend the pellet in 1 ml PBS through ultrasonic dispersion.Measure the concentration of obtained GDNPs (0.25~1.25 mg/ml) using protein quantification assay kit (follow the manufacturer’s manual) and microplate reader at absorbance of 750 nm. Note: Proteins contained by GDNPs were used to quantitate the GDNPs. The assay is based on the reaction of protein with an alkaline copper tartrate solution and Folin reagent (DC Protein Assay Instruction Manual). Proteins effect a reduction of the Folin reagent by loss of 1, 2, or 3 oxygen atoms, thereby producing one or more of several possible reduced species which have a characteristic blue color with maximum absorbance at 750 nm. Color development is primarily due to the amino acid tyrosine and tryptophan groups. For short term storage (less than 3 months), GDNPs can be suspended in PBS and stored at -80 °C. Long term stability has not been tested (Only Band 2 for Characterization; Discard Band 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190925/20190925232911_8419.jpgFigure 2. Sucrose gradient ultracentrifugation. GDNPs were added to 8, 30, 45 % of sucrose gradient and ultracentrifuged for purification.Characterization (GDNPs 2)Test the nanoparticle for its in vitro stability (see Note 6)Note: Measure particle size and zeta potential before and after incubation in SGF/IGF for comparison. Add 1 ml of nanoparticles (1 mg/ml) to 9 ml of simulated gastric fluid (SGF) and simulate intestinal fluid (SIF) in a separate tube.Mix thoroughly by inverting tubes.Dilute 0.2 ml of mixture into 1.8 ml PBS.Determine the particle size and zeta potential before incubation (follow Steps C2 and C3 below).Incubate the mixture in 37 °C water bath for 30 min.Determine the particle size and zeta potential after incubation.Measure particle size (Instruction for Steps C1d and C1f, see Data analysis, Figure 2)Dilute 0.",
    "2 ml of mixture into 1.8 ml PBS.Carefully add all of the diluted mixture to a cuvette without bubbles.Insert the cuvette to the particle analyzer chamber.Determine the size of particles.Measure zeta potential (Instruction for Steps C1d and C1f, see Data analysis, Figure 1)Carefully add 0.8 ml of mixture to capillary cell.Cover the capillary cell with plastic cap. Insert the cell to the chamber of zeta potential analyzer.Determine the numbers for the sample at neutral pH.Acquire transmission electron microscopy (TEM) image (Figure 5)Deposit a drop of sample onto the surface of a formvar-coated grid. Add 1% uranyl acetate on top of the sample and wait for 15 s (see Recipe 2).Carefully absorb the sample and uranyl acetate with tissue without touch the surface.Dry the sample at room temperature for 5 min.Scan the sample image with a transmission electron microscope. Acquire atomic force microscopy (AFM) image (Figure 6)Deposit 1 μl of nanoparticle sample to mica sheet.Dry the sample at room temperature.Gently rinse the mica sheet with 2.5 μl of distilled water three times.Dry the sample at room temperature again.Leave it until the sample become flat.Scan the sample with area of about 4 x 4 μm and 2-50 nm in height."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}