{
  "id": 8929,
  "origin_website": "Jove",
  "title": "Recombinant α- β- and γ-Synucleins Stimulate Protein Phosphatase 2A Catalytic Subunit Activity in Cell Free Assays",
  "procedures": [
    "1. Preparation of Buffers and Reagents\nPreparation of p-nitrophenyl phosphate (pNPP) buffer\nPrepare 50 mL of pNPP buffer as follows.\nWeigh out 0.30285 g Tris base (see the Table of Materials) and dissolve it in 25 mL of ultrapure deionized water.\n\t\t\nAdd 41.6 µL of 120 mM CaCl2. Adjust to pH 7.0 with 1 M HCl and bring the final solution volume to 50 mL with ultrapure deionized water.\nEnsure that the final concentration is 50 mM Tris-HCl, 100 mM CaCl2, pH 7.0.\nStore pNPP buffer at 4 oC.\nFor malachite green solutions, prepare the following.\nPrepare solution A by adding 32.8 mL of concentrated HCl to 67.2 mL of ultrapure deionized water to create a 4 M HCl solution.\n\t\tNOTE: Malachite solution is prepared in a fume hood using disposable gloves, face-mask, and safety goggles.\nPrepare solution B by weighing out 4.2 g of ammonium molybdate and adding it to 95.8 mL of solution A.\nPrepare solution C by weighing out 0.045 g malachite green oxalate salt and adding ultrapure deionized water to bring the final total volume to 100 mL.\nPrepare solution D by mixing solutions B and C at 1:3 (v/v) ratio, stir for 1 h at room temperature .\nFilter Solution D through a 0.22 µm pore size nitrocellulose membrane filter unit using a 50 mL syringe.\nStore prepared malachite solution at 4 oC protected from light.\nPreparation of activator\nTo prepare a 1% tween 20 solution, pipette 10 µL of tween 20 into 990 µL of ultrapure deionized water (v/v) then vortex until the tween 20 dissolves completely.\nPreparation of malachite green Tween 20 (MGT) working solution.",
    "Mix the activator (step 1.3) with the malachite green solution (solution D, step 1.2.5) in a ratio of 1:100 (e.g. 1 µL activator to 99 µL malachite green solution).\nPreparation of threonine phosphopeptide (KRpTIRR) (pT) substrate.\nTo prepare a 2 mM stock, place a 1 mg phosphopeptide vial on ice, add 550 µL of ultrapure deionized water, and vortex gently to dissolve.\n\t\t\nMake ~10 aliquots and store pT at -20oC.\nSynuclein Preparation\nPrepare synucleins in a fume hood using disposable gloves, face-mask, and safety goggles.\nResuspend 1 mg of recombinant synuclein in 1 mL ultrapure deionized water for a final concentration of 1 mg/mL.\nVortex gently to dissolve and place on ice.\nPrepare 50 µL aliquots and store at -80 oC.\nPreparation of phosphate standards\nPrepare the 0.1 mM phosphate stock solution as follows.\n\t\t\nWeigh out 0.1361 g KH2PO4 and place in a beaker with 80 mL of ultrapure deionized water. Add a stir bar and mix to dissolve. Transfer all of the solution to a graduated cylinder and bring the final total volume to 100 mL with ultrapure deionized water.\nFilter the entire solution through a 0.22 µm pore size nitrocellulose membrane filter unit using a 50 mL syringe; the final concentration is 10 mM.\nDilute the solution (10 mM) 1:100; the final concentration will be 0.1 mM phosphate (PO4) to be used for assay standards.\nStore the phosphate stock solution at 4 oC.\nSee Table 1 for limiting dilutions used to make PO4 standards with a final total volume of 1250 µL each. Add the appropriate amount of phosphate and ultrapure deionized water to 1.5 mL tubes as per Table 1.\n\t\t\nStore prepared PO4 standards at -20 oC.\ntable:\n﻿0,1,2,3,4,5,6\nPhosphate Standards,Phosphate Standards,Phosphate Standards,Phosphate Standards,Phosphate Standards,Phosphate Standards,Phosphate Standards\n0.1 mM PO4 solution (mL),0,75,150,300,600,1200\nUltrapure deionized water (mL),1250,1175,1100,950,650,50",
    "Final concentration of PO4 [pmol],0,150,300,600,1200,2400\nTable 1: Phosphate Standards.\n2. PP2A Assay in Response to Recombinant Synucleins\nNOTE: The total final volume for each reaction will be 60 µL, so the experimenter must adjust the initial volume of pNPP buffer appropriately to accommodate the volume of synucleins used for each sample. In most cases, the volume of pNPP buffer will be between 40 and 44 µL.\nPrepare each PP2Ac reaction as follows.\nIn a 1.5 mL tube, add 39 µL of pNPP buffer and place on ice.\nAdd 1 µL (105 ng/µL or 0.0007 U/µL) of human recombinant PP2Ac (rPP2Ac).\nAdd 4 µL of 0, 1.5, 7.5, 15 or 30 µM synucleins to rPP2Ac in pNPP buffer for final concentrations of 0, 0.1, 0.5, 1.0 and 2.0 µM and incubate at 4 °C for 30 min on a rotating unit; the final volume will be 60 µL.\nAfter 30 min, move samples to ice and add 16 µL of 2 mM pT substrate.\nIncubate each PP2A assay mixture for 10 min at 30 °C in a water bath with intermittent shaking.\nTo a flat bottom 96-well plate, add 25 µL of each PO4 standard (0, 150, 300, 600, 1,200, and 2,400 pmol) in duplicate wells from low to high.\nNext add 25 µL of each experimental sample (PP2A assay ± synuclein), prepared in steps 2.1.1 to 2.1.6, to duplicate wells on the same 96-well plate.\nNext, add 75 µL of MGT working solution to each well containing standards and samples.\nLeave plate at room temperature for 10 min.\nObserve a color change in samples having measurable differences in phosphate levels.\n3. Photometric Analysis\nAnalyze the 96-well plate containing standards and samples using a spectrophotometric plate reader with the wavelength set to 630 nm29.",
    "Plot the absorbance curve produced (samples read at 630 nm) and note that it remains linear up to 2,400 pmol concentration of PO4."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}