{
  "id": 18507,
  "origin_website": "Jove",
  "title": "A Novel Murine Model of Arteriovenous Fistula Failure: The Surgical Procedure in Detail",
  "procedures": [
    "All experiments were approved by the committee on animal welfare of the Leiden University Medical Center.\n1. Animal Preparation and Anaesthesia\nAnesthetize the mouse (1-3 months old) in a continuous anaesthetic induction chamber filled with 3-4% isoflurane.\nShave the ventral side of the neck and the inside part of the left upper leg using an electrical razor and use a piece of tape to remove the hair.\nApply ocular ointment on both eyes.\nPosition the animal on the heating blanket on which the nose ventilation mask is fixed. Fixate the head to the nose mask using adhesive tape.\n\t\nDeliver isoflurane at a concentration of 1.5-2.0% using oxygen enriched air set at the following flow: air 0.3 L/min, 100% oxygen 0.2 L/min. Pinch the skin between the toes to assess the depth of anaesthesia and adjust the concentration of isoflurane if needed.\nFixate the animal to the heating blanket with adhesive tape on all the limbs that is set at approximately 37 °C in a supine position.\nInject buprenorphine dissolved in sodium chloride (NaCl) 0.9% at a dosage of 0.1 mg/kg together with 0.5 ml of sterile NaCl 0.9% subcutaneously in the flank of the animal.\nApply chlorhexidine tincture 0.5% to the prepared area.\n2. Skin Incision\nPosition the animal under the microscope with its head towards the surgeon.\nMake a longitudinal incision of approximately 1.5 cm in the midline of the ventral neck using a micro scissor.\nGrab the salivary glands with forceps and displace the right salivary gland cranially until it is partly outside the wound.\n3. Dissecting and Preparing the Vein\nIdentify and bluntly dissect the dorsomedial branch of the right external jugular vein completely from its perivascular tissue by spreading just alongside and in the direction of the blood vessel.",
    "Place a loop (10.0 suture) around the dissected vein and apply one knot without locking it.\n4. Removing the Sternocleidomastoid Muscle\nUsing forceps, bluntly dissect the right sternocleidomastoid muscle from its surroundings by spreading along its border. Place a pair of open forceps under the isolated muscle and ligate it proximally and distally with a 6.0 suture. Subsequently, excise the muscle using a cauterizer.\n5. Dissecting and Preparing the Common Carotid Artery\nIdentify and dissect the right common carotid artery using forceps. Place a 6.0 suture thread around the artery to aid in the manipulation of the artery.\nApply vascular clamps as distally and proximally as possible.\nMake a longitudinal incision in the middle of the artery of approximately 1 mm using the specialised micro scissor.\nRinse the artery with a heparin solution [100 IU/ml] until the vessel is clear of blood.\nMeasure and adjust the length of the incision if necessary to match the width the vascular clamp [1.1 mm].\n6. Ligation of the Vein\nApply a vascular clamp proximally of the already prepared vein and place a suture thread around the vein.\nApply gentle caudal traction to the vein using a haemostat that is placed on the suture thread and ligate the vein as distally as possible using the 10.0 suture that was placed earlier.\nCut the vein using a scissor just proximally to the ligation.\nUsing vascular forceps, gently open the lumen of the vein and rinse it with a heparin solution [100 IU/ml].\n7. Creation of Anastomosis Part 1",
    "Connect the vein to the artery with an interrupted suture (10.0) using 2 square knots at the twelve o'clock position followed by a suture at the six o'clock position. Make sure to connect the vein to the artery without allowing it to rotate around its own axis. Rotate the animal in order to improve the surgical exposure.\nPosition a suture thread around the vein and apply gentle lateral traction using a haemostat.\nUsing the same interrupted sutures, complete the anastomosis by placing approximately 3-4 additional sutures at the visible ventral side of the anastomosis.\n8. Heparin Administration\nRotate heating blanket 180° and focus the microscope on the left upper leg.\nIdentify the femoral vein/artery/nerve bundle by looking for a vascular structure that runs longitudinally in the medial part of the upper leg and can be seen through the skin. Make an incision with the micro scissor of approximately 1 cm directly above the femoral vein in a lengthwise manner.\nCarefully dissect the perivascular tissue of femoral vein and inject heparin at a dose of 0.2 IU/g bodyweight in the femoral vein.\n9. Creation of Anastomosis Part 2\nReturn to the neck area and remove the suture thread that was placed around the vein.\nPlace a suture thread (6.0) that subsequently passes below the carotid artery, over the vein and again below the carotid artery. (Figure 1L)\nRemove the venous vascular clamp.\nNext, twist the half completed arteriovenous fistula 180° along the axis of the carotid artery in a clockwise manner by simultaneously twisting both the vascular clamps and apply medial traction to the ends of the suture thread.\nComplete the anastomosis in the same fashion as is described in step 7.2.\n10. Vascular Clamp Removal\nRemove the suture thread and rotate the vascular clamps 180° counter clockwise.",
    "Remove the distal vascular clamp followed by the proximal vascular clamp.\nAssess the patency of the anastomosis by gently occluding the venous outflow tract with the vascular forceps. In case of a patent anastomosis, the pre-occluding venous section will expand in a pulsatile fashion. Relocate the right salivary gland to its original anatomical position using forceps.\n11. Skin Closure and Postoperative Care\nClose the skin of the upper leg with an uninterrupted suture (6.0).\nClose the skin of the neck with an uninterrupted suture (6.0).\nRemove the animal from the heating blanket and inject 0.5 ml NaCl 0.9% subcutaneously.\nPlace the animal in a darkened cage that is heated with a heating lamp and let it recover fully. When an animal does not recover fully, make sure it does not suffer from a hemodynamic shock due to bleeding in the surgical area. Look for signs such as a swollen neck and the leakage of blood.\nAfter approximately 6 hr after the first injection of buprenorphine, inject a single dose of a sustained-release formulation of buprenorphine subcutaneously in a dose that is recommended by the manufacturer, in order to provide adequate analgesia for an additional 72 hr.   \n12. Tissue Harvesting\nAnesthetize the animal with an anesthetic-mixture containing midazolam (5 mg/kg), medetomidine (0.5 mg/kg) and fentanyl (0.05 mg/kg) administered intraperitoneally.\nFixate the animal in a supine position by inserting needles through its paws and cheeks into a non-heated silicon mat.\nMake an incision of approximately 1.5-2.0 cm over the scar in the neck with the micro scissor.\nDissect the AVF, and place suture threads (6.0) around the proximal-, distal artery and venous outflow tract for easy identification.\nAssess the patency of the AVF as is described in section 10.3 of the protocol.",
    "Open the peritoneal cavity by performing a medial laparotomy using the micro scissor.\n\t\nCut through the left and right ventral rib cage using a pair of scissors starting caudally in the midclavicular line. Using a micro scissor, transect the diaphragm that is attached to the middle part of the ventral rib cage and subsequently displace this section cranially using forceps.\nLocate the inferior caval vein and transect it with a micro scissor.\nInsert a needle 23 gauge needle in the left ventricle and perfuse with PBS at a pressure of approximately 100 mmHg until the intravasal fluid is nearly clear.\nWithout removing the needle, now perfuse with 4% formalin for 10 min at a pressure of approximately 100 mmHg.\nExcise the AVF by transecting both the arteries and vein with the micro scissor and submerge it in a 4% formalin solution O/N.\n13. Tissue Embedding and Sectioning\nProcess the tissue to paraffin according to the manufacture's protocol. The protocol applied consisted of the following:\n\t\nImmerse in Ethanol 70% for 1 hr at RT. Repeat 2x.\nImmerse in Ethanol 96% for 1 hr at RT. Repeat 2x.\nImmerse in Ethanol 99.5% for 1 hr at RT. Repeat once.\nImmerse in Ethanol 99.5% for 1.5 hr at RT.\nImmerse in xylene 100% for 1 hr at RT. Repeat once.\nImmerse in Parafin for 1 hr at 62 °C. Repeat 2x.\nEmbed the AVF in paraffin so that the venous outflow tract is orientated perpendicular to the embedding cassette.\nUsing a microtome, create 12 serial sections each consisting of 30 sections with a 5 µm thickness. Then of each serial section, place one section on a single mounting glass starting from position one up to twelve in an orderly fashion starting with the area closest to the anastomosis.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}