{
  "id": 10645,
  "origin_website": "Jove",
  "title": "An Ultrasonic Tool for Nerve Conduction Block in Diabetic Rat Models",
  "procedures": [
    "The Institutional Animal Care and Use Committee of the National Health Research Institutes in Taiwan approved all animal protocols.\n1. Induction of Diabetic Model in Male Adult Sprague - Dawley (SD) Rats\nRemove rat food pellets from the cage to fast male SD rats (300 - 350 g) for 6 h prior to STZ induction.\nPrepare sodium citrate buffer (0.1 M, pH 4.5).\n\t\nDissolve 1.05 g citric acid monohydrate (C6H8O7 · H2O; mol. wt. 210.14) in 50 mL distilled water to make a 0.1 M citric acid solution.\nDissolve 1.47 g trisodium citrate dihydrate (C8H5O7Na3 · 2H2O; mol. wt. 294.12) in 50 mL distilled water to make a 0.1 M sodium citrate solution.\nAdd 25 mL citric acid solution to 25 mL sodium citrate solution. Monitor the sodium citrate buffer pH (pH 4.5) using a pH meter.\n\t\tNOTE: The buffer is made isotonic by addition of an appropriate volume of 0.1 M sodium citrate solution.\nDissolve STZ in 0.1 M sodium citrate buffer to yield a 50 mg/mL STZ solution.\n\tNOTE: The STZ solution is light sensitive, therefore, cover the STZ solution with aluminum foil and use within 15 - 20 min.\nDraw the 50 mg/kg STZ solution into a 1 mL insulin or tuberculin syringe with 26- to 28-gauge needle. Clean the injection site with an ethanol pad and intraperitoneally inject the STZ solution into the lower right quadrant of the abdomen to avoid damaging abdominal organs.  \nSupply rats with 10% sucrose water as the sole water source for 48 h after STZ injection to prevent hypoglycemia.\n2. Confirmation of Diabetes in STZ-induced Rats\nMonitor the fasting plasma glucose concentration of all rats injected by STZ post 72 h with a glucose meter.\n\t\nFast the STZ-induced diabetic rats for 15 h before measuring the fasting blood glucose level.",
    "Restrain the rats in a restraint bag and expose the tails for blood collection during the blood glucose measurements.\nUse a blood lancet to prick the tip of the tail to obtain a small drop of blood. Place the drop of blood on a glucose test strip. Record the fasting plasma glucose levels.\n\t\tNOTE: The glucose meter detects and displays the blood glucose level in units of mg/dL. Exclude the rats with fasting blood glucose levels below 150 mg/dL after 2 weeks of STZ-induction.\n3. Evaluation of Peripheral Diabetic Neuropathy in Diabetic Rats\nAssess the mechanical allodynia with electronic von Frey.\n\t\nHabituate the STZ-induced diabetic rats in a cage on a 1 cm diameter metal mesh floor for 30 min before evaluating the hind paw withdrawal response.\nUse an electronic von Frey probe with rigid tip (0.8 mm in diameter) to manually apply pressure to the plantar surface of the hind paw of the rats, and gradually increase the pressure until a paw withdrawal response is seen.\nRecord the pressure that shows on the system and repeat the measurement 5 times per rat, with a 30 s interval between each measurement.\nAssess the heat hyperalgesia with a hot plate.\n\t\nHabituate the STZ-induced diabetic rats on the hot plate (24 ± 0.5 °C) for 10 min before evaluating the pain response.\nRemove and place the rats back into their cages after habituation, heat the hot plate and maintain the hot plate's temperature at 55 ± 0.5 °C.\nPlace the rat on the heated hot plate while simultaneously starting the timer.\nWhen the rat exhibits distinct behaviors, such as licking the hind paw or abnormally flicking the hind paw, stop the timer, and record the withdrawal latency.",
    "NOTE: If a rat does not express distinct behaviors after 20 s (20 s cut-off time), terminate the hot plate test and remove the rat from the hot plate.\n4. In Vivo Nerve Conduction Blockage with the HIFU Transducer\nNOTE: The in vivo experiment starts on week 5 after 50 mg/kg STZ injection.\nPerform animal procedures before blocking of the CMAPs with HIFU sonication.\n\t\nSterilize the surgical tools (scalpel, scissors, forceps, and glass hook) in an autoclave before the surgery.\nAnesthetize the rats with intraperitoneal injection of tiletamine/zolazepam mixture (40 mg/kg) and xylazine (10 mg/kg) or via inhalation of 1.75% of isoflurane via isoflurane vaporizer. Place the rats on a heating pad to maintain the body temperature.\nPosition the rats for surgery in ventral recumbency. Apply the eye ointment. Extend the leg of the rat and pinch the plantar surface of the foot with fingernails to ascertain the depth of anesthesia. If the rats show withdrawal responses, apply additional anesthesia.\nRemove hair from the thigh and lower back of the rats with an electric clipper. Apply liquid iodine with clean gauze at the surgical site and circularly move the gauze to the outward of the surgical site. Use an alcohol pad to wipe the liquid iodine with the same circular movement. This experiment is performed on the left and right surgical site. Repeat the procedure at the other surgical site when perform the next step of procedure.\nUse a sterile surgical scissors or scalpel to make an incision of the skin at the dorsal thigh. Use blunt surgical scissors to carefully separate the tissue underneath the skin and secure the skin with skin hooks. The femur can be seen within the muscles.",
    "Use the scissors to carefully separate the muscles parallel to femur until the mid-thigh sciatic nerve fibers that are embedded in the muscles are visible. Carefully use a glass hook to separate the mid-thigh sciatic nerve from the surrounding connective tissues and muscles.\nPosition the sciatic nerve in the HIFU focal zone using a custom-made nerve fixator (Figure 1 and Figure 3).",
    "NOTE: The custom-made nerve fixator consists of 3 components (Figure 3). All the components are made of transparent polymethylmethacrylate (PMMA). The external thread of the top structure of component I is 2.5 mm tall and M10XP0.7 (Figure 4A). The central well is a 4.0 mm-diameter hole through component I. The bottom opening of the well is sealed by a sheet of tape. The diameter of the slot is 1.2 mm and the distance between the central plane of the slot and the top surface of component I is 3.1 mm. Component II consists of a main body, four legs and the bottom structure (Figure 4B). The internal thread of the bottom structure is 2.5 mm tall and M10XP0.7 to fit the external thread of component I. The diameter of the central hole is the same as the central well of component I. The dimensions of the main body are 32 mm in diameter and 5.4 mm in thickness. Four legs are symmetrically deployed. Two identical short legs are designed for alignment and two identical long legs work for hooking on component III. The outer diameter and height of component III are 41 mm and 9.2 mm. The internal thread is M36XP1.0 and the through hole is 27.5 mm in diameter (Figure 4C). The cone is a hollow taper with the top opening of 84 mm in diameter and the bottom opening of 27.5 mm in diameter. The height is 57.5 mm (Figure 5A).\n\t\nBefore the experiment, soak the custom-made acrylic nerve fixator in bleach-solution for 30 - 60 min followed by soaking in sterile water.\nUsing a glass hook, lift the nerve carefully and put it in the slot of component I.",
    "Screw component II to component I. Fill the central well of component I with Ringer's solution for ultrasonic propagation and nerve preservation.\nScrew component III to the HIFU housing cone. Dock component III with component II through the four legs of component II.\n\t\tNOTE: The geometric center of three components and the transducer are aligned. The distance between the nerve and the transducer is equal to the focal length, which ensures the nerve is inside the HIFU focal zone.\nInsert one pair of acupuncture needles into the origin of the sciatic nerve and the other pair into the gastrocnemius muscle. Connect each pair of needles to the electrophysiology acquisition system through an electrical coaxial cable (Figure 1).\n\tNOTE: On one end of the cable are two alligator clips to clip two needles separately and on the other end of the cable is a BNC connector to link the system. The pairs of acupuncture needles work as stimulating electrodes at the sciatic nerve and the recording electrodes at the gastrocnemius muscle.\n\t\nSet the sampling rate and bandwidth of the electrophysiology acquisition system to 50 kHz and 70 Hz-3 kHz, respectively. Apply a supra-maximal stimulus with a pulse width of 0.1 ms to the stimulating electrodes at the origin of the sciatic nerve.\nRecord the CMAPs from the recording electrodes and amplify the CMAPs with the built-in amplifier in the electrophysiology acquisition system.\n\t\tNOTE: Use the built-in amplifier in the electrophysiology acquisition system to amplify the nerve signals and record the CMAPs from the recording electrodes with the electrophysiology acquisition system.\nUse a commercial 2.68 MHz HIFU transducer to suppress the CMAPs in diabetic neuropathic rats.",
    "NOTE: The specifications of the transducer are described as follows: a single-element spherical bowl with aperture diameter of 6 cm and focal length of 5 cm, and an ellipsoid focal zone of 4 mm in depth and 0.8 mm in width in the free field.\n\t\nImmerse the spherical cone, the HIFU transducer and the cone cover in the tank filled with degassed water. Put the HIFU transducer into the spherical cone and fix the cone cover to the top opening of the spherical cone by 6 head screws (Figure 5B). After bubbles in the spherical cone are expelled naturally due to the low density of bubbles compared with water, seal the front-end opening of the cone by a transparent 0.03 mm thick tape. Screw component III onto the spherical cone.\nTake out the HIFU transducer with the spherical cone and component III from the degassed water tank.\n\t\tNOTE: The reverse osmosis water used in the study is the water purified by the process of reverse osmosis. The reverse osmosis water is boiled to expel the gas. After cooling, the degassed water is obtained in an individual sealed tank.\nPut component I into the space between the nerve and the muscle carefully, and position the nerve in the gap of component I. Perform steps 4.2.3 and 4.2.4 to ensure that the nerve is inside the focal zone of the HIFU (Figure 3A).\nLink a function generator and a radiofrequency power amplifier. Connect the power amplifier to the HIFU transducer for generation of the HIFU beam. Manually set the voltage output of the function generator to the HIFU transducer via the power amplifier. Manually turn off the function generator once the HIFU-exposure time is up. Observe time using a timer.",
    "NOTE: The intensity and energy of HIFU beam used in this study are 2,810 W/cm2 and 84 J/mm2, respectively.\nSimultaneously, deliver the stimulus via the electrophysiology acquisition system (step 4.3) and HIFU beam via HIFU system (step 4.6) to the sciatic nerve while recording the CMAPs. Gradually increase the HIFU exposure on the sciatic nerve from 3 s, 5 s to 8 s until decrease or inhibition of the amplitude of CMAPs is observed.\n\t\nRecord the CMAPs once per second during the delivery of the HIFU beam. After observing the change in the amplitude of CMAPs, turn off the HIFU system and manually click on the record icon on the electrophysiology acquisition software to record CMAPs every 2 min in the early 10 min, every 5 min in the consecutive 30 min, and every 10 min in the last phase until the recording time reaches 2 h.\nSeparate component II and III of the nerve fixator (Figure 3) to remove the HIFU transducer from the incision site. Separate component II and I to release the secured sciatic nerve. Suture the surgical site of the diabetic rat by 4-0 chromic catgut sutures after recording the CMAPs. Apply liquid iodine to the surgical site to prevent infection.\n\t\nPlace the cages on the heating pad and allow the rats to recover in their cages before returning them to the animal facility. Provide the rats with ibuprofen in drinking water for 3 days or intraperitoneal injection of buprenorphine (0.05 - 0.1 mg/kg).\nInsert stimulating and recording electrodes in the origin of the sciatic nerve and the gastrocnemius muscles of anesthetized diabetic neuropathic rats as described in steps 4.1.2 and 4.3 on days 7, 14, and 28 after the initial HIFU sonication. Repeat steps 4.3.1 to 4.3.2.",
    "Place the cages on the heating pad and allow the rats to recover in their cages before moving the cages to the animal facility.\nEuthanize the rats after the experiment. Place the rat in a carbon dioxide chamber. Wait about 5 min for the rats to stop breathing. Ensure that the heart has stopped beating.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}