{
  "id": 9293,
  "origin_website": "Jove",
  "title": "Subtype-selective Electroporation of Cortical Interneurons",
  "procedures": [
    "All animals were treated in accordance with the regulations and guidelines of the Institutional Animal Care and Use Committee of the NYU School of Medicine.\nMouse Strains\nSwiss Webster female mice provided by TACONIC were used for these experiments. In order to specifically target superficial layer interneurons, e15.5 embryos were used.\nNote: The plasmid used in this work (Dlx5/6.eGFP plasmid 3 µg/µl) was generated using standard cloning techniques. The eGFP cDNA was cloned into a Dlx5/6-Pmin-polyA plasmid. This plasmid is available upon request (demarn02@nyumc.org).\n1. Preparation of Microinjection Pipettes\nSet the puller Heat #2 to 860.\nPlace and secure the glass capillary near the filament. Check that the outer diameter (OD) of the pipette is roughly 30 μm.\nPress the “pull” button.\nCarefully remove the capillary. The bottom part is the needle. Discard the top part.\n2. Anesthesia Procedure\nPrepare an isoflurane containing chamber. Note: Isoflurane is the preferred anesthetic due to its fast action and low incidence of side effects. Pentobarbital is another option; however, tolerance of this drug is variable and may lead to a higher mortality rate than isoflurane.\nSet the flow of isoflurane to 4-5% in 0.5-1 L/min O2.\nMake sure that the valve for the chamber is open whereas the valve for the head adaptor is closed.\nPlace the pregnant mouse in the chamber.\nAllow the mouse to go under the effect of anesthesia. This will take about 2-3 min. Check the breathing rate. If the mouse begins hyperventilating, lower the dose of isoflurane.",
    "After the mouse is anaesthetized, promptly remove it from the chamber. Place it ventral side up on the heating pad and insert the head in the mask that will continue to supply isoflurane throughout the surgery. Make sure to switch the flow of isoflurane from the chamber to the tubing connecting the head adaptor piece. Put a drop of eye lubricant in each eye and close the eyes.\nSet the heating pad to 36 °C degrees to minimize hypothermia.\nCheck for the absence of foot and tail reflexes by pinching the rear paws and the tail.\n3. Surgery\nCleanse the skin covering the abdomen with 70% ethanol.\nUse forceps to pull the skin upwards. After each surgery, wash all instruments with detergent and water, and sterilized at 72 °C O/N.\nMake a small vertical incision (about 2 cm) along the midline starting midway between the third and fourth pairs of mammary glands. Use fine surgery scissors. Take care to not damage the abdominal wall.\nGently separate the skin from the peritoneum.\nVisualize the arteries and veins on the abdominal wall. Make another 2 cm vertical incision through the peritoneum (avoiding the vessels) to expose the abdominal cavity.\nClamp the skin and abdominal wall on each side avoiding clamping the arteries. Note: If the arteries are accidentally punctured, sacrifice the animal immediately by performing cervical dislocation or isoflurane overdose.\nPre warm the sterile PBS to 37 °C. Cover the clamps with PBS moist Kim wipes.\nMoisturize the exposed abdominal cavity with PBS. Repeat this step several times while performing the surgery.",
    "Using round forceps, gently pull the embryonic chain (e15.5) away from the cavity. Let the chain rest on the wet wipes. Start by exposing one half of the uterus first. Once the embryos in it are electroporated, bring it back inside, then work on the second half.\n4. Electroporation\nContinue to use round forceps to manipulate the embryos.\nVisualize the lateral ventricles. The lateral ventricles run along the midline (Figure 1b).\nAdd Fast Green (Stock: 10% w/v) to the DNA solution for a 1:20 mixture to visualize it during the injection. Prepare the DNA solution by dissolving the pellet obtained from a standard maxi-prep purification protocol in distilled water.\nUse pre pulled micropipettes with a plunger to inject 1 ml of DNA solution (Dlx5/6-eGFP, 3 µg/µl) with Fast Green. Cut the tip of the micropipette with a fine forcep #5 (Dumont) to leave 6 mm length from the beginning of the shoulder to the end of the tip of the needle before loading the pipette. Hold the head of the embryo with round tweezers. Enter the brain with the pipette at a 45° angle aiming for the lateral ventricle located near the midline. If the needle penetrates through the ventricle, slowly retract the pipette as you use the plunger to inject DNA. The ventricle should turn green when the solution begins to fill it. At this point, stop moving the pipette and inject 1 ml of DNA. Gently, withdraw the pipette.\nSet the CUY21 electroporator to five 45V pulses of 50 msec spaced by 950 msec.\nUse 5 mm paddle electrodes for e15.5 embryos. Dip the electrodes in PBS to ensure efficient current transmission.",
    "Place the electrode paddles around the embryo’s head with the positive paddle on the ventricle containing the DNA solution. Slightly lower the positive paddle with respect of the negative one to create a ventral current through the ganglionic eminences. This manipulation will minimize ectopic expression in pyramidal cells.\nAfter placing the electrodes, deliver a pulse by pressing the foot pedal once.\nRemove the electrodes and wipe them clean. Repeat steps 4.6-4.9 with each embryo.\nAfter electroporating all the embryos, pour 3 ml of PBS into the abdominal cavity and return them to the abdominal cavity.\nFirst suture the abdominal wall with a curved needle and 5-0 silk suture and then the skin. Apply Lidocaine (4%) on the wound. Administer 120 mg/kg of Aspirin intra peritoneum for analgesia.\n\tNote: The entire procedure should be performed in 20 min or less. It is advisable that beginners only electroporate a few embryos to keep the operation time short. Prolonged surgeries will decrease the survival rate of the embryos.\nRemove the animal from the anesthesia tubing and allow recovery on the heating pad on a paper wipe.\nReturn animal to the cage, keep it on the heating pad at 37 °C and monitor the health status. The animals generally tolerate the surgery well and begin to move slowly soon after they are removed from the anesthesia tubing. If excessive bleeding or lethargy is observed, sacrifice the animal immediately by performing IACUC approved euthanasia procedures such as cervical dislocation or anesthesia overdose.\nReturn cage to the vivarium. The females will give birth naturally.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}