{
  "id": 2441,
  "origin_website": "Cell",
  "title": "Protocol for high-throughput screening of ACE2 enzymatic activators to treat COVID-19-induced metabolic complications",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStructure-based virtual screening method\nTiming: ∼1 day\nDrugs obtained from the DrugBank library were virtually docked with preprocessed ACE2 protein structure (PDB code: 1R42) in certain grid for enzymatic activators screening. The whole scripts for preparing and analyzing molecular docking could be found on https://doi.org/10.5281/zenodo.6865580[href=https://doi.org/10.5281/zenodo.6865580].\nDetermine the docking site. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nDownload the ACE2 protein files (PDB code: 1R42) from RCSB PDB website (https://www.rcsb.org[href=https://www.rcsb.org]) in PDB format (named as “1R42.pdb”).\nOpen graphical user interface of Schrödinger software and input the “1R42.pdb” file (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1925-Fig1.jpg\nFigure 1. Pre-processing procedures of molecular docking analysis\n(A) Snapshot of “Input the protein” step in Maestro (Schrödinger UI package).\n(B) Snapshot of “Remove the solvents” step in Maestro.\n(C) Snapshot of “Process the protein” step in Maestro.\n(D) Snapshot of “Find the binding sites by SiteMap” step in Maestro.\n(E) Snapshot of “Select the site 2 binding site” step in Maestro.\n(F) Snapshot of “Generate the receptor grid file” step in Maestro.\nSelect solvents by clicking the “S” button on the toolbar and then use “delete” on the keyboard to delete them (Figure 1[href=https://www.wicell.org#fig1]B).\nPreprocess the protein by clicking the “protein preparation” button on the toolbar, and then a popup will appear. Click the “Process” button on the popup with default settings (Figure 1[href=https://www.wicell.org#fig1]C).\nDetermine potential receptor binding sites with SiteMap (Figure 1[href=https://www.wicell.org#fig1]D). Click the “TASKS” button on the toolbar and search “SiteMap”, then a popup will appear. Keep all the default parameters and click “Run” button.\nSiteMap calculates 5 potential binding sites and displays them on the graph interface (Figure 2[href=https://www.wicell.org#fig2]). and select “site 2” located in the hinge-bending region of ACE2 protein based on the hypothesis that the potential activators could keep the ACE2 protein pocket open (Kulemina and Ostrov, 2011[href=https://www.wicell.org#bib6]) (Figure 1[href=https://www.wicell.org#fig1]E).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1925-Fig2.jpg",
    "Figure 2. ACE2 structure and its binding sites calculated by Sitemap tool\n(A) The native (grey color) and inhibitive (green color, PDB code: 1R4L) state of ACE2 enzyme structure.\n(B–F) The site 1 to site 5 calculated by Sitemap tool. Here, regions within the binding site suitable for occupancy by hydrophobic groups or by ligand hydrogen-bond donors, acceptors, or metal-binding functionality, were highlighted.\nPrepare the receptor grid generation.\nOpen the “Receptor Grid Generation”.\nSet the docking site box with the centroid of “site 2” (center_x = 68.2 Å, center_y = 64.8 Å, center_z = 39.5 Å) and box length equal to 20 Å (Figure 1[href=https://www.wicell.org#fig1]F).\nProcess ligand library.\nObtain the script from website (https://doi.org/10.5281/zenodo.6865580[href=https://doi.org/10.5281/zenodo.6865580]).\nDownload the DrugBank library from website (https://go.drugbank.com[href=https://go.drugbank.com]).\nRun the bash script “bash run_process_drugbak.sh” to prepare the input files for docking.\nRunning molecular docking.\nRun the bash script “bash initial_glide_input.sh” to prepare the input files for Glide.\nRun the script “bash run_glide.sh” to start molecular docking.\nNote: We recommend standard precision (SP) glide docking, which performs exhaustive sampling and balances between speed and accuracy. Another extra-precision scoring function is optional, named XP, which employs a more sophisticated evaluation for protein-ligand interactions than SP and costs more than double time than SP.\nPrioritize repositioned drug candidates\nTiming: ∼3 h\nRepositioned drug candidates are ranked primarily according to their binding affinity with ACE2 protein. We first selected 7,767 compounds with the potential to directly bind to and activate ACE2.\nPrioritize the drug candidates using Score term in glide output file. Troubleshooting 2[href=https://www.wicell.org#troubleshooting]. The “Score” is defined by the following formula:\n  Score = a × vdW + b × Coul + Lipo + Hbond + Metal + Rewards + RotB + Site",
    "Where the coefficients of a and b are 0.050 and 0.150, respectively. And the other terms are: vdW = van der Waals interaction energy. Coul = Coulomb interaction energy. Lipo = Lipophilic-contact plus phobic-attractive term. HBond = Hydrogen-bonding term. Metal = Metal-binding term (usually a reward). Rewards = Various reward or penalty terms. RotB = Penalty for freezing rotatable bonds. Site = Polar interactions in the active site.\nRun the command of “glide_sort -R glide_result_lib.sdfgz > top_ligand_ranked.dat” to obtain ranked compounds.\nHere, we empirically selected 7,767 compounds based on “Score” value no more than -4 kcal/mol (Table S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1925-Mmc1.xlsx]).\nMolecular dynamics analysis of top ranked drugs (optional)\nTiming: ∼30 days\nTo get more accurate binding affinity between compounds and the ACE2 protein and its influence on ACE2-Spike binding, we also carried out molecular dynamics simulations for protein-ligand complex. Here, imatinib and methazolamide were experimentally verified to treat COVID-19 induced metabolic complications in mice via activation of ACE2 enzyme (Li et al., 2022[href=https://www.wicell.org#bib7]). We chose these two drugs for further molecular dynamics simulation for detailed docking binding structure.\nProcess structure of SARS-CoV-2 spike receptor-binding domain bound with ACE2.\nObtain the crystal structure file of SARS-CoV-2 spike receptor-binding domain bound with ACE2 file (PDB code: 6M0J) from website (https://www.rcsb.org[href=https://www.rcsb.org]) in PDB file (named as “6M0J.pdb”).\nOpen graphical user interface of Schrödinger software and load the “6M0J.pdb” and “1R42.pdb” file.\nProcess structure by removing solvents, ions and other molecules following the same step of “Determine the docking site”.\nAlign the 6M0J protein to the previous processed 1R42 protein. Select the 6M0J and 1R42 in the workspace and then click the “Quick Align” button.\nExport the 6M0J protein for the next step.\nPrepare the input files for molecular dynamics.",
    "Prepare ligand. We first calculated the charges using the quantum software (Gaussian 03, revision C. 02) and then used antechamber to obtain a mol2 file containing the RESP charges. The GAFF force field was then applied to the ligand using AmberTools.\n>antechamber -i ligand.out -fi gout -c resp -o ligand_resp.mol2 -fo mol2 -pfy\n>parmchk -i ligand_resp.mol2 -f mol2 -o ligand.frcmod\nOpen the tleap tool in AmberTools, and then execute the following command.\n>source leaprc.gaff\n>loadamberparams ligand.frcmod\n>lig = loadmol2 ligand_resp.mol2\n>check lig\n>save amberparm lig lig.prmtop lig.inpcrd\nUse the acpype tool in AmberTools to convert file format for GROMACS.\n>acpype -p lig.prmtop -x lig.inpcrd\nPrepare protein.\n>gmx pdb2gmx -f protein.pdb -o protein.gro -water spc -ignh\nRun the bash script “bash run_gromacs.sh” to carry out molecular dynamics.\nRun the bash script “bash mmpbsa_run.sh” to calculate binding affinity by MM-GBSA method. Here, the last 100 ns trajectories were used for analysis. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nNote: Some compounds were not available for simulation due to lack of certain structure information in the GROMACS.\nSignature-based drug reposition screening for treating COVID-19 from the CMAP\nTiming: ∼7 days",
    "The CMAP represents a classic analysis tool for signature-based drug repositioning, and is an online platform conducting pattern-matching algorithms to compare input gene signatures with its profiled gene signatures in diverse contexts of over 30,000 chemical perturbagens (Subramanian et al., 2017[href=https://www.wicell.org#bib13]). Transcriptome profile from public database or unpublished data could be applied for this step, with differentially expressed genes (DEGs) signature of SARS-CoV-2 infection. A transcriptome profile from public database (Liao et al., 2020[href=https://www.wicell.org#bib8]) was applied as the walk-through example in the following steps. The 10–150 most up-regulated DEGs were required for CMAP analysis, with optional up to 150 most down-regulated DEGs. This analysis aimed to obtain potential candidate compounds for treating COVID-19 induced metabolic complications based on transcriptional signature.\nCollect transcriptome profile of SARS-CoV-2 infection. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nSearch references reporting RNA-seq of SARS-CoV-2 infection from PubMed (https://pubmed.ncbi.nlm.nih.gov[href=https://pubmed.ncbi.nlm.nih.gov]), Web of Science (https://www.webofscience.com[href=https://www.webofscience.com]) and in some cases from preprint archive website like Biorxiv (https://www.biorxiv.org[href=https://www.biorxiv.org]). For instance, search terms ’transcriptome’, ‘RNA-seq’, ‘COVID-19’ and ‘SARS-CoV-2’ were applied in PubMed, and the corresponding bulk RNA-seq focusing on messenger RNA library from Gene Expression Omnibus (https://www.ncbi.nlm.nih.gov/geo[href=https://www.ncbi.nlm.nih.gov/geo]), National Genomics Data Center (https://ngdc.cncb.ac.cn[href=https://ngdc.cncb.ac.cn]) and et cetera was further collected.\nProcess the collected RNA-seq profiles before application in CMAP. Three types of RNA-seq data were usually provided by the references. Namely, original Fastq or Sam file, matrix of RPKM or raw counts of each sample and DEGs tabulations. Process the Fastq/Sam file or matrix of RPKM/counts data with classic transcriptome analysis pipeline to obtain the DEGs tabulation of SARS-CoV-2 infection vs. mock.\nFilter the DEGs with p adjusted value < 0.05, and further rank the DEGs with fold change of SARS-CoV-2 infection vs. mock. The 10–150 most up-regulated DEGs were required for CMAP analysis, with optional up to 150 most down-regulated DEGs.",
    "Input transcriptome profile and analyze potential off-target effect of compounds in CMAP. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nLog in the CMAP official website, and press ‘Tools’ button in the CMAP official site. Use the ‘query’ section in the drop-down menu. And you would enter the query interface.\nName your project and then select ‘Gene expression (L1000)’ from the drop-down menu of ‘Query parameters’. Leave the remaining query parameters as default settings.\nAs CMAP prioritizes potential compounds with similarity against the input transcriptomic gene set, input the 10–150 most up-regulated DEGs in the ‘UP-regulated genes’ box, while input the most down-regulated DEGs, up to 150, in the ‘DOWN-regulated genes’ box optionally (Figure 3[href=https://www.wicell.org#fig3]A). Then press submit, and wait for the query result.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1925-Fig3.jpg\nFigure 3. Application of the CMAP\n(A) Snapshot of “Clue query” step in the CMAP.\n(B) Snapshot of “HEAT MAP” step in the CMAP.\n(C) Snapshot of “Query result” step in the CMAP.\nOnce the query was finished, select the query and press ‘HEAT MAP’. This would lead you to another webpage called ‘CLUE MORPHEUS’ and might require a few minutes for data loading (Figure 3[href=https://www.wicell.org#fig3]B).\nOnce the webpage was loaded, select the ‘query result’ tab, and the full details of the CMAP analysis would be shown in an online interactive tabulation. To download this online data, press ‘File’ and use ‘Save Dataset’ (Figure 3[href=https://www.wicell.org#fig3]C). This would generate a GCT file that could be open by Excel or Python.",
    "CMAP archived several different kinds of perturbations, like compounds treatment, overexpression or knockdown gene manipulations. In this protocol, we focused on the compounds, which was named as ‘trt_cp’ in the ‘pert_type’ column. The candidate compounds could be ranked with the ‘norm_cs’, which was the similarity scores of transcriptional signatures of candidate compounds against the signature of our input transcriptomic gene set, meaning the compounds with the highest positive scores held the most similar transcriptional signatures when comparing with our input downregulated and upregulated genes, whereas the compounds with the lowest negative scores held the most opposite transcriptional signatures. To obtain compounds that could potentially reverse SARS-CoV-2 infection gene alterations, filter and rank the compounds with negative score. You could use certain cutoff value or limit compound numbers as the output criteria for compounds list, in the walk-through instance, we applied -1.35 as the threshold (Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1925-Mmc2.xlsx]).\nOptional: You could input gene signatures based on global proteomics data in the CMAP.\nNote: The P adjusted value used in DEGs filtering could be tailored in certain cases. Official HUGO symbol or Entrez ID were required in the gene input box, we recommended to use Entrez ID to avoid misinterpretation.\nComprehensive ranking of compounds based on virtual screening and CMAP\nTiming: ∼2 h\nWith the help of virtual docking analysis of potential ACE2 enzymatic activators and CMAP analysis of potential SARS-CoV-2 treating compounds, two lists were obtained respectively. This following step aimed to obtain comprehensive ranking of the overlapped compounds from these two lists to set up the final candidates list for further in vitro or in vivo validation, which in potential might treat COVID-19 induced metabolic complications via activating ACE2.\nOverlapped compounds selection from two lists.",
    "Filter two lists with same ID. As virtual screening would give generic names, database string ID from the compounds dataset and CMAP would give generic names, ID conversion was required for intersection selection. We recommend the use of Canonical Simplified Molecular Input Line Entry System (SMILES) or International Chemical Identifier (InChI) for ID conversion.\nIntersection selects overlapped compounds from two lists using online Venn diagram (https://bioinfogp.cnb.csic.es/tools/venny/index.html[href=https://bioinfogp.cnb.csic.es/tools/venny/index.html]) or function based on R or python.\nForm the common compounds list with compound ID, virtual docking energy and CMAP score.\nComprehensive ranking of overlapped compounds.\nRank each compound based on virtual docking energy and CMAP score separately.\nLet rvir denote the rank of compounds list based on virtual docking energy, rcmap denote the rank of compounds list based on CMAP score and ρcompre denote the product of two ranks. The formula can be expressed as\n   ρ compre  =  r  v i r   ×  r  c m a p    \nPrioritize the common compounds based on the new ρcompre value to obtain the final compounds list (Table S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1925-Mmc3.xlsx]).\nOptional: If multiple compounds lists were obtained and comprehensive ranking was required, other more complex rank aggregation algorithm could be applied, like TopKLists or RobustRankAggreg based on R package.\nNote: This step gives a comprehensive ranking list with candidates that would potentially treat COVID-19 induced metabolic complications via activating ACE2 enzymatic activity, the further in vitro or in vivo analysis were required for final verification."
  ],
  "subjectAreas": [
    "Immunology",
    "Structural Biology",
    "Bioinformatics",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}