{
  "id": 10470,
  "origin_website": "Jove",
  "title": "Morphometric Protocol for the Objective Assessment of Blastocyst Behavior During Vitrification and Warming Steps",
  "procedures": [
    "All methods described here have been approved by the National Medical Ethics Committee on 19 April 2016 (No. 0120–204/2016–2).\n1. Set-up of the Microscope Recording System\nTurn off the heating plate of the microscope.\nBefore any treatment, take a snapshot of a blastocyst under a camera-equipped inverted microscope. Remember to note the magnification at which the blastocyst was recorded.\n2. Selection and Prepreparation of Blastocysts for Vitrification\nSelect only fully expanded day-5 or day-6 blastocysts for cryopreservation with at least a few inner cell mass (ICM) cells and cohesive trophectoderm.\nFor laser-treated blastocysts with a collapsed blastocoel, subject a blastocyst to a short laser pulse (0.4 - 0.7 ms) with a hole diameter ranging from 4.3 to 9.4 µm, tangentially directed at the zona pellucida and at a junction of two adjacent trophectodermal cells. Allow the blastocyst to fully or partially collapse for 5 min.\nFor untreated blastocysts with an intact blastocoel, perform no particular treatment before vitrification.\n\tNote: These blastocysts are considered intact.\n3. Preparation of Cryoprotectant and a Petri Dish for the Equilibration Phase\nUse pithe pipette for oocyte denudation (diameter 135 µm) to aseptically fill equilibration media (M-199 HEPES-buffered medium with 7.5% DMSO, 7.5% ethylene glycol, 20% DSS) into the holes of the microdroplet area of a 9-well Petri dish specially designed for time-lapse microscopy and recording.\n\tNote: Oocyte denudation is a process of removing cumulus cells surrounding the oocyte. The use of a pipette for oocyte denudation will help to avoid the creation of air bubbles.\nOverlay the microdroplet area with 30 µL of equilibration media.\n4. Transfer of the Blastocyst in Equilibration Solution\nSubmerge a laser-treated or intact blastocyst into the equilibration medium to the bottom of the microdroplet area of the microdroplet dish for 10 min at room temperature (equilibration phase).",
    "Start a 10-min countdown as soon as the blastocyst is transferred to the equilibration medium.\n5. Recording of the Blastocyst at the Equilibration Phase\nTransfer the microdroplet dish with the blastocyst to a camera-equipped microscope. Use the same magnification as previously for taking a snapshot of the same blastocyst. Position the microdroplet dish so that the blastocyst is positioned approximately in the center of the recording.\nStart recording with the microscope recording software. Note the countdown time at which the recording is started.\n\tNote: See representative results of recordings of an intact (Figure 1, Video 1) and a collapsed blastocyst (Figure 2, Video 2) during the 10-min exposure to an equilibration solution.\n6. Vitrification of the Blastocyst\nAseptically dispense a 50-µL drop of vitrification solution (M-199 HEPES-buffered medium with 15% DMSO, 15% ethylene glycol, 20% DSS, 0.5 M sucrose) in a Petri dish 2 min before the countdown ends.\nStop recording when the 10-min countdown ends and quickly transfer the blastocyst to vitrification solution for 30 s at room temperature.\nGently pipette the blastocyst at least 1x within the vitrification solution.\nUse a vitrification straw for loading the blastocyst. Load, seal, and plunge the vitrification straw into liquid nitrogen (LN) within 80 s, not exceeding 110 s after the initial exposure to the vitrification solution.\n7. Video Editing of the Recorded Blastocyst During the Equilibration Phase\nImport a recorded video file into video editing software.\nMove the timeline slider to 20 s. Note the frame number at this time.\n\tNote: This number will be used to decimate unnecessary video frames. Only frames every 20 s will be used.",
    "Click the Video tab, then Frame rate.... Under Frame rate conversion, check the Decimate by field and enter the previously noted frame number. Confirm by clicking OK. Click File → Export → Image sequence.\nChoose JPEG as the output format, set the directory to hold the saved sequence of images, and click OK.\n\tNote: This will create a directory with up to 30 images of the recorded blastocyst in sequence during the equilibration phase of vitrification.\n8. Measurements of the Blastocyst’s Cross-sectional Area from Images Created During the Equilibration Phase\nOpen the video analysis software. Click the Window tab and select Timeline.\nIn the Timeline pane, click on the film strip sign and choose Add Media... to add an image of the blastocyst before the equilibration phase of vitrification—and before the laser intervention, if there was any.\n\tNote: This image will show the blastocyst at its most expanded state and its cross-sectional area will serve as a reference.\nAdd the image sequence of the corresponding blastocyst generated previously with video editing software (of the equilibration phase of vitrification).\nGo to Image → Analysis → Select Data Points → Custom to open the Select data points window.\nDeselect all data points, then select only Area, and confirm by clicking OK.\nMove the timeline slider in the Timeline window to the first image.\nClick the Window tab and choose Tools.\n\tNote: This will activate the Tools panel on the left side.\nChoose the Quick Selection Tool.\nPosition the tool marker inside the blastocyst to touch the edge of the blastocyst. Outline the blastocyst by placing the tool marker on the blastocyst’s outer edge, clicking and holding the left mouse button, and dragging the tool marker along the blastocyst’s outer edge until the whole blastocyst’s cross-sectional area is selected.",
    "Note: Zona pellucida is not a part of the measurement, so it must be excluded (Figure 5).\nIn the Timeline window, click the Measurement Log and press the Record Measurements button.\n\tNote: This will record the selected area.\nReturn back to the Timeline, right-click on the image, and choose Deselect.\nMove the timeline slider to the next image and click on the corresponding tile beneath it.\nOutline the blastocyst in the new image with the Quick Selection Tool. Repeat the measurement.\nRepeat this procedure (steps 8.9 - 8.13) image by image until all the images’ cross-sectional areas are measured and recorded.\nIn the end, go to the Measurements Log, select all the measurements under the Area variable, and export them in a .txt file.\n\tNote: The units of the cross-sectional area are square pixels.\n9. Editing of the Data File with the Recorded Blastocyst’s Cross-sectional Areas from Images Created During the Equilibration Phase\nTransfer the data of the recorded blastocyst’s cross-sectional areas from the .txt file to a spreadsheet editor.\nUse the first cross-sectional area value as reference value 1 and express (transform) all the other values to be a fraction of that reference value.\nCreate a new variable Area_r and paste the transcoded area values (except the reference value) under it.\nNext to the Area_r variable, create a Time variable and add the first time value.\n\tNote: The first time value represents the time which passed from the moment the blastocyst was exposed to the equilibration solution to the onset of recording under a camera-equipped microscope.\nCalculate each next consecutive time value by adding 20 s to the previous time value.\n\tNote: This is the time interval used at decimating unnecessary video frames created during the recording.\n10. Warming of the Blastocyst\nPrepare media for warming.",
    "A day before warming the blastocyst, aseptically dispense three 150-µL drops of recovery medium in a 4-well dish. Also, aseptically dispense recovery medium in a microdroplet 9-well dish specially designed for time-lapse microscopy and recording. Cover the recovery medium with paraffin oil and preincubate it at 37 °C with 6% CO2 and 5% O2.\n\t\tNote: Recovery medium is a cultivation medium for blastocyst-stage embryos with added human serum albumin (HSA). The HSA in the recovery medium should be 12 mg/mL. To fill the holes in the 9-well dish, use a pipette for oocyte denudation to avoid the creation of air bubbles, then overlay the microdroplet area with 30 µL of recovery medium.\nOn the day of warming the blastocyst, aseptically dispense 500 µL of thawing solution (TS) in a single well of a 4-well dish and allow it to warm to 37 °C in an incubator without CO2.\nAt room temperature, aseptically dispense one 50-µL drop of dilution solution (DS) and two 50-µL drops of washing solution (WS) in a sterile Petri dish. Cover the DS and the WS1 and WS2 drops with paraffin oil.\n\t\tNote: Instead of a Petri dish, a 4-well dish can also be used.\nWarm the blastocyst.\n\t\nIdentify the HSV straw with the vitrified blastocyst to be removed from LN storage and quickly transfer the straw to an LN-filled portable reservoir in preparation for the warming procedure.\nLift the straw with forceps, just enough to expose the colored handling rod. Use a self-adjusting wire stripper to cut the straw at the height of the colored handling rod.\nGrab the handling rod and extract it from the straw with a swift, yet controlled movement, and immediately plunge the curved spatula of the handling rod into the 37 °C TS.",
    "Gently swirl the handling rod to detach the blastocyst and leave it for a total of 1 min in TS.\nAt room temperature, transfer the blastocyst consecutively to DS, WS1, and WS2 for 4 min in each medium.\nAfter the warming procedure, transfer the blastocyst to a 4-well dish with recovery medium and wash it in all three drops by gently pipetting it.\n\t\tNote: The washing is carried out in approximately 1 min.\nTransfer the blastocyst to the time-lapse 9-well dish with recovery medium. Place the 9-well dish under a time-lapse camera in an incubator (at 37 °C with 6% CO2 and 5% O2).\n\t\tNote: Thre warming procedure, which continues with placing the 9-well dish under a time-lapse camera in an incubator, lasts approximately 17 min.\n11. Time-lapse Recording of the Blastocyst Re-expansion During Recovery Post-warming\nRun time-lapse recording software.\nChoose a recording camera.\nPress the Live mode button.\nPlace the mouse cursor on the image and use the scroll button to enlarge it. Click and hold the left mouse button and move the cursor to place the well with the blastocyst in the middle of the screen.\nUnder Focusing, use the up-down green arrows to focus the recording plane of the blastocyst. Under Light intensity, set the light intensity.\nClick the Microscope parameters button to set the Exposure time and Gamma.\nPress Close live mode.\nPress the Start project button and enter the project data, select the culture dish type (3 x 3 or 4 x 4) and uncheck all positions except the one to be recorded.\nSet the capture timing to take a picture every 5 min.\nStart recording by pressing the Approve button. Record at least 150 min.\nStop recording by pressing the Stop project button.",
    "Note: See the representative results of the recording of an intact (Figure 3) and a collapsed blastocyst (Figure 4) during the post-warming recovery period.\n12. Video Editing of the Recorded Blastocyst During the Re-expansion Post-warming\nGo to the project folder and locate recorded images that are roughly 80 KB in size.\nCreate another folder and transfer these images into it. Rename the images in numbers according to the time created. Import them into the video editing software as an image sequence.\nGo to Video tab → Filter → Add and select Null transform filter.\nClick the Cropping button on the right side and crop the image, leaving visible only the field with the recorded blastocyst. Confirm with OK and again with OK.\nClick File → Export → Image sequence. Choose JPEG as the output format, set the directory to hold the saved sequence of images, and click OK.\n\tNote: This will create resized (cropped) images prepared for further measurements in the video analysis software.\n13. Setting of a Measurement Scale in Video Analysis Software for the Images Created with the Time-lapse Recording Software\nRun the Analyzer of the time-lapse recording software.\nOpen the project with the recorded blastocyst.\nClick the Analyze button on the field with the recorded blastocyst.\n\tNote: A new Analyze window will open. Click on the Measurement button to show the measurement tool.\nUse the measurement tool to measure the width of the whole image.\nRight-click on the image and save it. In the properties, check the image’s width in pixels.\nDivide the image’s actual width with its width in pixels.\n\tNote: This calculates the actual length of a single pixel in this image.\nRun the video analysis software.\nClick the Window tab and select Timeline.",
    "In the Timeline pane, click on the film strip sign and choose Add Media... to add the image sequence of the post-warm re-expanding blastocyst.\nClick Image → Analysis → Set Measurement Scale → Custom to open the Measurement Scale window. For Pixel length, enter 1; for Logical length, enter the previously calculated actual length of a pixel (step 13.6); for Logical units, enter µm. Save the preset.\n14. Measurements of the Blastocyst’s Cross-sectional Area from Images Created During the Re-expansion Post-warm\nOnce the Measurement scale is set and the image sequence imported, measure the blastocyst’s cross-sectional areas the same way as described in step 8, with the only difference being that the measured cross-sectional areas in these measurements have units in µm2.\n15. Editing of the Data File with the Recorded Blastocyst’s Cross-sectional Areas from Images Created during the Re-expansion Post-warm\nTransfer the data of the recorded blastocyst’s cross-sectional areas from the .txt file to a spreadsheet editor.\nCreate a Time variable next to the Area variable and add the first time value.\n\tNote: In this case, the first time value is set to 0 minutes, which is the onset of the time-lapse recording. Each next consecutive time value is calculated by adding 5 minutes to the previous time value. Five minutes is the time interval used between two consecutive time-lapse recordings.\n16. Creation of a Line Diagram\nImport the spreadsheet data file in statistical analysis software for creating a time plot of the blastocyst’s cross-sectional area changes in time during the equilibration phase of the vitrification or re-expansion post-warming.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}