{
  "id": 18540,
  "origin_website": "Jove",
  "title": "A Simple Device to Rapidly Prepare Whole Mounts of the Mouse Intestine",
  "procedures": [
    "The various experimental procedures and the humane euthanasia are approved by the host institutions ethical committee and by the appropriate regulatory bodies. Euthanasia is normally achieved using CO2 asphyxiation followed by cervical dislocation.\n1. Device\nMachine the main portion of the base of the device from out of a solid block of high-density acetyl resin, as described in this manuscript. At each end create 3 mm high-elevated strips, and part machine out of these 2.5 mm groves to take the rods (see Figure 2 and Figure 3).\nMake rods from a 2.4 mm diameter stainless steel with rounded-off ends.\n\tNOTE: The main frame of the lid was machined out of Duralumin plate. A limited number of finished devices are available from Dr. Goodlad.\n2. Use of the Device\nDissect out the small intestine and colon from the abdominal cavity using scissors and gloved fingers. Remove the mesentery by holding it with curved forceps and gently pulling it away from the intestine.\nRinse the intestines with cold phosphate buffered saline (PBS, pH 7.4) using a Gilson type pipette tip, which had been cut down at its wider end so that it can fit onto a 10 or 20 ml luer fitting plastic syringe.\nLay out the small bowel (SB) on to a sheet of paper towel and divide into three equal sections in length (proximal, mid, and distal – SB1, SB2 and SB3) using scissors. Remove the cecum and lay out the colon.\nMake several very small cuts into the intestinal segments with scissors to allow the fluid to escape and place a sheet of paper towel over the intestines and gently run a finger over the preparations to squeeze out the fluid and blot dry.",
    "Lift the sections and insert the stainless steel rods that were previously wetted by soaking in a beaker of phosphate buffered saline.\n\tNOTE: The intestine can be inverted if so desired (turned inside out).\nLabel a piece of card or filter paper cut to size to fit into the base of the device. Pencil is best, as it is unaffected by virtually all solutions. Autopsy date, experimental code and animal identification number are suggested.\nPlace the card or filter paper into the base of the device. Insert the rods and intestines into the slots in the base of the device. Make sure the proximal end of the segments is positioned in a standardized manner. The proximal ends should be near the card labels.\nPlace the top piece of the device over the base. Use the angled bars to guide a scalpel blade to longitudinally cut the sections.\n\tNOTE: It helps if the tissue is gently and carefully held with a finger to ensure that it does not move with the knife.\nRemove the top piece of the device. Carefully remove the filter paper and tissues (still on their rods).\n\tNOTE: A piece of stiff card placed underneath the filter paper will aid lifting.\nSlightly wet (with a gloved fingertip dipped in PBS) the segments. Roll the rod, side to side to open up the gut and spread it flat. The tissue will then adhere to the filter paper.\nVisually examine the preparations for any gross lesions.\nTransfer the tissue adhered to the filter paper to a shallow bath (or sandwich box) containing fixative.",
    "NOTE: After the tissue adheres to the filter paper or to card it will remain firmly attached. A wide range of fixatives can be used to preserve the preparation. It is recommended that Carnoy’s fluid should be used for the study of intestinal cell proliferations6, which is the ideal fixation for the best cell proliferation methods; however formalin or many other fixatives can also be used if other endpoints are required.\nAfter fixation (usually 3 hr), transfer the preparations into 70% ethanol. The samples can then be stored until required. The preparations can be studied en face and/or used for the preparation of histological samples for H&E or other histological staining techniques, immunohistochemistry and/or in situ hybridization.\n\tNOTE: Prolonged fixation can reduce immunohistochemical reactivity and/or in situ hybridization reactivity. Polypropylene sandwich boxes are ideal for storing a large number of the preparations.\nIf required the fixed tissues from the various intestinal segments can be made into ‘Swiss rolls’ and stained with the entire range of histological methods6 including those described above. To make a ‘Swiss roll’ the intestinal segments are removed from the filter paper, rolled around a cocktail stick or a toothpick, secured with an entomological pin and processed for wax embedding6.\nIf required, stain the bulk tissue with methylene blue to visualize aberrant crypt foci7.\nScore the fixed preparations at leisure.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}