{
  "id": 3823,
  "origin_website": "Cell",
  "title": "A protocol for ultra-high field laminar fMRI in the human brain",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCollecting structural and functional imaging data\nTiming: Approx. 120 min per participant\nRegister the participant according to the local procedure.\nLocalizer. A scan is run at isocentre of the magnet in order to have a basic localization of the brain with respect to the scanner coordinates.\nB1 mapping. The B1 map is acquired covering the whole brain and aligned to AC-PC. This will generate a filp angle map. To ensure the correct flip angle is achieved in the target area, load the flip angle map into the 3D tab of the Syngo software (Siemens Terra, VE system). Use the circle ROI tool (tools menu) to draw a ROI in the target area on sagittal image and estimate the following: (900 × Transmit Reference Amplitude) / Mean average. This figure should not be over 300 V. If it is higher than 300 V, use 300 V).\nAcquire anatomical images using MP2RAGE T1-weighted sequence (TR = 5000 ms, TE = 2.56 ms, FOV = 208 × 208 mm2, resolution 0.65 × 0.65 × 0.65 mm3, number of slices: 240, slice orientation: sagittal, see the MP2RAGE T1-weighted sequence in the key resources table[href=https://www.wicell.org#key-resources-table]).\nPosition the fMRI slab on the area of interest (2D Gradient Echo, Echo Planar Imaging (GE-EPI) sequence: TR = 2060 ms, TE = 26.4 ms, FOV = 148 × 148 mm2, flip angle: 70°, resolution 0.8 × 0.8 × 0.8 mm3, number of slices: 56, partial Fourier = 6/8, GRAPPA factor = 3, Multi-Band factor = 2, bandwidth = 1034 Hz/Pixel, echo spacing = 1.09 ms, see the EPI sequence in the key resources table[href=https://www.wicell.org#key-resources-table]). At this point the researcher will need to:\nMake sure that the area of interest is well contained within the acquisition slab;\nCheck the phase encoding direction;",
    "Slide through the slices to make sure that the area of interest is fully covered by the slab;\nMake sure that there is no wrap-around, ghosting or dropouts in the images.\nRun one volume of the above scan to check the position of the field of view (FOV).\nIf position is poor, reiterate steps 5 and 6 until good slab coverage has been achieved.\nAdjust the shim volume (i.e., green box in Figure 2[href=https://www.wicell.org#fig2]) of the fMRI slab to cover the whole imaging volume (i.e., yellow box in Figure 2[href=https://www.wicell.org#fig2]). 10 mm were added in all directions of the shim volume to ensure stable numeric optimization and reduce sensitivity to head motion. For imaging at 7T (Siemens Terra scanner), perform B0 shimming as bellow:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/545-Fig2.jpg\nFigure 2. Positioning of the fMRI slab (yellow box) and the shimming volume (green box)\nYellow and green boxes show the positioning of the fMRI slab and the shimming volume, respectively.\nSelect Options > Adjustments > Transmitter, in ‘amplitude temp’, type the value obtained from B1 mapping. Click on Apply.\nManual Shimming (Siemens Terra, VE line):\nClick on Options>Adjustments. Navigate to the ‘Frequency’ tab. Click Go until convergence is reached. Click Apply.\nRepeat this procedure 3 times: Navigate to the 3D Shim tab: measure, calculate and apply.\nNavigate to the ‘Inter. Shim’ tab. Adjust the Z, Y, X, Z2 shim currents as directed, trying to decrease the FWHM of the water spectrum. This value should be as close to 30 Hz as possible (see Figure 3[href=https://www.wicell.org#fig3] for good vs. poor shimming examples). Click Stop, then Apply.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/545-Fig3.jpg\nFigure 3. Good vs. poor shimmed functional images",
    "(A) and (B) show examples of functional images (single volume, 0.8 mm isotropic) of good vs. poor shimming, respectively. The red circles indicate areas that differ in data quality due to shimming. Poor shimmed image (B) shows more ghosting in upper circles and more signal drop-outs in lower circles comparing to the good shimmed image (A).\nCritical: The researcher will need to ensure that the curves resulting from shimming resemble a Gaussian distribution. If the shimming value is not sufficiently low, the participant may need to be repositioned to ensure that the coil receives the signal properly.\nMeasure the B0 map.\nCopy adjustment volume and centre of slices from the fMRI slab (step 5).\nMove slices to obtain full brain coverage and run.\nAcquire an inverted phase encoding direction fMRI scan (e.g., FH: phase encoding direction of functional data from foot to head) used to correct for distortions (5 volumes):\nCopy adjustment volume from the B0 map.\nCopy Centre of slices with phase encoding direction selected from the fMRI slab (step 5).\nChange the phase encoding direction to FH and the number of measurements to 5.\nAcquire the experimental data.\nCopy adjustment volume from the B0 map.\nCopy Centre of slices with phase encoding direction selected from the fMRI slab (step 5).\nChange the phase encoding direction to HF and the number of measurements based on the experimental design.\nRun steps 10 and 11 as a pair to reduce the between-run head movement.\nCritical: At this point the researcher will need to check the data quality. Please ensure that there is no ghosting or signal drop-outs in the region of interest (ROI).\nRepeat steps 10–12 for all the experimental runs.",
    "Critical: At this point the researcher will need to ask the participant to stay as still as possible. Head movement may cause image distortions that cannot be corrected.\nSave all the data acquired."
  ],
  "subjectAreas": [
    "Clinical Protocol",
    "Nmr",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}