{
  "id": 19083,
  "origin_website": "Jove",
  "title": "The Use of Cystometry in Small Rodents: A Study of Bladder Chemosensation",
  "procedures": [
    "1. Laboratory Animals\nAnimals (mice, rats) are housed in a specialized animal facility with a 12-hr light-dark cycle and ad libitum access to water and standard food pellets. Both age and sex of the animals are important parameters that should be standardized according to the needs. We typically perform cystometry in 10 - 12 week old female animals5,6.\nAll animal experiments are carried out in accordance with the European Union Community Council guidelines and approved by the local ethics committee.\n2. Anesthesia\nIsoflurane anesthesia is used for performing small surgical procedures, since it is easy to dose due to its short half-life. Appropriate waste gas scavenging is necessary when using isoflurane.\n \nAnimals are placed in a closed box, gassed with isoflurane 5% in pure oxygen (1 l/min).\nAfter induction, anesthesia at the appropriate level is maintained by a small mask (a cut 10 ml syringe) by 0.8 - 1 l/min oxygen with 1 - 1.5% of isoflurane.\nFor mice, urethane anesthesia is used during functional recordings (cfr. Infra). Urethane anesthesia is used during functional recordings because, in contrast to most other anesthetics, the micturition reflex is not suppressed by this anesthetic agent4. Urethane 1.2 g/kg body weight is administered subcutaneously (s.c.) 60 min before the start of the recordings. If necessary, the dose of urethane needed to obtain proper anesthesia can be titrated by administering additional doses (0.1 g/kg) subcutaneously. It should be noted, however, that additional anesthesia may alter the voiding efficiency and consequently the micturition frequency7,8. Thus, the cystometric recordings should be closely monitored and discarded whenever significant deviations from the control behavior are observed. Anesthetics should not be administered while test compounds are applied to avoid misinterpretation of the data.\n3. Surgical Procedure - Bladder Catheter Implantation",
    "Surgical instruments are sterilized in an autoclave prior to use. Shave the abdomen of the animal, disinfect with ethanol 70% and perform a low midline laparotomy to expose the bladder.\nUnder a surgical microscope, place a purse-string suture in the bladder dome using a non-absorbable, monofilament suture (size 6-0).\nPerform a small cystostomy (we preferentially use a 18 G needle) inside the purse string and insert a PE 50 polyethylene catheter, with a small cuff at the end (obtained by carefully heating the tubing) through this hole. In our hands, thinner tubes (PE 10) have a higher and more variable resistance. The tubing can be disinfected by putting it in an ethanol 70% solution or sterilized in an autoclave. Before implantation, the tubing should be flushed with saline.\nSecure the purse string around the tube with a surgeon's knot. Pull the catheter gently outwards until the bell-shaped tip is positioned right under the suture. Push a piece of 18 G catheter towards the suture to prevent leaking.\nInfuse a small volume of saline (100 - 200 μl) gently to check for leaks. If leaks are present, an additional suture should be placed.\nClose the abdominal muscles using monofilament sutures, leaving a passage for the catheter in the upper part of the incision.\nTunnel the tube to the interscapular region using a hollow metal rod, thereby preventing the animals to bite the tube during the experiment.\nThe skin is closed using non-absorbable, monofilament sutures. The implanted catheter is flushed with saline to check its permeability.\nBefore the animals awaken, analgesics are given subcutaneously (buprenorphine, 0.05 mg/kg).\n4. Setup and Cystometry",
    "Depending on the experimental question (and the species used) cystometry is performed in awake (restraint or unrestraint) or urethane-anesthetized animals. Whereas cystometry is perfectly feasible in conscious rats, which tend to remain calm in a restrained environment, we usually perform cystometry under urethane anesthesia (1.2 mg/kg, subcutaneously) when using mice3,5,6,9.\nIn anesthetized mice, body temperature is constantly monitored and kept at 36.5 °C ± 0.2 °C by means of a temperature probe and a heating lamp.\nThe set-up is calibrated before every experiment according to the manufacturers' instructions.\nThe implanted catheter is connected by a luer stub to a 3-way tap, which is connected to the pressure transducer (Edwards Lifesciences) on one side and an infusion pump on the other (Harvard Apparatus). The pressure transducer is connected via an amplifier (78534c monitor, Hewlett Packard) to the data acquisition system (DI-730-USB, Dataq instruments) and a computer. Windaq/Lite software can be used for recording.\nThe infusion pump is started, enabling the infusion of saline or PBS at, for example, 100 μl/min (in rats) or 20 μl/min (in mice). As such the bladder will be filled at a constant rate, while the intravesical pressure is recorded.\nFigure 5 depicts a typical pressure trace: during fluid infusion, there is a slow pressure buildup in the bladder, until a certain volume/pressure is reached, the micturition threshold. Once this threshold is reached, the bladder will contract and subsequently the urinary sphincter will open, allowing the passage of urine through the urethra. As such, the bladder is emptied, the contraction will stop and the pressure will drop again to the \"basal\" level.",
    "As the rat is placed in a metabolic cage and above a digital balance, the voided volume can be measured simultaneously, giving information about the voided volume. Due to the small voided volumes in mice, it can be very challenging using this system. Therefore, voided volume is determined using small filter papers weighed before and after voiding.\nTypically, we let the system equilibrate for 30 min, followed by a recording period of 30 min. Then, drugs can be administered systemically or intravesically and another 30 min are recorded.\nRecorded data can be exported as .csv files that can be imported into a specialized software for quantitative analysis. We typically use Origin (OriginLab Corporation, MA, USA).\nAfter experiments, animals are sacrificed by cervical dislocation (mice) or CO2 intoxication (rats).\n5. Representative Results\nimgsrc://cloudfront.jove.com/files/ftp_upload/3869/3869fig1.jpg\nFigure 1. Laparotomy overview. A) Place the rat in the supine position. B) Shave and antiseptically prepare the surgical site. C) Incision of the skin. D) Incision of the abdominal muscles, and bladder exposure.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3869/3869fig2.jpg\nFigure 2. A purse-string suture.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3869/3869fig3.jpg\nFigure 3. Catheter implantation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3869/3869fig4.jpg\nFigure 4. Tunnelling of the catheter.\nExamples of pressure measurements obtained during intravesical perfusion of saline in a conscious rat and an anesthetized mouse are shown in Figure 5. Multiple parameters can be extracted from the pressure signal (e.g. the intercontractile interval, the baseline pressure and the threshold pressure). For comprehensive descriptions of these parameters, please see Andersson et al. (ref 4) and Yoshiyama et al. (ref 10).",
    "We have recently used cystometry to identify the molecular targets of mustard oil (MO), a highly reactive compound that has been long used in experimental models of inflammation and hyperalgesia of visceral organs such as the urinary bladder11,12. Intravesical infusion of 10 mM MO induced a strong increase in the voiding frequency (decrease in the intercontractile interval) in wild type mice (Figure 6A, B) and a decrease of the voided volume6. Interestingly, MO induced similar changes in mice deficient of the MO receptor TRPA1. In contrast, MO induced much weaker changes in cystometric parameters in Trpv1 KO mice than in WT mice and was without any effect in Trpa1/Trpv1 KO mice. Together with measurements of the release of the Calcitonin Gene Related Peptide (CGRP)6, these data indicate demonstrate that TRPV1 may play a key role in visceral irritation induced by MO.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3869/3869fig5.jpg\nFigure 5. Representative traces of intravesical pressure recorded in a conscious female rat (A) and in an anesthetized female mouse (B). The lowest pressure is defined as the \"baseline pressure\" (red arrows). The pressure at the end of the filling phase is marked with blue arrows. The volume of fluid infused between these points, divided by the pressure difference, allows calculation of the compliance of the bladder wall (compliance = infused volume/(threshold pressure - baseline pressure). The \"intercontractile interval\" (ICI) is the time between two voiding contractions.\n \nimgsrc://cloudfront.jove.com/files/ftp_upload/3869/3869fig6.jpg",
    "Figure 6. Effects of intravesical application of mustard oil on the cystometry pattern in wild type and Trpa1, Trpv1 and Trpa1/Trpv1 knockout mice. (A) Representative examples of intravesical pressure changes recorded in WT, Trpa1 KO, Trpv1 KO and Trpa1/Trpv1 KO mice in response to infusion of saline and 10 mM MO. (B) Time course of the average instantaneous voiding frequency before and during intravesical infusion of MO. For all mice, the data were normalized to the average frequency obtained during saline infusion. These data is adapted from Everaerts et al. (ref 6), with permission from Elsevier.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}