{
  "id": 4110,
  "origin_website": "Cell",
  "title": "Protocol for setup and circadian analysis of inverted feeding in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTo set up inverted feeding paradigm, we used daytime-restricted feeding (DRF) to introduce inverted feeding to mice and nighttime-restricted feeding (NRF) as a control. This procedure is written for a 36-day time-restricted feeding regimen, but it is commonly applied for as short as 7 days in Xin et al., 2021[href=https://www.wicell.org#bib18].\nTime-restricted feeding regimens\nTiming: 36 days\nAt the end of acclimation and group assignment, start the time-restricted feeding regimens in the light-tight cabinets.\nPlace big food pellets (5 pellets per mice, 20–30 pellets per cage) on the food hopper.\nDRF group has access to food for 12 h from ZT0 (9:00) to ZT12 (21:00), whereas NRF group has access to food for 12 h from ZT12 (21:00) to ZT24 (ZT0, 9:00). Mice have access to water ad libitum (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/876-Fig2.jpg\nFigure 2. Time-restricted feeding regimens\n(A) Appearance of DRF and NRF cages in the light phase. Food pellets are placed on the hopper of a DRF cage but not on that of a NRF cage.\n(B) Appearance of DRF and NRF cages in the dark phase. Food pellets are placed on the hopper of a NRF cage but not on that of a DRF cage. Red lamp is on when operating in the dark phase.\nOptional: To determine whether removal of time cues from the suprachiasmatic master clock affects food entrainment in peripheral tissues, constant light condition is applied simultaneously with the 7-day daytime-restricted feeding. To set up constant light, the LED lights are adjusted to allow 500 lux at the bedding of mouse cages (Chen et al., 2008[href=https://www.wicell.org#bib3]), and the light-off time on the timer switch is set to the same as the light-on time (i.e., 9:00).",
    "Optional: To determine the long-term effects of inverted feeding on tissue clocks and biology, the regimen can be extended. The longest regimen in our study lasts for 36 days.\nCritical: Four mice are assigned to one cage. Clearly label the NRF/DRF assignment on the cage registration sheet (Figure 2[href=https://www.wicell.org#fig2]). Check the timer switch for time accuracy at the start of the experiment and at least once during the experiment.\nCritical: When performing time-restricted feeding under 12 h light:12 h dark cycles, the 7-day regimen is normally applied and sufficient to entrain the liver clock (Damiola et al., 2000[href=https://www.wicell.org#bib4]; Stokkan et al., 2001[href=https://www.wicell.org#bib12]; Hara et al., 2001[href=https://www.wicell.org#bib6]). We tested the time of time-restricted feeding for up to 36 days and found consistent phase entrainment in the four tested peripheral tissues, i.e., heart, kidney, liver, and adipose tissue (Xin et al., 2021[href=https://www.wicell.org#bib18]).\nRecord the food weight daily and body weight weekly.\nWeigh the food weight at ZT0 and ZT12 and work in the dark phase under a red lamp.\nCalculate food consumption per cage. Since four mice are assigned per cage, average food consumption by a factor of four for food intake per day per mouse.\nWeigh the body weight at ZT0.\nCritical: To ensure normal light-dark cycles, it is crucial to work in the dark phase under a red lamp when weighing and changing food pellets.",
    "Critical: The success of time-restricted feeding regimens depends on the scheduled restriction of food access. Since mice occasionally smash food pellets, the smashed food power fallen to the bedding would violate food restriction, if it were not removed timely. Measurement of food consumption would also indicate the metabolic status of mice. Thus, during dietary regimens, look for smashed food in the cage daily to avoid violation of time restriction and mis-calculation of food consumption. Big food pellets are fed to mice to prevent from food smashing. In addition, the action of food restriction is normally completed within 10 minutes of light switch. Don't forget to keep the water adequate.\nOptional: When performing time-restricted feeding regimens within 7 days, it is optional to monitor body weight. It is a routine in our laboratory to track body weight every week, and body weight is weighed at ZT0 in the beginning and end of a 7-day regimen.\nTissue dissection\nTiming: 24 h\nThis section details the optimized steps to dissect and handle mouse tissues.\nEuthanize the mice by cervical dislocation every 4 h over a complete 24 h cycle.\nThe number of biological replicates per treatment per time-point is four.\nTime points are Zeitgeber Time (ZT) 0, 4, 8, 12, 16, 20, 24 h. ZT24 is the start of the next day.\nEuthanize a mouse by cervical dislocation, fix it on the dissection plan with pins, identify the thorax and abdomen.\nSpray the surface of mice with 75% ethanol.\nCut a horizontal incision at the abdomen by scissors and tear the skin towards head and tail, respectively, to expose the mouse's thorax and abdomen.",
    "Critical: During the dark phase, red lamp is used for illumination to avoid disruption of light-dark cycle (Figure 2[href=https://www.wicell.org#fig2]). The mouse is euthanized under the red lamp in the dark before relocating to the operating hood for tissue dissection.\nDissect mouse tissues in the following order, which gives high priority to tissues with high metabolic demand like heart.\nDissect heart tissue (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/876-Fig3.jpg\nFigure 3. Tissue dissection\n(A) Dissection procedure for heart.\n(B) Dissection procedure for liver.\n(C) Dissection procedure for kidney.\n(D) Dissection procedure for VAT.\nHt, heart; LLL, left lobe of liver; AG, adrenal gland; VAT, visceral adipose tissue or perigonadal adipose tissue. Scale bars are shown in white and range from 2 to 10 mm as indicated.\nCut off the diaphragm and ribs along the sides of the mouse body, set off the front wall of the thorax, and make the heart visible.\nCut out the entire heart at the junction of the aorta and the heart.\nCut the heart chambers, wash with PBS briefly, and wipe the heart with filter paper to deplete residual blood.\nQuickly put the tissue into the labeled tube and freeze immediately in liquid nitrogen, store at −80°C.\nDissect liver tissue (Figure 3[href=https://www.wicell.org#fig3]B).\nMake a Y-shaped incision on the peritoneum to expose all abdominal organs.\nIdentify the left lobe of liver (LLL) in the upper left side of the mouse's abdominal cavity.\nCut about 40 mg of the LLL, wash with PBS briefly, and wipe the liver with filter paper. Be careful not to cut the gallbladder to avoid contaminating the tissue with bile.\nQuickly put the tissue into the labeled tube and freeze immediately in liquid nitrogen, store at −80°C.\nDissect kidney tissue (Figure 3[href=https://www.wicell.org#fig3]C).\nMake a Y-shaped incision on the peritoneum to expose all abdominal organs.",
    "Set off the intestine and find the kidney near the back of the mouse, cut out the kidney at the hilum of the kidney, strip the adrenal gland (AG) and perirenal fat.\nCut the kidney along the lateral edge, wash with PBS briefly, and wipe the kidney with filter paper.\nQuickly put the tissue into the labeled tube and freeze immediately in liquid nitrogen, store at −80°C.\nDissect visceral adipose tissue (Figure 3[href=https://www.wicell.org#fig3]D).\nMake a Y-shaped incision on the peritoneum to expose all abdominal organs.\nFind the Y-shaped uterus in the lower abdomen near the anus. The white soft tissue around the uterus is visceral adipose tissue (VAT, also known as perigonadal adipose tissue).\nCut the VAT along the edge of the uterus, wash with PBS briefly, and wipe with filter paper.\nQuickly put the tissue into the labeled tube and freeze immediately in liquid nitrogen, store at −80°C.\nCritical: The collection time for these tissues should be within 5 minutes per mouse, and the blood should be washed away as much as possible. Moreover, the label on the EP tubes for tissue storage should be checked carefully to avoid misplacement.\nRNA extraction and cDNA preparation\nTiming: 8 h\nThe steps below apply to one mouse tissue. Briefly, tissue RNA is isolated using Eastep Super Total RNA Extraction Kit (Promega). Complementary DNA (cDNA) is synthesized using the GoScript Reverse Transcription Mix (Promega). cDNA is amplified and analyzed using iTaq universal SYBR Green Supermix (Bio-Rad) and the Bio-Rad CFX96 Real-Time PCR Detection System (Bio-Rad).\nRNA extraction from mouse tissues.\nMouse tissues are homogenized in a Cryogenic Grinding System (Shanghai Jingxin JXFSTPRP-CL).\nGrinding condition is set to a power of 65 hertz for 2 min at 4°C.",
    "30–40 mg of samples from kidney, heart, and a trunk from the left lobe of liver sampled from the same region are used for RNA extraction. 80–100 mg of adipose tissue is used for RNA extraction.\nTissue homogenates are subjected to RNA extraction using Eastep Super Total RNA Extraction kit.\nDetailed steps can be found in the link: RNA extraction using Eastep® Super Total RNA Extraction kit[href=https://www.promega.com.cn/products/shanghai-promega/eastep-life-science-research-products/eastep-super-total-rna-extraction-kit/?catNum=LS1040].\nPerform reverse transcription to prepare complementary DNA (cDNA) samples.\nMeasure the concentration of extracted RNA in a spectrophotometer.\nAliquot 2,000 ng of total RNA for reverse transcription reaction.\nDetailed steps can be found in the link: cDNA is synthesized using the GoScript™ Reverse Transcription Mix[href=https://www.promega.com.cn/Resources/Protocols/Product%20Information%20Sheets/A/GoScript%20Reverse%20Transcription%20Mix_%20Random%20Primers/].\nEquipment setup for RT is described in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nCritical: Nuclease-free tubes, tips, dissection tools are important for all these steps of tissue collection, RNA isolation and cDNA synthesis.\nCritical: All steps are performed on ice or in a prechilled 4°C environment.\nReal-time quantitative PCR\nTiming: 1–2 days\nWe applied the standard curve method to quantify mRNA levels in this study. The 2-ΔΔCt method is also applicable.\nPrepare the diluted cDNA samples and standards.\nDilute cDNA samples 20 times, i.e., 2 μL reverse transcription (RT) reaction + 38 μL nuclease-free water.\nNext, prepare the Standard samples for plotting the standard curve to estimate replication efficiency and relative quantification.\nTo prepare the first Standard (1,296 arbitrary units), sample and combine 3 μL inputs from RT reactions at three time points, i.e., ZT0, ZT8, ZT16 from NRF group, when circadian clock genes Arntl, Nr1d1, Per2, reach peak expression. (See CRITICAL below)\nMix these 9 μL RT reactions with 36 μL nuclease-free water.\nDilute Standard 1296 at a 1:6 ratio serially to Standard 1 (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/876-Fig4.jpg\nFigure 4. Preparation of Standards for RT-qPCR",
    "9 μL cDNA solution in total is mixed with 36 μL nuclease-free water (designated as Standard 1296). 6 μL is aliquoted from Standard 1296 and mixed with 30 μL nuclease-free water (designated as Standard 216). This is done serially to prepare Standard 36, 6, 1. Nuclease-free water is designated as Standard 0 and serves as blank control. NF-H2O, nuclease-free water.\nPause point: cDNA samples and standards can be kept at −20°C for months, but avoid frequent freeze and thaw.\nCritical: Ideally, one sample from each time point should be added to the pool to make the first and most concentrated Standard sample. In our experience, pooling samples from three time points in the NRF group, i.e., ZT0, ZT8, and ZT16, is sufficient to cover the quantity of major clock genes.\nPrepare the premix for 80 reactions.\nRefer to Recipe for qPCR Premix in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section for details.\nDetailed steps can be found in the link: RT-qPCR using iTaq Universal SYBR® Green Supermix kit[href=https://www.bio-rad.com/zh-cn/sku/1725124-itaq-universal-sybr-green-supermix-2500-x-20-ul-rxns-25-ml-5-x-5-ml?ID=1725124].\nAdd 2 μL cDNA sample to a 96-well PCR plate, and then add 8 μL premix to form a 10 μL reaction system.\nSeal the PCR plate. Briefly spin down in a benchtop centrifuge.\nPause point: The PCR plate can be wrapped in foils and store in 4°C for up to 5 h.\nRun the RT-qPCR reaction in a real-time PCR detection system.\nEquipment setup for RT-qPCR is described in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nNote: Mix well by gently pipetting up and down 10 times. Ensure that the amplification efficiency is 90%–110%, and R2 ≥ 0.98. Otherwise, use the 2-ΔΔCt method for quantification."
  ],
  "subjectAreas": [
    "Bioinformatics",
    "Systems Biology",
    "Metabolism",
    "Behavior",
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology",
    "Bioinformatics & Computational Biology"
  ]
}