{
  "id": 9632,
  "origin_website": "Jove",
  "title": "Cut-loading: A Useful Tool for Examining the Extent of Gap Junction Tracer Coupling Between Retinal Neurons",
  "procedures": [
    "1. Intact neural retina preparations for goldfish, mice and rabbits\nPerform all of the following steps, including those described in \"2) Cut-loading,\" under constant ambient (background) illumination. Please note that for the purposes of this protocol, the procedures are described as performed in constant darkness (i.e. under very dark (i.e. \"scotopic\") conditions ≤ 0.0001 lux) using night vision infrared goggles, but other higher intensity levels of constant ambient illumination can be used instead to determine the effect of other levels of ambient illumination on gap junction tracer coupling.\nDark-adapt the experimental animal (goldfish, mouse or rabbit) for at least 1 hr before surgery.\nAs described previously7, deeply anesthetize goldfish by placing them in tricaine methanesulfonate (MS222; 150 mg/L of buffered (sodium bicarbonate-containing) fish tank water), and deeply anesthetize mice with ketamine (100 mg/kg, i.p.) and rompun (10 mg/kg, i.p.). Deeply anesthetize rabbits with urethane (loading dose: 2.0 g/kg, i.p.) and also use local intraorbital anesthesia (2% Xylocaine), as described previously8. All experimental procedures involving the care and use of animals should be performed in accordance with federal guidelines and be reviewed and approved by local university animal care and use committees. (Note: In the experiments described here, all experimental procedures involving the care and use of fish, mice and rabbits were performed in accordance with NIH guidelines and were reviewed and approved by Ohio State University Institutional Animal Care and Use Committee.)",
    "For fish, mice and rabbits, following enucleation, remove the anterior portion of each eyeball. Then, place a piece of filter paper on top of the posterior portion of the eye and invert the filter paper and eye, so that the filter paper is underneath the posterior portion of the eye. Then, using fine forceps dissect the intact neural retina from the posterior portion of the eye by gently peeling away the pigment epithelium/choroid/sclera, which are attached to each other, from the neural retina, which is attached to the filter paper. As this is done, cut the optic nerve using fine spring-loaded scissors. The neural retina, oriented photoreceptor-side up, should now be attached to the filter paper and separated from the rest of the eye.\n2. Cut-loading\nSubmerge the retinas in oxygenated Ringer's solution (Table 1) in a 6-well plate (~5 mL/well) for 30 min under constant ambient (background) illumination (e.g. under very dark (i.e. \"scotopic\") conditions) with or without a test drug. Maintain fish retinas in oxygenated (5% CO2 /95% O2) bicarbonate-based Ringer's at 22°C by sealing the 6-well plate with parafilm and maintain mouse and rabbit retinas at 36°C in a 5% CO2 /95% O2 incubator. When a test drug is used, it should be present during all subsequent steps until fixation",
    "Prepare the tracer solution (typically 100 μL) by dissolving neurobiotin (0.5%), a biotinylated molecule, in Ringer's solution immediately before cutting through the retina. Note that 0.5% rhodamine dextran (high (> 10,000) MW) may be added to the solution. Due to its high molecular weight, rhodamine dextran does not cross gap junctions and only labels cells that have been damaged by the cut. As shown in Fig. 3, this is a useful way to distinguish cells that have accumulated neurobiotin because they have been injured, from those that have accumulated the tracer by diffusion through gap junctions.\nPlace the neurobiotin solution on a glass (or plastic) Petri dish, tap the filter paper, to which the retina is attached, on a paper towel to remove excess Ringer, dip a razor blade (or other sharp blade) in the neurobiotin solution and then make a radial cut through the retina and filter paper. If preferred, spacers can be used so that the cut is made through the retina, but not the filter paper. The cut should be oriented perpendicular to the retinal surface. Dip the razor blade in the neurobiotin solution again and cut the retina a second time. Repeat this up to 4 cuts per retina (see Fig. 1). Use a dissecting microscope when making razor cuts through mouse and other small retinas.\nAs shown in Fig. 1, submerge the retina again in fresh Ringer's medium, with or without test drug, using a 6-plate well (5 mL Ringer/well). Incubate the retina for 15 min to allow for loading and diffusion.\nWash three times for 5 min each with fresh Ringer's medium with or without test drug.\nFix the retina with 4% paraformaldehyde in 0.1 M phosphate buffer (PBS, pH 7.4) for 1 hr at RT.\nWash with 0.1 M PBS overnight at 4°C.",
    "The following day, react with 2% streptavidin-Alexa 488 (final concentration 10 μg/mL) in 0.1M PBS + 0.3% Triton X-100, and keep overnight at 4°C.\nWash three times for 10 min each with 0.1M PBS at RT\nIn PBS, detach the retina from the filter paper and then, using a fine brush, place the retina, oriented photoreceptor-side up, onto a slide.\nGently mount with Vectashield mounting medium (Vector Laboratories, Burlingame, CA).\nTake pictures with a laser scanning confocal microscope (e.g. Zeiss 510 META) at the same magnification, resolution and settings for every experimental condition, so that you can compare the effects of different experimental conditions (e.g. test drugs; illumination conditions) on the extent of gap junction tracer coupling (Fig. 2A-C and  Fig. 4A-C). Although a single image may contain all of the labeled cells, it is recommended that you collect a z-stack of the area of interest and collapse it into a single image.\n3. Quantification of tracer coupling using ImageJ\nIn the LSM image browser, open the image, click EXPORT and save the picture as a TIF-16 bit NOT compressed file. Scale bar should be included in this TIF image.\nUsing NIH ImageJ software, measure fluorescence intensity of Alexa-488-labeled neurobiotin from low-magnification images of whole-mount retinas. Open the TIF file using ImageJ software and then draw a straight line corresponding to the scale bar. Go to ANALYSE, SET SCALE and enter the known distance and unit of length, then click OK. Now measurement results can be presented in calibrated units, such as millimeters.\nSelect the area of interest using the rectangular selection tool. The peak of fluorescence should be positioned at the left border of your selection. Make sure that there is no fluorescence signal near the right border. If not, rotate the active image (IMAGE, then ROTATE).",
    "Click ANALYSE and PLOT PROFILE. You should see a curve with an exponential decay from the left to the right.\nClick COPY in the pop-up window and paste it in EXCEL. Now you see two columns showing the distance from the cut (left column) and the fluorescence intensity as a function of the distance from the cut (right column).\nDivide each raw fluorescence value by the maximum fluorescence value to obtain the relative fluorescence intensity.\nCopy two columns corresponding to the distance from the cut (X) and the relative fluorescence intensity (Y), and then paste them into Origin software.\nFit with the EXPONENTIAL DECAY #1 function (Fig. 2D and Fig. 4D), which is in the form:\n\tY = Y0 + Ymax*exp(-x/λ)\n\twhere Y is the relative fluorescence intensity, Yo is the background fluorescence, Ymax is the maximum relative fluorescence, λ is the space (length) constant, and x is the distance from the cut.\nCompare the space constant (λ) values at different experimental conditions using the t-test or ANOVA (Fig. 2E and Fig. 4E). Note that alternative techniques of quantification have been described by others13,14.\n4. Representative Results",
    "Representative examples of photoreceptor cell tracer coupling as determined by cut-loading are presented in Figures 2 and 3 (fish) and Figure 4 (rabbit). Confocal images were taken using the same settings for comparison (Fig. 2A-C and Fig. 4A-C) and the fluorescence intensity was plotted as a function of the distance from the cut and fitted by the exponential function shown in No. 3.8 above (Fig. 2D and Fig. 4D). Space constant values for each condition are shown in Figures 2E and 4E, illustrating that the extent of gap junction tracer coupling can be quantified using the cut-loading technique. In addition, the results are highly reproducible. Use of the cut-loading technique as a means of quantifying the extent of gap junction tracer coupling is also validated by the finding that fluorescence intensity decreases exponentially as a function of distance from the cut in all cases examined7,8 (see also Figs. 2D and 4D here), indicating that neurobiotin entered the photoreceptors via the razor cut and not from other retinal sites. Moreover, the qualitatively similar day/night difference in photoreceptor cell tracer coupling observed in goldfish with tracer injections into single cones and with cut-loading7 substantiates cut-loading as a relatively accurate means of measuring the extent of photoreceptor coupling.\nThe cut-loading technique can also be used to investigate other types of electrical synapses in the retina. For example, Figure 5 illustrates that rabbit A-type (Fig. 5A) and B-type (Fig. 5B) horizontal cells exhibit homologous tracer coupling following cut-loading and diffusion of neurobiotin under dark-adapted conditions.\ntable:\n﻿0,1,2,3\nCompound,Fish,Mouse,Rabbit\nNaCl,130,120,117\nNaHCO3,20,25,30\nNaH2PO4,-,1,0.5\nKCL,2.5,5,3.1\nGlucose,10,10,10\nMgCl2,1,-,-\nMgSO4-7H2O,-,1,1.2\nGlutamine,-,0.1,0.1\nCaCl2,0.7,2,2",
    "Table 1: Composition of the Ringer's solutions for goldfish, mouse and rabbit retinas. The concentrations are presented in mM. The Ringer's solutions are bubbled with 5% CO2 /95% O2 and maintained at 22 °C (fish) or 36 °C (mammals). \"-\" : not included in the Ringer for this species.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3180/3180fig1.jpg\nFigure 1.: Flow chart showing the cut-loading procedure. After isolation of the intact neural retina, several radial cuts were made by a blade that was first dipped in 0.5% neurobiotin solution. The retina was incubated for tracer loading and diffusion, and then washed before fixation with 4% paraformaldehyde (PFA) in 0.1M phosphate buffer (PB). Tracer coupling was examined using streptavidin-conjugated Alexa-488.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3180/3180fig2.jpg\nFigure 2. Day-night difference in photoreceptor tracer coupling in goldfish is revealed by the cut-loading technique. Photoreceptor cell gap junction neurobiotin tracer coupling was extensive at night (B) and in the day following application of spiperone (10 μM), a selective dopamine D2 receptor antagonist (C), but not in the day under control conditions (A). D) Normalized relative fluorescent intensity as a function of the distance from the cuts (indicated by arrows in A-C). E) Space constant values obtained from the data in D and other experiments (n = 4). ***P < 0.001.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3180/3180fig3.jpg",
    "Figure 3. A representative example showing fluorescence in the photoreceptor cell layer of a dark-adapted goldfish retina at night following cut-loading with a solution of both neurobiotin and rhodamine dextran. Rhodamine dextran (shown in red), which does not diffuse through open gap junction channels due to its high molecular weight (> 10,000 MW), only labeled cells near the cut. In contrast, neurobiotin (shown in green) diffused through gap junctions and can be seen in photoreceptor cells far from the cut. The location of the cut is indicated by the arrow in each panel. Scale bar: 200 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3180/3180fig4.jpg\nFigure 4. Day-night difference in photoreceptor tracer coupling in rabbit retina is revealed by the cut-loading technique. Photoreceptor cell gap junction neurobiotin tracer coupling was extensive at night (B) and in the day following application of spiperone (10 μM) (C), but not in the day under control conditions (A). In A-C, perpendicular views of the 3D reconstruction of rabbit photoreceptors near the cut are shown. D) Normalized relative fluorescent intensity as a function of the distance from the cuts. E) Space constant values obtained from the data in D and other experiments (n = 3). ***P < 0.001.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3180/3180fig5.jpg\nFigure 5. Cut-loading reveals that dark-adapted rabbit horizontal cells are tracer coupled. Both A-type (A) and B-type (B) horizontal cells in dark-adapted rabbit retinas exhibited homologous neurobiotin tracer coupling."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}