{
  "id": 3113,
  "origin_website": "Cell",
  "title": "Protocol for infecting and monitoring susceptible k18-hACE2 mice with SARS-CoV-2",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIntranasal inoculation of SARS-CoV-2\nTiming: ∼ 1 h\nIn this section, we describe steps for the infection of eight- to twelve-week-old mice with SARS-CoV-2 through intranasal administration (drop by drop technique at the tip of the nostril). All following steps should be performed under biosafety level 3 containment, by personnel with competence for animal handling under biosafety level 3 conditions. See Figure 2[href=https://www.wicell.org#fig2] for an example of an experimental setup for intranasal administration of SARS-CoV-2 inoculum to mice in a laminar flow.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2686-Fig2.jpg\nFigure 2. Example of an experimental setup for intranasal administration of SARS-CoV-2 inoculum\nPrepare the inoculum (1) and then move the animals from the cage (2) to the chamber (3) for delivery of the anesthetic. Regulate the taps (4) to deliver the anesthetic into the chamber (3) or the nose mask (5) that is placed above a heating pad. Once the animal is anesthetized, prepare the pipette (6) with the required volume of the virus and administer.\nThaw an aliquot of virus stock.\nPrepare the inoculum obtained in Preparation of SARS-CoV-2 viral stocks step 2.a.ix. with the desired concentration, in Infection media. For the selection of a viral concentration to use in vivo, please see the note at the end of this section.\nAnesthetize mice through inhalation of isoflurane 3%–4% for induction at 1 L/min of O2 and 1%–3% for maintenance. Certify that the mouse is anesthetized before administration.",
    "Deliver the appropriate viral dose in 30 μL per animal, being a maximum of 15 μL of inoculum to each nostril of the animal, approaching the micropipette to the nose of the mouse and slowly dispense the inoculum dropwise. The volume of liquid given to each nostril should not exceed ∼ 15–20 μL. Using a P20 pipette allows a more precise dose of infection.\nCarefully observe the mouse breathing during the process.\nReturn the mouse to the cage and monitor its return to consciousness and normal behavior.\nRepeat the process to all animals.\nStore the inoculum at −80°C for future titration if required.\nCritical: A proper anesthesia of mice is essential to the correct intra-nasal administration of SARS-CoV-2. Do not place the pipette tip inside the nostril of the animal; ensure that each drop of the inoculum is inhaled before dispensing the next one; and avoid an anesthetic depth that is too deep (< 1 respiration per second).\nNote: Both dose and variant of SARS-CoV-2 chosen to infect the mice should be taken into account, as this greatly impacts the outcome of infection and the animal welfare. In Gonçalves et al.,1[href=https://www.wicell.org#bib1] we considered a low dose 1 × 104 PFU per animal, an intermediate dose 5 × 104 PFU per animal and a high dose 1 × 105 PFU per animal. For high doses, plan carefully the number of animals as severe symptoms are expected and humane endpoints may have to be applied before the end of the experiment. For each experimental group, a minimum of 5 animals were used.1[href=https://www.wicell.org#bib1]\nBefore each intranasal administration, mix the inoculum to ensure an equal dose of administration.\nClinical scores\nTiming: 1 week",
    "The animals should be monitored and weighed prior to the infection (day 0) and then daily to assess their clinical score. All animals are enrolled in a 6-day study. A detailed clinical score is provided below as infected animals can present a wide range of symptoms.\nScores are based on general clinical signs, namely:\nWeight variation: points are given according to the % of weight loss relative to initial weight (at day 0 of infection).\nNo changes or increased weight: 0 points.\n1%–6% loss: 1 point.\n7%–14% loss: 2 points.\n15%–19% loss: 3 points.\n20%–24% loss: 4 points.\n> 25% loss: implement the “humane-end-point” (HEP).\nBody condition score (BCS): BCS classification according to Ullman-Cullere et al.7[href=https://www.wicell.org#bib7]\nBCS normal (2–3): 0 points.\nLow BCS (1-1,5): 1 point.\nAppearance:\nNormal: 0 points.\nGeneral lack of grooming or piloerection: 1 point.\nOcular/Nasal discharge: 2 points.\nEyes closed: 3 points.\nBehavior:\nNormal: 0 points.\nMinor changes or exaggerated response when provoked: 1 point.\nLess mobile/ isolated but alert: 2 points.\nRestless or still and not alert: 3 points.\nNeurological symptoms:\nNo alterations: 0 points.\nTremors: 2 points.\nAtaxia: 2 points.\nSeizures: implement the HEP.\nHydration: perform skin pinch test.\nNormal – skin returns quickly to original shape: 0 points.\nDehydrated/abnormal skin pinch test – skin takes additional time to return to its normal position: 3 points.\nRespiratory movements: observe for signs of respiratory distress.\nNormal: 0 points.\nIncreased/decreased respiratory frequency: 3 points.\nSevere dyspnea (gasping): implement the HEP.\nTotal clinical score is obtained by adding all points. A summary table containing all criteria is presented in Gonçalves et al.1[href=https://www.wicell.org#bib1]",
    "Mice are humanely euthanized when reaching the HEP. A clinical score of 15 or more is considered for the implementation of the HEP of euthanasia as it reflects a significant impairment of the animal general health status and is indicative of an irreversible severe disease outcome. Independently of the total score obtained:\nA weight loss higher than 25%, seizures and severe dyspnea are established HEP.\nUnresponsiveness to stimulus for 3 sequential observations are established HEP.\nFor decision orientation, four clinical score intervals are considered:\n0–5 points represent minor changes:\nRe-evaluate animal the next day.\n6–10 points represent moderate changes:\nSeek veterinary opinion.\nRe-evaluate after 4 h.\nIf persistent after 2 sequential evaluations, consider hydration and food support or HEP application if one of the scores corresponds to a 3 at behavioral changes (unresponsive to stimulus).\n11–14 points represent major changes:\nSeek veterinary opinion.\nRe-evaluate the animal at a 1 h interval for a maximum of 3 observations.\nConsider hydration, food support and temperature control.\nIf unchanged apply a HEP.\n>15 points represent critical changes:\nApply HEP at a maximum period of 1 h.\nCritical: Certain doses and variants of SARS-CoV-2, such as the alpha B.1.1.7 variant, provoke diverse and severe symptoms. A supportive plan for SARS-CoV-2 infection may be implemented to minimize animal suffering, without impacting on the experiments and their results.\nSupportive plan points of action\nAs infected animals can present limited mobility and may not be able to eat directly from the food pellets, add a nutritional supplement (DietGel Boost®), to cages: start day -1 (before intranasal infection) to allow animals to familiarize, maintain until the end of the experiment and replace if empty.",
    "As infected animals with limited mobility may not be able to drink directly from the water bottles, replace regular bottles for long bottle caps and/or add water gel (HydroGel®) to cages: start day 3 until the end of the experiment, replace if empty.\nAs infected animals can present hypothermia, add a heating pad below and in a corner of the cage as heating support: start day 3 until the end of the experiment. Placing the heating pad only in part of the cage is important for the animal to be able to regulate its temperature.\nWhen infected animals present dehydration, include as hydration support, subcutaneous administration of duphalyte (0,2 mL) + lactate ringer (0,2 mL) from day 3, up to twice a day during the critical period.\nIf weight loss is higher than 10%, implement oral supplementation (Anima Strath®), until “satisfied”, once a day.\nNote: For disposal of biological samples and disinfection of contaminated material, please ensure inactivation of viruses. We used SeptoFin (Neodisher), with virucidal activity, at a concentration of 5% for 30 minutes, for the inactivation of viral-contaminated samples as well as contaminated material prior autoclaving. Mice corpses were autoclaved prior to biological dispose.\nAt the end of experiment, to validate and quantify the viral infection, tissues can be retrieved and processed in order to perform qPCR absolute quantification (using either a quantified virus stock or a single copy plasmid fragment as a standard curve), immunohistochemistry and/or plaque assays, as described in Gonçalves et al.1[href=https://www.wicell.org#bib1]\nAs demonstrated by Gonçalves et al.,1[href=https://www.wicell.org#bib1] possible read-outs of the infection progression include the collection of bronchoalveolar lavage, blood, organs (specially lungs and brain due to the tropism of SARS-CoV-2). Specific analyses include the immunological profile by flow cytometry, qPCR or immunoassay, and tissue pathology by histologic analysis and morphometric quantification."
  ],
  "subjectAreas": [
    "Health Sciences",
    "Immunology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}