{
  "id": 11879,
  "origin_website": "Jove",
  "title": "A Robust Discovery Platform for the Identification of Novel Mediators of Melanoma Metastasis",
  "procedures": [
    "NOTE: The animal procedures involved in the following protocol were approved by the New York University Institutional Animal Care and Use Committee (IACUC). All the procedures are conducted in facilities approved by the Association for Assessment and Accreditation of Laboratory Animal Care International (AAALAC). Figure 1 depicts the general experimental approach.\n1. Patient-derived melanoma short-term cultures (STCs)\nPlace the tissue in a 60 mm Petri dish with 1 mL of complete RPMI (RPMI 1640 supplemented with 10% fetal bovine serum (FBS), 2 mM L-glutamine, 1 mM sodium pyruvate, 1x MEM non-essential amino acids solution, and penicillin (100 IU/mL)/streptomycin (100 µg/mL)).\n\tNOTE: To increase the ratio of tumor cells, if needed, dissect and remove the tissue surrounding the tumor in the Petri dish, under a microscope, using sterile surgical instruments.\nFinely cut the fresh tissue using sterilized razor blades into 1-2 mm cubes. Add 4 mL of complete RPMI and pipette the contents of the plate up and down 5-10 times with a 10 mL serological pipette.\nTransfer the cell suspension to a 15 mL polypropylene conical tube and spin the cells down (180 × g for 5 min at 4 °C). Aspirate the supernatant, resuspend the cell pellet in 1 mL of fresh medium, and transfer the suspension to a 25 cm2 tissue culture flask.\nTo help the tissue fragments attach to the bottom, set the flask tilted at a 20°-30° angle in a tissue culture incubator at 37 °C, 5% CO2 for 20 min.\nLay the flask down flat to allow the medium to cover the tissue, and check the status of the culture daily. Split the cells when they reach 90-100% confluency. Maintain short-term cultures at a \"low\" passage number.",
    "NOTE: STCs will be established approximately 2 months post cell isolation and culture, although the actual timeline varies between samples and tumor types. After 10 to 14 passages, cell lines reach 100% purity, containing only melanoma cells29. The passage number threshold is empirically determined by observing changes in cell morphology, doubling time, and behavior in vivo. To preserve heterogeneity and other characteristics of the parent tumor, do not split the cells more than 1:5.\nUpon establishment of a STC and with any cell line model to be injected into animals as described in subsequent steps, transduce cells with a reporter.\n\tNOTE: A fluorescent tag (e.g., red fluorescent protein (RFP), green fluorescent protein (GFP)), for example, allows for ex-vivo immunofluorescence imaging and sorting of tumor cells by fluorescence-activated cell sorting (FACS). Luciferase enables in vivo bioluminescence imaging, a useful tool for monitoring experimental progression (section 4).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63186/63186fig01v2.jpg\nFigure 1: Schematic illustrating the described workflow, from patient data integration to generation and analysis of in vivo data from mice. Abbreviations: LOF = loss of function; GOF = gain of function. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63186/63186fig01largev2.jpg]\n2. Xenograft implantation\nNOTE: The experimental procedures described here are conducted in mice that have impaired adaptive and innate immune systems, NOD.Cg-PrkdcscidIl2rgtm1Wjl/SzJ (NSG) mice; or in mice that lack adaptive immunity only, such as the T cell-deficient athymic/nude (NU/J) mice. Animals are of male sex, 8 to 10 weeks of age. Females often exhibit a high incidence of gonadal metastases upon intracardiac injection of tumor cells, which reduces their survival.",
    "For subcutaneous and intradermal injections, prepare a 1:1 cell suspension by mixing one part of cells suspended in 1x Dulbecco's Phosphate-Buffered Saline (DPBS) with one part thawed extracellular matrix substrate (EMS), and keep on ice at 4 °C. For intravascular (intracardiac, intracarotid, retro-orbital, tail vein, or splenic) injections, suspend the cells in DPBS only.\n\tNOTE: The appropriate volume for intradermal injections should be kept as low as possible (30 µL). For subcutaneous injections, the injected volume can go up to 150 µL, and for intravascular injections, up to 250 µL (based on the weight of the animal). Add to the final cell suspension 10-30% extra volume of injectate, based on the amount injected and the syringe used to account for the dead volume inside the slip tip and that of the needle (e.g., a 1 mL tuberculin syringe with a 30 G, 25mm needle has a dead volume of 100 µL).\nConduct a pilot to characterize the behavior of the cell lines in use and the timeline of tumor progression in vivo. For intradermal injections, start by injecting 1,000 up to 50,000 cells/30 µL. For subcutaneous injections, start by injecting 10,000 up to 2 × 106 cells/150 µL. For intravascular (intracardiac, intracarotid, retro-orbital, and splenic) injections, start by injecting 50,000 cells/150 µL.\n\tNOTE: Intravascular injections predispose the animals to embolic events, either by introducing air into the circulatory system or by using an excessive number of cells that occlude the small vessels. Mix the cell suspension well to avoid clumping. Prime the syringe before loading the cell suspension. Remove any air bubbles inside the syringe. Keep the cell suspension/syringes on ice until loading and injection time.",
    "Administer anesthesia by inhalation. Set the oxygen level regulator between 1-2 L/min. Place the animal in the induction chamber with the isoflurane vaporizer set at 2.5-5% for induction and 1.5-3% for maintenance.\n\tNOTE: Monitor the breathing and heart rate of the animal while in the anesthesia induction phase. Do not leave the animal unattended. Do not monitor more than one animal simultaneously. Titer the amount of anesthesia to the weight of the animal.\nMove the animal from the induction chamber into the nose cone. Apply sterile petrolatum ophthalmic ointment on the animal's eyes to prevent corneal dryness during the procedure.\nShave the procedure site with a straight razor blade tilted at a 30° angle. Clean the skin of the procedure area with 70% isopropyl alcohol swabs. Before any further steps, assess for a sufficient level of anesthesia by pedal reflex.\nFor intradermal injections, perform the entire procedure inside a biosafety cabinet to maintain aseptic conditions.\n\t\nAnesthetize and shave the animal as described in steps 2.3-2.5.\nGrasp and retract the skin backward against the trajectory of the needle stab. Using a 31 G insulin syringe needle, 6 mm long, held at an acute angle, gently puncture the skin with the bevel facing upward.\nFeel the pressure release at the tip of the needle. Advance gently to stay inside the intradermal compartment and not pass through the entire skin depth into the subcutis. Crucial: If one slips into the subcutaneous space, remove the needle, change the injection area and reinsert the needle. Inject the entire volume (30 µL) of cell suspension slowly until a dome-shaped wheal is observed.\n\t\tNOTE: Low injection volumes will induce less dissection of the skin layers and less architectural distortion.\nKeep the needle in and count to 5.",
    "NOTE: EMS becomes viscous at body temperature, helping to avoid backflow through the needle puncture wound.\nRemove the needle and single-house the animal in a cage on a warm pad to recover. Return the animal to the vivarium cage after regaining consciousness, when sternal and ambulatory.\n\t\tNOTE: Monitor the animal continuously during all the procedures described in this protocol. Do not leave the animal unattended or monitor more than one animal simultaneously.\nMonitor the progression of tumor growth, weight loss, and overall health status in conjunction with veterinary staff daily in the initial growth phase and more intensely, if needed, after animals start losing weight. During these monitoring sessions: weigh the animals and plot a chart to monitor weight loss, and check for signs of tumor ulceration, neurological, locomotor, and/ or behavioral signs (lethargy, lack of grooming, low food or water intake).\n\t\tNOTE: Euthanize the animals immediately after observing signs of advanced disease (more than 20% weight loss, a body condition score of <2, extremely reduced activity levels, paralysis, or seizures). Use the euthanasia method approved by the institution's IACUC (e.g., an automated tabletop CO2 chamber is used to expose the animals to CO2 for 15 min followed by a secondary method of euthanasia, either cervical dislocation, decapitation, or pneumothorax induced bilaterally by incising the ribcage).\nTake measurements with calipers and use the length (L) and the width (W) dimensions of the tumor to calculate the volume (V) with the formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/63186/63186eq01.jpg\nFor subcutaneous injections:\n\t\nPerform the entire procedure inside a biosafety cabinet to maintain aseptic conditions26,27.\nAnesthetize and shave the animal as described in steps 2.3-2.5.",
    "Using a 28 G to 31 G insulin syringe needle, 6 mm in length, held at an acute angle, gently puncture the skin with the bevel facing upward. Feel the pressure release at the tip of the needle twice while passing through the epidermis, dermis, and hypodermis.\n\t\tNOTE: The second time a pressure release is felt at the tip of the needle indicates the subcutaneous compartment has been reached.\nInject the entire volume (30-150 µL) of cell suspension slowly until an elongated ellipse-shaped wheal is observed. Keep the needle in and count to 5. Count to 10 for larger volumes (more than 50 µL).\n\t\tNOTE: EMS becomes viscous at body temperature, helping to avoid backflow through the needle puncture wound.\nRemove the needle and single-house the animal in a cage on a warm pad to recover. Return the animal to its vivarium cage after regaining consciousness, when sternal and ambulatory.\n\t\tNOTE: During the postprocedural monitoring, observe for any signs of complications (low respiratory rate, bleeding, slow recovery) and address them appropriately. If no improvement is observed, proceed to humane euthanasia procedures described in the NOTE of step 2.6.6.\nMonitor the animal for tumor growth, weight loss, and overall health status as described in steps 2.6.6-2.6.7.\nFor intracardiac injections:\n\t\nPerform the entire procedure inside a biosafety cabinet to maintain aseptic conditions26,30.\nAnesthetize the animal as described in steps 2.3-2.4.\nTransfer the animal onto the heated platform of the ultrasound machine and secure it with hypoallergenic tape to the nose cone.\nShave the thorax with a straight razor blade tilted at a 30° angle. Clean the skin of the procedure area with 3 applications of 10% povidone-iodine alternating with 3 applications of isopropyl alcohol.",
    "Before any further steps, assess for a sufficient level of anesthesia by pedal reflex. Apply ultrasound gel on the procedure site.\nCapture the cardiac window with the ultrasound probe. Position the ultrasound probe in the middle of the thorax on the left side of the animal to capture a horizontal window oriented to obtain a cross-sectional view (short axis) of the left ventricle. Ensuring that the long axis of the probe faces upwards, fix the probe at a 50° angle and the heated platform at a 20° angle. Lock the probe and the support frame in position.\nDraw up the cell suspension while working inside the biosafety cabinet in a tuberculin 1 mL syringe with a 30 G, 25mm needle. Remove any air bubbles in the syringe.\n\t\tNOTE: It is important to create and maintain a single-cell suspension while cells are processed and injected. Removing air bubbles is an important step to avoid air embolism. A well-primed syringe-needle system will prevent avoidable deaths in the experimental group. Always draw more volume into the syringe than will be injected. The extra volume will help remove the air by injecting some of the cell suspension back into a 1.5 mL tube.\nLock the syringe in the stereotactic injector. Under ultrasound guidance, advance the needle through the thoracic wall into the left ventricle of the heart. Inject the entire volume (100-250 µL) of cell suspension slowly.\nRemove the needle and single-house the animal in a cage on a warm pad to recover. Return the animal to its vivarium cage after regaining consciousness, when sternal and ambulatory. Monitor the animal for tumor growth, weight loss, and overall health status as described in step 2.6.6.\nFor intracarotid injections:\n\t\nPerform the entire procedure on a properly disinfected surface to help maintain aseptic conditions30.",
    "Anesthetize the animal with a ketamine (100 mg/kg) and xylazine (10 mg/kg) cocktail by intraperitoneal injection with an insulin syringe, 28 G needle. Apply sterile petrolatum ophthalmic ointment on the animal's eyes to prevent corneal dryness during the procedure.\nShave the procedure area with a straight razor blade tilted at a 30° angle. Before any further steps, assess for a sufficient level of anesthesia by pedal reflex.\nPlace the animal under a stereo microscope on a warming pad. Clean the skin of the procedure area with 3 applications of 10% povidone-iodine alternating with 3 applications of isopropyl alcohol. \nDon sterile personal protection equipment (PPE) and sterile gloves. Prepare the sterile field by laying a sterile drape over the animal's body.\n\t\tNOTE: If the sterile drape does not have a hole appropriate for the size and location of the incision, fold the drape in half and use Metzenbaum scissors to cut the appropriate size hole in the middle of the sterile drape.\nUse a scalpel or Iris scissors to incise the skin from half the neck down to the sternum. With two microsurgery forceps, bluntly dissect apart the 2 submandibular salivary glands in the midline plane. Use an electric cautery for hemostasis, if necessary.\nDissect the fascia surrounding the common carotid artery (CCA) from the manubrium towards the bifurcation and continue medially to free up the posterior wall of the external carotid. Clip the external carotid artery (ECA) temporarily before injecting.\n\t\tNOTE: When dissecting around the circumference of the CCA, care has to be taken not to damage the vagus nerve (lies lateral to the artery).\nLoad the cell suspension in a 1 mL syringe with a 33 G, 15 mm needle.",
    "Pass two 7-0 ligatures under the CCA, and perform a loose instrument knot for each of the two ligatures. Use a 5 mm, 10 G pressure vessel clip and temporarily clip the ECA. Tie the proximal ligature; then, tie the distal ligature loosely (next to the bifurcation of the CCA). Use the distal loop later to control the bleeding post-injection.\nUsing the syringe with a 33 G, 15 mm needle, gently puncture the CCA with the bevel of the needle facing upward and at an acute angle. Inject the entire volume (50-150 µL) of cell suspension slowly.\nGrip the distal loop with the forceps and lift it while removing the needle to occlude the lumen of the CCA and stop the bleeding. Exchange the syringe with a #7 Jewelers forceps and tie down the distal loop.\nThrow another instrument knot on the distal ligature and remove the vessel clip off the ECA. Control the surgical field for bleeding and cauterize any bleeding vessels before closure. Use a 9 mm stapling device to close the skin of the animal and place the animal on a warm pad to recover.\n\t\tNOTE: Remove the staples 7-10 days post-surgery.\nAdminister analgesic medication subcutaneously-Buprenorphine (0.3 mg/mL) every 12 h for 72 h post-surgery at a concentration of 0.1 mg/kg.\n\t\tNOTE: Alternatively, consider using an extended-release analgesic medication, which requires 1 dose every 72 h.\nReturn the animal to its vivarium cage after regaining consciousness, when sternal and ambulatory. Monitor the animals postoperatively daily for signs of surgical site infection or pain, general health status, and complications.\n\t\tNOTE: Animals that do not recover well from survival surgery may be given additional doses of pain medication and will be euthanized humanely if not fully recovered by 72 h post-surgery.",
    "Monitor the animal for tumor growth, weight loss, and overall health status as described in step 2.6.6.\nFor retro-orbital injections:\n\tNOTE: Use this technique as an alternative to tail vein injections when the operator is trained and proficient in this technique and when there is a strong scientific justification. Cell suspensions delivered via this route can induce tumor growth in the retro-orbital space; hence, careful consideration should be given to the risks and benefits when choosing this technique. For example, to take advantage of the direct circulatory connection of the retro-orbital venous sinus with the intracerebral veins via anastomoses, select this method when brain tumor formation has failed using other injection routes.\n\t\nPerform the entire procedure inside a biosafety cabinet to maintain aseptic conditions. Don sterile PPE and gloves.\nAnesthetize the animal as described in steps 2.3-2.4.\n\t\tNOTE: For this procedure, do not apply sterile petrolatum ophthalmic ointment to the animal's eyes because this will impede injection; apply only local anesthetic drops.\nLoad the cell suspension in an insulin syringe with a 28-31 G, 6 mm needle.\nWith the animal in prone position, retract the eyelids until the eye protrudes. Apply 1 droplet of local anesthetic into the eye on the side undergoing the procedure.\nInsert the needle at a 30-45° angle between the eye and the medial epicanthus with the bevel facing downwards. Inject the cell suspension (10-150 µL) slowly.\n\t\tNOTE: Slower movements prevent damage to the eye and the backflow of the injectate.\nPerform the steps described in 2.7.5-2.7.6.\nFor splenic injections:\n\t\nPerform the entire procedure inside a biosafety cabinet to maintain aseptic conditions31. Don sterile PPE and sterile gloves.\nAnesthetize and shave the animal as described in steps 2.3-2.5.",
    "Place the animal in a right lateral recumbent position. Clean the skin of the procedure area with 3 applications of 10% povidone-iodine alternating with 3 applications of isopropyl alcohol and prepare the surgical field as described in step 2.9.5.\nUsing Metzenbaum scissors or a scalpel, make a 1 cm incision in the left flank of the abdominal wall followed by an incision into the peritoneum.\n\t\tNOTE: The spleen will be seen through the translucent abdominal wall after making the skin incision. Perform the peritoneal incision exactly in this site.\nExpose the spleen and the splenic hilum through the incision. Using a 28-31 G insulin syringe needle, 6 mm in length, gently puncture the spleen with the bevel of the needle facing upward and at an acute angle.\n\t\tNOTE: If the puncture wound bleeds, cauterize the site to limit bleeding and backflow.\nInject the entire volume (50-100 µL) of cell suspension slowly. Remove the needle. Place a small gauze on the spleen and apply pressure with a forceps. Clamp the spleen lightly between the gauze using fine mosquito forceps and wait for 15 min.\nPerform a splenectomy by tying the splenic hilum with a 3-0 or 4-0 silk suture, cauterizing the vessels if necessary. Close the peritoneum with a 5-0 polydioxanone (PDS) or polyglycolic acid absorbable suture.\nPerform the steps described in steps 2.7.5-2.7.6.\n\t\tNOTE: Animals that present bleeding complications or that have not recovered fully 72h post-surgery should be humanely euthanized. Remember that the wellbeing of the mice is the priority at all times.\n3. Staged survival surgery (SSS)",
    "Based on the experimental conclusions from step 2.2, determine the proper time to survival surgery. Depending on the cell line and experimental hypothesis, select an earlier time point for tumor resection (at a tumor volume = 150 mm3) or a later time point (at a tumor volume = 500 mm3)26.\n\tNOTE: The tumor volume limit is 1,500 mm3 when the tumor burden is high enough to be detrimental to the wellbeing of the animal and predisposes to complications.\nAnesthetize and shave the animal as described in steps 2.3-2.5.\n\tNOTE: The entire procedure is performed inside a biosafety cabinet.\nClean the skin of the procedure area with 3 applications of 10% povidone-iodine alternating with 3 applications of isopropyl alcohol and prepare the surgical field as described in step 2.9.5.\nUsing Iris scissors or a scalpel, incise the skin, maintaining a 5-7 mm resection margin from the edge of the tumor.\n\tNOTE: The margin for resection depends on the ability of the tumor to spread locally. For aggressive tumors, increase the resection margin while making sure enough skin is left to perform the wound closure.\nIn the case of intradermal tumors, resect the tumor along with the circumferential skin.\nFor subcutaneous tumors, dissect and remove the tumor under the skin.\n\tNOTE: If the tumor invades the peritoneum and/or the skin, resect it en bloc with the tumor and close the peritoneum with 5-0/4-0 PDS or polyglycolic acid absorbable sutures.\nClose the wound with the 9 mm stapling device.\n\tNOTE: Remove the staples 7-10 days post-surgery. Administer analgesic medication and place the animal on a warm pad to recover. Continue administering analgesic medication for 72 h post-surgery, once every 12 h according to step 2.9.13. Animals with bleeding complications or that have not regained full consciousness post-surgery should be humanely euthanized.",
    "Single-house the animal in a cage, on a warm pad to recover. Return the animal to the vivarium cage after regaining consciousness, when sternal and ambulatory.\nContinue to monitor the animal post-surgery for local recurrences, weight loss, neurological, locomotor, and/or behavioral signs (lethargy, lack of grooming, low food or water intake) and overall health status.\n4. In vivo imaging (Figure 2A)\nAdminister D-luciferin substrate (150 mg/kg) to animals by intraperitoneal injection with a 1 mL insulin syringe, 28 G needle.\n\tNOTE: Tumor cells must be stably transduced with the luciferase cDNA.\nInduce anesthesia as described in steps 2.3-2.4, 6 min after the D-luciferin substrate injection.\nPerform imaging using a bioluminescence imaging (BLI) scanner (in vivo imaging system)26.\nMove the animal inside the imaging chamber and into the nose cone. Image up to 5 animals simultaneously, depending on the imaging system's capacity.\nStart the instrument by pressing initialize. Set the exposure time setting to auto (1-120 s).\nCapture a blank image to subtract any background if needed. Click acquire and save the image after the acquisition sequence is completed.\nPlace the animal back in a cage, which sits with 50% of the base surface area over a warming pad to recover from anesthesia. Return the animal to the vivarium cage after regaining consciousness, when sternal and ambulatory.\nFor data analysis in the same in vivo imaging software with which the images were captured, navigate to the folder where the images are saved, and open the images of all the mice pertaining to the experiment at once.\n\tNOTE: Analysis of one image at a time will not allow normalization across groups.\nSet the units to radiance (not counts). Ensure that the checkbox indicating individual is unchecked, as this will preclude normalization of signal across groups.",
    "Using the Region of Interest (ROI) drawing tool, draw circular ROIs for the brain region and rectangular ROIs for the body. Be careful to exclude the ears and nose from the brain ROI, as they tend to emit unspecific luminescence. To minimize bias in this process, draw ROIs on the photographs of the mice only, without the luminescent signal overlaid.\nSelect Measure ROIs to quantify the signal and export the data to a spreadsheet. Analyze differences between groups by plotting total luminescent flux (p/sec/cm2/sr) in body regions of interest.\n\tNOTE: To assess differences between groups in brain tropism specifically, calculate the ratio between the brain signal and body signal for each mouse. This controls for intermouse variation in overall tumor burden and differences in levels of luciferase expression between experimental groups.\n5. Ex vivo magnetic resonance imaging\nPerform ex vivo MRI immediately after euthanasia. Alternatively, harvest the organs of interest, fix them in formalin for up to 72 h, and perform the imaging at a later timepoint.\nAcquire the images with a 7-Tesla (7-T) (300-MHz) micro-MRI system equipped with an NMR console and a zero-boil-off, horizontal bore magnet or similar equipment.",
    "NOTE: The need for an actively shielded gradient coil insert with the correct trade-off of performance is crucial. It must provide gradient linearity of at least 50 mm of dynamic spherical volume (DSV) to cover the set of samples examined simultaneously with no geometric distortion. The combination of gradient strength (ranging from 440 to 750 mT/m) and duty cycle enabling maximum simultaneous DC currents ranging from 3 x 30 A to 3 x 87 A will enable adequate imaging performance. The gradient coil insert used (see the Table of Materials) enables the following performance: 660 mT/m, 130 µs rise time, 3 x 87 A, and a DSV = 80 mm.\nPerform the scans with a commercial transmit-receive circularly polarized whole mouse body radiofrequency coil (OD = 59 mm, ID = 38mm, L = 40 mm) tuned to 300.16 MHz, the 1H proton Larmor frequency.\n\tNOTE: This rf probe enables the acquisition of 3D datasets with submillimetric isotropic resolution (<150 µm) during overnight scans spanning 8-12 h.\nDetect the tumor burden using multiple sequences30.\n\tNOTE: Hyperintense signal detected by a T2-weighted, Rapid Imaging with Refocused Echoes (RARE) sequence recognizes edema surrounding tumors.\nPerform the 3D RARE sequence with the following acquisition parameters: [120 µm]3 isotropic resolution; acquisition time 5 h, 27 min; repetition time (TR) = 500 ms; echo spacing (ES) = 12.7 min; Turbo factor TFx = 12; effective echo time (TEeff) = 76.2 ms; bandwidth (BW) = 75 KHz; Matrix size = 2843; field of view (FOV) = [4.0 mm]3; number of averages (Nav) = 6.\nDetect metastases using the following parameters.",
    "For pigmented metastases with signal brightening, use a T1-weighted 3D Gradient echo sequence with the following parameters: [120 µm]3 isotropic resolution; acquisition time 2 h, 41 min; TR = 20 ms; echo time (TE) = 4.0 ms; flip angle (FA) = 18°; BW = 75 KHz; Matrix size = 2843; FOV = [34.0 mm]3; Nav = 6.\nFor unpigmented and/or hemorrhagic metastases, use a hypointense signal when acquiring under a T2*-weighted, multigradient echo (MGE) sequence (3D MGE, [120 µm]3 isotropic resolution; acquisition time 3 h, 35 min; TR = 40 ms; TE = 3.6 ms; ES = 3.2 ms; 4 echoes; FA = 20°; BW = 100 kHz; Matrix size = 2843; FOV = (34.0 mm)3; Nav = 4.\nUse all 3 sequences to quantify tumor burden.\nCross-reference the tumor areas identified during analysis with histological sections to ensure accuracy. See sections 7 and 8.\n6. Tissue processing for single-cell or bulk RNA sequencing\nEuthanize the animal by using any method approved by the institution's IACUC. See one of the procedures described in the NOTE of step 2.6.6.\nDissect the organs of interest and place them in separate wells of a plate containing Hank's Balanced Salt Solution (HBSS) on ice. Work expeditiously and keep the tissue on ice at all times to maximize cell viability.\n\tNOTE: The following steps are specific for brain processing. Adjust the collagenase type to the specific tissue, based on your needs.\nPrepare a 6-well plate with 3 mL of HBSS in each well.\nTo visualize and further help guide the dissection, use a fluorescence microscope and identify the labeled areas.",
    "Dissect the fluorescent areas and place the tissue fragments in the 6-well plate (1 fragment per well if individual metastatic foci are to be analyzed or multiple fragments from one organ if multiple metastases in the same organ are to be analyzed). Use sterile razor blades to mince the tissue into fragments as small as possible (without spending more than 1-2 min on this step for each sample).\n\tNOTE: Limiting the processing time of the tumors helps preserve cell viability.\nAspirate and transfer the contents of each well to a 15 mL conical tube.\n\tNOTE: Cut the tip of a 1,000 µL pipette tip to facilitate the transfer of larger fragments.\nAdd 1 mL of HBSS to the well and ensure that the remaining tissue fragments/cells are transferred to the 15 mL tube, which will contain a final volume of 4 mL. Add 50 µL of collagenase type I (40 mg/mL) and 12.5 µL DNase I (2,000 units/mL) to each tube.\nPlace the conical tubes in a water bath heated at 37 °C for 45 min. Briefly vortex the conical tubes every 5 min.\nPrewet a 70 µm strainer with HBSS. Use the capped end of a sterilized microcentrifuge tube or the plastic part of a syringe plunger and grind the tissue homogenates through a 70 µm strainer into a new 50 mL conical tube.\n\tNOTE: Prewetting the strainers with HBSS or FACS buffer facilitates straining.\nWash the strainer with 1 mL of HBSS. Prewet a 40 µm strainer with HBSS. Filter each sample again through a 40µm strainer into a new 50 mL conical tube. Add 1 mL of FBS to the 40 µm strainer to wash it. Keep the conical tubes on ice all the time.",
    "Fill up the conical tube to 50 mL with ice-cold DPBS. Spin down the cells (180 × g for 10 min at 4 °C). Discard the supernatant, being careful not to lose the cell pellet.\n\tNOTE: For brain samples, resuspend the cells in 2.5 mL of 38% density separation solution (dilute in HBSS and store at room temperature (RT)). Transfer to 5 mL FACS tubes. Spin for 20 min at 800 × g. Cut the tip of a 1,000 µL pipette tip and remove the top fat layer. Do not leave any fat on the walls of the tubes. If any fat is left, spin down again and repeat the process. This is a critical step. Remove the rest of the liquid phase (the pellet will be translucent and hard to visualize).\nResuspend the cells in 1 mL of red blood cell (RBC) lysis buffer and incubate for 60 s at RT. Quench the lysis solution by adding 20 mL of DPBS.\nSpin down the cells at 180 × g for 10 min at 4 °C. Remove the supernatant and resuspend the cells in 2 mL of FACS buffer (5% FBS in DPBS).\nProceed with sorting labeled cells and/or library preparation for either bulk or single-cell RNA-sequencing.\n\tNOTE: Cells can be spun down, snap-frozen, and stored at -80 °C prior to RNA isolation for bulk RNA-seq.\n7. Animal tissue perfusion and preparation for immunohistological analyses\nAnesthetize the animal with an overdose of ketamine (300 mg/kg) and xylazine (30 mg/kg) cocktail by intraperitoneal injection with an insulin syringe and a 28 G needle.\nExpose the heart by gross dissection and make an incision in the right atrium. Hold the heart gently in place with long, curved forceps facing anteriorly.",
    "NOTE: Formalin and paraformaldehyde (PFA) are carcinogens. Read the Safety Data Sheet (SDS), avoid exposure to fumes, and wear the appropriate PPE.\nUsing a 10 mL syringe with a 22 G, 22 mm needle, inject 10 mL of DPBS followed by 10 mL of 4% PFA into the left ventricle.\nProceed to harvest the organs and load them into prelabeled histological cassettes. Place the cassettes in an appropriately sized container that accommodates enough fixative (formalin) to cover the tissues.\n\tNOTE: Ideally, the fixative volume should be 5-10 times the volume of the tissues.\nFix the organs inside the histological cassettes in 10% formalin for 48-72 h. Discard the 10% formalin and wash the cassettes twice with 1x DPBS.\nBegin the dehydration process by immersing the cassettes in 70% ethanol for 2 h. Continue to immerse the cassettes successively in increasing ethanol concentrations: 80%, 95%, 100% for 1 h each. Change the 100% solution twice after 1.5 h. Immerse the cassettes in xylene for 1.5 h and perform three changes of the solution.\nEmbed the cassettes in paraffin wax at 58-60 °C. Section the paraffin blocks. Proceed to hematoxylin and eosin (H&E) orimmunohistochemistry staining.\nTo identify melanoma cells, use either of these markers or a panel: S100, Melan-A, HMB-45, Tyrosinase, MITF. When possible, use Nuclear Mitotic Apparatus Protein (NuMA) staining as it is a highly specific human cell marker.\n\tNOTE: NuMA staining offers a sharp delineation between host (mouse) and engrafted cells (human) that aids in image processing and subsequent tumor quantification stages.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63186/63186fig02v2.jpg",
    "Figure 2: Examples of BLI, brightfield, ex vivo fluorescence, and H&E staining images illustrating the multipronged approach for the analysis of candidate genes' effects in melanoma metastasis. (A) BLI, (B) BF, (C) ex vivo fluorescence, and (D) H&E staining images. The images used for the purpose of illustration correspond to an experiment in which 131/6-4L melanoma cells transduced with a non-targeting control shRNA (shNTC) or an shRNA targeting FUT8 were injected into immunodeficient (NSG) mice. FUT8 silencing impaired the metastatic dissemination of melanoma cells. Scale bars and color bar = p/sec/cm2/sr × 106 (A), 100 mm (B, C), 100 µm (D). Abbreviations: BLI = bioluminescence imaging; H&E = hematoxylin and eosin; shRNA = short hairpin RNA; shNTC = non-targeting control shRNA; NSG = non-obese diabetic severe combined immunodeficiency gamma; FUT8 = fucosyltransferase 8; BF = brightfield. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63186/63186fig02largev2.jpg]\n8. Nuclear Mitotic Apparatus Protein (NuMA) staining (Figure 3)\nUse an anti-NuMA antibody as a highly human-specific mitotic spindle marker for the identification and quantification of metastatic burden in tissue sections. 8.1. Highly specific and sensitive identification of melanoma cells is achieved.\nIf chromogenic immunohistochemistry for NuMA is performed on an automatic immunostaining instrument, follow these steps as described32:\nDeparaffinize the sections in xylene and rehydrate them in sequentially decreasing ethanol concentrations. Keep the slides submerged for 15 min in xylene and transfer them to 100% ethanol for another 15 min.\n\tNOTE: The remainder of the ethanol rehydration steps (95%, 80%, 75%) last for 3 to 5 min each.\nRinse the slides in deionized water.\nPerform epitope retrieval by submerging the slides in a container (e.g., Coplin staining jar) in 10 mM sodium citrate buffer, pH 6.0, in a 1200 Watt microwave oven at 100% power for 10 min.",
    "Use unconjugated, polyclonal rabbit anti-human NuMA antibody for labeling, diluted 1:7,000 in Tris-Bovine serum albumin (BSA) (25 mM Tris, 15 mM NaCl, 1% BSA, pH 7.2). Run the appropriate positive and negative controls in parallel with the study sections.\nIncubate the slides with the primary antibody for 12 h. Detect the primary antibody with goat anti-rabbit HRP conjugated multimer and visualize the complex with 3,3-diaminobenzidine and a copper sulfate enhancer.\nWash the slides in distilled water, counterstain with hematoxylin, dehydrate, and mount with permanent medium.\n\tNOTE: The dehydration steps are the reverse of the rehydration steps described in step 8.3. Scan the slides with the available scanner at 20x or 40x magnification and upload them to a database.\nUsing software, draw ROIs to include all NuMA-stained cells within the organ tissue, excluding other organ parenchyma and empty spaces.\nAdjust the settings to categorize the NuMA-positive and NuMA-negative cells while using appropriate positive and negative controls for each organ. Use an established software algorithm to quantify the total number/percentage of NuMA-positive cells for each sample.\n9. Tissue slice immunofluorescence\nTo identify the metastatic stage in which a particular gene candidate is required (e.g., extravasation vs. survival after seeding), one can determine tissue slice immunofluorescence at different time points to track tumor cell progression from injection to distant organ invasion, seeding, and growth. This approach allows the addition of markers for neighboring cells to capture the extravasation event and the surrounding tumor microenvironment changes33.\nAnesthetize the animal as described in step 7.1.\nInject 100 µg of fluorophore conjugated Lycopersicon Esculentum (Tomato) Lectin into the left ventricle of each animal, 3 min prior to perfusion, to delineate the vascular endothelium.\n\tNOTE: Allow time for the Tomato Lectin to recirculate in the entire system.",
    "Perfuse the animal as described in steps 7.2-7.3. Harvest the organs of interest and transfer them into prelabeled containers filled with 4% PFA. Fix the tissue for 24 to 48 h. Section the tissue using a vibratome into 30-50 µm thick slices.\n\tNOTE: Thickness should be optimized. Slices between 30 µm and 50 µm thickness are recommended, especially when performing z-stack imaging.\nIncubate the slices in blocking buffer (10% Normal Goat Serum, 2% BSA, 0.25% Triton X-100 in DPBS) for 2 h at RT.\nPerform a staining optimization experiment.\n\tNOTE: As antigen retrieval time, buffers used for antigen retrieval, temperature, different antibodies/different lots, and the type of tissue influence the staining, optimization experiments are necessary.\nAdd primary antibodies at an optimized dilution and incubate for an optimized time at an optimized temperature (see examples in Table 1).\n\tNOTE: Use appropriate controls for primary/secondary antibodies and unstained tissue samples.\nWash the tissue slices 3 times for 5 min with 0.25% Triton X-100 in DPBS.\nIncubate the tissue slices in secondary antibody diluted in blocking solution for the desired time (Table 1).\nWash the tissue slices 3 times for 5 min with 0.25% Triton X-100 in DPBS.\nStain the nuclei with 4′,6-diamidino-2-phenylindole (DAPI) diluted 1:1,000 in DPBS or blocking buffer for 5 min.\nAdd 2 drops of antifade fluorescence mounting medium to a coverslip and mount the tissue onto glass slides, making sure the slices are fully covered by mounting medium.\n\tNOTE: Ensure there are no air bubbles directly on the slices as this distorts microscopy.\nCapture confocal images with the available microscope using a 60x oil immersion objective.\n\tNOTE: When acquiring confocal images, apply the same settings parameters (voltage, airy units, and gain) across all the images within the experiment.\nCapture non-confocal images using the microscope at 10x, 20x, or 40x.",
    "Upload the pictures in an image analysis software and analyze them by comparing the parameters of choice (i.e., area, number, intensity of markers, or contact with adjacent cells).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}