{
  "id": 12013,
  "origin_website": "Jove",
  "title": "Obtaining Cancer Stem Cell Spheres from Gynecological and Breast Cancer Tumors",
  "procedures": [
    "This protocol was performed complying with the ethical guidelines of the Coimbra Hospital and Universitary Center (CHUC) Tumor Bank, and was approved by CHUC's Ethics Committee for Health and by the Portuguese National Data Protection Commission.\n1. Sphere-forming Protocol and Derived Adherent Populations from Continuous Cell Cultures\nNOTE: Perform all procedures under strict sterile conditions.\nPreparation of non-adherent suspension culture flasks or plates by coating the growth surface with poly(2-hydroxyethyl-methacrylate (poly-HEMA)\n\t\nPrepare a 15 mg/mL solution by stirring poly-HEMA in absolute ethanol at 65 °C. Coat cell culture flasks or plates with 50 μL/cm2.\nLeave to dry at 37 °C in a drying oven. If necessary, wrap the plates and store at room temperature.\nPreparation of the sphere culturing media (SCM)\n\t\nPrepare a 2% solution of methylcellulose in ultrapure water and sterilize in the autoclave. Methylcellulose tends to be easier to solubilize by cooling; therefore disperse the powder in water at 80 °C and stir until cooled23.\nPrepare a two-times concentrated solution of SCM (stock solution). SCM working solution contains DMEM-F12, supplemented with 100 mM putrescine, 1% insulin, transferrin, selenium and 1% antibiotic-antimycotic solution (10,000 U/mL penicillin, 10 mg/mL streptomycin and 25 μg/mL amphotericin B).\nTo prepare the SCM, mix equal volumes of the SCM stock solution with the 2% solution of methylcellulose.\nComplete the medium immediately prior to use by adding 10 ng/mL epidermal growth factor (EFG) and 10 ng/mL basic fibroblast growth factor (bFGF).\nIf more fastidious cell lines are in use, supplement the medium with 0.4% bovine serum albumin, which might be an advantage.\nStart with a flask of MCF7 or HCC1806 breast cancer or ECC-1 or RL95-2 endometrial cancer cells (or other cancer cell line of choice) with 80% to 90% confluence.",
    "Discard the cell culture media, wash with phosphate buffered saline solution (PBS) and detach the cells with trypsin-EDTA (1 to 2 mL for a 75 cm2 cell culture flask).\nAdd cell culture media (2 to 4 mL for a 75 cm2 cell culture flask) and centrifuge at 200 x g for 5 min to discard enzymes.\nSuspend the pellet in a known volume of cell culture media and pipette up and down to ensure a single cell suspension. For this purpose, a 40 μm cell strainer can be used.\nCount the cells in the hemocytometer and calculate the cell concentration of the cell suspension. Take advantage of this step to ensure observation of a single cell suspension. Careful cell counting is essential to accurately quantify the effects of treatments.\nSuspend the determined amount of cell suspension in SCM complete medium and transfer to poly-HEMA coated dishes. As a reference value for seeding density, consider 500 to 2000 cells/cm2.\n\tNOTE: Optimization of seeding density and time of culture for each cell line is highly recommended24.\nIncubate at 37 °C and 5% CO2 for 2 days without disturbing the plates.\nRe-establish the concentration of growth factors by adding 10 ng/mL EFG and 10 ng/mL bFGF to the cell culture media. Repeat this step every two days.\nIncubate at 37 °C and 5% CO2 until 5 days after plating (this can vary from 3 to 12 days according to the cell line) to obtain spheres, which present the morphology of suspension ball-shaped cell colonies.\nUse or collect the spheres, by pipetting, for the experiments.",
    "To obtain derived adherent populations, place the spheres into standard culture conditions, respective of the cell line used. 1 to 2 days later, it is possible to observe a monolayer of cells growing around adherent spheres, which presents a morphology similar to the cell line of origin.\n2. Sphere-forming Protocol from Human Tumor Samples\nNOTE: The use of human samples for research purposes must comply with each country's legislation, and to be approved by the Ethics Committee of the Institutions involved.\nPrepare the transport media containing DMEM/F12, supplemented with 10% fetal bovine serum (FBS) and 2% antibiotic-antimycotic solution (10,000 U/mL penicillin, 10 mg/mL streptomycin and 25 μg/mL amphotericin B).\nPrepare the digestion media containing DMEM/F12, supplemented with 10% FBS, 1% antibiotic antimycotic solution, 1 mg/mL type IV collagenase and 100 μg/mL DNAse I.\nPrepare the enzyme inactivation media containing DMEM/F12, supplemented with 10% FBS and 1% antibiotic-antimycotic solution (10,000 U/mL penicillin, 10 mg/mL streptomycin and 25 μg/mL amphotericin B).\nPrepare the SCM as described in section 1.2.\nObtain the sample during the macroscopic study of the operative piece as soon as possible after surgical removal.\nPlace the samples in transport media and transfer them to the laboratory for where processing. Sample processing should begin within 1 h following collection to improve the success rate of the procedure. Apply caution in sample collection. Handle the samples carefully. Avoid the use of necrotic or cauterized zones.\nUnder the sterile flow chamber, transfer the sample to a dish and cut into smaller pieces (around 1 mm3) with a scalpel.\nIncubate the human tissue in a tube with digestion media in a rotating shaker up to 180 min, at 37 °C. Identify this tube as Tube A.\nReplace the enzyme solution every 15 min.",
    "Collect the digestion media (without removing any tissue fragments) and transfer it through a 40 μm cell strainer to a new tube half-filled with enzyme inactivation media. Maintain this tube at room temperature and identify it as Tube B.\nAdd new digestion media to Tube A and return it to the rotating shaker at 37 °C.\nAt each collection, check cell viability using the trypan blue exclusion method.\nRepeat this procedure for 180 min or until cell count is significantly lower.\nIncubate the tissue fragments in Tube A in a second digestion solution containing equal parts of accutase and trypsin-EDTA, stirring for 10 min at 37 °C.\nAdd the enzyme inactivation media to Tube A and filter the contents through a 40 μm cell strainer into Tube B.\nCentrifuge the cell suspension in Tube B at 200 x g for 10 min.\nSuspend the pellet in SCM and check cell concentration using a hemocytometer.\nSuspend the determined amount of cell suspension in SCM and transfer to poly-HEMA coated dishes (see step 1.1) with a seeding density of 4000 cells/cm2.\nIncubate at 37 °C and 5% CO2 for 2 days without disturbing the plates.\nRe-establish the concentration of growth factors by adding 10 ng/mL EFG and 10 ng/mL bFGF to the cell culture media.\n\tNOTE: You must do this every two days.\nIncubate at 37 °C and 5% CO2 until 5 days after plating (this can vary up to 12 days) to obtain spheres, which present the morphology of suspension ball-shaped cell colonies.\nimgsrc://cloudfront.jove.com/files/ftp_upload/60022/60022fig01.jpg",
    "Figure 1: Obtaining cancer stem cells from human endometrial tumor samples (A) and breast and gynecological cancer cell lines (B). Human tumor samples are fragmented, enzymatically digested and plated in sphere culturing medium into poly-HEMA coated dishes. Cancer cell lines are detached, cell suspensions are counted, and single cells are distributed at low density into poly-HEMA coated plates under appropriate conditions. The spheres obtained, when placed under adherent culture conditions, produce derived adherent populations. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/60022/60022fig01large.jpg]\n3. Sphere-forming Capacity, Self-renewal, and Sphere Projection Area\nNOTE: Sphere-forming capacity is the ability of a tumor cell population to produce spheres. Self-renewal is the ability of sphere cells to produce new colonies of spherical cells in suspension. The sphere projection area is representative of the area occupied by the sphere and therefore expressive of their size and the number of cell divisions undergone in a certain time period.\nDetermining the sphere-forming capacity\n\t\nAfter completion of the sphere-forming protocol, collect the spheres in a centrifuge tube and centrifuge at 125 x g for 5 min.\nDiscard the SCM and gently suspend the pellet in a known volume of fresh media. With the aim of concentrating the spheres to facilitate counting, suspend the spheres in a small media volume. Be careful not to disturb the spheres.\nUse a hemocytometer to count the spheres with more than 40 μm in diameter. Alternatively, spheres can be counted directly on the plate by using a microscope equipped with a graticule25 or using an automated system26,27.\nCalculate the percentage ratio of spheres obtained vs. the number of cells initially plated.\nDetermining self-renewal\n\t\nAfter completion of the sphere-forming protocol, collect the spheres in a centrifuge tube and centrifuge at 125 x g for 5 min.",
    "Discard the sphere culturing media and gently suspend the pellet in trypsin-EDTA.\nIncubate up to 5 min at 37 °C.\nAdd enzyme inactivation media and pipette up and down to ensure a single cell suspension.\nUsing a hemocytometer and the trypan blue exclusion method, count the viable cells in the suspension.\nInitiate the sphere-forming protocol as described in section 1.\nAfter 8 days, use a hemocytometer to count the spheres with more than 40 μm in diameter.\nCalculate the percentage ratio of spheres obtained vs. the number of cells initially plated.\nDetermining the sphere projection area\n\t\nTo evaluate the area occupied by the spheres, obtain images of at least 10 random fields per condition, in an inverted microscope equipped with an image acquisition module. A magnification of 100X to 400X is recommended.\nAnalyze images using imaging software, such as ImageJ software28, by drawing areas of interest corresponding to the spheres and measuring its area in pixels.\nCalculate sphere projection area as the mean area of pixels measured.\n4. Cancer Stem Cell Marker Assessment with Flow Cytometry\nNOTE: CD44+/CD24-/low phenotype was consistently associated with breast and gynecological cancer stem cells. The procedure described may be used to evaluate this and other cell surface markers.\nAfter completion of the sphere-forming protocol, collect the spheres in a centrifuge tube and centrifuge at 125 x g for 5 min.\nDiscard the SCM and gently suspend the pellet in trypsin-EDTA.\nIncubate up to 5 min at 37 °C.\nAdd enzyme inactivation media and pipette up and down to ensure a single cell suspension.\nCentrifuge at 125 x g for 5 min, discard the supernatant and gently suspend the cells in PBS.\nAllow the cells to rest in suspension for 30 min to ensure recovery of the membrane conformation.",
    "Using a hemocytometer and the trypan blue exclusion method, count the cells in the suspension.\nAdjust the cell suspension volume to 106 cells/500 µL.\nIncubate with the monoclonal antibodies according to the instructions of the suppliers (concentration, time, temperature, and light/dark) and considering the experiment set represented in Table 2 or the markers given in Table 1.\nImmediately after staining, perform the flow cytometric analysis using a flow cytometer with appropriate detection modules.\nStandardize cytometer setup, following protocols established by the EuroFlow Consortium29.\nSet up primary gates based on the forward and side scatter excluding debris and dead cells. This can be improved by concomitant labelling with annexin V and gating negative cells.\nSet fluorescence gates based on the unstained samples and compensation for a spectral overlap using single stained controls.\n5. Cancer Stem Cell Marker Assessment with Western Blot\nNOTE: In addition to ALDH1 activity, high expression of this marker was consistently associated with breast and gynecological cancer stem cells13,14. The procedure described may be used to evaluate this and other cell markers.\nAfter completion of the sphere-forming protocol, collect the spheres in a centrifuge tube and centrifuge at 125 x g for 5 min.\nPreparation of the whole cell lysates\n\t\nPlace the centrifuge tubes on ice and discard the supernatant without disrupting the pellet.\nWash the pellet with 1 mL of cold PBS and discard by centrifugation.\nSuspend the pellet in a small volume (200-500 µL) of RIPA lysis buffer30 (NaCl 150 mM, Tris-HCl 1.50 mM pH 7.4, Triton-X100 1% vol./vol., sodium deoxycholic acid 0.5% wt./vol., sodium dodecyl sulfate 0.5% wt./vol.) supplemented with cOmplete Mini and dithiothreitol 1 mM.\nMaintaining the samples cold (on ice), submit them to vortex and sonication with a 30% amplitude.",
    "Centrifuge the samples for 15 min at 14,000 x g in a refrigerated centrifuge set to 4 °C.\nTransfer the supernatants to new, properly identified microtubes.\nDetermine the protein concentrations using the BCA or Bradford assays31.\nIf necessary, store the samples at -80 °C until further western blot analysis.\nPerform sample denaturation, electrophoresis, electron transfer and protein detection according to standard western blotting protocols, as described32,33,34.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}