{
  "id": 9600,
  "origin_website": "Jove",
  "title": "The Analysis of Purkinje Cell Dendritic Morphology in Organotypic Slice Cultures",
  "procedures": [
    "1. Setting up Organotypic Cerebellar Slice Cultures\nCerebellar slice cultures are prepared from postnatal day 8 P(8) mouse pups using the static incubation method 10. In our laboratory, we use B6CF1 mice. In some experiments also transgenic mice were used which express EGFP selectively in Purkinje cells. The preparation of slice cultures takes approximately 30 minutes per mouse pup, i.e. 3 hours for a litter of 6 mouse pups. All steps are carried out under sterile conditions in a laminar flow workbench with sterilized surgical instruments.\nThe cerebellum of P8 mouse pups is dissected from the brain in ice-cold preparation medium (MEM (Gibco Catalog No. 11012) with glutamax 1:100, pH 7.3) using a stereomicroscope.\nThe cerebellum is cut into 350 μm thick slices in the sagittal orientation using a McIlwain tissue chopper.\nThe slices are placed on Millipore cell culture inserts (approx.6 slices per insert, Millipore PICM03050) and are incubated in 6-well plates with 0.75 ml per well of incubation medium (48.35 ml MEM, 25 ml Eagle Medium, 25 ml horse serum, 1ml glutamax I, 0.65 ml of a sterile 10% glucose solution, pH 7.3) in a humidified atmosphere with 5% CO2 at 37 °C. All tissue culture reagents were from Gibco, Invitrogen.\nPharmacological treatments are typically started at 3 days in vitro (DIV3) by adding the drug in the desired concentration to the culture medium. Phorbol 12-myristate 13-acetate (PMA) and (RS)-3,5-Dihydroxyphenylglycine (DHPG) were from Tocris, UK. Since many drugs require the use of DMSO or ethanol for preparing a stock solution (e.g. PMA) care should be taken that the total amount of solvent added to the culture medium does not exceed 1% (7.5 μl per well). The drugs are renewed together with the change of the culture medium every 2nd or 3rd day.",
    "2. Fixation and Immunostaining of Organotypic Cerebellar Slice Cultures\nAn important advantage of the cerebellum is that antibodies are available that specifically and brightly stain the principal cerebellar neurons, i.e. Purkinje cells and granule cells. The dendritic morphology of Purkinje cells can be revealed by immunostaining with anti-calbindin D28K.\nFor fixation of the cultures, the culture medium is removed and 3 ml of cold 4% paraformaldehyde in 0.1M phosphate buffer (pH 7.4) are added carefully per well containing the Millicell insert with the cerebellar slices attached to the membrane. Cultures are fixed overnight, then the fixative is removed and the cultures are rinsed with phosphate buffer.\nFor immunostaining the following antibodies are used: rabbit anti-calbindin D-28K (Swant, Bellinzona, Switzerland) at 1:1000 for selectively visualizing Purkinje cells and monoclonal anti-NeuN (Chemicon, Millipore) at 1:500 for selectively visualizing granule cells 12. Rabbit anti-GFP was from Abcam, UK. Fluorescent secondary Alexa antibodies were from Molecular Probes, Invitrogen.\nThe cultures are permeabilized and blocked by adding 3% normal goat serum + 0.3% TritonX100 in 0.1 M phosphate buffer (blocking solution). Anti-calbindin D28K and anti-NeuN are diluted in blocking solution and the cultures are incubated with the blocking solution containing the antibodies overnight at 4 °C under slight agitation. All dilutions are indicated as % (v/v), Triton X100 is taken from a 10% stock solution in order to facilitate pipetting.\nThe cultures are rinsed 3x with 0.1 M phosphate buffer and are then incubated with appropriate second antibodies, e.g. goat anti-rabbit Alexa 568 and goat anti-mouse Alexa 488 diluted 1:500 in 0.1M phosphate buffer + 0.1% TritonX100 for 2 hours at room temperature. The cultures are then rinsed 3x with 0.1M phosphate buffer.",
    "The stained slices are removed from the culture well with a paintbrush and are mounted on Superfrost plus glass slides and coverslipped with an appropriate mounting medium, e.g. Mowiol. The cultures can now be viewed on a regular microscope with epifluorescence equipment or with a confocal microscope.\n3. Viewing of Individual Purkinje Cells in Organotypic Slice Cultures\nAfter immunostaining with Calbindin D28k the complete cytoplasm of Purkinje cells is brightly stained including the dendrites and the axon. Due to the dense alignment of Purkinje cells in the Purkinje cell layer, the dendritic arbors of most Purkinje cells are overlapping making it difficult to study the complete arbor of one individual cell. However, due to cell death of some Purkinje cells during the preparation process, in many cultures some areas are present with a reduced density of Purkinje cells. In such areas it is possible to find Purkinje cells with a complete dendritic arbor which does not overlap with other cells. In these cells, the dendritic arbor can be viewed and analyzed in a quality comparable to a Golgi staining. Because in the cerebellum the Purkinje cells are the only cell type expressing Calbindin D28K the cells are also identified as Purkinje cells.",
    "An alternative method is to use cultures derived from B6;FVB-Tg(Pcp2-EGFP)146.244Yuza/J mice (here called Pcp2-EGFP mice, available from Jackson laboratories) which express EGFP under the Purkinje cell specific L7 promoter 11. In such slice cultures living Purkinje cells can be visualized by expression of EGFP. It is also possible to follow the dendritic morphology of a single cell over time. Alternatively, after fixation, EGFP-expressing Purkinje cells can be immunostained with an anti-GFP antibody. Both methods are suitable for staining dendrites, cell bodies and axons of Purkinje cells in organotypic cultures. Because the L7 promoter in the Pcp2-EGFP mice is not expressed in every Purkinje cell and there are variations in the frequency of expressing Purkinje cells between mice (Kapfhammer, data not shown) slice cultures derived from these mice make it easier to visualize and measure Purkinje cells which have dendritic trees which overlap with other Purkinje cell dendritic trees. Such dendritic trees can be viewed individually when the neighboring Purkinje cells with overlapping dendritic trees do not express GFP (Figure 1A, B).\n4. Measurement of Purkinje Cell Dendritic Tree Size and Branch Points",
    "Dendritic tree size. With the fluorescent labeling of Purkinje cells the size of the dendritic tree of a given cell can easily be measured if the tree is not overlapping with other cells. Because the Calbindin immunostaining labels all Purkinje cells, it can be difficult to identify cells with non-overlapping dendritic trees. In this case the use of the Pcp2-EGFP is recommended to simplify the identification of sufficient Purkinje cells with non-overlapping dendritic trees. Once a Purkinje cell with a non-overlapping dendritic tree is identified, it is viewed with the 20x lens and an image is recorded with a digital camera. This image can then be analyzed with an image analysis program. We use Image Pro plus, which allows outlining the dendritic tree of the cell with a single mouse click using the magic wand tool in measuring mode (Figure 2A). The program then computes the area covered by the dendritic tree and exports it to MS Excel. Statistical analysis of the data is done with GraphPad Prism software (see below).\nNumber of branch points. Due to the highly branched and fine morphology of the Purkinje cell dendritic tree branch points need to be counted manually. The 20x image file of the Purkinje cells is zoomed in such that it covers most of the screen using Adobe Photoshop. Then every branch point is counted and marked with a bright dot (Figure 2B).\n5. Representative Results\nMonitoring the development of the Purkinje cell dendritic tree during the culture period",
    "Organotypic slice cultures derived from Pcp2-EGFP mice which express EGFP specifically in Purkinje cells allow to study the morphology of individual cells during several days in culture. This way the growth and development of the dendritic tree during the culture period can nicely be documented. Living identified Purkinje cells were photographed every 2nd or 3rd day during the culture period with the 10x objective. This low power objective was chosen to avoid and minimize phototoxic damage to the cells due to the illumination with fluorescent light. Figure 3 shows two examples of Purkinje cells photographed in living cultures. The first cell was followed from 2 days in vitro until 7 days in vitro (Figure 3, A-C). It is evident that the dendritic tree of this cell during this time period grows several new branches and expands in size. In the second example, a Purkinje cell was followed from 4 to 11 days in vitro (Figure 3, D-F). The small dendritic tree present at DIV4 expands substantially during this time period. Both examples show that most of the dendritic tree of Purkinje cells present at the end of the culture period did indeed develop in the culture.\nDevelopment of the Purkinje cell dendritic tree is inhibited by PKC or mGluR1 stimulation",
    "Organotypic cerebellar slice cultures were cultured for 11 days. Starting at the 2nd day in vitro, some of the cultures were treated with either PMA (50 nM), a phorbol ester stimulating PKC or DHPG (10 μM), a mGluR1 agonist, until the cultures were fixed. Both compounds have been shown previously to inhibit and limit Purkinje cell dendritic growth 7, 8, 9, 5. In the untreated control slices Purkinje cells developed a typical large and highly branched dendritic tree which was visualized either by anti-Calbindin immunostaining (Figure 4A) or in cultures with EGFP-expressing Purkinje cells, by immunostaining with anti-GFP (Figure 4D). In cultures treated with PMA the morphology of the dendritic tree was profoundly altered. The dendrites appeared thickened and had only few short side branches. Many Purkinje cells, unlike in control cultures, were no longer unipolar, with one primary dendrite emanating from the cell body, but developed two or even more primary dendrites (Figure 4B, E). The territory covered by the dendritic tree was markedly reduced (see below). A similar situation was present in DHPG-treated cultures. The dendritic tree of the Purkinje cells was greatly reduced in size and the branching was markedly reduced (Figure 4C, F). However, there were also some qualitative differences compared to PMA-treated cultures. There was no thickening of the dendritic branches, and the primary dendrites carried many very short secondary dendrites (Figure 4C, F) suggesting that the signaling events going on in PMA and DHPG-treated Purkinje cells may be similar, but not identical.",
    "Quantitative evaluation of Purkinje cell dendritic tree size and branch points For quantitative evaluation, the size of the Purkinje cell dendritic tree and the number of branch points per Purkinje cell is measured as described above. Results from at least three independent experiments are pooled together, and a minimum of 20 cells need to be analyzed. The mean of the area covered by the dendritic trees for the control experiments is determined and set as 100%, and the values for the other experiments are expressed as percent values accordingly. Statistical analysis of the data is done with GraphPad Prism software. Because we do not assume that all values determined are part of a Gaussian distribution, we use statistical tests that do not assume such a distribution of the measured values. For comparing multiple conditions and testing for statistical significance, we use Kruskal-Wallis test followed by an appropriate procedure for post hoc tests for rank-based statistics, as, e.g., implemented in the Dunn's post test in GraphPad Prism. Results are typically presented as bar graphs. An example of such a statistical evaluation is given in Figure 5. Both the analysis of the dendritic tree size (Figure 5A) and the number of branch points per Purkinje cell (Figure 5B) show clear differences between the control condition and DHPG or PMA treatment. Both parameters were different with a statistical significance of p<0.001 according to the Kruskal-Wallis test.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3637/3637fig1.jpg",
    "Figure 1. EGFP-labeled Purkinje cell. In Pcp2-EGFP mice not all Purkinje cells express EGFP. Therefore, dendritic trees of some Purkinje cells can be viewed individually when they express EGFP (EGFP channel in A) and the neighboring Purkinje cells with overlapping dendritic trees do not (negative in EGFP channel shown in A, positive in the anti-Calbindin staining shown in the red channel in B). Scale bar = 50 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3637/3637fig2.jpg\nFigure 2. Measurement of dendritic parameters of Purkinje cells. (A). The size of the dendritic tree can easily be measured by tracing the outline of the Purkinje cell with a single mouse click in the Image analysis software Image Pro plus using the magic wand tool. The magic wand tool is used such that the entire dendritic tree including the cell soma and all dendritic branches are completely encircled by the line. (B). The number of branch points is counted manually in images of Purkinje cells. Every branch point is marked with a yellow dot. Scale bar = 50 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3637/3637fig3.jpg\nFigure 3. Monitoring the development of the Purkinje cell dendritic tree. Identified Purkinje cells were photographed repeatedly to monitor the growth of the dendritic tree. (A-C): Dendritic tree of a Purkinje cell growing and developing from day in vitro (DIV) 2 until DIV7. There is continuous growth and branching of the dendrites during this culture period. (D-F): Dendritic tree of a Purkinje cell growing and developing from DIV4 until DIV11. The dendritic tree expands substantially during this culture period. Scale bar = 50 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3637/3637fig4.jpg",
    "Figure 4. Development of the Purkinje cell dendritic tree is inhibited by PKC or mGluR1 stimulation. (A), (D): Untreated control cells with a well developed dendritic tree. (B), (E): After 9 days of PMA treatment dendrites appear thickened and the dendritic tree is strongly reduced in sized. Cells often lose their polarization and become bipolar (E). (C), (F): After 9 days of DHPG treatment the dendritic tree is greatly reduced in size. Unlike in the PMA treatment, many very fine and short side branches are present on the primary and secondary dendrites. Cells often lose their polarization and become bipolar (F). Purkinje cells were visualized by anti-Calbindin immunostaining in (A - C) and by EGFP-Expression in cultures derived from Pcp2-EGFP mice in (D - F). Scale bar = 50 μm.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3637/3637fig5.jpg\nFigure 5. Quantitative evaluation of Purkinje cell dendritic tree size and branching.  Quantitative measurements show that both dendritic tree size (upper bar graph) and the number of branch points (lower bar graph) are greatly reduced after PMA or DHPG treatment. Differences between control dendritic trees and dendritic trees of Purkinje cells from treated cultures were significant with p<0.001.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}