{
  "id": 11293,
  "origin_website": "Jove",
  "title": "Characterizing Bacterial Volatiles using Secondary Electrospray Ionization Mass Spectrometry (SESI-MS)",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2664/2664fig1.jpg\nFigure 1. Schematic for SESI-MS analysis of bacterial volatiles. The headspace of the bacterial culture is displaced by CO2 (1) into the SESI reaction chamber (2). As the volatiles traverse the SESI reaction chamber they pass through the electrospray cloud and become ionized (3). Once ionized, the volatiles are pulled into the mass spectrometer for analysis (4). Excess carrier gas and unreacted bacterial volatiles are passed through a 0.22 μm filter (5), as an additional measure of protection, and vented to a chemical hood. Inset: The SESI electrospray needle is a silica capillary (40 μm ID) with a sharpened needle tip.\nAs a demonstration of the use of SESI-MS for the characterization of bacterial volatiles, E. coli K12 and P. aeruginosa PAO1 are cultured aerobically for 24 h in 50 mL LB-Lennox at 37 °C and the SESI-MS spectra of the headspace volatiles are collected in 2 minutes. Carbon dioxide (99.99 %) at a flow rate of 2 L/min is used as the carrier gas for volatile delivery to the reaction chamber. The SESI reaction chamber was custom built and fitted to an API-3000 (SCIEX), replacing the original electrospray ion source. The spectra are collected in positive ion mode using 0.1 % formic acid, 5.0% methanol, and 94.9 % water (v/v) as the electrospray solution, delivered at 5 nL/s through a non-conductive silica capillary with a sharpened needle tip (40 μm ID). The applied voltage is 2.5 kV. Analyst 1.4.2 software (Applied Biosystems) is used for data collection with the following parameters: 20 – 500 Da, MCA mode, 40 scans, 3 s/scan, and 2 min total analysis time.\n1. Culturing system\nChoose the appropriate vessel for growing your cultures, considering the growth requirements of the species in your experiment (e.g., aeration, light,",
    "temperature, etc.), as well as the efficient delivery of volatiles to the mass spectrometer. The culture bottles we choose to use are standard 100 mL Pyrex \n media bottles fitted with threaded caps that have at least two luer ports. An inlet line is inserted through one luer port for carrier gas delivery to the \n sample bottle and an outlet line is inserted through another port for VOC delivery to the instrument (Figure 1). Any additional ports are plugged.\nPrior to culturing the samples, pressurize the vessels and submerge in water to check for leaks. Gas leaks are a primary cause of atypical \n results in the form of weak or absent volatile ion signals.\n2. Biological experiment: set-up and safety considerations\nGrow your cultures in the conditions appropriate to your hypothesis. It is recommended that at least two biological replicates, each with two technical replicates, are used for each variable.\nPrepare a blank for every culture condition (medium, antibiotics, etc.) and incubate the blank under the same conditions as your samples.\nEmploy safety precautions that are appropriate for the biological agents you are using, taking into consideration the biosafety level(s) of the species.\nTo prevent contamination of your instrument and the gas transfer lines with viable biological agents, install filters of the appropriate pore size into the carrier gas line. The filters will not interfere with the transfer of volatiles to the SESI reaction chamber, but may slightly impact the efficiency of aerosol transfer.6\nUse secondary containment or a biosafety cabinet when attaching the gas transfer cap to your culture bottle to assure the proper containment in the case of spilling biological agents.\nInitiate and terminate carrier gas flow to your sample bottle in a way that will not build pressure inside the bottle.\n3. Instrument optimization",
    "NOTE: SESI-MS is specifically designed to sample volatiles, so limit the use of fragrant personal care items (e.g., colognes, mouthwash, \nlotions, fabric softener), gum, cigarettes, etc. before using the instrument. Tightly cap all volatile chemicals in the lab, and control air drafts as much as \npossible during testing.\nThe following instrumental parameters, which all affect signal intensity and stability, will need to be optimized for your instrument and experiment.\nElectrospray solution and flow rate: Choose the appropriate electrospray solution for the class of molecules you wish to target, taking into account the operating instrument polarity (positive or negative-ion mode) and molecular character of the target compounds. In this experiment the electrospray solution is 0.1 % formic acid, 5.0 % methanol, 94.9 % water (v/v), which enhances the signal intensity of less polar molecules while providing good signal stability. The solution is delivered at a flow rate of 5 nL/s.\nCarrier gas flow rate: The carrier gas flow rate can affect the electrospray stability and the signal intensity. CO2 (≥ 99.99%) at a flow rate of 2 L/min is used here. \nNeedle shape and position: The needle tip shape and position strongly affect the signal intensity and stability. When installing a new needle, the position of the needle must be optimized to create a balance between low background, high analyte signal intensity, and signal stability. In order to reproduce SESI spectra after a needle change, it is necessary to periodically collect spectra as you adjust the needle position until you are able to match the observed spectrum to your records. The distance from electrospray needle tip to mass spec orifice will be 1 – 5 mm.\nApplied voltage: The voltage that is applied to the system affects the signal ion intensity and the stability of the electrospray Taylor cone.",
    "Additionally, the optimum voltage is dependent upon your electrospray solution and the needle tip shape. \n At the start of your series of experiments, determine the voltage that yields the optimum spectrum and signal stability for your system, and then use this voltage for \n all subsequent experiments. For our system, applied voltages of 2.0 - 5.0 kV provide optimal signal intensity and electrospray stability. For this experiment 2.5 kV is used.\n4. Turning on and tuning the SESI-MS for analysis\nBegin by ensuring that the voltage supply is turned off and that the system is discharged of electricity. Do this by 1) ensuring the indicator lights on the voltage supply are off, 2) ensuring the voltage on the multimeter is zero, and 3) grounding the electrical leads.\nInstall the appropriate electrospray solution for your experiment. \nTurn on the carrier gas and set the flow to the rate appropriate for your experiment.\nApply pressure to the electrospray reservoir to initiate the delivery of the electrospray solution to the reaction chamber.\nTurn on the voltage supply and adjust the voltage to an appropriate value for your experiments.\nNOTE: At this point the metal surfaces of the ionization source are capable of delivering a dangerous shock. Exercise great caution when working around the instrument once the voltage supply has been turned on.\nSet up a tuning method for monitoring the SESI-MS spectrum while making fine-tuned adjustments to the applied voltage. Use the acquisition parameters that you have optimized for your system and your experiment. Clear the Multiple Channel Acquisition (MCA) check box (if applicable) so that every scan produces an independent spectrum, set the acquisition time to 10 – 15 min, and start the acquisition. Spectra of the carrier gas background should now be observed.",
    "Make fine-tuned adjustments to the applied voltage to obtain a stable total ion chromatogram (TIC) and reproducible scans that match the   CO2 scans for your previous experiments. Once the voltage adjustments have been made, continue to collect spectra and a TIC for five minutes to ensure the instrument is stabilized.\nOnce instrumental stability is ensured, set up the acquisition method as appropriate for your samples, adjusting the acquisition time, data range, and MCA selection as needed. Collect a carrier gas background spectrum for your records.\n5. Obtaining a volatile fingerprint of your bacterial culture\nTo collect a blank spectrum, direct the carrier gas flow through the bypass lines, and then attach the blank sample (valves closed) to the gas transfer lines of the instrument.\nOpen the valves to the sample bottle, and close the valves of the bypass lines.\nAllow the system to equilibrate for 30 seconds, during which time the humidity in the reaction chamber is stabilizing. This period of equilibration is essential for obtaining reproducible spectra. To ensure that the system is equilibrated, you may wish to monitor the TIC, which will change during the equilibration period, and stabilize thereafter.\nOnce the system is equilibrated, initiate spectrum collection.\nAfter the spectrum is collected, remove the sample bottle by first opening the carrier gas bypass lines, then closing the sample valves, and lastly removing the sample bottle. Flush the system with the carrier gas for 2 – 4 min, removing the moisture and adsorbed volatiles from the transfer lines, preventing sample-to-sample carryover.\nRepeat steps 5.2 - 5.5 for each bacterial sample, intermittently collecting additional blank spectra to ensure thorough blank subtraction. Incomplete blank subtraction will lead to the appearance of chemical background peaks in your processed spectrum that are common to atmospheric pressure ionization techniques, (e.g., phthalates, silicones, etc.).9",
    "When collecting your spectra, ensure that the ion signals are not exceeding the linear detection limits of your instrument, as determined by the TIC and the maximum intensity of individual peaks. Ions exceeding the upper limitations of your instrument’s detector can generate artifact peaks that are not representative of your sample.\n6. Representative Results\nAs an example of the SESI-MS spectra that can be obtained for bacterial volatiles, the positive ion mode volatile fingerprints for E. coli and P. aeruginosa grown aerobically in LB-Lennox for 24 h at 37 °C are shown (Fig. 2). The E. coli volatile spectrum is dominated by indole at m/z = 118, which gives E. coli cultures their characteristic odor, whereas the spectrum of P. aeruginosa contains a larger variety of protonatable peaks.\nPlease note that the relative intensities of the peaks in the volatile spectrum are dependent upon the instrumental parameters described in Section 3. These parameters must be tightly controlled from experiment to experiment in order to obtain reproducible spectra.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2664/2664fig2.jpg\nFigure 2. Blank-subtracted positive ion mode SESI-MS spectra (20 – 150 m/z) of E. coli K12 and P. aeruginosa PAO1 volatiles after 24 h aerobic growth in LB-Lennox at 37 °C. For more details about the peaks observed in the SESI spectra, please refer to Zhu, et al. 8."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}