{
  "id": 19477,
  "origin_website": "Jove",
  "title": "Generating a Reproducible Model of Mid-Gestational Maternal Immune Activation using Poly(I:C) to Study Susceptibility and Resilience in Offspring",
  "procedures": [
    "All protocols are performed under the approval of the University of California-Davis Institutional Animal Care and Use Committee (IACUC).\n1. Animal preparation\nWhen acquiring animals, keep the following parameters consistent to ensure maximal reproducibility.\n\t\nVendor and vendor location: as previously reported, wild type C57BL/6J mice exhibit different responses to the same dose of poly(I:C) depending on the vendor8. Choose a vendor and mouse strain which show a consistent response. For the experiments here, C57BL/6 mice obtained from Charles River exhibited consistent changes in behavior after exposure to mid-gestational MIA, while those purchased from Taconic show a greater magnitude response, with some differences across treatment groups compared to Charles River mice8.\nStrain: C57BL/6J mice are the most commonly utilized, but BTBR mice and other strains show differential responses to mid-gestational MIA9. Note these differential responses, as these enhance reproducibility of the method and can be a potential variable in contributing to differential outcomes in offspring.\nTo ensure minimal variability, use only virgin females for MIA studies8 and clearly note details in methods.\nAge at shipping and acclimation period: mice shipped before 7 weeks show dysregulated endocrine systems15. Allow animals to acclimate for a minimum of 48 h16,17. Order mice to be shipped at 7 weeks (± 2 days) and inject for BIR at 8 weeks (± 2 days).\nAge at mating: animals' immune systems are dynamic over their lifespan. Take care to minimize variability by keeping age at mating/injection as consistent as possible18,19,20. Mate female mice at 9 weeks (± 2 days). Do not use males over 6 months of age for mating.\n2. Poly(I:C) lot testing and preparation\nPrepare high molecular weight poly(I:C) as described below.",
    "Autoclave 1.5 mL microcentrifuge tubes for storage. Resuspended poly(I:C) can be stored at -20 °C, but repeated freeze thaws can impact potency. Heat water bath to 70 °C.\nUsing sterile technique, add 10 mL of sterile physiological saline (NaCl 0.9%) to lyophilized poly(I:C) using a syringe. Heat in 70 °C water bath for 15 min to allow full annealing. Remove and allow to cool to room temperature.\nIn a sterile hood, add an additional 40 mL of physiological saline to the bottle and invert several times to mix. Remove the top of the poly(I:C) bottle or use a syringe to aliquot into 1.5 mL microcentrifuge tubes. Store at -20 °C.\nPrepare mixed molecular weight poly(I:C) as described below.\n\t\nAutoclave 1.5 mL microcentrifuge tubes for storage. Resuspended poly(I:C) can be stored at -20 °C but repeated freeze thaws can impact potency. Set water bath to 50 °C.\nUsing sterile technique, add 10 mL of sterile 0.9% NaCl to lyophilized poly(I:C) and secure the lid. Heat in 50 °C water bath for 25 min to allow full annealing. Remove and allow to cool to room temperature.\nUsing sterile technique, aliquot into 1.5 mL microcentrifuge tubes and store at -20 °C.\nAdminister poly(I:C) through intraperitoneal (i.p.) injections as described below.\n\t\nWeigh the mouse to determine accurate dosing. Utilizing a 0.5 cc insulin needle, draw up resuspended poly(I:C). Scruff the mouse and flip so the abdomen is exposed.\nUsing the other hand, insert the needle to a depth of approximately 0.5 cm between the anterior two nipples at an angle of about 45°.",
    "Draw up to determine that no blood or urine enters the syringe before injecting. If either occurs, reposition the needle and try again. Inject slowly. If the poly(I:C) bubbles out, the injection was likely subcutaneous. A successful injection placement will result in nothing being drawn up once the needle is inserted, and no leaking once it is removed.\nTest MMW poly(I:C) lot potency as described below8.\n\t\nObtain desired form of poly(I:C). Some manufacturers will allow researchers to place a hold on a full or partial lot while potency is tested so that multiple bottles can be obtained later simultaneously. Typically, these can be stored lyophilized at -20 °C for several years if freeze-thaw is avoided.\nObtain or breed 30 pregnant dams for testing. At E12.5, perform i.p. injections of 20, 30, and 40 mg/kg in a minimum of 10 mice per dose.\nAt 2.5 h post-injection, collect blood via tail bleed. Note that peripheral blood and trunk blood can differ in cytokine levels, so keep the collection method consistent within a study.\nAllow blood to clot overnight at room temperature. After 12-24 h, spin down blood samples at 3,768 x g at 4 °C for 8 min. Collect serum and store at -80 °C until analyzed.\nIsolate serum and measure IL-6 levels via ELISA or Luminex. Keep measurement tools consistent as there is significant variability in the total concentration measured with different modalities and manufacturers. Determine magnitude of IL-6 response needed to induce phenotypes utilizing a pilot cohort.\n3. Baseline immunoreactivity (BIR) testing\nNOTE: Figure 1 shows the schematic of the steps. Use a different molecular weight poly(I:C) for BIR testing as compared to gestational to lower the likelihood of adaptive immune responses to the compound.",
    "Order virgin female mice to be shipped at 7 weeks old. Upon arrival, group and house four to five mice in a cage and keep group housed until mated. Use ear notch or any another identification system.\nInject females intraperitoneally with 5 mg/kg of poly(I:C) 1 week after arrival. At 2.5 h post-injection, when circulating IL-6 is highest6, collect whole blood from injected animals via tail snip.\nAllow blood to clot overnight at room temperature. After 12-24 h, spin down blood samples at 3,768 x g at 4 °C for 8 min.\nCollect a minimum of 32 µL of serum from each sample. Freeze at -80 °C until ready to test for cytokines. To measure IL-6 levels most consistently, utilize a multiplex assay such as Luminex. Keep measurement tools consistent as there is significant variability in the total concentration measured with different modalities and manufacturers.\n\t\nFor Luminex assay protocol, refer to Bruce et al.21.\nUsing relative IL-6 levels, divide animals into low (bottom quartile), medium (middle two quartiles), and high (highest quartile) BIR groups.\n4. Tail bleed method for blood collection\nNOTE: To avoid use of potentially immunomodulatory sedatives, use the tail bleed method of blood collection.\nTo set up, place a soldering stand and restraint cup on a surface on the side of the non-dominant hand. In a 35 mm Petri dish, add 1-2 mL of food-grade, edible oil. Remove the cap from the quick blood stopper and place near the setup.\nPlace a few layers of paper towel on the soldering stand and the first capillary tube in a clip, positioning it near where the mouse's tail tip will be held and kept parallel to the table's surface. Have a razor blade handy.\nTo collect the blood, perform the following steps.",
    "At the required time, remove the mouse from the cage and place under the cup with its tail coming out of the notch at the base. Using a fresh razor blade, clip the very end (1-2 mm) of the tail off and collect the first drop of blood in the capillary tube clipped to the soldering stand.\nDip fingers of dominant hand into the edible oil and use to squeeze from the base of the tail to the tip, guiding the tail tip to the capillary tube to collect resulting drops of blood. Continue until ~200 µL of blood has been collected.\nPut a small end cap on the tapered end of capillary tube before the top cap. If the top cap is put on first, sample will be expelled from the tapered end of the tube. Put tube in protective outer shell.\nAllow to clot overnight at room temperature. Cool a microcentrifuge to 4 °C and spin down blood as stated in step 3.3.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64095/64095fig01.jpg\nFigure 1. The timeline for testing virgin females' baseline immunoreactivity and mating. Order mice to arrive at 7 weeks old and allow to acclimate to facility for 1 week. Inject animals with 5 mg/kg of poly(I:C) and 2.5 h later draw blood. Allow blood to clot overnight, then centrifuge at 3,768 x g, 4 °C for 8 min. Collect serum and assess relative IL-6 levels via ELISA or Multiplex. At 9 weeks old, set up mating pairs. Created using BioRender.com Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64095/64095fig01large.jpg]\n5. Weight based method for mating and gestational E12.5 injection",
    "NOTE: Figure 2 shows the schematic of the steps. Two methods can be used to set up mating pairs and determine the E12.5 time point. The first, timed-mating, is described elsewhere22. Weight-based calculations can also be used to assess for an E12.5 pregnancy23. The benefit of this approach is that it allows time-locking of the dam's age at mating, decreasing variability in the immune response. This procedure is used here.\nPlace males in clean cages and allow them to acclimate for a minimum of 2 h. This decreases the likelihood of female aggression as males will already form a dominant scent in the cage.\nSet up single male, single female breeding pairs by adding the female to the male's cage. Before placing her in the cage, weigh her and record the weight. Add a small handful of sunflower seeds to each cage to increase mating efficiency.\nTo determine weight gain range, perform the following steps.\n\t\nObtain a test group of females and set up mating pairs, recording weight at time of mating.\nWhen females begin to appear visibly pregnant, weigh them and divide in subsets of 8.5 g, 9.5 g, 10.5 g, and 11.5 g of weight gained. Fetuses at E12.5 have just begun to develop distinct digits in their paws. Use fetal morphology to determine average weight gain to reach E12.5.\nAt 12 days after mating, weigh females and determine weight gain. In a test facility, females consistently gain 9.5-10.5 g from time of mating to E12.5. Inject via i.p. the dose of solubilized poly(I:C) determined in step 2.3.2 when the female's weight gain falls within the predetermined range.\nObserve the response to MIA in dams using the following parameters.",
    "Sickness behavior: Collect subjective scores on a scale of 1-3 for how active dams become in response to being handled, where 1 is little or no movement in response to being handled and 3 is a normal response to capture and restraint. Animals with greater immune responses will show less resistance to handling8.\nFebrile response: Using an IR thermometer, collect pre-injection and 2.5 h post-injection temperatures. Animals with greater magnitude immune responses often display hypothermia in response to greater immune activity8.\nWeight change: Weigh animals at 24 h post-injection. Animals with greater magnitude immune responses generally lose more weight8.\nMeasure gestational IL-6 levels as follow8.\n\t\t\nAt 2.5 h post-injection, collect blood with the preferred method. Allow blood to clot overnight at room temperature. After 12-24 h, spin down blood samples at 3,768 x g at 4 °C for 8 min.\nCollect serum and store at -80 °C until analyzed. Isolate serum and measure IL-6 levels via ELISA or Luminex. Keep measurement tools consistent as there is significant variability in the total concentration measured with different modalities and manufacturers.\nSingly house the dam after injection with appropriate enrichment like nestlets and enrichment devices. Keep all enrichment consistent as alterations in enrichment can have significant impacts on rodent behavior24,25,26,27,28,29.\nGestation time for C57 mice ranges from 18.5-20.5 days. Perform litter checks to determine if animals were born within this range to ensure injection was performed at the correct time point. When checking for litters, disturb the cage as little as possible. Stress immediately after the litter is born can increase the risk of cannibalization.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64095/64095fig02.jpg",
    "Figure 2. MIA induction. MIA induction requires assessment of pregnancy, i.p. injection of poly(I:C), and litter checks to ensure correct timing of maternal inflammation. After assessing gestational day either via timed mating or the weight-gain method, deliver an i.p. injection of poly(I:C) at E12.5. Collect a blood sample at 2.5 h after injection to confirm immune activation and determine level of IL-6 activation. Litters will be born at approximately E18.5-E20.5. Created using BioRender.com Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64095/64095fig02large.jpg]\n6. Investigation of alterations in behavior in adult MIA and control offspring (optional)\nStarting at P60 and before conducting behavioral tests, acclimate animals to human contact with gentle handling for 1 min a day for 3 consecutive days. Make sure that cage change days do not occur on the same day that behavioral tests are performed.\nAlways allow mice to acclimate to the testing room for 30-60 min before starting behavioral tests. Use dimly lit (15-20 lux) rooms to minimize anxiety.\nFor repetitive grooming, place mice alone in clean, bedding-free cages with lids. Using a camera, record the mice in these cages for 20 min. The first 10 min function as an acclimation period, the latter 10 min are the test period.\nUsing saved videos and a stopwatch, score cumulative grooming time for each mouse during the 10 min test period. Other behaviors that can be scored from these videos include rearing (standing on hind legs), freezing, and jumping8.\nUse other common tests for the MIA model such as prepulse inhibition (PPI) 14,30,31,32, open field12,33,34, 3-chamber social approach13,35,36, novel object recognition37, y-maze30, elevated plus maze33, and context/cued fear conditioning38.\nPostnatal immunoblotting8 (optional)\n\t\nAt P0, decapitate rapidly and dissect fetal brain tissue in HBSS, freeze in liquid nitrogen, and store at −80 °C.",
    "Disrupt samples using a probe sonicator with an amplitude of 20% for 5 s in 2x Laemmli buffer, then denature at 85 °C for 5 min. Centrifuge lysate at 16,000 x g for 10 min at room temperature. Collect supernatant and store at -80 °C.\nMeasure total protein content using a commercial BCA protein assay kit, following manufacturer's instruction, and use bovine serum albumin as the calibration standard.\nAdd dithiothreitol as a reducing agent to the samples as a final concentration of 100 mM. Heat to 85 °C for 2 min before loading onto a gel.\nRun 5 µg/lane of protein under reducing conditions on 7.5% TGS gels and transfer electrophoretically onto PVDF membranes. Block membranes with blocking buffer and incubate with chosen antibodies.\nWash three times with TBS + 0.05% Tween 20 and incubate membranes for 45 min with fluorescent-tagged secondary antibodies.\nWash an additional four times in TBS/Tween 20 and image results. Standardize results using β-tubulin, detected using anti-β-tubulin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}