{
  "id": 10320,
  "origin_website": "Jove",
  "title": "Patient-Specific Polyvinyl Alcohol Phantom Fabrication with Ultrasound and X-Ray Contrast for Brain Tumor Surgery Planning",
  "procedures": [
    "This study was conducted according to the principles expressed in the Declaration of Helsinki and was approved by the NHS Health Research Authority and Research Ethics Committee (18/LO/0266). Informed consent was obtained, and all imaging data were completely anonymized before analysis.\n1. Data\nObtain pre-operative contrast-enhanced T1-weighted Magnetic Resonance Imaging (MRI) and volumetric computed tomography (CT) data.\n\t\nIf acquired in Digital Imaging and Communications in Medicine (DICOM) format, convert to Neuroimaging Informatics Technology Initiative26 (NiFTI) format for processing and analysis.\nObtain intraoperative ultrasound data.\n2. Segmentation\nInstall software to segment the patient data with.\nSkull segmentation\n\tNOTE: The steps involved in segmenting the skull broadly follow those outlined by Cramer and Quigley27 on https://radmodules.com/[href=https://radmodules.com/], but are adapted to create an appropriately-sized craniotomy.\n\t\nLoad the patient’s volumetric CT scan in segmentation software, open the Segment Editor module and create new segmentation named ‘Skull’.\nUse the ‘Threshold’ function to highlight the skull.\nRemove any unwanted segmentations (e.g., skin calcifications, mandible, C1/2, styloid process, the CT patient frame, and any annotations embedded within the image). Use the ‘Scissors’ function to remove parts when viewing the model in 3D and make use of the ‘Islands’ function after manually disconnecting any unwanted structures using the ‘Erase’ function.\nManually correct any gaps in the segmentation that were missed during thresholding using the ‘Paint’ and ‘Draw’ functions (e.g., lamina papyracea, cortical edge of the mastoid bone and ethmoid bone).\nUse the ‘Paint’ and ‘Draw’ functions to fill in the foramen magnum and create a 5 mm protruding spike upon which the lower part of phantom model can be secured.\n\t\tNOTE: The location of the spike is best determined on the coronal and sagittal image planes.",
    "Apply the ‘Smoothing’ function. Use a median smoothing setting of 1.0 mm (3 × 3 × 1 pixels) to minimize the amount of detail lost.\n\t\tNOTE: If the phantom model must include a complete intact skull (e.g., to facilitate surgical simulation of creating an appropriately located craniotomy), move to step 2.2.15; however, if a craniotomy is required in the model, complete steps 2.2.7 to 2.2.14.\nClick ‘Add’ to add a new segmentation and name it ‘Skull Craniotomy’.\nIn the ‘Segmentations’ module, copy the ‘Skull’ segmentation across to ‘Skull Craniotomy’ using the ‘Copy/Move Segments’ tab.\n\t\tNOTE: Both the ‘Skull’ and ‘Skull Craniotomy’ segmentations are needed in order to be able to perform the functions described in steps 2.2.9 to 2.2.13\nUse the ‘Scissors’ function to remove an appropriately-sized craniotomy in ‘Skull Craniotomy’.\n\t\tNOTE: Creating the craniotomy this way will, also, remove an addition portion of skull on the opposite side hence the need for steps 2.2.11 to 2.2.14.\nClick ‘Add’ and add a new segmentation; name it ‘Craniotomy Only’.\nIn ‘Craniotomy Only’ select the segmentation ‘Skull Craniotomy’ and use the ‘Logical Operator’ function to subtract ‘Skull Craniotomy’ from ‘Skull’.\nUse the ‘Scissors’ function to erase everything except the desired craniotomy on the correct side of the tumor, saving ‘Craniotomy Only’.\nIn ‘Skull Craniotomy’ use the ‘Logical Operator’ function to subtract ‘Craniotomy only’ from ‘Skull’ and save.\nOpen ‘Segmentations’ module and export the ‘Skull Craniotomy’ as a stereolithography (STL) file.\nOpen 3D modeling software and import the STL file ‘Skull Craniotomy’.\n\t\tNOTE: If the model appears in striped pink complete the ‘Flip Normals’ function by selecting the complete model (Select | Double click) and then ‘Edit | Flip Normals’. The model will now turn grey and can be edited. Ensure ‘View Objects Browser’ is turned on.",
    "Reduce the number of triangles to improve the computational time.\nSelect the complete model (Select | Double click turns the model orange) then ‘Edit | Reduce’. The default ‘Reduce’ function is set at 50% so repeat until the desired reduction is achieved. Aim for a total number of triangles < 500,000.\nApply ‘Smoothing’ function ensuring the ‘Shape Preserving’ box remains ticked. Select the complete model then ‘Deform | Smooth’.\nClick ‘Analysis’ then ‘Inspector’ and use this function to detect any small defects in the model and click auto-repair (suggest ‘Flat-fill’ selection).\nCut 'Skull' to create a top and bottom using the ‘Edit/Plane’ cut function. Select ‘Keep Both Slices’ and ‘Remeshed’ fill type. Change skull to transparent with ‘Shaders’ function to provide a better internal view of the skull and adjust the plane so that it is parallel to the skull base.\nSeparate shells by selecting ‘Edit | Separate shells’ and rename ‘Skull_Top’ and ‘Skull_Bottom’ within the objects browser.\n\t\tNOTE: Do not move their positions. Click the eye icon to remove one or the other from view.\nClick ‘Meshmix’ then select ‘Cylinder’ to create a dowel and edit size to 4 mm × 10 mm × 4 mm (‘Edit | Transform’). Hide ‘Skull_Bottom’ by clicking the eye icon to remove from view.\nSelect ‘Edit | Align’ planes. An additional transparent cylinder will appear. In the ‘Align’ window, choose ‘Surface point’ (left click end transparent cylinder) for the ‘Source’ and ‘Surface point’ (Shift + left click undersurface of ‘Skull_Top’) for the ‘Destination.’\nUsing the ‘Edit | Transform’ function move dowel into skull using the green arrow and adjust position with blue and red arrows. Rename ‘Dowel_Anterior’.\nIn the object browser make 3 copies and rename ‘Dowel_Posterior’, ‘Dowel_Left’ and ‘Dowel_Right’.\nMove each dowel to the desired location using the ‘Edit | Transform’ function.",
    "NOTE: Do not move or change the position of the dowel in the green plane.\nCreate copies of each but keep all copies in the same location and create an additional dowel and resize to 3 mm × 10 mm × 3 mm. Rename ‘Dowel’.\nCreate holes for Dowels in the skull using the ‘Boolean Difference’ function. Select ‘Skull_Top’ first and then select a dowel in the object browser. In the ‘Boolean Difference’ tab ensure ‘Auto-reduce’ is switch off. Repeat for each dowel in turn.\nHide ‘Skull_Top’ and view ‘Skull_Bottom’ repeating the above ‘Boolean Difference’ function for each dowel in turn.\nExport ‘Skull_Top’, ‘Skull_Bottom’ and ‘Dowel’ as separate binary STL files.\nBrain tissue segmentation\n\t\nUpload the contrast enhanced T1 MRI of the brain to http://niftyweb.cs.ucl.ac.uk/program.php?p=GIF[href=http://niftyweb.cs.ucl.ac.uk/program.php?p=GIF] and download its output. This is an open-source parcellation tool for T1-weighted images that utilizes a Geodesic Information Flow (GIF) algorithm28 to perform brain extraction and tissue segmentation.\nOpen segmentation software and load the contrast enhanced T1 MRI and GIF parcellation output file.\nOpen the ‘Segment Editor’ module and create a new segmentation.\nSelect the appropriate labels and combine them to form a single segmentation. For example, cerebral and diencephalon label maps can be combined to create one model, referred to as ‘Brain’ and midbrain, brainstem, cerebellum and vermian structures can be combined to create a second model referred to as ‘Cerebellum’.\nUse the ‘Smoothing’ function (suggested median 2.00 mm, 5 × 5 × 3 pixels).\nUse the ‘Scissors’ function to remove any unwanted or erroneous segmentations.\nSave ‘Brain’ and ‘Cerebellum’ segmentations.\nOpen ‘Segmentations’ module and export ‘Brain’ and ‘Cerebellum’ as STL files.\nTumor segmentation\n\t\nOpen segmentation software and load the contrast enhanced T1 MRI.\nOpen the ‘Segment Editor’ module and create new segmentation named ‘Tumor’.\nUse the ‘Threshold’ function to highlight the tumor.",
    "Correct the segmentation using the ‘Paint’, ‘Draw’ and ‘Erase’ functions.\nApply the ‘Smoothing’ function (suggested median 2.00 mm 5 x 5 x 3 pixels).\nCreate a new segmentation named ‘Cerebellum_Tumor’.\nCombine the ‘Cerebellum’ model and ‘Tumor’ using the ‘Logical Operators | Add’ function.\nSave ‘Tumor’ and ‘Cerebellum_Tumor’ segmentations.\nOpen ‘Segmentations’ module and export ‘Tumor’ and ‘Cerebellum_Tumor’ as STL files.\n\t\tNOTE: At the end of the segmentation process, the following files are available: ‘Skull_Top’, ‘Skull_Bottom’, ‘Dowel’, ‘Brain’, ‘Cerebellum’, ‘Tumor’, ‘Cerebellum_Tumor’.\n3. 3D Printing of Brain/Tumor Molds and Skull\nCreate the brain and tumor molds\n\t\nSplit the ‘Brain’ segmentation into two hemispheres, using the ‘Plane cut’ tool in 3D modeling software.\nSave each hemisphere as a separate STL file ‘Brain right’ and ‘Brain left’.\nImport the STL file ‘Tumor’ into computer-aided design (CAD) software.\nClick the 'mesh' tab and then use the ‘Reduce’ function to reduce the size of the model so that it can be handled by the program – the aim is to reduce the size as much as possible, whilst still retaining all the detail necessary.\nClick the 'solid' tab and use the ‘Mesh to BRep’ tool to convert the imported mesh to a body that can be manipulated. If this action cannot be completed, the mesh was not reduced enough in step 3.1.3.\nClick ‘Create’ then ‘Box’ and draw a box around the tumor. Select to create this as a ‘New Body’ and rotate the view to ensure the box completely encloses the tumor on all sides.\nIn the modify tab, use the ‘Combine’ tool to cut the tumor (the ‘Tool Body’) from the box (the ‘Target Body’). This will then leave a box with a hollow shape of the tumor inside it.",
    "Check that the hollowed-out box is present. Cut this box into an appropriate number of pieces so that once the mold is filled, it can be prized apart without damaging the phantom inside. For the tumor here, it is enough to split the box in two, but for the other parts of the phantom, more pieces are needed.\nCreate planes through the box in the places that the mold needs to be cut. Click ‘Construct’ then ‘Midplane’ to create a plane through the center of the box. Right click on the created plane and choose ‘Offset Plane’ to position the plane more precisely.\nUse the ‘Split Body’ function in the ‘Modify’ tab to split the mold along the planes created.\nMove the individual pieces of the mold, by right clicking and selecting ‘Move/Copy’, so that all the pieces are facing outwards.\nAdd rivets to the faces of each piece of the mold (so it can fit together securely), by clicking ‘Create sketch’ then ‘Centre diameter circle’ and on each face, drawing small circles. Right click then ‘Extrude’ these circles outwards a few millimeters on one face and extrude them inwards on the corresponding face.\n\t\tNOTE: The circles that are extruded inwards need to be slightly bigger - approximately 1.5 mm - than those that are extruded outwards, so that they will fit together snugly.\nSave each piece of the mold as a separate STL file.\nRepeat steps 3.1.4 – 3.1.14 for ‘Brain left’, ‘Brain right’ and ‘Cerebellum tumor’.\n\t\tNOTE: Using the file ‘Cerebellum tumor’ rather than just ‘Cerebellum’ to create the mold means that the mold will have a space in it for the tumor to be inserted during construction.\nPrint the 3D molds\n\t\nInstall or open 3D printing software.",
    "Open the STL file for each piece of the mold in the printing software and rotate it so that it lies flat against the build plate. It is possible to add multiple mold pieces to the build plate and to print these simultaneously.\nChoose a large layer height (around 0.2 mm) and low infill value (around 20%) for faster printing. Print the molds using a rigid material such as Polylactic acid (PLA). If the molds are positioned appropriately, support material is not necessary.\nPrint the Skull\n\t\nOpen the ‘Skull Top’ file in the printing software and choose a large layer height (around 0.2 mm) and low infill value (around 20%).\nPrint the skull model in PLA but in contrast to step 3.2.3, support material will be required, so select to ‘Add support’ in the software. PVA is used as the support material as it can later be dissolved away with water.\nRepeat steps 3.3.1 and 3.3.2 for ‘Skull Bottom’.\nOnce the top and bottom of the skull have been printed, submerge them in water overnight to dissolve away the PVA support material.\n\t\tNOTE: The support material will dissolve away much faster if warm water is used, but if the water is too warm, it will deform the printed PLA. Therefore, it is preferable to use cool water and leave the print submerged overnight.\n4. Preparation of PVA-c\nMeasure 200 g of PVA powder and set to the side.\nHeat 1800 g of deionized water to 90 °C and add to a 2L conical flask.\n\tNOTE: The water needs to be almost boiling so the PVA powder will dissolve readily, but if the water reaches 100 °C, some will be lost to evaporation, which is to be avoided.\nSuspend the conical flask in a temperature-controlled water bath set at 90 °C.",
    "Position an electronic stirrer in the flask, ensuring it does not touch the bottom or sides, and set the speed to 1500 rpm.\n\tNOTE: Check that the water is stirring evenly and there are not stagnant points at the sides or bottom.\nGradually add the PVA powder to the conical flask, over around 30 min, then leave it to stir for around another 90 min. The resulting gel is the tissue-mimicking material PVA-c.\nRemove conical flask from the water bath and pour the contents into a beaker. Cover the top with cling film to prevent the formation of a skin on top of the PVA-c. Leave the PVA-c to cool to room temperature (around 20 °C). Once cooled, the PVA-c will be transparent. Tiny white crystals may be seen in the PVA-c, but any bubbles appearing on the surface must be gently scraped off.\nAdd 0.5 w/w% potassium sorbate to the PVA-c as a preservative, and manually stir well.\nThe PVA-c can be left at room temperature if covered in cling film for a few days before it is poured into molds.\n5. Phantom Assembly\nMeasure out enough PVA-c to fill the tumor mold into a beaker.\nTo the PVA-c for the tumor, add 1 w/w% glass microspheres for ultrasound contrast and 5 w/w% Barium Sulfate for X-ray contrast, and stir by hand.\n\tNOTE: It may be necessary to measure out excess PVA-c for the tumor so that these percentages are a measurable amount.\nSonicate the beaker to ensure homogenous mixing of the additives.\nLeave to cool and allow any bubbles formed to escape, around 10 min, then scrape any bubbles from the surface.",
    "NOTE: Do not leave for extended period once the glass spheres have been added, no longer than around 10 min, before pouring the PVA-c into a mold, as the glass spheres will settle to the bottom of the beaker. Once the phantom has been frozen, this will no longer be a concern, and the final phantom can be used at room temperature.\nSecure the tumor mold together (tape can be used to cover the joins in the mold) and pour in the PVA-c through the hole in the top of the mold. Leave for a few minutes to allow any bubbles formed in the pouring process to escape through the hole, then place straight into the freezer.\nPerform two freeze-thaw cycles on the tumor; each cycle here consists of 6 h of freezing at -20 °C and 6 h of thawing at room temperature. Then, carefully remove from mold.\nPlace the tumor into the corresponding space for it in the cerebellum mold, then construct the rest of the cerebellum mold and secure it together.\nTo the remaining PVA-c add 0.05 w/w% glass microspheres, then repeat steps 5.1.3 and 5.1.4.\nPour the PVA-c into the cerebellum mold, allowing it to surround the tumor that has been placed inside. Additionally, pour the mixture into the molds for each brain hemisphere.\nPerform two freeze-thaw cycles on each brain hemisphere and the cerebellum; each cycle here consists of 24 h of freezing at -20 °C and 24 h of thawing at room temperature.\n\tNOTE: Cycles with 12 h freezing followed by 12 h thawing also effective, to allow the phantom to be created in less time. 24 h was chosen for ease of application, to avoid returning to the lab every 12 h.",
    "Once the phantoms have thawed for the second time, carefully remove them from the molds and place into the printed skull.\n\tNOTE: When not in use, the completed PVA-c phantoms should be stored in an airtight container in the fridge, and can be kept for a few weeks in this way\nFor completion, place the ‘Cerebellum tumor’ phantom on the spike at the base of the ‘Skull Bottom’ model. The models of two brain hemispheres (‘Brain left’ and ‘Brain right’) are placed on top and slot into the uppermost part of the ‘Cerebellum tumor’.\nPlace the four dowels in each space on the ‘Skull Bottom’ model and place ‘Skull Top’ model on top. If required, the model may then be maneuvered into the desired position to simulate intraoperative use in surgery.\n6. Phantom Imaging\nUltrasound Imaging\n\t\nApply ultrasound gel to the imaging probe.\n\t\tNOTE: Gel is not used intraoperatively but may be used in simulation and does not significantly change the clinical workflow or the quality of the acquired images.\nImage the brain and tumor through the craniotomy, with a clinical scanner and burr hole probe.\nCT Imaging\n\t\nImage the whole phantom in a CT scanner."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}