{
  "id": 5434,
  "origin_website": "Bio",
  "title": "Determination of Adeno-associated Virus Rep DNA Binding Using Fluorescence Anisotropy",
  "procedures": [
    "Preparation of fluorescein labeled AAVS1 DNAFluorescent labeled DNA can be purified by HPLC or using preparative acrylamide gel electrophoresis (PAGE) directly by the synthesis facility or can be purified by anion-exchange chromatography as described next. DNA is dissolved in 500 μl of Q1 buffer and injected into a MonoQ anion-exchange column. DNA was purified using a linear gradient from buffer Q1 (100 mM NaCl) to 100% Q2 buffer (1 M NaCl). Fractions are desalted using a 5 ml GE HiTrap desalting column pre-equilibrated with water. DNA elutes in the void volume. Collected DNA fractions are placed in a 15 ml conical tube, frozen and placed in a Labcono Freezone 2.5 lyophilizer overnight. To allow drying of the sample, the lid of the 15 ml conical tube should be pierced with a needle 4-5 times. The DNA should be fibrous and dry by the next day.After lyophilization, resuspend the DNA in 100 μl of TES buffer. Measure the DNA concentrations using a Thermo Scientific NanoDrop ND-2000c spectrophotometer using the calculated extinction coefficients of the DNA oligonucleotides at a wavelength of 260 nm.To prepare the double-stranded DNA, combine the two DNA strands in a ratio where the non-labeled strand is in 1.1 molar excess with respect to the fluorescein-labeled strand. Place the DNA strands in a black 1.5 ml microcentrifuge tube. Using a Denville IncuBlock heating block, heat the DNA at 99 °C for 3 min. Then, turn off the heating block and leave the DNA cooling to room temperature.The final DNA concentration is calculated using the number of moles of the labeled-DNA strand and the final volume after mixing the two strands.DNA binding studies with Rep68Rep68 concentration is determined by absorbance at 280 nm using the extinction coefficient calculated from the Rep68 amino acid sequence using EXPASY Protparam site (http://web.expasy.org/protparam/[href=http://web.expasy.org/protparam/]).",
    "Prepare different concentrations of Rep68 in binding buffer and mix with DNA allowing the binding reaction to reach equilibrium at 20 °C for 20-30 min. For other proteins, a preliminary experiment needs to be performed to obtain a rough estimate of the concentrations to be used. Titrations are carried out using a final 5 nM DNA concentration in binding buffer. A typical binding experiment is performed as follows:  It is recommended that the PC-1 fluorimeter is turned on the night before the experiment to stabilize the instrument (Figure 1). Start the Vinci software on the computer. Access instrument control and set the excitation and emission filters to 492 nm and 528 nm, respectively.Turn-on the lamp of the PC1 fluorimeter and let it warm up for at least 1 h. Calculate the amount of Rep68 stock solution needed to achieve the following final concentrations in the binding reactions: 0, 10, 25, 50, 75, 100, 150, 200, 300, 400 and 500 nM.Generally, three replicates are done for each concentration.Mix the different Rep68 concentrations with 5 nM DNA in a final volume of 300 μl. Incubate samples for 20-30 min away from light.Measure the anisotropy value of each concentration point using the ‘Single point Polarization’ function in the Vinci software and record 10 measurements per concentration. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170316/20170316103340_4331.jpgFigure 1. PC1 fluorimeter from ISS"
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}