{
  "id": 11255,
  "origin_website": "Jove",
  "title": "Adhesion Frequency Assay for In Situ Kinetics Analysis of Cross-Junctional Molecular Interactions at the Cell-Cell Interface",
  "procedures": [
    "1. RBCs isolation from the whole blood\nPrepare EAS-45 solutions. Weigh up all ingredients from Table I and dissolve in 100-200ml of DI water. Add water to make 1000ml solution and adjust pH to 8.0. Filter and aliquot by 50ml. Freeze at -20°C for storage.\nNote: Step 1.2 should be performed by a trained medical professional such as a nurse, with an Institutional Review Board approved protocol.\nDraw 3-5ml of blood from the median cubital vein into a 10ml tube containing EDTA and gently mix the blood with EDTA immediately and thoroughly to avoid clotting.\nProcess blood sample as soon as possible. All the following steps except centrifugation should be done under the hood to keep the preparation sterile. Transfer the blood to a 50ml centrifuge tube, add 10ml of cold and sterile Histopaque 1077 and centrifuge for 5min @ 1000rpm, 4°C. Repeat twice.\nAdd 10ml cold and sterile PBS, centrifuge for 5min @ 1000rpm, 4°C. Remove the supernatant. Repeat 4 times (Total of 5 times).\nWash with sterile EAS-45 (5min @ 1000rpm, 4°C) twice. During last washing move RBCs into a new sterile 15ml tube.\nResuspend RBCs in10ml EAS-45.\n2. RBCs biotinylation\nTake the tube with RBCs from step 1. Remove all supernatant after centrifuging for 5min @ 1000rpm, 4°C. Put 10μl of RBCs pellet to each of several vials and add corresponding amount of PBS to each vial (see Table II for example of preparation of six different RBCs biotinylation concentrations).\nMake fresh Biotin-X-NHS/DMF 1:10, 1:100 dilutions according to Table II.\nAdd 10μl of 0.1M borate buffer to each vial.\nAdd calculated amount of biotin solution to each vial (see Table II as example) and vortex immediately.\nPlace each RBC vial inside a 50ml conical tube and incubate on rotator for 30min at room temperature.",
    "Wash each vial 3 times with 800μl of EAS-45 for 2min @ 2000rpm.\nAdd 100μl of EAS-45 to each vial and store at 4°C. In each 1μl of the final solution now should be ˜1mln of RBCs.\n3. Functionalizing the biotin-linked ligands* on RBCs\nPrepare 2mg/ml streptavidin solution according to manufacturer's instructions. Aliqouted solution may be stored at -20°C.\nMix an equal amount of RBCs from step 2.7 (10μl) with streptavidin solution, vortex immediately and incubate on rotator for 30min at 4°C.\nWash 3 times with 500μl of EAS-45 for 2min @ 2000rpm. Add 15μl EAS-45/ 1% BSA for storage.\nMix equal amount of RBCs from step 3.3 (10μl) with 20μg/ml ligand solution, vortex immediately and incubate on rotator for 30min at room temperature.\nWash two times with 500μl of EAS-45/ 1% BSA for 2min @ 2000rpm. Add 15μl of EAS-45/1% BSA for storage.\n*If your protein has no biotin link you can use one of the commercially available kits for protein biotinylation (for example, Thermo Scientific # 21955 EZ-Link Micro NHS-PEG4-Biotinylation Kit) or use biotinylated capturing antibodies as an intermediate step as shown in the video.\n4. Quantification of receptor and ligand densities\nIncubate ligand-coated RBCs from step 3 and, in a different vial, receptor-bearing cells with saturating concentrations of respective mAbs for 30min at room temperature. Incubate in separate vials cells with irrelevant isotype-matched antibodies for control. If the primary antibodies are not fluorescently labeled, incubate with fluorescently-conjugated secondary antibodies according to manufacturer's instructions.\nAnalyze samples prepared in step 4.1 by flow cytometery with corresponding fluorescent calibration beads. Calculate the densities as shown in Fig. 1.\n5. Preparation for micropipette and cell chamber\nPull micropipettes from capillary tubes using PN-30 Narishige' Magnetic Glass Microelectrode Horizontal Puller or Sutter Instruments Micropipette Puller.",
    "Use micromanipulator with microforge to adjust the tip of the pulled micropipette to a desired size (usually the required diameter ranges from 1-5μm depending on the size of the cells to be used in the study).\nPrepare the cell chamber by cutting Microscope Cover Glass to the desired size. Seal the chamber using Mineral Oil from both sides to avoid medium evaporation to change the osmolarity during the experiment.\nAdd the receptor- and ligand-bearing cells to the chamber.\n6. Micropipette adhesion frequency assay\nAspirate the interacting cells by respective pipettes and use computer-programmed piezoelectric translator to drive the RBC in and out of contact with the other cell with controlled contact area and time. Detect adhesion events by observing RBC elongation upon cell separation.\nRepeat the contact-retraction cycle 50-100 times for a given contact time. Record the observed adhesion events by adding \"1\" for adhesion or \"0\" for no adhesion in a column of Excel spreadsheet. You may use a recording device, e.g., digital media or videotape, for the microscopic images.\nRecord the adhesion frequency versus contact time curve using at least three different cell pairs for each contact time to obtain a mean and SEM.\nRecord the nonspecific binding curve for control by using RBCs coated with irrelevant ligands (e.g. BSA) and/or blocking the ligands or receptors using their specific functional blockade mAbs. Specific adhesion frequency at each contact time point can be calculated by removal of the nonspecific adhesion frequency1.\n7. Data analysis\nFit the specific adhesion frequency Pa versus contact time t data by a probabilistic model (Equation 1) that describes a second-order forward and first-order reverse, single-step interaction between a single species of receptors and a single species of ligands1:\nimgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519eq1.jpg",
    "where Ka is the 2D effective binding affinity, koff is the off-rate, mr and ml are the respective receptor and ligand densities measured in step 4, and Ac is the contact area. The curve-fit has two parameters, AcKa and koff, as Ac and Ka are lumped together and called collectively as effective 2D affinity. Its product with the off-rate is the effective 2D on-rate: Ackon = AcKa x koff.\n The specific adhesion frequency Pa is calculated by subtraction of the nonspecific adhesion fraction (Pnonspecific) from the total measured adhesion (Pmeasured)1,21:\nimgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519eq2.jpg\n8. Representative Results:\nimgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519fig1.jpg",
    "Figure 1 Determination of integrin αLβ2 site density on neutrophils. Neutrophils were first incubated with 1μg/ml of E-selectin-Ig for 10min to match the experimental condition used in Figures 3,4 or without E-selectin-Ig, and then with saturating concentrations (10μg/ml) of PE-conjugated anti-human CD11a mAb (Clone HI111, see Table of specific reagents and equipment) or irrelevant mouse IgG1 for control, washed, and analyzed immediately. Samples were read on BD LSR flow cytometer with standard QuantiBRITE PE calibration beads. Panel A shows fluorescence histograms of calibration beads (pink) together with those of E-selectin-Ig treated (blue color) or untreated cells (green color). Specific CD11a mAb staining is shown in solid curves and irrelevant isotype-matched control antibody staining is shown in dotted curves. Cells treated with E-selectin-Ig (presence in all washing steps and in FACS buffer) did not affect the CD11a density as seen from the comparison with untreated cells. Panel B shows the process of density quantification. Log10 was calculated for the mean fluorescent intensity (FI) of each peak value of four calibration bead histograms from Panel A (pink circles) and for the lot-specific PE molecules per bead (from the manufacturer). A linear regression of Log10 PE molecules per bead against Log10 fluorescence was plotted. For E-selectin treated cells the Log10 FI (y) values equal 3.99 (blue solid circle) and 2.23 (blue open circle) for specific mAb and control antibody, respectivly. We solved the linear equation for x (values are plotted as green and blue circles on Panel B). x = Log10 PE/cell and, as PE:mAb ratio was 1:1, the total number of αLβ2 on neutrophils was calculated as 9587. Surface density was calculated to be 43 molecules/μm2, using 8.4μm as the neutrophil diameter22. Density of ICAM-1 was similarly measured by flow cytometery using PE-anti-human CD54 mAb, which equaled 65 mol/μm2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519fig2.jpg",
    "Figure 2 Micropipette system schematics. Our micropipette system was assembled in house and consists of three subsystems: an imaging subsystem to allow one to observe, record and analyze movements of the micropipette-aspirated cell; a micromanipulation subsystem to enable one to select the cells from the cell chamber, and a pressure subsystem to allow one to aspirate the cells into micropipettes. The central piece of the imaging subsystem is inverted microscope (Olympus IMT-2 IMT2) with a 100x oil immersion 1.25 N.A. objective. The image is sent to a video cassette recorder through a charge couple device (CCD) camera. A video timer is coupled to the system to keep track of time. Each micropipette can be manipulated by a mechanical drive mounted on the microscope and finely positioned with a three-axis hydraulic micromanipulator. Mechanical manipulators from Newport could be used as well. One of the micropipette holders is mounted on a piezoelectric translator, the driver of which is controlled by a computer LabView code (available upon request) and the signal translates through a DAQ board via a voltage amplifier (homemade) to the piezo actuator. This allows one to move the pipette precisely and repeatably in an adhesion test cycle. The pressure regulation subsystem is used to control suction during the experiment. A hydraulic line connects the micropipette holder to a fluid reservoir. A fine mechanical positioner allows the height of the reservoir to be precisely manipulated.",
    "Micropipettes are generated using KIMAX melting point borosilicate glass capillary tubes (with outside diameter of 1.0±0.07 mm and an inside diameter of 0.7±0.07 mm. First, the micropipettes from capillary tubes are pulled using PN-30 Narishige' Magnetic Glass Microelectrode Horizontal Puller (Sutter Instruments Micropipette Puller is another puller option). Second, Microforge system (built in house) is used to cut the micropipettes to desired size opening. Commercial models of Microforge systems are available as well.\nTo avoid vibration of the micropipettes during the experiment, the microscope, along with the micromanipulators, is placed on an air suspension table.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519fig3.jpg\nFigure 3 Running adhesion frequency Fi for specific (A) and nonspecific (B) binding at 1s (red) and 10s (blue) contact times measured from repeated adhesion test cycles between RBCs coated with ICAM-1 (A) or hIgG (B) with human neutrophils expressing integrin αLβ2. Fi = (X1 + X2 +…+ Xi)/i (1 ≤i ≤ n), where i is the test cycle index, Xi equals \"1\" (adhesion) or \"0\" (no adhesion). Fn (n=50) was used as the best estimate for adhesion probability.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519fig4.jpg",
    "Figure 4 Kinetics of ICAM-1 binding to neutrophil integrin αLβ2 (imgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519sq1.jpg). Adhesion probability measured as shown in Figure 3 for three cell pairs at each contact time is averaged and plotted versus contact time. The chamber medium was HBSS with 1mM each of Ca2+ and Mg2+ plus 1μg/ml of dimeric E-selectin-Ig to upregulate αLβ2 binding. To capture ICAM-1-Ig on RBCs, an intermediate step was added to incubate RBCs with 10μg/ml capture antibody (biotinylated goat-anti-human Fc antibody, eBioscience) after the streptavidin incubation step. To control for nonspecific binding two different conditions were used: 1) RBCs coated with the anti-human-Fc capture antibody and incubated with human IgG instead of ICAM-1-Ig (O) and 2) neutrophils binding to RBCs not coated with the capture antibody (Δ). 10μg/ml human IgG was added to the medium to minimize binding of E-selectin-Ig in solution to the capture antibody on the RBC surface. Nonspecific binding recorded as human IgG control curve was used to obtain a specific adhesion probability curve (imgsrc://cloudfront.jove.com/files/ftp_upload/3519/3519sq2.jpg) using Eq. 2. Fitting specific adhesion probability curve with Eq. 1 (solid line) returned effective binding affinity AcKa = 1.4•10-4 μm4 and koff = 0.3 s-1.\ntable:\n﻿Reagent,MW (g/mol),Concentration (mM),Amount (g)\nAdenine,135.13,2,0.27\nD-glucose (dextrose),180.16,110,19.82\nD-Mannitol,182.17,55,10.02\nSodium Chloride (NaCl),58.44,50,2.92\n\"Sodium Phosphate, Dibasic (Na HPO )\",141.95,20,2.84\nL-glutamine,146.15,10,1.46\nTable 1. EAS-45 buffer preparation (1L).\ntable:\n﻿0,1\n25 mg biotin-XHS in 550 μl of DMF,0.1M biotin solution\n1:10 dilution of 0.1 biotin w/DMF,0.01M biotin solution\n1:100 dilution of 0.1 biotin w/ DMF,0.001M biotin solution\nTable 2. Preparation of the biotin solution.\ntable:\n﻿biotin final concentration (μM),4,10,20,50,100,160\nRBCs pellet stock (μl),10.0,10.0,10.0,10.0,10.0,10.0\n1x PBS (μl),179.2,178.0,176.0,179.0,178.0,176.8\n0.1M borate buffer (μl),10.0,10.0,10.0,10.0,10.0,10.0\n0.01M biotin solution (μl),,,,1.0,2.0,3.2\n0.001M biotin solution (μl),0.8,2.0,4.0,,,\nTable 3. Biotinylation of RBCs.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}