{
  "id": 1925,
  "origin_website": "Cell",
  "title": "A fluorescence microscopy-based protocol for volumetric measurement of lysolecithin lesion-associated de- and re-myelination in mouse brain",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse anesthesia and nanoliter injector preparation\nTiming: 30 min\nThese steps will ensure that the equipment, solutions and experimental animals are ready for the surgery and lysolecithin injection.\nPrepare the lysolecithin - Monastral blue solution:\nThaw one 20 μL aliquot on lysolecithin 1% and warm to 37°C. If precipitates are formed, sonicate for 15 min.\nAdd 0.2 μL of Monastral blue solution to 20 μL of lysolecithin.\nKeep the solution at 37°C.\nNote: the final concentration of Monastral blue in the lysolecithin – Monastral blue solution is very low (0.03%) but sufficient to recognise the lesions while cryosectioning. In our experience, a very small amount of Monastral blue might be phagocytosed by microglia/macrophages at the central core of the lesion; otherwise, the Monastral blue is inert to the cells in the CNS. The very low concentration further ensures that the Monastral blue has no effects on microglia/macrophages or on myelin. The final concentration of Monastral blue in the lysolecithin – Monastral blue solution can be further decreased, as long as it can be observed during cryosectioning.\nWeigh the mouse and inject the corresponding amount of MMF anaesthesia intraperitoneally (0.5 mg/kg BW Medetomidine, 5 mg/kg BW Midazolam, 0.05 mg/kg BW Fentanyl). Keep mice in a dark, warm space to ensure correct full anesthesia.\nPrepare the Nanoliter injector (Figure 2[href=https://www.wicell.org#fig2]):\nNote: these are instructions for using the Nanoliter 2010. By the time this protocol was written, the Nanoliter 2020 was released, which offers extended options of injection volumes – see manufacturer’s manual for more information.\nNote: use gloves or tweezers when handling the injector and O-rings to avoid hand-fat deposition onto them.",
    "Loosen the collet covering the gasket and plunger and the O-rings. There are three O-rings: a black plunger sealing O-ring with a small hole, a white plastic sleeve called “spacer” and a conical shaped O-ring with a large hole (Figure 2[href=https://www.wicell.org#fig2]).\nMake sure the O-rings are completely clean and dry.\nTake a glass capillary and break the tip by pressing it with fine forceps. Break approximately 1.5 mm off the tip. This should ensure that the capillary has a sharp tip (Figure 3[href=https://www.wicell.org#fig3]B). We recommend performing this procedure under a magnification stereoscope to achieve consistent breaking.\nPass the capillary through the collet, with the conical part of the collet facing the tip of the capillary.\nNext, slide the capillary through the red O-ring from its blunt end, so that the conical part of the O-ring points towards the collet and the tip of the capillary.\nFill the glass capillary with mineral oil from the large, non-pulled end. The oil in the capillary allows the collet to easily slide in and out of the capillary during the injection or withdrawal of the lysolecithin – Monastral blue solution.\nFill in a 1 mL syringe with mineral oil, attach a MicroFil needle to the syringe and ensure that the oil is being ejected through the MicroFil needle.\nPlace the MicroFil needle into the glass capillary from the blunt end, so that the needle’s tip is pushed all the way into the front part of the glass capillary, near the pulled end.\nEject the liquid into the glass capillary and simultaneously slowly withdraw the MicroFil needle as the liquid fills up the glass capillary until the glass capillary is completely full with oil.",
    "Install the black O-ring onto the collet so that the larger hole is facing towards the injector. Then, slide in the white spacer. The flat side of the spacer should face towards the injector. The other side has a recessed part which receives the capillary. The black O-ring should hold onto the plunger, but the white spacer needs to be held so that it stays in place (Figure 2[href=https://www.wicell.org#fig2]).\nSlide the filled glass capillary onto the plunger until the glass capillary contacts the recessed part of the white spacer. This will cause some oil to leak out of the glass capillary; this should be cleaned away with a cotton swab. Keep on pressing the glass capillary towards the injector to avoid bubbles forming within the oil. Push the collet towards the aluminum barrel and screw it until it is finger tight.\nFill the glass capillary with lysolecithin – Monastral blue solution (Figure 3[href=https://www.wicell.org#fig3]C):\nSet and run the Micro4Pump to inject 4000 nL at a rate of 2000 nL/min so that the plunger pushes mineral oil out of the glass capillary. Clean the excessive oil from the tip of the glass capillary.\nNote: If the glass capillary is fully pushed out of the injector and falls down, refer to troubleshooting 1[href=https://www.wicell.org#sec6.1].\nSet and run the Micro4Pump to withdraw 400 nL at a rate of 2000 nL/min. This will create a 1 mm-thick air bubble within the glass capillary.\nImmerse the glass capillary into the lysolecithin – Monastral blue solution by holding the tube with the solution below the injection device and withdraw 3600 nL of the solution at a rate of 1000 nL/min into the glass capillary.\nNote: if the lysolecithin – Monastral blue solution is not being correctly pipetted into the glass capillary, see troubleshooting 2[href=https://www.wicell.org#sec6.3].",
    "Use a cotton swab wet with saline solution to slightly stroke the tip of the glass capillary in order to keep the tip of the glass capillary moist. Repeat this step every 5–10 min to prevent drying and clotting of the lysolecithin within the glass capillary.\nCritical: The correct orientation of the O-rings and the correct assembly of the glass capillary in the injector are essential (Figure 2[href=https://www.wicell.org#fig2]). Otherwise, leakage may occur. After long periods of regular use of the O-rings, there might be leakage around the seals. To correct this, replace the O-rings with new ones. Please, refer to the manufacturer instructions for more detailed information on how to assemble the injector correctly.\nPosition the mouse into the stereotaxic device:\nTransfer the mouse from the dark, warm cage onto a heating pad. Check for full anasthesia by testing the interdigital reflex on the paw.\nProtect the eyes from drying out by covering them with a small drop of Bepanthen eye cream.\nCut hair from the head with scissors or alternatively, using a trimmer.\nUsing fine scissors or a thin scalpel, cut a 1 to 1.5 cm-long incision on the head skin. This exposes the mouse skull above the cortical hemispheres, the most caudal part of the olfactory bulbs and the most cranial part of the cerebellum. You should be able to visualize both the Bregma and Lambda intersections (Figure 3[href=https://www.wicell.org#fig3]D).\nPlace the mouse in the stereotaxic apparatus (Figure 3[href=https://www.wicell.org#fig3]E):\nFix the left ear bar to a predefined scale (e.g., 4 mm).\nFit the left ear canal of the mouse onto the left ear bar so that the tip of the ear bar pulls the skin down and exposes the skull.",
    "Keep on holding the mouse head in this position while you slide the right ear bar into the right ear canal so that the tip of the ear bar pulls the skin down and exposes the skull. The right ear bar should be fixed to the same scale as the left ear bar.\nCritical: Correct stereotaxic fixation of the mouse is essential to successfully target the brain region of interest. When pressing the ear bar onto the mouse ear, you should feel a hard bone, and no soft tissues. When the mouse head is in the right position, the head is straight and symmetrical to the ear bars. The investigator should be able to move the mouse snout up and down, but the head should not be able to be moved laterally.\nInsert the incisor adapter into the mouse’s mouth until its incisors fit into the small opening in the adapter. Make sure to gently pull out the tongue of the mouse slightly to allow for correct breathing.\nSlightly pull back the incisor adapter to check for its correct position. If the incisors are correctly placed within the hole, the adaptor should not be able to move back.\nFix the incisor adapter and carefully place the snout clamp just below the eyes using low pressure.\nAt this point, the mouse’s head should be completely fixed in the stereotaxic apparatus and no movement should be possible.\nNote: from Step 5, you require visualization through a dissection microscope using 20× to 40× magnification.",
    "Align Bregma and Lambda: these steps ensure that the top of the animal’s skull is in the horizontal plane. This step is essential to be confident that the coordinates you follow will hit the target region. To adjust the horizontal position of the head, you can use the screw at the incisor adapter (Figure 3[href=https://www.wicell.org#fig3]F).\nNote: this step is optional if your target region is neocortical or superficial. However, it becomes crucial if the Z coordinate of the target region is deeper than −2 mm.\nIdentify Bregma and Lambda (Figure 3[href=https://www.wicell.org#fig3]F)\nMove the capillary to Bregma so that the tip of the capillary lightly touches onto it. Reset all coordinates.\nMove the capillary to Lambda. Do not change the X coordinate, but change the Y and Z coordinate so that the glass capillary is lightly touching Lambda. Check the Z coordinate at this point.\nIf the Z coordinate value has changed by more than +/- 50 μm, adjust the head position with the screw at the incisor adapter until the Z coordinate for Bregma and Lambda become equal.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1407-Fig2.jpg\nFigure 2. Correct assembly of the Nanoliter injector 2010\n(A) Cartoon displaying the different components of the Nanoliter injector 2010.\n(B) Cartoon showing the correct orientation and order of the O-rings. These orientations and the order are essential for the capillary to be correctly adjusted into the injector. Image source: Nanoliter 2010 instruction manual.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1407-Fig3.jpg\nFigure 3. Mouse surgery\n(A) Overview of all materials needed to perform the stereotaxic injections.\n(B) Image of the glass capillary before and after cutting its tip off.\n(C) Image showing the fully loaded glass capillary. There should be a small air bubble between the mineral oil and the lysolecithin-Monastral blue solution.\n(D) Image of the skin incision above the brain skull.",
    "(E) Image showing the mouse correctly fixed into the stereotaxic apparatus. Note that the ear holders are simultaneously holding the skull at a fixed position and the skin open.\n(F) Image of anatomical Bregma and Lambda points. Bregma is used as a reference for all coordinates, while the alignment of Bregma and Lambda in the Z plane is essential to ensure a proper head positioning. Scale bar: 4 mm.\n(G) Image of the hole drilled into the skull and the capillary inside the brain. Scale bar: 4 mm.\n(H) Image of the sutured incisure.\nLysolecithin injection\nTiming: 30 min\nHere we elucidate how to perform the intracranial injection of lysolecithin to achieve a focal demyelination in the corpus callosum.\nDrill a small hole through the skull at the target position (Figure 3[href=https://www.wicell.org#fig3]G):\nReset all coordinates at Bregma so that Bregma is the reference.\nUsing the different stereotaxic axis, move the glass capillary to the coordinates X: −1 mm and Y: −0.1 mm.\nLower the glass capillary, and carefully mark on the skull the resulting position with a marker. Raise the glass capillary again to its highest position to protect it.\nAttach a 0.5 mm drill-bit to the Micro Drill and adjust the speed to 20,000 rpm.\nMake a single burr-hole in the skull at the marked site by applying gentle pressure on the skull while holding the Micro Drill steady.\nNote: The head should not move while drilling. Head movement would indicate an incorrect fixation of the mouse head.\nOnce the Micro Drill has drilled through the skull, a small sudden drop will be noticed on the hand holding the Micro Drill. Stop immediately to prevent damaging the brain parenchyma.",
    "Note: To prevent damage to the brain parenchyma, another option would be to stop drilling when the drill-bit reaches the internal layer of the skull, where a thin layer of skull may remain. With a sharp object (e.g. sharp forceps, fine blade, or surgical hook), remove the small pieces of the remaining skull to expose the brain.\nApply saline solution on the hole to keep the brain moist.\nLower the glass capillary again just to the brain surface to confirm that the skull opening is in the correct position.\nNote: the tip of the glass capillary should not be diverted by the edges of the burr-hole. If it is, use the Micro Drill again to widen the hole.\nInject the lysolecithin into the desired position (Figure 3[href=https://www.wicell.org#fig3]G):\nMake sure that the glass capillary is not clogged by injecting a small volume of fluid while visually controlling the tip of the glass capillary (e.g., 50 nL at a speed of 1000 nL/min). A drop of blue fluid should be formed at the tip.\nSet the settings of the Micro4Pump to inject 1000 nL at a speed of 100 nL/min.\nLower the glass capillary at a slow but steady speed into the brain parenchyma until the Z coordinate is −1.45 mm. Then raise the glass capillary to the Z coordinate −1.4 mm. This creates a small “pocket” within the brain parenchyma that facilitates the flow of lysolecithin.\nNote: the glass capillary should be able to easily poke through the brain parenchyma. If it does not, this would indicate that there are pieces of skull remaining on top.\nInject the lysolecithin by running the program set in the Micro4Pump. This step takes 10 min.",
    "Note: Use visual references to control that the lysolecithin solution is being injected and not refluxed. Reflux is normally obvious after 200 nL of solution has been injected, and appears as blue liquid progressively accumulating around the glass injection site. If you observe repetitive reflux, please refer to troubleshooting 3[href=https://www.wicell.org#sec6.5].\nOnce the program is complete, wait for 2 more min.\nSlowly raise the glass capillary until it is out of the brain.\nRemove the mouse from the stereotaxic device by releasing the incisor and ear adapters and transfer to the warm pad.\nNote: These steps describe the procedure to perform one unilateral injection into the corpus callosum. However, bilateral injection or multiple injection sites are also possible. We have performed up to 6 injections per mouse using the coordinates below. However, we have only confirmed the feasibility of the volumetric calculation for injection site 2. Sites 1 and 3 were used additionally when big amounts of demyelinated white matter were needed for –omics studies (see Penkert et al., 2021[href=https://www.wicell.org#bib4]).\nInjection site 1: X = −1/+1, Y =+1.10, Z = −2.30 → −2.25 Injection site 2: X = −1/+1, Y = −0.10, Z = −1.45 → −1.40 Injection site 3: X = −0.55/+0.55, Y = −1.22, Z = −1.45→ −1.40\nRecovery and monitoring\nTiming: 20 min – 3 days\nThese steps ensure correct recovery and monitoring of mice after surgery.\nInject 0.05 mg/kg BW of buprenorphine subcutaneously.\nApply saline solution onto the skull to ensure brain and skull moisture.\nPull the skin edges of the incision together and stitch using braided absorbable suture (suture 4/0 or 5/0 work, DSS 13) (Figure 3H[href=https://www.wicell.org#fig3]).\nInject 2.5 mg/kg BW of Atipamezole, 0.5 mg/kg BW Flumazenil and 1.2 mg/kg BW Naloxon subcutaneously to terminate the anesthesia.\nClean away the Bepanthene from the eyes.",
    "Keep the mouse in a warm, preferably dark space until full recovery from the anesthesia.\nMonitor the mouse 24, 48 and 72 h after the injection by checking its weight. Inject 0.05 mg/kg of Buprenorphin subcutaneously 24 and 48 h after the injection as analgesia.\nPerfusion and cryosectioning\nTiming: 4 days (2 h hands on)\nIn these steps, we describe how to fix the brain for correct tissue preservation and how to cut the demyelinated tissue in a serial manner to allow for subsequent quantification.\nPerfuse the mouse with fixative:\nPrepare 4% paraformaldehyde solution and 1× PBS.\nAnesthetize the mouse by injecting 150 μL of 10% ketamine and 2% xylazine intraperitoneally.\nExpose the heart, insert a venofix needle into the left ventricle and open the right atrium.\nPerfuse using a peristaltic pump with 5 mL of 1× PBS followed by 30 mL of 4% PFA at a rate of 2 mL/min.\nRemove the brain and keep overnight in 4% PFA at 4°C for 24 h. Wash the brain 3 times in 1× PBS and transfer to cryoprotecting sucrose solution for 2 days or until the brain sinks to the bottom of the tube.\nTo freeze the brain (Figure 4[href=https://www.wicell.org#fig4]A);\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1407-Fig4.jpg\nFigure 4. Freezing and sectioning the lesioned brains\n(A) to freeze the brain quickly, place a wet paper on top of a metallic blade on top of dry ice. Then, apply a drop of Tissue Tek O.C.T and place the brain with its caudal end on the paper. Use little O.C.T. to prevent having O.C.T around the brain.",
    "(B) Schematic of how the neuroanatomy of the brain at the expected localization of the demyelinated lesion looks like at the frontal, central and caudal part of the lesion. The brain is displayed upside-down because we recommend sectioning corona sections starting from the most dorsal part of the brain and cutting through to the most ventral part of the brain to prevent tissue destruction at the lesion site.\n(C) Cryosectioning scheme to ensure serial sectioning of the demyelinated lesion with a known distance between sections of the same slide. Here, 5 series are produced (A to E) and 2 slides are needed for each series (1 and 2 for each series). The first section with lesion tissue should be on slide A, the next on slide B, … until section 5 goes on slide E. Section 6 should go on the very end of slide A1, to serve as a negative primary control for the immunostaining. From section 7, the procedure should be repeated, with the next section for negative control staining going to slide B1. This way, each section on one same slide is separated by a known distance (“d”) of 6 sections, i.e., 90 μm if 15-μm sections are being used. Once all the positions for the negative control are occupied, one section should be trashed after each round, to be able to keep the constant distance.\n(D) Picture of a slide with brain sections. It should be ensured that the demyelinated lesion lays perfectly flat on the glass slide. The negative control section is circled separately from all other sections for subsequent immunostaining. Scale bar: 1 cm.\nCool down an aluminum surface on dry ice (e.g., a blade)\nDry the excess sucrose around the brain and cut the cerebellum off (to provide a flat surface)",
    "Dip a 1 cm x 1 cm square of paper on water, then place on top of the cooled aluminum surface, on top of dry ice.\nAdd a small drop of Tissue-Tek O.C.T. onto the paper, and then quickly place the brain on top of the paper so that the flat surface, i.e., the most caudal part of the brain, is on top of the paper.\nNote: Avoid using Tissue-Tek O.C.T spread around the brain to facilitate cryosectioning.\nTo store the brains, cover the sample in pre-cooled aluminum foil and keep at −80°C.\nUsing a cryostat, cut serial 15-μm-thick coronal sections of the lesion and directly mount them on Superfrost glass slides. The lesion can be localized by the blueprint left by the Monastral blue dye used during injections. To assure the acquisition of the entire lesion, some sections before the beginning and some after the end of the lesion can be collected. We recommend sectioning from the dorsal side through to the ventral side of the brain (i.e., upside down) to prevent physical damage on the demyelinated lesion. Serial sectioning ensures a representative sampling of the whole lesion in different slides, which can subsequently be used for different stainings.\nNote: the Monastral blue dye is mostly concentrated at the center of the lesion. Thus, the blue color will be most prominent at the core of the lesion, while the rest of the lesion should be stained in lighter blue.",
    "Note: in the beginning, it is useful to collect several sections before and after the lesion, to ensure the acquisition of the entire lesion. If the correct coordinates were reached during the injection, the lesion should be found between approximately Y: +0.1 mm and −1 mm from Bregma, and there should be approximately 60–70 15-μm-thick sections with lesion, depending on the time point after injection.\nNote: Sometimes, it might happen that some sections will be lost during cutting. If this problem is constant and persistent, refer to troubleshooting 4[href=https://www.wicell.org#sec6.7].\nCRUCIAL: It is essential that the cutting paradigm enables the recognition of the order of sections, as well as the exact distance between one section and the next. For example, at 15-μm-thick sections and 6 series, each section in one series is separated by 90 μm. We suggest following the scheme presented in Figure 4[href=https://www.wicell.org#fig4].\nAir-dry the sections for 16–20 h (overnight) at room temperature. Then, transfer and keep the sections at −20°C.\nStaining and imaging\nTiming: 3 days\nIn this part, we describe how to stain myelin and microglia/macrophages so that the demyelinated area and the area of IBA1+ cell accumulation can be visualized. All steps are performed at RT unless stated otherwise. From step 20i on, the solutions containing secondary antibodies and the slides should be protected from light to prevent bleaching of the fluorophores.\nStain the sections with anti-IBA1 antibodies and DAPI and Fluoromyelin fluorescent dyes to visualize the microglia/macrophages, demyelinated area, and nuclei:\nTransfer the glass slides to be stained (1 series of each lesion is sufficient) to 37°C for 30 min.\nRinse the slides with 1× PBS, 3 × 5 min.\nPermeabilize the tissue for 10 min using 1× PBS with 0.3% Triton X.\nIncubate the sections for 1 h with a blocking solution.",
    "Note: encircle the sections with a hydrophobic PAP Pen to ensure that the liquid stays on top of the sections.\nDilute IBA1 at a concentration of 1:2000 in staining solution.\nIncubate the sections with the primary antibodies for 16 h at 4°C.\nContinue incubation with the same solution for another hour at RT.\nWash the sections with 1× PBS, 3 × 5 min.\nDilute the anti-rabbit Alexa 555 secondary antibody at a concentration of 1:1000 in staining solution.\nIncubate the sections with secondary antibodies for 1 h at RT.\nWash the sections with 1× PBS, 3× 5 min.\nDilute Fluoromyelin (1:400) and DAPI (1:1000) in 1× PBS.\nIncubate sections with Fluoromyelin and DAPI for 15 min.\nWash the sections with 1× PBS, 3× 10 min.\nDip slides in ddH2O, remove all excess water using a tissue and keep the slides protected from light until all water is evaporated and the sections are dry (approx. 10 min).\nCover sections using a glass coverslip (thickness #1.5) using Mowiol as a mounting medium, dry for 16–20 h (overnight) at RT and keep at 4°C until imaging.\nNote: immunostaining with an anti-MBP antibody to stain for myelin is also possible.\nAcquire fluorescence images of the stained sections for three channels (DAPI, Fluoromyelin, AF555) using standard settings for multi-channel acquisition (both an epifluorescence microscope or a laser-scanning confocal microscope are suitable) (Figures 5[href=https://www.wicell.org#fig5]A and 5B):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1407-Fig5.jpg\nFigure 5. Staining and imaging of the demyelinated lesion",
    "(A) Cartoon demonstrating the site of lysolecithin injection. The gray square delineates the area shown in the microscopy images on the right, which are representative images of the demyelinated lesion at 14 days post injection (dpi), showing in green the myelin labeling (Fluoromyelin) and in magenta the microglia/macrophages (IBA1). The injection of lysolecithin creates a small focal lesion at the site of injection. Scale bar: 200 μm.\n(B) Representative images of two demyelinated lesions at 14 dpi. All the pictures of these lesions are shown, from the most frontal part of the lesion to the most caudal part. Considering that each section is separated by 90 μm, the total distance between the first and the last section in lesion 1 is 450 μm, while in lesion 2 it is 360 μm. C. Cartoon representing the components required for the volume calculation. Each lesion area is measured using our custom-made ImageJ macro. The radii of the areas are calculated, while the distance between sections is dictated by the serial cutting paradigm. The output of the iPython script will be the total lesion volume.\nSelect an objective with a field of view large enough to fit the lesion region (e.g., 10×). If the field of view of the objective is smaller than the whole lesion, then acquire and merge tile-scan images, so that the entire demyelinated lesion is visible in one single image.\nSet the excitation intensity and detection gain for each channel, so that the fluorophores are properly excited but not saturated.\nUse the same pixel size, as well as the same excitation and detection settings for all acquisitions.",
    "The demyelinated lesion is shown as the area of corpus callosum with FluoroMyelin-negative signal and prominent IBA1+ cell accumulation (Figure 5[href=https://www.wicell.org#fig5]A). Image all the demyelinated areas in order, so that the order of the different lesions can be tracked afterwards (Figure 5[href=https://www.wicell.org#fig5]B).\nSave the images with consecutive numbering in their names, as individual gray-scale .tiff files, or, if possible, inside an image container file (recommended).\nArea quantification and volume calculation\nTiming: 30 min\nFinally, these steps describe how to first analyze the areas of demyelination or the area of clustered IBA1+ cells using an ImageJ macro and how to compute the volume of the lesion using our iPython script.\nQuantify the demyelinated area and the area of clustered IBA1+ cells in each section using the ImageJ/FIJI macro “Macro_Analyse_Lesion_Area.ijm” (find it in the File S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1407-Mmc2.zip] of this paper or GitHub and Zenodo).\nRun ImageJ/FIJI.\nOpen the macro in FIJI by dragging and dropping the .ijm file on ImageJ/FIJI or File→Open… and selecting the macro file. Then click on Run.\nThe option \"Analyse single image container file\" is selected by default. This means that the macro will process only single files (images or image containers). If this option is not checked, then the macro asks for an input folder and will process all images (or image container) files located in this folder.\nThe option “Save ROI Selections” is marked by default. Uncheck this if you do not wish to save the area selections.\nThen give the basic name of the output folder where the result text files and the regions of interest (ROIs) will be saved. This new folder will be located in the same folder as the input files. The name of the output folder will also contain the date and time the macro has run (e.g., _Results_20211020_1535).",
    "Press OK and then select the folder containing the image files (or the image container file) to be analyzed.\nEvery selected image will be opened, together with a pop-up message that states “Please select the region of lesion and press OK”. With the free-hand selection tool delineate the area of Fluoromyelin negative staining or the area of IBA1+ clustered cells, depending on whether you aim to analyze the demyelinated or the IBA1+ volume, respectively. When done click OK.\nStep 22g will be repeated until all images are processed.\nIn the saving folder selected in step 22e, you will find a .txt file that contains the results of your analysis. This file is a tab-separated file with two columns (name of image and area measurement) and as many lines as the analyzed images.\nNote: The macro expects input images with a single z-level, a single time-frame and three channels. However, it can accept as an input any kind of hyper-stack. In such cases, a notification will appear in the Log Window of ImageJ notifying the user during the process of the image.\nNote: The area measurement will have the same unit as the image pixel size (i.e. if the image is not calibrated, then the area’s unit will be squared pixels).\nNote: If you observe many sections with a necrotic hole where the demyelinated tissue should be, refer to troubleshooting 5[href=https://www.wicell.org#sec6.9].",
    "Copy the area measurements for each section in an excel file. This excel file will be composed of three columns: the first column listing animal names corresponding to each section (same name for all the sections of one lesion), the second column containing the areas A of each section and the third column specifying the radii r of the corresponding sections calculated using the formula for the area of a circle   r =    A / π    . See the example template in the File S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1407-Mmc1.xlsx].\nTo calculate lesion volumes, run iPython 2.7 (Pérez and Granger, 2007[href=https://www.wicell.org#bib5]) and input the prepared excel file and the known distance between consecutive sections in μm into the openly available code (GitHub and Zenodo). This script calculates the volume in between sections based on the truncated cone volume formula, sums up the single volumes between all sections per animal and outputs one file containing the animal names and their corresponding lesion volume (Figure 5C[href=https://www.wicell.org#fig5])."
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Microscopy",
    "Neuroscience",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}