{
  "id": 7085,
  "origin_website": "Bio",
  "title": "Stable Transformation of <em>Arabidopsis thaliana</em> Cell Suspension Cultures: A Case Study for the Overexpression of The COI1 Receptor",
  "procedures": [
    "Transformation and establishment of cell suspension culturesArabidopsis Ler suspension cultures (see Materials and Reagents for source details) are maintained at 22 °C in constant light (80 μmol m-2s-1 intensity in constant agitation (100 rpm) in LS media and sub-cultured every 7 days as described in Section B.Notes: All instruments should be kept clean and sterile to minimize cross contamination. All steps listed in the current protocol are performed under the laminar flow hood to maintain aseptic conditions throughout the process. Streak on TY media agar plates containing the appropriate antibiotics the A. tumefaciens GV3101 strain containing the pBin19PLUS vector (Van Engelen et al., 1995) with the gene (or construct) of interest (Figure 1A). In this case, the intron-tagged COI1::HiA construct was used (Devoto et al., 2002; Bömer et al., 2018) with the following antibiotics:Gentamycin (50 µg/ml).Rifampicin (25 µg/ml).Kanamycin (50 µg/ml) for plasmid selection.Incubate the plates at 28 °C for 2-3 days by placing them lid down in the incubator, to avoid condensation.Streak one single colony of A. tumefaciens from plate and grow for ~48 h in shaker incubator (28 °C 180 rpm in the dark) in 50 ml sterile Falcon tubes containing 7 ml TY media containing:Gentamycin (50 µg/ml).Rifampicin (25 µg/ml).Kanamycin (50 µg/ml) for plasmid selection.After 48 h or when O.D.600 nm = 0.8-1.0, take 1 ml of the Agrobacterium bacterial suspension, and add it to a 200 ml Erlenmeyer flask, in a final volume of 50 ml of TY media added with antibiotics as in Step A2 (Figure 1A).When O.D.600 nm = 0.8-1.0 (after ~12 h), the bacterial pellet is recovered by transferring the culture from the Erlenmeyer flask into 50 ml falcon tubes, centrifugation (3,100 x g for 10 min at room temperature) and resuspension in 5 ml sterile fresh TY media.",
    "This culture is ready for infection of Arabidopsis cells.Note: After 12 h of culture, measure O.D.600 nm every 1-2 h, depending on the rate of growth of A. tumefaciens. Bacteria is ready for infection when O.D.600 nm = 0.8-1.0 (O’Brien et al., 2012). On the same day of infection, fresh Arabidopsis cells must be sub-cultured in new Erlenmeyer flasks (Figure 1B).To a previously sterilized 200 ml Erlenmeyer flask containing 45 ml of fresh LS media.Add 5 ml of a 6-7 days old homogeneous Ler cell suspension culture (Figure 1E). Density is measured using packed cell volume (PCV) as described by Bömer et al. (2018) and detailed at Note 5.Keep it shaking at 100 rpm, 22 °C, continuous light regime 80 μmol m-2s-1 intensity, until transformation is performed.Approximately 1 x 1010 (2 ml) A. tumefaciens cells should be added to 50 ml of a freshly sub-cultured Arabidopsis Ler (WT) cell cultures.Immediately after adding A. tumefaciens containing the plasmid of interest, suspensions should be left to stand in the dark with no agitation, for about 2 h.Afterwards, Erlenmeyer flasks containing transformed cell cultures, referred to as COV (COI1 over expressor), must be kept in the dark under constant agitation 100 rpm at 22 °C.Three days after cocultivation, remove COV cell suspensions from the shaker for 5-10 min to allow the cells to sediment or spin them down at room temperature, 18 x g (800-1,000 rpm) in 50 ml Falcon tubes, for 3-5 min.Remove the old media and add fresh sterile LS media to the sedimented infected cells for a total volume of 50 ml.Add the following concentration of antibiotics on every subculture, for selection and to eliminate A. tumefaciens from cultures. Keep the cells at 100 rpm, 22 °C, continuous light regime 80 μmol m-2s-1 intensity.Kanamycin (50 µg/ml) for plasmid selection.",
    "Timentin (200 µg/ml).To maintain stable COV cell lines, 15 ml of COV cells should be sub-cultured weekly in 35 ml fresh sterile LS media for a total volume of 50 ml, containing the same final concentration of antibiotics as in Step A13.Once the cells are stabilized and reach homogeneous consistency (Figures 1E and 2A, see also Note 5) the culture volume is gradually increased to 100 ml (the timeline to increase is between 1 or 2 months, depending on the growth rate of the culture, generally in incremental steps of 15 ml (e.g., from 50 ml to 65 ml to 80 ml, up to 100 ml).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3880/bioprotoc-11-01-3880-g001.jpgFigure 1. Experimental scheme of the direct stable transformation of Arabidopsis Ler cell suspension cultures. A. A. tumefaciens containing the plasmid of interest is streaked on selection media for 2-3 days and then grown overnight. A final 50 ml culture is inoculated with 1 ml of the overnight culture and used to inoculate the freshly sub-cultured Arabidopsis cells (see Procedure Steps A2-A5). B. Diagrammatic chronological representation of cell culture transformation starting with the freshly sub-cultured cells ready to be transformed. Transformation with A. tumefaciens containing vector pBin19PLUS with the intron-tagged COI1::HA construct is then performed and subsequent sub-culturing cycles performed. When the cell culture is homogeneous, calli induction is conducted. After several sub-culturing cycles calli microcolonies are isolated to reduce heterogeneity and inoculated in fresh sterile LS media (see Procedure Steps A7-A15 and B1-B7). C and D. Screening of transformed cells by SDS-Page and Western Blot analyses. C. The expression of the tagged COI1 protein (COI1::HiA) grown in light (COV and COV2, two independently transformed cell lines) and dark (COV dark) conditions is detected, to confirm the occurrence of transformation (~69 kDa). Note the absence of the tagged protein in wild-type (WT) cells.",
    "Different COI protein expression levels can be observed in COV and COV2. D. Screening of transformed cell cultures expressing COI1::HiA, originating from selected calli microcolonies (S.C: selected microcolony). E. Stabilized cell culture ~7 days after subculture (DAS).Micropipette: view image[href=https://pngimage.net/micropipette-png/], Falcon tube: https://contacts.google.com/?hl=en&tab=iC&authuser=0[href=https://contacts.google.com/?hl=en&tab=iC&authuser=0] Calli induction for establishment of single colony cell suspension culturesFrom a 6-7 old days stably transformed cell suspension (Figures 1E and 2A), 1-2 ml of dense culture (density evaluated by PCV, as described by Bömer et al. (2018) and detailed at Note 5 and Figure 2B) are spread evenly onto LS-agar media plates, where cell aggregates formed from single transformed cells, will be able to grow, with antibiotics as follows:Kanamycin (50 µg/ml) for plasmid selection.Timentin (200 µg/ml).Seal the edge of plates with micropore tape.Place the plates under normal growth conditions: 22 °C, in a continuous light regime 80 μmol m-2s-1 intensity.Calli will grow to confluence within 3-4 weeks (Figure 2C), and transfer to new plates should be done periodically, every 3-4 weeks depending on the callus.After 4-5 cycles, when calli have been continuously sub-cultured and maintained, pick a subset of cells ‘microcolony’; (~5 mm diameter) from the established callus (Figure 2C) to obtain stable transformed cell cultures coming from a reduced number of cells to reduce heterogeneity.Place microcolonies to fresh LS-agar media and grow them following the same parameters and conditions as in Steps B3 and B4.After 4-5 cycles, transfer a microcolony from an established plate to a new Erlenmeyer flask with fresh sterile LS media, and keep at 100 rpm, 22 °C, continuous light regime 80 μmol m-2s-1 intensity.Notes: Restart the culture from a callus microcolony in a smaller volume of LS media, e.g., 35 ml. The calli will start proliferating after ~6-7 days.",
    "This will become apparent as portions of the friable callus mass will start detaching from the original one and producing new independent callus mass (Figure 2A). After ~3-4 weeks, the culture will reach confluence and density for subculturing as described at Section C and Note 5. The callus stage is necessary to select microcolonies to make the cultures genetically homogeneous and it is advantageous, in the long term, as it reduces liquid culture handling providing longer intervals to subculturing. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3880/bioprotoc-11-01-3880-g002.jpgFigure 2. Cell cultures and calli growth. A. Propagation of cell culture from callus microcolonies during time. The cells in suspension cultures grow initially as small aggregates. Then, due to the agitation the aggregate splits giving a homogeneous culture. Left, Centre and Right panels: ~1, 2, 3-4 weeks; refer to Section B Notes for a detailed description. B. Established, confluent callus grown on agar plate after 3-4 weeks. C. Packed cell volume (PCV) of cell culture at day 0 (right) and 7 (left).Sub-culturing of Arabidopsis cell suspensionRemove aluminum foil cap from a 200 ml glass Erlenmeyer flask (Flask 1) containing 85 ml of fresh sterile LS media and from flask containing 7 days old cell culture (Flask 2).Take 15 ml of cells from flask 2 and add to flask 1 containing fresh media.If appropriate, add antibiotics (Step A13).Close with foil cap.Place cell suspensions back on to shaker."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}