{
  "id": 8124,
  "origin_website": "Bio",
  "title": "Genomic Signature of Homologous Recombination Deficiency in Breast and Ovarian Cancers",
  "procedures": [
    "Preprocessing of SNP array dataNormalize .CEL files by the appropriate software depending on the array platform.Export the normalized data: chromosome, position, Log_R_Ratio (Illumina) or Log_2_Ratio (Affymetrix), B allele frequency (BAF, Illumina) or Allelic Difference (AD, Affymetrix) into a text file.Process SNP-arrays by (for example) GAP method (Popova et al., 2009) to obtain (Birkbak et al., 2011) estimation of normal contamination and (Carter et al., 2012) absolute copy number and allelic content profiles (Table 1).Table 1. Segmented tumor genomic profile (a fragment from Affymetrix OncoScan 300K)table:\n﻿0,1,2,3,4,5\nPosition Start,Position End,Chromosome*,Length SNPs,Copy Number,Major Allele\n59369,115065314,1,13869,2,1\n115067829,121049277,1,639,3,2\n143701096,144299541,1.5,47,3,2\n144337336,144989346,1.5,19,0,0\n145008423,148551158,1.5,252,3,2\n148565769,152700090,1.5,554,6,5",
    "* 1 stands for p arm and 1.5 stands for q arm of chromosome 1; pericentric region is indicated in red. Quality controlQuality control of measured SNP-array profile: software for primary data normalization usually provides quality index for each chip; chips indicated to have marginal quality have to be excluded from further analysis; indication of quality cut-offs could be found in corresponding User Guides.Contamination of tumor sample by normal stromal cells: sample with more than 65% of predicted normal cells admixture have to be excluded from further analysis (Note: Measured tumor sample usually represents a mixture of tumor and normal cells in different proportions, which results in different contrast in the measured SNP-array profile; 60-70% of normal contamination is at the limit of current recognition techniques).Quality control of copy number and allelic content recognition: pattern of copy number alterations (CNAs) in a tumor genome have to be \"interpretable\", meaning, copy number variation and allelic imbalance profiles have to be consistent. Unfortunately, there is no reliable measure of such consistency developed; we used manual control of recognition based on the GAP plots (Figure 1). GAP plot of a tumor genome is a two dimensional representation of segmented SNP array profiles, where each circle represents a segment (Popova et al., 2009). Clear and regular structure of the GAP plot indicates consistency (Figure 1A), while chaotic structure indicates inconsistency (Figure 1B). Samples with inconsistent profiles have to be excluded from further analysis. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130704/20130704170527_1213.jpgFigure 1. GAP plots for two tumor samples measured by Affymetrix OncoScan 300K representing (A) high quality and (B) low quality profiles. GAP plot of a tumor genome is a two dimensional representation of segmented SNP array profiles, where each circle represents a segment (Popova et al., 2009). Tumor samples are from GEO database (GSE28330, Birkbak et al., 2012).",
    "Quality control of adequate detection of chromosomal breaks: Highly contaminated tumor samples together with unspecific variation in SNP array profiles often result in false positive chromosomal breaks detected by segmentation algorithms; the sample need to be discarded in the case of large number of false positive breaks. Adequate formal procedure for this type of quality control is not yet developed. We performed rough visual estimation of consistency of detected breaks in copy number variation and in recognized copy number profiles. Note: Poor quality sample comprises around 10-15% of hybridized samples, including low tumor content, poor hybridization, low recognition quality, etc.Calculating the number of large-scale chromosomal breaks from segmented profile (Table 1, Figure 2): Note: Here we describe how to estimate the number of chromosomal breaks related to homologous recombination deficiency; filtering of variation is performed only for the purpose of estimation of breakpoints number and has no relation to particular alterations whatever important they are. Filtering out micro-variation: The size of micro-variation S_micro is the lower limit of the detectable somatic alteration size, which is dependent on the SNP density in the array; for example, we used 50 SNPs for Affymetrix SNP 6.0; 30 SNPs for Illumina 600K; etc. Note: Main reason for this filtering is that micro-variations are often linked to germline copy number variations.Exclude from the segmented genomic profile all segments less than S_micro SNPs and link adjacent segments if they have identical Copy Numbers and Major Alleles.Filtering out and smoothing small-scale variation: The size of small-scale variation, S_small < 3 Mb, was defined in (Popova et al., 2012). Note: Main reason for this definition is that starting from 3 Mb chromosomal breaks follow a Poisson distribution, i.e. are independent from each other; while the small-scale segments tend to cluster in discrete chromosomal regions.",
    "Order small-scale segments according to the size.Exclude from the segmented genomic profile the smallest segment and link adjacent segments if they have identical Copy Numbers and Major Alleles.Repeat filtering and smoothing until the last small segment.Note: The way of filtering and smoothing small-scale variations has a minor effect on the resulting profile.Calculating number of Large-scale State Transitions (LSTs) of the size S Mb: LST_SMb is defined as a chromosomal break (change in copy number or allelic content) between two adjacent (< 3 Mb in between) segments >= S Mb each; number of LSTs is calculated directly from the segmented genomic profile after filtering and smoothing of small-scale variation (Figure 2).Annotate chromosomal breaks as follows: If two segments from the same chromosome arm differ in Copy Number or in Major Allele, and are >= SMb in size, and the distance between the segments is < 3 Mb, the break is annotated as LST_SMb;Calculate number of LST_SMb (S = 3, 4,…, 11 Mb) in a tumor genome.Note: Centromeric breaks are not taken into account.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130704/20130704170933_4769.jpgFigure 2. Example of genomic profile of one chromosome with detected copy numbers and LSTs. LRR: log R ratio profile; BAF: B allele frequency profile; GT: segmental genotypes recognized by GAP; LST_10 Mb: black arrows point to LST_10 Mb detected. The black under-line shows large-scale segments obtained after filtering and smoothing small-scale variations seen in the GT profile. Chromosome 3 of a tumor sample from GEO database is shown (GSE28330, Birkbak et al., 2012). Estimation of tumor ploidy:Estimate DNA index for a tumor genome as an average copy number in a genome divided by 2.",
    "Estimate chromosome counts in a tumor genome as a sum of copy numbers at pericentric regions of each chromosome arm (Table 1), following the rules: If the size of a segment in pericentric region is >= 1.5 Mb (or 500 SNPs for Affymetrix SNP6.0), the number of copies of corresponding chromosome arm is set to that of the segment;If the size of a segment in pericentric region is < 1.5 Mb, chromosome arm count is replaced by its average copy number.Note: Chromosome number is estimated after filtering micro-variation.Estimate tumor ploidy following the rule: tumor ploidy is estimated to be 2 (near-diploid genome) if DNA index < 1.3 and chromosome counts < 60; tumor ploidy is estimated to be 4 (near-tetraploid genome) if DNA index >= 1.3 and chromosome counts >= 60. Note: This attribution is obtained for breast and ovarian cancer genomes based on the analysis of a large number of tumor genomes, (Popova et al., 2012). Genomes with ambiguous attribution of ploidy represented less than 5% of all cases considered. Other cancers might have different genomic evolution and the thresholds for ploidy attribution might need to be adjusted.Signature of homologous recombination deficiency in a tumor genome Based on the analysis of a large series of breast cancers with known status of BRCA1/2 genes the number of LST_6,7,8,9,10 Mb were found to represent effective discriminating features with naturally defined ploidy-specific cutoffs, which allowed prediction of BRCA1/2 inactivation with high accuracy and precision (Table 2). Testing the signature on ovarian cancer showed LST_6,7 Mb to be the most efficient prediction features with similar to breast cancer cohort cut-offs.Tumor genome is annotated as homologous recombination deficient if number of LSTs in a tumor genome is higher than corresponding ploidy-specific cut-off (Table 2).",
    "Note: Tumors with borderline LST number could be false positives due to false positive breaks detected in the genome. Inconsistency among LST_6, 7, 8, 9, 10 Mb predictions are rare.Table 2. Cut-offs for LST number predicting BRCAness in breast cancertable:",
    "﻿0,1,2,3,4,5,6\n\"LST_S Mb, S\",\"Ploidy 2: (p=68, N=182)\",\"Ploidy 2: (p=68, N=182)\",\"Ploidy 2: (p=68, N=182)\",\"Ploidy 4: (P=53, N=123)\",\"Ploidy 4: (P=53, N=123)\",\"Ploidy 4: (P=53, N=123)\"\n\"LST_S Mb, S\",Cut-Off*,FPR,TPR,Cut-Off,FPR,TPR\n6,19 (17),0.04,0.99,32 (32),0.10,1\n7,17 (15),0.05,0.99,29 (27),0.07,0.98\n8,14 (14),0.06,1,26 (26),0.08,1\n9,14 (11),0.04,0.99,25 (19),0.07,0.98\n10,11 (11),0.07,1,22 (18),0.06,0.98\n*Cut-offs correspond to max (TPR-FPR); cut-offs in parenthesis correspond to 100 sensitivity. P: Numbers of BRCA1/2 mutated tumors; N: Number of BRCA1/2 wild type or not tested tumors; TPR: True positive rate; FPR: False positive rate."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}