{
  "id": 4114,
  "origin_website": "Cell",
  "title": "Generation of Vascularized Neural Organoids by Co-culturing with Mesodermal Progenitor Cells",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nDifferent strategies to achieve neural organoid vascularization were recently published by us and others. Vascularization was achieved by incorporation of endothelial cells (Pham et al., 2018[href=https://www.wicell.org#bib7]), the transplantation into a mouse brain (Mansour et al., 2018[href=https://www.wicell.org#bib6], Daviaud et al., 2018[href=https://www.wicell.org#bib2]) or the use of genetically altered induced pluripotent stem cells (iPSCs)(Cakir et al., 2019[href=https://www.wicell.org#bib1]). Our protocol relies on the incorporation of mesodermal progenitor cells (MPCs), which have the potential to differentiate into all cell types of the vascular wall (Wörsdörfer et al., 2019[href=https://www.wicell.org#bib10]).\nTo generate vascularized neural organoids, iPSC-derived neural aggregates are co-cultured with aggregates of iPSC-derived MPCs. It takes 8 days to set up the neuro-mesenchymal co-cultures. These assembled multi-lineage organoid cultures can then be further cultivated for up to 200 days to achieve organoid maturation (Figures 1[href=https://www.wicell.org#fig1] and 2[href=https://www.wicell.org#fig2]). First analyses are usually performed after 20 days in co-culture (day 28).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig1.jpg\nFigure 1. Experimental Timing\nThe figure illustrates the timing of neural and mesenchymal aggregate cultures, neuro-mesenchymal organoid assembly and vascularized neural organoid maturation. It is feasible to start the experiment on a Monday.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig2.jpg\nFigure 2. Schematic Depiction of the Workflow\n(A) illustrates the generation of agarose-coated 96-well plates and the cell-seeding procedure to achieve iPSC aggregate formation for neural and mesodermal induction.\n(B) depicts the induction, assembly, embedding, maturation and validation workflow.\nExperimental Timing\nGeneration of neuro-mesenchymal organoids (day 0 - day 7)\nPrepare neural organoids (day 0 - day 7)\nPrepare mesodermal organoids (day 3 - day 7)\nAssemble neural and mesodermal parts (day 7- day 8)\nCulture neuro-mesenchymal organoids until a vascular network is established (day 8 – day 28)",
    "Further culture vascularized organoids to achieve higher organoid maturation (day 28 – day x). Some glial cells (astrocytes, oligodendrocytes) or neuronal subtypes need up to 200 days to arise within the neural organoid.\nCulturing iPS Cells\nTiming: 3 days\nPrepare Matrigel-coated 6-well plates. For that purpose, dilute hESC Matrigel in DMEM-F12 using the dilution factor given by the distributor (this can vary from batch to batch depending on the protein concentration) and cover each well with 1 mL Matrigel solution. When working with Matrigel or Matrigel solution keep the Matrigel on ice and chill pipettes to avoid unwanted gelling. For coating, incubate the plates with Matrigel solution either for 17–20 h at 4°C or for 1 h at 20–23°C. Before using the plates for iPS cell culture discard Matrigel solution and cover the well with StemMACS iPS Brew medium. Do not allow the coated plate to dry.\nSeed 5x105 iPS cells per well in 2 mL StemMACS iPS Brew medium containing 10 μM ROCK inhibitor (Y27632).\nCulture cells at 5 % CO2 and 20 % O2 in a humidified incubator until they reach approx. 80% confluency (this takes usually 2 to 3 days) (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig3.jpg\nFigure 3. Generation of Neuro-Mesenchymal Organoids\n(A) 80% confluent human iPS cells cultured on a Matrigel-coated well of a 6-well plate.\n(B) iPSCs 2 h after seeding into an agarose-coated well of a 96-well plate. Note that cells already start to aggregate.\n(C) Condensed iPS cell aggregate after 24 h in suspension culture.\n(D) Neural organoid at day 7 of induction.\n(E) Mesodermal organoid at day 4 of induction.\n(F Neuro-mesenchymal organoid 1 day after assembly and prior to BME embedding.\n(G) The neural part was generated using GFP-labeled iPSCs and is clearly detectable using fluorescence microscopy",
    "(H) Neuro-mesenchymal organoid embedded in BME 2 days after assembly.\n(I) Neuro-mesenchymal organoids after 20 days in co-culture (day 29 in total) in a non-adhesive 6-cm petri dish.\nNote: A 80% confluent well of iPSCs is needed for the induction of neural (day 0) as well as mesodermal organoids (day 3)! If iPS cells grow overconfluent, this can influence their differentiation behavior and might negatively impact the outcome of the experiment. Change medium every day.\nInduction of Neural Organoids\nTiming: 8 days\nPrepare agarose-coated 96-well plates for suspension culture (Figure 2[href=https://www.wicell.org#fig2])\nBoil 1% agarose powder in water using e.g. a microwave oven\nPipette 50 μL warm (approx. 60°C) liquid agarose gel into each well of a F-bottom 96-well plate\nLet cool down for 30 min until the agarose gel gets solid\nNote: The intention of agarose coating is to create a non-adhesive conical mould. It supports the formation of a single cellular aggregate per 96-well. Proper mould formation works best with F-bottom 96-well plates.\nPrepare iPSC single cell suspension (Figure 2[href=https://www.wicell.org#fig2])\nDiscard culture medium from iPSC culture\nAdd 1 mL Accutase per well of a 6-well plate and incubate for 3 min at 37°C\nPrepare a 15 mL conical centrifuge tube with 5 mL DMEM\nAdd 1 mL DMEM to each well with iPSCs treated with Accutase\nMechanically detach the cells by gently pipetting the medium/Accutase solution and transfer the single cell suspension to the prepared 15 mL centrifuge tube.\nPellet cells by centrifugation at 300 x g for 3 min at 4°C\nCount cell number/mL e.g. by using a Neubauer hemocytometer.",
    "Pipette 4000 cells/100 μL StemMACS iPS Brew medium containing 10 μM ROCK inhibitor (Y27632) into each well of the agarose-coated 96-well plate (Figure 3[href=https://www.wicell.org#fig3]B) (day 0). To reduce the effort, prepare medium with cells sufficient for e.g. a complete 96-well plate (ca. 10 mL) and use a multichannel pipette (Figure 2[href=https://www.wicell.org#fig2]).\nCulture cells in a humidified incubator (5 % CO2 and 20 % O2)\nAfter 24 h change medium to 100 μL NIM\nCulture for 48 h in NIM (day 1- day 3)\nChange NIM to 100 μL NIM2\nCulture for 72 h in NIM2 (day 4- day 6)\nChange NIM2 to 100 μL NDM\nCulture for 24 h in NDM (day 6- day 7)\nNote: Daily medium changes are not required. Medium is only changed at the time points indicated in the protocol. It is difficult to remove all the cell culture medium from the 96-wells during medium change. Therefore, leave ca. 20 μL medium in the well and subsequently add 100 μL fresh medium. Use a 100 μL pipette or a vacuum aspirator to remove old medium and be careful not to aspirate the cell aggregates. This might need some practice.\nCritical: Prepare agarose plates fresh; do not store. The ideal amount of agarose needed (50–100 μL) may vary for 96-well plates from different distributers and should be tested. Use flat bottom 96-well plates. Use fresh small molecules and cytokines. We recommend to prepare small batches of medium and avoid storing of medium containing small molecules for more than 7 days in the fridge.\nNote: It is feasible to start neural induction on a Monday.\nInduction of Mesenchymal Organoids\nTiming: 4 days\nPrepare agarose-coated 96-well plate as described above\nPrepare iPSC single cell suspension as described above",
    "Pipette 4000 cells/100 μL StemMACS iPS Brew medium containing 10 μM ROCK inhibitor (Y27632) into each well of the agarose-coated 96-well plate (Figure 3[href=https://www.wicell.org#fig3]B) (day 3). To reduce the effort, prepare medium with cells sufficient for e.g. a complete 96-well plate (ca. 10 mL) and use a multichannel pipette (Figure 2[href=https://www.wicell.org#fig2]).\nCulture cells in a humidified incubator (5 % CO2 and 20 % O2) (day 3 – day 4)\nAfter 24 h change StemMACS iPS Brew medium to 100 μL MIM (day 4)\nCulture for 72 h in MIM (day 4 – day 7)\nNote: Daily medium changes are not required. Medium is only changed at the time points indicated in the protocol. It is impossible to remove all the cell culture medium from the 96-wells. It is OK to leave ca. 20 μL medium in the well and add 100 μL fresh medium. Use a 100 μL pipette to remove old medium and be careful not to aspirate the cell aggregates. This might need some practice.\nCritical: Prepare agarose plates fresh; do not store. The ideal amount of agarose may vary for 96-well plates from different distributers and should be tested. Use flat bottom 96-well plates. Use fresh small molecules and cytokines. We recommend to prepare small batches of medium and avoid storing of medium containing small molecules for more than 7 days in the fridge.\nAssembling of Neural and Mesenchymal Aggregates\nTiming: 2 days\nAt day 7 of neural induction (Figure 3[href=https://www.wicell.org#fig3]D) and day 4 of mesenchymal induction (Figure 2[href=https://www.wicell.org#fig2]E) both organoid types are brought in co-culture (Figures 2[href=https://www.wicell.org#fig2]B and 3[href=https://www.wicell.org#fig3]F–3H) (day 7)\nDiscard the NDM from neural organoids\nAdd 100 μL of fresh NDM\nDiscard most of the MIM from mesodermal organoids. Leave ca. 20 μL medium for organoid transfer",
    "Use a 1 mL pipette to transfer a single mesodermal organoid into a 96-well already containing a neural organoid\nCritical: Transfer the organoids cautiously, avoid damaging/breaking of the organoids. If organoids do not fit into the pipet tip, cut the tip using sterile scissors to create a wider opening\nNote: We use ND medium for the culture of assembled organoids because vascular network formation is not negatively impacted under these conditions but neural differentiation is supported.\nAt day 9 the combined organoids are embedded in 25 μL basement membrane extract (BME) to support neural tissue maturation.\nThaw BME on ice (this takes approx. 2h)\nDiscard the ND medium from the assembled organoid culture\nAdd 25 μL BME carefully into each well of the 96-well plate to encapsulate the organoids\nIncubate for 30 min at 37°C (gelling of the BME)\nAdd 100 μL ND medium\nCulture organoids for 24 h at 37°C in a humidified incubator (5 % CO2 and 20 % O2)\nTransfer assembled organoids into a 10 cm petri dish (day 10) (Figure 3[href=https://www.wicell.org#fig3]I):\nOpen the lid of the 96-well plate under the bench and quickly turn the plate upside-down.\nTap gently to transfer the organoids into a 15 cm non-adhesive petri dish.\nSelect organoids with clearly visible neural and mesodermal part directly attached to each other (Figure 3[href=https://www.wicell.org#fig3]H). Use a 1 mL pipette to transfer those organoids to 10 cm petri dishes containing 10 mL fresh ND medium for long-term culture (10–15 organoids per dish). If organoids do not fit into the pipet tip, cut the tip using sterile scissors to create a wider opening",
    "Place petri dish with organoids for long-term culture on a 2D-rocking plate (we use a 2D rocker, tilting angle 8°, 15 rpm) in a humidified incubator at 37°C (5 % CO2 and 20 % O2).\nCritical: If more than 15 organoids are cultured per 10 cm petri dish, organoids tend to cluster together upon culturing.\nCulture organoids until they reach the desired maturation stage at 37°C (5 % CO2 and 20 % O2). A dense vascular network establishes already after 10–20 days in co-culture, neural organoid maturation can take more than 100 days (e.g. for the induction of astrocyte, oligodendrocytes or specific neuronal subtypes)\nCritical: Long culture time with regular medium changes is required to reach organoid maturation. Work as sterile as possible to avoid contaminations. We usually add Penicillin/Streptomyocin solution to the NDM to further reduce the risk of bacterial growth.\nNote: During the maturation phase, a daily medium change is not necessary. We use 10 cm petri dishes with 10–15 organoids each and change medium every other day. The frequency of required medium changes depends on the number of organoids per petri dish and the organoid size (which depends on the time in culture).\nCritical: Change medium regularly. Otherwise, organoids start to die or develop large apoptotic core regions. Monitor the pH indicator in the cell culture medium daily. If necessary, increase the frequency of medium changes or reduce the number of organoids per petri dish accordingly.\nAnalyses of Vascular Network Formation and Organoid Morphology",
    "Analyze vascularized neural organoids at different time points of differentiation (e.g. 20, 50 and 100 days in co-culture) to check for vascular network formation and tissue morphogenesis. In the following paragraph, we will present two suitable methods for organoid assessment: 1) paraffin sections and 2) tissue clearing analyses. Method 1 delivers detailed information about tissue morphogenesis and method 2 provides a 3-dimensional impression of the whole organoid structure and vascular network.\nParaffin Sections and Histological Analyses\nTiming: 1 week\nSample Preparation\nHarvest organoids after the desired culture time (e.g. 20 days in co-culture)\nTransfer 5–10 organoids into a 2 mL reaction tube and wash 5 min with PBS\nReplace PBS by 4 % PFA in PBS and incubate over night at 4°C on a mini tube rotator or laboratory rocker\nDiscard the PFA\nWash again 3 x 5 min with PBS\nWhilst washing prepare 1 % agarose gel\nBoil 1% agarose in water using e.g. a microwave oven\nLet liquid agarose gel cool down to ca. 60°C\nTransfer organoids into Tissue-Tek Cryomolds and remove PBS (Figure 4[href=https://www.wicell.org#fig4]A)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig4.jpg\nFigure 4. Paraffin Embedding of Organoids\n(A) Organoids placed into a cryomold.\n(B) Organoids in cryomold embedded in 1% agarose.\n(C) Agarose block with organoids removed from cryomold using a spatula.\n(D) Tissue cassette.\n(E) Agarose block with organoids embedded in paraffin ready for sectioning.\nCover fixed organoids with 250- 500 μL liquid 1 % agarose gel (Figure 4[href=https://www.wicell.org#fig4]B)\nLet agarose solution cool down until gel gets solid (ca. 15 min)\nRemove agarose block containing organoids from the Cryomold (Figure 4[href=https://www.wicell.org#fig4]C) and place sample in a tissue cassette (Figure 4[href=https://www.wicell.org#fig4]D).\nStore in 70% ethanol until further processing\nParaffin Embedding and Sectioning\nFor paraffin embedding use a tissue processor (e.g. Leica TP1020) with the following program\n70% ethanol for 30 min",
    "70% ethanol for 30 min\n80% ethanol for 1 h\n96% ethanol for 1 h\n99% ethanol for 1 h\n100% 2-propanol for 1h\n100% 2-propanol for 1h\n100% 2-propanol for 1h\n99.9% Xylol for 1h\n99.9% Xylol for 1h\n99.9% Xylol for 1h\nParaffin for 3h\nParaffin for 3h\nUse a heated paraffin embedding station to embed samples into a paraffin block (Figure 4[href=https://www.wicell.org#fig4]E)\nCut 5 μm sections using a sliding microtome (we use a Leica SM2010 R)\nTransfer sections on microscope slides (we use SuperFrost Microscope Slides, Thermo Scientific)\nLet sections dry 17–20 h at 37°C in a lab oven\nNote: Cryosectioning can be performed as well, however, we strongly recommend paraffin sectioning as it better preserves morphological details.\nDeparaffination\nPlace the specimen slides in a vertical staining cuvette.\nDeparaffination is achieved by incubation in a descending alcohol series\n2x 10 min 99.9% Xylol\n2x 5 min 99 % EtOH\n5 min 96 % EtOH\n5 min 80 % EtOH\n5 min 70 % EtOH\n5 min dH2O\nFor heat-induced antigen retrieval, an acidic buffer (10 mM citric acid buffer (pH 6)) is used\nPlace the slides in a vertical staining cuvette and cover with citrate buffer. Heat up using a microwave oven until the buffer is boiling, cool down for 1 min\nRepeat 6 times a 10 s boiling phase followed by 1 min cool down\nLast cool down for 30 min\nWash 5 min with running dH2O\nWash 3x 5 min with PBS\nProceed with immunofluorecence analyses",
    "Note: Antigen retrieval is required for immunofluorescence analyses but not for HE staining. Heat-induced antigen retrieval with citric acid buffer works well for the antibodies suggested in this protocol. However, if you use alternative antibodies these may require other antigen retrieval methods or buffers. Recommendations are usually provided by the distributor.\nHE Staining and Immunofluorescence Analyses\nTo analyze organoid tissue morphology, histological stainings and immunofluorescence analyses can be performed. We recommend to perform HE staining to get a general idea of the tissue morphology (Figures 5[href=https://www.wicell.org#fig5]A and 5B) and immunofluorescence analyses to detect specific structures (Figures 5[href=https://www.wicell.org#fig5]C–5F). Recommended antibodies are CD31 for the detection of endothelial cells, SMA or NG2 marking peri-endothelial cells, Collagen I and Collagen IV antibodies detecting extracellular matrix, MAP2 or TUJ1 marking neurons and Sox1 for the detection of neural stem cells (Figures 5[href=https://www.wicell.org#fig5]C–5F). A list of recommended antibodies can be found in the Key Resources Table[href=https://www.wicell.org#key-resources-table].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig5.jpg\nFigure 5. HE-Stainings and Immunofluorescence Analyses on Organoid Paraffin Sections\n(A and B) HE-stainings. (A) provides an overview and (B) highlights details in higher magnification. The mesenchymal and the neural part are clearly distinguishable by their characteristic morphology.\n(C–F) Immunofluorescence analyses of organoid sections (day 20 of neuro-mesenchymal co-culture) detecting (C) β3-Tubulin (TUJ1) and Collagen I (Col I), (D) CD31 and MAP2, (E) CD31 and smooth muscle actin (SMA), and (F) collagen IV (Col IV) and CD31.\nHE Staining\nPlace the specimen slides in a staining cuvette.\nIncubate 10 min in Mayer's hemalum\nRinse with dH2O\nRinse 10 min under tap water\nRinse with dH2O\nIncubate 10 min with Eosin stain\nRinse with dH2O\nIncubate in 96% Ethanol for 2 min\nIncubate twice in 99% Ethanol for 5 min each\nIncubate twice in 99.9% Xylol for 5 min each",
    "Mount using an appropriate mounting medium (e.g. DePeX or Entellan)\nImmunofluorescence Analyses\nOptional: Encircle the organoid sections using a PAP-Pen to save antibodies\nIncubate specimens in blocking buffer for 1 h at 20–23°C\nWhilst blocking buffer is incubating prepare the antibody solution in blocking buffer (e.g. for the detection of endothelial cells and neurons we use CD31 antibody (DAKO, M0823, dilution: 1:200) and MAP2 antibody (abcam, ab32454, dilution: 1:1000))\nNote: More recommended antibodies can be found in the Key Resources Table[href=https://www.wicell.org#key-resources-table].\nReplace blocking buffer with antibody solution and incubate at 4°C for 17–20 h in a humidified chamber\nThe next day, remove primary antibody solution and wash specimen 3x 5 min with PBS\nMeanwhile prepare the secondary antibody solution in PBS (e.g. goat anti mouse Cy3 (1:600) and goat anti rabbit Cy2 (1:300))\nIncubate with secondary antibody solution for 1 h at 20–23°C\nDiscard secondary antibody solution and wash 3x with PBS\nIncubate specimen with DAPI staining solution (DAPI stock solution 1:5000 in PBS) for 10 min at 20–23°C\nDiscard DAPI staining solution and wash 3x 5 min with PBS\nMount the sections in Mowiol or another suitable mounting medium and cover with a coverslip\nAnalyze and document specimens under the fluorescence microscope\nTissue Clearing to Visualize Vascular System\nTiming: 1 week\nTissue clearing results in completely transparent organoids for microscopic analyses (Figure 6[href=https://www.wicell.org#fig6]A). To highlight specific structures of interest, such as endothelial networks, whole-mount immunostaining with specific antibodies (e.g. CD31) is performed (Figures 6[href=https://www.wicell.org#fig6]B–6D, Video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig6.jpg\nFigure 6. Tissue-Cleared Organoids for Vascular Network Assessment\n(A) Representative organoids before and after tissue clearing.",
    "(B) Maximum intensity projection of z-stack images from a cleared organoid (day 20 of neuro-mesenchymal co-culture) in low magnification. The endothelial network is detected using CD31 antibodies (red). Neural cells were derived from GFP-labeled iPSC line to highlight the neural part (green).\n(C) This image shows only the CD31+ endothelial network.\n(D) Maximum intensity projection of z-stack images of a cleared organoid in higher magnification highlighting a neuroepithelial structure with ventricle-like lumen surrounded by a CD31+ endothelial network.\nHarvest organoids after the desired culture time (e.g. 20 days in co-culture)\nTransfer organoids into a 2 mL reaction tube and wash 5 min with PBS\nReplace PBS by 4 % PFA and incubate 17–20 h at 4°C\nWash organoids for 1 h in PBS\nWash organoids 30 min in PBS\nIncubate in 50 % MeOH (in PBS) for 30 min\nIncubate in 80 % MeOH (in PBS) for 30 min\nIncubate in 100 % MeOH for 30 min\nAdd fresh 100 % MeOH and incubate organoids 17–20 h at 4°C\nMake organoids accessible for antibodies\nWash twice with 20 % DMSO (in MeOH) for 30 min\nWash with 80 % MeOH (in PBS) for 30 min\nWash with 50 % MeOH (in PBS) for 30 min\nWash with PBS for 30 min\nWash twice with 0.2 % Triton X-100 (in PBS) for 30 min\nIncubate organoids in penetration buffer 17–20 h at 37°C\nBlocking of non-specific antibody binding sites\nIncubate organoids in blocking buffer 17–20 h at 37°C\nPrimary antibody treatment\nWash twice with washing buffer for 1 h each\nIncubate organoids with 100–200 μL primary antibody (to detect vascular networks we use CD31 antibody (DAKO, M0823) in a 1:200 dilution) in antibody buffer for at least 24 h at 37°C\nSecondary antibody treatment and nuclear staining",
    "Wash 10 times with washing buffer for 30 min each\nIncubate organoids in 100–200 μL antibody buffer + secondary antibodies + DAPI (1 μg/mL) for 17–20 h at 37°C\nDehydration\nNote: Adjust pH of each solution to 9–9.5 with Triethylamine\nWash 3 times with washing buffer for 30 min\nWash 3 times with 30 % 1-Propanol (in dH2O, pH 9–9.5) for 30 min\nWash 3 times with 50 % 1-Propanol (in dH2O, pH 9–9.5) for 30 min\nWash 3 times with 70 % 1-Propanol (in dH2O, pH 9–9.5) for 30 min\nWash 3 times with 100 % 1-Propanol (99.7 % anhydrous, pH 9–9.5) for 30 min\nRemove remaining 1-Propanol with a pipette and the rest with a filter paper\nIncubate organoids in ethyl cinnamate for at least 1 h before microscopy\nStore organoids in an Eppendorf tube with ethyl cinnamate at 4°C protected from light\nNote: All incubation steps are performed on a mini tube rotator or laboratory rocker. If not otherwise stated, incubation is at 20–23°C. Steps with 17–20 h incubation time can be also performed over the weekend, but always at 4°C. After starting the secondary antibody incubation, keep organoids protected from light. Once the organoids are transferred in ethyl cinnamate, they can be stored for several weeks at 4°C in the dark until microscopy. We use a custom-made glass bottom imaging chamber (Figure 7[href=https://www.wicell.org#fig7]). Similar imaging chambers are also commercially available (e.g. Attofluor Cell Chamber, Invitrogen or CytoVista imaging chamber, Invitrogen). We use a confocal laser scanning microscope (Nikon Eclipse Ti) with long working distance air objectives (4x, 20x) for taking z-stack images. Fiji (ImageJ) or the Nikon NIS Elements Confocal software are used for 3-D reconstruction of imaged organoids.\n        Your browser does not support HTML5 video.",
    "Video S1. 3D-Reconstruction of the Endothelial Network in Vascularized Neural Organoids\nThe endothelial network within a vascularized neural organoid was visualized using immunofluorescence analyses with a specific antibody targeted against CD31 (red). The neural aggregate was generated from a GFP-labeled iPSC line (green). A whole-mount staining was performed and the tissue was subsequently cleared using ethyl cinnamate. The video shows a 3D-reconstruction of a confocal z-stack.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/88-Fig7.jpg\nFigure 7. Custom-Made Imaging Chamber\n(A) Assembled custom-made imaging chamber with glass bottom for imaging of cleared organoids under the confocal laser scanning fluorescence microscope.\n(B) Disassembled imaging chamber consisting of top and bottom part (steel) with fine thread, seal ring and glass coverslip."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Organoids",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}