{
  "id": 5435,
  "origin_website": "Bio",
  "title": "3D Stroma Invasion Assay",
  "procedures": [
    "Preparation of a 3D fibroblast-produced matrixSeed fibroblasts at a density of 3 x 106 cells per well of a 2 well-chamber slide to form the control 3D matrix and a mixture of fibroblasts and tumor cells at a density of 3 x 106 fibroblasts and 0.5 x 106 tumor cells per well to form the desmoplastic 3D matrix in DMEM and RPMI (1:1) containing 10% FBS, 2 mM L-glutamine, 100 U/ml penicillin and 100 µg/ml streptomycin.Incubate the cells at 37 °C in a 5% CO2 humidified environment until confluent.Once a confluent monolayer is formed, treat the cultures with 3 ml of 25 µg/ml ascorbic acid every other day for an additional 10 days to induce the production of a 3D matrix, maintaining the cells at 37 °C in a 5% CO2 humidified environment. The medium should be changed every other day with fresh medium containing 25 µg/ml ascorbic acid. The cells may be treated for longer than 10 days if a thicker and denser matrix is desired. Extracellular matrix components such as collagen I and fibronectin can be used to visualize the 3D matrix (Figure 1). All fibroblasts would respond to ascorbic acid treatment; however, the thickness, density and organization may vary among different types of fibroblasts.Note: Fresh ascorbic acid solutions should be prepared every other day since ascorbic acid in solution decays over time.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170315/20170315030536_7991.jpgFigure 1. Fibronectin immunostaining with mouse anti-fibronectin evidencing 3D matrix formation in a 3D stromagenic model. Scale bar = 20 μm.Cell invasion assayTransfect colorectal tumor cells with the GFP plasmid using FuGENE® HD transfection reagent (500 µg of plasmid in a total volume of 2 ml) and incubate the cells at 37 °C in a 5% CO2 humidified environment for 48 h, according to the manufacturer’s instructions.",
    "Note: It is highly recommended for the first experiment to test the best confluence at which the cells should be transfected. This would entail seeding cells at increasing densities, for example at 30%, 50%, 75% and 90% confluence, in order to test which confluence provides the highest transfection rate. We established that for us 75% confluence provided the highest transfection rate.Remove the GFP transfected cells from the culture dish using trypsin/EDTA and seed 1 x 106 tumor cells onto the 3D stromagenic systems prepared in item A (both experimental and control systems – see Notes below).Allow the GFP positive cells to migrate for 1 h, maintaining the cells at 37 °C in a 5% CO2 humidified environment after which the invading cells can be imaged using time-lapse confocal microscopy.Carry out the time-lapse analysis using a scanning confocal inverted microscope. Time-lapse images can be captured every minute for a total of 15 to 30 min to enable the investigator to see the movement of the tumor cells invading the 3D matrix.Z-stacks should be obtained throughout the thickness of the 3D matrix at the end of the 2 h period to verify the depth to which the cancer cells invaded, as previously described (Coulson-Thomas et al., 2011; de Paula et al., 2012). Z-stack projections using the z-axis as reference can be made using any imaging software, such as Image Processing and Analysis with Java ImageJ and the Zen Imaging software from Zeiss."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}