{
  "id": 18446,
  "origin_website": "Jove",
  "title": "Generation of Microtumors Using 3D Human Biogel Culture System and Patient-derived Glioblastoma Cells for Kinomic Profiling and Drug Response Testing",
  "procedures": [
    "NOTE: All xenograft therapy evaluations were done using an orthotopic tumor model for glioblastoma on a protocol approved by the Institutional Animal Care and Use Committee.\n1. Isolation of Patient-derived GBM Xenograft Cells\nPreparation of Reagents\nRe-constitute collagenase-I in sterile water to a concentration of 5 mg/ml and sterile filter. Store in 1 ml aliquots at -20 °C (final concentration is 50 µg/ml in 100 ml enzyme solution).\nDissolve 100 µg Epidermal Growth Factor (EGF) in 2 ml sterile Phosphate-Buffered Saline (PBS). Store in 100 µl (5 µg/100 µl) aliquots at -20 °C for a final concentration of 10 ng/ml.\nDissolve 100 µg FGF-β in 2 ml sterile PBS. Store in 100 µl (5 µg/100 µl) aliquots at -20 °C for a final concentration of 10 ng/ml.\nAdd the following to one 500 ml bottle of Neurobasal Media (NBM) to prepare complete NBM: 10 ml B-27 supplement without vitamin A, 5 ml N2 supplement, 100 µl EGF, 100 µl Fibroblast Growth Factor (FGF)-Basic, 5 ml amphotericin B, 0.5 ml gentamycin, 5 ml L-glutamine.\nPrepare fresh enzyme solution by combining: 98.5 ml PBS, 1 ml collagenase-1, 0.5 ml 10x trypsin/EDTA and sterilize by filtration through 0.22 µm pore filter.\nPrepare or obtain a small volume sterile Dulbecco's Modified Eagle Medium (DMEM)/F12 cell culture medium with 7% fetal bovine serum (FBS) and 1x PBS without calcium or magnesium.\nTumor Disaggregation\n\tNOTE: Athymic nu/nu mouse previously injected with tumor cells in the right flank and allowed to from a palpable tumor mass is necessary for this procedure. In the examples shown here, we used patient-derived xenograft GBM cells, JX10 and JX1217.\n\t\nSterilize work area by spraying 2% chlorhexidine and set up work area with necessary instruments/supplies including disposable chuck, forceps, scalpel, glass Petri dish, enzyme solution, PBS, and chlorhexidine (See Figure 2A).",
    "Euthanize mouse/mice harboring a flank tumor. Aim for a 20%/min displacement rate of CO2 using 30% CO2. After the mouse shows respiratory arrest, maintain CO2 flow for about 1 min (typically 3 min total). Mice are removed from the chamber and cervical dislocation is performed as a secondary euthanasia confirmation. Spray the animal with 3% chlorhexidine to sanitize skin.\nWhile holding the mouse steady, make semi-circular skin incision ~ 1.5 cm from tumor mass (flank implanted tumor) using a sterile disposable scalpel with #11 blade beginning cranial to the tumor mass and incising toward the belly of the mouse and around to the caudal end.\nReflect skin over tumor mass using fingers with gentle traction on caudal end of the incision and then push on skin surface to elevate tumor to have best access without touching the tumor (See Figure 2B).\nUse blunt dissection with forceps to gently free tumor mass from peritoneal wall and from skin (See Figure 2C).\nTransfer tumor mass with forceps to sterile glass Petri dish (DO NOT use plastic dishes to prevent breaking during mincing) and properly discard carcass and place these instruments aside.\nUse new set of sterile instruments (scalpel with #11 blade, semi-curved forceps) to debride tumor tissue of necrotic tissue and membranous host connective tissue covering tumor.\nPlace 15 ml enzyme solution in a sterile vented-trypsinizing flask with stir bar and begin stirring slowly in the hood.\nIn a sterile glass Petri dish, wash harvested tumors 3 - 5 times with sterile PBS to remove excess blood (may pour or use syringe to rinse them with the PBS). Gently tilt dish and pipet or aspirate the wash material. Mince finely using two #11 scalpel blades (See Figure 2D).",
    "Add 14 ml of enzyme solution to minced tumor and pipet gently up and down 2 - 3 times. Transfer mixture to vented-trypsinizing flask and stir slowly for 20 min. Prepare 5 50 ml conical tubes by adding 1.5 ml FBS to each in order to neutralize the trypsin in step 1.2.11.\nAfter 20 min, collect 14 ml of cell solution from trypsinizing flask and add to one tube with FBS. Add 14 ml fresh enzyme solution to flask and continue stirring.\nCentrifuge collected cells at 150 x g for 8 min at room temperature and discard the supernatant. Add 45 ml of complete NBM to the pellet, mix gently, and repeat centrifugation to rinse out serum. Re-suspend pellet in 5ml complete NBM and hold on ice.\nRepeat cell harvest steps for a total of 5 harvests, combining all harvested-cells in a single conical tube on ice.\nPlace a 40 µm cell strainer on the top of a 50 ml conical tube. Prep the cell strainer by passing 10 ml of DMEM/F12 + 7% FBS through and then washing with 10 ml PBS.\nSlowly add cell suspension to strainer, allowing it to drip through (See Figure 2M). Gently lift the tab of the cell strainer in between each new addition to break any vacuum and allow the suspended cells to pass freely (See Figure 2N).\nCentrifuge the filtered cell suspension as above. Re-suspend in 10 ml complete NBM and count to determine total number of viable cells using 0.04% trypan blue and a hemocytometer. Hold cells on ice until microtumor generation.\n2. Alternate Tissue Disaggregation Protocol\nAutomated tissue dissociator and disaggregation system.",
    "Place the disaggregation tube into the cellular dissociator, select the program \"Tumor _02_02\" and press start and run for 32 sec. Transfer tube to rotator, place in 37 °C incubator for 40 min.\nCentrifuge suspended-cells at 150 x g for 8 min at room temperature and discard the supernatant. While centrifuging the cells, set up reagents for the processing of the cell suspension. Add 10 ml serum-free NBM and gently triturate suspension.\nAfter centrifugation, obtain a cell pellet containing ~ 10 - 30 x 106 viable cells (~ 0.3 ml). Re-suspended the pellet in 10 ml serum-free NBM (See Figure 2O). Determine the viable cells by exclusion assay (See Step 3.2.2).\n3. Microtumor Generation\nPreparation of Reagents\n\t\nPrepare complete NBM as in 1.1.4 and prepare neutralized High Density human biogel (HuBiogel) (HDHG at 3 mg/ml) per internal protocol. Similar biogel matrices can be used as well.\nMicrotumor Production and Culture\n\t\nObtain freshly dissociated PDX cells as single cell suspension in complete NBM, on ice.\nMix the cell suspension with an equal volume of trypan blue solution (0.4% in PBS) and analyze using hemacytometer to determine cell number and viability by trypan blue exclusion18. Remove volume necessary to generate 50,000 cells/microtumor where volume = (50,000 cells/tumor * # tumors)/(viable cell count / 1 ml) and place into a fresh conical tube.\nConcentrate cells by centrifugation at 150 x g, for 8 min, at room temperature. Discard the supernatant and resuspend the cell pellet with ice-cold HDHG solution in a final ratio of 1 part cells in FBS and 4 parts HDHG.\nUse an electronic multichannel pipette to dispense 10 µl per pin cell-HDHG mixture onto a 96-pin steel plate (with hydrophobic coating) to generate microtumors (2 mm beads each containing 50,000 cells).",
    "Place 3D tumor beads inside tissue culture incubator (37 °C, 5% CO2, humidified) for 15 min to gelate the beads.\nAfter gelation, transfer the microtumors (10 µl) to a custom suspension culture chamber (50 ml) or large volume culture dish (10 cm) containing complete NBM using the electronic multi-channel pipette and custom pin-device.\nAfter 1 - 2 days in tissue culture incubator, transfer microtumors to 96-well culture plates containing 50 µl NBM/well using a wide-mouth dispensing pipette and perform various assay and analysis protocols.\nDrug Treatment and Maintenance of microtumors\n\t\nSelect final concentrations for drug testing.\n\t\tNOTE: If the drug has known efficacy in 2D culture, select 2x the IC50 as the middle dose concentration and select 3-fold serial dilutions above and below for a total of 5 dose levels. For example, if the IC50 is 9 µM for the drug in 2D culture, select 2 µM, 6 µM, 18 µM, 54 µM, and 162 µM as final concentration for drug testing.\nPrepare 2x drug dosing solution in complete NBM from dimethyl sulfoxide (DMSO) stock. Dilute dosing solution in 1% DMSO medium to prepare a 5 dose, 3-fold serial dilution.\nAdd 50 µl of dosing solution to the microtumor well containing 50 µl in assay plates to achieve a final DMSO concentration of 0.5%. Repeat for each replicate (e.g., 4) at each drug dose determined in 3.3.1.\nMaintain cultures in 37 °C, 5% CO2, humidified tissue culture incubator for 1 - 14 days. Feed cultures twice weekly by refreshing media and drug solution as above.\n4. Morphological and Phenotypic Analysis of Microtumors\nDetermine cell morphology in microtumors using standard live-cell staining.\n\t\nPrepare 1 mM stock of Calcein-AM in DMSO. Aliquot and store at -20 °C.",
    "At desired culture intervals (1, 7, and 14 days), add Calcein-AM solution prepared in PBS (without Ca/Mg) to 96-well plate for 1 µM final concentration.\nIncubate 20 min in a 37 °C, 5% CO2, humidified incubator, and image using a fluorescence microscope at 2X, 4X, and 10X (excitation: 450 - 490 nm band pass, emission: 515 nm long pass, dichroic 500 nm).\nMicrotumor Growth/Proliferation Assay\n\t\nDissolve MTT powder in PBS (without Ca/Mg) to prepare 12 mM stock. Sterile filter, aliquot, and store at -20 °C.\nAt desired culture intervals (1, 7, and 14 days), add 20 µl of MTT solution to 96-well plate per 100 µl culture volume. Incubate 2 hr in tissue culture incubator.\nPrepare fresh lysis solution of 10% SDS in 0.01 M HCl and add equal amount to culture volume to plates. Incubate sealed plates overnight in 37 °C incubator.\nRead absorbance at 570 nm using a multi-plate reader.\nMicrotumor Preparation for Kinomic Analysis\n\t\nPrepare lysis buffer by pre-chilling to 4 °C and then adding a 1:100 ratio each of 100x Protein Phosphatase Inhibitor (PPI) and 100x Protein Protease Inhibitor (PI). Mix well and keep on ice.\nTransfer 2 microtumors to each of three 1.5 ml microcentrifuge tube. Remove supernatant and add 40 µl of lysis buffer containing PPI and PI to each tube and lyse for 30 min at 4 °C.\nPipette samples vigorously to break tumor beads. Centrifuge at 16,000 x g for 10 min at 4 °C and store samples at -80 °C until kinomic analysis.\n5. Kinomic Profiling of Microtumors\nProtein Tyrosine Kinase (PTK) profiling",
    "Thaw reagents (10x Protein Kinase (PK) buffer and 2% bovine serum albumin (BSA)) to 4 °C Load PK buffer (300 µl 10x PK buffer stock in 2.7 ml dH2O) into syringe in position # 2 on the profiling platform.\nOpen the kinase assay software program and load the PTK protocol file and press 'START', annotating samples within software program after scanning chips. Place chips onto profiling platform and load 25 µl of 2% Bovine Serum Albumin (BSA) per array and then press LOAD to begin the software-controlled protocol blocking step.\nDilute 6 µM of 100 mM ATP stock with 54 µl dH2O to make 10 mM adenosine triphosphate (ATP). When the software begins the 3rd, and final wash step (visible on screen) bring 15 µg of lysate brought up to 28 µl with dH2O, mix and add to array.\nPrepare PTK master mix (MM) (for up to 12 samples). Add 32.6 µl dH2O to reconstitute dithiothreitol (DTT) and add 6 µl DTT, and 60 µl 10x PK solution, to PTK-MM1 tube (already contains 60 µl 10x BSA).\nWait until 'Load' prompt in the kinase assay software appears then add 126 µl of PTK-MM1, 60 µl PTK additive, and 60 µl 10 mM ATP to MM2 (contains previously aliquoted 4.5 µl PY20 FITC antibody) and mix. Add 16 µl of this PTK master mix to each sample lysate tube and pipette mix 5 times.\nEnsure cover glass is clean and then add 35 µl lysate/master mix per array, close carousel lid, and press LOAD button.\nSerine/Threonine Kinase (STK) Profiling:",
    "Thaw reagents (10x PK buffer, 10x STK buffer, and 2% BSA) to 4 °C. Load PK buffer (300 µl in 2.7 ml dH20) into syringe position # 1, 1:10 and STK buffer (300 µl in 2.7 ml dH20) into syringe position # 2.\nOpen the kinase assay computer software program and load the STK protocol file and press START, annotating samples within the program after scanning chips. Place chips onto profiling platform and load 25 µl of 2% BSA per array, and then press LOAD to begin the software-controlled protocol blocking step.\nDilute 6 µM of 100 mM ATP with 54 µl dH2O. During final (3rd) wash step mix 2 µg of lysate and bring up to 32.6 µl with dH2O, mix and add to array.\nMake STK master mix: Add 70 µl 10x PK to STK-MM1 tube (contains 7 µl 100x BSA), and then add 42 µl dH2O to STK-MM1 tube.\nWait until 'Load' prompt in the kinase assay software then: Add 18 µl 10 mM ATP to STK-MM1, and add 9 µl MM1 to each sample lysate. Mix well.\nEnsure cover glass is clean and add 35 µl lysate/master mix per array, close carousel lid, and press LOAD.\nDuring Final (3rd) Wash Step add 1.05 µl STK-FITC secondary antibody to DMAB tube (contains 3.03 µl STK primary antibody mix), add 39.6 µl AB Buffer to DMAB, add 356.0 µl dH2O to DMAB, add 30 µl to DMAB to each array, and press LOAD.\nAnalysis of Kinomic Data 19,20\nOpen analysis software and load the Image Analysis App. Select image folder containing barcoded and time-stamped whole array images for PTK or STK data, select article number matched array layout file (86312 for PTK and 87102 for STK), and load previously generated array annotation File.",
    "Verify correct gridding of all images, and run Exposure Time Scaling App. Statistically compare exposure/slope log2 transformed values, and validate with prewash kinetic curves19-21.\nRun upstream kinase prediction software to query altered kinomic profiles between conditions for upstream kinases22,23.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}