{
  "id": 16143,
  "origin_website": "Jove",
  "title": "Use of Microscale Thermophoresis to Measure Protein-Lipid Interactions",
  "procedures": [
    "1. Preparation of materials\nPrepare phosphate buffered saline (PBS): 137 mM NaCl, 2.5 mM KCl, 10 mM NaH2PO4, and 2 mM KH2PO4, pH 7.41.\nPrepare NTA-Atto 647 N dye. Dilute stock NTA-Atto 647 N dye to 100 nM from a 100% DMSO solution into PBS without Tween.\nExpress Vam7-His8 – Protein as a fusion protein in E. coli and purify using Ni-NTA and size exclusion chromatography8.\nTitrate the analyte in PBS buffer. If the analyte is in a different buffer, labeled MST is not particularly sensitive to minor buffer differences from molecules such as DMSO, unless contents of analyte buffer interact with labeled protein.\n2. Preparation of the MST device\nTurn on the power switch on the back of the device.\nOpen the control software and ensure that the laptop is on and in connected status on the computer attached to the device.\nEnter fluorescence and MST settings for this experiment. Set MST Before to 3 s, MST on 30 s, and Fluorescence recovery (Fluo.) after 1 s. Before measures initial fluorescence and does not require long times; MST is the actual amount of time for equilibrium to be reached after heat induction.\nTable of Capillaries: For each capillary tube, enter the name of the target (ligand), the name of the ligand (analyte), the concentration of the target, and the highest titration concentration and use autofill titration ratio. For example, enter 50 nM for the target concentration of Vam7-His8, Vam7-His8 for target name, (1,2-dioctanoyl phosphatidic acid) Di-C8 PA for ligand name, and the highest concentration the ligand selecting 1:1 and dragging down to autofill slots 2-16.",
    "Run a Cap Scan to select the appropriate LED (20% LED (preset)) based on the signal of the target protein and adjust between 200 and 2000 fluorescence units for labeled MST. Cap Scans should show uniform rounded bell-shaped peaks.\nSelect a range of MST powers and enter values for each to test for the most robust binding fit and hit Start Cap Scan + Measurement, scanning different values to determine best operating conditions for given interaction being tested.\nDetermine the MST power with a best fit using the analysis software and the preset for thermophoresis with Tjump. Analyze fits according to most fluorescence separation between lowest and highest concentration as compared to the MST power with best fit and select the MST power for replicate trials.\nDetermine whether photobleaching has occurred between first and second run by going to the analysis software and switching the analysis to expert mode. Next, select fluorescence instead of thermophoresis for analysis. Select expert mode and then photobleaching.\n3. Preparation of samples for labeled MST\nBring the Vam7-His8 solution to a concentration of 200 nM in PBS without Tween.\nBring the NTA-Atto 647 dye to 100 nM in PBS without Tween.\nMix the Vam7-His8 and NTA-Atto 647 dye at a 1:1 volumetric ratio and allow to sit at room temperature covered from light for 30 min. Determine the appropriate concentration of target protein as in section 2.5 (see Supplement on utilization of KD of Ni-NTA dye as demonstrated in video).\nCentrifuge mixture of NTA-Atto 647 N dye and protein for 10 min in a dark room using a tabletop centrifuge at approximately 8,161 x g.\nStore mixture at 4 °C after the experiment or on ice during the experiment for reuse within a few hours if needed in order to keep protein from denaturing.",
    "Use the NT concentration finder to determine concentration range needed for titration.\nBring Di-C8 PA to appropriate maximum concentration in water.\nTitrate the analyte using a 1:1 serial dilution in PBS buffer for 16 concentrations based on the previous step. Unlike SPR, thermophoresis is not as sensitive to buffer differences.\n4. MST of samples\nTurn on the device and the attached laptop.\nPress the up arrow on the front of machine and slide the capillary rack out.\nLoad capillaries in the rack with the highest concentration at position 1.\nIn the control software, select the Red Channel corresponding to NTA-Atto 647 N.\nEnter concentration, position, and name information for each capillary in the Table of Capillaries.\nRun a capillary scan by hitting Start Cap Scan at 20% LED (preset) and adjust according between 200 and 2000 fluorescence units using either LED intensity settings or concentration of ligand (labeled protein).\nSelect a range of MST power.\nStart Cap Scan + MST Measurement.\nAnalyze using the analysis software.\n5. Analysis of MST data\nNOTE: The analysis software provided by Nanotemper is proprietary and is performed using M.O. Affinity Analysis. There are different ways to measure binding affinities based on either fluorescence or thermophoresis. Newer versions of this software are preset to automatically evaluate data using thermophoresis and are preset to use Thermophoresis with Tjump taking advantage of both measurements. Alternatively, one can select either Tjump alone or Thermophoresis alone. Additionally, the analysis software allows estimated affinity measurements using initial fluorescence. These settings can be accessed in expert mode only.",
    "Set the evaluation strategy in the analysis software to expert by clicking the box for the lightning bolt next to a data set in the Data Selection screen. The Analysis Software is preset to analyze to MST Analysis; however, a researcher can select Create New Analysis and select Initial Fluorescence Analysis in order to estimate binding affinities based on initial fluorescence. Expert mode is also available for initial fluorescence. In the analysis described below, thermophoresis and Tjump was used to determine the KD of the presented of Vam7-His8 with its natural substrate, the lipid phosphatidic acid.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}