{
  "id": 7690,
  "origin_website": "Bio",
  "title": "Human Skin Explant Preparation and Culture",
  "procedures": [
    "Solution PreparationNote: The following steps should be completed in a biosafety cabinet with laminar flow to maintain sterility. Wipe all containers and reagents with 70% ethanol prior to placement in the laminar flow tissue culture hood and use sterile technique during all steps. Wash buffer (see Recipe 1)Prepare wash buffer by diluting 100× penicillin–streptomycin–glutamine (100×) 1:100 in 1× PBS.Culture medium (see Recipe 2)Skin PreparationNote: Surgically excised skin should be maintained at 4 °C and used as soon as possible after removal. Remove subcutaneous fat from skin using forceps and wash with PBS containing 1× concentration of penicillin–streptomycin–glutamine (Shannon et al., 2022).Use a scalpel to carefully trim off laser-cut edges from surgical excised skin sample.Prepare 12-well culture plates with 0.5–1.0 mL of EpiLifeTM CF media (supplement free) with 2 cm × 2 cm surgical gelatin sponge. Allow foam to absorb media (MacLeod et al., 2013; Shannon et al., 2022). The culture media should completely saturate the surgical sponge and fill the well by approximately 25%.Cut tissue into 1 cm × 1 cm squares and place skin, dermis side-down, on gelatin sponge squares pre-saturated with culture media (prepared in step B3). Ensure the epidermis maintains an air interface and that the dermis has contact with the media-soaked sponge. The tissue should not be submerged in media.Incubate tissue at 37 °C and 5% CO2.Change media every 2–3 days by aspirating media from the well using a 1 mL sterile serological pipette. Avoid any contact between the aspiration tip and the gelatin sponge by gently tilting the plate to pool media from the bottom. Add fresh media to the well without disturbing the gelatin sponge and skin explant and ensure that the skin maintains in air–liquid interface.Skin explants can be maintained in this fashion for up to four weeks (Companjen et al.",
    ", 2001; Steinstraesser et al., 2009).Note: Successful use of skin explant for wound healing studies has been reported up to two weeks, though epidermal thickening is evident in ex vivo skin cultures within the first week (Xu et al., 2012; Neil et al., 2020), and epidermal barrier function is reported to remain intact for up to four weeks (Steinstraesser et al., 2009). However, tissue viability decreases over time. It is important to optimize culture conditions and experimental parameters. Ex vivo WoundingTo generate ex vivo wounds, hold scissors vertically to inflict 20–30 cuts to skin tissue. Do not mince the tissue: these wounds should be shallow, and each cut should be approximately half the length of the explant.Note: Incisional wounds may not be immediately obvious by the naked eye. Wounded samples should be collected within 24 h using Trizol reagent for RNA extraction or snap frozen in OCT compound for immunofluorescence staining.Cytokine StimulationIf cytokine stimulation is necessary, prepare media supplemented with cytokines of choice [e.g., IL-1β (Companjen et al., 2001), IL-15, or IL-27 (Suwanpradid et al., 2021)] and add 0.5–1.0 mL per well as described in step B3.Carefully transfer explant to the freshly prepared 12-well plate without allowing media to touch the epidermal surface.Skin can be collected and carefully removed from the gelatin sponge within two days after cytokine treatment.Tissue CollectionImmunostaining Cut tissue into 2 mm × 2 mm squares and place the skin with dermis side down in the bottom of an intermediate Tissue-Tek cryomold.Slowly add OCT compound to cover the tissue sample, avoiding bubbles.Pop any bubbles with a 10 µL pipette tip if necessary.Allow the OCT to settle on a flat surface at room temperature for 10 min.Snap freeze the tissue by resting cryomold on dry ice on a flat surface until frozen.",
    "Store the frozen OCT blocks in a -80 °C freezer until use.For immunostaining, 7–10 µm thick cryo-sections containing both epidermis and dermis are obtained from the OCT blocks using a Cryostat.RNA analysis Mince tissue thoroughly using scissors and transfer minced tissue to a clean microcentrifuge tube containing at least 800 μL of Trizol reagent for each explant.Vortex sample and incubate at room temperature for 5–15 min to allow tissue lysis by Trizol.Centrifuge tubes containing the lysed tissues at 12,000 × g for at least 10 min at 4 °C. Carefully transfer supernatant to a clean tube for standard RNA isolation techniques, such as ethanol precipitation or commercially available kits designed for RNA extraction.Example resultsImmunostaining Following the methods described above, generate ex vivo wounds on human tissue for 24 h and freeze in OCT compound. Warm 8 µm sections to room temperature prior to fixation with 4% paraformaldehyde for 15 min and permeabilization with 0.1% Triton for 15 min.Incubate sections with the rat anti-human Integrin α6 CD49f antibody overnight at 4 °C in a moist chamber.Wash slides with PBS with 0.1% Triton, and incubate for 1 h with Alexa Fluor 647-conjugated goat anti-rat secondary antibody (diluted 1:400).After subsequent washing, stain nuclei using Hoechst diluted 1:10,000 for 10 min.Mount slides using Prolong Gold antifade reagent and cover with a coverslip prior to imaging on a fluorescent microscope (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20220914/20220914234647_2346.jpgFigure 1. Immunostaining for integrin α6 (ITGA6/CD49f, magenta) in human skin explants that were wounded ex vivo and cultured for 24 h. Tissues were sectioned to 8 μm thickness. Scale bars = 50 μm.RT-qPCR Isolate total RNA from Trizol reagent per the manufacturer’s instructions, followed by treatment with DNase I.Quantify RNA using Nanodrop 1000 and generate cDNA using cDNA synthesis kit.",
    "Amplification is detected using Fast SYBR Green Master Mix (Applied Biosystems) or SYBR green blue (PCR biosystems); 10 ng cDNA is used per qPCR reaction.Perform qPCR with the following primers:table:",
    "﻿Gene,Forward (5’-3’),Reverse (3’-5’)\nS100a7,CCTGCTGACGATGATGAA,TGGCTCTGCTTGTGGTAG\nGAPDH,ATGGGAAGGTGAAGGTCGGA,CAGCGTCAAAGGTGGAGGAGT\nUse GAPDH expression as internal control (see primer sequences).Normalize fold changes calculated for gene expression in human samples to untreated or unwounded controls, as indicated. Data are represented as fold change or using ΔΔCt method as indicated (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4514/bioprotoc-12-18-4514-g002.jpgFigure 2. qPCR showing relative mRNA levels of S100a7 in response to ex vivo wounding (W) 24 h after injury (A) or topical treatment with 100 ng of thymic stromal lymphopoietin (TSLP) for 16 hours (B). Data presented are from four independent experiments using two different human donors in technical duplicate. Error bars represent ± SEM. Statistical analysis was performed using the two-tailed unpaired Student’s t-test, under the untested assumption of normality. A p-value of <0.05 was considered statistically significant; **: p < 0.01 and ****: p < 0.0001."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}