{
  "id": 3878,
  "origin_website": "Cell",
  "title": "Integrative modeling identifies genetic ancestry-associated molecular correlates in human cancer",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAssociation of ancestry with somatic alterations: Pan-cancer analysis\nTiming: 2 h\nDownload significantly mutated gene lists for each cancer type defined by MutSig2 (see MC3 mutation call file in key resources table[href=https://www.wicell.org#key-resources-table]) (Bailey et al., 2018[href=https://www.wicell.org#bib5]). Merge them to create a list of significantly mutated genes across cancers.\nCreate a mutation frequency file for each significantly mutated gene by counting the number of samples with one or more single nucleotide variants (SNVs) or small indels (use the MC3 mutation call file, see key resources table[href=https://www.wicell.org#key-resources-table]) and focal copy number amplifications in that gene (use the pan-cancer GISTIC copy number calls, see key resources table[href=https://www.wicell.org#key-resources-table]) across all cancer types.\nNote: we include different somatic mutation types, including SNVs, indels, and focal amplification (defined as log2 copy number ratio >1)\nExclude ancestry-admixed samples (20%<non-EUR ancestry<80%) and genes with less than 30 altered samples in the AFR group.\nNote: We chose the threshold for ancestry-admixed samples to ensure we have enough non-European ancestry samples while excluding samples with a high-degree of ancestry mixture to allow a clear comparison between populations. We found two samples with more than 20% ancestry in more than two ancestry groups (three-way admixed individuals) in TCGA. We included those two samples by associating the percentage of each ancestry with genomic alterations.\nCombine the above file with the TCGA ancestry assignments, clinical data, subtype annotation (key resources table[href=https://www.wicell.org#key-resources-table])\nCode EUR ancestry as 0 and AFR ancestry as 1. Code the somatic alteration status into a binary variable that represents Tumor Mutation Burden (TMB). Samples with one or more mutations have TMB 1, otherwise 0. Perform logistic regression of somatic alteration status on ancestry, controlling for age, gender, and subtype. One could use the following model in R:",
    "[TMB] ~ [ancestry] + [age] + [gender] + [subtype]\nApply Benjamini-Hochberg FDR correction to all the p-values\nRepeat steps 3–6 to analyze somatic alterations between EUR and EAS by coding EUR as 0 and EAS as 1.\nVisualize ancestry-associated genes using a Q-Q plot (see Figure 2[href=https://www.wicell.org#fig2]A in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]))\nRepeat steps 3–8 for each cancer type and perform cancer-type-specific analysis\nNote: Ancestry-specific somatic alterations can be tissue-type specific. For certain cancer types, a large set of sample size for non-European samples is needed to reach sufficient detection power (see Problem 1[href=https://www.wicell.org#sec7.1] and power analysis in the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section below).\nValidate genes identified as ancestry-associated using the admixed individuals excluded from the prior analysis (20%<AFR ancestry<80%). Calculate the Spearman’s correlation between their mutation frequencies and the fraction of AFR or EAS ancestry per individual obtained from ADMIXTURE (Alexander et al., 2009[href=https://www.wicell.org#bib3]) (see ancestry call file in the key resources table[href=https://www.wicell.org#key-resources-table]). Use the Wilcoxon rank-sum test to assess statistical significance.\nDownload the mutational signature file (see key resources table[href=https://www.wicell.org#key-resources-table]). Correlate each mutational signature (SBS1-SBS50) with ancestry, controlling for age, gender, Tumor Mutation Burden (TMB), and subtype, i.e.,\n[mutational signature] ~ [ancestry] + [age] + [gender] + [subtype] + [TMB]\nApply the Benjamini-Hochberg FDR correction to all the p-values from the mutation signature correlations.\nDownload TCGA arm-level somatic copy number alteration calls (SCNAs), genome doubling, aneuploidy scores, and leukocyte fraction or immune infiltration scores (IMS) calculated based on methylation (see key resources table[href=https://www.wicell.org#key-resources-table]). Correlate ancestry with each of these, controlling for age, gender, and cancer subtype, using the following logistic regression model in Python:\n[ancestry] ~ [arm-level SCNA] + [aneuploidy] + [genome doubling] + [age] + [gender] + [subtype]\nApply the Benjamini-Hochberg FDR correction to all these p-values.",
    "Validate genes with ancestry-specific somatic alterations identified from cancer-type-specific analysis (FDR < 0.1) by comparing alteration frequencies in AFR vs. EUR and EAS vs. EUR using Fisher’s exact test, in an independent cancer cohort (e.g., the Foundation Medicine, FMI Cohort as used in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]))\nCritical: Inclusion of cancer subtype in the TCGA pan-cancer analysis is necessary to eliminate mutations enriched in specific subtypes due to uneven distribution of ancestry in the subtypes (e.g., breast cancer). Other clinical characteristics may also be considered potential confounders in the somatic mutation-ancestry correlations, e.g., disease stage and smoking history.\nNote: For validation using external data sets, it is crucial to ensure that the disease ontology terms are harmonized with TCGA data sets. In some cases, external datasets will not have as detailed subtype information. The correlation between somatic alteration frequency and the fraction of AFR or EUR ancestry per individual is performed using binomial logistic regression. It is also important to use the same procedure of ancestry calling for independent cancer cohorts. See our companion protocol Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8], for how to generate ancestry calling from genotyping data.\nAssociation of ancestry with DNA methylation\nTiming: 3 h\nTiming: 1 h for step 16\nTiming: 1 h for step 17\nTiming: 1 h for step 18\nFilter Infinium DNA methylation BeadChip probes directly influenced by genetic variation.\nDownload DNA methylation IDATs from the GDC legacy archive (see key resources table[href=https://www.wicell.org#key-resources-table]) and process them to beta values using SeSAMe (Zhou et al., 2018b[href=https://www.wicell.org#bib44]).",
    "Note: The obtained beta value file is a masked matrix with NA indicating either lack of signal or design flaws. More detailed information about masking can be found in (Zhou et al., 2017[href=https://www.wicell.org#bib42]). Some cancer types in the GDC legacy data were not consistently processed. The previous processing pipeline estimated signal background using internal negative controls (Davis et al., 2012[href=https://www.wicell.org#bib15]). This pipeline underestimated the true background, leading to the potential false-positive discovery of epigenetic silencing (Zhou et al., 2018b[href=https://www.wicell.org#bib44]).\nDownload sample annotations (see key resources table[href=https://www.wicell.org#key-resources-table]), including\nSample quality annotations as reported in the quality annotation whitelist.\nGender as reported in the clinical data table\nAge as reported in the clinical data table\nABSOLUTE-estimated purity data. Tumor adjacent normal samples have purity 0.\nFilter samples using the pan-cancer whitelist and remove admixed samples. Remove samples of undetermined purity.\nAlternatives: 625 samples do not have purity annotation. The missing annotation is likely due to a lack of copy number variation signal needed for the ABSOLUTE method (Carter et al., 2012[href=https://www.wicell.org#bib9]). In this analysis, we remove samples with unknown purity estimates. One can also use other ways to estimate major non-tumor components such as stromal cells and leukocytes to replace purity. These contaminants can be estimated using mRNA or DNA methylation signatures ((Thorsson et al., 2018[href=https://www.wicell.org#bib38]) provides leukocyte estimates).\nCreate a matrix file with rows corresponding to the sample and columns corresponding to CpGs, and the sample covariates (see Figure 1[href=https://www.wicell.org#fig1] for a schematic example).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/600-Fig1.jpg\nFigure 1. Input format example and workflow for ancestry association\n(A) Example input files for regression. The response variable is colored in red. Top: DNA methylation. Bottom: mRNA expression.\n(B) General analysis workflow, showing DNA methylation in expanded panels.",
    "Note: In R, we need to convert categorical sample covariates to factors. During the model fitting, it is better to fix the reference group for each sample covariate (e.g., use EUR as the reference for ancestry) to stabilize the slope coefficient in different runs.\nCritical: Ancestry is closely linked to genetic background. Infinium DNA methylation probe hybridization can be influenced by genetic variations that occur in the probe sequence. SNPs on the probe sequence within 5bp from the 3′-end strongly impact the hybridization and extension efficiency, leading to biased readouts of signal intensities (Zhou et al., 2017[href=https://www.wicell.org#bib42]). SNPs that occur at the probe extension base and flip the designated detection color channel can produce false readouts of methylation levels. These generate measurement artifacts which could be erroneously interpreted as ancestry-associated DNA methylation. We recommend excluding CpGs interrogated using Infinium probes with a common SNP found within the last 5 bp from the target CpG and at the probe extension. This information can be downloaded from the Infinium DNA methylation probe annotation database (see key resources table[href=https://www.wicell.org#key-resources-table]).\nTest DNA methylation for ancestry association\nFor each probe, fit two linear regression models, with and without ancestry, while accounting for cancer subtype, gender, age, and tumor purity, i.e.,\nFull (with ancestry): [DNA methylation β-value] ~ [ancestry] + [cancer subtype] + [gender] + [purity] + [age]\nReduced (without ancestry): [DNA methylation β-value] ~ [cancer subtype] + [gender] + [purity] + [age]\nTest the F-statistics and p-value for ancestry association by contrasting the two regression models. In R, one can use the anova(full, reduced, test=\"F\") function.\nApply the Benjamini-Hochberg FDR correction to all the p-values.",
    "Identify ancestry-associated methylation as CpGs with FDR-corrected q < 0.05. One may optionally filter CpGs with a small effect size. See Problem 2[href=https://www.wicell.org#sec7.3]. Effect size is defined as the difference in means between the most and least methylated ancestry groups.\nRepeat steps 16c–17c for the seven cancer types with more than ten non-EUR samples (BLCA, BRCA, CESC, COAD, LIHC, THCA, and UCEC).\nNote: One can validate the effectiveness of the fitting by inspecting the fitted slope coefficient for cancer subtypes against known biology. For example, in TGCT one will expect an excessive number of CpGs with loss of DNA methylation due to its cell of origin, and in IDH-mutated gliomas one expects a global gain in DNA methylation.\nInterpret ancestry-associated DNA methylation\nFor both pan-cancer analysis and cancer type-specific analysis, tally the number of ancestry-associated CpGs.",
    "Note: The Infinium HumanMethylation450 BeadChip has 65 built-in SNP probes (probes with ‘rs’ in the probe name). One can use these standard SNP probes as positive controls for ancestry association since these SNPs reflect the genetic background and differ between ancestry groups. For example, in our pan-cancer analysis, 63 of these 65 SNP probes were significantly associated with ancestry (see Figure 3A in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8])). One can also use the fraction of SNP probes identified to estimate recall. For example, cancer types with inadequate non-EUR representation have less power in detecting ancestry association, and pan-cancer analyses are more powerful than cancer type-specific analyses (see Figure S3F in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8])). The same applies to other confounders to ancestry association such as unaccounted cancer-to-cancer heterogeneity. The effect of these confounders depends on the participating cells and the genomic locations of the CpGs of interest. To mitigate such confounding, one could incorporate a more granular cancer type/subtype classification or perform a pan-cancer analysis where multiple cancer types are pooled to strengthen the signal.\nAnnotate ancestry-associated CpGs for gene associations using the Probe annotation file (see key resources table[href=https://www.wicell.org#key-resources-table]). CpG-gene associations are classified as promoters and gene bodies. Promoter CpGs are defined as CpGs located from 1500 bp upstream of the Transcription Start Site (TSS) until the Transcription Termination Site (TTS) of any isoform of the gene.",
    "Note: It is essential to use a comprehensive gene model to capture all biotypes. Many CpGs are associated with noncoding RNAs, pseudogene transcription, and endogenous viral elements. Our annotation uses GENCODE v22. One should use a more updated gene model if available. A significant fraction of the ancestry-associated CpGs are not identified as associated with genes. CpGs at potential regulatory enhancer elements can be identified using the latest cis-regulatory element definition, such as (Abascal et al., 2020[href=https://www.wicell.org#bib1]).\nGroup CpGs that are associated with the same gene. Cluster and plot the ancestry association slope coefficients.\nNote: CpGs in genomic proximity tend to undergo coordinated methylation changes, indicating potential local chromatin states linked to gene expression control. This spatial correlation will yield multiple ancestry-associated CpGs associated with the same gene and consistent directionalities. By clustering CpGs by ancestry-specific methylation effects, we can recover patterns of such coordinated methylation change. Of note, in some cases, differential methylation can also display long-range coordination. For example, ancestry-associated CpGs found in different locations (TSS and TTS) of SPATC1L (see (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) Figures 3C and 3D) have opposite ancestry-specific effects.\nNote: As mentioned above, because the regression model uses a reference level when calculating ancestry-associated changes, one may need to rescale the mean effect sizes to zero for visualization clarity.\nUse patient barcodes to match normalized mRNA expression data (see key resources table[href=https://www.wicell.org#key-resources-table], also see the following gene expression section) and plot expression against promoter methylation. One would expect to see negative associated as in Figure 3E in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]). See Problem 3[href=https://www.wicell.org#sec7.5] for potential causes for lack of correlation that may lead to low overlap between ancestry-associated differential methylation and differential expression.",
    "Validate genes with ancestry-associated regional differential methylation in whole-genome bisulfite sequencing data (see Figure 3E and 3F in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8])).\nCritical: Many factors control DNA methylation. Most notably, much of the X chromosome is monoallelically methylated to balance dosage between the two sexes. Other sex-related differences have also been seen in autosomal genes such as DDX43 and OOEP (see expected results). In addition to sex, age is a major determinant of DNA methylation of CpGs of specific sequence context in late-replicating DNA and polycomb targeted CpG islands (gain of DNA methylation). Tissue-specific DNA methylation also causes tissues of different cell composition to have shifts in average DNA methylation readouts. Therefore, it is critical to include sex, age, and tumor purity or other cell type estimates as explicit covariates in the model searching for ancestry-associated DNA methylation.\nCritical: Sample size and residual tumor heterogeneity affect the ability to find statistically significant ancestry associations (see power analysis in the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section)\nUse a Wilcoxon signed-rank test to test whether a local ancestry Z-score is associated with ancestry-specific DNA methylation level. (see Figure S7D, E of (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) for an expected result)\nAssociation of ancestry with mRNA\nTiming: 2.5h\nTiming: 1 h for step 19\nTiming: 1.5 h for step 20\nRetrieving and filtering TCGA Data\nDownload the pan-cancer mRNA data matrix (see key resources table[href=https://www.wicell.org#key-resources-table]) and exclude ancestry-admixed samples (20%<non-EUR ancestry<80%).\nCode .txt file with samples as rows and columns as variables (e.g., cancer type, subtype, ancestry, batch). Batch information can be extracted from the plate ID portion of the TCGA barcode.",
    "Note: To account for subtype-specific gene expression, the tumor type and subtype must be merged into a single variable (e.g., BRCA.Basal) in pan-cancer analyses. Only subtype (where applicable) is used in cancer-specific analyses. If subtype is not taken into account, subtype-specific gene expression may dominate ancestry associations.\nCode ancestry calls, such that EUR ancestry is 0 and EAS or AFR ancestry is 1.\nSort the mRNA matrix so that it matches the sample and order from the preceding step.\nLog2-transform the gene expression matrix and filter for genes expressed in >80% of samples.\nNote: we excluded genes that show a lack of expression (zero read count) in over 20% of samples since zero read count is highly unlikely in practice and indicates low quantification. We excluded 4,262 genes, leaving 16,269 genes in the final matrix.\nTranspose the mRNA expression data matrix so that samples are in rows and genes are in columns (Figure 1[href=https://www.wicell.org#fig1]A Bottom).\nIdentification of ancestry associated genes\nPerform two independent linear regressions on the gene expression data, correcting for tumor type/subtype and batch (use glm function in R):\nReduced (without ancestry): [mRNA expression] ~ [tumor type / subtype] + [batch]\nFull (ancestry): [mRNA expression] ~ [ancestry] + [tumor type / subtype] + [batch]\nFor each gene, perform an ANOVA comparing the reduced model and full model's coefficients and output the beta-statistics and p-values. In R, one can use anova(full, reduced, test=\"F\")\nUse the Benjamini-Hochberg FDR adjustment on ANOVA p-values to correct for multiple comparisons.\nIdentify ancestry-associated genes by FDR<0.001.\nNote: we used 0.001, a stringent FDR cutoff, to focus on sizeable effect-size ancestry association discoveries (see Problem 2[href=https://www.wicell.org#sec7.3] for discussion)\nVisualize genes reaching significance using heatmaps or box plots (see Figures 4E and 4F in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8])).",
    "The same analysis is also performed on a per-tumor type basis as above.\nNote: This procedure was performed independently for AFR vs. EUR and EAS vs. EUR. After generating the output files, it is useful to spot-check results for known genes associated with the variables to ensure the sample file was coded correctly and matched the gene expression matrix. For example, one can plot median expression over ancestry for GSTM1 (Li et al., 2015[href=https://www.wicell.org#bib28]), CRYBB2 (Huo et al., 2017[href=https://www.wicell.org#bib22]), PPIL2, and FBLL1 (also see (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) Table S4 for a list of identified ancestry-associated differentially expressed genes)\nAssociation of ancestry with miRNA\nTiming: 2 h\nPreprocess input reference mature strand data\nObtain TCGA miRNA mature strand, batch-corrected, normalized reads-per-million (RPM) data (Chu et al., 2015[href=https://www.wicell.org#bib13]) (see key resources table[href=https://www.wicell.org#key-resources-table]).\nLog2-transform RPM values, using y = log2(x+1).\nNote: These data include RPM expression levels of 743 miRNA mature strands (miRs) for 10,824 TCGA samples, batch-corrected to enable pan-cancer analyses. The consolidated dataset, for which both miRNA expression data and ancestry calls were available, included 8,180 samples across 32 tumor types. No miRNA sequence data were available for GBM, a pilot-phase TCGA project that used microarrays rather than sequencing. Among the 32 tumor types, 12 had subtype annotations. If batch corrected, pan-cancer atlas miRNA data are used, set negative miRNA reads-per-million (RPM) values to 0.\nQuantify ancestry associations for mature strands\nApply a linear regression model with a binary design matrix based on the subtype calls as predictors to explain the normalized RPM expression of mature strands across the samples of each tumor type and subtype.\nPerform Wilcoxon rank-sum tests between each pair of ancestry groups on the output of this model, applying the following pre-filtering criteria:",
    "The sample size of each group to be tested should be greater than or equal to five.\nThe coefficient-of-variation across the expression levels of the union of both sample groups should be 0.1 or larger.\nFor the union of samples of both groups, at least five samples had an RPM value of 25 or higher (4.7 in log2 space).\nmiRNAs that were flagged as having ancestry-specific SNPs (identified in somatic mutation association above) were discarded. See below for more details about the ancestry-specific SNPs.\nCritical: In TCGA miRNA-seq data, only reads aligned with exact matches were counted towards expression (Chu et al., 2015[href=https://www.wicell.org#bib13]). Given this, TCGA samples with SNPs within mature strands will report artificially low (or zero) expression levels for these strands. Ancestry-specific SNPs in miRNAs will thus lead to spurious relationships of differential miRNA expression between ancestry groups. We, therefore, discarded mature strands with ancestry-specific SNPs. We merged miRNA annotations from miRBase (v21, released June 2014) with 1000 Genomes Phase 3 information, which contains ancestry-specific SNP allele frequencies. We called a SNP “ancestry-specific” if the difference between its maximum and minimum ancestry-specific allele frequencies among the five super-populations (AFR, AMR, EAS, EUR, SAS) was 0.25 or larger. Table S6 in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) lists the SNPs in miRNAs along with their ancestry-specific allele frequencies.\nCompile a general miRNA-host-gene data resource\nDownload a GFF file giving miRNA annotations from miRBase v22.1 (see key resources table[href=https://www.wicell.org#key-resources-table]). Read this into R using the rtracklayer package’s readGFF function. Extract records for primary transcripts (type == “miRNA_primary_transcript”) and for mature strands (type == \"miRNA\").\nDownload a GFF file giving gene and transcript annotations from Ensembl (see key resources table[href=https://www.wicell.org#key-resources-table]). Read this into R with the readGFF function. Extract (base-R subset or dplyr filter) records for genes that have ENSGs.",
    "Identify hosted miRs and host genes by seeking overlap of gene and miR transcripts above (see Problem 4[href=https://www.wicell.org#sec7.7]). In R, one can find overlap using the GRanges mergeByOverlap function (Lawrence et al., 2013[href=https://www.wicell.org#bib27]), i.e.,\nApply the iRanges mergeByOverlap function to the miR and gene GRanges objects. It is required that gene and miR be on the same strand (ignore.strand=FALSE).\nIdentify miRs that are overlapped by a gene but are on the opposite strand from the gene, using mergeByOverlap() while ignoring strand, then taking the difference between these miRs and the same-strand hosted miRs calculated above.\nIdentify intergenic miRs as the difference between all miRBase miRs and the ignore-strand miRs calculated above.\nSeed sequence families\nDownload reference miRBase mature strand sequences as ‘mature.fa’ from miRbase (see key resources table[href=https://www.wicell.org#key-resources-table]).\nReorganize the file so that each mature strand has only one row in the file. Read the new file into R.\nIsolate bases 2 to 8 from the 5′ end of each sequence, in R, using substr(sequence, 2, 8).\nTabulate distinct seed sequences and which miRNA's 5′ or 3′ mature strand contains each seed sequence. Associate seed sequences with miRs. See notes below on isomiRs and miRNA targeting.\nCalculate expression correlations between miRNAs and host genes\nDownload pan-cancer, batch-corrected, normalized RSEM GRCh37 expression data for 20531 RSEM genes and 743 expressed reference miRBase mature strands (Hoadley et al., 2018[href=https://www.wicell.org#bib21]) (see key resources table[href=https://www.wicell.org#key-resources-table]).\nFor a cancer type, given the host gene/hosted miRNAs (calculated for GRCh38 annotations, above), calculate distributions of Spearman’s correlations between RPMs for hosted a miR and RSEM normalized expression for the miR’s host gene (see Problem 5[href=https://www.wicell.org#sec7.9]).",
    "Critical: Reference genome assembly and gene annotations. The latest Ensembl gene annotations are based on the recent GRCh38 assembly, but TCGA and PanCancer data are GRCh37/hg19. While we recognized that the GRCh37/hg19 TCGA RSEM gene expression data would be unavailable for some Ensembl v94/GRCh38 genes, we prioritized using near-current miRNA annotations and biotypes (see (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) Figure S6C) so that we would have the most up-to-date information on host genes, and noncoding polycistrons. The GRCh38-based annotation/overlap resource supported calculating correlations for 203 host genes and 331 hosted miRs (see (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) Figures 5E, 5F and S6F, S6K).\nVisualize ancestry-associated miR-gene targeting\nTo generate the UCSC hg19 screenshots, we read Table S2 from Marsico et al. 2013 (Marsico et al., 2013[href=https://www.wicell.org#bib30]) into R and wrote out a zero-based BED-format file for the TSS coordinates and a bedGraph file for the TSS probabilities. We loaded both files into the UCSC hg19 genome browser as custom tracks, viewed appropriate locations, and exported PDF images of specific locations. For hsa-mir-9-3 (Figure S6J of (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8])), we noted that the hg38 UCSC genome browser showed more MIR9-3HG transcripts than the UCSC hg19 browser, so we also downloaded a PDF of the hg38 view (though this view did not show the hg19 miRNA TSS information).\nTo add the read pileup graphics, we went to each miRNA’s miRBase v22.1 web page and copied the read pileup graphic (e.g., http://www.mirbase.org/cgi-bin/mirna_entry.pl?acc=MI0000466[href=http://www.mirbase.org/cgi-bin/mirna_entry.pl?acc=MI0000466] for hsa-mir-9-1). To get MIMAT mature strand IDs and reference sequences (i.e., strand sequences that showed no isomiR variation), we clicked on the miRBase ‘Get sequence’ button for a mature strand.",
    "Critical: miRNA families. Some miRNAs are members of miRNA families in multiple genomic locations (e.g., hsa-mir-9-1, 9-2, 9-3 (Gurtan and Sharp, 2013[href=https://www.wicell.org#bib20])). Members of such families can have identical reference miRBase mature strand sequences. The data-generating process for TCGA miRNA-seq data (Chu et al., 2015[href=https://www.wicell.org#bib13]) was not designed to quantify the relative contributions of multiple locations to a mature strand's overall RPM expression level. While for some analyses (e.g., gene targeting and miR-gene expression correlations, differential miR abundance between subtypes), the location/source of a mature strand may be less critical, care should be taken in analyses that involve specific genomic locations. Such analyses include the effect of copy number alterations or DNA methylation on the expression level of a miRNA stem-loop, mature strand, or isomiR.\nNote: isomiR variation and targeting. A multi-step biogenesis process generates mature strands. The ‘trimmed’ locations of 5′ and 3′ ends of a mature strand may differ from the locations given for a reference miRBase strand (Guo and Liang, 2016[href=https://www.wicell.org#bib19]) (see read pileup profiles in (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) Figure 5D and S6H-J). IsomiR variation at 5′ and 3′ ends of a mature strand may influence which RNAs are canonically and non-canonically targeted. IsomiR variation is available in both the GDC’s legacy GRCh37 miRNA-seq data generated for TCGA (Chu et al., 2015[href=https://www.wicell.org#bib13]) and in the harmonized GRCh38 miRNA-seq data (Gao et al., 2019[href=https://www.wicell.org#bib18]). However, in all TCGA publications and the batch-corrected pan-cancer miRNA-seq data, all mature strands were treated as ideal, reference miRBase strands.\nIntegrated ancestry-associated pathways\nTiming: 4 h\nTiming: 1 h for step 26\nTiming: 1 h for step 27\nTiming: 1 h for step 28\nTiming: 1 h for step 29\nRetrieve and preprocess pathway activity data",
    "Download and read in the ancestry-admixture file, subtype annotation file, and the PARADIGM Integrated Pathway Level (IPL) data matrix (see key resources table[href=https://www.wicell.org#key-resources-table])\nCreate input files for association analysis\nCreate a merged ancestry/subtype annotation file with samples as rows and variables (e.g., ancestry and subtype annotation) as columns\nCreate a PARADIGM pathway matrix file with samples as columns and pathway features as rows\nFilter and sort the above two input files for overlapping samples (rows of the merged ancestry/subtype file and columns of the IPL data file) by patient ID so that they have matching order\nExclude ancestry-admixed samples (20%<non-EUR ancestry<80%)\nNote: The PARADIGM algorithm integrated platform-corrected expression, gene-level copy number, and pathway interaction data and was used to infer activities of ~19K pathway features (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/600-Mmc1.txt]) for 9829 TCGA Pan-Cancer samples across 33 cancer types. The inferred activities, termed integrated pathway levels (IPLs), reflect the log-likelihood of the probability that a given feature is activated (vs. inactivated). After the above-described filtering steps, 9046 samples with PARADIGM IPL data were available for association analysis.\nIdentification of ancestry associated pathway features\nIdentify tumor types with more than five patients of non-EUR ancestry for cancer type-specific analysis\nFor each cancer type, filter pathway features by the following minimum variation criteria:\n>1 sample has abs(IPL) > 0.05\n>10% of samples have non-zero IPLs\nCross-sample standard deviation of IPLs > 0.05\nIf the cancer type is annotated with subtypes, first regress IPLs in each sample on its subtype membership. Use the residual IPLs as the IPL of each sample in the following analysis.\nApply a linear regression model with a binary design matrix based on the subtype calls as predictors\nCalculate the residuals from the regression as IPLs “not explained” by subtype",
    "Compare EUR and each non-EUR ancestry group using 1) t-test and 2) Wilcoxon Rank sum test.\nConduct both tests within\neach cancer type without subtype adjustment\neach cancer type with subtype adjustment\neach cancer subtype\nApply Benjamini-Hochberg FDR correction to all the p-values.\nIdentify pathway feature that meets the following criteria as significantly associated with ancestry\nFDR corrected p < 0.05 from both tests (t-test and Wilcoxon rank-sum test)\nabs(difference in mean IPLs) > 0.05\nNote: Among the 33 tumor types, 24 have ≥5 patients of non-European ancestry and were considered in the analysis. 10 of the 24 included tumor types have subtype annotation, and the subtype-adjusted and within-subtype analyses (described in steps 27b–27d) were performed.\nAssess interconnectivity within the pathway structure to identify key regulatory nodes among ancestry associated features\nDownload and read in the pathway interaction dictionary containing ~45K interactions linking pathway features within a superimposed pathway structure (key resources table[href=https://www.wicell.org#key-resources-table], Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/600-Mmc2.txt])\nNote: Each line in the pathway structure file is an interaction between an (upstream) parent node in the first data column and its downstream (child) node in the third data column. The middle column denotes the type of interaction. Interactions can be of the following 6 types: \"-t>\" = transcriptional activation ; \"-t|\" = transcription repression ; \"-a>\" = activation ; \"-a|\" = repression ; \"component>\" = component of a complex ; \"member>\" = member of a family.\nFor each within tumor type, subtype adjusted, and within subtype comparison, identify ancestry-associated pathway features that are the parent nodes in >10 regulatory interactions (i.e., -a>, -a|, -t> or -t|) within the network structure as key regulatory nodes.\nSelect the comparisons that yielded key regulatory nodes",
    "Obtain the differences in means of the key regulatory nodes for selected comparisons (already calculated in step 27g of identification of ancestry associated features)\nMerge differences in means into a single data matrix for display (see Figure 7A of (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) for an expected result)\nNote: This analysis required >10 regulatory interactions to be deemed a key regulatory node for a feature. This criterion can be modulated (e.g., lowered to identify more regulatory pathway features). For instance, only 143 of the ~19K pathway features have > 10 downstream targets and have the potential of being identified as a key regulatory node in our analysis. However, if one were to require a lower number of downstream targets (e.g.,> 5), 376 features would potentially be identified.\nIdentify over-represented known cancer pathways and driver genes among ancestry associated features\na.Read in pathway feature dictionary for ~19K pathway features within the superimposed pathway structure (see key resources table[href=https://www.wicell.org#key-resources-table])\nNote: Each line in the pathway structure file is a pathway feature and has two columns containing the feature name and feature type. The dictionary uses the term 'protein' instead of 'gene' (as different isoforms of the same gene may exist as separate features in the SuperPathway)\nDownload the following gene sets (see key resources table[href=https://www.wicell.org#key-resources-table])\ncancer driver gene set (Table S1 of (Bailey et al., 2018[href=https://www.wicell.org#bib5]))\ncurated cancer pathway gene set (Table S3 of (Sanchez-Vega et al., 2018[href=https://www.wicell.org#bib34]))\ncurated DNA damage repair gene set (Table S1 of (Knijnenburg et al., 2018[href=https://www.wicell.org#bib25]))\nCreate a single merged .gmt file from the three gene sets above as an input to the enrichment analysis\nFor each comparison, use a hypergeometric test to identify over-represented gene sets in the merged input file based on the following counts (over-representation is assessed only if the odds ratio is > 2):",
    "Number of cancer pathway/driver genes identified as having ancestry-associated IPLs\nNumber of cancer pathway/driver genes that can be mapped to the pathway feature dictionary\nNumber of 'protein' features identified as having ancestry-associated IPLs\nNumber of 'protein' features in the pathway feature dictionary\nApply the Benjamini-Hochberg FDR correction to the hypergeometric test p values\nIdentify ancestry-associated pathways as those with FDR-corrected p values < 0.05 in the subtype-adjusted analysis (see Figure 7D of (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib8]) for expected result)\nNote: The pathway feature and pathway interaction dictionaries are used to define the superimposed pathway structure used as input to the PARADIGM algorithm to infer pathway activities. It includes pathway interaction data from the NCIPID, Biocarta, and Reactome databases. The over-representation analysis may be a complementary approach to the key regulatory node analysis. It allows the identification of enriched pathways where no single feature has a high degree of interconnectivity (or downstream targets), which may otherwise be missed."
  ],
  "subjectAreas": [
    "Genomics",
    "Bioinformatics",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}