{
  "id": 9908,
  "origin_website": "Jove",
  "title": "Preparation of Giant Vesicles Encapsulating Microspheres by Centrifugation of a Water-in-oil Emulsion",
  "procedures": [
    "1. Preparation of GVs by the W/O Emulsion Centrifugation Method\nPrepare a stock solution of 1,2-dioleoyl-sn-glycero-3-phosphocholine (DOPC, 25 mM) and a stock solution of Texas Red 1,2-dihexadecanoyl-sn-glycero-3-phosphoethanolamine, triethylammonium salt (Texas Red DHPE, 0.20 mM) in chloroform and store the stock solutions at -20 °C.\nPrepare an oil solution.\nForm a lipid film on the inside surface of a 5 ml glass vial by evaporating a mixture of the DOPC stock solution (51.0 µl and the Texas Red DHPE stock solution (19.2 µl) under flowing nitrogen gas.\nIncubate the film under reduced pressure overnight and then add 1.0 ml of liquid paraffin (0.86-0.89 g/cm3) to the vial. Wrap the vial in aluminum foil and incubate it at 80 °C O/N at rest. The final concentrations of DOPC and Texas Red DHPE are 1.3 and 3.8 x 10−3 mM, respectively, and the DOPC:Texas Red DHPE molar ratio is 100:0.3.\nPrepare the inner aqueous dispersion.\nIn a 1.5 ml lidded microtube, mix 237.5 µl of a dispersion of 1.0 µm nonfluorescent microspheres (2.5 vol%) and 12.5 µl of a dispersion of 1.0 µm fluorescent microspheres (2.5 vol%); this corresponds to a 95:5 (v/v) ratio of nonfluorescent to fluorescent microspheres.\nAdd 64 mg of sucrose followed by 125 µl of Tris-buffered solution (TBS, 1 M) and 875 µl of deionized water. The final volume fraction of microspheres is 0.5 vol%, and the final concentrations of Tris-HCl (pH 7.5) and sucrose are 0.1 and 0.15 M, respectively.\nVortex the microtube for 30 sec and then sonicate it for 10 min.\nPrepare the outer aqueous solution.",
    "After preparation of 10 ml of a Tris-buffered solution (0.1 M Tris-HCl [pH 7.5], 0.15 M glucose) in the same procedure as inner aqueous media, place 1 ml of the solution in a 1.5 ml lidded microtube. Vortex the microtube for 30 sec and then sonicate it for 10 min.\nPrepare a w/o emulsion containing microspheres.\nMix 1 ml of the oil solution (liquid paraffin containing DOPC and Texas Red DHPE) with 300 µl of the inner aqueous solution in a 1.5 ml microtube.\nEmulsify the two components in the microtube by using a mechanical homogenizer (an agitator with blades that rotate at high speed) operated at 10,000 rpm for 2 min at RT.\nPrecipitate the GVs.\nGently layer 300 µl of the w/o emulsion on the upper surface of 1 ml of the outer aqueous solution at 4 °C in a 1.5 ml lidded microtube. Chill the microtube for 10 min at 4 °C.\nCollect the GVs.\nImmediately after chilling the microtube, centrifuge it at 18,000 x g for 30 min. Obtain the precipitated GVs by piercing the bottom of the microtube with a pushpin and collecting one droplet in a sterilized 1.5 ml microtube.\nDilute the precipitated GV droplet 10-100 fold by volume with the outer aqueous solution if the obtained GVs are obtained in quantities large enough to make observation difficult.\n2. Microscopy Observation of GVs\nPrepare microscopy specimen.\nPlace an adhesive incubation chamber for in situ polymerase chain reaction and hybridization (chamber size 9 mm x 9 mm x 0.3 mm thick) on top of a microscope cover glass.\nUsing a micropipette, deposit 25 µl of the diluted precipitated GVs on the specimen area and immediately place another cover glass (approximately 0.15 mm thick) on top of the incubation chamber.",
    "Record differential interference contrast microscopy images of the GVs.\nRecord microscopy images of the vesicles with a microscope (10X, 20X, and 40X objectives) equipped with a 12V100WHAL-L halogen lamp.\nConduct fluorescence microscopy observations.\nInsert U-FBNA and U-FMCHE fluorescence mirror units into the microscope. Fit the units with 470-495 nm and 565-585 nm excitation filters, respectively, and with emission filters that transmit 510-550 nm and 600-690 nm light, respectively."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}