{
  "id": 13780,
  "origin_website": "Jove",
  "title": "Upright Imaging of Drosophila Egg Chambers",
  "procedures": [
    "1. Dissection of Ovarioles\nTransfer about fifteen 2-4-day-old female flies and a few males to a fresh fly food vial with added active dry yeast. Use cotton as a plug for the vials, and add a few drops of water to the cotton to keep the humidity high.\nPlace vial in a 25 °C incubator for 14-16 hr to maximize the number of stage 8-10 egg chambers.\n\tNOTE: Incubation time varies depending on temperature and desired stage.\nPrepare dissection media, 0.1M KPO4 and NP40 solutions as needed for the next day (see Materials).\nAnesthetize the flies using CO2, and place under a dissection microscope. Pipet several drops of dissection media into each cavity in the glass depression slide.\nHold forceps in each hand at an approximately 30° angle to the table top and orient one female fly with the wings down. With your non-dominant hand, pick up the female using forceps, grasping her at the anterior of the abdomen, near the thorax, and submerge her into the dissection media in the depression slide (Figure 1A inset).\nWith the other pair of forceps, grasp the exoskeleton at the ventral posterior of the abdomen and pierce through. Grab the ovaries at the posterior end, then pull them out of the abdomen and place into the fresh media on the other side of the depression slide. (Figure 1A inset). Avoid pulling apart the gut. Discard the carcass.\nRepeat with the other female flies until all ovaries are dissected. Discard the males.\nWith one pair of forceps, hold an ovary at the posterior end (near the largest egg chambers), and with the other hand use a pair of forceps to pinch one of the most anterior egg chambers (germarium). (Figure 1A).",
    "Slowly and steadily, pull an ovariole chain out of the ovary sheath. Continue to dissect out ovarioles individually until all desired egg chambers are removed.\nRepeat steps 1.7-1.8 for all dissected ovaries.\nOnce complete, transfer ovarioles to a 0.6ml tube using a plastic transfer pipette.\nLet ovarioles settle to the bottom of tube, then proceed to fixing and staining steps.\n2. Immunofluorescent (IF) Staining of Ovarioles\nCarefully remove dissection media from ovarioles with a pipette. Be sure not to remove any ovarioles or egg chambers. Leave approximately 50 μl of ovarioles and dissection media.\nAdd 50 μl of 16% paraformaldehyde to 150 μl of 0.1 M KPO4 Buffer in a tube, and add solution to egg chambers to fix them. Incubate while rocking for 10 min. CAUTION: paraformaldehyde is toxic.\nRemove fixative and rinse twice with 0.5 ml NP40 wash buffer.\nWash two times for 15 min each at RT.\nRefer to standard IF protocol15 for subsequent steps.\n\t\nBriefly, after fixation, add primary antibodies at the appropriate dilutions and incubate O/N at 4 °C. Wash in NP40 several times, then add secondary antibodies (1:200 dilutions).\nWash several times in NP40, then add DAPI (1:1,000) for 10 min, then repeat washes. Once IF protocol is complete, add 200 μl of 50% glycerol in PBS to egg chambers and let sit at RT for 2 hr.\nRemove solution, replace it with 70% glycerol in PBS, and cover with foil. Place sample at 4 ᵒC until ready for mounting. Meanwhile, continue with step 3.\n3. Advance Preparation of Glycerin Jelly Slides\nMeasure at least 4 ml of glycerin jelly using a spatula and fill a glass cell culture tube to the half way mark. Melt glycerin jelly in a water bath at 55 °C for 30 min.",
    "Pour a small drop of glycerol, approximately 300 μl, from the stock solution onto two microscope slides. Using a tissue, spread glycerol in a thin layer across each of the slides. This provides a base and allows for easy removal of glycerin jelly at step 5.6.\nCut the tip off of a filtered 1,000 μl pipette tip. Use cut pipette tip to transfer 1,000-1,500 μl of warm glycerin jelly slowly to each microscope slide. Take care to prevent bubbles.\nLet glycerin jelly slides sit for 5 min at RT to set.\nPlace each glycerin jelly slide in 60 mm × 15 mm petri dish and cover with plastic wrap. Place at 4 °C O/N. Optionally, store glycerin jelly slides for up to 5 days at 4 °C.\n4. Mounting Egg Chambers\nUsing samples from step 2.5, pipette several 3 μl drops of egg chambers in 70% glycerol across one glycerin jelly slide. Continue pipetting 3 μl drops until all egg chambers are on this slide. Make sure each drop contains at least ten egg chambers. Meanwhile, heat a culture tube of glycerin jelly in a 55 °C water bath.\nPlace the glycerin jelly slide with egg chambers under a dissection microscope. Adjust magnification so that only one drop of egg chambers is in the field of view (Figure 1B).\nUsing a 30 gauge needle as a spoon, pick up the desired stage egg chamber. When necessary, separate desired egg chambers from an ovariole chain using the needle as a knife.\nTo avoid debris that may interfere with imaging, transfer the egg chamber to the second glycerin jelly slide, with the anterior facing left (Figure 1E-1). Repeat until there are at least seven egg chambers lined up in a column (Figure 1C).",
    "Form new columns of seven until all desired egg chambers are transferred to the second glycerin jelly slide.\nTear off a small piece of tissue and twist. Use this to absorb the excess PBS-Glycerol from the egg chambers by lightly touching each one. Take care to not remove egg chambers.\nCut off the tip of a filtered 200 μl pipette tip. Use this to transfer 150 μl of glycerin jelly to cover all the columns of egg chambers.\n\tNOTE: The amount of glycerin jelly needed to cover the columns is based on egg chamber stages and number of columns. Amount may be adjusted.\nLet mounted egg chambers sit for 5 min at RT until the top layer of glycerin jelly is completely solidified (Figure 1D).\nPlace slide of mounted egg chambers in a 60 mm × 15 mm petri dish and cover with plastic wrap. Store at 4 °C O/N to allow the glycerin jelly layers to solidify together (place in the dark if there is concern about photobleaching).\n5. Preparation of Egg Chambers for Imaging\nPlace slide of mounted egg chambers under a dissection microscope. Adjust magnification so that only one column of egg chambers is in the field of view.\nUsing a 45° angle miniature scalpel, cut a straight line along the right side of the first column of egg chambers (close to the posterior side of the egg chambers). (Figure 1D-E)\nNext, cut above the first egg chamber at the top and below the last egg chamber in the column. At this point the column of egg chambers should be cut on three sides.\nUsing a microknife, slice along the left side of the column, as close as possible to the anterior side of the egg chambers (Figure 1E-3).",
    "Pipette 100 μl of cold 1X PBT over the cut column.\nUse a round edged spatula to remove the excess glycerin jelly around three sides of the cut column of egg chambers and discard, leaving the rest on the slide.\nInsert the spatula in the cut made at the anterior side of egg chambers and separate the column from the primary glycerin jelly block.\nPrepare samples for either inverted (5.8.1) or upright (5.8.2) microscopy.\n\t\nFor Inverted Microscope: Transfer the column of egg chambers to a coverslip with anterior side of egg chambers facing down. Repeat steps 5.2-5.8 until all columns of glycerin jelly have been removed and mounted. Add a couple of drops of 50% PBS-Glycerol onto each block of egg chambers to prevent them from drying out. Image egg chambers directly on coverslip.\nFor Upright Microscope: Transfer the column of egg chambers to a microscope slide with the anterior side facing up. Repeat steps 5.2-5.9 until all columns of glycerin jelly have been removed and mounted on microscope slides. Add a couple of drops of 50% PBS-Glycerol onto each block of egg chambers and cover blocks with a #1 ½ coverslip.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}