{
  "id": 3162,
  "origin_website": "Cell",
  "title": "FlipGFP protease assay for evaluating in vitro inhibitory activity against SARS-CoV-2 Mpro and PLpro",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn the FlipGFP protease assay, two plasmids are transfected to HEK-239T cells. One expressing the protease (Mpro or PLpro) is denoted as the protease plasmid. The other expressing the reporter FlipGFP is denoted as the reporter plasmid. The reporter plasmid encodes three components, GFP β1-9, β10-11, and the mCherry (Figure 1[href=https://www.wicell.org#fig1]). The β10-11 is engineered in the parallel orientation via the K5/E5 coiled coil. This orientation blocks its association with β1-9. Expression of the protease plasmid produces the Mpro or PLpro, which cleaves the Mpro or PLpro substrate linker between K5 and β11. The cleavage shifts β10-11 into the antiparallel configuration, which can associate with β1-9 and thus restore the GFP signal. The mCherry is included to normalize the transfection efficacy and indicate the cytotoxicity of testing compounds. The assay quantifies the fluorescence signal of GFP and mCherry. The ratio of GFP to mCherry correlates with the Mpro or PLpro enzymatic activity. Effective inhibitors have been shown to decrease the value of GFP/mCherry ratio in a dose-dependent manner.14[href=https://www.wicell.org#bib14]\nCell passage & seeding\nTiming: 1 h\nThis section describes the subculturing and seeding of the HEK293T cell line (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2737-Fig2.jpg\nFigure 2. Schematic diagram of the FLIPGFP protease assay\n(A) Cell seeding and incubation for cell growth.\n(B) Steps for plasmid transfection and expression.\n(C) Compounds testing and data analysis.\nNote: all procedures should be performed under aseptic conditions in the biosafety cabinet.\nFor cell culturing in the T75 flask, perform cell passage when the confluency reaches 95–98% (95–98% surface area of culture flask is covered by HEK293T cells).\naspirate cell culture medium.\nRinse cells with 10 mL (for T75 culture flask) of DPBS with gentle swirling to remove the remaining fetal bovine serum, which inhibits trypsin.\nRepeat the PBS rinse once.",
    "Add 3 mL trypsin-EDTA solution to the cell monolayer in the T75 culture flask. Agitate gently and incubate the flask at room temperature(20–25°C) for 1 min or until the cell just begin to detach.\nCollect the detached cells.\nGently tap the flask to detach the cell.\nAdd 10 mL prewarmed (to room temperature) complete culture medium containing DMEM (with 4.5 g/L glucose, L-glutamine, and sodium pyruvate), 10% FBS, and 1% penicillin-streptomycin to the flask.\nGently disperse the medium with pipetting using a serological pipette over the cell monolayer to recover 95% of the cells.\nMix the cell suspension by pipetting up and down.\nTransfer cell suspension to a 15 mL centrifuge tube and centrifuge at 500 × g for 5 min at room temperature (20°C–30°C).\nAspirate the supernatant and resuspend the cell pellet with 10 mL of complete culture medium.\nSeed the cell to a 96-well plate with 100 μL per well and a 0.8–3.0 × 105 cells/mL density.\nIncubate the flask in a cell culture incubator (Humidified, 5% CO2/95% air, 37°C) overnight (16–18 h) (Figure 2[href=https://www.wicell.org#fig2]A).\nNote: HEK293T cells are suitable for FlipGFP assay within 25 passages. The transfection efficiency is reduced beyond 25 passages.\nCritical: it is essential to ensure cells reach 70%–80% of confluence at the time of transfection to achieve the most efficient transfection. More than 95% confluence may result in low efficiency of transfection.\nTransfection\nTiming: 2 h (for steps 25 to 31)\nHEK293T cells are transfected with two plasmids: one expressing the protease and another expressing the FlipGFP reporter (Figure 2[href=https://www.wicell.org#fig2]B).\nThis section describes the plasmid transfection procedure in the FlipGFP assay.\nOn the second day after cell seeding, check the cell confluency in the T75 flask using a phase-contrast inverted microscope. 70–80% confluence gives the most efficient transfection.",
    "Dilute GFP reporter plasmid and protease plasmid to 500 ng/μL using autoclaved nuclease-free water.\nTo assemble the transfection complex, mix 9 μL of Opti-MEM, 0.1 μL of 500 ng/μL reporter plasmid, 0.1 μL of 500 ng/μL protease plasmid, and 0.3 μL of transIT-293 for each well of a 96-well plate (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: master mix for multiple wells is recommended.\nGently vortex the transfection complex and incubate at room temperature for 30 min.\nAdd 9.5 μL of transfection complex to each well of the 96-well plate, such that 50 ng of GFP reporter plasmid and 50ng of protease plasmid are aliquoted to each well.\nMix the transfection complex in each well by shaking the plate on a shaker for 5 min.\nIncubate the plate in a cell culture incubator (humidified, 5% CO2/95% air, 37°C) for transfection and protein expression. Incubate for 3 h.\nNote: To validate the FlipGFP assay, control experiments with matching or mismatching protease-FlipGFP reporter pairs need to be performed (Figure 3[href=https://www.wicell.org#fig3]A). In addition, control compounds should be tested. Positive control (a compound with potent protease inhibitory activity and without cytotoxicity) should show dose-dependent inhibition of the GFP signal with a consistent EC50 value. Negative control (a compound without protease inhibitory activity and cytotoxicity) should show a constant GFP signal in different concentrations. The positive and negative control groups should show a consistent mCherry signal to indicate successful transfection and expression.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2737-Fig3.jpg\nFigure 3. Assay Characterization and FlipGFP assay for SARS-CoV-2 Mpro inhibitors\n(A) Images of FlipGFP assay validation. Scale bar represents 500 micrometers.\n(B) Images of FlipGFP Mpro assay for GC376, Nirmatrelvir, and Ensitrelvir. GRL0617 was included as a negative control. The images are representatives of three individual repeats. Scale bar represents 500 micrometers.",
    "(C) The dose-response curve of the GFP/mCherry fluorescence ratio and the EC50 for GC376, Nirmatrelvir, Ensitrelvir, and GRL0617 in FlipGFP Mpro assay. The mCherry signal was used to normalize Mpro expression level and characterize compound toxicity. Curve fittings are obtained in GraphPad Prism 8. Error bars represent the standard deviation of the data.\nTesting compounds\nTiming: 10 min\nThis section describes the FlipGFP assay procedures of compound addition.\nPrior to compound addition, the testing Mpro or PLpro inhibitors and control compounds (GC376 and GRL0617) should be diluted in DMSO with a concentration gradient of 6, 3, 1, 0.3, 0.1, 0.03, 0.01 mM.\nNote: avoid using wells on the edge of the compound testing, including the control well of the DMSO-treated group. Evaporation of media in the edge wells may affect results.\nAfter 3 h of incubation, add 1 μL of compound to the well (final concentration 60, 30, 10, 3, 1, 0.3, 0.1 μM), and mix well immediately by shaking the plate on a shaker with moderate speed for 5–8 min. (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: A concentration of up to 1% (v/v) DMSO can be used without a significant cytotoxic effect on HEK293T cells.\nIncubate the 96-well plate for 48 h at 37°C, 5% CO2/95% air.\nCritical: Addition of compound dissolved in DMSO can damage the cell layer if not mixed well immediately. Compound should be added to the edge of the well and shaken immediately to ensure even mixing.\nQuantification\nTiming: 30 min\nThis section describes the quantification of the fluorescence signal of the assay.\nAfter 48 h of incubation, quantify GFP and mCherry signal in a plate reader (Figures 3[href=https://www.wicell.org#fig3]A, 3B, and 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2737-Fig4.jpg\nFigure 4. FlipGFP assay for SARS-CoV-2 PLpro inhibitors",
    "(A) Images of FlipGFP PLpro assay for GRL0617. GC376 was included as a negative control. The images are representatives of three individual repeats. Scale bar represents 500 micrometers.\n(B) The dose-response curve of the GFP/mCherry fluorescence ratio and the EC50 for GRL0617 and GC376 in FlipGFP PLpro assay. The mCherry signal was used to normalize PLpro expression level and characterize compound toxicity. Curve fittings are obtained in GraphPad Prism 8. Error bars represent the standard deviation of the data.\nSet excitation at 485 nm, and emission at 530 nm for green GFP fluorescence quantification.\nSet excitation at 580 nm and emission at 630 nm for red mCherry fluorescence quantification.\nNote: Multiple point scan of each well is highly recommended. For detailed data analysis, please refer to the quantification and statistical analysis section."
  ],
  "subjectAreas": [
    "Chemistry",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}