{
  "id": 10822,
  "origin_website": "Jove",
  "title": "Studying Protein Function and the Role of Altered Protein Expression by Antibody Interference and Three-dimensional Reconstructions",
  "procedures": [
    "1. Stock Solutions\nResuspend the lyophilized active motif powder in sterile H2O to a final concentration of 2 µg/µl. Tap carefully for mixing.\nPrepare small aliquots (e.g., 12 µl each, 2 µl are required per reaction) and store them at -20 °C.\n2. Preparation of Cells\nSeed mammalian cells such as HEK293 cells or primary neurons on a 24 well plate in 500 µl growth medium including antibiotics.\n\tNOTE: When using neurons, seed the cells at low density and use only the two middle rows of the 24 well plate. Each well will thus have an empty counterpart to harbor the medium during incubation (step 4.2). When handling neurons, always make sure that the cells are not kept outside the incubator for more than a few minutes.\nCulture the cells at appropriate conditions (humidified, 5% CO2 and 37 °C) until the cells are app. 50% confluent.\n\tNOTE: When using neurons, culture the cells until the desired developmental stage is reached and change app. 25-50% of the medium twice a week. Medium: Neurobasal medium (containing 1x B27, 5 mM L-glutamine and 1x Penicillin and Streptomycin; compare with ref 16).\n3. Chariot Complex Formation\nPer reaction, dilute 0.1-2 µg of the POI or the corresponding antibody as well as the control protein, or control antibody, respectively, in 50 µl of PBS.\n\tNOTE: The technique also works with macromolecular complexes consisting of pre-bound primary and secondary antibodies (cp. 'Representative Results', Figure 1). Mix and spin.\nFor each sample, dilute 2 µl Chariot stock solution in 50 µl of PBS using separate tubes in order to avoid self-association of Chariot. Mix and spin.\nTransfer the diluted POI or antibody (step 3.1) to the Chariot dilution by pipetting. Mix and spin.\nIncubate the mixture for 30 min at room temperature (Chariot-POI complexes will form).",
    "4. Transfection of Cells\nDilute the Chariot complexes (step 3.4) in 100 µl pre-warmed growth medium (37 °C, no additives). Remove the medium and wash the cells once using pre-warmed 1x PBS.\n\tNOTE: When using neurons, do not discard the medium, it will be reused. Keep it at 37 °C. For washing, use PBS containing 0.5 mM MgCl2 and CaCl2.\n\tSuggestion: keep the medium in empty wells while incubating the plate (step 4.5).\nApply the Chariot complex solution (step 4.1) to the cells and rock the cells gently to ensure an even distribution of the solution. Grow the cells under standard conditions (step 2.2) for 1 hr. Add serum to a final concentration of 10%. When using neurons, add the medium from step 4.1. Grow the cells for 1 to 2 more hours.\n\tNOTE: The optimal incubation time depends on the size and properties of the cargo and may need to be adjusted empirically. The following suggestions may serve as a guideline: For peptides, 1 hr is usually sufficient, for proteins 1-2 hr are recommended, for antibodies 2 hr, and for the transfection of neurons with antibodies 4 hr.\nProcess cells for analysis as usual. Please note: the technique is compatible with experiments using fixation protocols as well as live imaging.\n5. Imaging\nUsing a laser scanning microscope, take z-stacks of cells and/or cell compartments of interest using approximately 0.25-0.5 µm distance. The precise layer distance depends on the size of the structure to be reconstructed and needs to be determined individually.\n6. Reconstruction\nIn the following steps, use the Esc bottom to switch between Select and Navigate, Cntr to select multiple objects by clicking on them and shift key to cut objects (cp. step 6.10).\nOpen the lsm-file in Imaris.",
    "Using the Display Adjustment for each channel, contrast the picture until the brightest structures reach saturation. Please note that this adjustment will not influence the surface construction, it only serves to assist the experimenter in thresholding the image.\nClick on the Add new Surfaces icon. A wizard will open.\nSelect: Segment only a Region of Interest. Proceed to the next step.\nAdjust the margins of the selection box to fit your object of interest. Please bear in mind that the image has 3 dimensions and that the selection needs to be adjusted at the z plane as well. If the rectangular shape of the selection box should not match the object of interest properly, turn the object and/or enlarge the box until all required structures are embedded. Undesired objects may be removed later on (cp. step 6.10). Proceed.\nSelect the appropriate channel. The Surface Area Detail Level or sphere diameter should be set to match the structures being reconstructed.  Depending on the signal characteristics, either Absolute Intensity or Local Contrast can be used.  Generally, Local Contrast works better for diffuse signals. In any case, the settings need to be adjusted separately for each signal or structure of interest, respectively.\nUsing the Thresholding tool, reconstruct the structure of interest.\nComplete the reconstruction by clicking on the green arrow bottom.\nAdjust the object further by using the pencil tool to cut and remove surfaces as required. It is only possible to cut in north-south direction, therefore, tilt the image in order to cut the desired object.\nObtain measurements of volume, area and intensities for each surface by selecting Statistics, Detailed Statistics, and Average Values.",
    "(Optional step) To observe color-coded statistics (cp. Figure 2E and F), select the color tab of the corresponding surface and mark 'Statistic Coded' instead of 'Base'. Several options will be displayed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}