{
  "id": 2769,
  "origin_website": "Cell",
  "title": "Identification and Functional Analysis of Human CD56neg NK Cells by Flow Cytometry",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nPeripheral Blood Mononuclear Cells (PBMCs) Isolation\nTiming: 1.5–2 h\nThis step details how to isolate PBMCs from buffy coats (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/228-Fig1.jpg\nFigure 1. PBMC Isolation by Ficoll Density Gradient\n(A) Image of the buffy coat.\n(B) Add 10 mL of Ficoll in a conical 50 mL tube.\n(C) Add the buffy coat to another conical 50 mL tube.\n(D) Dilute the buffy coat 1:4 with PBS.\n(E–G) Add the diluted buffy coat on top of the Ficoll.\n(H) Image of Ficoll density gradient after centrifugation.\n(I) Collect the PBMC layer.\nAdd 10 mL of Ficoll Paque Plus to two conical 50 mL tubes (Figure 1[href=https://www.wicell.org#fig1]B).\nDilute the buffy coat 1:4 by adding sterile PBS and mix gently. In our protocol, we add 30 mL of sterile PBS to 10 mL buffy coat (Figures 1[href=https://www.wicell.org#fig1]C and 1D).\nNote: If starting from whole blood, prepare a 1:2 dilution in sterile PBS.\nCritical: During all the steps of PBMC isolation, use PBS without calcium and magnesium to avoid cell aggregation.\nCarefully add 20 mL of the diluted buffy coat on top of the Ficoll in each conical tube (Figures 1[href=https://www.wicell.org#fig1]E–1G).\nCritical: Avoid mixing the Ficoll and the diluted buffy coat. For that, tilt the conical tube with Ficoll and slowly add the diluted buffy coat or whole blood in the tube by sliding it through the tube wall.\nCentrifuge tubes at 800 × g for 20–25 min at 20°C–22°C (RT).\nCritical: Use low brake and acceleration during the Ficoll density gradient centrifugation to avoid mixing of the layers.\nCollect PBMC layer with a Pasteur pipette in a 50 mL conical tube (Figures 1[href=https://www.wicell.org#fig1]H and 1I).\nAdd 30 mL of sterile PBS and centrifuge cells at 200 × g for 10 min at 20°C–22°C (RT).",
    "Note: This washing step is done at lower speed to remove platelets that could remain after collecting the PBMC layer.\nAfter washing, discard the supernatant and resuspend the pellet in 30 mL of sterile PBS. Centrifuge samples at 300 × g for 10 min at 20°C–22°C (RT).\nRepeat step 7.\nResuspend pellet in 20 mL sterile PBS and filter cells with 70 μm cell strainers.\nNote: The volume in which you should resuspend the pellet may vary depending on the concentration of your starting sample.\nCount viable cells by Trypan Blue exclusion.\nPBMCs cryopreservation:\nPrepare cell cryopreservation medium.\nWe usually freeze 107 cells per cryovial. Add the number of cells of interest in a conical 15 mL tube and centrifuge at 300 × g for 10 min at 20°C–22°C (RT).\nDiscard the supernatant and resuspend the pellet in sterile FBS at a concentration of 500 μL/107 cells.\nPlace 500 μL of cells in each cryovial and add 500 μL of cell cryopreservation medium to obtain a final volume of 1 mL.\nPlace all the vials in a freezing container and store it at −80°C for 48 h. Then, transfer the vials to an appropriate container and store them in liquid nitrogen.\nNote: The cryopreservation step must be done as quickly as possible. Try to reduce the time that cells are exposed to DMSO before they are transferred to the freezer as this influences cell viability.\nNote: The cryopreservation step can be omitted and fresh PBMCs can be used for phenotypic and functional assays. However, this protocol was optimized using cryopreserved samples. The cryopreservation of biological samples has some advantages such as, easier collection of the samples in locations far from where the study is performed, and possibility of analyzing samples in large batches, minimizing overall analytical variability.\nThawing Cryopreserved PBMCs",
    "Timing: 2–3 h\nThis step details how to thaw cryopreserved PBMCs before starting the phenotypical characterization and the functional assay.\nThaw the cryovial in a water bath at 37°C and place the cells into a conical 15 mL tube.\nAdd 3 mL of RPMI medium (previously warmed at 37°C) and centrifuge at 300–400 × g for 5 min at 20°C–22°C (RT).\nDiscard the supernatant and resuspended the pellet in 3 mL of R10 medium.\nAdd DNase I from the stock solution to obtain a working concentration of 10U DNase I for up to 5 mL cell suspension.\nPlace the cells in the incubator at 37°C and 5% CO2 for 1 h.\nAfter the incubation, centrifuge the tubes at 300–400 × g for 5 min at 20°C–22°C (RT).\nDiscard the supernatant and resuspended the pellet in 2 mL of NK cell medium.\nFilter cell suspension with a 70 μm cell strainer and place it into a new 15 mL tube.\nCount viable cells by Trypan Blue exclusion.\nIf needed, add the appropriate volume of NK cell medium to obtain the desired concentration (e.g., 106 cells/mL).\nNote: If phenotypic analysis are performed with the same sample, at this point divide the cells for the phenotypic and the functional analysis before continuing with the protocol.\nFunctional Assay – Day 1\nTiming: 1–2 h\nThis step details how to prepare the cells for the functional assay after the thawing process.",
    "Note: The functional assay consists of two different stimulation conditions: K562 cell line and IL-12+IL-15+IL-18 stimulation. In addition, a non-stimulated condition is needed as a control for each sample. Moreover, an unstained condition is needed for the whole experiment. The unstained condition serves as a control condition to check for cellular autofluorescence. Thus, this condition will be processed the same way as all the other conditions, except for the staining with the viability reactive dye and fluorochrome conjugated antibodies. (See Figure 2[href=https://www.wicell.org#fig2] for a plate set up example).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/228-Fig2.jpg\nFigure 2. Schematic Representation of a Plate Layout for the Functional Assay\nFor each condition, plate 0.5 × 106 of the thawed PBMCs in NK cell medium in a 48 wells plate. If needed, add the appropriate volume of NK cell medium to obtain a final volume of 1 mL/well.\nAdd 10 ng/mL of IL-15 to all the conditions.\nAdd 10 ng/mL of IL-12 and 50 ng/mL of IL-18 to the IL-12+IL-15+IL-18 stimulation condition.\nNote: We individually add each cytokine. However, preparing a master mix would also be fine.\nShake the plate very carefully by hand in a cross motion for 3 s to mix the wells. Then, incubate the cells in the incubator at 37°C and 5% CO2 until the next day.\nNote: In our protocol this incubation lasts for 20–21 h. However, shorter incubation time (17–18 h) may also work.\nFunctional Assay – Day 2\nTiming: 7.5–8.5 h\nThis step details how to perform the functional assay.\nPrepare the K562 cell line for the NK cell stimulation:\nCollect the K562 cells from the 75cm3 flask used for their expansion and place cells in a conical 15 mL tube.\nAdd RPMI 1640 medium with L-Glutamine (Lonza) for washing the cells.",
    "Centrifuge the cells at 300–400 × g for 5 min at 20°C–22°C (RT) and then discard the supernatant.\nAdd again RPMI 1640 medium with L-Glutamine (Lonza).\nCount viable cells by Trypan Blue exclusion.\nCentrifuge the cells at 300–400 × g for 5 min at 20°C–22°C (RT) and then discard the supernatant.\nResuspend the pellet in an appropriate volume of NK cell medium to get a final concentration of 2 × 106 cell/mL.\nOptional: Take the plate with the PBMCs and centrifuge at 200 × g 1 min at 20°C–22°C (RT) with low brake and acceleration. This will fully ensure that PBMCs are settled in the bottom of the plate.\nTake the plate and carefully remove 250 μL of medium from the K562 cell line condition avoiding PBMCs detaching from the bottom.\nAdd 0.5 × 106 K562 cells (250 μL) to each K562 cell line condition well, to get a 1:1 Effector: Target (E:T) ratio.\nCentrifuge the plate at 200 × g 1 min at 20°C–22°C (RT) with low brake and acceleration.\nAdd 20 μL/well of 1:10 diluted PE anti-CD107a monoclonal antibody (mAb) (REA792, Miltenyi Biotec, Cat# 130-111-699) to all the wells except to the unstained condition.\nNote: We prepare a final volume of 20 μL/well of anti-CD107a mAb by diluting it 1:10 with NK cell media. However, the manufacturer's recommended antibody dilution is 1:50 for up to 106 cells or 100 μL. Therefore, we recommend doing a titration to determine the optimal antibody concentration.\nShake the plate very carefully by hand in a cross motion for 3 s to mix the wells. Then, incubate the plate in the incubator at 37°C and 5% CO2 for 1 h.",
    "Individually add 0.66 μL/mL of monensin (GolgiStop) and 1 μL/mL of brefeldin A (GolgiPlug) to all the conditions. On the other hand, a master mix could be prepared before adding the two compounds to the wells.\nShake the plate very carefully by hand, in a cross motion, for 3 s to mix the wells. Then, incubate the plate in the incubator at 37°C and 5% CO2 for 5 more hours.\nNote: This protocol was optimized to continue with the staining steps (see Staining Day-1[href=https://www.wicell.org#sec3.5] section). However, it is also possible to stop the experiment at this point and continue with the staining the next day. For that, after the incubation period is over, take out the plate from the incubator and store it in the fridge (4°C), covered to protect from light, until the next day. Then, continue with step 34 of the protocol.\nStaining – Day 1\nTiming: 3–4 h\nThis step details how to perform the extracellular staining and the fixation.\nAfter the incubation, label cytometry tubes for each condition. Pipette up and down the cell suspension and transfer it from each well into tubes.\nViability staining:\nAdd 2 mL of PBS to each tube and centrifuge at 300–400 × g for 5 min at 4°C.\nDiscard the supernatant and resuspended pellet in 1 mL of PBS.\nIf needed, reconstitute the LIVE/DEAD™ Fixable Aqua Dead Cell Stain Kit reactivity dye by adding 50 μL of DMSO to the vial. Mix well and visually confirm that all of the dye has dissolved.\nNote: We highly recommend performing live/dead staining when working with cryopreserved samples.\nAdd 1 μL of the reactivity dye to all the tubes, except to the unstained condition, and vortex them. Leftover reconstituted viability dye can be frozen and used in future experiments following manufacturer's recommendations.",
    "Incubate for 30 min on ice. Protect from light.\nAdd 2 mL of cold PBS + BSA (2.5%) to all the tubes and centrifuge at 300–400 × g for 5 min at 4°C. Discard the supernatant and resuspend the pellet in residual volume.\nPrepare the antibody mix for the extracellular staining as follow (Table 1[href=https://www.wicell.org#tbl1]):\ntable:files/protocols_protocol_228_9.csv\nNote: The volume of each antibody has been optimized to acquire cells in the MACSQuant Analyzer 10 flow cytometer. We recommend performing antibody titration before starting the experiments.\nNote: We recommend preparing a bit more antibody mix volume than the indicated to ensure that the mix will be enough for all the tubes. For that, when doing the calculations, calculate for one additional tube or add a bit more of PBS + BSA (2.5%) before adding the mix to the tubes.\nNote: We recommend preparing the mix during viability dye incubation (step 35e) to save time.\nCritical: The BD Brillant Stain Buffer is a solution that is added when using two or more antibodies conjugated with BD Horizon Brillant fluorescence polymer dyes (e.g., BV421, BV510, etc.) to avoid fluorescent dye interaction, as these interactions may cause staining artifacts and affect data interpretation.\nExtracellular staining:\nAdd the corresponding volume of antibody mix (77 μL) to each tube, except to the unstained condition, and vortex them.\nIncubate for 30 min on ice. Protect from light.\nAdd 2 mL of cold PBS + BSA (2.5%) to all the tubes and centrifuge at 300–400 × g for 5 min at 4°C. Discard the supernatant and resuspend pellet in residual volume.\nPrepare 150 μL/tube of 4% PFA from the 8% PFA stock buffer by diluting it 1:2 with PBS.\nNote: We recommend preparing a bit more volume of 4% PFA buffer than what is needed.\nCell fixation:",
    "Add 140 μL/tube of 4% PFA and vortex.\nIncubate for 15 min on ice. Protect from light.\nAdd 2 mL of cold PBS + BSA (2.5%) to all the tubes and centrifuge at 300–400 × g for 5 min at 4°C. Discard the supernatant and resuspend pellet in residual volume.\nRepeat step 39c.\nResuspend pellet in 1 mL of cold PBS + BSA (2.5%) and vortex.\nPlace the tubes in the fridge (4°C) protected from light until next day.\nNote: This protocol was optimized to stop the experiment at this point and continue the next day. However, it is also possible to continue performing the permeabilization and the intracellular staining steps. For that, omit steps 40 and 41 and continue as explained in step 44.\nStaining – Day 2\nTiming: 1.5–2.5 h\nThis step details how to perform the permeabilization and the intracellular staining.\nTake the tubes from the fridge and vortex them.\nCentrifuge the tubes at 300–400 × g for 5 min at 4°C. Discard the supernatant and resuspend pellet in residual volume.\nPrepare 3.5 mL/tube of 1× BD Perm/Wash™ Buffer by diluting the 10× BD Perm/Wash™ Buffer with ddH2O.\nCell permeabilization:\nAdd 1 mL of 1× BD Perm/Wash™ Buffer to all the tubes and vortex.\nIncubate for 15 min at 20°C–22°C (RT). Protect from light.\nCentrifuge the tubes at 300–400 × g for 5 min at 4°C. Discard the supernatant and resuspend pellet in residual volume.\nPrepare the antibody mix for the intracellular staining as follow (Table 2[href=https://www.wicell.org#tbl2]):\ntable:files/protocols_protocol_228_10.csv\nNote: The volume of each antibody has been optimized to acquire cells in the MACSQuant Analyzer 10 flow cytometer. We recommend performing antibody titration before starting the experiments.",
    "Note: We recommend preparing a bit more antibody mix volume than the indicated to ensure that the mix will be enough for all the tubes. For that, when doing the calculations, calculate for one additional tube or add a bit more of 1× BD Perm/Wash™ Buffer before adding the mix to the tubes.\nNote: We recommend preparing the mix during cell permeabilization (step 45b) to save time.\nIntracellular staining:\nAdd the corresponding volume (58 μL) of antibody mix to each tube, except to the unstained condition, and vortex them.\nIncubate for 30 min on ice. Protect from light.\nAdd 2 mL of 1× BD Perm/Wash™ Buffer to all the tubes and centrifuge at 300–400 × g for 5 min at 4°C. Discard the supernatant.\nResuspend the pellet with appropriate volume of PBS (200–400 μL) before acquiring the samples in the flow cytometer.\nNote: Before acquiring samples in the flow cytometer, we recommend performing fluorescence compensation to correct the emission spectra overlap of different fluorochromes following flow cytometer manufacturer’s recommendations. However, compensation can be also done after sample acquisition with different flow cytometry data analysis software (e.g., FlowLogic, FlowJo, etc.)."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Culture",
    "Cell-Based Assays"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}