{
  "id": 4636,
  "origin_website": "Bio",
  "title": " Chemiluminescence Detection of the Oxidative Burst in Plant Leaf Pieces",
  "procedures": [
    "Preparation of plant samples, one day before oxidative burst measurements   Label petridishes appropriately and fill half with deionized water.   Cut leaves (younger or highly differentiated) of plants [important: plants should not flower, and should not be too old (about 4-6 weeks)] with scissors and cut off the edge of the leaves with scissors.   Cut the remaining part of the leaf in small, equally sized pieces (e.g. 3 x 3 mm, pieces should easily fit into the wells of a 96-well plate). It is recommended that you cut about 2x to 3x more leaf pieces than you need.   Float leaf pieces on the water in the petridishes (orientation does not matter), avoid submersion!   Cover the samples and incubate overnight (or > 8 h) at room temperature, avoid shaking.      Preparation of samples prior to luminescence measurements, next day    Depending on the luminometer (single cell or multi-well plate reader) 90 µl water + 10 µl luminol master mix (10x) are pipetted into each well of a new 96-well plate. For single cell luminometers this might be scaled up 2x to 3x, according to the size of the measurement cuvette.    Carefully add one leaf piece per well, avoid mechanical damage and wounding! If the pieces are very small one could also use two per well. Use a small spatula, no forceps! Check if all leaf pieces are in the center of the well prior to starting the measurement.   Per planned treatment prepare about 3-4 replicates (each in an extra well); do not forget negative (e.g. untreated) and positive controls; all leaf pieces should have the equal size!",
    "Luminometer measurements Luminometer settings (96-well reader): Measurement duration per well = 1 sec (could be shorter, depending on the limits of your machine); cycle time might be set according to the number of total samples or used wells and the duration of one measurement.  Note: Some software/programs calculate the cycle time depending on the measurement duration and number of samples. Repetitions of measurement cycles/total time should be set to appropriately monitor signals for 20 min up to 60 min. It is recommended that in maximum only half of the plate is occupied with samples since the time difference between the measurement of the first and the last sample is too long. One round of measurement should be less than 60 sec. If you use a single cell luminometer you might just use the continuous mode or use a comparable program such as described above.   Before the induction of a ROS-burst with MAMPs/elicitors, the background level has to be measured to ensure constant values of emitted light over time. Usually a measurement for about 5-10 min is sufficient to control for a stable non-oscillating baseline. If the baseline is not constant within this time the background measurement might be increased up to 60 min.   Interrupt the background measurements and add your MAMP or any triggering substance (usually 1 µl) slightly shake plate horizontally on the table, and continue/re-start the measurement. The elicitors can be added by using an injector integrated in the machine, or by pipetting directly into the wells. Measurement cycles (30-60 sec, each) can be repeated to a total time of 20-60 min or longer if necessary."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}