{
  "id": 19073,
  "origin_website": "Jove",
  "title": "Doppler Optical Coherence Tomography of Retinal Circulation",
  "procedures": [
    "1. Protocol Text\nPatients are scanned by RTVue Fourier-domain optical coherence tomography (OCT) system (Optovue Inc., Fremont, CA, USA) using the circumpapillary double-circular scan (CDCS) and the 3D optic disc scan.\n\t\nThe CDCS pattern consists of two concentric circles around the optic nerve head. The inner ring diameter is 3.40 mm and the outer ring diameter is 3.75 mm. This pattern transects all branch retinal arteries and veins emanating from the optic nerve head. The double circles are performed 6 times in a single scan to cover about 2 cardiac cycles. To calculate Flow velocity, Doppler shift and Doppler will be estimated on vessel detected in the OCT image. (Figure 1a, Figure 1b)\nA \"dual angle\" protocol is used to acquire Doppler OCT scans. In the \"dual-angle\" protocol, 3 scans are obtained with the OCT beam passing through the superonasal portion of the pupil and 3 scans through the inferonasal portion.\nThe quality of each scan is evaluated for signal strength, motion error, and Doppler angle. The technician is required to re-do any scan that did not pass the quality check. A total of 6 acceptable CDCS scans are performed for each eye. The \"dual-angle\" protocol ensures that, for each vessel, at least half of the scans provide good Doppler angles.\nThe 3D disc scan pattern is a raster scan covering a 6x6 mm region around the optic disc. It is only done once and provides a detailed en face image of this area. (Figure 1b)\nA color photograph of the optic disc is also imported to help distinguish arteries and veins.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3524/3524fig1a.jpg\n Figure 1a.  Measuring total blood flow with the circumpapillary double-circular scan and the 3D disk scan using DOCTORC.",
    "The Doppler angle is the angle between probe beam and normal vector of the vessel, and the Doppler signal is the Doppler frequency shift proportional to the flow velocity component parallel to the axis of the probe beam. Thus flow velocity can be estimated from Doppler angle and Doppler signal. However, both Doppler angle and Doppler signal become unreliable when they are below the noise level. On the other hand, when Doppler angle is large, The Doppler shift will be out of the measureable range. When the Doppler angle is appropriate, about 5-15 degrees for the FD-OCT system used in this study, the flow velocity can be correctly estimated by Doppler shift and angle.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3524/3524fig1b.jpg\n Figure 1b. \nThe Doppler angle in each vessel is measured by the relative positions of the vessel lumina in the two concentric circular scans. The axial component of the flow velocity is obtained by the Doppler shift measured from the relative phase of adjacent OCT axial scans. The total flow velocity is calculated from the axial flow component and the Doppler angle. The flow in each vessel is then calculated by integrating the total velocity profile over vessel cross-sectional area. The vessel pattern is matched to the en face image of the 3D disk scan and fundus photograph to identify each vessel as either a vein or an artery. The total retinal flow is calculated by summing flow in the major retinal veins, i.e., those with luminal diameters above 33 μm.\nAll scans of the same eye are exported as raw data using the RTVue software. The raw OCT images, including both Doppler and intensity images, are first tested for image quality using \"Doppler optical coherence tomography of retinal circulation\" (DOCTORC) software.",
    "Eye movements are measured by the pooled standard deviation of the inner limiting membrane and the maximum difference between two frames that is estimated by the bulk motion.\nSignal strength (reflectance and estimation of average Doppler angle) are also calculated.\nAccording to the average eye movement and signal strength of the repeated scans, the data is classified as either \"good\" or \"poor\" in quality. Only good quality data are graded.\nFor acceptable scans, an automated segmentation algorithm is applied to each OCT image for vessel detection.\n\t\nAn automated algorithm that matches vessels is used to locate the same vessel in each frame. The frames on the same circle are registered, and two averaged frames of the inner ring and outer ring are created. Both reflectance and Doppler images are averaged.\nFor an overview, the detected vessel is projected as a line segment onto the en face fundus image calculated from the 3D disc scan.\nGraders review each vessel on a small portion of the averaged inner and outer ring frames overlaid with a circle that represents the automated segmentation result.\n\t\nThe grader judges if the location, vessel diameter, and vessel type (vein/artery) matching the vessel on the two rings are correct according to the OCT image, en face OCT image, and disc photograph of the same eye.\nThe grader is allowed to change any of the above values if he thinks it is necessary. The grader also judges the quality of the Doppler signal in the vessel and gives a subjective confidence score for the vessel label on each scan.",
    "A confidence score of 0-5 is automatically given to each vessel based on Doppler signal strength in the vessel area. It is then manually corrected by the grader based on the strength of the vessel Doppler signal, regularity of vessel boundary, agreement between inner and outer rings of vessel size, and sign agreement of Doppler shift between inner and outer rings.\nAfter all vessels are verified and corrected, an automated algorithm is applied to calculate the blood flow of each vein with a method adapted from our previous publication.1\nThe Doppler signal is integrated over the vessel area and then averaged among all frames. Then the Doppler flow is calculated as the summed Doppler signal divided by the Doppler angle.\nFor each vessel, 6 scans are evaluated on subjective confidence scores, Doppler angles, and Coefficient of variation of the Doppler angles. The flow of a vein is considered valid only if more than 1 scan passes the quality check. For vessels that pass the quality check, the flow is averaged among valid scans.\nFor vessel with invalid results, the flow is estimated using the vessel area and the average flow speed from valid veins. The average flow speed is calculated by summing the flows in the valid veins and dividing by the summed areas of those veins. The estimate of flow starts from the average flow speed and is then corrected for the dependence of flow velocity on vessel area. Larger vessels have a higher average flow velocity. Thus the correction is made based upon the slope of average velocity versus vessel diameter, 2.13, that we previously reported.2\nThe calculated flow of valid veins and the estimated flow of invalid veins are added to determine the total retinal blood flow.",
    "The total retinal blood flow result is evaluated based on the valid venous area percentage, eye movement, and signal strength.\nVenous area and total arterial area are also obtained by adding the vessel areas. Assuming the total retinal blood flow is same in arteries and veins, the arterial and venous velocities are calculated by dividing total blood flow with arterial area and venous area.\n2. Representative Results\nNormal and glaucomatous eyes are selected from the Advanced Imaging for Glaucoma Study (AIGS, www.aigstudy.net[href=http://www.aigstudy.net]). 48 eyes were scanned by the \"dual-angle\" protocol and produced scans that passed the image quality check. Using the DOCTORC software, valid flow measurements could be obtained from 83% of the eyes.\nTo evaluate the reproducibility of the DOCTORC system, another small dataset with 20 eyes was graded by 3 graders. This dataset was also used to train and test graders. 2 graders used the semi-automated DOCTORC software and 1 used an earlier totally manual software employed in previous publications.2,3 The total retinal blood flows (Table 1) determined by the two graders using DOCTORC software are similar to one another and to flow rates determined by the other grader using the manual software. Only 65% of the eyes had valid results because some of the data were not based on dual angle protocol, but single angle protocol.2 The single angle protocol includes 5 Doppler scans obtained with the OCT beam passing through the center of the pupil. Therefore the Doppler angle is more often small and therefore a greater portion of vessels are usually not gradable.",
    "For all graders, the inter-grader reproducibility, as measured by the coefficient of variation, is similar for both glaucomatous and normal eyes (Table 2). Likewise, the reproducibility measurements for the two methods, DOCTORC and the Manual software,1-5 are similar (Table 2). For three graders, a good correlation exists between total blood flow and the pattern standard deviation from visual field tests (Figure 2) for glaucomatous eyes.\ntable:\n﻿0,1,2,3\n,DOCTORC software Manual software3,DOCTORC software Manual software3,DOCTORC software Manual software3\nCondition,Grader 1,Grader 2,\nNormal,47.0±9.1,48.7±7.2,48.0±6.5\nGlaucoma,36.5±5.5,36.7±5.9,34.9±5.1\nTable 1.  Total Retinal Blood Flow using 2 Different Software.\ntable:\n﻿0,1,2\n,Coefficient of Variation,Coefficient of Variation\nGlaucoma (7 eyes),,\nGrader 1 vs. Grader 2(DOCTORC),9.58%,\nDOCTORC vs. manual method3,,\nGrader 1,8.00%,\nGrader 2,9.74%,\nNormal (6 eyes),,\nGrader 1 vs. Grader 2 (DOCTORC),5.99%,\nDOCTORC vs. manual method,,\nGrader 1,8.87%,\nGrader 2,9.98%,\nTable 2.  Reproducibility of Total Retinal Blood Flow Measurements.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3524/3524fig2.jpg\n Figure 2. Correlation between Total Retinal Blood Flow and Visual Field in Glaucoma. a. Grader 1 using DOCTORC software. Visual field loss is summarized by pattern standard deviation (p=0.048). b. Grader 2 using DOCTORC software. Visual field loss is summarized by pattern standard deviation (p=0.032).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}