{
  "id": 2319,
  "origin_website": "Cell",
  "title": "Generation of hematopoietic lineage cell-specific chimeric mice using retrovirus-transduced fetal liver cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe step-by-step method details are divided into two main parts. The first is to prepare a retrovirus, and the second is to make chimeric mice using fetal liver cells transduced with the retrovirus. If a fresh virus is to be used for transduction, the preparation of fetal liver cells should be performed 48 h after transfection of the packaging cells.\n[Part 1] Preparation of retrovirus\nSeeding of the retrovirus-producing cell line – Day 1\nTiming: 30 min\nCells are grown and plated for transfection of retroviral vectors.\nSeed 2.5 × 106 Platinum-E (Plat-E) retroviral packaging cells in 100 mm cell culture plates containing 10 mL of DMEM media with 10% (v/v) FBS.\nIncubate the cells in a 5% CO2 incubator at 37°C for approximately 15 h.\nNote: Cells should be approximately 60% confluent on the day of transfection.\nNote: The health of the packaging cell line is critical for obtaining high levels of the viral yield. It is recommended to use cells passaged no more than 4 times.\nTransfection of the retroviral vectors into the packaging cell line – Day 2\nTiming: 30 min\nA retroviral vector and a retrovirus packaging vector are co-transfected into the seeded cells according to manufacturer’s protocol (Promega, Catalog #:E2311, https://www.promega.kr/-/media/files/resources/protcards/fugene-hd-transfection-reagent-quick-protocol.pdf?rev=2b9dfca8e1aa4c53ad63d5f2b7ca340e&sc_lang=ko-kr[href=https://www.promega.kr/-/media/files/resources/protcards/fugene-hd-transfection-reagent-quick-protocol.pdf?rev=2b9dfca8e1aa4c53ad63d5f2b7ca340e&sc_lang=ko-kr]). Mixing of plasmids and transfection reagents in DMEM medium and transfection of the cells should be performed in a clean bench to avoid microbial contamination.\nBefore working with cells, warm the serum-free DMEM medium in a 37°C water bath for at least 15 min, and allow the vial of FuGENE® HD transfection reagent to reach approximately 25°C.\nAlternatives: OPTI-MEM reduced-serum medium may also be used.",
    "Add 4.5 μg of the cloned retroviral vector and 1.5 μg of pCL-Eco helper plasmid to the pre-warmed medium to reach a final volume of 600 μL. Vortex the tubes and then spin down the contents.\nNote: pCL-Eco helper plasmid contains gag/pol/env genes and is designed to maximize a recombinant-retroviral titer.\nFor a 3:1 FuGENE® HD transfection reagent:DNA ratio, add 18 μL of FuGENE® HD transfection reagent directly to medium and mix immediately by tapping the tube.\nNote: Do not allow FuGENE® HD transfection reagent to contact the sides of the tube.\nIncubate the mixture for 15 min at approximately 25°C.\nCarefully add the mixture to the plated cells in a dropwise manner and mix gently.\nReturn cells to the incubator for 48 h.\nCritical: After 24 h, the transfection efficiency is measured using the GFP signal. Transfection efficiency should be at least 80%.\n1st harvest of retroviral supernatant – Day 4\nTiming: 30 min\nFor retrovirus enrichment, harvest the cell supernatant containing the retrovirus.\nForty-eight h after transfection, harvest the retrovirus-containing supernatants (approximately 90% of the culture medium). Filter through a 0.45 μm filter.\nNote: Use only cellulose acetate or polyethersulfone filters, but not nitrocellulose filters. Nitrocellulose binds surface proteins on the retroviral envelope and destroys the virus.\nAdd 10 mL of fresh DMEM 10% (v/v) FBS medium to the plated cells and return cells to the incubator for 24 h.\nTransfer clarified supernatant to a sterile 15 mL conical tube and combine 3 mL of Retro-X Concentrator with 9 mL of clarified supernatant. Mix by gentle inversion.\nIncubate mixture at 4°C for approximately 15 h.\n1st concentration of retroviral supernatant – Day 5\nTiming: 1 h\nThe retrovirus-containing supernatant is concentrated according to the manufacturer’s protocol (Takara, Catalog #: 631456, https://www.takarabio.com/documents/User%20Manual/PT5063/PT5063-2.pdf[href=https://www.takarabio.com/documents/User%20Manual/PT5063/PT5063-2.pdf]).",
    "After an incubation of the retroviral supernatant with Retro-X concentrator (see step 12), centrifuge the mixture at 1,500 × g for 45 min at 4°C. After centrifugation, an off-white pellet should be visible.\nCarefully remove the supernatant.\nNote: Take care not to disturb the pellet.\nGently resuspend the pellet in 1 mL DMEM 20% (v/v) FBS medium supplemented with antibiotics. The pellet can be somewhat sticky at first, but will go into suspension quickly.\nPause point: The enriched retroviral supernatant can be stored at −80°C in single-use aliquots.\n2nd harvest of retroviral supernatant – Day 5\nTiming: 30 min\nFor retrovirus enrichment, harvest the cell supernatant containing the retrovirus.\nTwenty-four h after adding fresh medium to the packaging cells (see step 10), harvest the retrovirus-containing supernatants. Filter through a 0.45 μm filter.\nRepeat steps 11 and 12.\n2nd concentration of retroviral supernatant – Day 6\nTiming: 1 h\nThe retrovirus-containing supernatant is concentrated according to the manufacturer’s protocol.\nRepeat steps 13–15.\nThe sequence for retrovirus preparation is shown in Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1810-Fig2.jpg\nFigure 2. Preparation of retroviruses\nTo obtain a retrovirus, a retroviral vector and a viral packaging vector are introduced into Plat-E cells. Next, the virus supernatant is harvested twice at 48 and 72 h after transfection. The obtained viral supernatant is concentrated using a Retro-X concentrator. Procedures corresponding to steps 1–18 are shown in the figure. O/N: overnight (approximately 15 h).\nPause point: The enriched retroviral supernatant can be stored at −80°C in single-use aliquots.\n[Part 2] Generation of chimeric mice using fetal liver cells transduced with retrovirus\nPreparation of fetal liver cells – Day 1\nTiming: 1–2 h\nFetal liver cells are obtained from an embryonic day 15.5 fetus.\nEuthanize pregnant mice by CO2 inhalation.",
    "Harvest E15.5 embryos and place them in PBS in a 100 mm cell culture dish on ice.\nNote: Take care to avoid cross-contamination between embryos and mother’s blood. After separating the embryos from the uterus, transfer the embryos to a new dish with PBS. Swirl the dish to remove blood from the embryos.\nEuthanize embryos by decapitation. Dissect liver tissues and place them in a 24-well cell culture plate with 1 mL DMEM 10% (v/v) FBS medium.\nNote: If necessary, cut a section of the tail and place in an Eppendorf microcentrifuge tube for genotyping (see PCR genotyping (optional) – Day 1[href=https://www.wicell.org#sec3.2.2] section). Ensure that the liver sample is numbered in the same manner as the genotyping biopsy.\nTo prepare single cell suspensions, squeeze livers through a 45 μm cell strainer using the end of a 1 mL plastic syringe. Resuspend these samples in 10 mL DMEM 10% (v/v) FBS medium.\nSpin down cells at 300 × g for 5 min at 4°C.\nRemove the supernatant and resuspend cells in 1 mL RBC lysis buffer. Incubate for 1 min at approximately 25°C and stop the lysis reaction by adding 5 mL DMEM 10% (v/v) FBS medium.\nNote: Resuspend the cell pellet completely using a 1000 μL pipette.\nCritical: RBC lysis buffer is a hypotonic solution, and if the reaction lasts for a long time, cells other than RBCs are also damaged. Therefore, the reaction times must be strictly observed.\nAlternatives: Commercially available RBC lysis buffers can also be used. Please follow the manufacturer’s protocol when using commercially available products.\nFilter 6 mL of the cell suspension through a 40 μm pore nylon mesh and spin down cells at 300 × g for 5 min at 4°C.",
    "Remove the supernatant and resuspend cells in 1 mL DMEM 20% (v/v) FBS medium supplemented with antibiotics.\nCount the cells using a hemocytometer.\nPlate fetal liver cells at a density of 4 × 107 cells per 150 mm cell culture dish in 15 mL of DMEM 20% (v/v) FBS medium supplemented with antibiotics, IL-3 (20 ng/mL), IL-6 (50 ng/mL), and SCF (50 ng/mL).\nNote: It is possible to pool cell suspensions from embryos with the same genotype.\nIncubate fetal liver cells at 37°C with 5% CO2 for 24 h.\nPCR genotyping (optional) – Day 1\nTiming: 3–4 h\nIf the embryos have different genotypes, genotyping is required for each embryo.\nAdd 300 μL of 50 mM NaOH to the tail biopsy and dissolve completely in a heat block at 97°C for 1 h.\nNote: Check that the tail is completely dissolved by vortexing.\nNeutralize by adding 50 μL of 1 M Tris-HCl buffer (pH 8.0).\nCentrifuge the samples at 11,500 × g at 4°C for 6 min.\nPrepare a cocktail of PCR reagents for each mouse to be analyzed (Table 4[href=https://www.wicell.org#tbl4]).\ntable:files/protocols_protocol_1810_9.csv\nAdd 1 μL of tail DNA to 11 μL of the prepared cocktail, briefly vortex a mixture, and spin down.\nPerform PCR using the appropriate thermal cycling conditions.\nAnalyze products of the amplification reaction using electrophoresis through an agarose gel to verify the genotype.\nFigure 3[href=https://www.wicell.org#fig3] shows a series of procedures for obtaining E15.5 fetal liver cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1810-Fig3.jpg\nFigure 3. Preparation of embryonic day 15.5 (E15.5) fetal liver cells",
    "The embryos were obtained via cesarean section of female mice on day 15.5 of gestation, and the liver was isolated from the embryos. After obtaining a single-cell suspension, the red blood cells were lysed and then stabilized in the media supplemented with IL-3, IL-6, and SCF. The illustration describes the procedure corresponding to “setting up timed pregnant mice” in the before you begin[href=https://www.wicell.org#before-you-begin] section, and steps 20–37 in step-by-step method details[href=https://www.wicell.org#step-by-step-method-details].\nFetal liver cell harvest – Day 2\nTiming: 1 h\nExplanted fetal liver cells are harvested for retroviral transduction.\nHarvest the fetal liver cells cultured for 24 h (see steps 29 and 30) from 150 mm cell culture plates by pipetting and transfer to a sterile 50 mL conical tube.\nNote: Wash the plates vigorously with 10 mL of PBS and collect into the 50 mL conical tube. Repeat the washing step to harvest as many cells as possible.\nCentrifuge the cells at 300 × g for 10 min at 4°C, remove the supernatant, and resuspend the pellet in 1 mL DMEM 20% (v/v) FBS medium supplemented with antibiotics.\nCount cells and resuspend 3 × 106 cells per 1 mL of DMEM 20% (v/v) FBS medium supplemented with antibiotics, IL-3 (40 ng/mL), IL-6 (100 ng/mL), and SCF (100 ng/mL).\nNote: About 70% of the cells seeded the day before are usually harvested.\n1st transduction – Day 2\nTiming: 3 h\nA retroviral vector is introduced into the fetal liver cells.\nAdd 5 mL of DMEM 20% (v/v) FBS medium supplemented with antibiotics and polybrene (12 μg/mL) to 1 mL of the concentrated retroviral supernatant.\nNote: The dilution ratio can be adjusted to increase transduction efficiency.",
    "Mix the reconstituted retroviral supernatant and fetal liver cell suspension (see step 41) in a 1:1 (v/v) ratio and transfer 2 mL of the mixture per well to a 6-well tissue culture plate.\nSpin the wrapped 6-well plates at 1,000 × g for 60 min at 37°C.\nWhen the spin infection is complete, remove the plastic wrap and place the plates in a 5% CO2 incubator at 37°C for 24 h.\n2nd transduction – Day 3\nTiming: 3 h\nA retroviral vector is introduced into the fetal liver cells.\nAdd 5 mL of DMEM 20% (v/v) FBS medium supplemented with antibiotics, IL-3 (20 ng/mL), IL-6 (50 ng/mL), SCF (50 ng/mL), and 6 μg/mL polybrene to 1 mL of the concentrated retroviral supernatant.\nCarefully add 1 mL of the retroviral supernatant mixture to each well of a 6-well plate with fetal liver cells incubated for 24 h (see step 45).\nWrap the plate with plastic wrap and repeat the spin infection at 37°C at 1,000 × g for 60 min.\nUnwrap the plate and incubate in a 5% CO2 incubator at 37°C for 24 h.\nAddition of fresh supplemented DMEM – Day 4\nTiming: 30 min\nAddition of fresh media maintains fetal liver cells in a healthy condition.\nAfter 24 h, carefully remove the top 2 mL of medium from each well of the 6-well plate containing the fetal liver cells, leaving only 1 mL of medium.\nCritical: Cells mostly tend to cluster in the center of the well and are sucked up very easily by pipetting, so place the tip on the edge and carefully aspirate the supernatant. Spin down at 300 × g for 5 min at 4°C to prevent loss of fetal liver cells before removing the top 2 mL of medium.",
    "Add 1 mL of fresh DMEM 20% (v/v) FBS medium supplemented with antibiotics, IL-3 (20 ng/mL), IL-6 (50 ng/mL), and SCF (50 ng/mL) to each well of the 6-well plate.\nIncubate the cells in a 5% CO2 incubator at 37°C for 24 h.\nIrradiation of recipient mice – Day 4\nTiming: 1 h\nRecipient mice receive systemic lethal irradiation from an X-ray or gamma-irradiator to disrupt their own hematopoiesis.\nIrradiate mice the day before injection of fetal liver cells.\nNote: It may be necessary to empirically establish the optimal radiation dose. We routinely used Rag1−/− mice as recipient mice and irradiated them with 4 Gy.\nAlternatives: In certain cases, cells can be injected on the day of irradiation. However, since damage-associated molecular pattern (DAMP) signaling is activated due to irradiation, injection the next day is recommended to avoid damage to the injected fetal liver cells.\nHarvest of transduced fetal liver cells – Day 5\nTiming: 3 h\nTransduced fetal liver cells are harvested for transplantation into irradiated recipient mice.\nAfter 24 h of incubation, collect the fetal liver cells from 6-well plates by pipetting.\nNote: Wash the plates vigorously with 2 mL of PBS and collect into 50 mL conical tubes. Repeat the washing step to harvest as many cells as possible.\nCentrifuge the cells at 300 × g at 4°C for 10 min and remove the supernatant.\nResuspend the fetal liver cells in 1 mL RPMI-1640 medium supplemented with antibiotics. Keep the cells on ice.\nAlternatives: PBS 0.5% (v/v) FBS may also be used.\nFor each set of fetal liver cells, take a 10 μL sample and count the cells using a hemocytometer.\nResuspend the cells in RPMI-1640 medium supplemented with antibiotics at a concentration of 0.5–1 × 107 cells/mL.",
    "Note: We routinely intravenously inject 2 × 106 cells with a transduction efficiency of 40%–50% per mouse. The number of cells to be injected can be adjusted for transduction efficiency, but the injection volume should not exceed 300 μL.\nAlternatives: PBS 0.5% (v/v) FBS may also be used. Incubate FBS at 56°C for 30 min to inactivate components of the complement system and other potentially unknown cell growth inhibitors present in FBS.\nFor each set of fetal liver cells, take a 10 μL sample and analyze transduction efficiency using flow cytometry based on GFP expression.\nInjection of fetal liver cells and monitoring the mice – Day 5\nTiming: 1 h, 6 weeks\nTransduced fetal liver cells are adoptively transferred into recipient mice. Six weeks after cell transfer, the chimeric mice are euthanized, and immune cells are analyzed via flow cytometry.\nFor injection, load the cells into a 1/2 cc short needle insulin syringe (30-gauge).\nHeat the mice using an infrared lamp and intravenously (via a tail vein) inject 200 μL of fetal liver cells per mouse.\nCritical: Be careful not to heat the mouse for a long time as it may cause skin burns.\nMonitor the mice every week to ensure that they remain healthy.\nNote: If reconstitution does not occur, the mice usually die within 2 weeks.\nAfter 5–6 weeks, collect a small amount of blood from each mouse and confirm reconstitution of immune cells derived from the injected fetal liver cells using flow cytometry based on GFP expression.\nUltimately, sacrifice recipient mice and analyze cells from their lymphoid organs using flow cytometry.\nFigure 4[href=https://www.wicell.org#fig4] shows the retroviral transduction of fetal liver cells and the transplantation of retrovirus-transduced fetal liver cells into recipient mice.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1810-Fig4.jpg\nFigure 4. Adoptive transfer of retrovirus-transduced fetal liver cells to immunodeficient mice",
    "Fetal liver cells were transduced twice with retrovirus. Transduced cells were harvested and injected intravenously into lethally irradiated recipient mice. Six weeks after cell transplantation into irradiated Rag1−/− recipient mice, immune cells were analyzed using flow cytometry. Procedures corresponding to steps 39–64 are shown."
  ],
  "subjectAreas": [
    "Immunology",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Cell Biology",
    "Genetics",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}