{
  "id": 6413,
  "origin_website": "Bio",
  "title": "Characterization of Mouse Adult Testicular Macrophage Populations by Immunofluorescence Imaging and Flow Cytometry",
  "procedures": [
    "Preparing tissue testis sections for IF (Figure 1)Euthanize mice by cervical dislocation.Excise the whole testis organ and place it directly in a Sterilin tube with 1 ml cold Antigenfix. Incubate on a rocking agitator for 3 h at 4 °C.Wash the fixed testis in cold PBS 1x at 4 °C for 20 min.Incubate the testis organ in 5 ml of 30% sucrose solution overnight at 4 °C, until the testis sinks completely to the bottom of the tube.Transfer the testis into disposable base molds in a coronal plane and place immediately into cold (-80 °C) isopentane inside the SnapFrost80. After 2 min, remove the frozen molds and store at -80 °C.Section the mouse testis at 20 µm-thick with the cryostat on SuperFrost slides and store at -20 °C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190225/20190225180155_6272.jpgFigure 1. Coronal testis plane preparation. The testis is placed into disposable base molds with OCT in a coronal plane.Immunofluorescence (Figure 2)Place slides in a microscope slide holder/box, delimit the testis section with a hydrophobic pen and add 100 µl PBS 1x per section for 10 min at room temperature (RT).Incubate in blocking buffer for 1 h at RT.Wash 3 times with the wash buffer solution for 5 min at RT by moving the slide rack up and down between each wash.Place wet tissues into the slide holder/box in order to make a humid chamber for the staining.Incubate with antibodies (100 µl per section) in PBS/0.05% saponin overnight at 4 °C at the following dilutions:Anti-F4/80-Alexa Fluor647 dilution 1/200Anti-MCII-efluor450 dilution 1/500Anti-M-CSFR dilution 1/800After three washes using the wash buffer for 5 min each at RT, incubate for 1 h at RT with anti-rabbit-Alexa Fluor 594, dilution 1/500, for anti-MCSFR antibody detection.Wash slides three times with PBS/0.05% saponin for 5 min each at RT by moving the slide rack up and down several times.",
    "Place slides on a vertical plastic staining rack, protected from the light, in order to dry the slides.Mount slides in Prolong containing Sytox blue dye (see Recipes).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190225/20190225180234_9456.jpgFigure 2. Phenotypic characterization of interstitial and peritubular macrophages by IF. IF imaging of CX3CR1GFP/+ adult mouse testis is revealing morphology, localization, F4/80, MHCII and M-CSFR staining of interstitial and peritubular testicular macrophages. One example of interstitial macrophages is indicated with a blue arrow showing a cell with round morphology and expressing CX3CR1, F4/80 and M-CSFR. One example of peritubular macrophages is indicated with a red arrow showing a cell with elongated morphology and expressing CX3CR1, F4/80 and MHCII. Scale bars = 40 μm.Fluorescence-Activated Cell Sorting (FACS) (Figure 3)Euthanize mice by cervical dislocation.Collect the whole testis organ and place it directly in a 1.5 ml Eppendorf tube in cold PBS containing 1 mg/ml Collagenase II/0.15 mg/ml DNase I. Mechanically dissociate the testis by mincing with scissors directly inside the tube.Place the minced tissue in a thermomixer at 37 °C for 40 min by shaking for enzymatic digestion.Transfer the digested testis through a 50 μm filter placed on top of a 5 ml Falcon tube and filter using 1 ml PBS.Centrifuge the digested tissue in a refrigerated centrifuge for 5 min at 300 x g at 4 °C.Resuspend the pellet of cells in 200 µl of cold PBS and incubate with blocking anti-CD16/32 antibody, dilution 1/200, leaving it on ice for 15 min.Wash in 1 ml cold PBS and centrifuge for 5 min at 300 x g at 4 °C.Incubate single-cell suspensions in cold PBS and stain for expression of surface antigens for 20 min on ice. The following antibodies are used in the same mix preparation:Anti-F4/80-BV785 dilution 1/200Anti-CD11b-BV605 dilution 1/800Anti-CD64-PerCP/Cy5.",
    "5 dilution 1/300 Anti-CD11c-BV711 dilution 1/300 Anti-M-CSFR-PE dilution 1/200 Anti-Ly6C-APC/Cy7 dilution 1/300 Anti-I-A/I-E (MHCII)-PE/Cy7 dilution 1/300 Anti-CD45-BV421 dilution 1/200Zombie Violet fixable live/dead cell dye as a viability marker dilution 1/1,000Wash in 1 ml cold PBS and centrifuge for 5 min at 300 x g at 4 °C. Take up single cell suspension in 800 µl of PBS and pass the solution through a 50 µm filter. The sample is ready for the analysis on FACS. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190225/20190225180310_5670.jpgFigure 3. Phenotypic characterization of interstitial and peritubular macrophages by FACS. Gating strategy describing in CD45+Ly6C-CD11c-F4/80+CD11b+ adult mouse testis fraction, the distinction of interstitial M-CSFR+CD64+MHCII- and peritubular M-CSFRloCD64loMHCII+ population, respectively represented by blue and red gates."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}