{
  "id": 6939,
  "origin_website": "Bio",
  "title": "Real-time <em>in vivo</em> Imaging of LPS-induced Local Inflammation and Drug Deposition in NF-κB Reporter Mice",
  "procedures": [
    "Preparation of hydrogel-LPS mixtureTo make hydrogel containing LPS, add 5 μg LPS (1 mg/ml solution) to 95 μl of 1.5% HEC gel. Vortex the mixture vigorously for 5 min and centrifuge for 3 min (2,575 x g, room temperature) to remove air bubbles. A range of 5-50 μg LPS can be used to obtain different grades of inflammation.Note: Gel LPS mixture should be prepared prior to shaving the mouse dorsum (i.e., before Procedure C). Slowly, take 200 μl of LPS gel mixture in a 1 ml syringe. Avoid taking in air bubbles. Attach a 23-gauge needle to the syringe and adjust the gel volume to 100 μl by slowly removing excess gel from the syringe. Move to Procedure C.Note: Hydrogel is quite thick, do not aspirate using needle as it will be difficult and will produce air bubbles.Preparation of hydrogel-Cy5-labeled drug mixtureIn a 5 ml polypropylene tube, add the required amount of fluorescently labeled drug to the gel and vortex vigorously for 5-10 min. Centrifuge for 3 min (2,575 x g, room temperature) to remove air bubbles. In our study, for in vivo imaging, TCP-25 mixed with 2% (w/w) Cy5 labeled TCP-25 was added to the gel. We used a final concentration of 0.1% TCP-25 in the gel. To study combined effects, drug/drugs can be added along with LPS in the same hydrogel.Note: The hydrogel mixture should be prepared prior to shaving of mouse dorsum (i.e., before Procedure C). Slowly, take 200 μl of drug gel mixture in a 1 ml syringe. Avoid taking in air bubbles. Attach a 23-gauge needle to the syringe and adjust gel volume to 100 μl by slowly removing excess gel from the syringe. Move to Procedure C.",
    "Note: Hydrogel is quite thick, do not aspirate using needle as it will be difficult and will produce air bubbles.Preparation of mice for subcutaneous injectionAfter receiving BALB/c tg(NFκB-RE-Luc)-Xen reporter mice from supplier, keep them in quarantine for at least one week (or depending on animal facility’s rules). A brief description of mouse preparation for subcutaneous gel deposition and imaging is illustrated in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200816/20200816071033_1939.pngFigure 1. Preparation for subcutaneous gel deposition and IVIS imaging. A. Shaving of hair from dorsum of mice with a cordless clipper. B. Subcutaneous deposition of hydrogel. C. Intraperitoneal injection of the substrate D-luciferin. D. IVIS imaging.Anesthetize mice with isoflurane-mixed oxygen (4% isoflurane for induction and 1.5-2% for maintenance). This can be achieved in an IVIS induction chamber or in any other isoflurane-oxygen delivery system. Shave hair from the dorsum (slightly below interscapular region) of mice with a cordless clipper. Depilation can also be achieved with depilatory creams. If depilatory creams are used, it should be performed at least 2 days prior to the subcutaneous injection.Note: Shaving or depilation is necessary as mouse hair can interfere with both luminescence and fluorescence imaging. Wipe and clean the dorsum with alcohol wipe. Move immediately to next step.Subcutaneous deposition of hydrogelManually restrain the anesthetized mice using thumb and forefinger, lift and fold the skin from interscapular area. Insert the needle under the skin and move forward at least 1 cm. Slowly, inject 100 μl of LPS gel mixture, withdraw the needle and put your finger at the site of insertion to prevent any leakage from the site of deposition.Note: As mouse skin is quite loose, ensure that you inject gel in the midline otherwise gel maybe placed to one side. For standard subcutaneous injection procedure please see Shimizu (2004). Immediately after subcutaneous injection, transfer the mice to their respective cages.",
    "IVIS imaging for NF-κB activity (luminescence imaging mode)Fifteen min prior to IVIS imaging, administer D-luciferin solution intraperitoneally into the mice (150 mg/kg body weight). Put the mice back to the cages.Note: We image mice 3, 6 and 24 h post subcutaneous deposition of LPS gel. Anesthetize mice in an induction chamber with 4% isoflurane-mixed oxygen. Complete anesthesia takes approximately 3-5 min.Note: Read IVIS spectrum user manual before using IVIS. Once the mice are anesthetized, start the isoflurane supply (2%) for the IVIS imaging chamber. Immediately, transfer mice to the imaging chamber.Note: Turn on IVIS and start Living Image software at least 15 min prior to the imaging and initialize it. Initialization process cools down the camera to -90 °C. Also ensure that stage heating (37 °C) is working. Place mice in prone position (backside up) on the stage. Position nose in nose cone for anesthesia.Note: Maximum five mice can be imaged at one time. If imaging more than one mouse at a time, ensure that there is minimum lag time between D-luciferin injections. There are other good sources for learning standard IVIS imaging in luminescence imaging mode (Cosette et al., 2016). For imaging, set parameters in IVIS acquisition control panel. Select luminescent (imaging mode), auto (exposure), and D (field of view for 5 mice), or C (field of view for 3 mice).Start imaging by clicking ‘acquire’ in IVIS acquisition control panel.In case of weak signal, auto exposure can be changed to desired time with a maximum of 5 min of exposure. Field of view can be changed according to number of mice to be imaged at one time or size of the area of interest.IVIS imaging for drug deposition (fluorescence imaging mode)Note: Perform fluorescence imaging of the drug immediately after the luminescence imaging.",
    "If purpose of the experiment is only to visualize drug deposition in fluorescence imaging mode, there is no need to inject D-luciferin substrate.In IVIS acquisition control panel, set imaging mode to fluorescence, exposure time to auto, excitation (650 nm) and emission (670 nm) for Cy5.Start imaging by clicking ‘acquire’ in IVIS acquisition control panel.Note: For fluorescent imaging, IVIS spectrum is capable of using wavelength range from 415-850 nm. For in vivo and deep tissue imaging, it is important to note that wavelengths greater than 600 nm are preferred. Animal tissue absorbs significant amounts of light below wavelengths 600 nm. We have successfully used fluorescent labels such as Cy5, Alexa Fluor 660, Alexa Fluor 680, Alexa Fluor 750 and Cy7."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}