{
  "id": 9068,
  "origin_website": "Jove",
  "title": "Measurement of Mitochondrial Oxygen Consumption in Permeabilized Fibers of Drosophila Using Minimal Amounts of Tissue",
  "procedures": [
    "1. Reagents Preparation\nPrepare the following solutions for dissection and permeabilization of the tissue.\n\t\nPrepare preservation solution: 2.77 mM CaK2EGTA, 7.23 mM K2EGTA, 5.77 mM Na2ATP, 6.56 mM MgCl2, 20 mM taurine, 15 mM Na2phosphocreatine, 20 mM imidazole, 0.5 mM dithiothreitol, and 50 mM K-MES, pH 7.1 (can be stored at -20 °C).\nPrepare saponin solution: 5 mg of saponin in 1 mL of preservation solution (prepare fresh daily).\nPrepare the following solutions for the measurement of the respiration.\n\t\nPrepare respiration medium: 120 mM KCl, 5 mM KH2PO4, 3 mM HEPES, 1 mM EGTA, 1 mM MgCl2, and 0.2% BSA (w/v), pH 7.2.\nPrepare substrates, uncoupler, inhibitors. Dissolve all substrates in H2O, and dissolve the uncoupler FCCP as well as the inhibitors in ethanol absolute (except malonate which is diluted in H2O). Neutralize most of the substrates as well as malonate (see Table of Materials). All concentrations given in the protocol are final concentrations inside 2 mL chambers.\n2. Preparation and Calibration of the High-Resolution Respirometer.\nWash the chambers, caps, and stoppers of the respirometer three times with 70% ethanol and three times with distilled water.\nCalibrate at zero oxygen concentration: pipet 2.3 mL of respiration medium in the chambers and add 10 mg of sodium dithionite. Although the maximal volume of the chamber is 2 mL, 2.3 mL are added to ensure that no air bubble stays under the stopper when closing the chambers. Close the chambers with the stoppers and measure the oxygen concentration for 10-20 min. Calibrate the electrodes at zero oxygen concentration with the resulting oxygen consumption rate.\nWash the chambers with distillated water, incubate in absolute ethanol for 10 min, and then rinse with distilled water.",
    "Calibrate at air saturation: pipet 2.3 mL of respiration medium in the chambers, insert the stoppers, aspirate the excess medium on top of the stoppers, and then lift the stoppers with the spacer. Excess respiration medium is pipetted in the chambers (volume of 2 mL total) to avoid the presence of air bubbles after closing the chambers.\nMonitor the oxygen consumption for 45 min to an hour, until the oxygen concentration (blue trace) is stable around 250 nM at 24 °C.\n3. Dissection of Flies and Permeabilization of Tissue\nMake sure all steps are performed on ice.\nAnaesthetize six male flies of the same strain, same age and raised on the same diet on ice to facilitate dissection of the flies (wild-type w1118, 15 days old, fed on cornmeal medium).\nUsing a scalpel and fine-tipped forceps, dissect the flies (remove the heads and abdomens) to keep only the thoraxes containing the flight muscles. This step can be done with the naked eye. Handle the resulting thoraxes with fine-tipped forceps.\nTransfer three dissected thoraxes in a 25 mm Petri dish containing 2 mL of ice-cold preservation solution using the forceps.\nWith the fine-tipped forceps, mechanically permeabilize the thoraxes by inserting the tip of the forceps into the thoraxes and repeatedly tear apart the tissue to obtain a loosely connected network.\nIn a 24-well plate, fill two wells with 12.5 µL of the saponin solution and 1 mL of preservation solution to obtain a final concentration of 62.5 µg/mL of saponin. Fill the two adjacent wells with 1 mL of respiration medium.\nWith the fine-tipped forceps, transfer three permeabilized thoraxes into the diluted saponin solution and incubate with mild agitation on an orbital shaker, on ice, for 20 min.",
    "After the latter incubation, transfer the fibers into the adjacent wells filled with the respiration medium with mild agitation, on ice, for 5 min to rinse off the saponin.\n4. Determination of Dry Weight\nDry the permeabilized thoraxes on an absorbent surface and flip 3-4 times using the fine-tipped forceps to make sure all moisture is removed.\nWeigh the three thoraxes together on a microbalance. Note the obtained weight as it will be used to normalize the mitochondrial oxygen consumption rates.\nTransfer the tissues immediately in a drop of respiration medium on ice.\n5. Oxygen Consumption Rates Determination\nOpen the chambers of the respirometer (remove the stoppers) and add 10 mM of pyruvate and 2 mM of malate into each chamber.\nAdd the permeabilized tissues directly into the chambers filled with the respiration medium.\nReplace the stoppers using the spacer.\nWith a 60 mL syringe, collect oxygen directly from an oxygen tank and inject 2-5 mL of oxygen through the stopper capillary of each chamber to make sure oxygen diffusion through the tissue will not limit oxygen consumption.\nInsert a Hamilton syringe into the capillary of each stopper to make sure the thoraxes remain in the chamber.\nClose the chambers completely when the oxygen concentration is around 400 nM, achieving oxygen levels above air saturation (around 160% air saturation) inside the chambers.\nStop and restart the stirrers to check for air bubbles in the chambers.\nEnter the mass of tissue weighed previously to normalize respiration rates by mass of tissue (mg), displaying mass-specific oxygen consumption (pmol O2 consumed.s-1.mg-1 of tissue).\nOnce the oxygen consumption is stabilized (red trace), add 5 mM ADP with a Hamilton syringe.\nAfter each injection, rinse the syringes with distilled water, 70% ethanol, and distilled water again.",
    "Once the oxygen consumption is stable again, inject 5 µL of a 4 mM of cytochrome c.\nProceed to the sequential injections of the following substrates to evaluate the mitochondrial oxygen consumption at different steps of the ETS:\n\t\nAdd 5 µL of a 2 M Proline.\nAdd 10 µL of a 1 M succinate.\nAdd 30 µL of a 1 M glycerol-3-phosphate.\nInject the uncoupler FCCP in a titration manner by steps of 0.5-1 µM (2 µL of a 1 mM solution) until the optimal concentration is reached, i.e., the concentration to attain the highest oxygen consumption possible without inhibition (CAUTION: see Table of Materials).\nInject the following inhibitors sequentially to entirely inhibit the electron flux in the ETS in order to measure the residual oxygen consumption (ROX) i.e. non-respiratory reactions such as oxygenase reactions among others:\n\t\nAdd 1 µL of a 1 mM rotenone (CAUTION: see Table of Materials).\nAdd 5 µL of a 2 M malonate (CAUTION: see Table of Materials).\nAdd 1 µL of a 5 mM antimycin A (CAUTION: see Table of Materials).\nAdd 0.2 mM ascorbate and 0.5 mM TMPD sequentially into the chambers, starting with the ascorbate to measure the oxygen consumption by complex IV.\nAdd 20 mM of sodium azide to inhibit complex IV (CAUTION: see Table of Materials).\nOnce the signal is stable, open the chambers with the spacer, re-oxygenate the chambers by injecting 2 mL of pure oxygen and close the chambers when the concentration is around 250-300 nmol.mL-1.\nMeasure the signal for 10-15 min and calculate the chemical background, i.e., the oxygen consumption due to autoxidation of TMPD.\n6. Cleaning of the Respirometer\nAfter the measurements, rinse the chambers with distilled water once and rinse the chambers three times in 70% ethanol.",
    "Incubate in absolute ethanol for 10 min to inactivate the inhibitors.\nRinse three times with distilled water, fill the chambers with 70% ethanol and replace the stoppers and the caps until next utilization.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}