{
  "id": 17798,
  "origin_website": "Jove",
  "title": "A Postoperative Evaluation Guideline for Computer-Assisted Reconstruction of the Mandible",
  "procedures": [
    "The Medical Ethics Review Committee of VU University Medical Center (registered with the US Office for Human Research Protections [OHRP] as IRB00002991) confirmed that the Medical Research Involving Human Subjects Act (WMO) does not apply to this study. The FWA number assigned to VU University Medical Center is FWA00017598.\nNOTE: Validate all steps in this protocol independently by two different observers.\n1. Skull and donor site imaging\nExecute both pre- and postoperative scanning with a multiple detector CT (MDCT), using the same machine and scanner settings, with the parameter slice thickness (ST) set <1.25 mm. Perform the postoperative MDCT scan within six weeks after reconstruction.\n\tNOTE: In case of adjuvant radiation therapy, use the first postoperative MDCT scan prior to the therapy.\n2. Classification of the mandibular defect\nClassify the mandibular defect according to the classification of Brown et al.8.\n3. Segmentation of the DICOM images of the postoperative CT scan\nOpen the image-based 3D medical software (e.g., Mimics inPrint 3.0). Click File and New from Disk, then a folder window will open. Select the folder that contains the DICOM images of the postoperative CT scan to import (select the whole folder), choose the right study in the list, and click Convert. A window will pop up for assessment of the orientation of the skull.\nChange the orientation by left clicking the orientation characters; click OK to validate.\nPerform the 5-step segmentation workflow.\n\t\nTo create ROI, click the Thresholding tool. Create the ROI by defining a threshold containing all the voxels of the mandibular bone within a certain interval of gray values, which is proportional to the density of the bony tissue. Manually tweak the Hounsfield range by moving the two sliders on the left and the right. Click the green button to validate the segmentation.",
    "NOTE: The thresholding tool allows the user to select the bone within a range of density, expressed in Hounsfield Units. After this step, a new ROI appears in the ROI tab and the software jumps to the second step of the workflow.\nTo edit ROI, choose the Isolate tool; click the mandible in the 3D viewport, which will be automatically isolated from the cranium and becomes green. Select the option Create result in new ROI. Click the green button to validate the isolation and subsequently all the non-connected structures disappear. Rename the ROI (\"Mandible Post-op\").\n\t\tNOTE: Optionally, use the Lasso tool to remove scattering by editing the ROI directly on the images or in the 3D viewport. When the CT scan is of poor quality, the condyles can be connected to the skull. In that case, click the Split tool, which asks the user to define a foreground and a background. Select Foreground and select the mandible thorough the axial or coronal coupes. Select Background and select the maxilla and cranium thorough the axial or coronal coupes. The region corresponding with the foreground will be kept in the ROI and the region corresponding with the background will be deleted. Click the green button to validate.\nWhen ROI is finished and ready to be converted into a 3D model, click the Add Part button of the workflow toolbar. Click the Solid Part tool. Select the solid part Mandible Post-op and select Off in the Smoothing options. Click the green button to validate.\nWhen the parts are constructed, the software automatically goes to the fourth step of the workflow: edit part. With the contours of the created parts shown on the images, assess the accuracy of the parts. Skip the Smooth tool.",
    "In the last step of the workflow (prepare print), select the Mandible Post-op part in the export menu, choose the output directory, select the 1,00 scale and click the green button to validate.\n\t\tNOTE: The \"Mandible Post-op\" part is now exported as an .STL file.\n4. XYZ axis orientation\nNOTE: The preoperative STL model includes the cranium, (neo)mandible, and the virtually planned dental implants (if planned). Note that the evaluation works easier with separated STL files of the cranium and skull, but still in fixed position to each other. When the preoperative STL model of the cranium and the mandible are merged, use the 3D medical software (following the steps described above) to split the mandible from the cranium.\nOpen the evaluation software (Table of Materials). Drag the preoperative STL file (including virtual plan) in the popped-up screen.\nDetermine the Frankfurt plane, midsagittal plane, and the nasion for uniform orientation of the preoperative STL model of the skull on the XYZ axis.\n\t\nClick Construct | Plane | 3-Point Plane and create a virtual point by using Ctrl + left click both the internal acoustic foramina and the left infraorbital margin (Frankfurt plane)9. Click Create and close after pointing on the STL model.\nClick Construct | Line | 2-Point Line and create a virtual point by using Ctrl + left click the nasion and the basion (midsagittal plane)10.\nClick Construct | Point | Point and create a virtual point by using Ctrl + left click the nasion.\nClick Operations | Main Alignment | Plane-Line-Point. Combine the actual parameter \"Plane 1\" with the nominal parameter \"Plane Z\", the actual parameter \"Line 1\" with the nominal parameter \"Line Y\", and the actual parameter \"Point 1\" with the nominal parameter \"Global coordinate system\".",
    "NOTE: The preoperative STL models of the cranium and (neo)mandible are now fixed to the XYZ axis (Figure 1).\n5. Volume assessment of the pre- and postoperative STL models\nNOTE: Examine pre- and postoperative STL models on volume similarity to rule out volume inaccuracies between the two models as much as possible, since they can influence accuracy measurements.\nSelect the STL file of only the preoperative (neo)mandible under Actual Elements, where all \"Meshes\" are shown. Click Operations | CAD | Actual Mesh To CAD. Select New CAD data in the popped-up menu, rename the file (e.g., \"Mandible Pre-op\") and click OK.\n\tNOTE: The preoperative STL model is now visible under Nominal Elements | CAD in the left explorer menu.\nDrag the postoperative STL model into the software (created during section 3 of the protocol). Rename the file (e.g., \"Mandible Post-op\"). Select the STL file under Actual Elements in the left explorer menu where all \"Meshes\" are shown. Click Operations | Alignment | Single Element Transformation | 3-Point Alignment.\nIn the popped-up menu, combine 3 \"Nominal points\" on the \"Mandible Pre-op\" (e.g., condyle superior, horizontal, and vertical corner of the mandible) with 3 similar \"Actual points\" on the \"Mandible Post-op\" by ctrl + left clicking. Validate with Apply and Close.\n\tNOTE: The STL models will be roughly superimposed on each other based on these 3 landmarks. This will speed up the calculations of the software during the next steps.\nDeselect the Mandible Pre-op and select the Mandible Post-op in the left explorer menu. Click the Select/Deselect on Surface tool in the bottom toolbar. Select a surface on the remnant mandible on both the lateral and medial sides (not in touch with the osteosynthesis material).",
    "Click Operations | Alignment | Main Alignment | Local Best Fit. Select All CAD groups as the targeted element in the popped-up menu. Take a maximum distance of 10.000 mm. Validate with Apply and Close.\n\tNOTE: The selected part of the remnant mandible of the \"Mandible Post-op\" will be accurately superimposed on the similar part of the \"Mandible Pre-op\". Now both models are ready for the STL volume assessment.\nClick the Select/Deselect on Surface tool in the bottom toolbar. Select a surface on only the lateral side within the surface of the previous step. Click Inspection | CAD Comparison | Surface Comparison on Actual. Use a maximum distance of 10.00 mm in the popped-up menu and validate with OK.\nTurn off the Toggle Visibility of the Mandible Post-op. Use the Select Patch tool, left-click the selected surface. Click the magnifying glass on the toolbar above. A round toolbar pops up in the screen. Click Check | Deviation Label Arithmetic Mean and the arithmetic mean in mm will be shown (Figure 2).\nIn case of an arithmetic mean <0.5 mm, continue to section 6 of this protocol. In case of an arithmetic mean >0.5 mm, repeat the postoperative CT scan (DICOM file) segmentation in the 3D medical software by adjusting the threshold values. Repeat the segmentation and superimposition until an arithmetic mean <0.5mm is achieved.\n\tNOTE: The two STL volumes are now ready for valid accuracy comparisons.\n6. Superimposition of the condylar processes",
    "Deselect the Mandible Pre-op and select the Mandible Post-op in the left explorer menu. Click the Select/Deselect on Surface tool in the bottom toolbar. Select the whole surfaces of both condyles by drawing planes (lateral and medial side) from the most caudal point of the incisura mandibulae (mandibular notch) perpendicular to the posterior edge of the border between condyle and the vertical corner.\nClick Operations | Alignment | Main Alignment | Local Best Fit. Select All CAD groups as the targeted element in the popped-up menu. Take a maximum distance of 10.000 mm. Validate with Apply and Close.\n\tNOTE: The selected condyles of the \"Mandible Post-op\" will be accurately superimposed on condyles of the \"Mandible Pre-op\" (Figure 3).\n7. Calculation of the coronal, axial, and sagittal mandibular angles\nNOTE: The identification of bony landmarks is performed separately on the \"Mandible Pre-op\" and \"Mandible Post-op\" STL models. Deselect the Mandible Post-op while identifying bony landmarks in the \"Mandible Pre-op\", and vice versa.\nSelect the Mandible Pre-op in the left explorer menu. Click Construct | Point | Surface Point to determine virtual points on the condyle superior (CS), condyle posterior (CP), vertical corner (VC), and horizontal corner (HC) according to the classification of Brown et al.8.\nSelect the Mandible Post-op in the left explorer menu. Click Construct | Point | Projection Point to determine virtual points on the CS, CP, VC, and HC according to the classification of Brown et al.8.",
    "NOTE: For Brown class Ic, IIc or IVc defects, determine virtual points on the most superior and posterior part of the vertical segment of bone graft or the titanium/prosthetic condyle. If the mandibular resection includes one or more corners, select the most inferior point of the osteotomy plane between the two segments of bone graft. When the mandibular resection includes only half of a horizontal or vertical corner (remnant mandible next to a segment of bone graft), determine a virtual point on the segment of bone graft on the most inferior part of the osteotomy plane. In case of a Brown class I mandibular defect, determine a virtual point on the most anterior and inferior part of the horizontal segment of bone graft and consider this virtual point as the horizontal corner. In case of (extra) osteotomies outside the anatomical vertical or horizontal corner, determine the osteotomy closest to these corners as vertical or horizontal corner.\nTo create a line between 2 virtual points, click Construct | Line | 2-Point Line. Select 2 points under construction elements in the popped-up menu to connect them with a line. Click Create and close.\nCreate a midsagittal plane in both the Mandible Pre-op and Mandible Post-op by clicking Construct | Plane | Plane in Viewing Directions. Select 2 points on the Z-axis.\nTo create an angle between 2 lines, or between a line and a plane, click Construct | Angle | 2-Directions Angle. Subsequently select Line 1, and Line/Plane 2 in the popped-up menu. Click Create and close.\nConnect all the Mandible Pre-op angles to the Mandible Post-op angles by selecting a Mandible Pre-op angle in the explorer menu, then click Magnifying Glass | Measuring Principle | Link to Actual Element. Select the corresponding Mandible Post-op angle, and click OK.",
    "With this knowledge, determine the right and left coronal mandibular angles between the lines from CS to VC and the midsagittal line (ML).\n\t\nDetermine the right and left axial mandibular angles between the lines from VC to HC and ML.\nDetermine the sagittal mandibular angles between the lines from CP to VC and the lines from VC to HC.\nCalculate and report the deviations in degrees (°) between the postoperative angles and the virtual planned angles.\n8. Calculation of the XYZ deviations and distance XYZ of the virtually planned dental implants\nNOTE: Use the correct dental implant diameter and height (including cover screw) during the preoperative planning for correct comparison.\nClick Construct | Point | Point and create a virtual point by using Ctrl + left click in the middle and top of the cover screws of the dental implants in the Mandible Pre-op file.\nClick Construct | Point | Surface Point and create a virtual point by using Ctrl + left click in the middle and top of the cover screws of the dental implants in the Mandible Post-op file.\nRight mouse button click on first dental implant in the Mandible Pre-op. Click Measuring Principle | Link to Actual Element. Select the same dental implant of the Mandible Post-op. Repeat this procedure for all dental implants.\nSelect all the points on the dental implants in both the Mandible Pre-op and the Mandible Post-op files in the left explorer menu. Click the magnifying glass on the toolbar above. A round toolbar pops up in the screen. Click Check and select dXYZ to show the distance XYZ in mm per dental implant using the formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60363/60363eq1.jpg"
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}