{
  "id": 7009,
  "origin_website": "Bio",
  "title": "Dual sgRNA-based Targeted Deletion of Large Genomic Regions and Isolation of Heritable <em>Cas9-free</em> Mutants in <em>Arabidopsis</em>",
  "procedures": [
    "OverviewThe process that generates dual sgRNA-directed large deletion by CRISPR/Cas9 is shown in Figure 1. The vector pKIR1.1 can be ordered from Addgene. A gBlock is composed of a U6 promoter, a gene specific sgRNA protospacer, and a sgRNA scaffold and a terminator.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018122911_4417.jpgFigure 1. Flowchart for isolation of Cas9-free target mutants. 1. Cloning strategy for generation of two gBlocks. 2. Transformation by floral dipping. 3. Screening T1 seeds by red fluorescence. 4. Genotyping and sequencing T1 plants with red fluorescence to identify candidates and harvest seeds from each individual plant. 5. Isolating Cas9-free T2 seeds without red fluorescence. 6. Genotyping T2 plants to obtain stable and heritable null mutants.Generate the middle border of two-gBlocksDesign two gRNAs to target the same gene of interest (GOI) with CRISPRdirect (Naito et al., 2015) (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018122927_4584.jpgFigure 2. Overview of dual-sgRNAs cloning strategy. Schematic representation of the cloning strategy for the introduction of the middle border of two-gBlocks into the pKIR1.1 backbone. pHEE2E-TRI harbors two sets of gBlocks including gBlock1 (a U6-26 promoter, a 19 bp target sequence 1, a sgRNA scaffold, a terminator) and gBlock2 (a U6-29 promoter, a 19 bp target sequence 2, a sgRNA scaffold, a terminator). Therefore, pHEE2E-TRI can serve as a template to amplify the middle border (AarI-overhang1-protospacer1-scaffold-terminator-U6-29 promoter protospacer2-overhang2-AarI) using a pair of dual-sgRNA primers. After digestion of pKIR1.1 plasmid and the middle border both by AarI, the middle border can be integrated into the linearized pKIR1.1 backbone to generate pKIR1.1-dual-sgRNA for plant transformation.Open the CRISPRdirect webpage (http://crispr.dbcls.jp/[href=http://crispr.dbcls.jp/]) and paste a target genomic sequence into text field in a FASTA format or a plain nucleotide sequence up to 10 kb.Note: You can also enter an accession number (e.g., NM_001187) or genome location (e.g.",
    ", hg19: chr7: 900000-901000) to retrieve sequence, or upload a sequence plain text file in a FASTA format or a plain nucleotide sequence up to 10 kb. NGG is selected on the ‘PAM sequence requirement’ panel.Select Thale cress (Arabidopsis thaliana) genome, TAIR10 as the organism.Click on ‘design’.Select two highlighted protospacer sequence by clicking on ‘show highly specific target only’ as shown in the screen shot below (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018122946_4071.jpgFigure 3. gRNA selection. Example screenshot for gRNA selection using the CRISPRdirect webpage.Note: One limitation is to avoid presence of an AarI restriction site on your protospacer sequence. In addition, target sequence can be selected from both DNA strands and should be devoid of TTTTs. The distance between the two sgRNAs depends on your expected deletion regions. Small deletions (<100 bp) can be induced with relatively high frequencies and large one (up to 120 kb) with low frequencies (Ordon et al., 2016) in Arabidopsis. The deletion area at 5′ end or 3’ end of the non-coding region doesn’t show a frequency difference in this sequence from screen shot (NC_003071.7:8122119-8123076 Arabidopsis thaliana chromosome 2 sequence). The 20 nt-protospacer sequence does not have to start with a G, because our linearized plasmids retain a G overhang at the 3′ end of the U6 promoter that serves as the first G preferred for initiating transcription at the U6 promoter. Amplify the middle border from the templet pHEE2E-TRI (Figure 2)Order forward and reverse primers from idtDNA (https://www.idtdna.com/[href=https://www.idtdna.com/]) and dilute them to a final concentration of 10 μM.",
    "Dual-sgRNA1¬_F: 5′-CACCTGCATACATTGN20GTTTTAGAGCTAGAAATAGC-3′Dual-sgRNA2¬_R: 5′-CACCTGCATACAAACN20CAATCTCTTAGTCGACTCTAC-3′AarI: CACCTGC20 nt-protospacer 1 sequence: N2020 nt-protospacer 2 reverse complement sequence: N20Overhang1 (ATTG) and overhang2 (AAAC) in yellowTemplate specific forward sequence in orangeTemplate specific reverse sequence in greenNote: Here we take the first and the last gRNA designs in the screen shot as an example:protospacer 1: TAAACGGGACGGCGACTCAC protospacer 2: CAGAATCGTCAGATCTGAAG protospacer 2 reverse complement sequence: CTTCAGATCTGACGATTCTGPCR amplification with the following setup:table:",
    "﻿0,1\n5x HF buffer,5 µl\ndNTP (10 mM),1 µl\nDual-sgRNA1_F (10 µM),1.25 µl\nDual-sgRNA2_R (10 µM),1.25 µl\npHEE2E-TRI (100 ng/µl),1 µl\nPhusion,0.25 µl\nWater,15.25 µl\ntotal,25 µl\nPCR program:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018120242_9201.pngRun 5 µl PCR product on an agarose gel to check a band with the expected size 620 bp and clean up the rest PCR product using Wizard® SV Gel and PCR Clean-Up System.Ligate the middle border into pKIR1.1 (Figure 2)Digest and phosphorylate PCR product (the middle border)Digest the purified PCR product with AarI for 6 hrs at 37 °C.table:\n﻿0,1\n10x Aarl buffer,5.0 µl\nMiddle border,X µl (=1.5 µg)\nAarI,1.5 µl\n50x oligo,1.0 µl\nWater,42.4 – X µl\nTotal,50 µl\nNote: 50x oligo contains the AarI recognition sequence for stimulating AarI activity (Grigaitė et al., 2002). Both 10x Aarl buffer and 50x oligo are supplied with AarI enzyme from Thermo Fisher. Phosphorylate the digestion mixture for 30 min at 37 °C in the following step, then clean up the mixture using Wizard® SV Gel and PCR Clean-Up System.table:\n﻿0,1\nDigestion mixture,25 µl\n10x T4 ligase buffer,2.83 µl\nT4 Polynucleotide Kinase,0.5 µl\nNote: Skipping the phosphorylation step will lower the ligation efficiency. Digest and dephosphorylate pKIR1.1Digest pKIR1.1 with AarI for 6 h at 37 °C.table:\n﻿0,1\n10x Aarl buffer,5.0 µl\npKIR1.1,X µl (= 1.5 µg)\nAarI,1.5 µl\n50x oligo,1.0 µl\nWater,42.4 – X µl\nTotal,50 µl\nDephosphorylate the pKIR1.1 digestion mixture by 1 μl of phosphatase (CIP) for 30 min at 37 °C and for 10 min at 80 °C.table:\n﻿0,1\nDigestion mixture,50 µl\nCutSmart® Buffer (10x),5.67 µl\nCIP,1 µl",
    "Perform agarose gel electrophoresis with 5 µl of digestion mixture to test the digest. The expected size of digested pKIR1.1 is around 18.5 kb. Clean up the rest digestion mixture using Wizard® SV Gel and PCR Clean-Up System.Note: We recommend using pKIR1.1 plasmid as negative control. The digested linear plasmid fragment runs more slowly with a larger band size and can therefore be distinguished from negative control. Ligate the digested middle border with the linearized pKIR1.1 at 16 °C for 30 min to generate the final vector pKIR1.1-dual-sgRNA:table:\n﻿0,1\nAarI-digested pKIR1.1 vector,X µl (50 ng)\nAarI-digested middle border,X µl (5 ng)\n10x T4 ligase buffer,1.0 µl\nWater,X µl\nT4 Ligase,1.0 µl\nTotal,10.0 µl\nNote: Here we used vector: insert molar ratio 1:3. Transform E. coli competent cells using 10 µl of ligation product and spread the transformed cells on LB agar plates with 100 mg/L Spectinomycin, then incubate the selection plates overnight at 37 °C (transformation protocol is provided by Clontech: http://www.takara.co.kr/file/manual/pdf/tr_PT5055-2.pdf[href=http://www.takara.co.kr/file/manual/pdf/tr_PT5055-2.pdf]).Pick 8 colonies to verify the correct insertion (Figure 4) by colony PCR using forward primer Mlo 1938 and your own protospacer reverse primer with the following setup:table:\n﻿0,1\n10x HotMasterTM Taq Buffer with Mg2+,2 µl\ndNTP (10 mM),0.4 µl\nMlo 1938 (10 µM),1 µl\nDual-sgRNA2_R (10 µM),1 µl\nHotMasterTM Taq DNA Polymerase,0.1 µl\nWater,15.5 µl\nPick half of a single colony with a sterile pipette tip and swirl in the PCR reaction.Use the other half for inoculation.table:\n﻿0,1\nTotal,20 µl",
    "PCR program:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018121642_6260.pngimgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018123019_0567.jpgFigure 4. Electrophoresis of the colony-PCR products. The positive colonies show the correct insertion size with 868 bp. P.C: positive colony, N.C: negative colony.Inoculate the positive colony in LB medium with 100 mg/L Spectinomycin and grow overnight.Extract the plasmid using the DNA plasmid kit.Sequence the plasmid and verify the sequence of the middle border insertion using primer Mlo 1938.Arabidopsis transformation with pKIR1.1-dual-sgRNATransform competent A. tumefaciens GV3101cells with 1 μg of pKIR1.1-dual-sgRNA and spread the transformed cells on LB agar plates supplemented with 100 mg/L spectinomycin, 20 mg/L rifampicin, 25 mg/L gentamycin and 25 mg/L kanamycin (Höfgen and Willmitzer, 1988).After two days of growth at 30 °C, verify plasmid presence in at least three colonies by colony PCR as described before.Transform Arabidopsis plants using Agrobacterium-mediated T-DNA transfer with the floral dipping method (Clough and Bent, 1998).Note: Per construct, we usually transform at least ten Arabidopsis plants. We recommend removing of all present siliques before transformation to avoid excessive screening for transformation events afterwards.Detect dual sgRNA-directed deletion by Cas9Place the T1 seeds in a glass plate and pick up red fluorescent seeds with a slightly wet toothpick under a Stereo Fluorescence Microscope using an EL6000 external light source with magnification 10× and DsRED filter set (excitation, 546/10 nm; emission, 600/40 nm) (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018123040_8436.jpgFigure 5. Visual screen for T1 seeds that harbor the CRISPR/Cas9 construct. pKIR1.1 vector can express the s.p. Cas9 protein driven by the RPS5A promoter, that allows high constitutive expression at all developmental stages including the germ cells. pKIR1.1 also contains an expression cassette of OLE1–TagRFP (red fluorescent protein) that exhibits red fluorescence in seeds. Therefore, the transformants containing CRISPR/Cas9 construct can be observed with red fluorescence in T1 seeds as indicated by circles. Scale bar = 1 mm.Note: The transformation efficiency in this system is around 2.",
    "5%, which allows picking up 25 red T1 seeds within 10 min.Genotype the targeted deletion of T1 plants observed with red fluorescence in seeds by isolating leaf genomic DNA (gDNA) and subsequent PCR (Edwards et al., 1991) using oligonucleotides flanking the deletion site (± 300-500 bp upstream and downstream) (Figure 6):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018123113_8559.jpgFigure 6. Genotyping the dual-sgRNA induced mutation on GOI. The large deletion of the GOI can be detected by PCR with a pair of primers flanking the deletion site (Primer F and Primer R). A shorter amplicon size can be detected in goi mutant compared to WT. table:",
    "﻿0,1\n10x HotMasterTM Taq Buffer with Mg2+,2 µl\ndNTP (10 mM),0.4 µl\nPrimer F (10 µM),1 µl\nPrimer R (10 µM),1 µl\nLeaf gDNA,1 µl (10 ng)\nHotMasterTM Taq DNA Polymerase,0.1 µl\nWater,14.5 µl\nTotal,20 µl\nPCR program:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018122140_1098.pngIsolate Cas9-Free heritable mutationHarvest T2 seeds from individual genotyped T1 plants for the second round of observation under the Stereo Fluorescence Microscope to select the desired progeny. T2 seeds that do not contain the CRISPR/Cas9 construct can be identified since they lack red fluorescence and isolated.Genotype 10 Cas9-free T2 plants by PCR using oligonucleotides flanking the deletion site using phusion polymerase (Figure 7).table:\n﻿0,1\n5x HF buffer,5 µl\ndNTP (10 mM,1 µl\nPrimer F (10 µM),1.25 µl\nPrimer R (10 µM),1.25 µl\nLeaf gDNA,1 µl (10 ng)\nPhusion,0.25 µl\nWater,15.25 µl\nTotal,25 µl\nPCR program:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201018/20201018122430_6845.pngSeparate the PCR products on an agarose gel and extract the shortened goi band with the correct size from the gel using the Wizard® SV Gel and PCR Clean-Up System.Sequence PCR product with Sanger sequencing and verify the sequence of the goi mutation. Usually heritable deletion events can be identified in plants lacking Cas9 activity after selection of seeds lacking the fluorescent reporter."
  ],
  "subjectAreas": [
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}