{
  "id": 2099,
  "origin_website": "Cell",
  "title": "Polar metabolomics in human muscle biopsies using a liquid-liquid extraction and full-scan LC-MS",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nBreakdown of tissue\nTiming: 30 min\nDuring this step, a TissueLyser is used to break down the major biological organization of the muscle biopsies. Try to work in a fume hood as much as possible due to possible methanol vapors. Additionally, keep samples on ice to limit the possible breakdown of more unstable metabolites.\nTo each sample, add the following components in order.\nCritical: Use only MS-grade solvents throughout this protocol.\nCritical: When opening the tubes to add these reagents, statically charged tissue may sometimes jump out of the tube or into the lid. Make sure to only open one tube at a time to protect the other samples and be careful not to lose any material.\nNote: Transferring pure methanol and chloroform accurately can be tricky due to their viscosity. Prime the pipette tip by pipetting these liquids up and down three times before moving the final volume. Positive displacement pipettes can also provide a solution (e.g., Eppendorf® Combitips Advanced).\n500 μL of methanol. (always add this before adding Milli-Q water).\n155 μL of internal standard mixture.\n345 μL of Milli-Q water.\nGently roll a 5 mm stainless steel bead (e.g., Qiagen Stainless Steel Beads, 5 mm) into the tube. Sample should now resemble Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig2.jpg\nFigure 2. Sample after the addition of methanol, Milli-Q water, and internal standard mixture and a stainless steel bead\nAfter the addition of these components, the tissue typically stays intact; e.g., no coloration of the solvents, no dissociation of the tissue itself.",
    "Critical: Solvent ratios during the liquid-liquid extractions are important. Methanol and chloroform are miscible, as are methanol and water. It is the 2:1:1 chloroform:methanol:water (v/v/v) ratio that results in a two-phase system. If, due to human error, this ratio gets disturbed, read the troubleshooting[href=https://www.wicell.org#troubleshooting] section.\nCritical: Muscle tissues specimens are to be considered biohazardous, and appropriate personal protection equipment (PPE) and institutional biosafety protocols should be observed.\nCritical: Methanol vapor is harmful. Wear PPE (e.g., gloves and goggles, depending on institutional guidelines), and work in a fume hood.\nCritical: Do not drop the stainless steel bead into the tube carelessly. Sample may splash out. The bead may also be added before the solvents, but we have found this to be more difficult, due to static effects.\nCritical: Keep in mind that the bead comes into direct contact with your sample. Do not touch the beads with your bare hands and make sure the beads are clean before use. Check with your supplier if the beads you use require a solvent wash before use.\nNote: It is advised to perform a blank extraction as a control to aid peak identification at later stages. The extraction of the control blank sample contains all components, including internal standards, and goes through all steps, but does not contain muscle tissue.\nUse the TissueLyser (e.g., Qiagen TissueLyser II) to break down the tissue for 5 min at 30 times/s. Visually inspect each sample to look like Figure 3[href=https://www.wicell.org#fig3]. Repeat this step if necessary, until all tissues look similar to Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig3.jpg\nFigure 3. Sample after using the TissueLyser\nAfter using the TissueLyser, sample solvents typically look cloudy, and the tissue itself should have lost its flaky structure, instead forming a puffy goo at the bottom of the tube.",
    "Note: In our TissueLyser, position of the sample in the machine influences the distance each sample travels in the arm as the machine is working. To ensure every sample has been treated equally, we tend to reverse the sample position in the sample trays halfway through the procedure.\nLiquid-liquid extraction and isolation of the polar layer\nTiming: 2 h\nDuring this step, further breakdown of biological organization and removal of lipophilic compounds is accomplished through the addition of chloroform. The polar layer of the liquid-liquid extraction is isolated and concentrated.\nCritical: Methanol and chloroform vapors are harmful. Wear PPE (e.g., gloves and goggles, depending on institutional guidelines), and work in a fume hood as much as possible due to possible methanol and chloroform vapors. Additionally, practically useful laboratory gloves (such as nitrile gloves) provide little protection against chloroform spillage. It is strongly advised to read the Material Safety Data Sheet (MSDS) of chloroform before use.\nCreating a two-phase system.\nAdd 1,000 μL of chloroform to the homogenized sample. After addition, samples should resemble Figure 4[href=https://www.wicell.org#fig4].\nUsing a vortex or multi-tube vortexer (e.g., Multi-tube vortex shaker, analogue, VXMTAL), thoroughly mix each sample for 2 min. After mixing, samples should resemble Figure 5[href=https://www.wicell.org#fig5].\nCentrifuge samples for 10 min at 20,000 × g and 4°C (e.g., using an Eppendorf™ Refrigerated Centrifuge). The heavier chloroform is the lower layer, while the top layer is a mixture of water and methanol. In between are precipitated proteins. The top and bottom layers should be roughly of equal size, resembling Figure 6[href=https://www.wicell.org#fig6].\nCritical: Occasionally, chloroform vapor escapes the Eppendorf™ tubes in the centrifuge. Be sure to place the centrifuge in a fume hood or use other effective ventilation before performing this part of the experiment.",
    "Note: Samples can differ quite a bit in color, as shown in Figure 7[href=https://www.wicell.org#fig7], for instance due to blood being present in the samples. This should not alarm you, but it can be useful to make a note of this in your lab journal.\nIsolating the top layer of the extraction for further preparation.\nUsing a 1 mL pipette, carefully transfer approximately 850 μL of the top layer to a clean 1.5 mL Eppendorf™ tube. The transferred phase should be a clear liquid without debris, as shown in Figure 8[href=https://www.wicell.org#fig8].\nCritical: The easiest way to perform this step is by holding the tube in one hand, and pipetting with the other. Be aware that the hand that holds the tube can be exposed to spillage, so wear a glove on whichever hand you use to hold the tubes and work in a fume hood. Keep in mind that it is important not to disturb the chloroform layer during this step. Both from an analytical and safety perspective.\nNote: If the protein pellet is seriously disturbed during isolation, repeat step 3c. If the pellet is flaky, try to avoid it as much as possible. There is a later step that gets rid of residual protein in the mixture.\nConcentrating the samples.\nPlace the 1.5 mL Eppendorf™ tubes in the vacuum concentrator.\nRun the pre-heated vacuum concentrator for 1.5 h at 60°C, or until samples are dry. A yellowish to white residue is typically visible, as shown in Figure 9[href=https://www.wicell.org#fig9], with circular white streaks above it.",
    "Critical: Be aware that methanol has a boiling point of 65°C and the vacuum concentrator is heated to 60°C, causing almost instant evaporation as samples are placed in the machine. As methanol makes up half of the solvent volume and fumes are very harmful, it is strongly advised to perform this step in a fume hood.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig4.jpg\nFigure 4. Sample after the addition of chloroform\nAfter the addition of chloroform, which will form the bottom phase as it is the heaviest solvent in the extraction, the polar top phase typically takes on the color of the muscle tissue.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig5.jpg\nFigure 5. Sample after thorough mixing\nAfter mixing, the top phase appears to be larger than the bottom phase. This is normal and samples will revert back to a 50:50 polar:apolar solvent distribution after centrifugation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig6.jpg\nFigure 6. Sample after centrifugation\nAfter centrifugation, three phases will be visible. A polar top phase, an apolar bottom phase and a protein pellet in between both of those phases.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig7.jpg\nFigure 7. An overview of multiple liquid-liquid extractions of muscle tissues\nColor differences between samples can be quite noticeable; this is to be expected.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig8.jpg\nFigure 8. Isolated polar phase of the liquid-liquid extraction\nThe isolated polar phase should be a clear liquid, without any visible residual protein.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig9.jpg\nFigure 9. Sample after evaporation\nAfter evaporation of the polar solvents using a vacuum concentrator, a yellow(ish) pellet is typically visible. Additionally, white streaks can be visible on the side of the tube (not shown here).\nResuspension and transfer to UPLC autosampler vials\nTiming: 30 min\nDuring this step, metabolites are reconstituted in a solution that is best suited for the UPLC-mass spectrometry analysis, and any residual protein and other insoluble components are removed.\nResuspension of the samples.",
    "Add 100 μL of 3:2 methanol:Milli-Q water (v/v) to each sample in their 1.5 mL Eppendorf™ tube.\nUsing a vortex or multi- tube vortexer, thoroughly mix each sample for 2 min. Samples should be a non-turbid, clear liquid, as shown in Figure 10[href=https://www.wicell.org#fig10].\nCentrifuge samples for 10 min at 20,000 × g and 4°C.\nNote: Place each 1.5 mL Eppendorf™ tube in the centrifuge facing the same direction. This way, any pellet will form in a predictable spot and can be more easily avoided in further steps.\nTransferring supernatant to UPLC autosampler vials.\nCritical: This is the final clean-up step before injection into the UPLC and it is therefore important to be very careful not to transfer any protein or other debris.\nUsing a pipette, carefully transfer approximately, but no more than, an 80 μL volume of supernatant from each sample to clean UPLC autosampler vials (e.g., BGB 1.5 mL Crimp Neck Vial, with a BGB 150 μL Conical Glass Insert), avoiding the pellet. If the pellet is disturbed, repeat step 6c. Samples should resemble Figure 11[href=https://www.wicell.org#fig11].\nCritical: Save the 1.5 mL Eppendorf™ tubes for the next step! Do not throw them away.\nMaking a pooled sample\nTiming: 5 min\nDuring this step, a pooled sample is created that can be used to check analytical robustness.\nPooling the samples.\nDepending on the number of total samples and the size of the pellet in the 1.5 mL Eppendorf™ tube, pipette an amount of supernatant from each sample into a single clean UPLC autosampler vial. Typically, it is possible to take around a 5–10 μL volume from each sample – be sure to vortex-mix the final sample thoroughly. A Pooled sample example is shown in Figure 12[href=https://www.wicell.org#fig12].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig10.jpg\nFigure 10. Sample after reconstitution",
    "After the addition of 3:2 methanol:Milli-Q water, followed by thorough mixing and centrifugation, samples should resemble a clear liquid. It is possible for a tiny pellet to be present.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig11.jpg\nFigure 11. Sample after transfer to a UPLC autosampler vial\nSamples should be completely clear of any debris. Always check the bottom of the vial insert for any solid matter. Any color previously held by the sample is typically not observed in these small volumes. Slightly discolored samples can still be injected, as long as they do not contain any debris or cloudiness.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Fig12.jpg\nFigure 12. Pooled sample for QC measurements\nSample should be completely clear of any debris. When working with larger volumes like the example given here, samples tend to still show some coloration; this is expected.\nCritical: This is the final clean-up step before injection into the UPLC and it is therefore important to be very careful not to transfer any protein flakes or other debris.\nCritical: Make sure there is at least an 80 μL volume of pooled sample available for analysis.\nLiquid chromatography/mass spectrometry\nTiming: 21 min per sample\nDuring this step, chromatographic separation of analytes and full-scan MS analysis is achieved.\nSample table.\nRandomize your samples in the injection sequence before measuring to ensure observed metabolic effects are not analytical artifacts. For instance by using the “=rand()” function in excel and order samples according to the random numbers.\nNote: The goal is to break any pattern in your samples. Be aware that sometimes a random list can still contain problematic patterns. For instance, measuring several samples from a single sample group in a row. Always check your injection orders and adjust if necessary.",
    "Include an injection of the pooled sample - prepared in step 8 of the step-by-step method details[href=https://www.wicell.org#step-by-step-method-details] section - every 10 samples to check and possibly correct for system stability. We advise measuring this sample in duplicate at the start and at the end of the analysis to be able to check for carry-over effects. This sample can also be used at the start of the sequence to equilibrate the column, for instance by injecting the pooled sample twice.\nInclude an injection of a blank sample consisting of the 3:2 methanol:Milli-Q water (v/v) solvent used to dissolve each sample.\nInclude an injection of the blank extraction control blank sample, which contains only internal standards and has progressed through the entire liquid-liquid extraction.\nChromatographic separation.\nIf possible, samples should be chilled at 12°C in the autosampler tray during sample analysis to preserve more sensitive metabolites as much as possible.\nInject a 5 μL volume of each sample onto a Millipore-Sigma SeQuant ZIC-cHILIC column (PEEK 100 × 2.1 mm, 3 μm particle size), with a column heating temperature of 30°C.\nSeparate the metabolites with the following linear LC gradient, using for instance a Waters Acquity UPLC, and the solvents made in steps 4–6 of the before you begin[href=https://www.wicell.org#before-you-begin] section at a flow rate of 0.25 mL/min: Dwell at 100% Solvent B, 0–2 min; Ramp to 54% Solvent B at 13.5 min; Ramp to 0% Solvent B at 13.51 min; Dwell at 0% Solvent B, 13.51–19 min; Ramp to 100% B at 19.01 min; Dwell at 100% Solvent B, 19.01–19.5 min.\nEquilibrate the column using a 0.4 mL/min flow at 100% B from 19.5-21 min.",
    "Note: We have found it practical to keep our UPLC solvents in a reversed phase set-up, even when using ZIC-cHILIC columns, making sure Solvent A is always an aqueous solution and Solvent B is an organic solvent. This makes it easier to flush solvent lines when switching between ZIC-cHILIC and a reversed phase method and we highly recommend this practice. However, it does mean the strong solvent in our method is named Solvent A, going against convention.\nMS analysis.\nSamples should preferably be measured in both positive and negative ionization, using full-scan mode over the range of m/z 50–1200. Additional settings of our Bruker Impact II can be found in Table S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1583-Mmc1.xlsx] MS Settings."
  ],
  "subjectAreas": [
    "Metabolism",
    "Health Sciences",
    "Mass Spectrometry",
    "Metabolomics"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}