{
  "id": 3721,
  "origin_website": "Cell",
  "title": "Protocol for quantitative assessment of social cooperation in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPairing\nTiming: 1 day\nTransfer the desired number of littermate mice from different home cages and house 2 or 4 mice of similar weight per cage.\nCritical: Exclude belligerent mice from pairings to avoid stress effects that might affect social cooperation in the testing phase.\nNote: Male and female mice should not be paired in the same cage.\nCritical: Although the same littermate mice are always used in the behavior test, their weights can be sometimes markedly different. Thus, choose mice with weight differences of less than 10%.\nCheck the identity of ear-tagged mice and document which mice are paired.\nObserve whether mice exhibit any abnormal behaviors (e.g., fighting, jumping) 24 h after pairing (see also Troubleshooting[href=https://www.wicell.org#troubleshooting]).\nNote: Some transgenic mice display heightened aggression or increased anxiety; severely harmed mice should not be further used. LABORAS (Laboratory Animal Behavior Observation Registration and Analysis System), if available, can be used to characterize the home cage activities of paired mice.\nHabituation and training\nTiming: 1 day, ∼15 min/mouse pair\nThe next day, bring the mice to the behavioral testing room and allow them to habituate for at least 30 min, with the room set to testing conditions.\nCritical: Overhead lighting should be minimized to avoid anxiogenic effects that might affect social cooperation performance. Brightness should be measured in all three zones of the maze to ensure that the apparatus is evenly lit. Brightness should be maintained at ∼20 lux.\nCritical: Mice should be water restricted for at least 6 h before habituation to increase motivation to search for the reward.",
    "Before training, 70% (vol/vol) ethanol, paper towels, a pen, a timer, and 20% (wt/vol) sucrose solution should be prepared and available for use. The table and cooperation maze should be cleaned with 70% ethanol to remove any residual odor cues that might affect mouse behaviors.\nConnect two bottles containing 200 mL of 20% (wt/vol) sucrose solution via tubing to a peristaltic pump (Figure 1[href=https://www.wicell.org#fig1]). Turn on a toggle switch to provide ∼100 μL of sucrose solution in a dish located at zone C in the reward zone by manually activating the pump (Figure 1[href=https://www.wicell.org#fig1]). The bottle containing the remaining 20% sucrose solution should be returned to a refrigerator located in the behavioral testing room.\nRemove the cage lid and gently place the paired mice into each divided compartment of the cooperation maze.\nNote: Animals should be handled gently and deftly. To minimize handling stress, do not suspend the mouse by its tail while carrying it.\nStart a timer and allow 15 min for the paired mice to explore the reward zone and nose poke a designated position to sip the 20% sucrose solution provided in the dish. Ensure that mice consume sucrose solution completely during the habituation phase.\nCritical: This step is critical for mice to learn the location of the reward zone (see also Troubleshooting[href=https://www.wicell.org#troubleshooting]).\nRemove mice from the cooperation maze and gently return them to their home cage.\nWipe down the cooperation maze and divider with 70% (vol/vol) ethanol to remove any residual odors, urine, and feces. Ensure that tube is clean and dry without a residual ethanol odor.\nRepeat steps 7–10 on other paired mice.\nTesting\nTiming: 12 days, ∼15 min/mouse pair",
    "The next day, bring paired mice to the behavioral testing room and allow them to habituate for at least 30 min with the room set to testing conditions.\nCritical: Mice should be water restricted for at least 6 h before habituation to increase motivation to search for the reward (see also Troubleshooting[href=https://www.wicell.org#troubleshooting]).\nActivate the video camera linked to computer-installed EthoVision software and divide the horizontal length of the maze into three zones (zone A, zone B and zone C) using a calibrating bar (60-cm in length) (see Methods Video S1[href=https://www.wicell.org#mmc1]). Ensure that the movement of habituated mice is clearly and sharply visible in the “Detection Settings” tab in EthoVision software. Set a video rate of 30 frames/s for detailed frame-by-frame analysis.\nPrepare 70% (vol/vol) ethanol and 20% (wt/vol) sucrose solution in advance and preposition paper towels and a pen. Clean the table and cooperation maze with 70% ethanol to remove any residual odor cues that might affect mouse behaviors.\nRetrieve autoclaved 20% (wt/vol) sucrose solution from the refrigerator where it is stored, place it on the table so that it can come to room temperature (24°C–26°C), and transfer 100 mL of the solution into each bottle connected to a peristaltic pump. Connect tubing to each bottle containing 20% (wt/vol) sucrose.\nTurn on the toggle switch to activate the pump, and confirm that a sucrose droplet is properly dispensed onto the dish (see also Troubleshooting[href=https://www.wicell.org#troubleshooting]).\nRemove the cage lid and separately place the paired mice gently into each divided compartment of the cooperation maze.",
    "Gently place a pair of mice into zone A (virtually designated) of each compartment of the cooperation maze, and start recording by clicking “New Trial” and “Start Trial” buttons of “Acquisition” tab in the EthoVision software for 15 min/trial. Ensure that the pair of mice is located in zone A when recording is started (see also Troubleshooting[href=https://www.wicell.org#troubleshooting]).\nBetween trials with different pairs of mice, clean the cooperation maze and divider with 70% (vol/vol) ethanol.\nAfter the testing session is completed on a specific day, drain the remaining sucrose solution from the tubing and infuse with clean water three times to completely wash out leftover sucrose.\nRepeat steps 15–20 on each subsequent test day.\nNote: After finishing the experiments, ensure that a recording file has been stored in EVXT format in a designated folder on the computer and is later archived for video analysis (see below).\nVideo analysis\nTiming: ∼2 days (variable, depending on amount of recorded data)\nAfter the recording session is completed, click “Statistics & Charts” and “Calculate” tabs sequentially in EthoVision software to obtain the number of mutual rewards and latency for dispensing sucrose solution.\nClick “Integrated Visualization” tab in the EthoVision software and manually inspect the recorded video frames throughout each 15-min trial to ensure nose poking by the mouse pair. Unless both mice exhibit nose poking, it is not counted as a mutual reward.\nRepeat step 23 for all trials performed on days 2–12.",
    "The following parameters should be calculated to reach final conclusions: number of mutual rewards, activity (defined as total distance moved during the 15-min recording session), efficacy (defined as number of mutual rewards divided by activity), and latency (defined as the time to receive the first reward). See “Quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]” section for detailed instructions on how to utilize EthoVision software for analyses."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}