{
  "id": 10974,
  "origin_website": "Jove",
  "title": "Cell-based Therapy for Heart Failure in Rat: Double Thoracotomy for Myocardial Infarction and Epicardial Implantation of Cells and Biomatrix",
  "procedures": [
    "NOTE: Lewis Male and Female rats, 200-220 g were housed under standard laboratory conditions (12 hr light and dark cycle, ad libitum water and food, IVC cage). All animals were treated in compliance with the recommendations of the FELASA and the Swiss Law on animal protection.\n1. Cell Preparation: Mesenchymal Stem Cell Isolation from Bone Marrow\nAnesthetize the rats with isoflurane 5% and O2 5 L/min in an induction chamber for 5 min. Place the animal’s snout into a nose cone connected to the anesthesia system. Perform a toe or tail pinch to confirm sedation.\nRemove the skin from the leg with scissors by cutting the skin from ankle to the hip. Remove the muscles and cut the femoral artery for animal exsanguination. Expose the hip joint and dislocate the femur head. It is important not to damage the femur head. Place the bones in sterile PBS in a 50 ml plastic tube.\nRemove all muscles and ligaments from the bones without breaking them. NOTE: It is important that the bone remains intact to avoid linkage of flushing solution or contamination with ethanol. Rinse the peeled bones in 70% ethanol for 5 min.\nUnder the sterile laminar flow hood, cut both tips of the bones with scissors. Flush the bone marrow by injecting sterile PBS from the bone extremity. Collect marrow into a 15 ml tube. Centrifuge 7 min at 300 x g.\nRemove the supernatant. Suspend the pellet in 3 ml of Red Blood Cell Lysis buffer. Incubate the suspension for 1 min at room temperature before spinning again for 7 min at 300 x g. In a 150 ml culture flask, add sterile cell culture medium (395 ml IMDM medium, 5 ml pen/strep, 100 ml FBS) and seed the cells.",
    "Change medium the second day to remove nonadherent cells.\n\t\nPerform medium changes every second day for 2-3 weeks until desired cell quantity is obtained.\nAlternatively, prepare the biograft by seeding the cells onto the solid matrix as needed and described elsewhere3.\nThe day of cardiac implantation, prepare the cells or harvest the biograft just before epicardial application.\n\t\nCollect the cells using Accutase cell detachment solution. Count the cells. Fill a 1.5 ml centrifuge tube with the volume of cell suspension calculated to obtain desired cell quantity. Centrifuge for 7 min at 300 x g and remove the supernatant.\nAlternatively, harvest the biograft from cell culture medium, rinse in sterile PBS, and keep in fresh culture medium without serum.\n2. First Thoracotomy and LAD Ligation\nWeigh the rat. Turn on the heating pad at 37 °C. Anesthetize the rat with 5% isoflurane and 5 L/min 100% O2 in an induction chamber for 5-7 min. Perform a toe or tail pinch to confirm sedation. Place the rat on the heating pad.\nIntubate the animal with a 14 G i.v. catheter. Connect the intubation catheter to a rodent ventilator programmed for 2.5 L/min oxygen, 2.5% isoflurane, tidal volume of 2 ml, and a breathing frequency of 90 breaths/min.\nPrepare a buprenorphine solution at 0.1 mg/kg. Inject subcutaneously one third of the solution. Shave the left part of the thorax. Disinfect with a 1% Betadine solution.\nIncise the skin perpendicular to the sternum at the fourth intercostal space. Separate the 3 layers of thoracic muscle (pectoralis major, ascending pectoralis, and external oblique pectoralis). Open the fourth intercostal space (between ribs 4 and 5).",
    "Use a small retractor to spread the ribs and to expose the heart. Open the pericardium carefully. Locate and ligate the left anterior descending coronary artery (LAD) with a 7.0 suture 4 mm below the atrium.\nClose the intercostal space with two stitches using 3.0 sutures. Position the two sutures proximally and distally from the sternum. First, tighten the distal suture. Clamp the ventilator exhaust tubing for 2 sec in order to inflate the chest and avoid any pneumothorax. Tighten the second suture. Position the muscles layers back in place (no sutures are needed). Close the skin with a 5.0 suture.\nDisinfect the suture with 1% Betadine solution. Inject the rest of the buprenorphine solution. Turn off the anesthesia system. Remove intubation catheter.\nKeep the rat in the cage under a warm Lamp for 1-2 hr. Keep a thermometer in the cage and control the distance between the warm lamp and the cage in order to avoid over heating.  Return the rat in the IVC unit. Inject subcutaneously Buprenorphine 0.05-0.1 mg/kg post –operatively every 6-12 hr for 48 hr.\n3. Epicardial Administration of the Treatment Via a Second Thoracotomy\nRepeat steps 2.1-2.3.\nIncise the skin perpendicular to the sternum at the fifth intercostal space. Separate the 3 layers of thoracic muscle (pectoralis major, ascending pectoralis and external oblique pectoralis). Open the fifth intercostal space (between ribs 5 and 6).\nUse a small retractor to spread the ribs and to expose the heart. If there is some adherence, carefully remove them with fine forceps.",
    "Locate the infarct area that appears as a pale area below the ligature. NOTE: When necessary, use a 10 cm piece of suture (7.0) inserted at the apex to better visualize the left ventricle. Pull gently to the suture maintained loosely by a clamp to expose the heart.\nApply one of the following treatments:\n\t\nPosition the biograft at the surface of the heart. Use the prefilled fibrin sealant syringe prewarmed at room temperature for 10 min. Apply a drop (50-100 μl) of fibrin sealant under the biograft using a 25 G Luer needle. Verify that the biograft is perfectly sealed.\nAlternatively, apply the cell pellet collected with a pipette tip at the surface of the heart onto the pale area below the ligature. Apply a drop (50-100 μl) of fibrin sealant onto the cell pellet.\nRemove the piece of suture from the apex.\nRepeat steps 2.6-2.8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}