{
  "id": 19437,
  "origin_website": "Jove",
  "title": "Imaging CD19+ B Cells in an Experimental Autoimmune Encephalomyelitis Mouse Model using Positron Emission Tomography",
  "procedures": [
    "imgsrc://cloudfront.jove.com/files/ftp_upload/64133/64133fig1v2.jpg\nFigure 1: Study design. An overview of key techniques in this article. (A) Placing the mice in the scanning bed on their backs reduces motion in the spine. (B) PET/CT imaging of the mice. (C) Make an incision down the dorsal side of the animal to expose the spinal column. (D) Bisect the spinal column into cervical/thoracic and lumbar portions and remove the sections following the five indicated cuts. (E) Use a syringe to remove the spinal cord from the spinal column by making a seal with the syringe and spinal column and flushing from the cranial and caudal ends of the spinal column as shown. (F) Isolated cervical/thoracic and lumbar spinal cord segments. Abbreviation: PET/CT = Positron emission tomography/computed tomography. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64133/64133fig01large.jpg]\nAll animal studies were carried out in accordance with the Administrative Panel on Laboratory Animal Care (APLAC) at Stanford University, a program accredited by the Association for the Assessment and Accreditation of Laboratory Animal Care (AAALAC International). Mice were acclimated to the vivarium for at least 7 days prior to start of study to minimize stress on the mice, as stress can affect EAE induction.\n1. EAE induction in female humanized CD19 mice\nInduce humanized CD19 C57BL/6J female mice aged 9-13 weeks with EAE as previously described5 using MOG1-125.\n2. Animal care and scoring in EAE mouse model\nScore disease progression and care for the mice as previously described5. In brief, score this model on a scale of 1-5 as follows: 1 is tail weakness/limpness, 2 is weakened hindlimbs, 3 is hindlimb paralysis, 4 is hindlimb paralysis with forelimb weakness, 5 is moribund.\n3. mAb conjugation, radiolabeling, and characterization\nConjugate the bifunctional chelator 1,4,7,10-tetraazacyclododecane-1,4,7,10-tetraacetic acid mono-N-hydroxysuccinimide ester (DOTA-NHS-ester) to hCD19-mAb to radiolabel with 64Cu.",
    "Using a desalting column, exchange the hCD19-mAb storage buffer with HEPES buffer (pH 8.5-9): condition the desalting column(s) with HEPES. Calculate the number of columns needed based on desalting column sample volume capacity and volume of mAb required: 0.5 mL tubes: 30-130 µL of sample volume, 300 µL of wash; 2 mL tubes: 200-700 µL sample volume, 1 mL wash.\nCool the centrifuge to 4 °C for buffer exchange via the desalting column.\nRetrieve the desalting column from the fridge. Remove the bottom of the desalting column, loosen the cap, and place the column in a collection tube.\nCentrifuge at 1,500 × g for 2 min to remove the storage solution; discard the flowthrough containing the storage solution and reuse the collection tube. Mark a line on the column where the highest point of the desalting compacted resin is slanted upward.\nAdd HEPES buffer to the lower side of the desalting column. Place the desalting column in the centrifuge with the line facing outward; spin at 1,500 × g for 2 min. Discard the flowthrough and reuse the collection tube.\nRepeat steps 3.1.4 and 3.1.5 2x using the same collection tube and discarding the flowthrough between steps.\nPlace the conditioned desalting column into a new collection tube and label; this tube will contain the hCD19-mAb.\nAdd hCD19-mAb to the top of the conditioned desalting column(s) and use HEPES buffer to rinse the empty mAb vial; add this to the top of the desalting column (total volume as per the manufacturer's recommendation). Spin at 1,500 × g for 2 min to elute the hCD19-mAb. Keep the flowthrough containing the hCD19-mAb.\nMeasure the concentration of hCD19-mAb using a UV/Vis spectrophotometer and adjust to 0.5 µg/µL with HEPES buffer if necessary.",
    "To the hCD19-mAb solution, add 1/50th the volume of the mAb solution of 0.5 M EDTA to make the final concentration of EDTA 0.01 M in the hCD19-mAb solution. Let the hCD19-mAb-EDTA solution stand at room temperature for 15 min.\nRemove the DOTA-NHS-ester from the freezer and allow it to come to room temperature (10-15 min). Calculate the volume of DMSO to add to the DOTA-NHS-ester to make a DOTA concentration that will allow the addition of the desired DOTA/mAb molar ratio (which is typically on the order of 1-2 DOTA/mAb).\n\t\tNOTE: The volume of DMSO-DOTA-NHS-ester added to hCD19-mAb should not exceed 10% of the mAb volume. This should be done using a spreadsheet so it can be done quickly and repeatedly.\nBased on the desired ratio of DOTA to hCD19-mAb, calculate the amount of DOTA-NHS-ester to add to hCD19-mAb.\n\t\tnmol mAb × 10 DOTA/mAb → nmol DOTA → mg of DOTA → mg/mL DOTA/DMSO → mL of DMSO → dilution factor of DOTA/DMSO solution\nWeigh 1-2 mg of the DOTA-NHS-ester, and carefully add the correct volume (calculated in step 3.1.11) of DMSO to the DOTA-NHS-ester; mix and spin down.\nPipette the calculated volume of the DOTA-NHS-ester solution (step 3.1.12) into the hCD19-mAb solution; wipe the outside of pipette tip prior to addition to ensure extra DOTA-NHS-ester is not added (without changing the amount in the pipette). Gently mix and spin down.\nPlace in the fridge (4 °C) to react overnight (12-16 h).\nPurification and concentration\n\t\nCool the centrifuge to 4 °C for the centrifugal concentrator buffer exchange steps; place a metal PCR tube block on dry ice for snap-freezing the conjugate.",
    "Remove the DOTA-hCD19-mAb reaction from the fridge and quench by adding biological grade TRIS buffer: 10% of total reaction volume. Remove 10-20 µg of the sample for mass spectrometry analysis.\nCondition the desalting column(s) as described above (steps 3.1.1-3.1.5), using 0.1 M ammonium acetate buffer, pH 5.5.\nBuffer exchange the DOTA-hCD19-mAb solution to ammonium acetate (steps 3.1.1-3.1.8).\nConcentrate the DOTA-hCD19-mAb solution: add the solution to a 50 kDa molecular weight cut-off centrifugal concentrator following the manufacturer's recommendations on volume. Centrifuge at 4,000 × g for 10 min (or until the volume is reduced by 80%-90%); discard the flowthrough.\nRepeat nine more times (10 total): add enough ammonium acetate to bring the volume back to the maximum recommended volume.\n\t\tNOTE: The total should be what was initially added, including what is left in the column, usually 400-450 µL for a 500 µL capacity centrifugal concentrator.\n\t\t\nRinse the reaction vial with ammonium acetate buffer to retrieve any residual DOTA-hCD19-mAb; add the wash to the centrifugal concentrator.\nCentrifuge at 4,000 × g for 10 min.\n\t\t\tNOTE: The spin time may be reduced on subsequent spins if the volume is reduced to 80%-90% in less time.\nRemove the protein solution from the centrifugal concentrator. Note the total volume of the DOTA-hCD19-mAb.\n\t\t\nIn centrifugal concentrator 2, add enough ammonium acetate buffer for a total volume of 100 µL and pipette to mix. Cap the centrifugal concentrator column and invert. Spin at 4,000 × g for 2 min to collect the solution. Transfer to a new tube.\nIn centrifugal concentrator 500, use a pipette to collect the mAb solution from the centrifugal concentrator; add to a new tube.\nMeasure the concentration using a UV-Vis Spectrophotometer. If the concentration is more than 2 mg/mL, dilute with ammonium acetate to 2 mg/mL.",
    "Aliquot 100 µg per PCR tube (approximately 50 µL); label the tubes with DOTA-hCD19-mAb, date, mass, and concentration. Spin down the vials.\nSnap-freeze the DOTA-hCD19-mAb on the chilled PCR block on dry ice (or freeze on dry ice). Once all the samples are frozen, place them in a -80 °C freezer.\nMeasure the number of DOTA per hCD19-mAb by mass spectrometry. Keep a sample of unconjugated (pure) antibody from each conjugation to calculate the ratio. Use equation (1) given below; molecular weight is abbreviated MW.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64133/64133eq01v2.jpg     (1)\nRadiolabeling\n\tNOTE: Wear appropriate personal protective equipment (PPE) for handling radioactivity, including a lab coat, gloves, and a personal body and ring dosimeters, following institutional regulations. Survey and change gloves regularly to prevent radioactive contamination. Use lead shielding and increase the distance from the radioactive source by handling with tongs when possible.\n\t\nTransfer radioactivity from the shipping vial to a new vial using a pipette. Measure the radioactivity.\nRemove an aliquot for the first radiolabeling reaction. Add 50 µL of ammonium acetate (pH 5.5) per 1 mCi of 64Cu-CuCl3. Measure the pH by pipetting 1 µL onto a pH strip with a range that captures 5.5 with enough resolution to distinguish between 5 and 6.\nIf the pH is not 4-5.5, alter it using 1 M NaOH or 0.1 M HCl. Add small amounts, 1-5 µL, of 1 M NaOH if pH is less than 4 or 0.1 M HCl if pH is greater than 5.5 until the correct pH is reached. With each addition, mix thoroughly, spin down, and measure the pH as described above. Note each addition and removal of any solution (including to check the pH) so the final volume can be calculated.",
    "Once the optimal pH has been achieved, add 10 µg of DOTA-hCD19-mAb per 1 mCi of 64Cu-CuCl3. Mix gently and spin down briefly.\nPlace the reaction vial on a thermomixer set to 37 °C and 400 revolutions per minute (rpm).\nAfter 30 min, quench the reaction: divide the total reaction volume by 50, and add that volume of 0.5 M EDTA to the reaction mixture.\nDetermine the labeling efficiency using instant thin layer chromatography (ITLC) to measure the percentage of bound and free copper in the solution.\n\t\t\nCut 1 cm-wide strips of TLC paper. Mark 1 cm from the top and bottom of the strip and prepare a tube (50 mL conical flask) with mobile phase less than 1 cm of 0.1 M citric acid (the level of mobile phase should be below the 1 cm mark on the strip when placed in the tube).\nPipette 1 µL of the reaction solution on the strip at the bottom 1 cm mark (solvent front) and place the strip in the tube. Watch until the solvent front reaches the top 1 cm mark, remove the strip, and wrap it in a piece of plastic wrap.\nPlace the strip on the platform and run it through a radio-TLC imaging scanner. Look for the radiolabeled mAb at the origin and free 64Cu that travels with the mobile phase front (Figure 2). If the percentage of free copper is less than 5% (95% labeling efficiency), proceed with injection into animals. If the percentage of free copper is greater than 5%, proceed with purification.\n\t\t\tNOTE: The percentage of free copper generally depends on the ratio of DOTA-mAb to 64Cu, reaction time, pH, and temperature. The reaction conditions should be optimized by each user for each new mAb to ensure consistent results.",
    "Purification via a disposable DNA grade gravity column\n\t\nCondition a disposable DNA grade gravity flow column (desalting/buffer exchange column) according to the manufacturer's directions. Place the disposable DNA grade gravity column on a ring stand or other instrument behind adequate lead shielding; ensure the apparatus is stable and easily movable. Place the tube underneath the column.\nPipette the crude reaction mixture onto the gravity flow column resin. Wait until all the liquid has flowed into the resin. Pipette sufficient PBS to bring the entire volume (crude product plus PBS) to 500 µL. Dispose of the flowthrough.\nPlace the column over 1.5 mL centrifuge tubes labeled 1-10. Add 1 mL of PBS to the column. Collect five drops in each tube until the flow has stopped.\n\t\tNOTE: Fewer than 10 tubes may be required.\nCap the bottom of the column and measure the residual radioactivity. Measure each vial with flowthrough. For each vial with more than 50 µCi, prepare an ITLC per step 3.3.7 to measure the percent bound copper in each fraction.\n\t\tNOTE: The first one or two fractions will contain only mobile phase; the radiolabeled mAb will elute first (typically fractions 2 or 3 through 5 or 6) and the free 64Cu will elute last (some will stick to the column). The percent bound 64Cu may vary between fractions.\nCombine the fractions with greater than 95% binding (less than 5% free copper); use the solution for injection. If desired, perform size-exclusion HPLC to confirm radiolabeling5 and calculate the molar activity. Save an aliquot to measure the concentration on a UV-Vis spectrophotometer after it has decayed 10 half-lives (127 h or 5.3 days).\n4. Dose preparation\nNOTE: Before handling the dose, wear proper PPE, including lab coat, body and finger dosimeters, and gloves.",
    "Inject 64Cu-DOTA-hCD19-mAb 18-24 h prior to PET scanning, to allow adequate circulation of the radiotracer in the body.\nImmediately place the lead container with the 64Cu-DOTA-hCD19-mAb behind lead shielding. Turn on the Geiger counter to monitor potential contamination.\n\tNOTE: Change gloves frequently when handling radioactive material. Double-gloving while drawing doses is recommended to facilitate swift glove changes. Always place contaminated sharps and trash in the designated shielded trash area.\nDilute the 64Cu-DOTA-hCD19-mAb to an appropriate concentration in a low bind 1.5 mL plastic centrifuge tube.\n\tNOTE: The 64Cu-DOTA-hCD19-mAb will bind to plastic if it is not low bind; 64Cu will bind to glass.\n\t\nDilute the radiotracer in saline to prevent radiolysis and simplify drawing consistent doses.\nPrepare doses to administer between 75 and 150 µCi in 100 µL, if possible. Ensure that the maximum total injected volume does not exceed 10% of the mouse's body weight.\nUse a 500 µL (50 cc) insulin syringe to draw the dose from the low bind plastic tube. Ensure there are no bubbles in the syringe since it will be injected intravenously.\n\t\nPrelabel the syringes with the corresponding animal numbers.\nRecord the dose activity and time in a lab notebook for data analysis.\nHave the doses ready for injection as soon as the animals are catheterized to reduce time under anesthesia.\nAfter the doses have been prepared, prepare a standard (phantom) for scanning to generate a calibration factor.\n\t\nFill a 15 mL conical tube with 50-75 µCi of activity diluted in water (or PBS).\n\t\tNOTE: Ensure thorough mixing of the solution. The standard can be free 64Cu left over from labeling.\n\t\t\nMeasure the amount of activity in the standard and record the time.\n5. Cannulation and Injection\nNOTE: See previously described methods6 for intravenous cannulation of mice for injection of the radiotracer6.",
    "Weigh and score the mice for disease severity as described in section 2.1 before anesthetizing mice in a knockdown box filled with 1.5-3% isoflurane in preparation for radiotracer administration.\n\tNOTE: These mice will be injected on the bench top, not on the PET scanner as previously described. There is no need to glue the catheters in place for injection, as the mice will not be moved between cannulation and injection.\nOnce a mouse is cannulated, insert the needle into the end of the catheter and inject slowly. After injection, follow with a small saline flush through the catheter to ensure the entire dose is injected.\n\tNOTE: The volume should approximately equal the dead volume of the catheter, which is 50 µL for the catheters used by the authors.\n\t\nInject over a piece of laboratory wipe to collect any drips of radiotracer; include this when measuring the residual dose.\nRecord the time of injection in a lab notebook.\nRemove the cannula immediately after injection. Measure the cannula, dose syringe, and tissue using a dose calibrator to determine the residual dose that was not injected into the mouse.\n\t\nRecord the activity and time in a lab notebook.\nAfter the mice are injected, label their cages with a cage card indicating the mice are radioactive. Record and log the cages according to institutional guidelines. Then, place the mice in a designated radioactive holding area.\n6. PET/CT imaging\nPerform PET imaging 18-24 h after the injection of 64Cu-DOTA-hCD19-mAb. Weigh and score the mice prior to scanning.\n\tNOTE: The scanner operating instructions depend on the scanner being used.\n\t\nEnsure the X-ray component of the PET/CT scanner is warmed up and ready for acquisition.\nOpen the PET scanner acquisition software on the computer.\nFrom the Investigator Login dropdown menu, click on the appropriate lab information.",
    "On the Project page, either create a new project or select an existing project from the dropdown menu.\nWhen the Initialization prompt automatically appears on the screen, click on Home Bed and wait for bed to home. Then, click on Warm up CT.\n\t\t\nEnsure the CT shielding door is closed to allow the CT to warm up.\nWhile the scanner is warming up, score the EAE mice and inject them subcutaneously with 0.2-0.4 mL warm saline in the flank for hydration.\nAfter the scanner is warmed up, go back to the computer to set up the PET scans for the study.\n\tNOTE: These can be set up prior to the day of scan.\n\t\nUnder the Recent Studies header, click on Create New Study. Fill out the study name, protocol, compound, and subject information.\n\t\t\nIf performing a PET/CT, select PET Protocol first, and then select CT Protocol.\n\t\t\tNOTE: Typically, a standard CT is sufficient for scanning the EAE mouse model. A CT scan is 1 min long and acquired with binning at 2 x 2 at voltage 80 kVp, current 150 µA, and 720 projections. CT images are reconstructed using a Modified Feldkamp Algorithm.\nFor the PET protocol, choose a 10-15 min static 64-copper scan. If this scan is not already on the list of available protocols, add it by clicking on the Protocols tab in the Standard menu, Create New Protocol | Isotopes dropdown menu. If the desired isotope is not listed, click on More | Add from Library and add the desired isotope. Define the scan duration, click on the radio button for Static Scan, name the protocol and click on Save.\nReturn to the Studies tab and continue to name and set up all the desired scans for the day.",
    "NOTE: It is recommended to also set up one \"CT Test\" scan using only a standard CT to check the bed positioning of the first scan to ensure optimal placement. This should be the first scan run for the study.\nOnce the scanner is ready, anesthetize the mice in a knockdown box to prepare them for the scan.\n\tNOTE: At this stage, the mice are likely very sick; it is best practice to minimize the time under anesthesia.\n\t\nApply eye gel.\nEnsure the four-mouse scanning bed is equipped with heating elements, such as heating pads or heated air, with isoflurane set to 1.5%-2% and heating pad turned on (Figure 3). Place the mice in a supine position on the scanning bed.\n\t\nAs EAE disease progresses, the spine of the mouse becomes severely curved. Scan the mice while they are on their backs to straighten the spine as much as possible, improving the analysis downstream. Gently pull the mouse tail to aid in straightening the spine.\nOnce in the supine position, securely tape each mouse in place with soft microscope tape. Use one strip of tape over the head and another gently over the belly to minimize motion due to breathing.\n\t\nRecord in a lab notebook which mouse is in what scanning position.\nOnce the mice are secured, return to the scanning computer to operate the scanner.\nOpen the Motion Controller menu. Click on PET Center FOV to move the mice on the scanning bed into the PET ring. For the first scan of the day, click on CT Center FOV. Once in position, run the CT Test scan to ensure the position is correct; repeat until the bed position is satisfactory.",
    "Place a small piece of white tape on the scanning bed to mark the correct bed placement for the remainder of the study.\nOnce the bed is in place for the PET scan, initiate the scanning sequence by clicking on Run.\n\t\nWait for the scanner to automatically move from the PET ring to the CT.\nAlways visually check whether the animals have moved into the proper position for both PET and CT.\nRecord the scan start time in a lab notebook for decay correction of the dose injected during data analysis.\nAfter the scan is complete, allow the image to reconstruct. Check the data before removing the animals.\n\tNOTE: 3D-ordered subsets expectation-maximization (OSEM) reconstruction will take approximately 5 min for a static scan.\nVisually check and approve the data, using the spleen as a positive control as this tissue contains a large number of B cells. Remove the animals from the scanning bed and place them in an isoflurane-filled knockdown box in preparation for perfusion and subsequent dissection.\nRepeat steps 6.5-6.12 for the remaining mice in the study.\nWhen all the mice are scanned or when scanning a group that has an open place in the scanning bed, scan the standard prepared in step 4.6.\n7. Dissection for ex vivo gamma counting and autoradiography\nBefore dissecting, ensure all gamma counting and centrifuge tubes have been pre-weighed.\nPerform euthanasia via perfusion, as previously described6, with PBS and thoracotomy while the mice are deeply anesthetized (continual inhalation of 4% isoflurane, 2 L/min 100% O2).\nTo remove the bone marrow, cut both femurs at the knee and pelvis. Make sure both heads are removed from the femur.",
    "Place both femurs in a 0.5 mL centrifuge tube that has a hole at the bottom (using a 20 G needle) and has the lid cut off.\nPlace the 0.5 mL tube containing the femurs inside a 1.5 mL centrifuge tube with the lid cut off.\nPlace the entire tube setup in a mini centrifuge. Spin for 4 min at 4,500 × g.\n\t\tNOTE: The bone marrow should be dislodged through the hole in the 0.5 mL centrifuge tube and settle at the bottom of the 1.5 mL centrifuge tube.\n\t\t\nSeparate the tubes. Weigh the empty femurs in the 0.5 mL centrifuge tube. Weigh the bone marrow in the 1.5 mL centrifuge tube. Place each centrifuge tube in gamma counting tubes.\nRemove the brain using forceps and scissors, taking care to keep the brainstem intact. Place the brain in a gamma counting tube. Record the dry weight, flush with PBS, and keep on ice until ready for counting.\nTo remove the spinal cord, perform the following steps.\n\t\nRemove the skin and fur by making an incision down the dorsal side of the animal to expose the spinal column (Figure 1).\nSeparate the lumbar (L) from the cervical (C) and thoracic regions by cutting along three transverse planes around and through the spinal column: at the base of the neck (C1 vertebra) (Figure 1D, Number 1); at the base of the ribcage (L1 vertebra) (Figure 1D, Number 2); at the base of the pelvis (L5 vertebra) (Figure 1D, Number 3).\nCut under the rib cage (Figure 1D, Number 2).",
    "Cut directly above the sacrum to separate the lumbar spinal region. Carefully trim the spinal column from the pelvic end until the lumbar spinal cord is visible (Figure 1D, Number 3). Trim off the surrounding tissues to isolate the lumbar and cervical/thoracic regions of the spinal column (Figure 1D, Numbers 4 and 5).\nTo expel the spinal cord, use a slip-tip syringe (3-10 mL) filled with PBS. Create a seal between the syringe and the spinal column using the thumb and forefinger.\n\t\t\nGently push the PBS through the syringe to expel the spinal cord onto an absorbent pad (Figure 1E); repeat for both spinal regions. Place the spinal cord tissues in a gamma counting tube.\nRecord the dry weight, and add PBS to ensure the tissue is at the bottom of tube to avoid drying. Place the tube on ice until ready for counting.\nExpel the cervical/thoracic spinal cord from the cranial end and the lumbar spinal cord from the caudal end of the spinal column (Figure 1E).\n8.​ Ex vivo gamma counting\nOpen the gamma counter software. Navigate to the work list and select the desired protocol, such as a 30 s counting protocol for 64Cu.\nPrepare at least three standards in separate tubes. Run them now for use in analysis (step 10.2). Aim to make three replicate volumes and amounts of activity in three separate tubes.\n\tNOTE: A volume of 500 µL gives good results. While activity will be determined by the machine used, 10 µCi generally works well.\nPlace the standards in a rack labeled with the barcode corresponding to the desired protocol to be run. Place the rack on gamma counter.\nAfter recording the organ weights, place the tubes containing the organs on the gamma counting rack after the tubes containing the standards.",
    "NOTE: Organs of interest for this model can include axial lymph nodes, blood, bone marrow, brain, cervical lymph nodes, femur, heart, liver, lumbar spinal cord, muscle, spleen, tail, and cervical/thoracic spinal cord.\nPut a rack with a stop barcode in the back of the gamma counter.\nPress the Play button on the computer. If possible, do not press Play until there are multiple racks or organs to be run to allow all tubes to be continuously counted in one file. Ensure that a rack with a stop barcode is in the back of the gamma counter for each run.\nRun until all the samples have been counted. Save and export the file.\n9. Ex vivo  autoradiography (ARG) of CNS tissue\nFollow previously published steps for both brain and spinal cord ARG (while excluding steps 2-6 described by Chaney et al., as the mice are already injected with radiotracer from the PET scan)6.\n\tNOTE: Specific instructions for preparing the spinal cord ARG cassette are listed here6.\nAfter gamma counting is complete for the lumbar and cervical/thoracic spinal cords, promptly place the tubes on ice until all CNS tissues have been counted.\n\tNOTE: Refer to the previously published method for ARG of the brain6.\nGently tip the tubes to allow the spinal cords to fall out onto an absorbent pad. If the spinal cord sticks to the side of the tube, gently flush with cold PBS and tip the tube again. Carefully dry each spinal cord by gently blotting with a lab tissue. Place the dried spinal cords in an organized fashion on a thick black piece of paper.\n\t\nLabel next to the spinal cords with a white pen for easy identification.",
    "Leave space at the corners and in the middle of the black paper to place stacks of three microscope slides to act as spacers to prevent the compression of the spinal cords when the ARG cassette is closed. Use 5-7 stacks.\nOnce all the lumbar and cervical/thoracic spinal cords are positioned on the black paper and labeled, carefully place the piece of paper in the ARG cassette. Place the open cassette on a tray of dry ice to freeze the spinal cords.\nOnce frozen, gently place plastic wrap between the digital phosphor storage screen and the spinal cords and place the screen on top of the samples. Immediately close the cassette and place it in the -20 °C freezer for approximately 10 half-lives (~127 h).\nWhen the exposure time is complete, scan the film using a phosphor imager. Analyze the resulting digital image (see section 12 for instructions).\n10. Analysis of biodistribution data\nSet up a \"Dose Correction\" spreadsheet to mathematically determine the time correction for the radioactive decay, thus normalizing radiation doses and allowing comparisons between subjects.\n\t\nDecay-correct all doses to the injection time, accounting for residual activity left in the syringe and catheter after injection.\nUsing the standards prepared in step 8.2, average the activity amount (µCi) and normalized counts per minute (CPM). Divide the average CPM by the average standard activity amount to get CPM/µCi.\n\t\tNOTE: Ensure the activity amount for each standard is decay-corrected to the time the gamma counter counts the CPM of the standards. The gamma counter should normalize all CPM values to the start time of the protocol.\nSet up the \"Results\" spreadsheet to calculate the final percent injected dose per gram of tissue (%ID/g) for each sample.",
    "Decay-correct the normalized CPM from the gamma counter for each sample counted to the injection time of the animal.\n\t\tNOTE: Decay correction can be to any time point; ensure all doses and CPM values are decay-corrected to the same time point.\nNormalize the decay-corrected CPM to the mass of each sample to determine the CPM per sample. Calculate the total CPM injected by subtracting the CPM in the tail from the calculated injected CPM.\n\t\tNOTE: The tail does not need to be mass-corrected as this CPM value will simply be subtracted from the total injected CPM to account for any extravenous tracer from injection.\nDivide the CPM per mass by the total CPM injected to calculate %ID/g.\nSet up a \"Summary\" spreadsheet to display the final results for input into a graphing software and subsequent data visualization and statistical analysis.\n11. PET image analysis\nOpen the PET analysis software. lick on File |Open Local Data | DICOM. Locate the desired file (DICOM format). Open both the PET and CT.\nIn the Data Manager, adjust the PET and CT contrast to the desired levels.\nRegister and crop individual mice.\n\t\nIn the Navigation menu, select the Reorientation/Registration tab.\nGo to the Rigid menu within this tab. Designate the CT scan (0) as the Fixed scan and the PET scan (1) as the Moving scan.\nSelect Rigid Transformation and Fast Quality. Click on Register.\nAfter registration is complete (5-10 min), click on the check mark to save the registration.\nVisually inspect the data to ensure registration was successful. Export the session by clicking on File | Session | Export.\nNext, crop each mouse in a full body crop: go to the Navigation menu and click on Cropping. Drag the sides of each cross section from the outer edge inward.",
    "Once the desired mouse is tightly cropped, click on the check mark, and export the session to save.\nNext, crop and straighten the heads of each mouse for brain analysis using the manual Translation, Rotations, and Flips in the Registration/Reorientation menu. Export to save.\nAnalyze the spinal cord.\n\t\nTo begin analysis of regions of interest (ROIs) in the spinal cord, open the 3D ROI Tool from the Navigation Menu.\nUnder the ROIs header, use the plus sign at the bottom of the menu to create six ROIs: Lumbar ROI, Cervical/Thoracic ROI, Lumbar Skeleton, Thoracic Skeleton, Lumbar Spinal Cord, Thoracic Spinal Cord.\n\t\tNOTE: The Lumbar and Cervical/Thoracic ROIs are generalized large ROIs that will be used to create the skeleton ROIs (Figure 4).\nTo avoid visual interference from the PET signal with this step, click on F3 to turn off the PET.\nGo to the top of the 3D ROI Tool Operator. Click on the solid dot to the right of the cursor symbol to open the 3D Paint Mode and Erode/Dilate menu.\nSelect Sphere and change the size to 20 pixels. Set Dilate to +5.\n\t\t\nBefore proceeding, go to the bottom of the menu. Ensure the Lumbar ROI is selected, as this is the first ROI to be drawn.\nOn the CT, find the L6 vertebra of the spinal column (where the spine meets the hips). Starting one vertebra above L6, draw a rough ROI Lumbar ROI over the five vertebrae above the hips (L1-L5 vertebrae). Then, switch to Cervical/Thoracic ROI and trace the remainder of the spine to the base of the skull.\n\t\tNOTE: This does not have to be precise, as it is used to indicate where Otsu thresholding should occur in step 11.4.8.",
    "After drawing the generalized ROIs, go to the top of the operator. Select the Segmentation Algorithms menu.\nFrom the dropdown menu, select Otsu Thresholding. For the input, select Lumbar ROI. At the bottom of the menu, ensure Lumbar Skeleton is selected. In the dropdown menu next to Image, ensure the CT scan is selected and click on Apply. Repeat for Cervical/Thoracic ROI and Thoracic Skeleton.\n\t\t\nIf the Otsu Thresholding does not sufficiently highlight the spinal column, use Global Thresholding and change the Min value to 350 and the Max to 3,500 for manual thresholding and adjust as necessary to isolate the vertebrae.\nAfter using Otsu Thresholding to create the Skeleton ROIs, return to the Navigation menu (cursor icon). Either delete or checkmark the H (hide) column for both the rough Lumbar and Cervical/Thoracic ROIs to hide them. Checkmark the I (immutable) column for both Skeleton ROIs so they cannot be edited.\nFinally, return to the top of the 3D ROI Tool Operator and go to the 3D Paint menu to draw the Spinal Cord ROIs.\n\t\t\nSelect the Sphere tool again and trace the spinal cord within the skeleton for both Lumbar and Thoracic, ensuring the correct ROI is selected at the bottom of the menu.\nTo erase any ROI, click on Command/Control and draw over the part to be erased.\nCheck the spinal cord ROI from all three planes to make sure there is no ROI drawn outside of the spinal column.\nExport spinal cord analysis results.\n\t\nIf the PET signal was turned off in step 11.4.3, press F3 after the Spinal Cord ROIs are drawn to turn the PET back on, or select the Visual Controller (VC) and click on the PET bar.",
    "Go back to the Navigation menu (cursor icon). Click on the grid icon to Show Table. Copy the table into spreadsheet software and save.\nLastly, export the file in PET analysis software, as described above, to save the ROIs drawn.\nAnalyze the brain using a semi-automated 3D atlas.\n\t\nOpen the head crop file. Import the mouse brain atlas by going to the Advanced Modules menu and selecting the 3D Brain Atlas Tool. Make sure the reference is set to CT and the crop option is unchecked. Set a pathway for the output directory.\nIn Advanced Setting, change Transform to Versor-Affine. Keep all other default settings. Click on Run.\nManually adjust the atlas in the Reorientation/Registration menu and use the CT of the skull as a guideline for fitting the atlas.\n\t\t\nUse great care if scaling is necessary, as this can greatly affect brain structure volumes. Click on the checkmark when adjustment is complete.\nRerun the atlas with Import 3D ROIs selected.\nExport the file to save the atlas fitted to the cropped head.\nAfter drawing and exporting all ROIs from the desired organs, calculate a standard binding correction value. Decay-correct all data and convert to %ID/g as previously described6. Normalize to the organ that suits the animal model, such as the heart to normalize to radiotracer present in the blood pool.\n12. Ex vivo autoradiography analysis\nOpen the digital image file (.gel) using the image analysis software. Adjust brightness and contrast to the desired threshold. Apply a suitable color lookup table if desired.\n\tNOTE: Royal or Grays are recommended for ease of visualization."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}