{
  "id": 13496,
  "origin_website": "Jove",
  "title": "Isolation of Endothelial Progenitor Cells from Human Umbilical Cord Blood",
  "procedures": [
    "This research was carried out with the approval of the University of Arkansas Institutional Review Board (Approval number 16-04-722). Umbilical cord blood units were collected in citrate phosphate dextrose (CPD) solution at the Arkansas Cord Blood Bank, and units that did not meet the requirement for storage were donated for research. Cord blood units were couriered to the lab within 24 h of collection at ambient temperatures.\n1. Isolation of Endothelial Progenitor Cells from Cord Blood\nPreparation of reagents.\nPrepare EGM by adding endothelial basal medium (EBM) to 10% fetal bovine serum (FBS) supplemented with 20 ng/mL of insulin-like growth factor (IGF), 1 µg/mL ascorbic acid, 5 ng/mL recombinant human epidermal growth factor (rhEGF), 22.5 µg/mL heparin, and 0.5 ng/mL vascular endothelial growth factor (VEGF), along with 10 ng/mL of recombinant human Fibroblast growth factor B (rhFGF-B), 0.2 µg/mL hydrocortisone, and 2% penicillin-streptomycin-glutamine. Sterilize the culture medium using a 0.2 µm polyethersulfone (PES) membrane vacuum filter.\nPrepare rat tail I collagen solution at a concentration of 50 µg/mL using 0.02 N acetic acid. Sterilize this solution using a 0.2 µm syringe filter.\nPre-coat 6-well plates with 2 mL of prepared rat tail I collagen solution for each well. Place them in an incubator maintained at 5% CO2 and 37 °C for at least 1 h before seeding.\nDilute approximately 25 mL of cord blood with Hanks Balanced Salt Solution (HBSS) at a 1:1 concentration.\nPrepare radio-immuno precipitation assay (RIPA) Buffer using 150 mM sodium chloride, 1% Triton X-100, 0.5% sodium deoxycholate, 1 mM β-glycerophosphate, 0.1% SDS, and 50 mM Tris (pH 8.0).\nIsolation of endothelial progenitor cells.\nWarm all prepared reagents in a water bath maintained at 37 °C prior to isolation.\nAdd 20 mL of density gradient medium reagent to a 50 mL centrifuge tube.",
    "Carefully layer 20 mL of diluted cord blood in the centrifuge tube containing density gradient medium without breaking this layer by aiming the pipette towards the side walls of the tube.\nSeparate the components of blood based on their densities (Figure 1) by centrifuging at 800 x g for 30 min at room temperature, with the brakes of the centrifuge rotor off. Do not disturb the different layers.\nRemove the plasma layer by carefully pipetting it out of the tube without disturbing other cell layers until the pipette tip is able to reach the MNC layer (see Figure 1). Discard the removed plasma.\n\t\tNOTE: While using pipette tips to remove the plasma, leave a small layer of plasma above the MNC layer (Figure 1) to reduce disturbances.\nCollect the buffy coat that contains the MNCs using a syringe fitted to an 18-gauge needle and transfer it to a fresh centrifuge tube.\nAdd an equal volume of EBM to the collected MNCs. Centrifuge these tubes at 500 x g for 10 min at 4 °C. Discard the supernatant.\n\t\tNOTE: The cell pellet will appear red because of the presence of red blood cells/erythrocytes.\nAdd 5 mL of ammonium chloride solution to lyse the red blood cells. Incubate this tube on ice for 5 - 10 min, with occasional shaking.\n\t\tNOTE: Caution should be taken during this step to not exceed the time duration, as it can be harmful to the MNCs.\nCentrifuge the tubes at 500 x g for 10 min at 4 °C and discard the supernatant. If erythrocytes persist, repeat steps 1.2.8 and 1.2.9 until no red color is observed in the pellet.\nResuspend the pellet in prepared EGM and use the hemocytometer to count the MNCs.",
    "Aspirate the rat tail I collagen-coated 6-well plate (from step 1.1.3) and wash the wells three times with 1x phosphate-buffered saline (PBS).\nSeed the MNC pellet resuspended in EGM to the collagen plate at a concentration of 1 x 107 MNCs in each well. Place it in the 37 °C, 5% CO2 incubator.\nAfter 24 h, aspirate the medium and wash the wells once with EGM. Add 3 mL of EGM medium to each well and place it back in the 37 °C, 5% CO2 incubator.\nReplenish the plate with fresh EGM medium every day for 7 days. After 7 days, change the EGM medium every other day.\nUsing a bright-field microscope, take images of the 6-well plate every day to track the progression of endothelial cell colonies. Mark the plate where the colonies arise to keep track of their growth.\n\t\tNOTE: It usually takes between 5 and 9 days for the colonies to appear in culture.\nExpansion of endothelial progenitor cells.\nCoat the T-25 culture flask with rat tail I collagen (50 µg/mL) and place it in the 37 °C, 5% CO2 incubator for at least 60 min. Aspirate and wash the T-25 cell culture flask three times with 1x PBS prior to seeding the cells.\nTrypsinize the endothelial cell colonies when they reach about 3 mm in size using 150 µL of 0.05% Trypsin-EDTA solution in each well. Place the 6-well plate back into the 37 °C, 5% CO2 incubator for 2 - 3 min.\nGently tap the 6-well plate to dislodge the attached cells. Immediately add 2 mL of EGM and recover the cells in a 15 mL centrifuge tube.\nCount the cells using a hemocytometer and calculate the initial seeding density.",
    "Spin the 15 mL centrifuge tubes at 400 x g for 5 min. Resuspend the cell pellet in EGM and seed the T-25 flask with ~500,000 cells. Mark this flask as Passage 1 and place the T-25 flask back in the 37 °C, 5% CO2 incubator.\n\t\tNOTE: Cells can be plated in EBM and DMEM to compare the growth with EGM.\nFor further passages, when the flask reaches 90% confluence, follow steps 1.3.1 - 1.3.5 and reseed the cells at 104 cells/cm2 on T-75 or T-175 cell culture flasks. Proceed to the characterization of the isolated cells (steps 2 and 3).\n2. Characterization of Isolated Cells Using Western Blotting\nAdd 50 - 100 µL of lysis buffer at every passage when following the expansion steps to characterize the isolated cells. Collect proteins from approximately 500,000 or more cells.\nPipette up and down vigorously to rupture the cells and release the proteins. Collect and transfer the buffer to a microcentrifuge tube.\nSpin the microcentrifuge tube at 500 x g and carefully transfer the supernatant to a new microcentrifuge tube. Label and store the tubes at -80 °C for long-term storage.\nQuantify the amount of proteins in each tube using either Bradford's or BCA assay27,28,29.\nCarry out Western blotting using standard procedures27,28,29. Analyze 5 µg of total protein for the expression of CD31, CD34, VEGFR2, and α-SMA. Use α-tubulin for normalizing the data.\n3. Indirect Immunofluorescence\nSonicate 18-mm glass coverslips in 50% ethanol and dry them. Leave the clean coverslips in a 12-well plate overnight in the biosafety hood with a UV light on to sterilize them.\nCoat the coverslips with 50 µg/mL of rat tail I collagen and transfer the plate to a 37 °C, 5% CO2 incubator for at least 60 min.",
    "Aspirate the collagen and add 1 mL of 1x PBS to the 12-well plate to wash the coverslips. Aspirate the 1x PBS and repeat twice.\nSeed 250,000 cultured EPCs in each well and place them back in the 37 °C, 5% CO2 incubator for at least 3 days before carrying out immunostaining.\nWash the plate 3 times with 1x PBS. Add 1 mL of ice-cold methanol to each well and incubate at room temperature for 15 min to fix the cells.\nCarry out immunostaining using a standard protocol27,28,29. Use the antibodies at their appropriate dilutions (e.g., CD31 (1:20), CD34 (1:50), α-SMA (1:100), and VEGFR2 (1:50)).\nTake images of the immunostained coverslips using an epifluorescence microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}