{
  "id": 15189,
  "origin_website": "Jove",
  "title": "Genetic Engineering of Dictyostelium discoideum Cells Based on Selection and Growth on Bacteria",
  "procedures": [
    "1. Preparation of Cells and Materials\nSorMC buffer preparation\nPrepare 100 mL of 100x SorMC (Sorensen buffer including MgCl2 and CaCl2) buffer by dissolving 20.36 g of KH2PO4 (15 mM) and 5.47 g of Na2HPO4·7 H2O (2mM) in 100 mL of ddH2O water. Stir the solution at room temperature (RT) and bring the volume to 100 mL with dH2O.\nNOTE: The resulting buffer has a pH of 6 and does not need further adjusting.\nProduce 1000 mL of 1x working solution in ddH2O. Add 50 µL each of MgCl2 and CaCl2 to achieve final concentrations of 50 µM each. Filter sterilize the solution using a 0.22 µm filter.\nNOTE: Always add MgCl2 and CaCl2 to the 1x buffer to avoid precipitation of the salts in the 100x stock solution.\nAlternatively, prepare KK2 buffer (2.2 g of KH2PO4 and 0.7 g of K2HPO4 for 1 L of buffer) supplemented with 50 µM MgCl2 and 50 µM CaCl2 (herein referred to as KK2MC). Use this buffer throughout instead of SorMC.\nPreparation of bacteria as food source for D. discoideum\nUse a single colony of K. aerogenes and inoculate 1 L of LB-medium (lysogeny broth). Use a 2 L flask. Let bacteria grow overnight at 37 °C with shaking at 220 rpm.\nNOTE: If large amounts of bacteria are required, use richer media like 2xTY (yeast extract tryptone medium) or SOB (super optimal broth) instead of LB. In case the use of K. aerogenes bacteria is not permitted due to safety restrictions, BL21 E. coli can be used instead.\nHarvest the cells the next day by spinning them down in two 500 mL centrifuge tubes at ~6,600 x g for 20 min. Wash bacteria once with 500 mL of SorMC buffer.",
    "Resuspend the pellet in 20 mL of SorMC. Check the OD600 (optical density at 600 nm) using a photometer. Dilute with the same buffer to an OD600 of around 100.\nNOTE: K. aerogenes bacteria are difficult to pellet, so a relatively high speed for spinning down the bacteria is necessary to avoid loss of food bacteria. The resulting bacterial stock solution can be stored for up to 4 months in the fridge at 4 °C and maintain its utility as food source for D. discoideum. 1 L of overnight K. aerogenes suspension grown in LB medium usually yields 20 mL of an OD600 of around 100.\nCAUTION: To ensure that the prepared bacteria are a monoculture of K. aerogenes, perform all steps under a hood.\nPreparation of H40 electroporation buffer\nPrepare 100 mL of buffer solution, dissolve 0.952 g of HEPES in ddH2O water, and add 100 µL of MgCl2 from a 1 M stock solution. Adjust to pH 7 using KOH for titration. Sterilize the buffer using a 0.22 µm filter or autoclave. Use acid-free HEPES and not the sodium salt.\nPerform plasmid preparation following the manufacturer's protocol and using the kits summarized in the Table of Materials. Use the plasmids summarized in Table 1.\nNOTE: The quality of DNA used for transfection is crucial. The selection of D. discoideum transfectants growing on bacteria has specific requirements for the promoters driving the selection and expression cassette (see discussion).\ntable:\n﻿0,1,2,3\nplasmid name,resistance/selection in bacteria,resistance/selection in Dictyostelium,tag\nextrachromosomal expression plasmids,extrachromosomal expression plasmids,extrachromosomal expression plasmids,extrachromosomal expression plasmids\npDM1203,Ampicilin,G418,no\npDM1207,Ampicilin,G418,N-terminal GFP\npDM1208,Ampicilin,G418,N-terminal mCherry\npPI159,Ampicilin,G418,N-terminal mNeon\npPI437,Ampicilin,G418,N-terminal mScarlet\npPI54,Ampicilin,G418,N-terminal mTurquoise2\npDM1209,Ampicilin,G418,C-terminal GFP\npDM1210,Ampicilin,G418,C-terminal mCherry\npPI143,Ampicilin,G418,C-terminal mNeon\npPI459,Ampicilin,G418,C-terminal mScarlet\npPI142,Ampicilin,G418,C-terminal mTurquoise2\nshuttle plasmids,shuttle plasmids,shuttle plasmids,shuttle plasmids\npDM344,Ampicilin,no,no\npDM1019,Ampicilin,no,N-terminal GFP\npDM1018,Ampicilin,no,N-terminal mCherry\npPI152,Ampicilin,no,N-terminal mNeon\npPI418,Ampicilin,no,N-terminal mScarlet\npPI150,Ampicilin,no,N-terminal mTurquoise2\npDM1021,Ampicilin,no,C-terminal GFP\npDM1020,Ampicilin,no,C-terminal mCherry\npPI153,Ampicilin,no,C-terminal mNeon",
    "pPI457,Ampicilin,no,C-terminal mScarlet\npPI151,Ampicilin,no,C-terminal mTurquoise2\ninducible extrachromosomal expression plasmids,inducible extrachromosomal expression plasmids,inducible extrachromosomal expression plasmids,inducible extrachromosomal expression plasmids\npDM1038,Ampicilin,Hygromycin,no\npDM1047,Ampicilin,Hygromycin,N-terminal GFP\npDM1046,Ampicilin,Hygromycin,N-terminal mCherry\npPI450,Ampicilin,Hygromycin,N-terminal mNeon\npPI452,Ampicilin,Hygromycin,N-terminal mScarlet\npPI449,Ampicilin,Hygromycin,N-terminal mTurquoise2\npDM1049,Ampicilin,Hygromycin,C-terminal GFP\npDM1048,Ampicilin,Hygromycin,C-terminal mCherry\npPI470,Ampicilin,Hygromycin,C-terminal mNeon\npPI460,Ampicilin,Hygromycin,C-terminal mScarlet\npPI469,Ampicilin,Hygromycin,C-terminal mTurquoise2\nact5 safe haven targeting plasmids,act5 safe haven targeting plasmids,act5 safe haven targeting plasmids,act5 safe haven targeting plasmids\npDM1501,Ampicilin,Hygromycin,no\npDM1513,Ampicilin,Hygromycin,N-terminal GFP\npDM1514,Ampicilin,Hygromycin,N-terminal mCherry\npPI231,Ampicilin,Hygromycin,N-terminal mNeon\npPI419,Ampicilin,Hygromycin,N-terminal mScarlet\npPI228,Ampicilin,Hygromycin,N-terminal mTurquoise2\npDM1515,Ampicilin,Hygromycin,C-terminal GFP\npDM1516,Ampicilin,Hygromycin,C-terminal mCherry\npPI230,Ampicilin,Hygromycin,C-terminal mNeon\npPI458,Ampicilin,Hygromycin,C-terminal mScarlet\npPI229,Ampicilin,Hygromycin,C-terminal mTurquoise2\nREMI expression plasmids,REMI expression plasmids,REMI expression plasmids,REMI expression plasmids\npDM1220,Ampicilin,Hygromycin,no\npDM1351,Ampicilin,Hygromycin,N-terminal GFP\npDM1259,Ampicilin,Hygromycin,N-terminal mCherry\npPI465,Ampicilin,Hygromycin,N-terminal mNeon\npPI468,Ampicilin,Hygromycin,N-terminal mScarlet\npPI466,Ampicilin,Hygromycin,N-terminal mTurquoise2\npDM1352,Ampicilin,Hygromycin,C-terminal GFP\npDM1305,Ampicilin,Hygromycin,C-terminal mCherry\npPI471,Ampicilin,Hygromycin,C-terminal mNeon\npPI467,Ampicilin,Hygromycin,C-terminal mScarlet\npPI472,Ampicilin,Hygromycin,C-terminal mTurquoise2\ntargeted in frame plasmids,targeted in frame plasmids,targeted in frame plasmids,targeted in frame plasmids\npDM1355,Ampicilin,Hygromycin,C-terminal GFP\npPI461,Ampicilin,Hygromycin,C-terminal mCherry\npPI462,Ampicilin,Hygromycin,C-terminal mNeon\npPI464,Ampicilin,Hygromycin,C-terminal mScarlet\npPI463,Ampicilin,Hygromycin,C-terminal mTurquoise2\nknock-out plasmids,knock-out plasmids,knock-out plasmids,knock-out plasmids\npDM1079,Ampicilin,Blasticidin,no\npDM1080,Ampicilin,Nourseothricin,no\npDM1081,Ampicilin,Hygromycin,no\npDM1082,Ampicilin,G418,no\nCRE expression plasmids,CRE expression plasmids,CRE expression plasmids,CRE expression plasmids\npDM1483,Ampicilin,Nourseothricin,no\npDM1489,Ampicilin,Hygromycin,no\npDM1488,Ampicilin,G418,no\nTable 1: Plasmid list for non-axenic transfections.\nSetting up Dictyostelium cells for transfection\nGrow K. aerogenes to confluence in SM medium (nutrient-rich medium) overnight at RT. Cultures can be stored for up to 2 weeks at 4 °C.\nAdd about 400 µL of this bacterial suspension onto a SM agar plate (peptone 10 g/L; yeast extract 1 g/L; glucose 10 g/L; KH2PO4 1.9 g/L; K2HPO4 x 3 H2O, 1.3 g/L; MgSO4 anhydrous 0.49 g/L; 1.7% agar) and spread evenly. Take a sterile loop and inoculate with Dictyostelium cells. Spread the cells at one edge of the plate.\nIncubate the plate at 22 °C for 2 days to ensure sufficiently large growth zones for transfection.\nNOTE: For Dictyostelium strains that do not make large growth zones (e.g., Ax3, DH1, or JH10), or for inexperienced experimenters, use clearing plates instead. For this, follow the instructions in steps 1.5.4 to 1.5.6.",
    "Take a sterile loop and inoculate with Dictyostelium cells (approximately 2-4 x 105 cells). Transfer the cells to 800 µL of a dense K. aerogenes suspension in SM. Mix cells by pipetting up and down.\nTransfer 400 µL, 200 µL, 100 µL, and 50 µL on fresh SM agar plates. Add to every plate 400 µL of additional SM K. aerogenes suspension, spread evenly, and dry.\nIncubate the plates at 22 °C for about 2 days until the plates become translucent.\nNOTE: Due to their faster growth rate, the bacteria initially produce a confluent lawn, and the amoebae subsequently \"clear\" the plate of the bacteria. The time required for this process can differ depending on the strain background and ability of mutant cells to grow on bacteria.\n2. Transfection of Dictyostelium Cells Based on Bacterial Selection\nimgsrc://cloudfront.jove.com/files/ftp_upload/58981/58981fig1.jpg",
    "Figure 1: Workflow for the transfection of bacteria-grown Dictyostelium cells. The steps for transfection are listed as follows. Grow D. discoideum cells on a SM plate seeded with K. aerogenes bacteria (red). Harvest cells only from the feeding front (green), avoiding cells that are already developing (dark green). Wash the cells in H40. Resuspend cells to a final density of 2-4 x 107 cells/mL. Mix the cell suspension with 1-2 µg of DNA. Transfer the mixture to an electroporation cuvette and pulse cells. Transfer the cells directly after electroporation to a dish with SorMC and bacteria. Allow the cells to recover for 5 h before adding the selectable marker. For extrachromosomal plasmids, add the selection directly to the dish. Transfectants are usually visible after ~2 days. For linearized constructs that aim for single integration into the genome, set up three dilutions as indicated and add the selection. Bacteria are taken from the OD600 = 100 stock solution. Mix the tubes well and transfer the cells into 96-well flat-bottom tissue culture plates. Use two plates per dilution. Pipette 150 µL of cell suspension into every well. It takes about 5 days until tight colonies are visible. The red wells show an example of the usual amount of successfully transformed cells obtained (upper panel modified from previous publication22). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58981/58981fig1large.jpg]\nTo prepare plates with K. aerogenes suspension, add 10 mL of SorMC buffer containing K. aerogenes bacteria to a density of OD600 = 2 (add 200 µL of the prepared OD600 = 100 K. aerogenes stock solution for the desired bacteria concentration) into a 10 cm tissue culture treated petri dish.",
    "NOTE: This plate is later needed to cultivate the transfected D. discoideum cells. Alternatively, a 6-well tissue-culture plate can be used. In the case of transfection of the extrachromosomal plasmids, the 6-well tissue-culture plate is more resource-efficient. Use 2 mL of K. aerogenes SorMC (OD600 = 2) suspension per well.\nPreparation of Dictyostelium cells\nUsing a 10 µL disposable inoculation loop, scrape cells from the growth zones (approximately 3 cm) of the culture plate (edge of the cleared area) or clearing plate. Transfer cells into a 1.5 mL tube containing 1 mL of ice-cold H40 buffer.\n\t\tNOTE: The timing of harvesting cells from clearing plates is crucial. Harvesting too early yields too little an amount of cells, while harvesting to late increases the risk of yielding partially developed cells.\nWash the cells by spinning down for 2 min at 1,000 x g or flash-spinning for 2 s at 10,000 x g. Discard the supernatant and resuspend cells in H40 buffer to a final density of 2-4 x 107 cells/mL. Keep the cells cold during the whole transfection procedure. Use an ice-water slurry to ensure direct contact of the tubes and ice.\nElectroporation\nAdd 100 µL of cells to a tube with 1-2 µg of DNA. Mix carefully by pipetting up and down.\nTransfer the cell/DNA mixture into a pre-chilled electroporation cuvette (2 mm gap).\nPulse the cells using the following square-wave settings: 350 V, 8 ms, 2 pulses, and 1 s pulse interval.\nNOTE: Do not add more than 2 µg of DNA. Higher amounts are toxic to cells and decrease transfection efficiency. The total added DNA volume should not exceed 5 µL.\nTransfer cells immediately to the earlier prepared 10 cm Petri dish with K. aerogenes SorMC and allow the cells to recover for 5 h.",
    "NOTE: Check the cells in the Petri dish under an inverted microscope. Cells will appear round directly after electroporation but will return to their amoeboid shape after about 30 min, when they have had enough time to attach properly to the surface.\nSelection of transfectants: depending on whether transfection is aimed to generate a knock-out, knock-in, or act5 knock-in, or to express a fluorescent reporter protein from an extrachromosomal plasmid, carry out the selection process through one of the following described methods.\nNOTE: Unlike axenically grown cells, bacterially grown cells are highly resistant to blasticidin. Selection, therefore, is always carried out using G418 or hygromycin (see discussion).\n\t\nKnock-outs, knock-ins, and act5 knock-ins\nDetach the cells carefully from the Petri dish by repeatedly forcing the liquid from a pipette onto the surface.\nSet up three dilutions in the SorMC K. aerogenes suspension (OD600 = 2) and add the selective agent according to the resistance used (see Figure 1).\nLow dilution: mix 9 mL of cell suspension with 20.4 mL of SorMC and 600 µL of K. aerogenes stock solution.\nMedium dilution: mix 900 µL of cell suspension with 28.5 mL of SorMC and 600 µL of K. aerogenes stock solution.\nHigh dilution: mix 90 µL of cell suspension with 29.3 mL of SorMC and 600 µL of K. aerogenes stock solution.\nAdd 30 µL of selectable marker (100x stock solution).\nDistribute the prepared dilutions into 96-well flat-bottom tissue culture plates by pipetting 150 µL of cell suspension into each well.\nNOTE: This procedure aims to screen single clones rather than populations. The selection takes about 5-7 days, depending on the construct used.\nExtrachromosomal plasmids\n\t\t\nAdd the selectable marker directly to the 10 mL dish (see Figure 1).",
    "NOTE: There is no need to set up dilutions, since there is no desire for clonal populations. The selection process for extrachromosomal plasmids is faster due to high copy numbers present in D. discoideum cells. Transfectants can be expected after 32 h to 2 days.\n\t\t\tCAUTION: The antibiotics used as selectable marker are toxic. Wear gloves.\nScreen the obtained clones for positive tranfectants. For knock-out or knock-in attempts, follow the instructions in step 2.5.1. Check transfection success for extrachromosomal plasmids using the instructions in step 2.5.2.\nFor knock-outs, knock-ins, and act5 knock-ins, perform the initial screen via PCR to confirm integration of the construct into the correct genomic locus.\nNOTE: To maximize the likelihood of clonal populations, use the highest dilution possible that yields transfectants after selection. Aim for plates that are a maximum one-third of wells occupied.\n\t\t\nTo expand clonal populations, transfer clones that have grown up after selection from the 96-well tissue-culture plate into a 12-well tissue-culture plate to grow enough cells for the isolation of genomic DNA. Supply each well with 1 mL of SorMC K. aerogenes (OD600 = 2) and fresh selectable marker.\nNOTE: 1 day is usually sufficient to obtain a confluent well suitable for DNA isolation.\nTo perform mini genomic DNA isolation, harvest the cells of a confluent well and isolate genomic DNA using a mini DNA extraction kit following the manufacturer's instructions.\nUse the isolated genomic DNA together with suitable primers and Taq-polymerase (see Table of Materials) to PCR screen for positive integrands.\nNOTE: After confirmation of positive integration into the correct genomic locus, a Southern blot analysis should be performed. This ensures greater confidence that additional insertion events in unspecific genomic regions have not occurred.",
    "For fluorescent reporter proteins, visually identify positive fluorescent cells and check with a fluorescence microscope. Alternatively, perform a western blot with suitable antibodies for biochemical identification.\ntable:\n﻿0,1,2\nPCR program,PCR program,PCR program\nstep,temperature,time\nInitial Denaturation,94 °C,30 s\n30 Cycles,94 °C,15-30 s\n,42 °C,15-60 s\n,68 °C,1 min/kb\nFinal Extension,68 °C,5 min\nHold,4-10 °C,\nReaction composition,Reaction composition,Reaction composition\ncomponent,25 μL reaction,final concentration\n10 µM Forward Primer,0.5 µL,0.2 µM\n10 µM Reverse Primer,0.5 µL,0.2 µM\nTemplate DNA,variable (ca. 5 µL),\"< 1,000 ng\"\n2x Master Mix with Standard Buffer including polymerase (see table of materials),12.5 µL,1x\nNuclease-free water,to 25 µL,\"< 1,000 ng\"\nTable 2: PCR program and sample composition for the amplification of D. discoideum genomic DNA."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}