{
  "id": 9708,
  "origin_website": "Jove",
  "title": "Efficient Gene Delivery into Multiple CNS Territories Using In Utero Electroporation",
  "procedures": [
    "1. Set-up\nSet-up surgical area as shown in Fig. 1A,A'. Key components of the set-up include an Eppendorf Femtojet microinjector, Narishige micromanipulator with needle holder, Leica steromicroscope, fiber optic lighting system, ECM 830 Square Wave Electroporation System with electrodes, heating pad and a vaporizer for isoflurane anesthetic.\nClean all tools with a Bransonic Ultrasonic Cleaner using Metriclean2 Low foaming solution for sonicating surgical tools. Sterilize tools by autoclaving. Sterilized tools are then kept in Germex.\nPrepare syringes with warm sterile saline and sterile Lactated Ringer’s solution.\n2. Anesthesia\nPlace animal inside a small (12cm x 20cm) anesthetic chamber. Using a vaporizer, deliver 5% isoflurane anesthetic and oxygen at 1L/min (Fig. 1A,A').  Notably, it is important to collect isoflurane exhaust using a scavenging system.\nRemove animal from the chamber when breathing becomes deep and regular. Toe pinching and eye blink reflex tests are used to ensure full anesthesia.\nPlace pregnant mouse on its back on top of a heating pad (37°C). The heating pad is first sterilized by wiping with 70% ethanol, and is then covered with a sterilized, lintless gauze pad. Use a respirator tube and mask apparatus to deliver isoflurane (2.25%) during surgery.\nInject buprenorphine (0.1mg/kg body weight) subcutaneously under the skin at the nape of the neck.\nMonitor animal throughout surgery for deep and regular breathing. The animal should not gasp, breathe shallowly or rapidly.  Shallow, rapid breathing may be a sign of light anaesthesia, and the flow of isoflurane should be increased. If the animal begins to gasp, reduce the flow of isoflurane.  In the case of a respiratory arrest, turn isoflurane off, and increase flow of oxygen until animal recovers. Restart isoflurane at a lower concentration.\n3. Animal Preparation for Surgery",
    "Tape forelimbs of animal to the heating pad and check again for a retraction response by pinching the hind foot with blunt forceps.\nUsing a sterile cotton-tipped swab, spread a thick layer of depilatory cream (i.e., Nair) onto the abdomen.  In firm strokes, ensure the underfur is completely coated.  Leave on for an average of three minutes, checking intermittently with a sterile clean swab for hair removal. Wet a sterile gauze pad with sterile water and wipe the abdomen until all traces are gone.  Repeat with chlorhexidine (i.e., Stanhexidine) skin cleaner and more water. Dry the abdomen with clean, sterile gauze.\nSterilize incision site with a chlorhexidine (i.e., Stanhexidine) followed by more sterile water.  Dry the abdomen with clean, sterile gauze. Repeat this step using 70% ethanol and a fresh, sterilized cotton swab.\nPlace a sterile gauze pad over the abdomen with a slit in the middle through which the uterine horns will be pulled during surgery.\n4. Incision and Exposure of Uterine Horns\nTo expose the uterine horns, first locate the linea alba as the faint line under the skin at the midline. Using forceps, pull the skin away from the abdominal wall and cut a small, straight incision from the mid-abdomen downwards with skin scissors (approximately 1 cm in length).\nUsing curved forceps and scissors, repeat the process with the peritoneum.\nPlace sterile gauze with a small vertical slit over incision and dampen with warmed sterile saline.\nSlide forceps into the incision and locate the uterus. Hold open incision with forceps while removing the uterine horns.",
    "Carefully grasp the uterus between the first and second visible embryos and pull the embryos onto the gauze. Remove both sides of the uterine horns, placing onto the sterile gauze and count the number of embryos, noting any resorptions or “unhealthy” (e.g. smaller body size) embryos. Wet the uterine horns with saline and carefully return half of the uterus into the abdomen.\n5. Injection of DNA into Ventricles\nSurgical needles are prepared with a Sutter Flaming Micropipette Puller using borosilicate micropipettes with capillaries (Program:  heat=750, Pull=30, Vel= 90, Time= 150). Using a sterile scalpel blade, the needle tip is gently shaved off at a 45 degree angle. \nTo load the needle, Pasteur pipettes are pulled to a narrow diameter under a flame. A mouth piece is attached to the loading pipette to draw up ˜10 μl of 3mg/ml endotoxin-free DNA mixed with 0.01% methyl green (note: methyl green dye allows DNA injections to be visualized). The filled needle is then mounted on a micromanipulator stand and attached to the Femtojet injector.\nStarting with the embryo closest to the ovary, circular forceps are used to gently turn the embryo within the decidua so that it is positioned “face-forward”, allowing injections to occur in a rostral to caudal direction.  A fiber optic light source for illumination is used to help visualize the midline of the embryonic brain, which is flanked by the large lateral ventricles in rostral regions (Fig. 1B,B').",
    "The embryo is held in position using circular forceps. The needle is positioned above the uterus so that the angle of entry into the brain is approximately 45 degrees. Using the micromanipulator, and a quick and steady motion, the needle tip is inserted through the uterine wall and into the lateral ventricle of the embryo. Injections are directed towards the lateral ventricles, 3rd ventricle or subretinal space to target the telencephalon, diencephalon and retina, respectively. Note that the embryonic brain vesicles are open at early embryonic stages such that DNA injected into the lateral ventricles will flow into the 3rd ventricle.\nPress the foot pedal to inject endotoxin-free DNA (1-3 μL) using an Eppendorf Femtojet microinjector. A successful injection is easily visualized by spreading of the methyl green dye throughout the embryonic brain ventricles. The needle is then slowly removed by drawing back up to avoid breakage.\n6. Electroporation\nThe injected embryo (still within the uterus) is placed on the sterile gauze overlying the mother’s abdomen and wet thoroughly with warmed saline. Please note** The addition of saline to the membrane surface is essential to allow efficient passage of an electrical current.\nGenePaddle electrodes are used to grip the uterus following the injection of DNA. Five square electric pulses of 40-50V and 50 ms are delivered at a rate of one pulse per second using an ECM8300 BTX electroporation system (Fig. 1C,C').\nCover the injected/electroporated embryo with protective wet gauze and continue to the next embryo.\nUpon completion of the injection/electroporation of all desired embryos, carefully push the uterine horns back into the abdomen (Fig. 1D).\nCarefully remove the other uterine horn and begin again with the embryo closest to the ovary.\n7. Suture and Stapling",
    "Once all embryos are back inside the uterus, add to the abdominal cavity ˜2-3 ml warm saline.\nTo close the wound, begin by removing the gauze on the abdomen and identifying the sides of the peritoneum. Begin suturing the peritoneum using black braided silk line. It is not recommended to use absorbable suture for this procedure as it is typically weaker and may lead to post-surgical bleeding and infection. Anchor the line on the peritoneum closest to the sternum and proceed to stitch away from the anchor. Ensure all sutures are tight, and that no underlying organs or skin has been inadvertently sewn into the peritoneum. Clip the remaining suture line and discard.\nPull skin closed over the suture line with forceps. Using 9 mm Reflex™ skin closure staples, clip the skin over the wound, taking care not to staple the suture line underneath, or to pull the skin too tightly. The preferred method is to hold the skin up and away from the body with forceps, and come in at a 90 degree angle with the staple tool.  Continue until wound is closed (approximately three staples). Once finished, ensure staples are tight by gently pressing together with the suture tool (Fig. 1D').\n8. Post-surgical Care\nTo monitor anesthetic recovery, turn female onto her stomach and turn off isoflurane. Keeping the animal’s face inside the breathing apparatus, turn oxygen up to 3% to help recovery from anesthesia.  The animal should be placed on a clean dry gauze pad on top of the heating pad to prevent hypothermia.\nWhile the animal is groggy, inject 2 mL Ringer’s solution subcutaneously under the animal’s neck skin.",
    "Continue holding the animal under oxygen flow for several minutes and warming gauze pads in order to rouse the animal.  Short spurts of movement from the animal should be observed as it returns to a normal breathing pattern.  Observe for several minutes until animal seems conscious and awake.\nSpray the female’s abdomen with Gentamicin spray and wrap the animal in a sterile gauze pad.\nTransfer the animal into a sterile cage with autoclaved bedding and cardboard housing.\nWater bottles should be thoroughly cleaned, sterilized and filled with sterile water.  To 500 mL of water add 2 mL of sulfamethazine antibiotic (25% stock).\nAdminister 0.05 mg/kg buprenorphine subcutaneously the morning following surgery.\nMonitor the female closely for the first 24 hours post-surgery. If animals are kept longer than 24 hrs, females are moved to new sterile cages on day 2.\n9. Representative Results\nNeocortex",
    "The neocortex is the region of the CNS that is responsible for visual and sensorimotor processing and higher cognitive functioning. It is comprised of glutamatergic projection neurons and GABAergic interneurons that are derived from the dorsal and ventral telencephalon, respectively. To address the roles of different genes in neocortical development, we use in utero electroporation to either misexpress or block the expression (i.e., through the use of shRNA constructs) of different genes in the dorsal or ventral telencephalon1,3,4. To misexpress genes in the embryonic telencephalon, we use a bicistronic expression vector (pCIG2), containing a CMV-βactin promoter-enhancer and an internal ribosome entry site (IRES)-enhanced green fluorescent protein (EGFP; in pCIG2) cassette, allowing transfected cells to be detected by epifluorescence (Fig. 2A-C). We used this technology to introduce expression constructs into the telencephalon from E11.5 to E15.5 (data shown is at E12.5; Fig. 2). By allowing embryos to develop several days post-electroporation, we are able to track the differentiation and migration of GFP-labeled progenitors. As differentiation proceeds, 3 days post-electroporation GFP+ cells differentiate and migrate out of the ventricular zone (vz), subventricular zone (svz) and intermediate zone (iz) and into the cortical plate (cp; Fig. 2C). If brains electroporated at E12.5 are analyzed after 24 hr, we can monitor earlier events in progenitor maturation and neuronal migration by co-labeling with markers of apical progenitors (i.e., Pax6; Fig. 2A), basal progenitors (i.e., Tbr2; Fig. 2B) and postmitotic neocortical neurons (i.e., Tbr1; Fig. 2C).\nDiencephalon",
    "The hypothalamus lies at the ventral base of the CNS and functions as a gateway between the endocrine and autonomic nervous systems. During development, the multiple nuclei that make up the mature hypothalamus differentiate from a common progenitor zone that lines the ventral-most region of the embryonic diencephalon. Currently, the molecular pathways that regulate progenitor cell proliferation, neuronal differentiation and the formation of hypothalamic nuclei are poorly understood. We used in utero electroporation to target reporter gene expression to the embryonic diencephalon by injecting DNA into the 3rd ventricle of E12 embryos.We then followed the distribution of GFP in differentiating neurons at E14. With this methodology, we have successfully targeted GFP expression to the thalamus, pre-thalamus and hypothalamus (Fig. 3A). Analysis of coronal sections reveals that we have successfully targeted GFP expression to progenitor cells that line the ventricular zone of the 3rd ventricle and neurons that migrate out to the mantle zone to form nuclei (Fig. 3B)\nRetina",
    "The retina is the neural layer of the eye, responsible for converting light photons into electrical impulses transmitted to the brain. It develops as an outpocketing of the embryonic diencephalon, and hence, is derived from the neural tube. The neural retina develops from an apical progenitor compartment that lies adjacent to the subretinal space, a cavity that separates the eye from the head mesenchyme. Targeting DNA constructs to retinal progenitors therefore requires that injections are made into a small target area. Using micromanipulators, we have managed to successfully target this small area in embryos from E13.5 to E15.5 (shown is E15.5 electroporations of pCIC with mCherry reporter; Fig. 4). If electroporated retinae are examined 24 hr post-transfection, we observe that most mCherry+ cells are located in the outer neuroblast layer (onbl), where dividing progenitors are located, and not in the retinal ganglion cell layer (gcl; inset image), where postmitotic cells localize.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2957/2957fig1.jpg",
    "Figure 1. Introduction to in utero electroporation set-up and methodology. (A) The key components of the surgical set-up include an Eppendorf Femtojet microinjector (1), Narishige micromanipulator with needle holder (2), Leica steromicroscope (3), fiber optic lighting system (4), ECM 830 Square Wave Electroporation System with electrodes (5) and heating pad (6). (A') The animal is anesthetized using a vaporizer for isoflurane anesthetic. (B,B') Briefly, after anesthesia, the uterine horns are exposed and DNA mixed with fast green is injected into the embryonic brain vesicles. A successful injection is visualized by tracking of the fast green dye (B'). (C,C') After the DNA is successfully injected, the paddle electrodes are placed on either side of the uterus, positioning the embryo so that the DNA will be pulled towards the positive pole into the brain region of choice. (D,D') Once all the desired embryos are injected, the uterus is pushed back into the abdomen (D), the peritoneum is sutured, and the skin is stapled (D'). The pregnant female is then allowed to recover and the electroporated pups are collected at the desired time points.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2957/2957fig2.jpg\nFigure 2. Representative example of dorsal telencephalic electroporation. (A-C) Photomicrograph of a coronal section through an E13.5 dorsal telencephalon electroporated at E12.5 with pCIG2. Electroporated GFP+ cells are analysed for their expression of markers of apical progenitors (Pax6+, red, A), basal progenitors (Tbr2+, red, B) and postmitotic neurons (Tbr1+, red, C). cp, cortical plate; svz, subventricular zone, vz; ventricular zone. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2957/2957fig3.jpg",
    "Figure 3. Representative example of diencephalic electroporation. (A) A ventral view of an E14 brain that has been electroporated at E12 with pCIG2. GFP epifluorescence is visible in the thalamus, pre- thalamus and hypothalamus, demonstrating the spread of the microinjected pCIG2 plasmid throughout the 3rd ventricle. (B) Photomicrograph of coronal section through electroporated brain, showing the migration of GFP+ cells out of the ventricular zone and into the mantle zone, where hypothalamic nuclei will form. 3V, third ventricle; T, thalamus; Hy, hypothalamus; mz, mantle zone; Tel, telencephalon; PreT, prethalamus; vz, ventricular zone.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2957/2957fig4.jpg\nFigure 4. Representative example of retinal electroporation. Coronal section through an E16.5 eye electroporated with pCIC at E15.5 showing the accumulation of mCherry+ cells in the outer neuroblast layer and not in Brn3b+ retinal ganglion cells in the ganglion cell layer. The inset is a higher magnification image of the boxed area. gcl, retinal ganglion cell layer; le, lens; onbl, outer neuroblast layer; re, retina.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}