{
  "id": 17366,
  "origin_website": "Jove",
  "title": "A Modified Vessel-Sparing Microsurgical Vasoepididymostomy",
  "procedures": [
    "This study was approved by the Ethics Committee of Northwest Women's and Children's Hospital (No. 2021002).\n1. Preparations\nPlace the patient supine on the operating table and perform anesthesia as per the anesthetist's recommendations.\nInsert a 16Fr Foley catheter around the incision site after the field is disinfected and covered with surgical drapes.\n2. Modified vessel-sparing LIVE\nCreate a 3 cm vertical incision in the middle of the scrotum and deliver the testis from the incision.\nOpen the tunica vaginalis. Carefully dissociate the vas deferens and adjacent vessels. The dissociated length is ~5 cm (Figure 1).\nPlace an operating microscope and ready the micro instruments: a micro needle holder, micro scissors, and micro forceps. Execute the following steps using the operating microscope.\nCreate a buttonhole of a diameter of 5 mm at the tunica of cauda epididymis using micro scissors. Identify a dilated epididymal tubule and carefully dissociate it using micro forceps. After that, keep it for anastomosis.\nPlace two needles of double-armed 11-0 microsutures longitudinally in the selected epididymal tubule, and open the epididymal tubule longitudinally between the two needles using a 15° ophthalmic knife. Ensure that the opening length does not exceed the length between the entry point and the exit point of the suture on the epididymal tubule (Figure 2).\nSample some epididymal fluid flowing from the incision in the tubule with a glass slide and hand it to an examiner to check for sperm. Gently pull out two needles in the epididymal tubule separately if sperm are found.",
    "Make a puncture in the gap between the vas deferens and adjacent vessels using deferens separating forceps. The puncturing site is approximately 1 cm away from the junction of the cauda epididymis and the vas deferens. Completely transect the vas deferens above the deferens separating forceps with a knife, and preserve the vasal vessels below the deferens separating forceps (Figure 3).\nCannulate the 24-G angiocatheter sheath into the vas deferens lumen on the distal testicular side, followed by a bolus injection of diluted methylene blue. Observe the color of the urine. Blue staining of the urine indicates distal patency.\nDissociate the vas deferens on the proximal testicular side using micro scissors to separate it from the vasal vessels. Ensure that the dissociation is executed along the vas deferens side to avoid damage to the vasal vessels. The dissociated length is ~2-3 cm. Then, remove the dissociated vas deferens and ligate the broken end of the vas deferens. During the dissociation, stop the bleeding using bipolar electrocoagulation or by ligating some small branch vessels using a 5-0 silk thread. This operation is called retrograde dissociation (Figure 4 and Figure 5).\nCarefully separate the vas deferens on the distal testicular side from the vasal vessels using deferens separating forceps combined with micro scissors. The dissociated length is ~0.5 cm. Separate the vas deferens and the vasal vessels without damaging the vas deferens or the vasal vessels. This operation is called anterograde dissociation (Figure 4 and Figure 6).\nFix the vas deferens to be anastomosed with the tunica vaginalis using 8-0 microsutures at the included angle between the vas deferens and adjacent vessels. After fixation, ensure that the lumen of the vas deferens reaches the anastomosis site with no significant tension. This is regarded as the first-stage tension reduction.",
    "Fix the muscularis edge of the vas deferens and epididymis tunica using 3-4 interrupted 8-0 microsutures. This is regarded as the second-stage tension reduction.\nPass the four needles of 11-0 microsutures in the epididymal tubule through four points (Figure 7) on the cutting surface of the vas deferens in an inside-out fashion. Then, perform the intussusception of the epididymal tubule into the vas deferens8.\nSuture the muscularis edge of the vas deferens and the epididymal tunica using 10-12 interrupted sutures of 8-0 microsutures.\nFix the broken end of the vas deferens on the tunica vaginalis using 3-4 interrupted sutures of 8-0 microsutures (Figure 4 and Figure 8). Ensure that the free vasal vessels are fixed and cannot move. This operation is called fixation of the vasal vessels.\nCheck whether there is tension in the vas deferens and whether there is tension and bleeding in the preserved vasal vessels. Then, suture each layer of tissue sequentially and terminate the operation.\n3. Postoperative management\nAvoid sexual intercourse for 1 month after surgery.\nWear a scrotal supporter or tight underpants for 1 week after surgery, and avoid standing or walking for a long time.\nTake antibiotics for 1 week to prevent infection.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}