{
  "id": 8633,
  "origin_website": "Jove",
  "title": "Data Acquisition and Analysis In Brainstem Evoked Response Audiometry In Mice",
  "procedures": [
    "All animal procedures were performed according to the guidelines of the German Council on Animal Care and all protocols were approved by the local institutional and national committee on animal care (Landesamt für Natur, Umwelt, und Verbraucherschutz, State Office of North Rhine-Westphalia, Department of Nature, Environment and Consumerism [LANUV NRW], Germany). The authors further certify that all animal experimentation was carried out in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals (NIH Publications No. 80-23) revised 1996 or the UK Animals (Scientific Procedures) Act 1986 and associated guidelines, or the European Communities Council Directive of November 24, 1986 (86/609/EEC) and of September 22, 2010 (2010/63/EU). Specific effort was made to minimize the number of animals used and their suffering (3R [replacement, reduction, and refinement] strategy).\n1. Experimental animals\nSelection of experimental animals and species\nPerform ABR studies in rodents/rodent models (i.e. mice or rats) that fulfill the requirements of homology, isomorphism, and predictability related to a specific human disease. This is of specific importance in terms of basic aspects in translational neuroscience.\n\t\tNOTE: Consider that available miscellaneous mouse and rat strains can show differences in basic physiological and pathophysiological characteristics36,37,38. These mouse/rat line-related specificities have to be taken into account in experimental planning.\nConsider mouse- and rat-strain-specific alterations in physiology and pharmacology that might have an impact on electrophysiological experiments (e.g. altered anesthetic sensitivities, circadian rhythmicity, [audiogenic] seizure susceptibility, age, and genetic background)39,40,41,42.\nInclude the gender-specific stratification in the study design. Remember that the estrous cycle can severely affect anesthetic susceptibility, central rhythmicity, circadian dependency, and seizure activity (auditory seizures) and sensory (auditory) information processing43,44,45. Thus, perform a gender-specific analysis.",
    "NOTE: Restrict to male mice if the financial and experimental capacity is limited, although various neurophysiological parameters from normally cycling females do not seem to exhibit increased variability compared to males46.\nAnimal housing and handling\nHouse mice or rats in individually ventilated cages inside an animal facility.\nMove the experimental animals from the animal facility to ventilated cabinets located in special lab rooms intended for anesthesia, ABR electrode placement, and ABR recordings.\nMake sure that the animals are housed in a ventilated cabinet under standard environmental conditions (i.e., with a temperature of 21 ± 2 °C, 50%-60% relative humidity, and a conventional 12/12 h light/dark cycle). Allow the animals to acclimatize and adapt to this circadian pattern for at least 14 days prior to subsequent experimentation.\nUse clear polycarbonate cages type II (26.7 cm x 20.7 cm x 14.0 cm, an area of 410 cm2) for housing mice in groups of 3-4 and use clear polycarbonate cages type III (42.5 cm x 26.6 cm x 18.5 cm, an area of 800 cm2) for rats. Provide ad libitum access to drinking water and standard food pellets.\nAvoid separation/isolation of the experimental animals prior to and after ABR recordings as isolation can exert severe stress affecting experimental results. Thus, place the animals back into their home cage following anesthesia, ABR electrode placement, and ABR recordings.\nDo not apply open housing conditions as they are subject to a variety of experimental drawbacks, particularly in auditory studies. Ventilated cabinets, instead, protect from acoustic stress prior to and in between experimental auditory procedures which could otherwise lead to sensorineural hearing loss (e.g., noise-induced hearing loss) and thus affect results.",
    "Utilize mouse- and rat-specific sanitary, anesthetic, and technical equipment so that neither mice nor rats can sense the presence of each other as mutual sensory perception of rivaling species may give rise to avoidable confounding factors in the studies.\n2. Mouse anesthesia\nPerform anesthesia using injectable anesthetics. Prepare a combination of ketamine hydrochloride (rodent dosage: 100 mg/kg) and xylazine hydrochloride (rodent dosage: 10 mg/kg) in 0.9% NaCl or Ringer solution and inject the animal intraperitoneally based on its body weight.\n\tNOTE: Inhalation narcosis via isoflurane is not recommended as the ABR procedure normally requires a sound attenuating cubicle and Faraday cage, resulting in spatial limitations within the recording setup. Although many anesthetics act on the NMDA system and obviously influence ABR recording outcomes, a non-anesthetic restraining approach in ABR recordings is not recommended as restraining procedures under consciousness induce dramatic stress to the animal, with severe subsequent artifact formation in ABRs.\nObserve the animals carefully for the depth of anesthesia by performing a tail pinch, foot pinch, and monitoring respiration rate (mice: 150-220 breaths/min). Check for possible gasping and counteract if necessary.\n\tNOTE: Different mouse lines or pharmacological mouse models can exhibit different sensitivities to anesthesia. The same holds true for mutant mouse models. Endotracheal intubation is not a must in this experimental setting and not recommended. As intubation increases the risk of trauma to the trachea and infection, the benefit/risk of endotracheal intubation during the ABR procedure is negative.\n3. General aspects of perianesthetic arrangements and instrumentation\nApply supplemental warmth during and after ABR recordings using a homeothermic heating blanket to maintain the animal’s body core temperature. Maintain the latter at 36.5-38.0 °C (98.6-100.4 °F).",
    "NOTE: Hypothermia is a risk factor in small rodents due to their high ratio of body surface (mouse body surface = 10.5 x (weight in g)2/3; rat body surface = 10.5 x (weight in g)2/3) to the body volume.\nCover the animal’s eyes with petroleum-based artificial tear ointment or 5% dexpanthenol during the entire ABR recording process to avoid corneal desiccation. Continue this procedure until the blinking reflex is fully restored.\nSterilize the experimental instruments (see the Table of Materials) using an autoclave or disinfectants.\n\tNOTE: The usage of a heat-based surgical instrument sterilizer with glass beads is recommended.\nFor exact ABR electrode placement, use a binocular surgical magnification microscope with a cold light source for the intense illumination via flexible or self-supporting movable light guides.\nUse a clean laboratory coat, a facemask, a head cover, and sterile gloves during experimental animal handling and experimentation.\n\tNOTE: Optimal instruments and supplies can vary between labs and must meet lab-specific and institutional standards.\n4. ABR recordings\nNOTE: The protocol described here is based on a commercially available ABR system for monaural and binaural recordings. Importantly, the scientific question to be addressed must meet the technical specifications of the ABR system used. ABR analysis of binaural recordings, for example, can be used to investigate the lateral coding of auditory stimuli in the auditory pathway and to study peripheral lateral asymmetry in neuropsychiatric diseases.\nPerform a calibration of stimulation frequencies on each day of recording by placing a microphone connected to a preamplifier and the processing system (see the Table of Materials) inside the sound attenuating cubicle at the location with the correct orientation where the experimental murine ear will be positioned.",
    "Turn on the preamplifier connected to the microphone at least 5 min prior to the calibration to allow for the equilibration of the system.\nTurn on the oscilloscope.\nPosition the microphone connected to a preamplifier inside the sound attenuating cubicle to mimic the experimental murine ear.\nOpen the commercially available processing and acquisition software (see the Table of Materials).\nSelect the calibration Cal200K file within the software to activate the calibration-configuration mode and choose parameters according to the experimental conditions.\nUse the processor system to execute the calibration procedure. Make sure that the technical specifications of the microphone and loudspeaker in terms of SPL limits, frequency range, and distribution harmonize.\nSelect and start the predefined click stimulation protocol.\nRun a single click SPL (preferably, the maximum SPL) to verify that the spectrum of sound stimuli as analyzed by online Fast Fourier Transformation (FFT) of the oscilloscope matches requirements (substantial energy range).\nSelect and start the predefined tone-burst stimulation protocol within range of interest (e.g., 1-42 kHz).\nConfirm the frequency spectrum of the recorded acoustic test stimuli by using an oscilloscope and online FFT.\n\t\tNOTE: Daily calibration of the system and stimulation frequencies is necessary to guarantee that the stimulation frequencies and SPLs are within acceptable working ranges.\nPlace the anesthetized mouse inside a sound attenuating cubicle lined with acoustical foam.\n\tNOTE: The entire cubicle should be covered by a Faraday cage (custom-made meshed metal or a commercial one) to shield the ABR recordings from external electrical interference and protect them from noise.",
    "For the recording of monaural brainstem-evoked auditory potentials, insert subdermal stainless-steel electrodes at the vertex, axial of the pinnae (positive [+] electrode) and ventrolateral of the right or left pinna (negative [-] electrode) depending on the ear to be measured. For binaural recordings, place the negative electrodes at both the right and left pinnae. Position the ground electrode at the hip of the animal (Supplementary Figure 1).\n\t\nPrior to the insertion, form a hook shape at the tip of the stainless-steel electrode so that subdermal fixation of the electrodes is guaranteed47.\nPerform impedance measurements of all electrodes prior to each recording to verify proper electrode positioning/conductivity. Use the impedance check button on the four-channel headstage to verify each electrode impedance level.\n\tNOTE: Impedance should be less than 5 kΩ.\nRecord ABRs under free-field conditions using a single loudspeaker (frequency bandwidth, for instance, at 1-65 kHz) placed 10 cm opposite to the rostrum of the animals (the loudspeaker’s leading edge perpendicular to the mouse’s interaural axis). Make sure that the position of the mouse head/mouse ears is that of the calibration microphone, depending on the chosen specific distance between the loudspeaker and the microphone during calibration.\n\tNOTE: Instead of free-field conditions, ear tubing can also be used. However, special precautions and tests are necessary to determine SPLs in these settings.\nProgram the stimulus protocols for the clicks and tone bursts using self-programmed or commercially available software (see the Table of Materials). The individual stimulus parameters listed below need to be added to the related graphical user interface.",
    "Start with the configuration of the click stimulus entity (i.e., a 100 μs duration stimulus with alternating polarity [switching between condensation and rarefaction] and the defined substantial energy. Use this stimulus entity to analyze and determine click thresholds, ABR symmetry of the left and right ear, ABR W (I - IV) amplitudes, and W (I - IV) latencies later on.\nInitiate the software and use the configuration window to add the click stimulus parameters. Click Execute to run the protocol.\nContinue with the configuration of the second stimulus entity, which is a 4.5 ms tone burst (transient sinusoidal pulse) of alternating polarity with Hann envelope rise and fall times of 1.5 ms each (gate/ramp time duration). Consider a minimum tone burst duration of 3 ms, particularly for low-frequency tone bursts. Use this stimulus to analyze and identify frequency-specific hearing thresholds in all genotypes.\nSimilar to step 4.6.2, use the configuration window to add tone burst stimulus parameters and click Execute to run the protocol (as stated by the manufacturer48).\nFor tone burst studies, program the appropriate frequency range to be tested depending on the scientific question (e.g., from 1-42 kHz in 6 kHz steps). Make sure that the frequency ranges to be applied meet the technical capabilities of the loudspeaker (in this case, a multifield magnetic speaker with a frequency bandwidth of 1-65 kHz for free- or closed-field conditions).\nFor averaging, set the number of sequential acoustic stimuli (clicks or tone bursts), for instance, at 300x with a rate of 20 Hz.\nIncrease the SPLs in 5 dB steps for clicks and 10 dB steps for tone bursts, starting from 0 dB up to 90 dB (increasing SPL mode).",
    "NOTE: Both increasing and decreasing SPL modes have been described in the literature. SPL step size might be adapted due to scientific questions.\nDetermine an ABR data acquisition duration of 25 ms, starting with a 5 ms baseline period prior to the individual acoustic stimulus onset (pre-ABR baseline) and exceeding a 10 ms ABR section by another 10 ms baseline (post-ABR baseline) (Supplementary Figure 1).\nApply an appropriate sampling rate for ABR data acquisition (e.g., 24.4 kHz) and bandpass filter (high pass: 300 Hz, low pass: 5 kHz) using a 6-pole Butterworth filter. Activate the notch filter if necessary.\n\tNOTE: Sampling rate and filter characteristics might be adapted due to experimental requirements.\nTransfer the resultant bioelectrical signals recorded from the subdermal electrodes to a head stage and further forward to a preamplifier with appropriate amplification (e.g., 20-fold).\nUse a specific ABR system processing software to coordinate loudspeaker control and ABR acquisition, processing, averaging, and data management.\nTry to execute the entire ABR protocols (for click- and tone burst-evoked hearing thresholds, peak amplitude, and peak latency analysis, etc.) within about 45 min. This corresponds to the time of deep narcosis using 100/10 mg ketamine/xylazine intraperitoneally.\nMake sure that the calibration, programming/adjustments for stimulus presentation and acquisition, filter settings, etc. are working as expected prior to anesthetizing the animal and performing the actual recording.\n5. ABR analysis\nClick- and tone burst-evoked ABR hearing threshold analysis\nPerform automated threshold detection based on earlier publications to avoid potential inconsistencies in the ABR threshold determination by visual inspection/estimation49,50,51,52.\nDefine three distinct time windows (TWs) to calculate the signal-to-noise ratio (SNR): TW1 (0-5 ms), TW2 (5-15 ms), and TW3 (15-25 ms) (Supplementary Figure 1).",
    "Calculate the noise standard deviation of the baseline within the two distinct TWs (i.e., TW1 and TW3) where no AEPs are observed. This calculation can be done using self-programmed software.\nCalculate for each SPL measurement within an ABR record setting both the mean and the standard deviation for the pooled data of TW1 and TW3.\nReset all recording samples individually by the corresponding calculated mean to remove any DC offset.\nFor hearing threshold determination, identify the lowest SPL (dB) where at least one wave amplitude value (WI-WIV) in the ABR response time window (TW2) exceeded the fourfold of the previously calculated standard deviation.\n\t\tNOTE: If no ABR wave was detected for click and frequency threshold analysis at the maximum SPL, a nominal threshold level of 100dB is assigned to the ear.\nABR wave amplitude and wave latency analysis\nConduct a wavelet-based approach using the Mexican hat wavelet to determine the temporal-sequential arrangement of positive (p) waves (peaks) as well as the negative (n) waves (pits) using a default wavelet by the continuous wavelet transform (CWT)-based pattern-matching algorithm52 (Supplementary Figure 1).\n\t\t\nMathematically, the CWT is represented as follows53.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59200/59200eq1v2.jpg\n\t\t\tHere, s(t) is the signal, a is the scale, b is the translation, ψ(t) is the mother wavelet, ψa, b(t) is the scaled and translated wavelet, and C is the 2D matrix of wavelet coefficients.\nInitially, use the 55-dB measurement of each ABR run to identify the best scale parameters for each wave to be passed to the CWT, which results in three classes: scales 0.5-4 for all n-waves, 0.5-6 for all p-waves, and 0.5-12 for WIV as this is the broadest wave within the samples.\n\t\tNOTE: The 55 dB SPL was chosen as waves are generally most prominent here and can be reliably detected.",
    "Prove all classes to reliably detect the correct temporal collocation of WI-WIV within all 55 dB measurements.\nTo determine ABR WI-WIV in the accurate temporal order within the 55 dB measurement, p-peaks and n-peaks (pits) are identified in a fixed sequence using relative positions of previously identified peaks to limit the time window of subsequent scans.\nOnce all nine peaks are identified at 55 dB, use related values as starting points for the temporal search frame for the adjacent sound pressure measurements (50 dB and 60 dB) before the identification of peaks 1-9 is repeated.\nIn this manner, determine p- and n-peaks of all dB levels (55-0 dB and 60-90 dB) if possible. Once a p- and n-peak is no longer identified by the wavelet analysis, its temporal arrangement is set by calculating the temporal offset of the peak to any other peak identified in the previous dB level.\nApplying the temporal offset to peaks to any other p- and n-peak within the current decibel level results in a maximum of eight determined temporal positions for the undefined peaks whereof the mean is taken as the closest approximation.\nTo evaluate the amplitude growth function and latency comparison of all waves (WI-WIV), characterize the maximum amplitudes and mean latencies of each of the p-peaks within the time frame of the related n-peaks.\nVisually check all results based on the self-programmed automatic wavelet tool afterward, and, if necessary, exclude individual ABR runs from the statistics if they do not meet the strict inclusion/quality criteria.\n\t\tNOTE: In both automated analysis and visual inspection of ABRs, a double-blinded approach is recommended.\n6. Post-operative care and post-ABR treatment\nContinuously monitor the animals until they have regained consciousness and are able to maintain sternal recumbency.",
    "Do not return an animal that has undergone ABR recordings to the company of other animals until it has fully recovered.\nInject carprofen (mouse: 1x 5-10 mg/kg, subcutaneously; rat: 1x 2.5-5.0 mg/kg, subcutaneously) for post-operative pain treatment.\n\tNOTE: Long-lasting pain treatment is not required as ABR recording electrodes are inserted subcutaneously.\nPostoperatively, feed moistened pellets in order to facilitate food uptake. Carefully observe food (~15 g/100 g of body weight/day; ~5 g/24 h) and water (~15 mL/100 g of body weight/day; ~5 mL/24 h) consumption.\nMonitor the animals closely for the return of their normal postures and behavior.\n\tNOTE: Systemic administration of antibiotics such as enrofloxacin or trimethoprim-sulfonamide is not recommended here, as subdermal electrode placement is of only minimal invasiveness. Application of antibiotics should be restricted unless signs of local or generalized inflammation occur.\nFollow-up postexperimental recovery after ABR recordings by controlling the animal’s body weight.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}