{
  "id": 13425,
  "origin_website": "Jove",
  "title": "Whole-mount Confocal Microscopy for Adult Ear Skin: A Model System to Study Neuro-vascular Branching Morphogenesis and Immune Cell Distribution",
  "procedures": [
    "All experiments in this section were performed under approval from the National Heart, Lung, and Blood Institute (NHLBI) Animal Care and Use Committee.\n1. Adult Mouse Ear Skin Collection\nEuthanize adult mice by carbon dioxide (CO2) exposure in a closed chamber and then confirm the euthanasia by cervical dislocation.\n\tNOTE: The experiment follows the National Institutes of Health (NIH) guideline for the euthanasia method.\nDissect the ear from the base and place it in a 35 x 10 mm2 Petri dish containing 2 mL of Hank's Balanced Salt Solution (HBSS). Briefly trim hairs with scissors.\nPeel the posterior skin and anterior skin away carefully from the intervening cartilage.\n\tNOTE: Cartilage attaches to the anterior skin.\nTransfer the posterior and anterior skin separately to a 24 well plate containing 1 mL of ice-cold fresh 4% paraformaldehyde (PFA) in phosphate buffered saline (PBS) per well. Flatten the posterior and anterior skin in the 4% PFA.\nFix the posterior and anterior skin with cartilage at 4 °C for 1 h.\nWash the posterior and anterior skin 3 times for 5 min in 1 mL of PBS with gentle mixing on a mixer at room temperature.\nTransfer the posterior and anterior skin with cartilage to the bottom of a 35 x 10 mm2 Petri dish. Cut off the base region, which is folded and has adipose and connective tissues. Peel off the cartilage from anterior skin using fine curved forceps.\nCarefully remove the hairs, adipose tissues, and connective tissues from the inside of the posterior skin using fine curved tweezers. Keep the skin wet with PBS.\n2. Whole-mount Immunohistochemical Staining of Mouse Ear Skin\nNOTE: All experiments in the following sections were performed in accordance with the NIH laboratory safety guidelines.",
    "Prepare the blocking buffer. Filter 10% heat inactivated goat serum (HIGS) diluted in PBS with 0.2% triton X-100 (TX-100) blocking buffer, or 10% donkey serum (DS) diluted in PBS with 0.2% TX-100 blocking buffer, using a 0.45 µm filter unit.\nTransfer the posterior and anterior skin to a 24 well plate containing 1 mL of 10% HIGS blocking buffer or 10% DS blocking buffer per well. Incubate the skin for 30 min with gentle mixing on a mixer at room temperature.\nPrepare the primary antibody solution by diluting the primary antibodies (Table of Materials) in blocking buffer (either 10% HIGS or 10% DS).\n\tNOTE: Whole-mout immunohistochemical analysis of adult ear skin with antibodies to pan-neuronal marker neuron-specific class III β-tubulin (Tuj1, rabbit polyclonal IgG or mouse monocloncal IgG2a, 1:500 dilution at the final concentration of 2 µg/mL), pan-endothelial cell marker platelet endothelial cell adhesion molecule 1 (PECAM-1, hamster monoclonal IgG, 1:300 dilution at the final concentration of 3.3 µg/mL), myelin sheath marker myelin basic protein (MBP, rabbit polyclonal IgG, 1:200 dilution at the final concentration of 5 µg/mL) and inflammatory myeloid cell marker CD11b (Rat monoclonal IgG2b, 1:50 dilution at the final concentration of 20 µg/mL) was shown in Figure 1 and Figure 2. The skin was incubated with Cy3-conjugated antibody for vascular smooth muscle cell marker α smooth muscle actin (αSMA) together with secondary antibodies (2.6). The primary antibodies tested by ourselves were listed in Table of Materials. Multiple primary antibodies derived from different species can be mixed simultaneously.\nTransfer the posterior and anterior skin to new well containing 150 µL of the primary antibodies solution. Incubate the skin with gentle mixing on a mixer at 4 °C overnight.",
    "On the following day, transfer the posterior and anterior skin to new wells in the 24 well plate or aspirate the blocking buffer containing primary antibodies. Add 1 mL of either 2% HIGS diluted in PBS with 0.2% TX-100 washing buffer or 2% DS diluted in PBS with 0.2% TX-100 washing buffer. Wash the skin with 3 changes of the washing buffer every 15 min with gentle mixing on a mixer at room temperature.\nPrepare the secondary antibody solution (Table of Materials). Dilute secondary antibodies in the blocking buffer (either 10% HIGS or 10% DS) and filter the blocking buffer containing secondary antibodies through a 0.22 µm polyvinylidene difluoride (PVDF) membrane syringe filter connected to a 1 mL syringe.\n\tNOTE: Alexa 488 or 633-conjugated goat anti-rabbit IgG (H+L) or mouse IgG2a for Tuj1, Alexa 647-conjugated goat anti-hamster IgG (H+L) for PECAM-1, Alexa 488-conjugated goat anti-rabbit IgG (H+L) for MBP, and Alexa 594-conjugated rat IgG (H+L) for CD11b were used with 1:250 dilution at the final concentration of 8 µg/mL. The skin was incubated with Cy3-conjugated αSMA antibody (1:500 dilution at the final concentration of 2-3 µg/mL) in combination with these secondary antibodies.\nCentrifuge the solution at 13,000 x g for 10 min to remove aggregated particles of the secondary antibodies from the blocking buffer.\n\tNOTE: Different fluorescent conjugated secondary antibodies derived from different species can be mixed simultaneously.\nTransfer the posterior and anterior skin to well containing 150 µL of the secondary antibodies solution. Wrap the 24 well plate in aluminium foil to avoid light and incubate the skin for 1 h with gentle mixing on a mixer at room temperature.",
    "Transfer the posterior and anterior skin to new wells in the 24 well plate or aspirate the secondary antibody solution by pipet completely. Add 1 mL of either 2 % HIGS washing buffer or 2% DS washing buffer.\nWrap the 24 well plate in aluminium foil and wash with 3 changes of the washing buffer every 15 min with gentle mixing on a mixer at room temperature.\n3. Mounting the Ear Skin on Slide\nPlace the skin on the bottom of a 35 x 10 mm2 Petri dish. Carefully remove the hairs, adipose tissues, connective tissues, dusts, and fibers from the inside of the skin using fine curved forceps under stereomicroscope with low illumination to minimize extensive photo bleaching. Keep the skin wet with PBS.\nTransfer the skin to an adhesive microscope slide using forceps. Place the posterior and anterior skin with the inside facing up on the slide. Flatten the skin using forceps.\nMount the skin in a liquid anti-fade mounting medium to avoid photobleaching and preserve fluorescent signals. Make sure that no air bubbles are on or around the skin.\nCover with coverslip on the skin samples carefully and store the mounted skin sample slides in the dark overnight at room temperature to allow the mounting media get firm. Seal the coverslip to the slide with nail polish and store it at 4 °C for long-term storage.\n4. Confocal Microscopy\nSet up appropriate lasers for fluorophores. A confocal microscope with three laser sources (Argon 488 nm, DPSS 561 nm and HeNe 633 nm) is used in this experiment.\nUse the sequential scan tool, which simultaneously excites triple-stained samples, to avoid and reduce any overlap.\n\tNOTE: Images will be taken in a sequential manner using the sequential scan mode.",
    "Image under a 10X objective. Use the tile scan tool to capture the whole ear skin. Set Z-stack and make sure that the z-position covers the entire thickness of ear skin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}