{
  "id": 3814,
  "origin_website": "Cell",
  "title": "Enrichment of plasmid pool from E. coli for mass sequencing to detect untargeted mutagenic events",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPrimary transformation\nTiming: 2 days\nIn this step, a subfraction of the single lesion-containing plasmid in cells undergoes TLS events. The following protocol indicates the minimum set of this assay system exemplified in Figure 2[href=https://www.wicell.org#fig2]: the combination is to transform a ΔuvrAΔmutS strain without SOS induction with the lesion-free plasmid and a ΔuvrA strain with SOS induction with the lesion-containing plasmid. Depending on experimental purposes, the number of combinations between a plasmid and a strain will vary. In this case, perform the following steps for each additional combination.\nPlasmid recovery from the transformants\nElectroporate 40 μL of the competent mutant strain of interest with 8 ng (1 μL) of the lesion containing plasmid (total two times: finally, 16 ng of plasmid are used for 80 ul of competent cells), and the control strain with 2.5 ng (1 μL) of the lesion free plasmid. Follow steps a-i of the previous section, “4. Transformation”.\nNote: 16 ng of plasmid (∼2.7 kbp) contains ∼3.9 × 109 plasmid molecules.\nNote: In order to check efficiency of TLS events, also perform the following steps:\nThe way is the same as previously mentioned “check of cell viability” on LB plates containing X-gal and the dilution factors are 5 × 10−2 and 5 × 10−3. Incubate the plates for ∼16 h at 37°C\nCount blue and white colonies on the plates\nNote: As depicted in Figure 1[href=https://www.wicell.org#fig1], appearance of blue colonies basically relies on Pol V-mediated targeted mutagenesis for the lesion-containing plasmid. On the other hand, there is no appearance of blue colony for the lesion-free plasmid (although a few blue colonies may appear due to pre-existing errors in the lesion-free plasmid construct (see the section of “limitations[href=https://www.wicell.org#limitations]”)).\nCalculate mutation frequency (blue / (blue + white))",
    "Note: Proportion of blue colonies relative to all colonies (blue + white) should be ∼10%. For example, if the total number of viable cells (i.e., blue + white) is 107, the number of plasmid molecules that underwent independent TLS events would be around 106. The value (∼10% blue) is specific to the present assay conditions (i.e., the bypass of the TT (6-4) lesion in the SOS-induced strains) and may be varying when assaying a different TLS polymerase, mutant background or organism.\nCritical: As error rates of TLS polymerases are around 10−4 (a range of 10−3 to 10−5) per base (Fujii and Fuchs, 2020[href=https://www.wicell.org#bib3]) and the length of template DNA filled by a Pol V may be up to 57 nt in vivo as well as in vitro (Fujii and Fuchs, 2009[href=https://www.wicell.org#bib2]), the detection of one untargeted mutagenic event will require around 102 to 103 plasmid molecules. Since we wished to detect hundreds to thousands of untargeted mutagenic events by mass sequencing, we aimed to prepare plasmid pools containing around 106 plasmid molecules that underwent independent TLS events. If a plasmid pool is not a proper size (i.e., < 106), this transformation step should repeat until reaching the proper size.\nTransfer the suspension into a 2 L flask containing 200 mL of LB with antibiotics\nCultivate the culture at 37°C with shaking (200 rpm) until OD = 1 (it takes ∼7 h)\nCollect the cells by centrifugation (3,000 g, 15 min, 15°C)\nPurify plasmid from the collected cells according to Qiagen’s MAXI prep plasmid preparation protocol. The plasmid preparation is termed “1st prep”\nMeasure DNA concentration by Nanodrop\nConcentrate the plasmid underwent TLS events\nTiming: 1 week",
    "As the plasmid pool in the “1st prep” derived from the lesion-containing plasmid contains largely undesired plasmid molecules (∼90% of total plasmid) not undergoing TLS events in cells, this step aims to increase proportion of desired closed circular plasmid molecules (∼10% of total plasmid) that underwent TLS events from the plasmid pool. The following steps aim to digest the undesired plasmid molecules into linear DNA, while plasmids that were mutated by TLS events have become resistant to the specific endonucleases. Linear and closed circular DNA can then be separated by CsCl density gradient centrifugation. In addition, the transformation efficiency of linear DNA is negligible compared with closed circular DNA in E. coli.\ntable:files/protocols_protocol_536_12.csv\nAdd and mix CsCl until reaching saturation in TE (Tris + EDTA + ddH2O), then add more CsCl (∼10 g). Subsequently, add and mix isopropanol. The resultant mixed solution appears as two separated, aqueous (bottom) and organic (top), layers.\nThe following steps are specific to the case of “1st prep” derived from the lesion-containing plasmid. With respect to the lesion-free control plasmid, we describe the protocol later on.\nDouble digestion by restriction enzymes, KpnI / HpaI\nTransfer 20 ug equivalent volume of the “1st prep” derived from the lesion-containing plasmid into a 1.5 mL tube\nAdjust the volume of DNA solution to 291 ul with MilliQ water\nAdd 36 ul of 10× Cut Smart buffer (NEB)\nMix well\nAdd 26 ul of 5 u/ul HpaI and 6.8 ul of 100 u/ul KpnI-HF\nIncubate the tube (∼360 ul of reaction mixture) at 37°C for 2 h\nPurify DNA through phenol/chloroform treatment and ethanol precipitation\nTransfer the reaction mixture into a 15 mL tube",
    "Note: Check if the digestion is efficient by agarose gel electrophoresis. In our assay conditions, the plasmid pool in the “1st prep” derived from the lesion-containing plasmid is composed of ∼90% (not associated to TLS; indicated by appearance of white colonies) and ∼10% (associated to TLS; indicated by appearance of blue colonies) of plasmid. These outcomes indicate the ∼90% of plasmid molecules are progenies derived from the KpnI strand, leading to KpnI sensitivity and HpaI resistance. The remaining ∼10% are progenies derived from the HpaI strand, leading to resistance to both KpnI and HpaI (see Figure 1[href=https://www.wicell.org#fig1]). With respect to HpaI digestion in addition to KpnI digestion, there are two sources for generation of HpaI sensitive progenies: 1) derived from the HpaI strand in the absence of the TT (6-4) lesion (i.e., this is the same as the lesion-free control plasmid) (such a contamination is normally inevitable during construction of the lesion-containing plasmid due to the presence of lesion-free oligo as a minor contamination (e.g., ∼0.5% in our case) in the lesion-containing oligo pool; 2) as a minor event, Pol V faithfully bypasses the TT (6-4) lesion, resulting in HpaI sensitive progenies and appearance of white colonies. Whereas the proportion of HpaI sensitive plasmids in the plasmid pool would be minor, we exclude such progenies via HpaI digestion in order to simplify interpretation of obtained data. As shown in Figure 4[href=https://www.wicell.org#fig4], the vast majority of plasmid is indeed sensitive to KpnI (the double digestion, KpnI/HpaI, exhibits visibly similar pattern as the KpnI single digestion as expected).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/536-Fig4.jpg\nFigure 4. Confirmation of restriction endonuclease digestion\nIndicated DNA samples are analyzed by a 0.7% agarose gel with EtBr (0.5 ug/mL)",
    "Note: If the digestion is inefficient compared with an expected outcome based on proportion of blue and white colonies on X-gal-containing LB plates, repeat the digestion process again.\nCritical: When SOS-induced host strains are transformed with the plasmid after the double digestion (see the lane of KpnI/HpaI digestion in Figure 4[href=https://www.wicell.org#fig4]), around 70%–80% of blue colonies appear on X-gal-containing LB plates in contrast to ∼10% of blue colonies by the plasmid of the “1st prep” (see the lanes of no digestion in Figure 4[href=https://www.wicell.org#fig4]).\nCritical: If the proportion of blue colonies reach ∼90% by this double digestion step, the following “Ultracentrifugation” and “Second double digestion” steps can be skipped because the value is high enough and a further increase of the proportion of blue colonies will be difficult. In this case, the next step becomes “Secondary transformation” step.\nUltracentrifugation and fractionation\nAdd 3.6 mL of TE to the reaction mixture in the 15 mL tube (total 4.3 mL)\nAdd 100 ul of 10 mg/mL ethidium bromide (EtBr)\nAdd 4 g of cesium chloride (CsCl) (total volume becomes around 5.4 mL). Mix well\nTransfer ∼5 mL of the mixture into a 5.1 mL quick seal ultracentrifuge tube with a Pasteur pipette\nSeal the tube by heat sealer\nUltracentrifuge the tube in a Beckman NVT 65.2 rotor (50,000 rpm, 16 h, 20°C)\nThe tube is carefully fixed with an appropriate support rod. Subsequently, cut an upper side of the disposable ultracentrifuge tube carefully to avoid disturbing the gradient formed in the tube.",
    "Note: Presence of DNA is visibly observable by different contrast in the tube. However, in our sample preparation conditions (i.e., the presence of excess amounts of linear DNA), we cannot see a single band composed of closed circular DNA because significant amounts of linear DNA are also contaminated in the same local area of the closed circular DNA (see Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/536-Fig5.jpg\nFigure 5. DNA profile in fractions via ultracentrifugation\nFractions 8–17 are analyzed by a 0.7% agarose gel with EtBr (0.5 ug/mL): 3 ul of each fraction are loaded. We choose fractions 12–13 as a ccDNA enriched fraction. The lane control is loaded 10 ng of plasmid (no treatment of restriction endonuclease)\nWithdraw aliquots (∼170 ul each) from the upper phase of the sample using a tube connected to a pump (total ∼20 fractions).\nNote: The total recovery volume is ∼3.4 mL and the remaining ∼1.6 mL from the bottom side is discarded.\nNote: If there is not an appropriate pump, withdraw aliquots (∼170 ul each) manually from the upper phase by using a pipette\nEach sample is adjusted to 0.3 mL with MilliQ water\nAdd 1 mL of the organic isopropanol phase (top layer) of \"CsCl saturated isopropanol with TE\". Mix well\nNote: In the tube, two phases visibly appear, an aqueous phase containing DNA sample at the bottom side and an organic phase containing isopropanol and EtBr on top side. As solution including EtBr exhibits a color of red just under normal light, conversion of red to clear color indicates removal of EtBr.\nTake off and discard supernatant (the top layer). Repeat steps j and k 2 times more in order to thoroughly remove EtBr from the samples (total 3 times)\nAdd 3 volumes of MilliQ water\nEthanol precipitate",
    "Note: Whereas the sample already contains high concentration of CsCl as a salt, we implement a standard ethanol precipitation (adding 1/5 volumes of 3 M NaOAc and 3 volumes of ethanol).\nResuspend the pellet with 25 ul of 1/10 TE (10-fold dilution of TE by MilliQ water)\nMeasure DNA concentration by Nanodrop\nChoose fractions containing closed circular DNA via checking migration pattern of DNA in agarose gel electrophoresis (Figure 5[href=https://www.wicell.org#fig5])\nNote: Amounts of the recovered DNA will be 3–6 ug.\nNote: Owing to the presence of excess amounts of linear DNA in the input sample, it is not easy task to clearly separate closed circular DNA (ccDNA) from linear DNA during the ultracentrifugation. Instead, this step aims to moderately increase relative concentration of ccDNA by choosing fractions containing relatively high amounts of ccDNA. (e.g., choose fractions containing >20% of ccDNA relative to the total amounts of ccDNA).\nNote: Although this ultracentrifugation step will moderately increase the relative proportion of ccDNA in the total DNA (and also exclude minor genomic DNA contaminants in principle), the percentage of blue colonies is not changed because the sources of blue and white colonies rely on ccDNA.\nSecond double digestion\nNote: In order to obtain a high-quality DNA substrate (e.g., result in around 90% of blue colonies) consisting of the desired plasmid molecules that underwent TLS events, DNA samples are digested by endonucleases again to linearize residual undesired plasmid molecules that do not contain the TLS mutation signature and thus remain sensitive to KpnI or HpaI digestion.\nNote: When assaying a different TLS polymerase, mutant background or organism, proportion of blue colonies may never reach ∼90% due to generation of untargeted secondary mutations leading to inactivation of lacZ (see expected outcomes[href=https://www.wicell.org#expected-outcomes]).",
    "Repeat steps a-f of the section “Double digestion by restriction enzymes, KpnI / HpaI”, but adjust the experimental settings (reaction volume, amounts of restriction enzymes) to the amounts of DNA (will be 3–6 ug).\nPurify DNA through phenol/chloroform treatment and ethanol precipitation\nResuspend the pellet in 10 ul of 1/10 TE. This sample is termed “treated 1st prep”\nMeasure DNA concentration by Nanodrop\nEstimate amounts of ccDNA by agarose gel electrophoresis\nCritical: Check the quality of plasmid in the “treated 1st prep” via transformation to measure percentage of blue colonies. By this second double digestion, proportion of blue colonies will slightly increase to ∼90% from 70%–80% in the first double digestion (and also in the sample following the ultracentrifugation). Although DNA profiles on agarose gel are indistinguishable before and after the second double digestion (Figure 6[href=https://www.wicell.org#fig6]), a subfraction of ccDNA leading to appearance of white colonies would be digested. If the second double digestion does not slightly increase proportion of the blue colonies, sequencing a few white colonies may be useful to judge if re-digestion is meaningful (see troubleshooting 5[href=https://www.wicell.org#troubleshooting]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/536-Fig6.jpg\nFigure 6. DNA profiles before and after “Second double digestion”\nEach 30 ng of DNA is analyzed by a 0.7% agarose gel with EtBr (0.5 ug/mL).\nRestriction digestion of the lesion-free control plasmid",
    "Note: As shown in Figure 1[href=https://www.wicell.org#fig1], when a host strain is transformed by the lesion-free plasmid, two different plasmid progenies (i.e., KpnI strand derived and HpaI strand derived) are equally amplified in the strain, and both of which just lead to appearance of white colonies on X-gal-containing LB plates. Our experimental purpose is to detect untargeted mutagenic events associated to Pol V-induced targeted mutagenesis occurring on the HpaI strand in the lesion-containing plasmid. Therefore, as a control, we aim to enrich the HpaI strand-derived plasmid progenies from the lesion-free plasmid pool through digestion of the KpnI strand-derived plasmid progenies with the restriction enzyme, KpnI.\nDigest the “1st prep” derived from the lesion-free plasmid as previously mentioned in the section, “Double digestion by restriction enzymes, KpnI / HpaI”, but omit HpaI. This sample is termed “treated 1st prep”\nNote: As shown in Figure 2[href=https://www.wicell.org#fig2], there is no requirement to do further processing for the lesion-free prep (i.e., ultracentrifugation and second double digestion) that were implemented in the preparation of “treated 1st prep” of the lesion-containing plasmid pool.\nSecondary transformation\nTiming: 2 days\nThis step aims to amplify the plasmid pool in the “treated 1st prep” (prepared from both lesion-free and lesion-containing plasmid pools) in order to obtain sufficient amounts of plasmid for mass sequencing (Figure 2[href=https://www.wicell.org#fig2]).\nTransformation and recovery of plasmid are implemented as the same way described in the section, “Primary transformation” except that the host strain is a wild-type strain (MGZ) without SOS-induction; input DNA is 2 ng of ccDNA in “treated 1st prep”. The recovered plasmid preparation is termed “2nd prep”\nNote: As the purpose is to amplify the plasmid pool in cells, any wild type cells can be used as competent cells.",
    "Note: 2 ng of plasmid (∼2.7 kbp) contains ∼4.9 × 108 plasmid molecules. Around 106 of transformants will appear and cover most of independent TLS events occurred on plasmid in the “1st prep”.\nNote: This “2nd prep” is subjected to mass sequencing such as Plasmid SMRT sequencing (Pacific Biosciences) that requires 1–2 ug of input DNA."
  ],
  "subjectAreas": [
    "Microbiology",
    "Genetics",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}