{
  "id": 13032,
  "origin_website": "Jove",
  "title": "In Vivo Real-Time Study of Drug Effects on Carotid Blood Flow in the Ovine Fetus",
  "procedures": [
    "For the present study, approval for the animal experiments was obtained from the Animal Care and Use Committee of the University of Arizona. One time-mated, pregnant Columbia-Rambouillet ewes between 2-4 years of age were used for the present study. The animals were obtained from the University of Arizona Sheep Unit.\n1. Animal maintenance\nObtain animals from any sheep ranch.\nTransport the ewes to the laboratory at 105 days ± 5 days to 137 days ± 5 days of gestational age (dGA). Maintain the sheep at a temperature of 22 °C ± 1 °C in ambient humidity. Provide alfalfa pellets (see Table of Materials), salts, and water ad libitum.\n2. Material preparation\nConstruct the perivascular catheter system.\n\t\nJoin one end of 4 ft of Tygon tubing to a 2 cm manifold pump tubing (MPT) (see Table of Materials). Attach the other end of the 2 cm MPT to another 4 ft of Tygon tube.\nMake a small slit in the MPT so that the liquid/agents can come out into the perivascular space.\nSterilize the flow probes (see Table of Materials), catheters, and a small screwdriver using the gas sterilization method.\n3. Presurgical animal preparation\nObtain approval for animal experiments from the Institutional Animal Care and Use Committee.\nPrior to surgery, keep the ewes on nil per os (NPO) food for 24 h and NPO water for 16 h. On the day of surgery, wrap the ewe's face with a pad to protect her eyes. Shave the left side of the neck to expose the jugular vein, and clean the skin using povidone-iodine and 70% ethanol.\n\t\nPlace an intravenous (IV) catheter in the ewe's jugular vein, and secure it to the skin with waterproof tape and wound clips (see Table of Materials).",
    "Sedate the ewes with an IV administration of diazepam (0.15 mg/kg) and ketamine hydrochloride (16 mg/kg). Administer an IM injection of penicillin G procaine suspension (25,000 I/kg) and IV ketoprofen (2.2 mg/kg) (see Table of Materials).\nShave the incision site of the sheep and the surrounding areas (abdomen, flanks, and groin) with #10 blade clippers. To ensure the wool is completely removed, reshave the area with a #40 blade. Wash the shaved area with a germicidal cleanser (see Table of Materials) and water. Dry with a disposable pad.\nConfirm adequate sedation (the sheep is expected to be lethargic and sleepy), and then intubate the ewe with a 6.5-7.5 mm inner diameter endotracheal tube (see Table of Materials), and secure the tube in place. Place the ewe on a lift table in the lateral recumbent position, and transfer to a V-top surgical table in the supine position.\n\t\nSecure the ewe's limbs to the V-top surgical table with surgical tie-downs. Bring the ewe into the Trendelenburg position to alleviate pressure on the fetal-placental unit.\nAttach a pulse oximeter probe (see Table of Materials) to the ewe's tongue/ear to continuously monitor the oxyhemoglobin saturation and heart rate. Place a thermometer under the ewe's tongue to monitor the temperature.\n\t\nConnect the endotracheal tube to the respiratory circuit of the anesthesia machine, and initiate mechanical ventilation while monitoring the expired CO2.\nMaintain the anesthesia by adjusting the isoflurane between 2.5%-4% throughout the surgery. Ensure the animal is adequately anesthetized by pinching the ear. Administer a balanced poly-ionic (saline 0.9% w/v) solution at 5 mL/kg/h using the jugular catheter placed during step 3.2.1.",
    "Perform a sterile scrub. Spray the abdominal area and the flanks with povidone solution (10% iodine solution). Scrub the area with an iodine-soaked gauze starting from the incision site and working outward, making sure not to go back to the center after scrubbing outward.\n\t\nNext, spray the area with ethanol (70% ethanol w/v), and scrub with an ethanol-soaked gauze in a similar way to the scrubbing with povidone. Repeat the whole process three times. Spray the area with povidone solution.\nWarm saline in a sterile container, and bring it to 37 °C. Keep this near the surgical table. Connect the cautery (see Table of Materials).\nHave the surgical team members dress in caps, face masks, and shoe covers, wash their hands (surgical scrub), and put on sterilized surgical gowns and gloves. From this point onward, a strict sterile surgical practice must be followed.\nDrape the sterilized sheep's abdominal area with sterile towels.\n4. Surgical procedure\nExteriorizing the fetus\n\t\nAfter ensuring an adequate depth of anesthesia, perform a 10 cm standard laparotomy incision using a scalpel (#20 blade) over the linea alba from the umbilicus to the cranial portion of the udder. Control the bleeding while making an incision with a cautery (power settings: 50 cut and 25 coagulation).\n\t\t\nMake a small incision through the midline of the body wall beneath the skin incision, and open the abdominal cavity using Metzenbaum scissors (see Table of Materials).\nExteriorize the uterus containing the fetus through the abdominal wall while placing sterile surgical towels underneath (between the maternal abdomen and uterus). Palpate the uterus to determine the fetal position and cotyledons. Using a cautery, make a ~10 cm incision through the uterine wall with a large curvature over the dorsum of the head, avoiding any visible blood vessels and placentomes.",
    "Use four Babcock clamps (see Table of Materials) to secure the uterus and placental membranes, and pull the Babcock clamps at the four opposing corners to make the fetal head visible. Exteriorize the cranial half of the fetus through this incision, and cover the fetal head with a sterile, non-latex glove filled with warm, sterile saline (37 °C) to prevent the initiation of breathing.\nInstrumentation of the carotid artery perivascular catheter\n\t\nWhen removing the fetal head from the uterus, have an assistant gently hold the Babcock forceps upright to minimize amniotic fluid loss. With the neck of the fetus exposed, perform a 3-3.5 cm oblique skin incision along the anterior border of the sternocleidomastoid (SCM) muscle on one side of the neck in the middle region, and separate the fascia with mosquito forceps.\n\t\t\nDivide the platysma, and perform a dissection along the medial border of the SCM muscle from its tendon superiorly to the level of the omohyoid muscle inferiorly. Retracting the SCM will expose the carotid sheet, which superficially contains a thin-walled internal jugular vein, and below it will be the carotid artery as a thick-walled vessel.\nRetract the skin with Babcock clamps, and perform a blunt dissection to free the carotid artery from the surrounding tissue and the carotid sheet.\nTake the 3 mm flow probe (see Table of Materials) from the sterile pack, unscrew the probe's backing plate, and slide it open to expose the L-bracket. Carefully lift the carotid artery, and gently hook the bracket underneath the vessel while avoiding contact with the vessel.",
    "Use forceps to close the flow probe bracket by gently sliding the backing plate to a closed position. Secure the flow probe bracket by tightening the backing screw of the flow probe. To ease this process, gently grip the ends of the flow probe with forceps to stabilize the flow probe while the screw is being tightened.\nPre-flush the perivascular catheter, and place it in the close vicinity of the carotid artery proximal to the flow probe. Ensure that the open slit of the perivascular catheter is in close proximity to the carotid artery.\n\t\t\nWith a 3-0 silk nonabsorbable suture, secure the proximal and distal ends of the perivascular system and the flow probe to the nearby interstitial tissue. Close the incision site using a continuous stitch, close the fetal skin with a 3-0 silk nonabsorbable suture, and secure the catheters to the skin by wrapping the suture around the catheter three times. Remove the glove, and place the fetal head back in the uterus.\nFetal limb catheterization\n\t\nExteriorize the hind leg of the fetus. Hold the leg, and turn it sideways to visualize the inner thigh area. Clean the area with sterile gauze, perform a 2 cm incision, and expose the femoral artery. Place and secure the flow probe following a similar procedure as done with the carotid, and then close the incision.\nMake a 2 cm incision along the medial aspect of the tibia ~0.5 cm distal to the knee. Expose the posterior tibial artery (thick-walled) and saphenous vein (thin-walled). Insert polyvinyl catheters (outer diameter: 1.4 mm and inner diameter: 0.9 mm) into the posterior tibial artery and saphenous vein using a standard cut-down technique, as mentioned below:",
    "Free the vessel of interest with blunt dissection. Ligate the distal portion of the vessel with a 3-0 silk suture (no needle) using a square knot with three throws. Pre-place a second silk-free tie at the proximal aspect of the vessel (under the vessel), but leave the ligature untied. Using Castroviejo scissors (see Table of Materials), make a small, transverse cut in the vessel 2 mm proximal to the distal ligature. The length of the cut should be ~25% of the vessel's diameter.\nRestrict the vessel blood flow by gently pulling up on the proximal, untied suture. Fill the catheter with sterile heparinized saline. Insert the beveled end of the catheter, and advance the tip 20 cm into the fetal vessel.\nHold the catheter in place with forceps while an assistant ties the proximal silk free-tie suture to secure the vessel to the catheter; ligate the vessel completely around the inserted catheter using square knots 2 mm from the insertion site with three throws. Tie the distal ligature proximal to the proximal tie securing the vessel to the catheter.\nClose the skin incision using a 3-0 silk nonabsorbable suture using a continuous suture pattern. Ensure the sutures are tied around the catheters to avoid restricting the blood flow if pulled. Place a pre-flushed catheter in the uterus, and secure it to the fetus by a suture using a 3-0 nonabsorbable silk suture.\n5. Placing the fetus back and closing the wound\nReturn the fetus to the uterus. Suture the fetal membranes using 3-0 nonabsorbable silk sutures with a continuous locking (Cushing) pattern. Close the uterine muscular layer using a 3-0 nonabsorbable silk suture.",
    "Insert an 18 in stainless steel surgical rod subcutaneously along the abdominal wall up to the paracostal region. Let the proximal end of the rod exit the paracostal site by performing a 1 cm incision.\n\t\nAttach catheters to the distal end of the surgical rod, and have an assistant feed the catheters and flow probe cable through the paracostal exit site by pushing the rod fully through the paracostal opening.\nSecure all the catheters and flow probe cables at the paracostal incision site. Place with waterproof tape, and suture the catheters to the skin of the ewe. Suture a plastic mesh pouch to the exterior of the ewe over the catheters and probe to store the catheters.\n\t\nUsing a 1-0 monofilament synthetic absorbable suture material, secure the linea alba with a continuous pattern. Secure the skin layer with surgical staples.\nStop the general anesthesia, and extubate the ewe once the laryngeal reflexes have returned to normal baseline. Do not leave the animal unattended until it has regained complete consciousness. Move the ewe to the metabolic cart once she is stable following general anesthesia. Return the animal to the post-operative experiment room after fully recovering from the anesthesia.\nAdminister post-operative analgesics intravenously (10 mg/kg/day phenylbutazone) for 3 days. Flush the vascular catheters daily with heparinized saline solution (100 U/mL heparin in 0.9% NaCl solution).\n6. Post-operative in vivo experiments\nFlush the catheters every day with heparinized saline (75 U/ml). Wait for 72 h before making any measurements. To measure the blood flow, attach the flow probes inserted into the fetus with the perivascular flow module to PowerLab and an attached computer.\n\tNOTE: The recordings can be done on the PowerLab software (see Table of Materials) to measure the carotid and femoral blood flow. Take the baseline measurement for 30 min.",
    "Attach the arterial and amniotic catheters to the bridge amplifier attached to an analog-to-digital converter (see Table of Materials). Administer a 1 mL bolus of 10 uM phenylephrine to the fetus intravenously, and measure the carotid and femoral flow for 15 min. Then, wait for 30 min or until the blood flow returns to baseline.\nInfuse 1 mL of 10 uM phenylephrine into the perivascular catheter, and measure the blood flow for 15 min. Wash out the phenylephrine by administering 5 mL of warm saline through the perivascular catheter. Then, wait for 30 min or until the blood flow returns to baseline.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}