{
  "id": 18469,
  "origin_website": "Jove",
  "title": "Using a Laminating Technique to Perform Confocal Microscopy of the Human Sclera",
  "procedures": [
    "The use of human tissues must be reviewed and approved by an institutional review board or the equivalent. The work described here was approved by the local ethics committee and had approval for scientific examination. This work was performed according to the Declaration of Helsinki. The human scleral specimens were obtained from the eyes of globe donors (maximum post-mortem time 24 hr) at the Eye Bank of the Department of Ophthalmology, University of Cologne, Germany.\n1. Experimental Preparation\nPrepare 96% ethanol and phosphate buffered saline (PBS) in different tubes. Prepare the primary antibodies in the recommended dilution of PBS containing 2% bovine serum albumin (BSA) and keep all solutions on ice. Prepare 100 μl per sample.\nClean all instruments and use sharp scalpels. After repeated cutting with the same scalpel, change the scalpel.\nObtain 1-2 colibri forceps, straight micro dissecting scissors, a #10 scalpel or ophthalmic scalpel micro feather, and four 26 G needles.\nWrap aluminum foil around a polystyrene plate or use a cork plate to affix the tissue. Work underneath a binocular stereo microscope. Work sterile underneath a laminar airflow if needed.\n2. Prepare the Sclera\nGently hold the bulb and perform a perforating trepanation on the corneoscleral part, then rotate the trepan. Rotate the trepan carefully and evenly onto the surface to perform an equally round cut. Use a 15.5 mm sized trepan. Cut the remaining attachments with curved scissors. Remove the corneoscleral trepanation. This will result in an anteriorly opened bulb.",
    "Put the sclera on a swab with the open part upwards. Remove the retina and uvea, using colibri forceps to pull off both layers (retina and uvea) from the sclera. Do not leave the pigmented uvea on the inner sclera. Use curved scissors to remove the retina and uvea from the papilla. Remove the remaining conjunctiva, extraocular muscles, and tenon's capsule from the superficial sclera.\nRemove the scleral sample in the required size by using straight-type scissors and the colibri forceps. Take about 2 cm2 sized scleral samples from different locations. Because of the small size, hold the sclera gently and cut out the required size as squares using the straight-type scissors. The corneoscleral trepanation defines the anterior margin of the scleral samples.\n\t\nAvoid repeated grabbing with the forceps as the area where the tissue was grabbed is not suitable for confocal microscopy analyses. Prepare the required number of samples depending on the experiment type (e.g. anteriorly vs. posteriorly, compare Figure 1) and the amount of antibodies used.\nPut the samples in 1.5 ml tubes for later use. Fix the samples in 1.5 ml 96% ethanol for 15 min, and then wash them three times each for 5 min in 1.5 ml PBS on the shaker. If working with frozen tissue, perform this step before snap freezing.\nUse fresh tissue. However, if this is not possible, snap freeze the sclera in liquid nitrogen and keep it at -20 °C for later use. If working with frozen tissue, thaw before use. Avoid repeated thawing and freezing cycles.\nKeep each sample in PBS containing 1.5 ml 5% BSA at room temperature for 2 hr. This step induces a swelling of the sample that is helpful for the laminating and also prevents unspecific binding.",
    "After the samples have swelled, prepare the scleral squares for lamination. Work underneath a microscope, e.g. a binocular stereo microscope. Affix the posterior scleral samples to the polystyrene membrane wrapped in aluminum foil or the cork plate using the 26 G needles.\nBend the edges of the needles so they do not interfere with the visual field underneath the microscope.\nLaminate the full-thickness scleral samples.\n\t\nFirst, hold the anterior scleral edge using colibri forceps. Then carefully cut a thin layer of the superficial sclera using the #10 scalpel, the ophthalmic scalpel micro feather, or a spatula blade. Hold the scalpel horizontally and cut the superficial layer as thinly as possible from the underlying layer.\nDissect a thin scleral layer from the scleral square. This method is comparable to standard surgical techniques to prepare a flap during trabeculectomy and should result in 30-80 µm thick layers (compare Figure 2).\nPrevent drying of the sclera by adding small amounts of PBS to the tissue, e.g. 50 µl PBS using a pipette.\nPut the cut layers into 100 µl of PBS in the 96 well plate and label both the orientation (towards extern and intern) and the layer (superficial and profound) e.g. with a waterproof color.\nRepeat steps 2.7-2.9 until the tissue is fully laminated.\n3. Perform Immunohistochemistry\nAdd 100 µl of the required primary antibodies into the recommended dilution. Here, e.g. use CD 31 (monoclonal mouse anti human) and LYVE1 antibody (rabbit anti human), both in a dilution of 1:100 in PBS (containing 2% BSA) and incubate at 4 °C overnight. To change the medium in the 96 well plate, hold the pipette to the wall of the well and remove the fluid.",
    "The next day, wash the samples three times each for 5 min with 200-300 µl PBS on the shaker. Add 100 µl of the corresponding secondary antibodies; here use goat anti mouse fluorescein isothiocyanate (FITC) and goat anti rabbit cyanine dyes 3 (Cy3), and incubate the samples at room temperature for 1-2 hr. Dilute the secondary antibodies 1:300 in PBS containing 2% goat serum.\nRinse the samples again three times each for 5 min in 200-300 µl PBS on the shaker.\nPerform nucleus staining, e.g. 4',6-diamidino-2-phenylindole (DAPI) (dilution 1:2,000, 100 µl in each well and incubate 10 min at room temperature), then wash again 2 times in 200-300 µl PBS on the shaker.\nTransfer the samples onto microscope slides, embed them in 1-2 drops of fluorescent mounting medium, add a coverslip, seal it by covering the edges with transparent varnish, and store at 4 °C for later use or directly examine the slides with the confocal microscope.\nUse a confocal microscope (or equivalent) to analyze the samples. Use the desired magnification, e.g. 10-40X magnification.\nTo verify the thickness of the samples, measure with confocal microscopy using Z-Stacks. The amount of possible scleral sections depends on the location of the sclera, as the thickness differs equatorially and posteriorly (compare introduction).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}