{
  "id": 10705,
  "origin_website": "Jove",
  "title": "Quantification of Strain in a Porcine Model of Skin Expansion Using Multi-View Stereo and Isogeometric Kinematics",
  "procedures": [
    "This protocol involves animal experiments. The protocol was approved by the IRB of Ann and Robert H. Lurie Children's Hospital of Chicago Research Center Animal Care and Use Committee to guarantee humane treatment of animals. The results for two expansion studies using this protocol have been published elsewhere 16,31.\nExecution of this protocol requires a team with complementary expertise. The first part of the protocol describes the surgical procedure on the animal model, requiring personnel with the appropriate medical training. The subsequent analysis, particularly sections 4 and 5, involve basic computer programming skills in C++ and Python, and use of a command line shell.\n1. Surgical Procedure for Expander Placement\nNOTE: Personnel involved in the operation must be scrubbed and gowned in a sterile fashion. Sterile towels and drapes are applied around the surgical field to maintain sterility. All instruments, sutures, and tissue expanders are received in sterile packaging and handled only by sterile personnel. Sterility of the operative site must not be violated until the procedure is complete.\nAcclimate one-month-old male Yucatan mini pigs to standard housing for one week, and feed ad libitum.\nOn the day of surgery, anesthetize the animal using ketamine/acepromazine for induction (4 - 6 mg/kg), then isoflurane for maintenance. Evaluate depth of anesthesia by monitoring the palpebral reflex. Also, monitor vital signs (heart rate, body temperature, respiratory rate, and/or response to pinch by tissue forceps). Apply ophthalmic ointment to the eyes to protect against corneal abrasions.",
    "Administer pre-procedural antibiotics and clean the dorsal skin with chlorhexidine-based surgical soap. Transfer four 10 x 10 cm2 grids, two on each side of the animal, with 1 cm line markings to the pig skin using tattoo transfer medium. The grids correspond to the following four regions: left rostral, right rostral, left caudal, and right caudal. Use a template with a midline reference to ensure symmetric placement of the grid patterns.\n\t\nCreate the grids on paper by tracing the grid outlines heavily with a ballpoint pen. Wash the area on the animal where the grid is to be placed with isopropyl rubbing alcohol.\nApply the grid (pen-ink side down) directly onto the skin. The alcohol serves to leech some of the ink off of the paper, transferring the grid to the animal's skin.\nInject local anesthetic (1% lidocaine with 1:100,000 epinephrine) subcutaneously at the site of each planned incision.\nMake an incision on either side of the animal in the midpoint between the two grids.\n\tNOTE: The incisions are placed on the left and right side of the animal between the 2 grids on that side. There is a left sided incision and a right sided incision\nUse a hemostat to develop a subcutaneous tunnel beneath the grid of interest. After developing a tunnel, insert the expander beneath the grid.\n\tNOTE: Tunnels are placed under any grid that will have a tissue expander.\nPlace the port for expander inflation remotely through a subcutaneous tunnel developed in a similar fashion along the dorsal midline of the animal. Repair wounds by suturing.\nPostoperatively, treat the animal with prophylactic antibiotics (Ceftiofur 5 mg/kg IM once) as well as analgesics (Buprenorphine 0.05 - 0.1 mg/kg) via intramuscular injection every 12 h for 4 doses, with additional doses available for evidence of animal distress.",
    "Observe animals continuously for 2 h postoperatively, including routine measurement of vital signs until they have resumed ambulation and are able to maintain normothermia. House the animal in a separate cage and monitor until it is able to walk independently on all 4 legs before transferring it back to its normal housing area and leaving it unattended.\nFollowing the immediate post anesthesia recovery period, check animals daily to evaluate wound healing. Remove the sutures 14 days postoperatively. These incisions do not require dressings. Leave the incisions to heal for 3 - 4 weeks before beginning expansion\n2. Inflation Protocol\nNOTE: The timing of the inflations and amount of solution used in each expander depends on the specific question being studied. To characterize the effect of different expander geometries, a suitable protocol is to perform five inflation steps at 0, 2, 7, 10, and 15 days to achieve filling volumes of 50, 75, 105, 165, and 225 cc respectively.\nBefore each inflation step, sedate the animal administering ketamine (4 - 6 mg/kg) and dexmedetomidine at 20 - 80 µg/kg.\n\tNOTE: Dexmedetomidine is an alpha-adrenergic agonist that can be reversed with atipamezole (1:1 volume:volume) to facilitate faster recovery; however, this level of sedation may not be adequate for the animal to tolerate expansion without undue risk of harm to the animal or handlers. If this is the case, administer general anesthesia by delivering isoflurane via mask ventilation following ketamine/acepromazine induction.\nAttach two plastic flexible tape measures to the skin of the animal using surgical tape. Place the tape measures between the grids on the left and right sides.\nPlace the animal on one side and acquire 30 photographs of the scene from as many different angles as possible.",
    "NOTE: The objective is to capture the geometry of the two grids visible when the animal is laying down on one side.\n\t\nFirst, position the camera above the animal and leaning towards the caudal side, to capture a shot where the tattooed grids are fully visible and fill the frame.\nMove in a circular pattern around the animal in an arch from the caudal to the rostral direction, taking photographs along the way, ensuring that, for every photograph, the tattooed grids that are visible appear entirely in the frame.\n\t\t\nAt the same time, try to maximize the space that the grids occupy in the frame. An ideal shot would capture the back of the animal with the tattooed grids and only small regions of background.\nNext, position the camera towards the ventral side to capture a shot angle that is approximately parallel to the ground and take photographs in an arch from the ventral to the dorsal region.\n\t\tNOTE: The amount of photographs is not a fixed value. For a good reconstruction, every point on the tattooed grid should be in at least 3 photographs; 30 photographs in total is an adequate amount for successful geometry reconstruction.\nPlace the animal on the opposite side and take 30 photographs of the two remaining grids following the same steps outlined above.\nPerform the inflation step by finding the remote filling port and injecting the required amount of saline solution corresponding to the expansion protocol of interest. Use sterile 0.9% injectable saline.\n\t\nLocate the ports and prep over the skin of the animal with isopropyl alcohol wipes. Access the port with a sterile 25-gauge butterfly needle attached to a syringe filled with sterile injectable saline.",
    "NOTE: As described above, the ports are tunneled subcutaneously to a position on the anterior midline dorsum during expander placement.\nInject the desired amount of saline solution. Please refer to the note at the beginning of this section for the inflation volumes injected at each step of the expansion process.\nRepeat the photo acquisition steps after inflation.\nOnce the inflation protocol is complete, euthanize the animals.\n\t\nAdminister general anesthesia by delivering isoflurane via mask ventilation following ketamine/acepromazine induction. Evaluate depth of anesthesia by monitoring the palpebral reflex. Also, monitor vital signs (heart rate, body temperature, respiratory rate, and/or response to pinch with tissue forceps).\nEuthanize the animal by intravenous overdose of pentobarbital 90 - 100 mg/kg. Following pentobarbital overdose for euthanasia, confirm death by the absence of detectable heartbeat using a pulse oximeter and pulse palpation as well as the absence of spontaneous respirations.\n3. Multi-view Stereo Reconstruction\nUse commercially available software to upload the image files and reconstruct the geometric models.\n\t\nLaunch the MVS software on the browser and log in.\nSelect Photo to 3D on the top left corner.\nClick add photos, browse to the location of the images and manually select the 30 photographs corresponding to a single model.\nName the model and click create\nWait for the model to be created. This can take several minutes. Click dashboard on the right to go back to the original landing page of the software.\n\t\tNOTE: The dashboard shows representative images of the geometric models that have been created by the user.\nPlace the cursor on the model that has just been created. Place the cursor on the bottom right corner of the model image. Click downloads and select obj.\n4. Spline Surface Fit\nUse open source software to process the geometric models.",
    "Click File->Import->obj to import the file generated from the MVS software. On the bottom of the 3D View click on Viewport Shading and select Texture. Look for a tab on the right of the 3D View with the submenus: Transform, Grease Pencil, View, 3D Pencil, etc. Click on Shading and select Shadeless.\nRight click on the geometry to select it. On the bottom of the 3D View select Edit Mode to visualize the triangular mesh.\nSelect one by one the nodes on the 1 cm markings of the tape measure.\n\t\nTo select a point, right click on it, and highlight the point. Coordinates for the point appear on the tab on the right-hand side of the 3D View. Select and copy the coordinates of the selected point to a text file.\nRepeat this operation for all the points on the 1 cm markings of the tape measure.\nDo this for both tape measures. Examples of coordinate text files are provided: tape1.txt, tape2.txt.\n\t\tNOTE: If there are no nodes of the mesh on the point of interest, subdivide the mesh until there is a node on the point of interest. To subdivide the mesh select the three vertices of a triangle by pressing Shift key and right-clicking on the vertices. Then click on the button Subdivide on the tab appearing on the left-hand side of the 3D View. This operation adds three more nodes inside the selected triangle.\nSelect the 11 x 11 points of the grid and save the coordinates of the 121 points to a text file in the pattern shown in Figure 1.",
    "Analogously to what was done for the tape measures, to select a point of the grid, right click on it, the point will be highlighted. Coordinates for the point will appear on the tab on the right-hand side of the 3D View. Select and copy the coordinates of the selected point to a text file\n\t\tNOTE: The numbering of the grid points is always caudal to rostral and from the dorsal midline towards the ventral region. This ordering guarantees that the parameter space is consistent for any two patches. As an example, the file gridReference.txt which contains the coordinates of 121 points of a skin patch is provided.\nDownload, compile and install C++ spline libraries. The file splineLibraryInstallation.txt contains the link to the source code of the spline libraries and instructions for installation.\nCompile the source code generateCurve.cpp to generate the executable generateCurve\n\tNOTE: The program generateCurve only needs to be compiled once. To compile this C++ source code and generate an executable follow the instructions at the top of the source code file generateCurve.cpp.\nUse the program generateCurve to fit splines to the tape measures and to the grid points. To run the executable in a Bash shell, type\ndirectory$ ./generateCurve\nUpon running the program, it will ask the user to type in the path to the file containing the coordinates of the tape measure. Then the program will ask for a name for the output file. Add the termination .g2 to the filename.\n\t\tNOTE: The termination .g2 stands for go tools, and is associated to the spline libraries. Two examples of spline files corresponding to the tape measures are available with this protocol (tape1.g2, tape2.g2).",
    "Use the Python script scalePoints.py to scale the grid points. Run the program in a Bash shell prompt with three arguments: the filename of the grid points and the file names of the splines corresponding to the tape measures\ndirectory$ python scalePoints.py gridReference.txt tape1.g2 tape2.g2\n\tNOTE: The script scalePoints.py imports the scripts B_spline.py and NURBS_Curve.py, therefore all three scripts must be in the same folder.\nCompile the source code generateSurface.cpp to generate the executable generateSurface.\n\tNOTE: This step only needs to be done once. More detailed instructions are available at the beginning of the source code file generateSurface.cpp.\nUse the program generateSurface to fit a spline surface to the grid points. Run the executable generateSurface on the Bash shell\ndirectory$ ./generateSurface\nRunning the program in a shell will ask for the filename containing the scaled points. Then it will ask for the name of the output file. Add the termination .g2 to the output filename.\n\t\tNOTE: The termination .g2 is suggested by the spline libraries and stands for go tools. The files gridReference.g2 and gridDeformed.g2 are provided as examples.\n5. Quantification of Expansion-induced Deformation\nStart Python in the Bash shell prompt\ndirectory$ python\n\tNOTE: Python initializes the interpreter, which is an interface similar to the shell that will show a new command line environment >>>\nImport the script expansionIGA.py which contains a function called evaluateMembraneIGA\n\t>>> from expansionIGA import evaluateMembraneIGA\nCall the function evaluateMembraneIGA to calculate the deformation maps.\n\tNOTE: This function takes as arguments:\n\tFilename of the reference surface\n\tFilename of the deformed surface\n\tResolution of the evaluation (how many points are evaluated in each direction)\n\tMinimum value of area stretch used to scale the contour plot\n\tMaximum value of area stretch used to scale the contour plot",
    "Minimum value of stretch in longitudinal direction used to scale the contours\n\tMaximum value of stretch in longitudinal direction used to scale the contours\n\tMinimum value of stretch in transverse direction used to scale the contours\n\tMaximum value of stretch in transverse direction used to scale the contours\n\tSpacing between grid lines in the contour plot\n\tOutput filename\n\t\nFor example, run\n>>> evaluateMembraneIGA('gridReference.g2', 'gridDeformed.g2', 250, 3, 0.5, 2, 0.5, 2, 0.5, 25, 'deformation')\n\t\tNOTE: This command will generate and save six output files. Note that the last argument in the example above is the output filename deformation, thus, the files that will be generated are:\ndeformation_theta.png: contour plot of the area stretch\ndeformation_theta.txt: table of values corresponding to the contour plot of area stretch\ndeformation_G1.png: contour plot of the stretch along the longitudinal axis of the animal\ndeformation_G1.txt: table of values corresponding to the contour plot of stretches along the longitudinal axis of the animal\ndeformation_G2.png: contour plot of the stretch component in the transverse axis of the animal\ndeformation_G2.txt: table of values corresponding to the contour plot of the component of the stretch in the transverse axis of the animal\n\t\tNOTE: Do not confuse the termination of the spline files, .g2, with the vector G2. The spline files have ending .g2 following the naming conventions of the spline library. On the other hand, the vectors G1 and G2 denote the longitudinal and transverse directions with respect to the animal.\n\t\tNOTE: The contour files are generated with distinct features at the four corners to facilitate interpretation of the parameter space: Black pixel: most caudal, most dorsal point; Red pixel corner: most rostral, most dorsal point; Green pixel corner: most caudal, most ventral point; Blue pixel corner: most rostral, most ventral point.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}