{
  "id": 17837,
  "origin_website": "Jove",
  "title": "Palatable Western-style Cafeteria Diet as a Reliable Method for Modeling Diet-induced Obesity in Rodents",
  "procedures": [
    "The protocol described here has been optimized for use in rats. While we have used the CAF diet successfully in mice17,18, soft food grinding may introduce further error reducing the reliability of food intake measures19. This protocol is approved by the Animal Care and Ethics Committee at the University of New South Wales and complies with the Australian guidelines for the use and care of animals for scientific purposes (8th Edition) provided by the Australian National Health and Medical Research Council.\nNOTE: Very few adverse effects have been observed in our short-term studies (i.e. <10 weeks ad libitum CAF access); there is no evidence of changes to general wellbeing, activity, sociability or anxiety-like behavior in rats on CAF diet20. After longer intervals (>16 weeks) very occasional cardiovascular incidents have been observed in CAF-fed rats.\n1. Animal Acclimatization and Housing\nAcclimate rats to the facility for 5–7 days after arrival with free access to control diet and water. Handle rats daily beginning 24 h after arrival; CAF diet involves daily interaction with the cage so regular handling is important.\nEnsure environmental enrichment is provided to all cages. A standard cage contains a red polymethyl methacrylate box, nesting material and a wooden chew stick, which is important because the soft foods provided within the CAF diet may result in rats developing malocclusion without access to harder items to chew.\nPrior to commencing CAF diet, assign cages to CAF or chow groups and ensure these are matched for starting body weight by comparing the mean and range of body weights between groups and re-allocating as necessary. As lighting exposure can affect circadian rhythms, food intake and activity, ensure CAF and chow cages are distributed evenly in the colony room.",
    "NOTE: Rodents form social hierarchies when group-housed (especially males). The effects of social stress are partially controlled for by ensuring rats are housed with others of a similar body weight (to reduce bullying within a cage). Additionally, cafeteria diet should be evenly distributed around the cage so that all rats have access to the diet.\n2. Diet Selection and Setup\nScheduling\nEnsure regular chow and water are always available and are supplemented with a minimum of two sweet and two savory items each day (an example of a weekly schedule is shown in Table 1; food options for 3 days shown in Figure 1). Optional extras are high-fat, high-sugar chow and 10% sucrose solution.\nChoose foods within each category that are similar in macronutrient proportions: all sweet items are relatively higher in carbohydrate than fat and all savory items are higher in fat than carbohydrate. Aim to provide similar proportions of fat, carbohydrate, sugar and protein in each daily set of CAF foods.\nRegularly monitor consumption throughout the experiment so that the menu can be tailored, if necessary, to sustain hyperphagia. Table 2 provides energy density and macronutrient information for several example foods, and suggested starting amounts for 200 g male Sprague Dawley rats.\nAvoid feeding any single food on consecutive days or too often in a week, as this may decrease intake of that food. If this occurs, omit the food from the schedule for a few days before re-incorporating.\nNOTE: Rats may display neophobia and most new foods require repeated exposures to determine whether they will be consumed. Rats do not typically prefer foods containing yeast (breads, pizza, etc.) or those with citrus or coffee flavors.\nWet foods",
    "Consider presenting foods higher in moisture content in a container such as a tuna tin, to avoid soiling the bedding. Empty containers should also be provided to control cages if this is done.\nDiet sourcing\nEnsure that CAF foods used are staples or obtain enough for the whole experiment so that food items remain consistent and do not need to be substituted.\nDiet storage\nStore foods as indicated on the packaging or at -20 °C and thaw the night before use. Store dry goods (biscuits) in an airtight container.\nSucrose solution (optional)\nPrepare sucrose solution, typically 10% (w/v) in bulk (2–5 L) and store at 4 °C when not in use.\nReplace sucrose bottles weekly (at a minimum) to prevent bacterial or fungal growth. Inspect bottles daily and replace if signs of growth are observed.\nNOTE: Sucrose is provided in addition to water, which is always available.\n3. Cafeteria Diet Preparation\nDefrost\nTake out appropriate amounts of CAF foods to thaw ~24 h prior to use. Food can be defrosted using a microwave but should not be presented while hot.\nDaily replenishing of CAF diet\nChanging CAF diet foods daily ensures that variety is maximized, and cage soiling is minimized. As rats eat most of their daily intake in the initial portion of the dark cycle, schedule CAF food replenishment close to the onset of the dark schedule so that food is fresh at this time. Replenish CAF diet on a day when food intake is not being measured.\nFeed the chow groups in a manner that ensures that this group has a similar daily experience, as follows.\n\t\t\nTurn the water bottles around (spouts up), place the cage on the workspace and remove the lid.",
    "Lightly disturb the bedding for approximately 20 s, to simulate the process of collecting food items from the bedding of CAF cages.\nPlace a small handful of chow pellets from the food hopper into the bedding, to equate exposure to food on the cage bedding.\nReturn the cage lid and return to the rack, replacing water bottles only when the cage is settled in order to minimize spillage.\nFeeding the cafeteria groups\n\t\t\nPrepare CAF diet items into a labeled container for each cage.\nTurn the water bottles around (spouts up), place the cage on the workspace and remove the lid.\nRemove as much of the old cafeteria diet from the bedding as possible.\nPlace fresh cafeteria diet into the cage.\nClose the cage and return to the rack.\nReplace the water and sucrose bottles.\nNOTE: To avoid exposing chow rats to CAF diet, consider feeding chow cages before CAF cages, or vice versa. Gloves should be changed between handling rats from different diet groups.\nTop up chow, water and sucrose bottles as necessary. Doing this after other procedures is more efficient as boxes are heavier after topping up food and water.\nNOTE: CAF boxes soil more rapidly and need to be changed more often to avoid stress induced by exposure to wet bedding as well as strong smells. Inspect bedding daily and change as appropriate.\n4. Food Intake Over 24 H\nNOTE: Food intake measurements are conducted over a discrete 24 h period several times per week.",
    "When commencing the CAF diet, measure body weight and 24 h food intake at least twice per week to monitor the effectiveness of the diet. Begin food intake measurements close to the onset of the dark phase. Aim to present the same set of CAF foods on food intake measurement days, as equating for flavor and energy densities will permit accurate monitoring of changes over time.\nNOTE: This may not be possible for studies requiring >2 measurements of food intake per week, as excessive exposures to the same foods may reduce hyperphagia over time.\nCAF and control diet intake measures\nPrepare CAF diet and place into a labeled container for each cage, weighing and recording each component. Figure 1 shows a completed set of CAF foods. Table 3 consists of an example food intake monitoring sheet.\nRefill water, sucrose and chow levels as required.\nFor chow (control) cages\nTurn water bottles around (spouts up), place the cage on the workspace and remove the lid.\nWeigh the rats and then transfer them to a cage with fresh bedding, together with environmental enrichment.\nRecord weight of water bottles and chow.\nReplace the cage lid, return the cage to rack, and then turn the water bottles around. Small signs stating ‘FOOD INTAKE’ can be added to the cage to notify attendants and researchers not to touch bottles and chow.\nFor the CAF cages:\nPerform the same steps as in step 4.3. Additionally scatter the pre-weighed container of CAF foods around the cage with fresh bedding before rats are transferred.\nLeave rats for a 24 h period with minimal disturbance. Record any unanticipated disruptions (e.g., arrival of new rats to the colony room, or changes in ambient noise).\nFinish food intake measurement",
    "Record weight of water bottles and chow for the chow cages, carefully searching the bedding for pieces of chow. Remove the 'food intake' sign from cages once complete.\nPrepare fresh CAF diet for CAF cages.\nFor each CAF cage\n\t\t\nRecord weight of water, chow and sucrose.\nRemove cage lid and environmental enrichment.\nCarefully remove CAF fragments from bedding and place into separate containers. Remove the largest pieces first and then systematically sift all cage bedding from one end to the other using gentle sweeping motions.\nNOTE: Apply the same degree of care to each cage when collecting food. Record where a cage has been particularly messy—in some instances rats will grind down cake and/or biscuit into a fine powder that is difficult to collect. This can artificially inflate food intake measures.\nDistribute the new CAF diet around the cage, return environmental enrichment, close the cage lid and return it to the rack, removing ‘food intake’ sign.\nRecord weight of each CAF food to nearest 0.1 g. Subtract food remaining from the initial food weight to obtain total food consumed per cage, and then divide by the number of rats in each box (thus assuming equal intake).\nMultiply amount consumed (g/rat) by the energy density (kJ/g) of each food provided by the manufacturer.\nNOTE: To calculate macronutrient intake we use assume energy densities of 16.7 kJ/g for carbohydrates and protein, and 37 kJ/g for fat.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}