{
  "id": 2797,
  "origin_website": "Cell",
  "title": "Liquid chromatography-mass spectrometry-based protocol to measure drug accumulation in Mycobacterium tuberculosis and its host cell",
  "procedures": [
    "Step-by-sep method details\nStep-by-sep method details\nTreatment of bacterial cultures for intrabacterial drug accumulation measurement\nTiming: 1–2 h, with a 6 d growth step prior to drug addition and a subsequent 24 h incubation step\nMtb is grown under the desired conditions, before treatment with the drugs/compounds being studied for downstream sample extraction and analysis. Medium conditions of interest may include environmental signals experienced by Mtb during infection, such as high chloride.1[href=https://www.wicell.org#bib1],11[href=https://www.wicell.org#bib11]\nNote: Samples should be run in triplicate, so each time-point and condition requires three flasks to be set up.\nNote: The extraction solvent system should be pre-chilled at −20°C.\nStart Mtb cultures at OD600 = 0.05 in each medium condition to be tested (10 mL in standing T25 flask).\nSeed the cultures using log-phase Mtb cultures (OD600 ∼ 0.6).\nIncubate in a 37°C, 5% CO2 incubator for 6 d, until the cultures are at mid-log phase (OD600 ∼ 0.6).\nWhen the cultures are ready 6 d later, for t = 0 (no drug treatment) samples, pellet 10 mL log phase Mtb cultures by centrifugation at 3,200 × g for 10 min.\nNote: The t = 0 samples serve as a control to demonstrate that the untreated samples do not exhibit peak/s in the LC-MS spectra with the same retention time and mass spectrum profile as the parent drug under study.\nRemove the supernatant and resuspend the Mtb pellet in 1 mL of pre-chilled extraction solvent system.\nNote: Be sure to remove all the medium in the flask at this step prior to extraction solvent system addition. Use of a P1000 pipette to remove the last remaining medium is recommended.\nTransfer each sample to 2 mL screw cap tubes containing 500 μL of 0.1 mm zirconia/silica beads.\nStore at −80°C at least 18 h before proceeding to drug extraction.",
    "To each flask of 10 mL log-phase Mtb culture to be treated, add drug (typically 1000× in DMSO) to afford the desired final concentration. Incubate in a 37°C, 5% CO2 incubator for 24 h.\n24 h post drug addition, pellet the Mtb cultures by centrifugation at 3,200 × g for 10 min (t = 24 h samples).\nRemove the supernatant, resuspend the Mtb pellet in 1 mL of ice-cold PBS, and transfer to a 2 mL screw cap tube.\nPellet the Mtb culture by centrifugation at 9,400 × g for 5 min at 4°C.\nRemove the supernatant, and repeat steps 8 and 9 (i.e., for a total of 2 washes).\nRemove the supernatant and resuspend the Mtb pellet in 1 mL of pre-chilled extraction solvent system.\nNote: One can start with a drug concentration above its MIC (e.g., 5× MIC) to ensure quantifiable accumulation is observable, while checking for a lack of detectable cidality within the time frame of the experiment by standard plating methods. Subsequently, the drug concentration can be optimized to capture differential accumulation levels of the drug upon consideration of the different experimental conditions relevant to the study.\nNote: Due to the slow-growing nature of Mtb, we chose in this experiment, as well as those with the uninfected and infected J774 cells, to use a drug incubation period of 24 h. This time period can be modified to suit other experimental scenarios.\nNote: Be sure to remove all the medium in the tube at this step prior to extraction solvent system addition. Use of a P1000 pipette to remove the last remaining medium is recommended.\nTransfer the sample to a 2 mL screw cap tube containing 500 μL of 0.1 mm zirconia/silica beads.\nStore at −80°C at least 18 h before proceeding to drug extraction.",
    "Pause point: The samples can be stored at −80°C for up to a month, unless previous experiments evidence instability of the drug in solution at −80°C.\nInfection of J774 cell cultures for combined intrabacterial/intracellular drug accumulation measurement\nTiming: 7 d total (schematic of process shown in Figure 1[href=https://www.wicell.org#fig1])\nJ774 macrophage-like cells are seeded and infected with Mtb, before treatment with the drug/compound being studied for sample extraction and downstream analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2305-Fig1.jpg\nFigure 1. Schematic of infection of J774 cell cultures for combined intrabacterial/intracellular drug accumulation analysis\nCreated with BioRender.com[href=http://BioRender.com].\nNote: Samples should be run in triplicate. Thus, each condition requires three T75 flasks to be set up.\nSeed 2 × 107 J774 cells per T75 flask in 12 mL of J774 infection medium. Incubate ∼16–18 h.\nThe next morning, bring the T75 flasks with the J774 cells to the BSL-3.\nDetermine OD600 of the Mtb cultures to be used for the infection.\nNote: Mtb cultures should be in log-phase (OD600 ∼ 0.6).\nPellet appropriate amount of Mtb culture by centrifugation at 3,200 × g for 10 min.\nResuspend pellet in 1 mL basal uptake buffer.\nPass through a 25G × 5/8″ tuberculin syringe 6–8×.\nNote: For determining the amount of Mtb culture that should be pelleted, note that for each T75 flask to be infected, 4 mL of Mtb suspension at OD600 = 0.2 will be needed.\nAdd pre-warmed J774 infection medium to the Mtb suspension.\nDetermine the OD600 of the suspension.\nAdjust with more pre-warmed J774 infection medium as needed to obtain a suspension at OD600 = 0.2.\nRemove all medium from T75 flasks seeded with J774 cells. Add back 14 mL pre-warmed J774 infection medium.",
    "Add 4 mL of Mtb suspension at OD600 = 0.2 to each T75 flask to be infected. Carefully rock the flask to ensure the bacterial suspension is well mixed into the medium.\nIncubate in a 37°C, 5% CO2 incubator for 2 h.\nAfter 2 h, remove all medium from flasks, add back 12 mL of pre-warmed J774 infection medium to each flask. Return flasks to the 37°C, 5% CO2 incubator.\nFor the next 4 d, replace medium daily with 12 mL fresh pre-warmed J774 infection medium.\nOn day 5 post-infection, remove all medium from flasks, and add 12 mL of fresh pre-warmed medium containing desired amount of drug to be tested as appropriate. Incubate in a 37°C, 5% CO2 incubator for 24 h.\n24 h post drug addition, remove all medium from flask and add back 10 mL fresh pre-warmed J774 infection medium (with no drug).\nRemove medium and repeat the addition of 10 mL fresh pre-warmed J774 infection medium (with no drug) (i.e., 2 washes).\nRemove all medium and add back 5 mL PBS.\nNote: Be sure to remove all the medium in the flask at this step prior to PBS addition. Use of a P1000 pipette to remove the last remaining medium is recommended.\nScrape cells off with a cell scraper, and transfer to a 15 mL conical tube for each T75 flask.\nPellet the cells by centrifugation at 3,200 × g for 10 min at 4°C.\nNote: The centrifuge should be pre-chilled to 4°C.\nRemove the supernatant and resuspend the cell pellet in 1 mL of pre-chilled extraction solvent system.\nNote: The extraction solvent system should be pre-chilled at −20°C.\nTransfer the sample to a 2 mL screw cap tube containing 500 μL of 0.1 mm zirconia/silica beads.",
    "Store at −80°C at least 18 h before proceeding to drug extraction.\nPause point: The samples can be stored at −80°C for up to a month, unless previous experiments evidence instability of the drug in solution at −80°C.\nExtraction of drug from Mtb-containing samples\nTiming: 1.5–2 h\nSamples are processed for extraction of drug.\nRemove samples (from steps 13 and/or 32) from the −80°C freezer and thaw on ice.\nLyse bacterial or mixed bacterial/mammalian cell samples by bead beating (6 × 45 s, at 6.5 m/s), placing samples on ice in between each bead beating cycle.\nAfter all bead beating cycles are complete, centrifuge samples at 16,600 × g for 10 min at 4°C.\nNote: The microcentrifuge should be pre-chilled to 4°C.\nFor each sample, transfer 800 μL of supernatant to a 0.22 μm Spin-X centrifuge tube filter.\nCentrifuge samples at 16,000 × g, 10 min, 4°C, or until all the sample is completely filtered.\nSurface decontaminate sample tubes, using a method approved by the relevant institution’s biosafety office and institutional biosafety committee (e.g., by wiping with 1:128 vesphene), and remove from the BSL-3. Store samples at −80°C until LC-MS analysis.\nPause point: The samples can be stored at −80°C for up to a month, unless previous experiments evidence instability of the drug in solution at −80°C.\nTreatment of J774 cell cultures for intracellular drug accumulation measurement\nTiming: 2–3 h, with a 24 h incubation step\nJ774 macrophage-like cells are seeded before treatment with the drugs/compounds being studied, for downstream sample extraction and analysis.\nNote: Samples should be run in triplicate. Thus, each condition requires three wells to be set up.",
    "Seed 1 × 106 J774 cells in 3 mL of J774 infection medium per well of a 6-well tissue culture plate. Incubate in a 37°C, 5% CO2 incubator for 1 h.\nAfter the 1 h incubation, add drug (typically 1000× in DMSO) directly to each well at desired final concentration. Incubate in a 37°C, 5% CO2 incubator for 24 h.\n24 h post drug addition, remove medium from the wells and add back 1 mL pre-chilled PBS.\nRemove PBS and add 1 mL pre-chilled PBS back to wells and repeat once more (i.e., 3 washes total).\nNote: Be sure to remove all the medium in the wells at this step prior to PBS addition.\nNote: PBS should be pre-chilled at 4°C.\nCritical: Pre-chilled PBS should be added to each well gently by pipetting gently down the side of each well to prevent perturbation of adhered cells prior to scraping.\nRemove PBS, add 1 mL pre-chilled PBS, and incubate for 5 min at 4°C.\nScrape cells off with a cell scraper, and transfer sample to a 2 mL screw cap microcentrifuge tube for each well.\nPellet the cells by centrifugation at 400 × g for 5 min at 4°C.\nNote: The microcentrifuge should be pre-chilled to 4°C.\nRemove the supernatant and resuspend the cell pellet in 1 mL of pre-chilled extraction solvent system.\nNote: The extraction solvent system should be pre-chilled at −20°C.\nPause point: If not proceeding directly to drug extraction, the samples can be stored at −80°C for up to a month, unless previous experiments evidence instability of the drug in solution at −80°C.\nExtraction of drug from mammalian cell culture only samples\nTiming: ∼1 h\nMammalian cell culture only samples are processed for extraction of drug.",
    "Freeze the samples from step 46 by placing on an ethanol/dry ice bath for 5 min.\nNote: If samples have been frozen previously, proceed directly to step 48.\nMove the tubes to 20°C–25°C water bath and incubate for 30 s.\nVortex the samples for 10 s at maximum speed.\nRepeat steps 47–49 another four times (i.e., five total freeze/thaw cycles).\nAfter all freeze/thaw cycles are complete, centrifuge samples at 16,000 × g for 10 min at 4°C.\nNote: The microcentrifuge should be pre-chilled to 4°C.\nFor each sample, transfer 800 μL of supernatant to a 0.22 μm Spin-X centrifuge tube filter.\nCentrifuge samples at 16,000 × g, 10 min, 4°C, or until all the sample is completely filtered.\nStore samples at −80°C until LC-MS analysis.\nPause point: The samples can be stored at −80°C for up to a month, unless previous experiments evidence instability of the drug in solution at −80°C.\nLC-MS analysis of extracted samples\nTiming: 1 d\nSeparation, identification and quantification of intrabacterially/intracellularly accumulated drug by time-of-flight LC-MS.\nPrepare the Agilent 1260 Infinity II liquid chromatography system coupled to an Agilent 6230 time-of-flight mass spectrometer or its equivalent LC-MS system.\nThe elution is performed by using a water/acetonitrile solvent system, with each solvent containing 0.1% v/v formic acid.\nConnect the Chromolith SpeedRod column, or its equivalent, to the LC system.\nSet the gradient program as follows (expressed as the percentage of acetonitrile): 0–6.5 min, 10%–100%; 6.5–8 min, 100%; 8–11 min, 10%.\nSet the flow rate to 0.5 mL/min.\nIdentify the mass ratio (m/z) value for drug and use the value to extract ion peak of drug.\nFor the quantification of the drug, first run authentic standard mixtures containing the drug and verapamil, the internal standard, and confirm that they produce a robust peak on the LC-MS system.",
    "Prepare the calibration curve on the same day to quantify the drug.\nInject 20 μL of the diluted authentic standards with the internal standard (e.g., verapamil) at the following drug concentrations: 0.0125, 0.025, 0.05, 0.1, 0.25, 0.5, 1, 2.5, 5, and 10 μM.\nThe verapamil concentration is fixed at 500 ng/mL as 1 μL of verapamil (125 μg/mL DMSO stock solution) was added to 250 μL drug authentic standard solution.\nExtract the peak areas of the drug and verapamil in the extraction ion chromatograms of the diluted standards.\nCalculate the drug to the internal standard (D/I) peak area ratio.\nPlot the ratio versus drug concentration calibration curve as y = mx, where this represents a linear regression of Drug/Internal standard (D/I, see quantification[href=https://www.wicell.org#sec5.2] section below) peak area ratio as a function of drug concentration forced to a y-intercept of 0.\nNote: If a non-linear calibration curve results, consult the literature for the appropriate mathematical fit to the data (e.g., https://www.intechopen.com/chapters/58596[href=https://www.intechopen.com/chapters/58596]), while considering statistical tests for outliers that may result in the observed non-linearity. Or, if the non-linearity is due to the signal intensity saturation at higher concentrations, consider dilution of the higher concentrations by 10-fold.\nInject the extracted samples (20 μL) into the LC-MS. The verapamil concentration is fixed at 500 ng/mL as 1 μL of verapamil (125 μg/mL DMSO stock solution) was added to 250 μL extracted sample.\nCalculate concentration of the drug in each sample using the calibration curve.\nNote: The solvent gradient offered is fairly general for drug-like small molecules. It may be altered as necessary to properly separate the drug from other molecules in the cellular lysate."
  ],
  "subjectAreas": [
    "Mass Spectrometry",
    "Chemistry",
    "Immunology",
    "Microbiology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}