{
  "id": 1679,
  "origin_website": "Cell",
  "title": "Protocol for Differentiation of Human iPSCs into Pulmonary Neuroendocrine Cells",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nPreparation of iPSC for Differentiation\nTiming: 2–4 days\nCoating plates for iPSC culture.\nNote: Before you begin thaw Geltrex™ matrix in a refrigerator for 16–20 h at 2 to 8°C and carefully pipet up and down to avoid introducing air bubbles. It is best to aliquot and work with small volumes of Geltrex™ matrix solution to avoid multiple freeze/thaw cycles.\nDilute Geltrex™ matrix at 1:100 in pre-chilled (4°C) DMEM/F-12 (for example: 1 mL Geltrex™ matrix in 99 mL DMEM/F-12).\nNote: Add sufficient diluted Geltrex™ matrix solution to cover the entire growth surface area. For example, add 2 mL per one well of a 6-well plate.\nIncubate the coated plates at 37°C for a minimum of 60 min.\nNote: The coated dish is stable for two weeks when wrapped with parafilm and stored at 4°C.\nCritical: Do not allow the coated surface to dry out. Add enough media (1.5–2 mL volume for 1 well of a 6 well-plate) to avoid drying. Keep Geltrex on ice throughout all aliquotting and plating steps to prevent premature gelling\nAt the time of use, we recommend keeping the plates at room temperature (20–25 °C) for 1 h before aspirating. Carefully aspirate off the supernatant above the Geltrex™ matrix coating, then immediately plate cells in the pre-equilibrated cell culture medium.\nExpansion of iPSCs.\niPSCs are maintained in mTeSR1 medium in 6-well tissue culture-treated plates on GeltrexTM matrix.\niPSCs are split routinely at 1:3 or 1:4 when cells have formed tight colonies and are no more than 70% confluent (generally every 4–5 days).",
    "To split iPSCs, aspirate media, and add 1 mL ReLeSRTM for 30 s. Remove ReLeSRTM and incubate at 37oC for 5 min. Add 2 mL mTESR1 media and tap the dish gently to release the iPSC colonies as cell aggregates.\nNote: Incubation time for ReLeSRTM depends on the individual iPSC line and should be optimized to ensure selective detachment of undifferentiated iPSC colonies only.\nReplate the aggregates in 2 mL fresh mTESR1 per well in a new GeltrexTM-coated well of a 6- well plate.\nNote: 1 well of iPSC colonies was split at a 1:3 or 1:4 ratio for routine maintenance.\nTiming: 2 h\nPreparation of Transwells for Differentiation\nDay 1. The day prior to preparing cells for differentiation, prepare extracellular matrix (ECM) to coat the Transwells in PBS on ice. This is comprised of fibronectin (5 μg/mL), laminin (5 μg/mL), and collagen IV (60 μg/mL).\nAdd 150 μL of ECM solution to the apical side of each Transwell filter.\nIncubate the ECM-coated Transwell filters at room temperature (20–25 °C) for 16–20 h inside the cell culture hood.\nAfter a minimum of 16 h, aspirate the ECM solution and gently wash twice with 1× PBS followed by a single wash with autoclaved Milli-Q water.\nTranswells can be stored at this point at room temperature (20–25 °C) or 4°C, sealed with parafilm, for up to a week.\nCritical: The quality of coating is a major factor for successful cell adherence to the membrane. Sub-optimal coating can lead to cells peeling off at early stages of differentiation.\nTiming: 2 h\nPlate cells for differentiation\nDay 0. Remove mTeSR from the iPSC colonies.\nWash the cells gently with PBS. Aspirate the PBS.\nAdd 500 μL of room temperature (20–25 °C) Accutase.\nIncubate at 37°C for 2–3 min (max).",
    "Collect cells by gently dissociating with a 5 mL pipette into a 15 mL Falcon tube and centrifuge at 180 × g (1,000 rpm) for 5 min.\nResuspend in mTeSR1 containing 10 μM ROCK inhibitor and count the cells (1 μL per 4 mL mTESR1)\nPrepare Transwells by adding mTeSR1 containing ROCK inhibitor to the desired number of wells. For 24 well inserts use 350 μL in the bottom chamber and 150 μL in the Transwell.\nCount cells and add 150K live cells to each 6.5 mm Transwell.\nIncubate at 37°C for 20–24 h.\nDifferentiation to Definitive Endoderm (DE)\nTiming: 5 days\nCritical: Cells must be a minimum of 80% confluent before adding Medium B. If the cells are plated sparsely or are too confluent at the beginning of day 1 media change then differentiation efficiency is severely affected. Figure 1[href=https://www.wicell.org#fig1] provides an example of the ideal plating density required to move forward (Figure 1[href=https://www.wicell.org#fig1]). See Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/114-Fig1.jpg\nFigure 1. Effect of Plating Density on Differentiation Efficiency\n(A–C) Efficiency of definitive endoderm (DE) derivation at day 5 varies based on iPSC confluency before starting the differentiation. Representative immunofluorescence (IF) images of cells show expression of FOXA2 (green) and SOX17 (red). Nuclei are counterstained with DAPI (blue). Differentiation started with too few cells (<70% confluency) or too many cells results in poor (A) or low (B) DE differentiation. Differentiation started with optimal plating density of 70%–80% confluency at the time of starting the experiment results in best DE differentiation (C). Scale bars, 200 μm.\nDay 1. Prepare Medium B by adding Wnt-3a (25ng/mL) and Activin A (100 ng/mL) to pre-warmed RPMI medium.\nRemove and replace the mTeSR1 medium from the basal side of the Transwells with 350 μL of Medium B.",
    "Critical: Avoid disrupting the cells on the insert by using a 200 μL pipette to aspirate the media very gently.\nCarefully aspirate mTesR1 medium from the apical side of the Transwells and add 150 μL of Medium B into each 6.5 mm Transwell.\nCritical: It is essential to add and remove media gently and not to touch/disturb the cells.\nCritical: Add media to the edge of the Transwell.\nIncubate at 37°C for 24h.\nDay 2. Prepare Medium C by adding FBS (1%) and Activin A (100 ng/mL) to pre-warmed RPMI medium.\nRemove and replace the Medium B from the basal side of the Transwells with 350 μL of Medium C.\nCarefully aspirate Medium B from the apical side of the Transwells and add 150 μL of Medium C into each 6.5 mm Transwells.\nIncubate at 37°C for 48h.\nCritical: Significant cell death can be observed during days 1–3. To move to day 4 cells should be near 100% confluent. Observe closely on a microscope and only proceed if cells are >80% confluent. See Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nDay 4. Prepare Medium D by adding FBS (2%), SB431524 (500 nM) and Noggin (20 ng/mL) to prewarmed cSFDM medium.\nRemove and replace the Medium C from the basal side of the Transwells with 350 μL of Medium D.\nCarefully aspirate Medium C from the apical side of the Transwells and add 150 μL of Medium D into each 6.5 mm Transwells.\nIncubate at 37°C for 24h.\nDay 5. Quality Control Analysis DE differentiation. Take 1 well of cell culture to assay for definitive endoderm (DE) markers like FOXA2 and SOX17 with immunofluorescence.\nImmunofluorescence Validation of DE\nTiming: 2–3 days\nFix Transwells in 4% (vol/vol) paraformaldehyde (PFA) for 1 h at 4°C.\nWash 3× with PBS.",
    "Permeabilize in 0.5% Triton X-100 for 1 h at 4oC.\nBlock for 1 h with commercial CAS block.\nIncubate in primary antibody (See Table 1[href=https://www.wicell.org#tbl1]) diluted in CAS block at the required dilution (provided in Key Resources Table[href=https://www.wicell.org#key-resources-table]) at 4°C for 16–20 h.\nWash 3× in 0.1% Triton X-100 in PBS.\nIncubate for 1 h in secondary antibodies diluted in CAS block at 1:500 dilution.\nWash 3× in 0.1% Triton X-100 in PBS.\nAdd DAPI (1 μg/mL) and incubate for 5 min.\nWash 3× with PBS.\nMount on glass microscope slides in Immunomount.\nAlternatives: Transwells can be washed after secondary antibody incubation and directly mounted on the glass microscope slide using Vectashield with DAPI.\nNote: By day 5 of differentiation >85% of the cells must express FOXA2+ and SOX17+ endoderm (Figure 1[href=https://www.wicell.org#fig1]C).\nCritical: Cultures with poor DE conversion showing <50% FOXA2+ and SOX17+ cells will have higher heterogeneity as the differentiation proceeds, affecting the ratio of different airway cell types present in the cultures at later stages. Discontinue these cultures as subsequent differentiation will be inadequate.\ntable:files/protocols_protocol_114_29.csv\nDifferentiation to AFE\nTiming: 4 days\nDay 5. Prepare Medium E by adding FBS (2%), SB431524 (500 nM) and BMP-4 (5 ng/mL) to pre-warmed cSFDM medium.\nRemove and replace the Medium D from the basal side of the Transwells with 350 μL of Medium E.\nCarefully aspirate Medium D from the apical side of the Transwells and add 150 μL of Medium E into each 6.5 mm Transwell.\nIncubate at 37°C for 48h.\nDay 7. Repeat steps 30–32 until day 9.\nIncubate at 37°C for 48h.\nDay 9. Quality Control Analysis AFE differentiation. Take 1 well of cell culture and assay for continued presence of FOXA2 and SOX17 with immunofluorescence (See Table 1[href=https://www.wicell.org#tbl1]) (protocol described in step 18).",
    "Note: By day 9 of differentiation >85% of the cultures should express FOXA2+ and SOX17+ endoderm.\nCritical: Cultures with poor AFE conversion showing <50% FOXA2+ and SOX17+ will have higher heterogeneity as the differentiation proceeds affecting the ratio of different airway cell types present in the cultures at later stages. Discontinue these cultures as subsequent differentiation will be inadequate.\nDifferentiation toward NKX2.1+ Lung Progenitors (LP)\nTiming: 8 days\nNote: Medium F can be prepared for up to 5 days, but needs to be stored at 4°C, and only the volume needed for that day should be pre-warmed at a time.\nDay 9. Prepare Medium F by adding FBS (2%), BMP-4 (5 ng/mL), FGF-2 (10 ng/mL), FGF-10 (10 ng/mL) and KGF (10 ng/mL) to cSFDM medium.\nAspirate and replace the Medium E from the basal side of the Transwells with 350 μL of Medium F.\nCarefully aspirate Medium E from the apical side of the Transwells and add 150 μL of Medium F into each 6.5 mm Transwell.\nIncubate at 37°C for 48h.\nDay 11. Remove and Replace Medium F (350 μL in basal chamber, 150 μL in apical chamber).\nIncubate at 37°C for 48h.\nRepeat steps 40–41 until day 17.\nDay 17. Quality Control Analysis of LP differentiation. Take 1 well of cell culture and assay for LP markers (See Table 1[href=https://www.wicell.org#tbl1]) including NKX2.1, SOX2 and SOX9 with immunofluorescence (protocol described in step 18).\nNote: By day 17 cultures should contain a population of NKX2.1+, SOX2+ and SOX9+ lung progenitors. Appearance of tight junction protein ZO1 shows the formation of an epithelium with tight junctions (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/114-Fig2.jpg\nFigure 2. Generation of Lung Progenitors during iPNEC Differentiation from Human iPSCs",
    "(A–D) Cultures stained for (A) lung endoderm marker NKX2.1 (green), (B) distal progenitor marker SOX9 (green), (C) proximal airway progenitor marker SOX2 (green) and (D) tight junction marker ZO1 (green) at day 17 of differentiation. Nuclei are counterstained with DAPI (blue). Scale bars, 200 μm.\nDifferentiation and Maturation of PNEC at Air-Liquid Interface (ALI)\nTiming: 14–75 days\nNote: The end point depends on the experiments to be performed. We have maintained cultures for up to 75 days after transfer to the ALI (day 91).\nNote: Medium G can be prepared in advance and frozen (−80°C) in aliquots for use up to 2–3 months, once thawed needs to be stored at 4°C, and only the volume needed for that day should be pre-warmed at a time.\nDay 17. Prepare Medium G complete with 10 μM DAPT.\nNote: DAPT should be added to Medium G on day of use only.\nAspirate and replace Medium F from the basal side of the cultures and add 350 μL of Medium G.\nAspirate Medium F from the apical side of the cultures.\nCritical: avoid disrupting the epithelium by using mechanical suction to aspirate the media. Use a 200 μL pipette tip to do it manually.\nGently wash the apical side with 100 μL PBS and aspirate.\nIncubate at 37°C for 48h.\nDay 19. Aspirate and replace Medium G from the basal side of the cultures.\nIncubate at 37°C for 48h.\nRepeat steps 49–50 for as long as the cultures need to be maintained.\nQuality Control Analysis of iPNECs\nTiming: 3–5 days\nAnalyzing mRNA expression changes using Quantitative RT-PCR (qRT-PCR)",
    "Take 1 well of cell culture from each of these time points at days 5, 10, 13, 17, 21, 25 and 31 for checking the mRNA expression levels of different PNEC markers (See Table 1[href=https://www.wicell.org#tbl1]) during differentiation by performing a qRT-PCR.\nQuantitative RT-PCR protocol: Isolate total RNA using the Qiagen RNA Easy Mini Kit as per the manufacturer’s protocol.\nAliquot 500 ng of RNA and proceed to DNase-treatment as per the manufacturer’s protocol.\nUse the DNase-treated RNA aliquot to prepare cDNA using a Protoscript first strand synthesis kit.\nSet up 5 μL qRT-PCR reactions with SYBR Green using the following cycling parameters.\ntable:files/protocols_protocol_114_30.csv\nNote: qRT-PCR is conducted and analyzed using 7900HT SDS v2.1 software (Thermo Fisher Scientific). Each run consists of a triplicate of technical repeats per sample/gene. Beta-actin was used as an internal control.\nNote: Data shown in Figures 3D, 5A, S2D-G of Hor et al., (2020)[href=https://www.wicell.org#bib3].\nNote: Day 0 iPSCs express OCT4, NANOG and SOX2 genes. They should be expressed highly at day 0 and by DE stage (day 4–5) should be significantly lower.\nIF Analysis of PNEC Markers\nTiming: 2–3 days\nTake 1 wells of cell culture at days 31, 60 and 91 for immunofluorescence staining (protocol described in step 18). Stain for all the PNEC markers (See Table 1[href=https://www.wicell.org#tbl1]) – SYP, CHGA, ROBO2, PGP9.5 and ENO2. Co-staining with VIM (vimentin, a mesenchymal marker) and EPCAM (epithelial marker) is recommended to characterize iPNECs.\nNote: iPNECs should stain for SYP, CHGA, ROBO2, PGP9.5 and ENO2 and should not co-localize with VIM and EPCAM.\nNote: All mean fluorescent intensity (MFI) percentage quantifications and Sholl analysis measurements of number of intersections and branching density of iPNECs can be performed using ImageJ.\nNote: Data shown in Figures 1A, 1B, 2, 3, S1A-B, S2A-B, S4 of Hor et al. (2020)[href=https://www.wicell.org#bib3].",
    "Analyzing Neuropeptide Secretion\nTiming: 1–2 days\nCollect media from the basal chamber of the Transwells of day 91 cultures to perform enzyme-linked immunosorbent assay (ELISA) in order to measure secreted levels of neuron-specific enolase (ENO2). Follow the manufacturer’s instructions to perform ELISA using Human Enolase 2/Neuron-specific Enolase Quantikine ELISA Kit (R&D systems).\nNote: Data shown in Figures 5B of Hor et al. (2020)[href=https://www.wicell.org#bib3]."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Cell Culture",
    "Neuroscience",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}