{
  "id": 6124,
  "origin_website": "Bio",
  "title": "Preparation of Lipid-Stripped Serum for the Study of Lipid Metabolism in Cell Culture",
  "procedures": [
    "Note: All steps involving open tubes or bottles containing di-isopropyl ether should be conducted in a chemical fume hood. Thaw fetal bovine serum (FBS) at 4 °C. We have carried out this protocol with volumes of serum ranging from 50 to 500 ml. Thaw two aliquots: one for de-lipidation and one to use as a lipid-replete control. Reserve the serum at 4 °C to be used as the lipid-replete control until Step 8. De-lipidation is accomplished in Steps 2-7.Stir thawed FBS at room temperature on a magnetic stir plate in a beaker able to accommodate at least twice the volume of FBS used. Add 0.8 vol di-isopropyl ether and 0.2 vol n-butanol and continue stirring for 30 min at room temperature (e.g., for 100 ml of serum, use 80 ml of di-isopropyl ether, and 20 ml of n-butanol). Separate phases should not be observed at this point (Figures 1A and 1B). If the phases do separate, increase the stirring speed (300-400 rpm is typically sufficient). Solvents should be measured with glass graduated cylinders or glass serological pipettes.Centrifuge at 4,000 x g for 15 min at 4 °C to separate the phases. The mixture can be aliquoted into 50 ml conical tubes during this step (Figure 1C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531210332_1382.jpgFigure 1. Initial lipid extraction from fetal bovine serum (FBS) (Steps 2-3). A. FBS before extraction. B. FBS mixing with di-isopropyl ether and n-butanol. Mixing speed should be sufficient to prevent phase separation. C. Following initial centrifugation, lipids are in the upper phase and interphase, while serum proteins are retained in the aqueous, lower phase.Using a glass pipette, push through the viscous upper phase and interphase, and transfer the lower phase into a fresh beaker. Discard the upper phase.",
    "Care should be taken to minimize the amount of upper phase that is carried over, even if this reduces the yield of the lower phase.Mix the lower phase with a volume of di-isopropyl ether equal to the original volume of serum used. Stir on a magnetic plate for 30 min at room temperature. As before, separate phases should not be visible during mixing.If a small volume of FBS was used, centrifuge as before. Remove the upper phase with a pipette, and collect the lower phase. If a larger volume of FBS was used, transfer the mixture to a separating funnel, and allow the phases to separate (Figures 2A and 2B). If a separating funnel is not available, the mixture can be aliquoted into conical tubes and centrifuged as above. Remove upper phase completely, using either the separating funnel or, if centrifuging, by pipetting and discarding the upper phase (Figure 2C).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180531/20180531210416_0328.jpgFigure 2. Removal of serum proteins using a separating funnel (Step 6) following the second organic extraction. A. FBS mixed with di-isopropyl ether in Step 5 is transferred to a separating funnel. B. Separate phases form after the mixture is allowed to stand. C. The lower phase is removed and transferred to a new beaker for the subsequent steps. The organic, upper phase is retained in the separating funnel and then discarded.Transfer the lower phase to a new beaker. Stir on a magnetic plate at a low speed while allowing a slow stream of nitrogen gas to blow over the surface of the serum. The flow rate should be low, so as to prevent significant evaporation of water from the serum, while allowing volatile organics to evaporate. Mixing for 2 h at room temperature is sufficient to remove most contaminating solvents.",
    "Minor water evaporation (which would concentrate the protein) will be corrected in Step 9. Removal of any remaining solvent contaminants by dialysisPre-wet appropriately sized dialysis cassettes in cold saline, and transfer both the lipid-stripped (from Step 7) and lipid-replete (from Step 1) sera to the cassettes. Dialyze overnight against 4 L of saline (9 g/L sodium chloride) at 4 °C, gently stirring the mixture in one beaker covered with plastic wrap. The next day, transfer cassettes to a new 4 L of saline, and repeat. Dialyze in fresh saline for a third day. It is important to dialyze both the lipid-stripped and lipid-replete sera in the same beaker. If dialyzing more than 400 ml total, use a larger volume of saline.Measure the concentration of protein in both sera (e.g., by Bradford or BCA Assay). It may be necessary to dilute the sera so that the protein concentrations are in the linear range of the assay method used. If the concentrations are unequal (owing to volume loss, particularly in Step 7), dilute the more concentrated serum with saline to ensure that their concentrations are equal. Sterilize the sera by filtering them through a 0.2 µm filter in a biological safety cabinet.Aliquot, and store at -20 °C. Both sera can be used in place of normal FBS for standard cell culture assays."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}