{
  "id": 6422,
  "origin_website": "Bio",
  "title": "A Radioisotope-free Oligosaccharyltransferase Assay Method",
  "procedures": [
    "Oligosaccharyl transfer reactionPreparation of reaction buffer solutionCombine the following reagents in a 1.5 ml polypropylene tube:10 μl of 1 M Tris-HCl, pH 7.520 μl of 100 mM MnCl22 μl of 100 mM DTT168 μl of 0.1% (v/v) Triton X-100 or 0.1% (w/v) DDM (n-dodecyl-β-D-maltoside)The total volume is 200 μlNote: In the original protocol, 0.02% (v/v) Tween 20 was used (Kohda et al., 2007). We now routinely use Triton X-100 or DDM for better LLO solubilization. MgCl2 may be replaced by MnCl2. The solution becomes slightly brown upon the addition of DTT, due to the formation of manganese dioxide, but it poses no problem for the assay. The omission of DTT has an insignificant effect on the assay, but the inclusion of DTT may be expected to clarify the migration image by its denaturing effects on viscous contaminants in the reaction mixture solution. Solubilization of LLOThe volume of the LLO stock in 10:10:3 (v/v/v) chloroform:methanol:water is calculated by 10 μl (corresponding to 0.1-10 pmol of LLO) x \"the number of samples plus 1 extra for the plastic tubes\". The recommended amount of LLO is 10 pmol per 10 μl for quantitative experiments. Usual number of samples is in the range from 10 to 20, in consideration of the number of lanes of one PAGE gel. Transfer the LLO solution to a 1.5 ml polypropylene tube and dry it in a SpeedVac concentrator. Temperature is set between 30 °C and 37 °C.Add the reaction buffer solution to the dried LLO in the tube. The volume of the reaction buffer solution is calculated by 8 μl x \"the number of samples plus 1 extra for the plastic tubes\". Sonicate the solution in a bath-type sonicator in continuous mode for 5 min at room temperature, and vortex vigorously to dissolve the LLO.",
    "Centrifuge at 16,000 x g, 5 min, at 4 °C to remove insoluble materials. Transfer the supernatant to a new tube, and add the detergent-solubilized OST to the supernatant. The volume of the detergent-solubilized OST is calculated by 1 μl (corresponding to 0.01-1 pmol of the enzyme) x \"the number of samples plus 1 extra for the plastic tubes\". Nine μl aliquots of the supernatant are pipetted into 1.5 ml polypropylene tubes, precooled on ice. The use of an electronic pipette is highly recommended for accurate dispensing.Starting and stopping the reactionAdd 3 μl (corresponding to 30 pmol) of 10 μM TAMRA-acceptor peptide solution to each polypropylene tube. This allows time-course analyses and peptide library experiments to be performed. Centrifuge briefly to spin down the content, tap the tube with a finger a few times for mixing, and centrifuge again.Place the tubes on ice. In the case of a large number of tubes, it is convenient to use an aluminum heating/cooling block for 1.5 ml tubes. Transfer the tubes (in the aluminum block) to an incubator. Incubate at the desired temperature (30 °C for the yeast and Campylobacter OSTs, 65 °C for thermostable OSTs from thermophilic archaea). The incubation time should be chosen within a time frame corresponding to the linear part of the progress curve, to measure the initial rate of the reaction (Figure 3). Typical incubation time is 30 min to 2 h. At a high temperature, it is important to heat the tubes uniformly to prevent water evaporation and condensation inside the tube. The reaction in the dark is desirable to avoid fluorescence quenching, but not mandatory.Use a natural convection or forced air flow convection oven, or PCR device.",
    "The reaction is stopped by adding 3 μl of 5x SDS-PAGE sample loading buffer to each tube, and heating it at 95 °C for 1 min. Centrifuge the tubes briefly to spin down the contents. Optionally, EDTA (ethylenediaminetetraacetic acid) is added at a final concentration of 5-10 mM, before the addition of the SDS-PAGE sample loading buffer, to stop the reaction immediately. Note that placing the tubes (in an aluminum block) on ice is sometimes inadequate to stop the reaction completely.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190228/20190228004446_8596.jpgFigure 3. Time-course of glycopeptide production. A. Glycopeptide products were separated from unmodified peptides by SDS-PAGE and quantified by fluorescence imaging. The fluorescent dye is attached to the peptide. The positions of the protein standard and the dye front are indicated. The contrast was adjusted with a sigmoid tone curve. This gel image is adapted from (Matsumoto et al., 2013). B. The change in the amount of the glycopeptide product with time should produce a straight line for quantitative measurement.ElectrophoresisThe heating in the presence of SDS is not necessary for PAGE separation of (glyco)peptides, but may be useful to clarify the migration image by its denaturing effects on miscellaneous proteins in the reaction mixture solution.   Load the whole volume (15 μl) of the samples on the SDS-PAGE gels. If the sample volume decreases for any reason, a small volume of water or buffer may be added, but keep in mind that the entire sample must be loaded in one of the gel wells. Perform electrophoresis at about 23 mA per gel in the constant current mode for about 75 min. The optimal constant current is lower than the standard current for the separation of polypeptides, 30-40 mA. The appropriate setting of the electric current is essential for good separation of glycopeptide products from unreacted peptides.",
    "As a guideline, the time of electrophoresis is set for the bromphenol blue (BPB) front line to reach about 1 cm above the bottom of the gel. The run out of gel should be avoided because unreacted peptides will migrate close to the dye front line. The concurrent running of prestained molecular weight markers on the gel is not recommended, because some of the staining dyes are fluorescent.  Use handcasted polyacrylamide gels with a 4% acrylamide(AA)/bisacrylamide(bis) stacking gel and a 20% AA/bis resolving gel, or precast polyacrylamide gels with a 4% AA/bis stacking gel and a 15%-25% gradient AA/bis resolving gel. The high AA/bis percentage is important for the separation between glycopeptides and peptides. In general, precast gels are preferable to handcasted gels, because of the more homogeneous quality of the gel. Gels sandwiched between glass plates should be used, because plastic plates make the fluorescent imaging difficult due to light absorption.   Laemmli-SDS-PAGE based on the Tris-Glycine buffer system is usually used. Alternatively, Tricine-SDS-PAGE based on the Tris-Tricine buffer system is effective for better separation of glycopeptides. In fact, a peptide with just one monosaccharide residue can be resolved from the unmodified peptide (Gerber et al., 2013). One should take precautions, however, the mobility of glycopeptides could be affected by sugar composition and branching pattern.Detection by in-gel fluorescent imaging(Glyco)peptides are visualized in-gel using a fluorescence imager. It is unnecessary to detach the glass plates from the gel.Immediately after the electrophoresis finishes, clean the glass plates with water and then with ethanol. Blow off the residual ethanol with an air (gas) duster. Do not use paper towels or cloths, because traces of the wiping will remain on the glass plates. Set up the fluorescence imager as described in the manual.",
    "In the case of the LAS-3000 multicolor image analyzer (Fuji Film) with the TAMRA fluorophore, use Precision mode, Standard sensitivity, green LED (Green 520 nm EPI) illuminator, a 575DF20 filter, and Iris 0.85. The typical exposure time is 1 to 60 s. In principle, the exposure time must be optimized for any glycosylated, and non-glycosylated bands should not be overexposed for the accurate quantification of the bands.Possible negative controls include the omission of the detergent-solubilized OST or LLO in the reaction mixture. Instead, peptides containing non-functional sequons, NPT or NPS, can be used. By contrast, the preparation of a positive control is not easy, since the chemical synthesis of glycopeptides are difficult and expensive. Alternatively, after gel extraction from the product bands, mass analysis using MALDI-TOF-MS or ESI-MS is the best way to identify the glycosylation of the substrate peptides."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}