{
  "id": 11686,
  "origin_website": "Jove",
  "title": "Back Mechanical Sensitivity Assessment in the Rat for Mechanistic Investigation of Chronic Back Pain",
  "procedures": [
    "The experimental protocol was approved by the animal care committee of Université du Québec à Trois-Rivières and conformed to the Guidelines of the Canadian Council on Animal Care and the Guidelines of the Committee for Research and Ethical Issues of the International Association for the Study of Pain (IASP). The present study used six male Wistar rats (body weight: 320-450 g; age: 18-22 weeks). The animals were obtained from a commercial source (see Table of Materials). Data from these rats are from the larger sample of a previous study30.\n1. Experimental preparation\nHouse the animals in a temperature-controlled room in standard animal facilities with access to food and water ad libitum and a light-dark cycle of 14 h-10 h. Ensure that all animals are in good health on the day of the experiments.\nGenerate the chronic back pain animal model following the steps below.\n\t\nTo induce chronic back pain, perform an intramuscular injection of Complete Freund Adjuvant (CFA) into the back muscles following the previous reports14,30,31.\nAnesthetize the animal using isoflurane (4% for induction and 2%-2.5% for maintenance).\nUsing a 27 G needle, inject 150 µL of a ready-to-use water-in-oil emulsion of CFA (see Table of Materials) into the paraspinal muscles unilaterally or bilaterally, depending on the protocol needs.\nKeep the injection needle in place for at least 3 min after completing the injection. For animals in the control group, use the same procedures30, but inject a solution of sterile physiological saline solution (150 µL, 0.9%) instead of CFA.\nFabricate the test cage.\n\t\nMake a test cage for two animals that comprises one chamber for each animal.\n\t\tNOTE: For the present study, each chamber has the following dimensions: length x width x height: 50 x 20 x 7 cm (see Table of Materials).",
    "Mount the two contiguous chambers on four 33 cm long Plexiglass legs. Use transparent Plexiglass for the walls of the chambers, but use black Plexiglass to separate chambers to prevent animals from seeing each other.\nUse stainless-steel mesh made of 1 mm wire with an 8 mm inter-wire distance to make the floor and ceiling of the test cage (Figure 1).\n2. Back Mechanical Sensitivity (BMS) test\nFamiliarize the animal with the test cage 30 min/day for 5-7 consecutive days prior to the first test. Repeat the test as needed.\nAnesthetize the animals using 2% isoflurane31 (see Table of Materials).\nIn a prone position under isoflurane anesthesia, shave the back hair of the area of interest (from T6 to L6 vertebral levels) using an animal hair trimmer (see Table of Materials). For repeated measures, shave the back hair every 3 days on a day without behavioral assessment to ensure that stimuli are always applied directly to the skin. Draw a black mark on the skin with a permanent marker to ensure that filaments are always applied to the same area when repeating the test on different days.\nOn the testing day, put the animals in the test cage for 15-30 min prior to the test until the animal is calm.\nDuring the test, apply Von Frey filaments (0.07, 0.16, 0.4, 0.6, 1, 2, 4, 6, 10, 15, and 26 g) perpendicularly to the back, always beginning with the 2 g filament and using the up-down method15 (see Table of Materials). Approach the back of the animal slowly with the filament from behind the animal.",
    "Apply the filament only when the animal is awake, standing on its four paws, and not moving. Apply the filament for 2 s bilaterally to the area of interest, 10 mm from the spinous process (Figure 2), every 15-30 s.\n\t\tNOTE: A response is considered positive if the animal exhibits one or more of the following behaviors during or immediately after the filament is applied: (1) muscle twitching, (2) arching (back extension), (3) rotation of the neck to look at the back, (4) scratching or licking the back, and (5) escaping.\nAs described previously15, if no response is observed with the application of a filament, apply the next filament with a higher force in the series. If a response is observed, use the next filament with a lower force in the series. Continue this procedure until four readings are obtained after the first behavioral change (response after a series of \"no response\" or no response after a series of \"response\").\nOnce data collection is completed, calculate the value representing 50% of the mechanical threshold, as described by Chaplan et al.15, using this formula:\n\t50% threshold (g) = 10(Xf+kδ)/10 000\n\t​NOTE: In this formula, \"Xf\" is the Handle Mark of the last von Frey filament that was used. \"k\" is the tabular value based on the animal's response pattern15, and \"δ\" is the mean of Handle Mark's increments between Von Frey filaments. Depending on the experimental design and experimental needs, only one side of the spine may be assessed to report one threshold, or two sides may be evaluated, and thresholds are reported separately or as a mean. Refer to Supplementary Table 1 for the calculation template32.\n3. Animal recovery\nAfter the intramuscular injection is completed, discontinue anesthesia and place the animal alone in a standard housing cage for recovery.",
    "During the recovery period, examine the animal's behavior and do not leave it unattended.\nConfirm that the animal recovers from anesthesia and moves normally within 5 min. Then, return the animal to its usual housing cage with the other animals.\n\tNOTE: At the end of the experiment, the animal is perfused through the heart with a 10% formalin solution, under deep isoflurane anesthesia (5%). The back muscles in the injected area are then extracted for histology and confirmation of inflammatory changes.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}