{
  "id": 19173,
  "origin_website": "Jove",
  "title": "Teratoma Generation in the Testis Capsule",
  "procedures": [
    "Note: All animal procedures must be approved by IACUC or equivalent.\nAll surgical equipment must be sterilized prior to surgery. Sterile gloves, drapes and gauze must be used.\n1. Preparation prior to surgery\nObtain 6 week old Mus Musculus CbySmn.CB17-Prkdc SCID/J male mice or other immunocompromised strain of mouse.\nSterilize all surgical instruments, gloves, and gauze.\nDissociate hPSCs to be injected with accutase.\nCount cells and resuspend 1,000,000 cells per 20-30 μL in matrigel diluted 1:1 in DMEM/F-12. Keep cells on ice until finished.\nNote that often it is useful to do a run through of the experiment where Trypan Blue is injected. This will help to identify any potential problems before any cells are wasted.\nIn the vivarium, anesthetize your mouse according to accepted procedures at your institution. In our experiments, we used an anesthesia machine with isoflurane.  Mice were initially put in an induction chamber with 1L/min oxygen and 3-4% isoflurane.  Once anesthetized, a nose cone with 1L/min oxygen and 2-3% isoflurane was used. \nShave the abdomen with clippers, and clean the anterior wall of the mouse abdomen, starting from the center of the abdomen and working clockwise outward. First use Povidone-Iodine solution then wash with 70% ethanol. Repeat 3 times, changing swabs each time. Transfer the animal to a heating pad to keep the animal warm inside a tissue culture or dissecting hood.\nMake a 1 cm longitudinal incision through the skin and peritoneum with sterile surgical scissors just below the level of the hip joint.\nWhile holding the peritoneum with forceps, reach down toward the right hip with another sterile forcept and pull out the white fatty tissue along with attached testes.\nPlace the testes on sterile gauze.",
    "Fill a tuberculin or Hamilton (1cc) syringe with the hPSCs to be injected. Note that it is a good idea to include a control hPSC line that you know is pluripotent such as WA09 (also known as H9). This way you have a positive control which you can use to determine whether your injection or surgery was flawed.\nSlowly inject the hPSCs (20-30 μL) into the center of the testis capsule away from any major blood vessels, stopping if the testicular capsule begins to swell.\nRemove the needle slowly to avoid reflux of the cells.\nUsing forceps, transfer the testes and fatty tissue back to its original position in the abdomen.\nClose up the peritoneum with 2 or 3 reabsorbable sutures and close the skin with autoclips.\nThe mouse should be kept warm until it recovers and given some form of analgesic (see what is accepted in your vivarium) after surgery twice a day for 1-2 days.\n\tNote that neither the anesthetic nor the analgesic with interfere with tumor development.\nMonitor the animal for tumor growth for 6-12 weeks.  Very rarely, tumors may grow to 5 mm in size prior to 6 weeks after injection, thus it is important to monitor the animals.  If this happens, animals should be euthanized and the tumors processed and analyzed as usual. \nOnce the tumor is palpable and reaches approximately 5mm in size, anesthetize the mouse and sacrifice it according to accepted animal protocol procedures.\nRemove tumor and document accordingly - photograph, measure size, weigh.\nCut tumor into small pieces and fix in 4% paraformaldehyde solution. Store in 4% paraformaldehyde until samples are sent to a pathologist for sectioning, staining and analysis.\n2. Representative Results:",
    "When this protocol is done as described and the injected cell line is pluripotent, a palpable, visually obvious, tumor should form within 12 weeks at the most. For established hPSC lines like WA09, we typically see tumors within 6 weeks. For iPSC lines it is not unusual to see tumors within 8-10 weeks. It is very important to inject mice with a line that is known to be pluripotent, as a positive control, in order to be sure that the procedure was performed correctly. Tumors usually look very heterogeneous and have many attached cysts (Figure 1). Analysis of the tumor samples by a pathologist should show differentiated tissues from all three germ layers (Figure 2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3177/3177fig1.jpg\nFigure 1. Typical hPSC derived teratoma in the testis capsule.\nFollowing the described protocol, one million WA09 cells were injected into the testis capsule of an immune compromised mouse. Six weeks later a teratoma was observed. A) Teratoma pulled from the mouse. B) Close up picture of the teratoma. Note the heterogeneity and cyst structures.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3177/3177fig2.jpg\nFigure 2. Hematoxylin and Eosin stained sections from the teratoma show tissues from each germ layer.\nFollowing fixation, the teratoma was sectioned and stained with Hematoxylin and Eosin. Analysis by a pathologist revealed the presence of cells from each of the 3 germ layers."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}