{
  "id": 2349,
  "origin_website": "Cell",
  "title": "HDX-guided EPR spectroscopy to interrogate membrane protein dynamics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nExpression of MscL in BL21(DE3) E. coli cells\nTiming: 3 days\nThis protocol follows the transformation of the TbMscL plasmid into BL21(DE3) and the expression of the protein. The plasmid could be either for the expression of WT or mutant TbMscL.\nTransform the pJ411:140126-TbMscL plasmid into BL21(DE3) cells.\nRemove BL21(DE3) competent cells (50 μL) in an Eppendorf from the freezer and thaw.\nAdd 1 μL of the expression plasmid (∼100 μg/mL) and incubate on ice for 20 min, tapping the tube occasionally to mix.\nHeat shock the E. coli cells by placing the tube in a water bath or hot plate at 42°C for 1 min.\nPlace the tube back on ice for 2 min.\nAdd 350 μL of LB media (without antibiotic) to the bacteria and grow, shaking at 37°C for 1–2 h.\nPlate 100 μL onto a 10 cm LB agar plate containing the relevant antibiotic (ampicillin at 100 μg/mL for the pJ411:140126-TbMscL plasmid).\nIncubate the plates 12–20 h at 37°C.\nPrepare 2 × 10 mL precultures from a single colony, by using sterile pipette tips to inoculate 10 mL supplemented with ampicillin (100 μg/mL) in 50 mL falcon tubes.\nGrow the precultures 12–20 h at 37°C and 180 rpm in a shaker.\nAdd 18 mL of the overnight preculture to 500 mL of LB in a 2 L flask to generate a secondary preculture.\nGrow the secondary preculture at 37°C in a shaking incubator (180 rpm) until the OD600 reaches 0.6–0.8 (approximately 1.5 h).\nTransfer 50 mL of the secondary preculture to each of the eight remaining 2 L flasks containing 500 mL LB.\nGrow the cultures (37°C, 180 rpm) until the OD600 reaches 0.6–0.8, then cool the flasks to 25°C and induced with 1 mM IPTG.",
    "Express the protein for 3.5 h by incubating at 25°C, 180 rpm.\nHarvest the cells by centrifugation at 4,000 × g (Sorval flasks, JLA 8.1 rotor) and store at −80°C.\nPurification and spin labeling of the MscL protein\nTiming: 2–2.5 days\nThis protocol explains the purification of the integral MscL membrane protein and preparation for downstream analysis via EPR spectroscopy and HDX mass spectrometry. The steps (step 30) for the spin-labeling of the membrane (or soluble) protein are key for its analysis in EPR spectroscopy. Specific purification protocols for alternative proteins can be followed with the addition of these spin-labeling steps in order to study the protein using EPR spectroscopy. In this protocol, the MscL protein is solubilized in DDM detergent, but the protein could also be reconstituted in model membrane systems such as nanodiscs for downstream analysis using HDX-MS and EPR spectroscopy. We have previously studied MscL in nanodiscs and liposomes using both ESEEM and PELDOR spectroscopy (Kapsalis et al., 2019[href=https://www.wicell.org#bib21], 2020[href=https://www.wicell.org#bib20]). For HDX-MS in lipid bilayer mimics it may be necessary to include an additional lipid removal step after deuterium labeling and before MS analysis (Martens et al., 2019[href=https://www.wicell.org#bib27]).\nThaw the pellet and resuspend in PBS (20 mL per 500 mL culture) by vortexing.\nTransfer to a Duran bottle, add a magnetic stirrer bar and leave stirring in the cold room for 15–20 min to homogenize the cell suspension.\nUse a cell disruptor to lyse the bacterial cells at 4°C. We use an Avestin Emulisflex C3 continuous flow cell disruptor pulsing at 15,000 psi and pass through twice.\nOnce the cells have been lysed, clean the disruptor by passing through mqH2O, followed by 1% Teepol, followed by mqH2O.",
    "Transfer the lysed cells to 50 mL falcons and centrifuge at 4,700 × g, 4°C for 20 min in a benchtop centrifuge.\nNote: Place enough ultracentrifuge tubes for the volume of cell lysis on ice to cool during the 20 min centrifuge step.\nTransfer the supernatant to pre-weighed Beckman ultracentrifuge tubes. Balance the tubes and ultracentrifuge at 100,000 × g, 4°C for 1 h.\nDiscard the supernatant, weigh the tubes with the pellet, and calculate the mass of the membrane.\nNote: Place a glass homogenizer and spatula (upside down) on ice to chill during the ultracentrifuge step.\nPrepare 25 mL of solubilization buffer per 1 g of membrane (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 50 mM imidazole, 1.5% DDM detergent) and place on ice. This should be made fresh each time. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nDivide half of the solubilization buffer between the ultracentrifuge tubes, later using an equal amount to wash each of the tubes and remove the remaining membrane.\nUse a spatula to slowly scrape the membrane off the side of the tube and decant into the pre-cooled glass homogenizer.\nHomogenize the membranes until there are no visible pieces of membrane.\nTransfer to 50 mL falcon tubes, close the lids tightly, then place on a roller at 4°C for 1 h.\nCentrifuge the solubilized membrane at 4,700 × g, 4°C for 20 min in a benchtop centrifuge.\nAdd the solubilization buffer to a gravity column containing 1 mL (2 mL suspension) of pre-equilibrated Ni2+-NTA resin and allow it to pass through.\nPrepare gel filtration (SEC) buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 0.05% DDM) and degas for at least 1 h. We make ∼250 mL for our Cytiva Superdex 200 10/300 columns. This should be prepared fresh each time.",
    "Once degassed, move to 4°C to equilibrate the temperature.\nIf purifying for HDX-MS, prepare 20 mL of the 2× purification buffer (100 mM Na-phosphate buffer pH 7.5, 600 mM NaCl, 20% glycerol, 0.1% DDM). This should be prepared fresh each time.\nThen use the 2× purification buffer to make the wash buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 0.05% DDM, 50 mM imidazole) and elution buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 0.05% DDM, 300 mM imidazole):\nPrepare 25 mL of wash buffer by taking 12.5 mL of the 2× purification buffer, adding 1.25 mL of the 1 M imidazole, and topping up with 11.25 mL of mqH2O.\nPrepare 6 mL of elution buffer by taking 3 mL of the 2× purification buffer, adding 1.8 mL of the 1 M imidazole stock, and topping up with 1.2 mL of mqH2O.\nWhen purifying for EPR spectroscopy, a 2× purification buffer is not needed as more degassed wash buffer is needed for spin labeling. Prepare 50 mL of wash buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 0.05% DDM, 50 mM imidazole) and degas for at least 1 h.\nUse the degassed wash buffer and the previously prepared 100 mM MTSSL stock to make 4 mL of MTSSL wash buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 0.05% DDM, 50 mM imidazole, 1.5 mM MTSSL).\nUse the degassed wash buffer and the previously prepared 100 mM TCEP stock to make 4 mL of the TCEP wash buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 0.05% DDM, 50 mM imidazole, 3 mM TCEP).",
    "If purifying for EPR spectroscopy and not using 2× purification buffer, prepare 6 mL of elution buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 10% glycerol, 0.05% DDM, 300 mM imidazole).\nOnce the solubilization buffer containing the protein has passed through the column, pass through wash buffer. If preparing protein for HDX-MS pass through 25 mL of wash buffer, then skip step 30 and leave the column in wash buffer until you can continue. If preparing protein for EPR (cwEPR, PELDOR/DEER and ESEEM) spectroscopy, initially pass through 10 mL of the wash buffer then continue with the labeling steps.\nCritical: Ensure the nickel bed is covered with buffer at all times.\nOptional: Equilibrate the SEC column with 1.2 column volumes (CV) of SEC buffer before pausing. If not, it can be equilibrated during the elution steps the following morning.\nThe following labeling steps are only for protein that will be analyzed using EPR (including cwEPR, PELDOR/DEER and ESEEM) spectroscopy experiments:\nAfter the initial wash, pass 4 mL of the TCEP buffer through the column.\nWhen the TCEP wash buffer has almost passed through, add 5 mL of wash buffer to wash away most of the TCEP.\nThen add 4 mL of the MTSSL wash buffer and pass-through half its volume to ensure it replaces the buffer on the nickel bed (∼2 mL) before capping the column.\nRemove the Ni2+-NTA column from 4°C and allow it to sit at 16°C–25°C for 15 min.\nReturn the column to 4°C and leave for 12–20 h, ensuring the nickel bed is completely covered with buffer.\nThe next morning, uncap the column and allow the next ∼2 mL of the MTSSL buffer to replace the buffer on the nickel bed.\nCap the column and move to 16°C–25°C for 15 min.",
    "Then wash with 20 mL of wash buffer to remove any excess MTSSL label.\nNote: Care must be taken to slowly add the different wash buffers by pipetting down the side of the column. This prevents disturbing the nickel bed and mixing of the different wash buffers.\nPause point: The Ni2+-NTA column containing the bound protein can be left in wash buffer for 12–20 h until the following morning.\nStart the equilibration of the SEC column with 1.2 CV of SEC buffer if it was not previously equilibrated.\nFollowing the wash steps, carefully add the elution buffer to the column without disturbing the nickel bed. Elute 8 × 1 mL fraction of purified protein (E1-E8).\nMeasure the UV/Vis spectra for E1-E8 on a nanodrop for an estimate of protein concentration in each of the fractions.\nCombine fractions containing protein and use a Vivaspin-2 concentration with a 100 KDa MWCO to concentrate the protein to a final volume of ∼800 μL at a speed of 3,500 × g at 4°C.\nInject the concentrated sample onto the Superdex 200.\nIncrease 10/300 GL column pre-equilibrated with 1.2 CV SEC buffer and run at 0.5 mL/min. MscL elutes at 12 mL on this column or 65 mL on a 16/60 column.\nPool the MscL protein containing fractions and concentrate the protein ∼50–100 μM monomer concentration for EPR spectroscopy or 16 μM for HDX-MS.\nHDX-MS\nTiming: 3–5 days",
    "HDX is a label-free methodology for the analysis of solvent accessibility and dynamics (Englander and Kallenbach, 1983[href=https://www.wicell.org#bib14]). Detection methods could vary from NMR spectroscopy which provides atomic resolution information in favorable cases (Cavagnero et al., 2000[href=https://www.wicell.org#bib7]; Cawood et al., 2022[href=https://www.wicell.org#bib8]) or mass spectrometry-based approaches that typically offer peptide-level resolution. When a protein is incubated with a deuterated solvent, labile hydrogens are exchanged with deuterium. The rate of this exchange is dependent on conditions such as pH, temperature, hydrogen bonding and on protein conformation. For large protein complexes such as integral membrane proteins, MS-based methods are preferred to NMR (Martens et al., 2019[href=https://www.wicell.org#bib27]; Calvaresi et al., 2021[href=https://www.wicell.org#bib6]; Wang et al., 2022[href=https://www.wicell.org#bib42]; Calabrese et al., 2020[href=https://www.wicell.org#bib5]). In this approach the uptake of deuterium takes place in solution, followed by enzymatic digestion and the increase in mass is measured for each digested peptide. Typically, differential HDX-MS is performed where this extent of deuterium uptake is measured in a minimum of two conditions (e.g., two different protein variants, with/without added ligand). Changes in deuterium uptake between these two conditions can then be determined. This information can then be mapped onto the protein structure to inform on changes in protein dynamics. We used this technique to explore the structural transitions that occur between WT MscL (closed) and an expanded state of MscL stabilized by the mutation L89W (Wang et al., 2022[href=https://www.wicell.org#bib42]; Kapsalis et al., 2019[href=https://www.wicell.org#bib21]). Dynamic regions of the protein highlighted by peptide level HDX-MS can then be probed in molecular detail and at single-residue resolution of deuterium accessibility using ESEEM (but also PELDOR/DEER for distance measurements) spectroscopic methods.",
    "This protocol discusses the process we used to study MscL via HDX-MS but the protocol can be used for comparing different states of other proteins and in the presence or absence of substrates (both soluble and membrane).",
    "Ensure you have purified protein that is not spin-labeled at a concentration of 16–40 μM.\nNote: For MscL, our initial sample (100 μL) was at 16 μM in SEC buffer (50 mM Na-phosphate pH 7.5, 300 mM NaCl, 0.05% DDM). For our HDX-MS experiments of MscL, the protein was solubilized in DDM detergent. While not all solubilizing agents are compatible with HDX-MS, other solubilization methods can be used. Detergents and solubilizing agents other than DDM should be tested, and Triton-X-100 and PEG-based detergents should not be used to avoid PEG contamination of instrumentation.\nUse an automated liquid handling robot fitted with a gas tight syringe that is coupled to the LC-MS system to perform the following dilutions. Place 5 μL of the MscL sample in a total recovery vial and use the syringe to mix with 95 μL of SEC buffer (50 mM Na-phosphate buffer pH 7.5, 300 mM NaCl, 0.05% DDM).\nUse the syringe to take 50 μL of the diluted MscL sample and add to 100 μL of quench buffer (50 mM potassium phosphate, 300 mM NaCl, 0.1% DDM pH 2.2, ice-cold) and mix. Immediately inject 50 μL of the sample onto HDX Manager and start the method.\nNote: Use the LEAP HDX manager software to program the instrument to perform these dilutions.",
    "Note: During the LC-HDXMS method the sample is passed through (115 μL min-1, 20°C) the immobilized pepsin and aspegillopepsin columns connected in series, and the resultant peptides are trapped on a VanGaurd Pre-column Acquity UPLC BEH C18 for 3 min in 0.3% formic acid. The peptides are then passed onto a C18 column (75 μm × 150 mm, Waters Ltd., Wilmslow, Manchester, UK) and separated by gradient elution of 0%–40% MeCN (0.1% v/v formic acid) in H2O (0.3% v/v formic acid) over 7 min at 40 μL.min-1. Gradient elution and trapping is performed at 0°C to decrease back exchange. The eluate from the HDX-LC system is infused into the electrospray ion source of a Synapt G2Si mass spectrometer. HDMSE and dynamic range extension modes are used to separate the peptides before CID fragmentation in the transfer cell. Typical instrument parameters include capillary voltage 3 kV, cone voltage 40 V, acquisition range 50–2000 m/z, scan time 0.6 s, transfer collision energy (lookup table), lockmass scan interval 30 s, source temperature 100 C, desolvation temperature 250 C, cone gas 50 L/h, desolvation gas 600 L/h, Nebuliser gas 6.5 Bar.\nWhile the gradient elution is being performed, wash the pepsin column with wash buffer (3× infections of 50 μL.\nRepeat steps 39–41 at least two more times to generate at least three technical replicates.\nPlace 5 μL of the MscL sample in a total recovery vial and use the syringe to mix with 95 μL of deuterated labeling buffer (50 mM potassium phosphate, 300 mM NaCl pH 7.4, 0.05% DDM) and incubate at 4°C for a defined incubation period (30 s, 1 min, 2 min, 10 min, 1 h).",
    "Use the syringe to take 50 μL of the diluted sample and add to 100 μL of quench buffer (50 mM potassium phosphate, 300 mM NaCl, 0.1% DDM pH 2.2, ice-cold) and mix. Immediately inject 50 μL of the sample onto HDX Manager and start the method. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nNote: Use the LEAP HDX manager software to program the instrument to perform these dilutions.\nRepeat this process for all desired deuterium incubation periods and repeat each incubation period a minimum of 3 times (3 replicates). For MscL, we used 30 s, 1 min, 2 min, 10 min, and 1 h time periods. The duration of the timescales should be chosen to inform on dynamics at different timescales of motions.\nSearch the data using PLGS (v3.0.2) to generate a list of candidate detected peptides. Import a databank containing the protein sequence as well as the sequence(s) of immobilized proteases used.\nCreate workflow parameter file, selecting the appropriate sequence databank, peptide/fragment tolerance set to automatic, min fragment ion matches per peptide set to 3, minimum fragment ion matches per protein set to 7, and min peptide matches per protein set to 1, and ensure the primary reagent is set to pepsin.\nCreate a processing parameter file set to the appropriate lock for charge 2 (here we used GluFib 785.8426 Da/e) and elution start and end times.\nSearch the obtained data files using these workflow and processing parameters.\nCritical: Ensure that ion counting output is selected in PLGS under the automation setup settings. This will generate files that can be used in DynamX.",
    "Use DynamX (v3.0.0) to determine the differential uptake for each peptide. We used the following filtering parameters for assembling the library: minimum intensity 1000, minimum products per MS/MS spectrum 5, minimum products per amino acid 0.3, maximum sequence length 25, maximum ppm error 5, file threshold 3/3.\nManually curate the data. Inspect each mass spectrum for each replicate and ensure the correct isotopic envelope is correctly assigned in full. This will automatically generate a deuterium uptake plot that displays the extent of deuterium uptake vs time.\nExport the cluster data files from DynamX and import the files into Deuteros (Lau et al., 2019[href=https://www.wicell.org#bib23]). Use the software to identify peptides with statistically significant increases/decreases in deuterium uptake. We applied 99% and 95% confidence intervals.\nPrepare wood plots using Deuteros to show either the difference in deuterium uptake at each point, and/or the sum of ΔHDX over all time incubation periods. Filter the peptides to identify those that display a significant uptake difference between the two conditions (WT and L89W).\nUse Deuteros to generate a script to color a protein structure based on the information (significantly different peptides, not significantly different peptides, areas of no sequence coverage).\nImport a structure of the protein of interest into PyMol and use the script to color the structure.\nPlotting the difference data on the protein of interest (in our case MscL) allowed us to visually identify regions of the protein with differences in structural dynamics.\nESEEM spectroscopy\nTiming: 0.5–8 h",
    "Note: The ESEEM experiments have been conducted using the X-band frequency on an X and Q-band Bruker ELEXSYS E580 spectrometer with a 4 mm dielectric resonator (MD4). At this frequency, the ESEEM effect is much more pronounced and therefore it is ideal for solvent accessibility studies. For PELDOR/DEER distance measurements Q-band is preferred, as it presents much higher sensitivity resulting in a higher signal to noise ratio and thus shorter data acquisitions. Therefore, in our previous PELDOR/DEER distance measurement studies on MscL, we used a Q-band EPR spectrometer. In principle, the ESEEM experiment itself is much quicker than PELDOR/DEER. However, in some cases to get a good signal to noise ratio (SNR) more averaging time is needed. Usually, poor SNR is often related either to the low spin labeling efficiency or to the fact that the mutant is less exposed to the solvent. Overall, and in our case, the ESEEM experiment running time ranges from 30 min up to 8 h.",
    "ESEEM spectroscopy is a very powerful and robust pulsed-EPR technique that has been widely used to investigate D2O permeation profiles in membranes and solvent (or D2O) accessibility of proteins (Deligiannakis and Rutherford, 2001[href=https://www.wicell.org#bib12]; Volkov et al., 2009[href=https://www.wicell.org#bib41]; Cieslak et al., 2010[href=https://www.wicell.org#bib9]; Liu et al., 2016[href=https://www.wicell.org#bib25]; Hartley et al., 2021[href=https://www.wicell.org#bib16]; Wang et al., 2022[href=https://www.wicell.org#bib42]; Pliotas, 2017[href=https://www.wicell.org#bib30]). The technique probes weak hyperfine interactions in a paramagnetic system and has been powerful in the study of metal centers and catalytic mechanisms of metalloproteins. In previous work, we have used the technique to probe membrane protein structure and dynamics by measuring the accessibility of spin-labeled residues to solvent and lipids (Hartley et al., 2021[href=https://www.wicell.org#bib16]; Wang et al., 2022[href=https://www.wicell.org#bib42]; Kapsalis et al., 2019[href=https://www.wicell.org#bib21], 2020[href=https://www.wicell.org#bib20]). Following the identification of dynamic regions of MscL using HDX-MS, we used ESEEM spectroscopy to probe these areas further at the single-residue level. This protocol explains the process of checking the labeling efficiency by using cwEPR, and the setting up of ESEEM experiments. The same spin-labeled sample, since it has multiple labels, can be further investigated by other pulsed techniques such as PELDOR (or DEER) spectroscopy with some additional considerations in the setup. PELDOR allows the measurement of distances between spin-labels on a protein, and it provides a robust approach for studying structural changes and dynamics in proteins (Kapsalis et al., 2019[href=https://www.wicell.org#bib21], 2020[href=https://www.wicell.org#bib20]; Pliotas, 2017[href=https://www.wicell.org#bib30]; Ackermann et al., 2017[href=https://www.wicell.org#bib1]; Valera et al., 2016[href=https://www.wicell.org#bib40]; Ward et al., 2014[href=https://www.wicell.org#bib44]; Pliotas et al., 2012[href=https://www.wicell.org#bib34]; Bountra et al., 2017[href=https://www.wicell.org#bib3]; Joseph et al., 2019[href=https://www.wicell.org#bib19]; Georgieva et al., 2013[href=https://www.wicell.org#bib15]; Timachi et al., 2017[href=https://www.wicell.org#bib39]; Wingler et al., 2019[href=https://www.wicell.org#bib45]; Martens et al., 2016[href=https://www.wicell.org#bib28]). Distances of between ∼15 and ∼160 Å can be measured using this technique (Ward et al., 2010[href=https://www.wicell.org#bib43]; Schmidt et al., 2016[href=https://www.wicell.org#bib37]).",
    "However, quality PELDOR distance measurements require a high degree of labeling efficiency, which is not that crucial for obtaining high quality ESEEM data (Wang et al., 2022[href=https://www.wicell.org#bib42]; Hartley et al., 2021[href=https://www.wicell.org#bib16]).",
    "Load ∼40 μL of the spin-labeled protein sample into a bottom sealed glass EPR tube, using a Hamilton syringe connected to a thin plastic capillary tubing. CW-EPR will be used to check for the labeling efficiency of the protein.\nOpen the ESRStudio software first and then switch on the Bruker Magnettech ESR5000 X-band cwEPR spectrometer at the back.\nDrag the warm-up recipe to the recipe section under the main control tab (Table 1[href=https://www.wicell.org#tbl1]).\ntable:files/protocols_protocol_1839_9.csv\nClick Initialize to connect the spectrometer to the computers. When asked for routine warm-up, click ‘Yes’.\nAfter 15 min warm-up, switch on the BioTemperature controller and connected gas nitrogen cylinder and click Initialize again. Click ‘No’ when asked for the routine warm-up.\nDrag the measuring recipe to the recipe section under Main Control and click Start (Table 2[href=https://www.wicell.org#tbl2]). The machine will start cooling down to 4°C, this should take approximately 30 min.\ntable:files/protocols_protocol_1839_10.csv\nOnce the temperature is stable at 4°C, transfer the EPR containing the protein sample into the holder of the spectrometer. The distance between the center of the sample position and the bottom of the holder should be 6.2 cm.\nClick Start to measure the sample. The signal intensity should be 25+ on the Bruker Magnettech ESR5000 X-band cwEPR spectrometer. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nOnce the measurement has finished, take the sample out, add 25 μL deuterated ethylene glycol to the ∼40 μL sample and carefully mix well. Transfer the 65 μL back to the EPR tube.\nSnap freeze the protein sample in liquid nitrogen to prepare the sample for pulsed EPR techniques.\nNote: The pulsed-EPR spectrometer used in this study is a BRUKER E580 ELEXSYS spectrometer and therefore, all the parameters defined in this protocol might not be named in similar ways in other equivalent spectrometers.",
    "For the ESEEM experiment, the EPR tube containing the sample is flash-frozen in liquid nitrogen prior to being loaded into a precooled sample cryostat in the EPR spectrometer.\nTurn on the heat exchanger, the console power, the power supply of the magnet, and the TWT.\nStart the Xepr software and then go to ‘Acquisition’ and click ‘Connect to spectrometer’.\nTurning on the resonator:\nOpen the Microwave Bridge tuning dialog box and switch to tune mode.\nSet the microwave attenuator to 30 dB and scan for the cavity dip. The resonator dip is the resonance frequency of the empty cavity.\nInsert the tube through the small sample holder and screw the latter up to the long rod. Stop the flow cryostat by switching off the diaphragm pump and let it return to ambient pressure using helium gas. Keep flowing the helium gas in the cryostat to prevent icing issues while inserting the sample rod assembly into it.\nOnce the sample is fully inserted in the cavity, resume the cryogen flow by switching on the diaphragm pump. The ESEEM experiments are conducted at 55K/77 K as this range of temperatures constitutes the optimum conditions for the nitroxide.\nNote: Although going further down in temperature increases the sensitivity, this will also increase considerably the running time of the experiment. Therefore, a trade-off between sensitivity and the running time of the experiment needs to be considered.\nNote: Careful handling is required when inserting the sample into the cavity at low temperatures in order to prevent ice formation inside the cavity.\nThe insertion of the sample into the resonator will shift the cavity dip from the center. Follow the cavity dip by using the frequency slider to bring it back to the center.",
    "A pulsed experiment requires an overcoupled resonator to allow a larger excitation bandwidth, and for this move fully up the coupling adjustment arm, which will broaden the dip, and use the frequency slider to keep the resonator dip centered.\nOnce the cavity is overcoupled switch the spectrometer to ‘Pulse mode’ in the ‘Bridge Configuration’ tab on the ‘FT Bridge’ panel.\nSwitch to operate mode in the Microwave Bridge Tuning panel.\nMake sure that the MW attenuation is set to 60 dB in the receiver Unit tab of the FT EPR Bridge window.\nClick ‘New Experiment’ in the monitoring panel.\nClick the Pulse tab, select the Advanced button, and hit the Create button.\nClick the activate button to ensure that the parameter changes are immediately actualized.\nNote: You have the option to run pulse experiments from tables or from the PulseSPEL (Pulse SPEctroscopy Language) program depending on the type of experiment. Usually, tables are used for basic 1D experiments that do not require phase cycling. PulseSPEL is better for more sophisticated pulse sequences that require phase cycling to remove receiver offsets and unwanted echoes. We use the PulseSPEL program for our experiments as 3-Pulse ESEEM requires a four-step phase cycling. Each type of pulse experiment is associated with a specific PulseSPEL program. Therefore, one should select the associated program for the experiment they aim to use.\nCritical: Before starting any pulse experiments, as we are using high power MW pulses, a safety procedure is necessary to follow before setting any pulse experiment to avoid damaging the MW amplifier or other electronic components.",
    "Run an echo-detected field swept EPR experiment is prior to doing any further pulsed measurements. This aims to acquire an absorption EPR spectrum and its associated first derivative is analogous to the CW EPR spectrum. It is performed by integrating the area under the echo while sweeping the magnetic field. This uses a two-pulse sequence echo:\np\n0\n−\nd\n1\n−\np\n1\n−\nd\n1\n−\necho.\nSet the magnetic field around 3460G (X-band) for the nitroxide spin-label.\nSet up two pulses echo by programming 16 ns and 32 ns (corresponding to p0 and p1 in PulseSPEL program) at 380 ns (d1) apart.\nAdjust both the microwave power and the Shot Repetition Time (SRT) to get a maximum echo.\nNote: The SRT is the time for allowing the magnetization to go back to the equilibrium between individual experiments and is temperature dependent. The optimum SRT for nitroxide is usually set between 3 and 4 ms.\nAdjust the signal phase until most of the echo is in the real channel and the imaginary signal is almost flat.\nActivate the run PulseSPEL button in the acquisition panel. Note that the frequency is around 9.8 GHz for X-band.\nLoad the PulseSPEL program and its corresponding variables definitions (Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_1839_11.csv\nOnce loaded, compile both programs.\nSet the parameters p0, p1, SRT to the values used to optimize the echo and compile the variables definitions program.\nSelect “2P ESE Field Sweep” experiment from drop-down menu in acquisition tab in the FT EPR parameters window with no phase cycling.\nSet the acquisition trigger by adjusting d0 in the PulseSPEL program (d0 = 360 ns in our case). This is adjusted so that the acquisition should start just before the echo.",
    "Set the length of the acquisition trigger pg to cover the whole echo (pg = 160 ns in our case).\nSet the sweep width to 120.00G in the Field tab of the FT EPR parameters window and the number of data points (the number of data point is set in the dimension of the associated experiment in the PulseSPEL program).\nPress the Run button and save the spectrum.\nNext perform the Tm relaxation time experiment. This has a similar setup as 2pESEEM and is usually used to get, in addition to the transverse relaxation time, some indication about the ESEEM effects prior to running a 3pESEEM. Troubleshooting 4[href=https://www.wicell.org#troubleshooting]. The corresponding pulse sequence is:\np\n0\n−\nd\n1\n−\np\n1\n−\nd\n1\n−\necho.\nIn which d1 is incremented by a defined step called d30 (Table 4[href=https://www.wicell.org#tbl4]).\nComplete this experiment at a fixed magnetic field position, which in our case, is set at the maximum of the field swept spectrum and monitor the echo intensity by incrementing the position of the second pulse. The PulseSPEL program that was used for the field sweep echo also includes the Tm experiment.\nIn FT parameters window and under Field tab adjust the Center Field Value to the value of the field corresponding to the maximum point in the Field swept EPR spectrum.\nChange the experiment in the experiment box to 2P_ESE_decay.\nSince we are monitoring echo height, we only need to integrate the area around its maximum, which corresponds to the length of the long pulse used in the pulse sequence. Set the integrator gate length to pg = 32 ns (our pi pulse length).",
    "Set the delay between the two pulses d1= 200 ns. This is limited by the deadtime of the spectrometer, otherwise it is recommended to use the shortest delay possible.\nSet the acquisition trigger position d0= 418 ns or 420 ns to cover the 32 ns area symmetric around the highest point of the echo.\nNote: To save all the optimized variable values in PulseSPEL, you need to click the run button after each modification (Table 4[href=https://www.wicell.org#tbl4]).\ntable:files/protocols_protocol_1839_12.csv\nRun a quick experiment by clicking the Start button next to the pulse tables in the Patterns panel and watch the echo modulating in the SpecJet panel to check whether the signal is clipped or not. In the case of clipping signal, the video gain needs to be reduced until you are getting a non-clipped echo.\nSelect 2-step phase cycling. This 2-step phase cycling is needed to suppress any receiver offsets.\nClick run and save the data.\nEstimate the Tm using fitting functions to datasets in the Xepr program. To do this, load the data and phase it in such a way as to get a flat imaginary signal. Select the real part of the signal and in the Processing menu, click the Fitting submenu, then in the exponentials window choose Exponential Decay. Click the Fit button and the program will fit an exponential curve to the real data.\nNow we can run the 3-pulse ESEEM experiment.",
    "Note: The magnetic field position is set to the highest point of the field swept EPR spectrum for higher sensitivity. In a similar way, once the magnetic field is set, adjust the phase and optimize the echo’s intensity by adjusting both the power and the video gain. When using more than two pulses, more echoes are generated as a result of many combinations between the applied pulses. In the case of 3pESEEM, where 3 pi/2 pulses are applied, five echoes are generated. However, only four are observed after the last pulse. The targeted echo which underpins the hyperfine information is the first echo occurring after the last pulse, known as the stimulated echo. Phase cycling is therefore required to select the desired echo and to suppress unwanted echoes. Both 2pESEEM and 3pESEEM experiments can be performed using their associated PulseSPEL program.\nSince 3pESEEM is another experiment, we do need to load its associated PulseSPEL program and Variable definitions. The corresponding pulse sequence:\np\n0\n−\nd\n1\n−\np\n0\n−\nd\n3\n−\np\n0\n−\nd\n1\n−\necho.\nIn which d1 is fixed and d3 is incremented by a defined step called d30. Contrary to the Tm experiment, the 3pESEEM is a single point experiment and we are only monitoring the height of the echo while incrementing the d3.\nThe delay d3 was incremented from 400 ns in 8 ns steps and the number of data points was set to 760.",
    "Run a field sweep as explained above (step 81) and set the magnetic center to the value corresponding to the maximum intensity at which the 3pESEEM experiment will be recorded. In Experiment submenu, select 3P ESE setup and in Phase cycle select 4-steps. This setup experiment helps to optimize the stimulated echo by adjusting, the phase, the power attenuation, and the video gain.\nOnce the echo is optimized, set the variable values for the 3pESEEM experiment as listed below (Table 5[href=https://www.wicell.org#tbl5]):\ntable:files/protocols_protocol_1839_13.csv\nPress the Run button.\nSave the spectrum.\nNote: The d1 value is inversely proportional to the Larmor frequency of the nucleus under investigation and therefore it is magnetic field dependent, and one needs to adjust it accordingly to the value of the magnetic field at which the 3pESEEM is recorded.\nNote: Anytime you adjust d1, run the 3pESEEM experiment in Specjet in a similar way as mentioned in step 84e and check that the signal is not clipped. This is due to the fact that the stimulated echo is modulated as the delay d3 is incremented and in some cases you can mistakenly adjust the video gain to an echo that its amplitude corresponds to the lowest point of the modulation. Therefore, you can get a clipped signal by the video gain when signal moves to the highest point in the modulation. This step helps to adjust properly the video gain.\nFor solvent accessibility determination, as we are only interested in deuterium’s contribution, record all 3pESEEM data with a d1 that corresponds to the proton blind spot.\nProcess the data initially with the Bruker Xepr program.\nLoad the time trace and phase the imaginary part of the signal until you get almost a flat signal.",
    "Extract the real part of the dataset and apply a polynomial baseline correction from the correction task button.\nSubtract the baseline and transfer the result to the primary dataset for further processing.\nClick the window Function task button and select the Hamming button in the Window Function task bar. Click apply. This will result in a time trace with an amplitude that varies smoothly and gradually toward zero at the end of the trace. This in turn significantly reduces the artefacts that might occur when performing FFT.\nFinally, zero fill the data by clicking in the Transformations submenu, of the Processing menu, Zero filling and set in New Length 1024 and click Fill.\nSelect FFT Real command in the Processing menu and the result will be displayed in the Primary dataset.\nSelect the Absolute button in the Complex submenu of the Processing menu to get the magnitude spectrum.\nUse one of the two major approaches to determine the solvent accessibility.\nNote: The first one is to estimate the solvent accessibility directly from the intensities of the deuterium peaks in the magnitude ESEEM spectra for the different mutants. The second approach is based on a model developed by Jeschke and co-workers which is based on deuterium modulation depth to estimate the solvent accessibility (Volkov et al., 2009[href=https://www.wicell.org#bib41]). Both methods can provide an estimate of the distance and number of deuterium nuclear spins in the proximity of the nitroxide electron spin and have shown good agreement between their respective results. Troubleshoot 5[href=https://www.wicell.org#troubleshooting].\nFor the first approach, measure the deuterium peak intensity in the magnitude ESEEM spectra obtained for each mutant (after step 87g), to get a direct estimation of its associated solvent accessibility.",
    "For the second approach, fit the time trace obtained after the background correction (spectra obtained after step 87c) by using a damped harmonic oscillation function:\nF\n(\nt\n)\n=\nk\nD\ncos\n(\n2\nπ\nν\nD\nt\n+\nΦ\n)\nexp\n(\n−\nt\n2\nτ\n0\n2\n)\nWhere kD is the deuterium modulation depth, τ0 is a damping constant, and φ the phase, and they are free parameters. The υD is the Larmor frequency of the deuterium and is kept fixed, t is the time axis of the time trace.\nThe fit can be performed by the curve fitting toolbox in MATLAB.\nUse the kD values determined by the fit and then calculate the solvent accessibility parameter   Π  (  D 2  O )    using the formula:\nΠ\n(\nD\n2\nO\n)\n=\n2\nk\nD\n[\n1\n−\ncos\n(\n2\nπ\nν\nD\nd\n1\n)\n]\n×\n(\nν\nD\n2\nM\nH\nz\n)\n2\nd1 is the first delay used in the individual 3pESEEM experiment, the deuterium Larmor frequency. υD is normalized to 2 MHz."
  ],
  "subjectAreas": [
    "Cell Membrane",
    "Mass Spectrometry",
    "Structural Biology",
    "Molecular Biology",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}