{
  "id": 17550,
  "origin_website": "Jove",
  "title": "A Preclinical Model of Exertional Heat Stroke in Mice",
  "procedures": [
    "All procedures have been reviewed and approved by the University of Florida IACUC. C57BL/6J male or female mice, ~4 months old, weighing within a range of 27-34 g and 20-25 g, respectively, are used for the study.\n1. Surgical implantation of the telemetric temperature monitoring system\nUpon arrival from the vendor, allow the animals to rest in the vivarium for at least 1 week prior to surgery to minimize the stress of transportation.\nGroup house the mice (maximum of 5 per cage under local IACUC guidelines) until the day of surgery for temperature telemetric device implantation. House them in standard 7.25\" (W) x 11.75\" (L) x 5\" (H) cages containing corncob bedding. Maintain the light cycle on a 12 x 12 light cycle (on: 7 AM; off: 7 PM). Maintain the housing temperature at 20-22 °C and relative humidity (RH) at 30%-60%. Provide the standard chow diet and water ad libitum until the EHS protocol.\n\tNOTE: The rationale for individual housing is to avoid frequent fighting injury in male C57bl/6J mice and to provide ample opportunity for spontaneous wheel running for each mouse.\nFor placement of the telemetry devices, anesthetize the mouse with isoflurane (4%, 0.4-0.6 L/min of O2 flow) in an induction chamber. Then, place the mouse under continuous anesthesia via a nose cone (1.5%, 0.6 L/min).\nUse eye lube, such as a vet ointment, to protect the animal's eyes from damage or injury during surgery.\nTo prepare the surgical site, shave the lower abdomen with small animal hair clippers or use a commercially available hair remover. Administer the first dose of subcutaneous buprenorphine (0.1 mg/kg) during this time.",
    "Scrub the area with three washes of povidone-iodine (or similar germicidal scrub) followed by 70% isopropyl alcohol rinse (or sterile saline depending on local veterinary requirements). Then, transfer the mouse to the surgical area.\nUse an adhesive drape to isolate the surgical site on the mouse. Using sterile instruments and aseptic technique, make a ~1 cm incision on the midline along the linea alba, about 0.5 cm from the costal margin. Then, separate the skin from the muscle layer and make a slightly smaller incision on the linea alba, careful not to damage the bowels or internal organs.\nOnce the muscle layer is open, place the sterile telemeter (miniature reusable battery-free radiotelemetry device; 16.5 x 6.5 mm) into the intraperitoneal cavity in front of the caudal arteries and veins and dorsal to the digestive organs to allow it to float freely.\n\tNOTE: All telemeters are cleaned with soap and water, thoroughly rinsed and gas sterilized with ethylene oxide between usages. If gas sterilization is not available, immersion in sterilization solutions (following manufacturer’s recommendation for dilution and immersion time) is accepted to  disinfect and sterilize the telemeters.\nClose the abdominal opening with a sterile 5-0 absorbable suture, and close the skin using a simple interrupted stitch with 5-0 proline suture.\n\tNOTE: Allowing the telemeter to float in the abdominal compartment without tying it to the abdominal wall (a method recommended by the manufacturer) has been demonstrated to be successful and preferred by the authors to eliminate excess tension in the abdominal wall during healing. Further, this has no impact on the receiver's ability to obtain the signal from the emitter.",
    "Place the mouse in its clean cage with a portable heating pad under the cage. Monitor the mouse every 15 min during the first hour of recovery from anesthesia, and then return to the animal housing facility.\nProvide mice with subcutaneous buprenorphine injections every 12 h for 48 h during recovery and continue to monitor for signs of distress. If available, give slow-release buprenorphine subcutaneously every 24 h (1 mg/kg) for 48 h. Allow the mice to recover for ~2 weeks following surgery before introducing a voluntary wheel running.\n2. Familiarization: Voluntary and forced wheel running\nFollowing recovery from surgery, place the voluntary running wheels in the cage for free access to the wheel. Other running wheel selections may be equally effective, but ensure it fits within the limited cage sizes available.\n\tNOTE: The running wheels had to be slightly reduced in dimension to fit in a standard cage.\nAcclimate the mouse to the voluntary wheel in the cage for 2 weeks. Once acclimated, the mouse is ready for training with familiarization procedures for the forced running wheels.\nPerform the four training sessions (one/day) in the environmental chamber at room temperature (~25 °C, 30% relative humidity).\n\tNOTE: Although this is ideal, mice were also successfully trained in identical forced running wheels outside the chamber. Several mice can then be trained simultaneously without interfering with the use of the chamber.\nTo begin the first training session, allow the mouse to free wheel in the modified running wheel for 15 min by removing or loosening the motor drive belt to allow the mouse to determine the speed of the wheel and acclimatize to it in a non-stressful manner.",
    "NOTE: Protocols can be run with software and hardware supplied by the running wheel manufacturer or may be substituted by an external programmable power supply that is wired directly to the wheel motor, which allows for automation of the incremental exercise protocol.\nCalibrate the system for each running wheel to determine the relationship between the power supply voltage and meters/minute (m/min) of each wheel.\n\tNOTE: The forced running wheels were also modified to elevate the motor 15 cm, invert and move the pulley driving the wheel down to 5 cm above the telemetry receiver platform. This ensured that the receiver platform obtained accurate telemetry data during the running protocol without interference from the motor.\nAfter a brief rest period (<5 min), initiate the forced running wheel protocol. Start the wheel at 2.5 m/min and increase 0.3 m/min every 10 min for a total of 1 h to mimic the first hour of the actual EHS trial, but at room temperature. Return the mouse to its home cage and allow for 24 h recovery. Conduct the subsequent three forced running sessions in the same manner on consecutive days. After day 1, the free-wheeling acclimation portion is unnecessary.\nAllow the mouse 2-3 days of wash-out or recovery from the stress of the forced running wheel practice, but allow the mouse free access to the home cage voluntary wheel. The mouse is now prepared to undergo the EHS protocol.\n3. EHS protocol\nThe night before the EHS protocol, place the mouse in the environmental chamber at room temperature (~25 °C, ≈30% relative humidity) to acclimate to the chamber.\nUse a data acquisition system to collect continuous Tc, averaged over 30-s intervals overnight.",
    "On the morning of the EHS protocol, make sure the mouse is at or below a normal range of diurnal temperature before increasing the chamber temperature (i.e., 36-37.5 °C). This ensures the mouse does not have a fever and has not experienced undue stress during this period.\nOnce the mouse is stable and within a range of normal resting core temperature, remove the food and water and weigh the animal. Shut the chamber door and increase the chamber temperature to a target of 37.5 °C and 40%-50% relative humidity, or the desired environmental temperature and humidity19. Verify the chamber temperature and humidity with a calibrated temperature and humidity monitor.\nSurround the chamber with a black-out curtain to keep light and disturbances minimal during the protocol. Monitor the mouse continuously during the protocol via remote IR illuminated cameras. Focus a second camera on the temperature and humidity monitor, placed close to the running wheel. Make any adjustments to the controller for the environmental chamber set-point to ensure accurate temperature readings near the animal.\nOnce the chamber has reached its target temperature as measured by the second camera on the temperature monitor (this can take ~30 min), quickly open the chamber door and place the mouse in the forced running wheel.",
    "Initiate the forced running wheel protocol at a speed of 2.5 m/min and increase the speed 0.3 m/min every 10 min until the mouse reaches a Tc of 41 °C. Once the mouse has reached this core temperature, allow the speed to remain constant until symptom limitation, characterized by an apparent loss of consciousness, a backward fall or fainting, and the inability to continue to run or hold on to the wheel. Confirm this time point when the mouse has three backward rotations on the wheel without signs of a physical response. Alternatively, identify a humane endpoint following local IACUC rules to determine when to stop the protocol (e.g., when Tc ~43 °C). This endpoint is slightly above symptom limitation in essentially all mice.\nTo perform the Rapid Cooling protocol (R), once the mouse reaches symptom limitation, stop the wheel, and remove it immediately from the forced running wheel. Weigh the mouse and place it back in its home cage to recover at room temperature. During this time, leave the chamber door open and return the incubator set point to room temperature to allow the chamber to cool rapidly. This procedure results in >99% long-term survival.\nTo perform a more Severe (S) EHS exposure, keep the animal's home cage within the 37.5 °C chamber during the EHS protocol. When the animal reaches symptom limitation, allow them to remain in the running wheel until they return to consciousness as observed by the remote camera (~5-9 min).\nThen quickly remove the mouse from the running wheel and return it directly to its pre-warmed cage to result in a much slower cooling profile (Figure 1A, red dashed line), essentially eliminating the EHS hypothermic phase. Remove the filter top from the cage during this time to improve equilibration with the chamber.",
    "Use a recovery cage precooled to room temperature to perform a less severe alternative procedure to result in a suppressed hypothermic phase but with a 100% survival rate20.\nFor the S protocol, carefully monitor the mouse during recovery and check continuously for humane endpoints. Although it is difficult to remotely test for commonly used humane endpoints (e.g., righting reflex), observe the mice remotely for normal movements during recovery such as grooming, normal breathing, licking, etc. Monitor the Tc during this time.\nMice are unlikely to recover if their core temperature reverses direction during the recovery phase, eventually exceeding 40 °C; at this time, terminate the experiment and evaluate the mouse for standard humane endpoints.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}