{
  "id": 5809,
  "origin_website": "Bio",
  "title": "Labeling Aversive Memory Trace in Mouse Using a Doxycycline-inducible Expression System",
  "procedures": [
    "Note: Animal care and procedures met National Institutes of Health standards. Local animal care ethical standards must be adhered to. The University of Iowa Animal Care and Use Committee (ACURF #4041016) and the University of Toledo Institutional Animal Care and Use Committee (Protocol #108791) approved all procedures. TetTag Fos-tTA mouse generationThe TetTag Fos-tTA mice are generated from the B6.Cg-Tg (Fos-tTA,Fos-EGFP*)1Mmay/J mice by breeding them with C57BL/6J mice and choosing those that carry only the Fos-tTA transgene (Liu et al., 2012; Ramirez et al., 2013). The University of Iowa Genome Editing Core Facility provides mouse genotyping service. The genotyping protocols can be found at https://www.jax.org/strain/018306[href=https://www.jax.org/strain/018306]. Figure 1 shows how neurons are labeled in mice transgenic for TetTag Fos-tTA and microinjected with the viral vector AAV9-TRE-mCherry.Viral construct (Figure 1B) and stereotactic injection (Figure 2)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171016/20171016022706_9920.jpgFigure 2. Schematic showing the procedure of labeling the memory retrieval-induced activation of lateral amygdala neurons in the aversive memory trace. A. Mice are fed Dox for 1 week, and then an AAV9 vector encoding mCherry is microinjected into the amygdala. Dox inhibits mCherry expression. Two weeks later, Dox is discontinued, and mice undergo the aversive conditioning protocol. Under those conditions, the Fos promoter will drive both shEGFP and mCherry expression, but shEGFP will rapidly decay. After aversive conditioning, mice immediately resume Dox treatment. One day later, the mice undergo the retrieval protocol. Thirty minutes after that, brain slices are prepared and the shEGFP- and mCherry-positive neurons in the lateral amygdala are determined. B. The stereotaxic system for the surgery of virus injection.Twelve-week-old mice are fed Dox diet (40 mg/kg) for one week before surgery. Sterilize the surgery area, instrument, and materials.Mice are anesthetized using ketamine/xylazine cocktail (see Recipes, 0.1 ml/20 g mouse weight. Intraperitoneal injection) or inhaling 1.",
    "5% isoflurane driven by 100% oxygen through an anesthesia machine vaporizer. Note: Ketamine/xylazine may cause animal death after surgery. Using an anesthesia machine vaporizer is an ideal option. Before surgery, use 2.5-3.5% isoflurane to anesthetize the animals and then lower down the concentration to 1.5% during the surgery. Shave the surgical site using an electric clipper and sterilize the site using iodine wipes and alcohol pads alternatively. The skin is opened using a blunt-ended scissors. Then a small hole is made using a high-speed rotary micromotor drill with a sterile diamond burr grinding bit. In the presence of Dox, 0.5 µl AAV9-TRE-mCherry virus is injected vertically (90° to the skull) into the lateral amygdala bilaterally (relative to the bregma: -1.5 mm anteroposterior; ±  3.5  mm mediolateral; -4.3  mm dorsoventral), using a 10 µl Microliter 700 series syringe through a microsyringe pump (UMP3; WPI) (Figure 2B). A stereotaxic microscope is used for the microinjections to the mouse brain.The injector is slowly moved to the targeted site and should sit for 5 min before starting virus injection. A microsyringe pump (UMP3; WPI) with a controller (Micro4; WPI) are used to control the speed of the injection. The speed is set as 0.1 µl per minute. Note: The needle tip is easily clogged by dirt after injection. Clean with water and alcohol each time after use. The needle remains at the site for 5 min after the end of injection.Slowly extract the microsyringe from the site and mouse brain. Note: The microsyringe and needle are wiped with alcohol pads and rinsed with sterile ddH2O after injection. Glue the skin with Vetbond.After surgery, mice are housed in their home cages collectively and monitored for two weeks until behavioral testing.",
    "The mice will be given Dox diet during the two weeks prior to the behavioral testing. Anesthetics, Meloxicam and Buprenorphine, are administered to the mice before surgery. Meloxicam is given again 24 h later, and Buprenorphine is given every 12 h for a total 48 h of treatment.All sites of virus injection are verified histologically based on the immunostaining results after the behavior testing.Aversive conditioning and memory retrieval (Figure 2)All the behavioral experiments are performed at the light cycle.Mice are handled for 30 min on each of 2 days before aversive conditioning. Twenty-four hours before the TetTag Fos-tTA mice injected with AAV9-TRE-mCherry undergo aversive conditioning, the Dox-containing diet is replaced by a regular diet. On day 1, mice are habituated to an infrared aversive conditioning chamber (Med Associates Inc.) for 9 min. Then, the mice are presented with six pure tones (80 dB, 2 KHz, 20 sec each). During the last 2 sec of the tone, they receive a foot shock (0.7 mA, 2 sec). The interval between tones is 100 sec. The mice are then returned to their home cage 180 sec after the experiment. Immediately after aversive conditioning, the Dox-containing diet is restarted. One day after the aversive conditioning, mice are put into a new context (Figure 3) and receive a retrieval tone or not.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171016/20171016022918_8206.jpgFigure 3. Contexts for aversive conditioning and memory retrieval experiments. To change the odor in different contexts, the chambers and floors are wiped thoroughly with 1% Bleach or 0.25% peppermint. Transcardial perfusion and whole brain fixationThirty minutes after retrieval, the mice are euthanized with an intraperitoneal injection of overdose ketamine/xylazine cocktail (0.2 ml/20 g mouse weight). Place the animal on its back on a dissection board, and pin out all four feet.",
    "Use a blunt-end scissors to open the rib cage and expose the whole heart. Hold the heart gently with blunt forceps. Hold the butterfly needle with hemostats. Insert the needle into the left ventricle (no more than ¼ inch). Note: Gently insert the needle and make sure the needle stays in the left ventricle.Turn on ice-cold PBS/Heparin solution perfusion (see Recipes). While supporting the heart with the needle and hemostats, snip the right atrium. Carefully unpin the front feet and skin flap.Continue the perfusion of PBS/Heparin until blood is invisible in the liver (more than 5 min). Note: Make sure blood is completely gone.Switch the perfusion from PBS/Heparin to ice-cold PBS/4% PAF. Keep running the PBS/4% PAF for at least 5 min.Notes:  The mouse tail shows tremble when perfused with PAF efficiently. 4% PAF/PBS is not stable at 4 °C. Make a fresh solution from 20% PAF every week.Open the skull with scissors and forceps. Extract the whole brain using a metal spatula.Immerse the brain in 10 ml of PBS/4% PAF and store at 4 °C for 24 h.Brain slices preparationThe fixed brain is glued to the plate of the vibratome and rinse with ice-cold PBS.The brain is cut coronally into 50 µm sections from -1.54 mm to -2.34 mm anteroposterior. The settings of the Leica VT1000 vibratome: Speed: 4; Frequency: 5. Amygdala slices are identified according to a mouse brain atlas book (The Mouse Brain in Stereotaxic Coordinates, 3rd edition, 2008). Six coronal amygdala slices are microdissected from the brain slices using two 33 G syringe needles.Immunohistochemistry and cell countingTransfer the amygdala slices into a 24-well culture plate (one slice per well) by brush and wash for 5 min, three times in 4 °C PBS on a shaker.",
    "Note: The plate is covered with aluminum foil throughout the immunostaining experiment. Pipette 2 ml of blocking solution (see Recipes) into each well containing the staining basket. Place plate on a shaker at room temperature for one hour.Transfer each basket into a new well with 1 ml of primary antibody solution (see Recipes). Antibodies: Rabbit polyclonal IgG anti-RFP (Rockland) 1:1,000 dilution; Chicken IgY anti-GFP (Invitrogen) 1:1,000 dilution. Mouse anti-NeuN antibody, clone A60 1:1,000 dilution. Place the plate on a shaker in 4 °C for 12 h. Transfer each basket into a new well with 2 ml of PBS on a shaker at room temperature. Wash for 10 min, three times.Transfer each basket into a new well with 1 ml of secondary antibody solution. Antibody: Alexa Fluor 488 Goat anti-chicken IgG (H+L) (Invitrogen); Alexa Fluor 568 Goat anti-rabbit IgG (H+L) (Invitrogen); Alexa Fluor 647 Goat anti-mouse IgG (H+L) (Invitrogen), 1:200 dilution. Place plate on a shaker at room temperature for one hour.Transfer each basket into a new well with 2 ml of PBS on a shaker at room temperature. Wash for 10 min, three times.Use a wide mouth pipet to transfer slices to the slide and remove the extra solution. Then apply 3-6 drop mounting solution (VectaShield HardSet Mounting Medium with DAPI) containing DAPI to the edge of the slice, and then cover it with a coverslip.Check the sample on a confocal microscope and store the slides in 4 °C refrigerator. Count mCherry-positive and shEGFP-positive neurons from 6 coronal amygdala slices (-1.54 mm to -2.34 mm anterioposterior) for each mouse. Co-localization of shEGFP and mCherry is analyzed by Imaris and ImageJ."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}