{
  "id": 3021,
  "origin_website": "Cell",
  "title": "Visualizing and manipulating the production and accumulation of hyaluronan for functional assessment in chicken embryos",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart I: In ovo surgical insertion of 4 Methyl Umbelliferone -β-D Xyloside soaked resin beads into coelomic cavity of chicken embryos\nTiming: 5 days\nFollowing the steps outlined below, the researcher will be able to surgically insert resin beads soaked in 4 Methyl Umbelliferone -β-D Xyloside (Mu-Xyl), an inhibitor of HA synthesis7[href=https://www.wicell.org#bib7] (or other pharmacological compounds) into the coelomic cavity of a developing chicken embryo. This protocol can be adapted to target other tissues.\nPreparation of resin beads for the surgical insertion.\n1 day before the surgical procedure, weigh 200 mg of resin beads into a 1.5 mL centrifuge tube.\nWash the beads 3 times with 1 mL of 1× PBS, followed by centrifugation at 5,000 G for 1 min each time to remove PBS.\nWash the beads 3 times for 1 min each in DMSO, the vehicle for dissolving MU-Xyl.\nMove the beads into a 40 mM solution of MU-Xyl (in DMSO) to adsorb and incubate the tube for 12 h at 4°C with gentle rotation.\nFor negative control, surgically insert beads coated with the same vehicle (DMSO) that was used to dissolve the pharmacological compound of interest.\nOn the morning of the surgical procedure, add 2.5 μL of drawing ink to 100 μL of the soaked bead mix and incubate for another 2 h at 25°C.\nNote: At this point, the beads should no longer be colorless. Prepare the beads freshly before every experiment.\nSurgical insertion of beads into the coelomic cavity of the chicken embryo (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2564-Fig2.jpg\nFigure 2. In ovo surgical insertion of MU-Xyl soaked resin beads into coelomic cavity of chicken embryos to perturb HA synthesis",
    "(A) Cartoon schematic showing a whole HH15 chicken embryo (left) and a section at the level of the midgut (right, black dashed box) with MU-Xyl coated resin beads (blue circle) inserted into the right coelomic cavity. Red dashed lines indicate the incision made in the somatic mesoderm for inserting the beads.\n(B) Representative embryos at HH15 soon after bead insertion into the coelomic cavity and during collection at HH22. Scale bars = 100 μm.\n(C and D) (C) Fluorescent staining of HA using the HABP assay finds loss of HA accumulation in the right DM upon insertion of MU-Xyl coated beads into the right coelomic cavity and (D) shows quantification of HABP as a ratio of signal intensity of the right DM to the left DM. Scale bars = 100 μm. Figure reproduced from previously published manuscript.1[href=https://www.wicell.org#bib1]\nOne at a time, bring the eggs out of the incubator onto an egg tray.\nRemove the cellophane tape window with scissors to access the embryo.\nAdd 5–10 drops of 1× PBS with 1× Penicillin-Streptomycin (PBS/PS).\nNote: PBS/PS protects the embryo against infections and reduces the surface tension making it easier to remove the vitelline membrane.\nRemove the vitelline membrane from the top of the embryo (HH14-16) using a 21G needle.\nUsing Dumont #5 forceps, make a clean incision along the somatic mesoderm (Figure 2[href=https://www.wicell.org#fig2]A).\nOptional: Injecting 0.1% Fast Green into the coelomic cavity in between the somatic and the splanchnic mesoderm helps in visualizing the location of bead insertion.\nGently pipette 10 μL of the bead mix onto the embryo close to the site of incision in the somatic mesoderm with access into the coelomic cavity.\nUsing the Dumont #5 forceps to keep the incision open, insert beads one at a time into the cavity.",
    "Note: Five to eight beads can be inserted into the coelomic cavity (Figures 2[href=https://www.wicell.org#fig2]A and 2B).\nCritical: Make sure the beads do not break; the sharp edges will make them more difficult to insert. Exception is made for the last bead inserted, which may be cracked in half with blunt forceps before being inserted to prevent the beads from rolling out.\nUsing a transfer pipette, add a few drops of PBS/PS on top of the embryo to ensure that the beads are lodged in correctly.\nSeal the egg with cellophane tape and return it to the incubator until the desired stage.\nEmbryos collection and sorting (Figure 2[href=https://www.wicell.org#fig2]B).\nAt the desired stage, cut around the extra-embryonic vasculature to free the embryo and collect into petri dish with ice-cold 1× PBS using the perforated spoon (Figure 1[href=https://www.wicell.org#fig1]B).\nNote: We have successfully used this protocol to study the properties of the gut dorsal mesentery between stages HH18-HH21. These methods can also be applied to study the effect of HA accumulation in early embryonic tissue on the form and function of mature organs by collecting the embryos at later developmental stages (Figure 1[href=https://www.wicell.org#fig1]B).\nUse forceps and spring scissors to remove any remaining extraembryonic membranes and yolk from the embryo. Then transfer the embryo into ice-cold 2% paraformaldehyde (in 1× PBS) to fix for 12 h at 4°C.\nWash the embryos 3 times with 1× PBS for 5 min each, while being agitated on a nutator.\nUnder a dissection microscope, screen the embryos for any gross morphological anomalies that might arise from improper placement of beads and exclude them from further analysis.",
    "Pause point: For the purposes described in this protocol, PFA fixed embryos can be stored in 1×PBS after fixation for ∼1 week and cryo-embedded embryos can be stored ∼ 1 year at −80°C without loss in quality.\nPart II: In ovo DNA electroporation to target HA\nTiming: 5 days\nIn ovo electroporation is a well-established method of gene transfer into cells of the chicken embryonic DM.8[href=https://www.wicell.org#bib8] This can be accomplished using single or combinations of plasmid expression vectors and more recently using inducible expression system to provide robust temporal disruption of gene expression.5[href=https://www.wicell.org#bib5] To manipulate gene expression and HA accumulation in the DM, the DNA of interest is microinjected into the coelomic cavity, and electroporated to target the right (or left) splanchnic mesoderm, the precursor to the DM.\nIn ovo electroporation of the splanchnic mesoderm (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2564-Fig3.jpg\nFigure 3. In ovo electroporation of the DM with HA-modifying enzymes alters tissue morphology\n(A) Cartoon schematic showing a whole HH14 chicken embryo (left) and a section at the level of the midgut (right, black dashed box) with electroporation mix (bright green area) injected into the right coelomic cavity. Gray circles with + and – denote the positioning of the positive and negative electrodes respectively. Red arrows indicate the direction of plasmid transduction into the splanchnic mesoderm.\n(B) H&E staining of embryos upon electroporation of Hyal2 into the right DM shows loss of ECM expansion (reduced intercellular space). Black arrows indicate the direction of tilting – WT embryos show leftward tilting of the gut whereas electroporation of Hyal2 results in loss of this tilting. Figure reproduced from previously published manuscript.1[href=https://www.wicell.org#bib1]",
    "(C) Quantification of intercellular spacing in the left and right DM from H&E staining of embryos upon HA-depletion with Hyal2 electroporation or inserting 4-MU coated beads, compared to WT embryos and those inserted with vehicle (DMSO) coated beads. Scale bars = 30 μm. Figure reproduced from previously published manuscript.1[href=https://www.wicell.org#bib1]\nOne at a time, bring the eggs out of the incubator onto an egg tray and remove the cellophane tape window with scissors to access the embryo.\nAdd 5–10 drops of 1× PBS with 1× Penicillin-Streptomycin (PBS/PS).\nNote: PBS/PS protects the embryo against infections and reduces the surface tension making it easier to remove the vitelline membrane.\nRemove the vitelline membrane from the top the embryo (HH13-16) using a 21G needle.\nUsing the embryo injection set up, carefully pull up and inject 0.1 μL–0.2 μL of the plasmid or morpholino electroporation mix into the coelomic cavity, on the left or the right side of the embryo.\nCritical: Introduce the electroporation mix into the left coelomic cavity to induce gene expression in the left side of the DM, and vice versa.\nMove the electrodes into position inside the egg, taking care not to rupture the yolk or damage the vasculature.\nNote: To target one side of the splanchnic mesoderm, the negative electrode should be placed on top of the embryo, directly above the injected coelomic cavity, whereas the positive electrode should be positioned under the non-injected coelomic cavity.\nUsing the square wave electroporator, introduce 3 square pulses (50 mV, 10 ms) to allow transduction of plasmid DNA into cells.",
    "Note: The coelomic epithelium of the splanchnic mesoderm undergoes epithelial to mesenchymal transition to give rise to cells of the DM.9[href=https://www.wicell.org#bib9],10[href=https://www.wicell.org#bib10] This process is largely completed by HH16+. If the embryo is electroporated after HH16, only the epithelial cells of the DM, but not the mesenchyme, will be targeted.\nSeal the egg window with cellophane tape and return it for incubation until the desired stage.\nDoxycycline induction of HA-modifying enzyme expression under TRE promoter.\nHA producing enzymes (e.g., Has2) and HA modifying enzymes (e.g., Hyal2, Tsg6) directly influence tissue properties and thus, organ morphology. Hence, spatiotemporal control of gene expression modification is important. Expressing HA-modifiers under an tetracycline-responsive element (TRE) promoter affords temporal control of HA modification in addition to the spatial precision afforded by in ovo electroporation2[href=https://www.wicell.org#bib2],5[href=https://www.wicell.org#bib5] (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2564-Fig4.jpg\nFigure 4. Spatio-temporal control of HA-modification system by doxycycline induction\nTo target the DM, the embryonic splanchnic mesoderm is electroporated at HH15 with the depicted constructs. Doxycycline induction at HH20, after the formation of the DM, induces expression of HA-modifying enzymes. This system allows precise spatio-temporal control of HA-modification. In the example illustrated, when the constructs are electroporated at HH15 into the right DM, H2B-RFP expression is observed. At HH20, upon doxycycline induction, GFP expression comes on indicating the activation of the bidirectional tetracycline-responsive promoter. By HH21, we observe a loss of HA accumulation within the left DM when Hyal2 is expressed under this construct.\nElectroporate the plasmid constructs as described above. The electroporation mix should consist of the following plasmid constructs in a concentration ratio of 2:1:2 and the total DNA concentration not exceeding 2.0 μg/μL.\na bidirectional TRE promoter driving expression of both the HA-modifying enzyme of interest and enhanced green fluorescent protein to mark activation of expression (E.g., EGFP-TRE-Hyal2).",
    "a constitutively expressing promoter (CAG) driving expression of a reverse tet-controlled transcriptional activator (rtTA) which upon doxycycline induction activates gene expression under the TRE promoter.\na constitutively expressing promoter (CAG) driving expression of H2B-RFP marker to determine the area of electroporation.\nAdd 500 μL of doxycycline (dox) solution (0.1 μg/μL of doxycycline hyclate in Hank’s balanced salt solution) in drops on top of the embryo to induce expression under the TRE-promoter.\nNote: GFP expression is observed as early as 3 h after dox application, reaches a maxima around 12 h post dox application and is maintained for at least 48 h.5[href=https://www.wicell.org#bib5] Thus, based on the experimental goal, the time of dox addition needs to be determined by the user.\nEmbryo collection and sorting.\nCollect, sort and fix the embryos as described in Part I, steps 3a–d.\nNote: In a well-optimized and skillful round of DM electroporation, we find ∼10% of the embryos developing gross morphological anomalies due to the electroporation. Hence embryos must be carefully examined for developmental defects in non-targeted areas and discarded from consideration as necessary.\nCarefully dissect out the limb buds and posterior body wall (somatic mesoderm derivatives) from both sides of the embryo to examine the gut dorsal mesentery for expression of the electroporated fluorescence reporter.\nNote: Exclude embryos without proper targeting of the DM, or tissue of interest.\nCritical: Targeted tissues may develop more slower than the rest of the embryo. Hence, it is strongly advised to always compare targeted embryos to similarly targeted negative controls, and never to WT embryos incubated for a similar duration. Additionally, tissue-specific staging may need to be carefully optimized for dynamic morphogenetic processes that may be affected by targeting.",
    "Note: The electroporation parameters are dependent on tissue properties and hence voltage and number of pulses need to be optimized on tissue-based context. Targeting efficacy should be determined by the percentage of GFP-positive cells in the region of interest, and a minimum efficacy should be used as a threshold for subsequent analyses. For targeting the embryonic DM/ splanchnic mesoderm, we use 3 pulses of 50 mV and 10 ms. For analysis of gene expression or morphogenetic phenotypes after electroporation, embryos with >70% of GFP+ tissue area are considered.\nPause point: For the purposes described in this protocol, PFA fixed embryos can be stored in 1×PBS after fixation for ∼1 week and cryo-embedded embryos can be stored ∼ 1 year at −80°C without loss in quality.\nPart III: Fluorescent staining of HA on tissue sections of chicken embryos\nTiming: 4 h\nHA is non-immunogenic and hence antibodies cannot be raised against it. The HA binding protein (HABP) is isolated from bovine nasal cartilage and is comprised of a combination of G1 and the cartilage “link” protein (both of which have conserved link module HA binding domains). We have used this assay with biotinylated HABP to fluorescently detect areas of HA accumulation in chicken (and mouse) embryonic sections. This protocol has been adapted and modified from the Programs of Excellence in Glycosciences, Cleveland Clinic’s HABP protocol (NHLBI P01HL1071247).\nReconstitution of HABP.\nAdd 100 μL of double-distilled water to 50 mg HABP, vortex the vial and incubate at 20°C–25°C for 20 min.\nVortex again and make aliquots of 10 μL each.\nStore at –80°C for up to a year.",
    "Note: In our experience, cryosections of paraformaldehyde-fixed, OCT-embedded tissues give the most consistent staining in the HABP assay. However, HABP staining can also be successfully performed on paraformaldehyde-fixed, paraffin-embedded tissues if necessary for co-staining assays. HA is a hydrophilic carbohydrate and hence the multiple dehydration steps during paraffin embedding may significantly alter the morphology of the accumulated HA and the tissue overall (refer Part III, steps 11a–g for preserving HA accumulation-induced morphology).\nHABP staining on cryosections (Figure 2[href=https://www.wicell.org#fig2]C).\nRehydrate cryosections of OCT-embedded tissues11[href=https://www.wicell.org#bib11] (recommended thickness: 15–20 μm thickness) in 1×PBS with 2 washes of 5 min each in slide washing jars.\nPerform a wash in 1×PBST (1×PBS with 0.03% Tween 20).\nPlace slides in a humidified slide chamber and cover tissue sections with the HABP blocking solution (300–500μL) and incubate at 20°C–25°C for 45 min.\nDecant blocking solution onto a paper towel and add 200μL of HABP solution (1:40 HABP diluted in blocking solution) to cover the slide.\nNote: The recommended concentration of HABP (1:40) is ideal for small embryonic tissues such as dorsal mesentery, if incubating at 20°C–25°C for 45 min. Alternatively, use 1:100 diluted HABP and incubate for 12–16 h at 4°C. For tissues containing higher levels of HA, such as the paraxial mesoderm, and neural tube, the HABP can be diluted to (1:100) with incubation for 45 min at 20°C–25°C. For a new tissue of interest, we recommend staining in both (1:40) and (1:100) to determine the ideal concentration for HA detection.\nWash the slides 3 times in 1× PBST for 5 min each.\nAdd a solution of Streptavidin-Alexa Fluor conjugate secondary antibody (1:500 in blocking solution) and DAPI (1:2000 in blocking solution) onto the slides and incubate at 20°C–25°C in the dark for 45 min.",
    "Wash the slides 3 times in 1× PBST and 1 time with autoclaved double-distilled or reverse-osmosis (RO) water for 5 min each.\nMount the sections on slide with a coverslip using ProLong Gold Antifade mounting medium.\nOnce the mounting medium has dried for 24 h in the dark, store the slides at 4°C and image within a week.\nHABP staining on paraffin sections.\nEmbed paraformaldehyde-fixed tissue in paraffin as previously described,12[href=https://www.wicell.org#bib12] obtain 6–10 μm thick sections, and dry them for 12–16 h at 37°C.\nBake slides for 20 min at 60°C followed by a 10-min cooldown.\nTransfer slides to a slide holder and do the following washes under a fume hood:\n2 washes with 100% Xylene for 10 min each.\nEthanol gradients washes (100%, 75%, 50%, 25% dilutions of ethanol made in water) 10 min each.\n2 washes in water.\nTransfer slides into diluted Antigen retrieval solution (1 mL of antigen unmasking solution, citrate-based in 100 mL of water) and microwave the container to boiling point.\nWrap the slide jar in aluminum foil and allow to cool down at 4°C for 20 min before following the above protocol from Part III, step 8b.\nRecommended controls for HABP assay.\nPositive control: Embryonic sections that contain neural tube and notochord (preferably >HH16 for chicken embryos, >E8.5 for mouse embryos). HABP signal can be observed in the ECM of the paraxial mesodermal surrounding but not within the neural tube or notochord.\nNegative control: Hyaluronidase treatment.\nNote: Treat adjacent sections of the tissue that you are investigating for this treatment.\nReconstitute hyaluronidase to a concentration of 0.2 Units/μL in 100 mM Sodium acetate buffer (pH6.0). Incubate at 20°C–25°C for 20 min.\nNote: Aliquots of this reconstituted hyaluronidase can be stored at −80°C.",
    "After rehydration with PBS (between Part III, steps 8b and 8c), treat slides with 100 mM Sodium acetate buffer (pH6.0) for 15 min at 37°C.\nDab the slides on a paper towel to remove the buffer and directly apply the reconstituted hyaluronidase solution (0.2 Units/μL) to cover the tissue sections for 2 h at 60°C.\nProceed to Part III, step 8c by washing with 1×PBS.\nNegative control: No HABP control. Replace HABP with water during the primary HABP incubation (Part III, step 8d).\nNote: Any signal consequently observed will be non-specific staining from the secondary antibody or endogenous auto-fluorescence (from basement lamina, red blood cells, etc.).\nCharacterizing HA-induced tissue expansion: protocol for Bouin’s fixation (Figure 3[href=https://www.wicell.org#fig3]B).\nNote: Enrichment of Hyaluronan in tissues as detected by HABP staining, is frequently associated with the expansion of extracellular spaces due to water-based fluid retention and selective permeability of hyaluronan matrices. While tissue architecture is best characterized in thin sections of paraffin-embedded tissues, capturing the actual extent of tissue expansion requires the use of potent fixatives that preserve the expanded tissue architecture despite the multiple dehydration cycles during paraffin embedding. We found the Bouin’s fixative most suitable for preserving the architecture of HA induced tissue expansion.\nCritical: Bouin’s fixative comprises of picric acid, acetic acid, and formaldehyde in an aqueous solution. Care and caution should be exercised in handling Bouin’s fixative as picric acid is potentially explosive.\nNote: Bouin’s fixative also functions as a mordant enhancing the chromogenic histological stains such as Hematoxylin/ Eosin and trichrome. However, Bouin’s fixed embryos are not suitable for any fluorescent immunohistochemistry and cannot be used for HABP staining. Hence, if electroporating or performing surgical manipulation using beads, it is recommended to presort the embryos, and equally divide the sorted embryos for HABP staining and Bouin’s fixation.",
    "Note: Hematoxylin/ Eosin is ideal for characterizing cellular spaces in the Bouin’s fixed embryos. Since Bouin’s fixative is known to lyse red blood cells and dissolve small iron and calcium deposits in tissue, it cannot be used for characterizing red blood cell distribution in tissues of interest.\nPrior to harvesting the embryos, carefully transfer Bouin’s fixative from the storage container into a glass vial, working inside a fume hood.\nCollect embryos into the Bouin’s fixative and allow them to shake on a nutator for 2 h at 20°C–25°C.\nNote: The embryos should now look opaque and petrous.\nCarefully remove the Bouin’s fixative and wash the embryos 3 times for 10 min with 70% Ethanol while shaking on a nutator.\nCritical: The ethanol which turns yellow colored from the fixative contains picric acid and must be discarded according to institutional safety guidelines.\nContinue to wash the embryos, replacing the 70% ethanol hourly until the ethanol turns clear.\nTransfer into 100% ethanol for complete dehydration.\nPause point: Bouin’s fixed embryos in 100% ethanol can be stored at −20°C up to a year.\nProceed to making paraffin blocks from the dehydrated embryos.\nHematoxylin and Eosin (H&E) staining can be performed as previously described.13[href=https://www.wicell.org#bib13]"
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Developmental Biology",
    "Molecular Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}