{
  "id": 15169,
  "origin_website": "Jove",
  "title": "A Method to Study the C924T Polymorphism of the Thromboxane A2 Receptor Gene",
  "procedures": [
    "The protocol follows the guidelines of the Medical Research Ethics Committee of the University of Chieti.\n1. Reagent Setup\nPrepare the Tris-EDTA (TE) buffer (pH 8.0). Add 200 µL of EDTA 0.5 M and 1 mL of Tris-Cl 1 M in a beaker and bring to 100 mL with sterile water. TE buffer final concentration: 10 mM Tris-Cl, 1 mM EDTA. Store at room temperature (RT).\nPrepare 1 L of the 10x stock solution electrophoresis buffer (TBE). Dissolve 108 g of Tris Base, 55 g of boric acid, and 40 mL of EDTA 0.5 M (pH 8) into a beaker, and bring to volume of 1 L with sterile water. Store at RT.\nPrepare the gel loading dye. Dissolve 0.25 g of bromophenol blue, 0.25 g of xylene cyanol FF, 50 g of glycerol, 1 mM of EDTA (pH 8) in 60 mL deionized or distilled water, and bring to a volume of 100 mL with sterile water. Store at 4 °C (for a few months) or at -20 °C (for years)\nPrepare 200 mL of 2% agarose gel. Use it fresh or, alternatively, store solidified at RT for up to several weeks.\nDissolve 4 g of agarose in 200 mL of 1x TBE buffer in a 600 mL beaker. Stir using a magnetic mixer for about 5 min until the agarose is completely suspended.\nHeat the 2% agarose solution in boiling-water or on a hot plate (for about 10 min, until the agarose is completely dissolved). Note that the beaker with the agarose gel must be covered with aluminum foil. Alternatively, heat the uncovered beaker in a microwave at a high temperature for about 3–5 min.\nSwirl the 2% agarose solution using a magnetic mixer, checking that the agarose is completely dissolved.",
    "NOTE: Particles of agarose appear as translucent grains prior to complete dissolution. It may be necessary to reheat particles for several minutes (about 5–10 min).\nIf a stored portion of the agarose gel is used, heat the beaker, covered with aluminum foil, in a hot-water bath (at about 60 °C) until the agarose is dissolved. Remove with a Pasteur pipette any \"trace\" of solidified agarose from the surface prior to pouring.\n2. DNA Purification\nPerform the following before starting the purification:\nUse human fresh whole blood samples, or thaw whole blood frozen samples quickly (for about 2–3 min) in a water bath (at 37 °C) applying a mild agitation and then equilibrate to RT before use.\nMix fresh or thawed blood samples inverting the tubes several times.\nStart the purification procedure by following the supplier's protocols for 100 µL of elution volume.\nQuantify and calculate the purity of DNA measuring the absorbance at 260, 280, and 320 nm.\nUse sterile water to dilute the samples and to calibrate the spectrophotometer.\nApply the following formula, in order to calculate the concentration of DNA sample = 50 µg/mL x (A260 − A320) x dilution factor, and the purity of DNA = (A260 − A320)/(A280 − A320), with an acceptable ratio between 1.7 and 1.9.\n3. PCR Amplification of DNA Samples\nPrepare 25 µL of reaction mixture in a 0.2 mL micro-amplification tube, as shown in Table 1.\nCarry out a PCR-amplification of the purified DNA samples using an automated thermal cycler, following the amplification program shown in Table 2.\nAt the end of the PCR amplification, stop the PCR reactions by leaving the DNA samples at 4 °C.\n4. RFLP of PCR Products",
    "Prepare 22.5 µL of master-mix solution for each sample, so that the selected restriction enzyme digests the PCR products, as shown in Table 3.\nTransfer 2.5 µL of PCR product to a new PCR tube for each sample, using a pipette and filter tips.\nAdd 22.5 µL of digestion master-mix solution to the tubes containing the PCR product of each sample, using a pipette and filter tips.\nIncubate the reaction mixture (master-mix solution and PCR product) at 37 °C for 4 h.\n5. Gel Electrophoresis Analysis of PCR-RFLP Samples\nStain the agarose gel by adding ethidium bromide (EtBr) at 0.5 µg/mL to the gel for 10 min. EtBr binds to the DNA, which can be visualized under ultraviolet (UV) light.\n\tCaution: It is important to use gloves and other protective devices during handling, storage, and disposal of EtBr, because it is a mutagen with potential carcinogenicity.\nPour the prepared agarose gel into a gel tray with the well comb in place, and wait until it is solidified.\nPlace the solidified agarose gel into the gel box (electrophoresis unit).\nFill the gel box with 1x TBE until the gel is covered.\nWith a pipette and filter tips, load 6 µL of the amplified digest DNA (specifically, load 5 µL of each sample and 1 µL of gel loading dye) into the wells of the agarose gel. Add a DNA size marker in a separate well and in parallel with the samples.\nRun the gel for 20–30 min at 100 V.\nWith a UV-transilluminator, visualize the cleaved DNA fragments or the undigested PCR products, comparing fragments with the DNA size marker, and register the results by photography following the manufacturer's instructions.\n\tCaution: Use protective devices (safety glasses or a face mask) around UV light sources."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}