{
  "id": 7022,
  "origin_website": "Bio",
  "title": "DigiTAG–a RNA Sequencing Approach to Analyze Transcriptomes of Rare Cell Populations in<em> Drosophila melanogaster</em>",
  "procedures": [
    "Isolation of cells-of-interestThe cell type-of-interest can be isolated through various different methods. For Drosophila neuroblasts, isolation by flow cytometry is recommended. Briefly, Drosophila brain cells as for example type II neuroblasts cells are labeled using fluorophore-expressing driver lines (e.g., worniu-GAL4, ase-GAL80, UAS-CD8::GFP for type II neuroblasts). Brains are manually dissected and dissociated using enzymatic treatment followed by mechanical disruption. Single-cell suspensions are then subjected to flow cytometry. Neuroblasts identified as a separate cell population, which includes the largest GFP positive cells, are isolated and either stored at -80 °C in TrizolTM or immediately used for RNA isolation. For a step-by-step protocol see Harzer et al. (2013).RNA isolationCollect a minimum of 100 and up to 105 cells of interest with a minimal estimated volume of ~524 μm3 (or ~10μm of diameter) per cell (e.g., type II Neuroblasts) by FACS directly into 750 μl of TrizolTM LS in a 1.5 ml DNA LoBind tube.Importantly, using less than this amount of initial material will lead to a significantly lowered power to detect transcripts. We advise users experimenting on other cell types to adjust the minimal number of cells proportionally in consideration with their cells-of-interest estimated volume.Adjust the total volume of each sample to 1 ml with Nuclease-free Water.Add 1 μl of GlycoBlueTM Coprecipitant (15 mg/ml) to allow low amount of RNA to be recovered from the RNA extraction.Mix by inverting the tubes 4-6 times.Optional: store your samples at -80 °C for up to one month.Add 200 μl of ~100% pure chloroform (safety note: handle chloroform in fume hood).Vortex the tubes for 15 s.Incubate for 2 min at room temperature.Centrifuge the samples at maximal speed (~24,000 x g) for 15 min at 4 °C in a refrigerated centrifuge.",
    "Carefully aspirate most of the upper aqueous phase (leave a small fraction to prevent unwanted contamination from the organic phase) preferably with a 20-200 μl micropipette, and transfer it into a new 1.5 ml DNA LoBind tube.Add 500 μl of ~100% pure isopropanol to precipitate the RNA.Incubate the samples for 15 min at -20 °C to optimize RNA precipitation.Optional: keep your samples at -20 °C for up to one week.Vortex the tubes for 15 s.Centrifuge the samples at maximal speed (~24,000 x g) for 15 min at 4 °C in a refrigerated centrifuge.Carefully remove all the supernatant.Add 1 ml of ice-cold 75% ethanol to improve the purity of the RNA pellet.Vortex the tubes for 15 s.Centrifuge the samples at maximal speed (~24,000 x g) for 15 min at 4 °C in a refrigerated centrifuge.Carefully remove all the supernatant.Remove the very last drop of liquid from each tube with a micropipette but importantly do not let the RNA pellet dry (it will prevent its subsequent solubilization).Resuspend the RNA pellet in 7 μl of EB Buffer. Such a low volume is required to enable subsequent reactions to be performed on the whole sample in the situation when the minimal amount of cells was used for the sample’s preparation.Reverse TranscriptionIn order to synthesize the first strand of cDNA, add the following reagents to the 7 μl of RNA:1 μl of oligo(dT)20 (50 μM)1 μl of dNTPs (10 mM each)4 μl of 5x First Strand Buffer4 μl of MgCl2 (25 mM)2 μl of DTT (100 mM)0.5 μl of RNaseOUT (40 U/μl)0.5 μl of SuperScript III (200 U/μl)Mix well and spin down.Incubate 50 min at 50 °C and then 5 min at 85 °C.",
    "Second Strand SynthesisIn order to degrade the RNA strand and synthesize a second strand of cDNA instead, add the following reagents to the first strand reaction and mix well:5 μl of 5x Second Strand Buffer3 μl of dNTPs (10 mM each)2 μl of RNase H (5 U/μl)1 μl of DNA Polymerase I (10 U/μl)19 μl of Nuclease-free WaterIncubate 2.5 h at 16 °C. The sample contains now double-stranded cDNA.Optional: store your samples at 4 °C for up to one day.DNA PurificationTo purify double-stranded cDNA molecules from the previous reaction mixes, add 90 μl of well-suspended AMPure XP Beads.Mix by pipetting 10 times. The reaction turns brownish due to the color of the beads. A homogenous color indicates that the reaction is well mixed (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201027/20201027210215_6847.jpgFigure 2. DNA purification using magnetic beads. A. Brownish beads are added to the reaction mix. B. After thoroughly mixing the reaction turns homogenously brown. C. Tube is placed into the magnet rack. D. Shortly after, the reaction mix becomes clear and the brown beads accumulate at the wall closest to the magnet. Incubate for 5 min at Room-Temperature. Put the samples on a magnet rack. Wait 2-3 min or until all beads have migrated to the wall of the tube closest to the magnet (Bead migration is completed when brown beads accumulate clearly visible on the wall of the tube next to the magnet and the reaction is cleared and thus appears transparent, see also Figure 2).Wash twice with 70% ethanol while leaving the tube on the magnet rack. Take care not to disturb the beads. If the pellet of beads is disturbed, wait for 1-2 min to let the beads migrate again to the tube’s wall close to the magnet.",
    "After washing remove all ethanol using a pipette and let all ethanol evaporate for 2 min at Room-Temperature.Remove samples from magnet and elute the DNA by resuspending the beads in 15.5 μl of EB buffer by pipetting up and down. Wait one min and place the tubes back on the magnetic rack for 2-3 min to allow all beads to migrate to the wall of the tube closest to the magnet. Transfer 15 μl of the completely cleared eluate to a new DNA low binding 1.5 ml tube.Tagmentation In order to uniquely tag each double-stranded DNA molecule, add on ice the following reagents to the15 μl of double-stranded and purified cDNA from Step E7, and mix:15 μl of TDE Tagment DNA buffer0.2 μl of TDE1 Tagment DNA enzyme Incubate 5 min at 55 °C. Purify using 54 μl of AMPure XP beads (see Procedure E. DNA Purification).Elute in 20 μl EB Buffer.PCR amplificationIn order to amplify each uniquely tagmented double-stranded DNA molecule to the concentrations required for RNA-sequencing, add the following reagents to the 19.5 μl of tagmented and purified double-stranded cDNA from Step F4 in a single well of a 96-Well qPCR plate and mix well:25 μl of 2x Phusion HF master mix2.5 μl 20x Eva Green1 μl of Nextera PCR primers (10 μM each)1 μl of Nextera modified Index one primers (“N7XX”; includes a random 8-mer tags for barcoding; 0.5 μM each)1 μl of Nextera Index two primer (“N501-506”, for multiplexing; 0.5 μM)Include the four Real-Time fluorescent Standards in duplicates by directly pipetting 50 μl from each Real-Time fluorescent Standards’ tube in separated wells of the qPCR plate.",
    "Incubate in a  CFX96  Touch Real-Time PCR Detection System:3 min at 72 °C30 s at 98 °C10 s at 98 °C30 s at 63 °C3 min at 72 °C (plate read)Repeat steps c) to e) up to 25 times (see also Step G5)Use the “no baseline subtraction” setting (in User Preference Settings in the Bio-Rad, CFX MaestroTM Software) in order to monitor raw fluorescence amplifications in parallel to the unchanging Real-Time Fluorescent Standards.Stop the PCR reaction right after plate read (3.e) and before denaturation (3.c) when an optimal amplification is reached (when the curve reaches a fluorescence level between standard 2 and standard 4; stopping the reaction at this point is key to reach a compromise between sufficient specific amplification of the sample libraries and minimized amplification of non-specific PCR products such as primers dimers) and recover the samples in 1.5 ml DNA LoBind tubes on ice. Optimal amplification is typically reached after 18 to 20 cycles when using a starting material of 100 Neuroblasts or after 14 to 15 cycles when using a starting material of 1,000 Neuroblasts.Purify using 90 μl of AMPure XP beads (see Procedure E. DNA Purification).Elute in 20 μl EB buffer and send for 50 base-pair Illumina Single-end sequencing. Prior to sending to sequencing, the quality of libraries can be checked by performing quantitative PCR on a house-keeping gene and the resulting amplification should be comparable to an amplification performed in the same settings, using the same DNA amount from a reference cDNA sample (for example, from a whole-tissue extraction)."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}