{
  "id": 18138,
  "origin_website": "Jove",
  "title": "Characterization of Immune Cells in Human Adipose Tissue by Using Flow Cytometry",
  "procedures": [
    "Visceral and subcutaneous AT samples were taken from subjects enrolled in the study approved by the Medical Ethical committee Jessa Hospital, Hasselt, and Hasselt University, Belgium, in accordance with the Declaration of Helsinki.\n1. Preparation of Reagents\nCollagenase solution\n\t\nDissolve 1 g of Collagenase I in 10 mL of phosphate buffered saline (PBS, without calcium and magnesium) to make a 100 mg/mL stock solution. Prepare 200 µL aliquots and store at -20 °C.\nDissolve 1 g of Collagenase XI in 10 mL of PBS to make a 100 mg/mL stock solution. Prepare 200 µL aliquots and store at -20 °C.\nDissolve 10 mg of DNase I in 10 mL of PBS to make a 10 mg/mL stock solution. Prepare 180 µL aliquots and store at -20 °C.\nAdd 100 µL Collagenase I (100 mg/mL), 100 µL Collagenase XI (100 mg/mL), and 90 µL DNase I (10 mg/mL) to 10 mL of DMEM Ham's F12. Make collagenase solution fresh for each isolation.\nErythrocyte lysis buffer\n\t\nDissolve 0.84 g NH4Cl in 100 mL of ultrapure water.\nSet the pH at 7.4 before use. Store in a glass flask at 4 °C.\nPlace the erythrocyte lysis buffer on ice before use.\nFACS buffer\n\t\nDissolve 0.5 g bovine serum albumin (BSA) in 100 mL of PBS to obtain 0.5% BSA PBS.\nDissolve 65 mg of NaN3 in 100 mL 0.5% BSA PBS to obtain 10 mM NaN3 0.5% BSA PBS. Store solution in a glass flask at 4 °C.\nPlace FACS buffer on ice before use.\n\t\tCAUTION: NaN3 is highly toxic. Work in a fume hood and wear safety glasses and gloves for protection while handling NaN3.\nHuman IgG block\n\t\nDissolve 10 mg of human IgG in 10 mL PBS to obtain 1 mg/mL. Prepare 100 µL aliquots and store at -20 °C.",
    "Place the human IgG block on ice before use.\n2. Isolation of SVF from AT\nCut 1 g of AT biopsy into small pieces (± 2 mm2) with a scalpel and transfer to a 50-mL centrifuge tube (e.g., Falcon tube). Add 10 mL of collagenase solution to each AT sample.\n\tNOTE: Close the lid of the tube completely and turn the lid ¼ turn back.\nIncubate for 60 min at 37 °C in a water-bath under gentle shaking (60 cycles/min).\nFilter the resulting suspension with a 200 µM filter and collect the sample in a new 50-mL centrifuge tube. Add 7 mL PBS on top of the filter to rinse the filter and obtain all the cells.\nCentrifuge the sample at 280 x g for 5 min at 4 °C.\nRemove the floating adipocyte fraction by pipetting. The cell pellet is the SVF.\n\tNOTE: Remove the adipocyte fraction to obtain SVF. Avoid submerging the entire tip in the sample because this will only remove the PBS and not the floating adipocytes.\nResuspend the SVF in 5 mL of PBS to remove collagenase, filter the suspension with a 70 µM filter, rinse the filter with 5 mL PBS, and centrifuge the sample at 280 x g for 5 min at 4 °C.\nRemove the supernatant and resuspend the pellet in 3 mL of erythrocyte lysis buffer.\nIncubate for 5 min on ice. Add 7 mL of PBS after incubation.\nCentrifuge the sample at 280 x g for 5 min at 4 °C.\n3. Staining of SVF for Flow Cytometry Analysis",
    "Dissolve the cell pellet in 90 µL 4 °C FACS buffer and add 10 µL of 1 mg/mL human IgG block. Divide the cell suspension in 2 wells of a 96 v-shape well plate. Place the plate on ice and let the human IgG block incubate for 15 min.\nAdd 100 µL FACS buffer to each sample to wash and centrifuge the plate for 5 min with 280 x g at 4 °C. Remove the supernatant by tipping the plate upside down in one smooth movement without tapping the plate.\n\tNOTE: Make sure to remove any remaining liquid from the top of the plate with a tissue while keeping the plate upside down.\nPrepare antibody cocktails for macrophage and DC subsets (FACS panel 1) and for T- and B-cell subsets (FACS panel 2) as described in Table 1 and Table 2. The volumes described in Table 1 and Table 2 are selected after optimizing the antibody concentrations and are sufficient for one vAT or sAT sample.\n\tNOTE: In FACS panel 1, use the markers CD303 and CD141 to confirm that CD11C+ CD11Blow cells are DCs. However, it is recommended to exclude these markers from the panel to include a live/dead staining. Both FACS panel 1 and 2 can be combined with the LIVE/DEAD Fixable Red Dead Cell Stain Kit viability staining when excluding CD303 in panel 1 as the PE channel will be unused. Perform viability staining according to the manufacturer's instructions.\nResuspend the pellet in 29.5 µL antibody cocktail for FACS panel 1, and 23 µL antibody cocktail for FACS panel 2. Incubate for 30 min in the dark on ice.",
    "Add 150 µL FACS buffer to each well and resuspend the cell pellet to perform a second wash step. Centrifuge the plate for 5 min at 280 x g and 4 °C. Remove the supernatant by tipping the plate upside down.\nAdd 150 µL 1% formaldehyde solution to each well to fix the cells. Transfer the cell suspension from each well to the corresponding FACS tube by pipetting with a P200 pipette. Store FACS tubes at 4 °C in the dark up to 7 days.\n\tNOTE: Direct measurement is also possible. Add 150 µL FACS buffer to each well instead of 1% formaldehyde, transfer the cells by pipetting with a P200 pipette to the corresponding FACS tubes, and analyze the cells.\n\tCAUTION: Formaldehyde is very toxic. Prepare formaldehyde solutions while working in a fume hood to avoid inhalation and wear gloves and safety glasses for protection.\n4. Flow Cytometry Analysis\nBefore the first measurement, use an unstained negative control to set the forward scatter (FSC) and side scatter (SSC). Adjust the voltages of the flow cytometer according to the manufacturer's instructions so that all populations of interest are visible in the FSC and SSC graph and a distinction between debris and live cells can be made.\nPerform multi-color compensation analysis with antibody capture beads following the manufacturer's protocol.\nPrepare fluorescence minus one (FMO) controls by making the antibody mix but exclude one antibody from the mix. Do this for every antibody, creating 8 antibody mixes for FACS panel 1, and 6 antibody mixes for FACS panel 2. These FMO antibody mixes are used to stain SVF as described previously in this protocol.\nMeasure all FMO controls and set the gating strategy based on FMO controls. Use the FMO controls to detect possible auto-fluorescence of the cells.",
    "NOTE: By removing one antibody from the mix, any fluorescence level detected in this channel is a background/autofluorescent signal. Hence, by comparing the different FMO control FACS results, gates can be drawn on specific populations ensuring that the gatings are based on positive cells and not based on auto-fluorescence.\nVortex the FACS tubes at 800 rpm before placing them in the flow cytometer and starting the measurement.\n\tNOTE: A minimum of 50,000 events in the live gate is recommended to ensure enough cells are measured from each subpopulation."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}