{
  "id": 7216,
  "origin_website": "Bio",
  "title": "Inkjet 3D Printing of Polymers Resistant to Fungal Attachment",
  "procedures": [
    "Development of an ink for inkjet-based 3D printing processes should consider not only viscosity and surface tension as per typical 2D print ink formulations (Derby, 2010) but also the reactivity or solidification speed, which is important and correlates with factors such as photoinitiator concentration and printing environment. We have described these factors in detail in our previous studies (He et al., 2016;      Zhang et al., 2019). The protocol below revealed the successful candidate ink formulation developed from a (R)-α-acryloyloxy-β,β-dimethyl-γ-butyrolactone monomer printed in our recent work (Vallieres et al., 2020).Ink preparationPlace a 5-mm PTFE stirrer into a 22-ml vial.Place the vial on a balance and tare the weight.Add 0.1 g 2,2-dimethoxy-2-phenylacetophenone (solid) into the vial.Wrap the vial in aluminium film before adding liquid monomers.Place the vial back on the balance and tare the weight.Add 10 g (R)-α-acryloyloxy-β,β-dimethyl-γ-butyrolactone (liquid) to the vial and close the cap.Place the vial on the stirring stage (IKA RCT Basic) and mix the contents at 800 rpm for 15 min at room temperature.Place the vial in a shaded box to help exclude ambient light during nitrogen purging. Open the cap and purge nitrogen gas (flow rate ~10 ml/min) into the mixture for 15 min through a needle, to allow the ink to become saturated with nitrogen. This step helps to minimize the oxygen inhibition effect during printing.Collect the ink with a 10-ml syringe in a dark room and purge through a syringe filter into a fresh vial. The filter will help to remove any solid contamination and avoid print head clogging during printing.Cap the vial and wrap in aluminum foil to exclude ambient light that could trigger polymerization and cause ink solidification.Store the ink for at least 12 h at 4°C before use.Filling the ink cartridgeCarry out all the following steps in a dark room.",
    "Carefully collect 3 ml ink using a 5-ml syringe, taking care to avoid the generation of bubbles at this stage.Fix the flat-head needle that comes with the cartridge to the end of the syringe and carefully transfer the sampled 3 ml ink into the cartridge bag.Wrap the cartridge in ductile tape to avoid curing triggered by ambient light during printing and assemble the print head.Printing and post-processingClamp the filled print head onto the DMP 2830 printer (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4016/bioprotoc-11-09-4016-g001.jpgFigure 1. Interior set up of the Dimatix DMP 2830 printer Affix the ceramic cleaning pad and purge the cartridge for 2 s to remove residual air from the print head.Cut a PEN film to A4 size and clean both sides with isopropanol.Place the film on the printing stage and turn on the vacuum to ensure that the film is firmly held on the stage.Install the front panel of the glovebox and purge nitrogen until the oxygen level is reduced to 0.2-0.3% (v/v).Disable the tickle control function, monitor the drop viewer to check for droplet formation, and set the printing waveform as shown below (Table 1).Table 1. Key parameters of the jetting and non-jetting waveforms used in (R)-α-acryloyloxy-β,β-dimethyl-γ-butyrolactone ink table:",
    "﻿0,1,2,3,4,5\nJetting Waveform,Jetting Waveform,Jetting Waveform,Jetting Waveform,Jetting Waveform,Jetting Waveform\n,Level (%),Slew Rate,Duration (µs),Maximum Jetting Frequency (kHz),Waveform Width (µs)\nSection 1,0,0.65,3.584,5,11.52\nSection 2,100,0.93,3.712,5,11.52\nSection 3,13,0.6,3.392,5,11.52\nSection 4,27,0.8,0.832,5,11.52\nNon-Jetting Waveform,Non-Jetting Waveform,Non-Jetting Waveform,Non-Jetting Waveform,Non-Jetting Waveform,Non-Jetting Waveform\n,Level (%),Slew Rate,Duration (µs),Maximum Jetting Frequency (kHz),Waveform Width (µs)\nSection 1,33,1,3.712,5,11.52\nSection 2,33,1,6.976,5,11.52\nSection 3,27,1,0.832,5,11.52",
    "Set the printing temperature to 48°C and the meniscus to 4.0 inches H2O. Adjust the printing voltage of each nozzle such that droplet formation is similar to that shown in Figure 2. The droplet speed needs to be between 7 m/s and 10 m/s. Twelve jets (jets 5-16) were used in our work.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4016/bioprotoc-11-09-4016-g002.jpgFigure 2. Exemplar droplet formation for (R)-α-acryloyloxy-β,β-dimethyl-γ-butyrolactone ink captured by the Dimatix instrument drop watcher. A full video is attached in the supplementary document.Set the droplet spacing to 35 µm and the print head angle to 5.8 degrees.Set the cleaning program to a 0.3 s purge and blot at the beginning of each layer, raising the print head by 12 µm after each layer is finished.The printing pattern for each layer is a mono bitmap, which is named as number+’.bmp’ starting from 1.bmp; select 1.bmp in the printing program.Copy the script in the supplement (Supplementary Script[href=https://os.bio-protocol.org/attached/file/20210425/4016 Supplementary Script s1.docx]) into a notepad and save as an AHK file.Run the saved script and sequentially input the ‘original height’, ‘number of layers’, and ‘height increment per layer.’ For (R)-α-acryloyloxy-β,β-dimethyl-γ-butyrolactone ink, we used 200 µm, 100 layers, and 11 µm height increment per layer.Deposit the liquid monomer ink onto the target location using a drop-on-demand inkjet print head. The printed ink is scanned and cured via the attached UV unit as it moves with the print head (He et al., 2017).Collect the printed samples and place in a vacuum oven (room temperature, -300 mmHg) for 24 h (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4016/bioprotoc-11-09-4016-g003.jpgFigure 3. Voice prosthesis valve-flap samples collected after vacuum drying Wash the samples by sequential immersion in isopropanol and distilled water, and dry in air.Transfer the samples to a 12-well plate and irradiate with UV-C for 20 min to sterilize the samples.",
    "Growing the fungal cultures, preparation of inocula, and biofilm formation (use aseptic technique; a biological safety cabinet may be required depending on the fungal species)Day 1 – Streak out strains Inoculate YPD agar medium with C. albicans cells from a stock kept at -80°C (for the stock, freeze C. albicans cells at -80°C in YPD broth with 20% glycerol) and incubate for 2 days in a static incubator at 37°C. We used the C. albicans strain CAF2-yCherry; however, the method can be applied to other C. albicans strains.Day 3 – Set up overnight cultures Inoculate YPD broth medium (typically 10 ml medium in a 50-ml sterile Erlenmeyer flask) with a colony of C. albicans from a 2-day-old culture on YPD agar. We recommend assaying a minimum of three independent colonies. Incubate overnight in an orbital shaker (150 rpm) at 37°C.Day 4 – Harvest cells and inoculate printed samples Harvest cells from the overnight liquid cultures by centrifugation (3,000 × g for 3 min).Remove the supernatant and wash once in 20 ml PBS and once in 20 ml RPMI 1640 using a 25-ml pipette.Resuspend the final cell pellets in 10 ml RPMI 1640 using a 10-ml pipette.From the resulting cell suspensions, prepare 1:100 and/or 1:1,000 dilutions in RPMI 1640 in 2-ml reaction tubes, vortex, and count using a hemocytometer under a brightfield microscope with 40× objective.Calculate the inoculum required to prepare 40 ml cell suspension at a final concentration of 1 × 106 ml-1 cells in RPMI 1640.Transfer 1 ml adjusted cell suspension to each well of the 12-well plate (from Step C16).Cover the plate with its lid, seal with tape, and incubate statically for 2 h at 37°C to allow the cells to adhere to the surface.",
    "Use sterile tweezers to transfer the printed samples to a fresh plate and wash three times with 2 ml PBS to remove non-adhered cells.NB: Printed samples must be transferred carefully to fresh plates using tweezers to avoid mechanically disrupting cell attachment. The transfer of samples to fresh plates (here and in Step E2) is important since free cells can also adhere to the surface of the wells, which would add to the crystal violet signal intended to reflect biofilm formation on the printed sample, impairing the analysis. Add 1 ml fresh RPMI 1640 and incubate for 46 h at 37°C with orbital shaking at 100 rpm.Fungal biofilm assessment (use aseptic technique and a biological safety cabinet)Staining with crystal violet offers an approach for assessing the biomass of the biofilm. Alternatively, biofilm metabolic activity can be assayed; we detect such activity of 24 h-biofilms by measuring the reduction of XTT (tetrazolium salt, 2,3-bis[2-methyloxy-4-nitro-5-sulfophenyl]-2H-tetrzolium-5-carboxanilide). However, crystal violet is less expensive than XTT and allows for the easy visual detection of biofilms on the surface of samples (e.g., Figure 4C in        Vallieres et al., 2020).After 48 h, C. albicans should display mature biofilms. Aspirate the medium carefully so as not to touch or disrupt the biofilm.Gently transfer the printed samples carrying biofilm to a fresh plate. NB: As above, samples must be carefully transferred to fresh plates using tweezers to avoid mechanically disrupting the biofilm (mechanical disruption during sample transfer could lead to the biofilm detaching from the sample surface and interfering in the final assessment. Therefore, multiple specimens (n>3) are required in each test to ensure that biofilm resistance is not a result of operational error. A control group (Vallieres et al., 2020) is also needed to ensure that the biofilm formation is as expected).  Stain the biofilms with 2 ml 0.",
    "5% (w/v) crystal violet for 1 min at room temperature.Wash three times with 2 ml PBS to remove non-adhered biofilm and excess stain.For quantitation, add 1 ml ethanol to dissolve the crystal violet.Transfer 100 μl reaction to a 96-well plate. Dilutions of the reaction may be needed if the concentration of crystal violet is too high. We recommend the preparation of a standard curve to estimate the level of saturation of crystal violet absorption before the assay. To do so, measure the absorbance over a range of crystal violet (in ethanol) concentrations.Measure the absorbance at 600 nm using the BioTek EL800 microtiter plate reader."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}