{
  "id": 13677,
  "origin_website": "Jove",
  "title": " Testing for Odor Discrimination and Habituation in Mice",
  "procedures": [
    "The adult male mice used in the following experiment were generated and housed at Baylor University at an ambient temperature of 22 °C, with a 14 hr light and 10 hrs dark (20:00 to 6:00 hr) diurnal cycle. The mice were given ad libitum access to food and water. All procedures to the mice were in compliance with the National Institutes of Health Guidelines for the Care and Use of Laboratory Animals and the animal protocol was approved by Baylor University Animal Care and Use Committee. Mice were tested in the late morning/early afternoon. For all procedures below the investigator should wear gloves to eliminate odors and prevent contamination.\n1. Preparation of Non-social Odors\nPrepare fresh non-social odors each day of testing.\n\tNote: The investigator should use gloves to prepare the odors.\n\t\nFill 3 centrifuge tubes with 10 ml of water each.\nPipette 100 µl of banana extract into a 15 ml conical tube and 100 µl of almond extract into a second 15 ml conical tube for a 1:100 dilution. \n\t\tNote: The third 15 ml tube will only contain water.\n2. Preparation of Social Odors\nPrepare fresh social odors on the morning testing will occur. Obtain social odors from two cages that have not been cleaned for at least three days and contain equal numbers of mice. Obtain social odors from mice of the same sex as the test subject.\n\tNote: These are to be stored at RT and should be used within 4-6 hr to maintain strong and consistent odor.\n\t\nDetermine how many social odor cotton swabs need to be created: each mouse being tested will be presented with three swabs from social odor 1, and three from social odor 2.",
    "Prepare social odors by wiping a cotton swab in a zigzag fashion across the bottom of a dirty cage. Shake off any excess bedding clinging to the tip.\nStore swabs in large glass jars with lids or in beakers covered with parafilm. Designate one container for social odor 1 and a second for social odor 2.\nMaintain odor source cages outside of the experimental testing room.\n3. Acclimation of the Test Mouse\nPut on gloves and weigh the mouse to be tested and place individually in a clean cage with a wire lid on top and the water bottle removed.\nAllow the mouse to acclimate to the new cage for 45 min in a room other than the testing room. Ensure that there are no unusual odors or noises in the room.\nAs testing takes about 45 min, stagger the acclimation times by putting the next mouse to be tested into a clean cage to acclimate right before testing the current mouse.\n4. Preparation of the Testing Room\nPlace fresh cotton swabs, laboratory tape, the bottles containing social odor swabs, the tubes of non-social odors, a micropipette, two timers, and a waste bottle with a lid in the testing room.\nEnsure that the testing room is reasonably free of odors, loud noises, and bright light. Do not wear scented colognes or lotions.\n\tNote: The observer should not be chewing gum or candy during the testing period and should try to limit their exposure to strong odor foods.\n5. Testing Procedure\nBring the acclimated mouse in its cage into the testing room and place the cage on the counter at a height that is comfortable for viewing while seated.",
    "Present each odor 3 times in a row for 2 min each time. Use the presentation order that can be found in Table 1.\n\t\nPipette 50 µl of odorant in the scent to be tested on to the tip of the cotton swab and re-cap the odor source. Lift the wire top of the cage and insert the unscented, wooden end of the swab into the water bottle opening, pushing the length through from the underside of the wire to the top. Avoid touching the cotton tip to anything, including fingers, so that odor contamination is avoided.\nContinue to draw the swab through the water bottle opening until about 1 inch of the cotton end hangs down into the cage. Affix the wooden end of the swab to the side of the cage using lab tape.\n\t\tNote: Be careful not to let the lid fall back onto the cage, causing a loud noise that would disturb the test mouse.\nImmediately begin timing for 2 min. Use one timer to time the 2 min presentation. Record the cumulative time spent sniffing the odor during the 2 min trial. Count the animal’s sniffing behavior using a separate stop watch. Active sniffing is defined when the animal’s nose is oriented towards the cotton tip with its nose ~2 cm or closer to the tip.\nAfter the completion of each trial, raise the wire lid and remove the cotton swab by pulling it downwards through the underside of the lid (this avoids odor contamination by preventing the cotton tip from touching the wire). Seal the used swab in a 500 ml waste bottle.",
    "Prepare and insert the next swab and begin timing. Allow approximately 1 min between each inter-trial interval. Continue until each scent has been presented three times in a row, for 2 min each time.\nOnce the mouse has completed all trials, empty the waste bottle containing the used cotton swabs in a trash can outside of the test room. Return the mouse to its home cage.\n6. Analysis\nAnalyze data for each group per odor condition using two-way ANOVA followed by Newman-Keuls or a similar post hoc test to determine significant habituation (less time sniffing successive same smells), and dishabitutation (more time sniffing a new smell).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}