{
  "id": 11022,
  "origin_website": "Jove",
  "title": "Wideband Optical Detector of Ultrasound for Medical Imaging Applications",
  "procedures": [
    "1. Optoacoustic Characterization of the π-FBG Detector\nPreparation of a microscopic sphere suspended in agar:\n\t\nMix agar powder (1.3% by weight) with distilled water in a glass beaker. Use a hot plate magnetic-stirrer device to heat the solution close to boiling temperature and dissolve the agar powder until the solution becomes clear and free of air bubbles. Alternatively, the agar solution may be heated using a conventional microwave with stirring performed manually using a glass stirrer. Pour the hot solution into a plastic mold, e.g. syringe with its tip cut out.\nSprinkle a small amount of microscopic spheres on the agar solution and wait until the solution fully solidifies. Take the solid agar phantom out of the mold by pushing the plunger.\nView the phantom under a stereoscopic microscope cut a small piece of agar which contains a single microscopic sphere.\nRepeat step 1.1.1 and add to the agar solution the solid agar piece containing the single microscopic sphere.\nAfter solidification, cut the agar phantom under the microscope such that the microscopic sphere is located close to the phantom's surface.\nOptoacoustic measurement\n\t\nUse two v-groove fiber holders to hold the fiber tightly on both sides of the π-FBG, and connected the holder to a three dimensional (XYZ) translation computer-operated stage. Ensure that the fiber is submerged to enable the propagation of ultrasound.\nFind the approximate location of the sensing π-FBG element by illuminating different parts of the fiber with the high-power nanosecond-pulse laser beam. The optical absorption of the coating, however weak, will create a signal when the illumination is performed on the π-FBG.\nPlace the agar-embedded microscopic sphere directly underneath the π-FBG. The microscopic sphere should be visible to the naked eye.",
    "Using the translation stage, perform a 2D scan of the π-FBG in the plane parallel to the ground to find the location where the signal from the microscopic sphere is strongest and its corresponding time delay is shortest.\nPerform last adjustments to the illumination to deliver maximum power to the microscopic sphere.\nUsing the translation stage perform a 3D scan of the π-FBG and record the signal for each position.\nTo obtain the spatially dependent frequency response of the ultrasound detector, perform the Fourier transform on the recorded time-domain ultrasound signal.\n2. Estimation of Robustness and Sensitivity of the π-FBG Detector's Performance\nUse two v-groove fiber holders to hold the fiber tightly on both sides of the π-FBG and submerge the π-FBG.\nPlace a dark plate or a graphite rod sturdily to face the π-FBG and illuminate it with the high-power nanosecond-pulse laser beam to create a strong acoustic field.\nPlace a water pump inside the water tank and turn it on in order to create rapid variations in the environmental conditions.\nTo estimate the robustness of the system, measure the output with the locking circuit turned both on and off. When no locking is performed, it is not possible to accurately detect the ultrasound signal.\nTurn the water pump off.\nTo estimate the benefit in sensitivity due to the high coherence of the source, replace the wideband pulse laser with a low coherence source and repeat the acoustic measurement. A decrease of over an order of magnitude in sensitivity is expected when the low-coherence source is used.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}