{
  "id": 2360,
  "origin_website": "Cell",
  "title": "Dissociation and inDrops microfluidic encapsulation of human gut tissues for single-cell atlasing studies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue: Assessment\nTiming: 5 min\nThis procedure begins with the receipt of tissues, which can vary in size from a biopsy millimeters in length to a resection several centimeters in length. Specimen should be collected immediately into a physiological buffer (typically RPMI) and stored/transported on ice or at 4°C until processed. While we have isolated cells from large tissues stored on RPMI for up to 3 days, it is best practice to minimize the time between collection and processing. Likewise, the timing for each step (including collection, storage, and all processing steps) should be recorded, as timing and other observations gathered during this and subsequent processes can be important pre-analytical factors in accounting for anomalies or bias in the downstream data.\nCritical: Tissue should remain cold throughout this procedure, ideally 4°C–6°C.\nRecord details about the tissue, such as accession number, time received, size, number of fragments, appearance, storage buffer, and any other sample-specific information which may be written on the tube it is coming from.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig2.jpg\nFigure 2. Example dissociation workflow form\nNote: It is ideal to standardize the collection of this metadata into a form which is generated for each sample as a physical record of its processing (Figure 2[href=https://www.wicell.org#fig2]).\nTissue: Transfer/downsizing\nTiming: 5 min\nThis method has been developed for biopsy-sized samples (fragments of a polyp or 1–2 biopsy bites of mucosal surface, no more than 2 mm2 each). If larger tissues are to be processed, then tissues will need to be scaled down to the dissociation. If tissue is in biopsy form, no further action will be needed, other than transferring to a 2 mL tube (step 4).\nPour off excess storage/transport buffer.\nUpon removing the lid, check for additional tissue in the threads.",
    "Extra buffer may need to be retained if unused excess tissue is to be stored.\nIf tissue pieces are larger than 2 mm2 transfer to a shallow weigh boat or dish (with 1–3 mL of buffer for wetting) to cut.\nIf total tissue is roughly 4 mm2 or less, cut into pieces ∼2 mm2 or less by bisecting 1–2 times with a razor blade or scalpel.\nIf tissue is larger than 4 mm2 then it will need to be scaled down.\nSelect 2–3 representative regions from which to cut 1–2 2 mm2 sized pieces.\nAvoid edges or excessively damaged regions.\nIf a tissue presents with multiple morphologically distinct regions, consider creating individual samples from each region, taking notes on the descriptions for each.\nTransfer tissue to a 2 mL tube using forceps, pipette, or careful pouring.\nRemove any remaining storage buffer, including any debris resulting from cutting tissue, and resuspend in DPBS.\nGently remove and replace DPBS if needed to further wash excess storage buffer, blood, mucus, or other material from specimens.\nTissue: Chelation\nTiming: 1.25–1.5 h\nThis step serves to loosen the epithelium by removing calcium from the proteins connecting epithelial cells to ECM and one another. While chelation is often used for separating the epithelium and the stroma into different fractions, biopsy-sized samples provide too little material for reductive processing steps, and so total material is carried forward.\nGently remove DPBS and add 1.9 mL of chelation buffer.\nCritical: Ideal buffer volume is 1.8–1.9 mL, which allows for a large enough bubble to gently displace and agitate tissue during rotation (Figure 3[href=https://www.wicell.org#fig3]).\nIncubate at 4°C with rotation/ inversion for 1 h and 15 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig3.jpg\nFigure 3. Tissue in Chelation buffer\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig4.jpg\nFigure 4. Bead pellet in TET buffer\nEncapsulation: RT and bead prep\nTiming: 5 min",
    "It is crucial to separate this setup process from cell dissociation to prevent contamination of encapsulation reagents. However, timing will dictate that some encapsulation setup will need to take place during tissue prep. For this reason, we make distinctions between tissue/cell prep and encapsulation work areas and their reagents. Gloves should be changed when moving from dissociation to encapsulation work areas, and separate dedicated pipettors used for the respective procedures. With practice, an individual can alternate between both processes, setting up the encapsulation during tissue processing incubations, and have cells proceed immediately from washes to encapsulation.\nBring out 200 μL RT Premix and leave on ice to thaw.\nPrepare Beads.\nSpin a Hydrogel bead aliquot at 1000 rcf for 1 min.\nNote: Beads will be difficult to see, and must be pelleted to gauge their volume. A 100 μL pellet of beads will be adequate for approximately 45 min of encapsulation (Figure 4[href=https://www.wicell.org#fig4])\nRemove supernatant down to 500 μL.\nCareful not to disturb or aspirate beads, bead volume should be no higher than 300 μL (1–2 mm below 0.5 mL meniscus).\nAdd 500 μL of bead wash buffer and briefly vortex.\nRepeat wash twice, leaving beads in 500 μL of wash buffer.\nNote: Beads will expand in the wash buffer, increasing the size of the pellet.\nAdd 500 μL of 2× GCB (beads should now be in 1 mL total) and briefly vortex.\nPlace beads on a tube rack in the dark (a drawer).\nNote: Beads will shrink in the GCB buffer, returning to their original size.\nPause point: Beads and RT will be finalized immediately before encapsulation.\nTissue: Dissociation\nTiming: 25–35 min",
    "During this step the tissue is digested in a cold-active protease (Adam et al., 2017[href=https://www.wicell.org#bib1]) to release individual cells with gentle pipetting. DNase aliquot should be thawed just before going into this step.\nMove sample to ice or a cooled rack, and allow tissue to settle.\nGently remove chelation buffer and resuspend tissue in DPBS.\nCritical: Tissue may be prone to disaggregation, handle gently and take care not to aspirate material.\nPrepare Dissociation buffer.\nAdd 0.9 mL of DPBS to 2× DNase aliquot and mix by pipetting.\nEnsure that DNase thaws before or during this step.\nAdd 1.9 mL of thawed 1× DNase to 100 μL frozen cold protease aliquot and pipette to thaw and mix.\nGently remove DPBS from tissue and resuspend in Dissociation buffer.\nRemove excess buffer if needed to ensure agitating bubble is present.\nIncubate at 4°C on the rotator for 25 min.\nCritical: Ideal buffer volume is ∼1.9–2 mL, which allows for a large enough bubble to gently displace and agitate tissue during rotation.\nTrituration - Using a p1000 pipette, pipette tissue pieces 10–20 times, as needed to release and disaggregate the epithelium from the tissue (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig5.jpg\nFigure 5. Tissue after trituration\nThe tissue should become softer and release material into the buffer.\nPipette the tissue to release material.\nPipette material in the buffer to disaggregate cells.\nIf tissue does not immediately enter the tip, it (please specify what “it” is, tissue or tip) can be gently pressed to the bottom of the tube to assist.",
    "The pipette tip may need to be trimmed to initially allow the tissue to pass – however, in the interest of optimization, it is best to strive for an initial tissue size that permits it to barely fit through the tip at this stage (cut the tissue into smaller pieces next time).\nIf a trimmed tip is used, a normal p1000 will still need to be used in order to disaggregate clusters.\nPlace a 70 μm Pluriselect strainer on a clean 2 mL tube, label with sample identifier, and transfer disaggregated cell suspension into filter (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig6.jpg\nFigure 6. 70 μm filtration setup\nTransfer ∼500 μL at a time and ensure it passes to prevent overflow.\nTissue: Cell washes\nTiming: 5–6 min\nHaving achieved a suspension of mostly-viable cells, further success is dependent entirely on the effective washing of cells. The goal is to remove dead cells, debris, and free DNA/RNA, leaving cells in clean DPBS for encapsulation. However, depending on the composition of the suspension, different strategies may be necessary to achieve this.\nPellet cells at 600 × g for 5 min at 4°C–6°C.\nCritical: always ensure that cells thoroughly resuspended just prior to centrifugation. If cells have been sitting more than a minute they may begin to aggregate and need additional pipetting to disperse them prior to re-pelleting.\nInspect pellet (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig7.jpg\nFigure 7. Example of a large cell pellet\nWhile it is not uncommon for some material to remain suspended in the supernatant, there should always be a visible pellet.\nIf no pellet forms, see troubleshooting[href=https://www.wicell.org#troubleshooting].\nAspirate supernatant.\nPellet may be tethered to material in supernatant and dislodge early, leave 100–200 μL of supernatant if necessary to prevent loss of pellet.\nResuspend in DPBS to half previous volume (1 mL for first wash).",
    "Use tube graduations to estimate this volume (this is faster and easier than volumetric pipetting).\nGently resuspend cells by pipetting, then mount 5 μL on a disposable hemocytometer.\nWe recommend using a p1000 or large bore pipette tip to avoid damaging cells in the loading process.\nInspect cells using phase contrast at 10–20× to discern viability (ideally >70% and improving through washes).\nUnder phase contrast, viable cells will have a whiter appearance, with a faint “halo” around them.\nDying cells may still have a halo, but their contents will appear darker and more granular.\nDead cells will appear dark and may have a bit of chromatin extruding from their membrane, or shrink into a bit of debris (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig8.jpg\nFigure 8. Good (left) and poor (right) quality cells under phase contrast microscopy\nAlternative methods for assessing cell quality include trypan blue and automated cell counters that implore fluorescent viability dyes, but visual inspection is preferred as it allows the user to account for debris and quickly move forward through washes.\nPause point: If more than one sample is to be ran (we recommend no more than 2–4 samples total for the volumes covered in this protocol), cells for subsequent samples can be held on ice after first resuspension for 30–60 min, and finish washes just before they are needed.\nCount and titrate cells for next wash.\nIf (roughly) >25 cells/square (>250,000 cells/ mL) then double the volume of DPBS (same as previous wash).\nIf <25 cells/square, keep wash in current volume (reducing wash volume).\nPause point: If a sample will not be ran within 20 min it is best to hold it on ice after the first wash, continuing with the final washes just before loading.\nProceed to wash 2, repeating steps 17–22.",
    "Proceed to wash 3, repeating steps 12–19.\nResuspend cells in 15% optiprep at ½ previous volume.\nInspect and count cells.\nIf cell concentration is >200,000 cells/mL and cells are in >200 μL then filter using a 70 μm Flowmi:\nPull at least 100 μL of cells into a p1000 tip.\nAttach a flowmi filter to the end.\nDispense cells through filter into a clean new 2 mL tube.\nLoad and inspect cells on hemocytometer.\nDilute with more 15% optiprep as needed to reach a concentration of ∼100,000 cells/mL.\nIf too many cells are in the tube to sufficiently dilute within 2 mL, a portion can be moved to a new tube for further dilution.\nEncapsulation: Encapsulation of cells\nTiming: 0.5–1.5 h",
    "The second leg of this procedure will be encapsulation using microfluidics (Figure 9[href=https://www.wicell.org#fig9]), which immediately follows cell washes. Cold cell isolation procedures can help preserve cell viability throughout dissociation, but many cells may be prone to death thereafter. Any delay in loading cells may decrease data quality. The aliquot and working volumes described in this protocol will allow for ∼45 min of encapsulation time, or 2–4 samples. This working time can be scaled up or down with changes to reagent volumes. However, the RT may lose activity when running for longer than 2 h. This can be mitigated by keeping the solution cool on the machine with a small ice pack that contacts the syringe without obstructing the pump. For each sample that is ran, the operator will need to use a fresh microfluidic device and p200 for cell loading. Once sample and reagents are properly flowing into the device, observations will need to be recorded in order to calculate the duration of collection required to collect 3,000–4,000 cells. To better organize these details, it is recommended to record encapsulation details in a form that standardizes the process (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig9.jpg\nFigure 9. Schematic of an example encapsulation microfluidic chip\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig10.jpg\nFigure 10. Example Encapsulation workflow form\nPlace cell tube in chilled cool rack on the inDrops station’s microscope stage.\nBegin Cell loading:\nRemove primed cell loading tip from mineral oil.\nWipe the tip of excess oil with lens paper.\nEnsure that no air bubbles are in the tip.\nPlace primed cell loading tip into cell tube, ensuring that tip is submerged and contacting the bottom of the tube.\nBegin aspiration for the cell syringe at 3000 μL/h.\nCritical: Do not allow tip to invert going forward, such that mineral oil will remain above the more dense cell solution.",
    "Monitor cell loading (no longer than 6 min/200 μL) – this can be done while skipping ahead and finishing RT and Beads.\nWhen 100–200 μL of cells have been loaded, reverse the pump and allow 20–30 s for the pump to catch up and cells to begin injecting.\nStop the cell pump. Cells are primed and ready. The cell loading tip can remain in cell tube until encapsulation begins.\nLoad BHM.\nSpin BHM at 1K × g for 1 min and remove most of the excess buffer using a p1000.\nLeave 2–5 mm above pellet to avoid aspirating beads.\nSpin BHM at 1K × g for 1 min again and remove excess buffer using a p200.\nCut a 40 cm length of tubing and attach to the end of an insulin syringe.\nCarefully hold the other end of the tubing at the bottom of the bead tube and slowly pull the syringe plunger to load beads into tubing (Figure 11[href=https://www.wicell.org#fig11]).\nThe goal is to load 25–35 cm of beads into tubing with no bubbles.\nMonitor the bead’s position in the tubing, to ensure that beads do not overfill tubing and enter syringe.\nMonitor the tubing’s position in the bead tube, ensuring that bubbles do not enter the tubing.\nWhen beads have sufficiently filled tubing (or there is no more to load without bubbles) remove the tubing from bead tube and the needle and dispose of the syringe.\nNote: It is okay and in fact helpful to have some bubbles (no longer than ∼5 mm) at the very end of the tubing from which beads are loaded. This will serve as a visual indicator of the last beads which will eventually load into the chip.\nRemove the tubing attached to the Bead oil syringe on pump.",
    "Attach the end of the bead tubing that was in the bead tube to the needle/syringe on pump.\nTrim the other (potentially damaged) end of the bead tubing that was on the needle used to load beads.\nIf beads are not fully in the end of the tubing, they can be primed using the pump at 500 μL/h, or the tubing can be trimmed back (as long as it is long enough to reach the chip with 2–3 extra cm for stage movement).\nAny beads which were not loaded into tubing can be resuspended in TET buffer and returned to 4°C storage for later use.\nBeads should now be primed and ready.\nFinalize and load RT:\nTo RT solution, add 25 μL of RNaseout! and mix by pipetting.\nTo RT solution, add 25 μL of Maxima Hminus RTase and mix by pipetting.\nCritical: Be careful not to introduce bubbles while pipetting. If significant bubbles are formed, RT solution can be briefly centrifuged to remove them.\nLoad RT solution into chilled insulin syringe with a single pull of the plunger, careful not to pull in excess air.\nCritical: Moving the plunger back and forth can slough syringe lubricant into the solution, so excessive aspiration should be avoided.\nAttach 20 cm of tubing to the needle and aspirate any air bubbles followed by 1–10 cm of RT solution into tubing.\nInvert syringe and attach to pump along with cooling tube.\nTube can be trimmed as needed to minimize excess length, just make sure to allow a few extra cm for stage movement.\nUsing pump control software, prime RT at 2000 μL/h until it reaches the end of tube and stop. RT is now primed and ready.",
    "Ensure that the Droplet oil is primed to the end of its tubing by running the pump at 2000 μL/h. All reagents should now be ready for encapsulation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig11.jpg\nFigure 11. Bead loading procedure\nPlace a cell barcoding chip on the stage and peel away the covering for a device.\nCarefully insert the cell loading tip into the Cell port.\nUsing curved forceps, insert tubes for RT, Beads, and Oil into their respective ports.\nMake sure that pumps are set for aspiration at the following rates:\nBeads at 100 μL/h.\nDroplet Oil at 400 μL/h.\nCells at 200 μL/h.\nRT at 200 μL/h.\nPosition microscope camera field of view over the droplet formation channel and start pumps.\nSolutions should begin to enter chip, ideally oil first.\nCut a 7 cm length of tubing and insert into the droplet outlet of the device. Direct the other end of the tube into a clean tube on the cold rack.\nThis tube will be for collecting emulsion prior to optimization of droplets, and thus will not be good for data generation. It can, however, be used for practice for later steps.\nContinue monitoring the solutions as they enter the chip, and displace air.\nEnsure that all solutions move unobstructed in the chip.\nAir will form bubbles with wide, dark borders in the oil.\nAs aqueous solutions begin replacing air, the droplets will have a finer interface with the oil (Figure 12[href=https://www.wicell.org#fig12]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig12.jpg\nFigure 12. Droplet channel\n(A and B) Examples of air bubbles (A) and aqueous drops loaded with beads (B).\nWatch for beads entering the chip and appearing in droplets (Figure 12[href=https://www.wicell.org#fig12]B).",
    "As beads begin loading into droplets, monitor their entrance and decrease the flow rate as they become more compact (suggest but not require adding images or words to define compact. For example, is Figure 12[href=https://www.wicell.org#fig12]B just right, too compact, too spaced out, etc?).\nIf >20% of the bead inlet still contains air, remove the bubble by pressing gently above it.\nCritical: Remove pressure very slowly so as not to pull cells and RT into the bead channel.\nLower flow rate to 50 μL/h when beads have filled the inlet.\nMonitor Droplet size and shape.\nEnsure that droplets are symmetrical and consistent.\nIncrease oil in increments of 10 μL/h if droplet length is greater than twice their width.\nIncrease oil if droplets elongate or drag to one side of the chip.\nMonitor bead loading.\nUsing the camera set to “strobe” watch droplets for doublets and estimate the fraction of droplets containing beads (# of total droplets / droplets with a bead).\nIncrease or decrease Bead flow rate in increments of 5 μL/h to adjust bead loading.\nThis will need to be monitored and may need to be adjusted throughout run.\nCheck cell loading.\nUsing the camera set to “high speed” watch cells entering the chip.\nRecord a 10 s video of cells entering the chip.\nIf all solutions are entering chip, and droplet formation and bead loading are adequate (No fluctuation in drop size and no doublets, >50% of droplets contain beads) for at least 1 min then collection can begin.\nRoute output tube into a labeled collection tube.\nStart a count-up timer and record start time.\nIf everything continues to remain stable, play cell video and count cells entering the chip.\nLower frame rate to make this easier if needed.",
    "If counting takes too long, video may need to be paused to check on encapsulation and make sure droplets are still forming adequately.\n(Cells counted for 10 s video / 10) = cells per sec.\nCalculate the collection duration needed to capture the desired number of cells. We typically aim for 3500 cells as described below.\nWatch the droplet channel in slow motion, and/or pausing to estimate the average fraction of droplets containing beads.\ni.e., If 8 drops are visible and 6 contain beads, then 6/8=0.75.\n3500 cells / (Bead loading ∗ Cells/second∗ 60 s/min).\nIdeal fraction collection time is 5–10 min. Above or below this and the library volume may be more difficult and less efficient to process.\nDetermine how many fractions to collect.\nConsider how many other samples need to be ran, if a fraction takes longer than 10 min it may be best to collect a single fraction and move on.\nContinue monitoring the encapsulation, maintaining consistent bead loading and droplet formation until a 3500 cell fraction is collected.\nIf another fraction is to be collected, route the end of the tubing into a new tube.\nIf collection for the sample is complete, stop all pumps and disconnect tubes from chip.\nDiscard cell tip with remaining cells and mineral oil.\nCover end of cell/mineral oil tubing with a capped needle if done, or another cell tip if loading additional samples.\nMove the collected emulsion tube to ice for up to ten minutes (Sample should proceed to UV cleaving and RT start as soon as timing permits).\nEncapsulation: RT and cleanup\nTiming: 1.5 h\nCollected emulsions can sit on ice a few minutes if additional samples need to be loaded, etc. but ideally should move on to UV cleavage and reverse transcription within 10 min of collection.",
    "Move collected emulsion to UV barcode cleaver and activate.\nCarefully pipette ∼500 μL of mineral oil (clear) around the sides of the tube, such that the mineral oil covers the emulsion without significantly disturbing it (Figure 13[href=https://www.wicell.org#fig13]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1849-Fig13.jpg\nFigure 13. Emulsion cleanup\n(A–E) Progress of the emulsion cleanup from (A) to (E).\nThis is crucial to prevent excessive evaporation of material in droplets.\nMove collected emulsion to UV cleaver and activate for a second exposure.\nMove the emulsion to the 50°C heat block and incubate for 1 h.\nAfter 1 h, move the tube to 85°C for 5 min to inactivate enzymes.\nMove tube to ice and allow to cool for 5 min before starting emulsion processing.\nLabel a 0.5 mL LoBind tube for each sample.\nWhen a sample is cooled, begin by removing and discarding mineral oil from above the emulsion (Figure 13[href=https://www.wicell.org#fig13]B).\nTake care not to aspirate the emulsion.\nStart with a p1000 to remove most, then follow up with a p200 to remove more.\nRemoving 100% of mineral oil is next to impossible, try to remove enough that the layer breaks and the emulsion and HFE oil can be accessed.\nCritical: Losing a drop of emulsion will lose a % of total cells, therefore it is better to retain a little mineral oil than loose the emulsion layer.\nUsing a clean new tip, slowly remove excess HFE oil from below the emulsion, then remove any additional mineral oil from above the emulsion (Figure 13[href=https://www.wicell.org#fig13]C).\nAs the emulsion collects at the bottom of the tube, remaining mineral oil may become more apparent.\nRotate the tube to find “pockets” of mineral oil above emulsion and remove them if possible.\nGel loading tips may assist in this process.",
    "Using a clean new p200 tip, carefully transfer emulsion to a clean, labeled 0.5 mL tube (Figure 13[href=https://www.wicell.org#fig13]D).\nTake care to leave remaining mineral oil behind.\nAdd 40 μL of 20% PFO to the emulsion to break droplets.\nEmulsion will become clear within 30 s as aqueous phase consolidates above the HFE oil.\nEmulsions collected longer than 10 min may require a second 40 μL to resolve.\nSpin briefly (∼10 s) on minicentrifuge (with 0.5 mL adapter).\nSolution should have 2 distinct phases with no emulsion remaining at interface (Figure 13[href=https://www.wicell.org#fig13]E).\nBeads may be visible at interface.\nUsing a p200, carefully remove and discard the HFE from beneath the aqueous phase.\nCritical: Losing a drop of aqueous phase will lose a % of total libraries.\nMove tube containing aqueous phase (barcoded cDNA) to −80°C for storage up to 6 months (Figure 13[href=https://www.wicell.org#fig13]F).\nPause point: Samples can be stored at −80°C up to 6 months until library prep (Southard-Smith et al., 2020[href=https://www.wicell.org#bib4])."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}