{
  "id": 4243,
  "origin_website": "Cell",
  "title": "Telomere length assessments of muscle stem cells in rodent and human skeletal muscle sections",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTelomere, centromere, muscle stem cell, and nuclear staining\nTiming: 2 days\nRemove one slide from each desired sample set from −20°C and warm to room temperature (25°C).\nPermeabilize sections by immersing slides in 0.5% Triton X-100 in PBS for 10 min in a coplin jar at room temperature (25°C).\nNote: The coplin jar used in this protocol holds approximately 50 mL of solution and 8 slides. If more slides must be stained, we recommend using a tissue-tek staining dish and 24-place slide holder. This alternative setup requires 200–250 mL of solution volume for adequate coverage of the slides.\nWash slides twice with PBS for 3 min each at room temperature (25°C).\nPerform heat-mediated antigen retrieval with TET buffer.\nHeat buffer to boiling in a microwave first and then transfer buffer to a coplin jar placed in a preheated steamer (95°–100°C).\nAdd slides to the coplin jar containing hot TET buffer (95°–100°C) and incubate for 10 min. Remove coplin jar containing the slides from the steamer and let it cool at room temperature (25°C) for 15 min.\nNote: Take care when handling hot solutions.\nCritical: Do not let the slides dry at any time following antigen retrieval, as doing so greatly increases autofluorescence of the tissue and will make distinguishing MuSCs difficult.\nWash slides with PBS twice for 3 min each in a coplin jar at room temperature (25°C).\nRNAse A treatment\nRemove slides from coplin jar and mark tissue boundaries with a hydrophobic/PAP pen.\nAdd sufficient RNase A (100 μg/mL) to cover tissue on the slide (100–200 μL) and cover the slide with a glass coverslip to prevent evaporation.",
    "Critical: RNase should be DNase-free. We routinely prepare RNase stock concentrations of 10 mg/mL, heat at 100°C for 10 min to destroy DNAses and then dilute to 100ug/mL in water and store at −20°C.\nIncubate slides at 37°C in a slide warmer or alternative heating source for 20 min.\nRemove coverslip and transfer slides into coplin jars containing PBS. Wash slides twice for 3 min each at room temperature (25°C).\nTelomere Staining\nPrepare hybridization buffer [adapted from (Matthiesen and Hansen, 2012[href=https://www.wicell.org#bib4])] as described in the materials and equipment[href=https://www.wicell.org#materials-and-equipment] section.\nNote: The hybridization buffer requires extensive vortexing and pipetting to get all components completely into solution. Heating or alteration of pH is unnecessary. When all components are properly dissolved, the solution will be viscous.\nPrepare TelC-Alexa Fluor 647 telomere probe and optional Cy3-CENPB centromere probe.\nDilute 5 nmol probe pellet provided by the supplier with 100uL formamide.\nAliquot in 4 μL aliquots in 1.5 mL microcentrifuge tubes and store at −80°C.\nNote: Probe is light sensitive. All steps proceeding the addition of probe should be done in the dark or low-light conditions.\nNote: Probes stored at −80°C are stable for at least several months.\nNote: We recommend using the Alexa Fluor 647-conjugated telomere probe, as it provides the least background in skeletal muscle cryosections.\nRemove telomere probe from −80°C storage, thaw, and add probe at a 1/600 dilution to the hybridization buffer (1.67 μL/mL of buffer).\nOptional: Centromere probe staining and analysis is not required, unless problems arise with abnormal nuclear architecture or DAPI staining intensities between samples. If centromere probe staining is desired, use Cy3-CENPB probe at 1/600 dilution and add it at the same time as the telomere probe above. The CENPB probe is prepared identically to the telomere probe.",
    "Heat probe(s) in hybridization buffer for 10 min at 67°C in a thermomixer or alternative heating source in the dark.\nAdd hybridization buffer containing probe to slides. We typically use 100 μL probe solution per slide. Cover slides with a glass coverslip to prevent evaporation during incubation.\nCritical: It is crucial that bubbles are kept to a minimum, as areas that are not evenly covered will not stain properly.\nIncubate slides in a Thermobrite slide warmer or equivalent heating source, according to Table 1[href=https://www.wicell.org#tbl1].\ntable:files/protocols_protocol_999_9.csv\nPreheat wash buffers I, II, III, IV to 55°C in a water bath or equivalent heating source.\nGently remove coverslips from slides after hybridization, place slides in coplin jars, and incubate with 50 mL prewarmed wash buffer I for 5 min. Keep coplin jar at 55°C during the wash process. Repeat wash once.\nContinue washing stepwise with 2 washes each (50 mL per wash) of wash buffer II, wash buffer III, and wash buffer IV, in that order, for 5 min each wash and at 55°C.\nWash slides once with PBS for 5 min at room temperature (25°C).\nMuscle Stem Cell Staining\nBlock sections in 50 mL antibody blocking buffer for 1 h at room temperature (25°C).\nIncubate slides in cold (4°C) blocking buffer with VCAM antibody (1/100 dilution); stock antibody concentration 1 mg/mL, in a dark, humidified staining chamber overnight (16 h) at 4°C. We use 100 μL of antibody solution per slide. Cover slides with a coverslip to ensure even coverage of antibody solution.\nWash slides the following day in coplin jars with 50 mL PBS, twice, 5 min each at room temperature (25°C).",
    "Incubate sections for 1 h with secondary antibody (Alexa Fluor 488 Donkey anti-goat IgG; 1/300 dilution) in antibody blocking buffer at room temperature (25°C). We use 100 μL of antibody solution per slide. Cover slides with a coverslip to ensure even coverage of antibody solution.\nWash slides three times for 5 min each with PBS at room temperature (25°C). PBS washes are carried out in coplin jars and using 50 mL of solution.\nMount coverslips with Prolong gold with DAPI.\nAllow mounting media to solidify overnight (16 h) at room temperature (25°C) in the dark.\nImage acquisition\nTiming: less than 3 days\nCritical: The imaging must take place as soon as possible after staining, and imaging must be completed for all samples in as short a period of time as possible. Given the sensitivity of Q-FISH assays, minor changes in fluorescence intensities can result in skewed datasets. Even with antifade agents in the mounting medium, it is imperative to image cells of interest as quickly as possible, so we recommend completing imaging of all samples in 3 days or less.\nIdentify VCAM+ cells present in tissue sections using a Nikon Eclipse NiU widefield epifluorescence microscope.\nNote: Any widefield epifluorescence microscope with appropriate objectives, filters, and camera should be capable of completing this assay.\nNote: While VCAM1 is a good marker of MuSCs, it may also label other cells, such as endothelial cells. To prevent selecting the wrong cell types during image acquisition and analysis, we only image MuSCs in the satellite cell position (between the basal lamina and the sarcolemma). Additionally, staining with other non-muscle markers such as CD31 and CD45 (as described in Tichy et al., 2017[href=https://www.wicell.org#bib8]) could be performed to exclude such populations from the analysis.",
    "Identify VCAM+ cells (Alexa Fluor 488+) with a low power air objective (i.e., Nikon plan fluor 10×/0.30 objective).\nSwitch to a higher-powered 100× objective (i.e., Nikon plan apo100×/1.45 oil) for actual imaging and photographing cells of interest.\nIdentify the optimal exposure settings for DAPI, telomere Alexa Fluor 647 signal, and optional centromere Cy3 imaging. Troubleshooting 1[href=https://www.wicell.org#sec7.1], Troubleshooting 2[href=https://www.wicell.org#sec7.3]\nNote: Several slides should be examined before determining the optimal exposure settings. It is undesirable to have oversaturated or undersaturated pixels in any of the images. In either situation, fewer regions of interest are identified.\nCritical: Once intensity settings are determined, the exposure settings should not be changed for the duration of the particular experiment.\nProceed with multichannel imaging of VCAM, DAPI, telomere, and optional centromere signals (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/999-Fig1.jpg\nFigure 1. Representative image of a skeletal muscle cryosection processed for telomere staining\nBlue: DAPI staining. Red: telomere probe. Green: VCAM muscle stem cell marker. White: optional centromere probe staining for alternative normalization. Yellow text: DAPI, VCAM, and telomere merged image (typical processing). Cyan text: DAPI, VCAM, telomere and centromere merged image. Use of centromere probe requires telomere length normalization to DAPI. Then centromere normalization to DAPI. Finally, a ratio of the two values is generated. Scale bar: 10 μm.\nIdentify focal planes containing the most telomere signals for every cell of interest.\nA minimum of 35 VCAM+ cells should be imaged per biological sample.\nSave multichannel images in raw file formats to maintain metadata. For Nikon Elements software, this is a .nd2 file.\nImage as many cells as possible during scheduled equipment usage hours from the biological samples. Troubleshooting 3[href=https://www.wicell.org#sec7.5]",
    "Optional: Obtaining z-stacks and flattening with an extended depth of focus algorithm will provide more telomere and optional centromere foci per cell, but a single focal plane with many foci in focus is sufficient to yield useable data for analysis.\nNote: Imaging more VCAM+ cells will produce a better representation of the population of MuSCs throughout the muscle. Ensure that more than one muscle section is examined per slide.\nNote: If imaging of all desired cells from all samples cannot be completed in one day, stagger the genotypes/treatments during imaging to ensure fading that occurs between imaging sessions will be similar between the groups.\nNote: It is best to avoid imaging/assessing cells of interest that are positioned on top of or below other cells/nuclei, as telomere length quantitated from overlapping cells may confound the datasets.\nExport raw image files in two groups.\nEach channel should be first exported as grayscale/monochrome 16-bit .tiff images for analysis.\nA merged 8-bit color .tiff image is also exported to identify cells of interest (VCAM+) for later analysis.\nPause point: After all needed images are collected, downstream analysis can be conducted at the end user’s leisure.\nCryosection MuSC-fluorescent in situ hybridization (CRYO MuQ-FISH) telomere length data collection and analysis\nTiming: varies based on sample size. Several hours to several days.",
    "Telomere length is measured using a semi-automated ImageJ-based platform known as Telometer. Telometer provides step-by step instructions to analyze 16-bit monochrome images for telomere length. The premise involves creating a project that is saved on a local machine, identifying cells of interest, and measuring the intensity of telomeres, relative to the total DAPI intensity of that cell. The readout from Telometer produces both total sum intensity of telomeres, which can be normalized to DAPI intensity to account for differences in cell cycle position, as well as the mean intensity of telomeres, which can also be normalized to DAPI. Should nuclear architecture or staining be compromised, telomere measurements can instead be normalized to centromere intensities. In this fashion, Telometer steps are conducted twice. Once, where the telomere signal is assessed relative to DAPI, and then those same cells of interest are analyzed a second time, where the centromere intensities are measured instead of the telomere intensities. The ratio of these measurements would then be used for dataset readouts.\nOpen Telometer software and create a new project in the “Admin” tab (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/999-Fig2.jpg\nFigure 2. Processing cells of interest for telomere analysis by Telometer\n(A) Telomere radio button depicting different options for data acquisition and analysis.\n(B) Representative monochrome image of telomere image from Figure 1[href=https://www.wicell.org#fig1]. Yellow box is the region chosen for background normalization.\n(C). Representative DAPI monochrome image from Figure 1[href=https://www.wicell.org#fig1]. Yellow box is the region chosen for background normalization.\n(D) Thresholding of telomere channel to determine optimal balance between telomere foci identification with the least background.\n(E) Selection of VCAM+ nucleus from Figure 1[href=https://www.wicell.org#fig1] by manually outlining when prompted by the software.\n(F) Naming of a selected VCAM+ nucleus.\n(G) Masked image used for data analysis by Telometer.",
    "(H) Selected data outputs provided by Telometer analysis. Cell ID: unique identifier for a particular cell that was analyzed. Experiment name: selected at beginning of analysis (project name). Scoring Name (Tag): prefix added to dataset. Usually the date of analysis. Sum (DAPI): measured DAPI total intensity. Sum (Telomere): Total measured telomere intensity. Mean (Telomere): Mean intensity of Telomere signal per nucleus. Telomere Sum/DAPI Sum (Percent): Value used to graph datasets.\nClick the “Score” tab and follow the on-screen instructions for each step.\nSelect the Project name for your analysis grouping and the Preset objective (in this case 100× telomere) and subtract Cy3 background. The scoring tag adds metadata to the analysis. We do not usually alter this.\nSelect the Telomere 16-bit monochrome exported tiff image when prompted for opening the first image.\nNote: Telometer defaults as the telomere signal being a Cy3 image. In this protocol, the telomere image is the Alexa Fluor 647 channel image, and it is this image that is opened first when prompted.\nNext, open the DAPI 16-bit monochrome exported tiff image when prompted.\nNormalize the Telomere image by clicking and forming a box of any size in an area absent of features and click “normalize” (Figure 2[href=https://www.wicell.org#fig2]B).\nRepeat normalization for the DAPI image when prompted (Figure 2[href=https://www.wicell.org#fig2]C).\nContinue following software prompts for creating masked images to narrow down regions in the image that contain telomere foci.\nThreshold the masked image, if necessary, when prompted to obtain the greatest telomere foci in the image with the least background (Figure 2[href=https://www.wicell.org#fig2]D).\nNote: The Telometer software typically does a decent job with auto-thresholding, so the investigator does not often need to further threshold.",
    "Manually draw a circle encompassing a nucleus of interest when prompted. Refer to the color image to determine which nuclei are clearly VCAM+ and designate the nucleus of interest. Selection of VCAM nuclei should only occur for cells in the satellite cell position (between the basal lamina and sarcolemma). Name the nucleus as desired (Figure 2[href=https://www.wicell.org#fig2]E).\nSelect the “+ Add Nucleus” button. Repeat for additional VCAM+ cells in the image, if any. Click the “next” button (Figure 2[href=https://www.wicell.org#fig2]F).\nOptional: Telometer next gives the option to separate conjoined telomere foci (if counting telomere number) and manually remove halo artifacts from out of focus light. These functions are completely optional for the analysis.\nSelect “complete.” The data will be stored on your local machine. To view images at a later time that have been processed and analyzed, select the “View” option in the Telometer tab (Figure 2[href=https://www.wicell.org#fig2]G).\nRepeat step 15–23 for remaining images to analyze. Ensure that they are being saved in the proper project data file and appropriately named.\nExport data to copy into excel (Figure 2[href=https://www.wicell.org#fig2]H).\nIn the “Export” tab of Telometer, select the project name for data export.\nClick the “Scoring” button that has an arrow.\nSelect all data under “Scorings” and click the “Cells” button that has an arrow.\nSelect all data under “Cells” and copy and paste into Excel or other spreadsheet software. Ensure that you also note the headings for each column. Troubleshooting 4[href=https://www.wicell.org#sec7.7]\nTo analyze datasets using the Telomere sum option, refer to the last column of the dataset. It represents the telomere sum intensity divided by DAPI sum intensity formula∗100.\nOptional: If telomere mean intensities are desired per cell instead of total (sum) intensities, calculate this value by dividing the datasets in the Telomere Mean column by its respective DAPI Sum.",
    "Optional: If one desires to normalize to centromere intensity instead of DAPI intensity, the procedure for telomere analysis is repeated, but instead of using the Telomere images on prompt to open, the centromere images are opened instead. The nuclei should be named and selected similarly in the same order as the telomere analysis. Then the last column of data from the telomere analysis is divided by the last column of centromere data analysis. Troubleshooting 5[href=https://www.wicell.org#sec7.9]\nGraph datasets as desired in Graphpad prism. Data can be graphed as total intensity values, or data can be graphed as histograms to demonstrate minor shifts of telomere length within the populations (Figure 3[href=https://www.wicell.org#fig3]). Troubleshooting 6[href=https://www.wicell.org#sec7.11]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/999-Fig3.jpg\nFigure 3. Example graphical plots from Telometer analysis\n(A) CRYO MuQ-FISH Telomere Sum Intensity/DAPI Sum Intensity (Percent) data graphed from 2 different mouse genotypes subjected to chronic injury. Note the significant reduction of telomere lengths in genotype 2. Genotypes depicted in this figure are those used in our companion article (Tichy et al., 2021[href=https://www.wicell.org#bib7]) and are control and IKK2CAMuSC mice subjected to chronic injuries.\n(B) CRYO MuQ-FISH data binned in Microsoft Excel from (A) and plotted as percent of cells per mouse and per genotype. Bins are arbitrarily assigned. Note that the shift of the population of genotype 2 to the left is indicative of telomere shortening.\n(C) CRYO MuQ-FISH Telomere Mean Intensity/DAPI Sum Intensity (calculated percent) from analysis in (A).\n(D) Histogram representation of data from (C). For all graphs, N=3 mice per genotype, with a minimum of 35 cells imaged per mouse. Depicted are mean ± SEM. ∗∗∗∗ p<0.0001.",
    "Note: The telomere and centromere probes are probes that recognize mammalian DNA sequences and are functional in other species, including samples from rat and human. We have found that this protocol is compatible with muscle tissues of human and rat skeletal muscle cryosections (Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5]). We also examined the adaptability of this protocol to several other tissue types (spleen, liver, kidney, testicle, and colon) and found this protocol does appropriately label telomeres in all tissues examined (Figure 5[href=https://www.wicell.org#fig5]), increasing the impact and usability of this method. However, in such tissues, it may be necessary to utilize thinner sections or more advanced microscopes (confocal microscopy), given the increased number of focal planes exhibiting telomere foci observed.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/999-Fig4.jpg\nFigure 4. Application of CRYO MUQ-FISH to human skeletal muscle samples reveals compatibility of the method with human tissues\nCryosections were stained with the endothelial marker CD31 and processed for CRYO MuQ-FISH. Scale bar: 10 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/999-Fig5.jpg\nFigure 5. Assessment of CRYO MuQ-FISH protocol translatability to additional tissue and organism types\nScale bar: 10 μm. Note- background was left intentionally higher to demonstrate surrounding tissue architecture. Adult 17-month-old male Sprague-Dawley rat tissues were collected and processed identically as described in the CRYO MuQ-FISH protocol and imaged for telomere signal and DAPI. We found this protocol capable of staining telomeres in tissues of the tibialis anterior muscle, colon, liver, kidney, spleen, and testicle. Scale bar: 10 μm."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Microscopy",
    "Cell Biology",
    "Cell-Based Assays",
    "In Situ Hybridization"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}