{
  "id": 1615,
  "origin_website": "Cell",
  "title": "A protocol to quantify chromatin compaction with confocal and super-resolution microscopy in cultured cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nWe begin by describing how to culture and treat HeLa cells with Actinomycin D. We then illustrate the protocols for staining DNA with DAPI for confocal microscopy, for labeling DNA through Click Chemistry for STORM, and for immunostaining of H3K9me3 for STORM. Next, we describe the protocol for imaging acquisition, both for confocal imaging and STORM imaging. Finally, we explain the workflows for the analysis and quantification of acquired images through customized codes for ImageJ and MatLab.\nFor a global overview of the step-by-step workflow see Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1051-Fig1.jpg\nFigure 1. Diagram of the workflow for chromatin compaction quantification\nCell plating, synchronization, and treatment\nTiming: 3 days\nCritical: Cell culture needs to be performed entirely under a Class II Biological Safety Cabinet to avoid contamination.\nNote: Pre-warming the complete cell culture medium and Trypsin-EDTA is recommended to avoid exposing culture cells to excessive thermal shift and minimizing detachment time, respectively.\nCells are seeded in 8-well chambers and allowed to attach for 24 h before challenging them with drug treatments or other experimental conditions that may induce changes in the degree of chromatin compaction.\nDetach HeLa cells from maintenance cultures in T75 flasks or p10 dishes.\nDiscard exhausted culture medium.\nWash gently with 5 mL of PBS, and discard.\nAdd 1 mL Trypsin-EDTA (0.25%), phenol red to each flask.\nIncubate flasks for 3 min at 37°C in cell incubator.\nNote: As detachment time can vary considerably with cell type, the plate should be visually inspected for complete cell detachment before proceeding.\nNote: Tapping gently on the sides of the flask/dish can favour the detachment.\nAlternatives: Trypsin without Phenol Red/Versene can be employed as an alternative agent for cell detachment.\nAdd 9 mL of complete culture medium and pipette gently up and down do disaggregate cells.",
    "Collect detached cells in 15 mL Falcon tubes.\nHeLa cells counting.\nCount cells with a standard or automated cell counter.\nPrepare a cell suspension to achieve 1 × 105 cells/mL.\nPut in a 15 mL Falcon the volume of cell suspension containing 800 000 cells.\nDilute it with complete culture medium until reaching the volume of 8 mL.\nNote: The suggested protocol is sufficient to plate 3 chamberslides at the density of 37 500 cells/cm2. In the case of using different cell lines and biological treatments, we recommend scaling up/down the cell density as well as the volumes for culturing cells into higher/lower number of wells. Particular attention should be taken in modifying density plating, since this protocol requires cells to be in a monolayer when imaged and superimposition of nuclei would compromise the analysis.\nNote: To perform DAPI confocal imaging or H3K9me3 STORM imaging proceed to step 3, then to steps 5a and 6a. To perform EdC incorporation for DNA STORM imaging proceed directly to step 4, then to steps 5b and 6b.\nHeLa seeding for DAPI confocal imaging or H3K9me3 STORM imaging\nSeed 350 μL of this suspension in 8-well chambers and return plates to the incubator.\nHeLa seeding for DNA STORM imaging\nAdd 4 μL of EdC 10 mM solution to the 8 mL of cells suspension (1:2000 dilution, final concentration 5 μM).\nSeed 350 μL of this suspension in 8-well chambers and return plates to the incubator.\nAlternatives: For steps 3 and 4, Borosilicate glass bottom 8-well chambers (Ibidi, #80827) can be used alternatively to Borosilicate glass bottom 8-well chambers (Lab-Tek, #155411), but volumes per well should be adjusted to maximum 250 μL to avoid spill-over. Adjust concentration of cell suspension accordingly.\nSerum-starvation of HeLa cells",
    "After 24 h from seeding, replace culture medium in all wells with 350 μL of pre-warmed resting medium for DAPI confocal imaging or H3K9me3 STORM imaging.\nFor wells designated to DNA STORM imaging, replace culture medium with 350 μL of pre-warmed resting medium plus EdC in the dilution of 1:2000, as the day before.\nNote: Step 5 can be skipped if cell cycle arrest is not required for your experimental design.\nHeLa cells treatment with ActD (5 h)\nAfter 43 h from seeding, replace resting medium in all wells with 350 μL of fresh resting medium plus ActD at 1:1000 dilution (final concentration 5 μg/mL).\nFor wells designated to DNA STORM imaging, also add EdC in the dilution of 1:2000, as the days before.\nAlternatives: Different treatment lengths and concentrations or alternative drug treatments can be performed at this stage. Adjust timing and drug concentration accordingly.\nAlternatives: If you wish to compare experimental conditions other than drug treatments (for example, genetically modified cell lines), steps 5 and 6 can be skipped.\nCell fixation, permeabilization, and staining\nTiming: 2 days\nAfter 5 h of ActD incubation, or corresponding alternative treatment, HeLa cells are subjected to fixation, permeabilization and labeling for IF microscopy-based assessment of DNA compaction and STORM microscopy-based assessment of DNA-free areas and H3K9me3 redistribution.\nNote: Optimal fixation and permeabilization conditions may vary with cell type.\nNote: Fixative solution should be at 20°C–25°C before being added to the cells, as cell fixation should be carried out at 20°C–25°C.\nFixation.\nDiscard medium.\nWash 3 × 5 minutes with PBS.\nFix cells with 300 μL of PFA 4% for 10 min at 20°C–25°C.\nWash 3 × 5 minutes with PBS.",
    "Pause point: Fixed cells can be stored (before staining) for up to 1 month at 4°C, provided that chamber lids are covered with 400 μL PBS and that plates are sealed with parafilm to avoid PBS evaporation. In this case, wells should be visually inspected to ensure normal cellular morphology and absence of contamination before resuming the protocol. Also, bring cells to 20°C–25°C before proceeding with permeabilization.\nPermeabilization.\nPermeabilize with Triton 0.4% for 15 min.\nWash 3 × 5 minutes with PBS.\nNote: For Click-chemistry reaction for DNA STORM imaging of EdC labelled cells proceed to step 9, then to step 13 (STORM imaging).\nNote: For immunostaining of H3K9me3 and STORM imaging, proceed to step 10, then to step 13 (STORM imaging).\nNote: For DAPI labeling for confocal imaging proceed directly to step 11, then to step 12 (confocal imaging).\nClick Chemistry reaction for DNA STORM imaging.\nIncubate cells with Click Chemistry solution for 30 min protecting samples from light.\nWash with PBS three times for 5 min each protecting samples from light.\nProceed directly with STORM imaging (step 13) or store at 4°C until imaging.\nImmunostaining for H3K9me3 STORM imaging.\nIncubate wells with blocking buffer for 1 h at 20°C–25°C.\nIncubate wells with Rabbit polyclonal anti-H3K9me3 diluted in blocking buffer 1:50 for 12–16 h at 4°C.\nWash with Washing buffer three times for 5 min each.\nIncubate cells with 1:250 Goat anti-Rabbit IgG AF647 in blocking buffer for 1 h at 20°C–25°C in the dark.\nNote: From now on, keep the chamberslides in the dark to avoid bleaching of the AF647 fluorophore.\nWash secondary antibody with Washing buffer twice for 5 min each.\nWash once in PBS.\nProceed directly with STORM imaging (step 13) or store at 4°C until imaging.\nDAPI staining for DNA confocal imaging",
    "Incubate wells with Blocking buffer plus DAPI diluted 1:1000 in PBS (final concentration 1 μg/mL) for 15 min at 20°C–25°C in the dark.\nWash three times with PBS.\nAlternatives: Hoechst 33342 at a 1:1000 dilution can be employed as an alternative agent for DNA staining instead of DAPI. Also, DNA labeled with EdC-AF647 can be imaged with confocal imaging.\nSlight changes in the concentration of the dye (in the range of 1:500 -1:2000) are not crucial for the positive outcome of the protocol as far as the adjusted concentration is kept constant across all conditions and biological replicates.\nPause point: Stained cells can be stored for up to 2 days at 4°C in the dark, provided that chamber lids are covered with 400 μL PBS and that plates are sealed with parafilm to avoid PBS evaporation. In this case, wells should be visually inspected to ensure normal cellular morphology and absence of contamination before resuming the protocol. Also, cells should be inspected for abnormalities in cell density and in fluorescent signal and intensity before proceeding with imaging (see troubleshooting 1[href=https://www.wicell.org#sec7.1]).\nImage acquisition\nTiming: 1 h (Confocal) to 2 days (STORM)\nStained chambers are mounted onto the microscopes (Confocal and STORM respectively) and images are acquired.\nConfocal microscopy imaging.\nSet parameters of image acquisition for the corresponding image size and zoom. We suggest to use an image size of 1024 × 1024, pinhole 1, scan speed 400 Hz, bidirectional scan, and a zoom of 1, in order to have around 50 nuclei per field at a high resolution.",
    "Adjust laser power and gain for the DAPI channel to satisfy the dynamic range of the experiment by imaging at least 10 fields per condition. We normally use a laser power in a range between 10%–20% and a gain between 300–600V, and we suggest adjusting these parameters if needed, as far as they are kept constant across the whole experiment.\nVisually inspect the objective for proper state. Place one drop of Type F oil (Leica) (RI 1.518) in the center of the objective lens.\nQuickly but carefully, mount the chamber on the stage-holder.\nAdjust the focus on the central stack of the cells and proceed with image acquisition. Repeat the step for at least other 9 fields per condition, in order to have enough nuclei to analyze.\nCritical: Laser power and gain should be adjusted to prevent DAPI signal saturation even in the brightest condition.\nCritical: Good quality confocal images are critical for further analysis. Thus, prior training of confocal imaging and microscope setup are required. Specifically, images are considered of good quality when nuclei are in focus, signal is well detectable in all nuclei but not saturated, and the field is illuminated homogeneously.\nPause point: Images can be stored indefinitely prior to analysis.\nSTORM imaging\nVisually inspect the objective for proper state. Place one drop of Type F oil (Nikon) (RI 1.515) in the center of the objective lens.\nQuickly but carefully, mount the chamber on the stage-holder.\nReplace PBS with freshly prepared STORM imaging buffer in the well to image.\nSet camera to 17 MHz, EM Gain 100V and image size to 256 × 256 pixels.",
    "Detect the AF647 fluorescence in the sample by using a laser compatible with AF647 fluorophore excitation (peak at 647 nm) and starting at a low power coupled with a 100 ms exposure, to avoid blinking and sample bleaching. Adjust focus and illumination angle for optimal signal on the central stack of the cells.\nTake a single snapshot of the nucleus/nuclei to be acquired. It can be used for further detection of nuclear structures (e.g., nucleoli), as well as for assaying the intensity of fluorescence prior to single-molecule acquisition.\nSet the camera exposure time at 10 ms and increase the 647 nm laser power to 2 kW/cm2 approx., to visualize single molecule blinking.\nLaunch image acquisition with simultaneous illumination of the sample with 647 nm and 405 nm lasers. Specifically, 647 nm laser was used at constant ∼2 kW/cm2 power density and 405 nm laser power was gradually increased over the imaging, from 0.005 kW/cm2 to 0.5 kW/cm2. Typically, 60 000 frames were acquired and at least 10 fields were imaged per condition.\nGenerate localization lists from STORM images and perform drift correction with Insight3 (Huang et al., 2008[href=https://www.wicell.org#bib2]) or Nikon NIS elements by selecting the command “Automatic drift correction”. In Insight3, select “Save Molecule List”, and a .bin file will be generated. To generate .bin files in NIS elements, go to Input & Output in the Molecule analysis section. Select Export and choose “Export to BIN file (M425)”.\nTo generate .bin files of individual selected nuclei in Nikon NIS elements go to Molecule analysis, Turn ON ROI button, open ROI Menu and select “Draw Bezier ROI…”. Check “Autofit ROI” option. Click “Process All Frames”. Export .bin file as described in point i).",
    "Note: We recommend the use of 405-nm laser activation during acquisition to maintain a good rate of single molecule blinking per frame throughout the entire image acquisition (approx. 30–50 localizations per frame). Nevertheless, EdC-AF647 signal typically does not require 405 nm laser activation during acquisition as enough single molecules are detected per frame.\nCritical: Discard STORM imaging buffer every hour by aspiration with a pipette and replace it with freshly prepared buffer as buffer acidifies with time. Imaging buffer should be added at 20°C–25°C.\nCritical: Replace STORM imaging buffer with PBS and store samples in the dark at 4°C when not performing imaging.\nCritical: Good quality STORM images are critical for further analysis. Thus, prior training of STORM imaging, image processing and STORM microscope setup are required. More in details, STORM images are considered of good quality when nuclei are in focus, density of localizations is consistent among images belonging to the same experimental condition, there is no significant background noise, and the field is illuminated homogeneously.\nCritical: DNA-free areas and Edge analyses require .bin files as input. In case localization lists are generated with a software different from Insight3 or NIS elements, export data in .bin format and verify that the structure of the file is compatible with downstream analyses.\nCoefficient of variation analysis\nTiming: 2 h\nFor step-by step visual guide of the protocol please refer to Methods videos S1[href=https://www.wicell.org#mmc4].\nSingle-channel confocal microscopy images are processed for the assessment of chromatin compaction through the measurement of the coefficient of variation.\nNote: (Fiji Is Just) ImageJ imaging software is employed to perform this automated analysis.\nNote: Before to begin, create one folder containing the .tiff files to be analyzed and the script FIJI_MACRO_CV.txt, contained in Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1051-Mmc1.extension].",
    "Output files will be saved automatically in the same folder. The name of the output file will include both the name of the source image and the index of the selected ROI.\nNote: We also suggest generating a shortcut for the command “Run” to make the process of analysis even faster. To do this, select from (Fiji Is Just) ImageJ menu: > Plugins > Shortcuts > Add Shortcut…, and associate the Command “Run…” to the Shortcut of your preference.\nIn that case, step 14b will be substituted by “Click your personalized Shortcut for the command “Run…”.\nIdentification of single nuclei and generation of cropped single nuclei .tiff files.\nOpen one single-channel .tiff image.\nPlugins > Macros > Run…\nRun FIJI_MACRO_CV.txt.\nCheck generated masks if they correctly match single nuclei.\nVisually inspect if masks generated are correct.\nIf yes, > Close all.\nIf not, in FIJI_MACRO_CV.txt change the minimum and maximum threshold values set to generate the masks:\nOpen the .txt.\nIn line 10,\n> //setThreshold(12, 255);\nthe former parameter (i.e., “12”) is the threshold of the minimum intensity value detected by the mask, while the latter (i.e., “255”) is the threshold of the maximum intensity one. Change value “12” with customized values between 0 and 255 adapted to your particular condition. Note that lowering the minimum intensity value (i.e., <”12”) would allow the detection of weaker signal, while increasing it (i.e., >”12”) would increase the stringency. The maximum intensity value should be kept as “255”, to include the broadest range of intensity in the image.\nSave modified .txt.\nRe-analyze images from step 14.",
    "Note: Although this code has been successfully tested on several different conditions, we are aware that the density of cell seeding and the quality of labeling can both affect the recognition of nuclei performed by FIJI_MACRO_CV.txt script. For this reason, we recommend modifying the ROI analyzed (see troubleshooting 1[href=https://www.wicell.org#sec7.1]) and the command “Watershed” if needed (see troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nNote: If after applying troubleshooting 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5] some nuclei are still incorrectly identified, these can be discarded easily in step 15 by checking the mask numbers associated to them and eliminating the correspondent .tiff files in the folder.\nRun step 14 and step 15 for every image you want to analyze.\nNote: We recommend analyzing at least 5 images per condition for a total of at least 100 nuclei per condition, and multiple biological replicates (at least 3).\nCalculation of the Coefficient of Variation.\nOpen MatLab software.\nOpen the MATLAB_CV_Confocal.m script, contained in Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1051-Mmc1.extension].\nChange the following parameters according to your experiment:\n>categ =; with the number of experimental conditions.\n>Folder = ; with the path of the data folder given as a string.\n>categname = ; with the names of the experimental categories given in cell format.\n>colors =[] ; with a 3-columns matrix with the color code for each category in each subsequent row. You can use predefined functions as>colors = colormap(jet());to define color series.\nClick Run.\nLoad the single nuclei .tiff files generated in step 15. One different window will open for each category.\nClick Done.",
    "Two pop-up windows with graphic representations of the results will appear. Figure 1[href=https://www.wicell.org#fig1] represents the distribution of pixel intensities of single cells (“CV_Histplot_individualcells”) (see Methods videos S1[href=https://www.wicell.org#mmc5], 00:02:34), while Figure 2[href=https://www.wicell.org#fig2] plots the mean and standard deviation of the distribution of pixel intensities for each category (“CV_Histplot_smooth”) (see Methods videos S1[href=https://www.wicell.org#mmc4], 00:02:36).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1051-Fig2.jpg\nFigure 2. Schematic view of the code to crop images in batch (left) of the corresponding subROI selection (right)\nIn the Command Window, the line\n>Do Boxplot (Y/N)>will appear.\n Write “Y” (Yes) to additionally visualize the boxplot of the CV calculated (“Coefficient_Variation_Boxplot”) or “N” (No) to skip the visualization, and press Enter. All the .fig visualized, plus the .xls output file generated and the CV workspace are automatically saved in your folder of choice defined in step 17) c) ii).\nDNA-free area analysis\nTiming: 1 h\nFor step-by step visual guide of the protocol please refer to Methods videos S2[href=https://www.wicell.org#mmc5].\nSingle-color STORM microscopy images of EdC-AF647 labeled DNA are processed for the assessment of chromatin compaction through the measurement of the percentage of DNA free areas. The same procedure can be applied for STORM images of core histones or histone modifications.\nCalculation of the percentage of DNA-free areas\nOpen MatLab software.\nOpen Main code: “BlackSpace_MAIN”, contained in Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1051-Mmc2.extension].\nChange the following parameters according to your experiment:\n>categ =; with the number of experimental conditions.\n>Directorio = ; with the path of the data folder given as a string.\n>categname = ; with the names of the experimental categories given in cell format.\nCheck and adjust to image dimension by defining >maxX = ; >maxY = ; values (e.g., 256 or 512 pixels).",
    ">h = fspecial('gaussian',[5 5], 2); (line 44) with “2” being the value of Gaussian sigma recommended. Adjust it if needed depending on your dataset. Increasing the value will increase the level of blurring of the image from which the masks of DNA and nucleus are generated.\n>MaskDNA = imbinarize(Dens,'adaptive','Sensitivity',0.001); (line 48) with “0.001” being the value of adaptive threshold recommended. Adjust it if needed depending on your dataset.\nClick Run.\nLoad .bin files for each experimental category.\nClick Done.\nOne pop-up window with graphic representations of the results will appear for each analyzed file. Each figure is a panel displaying the density rendering of the nucleus, the DNA mask and the nuclear mask generated.\nCalculated values of percentage of DNA-free areas are automatically saved as the .xls file called “Blackspace_results.xlsx” in your folder of choice defined in step 18) c) ii).\nNote: Although this code has been successfully tested on several different conditions, we are aware that the quality of labeling and alternative DNA distributions across cell types can affect the generation of nuclear masks and the identification of DNA-free areas performed by this script. For this reason, we recommend to visually verify the generated masks and modify the adaptive threshold value, pixel size and Gaussian sigma if needed (see troubleshooting 3[href=https://www.wicell.org#sec7.5]).\nNote: We recommend analyzing at least 10 images per condition.\nEdge analysis\nTiming: 1 h\nFor step-by step visual guide of the protocol please refer to Methods videos S3[href=https://www.wicell.org#mmc6].",
    "Single-color STORM microscopy images of H3K9me3 are processed for the assessment of chromatin compaction through the measurement of the percentage of localizations found at the nuclear edge versus the total number of nuclear localizations. The same procedure can be applied to STORM images of any nuclear staining (for example: core histones, lamins, DNA) to quantify differences in signal enrichment at nuclear edge.\nCalculation of the percentage of localizations at nuclear edge and nuclear interior\nOpen MatLab software.\nOpen Main script: \"edgeLocDensity_main.m\", contained in Data S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1051-Mmc3.extension].\nChange the following parameters according to your experiment:\n>categ =; with the number of experimental conditions.\n>Folder = ; with the path of the data folder given as a string.\n>CategLabels =; with the names of the experimental categories given in cell format.\n>colors =[]; with a 3-columns matrix with the color code for each category in each subsequent row. You can use predefined functions as >colors = colormap(jet());to define color series.\n>SR_px = ; with the size of super resolved pixels. We recommend starting with the value “20” and change it if needed.\n>NPx_edge = ; with the width in pixels of the edge mask desired. We recommend starting with the value “50”and adjust it if needed depending on your dataset. Note that very small values could cause a partial loss of the enrichment while too high values would cause the inclusion of also the inner part of the nucleus, not-being specific for the edge area anymore. Both conditions would cause an error of underestimation of the percentage of enrichment.\n>nmperpx = ; with the original pixel size in nm. Adjust this value (e.g., “160”) depending on the microscope model.",
    ">sigma = ; with the desired Gaussian Sigma value. We recommend starting with the value “1.5”. This parameter regulates the degree of blurring of the signal from which the nuclear mask is generated (the lower the value, the higher the stringency). If the signal of the protein labeled is not present across the whole nuclear area, we suggest to increase the value of blurring (lowering the stringency) in order to avoid the generation of artifactual holes.\nClick Run.\nLoad .bin files for each experimental category.\nTwo pop-up windows with graphic representations of the results will appear for each analyzed file. Figure 1[href=https://www.wicell.org#fig1] is the super resolution image of the nucleus, while Figure 2[href=https://www.wicell.org#fig2] is a panel including the nuclear mask, the edge mask, and their overlay.\nIn the Command Window, the line >Do Density rendering (Y/N)>will appear. Write “ Y” (Yes) to visualize additionally the density renderings or “N” (No) to skip the visualization and press Enter.\nCalculated values of percentage of localizations at nuclear edge and nuclear interior, as well as average and median density values, are automatically saved in a single file called ‘EDGE_analysis_results.xlsx’ in your folder of choice defined in step 19) c) ii).\nNote: Although this code has been successfully tested on several different conditions, we are aware that the quality of labeling can affect the generation of nuclear masks performed by this script. For this reason, we recommend to visually verify the generated masks and change the Gaussian sigma if needed (see troubleshooting 4[href=https://www.wicell.org#sec7.7]).\nNote: We recommend analyzing at least 10 images per condition."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Cell Biology",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}