{
  "id": 15002,
  "origin_website": "Jove",
  "title": "Using Next Generation Sequencing to Identify Mutations Associated with Repair of a CAS9-induced Double Strand Break Near the CD4 Promoter",
  "procedures": [
    "1. Cell plating\nGrow HFK LXSN and HFK 8E6 cells in 10 cm plates in keratinocyte culture media (10 mL/plate) with human keratinocyte growth supplement (HKGS) and 1% penicillin/streptomycin. Grow cells to about 80% confluence at 37 °C in a jacket incubator with 5% CO2.\nReplace culture media with 3 mL of trypsin-EDTA (0.05%, ethylenediamine tetraacetic acid). Incubate at 37 °C for 3 min. Neutralize trypsin with equal volume of fetal bovine serum (FBS) supplemented media and transfer cells to a 15 mL centrifuge tube. Centrifuge at 300 x g for 5 min.\nResuspend cells with 10 mL of keratinocyte culture media with HKGS. Determine the concentration of cells with a hemocytometer.\nPlate 4 x 105 cells/6-cm plates (seed two plates for HFK LXSN and two plates for HFK 8E6) in 4mL of keratinocyte culture media with HKGS and 1% penicillin and streptomycin. Grow at 37 °C in a jacket incubator with 5% CO2.\n\tNOTE: Analysis of HFK cells was chosen for this protocol for two reasons. First, HFK is a difficult to transfect cell line. Thus, by demonstrating that the protocol works in this cell line, evidence is provided that it will likely work in more commonly used and more readily transfected cells. Secondly, previously published data demonstrate that a viral protein (8E6) hinders the repair of double strand breaks in DNA20,21,22. Thus, comparing HFK LXSN and HFK 8E6 allows us to demonstrate the ability of the assay to detect increases in mutations associated with a reduction in cellular repair capacity.\n2. Transfection\nOn the day of transfection (24 h after plating), replace media with 3 mL of antibiotic-free supplemented media. Incubate for 2 h at 37 °C in a jacket incubator.\nTransfect cells with appropriate lipid-based transfection reagents according to the manufacturer's instructions.",
    "Warm transfection reagents to room temperature and pipette gently before using.\nFor each cell line (HFK LXSN and HFK 8E6), place appropriate amount of transfection buffer (as directed by the manufacturer) in a sterile 1.5 mL centrifuge tube (Tube 1). Include another tube with the same amount of transfection buffer (mock transfection or Tube 2).\nAdd 2 µg of plasmid DNA expressing CAS9/sgRNA targeting human CD4 (px330-CD4, 5'- GGCGTATCTGTGTGAGGACT) to Tube 1 from step 2.2.2. Pipette gently to mix completely. Add equal volume of sterile water to Tube 2.\nInclude a control plate with transfection reagents alone (no plasmid) for each cell line.\n\t\tNOTE: The second plate serves as a negative control in the experiment, allowing the user to confirm that transfection with the CAS9/sgRNA are not responsible for any mutations.\nAdd appropriate amount of the transfection reagent (as directed by the manufacturer) to the tube with DNA mixture (Tube 1) from step 2.2.3 and the mock transfection (Tube 2) from step 2.2.2. Pipette gently to mix completely. Incubate at room temperature for 15-30 min to allow sufficient time for complexes to form.\nAdd the transfection mixture drop-wise to the plate. Gently rock the culture for 1 min to evenly distribute the transfection mixture.\nIncubate for 48 h after the transfection to allow CAS9 expression.\nHarvest cells by trypsinization.\n\t\nReplace culture media with 1 mL of trypsin-EDTA (0.05%, ethylenediamine tetraacetic acid). Incubate at 37 °C for 3 min. Neutralize trypsin with equal volume of FBS supplemented media.\nFor each plate of cells, transfer the cell suspension to two microcentrifuge tubes with equal aliquots. Centrifuge at 300 x g for 5 min.",
    "Resuspend the cell pellet from one tube in step 2.4.2 in 1 mL of phosphate buffered saline (PBS) for sequencing. Resuspend the other tube from step 2.4.2 with ice-cold PBS for immunoblot.\nHarvest the whole cell lysates for immunoblot.\n\t\nCentrifuge the tube at 300 x g for 5 min. Discard the supernatant.\nAdd 100 µL radioimmunoprecipitation assay buffer (RIPA lysis buffer) mixed with 1 % protease inhibitor and 1% phosphatase inhibitor into the tube, mix thoroughly with a pipette and incubate for 10 min on ice.\n\t\tNOTE: RIPA lysis buffer contains 10 mM Tris-HCl, pH 8.0; 1 mM EDTA; 0.5 mM EGTA; 1% Triton X-100; 0.1% Sodium Deoxycholate; 0.1% SDS; 140 mM NaCl, and deionized water.\nCentrifuge lysates at 13,000 x g for 10 min. Collect supernatants for immunoblot.\n3. Measuring CAS9 expression via immunoblot\nDetermine the protein concentration with a bicinchoninic acid (BCA) assay according to the manufacturer's instructions.\nRun 20 µg of protein of each sample in the wells of a 3%-8% Tris-acetate gel for 150 min and semidry transfer (10 V for 30 min and then 25 V for 12 min) to polyvinylidene difluoride membrane.\nAfter blocking the membrane in 5% nonfat dry milk in PBS with 0.1% tween (PBST) for 1 h at room temperature, add anti-CAS9 (1:1000) and anti-GAPDH (1:1000) antibodies. Incubate at 4 °C overnight.\nAfter washing the membrane with PBST, incubate the membrane with secondary antibody in 5% nonfat dry milk in PBST for 1 h at room temperature.\nImage the blot and determine CAS9 level by densitometry23. See Figure 1 for a representative blot.",
    "NOTE: Detecting phosphorylated H2AX (S139) foci formation by immunofluorescence microscopy can be used to validate CAS9 activity14. A low number of distinct foci (typically 1-4 foci) are expected depending on the cell cycle position, whether mutations in the CAS9 target site prevent further cutting, and how many copies of the CAS9 cutting site exist in the genome of interest. A representative image is shown in Figure 2.\n4. Nucleic acid extraction and amplicon generation\nExtract DNA from cell samples from step 2.4.3 using a high-molecular weight DNA extraction kit, as specified by the manufacturer.\nResuspend primers with indicated solvent according to the datasheet. Dilute with the same reagent to 20 µM and pool 20 µM primers into the indicated pools.\n\tNOTE: Primer pool is listed in Supplemental Table 1.\nCreate a PCR Master mix using a long amplification Taq polymerase for each 20 µM primer pool as specified in Table 1.\n\t\nAdd 21 µL of the mastermixes to separate PCR tubes.\nAdd 4 µL of the target sample (100 ng/µL) from step 4.1 to PCR assay tubes containing mastermix and cap assay tubes. Ensure separate reactions for each primer pool.\n\t\nVortex to mix PCR assay tubes and centrifuge (quick spin) to remove droplets from tube lids.\nPlace the PCR tubes on a conventional thermal cycler machine.\nProgram PCR machine as specified in Table 2.\nRun the program on a thermal cycler.\n5. PCR clean-up\nRemove primers from PCR reactions using a bead-based PCR cleanup system.\n\t\nRemove clean-up beads from the refrigerator 30 min prior to use.\nVortex beads well prior to use and ensure all beads are resuspended.\nAdd 30 µL (1.2x) of resuspended beads to each well of a deep well 96-well plate.\nAdd 25 µL of PCR reaction to wells containing beads.",
    "Place the plate on a plate shaker at 2000 rpm for 2 min.\nAllow the plate to remain at room temperature for 5 min following shaking.\nPlace the deep well plate on a 96-well plate magnet and incubate for 2 min.\nRemove and discard the supernatant without the disturbing beads.\nWhile the plate remains on the magnet, add 180 µL of 80% ethanol and incubate for 30 s. Remove and discard the supernatant.\nRepeat step 5.1.9.\nUsing a 10 µL pipette, remove and discard any remaining liquid from the wells.\nAllow beads to dry at room temperature for 10 min.\nAdd 20 µL of nuclease free water to the wells containing beads and remove the plate from the magnet.\nShake the plate at 2000 rpm for 2 min at room temperature.\nIncubate the plate at room temperature for 5 min.\nPlace the plate on a magnet stand and incubate for 2 min at room temperature.\nRemove the supernatant into a second, labeled PCR plate. This contains the cleaned-up DNA.\nMeasure the concentration of each reaction with a Fluorometer.\n\t\nEnsure that dsDNA Fluorometer reagents are at room temperature.\nSet up Fluorometric assay tubes plus two additional tubes for standards.\nAdd 199 µL of 1x dsDNA working solution to all but two tubes. Add 190 µL of the working solution to the last two tubes.\nAdd 10 µL of the two standards (included in the Table of Materials) to separate the assay tubes.\nAdd 1 µL of each PCR reaction to Fluorometer mastermix tubes.\nVortex tubes to mix and incubate at room temperature for 2 min.\nOn the home screen of the fluorometer, select the button with the assay kitin use (1x dsDNA) then select Read Standards and Run Samples.",
    "Insert standard 1 tube, select the Read button and then repeat for standard 2.\nFollowing step 5.2.6, repeat for one sample, select a sample volume of 1 µL and the resulting concentration will be provided.\nRepeat step 5.2.7 for the remaining samples.\nCalculate the projected molarity of all reactions and pool equal concentrations of reactions from each individual sample separately (one final pool per sample) using the equation below.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62583/62583eq01.jpg\nRepeat steps 5.2.1 to 5.2.7 to obtain the final pool concentration.\nCheck the amplicon pool on a capillary electrophoresis machine/agarose gel as specified by the manufacturer.\n\t\nPrepare capillary electrophoresis tubes for the appropriate number of samples. Add 7 µL of the DNA buffer as specified by the manufacturer.\nAdd 4 µL of the amplicon pool to the tube containing DNA buffer.\nPlace tubes on the electrophoresis machine and run the machine as specified by the manufacturer for dsDNA.\nView the electrophoresis gel pictures ensuring the bands localize to ~5 kb (size of amplicons).\nCalculate the projected molarity of all reactions and pool equal concentrations of reactions from each individual sample separately (one final pool per sample) using the equation below.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62583/62583eq01.jpg\n6. Library preparation\nDilute sample pools from step 5.3.1 to 0.2 ng/µL for library preparation.\n\t\nUsing a low-input library preparation kit compatible with short sequences (300bp) prepare libraries using unique index combinations for each sample pool created in step 5.3 following the manufacturer's instructions.\n\t\tNOTE: Follow the manufacturer's instructions to select index sequences. All indexes amenable to the library prep kit will work for the samples.\nFollowing library preparation, pool all samples according to the manufacturer's instructions.",
    "NOTE: Before creating the library pool, calculate the number of reads necessary for 250x coverage of your target sequence and ensure that the selected sequencing cartridge can provide adequate coverage for each included sample. For 0.5Mb total, this will equate to 1M reads.\nPrepare the library pool for sequencing.\n\t\nThaw and prepare a 300-cycle cartridge and sequencing reagents.\nDenature and dilute the sequencing pool created in step 5.1.1 according to the sequencer's manufacturer's instructions.\nAdd denatured and diluted library pool to sequencing reagents and Run the sequencing machine as specified by the manufacturer.\n\t\tNOTE: See attached Table 3 for trouble shootings.\n7. Data analysis\nNOTE: All data steps are performed in the genomic data analysis software. Parentheses indicate user input. Greater than sign indicates the order of mouse clicks for any given step (e.g., 1st mouse click>2nd mouse click)\nImport the reads by clicking on Open Software > Import > Illumina > Select Files > Next > Select location to Save > Finish. The reads will now appear in the software.\nTrim and filter the reads.\n\t\nIn the deep sequence data analysis software, trim the raw reads default parameters.\nHighlight the reads and click Toolbox > Prepare Sequencing Data > Trim Reads > Next > Next > Next > Next > Save > Next > (Select location to save) > Finish\nMap the trimmed reads to reference.\n\t\nMap trimmed reads to the reference sequence used in step 4.1 using a match score of 2, mismatch cost of 3 and insertion/deletion costs of 2. Ensure that the length fraction is above 0.7 and similarity fraction is at or above 0.8.",
    "Highlight the trimmed read file and click Toolbox > Resequencing Analysis > Map Reads to Reference > Next > (Select reference sequence) > Next > (Ensure parameters are indicated as above) > Next > Save > (Select location to save) > Finish.\nExtract variants and indels.\n\t\nUsing an appropriate indel caller, extract indels using a p-value threshold of 0.005 or lower and a maximum number of mismatches of 3.\nHighlight mapped read file and click Toolbox > Resequencing Analysis > Variant detection > Indels and Structural Variants > Next > (Ensure required significance is input > Next > Save > (Select location to save) > Finish.\nUsing an appropriate variant caller, call variants from the read mapping using a significance of 5%.\nHighlight mapped read file and click Toolbox > Resequencing Analysis > Variant Detection > Low frequency variant detection > Next > (Ensure required significance is input > Next > Next > Save > (Select location to save) > Finish.\n\t\tNOTE: Ensure to account for the ploidy of the host genome in the indel and variant callers. Do not extract mutants below 5%. This threshold accounts for PCR and sequencing errors associated with the assay. Normalization (based on immunoblot detection of CAS9) should be done by adjusting sequencing coverage. For example, if sample A has twice the transfection efficiency of sample B, then 50% of the reads from sample A should be used for analysis. This should be done by random sampling and not reduce the coverage for any sample below 100x.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}