{
  "id": 17723,
  "origin_website": "Jove",
  "title": "Laparoscopic Radical Left Pancreatectomy for Pancreatic Cancer: Surgical Strategy and Technique Video",
  "procedures": [
    "1. Patient Selection\nSelect patients with an upfront resectable pancreatic cancer in the pancreas body or tail visible on a recent contrast enhanced CT scan (maximum of 4 weeks old) without downstaging neoadjuvant therapy.\nExclude patients with metastatic disease or vascular involvement of vessels other than the splenic vein or artery24.\nDuring training, it is best to exclude patients with a body max index (BMI) > 35 kg/m2, recurrent acute or chronic pancreatitis, previous major upper abdominal surgery, or pancreas targeted radiotherapy.\n2. Surgical Technique\nOperative setting\n\t\nPlace the anesthetized patient in the French position on a bean bag. Place both arms in 90° abduction.\nPlace sterile drapes so that the suprapubic region is exposed for the Pfannenstiel incision.\nCreate pneumoperitoneum via a Veress needle at Palmer’s point.\nPerform a routine diagnostic laparoscopy to exclude peritoneal and liver metastases.\nThe procedure is performed using a 5-port technique. Place additional trocars a shown in Figure 1.\n\t\tNOTE: Use of laparoscopic ultrasound is advisable for staging and localizing the lesion, thereby determining the extent of the resection.\nExploration Phase\n\t\nExposure\n\t\t\nDivide the gastrocolic ligament approximately 2 cm distal from the gastroepiploic artery and vein, thus opening the lesser sac.\nDissect and ligate the short gastric vessels in preparation of splenectomy. The most superior short gastric vessels may also be spared at this stage to avoid early bleeding without adequate exposure.\nMobilize the stomach from the pancreas and retract upwards. The stomach may be retracted in various ways. Use of umbilical tape around the stomach, after it has been rolled backwards and secured in this position with surgical gauze between the top of the stomach and the surgical tape is recommended.\nExtract this tape next to the subxiphoidal trocar and grip using a surgical clamp.",
    "NOTE: A second piece of tape may pull the pyloric region to the right upper quadrant using a stab incision to extract it25. This second tape is especially useful to obtain maximal exposure of the pancreatic neck and hepatic artery region.\nDivide the splenocolic ligament in order to mobilize the splenic flexure and visualize the pancreatic tail. If needed, the lesion is located using laparoscopic ultrasonography. The transection plane of the pancreas in case of pancreatic cancer is at the portal confluence.\nMobilize the lower margin of the pancreas from medial to lateral including the splenic inferior border. At this stage, both the superior and inferior mesenteric vein may be visualized. Incise Gerota’s fascia.\n\t\t\tNOTE: Care should be taken to avoid venous bleeding. Optionally, the splenic flexure of the colon can be mobilized separately using a lateral to medial approach but often this is not required.\nIdentify the splenic vein at the inferior border of the pancreas.\n\t\t\tNOTE: The inferior mesenteric vein could drain directly into the splenic vein.\nIdentify the splenic artery at the superior border of the pancreas.\nPancreatic hanging and dissection of Gerota’s fascia dissection.\n\t\t\nDuring the dissection of the posterior plane, mobilize and lift the Gerota’s fascia (i.e., anterior renal fascia).\nCreate the posterior plane underneath the Gerota’s fascia superior to the adrenal gland toward the superior border of the pancreas. This is an avascular plane. If needed, the adrenal gland can be included (i.e., posterior RAMPS).\nCreate a tunnel by dissecting the superior pancreatic margin.\nPass a quarter length vessel loop through the tunnel and secure with a nonabsorbable locking clip. Use this to hang the pancreas including Gerota’s fascia.\nIdentify the splenic artery at the superior border of the pancreas.",
    "Mobilize the splenic artery using blunt and sharp dissection and a pass quarter length vessel loop.\nTransect the artery using 3–4 nonabsorbable locking clips. Alternatively, a vascular endostapler may be used.\n\t\t\tNOTE: The splenic artery must not be transected until the entire anatomy, especially the hepatic artery, is visualized and confirmed. If the splenic artery cannot be visualized from the pancreatic superior margin, it may identified from beneath the pancreas or by following the hepatic artery towards the celiac artery.\nPerform the same tunneling procedure at the pancreatic neck, on the right side of the pancreatic lesion, mostly above the confluence/portal vein.\nThe two vessel loops can be held by an assistant to literally hang the pancreas and expose the posterior margin during the retroperitoneal dissection.\nDetermine the transection plane at the inferior border of the pancreas.\nMobilize the remaining part of the pancreas, including Gerota’s fascia, exposing the anterior aspect of the kidney.\nPancreatic transection\n\t\t\nPull the pancreas ventrally using the vessel loops.\nTransect the pancreas at the neck using a stapler with a graded compression technique (vascular or thicker cartridge, based on the pancreatic thickness and texture at the transection level)26.\n\t\t\tNOTE: With this technique, the stapler is closed very slowly, in steps, until resistance is felt. Before continuing with the compression, the surgeon should wait for 20–30 s until the resistance decreases. The entire process typically requires 4–5 min before the stapler is completely closed. Faster closure often leads to rupture of the pancreatic capsule27. If needed, sutures can be applied to the pancreatic stump in case of rupture or bleeding.\nIdentify the left gastric vein and the splenic vein. Clip and transect the left gastric vein.\nMobilize the splenic vein, pass and secure a vessel loop.",
    "Hereafter, place 3–4 locking clips on the splenic vein: two on the patient site and at least one on the specimen site. In case of lack of space, an additional metal clip may be placed on the specimen site.\n\t\t\tNOTE: The standard order of transection is splenic artery, pancreas, splenic vein. This order may be varied based on local anatomy (e.g., by transecting the pancreas first). However, if the splenic vein is transected before the splenic artery, there will be venous congestion with increased risk of conversion due to bleeding.\nLymph node dissection\n\t\t\nDissect the lymph nodes in a clockwise fashion, according to the description of Strasberg’s RAMPS procedure15.\nStart with lymph node station 8A at the hepatic artery and station 9 at the celiac trunk.\n\t\t\tNOTE: If possible, the left gastric artery should be preserved while performing lymphadenectomy. If needed, it can be resected.\nExtend the lymphadenectomy to the left border of the aorta and the left side of the superior mesenteric artery.\nProceed with the dissection laterally towards the spleen, where any further attached tissue is taken, including the Gerota’s fascia.\nDetach the spleen by transecting the gastrosplenic ligament, splenorenal ligament, and retroperitoneal adhesion.\nExtraction and drain placement\n\t\t\nOnce the spleen is detached, remove the specimen using an endo-bag through a Pfannenstiel incision. Turn the camera 180° to the inferior part of the abdomen to visualize the extraction of the specimen.\nThe Pfannenstiel incision should be an approximately 6 cm transverse skin incision and 8 cm transverse fascia incision where the midline is divided between both rectus muscles.\nTake caution during the extraction to avoid small bowel injury and compromising of the specimen for pathological assessment.",
    "Place one surgical drain. This drain enters through the left most trocar site, loops with 2–3 additional holes through the splenic bed, runs under the stomach, and ends next to the pancreatic stump.\n\t\t\tNOTE: Care must be taken to avoid direct contact with the pancreas, artery, and vein stump.\nClosure\n\t\t\nClose the peritoneum using an absorbable braided suture and the fascia with a monofilament absorbable suture.\nRe-insufflate the abdomen.\nConfirm hemostasis at the transection planes.\nRevert all loops and the gastric hanging.\nInspect the stomach for any injuries.\nClose any fascia defect larger than 5 mm using an absorbable multifilament suture.\nClose the skin intracutaneously using an absorbable monofilament suture.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}