{
  "id": 7983,
  "origin_website": "Bio",
  "title": "Fractionation of Native Protein Complexes from Mammalian Cells to Determine the Differential Proteasome Activity and Abundance",
  "procedures": [
    "Native protein fractionation This protocol is described for one replicate of 600,000 cells maintained in one 10 cm dish.Maintain cells as needed. Here, we maintained cells in a 10 cm dish following published protocols (Mazzoni et al., 2013; An et al. 2019). All steps below were developed for starting material of 600,000 cells. The density/confluency of cells is not expected to alter intracellular proteasome subunits’ availability.On the day of collection, aspirate the media from the plate and wash the plate once with 5 mL of ice-cold PBS.Add 500 μL of cytoplasmic extraction buffer and, using the cell lifter, scrape cells from plates. The suspension should be kept on ice until 90%–95% of the cells are lysed.Determine cell lysis by using a small amount of the suspension, staining with trypan blue, and examining under an optical microscope. Briefly, take 10 μL of the cell suspension and mix it with an equal volume of trypan blue solution. Mix gently to ensure uniform staining. Allow the cell–trypan blue mixture to incubate for 3–5 min at room temperature and cover the mixture with a coverslip. Examine the cells under a microscope and distinguish between unstained and stained blue cells. Successful cell lysis will result in stained cells due to membrane rupture. We suggest the lysis to be assessed by microscopy 10–15 min after scraping the cells.In our hands, 95% lysis is reached after approximately 30 min. It is expected that a similar period is enough to reach a proper lysis for other cell types in culture.Centrifuge lysed cells at 480× g for 10 min at 4 °C. A white pellet enriched in nuclei will appear at the bottom of the tube.Transfer the supernatant (cytoplasmic fraction) to a fresh tube and snap-freeze. Store cytoplasmic fraction at -80 °C until further use.",
    "Wash the nuclei pellet three times with 200 μL of cytoplasmic extraction buffer and centrifuge at 480× g for 10 min at 4 °C.Resuspend the pellet in 50 μL of nuclear extraction buffer, pipetting the pellet up and down.Keep suspension on ice for 30 min. Resuspend the pellet after 10 min.Sonicate the suspension at 4 °C. Here, the sonicator was programmed to 5% duty factor, three cycles of sonication for 10 s each, with 30 s intervals between each cycle.Centrifuge at 6,780× g for 10 min at 4 °C.Transfer the supernatant (nuclear fraction) to a fresh tube and snap-freeze. Store nuclear fraction at -80 °C until use.Native gel electrophoresis and activity assay Thaw samples on ice.Determine total protein concentration with the DC Protein assay kit, following the manufacturer’s instructions. This is a detergent-compatible quantification kit. If using a different kit, ensure its compatibility with detergents in the lysis buffers.Add the respective lysis buffer to achieve a final protein concentration of 0.5 μg/μL for the cytoplasmic fraction and 0.2 μg/μL for the nuclear fraction.Add 5 μL of the 4× loading buffer to 15 μL for each fraction.Separate samples in NU-PAGE at 150 V and 4 °C for 4 h in native gel running buffer. The long run time is due to the large size of the proteasome subunits.Incubate the gel in the reaction buffer at room temperature for 30 min using a shaker.Protect gels from light during the reaction.Handling the gel properly is critical for the success of this part of the analysis. Please check critical notes for tips on proper handling.Detect the fluorescence at A360 excitation/A460 emission (ethidium bromide filter) using Gel Doc (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4822/bioprotoc-13-18-4822-g001.jpgFigure 1.",
    "Confirmation of fractionation success and localization of Psma1-7 and Psmc3 in induced spinal motor neurons by SDS-PAGE/immunoblot: the cytoplasmic or nuclear Psma1-7 and Psmc3 were detected in induced spinal motor neurons treated with either DMSO (-) or CPA (+). To ensure accurate fractionation, cytoplasmic markers Synaptophysin (Syn) and α-tubulin, as well as the nuclear marker LaminA/C (Lam A/C), were also detected as fractionation controls.Transfer of proteins to PVDF membrane and abundance analysis by immunoblotting Denature proteins in the gel by incubation in the denaturation buffer for 10 min at room temperature in a shaker.Transfer proteins to a low background PVDF membrane in TRIS-glycine transfer buffer at 40 mAV for 16 h.Activate the PVDF membrane by incubating for 5 min in 20% methanol.Following activation, equilibrate the membrane and gel for 5 min in the transfer buffer in a shaker prior to use.Block membranes in blocking buffer at room temperature for 1 h.Incubate the membranes in blocking buffer with primary antibodies (Psma1-7 and Psmc3) at 4 °C overnight.Wash membranes with T-TBS five times for 10 min each.Incubate membranes with mouse and rabbit secondary antibodies in TBS at room temperature for 1 h. We used a secondary antibody before scanning, as the two primary antibodies were from different species.Scan membrane images with the gel imaging system.Quantify images (band densitometry) with ImageJ software according to the manufacturer’s instructions. Normalize measurements to the sum of the band intensities on the entire gel."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}