{
  "id": 3163,
  "origin_website": "Cell",
  "title": "Protocol to differentiate glycosylphosphatidylinositol-anchored prion protein from pro-prion protein in cancer cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nWe describe two assays that are performed independently. For cell surface PI-PLC treatment assay, please refer to steps 1–15. For CPDY treatment assay, please refer to steps 16–48.\nCell surface PI-PLC treatment assay\nCollection of cells\nTiming: 30 min; day 1\nThis procedure details how to prepare and collect cells.\nCollect cells.\nSeeding 5 × 105 cells in a 6 cm Petri dish 12–24 h before experiment. Once cell number reaches 1 × 106, aspirate off the cell culture medium and discard.\nWash the three 6 cm Petri dishes once with 2 mL PBS for each Petri dish and discard the PBS.\nAdd 1 mL of 0.05% trypsin-EDTA into each Petri dish for 2 min at 37°C in a humidified chamber.\nAdd 3 mL of cell culture medium into each Petri dish to stop the cell digestion and transfer the cells with a pipette into a 15 mL centrifuge tube.\nCentrifuge the tubes at 300 × g for 3 min at room temperature.\nDiscard the supernatant, resuspend the cells of three 15 mL centrifuge tube with 1 mL ice-cold PBS, and transfer the cells to three 1.5 mL microcentrifuge tubes.\nPI-PLC treatment assay\nTiming: 1 h; day 1\nThe following steps detail how to treat cells with PI-PLC.\nWash the cells of three microcentrifuge tubes twice with 1 mL ice-cold PBS by centrifuging at 300 × g at 4°C for 3 min.\nAdd 200 μL (0.1 U/mL) PI-PLC into one of the three microcentrifuge tubes and add 200 μL of PBS into the two remaining microcentrifuge tubes, label the tubes for PI-PLC treatment or no PI-PLC treatment, and resuspend the cells with gentle pipetting (essential)",
    "Note: PI-PLC enzymatic activity is not affected by the presence of small amount of divalent metal ions. 1 U PI-PLC can be diluted with ice-cold PBS. Diluted PI-PLC can be stored at -20°C.\nIncubate the microcentrifuge tubes at 37°C for 1 h and gently flick the tubes every 10 min (essential)\nCentrifuge the tubes at 300 × g for 3 min and discard the supernatant.\nWash the cells once with 1 mL of PBS and centrifuge the tubes at 300 × g for 3 min.\nNote: From this step on, a common problem frequently encountered is the loss of cells, be careful to handle the cells.\nFlow cytometry assay: Staining\nTiming: 1.5 h; day 1\nThis procedure details how to stain cells with indicated antibody for flow cytometry and/or immunofluorescence staining analysis.\nDiscard the supernatant and add antibodies to the tubes.\nAdd 200 μL of PBS containing the antibodies (mouse monoclonal antibody 4H2 against PrP) at the final concentration of 10 ng/μL5[href=https://www.wicell.org#bib4] into the tube with PI-PLC treatment.\nAdd 200 μL of PBS containing the antibodies (mouse monoclonal antibody 4H2 against PrP) at the final concentration of 10 ng/μL into another tube without PI-PLC treatment.\nAdd 200 μL of PBS containing isotype control mouse IgG1 (final concentration is 10 ng/μL) into the other tube without PI-PLC treatment and vortex briefly.\nIncubate the antibody-cell mixture at 4°C for 40 min (essential)\nWash the antibody-cell mixture with 1 mL of ice-cold PBS, vortex the tubes briefly and centrifuge at 300 × g for 3 min at 4°C. Discard the supernatant. Repeat process 5 more times (essential)\nNote: Carefully aspirate off the wash solution to avoid loss of cells.\nAfter final centrifugation, discard the supernatant and add antibodies to the tubes.",
    "Add 200 μL of PBS containing fluorescent dye conjugated secondary antibody (goat- anti-mouse AF488 at a final concentration of 5 ng/μL), vortex briefly.\nIncubate at 4°C for 40 min in the dark (essential).\nAs before wash the antibody-cell mixture 6 times with 1 mL of ice-cold PBS each time, vortex briefly, and centrifuge at 300 × g for 3 min at 4°C.\nDiscard the supernatant each time and resuspend the cells with 200 μL ice-cold PBS at the end.\nNote: The suspension volume can be scaled-up or -down according to the cell numbers. We normally keep the final volume at 200 μL.\nFilter the cells with 100 mesh gauze net, and collect the cells in pre-labelled FACS tubes.\nFlow cytomery assay: Data collection\nTiming: 30 min\nThis procedure details how to collect data on a BD symphony cytometer (FACSTM C6). Any flow cytometer with similar functions can also be used.\nCollect data on a BD Symphony flow cytometer and analyze by FlowJo software.\nNote: The cells are gated based on their light-scattering properties and fluorescent intensities from antibody staining, followed by analysis. Samples without PI-PLC treatment but incubated with IgG1 or 4H2 are used to set up voltages defining the negative and positive staining signals.\nNote: Single fluorescence dying does not need to adjust compensation.\nInset the FACS tube for IgG1 staining, select the drawing tool in the screen to draw one Dot Plot of omnidirectional and lateral angles. X-axis label is FSC-A, Y-axis label is SSC-A. Set appropriate photomultiplier Tube (PMT) voltage. Painting single cell gating to analyze cell population.",
    "Draw a histogram with the cells in the selected gate. Set fluorescence staining value as X-axis. Set Y-axis as number of cells counted. The fluorescence staining value of IgG1 stained sample is set to start from 0. The number of cells collected is 10,000.\nAfter finish IgG1 sample, replace the IgG1 tube with the 4H2 tubes treated or not treated with PI-PLC with the same setting. Draw histograms for these two samples with the same selected gate.\nRecord the samples one at a time.\nAnalyze the results with FlowJo (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2738-Fig1.jpg\nFigure 1. Flow cytometry assays showed that PrP on the surface of HLE cells was resistant to PI-PLC treatment\nCell surface PrP was stained with 4H2 with or without PI-PLC treatment (as shown in this figure, blue or brown line, respectively).\n(A) PrP on the surface of AsPC-1 cell was sensitive to the treatment.\n(B) HLE cell surface PrP was resistant to the treatment. Background stain was shown as shaded region: cells stained with mouse IgG1.\nCPDY treatment assay\nAntibody immobilization\nTiming: 2 h; day 1\nThis step details how to generate antibody conjugated beads.\nEquilibrate the AminoLink Plus Coupling Resin and reagents (stored in 4°C fridge) to room temperature.\nResuspend the AminoLink Plus Coupling Resin well with gentle tapping, transfer 100 μL of beads (50% slurry) to a spin column (Pierce Spin Cups, Upper spin column). Place the column in a clean 1.5 mL microcentrifuge tube (Pierce Spin Cups, lower tube) (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2738-Fig2.jpg\nFigure 2. The picture of a spin cup and a pipette with tip-cut\n(A) The picture of a spin cup.\n(B) The picture of a pipette with tip-cut.",
    "Note: To ensure the amount of intact resins in all columns is equal, the 200 μL pipette tip that is used to transfer the beads is cut off with scissors at 5 millimeter from the tip (Figure 2[href=https://www.wicell.org#fig2]B). Shake the beads solution well each time and transfer the equilibrated resins into the columns.\nCentrifuge the columns at 1,000 × g for 1 min at room temperature and discard the flow-through.\nWash the beads twice with 300 μL binding buffer (Table 7[href=https://www.wicell.org#tbl7]), centrifuge at 1,000 × g for 1 min, and discard the flow-through.\ntable:files/protocols_protocol_2738_7.csv\nStore at 4°C for up to 3 months.\nAdd 100 μg of 8B4 antibody and adjust the volume to 300 μL with binding buffer (Table 7[href=https://www.wicell.org#tbl7]) (essential)\nNote: Antibodies have different affinity and storage conditions. Consult the relevant information for affinity purification experiments.\nNote: Make sure that the antibody solution does not contain reducing reagent as it will greatly affect the efficiency of antibody coupling.\nAdd 4.5 μL of 5 M sodium cyanoborohydride solution into the antibody-beads column (essential).\nRotate the column for 120 min at room temperature.\nCentrifuge the column at 1,000 × g for 1 min at room temperature and save the flow-through to check the efficacy of antibody conjugating.\nNote: Using bicinchonininc acid (BCA) protein assay kit to determine antibody concentration in the flow-through to check the efficiency of antibody coupling before step 24.\nWash the beads twice with 300 μL of binding buffer (Table 7[href=https://www.wicell.org#tbl7]) each time, centrifuge and discard the flow-through.\nWash the beads once with 300 μL of tris buffer (Table 8[href=https://www.wicell.org#tbl8]), centrifuge and discard the flow-through.\ntable:files/protocols_protocol_2738_8.csv\nStore at 4°C for up to 3 months.",
    "Add 300 μL of tris buffer (Table 8[href=https://www.wicell.org#tbl8]) to the column and 4.5 μL of the sodium cyanoborohydride solution in a fume hood, rotate the column for 15 min at room temperature.\nCentrifuge the column at 1,000 × g for 1 min at room temperature and discard the flow-through.\nWash the antibody-bead mixture six times with 200 μL of washing buffer each time, centrifuge at 1,000 × g for 1 min and discard the flow-through.\nIf the column is not used right away, wash the beads twice with 300 μL of binding buffer (Table 7[href=https://www.wicell.org#tbl7]), centrifuge at 1,000 × g for 1 min and discard the flow-through.\nStore the resin in binding buffer (Table 7[href=https://www.wicell.org#tbl7]) containing 0.1% Antibacterial and preservative agents (ProClean 300) at 4°C.\nNote: Add antibacterial and preservative agents (ProClean 300) during storage.\nMaking cell lysates\nTiming: 1 h; day 1\nThis procedure details how to prepare cell lysate for affinity purification.\n24 h before making cell lysate, seed 5 × 106 cells in a 10 cm Petri dish. Discard cell culture medium and wash the cells gently three times with ice-cold PBS by pipetting along the edge of the Petri dish. Discard the PBS after each wash.\nAdd 500 μL ice-cold cell lysis buffer (Table 3[href=https://www.wicell.org#tbl3]) to the cells, scrape the cells and incubate the cell-lysate at 4°C for 5 min.\nNote: Cool down the lysis buffer and PBS at 4°C. Cool down the table-top centrifuge to 4°C before step 31. Add protease and phosphatase inhibitors to cell lysis buffer just before cell lysis.\nTransfer the lysate to a 1.5 mL tube and sonicate the cell lysate with an ultrasonic cell pulverizer (Scientz-11D, Ningbo Scientz Biotechnology CO.LTD, China) for 1 min at 120 Watts (Ultrasonic 5 s/ interval 5 s).",
    "Note: Adjust the ultrasonic condition to reduce the generation of foam and splashes. Sonicate 2 minutes at 60 Watts to produce homogenous cell lysates. The ultrasonic horn must be inserted into the sample before starting; the probe should be centered and not attached to the tube; the ultrasonic time should not exceed 5 s each time, and the interval time should be greater than or equal to the ultrasonic time.\nPlace the tube on ice for 20 min and then centrifuge the tube at 13,000 × g for 10 min at 4°C to get rid of non-dissolved cell debris.\nNote: Cell collection, sonication, and the long-term incubations are performed at 4°C.\nNote: To decrease nonspecific binding, the cell lysates can be pre-cleaned with 80 μL agarose beads. Incubate the agarose beads with the cell lysate on a rotator for 30 min to 1 h at 4°C. Spin down the beads at 1,000 × g for 1 min and collect the supernatant.\nAffinity purification of PrP\nTiming: 12 h; day 1\nThis procedure details the purification of PrP in cells.\nTransfer the supernatant to a spin column containing the aminolinked antibody (volume: about 500 μL) for affinity purification.\nIncubate the column on a rotator overnight at 4°C (at least 12 h).\nCentrifuge the column at 1,000 × g for 1 min at 4°C and discard the flow-through.\nWash the beads six times with 300 μL lysis buffer (Table 3[href=https://www.wicell.org#tbl3]) by turning the column upside down 10 times, and centrifuge the column at 1,000 × g for 1 min at 4°C. Discard flow-though.\nNote: We do recommend washing the beads with lysis buffer (Table 3[href=https://www.wicell.org#tbl3]) but not with PBS or other buffers during step 38.",
    "Add 10 μL of neutralization buffer (Table 9[href=https://www.wicell.org#tbl9]) to the collection tube, add 20 μL of elution buffer (Table 10[href=https://www.wicell.org#tbl10]) in the column and incubate for 5 s, centrifuge the column at 1,000 × g for 1 min at 4°C (essential)\ntable:files/protocols_protocol_2738_9.csv\nStore at 4°C for up to 3 months.\ntable:files/protocols_protocol_2738_10.csv\nStore at 4°C for up to 3 months.\nAdd 100 μL of elution buffer (Table 10[href=https://www.wicell.org#tbl10]) to the column and incubate for 15 min at 4°C. The column does not need to be mixed (essential)\nCentrifuge the column at 1,000 × g for 1 min at 4°C to collect the eluent.\nNote: In case the eluent is not enough for carboxypeptidase treatment, repeat affinity purification 2–3 times to collect more eluent.\nNote: In case the amount of antibody available for PrP purification is 10–75 μg, the affinity purification step shall be repeated 2–3 times to get enough purified PrP for CPDY treatment (Please see following).\nCPDY treatment assay\nTiming: 12 h; day 2\nThis procedure details how to perform the CPDY treatment.\nPrepare four 1.5 mL microcentrifuge tubes. Label the tubes as following: CPDY treatment 0, 30, 60 and 120 min. Add 20 μL sample from step 41 to each tube.\nAdd 0.5 U CPDY to each tube and incubate for indicated periods at 37°C(essential).\nNote: It is better to prepare fresh CPDY or use the aliquoted CPDY stored at −20°C, and the amount of CPDY can be adjusted according to the amount of eluent.\nAdd 7 μL 4× SDS Laemmli buffer (Table 11[href=https://www.wicell.org#tbl11]) to each tube once the reaction is done and heat the tube at 100°C for 10 min, then place the tube on ice for at least 5 min.\ntable:files/protocols_protocol_2738_11.csv\nStore at ≤−20°C for up to 1 year.",
    "Analyze 10 μL of sample by western blot (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2738-Fig3.jpg\nFigure 3. Treatment of PrP purified from HLE cells with CPDY using PrP from AsPC-1 cells as control\nPrP purified from HLE cell lines by 8B4 from step 41 was quantified first by BCA method and subjected to CPDY treatment as indicated and immunoblotted with 4H2. PrP level was quantified by IMAGE J. The level of PrP without CPDY treatment (time 0) was arbitrarily defined as 1.0. Relative PrP level was calculated as PrP level at specified time-point divided by PrP level at time 0.\nPrepare a 10% resolving polyacrylamide gels with 5% stacking gel.\nInstall the gel in the gel running cassette (BioRad, 1658001) and fill in with 1× running buffer. load the samples and the molecular weight marker. Gel running conditions: set the Voltage at 80 V and run for 30 min. Once the proteins enter the resolving gel, re-set the voltage to 120 V and run the gel for 1 h.\nTransfer separated proteins to 0.45 μm nitrocellulose (NC) membrane (Merck Millipore, USA) as following:\nSoak NC membranes, sponges, and thickened filter paper in transfer buffer for few seconds.\nRemove the gel from the running apparatus and prepare the transfer sandwich by building the following layers in the transfer holder: sponge - thickened filter paper - gel -NC membrane - thickened filter paper- sponge.\nRoll a 25 mL glass centrifuge tube over the NC membrane to get rid of air bubbles trapped between gel and the NC membrane.\nLock the transfer holder and place it into a transfer apparatus. Fill the transfer apparatus with transfer buffer. Conditions of transfer: set current at 0.12 mA (A piece of polyacrylamide gel), transfer for 1 h 30 min. Proteins will migrate from the cathode (-) to the anode (+).",
    "After transfer, block the NC membrane with 3% bovine serum albumin (BSA) in TBST at room temperature for 2 h. After blocking, discard the block solution.\nNC membrane is then incubated with 4H2 (final concentration is 1 ng/μL) on a rocker at 4°C overnight. After primary antibody reaction, discard the solution.\nWash the NC membrane three times with TBST for 10 min each time at room temperature and discard TBST.\nAdd HRP-conjugated secondary antibody (goat-anti-mouse, final concentration is 0.2 ng/μL) and incubate for 1 h at room temperature. After secondary antibody reaction, discard the solution.\nWash the NC membrane three times with TBST for 10 min each time at room temperature and discard the TBST.\nDetect chemiluminescence reaction with ECL substrate using a chemiluminescence imager (Tanon 4800).\nNote: PrP molecules can be separated by 10% SDS-PAGE (Table 12[href=https://www.wicell.org#tbl12]).\ntable:files/protocols_protocol_2738_12.csv\nStore the gel at 4°C for up to 3 days.\nUsed resin storage\nTiming: 1 h; day 2\nThis procedure details how to store the used spin column.\nNote: To save time and expense, antibody conjugated resin can be re-used, the used spin column is stored in a 4°C refrigerator.\nAdd 200 μL of binding buffer (Table 7[href=https://www.wicell.org#tbl7]) to the column, centrifuge at 1,000 × g for 1 min and discard the flow-through.\nRepeat this step once.\nAdd 200 μL of binding buffer (Table 7[href=https://www.wicell.org#tbl7]) to the column. For long-term storage, add 0.1% Antibacterial and preservative agents (ProClean 300).\nNote: The used spin column can be re-used for about 3 times. Seal the lid with sterile parafilm."
  ],
  "subjectAreas": [
    "Antibody",
    "Flow Cytometry",
    "Cancer",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}