{
  "id": 9622,
  "origin_website": "Jove",
  "title": "Organotypic Slice Cultures of Embryonic Ventral Midbrain: A System to Study Dopaminergic Neuronal Development in vitro",
  "procedures": [
    "Parts of this protocol are modified from Daza et al., 2007 7.\n1. Preparations\nCan be prepared one day in advance\n\t\nPrepare 1X Krebs buffer (1.5 L): 126 mM NaCl, 2.5 mM KCl, 1.2 mM NaH2PO4:H2O, 1.2 mM MgCl2, 2.5 mM CaCl2, 11 mM glucose, 25 mM NaHCO3; adjust pH to 7.4. Filter sterilize (0.22 μm pore size) and store at 4°C.\nPrepare the culture medium (20 mL): 5 mL HBSS, 9 mL DMEM high glucose, 850 μL of 30 % glucose, 5 mL horse serum (25 %). Add 200 μL 100X Penicllin/Streptomycin. Store at 4°C.\nPrepare before starting the dissection\n\t\nPrepare 100 mL of 4 % low melting agarose (LMP agarose) in 1X Krebs buffer: microwave the solution until the agarose is completely dissolved and then place the agarose in a 45 °C water bath.\nFill up the vibratome buffer tray with ice-cold 1X Krebs buffer and start the cooling element (keep at 4°C). Fix a razor blade in the blade carrier and set-up the vibratome area with a scalpel, a fine paintbrush and a mini perforated spoon to pick up the slices. Prepare sterile Petri dishes (35 x 10 mm) with 1x Krebs buffer for collecting the slices. Keep on ice.\nSet-up the dissection area with sterile Petri dishes (100 x 15 mm) for dissection and smaller sterile Petri dishes (35 x 10 mm) for embedding, small scissors, two fine forceps (Dumont 5), a mini perforated spoon, a glass Pasteur pipette fire polished with a round closed tip and 1 L of 1X Krebs buffer on ice. Wipe all the dissection tools with 70 % ethanol.\nAdd culture medium to the wells of a six-well plate (1.5 mL/well) and place it in a 37 °C incubator.",
    "Prepare a six-well plate with 1.5 mL/well sterile 1X Krebs buffer and 15 μL Penicilin/Streptomycin (100X)/well. Under sterile conditions, place Millicell Cell Culture inserts into the wells. Place the six-well plate next to the vibratome so that the brain slices can be transferred onto the filter membranes immediately after sectioning.\n2. Dissection and embedding of embryonic brains\nAnesthetize a pregnant female mouse using isoflurane and sacrifice the mouse by cervical dislocation (embryos should be at stage E12.5). Dissect out the uterus of the mouse by pulling up the uterus with forceps. Use other forceps to separate the mesometrium away from the uterus. Place the uterus in ice-cold 1X Krebs buffer. Use a fine forceps to separate the muscular wall of the uterus, Reichert's membrane and the visceral yolk sac from the embryo. Remove the embryos from the uterus. Place the dissected embryos into a separate Petri dish with sterile 1X Krebs buffer.\nDissect the brain under a stereomicroscope. To dissect the brain, first cut off the head of the embryo. Fix the head by piercing fine forceps through the head (eye level). Use another pair of forceps to carefully remove the skin and skull. Use forceps to carefully lift the brain out and transfer it into a Petri dish with sterile 1X Krebs buffer. It is very important that the integrity of the whole brain is maintained during dissection, since damages to the brain tissue will create problems (such as tissue shredding) during sectioning on the vibratome.",
    "Wash the brains once in 4 % low-melting point (LMP) agarose. Embed 2-3 brains at a time in fresh 4 % LMP agarose. Place the embedding dishes on ice as even as possible. Use a Pasteur pipette with a fire-polished round tip to lift the brains until the bottom of the agarose is solidified. The brains should settle in a flat position horizontal to the bottom of the agarose block.\nAfter the agarose has fully solidified (after approximately 3 min), trim the agarose surrounding the brains and glue the agarose block onto the specimen stage of the vibratome. When gluing the blocks, make sure that the ventral side of the brain is parallel to the platform, since the brains should be cut in a horizontal section plane.\n3. Vibratome sectioning\nUse a razor blade for sectioning. To obtain intact slices it is very important to maintain the temperature at 4°C during the sectioning.\nSection 300 μm thick horizontal slices at a frequency of 50 Hz, blade amplitude of 1.1 mm and a speed of 25 mm/sec.\nUse the fine paintbrush to push the slice in a mini perforated spoon to collect the brain slices and transfer them into a dish with sterile ice-cold 1X Krebs buffer. Choose the slice that contains ventral midbrain tissue (see Figure 1). In an E12.5 mouse brain there is just one 300 μm horizontal slice that contains ventral midbrain tissue including dopaminergic neurons.\n4. Slice culture\nSteps 4.2-4.5 should be carried out under sterile conditions.\nTransfer the brain slices onto a Millicell cell culture membrane insert in a six-well plate with 1x Krebs buffer (see point 1.2.5). To transfer the slice use the mini perforated spoon (Fine Science Tools) and a fine paintbrush. Up to 3 slices can be placed on one membrane.",
    "Transfer the membrane with the slice to the six-well plate with culture medium (see point 1.2.5). The top of the membrane should not be covered by medium. The brain slice receives medium from below and air from above.\nPlace the six-well plate in a incubator with 5 % CO2 at 37 °C. It is very important that the slices are placed in the incubator within 2 hours after the initial step of the dissection. A more extended preparation time can result in poor survival of the slices.\nSlices can be maintained in vitro up to 3 days. Change 50% of the culture medium on the 2nd day.\n5. Time-lapse imaging\nLet the slices recover in the incubator for 4-5 hours before starting time-lapse imaging.\nFor time-lapse imaging, keep the slices on the membrane insert and transfer the insert into a 35 mm Ibidi μ-dish (the bottom of the dish consists of material with high optical quality).\nAdd 1 mL of culture medium plus 1.5 μL ascorbic acid (200 mM) to the dish. Ascorbic acid protects the slices against phototoxicity.\nIncubate slices in an environmental chamber at 37 °C with 5 % CO2 during time-lapse imaging.\n6. Representative Results",
    "Figure 1 illustrates the preparation of organotypic slice cultures from E12.5 mouse brain. Figure 2 shows horizontal organotypic slices (acute and after several days in culture) obtained form E12.5 mouse brain. For comparison, frozen brain sections at the equivalent developmental stages are shown. Midbrain dopaminergic neurons are visualized with immunohistochemistry for tyrosine hydroxylase (TH). Midbrain dopaminergic neurons project to targets in the forebrain. These projections start to form at E12.5 and extend towards the forebrain during the subsequent days. We consider the development of forebrain projections as a good indication for the normal development of dopaminergic neurons in culture. In the horizontal slices midbrain dopaminergic neurons extend projections towards their proper forebrain target area. After 3 DIV (days in vitro) or when the forebrain target areas are damaged, aberrant projections extend towards the dorsal midbrain. Examples of coronal slices of E12.5 midbrain are shown in Figure 3. Dopaminergic neurons visualized with immunostaining for TH extend aberrant projections to the dorsal midbrain. Figure 4 shows an analysis of proliferating, necrotic and apoptotic cells in the organotypic slice cultures. BrdU immunostaining to visualize proliferating cells demonstrates that cells proliferate under culture conditions after 1 DIV. Proliferation is reduced after 4 DIV. After 3 DIV, many cells in the ventral midbrain undergo necrosis (propidium iodide staining) and apotosis (immunostaining for cleaved caspase-3). Figure 5 shows migratory paths of YFP-labeled neurons monitored in a time-lapse imaging experiment in an acute slice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3350/3350fig1.jpg",
    "Figure 1. Schematic illustrating the preparation of organotypic slice cultures. 300 μm horizontal brain slices are prepared by sectioning an E12.5 brain using a vibratome. (A) Schematic sagittal view of an E12.5 mouse brain. Levels of sections are indicated. The area containing dopaminergic neurons is depicted in pink, projections are indicated in blue. (B) Schematics of the three slices that can be obtained from dorsal to ventral and that contain both forebrain (Fb) and midbrain (Mb). Note that only one slice contains dopaminergic neurons (slice b). The appropriate slice can be identified based on the position of the ventricles and the continuity of midbrain and forebrain tissue (arrows, compare section b with section a and c). The area containing dopaminergic neurons is indicated in pink, the area containing dopaminergic precursors is depicted in green, blue arrows indicate developing projections. (C) The slice containing dopaminergic neurons is cultured on membrane inserts. Abbreviations: vMb, ventral midbrain; dMb, dorsal midbrain; Hyp, hypothalamus; Hb, hindbrain.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3350/3350fig2.jpg",
    "Figure 2. Projections of midbrain dopaminergic neurons in organotypic slice cultures are dependent on the integrity of the forebrain. Immunohistochemistry for tyrosine hydroxylase (TH) to label dopaminergic neurons. (A) Acute slice (0 DIV) showing the normal location of dopaminergic neurons in the ventral midbrain. The white arrowhead indicates the area that is shown in higher magnification in the inset. Projections to the forebrain have not yet developed. After 1 DIV, projections to the forebrain start to form. Projections extend into the forebrain at 2-3 DIV. White arrowheads indicate the location of the cell bodies shown in higher magnification in the insets (white frame). Yellow arrows highlight the normal projections in intact slices shown in higher magnification in the insets (yellow frame). Aberrant projections develop in slices with damaged forebrain. Red arrows indicate the aberrant projections to the dorsal midbrain shown in higher magnification in the insets (red frame). Damage is indicated with red asterisks. After 3 DIV, most slices (n=5/7) had aberrant projections towards the dorsal midbrain. (B) TH immunostaining on horizontal frozen brain sections at different developmental stages to show the development of dopaminergic projections in vivo. White arrowheads indicate the location of the cell bodies shown in higher magnification in the insets (white frame). Yellow arrows highlight the position of the projections shown in higher magnification in the insets (yellow frame).The level of the frozen sections was chosen to closely match the level of the organotypic slice cultures. Note that a single frozen sections (12 μm) does not represent the entire organotypic slice (300 μm). Therefore, projections shown at E13.5 and E14.5 were observed on sections 120 μm more ventral than the section containing the cell bodies (yellow asterisks).\nimgsrc://cloudfront.jove.com/files/ftp_upload/3350/3350fig3.jpg",
    "Figure 3. Midbrain coronal slice cultures stained for tyrosine hydroxylase (TH) as a marker for dopaminergic neurons. (A-C) Slices after 1, 2 or 3 DIV. Dopaminergic neurons develop aberrant projections towards the dorsal midbrain (red arrows). Arrowheads show the location of the dopaminergic cell bodies.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3350/3350fig4.jpg\nFigure 4. Cell proliferation and cell viability in midbrain organotypic slice cultures. (A) Proliferating cells were labeled by the addition of BrdU (50 ng/mL, Sigma) to the culture medium for 18 h. Slices were subsequently immunostained for BrdU. After 1 DIV, BrdU labeled cells are located in the ventricular zones (red arrows). After 4 DIV, proliferating cells are more scattered and a distinct ventricular zone is no longer maintained. (B) Necrotic cells were labeled by addition of propidium iodide (1μg/μL, Sigma) to the culture medium for 2 hrs and visualized by fluorescence microscopy. After 1 DIV, the ventral midbrain (vMb) is not necrotic, but many propidium iodide labeled cells can be seen in the dorsal midbrain and forebrain. After 3 DIV the cell viability decreases in the ventral midbrain. Scale bar: 500 μm (C) Immunostaing for cleaved caspase-3 to visualize apoptotic cells. At 1 or 2 DIV, only few dopaminergic neurons (TH) are apoptotic. After 3 DIV, dopaminergic neurons start to undergo apoptosis. Panels in the middle and on the right are higher magnifications of the boxed area in the left panels. The higher magnifications images are maximum intensity projections of z-stacks of 14-16 frames. Images were taken every 0.5 μm with an Zeiss Apotome set-up.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3350/3350fig5.jpg",
    "Figure 5. Migratory route of YFP-labeled neurons in an acute slice. (A) Horizontal slice used for time lapse imaging of YFP-labeled neurons. The slice was incubated for 5 hrs prior to imaging. Cells were labeled using an inducible Cre/loxP system6. ShhCreER mice 8 and ROSAloxP-STOP-loxP-EYFP reporter mice 9 were used. Recombination of the ROSA reporter allele (and EYFP expression) is induced in cells that express CreER (Shh-expressing cells), but only upon administration of Tamoxifen (Sigma). In this example, Tamoxifen (3 mg/40 g body weight) was administered to pregnant mice at E8.5. This experimental set-up results primarily in the labeling of precursors of dopaminergic neurons and their descendants in the ventral midbrain10,11 . Scale bar: 500 μm. (B) Tracing the migratory route of YFP-labeled neurons in an acute slice. Time-lapse images of YFP-labeled fate mapped neurons were acquired every 30 min for a total time of 5 hrs 30 min on a Zeiss Axio-Observer microscope (objective EC PlnN 10x /0.3). Slices were incubated in an environmental chamber (incubator XLS1 Pecon) at 37 °C and supplied with 5 % CO2 during the imaging. The initial position of the cells is marked with red arrows; migration positions are marked with red asterisks.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}