{
  "id": 11286,
  "origin_website": "Jove",
  "title": "Shape Memory Polymers for Active Cell Culture",
  "procedures": [
    "1. Isothermal UV-Curing of NOA63\nA custom curing chamber was developed using a glass slide (75 mm x 25 mm x 1 mm), a 1 mm thick Teflon spacer, and an aluminum plate (75 mm x 25 mm x 3 mm) as shown in Figure 1. The chamber is held together using small binder clips.\nInject the NOA63 into the chamber through a hole in the Teflon spacer using an 18 gauge needle. The NOA63 can be gently heated to ease injection.\nPlace the chamber on a hot plate set at 125 °C and allow to heat to a uniform temperature for 5 min.\nPre-cure the NOA63 in a UV lamp chamber (λmax = 365 nm; see Table) for 20 min with the lamp 6.5 cm from the surface of the glass.\nRemove the NOA63 from the chamber while warm using a razor blade.\nPost-cure the NOA63 under the UV light for 3 h 40 m on the hot plate at 125 °C.\nStore the NOA63 desiccated at -20 °C.\n2. Shape Memory Characterization of NOA63\nPrepare a dumbbell specimen by hot-pressing a cured NOA63 film with a customized punch (see Table), whose dimensions are shown in Figure 2.\nLoad the specimen into a dynamic mechanical analyzer (DMA; see Table) with tensile fixture. Set the instrument to \"force controlled\" mode, then program the testing procedure as follows:\nEquilibrate at 95.00 °C\nIsothermal for 10.00 min\nRamp force 0.300 N/min to 2.500 N\nIsothermal for 5.00 min\nRamp 2.00 °C/min to 20.00 °C\nIsothermal for 10.00 min\nRamp force 0.300 N/min to 0.015 N\nIsothermal for 5.00 min\nRamp 2.00 °C/min to 95.00 °C\nRepeat steps 2-9 two more times\n3. Preparation of Active Cell Culture Substrates",
    "Individual samples can be prepared from the isothermally cured SMP film. Cut the SMP film with a razor to desired sample size. Place the SMP on a hot plate set at a temperature higher than the Tg to reduce the modulus and ease cutting.\nThe temporary shape can be fixed in a number of different ways. Here we use a bench top hydraulic press with heated/cooled platens to emboss a temporary topography. Set the temperature of the platens at a temperature above the Tg.\nAn embosser was made by curing epoxy on a vinyl record. This will produce a temporary shape of parallel grooves. Here, the embosser had triangular peaks 35 to 40 μm high and 60 μm wide, spaced 80 μm apart. The embosser can be made from other materials and with different topographies, but must be stiffer than NOA63 at the embossing temperature. Place the SMP samples face down on the embosser and place the samples and embosser in the press.\nApply a ~100 kPa preload to make contact between the heating platens and the samples and hold for ~5 minutes to allow the samples to reach a uniform temperature.\nApply 1-6 MPa to the samples and hold for 1 minute. A stress of 4.7 MPa leads to incomplete replication of the embosser topography. The temporary topography produced has rounded peaks 25 to 35 μm high and 150 μm wide. The SMP will fracture if a larger stress is applied. Apply smaller stresses to introduce topographies with smaller amplitudes.\nReduce the temperature below the Tg. Here we use the water cooling capability of the press platens.\nWhen the temperature is below the Tg, remove the applied force.",
    "The samples can be stored desiccated at -20 °C. When stored under these conditions, we have observed less than a 1 μm decrease in amplitude recovery after two months for samples embossed with the vinyl record embosser.\n4. Active Cell Culture Experiment\nThe UV light of a biological safety cabinet (BSC) is used to sterilize the samples. Arrange the samples face down in sterile dishes without lids and turn on the BSC UV light for 6 h.\nFlip samples to new sterile dishes face up. Turn on the BSC UV light for 6 h.\nThe samples now need to be equilibrated to a relatively stable state before plating with cells. Place the samples in a 96 well plate and add 150 μl of complete growth medium.\nPut the plate in a 30 °C incubator with 5% CO2 until reaching the desired partial recovery. Here we use 30 h to produce samples with large enough amplitude to align cells.\nThe samples can now be plated with cells. Place the samples in a new 96 well plate.\nAdd 150 μl of cell solution to the samples. Here we use C3H/10T1/2 mouse embryonic fibroblasts at 20,000 cells/ml to achieve isolated cells (generally not in contact with other cells).\nTo allow the cells to attach and spread on the temporary topography, place in a 30 °C incubator for 9.5 h.\nTo assay cell morphology before transition, remove samples and perform staining and fluorescence imaging of the samples. This material exhibits autofluorescence through most of the UV and visible range. Fluorophores in the far red end of the spectrum such as Alexa Fluor 647 are recommended to reduce background.",
    "To trigger samples to recover, move the plate to a 37 °C incubator and continue culture for 19 h to allow the material to recover and allow the cells to adapt their morphology to the new topography.\nRemove samples and apply appropriate stain (phalloidin for filamentous actin imaging) and imaging procedures.\n5. Representative Results: \nCured NOA63 is a transparent, glassy solid that has excellent shape memory properties as shown in Figure 3. In this case the material was cured as in Protocol 1 above and shows a uniform Tg of 51.1 °C (determined from the onset of E' drop). It is observed from the one way shape memory cycles (heating, deforming, cooling, recovering, Figure 3) that, a large percentage of strain was fixed after unloading at 20 °C, corresponding to a fixing ratio15 (Rf) of 89.3% (averaged over three cycles; the same below for Rr). The fixed strain recovered at a recovery ratio (Rr) of 84.4% in a relatively small temperature range during heating. Furthermore, the shape memory performance showed no deterioration up to three cycles, in that all the curves follow almost exactly with each other.\nNOA63 was used in this protocol because it is readily available from the manufacturer and supplied as an easily cured solvent-free prepolymer with photoinitiator. However, its composition is not disclosed by the supplier. It was found to allow high cell attachment and viability. Finally, the transition temperature could be tuned to allow a meaningful magnitude of recovery between two cell compatible temperatures. A number of other polymer systems could also be used with this protocol if the transition temperature is compatible with cell culture and if they promote cell adhesion and viability.",
    "The amplitude of the temporary topography (grooves) decreases over time at 30 °C. By 30 h at 30 °C, the amplitude has been reduced by ~50% (Figure 4, time 0)16. It reduces another 10% over the next 9.5 h. When recovery is triggered by increasing the temperature to 37 °C, the amplitude reduces to 0.5% of the initial amplitude within 9.5 h. For the embosser used and an embossing stress of 4.9 MPa, this corresponds to a functional change of 13 μm grooves to a nearly flat surface.\nAn example of a cell behavior controlled through the use of active cell culture substrates is a change in cytoskeleton organization. On temporary grooved substrates before recovery is triggered, the actin microfilaments align along the direction of the grooves (Figure 5a)16. After recovery by temperature increase, the microfilaments have reorganized and are randomly oriented. Control samples that have static grooves or a static flat surface do not reorganize after the increase in temperature (Figure 5b,c).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2903/2903fig1.jpgFigure 1: Schematic for NOA63 curing chamber. Cross-section view (left) and top-down view without glass cover (right).\nimgsrc://cloudfront.jove.com/files/ftp_upload/2903/2903fig2.jpgFigure 2: The dumbbell geometry used for bulk shape memory characterization. W: width of narrow section, L: length of narrow section, G: gage length, WO: width overall, LO: length overall, D: distance between grips, R: radius of fillet, and RO: outer radius.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2903/2903fig3.jpgFigure 3: The bulk one-way shape memory of a single NOA63 cure, repeated 3 times (the asterisk indicates experimental onset). At the point denoted with an asterisk, the polymer has been heated and is then deformed by applying a stress to define its temporary shape. This strain is held constant, and the temperature is decreased to fix the temporary shape below the Tg of the polymer. The temperature is then increased, and the material recovers to its permanent shape as the temporary strain is reduced.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2903/2903fig4.jpgFigure 4: SMP recovery can be triggered under cell-culture-compatible temperatures. The amplitude of 25.6 ± 0.8 μm present following embossing recovered to 12.6 ± 1.5 μm after 30 h equilibration at 30 °C (time 0, black circles). After the samples were moved to a 37 °C incubator (9.5 h), the amplitude recovered to 1.1 ± 0.2 μm within 3.5 h. The amplitude recovered to ~0.3 ± 0.1 μm within 9.5 h and no detectable decrease over the final 9.5 h was observed (red triangles). Error bars represent one standard deviation (n = 4-6). Traces are contact profilometry scans of representative samples.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2903/2903fig5.jpgFigure 5: Cell actin cytoskeleton rearranges following topographic transition. a, Confocal images of cells stained with phalloidin on embossed substrates show microfilaments aligned with groove direction (white arrow) before transition and temperature increase. After transition, microfilaments have rearranged are randomly oriented. b, Cells on flat control substrates show randomly oriented microfilaments before and after temperature increase. c, Cells on grooved control substrates show microfilaments aligned with groove direction before and after temperature increase. Scale bar is 100 μm. Traces are as in Figure 4.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}