{
  "id": 9400,
  "origin_website": "Jove",
  "title": "A Single-fly Assay for Foraging Behavior in Drosophila",
  "procedures": [
    "1. Fly Collection and Starvation\nRear the experimental flies under controlled temperature and humidity conditions (e.g. 21 °C, 50-60% relative humidity) on a 12-hr light/dark cycle.\nCollect female flies on the day of eclosion and place them, along with 4-5 males, into new food vials (maximum 30 per vial). Age flies 2-5 days.\nPrepare the chambers for fly starvation.\n\t\nPush a single tissue (4.8 x 8.4 inch) down to the bottom of an empty plastic vial. Completely soak the tissue with distilled water. Use an object to push down on the tissue and gently squeeze out excess water.\nInvert the vial to discard the extra water. There should be enough water to keep the flies hydrated and the starvation chamber moist, but not enough to drown the flies.\nTransfer the flies from the food vial into a starvation chamber and plug the vial about 18-24 hr before the experiment begins. Store the vials under controlled temperature and humidity conditions overnight until the experiment begins the next day.\n2. Preparation of the Food Odor\nPrepare a 1% agarose solution by adding 0.1 g of low melting temperature agarose to 10 ml of distilled water in a glass flask. Heat the agarose solution in a microwave just until it begins to boil but well before it boils over.\n\t\nStop the microwave and swirl the flask once. Repeat this step twice more until the agarose has completely dissolved. Keep the agarose solution in a liquid state by keeping the flask warm on a hotplate set at 50 °C.\nAdd 990 μl of the 1% agarose solution and 10 μl of apple cider vinegar to a 1.5 ml Eppendorf tube to make a 1% apple cider vinegar solution. Vortex the solution until mixed and place in a dry bath incubator set to 50 °C.",
    "3. Testing Room and Behavior Chamber Setup\nSet the testing room to the desired conditions (e.g. temperature and humidity).\nTurn on the LED panel ( 660 nm).\nRinse the sieves and testing plates with hot water and heat them in a drying oven until all moisture has evaporated. Cool the sieves and plates down to the testing room temperature before beginning experiments.\nPosition a shallow dish on top of the diffuser plate and fill it with water to increase the local humidity and to mask the water in the agarose droplet.\nPosition the sieves over the water dish.\n4. Fly Loading into the Testing Plates\nDiagrams with specifications for testing plates can be found in the Supplemental Files section. The testing plate is made of clear acrylic and consists of 6 testing arenas. A simple slider contains holding chambers that permit fly loading, temporary containment, and simultaneous release of 6 flies into their respective chambers at the start of the experiment. Cross-hairs etched at the center of each arena in the plate indicate where odorants should be pipetted.\nInsert the sliders into the acrylic testing plate.\nGently slide the aspirator into the vial past the cotton plug and allow about 6 flies to walk into the aspirator.it is critical to be as gentle as possible in handling them. One may take advantage of phototactic fly behavior to induce flies to crawl towards the aspirator by pointing the vial opening towards a dim light source. If necessary, one may also apply gentle suction to aspirate approximately 6 female flies.",
    "Insert the tip of the aspirator into the first hole of the testing plate. Allow a single fly to pass into the holding cell and gently advance the slider forward to load a fly into the next hole. Continue until flies occupy all 6 holding cells of the plate.\nPipette 5 μl of 1% apple cider vinegar agarose solution directly onto the center of the cross-hairs on the inside face of the testing plate.\n5. Positioning the Testing Plate\nTo center the testing plate, open the file named \"Positioning Tool.vi.\" “LabVIEW VI for Positioning Tool. vi can be found in the Supplemental Files section. Run the file by clicking on the white arrow in the upper-left corner of the screen.\nPlace the testing plate on top of the sieve such that the arena opening faces the sieve floor and the odor target is on the ceiling of the plate. Align the crosshairs etched into back of the testing plate with the cross hairs on the monitor screen.\nWhen alignment has been completed, abort execution by clicking on the red dot located near the upper-left corner of the monitor.\n6. Record the Fly Position During the Experiment\nTo track and record the coordinates of the fly during each food search trial, open the acquisition software file \"Fly Tracking--Six Zones.vi.\" LabVIEW VIs for “Fly Tracking--Six Zones.vi” can be found in the Supplemental Files section. Run the file by clicking on the white arrow in the upper-left corner of the monitor.\nAssign the file a name and click on \"OK.\"\nAdvance the sliders in the testing chambers to release the flies into the testing arenas. Be careful not to move the testing chambers as this will lead to improper alignment with analysis software coordinates.",
    "Click on \"Start\" (recording begins) and ensure that the only source of light in the testing chamber is the 660 nm LED panel.\nWhen the trial is finished, remove the sieve and behavior chamber. Lift the testing plate from the sieve and remove the flies by submerging the plate in ice. Gently clean the plate with hot water and remove any agarose debris. Place the testing plates in a drying oven to remove moisture.\nVentilate the testing area by turning on a small fan for approximately 2 min. Turn the fan off and load the next group of flies into the next testing plate.\n7. Data Analysis Using Custom Software\n“Data Analysis for Fly Tracking—Six Zones” can be found in the Supplemental Files section. During data acquisition, the acquisition software records individual fly position coordinates for each time point in a text file. A single digital camera positioned above the testing plates acquires images at a frame rate of 0.5 Hz. The analysis software program \"Data Analysis for Fly Tracking-Six Zones\" extracts information from that text file to a) calculate the average speed, b) determine the time point at which a fly successfully located the odor source, and c) build graphical windows that allow the user to view: fly location, distance of the fly from the odor source over time and average fly speed over time. It also formats the data for easy export into a spreadsheet program. In this macro, food search latency is defined as the time point at which flies spend at least 5 sec within a 5 mm radius of the center of the arena.\nOpen the analysis software file \"Data Analysis for Fly Tracking--Six Zones\". Under the \"Windows\" tab, click on \"Create New Table.\" Repeat this step until six tables have been created.",
    "Under the \"Macros\" tab, click on \"Foodfinding.\" A Main Panel should appear with the following options: Open Raw Data File for Layout; Open Raw Data File for Data File; Fly Location; Distance; Speed; Layout; FormatDataFile.\nTo view raw data without appending values to a text file, click on \"Open Raw Data File for Layout.\" Locate and select the experimental data file in the browser window that appears. Click on \"Open.\"\nClick on \"Fly Location\" to view each fly's location in each of the six arenas ( six X-Y plots depicting each fly's position over time should appear on the screen).\nClick on \"Distance\" to view each fly's distance from the odor source ( six plots depicting the fly's distance from the odor source over time should appear on the screen). The horizontal line at y = 5 mm indicates the threshold at which the fly is considered to be located at the food source.\nClick on \"Speed\" to view each fly's average speed during the trial (six plots depicting the fly's speed over time should appear on the screen).",
    "Click on \"Layout\" to display a layout with all the fly location, distance, and speed graphs in addition to the average speed (during the first 50 sec) and latency of finding the odor source for each fly (Figure 1). To properly view the layout, it may be necessary to adjust the margins. To do this, first click on the layout window. Under the \"File\" tab, click on \"Page Setup for Layout.\" Reset the margins to 0.2 inches and click on \"OK.\" Immediately left of each location plot is a small table with the headings \"Speed\" and \"Latency.\" The values entered under each heading indicate the average speed in mm/sec and food search latency in seconds. Blank entries under Latency indicate the fly failed to locate the odor source. Food search latency is defined as the time point at which the flies spent at least 5 sec within a 5 mm radius from the center of the chamber.\nTo print a layout, click on the layout area (updates layout to current file). Click on \"File\" and then click on \"Print Layout.\"\nTo view the next file, simply click on \"Open Raw Data File for Layout.\" Click on the next raw data file you wish to view and click on \"OK.\" Click on the Layout window to update the window with the new data file.\nThe settings may be saved in an experiment file for later use.\n8. Export Data from the Data Analysis Software to a Spreadsheet Program\nTo export speed and latency data for each file, click on \"Open Raw Data File for Data File.\" Select an experimental data file and click on \"Open.\" A new browser window will appear.",
    "In the new browser window, right-click on \"New\" and then click on \"Text Document.\" Name the new text document. Select the newly named text file and click on \"Open.\" This stores data from the raw data file into the text file.\nTo export data from another file, click on \"Open Raw Data File for Data File.\" Click on another file and click on \"Open.\" Select the text file from step 8.2). Continue this process for the remaining data files you wish to export.\nOnce all the desired data files have been added to the text file, click on \"Format Data File.\" Select the Text Document used to store data from the previous steps and click on \"Open\" (a new window will automatically open).\nCreate a new Text Document in the window, assign the file a name, and click on \"Save.\" This creates a text file that contains the filename, average speed, and latency for each fly and can be imported into a spreadsheet program.\nCumulative plots are constructed from data on the total number of flies reaching the food odor target as a function of time (Figure 3).\nExperimental data sets are analyzed for statistical significance using a z-test for proportions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}