{
  "id": 17925,
  "origin_website": "Jove",
  "title": "Incorporation of a Survivable Liver Biopsy Procedure in Mice to Assess Non-alcoholic Steatohepatitis (NASH) Resolution",
  "procedures": [
    "All in vivo experiments were conducted in accordance with the policies of the Institutional Animal Care and Use Committee (IACUC) of MedImmune, LLC and in agreement with the Guide for the Care and Use of Laboratory Animals, 8th edition (2011). Male C57BL6J mice were placed onto the high-fat, high-fructose, high-cholesterol AMLN diet. Liver biopsies were performed after 26 weeks on diet, 3 weeks prior to the start of the pharmacological intervention.\n1. Obtain and Prepare Surgical Materials\nAutoclave sterile instruments (small pointed-tip scissors, blunt tip forceps, cotton swabs, gauze squares, 7 mm staples/wound clips and stapler).\nObtain, sterile suture for closing abdominal wall (5-0 coated absorbable suture with a PC-1 needle is suitable), absorbable gelatin compressed sponge (to be used for hemostatic purposes), sterile drapes and gloves, iodine-based scrub and 70% ethanol swabs/wipes, buprenorphine (0.05-0.1 mg/kg dose per mouse; at least 3 doses per mouse) and surgical eye ointment/lubrication.\nPrepare vaporizer for anesthesia by filling with isoflurane.\nTurn on a bead sterilizer, for quick instrument sterilization between animals.\nTurn on a warming surface or heating pad, to be used for animal recovery.\nDon appropriate personal protective equipment (PPE) (i.e., mask, gown, hair bonnet, gloves).\n2. Pre-surgical Preparations\nPlace the mouse into the induction chamber with 2-3% isoflurane flow to effect.\nObserve the mouse until the lack of response to toe-pinch confirms the depth of anesthesia is appropriate.\nUse an eye ointment to prevent dryness of cornea associated with anesthesia.\nAdminister buprenorphine subcutaneously (0.05-0.1 mg/kg).\nShave the surgical site immediately caudal of the xiphoid process, using animal clippers.",
    "Move the mouse to a heated surface (37 °C) after shaving the surgical site. Place the mouse in such a way so that the dorsal surface is downward, and the abdomen is exposed. Insert the nose of the mouse into the anesthesia nose cone to facilitate delivery of isoflurane at a flow rate of 2-3%.\nClean the surgical site with alternating swabs of betadine and 70% ethanol (3 times).\nOpen and set up sterile surgical instruments.\nRemove gloves and replace with sterile surgical gloves.\n3. Surgical Procedure\nMake a longitudinal incision with scissors (1-2 cm), immediately caudal of the xiphoid process and slightly to the mouse’s left side, in the abdominal skin.\nBlunt dissect the skin away from the abdominal wall using forceps and scissors.\nExpose the abdominal wall and visualize liver underneath.\nUsing a sterile scalpel blade make an incision (1-2 cm) in the abdominal wall to visualize the left-lateral lobe (LLL) of the liver.\nNOTE: Be consistent throughout the study. Other common lobes of interest are right-medial lobe (RML) and left-medial lobe (LML).\nExternalize the left lateral lobe through the incision.\nOption 1: Lightly massage the abdomen with the thumb and index finger to expose a portion of the LLL.\nOption 2: Place a sterile cotton swab underneath the LLL to gently pull a portion out to be exposed.\nPlace a sterile saline-soaked piece of gauze underneath the LLL to allow a sterile and hydrated surface for the liver to lie on.\nCut a wedge-shaped piece of the liver from the LLL by making two cuts with sterile scissors.\nNOTE: The approximate size of the liver being removed is 30-50 mg (<5% of the liver in mice).",
    "Cut a piece of gelatin sponge similar in size to the wedge piece of liver. Insert the sponge into the cut portion of the liver using forceps.\nHold the sponge in place with forceps and maintain contact with the liver until it adheres to the surface of the liver and hemostasis is achieved.\nPlace the liver biopsy piece into the appropriate tube (i.e. frozen, fixative, etc.).\nGently place the liver back into the abdominal cavity, taking care to not disturb the sponge.\nSuture the abdominal wall with 5-0 coated absorbable suture starting and ending with a full square knot.\nClose the skin with 7 mm wound clips (or staples).\nInspect the wound clips to ensure that there is a complete closure of the incision.\nRemove the mouse from the nose cone and place into a clean cage on a heated surface.\nPlace instruments into bead sterilizer in between mice for 10-20 s. Make sure all organic material should be removed from the instruments using sterile saline prior to placing in the glass bead sterilizer.\n4. Post-operative Care\nMonitor the mouse until it regains consciousness and can right itself.\nRecord post-operative observations and check the mice daily for dehiscence.\nAdminister a second and third dose of buprenorphine (0.05-0.1 mg/kg) subcutaneously 6-8 h post-surgery and again 24 h post-surgery.\nRemove wound clips at 7-10 days post-surgery."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}