{
  "id": 19352,
  "origin_website": "Jove",
  "title": "Establishment of Central Cord Syndrome Model in C57BL/6J Mouse",
  "procedures": [
    "Experiments were approved by the Laboratory Animal Ethical and Welfare Committee of Shandong University Cheeloo College of Medicine (approval number: 22021). They were performed in accordance with the Guide for the Care and Use of Laboratory Animals published by the National Institutes of Health (NIH Publications No. 85-23, revised 1996). All mice used in this study were 9-10 week old female C57BL/6J mice purchased from Jinan Pengyue Experimental Animal Company (Jinan, China). A total of 9 mice involved in this study were equally randomized to the control, mild, and severe groups. At 7, 28, and 70 days postinjury, one mouse from each group was sacrificed.\n1. C6 laminectomy and spinal cord exposure\nNOTE: The exposure was performed under a microscope. Bleeding can be avoided by paying attention to two aspects: (i) All blood vessels should be avoided. (ii) Muscles need to be separated at the origin and termination points of the muscle.\nPrepare surgical instruments and SCICP.\n\tNOTE: The structure of SCICP has been reported in previous study11. The difference with respect to the previous study is that the present protocol accomplishes spinal cord injury by compression. Two different weights (10.4 g and 20.8 g) of this platform can produce compression of 5 g/mm2 and 10 g/mm2, respectively (Figure 1). The spinal cord exposure and compression steps are shown in Figure 2.\nAdminister isoflurane to the mouse by inhalation using a nose cone (induction: 3%-5%, maintenance: 1.5%-2%).\nAfter the anesthesia takes effect, explore a small bulge at the midline behind the neck of mice, which is the spinous process of the second thoracic vertebra (T2).\nShave the hair around this bulge. Disinfect the skin with three alternating applications of an iodophor solution followed by skin antiseptics 75% ethanol.",
    "Position the mouse prone on the operation table. Apply eye ointment to protect the eyes.\nLay a 3-4 mm-thick pad under the chest to allow an arching cervical spine curve, facilitating exposure of the inter-lamina space and an unobstructed airway during operation. Inject buprenorphine as pre-operative analgesia (0.05-0.1 mg/kg, SQ).\nMake a 1-1.5 cm longitudinal incision with a sterile scalpel centered on the 2nd thoracic vertebra spinous process to expose the fascial layer (Figure 2A).\nRemove a portion of the adipose tissue above T2 with sterile micro scissors to find the T2 spinous process.\nSeparate the bilateral trapezius and rhomboid muscles from C5-T2 along the midline with micro scissors (Figure 2B).\nSeparate the muscles on the lamina of C5-T2 vertebrae with micro scissors, and retract the muscle layer to the sides with sterile micro-retractors (Figure 2C).\nCut the multifidus and cervical spinal muscles on the surface of the vertebrae.\nLocate T2 according to the highest point of the spinous processes. Probe the spinous processes successively toward the rostral end from T2 to locate C6 (Figure 3).\nLift the C6 lamina with forceps, cut off the lamina, and the spinal cord is exposed (Figure 2D).\n2. Cervical spinal cord compression injury\nClamp the C6-7 facet joints with the vertebral stabilizator, and lock it (Figure 2E).\nAim the sterile weight tip at the exposed spinal cord, and ensure the flat bottom of the tip is positioned parallel to the dorsal surface of the spinal cord (Figure 2F).\nAdjust the sleeve to make the weight compress the spinal cord. Stop adjusting when the weight keeps a constant relative position with the spinal cord (Figure 2G).\n\tNOTE: Do not make this process too violent or quick in case the weight exerts contusion force on the spinal cord.",
    "Remove the weight and the vertebral stabilizator after a 5 min compression.\nObserve the color alterations of the spinal cord after compression under the microscope (Figure 2H).\nRinse with sterile PBS and use suction to clean the operation site.\nSuture the muscles and skin in layers using polypropylene nonabsorbable suture (size: 6-0).\nDisinfect the surgical area, place the mouse on a warm pad until the mouse restores full consciousness, and then return the mouse to the mouse cage.\nInject buprenorphine for analgesia (0.05-0.1 mg/kg, SQ) every 8-12 h for 3 days.\n3. Histological analysis\nAnesthetize the mouse by intraperitoneal injection of 1.25% tribromoethanol (0.02 mL/g body weight) on days 7, 28, or 70 after injury. Transcardially infuse the mouse with 60 mL of phosphate-buffered saline (PBS) and 20 mL of 4% paraformaldehyde11.\nTransect the spinal cord at 0.5 cm from the lesion center from both sides with micro scissors, and preserve the 1 cm-long section.\nImmerse the preserved spinal cord section in 30% sucrose at 4 ˚C for 48 h.\nEmbed the tissues with OCT, slice the tissues into 6 µm thick sections with a cryotome, and collect the sections on a glass slide.\nHematoxylin and eosin staining\n\t\nRinse the 6 µm sections with 1x PBS for 5 min 3 times to remove residual OCT.\nImmerse the sections in hematoxylin for 90 s. Wash the sections under running water for 3 min.\nImmerse the sections in eosin for 4 min. Soak in 95% alcohol for 30 s to remove excess eosin.\nFinally, dehydrate the slides with alcohol (95% alcohol and 100% alcohol twice, successively) for 30 s and put the slides in a xylene bath for clearing for 2 min. Then, seal the sections with a cover glass and resin gel.\nPrussian blue staining",
    "Submerge the slides for 20 min in an equal mixture of potassium ferrocyanide (10%) and hydrochloric acid (10%).\nRinse 3 times with distilled water, and counterstain for 5 min with Nuclear Fast Red.\nRinse three times with distilled water, followed by one rinse with 95% alcohol and two rinses with 100% alcohol for 5 min.\nClear the sections in xylene twice for 3 min each and then seal with resin gel12.\nImmunofluorescence staining\n\t\nIncubate the slides with the following primary antibodies for 1 h at 37 °C: rabbit anti-Ionized calcium-binding adapter molecule 1 (Iba-1) (1:500), which was up-regulated in microglia after nerve injury; mouse anti-glial fibrillary acidic protein (GFAP) (1:300), which is expressed in astrocytes in the central nervous system; rabbit anti-neurofilament-200 (NF-200) (1:2000), which is expressed in neurofilament.\nIncubate with secondary antibodies for 1 h at room temperature (RT): Alexa Fluor488 goat anti-mouse and Alexa Fluor594 goat anti-rabbit (1:1,000).\nSnap photographs and further analyze with a fluorescence microscope13.\n4. Magnetic resonance imaging\nAnesthetize the mouse at 7 days post-injury with Isoflurane anesthesia (1%-2% isoflurane, 20%-30% O2) administered through a mini mask.\nScan the cervical spinal cord in sagittal orientation. Use the following settings for MRI imaging: Spin-echo (SE) sequence in multislice and interleaved fashion with TR/TE = 2500/12 ms, acquisition matrix =256 x 128 matrix over the field of view (FOV) = 12 x 8 mm2, slice thickness = 1 mm, and the number of excitations (NEX) = 2.\n\tNOTE: Keep the mouse's respiration rate at 10-15/min during scanning to eliminate respiration-related image artifacts14."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}