{
  "id": 8769,
  "origin_website": "Jove",
  "title": "Characterization of Glycoproteins with the Immunoglobulin Fold by X-Ray Crystallography and Biophysical Techniques",
  "procedures": [
    "1. Construct Design for Glycoprotein ECD\nEvaluate the amino acid sequence of human CD22 (Uniprot) using the InterPro and Phyre2 servers to identify predicted domain elements and boundaries located within the protein48,49.\nClone the sequence of human CD22, lacking the signal peptide, transmembrane and cytosolic domains (residues 20-687, hereafter CD22 extracellular domain, CD22 ECD) into the pHLsec mammalian expression vector25 using restriction enzymes AgeI and KpnI (Figure 2A)50.\n\tNOTE: The pHLsec vector is optimized for the overexpression of soluble, secreted proteins in mammalian cells25. This vector contains a secretion signal to allow for the extracellular secretion of soluble glycoproteins. pHLsec contains a C-terminal (His)6x tag to facilitate affinity purification from cell supernatants using immobilized metal affinity chromatography methods.\nClone truncated constructs of CD22 ECD with sequential deletions of the C-terminal Ig domains: domains 1-6 (residues 20-687), domains 1-5 (residues 20-592), domains 1-4 (residues 20-504), and domains 1-3 (residues 20-330) (Figures 2B and 2C)50.\nEvaluate the primary sequence of CD22 ECD using the NetNGlyc server to identify predicted N-linked glycosylation sites present in the construct51.\nUsing site-directed mutagenesis, by standard protocols52 or by overlapping PCR53, mutate each predicted N-linked glycosylation site (Asn to Gln and/or Asn to Ala) to create constructs of CD22 ECD that contain either a single or several N-linked glycosylation mutations.\nAfter sequence verification of cloned constructs, transform into competent E. coli DH5α cells54 and maxi-prep the DNA (as per manufacturer's instructions) to prepare for transfection.\n2. HEK293F and HEK293S Cell Establishment\nNOTE: All manipulation of HEK293F or HEK293S cells with necessary reagents and equipment must be performed in a biosafety level 2 facility in a suitable biosafety cabinet. The external surface of all items must be sterilized with a 70% ethanol solution or equivalent reagent.",
    "Obtain HEK293F and HEK293S suspension cells (see Table of Materials) and store at -80 °C until ready for use.\nWarm media (see Table of Materials) for 1 h in a 37 °C water bath. Transfer 24 mL of warmed media to a 125 mL baffled cell culture flask with a vented cap.\nObtain 1 mL cell aliquot from -80 °C and transfer to ice.\nIncubate cells in a 37 °C water bath for approximately 1 min, to partially thaw the cells. Transfer 1 mL of cells from the vial to the 125 mL baffled cell culture flask containing the media.\nClose the cell culture flask with the vented cap and place flask in a shaker set to 37 °C, 130 rpm, 70% humidity, and 8% CO2.\n3. HEK293 Cell Maintenance\nNOTE: Cell density and viability of cells must be checked approximately 24 h after thawing. This step ensures that cells are recovering following inoculation; initial viability should be >80%.\nCarefully remove 10 µL of cells from the 125 mL flask containing the fresh suspension cells and transfer it into a sterile 1.5 mL microtube. Close the flask and return it to the incubator.\nPipette 10 µL of Trypan blue solution into the 1.5 mL microtube containing the cells, mix thoroughly and transfer 10 µL to the chamber of the counting slide.\nPut the counting slide into an automatic cell counter and obtain values for cell density (in units of cells mL-1) and cell viability (in percentage).\nCalculate the volume of cells that would be required to inoculate a fresh 200 mL culture at a final density of ~0.8 x 106 cells mL-1 using the following equations:\nimgsrc://cloudfront.jove.com/files/ftp_upload/57750/57750eq1.jpg    (1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/57750/57750eq2.jpg   (2)\n\tNOTE: It may take ~ 5 d to obtain a suitable cell density for inoculation into a 200 mL culture.",
    "Once the cell density is sufficient for inoculation of a 200 mL culture, warm-up media for 1 h in a 37 °C water bath and transfer the warmed media into the biosafety cabinet.\nUsing a serological pipette, carefully transfer the required volume of media (as calculated in equation 2) into a 500 mL baffled cell culture flask with a vented cap.\nUsing a serological pipette, transfer the required volume of suspension cells (calculated in equation 1) into the 500 mL baffled cell culture flask containing the media.\nCap the new 200 mL maintenance stock and return it to the incubator. Grow cells to a density of approximately 3 x 106 cells mL-1. Passage cells at a density of 0.8 x 106 cells mL-1 every 2-3 d to maintain a stable culture of cells (as described in section 3.4-3.7). Do not allow the cells to exceed a density of ~4 x 106 cells mL-1.\n4. Transfection of HEK293 Cells for Glycoprotein Expression\nCalculate the volume of cells and media that is required for a 200 mL culture for transfection at 0.8 x 106 cells mL-1 (using equations 1 and 2 from section 3.4).\n\tNOTE: The number of 200 mL transfections that can be performed depends on the cell density of the maintenance stock.\nTransfer the required volume of media and cells for transfection into a new 500 mL cell culture flask with a vented cap and return the cell stock to the incubator.\nIncubate cells for 1 h prior to transfection to allow cells to acclimatize following splitting.\nTransfer 50 µg of DNA into a sterile 50 mL conical tube and dilute with 5 mL of media. Vacuum filter the diluted DNA using a 0.22 µm filtration system into another sterile tube.",
    "Mix diluted, filtered DNA in a 1:1 mass:volume ratio with transfection reagent. Gently swirl the DNA:transfection reagent solution to mix and incubate the solution at room temperature for 10 min.\nAdd DNA:transfection reagent solution directly to the cells. Incubate transfected cells at 37 °C, 130 rpm, 70% humidity, and 8% CO2 in a shaker for 5-7 d.\n5. Optimization of Cell Transfection Conditions\nNOTE: To optimize cell transfection conditions for maximum glycoprotein yield, transfect cells at a variety of initial cell densities and assess protein yield over time (Figure 3A). Transfect cells as described in section 4, at initial cell densities ranging from 0.5 x 106 to 2 x 106 cells mL-1 55. Trial transfections can be scaled down to 25 mL total volume (in 125 mL baffled cell culture flask) with 6 µg of DNA to save space and reagents. The amount of DNA can also be optimized55.\nEvery day post-transfection (days 1-7), transfer a 500 µL aliquot from the cell culture into a sterile 1.5 mL microtube (in the biosafety cabinet).\nSpin aliquoted cells at 12,000 x g for 5 min in a microcentrifuge immediately after collection. Transfer supernatant to a new 1.5 mL microtube and store at 4 °C until all samples are obtained.\nQuantitate secreted glycoprotein by densitometry\n\t\nOnce all samples are obtained, aliquot 20 µL of each sample into a new 1.5 mL microtube and mix with 6 µL of non-reducing 4x Laemmli sample buffer.\nBoil samples for 5 min at 95 °C in a thermo-block. Spin samples for 1 min at 12,000 x g in a microcentrifuge.\nLoad 20 µL of each sample per well in a 10-well 4-15% gradient SDS-PAGE gel. Include one lane for protein size markers. Run gel at 250 V for 20 min in a Tris/Glycine/SDS buffer.",
    "Following run completion, transfer gel to Coomassie stain (see Table of Materials) for 20 min. De-stain gel in ddH2O for 20 min. Image gel.\nPerform densitometry with ImageJ, following standard protocols57,58.\nCompile and plot data with 'days post-transfection' on the X-axis and 'densitometry values' on the Y-axis (Figure 3A).\n\t\t​Note: Alternatively, if protein expression is insufficient for visualization by SDS-PAGE, techniques such as Western blotting may be used56.\nQuantitate secreted glycoprotein by BLI\n\t\nUsing Ni-NTA biosensors, quantitate the amount of secreted glycoprotein using BLI59.\nCompile and plot data with 'days post-transfection' on the X-axis and 'protein concentration (µg/mL)' on the Y-axis (Figure 3A).\n6. Purification of Soluble Glycoprotein from HEK293 Supernatant\nHarvest cells by centrifugation at 6,371 x g for 20 min at 4 °C. Retain supernatant containing secreted CD22 ECD and filter using a 0.22 µm filter.\nLoad supernatant at 4 mL min-1 on a pre-equilibrated (20 mM Tris pH 9.0, 150 mM NaCl, 5 mM imidazole) Ni-NTA column (5 mL volume) using a benchtop chromatography system.\n\tNOTE: Other affinity-based purification techniques may be used, based on the affinity tags included in construct design in Section 1.\nFollowing supernatant loading, wash the affinity column with 3-4 column volumes (CV) of wash buffer (20 mM Tris pH 9.0, 150 mM NaCl, 5 mM imidazole).\nElute purified glycoprotein from the column using a 4-100% gradient (4 CVs) of elution buffer (20 mM Tris pH 9.0, 150 mM NaCl, 500 mM imidazole) while collecting fractions (Figure 3B).\nPool fractions containing the eluted peak in an centrifugal filtration device with a 10 kDa nominal molecular weight limit (NMWL) and concentrate by centrifuging at 4,000 x g at 4 °C for 15 min or until the sample reaches a volume of 500 µL.",
    "Inject concentrated glycoprotein into a 500 µL sample loop and load at 0.5 mL min-1 onto a pre-equilibrated (20 mM Tris, pH 9.0, 150 mM NaCl) high-performance size exclusion column (approximately 24 mL volume) on a fast protein liquid chromatography (FPLC) system at 4 °C while collecting fractions (Figure 3C).\nRun SDS-PAGE gel of eluted fractions to identify fractions containing the glycoprotein, and pool corresponding fractions. The SDS-PAGE gel can be run as described in Section 560.\n7. Deglycosylation of Purified Glycoprotein\nMeasure the concentration of purified protein following size exclusion chromatography by using absorbance at 280 nm divided by the extinction coefficient (e.g., 1.418 M-1 cm-1 for CD22 ECD).\n\tNOTE: The theoretical extinction coefficient of proteins of interest can be calculated using servers such as ExPASy ProtParam61.\nIncubate purified protein with Endo H for 1 h at 37 °C, at a ratio of 1 mg of purified protein to 10 µL of commercial enzyme in 1X Endo H buffer (as per manufacturer's instructions).\n\tNOTE: Endo H cleaves high mannose glycans produced in HEK293S leaving a single GlcNAc moiety at each glycosylation site21. Endo H does not cleave glycans on proteins produced in HEK293F cells22, however other enzymes can be used for this purpose (e.g.,PNGaseF24).\nConcentrate deglycosylated ECD to 500 µL and run gel filtration chromatography on a high-performance size exclusion column (approximately 24 mL volume) at 0.5 mL min-1 on an FPLC to remove Endo H and separate any resulting aggregates.\nStore the deglycosylated protein at 4 °C until use in downstream experiments.\n8. Crystallization of Glycoproteins\nNOTE: Perform crystallization trials using commercially available screens and set up sitting drop experiments using a crystallization robot.",
    "Concentrate pure, deglycosylated ECD to 10 mg mL-1 using a centrifugal filtration device with 10 kDa NMWL at 4,000 x g (4 °C) until the desired concentration is obtained.\nDetermine the protein concentration by using absorbance at 280 nm and dividing by the extinction coefficient.\nCentrifuge sample at 12,000 x g for 5 min at 4 °C prior to crystallization trials to remove unwanted dust or other contaminants from sample.\nFill the reservoir wells of 96-well sitting drop crystallization plates with 80 µL of crystallization solution from a commercial crystallization screen.\n\tNOTE: We use sparse-matrix commercial screens that have been designed based on the most successful crystallization conditions with respect to structures deposited in the PDB.\nUsing a crystallization robot, dispense drops into the well of the crystallization plate with a total drop volume of 200 nL at a ratio of purified protein:crystallization solution of 1:1.\nOnce the entire plate has been dispensed, seal the plate with tape and place into a plate imager for inspection by visible and ultraviolet light.\nInspect crystallization plates immediately following setup, and in the following weeks, using both visible and ultraviolet light to identify conditions that give initial glycoprotein crystal hits.\nFurther optimize crystals obtained from initial crystallization hits using fine screens based on the condition of the crystal hit or random matrix micro-seeding methods62,63,64,65.\nCryo-protect any crystals lacking sufficient cryo-protectant within the crystallization condition by soaking the crystal in mother liquor solution supplemented with 20% (v/v) glycerol solution (or equivalent cryo-protectant, such as ethylene glycol or polyethylene glycol 400).\nMount crystals in cryoloops and flash freeze them in liquid nitrogen prior to data collection on a home source diffractometer or using synchrotron radiation.\n9. Phasing Using Heavy Atom Derivatization",
    "NOTE: Before any manipulation of HA compounds, safety aspects must be considered. HA compounds used in protein crystallography are selected for their strong affinity to biological molecules and pose risks to human health from prolonged exposure. Take appropriate safety steps for HA compounds as mentioned in their Material Safety Data Sheets.\nTo test different HA compounds, concentrations, and incubation times, reproduce well-diffracting crystals obtained in Section 8 in a 24-well crystallization plate using the hanging-drop vapour diffusion method66.\nDecide which HA will be used for crystal derivatization. Servers (e.g., the Heavy-atom Database System67) can assist with HA compound selection, ensuring they are appropriate for the protein and crystallization condition.\n\tNOTE: HA screens are also commercially available for easy screening of most effective HA compounds for phasing. A set of \"magic seven\" HA compounds have been previously described to have high probability of success for HA derivatization68.\nSet up workstation for HA soaking (Figure 4A). Using a cryoloop, rapidly transfer crystals to a 0.2 µL drop on a 22 mm cover slip containing HA solution diluted in the crystallization condition such that the final concentration of HA ranges from 1-20 mM. Seal the drop and incubate for different lengths of time (Figure 4B). A good starting point is 5, 10, 60, and 90 min and overnight.\nVisually inspect crystals with a light microscope to identify possible cracks or changes in color, which can indicate adverse effects to the glycoprotein crystal or crystal derivatization.\nMount crystals in cryoloops and back-soak crystals for 30 s in three consecutive 0.2 µL drops containing mother liquor solution supplemented with 20% (v/v) glycerol (or alternate cryo-protectant)69. Back-soaking the crystals removes HA compound that was non-specifically bound and reduces partial occupancy caused by weak HA binding. Flash freeze crystals in liquid nitrogen (Figure 4B).",
    "For data collection, processing, structure solution, and refinement, use previously described protocols26,70,71,72.\n10. Soaking Glycoprotein Crystals with its Ligand\nReproduce well-diffracting crystals obtained in Section 8 in a 24-well crystallization plate using the hanging-drop vapor diffusion method.\nPrepare a stock solution of 50 mM ligand in 20 mM Tris, pH 9.0, 150 mM NaCl.\n\tNOTE: The concentration of the ligand should be prepared according to the affinity to its glycoprotein. If the affinity is unknown, it might be required to use a method such as ITC (Section 12.2) to determine the affinity prior to beginning soaking experiments. Ensure that the ligand is soluble at the desired concentration in the required buffer.\nAdd varying concentrations of the ligand to the drop containing ECD crystals and seal the drop for incubation at time lengths ranging between 5 min to 5 d.\nVisually track crystals with a light microscope to identify possible changes in morphology.\nMount crystals in cryoloops and cryo-protect them in mother liquor solution supplemented with 20% (v/v) glycerol (or other cryo-protectant such as ethylene glycol or low molecular weight polyethylene glycol 400)69.\nFor data collection, processing, structure solution and refinement, use previously described protocols73,74,75.\n11. Production of Fragment Antigen Binding (Fab)\nSubclone genes that correspond to Fab heavy chain (HC) and light chain (LC) sequences of anti-ECD antibodies, e.g.,epratuzumab.\n\t​NOTE: Alternatively, IgG can be cleaved by the enzyme papain to generate Fab fragments76.\nTransfect cells as described in Section 4, with the following modifications:\n\t\nUse a total mass of DNA for transfection of Fab fragments of 90 µg per 200 mL of culture.\nTransfect HC and LC plasmids in a 2:1 ratio to reduce the amount of LC dimer formation.\nAfter 7 d of incubation, harvest cells, retain supernatant and filter with a 0.22 µm vacuum-driven filtration device.",
    "Equilibrate anti-LC (kappa or lambda) affinity columns in PBS buffer using a benchtop chromatography system.\n\tNOTE: If LC dimer formation is an issue during purification, Protein G affinity chromatography can be used as an alternative to kappa/lambda LC affinity purification.\nLoad supernatant on affinity column at 4 mL min-1. Following sample loading, wash column with 3-4 CVs of PBS.\nElute protein from column using an isocratic elution with 100 mM glycine, pH 2.2, immediately neutralizing the eluted fractions with 10% (v/v) 1 M Tris, pH 9.0 in each fraction.\n\tNOTE: The eluted Fab can be further purified by ion exchange chromatography and/or size exclusion chromatography using a FPLC at 4 °C.\n12. Characterization of Fab and Small Molecule Binding to the Glycoprotein\nBiolayer interferometry\n\t\nPrepare 50 mL of 1x kinetics buffer (1x PBS, 0.002% (v/v) Tween-20, 0.01% (w/v) BSA).\nHydrate six Ni-NTA biosensors in 200 µL of 1x kinetics buffer for 10 min in a pre-wetting plate.\nDilute His-tagged ECD in 1 mL of 1x kinetics buffer at a final concentration of 25 ng µL-1. Pipette serial dilutions of purified Fab into 200 µL of 1x kinetics buffer, with a high concentration of 500 nM, and subsequent serial dilutions of 250 nM, 125 nM, and 62.5 nM.\nAliquot reagents into black flat bottom polypropylene 96-well microplate as shown in Figure 5A, where each well contains 200 µL of the indicated solution.\nCollect data using the Kinetics Assays in the Data Acquisition software, as described previously38,39,77 (Figure 5A).\n\t\t\nBriefly, transfer the biosensors into wells containing 1x kinetics buffer to baseline for 60 s before loading 25 ng µL-1 of glycoprotein for 240 s (or until a threshold of 1.0 nm is reached) at 1,000 rpm.",
    "After a second baseline of 60 s in 1x kinetics buffer, transfer the biosensors into wells containing the serial dilution of Fab. The 180 s association phase is subsequently followed by a 180 s dissociation step in 1x kinetics buffer.\n\t\t\tNote: Biosensors can be reused if the above protocol is followed by a regeneration step, which consists of three cycles of washing the biosensors in stripping buffer (PBS with 500 mM imidazole) for 5 s followed by 5 s in 1x kinetics buffer for neutralization. Biosensors can be reused up to ~10-20 times during the same day, or until poor data quality is observed.\nAnalyze the data using the analysis software (Figure 5A):\n\t\t\nUnder Tab 1, import and select data.\nUnder Tab 2, Step 1: Data Selection, select 'Sensor Selection' and highlight reference wells (rows E and F, Figure 5A), right click and set to reference well. Under Step 2: Subtraction, select 'Reference Wells'. Under Step 3: Align Y-axis, select 'Baseline' from time range of 0.1 to 59.8 s. Under Step 4: Inter-step Correction, select 'Align to dissociation.' Under Step 5: Process, select 'Savitzky-Golay filtering' and press Process Data.\nUnder Tab 3, select 'Association and Dissociation' under Step to Analyze with a 1:1 model. Select 'Global fitting' and 'Group by Color'. Right click curves, select 'Change color', set all curves to the color of your choosing. Select 'Fit Curves'. If data are well fitted, a report can be exported by selecting 'Save Report'.\nRepeat experiment with glycoprotein produced in HEK293F and HEK293S cells (Section 5) and following Endo H treatment (Section 7) to assess the effect, if any, of different glycoforms on Fab recognition. Furthermore, repeat the experiment with ECD truncations to provide insight into the domain(s) bound by the Fab.\nIsothermal titration calorimetry of Fab-glycoprotein interaction",
    "​Note: ITC experiments described here are performed using an automated ITC instrument. Experiments are carried out in a 1 mL round bottom 96-well block.\n\t\nDialyze the ECD and Fab in a single 4 L beaker of 20 mM Tris, pH 8.0, 150 mM NaCl at 4 °C overnight with a stir bar.\nConcentrate dialyzed ECD and Fab to 5 µM and 50 µM, respectively, using a centrifugal filter with 10 kDa NMWL, ensuring to wash the concentrator membranes three times with 5 mL of dialysis buffer at 4,000 x g for 5 min at 4 °C prior to use.\n\t\tNOTE: Any mismatch in buffer between samples in the cell and syringe can cause undesired heat to be released during the ITC experiment and result in data of poor quality.\nFor experiment 1: add 400 µL of ECD to A1 to be loaded in the cell, and 120 µL of the Fab to well A2 to be loaded in the syringe. Well A3 is left empty to return the mixed sample following experiment completion. Each subsequent experiment can be added to the plate in the same order (i.e., experiment 2: cell - A4, syringe - A5, empty well - A6; Figure 5B).\n\t\tNote: Include buffer into buffer controls (to confirm the instrument is behaving well) at the beginning and end of each run, as well as ligand (in syringe) into buffer (in cell) controls to calculate the heat of dilution for the sample in the syringe. This calculated heat of dilution should then be subtracted from raw experimental data during data analysis (Figure 5B).",
    "Run a total of 16 injections with a volume of 2.5 μL for each injection. The injection duration is 5 s, with 180 s spacing between injections. Set the cell temperature to 25 °C, with a stirring speed of 750 rpm and a filter period of 5 s.\n\t\tNOTE: Based on the affinity and thermodynamics of the ECD:Fab interaction, it may be necessary to change the sample concentration, number of injections or cell temperature.\nAnalyze the data with the analysis software, as described previously40,41,43 (Figure 5B).\nRepeat the experiment at least in duplicates, calculating mean KD values and standard errors. Repeat experiment with ECD of different glycoforms (Sections 5 and 6) to assess the effect, if any, of glycoforms on the thermodynamics of the Fab:glycoprotein interaction.\nFor isothermal titration calorimetry of ligand-glycoprotein interactions, set up the ITC experiment as described in Section 12.2, with the following changes:\n\t\nDialyze ECD in 4 L of dialysis buffer overnight. Dissolve the ligand using dialysis buffer following completion of dialysis.\nPerform ITC experiments at significantly higher concentrations to be able to detect low-affinity interactions. For the ECD and ligand interaction, perform ITC experiments at concentrations of 100 µM of ECD in the cell and 1 mM of ligand in the syringe."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}