{
  "id": 1786,
  "origin_website": "Cell",
  "title": "Integrated single-cell sequencing of 5-hydroxymethylcytosine and genomic DNA using scH and G-seq",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIn the protocol below, we provide details of performing scH&G-seq and the corresponding data processing steps to analyze the Illumina sequencing data (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1237-Fig1.jpg\nFigure 1. Schematic of scH&G-seq\nIn scH&G-seq, cells of interest are first sorted into 384-well plates containing the lysis buffer. Next, AluI and/or BseRI are added to digest genomic and mitochondrial DNA. Following this step, protease treatment is used to strip off chromatin. Thereafter, 5hmC marks in the genome are glucosylated by T4-BGT and then protease treatment is used to degrade T4-BGT. Genomic DNA marked by modified 5hmC sites are then cut by AbaSI, which is followed by ligation with AbaSI-/BseRI-specific and AluI-specific double-stranded adapters. Next, single cells are pooled and amplified by in vitro transcription. Finally, after reverse transcription (RT) and PCR amplification, the Illumina libraries are ready for sequencing.\nNote: In each reaction mix table, the final concentration for each reagent added is calculated based on its concentration in the final solution volume in the 384-well plate rather than its concentration in the mix being added.\nPrepare plates for FACS by adding lysis buffer\nTiming: 1–2 h\nAdd a lysis buffer to each well of a 384-well plate. This step is performed prior to FACS to ensure that once single cells are sorted into this solution, they are lysed and the plate can be stored at −80°C until processed.\nTo each well of a Vapor-Lock containing 384-well plate, add the lysis buffer as described below using a liquid handling robot:\ntable:files/protocols_protocol_1237_7.csv\nSeal the 384-well plates with a Greiner multiwell plate seal, and briefly spin the plate down at 2500 rpm. Always keep plates on ice except when directly handling them.\nIsolate and FACS sort single cells\nTiming: 2–6 h (depending on the number of plates sorted)",
    "To make a single cell suspension of H9 cells (or cells of interest) and to sort one cell into each well of a 384-well plate, proceed as follows:\nWash cells twice with 2 mL of 1× DPBS.\nAdd 0.5 mL of TrypLE select (1×) solution to one well of a 6-well plate and incubate the plate at 37°C until cells begin to lift (3–5 min).\nAdd serum-containing media to neutralize the TrypLE solution, collect the cells in a new 15 mL conical centrifuge tube and spin the tube at 300 g for 5 min to pellet the cells.\nAspirate the medium and resuspend the pellet in 1 mL of 1× DPBS. Make a single-cell suspension by gently triturating with a P1000 pipette. Always keep the tube on ice except when handling it.\nAdd propidium iodide (PI) to distinguish between live and dead cells, thereby increasing the capture efficiency. The final concentration of PI should be between 1 and 50 μg/mL.\nFilter cells using a FACS test tube with a cell strainer snap cap to remove large cellular clumps. After filtration, sort cells from this test tube.\nSet up the FACS machine to sort single cells into a 384-well plate.\nIf you are unsure whether the microfluidics of the FACS machine was cleaned prior to use, clean the instrument with 10% bleach. For the Sony SH800 cell sorter, follow the Bleach Cleaning wizard in the sorter software.\nSet the sample area to 4°C and, if possible, set the collection area on the FACS machine to 4°C as well.",
    "Use an empty 384-well plate sealed with a Greiner multiwell plate seal to perform a mock sort. Do this by dispensing 50 droplets of sheath fluid onto the seal covering the plate. Check that the droplets are centered on the wells of the plate. If they are not, adjust the alignment and re-perform the mock sort. Perform this mock sort on one fourth of all wells spread across the plate to ensure that the plate is properly aligned.\nCritical: Accurate alignment of droplets on the 384-well plate is needed for successfully sorting single cells into the plate.\nOnce the 384-well plate is well-aligned, sort a single cell into each well of the 384-well plate. Identify single cells using forward scatter and backscatter (or side scatter depending on the sorter).\nAfter sorting a plate, seal it with a Greiner multiwell plate seal, and briefly spin the plate down at 2500 rpm. If sorting multiple plates, place the sorted plate on ice (or transfer to −80°C freezer) and sort the next plate following the same protocol.\nOptional: Leave a few wells unsorted as a negative control. Sequencing results from these negative wells will behave similar to poorly sorted wells. If you get a significant number of sequencing reads that map to these negative wells, it indicates genomic DNA contamination.\nNote: mTeSR1 does not contain serum. If serum containing media is unavailable, neutralize the TrypLE solution with a 5% fetal bovine serum solution in 1× DPBS.\nNote: Gentle pipetting is important to make a single cell suspension but over pipetting can reduce cell viability and increase cellular debris.",
    "Note: Single cells have a smaller forward scatter area and width when compared to doublets, but a similar forward scatter height. Additionally, single cells display higher forward scatter and lower back scatter than cellular debris. A high proportion of your cells should be viable single cells. Viable cells should contain no emission from propidium iodide.\nPause point: After sorting, plates can be stored at −80°C until ready to continue. Stored plates have similar success in generating high-quality Illumina libraries, even for plates that have been stored for up to 1 year.\nRestriction digestion of genomic DNA\nTiming: 2 h\nGenomic DNA is digested with the enzyme(s) of choice to sequence the genome in scH&G-seq. Simultaneous digestion with both BseRI and AluI is described here, but the options for digesting with only one of the two enzymes are also discussed.\nIncubate the plate for 5 min at 65°C and then return it to 4°C or ice.\nDigest genomic DNA simultaneously with both BseRI and AluI by adding the following mix to each well of the 384-well plate using a liquid handling robot.\nBseRI and AluI digestion master mix:\ntable:files/protocols_protocol_1237_8.csv\nSeal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.\nIncubate in a thermocycler as follows:\ntable:files/protocols_protocol_1237_9.csv\nThe total volume per well will be 700 nL (excluding Vapor-Lock).\nOptional: If only BseRI is used, replace the digestion mix in step 11a with the following mix. Perform steps 11b and 11c as described above.\ntable:files/protocols_protocol_1237_10.csv\nOptional: If only AluI is used, replace the digestion mix in step 11a with the following mix. Perform steps 11b and 11c as described above.\ntable:files/protocols_protocol_1237_11.csv",
    "Optional: If the goal is to detect only 5hmC and no genomic DNA, replace the digestion mix in step 11a with the following mix. Perform step 11b as described above but skip step 11c.\ntable:files/protocols_protocol_1237_12.csv\nNote: Digestion of genomic DNA here is performed prior to stripping off chromatin to maximize reads derived from mitochondrial DNA. Mitochondrial reads can be useful for clonal lineage reconstruction as regions of the mitochondrial genome have higher rates of mutation compared to genomic DNA (Wallace, 1994[href=https://www.wicell.org#bib7]; Ludwig et al., 2019[href=https://www.wicell.org#bib3]; Xu et al., 2019[href=https://www.wicell.org#bib10]).\nStripping chromatin from genomic DNA\nTiming: 1 day\nProtease is added to remove chromatin, enabling the genome-wide detection of 5hmC.\nIf no Qiagen protease solution is available, starting from the lyophilized powder make a fresh Qiagen protease solution at a concentration of 100 μg/μL in nuclease-free water.\nCritical: Make the Qiagen protease solution under RNase-free conditions. A sterile pipette tip can be used instead of a traditional spatula to scoop out the lyophilized powder, while maintaining RNase-free conditions.\nNote: Qiagen protease solution can be stored at −20°C for up to one month.\nAdd the following mix to each well of the 384-well plate using a liquid handling robot.\nProtease master mix:\ntable:files/protocols_protocol_1237_13.csv\nSeal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.\nPerform the following:\ntable:files/protocols_protocol_1237_14.csv\nThe total volume per well will be 2.5 μL.\nPause point: Plates can be stored for 12 h at 4°C.\nGlucosylation of 5hmC sites in the genome\nTiming: 1 day",
    "AbaSI has approximately 1,000 times more affinity for detecting 5hmC compared to 5-methylcytosine (5mC), but it has nearly 10,000 times greater affinity towards detecting beta-glucosyl-5-hydroxymethylated cytosine (5ghmC) compared to 5mC (Wang et al., 2011[href=https://www.wicell.org#bib8]). Therefore, to significantly improve the specificity of 5hmC detection, T4 Phage β-glucosyltransferase (T4-BGT) is added to convert 5hmC sites in the genome to 5ghmC.\nConvert 5hmC to 5ghmC by adding the following mix to each well of the 384-well plate using a liquid handling robot.\nBGT master mix:\ntable:files/protocols_protocol_1237_15.csv\nSeal the plate with a Greiner multiwell plate seal and briefly spin down the plate at 2500 rpm.\nPerform the following:\ntable:files/protocols_protocol_1237_16.csv\nThe total volume per well will be 3 μL.\nPause point: Plates can be stored for 12 h at 4°C.\nProtease treatment to degrade T4-BGT\nTiming: 5 h\nProtease is added to the reaction mixture to degrade T4-BGT.\nIf no Qiagen protease solution is available, make a fresh Qiagen protease solution at 100 μg/μL concentration in nuclease-free water as described in step 12.\nDegrade T4-BGT by adding the following mix to each well of the 384-well plate using a liquid handling robot.\nProtease master mix:\ntable:files/protocols_protocol_1237_17.csv\nSeal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.\nPerform the following:\ntable:files/protocols_protocol_1237_18.csv\nThe total volume per well will be 3.5 μL.\nPause point: Plates can be stored for 12 h at 4°C.\nAbaSI digestion\nTiming: 3 h\nAbaSI is added to selectively cut genomic DNA downstream of 5hmC and 5ghmC sites, leaving a 2-nucleotide 3′ overhang.\nCut genomic DNA downstream of 5hmC and 5ghmC sites by adding the following mix to each well of the 384-well plate using a liquid handling robot.\nAbaSI digestion master mix:\ntable:files/protocols_protocol_1237_19.csv",
    "Seal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.\nPerform the following:\ntable:files/protocols_protocol_1237_20.csv\nThe total volume per well will be 4 μL.\nLigating double-stranded adapters to fragmented genomic DNA molecules\nTiming: 1 day\nThe double-stranded adapters are ligated to genomic DNA fragments cut by AluI, BseRI, and AbaSI. These adapters are specific for each enzyme and uniquely barcoded so that single cells can be pooled downstream in the protocol. The adapters also contain a part of the Illumina read 1 adapter sequence and a T7 promoter sequence.\nAdd 200 nL of the 64 nM blunt phosphorylated double-stranded adapter to each well of the 384-well plate using a liquid handling robot. Use one unique adapter per well (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1237-Fig2.jpg\nFigure 2. Dispensing double-stranded adapters from 96-well plates to a 384-well plate\nBoth AbasI-/BseRI-specific double-stranded adapters and AluI-specific double-stranded adapters are dispensed from 96-well plates to a 384-well plate containing cells of interest. The double-stranded adapter in well A1 of the 96-well plate is dispensed into wells A1, A2, B1, and B2 of the 384-well plate. Similarly, the double-stranded adapter in well A2 of the 96-well plate is dispensed into wells A3, A4, B3, and B4 of the 384-well plate and so on. The color scheme in the figure above indicates how double-stranded adapters in 96-well plates are dispensed into a 384-well plate containing single cells. After ligation, the single cells in the 384-well plate are pooled into four microcentrifuge tubes, with each tube containing 96 single cells with distinct barcodes.\nAfter adding the double-stranded adapter, seal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.",
    "Add 200 nL of the 75 nM random 2-nucleotide 3′ overhang phosphorylated double-stranded adapter to each well of the 384-well plate using a liquid handling robot. Use one unique adapter per well (Figure 2[href=https://www.wicell.org#fig2]).\nAfter adding the double-stranded adapter, seal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.\nLigate the adapters to the fragmented genomic DNA molecules by adding the following mix to each well of the 384-well plate using a liquid handling robot.\nT4 DNA ligase master mix:\ntable:files/protocols_protocol_1237_21.csv\nSeal the plate with a Greiner multiwell plate seal and briefly spin the plate down at 2500 rpm.\nPerform the following:\ntable:files/protocols_protocol_1237_22.csv\nThe total volume per well will be 5 μL. The combined concentration of NEBuffer 4 and T4 DNA ligase buffer is 1×.\nCritical: The cells that you want to pool together must have uniquely barcoded double-stranded adapters added at this step. Do not add more than one barcoded double-stranded adapter of each adapter type to a single reaction well.\nCritical: Wash the tips of the robot three times with the pre-programed “Eject Wash Rinse” program after each adapter dispenses to prevent inadvertently mixing the double-stranded adapters.\nCritical: Document the double-stranded adapters used for each cell. 5hmC derived (from AbaSI) and BseRI derived genomic DNA reads will have the same barcode for a given cell, while AluI derived genomic DNA reads will have another set of barcodes. AbaSI/BseRI barcodes and AluI barcodes for the same cell will later be matched during data processing. Without this documentation, it will not be possible to pair the 5hmC derived reads, and the BseRI and AluI derived reads to the same cell.",
    "Note: ATP and the T4 DNA ligase buffer, which contains ATP, degrade with multiple freeze thaw cycles. Aliquot these components as necessary to limit the number of freeze thaw cycles.\nOptional: If AluI is not used to digest genomic DNA, do not add the blunt phosphorylated double-stranded adapters (skip step 18). In addition, replace the ligation mix (step 20a) with the following mix shown below. Thereafter, perform steps 20b and 20c as described above.\ntable:files/protocols_protocol_1237_23.csv\nPause point: Plates can be stored at −20°C until ready to continue.\nPooling single cells and DNA cleanup\nTiming: 3 h\nEach well containing distinctly barcoded DNA molecules from an individual cell in the 384-well plate is pooled together manually. A standard 1× DNA bead cleanup is performed to exchange the buffer.\nUse a manual pipette (a 12-channel P20 is recommended) to pool cells that are uniquely barcoded (both AbaSI/BseRI barcodes and AluI barcodes) into a 1.5 mL microcentrifuge tube. Each well of the 384-well plate should contain a total volume of 9 μL (4 μL Vapor-Lock and 5 μL of aqueous solution) (Figure 2[href=https://www.wicell.org#fig2]).\nDepending on the numbers of AbaSI/BseRI and AluI barcodes used, more than one 1.5 mL microcentrifuge tube might be required to pool cells from the entire plate. For example, if 96 AbaSI/BseRI barcodes and 96 AluI barcodes were distributed over a 384-well plate, four 1.5 mL microcentrifuge tubes will be required to pool cells.\nTo pool a plate formatted as described in Figure 2[href=https://www.wicell.org#fig2], for the first barcoded set of 96 cells, pool all odd rows and odd columns. Use a 12-channel P20 pipette to aspirate all liquid from wells A1, A3, A5…A23, then eject the liquid into a 12-tube PCR strip.",
    "Return to the plate and aspirate wells C1, C3, C5…C23, then eject the liquid into the same 12-tube PCR strip.\nContinue this pattern until the odd columns of row O have been transferred into the same 12-tube PCR strip. The same tips can be used throughout this process but should be discarded after transferring the odd columns of row O.\nTransfer the material from the 12-tube PCR strip into a 1.5 mL microcentrifuge tube. The pooling of one set of 96 uniquely barcoded cells are now complete.\nRepeat this process using new tips, a new 12-tube PCR strip and a new 1.5 mL microcentrifuge tube to pool all even rows and odd columns. This will result in the second set of 96 uniquely barcoded cells.\nRepeat this process using new tips, a new 12-tube PCR strip and a new 1.5 mL microcentrifuge tube to pool all odd rows and even columns. This will result in the third set of 96 uniquely barcoded cells.\nRepeat this process again using new tips, a new 12-tube PCR strip and a new 1.5 mL microcentrifuge tube to pool all even rows and even columns. This will result in the fourth set of 96 uniquely barcoded cells. At this point the 384-well plate has been distributed into 4 libraries and each library has its own 1.5 mL microcentrifuge tube.\nSpin the tubes at 5,000 g for 1 min. The mixture should separate into two distinct phases.\nUse a P200 pipette to remove as much of the upper oil phase as possible.\nNext, use a P1000 pipette to quickly plunge through any of the remaining oil phase and transfer the aqueous phase to a new tube.",
    "The pipette should go through the oil phase only once to collect all the solution in the aqueous phase. If the oil and aqueous phases begin to mix prior to complete separation of the aqueous phase, repeat steps 22–24.\nThe samples are not amplified at this point. To minimize sample loss, collect as much of the aqueous layer as possible, and ideally leave behind less than 10 μL of the aqueous phase. It is best practice to not aspirate any of the oil phase as it can complicate step 25.\nCritical: Minimize transferring the oil phase during the phase separation. The presence of oil makes the DNA bead cleanup step more challenging as the beads become hydrophobic and do not dry easily. While the presence of oil does not affect the quality of the final Illumina libraries, it can increase handling time during the bead cleanup step. Therefore, if some oil is still present in the aqueous phase after the transfer in step 24, repeat steps 22–24 to remove the oil.\nMeasure the volume transferred to the new tubes with a P1000 pipette and perform a 1× AMPure XP magnetic bead cleanup by adding the same volume of the magnetic bead solution as the sample.\nNote: Prior to use, allow the magnetic bead solution to reach 20°C–25°C and vortex the magnetic bead solution well.\nMix the beads and sample thoroughly and then incubate at 20°C–25°C for 30 min.\nMove the tube to a magnetic stand. Wait till the beads form a pellet.\nDiscard the supernatant.\nWash the pellet twice with freshly made (up to 7 days) 80% ethanol, ensuring that it covers the entire bead pellet.",
    "While still leaving the tube on the magnetic stand, allow the pellet to dry with the tube’s lid left open for approximately 3–10 min. The beads are dry when a slight color change appears. Do not over-dry the beads. Once minor cracking of the beads is visible, move to the next step.\nRemove the tube from the magnetic stand and elute DNA with 30 μL of nuclease-free water.\nMix well and wait 15 min before placing the tube on the magnetic stand.\nAfter the beads form a pellet, transfer the supernatant to a new tube. The supernatant now contains the unamplified DNA molecules.\nCritical: The samples have not been amplified at this point, so minimizing material loss is critical during the elution step (step 25.h). Try to transfer at least 29 μL in step 25.h.\nUse a vacufuge at 20°C–25°C to reduce the sample volume from 30 μL to 6.4 μL.\nIf the sample does not reduce to 6.4 μL, see troubleshooting 1[href=https://www.wicell.org#sec7.1].\nCritical: Each 1.5 mL microcentrifuge tube should contain pooled DNA molecules from individual cells with unique AbaSI/BseRI barcodes and AluI barcodes. For example, if 96 cells are pooled into the same 1.5 mL microcentrifuge tube, 96 unique AbaSI/BseRI barcodes and 96 unique AluI barcodes are required.\nNote: When using a vacufuge, if the sample volume reduces to less than 6.4 μL, add nuclease-free water to bring the volume back up to 6.4 μL.\nPause point: Samples can be stored at −20°C until ready to continue.\nIn vitro transcription and amplified RNA clean-up\nTiming: 1 day",
    "In vitro transcription (IVT) is used to amplify the barcoded DNA molecules, generating amplified RNA (aRNA). Next, ExoSAP-IT is used to remove any excess primers. The aRNA is then fragmented to a suitable length (200–1000 nucleotides) for sequencing. Finally, a standard 0.825× RNA bead cleanup is performed to exchange the buffer.\nThe MEGAscript T7 transcription kit is used for this step. To each pooled sample containing 6.4 μL of barcoded DNA molecules add:\nIVT master mix:\ntable:files/protocols_protocol_1237_24.csv\nThe total volume per sample will be 16 μL containing 1× T7 reaction buffer.\nPerform the following:\ntable:files/protocols_protocol_1237_25.csv\nThe samples are now amplified and contain aRNA.\nCritical: As IVT takes 13 h to complete, it is likely that this step will be performed at the end of the day and the samples will be held at 4°C. While aRNA is stable at 4°C for several hours, it is recommended to either store aRNA at −20°C for short-term storage (a few days) or proceed to the next step within a few hours after the IVT step is complete.\nAdd 6 μL of ExoSAP-IT and incubate the samples for 15 min at 37°C.\naRNA fragmentation\nPreheat a thermocycler to 94°C.\nAdd 5.5 μL of fragmentation buffer to the samples while on ice.\nImmediately transfer the sample tubes to the thermocycler at 94°C for exactly 2 min.\nImmediately place sample tubes back on ice.\nAdd 2.75 μL of 0.5 M EDTA to stop fragmentation.\nAdd 19.75 μL of nuclease-free water. The total volume should now be 50 μL.\nCritical: Due to the time-sensitive nature of the aRNA fragmentation step, it is recommended to handle only 2–3 tubes at one time.\nBriefly spin down the tubes and transfer the solution to a new 1.5 mL microcentrifuge tube.",
    "Perform a standard 0.825× RNA bead cleanup, eluting in 22 μL of water.\nThis step is similar to step 25.\nAdd 41.25 μL of RNAClean XP magnetic beads to the fragmented aRNA. Incubate the sample for 15 min and then transfer to a magnetic stand.\nOnce the beads form a pellet, discard the supernatant and wash the pellet twice with freshly made 80% ethanol.\nDry the beads on the magnetic stand by leaving the cap of the tube open (3–10 min). Remove the tube from the magnetic stand and elute the fragmented aRNA in 22 μL of nuclease-free water.\nAllow the fragmented aRNA to elute from the beads for 10 min before placing the tube on the magnetic stand. Once the beads form a pellet, transfer the supernatant to a new tube.\nCritical: All surfaces and items must be RNase-free. Use RNaseZap to wipe down all equipment, surfaces, and gloved hands. RNase contamination can lead to library preparation failure.\nOptional: At the completion of this section, an Agilent RNA 6000 Pico chip can be run to check the size distribution of the fragmented aRNA (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nPause point: Samples can be stored at −80°C until ready to continue. In the following steps, not all aRNA will be used. The remaining aRNA can be stored at −80°C to generate additional Illumina libraries in the future if necessary.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1237-Fig3.jpg\nFigure 3. Expected size distribution of aRNA and Illumina library in scH&G-seq\n(A and B) Representative bioanalyzer plot for aRNA run on an Agilent RNA 6000 Pico chip. More material amplified RNA is typically observed when all three enzymes AbaSI, BseRI, and AluI are used (A), compared to when AbaSI is used alone (B).",
    "(C) Representative bioanalyzer plot for a scH&G-seq Illumina library run on an Agilent high-sensitivity DNA chip. A majority of the library should be within the 200–1000 base pair range. Fluorescence units ([FU]) on the y-axis correlates with the amount of RNA/DNA in the sample.\nIllumina library preparation from amplified RNA\nTiming: 1 day\nIn this section, aRNA is reverse transcribed using random hexamer primers with overhangs that contain part of the Illumina read 2 adapter sequence. The reverse transcribed single-stranded DNA now contains parts of the Illumina read 1 and read 2 adapters at the two ends of the molecules. Next, these molecules are amplified by PCR, and the full Illumina adapter sequences are introduced using overhangs in the PCR primers. Two 0.825× DNA bead cleanups are performed to remove primers and dimers, and to exchange the buffer. The size distribution and concentration of the final Illumina libraries are then quantified using an Agilent Bioanalyzer and Qubit fluorometer, respectively.\nReverse transcription of aRNA\nTo 5 μL of the aRNA from step 31, add:\ntable:files/protocols_protocol_1237_26.csv\nThe total volume will be 6.5 μL.\nPerform the following:\ntable:files/protocols_protocol_1237_27.csv\nImmediately place the samples directly on ice.\nAdd the remaining reverse transcription mix:\ntable:files/protocols_protocol_1237_28.csv\nThe total volume will be 10.5 μL.\nPerform the following:\ntable:files/protocols_protocol_1237_29.csv\nPCR amplification\nTransfer 5.25 μL of the reverse transcribed aRNA from step 32 to a new PCR tube and store the other half at −20°C for later use in case the number of PCR cycles performed here turns out to be non-optimal.\nEach sample should receive its own indexed RNA PCR Primer (RPI1-RPI48) so that it can be multiplexed with other samples in one Illumina sequencing lane if desired.\nTo 5.25 μL of the reverse transcribed aRNA, add the following PCR mix:\ntable:files/protocols_protocol_1237_30.csv\nThe total volume is now 25.25 μL.",
    "Perform the following (Note that the thermocycler is preheated to 98°C, and once it has reached this temperature, insert the sample and advance to the next step):\ntable:files/protocols_protocol_1237_31.csv\nBriefly spin down the tubes to collect all the liquid to the bottom of the tube. Add 24.75 μL of nuclease-free water. Transfer the solution in each PCR tube to a new 1.5 mL microcentrifuge tube.\nPerform a 0.825× AMPure XP magnetic bead cleanup, eluting in 50 μL of nuclease-free water.\nThis cleanup is similar to the one described in step 25.\nAdd 41.25 μL of AMPure XP magnetic beads to 50 μL of the PCR product. Incubate the sample for 15 min. Transfer the tube to a magnetic stand.\nOnce the beads form a pellet, discard the supernatant. Wash the pellet twice with freshly made 80% ethanol.\nDry the beads on the magnetic stand by leaving the cap of the tube open for 3–10 min. Remove the tube from the magnetic stand and elute in 50 μL of nuclease-free water.\nAllow the DNA to elute from the beads for 10 min before placing the tube on the magnetic stand. Once the beads form a pellet, transfer the supernatant to a new tube.\nPerform a second 0.825× AMPure XP magnetic bead cleanup, eluting in 15 μL of nuclease-free water.\nThis cleanup is the same as step 35, except that the final elution volume is 15 μL.\nDetermine the fragment size distribution of the Illumina library using an Agilent high-sensitivity DNA kit following the manufacturer’s recommendations. 1 μL of each sample is loaded on a high-sensitivity DNA chip.\nIf the Illumina library does not show a size distribution similar to Figure 3[href=https://www.wicell.org#fig3]C, see troubleshooting 2[href=https://www.wicell.org#sec7.3], 3[href=https://www.wicell.org#sec7.5], 4[href=https://www.wicell.org#sec7.7], and 5[href=https://www.wicell.org#sec7.9]",
    "Critical: The bioanalyzer plot should show that greater than 90% of the product library has a size distribution between 200 and 1000 bp. There should be little to no primer (<100 bases) or dimer peaks (∼120 bases) present. If there is a substantial primer and/or dimer peaks present, or if a significant percentage of the library is greater than 1000 bp, see troubleshooting 2[href=https://www.wicell.org#sec7.3] and 3[href=https://www.wicell.org#sec7.5].\nIf the bioanalyzer results warrant continuation, quantify the concentration of the Illumina library using the Qubit dsDNA high-sensitivity assay by following the manufacturer’s recommendations. 1 μL of the Illumina library is used to estimate the concentration.\nIf the sample concentration is above the lower limit of detection for the Qubit dsDNA high-sensitivity assay, the concentration is typically sufficient for Illumina sequencing.\nThe concentration will vary depending on the number of PCR cycles, but concentrations are typically in the range of 0.5–4 ng/μL. Low Qubit concentrations might reflect that many of the cells in the library have failed to amplify and may not produce high-quality data.\nCombine Illumina libraries with distinct multiplexed barcodes added during the PCR step (step 33). Sequence on an Illumina platform to a depth of approximately 0.5–1 million reads per cell. For the analysis pipeline presented below, sequencing should contain at least 76 cycles on read 1. No custom Illumina sequencing primers are required.\nNote: During PCR (step 33), one of the primers is universal (RP1) and is added to all samples. To multiplex multiple samples on the same Illumina sequencing lane, the other primer (RPI1, RPI2, … RPI48) is unique to each sample.\nNote: 9 PCR cycles were found to be sufficient for making successful Illumina libraries containing 48 H9 cells.",
    "Note: These Illumina libraries can be sequenced without any custom primers, and they can be multiplexed with any TruSeq-based Illumina sequencing library.\nNote: While the steps 25, 35, and 36 are for cleanup of DNA molecules, the cleanup in step 31 is for RNA molecules. Make sure to use the correct magnetic beads (AMPure XP vs. RNAClean XP) accordingly.\nPause point: Samples can be stored at −20°C after the reverse transcription or PCR step (prior to or after AMPure XP magnetic bead cleanup).\nComputational pipeline to analyze scH&G-seq sequencing results\nTiming: 1–2 days\nSequencing results are processed into output files that provide 5hmC and genomic/mitochondrial DNA locations in each cell. Each read type – AbaSI, BseRI, and AluI derived reads – is partitioned into different files. Each file contains a list of unique locations detected (with duplicate reads removed) with the following format: cell barcode number, chromosome, mapped genomic location, and DNA strand information. The DNA strand information column is replaced with a unique molecule identifier (UMI) for the AluI derived file. All scripts and barcodes used can be found at GitHub https://github.com/alexchialastri/scH-G-seq[href=https://github.com/alexchialastri/scH-G-seq]. The associated scH&G-seq sequencing data for H9 cells can be found at GEO: GSE131678.\nProcess reads derived from AbaSI (5hmC) and BseRI (genomic/mitochondrial DNA). These reads have the same barcode (which is a different set from AluI derived reads) and are deconvoluted using the following steps:\nSequenced reads (read 1) are trimmed to 76 bases.\nperl MakeFastqShorter.pl -Input InputFastqFileName.fastq -LengthMake 76\nTrimmed reads containing AbaSI/BseRI barcodes are extracted.\nperl ExtractingAbaReads_96BC_SimultanousWithAluI_UserInput.pl -START_DIR ./ -FASTQ_R1 InputFastqFileName-Trimed-76.fastq -BARCODES aba_barcodes.csv -ALUIBARCODES ALUI.txt\nRead 1 is then mapped using Burrows Wheels Aligner (BWA).\nbwa aln -q 0 -n 0.04 -k 2 -l 200 -t 6 -B 6 hg19.fa InputFastqFileName-Trimed-76-AbaSI-BseRI.fastq > Read1OutputFileName.sai\nbwa samse -n 100 hg19.fa Read1OutputFileName.sai InputFastqFileName-Trimed-76-AbaSI-BseRI.fastq > Read1OutputFileName.sam",
    "The resulting mapped output sam file is then converted to the final processed AbaSI and BseRI files based on the recognition site of each restriction enzyme.\nperl process_scaba_with_BseRI_AnyInput.pl hg19.fa Read1OutputFileName.sam aba_barcodes.csv\nperl Aba_or_BseRI_FabaToText.pl Read1OutputFileName-ABA.faba\nperl Aba_or_BseRI_FabaToText.pl Read1OutputFileName-BseRI.faba\nThe final output file Read1OutputFileName-ABA.txt contains 5hmC locations detected in single cells and Read1OutputFileName-BseRI.txt contains BseRI-derived genomic/mitochondrial DNA locations detected in the same single cells.\nDeconvolute and process AluI-derived reads.\nSequenced reads (read 1) are trimmed to 76 bases using the MakeFastqShorter.pl Perl script. Skip this step if step 40.a was performed.\nperl MakeFastqShorter.pl -Input InputFastqFileName.fastq -LengthMake 76\nTrimmed reads containing AluI barcodes are extracted.\nperl ExtractingAluIReads_UserInput_NoBarcodeCollisions.pl -FASTQ_R1 InputFastqFileName-Trimed-76.fastq -ALUI_BC ALUI.txt -ABASI_BC aba_barcodes.csv\nRead 1 is then mapped using Burrows Wheels Aligner (BWA).\nbwa aln -q 0 -n 0.04 -k 2 -l 200 -t 6 -B 13 hg19.fa InputFastqFileName-Trimed-76-AluI.fastq > Read1AluIOutputFileName.sai\nbwa samse -n 100 hg19.fa Read1AluIOutputFileName.sai InputFastqFileName-Trimed-76-AluI.fastq > Read1AluIOutputFileName.sam\nThe resulting mapped output sam file is then converted to the final processed AluI file based on its recognition site.\nperl Identifying_AluI_Sites_withUMI_SCdata_ForkedAdapters.pl Read1AluIOutputFileName.sam Read1AluIOutputFileName-se_MappedReads.txt Read1AluIOutputFileName-se_correctpos_stringent.txt\nperl SimplifyData.pl Read1AluIOutputFileName-se_correctpos_stringent.txt Read1AluIOutputFileName-se_correctpos_stringent_simplified.txt ALUI.txt\nsort -k1,1n -k2,2V -k3,3n Read1AluIOutputFileName-se_correctpos_stringent_simplified.txt > Read1AluIOutputFileName-se_correctpos_stringent_simplified_sort.txt\nperl RemoveDup.pl Read1AluIOutputFileName-se_correctpos_stringent_simplified_sort.txt Read1AluIOutputFileName-se_correctpos_stringent_simplified_sort_rmdup.txt\nThe final output file Read1AluIOutputFileName-se_correctpos_stringent_simplified_sort_rmdup.txt has AluI-derived genomic/mitochondrial DNA locations detected in single cells.\nNote that AluI-derived reads and AbaSI/BseRI-derived reads have different barcodes. By keeping track of which AluI and AbaSI/BseRI barcodes were added to a given cell (noted in steps 18–20), the corresponding reads derived from AluI and AbaSI/BseRI can be assigned to the same cell.\nNote: Only single-end sequencing is required. Replace InputFastqFileName.fastq with the fastq file name from your experiment.\nNote: Prior to mapping, index the genome using BWA version 0.7.15. Follow the steps outlined in the BWA manual to create an indexed genome.",
    "Note: BWA parameters in steps 40.c and 41.c can be adjusted as appropriate. However, “-B” parameter indicating the barcode length should be kept as 6 and 13, respectively.\nNote: The names of output files can be adjusted as appropriate, as long as the names of files generated in steps 40 and 41 remain distinct.\nNote: For the pipeline processing BseRI and AbaSI derived reads, the resulting text files will indicate chromosome X as 23, chromosome Y as 24, and mitochondrial-based reads as chromosome 25. The following scripts will also work on the mouse genome (or any organism with less than 22 autosomes) and will still result in the same naming convention for the sex chromosomes and mitochondrial-based reads. Organisms with more than 22 autosomes will require slight modification to line 65 of process_scaba_with_BseRI_AnyInput.pl to account for more chromosomes. For the pipeline processing AluI derived reads, the resulting text files will identify the sex chromosomes as chromosome X and Y, and the mitochondrial-based reads as chromosome M.\nOptional: After mapping the fastq files, samtools can be used to quantify the mapping efficiency using the flagstat tool on both sam files. Samtools can also be used to convert the sam file into a compressed bam file for long term data storage.\nOptional: After completing this protocol, follow the steps described for single-cell Probabilistic Endogenous Cellular Lineage Reconstruction (scPECLR) in Wangsanuwat et al., 2021[href=https://www.wicell.org#bib9] to reconstruct cellular lineages."
  ],
  "subjectAreas": [
    "Genomics",
    "Bioinformatics",
    "Cell Isolation",
    "Molecular Biology",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology",
    "Bioengineering & Technology"
  ]
}