{
  "id": 5684,
  "origin_website": "Bio",
  "title": "Mouse Müller Cell Isolation and Culture",
  "procedures": [
    "Preparation of papain dissociation systemPrepare Worthington Papain Kit according to the manufacturer’s instructions.Add 32 ml of EBSS (vial 1) to the albumin ovomucoid inhibitor mixture (vial 4). Completely dissolve, then store in a 4 °C refrigerator and use it within 1 week.Add 5 ml of EBSS (vial 1) to a papain vial (vial 2), place vial 2 in a 37 °C incubator (or water bath) for 10 min or until the papain is completely dissolved.Add 500 µl of EBSS (vial 1) to a DNase vial (vial 3), mix gently, and then add 250 µl of the mixture to the papain vial 2 saved at step A3. The remaining 250 µl will be used in Procedure C, step C5.Transfer the above mixed vial 2 to a 15 ml conical centrifuge tube.Mouse eye dissectionDisinfect dissection forceps and scissors with 70% ethanol and burn them to dry.Prepare three dishes containing 2 ml of PBS and 1% penicillin-streptomycin, and mark them with numbers as shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170728/20170728023648_3841.jpgFigure 1. Prepare three dishes, and mark them with numbersAt least 2 mice are euthanized by CO2 asphyxiation and then placed onto a sterile surgical pad. Disinfect surface of the eyelid with 70% alcohol preparation pads.Mouse eyeballs with the optical bundles are extracted by inserting the forceps along the socket until the optical nerve bundle, and placed in the first dish for 10 min (Figure 2A).Under a stereo binocular microscope, carefully remove the muscle, fascia and conjunctiva tissues around the eyeballs in the first dish, and then transfer them to the second dish (Figure 2B, Video 1).Eyeball dissection: remove the anterior portion of the eye, including the cornea, the iris and the lens, reserve the posterior eye cup in the second dish (Figure 2C, Video 1).",
    "From the remaining posterior eyecup, the retinas are dissected free of the retinal pigment epithelium (RPE) in the third dish (Figure 2D, Video 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170728/20170728024950_6760.jpgFigure 2. Eyeball dissection. The enucleated mouse eyeballs are first immersed in PBS with the antibiotics for disinfection (A); and then transferred to the second dish (B) to remove the most anterior eye tissues (C), and to isolate the retina in the third dish (D).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Mouse eyeball dissection  Isolation and culture of Müller cellPlace the retina in a 15 ml conical centrifuge tube containing papain and DNase solution saved at step A5. Cut the retina into pieces as small as possible with a single edge blade (Figure 3A).Incubate the tube containing the tissue in a 37 °C incubator with gently shaking by a constant shaker for 60 min until the solution becomes clear (Figure 3B). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170728/20170728025307_2494.jpgFigure 3. The medium turns to be cloudy before incubation (A) and most pieces of the retina disappear after incubation (B)Triturate the mixture with a 5 ml pipette for 2-3 times. Allow any pieces of undigested tissue residues to settle to the bottom of the tube. Carefully transfer the cloudy cell suspension to a 15-ml conical centrifuge tube, and centrifuge at 300 x g for 5 min at room temperature. During this time, prepare cell culture medium to resuspend the pelleted cells.Mix medium in a sterile tube with 2.7 ml of EBSS (vial 1), 300 µl of reconstituted albumin-ovomucoid inhibitor solution (vial 4) saved at step A2, 150 µl of DNase solution (vial 3) saved at step A4. Discard the supernatant and then immediately resuspend the cell pellet by adding the medium mix at step C5.Add 5.",
    "0 ml of the albumin-inhibitor solution (vial 4) to the centrifuge tube, carefully lay the cell suspension on top, then centrifuge at 70 x g for 6 min at room temperature. The interface between the two layers of the gradients should be clearly visible. Dissociated cell pellet is at the bottom of the tube while the membrane fragments remain at the interface.Discard the supernatant and immediately resuspend the pelleted cells in the culture medium (DMEM) with 10% fetal bovine serum (FBS) and 1% Pen/strep antibiotics (see Recipes).Prepare 100 ml of 0.1% gelatin in PBS (see Recipes), add 1 ml or enough to cover the bottom of a 35-mm dish to coat the surface, leave the coating dish with the lid on in a 37 °C cell culture incubator for over 30 min, aspirate the coating solution and the coated dish is ready for use.The dissociated cells are collected and cultured in the above gelatin-coated dish at 5.5% CO2. The primary cells before passage (P0) are actually a mixture of Müller cells, photoreceptors, and other retinal neurons.After plating, adherent cells are maintained for 7 days at 37 °C. The medium is replaced every 5 days until cells are confluent and passaged at 1:1 ratio to a fresh dish coated with 0.1% gelatin (Figure 4A). Adherent Müller glial cells become relatively pure after 2 to 3 passages identified by cell morphology and immunostaining with glutamine synthetase (GS, Müller glial cell marker) (Figure 4B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170728/20170728025405_1571.jpgFigure 4. Mouse Müller monolayer cells cultured for 10 days after one passage (A) and the cultured cells are stained with Müller cell-specific marker GS (B)Cell cryopreservation in liquid nitrogenRemove the culture medium from confluent monolayer-culture dish.Rinse the dish twice with PBS at room temperature.Add 0.75 ml or 2 ml of 0.",
    "25% trypsin solution to a 6-cm or 10-cm dish, respectively, or enough amount to cover the monolayer.Incubate in a 37 °C incubator for 1-2 min until cells come off the dish after gently striking the dish to a bench edge.Add the culture medium that contains 10% FBS, 2-3 times of the amount of the added trypsin, and gently mix for a minute, and transfer to a 15 ml tube.Centrifuge at 500 x g for 10 min to collect cell pellet.Discard the supernatant, and re-suspend the cell pellet in 1-3 ml of cell freezing medium (see Recipes) (usually 1 ml per 2 x 105 cells).Aliquot into 2 ml cryopreservation vial. Place the vial in a -20 °C freezer for 1 day, then transfer to -80 °C for 1 day, and finally store in a liquid nitrogen tank for long-term storage."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}