{
  "id": 8421,
  "origin_website": "Jove",
  "title": "Evaluating Postural Control and Lower-extremity Muscle Activation in Individuals with Chronic Ankle Instability",
  "procedures": [
    "Prior to tests, the participants signed an informed consent after receiving information about the experimental process. This experiment has been approved by the ethics committee of Shanghai University of Sports.\n1. Equipment setup\nTurn on the CDP system, complete self-calibration, and ensure that the instrument operates normally at 100 Hz sampling frequency.\n\tNOTE: Each of the two installed independent force plates measures three forces (Fx, Fy, and Fz) and three moments (Mx, My, and Mz). The x-axis is in the left–right direction and is perpendicular to the sagittal plane. The y-axis is in the forward–backward direction and is perpendicular to the coronal plane. The z-axis is perpendicular to the horizontal plane. The origins are located at the centers of the force plates.\nDouble-click Balance Manager System | Clinical Module, and then click New Patient and establish the patient ID. Input an accurate height, weight, and age. Select Sensory Organization Test, Unilateral Stance, Limits of Stability, Motor Control Test, and Adaption Test.\n\tNOTE: Such demographic data are also used for age-matched normative diagnostic analysis.\nTurn on the surface electromyography (sEMG) system, and double click the EMG Motion Tools icon. Specify the trigger signal as Trigger In (Manual Stop), establish the participant ID, and match the measured muscles with the wireless electrode. The muscles of unstable lower limb are vastus medialis (VM), vastus lateralis (VL), biceps femoris (BF), tibialis anterior (TA), peroneal longus (PL), gastrocnemius medialis (GM), and gastrocnemius lateralis (GL).\n\tNOTE: The phrase Trigger In (Manual Stop) indicates that CDP triggers the sEMG system to capture EMG data during tests, but the \"end\" flag requires manual clicking to stop the acquisition.\nConnect sEMG system with CDP system through the synchronization line. Adjust the camera of sEMG system to capture the signal indicator light of the CDP system.",
    "NOTE: The video of the indicator light is collected synchronously with the CDP system and sEMG to cut the corresponding cycle of the EMG in accordance with the CDP tests. “Light on” indicates that the test is in progress, and “light off” indicates that the test is paused/stopped.\n2. Participant selection and preparation\nUse the following inclusion criteria for CAI participants: (1) 35 male participants with regular daily activity, excluding professional athletes or sedentary participants; (2) 20–29 years old; (3) history of at least one significant ankle sprain, and the initial sprain must have occurred at least 12 months before enrollment in the study; (4) feelings of “giving away” of the injured ankle joint and/or recurrent sprain and/or “feeling of instability;” and (5) a Cumberland Ankle Instability Tool questionnaire score of less than 24 points16.\n\t\nExclude participants with a history of bilateral sprains, lower limb fracture, operation, nervous and vestibular system diseases, or allergy to taping. Additionally, recruit 35 male participants without CAI, whose demographic data matched with the CAI group, as the control group.\nFor preparation, fix the electrode piece on the belly of the measured muscles. Instruct the participants to wear a safety harness and stand barefoot on the force plates to face the visual surround.\n\t\nAdjust the alignment of the feet on the force plates. Align the malleolus medialis with the horizontal line and lateral edge of foot with the corresponding computer-generated height line (S, M, and T lines). Turn off the screen embedded in the visual surround (Figure 1).",
    "NOTE: These guidelines are based on the following heights. “S” means “small” and includes heights ranging from 76 cm to 140 cm. “M” means “medium” and includes heights ranging from 141 cm to 165 cm. “T” means “tall” and includes heights ranging from 166 cm to 203 cm. The screen may produce learning effects, because it can provide real-time visual feedback. Thus, the screen should remain closed during the test, except during the limit of stability (LOS) test17.\nimgsrc://cloudfront.jove.com/files/ftp_upload/61592/61592fig01.jpg\nFigure 1: Participant preparation for measurement. The participants stand upright barefoot to face the visual surround, wear safety harness, correctly align their feet with the force plates, and fix the wireless EMG electrodes on their legs. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/61592/61592fig01large.jpg]\n3. Measurement procedures\nCDP measurement\n\t\nSensory organization test\n\t\t\nInstruct the participants to stand upright and to keep their COG as stable as possible to cope with the interference from vision, somatosensory, and vestibular sensation (singly or combined) (Table 1). Complete the measurements of conditions 1–6. Each test lasts for 20 s. Repeat the procedure thrice for each condition.\nUnilateral stance\n\t\t\nInstruct the participants to place their hands on the anterior superior iliac spine with their eyes open/closed. Consider the unstable ankle side as the support leg. Fully extend their knee joint, and bend the knee of their non-supporting leg by approximately 30°. Allow the participants to remain standing stably for 10 s. Repeat the procedure thrice for each visual condition.\nLimit of stability",
    "Instruct the participants to maintain their COG in the central area. Upon hearing the ring, lean their body and shift their COG quickly into the targeted frame in the screen. Instruct the participants to remain steady for 10 s. Complete the eight directional shifting of their COG (forward, forward-right, right, right-backward, backward, backward-left, left, and left-forward).\n\t\t\tNOTE: In the process of COG shifting, the body is kept straight, the heel or toes are not far from the force plates, and the hip joint is not bent.\nMotor control test\n\t\t\nInstruct the participants to respond effectively to restore body stability and to cope with the unexpected slipping of the force plates. Repeat the procedure thrice for each slip condition.\n\t\t\tNOTE: The force plates are slipped with small/medium/large amplitude in the anterior/posterior direction. According to the participant’s height, the slip amplitude of the force plates is automatically adjusted. Standard procedures must be followed to align the foot position on the force plates. Random delay exists between trials.\nAdaption test\n\t\t\nInstruct the participants to respond effectively to restore body stability and to cope with five consecutive unexpected rotations at a velocity of 20°/s. Direct the toes upward or downward.\ntable:\n﻿0,1,2,3,4,5\nCondition,Eyes,Force plates,Visual surround,Interference,Anticipated Response\n1,Open,Fix,Fix,,Somatosensory\n2,Close,Fix,Fix,Vision,Somatosensory\n3,Open,Fix,Sway-reference,Vision,Somatosensory\n4,Open,Sway-reference,Fix,Somatosensory,\"Vision, vestibular\"\n5,Close,Sway-reference,Fix,\"Somatosensory, vision\",Vestibular\n6,Open,Sway-reference,Sway-reference,\"Somatosensory, vision\",Vestibular\nTable 1: Different interference and corresponding anticipated response in sensory organization test. The term “sway-referenced” means that the movement of the force plates and visual surround follows the participant’s COG sway.\nsEMG measurement and data process\n\t\nAfter triggering by CDP system during SOT, US, LOS, MCT and ADT, start the automatic acquisition of lower-limb muscle activity raw data. Manually stop the acquisition during the sEMG system when the light is off. The sample size is 1000 Hz.",
    "Enter the processing window of the sEMG software. Import the C3d file of the EMG raw data and mp4 file of the light video. Cut the trial cycle when the light is on.\nIn the “processing pipeline” operations, include the following options in the run pipeline: Butterworth filter with low-pass (450 Hz, 2. Order) and high-pass (20 Hz, 2. Order); notch filter at 50 Hz; and root mean square smoothing window of 100 ms.\n\t\tNOTE: Choose the Butterworth filter with low-pass (450 Hz, 2. Order) and high-pass (20 Hz, 2. Order) to filter out unwanted low and high-frequency components. Set the notch filter at 50 Hz to remove 50 Hz interference from the main power. Use the root mean square smoothing window of 100 ms to smooth the noisy signal.\nIn the Generate Events options, include the following events in the run pipeline. “muscle on” is defined as “all channels go above 5x baseline noise standard deviations for at least 50 ms”. “muscle off” is defined as “all channels drop below 5x standard deviations over baseline for at least 50 ms ”.\nIn the Generate Parameters options, include the following parameters in the run pipeline: integral electromyography (iEMG); root mean square (RMS); mean power frequency (MPF); medium frequency (MDF); and co-activation ratio.\n\t\tNOTE: The following are the referenced calculation formulas for the above parameters (Equations 1–4):\nimgsrc://cloudfront.jove.com/files/ftp_upload/61592/61592equ01v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/61592/61592equ02v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/61592/61592equ03v2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/61592/61592equ04v2.jpg\nNormalize the RMS values of the SOT, US, LOS, MCT and ADT trials with the RMS values of maximal voluntary isometric contraction (MVIC) for each muscle (Equation 5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/61592/61592eq5v3.png\n\t\tNOTE: MVIC indicates the maximum force contraction of each muscle for participants in the standard posture for 5 s (Supplementary file 1)18.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}