{
  "id": 1699,
  "origin_website": "Cell",
  "title": "Optimized workflow for human PBMC multiomic immunosurveillance studies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell thaw\nTiming: 30 min\nIn this section, the procedure for thawing human PBMC for subsequent High Dimensional Flow Cytometry and 10x Genomics v3.1 scRNA-seq (single-cell RNA-sequencing) with antibody-based cell hashing workflows is described. Typically, a batch of 23 PBMC samples and one bridging control leukopak sample are processed for downstream assays. Adding thawed PBMC directly to pre-warmed media streamlines the first step of the thaw, and the use of AIM V media eliminates serum (a potential source of activating compounds as well as lot-to-lot variability).\nNote: If working with fresh or cultured cells, proceed to “cell count and normalization[href=https://www.wicell.org#sec3.2]”.\nPrepare cell thawing media\nTransfer 30 mL of AIM V media into one 50 mL conical tube for each sample to be processed. Place on ice until ready to thaw cells.\nTransfer 40 mL of AIM V media into one 50 mL conical tube for each sample to be processed. 30 min prior to cell thawing, place the 40 mL AIM V tubes into a 37°C water bath.\nNote: Other serum-free media may be used in place of AIM V.\nThaw Cells\nThaw PBMC vials rapidly by swirling in the water of a 37°C water bath.\nObserve the thawing contents and remove from the water bath when only a small pellet of ice is visible (approximately two minutes).\nTransfer Cells\nUsing a wide-bore P-1000 tip, transfer the contents of the PBMC vial to a 50 mL conical tube containing 40 mL of pre-warmed (37°C) AIM V.\nTake up 1 mL of AIM V from the conical tube and use it to wash out any remaining cells in the PBMC vial.\nTransfer the 1 mL back to the conical tube.\nRepeat steps 2a -2c for each PBMC sample.\nCentrifuge Cells",
    "Transfer the conical tubes to the centrifuge.\nAttach the aerosol containment caps to the buckets.\nCentrifuge the cells for 400 g for 10 min at 4°C.\nResuspend Cells\nUse a 2 mL aspirating pipette connected to the vacuum line of the BSC to carefully aspirate the supernatant.\nFinger vortex or flick the tubes to disrupt the cell pellet.\nUsing a 5 mL serological pipette, transfer 5 mL of AIM V from a 50 mL conical tube containing 30 mL ice cold AIM V to the conical tube containing the cells.\nPipette mix to resuspend the cells.\nCell count and normalization\nTiming: 30 min\nThe purpose of this step is to quantify the cell concentration of each sample, to resuspend each sample at the appropriate concentration for downstream assays. The Nexcelom Cellaca MX high-throughput cell counter performs 24 cell counts in three minutes. The fluorescent AOPI (Acridine orange/Propidium iodide) method quantifies viable nucleated cells (AO-positive green cells) and dead nucleated cells (PI-positive red cells). As PI quenches AO, a viable cell count and dead cell count are generated. As only nucleated cells are counted, contaminating red blood cells are excluded from the count, eliminating the need for red blood cell lysis. The thawed PBMC samples, normalized to 10 million viable cells per mL in ice cold DPBS, are compatible with both our 10x Genomics scRNA-seq and high dimensional flow cytometry workflows.\nNote: Alternative cell counting methods such as Trypan Blue dye exclusion plus red blood cell lysis may be used in place of high-throughput AOPI cell counting. For small batches of samples, a manual hemacytometer may also be suitable.\nLoad Cellaca MX cell counter plate (Figure 1[href=https://www.wicell.org#fig1])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig1.jpg\nFigure 1. Nexcelom cell counting plate",
    "Using a P-200 pipette, transfer 30 μL of each cell suspension to a PCR strip tube containing 30 μL of ViaStain AOPI solution. Mix thoroughly.\nUsing a multi-channel P-200 pipette, mix and transfer 50 μL of the AOPI-stained cells to the counting wells of a Nexcelom cell counting plate. Use Row C for samples 1–12 and Row G for samples 13–24, if applicable.\nGo to the Setup menu on the Cellaca MX. Name the plate and select the assay type.\nNote: The default assay “MX04.0_AOPI_LiveDead” (Fluorescence exposure settings F1-100msec and F2-300 msec) is used for standard cell counts.\nGo to the Load Plate menu. Import or enter the sample names for each well.\nSelect Eject Plate: the plate loader will open.\nPlace the plate in the loader and select Load Plate. The plate will be drawn into the counter.\nGo to the Preview & Count menu. Preview BR1 and FL1 to confirm that the cells are present with bright green fluorescence. See troubleshooting[href=https://www.wicell.org#troubleshooting] section problem 1[href=https://www.wicell.org#sec7.1] for focusing errors.\nCount Cells (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig2.jpg\nFigure 2. Load plate in the Nexcelom plate loader\nSelect Count to initiate cell counting. Counting 24 wells takes approximately three minutes.\nOnce counting is finished, a results sheet will be generated listing the viable cell count, dead cell count, and viability as a percentage. Use the total viable cell counts to calculate resuspension volumes for a target concentration of 10 million viable cells/mL for RNA-seq processing.\nGo to the Load Plate menu and select Eject Plate. Dispose of the plate in a proper biohazardous waste container.\nSelect Load Plate to return the empty plate loader into the Cellaca.\nCentrifuge Cells\nPour the remaining 25 mL of cold AIM V into each 50 mL conical tube, for a total volume of 30 mL in each.",
    "Place the tubes in the centrifuge.\nAttach the aerosol containment caps to the buckets.\nCentrifuge the cells for 400 g for 10 min at 2°C–8°C.\nResuspend Cells\nUse a 2 mL aspirating pipette connected to the vacuum line of the BSC to carefully aspirate the supernatant.\nFinger vortex or flick the tubes to disrupt the cell pellet.\nAdd cold (2°C–8°C) DPBS to adjust the cell concentration to 10 million viable cells per mL (based on the Nexcelom Cellaca MX viable cell count).\nTransfer normalized samples to a deep well Masterplate on ice and use a Microseal B plate seal to cover.\nHigh-throughput 10x single-cell RNA-Seq with cell hashing, GEM generation, and reverse transcription\nTiming: 4 h\nIn this section, samples undergo “Cell Hashing” as described by Stoeckius et al. (2018)[href=https://www.wicell.org#bib2] via staining with TotalSeq™-A anti-human Hashtag Oligo (HTO) conjugated antibodies on the 10x Chromium Next GEM Single Cell 3ʹ assay platform (v3.1). Excess, unbound antibody is removed via robotic washes and samples are then normalized and pooled with a limit of 12 samples per pool. Pooled samples are loaded onto the 10x Chromium Controller Chip G in replicate to achieve ∼20K singlets per sample at a concentration of 64,000 cells per well. This generates Gel Bead-In Emulsions (GEMs). GEMs then undergo reverse transcription (GEM-RT) after which can be stored at 2°C–8°C for up to 72 h or −20°C for up to a week.\nCell Hashing\nMake Human TruStain FcX and 10% BSA Master Mix for the appropriate number of reactions.\nTransfer 500,000 Human PBMCs in 50 μL DPBS from the deep well masterplate (see Cell count and normalization[href=https://www.wicell.org#sec3.2] section) to sample plate.\nAdd 18.7 μL of the Human TruStain FcX and 10% BSA Master Mix to each sample.\nSet multi-channel pipette to 60 μL and slowly pipette-mix 5 times.",
    "Apply Microseal 'B' adhesive seal and incubate on ice for 10 min.\nPrepare a master mix of 1 μL (0.5 μg) of each unique TotalSeq™-A anti-human Hashtag Antibody and 31.3 μL 2% BSA/DPBS (RNA-seq Staining Buffer) for each sample. Include a 20% overage or slop volume.\nSet multi-channel pipette to 80 μL and slowly pipette-mix 5 times.\nApply adhesive seal and incubate plate on ice for 20 min.\nDuring the incubation step turn on Integra VIAFLO 96 and click “RUN” to home instrument. Follow prompt on screen for further set-up.\nPrepare Integra platform, pipette tips (7 per sample), reservoirs, reservoir tray, and Integra cold block (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig3.jpg\nFigure 3. Integra VIAFLO 96 initial set up\nIntegra VIAFLO 96 in a BSC with tips seated in the left position (“A”), a reservoir seated in the middle position (“AB”), and a cold block with a 96-well plate seated in the right position (“B”).\nCritical: Set up Integra platform and save operation programs in VIAFLO 96 before starting.\nCritical: When running the Integra VIAFLO 96 programs ensure that the platform is set such that the plate in “B” aligns with the “B” position on the instrument and the black adjustment lever is in the middle/straight position to ensure that the tips, reservoir, and plate align during the automated wash steps.\nCritical: Use new pipette tips for every removal and resuspension step (7 tips per sample).\nCritical: During the following “Wash” thaw 10x GEM Generation reagents as described in step 3a.\nAdd 60 mL of 2% BSA/DPBS to an Integra reservoir and hold on ice when not in use.\nSet the reservoir containing 60 mL of 2% BSA/DPBS tray and place it in the “AB” position on the Integra VIAFLO 96 stage.",
    "Remove the seal from the sample plate and place the sample plate in an Integra cold block on the instrument in the “B” position.\nRun the 'RNA-Seq Wash 1′ program to add 150 μL 2% BSA/DPBS solution to each sample and mix 5 times.\nTransfer the plate in a cold-block to a stable surface. Seal plate with a Micro-Optical qPCR adhesive seal, and centrifuge at 750 g for 5 min at 2°C–8°C (ensure centrifuge is pre-cooled). During each centrifugation step, hold the cold block on ice.\nCarefully transfer the pelleted sample plate to the cold block and back to the “B” position on the Integra VIAFLO 96. Remove the seal.\nReplace the buffer reservoir with a new empty reservoir and label it “Waste.”\nRun the 'RNA-Seq Remove' program on Integra to remove 200 μL of the clear supernatant from each well, leaving 50 μL above the pellet.\nWith the buffer reservoir in place, run the 'RNA-Seq Wash 2′ program on the Integra.\nTransfer plate in cold block to a stable surface, seal plate with a Micro-Optical qPCR adhesive seal, and centrifuge at 750 g for 5 min at 2°C–8°C (ensure centrifuge is pre-cooled).\nCarefully transfer the pelleted sample plate to the cold block and back to the “B” position on the Integra VIAFLO 96. Remove the seal.\nWith the waste reservoir in place, run the 'RNA-Seq Remove' program on Integra.\nWith the buffer reservoir in place, run the 'RNA-Seq Wash 2′ program.\nTransfer plate to a stable surface, seal plate with a Micro-Optical qPCR adhesive seal, and centrifuge at 750 g for 5 min at 2°C–8°C (ensure centrifuge is pre-cooled).\nWith the waste reservoir in place, run the 'RNA-Seq Remove' program on Integra.",
    "With the buffer reservoir in place, run the 'RNA-Seq Final' program on the Integra to resuspend the cell pellet. Total volume is now 200 μL.\nTransfer the plate to ice and proceed immediately to the next step.\nCell Count and Pooling\nRefer to “Cell count and normalization[href=https://www.wicell.org#sec3.2]” section to count samples on the Cellaca MX cell counter. Use 27.5 μL of sample and 27.5 μL of AOPI dye to conserve sample volume.\nCritical: Due to high background noise from oligo-conjugated, cell hashing antibodies use the MX04.0_AOPI_scRNA-Pipeline Assay custom program (Fluorescence exposure settings F1, 300 msec and F2, 350 msec).\nUse the live cell concentration to normalize pools such that each sample is pooled at an equal fraction and will be sufficient to overload at up to 64K cells per well during 10x GEM generation.\nCritical: A cell viability cut-off of 70% is recommended to ensure the quality of the data, however differences in samples due to a patient’s disease profile should be considered. In past preparations, cell viabilities as low as 50% have been processed due to patient disease profile. See troubleshooting[href=https://www.wicell.org#troubleshooting] section problem 2[href=https://www.wicell.org#sec7.3] for potential solution if cell viability is low.\nBased on the number of 10× wells to be run, calculate the amount of batch control to spike into each pool (should be 1/5th of the amount of a sample i.e., for 12 samples pooled at 100K cells/sample, pool 20K cells of the bridging control).\nPass the pool through a labeled 35 μM cell strainer cap securely held in place on top of a 1.5 mL screw-top centrifuge tube.",
    "Take a cell count of the pool using the Nexcelom Cellometer. Mix 12.5 μL of AOPI + 12.5 μL sample pool, pipette-mix, remove plastic from Cellometer slide and place on a clean surface, load 20 μL of AOPI stained sample pool to the slide chamber. Record the total cells/mL and viability.\nDilute the sample pool in DPBS for 10× GEM Generation. Use the following equation to determine volume (μL) of the sample pool must be diluted in DPBS for 10× GEM Generation: Volume of Cells = [Number of Cells per Well ×Number of 10x Wells ×1.2] ÷Number of Cells per μL\nUse the following equation to calculate how much (μL) DPBS to add for the sample pool dilution calculated above: Volume of DPBS = [43.3 μL of Sample Pool Diln ×Number of 10x Wells ×1.2] -Volume of Cells\nGEM Generation & RT\nAllow RT reagent, resuspended Template Switch Oligo (see following step), Reducing Agent B and Gel beads to equilibrate to 20°C–25°C for at least 30 min.\nCritical: If opening a new kit, add 80 μL Low TE to the TSO, vortex 15 seconds and incubate at 20°C–25°C for at least 30 min.\nMake up the GEM Reverse Transcription Master Mix (GEM RT MM).\nAdd 31.8 μL of the GEM RT MM to each strip tube well equal to the number of 10x-wells to be loaded.\nAdd 43.3 μL of cells from each sample dilution to each well corresponding to the number of 10x Chip G wells.\nKeep strip tubes on ice while preparing each chip.\nChip Preparation (Figure 4[href=https://www.wicell.org#fig4])\nLoad a chip into the holder without touching the top of the wells.\nDispense 50% glycerol into any unused chip wells if processing less than 8 samples on a chip:",
    "Critical: DO NOT add glycerol solution to the bottom, 'NO FILL′ row.\nSet pipet to 70 μL and mix RT Master Mix + Sample by slowly pipetting up and down 5 times then dispense 70 μL of the sample + Master Mix into row 1 without introducing bubbles.\nVortex the Gel Beads for 30 s, remove strip tube from holder and briefly centrifuge, and return to holder.\nSlowly aspirate 50 μL Gel Beads. Dispense into row 2 without introducing bubbles. Wait 30 s before moving to the next step.\nDispense 45 μL Partitioning Oil into row 3 wells.\nAttach the 10x Gasket and ensure the gasket holes are aligned with the wells. Avoid touching the smooth surface (Figure 5[href=https://www.wicell.org#fig5]).\nLoad the chip into the 10x Chromium controller and press play. Avoid tilting the chip in the process. (∼18 min run time) (Figure 6[href=https://www.wicell.org#fig6]).\nIMMEDIATELY unload the chip, discard the gasket, and fold the lid back until the holder clicks into place so the chip is sitting at a 45 degree angle (Figure 7[href=https://www.wicell.org#fig7]).\nSlowly aspirate 100 μL GEMs from the lowest point of row 3 slowly rotating the pipette away to ensure that the tips stay at the lowest point (Don't allow a seal to form between the tips and the well) (Figure 8[href=https://www.wicell.org#fig8]).\nTaking ∼20 s, dispense GEMs into a semi-skirted 96-well PCR plate on ice, keeping pipette tips against the sidewalls of the wells at a 45 degree angle.\nRepeat for each additional chip as needed. Keep GEMs on ice no longer than an hour.\nLoad the plate onto a Thermal Cycler and run the 'GEM RT′ program with the following cycling conditions\ntable:files/protocols_protocol_1158_16.csv\nPause point: store at 2°C–8°C for up to 72 h or −20°C for up to one week.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig4.jpg",
    "Figure 4. 10x chip G well loading\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig5.jpg\nFigure 5. 10x chip G with gasket\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig6.jpg\nFigure 6. Load the 10x Chromium controller\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig7.jpg\nFigure 7. Unload the 10x chip\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig8.jpg\nFigure 8. Slowly aspirate GEMs\nGEM recovery, cDNA amplification, HTO library preparation\nTiming: 5 h\nIn this section, GEMs are broken, recovered cDNA and HTO fragments are amplified. Gene expression cDNA libraries and HTO libraries are separated and size-selected via SPRI-Select bead-based cleanup. HTO libraries are amplified and recovered before storing both sets of libraries at 2°C–8°C for up to 72 h or −20°C for up to one week.\nPost GEM-RT Cleanup and Gene Expression/HTO Amplification\nAllow Reducing Agent B, cDNA Primers, & Dynabeads to come to 20°C–25°C 30 min.\nPlace Amp Mix and Additive HTO Primer (0.2 μM) on ice.\nThaw Cleanup Buffer for 10 min (or more) at 65°C ensuring there is no precipitate.\nMake the Dynabead Cleanup Mix and Elution Solution 1, mix and store at 20°C–25°C until use.\nAdd 125 μL Recovery Agent to each sample. Do not mix. Incubate 2 min at 20°C–25°C and wait for the biphasic mixture to fully separate.\nIf biphasic separation is incomplete, securely seal the plate with a Micro-Optical qPCR adhesive seal, invert 5 times and briefly centrifuge.\nPipetting from the bottom of the well, slowly remove and discard 125 μL of recovery agent (pink) without removing any clear or opaque sample (Figure 9[href=https://www.wicell.org#fig9]).\nVortex the Cleanup Mix well and add 200 μL to each sample. Heat-seal the plate and invert 10× to mix.\nIncubate for 10 min at 20°C–25°C.\nAt the 5-min mark, invert 10× to mix again.\nPlace the plate on a DynaMag-96 magnsetic plate stand for 3+ minutes, remove and discard only the clear supernatant.",
    "Critical: Take care to avoid removing beads not bound to the magnet. Beads may bind to the walls of the well. If beads are aspirated, they can be pipetted back into the well to rebind the magnet.\nAdd 300 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nAdd 200 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nCentrifuge briefly, place plate back on magnetic plate stand and remove the remaining EtOH; let air dry on magnetic plate stand for 30 s.\nResuspend beads in 35.5 μL Elution Solution 1. Pipette-mix without introducing bubbles. Incubate at 20°C–25°C for 2 min.\nOptional: Seal and briefly centrifuge when incubation is complete.\nPlace the plate on a magnetic plate stand, once the solution clears, transfer 35 μL of sample to a new plate.\nMake up the cDNA Amplification Reaction Mix.\nAdd 65 μL cDNA Amplification Reaction Mix to each 35 μL sample well.\nHeat seal, cool immediately, invert 5x and centrifuge.\nRun the following “cDNA Amplification” program with 11 cycles of amplification\ntable:files/protocols_protocol_1158_17.csv\nPause point: store at 4°C for up to 72 h or −20°C for up to one week.\nAdd 60 μL SPRI beads to each sample well, incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand to pellet beads for 10 min. Transfer 155 μL of the clear supernatant to a new semi-skirted 96-well PCR plate.\nHeat seal the “HTO” plate and store it on ice while you complete the following steps on the gene expression libraries.\nAdd 200 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nRepeat steps z and aa for a total of 2 washes.",
    "Centrifuge plate briefly and remove remaining EtOH. Air dry on a magnetic plate stand for 30 s. Resuspend in 40.5 μL Elution Buffer and incubate for 2 min.\nPlace on a magnetic plate stand until the solution clears and transfer 40 μL of clear supernatant to a new plate.\nMake a 1:10 dilution using 45 μL Elution Buffer + 5 μL of Gene Expression Library.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1158-Fig9.jpg\nFigure 9. Remove recovery agent\nHTO Library Amplification and Cleanup.\nRemove the semi-skirted plate that was stored on ice and bring it to 20°C–25°C.\nAdd 140 μL SPRI-Select beads, heat seal, and vortex to mix. Incubate for 10 min at 20°C–25°C.\nPlace on a magnetic plate stand and discard the clear supernatant.\nAdd 200 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nRepeat steps d and e for a total of 2 washes.\nCentrifuge plate briefly, place on magnet and remove remaining EtOH. Air dry on magnet for 30 s.\nResuspend the beads in 50 μL MBGW.\nAdd 100 μL SPRI beads directly to the resuspended beads. Incubate for 10 min at 20°C–25°C.\nPlace on a magnetic plate stand for 10 min and discard the clear supernatant.\nAdd 200 μL 80% EtOH to the pellet. Wait 30 s.\nRemove and discard EtOH, being careful to not touch the beads.\nRepeat steps k and l for a total of 2 washes.\nCentrifuge briefly and remove remaining EtOH. Air dry on a magnetic plate stand for 30 s.\nResuspend the beads in 45 μL Elution Buffer, incubate for 5 min at 20°C–25°C.\nPlace on magnetic plate stand and transfer the clear supernatant into a new labeled 96-well semi-skirted plate.\nMake HTO Amplification Master Mix.\nAdd 52.5 μL HTO Amplification Master Mix to each sample well.",
    "Add 2.5 μL of a unique HTO Index to each sample from the HTO index plate.\nRun the following “HTO Index Amplification” PCR program, with 10 cycles of amplification\ntable:files/protocols_protocol_1158_18.csv\nPause point: store at 4°C for up to 72 h or −20°C for up to one week.\nAdd 160 μL SPRI beads, heat seal, vortex to mix. Incubate at 20°C–25°C for 5 min.\nPlace on magnetic plate stand and discard the clear supernatant\nAdd 200 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nRepeat for a total of 2 washes.\nCentrifuge briefly and remove remaining EtOH. Air dry on a magnetic plate stand for 30 s.\nResuspend the beads in 30 μL Elution Buffer, incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and transfer 30 μL of sample to a new plate.\nMake 1:10 dilution (45 μL Elution Buffer + 5 μL HTO Final Libraries) and record the barcode and well location.\nQC HTO Libraries alongside the RNA once library prep is complete.\nGene Expression Library Intermediate QC\nRun 1 μL of the 1:10 diluted Gene Expression Library prior to continuing library preparation on an Agilent Bioanalyzer or Fragment Analyzer to report cDNA quality and yield.\nGene expression library preparation\nTiming: 3.5 h\nThis section outlines preparation of 25% of the recovered gene expression cDNA libraries for sequencing. The remaining 75% may be stored at −20C for up to 3 months for future use if needed. Fragmented and A-tailed recovered libraries are size-selected for via SPRI-select, bead-based cleanup. Adapters are ligated, recovered libraries are then indexed and amplified before proceeding to QC.\nGene Expression Library Prep\nThaw Fragmentation Buffer, Adapter Oligos, Ligation Buffer, SI Primer, and Chromium i7 Index plate (PN-220103).",
    "Remove Fragmentation Enzyme, DNA Ligase, and Amp Mix from -20°C storage only when needed.\nMake the Fragmentation Master Mix.\nTransfer 10 μL of purified cDNA sample to a new library prep plate, retaining the well position.\nAdd 25 μL Elution Buffer and 15 μL Fragmentation Mix to each sample and mix.\nTransfer to a pre-cooled thermal cycler and run the following “Fragmentation and A-Tail” program.\ntable:files/protocols_protocol_1158_19.csv\nAdd 30 μL SPRI beads to each sample well, heat seal, cool, and vortex. Incubate for 5 min at 20°C–25°C.\nPlace the plate on a magnetic plate stand for at least 3 min and transfer 75 μL of clear supernatant to a new set of columns in the plate.\nAdd 10 μL SPRI beads to each sample heat seal, cool, and vortex. Incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and discard the clear supernatant.\nAdd 125 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nRepeat steps k and l for a total of 2 washes.\nCentrifuge briefly, place plate back on the magnet and remove remaining EtOH. Air dry on a magnetic plate stand for 30 s.\nResuspend the beads in 50.5 μL Elution Buffer, heat seal, cool, and vortex. Incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and transfer 50 μL of sample to a new 96-well skirted PCR plate.\nMake the Ligation Master Mix.\nAdd 50 μL Adaptor Ligation Mix to 50 μL of sample.\nPlace the plate on the pre-warmed thermal cycler and run the following “Ligation” program:\ntable:files/protocols_protocol_1158_20.csv\nAdd 80 μL SPRI beads to each sample well and incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and discard the clear supernatant.",
    "Add 200 μL 80% EtOH to each well avoiding the pellet, wait 30 s.\nRemove and discard EtOH.\nRepeat for a total of 2 washes.\nCentrifuge briefly and remove remaining EtOH. Air dry on a magnetic plate stand for 30 s.\nResuspend the beads in 30.5 μL Elution Buffer, incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and transfer 30 μL of sample to a new plate\nMake Index PCR Master Mix.\nAdd 60 μL Index PCR Mix to each 30 μL sample.\nAdd 10 μL of an individual i7 sample index from the Single Index Kit T Set A to each well and record the well ID.\nRun the “Library Index Amplification” PCR program on a thermal cycler:\ntable:files/protocols_protocol_1158_21.csv\nPause point: store 2°C–8°C up to 72 h or −20°C for one week.\nAdd 60 μL SPRI beads to each sample well, heat seal, cool, and vortex. Incubate for 5 min at 20°C–25°C.\nPlace the plate on a magnetic plate stand and wait until the solution has cleared, transfer 150 μL of the clear supernatant to a new set of columns in the plate.\nAdd 20 μL SPRI beads to each sample and incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and discard 165 μL of the clear supernatant.\nAdd 180 μL 80% EtOH to the pellet. Wait 30 s\nRemove and discard EtOH.\nRepeat steps kk and ll for a total of 2 washes\nCentrifuge briefly and remove remaining EtOH. Air dry on a magnetic plate stand for 30 s.\nResuspend the beads in 35.5 μL Elution Buffer, incubate for 5 min at 20°C–25°C.\nPlace on a magnetic plate stand and transfer 35 μL of sample to a new plate once the solution has cleared.",
    "Make 1:10 dilution (45 μL Elution Buffer + 5 μL HTO Final Libraries) and record the barcode and well location.\nLibrary QC and sequencing\nTiming: 3 h\nThis section details fragment size analysis via Agilent Fragment Analyzer and quantification of libraries via PicoGreen DNA Quantitation and pooling libraries for Illumina Next Generation Sequencing. High quality libraries were generated .\nLibrary QC and Sequencing\nDetermine each library’s average fragment size with a Fragment Analyzer.\nDetermine each library's concentration using the Quant-iT™ PicoGreen™ dsDNA Assay or Kapa SYBR Fast qPCR Complete Assay for BioRad® iCycler. See troubleshooting[href=https://www.wicell.org#troubleshooting] section problem 3[href=https://www.wicell.org#sec7.5] for potential solution to low library concentration.\nBased on the recommendations of the quantification assay used, calculate size-adjusted molarity (nM) based on the average base pair size obtained via QC for each library.\nDetermine the targeted number of reads per each library, we recommend:\n45K reads per cell for each Gene Expression Library.\n3K reads per cell for each HTO library.\nUsing each well’s size-adjusted molarity (nM) and targeted number of reads, pool a normalized concentration of each Gene Expression and HTO Library into a 1.5 mL low-retention, screw-cap tube.\nDilute pool to desired concentration and volume for sequencing with Qiagen Buffer EB or similar Tris low EDTA buffer.\nTypically, 10 nM with a total volume of 150 μL.\nDetermine the appropriate Illumina sequencing platform and flow cell size to sequence the pooled RNA and HTO library pools together with the following sequencing parameters:\nPaired-end, Single-Index\nRead lengths:\nR1: 28\nR2: 91\ni7 Index: 8\nInclude 1% PhiX control spike-in.\nStorage and Freezing",
    "Using reagent guidelines provided on kit boxes and containers, place all reagents in the appropriate freezers. Store custom oligo stocks at 2°C–8°C for up to 1 month. Store the custom HTO i7 stock plate at −80°C for up to 3 months. Store the custom oligo working dilutions and working HTO i7 index plate at −20°C for up to 3 months.\nIn the event the operator is no longer able to continue this protocol at any step where a safe stopping point and storage of libraries is not explicitly referenced, refer to 10x Genomics support for sample storage guidance.\nStore all the sequencing-ready libraries at −20°C for up to 1 year.\nHigh-dimensional flow cytometry sample preparation\nThis section describes the flow cytometry procedure for staining and data acquisition of human peripheral blood mononuclear cells (PBMCs) with high dimensional immunophenotyping panels. This protocol has been optimized for longitudinal studies by incorporating features such as a bridging control sample in each batch for normalization, and commercial reagents for staining, washing, and fixation to reduce batch variation. Automated pipetting with the Integra VIAFLO 96 electronic pipette reduced processing time while maintaining high cell viability and retention. The Integra mixing operation programs were optimized to ensure sample pellets were fully resuspended to avoid variable staining due to clumping outlined in troubleshooting problem 4[href=https://www.wicell.org#sec7.7]. The data displayed in this protocol is from a 25-color immune survey panel acquired on the Cytek Aurora five laser spectral cytometer but this method can be adopted for any flow cytometry experiment and instrumentation.\nCritical: All incubations prior to sample fixation are at 2°C–8°C protected from light and sealed with a Microseal B adhesive seal.\nCritical: All sample plate centrifuge steps are at 750g for 5 min at 2°C–8°C with swinging centrifuge buckets and aerosol containment covers.",
    "Critical: DPBS and Cell Staining Buffer should be chilled to 2°C–8°C and kept on ice when not in use.\nCritical: Store the Integra cold block on ice when not in use.\nCritical: Set up Integra platform and save custom Flow Cytometry operation programs in VIAFLO 96 before starting.\nCritical: Use new pipette tips for every removal and resuspension step (18 tips per sample).\nNote: The Integra VIAFLO 96 steps may be substituted with manual washing/aspiration using the same volumes noted in the protocol.\nFlow cytometry cell staining\nTiming: 3.5 h\nThis section details how to aliquot and stain samples to allow robust longitudinal flow cytometry analysis.\nAliquot Samples and Controls to Staining Plate\nAdjust the volume of each sample to 10 million viable per mL with DPBS. If the final volume is less than 120 μL, add DPBS so that there is at least 120 μL in the well.\nNote: Less than 120 μL can be used, as the samples will be centrifuged, and the supernatant aspirated before the first staining step. Ensure that each well receives the desired number of cells.\nAdd 100 μL (equivalent to 1 million viable cells) of each sample to the corresponding labeled wells of the 96-well semi-skirted Eppendorf sample plate. Insert the sample plate into a precooled Integra PCR 96 well cooling block (2°C–8°C).\nAdd 50 μL (equivalent to 0.5 million cells) of extra batch control cells to empty wells of the sample plate, or an additional plate, for staining single color controls. Make sure to include a negative control.\nNote: If single color controls have previously been recorded as Library Reference Controls in the SpectroFlo software, they do not need to be recorded again. The normalized reference controls will work for future batches of the same panel.",
    "Note: If single color controls are on a separate plate, repeat all steps for both the sample and control plates.\nAlternatives: If extra batch control samples are not available, other PBMC samples can be used for single color controls. If cells are not available, compensation beads can also be used, but must be optimized before running the experiment.\nMove the plate and cold block into the right most Integra position. Place a reservoir with 50 mL of cold DPBS into the middle Integra position.\nRun the Integra program “FLOW_DILUTE” to add 150 μL of DPBS to each sample well.\nSeal the plate with an adhesive seal and centrifuge at 750 g for 5 min at 2°C–8°C.\nPrepare and apply Viability and Fc Blocking Solution\nPrepare the Viability and Fc Blocking solution in a 5 mL Eppendorf tube and store on ice protected from light for up to 15 min.\ntable:files/protocols_protocol_1158_22.csv\na Includes 20% overage\nAliquot 100 μL of Viability and Fc Blocking solution to the wells corresponding to samples and Viability single color control in an Eppendorf 96-well full skirt plate. Store in the dark at 2°C–8°C.\nNote: Do not add the Viability and Fc Blocking Solution to all control wells, only the single color control for the Viability stain.\nRemove the sample plate from the centrifuge. Insert the plate into the cold block, and transfer to the right most Integra position. Remove the adhesive seal.\nLabel a new reagent reservoir as biohazardous waste and place it in the middle position of the Integra deck. Run the Integra program “FLOW_REMOVE” to remove 250 μL of supernatant from sample wells.\nNote: Once the Integra aspiration step completes, immediately remove the waste reservoir from the middle integra position and discard the fluid in a waste bottle with 10% bleach solution.",
    "Place the 96-well full-skirt plate containing the Viability and Fc Blocking solution in the middle position on the Integra.\nRun the Integra program “FLOW_RSP_MM” to add 90 μL of Viability and Fc Blocking solution to each sample and mix ten times.\nIncubate for 30 min at 2°C–8°C protected from light.\nLabel a new reagent reservoir as Cell Staining Buffer and place it in the middle position of the Integra deck. Add 50 mL of Cell Staining Buffer to the reservoir. Insert the sample plate on the cold block, remove the seal and place on the right of the stage on the Integra.\nRun the Integra program “FLOW_DILUTE” to add 150 μL of Cell Staining Buffer to each sample well.\nSeal the plate and centrifuge at 750 g for 5 min at 2°C–8°C.\nGenerate Master Mix and Stain Cells\nCritical: Centrifuge antibody storage vials at 10,000g for 10 min prior to adding to mastermix to reduce antibody aggregates outlined in troubleshooting problem 5[href=https://www.wicell.org#sec7.9] .\nRecord the lot number of each antibody vial and note lot changes between batches.\nKeep antibodies protected from light at 2°C–8°C until needed.\nPrepare the antibody master mix solution in a 5 mL Eppendorf tube (Table 1[href=https://www.wicell.org#tbl1]) and place on ice, protected from light for up to 1 h.\ntable:files/protocols_protocol_1158_23.csv\naIncludes 20% overage.\nVortex the antibody master mix tubes for 10 s. Centrifuge the tubes at 3000 g, 2°C–8°C for 2 min.\nTransfer 90 μL master mix into corresponding wells of a 96-well full-skirt plate. Keep the master mix solution plate at 2°C–8°C protected from light for up to 1 h until staining.\nInsert the sample plate on the cold block and remove the adhesive seal. Place the biohazardous waste reservoir in the middle position of the Integra deck.",
    "Run the Integra program “FLOW_REMOVE” to remove 250 μL of supernatant from sample wells.\nNote: Once the Integra aspiration step completes, immediately remove the waste reservoir from the middle integra position and discard the fluid in a waste bottle with 10% bleach solution.\nPlace the 96-well full-skirt plate containing 100 μL of antibody master mix in each well needed in the middle position on the Integra.\nRun the Integra program “FLOW_RSP_MM” to add 90 μL of antibody master mix to the sample wells and mix ten times.\nAdd the corresponding antibody volume to each single color control well.\nNote: The volume of each antibody added to single color controls should be the same as the volume for a single sample, including the 20% overage.\nSeal the plate and incubate for 30 min at 2°C–8°C protected from light.\nInsert the sample plate on the cold block and remove the adhesive seal. Place the reagent reservoir containing Cell Staining Buffer in the middle position of the Integra deck.\nRun the Integra program “FLOW_DILUTE” to add 150 μL of Cell Staining Buffer to each sample well.\nSeal the plate and centrifuge at 750 g for 5 min at 2°C–8°C.\nInsert the plate into the cold block and remove the adhesive seal. Place the waste reservoir in the middle position of the Integra deck.\nRun the Integra program “FLOW_REMOVE” to remove 250 μL of supernatant from sample wells. Remove the waste reservoir from the middle integra position and discard the supernatant in a waste bottle with 10% bleach solution.\nPlace the reagent reservoir containing 50 mL Cell Staining Buffer in the middle position of the Integra deck.\nRun the Integra Program “FLOW_WASH” to add 250 μL of Cell Staining Buffer to each sample well and mix ten times.",
    "Seal the plate and centrifuge at 750 g for 5 min at 2°C–8°C.\nPlace the sample plate on the cold block, remove the seal and place it on the right of the stage on the Integra. Place the waste reservoir in the middle position of the Integra deck.\nRun the Integra program “FLOW_REMOVE” to remove 250 μL of supernatant from sample wells.\nNote: Once the Integra aspiration step completes, immediately remove the waste reservoir from the middle integra position and discard the fluid in a waste bottle with 10% bleach solution.\nPlace the reagent reservoir containing 50 mL Cell Staining Buffer in the middle position of the Integra deck.\nRun the Integra Program “FLOW_WASH” to add 250 μL of Cell Staining Buffer to each sample well and mix ten times.\nSeal the plate and centrifuge at 750 g for 5 min at 2°C–8°C.\nNote: Two full washes are needed after antibody master mix staining to ensure no excess antibody is in the solution when the cells are fixed as this could lead to non-specific attachment of antibody to the cell surface.\nInsert the plate on the cold block and remove the adhesive seal. Place the waste reservoir in the middle position of the Integra deck.\nRun the Integra program “FLOW_REMOVE” to remove 250 μL of the supernatant from sample wells.\nNote: Once the Integra aspiration step completes, immediately remove the waste reservoir from the middle integra position and discard the fluid in a waste bottle with 10% bleach solution.\nFix Stained Cells\nRemove the waste reservoir from Integra stage and place a 96-well full-skirt plate containing 110 μL of 20°C–25°C FluoroFix Buffer in each well in the middle position on the Integra.\nCritical: FluoroFix – BioLegend: 4% p-formaldehyde - acute toxicity.",
    "Note: Other 4% p-formaldehyde fixation buffers may be used in place of FluoroFix Buffer.\nRun the Integra program “FLOW_FIX” transfer 100 μL of FluoroFix Buffer from the fixation plate to the sample plate and mix ten times.\nIncubate for 30 min protected from light at 20°C–25°C.\nInsert the sample plate on the cold block and remove the adhesive seal. Place the reagent reservoir containing Cell Staining Buffer in the middle position of the Integra deck.\nRun the Integra program “FLOW_DILUTE” to add 150 μL of Cell Staining Buffer to each sample well.\nSeal the plate with an adhesive seal and centrifuge at 750 g for 5 min at 2°C–8°C.\nPlace the plate on the cold block and remove the adhesive seal. Place the waste reservoir in the middle position of the Integra deck.\nRun the Integra program “FLOW_REMOVE” to remove 250 μL of supernatant from sample wells.\nNote: Once the Integra aspiration step completes, immediately remove the waste reservoir from the middle integra position and discard the fluid in a waste bottle with 10% bleach solution.\nPlace the reagent reservoir containing 50 mL Cell Staining Buffer in the middle position of the Integra deck.\nPerform a post-fixation wash by running the Integra Program “FLOW_WASH” to add 250 μL of Cell Staining Buffer to each sample well and mix ten times.\nSeal the plate with a Microseal B adhesive seal and centrifuge at 750 g for 5 min at 2°C–8°C.\nNote: Only one wash is needed because the fixative has been diluted beyond efficacy.\nPlace the sample plate on the cold block, remove the seal and place on the right of the stage on the Integra. Place the waste reservoir in the middle position of the Integra deck.",
    "Run the Integra program “FLOW_REMOVE” to remove 250 μL of supernatant from sample wells.\nNote: Once the Integra aspiration step completes, immediately remove the waste reservoir from the middle integra position and discard the fluid in a waste bottle with 10% bleach solution.\nPlace the reagent reservoir containing 50 mL Cell Staining Buffer in the middle position of the Integra deck. Run the Integra program “FLOW_FINAL” to add 100 μL of Cell Staining Buffer and mix ten times to resuspend the cells.\nSeal the plate with an adhesive seal and cover with aluminum foil and store at 2°C–8°C.\nPause point: Cells are fixed at this stage and may be stored at 2°C–8°C for up to 18–24 h before data acquisition.\nFlow cytometry data acquisition\nTiming: 4 h (for a full 96 well plate)\nThis section includes information on settings used to acquire processed samples on a five laser Cytek Aurora.\nCritical: Acquire data within 24 h of staining and fixing cells.\nPrepare sample plate\nRemove the seal from the sample staining plate. Mix the wells 10 times to resuspend the samples.\nTransfer the 100 μL of sample volume from each well to a 96 well U bottom plate.\nAdd 160 μL of Cell Stain Buffer to the original sample staining plate and mix 10 times. Transfer 160 μL of the wash volume to the 96 well U bottom plate for acquisition.\nNote: The total volume in the 96 well U bottom plate should be 260 μL per well.\nSet up Cytek Aurora cytometer\nStartup and QC instrument according to manufacturer’s recommendations in plate mode.\nNote: Using the same QC bead lot throughout the course of a longitudinal study will improve consistency. It is recommended that you purchase enough of the same bead lot for the duration of your study.",
    "Set the instrument to acquire 200 μL of sample from each well, mix each well before acquisition, and backflush the sample probe 2 times after every well.\nNote: These settings will allow for ∼50 μL of dead volume per well and acquire samples at a rate of 5000 events/sec or less. This should prevent any bubbles from entering the stream and causing artifacts in the data.\nLoad the 96 well U bottom sample plate onto the instrument.\nRecord Reference Controls\nAlternatives: You can skip this step if reference controls have been previously recorded for this panel.\nIn the QC & Set-up tab of the SpectroFlo software, select Reference Controls.\nAdd the single stain control fluorophores for the panel to be recorded. Label the controls with the corresponding marker and lot number information.\nRecord 50000 events of the stained controls as Library Reference Controls.\nAcquire data and controls on Cytek Aurora cytometer\nSet up a new experiment and label the appropriate experiment details.\nIf acquiring PBMCs for the first time, adjust the FSC-A and SSC-A voltages so that the cells can be discriminated from debris in the lower left portion of the FSC vs. SSC plot. Otherwise, use the same acquisition settings as previous batches.\nAcquire and record samples from the plate.\nNote: Data collection should take approximately 4 h for a full 96 well plate.\nUnmix collected data with corresponding Reference Controls saved in the SpectroFlo Library.\nExport FCS data files as FCS 3.1 format\nThe acquired data can be analyzed with FlowJo or other commonly used software such as Cytobank, FlowCore, CATALYST etc., using linear scales for FSC-A, SSC-A and FCS-H, and biexponential scales for the other markers."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Immunology",
    "Flow Cytometry",
    "Cell Biology",
    "Molecular Biology",
    "Sequencing",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}