{
  "id": 6936,
  "origin_website": "Bio",
  "title": "Sequential Reaching Task for the Study of Motor Skills in Monkeys",
  "procedures": [
    "General NotesMonkeys are water-regulated as approved by the IACUC.The monkeys are weighed and monitored daily. Their body weight should be carefully kept in the range approved by the IACUC throughout the experiment.The monkey’s non-working arm is restrained to the arm holder which is a part of primate chairs using Velcro straps or an adjustable cuff (e.g., Christ Chair system, available here[href=https://www.cristinstrument.com/products/primate-chair/conformamax-chair]).We train the monkeys to perform the tasks using standard reinforcement-based conditioning procedures.General Task DescriptionThe monkeys are trained to perform the Random and the Repeating tasks in alternating blocks. In both tasks, the monkeys are required to make reaching movements to targets displayed on a touch sensitive monitor with their right arm. However, the spatial visual cues are presented according to a different order and timing between the tasks (for details see Procedure C). There is no visual feature to distinguish the Random and Repeating tasks. Here, we describe general features that are common to both tasks.The outlines of five square targets are displayed on the monitor when the task starts and remain visible as long as the task is running. Targets are arranged in a horizontal row and identified as numbers 1 to 5 from left to right (Figures 1 and 2A). The middle target is positioned at the horizontal center of the monitor. Because of the considerable size difference between Macaques and Cebus monkeys, target size varies depending on the species trained. For Cebus monkeys, the size of the targets is 37 mm. The targets are separated by 10 mm. For Macaque monkeys, the size of the targets is 54 mm. They are separated by 11 mm. With these parameters, the monkeys use most of their range of reaching in the frontal plane for task performance.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200817/20200817005015_5883.jpgFigure 2. Behavioral paradigm. A. Random task.",
    "In the Random task, a visual cue is presented in pseudo random order 100 ms after the monkey’s touch on the monitor. B. Repeating task. In the Repeating task, a visual cue is presented according to a predetermined sequence (left panel). Right panel: As the monkey learns the sequence, the monkey started to touch the target in the sequence before the presentation of the visual cue. After extended practice, the monkeys perform the task without visual cues. C and D. Examples of three element sequences of the Repeating task.When the task starts, a trial is initiated and one of the targets is filled with yellow color (Figure 2).To make a correct response, the monkey is required to contact the yellow target within 800 ms after its coloring.A trial ends at the time of a new contact on the monitor or 800 ms elapse.Immediately after the animal's contact on the monitor, the yellow fill disappears, and a new trial starts.The task controller generates a feedback sound for each response (correct: 1 kHz tone, 100 ms duration; error: 50 Hz tone, 100-200 ms duration). In the case of errors or no response, the trial is immediately repeated.The task controller generates a reward after a number of correct responses. Initially, the monkey receives a reward for every correct response. When the monkey understands the rules of the task, the reward frequency is gradually decreased to every 4-5 correct responses. The rate of reward is adjusted for each animal and depending on sequence length in the Repeating task so that the rewards are not associated with particular sequence elements (e.g., every 4th for a 3-element sequence). A current pulse generated by the task controller opens the solenoid in the reward delivery system for a period of time.",
    "This duration varies depending on the setup of the reward delivery system (i.e., height of the water bottle, tubing size).Once the training session is initiated, the monkeys typically perform the task, touching one target after another without interruption, until satiety.The Random and the Repeating TasksIn the Random task, new targets are presented according to a pseudo-random sequence 100 ms after a correct response (Figures 2A and 3A). With this short delay, the monkeys have no time to try to guess the location of the next target. Therefore, in the Random task, the monkey performs visually-guided reaching.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200817/20200817005034_6000.jpgFigure 3. Time course of the tasks. A. Random task. RT: Response Time; MT: Movement Time. B. Repeating task. Beginning of the training of the Repeating task. C. Repeating task after the extensive practice. The monkey predicts the next target in the sequence and touches the target before the presentation of the visual cue. Therefore, Response Time (RT) can be negative. D. During a training session, the monkey performs the Random and the Repeating tasks in alternate blocks of 200-500 trials.In the Repeating task, new targets are presented according to a predetermined repeating sequence (e.g., 5-3-1-5-3-1 ... and 1-2-4-1-2-4 ... or 2-3-4-2-3-4 ...) (Figures 2C-2D). The number of movement elements in a sequence can be modified according to the experiment objective. We trained monkeys successfully on sequences of 3-12 elements in length. In the Repeating task, new targets are presented 400 ms after contact of the correct target (Figures 2B-3B). The monkeys are allowed to touch the new target during the 400 ms delay, before the presentation of the visual cue (yellow fill). When this happens, the current trial ends without coloring the target, the trial is recorded as correct and the task is incremented to the next trial/target.",
    "The delay promotes the performance of predictive responses in which the animal anticipates the next target in a sequence (Figures 2B right panel, 3C), but does not inhibit the flow of movements in a learned sequence. With practice, the monkey performs internally-guided reaching.Each task is performed continuously in alternating blocks of 200-500 trials until the monkey stops working for a total usually in the order of 5,000 (Cebus) or 12,000 (Macaque) trials (Figure 3D). Monkeys are supplemented with water if they do not obtain enough during training.Training ScheduleWe first train the monkey on the Random task. Monkeys become proficient in the performance of the Random task after about 50 days of practice. The monkeys make correct responses in > 80% of trials within 10 training sessions. In the Random task, performance parameters (e.g., RT) stop improving after approximately 50 training sessions.We then introduce the 1st sequence of the Repeating task. From then on, the monkey practices the sequence of the Repeating task and the Random task on every training session in alternating blocks of trials (Figure 3D). There is no interruption or visual distinction between blocks of Repeating and Random tasks.New sequences of the Repeating task can be introduced at various time points in training. On the 1st day of the introduction of the sequence, after a block of the Random task, the task is switched to the Repeating task of a new sequence. There is no cue suggesting the change of the tasks or a new sequence. The monkey learns the sequence on his own by producing it repetitively.Experimental manipulations can be performed at various time points during training depending on the objectives of the experiment.In our experience learning curves are similar across individuals and primate species (Matsuzaka et al., 2007; Obayashi and Picard, unpublished observations).",
    "For a sequence of three elements, monkeys (Cebus, rhesus) make predictive responses in more than 80% trials after approximately 50 training sessions. For a sequence of twelve elements, monkeys (rhesus) make predictive responses in more than 80% trials in 120-190 training sessions."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}