{
  "id": 11763,
  "origin_website": "Jove",
  "title": "Systematic Endobronchial Ultrasound - The Six Landmarks Approach",
  "procedures": [
    "This study uses the EVIS Exera II endoscopy tower with a BF-UC180F EBUS endoscope (Figure 1) to demonstrate the scope and the Surgical Science Simulator (ENDO mentor suite) with the GI-Bronch Mentor software from Simbionix, Essential EBUS Case 6, when performing the EBUS procedure in the simulation-based setting. No patients are included in the study as the entire procedure is performed on the Surgical Science Simulator (ENDO mentor suite). Prior to the EBUS procedure, a complete bronchoscopy is performed using a regular bronchoscope to make sure the bronchial tree has been visualized systematically and to identify key anatomical positions where the underlying lymph node stations must be located (Figure 2).\n1. Handling of the endoscope\nNOTE: The EBUS endoscope is handled similarly to the bronchoscope. However, it is important to note that contrary to the bronchoscope, the EBUS endoscope gives an oblique angle view as the ultrasound transducer reduces the visibility (Figure 3).\nHold the endoscope in the left hand with the left thumb on the steering lever.\nHold the distal end of the endoscope in the right hand and enter the trachea through the nasal or oral cavity. When the vocal cords are visualized at the bottom of the picture (Figure 3B), administer 2 mL of 2% lidocaine twice via the simulator by pressing the appropriate button on the screen, and pass the vocal cords with care.\nAdminister a further 2 mL of 2% lidocaine in the trachea as well as in the right and left main bronchus, respectively.\n2. Anatomy\nAfter having inspected the bronchial tree, retract the bronchoscope and change to the EBUS scope. Turn on the ultrasound transducer and locate the six anatomical EBUS landmarks in the order mentioned below.\n\t\nLocate Landmark 1 = station 4L",
    "Locate station 4L at the left side of the trachea, just cranial to the carina. To find station 4L, turn the endoscope counterclockwise in the trachea and locate it between the arch of the aorta and the left pulmonary artery, sometimes referred to as \"the Mickey Mouse window\" (Figure 4).\nLocate Landmark 2 = Station 7\n\t\t\nLocate station 7 between the right pulmonary artery and the left atrium below the carina. Place the EBUS scope in the right or the left main bronchus and turn the endoscope facing medially (Figure 5).\nLocate Landmark 3 = Station 10L\n\t\t\nLocate station 10L adjacent to the left main bronchus cranial to the left upper lobe. Place the endoscope in the left main bronchus or the left upper lobe and look upwards. The upper border of the left pulmonary artery forms the boundary between stations 4L and 10L (Figure 6).\nLocate Landmark 4 = Station 10R\n\t\t\nLocate station 10R on the lateral wall of the right main bronchus, just caudal to the inferior border of the azygos vein. The upper border is the lower border of the azygos vein. Place the endoscope in the right main bronchus or the right upper lobe bronchus and look upwards (Figure 7).\nLocate Landmark 5 = The azygos vein\n\t\t\nTo find the azygos vein, retract the endoscope slightly cranially and turn the transducer clockwise in the trachea. Turn the transducer counterclockwise to visualize the azygos vein draining into the superior vena cava (Figure 8).\nLocate Landmark 6 = Station 4R",
    "To find station 4R, retract the endoscope further cranially from the azygos vein and turn the transducer clockwise in the trachea. Locate station 4R to the right or in front of the trachea above the lower border of the azygos vein, which marks the border between station 10R and 4R (Figure 9).\nAfter having located the six landmarks, look for other lymph node stations, i.e., stations 2R, 2L, 11R, and 11L, and other structures of clinical importance. At least stations 4L, 7, and 4R should be biopsied3.\nWhen the relevant lymph node is localized, ask the assistant for the biopsy equipment. The biopsy equipment includes a sheath protecting the needle, connected to a handle that can be locked onto the endoscope. Inside the sheath is the needle, and inside the needle is the stylet. When inserting the needle into the working channel, keep the steering lever in a neutral position as shown in the video to avoid damage to the endoscope.\n\tNOTE: The needle used here comes with the simulator. However, the recommended needle size for this procedure is 21 G.\nAdjust the sheath so it is visible at the end of the endoscope; however, no more than 1-2 mm.\nTurn the transducer towards the bronchial wall so the lymph node is visualized on the left side of the ultrasound picture. Now, perform the biopsy.\nAfter puncturing the lymph node with the needle, ask the assistant to remove the stylet and then apply suction to the needle by pressing the appropriate button on the screen. The needle must be moved back and forward several times.",
    "Remove the suction and retract the needle tip while inside the sheath. Ensure that the distal end of the endoscope is not flexed and remains in a neutral position to prevent damage to the endoscope. Each lymph node must be punctured at least three times10,11.\nAfter the final biopsy, check for bleeding. Inspect the place for biopsy with the white light view and stay for a few seconds. If no bleeding is observed, retract the endoscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}