{
  "id": 3986,
  "origin_website": "Cell",
  "title": "Combined single-molecule fluorescence in situ hybridization and immunohistochemistry analysis in intact murine dorsal root ganglia and sciatic nerve",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTissue sectioning\nTiming: 3 h; 1–2 h to dry for DRG tissue section, overnight (12-16 h) to dry for sciatic nerve tissue section\nThis step describes how to section and thaw-mount tissue onto slides in preparation for RNAscope-based in situ hybridization and immunohistochemistry.\nSee Figure 2[href=https://www.wicell.org#fig2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/704-Fig2.jpg\nFigure 2. Frozen section and mount slices on slides\nDistribute all conditions on a single slide whenever possible, including ipsilateral (ipsi) or contralateral (contra) to an experimental manipulation such as nerve injury.\nSet the cryostat to −23°C and place tissue blocks frozen in OCT inside the cryostat. Allow 1 h for the blocks to reach −23°C; this acclimatization step helps achieve high quality tissue slices by reducing slice curling or damage during subsequent cryosectioning.\nMount the blocks onto the cryostat chuck, keeping track of any specific orientation dictated by the tissue embedding pattern. Align tissue block with cryostat blade to ensure that sectioning occurs parallel to the bottom of the block, and thus keep all embedded tissues in the same plane of section.\nCryosection the blocks by cutting sections of 12 μm in thickness, using fine paint brushes to prevent the tissue sections from curling or to gently uncurl prior to mounting. Thaw-mount tissue sections onto room temperature (20°C–24°C) microscope slides; the frozen sections will melt on the slide due to the temperature difference.\nNote: Use SuperFrost Plus slides for DRG tissue and poly-lysine adhesion coated slides for sciatic nerve tissue to avoid tissue detachment from the slide during processing.\nNote: If multiple tissues are mounted in a block in a specific pattern, maintain consistency in the orientation in which multiple sections are mounted on the slides, keeping in mind that the tissue orientation may be inverted during the cutting and mounting process.",
    "Note: Representing sections from all conditions upon one slide will minimize and allow detection of potential batch effects in staining and subsequent analysis; example diagram in Figure 2[href=https://www.wicell.org#fig2].\nAir dry slides at room temperature for 60 - 120 min for DRG tissue, air dry the slides at room temperature overnight (12 - 16 h) for sciatic nerve tissue. Maintain RNAse-free.\nPause Point: Slides can be stored at −80°C for up to three months.\nNote: The drying time is important to securely mount the tissue sample onto the slides; insufficient drying may lead to tissue detachment during subsequent steps. Longer drying has empirically been found to help retain sciatic nerve sections.\nSample permeabilization\nTiming: 3 h, overnight (12–16 h) to dry for sciatic nerve tissue\nIn this step, tissue that has been thaw-mounted onto slides is permeabilized and a hydrophobic barrier is subsequently created between individual tissue sections in preparation for in-situ hybridization with RNAscope and immunohistochemistry.\nAcclimate the slides (stored at −80°C) for 30–60 min in a 37°C incubator. Sciatic nerve tissue requires a subsequent air-drying step at 20°C–24°C for 12–16 h to improve tissue adherence to the slide before the following steps.\nWash the slides with 1× RNase-free PBS in a slide rack at room temperature (20°C–24°C ; RT) for 5 min on a rotary shaker with gentle rotation (recommend: 30–40 rpm).\nLay the slides on the bench and remove excess PBS by suction using a vacuum line fitted with a glass Pasteur pipette. Quench endogenous peroxidases by adding 4–6 drops of RNAscope Hydrogen Peroxide (∼ 1 drop per section) to cover all the sections. Allow to sit for 10 min exactly.",
    "Remove the RNAscope Hydrogen Peroxide solution by gently tapping the bottom edge of the slide against an absorbent towel. Excess droplets of RNAscope Hydrogen Peroxide solution will be absorbed by the towel. Immediately wash the slides with DEPC-H2O in a slide rack at RT for 2 min on a rotary shaker (30 - 40 rpm).\nWash again with DEPC-H2O for 2 min at RT on a rotary shaker (30–40 rpm).\nOptional step: Target Retrieval\nCritical: Performing target retrieval steps for sciatic nerve tissue is not recommended as it may cause this particular tissue to detach from the slide; alternative approaches such as using gelatin-coated slides could be assayed to improve retention of sciatic nerve sections on slides during target retrieval. We found that target retrieval was beneficial for all probes that we tested in DRG tissue, although the utility of target retrieval could change if an experimenter varied the fixation conditions or the tissue type.\nFill the Steamer water reservoir with cold tap water, and place a clear Steaming Bowl onto the base. Place two slide racks into the bowl, fill one with 200 mL of RNAscope 1× Target Retrieval Reagent, and fill the other with 200 mL of DEPC-H2O.\nTurn on the Steamer. Block all vent holes (covering with tape will suffice) to prevent escape of steam. Allow temperature to rise to at least 97°C.\nNote: Insert a thermometer into the container containing RNA scope 1× Target Retrieval Reagent to check temperature.\nNote: Be sure to use a steamer with a bowl tall enough to accommodate the slide racks\nAdd slides to the slide rack containing DEPC-H2O for 10 seconds to allow them to acclimate.",
    "Transfer slides into the slide rack containing RNAscope 1× Target Retrieval Reagent. Block any vent holes to prevent escape of steam and treat for 5 min.\nRemove slides from the steamer and transfer immediately to a separate rinse slide rack filled with DEPC-H2O. Rinse for 15 sec.\nTransfer slides to a slide rack filled with RNase-free 100% ethanol for 3 min.\nDry slides at RT.\nDraw a barrier of 20mm × 20mm around each section on the slide with the ImmEdge hydrophobic barrier pen (Figure 3[href=https://www.wicell.org#fig3]). Draw each outline 2–4 times to ensure a continuous barrier.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/704-Fig3.jpg\nFigure 3. Draw hydrophobic barrier\nOutline tissue on slides with the hydrophobic barrier pen, right image.\nCritical: Do not touch the tissue section.\nPause Point: Dry slides completely for 5 min to 18 h at RT.\nTurn on the HybEZ Oven and set its temperature to 40°C.\nPlace the dried slides into the HybEZ slide tray and permeabilize the tissue by adding ∼ one drop per section of the RNAscope Protease III, to entirely cover each tissue section.\nLoad the slide tray into the oven and incubate for 30 min at 40°C.\nNote: Ensure that the oven is already at 40°C before loading in the slide rack.\nRemove the RNAscope Protease III solution tapping the bottom edge of the slide against an absorbent towel. Droplets of RNAscope Protease III solution will fall downwards and become absorbed by the towel. Immediately wash the slides with DEPC-H2O in a slide rack at RT for 2 min on a rotary shaker (30 - 40 rpm).\nWash the slides again with fresh DEPC-H2O for 2 min at RT on a rotary shaker (30 - 40 rpm).",
    "Critical: Do not allow the slides to dry from this step onwards. Leave the liquid on tissue until you suction it off and immediately add the solution in the next step.\nProbe hybridization\nTiming: 3 h\nThis step involves the hybridizing of RNAscope Double-Z probes to target mRNAs.\nSee Figure 4[href=https://www.wicell.org#fig4]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/704-Fig4.jpg\nFigure 4. Hybridize probe and amplifiers\nNote: RNAscope probes and Solution are stored at 4°C. Pre-warm the RNAscope Probe Solution for 10 min in a 37°C incubator or water bath checking that white precipitate is dissolved, then cool to room temperature ( 20°C - 24°C ).\nNote: If the probe requires dilution, dilute the probe with RNAscope Probe Dilution Buffer (1 vol : 50 vol). If hybridizing multiple probes on one section, dilute all the probes together with probe dilution buffer (1 vol : 50 vol) to make a probe master mix. If hybridizing multiple probes on one section and one of probes is more dilute from the manufacturer (e.g control and C1 RNAscope probes), dilute all other probes into the manufacturer- diluted probe solution (1 vol : 50 vol) to make the probe master mix. Diluted probes may be stored at 2°C- 8°C for up to 6 months.\nRemove any excess liquid by suctioning the liquid with a vacuum pump fitted with a glass Pasteur pipette to maintain gentle suction. Place the slides into the HybEZ slide tray and add about one drop (∼50 μl) per 20 mm × 20 mm section of the diluted probes to entirely cover the tissue.\nCritical: If you are hybridizing multiple probes on one section, make sure that each probe is in a different channel.\nLoad the slide tray into the oven and incubate for 2 h at 40°C.",
    "Wash the slides with1× RNAscope Wash Buffer in a slide rack for 2 min at RT on a rotary shaker (30 - 40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at RT on a rotary shaker (30–40 rpm).\nAmplification of probe signal\nTiming: 2.5 h\nThis step involves the binding of amplifiers to amplify the signal of a single double Z probe pair used for smFISH; components are included in RNAscope® Multiplex Fluorescent Reagent Kit v2.\nSee Figure 4[href=https://www.wicell.org#fig4]\nNote: Solutions are stored in 4°C. Pre-warm the RNAscope Multiplex FL v2 AMP 1 solution (included in RNAscope® Multiplex Fluorescent Reagent Kit v2) for 10 min in a 37°C incubator (or water bath), then cool to RT.\nHybridize AMP 1.\nRemove excess liquid from the slides by suctioning the liquid with a vacuum pump fitted with a glass Pasteur pipette to maintain gentle suction.\nPlace the slides into the slide tray and add one drop per section of RNAscope Multiplex FL v2 AMP 1 solution to entirely cover the tissue.\nLoad the slide tray into the oven and incubate for 30 min at 40°C.\nWash the slides with 1× Wash Buffer in a slide rack for 2 min at RT on a rotary shaker (30 - 40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at RT on a rotary shaker (30 - 40 rpm).\nNote: Pre-warm the RNAscope Multiplex FL v2 AMP 2 solution for 10 min in a 37°C incubator (or water bath), then cool to 20°C –24°C .\nHybridize AMP 2.\nRemove excess liquid from the slides by suctioning the liquid using a vacuum line fitted with a glass Pasteur pipette.",
    "Place the slides into the slide tray and add one drop per section of RNAscope Multiplex FL v2 AMP 2 solution to entirely cover the tissue.\nLoad the slide tray into the oven and incubate for 30 min at 40°C.\nWash the slides with 1× Wash Buffer in a slide rack for 2 min at 20°C –24°C on a rotary shaker (30–40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at 20°C–24°C on a rotary shaker (30–40 rpm).\nNote: Pre-warm the RNAscope Multiplex FL v2 AMP 3 solution for 10 min in a 37°C incubator (or water bath), then cool to 20°C–24°C.\nHybridize AMP 3.\nRemove excess liquid from the slides by suctioning the liquid with a vacuum pump fitted with a glass Pasteur pipette.\nPlace the slides into the slide tray and add one drop per section of RNAscope Multiplex FL v2 AMP 3 solution to entirely cover the tissue.\nLoad the slide tray into the oven and incubate for 30 min at 40°C.\nWash the slides with 1× Wash Buffer in a slide rack for 2 min at 20°C–24°C on a rotary shaker (30–40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at 20°C–24°C on a rotary shaker (30 - 40 rpm).\nCritical: All of the amplification steps are necessary, even if a single probe is being used.\nDevelop HRP channels with fluorescent signals\nTiming: 1.5 h / channel\nThis step involves the sequential development of HRP channels and binding of fluorophores for probes in different channels, allowing individual mRNAs to be subsequently visualized by confocal microscopy.\nNote: Solutions are stored at 4°C. Pre-warm the RNAscope Multiplex FL v2 HRP solutions for 10 min in a 37°C incubator (or water bath), then cool to 20°C–24°C prior to use.",
    "Remove excess liquid from the slides by suctioning the liquid with a vacuum pump fitted with a glass Pasteur pipette. Place the slides into the slide tray and add one drop per section of RNAscope Multiplex FL v2 HRP solution to entirely cover the tissue.\nNote: Choose the appropriate HRP channel to develop depending on the probe channel (e.g., Develop HRP channel 1 with RNAscope Multiplex FL v2 HRP-C1 solution for C1 probes). Load the slide tray into the oven and incubate for 15 min at 40°C.\nWash the slides with 1× Wash Buffer in a slide rack for 2 min at 20°C–24°C on a rotary shaker (30–40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at 20°C–24°C on a rotary shaker (30–40 rpm).\nRemove excess liquid from the slides by suctioning the liquid with a vacuum pump fitted with a glass dropper pipette. Place the slides into the slide tray and add ∼50 μL Opal Dye working solution per section to entirely cover the tissue.\nNote: See preparation for Opal Dye working solution in materials and equipment[href=https://www.wicell.org#materials-and-equipment].\nLoad the slide tray into the oven and incubate for 30 min at 40°C.\nWash the slides with 1× Wash Buffer in a slide rack for 2 min at 20°C–24°C on a rotary shaker (30–40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at 20°C–24°C on a rotary shaker (30–40 rpm).\nNote: Pre-warm the RNAscope Multiplex FL v2 HRP blocker solution for 10 min in a 37°C incubator (or water bath), then cool to 20°C–24°C.",
    "Remove excess liquid from the slides by suctioning the liquid with a vacuum pump fitted with a glass Pasteur pipette. Place the slides into the slide tray and add one drop per section of the RNAscope Multiplex FL v2 HRP blocker solution to entirely cover the tissue.\nLoad the slide tray into the oven and incubate for 15 min at 40°C.\nWash the slides with 1× Wash Buffer in a slide rack for 2 min at 20°C–24°C on a rotary shaker (30 - 40 rpm).\nWash again with fresh 1× Wash Buffer for 2 min at 20°C–24°C on a rotary shaker (30 - 40 rpm).\nNote: If hybridizing multiple RNAscope probes assigned to different channels (e.g., C1,C2, or C3) on a single section, ensure that the probes are in different channels (e.g., C1, C2, or C3), repeat the above steps (30–40) to develop fluorescent signals for each channel, using a distinct dye for each channel until all channels have been developed. When using multiple probes in different channels and/or combining smFISH with IHC on one section, nsure adequate separation of emission/excitation spectra in your experimental design, as described in the probe-ordering section of this protocol.\nImmunohistochemistry\nTiming: 2 days, overnight (16–18 h) for primary antibody incubation\nThis step identifies proteins present within the fixed tissue with primary and fluorescently-labeled secondary antibodies so that their abundance, spatial localization and relationship to target mRNAs may be observed by microscopy.\nNote: Maintain RNAse-free conditions. We have had consistent results conducting immunohistochemistry (IHC) steps after the in-situ hybridization (ISH), as presented in this protocol. ACDBio recently released an ancillary kit in which IHC is instead conducted prior to ISH with the RNAscope probes.",
    "Prepare the IHC dark humidity tray by filling up to 1 mL distilled water into each well between the rails of the tray to keep the tray humidified and prevent slides from drying during staining. Carefully place the slides on rails of the IHC tray.\nNote: If not using a commercial IHC humidity tray, a humidified tray can be made by soaking several paper towels in distilled water without wringing, rolling the towels into cylinders, and then using them to line the internal walls of an opaque and flat plastic container.\nRemove excess liquid from the slides by gently suctioning the liquid using a vacuum line fitted with a glass Pasteur pipette.\nLay slides in dark humidity tray and drop ∼100 μL PBST.1 wash buffer per section onto tissue. Wash for 10 min and suction the liquid with a vacuum pump fitted with a glass Pasteur pipette. Wash the slides three times at room temperature (20°C–24°C) in the dark.\nAdd ∼50 μL per section of the Blocking Reagent to entirely cover the tissue. Incubate for 30 - 60 min in dark humidity tray at 20°C–24°C.\nDilute primary antibody in Antibody Diluent Buffer.\nRemove the blocking reagent by suctioning the liquid with a vacuum pump fitted with a glass Pasteur pipette. Add ∼50 μL per section of the diluted primary antibody to entirely cover the tissue. Incubate the slides in dark humidity tray 16–18 h at 4°C.\nWash the slides three times in PBST.1 Wash Buffer for 10 min per wash at 20°C–24°C in the dark; an opaque box can be placed over the slides and removed only briefly during addition/suction of liquid.\nDilute fluorophore-conjugated secondary antibody in Antibody Diluent Buffer, as required. Our antibody dilutions are listed in the Resource Table.",
    "Add ∼50 μL per section of the diluted secondary antibody to entirely cover the tissue. Incubate the slides for 1–2 h in dark humidified tray at 20°C–24°C.\nWash the slides three times in RNase-free PBS for 10 min per wash at 20°C–24°C in the dark.\nCounterstaining and mounting slides\nTiming: 5 min / slide\nThis step prepares the tissue that has undergone RNAscope and IHC for microscopy.\nOptional step: Nuclear Staining\nDilute the Hoechst 500× stock solution with RNase-free PBS (1 vol : 500 vol).\nRemove excess liquid on the slides by suctioning the liquid with a vacuum pump fitted with a glass dropper pipette.\nAdd ∼50 μL per section of the diluted Hoechst solution onto the slide to entirely cover the tissue. Incubate the slides for 10 min in the dark in the humidified tray at 20°C–24°C.\nRemove the excess liquid by suction the liquid with a vacuum pump fitted with a glass Pasteur pipette to maintain gentle suction.\nNote: We have not found a wash step to be required at this Hoechst dilution, however a wash step could be inserted if the background is found not to be negative when imaged.\nRemove excess liquid from the slides and add 1 small drop (∼5 μL) of Prolong Gold antifade mounting medium on top of each section (∼ 20 μL per slide).\nCarefully place a 24mm × 50mm glass coverslip over the tissue sections, avoiding production of air bubbles.\nNote: Moving or lifting the coverslip after placing it on top of the tissue may cause tissue damage.\nDry slides for at least 24 h to cure in the dark before proceeding to imaging.",
    "Pause Point: Slides mounted with Prolong Gold can be stored in the dark at 2°C- 8°C for up to two weeks and still retain good signal. Store mounted slides in −20°C with desiccant for longer storage times.\nImaging slides\nTiming: 15 min / slide\nThis step discusses approaches to image the slides of fixed tissue that has undergone RNAscope and immunohistochemistry preparation for microscopy.\nWe performed super-resolution RNAscope imaging on a confocal laser scanning microscope (LSM800, Zeiss) equipped with an Airyscan super-resolution module (producing an ∼1.7 fold increase in resolution in all XYZ spatial dimensions; Application Note (Huff, 2015[href=https://www.wicell.org#bib5])) and a 63× magnification oil immersion objective with high-NA (1.4) (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]”).\nNote: A 63× super-resolution imaging approach is not required for RNA puncta counting in DRG samples for low to medium expression RNAs, but may be beneficial to quantify the increased puncta density of high abundance RNAs. The imaging of smFISH in DRG and effective quantification by the approach presented here may also be done with a 25× oil objective or equivalent. An aside of relevance to some investigators is that application of the Airyscan super-resolution module can yield improvements over non-Airyscan even if the objective (e.g., a lower magnification 25×) is not optimized for Airyscan.\nNote: A high resolution imaging approach is imperative to allow correct assignment of RNA puncta in sciatic nerve sample with small structures and cellular heterogeneity. As an example in this protocol, we obtained reliable results using a 63× objective and imaging with an Airyscan super-resolution module.\nSelect an objective and find the fields to be imaged:",
    "Note: While lower magnification objectives (25×) can capture a broader field of view, higher magnification (63×) may be needed to resolve small numerous puncta and cellular complexity. An image tiling feature, if available, may be used to combine higher magnification with a broader field.\nNote: If an oil objective (25× or 63×) is needed, the area of interest for imaging can be efficiently found by first scanning the image with a lower magnification dry objective.\nCritical: Ensure your slide is clean and dry prior to imaging.\nSet the image acquisition parameters for each channel: Resolution, scan speed, and frame averaging should be set optimally taking into consideration that the parameters should be held constant across samples intended for quantitative comparison. Excitation line and emission collection range will be determined by the excitation and emission spectra for the fluorescence dyes selected for a particular channel. Excitation power, master gain and digital offset should be adjusted for maximal resolution and signal:noise ratio; pinhole is set to optimal based on other imaging parameters.\nCritical: Ensure the imaging bit depth is set to 8 bit when using Airyscan.\nNote: Higher resolution, slower scan speed and more averaging can be used to decrease noise if observed, but are more time-consuming and could result in bleaching.\nNote: We use the Zeiss Airyscan super-resolution module for the RNAscope channel to improve the resolving power for individual mRNA puncta when imaging DRG, and for all channels when imaging sciatic nerve to improve spatial resolution.",
    "Note: A recommended starting power for the excitation line in our system or similar is between 0.2%–0.3%. To determine your optimal laser power and scan settings, check for image saturation in orthogonal projections as well as single slices before proceeding, also check for visualization of signal above the negative control slide. The optimal excitation power will generate no saturation in orthogonal projections and no signal in appropriate negative control slides.\nNote: Lower master gain may enhance the signal:noise ratio (SNR).\nSet Z stacks for the image: The upper and lower limit of the stack may be set based on the RNAscope or, preferably, the IHC channel. Set the optical inter-slice interval to optimal based on acquisition and imaging parameters. The experimenter collecting images should be blinded to the sample condition or identity to reduce the potential for bias.\nNote: Keep the inter-slice interval of the Z stack images constant when imaging the same batch of samples. Oversampling by halving the ‘optimal’ inter-slice interval can be used in occasional settings requiring high axial resolution and improved SNR if photo-bleaching is not an issue.\nObtain the images: mRNAs in RNAscope channel with Airyscan module are detected as discrete or compound (clustered) puncta. The mRNA puncta will be quantified within co-stained markers using the Z stack images.\nCritical: Retain the same imaging parameters across all samples if the goal is to obtain quantitative comparisons. Avoid excessive exposure times to limit photobleaching."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Neuroscience",
    "In Situ Hybridization",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}