{
  "id": 6796,
  "origin_website": "Bio",
  "title": "Flow Cytometry Measurement of Glucocerebrosidase Activity in Human Monocytes",
  "procedures": [
    "Aseptic techniqueConduct experiments in a class II biological safety cabinet using appropriate PPE to maintain safety and sterility.Isolation of human peripheral blood mononuclear cells (PBMC)Perform venepuncture with the arm in a downward position. Collect venous blood into 8 ml BD Vacutainer Cell Preparation Tubes (CPT), keeping tubes upright following blood collection. Immediately prior to centrifugation, invert tubes 8 times to remix the blood sample.Centrifuge at 1,800 x g for 20 min at room temperature (21 °C) in a swing bucket centrifuge with acceleration and deceleration set at 9.Collect PBMC layer with sterile glass pipette (whitish layer just beneath the plasma) and transfer to a 15 ml tube. For more specific details and images on collecting the PBMC layer from CPT tubes please refer to the following Bio-protocol publication https://bio-protocol.org/e2103[href=https://bio-protocol.org/e2103] (Puleo et al., 2017).Add room temperature 1x DPBS to bring volume to 15 ml and invert tube 5 times, followed by centrifugation for 15 min at 300 x g at room temperature.Aspirate supernatant and resuspend pellet in 10 ml of warmed (37 °C) culture media for cell counting.Dilute PBMC suspension 1:1 in Trypan blue, transfer mixture to a cell counting chamber slide, and count PBMCs using an automated cell counter.Determine the required volume to obtain 1 x 106 cells.Note: Cell Preparation Tubes should be centrifuged within 2 h of blood collection as GCase activity declines if blood is left longer.Distribution of PBMCs into Eppendorf tubesAdd 1 x 106 PBMCs per Eppendorf tube, with a total of three Eppendorf tubes for each subject, as shown in Table 1. One tube receives CBE (tube 1) and one tube receives DMSO (tube 2), with each of these followed by the addition of PFB-FDGlu substrate. The third tube is an isotype control.Table 1. Distribution of PBMCs into Eppendorf tubesimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200330/20200330233326_3904.",
    "jpgAddition of CBE or DMSO to appropriate tubesCentrifuge tubes at 300 x g for 5 min at room temperature and decant supernatant.Gently resuspend cells in 96 μl of culture media.Add 2 μl of 50 mM CBE stock solution into tube 1 to achieve a final concentration of 1 mM, and add 2 μl of DMSO into tube 2Vortex tubes gently to mix.Incubate at 37 °C with 5% CO2 for 60 min.Addition of PFB-FDGlu substrate to appropriate tubesFollowing the 60 min incubation, add 2 μl of 37.5 mM PFB-FDGlu stock solution into tubes 1 and 2 to achieve a final concentration of 0.75 mM.Vortex tubes gently to mix.Incubate at 37 °C with 5% CO2 for 30 min.Note: If adapting this protocol for cell types other than PBMCs it is recommended to perform time course experiments to ensure the assay remains in the linear range.Termination of reactionTo terminate the reaction, add 1 ml of ice-cold FACS buffer.Pellet cells via centrifugation at 300 x g for 5 min at 4 °C and decant supernatant.Staining for CD14 positive monocytesResuspend cells in 95 μl of ice-cold flow buffer and add 5 μl of anti-CD14 antibody into tubes 1 and 2.Add 5 μl of isotype control antibody into tube 3 if using BD. For other brands of isotype control, ensure usage at the same concentration as the BD anti-CD14 antibody.Vortex tubes gently to mix.Incubate for 20 min at 4 °C, protected from light.Add 1 ml of FACS buffer to tubes, centrifuge at 300 x g for 5 min at 4 °C, and discard supernatant.Resuspend cells in 350 μl FACS buffer.Pass each cell suspension through the cell strainer cap into the 5 ml polypropylene tube compatible with the flow cytometer. Store tubes shielded from light at 4 °C until flow cytometry data acquisition.",
    "Note: Other surface marker antibodies for lymphocyte or monocyte populations can be included. Antibodies we have successfully used are CD3 for T-lymphocytes, CD19 for B-lymphocytes and CD16 for non-classical monocytes. However, fixing the cells and performing intracellular staining is detrimental to the PFB-FDGlu signal and not recommended.Data acquisitionAcquire data on a BD LSR Fortessa X-20 Cell Analyser using FACSDiva or equivalent cytometer and software, collecting a minimum of 50,000 events per tube.Export FCS files from FACSDiva software."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}