{
  "id": 13379,
  "origin_website": "Jove",
  "title": "Analysis of Epididymal Protein Synthesis and Secretion",
  "procedures": [
    "All experimental procedures involving animal tissue collection were approved by the University of Newcastle's Animal Care and Ethics Committee.\n1. Immunofluorescence Staining of the Paraffin-embedded Epididymal Sections (Figures 1 and 2)\nImmediately after the euthanasia of adult mice via CO2 inhalation (Swiss mice, over 8 weeks old), carefully dissect the epididymis (using surgical scissors and tweezers) free of overlying connective tissue and fat and immerse in Bouin’s fixative solution (> ten times volume/tissue weight) for overnight fixation.\nWash the tissue with 70% ethanol with 2× changes daily for 2 days and then dehydrate through graded ethanol (70%, 95% and 100%) in preparation for infiltration and embedding into a paraffin block.\nSection the paraffin blocks at a thickness of 4-6 µm and mount on the slides in preparation for immunofluorescence staining.\nIn a fume hood, dewax the epididymal paraffin sections by adding a sufficient amount of xylene to the slide jar to completely immerse the tissue section (3× 5 min each time).\nRehydrate the tissue sections by the immersion in graded ethanol solutions diluted in purified H2O (100% ethanol 5 min, 100% ethanol 5 min, 90% ethanol 1 min, 80% ethanol 1 min, 70% ethanol 1 min, and 50% ethanol 1 min).\nWash the sections in a slide jar once for 5 min with sufficient phosphate buffered saline (PBS) to completely immerse the entire tissue section (follow these directions for all subsequent washes).\nDecant appropriate antigen retrieval solution (i.e., 10 mmol/L sodium citrate, 50 mmol/L Tris pH 10.5 or alternative antigen retrieval solution(s), depending on the antigen to be detected) into a slide rack and microwave until boiling. Immerse the slides into this solution and subject the tissue sections to heat-induced antigen retrieval conditions optimized for individual antibodies (see Table 1).",
    "Caution: Ensure that the slides are fully immersed in antigen retrieval solution during the antigen retrieval process.\nRemove the slide container from the microwave and cool to room temperature.\nRinse the slides with PBS and use a liquid-repellent slide marker pen to trace around the tissue section.\nPlace the slides in a humidified container (created by a moistened tissue at the base of the container), and apply blocking solution (3% BSA/PBS, previously filtered through a 0.45 µm filter) for 1 h at 37 °C.\nRinse the slides once with PBS.\nIncubate the sections with appropriate primary antibody diluted to an experimentally optimized concentration in filtered 1% BSA/PBS at 4 °C overnight (1:60 for anti-DNM1, DNM2 and DNM3 antibodies; 1:100 for anti-ATP6V1B1 antibody, see Table of Materials for antibody details).\n\tNote: To distinguish specific from non-specific antibody binding, it is necessary to include stringent negative (i.e., secondary antibody only, primary antibody preabsorbed against immunizing peptide) and positive controls24.\nRewarm the slides by placing at room temperature for 30 min.\nWash the slides 3× with PBS on a shaking platform (60 rpm) for 10 min each.\nIncubate the sections with appropriate secondary antibody diluted in 1% BSA/PBS (filtered through a 0.45 µm filter) at 37 °C for 1 h (1:400 dilution for all secondary antibodies, see Table of Materials for antibody details).\n\tCAUTION: Keep the slide container in the dark from this step onwards. For dual labeling, choose a compatible combination of secondary antibodies (i.e., secondary antibodies must have been raised in different species).\nWash the slides 3× with PBS on a shaking platform (60 rpm) for 10 min each.\nCounterstain the sections with propidium iodide (PI, 7.48 μmol/L) or 4΄,6-diamidino-2-phenylindole (DAPI, 4.37 μmol/L) for 2 min at room temperature to label the cell nucleus.",
    "Wash the slides twice with PBS on a shaking platform (60 rpm) for 5 min each.\nMount the sections with 10% Mowiol 4-88 prepared in a solution of 30% glycerol in 0.2 mol/L Tris (pH 8.5) and 2.5% 1, 4-diazabicyclo-(2.2.2)-octane.\nSeal the coverslip with nail varnish and store the slides at 4 °C for future observation.\n\tCAUTION: It is recommended to perform the imaging of the slides as soon as practical after the preparation to avoid excessive loss of fluorescence.\n2  Isolation of Epididymosomes from the Mouse Caput Epididymis (Figure 3)\nImmediately after the euthanasia of adult mice via CO2 inhalation (Swiss mice over 8 weeks old), perfuse their vasculature with PBS (pre-warmed to 37 °C) to minimize the blood contamination of epididymal tissue.\n\tCAUTION: Blood plasma contains diverse populations of exosomes, which are of similar size to epididymosomes25. The efficacy of blood clearance from epididymal tissue can be accessed via the inspection of the initial segment, a highly vascularized epididymal segment located proximal to the caput segment (i.e., zone 1 in Figure 1A)\nCarefully dissect the epididymis free of overlying fat and connective tissue, and rinse with modified Biggers, Whitten, and Whittingham medium (BWW; pH 7.4, osmolality of 300 mmol/kg water26,27) to reduce any potential for surface blood contamination.\nBlot the epididymal tissue to remove excess media, dissect the caput epididymis (i.e., zones 2-5 in Figure 1A) and transfer to a fresh Petri dish (35 × 10 mm) containing BWW medium. Ensure that the amount of medium is sufficient for the final recovery.\n\tNote: For 6 caput epididymides, it is recommended to use 1.1 mL of the medium to allow for a recovery of ~900 µL, which is then evenly split and applied atop of 2 pre-prepared gradients (see step 2.9).",
    "Make a number of small incisions into the caput tissue with a razor blade. Do not mince the tissue and thus avoid contaminating the sample with excessive cytosolic contents. Incubate the plate containing the tissue with mild agitation at 37 °C for 30 min to release the luminal contents.\nFilter the resultant suspension through 70 µm membranes to remove the cellular debris.\nCollect the filtrate and subject this to successive centrifugation steps at 4 °C with increasing velocity in order to eliminate cellular debris (i.e., 500 × g, 2,000 × g, 4,000 × g, 8,000 × g, 5 min each; 17,000 × g for 20 min, and finally 17,000 × g for an additional 10 min or until no pellet is formed after centrifugation).\n\tCAUTION: It is important to assess the color of the pellet after the initial 500 × g centrifugation step to ensure minimal blood contamination is present. Discard any samples in which this pellet displays pink coloration.\nPrepare discontinuous iodixanol gradients (comprising 40%, 20%, 10%, 5% layers) by diluting a density gradient medium (comprising 60% (w/v) aqueous iodixanol) with a solution of 0.25 mol/L sucrose and 10 mmol/L Tris (pH 7.5).\nPrepare the gradient in an ultracentrifuge tube (11 × 35 mm), with each fraction of 450 µL (Figure 3). Visually inspect the gradient after the application of each fraction to ensure that the interfaces are successfully formed between each layer prior to loading the epididymal fluid sample. Prepare each gradient fresh on the day of use, however, the epididymal luminal fluid sample can be preserved at 4 °C for up to 2 h prior to loading.\nCarefully add 450 µL of epididymal luminal fluid suspension (corresponding to the material collected from the caput of 3 epididymides) atop of a single gradient.",
    "Ultracentrifuge the gradients at 160,000 × g at 4 °C for 18 h.\n\tCAUTION: Since this centrifugation is conducted at very high speed, all ultracentrifuge tubes must be paired and balanced precisely. Check the tubes to ensure that they are free of any visible damage that could compromise their integrity.\nGently remove 12 equal fractions (each consisting of 185 µL) starting from the uppermost layer and progressing toward the bottom of the gradient. Pool the equivalent fractions recovered from each gradient if applicable (up to two gradients).\n\tNote: Mouse epididymosomes are most highly enriched in fractions 9 - 1122, see Figure 4 and Discussion.\nAfter the recovery and pooling of fractions 9 – 11, dilute into 2 mL of PBS, and ultracentrifuge the samples at 100,000 × g at 4 °C for 3 h (13 × 56 mm tube) to pellet the epididymosomes.\n\tCAUTION: Since the epididymosome pellet can be difficult to see, ensure that the orientation of the tubes is noted as they are placed into the rotor and mark the tube to indicate the expectant position of the epididymosome pellet. Ensure that each tube contains a sufficient volume (i.e., exceeding 50% of its total capacity) to preclude the risk of tube collapse.\nCarefully aspirate and discard the supernatant without disturbing the epididymosome pellet.\nAssess the epididymosome purity (Figure 4).\nResuspend the epididymosome pellet into desired medium according to the downstream application(s). For instance, BWW medium is generally used for the experiments involving co-incubation with spermatozoa or alternatively an appropriate lysis buffer in preparation for the resolution of the epididymal proteome via SDS-PAGE.\n3. Immunofluorescence Staining of mECap18 Cells\nPreparation of sterile coverslips (to be conducted in a cell culture hood)",
    "Soak the coverslips (12 × 12 mm) in 70% ethanol for 10 min and disinfect by drying under high temperature above an ethanol lamp.\nCool the coverslip for 10 s before transferring to a 12 well plate.\nApply sterile poly-L-lysine solution to cover the coverslip and settle for 10 min at room temperature.\nDiscard the poly-L-lysine solution and rinse the coverslip with sterile H2O or appropriate medium.\nPreparation mECap18 cells\n\t\nPassage the aliquots of 2 × 105 mECap18 cells in each well of the 12 well plate containing the coverslips.\nCulture the cells with mECap18 cell medium (DMEM supplemented with 1% L-glutamine, 1% sodium pyruvate, 1% penicillin/streptomycin, and 50 μmol/L 5α-androstan-17β-ol-3-oneC-IIIN) containing 10% fetal calf serum (FBS) in a 37 °C incubator under an atmosphere 5% CO2 overnight.\nOnce the cells adhere to the coverslip, discard the medium and rinse the cells twice with PBS.\nAdd a sufficient amount of 4% paraformaldehyde (PFA) diluted in PBS to immerse the entire coverslip and fix the cells at room temperature for 15 min.\nDiscard the PFA solution and rinse the coverslips twice in PBS.\nImmunofluorescence staining\n\t\nPermeabilize mECap18 cells by immersion in 0.1% Triton X-100 in PBS for 10 min.\nRinse the coverslips with PBS.\nBlock mECap18 cells with 3% BSA and proceed with immunolabeling of cells utilizing equivalent protocols to those described for epididymal tissue sections.\n4. Isolation of Proteins from Conditioned Cell Culture Medium\nCollection of conditioned cell culture medium\n\t\nPassage aliquots of 4 × 105 mECap18 cells in each well of 6 well plate with mECap18 cell medium supplemented with 10% FBS for 24 h.\nWash mECap18 cells three times with mECap18 cell medium (prepared without FBS) to remove residual FBS and any associated protein contaminants.",
    "Add 1.5 mL of mECap18 cell medium (prepared without FBS) to each well and incubate with mECap18 cells for 12 h in a 37°C incubator under 5% CO2.\n\t\tNote: mECap18 cells at this step can be assessed for different target antigens according to experimental design.\nAfter 12 h incubation, collect the cell medium and centrifuge at 2,000 × g for 10 min to remove all cellular debris.\n\t\tNote: The duration of incubation is able to be altered in accordance with experimental design/endpoint assessment and in consideration of the cell’s tolerance to applied treatment(s). It is recommended to tailor the timing of incubation based on specific experimental regimens to ensure that optimal results are achieved.\nAssess mECap18 cell viability via the application of a standard trypan blue exclusion assay28. Discard all material in which cell viability has declined below 90% to eliminate bias introduced by proteins released from dead or moribund cells.\nIsolate proteins from cell medium as follows or preserve medium at -80 °C.\nProtein isolation (to be conducted in a fume hood)\n\t\nAdd 20% volume of chilled 100% trichloroacetic acid to 80% volume of conditioned cell medium to precipitate the proteins released from the cultured mECap18 cells. Incubate at 4 °C overnight with constant mixing.\nAfter the incubation, pellet precipitated protein by centrifugation (17, 000 × g, 4 °C for 10 min).\n\t\tNote: Due to the limited quantity of protein expected to be secreted into the medium, it is possible that the pellet will not be easily visualized after centrifugation. It is therefore imperative to correctly orientate the tube prior to the centrifugation and take care not to disturb the expectant pellet location during removal of the supernatant.",
    "Discard the supernatant and wash the pellet twice with chilled acetone prior to the re-centrifugation (17, 000 × g, 4 °C for 10 min).\nCarefully remove and discard the supernatant before air-drying any residual acetone within a fume hood.\nResuspend the protein pellet in an appropriate extraction buffer in preparation for endpoint analysis to detect complete secretory protein profiles and/or individual target proteins (e.g., SDS-PAGE, immunoblotting).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}