{
  "id": 17455,
  "origin_website": "Jove",
  "title": "Analysis of SEC-SAXS data via EFA deconvolution and Scatter",
  "procedures": [
    "1. Protein expression, purification and SEC-SAXS measurement is based on the published protocol13\nFollow the inline SEC-SAXS data collection protocol (Brennich et al.6) in brief.\n\t\nEquilibrate the SEC-column with at least 2 column volumes of SEC running buffer (20 mM Tris-HCl, pH 7.5, 100 mM NaCl).\nPrepare 50 µL of sample of E9 exominus at 8‒10 mg/mL with 20% molar excess of a partial dsDNA (TCAGGAAGATAACAGCGGTTTAGCC and GGCTAAACCGCTGTTATCTT). E9 exominus binds with an KD of 12 ± 6 nM (see Supplementary Data).\nInject 50 μL of this mix onto a SEC-column (S200 Increase) inline with the flow cell for SAXS measurements at 0.3 mL/min.\nCollect 1000 frames at 1 s exposure each.\n\t\tNOTE: On BioSAXS beamline BM29, at the European Synchrotron Facility (ESRF) the individual frames are processed automatically and independently within the EDNA framework14. After the data collection, open the ISPyB database20 and under the Data acquisition tab press the Go button to access the data set and the results of the automatic analysis21.\nDownload the data.\n2. Primary data analysis\nOpen the Java-based program Scatter IV (see the Table of Materials) and perform a background subtraction for size exclusion chromatography (SEC) data.\n\t\nOpen the SEC tab. Drag and drop the reduced data files (*.dat) into the “Drop Data below” window. Set output directory “Out Dir ::” by clicking the blue-labeled Output Dir button.\n\t\tNOTE: If your data was collected in nm-1, a conversion box will need to be checked (bottom left of panel) when dropping files into the window or the subtraction tab.",
    "Edit the experimental details, use the Edit Details button and fill out as many fields as possible, these include sections on which source/beamline was used to collect data, the collection parameters and sample details. These will be saved with the data and allow to more easily populate the “Data collection parameters” section in future publications.\nEnter the sample name in the Save as box. Click on TRACE.\n\t\tNOTE: This has two effects. Firstly, it will create a *.sec file for the data. This is a single text file that will collate all the experimental observations from the separate *.dat files. In addition, the *.sec file contains the averaged set of frames that is the buffer-background, all the frames used in the averaging as well as the buffer-background subtracted frames across the entire SEC-SAXS experiment. Secondly, a signal plot is created which plots the frame number versus Integral ratio to the background. This shows the selected frames (gray) that were averaged for the buffer subtraction. The points for the average buffer are determined from the whole range of the data. However, it is advisable to manually choose the buffer frames for averaging as a poorly defined background may occur due to poorly equilibrated or dirty columns or capillary fouling22.\nSelect buffer frames manually. Click Clear Buffers then reselect a buffer region with a left click-drag, on the trace curve. Ideally, this should be a flat region before the void volume of the SEC column of approximately 100 frames. Click SET BUFFER and then Update to recalculate the *.sec file which may take a few minutes.\nIdentify a region of interest (ROI). On the signal plot, select the region of the peak of interest, with a left click-drag.",
    "NOTE: This populates three plots in the right-hand panel. The top two plots are linked with crosshairs moving between them, a second signal plot (top right) shows only the ROI selected, with the intensity of each frame in blue and the corresponding Rg of each frame in red and a corresponding heat map below, showing the residuals for each frame colored according to the Durbin-Watson auto-correlation analysis. Regions of high similarity are colored cyan (Durbin-Watson, d = 2) while dissimilar frames will follow darker blues to pinks and finally to reds depending on the severity of the dissimilarity (d > 2). The bottom plot is a subtracted I versus q curve for the central selected frame (also denoted by a vertical line). The arrow keys can be used to navigate through the subtracted frames. The I versus q plot will demonstrate the quality of the subtracted frames from the SEC experiment.\nSelect frames to merge. Click on the crosshairs in the heat map plot to select the subset of frames that will be used for merging. The crosshairs will identify a triangular area of predominately cyan that falls to the bottom right-hand side of the crosshairs. Use a mouse-click to set these frames as selected and highlight the frames in the corresponding area of the Signal plot above. These frames should ideally highlight a region with a stable Rg.\n\t\tNOTE: As needed, zoom in on the heat map with a left-click drag and zoom out with a left-click swipe to the right.\nWhen satisfied with the selected frames click MERGE. This will merge the subtracted frames and present them in the ANALYSIS tab.\n3. Data deconvolution\nOpen the deconvolution program (e.g., BioXTAS Raw 2.0.0).",
    "In the deconvolution program, load the dataset, under Files tab, in the Control Panel, use foldether symbol to locate the data or copy and paste the location into the address bar.\n\tNOTE: Make sure the folder contains only the raw *.dat files and no processed or average data files.\nHighlight all the *.dat files, hit the Plot Series button, a plot of integrated intensity versus frame number will be drawn in the “Series Plot”.\nIn the Control Panel select the Series tab and then click to highlight the curve. Open up the LC Analysis pop-up window using the button at the base of the control panel. This window gives access to several options, such as selecting varying molecule types (protein or RNA). It also allows the user to select the buffer region for the plot. In the first instance click Auto; this should select a suitable buffer region.\n\tNOTE: If this fails, possibly due to an unstable baseline, then “Add region” to optimize the buffer region. This populates the Buffer box with a smaller box in which one can manually add the frame numbers to use for the buffer. Alternatively, click “Pick” to give the option of selecting an area on the plot. Locate the area, left-click once for the start position, move the cursor to next position and left-click again. It may be necessary to add more than one buffer location. Click Set buffer and the curves will be subtracted and the Rg calculated across the SEC peak. If a pop-up box appears, click OK.\nTo start the Evolving Factor Analysis (EFA), right-click on the highlighted file at the bottom of the Control Panel and then select EFA from the menu.",
    "Check that a pop-up window opens which shows the single value decomposition (SVD) of the data set. In the controls box, check the Use Frames box so that the whole peak area to deconvolute is covered in the intensity plot. The “Singular Values” plot, top right, shows the intensity of the singular values (separate peaks/species) above the baseline.\n\t\tNOTE: The number of points present above the baseline represents the number of scattering species present. With the caveat that it is the relative magnitude of the singular value to the flat area/baseline that matters.\nTo help validate the number of single values, use the bottom AutoCorrelation plot. This shows the right and left single correlation vectors. Click Next.\n\t\tNOTE: These essentially represent scattering or concentration profiles for the vector in the solution. Where the absolute size represents the significance of the vector. A significant component will have an autocorrelation near 1 (a rule of thumb cutoff is >0.6‒0.7). RAW helpfully calculates this and is shown in the #Significant SVs box, bottom left, though you can change this if necessary. If there are several single values (e.g. 4+), it may be necessary to look at just 2 or 3 of the components only, altering the range of the data used. The lower the number of components the easier the EFA analysis will be but at the cost of using less data. In complex situation, where the left and right singular vectors, which should be similar, do not match reduce the significant SV number and decrease the number of frames used until the left and right singular vectors are similar.",
    "Check that the EFA is calculated by generating plots in the forward and backward directions for each vector. These plots show when components start (forward plot) and exit (backwards plot) the solution profile for the selected SEC-SAXS data. RAW tries to identify these ranges; change these using the arrows next to the counters so that each circle is at the start of an inflection point rising from or falling to baseline. Click Next.\n\t\tNOTE: The last stage of the EFA turns the SVD vectors back into scattering curves. On the left of the window, the previously defined ranges are plotted at the top. These ranges are the constraints to define where to rotate the singular vectors back into scattering curves. The right hand panel shows these corresponding scattering curve profiles, for each separated peak. A plot for the concentration of each peak, that should be representative of elution profiles and a plot for the mean error weighted chi2. The chi2 plot is measuring the deconvolution data set to the original data set. Ideally, this will be flat, however spikes can often be seen.\nTry to reduce or eliminate spikes by altering the Component Range Controls, first identify approximately which frame corresponds to the spike (from chi2 plot) and then, in the Range Controls, which component contains this frame (it could be more than one), using the arrows, move up or down the corresponding range.\n\t\tNOTE: This should produce a response, increasing or decreasing the spike. If the spike frame was present in more than one component then a little trial and error between each component may be necessary.",
    "When a minimum chi2 has been achieved, perform a validation check by clicking back, the previous window appears to allow verifying if the changes made have drastically changed the original EFA plots. If they still look valid, click Next. Click Save EFA Data to save the plots and then click Done; to close the EFA window.\n\t\tNOTE: A second validation is to click off the check-box next to each component range, in turn. These provide a positive concentration constraint to each component and turning off will check if these significantly affect the data set. If no change is seen in the concentration plot then the data are valid.\nBack in the RAW window, click the Profiles tab in the Control Panel to view the curves and in the Manipulation tab of the Control Panel, manipulate the curves further or save the curves as *.dat files by right-clicking on the file and selecting save selected file(s) from the menu pop up. Save the file. Use Scatter IV for further analysis.\n\tNOTE: Further information and instructions on deconvolution and EFA BioXTAS RAW is found at https://bioxtas-raw.readthedocs.io/en/latest/\n4. Determine SAXS properties\nNOTE: An in-depth tutorial for SAXS determination is found at Bioisis.net. Here we show a basic step by step approach, highlighting the most useful buttons in Scatter.\nIn the Scatter ANALYSIS tab, press the G button for the manual Guinier analysis tool, to the right of each sample file. The plot that opens shows the ln[I(q)] versus q2 in the top box and the corresponding residuals in the bottom box. Add or remove points such that the residuals do not have a “smile” or “frown” feature. The selected data in the Guinier fit should not exceed the maximum q x Rg limit of 1.3.",
    "Press the Normalized Kratky button; the plot that pops up provides a semi-quantitative assessment of macromolecule’s structural state, normalized for mass and concentration.\n\tNOTE: The crosshairs designate the Guinier-Kratky point at (√3, 1.1)19. A compact, spherical protein will show a single peak with the maximum value at the Guinier-Kratky point. An intrinsically disordered or cylindrical biopolymer would have a maximum greater than the crosshairs and would not decrease. A protein that had both folded domains and long elongated unstructured regions might present with an increased maximum through the crosshairs but would also show an obvious decreasing trend at higher q x Rg.\nClick on the Vc button (Volume-of-correlation), which brings up two plots, the total scattered intensity and an integrated area of the total scattered intensity as a function of q. The plots are used as a quick reference to validate the quality of the scattering curve.\n\tNOTE: The total scattered intensity is sensitive to the I(0) and if this has not been measured correctly then the plot will not show a continuous line. The integrated area plot, ideally, should show a sigmoidal line with an extended plateau for each SAXS curve. If there are buffer mismatch/subtraction, aggregation or interparticle interference in the sample a sharp slope will be observed at higher q-values.\nPress the Flexibility button to start the flexibility analysis. This will open a window with four panels and a slider at the bottom. Each opened panel shows a plot exploiting a power-law relationship that exists between compact and elongated/flexible biopolymers23. To use, move the slider at the bottom of the box from right to left with the left mouse button pressed. Keep moving slowly to the left until a plateau in one of the plots is reached.",
    "NOTE: If the plateau is seen in the Porod-Debye plot, then the sample is compact in nature, which should be consistent with a single peak at the Guinier-Kratky point in a normalized Kratky plot. If the plateau is reached first in the Kratky-Debye plot then the sample is most likely elongated or flexible. If the SIBYLS plot is first to plateau, then the sample most likely contains areas of both compactness and flexibility, a particle with mixed states. The theory for this flexibility relationship with the Porod-Debye Law is exquisitely addressed in Rambo, et al.23\nClick on Volume. Volume determination should be performed immediately after the flexibility analysis from above. When opened after the flexibility analysis, a pop up with three more graphs is generated. In the bottom, left corner the Porod-Debye plot remembers where one left the slider from the flexibility plot, showing the plateaued area.\n\t\nTo calculate the volume of the particle, move the start and endpoints using the arrow buttons or type in the boxes, so that the blue line on the plot fits the plateaued region. For an unbiased result, the residuals in the top right Porod-Debye exponent power-law fit, should show no pattern.\nPress the P(r) tab. The real-space distribution is in the left panel and the scattering curve for the sample in the right-hand panel. The objective is to create a real-space representation of the sample from the reciprocal space SAXS curve. Ideally, the distribution curve will be smooth with no waves present and should just gently kiss the x-axis.",
    "NOTE: The instrument’s measured q-range may not be entirely useable due to poor buffer matching, aggregation, radiation damage, sub-optimal exposure times and low particle concentrations. The P(r)-determination step will fundamentally determine the useable qmin and qmax range of the SAXS dataset and it should be this range of data that is used for any subsequent modeling or fitting.\n\t\nRight-click on the sample name then click Find DMAX to open a new window. Limits for the dmax are pre-set with the suggested qmax (maximal data points used), lower and upper dmax limits and a lower and upper alpha score. Three models can be chosen (L1-norm, Legendre and Moore) and the use of background included. Leave these unchanged in the first instance.\nPress the Start button. A composite distribution is created in the left panel with the suggested dmax and alpha level written underneath. If this looks acceptable then close the window and return to the P(r) tab. The reciprocal space plot will have been cropped to match the suggested qmax.\nChoose the model Moore, click on Background and then set the alpha level and dmax to the suggested values from the pop-up box. Press the refine button. A cross-validation plot will pop up showing if any points had to be rejected, marked in red. If there are only a few points rejected and the distribution looks good then the model is good.",
    "NOTE: The cross-validation plot will highlight regions of the data that are inconsistent with the determined P(r)-distribution. If the rejected region is mainly in the low-q region, that is the region near the y-axis, this likely suggests a dmax that is too short, presence of aggregation or higher order oligomers. It highlights an inconsistency between the higher and lower resolution information. Here, dmax and qmin (increasing start value) should be adjusted using a manual, trial-and-error approach. Similarly, if the rejected region is mainly in the high-q region, this may indicate an issue with the background subtraction or that the signal is too weak to be meaningfully explained by the determined P(r)-distribution. In this case, qmax should be truncated (decreasing end) until no additional data are rejected. Ideally, rejected points should be randomly distributed and make up less than 5% of the useable data. A properly defined qmin, qmax and “dmax” will produce a smooth distribution where the dmax kisses the x-axis. However, do not increase this value so much that it completely removes the Guinier region. This point is easily found by checking the q x l(q) box (on the left of the panel above the table). The scattering curve is replaced by the “Total Scattered Intensity plot”, on this curve all points before the max inflection are part of the Guinier region. After removing points try again to increase/decrease the “dmax” and then refine once more. If problems persist, especially when many points are being rejected from the start of the validation curve, this strongly suggests the data are not ideal for structural modeling.",
    "To print a report, navigate back to the Analysis tab, left-click to highlight the sample then right-click on the sample name and move to Create report from single data set in the menu. A text box opens to allow for comments to be added. A PDF document is produced showing all the figures and values generated."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}