{
  "id": 19711,
  "origin_website": "Wiley",
  "title": "Exploring FlyBase Data Using QuickSearch",
  "procedures": [
    "This tab (Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0001]) performs a comprehensive case-insensitive search of all FlyBase data classes and ontologies. It provides a “Google-like” functionality in that no prior knowledge of the content or organization of FlyBase data is required. The search box accepts any text, and all possible matches are retrieved and reported rapidly. The “Search FlyBase” tab is often the best place to start a search of data within FlyBase.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Search FlyBase tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Choose whether to restrict the search to “ID/Symbol/Name” (the default) or to search for matches in the text of all report fields by selecting “Everything” in the drop-down menu.\nThe “ID/Symbol/Name” option includes synonyms. Searching “Everything” may result in many more hits returned, but this option is useful if searching for a text string within a particular data class that is not an ID/symbol/name.\n3. Enter one or more search terms.\nThe search term box of the Search FlyBase tab supports several additional features that can be used to narrow or broaden the query. A wildcard character (*) can be appended, prepended, or included within a search term to broaden the query. When specifying multiple terms, a Boolean “AND” is used for searches by default and does not require any special notation. A Boolean “OR” can be added to find records that have one or another of a list of specified terms. Results can be specified to contain an exact phrase by surrounding the search term with double quotes.\n4. Click the “Search” button or press “enter.”\n5. View the hit list of results matching the search criteria.",
    "Results are listed in descending order of their relevance score.\n6. Click on an individual entry to view its report page or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nFlyBase report pages display all data associated with that entity, organized into separate sections. Reports contain many links to other related reports within and external to FlyBase to aid further navigation and exploration.",
    "If a query is well defined, it is useful to perform a more targeted search than that offered by the Search FlyBase tab to reduce/prevent false positive results. This can be achieved using the “Data Class” tab (Fig. 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0002]) where queries can be restricted to a single class of data (Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-tbl-0001]) or ontology (Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-tbl-0002]). This functionality is particularly useful for querying specific data classes/ontologies that do not have a dedicated QuickSearch tab.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/fcab3311-38f5-4b6f-9b62-a75647b8cbda/cpz1731-fig-0002-m.jpg</p>\nFigure 2\nThe “Data Class” tab of QuickSearch, with “ID/Symbol/Name” selected as the search mode, “stock” selected from the Data Class menu, and “dpp*” entered as the search term.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Data Class tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Select the desired data class or ontology from the drop-down menu.\nData class options are shown in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-tbl-0001] and ontology options are shown in Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-tbl-0002]. Alternatively, the “All data types” option may be selected, though doing so simply reproduces the functionality of the “Search FlyBase” tab.\n3. Choose whether to restrict the search to “ID/Symbol/Name” (the default) or to search for matches in the text of all report fields by clicking the “Everything” button.\nThe “ID/Symbol/Name” option includes synonyms. Searching “Everything” may result in many more hits returned, but this option is useful if searching for a text string within a particular data class that is not an ID/symbol/name.\n4. Enter one or more search terms appropriate to the selected class/ontology.",
    "The search term box of the Search FlyBase tab supports several additional features that can be used to narrow or broaden the query. A wildcard character (*) can be appended, prepended, or included within a search term to broaden the query. When specifying multiple terms, a Boolean “AND” is used for searches by default and does not require any special notation. A Boolean “OR” can be added to find records that have one or another of a list of specified terms. Results can be specified to contain an exact phrase by surrounding the search term with double quotes.\nValid entries are ID/Symbol/Name (or their synonyms), if that option has been selected; valid entry symbols will start to appear when typing and can be clicked to populate the field. The search is case-insensitive and a wildcard (*) can be added to match partial terms.\n5. Click the “Search” button or press “enter.”\n6. View the hit list of results matching the search criteria.\nResults are listed in descending order of their relevance score.\n7. Click on an individual entry to view its report page or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nFlyBase report pages display all data associated with that entity, organized into separate sections. Reports contain many links to other related reports within and external to FlyBase to aid further navigation and exploration.",
    "FlyBase maintains a large and varied bibliography of Drosophila-specific publications (Marygold et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0010]). It currently comprises >237,000 references, covering ∼40 distinct publication types, with dates of publication extending from the 17th century to the present day. Approximately half of these references are primary research papers, identified through regular searches of the NCBI PubMed database. Other publication types include reviews, commentaries, and errata (also identified in PubMed), as well as otherwise unpublished “personal communications” from the Drosophila community and internal “FlyBase analyses.” The entire FlyBase bibliography is searchable using the “References” tab (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3e4f30cb-04f7-4f63-83bb-1ccc4ab399a1/cpz1731-fig-0003-m.jpg</p>\nFigure 3\nThe “References” tab of QuickSearch, with several criteria entered as search terms.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the References tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Add search terms using the default “Any field” option or click the appropriate box to use additional, more specific search fields.\nAdditional search fields are “Author,” “Year,” “Title/Abstract,” “Journal,” “Publication type,” and “ID” [i.e., PubMed ID, PubMed Central ID, Digital Object Identifier (DOI), and FlyBase reference ID (FBrf)]. Alternatively, click on the link to “search fly preprints at Europe PMC,” as preprints are not currently indexed or curated at FlyBase.\n3. Enter one or more terms that are appropriate to the selected field.",
    "Valid entry terms will start to appear in the “Author,” “Journal,” and “Publication type” fields when typing and can be clicked to populate the field. Searches are case-insensitive and a wildcard (*) can be added to match partial terms. Boolean operators (AND, OR, BUT, and NOT) can be used within any field to search using specific combinations or exclusions. The “Year(s)” field also accepts ranges and greater/less than notations (e.g., “2004-2008” or “>2001”).\n4. Click the “Search” button or press “enter.”\n5. View the hit list of matching references.\nResults are listed in descending order of their relevance score.\n6. Click on an individual reference to view its Reference Report or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nReference Reports display the full citation data of the reference, together with links to the journal article at the publisher's site, the PubMed record, and (where available) the full text at PubMed Central and Europe PubMed Central. In addition, Reference Reports include a summary of the data associated with the publication in FlyBase, and each associated entity is linked to its own dedicated report.",
    "The Gene Groups resource in FlyBase comprises manually compiled sets of D. melanogaster genes that share a set of characteristics (Attrill et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0002]). Examples include evolutionarily related gene families (e.g., actins and odorant receptors), subunits of macromolecular complexes (e.g., spliceosomes and ribosomes), and gene products with a common molecular function (e.g., deubiquitinases and GTPase activating proteins). These collections are useful starting points for further analyses and explorations of associated data, both within FlyBase and in other species databases. All groups are searchable and browsable via the “Gene Groups” tab (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/0c90cb53-beae-43d2-a272-9319094c6053/cpz1731-fig-0004-m.jpg</p>\nFigure 4\nThe “Gene Groups” tab of QuickSearch, with the text “Sirtuin” entered as the search term. Note the link to “browse all Gene Group reports.”\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Gene Groups tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Enter a name, a symbol, or any other identifier corresponding to a group or a gene member.\nValid entries are symbols or full names (or their synonyms), FlyBase identifiers for the Gene Groups, or any member genes. Valid names of Gene Groups will start to appear when typing and can be clicked to populate the field. The search is case-insensitive and a wildcard (*) can be added to match partial terms.\nAlternatively, click on the “browse” link to see a page indexing all Gene Group Reports.\n3. Click the “Search” button or press “enter.”\n4. View the hit list of matching gene groups.\nResults are listed in descending order of their relevance score.\n5. Click on an individual group to view its Gene Group Report or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).",
    "Gene Group Reports include a brief description of the group, a summary of the references used to compile the group, the key GO terms that typify the members, and links to related Gene Groups within FlyBase and at external sites [e.g., human gene families at the HUGO Gene Nomenclature Committee (HGNC) website] (Seal et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0015]). The “Members” table lists all members of the group with links to the corresponding Gene Report pages, together with convenient buttons to export members to other tools, such as a hit list or Batch Download, to facilitate further analyses.",
    "The Pathways resource in FlyBase is a sub-category of the Gene Group resource and comprises sets of D. melanogaster genes whose products have been experimentally shown to act within or regulate a signaling pathway (Larkin et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0009]). All Pathway Reports are compiled manually by FlyBase curators based on the research literature, using standards for inclusion agreed by the GO consortium (The Gene Ontology Consortium, 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0017]). They are searchable and browsable via the “Pathways” tab (Fig. 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/1615926b-fda7-4ce9-b98f-32f4ce275fb2/cpz1731-fig-0005-m.jpg</p>\nFigure 5\nThe “Pathways” tab of QuickSearch, with the text “BMP” entered as the search term. Note the link to “browse all Pathway reports.”\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Pathways tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Enter a name, a symbol, or any other identifier corresponding to a pathway or a pathway member.\nValid entries are symbols or full names (or their synonyms), FlyBase identifiers for the Pathways, or any member genes. Valid names of curated Pathways will start to appear when typing and can be clicked to populate the field. The search is case-insensitive and a wildcard (*) can be added to match partial terms.\nAlternatively, click on the “browse” link to see a page indexing all Pathway Reports.\n3. Click the “Search” button or press “enter.”\n4. View the hit list of matching pathways.\nResults are listed in descending order of their relevance score.\n5. Click on an individual pathway to view its Pathway Report or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).",
    "Pathway Reports include a brief description and thumbnail image of the pathway, selected references for background information, corresponding GO Biological Process term, physical interaction network of pathway members, and links to related Gene Groups within FlyBase and at external sites. The interactive “Members” table lists all members of the pathway alongside other relevant information, together with convenient buttons to export members to other tools, such as a hit list or Batch Download, to facilitate further analyses.",
    "The GO is used in FlyBase and many other biological databases to describe the attributes of gene products in terms of their molecular functions, associated biological processes, and cellular components (The Gene Ontology Consortium, 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0017]; Tweedie et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0020]). The GO tab (Fig. 6[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0006]) can be used to find terms of interest within the GO and then identify Drosophila genes (or gene groups) annotated with those terms.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4a441907-179a-4ca0-9126-eb486fc7b29a/cpz1731-fig-0006-m.jpg</p>\nFigure 6\nThe “GO” tab of QuickSearch, with the “Data field” set to search “all GO terms” and the text “axonogenesis” entered as the search term.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the GO tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Choose to search “all GO terms” (which is the default) or to restrict the search to the individual “molecular function,” “biological process,” or “cellular component” ontologies by using the “Data field” drop-down menu.\n3. Enter the search text or identifier.\nValid entries are GO terms/synonyms or GO identifiers. Valid GO terms that match the entered text, confined to the ontology aspect selected in step 2, will start to appear when typing and can be clicked to populate the field. The search is case-insensitive and a wildcard (*) can be added to match partial terms.\n4. Click the “Search” button or press “enter.”\n5. View the hit list of matching GO terms.\n6. Click on the desired GO term to view its Term Report page.",
    "These reports include a definition, synonyms, and a view of the tree displaying the hierarchical relationships between any parent and child terms. Within the tree view, the total number of records annotated with each GO term (including its children) is indicated in green text. Link-outs to the corresponding term page at the QuickGO (Binns et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0003]) and AmiGO (Carbon et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0004]) websites are also provided.\n7. If present, click the “Genes” (or “Gene Groups”) button within the “Annotations” section to view a hit list of genes (or gene groups) annotated with the given term or any of its child terms.\n8. Click on an individual gene (or gene group) to view its report page and associated GO annotations or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nGene Reports list individual GO annotations within the “Function” section, accompanied by a “ribbon” summarizing the major annotation categories for each of the Molecular Function, Biological Process, and Cellular Component aspects. Gene Group reports list the key GO terms applicable to the group within the “Description” section. A GO ribbon stack summarizing annotations for all member genes is shown in the “Members” section.",
    "This tab (Fig. 7[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0007]) is used to generate lists of D. melanogaster genes whose protein products have a specified domain or functional site, as determined by InterPro (Paysan-Lafosse et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0013]). InterPro integrates protein signatures from several individual sources (including Pfam and SMART) and then associates InterPro entries with protein products in the UniProtKB collection (The UniProt Consortium, 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0018]). UniProtKB IDs are linked to gene records in FlyBase, thereby providing the connection between InterPro protein features and D. melanogaster genes.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/cf600eea-8077-4a43-91c8-3572114dece0/cpz1731-fig-0007-m.jpg</p>\nFigure 7\nThe “Protein Domains” tab of QuickSearch, with the text “SH3 domain” entered as the search term.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Protein Domains tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Enter a search term or an identifier.\nValid entries are InterPro terms or identifiers for protein domains, families, homologous superfamilies, repeats, or sites. Valid entry terms/IDs will start to appear when typing and can be clicked to populate the field. The search is case-insensitive and a wildcard (*) can be added to match partial terms.\n3. Click the “Search” button or press “enter.”\n4. View the hit list of genes whose product(s) are associated with the specified search term.\nResults are listed in descending order of their relevance score.\n5. Click on an individual gene to view its Gene Report or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nProtein domain information from InterPro is displayed within the “Function” and “Gene Models and Products” sections of a Gene Report. Click on an InterPro term to navigate to its report on the InterPro site, which contains additional information.",
    "Click on the JBrowse link in the Gene Report and choose to display the Pfam and/or SMART “Protein Domains” track(s) to view how these domains align with the intron/exon structure of the gene.",
    "This tab (Fig. 8[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0008]) is used to search for D. melanogaster genes with a specified spatial and/or temporal expression pattern, as curated from low-throughput studies of the transcript or polypeptide described in the literature. Expression data may be searched by developmental stage, anatomy/cell type, or subcellular location, or any combination of these. The lower panel of the Expression tab allows access to different options for querying or browsing high-throughput RNA-Seq expression data.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f5af2b5e-ffa9-46e7-a511-8d9bebc69b21/cpz1731-fig-0008-m.jpg</p>\nFigure 8\nThe “Expression” tab of QuickSearch, with several criteria entered as search terms.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Expression tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Enter a term into the “Developmental Stage,” “Anatomy/Cell Type,” or “Cellular Component” field.\nValid entries are terms or identifiers from the fly developmental stage, fly anatomy, or GO cellular component ontologies, respectively. Valid terms that match the entered text will start to appear when typing and can be clicked to populate the field. Note that the autocomplete function only lists terms for which annotations exist. The search is case-sensitive; wildcards (*) are not accepted.\nNote that searches will return hits matching the selected ontology term or any of its child terms. For example, searching with “imaginal disc” will return genes annotated with that exact term as well as terms with an is_a relationship (e.g., wing disc and eye disc) or a part_of relationship (e.g., imaginal disc posterior compartment and wing pouch) to “imaginal disc.”\nAlternatively, click the “Learn more about our RNA-Seq tools” link in the lower section to access different options for querying or browsing high-throughput RNA-Seq expression data.",
    "3. If desired, click the “refine search by adding qualifier terms” text and enter a field-appropriate “qualifier” term in the box that appears below the main search box.\nFor example, the developmental stage can be qualified by specifying gender, whereas the anatomy and subcellular fields can be qualified by a term adding detail about spatial distribution (e.g., “dorsal”) or signal intensity (e.g., “faint”). Valid qualifier terms that match the entered text will start to appear when typing and can be clicked to populate the field; only those qualifiers associated with the term(s) chosen in step 2 will appear. The search is case-sensitive; wildcards (*) are not accepted.\n4. If desired, repeat steps 1 and 2 for the other search field(s).\nThe autocomplete function is coordinated between the terms entered in the primary search boxes; only terms that have been co-annotated with those already filled will be offered.\nIt is not necessary to fill all three primary search boxes, but multiple fields may be completed in any combination to add additional constraints to a query.\n5. Click the “Search” button or press “enter.”\n6. View the hit list of genes that exhibit a transcript or protein expression pattern matching the search criteria.\nResults are listed in descending order of their relevance score.\n7. Click on an individual gene to view its Gene Report or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nDetailed expression information associated with the transcript or polypeptide, or that deduced from a reporter is included within the “Expression Data” section of the Gene Report. This section also displays expression data derived from high-throughput studies and “ribbons” summarizing gene expression in different cell types, anatomical parts, and developmental stages.",
    "This tab (Fig. 9[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0009]) allows searching for GAL4 drivers, other binary system drivers (e.g., lexA and QF), and non-binary reporters (e.g., lacZ or GFP) by temporal–spatial expression patterns, as curated from the literature (Thurmond et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0019]). Expression data may be searched by developmental stage, anatomy/cell type, or subcellular location, or any combination of these. Alternatively, the lower panel of the “GAL4 etc” tab can be used to search for drivers/reporters that reflect the expression pattern of a specific gene (Larkin et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0009]). This tab also provides access to an interactive table of “Frequently Used GAL4 Drivers” by clicking on the relevant text at the bottom of the tab. This table includes the most ordered GAL4 stocks from the Bloomington Drosophila Stock Center and drivers that have been curated to more than 20 publications (Larkin et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0009]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/38ed6d07-6851-4999-9a11-7568ae848795/cpz1731-fig-0009-m.jpg</p>\nFigure 9\n(A) The “GAL4 etc” tab of QuickSearch, with several criteria entered as search terms in the “by curated expression pattern” panel. (B) The integrated table of drivers and reporters resulting from that search.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the GAL4 etc tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]). Choose whether to search for drivers/reporters by their curated expression pattern (upper panel) or by the gene whose expression they reflect (lower panel).\nThese two search options cannot be combined, and only one may be chosen.\nSearch by curated expression pattern\n2. If necessary, click on the “by curated expression pattern” text to expand this section (Fig. 9A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0009]).\n3. Enter a term into the “Developmental Stage,” “Anatomy/Cell Type,” or “Cellular Component” field.",
    "Valid entries are terms or identifiers from the fly developmental stage, fly anatomy, or the GO cellular component ontologies, respectively. Valid terms that match the entered text will start to appear when typing and can be clicked to populate the field. Note that the autocomplete function only lists terms for which annotations exist. The search is case-sensitive; wildcards (*) are not accepted.\nNote that searches will return hits matching the selected ontology term or any of its child terms. For example, searching with “imaginal disc” will return drivers/reporters annotated with that exact term as well as terms with an is_a relationship (e.g., wing disc and eye disc) or a part_of relationship (e.g., imaginal disc posterior compartment, wing pouch) to “imaginal disc.”\n4. If desired, click the “refine search by adding qualifier terms” text and enter a field-appropriate “qualifier” term in the box that appears below the main search box.\nFor example, the developmental stage can be qualified by specifying gender, whereas the anatomy and subcellular fields can be qualified by a term adding detail about spatial distribution (e.g., “dorsal”) or signal intensity (e.g., “faint”). Valid qualifier terms that match the entered text will start to appear when typing and can be clicked to populate the field; only those qualifiers associated with the term chosen in step 3 will appear. The search is case-sensitive; wildcards (*) are not accepted.\n5. If desired, repeat steps 1 and 2 for the other search field(s).\nThe autocomplete function is coordinated between the terms entered in the primary search boxes; only terms that have been co-annotated with those already filled will be offered.\nIt is not necessary to fill all three primary search boxes, but multiple fields may be completed in any combination to add additional constraints to a query.",
    "6. Click the “Search” button or press “enter.”\n7. View the integrated table of drivers/reporters that exhibit an expression pattern matching the search criteria (Fig. 9B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0009]).\nThis table shows the connection between alleles, insertions, constructs, and stocks; additionally, the “Expression terms” column lists the anatomy, stage, and/or cellular component term that triggered the search result. The table is customizable; columns can be shown/hidden, moved, filtered, and specified as sort criteria. Results can be narrowed to a specific sort of driver or reporter, such as GAL4 or lacZ, by using the filter in the “Encoded tool”column.\n8. Click on an individual allele, construct, or insertion to view its report page.\nDetailed expression information is included within the “Expression Data” section of the report.\nSearch by gene\n9. Click on the “reflecting expression of a particular gene” text to expand this section.\n10. Enter a gene symbol or ID into the search box.\nValid entries are FlyBase gene symbols or identifiers.\n11. Click the “Search” button or press “enter.”\n12. View the integrated table of drivers/reporters that exhibit an expression pattern matching the search criteria.\nThis table shows the connection between alleles, insertions, constructs, and stocks; additionally, the “Expression terms” column lists the anatomy, stage, and/or cellular component term that triggered the search result. The table is customizable; columns can be shown/hidden, moved, filtered, and specified as sort criteria.\nNote that this search will only return drivers/reporters that have been specifically curated as reflecting the expression pattern of the specified gene; it will neither find drivers/reporters with an expression pattern similar to that of the specified gene nor drivers/reporters that have not yet been curated as reflecting expression of that gene.\n13. Click on an individual allele, construct, or insertion to view its report page.",
    "Detailed expression information is included within the “Expression Data” section of the report.",
    "This tab (Fig. 10[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0010]) can be used to search for alleles (both classical and transgenic) associated with a specific class of phenotype, such as “lethal,” “sterile,” or “abnormal behavior,” or alleles that affect a certain anatomical or subcellular structure (Drysdale, 2001[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0005]). These searches may be conducted in combination to retrieve alleles that match both criteria. There is also the option of restricting each search to a particular developmental stage.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/de63c4b2-df77-4939-9052-b0f1621d7638/cpz1731-fig-0010-m.jpg</p>\nFigure 10\nThe “Phenotype” tab of QuickSearch, with several criteria entered as search terms within the upper “Phenotypic class” section.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Phenotype tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Enter a term in the “Phenotypic class” or the “Tissue/cell affected” fields.\nValid entries are terms or identifiers from the phenotypic class, fly anatomy, or GO cellular component ontologies. Valid terms that match the entered text will start to appear when typing and can be clicked to populate the field. Note that the autocomplete function only lists terms for which annotations exist. The search is case-sensitive; wildcards (*) are not accepted.\n3. If desired, fill in one or both “refinement” boxes.\nThese can be used to specify a stage of development or to specify qualifiers such as “somatic clone,” “dominant,” or “heat sensitive.” Valid qualifier terms that match the entered text will start to appear when typing and can be clicked to populate the field; only those qualifiers associated with the term chosen in step 2 will appear. The search is case-sensitive; wildcards (*) are not accepted.\n4. If desired, repeat steps 1 and 2 for the other search field.",
    "It is not necessary to fill in both the “Phenotypic class” and “Tissue/cell affected,” but doing so will add an additional constraint to a query.\nNote the autocomplete function is not coordinated between the “Phenotypic class” and “Tissue/cell affected” fields.\n5. Click the “Search” button or press “enter.”\n6. View the hit list of alleles associated with phenotype(s) matching the search criteria.\nResults are listed in descending order of their relevance score.\n7. Click on an individual allele to view its Allele Report or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nDetailed phenotypic information is included within the “Phenotypic Data” section of the Allele Report. Ontology terms are listed in the “Phenotypic Class” and “Phenotype Manifest in” subsections, alongside any qualifiers and accessory or transacting alleles. The “Detailed Description” subsection may include a “free text” description of the phenotype with additional qualifications that are not captured adequately by ontology terms alone.",
    "The Human Disease tab (Fig. 11[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0011]) allows access to data relevant to human disease models in D. melanogaster, which may be generated by expressing a human transgene in flies or by manipulating the fly ortholog(s) (Millburn et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0012]). Diseases may be searched using terms from Online Mendelian Inheritance in Man (OMIM; Amberger et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0001]) or the Disease Ontology (DO; Schriml et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0014]); the DO is used in FlyBase to annotate classical and transgenic alleles that generate, ameliorate, or exacerbate a model of human disease. Genes and alleles annotated/associated with DO/OMIM terms can also be searched in this tab. Finally, this tab allows searching and browsing of Human Disease Model Reports, which are manually compiled reports that integrate all relevant data for diseases specifically modeled in Drosophila.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/d053dc38-ed46-43c4-9dd6-43edc7ecee72/cpz1731-fig-0011-m.jpg</p>\nFigure 11\nThe “Human Disease” tab of QuickSearch, with the text “Alexander disease” entered as the search term.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Human Disease tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Enter a term or an identifier corresponding to a disease, a human/fly gene, or an allele.\nValid “disease” entries are disease names, synonyms, or identifiers, including those used in the FlyBase Disease Model Reports, the DO, and OMIM. Valid “human gene” entries are the gene symbols and IDs used by the HGNC (Seal et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0015]) and OMIM (Amberger et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0001]). Valid fly gene and allele entries are FlyBase symbols or identifiers. Valid entry terms will start to appear when typing and can be clicked to populate the field. The search is case-insensitive and a wildcard (*) can be added to match partial terms.",
    "Alternatively, click on the “browse” link at the foot of the tab to see a page indexing all Human Disease Model Reports.\n3. Click the “Search” button or press “enter.”\n4. View the hit list of human disease models, DO terms, genes, and/or alleles matching the search criteria.\n5. Click on an individual entry to view its corresponding report page or choose to perform another action on the hit list (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-prot-0013]).\nHuman Disease Model reports include an overview of the human disease, information on human/fly orthology relationships, human/fly alleles annotated with DO terms, potentially useful stocks, and lists of relevant references and external websites.\nDO term reports include a definition, synonyms, and a view of the tree displaying the hierarchical relationships between any parent and child terms. If applicable, the “Annotations” section includes links that will generate a new hit list of genes, alleles, or human disease models annotated with the given DO term or any of its child terms.\nGene and Allele Reports list individual DO annotations with the “Human Disease Associations” section.",
    "This tab (Fig. 12[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0012]) can be used to quickly search for orthologs of D. melanogaster, human, or other model organism genes, as well as paralogs of D. melanogaster genes, as provided by the DRSC Integrative Ortholog Prediction Tool (DIOPT) (Hu et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0007]). DIOPT integrates predictions from many different algorithms based on sequence homology, phylogenetic trees, and functional similarity.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5bc437ba-4996-4832-818e-900db8083706/cpz1731-fig-0012-m.jpg</p>\nFigure 12\n(A) The “Homologs” tab of QuickSearch, searching for orthologs and paralogs of the Fum1 gene of D. melanogaster. (B) The results table from running that query.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Click on the Homologs tab of QuickSearch (www.flybase.org[href=http://www.flybase.org]).\n2. Select the input species from the “Species” drop-down menu (Fig. 12A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0012]).\nThe current input species are H. sapiens (human), R. norvegicus (Norway rat), M. musculus (laboratory mouse), X. tropicalis (Western clawed frog), D. rerio (zebrafish), D. melanogaster (fruit fly), C. elegans (nematode, roundworm), A. thaliana (thale cress), S. cerevisiae (brewer's yeast, and S. pombe (fission yeast).\n3. Enter one or more gene symbols/identifiers in the adjacent “Gene(s)” box.\nValid entries are gene symbols/IDs approved by the relevant species database or NCBI gene IDs. OMIM and Ensembl gene IDs are also accepted for human genes. Valid symbols will start to appear when typing and can be clicked to populate the field. Searches are case-sensitive; wildcards (*) are not accepted. Multiple entries must be separated by a space character.\n4. Select one or more output species using the checkboxes.\nThe choice of output species is identical to the input species (see step 1). There is also the option of searching for paralogs if the input species is D. melanogaster.",
    "5. Click the “Search” button or press “enter.”\n6. View the results table (Fig. 12B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0012]).\nResults are presented for each individual input gene, sorted by descending “score.” The “score” is expressed as the number of algorithms supporting a given ortholog/paralog call compared to the total number of relevant algorithms for that call; the explicit list of supporting algorithms is also shown. Clicking the “Exclude scores <3” button at the top of the page filters out low-scoring calls. The “Best score” and “Best Rev Score” columns indicate whether the given ortholog has the highest score for the query gene and whether the reciprocal relationship is also true.\n7. If desired, click on the “+” symbol in the “Best Rev Score” column to perform a new homolog search with the given gene as the input.\nConducting a reciprocal search gives a more complete view of complex homological relationships.\n8. If desired, click on the “+” symbol in the “Align” column to view a pairwise alignment of the amino acid sequences.\nThis links to an alignment page on the DIOPT website, which also tabulates the domains present in the two proteins and presents additional information on the individual algorithm scores.\n9. If desired, click on a link in the “Gene Reports” or “Transgene in Fly” columns to view the corresponding Gene Report.\nLinks are provided to report pages at model organism databases and NCBI; for human genes, additional links are provided to Ensembl and OMIM. Links in the “Transgene in Fly” column go to FlyBase Gene Reports for non-Drosophila genes that have been expressed transgenically in flies.\n10. If desired, download the visible results table as a TSV file.",
    "Click on the “Save results as tsv file” text at the top of the table to download all the results to a file in tab-separated value format.",
    "Most QuickSearch tabs return results as a “hit list” (Gramates et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0006]; Jenkins et al., 2022[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0008]; Thurmond et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-bib-0019]; Fig. 13[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0013]). In addition to presenting the data matching the search criteria, hit lists offer several powerful options to review, refine, convert, analyze, and export those data. The default view of a hit list is a “List” (Fig. 13A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0013]). This view can accommodate mixed data classes and presents each search result in a panel providing an extended overview of associated information. Alternatively, for results comprising a single data class, a hit list may be viewed as a “Table” by selecting that option under the “View as” text at the top of the page (Fig. 13B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.731#cpz1731-fig-0013]). In this case, search results are shown as separate rows of a table that has sortable columns showing associated data. Hit lists comprising a single data class may also be processed using the “Convert,” “Export,” and “Analyze” buttons. The following support protocol presents a guide to using these hit list features.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/f7b66660-46e6-4c36-8b9f-217db51f77b0/cpz1731-fig-0013-m.jpg</p>\nFigure 13\nHit lists resulting from searching with the text “cadherin” using the “Search FlyBase” tab of QuickSearch. (A) The default “List” view, showing hits from H. sapiens (transgenes in flies) and D. melanogaster. (B) The same hit list in “Table” view, after further filtering on D. melanogaster and the “genes” data class.\nNecessary Resources\nHardware\nComputer or other device with access to the internet\nSoftware\nAn up-to-date web browser, such as Firefox, Chrome, or Safari, with JavaScript and cookies enabled\n1. Obtain a hit list by following one of the applicable basic protocols above or through another route within FlyBase (www.flybase.org[href=http://www.flybase.org]).",
    "2. If desired, (de)select individual entries in the hit list by clicking the checkbox next to the entry. All results can be (de)selected by clicking the checkbox at the top of the list of entries. This step may be performed at any point during filtering/processing.\nSelected entries can be used to generate a new hit list by clicking the “New Hitlist” button at the top of the page.\n3. If desired/applicable, include or exclude data from different species by using the checkboxes in the “Filter by Species” box on the left of the page.\nAlthough the majority of FlyBase data pertain to D. melanogaster, reports also exist for genetic entities from other Drosophila species as well as non-Drosophila species; the latter are required to accommodate data on heterologous expression, where a gene from a “foreign” species (e.g., GAL4, GFP, lacZ, or a human gene) has been expressed transgenically in D. melanogaster. The number in parentheses after each species or species group indicates the number of hits in that category.\n4. If desired/applicable, include or exclude data from different data classes and ontologies by using the checkboxes in the “Filter by data class” box on the left of the page.\nThe number in parentheses after each data class or ontology indicates the number of hits in that category.\nNote that selection of a single data class or ontology is a prerequisite for the subsequent (optional) steps.\n5. If desired and if a hit list comprises a single data class, click on the “Convert” button at the top of the page to convert selected entries into a different applicable data class. Doing so generates a new hit list of the converted data class.",
    "For example, a list of genes may be converted into a list of alleles, transcripts, or stocks associated with those genes.\n6. If desired and if a hit list comprises a single data class, click on the “Export” button at the top of the page to export selected entries into a different applicable FlyBase tool or as a downloadable file.\nFor example, a list of genes may be exported to the Sequence Downloader, Ribbon Stack Viewer, Batch Download, QueryBuilder, or FeatureMapper tools.\nAny list may be downloaded as a simple text file of FlyBase IDs.\nAny list can be viewed as a “FlyBase cross-referencing records table,” which tabulates all the FlyBase records with an internal cross-reference to the submitted record(s).\n7. If desired and if a hit list comprises a single data class, click on the “Analyze” button at the top of the page to analyze frequency values as histograms or view interaction maps of the selected entries, as applicable.\nFor example, a list of genes may be analyzed for the frequency values of GO term annotations or chromosome arm locations, or displayed as a genetic/physical interaction network."
  ],
  "subjectAreas": [
    "Bioinformatics"
  ],
  "bigAreas": [
    "Bioinformatics & Computational Biology"
  ]
}