{
  "id": 13550,
  "origin_website": "Jove",
  "title": "Long-term Live Imaging of Drosophila Eye Disc",
  "procedures": [
    "1. Pre-experimental Setup\nCollect a fly egg that expresses nuclear green fluorescent protein (GFP) under mδ0.5-Gal4 and culture at 25 °C for 5 days.\nMicrowave 0.7 g of low-melting agarose in 10 mL of 1x Phosphate-buffered Saline (PBS) until the agarose is completely dissolved. Keep the 0.7% low-melting gel in a 37 °C incubator until use.\nSterilize all equipment, including forceps, scissors, 42 mm x 0.17 mm coverslips, a 9-well glass spot plate, and a magnetic culture chamber, with 70% ethanol for more than 12 h.\nPrepare the culture medium3: Schneider's Drosophila medium supplemented with 2% Fetal Bovine Serum (FBS), 0.5% penicillin-streptomycin, and 1.25 mg/mL insulin. To avoid contamination, prepare the medium in a cell culture hood. Store the prepared culture medium at 4 °C and used within a month.\nClean the dissection platform and the experimenter's hands with 70% ethanol before starting the dissection.\n2. Disc Dissection\nAir dry all the equipment from 70% ethanol.\nSelect a third-instar larva from a fly vial. To avoid contamination from the fly vial, wash the larva in 1x PBS 3x to remove the waste.\nDissect the cleaned larva in 1 mL of culture medium (at RT) in the 9-well glass spot plate under a dissection microscope.\nGrasp the larva with a pair of forceps at about one third of the way from the posterior end and another forceps at the mouth hook. Pull the two forceps in opposite directions to release the internal tissues.\nRemove the salivary glands, fat body, and cuticle from the eye-brain complex attached to the mouth hook. If the ventral nerve cord is still attached, cut it away with scissors.",
    "Use one pair of forceps to grasp the mouth hook and one pair of forceps to remove a piece of tissue that connects the brains and eye discs in the dorsal part.\n\tNOTE: If this tissue is not removed, the two eye-antennal discs will be close to each other and the brain. The eye discs will then not lie flat on the coverslip because this tissue, the brain, and the eye-antennal disc will form a triangle.\nRotate the whole complex to a ventral-upward position. Remove the filament that connects the hook or disc to the brain.\n\tNOTE: If the filament is not removed, the eye-antennal disc will split into two piece when the mouth hook is removed.\n\t\nRemove the mouth hook. Take care not to damage the eye disc during the process.\n\t\tNOTE: The eye disc is now free in the medium and only connected to brain by the optical stalk.\n3. Mounting\nAir dry and assemble the components of the chamber with a 42 mm x 0.17 mm coverslip. Attach a double layer of O-rings to the center of the cover slip to hold the agarose.\nAssemble the chamber with coverslip. Put the 42 mm x 0.17 mm coverslip on the stage acceptor. Place the silicon O-ring on the cover slip. Place the base. Lock the sealing locker and place the cover (Figure 1).\nCarefully transfer the dissected eye-brain complex to the center of O-ring using a 20 µL micropipette with a 10-200 µL tip.\nRemove most of the medium and add 12 µL of 0.7% low-melting agarose (at 37 °C) to the sample.\n\tNOTE: The position of the eye disc can be changed with forceps before the solidification of the agarose. The agarose will solidify within 5 min.",
    "Add 1 mL of culture medium at room temperature to the center of O-ring; each O-ring can load up to 4 samples. Make sure that the agarose is glued to the O-ring to avoid the drifting of the sample.\n\t\tNOTE: No aeration or circulation of the medium is necessary.\n4. Confocal Microscopy\nPlace the chamber on the stage of an inverted confocal microscope for 30 min to equilibrate the temperature. This can prevent Z-axis drift during the imaging.\nBefore long-term live imaging, check whether the tissue is intact by differential interference contrast microscopy.\nTo avoid the phototoxicity, use a laser power below 2 mW. Use a 40X objective for imaging.\nAcquire 62 µm Z-stack images in 12 min at an optical interval of 1 µm. Acquire 40 cycles of scans over a total of 10 h. Ensure that each cycle contains 12 min of imaging and 3 min of resting."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}