{
  "id": 12251,
  "origin_website": "Jove",
  "title": "Development of a Human Preclinical Model of Osteoclastogenesis from Peripheral Blood Monocytes Co-cultured with Breast Cancer Cell Lines",
  "procedures": [
    "Human osteoclasts were differentiated from PBMCs of healthy donors who gave written informed consent to take part in the study. The study protocol was approved by the local Ethics Committee, in accordance with the ethical standards laid down in the 1964 Declaration of Helsinki.\n1. Osteoclast Differentiation\nNOTE: Collect peripheral blood or buffy coats from healthy human donors in EDTA. Do not use less than 20 mL of peripheral blood. Buffy coats are preferable because they have a greater abundance of mononuclear cells. Perform all the following steps in a sterile tissue culture hood.\nDilute EDTA whole blood 1:1 with 1x phosphate-buffered saline (PBS). Re-suspend well.\nLayer on lymphocyte separation media (blood PBS: lymphocyte separation media, 2:1) in 50 mL tubes.\n\t\nPipette 30 mL of blood diluted in PBS into a 50 mL tube.\nGently underlay 15 mL of lymphocyte separation media into the bottom of the 50-mL tube.\nCentrifuge at 757 × g for 10 min at room temperature (no brakes).\nCollecting the mononuclear cells:\n\t\nCollect the white layer of mononuclear cells with a 5 mL pipette without agitating and place it in a new 50 mL tube.\nDilute the collected PBMCs with 20 mL of PBS.\nWashing the PBMCs:\n\t\nCentrifuge at 225 x g for 5 min at room temperature.\nDiscard the supernatant by inverting the tube. Repeat once.\nRBC lysis:\n\tNOTE: If the cell pellet is red, treat cells with Red Blood cell lysing buffer solution (see Table of Materials).\n\t\nPut the 50 mL tube on ice.\nAdd 5 mL of Red Blood cell lysing buffer.\nWait 3 - 5 min to complete the erythrocyte lysis. The time varies according to the degree of erythrocyte contamination.\nStop the reaction by adding 20 mL of PBS.",
    "Centrifuge at 225 x g for 5 min at room temperature. Discard the supernatant by inverting the tube.\n\t\tNOTE: Optional: If the RBC lysis is performed, wash the PBMCs as described below.\nWash PBMCs:\n\t\nAdd 20 mL of PBS and centrifuge at 225 x g for 5 min at room temperature.\nDiscard the supernatant by inverting the tube.\nRe-suspend the cells in complete α-MEM (supplemented with 1% glutamine (initial concentration 100X) and 10% fetal bovine serum).\nCount the cells with a Neubauer chamber.\n\t\nDilute the sample 1:100 in glacial acetic acid and use 10 µL of the dilution to count cells.\nCount at least twice and calculate the mean of replicates to get the total mean number of cells collected.\nPlate cells:\n\t\nPlate cells at a concentration of 750,000 PBMCs per cm2.\nStore plated cells in an incubator at 37 °C in a 5% CO2 atmosphere.\n\t\tNOTE: Design the experiment to include negative controls, which are cells that are treated with normal complete α-MEM without MCSF or RANKL GFs. Remember to perform each condition in at least 3 technical replicates. Perform at least 3 biological replicates.\nChange the medium supplemented with GFs:\n\t\nWait about 3 h after the cell seeding and then remove the medium by pipette (200 - 1,000 µL) to discard debris, unattached cells, and erythrocytes.\n\t\tNOTE: Be careful when changing the medium to avoid cell detachment.\nAdd new complete α-MEM supplemented with 20 ng/mL of MCSF (500 µL/well).\n\t\tNOTE: When co-culturing with cancer cells, seed the cancer cells the day after the PBMC seeding.\nChange the media every 2 - 3 days (α-MEM supplemented with 20 ng/mL of MCSF):\n\t\nDiscard the medium by a 200 - 1,000 µL pipette.\nAdd new fresh medium by a 200 - 1,000 µL pipette.",
    "6-7 days after cell seeding, add 20 ng/mL of RANKL to complete α-MEM+MCSF.\nChange the medium (complete α-MEM+MCSF+RANKL) every 2-3 days:\n\t\nDiscard the medium with a 200 - 1,000 µL pipette.\nAdd new medium with a 200 - 1,000 µL pipette. Stop induction of differentiation 14 days after cell seeding.\nDiscard medium and wash twice with PBS.\nFix cells with paraformaldehyde:\n\t\nLeave cells to dry.\nAdd 4% paraformaldehyde (see Table of Materials).\nIncubate for 20 min at room temperature.\nDiscard paraformaldehyde and wash twice with 500 µL of PBS.\n\tCAUTION: Paraformaldehyde is toxic; please wear gloves, mask and eyeglasses.\nAllow cells to dry.\nPerform TRAP staining according to the manufacturer's instructions (see Table of Materials).\nCount osteoclast-like cells manually under the microscope at magnification 10X; NA 0.30.\n\tNOTE: Osteoclast-like cells are defined as TRAP+ polycarion cells with at least 4 nuclei.\n2. Cancer Cell Cultures\nNOTE: The experiments can be performed with different types of breast adenocarcinoma cell lines such as SCP217, an osteotropic cell line originating from the triple negative human breast cancer cell line (MDA-MB-231), and the hormonal receptor-positive cell line MCF7.\nCulture the cells as a monolayer in 75-cm2 flasks.\n\t\nSeed 1,000,000 cancer cells in a 75-cm2 flask.\nStore the cells at 37 °C in complete α-MEM medium supplemented with 1% glutamine and 10% fetal bovine serum in a 5% CO2 atmosphere.\nDetach the cells at a confluency of about 90%:\n\t\nDiscard the medium, wash with PBS, and add 2 - 3 mL of trypsin 1X in PBS.\nIncubate cells for 3-5 min at 37 °C.\nCollect the detached cells from the 75-cm2 flask by a 10 mL pipette, adding 8 mL of complete medium to stop the enzymatic reaction.\nCentrifuge at 225 x g for 5 min.\nWash the cancer cells:\n\t\nAdd 10 mL of PBS.",
    "Centrifuge at 600 x g for 5 min.\nCount cancer cells with a Neubauer chamber.\n\t\nCount cancer cells at least twice and calculate the mean of replicates to get the total mean number of cells collected.\n3. Direct Co-Cultures of Cancer Cells a nd Monocytes Undergoing Differentiation towards Osteoclasts\nSeed the cancer cells on inserts (pore diameter 0.4 µm):\n\t\nSeed the cancer cells at a concentration of 4,000 cells per cm2.\nIncubate at 37 °C and 5% CO2.\n\t\tNOTE: Seed the cancer cells the day after PBMC seeding for the co-culture experiment in 0.4 µm inserts.\nWait for 24 h to allow the cells to adhere.\nPlace the seeded insert culture over the mononuclear cultures to start the co-culture (see section 1.10 of the protocol).\nChange the media every 2 - 3 days with complete α-MEM.\n\t\nDiscard the medium with a 200 - 1,000 µL pipette.\nAdd 500 µL of fresh medium.\n\t\tNOTE: The primary aim of the co-culture is to understand the osteoclastogenic power of cancer cells, therefore, the GFs are not added to α-MEM. In each experiment of co-culture, include negative controls (see note in step 1.10 of the protocol) and positive controls of osteoclasts differentiated by RANKL and MCSF (no cancer cells). Cancer cells seeded in the inserts not placed over mononuclear cells are used as a negative control of the co-culture.\nStop the co-culture and use cancer cells for downstream analysis:\n\t\n13 days after PBMC seeding and 12 days after cancer cell seeding, place the insert on a new plate.\nStop cancer cell culture on the basis of which downstream analyses are to be performed (see Discussion).\nOn day 14, stop osteoclast differentiation and fix cells, as reported in step 1.15.\nPerform TRAP staining immediately or within 14 - 30 days.",
    "NOTE: Optional staining: To confirm that the TRAP+ polycarion cells are osteoclasts, researchers can perform additional staining to detect CTR, an osteoclast-specific marker. The detection of F-actin rings is another osteoclast-specific staining assay12,13,14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}