{
  "id": 1623,
  "origin_website": "Cell",
  "title": "Generation of recombinant vaccinia virus and analysis of virus-induced cell death",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nVaccinia virus infection and DNA transfection\nTiming: 5 days\nIn this procedure, we will infect BS-C-1 cells with vRB12, followed by transfection of pRB21 containing our gene of interest. BS-C-1 cells are chosen because they form large visible plaques on monolayer infection (Figure 1[href=https://www.wicell.org#fig1]). This first step will generate heterogeneous virions. Further selection will be necessary to isolate recombinant vaccinia virus for subsequent subcloning and expansion.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig1.jpg\nFigure 1. Workflow for recombinant vaccinia virus generation\nInfection with vRB12\nSeed BS-C-1 cells at 2.5 × 105 cells per well in 1 mL Complete MEM-10 medium on 12-well tissue culture plate.\nCulture cells for 16–20 h in humidified incubator at 37oC and 5% CO2. The cells should be at 90% or higher confluency at the time of infection.\nThaw vRB12 stock virus on ice.\nDilute virus to 0.5 × 105 pfu/mL using MEM-2.5 medium.\nAspirate medium from the cell monolayer. Replace it with 0.5 mL diluted virus from 1d.\nIncubate at 37°C and 5% CO2 incubator for 2 h.\nDNA transfection\nPrewarm Opti-MEM and LT1 transfection reagent to 22oC.\nPrepare transfection master mix containing 100 μL Opti-MEM, 3 μL TransIT®-LT1 Transfection Reagent and 1 μg pRB21-GFP-vIRD.\nIncubate the DNA transfection mixture at 22oC for 15 min.\nRetrieve virus-infected cells from step 1f.\nRemove medium from virus-infected BS-C-1 cells.\nWash the infected cells twice by rinsing the cells with 1 mL of 1X PBS.\nAdd 1 mL MEM-2.5 medium to the cells.\nAdd the DNA transfection mixture dropwise to the cells.\nGently rock the cells back and forth to evenly mix the transfection mixture with the cells.\nIncubate the cells in a 37°C, 5% CO2 incubator for 24 h.\nReplace medium with 1 mL MEM-2.5 medium.",
    "Incubate the cells for 2 days in a 37°C, 5% CO2 incubator.\nHarvest of viral supernatant\nPrewarm Opti-MEM in 37°C water bath.\nRemove 500 μL of culture medium from each well.\nDislodge the infected cells in the remaining culture medium using disposable cell scraper.\nTransfer the cell suspension to a 2 mL sterile screw-top microcentrifuge tubes.\nPlace the cells in in dry ice for 5 min, followed by placing them in a 37°C water bath for 5 min. Vortex for 5 s.\nRepeat the freeze/thaw two more times for a total of three freeze/thaw cycles.\nStore the viral supernatants at −80oC.\nNote: The viral supernatants will contain cellular debris. It is advisable to remove the debris before proceeding to selection of recombinant virus. This can be achieved by centrifugation for 5 minutes at 650 × g at 22oC.\nCritical: Disposable items such as tissue culture plates, pipet tips, Eppendorf tubes that have been exposed to virus or virus-infected materials should be treated with 0.05% diluted bleach solution prior to disposal.\nSelection of recombinant virus\nTiming: 2 weeks\nThe procedure here describes the selection of recombinant vaccinia virus based on visual plaque size. A total of three rounds of selection will be needed to ensure isolation of homogeneous population of recombinant viral progenies (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig2.jpg\nFigure 2. Workflow for selection of recombinant virus\nSeed BS-C-1 cells at 5 × 105 cells in 2 mL complete MEM-10 medium per well on 6-well plate. Incubate in a 37°C, 5% CO2 incubator for 24 h.\nReplace medium with 1 mL of pre-warmed MEM-2.5 medium per well.\nThaw viral supernatants from step 3 on ice. To each well, dispense 100 μL, 10 μL, 1 μL or 0.1 μL of the thawed viral supernatants to the cell monolayer.",
    "Note: Since the titer of the viral supernatant is unknown, the 10-fold serial dilution of the virus ensures that large distinct plaques can be easily identified. If the plaque count is too high, further dilutions can be used.\nIncubate in a 37°C, 5% CO2 incubator for 2 h.\nRemove medium and replace it with 2 mL pre-warmed MEM-2.5 containing 2.5% methylcellulose.\nNote: The methylcellulose is viscous and is included to minimize spreading of viral progenies from the original infected cells. To avoid air bubbles, add the MEM-2.5% methylcellulose at an angle along the edge of the well.\nIncubate in a 37°C, 5% CO2 incubator for 48 h.\nDispense 0.5 mL of pre-warmed MEM-2.5 medium to sterile Eppendorf tubes.\nRetrieve the plate from step 9 from the incubator. Identify large plaques, which should be visible after 48–72 h of infection. Mark the location of the plaques at the bottom of the plate using a marker pen.\nUsing 200 μL pipet tip attached to a P200 pipette, carefully scrape the plaque area with the tip while drawing up the content of the plaque.\nTransfer the content to Eppendorf tube containing 500 μL MEM-2.5.\nVortex the Eppendorf tube.\nSubject the tube to three cycles of freeze/thaw three times as described in step 3.\nSave the released virus at −80oC freezer until next round of selection.\nRepeat steps 4–16 two more times for a total of three rounds of plaque selection. The additional rounds of subcloning ensures purity of the resulting viral stocks.",
    "Note: The methylcellulose helps to prevent spreading of viruses within the well and to allow clear distinct plaques to form. Therefore, avoid disturbing the plate during the 48-hour incubation period. In some cases, longer incubation time of up to 72 hours may be required for clear large plaques to form. We typically collect three to five plaques for each round of selection.\nAmplification of recombinant virus\nTiming: 2–3 weeks\nThis protocol describes the stepwise amplification and production of recombinant vaccinia virus.\n6-Well plate amplification\nSeed 5 × 105 BS-C-1 cells in 2 mL complete MEM-10 per well in a 6-well plate. Incubate at 37°C, 5% CO2 for 24 h.\nDilute 250 μL of recombinant virus from step 17 with 750 μL MEM-2.5.\nDispense the diluted virus to the BS-C-1 cells.\nIncubate at 37°C, 5% CO2 for 30 min.\nAdd 1 mL of MEM-2.5 to each well, incubate in 37°C, 5% CO2 incubator for 48 h.\nRemove 1 mL of medium.\nScrape the cells in the remaining 1 mL of medium with disposable cell scraper.\nTransfer the cells and supernatant to sterile Eppendorf tube.\nSubject the infected cell mixture to three cycles of freeze/thaw. Vortex the tube after each thaw cycle.\nSave the viral supernatant in −80oC freezer.\nT25 flask amplification\nSeed 1.5 × 106 of BS-C-1 cells in complete MEM medium in a T25 flask. Incubate at 37°C, 5% CO2 for 24 h.\nDilute 500 μL of amplified recombinant virus from step 27 with 1.5 mL MEM-2.5.\nDispense the diluted virus to the BS-C-1 cells in T25 flask.\nIncubate virus with cells at 37°C, 5% CO2 for 30 min.\nAdd 3 mL of MEM-2.5 to the flask.\nIncubate at 37°C, 5% CO2 for 48 h.\nScrape the cells with disposable cell scraper. Transfer the supernatant to 15 mL conical tube.",
    "Spin the cells down at 1800 × g for 5 min. Resuspend the cell pellet in 1 mL MEM-2.5.\nNote: Biosafety caps should be used for the rotor buckets during centrifugation to prevent leakage of infected materials.\nSubject the cell mixture to three cycles of freeze/thaw. Vortex the tube after each thaw cycle.\nSave the viral supernatant in −80oC freezer.\nValidation of protein expression by recombinant vaccinia virus\nTiming: 5 days\nNote: We typically will validate protein expression after expansion of the virus in T25 flasks. However, validation of protein expression can also be performed at the 6-well stage.\nSeed 2.5 × 105 L929 cells in 1 mL of complete DMEM-10 medium in each well of a 12-well plate. Incubate at 37°C, 5% CO2 for 24 h.\nAdd 10 μL of the amplified recombinant virus from step 37 with 1 mL MEM-2.5.\nAdd the diluted virus to the cells. Incubate at 37°C, 5% CO2 for 2 h.\nReplace medium with 1 mL of complete DMEM-10 medium per well.\nIncubate infected cells at 37°C, 5% CO2 for 18 h.\nWash the infected cells by rinsing the cells twice with 1 mL 1X PBS at 4oC.\nAdd 100 μL RIPA lysis buffer supplemented with 1X Complete protease inhibitor cocktail and 1X phosphatase inhibitor cocktail.\nTransfer the cells to Eppendorf tube.\nHomogenate the cell lysate by pressing it through an insulin syringe five times.\nBoil in 1X LDS Sample buffer for 5 min.\nLoad the cell lysates on 4%–20% SurePAGE Bis-Tris precast gels.\nTransfer the resolved cell lysates onto nitrocellulose membrane.\nPerform Western blot using anti-GFP antibody conjugated to HRP. Representative result is shown in Figure 3[href=https://www.wicell.org#fig3].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig3.jpg\nFigure 3. Confirmation of vIRD expression by Western blot",
    "L929 cells were infected with the indicated viruses for 18 h. Expression of GFP-vIRD was determined by Western blot. Expression of actin was used to confirm equal loading of proteins.\nLarge-scale production of recombinant vaccinia virus stock\nTiming: 3 days\nSeed 1 × 107 BS-C-1 cells in complete MEM-10 medium in T175 flask. Incubate at 37°C, 5% CO2 for 24 h.\nDilute 500 μL of recombinant virus from step 37 with 4.5 mL MEM-2.5.\nAdd the diluted virus to the cells in the flask. Incubate infected cells at 37°C, 5% CO2 for 30 min.\nAdd 25 mL of MEM-2.5 to each flask. Incubate at 37°C, 5% CO2 for 48 h.\nScrape cells with disposable cell scraper and transfer the culture supernatant to 50 mL conical tube.\nSpin down the cells at 1800 × g for 5 min.\nNote: Biosafety caps should be used for the rotor buckets during centrifugation to prevent leakage of infected materials.\nResuspend cell pellet in 2 mL MEM-2.5.\nSubject the infected cell mixture to three cycles of freeze/thaw. Vortex the tube after each thaw cycle.\nAliquot the viral supernatant into 2 mL screw cap freezing vials.\nSave the viral supernatant in −80oC freezer.\nDetermination of viral titer\nTiming: 4 days\nBefore using the recombinant virus to determine the effect of virus-induced cell death, it is important to determine the viral tier using monolayer plaque assay (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig4.jpg\nFigure 4. Workflow for viral titer determination\nSeed 5 × 105 Vero cells per well in 2 mL complete MEM-10 medium in 6-well plate. Incubate at 37°C, 5% CO2 for 24 h.\nThaw the virus from step 60 on ice.\nPerform serial dilution of the virus stock as follows:",
    "Add 10 μL of stock virus solution to 990 μL of MEM-2.5. Mix by gently pipetting the content several times. This is the 1:100 (10−2) dilution.\nTransfer 20 μL of the diluted virus in step 63a with 180 μL of MEM-2.5. Mix by gently pipetting the content several times. This is the 1:1,000 (10−3) dilution.\nPrepare the 10−4, 10−5, 10−6 and 10−7 dilutions as in step 63b.\nAspirate the culture medium in the 6-well plate. Replace with 1 mL MEM-2.5 for each well.\nAdd 100 μL of the serially diluted virus from step 63 to each well, leaving the last well as control without virus. Incubate at 37°C, 5% CO2 for 2 h.\nRemove the medium. Add 2 mL complete MEM to each well. Incubate at 37°C, 5% CO2 for 48 h.\nWash cells twice with 2 mL 1X PBS.\nAdd 1 mL 4% paraformaldehyde solution in PBS. Fix the cells for 30 min at 22oC.\nAspirate the paraformaldehyde solution. Add 1 mL of crystal violet staining solution to each well. Rock the plate gently to ensure that the solution covers the whole well.\nAspirate the crystal violet solution. Rinse the wells under a running tap to remove the crystal violet solution.\nCount the number of plaques in the wells with clear and distinct plaques. A representative image of the clear plaques is shown in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig5.jpg\nFigure 5. Representative plaque assay\nNote that the plaques in the wells with lowest dilution factors were too numerous and not discrete enough for accurate counting. In this example, only the 10−6 and 10−7 wells were counted. The PFUs from the two wells were averaged to obtain the final PFU.\nCalculate the plaque forming unit (PFU) using the formula:",
    "P F U =  N u m b e r  o f  p l a q u e s  x  1  d i l u t i o n  f a c t o r    x  1  v o l u m e   ( m l )     \nDetermination of virus-induced cell death\nTiming: 3 days\nThis protocol describes the functional characterization of the effect of expression of the necroptosis inhibitor vIRD in vaccinia virus-induced necroptosis (Figure 6[href=https://www.wicell.org#fig6]). We use the Incucyte live cell imaging system to measure cell death. However, other methods can be used to enumerate cell death in response to infection by the recombinant vaccinia virus.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig6.jpg\nFigure 6. Workflow of cell death measurement using live cell imaging\nSeed 1.25 x 105 L929 cells in 1 mL complete DMEM medium per well in 24-well plate. Incubate at 37°C, 5% CO2 for 24 h.\nNote: L929 cells produce autocrine TNF in response to virus infection (Liu et al., 2021[href=https://www.wicell.org#bib3]). Therefore, there is no need to add exogenous TNF to the infected cells. However, other cells such as mouse embryonic fibroblasts do not produce autocrine TNF. In this situation, recombinant TNF will have to be added to the infected cells to trigger necroptosis.\nThaw the recombinant vaccinia virus rVACV-GFP-vIRD on ice. In this example, we will infect the cells with a multiplicity of infection (moi) of 2.\nNote: We found that moi of 2 leads to about 30% virus-induced cell death by 24 hours post-infection. This allows us to measure the effect of genes that increase or decrease virus-induced cell death. However, the moi should be determined empirically based on the amount of autocrine TNF produced and the sensitivity to virus-induced necroptosis. If the cell line does not produce autocrine TNF, cell death can be induced with exogenous TNF.",
    "To 300 μL DMEM-2.5, add the required volume of rVACV-GFP-vIRD using the formula below:\n  V o l u m e  o f  s t o c k  v i r u s  n e e d e d   ( m l )  =   M O I  x  c e l l  n u m b e r   P F U  o f  s t o c k   ( m l )     \nReplace the culture medium with DMEM-2.5 containing the virus from step 75. Incubate at 37°C, 5% CO2 for 2 h.\nRemove the medium containing the virus. Replace it with 500 μL complete DMEM containing 100 nM Incucyte® Cytotox Red Dye.\nNote: The Incucyte system can measure green and red fluorescence. Since the infected cells will express GFP, Cytotox Red is used. Otherwise, cell death can be measured using green fluorescent dyes such as Incucyte® Cytotox Green or Yoyo-1.\nScan the plate using the Incucyte live cell imaging system every hour for up to 24 h. Representative images of GFP expression by the virus and cell death by Cytotox Red is shown in Figure 7[href=https://www.wicell.org#fig7].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1059-Fig7.jpg\nFigure 7. Representative Incucyte images of L929 cells infected with the indicated recombinant viruses\nCells were infected with the indicated virus for 24 h in the presence of cytotox red. Infected cells are marked by green fluorescence. Note that cells infected with rVACV-GFP were Cytotox Red, which indicates cell death. By contrast, rVACV-GFP-vIRD infected cells had little cytotox red signals, which is consistent with virus-induced RIPK3 degradation and resistance to autocrine TNF-induced necroptosis.\nAnalyze the results using the Incucyte software version 2020B.",
    "Note: Cell death is calculated by dividing the red fluorescent area (dying cells) over the green fluorescent area (infected cells) using the Incucyte software. If non-fluorescent viruses are used, the phase area can be used instead of the green fluorescent area. Alternatively, cell death can be calculated using the number of fluorescent objects. Other methods of cell death measurement such as flow cytometry can also be used for cell death measurement."
  ],
  "subjectAreas": [
    "Immunology",
    "Protein Expression And Purification",
    "Cell Biology",
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}