{
  "id": 17814,
  "origin_website": "Jove",
  "title": "Identifying Inhibitors of the HBx-DDB1 Interaction Using a Split Luciferase Assay System",
  "procedures": [
    "NOTE: A schematic representation of the split luciferase assay is shown in Figure 1A, and the assay process is outlined in Figure 1B. The interaction dynamics can be measured in real time without cell lysis.\n1. Cell Preparation\nMaintain cultured HEK293T cells in Dulbecco's modified Eagle's medium (DMEM) supplemented with 10% v/v fetal bovine serum (FBS), 1x penicillin/streptomycin at 37 °C in 20% O2 and 5% CO2.\nSeed 5 x 106 cells into a 100 mm dish with 10 mL of DMEM and incubate at 37 °C overnight.\nTransiently transfect 1 µg of HBx and DDB1 with split luciferases into the cells according to the following method.\nNOTE: The amount of the plasmid DNA transfected may depend on the transfection regent used. The optimal position of the split luciferase fused to the target protein must be determined beforehand. In this case, HBx fused to LgBit at the C-terminus of HBx (HBx-LgBit) and DDB1 fused to SmBit at the N-terminus of DDB1 (SmBit-DDB1) provided the best results (i.e., the brightest luciferase signals). This process has been reported previously in detail7.\n\t\nDilute 1 µg of HBx-LgBit expressing DNA plasmid and 1 µg of SmBit-DDB1 expressing DNA plasmid (Table of Materials) in DNA condensation buffer (Table of Materials) to a total volume of 300 µL.\nAdd 16 µL of enhancer solution (Table of Materials) and mix by vortexing for 1 s.\nIncubate the sample at room temperature for 3 min.\nAdd 60 µL of transfection reagent (Table of Materials) to the sample and mix by vortexing for 10 s.\nIncubate the sample at room temperature for 8 min.\nDuring incubation, aspirate the culture medium from the dish (prepared in step 1.2), and wash cells with 5 mL of phosphate-buffered saline (PBS). Remove PBS by aspiration and add 7 mL of DMEM.",
    "Add 3 mL of DMEM to the tube containing the transfection complexes. Mix by pipetting and add the transfection complexes onto the cell in the 10 cm dish.\nIncubate the cells at 37 °C in an incubator under 5% CO2 for 10 h.\nReseed the cells into a white 96 well plate at 5 x 104 cells/well in 50 µL of medium/well according to the following method.\n\t\nRemove the spent cell culture medium and wash cells with 5 mL of PBS.\nRemove PBS by aspiration, add 1 mL of 0.25% trypsin-EDTA, and incubate at 37 °C for 5 min to detach cells.\nAdd 4 mL of DMEM and disperse the medium by pipetting over the surface of the cell layer several times. Transfer the cell suspension to a tube.\nCentrifuge cells at 500 x g for 5 min at room temperature.\nDiscard supernatant and resuspend the cell pellet in 1 mL of PBS.\nCentrifuge the cell suspension at 500 x g for 5 min at room temperature and discard supernatant.\nDilute the cell pellet with buffered cell culture medium (Table of Materials) supplemented with 10% FBS to a seeding density of 1.0 x 106 cells/mL.\nPipette 50 µL of cell suspension into each well of a 96 well plate and return the cells to the incubator.\nIncubate cells at 37 °C under 5% CO2 for 10 h.\n2. Compound Screening\nDuring the incubation, dilute the screening compounds (Table of Materials) and solvent (dimethyl sulfoxide [DMSO]) at 13.5x concentration. For example, if the stock is 10 mM and the screening concentration is 10 µM, add 1 µL of stock solution to 73.1 µL of buffered cell culture medium.\nAdd 12.5 µL of luminescent substrate (Table of Materials) to each well and incubate for 5 min at room temperature.",
    "NOTE: As negative controls, the wells at both ends of the plate (i.e., columns 1 and 12) should contain no luminescent substrate.\nMeasure the baseline luminescence using a luminometer (Table of Materials).\nImmediately after the initial measurement, add 5 µL of compounds and control DMSO diluted in step 2.1 to each well.\nNOTE: The final concentration will be 10 µM.\nMeasure luminescence values every 30 min for 2 h.\nNOTE: The plate should be incubated in the dark at room temperature.\nCalculate the inhibitory effects by comparison with control DMSO treatment after normalization to the baseline signals.\nNOTE: Screening each compound in duplicate or triplicate can reduce variation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}