{
  "id": 8578,
  "origin_website": "Jove",
  "title": "Generation of Neurospheres from Mixed Primary Hippocampal and Cortical Neurons Isolated from E14-E16 Sprague Dawley Rat Embryo",
  "procedures": [
    "All experimental procedures involving animal were approved by the Institutional Animal Ethics Committee of CSIR-Indian Institute of Chemical Biology (IICB/AEC/Meeting/Apr/2018/1).\n1. Reagent and media preparation\nPoly-D-lysine (PDL) solution: prepare PDL solutions at concentrations of 0.1 mg/mL in deionized water and store in 4 °C until use.\nDissociation medium: To 1 L of sterile, filtered deionized water, combine the following components in the respective concentrations: sodium chloride (8 mg/mL), potassium chloride (0.4 mg/mL), potassium phosphate monobasic (0.06 mg/mL), D-glucose (1 mg/mL), sodium phosphate dibasic (0.479 mg/mL), and 1 M HEPES [4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid; 10 mM]. Vortex all the components to aid proper mixing and store in 4 °C until use.\n\tNOTE: Use the dissociation medium in ice-cold form during dissociation but at room temperature (RT) for washing and other purposes.\nPlating medium: plating medium consists of the following: minimum essential medium (MEM) Eagle's with Earle's Balanced Salt Solution (BSS; 88.4%), D-glucose (0.6%), horse serum (10%), and penicillin/streptomycin (1%). Combine the components in the respective ratios and perform the procedure inside a hood under sterile conditions.\n\tNOTE: Always use freshly prepared plating medium to avoid degradation of any component.\nMaintenance medium: prepare the maintenance medium by combining the following in the respective ratios: neurobasal medium (97%), 0.5 mM commercially obtained glutamine sample, B27 serum-free supplement (2%), and penicillin/streptomycin (1%). Combine the components in the respective ratios and perform the procedure inside a hood under sterile conditions. Ensure that all components are freshly prepared.\n2. Preparation of coverslips\nTake a 12 mm diameter round glass coverslip and soak it in 1 M hydrochloric acid (HCl) for 4 h.\nTransfer the coverslips in distilled water using a pair of forceps and swirl it gently to get rid of the acid completely.",
    "Transfer the washed coverslips for an additional round of cleaning in a beaker containing 100% ethanol.\nBefore using the coverslips, dry them well in the laminar hood by keeping them on tissue paper.\n3. Preparation of poly-D-lysine coated plates for neuron culture\nTake two 24 well plates: one for high density plating and another for low density plating. Open the sterile packets only inside the laminar hood.\nTransfer the 12 mm of sterile glass coverslips in the 24 well plates.\nPour 300 µL of PDL solution (0.1 mg/mL in deionized water) in each well so that it fully covers the surface of the coverslips.\nWrap the plates with aluminum foil to prevent drying and keep it in the CO2 incubator overnight.\nThe next day (before plating), aspirate the PDL solution and wash properly with 300 µL of sterile deionized water two to three times.\nAdd 200 µL of freshly prepared plating medium and return the plates to the incubator until plating.\n4. Removal and decapitation of the fetus\nNOTE: Sterilize all surgical instruments packed in aluminum foil in an autoclave at 121 °C (15 psi) for 30 min. This includes a pair of blunt-end scissors, forceps, fine forceps, two fine scissors, and one artery forceps for the entire procedure.\nFor generating neurons and neurospheres, use a timed-pregnant Sprague Dawley rat and mark the day with vaginal plug detection as E0.\n\t​NOTE: The culture must be performed between E14-E16.\nOn the day of culture, place a sterile glass Petri plate on ice and fill it with cold Hank's Balanced Salt Solution (HBSS).\nAnesthetize an E14-E16 pregnant rat with an intraperitoneal (i.p.) injection of 90 mg ketamine/kg of body weight and 10 mg xylazine/kg, then sacrifice by performing cervical dislocation.",
    "NOTE: Rats can also be euthanized by an overdose of pentobarbital or overdose of ketamine with xylazine or diazepam.\nSterilize the dam's abdomen by spraying 70% ethanol and make a V-shaped cut in the abdominal area using sterile forceps and a pair of blunt-end scissors.\nTake the embryonic sacs carefully on the Petri plate with cold HBSS solution.\n\tNOTE: Do not use the same forceps and scissors that were just used for the skin, as this will contaminate the internal organs. Use a different set of scissors/forceps for the internal organs.\nTake the embryos out of the embryonic sacs in fresh, cold HBSS.\nDecapitate the head with sterile scissors.\n5. Removal of brain and dissection of the cortex with hippocampus\nBefore starting, fill 90 mm sterile Petri dishes with cold, sterile HBSS.\nTransfer the heads in the sterile dishes using sterile, blunt-ended dressing forceps.\nUnder the stereomicroscope, hold the head from the snout region with sterile, serrated forceps and remove the brain by cutting the skin and skull open.\nCollect all the embryo brains in the same manner in the HBSS solution.\nRemove all meninges from the hemispheres and midbrain by holding the brainstem.\nCarefully remove the intact hemispheres resembling mushroom caps that contain the hippocampus and cortex.\nCollect the hemispheres containing cortex and intact hippocampus in a 15 mL conical tube containing 10 mL of dissociation medium.\n6. Dissociation of cortical and hippocampal tissue into single neurons\nAllow the collected tissues to settle down and aspirate the dissociation medium, leaving 5%-10% of medium in it.\nAdd 10 mL of fresh dissociation medium to the tissue, and repeat step 6.1 twice.\nAdd 4.5 mL of dissociation medium and 0.5 mL of 0.25% (1x) trypsin EDTA (ethylene diamine tetraacetate) solution.",
    "Keep the tissue in the incubator at 37 °C for 20 min for the digestion to proceed.\nAspirate the medium and add 10 mL of dissociation and plating medium consecutively to the digested tissues.\nAllow the digested tissues to settle down and aspirate the dissociation medium. Add 2.5 mL of plating medium and pour into the base of a 90 mm sterile dish.\nTriturate the digested tissues in the corner base of the dish using a 1,000 µL pipette tip to occupy the minimal volume.\nPass the obtained cell suspension through the 70 µm cell strainer, excluding any chunks of tissue.\nDetermine the density of viable cells using the trypan blue dye exclusion method and count the number of cells in an automated cell counter.\n\t\nFor trypan blue dye exclusion method, take 10 µL of the cell suspension and 10 µL of 0.4% trypan blue stain, mix thoroughly, and add 10 µL of the mixture in one of the two enclosed chambers of the disposable chamber slides.\nInsert the slide containing the mixture into the cell counter and obtain the reading.\n\t\tNOTE: The trypan blue dye exclusion method is based on the principle that live cells (due to their intact membranes) will exclude trypan blue dye and will hence show a clear cytoplasm, compared to a non-viable cell that will easily take up trypan blue and appear blue in color15.\nDilute the number of cells obtained to plate 1.5 x 105 cells/mL for high density and 20,000 cells/mL for low density in two separate tubes containing 30 mL each of the plating medium.\nAspirate the previously added plating medium from each well and plate 500 µL of cells dispersed in plating medium in each well.",
    "After that return the plates to the incubator at 37 °C and 5% CO2 for 4 h.\nExamine the cells for adherence under the microscope 4 h after plating.\nIf there is proper adherence of the cells in both plates, replace the medium in each well with 500 µL of fresh maintenance medium and incubate at 37 °C.\nCulture these neurons grown at low density for 30 days by changing the maintenance medium 2x per week.\nCulture the neurospheres obtained from the high-density plated neurons in the same maintenance medium by transferring them to the ultra-low attachment plates.\nCharacterize the neurons and the neurospheres by immunostaining them with important markers. For immunocytochemistry, first fix the cells/neurospheres using 4% formaldehyde for 30 min on the plate itself, then permeabilize the cells with 0.1% non-ionic detergent for 10 min.\nAdd primary antibodies for both neurons (anti-Tuj1, GFAP, O4, tau) and neurospheres (anti-Nestin, GFAP, Tuj1) in phosphate-buffered saline (PBS) at 1:300 concentrations and incubate overnight at 4 °C16.\n\tNOTE: The Tuj1 (class III β-tubulin) and tau are positive markers for the primary neurons, while GFAP (glial fibrillary acidic protein) and O4 (oligodendrocyte marker) are negative markers for primary neurons17,18. In the case of neurospheres, Tuj1, GFAP, and Nestin all serve as positive markers19,20.\nThe next day, wash the cells with PBS once or twice and add appropriate secondary antibodies in PBS at 1:600 concentrations at RT for 2 h.\n\tNOTE: The anti-Mouse or anti-Rabbit secondary antibodies are selected depending on the host species of the primary antibody added. It should be kept in mind that the secondary antibodies must be conjugated to fluorescence derivatives suitable for fluorescence microscopy purposes.\nWash the cells again with PBS once or twice.",
    "Perform nuclear staining of the cells with Hoechst 33258 (1 mg/mL stock solution in deionized water). Prepare 0.1% Hoechst solution in PBS from the stock solution and add it to the cells.\nIncubate the cells with 0.1% Hoechst solution for 30 min, then wash again with PBS.\nAdd 20 µL PBS (or mounting medium) on the slide and slowly mount the coverslip containing the stained cells over the area of the slide containing PBS. Seal the margins of the coverslip with dibutylphthalate polystyrene xylene (DPX).\nPerform imaging of the fixed cells under a microscope at 10x and 40x magnification.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}