{
  "id": 10016,
  "origin_website": "Jove",
  "title": "A Standardized Protocol for Preference Testing to Assess Fish Welfare",
  "procedures": [
    "The current study has approval and complies with all requirements of the animal care and use protocols of the Pennsylvania State University; IACUC no. 46466.\n1. Setup of preference apparatus\nAttain approval from the institute's Animal Care Committee (or equivalent organization) for all experimental and husbandry procedures involving live animals before commencing the experiment.\nUse an experimental tank made of opaque white plastic. The walls between zones are made from grey acrylic that is fixed in place with silicon sealant.\n\tNOTE: The size of the experimental tank is dependent on the size of the species of interest and the number of individuals used (e.g., for 8 adult zebrafish, a tank of 76 cm L x 76 cm W x 30 cm H is recommended).\nSplit the experimental tank into four zones that vary in accordance with the specific habitat parameters to be tested. Examples of different types of enrichment to investigate include sandy vs. rocky substrate, artificial plants vs. shelters, or flow of water vs. presence of artificial plants (Figure 1).\n\t\nIf using flow of water as a parameter of interest, use small pumps to supply jets of water (see Table of Materials). Set the pumps at a chosen velocity so that they provide a constant and directed flow of water. Choose the desired velocity based on the species of interest's ecology and life history (e.g., 14 cm/s for zebrafish).\nIn the middle of the experimental tank, have a central arena where food is delivered (Figure 1). Access to the central arena from each zone is through a small opening in the separating walls. The opening is large enough for the species of interest to move between zones unhindered, but small enough to reduce any visual cues the fish might experience from other zones.",
    "Place a biofilter and a heater in each corner of the tank, but outside the experimental area so as not to disturb the flow of water and to ensure a constant water temperature across all zones.\nSet up additional experimental tanks as space dictates. Rotate the different zones in each experimental tank to limit any sequential bias. Ensure that all replicate tanks have uniform conditions (same light levels, water temperature, etc.)\nPlace cameras (see Table of Materials) on tripods directly above each experimental tank, so that all zones are visible. Avoid wide-angle lenses and ensure the memory cards have enough space for recording.\nSet the room lighting on a gradual (e.g., 1/2 h) 12 L: 12 D cycle to simulate sunrise and sunset. Maintain water temperature at 25 ± 1 °C.\n2. Capture, acclimation, and procedure\nKeep fish in home tanks when they are not being tested. Net all test fish from their home tanks and place in the center arena of the experimental tank (Day 1). Minimize capture times to reduce stress (e.g., less than 30 s).\n\tNOTE: An alternative procedure for transferring fish from their home tank to the experimental tank that may minimize stress is to transport the fish in a beaker of tank water.\nKeep the number and gender of the fish in each experimental tank constant across replicate tanks and choose based on the species size and ecology.\nOn days 1–4, fish spend time acclimatizing and exploring the different zones. Do not collect data on these days.\n\tNOTE: Extend or reduce the number of days for acclimation depending on the particular experimental protocol. However, the acclimation period should be sufficient to minimize the effects of handling as well as to get the fish accustomed to feeding in the apparatus.",
    "During the acclimation period, monitor water quality closely by conducting regular water quality tests (e.g., pH, nitrate, or nitrite levels) and replace the water if any problems are detected (see Table of Materials).\nFeed the fish flake food (see Table of Materials) in the central arena using a floating food ring (see Table of Materials) attached to the wall of the central arena at the water's surface. A food ring ensures food particles stay within the central arena and do not present a bias for zones due to food drifting.\nGive the fish .5 h to feed ad libitum before removing the leftover food from the experimental tank with a dip net. Feed the fish once in the morning and once in the afternoon.\nAssess behaviors on days 5–7. Switch cameras on and record fish behaviors for 2 h after each scheduled morning and afternoon feeding. On day 8 remove all fish from the experimental tanks with a dip net and place them back in their home tanks.\nDepending on how much sump water is available, replace at least a 1/3 of the water in the experimental tank with fresh sump water to reduce any effects of stress hormones on fish in following replicates.\nSet up the experimental tanks in accordance with the zone rotation schedule for that week. Rotating the zones decreases the chance of any behavioral bias occurring as a result of the placement of any zone relative to each other. Then begin the testing process again with a new batch of fish.\n3. Measurements and data analysis\nDownload the videos to a computer at the end of each recording day. This ensures there is space on the memory card before every use.",
    "Use video software (see Table of Materials) to quantify zone preference. Manually count the number of fish in each zone at 5 min intervals in each 2 h recording period (include the central arena in these counts). Define the gender of the fish during analysis if differentiation between males and females is possible from the video footage.\nTo analyze habitat preference, calculate the mean number of fish per zone for each replicate tank (i.e., average all data across the 3 days). In order to obtain a preference score for structure use, calculate Jacobs' preference index15 as\nJ = (rx − p)/[(rx + p) – 2*rx*p]\n\twhere x is the zone of interest, rx is the ratio of fish in zone x to the total number of fish in all zones, and p is the available proportion of all zones in the experimental tank. The index ranges between +1 for maximum preference, and −1 for maximum avoidance.\nTo determine if there are any changes in the rate at which fish switch between zones during an observation period, calculate the switch rate, rsr, in the first and last 5 min of every observation period, where rsr is the number of times a fish enters each zone from the central arena, divided by the total number of fish.\nConsider a fish to have entered into a zone when the fish's whole body crosses through the opening separating the zones. Calculate a starting and a finishing mean switch rate for each replicate tank. Carry out all behavioral observations by the same experimenter to reduce any experimenter observation bias.",
    "Using statistical software (see Table of Materials), conduct relevant statistical analyses. Suggested analyses include a one-way ANOVA, with preference index as the dependent variable and zone as the predictor variable, and a paired t-test on the starting and finishing mean switch rate for each tank.\nApply Tukey's multiple comparison post hoc test to further investigate zone comparisons, where each zone is compared to each other. More complex statistical analysis includes mixed models that assess time effects, arena effects, sex effects, or even individual differences in behavior.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}