{
  "id": 17288,
  "origin_website": "Jove",
  "title": "Ex Vivo Analysis of Mechanically Activated Ca2+ Transients in Urothelial Cells",
  "procedures": [
    "Care and handling of the animals were carried out in accordance with the University of Pittsburgh Institutional Animal Care and Use Committee. Female, 2-4-month-old C57Bl/6J mice were used for the present study. The mice were obtained commercially (see Table of Materials).\n1. Equipment assembly and setup\nPerform Ca2+ imaging with an upright microscope equipped with a high-resolution camera and a stable light source (see Table of Materials).\n\t\nAcquire the images with a microscope compatible software that permits direct control of the camera, light source, and piezo actuator via a USB digital I/O device (see Table of Materials).\n\t\tNOTE: Figure 1 represents a schematic of the setup. GCaMP5G has a peak excitation wavelength of 470 nm and a peak emission wavelength of 497 nm28. Use a filter cube suitable for GCaMP5G imaging.\nFor the stimulation of individual urothelial cells in the bladder mucosa preparation (see step 2), use a piezoelectric actuator controlled by a single channel open-loop piezo controller (see Table of Materials). Mount the piezoelectric actuator in a micromanipulator.\n\t\nMount the glass micropipettes in a pipette holder affixed to the piezoelectric actuator (Figure 1). Remotely operate the piezo controller by an analog/digital converter controlled by an electrophysiology data acquisition and analysis program (see Table of Materials).\n\t\tNOTE: An external trigger, in the form of a transistor-transistor logic (TTL) signal initiated by the imaging software, is used to trigger the stimulation protocol in the electrophysiology data acquisition and analysis software that moves the piezoelectric actuator (Figure 1).\nEnsure that the imaging software (see Table of Materials) interfaces with the digital I/O device. Configure a digital output channel in the USB digital I/O device to deliver the TTL signal to the analog/digital converter, which will initiate the protocol in the electrophysiology software that moves the piezoelectric actuator.",
    "Use a cable to connect the Start BNC port in the analog/digital converter to the ground (GND) and a screw terminal in the USB digital I/O device.\nSet up the recording protocol in the imaging software.\n\tNOTE: The following steps describe how to generate a protocol that will send a TTL signal and start collecting images at specified time intervals.\n\t\nSet up the acquisition protocol in the imaging software by clicking on the Experiment Manager and selecting New Experiment. A new window will open.\nSelect the icon Time Lapse Loop and drag it to the newly opened window; set the number of cycles to 2 and the interval to the fastest setting allowed in the setup.\nFrom the icon Transmitted Shutter/Manual Shutter, select the icon NI USB-6501 and drag it into the Time Lapse Loop window, and then set the NI USB-6501 as closed. Drag an additional NI USB-6501 from the Transmitted Shutter/Manual Shutter into the Time Lapse Loop window and set it as open. To connect the two NI USB-6501 icons, drag the arrowhead on the side of the NI USB-6501 closed icon and pull until it touches the NI USB-6501 open icon. A line that connects both icons will appear.\nDrag another Time Lapse Loop into the Experiment Manager window and connect it to the first one by pulling the arrowhead. Set the parameters for recording. Set the number of cycles of the new Time Lapse Loop to 2400.\nFrom the Image Acquisition icon, drag the GFP filter into the recently opened Time Lapse Loop and set the exposure time to 100 ms.\nSet the camera image type to 8-bit, resolution to 576 x 576 (Binning 4 x 4), pixel clock to 480 MHz, and Hot pixel correction to standard.",
    "NOTE: The parameters can be adjusted depending on the level of expression of the fluorescent sensor, camera sensitivity, and setup configuration.\nSet up the Lab Bench in the electrophysiology software (see Table of Materials).\n\tNOTE: This will define the output signal in mV of the analog/digital converter.\n\t\nGo to the Configure menu in the electrophysiology software and select Lab Bench. In the resulting Output Signals window, select Analog Out #1, press the Add signal, and name it (e.g., \"Piezo\"). Set the Signal Unit to mV and the Scale Factor (mV/V) to 1.\nGenerate a stimulation protocol in the electrophysiology software following the steps below.\n\t\nTo generate a new stimulation protocol in the electrophysiology software, go to the menu item Acquire and select New Protocol.\nSet Mode/Rate to Episodic Stimulation, Run/Trial to 1, Sweep/Run to 1, and Sweep Duration (s) to 150.\nIn the Outputs menu, select channel #1 Piezo as Analog out.\nIn the Trigger menu, set the trigger to Digitizer Start Input and Internal Timer.\nIn the Waveform menu, select channel #1 and Analog Waveform with Epochs. Set Step A to Step, First Level to 0, Delta level to 0, First duration to 10000, and Delta duration to 0.\nSet Step B to Step, First level to 10, Delta Level to 0, First Duration to 1000, and Delta Duration to 0. Set Step C to Step, First Level to 0, Delta Level to 0, First Duration to 130000, and Delta Duration to 0.\nSave the protocol and name it Stimulation protocol.\nUse a BNC cable to connect Analog Output #1 in the analog/digital converter to the EXT INPUT in the front of the single-channel open-loop piezo controller (see Table of Materials).\nFabricate glass micropipettes for the mechanical stimulation of umbrella cells from capillary glass tubing following the steps below.",
    "Place the capillary glass in a puller (see Table of Materials) and adjust it with the capillary retaining knobs.\nPosition the heater unit at its full height. Adjust the first pull terminating position slider of the puller to 5.\nSet the first heater knob to 76.7 and the second knob to 52.7.\nPull the glass capillary in two steps by pressing the start button.\nClose the tip of the micropipette with a microforge (see Table of Materials) with the heater adjustment knob set at 60.\n\t\tNOTE: For the present protocol, the final diameter of the micropipette tip used for poking individual cells is ~1-3 µm.\nVerify that the stimulating micropipette moves the distance specify in the stimulation protocol.\n\tNOTE: The following steps are to ensure that 12.5 s after initiating the stimulation protocol in the electrophysiology software, a voltage pulse with a duration of 1 s is generated, making the piezoelectric actuator move 20 μm. \n\t\nMount a micropipette in the holder and attach it to the piezoelectric actuator.\nPlace the piezoelectric actuator and the attached micropipette parallel to the center of the microscope stage and within the area of view.\nFocus on the pipette's tip and immobilize the piezoelectric mounting rod (see Table of Materials) with tape. Under bright field illumination, adjust the camera parameters to achieve a clear image of the pipette tip.\nOpen the Stimulation protocol in the electrophysiology software and set it to play.\n\t\tNOTE: The electrophysiology protocol will not start until the TTL signal sent from the imaging software is received.\nFrom Experiment Manager in the imaging software, press Start to initiate data acquisition.\n\t\tNOTE: This will trigger the protocol in the electrophysiology software, which will drive the piezoelectric actuator. The protocol in the imaging software will generate a file with the images of the experiment.",
    "Verify the distance traveled by the pipette following the steps below.\n\t\nTo measure the distance traveled by the pipette during the stimulation protocol, select the Count and Measure item in the imaging software.\nFrom the Measure menu, select the Measurement and ROI option, and a new window will appear below the movie window.\nFrom the Measure menu, choose the Arbitrary Line.\nIn the movie window, draw an arbitrary line starting at the pipette's tip. Note that the end of the arbitrary line will be adjusted later.\nRight click on the arbitrary line to convert the line into a region of interest (ROI), which will be visible in all movie frames.\nInspect the movie and adjust the end of the arbitrary line (ROI) to the final position traveled by the pipette in response to the stimulus.\n\t\t​NOTE: The distance traveled by the pipette in µm will appear in the Measurement and ROI window. The stimulation protocol can be modified according to user needs.\n2. In situ transduction and isolation of the bladder mucosa\nTransduce female mouse bladders in situ with an adenovirus encoding the cDNA of CGaMP5G according to the procedure described in the virus transduction protocol31.\n\t\nWhen transducing urothelial cells for Ca2+ imaging experiments, instill the bladders with 50 µL of the solution containing 2 x 107 infectious viral particles (IVP).\n\t\tNOTE: This technique tends to restrict the expression of CGaMP5G to the umbrella cell layer. Alternatively, experiments could be conducted with urinary bladders harvested from transgenic mice expressing CGaMP5G in urothelial cells (i.e., GCaMP5G expression driven by a uroplakin-2 promotor) or any other cell type of interest.\n24-72 h after transduction, euthanize the mice by CO2 asphyxiation and perform a thoracotomy by opening the chest cavity with scissors to cause the lungs to collapse.",
    "Canulate the urethra with a 24 G catheter. Expose the bladder by an abdominal incision of ~1.5 cm through the skin and muscle, and use a 6.0 suture (see Table of Materials) to secure the catheter to the urethra.\nHarvest the bladder and urethra32 and affix to a silicone rubber holder pad (see Table of Materials) bathed in recording solution containing (in mM): 135 NaCl, 5.0 KCl, 1 MgCl2, 2.5 CaCl2, 10 glucose, 10 HEPES, pH 7.4, and bubbled up with 100% O2 (Figure 2A).\nSeparate the bladder mucosa from the underlying muscular layer with fine forceps following previously published reports32 (Figure 2B).\nCut open the bladder mucosa and pin it down with the urothelium facing up to a silicone elastomer insert in the bottom of a 35 mm diameter tissue cultured dish (Figure 2C).\n3. Mechanical stimulation of individual urothelial cells and Ca2+ imaging\nMount the tissue cultured dish with the pinned bladder mucosa in the microscope stage equipped with a culture dish incubator with resistive heating elements (Figure 2E). Perfuse (following the manufacturer's instructions, see Table of Materials) the cell culture dish continuously at a rate of 1.7 mL/min with recording solution warmed at ~37 °C with an in-line heater.\nMaintain the temperature of the tissue dish incubator and solutions at ~37 °C with a dual channel bipolar temperature controller model (see Table of Materials). Equilibrate the tissue in the chamber with continuous perfusion for at least 15 min before conducting further experimental procedures.\nTo record mechanically induced Ca2+ transients, submerge the micropipette in the solution bathing the pinned bladder mucosa in the tissue dish. Move the micropipette to the center of the field with the help of a low magnification scanning objective (4x) using bright field illumination.",
    "Move the micropipette near the surface of the urothelial tissue by coordinately moving the micromanipulator in the vertical plane and adjusting the focus.\nSwitch the objective to one with a higher magnification (20x) suitable for immunofluorescence with a high numerical aperture (NA).\nSet the micromanipulator to Fine and move the micropipette near the top of the target cell.\nChange the field of view to camera and press Live in the imaging software.\n\t\tNOTE: This must turn on the reflected shutter and allow the observation of the fluorescent signal emitting from the tissue in the computer.\nAdjust the focus to visualize the top of the cell and adjust the pipette's position if necessary.\nOpen the Stimulation protocol in the electrophysiology software and set it to play.\n\t\tNOTE: The protocol in the electrophysiology software will not start until the TTL signal sent from the imaging software is received.\nFrom Experiment Manager in the imaging software, press Start to initiate data acquisition. This will trigger the protocol in the electrophysiology software, which will drive the piezoelectric actuator and generate a file with the images of the experiment. The stimulation protocol can be modified according to the user's needs.\n4. Data analysis\nQuantify the fluorescence intensity over time following the steps below.\n\t\nOpen the image file in the imaging software and select the Count and Measure window. Select the polygon tool and draw a ROI on the boundaries of the cell that was poked.\nGo to the Measure window, select Intensity Profile, set the measurement to Over time, Results to Average, Background Subtraction to none, and then press Execute. The mean fluorescence intensity will be computed over time (Figure 3).",
    "To export the intensity profile data, click on the Excel icon in the Intensity Profile Results window. This will let the user choose the destination folder and file name and save the data in a .xlsx format.\nPerform data analysis using scientific graphing and data analysis software (see Table of Materials).\n\tNOTE: The amplitude of the Ca2+ peak evoked by poking is expressed as the change in fluorescence intensity (ΔF/F), where F is the fluorescence intensity of GCaMP5G at time 0, and ΔF is the difference between the fluorescence intensity maxima and the basal at time 0. The decay of the Ca2+ response can also be calculated (not shown).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}