{
  "id": 3230,
  "origin_website": "Cell",
  "title": "Synthesis of gold–tin alloy nanoparticles with tunable plasmonic properties",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSynthesis of citrate-capped Au nanoparticle seeds\nTiming: 30 min\nThis preparation describes the synthesis of Au seed using the Turkevich method (Figure 1[href=https://www.wicell.org#fig1], Methods video S1[href=https://www.wicell.org#mmc1] “Synthesis of Au Seeds”).2[href=https://www.wicell.org#bib2]\nPreparation of 10 mM HAuCl4 and 100 mM trisodium citrate precursor solutions:\nCarefully weigh 39.4 mg of HAuCl4 trihydrate on an analytical balance into a 20 mL glass scintillation vial. Add 10 mL of ultrapure water to yield a 10 mM solution.\nCarefully weigh 58.8 mg of trisodium citrate dihydrate on an analytical balance into a glass scintillation vial. Add 2 mL of ultrapure water to yield a 100 mM solution.\nSynthesis setup and Au seed synthesis (Figure 1A[href=https://www.wicell.org#fig1]):\nSee Table 1[href=https://www.wicell.org#tbl1] for the exact volume of each reagent solution required.\ntable:files/protocols_protocol_2799_1.csv\nTransfer the ultrapure water to a clean 250 mL round bottom flask.\nPlace a clean 25.4 mm PTFE stir bar into the flask and place on the 120 V 250 mL heating mantle resting on a stir plate.\nSet the heating mantle and attached heat controller to 138°C and initiate stirring at 640 r.p.m.\nFasten a condenser to the neck of the round bottom flask, turn on water for circulation through the condenser, and ensure all components are securely attached to a ring stand with minimal motion of the reaction setup (Figure 1B[href=https://www.wicell.org#fig1]).\nOnce the water is boiling (100°C) and the reaction vessel is visibly at reflux, remove the condenser—leaving the round bottom flask on top of the heating mantle/hot plate.\nDirectly pipette the 10 mM HAuCl4 solution. Place the condenser back onto the reaction vessel.\nOnce the reaction system returns to reflux (after approximately 1–2 min), remove the condenser.",
    "Rapidly pipette the 100 mM trisodium citrate solution in a single injection. Re-attach the condenser to the flask and heat/stir for 8 min.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2799-Fig1.jpg\nFigure 1. Illustration of reaction steps, required apparatus features, and Au seed product\n(A) Scheme of sequential synthetic steps and necessary reagents.\n(B and C) Photo images of reaction apparatus and expected visual outcomes of the Au seed suspension, respectively.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2799-Fig2.jpg\nFigure 2. Photographs of reaction steps and visually observable features\nPhotographs of each sequential step of the tin reduction and diffusion into the gold seeds.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2799-Fig3.jpg\nFigure 3. Photographs of the necessary stirring and heating apparatus\n(A) Stir plate with variable stir controls.\n(B) Standard hot water bath with precise temperature control. Scintillation vial holders are used to physically secure vials while heating.\nNote: Visible color change should gradually occur within about 2 minutes of citrate injection to a dark purple-red solution; this is not a mistake. Visual inspection of the seed solution should yield a bright, transparent burgundy color, as shown in Figure 1[href=https://www.wicell.org#fig1]C.\nCritical: Ensure the injection of the 100 mM citrate solution occurs as rapidly as possible; do not add slowly or in multiple injections.\nAfter 8 min, carefully remove the reaction vessel from the heating/stirring apparatus. Allow to return to room temperature before proceeding with further reactions or optical characterization.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Synthesis of Au seeds, related to step 2\n    \nSynthesis of bimetallic Au–Sn nanoparticles\nTiming: 1 h\nThis process details the preparation of precursor solutions and the chemical reduction and diffusion of Sn into the Au nanoparticle seeds (Figure 2[href=https://www.wicell.org#fig2], Methods video S2[href=https://www.wicell.org#mmc2] “Reduction of Sn and diffusion into Au seeds”). Detailed below are the 10, 20, 30, and 40% molar equivalent additions of Sn.",
    "Preparation of 10 wt.% polyvinylpyrrolidone (PVP), 5 mM SnCl4, and 260 mM NaBH4 solutions.\n10 wt.% PVP solution preparation:\nCarefully weigh 0.1 g of PVP into a 20 mL clean glass scintillation vial; add 1 mL of ultrapure water and swirl until fully dissolved.\nNote: If necessary, sonicate the vial containing the PVP and ultrapure water to expedite the solid dissolving into solution.\n5 mM SnCl4 solution preparation:\nCarefully pipette 7.5 mL of ultrapure water into a clean glass vial.\nIn a fume hood and using a micropipette, carefully and rapidly add 4.34 μL of SnCl4 to the vial. Swirl until fully dissolved.\n260 mM NaBH4 solution preparation:\nCarefully weigh 20 mg of NaBH4 into a clean glass vial.\nCritical: Do not add ultrapure water to the solid NaBH4 until immediately prior to the injection of the 260 mM NaBH4 in the reduction step. Once water is added, the solution should be used as quickly as possible and should not be stored for future use.\nAdd 2.03 mL of ultrapure water to the vial and swirl until dissolved.\nAddition of Sn to Au seeds to form bimetallic nanoparticles (Figure 2[href=https://www.wicell.org#fig2]).\nTo a clean glass vial, pipette 6 mL of as-synthesized Au seeds, water, and add a 12.7 mm PTFE stir bar.\nAdd vials back to the stir plates (Figure 3A[href=https://www.wicell.org#fig3]) and begin stirring at 1,500 rpm. See Table 2[href=https://www.wicell.org#tbl2] for the exact volume of each precursor solution required.\ntable:files/protocols_protocol_2799_2.csv\nWhile solutions are stirring, pipette the 10 wt.% PVP solution into the vial.\nAdd the 5 mM SnCl4 solution to the vial; one can inject this solution immediately after addition of PVP to the vials.\nRemove the reaction vials from the stir plates and cap.",
    "Place the entire capped vial into a hot water bath at 60°C for 10 min (Figure 3B[href=https://www.wicell.org#fig3]). The stir bar does not need to be removed from the reaction setup during this step.\nAfter 10 min, uncover the vials and place back on to the stir plates and resume stirring.\nTo the vials, pipette the freshly prepared 260 mM NaBH4. Upon dispensing of the reduction agent, the solution should visually change to a translucent, homogeneous yellow-orange color with residual bubble formation on the top of the suspensions. Allow this solution to stir for 30 s.\nAgain, remove the entire reaction vial from the stir plates, cover, and place them into the hot water bath at 60°C for 20 min.\nNote: Leave the reaction vials with slightly loosened caps during the 20-minute heating step (in the hot water bath) to allow for gas evolution from the reduction process.\nRemove the vials from the 60°C hot water bath.\nRemove the 12.7 mm PTFE stir bars from the sample solutions, with the assistance of another stir bar, upon removal from the hot water bath.\nAllow colloidal suspensions to return to room temperature before characterizing.\nCritical: A minimal color change occurs during the second heating, but importantly they should remain fully homogeneous colloidal suspensions with no visible flakes or precipitation.\n    Your browser does not support HTML5 video.\n  \n      Methods Video S2. Reduction of Sn and diffusion into Au seeds, related to step 4\n    \nOptical characterization of plasmonic bimetallic nanoparticles\nTiming: 30 min\nThis process describes the process required to optically characterize the synthesized bimetallic nanocrystals to effectively understand localized surface plasmon resonance (LSPR). Specifically, multichannel UV-visible spectroscopy will be used.\nPerform background and blank correction using ultrapure water pipetted directly into the quartz cuvette.",
    "Samples prepared in Step 4, can be pipetted directly into a clean 1 cm path-length quartz cuvette without dilution or concentration of the colloid to obtain the UV-visible spectrum.\nMeasure the UV-visible spectrum over a range of 200–700 nm and ensure data is appropriately saved on your device.\nStructural characterization of bimetallic Au–Sn nanoparticles\nTiming: 3 h\nCharacterization of crystalline features, size distribution, and nanoparticle morphology will be described through the use of XRD and TEM. This protocol describes the sample preparation, instrumentation settings, and steps required for the analysis using a powder X-ray diffractometer and transmission electron microscope.\nPowder XRD sample preparation and characterization:\nPipette samples into 1.5 mL microcentrifuge tubes and place into centrifuge.\nCentrifuge samples at 8,000 r.p.m. (5,510 r.c.f.) for 8 min.\nAfter centrifugation carefully remove supernatant and leave the pellet.\nRe-suspend the pellet into solution by adding 1.5 mL ultrapure water. Ensure sample is evenly distributed by inverting the microcentrifuge tubes.\nPlace the washed samples back into the centrifuge for a second centrifugation at 8,000 r.p.m. (5,510 r.c.f.) for 8 min.\nCarefully remove the supernatant again, leaving only the concentrated sample in each microcentrifuge tube.\nPipette the concentrated sample onto a zero-background silicon background holder for the Rigaku Miniflex X-ray diffractometer.\nAllow samples to visibly dry by placing in a desiccator uncovered.\nPlace samples onto the holders in the Rigaku Miniflex (utilizing Cu Kα X-ray source with 1.54 Å wavelength) and measure the diffraction pattern at a scan rate of 1° min-1 in the 2θ range 10–90°.\nEnsure all data is saved for future analysis.\nTEM sample preparation and characterization:\nPipette samples into 1.5 mL microcentrifuge tubes and place into centrifuge.\nCentrifuge samples at 8,000 r.p.m. (5,510 r.c.f.) for 8 min.\nAfter centrifugation, carefully remove the supernatant and leave the concentrated sample at the bottom.",
    "Re-suspend the concentrated sample back to 1.5 mL by adding ultrapure water. Ensure sample is evenly distributed by inverting the microcentrifuge tubes.\nPlace the washed samples back into the centrifuge for another centrifugation at 8,000 r.p.m. (5,510 r.c.f.) for 8 min.\nCarefully remove the supernatant again, leaving only the concentrated sample in each microcentrifuge tube.\nPipette 10 μL of the concentrated sample onto a Ted Pella Cu Carbon Type-B TEM grid.\nAllow samples to dry completely in a desiccator uncovered for approximately 2 h.\nBimetallic nanoparticles were imaged using a 100 kV accelerating voltage and ImageJ software for size and polydispersity analysis.\nEnsure all imaging and data is saved appropriately for future analysis."
  ],
  "subjectAreas": [
    "Material Sciences",
    "Chemistry",
    "Microscopy"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}