{
  "id": 19486,
  "origin_website": "Jove",
  "title": "The Tibial Fracture-Pin Model: A Clinically Relevant Mouse Model of Orthopedic Injury",
  "procedures": [
    "All methods used while conducting this research were performed in compliance and with approval by the Stanford University Administrative Panel on Laboratory Animal Care (APLAC #33114) in accordance with American Veterinary Medical Association guidelines and the International Association for the Study of Pain. Mice (C57BL/6J, 9-11 weeks old upon arrival, 11-12 weeks old at study initiation) were housed 2-5 per cage and maintained on a 12 h light/dark cycle in a temperature-controlled environment with ad libitum access to food and water. Male mice weighed approximately 25 g at the start of the study. See the Table of Materials for details regarding all materials used in this study.\n1. Baseline behavior measurements\nAs mice learn quickly on the hot plate assay, do not record a baseline for mice in this assay. Instead, compare the mice to uninjured controls.\n2. Anesthesia/preparation\nAnesthetize the mouse with inhalational isoflurane 2%-4%.\nPinch the toe with forceps and use the loss of the toe pinch reflex to confirm the depth of anesthesia.\nApply eye lubricant generously to the mouse's eyes to prevent dryness while under anesthesia.\nPlace a piece of gauze under the mouse and use clippers to remove hair from the right leg of the mouse up to the knee joint.\nClean the hair from the surgical area using the gauze, and then discard the gauze.\nDisinfect the surgical area using a cotton swab dipped in iodine solution.\n3. Surgery\nAfter cleaning the surgical area and confirming the depth of anesthesia, use a scalpel to make a skin incision on the medial surface of the right leg from the distal tibia to the proximal tibia, stopping at the level of the inferior knee joint (Figure 1A).\nDry the area using a cotton swab with particular attention to the proximal tibia.",
    "Using a drill with a 0.6 mm round burr drill bit, drill a hole at the proximal end of the tibia at the level of the tibial tuberosity, ~2 mm distal to the joint line (Figure 1B).\nThen, insert a 27 G needle through this hole/osteotomy down the medullary axis of the bone to establish a channel, and then remove the needle (Figure 1B).\nNext, use a bone saw to score the tibia at the junction of the middle and distal thirds (~5-6 mm distal to the osteotomy site) from the lateral aspect causing trauma to the tibialis anterior muscle (Figure 1D).\nCRITICAL: A medial approach to the fracture will not produce muscle injury.\nClamp the proximal end of the tibia, hold the distal end of the tibia between the thumb and forefinger, and use counter pressure to complete the bone fracture (Figure 1C).\nReinsert the 27 G needle into the intramedullary space, through the proximal tibia, and advance it across the fracture site to the distal segment of the bone to align the fracture.\n\tNOTE: A similarly sized ceramic implant may be inserted instead of a 27 G needle in imaging applications where metal is undesirable. Although not performed here, a possible implant to consider is a ceramic screw (see the Table of Materials).\nThen, cut the needle/plastic implant flush with the tibial cortex using cutting pliers.\nClean up any blood and confirm that the bleeding has stopped before proceeding.\nOnce bleeding has stopped, close the wound using an interrupted 5-0 silk suture.\n\tCRITICAL: Do not leave the animal unattended at any point in the surgery. Observe the animal until it is able to mobilize independently and return it to its cagemates only once it has fully recovered.\n4. After surgery",
    "After surgery, administer buprenorphine 0.05 mg kg-1 by subcutaneous injection to the mice twice daily for two days per local protocols.\nMonitor the mice in the post-anesthesia period and for the length of the study as follows: twice daily for the first 2 days, and then daily up to 3 weeks, and weekly thereafter.\nAssess the mice for behavioral changes indicative of severe stress or sickness such as lethargy, ruffled hair coat, or >20% weight loss. Take note of any issues related to mobility and access to food or water.\n\t​NOTE: Surgical and post-care logs must be filled after surgery and at each check and maintained indefinitely for Institutional Animal Care and Use Committee auditing.\n5. Hot plate testing\nNOTE: Postinjury measurements can begin 7 days after tibial fracture-pin surgery. To avoid the effect of learning in this paradigm, perform the test once after surgery and compare to uninjured controls.\nSetup\n\t\nPlace the hot plate in a configuration where the lighting is overhead, and the plastic cylinder is centered on the plate.\nSet the temperature to 50 °C and place a camera in front of the plate with care to keep the entirety of the enclosed area in view.\n\t\tCRITICAL: A standard 8-bit color industrial camera, which records up to 76 fps, was used in this study.\nAssay\n\t\nPlace the mice inside the testing room for at least 30 min to habituate.\n\t\tNOTE: Make sure the testing room is not too hot or cold to avoid skewing the results.\nPlace the mouse in the cylinder and begin recording.\nRecord movements for 45 s after the mouse's feet first make contact.\nRepeat steps 5.2.1-5.2.3 with the rest of the cohort while maintaining temperature for each subsequent trial.",
    "Measure latency (in seconds) to first response (usually flinching), which is the classic hot plate outcome.\n\t\tNOTE: The following protocol developed in this laboratory additionally scores both reflexive (flinching) and nonreflexive (licking, guarding, and jumping).\nAnalysis\n\t\nScore the hot plate sessions using a viewing program that provides a time stamp with milliseconds.\n\t\t\nConsider using NCH Prism Software on a Mac OS. Download this software for free online (see Figure 2 and Table of Materials).\nOnce downloaded, open the program and click on the option to Continue to Use the Demo Version. Next, click on the large green plus sign to upload the hot plate recordings.\nOnce uploaded, double-click on an individual file to open in video format. Utilize the cursor at the bottom of the window to slowly drag through the length of the video and begin scoring.\n\t\t\t​CRITICAL: Regardless of the software used, make sure to watch the videos in the largest window possible to avoid losing time resolution when dragging the time stamp cursor through the video.\nFormat a spreadsheet as follows.\n\t\t\nTo properly run the R scripts provided, write the column titles exactly as listed below with no capitalization or spaces and in the order listed: mouseid, behavior, start, end.\nEnter the data into the start and end columns in time in s to three decimal places with no leading zeros or colons (e.g.: 2.001)\nFor each video, record each instance of a pain behavior (to ms). Note that only instances of pain behavior by the two hind paws are recorded. Do not record the behavior of the two front paws.",
    "Record flinching/flicking simply as \"flinching,\" including rapid withdrawal of the paw and/or splaying of digits, but the limb is quickly returned to the hot plate, so long as they are not exploring/walking. Count splaying of the digits without actually lifting the entire paw also as flinching. Do not record flinching/flicking behavior for longer than 500 ms. If recorded as such, drag the cursor through this behavior as slowly as possible as it is likely that several flinches and/or guarding occurred in this span.\nLook for prolonged elevation/protection of a limb beyond when afferent nociceptive information ends and record it as guarding.\nRecord licking/biting of a hind paw as licking.\nRecord the removal of all four limbs from the hot plate at once as jumping.\n\t\t\tNOTE: If a mouse flinches, and then with the paw up, continues to attend by licking/guarding, and then split the behavior without any time stamp overlap. Create a separate spreadsheet for each experimental group.\nUtilize the provided R scripts to begin analyzing the data.\n\t\t\nUse \"Behavior_Raster_v2.R\" to generate a raster plot (as shown below) for visualizing the overall behavior.\nUse \"Behavior_duration.R\" to write a spreadsheet containing five sheets to the working directory.\n\t\t\tNOTE: The first sheet provides the total duration of all pain behaviors, the latency to the first pain behavior, and the total number of pain behaviors. Each subsequent sheet provides this information for individual pain behaviors.\nUse \"Behavior_bins.R\" to write two spreadsheets; one with 500 ms bins showing cumulative duration of behavior at each time point, and the other with the area under the curve for the durational behavior profile of each mouse.\nFinally, use \"Cumulative_Sums.R\" to write two spreadsheets but for cumulative summation of a behavior.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}