{
  "id": 8641,
  "origin_website": "Jove",
  "title": "Diagnosis of Hirschsprung's Disease by Immunostaining Rectal Suction Biopsies for Calretinin, S100 Protein and Protein Gene Product 9.5",
  "procedures": [
    "This protocol was approved by the Research Ethics Board of the Union Hospital of Huazhong University of Science and Technology.\n1. Rectal Suction Biopsy\nPerform the rectal suction biopsy by a well-trained pediatric surgeon and an assistant using a Rbi2 suction rectal biopsy system after obtaining informed consent from the guardian.\n\t\nPerform RSB on patients that have the following indications: inability to pass meconium in infants or long-term bloating with or without constipation in children; children with long-term constipation who need paraffin oil to complete defecation; intestinal obstruction or intestinal perforation with unknown reasons in children undergoing an enterostomy.\n\t\tNOTE: The contraindications for RSB are as follows: children who have severe symptoms, who are in poor physical condition, or who cannot tolerant the RSB; children with acute-stage enterocolitis; children undergoing intestinal anastomosis without complete healing.\nPerform a normal saline retention enema as bowel preparation 36 h before the procedure to avoid loose stools and excessive edema of the mucosa. Add magnesium sulfate solution if the child has severe constipation. Administer vitamin K (1 mg/kg) to neonates.\n\tNOTE: Do not perform preoperative blood tests or administer antibiotics, as they are not required.\nPut patient in the lithotomy position. Coat the surface of the tube with paraffin oil. Insert the blunt-ended tube 4-7 cm into the rectum with the side hole facing the posterior or lateral walls.\nApply gentle pressure on the tube to facilitate adequate adhesion of the side hole to the rectal wall. Press the trigger and withdraw the tool immediately.\nUse the biopsy instrument to obtain 4 suction biopsies with a diameter of 2 mm at 3 cm and 6 cm above the dental line, anteriorly and posteriorly. Use a needle to place the specimen on gauze moistened with saline.",
    "Observe the patient until 2 h after the procedure to rule out rectal bleeding. Avoid further rectal and anal manipulations in the first 24 h after RSB.\n2. Preparation of the RSB Sections\nPlace the rectal suction biopsies in 4% paraformaldehyde for 6 h to fix the tissue. Use a fixative volume 5 times more than the tissue volume.\nDehydrate the tissue using the pathological tissue dehydrator for 11 h. The whole programmed process consists of the following 5 steps:\n\t\nPlace the tissue in formaldehyde and fix for 1 h.\nPlace the tissue in 75% ethanol for 4 h.\nPlace the tissue in absolute ethanol (two changes, 1 h each).\nPlace the tissue in absolute ethanol (two changes, 30 min each).\nPlace the tissue in xylene (three changes, 1 h each).\nPlace the tissue in paraffin wax (58-60 °C) (three changes, 1 h each). Embed the RSB tissues in paraffin blocks.\nTrim the paraffin blocks using a microtome until the tissue is entirely exposed with a complete section plane.\nCut the blocks into 0.4 μm sections with a microtome.\nPlace the sections into 45-50 °C water for a few seconds each to allow the sections to spread into a flat plate. \nTransfer the paraffin sections onto slides.\nBake the slides in a 60 °C oven for 3-5 h. Avoid baking for too long, which may lead to the loss of the antigens.\nPlace the deparaffinized slides into xylene (2 changes, 15 min each).\nHydrate the slides in absolute ethanol, 95%, 80%, and 75% ethanol for 5 min each. Then, rinse them in reverse osmosis (RO)-purified water for another 5 min.\n3. Antigen Retrieval",
    "Make working dilutions for calretinin retrieval by mixing 4 mL of EDTA antigen retrieval buffer with 200 mL of RO-purified water. Make working dilutions for S100 and PGP9.5 retrieval by mixing 1 mL of citric acid sodium citrate buffer (100x) with 99 mL of RO-purified water.\n\tNOTE: Calretinin can be retrieved preferentially by EDTA retrieval solution. However, citric acid sodium citrate buffer is more suitable for the retrieval of S100 and PGP9.5.\nPlace the slides in a coplin staining jar. Fill the jar with retrieval solution and place it into a preheated boiling water bath. After boiling for 20 min, remove the jar from the water bath and let it cool to room temperature. The cooling process takes approximately 10 min. Remove the slides and gently rinse them once with phosphate-buffered saline (PBS).\nDraw a circle with a marker pen around the tissue and prepare a wet box for the following procedures.\n4. Blocking\nMake working dilutions by mixing 3 mL of 30% H2O2 with 27 mL of RO-purified water.\nAdd two or three drops of 3% H2O2 solution dropwise onto the tissue to block peroxidates. Add the H2O2 solution promptly to ensure that the solution will not overflow from the circle. Perform blocking of peroxidates in a 37 °C incubator for 20 min.\nRinse the slides gently with PBS (three washes, 5 min each).\nBlock the slides for 20 min at 37 °C with 5% bovine serum albumin (BSA, prepared by mixing 1.5 g of BSA powder with 30 mL of RO-purified water).\n\tNOTE: Blocking with 3% H2O2 can prevent 95% of nonspecific staining and blocking with 5% BSA can prevent the other 5% of nonspecific staining. Combine the two methods to obtain a reliable result.\n5. Antigen-antibody Reaction",
    "Remove the 5% BSA and add 50 μL of primary antibody (calretinin, S100, or PGP9.5) to the slide. Incubate overnight at 4 °C.\nWash the slide with PBS (three times, 3 min each).\nAdd 50 μL of polymer enhancer (reagent A; see Table of Materials) to the section and incubate it for 20 min in a 37 °C incubator. Then, wash the slide with PBS (three times, 3 min each).\nAdd 50 μL of secondary antibody B (goat anti-rabbit/mouse IgG secondary antibody) to the section and incubate for 30 min in a 37 °C incubator. Wash the section with PBS (three times, 5 min each).\n6. 3,3-Diaminobenzidine and Hematoxylin Staining\nAdd 850 μL of RO-purified water to a 1.5 mL tube and add the staining reagents (see Table of Materials) in the order A, B, and C. Add 50 μL of each reagent to obtain a total of 1 mL of 3,3-diaminobenzidine (DAB) working solution. If there are precipitates, use the solution after filtration.\nAdd a drop of DAB working solution to the tissue section and stain for 3-10 min. Incubate the slides in DAB at room temperature until brown staining is detected. Monitor carefully using a brightfield microscope. Keep the DAB working solution away from light. Then, wash the slide with PBS for 5 min.\nAdd a drop of hematoxylin to counterstain the nuclei for approximately 1 min. Then, hold the coplin jar and wash it under a trickle of water for approximately 30-40 s until the excess dye is removed. Be careful not to damage the tissue sections.\nImmerse the RSB slides in a coplin jar containing PBS for 25-30 s. Then, differentiate in 1% hydrochloric acid-ethanol for 10 s. Wash the slides with PBS for 1 min.",
    "Dehydrate the slides in the reverse order of hydration: 75%, 80%, 95%, and absolute ethanol (5 min each).\nExpose the slides to xylene (2 changes, 5 min each).\nMount the coverslip using ultraclean mounting. Allow slides to dry before visualization using a microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}