{
  "id": 10152,
  "origin_website": "Jove",
  "title": "Automated Microbial Cultivation and Adaptive Evolution using Microbial Microdroplet Culture System (MMC)",
  "procedures": [
    "1. Instrument and software installation\nChoose a clean and sterile environment (such as a clean bench) as a dedicated permanent space for MMC. Install the MMC steadily in the space.\n\tNOTE: Keep the MMC away from the interference of strong electric fields, magnetic fields, and strong heat radiation sources. Avoid severe vibration from affecting the optical detection components. Provide the power supply of AC220 V, 50 HZ to the MMC. For details on MMC refer to the Table of Materials and the website for MMC16.\nInstall the operation software from the MMC.zip file\n\tNOTE: Contact the authors for the MMC.zip file.\n\t\nCreate a dedicated folder and save the zip file in it.\nCreate another dedicated folder as the \"Installation Directory\". Unzip the MMC.zip and save the files in the new folder.\n\t\tNOTE: The computer configuration is best to meet: (1) Windows 7 64-bit operating system or above; (2) CPU: i5 or above; (3) memory: 4 GB or above; (4) hard disk: 300 GB or above (rotational speed greater than 7200 rpm or solid-state disk).\n2. Preparations\nConnect the syringe needle (inner diameter is 0.41 mm and outer diameter is 0.71 mm), quick connector A, and reagent bottle (Figure 2C), and autoclave them at 121 °C for 15 min.\n\tNOTE: Unscrew the cap of the reagent bottle slightly during sterilization. A few more reagent bottles can be prepared each time for use.\nUse a 0.22 µm polyvinylidene fluoride (PVDF) filter to filter MMC oil. Put the microfluidic chip (Figure 2B) and MMC oil into the clean bench in advance and sterilize them by ultraviolet irradiation for 30 min before use.\n\tNOTE: For the details of Quick connector A, reagent bottle, MMC oil and microfluidic chip refer to the Table of Materials.\nInstall the microfluidic chip",
    "Open the door of the operation chamber (Figure 2A) and lift the optical fiber probe.\nAlign the electric field holes with the electric field needles and gently place the chip on the chip pedestal. Then insert the two positioning columns into the positioning holes and put down the optical fiber probe (Figure 2D).\nConnect the quick connector A on the chip to the corresponding port of the MMC according to the position number (C5-O5, C4-O4, C6-O6, C2-O2, CF-OF, C1-O1, C3-O3). Then close the door of the operation chamber.\nReplenish the MMC oil (to about 80 mL) in the oil bottle and empty the waste liquid in the waste bottle before use.\n\tNOTE: The waste liquid is usually organic waste. Please refer to regional law and regulation upon disposal, subject to change based on experimental setup.\n3. Growth curve measurement in MMC\nPreparation for initial bacterial solution\n\t\nFollow the related standard regulations to prepare Luria-Bertani (LB) medium and autoclave at 121°C for 15 min.\n\t\tNOTE: Components of LB medium: NaCl (10 g/L), yeast extract (5 g/L) and tryptone (10 g/L).\nTake out the E. coli MG1655 strain from glycerol stock and cultivate it in a 50 mL shake flask with 10 mL of LB medium in a shaking incubator (200 rpm) at 37 °C for 5-8 h.\n\t\tNOTE: The cultivation time depends on the specific strains. It is optimal to cultivate the strain to the logarithmic period/phase.\nDilute the cultured E. coli MG1655 solution with fresh medium to an OD600 of 0.05-0.1 to obtain an initial bacteria solution (prepare about 10 mL).\nClick on Initialization to initialize the MMC. After the initialization interface appears, set the cultivation temperature as 37 °C and the photoelectric signal value as 0.6 (Figure 3A). Initialization will take about 20 min.",
    "Turn on the UV lamp (wavelength 254 nm) during initialization.\nInject the initial bacteria solution and MMC oil into the reagent bottle.\n\t\nTake out a sterilized reagent bottle on the clean bench and tighten the cap.\nUse a 10 mL sterile syringe to inject 3-5 mL of MMC oil from the syringe needle of the side tube. Tilt and rotate the reagent bottle slowly to make the oil fully infiltrate the inner wall.\nInject about 5 mL of initial bacteria solution, and then fill the reagent bottle by injecting 5-7 mL of the oil again.\nPull out the independent quick connector A, and insert the quick connector A of the reagent bottle into its quick connector B to complete the sample injection operation (Figure 4A).\nWait for the initialization to end and then turn off the UV lamp (wavelength 254 nm).\nOpen the door of the operation chamber, and put the reagent bottle into the metal bath.\nPull out the C2 connector of the chip and the quick connector A of the reagent bottle. Connect the side tube connector of the reagent bottle to the C2 connector and the top tube connector to the O2 connector. Then close the door of the operation chamber.\nClick on Growth Curve to choose the function of growth curve measurement (Figure 3A). In the parameter setting interface, input the Number as 15, turn on the OD detection switch and set the Wavelength as 600 nm. Click on Start to start droplet generation. It will take about 10 min.\n\tNOTE: Here, Number refers to the number of droplets to be generated. Wavelength refers to the wavelength of the OD to be detected. Set the Number (maximum 200) and Wavelength (350-800 nm) according to the experiment requirements.",
    "When a pop-up window appears on the main interface prompting \"Remove the reagent bottle between C2 and O2, then please click the OK button after completion\", open the door of the operation chamber to take out the reagent bottle and connect the C2 and O2 connectors.\nClose the door, and click the OK button in the pop-up window to automatically cultivate the droplets and detect the OD values.\n\tNOTE: The MMC detects the OD value when the droplet passes the optical fiber probe. Therefore, the detection period depends on the number of droplets generated.\nWhen the growth curve reaches the stationary phase, click the Data Export button to export the OD data. Select the data save path and export the OD value recorded during the cultivation period in the .csv format, which can be opened by appropriate software (e.g., Microsoft Excel). Then use a mapping software (e.g., EXCEL and Origin 9.0) to plot the growth curve.\n\tNOTE: During the cultivation process, it is feasible to click on the Data Export at any time to export the OD data of all the current droplets.\n4. Adaptive evolution in MMC\nPreparation for initial bacterial solution\n\t\nFollow the related standard regulations to prepare the special liquid medium and solid plates for the MeSV2.2 and autoclave at 121 °C for 15 min.\n\t\tNOTE: For the components of the special medium refer to Table 1 and the Table of Materials.\nCultivate the MeSV2.2 using the solid plate (diameter = 90 mm) in a 37 °C constant temperature incubator for 72 h. Then pick an independent colony and cultivate it in a 50 mL shake flask with 10 mL of the special liquid medium in a shaking incubator (200 rpm) at 37 °C for 72 h.",
    "Dilute the cultured MeSV2.2 solution with the medium to an OD600 of 0.1-0.2 (ensure that the total volume is not less than 10 mL) and continue cultivating it in the shake flask for 5 h to obtain the initial bacteria solution.\n\t\tNOTE: The MeSV2.2 is a methanol-essential E. coli strain. The special liquid medium contains 500 mmol/L methanol, which is a strong stress for MeSV2.2, resulting in very slow growth. Note that obtaining the initial bacteria solution here is different from that described in step 3.1.\nInitialize the MMC as explained in steps 3.2, 3.3, and 3.5.\nTake out two sterilized reagent bottles, one of which is for the initial bacteria solution and the other is for the fresh medium. Inject the initial bacteria solution (5 mL), fresh medium (12-15 mL), and MMC oil into the reagent bottles as explained in step 3.4.\n\tNOTE: As adaptive evolution is a long-term process involving multiple sub-cultivations, store as much fresh medium as possible in MMC. The medium cannot be replenished during the experiment running.\nInstall the two reagent bottles into MMC as explained in step 3.6. Install the one for the initial bacteria solution between the C2 and O2 connector and the other for the fresh medium between the C4 and O4 connector.\nClick on ALE to choose the function of adaptive evolution (Figure 3B). In the parameter setting interface, turn on the OD Detection switch.\nSet the Number as 50, Wavelength as 600 nm, Concentration as 0%, Type as Time, Parameter as 30 h, and Repetitions as 99. Click on Start to start droplet generation. It will take about 25 min.",
    "NOTE: Here, \"Concentration\" refers to the maximum concentration of chemical factors for adaptive evolution. For different droplets, it is realizable in MMC to introduce different concentrations of chemical factors to provide different growth conditions. Calculate the introduced concentrations using the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62800/62800eq01.jpg\n\tHere \"C\" refers to the concentration of chemical factors introduced into droplets; \"a\" refers to the concentration of chemical factors in the reagent bottles between the C4 and O4 connector; \"b\" refers to the concentration of chemical factors in the reagent bottles between the C6 and O6 connector; and \"i\" refers to the available concentration. There are eight concentrations available in MMC. Since the chemical factor here has a single concentration (500 mmol/L methanol) and it is one of the ingredients of the medium, only one reagent bottle containing the chemical factor is installed here, and the Concentration is set as 0%. Type refers to the mode of sub-cultivation, which is divided into three types: time mode, OD value mode, and fluorescence mode. The former means to cultivate the droplets for a fixed time and then sub-cultivate, while the latter two means to cultivate the droplets to pre-defined OD value/fluorescence intensity and then sub-cultivate. Parameter refers to the related parameter required when choosing a mode of sub-cultivation. Repetitions refers to the number of sub-cultivations.\nRemove the reagent bottle placed between the C2 and O2 connector as explained in step 3.8.\nObserve whether the maximum OD values of the droplets during each sub-cultivation period have increased significantly. If the increase occurs and meets the experiment requirements, click on the Data Export button to export the OD data as explained in step 3.9.",
    "NOTE: Here, the sub-cultivation period depends on the Parameter. For example, when setting Type as Time and Parameter as 30 h, the sub-cultivation period is 30 h. During each sub-cultivation period, there are the maximum OD values of the droplets. Estimate whether the adaptive evolution meets the experiment requirements by the increase of maximum OD values (The increase depends on the actual cultivation process of the strain, for example, increased by more than 20%).\n\tCAUTION: Pay attention to whether the stored fresh medium is exhausted. If the significant increase has not occurred even after the medium is exhausted, extract the better-growing droplets and carry out a new round of adaptive evolution.\nExtract the target droplets from the MMC.\n\t\nClick on the Screening button to choose the function of droplet extraction (Figure 3C). Choose the Collect option, click on the numbers of target droplets, and then click on OK.\n\t\tNOTE: Droplet screening includes \"Collect\", \"Discard\" and \"Extract seed solution\". \"Extract seed solution\" means to collect the remaining droplets13 after the sub-cultivation operation.\nWait for the pop-up window to prompt, \"Please pull out the CF quick connector and put it into the EP tube\". Put the CF quick connector into the microcentrifuge tube for collection according to the software prompt and then click on OK (Figure 4D).\nAfter 1-2 min, the software interface will pop up a new window prompting, \"Please insert the connector back and click OK if finished\". Then, insert the CF quick connector back and click on OK to make MMC continue to run (Figure 4D). When the next target droplet reaches the droplet recognition site, repeat 4.9.2-4.9.3 to collect it.",
    "NOTE: After all the target droplets are collected, the MMC will continue cultivating the remaining droplets. If the cultivation is not necessary, click on Stop to directly terminate the operation.\nExtract the droplet using a 2.5 µL pipette, drop it on the 90 mm agarose plate, and spread it evenly with a triangular glass spreading rod with a side length of 3 cm. Then cultivate it in a 37 °C constant temperature incubator for 72 h.\nPick 3-5 independent colonies and separately cultivate them in the 50 mL shake flasks with 10 mL of fresh medium in a shaking incubator (200 rpm) at 37 °C for 48-72 h. Follow the related standard regulations to store the cultured bacteria solution in the glycerol tube for subsequent experiments.\n5. Clean of the MMC\nAfter completion of the experiment, click on Stop to stop all the operations. Then click on Clean to clean the chip and tubes. It will take about 15 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}