{
  "id": 17914,
  "origin_website": "Jove",
  "title": "Orthotopic Rat Kidney Transplantation: A Novel and Simplified Surgical Approach",
  "procedures": [
    "Lewis (RT11) and Dark Agouti (DA) (RT1Aa) rats were purchased from commercial vendors (see the Table of Materials). These fully MHC-mismatched strains are often used to study acute renal allograft rejection. All animals were housed and maintained according to the National Institutes of Health’s (NIH) guidelines in a specific pathogen-free facility at the Johns Hopkins University. All procedures were approved by the institutional animal care and use committee.\n1. Donor procedure\nPrepare and autoclave all surgical instruments to be used in this procedure as a means of sterilization and use disposable sterile gloves to prevent infectious complications.\nAnesthetize the donor rat by isoflurane inhalation (induction at 3%–4% and maintenance at 1%–2%) for the rest of the procedure. Give all donor and recipient animals preemptive buprenorphine subcutaneously at 0.1 mg/kg body weight for analgesia.\nNow, place the rat in a supine position and immobilize the limbs with sterile masking tape.\nUse a mechanical clipper to remove hair from the abdominal area.\n\t\nApply an eye lubricant and use sterile gauze soaked in povidone-iodine, followed by gauze soaked in isopropyl alcohol, to sterilize the surgical field.\nPrior to the first incision, make sure that the rat is adequately anesthetized by checking the absence of the toe pinch withdrawal reflex.\nUsing scissors, start off by making a large longitudinal midline skin and muscle incision from the symphysis pubis to the xiphoid, and enter the peritoneal cavity.\nInsert two retractors on either side of the abdominal wall in order to expose the intra-abdominal cavity.",
    "Cover the intestine with a moist sterile gauze and shift it to the right lateral side of the abdomen, exposing the aorta, vena cava, and left kidney. Apply 1 mL of preheated saline with a 1 cc syringe to keep the intestines and the abdominal organs moist and at a normal temperature.\n\t\nApply a second moist gauze to cover and mobilize the stomach and spleen cranial to the kidney and a small moist gauze to cover the exposed kidney (Figure 1A).\nUse microsurgical dissecting forceps to isolate and mobilize the left renal artery and vein from the connective tissue and each other. Isolate the left renal vein by cauterizing the left gonadal vein and isolate the left renal artery by cauterizing the adrenal artery. After that, mobilize the aorta and vena cava superior and inferior of the left renal pedicle by dissecting the connective tissue with dissecting forceps (Figure 1B).\nDivide and mobilize the ureter from the connective tissue using dissecting forceps, and make a diagonal incision at a length of 2 cm measured from the renal pelvis, using microscissors. Insert a polyamide cuff (see Table of Materials) halfway into the ureter and secure the cuff by placing a knot with 8-0 silk suture (Figure 1C).\n\t​NOTE: It is important not to remove all fat and connective tissue from the ureter, as they provide protection against obstruction caused by adhesions, and their removal may cause ureteral necrosis. Pay extra attention to preserving the vessel supplying oxygen to the ureter.\nMobilize the left kidney by separating it from the perinephric fat using dissecting forceps or microscissors. Leave the adipose capsule of the kidney attached and use that site for handling the kidney.\n\t\nExpose the inferior vena cava.",
    "Administer 200 units of heparin using a syringe with a 27 G needle through the penile vein. Pressure the site of injection with a cotton swab for at least 1 min to prevent bleeding.\nIdentify the portal vein (pv) and inferior vena cava (ivc) (Figure 1D). Flush the kidney by injecting 50 mL of cold saline mixed with 500 units of heparin into the portal vein using a 16 G needle (Figure 1E). Before flushing, cut the inferior vena cava at the infrahepatic level and the portal vein caudal at the needle insertion site to allow the blood to exit the circulation. Start flushing the kidney by gradually infusing the saline solution. Observe a change of color of the kidney from dark red to a uniform grey and pale color (Figure 1F).\nAfter flushing, ligate the renal artery and vein proximal to the aorta and vena cava and place the flushed kidney in a Petri dish in cold saline on ice. Figure 2A represents the schematic overview of the donor procedure.\nOnce the kidney is in cold saline, fix and immobilize the handle of the vein cuff (see the Table of Materials) and gently pull the renal vein through the cuff. Then, fix the renal vein over the cuff by placing three knots using eight-zero silk suture (Figure 2B).                                                                       \n\tNOTE: Pay special attention to the orientation of the vein while securing it in place. Rotated veins cause an obstruction of the blood flow and lead to thrombosis.\n2. Recipient procedure\nRepeat steps 1.1–1.11 from the donor procedure.\nPlace two atraumatic micro-vessel clamps on the left renal artery and vein proximal to the aorta and vena cava (Figure 3A).",
    "Ligate the recipient renal vein proximal to the inlet of the kidney. Flush the renal vein with heparinized saline to remove all the remaining blood out of the vessel.\nSlide the ligated renal vein over the cuffed renal vein previously positioned in the donor kidney and secure it with an 8-0 silk suture (Figure 3B). Maintain the same positional orientation when securing the renal vein over the cuff.\nLigate the ureter at the level of the lower pole of the left kidney. Mobilize the kidney from the perinephric fat.\nLigate the renal artery proximal to the inlet of the recipient kidney. Flush it with heparinized saline to remove any excess blood in the vessel. Perform an end-to-end anastomosis of the renal artery with 8 to 10 interrupted sutures using a 10-0 nylon suture (Figure 3C). Maneuver the artery by using the adventitial layer.\nRemove the vessel clamps to reinitiate the reperfusion of the kidney. Start by removing the clamp on the vein followed by the clamp on the artery (Figure 3D). Use a sterile cotton swab to lightly pressure any oozing areas around the anastomosis region. A few minutes should be sufficient to achieve a patent anastomosis.\nBriefly observe the kidney to assess for adequate perfusion. Immediately after reperfusion, the kidney should change color and gradually regain its natural dark red color after a few minutes (Figure 3E). Visible peristalsis of the ureter and on-site urine production are sometimes observed.\nFinish by inserting the exposed tip of the ureteral cuff into the recipient ureter and secure the recipient ureter with an 8-0 silk suture (Figure 2C and Figure 3F).\nIn order to keep the donor and recipient ureters in position, tie off the ends of each ureter side to each other.",
    "Optionally, the right kidney can be nephrectomized by tying off the right renal artery and vein with a 4-0 silk suture and removing the kidney.\nRemove all gauzes from the abdominal cavity, return all the organs to their natural position, squirt 1 mL of saline over the intestines to keep them moist, and close the abdomen by using a 4-0 absorbable suture on the rectus muscle and a 4-0 silk suture to close the skin layer in an interrupted fashion.\n3. Postoperative care\nPlace the animal in a clean cage with access to ad libitum water and food and allow for recovery on a 37 °C heating pad.\nInject 0.1 mg/kg buprenorphine subcutaneously for analgesia and monitor the animal for recovery. Additional analgesics administration may be needed in the next few days, depending on signs of discomfort or pain. Antibiotics are not routinely administered, as infectious complications are rare.\nObserve the recovery for 1–2 h before returning the animal back to the animal facility. Inspect the animal 2x–3x a day for the first 24 h, followed by a daily inspection. Pay attention to signs of pain and distress, oral intake, and urinary output.\nRemove the stitches 7–10 days after the operation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}