{
  "id": 18643,
  "origin_website": "Jove",
  "title": "Quantification of Protein Interaction Network Dynamics using Multiplexed Co-Immunoprecipitation",
  "procedures": [
    "1. Assay design\nCandidate antibody preparation\n\t\nFor each protein of interest, choose 3 to 5 antibodies to screen. When possible, use monoclonal antibodies that recognize different epitopes. Also include one non-specific control antibody.\nTo remove Tris, perform buffer exchange by adding the antibody to a 30 kDa spin filter, spinning down to its minimum volume, adding 500 µL of phosphate-buffered saline (PBS), and repeating 3 times. To remove carrier proteins, perform antibody purification according to the manufacturer's protocol (see Table of Materials for specific purification recommendation).\n\t\tNOTE: This is done because carrier proteins and buffers with free amine groups (such as Tris) will react with COOH groups and quench the subsequent bead coupling and biotinylation reactions. Ensure that all antibodies are purified (no carrier proteins) and in a buffer free of primary amines (i.e., no Tris).\nCouple each antibody to carboxylate modified latex (CML) beads as described by Davis and Schrum20. To conserve the antibody, scale down bead coupling reactions by up to 1/5 (i.e., 3.6 x 106 beads with 10 µL of 0.2-1 mg/mL antibody).\nEstimate bead numbers using a hemocytometer (typically ~108/mL) and store at 4 °C. Beads have been stored for over a year and used successfully in QMI assays, but shelf life or expiration dates have not been formally established. NaN3 in the B/S buffer prevents bacterial growth.\nBiotinylate a portion of each antibody (see section 2.2 below). Store at 4 °C.\nConfirm effective CML bead coupling and accurate counting by staining 1 x 105 beads with a PE-conjugated antibody reactive to the species in which the antibody was raised and reading on a flow cytometer.\nConfirm antibody biotinylation by dot blot using streptavidin-HRP.",
    "Once the lab has generated reagents that are known to be effective, use those reagents as positive controls in confirmation reactions in steps 1.1.5 and 1.1.6.\nAntibody screening by IP-FCM (immunoprecipitation detected by flow cytometry)\n\t\nDecide on an appropriate screening lysate. For this and all other pre-QMI screening steps (anything included in this section 1: Assay Design), do not use biosamples with limited availability. Instead, choose a comparable control material such as wildtype mouse tissue, cell lines, or normal human donor tissue that is not a limiting resource.\n\t\tNOTE: Choosing a lysis buffer for this assay is not trivial, and is discussed in section 1.5: Detergent Selection, as well as in the penultimate paragraph of the Discussion section. Standard lysis buffers have a base of 150 mM NaCl, 50 mM Tris (pH 7.4), 10 mM sodium fluoride, 2 mM sodium orthovanadate, and protease and phosphatase inhibitor cocktails. Detergents compatible with QMI include 1% NP-40, 1% Digitonin, 0.1-1% Triton X-100, and 0.5-1% deoxycholate14,16,17,18,19,21.\nCalculate the total volume of lysate to be used for each IP, using 10 µL for each IP-probe combination to be screened. If screening X probe antibodies and using one IgG control, each IP will use (X+1) * (10 µL) * (1.1 for pipetting error); X+1 is to account for the required IgG probe control. For example, in a 3x3 antibody screen, each IP should use 44 ul. Remember to include an IgG IP control (see example screening setup in Figure 2).",
    "Calculate the CML bead number to be used. If you are screening X probe antibodies, use [(X+1) * 5 x 104 beads]. Ideally, 5,000 beads per well will result in >2,000 beads per well being read by the flow cytometer. For example, in a 3 x 3 antibody screen, each IP should use 20,000 beads, which is approximately 0.66 µL of prepared CML bead stock from step 1.1.3 (beads should first be quantified using a hemocytometer to ensure accuracy).\nIncubate the volume of lysate from step 1.2.2 with the volume of each CML bead to be screened from step 1.2.3, overnight at 4 °C with rotation to prevent beads from settling. Typically, perform incubations in the first column of a 96-well PCR plate, and cap with PCR tube strip caps.\nSpin down CML beads at 3,200 x g for 1 min and remove lysate by a single, rapid flicking of the plate over the sink. A tiny white pellet should be visible at the bottom of each well both before and after flicking.\nResuspend CML beads in a volume of FlyP buffer to equal 20 µL for each bead-probe pair; for X probe antibodies, use (X+1) * (20 µL) * (1.1 for pipetting error), similar to step 1.2.2. For a 3 x 3 screen, resuspend in 88 µL of FlyP buffer. FlyP buffer is 100 mM NaCl, 50 mM Tris pH 7.4, 1% BSA, 0.01% NaN3.\nDistribute each IP across (X+1) wells of a 96-well PCR plate, where X is the number of probe antibodies being screened, using 20 µL/well. Figure 2A shows an example screening setup.",
    "Wash 2 additional times using 200 µL of FlyP buffer per well. Spin the plate as in step 1.2.5 and flick the plate to remove wash buffer after each wash. Pellets will be extremely small, but should be visible after each wash.\nFor each biotinylated antibody to be screened, calculate the total volume as (Y+1) * 1.1 * 50 µL, where Y is the number of IP antibodies being screened. Dilute antibody to a working concentration in this volume of FlyP buffer, typically starting with 1:100 dilution of a 0.5 mg/mL stock.\nDistribute each diluted antibody down each column of the 96 well plate, and ensure CML beads are resuspended.\nIncubate at 4 °C for 1 h, either with rotation or pipetting at 15 min intervals to ensure CML beads remain in suspension.\nWash 3x in 200 µL of FlyP buffer, for each wash centrifuge and remove lysate as in step 1.2.5.\nResuspend all CML beads in 50 µL of 1:200 Streptavidin-PE in FlyP buffer.\nIncubate at 4 °C in the dark for 30 min.\nWash 3x in 200 µL of FlyP buffer, for each wash centrifuge and remove lysate as in step 1.2.5.\nResuspend in 200 µL of FlyP buffer, and then run on a flow cytometer.\nChoosing Antibodies to Include in Assay\n\t\nGate on size using FSC-H vs SSC-H, and eliminate doublets using FSC-H vs FSC-A.\nGenerate histograms of PE fluorescence intensity and overlay both IgG controls (IgG bead-test probe, test bead-IgG probe) onto tested pairs (Figure 2).",
    "Look for a bead-probe pair that gives clear signal over noise (Figure 2B). Additionally, it is not ideal to use the same antibody for both bead and probe. Differential epitope recognition maximizes chances of observing interactions because some epitopes may be occluded in certain protein complexes. If there are no acceptable options, repeat screen with additional antibodies.\nConfirmation of Antibody Specificity\n\t\nTo ensure antibody specificity for the intended targets, use a lysate sample in which the target has been knocked out; for example, a knockout mouse or an RNAi cell line. Alternatively, use lysate from a target-negative cell line in which the target protein has been artificially expressed.\nPerform IP-FCM as described in step 1.2, modifying to fit the experiment.\nDetergent Selection\n\t\nAs detergents are critical in co-IP experiments, empirically test different variations to ensure that the assay has maximum likelihood of detecting changes. To start, choose a relatively small panel of interactions (4-8) that are known to change in a given condition and/or are of particular interest to your study.\nUsing the non-fluorescent, antibody-conjugated CML beads made for initial screens, perform IP-FCM as described in 1.2 using varied lysis buffer detergent conditions. Detergent screens can be performed with detergent as the only variable, or with different cell conditions for each detergent. Always use IgG controls for both beads and probes, since detergents occasionally produce unexpected background in some IP-Probe combinations.\nBased on the MFIs from the screen, choose a detergent that optimizes the signal for the PiSCES of interest. It is likely that some compromises will need to be made22.\n2. Multiplex reagent preparation\nMagnetic bead coupling",
    "Using the magnetic bead region map, select bead regions to use in a pattern that minimizes risk of cross-detection. Magnetic bead typically smear up and to the right, so avoid bead regions that are diagonally adjacent. Beads from every other column of the bead diagram shown on the Luminex website are recommended (https://www.luminexcorp.com/magplex-microspheres/).\nPrepare the carrier-free antibody at 0.1 mg/mL in PBS (as in 1.1.2) in 250 µL. Keep on ice for later use.\nVortex magnetic beads extensively, and then aliquot 250 µL into an amber microcentrifuge tube (to protect beads from photobleaching).\nMagnetically separate magnetic beads for 60 s and remove the supernatant.\nAdd 250 µL of MES buffer (50 mM MES pH 6.0, 1 mM EDTA), vortex, magnetically separate for 60 s, and remove the supernatant. Repeat and resuspend magnetic beads in 200 µL of MES buffer.\nAdd 40 µL of MES to a 2 mg of single-use tube of Sulfo-NHS to make a 50 mg/mL stock.\nAdd 25 µL of freshly made Sulfo-NHS to the magnetic beads . Vortex.\nAdd 25 µL of 50 mg/mL freshly dissolved EDAC [1-ethyl-3-(-3-dimethylaminopropyl) carbodiimide hydrochloride, also called EDC] in MES buffer. Vortex.\nCover and shake on a vortexer with a tube-holding attachment for 20 min at room temp, 1000 rpm.\nMagnetically separate for 60 s and remove the supernatant.\nResuspend in 500 µL of PBS, vortex, magnetically separate for 60 s and remove the supernatant. Repeat.\nResuspend in 250 µL of antibody solution from step 2.1.2. Vortex.\nIncubate 2 h at room temp with shaking on a vortexer at 1000 rpm.\nAdd 500 µL of PBS to the magnetic beads, vortex, magnetically separate for 60 s, and remove the supernatant.",
    "Add 750 µL of Blocking/Storage (B/S) buffer (1% BSA in PBS pH 7.4, 0.01% NaN3). Cover and incubate 30 min at room temp, 1000 rpm.\nMagnetically separate for 60 s and remove the supernatant. Resuspend in 100 µL of B/S buffer.\nStore at 4 °C. Beads have been stored for over a year and used successfully in QMI assays, but shelf life or expiration dates have not been formally established. NaN3 in the B/S buffer should prevent bacterial growth.\nValidate magnetic bead coupling by staining ~0.25 µL of coupled magnetic beads with a fluorescent anti-host species secondary and reading on a flow cytometer, as in step 1.1.5.\nBiotinylation\n\t\nEnsure that antibodies are in PBS with no carrier protein.\nCalculate the total µg of antibody to be biotinylated (100-200 µg recommended for use in multiplex, 25-50 µg recommended for screening).\nPrepare fresh 10 mM sulfo-NHS-biotin (can be done by adding 224 µL of ddH2O to a 1 mg no-weigh tube).\nAdd 1 µL of 10 mM sulfo-NHS-biotin per 25 µg of antibody, vortex or pipette up and down to mix.\nIncubate at room temp for 1 h.\nIncubate at 4 °C for 1 h.\nUse a 30 kDa spin filter to remove unbound biotin and stop the reaction. Add 500 µL of PBS and spin the column until the minimum volume is reached. Add 500 µL of additional PBS and repeat for 3 total buffer exchanges.\nEstimate concentration by measuring the absorbance of 1-2 µL on a spectrophotometer, and then bring the antibody concentration to 0.5 mg/mL.\nStore at 4 ˚C.\n3. Quantitative multiplex immunoprecipitation\nPlate layout\n\tNOTE: This assay works best when performed using 96-well plates and 2-4 sample conditions.",
    "Always run appropriate controls (i.e., stimulated v. unstimulated cells) on the same plate in order to detect changes between conditions. Distribute each sample horizontally across the plate, and use each column for a different probe antibody. A set of technical replicates for each probe should be run immediately after the first set. See Figure 3 for an example.\nCarefully document the plate layout to facilitate accurate plate loading and analysis.\nSample preparation & immunoprecipitation (Day 1)\n\t\nLyse tissue or cells in appropriate detergent with protease and phosphatase inhibitors and incubate on ice for 15 min. Take care to keep the lysate cold at all times.\n\t\tNOTE: The exact quantity of stating biomaterial and lysate protein concentration must be empirically determined, and some examples of previously used samples are listed in the third paragraph of the introduction. In general, in the range of 200 µL of 2 mg/mL protein per sample has been successful in the past for 20 IP and 20 probe targets, but ideal inputs for each antibody panel and cell or tissue type must be determined empirically.\nSpin down at 4 °C for 15 min at 16,000 x g to remove membranes and debris; keep supernatant as lysate.\nPerform a BCA Assay or similar to determine protein concentrations, and then normalize protein concentration between samples. If using cells, begin with an equal number of cells per condition and normalization is optional.\nPrepare a master magnetic bead mix that contains ~250 magnetic beads of each class per well in the assay. Adjust the bead numbers after data analysis so that in future assays an average of 110 beads of each class will be read per well.",
    "NOTE: Example calculation: (New bead volume) = [(Run Average) / 110] * (previous bead volume). Bead volumes should be adjusted in this way about every 8 runs or as needed. Typically, 3-4 µL of each magnetic bead(prepared as above) are used for a 2-plate experiment.\nWash the magnetic bead mix 2x in FlyP buffer with magnetic separation, and then resuspend in FlyP buffer. For resuspension, use 10 µL per sample per plate. FlyP buffer is 100 mM NaCl, 50 mM Tris pH 7.4, 1% BSA, 0.01% NaN3.\nAfter thoroughly vortexing the magnetic bead mix, aliquot 10 µL into ice cold microcentrifuge tubes (one tube per sample). Add equal volumes of lysate (with normalized concentrations) to each tube for immunoprecipitation.\nAliquot the lysate-magnetic bead mixture into one tube for each plate being run; e.g. for a 2-plate experiment, split the lysate into two tubes. Place tubes on a rotator at 4 °C overnight for immunoprecipitation, covered to keep out light.\nRunning the assay (Day 2)\n\t\nStart with the lysate-magnetic bead tubes for Plate #1. Use a magnetic bead rack to remove lysate from the magnetic beads, and reserve lysate for future analysis. Wash beads 2x in 500 µL of ice cold FlyP buffer. Keep tubes tubes always on ice or at 4 °C.\nCalculate resuspension volume as (number of probes) * (2 technical replicates) * (25 µL per well) * (1.1 for pipetting error). Resuspend IPs in calculated volume of ice-cold FlyP buffer.\nAfter thoroughly resuspending magnetic beads by gentle pipetting, distribute 25 µL per well across a flat-bottomed 96 well plate, on ice.",
    "In a different 96-well plate, dilute biotinylated probe antibodies to 2x working concentration (working concentration is typically 1:100 or 1:200, empirically determined) in FlyP buffer so that their order matches the columns on the plate layout (see Figure 3). The final volume of probe antibodies at the working concentration will be 50 µL per well, so the volume of each 2x antibody prepared should be (25 µL) * (number of biological samples) * (2 technical replicates) * (1.1 for pipetting error).\nUse a multichannel pipette to distribute 25 µL of each probe antibody dilution into the magnetic bead-containing assay plate.\nShake on a horizontal plate shaker to mix and resuspend the magnetic beads, and then incubate at 4 °C for 1 h, shaking at 450 rpm in the dark.\nWash 3x with FlyP buffer on a magnetic plate washer at 4 °C.\nResuspend the magnetic beads in 50 µL of 1:200 Streptavidin-PE.\nShake to mix and resuspend beads, and then incubate at 4 °C for 30 min, shaking at 450 rpm in the dark.\nWash 3x with FlyP buffer on a magnetic plate washer at 4 °C.\nResuspend in 125 µL of FlyP buffer.\nShake for 1 min at 900 rpm to thoroughly resuspend beads.\nRun on refrigerated flow cytometer (see diagram in Figure S1). Use the \"high RP1 target\" setting in the flow cytometer software, and a stop condition of 1,000 beads per region (greatly overshooting the number that should be in any individual well to prevent the machine from stopping prematurely) and sample volume of 80 µL.\nPause the run half way through and resuspend the beads to prevent settling.\nExport data files in the .xml format.\nRepeat the process for the remaining plates, starting at step 3.3.1.\n4. Data analysis",
    "NOTE: The ANC code was designed to compare two conditions from N = 4 experiments, each with 2 technical replicates for each condition. For example, cells are stimulated four independent times, QMI is run on four different days on control (unstimulated) and stimulated cells, with technical replicates as above, and data analysis proceeds as described below.\nAdaptive non-parametric with adjustable alpha cutoff (ANC)\n\t\nOpen MATLAB and set the active directory to a folder containing the ANC program components and the .xml files exported from the flow cytometer.\nFill in the \"ANC input\" file to reflect the details of the experimental design. The example file included in Supplementary File has been pre-filled to run the example data, also provided.\nRun the program, which will write a .csv file into the active directory. The file reports PiSCES that are significantly different, at a false positive (alpha) level of 0.05, between Control and Experimental conditions, in all 4 experimental replicates, or at least 3/4 replicates.\nNote 'ANC hits,' which are defined as PiSCES with significant differences in at least 3 experimental replicates, represented as 3/4∩4/4 in the file, for use in step 4.3.1.\nWeighted correlation network analysis23 (CNA)\n\t\nPaste-transpose the column titles of the data file output by Matlab ending in \"_MFI.CSV\" into the first row of a new excel sheet. Add the columns \"experiment\" for experiment number, and \"treatment\", for experimental treatment, or any other variables to be analyzed. Save this file as \"traits.csv\".\nOpen R studio and set the working directory to a folder containing the \"_MFI.CSV\" and \"TRAITS.CSV\" files.",
    "Run the R commands as indicated in the commented command file and the detailed in the instructions included with the files. The WCNA modules significantly correlated with each experimental trait are output as a graphic file, and the correlation of each interaction IPi_ProbeJ with each module is output as a .csv file.\nNote 'CNA hits,' which are defined as interactions with module membership (MM) > 0.7 and p < 0.05 for membership in a module that was identified as significantly correlated with the experimental variable of interest, for use in step 4.3.1.\nPositive 'hits' & visualization\n\t\nFor each interaction in the \"3/4∩4/4 hits\" list in the ANC output file (from step 4.1.4), identify if that interaction is also a \"CNA hit\" by checking the CNA output file (see step 4.2.6). Create a new column that indicates if each ANC hit is also a CNA hit.\nCalculate the average log2 fold change value for each ANC∩CNA hit by averaging the values given in the ANC output spreadsheet \"_Hits.csv\" from step 4.1.3. Convert values to log2 fold change before averaging. For interactions that were significant in only 3/4 replicates, delete the outlier value.\nMake a spreadsheet with each ANC∩CNA hit listed as an IP in one column, a probe in the second column, and the fold change value in the third column. Use this spreadsheet to create a node-edge diagram in Cytoscape by importing the file as a network.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}