{
  "id": 2708,
  "origin_website": "Cell",
  "title": "In vitro and in cellulo ApoE particle formation, isolation, and characterization",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPart 1. In vitro lipoprotein particle formation\nTiming: 2 days\nThe following steps describe the lipoprotein particle formation in vitro from artificial membranes with a defined lipid composition.\nLiposome formation by extrusion\nTiming: 3–4 h\nBy liposome extrusion, large unilamellar vesicles (LUVs) with a defined size and composition are formed. These LUVs will be the membrane mimetic from which ApoE will extract lipids to form lipoprotein particles in vitro (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig1.jpg\nFigure 1. Liposome extrusion of PI(4,5)P2-containing large unilamellar vesicles\n(A) 100 mol% DMPC- and 95 mol% DMPC + 5 mol% PI(4,5)P2-containing large unilamellar vesicles are made by liposome extrusion. First, the lipids are mixed and the organic solvents are evaporated by rotationally drying down the lipids with an inert gas, thereby creating a lipid film. The lipids are rehydrated in a pre-heated physiological buffer (50 mM Tris pH 7.5, 25 mM NaCl) to form multilamellar vesicles. The multilamellar vesicles are then extruded through a 100 nm pore polycarbonate filter to reshape them into large unilamellar vesicles. Created with Biorender.com[href=http://Biorender.com].\n(B) Example of pictures for the dried lipid film, lipid suspension in physiological buffer and the final liposomes solution after extrusion. See also Methods videos S1[href=https://www.wicell.org#mmc1], S2[href=https://www.wicell.org#mmc2] and S3[href=https://www.wicell.org#mmc3].\nNote: Use glass vials and Hamilton syringes for the handling of lipids. Wash the Hamilton syringes three times with chloroform:methanol 1:1 (v/v) in between each pipetting step.\nNote: Perform steps 1–3 under a flow hood.\nOptional: Use printed labels to label the glass or cover the writing with scotch or parafilm. A single drop of solvent will otherwise wipe out the labelling on the glass vials.",
    "Calculate the amount of lipids needed for DMPC liposomes (100 mol%) and DMPC-PI(4,5)P2 liposomes (95 and 5 mol%, respectively) at a final concentration of 1 mg/mL for a total volume of 500 μL.\nNote: In this assay, the DMPC liposomes have a membrane defect and therefore helps facilitate the lipids pick-up from the liposomes by ApoE. Extrusion of liposomes for other purposes should use a more stable backbone, such as POPC (the most abundant phosphatidylcholine in mammalian cells) instead of DMPC.\nPipette the calculated amounts of lipids in the glass vials.\nNote: The volume of the pipetted lipid mixture at this step is not relevant. The lipids will be dried down and resuspended in 500 μL of a physiological buffer.\nNote: Thaw the lipid stocks to facilitate pipetting. Lipid stocks are typically stored at a concentration of 10 mg/mL or 1 mg/mL in its corresponding solvent. After using the lipid stocks, the lipids should be overlayed with an inert gas and stored at −20°C.\nDry the lipids rotationally under an inert gas stream to form a thin layer of lipids on the wall of the tube (Figure 1[href=https://www.wicell.org#fig1]B, Methods video S1[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Evaporation of lipid solution with a stream of inert gas, related to step 3\nAdjust the stream of inert gas (e.g., argon) until you feel it slightly on your wrist. Dry the lipid solution by holding the tube horizontally and rotating it. The lipid film is transparent and barely visible, depending on the lipid concentration.",
    "Critical: Use a low flow of inert gas to dry the lipids. If the flow is too strong, the solution will splash while drying. The gas stream should be barely sensed on the skin. The wrists are sensitive areas that will allow a good check of the flow strength (Methods video S1[href=https://www.wicell.org#mmc1]).\nPut the glass vials without a cap in a vacuum chamber for 30 min to remove residual solvents.\nPrepare freshly 50 mL of 50 mM Tris-Cl pH 7.5, 25 mM NaCl (physiological buffer).\nFilter-sterilise the solution with a 0.22 μm pore filter.\nHeat the physiological buffer to 65°C in a water bath.\nNote: The physiological buffer is dependent on the protein that is used in the assay. The most suitable buffer for the protein should also be used during the liposome extrusion. In case the buffer is changed from what is stated here, it is important to check the quality of the liposomes after extrusion.\nNote: The temperature of the buffer is set slightly higher than the extruder temperature to account for the cooling down of the sample during sample loading.\nAdd 500 μL of pre-heated physiological buffer to each glass vial and heat it to 65°C in a water bath for 1 h.\nNote: To bring the lipids in suspension in the physiological buffer, heat is required. The temperature at which the lipid mixtures are heated should be above the phase transition temperature of each lipid in the composition.5[href=https://www.wicell.org#bib4] Out of convenience and for comparability we often stick to a high temperature for the buffer and extruder, especially when neutral and sterol lipids are present in the mixture.\nNote: The mixture should become slightly cloudy due to the formation of multilayer sheets. Vortexing the vials will help solubilize the lipids in the physiological buffer (Figure 1[href=https://www.wicell.org#fig1]B).",
    "Critical: The temperature should not be above 80°C. Temperatures above 80°C are incompatible with the gas-tight syringes of the extruder for longer periods of time.\nAssemble the extruder and let the extruder get to a temperature of 62°C on a heating block (roughly 5–10 min before extruding) (Methods video S2[href=https://www.wicell.org#mmc2]).\nWet 4 filter supports and one pore membrane in physiological buffer.\nPlace two filter supports on top of each other on each internal membrane support.\nPlace the pore membrane on top of the filter supports.\nClamp the pore membrane in between the O-rings of the internal membrane supports, place it inside the extruder outer casting, screw the retainer nut on the extruder outer casting, and place it in the extruder holder on top of a heating block.\nFill one of the gas-tight syringes that are part of the extruder kit (blunt end needle) with physiological buffer and insert both syringes at each end of the extruder.\nPush the physiological buffer halfway into the extruder to ensure that the membranes stay wet during the heating equilibration and to reduce the dead volume in the extruder.\nNote: For extra support on the assembly of the extruder, see the Avanti manual of the mini-extruder.6[href=https://www.wicell.org#bib5]\n    Your browser does not support HTML5 video.\n  \nMethods video S2. Extruder assembly, related to step 9",
    "Place the extruder holder on a heating plate at 65°C. Pre-wet 4 filter supports, one pore membrane and the inner faces of the white piece in buffer. Place two filter supports on top of each other on each face of the white piece and the pore membrane on top of the filter supports. Place the white piece inside the extruder outer casting, screw the retainer nut and place it in the extruder holder. Fill one of the syringes with buffer and insert both syringes at each end of the extruder. Push the physiological buffer halfway into the extruder to ensure that the membranes stay wet during the heating equilibration and to reduce the dead volume in the extruder.\nRemove the gas-tight syringes from the extruder.\nLoad the sample into one of the gas-tight syringes and push the sample 21 times through the pore membrane (Methods video S3[href=https://www.wicell.org#mmc3]).\n    Your browser does not support HTML5 video.\n  \nMethods video S3. Formation of liposomes through extrusion, related to step 11\nVortex the lipid suspension and load it in one of the syringes. Push the sample 21 times through the pore membrane from one syringe to the other. Transfer the transparent extruded liposomes solution to an Eppendorf tube.\nNote: Vortex the sample before loading it into one of the gas-tight syringes. The suspension should look slightly cloudy at first due to the multilaminar sheets that formed and clear up when the sample is pushed through the pore membrane (Figure 1[href=https://www.wicell.org#fig1]B, Methods video S3[href=https://www.wicell.org#mmc3]).\nNote: Always extrude an uneven number of times through the pore membrane. One of the gas-tight syringes will serve as the input syringe and the opposite syringe as the collecting syringe. By extruding an uneven number of times, any residual free or aggregated lipids are not collected together with the formed LUVs.",
    "Note: For extra support on the extrusion technique, see the Avanti manual for extrusion.7[href=https://www.wicell.org#bib6]\nTransfer the extruded liposomes to an Eppendorf tube and let the liposomes cool down to 20°C–25°C (Figure 1[href=https://www.wicell.org#fig1]B, Methods video S3[href=https://www.wicell.org#mmc3]).\nStore the liposomes for up to 3–4 days at 4°C.\nCritical: Never freeze liposomes! Liposomes should not be vortexed to prevent fusion. To homogenize liposomes in a solution, flick the tube or carefully pipet up and down with a plastic tip.\nCritical: Putting freshly extruded liposomes directly in the fridge can cause these unstable liposomes to fuse/break down. Let the liposomes slowly cool down to 20°C–25°C and afterwards store them at 4°C.\nNote: Be very careful with the liposomes in general and especially with liposomes having this composition. The DMPC causes a membrane packing defect that makes these liposomes more fragile.\nClean the extruder.\nDisassemble the extruder and syringes as much as possible.\nPut the parts that were in contact with the sample in hot demiH2O (e.g., the O-rings, internal membrane supports and disassembled gas-tight syringes).\nAfter 5 min, transfer the parts to acetone.\nAfter 5 min in acetone, discard the acetone and let the parts dry for 12–20 h under a flow hood on tissue paper.\nNote: Exchange the pore membrane in between different samples. In the case of 100% DMPC and 95% DMPC, 5% PI(4,5)P2 liposomes, it suffices to rinse the parts with physiological buffer. First extrude 100% DMPC to ensure no cross-contamination of PI(4,5)P2 in the 100% DMPC liposomes occurs.\nNote: If the lipid compositions are strongly different from each other, it is recommended to clean the extruder thoroughly before extruding the next composition, as explained in step 14.\nQuality control of liposomes with dynamic light scattering\nTiming: 45 min for starting up and 10 min per sample",
    "To ensure that the liposomes are of good quality, dynamic light scattering (DLS) is performed to measure the size of the liposomes (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig2.jpg\nFigure 2. Quality check of liposomes with dynamic light scattering\n100 mol% DMPC- and 95 mol% DMPC + 5 mol% PI(4,5)P2-containing large unilamellar vesicles (LUVs) are 16× diluted and measured for their size in dynamic light scattering. 100 mol% DMPC liposomes: Z-average = 115.8 nm diameter, PDI = 0.122, attenuator = 8. 95 mol% DMPC + 5 mol% PI(4,5)P2-containing liposomes: Z-average = 119.5 nm diameter, PDI = 0.179, attenuator = 8.\nNote: Ideally, the quality of the liposomes is checked directly after extrusion and shortly before the lipoprotein particle formation assay to ensure that the liposomes have not fused.\nLet the liposomes equilibrate to 20°C–25°C.\nTurn on the DLS machine (Zetasizer nano-ZS) 30 min before starting.\nFilter the physiological buffer through a 0.22 μm pore filter.\nDilute the sample 10–20× in physiological buffer (100 μL total volume) and transfer the sample into a disposable cuvette.\nSet up a DLS method with the following parameters:\nChoose “size” measurement mode.\nSet the refractive index for the physiological buffer.\nSet the temperature to 24.8°C.\nSet: 5 s per run, 11 runs per measurement, and 3 measurements per sample.\nChoose as cell type: Disposable cuvettes – ZEN0040.\nPut the cuvette in the direction indicated on the machine (arrow to the front) in the machine and run the method.\nTake the average values of the 3 measurements to depict the Z-average diameter in nm.\nCheck the polydispersity index and attenuator to ensure good quality measurement.\nNote: Reliable sizes need to show a polydispersity index (PD) <0.5. When these liposomes are correctly formed, the PD falls within 0.05–0.2.",
    "Note: The attenuator is the correction factor that is calculated based on the concentration of the particles that are being measured. An attenuator of 10–11 indicates that the sample is too diluted, whereas an attenuator of 5–6 indicates that the sample is too concentrated. An attenuator of 8–9 is ideal. Usually, this is achieved by diluting the liposomes 10–20 times.\nNote: The size of the liposomes is dependent on the fluidity of the membrane. Extruding with a 100 nm pore size will lead to liposomes of 115–130 nm in size.\nKinetics of the in vitro ApoE lipoprotein particle formation by right-angle scattering\nTiming: 30 min starting up and 45 min per sample\nRight-angle light scattering allows to capture the particle formation kinetics (10–20 nm diameter) when ApoE is incubated with LUVs (100 nm). Larger particles reflect more light than smaller particles in this assay. This technique captures the kinetics of the particle formation by the decrease in size, and thus light intensity (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig3.jpg\nFigure 3. Lipoprotein particle formation by addition of ApoE to liposomes detected by right-angle light scattering\nLipoprotein particles are formed upon the addition of APOE3 to 100 mol% DMPC- and 95 mol% DMPC + 5 mol% PI(4,5)P2-containing large unilamellar vesicles (LUVs), as shown by the decrease in light intensity. The presence of PI(4,5)P2 in the LUVs increases the speed at which lipoprotein particles are formed. As a negative control, DMPC and PIP(4,5)P2-containing LUVs are incubated with buffer and the liposomes stay intact, as indicated by the stable level light intensity. y-axis: light intensity represented as a percentage relative to time 0 (t/t0 of corresponding liposomes with buffer alone). Created with BioRender.com[href=http://BioRender.com].\nTurn on the Jasco FP-8500 fluorimeter 30 min before measuring.\nPre-incubate the liposomes and protein separately at 24°C for at least 30 min.",
    "Note: Liposomes can be kept at 24°C throughout the day, but the protein should be incubated at this temperature for only 30 min. Ideally, pre-incubate an aliquot of the protein equivalent to the amount needed for the next sample at 24°C and keep the remainder on ice.\nSet up the method on the fluorimeter with the following settings:\nGo to the program “Time-course”.\nPhotometric mode: Em intensity.\nEx bandwith: 2.5 nm.\nEm bandwith: 2.5 nm.\nResponse: 1 s.\nSensitiviy: “Low” or “Medium”.\nMeasurement range: 0–600 s.\nData interval: 5 s.\nEx wavelength: 600.0 nm.\nEm wavelength: 600.0 nm.\nIntensity normalisation: off.\nBlank correction: off.\nAuto gain: off.\nShutter control: Open only for measurement.\nLight source: Xe lamp.\nFilter: Not used.\nTemperature: 24°C.\nNote: Determine the sensitivity modus of the method based on the liposomes incubated with buffer. This will be the highest intensity measured and should not be close to saturating light intensity levels.\nClean the quartz cuvette with a cuvette washer and dryer in the following order: 1× milliQ water, 1× 70% ethanol, 2× milliQ water.\nAlternatives: Squirt milliQ water in the quartz cuvette and shake the liquid out above a sink. Do the washing with milliQ water and 70% ethanol in the same order as with a cuvette washer. Remove the remaining liquid at the last step with a pipette.\nWash the quartz cuvette once with filter-sterilised buffer (50 mM Tris, pH7.5, 25 mM NaCl; same buffer as used during liposome extrusion).\nClean the outside of the quartz cuvette with an ethanol-soaked Kimtech wipe to remove any dust particulates on the outside of the cuvette.\nMix 50 μg liposomes with 50 μg ApoE in a total volume of 100 μL in the quartz cuvette while the quartz cuvette is in the fluorimeter.",
    "Pipette the mixture five times up and down.\nStart the measurement.\nAfter the measurement, pipette the sample out of the quartz cuvette.\nRepeat steps 26–32 for the next sample. After the last sample measurement, repeat only step 4 and store the quartz cuvette in a dust-free environment.\nPart 2. In cellulo lipoprotein particle formation\nTiming: 6 days\nThe following steps describe an in cellulo ApoE lipidation by forcing the endogenous ApoE to be loaded with lipids (containing triacylglycerol) after lipid droplet induction with a fatty acid treatment.\nOleic acid conjugation to fatty-acid-free BSA\nTiming: 1 h\nBSA can accommodate and transport up to 7 fatty acids. In this assay, oleic acid is loaded on BSA in a molar ratio of 5:1 to mimic a pathologic condition.8[href=https://www.wicell.org#bib7]\nPrepare a 50 mM sodium oleate solution.\nPrepare a NaOH 0.1 M solution by dissolving 0.2 g NaOH in 50 mL ultrapure water. Filter the solution with a 0.22 μm pore filter.\nDissolve 15.7 μL OA (equivalent to 0.014 g OA; ρ=0.89 g/mL) in 1 mL NaOH 0.1 M to obtain a final concentration of 50 mM OA. Mix in a 1.5 mL Eppendorf at 70°C while shaking until OA is dissolved (a few seconds until no oily phase remains at the surface).\nTransfer the solution to a glass vial, overlay with an inert gas (argon or nitrogen) and store at −20°C until use.\nCritical: Oleic acid and the sodium oleate stock solution must be kept in glass vials under an inert gas atmosphere to prevent lipid oxidation.\nNote: The sodium oleate solution should be thawed at 20°C–25°C for 15–20 min before use. If an oily phase appears at the surface, it should be briefly vortexed to homogenise.\nPrepare a 10% fatty acid-free BSA solution.",
    "Dissolve 1 g BSA in 10 mL phosphate-buffered saline (PBS) and mix well until the solution is clear.\nSterilise the solution by filtering it through a 0.22 μm filter.\nNote: Add PBS and BSA in this order for better and faster solubilisation.\nLoad the OA on fatty acid-free BSA.\nMix 0.2 mL sodium oleate solution with 1.2 mL 10% fatty acid-free BSA at 37°C for 15 min in a 2 mL Eppendorf, while shaking at 600 rpm.\nAdd 0.6 mL PBS for a final concentration of 5 mM OA.\nFilter the solution with a 0.22 μm filter under a sterile hood used for cell culture purposes and store it at 4°C for up to one month.\nLipid droplet induction and lipoprotein particle formation in astrocytes\nTiming: 5 days\nThis step describes the treatment of astrocytes with OA-BSA 5:1, which leads to cellular triacylglycerol accumulation and lipid droplet formation. After chronic exposure, astrocytes reroute stored triacylglycerol to secretion on ApoE-containing lipoprotein particles (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig4.jpg\nFigure 4. ApoE-containing lipoprotein particle formation in cellulo\nCCF-STTG1 astrocytes are plated in a 150 cm2 flask and a 35 mm Petri dish in media containing FBS for 24 h. After extensive washing, OA-BSA 5:1 is added in FBS-free media for 72 h to induce chronic accumulation of lipid droplets. The cell supernatant containing lipoprotein particles formed by ApoE is collected from the 150 cm2 flask and centrifuged to remove the cell debris. Live-cell imaging is performed on cells in the 35 mm Petri dish that are stained with LipidSpot 610 (lipid droplets) and Hoechst 33342 (nuclei). Created with BioRender.com[href=http://BioRender.com].\nPlate CCF-STTG1 cells at 0.026 million cells/cm2 in media containing fetal bovine serum (FBS) for 24 h in a 150 cm2 flask and in a 35 mm Petri dish for microscopy, to allow cell adherence.",
    "Induce chronic lipid droplet formation for 72 h. Wash the cells thoroughly and treat them with 1.7 mL OA-BSA 5:1 solution in 32.3 mL media without additives for the 150 cm2 flask or 100 μL OA-BSA 5:1 solution in 1.9 mL media for the 35 mm Petri dish. This will lead to a final OA concentration of 250 μM.\nCollect the conditioned media and visualise lipid droplet formation.\nCollect the conditioned media from the 150 cm2 flask. Remove the cell debris by centrifugation at 18,400 × g for 10 min at 4°C and store the supernatant at 4°C.\nPerform live-cell imaging on the astrocytes in the 35 mm Petri dish. Wash the cells extensively and incubate them in serum-free media for 30 min with 1:1000 LipidSpot 610 and 1 μM Hoechst 33342 at 37°C before imaging.\nIsolation of lipoprotein particles formed in cellulo by immunoprecipitation\nTiming: 1 day\nLipoprotein particles are isolated by immunoprecipitation from the cellular secretome in a detergent-free environment. This assay is particularly useful to characterise the lipid cargo of the particles.\nCouple the biotinylated anti-ApoE antibody with streptavidin-agarose beads (Figure 5[href=https://www.wicell.org#fig5]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig5.jpg\nFigure 5. Immunoprecipitation of ApoE-containing lipoprotein particles\n(A) Conjugation of streptavidin beads with biotinylated anti-ApoE antibody. Streptavidin-coated agarose beads are washed four times and resuspended in PBS. They are incubated with a biotinylated anti-ApoE antibody for two hours on a rotating wheel. The final anti-ApoE antibody-coupled beads are washed three times and resuspended in PBS.\n(B) Cell supernatant concentration. Cell supernatant containing lipoprotein particles formed by ApoE is concentrated in an ultracentrifugation device.",
    "(C) Isolation of ApoE-containing lipoprotein particles. Anti-ApoE antibody-coupled beads (A) are incubated with concentrated cell supernatant (B) for 12–20 h under rotation at 4°C. The beads are washed four times and should contain the lipoprotein particles formed by ApoE. Created with BioRender.com[href=http://BioRender.com].\nWash the streptavidin-agarose beads slurry.\nPipette 200 μL slurry/condition in an Eppendorf tube and wash the beads 4× with 500 μL cold PBS.\nCentrifuge the tubes at 1,000 × g for 2 min at 4°C and discard the supernatants between washes.\nResuspend the beads in PBS to the slurry starting volume (200 μL).\nIncubate the beads slurry with 20 μg anti-ApoE antibody for 2 h at 20°C–25°C on a rotating wheel.\nWash the antibody-coupled beads 3× with 500 μL cold PBS to remove the unbound antibody and store at 4°C.\nCritical: For lipidomic analysis of the lipoprotein particles, it is important to not use any detergents during the immunoprecipitation process.\nNote: Cut the tip diagonally off the pipette tips to pipette the beads slurry.\nConcentrate the cell supernatant on a 10 kDa cut-off ultracentrifugation device to approximately 1 mL final volume (Figure 5[href=https://www.wicell.org#fig5]B).\nImmunoprecipitate the ApoE-containing lipoprotein particles (Figure 5[href=https://www.wicell.org#fig5]C).\nNote: Use a specific method to detect the amount of immunoprecipitated bait protein. For example, for ApoE we use a commercial ELISA kit (see key resources table[href=https://www.wicell.org#key-resources-table]). Typically, we immunoprecipitate 90 ng (normal protein secretion) to 1.5 μg ApoE (under specific pharmacological induction with TO901317) from 34 mL of CCF-STTG1 cells conditioned media.\nIncubate the concentrated supernatant with the antibody-coupled beads for 12–20 h at 4°C on a rotating wheel.\nCentrifuge the tube at 1,000 × g for 2 min at 4°C and keep the flow-through.\nWash the beads 4× with 1 mL cold PBS.",
    "Critical: Analyse in parallel a control antibody-coupled beads sample (processed in similar conditions) to assess the presence of potential lipid contaminants.\nPart 3. Lipid analysis of the in cellulo-generated lipoprotein particles\nTiming: 1 day\nHere we describe an example of lipid extraction and analysis for in cellulo-generated lipoprotein particles, but the protocol could also be adapted to the analysis of in vitro lipoprotein particles or particles coming from other sources.\nLipid extraction of in cellulo-generated lipoprotein particles\nTiming: 1/2 day\nThe lipids carried by the lipoprotein particles were isolated by organic solvent extraction using a modified Bligh and Dyer protocol9[href=https://www.wicell.org#bib8] (Figure 6[href=https://www.wicell.org#fig6]). Prepare 3 Wheaton tubes for lipid extraction per sample.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig6.jpg\nFigure 6. Lipid extraction using a Bligh and Dyer protocol\nA methanol:chloroform 2:1 (v/v) solution is added in a first Wheaton tube (1), followed by the beads slurry containing lipoprotein particles formed by ApoE obtained in Figure 4[href=https://www.wicell.org#fig4]C, resuspended in water. Chloroform and water are added, followed by thorough vortexing after each addition. Tube (1) is centrifuged and the lower (organic) phase is transferred into tube (2) and is topped up with chloroform and water. The upper (aqueous) phase remaining in tube (1) is reextracted with chloroform. Tubes (1) and (2) are vortexed and centrifuged to allow phase separation. The lower phase from tube (2) is transferred to a final tube (3). The upper phase from tube (2) is mixed with the lower phase from tube (1). After vortexing and centrifugation, the lower phase is transferred to tube (3). The solvents from tube (3), containing the total lipid extract, are evaporated. Dried lipids are resuspended in a small volume of chloroform:methanol:water 20:9:1 (v/v/v) to obtain the concentrated lipid extract. Created with BioRender.com[href=http://BioRender.com].",
    "Critical: Use glassware for lipid extraction and Hamilton glass syringes for pipetting, because plastic accessories are degraded by organic solvents.\nAdd 3.8 mL methanol:chloroform 2:1 (v/v) to a Wheaton tube no. 1.\nResuspend 180 μL beads slurry in 820 μL ultrapure water and transfer the suspension in tube no. 1. Vortex thoroughly.\nAdd 1 mL chloroform and 1 mL water in tube no. 1, followed by vortexing thoroughly after each addition. Centrifuge the tube at 900 × g, 2 min, at 4°C in a swinging bucket rotor.\nNote: The agarose beads will remain at the interface between the two liquid phases.\nTransfer the lower phase in a Wheaton tube no. 2.\nAdd 1 mL chloroform and 1 mL water in tube no. 2, followed by vortexing thoroughly after each addition.\nAdd 1 mL chloroform to the remaining solution in tube no. 1 and vortex thoroughly.\nCentrifuge tubes no. 1 and no. 2 at 900 × g, 2 min, at 4°C in a swinging bucket rotor.\nTransfer the lower phase of tube no. 2 to a final Wheaton tube no. 3.\nTransfer the lower phase of tube no. 1 to the remaining solution in tube no. 2. Vortex thoroughly and centrifuge tube no. 2 at 900 × g, 2 min, at 4°C in a swinging bucket rotor.\nTransfer the lower phase of tube no. 2 to tube no. 3.\nEvaporate the organic solvents from tube no. 3 under vacuum at 20°C–25°C or under a stream of nitrogen.\nNote: The lipid film remaining after solvent evaporation is transparent (Figure 1[href=https://www.wicell.org#fig1]B). If white precipitates or impurities are present, repeat the extraction steps 43–53.\nResuspend dried lipids in 100 μL chloroform:methanol:water 20:9:1 (v/v/v) and overlay them with an inert gas.",
    "Note: The resuspension solvent mix should be chosen based on the solubility of the lipid of interest. Chloroform:methanol:water 20:9:1 (v/v/v) solvent mix is allowing the solubilization of both polar and non-polar lipids.\nLipid analysis of lipoprotein particles by HPTLC\nTiming: 1/2 day\nThe concentrated lipid extract is separated by HPTLC. This allows the separation of the different lipid classes and their identification and quantification based on known standards.\nLipid spotting on an HPTLC plate (Figure 7[href=https://www.wicell.org#fig7]A, Methods video S4[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2197-Fig7.jpg\nFigure 7. Lipid separation and detection by HPTLC\n(A) HPTLC plate preparation and automated lipid spotting. The HPTLC plate is prewashed with an excess of chloroform:methanol 1:1 (v/v) and dried briefly. The plate is placed in the automated HPTLC sampler (CAMAG ATS4) and lipid extracts and standards are spotted.\n(B) Lipid separation. The HPTLC plate from (A) is developed in a first solvent system (chloroform:methanol:ammonium hydroxide 65:25:4 (v/v/v)) for 5 cm and dried briefly. Next, the plate is developed in the second solvent system (hexane:diethyl ether:acetic acid 80:20:2 (v/v/v)) that is left to migrate for 9 cm. Finally, the plate is dried under vacuum for 30 min at 20°C–25°C. Note: The first solvent system separates hydrophilic lipids like phospholipids (black spots) and the second solvent system separates hydrophobic lipid species like cholesterol, triacylglycerols and cholesteryl esters (blue spots). At this step, lipids are not visible - the dots were represented in the scheme to depict the lipid separation pattern.",
    "(C) Lipid revelation. After lipid separation, the HPTLC plate is stained with a CuSO4 staining solution for 1 min. The excess solution is decanted and the plate is dried under vacuum for 15 min at 20°C–25°C. Lipids are charred at 145°C for 7.5 min and the plate is visualised in visible light or fluorescence at 488 nm or 546 nm. See also Methods video S4[href=https://www.wicell.org#mmc4]. Created with BioRender.com[href=http://BioRender.com].\nPre-wash the HPTLC plate by covering it with chloroform:methanol 1:1 (v/v). Remove the solvent excess and let it air dry.\nSpot 20 μL lipid extract or the corresponding lipid standards using an automated HPTLC sampler (CAMAG ATS 4).\nAlternatives: The lipids can alternatively also be spotted on the TLC plate by hand with a Hamilton syringe. Make sure that all samples are spotted on a line so that the migration of the lipids is not shifted between samples.\n    Your browser does not support HTML5 video.\n  \nMethods video S4. Lipid analysis by HPTLC, related to steps 55–57\nMark the development guides at 5 cm and 9 cm from the bottom of the HPTLC plate. Pre-wash the plate by covering it with chloroform:methanol 1:1 (v/v). Remove the solvent excess and let it air dry. Spot the lipids using an automated HPTLC sampler. After lipid spotting, remove the plate from the sampler and develop it in the first solvent system for 5 cm. Dry the plate briefly at air and develop in the second solvent system for 9 cm. Stain the plate with a CuSO4 solution by pouring it on the plate, decant the excess after 1 min and heat it at 145°C to reveal the lipid spots.\nHPTLC plate development (Figure 7[href=https://www.wicell.org#fig7]B, Methods video S4[href=https://www.wicell.org#mmc4]).\nDevelop the plate in the first solvent system, chloroform:methanol:ammonium hydroxide 65:25:4 (v/v/v), for 5 cm and dry it briefly.",
    "Re-develop the plate in the second solvent system, hexane:diethyl ether:acetic acid 80:20:2 (v/v/v), for 9 cm.\nDry the plate under vacuum for 30 min at 20°C–25°C.\nNote: Prepare the solvent systems beforehand and let air within the chamber saturated for 30 min.\nLipid revelation.\nPrepare a CuSO4 staining solution.\nDissolve 5 g of CuSO4 in 40 mL water.\nFilter the solution with a 0.22 μm filter.\nAdd 4.7 mL of 85% ortho-phosphoric acid and fill up to 50 mL with water.\nNote: Prepare the staining solution freshly before use.\nPour 10 mL of the staining solution on the HPTLC plate and incubate for 1 min (Figure 7[href=https://www.wicell.org#fig7]C, Methods video S4[href=https://www.wicell.org#mmc4]).\nDecant the staining solution excess and dry the plate in the vacuum chamber for 15 min.\nThe lipids are charred at 145°C for 7.5 min.\nNote: As oven characteristics might slightly differ, it is important to adapt the lipid charring time to the best lipid visualisation.\nThe plate is visualised in visible light and at 488 nm using a ChemiDoc MP (Bio-Rad) imaging system."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}