{
  "id": 19070,
  "origin_website": "Jove",
  "title": "Stereotactic Intracranial Implantation and In vivo Bioluminescent Imaging of Tumor Xenografts in a Mouse Model System of Glioblastoma Multiforme",
  "procedures": [
    "A. Pre-Operative Tumor Cell Preparation\nTransduce U251 glioblastoma multiforme cells with a lentiviral expression vector (pGreenFire, System Biosciences) to stably express the firefly luciferase gene.\nThese cells were grown in 10 ml of complete Dulbecco's Modification of Eagle's medium (DMEM), which consists of DMEM supplemented with 10% fetal calf serum, 1% penicillin-streptomycin, and 1% nonessential amino acids in a T75 tissue culture flask incubating at 5% C02 and 37 °C.\nPerform standard cell culture, beginning with washing the cells with phosphate buffered saline (PBS) followed by trypsinizing.\nQuench the trypsin with complete DMEM, transfer the solution to a 50 ml conical flask and determine the cellular concentration using the Coulter Counter.\nCentrifuge the harvested cells in complete DMEM for 3 min at approximately 3,000 revolutions per minute.\nAfter centrifugation, aspirate off the media leaving only a pellet of cells at the bottom of the 50 ml conical flask.\nWorking quickly to prevent the cells from drying out, re-suspend the cells in a volume of fresh complete DMEM to achieve the desired concentration of 50,000 cells/μl and transfer to a 2 ml sterile vial placed on ice.\nCells on ice should be briefly vortexed on a low setting every ~20 min to prevent cell adhesion. Cells can be safely used for intracranial implantations up to two hours after placement on ice.\nB. Orthotopic Xenograft Implantation\nWeigh nude athymic NCr mouse (nu/nu) to establish a baseline, pre-implantation weight. We usually select mice 6-10 weeks of age with weights between 17 and 24 grams.\n1 hr prior to implantation, pre-medicate the mouse with 5 mg/kg of the non-steroidal anti-inflammatory drug meloxicam via subcutaneous injection as a treatment for post-operative pain and inflammation.\nAnesthetize the animal with an intraperitoneal injection of a ketamine/xylazine mixture at a dose of 140 mg/kg and 10 mg/kg respectively.",
    "Confirm that the mouse is sufficiently anesthetized by assessing the animal's spontaneous response to a toe pinch. If the animal responds to the toe pinch, delay the procedure until the anesthesia can take effect or consider injecting additional anesthesia (<25% of the original amount).\nPrepare the anesthetized mouse for positioning in the Stoelting Digital Just for Mouse Stereotactic platform (Stoelting Inc.) by hooking the mouse's incisor teeth in the bite bar of the snout restrainer and tightening the nose clamp over the snout while ensuring that the mouse's head is on a level plane.\nTransfer the restrained mouse to the Stoelting stereotactic platform, adjusting the positioning of the animal so that the tips of the ear bars are at the caudal end of the ear canal. Once the animal's cranial-to-caudal positioning has been adjusted, secure the bite bar to the stereotactic frame. The mouse should be resting on a firm plastic heating plate (Harvard Apparatus) secured with tape to the Stoelting platform to provide feedback-controlled temperature regulation during the surgery.\nAdjust the height of the ear bars as necessary and then advance the ear bars into the caudal portion of the ear canal, securing them such that the mouse's head is in a level plane and immobilized on finger touch. Monitor carefully for signs of respiratory distress after placement of the ear bars. Loosen and re-position if the animal is in distress.\nInsert the lubricated tip of a rectal temperature probe connected to the TCAT-2DF Temperature Controller (Harvard Apparatus) to monitor the animal's temperature and to provide feedback control to the heating plate positioned underneath the mouse to maintain the animal's body temperature at 36 °C during the procedure.\nApply ophthalmic ointment to the eyes to prevent drying.",
    "Apply betadine solution to the top of the mouse's head to disinfect the incision site, taking care to avoid the eyes.\nPerform a toe pinch to confirm the mouse is unconscious, delivering a small amount of additional ketamine/xylazine (<25% of the initial dose) if necessary.\nClean the 0.45 mm burr drill bit (Stoelting) attached to the drill (Foredom Microdrill) using an alcohol pad and then sterilize the drill bit in a glass bead sterilizer (Germinator 500, CellPoint Scientific) for 15 sec, immersing only the drill bit into the sterilizer beads.\nUsing a sterile scalpel, make a 0.75 cm incision longitudinally in the mid-scalp extending from the level of the eyes caudally. Confirm visualization of the bregma.\nAttach the drill holder to the Stoelting platform and place a drill (Foredom Microdrill) with a 0.45 mm burr drill bit (Stoelting) in the drill holder, securing it in position.\nPlace the drill bit exactly over the bregma and then zero-out the x, y, z coordinates of the digital stereotactic display. Move the tip of the drill to a position 2 mm posterior and 1.5 mm lateral to the bregma in the right cerebral hemisphere and drill into the animal's skull with the Foredom drill, piercing only the bone. A sterile cotton swab can be used to gently retract the edges of the incision to facilitate visualization of the skull.\nRemove the drill and the drill holder from the stereotactic platform.\nAttach the Nanomite injector syringe pump (Harvard Apparatus) to the stereotactic platform.",
    "Remove the cells from ice and either gently vortex the vial containing the tumor cells with brief pulses or gently flick the vial to re-suspend the cells. Draw up 7 μl of the cell suspension through a 30 gauge 1\" long flat bevel needle attached to a 10 μl syringe (Hamilton Syringe). Avoid large air bubbles in the syringe. Ensure there are no air bubbles in the initial 6 μl of fluid which will be the total volume injected into the mouse. Small air bubbles in the remaining 1 μl are of no concern. Avoid repeated draw-ups of the cell suspension if possible to minimize damage to the cells.\nPosition the loaded syringe into the syringe injector. Using an alcohol pad, remove any of the cell suspension fluid that appears at the tip of the needle to prevent contamination of the incision site with cancer cells which may result in tumor growing in the extracranial space.\nSet the injector pump to deliver 6.0 μl at a rate of 0.5 μl/min. The 1 μl of cell suspension remaining in the syringe after implantation ensures that the air bubbles that frequently collect in the syringe are not injected into the animal. Injection of air bubbles could result in a fatal air embolism.",
    "Advance the syringe needle into the burr hole maintaining the needle perpendicular (90 degrees) to the skull. Once the needle has traversed the skull, zero out the coordinates on the stereotactic digital display and then slowly advance the tip of the needle over a period of 4 min until it reaches a depth of 2.5 mm. The needle passes through the cortex and portions of the posterior hippocampus. The x,y,z coordinates for stereotactic implantation were chosen to generate a laterally positioned tumor within the cerebral hemisphere while avoiding injury to critical brain structures such as the thalamus and proximity to the ventricles thus reducing the likelihood of seeding the cerebrospinal fluid with tumor cells that may give rise to undesirable spinal tumors. A posterior location relative to the bregma was selected to reduce the likelihood of a large, locally advanced tumor ulcerating into the orbit. Pause with the needle at depth for 2 min and then initiate implantation of cells.\nDuring implantation, dry the skull repeatedly with a microsurgical sponge spear to remove any tumor-containing fluid that may have refluxed out of the burr hole during implantation. Avoid disrupting the needle with the microsurgical sponge. Removing this fluid should reduce the likelihood of tumor growing in the extracranial space.\nAfter injection is complete, leave the needle in the brain for approximately 2 min and then slowly withdraw the needle over a period of 3-4 min.\nLoosen the ear bars and snout restrainer and remove the mouse from the stereotactic apparatus.",
    "Close the burr hole in the skull with sterile bone wax deposited by rubbing wax back and forth across the burr hole from the wooden end of a sterile cotton-tipped applicator. Continue applying bone wax until the hole is completely sealed and the bone wax sealing the burr hole is flush with the adjacent skull.\nRe-approximate the edges of the incision with sterile cotton swabs and apply veterinary tissue glue to seal the wound, taking care to avoid glue exposure to the animal's eyes.\nFinally, place the mouse on a heating pad set to 37 °C until the animal recovers consciousness. Transfer the animal back to its original cage once the mouse is alert and responsive.\nC. Bioluminescent Imaging (BLI) to Monitor Tumor Growth and Response to Therapy\nBrief instructions follow for bioluminescent imaging.\nAnesthetize mice previously implanted with tumor in a chamber with 2% isoflurane and oxygen.\nWhile the mice are anesthetized, inject them either subcutaneously or intraperitoneally with 60 μl of D-luciferin potassium salt diluted in PBS to a concentration of 50 mg/ml.\nTurn on the flow of anesthesia to the nose cones in the bioluminescent imaging scanner and quickly transfer the mice to the scanner placing their snouts in the nose cones.\nPosition black dividers between the mice to limit the bleeding of bioluminescent signal from a tumor with high signal intensity to an adjacent tumor with much lower signal.\nUsing the Living Image software, take frequent serial exposures for a total duration of up to 30 min after the time of injection of D-luciferin. We favor setting the Exposure time to \"Auto\" to limit the likelihood of an under or over-exposed image. No single exposure should be >5 min.",
    "Perform repeat bioluminescent imaging at appropriate intervals. Serial weekly imaging is a reasonable option for many longitudinal experiments testing response to treatment.\nAfter acquisition of images, use the Living Image software program to analyze tumors by drawing a region of interest (ROI) around each tumor in each image acquired during the bioluminescent imaging session. Apply a second, smaller region of interest to the lower flank of each mouse in each image as a background region of interest to correct the bioluminescent signal of the tumor based on the degree of background bioluminescent signal intensity. We prefer using the \"Radiance\" setting rather than \"Counts\" as the output values for bioluminescent signal.\nExport the ROI results into Excel and determine the maximum background-adjusted bioluminescent signal for each mouse.\nRepeat bioluminescent imaging as indicated for serial monitoring of tumor growth. In our experiments, we perform weekly BLI. We prefer determining the maximal BLI signal for a given imaging session by taking frequent exposures over 5 - 30 min after injection of D-luciferin.\nD. Representative Results\nThis stereotactic implantation technique is associated with a successful tumor-take rate of 90-100% and with low perioperative mortality that is usually less than 5%. The risk of unintended side effects is also low with this technique, including such complications as seeding of the spinal cord from tumor cells implanted into the ventricles, or extracranial tumor growth from either seeding of the incision with tumor cells or inadequate closure of the burr hole allowing intracranial tumor to expand through the opening in the skull.\nEx vivo analysis of tumor xenografts demonstrated expected areas of hypoxia, increased VEGF expression, and necrosis. Fluorescent microscopy for green fluorescent protein (GFP) stably expressed by our GBM cell line revealed the infiltrative nature of these xenografts.",
    "Figure 1 shows the results of a typical successful stereotactic implantation of GBM cells into the brain of a mouse. This is a T2-weighted brain MRI scan of a mouse brain performed with a 9.4 Tesla magnet 21 days after implantation with the technique described here. Figure 1 reveals a single focus of tumor in the right hemisphere (contoured in pink) measuring 19 mm3 that localizes to the precise coordinates of the implantation site.\nFigure 2 shows the results of bioluminescent imaging using the techniques described here for a group of 10 mice with stereotactically implanted tumors who were evenly stratified based on maximum bioluminescent signal intensity to receive either cranial irradiation (4 Gy x 4 daily fractions) or no treatment at all. In this experiment, bioluminescent imaging shows that radiation therapy inhibits proliferation of the implanted tumors, resulting in no increase in the detected bioluminescent signal, whereas the signal substantially increases in mock-irradiated control tumors, due to unchecked proliferation of the cancer cells.\nFigure 1 (Video). Coronal MRI sections of a mouse brain containing a U251 glioblastoma multiforme tumor with contouring of the tumor volume (in pink). The scan was performed using a spin echo T2 weighted protocol on a 9.4 Tesla scanner.  Click here to view movie[href=http://www.jove.com/files/ftp_upload/4089/4089movie1.m4v].\nimgsrc://cloudfront.jove.com/files/ftp_upload/4089/4089fig2.jpg\nFigure 2. 10 mice with stereotactically implanted glioblastoma multiforme tumors were treated with either external beam radiation therapy to 16 Gy in 4 fractions or no treatment. Mice were imaged with bioluminescent imaging prior to treatment and weekly after the start of treatment. The graph presents relative bioluminescence calculated as median fold change where fold change is defined as the ratio of current maximal BLI value to pre-treatment maximal BLI value.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}