{
  "id": 3264,
  "origin_website": "Cell",
  "title": "A histological protocol for quantifying the birthrates of specific subtypes of olfactory sensory neurons in mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCombined RNA-FISH and EdU staining\nTiming: 3–5 days\n      The following is a detailed protocol for the simultaneous detection of\n      subtype-specific OR mRNA transcripts, via FISH, and EdU\n      incorporated into the genomic DNA of birthdated cells\n      via click-chemical conjugation of a fluorophore. This protocol\n      enables the identification of OSNs of specific subtypes born at defined\n      times. Using appropriate tissues and riboprobes, it can be applied to the\n      study of the birthrates and/or survival rates of OSNs of essentially any\n      subtype and how they change as a function of experience.\n    \nNote: Steps of this protocol involving the\n      transfer of slides from one solution to another can be performed either by\n      decanting the solution from the slide submersion chamber and adding new\n      solution, or by moving the slides to a different submersion chamber\n      containing new solution. Steps involving the transfer of slides from the\n      submersion chamber to the humidified horizontal slide chamber should be\n      done with care to avoid drying of tissue sections. For these steps, we\n      recommend removing one slide at a time, gently tapping an edge of the\n      slide on a paper towel to remove excess wash solution, wiping the bottom\n      and side edges of the slide on a dry paper towel, placing the slide into\n      the horizontal chamber, carefully adding the required solution dropwise to\n      cover all sections on the slide as evenly as possible, and, If applicable,\n      placing a #1 coverslip on the slide by gently letting it fall onto the\n      solution starting from the bottom edge. After all slides have been\n      processed, the chamber should be closed. The steps involved in detection\n      of FISH riboprobes were adapted and from the\n      TSA Plus Fluorescence Kits manual[href=https://my.akoyabio.com/resource/1567171833000/Akoya_Manuals/TSA_Plus_Fluorescence_Manual_Allkits-min.pdf].\n    \n        Re-hydrate OE tissue sections.\n        \n            Transfer slides from the –80°C freezer to an open horizontal slide\n            chamber.",
    "Incubate slides: 5 min, 37°C.\n            Equilibrate slides in 1× PBS (pH 7.2) in a slide submersion chamber:\n            3 min, 22°C–26°C.\n          \nCritical: For this step, do not allow\n      slides to exceed 3 min in 1× PBS, as this may result in the diffusion of\n      mRNA transcripts out of the unfixed sections and a reduced FISH signal\n      intensity.\n    \n        Fix and permeabilize tissue sections.\n        \n            Immerse slides in fix solution: 10 min, 22°C–26°C.\n            \nCritical: All steps involving\n              fix solution should be performed in a fume hood with appropriate\n              personal protective equipment.\n            \nWash slides in 1× PBS: 3 min, 22°C–26°C.\n            Immerse slides in 0.5% Triton X-100 in 1× PBS: 10 min, 22°C–26°C.\n          \nWash slides in 1× PBS: 3 min, 22°C–26°C.\nImmerse slides in 1% SDS in 1× PBS: 3 min, 22°C–26°C.\nWash slides in 1× PBS: 3 × 3 min, 22°C–26°C.\n            Immerse slides in acetylation solution: 10 min, 22°C–26°C.\n            \nCritical: Steps involving\n              acetylation solution should be performed in a fume hood with\n              appropriate personal protective equipment.\n            \nWash slides in 1× PBS: 5 × 3 min, 22°C–26°C.\n        Prepare tissues for FISH riboprobe hybridization.\n        \n            Transfer slides to a horizontal slide chamber humidified with 5× SSC\n            (see step 28 in the “before you begin[href=https://www.wicell.org#before-you-begin]” section).\n          \n            Pre-hybridize tissues by applying 500 μL of hybridization solution\n            to each slide.\n          \nCover horizontal chamber.\nIncubate slides: 30 min, 22°C–26°C.\n        Prepare FISH riboprobe for hybridization.\n        \n            Dilute the stock FISH riboprobe to a concentration of 1.3–2.6 ng/μL\n            (typically, 1:750) in hybridization solution and mix thoroughly by\n            vortexing.\n          \n            Denature the diluted riboprobe: 2.5 min, 95°C, then place\n            immediately on ice.\n          \n        Hybridize FISH riboprobe to OR-specific mRNAs in OE tissue sections.\n        \nDecant hybridization solution from slides.\n            Apply 115 μL of the diluted riboprobe to each slide and cover with a\n            #1 coverslip.\n            \nNote: The riboprobe concentration\n              may require adjustment to optimize the signal-to-noise ratio. If",
    "FISH signals are reproducibly weak and background is low, raising\n              the probe concentration by 1.5–2-fold is recommended. In cases in\n              which background is high, reducing probe concentration by\n              1.5–2-fold is recommended. For more information, see\n              troubleshooting[href=https://www.wicell.org#troubleshooting],\n              problem 6[href=https://www.wicell.org#sec7.11].\n            \nCritical: We recommend that\n              gloves be changed when switching between different riboprobes to\n              avoid cross-contamination.\n            \n            Carefully transfer coverslipped slides to a hybridization chamber\n            humidified with 50% formamide in 5× SSC (see step 29 in the “before you begin[href=https://www.wicell.org#before-you-begin]” section).\n            \nNote: With the chamber standing\n              on-end vertically, slides should be placed into the chamber like\n              shelves in a bookcase.\n            \n            Carefully seal the chamber using tape with a thermosetting rubber\n            adhesive.\n          \n            Carefully place the sealed hybridization chamber vertically inside\n            the pre-heated hybridization oven.\n          \nIncubate slides: 12–16 h, 65°C.\n            Allow coverslips to detach from slides by immersing coverslipped\n            slides in prewarmed (65°C) 5× SSC in a slide submersion chamber.\n          \n            Rinse slides in 0.2× SSC: 15 s, 22°C–26°C.\n            \nNote: 0.2× SSC can be kept at 65°C\n              between washes by storing in the 65°C hybridization oven.\n            \nWash slides in 0.2× SSC: 4 × 20 min, 65°C.\nWash slides in 0.2× SSC: 5 min, 22°C–26°C.\nWash slides in TN: 5 min, 22°C–26°C.\n        Prepare tissues for detection of FISH riboprobes.\n        \n            Quench endogenous peroxidases by incubating slides in freshly\n            prepared 3% hydrogen peroxide in TN: 10 min, 22°C–26°C.\n          \nRinse slides in TNT: 15 s, 22°C–26°C.\n            Wash slides in TNT: 5 × 3 min, 22°C–26°C with gentle rocking (70\n            RPM).\n          \n            Processing slides one-at-a-time, transfer each to a horizontal\n            chamber humidified with TN and apply 500 μL TNB.\n          \n            Cover horizontal chamber and incubate slides: 30 min, 22°C–26°C.\n          \n            Processing slides one-at-a-time, remove each slide from the\n            horizontal chamber, drain TNB, place slide back into the horizontal\n            chamber, and apply 500 μL of anti-DIG-POD antibody in TNB.",
    "Cover horizontal chamber and place on a level surface: 12–16 h, 4°C.\n          \n            Decant antibody solution and rinse slides in TNT: 15 s, 22°C–26°C.\n          \n            Wash slides in TNT: 4 × 15 min, 22°C–26°C, with gentle shaking (70\n            RPM).\n          \n        Generate fluorescent signals corresponding to OR mRNA.\n        \n            Processing slides one-at-a-time, transfer each to a horizontal\n            chamber humidified with TN.\n          \nApply 200 μL of TSA Plus Fluorescein working solution.\n            Cover horizontal chamber and incubate slides: 12 min, 22°C–26°C.\n            \nNote: If processing multiple\n              slides, stagger reaction start and end times by 30–40 s so that\n              all slides have the same reaction time.\n            \n            Wash slides in TNT: 2 × 5 min, 22°C–26°C with gentle shaking (70\n            RPM).\n          \n        Generate fluorescent signals corresponding to EdU.\n        \n            Wash slides in BSA wash buffer: 2 × 5 min, 22°C–26°C, with gentle\n            rocking (70 RPM).\n          \n            Processing slides one-at-a-time, transfer each to a horizontal\n            chamber humidified with 1× PBS.\n          \nApply 500 μL of click chemistry reaction cocktail.\n            Cover horizontal chamber and incubate slides: 30 min, 22°C–26°C.\n          \nRinse slides in BSA wash buffer: 2 × 15 s, 22°C–26°C.\n            Wash slides in TNT: 2 × 5 min, 22°C–26°C, with gentle shaking (70\n            RPM).\n          \n            Counterstain nuclei by immersing in DAPI solution: 5 min, 22°C–26°C.\n          \n            Wash slides in TNT: 2 × 3 min, 22°C–26°C, with gentle shaking (70\n            RPM).\n          \n            Processing slides one-at-a-time, transfer each to a horizontal\n            chamber.\n          \nApply 50 μL of Vectashield dropwise around tissue sections.\nCover with a #1.5 coverslip.\nSeal all edges with clear nail polish.\nAllow to dry for at least 20 min before imaging.\nAlternatives: For detecting the\n      signals of OR-specific mRNAs and EdU, we typically use FITC and Cy3\n      fluorophores, respectively. Alternative reagents with compatible\n      excitation/emission spectra may be used.\n    \nPause point: Sealed slides can be\n      stored at 4°C for up to 1 month before imaging.\n    \n        Acquire images.",
    "Note: For imaging we use the Zeiss LSM\n          900 Airyscan confocal microscope with a 10× objective and the ZEN\n          software application.\n        \n            Open the “ZEN” software application, select the \"Locate\"\n            tab and choose \"Eyepiece\" to enable observation of the\n            slide through the microscope oculars.\n          \n            In the \"Microscope\" module on the right, select the 10×\n            objective.\n          \n            Clean the slide with ultrapure water and place it on the stage.\n          \n            On the left panel, select \"DAPI\" and focus on a tissue\n            section by viewing through the oculars.\n          \n            Assess the quality of OR mRNA and EdU signals by successively\n            observing tissue sections using the green and red channels,\n            respectively.\n            \nNote: High-quality staining is\n              indicated by the distinct and bright labeling of a subset of cells\n              located within the neuroepithelium (see\n              Figure 7[href=https://www.wicell.org#fig7]).\n            \nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2857-Fig7.jpg\n                  Figure 7. Quantification of the birthrates of OSN subtypes\n                  Or9k7 (Olfr827) and\n                  Or6b3 (Olfr1414) as a function of olfactory\n                  stimulation\n                \n                  (A) Experimental timeline. C57bl6 mice were UNO-treated at\n                  P14, EdU-injected at P28, and dissected at P32–40.\n                \n                  (B) Representative OE section from a UNO-treated and\n                  EdU-injected mouse stained for Or9k7 mRNA and EdU.\n                  Scale bars, low magnification panel: 500 μm;\n                  high magnification panels: 100 μm.\n                \n                  (C) Quantification of the frequencies of newborn\n                  Or9k7 and Or6b3 OSNs on the open and closed side\n                  of the OE. Each line represents a different mouse;\n                  error bars: SEM. P values were determined using a\n                  paired t test.\n                \n            To capture images, select the \"Acquisition\" tab and use\n            the \"Smart Setup\" option on the left side panel to\n            configure the channels corresponding to OR mRNA, EdU, and nuclear\n            DNA (typically FITC, Cy3, and DAPI, respectively).\n          \n            Check the signal intensity of each channel by selecting “Live” in\n            the “Acquisition” tab and adjust the laser power as needed.\n            \nNote: We typically use the",
    "following initial laser settings so that most of the dynamic range\n              of the detector is used and most pixels are maintained on-scale.\n              FITC (400 nm laser): 1%–3% power, master gain: 700 V; Cy3 (560 nm\n              laser): 1%–2% power, master gain: 650 V; DAPI (405 nm laser):\n              0.5%–1% power, master gain: 650 V. For all channels, the pinhole\n              is typically set to 460 μm/21.63 AU but may be reduced to enhance\n              optical resolution.\n            \n            Acquire mosaic images of stained tissue sections using tile scanning\n            (9 × 9) and stitch the mosaic images.\n            \nNote: Ensure that the focus is\n              adjusted separately for each section of the slide based on OR\n              staining (FITC). As tile scans are used for imaging, a good\n              strategy is to scroll across each section to ensure that all areas\n              are in focus.\n            \nAlternatives: Other\n              confocal or epifluorescence microscopes that are equipped with an\n              automated stage (to enable the acquisition of mosaic images) and\n              the appropriate filters (to enable the detection of the\n              appropriate fluorophores) may be used with this protocol.\n            \n        Count EdU-labeled OSNs of a specific subtype.\n        \n            Open a CZI image file using the ZEN (lite or full) software\n            application.\n            \nNote: ZEN lite, which can be\n              freely downloaded and installed on Windows computers, can be used\n              to visualize and annotate CZI files.\n            \n            From each slide, select for quantification all OE sections that have\n            highly intact and symmetrical morphologies.\n            \nNote: For analysis of mice that\n              have been manipulated via UNO, both halves of the OE\n              sections should be symmetrical and intact.\n            \nAlternatives: Other\n              imaging software applications that allow adjusting white/black\n              levels may be used for image visualization and quantification. We\n              typically use green, red, and blue pseudo-colors to visualize OR\n              mRNA, EdU, and DAPI staining, respectively (Figure 7[href=https://www.wicell.org#fig7]B), but alternative color combinations may also be used.",
    "To enhance signal visualization, adjust the gamma levels for FITC\n            (OR mRNA) and DAPI (DNA) channels to 1.5 and 0.45, respectively.\n          \n            Adjust the black levels to 2%–5% of the dynamic range for all\n            channels.\n          \n            Adjust the white levels to 12%–15% of the dynamic range for FITC (OR\n            mRNA), 14%–16% for Cy3 (EdU), and 35%–40% for DAPI (DNA).\n            \nNote: Signals corresponding to OR\n              mRNA (FITC) and EdU (Cy3) should appear as distinct, bright, round\n              cell-sized structures surrounding a DAPI-labeled nucleus within\n              the epithelial region of the OE. FITC-positive cells represent\n              OSNs of a specific subtype (green puncta in\n              Figure 7[href=https://www.wicell.org#fig7]B, top panel) and Cy3-positive cells\n              represent newly generated cells (red puncta in\n              Figure 7[href=https://www.wicell.org#fig7]B, mid panel). Cells positive for both\n              FITC and Cy3 represent newly generated OSNs of a specific subtype\n              (yellow puncta marked by white arrows in\n              Figure 7[href=https://www.wicell.org#fig7]B, bottom-left panel). For common\n              problems and solutions related to OR mRNA and EdU staining, refer\n              to troubleshooting[href=https://www.wicell.org#troubleshooting]\nproblem 6[href=https://www.wicell.org#sec7.11], 7[href=https://www.wicell.org#sec7.13], and\n              8[href=https://www.wicell.org#sec7.15].\n            \n            Count and record the number of FITC-positive cells in each half-OE\n            section to determine the abundance of all OSNs of the subtype of\n            interest.\n          \n            Count and record the number of cells positive for both FITC and Cy3\n            in the epithelial region of each half-OE section to determine the\n            abundance of newly generated OSNs of the subtype of interest.\n          \n            Repeat steps f and g for each selected section.\n            \nNote: To count a cell as a newly\n              generated OSN of a specific subtype, we require that the OR mRNA\n              staining encompass at least 50% of the pixels corresponding to an\n              EdU-labeled nucleus. This threshold is based on the expected\n              incomplete colocalization of OR mRNA, which is concentrated in the\n              cytoplasm, and EdU, which is confined to the nucleus. To minimize\n              potential bias, we recommend that quantification be performed with",
    "the investigator blinded to the identities of experimental groups."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Developmental Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}