{
  "id": 5385,
  "origin_website": "Bio",
  "title": "An HPLC-based Method to Quantify Coronatine Production by Bacteria",
  "procedures": [
    "Calibration curveCalibration curves must be created using purified COR to determine the exact concentration of COR in biological samples. Prepare five COR solutions with different concentrations (5-50 µg/ml) in 1.5 ml microfuge tubes; so that 5 µl of the solutions represents a range of COR amounts between 25-250 ng. COR is detected by HPLC at 208 nm using a C8 column (4.6 x 250 mm, 5 µm). Isocratic separations are performed using a 0.05% TFA:acetonitrile (60:40 v/v) mobile phase with a flow rate of 1 ml/min. The column temperature is set at 25 °C. Inject 5 µl aliquots of purified COR into the HPLC C8 column. Pure coronatine must produce a peak at 9.4 min.Using the chromatography data system software, integrate the area under the peak for every concentration of COR. Plot a graph of peak area versus ng of coronatine injected as shown in Figure 1. Calculate the linear equation of the trend line obtained using linear regression analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170224/20170224081527_8050.jpgFigure 1. Standard curve for 5-50 μg/ml of coronatine (COR). Purified COR was injected in different concentrations and the peak area (in arbitrary units) for each injection was quantified with the chromatography data system software. Note that the red error bars for each data point are very small and do not clearly appear in the graph.Determining bacterial production of CORFrom the glycerol stock, streak the bacterial culture on low-salt Luria Bertani (LS-LB) medium supplemented with appropriate antibiotic and incubate the medium plate at 28 °C for approximately 30 h. For example, 100 µg/ml rifampicin is used to culture COR-producing Pseudomonas syringae pv. tomato DC3000.",
    "Inoculate a small part of a single colony (just touch with tip) from this fresh plate into 10 ml of LS-LB medium with appropriate antibiotic in a 50 ml tube and incubate at 28 °C and 200 rpm. Grow until mid to late log phase is reached (OD600 of 0.8). It will take approximately 10-12 h. Check optical density (OD) at 600 nm using a spectrophotometer. Centrifuge the bacterial suspension at 2,600 x g for 20 min in 50 ml tube. Remove the supernatant and re-suspend the pellets in 10 ml of sterile water. Vortex thoroughly to wash the cells. Vortex continuously at full speed until the cells are completely re-suspended and there is no visible cell clumps. Repeat this step twice. Finally, re-suspend the total bacterial cells in 40 ml sterile water to obtain a 0.2 OD600 inoculum that corresponds to 1 x 108 cells for Pseudomonas syringae pv. tomato. The calculated approximation of the OD600 is sufficient.Transfer 1 ml from this culture to 10 ml of HSC medium in a 50 ml tube and incubate for 24 h at 18 °C and 200 rpm. More volume of culture can be used if greater concentrations of COR are required. However, 1 ml is adequate for COR detection. From 10 ml of bacterial culture, one can obtain a concentration of COR in the range of 0.5-2 µg/mg of total protein.After 24 h, transfer 0.6 ml of culture to microfuge tubes. Spin at a maximum speed (or 16,000 x g) at room temperature in a microcentrifuge for 3 min to pellet cells. Transfer 0.5 ml of supernatant to fresh microfuge tubes and store pelleted cells at -80 °C. These cells are used to estimate total protein content as described in step B14 below.",
    "To the supernatant, add 25 µl of 3 N HCl and 0.5 ml ethyl acetate to each tube. Vortex the tubes briefly for 30 sec at maximum speed. Allow phases to separate. The phases should separate out within two minutes.Transfer 0.4 ml of the ethyl acetate phase (upper layer) to a fresh microfuge tube. Repeat steps B7-B8 twice (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170224/20170224082013_0209.jpgFigure 2. Flowchart of the COR extraction. Steps for extracting COR from bacterial culture supernatant using ethyl acetate. The three ethyl acetate phases are combined in a single tube and let dry. Dried COR is dissolved in TFA:acetonitrile and this solution is now ready for injection into HPLC.Dry contents of tubes under a stream of compressed air. One method is to float tubes in a 55 °C water bath, using a Pasteur pipette to gently blow air into each tube (see Figure 3 for a representative setup). Alternatively, tubes may be left open on the bench at room temperature overnight. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170224/20170224082053_6584.jpgFigure 3. Set up for drying the contents of microfuge tubes in a water bath. After COR is extracted from bacterial culture with ethyl acetate, the ethyl acetate is evaporated by floating the tube on water bath set at 55 °C and blowing air using Pasteur pipette. Alternatively, the tubes can be left open to dry overnight.For HPLC analysis, add 250 µl of 0.05% TFA:acetonitrile (90:10 v/v) to each dry tube. Vortex each tube for 15 sec. Samples are now ready for direct injection into the HPLC system.Determine the presence of COR by HPLC using a C8 column (4.6 x 250 mm, 5 µm) with detection at 208 nm. Isocratic separations are performed using a 0.05% TFA:acetonitrile (60:40 v/v) mobile phase with a flow rate of 1 ml/min.",
    "The injection volume is 5 µl and the column temperature is set at 25 °C. Inject the unknown sample into the HPLC system. If a peak is observed at 9.4 min, determine the area under the peak. Using the peak area, apply the standard curve and linear equation to determine the ng of coronatine injected in 5 µl. Then, calculate µg/ml coronatine for the sample.The amount of COR produced can be expressed as a function of protein concentration. The cells obtained in step B6 are lysed by suspending the pellet in 1 ml of 1 N NaOH followed by boiling and freezing three times. The total protein content in bacterial cell lysates is determined with the Pierce BCA Protein Assay Kit according to manufacturer’s instructions. Express COR concentration as µg/mg protein as shown by Panchal et al., (2016)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}