{
  "id": 10754,
  "origin_website": "Jove",
  "title": "Sustained Administration of β-cell Mitogens to Intact Mouse Islets Ex Vivo Using Biodegradable Poly(lactic-co-glycolic acid) Microspheres",
  "procedures": [
    "All procedures were approved and performed in accordance with the Vanderbilt Institutional Animal Care and Use Committee.\n1. Labeling COI with Fluorophore (Optional)\nChoose a fluorescent dye that will react with a free primary amine (e.g., on a protein), such as succinimidyl esters or fluorescein derivatives, to visualize microsphere cargo. Dissolve 8x molar excess (relative to moles of COI) of fluorophore into 200 µl of dimethyl sulfoxide (DMSO).\nResuspend 50 mg of COI up to a final volume of 800 µl in a vehicle solution (final concentration of 62.5 ng/ µl). The vehicle solution will vary depending on the source of the COI.\n\tNOTE: Typical vehicle solutions include phosphate buffered saline (PBS) or DMSO.\nAdd all of the fluorophore/DMSO solution from step 1.1 and resuspend the COI. Vortex overnight at 4 °C. Alternatively, vortex the reaction mixture at room temperature (RT) for 4 hr.\nFollowing the labeling reaction, remove excess fluorophore using a desalting column.\n\t\nDrain storage buffer from desalting column and rinse with 16 ml of deionized water. Discard all flow through.\nAdd the fluorescently labeled COI to the desalting column. Elute with 1.2 ml of deionized water and collect the flow through.\nRepeat elution step an additional four times, each time adding 1.2 ml of deionized water and collecting the flow through as a separate sample.\nFreeze all collected flow through samples at -80 °C and lyophilize according to manufacturer's instructions for 24 hr.\n2. COI-loaded Microsphere Preparation via the Water-in-oil-in-water Emulsion Solvent Evaporation Method\nAdd 1 mg of fluorescently labeled COI to 100 µl of deionized water to form the first water phase (W1).",
    "Dissolve 65 mg of poly(lactic-co-glycolic acid) (50:50 Lactide:Glycolide, molecular weight 54,000 - 69,000) in 750 µl of dichloromethane in a microcentrifuge tube. Ultrasonicate for 10 - 30 sec (at 160 W) to completely dissolve the PLGA. This forms the oil phase (O).\nAdd all of the W1 phase generated in step 2.1 to the O phase in a drop-wise manner. Emulsify using a hand-held homogenizer at 20,000 rpm for 30 sec to form the W1/O phase.\nAdd all of the W1/O phase in a drop-wise manner to 15 ml of a 1% (weight/volume) aqueous poly(vinyl alcohol) (PVA) solution and emulsify using a hand-held homogenizer at 20,000 rpm for 30 sec.\nTransfer all of the emulsion generated in step 2.4 to a 200 ml round-bottom flask and subject to a 635 mm Hg vacuum using a rotary evaporator for 1 hr to remove the solvent and generate the aqueous phase.\nAliquot 1 ml of the aqueous phase generated in step 2.5 to fourteen microcentrifuge tubes. Centrifuging the aqueous solution in the microcentrifuge tubes at 7,500 x g for 8 min.\n\tNOTE: At this step, the microspheres are present in the remaining aqueous solution and are concentrated to the bottom of the microcentrifuge tube.\nCarefully remove 900 µl of aqueous solution from the microcentrifuge tubes with a micropipette, pipetting so as to not disturb the microspheres on the bottom of the microcentrifuge tube.\n\t\nWash the microspheres of excess PVA by adding 1 ml deionized water to each microcentrifuge tube. Centrifuge at 7,500 x g for 8 min, and again carefully remove 900 µl of aqueous solution from the microcentrifuge tubes with a micropipette, pipetting so as to not disturb the microspheres on the bottom of the microcentrifuge tube.\n\t\tNOTE: The remaining 100 µl aqueous solution contains the generated microspheres.",
    "Freeze the aqueous microsphere solution generated in step 2.7 at -80 °C.\nLyophilize microspheres using a lyophilizer according to manufacturer's instructions and store at -20 °C.\n\tNOTE: Measure loading efficiency of the COI by completely dissolving PLGA microspheres and determining the protein concentration relative to a standard curve of the free protein7.\nAs a negative control, generate a batch of \"blank\" microspheres (hereafter referred to as control microspheres).\n\tNOTE: The generation of control microspheres is identical to the generation of hydrophilic COI-loaded microspheres, with no COI addition to 800 µl of the vehicle solution in step 1.2. Match control particles in mass concentration of PLGA relative to COI-loaded PLGA microspheres for β-cell mitogen assay.\n3. Preparation of Islet Culture Media and Pre-assay Media\nPrepare 200 ml media for culture of intact mouse islets: RPMI 1640 media supplemented with 11 mM glucose, 10% horse serum, 100 U/ml penicillin G and 100 µg/ml streptomycin (hereafter referred to as islet culture media).\n\tNOTE 1: Unlike fetal bovine serum (FBS), horse serum lacks placental lactogen, an inducer of β-cell proliferation, which confounds analysis in the proliferation assay.\n\tNOTE 2: As the PLGA microspheres are not sterilized prior to use, the addition of antibiotics to the culture media is crucial to avoid microbiological contamination.\nRemove 25 ml of islet culture media with an electronic pipettor and place in a 50 ml conical tube. Supplement the 25 ml of islet culture media in the 50 ml conical tube with a final concentration of 0.2 mM EGTA to generate the pre-assay media.\n\tNOTE: The addition of EGTA mildly loosens cell-cell contacts in the islets without altering islet architecture. This helps ensure the COI can reach the inner cells of the islet and helps prevent necrosis of the central islet.\n4. Culturing of Intact Mouse Islets",
    "Isolate intact islets from a pre-selected strain, sex, age, and genotype of mice following a routine collagenase digestion of the pancreas8,9. Pool together islets from like samples.\nAliquot 40 islets into one well of a 96-well tissue culture plate in 200 µl of islet culture media. Visually size-match islets per well (a precise assessment of islet equivalency (IEQ) between samples is not necessary). Fill empty wells immediately adjacent to wells with islets with 200 µl sterile water to provide an evaporation buffer. Culture islets in media overnight at 37 °C under an atmosphere of 95% air and 5% CO2.\n5. Re-suspension of COI-loaded and Control PLGA Microspheres\nAfter overnight islet recovery, resuspend microspheres by adding pre-assay media to one aliquot of lyophilized COI-loaded PLGA microspheres such that the final concentration of COI in the microcentrifuge tube is 10 ng/µl (the amount of COI present in a given amount of the generated microspheres was determined in step 2.9). Sonicate the resuspended COI-loaded microspheres in an ice water bath for 10 min at 160 W with 10 sec long pulses at 4 °C.\nResuspend control PLGA microspheres by adding the same volume of pre-assay media to an equal mass of lyophilized control PLGA microspheres. Sonicate the resuspended control PLGA microspheres in an ice water bath for 10 min at 160 W with 10 sec long pulses at 4 °C.\nVisually confirm microspheres are dispersed by pipetting 2 µl of resuspended microspheres between two glass coverslips. Visualize microspheres using a 40X objective on an epifluorescence or brightfield microscope.\nIf significant aggregation of microspheres is still visible, sonicate in an ice water bath for an additional 10 min at 160 W with 10 sec long pulses at 4 °C and repeat visualization of resuspended microspheres.",
    "6. Treatment of Islets with COI-loaded or Control PLGA Microspheres\nFor each well to be treated with COI-loaded microspheres, prepare assay media by diluting the 10 ng/µl of the resuspended COI microspheres with pre-assay media to a final volume of 100 µl and a pre-determined final concentration.\n\tNOTE: The optimal final concentration of the protein will vary for each COI used for this assay. Ideally, a range of final concentrations are tested.\nFor each well to be used as a control, prepare control assay media by diluting the resuspended control PLGA microspheres generated in step 5.2 with the same dilution volume used to dilute the COI-loaded microspheres in step 6.1.\n\tNOTE: Islets treated with control assay media will serve as a negative control to enable detection of any effect the blank microspheres may have on the experimental outcomes.\nCarefully remove 100 µl of islet culture media from each well with a micropipette such that no islets are dislodged from the wells. Gently add 100 µl of assay media or 100 µl of control assay media to each well.\nIncubate islets at 37 °C under an atmosphere of 95% air and 5% CO2 for three days.\n7. Dispersing Intact Islets onto Microscope Slides\nAfter three days, use a micropipette to carefully remove and discard assay media from all wells so as not to dislodge islets. Gently add 200 µl PBS to islets to wash them of the assay media. Carefully remove and discard PBS with a micropipette and gently wash islets again with an additional 200 µl PBS.",
    "Remove and discard PBS with a micropipette and add 100 µl of 0.025% trypsin, 2 mM EDTA solution. Incubate at RT for 3 min. Pipet islets in the trypsin-EDTA solution up and down every 2 min until islets are visually confirmed to be dispersed into single cells (note that some small clumps of cells may still be present) using a light microscope. Transfer the entire volume of each well individually into labeled- microcentrifuge tubes.\nAdd 400 µl of islet culture media to each microcentrifuge tube to stop the trypsin-mediated cell dissociation.\nCentrifuge samples for 5 min at 100 x g at 4 °C to pellet islet cells to the bottom of microcentrifuge tubes.\nGently remove supernatant using a micropipette, and resuspend pellet in 200 µl fresh islet culture media.\nUsing a cyto-centrifuge, centrifuge dissociated islets at 140 x g for 3 min onto charged microscope slides.\nAir dry slides at RT for 10 min, then draw a box around the dissociated islets with a hydrophobic marking pen.\nFix cells with 75 µl 4% paraformaldehyde (PFA) at RT for 10 min. Remove 4% PFA and gently wash cells in 75 µl PBS two times. After washing, permeabilize cells with 75 µl 0.2% Triton X-100 in PBS for 10 min. Then, wash cells with 75 µl PBS.\n\tCaution: PFA is known to be allergenic, carcinogenic, and toxic.\n8. Immunofluorescence Labeling of Dissociated Islets for Insulin and the Cell Proliferation Marker, Ki67\nPrepare a humid chamber by placing two wet paper towels in the bottom of a 100 slide capacity microscope slide box.",
    "Place slides flat down (cells facing up) in humid chamber. Prepare samples for labeling by aspirating the PBS from the previous wash step using a micropipette and adding 75 µl of blocking solution (5% Normal Donkey Serum (NDS) in PBS) to each slide to block non-specific binding of antibodies to the specimens. Incubate slides in blocking solution for 1 hr at RT.\nGently aspirate blocking solution using a micropipette and add 75 µl of primary antibody solution containing guinea pig anti-insulin and rabbit anti-Ki67 antibodies, diluted 1 µg/ml in 5% NDS in PBS. Incubate at RT for 1 hr.\n\tNOTE: Alternative markers of cell proliferation include proliferating cell nuclear antigen (PCNA) and phosphohistone H3 (PH3),\nGently aspirate primary antibody solution using a micropipette and rinse the cells with 75 µl PBS. Aspirate PBS using a micropipette and rinse cells two more times, each time with 75 µL PBS. Incubate each sample with 75 µl anti-guinea pig Cy5 secondary antibody and anti-rabbit Cy3 secondary antibody diluted to 2 µg/ml in blocking solution for 1 hr at RT.\n\tNOTE: Do not use secondary antibodies labeled with the same or spectrally overlapping fluorophore that was already used to label the microspheres.\nAspirate secondary antibody solution using a micropipette and incubate in 75 µl of 300 nM DAPI in PBS for 3 min at RT. Aspirate DAPI using a micropipette and rinse in deionized water for 5 min.",
    "Gently aspirate water from samples using a micropipette. Spot a drop (roughly 100 µl) of fast-drying mounting solution containing antifade reagent on a glass coverslip. Invert the microscope slide sample side down, onto the mounting solution. Gently press the coverslip against the slide using a pipet tip to remove bubbles and wipe away excess liquid with a soft cleaning tissue. Allow coverslips to dry overnight at RT.\n9. Image Acquisition and Analysis\nUse an epifluorescence microscope with an attached camera for image acquisition. For each fluorophore, determine the optimal exposure time (typically 20 msec for DAPI, 40 - 80 msec for insulin, and 250 msec for Ki67). Ensure image acquisition parameters are equal for all samples.\nFor each sample, manually count 3,000 insulin-positive cells and of those count how many are also Ki67-positive. Only count insulin-positive cells that have a well-defined and clearly visible nucleus. Calculate the percentage of proliferating β-cells for each sample by dividing the number of Ki67-positive/insulin-positive cells by the total number of insulin-positive cells and multiplying by 100.\nAfter determining the percentage of proliferating β-cells for each sample, determine if a statistically significant difference in β-cell proliferation exists between control and experimental samples by analyzing results with a one-way ANOVA using commercially available statistical software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}