{
  "id": 13206,
  "origin_website": "Jove",
  "title": "Confocal Microscope-Based Laser Ablation and Regeneration Assay in Zebrafish Interneuromast Cells",
  "procedures": [
    "All animal work was approved by the Pace University Institutional Animal Care and Use Committee under protocol 2018-1.\n1. Preparation of zebrafish larvae\nSet up mating 3–5 days prior to conducting the experiment, such that larvae will be 2 days post-fertilization (dpf) to 4 dpf in age when mounted for laser ablation.\n\tNOTE: The Et(krt4:EGFP)sqEt20 (abbreviated as ET20) enhancer trap line, in which interneuromast cells are clearly labeled with enhanced green fluorescent protein (eGFP), allows for relatively easy cell identification and ablation11,14. For confirmation of laser ablation specificity and flexibility, ET20 fish are bred with Tg(neuroD:tdTomato) fish, in which the lateral line nerve is labeled with red fluorescent protein or with Tg(myo6b:βactin-GFP) to label sensory hair cells with GFP15,16.\nAfter embryo collection the following day, incubate embryos at 28.5 °C in E3 medium containing 0.0001% methylene blue until ready to anesthetize and mount.\n2. Preparation of low gelling agarose and tricaine solutions\nTo a 250 mL glass Erlenmeyer flask, add 48 mL of 1x E3 medium, 2 mL of 15 mM tricaine stock solution, and 0.5 g of low-melting agarose.\nMicrowave the solution on high for 30 s and swirl (wearing heat-protective gloves) to dissolve the agarose. Repeat the 30 s heating cycles until agarose is fully dissolved.\nStore the agarose in an incubator heated to 42 °C until ready to use.\n3. Anesthetization of zebrafish larvae\nTo a 50 mL conical tube, add 24 mL of 1x E3 medium and 1 mL of tricaine stock solution (15 mM) to a final concentration of 600 µM. Swirl to mix.\nLoad one of the six wells of a flat-bottomed cell culture plate with 8 mL of E3 containing 600 µM tricaine.\nUse a transfer pipette to move zebrafish larvae into a 74 µm mesh-bottomed transfer insert.",
    "Transfer the mesh-bottomed insert into the well of the six-well plate containing the E3 + tricaine solution. Allow the larvae to remain in the well for a minimum of 3 min or until fully anesthetized. Test anesthesia by tapping the insert. Larvae should not startle and swim in response to the tap.\n4. Fluorescent screening of anesthetized zebrafish larvae\nPipette one anesthetized larva per well onto 12 well hydrophobic-coated slides for screening. Ensure that there is minimal curvature of the meniscus formed in each well of the slide to reduce optical distortion when screening. This can be done by removing a small volume of E3 from each well after placing the larvae.\nUnder a 10x objective on an upright microscope (equipped with a mercury arc lamp, metal-halide lamp, or LED light source and an appropriate filter cube), screen for larvae that express eGFP in the neuromasts and interneuromast cells of the lateral line system.\n\t\nSelect larvae with stronger expression resulting in brighter eGFP, which presumably are homozygous for the transgene.\n\t\tNOTE: In the ET20 line, eGFP is expressed in a ring of mantle cells surrounding each neuromast as well as the narrow strip of interneuromast cells connecting these organs. Stronger eGFP expression (brighter fluorescence) contributes to more effective ablation.\nTo examine the specificity of ablation, use double-transgenic larvae with both the ET20 and Tg(neuroD:tdTomato) transgenes. If screening for Tg(neuroD:tdTomato) carriers, use the RFP filter cube set to identify a bright red patch just posterior to the ear representing the posterior lateral line ganglion.\nTo ablate hair cells in the lateral line neuromasts, use the Tg(myo6b:βactin-GFP) transgenic line and screen for GFP localization in the center of each neuromast.",
    "Select larvae with stereotypical spacing of the neuromasts. Differences in the spacing between neuromasts may indicate abnormal neuromast deposition during development, suggesting defective migratory behavior or cell proliferation in the lateral line primordium17. Such defects may also affect migratory or regenerative behavior of the INMCs following ablation.\n\tNOTE: Common defects in spacing include an unusually large distance between the anterior-most neuromast deposited by the first migrating primordium (prim1L1) and the second neuromast deposited by the same primordium (prim1L2), often associated with crowding of the more posterior neuromasts.\n5. Mounting larvae for laser ablation and imaging\nPipette 3 - 4 anesthetized larvae into a small droplet of E3/tricaine solution in the center of a cover slip-bottomed dish (35 mm dish with a 14 mm number 1.5 coverslip). Remove excess solution so that the larvae remain in a small droplet, just large enough to contain them.\nTransfer the dish to the stage of a binocular stereo microscope and manipulate the zoom and focus so that all larvae are in the field of view.\nRemove the Erlenmeyer flask containing the low melting point agarose from the heated incubator. Use a transfer pipette to transfer agarose solution onto the cover slide to produce a thin layer. Draw off excess agarose until the liquid just fills the well at the bottom of the dish, taking care not to aspirate any larvae.\nQuickly arrange the larvae in the agarose solution using a hair knife or hair loop so that they are aligned with each other and oriented with rostral to the left.",
    "Gently press the larvae down against the glass with the hair knife, such that they lie in profile with their right sides down. Larvae older than 3 dpf tend to float due to their inflated swim bladders, so they may need to be repeatedly pressed down against the glass until the agarose begins to gel.\nAfter about 60 s the agarose will start to solidify, and the larvae will not be able to be reoriented. Allow approximately 5 minutes at room temperature for the agarose on the cover slip to completely solidify. Once the agarose has solidified, use a transfer pipette to fill the dish halfway with E3 containing 1x tricaine.\n6. Locating prospective targets and pre-ablation imaging\nTurn on the power to the laser-scanning confocal microscopy system and initialize through the integrated imaging software. Select the 63x Plan-Apochromat oil immersion objective (numerical aperture 1.40) or similar. Apply immersion oil and secure the dish in a circular stage insert such that the larvae face with their rostral aspect to the left.\nUnder bright-field or differential interference contrast illumination, select one of the mounted larvae for imaging. Adjust the focus with the focus knob such that the skin on the side of the fish closest to the coverslip is in focus, recognizable by the fingerprint-like pattern of periderm cells.\nOnce in focus, switch to epifluorescent illumination in the GFP channel. Locate the posterior lateral line by GFP expression along the horizontal myoseptum. Rings of fluorescent cells indicate neuromast mantle cells, and elongated strands of cells are interneuromast cells.\nBeginning with the primIL1 neuromast, usually located just dorsal to the yolk, use the stage control joystick or other stage movement control to visually scan caudally along the horizontal myoseptum.",
    "Follow the string of interneuromast cells until reaching the region between the primIL3 and primIL4 (L3 and L4) neuromasts (Figure 1A).\n\t\tNOTE: Other regions can also be targeted, but this section of the trunk and tail tends to be closest to the cover glass and, therefore, most amenable to ablation.\nIf imaging several larvae, set the first stage position, then inactivate the multiple stage positions option by deselecting the appropriate check box.\nRepeat steps 6.4.1–6.4.2. for each desired stage position (each larva).\nAfter cell bodies in the L3–L4 region have been identified, switch to the acquisition mode.\n\t\nActivate a GFP imaging track using the 488 nm or 491 nm laser.\nAdd a transmitted light (transmitted light photomultiplier tube or T-PMT) channel to the activated 488 nm laser track by activating the T-PMT checkbox under the “Imaging Setup” dropdown menu.\nSet the laser power to 6%, pinhole size to 1 Airy unit equivalent, and digital gain to 750 for imaging ET20 larvae. Exact gain and laser power may vary for any given larva, depending upon how close to the cover slip they are mounted and the brightness of fluorescence. Adjust the gain such that cell bodies are saturated to capture otherwise dim projections and filipodia.\nAdjust the parameters to a frame size of 1024 pixels x 1024 pixels, digital zoom of 0.7 (145.2 µm x 145.2 µm image size). Set averaging to 2 to improve image quality.",
    "Check the z-stack box to bring up the z-position dropdown menu. While fast scanning, focus out until the interneuromast cells are just out of focus. Set the first slice, then focus through the sample until the interneuromast cells are once again out of focus. Set the last slice. Ensure that it encompass a z-stack of approximately 25 µm. Set the imaging interval to 1 µm.\nStart experiment to capture a pre-ablation z-stack (Figure 1B). If stage positions have been added, inactivate the positions option so that only the current position is imaged. Save the file once it is captured.\n7. Laser ablation of cell bodies\nClick on “Show all Tools”. This option is located at the top of the acquisition interface.\nClick on the dropdown menu for “Imaging Set Up”. In “Imaging Set up”, click on “Add a new track” (represented as “+”).\nIn “Imaging Set Up”, click on the dropdown menu for “Dye”. Select DAPI as the dye.\nClick on the dropdown menu for “Channels” and deselect all other tracks by unclicking their respective checkboxes. Ensure that only the DAPI track is selected.\nIn the DAPI track, click on 405 for the “Laser setting”. Increase the laser power to 75%. Unclick the DAPI channel to turn off the laser while scanning for candidate cell bodies for ablation.\nWith the body of an interneuromast cell centered in the field of view, zoom in the scanning frame to 20x–22x. The frame position may need to be adjusted to keep the cell body in the center as the zoom is applied. Stop live scanning as soon as the cell body fills the field of view.",
    "NOTE: The cell body should occupy the entire field of view. At this zoom level, the GFP will bleach rapidly. Minimize laser exposure time by working quickly. Use zoom rather than selecting a region of interest to increase laser power distribution over a small area.\nCheck the 405 nm laser shutter box to activate the track. Adjust the laser power to 75%. Set a timer for 45 s. Activate continuous scanning and start the timer. Stop scanning immediately at 45 s.\n8. Post-ablation imaging and time-lapse microscopy to study regeneration\nClick on the dropdown menu for “Channels”. In channels, unclick the “DAPI” track to inactivate the ablation laser. Click on the dropdown menu for “Acquisition mode”.\nIn acquisition mode, click on “Zoom”.\nDecrease the zoom to 0.7 either by using the slider or by typing in “0.7.”\n\t\nTo ensure successful cell ablation, increase the gain to 900 and fast scan the field of view.\n\t\tNOTE: No GFP should be visible within the targeted cell or cells. If fluorescence is still observed, return to steps 7.1–7.3.\nUsing the same or similar settings as those described for pre-ablation imaging, capture and save a post-ablation image (Figure 1C). If the image reveals remnants of fluorescent cells or additional cell bodies that needs to be removed, repeat the laser ablation steps to create a visible gap in the string of interneuromast cells.\nInspect the T-PMT channel image to further confirm cellular damage. Damaged cells will have a granular appearance, and frequently the nuclei will swell or become irregular in shape (Figure 2).",
    "After capturing a pre-ablation image, ablating the cells as necessary, and capturing a post-ablation image for each individual stage position, set up the time-lapse microscopy by activating both stage position and time options for image capture. Set the time parameters to 24 h or another desired endpoint and 15 min intervals. Start experiment to acquire images and save the resulting file when complete (on the following day).\nIf larvae are to be further studied or raised, carefully remove them from the agarose using fine forceps, then transfer into E3 medium without tricaine for recovery. If they are not to be used further, euthanize according to the approved animal protocol (rapid and sustained immersion in an ice bath is a common method) and dispose of them as required by the institution.\n9. Image analysis\nOpen a post-ablation z-stack file in the preferred image processing software (Table of Materials). Split the channels such that each channel is in a separate viewing pane.\nIn the GFP channel window, use the line tool to draw a straight line between the tips of the remaining INMCs. This may be aided by scrolling up and down through the z-stack or by performing a maximum-intensity projection prior to drawing the line.\nUse the “Measure” tool to obtain the distance between INMC ends in the x- and y-planes.\nScroll through the z-slices in the original z-stack to determine the distance between INMCs in the z-plane.\nCalculate the total distance between INMC ends using the Pythagorean theorem (a2 + b2 = c2). The hypotenuse is the total distance (or gap size).\nEnter the resulting distance measurement into a spreadsheet application for data analysis.",
    "Review the time-lapse microscopy files collected in step 8.2–8.3 using either the integrated imaging software on the confocal system or freely available image analysis software. Identify the timepoint at which the gap between interneuromast cells was filled in by cell projections. This can be aided by examination of multiple z-slices to confirm closure of the gap in all dimensions.\nTo achieve the most accurate measurement of time to gap closure, use the post-ablation image time stamp (visible in Finder or File Explorer) as the zero time point; measuring time from the beginning of the time-lapse image stack may result in underestimating time to closure, depending upon how much time elapsed while ablating additional stage positions, etc.\nDerive the rate of closure by simply dividing the original gap size (µm) by the hours or minutes required for complete gap closure."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}