{
  "id": 14999,
  "origin_website": "Jove",
  "title": "Improvement of Bacillus subtilis Spore Enumeration and Label Analysis in Flow Cytometry",
  "procedures": [
    "See the Table of Materials for details related to all materials, instruments, and software used in this protocol.\n1. Flow cytometry setting\nAlignment of optical parameters of flow cytometer coupled to a computer\n\t\nLog in to Cytometer software.\nFrom the software workspace, select Cytometer | Startup and wait a few minutes | Clean mode | Sit fluids.\n\t\t​NOTE: Air bubbles and obstructions were removed during the cytometer initiation process, prior to sample acquisition.\nQuality control\n\t\nUse the quality control reagent to adjust the voltages of the photomultiplier tubes and evaluate their sensitivity.\n\t\t\nPrepare the quality control reagent in a polystyrene tube.\nFor defining the baseline, prepare the suspension beads by adding 0.5 mL of diluent (10 mM filtered PBS, pH 7) and 3 drops of beads to the labeled tube.\nMix the bead vial by gentle inversion.\nFrom the software workspace, select Cytometer | CST to connect to the CST interface. Wait a few minutes and observe the message cytometer disconnected.\nAttach the polystyrene tube containing the quality control reagent to the flow cytometer probe.\nVerification of the configuration of the cytometer\n\t\nIn the System Summary window, check that the cytometer configuration is appropriate for the experiment.\nSelect the setup beads batch ID corresponding to verify that the setup beads lot ID selected matches the current lot of CS&T research beads.\nPerformance check\n\t\nSelect the option Check Performance and click Run.\nUpon completion of the performance check, the performance results will be displayed. View the Cytometer Performance Report. Either click Finish to complete the performance check or remove the tube from the cytometer and review the results in the System Summary window.\nObserve the final result of the morphometric and fluorescence sensitivity analysis that will appear in the | system summary| cytometer performance result| with the status: PASSED",
    "2. Preparation of the spores\nAfter sporulation, rinse the spores 3x with ultrapure ice-cold water by centrifugation at 17,949 × g for 10 min.\nResuspend the pellet obtained from the last centrifugation with 10 mL of ultrapure water.\nAutoclave the spores for 45 min at 121 ºC for inactivation of the vegetative cells.\n\tNOTE: Previous tests carried out by our group comparing different inactivation methods demonstrated that the conditions mentioned in step 2.3 presented high efficiency, showing no colony formation in the plating analysis method on the LB agar medium.\n3. Quantification of autoclaved spores using flow cytometry\nTake 50 µL of autoclaved spores and incubate them protected from light with ethidium bromide (EtBr, 10 mg/mL diluted in water) at a dilution factor of 0.05% v/v for 30 min (Figure 1A).\nWash the spores 3x with 1x phosphate-buffered saline (PBS) by centrifugation at 17,949 × g for 10 min and resuspend in 1x PBS.\nAdd 10 µL of beads, following the manufacturer's recommendations for dilution.\nAnalyze the sample using a flow cytometer as described in step 4.\n\t​NOTE: It is important to emphasize that the beads should be pipetted as homogeneously as possible since disparities were observed in the calculations when this step was not well executed.\n4. Analysis using flow cytometry\nLog in to Cytometer software.\nFrom the software workspace, select Cytometer | Clean mode | Sit fluids.\nAdjust to the workspace to determine the analysis in flow cytometry.\n\t\nDefine the gates for the analyses (Figure 2).\n\t\t\nDefine the gating strategy based on the morphometric and fluorescence characteristics of the particles based on the negative control (unmarked spores).\nTo determine cell morphometry, choose Dotplot graphic for analyses of FSC-A parameters on the x-axis and SSC-A on the y-axis.",
    "To determine fluorescence, choose FL3 Dotplot plots on the y-axis using FL5 on the x-axis and create the gates in four quadrants.\nUse a 12 x 75 mm stoppered polystyrene tube containing unlabeled samples, previously labeled with single-color EtBr, single-color APC, and multicolor EtBr+ APC.\nMix the tube very gently containing the negative control and attach it to the flow cytometer probe.\nClick on Acquire.\nSet the power of the lasers by navigating to Cytometer | Parameters | FSC (375) and SSC (275).\nSet the threshold to (500) Cytometer | Threshold.\nTo remove autofluorescence, analyze the dye-free sample containing only spores.\nAdjust the voltages for the filter detectors: FL3 (603) and FL5 (538) to discriminate negative and positive populations with respect to the chosen fluorescence in the controls. Cytometer | Parameters.\nCytometer | Compensation | Set FL5/FL3 setup offset to 1.0.\nAfter morphometry and fluorescent analysis, configure the device for Acquisition 30,000 events | Experiment | Experiment layout | Acquisition |30,000 events….\nAfter adjusting the parameters, acquire data for the samples that are labeled and contain beads in the flow cytometer.\nCalculate spore concentration as described by the manufacturer's instructions using equation (1).\nimgsrc://cloudfront.jove.com/files/ftp_upload/65141/65141eq01.jpg    (1)\n\tNOTE: For this study, the bead quantification method was compared to the Petroff-Hausser counting chamber analysis. In addition, the labeling of autoclaved spores was compared to the labeling of non-autoclaved spores.\n5. Estimation of the protein coupling index on a spore surface using flow cytometry\nHarvest by centrifugation of 50 µL of spores (103/µL) 17,949 × g for 10 min and then, resuspend with 25 µL of 1-ethyl-3-(3-dimethylaminopropyl)carbodiimide (EDC) (300 mM)).\nIncubate for 15 min at room temperature.\nAdd 25 µL of N-hydroxysulfosuccinimide (NHS) (50 mM) to the spore suspension and incubate it at room temperature for 30 min.",
    "Wash the spores 3x with 1x PBS by centrifugation as described in step 5.1.\nAdd fluorescent protein and leave the samples overnight at 15 °C.\n\tNOTE: The fluorescent protein used in this work was an APC-labeled anti-human IL-10 antibody. This antibody was used as a model for study, though the application of other fluorescent molecules is possible since EDC/NHS promote a covalent ligation between -COOH and -NH2 groups present in proteins on the spore surface.\nWash the spores as per step 5.3.\nAdd 10 mg/mL of ethidium bromide diluted at 1:50, then leave for 1 h on ice and protected from light (Figure 1B).\nWash the spores as per step 5.3.\nRepeat step 4.\nTo determine fluorescence, change the parameters FL3 on the X axis and FL5 on the Y axis of the dotplot.\nAnalyze the sample using a flow cytometer with the blue laser (488 nm) at FL3 (670 LP filter) and the red laser (633 nm) in FL5 (660/20 filter), as described in step 4.\n\tNOTE: The same samples were analyzed for immunofluorescence on slides under a microscope, at a magnification range of 1,000 x, and using the following filters: FITC 480/30 nm (green) and TRITC 540/25 nm (red).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}