{
  "id": 19390,
  "origin_website": "Jove",
  "title": "A Lightweight Drive Implant for Chronic Tetrode Recordings in Juvenile Mice",
  "procedures": [
    "The present study was approved by the University of Texas Southwestern Medical Center Institutional Animal Care and Use Committee (protocol 2015-100867) and performed in compliance with both institutional and National Institute of Health guidelines. The C57/Bl6 male and female mice used in the present study were implanted at p20 (weight 8.3-11.1 g at the time of implantation).\n1. Micro-drive design and construction\nDigitally designing and printing the micro-drive (Figure 1)\n\t\nDownload the micro-drive model templates (https://github.com/Brad-E-Pfeiffer/JuvenileMouseMicroDrive).\nIdentify the stereotaxic locations of the target brain region(s) in an appropriate stereotaxic atlas.\nUsing three-dimensional computer-aided design (3D CAD) software, load the template micro-drive cannula (Figure 1B).\nIf necessary, modify the output cannula output locations on the micro-drive cannula model to target the desired brain region(s).\n\t\tNOTE: Each cannula hole extrusion should be at least 2 mm long to ensure that the tetrode will emerge from the cannula hole aiming straight at the target. The micro-drive cannula template is designed to bilaterally target the anterior cingulate cortex (one tetrode per hemisphere), hippocampal area CA1 (four tetrodes per hemisphere), and hippocampal area CA3 (two tetrodes per hemisphere), with one reference tetrode per hemisphere positioned in the white matter above hippocampal area CA1.\nIf necessary, modify the micro-drive body (Figure 1A) to accommodate the attachment of the electronic interface board (EIB).\nPrint the micro-drive body, cannula, cone, and lid at high resolution on a 3D printer (ideally with a resolution better than 25 µm), and prepare the printed materials according to the manufacturer's protocols. Use printer resins with high rigidity.\nAssembling the custom screws and attachments (Figure 2A, B)\n\t\nUsing 3D CAD software, load the screw attachment models (Figure 1E).",
    "Print the screw attachments at high resolution on a 3D printer (ideally with a resolution of at least 25 µm), and prepare the printed materials according to the manufacturer's protocols. Use printer resins with high rigidity.\nAffix the screw attachments to each tetrode-advancing screw (Figure 1F) (tetrode-advancing screws are custom manufactured at a machine shop prior to micro-drive construction).\n\t\t\nAffix two screw attachments to each screw, with one above and one below the ridge. Ensure that the bottom of each screw attachment contacts the ridge. Hold the screw attachments together with gel cyanoacrylate.\nOnce affixed, ensure that the screw attachments do not move in the longitudinal axis of the screw but rotate freely with minimal resistance.\nAssembling the micro-drive body (Figure 2C, D)\n\t\nUsing fine, sharp scissors, cut large polyimide tubing (outer diameter: 0.2921 mm, inner diameter: 0.1803 mm) into ~6 cm long sections.\nPass the large polyimide sections through the output holes on the micro-drive cannula so that each tube extends beyond the bottom of the cannula by a few millimeters.\nUsing a clean 30 G needle, affix the polyimide to the cannula by applying small amounts of liquid cyanoacrylate. Take care not to allow the cyanoacrylate to enter the inside of the polyimide tube.\n\t\tNOTE: Dripping liquid cyanoacrylate down into the cannula through the top of the drive body can expedite this process but will require re-clearing of the guide holes later with a fine-tipped drill.\nPass the large polyimide tubes from the top of the micro-drive cannula through the appropriate large polyimide holes in the micro-drive body.\nSlowly push the micro-drive cannula and micro-drive body together until they are adjacent and the cannula/body attachment tabs interlock. Be careful not to kink or damage the polyimide tubes in the process.",
    "NOTE: Each polyimide tube should smoothly pass from the bottom of the cannula out through the top of the micro-drive body. Slight bending is normal, but excessive bending of the polyimide tube can warp the tetrode and prevent it from passing straight into the brain.\nAffix the micro-drive body and the micro-drive cannula together using cyanoacrylate.\nUsing a new, sharp razor blade, sever the large polyimide tube ends that are extruding from the bottom of the cannula output holes. Ensure that the cut is exactly at the base of the cannula, making the tubes and the cannula bottom flush with one another.\nUsing sharp scissors, cut the large polyimide tubing just above the edge of the inner rim of the drive body at a ~45° angle.\nLoading the assembled custom screws (Figure 2E)\n\t\nScrew each assembled custom screw into the outer holes of the micro-drive body. Ensure the screw guidepost passes through the large hole in the screw attachments. Advance each screw fully until it will not advance further. Pre-lubricating the screws with mineral oil or axle grease is recommended.\nUsing extremely sharp scissors, cut small polyimide tubing (outer diameter: 0.1397 mm, inner diameter: 0.1016) into ~4 cm long sections.\nPass the small polyimide sections through the large polyimide tubing already mounted in the micro-drive. Ensure that excess small polyimide tubing protrudes from the top and bottom of each large polyimide tube.\nAffix the small polyimide tubes to the screw attachments via cyanoacrylate, taking care not to let any cyanoacrylate enter into either the large or small polyimide tubes.",
    "Using a new, sharp razor blade, sever the small polyimide tube ends that are extruding from the bottom of the cannula holes. Ensure that the cut is exactly at the base of the cannula and that the cut is clean, with nothing blocking the polyimide tube hole.\nUsing sharp scissors, cut the top of the small polyimide a few millimeters above the top of the screw attachment at a ~45° angle. Ensure the cut is clean, with nothing blocking the polyimide tube hole.\nLoading the tetrodes\n\t\nPrepare the tetrodes (~6 cm in length) using previously described methods31.\nUsing ceramic- or rubber-tipped forceps, carefully pass a tetrode through one of the small polyimide tubes, leaving ~2 cm protruding from the top of the small polyimide tube.\nAffix the tetrode to the top of the small polyimide tube via liquid cyanoacrylate, taking care not to affix the small and large polyimide tubes together in the process.\nRetract the screw until it is near the top of the drive.\nGrab the tetrode wire protruding from the bottom of the drive, and gently kink it at the point where it emerges from the cannula.\nAdvance the screw fully back into the drive.\nUsing very sharp scissors, cut the tetrode wire just above the kink. Under a microscope, ensure that the cut is clean and that the metal of all four tetrodes is exposed.\nRetract the screw until the tetrode is just secured within the cannula.\nRepeat steps 1.5.2-1.5.8 for all the screws.\nAttach the EIB to the EIB support platform via small jewelry screws.\nConnect each electrode of each tetrode to the appropriate port on the EIB.\nPreparing the micro-drive for surgery\n\t\nElectrically plate the tetrodes to reduce the electrical impedance using previously described methods31.",
    "After plating, ensure that each tetrode is housed in the cannula such that the tip of the tetrode is flush with the bottom of each cannula hole.\nSlide the micro-drive cone around the completed micro-drive. Attach the micro-drive lid to the micro-drive cone by sliding the cone attachment pole into the lid port.\nOrient the cone so that the EIB connectors pass freely through the EIB connection pass-through holes when the lid is closed, and glue the cone in place with cyanoacrylate placed around the base of the cone, taking care not to let any cyanoacrylate enter into any of the cannula output holes. Remove the lid.\nCarefully backfill each cannula hole with sterile mineral oil to prevent bodily fluids from entering the polyimide holes after surgical implantation.\nCarefully coat the base of the cannula with sterile petroleum jelly. This will serve as a barrier to prevent chemical agents (e.g., dental cement) from entering the exposed brain during the surgery.\nWeigh the fully assembled micro-drive, lid, and four bone screws to prepare an equal-weight counterbalance.\nOptionally, prior to the surgery, extrude the tetrodes at a distance that is appropriate for reaching the target brain regions once the drive is flush with the skull.\n\t\tNOTE: Prior to surgical implantation, sterilize the implant via gas sterilization in ethylene oxide (500-1200 mg/L, 2-4 hrs).  All bone screws and surgical instruments should be sterilized via autoclave (121°C, 30 minutes).\n2. Surgical implantation\nAnesthetizing the mouse and mounting it in the stereotaxic apparatus\n\t\nPlace the mouse in a small box with sufficient space to move, and anesthetize the mouse with 3%-4% isoflurane.\n\t\tNOTE: Other anesthetic agents can be used, but caution should be used due to the age, size, and weight of the juvenile mouse subject.",
    "Once the mouse is unresponsive (no response to tail pinch, a ventilation rate of ~60 breaths per minute), remove it from the box, and quickly mount it on the stereotaxic apparatus.\nQuickly, place the stereotaxic mask over the mouse’s snout and maintain anesthesia at 1-3% isoflurane. Apply any veterinary-approved pain relief, such as sustained-release buprenorphine (0.05-0.5 mg/kg subcutaneous), or anti-inflammatory agents, such as carprofen (5-10 mg/kg subcutaneous), prior to initial surgical incision.\nFully secure the mouse's head in the stereotaxic apparatus using ear bars. Ensure the skull is level and immobile without placing unnecessary pressure on the mouse's ear canals. Due to the limited ossification of juvenile skull bones, it is possible to cause permanent damage during head fixation.\nPreparing the mouse for surgery and exposing the skull\n\t\nProtect the mouse's eyes by placing a small volume of synthetic tear gel on each eye and covering each eye with an autoclaved patch of foil.\n\t\t​NOTE: The synthetic tears will keep the eyes moist, while the foil will prevent any light source from causing long-term damage. Thicker synthetic tear solutions are preferred as they can also serve as a barrier to the inadvertent introduction of other potentially toxic surgical solutions (ethanol, dental acrylic, etc.) into the eyes.\nUsing sterile cotton-tipped swabs, apply hair-removal cream over the surgical area to remove the hair from the scalp. Be careful not to get the cream near the eyes. After removing the hair, place a sterile drape over the scalp to secure the surgical area.\nUsing sterile cotton-tipped swabs, clean the scalp via three consecutive washes of povidone-iodine (10%) solution followed by isopropyl alcohol (100%).\nUsing a sterile scalpel or fine scissors, remove the scalp.\nUsing sterile cotton-tipped swabs and sterile solutions of saline solution (0.9% NaCl) and hydrogen peroxide, thoroughly clean the skull.",
    "Identify bregma, and using the stereotaxic apparatus, carefully mark the target recording locations on the skull with a permanent marker.\nOpening the cannula hole and attaching the bone anchors\n\t\nRemove the skull overlaying the recording sites. # Due to the thinness of the skull at this age, cut the skull with a scalpel blade; this removes the necessity of using a drill, which may damage the underlying dura. Keep the exposed dura moist with the application of sterile saline solution (0.9% NaCl) or sterile mineral oil. Do not remove or puncture the dura at this stage, as it is sufficiently thin in juvenile mice for the tetrodes to pass through in future steps.\nCarefully drill pilot holes for four bone screws.\n\t\t\nPlace the bone screws in the extreme lateral and rostral or caudal portions of the skull, where the bone is thickest and the bone screws are sufficiently far away from the micro-drive implant. For the bone screws, use sterile, fine jewelry screws (e.g., UNM 120 thread, 1.5 mm head).\nTightly wind one bone screw with a thin, highly conductive wire that will serve as a ground and be attached to the EIB in step 2.4.6.\nUsing a scalpel blade or carefully using a drill bit, score the skull near the bone screw hole locations. Scoring is important to provide a sufficiently rough surface for the liquid cyanoacrylate to bind in step 2.3.5.\nUsing a sterile screwdriver and sterile screw clamp, thread each sterile bone screw into place, taking care not to pierce the underlying dura.\nUsing a sterile 30 G needle, place liquid cyanoacrylate around each bone screw. This effectively thickens the skull where the bone screws have been attached. Take care not to allow any cyanoacrylate to enter into the exposed dura above the recording sites.",
    "Lowering and attaching the micro-drive (Figure 2G)\n\t\nMount the completed micro-drive onto the stereotaxic apparatus to be carefully lowered onto the mouse skull. Ensure that the micro-drive cannula will be at the appropriate coordinates when lowered.\nLower the micro-drive slowly, moving only in the dorsal/ventral direction. Lower the micro-drive with the tetrodes already advanced out of the cannula holes (step 1.6.6) in order to visualize their entry into the brain; any medial/lateral or rostral/caudal movement when the tetrodes are touching the mouse can bend the tetrodes and cause them to miss their final destination.\nOnce the micro-drive is fully lowered, ensure that the base of the cannula just makes contact with the skull/dura. The layer of petroleum jelly and/or mineral oil will serve as a barrier to cover the exposed dura. If necessary, add sterile petroleum jelly or sterile bone wax to cover excess exposed dura.\nWhile holding the micro-drive in place with the stereotaxic apparatus, coat the skull in dental cement to affix the micro-drive base to the implanted bone screws.\n\t\tNOTE: The dental cement should fully encase all the bone screws and should cover the dental cement anchor ledge on the micro-drive cannula.\nWhile the dental cement sets, carefully shape it to prevent sharp corners or edges that may harm the mouse or damage the micro-drive. Ensure there is sufficient dental cement to hold the micro-drive, but eliminate excessive dental cement that will add unnecessary weight.\nCarefully thread the ground wire through the micro-drive, and attach it to the appropriate slot on the EIB.\nOnce the dental cement is fully set, carefully detach the micro-drive from the stereotaxic apparatus. Place the lid on the micro-drive.\nWith a sterile cotton-tipped swab and sterile saline, clean the mouse.",
    "With a sterile cotton-tipped swab, apply a thin layer of antibiotic ointment to any exposed scalp near the implant site.\nRemove the foil from the mouse's eyes.\nRemove the mouse from the stereotaxic apparatus, taking care to support the additional weight of the micro-drive as the mouse is transported to a clean cage.\n3. Post-surgery recovery\nImmediate recovery\n\t\nPrior to the surgery, prepare the counterbalance system by connecting a 0.75 in diameter PVC pipe, as shown in Figure 2G. One arm of the system passes through holes drilled into the lid of the cage, the second arm rests on top of the cage lid, and the third arm extends above and beyond the cage. The topmost arm is capped.\nCarefully attach the micro-drive to the counterbalance system (Figure 2G-I), and use a counterbalance weight identical to the weight of the micro-drive and bone screws. Run a strong thread or fishing line from a connector attached to the EIB over the three arms of the counterbalance system to the counterbalance weight, which hangs over the topmost arm.\nEnsure that the counterbalance is strongly connected to the micro-drive EIB and that there is sufficient line to give the mouse complete access to the entirety of the cage.\nProvide nutrient-rich gel in the cage alongside moistened normal rodent chow to ensure rehydration and recovery.\nMonitor the mouse until it fully recovers from the surgical anesthesia.\nLong-term recovery\n\t\nAt all times, when not attached to the recording equipment, ensure that the micro-drive is supported by the counterbalance system. Reduce the counterweight over time, but never remove it entirely to avoid unanticipated stress to the mouse or torque to the bone screws.",
    "To prevent damage to the implant and counterbalance system, house the mouse without the possibility of direct interaction with other mice for the duration of the experiment.\nProvide nutrient-rich gel for at least 3 days following surgery, at which point solid food alone will be sufficient.\n\t\t\nDue to the overhead requirements of the counterbalance system, do not provide food and water in an overhead wire mesh; place the food on the cage floor, and provide water through the side of the cage. To prevent spoilage, replace the food entirely daily.\nDaily, ensure that the mouse has free access to the entirety of the cage and that the counterbalance is robustly and strongly attached to the micro-drive."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}