{
  "id": 8869,
  "origin_website": "Jove",
  "title": "Fluorescence Live-cell Imaging of the Complete Vegetative Cell Cycle of the Slow-growing Social Bacterium Myxococcus xanthus",
  "procedures": [
    "1. Preparation and Growth of M. xanthus Strains\nNote: See Table 1 and Table 2.\nPrepare 1% casitone broth (CTT) growth medium 1% (w/v) pancreatic digest of casein (e.g., Bacto casitone), 10 mM Tris-HCl pH 8.0, 1 mM KH2PO4 pH 7.6, 8 mM MgSO422, supplemented with kanamycin (50 µg/mL) or oxytetracycline (10 µg/mL). Add gentamycin (10 µg/mL) to all media to reduce the risk of contamination with other bacteria, since M. xanthus cells are naturally resistant to it.\nInoculate 5 mL of 1% CTT containing the relevant antibiotic(s) with a single freshly grown colony of wild type (WT) DK1622 23, SA4420 (ΔmglA)24, SA4797 (ΔmglA, ΔpomX/PpomZ mCherry-pomX)16, SA8241 (ΔmglA, ftsZ+/PnatftsZ-gfp), or SA4749 (ΔmglA, parB+/PnatparB-yfp) in the morning of day 1.\n\t\nResuspend a single M. xanthus colony in 500 µL of 1% CTT supplemented with antibiotics in a sterile tube and transfer the entire suspension to a 50 mL Erlenmeyer flask containing 5 mL of 1% CTT.\n\t\tNOTE: Use an Erlenmeyer flask with 10 times the volume of the culture to guarantee sufficient aeriation and optimal growth.\nGrow the cells for eight generations (approximately 40 - 48 h with a generation time of 4 - 6 h) at 32 °C, shaking at 220 rpm, in the dark. Maintain cells in the exponential growth phase (OD550 <1.2) and prevent them from reaching the stationary phase. If needed, dilute the cells into fresh 1% CTT medium containing the relevant antibiotic(s) to an OD550 of 0.1 - 0.2.\n\tNOTE: An optimal OD550 for a single cell microscopy is 0.5 - 0.7. At this OD550, a sufficient number of cells is present per image to allow quantification as well as statistical analysis of cellular parameters.\n2. Preparation of Microscopy Samples",
    "Note: Cells to be viewed by microscopy are placed on a microscope coverslip and then covered by an agarose pad containing nutrients. The coverslip is glued to a plastic or metal frame to provide mechanical support. In preparation for the microscopy, a large pad of 1% agarose/TPM/0.2% CTT should be prepared in advance as described in steps 2.1 - 2.3. Please also refer to the Table of Materials for specific products used here.\nPrepare 500 mL of TPM buffer (10 mM Tris-HCl pH 7.6, 1 mM KH2PO4 pH 7.6, 8 mM MgSO4) and autoclave or filter sterilize using a bottle top filter.\n\tNOTE: The sterile buffer can be stored for several months at room temperature.\nPrepare 1% agarose microscopy solution containing 0.2% CTT (mix 1 g of agarose with 80 mL of TPM buffer and 20 mL of 1% CTT medium). Heat in a microwave oven until the agarose is molten.\n\tNOTE: The 0.2% CTT is sufficient to allow cells to grow and prevent starvation. Higher concentrations of CTT in the microscopy medium will result in high background fluorescence.\nFill a Petri dish with the molten agarose to a thickness of 0.5 cm (for an 11.5 cm x 11.5 cm square Petri dish, approximately 60 mL of molten agarose is required) and let it cool down to room temperature.\n\t​NOTE: The agarose pad can be stored at 4 °C in a humid environment for up to 2 days.\n\t\nPre-warm the 1% agarose/TPM/0.2% CTT pad at 32 °C for at least 15 min prior to use.\n\t\tNOTE: To prepare the cells for microscopy, follow steps 2.4 - 2.8.",
    "Place a sterile glass coverslip (60 mm x 22 mm, thickness: 0.7 mm) on a plastic or metal frame that has a hole in the middle (Figure 1A); this frame serves as a mechanical support for the thin coverslip and helps to reduce drift during microscopy. Fix the coverslip to the frame with tape.\n\t\nTo prepare the frame, cut out a 75 mm × 25 mm frame from a 1 mm thick metal plate, then cut out an appropriately sized hole (20 mm × 30 mm in this experiment) in the middle.\nAdd 10 - 20 µL of exponentially grown M. xanthus cells on the coverslip.\nAdd fluorescent 0.5 µm microspheres as fiducial markers to the cells to simplify tracking of cells or proteins in time-lapse recordings.\n\t\nDilute the microspheres 1:100 in TPM buffer and store at 4 °C for up to several months. Shake thoroughly before use and add 5 - 10 µL of the diluted microspheres to the cells.\n\t\tNOTE: Here microspheres that are fluorescent in all common blue, green, yellow, and red fluorescent channels were used.\nCut out a small pad approximately the size of the coverslip of the large pre-warmed 1% agarose/TPM/0.2% CTT pad and place it on top of the cells (Figure 1B). Place a coverslip on top of the 1% agarose/TPM/0.2% CTT agarose pad to prevent evaporation and to maintain cells in a humid environment.\n\tNOTE: The coverslip alone will prevent significant evaporation for at least 2 h. For longer time-lapse recordings, the 1% agarose/TPM/0.2% CTT pad and coverslip sandwich should be sealed with paraffin film to prevent evaporation.\nIncubate the microscopy sample at 32 °C for 15 - 20 min to let the cells attach to the bottom of the agarose pad. Then start the time-lapse microscopy recordings.",
    "3. Microscope Set-up and Time-lapse Acquisition\nNote: The protocol described here was developed for an inverted widefield microscope with autofocus, a 100X/1.30 NA oil PH3 objective, an X, Y motorized stage, a sCMOS camera, a light source, filters for green-fluorescent, red-fluorescent, or yellow-fluorescent proteins, and a temperature controlled incubation chamber. This chamber keeps cells protected from light and at constant temperature.\nPre-heat the incubation chamber and the microscope to 32 °C for ~1 - 2 h before starting microscopy.\n\tNOTE: Depending on the microscope set-up, heating may take longer. Pre-heating is essential to reduce drift and stabilizes the autofocus control system.\nSwitch on the microscope and start the microscope control software. Select the correct objective and the correct mirrors and filters to acquire phase contrast images as well as images of green-fluorescent, red-fluorescent, or yellow-fluorescent proteins.\n\tNOTE: A microscope is typically supplied with a preferred software for microscope control and image acquisition. Here a commercially available software (see the Table of Materials) was used to control the microscope and image acquisition.\nAdd a drop of high quality immersion oil onto the lens of the objective and to the bottom of the sample pre-incubated at 32 °C. Place the objective at the lowest possible Z-position to avoid damaging the objective lens when the sample is placed on the microscope stage. Place the metal-frame with the sample onto the microscope stage and with the \"hole-side\" towards the objective. Fasten the sample securely in the stage holder.",
    "Focus on the cells by moving the stage in the Z-direction closer to the objective. Move the stage slower when the oil drops on the sample bottom side and the objective lens make contact. Move the stage in the X/Y direction until multiple single cells are visible in the region of view, when cells are in the focal plane. Make sure that at least one fluorescent microsphere is in the region of view in order to later align the acquired images.\n\tNOTE: Under optimal conditions, a cell density of 15 - 30 cells per region of view (2,048 x 2,048 pixel or 133.1 x 133.1 µm) should be reached.\nOpen the Multi-Dimensional Acquisition wizard of the microscope control software to set up a time lapse experiment that allows the microscope to acquire images at multiple wavelengths and stage positions if required.\n\t\nIn the Main tab activate Timelapse and Multiple Wavelengths. Additional tabs will appear on the left side of the window.\nClick on the Saving tab and Select Directory to select an empty folder on the computer hard drive to save the acquired images. Activate Increment base name if file exists to make sure that consecutive datasets do not overwrite earlier ones. Then give the experiment a name with date and the strain name or title of the experiment.\nClick on the Timelapse tab to adjust the time-lapse parameters. Set Duration to 24 h and set Time Interval to 20 min. The Number of Time Points will change automatically.",
    "NOTE: The optimal time-interval depends on the experiment and the cellular function to be analyzed. Frequent image acquisitions may cause photobleaching. Thus, a trade-off between temporal resolution and photobleaching must be empirically found. At a doubling time of 4 - 6 h, images can be easily acquired at an interval of 5 min (or even smaller intervals if desired) for phase contrast microscopy. If fluorescence microscopy over a time-course of 24 h is desired images should be recorded at an interval of approximately 15 - 30 min.\nClick on the Wavelengths tab. Select the number of wavelengths to acquire for each image at each time point by changing the number.\n\t\tNOTE: For each wavelength, a new tab will appear on the left side of the Multi-Dimensional Acquisition\" wizard and wavelengths will be acquired in the order from top to bottom. For each wavelength, the acquisition settings can be modified separately.\nClick the first wavelength tab from the top. Select Phase contrast in the Illumination drop-down list. Select 100 ms for Exposure and select Every Time Point in the Acquire drop-down list. Deactivate Auto Expose by selecting Never in the drop-down list.\nRepeat step 3.5.5 for each wavelength that needs to be acquired at each time point. For the experimental set-up and fluorescently labeled proteins described here, use the following parameters for Exposure: 250 ms for mCherry fusion proteins, 200 ms for YFP fusion proteins, and 1,000 ms for GFP fusion proteins.",
    "​NOTE: The optimal illumination settings for each strain and fluorescent protein should be determined in advance by changing the lamp intensity and the image acquisition time for each wavelength. Too long image acquisition times will increase the phototoxic effect and ultimately lead to growth arrest and cell death. Therefore, a trade-off between image quality and cell viability should be achieved.\nAcquire images from multiple stage positions to increase the number of cells recorded in the same experiment.\n\t\t\nTo acquire images from multiple stage positions, activate Multiple Stage Positions in the Main tab. Then click on the Stage tab and click the Live button to look at the field of view.\nMove the stage in the X/Y-direction until a region of interest (ROI) is in the field of view. Save the X- and Y-coordinates by clicking the \"+\" in the Stage tab. Move the stage again in the X/Y-direction until a new ROI is found and save the coordinates again by clicking the \"+\". Go on until the desired number of regions is saved.\n\t\t\tNOTE: In case of fluorescence image acquisition, make sure that regions of interest (ROIs) are not too close to each other to minimize phototoxicity.\nCheck once more that the cells are in focus by clicking on the different saved X- and Y-positions and start the hardware autofocus by clicking AFC hold to keep the saved Z-position constant over the course of the experiment.\nStart the time-lapse recordings in the microscope control software by clicking Acquire in the Multi-Dimensional Acquisition wizard.\n\tNOTE: One window will appear for each wavelength that is acquired and an additional window will appear that shows the number of acquired time points and the time until the next picture acquisition.",
    "Check that the cells are still in focus after the first few time-points in the time-lapse recordings to maximize the quality of the images and refocus if required.\n4. Generation of Time-lapse Movies and Image Alignment\nNote: Several commercial and free software packages are available for image acquisition and image analysis. We use a commercially available software (see the Table of Materials) with multiple pre-installed plugins and additional tools.\nSave the individual images from time-lapse recordings on a computer that has the image analysis/processing software installed.\nStart the software and open images as a stack by clicking Review Multi-Dimensional Data | Select Base File | Select Directory. Open the folder with the multi-dimensional data. Check the dataset and click View; the dataset will be shown as single images from time point one until the end. Activate the wavelength (for creating a stack), select all images that should be in the stack and click Load Image(s). Repeat this step for all wavelengths and save completed stacks.\n(Optional) Open all images required for the movie using File | Open.\n\tNOTE: It is recommended to open images by one acquired wavelength at a time to not slow down the computer if computational power is limited. If certain parts of the time-lapse recordings, e.g., the start, the end, or several time points should be skipped, then this can be adjusted in the completed movie.\nActivate the stack of images that needs to be corrected for drift. Open the alignment tool by Apps | Auto Align…. Check Stack as the source for the images and first plane/time point as the reference plane. Select the stack with the Source stack button and click Apply.",
    "NOTE: The automatic alignment will take some time and computational power but is a good way to correct big stacks for drift of the microscope set-up. This automatic alignment works well if microspheres are included but might also work without them.\nSave the aligned stack.\nUse ROIs.\n\t​NOTE: Fluorescent time-lapse microscopy easily creates large sets of data files that take up a lot of computational power and slow down the downstream processing of these movies. We therefore strongly recommend to identify ROIs and isolate cells to work with smaller files.\n\t\nSelect the Rectangular Region tool. Create an ROI around the cells of interest by manually drawing an ROI on the phase contrast image. Make sure that the cells of interest are visible and in focus throughout the whole time-lapse movie.\nOpen the time-lapse movie of the second wavelength of the same dataset. To transfer the ROI from the phase contrast pictures to the fluorescence images of the second wavelength use the Transfer Regions tool with Regions | Transfer Regions. Select the phase contrast dataset as Source Image and the second wavelength dataset as Destination Image. Select All Regions and press OK.\nRepeat step 4.6.2 for each wavelength acquired for the same dataset.\nSelect the ROI and duplicate it as a stack with Edit | Duplicate | Stack… or press Shift + Ctrl + D keys. Then save the duplicated stack with File | Save into the same folder as the original data.\nRepeat step 4.6.4 for each ROI of every wavelength acquired for the same dataset\nTo generate a movie in MOV or AVI formats, open the Make Movie function via Stack | Make Movie. Select the time-lapse recordings with the Source Stack button. Select the output format, the frame rate, the number of frames, and click Save."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}