{
  "id": 4673,
  "origin_website": "Bio",
  "title": "Protein Extraction from <em>Drosophila</em> Embryos and Ovaries",
  "procedures": [
    "For protein extraction from ovariesOvary dissection Rear female flies alongside a small fraction              (1:3) of males in food supplemented with fresh baker yeast paste for one              to two days prior to dissection. This will stimulate oogenesis and lead              to bigger ovaries (with increased numbers of late developmental              stages).Inactivate anaesthetized flies by decapitation.Dissection technique (under stereoscope and using dissection plate and a              pair of tweezers): For each fly, place the organism in a drop of 1x PBS              and hold it in place by applying gentle pressure at the level of the              upper thorax. Using the tweezers in the free hand tug gently at the              lower part of the abdomen (ovipositor region) until the cuticle starts              to detach from the fly, exposing the internal organs. Isolate ovaries              from adjoining tissues and organs and transfer them to ice cold 1x PBS              while dissecting the remaining flies (avoid keeping the ovaries in the              1x PBS solution for periods longer than 30 min) (see Video 1 for a              visual description). <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Drosophila ovary dissection Ovary protein extraction by sample homogenizationTransfer the isolated ovaries to a 1.5 ml tube containing 200 μl of ice-cold NB lysis buffer.Manually homogenize samples using a pestle. Homogenization should              ensure the complete breakdown of the tissue. If pestles are to be              reused, wash them thoroughly with distilled water before processing              other samples. Centrifuge for 20 sec at ~10,000 rcf (4 °C) to settle down at the bottom of the tube the unprocessed tissue.Repeat manual homogenization of the centrifuged material.Centrifuge for 3 min at ~20,000 rcf (4 °C).Transfer the supernatant to a new 1.5 ml tube, avoiding the upper lipid layer. Repeat this centrifugation process (steps A2 e-f) two more times.Quantify protein concentration and dilute to the final concentration              (dependent on the requirements of downstream applications).",
    "Dilute final concentration with an equal volume of 2x Laemmli sample buffer.Heat samples for 5 min at 100 °C and immediately freeze them at -20              °C after a quick centrifuge spin-down. Extracts can be stored at -20 °C              until necessary.For protein extraction from embryosEmbryo collection and processingFor one to two days prior to              embryo collection rear male and female flies on collection cages with              standard apple juice agar plates supplemented with fresh baker yeast              paste (Figure 1 A).Start the collection by placing a clean apple juice agar plate on the cage. Let flies lay eggs for a given time interval. While egg laying is taking place prepare the 5 individual containers              for the subsequent processing of the embryos. Containers with the              following solutions are required: 0.1% Tween 20 (in water), 50%              commercial bleach (in water) and deionized water (3 containers). Place a              collection basket (cell strainer) into the container with the 0.1%              Tween 20 solution (starting point) (Figure 1A).Collect embryos from the agar plate using a small paintbrush and place them in the partially immersed basket. Gently stir the collection basket to wash the embryos. Dry the base              of the collection basket in a paper tissue before transferring it to the              subsequent container. Transfer the embryos in the collection              basket to the container with the 50% commercial bleach solution.              Incubate for 5 min with gentle, periodic stirring. The purpose of this              step (dechorionation) is to remove the chorionic membranes which              constitute the eggshell covering the embryos. The dechorionated embryos              will become hydrophobic and will float on the surface of the bleach              solution (Figure 1B). Transfer the embryos in the collection              basket to a new container with deionized water. Wash for 2 min and              repeat twice using each time new containers.",
    "Before starting the washes              and also when transferring between the water containers dry the base of              the collection basket in a paper tissue.  Note: Embryos can be                stored at this step by transferring them to a 1.5 ml tube (remove excess                water) that will be flash frozen in liquid nitrogen prior to storage at                -80 °C. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150429/20150429190441_6517.jpgFigure 1. Set up for embryonic protein extraction. Fly              collection cages with standard apple juice agar plates and solution              containers set up (A). Dechorionated embryos float on the surface of the              bleach solution (B). Manually select embryos collected in a 0.5 ml tube              lid (C1). Punctured embryo total extract (C2). Total extract collection              by mixing with Laemmli sample buffer (C3). Embryo collection before              pestle homogenization (Arrowhead 1, D1). Embryonic soluble protein              extract after homogenization and centrifugation (Arrowhead 2, D2).Embryo total protein extracts Manual selection and needle homogenization protocolAfter dechorionation, manually select embryos with sharp tweezers or              a fine paintbrush and transfer them to a previously sectioned 0.5 ml              tube lid (for a minimum of 10 embryos per lid) (Figure 1C1). Dry as much as possible the embryos by absorbing the excess water with a dry paintbrush. Individually puncture each embryo using a needle (Figure 1C2). Gently mix the resulting lysate with 10 µl of 1x Laemmli sample              buffer (Figure 1C3). Transfer the solution to a 1.5 ml collection tube. Note: The volume of sample Laemmli buffer is according to the number of embryos used (1 µl per embryo).Heat samples for 5 min at 100 °C and immediately freeze them at -20              °C after a quick centrifuge spin-down. Extracts can be stored at -20 °C              until necessary.Pestle homogenization protocolAfter              dechorionation, transfer embryos (20 μl volume) to a 1.5 ml tube              containing 200 μl of ice-cold NB lysis buffer (Figure 1D1).",
    "Note:                This will correspond approximately to between 1 to 2 μg/μl of final                protein concentration. Manually homogenize embryos using a pestle (~10                strokes). Homogenization should ensure the complete breakdown of the                tissue. If pestles are to be reused, wash them thoroughly before                processing other samples. Centrifuge for 20 sec at ~10,000 rcf (4 °C) to settle down at the bottom of the tube the unprocessed tissue.Repeat manual homogenization of the centrifuged material.Centrifuge for 3 min at ~20,000 rcf (4 °C).Transfer the supernatant to a new 1.5 ml tube, avoiding the upper lipid layer (Figure 1D2). Repeat this centrifugation process (steps B2 i-j) two more times.Quantify protein concentration and dilute to the final concentration              (dependent on the requirements of downstream applications). Dilute final concentration with an equal volume of 2x Laemmli sample buffer.Heat samples for 5 min at 100 °C and immediately freeze them at -20              °C after a quick centrifuge spin-down. Extracts can be stored at -20 °C              until necessary."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}