{
  "id": 4004,
  "origin_website": "Cell",
  "title": "Obtaining purified human intestinal epithelia for single-cell analysis and organoid culture",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissociation of human pediatric mucosal biopsies\nTiming: 2 h\nThis step processes human intestinal biopsy samples to a single cell solution.\nCritical: Mucosal human biopsies should be obtained from individuals after full consent has been given and ethical approval has been obtained for its collection and use for research including for single cell studies.\nOnce obtained, mucosal biopsies should be transferred into a 1.5 mL tube with 500 μL of PBS for short term storage on ice. At least two biopsies (punch mucosal biopsies obtained during an endoscopic procedure) should be used for each digestion, to obtain cell number required for single cell RNA sequencing or organoid culture (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig1.jpg\nFigure 1. Human pediatric mucosal biopsies in a falcon tube (on the left) and visualized using a bright-field microscope (on the right)\nCritical: mucosal biopsies vary in their size and depth and therefore cell yield may vary substantially. In general, the maximum amount of tissue available should be used, and the original biopsy size should be considered when later assessing the number of cells recovered.\nRinse sample twice with PBS by removing the PBS with a pipette, and then replacing it with fresh PBS.\nTransfer sample to pre-prepared six well plate (Figure 2[href=https://www.wicell.org#fig2]). Each sample should be placed in a separate well containing a total volume of 1.69 mL; HBSS (1.3 mL) with 1.07 Wünsch units/mL of Liberase DH (350 μL) (Sigma-Aldrich) and 600 IU of Hyaluronidase (40 μL) (Merck).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig2.jpg\nFigure 2. Six-well plate with digestion solution on a platform shaker\nPlace the six-well plate on a shaker (Figure 2[href=https://www.wicell.org#fig2]) and incubate at 37°C for 15 min, rotating at 750 rpm.",
    "Once 15 min is complete, remove six-well plate from the incubator and mechanically disrupt the partially digested sample using a pre-coated p1000 pipette. Mechanical disruption involves pipetting the entire mixture up and down several times, during which the structure of the biopsy will visibly reduce, but not disappear entirely.\nPlace the six-well plate back into the incubator and rotate at 750 rpm in 37°C for further 15 min.\nRemove the sample from incubator and again mechanically disrupt the sample by pipetting up and down until the biopsy structure has been lost and the cells are in suspension; this should be achieved after pipetting for approximately 10 times (Figure 3[href=https://www.wicell.org#fig3]). At the end of the second mechanical disruption, the sample should almost entirely have broken down and lost its mucosal structure; if this is not the case, then further mechanical disruption with pipetting should be performed.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig3.jpg\nFigure 3. Pipetting mixture in six-well plate to mechanically disrupt the sample\nTransfer each sample to a 15 mL conical tube and centrifuge for 5 min at 400 g (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig4.jpg\nFigure 4. Supernatant in a 15-mL conical tube containing the crypts isolated from biopsies (on the left), crypts pelleted down after centrifugation (in the middle and on the right)\nRemove the supernatant and dilute with 500 μL of DMEM/F-12, transfer to 1.5 mL tube, then centrifuge again for 5 min at 400 g (Figure 4[href=https://www.wicell.org#fig4]).\nRemove the supernatant and repeat this step for a third time\nResuspend the sample in 1000 μL of DMEM/F-12 and filter through a 40 μm filter to remove any debris or cell clumps (Figure 5[href=https://www.wicell.org#fig5]). Transfer the filtered sample to a 1.5 mL tube and store on ice until required.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig5.jpg\nFigure 5. Setup for filtering single-cell solution",
    "To enrich the sample for epithelial cells, the cells can be sorted using EPCAM magnetic beads (see step 31 below).\nCritical: If utilising the sample for single cell RNA-sequencing, filter the sample immediately before loading the cells into the machine utilized for single cell assessment (for example, Chromium controller, 10× genomics). The cells may begin to clump after filtration and therefore the shortest time period possible should be maintained prior to loading the sample, if the cells do begin to clump, there is a high chance of the machine becoming clogged and the experiment failing.\nDissection and dissociation of the human fetal intestine\nTiming: 2 h\nThis step describes the steps required to remove the intestine from a fetal sample, and to dissociate this to a single cell suspension. The dissection may be performed at room temperature, with the sample kept at 4°C when not being dissected.\nCritical: Human fetal material should be used only after full regulatory and ethical approval (according to national and local guidelines/regulations) has been obtained for its collection and use for research including for single cell studies.\nSample should be collected into a standard sterile petri dish containing 6 mL of Hibernate medium E ( A1247601)\nIn a cell culture hood (containment category dependent on sample source) with a microscope, (for example a Leica MZ 75) the sample should be positioned supine. Take two forceps and grip the abdominal wall near to the umbilicus, then gently pull the wall in opposite directions away from the midline. The abdominal wall should readily tear; pull until the abdominal contents are exposed.",
    "Remove the liver. This is performed by inserting forceps behind the superolateral aspect of the liver and gently everting the liver from the abdominal cavity. At this point the liver will still be connected to the gut by the biliary system, so to remove the liver cut the biliary tree as close to the duodenum as possible. The liver and biliary tree should now be separate from the abdomen and can be removed.\nAt this stage, the intestine should be intact. Identify the stomach and colon by anatomical location (stomach is cranial, colon is caudal). Identify the stomach and cut the stomach away from the esophagus. Now carefully and slowly remove the stomach from the abdominal cavity into the dish, ensuring that it remains connected to the duodenum.\nCritical: Where possible, avoid gripping the intestine with the forceps and use the stomach to mobilize the intestine.\nThe intestine should be able to be removed into the dish in its entirety, however some areas may need dissecting away from connective tissue/mesentery. This should be done by carefully pulling the mesentery away from the intestine, and not directly handling the intestine.\nAt this point, the intestine can be separated entirely from the sample by cutting the distal colon\nWith the intestine now entirely dissected out of the abdominal cavity, carefully remove the remaining connective tissue/mesentery that encases it. Do so by grasping two parts of the same section and pull in opposite directions gently. With light pressure the connective tissue will gradually separate from the intestine. Repeat until the intestine forms a single long tube.\nNow the stomach can be removed by cutting at the gastroduodenal junction.\nThe colon can be separated by isolating the ileocecal junction and cutting at this site.",
    "The small intestine can then be further cut to separate the duodenum/jejunum/ileum\nDissected pieces of gut should be transferred to 0.5 mL of PBS (phosphate buffered saline) and kept on ice until further processing.\nRinse twice with Hank’s Balanced Salt Solution (HBSS) medium (Sigma-Aldrich) by replacing the PBS with 1 mL of HBSS, taking care not to remove any tissue and keeping sample on ice.\nTo digest the tissue, place the sample in HBSS medium containing 1.07 Wünsch units/mL of Liberase DH (Roche) and 600 IU of Hyaluronidase (Calbiochem) in a six-well plate (Figure 2[href=https://www.wicell.org#fig2]).\nPlace the plate on a shaking platform (750 rpm) at 37°C for 15 min.\nMechanically disrupt the digested sample by pipetting the sample up and down using a P1000 pipette. The sample should readily separate to a cellular solution after pipetting 3–4 times, however if this is not the case then pipette further until a cellular solution is achieved.\nTransfer each sample to a 15 mL conical tube and centrifuge for 5 min at 400 g.\nRemove the supernatant and dilute with 500 μL of DMEM (Dulbecco's Modified Eagle Medium), transfer to 1.5 mL tube, then centrifuge again for 5 min at 400 g.\nRemove the supernatant and repeat this step for a third time\nResuspend the sample in 1000 μL of DMEM and filter through a 40 μm filter to remove any debris or cell clusters. Transfer the filtered sample to a 1.5 mL tube and store on ice until required.\nTo enrich the sample for epithelial cells, the sample can be sorted using EPCAM magnetic beads (see step 31 below).\nEnrichment for intestinal epithelial cells\nTiming: 1.5 h",
    "Centrifuge the single cell suspension that was obtained from either the fetal intestine (step 30) or mucosal biopsy (step 11) for 5 min at 400 g.\nRemove the supernatant and resuspend the pellet with 300 μL of MACS modified buffer (see materials and equipment).\nAdd 100 μl FcR Blocking Reagent and 100 μl of CD326 (EpCAM) Microbeads per tube and mix well by pipetting. In general, the cell yield will be less than 1×107, however if the cell number is greater than 1×107 then the reagent can be scaled accordingly.\nPlace sample at 4°C for 30 min.\nAdd 5 mL running buffer (see materials and equipment), mix by pipetting, and then centrifuge at 400 g for 5 min.\nRemove the supernatant and resuspend the pellet in 600 μL of running buffer then load onto autoMACS machine and perform a “positive selection” automated cellular purification cycle.\nCentrifuge positively selected sample for 5 min at 400 g and resuspend sample in 500 μL of DMEM/F-12 and transfer to a 1.5 mL tube. Keep the sample on ice until further processing for single cell analysis or establishment of organoids. Over time the cells will begin to attach to each other, and therefore proceeding as quickly as possible with subsequent processing is advised, as well as passing the suspension through a 40 μm filter immediately prior to use.\nEstablishment and maintenance of organoids\nTiming: 1.5 h\nCentrifuge the single cell suspension obtained from either step 11, 30 or 37, for 5 min at 400 g.\nRemove the supernatant and resuspend pellet in liquid Matrigel (calculate total volume of Matrigel as 20 μL per well, plus 10%). The Matrigel should be fully thawed and kept on ice.",
    "Carefully mix the Matrigel-cell solution to ensure even distribution of the cells throughout the gel. Precise calculation of the number of cells per well is not necessary, however as an approximate guide 5,000 cells per well can be seeded. Aim to seed at least double this number when using unsorted cells. Matrigel can be used in its undiluted form, or diluted with medium up to 20% by volume if desired. Ensure the Matrigel is fully thawed and mixed prior to use (i.e., that it has become liquid, clear, and absent of crystals).\nCritical: Maintain the gel and cells on ice as much as possible and avoid prolonged periods of pipetting. If the gel becomes too warm it will begin to set and disrupt pipetting.\nOnce the cell suspension has fully mixed with the gel, pipette onto a pre-warmed (allow at least 30 min in the incubator for warming) 48 well plate using 20 μL per well, ensuring the gel does not touch the side of the well (Figure 6[href=https://www.wicell.org#fig6]). A useful tip for pipetting into a 48 well plate is to position the plate at a 45° angle from the line of site, as this allows visualization of the base of each well and therefore accurate pipetting to the central point.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig6.jpg\nFigure 6. Matrigel domes pipetted into a 48-well plate",
    "Critical: Ensure that the Matrigel/cell mix is kept on ice as much as possible; if the gel becomes too warm it will solidify and no longer able to be pipetted. The plate may cool during this process however the gel will still solidify once the plate is placed in the incubator. If the plate has cooled significantly, be aware that the gel will remain more liquid and therefore extra care should be taken when handling the plate for the gel not to touch the sides of the well.\nOnce all the samples are pipetted into the plate, the plate should be inverted and placed in the incubator for five min (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig7.jpg\nFigure 7. 48 well plate inverted to allow the gel to set and to prevent settling of the cell suspension to the bottom of the well\nCritical: Inversion of the plate should be performed as quickly as possible. If the plate is not inverted quickly the liquid gel will run to the edge of the well.\nOnce the Matrigel has set (approximately five minutes at 37°C), pipette 200–250 μL of intestinal organoid medium (see above) onto each well.\nChange medium 24 h later, and subsequently every 48 h. To change the medium, tilt the plate to 45°, then use a pipette to remove the medium from the bottom edge of the well, taking care not to disturb/ disrupt the Matrigel dome.\nTo add fresh medium, use medium that has been pre-warmed to 37°C. The medium should be applied to the bottom of the well slowly, so as not to interrupt the Matrigel dome.\nOrganoids can then be passaged either every 5–10 days, either mechanically or via enzymatic digestion (see steps 47 or 56).",
    "Critical: Rarely, infection may occur which appears as a clouding/opacification of the medium. When this occurs, the unaffected wells should be re-seeded immediately to a new plate, and the affected wells discarded in an appropriate manner.\nTo mechanically passage the organoids, using a p1000 pipette, scrape the Matrigel dome off the surface of the plate and pipette up the gel together with the medium into a 1.5 mL tube. Multiple wells can be split together, with larger plasticware required if more than six wells are used.\nGently press the tip of the p1000 pipette into the bottom of the 1.5 mL tube to flatten the aperture of the tip, and then pipette the gel/media mix several times to break up the organoids. Pipetting approximately ten times should dissociate the organoids to fragments that will quickly regenerate complete organoids, however further pipetting will generate ever smaller fragments, if desired. Assessment of this process can be performed by assessing the size of the fragments/organoids under the microscope.\nCentrifuge mixture at 400 g for 5 min.\nRemove the supernatant and resuspend the pellet in the desired volume of gel (in general, split at a ratio of 1:6 wells, and total gel volume as 20 μL per well plus 10%). If desired, other plates can be used, for example a 24-well plate, with the volumes of gel and medium adjusted according, e.g., 40 μL of gel and 500 μL medium for a 24 well plate.\nPipette 20 μL of gel to each well of a pre-warmed 48 well plate.\nInvert the plate and place in the incubator for five minutes (Figure 7[href=https://www.wicell.org#fig7]).\nCritical: Inversion of the plate should be performed as quickly as possible. If the plate is inverted quickly the liquid gel will run to the edge of the well.",
    "Once the Matrigel has set (approximately five minutes at 37°C), pipette 200–250 μL of pre-warmed (37°C) intestinal organoid medium (see above) onto each well (Figure 8[href=https://www.wicell.org#fig8])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/720-Fig8.jpg\nFigure 8. Human intestinal organoids in Matrigel with media applied in a 48-well plate\nChange medium 24 h later, and subsequently every 48 h.\nOrganoid can be maintained in this manner for over one year, and if required can be cryopreserved. To cryopreserve organoids, remove the media from four wells and replace with 1 mL of cell recovery solution (250 μL per well). Transfer the gel and cell recovery solution to a 1.5 mL tube and keep on ice for 20 min.\nCentrifuge at 400 g for five min. Remove the supernatant and wash in basal medium twice.\nRe-suspend the pellet in 500 μL freeing medium and place in a freezing container, then transfer to a −80°C freezer. After 48–72 h, the sample may then be transferred to storage in liquid nitrogen.\nTo thaw the organoids, place the vial into a water bath at 37°C. As soon as the sample has thawed, wash three times in basal medium, then resuspend in Matrigel and re-plate the organoids with an appropriate volume of medium.\nDissociation of organoids and processing for single-cell RNA sequencing\nTiming: 45 min\nThis step dissociates intestinal organoids to a single cell suspension for single cell RNA-sequencing and/or organoid passaging.\nRemove the organoid medium and replace with 200 μL of Cell Recovery Solution.\nUsing a p1000 pipette, scrape the gel off the bottom of the plate and pipette up with the cell recovery solution. Transfer to a 1.5 mL Eppendorf tube and incubate on ice.\nEvery 5–10 min, invert the tube and place back on ice to prevent the gel settling at the bottom of the tube.",
    "After 20mins on ice, centrifuge the sample at 400 g for 5 min. If Matrigel has not fully dissolved, maintain on ice for further five minutes and repeat until this is the case.\nRemove supernatant and re-suspend in 500 μL of pre-warmed TrypLE; incubate for 10 min in a water bath at 37°C. The sample should be assessed under a microscope to assess whether further incubation time is required.\nAdd 500 μL of refrigerated DMEM and centrifuge at 400 g for 5 min, remove supernatant and resuspend in 500 μL of DMEM (4°C). Repeat this step for a total of three times.\nCritical: It is vital to remove as much of the supernatant as possible to ensure thorough removal of any enzyme mix.\nCritical: Prior to loading the cells for single cell analysis, it is critical to filter the cells through a 40μm filter as described above."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Organoids",
    "Clinical Protocol",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}