{
  "id": 1999,
  "origin_website": "Cell",
  "title": "A protocol for extracting immunolabeled murine cardiomyocytes of high-quality RNA by laser capture microdissection",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissection and snap-freezing of mouse heart\nTiming: 2–3 h, depending on number of mice sacrificed\nIn this step, murine hearts were excised, washed, and embedded in OCT-filled cryomolds (Figure 1[href=https://www.wicell.org#fig1]). Hearts were collected from C57BL/6 mice (n=6) housed in the Biological Services Unit at King’s College London. Mice were culled via schedule 1 method, in accordance with the regulations for animal testing, directed by the Home Office and stipulated under the Animals (Scientific Procedures) Act 1986.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig1.jpg\nFigure 1. Stepwise illustration of step 1—Murine heart dissection and embedding in OCT\nTiming: [2–3 h, depending on number of mice]. 1 mouse heart takes 15–20 min to dissect.\nDissecting out the murine heart:\nUse sterile forceps and small, sharp scissors to cut the chest skin and expose the heart.\nCut the thoracic cage using bigger scissors and dissect the heart out after severing the arteries and veins connected to it.\nTransfer the heart to a Petri dish containing 1× PBS.\nWash the heart several times with fresh PBS using individually wrapped transfer pipettes.\nDispose of the carcass using labeled biohazard bags.\nEmbedding the excised heart:\nFill half of an embedding cryomold with OCT slowly and carefully.\nUse the disposable scalpels to cut the heart into 2 transverse sections.\nOrient each individual section on the floor of one embedding cryomold pre-filled with OCT.\nFill the rest of the cryomold slowly with OCT till the whole tissue is covered, avoiding creation of bubbles.\nUsing forceps, quickly and carefully lower the tissue in the cryomold into the liquid nitrogen so it is partially submerged and sitting just on top of the liquid nitrogen.",
    "Critical: Do not submerge the whole of the cryomold into liquid nitrogen. Make sure the top of the cryomold is visible. Total immersion of OCT embedded tissues into liquid nitrogen results in cracked OCT, formation of bubbles within the specimen and resulting in very difficult cryosectioning.\nPause point: After the OCT becomes solid white (∼10–15 s), place the frozen tissue into −80°C freezer for storage.\nNote: Prior to dissection, label the cryomolds and sterilize the dissection instruments. Spray the dissection tools with RNaseZap™, then RNase-free, DNase-free water and dry with clean Kimwipes. Spray the dissection area with RNaseZAP™ solution and let dry.\nCryosectioning and slide storage\nTiming: 2–4 h depending on the number of blocks cut and number of sections required\nIn this step, murine hearts are cryosectioned on PEN slides and stored in sterile Falcon tubes containing silica desiccant beads.\nPrepare PEN membrane slides as follows:\nSpray RNaseZap™ on the PEN slide and leave for 5 min.\nWash with DEPC water.\nUV light for 30 min (distance between the PEN slide and the UV lamp should not be more than 20 cm).\nWhen the slides are UV-treated, label and keep them face up at room temperature.\nPrepare the cryostat and tissue block:\nSet temperature of the cryochamber at −22°C and the specimen temperature at −20°C.\nClean the cryostat, microtome blade and tools with 70% ETOH. Wipe dry.\nSet the section thickness on the cryostat to 8 μm. If cutting a new tissue block, set the cryostat to trim 20 μm thick sections until the whole tissue is exposed. Then adjust the thickness to 8 μm.\nRemove the tissue block from the cryomold, mount it on the chuck using OCT and place the tissue/chuck assembly in the cryostat chamber and allow to equilibrate for 15 min.\nCryosectioning:",
    "Secure the chuck in the chuck stage and carefully bring the specimen very close to the blade.\nTo mount sections on the PEN slides, brush away tissue trimmings, then slowly cut and tease the tissue section away from the blade using paintbrushes.\nGently unroll the cut section using the paint brushes and pivot the PEN slide (membrane side facing the tissue section) slowly on top of the section (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig2.jpg\nFigure 2. Cartoon depicting mounting of OCT-embedded cardiac cryosection on PEN slides\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig3.jpg\nFigure 3. Murine cardiac sections mounted on PEN slides\nCare must be taken to mount the sections within the PEN membrane area (dotted outline). Ruler is in centimeters.\nCarefully remove the mounted tissue from the chuck using a razor blade, transfer the tissue back to the cryomold, wrap the cryomold with aluminum foil and keep on dry ice until storage in −80°C freezer.\nPause point: Collected sections on PEN slides can be stored individually in 50 ml Falcon tubes containing ∼5 ml silica desiccant beads and stored in −80°C freezer.\nCritical: humidity condensation on PEN slides will activate RNases in tissue sections. After getting the stored Falcon tubes out of the −80°C freezer, allow them to equilibrate to 25°C completely before opening the lid (∼15 min).\nCritical: avoid mounting sections near the edges or the end of the slide (Figure 3[href=https://www.wicell.org#fig3]). Sections mounted near the edges will not stain properly and will not be seen in the field of view during LMD.\nNote: in this protocol, we found that 8 μm cardiac section thickness allowed good tissue adhesion to the PEN membranes, adequate microscopic resolution and reduced the laser energy sufficient for cutting through the tissue section, without compromising the RNA yield or quality. Further optimization is warranted on thicker sections.",
    "Note: murine hearts are small and up to 4 sections can fit within the membrane area. If working with larger organs, care must be taken to cut fewer section per PEN slide.\nIHC staining and cell procurement using LMD\nTiming: For one slide, IHC: 15 min and LMD < 90 min\nTo visualize cells and regions of interest on tissue sections prior to LMD, histochemical stains like toluidine blue, Cresyl violet and H&E can be used. However, beside the compromised histomorphology due to extensive dryness of the tissue sections, histochemical stains fail to detail the identity and molecular characteristics of the cells of interest, which can be crucial in the downstream analyses and prior to an LMD study. This makes immunolabeling a key prerequisite to identify cell types that cannot be marked by histomorphology alone during LMD. Nevertheless, conventional IHC protocols comprise several rinsing steps and overnight incubations that can dramatically deteriorate the nucleic acids. This, in addition to the intrinsic degrading activity of RNases which come back to life as soon as the tissue is rehydrated and not frozen anymore. In this step, cardiac sections are immunolabeled with WGA and DAPI. Thereafter, cardiomyocytes will be selected, microdissected and catapulted into AdhesiveCap 500 opaque collection tube. All solutions used in this step must be kept on ice at all times and all incubations must be performed on ice.\nImmunolabeling murine cardiac sections (Figure 4[href=https://www.wicell.org#fig4]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig4.jpg\nFigure 4. IHC workflow for staining of frozen heart sections with WGA antibody and DAPI prior to LMD\nFix sections in 100% acetone on ice for 5 min.\nUse a PAP Pen to outline membrane area and prevent spread of solutions.\nPipette 500 μL, PBS-RNAsecure™ on the section and decant after 30 s, repeat twice.\nIncubate sections with primary antibody cocktail for 5 min.",
    "Decant the antibody, pipette 500 μL PBS-RNAsecure™ on the section and incubate for 30 s, repeat twice.\nDehydrate sections by sequentially dipping the slide into 50 mL of 50%, 75%, 95%, 100% ETOH for 30 s, each.\nProceed directly to LMD.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig5.jpg\nFigure 5. Histochemical staining of cardiac sections\n(A and B) Raw images captured using ZEISS PALM MicroBeam Laser Micro-dissection system. Frozen cardiac sections stained with (A) CV or (B) H&E. (A) Staining with CV revealed dark violet nuclei and light violet cardiac tissue without accurate identification of cardiomyocytes. (B) Staining with H&E revealed dark blue nuclei and pink cardiac tissue labeled by eosin. Scale bar=75 μm.\nOptional: In this protocol, we used Texas Red™-X conjugate of WGA which exhibits the bright, red fluorescence of the Texas Red™ dye (excitation/emission maxima ∼595/615 nm). Molecular Probes® offers a broad selection of fluorescent wheat germ agglutinin conjugates that can be used depending on the filter sets available in the Laser Microdissection system used.",
    "Optional: Two types of RNase inhibitors were used in the current protocol. The first one, RNASecure™ was used in the treatment of all buffers. Then for extra protection of the precious RNA prior to antibody staining, another RNase inhibitor RNaseOUT™ was added at a concentration 2 U/μL to the antibody incubation buffer. RNASecure™ requires activation by heating at 60°, therefore it was not possible to use it with the antibody incubation buffer used. A recent study demonstrated that the inclusion of a moderate amount of a small ribonuclease inhibitor, Ribonucleoside Vanadyl Complex (RVC), in staining and washing steps effectively protected RNA and yielded high quality RNA profiles from as little as a few tens of dissected cells (Zhang et al., 2021[href=https://www.wicell.org#bib11]). The excellent RNA preservation quality of RVC is mostly owing to its small size and fast diffusion in dense tissue sections. One potential problem with the use of RVC is its effect on downstream procedures, including reverse transcription and/or PCR that are required for the construction of cDNA sequencing libraries, owing to its adverse effect on polymerases (Lau et al., 1993[href=https://www.wicell.org#bib7]). Therefore, RVC must be removed from the dissected materials before the downstream procedures can be performed properly.",
    "Note: As it is often done in diagnostic histopathology, cells and regions of interest are identified in tissue sections prior to LMD according to morphological or histochemical peculiarities. To start with, the accuracy of visualizing individual cardiomyocytes in cardiac sections was assessed either by histochemical staining using Cresyl violet (CV) or hematoxylin and eosin (H&E). The two staining procedures were performed in 5 min and sections were inspected under brightfield light microscopy. The histochemical stains did not make it possible to recognize the tissue architecture or identify the different cell types in the cardiac section (Figure 5[href=https://www.wicell.org#fig5]). We were unable to confidently identify cardiomyocytes for microdissection using histochemical staining.\nLaser Capture Microdissection (LMD):\nGloves must be worn throughout the whole LMD procedure which, ideally, should not exceed 90 min.\nInitiating PALM RoboSoftware:\nSwitch on the computer, microscope and the laser 5 min before performing LMD.\nLaunch PALM RoboSoftware and wait few minutes until the stage calibrates.\nNote: This is accompanied by loud noise that will stop once the stage returns to home position.\nPALM RoboSoftware controls all operations in the system such as platform movement, objective selection, light intensity, exposure time, condenser control, white balance and contrast, autofocusing, slide and region of interest selection, camera specifications, and laser parameters like speed, thickness, and energy (Figure 6[href=https://www.wicell.org#fig6]).\nLoading PEN slides and tubes:\nFor loading the slide: push the metal bar to the left and slot the slide into one of the 3 slide holders (Figure 7[href=https://www.wicell.org#fig7]A). The slide is locked in place by releasing the metal bar slowly. Unless the slide is firmly held in the slide holder and the metal bar is stable in place, the outlines drawn around selected cells will be changed during laser cutting. This will result in inclusion of irrelevant cells/areas in the procured elements.",
    "For loading the tube: the tube cap was slotted into the horseshoe and the tube was pinned back (Figure 7[href=https://www.wicell.org#fig7]B).\nClick “Capture Device” which opens the PALM RoboMover then PALM CapMover II window.\nUse the PALM RoboMover to select Collector type: TUBE 2 × 500 CMII.\nSelect position (1) or (2) according to which tube position was chosen (Figures 7[href=https://www.wicell.org#fig7]C and 7D).\nCamera and microscope adjustments:\nOn the screen, from the “Display” menu, choose “Camera” and select the installed camera from the drop-down menu.\nUse the Joystick to move the PEN slide to a section-free area and select “White Balance”. Move back to the tissue section area.\nFrom the “Microscope” menu, choose “Reflected Light” and select 5× objective lens to identify the area or cell of interest prior to dissection. Use these options later to change the microscope magnification.\nSelect “Focus” then select channels for inspection of fluorescently immunolabeled cells. For our experiments, the FS45adv filter set was chosen for inspection of Texas Red™-conjugated WGA and the FS96adv filter set for inspection of DAPI-positive nuclei.\nTo activate or deactivate the fluorescence beam, open or close the fluorescence shutter, respectively.\nImaging: at any time during LMD, the image displayed on the screen (either showing the slide or the cap) can be captured and saved in one step by clicking “Save Current Image”.\nCalibration:\nClick “Calibration” from the main menu, then select “Cut Laser Adjustment Wizard” from the drop-down menu.\nProceed with rough laser adjustments, then set the laser marker by positioning the cursor precisely over the center of the marker hole created.",
    "Calibration is an indispensable step that should be repeated each time a new experiment is conducted, or a new magnification is selected. The alignment and position of the laser marker must be calibrated with respect to stage movement; this is very important as an inappropriate alignment will not allow for isolation of selected cell populations.\nSetting-up a multi-dimensional acquisition experiment to select cells:\nThis setup is key to visualize overlayed images of WGA+ DAPI+ cardiomyocytes.\nTo acquire, select the “Multi-Dimensional Acquisition” icon from the toolbar, then create/modify multi-dimensional acquisition experiments from the drop-down menu.\nEnter and save parameters of the dyes (Texas Red™ and DAPI) and exposure times for each fluorescence channel used.\nSave the experiment and click on the icon again to start an experiment.\nAcquired images can be saved and viewed individually or in an overlay to further select the cells of interest.\nLaser cutting:\nThis process should be started in a non-precious area of the slide until the laser cut is optimized, before moving to the area(s) of interest.\nSelect “MicroBeam” from the “Laser” menu to adjust laser settings.\nFor the cardiac tissue sections, laser settings were typically for the CUT Energy: 38, Focus 60, and for the LPC Energy: 23 and Focus 5.\nAdjust the laser speed to 8–10 μm/s to minimize the cutting energy used.\nDraw a line around cardiomyocytes or cells of interest using freehand drawing tool.\nSelect “RoboLPC” cutting function from the cut tools to simultaneously cut and catapult the cell or area of interest and click “Start Cutting Laser”.\nSelect “Oneclick-LPC” if the cell/area was partially catapulted and click inside the cell/area outline to fully catapult it.\nAll selected cardiomyocytes (DAPI nuclei in the center surrounded by WGA membrane stain; see Figure 7[href=https://www.wicell.org#fig7]) were laser cut and catapulted into the adhesive cap.",
    "Laser cutting of all selected elements should be monitored carefully during the whole LMD procedure because cutting parameters may require readjustments for some areas in the tissue section.\nChecking the cap and elements:\nChecking the cap needs to be done regularly by clicking “Go to Cap Check”. Cap check enables the visualization of catapulted cells by moving the underlying stage and leaving only the cap in the microscopy light path.\nIn our case, we change to the lowest magnification (5×) to visualize the largest area possible of the cap.\nIf elements start to accumulate in an area of the cap, move the stage to reach an empty area in the cap and click “Capture Device”, choose “Adjust” option, click “Save Position as delta position for the collector”, click “Close”.\nTo move the stage from “Cap Check” back to the point of origin (cutting position), click “Point of Origin”.\nTo check if target number/area of elements are collected: Click “Element List”, choose the “Summary” sheet then click “Print” to save summary of total elements collected.\nOnce enough material has been collected, click “Capture Device”, click on “Home” to return the tube holder to start position.\nIn our experiments, 50–250 cardiomyocytes were captured for downstream gene expression analysis and the tube was displaced from its position.\nFor quality control, a new microfuge tube was quickly mounted on the tube holder and a total of 1 mm2 tissue chunks were microdissected from the same section.\nProceed directly with cell lysis for microdissected tissue chunks and captured cardiomyocytes according to the workflow in steps 4 and 5, respectively.\nCritical: If cryosectioning and LMD are done on separate days, avoid thawing of PEN slide/tissue section by using dry ice during transportation.",
    "Optional: In our experiments, cardiomyocytes were collected into AdhesiveCaps of 500 opaque collection tube (Figure 7[href=https://www.wicell.org#fig7]C). Alternatively, commercially available RNase-free tubes can be used and a small drop of RNA stabilizers e.g., TriZol can be dispensed in the cap before collection of elements to minimize RNA degradation. Microfuge tubes with AdhesiveCaps were chosen for these experiments because they allow LMD without applying any capturing liquid into the caps which minimizes the risk of evaporation and crystal formation during extended specimen harvesting.\nNote: We recommend having one section only on each PEN slide and collecting < 250 cells in each LMD session to avoid taking too much time, which will lead to extensive degradation of RNA of the LMD-procured cells. Later, all stored lysates from cells procured for the same experiment can be pooled before proceeding with RNA isolation.\nNote: More details for the LMD and software operation are available in the instrument user guide[href=https://www.research.uky.edu/uploads/zeiss-palm-microcapture-manual] provided by the manufacturer.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig6.jpg\nFigure 6. PALM RoboSoftware layout\nThe software controls all parameters of the LMD, camera, slide and tube holders, laser and imaging. Parameters used in the current study are marked in Bold in the list of tools on the right.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig7.jpg\nFigure 7. Loading PEN slides and tubes\n(A and B) The slides were loaded on the slide holder (A) on the movable stage of the LMD (B).\n(C and D) Tubes are inserted into the tube holder (C) and on the PC screen, position (1) was chosen because the tube and adhesive cap were loaded at position (1) on the tube holder (D).\nRNA isolation from LMD-microdissected 1 mm2 tissue chunks for quality control\nTiming: For 1 sample, 1 h",
    "In this step, we describe RNA isolation from LMD-microdissected chunks of cardiac tissue (approximately 1 mm2). Isolated RNA will be used for quality control to assess the impact of the protocol on RNA integrity.\nExtracting RNA using Qiagen RNeasy® Plus Micro Kit:\nAdd 350 μL Buffer RLT containing 2-Mercaptoethanol to the bottom of the tube into which 1 mm2 tissue chunks were catapulted in the AdhesiveCaps, close the cap and incubate in an upside-down position at 25°C for 30 min.\nSpin down the lysate in a microcentrifuge for 5 min at no more than 8,500×g at 25°C to avoid detachment of the adhesive cap.\nStore the tube on ice until RNA isolation which we recommend performing on the same day, avoiding any freeze-thawing cycles.\nPerform the rest of RNA isolation steps according to the manufacturer’s instructions[href=https://www.qiagen.com/us/resources/download.aspx?id=e112adfa-cc06-4e29-87f8-4820062ae44e&lang=en].\nElution of RNA in the final step was performed using 14 μL RNase-free water supplied with the kit, with the following modification:\nDispense 7 μL on the column’s filter and centrifuge at 16,000 × g for 30 s.\nDispense another 7 μL of RNase-free water and centrifuge at 16,000 × g for 30 s.\nFinally, pipette the eluted 14 μL on the column’s filter and centrifuge at 16,000 × g for 1 min.\nAssess the quality and concentration of 1 μL of the isolated RNA using Bioanalyzer and Agilent RNA 6000 Pico kit and store the remaining RNA at −80°C.\nNote: The concentration and integrity of RNA isolated from < 0.5–1 mm2 microdissected tissues were below the detection limit of the Bioanalyzer. Therefore, it was not possible to perform quality control on as few as 250 cardiomyocytes.\nNote: This is a brief outline of RNA isolation of LMD-procured tissue chunks. For detailed procedure and troubleshooting, follow the manufacturer’s instructions[href=https://www.qiagen.com/us/resources/download.aspx?id=e112adfa-cc06-4e29-87f8-4820062ae44e&lang=en].",
    "Gene expression analysis of LMD-procured cardiomyocytes\nTiming: For 1 sample, ∼4 h\nIn this step, we adapt the Cells-to-CT workflow to prepare LMD-procured cardiomyocytes for RT-qPCR analysis without the need for traditional sample heating, column-based RNA isolation and purification (Figure 8[href=https://www.wicell.org#fig8]). Cell lysis must start directly in the AdhesiveCaps containing the microdissected elements once the microfuge tube is removed from the tube holder of the LMD.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1481-Fig8.jpg\nFigure 8. Schematic representation the RT-qPCR workflow using SYBR™ Green Fast Advanced Cells-to-CT™ Kit\nPrepare the Cells-to-CT lysate:\nPrepare fresh Lysis reaction after all cardiomyocytes are captured by LMD.\ntable:files/protocols_protocol_1481_4.csv\nDispense 50 μL of lysis reaction on top of the microdissected cardiomyocytes in the AdhesiveCap, pipette up and down several times for 1 min.\nIncubate the lysis reaction mix upside down for 5 min at room temperature.\nSpin down the lysate and add 5 μL Stop Solution to the lysis reaction, pipette up and down five times and incubate for 2 min at room temperature.\nStore the lysate on ice for ≤2 h, or at −20°C to −80°C for ≤5 months.\nPerform reverse transcription (RT):\nIn a nuclease-free microcentrifuge tube on ice, prepare an RT Master Mix.\ntable:files/protocols_protocol_1481_5.csv\nMix the RT Master Mix gently but thoroughly, then spin down and place on ice.\nIncubate the RT mix at 37°C for 30 min then 95°C for 5 min.\nAssembled RT reactions can be stored at 4°C for up to 4 h.\nPerform qPCR:\nIn a nuclease-free microcentrifuge tube at room temperature, prepare the PCR Cocktail\ntable:files/protocols_protocol_1481_6.csv\na Recommended final concentration of each primer is 200–400 nM.\nPrimers used in the current study are listed in Table 1[href=https://www.wicell.org#tbl1].\nDistribute the PCR Cocktail into individual PCR tubes or wells of a real-time PCR plate at room temperature.",
    "Pipette cDNA up and down slowly 4–5 times and add 6 μL cDNA to 14 μL PCR Cocktail.\nClose the tubes or cover the plate, then mix gently.\nSpin down the tube contents to remove bubbles and collect the contents at the bottom of the wells.\nSet up the real-time PCR instrument as indicated in the following table, then load and run the reactions.\ntable:files/protocols_protocol_1481_7.csv\nNote: for more details about SYBR™ Green Fast Advanced Cells-to-CT™ procedure and troubleshooting, refer to the manufacturer’s guidelines[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2FMAN0017755_SYBRGreenFastAdvancedCells-to-CT_UG.pdf].\nOptional: In this study, the Cells-to-CT kit was used to process and measure gene expression in 10, 50 and 250 LMD-procured cardiomyocytes. To detect less abundant transcripts in smaller numbers of cells, a workflow using TaqMan Pre-Amp Cells-to-CT kit and TaqMan Gene Expression Cells-to-CT, specifically designed to extend material from valuable or small amounts of sample, has been previously described (Abruzzese et al., 2010[href=https://www.wicell.org#bib1])."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Cell Isolation",
    "Microscopy"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}