{
  "id": 10870,
  "origin_website": "Jove",
  "title": "Biomembrane Fabrication by the Solvent-assisted Lipid Bilayer (SALB) Method",
  "procedures": [
    "1. Formation of Supported Lipid Bilayer on a Hydrophilic Solid Support\nPrepare lipid stock solutions of 10 mg/ml 1,2-dioleoyl-sn-glycero-3-phosphocholine (DOPC) and 1 mg/ml 1,2-dioleoyl-sn-glycero-3-phosphoethanolamine-N-(lissamine rhodamine B sulfonyl) (Rh-PE) by dissolving the respective lipid powders (appropriately weighed beforehand with an analytical mass balance) in isopropanol solution.\nDilute and mix the stock solutions in isopropanol in order to prepare the desired lipid mixture at the final concentration. For fluorescence microscopy and FRAP experiments,0.5 wt% Rh-PE should be included in the lipid mixture.\nInject the lipid mixture in isopropanol into the microfluidic channel until it is filled.\nIncubate the lipid mixture on the glass surface for about 10 min.\nGradually replace the lipid solution with water or buffer solution using a peristaltic pump at a very low flow rate (10-50 µl/min). Alternatively, replace the lipid mixture by repeated pipetting.\nRinse the channel thoroughly with excess buffer in order to remove the residual isopropanol.\n2. Formation of Cholesterol-enriched Supported Membranes\nNote: The solid surface (SiO2) supports vesicle fusion, but the membrane composition (high cholesterol) inhibits vesicle fusion because cholesterol-enriched vesicles have high bending rigidity30.\nPrepare a stock solution containing 10 mg/ml DOPC lipid, 10 mg/ml cholesterol, and 1 mg/ml Rh-PE by first dissolving the respective powders in isopropanol.\nRepeat steps 1.2-1.6 using the stock solutions prepared in step 2.1.\n3. Membrane Fluidity Assay\nImmerse the glass slide in sodium dodecyl sulfate (SDS) solution (1%) for 10 min.\nWash the slides thoroughly with deionized water and rinse with ethanol.\nBlow-dry slides using a gentle stream of nitrogen.\nExpose the slides to oxygen plasma for 30 sec at maximum radiofrequency power in the oxygen plasma chamber.\nRemove the protective film coating of the bottomless commercial microfluidic chamber (Figure 1A) using a tweezer and attach the glass slide onto the sticky side of the chamber (Figure 1B).",
    "Assemble the connectors and tubing into the inlet and outlet positions of the chamber and place the microfluidic channel on the microscope stage (Figure 1C).\nForm a fluorescently-labeled supported lipid bilayer in the microfluidic channel [repeat step 1 using the desired lipid composition (e.g., 0.5 mg/ml DOPC) including 0.5 wt% Rh-PE in organic solvent].\nLocate the bilayer plane with a 60X oil immersion objective (NA 1.49) in order to capture images.\nTake two pre-bleach images, then photo-bleach a 30 µm wide circular spot with a 532 nm, 100 mW laser beam. Before photobleaching, warm up the laser until its intensity has become stable. Immediately after photobleaching, capture a series of images every 1 sec for 2 min in order to follow the recovery in fluorescence intensity at the bleached spot.\n4. Cholesterol Quantification Assay\nExpose the silicon dioxide-coated quartz crystal sensor chip to oxygen plasma for 30 sec at maximum radiofrequency power in the oxygen plasma chamber. Remove the chip from the chamber and immediately mount the chip in the measurement chamber.\nBefore experiment, first acquire the frequency and dissipation of the sensor chip in air in order to ensure proper mounting.\n\t\nFor the commercial Q-Sense E1 or E4 QCM-D instrument, run the Q-Soft software program and click “Acquisition” and select “Setup Measurement”.\nIn the new window which appears, check the 3, 5, 7, 9, 11 and 13 overtones and then click Find and Run in order to check the resonance spectra. Set the temperature at 24 °C. If one or more resonance frequencies do not agree with the expected values, check the chip mounting and re-perform this step until an agreement is reached.",
    "Start the peristaltic pump and flow buffer solution (10 mM Tris, 150 mM NaCl, pH 7.5) into the measurement chamber at a flow rate of 100 µl/min.\nIn the software program, click “Acquisition” and select “Restart Measurement” in order to record the resonance frequency and energy dissipation signals. Repeat this step until a stable baseline is obtained for the frequency and dissipation shifts. Note: For steps hereafter, there will be additional frequency and dissipation shifts which can be recorded as a function of time.\nInject isopropanol (without lipid) for 10 min.\nInject the mixture of DOPC lipid/cholesterol at the desired molar ratio with a total lipid concentration of 0.5 mg/ml in isopropanol for 10 min.\nInject buffer for 20 min at a flow rate of 100 µl/min.\nInject a solution of 1 mM methyl-β-cyclodextrin (MβCD) prepared in buffer (flow rate 100 µl/min) until the frequency signal reaches a stable value.\nMeasure the relative positive frequency shifts that is caused by the MβCD treatment step and calculate the mass of cholesterol and DOPC lipids by converting the Δfcho and ΔfDOPC values to mass values by using the Sauerbrey equation [Δm = -(C/n)×Δf, where C=17.7 ng/cm2, n:overtone].\nCalculate the mole fraction of cholesterol in the SLB, taking into account the molecular weights of DOPC lipid (786.1 g/mol) and cholesterol (386.6 g/mol)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}