{
  "id": 2040,
  "origin_website": "Cell",
  "title": "A protocol to enrich in undifferentiated cells from neuroblastoma tumor tissue samples and cell lines",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCD44hi cell sorting – day 1\nTiming: 5–6 h\nCD44hi cells are sorted from neuroblastoma cell lines.\nObtain a single cell suspension for labelling.\nAspirate media from a tissue culture flask with SK-N-SH cells and gently wash the cells twice with a volume of PBS without Ca2+ and Mg2+ enough to cover the cell layer (3 mL for a 25 cm2 cell culture flask).\nAspirate PBS and add a volume of Versene enough to cover the cell layer (500 μL for a 25 cm2 cell culture flask). Incubate at 37°C in the cell incubator for 5 min.\nStop the dissociation by adding 2 mL of FACS medium and resuspend cells by pipetting up-and-down until a homogeneous cell suspension is achieved.\nTransfer cell suspension to a sterile 15 mL plastic tube and centrifuge at 300 × g for 5 min.\nDiscard the supernatant and resuspend the cell pellet with 1 mL of FACS medium gently pipetting up and down.\nPass through a sterile cell strainer with 40 μm pore size into a sterile 50 mL tube to remove non-dissociated cell aggregates.\nCount the number of cells in the suspension and calculate the viability by mixing a small aliquot with an equal volume of trypan blue. Use manual or automatic cell counting.\nPrepare a suspension of at least 1 × 106 cells per 100–200 mL of FACS medium for labelling. Prepare also a suspension of at least 2 × 104 cells for unlabeled cells and 2 × 104 cells for cells to be labelled only with secondary antibody as controls.\nNote: Proper digestion and preparation of cells into a single cell suspension is crucial for the efficient collection of the fluorescently tagged population.\nLabelling of cells for fluorescence-activated cell sorting (FACS).",
    "Incubate sample cell suspension with 1 μg of CD44 primary antibody for 40–60 min on ice.\nWash cells 3 times with 1 mL cold FACS medium with gentle centrifugation (5 min at 300 g and 4°C) between washes.\nIncubate on ice for 30 min with Alexa488-donkey-α-mouse at 1:500 dilution in a volume of 200 μL. Keep protected from light from this step on.\nNote: pipet up and down gently in the middle of the incubation when possible.\nAlternatives: The use of a secondary antibody is not needed if a conjugated primary CD44 antibody is used.\nWash cells 3 times with 1 mL cold FACS medium with gentle centrifugation (5 min at 300 g and 4°C) between washes.\nPlace the cell suspension in the appropriate tube for sorting, passing the cell suspension through a 50 μm cell strainer before sorting.\nSorting of CD44hi cells.\nUse forward and side scatter density plots to exclude debris.\nUse secondary antibody control to set gates for positive fluorescence.\nUse CD44 expression distribution levels for gating strategy, defining the population with high CD44 expression (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1523-Fig1.jpg\nFigure 1. CD44 expression in SK-N-SH cells\nRepresentative dot-plots showing CD44 expression and sorting strategy. Immunofluorescence show CD44 and DDC (adrenergic marker) expression in sorted populations. Scale bar: 25 μm. Published with author’s permission.\nRecovery of CD44hi cells.\nSeed 1 × 105 of recovered sorted cells per well in a 6-well ultralow binding plate with 2 mL of pre-warmed NCM. Transfer the 6-well plate to a 37°C, 5% CO2 incubator overnight (6–18 h).",
    "Note: The flow cytometer to be used must have the proper lasers and filters to detect the emission spectrum of the fluorescent protein. We performed flow cytometry analyses and sorting in a BD FACS Aria cytometer, which allows for stringent gating to ensure the collection of a pure population. Users can adjust the gate depending on the stringency of their experiment. Also ensure that sorting is performed under sterile conditions as cells are going to be cultured long-term after the sorting.\nAlternatives: The sorting can be carried out with dissociated cells from tissue samples, like PDXs, as the ones obtained from the alternative step 2 described above. In this case sorting is carried out right after dissociation with a similar strategy. CD24 is used as a negative selection marker in the case of xenographs to eliminate possible CD44+ host cells.\nAlternatives: The following protocol can be performed using unsorted SK-N-SH cells as starting point. In this case, resulting tumorspheres will be enriched in any case in CD44hi cells which can be sorted later to eliminate possible differentiated cells present in the spheres. The main advantage of sorting early rather than sorting after obtaining the tumorspheres is that you can obtain more undifferentiated cells without the interference of the tumorspheres/aggregates formed by CD44- differentiated cells. We would only recommend sorting the resulting tumorspheres to save time at the beginning of the protocol or to remove possible differentiated cells in the tumorspheres.\nTumorsphere culture – day 2\nTiming: 1 h\nCells are prepared and seeded for growing as tumorspheres.\nNote: Use appropriate number of wells at start, as required, taking into account that the culture will be amplified in subsequent steps.\nNote: Pre-warm complete DMEM medium and trypsin in a water bath at 37°C. Pre-warm NCM medium at room temperature.",
    "Note: For unsorted SK-N-SH cells, start with a culture at around 70% confluency and follow steps 1.a–g. Use low passage cells as a starting point (below 5). For sorted SK-N-SH cells, continue from 5.a.\nObtain a homogeneous single cell suspension.\nObserve under the microscope and recover all previously sorted cells from the ultralow binding plate.\nPass through a sterile cell strainer with 40 μm pore size to remove possible aggregates. Alternatives: alternatively dissociate aggregates resuspending in Versene after gentle centrifugation. Centrifuge again and recover cells in NCM media.\nCount the number of cells in the suspension and calculate the viability by mixing a small aliquot with an equal volume of trypan blue. Use manual or automatic cell counting.\nNote: We use an automatic cell counter with parameters adjusted to the cell line in use. Direct counting under a microscope with a hemocytometer is also possible. Either way, ensure you have an accurate quantification and, by imaging, that you have a single cell suspension.\nCritical: A single cell suspension is critical to ensure the clonality of the tumorspheres (see troubleshooting, problem 1[href=https://www.wicell.org#sec6.1]).\nPlating cells for primary tumorsphere.\nAdd 2 mL of pre-warmed NCM per well in a 6-well ultralow binding plate.\nMix the cell suspension a few times by pipetting before plating.\nFor each well, pipette a volume of cell suspension so that the final concentration in the plate is 1–2.5 cells/μL (2,500–5,000 cells in 2 mL of media). Plate as many wells as necessary.\nEnsure even distribution of the cells in the well by slowly moving the plate drawing a cross and by gentle tapping.\nCarefully transfer the 6-well plate to a 37°C cell incubator for 7 days.",
    "Critical: Even distribution of the cells in the well is critical to ensure the clonality and growth of the tumorspheres. Ensure that the plate is maintained completely flat at all times in the incubator. Do not move or remove the plate form the incubator until the final day. Big groups or clumps can be formed otherwise (see troubleshooting, problem 1[href=https://www.wicell.org#sec6.1]).\nNote: Plates can be incubated for 5–10 days, depending on the cells used and the desired outcome. We normally incubate for 7 days.\nNote: Tumorspheres can be also plated in 24-well plates, seeding 600 cells per well in 1 mL of NCM.\nAlternatives: The protocol can be easily adapted to a single cell tumorsphere assay to better asses clonality. In this case a single cell per well is seeded on a 96 well plate with 150 μL NCM. As only around 1% of cells will form tumorspheres, a high number of plates are needed.\nRecovery and passage of primary tumorsphere – day 8\nTiming: 1.5 h\nPrimary tumorspheres are imaged and collected. Once dissociated, cells can be plated to form secondary tumorspheres.\nImaging and collection of primary tumorspheres.\nObserve the plate under the microscope. Visible dispersed cell spheres should be observable.\nGently rotate the plate in circles so that the tumorspheres concentrate in the middle of the well.\nNote: This motion will concentrate them by size, with the bigger spheres reaching the center quicker than the small ones or small aggregates. If the formed tumorspheres are too big or too small, see troubleshooting, problem 4[href=https://www.wicell.org#sec6.7]. If tumorspheres are not obtained, see troubleshooting, problem 5[href=https://www.wicell.org#sec6.9].\nTake images of the resulting tumorspheres, ensuring that all spheres fall within the imaged field.",
    "Note: These images will serve to quantify the number and diameter of the resulting tumorspheres. Alternatively, spheres can be counted in situ under the microscope.\nWhile looking into the microscope, transfer all tumorspheres from the well with a 10 μL pipette, taking the minimum possible volume of medium, into a sterile plastic tube containing 500 μL 0.05% trypsin.\nNote: If different wells with the same condition are used, tumorspheres from these can be transferred into a single well, so that they can be recovered in the minimum volume possible.\nNote: Alternative to the use of 0.05% trypsin, tumorspheres can be transferred to a solution with a cocktail of enzymes for better dissociation. This can work better with sensitive spheres coming from primary tissue.\nNote: To avoid contamination, keep the plate open for the shortest time possible.\nDissociation and plating for secondary tumorspheres.\nGently pipette the tumorspheres in the trypsin solution from time to time to help dissociation. Keep for approximately 5 min. Keep at room temperature and avoid long incubation times.\nNote: You can also collect the tumorspheres by transferring media with the cells directly into a 15 mL falcon tube. Then, allow the spheres to settle by gravity sedimentation for 5 min at room temperature. Aspirate the supernatant but leave approximately 200 μL in the falcon tube. Be careful not to aspirate the tumorsphere. Add 1 mlm of 0.05% trypsin to the tumorspheres and incubate for 5 min at room temperature. If your tumorspheres do not dissociate with trypsin or a gentler dispersion is needed, see troubleshooting, problem 2[href=https://www.wicell.org#sec6.3].\nStop the trypsinization by adding 2 mL of NCM.\nTransfer cell suspension to a sterile 15 mL plastic tube and centrifuge at 300 × g for 5 min.",
    "Discard the supernatant and resuspend the cell pellet with 1 mL of NCM gently pipetting up and down.\nPass through a sterile cell strainer with 40 μm pore size to remove non-dissociated cell aggregates.\nCount the number of cells in the suspension and calculate the viability by mixing a small aliquot with an equal volume of Trypan blue. Use manual or automatic cell counting.\nReseed tumorspheres following step 6 to have secondary tumorspheres.\nNote: Cell aggregates are more common on the primary tumorspheres. Subsequent tumorsphere passages permit to obtain higher number of undifferentiated cells. Serial tumorsphere passage also permits to calculate the self-renewal potential.\nRecovery and passage of secondary tumorspheres – day 15\nTiming: 1.5 h\nSecondary tumorspheres are imaged and collected following step 7. Once dissociated, cells can be plated to form tertiary tumorspheres following the procedure described in step 8.\nRecovery of tertiary tumorspheres and isolation of undifferentiated cells – day 22\nTiming: 1.5 h\nTertiary tumorspheres are imaged and collected following step 7 and dissociated following step 8.a to f. Once dissociated, cells can be used for characterization, functional assays, or single cell experiments.\nOptional: Complete tertiary tumorspheres without dissociation in single cells, can also be seeded on a tissue culture treated surface for them to adhere and open after a short incubation time. This allows the characterization of the cells in the spheres by immunofluorescence, video-microscopy or differentiation. Spheres can also be included fresh on optimal cutting temperature compound (OCT) and cryopreserved as frozen blocks that can be serially sliced using a cryotome to assess composition by immunofluorescence.\nNote: If the cells obtained from tertiary tumorspheres are not undifferentiated enough, see troubleshooting, problem 3[href=https://www.wicell.org#sec6.5].\nCryopreservation of undifferentiated cells\nTiming: 15 min\nUndifferentiated cells from tumorspheres can be preserved.\nFreezing tumorspheres cells.",
    "Set a cryopreservation container filled with propan-2-ol aside, at 20°C–25°C.\nDissociate tumorspheres into cell suspension as in step 8.a to f.\nPrepare enough cryopreservation media.\nAfter centrifugation, resuspend cell pellet in 1 mL of cryopreservation media, mixing gently.\nTransfer the cell suspension to a labelled 1.5–2 mL cryovial and place in the container.\nTransfer the cryopreservation container with the cryovial to a −80°C freezer.\nThe day after, transfer cryovials into a liquid nitrogen tank for long-term storage.\nRecovery of undifferentiated cells\nTiming: 20 min\nNote: The following steps describe the procedure to thaw a single cryovial.\nThawing of cryopreserved tumorspheres-derived cells.\nPre-warm NCM at room temperature (RT), then place it under the tissue-culture hood.\nPlace the cryovial containing frozen undifferentiated cells in a 37°C water bath for 1–2 min, or until fully thawed.\nTransfer all medium with cells from the cryovial into a 15 mL sterile tube containing 1 mL of NCM.\nSequentially add NCM to double the current volume, gently agitating and incubating briefly after each addition to gradually dilute the DMSO. Repeat until you reach 10 mL of media.\nCentrifuge at 300 × g for 5 min.\nAspirate supernatant.\nResuspend the cell pellet in 1 mL of NCM.\nProceed with the cells to form tumorspheres as described in steps 5 and 6.\nNote: We normally plate cells for tumorsphere formation after thawing, to conserve undifferentiated character and let them recover."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Cell Isolation",
    "Flow Cytometry",
    "Cancer",
    "Cell Culture",
    "Cell Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}