{
  "id": 4438,
  "origin_website": "Bio",
  "title": "Bacterial Fluorescent-dextran Diffusion Assay",
  "procedures": [
    "Stock preparation   Prepare 3.2 mM solution of FD4 in Dulbecco’s PBS (12.8 mg FD4/ml) and 3.2 mM solution of RD-40 in Dulbecco’s PBS (128 mg RD 40/ml). Note that Dulbecco’s PBS is used as it has been found not to affect the membranes of a wide range of bacteria in this assay. 3.2 mM solutions have been optimized for this assay using S. aureus and may need slight optimization for other bacteria.   Prepare 2.5 x 106 cells/ml solution of heat-killed (55 °C for 1.5 h) bacteria of interest in the bacterial growth media as a compensation control for non-specific FD4 and RD40 binding to the bacteria.  Note: Bacteria were counted, throughout, using the Quanta SC-MPL and the LIVE/DEAD® BacLightTM Bacterial Viability and Counting Kit. But other methods of bacterial counting using Petroff Hausser counting chamber or optical density estimation from growth curves and CFUs have been used.   Prepare a 2.5 x 106 cells/ml solution of viable bacteria of interest in chilled bacterial growth media.  Note: harvesting and processing of the bacteria must be completed at 4 °C using media at 4 °C and the bacteria then stored for the assay at 4 °C.   Prepare a stock solution of the peptide of interest (e.g. 1 mg/ml) in the bacterial growth media.  Note: Peptide may need to be initially solvated in DMSO to prevent precipitation in the bacterial growth media. The final DMSO concentration in the peptide stock solution needs to be ≤ 10% v/v, this concentration will equate to ≤ 5% v/v of DMSO in the initial assay dilution which does not affect the assay.   Bacterial media conditioned 96 well plates; add 250 μl of the bacteria media/well and allow to sit for 16 h, 4 °C. Remove the media (aspiration) immediately prior to the assay.",
    "Assay protocol Critical point: Many bacteria can actively transport dextran, thus to inhibit active transport of dextran the assay must be completed at 4 °C or on ice. All solutions after being prepared must be chilled to 4 °C and kept at 4 °C or on ice. The viable bacteria need 30-40 min at 4 °C to inhibit active transport; this can easily be achieved if the harvested bacteria are centrifuged at 4 °C and pre-chilled media is used to resuspend the bacteria at 2.5 x 106 cells/ml which are then kept at 4 °C or on ice.   Prepare serial dilutions of the peptide in the media conditioned 96 well plates, e.g. 200 μl of the peptide stock solution is added to the first well and 100 μl is transferred to the second well containing 100 μl Dulbecco’s PBS and mixed (10-15 times, pipetting up/down). This transfer process in repeated from the second to the third well, etc., to form a double serial dilution.  Note: Gentle pipetting is required to avoid bubble formation and using the same tip in one serial dilution (high concentration to low) avoids peptide adherence to the tip, if tips are changed per dilution step.   Add 10 μl of the 3.2 mM stock solution of FD4 and 10 μl of the 3.2 mM stock solution of RD40 to each peptide dilution. Or add 20 μl of each if using only one dextran.   Add 80 μl of the 2.5 x 106 cells/ml of the bacteria of interest; gently mix with the transfer pipette and incubate at 4 °C for 60-90 min. Note: Options at this point would be to have a series of the incubation times to look at the rate of dextran dye diffusion.",
    "Prepare non-specific dextran binding control: to three wells containing 100 μl Dulbecco’s PBS, 10 μl of the 3.2 mM stock solution of FD4 and 10 μl of the 3.2 mM stock solution of RD40, add 80 μl of the 2.5 x 106 cells/ml of the heat killed bacteria of interest and incubate at 4 °C for the equivalent time as in step B3 above.   Prepare active transport/non-specific dextran binding control: To three wells containing 100 μl Dulbecco’s PBS, 10 μl of the 3.2 mM stock solution of FD4 and 10 μl of the 3.2 mM stock solution of RD40 add 80 μl of the 2.5 x 106 cells/ml of the viable bacteria of interest and incubate at 4 °C for the equivalent time as in step B3 above.  Note: These controls must have no peptide in the wells.   Set up flow cytometer:    Quanta SC-MPL flow cytometer was used and green fluorescence of FD-4 positive cells (525 ± 20 nm band-pass filter, typically FL1 channel) and the red fluorescence of the RD-40 positive cells (575 ± 15 nm band-pass filter, typically FL3 channel) were measured on a logarithmic scale and analysed simultaneously with the electrical volume (EV) and side scatter (SS) using a 488 nm laser.   Other flow cytometers could be used which use forward and side scatter to discriminate bacterial cells in logarithmic scale mode.   Fluorescent analysis gates (FD4, FD4/RD40 and RD40) were set to contain 1% of background fluorescence (defined as the non-specific adherence of the dextran molecules to heat-killed S. aureus cells and/or S. aureus cells harvested and maintained at 4 °C).     Analysis of dye diffusion. Each test sample was kept at 4 °C or on ice for the analysis and was completed over 1 min, which typically captured 14,000 ± 2,000 counts/sample.",
    "Positive FD4 and RD40 bacteria were determined as being above background fluorescence and FD4-positive, FD4/RD40-dual positive and RD40-positive bacteria were plotted against peptide concentration."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}