{
  "id": 6817,
  "origin_website": "Bio",
  "title": "<em>In vivo</em> Quantification of Alkanes in <em>Escherichia coli</em>",
  "procedures": [
    "In vivo cultureInoculate E. coli strains harbouring the plasmids carrying ADO gene (Figure 2) from plates streaked and incubated overnight at 37 °C (plates originally streaked from glycerol stocks) in 5 ml LB broth medium with 5 μl of appropriate antibiotics (ampicillin–100 μg/ml used in this study) in 55 ml culture tubes (1 ml of Ampicillin stock of 100 mg/ml was prepared by adding 100 mg of Ampicillin powder in 1 ml of water followed by filter sterilization).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200411/20200411095740_4132.jpgFigure 2. Schematic representation of the plasmid involved in alkane pathway construction. Plasmid vector map of pQE_ADO, carrying ado gene in pQE30 plasmid at the restriction sites BamHI/SacI.Incubate the samples at 37 °C overnight in an incubator shaker set at 180 rpm.Use 50 μl (OD600 ranging from 3-4) of the primary inoculum grown overnight to inoculate 3 ml secondary culture having M9 modified medium (Recipe 1) supplemented with 2% glucose, 1 mg/L thiamine and 100 μg/ml ampicillin.Induce the culture with 0.01 mM IPTG (3 μl of 10 mM IPTG to 3 ml culture) at the time of secondary inoculation in M9 medium as the plasmid pQE30 carrying ADO gene is inducible by IPTG.Add 100 mg/L hexadecanal (dissolved in absolute ethanol) exogenously to the culture medium at the time of secondary culture inoculation and seal the culture tubes with parafilm to prevent any loss of substrate or product due to evaporation (15 μl of 20 mg/ml stock added to 3 ml culture).Incubate the culture tubes at 30 °C (or higher to test for thermostable enzymes) in an incubator shaker set to 120 rpm for 48 h.Hydrocarbon extractionMeasure the optical density at 600 nm of the samples to estimate the growth before proceeding with extraction of alkanes.Take equal volumes (0.",
    "75 ml) of sample and ethyl acetate (containing 10 mg/L Octadecene added as internal standard–from a 100 ml stock of ethyl acetate containing 1.265 μl of 99% 1-Octadecene) in a 2 ml microcentrifuge tube.Vortex the samples for 20 min and centrifuge at 15,700 x g for 3 min at room temperature.Collect the upper fraction and aliquot it into a fresh GC (gas chromatography) vial.Analyze the samples using gas chromatography (GC).Hydrocarbon analysisSet the hydrocarbon analysis method on the gas chromatography (GC) system equipped with HP-5 column of 30 m length, 0.32 mm internal diameter and 0.25 mm film thickness. The FID detector is used for analysis. The hydrocarbon analysis method is to be set as follows. The oven temperature programme is set as: initial 100 °C held for 3 min, increase temperature to 250 °C at the rate of 10 °C min-1 and held at 250 °C for additional 10 min. The total run-time of the programme will be 28 min. The inlet and detector temperature are to be maintained at 150 °C and 280 °C, respectively.Run pentadecane, hexadecanal, 1-octadecene, and hexadecanol standards of known quantity (Figure 3) prior to sample analysis and use the area under curve to calculate the concentration of metabolites in the test samples.Run the test samples in GC machine (Figure 4) and quantify the pentadecane content with respect to its standard."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}