{
  "id": 4119,
  "origin_website": "Cell",
  "title": "A protocol for in ovo electroporation of chicken and snake embryos to study forebrain development",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nAlbumin removal\nTiming: 1 min per egg\nThis procedure allows moving the embryo inside the egg to an intermediate position in the horizontal plane, avoiding its damage when cutting a window on the shell, later on. This procedure is also described in the Methods video S1[href=https://www.wicell.org#mmc1].\nClean the egg shell with 70% ethanol.\nFor snake eggs, clean the shell and change the bedding from vermiculite to a double bottom setter tray. Add some clean warm water at the bottom to maintain the appropriate temperature.\nTurn the eggs in the eggcup to a horizontal position and use scissors to make a small hole in the smaller pole of the egg. The size of the hole must be just sufficient to fit the thickness of the albumin extraction needle, around 1 mm.\nFor snake eggs, skip this step.\nInsert the 21G × 1” needle fully through the hole in the shell off center, in a 45° angle directed towards the bottom part and one of the sides, to avoid extracting the chalaza o any membrane surrounding the embryo (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/884-Fig1.jpg\nFigure 1. Albumin removal from chicken eggs\n(A) Insert the needle at a 45° angle and direct it towards one side.\n(B) Extract 6–8 mL of albumin.\n(C and D) Cover the upper part of the egg with adhesive tape. Scale bar, 3 cm. See also Methods video S1[href=https://www.wicell.org#mmc1].\nFor snake eggs, use a 25G × 5/8” needle.\nExtract between 6–8 mL of albumin, depending on the size of the egg (Figure 1[href=https://www.wicell.org#fig1]B).\nFor snake eggs, remove 1–2 mL of albumin.\nUse a piece of wide adhesive tape to cover the upper part of the egg and its hole. Be careful to avoid folding the tape (Figures 1[href=https://www.wicell.org#fig1]C and 1D).",
    "Critical: Make sure to introduce the needle in the correct orientation to avoid damaging the embryo. The best time to remove the albumin is between lay and 3dpo, in both snakes and chicken. After this period, the viability of the embryo may be at risk during the process of albumin extraction due to the significant increase of the size and vascularization of embryos.\nCritical: The main limitation to manipulate the snake eggs is the softness of their shell. To solve this problem and avoid the collapse of the egg, surround it along the horizontal plane with narrow adhesive tape. Avoid covering the bottom part of the egg to allow the exchange of gas and humidity.\nIn ovo electroporation\nTiming: 3 min per egg\nThis procedure allows injecting the DNA solution in the lateral ventricle of the chicken/snake telencephalon and introducing this DNA into progenitor cells that contact the apical surface of this ventricle, mainly apical Radial Glia Cells. Details of how key steps of this procedure are performed are shown in the Methods video S1[href=https://www.wicell.org#mmc1]. The best stage to perform the procedure in both animal models is 4 dpo, due to the positioning of the embryos in relation to the yolk. In addition, this is a key time point in the development of the dorsal pallium, since this stage is at the onset of neurogenesis. Therefore, electroporation at this stage will transfect mainly Radial Glia Cells that will later give rise to neurons.\nDilute the DNA plasmids of interest to the desired final concentration in PBS. As described in “materials and equipment[href=https://www.wicell.org#materials-and-equipment]”, the final concentration of plasmids may vary across a wide range of concentrations depending on the specific experiment. The most common concentration used in our experiments is 1 μg/μL for each plasmid.",
    "Clean all surgical materials, electrodes and surfaces with 70% ethanol.\nEnter the electroporation parameters in the electric pulse generator and connect the tweezers electrodes.\nNote: For chick embryo electroporation we use TSS20 Ovodyne Electroporator, and for snake embryos we use ECM 830. The same current parameters should be used in both species. Both are square-pulse electroporators, so in principle both are useful for either species. Our different use was solely circumstantial related to availability.\nBreak the tip of the glass pipette in a beveled shape. The diameter of the tip should be around 50–100 μm.\nNote: This is important to facilitate penetration of the pipette into the ventricle of the embryo, causing the least possible damage.\nLoad the DNA solution into the glass pipette through the broken tip, using the aspiration tube. The aspiration tube has a silicone holder to hold the glass pipette. Mouth suctioning from the other end of the tube creates a vacuum that will aspirate the DNA solution and load it into the pipette. Monitor the DNA loading to stop at the volume of interest. Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nPlace the egg in the handmade holder on a horizontal position and use the scissors to open a window in the upper part of the shell. Start from the small hole made previously to remove the albumin, and follow along the adhesive tape.\nNote: The size of the window should be the minimum to properly manipulate the embryo in order to avoid potential dehydration problems. In chicken eggs, windows with 1.5 – 2 cm of diameter should be sufficient, whereas in snake eggs these should be smaller, around 1 cm.",
    "Note: Cut the shell with care, using the tip of the dissection scissor to avoid damage in the embryo or in the membranes surrounding it. Use the small spring scissors to cut the soft shell of the snake eggs. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nNote: It is possible to make a holder with any material that allows performing a hole in the center to place the egg in a correct position and to avoid movements of the egg. In our case, we use a piece of polystyrene with a hole fitting the size of the egg, as shown in Figure 2[href=https://www.wicell.org#fig2].\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Procedure for in ovo electroporation of the telencephalon of chicken embryos at 4 dpo, related to steps 2–15\nThe movie highlights the most important steps in the in ovo electroporation technique: albumin removal, window opening, DNA injection, electroporation and window closing.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/884-Fig2.jpg\nFigure 2. Electroporation process\n(A, A′) Injection of DNA dilution in the telencephalic vesicle of the chicken embryo. (A’’) Detailed view of the injected telencephalon in chicken embryo.\n(B, B′) Position of the tweezers electrodes to allow the current flow. (B’’) Detailed view of the position of the electrodes to electroporate the telencephalon.\n(C) Set-up for snake embryo electroporation, (C′) example of a window opened in the snake egg to manipulate the embryo, and (C’’) detailed view of the electroporated snake telencephalon. Scale bars, 5 cm (A and B), 10 cm (C), 1 cm (A′, B′ and C′), 3 mm (A’’ and B’’), 2,5 mm (C’’). See also Methods video S1[href=https://www.wicell.org#mmc1].",
    "Critical: For snake embryos, the window on the egg shell must be made with extreme care, because the egg is smaller in size and the volume of albumin removed previously is also smaller, as the embryo is larger relative to the size of the egg.\nOnce the embryo is exposed through the window, put the egg under the dissecting scope to visualize and identify properly the telencephalon.\nNote: The telencephalon is recognizable as a small bulged structure in the rostral part of the head, between the eyes. If the embryo is not positioned in the center of the window, move it carefully to that position, using the scissors if necessary. Approach the embryo with the scissors on horizontal position, let the embryo stick to them, and move both with extreme care.\nConnect the pulled glass micropipette loaded with DNA solution to one end of the aspirator tube, introduce the pipette in one of the lateral telencephalic ventricles, and inject 1–2 μL of DNA solution by mouth blowing through the aspirator tube (Figures 2[href=https://www.wicell.org#fig2]A–2A’’). Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nNote: The pipette must be introduced directed towards the part of the telencephalon to be electroporated. To electroporate pallial structures it must be introduced from the bottom of the telencephalon, and from the upper part to electroporate subpallial regions. Avoid injecting perpendicular to the telencephalic middle, because the DNA solution is frequently lost through the third ventricle.\nCritical: Introducing the pipette into the telencephalic vesicle must be done in a single and gentle push. Do not apply excessive pressure nor perform repeated attempts on the same embryo, as this will cause excessive damage on it. Troubleshooting 4[href=https://www.wicell.org#troubleshooting].\nPlace the electrodes over the telencephalic vesicles in the position of interest, and press the switch for electric pulse discharge (Figures 2[href=https://www.wicell.org#fig2]B–2B’’).",
    "Note: DNA molecules will move towards the positive electric pole, so the precise placement and orientation of the electrodes critically determine the final result. The albumin is a good conductor of electricity, allowing a proper electroporation, so it is not strictly necessary to add an ionic solution to facilitate electrical conductivity.\nNote: To electroporate the dorsal pallium, the positive electrode must be located in parallel to the injected telencephalic vesicles and in close contact with the embryo. The negative electrode must be located in the posterior part of the embryo in a region between the heart primordium and the mesencephalon (Figure 2[href=https://www.wicell.org#fig2]B’’).\nNote: The electrodes look big next to the embryos, but this size does not affect their survival. It is possible to use smaller, needle electrodes, similar to those classically used to electroporate spinal cord, and this probably results in a smaller electroporated region. However, we have noted that the efficiency of the electroporation decreases significantly. It is also possible to target different regions just modifying the position of the electrodes.\nNote: The electrodes should not put pressure on the embryo, but only touch it gently. The rhythm of heart beating changes during electric pulses, and this should be used as an indication that electroporation is taking place. Pay attention that the heart beats again at a normal rhythm (similar to before electroporation) immediately after passing the electric pulses. Troubleshooting 5[href=https://www.wicell.org#troubleshooting].\nCover the window on the shell with wide adhesive tape, avoiding air openings.\nNote: It is advisable to stick pieces of scotch tape surrounding the adhesive cover tape to help prevent any detachment.\nReturn the egg to the incubator in horizontal position and without movement.",
    "Note: The addition of antibiotics into the egg is usually not necessary if the procedure was performed cleanly. It is also not necessary to cover the egg window with the piece of shell previously removed. The use of clear adhesive tape enables easy checking the viability of the embryo after the electroporation. Chicken eggs can be incubated under these conditions until the hatching day. For snake eggs, survival under these conditions is guaranteed until 8dpo (longer times not tested) (Figures 2[href=https://www.wicell.org#fig2]C–2C’’).\nTissue processing\nTiming: 2 h\nPrepare a Petri dish with ice-cold 1× PBS to keep the embryos after extraction from the egg. Sterile conditions are not necessary throughout tissue processing.\nPrepare 50 mL tubes with ice-cold 4% PFA.\nCut out the adhesive tape covering the window in the shell and leave the embryo exposed.\nWhile holding the embryo, carefully cut the membranes and the blood vessels surrounding it to allow its detachment.\nPull out the embryo with a small spoon or pour the content of the egg in a dish.\nSmall size embryos (less than 10 dpo):\nExtract each embryo and place in ice-cold PBS.\nCut the head of the embryo and fix by immersion in cold 4% PFA during 60 min.\nWash 2 times with cold PBS for one minute each in a 50 mL Falcon tube.\nExtract the brain by removing the skin and the incipient cranium under the dissecting scope by using sharp forceps (Figure 3[href=https://www.wicell.org#fig3]). The procedure is the same for snake embryos.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/884-Fig3.jpg\nFigure 3. Dissection process of the chicken embryo telencephalon at 6 dpo\n(A) Hold the head of the embryo puncturing the neck or the eye using one of the forceps.\n(B) Using the other forceps, cut the skin laterally along one side of the telecephalon.",
    "(C) Cut the skin between the telencephalon and the diencephalon.\n(D) Remove the skin from the cut part.\n(E) Cut the base of the telencephalon.\n(F) Separate the telencephalon from the head. Scale bars, 1 cm (A), 600 μm (B – F).\nTransfer to 30% sucrose in PBS for cryoprotection. A good indicator to know that the brain is properly cryoprotected is that it sinks in sucrose solution. This process depends on the size of the brain and it could take between 12 and 18 h.\nEmbed in tissue freezing medium, freeze and cut in the cryostat. The thickness of the section depends on the specific experiment, where 20 μm is standard for immunohistochemistry at these embryonic stages.\nBig size embryos (equal or more than 10 dpo):\nPour the content of the egg in a dish, extract the embryo and remove the membranes surrounding it.\nFix by transcardiac perfusion: use a 25G × 5/8” needle to pass 20 mL of 4% PFA through the heart using a perfusion pump.\nNote: the perfusion flow will range from 8 to 12 ml/min depending on the size of the embryo.\nCut the head and remove the skin and the cranium cutting through the midline. Pull either side of the cranium towards each side, exposing the brain, cut the base of the telencephalon and extract it. This procedure must be performed using sharp forceps.\nPost-fix the telencephalon with cold 4% PFA during 30–60 min.\nWash 2 times with cold PBS for one minute each in a 50 mL Falcon tube.\nCryoprotect the brain by submersion in 30% sucrose and cut at the cryotome.\nNote: Cutting with cryotome, or vibratome without cryoprotection, is recommended over cryostat because of the large size of the telencephalon. In this case, the thickness of the sections is 40–50 μm."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Developmental Biology",
    "Evolutionary Biology",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}