{
  "id": 18479,
  "origin_website": "Jove",
  "title": "Transcutaneous Assessment of Renal Function in Conscious Rodents",
  "procedures": [
    "Necessary experiments to develop the protocol were performed according to national regulations and were approved by the local ethical science committee (Regierungspräsidium Karlsruhe).\n1. Preparation of FITC-sinistrin Injection Solution\nDissolve FITC-sinistrin in physiological saline to prepare a stock solution. The recommended dose in mice is 7.5 mg/100 g body weight (BW), while in rats 5 mg/100 g BW FITC-sinistrin is preferable. For mice, prepare a solution of FITC-sinistrin stock solution at 15 mg/ml, while for rats prepare at a concentration of 40 mg/ml.\nNote: FITC-sinistrin stock solution can be prepared in advance and stored at -20 °C protected from light.\n2. Animal Preparation\nAcclimate animals for at least one week before their introduction in any experiment.\nAnesthetize the animal using 5% isoflurane at 5 L/min O2 flow for 2 min.\nConfirm that the animal is properly anesthetized by observing its breathing, which becomes slower and deeper, and verify unresponsiveness with a lack of a toe response.\nOnce the animal is asleep, reduce the anesthesia to 2.5% isoflurane at 2 L/min O2 delivery rate and take the BW.\nRemove the fur from the flank of the back of the animal using an electric shaver. Shave an area slightly bigger than the area that will be occupied by the double-sided adhesive patch, which has dimensions of 3 cm x 6 cm.\nSubsequently apply depilation cream for a short period (2-3 min) to remove the remaining fur.\nWash thoroughly the area until the cream has been completely removed, as the cream itself may be fluorescent.",
    "Note: Avoid scratching the skin of the animal as it can produce irritation/edema. If the depilated area shows pigmentation on the skin, shave a bigger area until a non-pigmented spot for the optical part of the device is found. It is recommended to shave 24 hr in advance to minimize anesthesia exposure.\n3. Device Preparation\nPlace the optical device to measure renal function onto one side of the double-sided adhesive patch, positioning the optical part above the transparent window (Figure 1) leaving the opposite part with the protective foil.\nNote: When working with small rodents, reduce the size of the patch as shown in the Figure 2.\nAttach a piece of double-sided adhesive patch of matching size to the battery as shown in Figure 3.\n4. Fixation of the Device on the Animal\nCalculate the appropriate volume of injection based on the animal body weight.\nAnesthetize the animal with isoflurane as previously indicated on sections 2.1-2.3.\nCut a piece of tubular elastic gauze bandage of about 1 cm longer than the width of the double-sided adhesive patch to be used.\nPull the elastic gauze bandage over the head of the animal and place on its back, leaving the shaved area uncovered.\nNote: Alternatively, fix the device using only adhesive tape, but be aware of undue pressure on the device.\nConnect the battery to the device by plugging the battery connector to the corresponding port on the device. After that remove the protective foil from the piece of patch and mount the battery on the upper surface of the device (Figure 4A). Ensure that the battery is properly plugged by checking that the device starts blinking.\nNote: In rats, the battery can be also attached directly on the adhesive patch, next to the device (Figure 4B).",
    "Remove the protective cover from the patch with the operating device and place it onto the shaved area on the back of the animal holding its edges until it is correctly fixed.\nCover the device with the tubular elastic gauze bandage adhering it to the adhesive surface of the patch (Figure 5).\nProperly stretch the tubular bandage on the abdomen of the animal, ensuring that the limbs can move freely.\nFor a better fixation and protection of the device, apply a strip of adhesive tape following the shape of the device and covering the wires of the battery.\nMeasure background for 1 to 3 min, without putting pressure on the device\n5. FITC-sinistrin Administration and Measurement Procedure\nIf necessary, warm up the tail of the animal using warm water before injection or a temperature-controlled heating plate along all the procedure.\nInject through tail vein the appropriate volume of FITC-sinistrin stock solution. The volume of injection depends on animal BW and therefore must be calculated for each individual considering the desired dose and concentration of stock solution, aforementioned in section 1.1.\nEnsure that all the FITC-sinistrin solution is administered intravenously and not subcutaneously.\nNote: Alternatively, FITC-sinistrin can be administered using a pre-implanted intravenous catheter exited at the nape of the neck in rodents or via retro orbital injection in mice.\nCarefully, return the animal to its home cage avoiding strong movements and any pressure on the device, as it would introduce movement artifacts.\nPlace the home cage in a calm place to avoid that the animal is disturbed.\nPerform the measurement during at least 1 hr if working with mice and 2 hr when using rats. During that period, the optical device will measure through the skin the fluorescence emitted by FITC-sinistrin.",
    "Note: During the recording period the animal must be hosted alone. Furthermore water supply, as well as protruding structures such as the wire lids, must be removed to avoid damaging of the electronic device and movement artifacts due to impacts with objects.\n6. Device Removal\nOnce the recording period is over, remove the device without anesthesia; however, if needed, anesthetize the animal briefly under 5% isoflurane at 5 L/min O2 delivery rate during 2 min.\nCarefully, pull off the adhesive tape first, then the tubular bandage.\nGently detach the double-sided adhesive patch from the skin and return the animal to its normal home cage.\n7. Read out of Data\nDisconnect the battery from the device and remove the adhesive patch.\nNote: The data are stored on the device until a new measurement starts. When a battery is connected the stored data are overwritten with the new recordings. Therefore, do not reconnect the battery before downloading the data from the device. There is a 10 sec grace period intended for accidental reconnections of the battery.\nConnect the device to a PC using a micro USB cable and download the data using the software provided. The output file is a .csv file that can be opened and modified with a spreadsheet program.\nOpen the data file with the specific software for the optical device and generate the elimination kinetics curve using the software protocols.\nAnalyze the curve by following the instructions provided with the optical device. Shortly, for the evaluation of the data, set the background signal measured prior FITC-sinistrin administration and mark the beginning of the exponential excretion phase of the marker, which usually occurs 15 min and 45 min after the bolus injection, in mice and rats respectively.",
    "Note: The software will automatically display the FITC-sinistrin half-life (t1/2) along with an R2 value, determined by a 1-compartment model. t1/2 can be utilized to calculate GFR by using a conversion factor9,10."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}