{
  "id": 19492,
  "origin_website": "Jove",
  "title": "Coherent Anti-Stokes Raman Spectroscopy (CARS) Application for Imaging Myelination in Brain Slices",
  "procedures": [
    "All experiments complied with all applicable laws, National Institutes of Health guidelines, and were approved by the University of Colorado Anschutz Institutional Animal Care and Use Committee.\n1. Animals\nUse C57BL/6J (stock #000664) mice (Mus musculus) obtained from The Jackson Laboratory or Mongolian gerbils (Meriones unguiculatus) originally obtained from Charles River.\n2. Tissue preparation\nFor transcardial perfusion, overdose rodent species of interest with pentobarbital (120 mg/kg body weight) and transcardially perfuse them with phosphate-buffered saline (PBS; 137 mM NaCl, 2.7 mM KCl, 1.76 mM KH2PO4, 10 mM Na2HPO4) followed by 4% paraformaldehyde (PFA)24.\n\t\nSpecifically, open the abdomen and the rib cage using scissors and hold the rib cage in place with Kelly hemostatic forceps to expose the heart.\nInsert a 23 GA needle connected to a perfusion pump into the left ventricle and quickly cut the right atrium using fine scissors.\nAdminister PBS through the perfusion pump and the needle in the heart for 10 min to clear the brain and body of blood.\nSwitch the perfusion pump to 4% PFA for 10 min and check for rigidity of limbs and tail to confirm successful perfusion.\nAfter perfusion, decapitate the animals and remove their brain from the skull. Keep the brains overnight in 4% PFA before transferring to PBS. Embed brainstems in 4% agarose (in PBS) and slice coronally using a vibratome at 200 µm thickness.\n3. Staining\nStain free floating sections for Nissl, to visualize cell bodies (1:100), in antibody media (AB media: 0.1 M phosphate buffer (PB: 50 mM KH2PO4, 150 mM Na2HPO4), 150 mM NaCl, 3 mM Triton-X, 1% bovine serum albumin (BSA)) for 30 min at room temperature on a standard laboratory shaker25.\n\t\nProtect sections from light using aluminum foil and/or a cover. 550 nm or below wavelengths are compatible with CARS imaging (Figure 1).",
    "NOTE: While we do not expect that Triton-X or other reagents have an impact on CARS imaging of lipids, additional controls with specific antibody media may be warranted.\nPAUSE POINT: Store free floating sections (while protected from light) in PBS until imaging. Once sectioned, image brain sections within 2 weeks.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64013/64013fig01.jpg\nFigure 1: CARS imaging can be combined with immunofluorescent imaging. The graphs shows that CARS imaging occurs at 660/640 nm red signal spectrum26. This wavelength is sufficiently far removed from the green, blue, or UV range, allowing for combination of the CARS signal with immunofluorescence in these ranges. Specifically, the graph also indicates the excitation and emission for Nissl tagged with blue fluorophore, which was combined with CARS during the collection of representative results for this publication. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64013/64013fig01large.jpg]\n4. Imaging\nNOTE: The CARS laser set up contains a fiber laser that provides the 80 MHz clock, and an OPO (Optical Parametric Oscillator) laser with a tunable range of 770-990 nm with the Stokes beam fixed at 1031 nm, which are needed for collecting the CARS signal. There is one aperture for both beams.\nBefore bringing samples to the microscope, turn on and warm up CARS laser for at least 1 h, align the CARS laser, and Koehler the condenser optics and the diaphragm of the microscope for forward CARS imaging.\n\tNOTE: This step is critical for proper function of CARS microscopy.\n\t\nFor spatial alignment of the two laser beams (pump and stokes), access the two internal PSDs (position sensitive detectors) via the CARS laser GUI.",
    "Achieve temporal alignment by using the delay function in the CARS laser GUI, which can help overlap the pulses of the two lasers (pump and stokes) that have different dispersions because of their different wavelengths. Therefore, both the temporal and spatial overlapping of the pump and stokes beams are done with the user input through the GUI.\nAdjust the external periscope (last two mirrors of the setup) to center the spatially overlapped two lasers onto the scanning head mirrors of the microscope.\nFor best forward CARS non-descanned detection, make sure the condenser is Koehler-ed (meaning the condenser is centered and focused onto the diaphragm to achieve uniform illumination)\nFor immunofluorescence confocal imaging and CARS imaging, fit the CARS laser, with both forward and epi CARS non-descanned detectors (NDDs), by incorporating a confocal microscope equipped with visible lasers for fluorescence imaging (Figure 2).\nPlace sections in a culture dish with coverslip (for inverted microscopy), PBS to avoid the tissue drying out, and a glass weight to keep tissue near coverslip.\nTake z-stacks or single images with a 60X, 1.2 NA infrared corrected water objective, which serves for collection of the CARS signal in the epi direction and through a 0.55 NA condenser in the forward direction for imaging brain areas such as the medial nucleus of the trapezoid body (MNTB).\n\t\nTake the CARS images at approximately 600 mW pump/probe and 300 mW Stokes, by using the CARS laser GUI. These laser power values are measured internally by the system. Both lasers' powers at the sample location are less than 25 mW and safe for the tissue sample.",
    "Overlap the pump and Stokes beams spatially and temporally. Tune the OPO to 797.2 nm. This yields a CARS wavelength of 650 nm. Because of the higher energy level, the resulting return to the ground state is anti-Stokes (blue shifted) to the excitation.\nCapture the CARS signal in epi or forward non-descanned detectors using bandpass filters (640-680 nm) followed by sequential detection of the immunofluorescence label (in this instance fluorescently labeled Nissl).\n\t\tNOTE: The Nissl neuronal soma marker is not caught in the CARS 640-680 nm bandpass filter, allowing the combination of fluorescence and CARS imaging in the images presented below.\nThe CARS and fluorescence do not share PMTs. Use these settings for optimal lipid signal to selectively image myelination in the brain area.\n\t\tCAUTION: Shield the user from the laser beam\nSave the images as .oib files, which can be imported into an image analysis program for further quantification (Figure 3).\nimgsrc://cloudfront.jove.com/files/ftp_upload/64013/64013fig02.jpg\nFigure 2: CARS instrument diagram showing CARS lasers (red arrows) and non-descanned (NDD) epi and forward detection incorporated onto a laser scanning confocal. In forward NDD we acquire CARS for C-H bonds (dark red arrows) and SHG (second harmonic generatioin) at 515 nm (orange arrow). In epi NDD, we acquire CARS for C-H bonds (dark red arrows) and 2PE (two-photon emission) autofluorescence (light blue arrow). Sequentially, fluorescence confocal images can be acquired (green arrows for visible laser, blue arrows for confocal detection). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64013/64013fig02large.jpg]\nimgsrc://cloudfront.jove.com/files/ftp_upload/64013/64013fig03v2.jpg",
    "Figure 3: CARS can illuminate myelin (magenta) in brain tissue (brainstem) while also imaging Nissl (cyan) or fluorescent markers. The two panels show representative results from a Mongolian gerbil (single image M. unguiculatus, Figure 3A,C,E) and mouse (z-stack max projection M. musculus, Figure 2B,D,F) brain, indicating that this technique can be used across species. Figure 3A,B showing Nissl in cyan, C,D show the CARS signal in magenta, E,F combine the Nissl and CARS signals with each panel for gerbil or mouse, respectively. Both sets of images show a section of the medial nucleus of the trapezoid body (MNTB) in the brain stem. Neurons in the MNTB receive inputs from heavily myelinated axons, which terminate in the calyx of held, a type of giant synapse27. Scale bar is 20 µm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64013/64013fig03largev2.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}