{
  "id": 9945,
  "origin_website": "Jove",
  "title": "An Efficient Method for the Synthesis of Peptoids with Mixed Lysine-type/Arginine-type Monomers and Evaluation of Their Anti-leishmanial Activity",
  "procedures": [
    "1. Solid-phase Synthesis of Peptoids\nNOTE: Peptoids are synthesized manually using the submonomer procedure of solid-phase peptoid synthesis. This method allows high coupling efficiency and good final product yields. Synthesis on solid-phase also allows excess reactants to be removed easily at the end of each step and the method has been modified here to allow different functionalized cationic monomers (i.e., arginine-type and lysine-type residues) to be included within the same sequence.1,2\nSynthesis of a linear peptoid\n\tCaution: Carry out safety assessments before starting synthesis. Carry out all reactions in a fume hood and wear adequate personal protective equipment as appropriate (i.e., disposable nitrile gloves, safety glasses and a lab coat). Take particular care when using the following reagents and solvents. Dimethylformamide (DMF) is a suspected teratogen and dichloromethane (DCM) is a carcinogen. N,N'-diisopropylcarbodiimide (DIC) and piperidine are hazardous to eyes, skin, via respiratory inhalation and may cause skin sensitization. Hydrazine is a suspected carcinogen, fatal if inhaled and causes severe burns to skin or eyes. Bromoacetic acid is also hazardous to skin, eyes and the respiratory tract and may cause burns upon contact. Trifluoroacetic acid (TFA) is a volatile liquid and can cause severe burns so handle with care. Heavy duty gloves are recommended.\n\t\nAdd 0.12 g Fmoc-protected Rink Amide resin (0.1 mmol, typical loading 0.7 mmol/g) to a capped 20 ml polypropylene reaction vessel with two frits. Add 5 ml dimethylformamide (DMF) to swell the resin and leave the vessel to stand for at least 60 minutes at room temperature. Drain the DMF using a solid-phase extraction vacuum platform.",
    "To deprotect the Fmoc group on the swollen resin, add 2 ml piperidine solution (20% in DMF v/v). Place the vessel on a shaker platform at room temperature (450 rpm) and shake for 5 min. Remove the solution via vacuum station.\n\t\t\nRepeat Fmoc deprotection with 2 ml piperidine solution and shake for 15 min at room temperature. Drain the solution as before.\nWash the resin by adding 2 ml DMF and mixing the resin for 30 sec. Drain the DMF and repeat three more times.\nFor the acetylation, add 1 ml of bromoacetic acid solution (0.6 M in DMF) and 0.2 ml N,N'-diisopropylcarbodiimide solution (DIC, 50% in DMF v/v). Leave reaction vessel to shake for 20 min at room temperature. Drain the solution and wash the resin with 2 ml DMF three times.\nFor the displacement, add 1 ml of amine solution (1.5 M in DMF). Shake the resin for 60 min at room temperature. Drain the solution and wash the resin with 2 ml DMF three times.\n\t\t\nTo add an arginine-type monomer, follow step 1.7. Depending upon the desired peptoid sequence, different amines will be added.\nRepeat steps 1.1.4 and 1.1.5.\nTo include a guanidine functionalized monomer (i.e., NArg), add 1 ml of unprotected diamine solution (1.5 M in DMF) to the resin and shake for 60 min at room temperature.\n\t\t\nDrain the solution and wash the resin with 2 ml DMF three times.\nAdd 2-acetyldimedone (0.2 g, 1 mmol in 0.5 ml DMF, 10 equivalents) to add the Dde group to the free primary amine and shake for 60 min at room temperature. Drain the solution and wash the resin with 2 ml DMF three times.",
    "Continue submonomer synthesis as in 1.1.4 to 1.1.7 until the desired sequence is made. Add 2 ml DMF to wash the resin and repeat three times.\nTo deprotect the Dde group on resin, add 4 ml 2% hydrazine solution (in DMF v/v) and shake for 3 min at room temperature. Drain the solution and repeat three times.\nDrain the solution and wash the resin with 2 ml DMF three times.\nAdd pyrazole-1-carboxamidine (6 equivalents per free amine, i.e., per NArg monomers, in the minimum volume of DMF) and N,N-diisopropylethylamine or DIPEA (6 equivalents per free amine) and shake at room temperature for 60 min.\nDrain the solution and wash the resin with 2 ml dichloromethane three times. Leave the resin to dry in air for 10 min then the resin can be stored until cleavage (section 2).\nTo pause the synthesis, wash the resin with 2 ml DMF three times. Add 2 ml DMF, stopper the synthesis vessel and leave at room temperature in a fume hood.\n\t\tNOTE: The synthesis may be paused after any displacement step (except the second displacement step as diketopiperazines may be formed).\nSide-chain deprotection and cleavage from resin\nUndertake a test cleave to check the progress of synthesis (purity and mass) at any point during synthesis after the displacement steps, addition or removal of Dde-protecting group or after the final sequence has been made.\n\t\t\nTransfer approximately 10 resin beads from the reaction vessel into a new 8 ml polypropylene fritted cartridge.\nAdd 1 ml of trifluoroacetic acid cleavage cocktail (containing 95% TFA, 2.5% H2O, 2.5% triisopropylsilane) and shake for 90 min at room temperature.\nFilter the TFA cleavage cocktail from the resin using the fritted reaction vessel into a 10 ml round bottomed flask.",
    "Evaporate the cleavage cocktail using a rotary evaporator and redissolve the resulting oil in 1 ml acetonitrile/water for submission to LC-MS or analytical HPLC.\nFor the final cleavage: in the same fritted polypropylene reaction cartridge used for synthesis, add 4 ml of the TFA cleavage cocktail (95% TFA, 2.5% H2O, 2.5% triisopropylsilane) and cover the vessel. Shake for 90 min at room temperature.\nFilter the TFA cleavage cocktail from the resin using the fritted reaction vessel into a 50 ml round bottomed flask.\nEvaporate the cleavage cocktail using a rotary evaporator. After the TFA has been removed, the product should be obtained as an oil. To aid TFA removal from this crude oil, add 2 ml anhydrous diethyl ether and the peptoid should precipitate.\n\t\t\nEither remove the diethyl ether via pipette and discard or evaporate using a rotary evaporator. Repeat diethyl ether precipitation three times.\nDissolve the crude peptoid in 10 ml acetonitrile/acidified water solution (50% acetonitrile, 0.1% TFA in water v/v). Transfer to a pre-weighed container, freeze at 20 °C and lyophilize to a dry powder.\n2. Characterization and Purification\nNOTE: The peptoid synthesis can be monitored and the final peptoid assessed via analytical reverse-phase HPLC using a C18 column and electrospray liquid-chromatography mass spectrometry (LC-MS). All HPLC solvents of solvents for LC-MS should be freshly prepared.\nAnalytical HPLC\nWeigh 1 mg of peptoid in a small glass vial. Add the minimum volume of acetonitrile to dissolve and dilute to 1 ml with water. Ensure that the peptoid has completely dissolved.\nInject 10 µl to analytical HPLC (suggested gradient 0 - 100% solvent B over 30 min, where solvent A = 95% water, 5% acetonitrile, 0.05% TFA and solvent B = 95% acetonitrile, 5% water, 0.03% TFA), as per manufacturer's instructions.\nVisualize UV spectrum at 220 nm.\nESI LC-MS",
    "Make 1 mg/ml peptoid solution as in step 2.1.1.\nInject 1 µl to electrospray LC-MS to determine if the molecular weight of the target peptoid is present, using manufacturer's instructions.\nCheck the target mass of the peptoid sequence using a peptoid calculator, as per instructions on the calculator. 26 This web utility also allows the assignment of any deletion/addition products seen in the mass spectrum.26\nPreparative reverse phase HPLC\nDissolve crude peptoids into 2 ml acidified water/acetonitrile (95% water, 5% MeCN, 0.1% TFA) and purify by preparative RP-HPLC using manufacturer's protocol. Determine the gradient by the elution time obtained from analytical HPLC and the amount injected will depend upon the column dimensions.\nVisualize using a detector set at 220 nm.\nCollect fractions in 15 ml centrifuge tubes, freeze at 20 °C and lyophilize.\nRe-analyze fractions using LC-MS and analytical HPLC according to manufacturer's protocol. Recombine purified fractions.\n3. Biological Testing against Leishmania mexicana Parasites\nCaution: Safety assessments must be carried out before starting synthesis. Leishmania mexicana is classified a hazard group 2 pathogen in the U.K. and adequate control measures must be in place prior to starting testing. All work must be carried out in a class 2 microbiological safety cabinet and adequate personal protective equipment worn as appropriate (i.e., nitrile gloves, safety glasses and a lab coat).\nSubculture of parasites\nDefrost 1 ml -150 °C frozen stock Leishmania mexicana M379 by placing vial in a 37 °C water bath for 30 sec.\nTransfer the stock solution to 10 ml Schneider's Insect medium (at pH 7.0 supplemented with 15% heat-inactivated fetal bovine serum and 1% penicillin/streptomycin) in a 25 cm3 cell culture flask with a non-vented cap.\nIncubate at 26 °C for 72 hr.",
    "Examine parasites under microscope (400X magnification) to check condition. They should be insect stage promastigotes, procyclic forms in log phase with many dividing cells.\nMaintain procyclic promastigotes by sub-culturing parasites to a concentration of 5 x 105 parasites/ml every three days. Count cells using a Neubauer improved hemocytometer.\nTransformation of L. mexicana insect stage into mammalian stage axenic amastigote form 27\nDay 0: Prepare 10 ml culture of log stage parasites at 5 x 105 parasites/ml in Schneider's Insect medium (at pH 7.0 supplemented with 15% heat-inactivated fetal bovine serum and 1% penicillin/streptomycin) in a 25 cm3 cell culture flask with a non-vented cap.\nIncubate at 26 °C for 48 hr.\nDay 3: Transfer 10 ml culture to a 50 ml centrifuge tube and centrifuge at 447 x g for 5 min.\nPour off old medium and add 10 ml Schneider's Insect medium (at pH 5.5 supplemented with 20% heat-inactivated fetal bovine serum and 1% penicillin/streptomycin). Gently resuspend the pellet of parasites in the new medium using a pipette.\nCount the number of parasites using a Neubauer improved hemocytometer. Dilute to a concentration of 5 x 105 parasites/ml with pH 5.5 medium and transfer to a 25 cm3 cell culture flask.\nIncubate at 26 °C for approximately 6 days.\nDay 9: Examine parasites under a microscope (400X). They should be in the non-replicating, infectious metacyclic promastigote stage.\nCount the number of parasites using a Neubauer improved hemocytometer. Dilute to a concentration of 5 x 105 parasites/ml with pH 5.5 medium.\nRemove 10 ml of cell culture and transfer to cell culture flask. Incubate at 32 °C for 5 days.\nDay 14: Check appearance of parasites under the microscope (400X). They should be in the pathogenic amastigote stage, lacking the flagellum characteristic of promastigotes, and ready for assay.",
    "Cytotoxicity assay on L. mexicana axenic amastigotes.\n\tNOTE: The biological testing of peptoids uses high-throughput assays carried out in 96 well plates. This protocol describes the testing of L. mexicana axenic amastigotes, but identical assays can also be carried out on the promastigote stage parasites in appropriate media. Compounds are incubated with parasites at concentrations from 3 - 100 µM for 60 min and then incubated for 24 hr following a 10-fold dilution. Results are gained by measuring the fluorescence of wells after incubation with Resazurin-based cell viability solution (e.g., alamarBlue).\n\t\nPrepare compound stock solutions. Weigh out 1 mg of the final purified peptoid product using an analytical balance. Add the appropriate volume of molecular biology grade dimethylsulphoxide (DMSO) to a concentration of 5 mM. Make 6 µl aliquots and freeze at -20 °C.\nPrepare compound solutions on 96 well plates (a recommended plate layout can be seen in the results section, Figure 6) in triplicate from 100 to 3 µM. Add 2 µl of 5 mM stock solution of each compound in the top row (i.e., A). Add 48 µl fresh Schneider's Insect medium (at pH 5.5 and 20% fetal bovine serum (FBS), 1% penicillin/streptomycin(P/S)) to top row using a multi-channel pipette. Add 25 µl Schneider's Insect medium to all other rows (B - F).\n\t\t\nCarry out a serial dilution by pipetting 25 µl solution from the top row. Add to the row below and mix. Carry out dilutions until the last row, where the last 25 µl solution should be discarded.\nUse amphotericin B (5 mM stocks) as a positive control and DMSO (2% solution) as a negative control in triplicate.",
    "Prepare parasite solution: transfer culture to a 50 ml centrifuge tube and centrifuge at 447 x g for 5 min. Pour off old medium and add 10 ml Schneider's Insect medium (at pH 5.5 and 20% FBS, 1% P/S).\nGently dissolve the pellet of parasites in the new medium using a pipette and count using a Neubauer improved hemocytometer. Dilute culture to 8 x 106 parasites/ml.\nAdd 25 µl L. mexicana culture to each well. Incubate plates for 60 min at 32 °C.\nRemove plate from the incubator and remove 40 µl solution from each well.\nAdd 90 µl fresh medium and incubate for 24 hr at 32 °C.\nAdd 10 µl Resazurin-based cell viability solution to each well. Incubate for 4 hr at 32 °C.\nMeasure the fluorescence using a plate reader (λex = 540 nm, λem = 600 nm), as per manufacturer's instructions. Analyze data by removing average background (from medium only wells) and comparing the fluorescence of wells after normalization with respect to the DMSO controls."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}