{
  "id": 9107,
  "origin_website": "Jove",
  "title": "Utilizing Combined Methodologies to Define the Role of Plasma Membrane Delivery During Axon Branching and Neuronal Morphogenesis",
  "procedures": [
    "Statement of research ethics: All experiments involving animals detailed herein are subject to the rules and regulations of the UNC Committee on Animal Care and to NIH standards for the care and use of laboratory animals.\n1. Preparation and Plating of Dissociated Cortical Neurons\nEuthanize timed-pregnant females by CO2 inhalation followed by cervical dislocation. Remove whole brains from the skulls of embryonic day 15.5 (E15.5) mice and microdissect cortices from each hemisphere. For detailed instructions regarding the microdissection of embryonic mouse cortex please see Viesselmann et al8.\nPlace no more than 4 cortices in 1 ml of dissecting media in a sterile 1.6 ml microtube. Add 120 μl of 10x trypsin and invert the tube 3 - 5 times to mix.\nUsing a hemocytometer, count cells to seed cell culture dishes. Note: 1 cortical hemisphere provides approximately three million cells.\n\t\nFor the SDS-resistant SNARE complex biochemistry assay, plate six million cells per 35 mm dish and utilize two dishes per condition. Note: This is simplified by using 6 well plates when comparing multiple conditions.\nFor branching assays, plate neurons on nitric acid washed circular coverslips at a density of 250,000 cells per 35 mm dish, for DIC imaging of axon branching plate at a density of 150,000. These densities avoid overcrowding and simplify analysis.\nFor live cell TIRF microscopy, resuspend two million neurons per transfection in nucleofection solution at RT.\n\t\nAdd 100 μl of cell suspension to microtube containing 10 μg of VAMP2-pHlourin expression plasmid and electroporate with a nucleofector according to manufacturer protocol9.\nAfter transfections immediately add 500 μl of trypsin quenching media, remove suspension from cuvette and plate cells at a density of 400,000 cells per 35 mm PDL-coated glass bottom dish.\nPlate all cortical neurons in 2 ml of serum free media.\n2. SNARE Complex Formation Assay",
    "Note: SDS-resistant SNARE complexes were processed and analyzed as originally described10 with the modifications detailed below. For validated alternative antibodies to the ones used here, see the materials section.\nStimulate E15.5 cortical neurons 2 days in vitro (DIV) with 250 ng/ml netrin-1 or sham control for 1 hr prior to lysis.\nPrior to processing samples, cool centrifuge to 4 °C, and set water bath temperature to 37 °C, and heat block to 100 °C.\nRemove cell dishes from incubator and place on ice.\n\t\nAspirate media from cells, replace with ~ 2 ml ice cold Phosphate buffered saline (PBS) gently 2 times for 1 - 2 min per wash.\nFor this assay, use 2 wells per condition.\nAspirate PBS from the first well of a condition and replace with 250 μl homogenization buffer. Leave on ice for 5 min, and then using a cell lifter, homogenize cells on ice.\nAspirate the PBS from the next well of the same condition and add the recently homogenized mixture to the well. This will increase protein concentrations. Repeat for all conditions.\nUpon completion, pipette homogenized solution to a pre-cooled 1.6 ml microtube on ice and add 20% TritonX-100 to reach a final concentration of 1% TritonX-100. Triturate mix 10 times with 1,000 μl pipette while minimizing bubbles.\nIncubate tubes on ice for 2 min to solubilize proteins. Following incubation, centrifuge for 10 min at 6,010 rcf at 4 °C to pellet non-solubilized material. Move lysate supernatant into new chilled 1.6 ml tube on ice.\nPerform protein concentration analysis using Bradford assay11 and dilute samples to a final protein concentration of 3 - 5 mg/ml with remaining homogenization buffer supplemented with 1% TritonX-100 and 5x sample buffer supplemented with B-Mercaptethanol (BME).",
    "Divide each experimental sample evenly into 2 tubes. Incubate one sample at 37 °C for 30 min (SNARE complexes), and the other at 100 °C for 30 min (SNARE monomers). Invert tubes intermittently to keep samples in solution.\nFreeze samples at -20 °C until ready to separate via SDS-PAGE. Prior to running samples via electrophoresis using standard techniques, reboil previously boiled samples for 5 min at 100 °C, but thaw 37 °C samples at RT.\nRun duplicates of samples (30 - 40 μg of protein per sample) on both an 8% and a 15% gel; the 8% provides ideal separation of the complex, whereas the 15% is used to quantify SNARE protein monomers (SNAP-25 ~25kDa, VAMP2 ~18kDa, syntaxin-1 ~35kDa). Maintain power source at 70 V until the dye line is through the stacking gel and increase voltage to 90V. Run gels until the dye runs off.\nTo preserve monomers, transfer proteins to 0.2 μm nitrocellulose membrane on ice using cold transfer buffer with 20% Methanol (MeOH) added, at 70 V for 45 min.\nDry membrane in a covered dish for 2 hr to O/N at RT (O/N provides the best results).\nBlock SNARE complex membranes in 10% Bovine Serum Albumin (BSA) for 1 hr at RT.\nPrepare primary antibodies (recognizing specific SNARE complex components) at a dilution of 1:1,000 and probe O/N at 4 °C on a rotary shaker.\n\t\nRinse blots in Tris Buffered Saline plus 0.1% Tween-20 (TBS-T) 3 times for 5 min each.\nPrepare fluorescent secondary antibody solutions at a dilution of 1:20,000 in 1% BSA in TBS-T and probe for 1 hr, covered at RT. Repeat Step 2.12.1 after 1 hr.",
    "Image blots on a fluorescent scanning machine equipped with software suite and quantify both the SNARE protein complex (immunoreactive bands above 40kDa) and monomer bands (immunoreactive bands at 25 kDa, 18 kDa, 35 kDa for SNAP-25, VAMP2 and syntaxin-1, respectively) using manufacturer's instructions for drawing rectangular ROIs.\n3. Imaging Exocytic Events via TIRF Microscopy\nNote: This protocol requires specialized microscopy equipment including an environmental chamber to maintain temperature, humidity and CO2, an inverted TIRF microscope equipped with an epifluorescent illumination, a high magnification/ high numerical aperture (NA) TIRF objective, an automated XYZ stage, and a sensitive Charge Coupled Device (CCD) detector. This protocol uses a fully automated inverted microscope equipped with a 100x 1.49NA TIRF objective a solid state 491 nm laser and an Electron Multiplying CCD (EM-CCD). All equipment is controlled by imaging and laser control software. Prior to the beginning the imaging protocol power on the environmental chamber, stage, lamp, computer, and camera.\nSelect objective within imaging software. Once the objective is in place, fasten the objective heater around the collar.\nConfirm that objective is lowered completely before securing the stage incubator in the stage slot. Pour distilled water into the stage incubator inlets evenly to prevent spill.\nTurn on the incubation system. Open the valve to the CO2 tank and confirm the pressure is appropriate for the system per manufacturer's instructions. Allow chamber some time to reach 5% CO2 and 37 °C. Prior to adding the imaging dish, place an empty dish in the incubator to avoid water condensation on the objective.\nPower on the laser source.",
    "Open stage incubator and add immersion oil to the lens. Place sample in incubator and stabilize with stability arms or a dish weight. Raise the objective until the oil makes contact with the bottom of the sample. Switch to transmitted light illumination and find neuronal focal plane through the oculars.\nStart laser software and connect to the laser control software. Set illumination to widefield and select the objective being used (100X 1.49 NA TIRF is recommended). Set refractive index of the sample (cells ~1.38). Adjust laser intensity by unchecking \"TTL\" for the 491 nm laser. Adjust the slider to 100 then bring it back down to a value between 20 - 40%. Recheck \"TTL\".\nFocus on sample again in transmitted light illumination. Go to imaging software and select 491 nm laser illumination and open shutter. Fine adjust the focal point of the laser on the ceiling and center the point to the center of the closed field diaphragm with the condenser removed. Place condenser upside down on the optical bench, so as not to scratch lens.\nReplace condenser and go to TIRF software and set penetration depth (PD) to 110 nm. Switch from widefield illumination to TIRF illumination mode for imaging.\nFind VAMP2-phluorin expressing cells through the oculars using widefield epifluorescence with epifluorescent light source.\n\t\nAdjust imaging parameters (exposure time, gain and laser power) to maximize signal to noise ratio and dynamic range using the minimal exposure time and laser intensity to reduce photobleaching and phototoxicity (for example: exposure between 50 - 100 msec, with a 15 - 30 gain at 30% maximum laser power).",
    "Set continuous autofocus per cell. Acquire a timelapse image set with acquisition occurring every 0.5 sec for 5 min. For the netrin-1 stimulated condition, add 500 ng/ml netrin-1 to dish of cells in a laminar flow hood and return the dish to the incubator for 1 hr prior to imaging.\nTo quantify the frequency of exocytic events normalized per cell area and time, open image stacks in ImageJ by dragging the file into the window or going to File> Open> Filename (Figure 2A Inset 1).\n\t\nTo remove stable fluorescent signals that do not represent vesicle fusion events, create an average z projection of the entire stack using Image>Stack>Z-Project>Projection type: Average Intensity. Subtract this mean image from each image in the timelapse using Process> Image Calculator> Image1: your stack Operation: Subtract Image2 newly created average z projection. This emphasizes exocytic events (Figure 2A Inset 2 - 3).\nCount exocytic fusion events by eye. Exocytic events are defined as the appearance of a diffraction-limited fluorescence signal, which rapidly diffuses as VAMP2-phluorin diffuses within the plasma membrane (Figure 2A Inset 6).\nUse the Threshold command to highlight the first image using Image>Adjust>Threshold> adjust slider until the whole cell is threshold highlighted (Figure 2A Inset 7 - 8).\nUnder Analyze, choose SetMeasurements and check area and display label. Select the thresholded cellular area using the wand tracing tool and press 'm' to measure (Figure 2A Inset 7 - 8).\nTransfer both the exocytic fusion events count, the cell area measurements, and the elapsed imaging time to a spreadsheet to calculate number of exocytic events/mm2/time (Figure 2A Inset 9).\n4. Differential Interference Contrast (DIC) Timelapse Microscopy of Axon Branching",
    "Note: A complete protocol and demonstration for a general approach to DIC imaging is available12. While this protocol utilizes DIC, other transmitted light microscopy methods may be used for the same purposes (for example: phase contrast).\nAt 2 DIV, place glass bottom imaging dish containing untransfected neurons in pre-warmed environmental chamber to maintain a humid environment with 5% CO2 and 37 °C. Utilize a microscope equipped with a 60X Plan-Apochromat, 1.4 NA DIC objective lens and high NA condenser for best image quality and resolution.\nAdjust the focal plane to find neurons through the oculars using transmitted light illumination.\nUsing the multi area acquisition function on imaging software, find and save the XYZ locations of at least 6 cells. Position the stage so that neurons of interest fit within the field of view for best results.\n\t\nStimulate with 250 ng/ml netrin-1 and press 'start multi area acquisition'. Sequentially acquire images at each position every 20 sec for 24 hr, pausing acquisition and refocusing as necessary.\nReview images in imaging software using Apps>Review Multi Dimensional Data>open file name. Identify stable axon branches (20 µm long) that form during the imaging session. Use the line draw tool to measure a stableaxon branch from the base at the axon to the tip to ensure the 20 µm length qualification is met.\n\t\nIn a spreadsheet, record the frame number after netrin stimulation when membrane protrusions initiate in areas where branches later form as well as the frame number after netrin stimulation when nascent branches reach 20 µm in length.\nMultiply the number of frames between protrusion and branch formation by 20 sec to calculate the formation time per branch.\n5. Toxin Manipulations and Fixed Cell Immunofluoresence",
    "At 2 DIV, treat neurons in experimental conditions with 250 ng/ml netrin-1 and/or 10 nM Botulinum A toxin (BoNTA), which cleaves the SNARE protein SNAP25 and effectively inhibits SNARE mediated exocytosis13, plus 250 ng/ml netrin-1. Leave one set of untreated neurons as control condition.\n\tCAUTION: BoNTA requires the use of eye and respiratory protection when preparing and using solutions. Maintain all contaminated materials as biohazardous material and autoclave as soon as possible.\nAt 3 DIV (24 hr post treatment) aspirate media, and immediately replace with at least 1 ml of PHEM fix (see Table 1 for details) warmed to 37 °C. Incubate for 20 min in the dark at RT.\nRinse 3x with PBS (for future use seal with parafilm and store at 4 °C).\nPlace coverslips in dark, humidified staining chamber and permeabilize the cell membranes for 10 min in freshly diluted 0.2% TritonX-100 in PBS (made from 10% TritonX-100 stock).\nRemove permeabilization solution and rinse with 50 µl of 1x with PBS. Block for 30 min in ~50 µl of 10% Bovine Serum Albumin in PBS (BSA-PBS) or 10% Boiled Donkey Serum in PBS at RT.\nRinse with 1x PBS again. Incubate coverslips in 50 µl of primary antibody (1:1,000 βIII tubulin, to confirm neuronal identity) in 1% BSA-PBS for 1 hr at RT, in the dark.\nPerform 3x 5 min washes in PBS. Incubate coverslips in 50 µl of spectrally-distinct secondary antibody for tubulin (1:400), and fluorescent phalloidin (varies by excitation: 488 phalloidin at 1:400, 647 phalloidin at 1:100) in 1% BSA-PBS for 1 hr.\nWash 3x 5 min in 1x PBS and mount coverslips onto slides in mounting media.\nVacuum excess mounting media from the edges of the coverslip and seal with clear nail polish.",
    "Collect widefield epifluorescence images on an inverted microscope with a 40X 1.4NA objective, epifluorescent capabilities and EM-CCD.\n\t\nManually analyze branching using ImageJ. Open image stacks in ImageJ by dragging the file into the window or going to File> Open> Filename (Figure 4A inset 1).\nUsing line>segmented line, trace the axon, defined as the longest neurite extending from the soma(Figure 4A inset 2 - 3).\nUsing Analyze>Tools>ROI Manager, save the axon tracing as a region of interest. Trace and save each axon branch, defined as a neurite ≥20 µm in length. Include only primary branches (outgrowths directly sprouting from the axon) in the analysis (Figure 4A inset 3 - 4).\nPress 'm' to measure the saved regions of interest, and transfer lengths in pixels to a spreadsheet to calculate the length in µm.\nDivide the number of axon branches ≥20 µm in length, by the length of the axon in µm divided by 100 to get number of axon branches per 100 µm length.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}