{
  "id": 11811,
  "origin_website": "Jove",
  "title": "Intra-Peritoneal Transplantation for Generating Acute Myeloid Leukemia in Mice",
  "procedures": [
    "All experiments were preapproved by the Institutional Animal Care and Use Committee at the Pennsylvania State University.\n1. Preparation of buffers and reagents\nPrepare ampicillin supplemented (AP) LB agar plates (sterile 10 cm plates). To do this, dissolve 10 g of LB broth with agar in 400 mL of distilled water, stir, and bring the volume up to 500 mL. Sterilize the solution by autoclaving, then allow the solution to cool down, add 0.5 mL of ampicillin (stock: 150 mg/mL) into solution, and shake it to mix. Immediately add 18 mL of solution to a sterile 10 cm plate near an alcohol lamp, allow to solidify at room temperature, and store the plates upside down at 4 °C until further usage.\nPrepare LB media by dissolving 10 g of LB without agar in 500 mL of distilled water. Sterilize the solution by autoclaving, allow the solution to cool down,add 0.5 mL of ampicillin (stock: 150 mg/mL) into solution, and shake it to mix.\nPrepare flow buffer by adding 5 mL of penicillin/streptomycin and 10 mL of heat-inactivated fetal bovine serum (hiFBS) into 485 mL of 1x Dulbecco's phosphate buffered saline (DPBS).\n\tNOTE: To inactivate FBS by heating, place thawed FBS bottles in a 56 °C water bath. Ensure that the bottles don't tip over or otherwise become submerged in the water bath. The temperature is critical for complete degradation; to ensure this, wait until the temperature stabilizes at 56 ˚C after putting the bottles to the water bath. Gently swirl the bottles every 10 min three times. Do not allow the serum to incubate for more than 30 min.",
    "Prepare maintenance media by adding 50 mL of hiFBS, 5 mL of L-glutamine, and 5 mL of penicillin/streptomycin into 440 mL of Dulbecco's modified eagle medium (DMEM). Prepare transfection media by adding 50 mL of hiFBS and 5 mL of L-glutamine into 445 mL of DMEM media.\nPrepare red blood cell (RBC) lysis buffer by adding 4.145 g of NH4Cl, 0.504 g of NaHCO3, and 16.81 mg of ethylenediaminetetraacetic acid (EDTA) into 500 mL of distilled water. Prepare incomplete Iscove's modified Dulbecco's medium (IMDM) media by adding 75 mL of hiFBS, 5 g of bovine serum albumin (BSA), 0.5 mL of 10 mg/mL insulin, 2.5 mL of 4 mg/mL holo-transferrin, 3.5 µL of β-mercaptoethanol, 5 mL of L-glutamine, and 0.5 mL of ciprofloxacin into 416.5 mL of IMDM media.\nPrepare 10 mL of 2x IMDM media, in which the concentration of cytokines is twice the amount in 1x IMDM media, by adding 10 µL of 50 ng/µL mr-SCF, 20 µL of 25 ng/µL mr-Flt3L, 20 µL of 10 ng/µL mr-IL-6, 20 µL of 10 ng/µL mr-IL-3, 10 µL of 10 mg/mL insulin, and 50 µL of 4 mg/mL holo-transferrin into 9.87 mL of incomplete IMDM media.\n\tNOTE: Ensure that flow buffer, RBC lysis buffer, maintenance media, transfection media, and incomplete IMDM media are filter sterilized before use.\n2. Plasmid transformation\nThaw 20 µL of α-Select competent cells on ice. Add 1 µL (~2 ng) of MSCV-MLL-AF9-EF1α-luc2-P2A-EGFP-LC3 plasmid22 to thawed competent cells and gently mix by tapping the tube. Incubate the reaction on ice for 30 min.\nHeat shock the mixture by incubation for 40 s in a 42 °C heating block. Immediately transfer the tube on ice for 2 min.",
    "Add 1 mL of LB media (without ampicillin) to the tube and shake at 37 °C and 200 rpm for 1 h.\nCentrifuge the tube at room temperature at 500 x g for 4 min and discard 0.9 mL of supernatant. Resuspend the precipitate in the remaining 0.1 mL of LB media.\nSpread the transformed competent cells on pre-warmed (37 °C) AP LB agar plates. Incubate the plate upside down at 37 °C for 12-16 h.\nPick a single colony and expend the transformed cells in 10 mL of AP LB media overnight at 37 ˚C and 200 rpm.\nAdd 5 mL of expended transformed competent cells to 500 mL of AP LB media in a flask and incubate the flask overnight at 37 °C and 200 rpm.\nExtract the plasmid using a plasmid extraction kit according to manufacturer's instructions and resuspend in 0.5 mL of autoclaved ultrapure water. Quantify the plasmid using a spectrophotometer.\n3. Transfection of Phoenix Ecotropic (pECO) cells\nCulture 2 x 106 pECO cells/plate in maintenance media in 10 cm plates in a humidified 5% CO2 incubator at 37 °C. Ensure that the pECO cells are maintained in exponential growth phase and actively dividing before passage.\nWhen the cells become 80% confluent, wash the plates with 5 mL of DPBS twice, add 1 mL of trypsin to the plate, and incubate in a humidified 5% CO2 incubator at 37 ˚C for 2 min. Harvest the cells with 5 mL of maintenance media in a sterile 15 mL tube and centrifuge at 4 °C and 400 x g for 3 min. Resuspend the cell pellet in 5 mL of maintenance media.\nMix 10 µL of cell suspension and 10 µL of trypan blue and load 10 µL onto a hemocytometer to count the cells.",
    "Total cells/mL = (Total cells counted x Dilution factor x 104 cells/mL)/ Number of squares counted)\n\tSeed 2 x 106 cells/dish into 6 cm dishes using 5 mL of maintenance media for transfection and culture the cells in a humidified 5% CO2 incubator at 37 °C.\nReplace the maintenance media with 5 mL of transfection media when the cells become 50%-60% confluent after 18 h of culture.\nKeep the transfection reagent at room temperature for at least 30 min before transfection.\nAdd 5.5 µg of MSCV-MLL-AF9-EF1α-luc2-P2A-EGFP-LC3 plasmid22 to 0.5 mL of plain DMEM media in a sterile 1.5 mL tube. Mix it gently by tapping the tube and allow it to sit for 10 min.\nAdd 14.6 µL (3x the plasmid amount; v/w) of transfection reagent to the tube and gently tap the tube every 10 min three times.\nUniformly add the mixture dropwise to all areas of the dishes with the pECO cells in transfection media. Gently move the dishes forward and backward 10 times and sideways 10 times. Incubate the dishes in a humidified 5% CO2 incubator at 37 °C for 48 h.\nMeasure the transfection efficiency by florescence microscopy and flow cytometry for green fluorescent protein (GFP) as described in22. The cells are first gated on FSC-A/FSC-H and FSC-A and SSC-A to acquire singlets. The GFP+ population is gated on FL1 plot by comparing it to non-transfected cells.\nCollect and filter the supernatants through a 0.45 µm syringe filter into a sterile 50 mL tube. Use the supernatants immediately for transduction or snap freeze them in liquid nitrogen and store them at -80 °C until further use.",
    "NOTE: pECO cells have to be properly mixed and seeded in dishes uniformly. Allow the cells to spread by moving the dishes forward and backward 10 times and sideways 10 times while seeding. The cell number to be seeded may vary depending on the variations in counting. To find the optimal seeding cell number that can achieve 50%-60% confluence after 18 h of culture, seeding cells with serial dilutions is helpful.\n4. Lentiviral transduction\nEuthanize 8-10-week-old CD45.1 female C57BL6/J mice (two to three donor mice per recipient mouse) in a CO2 chamber.\nSterilize the whole body of the mice with 70% ethanol. Place the mice onto a sterile surgical pad on a Styrofoam board and pin the legs through the mouse paw pads.\nCut the skin above the abdominal cavity at the midline and widen the subcutaneous space toward the hind legs with sharp-end sterile scissors.\nExtend the incision from the abdominal midline down to the ankles. Widen the subcutaneous space below the hind legs with the blades of sharp-end sterile scissors.\nCut the Achilles's tendon with sharp-end sterile scissors. Hold the tendon using forceps with teeth and cut the other end attached to the femur to remove the gastrocnemius muscle.\nCut the quadriceps tendon attached to the knee with sharp-end sterile scissors. Hold the tendon using forceps with teeth and cut the muscle heads attached to the femur to remove the gastrocnemius muscle.\nCut the other muscles surrounding the femur at the end attached to the tibia with sharp-end sterile scissors.\nCut the ankle with sharp-end sterile scissors, ensuring that the tibia remains intact. Hold the distal end of the femur using forceps with teeth and cut the hip joint with sharp-end sterile scissors, ensuring that the femoral head remains intact.",
    "Transfer the tibias and femurs to flow buffer in a sterile 15 mL tube.\nSeparate the tibia and femur by breaking the knee by hand. Remove the patella, cartilage, and femoral condyles to expose the tibial plateau and distal femur by hand. Remove the muscles using a sterile gauze and then soak the bones in flow buffer.\nCut the femoral neck and flush the bone marrow cells with flow buffer from both ends of the femur using a 10 mL syringe with a 23 G needle.\nCut the tibial malleolus and flush the bone marrow cells with flow buffer from both ends of the tibia using a 10 mL syringe with a 23 G needle.\nDisperse the cells by pipetting up and down using a 10 mL syringe with an 18 G needle. Centrifuge the single cell suspension at 4 °C and 400 x g for 3 min.\nDiscard the supernatant and resuspend the cells in 5 mL of RBC lysis buffer to lyse the RBCs for 3 min.\nAdd 5 mL of flow buffer to stop the lysis and centrifuge the cell suspension at 4 °C and 400 x g for 3 min.\nPlace a 70 µm cell strainer onto a sterile 50 mL tube. Suspend the pellet with 5 mL of flow buffer, mix, and pass through the cell strainer to collect the cells.\nAdjust the cell concentration with flow buffer to 1 x 108/mL in round bottom polypropylene tubes.\nSelect Lin- cells using a mouse hematopoietic cell isolation kit according to the manufacturer's instruction.",
    "Keep aside three tubes of 1 x 104 cells in 100 µL of buffer for one unstained control and two single antibody-stained controls for APC-conjugated anti-mouse CD117 (c-Kit) and PE-Cy7-conjugated anti-mouse Ly-6A/E (Sca-1). Use 1 µL of antibody (from 0.2 mg/mL stock) for each of the single antibody-stained controls.\nStain the rest of the cells in a tube with both antibodies (4 µL of each from 0.2 mg/mL stocks) in 400 µL. Incubate the tubes on ice in the dark for 0.5-1 h.\nAfter staining, wash the cells by adding 1 mL of flow buffer and centrifuge at 4 °C and 400 x g for 3 min.\nResuspend the cells for the unstained control and the single antibody-stained controls in 100 µL of flow buffer. Resuspend double antibody-stained cells in 1 mL of flow buffer for sorting.\nSort hematopoietic stem cells (HSCs) as an LSK population using a cell sorter as described in23,24.\nWhile staining, coat a sterile 6 cm dish with retronectin as follows: Prepare 100 µg/mL stock of retronectin in PBS and add 0.9 mL of PBS and 0.1 mL of retronectin to a 6 cm dish. Coat the dish in a sterile hood at room temperature for 2 h. Then, remove the retronectin and block the dish with 0.5 mL of filtered 2% BSA (in PBS) for 30 min. Wash the dish with 5 mL of PBS twice and the dish is ready for transduction.\nCentrifuge the sorted HSCs or unsorted Lin- cells at 4 °C and 400 x g for 3 min and resuspend in 3 mL of 2x (of cytokines) IMDM media and 3 mL of viral supernatant (generated from step 3.10) in a retronectin-coated dish.Incubate the dish in a humidified 5% CO2 incubator at 37 °C for 6 or 24 h.",
    "NOTE: In the present study, Lin- cells were either sorted or unsorted depending on the experimental design.\n5. Serial transplantation (Figure 1)\nNOTE: Primary recipient mice were 8-10-week-old male C57BL6/J mice (CD45.2). They were provided water ad libitum containing antibiotics to prevent opportunistic digestive infections, from 3 days prior to transplantation to 7 days post transplantation. Primary recipient mice were sub-lethally irradiated (4.75 Gy) 3 h before transplantation25. Isoflurane was not applied to mice with intra-peritoneal injection.\nAfter transduction for 6 or 24 h, harvest the cells by centrifugation at room temperature and 400 x g for 3 min. Use trypsin to collect the cells attached to the dish bottom if needed. Discard the supernatant and resuspend the cells in prewarmed PBS. Determine the volume of PBS depending on the number of recipients (i.e., 0.1 mL/mouse and 0.5 mL/mouse for recipients with retro-orbital and intra-peritoneal injections, respectively).\nPlace the sub-lethally irradiated recipient mice in an isoflurane chamber (flow rate of oxygen is set as 1.0 L/min and vaporizer of isoflurane is set as 5%). Apply wet ointment to the eyes to prevent dryness while under anesthesia. The mice are ready for further procedures when the heartbeat drops to 60 beats per min.\nInject cells into primary recipient mice retro-orbitally (0.1 mL/mouse)7 or intra-peritoneally (0.5 mL/mouse)26 with a 27 G1/2 needle. Observe the mice continuously until they gain sufficient consciousness to maintain sternal recumbency. Monitor the mice daily for their well-being post transplantation.\nAfter 1 month, collect blood weekly by retro-orbital bleeding to monitor leukocytosis by evaluating complete blood count (CBC) on a hemavet as described below.",
    "Place the mouse laterally after anesthesia with isoflurane (flow rate of oxygen is set as 1.0 L/min and vaporizer of isoflurance is set as 5%). The mice are ready for further procedures when the heartbeat drops to 60 beats per min.\nProptose the eye with the thumb and index finger. Penetrate the venous sinus plexus with asterile hemacrit capillary tube through the inner canthus.\nCollect 20-25 µL of blood into an EDTA blood collection tube and close the eyelids to stop the bleeding. Apply one drop of gentamicin sulfate ophthalmic solution to the eye.\nAt the endpoint, when the white blood cells (WBCs) reach 4 x 104 cells/µL, euthanize the mouse in a CO2 chamber and isolate the bone marrow cells by flushing the femurs and tibias with flow buffer, followed by RBC lysis as mentioned in step 4.\nAt the endpoint, harvest the splenocytes as mentioned below.\n\t\nEuthanize the mouse in a CO2 chamber. Place the mice onto a sterile surgical pad on a Styrofoam board and pin the legs through the mouse paw pads. Sterilize the whole body of the mice with 70% ethanol.\nCut the skin and muscle at the midline to expose the abdominal cavity with sharp-end sterile scissors. Isolate the spleen with sharp-end sterile scissors and put it in flow buffer in a sterile 15 mL tube.\nMesh the spleen through a 70 µm sterile strainer in a 6 cm dish with 3 mL of flow buffer. Transfer the cells from the dish to a sterile 15 mL tube and centrifuge the single cell suspension at 4 °C and 400 x g for 3 min.",
    "Discard the supernatant and resuspend the cells in 5 mL of RBC lysis buffer to lyse the RBCs for 3 min. Add 5 mL of flow buffer to stop the lysis and centrifuge the cell suspension at 4 °C and 400 x g for 3 min.\nPlace a 70 µm cell strainer onto a sterile 50 mL tube. Suspend the pellet with 5 mL of flow buffer, mix, and pass through the cell strainer to collect cells.\nIdentify primary (1˚) AML cells by staining the splenocytes and bone marrow cells with FITC-conjugated anti-mouse CD45.1 antibody and detecting on a flow cytometer. The cells are first gated on FSC-A/FSC-H and FSC-A and SSC-A to acquire singlets. The CD45.1+ population is gated on FL1 plot by comparing it to unstained cells.\nFor secondary (2˚) transplantation, resuspend CD45.1 AML splenic cells from 1˚ r.o. recipients in PBS (0.1 mL/mouse) and inject them retro-orbitally into CD45.2 male C57BL6/J mice. Parallelly, resuspend AML splenic cells from 1˚ i.p. recipients in PBS (0.5 mL/mouse) and inject them intra-peritoneally into 8-12-week-old red fluorescence protein (RFP)-expressing Ai14TdTomato male mice27.\nFor tertiary (3˚) transplantation, resuspend AML cells isolated from the bone marrow or peritoneal cavity of 2˚ i.p. recipients and inject them intra-peritoneally into Ai14TdTomato (RFP+) or CD45.2 mice, respectively. Resuspend AML cells isolated from the peritoneal cavity of 2˚ r.o. recipients and transplant them by r.o. injection into Ai14TdTomato (RFP+) mice.",
    "NOTE: For 2˚ transplantation, we identified the disease progression in 2˚ recipients by monitoring the CBC in peripheral blood. To further confirm the establishment of AML, we collected whole peripheral blood by heart puncture as well as bone marrow, spleen, and liver. Furthermore, we performed i.p. lavage to collect i.p. cells. Single cell suspensions were acquired from bone marrow, spleen, and i.p. lavage as described above. Cells from these sites were analyzed on a flow cytometer following RBC lysis. AML cells were recognized as RFP negative (RFP-) cells. For 3˚ transplantation, we sampled blood, bone marrow, spleen, liver, and i.p. cells at the endpoint; RFP- or CD45.1+ cells were identified as AML cells and examined by flow cytometry. No irradiation or antibiotic water was given to 2˚ and 3˚ recipient mice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64834/64834fig01.jpg\nFigure 1: Schematic of MLL-AF9 viral transduction in bone marrow HSCs and serial transplantation (1˚, 2˚, and 3˚). Sorting of Sca-1 and c-Kit double positive population by using a cell sorter shown in the dotted shade box is considered optional, should resources allow. The figure was created using BioRender (https://biorender.com/). Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64834/64834fig01large.jpg]\n6. Intra-peritoneal lavage\nInject 5 mL of incomplete IMDM media into the peritoneal cavity twice to collect the cells in a 15 mL sterile tube. Centrifuge the cell suspension at room temperature and 400 x g for 3 min. Transplant AML cells (4 x 105 cells/mouse) from the peritoneal cavity of 2˚ recipients via i.p. injection into 3˚ CD45.2 recipient mice (n = 3).\n7. Histological analysis 28\nIsolate the spleens, livers, and femurs from mice upon euthanasia. Fix them in 5 mL of 10% (v/v) buffered formalin. Sample the spleens and livers from healthy counterparts for comparisons.",
    "Embed fixed tissues in paraffin and cut them into sections. Stain the sections with hematoxylin and eosin (H&E) dyes.\nObtain the images under a microscope at 20x magnification installed with a compatible software for histological analysis.\n8. Performing semi-quantitative PCR (qPCR)\nPrepare RNAs in RNA reagent according to the manufacturer's instructions.\nUse 0.5-1.0 µg RNAs to synthesize cDNA using a cDNA reverse transcription kit according to the manufacturer's instructions.\nUse cDNA to perform qPCR using a qPCR kit and run the samples in a qPCR system. Use the following pre-validated TaqMan probes: KMT2A (MLL; Ref Seq: NM_001197104(2), IDT)29 and 18S ribosomal RNA (Hs99999901_s1).\nLoad the KMT2A and 18S amplicons onto a 2% agarose gel to visualize the expression. Acquire images in an imager installed with the compatible software program.\n9. Data processing\nAnalyze results using statistical analysis software and present the results as the mean ± SEM. Generate figures using a commercial illustrator tool.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}