{
  "id": 7925,
  "origin_website": "Bio",
  "title": "In vivo Electroporation of Skeletal Muscle Fibers in Mice",
  "procedures": [
    "Inject plasmids and electroporate FDB Prepare a solution of 0.5 mg/mL hyaluronidase in sterile deionized H2O (< 18 MOhm). Aliquot and store at ≤ -20 °C.Note: It is best to prepare ~100 μL per mouse, to allow 20 μL injection into each footpad and dead volume in the syringe needle. Anesthetize the mouse in an induction chamber with 3% isoflurane and 0.8 L/min of O2. Once the mouse has stopped moving and breathing has slowed, depth of anesthesia should be confirmed through toe-pinch reflex.Note: We have performed this procedure on mice ranging from three to six months of age, but generally 16–20 weeks; even so, the procedure is expected to be appropriate for mice outside this range. During the induction period, load a syringe (1 mL or less) with hyaluronidase solution from step A1. Inject 20 μL into each footpad.Transfer the mouse from the induction chamber to a nose cone maintaining flow of 1.5% isoflurane. The mouse should lay belly down with legs extended away from its head. Clean the skin of the foot with isopropanol.The FDB is a long, thin muscle spanning the length of the mouse foot. It is the most superficial of the foot muscles in the mouse. Hyaluronidase should be injected beneath the skin but above this muscle. There is an excess of skin at the heel of the mouse foot that can guide injection into the footbed. The syringe needle can be pressed upward against the excess skin as the needle is inserted down the length of the foot, to ensure that this is achieved. Insert the needle to a point just above the branching of the foot into toes. Eject 20 μL of hyaluronidase solution while slowly pulling the needle out. This helps to deliver the solution evenly throughout the footbed.",
    "Remove the mouse from isoflurane and observe its recovery. Mice should be allowed to recover for several minutes on a heated pad. Once the mouse is awake and alert, return it to its home cage. Allow 2 h for hyaluronic acid to digest extracellular matrix before injecting plasmids.Prepare plasmids for injection. Injection of 20 μg per foot is standard, although more or less may be desirable (this must be determined empirically). Injection volumes should range between 10 and 20 μL. Therefore, dilute plasmid to a concentration between 1 and 2 μg/mL (if necessary) in sterile water.Note: Overexpression of some proteins can be toxic, which manifests experimentally as relatively few transfected fibers. Repeat steps A1–A4 to anesthetize the mouse and prepare for plasmid injection to the FDB. Additionally, while anesthesia is induced, prepare the electroporator, connect electrodes, adjust settings, and sterilize electrode tips.Inject plasmid into one foot, as in step A5. Immediately position the needle tips of the electrode at opposite ends of the foot (one near the heel and one near the toes). Electroporate the muscle with 20 pulses of 150 V and 20 ms duration separated by 980 ms. The foot should twitch with each pulse. If the voltage is too high, the mouse may convulse throughout its body; if the voltage is too low, the foot will not twitch, and transfection will be poor.Note: These settings are guidelines that have worked well in our hands but may require adjusting. Transduction efficiency will depend on accuracy of injections and electrode placement as well as the strength of electroporation used. Allow the mouse to recover as in step A6. Robust expression of plasmids is typically seen within 7–10 days after the procedure.",
    "Dissect FDB and isolate individual muscle fibers Prepare stocks of 1% collagenase in sterile DMEM (high glucose, with L-glutamine and sodium pyruvate).Prepare digestion buffer (Recipe 1) and warm to 37 °C until FDB muscles are dissected. Prepare 1 mL of digestion buffer per mouse. Both FDB muscles can be digested in a single microfuge tube with 1 mL of digestion buffer, or individual muscles can be digested in 500 μL each.Euthanize the mouse with an inhalation overdose of isoflurane and perform a secondary means of euthanasia (e.g., cervical dislocation). Pin the foot to a dissecting board just above the branching of the digits using a dissection pin.Find the excess skin at the heel of the foot and grasp with forceps. Using dissecting scissors, clip the excess skin. This creates a small hole in the skin at the heel of the foot. Using forceps, gently pull up on the skin at this incision. The skin should be a thin layer, distinct from the muscle underneath. Holding the skin away from the muscle with forceps will help to avoid cutting into and damaging the muscle in the next step.Using dissecting scissors, cut through the skin on either side of the foot from heel to toe. Leave the skin attached at the toes. The skin should now form a triangle, point detached at the heel, and base attached at the toes. From the tip, peel the skin back to expose the underlying foot muscles.The FDB tendon is found at the base of the foot near the heel. Grasp the tendon with forceps and cut such that the forceps are still holding the tendon after it is released from the bone. The FDB is the long, superficial muscle directly beneath the skin.",
    "It can be released from underlying muscles by pulling up on the tendon with forceps and clipping at the sides along the length of the muscle. It terminates where the toes branch. Cut the tendon to fully release the muscle from the foot. OPTIONAL STOPPING POINT:  If individual muscle fibers are not required for downstream analysis, the following steps are not necessary. Transfection efficiency is generally low, so detection of the target protein may require a biochemical tag with strong detection reagents. If the target protein is fluorescently tagged, the following steps are recommended.Note: See Video 1 for a demonstration of the dissection. <p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Dissection of mouse flexor digitorum brevis muscle Transfer the whole muscle to a Petri dish containing ~20 mL of sterile HBSS. With forceps, briefly rinse the muscle by moving it through the solution to remove any blood, hair, or other contaminants. Move rinsed FDB muscles to digestion buffer. Incubate at 37 °C for 3 h.Prepare 10% BSA in DMEM (digestion stop solution, 1 mL per FDB). Warm to 37 °C.Note: Fetal bovine serum (FBS) can replace BSA, depending on the application. Transfer FDB muscle from digestion buffer to 1 mL of digestion stop solution. Using a wide-bore P200 pipette tip (cut the narrow tip of a normal P200 tip to make a tip diameter of approximately 2 mm), dissociate the fibers with smooth pipetting, 10 times. Repeat this process twice more, using consecutively narrower pipette tip bores. Finally, using a standard P200 pipette tip, pipette the solution 40 times to fully release individual muscle fibers.Allow the contents of the tube to settle for 2 min and then remove the supernatant containing individual muscle fibers.Allow the supernatant to settle for an additional 15 min.",
    "The muscle fibers will settle, while small debris, dead cells, and single cells from the tissue will remain floating. Remove and discard the supernatant. Resuspend the individual muscle fibers in a buffer suitable for the desired analysis. For any experiment involving visualization of a fluorescent protein, we recommend modified DMEM imaging buffer (Recipe 2) or commercially available phenol-free DMEM, because phenol red and several vitamins contained in standard cell culture media fluoresce when excited with ~488 nm light."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}