{
  "id": 5821,
  "origin_website": "Bio",
  "title": "A Bioreactor Method to Generate High-titer, Genetically Stable,  Clinical-isolate Human Cytomegalovirus",
  "procedures": [
    "TIMING Expanding ARPE-19 cells (step A1: 2 weeks) Preparing the culture feeder flask and beads (steps A2-A6: 3 h to be performed the day before seeding) Seeding ARPE-19 cells in feeder flask (step A7-A11: 6.5 h) Replacing media in feeder bioreactor (step A12: 15 min every 3-4 days) Preparing the samples for cell count (steps B1-B8: 25 min) Incubating cells in the bioreactor until confluent (step C1: 1-2 weeks) Infecting cells in bioreactor (steps C2-B4: 10 min) Replacing media and cells in infected bioreactor (steps D1-D7: 25 min) Preparing the 96-well plate for TCID50 (step E1: 15 min) Setting up TCID50 infections (steps E2-E11: 25 min) Determining titer from TCID50 (steps E12-E13: 10 min) Preparation of virus collected from bioreactor (steps F1-F6: 25 min) Concentrating virus stocks (step F7: 3 h) See Figure 1 for bioreactor system setup for the experiment.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171030/20171030013506_2513.jpgFigure 1. Bioreactor system setup for maintaining continuous virus production. A. An adherent cell line (ARPE-19) is added to a 500 ml silicon coated glass feeder flask containing 2.5 g hydrated microcarrier beads in 150 ml DMEM-F12 media. This feeder flask is placed in a 37 °C incubator for 4 h to allow ARPE-19 cells to adhere to microcarrier beads, mixing every half an hour. B. After 4 h, the volume of media is brought up to working concentration of 500 ml and put on a stirring plate set at 60 rpm back in the same incubator. Allow a week for the cells to divide on the microcarrier beads and reach confluence in the feeder flask. C. When confluence is reached, 250 ml of stirred microcarrier beads from the feeder flask are transferred to a smaller, 250 ml bioreactor. This smaller bioreactor is then infected with TB40/E IE2-EYFP at an MOI of 0.01.",
    "Both the small and the large bioreactors are placed back in the incubator on the stir-plate. D. When virus expansion reaches desired steady state, slurry (microcarrier beads/media, taken when spinning) and supernatant (media collected when stir plate is off and microcarrier beads settle) are collected from the infected bioreactor. Uninfected ARPE-19 cells are taken from the feeder flask and added into the infected bioreactor, along with fresh media. The rate of microcarrier bead and media replacement maintains end stage viral production of HCMV. The volume of the infected bioreactor and the microcarrier bead concentration remains constant. This induced steady state can be continued for as long as desired, and collected samples from infected reactor are concentrated to create virus stocks.Seeding Cytodex 1 microcarrier beads with ARPE-19 cells (Figure 1A)Culture sufficient ARPE-19 cells on 15 cm cell culture dishes such that you have 1 x 106 cells/ml final volume. For a 500 ml Celstir spinner flask (feeder flask), you need 5 x 108 cells. The day before seeding, siliconize 500 ml feeder flask and an autoclavable 100 ml glass container with Sigmacote according to manufacturer’s instructions (http://www.sigmaaldrich.com/content/dam/sigma-aldrich/docs/Sigma/Product_Information_Sheet/1/sl2pis.pdf[href=http://www.sigmaaldrich.com/content/dam/sigma-aldrich/docs/Sigma/Product_Information_Sheet/1/sl2pis.pdf]). Note: This procedure has been optimized for greatest adherence of ARPE-19 cells to the prepared Cytodex 1 microcarrier beads during seeding. Sigmacote is used to prevent cells from adhering to the walls of the spinner flasks. Given that it can be toxic to cells, rigorous rinsing is needed after siliconizing.Rinse feeder flask and glass container thoroughly with MilliQ water, at least 10 times. Place a new vented screw-on caps onto each arm of the flask. Weigh the appropriate amount of dry Cytodex 1 microcarrier beads to reach 0.5 g/100 ml bioreactor final volume. For 500 ml feeder flask, measure out 2.5 g microcarrier beads.",
    "Pour dry Cytodex 1 microcarrier beads into a siliconized 100 ml glass container, and add 100 ml DPBS-CMF (DPBS without calcium and magnesium). Resuspend beads thoroughly. For more information refer to GE manual: http://www.gelifesciences.com/file_source/GELS/Service%20and%20Support/Documents%20and%20Downloads/Handbooks/pdfs/Microcarrier%20Cell%20Culture.pdf[href=http://www.gelifesciences.com/file_source/GELS/Service%20and%20Support/Documents%20and%20Downloads/Handbooks/pdfs/Microcarrier%20Cell%20Culture.pdf].  Autoclave feeder flask and resuspended microcarrier beads.Remove by pipetting 50 ml DPBS-CMF from settled beads in a 100 ml glass container, replace with 50 ml DMEM-F12 with 10% FBS. Resuspend by vortexing. Incubate the glass container with the beads at 37 °C until beginning step A9.Trypsinize 5 x 108 ARPE-19 cells, resuspend in 90 ml DMEM-F12 with 10% FBS, and place in feeder flask. Take the glass container with settled beads from the 37 °C incubator and remove by pipetting 60 ml (i.e., most of the liquid). Resuspend these microcarrier beads in the remaining 40 ml of DMEM-F12 with 10% FBS left in the glass container and transfer them to the feeder flask. Add another 20 ml of 100% FBS to enhance cell adhesion. Final volume in the feeder flask should be about 150 ml and the final FBS concentration should roughly be 25%. Place feeder flask in the 37 °C incubator to allow cells to adhere to beads for 4 h. Every 30 min, place the feeder flask on a slow-speed stir-plate set at 60 rpm within the incubator for 30 sec to gently agitate bioreactor and ensure even seeding of cells. After 4 h, bring the feeder flask to full 500 ml volume by adding 350 ml DMEM-F12 with 10% FBS.Place the feeder flask on 4 position slow-speed stir-plate set to 60 rpm in the incubator.Replace media within the feeder flask every 2-3 days to maintain cell density.",
    "To do this, let beads settle for 10 min, then remove 50-75% of the total media volume (250-375 ml), and replace it with the same amount of fresh media (DMEM-F12 with 5% FBS). Let cells expand across the microcarrier beads for a week, or until maximum cell density (step C1) is reached (monitor through cell counts in Procedure B and by eye). Note: If seeding is too low, the maximum cell density in the spinner flask will also remain low over time. Once seeding is completed, if there are any microcarrier beads without cells, they will always remain uncoated. After the spinner flask is placed permanently on the stir-plate, cells are unable to bind to new cells, and the only method of cell spreading is through cell division. Monitoring ARPE-19 cell density on microcarrier beads (Figure 1B)Note: In the procedure, we are obtaining accurate cell counts for the feeder reactor. To do this, we take a sample of the slurry, perform a wash to remove debris, and then trypsinize the cells off of the microcarrier beads. Because the microcarrier beads settle much more quickly than the cells, we are able to easily separate the two without centrifuging.Remove the feeder flask from the incubator and place on a stir-plate set at 60 rpm inside a class II biosafety cabinet.Pipette 1 ml slurry (mixed cells/microcarrier beads/media) from the feeder flask while it stirs on stir-plate and dispense into a 1.5 ml microcentrifuge tube. Put the feeder flask back into the incubator on stir-plate, you will not need to use it for the remainder of this procedure. Let microcarrier beads in the microcentrifuge tube settle for 2 min. The microcarrier beads can be observed visually settling to the bottom of the microcentrifuge tube by gravity, no centrifugation is necessary.",
    "Wash by pipetting out 0.8 ml of media from the microcentrifuge tube, and resuspending with 0.8 ml of DPBS-CMF. Resuspend beads by gently vortexing on vortex mixer or by pipetting up and down, then let microcarrier beads settle again. Remove 0.8 ml of DPBS-CMF from the microcentrifuge tube and replace with 0.8 ml of 0.25% trypsin. Resuspend cells by gently vortexing. Place microcentrifuge tube in the 37 °C incubator and let cells trypsinize for 15-20 min, resuspending every 5 min by gently vortexing or flicking to ensure even trypsinization. Place microcentrifuge tube back in the biosafety cabinet and pipette vigorously to resuspend using P1000 pipette. This step also helps to remove all of the cells from the microcarrier beads and break up aggregates. Let beads settle for 30 sec by gravity. Pipette 10 μl media containing the detached cells from the microcentrifuge tube, avoiding taking up any microcarrier beads. Transfer this 10 μl to a hemocytometer, and determine the cell concentration. Note: Cell counts should be performed regularly (every 2 or 3 days) to ensure that cells are healthy. Cell density in the feeder flask should increase until max density (1 x 106 cells/ml) is reached and then remains constant. It is also possible to view the cells adhered to the beads under a microscope. If the cells appear to be dissociating from the beads or cell counts are suddenly dropping, it is probably because the media is not being replaced frequently enough. Infection of ARPE-19 cells on microcarrier beads in the bioreactor with TB40/E-IE2-EYFP (Figure 1C)Note: Our EYFP fusion tagged IE2 virus was used to track viral dissemination in epithelial cells within the bioreactor setting by eye using an inverted epi-fluorescent microscope.",
    "Once the cell concentration in the feeder flask reaches roughly 1 x 106 cells/ml, as measured through cell counts (Procedure B), transfer 250 ml of slurry to a smaller, siliconized, rinsed, and autoclaved 250 ml WHEATON spinner flask (referred herein as bioreactor). Continue maintaining cell growth in the feeder flask by replacing media (DMEM-F12 with 5% FBS) regularly (see step A13). Once roughly 1 x 106 cells/ml is reached, as measured through cell counts, transfer 250 ml of slurry to a smaller, siliconized and autoclaved 250 ml WHEATON spinner flask (bioreactor). Continue maintaining what remains in the feeder flask by replacing media regularly (refer to step C1). Inoculate the cells in the new bioreactor with TB40/E-IE2-EYFP at a multiplicity of infection, MOI, of 0.01 based on the viable cell counts and TCID50 of the virus stock. Place the bioreactor (250 ml) and the feeder flask (500 ml) on the same 4 position stir-plate set to 60 rpm within the 37 °C incubator.Monitor virus expansion by taking 200 μl aliquots from the stirred bioreactor, and visualizing EYFP spread through a fluorescent microscope. Expansion should also be monitored through regular TCID50. Note: The infected cells will fall off of the beads. Continuous high-titer viral production by maintenance of steady-state TB40/E IE2-EYFP infection (Figure 1D)Note: In order to maintain an ongoing CMV infection and avoid a crash of the infection, we need to regularly provide uninfected cells from the feeder flask, which newly produced viruses will then infect. Fresh media is also added to prevent cell death. The rate at which media and cells need to be replaced depends on the particular virus’s kinetics. For TB40/E IE2-EYFP, we determined that replacing media and cells every 48 h resulted in highest viral production over time.",
    "Maintaining as regular of a feeding schedule as possible is ideal for sustaining steady viral production. Additionally, maintaining healthy naïve cells in the feeder flask is essential for continued viral production. Media should be replaced, and the cell density should remain constant in this feeder flask (see step A13). Regular visual monitoring can follow the health of the infected culture in the bioreactor. When 80% of the cells are killed (and detach from the beads), which usually occurs at 5-7 days post infection, start regular feeding with cells and media as followed. Every 48 h, remove 37.5 ml (15% of total bioreactor volume) slurry from the infected bioreactor as it is stirred on a stir-plate in the biosafety cabinet. Transfer this slurry into a 50 ml conical tube, and centrifuge for 5 min at 300 x g (to removed non-adhered cells). Aliquot 3 supernatant samples of 500 μl (to be used for TCID50). Freeze the three aliquots and the 50 ml conical tubes of media at -80 °C to be used later (for step E2).Set aside an aliquot of 500 μl for TCID50 determination (for step E2) and freeze the rest at -80 °C for later. Removed the bioreactor from the stir-plate, and let beads settle for 5-10 min. Remove another 25 ml (10% of total bioreactor volume) of supernatant from the top of the infected bioreactor. Do not pipette the settled beads.From the uninfected feeder flask, pipette 37.5 ml of the slurry while spinning and transfer it to the infected bioreactor. Be sure not to cross contaminate your feeder flask.Pipette 25 ml DMEM-F12 with 5% FBS into the infected bioreactor. This media should have been warmed to 37 °C. Place both spinner flasks back onto the stir-plate in the incubator.",
    "Monitoring viral production in TB40/E IE2-EYFP infected bioreactor using TCID50 (Figure 2)Seed MRC-5 fibroblast cells in a 96-well flat-bottom plate by pipetting 100 μl per well of a cell suspension at 6,000 cells/ml. Incubate overnight at 37 °C to allow cell adhesion and growth. Take one aliquot of 500 μl of supernatant (prepared in step D2), and freeze-thaw 3 times by alternating incubation in a dry ice/isopropanol bath and, once frozen, transfer the tube to a 37 °C water bath to thaw. Make sure to vortex between each freeze-thaw. This step releases the virions that remain within the infected cells. Centrifuge 500 μl aliquot for 3 min at 300 x g. Add 1 ml DMEM with 10% FBS to 6 wells of a 12-well reagent reservoir.To the first well, pipette 110 μl of prepared viral supernatant into media. Using P1000, mix thoroughly while avoiding bubbles. The viral dilution in the first well is 1:10. Pipette 110 μl media from well #1 to well #2 to obtain 1:100 dilution of the viral preparation. Mix thoroughly using a P1000 Pipetman and avoid bubbles.Repeat serial dilutions of 1:10 through the remaining wells to reach in the last well a dilution of 1:1,000,000. Take prepared 96-well plate with adhered MRC-5 cells out of the incubator and aspirate media.Using a multichannel P200 pipette, transfer 100 μl of each serial dilution onto the MRC-% fibroblast plate. Repeat the transfer 12 times into successive rows to make sure that 8 wells of infected MRC-5 are being infected with each viral dilution. Place plate in a 37 °C incubator and monitor using fluorescent microscope over the next week. At day 7, score the eight wells within each dilution as either positive or negative for cytopathic effect. Calculate TCID50 using score (Reed Muench, 1938).",
    "TCID50 is the infectious virus titer at which pathological changes in 50% of inoculated cell cultures occur. This is determined by inoculating the series of diluted virus to susceptible cells. An Excel file from ResearchGate is a simple way to complete this calculation: https://www.researchgate.net/file.PostFileLoader.html?id=58dad730f7b67ea37125593f&assetKey=AS%3A476999471898624%401490736944531[href=https://www.researchgate.net/file.PostFileLoader.html?id=58dad730f7b67ea37125593f&assetKey=AS%3A476999471898624%401490736944531].imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171030/20171030020241_5311.jpgFigure 2. TB40/E IE2-EYFP virus infection can be reproducibly held at end-stage for long periods of time enabling high-titer TB40/E IE2-EYFP production. A. Adherent ARPE-19 cells infected at an MOI of 0.01 show a characteristic eclipse phase one day after infection, where the concentration of virus drops to low levels. By day two, the viral concentration begins to increase until reaching its peak end stage viral production by day 7. After this point, viral concentrations begin to decline when using static culturing methods, as there are no more cells to infect. This same viral kinetics curve is observed in the bioreactor setting. With this system, however, it is possible to maintain peak viral production stage by regular replacements of microcarrier beads coated with naïve ARPE-19 cells. B. We demonstrate that 100-times more TB40/E IE2-EYFP virus can be generated in comparison to the static culture plates in a three-week timeframe. Virus stocks taken at each time-point are cumulated, and compared with the average titration from collecting virus from one 15 cm cell culture dish, estimated at 7.5E6 total pfu per plate. This estimates how many 15 cm plates infected with TB40/E IE2-EYFP it would take to obtain the same concentration of virus as the cumulative samples collected from the bioreactor. Once steady state viral production is reached, and regular feedings begin, the number of plates it would take to reach the same total pfu increases quickly. On day 23 it would take 105 plates to have the same pfu/ml as the reactor system. C.",
    "To show reproducibility of the maintained end-stage infection, a bioreactor containing microcarrier beads coated with ARPE-19 was infected with TB40/E IE2-EYFP at an MOI of 0.01. Once peak viral production was reached, steady state was established and maintained. After a period of time, the infected bioreactor was split equally into 4 smaller 100 ml bioreactors, in which the steady states were maintained equivalently by regularly changing the same percentage of the slurry (15%) and of the supernatant (10%) as before the split. D. TCID50 titrations were completed using the supernatant samples from each 48 h time point of all four bioreactors. Each day’s results for the four bioreactors were averaged and standard deviations were determined. The results show that the maintained viral production state is reproducible. The longer the bioreactors are carried, the more consistent their viral production becomes.Preparing stocks of virus for use in other experimentsNote: Depending on your TCID50 results (determined from Procedure E), virus collected from the bioreactor during the regular feedings may be at a high enough concentration for certain experiments. If you require a higher concentration, however, standard ultracentrifugation using a sorbitol underlay can be performed. Supernatant and slurry samples need to be processed differently before use. Frozen supernatant samples (no microcarrier beads) simply need to be thawed and filtered. Slurry samples (frozen samples with microcarrier beads) require multiple freeze thaws to isolate the virus from within the cells. Supernatant samplesThaw frozen conical tube samples of virus from days that have been titered with TCID50 in a water bath. Supernatant samples can be used directly (prepared in step D7). Before using, however, filter media using a cell strainer to remove any remaining microcarrier beads. After, media should also be filtered using a 40 μm filter.",
    "Slurry samplesThaw frozen conical tube samples of virus from days that have been titered with TCID50 in a water bath.For slurry samples, centrifuge thawed conical tubes for 5 min and pipet off all media except for 5 ml that contain pelleted microcarrier beads. Media removed can be filtered and used as explained in step F2.Freeze thaw the remaining 5 ml of slurry in the conical tube 3 times by placing it in a dry ice/isopropanol bath and then transferring to a water bath once frozen. In between each freeze-thaw, vortex all samples. This step releases the virions that remain within the infected cells. Centrifuge 5 ml for 3 min at 300 x g.Remove remaining media from pellet, and pipette through cell strainer. This can now be used for infections or frozen for later.Optional: To concentrate the virus stock further, the protocol developed by Stinski et al. (1976) should be used. Briefly, on 23 ml viral preparation, underlay 7 ml of 20% sorbitol. After 1.5 h of centrifuge at 7,200 x g (20,000 rpm) at 18 °C, remove carefully the supernatant and resuspend the viral pellet in 2 ml of DMEM with no FBS."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}