{
  "id": 8626,
  "origin_website": "Jove",
  "title": "Using Near-infrared Fluorescence and High-resolution Scanning to Measure Protein Expression in the Rodent Brain",
  "procedures": [
    "The following protocol was approved by the Institutional Animal Care and Use Committee (IACUC) of the University of Delaware. Male Sprague Dawley rats approximately 55–75 days old were used for this protocol.\n1. Brain Extraction and Tissue Preparation\nAnesthetize rat with isoflurane in anesthesia induction chamber until rat no longer exhibits a response to foot pinch.\nSacrifice rats via rapid decapitation using a guillotine.\nCut skin on skull posterior to anterior and clear from top of skull.\nUse rongeurs to carefully remove the back part of skull, and then using small dissecting scissors cut down midline of skull, pushing upward against the top of skull at all times to avoid damaging the brain tissue.\nUse rongeurs to peel away right and left half of skull to expose the brain.\nUse a small spatula to scoop under brain and sever nerves, carefully elevate brain and freeze brains in isopentane chilled on dry ice (at least -20 °C). After this, store brains in a -80 °C freezer until slicing.\nSlice brains in regions of interest at 30–50 µm in a cryostat maintained between -9 °C and -12 °C. Directly mount slices onto glass slides and store in a -80 °C freezer until time of immunocytochemistry assay.\nNOTE: In this protocol brain regions of interest were the hippocampus and the amygdala.\n2. Single Immunohistochemical Reaction",
    "NOTE: For double immunohistochemical reaction, the protocol is the same as the single immunohistochemical reaction except this reaction has two primary antibodies of different hosts (e.g., rabbit and mouse) and two secondary antibodies for the corresponding primaries should be from a single host (e.g., goat antirabbit and goat antimouse). The secondary antibodies also have to be from two different spectra that are available in high-resolution scanners. For example, one secondary antibody with an emission spectrum peak at 680 nm and one secondary antibody 800CW (emission spectrum peak at 780 nm).\nRemove glass slides from the freezer and allow to equilibrate to room temperature for 30 min.\nUnder a fume hood, fix brain tissue in 4% paraformaldehyde in 0.1 M phosphate buffered saline (PBS) for 1−2 h at room temperature.\nRinse slides in 0.1 M tris buffered saline (TBS) three times for 10 min each. Permeabilize cell membranes by incubating slides in a mild detergent (e.g., 0.01% detergent) for 30−60 min.\nRinse slides in TBS three times for 15 min each.\nDilute primary antibody for protein of interest in PBS in the correct concentration. For example, to detect the immediate early gene c-Fos, prepare a rabbit primary anti c-Fos antibody in a concentration of 1:500.\nPipette primary antibody solution directly onto the brain tissue (approximately 200 µL per 3 inch x 1 inch slide).\nUse coverslips to incubate the brain tissue on glass slides in primary antibody dilution for either 1−2 h at room temperature or overnight (~17 h) at 4 °C.\nRemove coverslips and wash slides in TBS that has a small amount of detergent added to it (e.g., 0.01% detergent, \"TBS-T\") four times for 15 min each.\nUse coverslips to incubate brain sections in a secondary antibody at room temperature for 2 h.",
    "NOTE: The secondary antibody has to be to the correct dilution and in a diluent containing TBS, detergent, and 1.5% of host serum. For example, a goat secondary antibody in a dilution of 1:2,000 would contain 1.5% goat serum and 0.05% detergent.\nRinse slides in TBS-T four times for 20 min each, and then in TBS four times for 20 min each.\nDry slides at room temperature in the dark overnight. When slides are dry, they are ready for imaging.\n3. Imaging\nPlace slides onto the near-infrared scanning interface with the tissue facing down. Either image one glass slide or multiple slides at a time using a selection tool.\nImage slides using the highest quality setting with an offset of 0 nm and a resolution of 21 µm. The scanning will typically take 13−19 h depending on the scanning equipment used.\nImport images into the image analysis software (e.g., ImageStudio) to view and mark for semi-quantitative protein analysis.\n4. Protein Expression Analysis\nOpen the image analysis software and select the Work Area into which the image was scanned.\nOpen the scanned image in the image analysis software to view the scan, and adjust which wavelengths are viewed, as well as the contrast, brightness, and magnification shown without altering the raw image or the total quantified emission.\nIdentify the key regions for quantification and select the Analysis tab along the top of the page, then select Draw Rectangle (or Draw Ellipse/ Draw Freehand) to draw a rectangle over the area that will be quantified.\nTo view the size of the rectangle, select Shapes along the bottom left of the screen, then select Columns along bottom right. Add Height and Width columns to identify the shape size.",
    "NOTE: It is important to control for shape size when comparing quantification. It is recommended to use identical shapes placed within the desired quantification location, in order to get an accurate sampling of the emissions for that region.\nThen name the shape and repeat. Once all regions are sampled the data available from the columns tab can be aggregated and analyzed.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}