{
  "id": 8580,
  "origin_website": "Jove",
  "title": "Analysis of AtHIRD11 Intrinsic Disorder and Binding Towards Metal Ions by Capillary Gel Electrophoresis and Affinity Capillary Electrophoresis",
  "procedures": [
    "1. Preparation of the Capillary Electrophoresis Instruments\nPrepare the capillaries\nUse a glass cutter to cut a bare-fused silica capillary with a polyimide external coating and an inner diameter of 50 µm into 33 cm (for the CGE experiment) and 30 cm (for the ACE experiment) long capillaries. Perform the cutting on a glass plate.\n\t\tNote: The 2 different experimental setups were developed for 2 different instruments. In order to use them on other instruments, a proper method transfer has to be performed and the capillary length has to be adjusted to the allowed length of the instrument.\nUse a pen to mark the middle of a 1-cm wide detection window at a distance of 24.5 cm from one end of the capillary for the CGE experiment and at 21.5 cm from one end of the capillary for the ACE experiment (effective length).\nRemove the polyimide external coating from the capillaries by burning it off with a blowtorch, 0.5 cm before and after the mark. Similarly, use the blowtorch to remove 1 cm of the coating at both ends of the capillaries.\n\t\tNote: The effective length may vary slightly since it relies on the capillary electrophoresis instrument used.\nClean the ends of the capillaries and the detection windows with ethanol and a soft tissue.\n\t\tNote: The uncoated capillaries are less flexible and likely to break.\nInstall the capillaries\nInstall a capillary into the CE system with the detection window near the outlet.\n\t\tNOTE: The various CE instrument models have different holding systems for the capillaries. Refer to the manual of the used instrument for the exact instructions.\n2. Prepare the Solutions\nPrepare the solutions for the CGE analysis\nPrepare the tris(hydroxymethyl)aminomethane (Tris)-SDS buffer (100 mM/1% w/v) at pH 8.0.",
    "Use a respiratory mask and a booth for weighing 1.00 g of sodium dodecyl sulfate (SDS) in a 100-mL beaker.\nAdd 1.21 g of Tris into the 100 mL beaker and dissolve it using 50 mL of deionized water and a magnetic stir bar on a magnetic stirrer.\nPut a pH electrode in the solution and adjust the pH to 8.0 using 1.0 M HCl.\nFill the solution into a 100 mL volumetric flask and add deionized water up to the mark. Shake it gently to avoid any foam forming.\nPrepare the 0.1 M NaOH solution.\n\t\t\nWeigh 4.0 g of NaOH in a 100 mL volumetric flask. Fill it up to the mark with deionized water to make a 1 M stock.\nUse a 10 mL bulb pipette to transfer 10 mL of this solution into another 100 mL volumetric flask and fill it up to the mark with deionized water.\nPrepare the 0.1 M HCl solution.\n\t\t\nPut 10 mL of 10 M HCl into a 100 mL volumetric flask using a 10 mL volumetric pipette and fill it up to the mark with deionized water. Repeat this step to obtain the 0.1 M HCl.\nPrepare the sample solution.\n\t\t\nWeigh 0.5 mg of the protein into a 1 mL tube. Add 0.5 mL of the Tris-SDS gel buffer from step 2.1.1 with a micropipette.\nDissolve the protein by shaking gently to avoid any foam forming and degradation of the protein.\n\t\t\tNOTE: Use ultrasonication if the protein cannot be dissolved as described; avoid any heating of the solution.\nFill the solutions into the vials.\n\t\t\nFilter each solution through a 0.22 µm polyvinylidene fluoride (PVDF) filter using an adequate syringe directly into the vial.\n\t\t\tNOTE: For the gel-containing solutions, the back pressure can be high due to its high viscosity.",
    "Prepare 15 vials in total and mark each to avoid any mix-ups.\n\t\t\t\nFill 3 vials with a commercially available sodium dodecyl sulfate (SDS) gel buffer at pH 8.\n\t\t\t\tNOTE: The use of a commercially available SDS gel buffer provides more precise results.\nFill 1 vial with 0.1 M NaOH and 1 vial with 0.1 M HCl for flushing.\nFill 1 vial with the sample solution.\nFill 5 vials with deionized water and 4 vials with 0.1 mL of deionized water (dipping vials).\n\t\t\t\tNOTE: The dipping vials are used as waste vials during the flushing of the capillary before each run. The capillary ends are dipped in water in order to rinse off any gel residues.\nPrepare the solutions for the ACE analysis\nPrepare the 1 M NaOH solution.\n\t\t\nWeigh 4.0 g of NaOH in a 100 mL volumetric flask.\nFill it up to the mark with deionized water to make a 1 M stock.\nPrepare the 0.1 M ethylendiaminetetraacetic acid (EDTA) in a 0.1 M NaOH solution.\n\t\t\nTransfer 10 mL of 0.1 M NaOH in a 100 mL volumetric flask using a 10 mL bulb pipette. Fill it up to the mark with deionized water.\nWeigh 2.42 g of EDTA on a weighing boat and dissolve the solid compound in the 100 mL of 0.1 M NaOH.\nPrepare the Tris buffer (30 mM) solution.\n\t\t\nAdd 3.63 g of Tris, 200 mL of deionized water, and a stir bar in a 500 mL beaker. Place the beaker on a stir plate and switch it on.\nPut a pH meter electrode in the beaker and adjust the pH to 7.4 using 0.1 M HCl.\nFill the solution in a 1 L volumetric flask and fill up to the mark with deionized water.",
    "NOTE: This procedure has to be repeated or a bigger volumetric flask is needed since more than 1 L is needed for the whole analysis.\nPrepare the acetanilide electroosmotic flow (EOF)-marker (60 µM) solution.\n\t\t\nAdd 6 mg of acetanilide and 100 mL of Tris buffer in a 100 mL volumetric flask.\nPut the volumetric flask in an ultrasonic bath and switch it on for 30 min.\nPrepare the sample (1 mg/mL) solution.\n\t\t\nPut a 0.5 mL microcentrifuge tube on a precision balance and add 0.3 mg of freeze-dried AtHIRD11 powder into the tube.\nUse a micropipette to add 0.3 mL of a 30 mM Tris buffer (pH 7.4) in the tube. Shake the tube carefully to dissolve the protein.\nPrepare the ligand solutions.\n\t\t\nPrepare the CaCl2 (5 mM) stock solution.\n\t\t\t\nTake a weighing boat, put it on an analytical balance and weigh 36.76 mg of CaCl2*H2O.\nUsing a micropipette, flush the CaCl2*H2O from the weighing boat into a 50 mL volumetric flask with the previously prepared Tris buffer.\nFill the volumetric flask with the Tris buffer up to the mark.\nPrepare the remaining stock solutions (5 mM).\n\t\t\t\nRepeat step 2.2.6.1 using the other metal salts instead of CaCl2*H2O [MgCl2: 23.80 mg, BaCl2: 26.02 mg, Sr(NO3)2: 52.91 mg, MnCl2: 31.46 mg, SeCl4: 52.91 mg, CoCl2*2H2O: 41.47 mg, CuCl2*2H2O: 42.62 mg, ZnCl2: 3.41 mg, and NiCl2*6H2O: 59.43 mg].\n\t\t\t\tNOTE: The ZnCl2 solution has a concentration of 0.5 mM. Since strong interactions between the ions and the inner capillary wall were observed, the concentration was reduced by a factor of 104.\nPrepare the 500 µM CaCl2 solution.\n\t\t\t\nFill 10 mL of the CaCl2 stock solution and put it in a 100 mL volumetric flask.\nFill the volumetric flask with a Tris buffer to the mark and shake the flask.",
    "Prepare the 250 µM CaCl2 solution.\n\t\t\t\nFill 5 mL of the CaCl2 stock solution and put it in a 100 mL volumetric flask.\nFill the volumetric flask with a Tris buffer to the mark and shake the flask.\nRepeat steps 2.2.6.3 and 2.2.6.4 for the other stock solutions.\nFill the solutions in the vials.\n\t\tNOTE: Every repeated run needs a set of inlet and outlet vials. The use of fresh ligand solutions at the inlet and outlet reduces the shifts in migration time after each run.\n\t\t\nFill the 250 µM CaCl2 solution in a 10 mL syringe.\nPut a 0.22 µm PVDF filter on the syringe and push 2 mL of the solution through the filter using the syringe in order to discard this filtered solution.\nFill 10 vials up to the maximum allowed volume with the remaining 250 µM CaCl2 solution of the syringe. Mark each as 250 µM CaCl 2 solution inlet vial.\nFill 10 vials until they are half-filled with the 250 µM CaCl2 solution. Mark each as 250 µM CaCl 2 solution outlet vial.\nRepeat steps 2.2.7.1 - 2.2.7.4 for the other metal salt-containing solutions.\nRepeat the steps for every pair of inlet and outlet vials using the 30 mM Tris buffer (pH 7.4) solution instead.\n\t\t\tNote: The 30 mmol/L Tris buffer pH 7.4 is used in between the runs in order to obtain migration time data for the protein in absence of metal ions. It is necessary in order to neglect changes in the EOF.\nRepeat the above steps for one vial using the acetanilide EOF-marker (60 µM) solution instead. Also, repeat these steps using the sample (1 mg/mL) solution instead.\n3. Capillary Gel Electrophoretic Separation\nNote: Prepare the separation according to the method described in previous work by Nachbar et al.4.\nPrepare the analysis",
    "Condition the capillary\nSet the thermostat to 23 °C.\nFlush the capillary for 10 min at 2.5 bar with 0.1 M NaOH.\nFlush the capillary for 5 min at 2.0 bar with 0.1 M HCl.\nFlush the capillary for 2 min at 2.0 bar with deionized water.\nFill in the SDS gel buffer\nFill a capillary for 10 min at 2.0 bar with the commercially available SDS gel buffer at pH 8.0.\nFlush the capillary before each separation run\nFlush the capillary for 3 min at 4.0 bar with 0.1 M NaOH.\nFlush the capillary for 1 min at 4.0 bar with 0.1 M HCl.\nFlush the capillary for 1 min at 4.0 bar with deionized water.\nFlush the capillary for 10 min at 4.0 bar with the SDS gel buffer.\nRun the separation\nInject the sample solution for the CGE experiments (step 2.1.4) hydrodynamically by applying 0.1 bar for 4 min at the inlet.\nApply -16.5 kV and a pressure of 2.0 bar at both ends of the capillary for 25 min.\n4. Affinity Capillary Electrophoretic Analysis\nNote: Prepare the separation according to the method described in previous works by Nachbar et al.4 and Alhazmi et al.5.\nCondition the capillary\nSet the thermostat to 23 °C.\n\t\tNOTE: The temperature is used according to published protocols and can be changed to other temperatures4,5. However, the interactions are dependent on the temperature and will change accordingly.\nFlush a capillary for 40 min at 2.5 bar with 0.1 M NaOH.\nFlush the capillary for 10 min at 1.0 bar with deionized water.\nFlush the capillary for 30 min at 1.0 bar with a 30 mM Tris buffer (pH 7.4).\nPreparation for the ACE methods\nPrepare the method for the measurements without ligands.",
    "Note: Acetanilide was not added to the sample solution, as it disguises 2 protein peaks.\n\t\t\nRinse the capillary for 1 min at 2.5 bar with a 0.1 M EDTA solution.\nRinse the capillary for 1 min at 2.5 bar with deionized water.\nRinse the capillary for 1.5 min at 2.5 bar with a Tris buffer for equilibration.\nInject the acetanilide solution for 6 s at 0.05 bar and change the inlet and outlet vials to the Tris buffer vials.\nApply 0.05 bar for 2.4 s in order to push the acetanilide solution from the tip of the capillary further inside.\nApply 10.0 kV for 6 min and detect the acetanilide peak at a wavelength of 200 nm.\nRepeat steps 4.2.1.1. - 4.2.1.6. using the protein sample instead of the acetanilide solution and detect all the protein peaks.\nPrepare the method for the measurements with ligands.\n\t\t\nRinse the capillary for 1 min at 2.5 bar with a 0.1 M EDTA solution.\nRinse the capillary for 1 min at 2.5 bar with deionized water.\nRinse the capillary for 1.5 min at 2.5 bar with the ligand solution for equilibration.\nInject the acetanilide solution for 6 s at 0.05 bar and change the inlet and outlet vials to the ligand-containing buffer vials.\nApply 0.05 bar for 2.4 s in order to push the acetanilide solution from the tip of the capillary further inside.\nApply 10.0 kV for 6 min and detect the acetanilide peak at a wavelength of 200 nm.\nRepeat steps 4.2.2.1 - 4.2.2.6 using the protein sample instead of the acetanilide solution and detect all the protein peaks.\nAlternately repeat steps 4.2.1 and 4.2.2 in order to calculate the change in the charge-size ratios for the various protein-metal ion interactions (described under Representative Results).",
    "Change the protein solution after every 60 h to a fresh one.\n\t\t\tNOTE: At this point, the experiment can be paused. This procedure is at least repeated 10x for each concentration of the ligands since the peak pattern varies slightly from run to run. If the solution is used longer than 60 h, the variations become too large.\nRun the methods\nRun the method described under step 4.2.2, using the alkaline earth ligand solutions (CaCl2, MgCl2, BaCl2, and SrCl2 solutions).\nContinue using the method described under step 4.2.2, using the MnCl2, SeCl4, CoCl2, CuCl2, ZnCl2, and NiCl2 solutions instead of the alkaline earth ligand solutions.\n\t\t\tNOTE: The latter transition metal chlorides showed stronger interactions with the capillary and cannot be removed completely. These interactions result in shifts in the migration time from run to run. Consequently, they were investigated after the other metal ions.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}