{
  "id": 7846,
  "origin_website": "Bio",
  "title": "Modified Pseudo-Schiff Propidium Iodide for Staining the Shoot Apical Meristem in <em>Arabidopsis</em>",
  "procedures": [
    "Arabidopsis seedlings growth Soak the Arabidopsis seeds with 1 mL of ddH2O in a 1.5 mL centrifuge tube and place the tube at room temperature for 1 h.Pour out all the liquid and sterilize the Arabidopsis seeds with 15% sodium hypochlorite solution. Shake the tube by hand and let it soak thoroughly for 10 min.On a sterile clean bench, pour out the sodium hypochlorite solution from the tube and wash the seeds 3–5 times with 1 mL of sterile ddH2O. Then, place the seeds at 4 °C for three days to break dormancy.On a sterile clean bench, place the seeds onto round culture dishes with solid MS medium (see Recipes), and seal plates with micropore tape. Preparing 50 seedlings per condition is recommended for subsequent experiments.Place the solid MS medium plate in the growth chamber under 16 h/22 °C light and 8 h/18 °C darkness for nine days (or any desired growth conditions). Use 9-day-old seedlings for subsequent experiments.SAM dissection Using a single edge blade, cut the cotyledons and root to separate the other tissue from the shoot and leave the hypocotyl connected to the shoot tips (Figure 1A and 1B).Add 30 shoot tips to the centrifuge tube containing freshly prepared fixative solution (see Recipes) and leave at 4 °C overnight (Figure 1C).Pour out the fixative solution and wash the shoot tips with ddH2O twice.Pour out the water and add 30% ethanol solution for 15 min. Repeat this step with 50%, 70%, 80%, 90%, 95%, and 100% ethanol series (see Recipes).Note: At this dehydrated stage, the shoot tips will turn white from the ethanol treatment (Figure 1D). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4672/bioprotoc-13-09-4672-g001.jpgFigure 1. Preparation of shoot tips. A. Dissecting microscope images of the 9-day-old plant. Scale bar: 1,000 μm. B. Dissecting microscope images of the shoot tips with hypocotyl. Scale bar: 1,000 μm.",
    "White dashed lines mark the base of petiole. Cut the cotyledons and root along the dashed lines using a single edge blade. C. Centrifuge tube containing shoot tips (green) in fixative solution. D. Centrifuge tube containing shoot tips (white) in 100% ethanol.Transfer the shoot tips to new 100% ethanol overnight at room temperature.Note: At this stage, you can keep the shoot tips in ethanol at -20 °C for several weeks. Transfer the shoot tips to the 60 mm round culture dishes with 100% ethanol and place the culture dishes under the dissecting microscope (Figure 2A). Then, grip the hypocotyl with tweezers (Figure 2B) and remove the tiny true leaves from the shoot tip using a syringe needle under the dissecting microscope (Figure 2C–2E). Subsequently, transfer the shoot tips to the 1.5 mL centrifuge tube with 100% ethanol.Note: This sample is very small and easily broken; be sure to gently wash the sample with solution in the subsequent experiment. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4672/bioprotoc-13-09-4672-g002.jpgFigure 2. Dissection of shoot tips. A. Round culture dish containing shoot tips in 100% ethanol. B. Dissection of shoot tips using a syringe needle or tweezers under the dissecting microscope. C. Dissecting microscope images of the shoot tips before dissection. The arrow indicates the hypocotyl; white dashed lines mark the base of petiole. Scale bar: 500 μm. D. Images of the shoot tips from the top before dissection. White dashed lines mark the base of petiole. Scale bar: 500 μm. Grip the hypocotyl of shoot tips with tweezers and remove the leaves along the dashed line using a syringe needle or tweezers. E. Dissecting microscope images of the shoot tips after dissection. Scale bar: 500 μm.Staining of SAM Remove the 100% ethanol carefully and add 95% ethanol solution for 15 min.",
    "Repeat this step with 90%, 80%, 70%, 50%, 30%, and 15% ethanol series and ddH2O. Then, wash the shoot tips with ddH2O once.Remove the water carefully and add 1 mL of 1% periodic acid solution (see Recipes) for 40 min. Then, wash the shoot tips with ddH2O twice.Remove the water carefully and add 1 mL of pseudo-Schiff propidium iodide solution (see Recipes) for 2 h. Wrap the centrifuge tube with aluminum foil to protect the shoot tips from light.Note: At this stage, the shoot tips will turn pink from the pseudo-Schiff propidium iodide solution. Protect the shoot tips from direct light in subsequent experiments (Figure 3A). Carefully remove the pseudo-Schiff propidium iodide solution and wash the shoot tips with ddH2O twice.Note: Because propidium iodide is toxic, discarded pseudo-Schiff propidium iodide solution requires a special waste container. Transfer the shoot tips to the microscope slide and blot dry the liquid around the sample with qualitative filter paper. Then, drop 10–20 μL of chloral hydrate solution (see Recipes) and leave for 20–30 min at room temperature, away from light (Figure 3C).Note: At this stage, the shoot tips will become transparent from chloral hydrate solution treatment (Figure 3B). Remove the chloral hydrate solution with qualitative filter paper and drop 100 μL of Hoyer′s solution (see Recipes) to cover the shoot tips. Then, carefully lay down a microscope cover glass, avoiding air bubbles (Figure 3D).Place the slides for three days at room temperature away from light. You can keep the slides at room temperature for several weeks.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4672/bioprotoc-13-09-4672-g003.jpgFigure 3. Staining of shoot tips. A. Centrifuge tube containing shoot tips in pseudo-Schiff propidium iodide solution. The shoot tips are pink. B. Dissecting microscope images of the shoot tips during chloral hydrate solution treatment. Scale bar: 500 μm. C.",
    "Microscope slide with shoot tips in chloral hydrate solution. The arrow indicates the shoot tip. D. Microscope slide with shoot tips in Hoyer′s solution. The arrow indicates the shoot tip.Imaging of SAM Observe the shoot tips under a Zeiss 780 laser scanning confocal microscope with a microscope objective (Plan-apochromat 40×/1.3 Oil DIC M27).Set channel parameters as: excitation wavelength 514 nm; emission wavelength 566–658 nm; intensity of laser approximately 20%.Set the zoom 5× to magnify the image; resolution is 1,024 × 1,024. Set speed of scanning parameter as 7. Observe and image the different cell layers in the whole SAM by adjusting the z-axis. If you want a layer of cells, set the scan mode to x-y recording; if you want images of a complete SAM, set the scan mode to z-stack collection. In the x, y, z collection mode, set the parameter “line averaging” to achieve nice quality. In the central layer of SAM (Z10), you can observe typical three-layer cells (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4672/bioprotoc-13-09-4672-g004.jpgFigure 4. Imaging of shoot tips. Series of SAM images with different z-axis obtained using a laser scanning confocal microscope. The arrow indicates the SAM; P indicates the leaf primordia; Z indicates different z-axis; white dashed lines in Z10 mark the cell layers. Scale bar: 50 μm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Developmental Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}