{
  "id": 4631,
  "origin_website": "Bio",
  "title": "A Gas Chromatography-Mass Spectrometry-Based Two Stage Assay for Measurement of <em>in vitro</em> myo-Inositol 3-phosphate Synthase (INO1) Activity",
  "procedures": [
    "Note: An overview of the whole procedure can be seen in the accompanying figure.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150302/20150302181103_5461.jpgFigure 1. Inositol 3-phosphate synthase assay: overview Generation of 13C-glucose 6-phosphate13C-glucose 6-phosphate is generated by incubation of [300 µM]final 13C-U-glucose with [66 µg ml-1]final hexokinase in assay buffer at 37 °C for 10 min, followed by boiling for 10 min in order to denature the hexose kinase. The tubes are then transferred to ice.Note: We always produced the 13C-glucose 6-phosphate in bulk – enough for all reactions in the experiment. We reconstituted lyophilised hexokinase powder (>130 U/mg) in water at 10 mg/ml. This was added to the assay buffer at 6.8 per 1 ml assay buffer, to give a concentration of 68 μg/ml. A stock of 10 mM 13C-U-glucose was made (in water) and was added to the hexokinase/assay buffer at 30 μl per 1 ml, to give a final concentration of 300 μM 13C-U-glucose and 66 μg/ml hexokinase. Unused reaction products were stored at -80 °C for future use.Efficiency of this conversion is usually ~100% and can be assessed by standard gas chromatography-mass spectrometry (GC-MS) protocols for sugar/sugar-phosphate analysis [see below, MacRae et al. (2014) and Saunders et al. (2011) for details].Generation of cell lysates and INO1 assayLysates of your cells of choice are prepared by suspending washed cell pellets (with >10 pellet volumes of ice-cold PBS, two times) in ice-cold lysis buffer for 10 min. Notes: When measuring INO1 activity in Plasmodium falciparum-infected red blood cells, cells were suspended at a concentration of 109 cells per ml buffer (as determined by cell counting at the point of the second PBS wash). However, the volume of the suspension buffer may need to be varied depending on total cell number available and in vivo activity of INO1.",
    "The lysate should be checked (by light microscopy) to confirm successful lysis, some agitation (by either brief vortexing or sonication may be required). Aliquots of 13C-glucose 6-phosphate substrate (50 µl) and cell lysate (50 µl) are combined, vortex mixed briefly (<1 sec), incubated in a water bath at 37 °C, and the reaction stopped at required time-points by boiling for 5 min. The tubes are then transferred to ice.Note: In our experiments, we found that maximal labelling was achieved after ~3 h, although we also included later time points. A typical experiment would include 0, 0.5, 1, 5, 10, 30, 60, 120, 180, and 240 min, and an additional ‘overnight’ time point, if required.Reaction solutions are then centrifuged at 16,100 x g and 4 °C for 5 min (to pellet cellular debris) and the supernatant (containing reaction products) transferred to a fresh 1.5 ml tube. Polar products are recovered by solvent extraction of 50 µl of the boiled assay mixture, following addition of chloroform (50 µl), methanol (150 µl), and MilliQ water (100 µl, containing 1 nmol sI as an internal standard), resulting in a final solvent ratio of chloroform/methanol/water (1:3:3 v/v/v). After vigorous vortex mixing (30 sec) and centrifugation at 16,100 x g and 4 °C for 5 min, this mixture results in two phases, a lower chloroform phase (~50 µl) and an upper methanol/water phase (~300 µl).Analysis of 13C-glucose 6-phosphate and the synthesised 13C-myo-inositol 3-phosphate can be easily quantified by GC-MS, by comparison to authentic standards, as described below and in MacRae et al. (2014) and Saunders et al. (2011).Sample preparation for gas chromatography-mass spectrometry (GC-MS)An aliquot of the upper polar phase (100 µl) is transferred to a GC-MS vial insert (placed in a 1.5 ml microfuge tube) and dried in a rotary vacuum concentrator (RVC).",
    "Once dry, an additional 100 µl of the polar phase is added to the insert and dried. This process is repeated until almost all of the upper phase has been transferred and dried.Note: Be careful not to transfer any of the lipid-rich lower phase or the protein-rich interphase - it is advised to leave a few µl of the polar phase in the portioning tube rather than risk accidental transfer of the interphase and lower phase. Any minor differences in volume transferred are corrected later by normalisation to the internal standard (sI). To ensure all water is displaced from the dried polar phase, 40 µl of methanol is added and dried in the RVC, followed by an additional 40 µl methanol and subsequent drying.The vial inserts are transferred to 2 ml glass vials with forceps, being careful not to touch the rim of the insert. Polar metabolites are methoximated by addition of a freshly prepared solution of 20 mg/ml methoxyamine in pyridine (20 µl, this should be prepared when required, i. e. while the second aliquot of methanol is being dried). The vials are capped, vortexed briefly (~5 sec) and incubated at RT for >16 h. The caps are removed and methoximated samples derivatised by addition of 20 µl of BSTFA + 1% TMCS, a reagent that results in trimethylsilyl (TMS) substitutions on the relevant metabolites, allowing them to be observable by GC-MS. The vials are re-capped, vortexed briefly and incubated at RT for >1 h before injection onto the GC-MS.Gas chromatography-mass spectrometry (GC-MS)Derivatised samples are analyzed using a DB-5MS + DG column in splitless mode (injection temperature 270 °C), or equivalent, using ultra high purity helium as the carrier gas. The initial oven temperature is 70 °C (2 min), followed by temperature gradients to 295 °C at 12.",
    "5 °C/min, and from 295 °C to 320 °C at 25 °C/min. The final temperature is held for 3 min. Data analysis can be performed using brand-specific specific or non-brand-specific software (e.g. AnalyzerPro, Amdis, mzMatch, mzMine, etc.). We used the accompanying ChemStation software. Metabolites are identified by comparison of retention times and ion fragmentation patterns with authentic standards. Quantification of metabolites is calculated using the formula: amount metabolite (nmol) = (area of appropriate metabolite peaks/area of sI peak) x (1 nmol sI/metaboliteMRRFsI); where metaboliteMRRFsI is the molar relative response factor determined from the mean value of: area of appropriate metabolite peak/area of sI peak (1:1 standards). Notes: The ‘appropriate peaks’ are the extracted ion chromatogram (EIC) peaks of appropriate unlabelled and labelled ions for each metabolite (see below). The level of labelling is estimated as the percent of the metabolite pool containing one or more 13C atoms, after background subtraction for naturally occurring isotopes (as calculated from an unlabelled standard), as described in Zamboni et al. (2009). Ions used for quantification and label incorporation calculations:scyllo-Inositol (sI, internal standard): M0 = m/z 318myo-Inositol 3-phosphate: M0-M4 = m/z 318-322Glucose: M0-M4 = m/z 319-323Glucose 6-phosphate: M0-M2 = m/z 357-359Note: M0 represents the unlabelled ion (where all carbon is 12C), Mn represents ions with n 13C-atoms."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}