{
  "id": 17509,
  "origin_website": "Jove",
  "title": "DUCT: Double Resin Casting followed by Micro-Computed Tomography for 3D Liver Analysis",
  "procedures": [
    "The protocol described in this study was approved and follows the animal welfare rules and regulations of the Stockholms Norra Djurförsöksetiska nämnd (Stockholm animal research ethics board). The animals used in this study were wild type or homozygous Jag1H268Q mutant mice on a mixed C3H/N and C57bl6J background. Both males and females were included in the study. The animals were used at postnatal day 15 or as adults between 3 - 8 months.\n1. Double resin injections\nPreparation\n\t\nPrepare resin solution. For double system resin injections, prepare both yellow and green resins as described in the steps 1.1.2-1.1.4.\nPrepare 1 mL aliquots of diluted resin per mouse.\nYellow Resin: Dilute yellow silicone rubber (high radiopacity) with the clear diluent in a 3:1 dilution to prepare yellow resin for injection.\nGreen Resin: Mix blue silicone rubber (undetectable radiopacity) with the clear diluent in a 1:1 dilution to prepare blue resin. To generate green resin, mix the diluted blue resin with the diluted yellow resin at a ratio of 1:1. Vortex the green resin thoroughly until the color is homogeneous.\n\t\tNOTE: Blue resin has very low radiopacity that is not detectable with microCT, which therefore necessitates dilution with yellow resin to create two resins with different radiopacities.\n\t\tCAUTION: Resin may contain lead chromate, which is a carcinogen. It produces poisonous gases in a fire. Handle with care and dispose of the resin as hazardous waste.\nPrepare two injection sets (injection set #1 and injection set #2) with tubing as described in the steps 1.1.6-1.1.11.",
    "NOTE: For adult mice (>P30 (postnatal day 30) = P30 - 2 years), use injection set #1 (PE10 tubing with 0.6 mm outer diameter) for common bile duct injection and injection set #2 (PE50 tubing with 0.96 mm outer diameter) for portal vein injection. For young postnatal mice (up to P30), prepare two #1 injection sets, one for bile duct and one for portal vein injection (no injection set #2 as the portal vein is too narrow to accommodate PE50 tubing).\nTo prepare injection set #1, cut 30 cm of PE10 tubing and stretch one end of the tubing by hand by pulling it until it becomes as thin as possible (Figure 1A,B, approximately 0.15 mm diameter, non-stretched PE10 tubing is 0.6 mm diameter).\nCut the tip of the stretched PE10 tubing diagonally to create a beveled tip (Figure 1B).\nConnect the non-stretched end of the PE10 tubing to a 30 G needle (Figure 1A, Injection set #1).\nTo prepare injection set #2, cut 30 cm of PE50 tubing and stretch one end of the tubing by hand by pulling it until it becomes thin enough to fit into the portal vein (Figure 1A,B, approximately 0.7 mm, non-stretched PE50 tubing is 0.96 mm diameter).\nCut the tip of the stretched PE50 tubing diagonally to create a beveled tip (Figure 1B).\nConnect the non-stretched end of the PE50 tubing to a 23 G needle (Figure 1A, injection set #2).",
    "NOTE: Each injection set can only be used for one injection since the resin will harden in the syringe and tubing. Adjust the size of the stretched and beveled tip based on the size of the common bile duct and portal vein of the mouse, depending on its age, genotype, and phenotype. When unsure about the size and fit of the tubing, insert the tubing in the appropriate duct or vessel after the incision and before the tubing is filled with resin. If the tubing is too wide to fit in the duct/vessel, stretch it further.\nAnesthetize the animal by isoflurane inhalation (first 4% in the induction chamber and ~2% using the nose cone).\nPlace the mouse on a ventilated bench on a dissection pad while the mouse is breathing isoflurane through the nose cone. Verify that the animal is unconscious by an institute/IRB-recommended method, e.g., by pinching one of the paws.\n\t\tCAUTION: Isoflurane may cause drowsiness or dizziness upon inhalation and may cause damage to the cardiovascular system and central nervous system through prolonged or repeated exposure. Do not inhale it. Handle the substance on a ventilated bench and in well-ventilated areas.\n\t\tNOTE: It is possible to use another anesthetizing method, as long as it is compatible with cardiac perfusion.\nOnce the animal is unconscious, spray the ventral side with 70% ethanol to prevent interference from fur.\nUsing skin scissors, cut the skin, fascia, and muscle layer starting at the midline of the abdominal cavity and cut through to the thoracic cavity to expose the internal organs.\nGrab the xiphoid process with forceps to lift the sternum and cut the diaphragm and rib cage on both sides to expose the heart and lungs.",
    "Remove the rib cage by cutting through the ribs on the left and right sides of the ribcage with scissors. Take extra care not to damage the liver as this will result in leakage of the resin.\nUsing straight forceps, pull the heart towards the liver and cut away the right atrium.\nInsert a butterfly needle (23 G), connected to a peristaltic perfusion pump, into the left ventricle. Perfuse the mouse transcardially with Hanks balanced salt solution (HBSS) and heparin (1 U/g of mouse body weight). Perfuse for 3 min with a perfusion rate of 5 mL/min.\n\t\tNOTE: If the mouse is being perfused correctly, the internal organs will become pale, especially the liver. If, instead, the lungs are turning white, the needle is inserted into the right ventricle and should be repositioned. After perfusion, the mouse is exsanguinated and can be removed from the nose cone and isoflurane.\nTurn off the isoflurane pump.\nResin injection - Biliary system resin casting\n\t\nMove the mouse to the dissection microscope, abdomen up, tail towards the experimenter, and head away from the experimenter. The anatomical landmarks of interest are depicted in Figure 2A.\nLocate the inferior vena cava (Figure 2A) by moving the intestine to the side. Use spring scissors to make a small transversal incision in the inferior vena cava to allow the release of hepatic vascular pressure (Figure 2Bi).\nExpose the common bile duct and portal vein as described in steps 1.2.4- 1.2.6.\nMove the intestine and pancreas to the right side (of the experimenter) using a phosphate-buffered saline (PBS)-wetted cotton swab.\nFlip the ventral side of the liver towards the heart using the PBS-wetted cotton swab to expose the visceral surface and the hilar region.",
    "Locate the common bile duct that runs from the hilar region across the pancreas and into the intestine at the sphincter of Oddi (Figure 2Bii, common bile duct outlined with the yellow dotted line, black arrowheads point to Sphincter of Oddi).\n\t\tNOTE: Make sure the liver is moist throughout the procedure by sprinkling it with PBS.\nClear surrounding tissue (area ~ 5 mm) from the common bile duct using straight forceps. Place silk suture thread (size 4-0, 0.17 mm, 3 - 5 cm long) under the common bile duct (Figure 2Bii) and tie a loose overhand knot around the common bile duct (Figure 2Biii).\n\t\tNOTE: Choose an area for the knot halfway between the hilar region and the sphincter of Oddi and at some distance from the portal vein so that after the suture is tightened around the common bile duct, it will not interfere with the portal vein injection.\nHold the spring scissors flat against the common bile duct to make an oblique incision to the common bile duct at the spot where the common bile duct enters the pancreas and intestine next to the sphincter of Oddi. (Figure 2Biv), yellow dotted line outlines the sphincter of Oddi region, emphasized by black arrowheads).\n\t\tNOTE: This is a crucial step. Make an oblique and not a transversal cut, and make an incision; do not sever the bile duct. Cutting through the entire bile duct makes insertion of the tubing very challenging.\nJust before use, mix 1 mL of the yellow resin with 50 µL of the curing agent (by filling and emptying the 1 mL syringe) and fill a 1 mL Luer syringe with the resin - curing agent mixture.",
    "Connect the filled syringe with the tubing (set #1). Press the plunger to fill the tubing completely. Ensure that the resin/curing agent mix drips from the tip of the tubing.\n\t\tNOTE: Avoid and remove bubbles in the syringe and tubing for best results.\nUsing forceps, straighten the area around the common bile duct incision and insert the tubing into the opening in the common bile duct (Figure 2Bv), with the longest edge of the beveled tip downwards towards the dorsal side of the bile duct. This orientation ensures that resin can exit the tubing opening, which is facing upwards, into the duct (Figure 2Bv).\nTighten the silk thread knot to secure the tubing inside the common bile duct (Figure 2Bvi).\nInject the resin into the common bile duct. Observe the gall bladder and the individual liver lobes.\nMassage the liver with a PBS-wetted cotton swab to help spread the resin equally. Resin-filled bile ducts' terminal branches (in wild-type mice) are faintly visible at the liver surface.\n\t\tNOTE: Expected time to fill the liver is 30 -100 s.\nStop injecting the resin when dots of resin appear at the surface of the liver (Figure 2Ci, blue arrowheads) or when resistance is met.\n\t\tNOTE: Work as fast as possible since the resin begins to harden after adding the resin curing agent. The working time from adding the curing agent is approximately 15 min.\nRemove the tubing by pulling it out of the common bile duct and quickly tighten the silk knot using forceps to prevent the resin from leaking out. Cut away the loose ends of the silk suture, so they do not interfere with the portal vein injection.\nDispose of the tubing containing resin and the remaining resin into the hazardous waste and the needle into the sharps waste.",
    "Resin injection - Portal vein resin casting\n\t\nClear the portal vein (area ~5 mm) from its surrounding tissue about 2 cm from its entry to the liver using straight forceps. Place silk suture thread (size 4-0, 0.17 mm, 3 - 5 cm long) under the cleared area of the portal vein (Figure 2Ci) and tie a loose overhand knot (Figure 2Cii).\nMake a longitudinal incision in the portal vein distal to the liver and the knot (Figure 2Ciii).\nMix 1 mL of the green resin with 50 μL of the curing agent (by filling up and emptying a 1 mL syringe)  and fill the 1 mL Luer syringe with the resin-curing agent mixture.\nConnect the filled syringe with the tubing (set #2 for >P30 mice, new set #1 for <P30 mice). Press the plunger to fill the tubing completely. Ensure that the resin drips from the tip of the tubing.\n\t\tNOTE: Avoid and remove bubbles in the syringe and tubing for best results.\nUsing forceps, straighten the portal vein by pulling the surrounding tissue towards the experimenter and insert the tubing with the longest edge of the beveled tip towards the dorsal side of the vessel (Figure 2Ciii).\nTighten the silk thread to secure the tubing in the portal vein.\nInject the resin into the portal vein. Observe the blood vessels filling up with resin. Massage the liver with a PBS-wetted cotton swab to help spread the resin equally (Figure 2Civ).\nStop injecting the resin when all blood vessels are filled (ends of portal veins are visible at the liver periphery) or when resistance is met.",
    "NOTE: Work fast since the resin begins to harden after the addition of the curing agent. The working time from adding the curing agent is approximately 15 min for injection set#1 and 25 min for injection set #2.\nRemove the tubing by pulling out the tubing from the portal vein and quickly tighten the silk knot using forceps to prevent the resin from leaking out.\nDispose of the tubing containing resin and the remaining resin into the hazardous waste and the needle into the sharps waste.\nLiver dissection and fixation\n\t\nDissect out the whole liver by cutting it away from the surrounding tissue and the diaphragm.\nGently place the whole liver in an empty 50 mL conical tube with the ventral side facing up and the dorsal side resting on the wall of the conical tube to prevent deformation of the liver. Store the conical tube horizontally overnight at 4 °C for the resin to harden completely.\n\t\tNOTE: Any container that is big enough to fit the liver can be used instead of 50 mL conical tube. Using a flat bottom container will increase the likelihood that the liver is not deformed.\nSeparate the liver into individual lobes. Make a selection of the lobes that will be used for microCT analysis (1.4.4-1.4.5) or quality control (1.4.6-1.4.8). Optionally use the whole liver for both optical clearing and microCT without separating it into individual lobes.",
    "NOTE: Liver architecture of the biliary and vascular systems is different in each lobe, and matched lobe analyses are therefore required. The optical clearing does not interfere with microCT scanning, and the lobe(s) used for quality control can be subsequently scanned with microCT. Conversely, samples scanned with microCT can be subsequently optically cleared for comparison. The whole liver analysis is thus possible. In wild-type mice (C3H/C57bl6 genetic background), the right medial lobe is filled first by resin injections, making this a suitable lobe for microCT analysis, with the highest reproducibility. The left lateral lobe is the biggest lobe, in which it is therefore straightforward to pre-screen for injection quality. The selection of the lobe (or whole liver) used for quality control and microCT scanning is dependent on the animal model and research question.\nIn a ventilated hood, prepare 4% formaldehyde solution (10 -20 mL per tube). Fix the lobes used for microCT with 4% formaldehyde overnight at 4 °C and afterward wash once with PBS (10 -20 mL per tube).\nCollect formaldehyde waste in a separate container. Keep the liver lobes in PBS at 4 °C for short-term storage or 70% ethanol for long-term storage. Proceed with section 2: Micro-computed tomography.",
    "CAUTION: Formaldehyde causes acute toxicity if swallowed, inhaled, or in contact with skin. Formaldehyde is a flammable liquid and vapor. It causes severe skin burns and eye damage. May cause an allergic skin reaction. Fatal if inhaled (concentrated or in powder). May cause respiratory irritation. Suspected of causing genetic defects. May cause cancer. Causes damage to organs (eyes, central nervous system). Precautionary statements - keep away from heat, hot surfaces, sparks, open flames, and other ignition sources. No smoking. Wear protective gloves and protective clothing. In case of spillage, immediately take off all clothing that was contaminated. If in contact with the skin: rinse the contaminated area with water. If inhaled: remove person to fresh air and monitor breathing if comfortable. Immediately call a poison center/ doctor. If in eyes: rinse eyes with water for several minutes. If present and possible, remove contact lenses.\nFor quality control, fix the remaining lobes (at least one) with 50% methanol (mixed with deionized water) for a minimum of 4 h, rocking at room temperature, followed by 100% methanol overnight rocking at room temperature. Collect methanol waste in a separate container.\n\t\tCAUTION: Methanol causes acute toxicity if swallowed, inhaled, or in contact with skin. Methanol is a flammable liquid and vapor. Wear protective gloves and clothing. Avoid breathing when handling and keep away from fire and heat. Wash skin thoroughly after using. In case of spillage, immediately take off all contaminated clothing. Rinse skin with water. If inhaled: Remove person to fresh air and keep comfortable for breathing. If inhaled, swallowed, or exposed, call a poison center/ doctor.\nIn a ventilated hood, prepare benzyl alcohol and benzyl benzoate (BA: BB, 1:2) (5 -10 mL per lobe) solution.",
    "Place the liver lobe in a 15- or 50- mL polypropylene tube (depending on the size of the lobe) containing BABB solution. Leave it rocking at room temperature until transparent. This step can take between 2-16 h depending on the size of the lobe.\n\t\tNOTE: The BABB solution dissolves certain types of plastic. It is safe to store the samples in polypropylene tubes or glass containers.\n\t\t​CAUTION: Benzyl benzoate can cause acute toxicity when swallowed. It is toxic to aquatic life with long-lasting effects. Precautionary statements: wash skin thoroughly after handling. It is harmful when swallowed, in contact with skin, or inhaled. Avoid breathing fume/vapors. Wash hands thoroughly after handling. Do not eat, drink or smoke when using this product. If swallowed - call a poison center/doctor if unwell Use in ventilated areas. Collect spillage. Dispose of contents/container to an approved waste disposal plant.\nInspect the quality of the injection. Only well-injected liver should be scanned with microCT.\n2. Micro-computed tomography\nSample preparation\n\t\nPrepare 1% agarose gel by mixing 100 mL of distilled water and 1 g of agarose powder. Place the mixture in a microwave and boil the solution until the agarose powder dissolves.\nTemper the 1% agarose gel to ~40 °C to avoid thermal damage to the liver sample.\nPlace the lobe(s) of interest in a 15 mL conical tube and fill it with the 1% agarose gel to approximately 2/3 of the total volume of the tube. This step minimizes undesired sample motion during CT measurement.\nCT measurement",
    "NOTE: The following steps are CT device-dependent, and specific settings and actions may differ for different CT devices and manufacturers. In this protocol, the micro-computed tomography scanner used was equipped with a nanofocus X-ray tube (180 kV/15 W), and flat-panel dynamic 41|100 (4048 px x 4048 px, pixel size 100 mm with binning 2) for the CT measurements.\n\t\nMount the 15 mL conical tube with the sample on the rotational stage of a CT device and allow it to thermally adapt to the measurement chamber for at least 1 h.\nWhen the sample is thermally adapted, center it in the Field of View (FOV).\nOptimize the source-sample and sample-detector distances (SSD, SDD) to reach sufficient voxel resolution, e.g., 12 µm for an adult murine liver sample or 6.5 µm for <P30 liver, corresponding to dimensions of FOV (for beforehand specified hardware) 24.3 mm × 24.3 mm and 13.2 mm × 13.2 mm respectively.\nSet the acquisition parameters (i.e., accelerating voltage and current, exposure, binning, averaging) following the CT device manufacturer's recommendations to reach a sufficient level of detected signal.These parameters are not only CT device-dependent but also sample-dependent and should be optimized for each sample. In Hankeova et al.9, the settings were: 80 kV accelerating voltage, 160 µA accelerating current, 400 ms exposure time, and 2000 images.\nStart a CT measurement. Use a dedicated tomographic reconstruction software to reconstruct the CT data.\n3. Analysis and data segmentation\nNOTE: The following steps are image-processing software-dependent; specific settings and actions may differ depending on the software used.\nLoad the CT data: Select File > Import > Command. A further selection is dependent on the specific format of the CT data to be processed.",
    "Use the function Surface Determination on the top panel to segment the resin in the data using global thresholding. In the dialog window, determine the threshold value with histogram evaluation by setting the position of the red \"Isovalue\" line to segment only the resin-filled vessels (i.e., encompassed by the yellow line in the presented \"Preview panel\") (Figure 3A).\nOn the left panel, select the module Create ROI from Volume/CAD/Mesh to create a region of interest (ROI) of the resin-filled vessels. In the dialog window, use the option Create ROI(s) from Solid, select the name of the processed volume and confirm.\nEliminate erroneous segmentation of noise clusters in the background region of this ROI. Mark this ROI on the right panel, right-click on it and select the module Split ROI.\nIn the dialog window, set the Minimum Volume [voxel] parameter to exclude all the noise particles - this value is experiment- and data-dependent and must be optimized for each sample to be analyzed (Figure 3B).\nCreate smooth, continuous, and solid canal masks without artifacts in the resin-cast ROI - e.g., presence of air bubbles or resin leakage.\nOn the left panel, use the module Smoothing, set the Smoothing Strength parameter to 1 or 2 (depending on the individual data, when higher values might lead to model deformation, especially when dealing with fine structures). If needed, run this process twice (Figure 3C).\nIdentify and separate the individual tubular systems in the segmented resin mask.\n\t\nCreate a separate ROI for the system filled with the more absorptive resin (the yellow resin used for the common bile duct injection) with higher intensity values in the CT data. Follow the procedure described in step 3.2. (Figure 3Di).",
    "Mark the new ROI and the resin mask ROI, right-click and select Subtract ROI(S) and subtract the new ROI from the resin mask ROI to create a new ROI for the remaining tubular system (Figure 3Dii, iii).\nExport the resulting ROIs for both tubular systems in various formats, based on operator preferences, for subsequent processing in different software. Further, process the resulting ROIs in a volume graphics software to export the final visualization in the form of an image or a video."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}