{
  "id": 960,
  "origin_website": "Nature",
  "title": "qPCR based reporter assay on luciferase transcripts",
  "procedures": [
    "**1. Transfection by electroporation with the MaxCyte STX transfection system**\nThis protocol describes 1x electroporation \\(EPO) for adherent cells \\(HeLa S3 & HCT116)\nPrepare 5x10<sup>6</sup> cells per electroporation for the day of transfection in square plates. Scale up or down the cell number according to the number of EPOs you want to perform.\n• Remove Medium completely\n• Wash cells carefully with 8 ml 1xPBS, remove PBS completely\n• Add 8 ml 1xTrypsin to the cells to cover the plate completely \n• Incubate cells at 37°C until they completely detach\n• Add 12 ml Medium to the cells, resuspend and collect them in a 15 ml or 50 ml Falcon tube depending on the number of EPOs \n• Count cells and aliquot 5x10<sup>6</sup> cells per EPO\n• Spin cells down, 125 g; 5 min\n• Wash pellet once in 5 ml Electroporation \\(EPO) buffer\n• Remove buffer and add ~ 50% of the final volume of EPO buffer to the cells \\(you need to reach a final volume of 100 µl at the end → see below)\n• Prepare a separate tube with a mix of the Renilla and pBluescript plasmids, 1:10 ratio to reach a total of 20 µg → Renilla 2 µg : pbluescript 18 µg\n• Resuspend the cells and add them to the plasmid DNA mix \\(be careful not to introduce air bubbles)\n   • \\(Plasmid concentration should be > 1 µg/µl for all used plasmids)\n   • For the control samples do not add DNA to the cells\n• Measure volume of cells after addition of the plasmid DNA, fill up with EPO buffer to a total of 100 µl",
    "• Add 100 µl of the cell suspension into 1x OC100 MaxCyte cuvette and use default settings for electroporation \\(e.g. Hela or HCT 116) or Optimization protocols for cell lines if no pre-set protocol is available \\(test before, which optimization protocol fits best for your cell line). \n• Transfer the 100 µl of cell suspension immediately to a 1x75 pre-warmed flask without adding medium \\(cells recover without the addition of any medium)\n• Incubate cells @ 37°C; 30min.\n• Add an appropriate amount of pre-warmed medium without antibiotics to the cells, resuspend and plate at 1x10<sup>6</sup> cells per well in a pre-warmed 6-well plate. For cells that induce interferon signaling upon DNA transfection \\(e.g. HeLa-S3), add C16 and BX-795 to the medium to a final concentration of 1 µM each inhibitor. \n**Harvesting after electroporation**\n \n• Harvest the cells 6h after addition of media\n• For each well, harvest the medium of the cells \\(20% of cells are still not fully attached to the plates) in a 15ml Falcon tube\n• wash once with 1ml PBS, harvest PBS\n• add 1ml of trypsin\n• incubate at 37°C until the cells fully detach, then add 1 ml of pre-warmed medium\n• Harvest cell suspension\n• Spin the cells down at 125g; 5min, take of S/N\n• Resuspend cells in 1ml PBS\n• Spin down cells 125g/5min, take of S/N\n**2. RNA isolation with RNeasy Mini Kit \\(Qiagen, Cat No. 74104)**\n• Resuspend the cells in 350µl RLT + 1% β-Mercaptoethanol \\(Cat No. 63689)\n• Transfer lysate to Qiashredder column \\(Cat No. 79654), spin for 2 min at max speed\n• Discard column, mix flow through with 1 volume 70% ethanol, mix by pipetting\n• Transfer max 700 µl lysate to RNeasy mini column, spin for 30s at 10,000g\n• Discard flow through",
    "• Wash column with 700 µl RW1 \\(30s, 10,000xg), discard flow through,\n• Wash column with 500 µl RPE \\(30s, 10,000xg), discard flow through,\n• Wash column with 500 µl RPE \\(2 min, 10,000xg),\n• Place column into new collection tube, spin for 1 min at full speed\n• Elute into new 1.5ml tube with 50 µl RNase free H2O\n**3. Turbo DNase I treatment \\(Ambion, Cat No. AM1907)**\nAdd the following to a RNase-free tube on ice:\n2 µg RNA sample\n2 µl 10X Turbo DNase Buffer\n2 µl Turbo-DNase \nfill up with H2O to 20 µl\n• Incubate tube\\(s) for 30min at 37º. \n• Inactivate the DNase I by the addition of 2 µl of inactivation solution to the reaction mixture \\(mix well before use). Incubate for 2min at RT, vortex occasionally\n• Centrifuge at 10,000xg for 5min and transfer 10 µl of the RNA into a fresh tube for the following reverse transcriptase. The remaining 10 µl can be transfer into a separate tube and used as a negative –RT control.\n**4. Reverse Transcription \\(RT)**\nAdd the following to the DNaseI treated RNA \\(prepare master mix, add 10µl):\n1 µl of Oligo dT20 \\(50µM, Thermo Fisher Cat No. 18418020)\n1 µl dNTPs \\(10 mM each)\n4 µl 5X First-Strand Buffer \\(in the Superscript kit)\n1 µl 0.1 M DTT \\(in the Superscript kit)\n1 µl RNase Inhibitor Murine \\(Cat No. M0314S)\n1 µl SuperScript III RT \\(SuperScript® III Cat No. 18080044)\n1 µl H20\nMix by gently pipetting up and down.\nRT program: \n25ºC for 5 min, 50ºC for 50 min, 70ºC for 15 min\nBring RT reaction volume to 100 µl \\(add 80µl H2O)\n**5. qPCR**\nReaction Setup \\(prepare master mix)\n10 µl GoTag SYBR Green Master Mix \\(2x) \\(Promega; Cat No. A6001)",
    "1 µl primer mix \\(10µM each)\n2 µl cDNA\n7 µl H2O\nDistribute 18 µl MM into wells; add 2µl cDNA, seal, vortex and spin down.\nPipette each sample per primer pair in triplicate.\nProgram: 95ºC for 2 min; \\(95ºC for 3s, 60ºC for 30s, Read plate) for 40 cycles\n**Primers:**\nFF_fwd, GTGGTGTGCAGCGAGAATAG\nFF_rev, CGCTCGTTGTAGATGTCGTTAG\nRL_fwd, GGAATTATAATGCTTATCTACGTGC\nRL_rev, CTTGCGAAAAATGAAGACCTTTTAC\nFF = Firefly, RL = Renilla\nAnalysis of the qPCR:\nFirefly Ct values for each candidate enhancers are then normalized to Renilla Ct values using the delta Ct method described in: Livak, K. J. & Schmittgen, T. D. Analysis of relative gene expression data using real-time quantitative PCR and the 2-\\[Delta]\\[Delta] CT method. Methods 25, 402–408 \\(2001). Delta delta Ct values can then be calculated between candidates \\(e.g. candidate over negative control or empty vector)."
  ],
  "subjectAreas": [
    "Biotechnology"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}