{
  "id": 11758,
  "origin_website": "Jove",
  "title": "Antisense Oligonucleotides as a Tool for Prolonged Knockdown of Nuclear lncRNAs in Human Cell Lines",
  "procedures": [
    "NOTE: This protocol is intended to be performed only by laboratory personnel with experience in laboratory safety procedures. It is essential to properly read the safety data sheets from all the reagents and materials used in this protocol prior to starting to handle hazardous materials and equipment. It is essential to read, understand and fulfill all the safety requirements indicated in your institution's laboratory safety manual along the whole protocol. Disposal of all biological and chemical waste must be performed according to the institution´s waste management and disposal manual. If not handled with care and according to safe laboratory practices, materials and equipment used in this protocol can cause serious injury. Always follow institution´s safety laboratory manual and safety procedures.\n1. Design of ASOs\nManually design ASOs as described below.\n\t\nObtain the complete sequence of the target transcript and analyze it in the RNAfold WebServer, University of Vienna37 (Table of Materials), using the default parameters on the website to obtain the minimum free energy (MFE) secondary structure.\nWhen the results are ready, go to MFE plain structure drawing and click View In Forna to open the MFE secondary structure on the website, and the software will show the predicted secondary structure of the transcript analyzed.\nFrom the predicted MFE secondary structure, select a region of 20 bp length in the RNA, avoiding G-strings (sequences of 3 guanines in a row) when designing the oligonucleotides. For selection of the best target region for the ASO, use the regions predicted to have a lower probability of internal base pairing (Figure 1).",
    "From the selected region of 20 bp, create the reverse complement sequence. Manually create the reverse complement or use the reverse complement online tool (Table of Materials). The reverse complement sequence will be the ASO that must be synthesized for the experiment.\nAnalyze the ASO sequence using Nucleotide Blast NCBI (blastn) and UCSC Genome Browser on Human (GRCh38/hg38). Ensure ASOs do not show homology to other transcripts or other genomic regions in the human genome.\n\t\tNOTE: ASO synthesis and purification were performed by a commercial company (Table of Materials).\nEnsure the oligonucleotides synthesized have the following characteristics.\n\t\nEnsure PS bonds along the whole sequence of the oligonucleotide38 (Figure 2A). Ensure ASOs are chimeric, with 5 nucleotides flanking the 5' and 3' ends with sugar rings modified with 2'-O-methyl (Figure 2B).\nEnsure the 10 nucleotides in the middle have an unmodified sugar ring to support RNase H binding (Figure 2C).\nAsk the company to perform purification using standard desalting and reverse-phase (RP) HPLC39.\nOrder ASO delivery in lyophilized format.\nDissolve the lyophilized ASOs in Dulbecco's phosphate-buffered saline (DPBS) without calcium and magnesium to a final concentration of 200 µM. Store at -20 °C.\nPrepare the working solution of ASO by diluting the concentrated stock to a concentration of 20 µM. Prepare the dilution using DPBS. Store at -20 °C.",
    "NOTE: For this study, two ASOs targeting lncRNA-RFC4 were designed. For optimization of the ASO concentration for transfection and efficiency, the protocol by Zong et al.40 was followed. Two ASOs were designed and experimentally optimized according to Zong's protocol: ASO-lncRFC4 and ASO-lncRFC4-2. After optimization, one effective ASO targeting lncRNA-RFC4, ASO-lncRFC4, was selected for the prolonged knockdown protocol (Supplementary Figure 1). As a positive control, a previously confirmed efficient ASO targeting lncRNA MALAT18 was used: ASO-MALAT1. For the negative control, an ASO targeting the Escherichia coli lacZ gene, ASO-lacZ (NCBI accession number: FN297865), was designed.\n2. Preparation of cells\nNOTE: Work inside the cell culture hood every time cell lines, solutions, material, or any product to be used during cell culture manipulation is handled. When manipulating liquids for cell culture, always use sterilized serological pipettes or micropipettes with sterilized tips. Always fulfill and follow all the safety requirements indicated in the institution's laboratory safety manual during the whole protocol.\nPrepare the complete cell culture media for each cell line as described below.\n\t\nFor HCT116, prepare McCoy's 5A medium with 10% of fetal bovine serum (FBS).\nFor PrEC, prepare prostate epithelial cell basal medium with the prostate epithelial cell growth kit.\nUse three 100 mm culture plates (55 cm2 surface area) for KD experiments, one for each oligonucleotide to be used: ASO targeting the lncRNA, ASO to be used as a positive control (ASO-MALAT1) and ASO to be used as a negative control (ASO-lacZ).\nUse two 35 mm culture plates (9 cm2 in surface area) to be used as checkpoints for KD between cell passages, one of which will be transfected with complete transfection media for ASO-lncRFC4 and the other for ASO-lacZ.\n\tNOTE: Transfection was planned according to the lipid-based transfection reagent (see Table of Materials) manufacturer´s procedures and protocols previously reported41,42.",
    "Seed cells to a density of 1 x 104 cells/cm2 in cell culture dishes. Incubate at 37 °C in the incubator using 5% CO2 in air until cells reach 50% confluency (when 50% of the surface is covered by the cell monolayer). With a confluence of 50%, cells are ready to be transfected for this protocol.\n\t​NOTE: For transfection of ASO-lncRFC4 and ASO-lacZ, one 100 mm dish and one 35 mm dish were seeded. For transfection of ASO-MALAT1, only a 100 mm dish was seeded (Figure 3A).\n3. Transfection\nWarm up reduced serum medium to 37 °C prior to the start of the procedure.\nFor transfection with ASO-lacZ and ASO-lncRFC4, follow the steps described below.\n\tNOTE: Transfection with ASO-lacZ and ASO-lncRFC4 is planned for cells in a surface area of 55 cm2; when different areas are used, volumes can be adjusted accordingly. This procedure must be performed for each ASO used under the same conditions.\n\t\nPrepare tube 1 inside the cell culture hood by dissolving 43.75 µL of ASO (20 µM) in 1.4 mL of warm reduced serum medium in a 15 mL conical centrifuge tube.\nPrepare tube 2 inside the cell culture hood by mixing 18.66 µL of lipid-based transfection reagent with 1.4 mL of warm reduced serum medium in a 1.5 mL RNase-free microfuge tube.\nIncubate tubes 1 and 2 inside the cell culture hood at room temperature for 10 min.\nAdd the solution contained in tube 2 (transfection reagent + reduced serum) directly to tube 1 (ASO + reduced serum) slowly, drop by drop, to avoid spreading the reagents over the surface of the tube.\nIncubate the mixture contained in tube 1 for 20 min inside the culture hood at room temperature.\nAdd warm reduced serum medium to tube 1 to a final volume of 8.75 mL.",
    "NOTE: The final transfection media contained ASO at a concentration of 100 nM.\nRemove the culture media from the cell culture dish containing the cells to be transfected and add 7.5 mL of the transfection media to the 100 mm culture plate and 1 mL to the 35 mm culture plate directly in the cell monolayer, drop by drop. Make sure the media is evenly distributed along the whole surface by gentle shaking of the dish.\nIncubate in an incubator at 37 °C with 5% CO2 in air for 6 h.\nAfter 6 h of incubation in the transfection media, add 7.5 mL of complete media to the cells in the 100 mm culture plate and 1 mL of complete media to the cells in the 35 mm culture plate. Incubate at 37 °C and 5% CO2.\nFor transfection with ASO-MALAT1, perform the experiments as described below.\n\tNOTE: Transfection with ASO-MALAT1 is planned for cells in a surface area of 55 cm2.\n\t\nPrepare tube 1 inside the cell culture hood by dissolving 37.5 µL of ASO (20 µM) in 1.2 mL of warm reduced serum medium in a 15 mL conical centrifuge tube.\nPrepare tube 2 by mixing 16 µL of lipid-based transfection reagent with 1.2 mL of warm reduced serum medium.\nIncubate tubes 1 and 2 at room temperature for 10 min inside the cell culture hood.\nAdd the solution contained in tube 2 (lipid-based transfection reagent + reduced serum) directly to tube 1 (ASO + reduced serum) slowly, drop by drop, to avoid spreading the reagents over the surface of the tube.\nIncubate the mixture contained in tube 1 for 20 min inside the culture hood at room temperature.",
    "Add warm reduced serum medium to tube 1 to a final volume of 7.5 mL. The final transfection media contained ASO at a concentration of 100 nM.\nRemove the culture media from the cell culture dish containing the cells to be transfected and add 7.5 mL of the transfection media directly to the cell monolayer dropwise to ensure that the medium is evenly distributed along the whole surface by gentle shaking of the dish.\nIncubate at 37 °C in an incubator using 5% CO2 in air for 6 h.\nAfter 6 h of incubation with the transfection media, add 7.5 mL of complete media to the cells and incubate in an incubator at 37 °C and 5% CO2.\nAssess cells microscopically every 12-24 h until cells are ready for the next transfection round.\n\tNOTE: Next, transfection must be performed when cells achieve confluence of 70%. If needed, exchange media replacing with complete culture medium.\nWhen cells are 70% confluent in the cell culture dish, repeat the procedure (steps 3.1 to 3.4) and perform the next round of transfection.\n\t​NOTE: After the second transfection, cells should be assessed microscopically every 12-24 h. Cell harvest and passaging must be performed when cells achieve confluence of 80%-85%. If needed, exchange media replacing with complete culture medium.\n4. Cell harvest and passaging",
    "NOTE: Cell harvest and passaging are performed after every 2 rounds of transfection and after the 2nd, 4th, and 6th rounds of transfection. The mean time for harvest in HCT116 cells was 6 days after the 1st, 3rd, and 5th transfections, and for PrEC cells, the mean time was 7 days after the 1st, 3rd, and 5th transfections. The timepoint for transfection differs for both cell lines used in this protocol. For HCT116, the 2nd, 3rd, 4th, 5th, and 6th transfections are performed 3, 6, 9, 12 and 15 days after the first transfection, respectively. For PrEC, the 2nd, 3rd, 4th, 5th, and 6th transfections are performed 3, 7, 10, 14 and 18 days after the first transfection, respectively. Refer to the timeline in Figure 3 to check timepoints for transfection, passaging, and harvesting.\nPerform cell harvesting and passaging for the KD experiments in 100 mm culture plates as described below.\n\t\nProceed to harvest cells and passage when cells achieve confluence of 80%-85%.\nWarm up the complete medium and wash solutions to 37 °C. Warm up the dissociation reagent to room temperature. Warm up the neutralizing solution for the dissociation reagent to room temperature.\n\t\tNOTE: Washing solutions, dissociation reagents and neutralizing solutions differ for the two cell lines used in this protocol. HCT116 cells are washed with PBS (phosphate buffered saline) and dissociated with trypsin-EDTA solution. Neutralization of the dissociation reagent is performed with complete culture media for HCT116 cells. For PrEC, HEPES-buffered saline solution is used as the washing solution. Trypsin-EDTA is used as the dissociation reagent. For neutralization of the dissociation reagent, use trypsin neutralizing solution.\nInside the culture hood, remove culture media from the cell culture dish and wash gently with 3 mL of washing solution, followed by discarding the washing solution. Repeat this step 2x.",
    "Add 2 mL of dissociation reagent according to the cell line to the cell monolayer and incubate at 37 °C for 3-5 min. Assess cells every 2 min until dissociation is complete.\nAdd 2 mL of neutralizing solution according to the cell line and transfer the whole volume of the cell suspension from the cell culture dish to a 15 mL conical centrifuge tube.\nFor RNA extraction, take 500 µL of the cell suspension and transfer it to a 1.5 mL centrifuge tube. Place the tube on ice and proceed to step 5.1 for RNA extraction and RT-qPCR.\nCentrifuge the rest of the cell suspension at 120 x g for 5 min at room temperature and discard the supernatant.\nResuspend the cell pellet in 2 mL of complete culture media and proceed to cell counting according to standard procedures.\nFor karyotyping, seed cells to a density of 1 x 104 cells/cm2 in a cell culture dish of 35 mm in diameter (surface area of 9 cm2), incubate in an incubator at 37 °C at 5% CO2 in air for 24 h and proceed to karyotyping according to standard procedures.\nTo continue the KD experiments in the next cellular passage, seed cells to a density of 1 x 104 cells/cm2 in a new cell culture dish 100 mm in diameter. This dish will be passage number 2 for the experiment. Incubate at 37 °C in incubator using 5% CO2 in air until cells achieve confluence of 50%.\n\t\tNOTE: If desired, the remaining cells can be used for protein extraction and/or freezing according to standard procedures.\nRepeat steps 3.1 to 4.1.10 for transfection and harvesting from passage 2 and from passage 3.\nFollow the next procedure for cell harvest for the checkpoints of the KD experiments in 35 mm culture dishes.",
    "NOTE: The harvest for the first checkpoint in the KD experiment is performed 2 days after the 2nd and 4th transfection procedures.\n\t\nWarm up the complete media and washing solutions to 37 °C. Warm up the dissociation reagent to room temperature. Warm up the neutralizing solution for the dissociation reagent to room temperature.\nInside the culture hood, remove culture media from the cell culture dish and wash gently with 0.5 mL of washing solution and then discard the washing solution. Repeat this step 2x.\nAfter discarding the washing solutions, add 0.5 mL of dissociation reagent according to the cell line and incubate at 37 °C for 3-5 min. Assess cells every 2 min until the dissociation is complete.\nAdd 0.5 mL of neutralizing solution according to the cell line and transfer the whole volume of the cell suspension from the cell culture dish to a 1.5 mL microcentrifuge tube and place it on ice.\nProceed to step 5.1 for RNA extraction and qPCR.\n5. RNA extraction and RT-PCR\nCentrifuge the cell suspension at 200 x g for 2 min at 4 °C and discard the supernatant. Wash the cell pellet with 600 µL of cold PBS (4 °C).\nCentrifuge the cell suspension at 200 x g for 2 min at 4 °C and discard the supernatant.\n\tUse the cell pellet for RNA extraction according to standard procedures.\nProceed to DNase treatment of the purified RNA according to the standard procedure followed in the laboratory. At the pause point, store purified RNA at -80 °C for long periods.\nUse the RNA for standard cDNA synthesis with every RNA sample obtained. At the pause point, store cDNA at -20 °C for long periods.\nPerform standard qPCR as per the steps described below.",
    "For qPCR, oligonucleotides amplify the following transcripts: lncRNA of interest, MALAT1 and a constitutively expressed gene as an internal control (Table 1). For this protocol, the expression RPS28 was used as an internal control.\nPerform qPCR reactions to amplify the internal control, the lncRNA of interest and MALAT1 using cDNA from the ASO-LacZ sample. This sample will be used to normalize the expression from the other samples.\nPerform qPCR reactions to amplify the internal control RPS28 and the lncRNA of interest using cDNA from the ASO-lncRNA sample.\nPerform qPCR reactions to amplify the internal controls RPS28 and MALAT1 using cDNA from the ASO-MALAT1 sample. Follow reaction set up and thermocycler conditions as described in Table 2.\nAnalyze qPCR data by ΔΔCt normalization of the expression of the transcript of interest against the internal control, and then, normalize the expression of the transcript of interest (lncRNA or MALAT1) against the expression of the same transcript in the ASO-LacZ sample to obtain the relative expression level of the transcript.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}