{
  "id": 2519,
  "origin_website": "Cell",
  "title": "Protocol to measure cleavage efficiency of the meiotic cohesin subunit Rec8 by separase in mouse oocytes using a biosensor",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nOocyte collection\nTiming: 1–2 h\nMouse prophase-arrested oocytes are collected, cleaned and prepared for microinjection.\nPrepare a 60 mm polystyrene tissue culture dish with 5–6 droplets (around 30 μL each) of pre-warmed medium containing dbcAMP.\nCover the drops completely with a layer of mineral oil.\nPrepare another dish/cover/container with a large drop of medium (800–1,000 μL) containing dbcAMP and without oil for dissection of ovaries.\nSacrifice a 8–12 weeks old female mouse through cervical dislocation or in a CO2 chamber, dissect the abdomen and collect the ovaries.\nNote: Make sure to carefully tear off fatty tissue with forceps. You can lightly \"roll\" the collected ovaries on tissue paper to remove the remaining fatty tissue.\nPlace the ovaries in the dish prepared for dissection (with a large drop of medium (800–1,000 μL) containing dbcAMP and without oil).\nNote: We use mice that have not been hormonally stimulated, to work with naturally competent oocytes. Optimal age of a OF1 (Swiss) mouse for oocyte collection is 8–12 weeks. The quantity of oocytes obtained per mouse depends on the strain, the age and estrus cycle of the mouse. On average, an unstimulated OF1 mouse yields 40–70 oocytes, C57BL6 mouse yields around 30 oocytes.\nWorking under the binocular microscope equipped with a heated glass plate, macerate the ovaries with the sharp tip of a needle, opening up all the large follicles.\nWith a glass pipette (torn-out Pasteur pipettes, prepared as described above) collect all fully-grown oocytes that were released from the dissected follicles and transfer them to the dish with smaller medium droplets (around 30 μL) covered with mineral oil.",
    "Note: The end of the Pasteur pipette may be broken off manually to create a straight tip, to avoid hurting the oocytes upon pipetting. Oocytes should enter the glass pipette without extra sucking force applied and should not be deformed upon entering and exiting the glass pipette. The inner diameter should not be too large either, to avoid pipetting more volume than necessary at each step, which can make it hard to control the flow and leads to damage on the oocytes.\nNote: In this and all following steps keep the oocytes at 37°C. This is important even when harvesting and manipulating oocytes. Medium should be prewarmed, and microscopes equipped with heated plates. Alternatively, oocytes can be put in an incubator between the different steps to avoid cooling down of the medium; however, in our experience proceeding like this is suboptimal and delays in meiotic maturation may occur.\nClean the collected oocytes. This means detaching all the remaining follicular cells (denudation) by passing the oocytes several times through the opening of a glass pipette with an inner diameter only slightly larger than the diameter of an oocyte (80–100 μm).\nTransfer the follicle-free oocytes into another medium drop in the same dish.\nSelect fully-grown competent oocytes that are arrested in prophase I, and discard the rest.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2026-Fig1.jpg\nFigure 1. Microinjection setup\n(A) A bright-field microscope with attached pipette holders that are operated by micromanipulators. Pressure is supplied by the manual microinjector to the left and the automatic microinjector to the right. The microscope is equipped with a heating plate and a temperature controller.\n(B) A heating plate containing a depression glass slide. A holding pipette and a microinjection needle are connected to the pipette holders.\n(C) Mouse oocyte ready for microinjection.",
    "Note: Competent prophase I oocytes have reached their full size (70–80 μm in diameter), with the germinal vesicle (GV) not completely off-centered and with a smooth-looking Zona Pellucida (ZP). Oocytes covered with follicle cells that cannot be removed and the GV not in the center are not fully competent and should be discarded. See Figure 1[href=https://www.wicell.org#fig1]C for an example of a competent oocyte arrested in prophase I.\nMicroinjection\nTiming: 15–60 min (without centrifugation step)\nmRNA to express the biosensor is microinjected into prophase-arrested oocytes.\nDefrost and centrifuge one mRNA aliquot in an Eppendorf centrifuge at maximum speed (16,000 × g) at 4°C for 15–45 min. Keep on ice.\nPrepare the microinjection needle and load it with 0.5–1.5 μL of mRNA solution.\nNote: We use home-made microinjection needles made from glass capillaries (outer diameter 1 mm, inner diameter 0.75 mm, length 100 mm, purchased from Harvard apparatus) with the help of a Narishige PN-31 puller (currently discontinued, possible alternative is Narishige PC-100). The puller settings have to be determined experimentally as identical settings on identical machines do not result in the same needle configuration.\nNote: Load the needle with 0.5–1.5 μL of mRNA solution with the help of microloader tips (Eppendorf).\nPlace a 10–15 μL drop of the culture medium with dbcAMP in the center of a glass slide with a shallow depression and cover with a small amount of mineral oil. Transfer the oocytes into this drop.",
    "Note: Make sure that the mineral oil covers the drop of the culture medium completely. This prevents the medium from evaporating which would change the osmotic pressure and affect the oocyte quality. Glass slides with a shallow depression (“depression glass slides” or “cavity glass slides”, for example Globe Scientific ref. #1341-72 or VWR ref. # 470235-728) are perfect for this purpose. If the medium drop is not covered with the mineral oil completely you can also reduce the volume of the drop.\nPlace the glass slide with oocytes under the microinjection microscope, lower the holding pipette and the loaded microinjection needle to the oocyte level.\nSwitch the microinjection pump to constant flow setting (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nNote: We use Eppendorf FemtoJet Microinjector with constant flow setting as it is the best way to ensure oocyte microinjection success. It does not deliver an exact, predetermined volume of mRNA into the oocyte. However, the amount of protein expression after microinjection has to be measured by other means anyway, as protein expression does not only depend on the amount of mRNA injected, but also on its quality and ternary structures it may form.\nCapture one oocyte with the holding pipette and insert the tip of the microinjection needle in the oocyte, avoiding the nucleus (Figure 1[href=https://www.wicell.org#fig1]C). Quickly take the needle out after injection.\nRelease the oocyte from the holding pipette.\nRepeat steps 16 and 17 to microinject all the oocytes.\nNote: For holding pipettes, we use VacuTip microcapillaries, inner diameter 15 μm, outer diameter 100 μm, angle 35°. The pipette is connected to an Eppendorf CellTram Oil manual microinjector. For an example of a microinjection setup, see Figure 1[href=https://www.wicell.org#fig1].",
    "Note: Successful injection is indicated by a short burst in the cytoplasm, the size of the burst depends on the pressure supplied to the microinjection needle. Increase or reduce the pressure setting of the Microinjector to change the injection force. Ideally the size of the burst should be comparable or smaller than the oocyte nucleus.\nNote: After injection, retrieve the needle quickly but carefully, keeping the same angle so not to tear the plasma membrane and kill the oocyte.\nNote: We arrange oocytes under the microscope in a way that not injected oocytes are “above” and injected oocytes are “below” the microinjection needle. With the holding pipette, one oocyte after the other is taken from “above”, moved in front of the microinjection needle, injected, and moved to the “lower” pool of injected oocytes.\nNote: Depending on the microinjection skills of the user and the amount of injected mRNA, 30%–80% oocytes will survive, others will lyse within 15–30 min after injection.\nTransfer the injected oocytes from the glass slide into an unused drop of medium in the original culture dish.\nIncubate at 37°C for 1–4 h to ensure that there is sufficient time for protein expression.\nNote: Depending on mRNA concentration, the length of the mRNA to be translated and efficiency of protein expression, the incubation time can be shortened or extended. However, too long incubation may interfere with efficient prophase I exit after dbcAMP washout.\nRelease from cell cycle arrest and timelapse imaging\nTiming: 10–12 h\nThe injected oocytes are released from prophase I arrest and prepared for timelapse imaging in presence or absence of Aurora B/C inhibitors. Oocytes are filmed to capture metaphase I to anaphase I transition.",
    "Prepare a culture dish with 5–6 drops (around 30 μL each) of culture medium without dbcAMP and cover with mineral oil. Pre-warm the dish at 37°C.\nPlace the injected oocytes into several successive drops of culture medium, thus removing trace amounts of dbcAMP to allow cell cycle resumption.\nIncubate the oocytes at 37°C for 50–70 min until they start undergoing germinal vesicle breakdown (GVBD).\nTen to fifteen minutes after the first oocytes undergo GVBD, discard all oocytes still in prophase.\nOptional: Prepare a dish with 3–4 drops (around 30 μL each) of medium containing Aurora B/C (or Aurora A) inhibitor (ZM447439 or AZD1152 for Aurora B/C and MLN 8237 for Aurora A), cover with mineral oil, and prewarm the dish at 37°C. Transfer the required number of injected oocytes that underwent GVBD on time through subsequent pipetting into 2–3 drops of medium with inhibitors, leaving them to incubate in the last drop.\nNote: GVBD marks oocyte exit from prophase and resumption of meiosis. The most competent and healthy oocytes undergo GVBD approximately 1 h after release from dbcAMP-containing medium, which maintains them arrested. It is possible to use the oocytes that undergo GVBD after the first batch, but these oocytes are more likely to have no or delayed anaphase I onset. We never use oocytes that undergo GVBD more than 90 min after release.",
    "Note: Aurora B/C is required for the so-called error correction pathway, to detach wrongly attached microtubule fibers. It is functional during early meiosis, when microtubules attach and detach continuously. The error correction pathway signals to the spindle assembly checkpoint (SAC) which imposes a cell cycle delay. As a consequence, inhibition of Aurora B/C results in accelerated cell cycle progression. Under normal conditions, mouse oocytes of the strain backgrounds we use undergo anaphase I around 7–9 h after GVBD, and 4.5–5 h after GVBD if the SAC is inactivated. Thus, adjust timelapse imaging setup to account for accelerated anaphase timing in presence of Aurora B/C inhibitors.\nNote: The concentration of AuroraB/C inhibitors should be determined experimentally as we found that depending on the manufacturer and production batch the quality may differ. Too strong AuroraB/C inhibition affects chromosome condensation, making them appear as a uniform mass. It is impossible to correctly measure the cleavage efficiency of the sensor in this case. Also, too high concentration may lead to unspecific inhibition of Aurora A, preventing anaphase I onset.\nThe aliquots of the inhibitors should be prepared according to the manufacturer’s instructions and diluted in the culture medium to obtain the desired concentration just before use.\nNote: AuroraB/C is required for cytokinesis, i.e., polar body (PB) extrusion. Anaphase I onset is detectable through rapid chromosome movements, or an attempt to extrude a PB which is then retracted.\nIncubate the synchronized batch of oocytes at 37°C for 4–6 h.\nPrepare a microscopic chamber such as suggested by the microscope manufacturer with multiple drops of 2 μL medium and cover with mineral oil. Prewarm at 37°C.\nPlace 1–2 injected oocytes in each drop.\nNote: If using Aurora kinase inhibitors, use medium containing inhibitors when preparing the chamber.",
    "Note: Oocytes are very sensitive to laser irradiation, such as used in confocal imaging systems. To reduce laser exposure, it is best to place individual oocytes apart from each other. The number of medium drops in the chamber should accommodate the number of oocytes in the experiment. The maximum number of oocytes depends on the conditions and is best determined experimentally.\nAt 4–6 h after GVBD, start timelapse imaging: use the transmitted light, the 491 nm and 561 nm channels, acquire a z-stack of the region around the chromosomes (30–45 μm with a step-size of 3 μm), with acquisitions every 15–20 min.\nNote: Duration of timelapse imaging should start in metaphase I and cover anaphase I, which normally occurs 7–9 h after GVBD. It may be slightly delayed (<30 min) due to the imaging conditions, compared to the oocytes kept in the incubator. A more significant delay indicates that culture conditions are suboptimal.\nNote: Start of the movie has to be adapted to accelerated cell cycle progression in Aurora B/C inhibitor-treated oocytes.\nAfter timelapse imaging check that the oocytes have survived and control oocytes have extruded a polar body, indicative of exit from meiosis I.\nCleavage efficiency quantification\nTiming: 2 h\nThe movies are analyzed and biosensor cleavage efficiency is quantified.\nUsing ImageJ, open image sequences (as stacks and hyperstack) for TRANS, 491 nm and 561 nm channels for one oocyte.\nFor measuring, select the oocytes with their chromosomes fully visible during several timepoints before, during and after anaphase I.\nNote: The chromosomes may migrate out of focus during anaphase if the metaphase plate is not parallel to the plane of imaging. The signal from only partially visible chromosomes should be discarded, as it will introduce errors in quantifications.",
    "Identify the timepoint of anaphase I (marked by chromosome segregation and beginning of polar body extrusion).\nNote: If Aurora B/C kinases are inhibited, chromosome segregation is often problematic as endogenous Rec8 cleavage depends on the activity of these kinases. In this case, anaphase can also be spotted through the attempt of the oocyte to extrude a polar body (which will most likely retract) in the transmitted light channel, or a sudden movement of the chromosomes towards the oocyte cortex (in the 561 nm channel). Consider the timepoint where either of these events occur as anaphase, and keep in mind that oocytes devoid of functional Aurora B/C undergo anaphase I onset several hours earlier compared to untreated oocytes, due to absence of error correction signaling to the SAC.\nStarting from 3-4 timepoints before anaphase and until 3–4 timepoints after anaphase, measure mean fluorescence on Z-projection (maximum intensity) in 491 nm and 561 nm channels in a box that includes all chromosomes (“Chromosomes”) and in another box placed in the cytoplasm away from the chromosomes (“Cytoplasm”). See Figure 2[href=https://www.wicell.org#fig2]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2026-Fig2.jpg\nFigure 2. Measuring biosensor cleavage efficiency from timelapse images\n(A) A montage of timelapse images of a mouse oocyte undergoing anaphase I (marked as 0 min). Rectangles of colored dashed lines mark the areas where the mean fluorescence signal should be measured. Scale bar: 20 μM.\n(B) Calculations based on the measurements from (A), colored blocks correspond to measurements from the rectangles of colored dashed lines.\nNote: The area measured must be the same in size and position between the two channels. As the chromosomes will change position during anaphase, make sure to follow the chromosomes with the area that is being measured.",
    "Note: During anaphase, chromosomes are separated with half of them being extruded into the PB. When the area measured cannot cover both halves anymore, shift the area to cover only one half of the now segregated chromosome masses, preferably the one remaining in the oocyte, but keep in mind that the signal has now been divided by two (Figure 2[href=https://www.wicell.org#fig2]).\nImport the measurements into MS Excel, subtract the “Cytoplasm” from the “Chromosomes” signal for each channel and for each timepoint.\nNormalize the result for each channel separately to the timepoint right before anaphase (Figure 2[href=https://www.wicell.org#fig2]B).\nNote: If the value at the timepoint right before or at onset of chromosome segregation is significantly lower than the value at the timepoint just before, take the higher value for normalization. (Separase cleavage may have started already before segregation of chromosomes is visible).\nCalculate the ratio between the values obtained for the 491 nm and 561 nm channels (divide the normalized value of the 491 nm channel by the normalized value of the 561 nm channel for each timepoint).\nFind the lowest post-anaphase value (within 0–30 min after anaphase), and subtract it from the highest pre-anaphase value. This value represents the portion of the sensor that was cleaved during anaphase, i.e., cleavage efficiency of the sensor.\nNote: Cleavage efficiency is notoriously variable between oocytes, especially if biosensor expression levels are low. Hence, it is important to quantify sensor cleavage in a high number of oocytes to obtain statistically significant results."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Microscopy",
    "Cell Biology",
    "Developmental Biology",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}