{
  "id": 10438,
  "origin_website": "Jove",
  "title": "Using Unidirectional Rotations to Improve Vestibular System Asymmetry in Patients with Vestibular Dysfunction",
  "procedures": [
    "The data presented here and previously published3 were obtained by studies carried out in accordance with the recommendations of the Ethics Committee of Shahid Beheshti University of Medical Sciences, Tehran, Iran and a protocol that was approved by the Institutional Review Board of the University.\n1. Participant screening and preparation\nRecruit participants who have had a history of balance problems for more than one year.\n\tNOTE: Vestibular compensation happens most effectively over the first month after a lesion. The one year timepoint was chosen to provide enough time for natural compensation to reach its plateau and also ensure that the patient does not have a fluctuating vestibular disorder.\nUse the following exclusion criteria for patients:\n\t\nHistory of central nervous system problems (e.g., head trauma, stroke, brain tumor, etc.) that may affect the central vestibular pathways, which are required for proper compensation.\nDiagnosed with a fluctuating vestibular disorder (e.g., benign paroxysmal positional vertigo [BPPV] or Meniere’s disease).\nPatients using other forms of vestibular rehabilitation or types of physical activity (e.g., athletes) that may improve vestibular compensation independent of the unidirectional rotation rehabilitation should be excluded.\n\t\tNOTE: This criterion is suggested only for research purposes and to control for extraneous variables.\nDo not limit participants based on age or gender.\n\tNOTE: Similar to other compensation, this rehabilitation method is expected to have less pronounced effects in older subjects.\nInstruct participants to refrain from using any medications that suppress the central nervous system, including antihistamines or any anti-vertigo drugs for at least 1 day prior to each experimental session.\nInstruct participants not to use any nervous system stimulants, including amphetamines and caffeine for at least 1 day prior to each experimental session.",
    "Instruct participants to refrain from drinking alcoholic beverages in quantities that impair normal functioning, as this can interfere with functioning of the vestibular system and affect the results.\n2. Measurement of the vestibulo-ocular reflex (VOR)\nUse either videonystagmography (VNG) or electronystagmography (ENG) to measure the VOR response during whole-body rotation.\n\tNOTE: The data presented in the results section was recorded by ENG. The current equipment shown in the movie uses VNG.\nPerform all recordings in the dark, with the head positioned 30° nose-down.\n\tNOTE: For visualization purposes, the associated video is not performed in the dark.\nAsk participants to sit in the rotary chair, secure them in the chair with the harness, put the infrared goggles on, and fix the head in the headrest at a ~30° nose-down position.\nAfter participants acclimate to the dark, calibrate the eye signal by asking them to look at laser targets that are projected on the wall at ±10° angles (e.g., to the right, left, above, and below midline).\nBegin running the protocol once the eye tracker is calibrated accurately, when the subjects are ready.\nKeep subjects alert and distracted during all vestibular testing by asking them questions or having them do mental arithmetic (e.g., count backwards from 100).\n3. Unidirectional rotation stimulus\nWith the subject seated in the rotary chair, use a unidirectional rotation that consists of an asymmetric triangular velocity profile with an acceleration of 80°/s2 over 4 s to reach a maximum velocity of 320°/s, then slowly decelerate at 10°/s2 to stop in about 30 s.\n\tNOTE: The slow deceleration is particularly important in order to have a smooth stop in order to avoid stimulating the opposite side.\nPerform five such rotations with 1 min intervals. The five rotations together are considered a rehabilitation session (Figure 1B).",
    "Keep the subject in the chair after the last unidirectional rotation to test the symmetry with a bidirectional sinusoidal harmonic acceleration (SHA) rotation test at 40 min and 70 min post-unidirectional rotation.\n\tNOTE: Keeping the patient in the chair will decrease the variability.\nPerform the SHA test using a wide range of sinusoidal rotations at frequencies of 0.05 Hz, 0.2 Hz, and 0.8 Hz, with a peak velocity of 60°/s.\n\tNOTE: For data presented in the results, a sinusoidal rotation at 0.2 Hz (40°/s) was used for all evaluations.\n4. Experiment design\nEvaluate subjects with a full battery of vestibular tests during the initial session (see below) in order to test VOR asymmetry and rule out any central problems.\nOne week later, expose the subjects to the unidirectional rotation and an SHA test (steps 3.1–3.4).\nRepeat this process 2x per week during the first 2 weeks, then 1x per week for the next 2 weeks (for a total of six sessions).\nAdminister an SHA test at the beginning (step 3.4) and end (steps 3.3 and 3.4) of each session and calculate the directional preponderance (DP) as a measure of asymmetry:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60053/60053eq1.jpg\n\tWhere: VHR and VLR represent peak eye velocities during rotations toward the side with higher responses (HR) and lower responses (LR), respectively.\n\tNOTE: The directional preponderance provides a normalized measure of the difference in peak eye velocity for rotations in the two directions. While it is mainly used for measuring asymmetry in caloric responses, it can be (and is) used for quantifying VOR asymmetry in SHA24,25,26,27,28.\nAs the final session, perform another SHA test (step 3.4) 1 week after the last rehabilitation session.\n5. Sessions details\nInitial session",
    "During the first visit, take a brief history of the patient’s imbalance problems to verify the duration of vestibular asymmetry and ensure no indication of a fluctuating disorder.\nPerform a complete set of vestibular tests, including saccades, smooth pursuit, optokinetic, gaze holding, positional and positioning, caloric, and rotational tests.\nOnly recruit patients with VOR asymmetry during rotation who have clear abnormal directional preponderance (DP), typically with asymmetry values of more than 10%. This will be considered the initial (baseline) DP for each subject.\n\t\tNOTE: Different equipment might provide different normal ranges and it is best to use the range specified for your device or to base the normal range on lab-specific normative data.\nClearly explain to the subjects the procedure of unidirectional rotation (5x in one session) and the total number of sessions (six times total).\nAsk subjects to sign a consent form that has been approved by the local Institutional Review Board (or equivalent, for experiments performed outside of the United States), while clearly informing them that they can drop out of the study at any point and for any reason.\nUnidirectional rotation sessions (six sessions)\nExpose subjects to the unidirectional rotation (steps 3.1–3.4) during six sessions (steps 4.3 and 4.4).\nAt the beginning of each rehabilitation session, perform an SHA test (step 3.4) and calculate the DP value.\n\t\tNOTE: This will provide the pre-rehabilitation DP for that session and long-term post-rehabilitation DP for the previous session.\nDo not perform the unidirectional rotational rehabilitation if the pre-rehabilitation DP value falls in the normal range (<10%) in any of the sessions and instruct the subject to return for the next session.\nIf the pre-rehabilitation DP is in the abnormal range, wait 5 min after the SHA test and perform the unidirectional rotational rehabilitation.",
    "Perform a second SHA test 40 min and 70 min after the end of unidirectional rotation rehabilitation (step 3.4) and calculate the post-rehabilitation DP for this session.\nInstruct the subjects to return for the next session.\nFinal session (week seven)\nPerform an SHA test only (step 3.4) and calculate the DP value.\n\t\tNOTE: This will serve as the final asymmetry measurement.\nDo not use unidirectional rotation in this session.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}