{
  "id": 8271,
  "origin_website": "Bio",
  "title": "Mitochondrial Isolation and Purification from Mouse Spinal Cord",
  "procedures": [
    "Preparation   Put the following items on ice:   Homogenizer + pestles (those should be placed in a 50 ml conical on ice).   50 ml of Buffer M + 0.45% BSA + cOmpleteTM.   50 ml of Buffer M + cOmpleteTM.     Transfer the following items to the cold room: All the items placed on ice.   Pipettes   Pipette tips   Tweezers   Small bucket of water to rinse pestles   Swing out buckets for SW55Ti   UltraClear SW55Ti tubes   OptiPrep     Set up the animal dissection area with:   Euthanasia chamber with Isoflurane   Heavy duty scissors   10 ml syringe filled with PBS   Small plastic weigh trays placed on ice   Tweezers        The start of procedure imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141204/20141204194046_0871.png Figure 1. Procedure for purification of mitochondria from mouse spinal cord using differential centrifugation    Terminally anesthetize the mouse using isoflurane in the euthanasia chamber.   Cervicaly dislocate the animal, decapitate and section the spinal column at the iliac crest (just above the hips). Flush the spinal cord from the spinal column using the 10 ml syringe filled with PBS. Insert the tip at the caudal opening of the spinal column and eject about 5 ml of PBS. This should flush out the spinal cord from the rostral end of the severed spinal column. If a clean flushing of the spinal cord cannot be achieved, section the dorsal column below the front limbs and repeat the flushing procedure. In this case make sure to save the piece of spinal cord located within the small piece of spinal column resulting from the cut below the front-limbs. Place the spinal cord, after removing excess PBS, in the small plastic weigh trays placed on ice.   Weigh the spinal cord rapidly and place it back on ice.   Steps B5 to B18 are all performed in the cold room.",
    "While working in the cold room, transfer the spinal cord with cold tweezers in the 1 ml glass homogenizer on ice. Add 10 volumes of buffer M + 0.45% FA free BSA + cOmpleteTM (e.g. if the spinal cord weighs 60 mg add 600 μl of buffer).   Gently homogenize the tissue on ice with 10-15 strokes (just enough to completely dissociate the tissue) using the cooled loose pestle. Avoid forming air bubbles. Note: Generating bubbles during the homogenization process can lead to disruption of intracellular membranes and denaturing of proteins, both of which should be avoided to reduce damage to the mitochondria.   Gently Homogenize the tissue on ice with 15 strokes using the tight pestle. Avoid forming air bubbles.   Centrifuge at 1,000 x g for 5 min at 4 °C and transfer the supernatant (S1) to a fresh tube on ice.  Note:The 1,000 x g supernatant generated at this step is composed mostly of cytosol with heavy and light membranes. The pellet contains mostly unbroken cells and nuclei.   Resuspend the pellet (P1) in 10 volumes of buffer M + 0.45% FA free BSA + cOmpleteTM and gently homogenize 15x using the tight pestle. Avoid forming air bubbles.  Note:This step is used to further release cytosol and intracellular organelles from the remaining unbroken cells.   Centrifuge at 1,000 x g for 5 min at 4 °C and pool the resulting supernatant (S1) with the supernatant (S2) from the step 8.   Centrifuge the pooled supernatants at 1,000 x g for 5 min at 4 °C.  Note: This step ensures that any contaminating unbroken cells or nuclei are removed from the cytosol/intracellular membrane subcellular fraction.   Collect supernatant (S3) staying clear of the pellet and spin it at 12,000 x g for 10 min at 4 °C.",
    "Prepare Beckman UltraClearTM tubes with 200 μl of OptiPrepTM and 600 μl of Buffer M + 0.45% FA free BSA + cOmpleteTM. Mix well and store on ice.    Discard the supernatant (S4) resulting from step B12 and gently (but thoroughly) resuspend the pellet (P4) using in 150 μl of buffer M + 0.45% FA free BSA + cOmpleteTM.  Note:The 12,000 x g supernatant generated at this step is composed mostly of cytosol with light membranes. The pellet contains mostly heavy intracellular membranes (mitochondria).   Once the pellet is completely resuspended transfer all of it (recording the final volume) into the Beckman UltraClearTM tubes prepared in step B13. Complement with buffer M + 0.45% FA free BSA + cOmpleteTM to make a final volume of 1 ml and mix gently (but thoroughly) with a 1 ml pipette.   Transfer the UltraClearTM tubes to the SW55Ti swing out buckets on ice and centrifuge the tubes in a SW55Ti rotor using a high speed centrifuge at 17,000 x g (equivalent to 13,400 rpm) at 4 °C for 17 minutes (remove breaks).  Note: The heavy membrane fraction is centrifuged in an OptiPrep gradient to remove most of the contaminants (for example myelin and endoplasmic reticulum) from the heavy membrane preparation. The UltraClearTM tubes can be reused if washed well after use (without detergent) and stored dry.   Gently remove the tubes from the buckets and place them on ice. Using gentle aspiration remove supernatant including the top white layer.    Gently resuspend the pellet (P5) in 1 ml of buffer M + cOmpleteTM (without completely dispersing it) and centrifuge at 12,000 x g for 10 minutes at 4 °C.",
    "Note: After the OptiPrep gradient the heavy membranes are resuspended in buffer M without BSA so as to wash off the BSA from the previous steps to more accurately measure the protein concentration in step B20.   Resuspend the pellet (P6) in 10-20 μl of buffer M + cOmpleteTM by gently flicking the tube with your fingers and placing back on ice as quickly as possible. Make sure pellet is completely resuspended before performing the protein quantification. Note: It is important to resuspend the heavy membranes at a high concentration since this reduces damage to the organelles. Resuspending the organelles by flicking also reduces organelle damage.   Estimate protein quantity using a Bradford assay on 1 μl of resuspended pellet. Once the protein concentration is determined, add a final concentration of 0.45% FA free BSA to the suspension using a 4.5% FA free BSA stock to avoid diluting the preparation.  Note: FA free BSA is added back to the heavy membrane preparation after protein quantification to allow for better preservation of mitochondrial activity by reducing uncoupling of the organelle. Ideally mitochondrial activity (oxygen consumption) should be measured on a fraction of the preparation to determine the quality of the organelle and the damage that may have been sustained during preparation."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}