{
  "id": 7750,
  "origin_website": "Bio",
  "title": "Synthesis of Novel MicroRNA-30c Analogs to Reduce Apolipoprotein B Secretion in Human Hepatoma Cells",
  "procedures": [
    "Synthesis of chemically modified novel miR-30c-3p analogs (Figure 1)   Note: Standard phosphoramidites and reagents were available from ChemGenes. Modified antisense miR-30c oligonucleotides were synthesized at one micromole scale using Oligo-800 DNA/RNA solid-phase synthesizer. The system is protected under helium gas. The synthesis proceeds in 3′ to 5′ direction with four main steps per synthesis cycle: detritylation, coupling, capping, and oxidation that adds one nucleotide at the completion of one cycle. All synthesis steps are performed on control-pore glass (CPG-500) that has the first nucleotide base immobilized through succinate linker inside the column.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4574/bioprotoc-12-24-4574-g001.jpg Figure 1. Preparation for RNA synthesis.  (A) Solid phase synthesis empty columns with frits. (B) Column assembled with tow frits that hold the CPG-500 beads in the center, where the synthesis takes place. (C) Securely mound the columns onto the system. (D) Screw on each nucleotide AUCG reservoir, measured and dissolved in anhydrous acetonitrile (ACN).Dissolve the modified and native RNA phosphoramidites separately in anhydrous acetonitrile to a concentration of 0.07 M. Note: 0.07 M is the final concentration for each type of phosphoramidite (modified and native); the volume of anhydrous acetonitrile is determined by the length, sequence, and molecular weight of commercial AUCG phosphoramidites.  Assemble the column with two frits that hold the CPG-500 Å beads in the center, where the synthesis takes place.Employ the Oligo-800 synthesizer in DMTr-off mode to perform automated solid-phase oligonucleotide synthesis of modified miR-30c analogs on a one micromole scale. All the necessary phosphoramidite solutions, including A, U, C, and G, are pre-filled in the synthesis lines and pressure-checked before the synthesis can begin. Note: This is an automatic system; the input sequence is the final synthesized product. The synthesis adds one nucleotide per synthesis cycle, beginning with detritylation and ending with oxidation.",
    "The average time for eight -mers of RNA is 4 h under working pressure of 1.5 bars.  Detritylation is the removal of the 5′ DMT-protecting group on the 3′-end of the oligonucleotide, using 3% trichloroacetic acid in dichloromethane.Coupling is carried out with ETT (0.25 M in acetonitrile) for 12 min.Capping of the 5′-OH is performed using CapA (80% THF/10% acetic anhydride/10% 2,6-lutidine) and CapB (16%  N-methylimidazole in THF) solutionsPhosphate backbone oxidation is performed with 20 mM iodine solution in pyridine/THF/water; the synthesis of phosphorothioate backbones is performed with the sulfurization reagent, DDTT.After the completion of the synthesis cycle, transfer the RNA product into a screw cap tube.Cleave the RNAs from the solid support and deprotect using 800 µL of concentrated aqueous ammonium hydroxide at room temperature for 18 h.Dry the resulting RNA solution in a speed vacuum concentrator (approximately 3–4 h).The Savant DNA/RNA 120 speed-vac concentrator operates at three drying rates—low, medium, and high heat—with temperature ranging from approximately 43°C to 65°C, a displacement capacity of 31 L/min at 50 Hz and 36 L/min at 60 Hz, and maximum vacuum at 7 Torr or 9 mbar. Low or medium heat is preferred for drying to prevent sample denaturing.Redissolve the solid residue with 100 µL of DMSO by vortexing, and desilylate by incubating with 125 µL of Et3N·3HF solution at 65 °C for 2.5 h using a heating block. Desilylation is the removal of silyl moiety.Precipitate RNAs by adding 25 µL of 3 M sodium acetate solution and 1 mL of 100% ethanol and keep at -80 °C for at least 3 h.Centrifuge at 15,000  × g  and 4 °C for 45 min to recover the RNA. Completely dry the RNA under vacuum.Dissolve the RNA in 500 µL of RNase-free water and assess its integrity if necessary.",
    "Perform desalting twice prior to storage at -20 °C. Synthesis of GalNAcαProN3 3 (Figure 1) and 2′-GalNAc-modified RNA strands (Figure 2)  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4574/bioprotoc-12-24-4574-g002.jpg Figure 2. Synthesis of 3-chloropropyl GalNAc 2 and GalNAcαProN3  Dissolve 330 mg (1.5 mmol) of  N-acetyl-D-galactosamine in 5 mL of 3-chloropropanol.Add 0.13 mL (1.8 mmol) of acetyl chloride to the above solution while on ice (approximately 0 °C).Heat the resulting solution at 70 °C for 15 h using a hot plate.Concentrate the solution by speed vacuum using medium heat and purify the residue by silica gel chromatography to get 3-chloropropyl GalNAc 2  .Typical yield of approximately 45% for 200 mg white solid with the following parameters:TLC Rf  = 0.5 (20% MeOH in CH2Cl2) 1H NMR (500 MHz, D2O) δ 4.92 (d,  J  = 4.0 Hz, 1H), 4.15 (dd,  J  = 4.4, 12.8 Hz, 1H), 4.00–3.84 (m, 4H), 3.77–3.72 (m, 4H), 3.62–3.56 (m, 1H), 2.10–2.02 (m, 5H)Dissolve 200 mg (0.671 mmol) of 3-chloropropyl GalNAc 2  in 6 mL of CH3CN by heating the solution.Add 436 mg (6.71 mmol) of NaN3  and 101 mg (0.671 mmol) of NaI to the solution and stir at 60 °C for 15 h.Concentrate the solution by speed vacuum and purify the residue by silica gel chromatography to obtain  GalNAcαProN3 3.   Approximately 54% yield for approximately 110 mg white solid with the following parameters:  TLC Rf  = 0.4 (20% MeOH in CH2Cl2) 1H NMR (500 MHz, D2O) δ 4.94 (m, 1H), 4.21–4.18 (m, 1H), 4.03-3.94 (m, 3H), 3.85–3.78 (m, 3H), 3.59–3.47 (m, 3H), 2.08 (d, 3H), 1.95–1.91 (m, 2H). Note: The synthesis of GalNAc-modified RNA strands begins with synthesizing propargyl-modified RNA oligonucleotides, following protocol A, with commercially available 2′-(O-propargyl)-phosphoramidite building blocks from ChemGenes. The chemically synthesized azido-GalNAc moiety is conjugated to the propargyl RNA via click chemistry with copper as catalyst.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4574/bioprotoc-12-24-4574-g003.jpg Figure 3.",
    "Synthesis of GalNAc-modified RNA strands through Cu(I)-catalyzed  click  reaction  To make GalNAc-modified RNA strands (sequences shown in Tables 1 and 2), add 100 equivalents of azido-modified GalNAc (GalNAcαProN3) to the freshly synthesized propargyl RNA (1 equivalent) in a 1.5 mL Eppendorf tube (i.e., for every microgram of propargyl RNA use 100 µg of azido-modified GalNAc (GalNAcαProN3) to react) (Yadav et al., 2022). Table 1. MiR-30c analogs and sequences containing GalNAc modification  table:",
    "﻿Compound,Short form,Strand,Sequence (5’ to 3’)\nmiR30c-B1,B1,miR-30c-1-3p,(pC)UgGgAgAgGgUuGuUuAcUcC\nmiR30c-B2,B2,miR-30c-1-3p,CuGgGaGaGgGuUgUuUaCuC(pC)u\nmiR30c-B3,B3,miR-30c-1-3p,(pC)uGgGaGaGgGuUgUuUaCuC(pC)u\nmiR30c-B4,B4,miR-30c-2-3p,(pC)UgGgAgAaGgCuGuUuAcUcU\nmiR30c-B5,B5,miR-30c-1-3p,CuGgGaGaGgGuUgUuUa(pC)U(pC)(pC)u\nmiR30c-B6,B6,miR-30c-1-3p,(pC)UgGgAgAgGgUuGuUuA(pC)U(pC)(pC)u\nmiR30c-B7,B7,miR-30c-2-3p,CuGgGaGaAgG(pC)uGuUuA(pC)u(pC)U\nmiR30c-B8,B8,miR-30c-2-3p,(pC)UgGgAgAaGg(pC)UgUuUa(pC)U(pC)u\nmiR30c-B9,B9,miR-30c-1-3p,(pC)(pC)(pC)UgGgAgAgGgUuGuUuAcUcC\nmiR30c-B10,B10,miR-30c-2-3p,(pC)(pC)(pC)UgGgAgAaGgCuGuUuAcUcU\nmiR30c-B11,B11,miR-30c-2-3p,(pC)(pC)(pC)ugggagaaggcuguuuacucu\nUpper case letters: 2′-deoxy-2′-fluoro (2′-F) ribosugar-modified nucleosides; lower case letters: 2′-O-methyl (2′-OMe) ribosugar-modified nucleosides; (pC): 2′-GalNAc clicked cytidines. Table 2. MiR-30c analogs and sequences containing GalNAc and phosphorothioate linkages  table:\n﻿0,1,2,3\nCompound,Short form,Strand,Sequence (5' to 3')\nmiR30c-C1,C1,miR-30c-1-3p,(pC)•U•gGgAgAgGgUuGuUuAcUc•C\nmiR30c-C2,C2,miR-30c-1-3p,(pC)•UgGgAgAgGgUuGuUuAc•U•c•C\nmiR30c-C3,C3,miR-30c-1-3p,(pC)•U•gGgAgAgGgUuGuUuAc•U•c•C\nmiR30c-C4,C4,miR-30c-1-3p,GgGaGaGgGuUgUuUaCuC(pC)•u\nmiR30c-C5,C5,miR-30c-1-3p,GgGaGaGgGuUgUuUaCu•C•(pC)•u\nmiR30c-C6,C6,miR-30c-1-3p,C•u•GgGaGaGgGuUgUuUaCuC(pC)u",
    "Upper case letters: 2′-deoxy-2′-fluoro (2′-F) ribosugar modifications; lower case letters: 2′-O-methyl (2′-OMe) ribosugar modifications; (pC): 2′-GalNAc clicked cytidine; •: phosphorothioate linkagesIn a separate tube, dissolve 22 equivalents of CuBr (100 mM in 25% tBuOH/75% DMSO) in 20% acetonitrile and mix well.Transfer the mixture to the RNA solution and rotate at approximately 20 rpm using the tube revolver rotator at room temperature for 12 h.Precipitate the RNA with 3 M sodium acetate and 1 mL of cold ethanol and store at -80 °C for at least 3 h.Centrifuge the RNA at 18,400 × g for 15 min.Resuspend the RNA pellet in 500 µL of RNase-free water.Desalt the RNA solution using Sep-Pak C18 cartridges.First, condition the cartridge with 1 mL of ACN and equilibrate with 1 mL of RNase free water and 1 mL of 2 M TEAAC buffer. Discard the flow through each time. Load RNA samples dropwise and allow for RNA to bind. Perform three washes with RNase free water, 1 mL each wash, and elute the desalted RNA with 1 mL of 50% ACN. Note: 2 M TEAAC pH 8: in the fume hood, prepare 1 L of stock with 619 mL of distilled water, 268 mL of triethylamine, and 114 mL of glacial acetic acid. Recipe is adopted from the Cold Spring Harbor laboratory.  Concentrate the eluted RNA using the speed vac and check the resulting products by analytical gel electrophoresis with 15% polyacrylamide containing 8 M urea.Make the 15% polyacrylamide gel containing 8 M urea stock solution (500 mL) with 50 mL of 10× TBE, 250 mL of 30% acrylamide/bis stock, and 240 g of 8 M urea. A small analytical gel is made with 6.5 mL of 15% 8 M urea stock solution, 37 µL of 10% APS, and 6.8 µL of TEMED.",
    "Heat the samples at 95 °C for 5 min and cool down on ice for another 5 min. Use 10 µM sample as final concentration after adding loading buffer. Perform the gel electrophoresis under 1× TEB as running buffer at 250 V for approximately 30 min depending on the percentage of the gel. Following electrophoresis, stain the gel with EthBr for 15 min prior to imaging. Cell culture studies with the focus on the effects of GalNAc-modified miR-30c analogs on ApoB, ApoA1, and MTP in human hepatoma Huh-7 cell line  Maintain the human hepatoma Huh-7 cells in DMEM containing 10% FBS and 1% L-glutamine in a 75 cm2  culture flask with vent cap at 37 °C and 5% CO2  in a humidified incubator.Seed the Huh-7 cells in a 6-well plate with 2 mL of aforementioned media at the concentration of approximately 100,000 cells/well.Mix the non-GalNAc-modified microRNAs with RNAiMAX at a ratio of 3:1 and incubate for 30 min at room temperature prior to cell transfection.Add GalNAc-modified microRNAs directly into the cells without the need for liposome-assisted delivery.Change into 1 mL of fresh DMEM (10% FBS) media 72 h post transfection and incubate overnight.Collect media for ApoB and ApoA1 measurements.Wash and harvest the cells in the presence of protease inhibitor cocktail for MTP protein level measurements.Determine the ApoB and ApoA1 levels in the collected media using specific human ApoB/ApoA1 ELISA development kit with 3,3′,5,5′ tetramethylbenzidine substrate. Later, stop solutions in 96-well ELISA plates.Calculate each concentration using ApoB/ApoA1 standard curve prepared in parallel with the experimental samples using the standard provided by the manufacturer.Normalize ApoB/ApoA1 levels to total protein in the respective wells, i.e., set the control microRNA–transfected cells to 100% and modified miR-30c normalized to this value.",
    "Determine the MTP protein levels within the cells, wash the transfected Huh-7 cells with ice-cold PBS, and scrap off the wells in ice-cold buffer K (see Recipes).Lyse the cells by passing them through a PrecisionGlideTM  25G needle.Measure the total protein concentration using the Coomassie (Bradford) protein assay kit prior to MTP detection on western blot."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}