{
  "id": 10854,
  "origin_website": "Jove",
  "title": "Construction of Modular Hydrogel Sheets for Micropatterned Macro-scaled 3D Cellular Architecture",
  "procedures": [
    "1. Preparation of the Micropatterned Molds and Hydrogels\nProduce the desired micro-scale patterns using SU-8 photoresist on the surface of a silicon wafer via a standard two-step photolithography technique15,17 for casting PDMS molds. The example shown uses a liver lobule-like mesh pattern (Figure 1).\nWeigh out PDMS and a curing agent solution with a ratio of 1:5 (i.e., 12.5 g of PDMS and 2.5 g of curing agent).\nMix the 15 g of the solution thoroughly, degas the bubbles in a vacuum chamber, and then spread the mixed solution onto a micropatterned surface of the silicon wafer evenly within a foil casting dish.\nPlace the silicon wafer onto a 65 °C heated plate for 90 min on a flat surface to cure the PDMS.\nRemove the cured PDMS from the casting dish and the silicon wafer.\nCut the edges of the PDMS and place it onto a 100-mm-diameter petri dish with the micropatterned side up.\nWash the micropatterned cured PDMS on the petri dish using 70% ethanol and distilled water for primary sterilization. Then, dry them completely for 10 min in an oven at 65 °C.\nDissolve and mix O/N 3 g of a powdered nonionic surfactant in 100 ml of distilled water, creating a 3% (w/v) coating solution.\nPlace the micropatterned PDMS molds in a plasma cleaner and clean them for 1 min (85 W, 0.73 mbar) to create a hydrophilic surface, to facilitate the addition of aqueous liquids. Then, coat the surface of the PDMS with the 100 ml surfactant solution for at least 3 hr (orO/N) using a laboratory rocker.\nWash the surfactant solution from the PDMS molds and dry them completely in an oven at 65 °C for 10 min. Then, sterilize each micropatterned mold by exposure to ultraviolet (UV) radiation over 30 min.",
    "2. Prepare the Cell Suspension in a Hydrogel Precursor\nTo prepare hydrogel precursor, dissolve 0.1 g of sodium alginate powder in 10 ml of phosphate buffered saline (PBS), creating a 1% (w/v) alginate precursor. To dissolve the powder completely, incubate and mix them O/N.\nFilter the solution through a 0.22 µm filter connected to a 1 ml syringe.\nCulture the HepG2 cells in Dulbecco's modified Eagle's medium (DMEM) supplemented with 10% fetal bovine serum and 1% penicillin-streptomycin on a conventional tissue culture dish until 70% - 80% confluence in a 5% CO2 humidified incubator at 37 °C.\nWash the cells once using PBS, and then trypsinize them by adding 1 ml of 0.05% trypsin-EDTA for 4 min in a 5% CO2 humidified incubator at 37 °C. Centrifuge the cells harvested from the culture dish at 250 x g for 3 min and resuspend using 1 ml of PBS following removal of the supernatant.\nCount the number of single distributed cells in PBS using an automated cell counter.\nFollowing centrifugation at 250 x g for 3 min and PBS removal, add 1 ml of the 1% (w/v) of sodium alginate solution to the remaining cell pellet and mix them gently using pipetting. The final seeding density of the cells should be 5 x 106 - 107 cells/ml. Incubate the cell/hydrogel suspension in a 5% CO2 humidified incubator at 37 °C.\n3. Loading and Cross-linking of Cell/Hydrogel Suspension\nDissolve 1.47 g of calcium chloride dehydrate in 100 ml of ddH2O to produce a cross-linking reagent (i.e., 100 mM CaCl2·2H2O in ddH2O).",
    "Rinse out the interior of a humidifier with ultrasonic transducer using 70% ethanol, and fill it with 200 ml of cross-linking reagent. The humidifier is 110 mm wide, 300 mm long and 170 mm deep (i.e., 110 mm x 300 mm x 170 mm (W x H x D)).\nPlace the micropatterned PDMS molds in a plasma cleaner and clean them for 1 min at 85 W to create a hydrophilic surface.\nSteadily load 7.2 µl of the well-mixed cell/hydrogel suspension at the edge of the micropattern in the mold. The example shown uses a liver lobule-like mesh pattern (Figure 1). The volume of the suspension depends on the topographic pattern.\nTo achieve gelation of the cell/hydrogel suspension, turn on the humidifier and verify that the humidifier produces a mist of the cross-linking reagent. Spray the cross-linking reagent onto the hydrogel precursor for 5 min, covering the topographic surface of the PDMS molds within a range of 5 cm.\n\tNote: Distances longer and shorter than 5 cm could cause incomplete and uneven gelation, respectively. Ensure that the humidifier has a spraying rate of 250 ml/hr, producing 20 ml of mist of the cross-linking reagent in 5 min.\nFollowing the cross-linking process, turn off the humidifier and fill the PDMS molds with PBS.\n4. Handling of Single Modular Hydrogel Sheets\nDetach each hardened hydrogel sheet from the micropatterned molds via pipetting PBS gently around the hydrogel sheet using a 200 µl pipette tip.\nPick up each floating hydrogel sheet using an end-cut 1,000 µl pipette tip end. Each liver lobule-like mesh hydrogel sheet has dimensions of 8 mm x 8.7 mm, and be 100 - 200 µm thick.",
    "Transfer a single layer of the hydrogel sheet into 1 ml of DMEM in a 12-well plate, and culture the cells in vitro in a floating manner using the hydrogel construct as a unit component in the 12-well plate over a week in a 5% CO2 humidified incubator at 37 °C. Exchange the culture medium every other day.\n5. Assembly of Multi-layered Hydrogel Sheets\nRepeat steps 1.1 to 1.5 to produce a PDMS frame with dimensions of 18 mm x 18 mm x 4 mm (W x H x D), and which contains 170-µm-high pillar structures at the lower surface. Use 42 g of the mixture of PDMS and curing agent, with the same ratio as in step 1.2. Place a specialized polycarbonate mold on the silicon wafer for the PDMS frame to create an interior frame with dimensions of 8 mm x 9 mm x 2 mm (W x H x D).\nSterilize the PDMS frame and 180-µm-pore nylon filter papers submerged in distilled water and tweezers in an autoclave for 15 min at 121 °C.\nPlace the sterilized PDMS frame onto a quarter of a piece of nylon filter paper (with a diameter of 5 cm) in a 60-mm diameter petri dish.\nTransfer a modular hydrogel sheet into the interior of the PDMS frame using an end-cut 1,000 µl pipette tip. The hydrogel sheets used for assembly should be cultured for at least a day after they were fabricated.\nAlign the edge of each modular hydrogel sheet with the PDMS frame using an empty 200 µl pipette tip.\nRepeat steps 5.4 and 5.5 using modular hydrogel sheets to form a stack of 4 - 6 layers.",
    "Remove the culture medium by flowing it out through the pillar structures at the bottom of the PDMS frame. Then add 2 µl of alginate solution (2% w/v) at a corner of the multi-layer construct.\nSpray a mist of the cross-linking reagent for 30 sec onto the multi-layer construct to attach the edges of each layer with those of another. Use 2 ml of mist of the cross-linking reagent (at a spraying rate of 250 ml/hr).\nRinse the multi-layered construct gently with 400 µl DMEM and remove the PDMS frame using tweezers.\nDetach the multi-layered construct from the filter paper by gently wiping with a cell lifter following the addition of 4 ml of DMEM.\nTransfer the multi-layered construct to a 6-well plate containing 3 ml of DMEM using filter paper, and culture the cells in vitro in a floating manner, with the hydrogel construct as a multi-scale cellular scaffold in the 6-well plate over a week in a 5% CO2 humidified incubator at 37 °C. Exchange the culture medium every other day.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}