{
  "id": 9502,
  "origin_website": "Jove",
  "title": "DNA Polymerase Activity Assay Using Near-infrared Fluorescent Labeled DNA Visualized by Acrylamide Gel Electrophoresis",
  "procedures": [
    "1. Activity Assay\nNOTE: There are two typical types of assays that are often run to characterize DNA polymerases using the methods described here. They differ in whether they qualitatively characterize overall synthesis (encompassing many steps of DNA synthesis) or whether they quantitatively focus on individual steps. We describe the necessary steps for each of these below.\nNOTE: Because the assembly of materials are relatively complex, for time sensitive experiments, we recommend that all materials are assembled beforehand. The recipes of all critical components of the assay are listed below. Commercial suppliers for components are listed in the Table of Materials.\n10x SF Buffer recipe (10x SFB)\n\tNOTE: In our assays, we typically use the N-terminal truncation of the DNA polymerase I of Thermus aquaticus, commonly known as Stoffel fragment (SF)16,17. The recipe here is the preferred buffer for SF3,13. Other buffers may be substituted depending on the specific DNA polymerase.\n\tNOTE: The final concentration of the 10x SF buffer components are 500 mM Tris pH 8.5, 65 mM MgCl2, 0.5 mg/mL BSA, 500 mM KCl (s), and ultrapure water. Measurements are for 1 mL of SF buffer, which is sufficient for 100-200 assays, depending on the scale. The buffer can be stored indefinitely at -20 °C.\n\t\nCombine 0.5 mL of 1 M Tris, 65 µL of 1 M MgCl2, 50 µL of 10 mg/mL BSA, and 0.0373 g of KCl (s) in a 1.5 mL tube. Add 385 µL of ultrapure water to reach a final volume of 1 mL.\n1x Storage Buffer recipe (1x SB)\n\tNOTE: The final concentration of the 1x buffer components are 50 mM Tris pH 7.5, 1 mM DTT, 0.6 mM EDTA, and 50% glycerol. The recipe makes 20 mL of 1x SB.",
    "Combine 0.012 g DTT, 100 µL of 0.5 M EDTA, and fill a 50 mL conical tube with 40 mL of 100 mM Tris (pH 7.5) to make 2xSB. Mix by vortexing.\nTransfer 10 mL of 2x SB to a new 50 mL conical tube and dilute with glycerol by adding 10 mL glycerol to the new conical.\nQuenching buffer orange (QBO) recipe\n\tNOTE: When radioactive labels are used, users will often employ bromophenol blue and/or xylene cyanol as a tracking dye for electrophoresis progress. However, these dyes will weakly fluoresce in the near-infrared region, interfering with the DNA signal. Thus, we use Orange G in their place for all reactions that contain samples. While we have found Orange G to be suitable for tracking gel loading, we have found Orange G to be less consistent as a dye that tracks electrophoresis progress; thus, we run empty lanes containing bromophenol blue on the external lanes of the gel that do not contain sample in order to track the gel progress.\n\t\nCombine 950 µL of 95% formamide with 25 µL of 0.5 M EDTA, and 25 µL ultrapure water. Add 1 scoop of orange G dye (~10 mg). Mix by vortexing.\n\t\tCAUTION: Formamide is toxic; wear personal protective equipment (PPE) such as gloves, eyeglasses and lab coat, and dispose as hazardous waste.\n2. Assay Run\nQualitative characterization of overall activity",
    "NOTE: For this assay, we typically maintain constant concentration of M-NTPs and vary time. The goal is to evaluate the overall characteristics of the protein rather than to measure any individual step. To prepare one reaction, an equal volume of two separate components, the duplex mix (described in step 2.1.1) and the dNTP mix (described in step 2.1.2), will be prepared separately, and then combined to give the final volume of 49 µL. The addition of 1 µL 50x enzyme will then initiate the reaction. Variable time points can be taken; typically, we quench at 0, 5, 15, and 60 min.\n\t\nPreparation of DNA duplex mix\n\t\tNOTE: The duplex mix is composed of 10x SF buffer, primer oligonucleotide, template oligonucleotide, and ultrapure water. Total volume added to each reaction is 25 µL. 1 µL of enzyme will be added to the master mix immediately preceding the initiation of the experiment.\n\t\tNOTE: For our assays, we typically use a 45-mer template and an 18-mer or 23-mer primer. While a number of different lengths can be used, we tend to use this length because the products (ranging from 18 nucleotides to 45 nucleotides) are easily resolved on a single nucleotide level using the described gel electrophoresis protocols. As oligonucleotide products increase in length, it may be challenging to resolve the products at single nucleotide resolution.\n\t\tNOTE: In our experiments, we use a 5' near-infrared fluorescent dye label on the primer strand to observe the primer products. We purchase custom synthesized oligonucleotides bearing this modification; however, this label can be incorporated using any number of post-synthetic labeling strategies. The template oligonucleotide is not labeled and so it is not observed using the gel imager. For both oligonucleotides, we store the oligonucleotides at 100 µM in 10 mM Tris (pH 8), 1 mM EDTA.",
    "NOTE: Because we are observing only the primer, a two-fold excess of template is used to ensure that all primers (the DNA species that is being observed) are annealed to the template. The final duplex concentration in this reaction is 40 nM.\n\t\tNOTE: Near-infrared fluorescent dyes are often somewhat light sensitive; when possible, we cover the primer (and any solution containing the primer) with foil. This includes the polyacrylamide gel while it is running.\n\t\tNOTE: Below is a representative example of synthesis of 2'F M-DNA.\n\t\t\nDilute primer 1 and template 1 (see Table of Materials for sequence) to 1 µM each in ultrapure water.\nFor each assay reaction, in separate tubes, combine 5 µL of 10x SF buffer, 2 µL of 1 µM primer 1, 4 µL of 1 µM template 1, and 13 µL of ultrapure water in tubes compatible with a thermal cycler.\nAnneal the duplex in a thermocycler using the following program: 98 °C for 2 min, 70 °C for 5 min, 50 °C for 5 min, 40 °C for 5 min, hold at 25 °C. The specific program may vary depending on the annealing temperature of the primer/template duplex. Typically, we prefer to include at least one 5 min step at the annealing temperature, and then another 5-min step at a temperature 5 - 10 degrees below the annealing temperature.\nPreparation of 2x dNTP mixture\n\t\tNOTE: Depending on the experiment, it is possible to use variable dNTPs and concentrations of dNTPs. Typically, we use 50 - 200 µM in the reaction.\n\t\t\nPrepare a 25 µL solution containing 100 µM of each 2'F-NTP. Store the M-NTPs at 100 mM.\nPreparation of 50x protein dilution",
    "NOTE: For long term storage, enzymes should be kept at -20 °C in 1xSB. When removed from the -20 °C freezer, enzymes should be kept on ice at all times prior to addition to the master mix. Enzyme dilutions should be made fresh from the concentrated stock each day. The concentrated enzyme stock should be returned to the -20 °C freezer immediately after use.\n\t\tNOTE: Because we primarily evaluate mutant DNA polymerases, we only use enzymes that have been expressed and purified in our laboratory using established methods9,10. For commercially purchased polymerases, users should be wary of optimal buffers for different proteins and their compatibility with the buffers described herein.\n\t\tNOTE: Enzyme concentrations will vary for each experiment. Here, we show a representative example for 2'F-DNA synthesis.\n\t\t\nTo make a 10 nM enzyme solution, dilute 1 µL of enzyme into 1x SB to make a 50x final enzyme concentration. The concentration of the 50x solution should be 500 nM. For example, if the stock enzyme concentration is 50 µM, add 1 µL stock enzyme to 99 µL 1x SB.\n\t\t\tNOTE: Since the enzyme is typically stored in 50% glycerol, the solution is fairly viscous. Even if using highly accurate pipettes, we do not recommend pipetting less than 0.5 µL, considering the importance of accuracy and precision during enzyme dilution.\nInitiation of assay\n\t\t\nSet the temperature of a dry bath to 50 °C.\nAdd 24 µL of the annealed duplex mix (see step 2.1.1) to 25 µL of 2x dNTPs (see step 2.1.2).\nRemove 9.8 µL of the mixture in step 2.1.4.2 and add to 20 µL of QBO (see section 1.3 for recipe). This aliquot serves as a \"no enzyme\" control and should be obtained for each run.",
    "Add 0.8 µL of 50x enzyme (see step 2.1.3.1) to the duplex/dNTP mix. Pipette up and down with a large volume micropipette to thoroughly mix.\nAfter 5, 15, and 60 min, quench the reaction by removing 10 µL of each reaction solution and adding to a microcentrifuge tube containing 20 µL QBO (described in section 1.3).\nOnce quenched, reactions can be stored under foil indefinitely at 4 °C or -20 °C.\n\t\t\tNOTE: For quantitative characterization of individual steps of M-DNA synthesis, a very similar assay can be run to quantitatively obtain Michaelis-Menten parameters. This assay uses all of the same materials. Michaelis-Menten parameters can be measured for the dNTP; in this case, the most significant difference is that, rather than adding the duplex mix to dNTP mix, it adds the duplex mix with enzyme to a series of 2x dNTP solutions. Similarly, Michaelis-Menten parameters can be measured for DNA duplex. Specific conditions must be met to satisfy the assumptions needed to use the Michaelis-Menten equation. These conditions, and the basic mechanics of the assay, are well explained in a previous methods article11.\n3. Gel Electrophoresis\nNOTE: Because pouring the gel is time sensitive, all materials are assembled beforehand. The recipes of all critical components of the assay are listed below; suppliers are listed in the Table of Materials.\nPreparing acrylamide for 20% acrylamide gel.\n\tNOTE: This recipe makes 1 L of acrylamide mixture; approximately 120 mL of this solution is used per gel. Store this solution at room temperature under foil for up to one year.\n\tCAUTION: Polyacrylamide is neurotoxic. It is important to wear gloves and a lab coat during all steps of gel pouring. If polyacrylamide gets on gloves, replace the gloves immediately. If acrylamide is not polymerized, place the contaminated materials in a labeled polyacrylamide waste bag.",
    "NOTE: Premixed 40% acrylamide containing 38.67% acrylamide and 1.33% bis-acrylamide for a monomer to cross-linker ratio of 29:1 was used in this protocol.\n\t\nWeigh 17 g of premixed TBE powder. Weigh six separate portions of 70 g of urea (total of 420 g).\n\t\tNOTE: The urea must be added in portions. We find it best to split it into six portions.\nSet up a 2 L plastic beaker on a stir plate. Add a single large stirring rod to the beaker. Cover the beaker with foil when mixing to prevent splashing.\nAdd 500 mL of 40% acrylamide solution into beaker. Make sure the solution is stirring.\nAdd previously weighed-out TBE. Add one aliquot of urea. Allow solution to mix. Urea dissolves slowly and may appear hazy and white upon initial addition. Slowly add the remaining aliquots of urea into the mixture over the next hour. Let the solution mix until it is completely clear and colorless.\n\t\tNOTE: Typically, allow this to stir overnight. If the solution is still not dissolved, add small aliquots of water and wait for the urea to dissolve.\nThe addition of urea will increase the volume close to 1 L. Add water to increase the volume to exactly 1 L.\nStore in a 1 L tinted glass bottle or cover the glass bottle with aluminum foil.\nPouring of acrylamide gel.\n\tNOTE: When handling glass plates, be careful to avoid contact between the glass plates and any hard surface. This is particularly important in that rough handling may cause small cracks in the glass; these cracks may not be visible until the gel is running, which occurs at a higher temperature. We use cork rings to prevent this unwanted contact.\n\t\nClean plates",
    "Acquire two 33 cm x 42 cm gel plates, one notched and one unnotched plate. Place plates on separate cork rings.\nRinse plates thoroughly with soap and water. Make sure there are no soap streaks or gel spots left behind.\nMake note of which side of the plate beads less water. This side is the gel facing side.\n\t\t\tNOTE: If the gel is run on the other side of the plate, it may make the gel transfer challenging.\nDry plates\n\t\t\nUse paper towels to dry both faces of each plate.\nUse delicate task wipers to dry remaining areas. Pay special attention to the edges of plates where tape will be applied.\nRinse the glass plates with ~70% ethanol, and wipe with task wipers.\nMake sure there are no paper towel fibers or water droplets. These can cause bubbles when pouring the gel.\nAdd spacers\n\t\t\nAcquire 0.75 mm spacers. Run gloved fingers under DI water and gently wet the spacers with gloved fingers.\nPlace spacers along the long edges of the notched plate. Clean up any water that is splashed on the rest of the plates. Make sure spacers are aligned with the glass plate and not hanging over the edge.\nSeal gel\n\t\t\nPut on dry gloves. Dry the edges of the glass again with delicate task wipers.\nAlign the unnotched plate top above the notched plate, and slowly lower down to press the plates against each other. Check again to be sure that the edges of all plates are aligned.\nUsing gel tape, place the tape across all the edges except for the top. Make sure tape is aligned evenly and sealed tightly. Tape can be applied in one motion, or each side can be done individually. Cut the ends of the tape with a razor.",
    "Add an additional layer of tape to the bottom of the gel. The tighter the tape, the less likely the gel will leak when pouring.\nClip the sides of the glass sandwich with the white clamps. Add 3 clips to each side, and 4 clips to the bottom.\nPouring the gel\n\t\t\nMake 3 mL of 10% ammonium persulfate solution (APS) by dissolving 0.3 g ammonium persulfate and diluting up to 3 mL in ultrapure water.\n\t\t\tNOTE: 1.2 mL of APS is needed per gel. Date the tube after making it. APS solution expires in 2 weeks, and should be kept at 4 °C.\nTransfer 125 µL of tetramethylethylenediamine (TEMED) to a separate microcentrifuge tube.\n\t\t\tNOTE: TEMED is toxic; wear PPE such as gloves, eyeglasses and lab coat whenever handling.\nAcquire a squirt bottle and remove the pointed funnel. Measure out 125 mL of water in a graduated cylinder and add to the bottle. Mark the water level on the outside of the bottle with a permanent marker. Discard the water. This modified squirt bottle can be reused indefinitely with proper cleaning (see below).\nSet up the corked rings next to the sink so there is a place to put the gel once it is poured. Place the plate sandwich here. Put a cork in the sink so there is a place to sit the plates on while the gel is being poured. The gel will be poured into the glass plate sandwich at an angle, so the bottom will rest on the cork while the top will rest on the edge of the sink. Make sure there are pads underneath these areas in case polyacrylamide pours off.",
    "Place APS solution and TEMED solution on the other side of the sink, with the empty squirt bottle. Place the well comb with the desired number of wells on the side of the sink with the plates. Put 4 clamps nearby.\n\t\t\tNOTE: The next step in the procedure is very time sensitive. Be prepared to move quickly through these steps. There is a limited amount of time to get the mixture between the plates before it polymerizes. All components (micropipettes preset to correct volume, solutions, glass plates) are carefully arranged to pour the gel as quickly as possible. If a slower polymerization is desired, APS and TEMED concentrations can be halved; this will, however, require a longer polymerization time.\nPour the 20% acrylamide gel solution into the squirt bottle to the marked point. Pour a little more gel solution above the marked line, so there is enough solution in the case of small leaks. This is approximately 120 mL of gel solution.\nAdd 120 µL of TEMED and 600 µL of APS to the polyacrylamide gel solution in the squirt bottle at the same time. Quickly add an additional 600 µL of APS to the polyacrylamide gel solution.\nSwiftly cap the squirt bottle and swirl. Place the plate sandwich in the sink.",
    "Begin pouring. This should only take 1-2 min in order to avoid polymerization. Slowly, but steadily, add pressure to the squirt bottle so the gel solution comes out evenly. If the solution starts spattering irregularly from the squirt bottle, release the pressure so the bottle becomes inflated, and resume pouring. Watch to make sure the gel solution is covering all areas, and it is not leaking from any of the sides. To remove air bubbles, change the angle of the plates. The bubbles will pop at the top, and will run faster if the angle is steeper. Continue pouring until the solution has reached the top of the notched area, and is slightly overflowing the notched edge. Remove all air bubbles.\n\t\t\tNOTE: If the plate sandwich leaks, or there is not enough gel solution and the solution does not reach the top of the plates, the gel cannot be used. Wait until the gel has polymerized, and clean accordingly.\nAdd the well comb to the plate sandwich. Place 4 clamps on the comb to press down and allow for even distribution of the wells.\nQuickly dispose of the remaining gel solution in the squirt bottle into labeled polyacrylamide waste. Rinse out the squirt bottle with DI water 2 - 3 times, through the squirt nozzle.\n\t\t\tNOTE: It is important to perform this cleaning quickly to prevent polyacrylamide from clogging in the squirt bottle. If even a small amount of polymerization occurs within the nozzle, the next gel will be poured too slowly and not successfully. Discard squirt bottle if polymerization occurs.\nRunning the acrylamide gel\nWhile gel is being polymerized, make 1x TBE running buffer. Dissolve 17 g of premixed TBE solid into 1 L of ultrapure water. Shake buffer until all of TBE is dissolved.",
    "Remove all the binder clips from the plate sandwich.\nUse a razor to cut the tape and remove tape from all the edges of the plate sandwich.\nClean off all the polymerized gel from the glass surfaces. Use a razor along the edges to scrape off remaining gel. Wipe the plates with paper towels and water to remove as much polyacrylamide residue as possible. Excess acrylamide and/or tape can often burn during gel electrophoresis.\nRemove the well comb by pushing it out evenly on both sides.\nUse a razor to cut off the excess gel along the top of the plate sandwich. Slice along the notched edge of the plate.\nUse a syringe and DI water to rinse the wells and remove debris in the wells. Make sure each well can be filled with water, and is not blocked by excess polymerized gel.\nPlace the plate sandwich into the apparatus, so that the longer plate is facing outward, and the notched space is facing inward.\nAdd clips to clip the plate sandwich and aluminum plate together with the apparatus. Add to the outside of the plate to promote even running.\nAdd TBE buffer to cover the base notches and just enough to cover the wells at the top. TBE buffer can be filtered and reused for approximately 5 gels.\nWarm plates for 20 min by running the gel electrophoresis at 50 W.\nAfter warming the plates, clean the wells. Use a syringe and the TBE buffer in the baths to squirt the remaining buffer salts from the wells. Do this several times to ensure clean wells. If the wells are not clean, the bands will fray and the image will not be interpretable. Although this can be time consuming, we have found it imperative to obtaining good data.",
    "To the outermost lane on both sides, pipet 5 µL of 95% formamide with bromophenol blue. This is the same solution as QBO, but with bromophenol blue in place of Orange G. This will provide a visual on where to cut the gel for imaging, and how far down the DNA has run.\nFor each sample to be analyzed (generated in section 2.1.1), add 3 µL to a single well of the gel. After loading all samples, wait 1 min for samples to settle.\nPut caps on both the top and bottom plastic baths. Attach the wires to the apparatus. Red indicates the positive electrical charge, so it should be at the bottom so that the DNA runs downwards.\nAttach wires to a power source and set to 50 - 55 W. Run the gel for approximately 3 h or until the bromophenol blue dye front has run at least 2/3 down the gel.\nImaging the gel\n\tNOTE: This gel is extremely thin and can be difficult to handle. Great caution must be taken to prevent ripping and loss of the entire gel.\n\tNOTE: Depending on the DNA label, it may require using different gel imagers. This protocol uses near-infrared fluorescent dyes and imaging of samples was performed on a gel imager (see Table of Materials). The protocol is specifically written for that imager.\n\t\nWhen the bromophenol blue dye front has run at least 2/3 down the gel (~ 28 cm), the gel can be stopped by turning off the power. Remove the gel from the apparatus and place on cork rings.",
    "Separate the plates with a small wedge plate separator. Place the separator at the inside corner of the notches to pull up. Use caution and do not use excessive force; the notches can break if too much pressure is applied.\nOnce suction between the plates are released, carefully lift the top plate and determine which plate the gel is on. If the gel sticks on the bottom plate, pull top plate off and place on cork ring. If the gel is on the top plate being lifted, move slowly and the gel may fall back to the bottom plate. If the gel does not fall, again move slowly and pull the remaining part of the gel from the bottom plate, and place the top plate with the gel on a separate cork ring.\nOnce the plates are separated, see where the dye is on the gel and remove excess gel from the top and bottom of the gel. Typically, with our constructs, using either an 18 or 23 nucleotide primer and a 45 nucleotide template, there is no DNA between the bromophenol blue dye front and the bottom of the gel. Cut vertically from the dye to the top of the gel. The spaces between the dye and the edges of the gel also have no DNA. Lastly, cut a couple inches below the well space on the gel. There are no nucleic acids at the very top of the gel.",
    "NOTE: Cutting the gel into the smallest size possible makes it significantly easier to transfer onto the imaging device. If the gel is too large, it is more susceptible to ripping during transfer. While we often trim the gel prior to imaging, we recommend using extreme caution when trimming as relevant data can be lost if care is not taken. To check whether removed portions contain additional data, we will often perform an additional scan of the excised portions of the gel to ensure that no data were lost.\nCoat the gel with water to prevent drying out.\nClean the imager surface. Using task wipers, wipe down the surface with water and ethanol. Add a thin coat of water to the surface where the gel will be placed.\nTransfer the desired portion of gel to the wet surface of the Li-Cor.\nRemove air bubbles by gently pressing them out from the gel, and wiping with a task wiper. Use caution as it is very easy to rip the gel by pushing the air bubbles too hard.\nImage the gel according to the manufacturer's protocols. Analyze the gel using available software for the imager.\nWhile the gel is being imaged, clean the work space by removing excess acrylamide gel, washing plates, and filtering the TBE buffer to be reused.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}