{
  "id": 6454,
  "origin_website": "Bio",
  "title": "Non-radiometric Cell-free Assay to Measure the Effect of Molecular Chaperones on AMP-activated Kinase Activity",
  "procedures": [
    "The major steps of this protocol and the different plates used are outlined in Figure 1.Prepare screening compound(s)–Plate 1Note: The compound(s) to be screened can be set up in a 96 MWP or PCR strip tubes. Prepare the test compound(s). The compound(s) will be diluted 10-fold when added to the wells containing AMPK. Therefore, your need to initially prepare your starting compound(s) solution to be 10-fold higher than your final highest test concentration. In our example, started with CHIP at 140 µM, meaning in the initial reaction with AMPK, the concentration will be 10-fold less (14 µM). Also, in our example, 50 µl of compound per concentration was sufficient, however, make sure enough compound is prepared for your entire experiment.Prepare concentrated stock solution of compound. In our example, we started with 140 µM CHIP diluted in 1x HEPES storage buffer. Use the appropriate buffer for your compound and see the manufacturer’s instructions for the effect of buffers and additives. Prepare serial dilutions of the compound of interest 1:5, seven times in 1x storage buffer using a 96 MWP or strip tubes. For each dilution, add 8 µl of the previous dilution to 32 µl of 1x storage buffer. In a ninth tube, pipette only storage buffer. You should have eight dilutions of your compound in a format that is ready to use with a multichannel repeat pipettor (Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190415/20190415232822_4939.jpgFigure 1. Assay workflow. The major steps of the assay and the different plates used are outlined. PCR strips can be used in place of the 96 MWP for Plate 1 and/or Plate 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190415/20190415232857_6452.jpgFigure 2. Plate 1: Test compound to be screened. A total of 8 concentrations as well as a buffer control is used. The buffer should be same composition as the solution used to prepare the test compound.",
    "PCR strips can be used in lieu of 96 MWP.Prepare AMPK dilutions–Plate 2Note: The kinase dilutions can be set up in a 96 MWP or PCR strip tubes. Dilute the AMPK holoenzyme to 730 nM in a final volume of 600 µl in 1x kinase buffer A.Prepare two serial dilutions of AMPK, 1:10, in 1x kinase buffer A. For each, add 60 µl of the previous dilution to 540 µl 1x kinase buffer A. You should have three concentrations of AMPK.Aliquot 18 µl of each AMPK dilution into either 96 MWP or strip tubes using a repeat pipettor.Using a multichannel pipettor, add 2 µl of the compound of interest dilution series (Figure 2) including the blank buffer sample to each strip of AMPK (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190415/20190415232931_1992.jpgFigure 3. Plate 2: Layout of AMPK dilutions. A total of 9 wells per AMPK concentration are prepared in Plate 2. This plate will be used to prepare the test plate (Plate 3). PCR strips can be used in lieu of 96 MWP.Incubate at 30 °C for 30 min with shaking.Quickly spin plate or strips to ensure the volume of the reaction is at the bottom of the well/tube.Prepare reaction plate–Plate 3Note: You will now be moving reactions from either a 96 MWP or PCR strips into a 384 MWP. This is easily accomplished with a multi-channel repeat pipettor. The spacing difference between wells going from 96 to 384 MWP is halved, meaning in this example, when you use a standard multichannel pipettor, samples 1-9 in Plate 2 will be aligned to the first 9 odd rows in the 384 MWP (Plate 3). Using a multi-channel repeat pipettor in the horizontal orientation set at 3 x 5 µl, add 5 µl of each reaction into the 384 MWP.",
    "This approach uses every-other column in a 384 MWP (in this example, odd columns, 1-17, Figure 4). With the repeat pipettor, add 5 µl 1x kinase buffer A to each well in rows J and K (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190415/20190415232956_0351.jpgFigure 4. Layout of reaction plate. A total of 9 replicate wells per AMPK concentration are prepared. These replicates are for the eight compound dilutions (and buffer control).Prepare enough of the 2x ATP/Z’-LYTETM mixture per manufacturer’s instructions to account for the number of wells used in the experiment (5 µl per well is needed for all wells except row K). The optimal concentration of ATP should be optimized per the manufacturer’s directions, however we found using our in-house AMPK preparations, the Km apparent was 50 µM. For this experiment we used 6 µl 10 mM ATP, 2.4 µl of 1 mM Z’-LYTETM peptide, and 591.6 µl 1x kinase buffer A. This yields a final ATP and peptide concentration in the reaction of 50 µM and 4 µM, respectively.Prepare the phospho-peptide solution per manufacturer’s instructions (in our example, we added 1 µl phospho-peptide to 249 µl of 1x kinase buffer A).Add 5 µl phospho-peptide solution to all wells in row K.Add 5 µl ATP/Z’-LYTETM mixture to all wells in rows A-J.Shake plate at low speed for 30 s.Incubate on benchtop at room temperature for 1 h.Prepare development solution per manufacturer’s instructions. Please note, this varies from lot to lot. Refer to the Development Reagent Certificate of Analysis enclosed with the kit. The Certificate indicates the correct dilution for each lot of Development Reagent into Development Buffer. Add 5 µl development solution in each well.Shake plate at low speed for 30 s.Incubate on benchtop at room temperature for 1 h.Add 5 µl stop reagent in each well.",
    "(You will need about 650 µl total)Shake plate at low speed for 30 s.Read in plate reader per manufacturer’s instructions."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}