{
  "id": 13272,
  "origin_website": "Jove",
  "title": "CRISPR/Cas9 Technology in Restoring Dystrophin Expression in iPSC-Derived Muscle Progenitors",
  "procedures": [
    "All animal handling and surgical procedures were performed by a protocol approved by the Augusta University Institutional Animal Care and Use Committee (IACUC). Mice were fed standard diet and water ad libitum.\n1. Isolation of primary mouse ﬁbroblasts from adult Dmdmdx mice\nEuthanize adult Dmdmdx mice (male, 2 months old) by CO2 asphyxiation and thoracotomy according to IACUC approved by Medical College of Georgia, Augusta University. Cut the tail with a sterile scalpel in a sterile condition under the laminar hood. Rinse the tail with 70% ethanol for 5 min, and then wash with sterile phosphate-buffered saline (PBS) in a 6 cm dish.\nPeel the tail skin off by a sharp incision from the base to the tail tip along the tail skin, and then gently peel off the tail skin with tweezers. Mince the skin to a size of 1 mm3 using a sterile scalpel and move the minced skin tissue to a 6 cm dish in Dulbecco’s minimal essential medium/Ham’s F12 (DMEM/F12) containing 0.1% collagenase IV and 1 U/mL of dispase.\nDigest the skin tissue in a culture dish for 2 h at 37 °C in a 5% CO2 incubator.\nCoat a 6-well plate with fibronectin and 0.2% gelatin (1 mL of fibronectin in 199 mL of 0.2% gelatin; Table of Materials) and incubate at 37 °C for 1 h.\nDissociate the digested skin tissue with a 1 mL pipet tip and transfer the tissue and supernatant to a sterile 15 mL conical centrifuge tube. Centrifuge at 217 x g for 3 min at room temperature, discard the supernatant and resuspend the pellet in 1.5 mL of fibroblast medium (Table of Materials).",
    "Culture the pellets including incomplete digested skin tissue from step 1.5 on the 6-well plate coated with fibronectin and 0.2% gelatin from step 1.4 in a 37 °C, 5% CO2 incubator. Replace the medium 24 h after the initial plating to remove unattached cells, and change the medium every 48 h.\n2. Reprogramming mouse skin fibroblasts into iPSCs\nTwo days before transduction, digest mouse dermal fibroblasts from step 1.6 with the cell detachment solution (Table of Materials) in a 37 °C incubator with a humidified atmosphere of 5% CO2 for 5 min.\nCount cells using a hemacytometer and centrifuge at 217 x g for 3 min.\nSeed cells at a density of 1−2 x 105 cells per well onto a 6-well plate and culture with fibroblast medium (Table of Materials) in a 37 °C incubator with a humidified atmosphere of 5% CO2.\nOn the day of transduction (day 0), estimate the cells and calculate the volume of each virus required to reach the target multiplicity of infection (MOI) of 5, 5, and 3 (i.e., KOS MOI = 5, hc-Myc MOI = 5, hKlf4 MOI = 3) according to the commercial manual.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59432/59432equ01.jpg\nThaw three Sendai tubes in a 37 °C water bath for 5−10 s and add the calculated volumes of each of the three Sendai tubes to 1 mL of fibroblast medium (Table of Materials).\nRemove the fibroblast medium from step 2.3 and add the reprogramming virus mixture to the wells containing the cells. Incubate the cells overnight in a 37 °C incubator with a humidified atmosphere of 5% CO2.\nReplace the medium with fresh fibroblast medium 24 h after transduction. Culture the cells for one week with medium exchange every other day.",
    "Harvest infected mouse fibroblasts on day 7 after transduction with 0.05% trypsin/EDTA and place on dishes that are previously coated with fibronectin and 0.2% gelatin.\nCulture the infected mouse fibroblasts from step 2.6 with complete mouse embryonic stem cell (ES) growth medium (Table of Materials) in a 37 °C incubator with a humidified atmosphere of 5% CO2 and change medium daily.\nFrom the 8th day, observe the plate under an inverted microscope every other day to identify the appearance of cell clumps with the morphology of mouse ES.\n3. Using alkaline phosphatase live stain and flow cytometry to quantify reprogramming efficiency\nRemove the culture media from each well and rinse with DMEM/F-12 for 2−3 min.\nApply 2 mL of 1x alkaline phosphatase (AP) live stain working solution (1:500 dilution in DMEM/F-12) to the adherent cells, and incubate in a 37 °C incubator with a humidified atmosphere of 5% CO2 for 30 min.\nAspirate the AP live stain and wash twice with PBS for 5 min each.\nDigest the cells with the cell detachment solution (Table of Materials) in a 37 °C incubator with a humidified atmosphere of 5% CO2 for 5 min. Perform flow cytometry to determine the reprogramming efficiency.\n4. Selecting and harvesting ES-like cells\nExamine the colonies from step 2.8 under an inverted microscope.\nMark the colonies at the bottom of the dish with a self-inking object marker.\nApply greased cloning rings to cover the marked cell colonies. Add 100 μL of 0.05% trypsin/EDTA to each cloning ring at 37 °C for 5 min, and then transfer the digested cells with 100 μL pipette tips to 48-well culture plates containing mES growth medium.",
    "Incubate the cells in 48-well culture plates in a 37 °C incubator with a humidified atmosphere of 5% CO2. Passage the cells to 6 cm dish when they reach 70% confluence.\nRepeat steps 4.3 and 4.4 for several times until uniform dorm-shaped clones are obtained.\n5. Freezing iPSCs for cryopreservation\nDissociate the selected iPSCs from step 4.5 with trypsin, versene, and chick plasma (TVP; Table of Materials) solution at 37 °C in a 5% CO2 incubator for 30 min.\nCollect the cells in a sterile 15 mL conical tube and centrifuge at 217 x g for 3 min at room temperature.\nAspirate the supernatant and re-suspend the cell pellet in 2 mL of mouse ES frozen medium (Table of Materials) to obtain 1 mL per cryovial.\nAdd cells to cryovials and freeze using a freezer container that provides the critical, repeated -1 °C/min cooling rate required for cryopreservation at -80 °C overnight.\nTransfer frozen vials into a liquid nitrogen tank.\n6. Immunofluorescence staining for stem cell markers in iPSCs\nSeed iPSCs from step 5.1 cultured with mES medium into an 8-well chamber slide coated with poly-D-lysine/laminin (Table of Materials) at the appropriate density to achieve between 1−2 x 104 cells per well and incubate in a 37 °C incubator with a humidified atmosphere of 5% CO2 for 48 h.\nImmerse the slides in 4% formaldehyde for 15 min at room temperature, and then immerse the slides in PBS twice for 5 min each time.\nIncubate sections with a mouse IgG-blocking reagent (Table of Materials), and 5% goat serum for 1 h at room temperature.",
    "Dilute the primary antibodies in protein diluent (mouse-anti-SSEA1, 1:100, rabbit-anti-Nanog, 1:500; rabbit-anti-POU class 5 homeobox 1 [OCT4], 1:500; rabbit-anti-SRY-box 2 [SOX2], 1:500; rabbit-anti-Lin-28 homolog A [Lin28A], 1:400) (Table of Materials). Apply antibodies to the cells and incubate at 4 °C overnight in a humidified chamber.\nDiscard the primary antibody solution and wash the slides 3x in PBS.\nApply second antibodies (Alexa488-conjugated goat-anti-mouse antibody and Alexa555-conjugated goat-anti-rabbit, 1:400 each) in M.O.M. protein diluent on slides and incubate for 45 min at room temperature.\nWash the slides 3x in PBS and mount sections with mounting medium containing 4’6-diamidino-2-phenylindole (DAPI).\nTake pictures with a confocal microscope.\n7. Investigating the pluripotency of iPSCs in vivo\nDissociate the iPSCs from step 5.1 into single cells using TVP solution in a 37 °C incubator with a humidified atmosphere of 5% CO2 for 30 min.\nCount cells using a hemacytometer and centrifuge at 217 x g for 3 min.\nAspirate the supernatant and resuspend the pellet with mES medium in a 1.5 mL sterile centrifuge tube at a concentration of 5 x 105 cells/30 μL for cell transplantation.\nRemove hair from both hind limbs of immunodeficient mice using hair clippers.\nAnesthetize mice with ketamine (100 mg/kg) and clean the injection site with 75% alcohol.\nInject 30 μL of iPSC suspension from step 7.3 intramuscularly into the gastrocnemii, using a 31 G needle.\nTwo weeks after the injection, harvest the mouse gastrocnemii and embed in optimal cutting temperature (OCT) compound, snap freeze and cut into 5-μm sections15,16.\nFix sections in 4% formaldehyde for 15 min at room temperature, and then wash the slides twice in PBS for 5 min each time.\nBlock the cells with 5% goat serum protein diluent for 1 h at room temperature.",
    "Add diluted primary antibody (rabbit anti-AFP, 1:50; rabbit anti-SMA, 1:50; rabbit anti-TH, 1:50) to the slides and incubate at 4 °C overnight in a humidified chamber.\nDiscard the primary antibody solution, wash the cells 3x (5 min/wash) in PBS, add a 1:400 diluted Alexa555-conjugated goat-anti-rabbit antibody to slides, and incubate for 45 min at room temperature.\nWash slides 3x (5 min/wash) in PBS, and mount sections with mounting medium containing DAPI.\n8. Construction of CRISPR/Cas9 lentiviral vector targeting introns flanking dystrophin exon 23\nDesign two pairs of gRNA oligos targeting intron-flanked dystrophin exon 23 via http://crispor.tefor.net/crispor.py.\n\tNOTE: The designed pairs are as follows:\n\ti22sense: 5’-CACCGTTAAGCTTAGGTAAAATCAA- 3’\n\ti22anti-sense: 5’-AAACTTGATTTTACCTAAGCTTAAC-3’\n\ti23sense: 5’-CACCGAGTAATGTGTCATACCTTCT- 3’\n\ti23anti-sense: 5’-AAACAGAAGGTATGACACATTACTC-3’).\nDigest and dephosphorylate 5 µg of lentiviral CRISPR plasmid (lenti-CRISPRv2-blast [a gift from Mohan Babu] and lenti-Guide-Hygro-iRFP670 [a gift from Kristen Brennand]) (Table of Materials) with BsmB1/Esp3I for 30 min at 37 °C. For 5 µg of plasmids, add 3 µL of BsmB1 restrict enzyme, 3 µL of fast alkaline phosphatase, 6 µL of 10x enzyme digest buffer and 0.6 µL of 100 mM DTT in 60 µL reaction).\nLoad the reactions onto a 0.8% agarose gel. Run the gel at 100−150 V for 30 min.\nPurify digested plasmid in-gel using a gel extraction kit (Table of Materials) and elute in 20 µL of H2O.\nPhosphorylate and anneal each pair of the gRNA oligonucleotides containing 1 µL of each oligonucleotide at 100 µM, 1 µL of 10x T4 ligation buffer, 0.5 µL of T4 polynucleotide kinase (PNK), 6.5 µL of ddH2O at 37 °C for 30 min, and then 95 °C for 5 min and then ramp down to 25 °C at 5 °C/min.",
    "Ligate a 1:200 dilution of the annealed gRNA oligonucleotides into the plentiCRISPR V2-Blast or plentiGuide-Hygro-iRFP670. Mix 50 ng of BsmB1/Esp3I digested vectors with 1 µL of diluted oligo duplex and 5 µL of 2x ligase buffer plus 1 µL of ligase in a 11 µL reaction system and incubate for 10 min at room temperature.\nPerform transformation with 3 µL of ligation product into 50 µL competent cells (Table of Materials) according to the manufacturer’s instructions.\nSpread the transformed competent cells in an agar plate with 100 µg/mL carbenicillin and incubate at 31.5 °C for 18 h.\nPick colonies with 10 µL sterile pipette tips and culture in 5 mL of terrific broth (Table of Materials) containing 100 µg/mL carbenicillin at 31.5 °C, 185 rpm in a shaker incubator for 21 h.\nPurify the plasmid DNA using the mini-prep and midi-prep kits (Table of Materials).\nVerify the mini-prep plasmids by restriction digestion. For the 20 µL reaction system, add 1 µg of plasmid DNA, 2 µL of digest reaction buffer (Table of Materials) and 1 µL of restriction enzyme mixture (0.5 µL of KpnI-HF and 0.5 µL of AgeI-HF for plentiCRISPR V2-Blast-i22; 0.5 µL of NotI-HF and 0.5 µL of EcoRI-HF for plentiGuide-Hygro- iRFP670- i23). Incubate the reaction system for 1 h at 37 °C.\nLoad the reactions onto a 0.8% agarose gel. Run the gel at 100−150 V for 30 min.\n\tNOTE: The correct bands for plentiCRISPR V2-Blast-i22 should be 622 bp and 12.2 kb, and the correct bands for plentiGuide-Hygro- iRFP670- i23 should be 2.6 kb and 7.1 kb.\n9. Lentiviral vector packaging\nCulture 7 x 105 293FT cells in 5 mL of DMEM media containing 10% fetal bovine serum in a 6 cm dish overnight at 37 °C, 5% CO2.",
    "Prepare a cocktail (1 µg of plentiCRISPR V2-Blast-i22 or plentiGuide-Hygro-iRFP670-i23, 750 ng of psPAX2 packaging plasmid, 250 ng of pMD2.G envelope plasmid, and 5 µL of transfection reagent A [Table of Materials] in 100 µL of reduced serum MEM media).\nPrepare a mixture of 5 µL of transfection reagent B (Table of Materials) in 100 µL of reduced serum MEM media.\nAdd 100 µL of transfection reagent B mixture to plasmid mixture from step 9.2 and incubate for 5 min at room temperature.\nAdd the DNA-lipid complex (from step 9.4) dropwise to the 293FT cells. Incubate overnight at 37 °C with 5% CO2.\nAdd virus production enhancer (500x) (Table of Materials) to each dish the next day and incubate for 24 h at 37 °C, 5% CO2.\nCollect medium from cells using pipettes on the next two days and filter the medium through a 0.45 µm filter to remove the cells.\n10. Concentration and purification of lentiviral vectors\nPrecipitate lentiviral vector in the medium of step 9.7 overnight at 4 °C with 5x polyethylene glycol 4000 (PEG4000, 8.5% final concentration) and 4 M NaCl (0.4 M final concentration).\nCentrifuge the viral media containing the PEG4000 solution at 2,095 x g and 4 °C for 30 min, remove and discard the supernatant.\nResuspend the pellets with 500 µL of serum reduced MEM media (lentivirus titer: lenti-CRISPR V2-gRNAi22: 1.56 x 108, lenti-iRFP670-gRNAi23: 1.3 x 108, lenti-CRISPR V2-control: 3.13 x 107, lenti-iRFP670-control: 5.9 x 107). Store at -80 °C until use.\n11. Deletion of exon 23 in mouse iPSCs with two guide RNAs (gRNAs) coupled with Cas9\nPlate the mouse iPSCs from step 4.5 in a 24-well plate coated with fibronectin and gelatin.",
    "After the cells reach 50% confluence, switch to the fresh culture medium (complete mouse embryonic stem cell growth medium) containing 8 µg/mL polybrene).\nAdd 100 µL of the lentiviral particle solution from step 10.3 including lenti-CRISPR V2-gRNAi22, lenti-iRFP670-gRNAi23 and control (empty vector: lenti-CRISPR V2, lenti-iRFP670) to mouse iPSCs. Incubate cells for 3 days at 37 °C with 5% CO2.\nSelect stably infected cells with media containing 2.5 µg/mL blasticidin and 100 µg/mL hygromycin B by determining the minimum concentration of blasticidin and hygromycin B required to kill the un-infected cell.\n\tNOTE: Un-infected cells would be killed by blasticidin and hygromycin B.\nDigest the selected mouse iPSCs with 0.5 mL of TVP solution each well (24-well plate) and incubate cells for 30 min at 37 °C with 5% CO2.\nDissociate the iPSCs into single cells by pipetting, count cells with a cell counting chamber and then dilute about 150 digested single cells with mES medium into 10 cm dish for culture at 37 °C with 5% CO2.\nAfter about 10 days, pick single colonies under an inverted microscope using 10 µL sterile pipette tips (96 colonies need to be picked).\nTransfer the picked colonies into 50 µL of TVP solution each well (96-well plate, one colony each well), digest at 37 °C for 30 min, and then seed the digested cells into two 96-well culture plates to keep culture (one for genotyping).\nIncubate in a CO2 incubator at 37 °C until 70% confluent.\n12. Identification of iPSC colonies with exon23 deletion\nRemove the medium in 96-well plate when the cell colonies reach 70% confluence.\nAdd 25 µL of lysis reagent (Table of Materials) containing proteinase K solution (1 mL of proteinase K in 100 mL of lysis reagent) to each well, and transfer the lysate to a 96-well PCR plate.",
    "Seal the PCR plate and incubate the plates at 55 °C for 30 min, and then at 95 °C for 45 min to lyse the cells and denature the proteinase K.\nCarry out PCR reaction with 2 µL of lysate from step 12.3. For the 20 µL PCR reaction, add 2 µL of lysate, 10 µL of 2x DNA polymerase premix (Table of Materials), 7 µL of DNase-free water, and 1 µL of DMD exon 23 primers (Table 1).\nUse the following parameters for PCR reaction: 98 °C for 1 min, 35 cycles of 98 °C for 10 s, 60 °C for 15 s, 72 °C for 30 s, and a final extension at 72 °C for 1 min.\nLoad the PCR reaction onto a 2% agarose gel. Run the gel at 100−150 V for 30 min.\nInspect the gel under UV light (the knockout efficiency is 3/94).\n13. Using the Tet-on MyoD activation system to directly differentiate iPSC into myogenic progenitor cells (MPC)\nPackage the LV-TRE-VP64-mouse MyoD-T2A-dsRedExpress2 and LV-TRE-VP16 mouse MyoD-T2A-dsRedExpress2 (a gift from Charles Gersbach) (Table of Materials) as previously described for lenti-CRISPRv2-blast and lenti-gRNA-iRFP670 vectors in sections 9 and 10.\nInfect mouse iPSC with lentivirus-TRE-VP64-MyoD-T2A-dsRed-Express2 or lentivirus-TRE-VP16-MyoD-T2A-dsRedExpress2 as previously described for lenti-CRISPRv2-blast and lenti-gRNA-iRFP670 vectors in steps 11.1−11.3.\nSelect cells with 1 μg/mL puromycin after three days of infection to obtain a pure transduced cell population.\nAdd 3 μg/mL doxycycline into culture media (10% FBS DMEM) to MPC differentiation. Replace fresh medium supplemented with doxycycline every two days.\n14. Quantitative reverse transcription PCR for evaluating dynamic muscle differentiation and DMD exon 22-24 expression\nExtract cellular RNA after 0, 3, 6, and 10 days after doxycycline treatment using RNA isolation reagent, reversely transcribe RNA into cDNA by using first strand cDNA synthesis kit (Table of Materials).",
    "For the 20 µL qPCR reaction system, add 1 µL of cDNA, 10 µL of PCR reaction buffer (Table of Materials), 8 µL of DNA H2O, and 1 µL of mixture of forward and reverse primers (glyceraldehyde-3-phosphate dehydrogenase [GAPDH], skeletal muscle [ACTA1], OCT4 and DMD exon22, DMD exon23, and DMD exon24, see Table 1).\nUse the following parameters for PCR reaction: 50 °C for 2 min, 95 °C for 2 min, 40 cycles of 95 °C for 15 s, 60 °C for 1 min, melt curve 65.0 °C to 95.0 °C, increment 0.5 °C.\n15. Immunofluorescence staining of myosin heavy chain 2 (MYH2) and dystrophin protein expression\nPlate doxycycline-induced, lenti-TRE-MyoD modified cells from step 13.4 onto 8-well culture slides.\nFix cells in 4% formaldehyde for 15 min at room temperature, and then wash the slides twice in PBS for 5 min each time.\nBlock the cells with 5% goat serum protein diluent for 1 h at room temperature.\nAdd rabbit-anti-dystrophin antibody (1:300) and mouse-anti-MYH2 antibody (1:100) to the slides, incubate at 4 °C overnight in a humidified chamber.\nDiscard the primary antibody solution, wash the cells 3x (5 min/wash) in PBS, add 1:400 diluted Alexa488-conjugated goat-anti-rabbit antibody and Alexa555-conjugated goat-anti-mouse antibody to slides, and incubate for 45 min at room temperature.\nWash the slides 3x (5 min/wash) in PBS, and mount sections with mounting medium containing DAPI.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}