{
  "id": 13403,
  "origin_website": "Jove",
  "title": "Preparation of Drosophila Larval Samples for Gas Chromatography-Mass Spectrometry (GC-MS)-based Metabolomics",
  "procedures": [
    "1. Egg Collection\nCollect adult males and virgin females of the desired genotypes. Individually age these animals in a food vial with standard Bloomington media for 3–5 days.\nSet up the appropriate matings by transferring 50 virgin females and 25 males to a new food vial.\n\tNOTE: A minimum of six independent matings should be set up for each genotype. Only one sample will be collected from each mating (i.e., six samples collected from six independent matings).\nPrepare molasses egg-laying caps.\nMix 115 mL of molasses and 29 g of agar with 700 mL of H2O in a 2 L flask.\nBoil the molasses agar mixture on a hot plate.\nCool to 70 °C.\nAdd 25 mL of acid mix (20 mL of 85% phosphoric acid and 209 mL propionic acid in 1 L of H2O; Store in a brown bottle) and 10 mL of 10% p-hydroxy-benzoic acid methyl ester in 95% ethanol.\nPour the molasses agar into both the lid and bottom portion of a 35 x 10 mm2 tissue culture dish.\n\t\tNOTE: Before pouring molasses agar plates, be sure that the lids and/or base of the 35 x 10 mm2 plate fit snuggly into the mouth of a Drosophila stock bottle (described in Step 1.6). Depending on the brand of plates used, the base might not be usable.\nMake fresh yeast paste by adding distilled water to active dry yeast (5 g yeast/7 mL water) until the mixture becomes a paste that can be easily spread on a solid surface (i.e., the consistency of peanut butter).\nSpread approximately 1.5 g of yeast paste on the surface of a molasses egg-laying cap.\nPoke four air holes into opposite sides of a plastic 6 oz. Drosophila stock bottle using a 22 G needle.",
    "Transfer the newly mated flies from the food vial into culture bottles.\n\tNOTE: Flies can be transferred by either using CO2 as a temporary anesthetic or by holding the top of vial in mouth of the bottle and sharply tapping the bottom of the bottle against a benchtop.\nQuickly place a molasses egg-laying cap with yeast paste on the surface into the mouth of a Drosophila stock bottle. Use laboratory tape to secure the egg-laying cap in place.\n\tNOTE: If flies were anesthetized prior to transfer, the bottle should be placed horizontally on the benchtop until all flies have recovered. Once flies are completely mobile, place the bottle in an incubator with the molasses egg-laying cap at the bottom of the culture.\nReplace the molasses egg-laying cap at least once a day for the first two days by inverting the stock bottle, tapping the bottom of the bottle against the benchtop, removing the old egg cap, and immediately placing a new egg cap into the mouth of the bottle. Discard the old egg-laying cap.\n\tNOTE: This step ensures that females are not holding their eggs and allows for collection of synchronized populations.\nPlace a new egg-laying cap into the stock bottle after day 3, replace after 2 h, and discard. Remove and replace the second egg-laying cap after four hours. Label the bottom of this egg-laying cap with the date, time, and genotype.\n\tNOTE: The eggs collected during this 4 h window will be used for analysis. This synchronization step is critical for analyzing specific developmental stages. Eggs can be collected in this manner for several days.\nInsert the egg-laying caps into a 60 x 15 mm2 Petri plate and place into an incubator at the desired temperature and humidity.",
    "Inspect the egg-laying caps every day for problems with starvation, population density or contamination.\n\tNOTE: Larvae must have access to adequate food to ensure continuous development. If necessary, fresh yeast paste can be spread on all egg-laying caps that will be used in the experiment. In addition, if the larval population density is too high, larvae will begin to wander out of the culture plate. These samples should not be used for metabolomic analysis because the high population density and intermediate bouts of starvation experienced while wandering will result in inconsistent data. A density of ~80–100 middle second instar larvae (L2) per plate or 40–50 middle third instar larvae (L3) per plate is recommended. Samples that are visibly contaminated with bacteria or fungi should be discarded.\n2. Larval Sample Collection\nAge larvae until the desired stage. If collecting L3 larvae, resynchronize samples at the L2–L3 molt. Resynchronization is commonly achieved using a previously described method that uses the anterior spiracles as a developmental milestone15. Alternatively, mid-L3 larvae can be synchronized using a sgs3 reporter gene16.\n\tNOTE: In this regard, we find mid-L2 larvae (~60 h after egg laying) are ideally suited for most analyses because larval development is still relatively synchronous at this stage, carefully collected samples have adequate food to develop to this timepoint, and the number of animals per sample is manageable (see below). An additional synchronization step is necessary for L3 larvae because the numerous ecdysone pulses that occur during L3 development have dramatic effects on metabolism and will generate artifacts in unsynchronized populations.\nUse a dissecting needle to gently lift the yeast paste off the agar. Place the yeast onto a new molasses agar cap.\n\tNOTE: Most larvae will eat at the interface between the molasses agar and the yeast paste.",
    "Use a small paintbrush to collect larvae from the newly exposed surface of the molasses agar. Place the larvae into a 1.5 mL centrifuge tube on ice.\n\tNOTE: Appropriate sample sizes for each developmental stage are as follows: 50 first instar larvae (L1); 25 mid-L2 larvae; 20 early L3 larvae; 15 mid-L3 or late L3 larvae.\nWash and freeze samples (steps 2.3 through 2.8) in small batches (four to six samples) while collecting a large sample set. Samples must be frozen within 20 min of placing larvae in tubes.\n\tNOTE: We recommend using Eppendorf 1.5 mL Flex Tubes because other tubes may interfere with the sample transfer at step 3. Samples must be collected in microfuge tubes. Do not collect samples in the bead tubes described in step 3.1. Ceramic beads retain the NaCl wash solution, which results in inaccurate mass measurements and introduces contaminants into the sample.\nAdd 1 mL of ice-cold 0.9% NaCl into the tube, close the lid, and vertically flip the tube to thoroughly to wash the larvae.\nPlace the tube back on ice for ~30 s. During this time, larvae will sink to the bottom of the tube, but yeast will remain in suspension. Once all larvae have formed a loose pellet, remove the NaCl solution using a 1 mL pipette.\nRepeat step 2.4 and step 2.5 twice, or until the final wash solution is clear.\n\tNote: Additional wash steps may be necessary if the collected sample contains an excessive amount of yeast.\nCentrifuge the samples at 2,000 × g for 1 min at 4 °C.\nRemove all residual solution using a 200 µL pipette.\nImmediately freeze the sample in liquid nitrogen.\n\tNOTE: The protocol can be paused at this step. Samples can be stored for up to 3 months at -80 °C.",
    "3. Transfer of Samples to Bead Tubes\nEach larval sample must be transferred from the 1.5 mL microfuge tube to a 2 mL screwcap tubes containing 1.4 mm ceramic beads. In preparation for this transfer step, use an ethanol-proof marker to label the side of a 2 mL screwcap bead tube (markings on the lid will be destroyed during step 4.4).\nTare the mass of the labeled bead tube using an analytical balance capable of accurately measuring 0.01 mg.\nIf larval samples were stored at -80 °C, place sample tubes in liquid nitrogen prior to transfer.\nUse long forceps to remove the 1.5 mL sample tube from the liquid nitrogen dewar.\nWearing nitrile gloves, grab the frozen tube, invert, and sharply pound the tube lid against the benchtop to dislodge the frozen pellet. Immediately pour the pellet into a pre-tared 2 mL screwcap bead tube. If the pellet fails to dislodge, return the tube to liquid nitrogen and repeat.\n\tNOTE: Larval pellets will not dislodge from all microfuge tubes. If using a tube other than the recommended one, determine if larval pellets can be dislodged prior to collecting samples for analysis.\nQuickly measure the combined mass of the larval pellet and bead tube. Immediately place the sample tube into liquid nitrogen. The larval pellet mass will be used to normalize the metabolomic data.\n\tNOTE: The protocol can be paused at this step. Samples can be stored for up to 3 months at -80 °C.\n4. Sample Extraction\nPlace the sample tubes in a -20 °C benchtop cooler.\nAdd 0.8 mL of prechilled (-20 °C) 90% methanol containing 2 µg/mL succinic-d4 acid into each tube. Return the sample to the -20 °C benchtop cooler.",
    "NOTE: The succinic-d4 acid serves as an internal standard. Only use HPLC grade H2O and methanol. Since methanol and other organic solvents are volatile and difficult to accurately measure using air displacement pipettes, we recommend using positive-displacement pipettes for this step and all following steps.\nSet up a negative control by adding 0.8 mL of prechilled (-20 °C) 90% methanol containing 2 µg/mL succinic-d4 acid into an empty bead tube.\nHomogenize samples for 30 second at 6.45 m/s using a bead mill homogenizer located in a 4 °C temperature control room.\n\tNOTE: Failure to rapidly and completely homogenize the larval pellet is a common source of variability in metabolomics analysis. Only use homogenizers that are capable of destroying frozen larval tissues within 30 s.\nReturn the homogenized samples tubes to the -20 °C benchtop cooler and incubate them in a -20 °C freezer for at least 1 h.\nCentrifuge the tubes at 20,000 × g or maximum speed for 5 min at 4 °C to remove the resulting precipitate.\nTransfer 600 µL of the supernatant into a new 1.5 mL microcentrifuge tube. Do not disturb the precipitate. If the precipitate pellet becomes dislodged while pipetting the supernatant, return all supernatant to the tube and repeat step 4.6.\nPlace the sample tubes in a vacuum centrifuge. Be sure that all tubes are open before sealing the centrifuge. Dry the samples at room temperature until all solvent is removed (this step usually takes ~16 h to complete).\n\tNOTE: If necessary, the protocol can be paused at this step. Dried sample can be stored at -80 °C.\n5. Chemical Derivatization\nIf the dried samples were stored at -80 °C, place unopened sample tubes in a vacuum centrifuge and dry for 30 min. This step must be performed prior to opening the sample tube.",
    "NOTE: This step removes the condensation that collects on the outside of the microfuge tube when removed from the freezer. This portion of the protocol is extremely sensitive to H2O and extra precaution must be taken to keep all reagents as dry as possible.\nPrepare a solution of 40 mg/mL methoxylamine hydrochloride (MOX) in anhydrous pyridine. Only use anhydrous pyridine. Store MOX and pyridine in a desiccator and prepare the MOX solution daily.\n\tCAUTION: MOX and pyridine are toxic. Prepare this solution in the fume hood.\n\t\nUse a heat gun to dry a 1 mL glass syringe.\nInsert the needle of the syringe into the bottle of anhydrous pyridine. Remove 1 mL of pyridine and add to a microfuge tube containing 40 mg of MOX.\nFlush the bottle of anhydrous pyridine with argon. Seal the bottle and return to the desiccator.\nDissolve the MOX in the pyridine by incubating the tube in a thermal mixer at 35 °C for 10 min at 600 rpm.\nAdd 40 µL of 40 mg/mL MOX in anhydrous pyridine solution to the dried sample.\nVortex for 10 s and briefly centrifuge (10,000 x g for 20 s).\nIncubate at 30 °C for 1 h at 600 rpm in a thermal mixer.\nCentrifuge at 20,000 × g or maximum speed for 5 min to remove the particle matter.\nTransfer 25 µL of supernatant into an autosampler vial with a 250 µL deactivated glass microvolume insert.\nAdd 40 µL of N-methyl-N-trimethylsilyltrifluoracetamide (MSTFA) containing 1% TMCS.\n\tCAUTION: MSTFA is toxic. Perform this step in the fume hood.\n\tNOTE: If available, this step can be completed by a Gerstel autosampler.\nPlace a cap on the autosampler vial and seal using a crimper tool.\nIncubate the sample at 37 °C for 1 hour with shaking (250 rpm).",
    "Prepare a fatty acid methyl ester standard (FAMES) solution as previously desceribed3. Add 3 µL of FAMES to the autosampler vial using a robotic autosampler immediately prior to injection.\n\tNOTE: FAMEs are used to calibrate the retention time shift and check the instrument performance. If no robotic autosampler is available, FAMEs can be added during step 5.8.\n6. GC-MS Detection\nNOTE: In most cases, the user will conduct this step with the assistance of a mass spectroscopy core facility. This protocol is designed to be used with a 30 m, GC column with a 5 m guard column.\nRandomize the sample order.\nPrepare the GC-MS.\nSet the helium carrier gas flow rate to 1 mL/min.\nSet the inlet temperature to 250 °C.\nProgram the GC to execute the following temperature gradient:\n\t\t\nInitial temperature to 95 °C with a hold of 1 min.\nIncrease the temperature to 110 °C at the rate of 40 °C/min with a hold of 2 min.\nIncrease to 250 °C by 5°C/min ramp.\nIncrease to 330 °C at the rate of 25 °C/min with a final hold of 4 min.\nSet solvent delay to 3.5 min.\n\t\tNOTE: The time can be changed according to the GC-MS system. The purpose of this step is to prevent MSTFA and MOX from damaging the detector.\nInject 1 µL of the derivatized sample into the GC-MS (split ratio of 10:1).\n\tNOTE: Inject 2 µL of sample if the intensity of peaks is too low. The injection order of samples should be randomized.\nOperate the mass spectrometer in full scan mode over a mass range of 50–500 m/z.\n7. Data Analysis",
    "Analyze metabolomic data using either a targeted or untargeted approach. Targeted analysis is focused on measuring the abundance of a defined set of metabolites, such as the lactate measurements that we describe below. In contrast, untargeted analysis uses an unbiased approach to identify any metabolic feature that is significantly changed between two sample sets.\n\tNOTE: Our lab primarily uses the free programs MetAlign17 and MetaboAnalyst18,19 for data analysis. Since an adequate description of both the quality control, normalization, and data processing steps are beyond the scope of this manuscript, we refer the user to more detailed protocols that are devoted to data processing20,21,22. In addition, a flow chart describing the steps required for this analysis can be found elsewhere8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}