{
  "id": 5864,
  "origin_website": "Bio",
  "title": "Automatic Leaf Epidermis Assessment Using Fourier Descriptors in Texture Images",
  "procedures": [
    "Leaf epidermal dissociationWith the aid of a razor blade, remove from each leaf two or three samples of approximately 1 cm2 but less from its middle region, including the midrib (Figure 1A). Fresh or dry leaves can be used. Put the leaf fragments in a glass vial containing 1:1 glacial acetic acid and hydrogen peroxide (Franklin solution) in a drying oven at 60 °C (add enough volume so that the vial is left with about 1 cm of solution). Generally, this procedure is completed when the epidermis is beginning to peel off from the leaf fragments or when the leaf fragments become transparent and with air bubbles inside (Figures 1B-1E). The procedure can last from 12 h to a few days, depending on the morphological characteristics of each leaf. Some plants with thicker and sclerified leaves will require higher temperatures (up to 90 °C). Thus, if a leaf fragment incubated at 60 °C fails to produce an isolated epidermis, it must be heated up to 80-90 °C (it is not necessary to change the dissociation solution, however, it may be necessary to add more solution as it evaporates more at higher temperatures).Notes:  For example, the species Clusia criuva, Duguetia furfuracea and Roupala montana required a temperature of 90 °C for leaf epidermal dissociation.We recommend that the fragments be removed from the middle region of the leaves by standardization; this region is usually used by botanists in leaf anatomy studies. It is possible to have differences in the size and density of the stomata according to the sampled region of the leaf.After this procedure, pour a little of the solution along with the leaf fragments in a Petri dish containing distilled water.",
    "Separate the adaxial and abaxial faces of the epidermis from the leaf fragment with a brush or needles (Figure 1F). In Petri dish, never remove the epidermis from the aqueous medium to maintain it stretched. Put the abaxial epidermis on a slide with a needle; the outer side of the epidermis must be placed upwards on the slide (Figure 1G). Whenever you deal with the epidermis on the slide, the epidermis must be stretched. Note: The inclusion of the midrib in the leaf fragment helps to distinguish between the adaxial and abaxial surfaces of the epidermis.To remove residues of glacial acetic acid and hydrogen peroxide solution, wash the fragment with distilled water holding the epidermis with a needle. Remove water excess from the slide with soft paper. Put one drop of 1% aqueous Safranin (see Recipes) on the epidermis (Figure 1H), stain for 10 min. Then, wash the epidermis with distilled water to remove the stain excess. Dry the slide with soft paper and, for mounting, put one to two drops of glycerin on the epidermis and carefully put the cover glass (Figure 1I).Note: Use gloves and protection glasses whenever you deal with Franklin solution or its components. Use gloves whenever you deal with Safranin.The epidermis is observed and photographed under an optical microscope. Since the plant epidermis has distinct characteristics, mainly of thickness, each image must be taken with adequate light intensity so that it does not become dark or too clear. All the images were taken at 200x magnification.The synthesis of the procedure is presented in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128194225_4724.jpgFigure 1. Procedure for epidermal decoupling. A. Fresh leaf fragment; B-D. Stages of mesophyll digestion by the solution of glacial acetic acid and hydrogen peroxide; E. Leaf fragment ready for epidermal separation; F.",
    "Faces of the epidermis being dissociated from leaf fragment; G. Epidermis being placed on the slide; H. Staining; I. Mounting; J. Ready slide. Scale bars: A-E = 1 cm; F-J = 2 cm.Leaf epidermis image analysisThe computational and statistical methods have been implemented using the software MATLAB R2014a (Version 8.3) (MATLAB and Statistics Toolbox Release, 2014a) and the classification procedures have been performed using Weka 3 (Hall et al., 2009), a data mining software in Java.Pre-processing methodThe first step is to convert the color image into a gray scale image. The pre-processing procedure was conducted by performing a histogram stretching to increase the image contrast. Let an image f (x, y), g(x, y) be the enhanced image of f (x, y) given byimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128194831_2068.jpgwhere, bpp is the number of bits per pixel of the image f (x, y). In one image with 256 gray levels, bpp = 8. In the enhanced image g(x, y), 1% of data is saturated at low and high intensities of the original image.Next frame shows the code in MATLAB to obtain the stretching of the input image.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128194909_0481.jpgFigure 2 shows two examples, using Baccharis linearifolia and Esenbeckia pulmila, of the pre-processing stage.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195002_4277.jpgFigure 2. Pre-processing. Images of Baccharis linearifolia (A-C) and Esenbeckia pulmila (D-F). A and D: Original images; B and E: Gray images of the first column; C and F: Stretching of the images in the second column. Images are at magnification of 200x (scale bars = 50 µm).Image texture characterizationAs an image is represented as numerical matrix, a variety of methods can be used to extract patterns of texture in images. In this protocol, Fourier descriptors will be described.",
    "Fourier DescriptorsProposed by Cosgriff (1960), Fourier descriptors represent periodic functions given by the sum of sines and cosines of a periodic signal obtained from the discrete Fourier Transform (DFT). Discrete Fourier transform of a function 1D f (x) is given by:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195127_6893.jpgM is the length of the signal, u, x ∈ [0, 1..., M - 1] and j is a complex number. Inverse transform, from F (u) to f (x) is given by:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195207_5508.jpgFor two-dimensional functions, as images, the Fourier transform is given by:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195237_9255.jpgM and N are the signal dimensions. Inverse transform of a 2D signal is:imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195308_9113.jpgWhen the Fourier Transform is applied to the image, lower frequency coefficients remain at the extremities of the spectrum. The Figure 3A shows the original image and the Figure 3B, the spectrum of the Fourier transformation. Then, a shift operation is performed on the resultant image moving the origin of the Fourier Transform to the central coordinates ([M/2] for 1D signals and [M/2, N/2] for 2D signals) at frequency domain, as shown in Figure 3C.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195352_8476.jpgFigure 3. Fourier Transform. A. Original image; B. Fourier transform of (A); C. Shift of (B). Images are at magnification of 200x (scale bars = 50 µm).Low frequency components, found at the center of the shifted Fourier Transform, contain the most relevant information of the behavior of a signal. High frequency components are found at the extremities and represent abrupt changes and noise. These complex values can be used as characteristics of texture (Azencott et al., 1997; Gonzalez, and Woods, 2006). Here, the central values are prioritized as can be seen in the following. Two approaches are used to obtain the characteristics, also called descriptors, of the image texture.",
    "Fourier Circular: After shift operation, G circular rings are used to obtain the sum of all spectrum absolute values from the origin to each circular ring. G is given by min ([M/2J], [N/2J]), where the image has M x N pixels size. So, radius equal to 1, 2..., G providing G descriptors. The circular rings can be seen in Figure 4A.Fourier Circular-Angular Complementing the circular rings, F (u, v) is partitioned into eight angles equally spaced over the image, as in Figure 4B, resulting in Figure 4C. Eight circular rings have been used with radius equal to 3, 6, 9, 12, 15, 18, 21 and 24 pixels of distance. Thus 64 sectors are obtained, totaling 64 descriptors by summing the spectrum absolute values of each sector. The order in which the descriptors vector is composed does not interfere with the result. In this implementation, check the code list, the radius loop is inside the quadrant loop.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195445_6250.jpgFigure 4. Circular and angular rings to obtain the Fourier descriptors. A. Circular; B. Angular; C. Circular-Angular.The next three frames show the complete code in MATLAB to obtain the Fourier Circular-Angular descriptors.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195534_7451.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195605_8019.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20171128/20171128195638_8236.jpg"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}