{
  "id": 16983,
  "origin_website": "Jove",
  "title": "Robot-Assisted Transcanal Endoscopic Ear Surgery for Congenital Cholesteatoma",
  "procedures": [
    "This study was conducted in compliance with the European GDPR and registered at AP-HP, Hôpital Necker - Enfants Malades (number 20200727144143). The study adhered to the CARE guidelines12, and both parents provided written consent to record the surgical video of the procedure and to publish a case report13,14. The surgical strategy mirrored the one typically used in our tertiary referral center with a microscope, involving the use of both hands. The primary difference was the surgical approach, which was trans-canal, eliminating the need for atticotomy or canalplasty.\n1. Pre-operative procedures\nDiagnose congenital cholesteatoma during otoscopy in the clinic, where a white mass is visible behind a normal tympanic membrane. Discuss the tympanoplasty procedure and approach with the parents (and the patient, considering their age), explaining the benefits and risks.\nCheck the pre-operative auditory work-up to assess ossicular involvement in cases of conductive hearing loss and to verify the absence of associated sensorineural hearing loss.\nPrepare for the tympanoplasty procedure with a pre-operative CT scan to assess the feasibility of total endoscopic ear surgery (TEES) and to check for mastoid involvement.\n\tNOTE: Ossicular involvement can also be assessed to determine the Potsic stage3. Stage I and II patients are ideal candidates for TEES, while stage III cases may be more challenging due to the difficulty of safely dissecting the ossicular chain with one hand. Potsic stage IV lesions require mastoidectomy, and a traditional endaural or postauricular approach is usually preferred.\nAssess the size of the external ear canal using a speculum (see Table of Materials), which is particularly important in infants.",
    "​NOTE: If a size 4 speculum can be inserted, TEES can be easily performed. It is more challenging but still possible to perform TEES if a size 3 speculum can be inserted (the canal is between 3 and 4 mm wide at its narrowest).\n2. Preparation for the surgery\nPerform a checklist to confirm the side of the lesion and ensure that a CT scan and audiometry results are available before commencing the procedure.\nInstall the robotic arm (endoscope holder) (see Table of Materials) on the robot and ensure it is in a neutral position.\nAfter patient intubation13,14, tilt the patient's head and secure it in a 30° rotation away from the surgeon. Tilt the patient's headrest backward and incline the surgical bed in an anti-Trendelenburg position to position the patient's head horizontally.\nSecure the patient's head to the table using an adhesive elastic band placed on the forehead.\nSet up facial nerve monitoring (see Table of Materials).\nDrape the surgical microscope, at least for the initial procedures, to facilitate a transition to the microscope during the procedure if difficulties arise with the robot.\n\tNOTE: This is essential to ensure the highest quality of patient care while still advancing along the learning curve.\nDrape the robotic arm and the robot.\nInstall and drape the space mouse after attaching it to the surgical bed next to the surgeon (see Figure 1), which controls the robotic arm's multi-directional movement.\n\tNOTE: The space mouse can be fixed on either side of the surgeon, but in this studt, it's positioned toward the patient's feet, allowing the surgeon to sit directly next to the scrub nurse (who is positioned at the head of the patient, as shown in Figure 2).\nDisinfect the surgical site and cover it with surgical drapes, exposing only the external ear.",
    "Position the robot opposite the surgeon (on the other side of the bed) so that the robotic arm (endoscope holder) can extend over the patient's head toward the surgeon, aligning with the external auditory canal (as illustrated in Figure 1).\nPlace the video tower opposite the surgeon, preferably on either side of the robot (ideally toward the patient's feet), ensuring a comfortable view of the screen. For a left tympanoplasty, position the video tower to the right of the robot (as shown in Figure 1 and Figure 2).\n3. Onset of the surgery\nPosition the endoscope holder over the auditory canal meatus and insert the endoscope into the endoscope holder. Use a 25 cm long telescope with the robotic arm to reduce the risk of conflicts with the surgeon's hands during the procedure.\n\tNOTE: The telescope has a width of 2.9 mm, and a 0° scope is typically used, although 30° or 45° scopes may be useful for certain steps.\nClean and disinfect the ear canal, and carefully examine the tympanic membrane.\nAdminister local anesthesia (using a solution containing 10 mg/mL xylocaine and 0.005 mg/mL adrenaline) to the upper portion of the bony auditory canal (vascular strip).\nHarvest tragal cartilage (conchal cartilage can be used as an alternative). Place a small gauze in the ear canal during this stage to prevent the accumulation of coagulated blood.\n4. Congenital cholesteatoma (CC) procedure\nMake an incision from 12 o'clock to 8 o'clock for the trans-canal approach using an angled cautery needle with low power (4 Watts) (see Table of Materials) to prevent retraction. Use suction to clear any smoke or blood that may obstruct the view.\n\t\nOpen the tympanic cavity inferiorly, posteriorly, and superiorly along the chorda tympani until the malleus neck is identified.",
    "NOTE: Extend the skin incision if there is tension in the flap to prevent tearing.\nIdentify and debulk the lesion: ensure that the posterior portion of the congenital cholesteatoma (CC) is clearly visible, and its involvement with the incus and stapes can be accurately assessed.\n\t\nElevate the tympanum from the manubrium to push the tympano-meatal flap anteriorly. Open the CC matrix in the controllable posterior-inferior portion and debulk it using a large suction.\n\t\tNOTE: A stage III CC is typically too large to be removed without inducing ossicular trauma or the risk of dislocation.\nSeparate the CC from the incus and stapes using a hook or needle and push it anteriorly under the malleus with a Fisch microdissector (see Table of Materials).\n\tNOTE: Exercise great care to avoid ossicular trauma, and use suction as a counterforce to stabilize the ossicles during dissection.\nDissect the CC from the promontory and cochleariform process and remove the CC.\n\tNOTE: Be especially cautious when dissecting the medial-anterior side of the malleus, using a hook or Fisch microdissector.\nInspect the tympanic cavity using an angled endoscope.\n\tNOTE: With an intact ossicular chain, the endoscope must be manipulated very cautiously, especially with an angled view. Robotic control of the endoscope is highly useful for rotating it 360° while maintaining the shaft in the same position and at the exact same depth. To inspect the ossicles, use a soap-soaked cotton ball to wipe the medial side of the malleus and incus and between the crus of the stapes to detect any residual squamous cells15.\nReinforce the tympanic membrane and insert cartilage in an underlay position to prevent subsequent retraction pockets. Replace the tympano-meatal flap on the bony canal and pack it with absorbable foam, starting with the anterior part of the tympanum to avoid any subsequent lateralisation.",
    "Discharge the patient according to an outpatient protocol. Administer auricular antibiotic drops for three weeks and schedule a post-operative check-up at one month.\n\tNOTE: No external dressing is necessary.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}