{
  "id": 12296,
  "origin_website": "Jove",
  "title": "Labeling of Breast Cancer Patient-derived Xenografts with Traceable Reporters for Tumor Growth and Metastasis Studies",
  "procedures": [
    "All steps requiring the use of animals in this protocol follows the guidelines of University of Colorado animal research ethics committee (IACUC).\n1. Preparation of Instruments, Culture Media and Other Reagents\nPrepare 100 ml mammosphere media containing Dulbecco's Modified Eagle Medium and Han's F-12 medium (DMEM/F12) (1:1), basic Fibroblast Growth Factor (bFGF, 20 ng/ml), epidermal growth factor (EGF, 10 ng/ml), Heparin (4 µg/ml), 1x B27, Penicillin (100 U/ml), streptomycin (100 µg/ml). Make media in sterile conditions and store at 4 °C for up to 3 months.\nPrepare epithelial enrichment buffer (EEB) containing PBS pH 7.2, 0.5% Bovine Serum Albumin (BSA), 2 mM EDTA. Filter sterilize and store at 4 °C for up to 6 months.\nMake 5 ml aliquots of digestion buffer in sterile 15 ml conical tubes and store at -20 °C for months. The night before tumor digestion, thaw digestion buffer (5 ml per 500 mg tumor) on ice, at 4 °C. Add 1x antibiotic-antimycotic mix before use.\nAutoclave (121 °C for 30 min) at least two forceps, scalpel and scissors for dissection of PDXs.\nMake 500 ml wash buffer containing DMEM:F12 and 5% Fetal Bovine Serum (FBS). Store at 4 °C for months. Aliquot 10 ml per tumor the day of tumor dissection.\nPrepare a polybrene stock at 4 µg/µl with sterile water. Filter and aliquot into 1.5 ml microcentrifuge tubes containing 100 µl each, store at -20 °C.\n2. Generation of High Titer Lentiviral Particles Carrying Traceable Markers\nPurchase or generate high titer lentiviral particles carrying a reporter gene (i.e., GFP and Luc for in vivo tracking of tumor growth) 18,19.",
    "NOTE: A lentiviral titer of > 108 TU/ml (transduction units per milliliter) is recommended for successful transduction of PDXs. The lentiviral particles should be pseudotyped with an envelope G glycoprotein from Vesicular Stomatitis Virus (VSV-G), allowing transduction of a wide variety of mammalian cells.\n\tNOTE: The protocol used here for the generation and titration of high titer lentiviral particles is available at www.kottonlab.com[href=http://www.kottonlab.com]. Vectors used in this protocol are pSIH1-H1-copGFP-T2A-puro and the dual promoter pHAGE-EF1aL-luciferase-UBC-GFP-W. This vector was generated by replacing dsRed with the luciferase gene downstream of EF1aL promoter in the pHAGE-EF1aL-dsRed-UBC-GFP-W vector, a kind gift of Darrell Kotton, Boston University.\n3. Generation of Patient-derived Xenografts\nGenerate patient derived xenografts (PDX) from breast cancer by implanting primary or metastatic breast tumors in the mammary fat pad of immunocompromised mice3,4. Generate tumors at a maximum recommended size of 1 cm diameter as larger tumors are likely to contain necrotic cores.\n\tNOTE: Detailed methods for establishing and transplanting xenografts are described in DeRose et al. 18. Growth of established-transplantable PDXs into > 1 cm-diameter tumors takes between 4 and 24 weeks after implantation in immunocompromised NOD/SCID/ILIIrg−/− (NSG), depending on intrinsic tumor growth rates. While this protocol describes transduction of breast cancer PDXs, it can be used for viral transduction of any tumor suitable to short-term in vitro passage. The sensitivity of PDXs to short-term (24 - 96 hr) in vitro survival is intrinsic to each tumor and must be determined experimentally.\n4. Tumor Dissection and Dissociation of PDX-derived Tumor Cells",
    "Euthanize mice carrying PDX using CO2 inhalation followed by cervical dislocation (follow institutional guidelines of animal research ethics committee). Submerge mice in a 0.2% Chlorhexidine solution for 1 min. Set mouse on a supine position on top of a dissection board, and use pins to fix the extended upper and lower limbs to the board.\nUsing aseptic technique, use a scalpel to cut the skin around the tumor. Pull the skin with a set of forceps and separate it from the tumor using a clean scalpel until the tumor is completely exposed. Using a clean set of forceps and scalpel, remove the tumor and place it in 5 ml wash media on ice.\nTake dissected tumor into a BLS2 cabinet for further processing. Remove media and rinse tumor with 10 ml of Hank's Balanced Salt Sodium Modified with 10 mM Hepes (HBSS/Hepes), twice.\nDrop the tumor in a sterile pre-weighed 60 cm tissue culture plate. Weigh the plate containing the tumor to estimate tumor mass.\nUsing a scalpel, cut the tumor in half, then cut a 3 mm disc from one half and place it in a container with 10% formalin for 24 hr. Use this tissue to verify the heterogeneity of the tumor sample (parental PDX). Add 200 µl of HBSS/Hepes (enough to avoid the tissue to dry out) and mince the remaining tumor in the smallest possible pieces using forceps and a clean scalpel.\nTransfer the minced tumor into a sterile 50 ml conical tube. Add at least 1 ml of digestion buffer containing 1x antimycotic-antibiotic per 100 mg of tumor.\n\tNOTE: Addition of antibiotics/antimycotic prevents contamination of tumor cells in vitro.\nDigest tumor for 3 hr at 30 °C, shaking at 125 - 200 rpm.",
    "NOTE: Increasing temperature up to 37 °C increases the efficiency of the digestion (more single cells over time) but it is usually accompanied by increased cell death. For most tumors, digestion at 30 °C for 3 hr results in sufficient numbers of viable dissociated cells to proceed to the labeling step.\nStop the digestion adding 35 ml wash media (DMEM/F12 with 5% FBS). Filter through a 70 µm nylon mesh into a clean 50 ml conical tube to remove undigested tissue. Centrifuge the filtered media containing digested cells at 400 x g for 5 min.\nAspirate supernatant and resuspend pellet in 1 ml Red blood cell lysis buffer. Incubate at room temperature for 5 min.\nAdd 10 ml Wash buffer (DMEM:F12, 5% FBS) to stop lysis. Pass cells through a 40 µM nylon Mesh to remove clumps. Centrifuge at 400 x g for 5 min and remove supernatant, place on ice.\nResuspend digested cells in 5 ml wash buffer and count both viable and non-viable cells using trypan blue exclusion. Briefly, mix 50 µl of cells and 50 µl of trypan blue and count trypan-blue excluding cells using a hemocytometer.\n\tNOTE: This crude digestion product will contain human tumor cells derived from the PDX, as well as mouse stromal cells (fibroblasts, blood cells, etc.). Digested cells can now be processed for labeling (step 6), or human cancer cells can be enriched using one of the procedures described in Ref 5.\n5. Enrichment of Human Epithelial Cancer Cells\nDeplete the mouse stromal cells using a lineage (Lin+) cell depletion kit20.\n\tNOTE: Recommended for highly vascularized tumors and/or tumors with high stromal content in which EpCAM expression is unknown or lost).",
    "Take up to 107 viable cells in a clean 5 ml polypropylene tube, add 2 ml EEB and centrifuge at 300 x g for 5 min. Pipette off supernatant completely.\nResuspend cell pellet in 40 µl of ice-cold EEB per 107 cells.\nAdd 10 µl of biotin-antibody cocktail per 107 cells, mix by gently pipetting and incubate at 4 °C for 10 min (cocktail contains antibodies to Lin+ mouse cells).\nAdd 30 µl of cold EEB per 107 cells, mix by gently pipetting.\nAdd 20 µl of anti-biotin microbeads per 107 cells mix by gently pipetting and incubate at 4 °C for 15 min.\nWash cells with 3 ml cold EEB, centrifuge at 300 x g for 5 min at 4 °C. Carefully aspirate supernatant. Resuspend pellet in 500 µl of EEB and place on ice.\nPlace column in the magnetic field of a magnetic separator. Rinse column with 0.5 ml epithelial enrichment buffer and allow it to drip through. Do not allow the column to dry out.\nPlace a new polypropylene collection tube under the column. Slowly, add the 500 µl containing labeled cells over the column (Lin+ labeled cells will be retained in the magnetic column). Collect effluent as a fraction with unlabeled cells, representing the enriched lineage negative (tumor) cell fraction.\nRinse the column 3 times with 500 µl of EBB and collect the effluent in the same tube as effluent of step 5.1.8. Keep effluent on ice and proceed to labeling step (6).\nOptional: Take the column outside of the magnetic field. Place a new polypropylene tube underneath and elute the LIN+ fraction by adding 500 µl of EEB, three times and using the provided plunger.\nEnrichment of human EpCAM+ epithelial cancer cells (recommended for tumors known to express CD326+ and contain high mouse stromal content).",
    "Take up to 107 viable cells in a clean 5 ml polypropylene tube, add 2 ml cold EEB and centrifuge at 300 x g for 5 min. Pipette off supernatant completely.\nResuspend cell pellet in 60 µl of ice-cold EBB per 107 cells.\nAdd 20 µl of EpCAM microbeads per 107 cells, mix by gently pipetting and incubate at 4 °C for 30 min.\nWash cells with 3 ml cold EEB, centrifuge at 300 x g for 5 min at 4 °C. Carefully aspirate supernatant. Resuspend pellet in 500 µl of EEB and put on ice.\nPlace column in the magnetic field of a mini separator. Rinse column with 0.5 ml EEB and allow it to drip through. Do not allow the column to dry out.\nPlace a new polypropylene collection tube under the column. Slowly, add the 500 µl containing labeled cells over the column (EpCAM+ labeled cells will be retained in the magnetic column). Collect effluent as a fraction with unlabeled cells, representing the mouse stromal cells.\nRinse the column 4 times with 500 µl of ME Buffer and collect the effluent in the same tube as effluent of step 5.1.8.\nTake the column outside of the magnetic field. Place a new polypropylene tube underneath and elute the EpCAM+ fraction by adding 500 µl of ME buffer, three times. Flush out the magnetically labeled cells by firmly pushing the plunger into the column. Collect effluent containing the enriched EpCAM+ tumor cell fraction and keep on ice. Proceed to step 6.\n6. Transduction of PDX-derived Tumor Cells\nCentrifuge dissociated tumor cells at 300 g x 5 min and resuspend in 2 ml mammosphere media. Count viable cells using trypan blue exclusion as in 4.11.",
    "Prepare 10 ml of mammosphere media containing 8 µg/ml polybrene (2 µl of stock polybrene per ml of media).\nDetermine the volume needed for 2 x 105 viable tumor cells. Centrifuge cells at 300 x g for 5 min, and resuspend pellet in 2 ml of polybrene containing media. Plate 2 x 105 viable tumor cells per well in a 6-well ultra-low adherence tissue culture plate.\n\tNOTE: This is an optimal number of cells required for transduction with one lentiviral vector.\nCAUTION! Lentiviral particles and all consumables used with lentiviral particles should be handled following institutional procedures for recombinant DNA biohazards.\n\tNOTE: Lentiviral transduction of primary breast cells strongly favors myoepithelial cells which can result in poor labeling of luminal cells and selection of subpopulations of tumor cells during labeling21.\nIncubate the virus with 200 mU/ml neuraminidase at 37 °C for 1 hr prior to transduction to increase the binding of viral particles to different primary cell subpopulations and correct for this potential bias21.\nAdd lentiviral particles at 10 MOI (2 x 106 TU for 2 x 105 viable cells) if PDX-dissociated cells are depleted from Lin+ mouse cells or enriched in EpCam+ cells. Add lentiviral particles at 30 MOI (6 x 106 TU for 2 x 105 viable cells) if using non-enriched PDX-dissociated cells.\n\tNOTE: The increased MOI allows for efficient transduction even in the presence of large amounts of debris and dead cells in crude extracts. Keep one well with unlabeled cells to serve as a control for viability and transduction efficiency.\nSwirl to mix virus with cells. Incubate at 37 °C, 5% CO2 for up to 96 hr. Add 500 µl of fresh mammosphere media 24 hr after transfection. Cells will not attach to plates, do not aspirate media.",
    "7. Evaluation of Transduction Efficiency and Re-implantation of Labeled Cells in Immunocompromised Mice\nMonitor expression of the traceable marker (GFP) every 24 hr using a fluorescent microscope at 10X magnification.\n\tNOTE: GFP expression can be observed as early as 24 hr after infection but in most PDXs GFP expression is clearly visible after 72 hr (Figure 1).\nEstimate the efficiency of transduction by evaluating the percentage of GFP+ cells within the total well.\n\tNOTE: Since cultures contain tumor cells, residual stromal cells, and dead cells at various degrees, wells with as low as 10% GFP+ cells can be implanted in a host mouse.\nTransfer transduced cells from 6-well plates into a 15 ml conical tube. Add 1 ml of mammosphere media to the well to collect all the cells left behind. Place on ice.\nAdd 10 ml of HBSS/hepes to transduced cells and centrifuge at 300 x g for 5 min, 4 °C. Carefully aspirate supernatant and resuspend in 50 µl basement matrix extract (BME) on ice.\n\tNOTE: BME aliquots must be thawed on ice, 1 - 2 hr prior to use. BME will solidify at room temperature; keep on ice at all times.\nLoad BME-embedded cells into a 0.5 ml insulin syringe, keep on ice, and bring to the animal facility for reimplantation into NSG mice.\nAnesthetize female 4 - 8 week old NSG mice, using 5% isoflurane/95% oxygen for 5min, followed by 2% isoflurane/98% oxygen or according to approved animal research ethics approved protocol.\nWhen animal is unresponsive to pain stimuli (toe-pinch), clean the injection area with betadine followed by ethanol wipes, and inject the 50 µl of cells in the 4th mammary fat pad. Provide mice with analgesia to alleviate injection discomfort as indicated in approved protocol.",
    "Allow cells to form tumors (2 - 12 weeks) and monitor GFP and/or luciferase activity using a tunable light system and/or in vivo luciferase imaging system (Figure 2).\n\tNOTE: Follow guidelines for anesthesia, analgesia, tumor burden measurements and euthanasia criteria as approved by institutional animal research ethics committee.\n8. Quality Control of Labeled PDXs\nDetermine the efficiency of labeling by assessing luciferase and GFP expression in labeled tumors.\n\tNOTE: Follow institutional animal research ethics committee approved procedures for in vivo bioluminescence imaging (Figures 2, 3).\nDissect tumors from euthanized mice when tumor size has reached 1.0 - 1.5 cm diameter (or before according to approved protocols, as described in 4). Dissection should be performed under a tunable light system (or an equivalent system that allows GFP fluorescence evaluation).\nFrom each tumor, qualitatively estimate the percentage of GFP+ tumor using microscopy. If less than 100%, dissect GFP+ portion only. Dissect a 3 mm disk and fix in 10% formalin for paraffin embedding and histological analysis, save a small piece for RNA or other desired analyses, and save as much of the tumor as possible in individual 1.5 ml cryotubes containing 90% FBS/10% DMSO for cryopreservation.\nRe-implant pieces of labeled tumor into new recipient NSG mice18 to expand and use in experimental metastasis studies.\nPerform standard immunohistochemical staining of paraffin embedded tissue obtained from tumors prior to transduction and at each generation thereafter to verify that labeled PDXs remain histologically similar to the original PDXs.\n\tNOTE: The markers used for quality control vary with each PDXs. For breast cancer PDXs, expression of estrogen receptor, progesterone receptor, Epidermal growth factor receptor 2 (HER2), epidermal growth factor receptor 1 (HER1 or EGFR), pan-cytokeratin (pan-CK) are recommended for initial screening.\n9. Experimental Metastasis Models with Labeled PDXs",
    "Following the steps described in section 4, dissociate tumor cells from a labeled PDX. If tumor is highly vascularized or rich in mouse stroma, perform enrichment of cancer cells as described in 4.5 or 4.6.\nCount viable cells using trypan blue exclusion, and dilute 250,000 cells in 100 µl PBS (Ca2+, Mg2+ free) per mice. Keep cells on ice. For injection of multiple mice, adjust the numbers accordingly (and prepare an excess of at least one extra injection to account for pipetting errors).\nBring cells on ice to the appropriate animal procedure room and proceed to intra-cardiac injection according to approved IACUC protocol.\n\tNOTE: Detailed protocols for intra-cardiac injection of cancer cells have been described elsewhere22,23.\nTrack and quantify metastatic spread over time using bioluminescent imaging. Visualize macroscopic metastases at different organs using bioluminescence and/or GFP imaging of isolated organs at necropsy24 (Figure 6).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}