{
  "id": 19023,
  "origin_website": "Jove",
  "title": "Cardiac Stress Test Induced by Dobutamine and Monitored by Cardiac Catheterization in Mice",
  "procedures": [
    "Protocol was approved by the Ethic Committee of Facultad de Medicina Clinica Alemana-Universidad del Desarrollo.\nI. Preparing Dobutamine Infusion\nDissolve 10 mg of dobutamine in 20 ml of sterile distillated water, in order to obtain a stock solution of 500 μg/ml dobutamine. Aliquot and store at -20 °C. This solution can be used at least for 3 months.    \nThaw an aliquot of dobutamine stock solution at room temperature. \nDilute dobutamine stock solution in sterile 0.9% NaCl, in order to obtain dobutamine working solution, which concentration is calculated using the formula: dobutamine (μg/ml) = body weight x 0.2. \nFill a 1 ml syringe 29Gx1/2\" with dobutamine working solution.    \nInsert the needle of the syringe into a 20 cm PE-10 tube. \nAdjust the syringe in the infusion pump following manufacturer instructions. \nSet up the ramp infusion in a step-to-step format with an increase of 10 μl/min for each step, for 6 steps. \nII. Preparing Pressure Sensor\nTo minimize signal drift, submerge pressure sensor in sterile water at 37  °C for at least 15 min. Do not soak the catheter more than 0.5 cm deep, in order to prevent that hydrostatic pressure affects the pressure sensor.    \nElectronically calibrate the pressure sensor at 25 and 100 mmHg. Electric input (Volt) is converted to pressure signal (mmHg). \nSet the sampling rate of 2 k/s and use the filter low pass with a cut off at 100 Hz. Set pressure signal to zero mmHg. \nMark the catheter 15 mm from the tip. Distant to reach the heart from the introduction point was estimated by echocardiography, detecting the presence of the catheter into the left ventricule. \nIII. Preparing Mouse for Catheterization\nWeight C57BL/6 male mice, 30-32 week-old.    \nInject intraperitoneally 60 μg/kg ketamine and 4 μg/kg xylazine1.",
    "Note: Other anesthetics might be used, for example: 350 - 450 μg/kg avertin, 50 μg/kg pentobarbital or 1.5 - 2% isoflurane2-3. \nShave the neck with an electric razor.\nPlace the anesthetized mouse in supine position on a warmed isothermal heating plate. Secure its limbs with paper tape.\nPerform a toe pinch to confirm complete sedation. \nGently insert a rectal probe to monitor body temperature. Using vaselinized probe is recommended. \nIf body temperature differs from 37 °C ± 0.5 °C, adjust it via the heating plate. \nPut mouse snout near the oxygen supply.\nPlace the mouse neck region under the stereomicroscope. \nIV. Data Acquisition\nIn the LabChartPro 7 software, select one channel for pressure registration and one channel for heart rate (HR) registration. For the latter, select the option \"Cyclic Measurements\" and setup measurement as rate.    \nFor the pressure channel set the scale range: 0 to 150 mmHg.\nFor HR channel set scale range: 200 to 600 bpm. \nPress the start key to begin the registration. \nInsert comments indicating procedures performed, for example: anesthesia administration, start of dobutamine infusion, dobutamine concentration, breathing changes. \nV. Cardiac Catheterization4,5\nPerform a small incision on the right side near the jaw. With scissors separate the skin-muscular connective tissue.    \nPerform a longitudinal dissection (1.5 - 2 cm) on the right side of the trachea. Separate the connective tissue, fat and muscle with curved forceps, in order to expose the right carotid artery near the trachea. \nPlace an expander in the animal right side to expose the carotid artery. Pulsatile pressure generated by the heart facilitates the identification of the artery. The jugular vein, which is dark red, is on the right. \nSeparate the artery from adjacent tissues with curved forceps. The vagus nerve, which resembles a white thread, lies along the artery.",
    "Cut a 20 cm piece of 6/0 silk thread and \"double\" it.\nPass the \"double\" thread under the artery from left to right. Cut the thread, in order to obtain separate ends.\nPass a third thread (10 cm) below the artery.\n Tie a tight knot in the thread positioned near to the head, and a loose one in the more distal thread. \nTie a loose knot in the middle thread, and fix the right end of the middle thread to the heating pad with a paper tape. \nKeep carotid artery moist by dropping sterile 0.9% NaCl. Dry off excess of liquid with cotton buds.\nStretch the lower thread with a hemostat clamp. \nFix the position of the hemostat scissor by pinching the skin of the abdomen, stretching the upper thread, in order to occlude blood flow. Verify that connective tissue around the artery has been removed. The artery should be full of blood and deprived of pulse. Prevent threads from producing a torque force on the artery. \nMake a cross section nick near the bottom of the artery with a Vannas micro-scissor. Blood drops will be spilled.\nInsert the catheter into the carotid artery. Be sure to introduce the entire pressure sensor. Verify that there is no blood loss. \nGently adjust the middle thread knot, in order to hold the catheter in place. Do not compress too much, the pressure sensor is very fragile.    \nRelease the hemostat scissors from the animal abdomen. \nHold the catheter with the hand and push the middle thread, in order to avoid blood loss. Note: artery should be full of blood. \nStart recording pressure signals.",
    "When the catheter is inside, the arterial pressure signal fluctuates from 60-70 to 100-120 mmHg. The shape of the pressure signal is shown in Figure 1.A. Note: if you are interested on, at this time point you can record arterial pressure if signal is stable for at least 5 min. HR values were obtained from the pressure waveforms considering an interval of 30 sec of record signal. It is possible to use also an ECG method for direct measurement of HR, according with the investigation goals. \nGently push the catheter up to observe a change in the shape of the pressure signal (Figure 1.B). Once the catheter is inside the left ventricle, the pressure signal fluctuates from 0 to 100-120 mmHg. If it is difficult to slide the catheter, pinch animal chest with two fingers.    \nContinuously control breath rate, body temperature, anesthesia level and pressure signal. All of them should remain stable. \nVI. Infusion of Dobutamine\nFor jugular vein cannulation be sure to peel back the adipose tissue around the vein, in order to prevent its perforation. The surgical procedure for vein occlusion is similar to the procedure shown for carotid artery.\nIntroduce a PE-10 tube into the vein. Confirm that blood flow is not blocked moving backward the syringe plunger. \nDobutamine infusion starts with 10 μl/min and finish with 60 μl/min. In every step, the infusion rate is maintained for 2 min6. \nAfter the last dobutamine dose, euthanize the animal with an overdose of anesthesia. \nVII. Data Analysis \nFor data analysis, choose the section of the recorded data of your interest. Be sure to consider a time interval where pressure signal is stable.  \nSelect the Setup icon in the Blood Pressure module. Indicate the selected type of pressure signal.",
    "Automatically the LabChartPro 7 software displays mean, maximum and minimum values for HR, systolic pressure (Pmax), diastolic pressure (Pmin), end-diastolic pressure (EDP), maximal positive pressure development (dP/dtmax) and maximal negative pressure development (dP/dtmin). In addition, cardiac parameters can be depicted on the pressure trace. \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}