{
  "id": 6444,
  "origin_website": "Bio",
  "title": "Quantitative Plasmodesmata Permeability Assay for Pavement Cells of <em>Arabidopsis</em> Leaves",
  "procedures": [
    "Prepare Petri dish containing 20 ml of MS medium with 0.8% agar.Arabidopsis plants grown under the 16 h/8 h light/dark cycle for 3-4 weeks (Figure 1A). Cut rosette leaves of Arabidopsis plants that had not yet bolted by ophthalmic scissors and place in a Petri dish with the abaxial side facing upward as shown in Figure 1B.Note: Cells of young leaves work better than old leaves. Leaves from different genotypes should be placed on MS medium equally divided (Figure 1B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190401/20190401025424_3683.jpgFigure 1. Preparation of the leaves of 4-week-old Arabidopsis plants for particle bombardment. A. Arabidopsis plants after growing under the 16 h/8 h light/dark cycle for 4 weeks. Scale bar = 1 cm. B. Rosette leaves that had not yet bolted were cut from Arabidopsis plants shown in (A) by ophthalmic scissors and placed concentrically with abaxial side facing upward on the surface of solid Murashige & Skoog medium. Scale bar = 1 cm.Prepare pdGN plasmid from E-coli (Lee et al., 2005). Isolated the plasmid using A TIANprep Midi Plasmid Kit. The concentration of plasmid should be at least 1 µg/µl.Note: The concentration of the plasmid is important for the next step. The pdGN-35S:HDEL-mCherry plasmid should also be prepared when we need to indicate the cells targeted by particle bombardment (Batoko et al., 2000). Prepare bullets of biolistic bombardment. Vortex 10 µl gold suspension solution (Recipe 2) in a microcentrifuge tube with 2 µg plasmid DNA for 1 min. Add 20 µl fresh 0.1 M spermidine and vortex again for 1 min. Add 50 µl 2.5 M CaCl2 and continue vortexing for another 3 min. Allow the mixture to settle for 5 min on ice and centrifuge the mixture for 10 s, at 2,348 x g. Discard the supernatant.",
    "Wash the pellet with 1 ml of 70% ethanol and then with 1 ml of 100% ethanol. Mix and centrifuge gently. Finally, resuspend the pellet in 15 µl 100% ethanol.Notes:  The maximum total volume of plasmid DNA should be ≤ 10 µl. When both pDGN plasmids and CMV MP-pDGN plasmids need to be expressed simultaneously, 2 µl of each and gold particles are mixed together in a single test tube. The 1 M spermidine stock can be stored at -20 °C for at least 3 months. Vortex the mixture gently and transfer it to a macrocarrier using a pipette with a 10-200 µl tip. Air dry until the ethanol has evaporated, assemble all of the parts necessary for performing a particle bombardment according to the manufacturer’s instructions (Figure 2). Set the pressure to 1,100 psi and use 1,550 psi rupture discs. Place the MS plate with Arabidopsis leaves 9 cm below the macrocarrier (level 3) in the bombardment chamber (Figure 2). Set the vacuum level in the bombardment chamber to 28 psi and bombard.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20190401/20190401025526_9819.jpgFigure 2. Side view of PDS-1000/HeTM Biolistic Particle Delivery System. Before performing particle bombardment, the Petri dish containing Arabidopsis leaves was moved into the PDS-1000/HeTM Biolistic Particle Delivery System (left). Part 1 and part 2 of the system were zoomed in at right. a is 1,100 psi rupture disk. b is microparticles carrier disk, which carries 1.0 μm Gold Microcarriers. c is stopping screen.Incubate the bombarded leaves for 24 h or 48 h at 23 °C in the dark.Mount the bombarded leaves on a glass slide with a coverslip to image with a Zeiss LSM 510 META or an equivalent confocal microscope.",
    "The GFP signal is excited by a 488 nm argon laser and emission is captured in the range of 505–545 nm; the mCherry signal is excited by a 543 nm HeNe laser and the emission is captured in the range of 590–625 nm. Use a 20x/0.25 Fluar objective lens to scan the GFP cell clusters. Twenty percent laser intensity is used to image every fluorescent cell clearly. Note: Acquire at least 60 images from each genotype for statistical analysis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}