{
  "id": 3002,
  "origin_website": "Cell",
  "title": "Protocol to test the utility of detergents for E. coli membrane protein extraction and delipidation",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDetermination of critical aggregation concentration\nTiming: 4 h per detergent\nThe minimum information from a detergent required for membrane protein purification is the cac. The cac of a detergent can be determined with dynamic light scattering (DLS) by monitoring the intensity of light that is scattered by detergent solutions. The intensity of light scattered from a sample solution has the unit kilo-counts per second (kcps). For detergent concentrations below cac, lower kcps values are obtained, which are similar to the kcps value of detergent-free water. For detergent concentrations above the cac, a steep increase in kcps values can be obtained. Therefore, plotting kcps values obtained from a broad range of detergent concentrations can enable extrapolating the cac of detergents.\nSample and instrument preparation.\nFor cleaning and the preparation of stock solutions solvents, filter the solvents (methanol and MilliQ) through a syringe filter (regenerative cellulose, 0.22 μm) prior to the experiment.\nCaution: Methanol is volatile, flammable, and toxic. Keep away from heat, hot surfaces, sparks, open flames, and other ignition sources. Wear protective gloves, protective clothing and safety glasses. Use under a fume hood.\nAlternatives: Methanol can be substituted for the less toxic isopropanol to rinse the cuvette.\nPrepare a dilution series of hybrid detergent in filtered milliQ water with concentrations of detergent between 10-8 and 10-2 mol L-1.\nFirst, make the stock solution A and filter it through a syringe filter (see above).\nPrepare stock solution B from stock solution A.\nProceed with the other stock solutions C-F accordingly to ensure accurate concentrations.\nNote: You can find the required volumes of detergent stock solutions and milliQ water for the dilution process in the table below:\ntable:files/protocols_protocol_2543_16.csv\ntable:files/protocols_protocol_2543_17.csv\ntable:files/protocols_protocol_2543_18.csv\ntable:files/protocols_protocol_2543_19.csv\ntable:files/protocols_protocol_2543_20.csv",
    "Rinse a Quartz Suprasil Semi-micro cuvette (width × length: 2 mm × 10 mm) with filtered methanol (3 × 1 mL) and filtered MilliQ (3 × 1 mL).\nCaution: Methanol is volatile, flammable, and toxic. Keep away from heat, hot surfaces, sparks, open flames, and other ignition sources. Wear protective gloves, protective clothing and safety glasses. Use under a fume hood.\nAlternatives: Methanol can be substituted for the less toxic isopropanol to rinse the cuvette.\nTurn on the Zetasizer Nano-ZS and allow the instrument to warm up for 30 min.\nSet the instrument parameters as follows:\ntable:files/protocols_protocol_2543_21.csv\nDLS Measurement.\nUse a glass Pasteur pipette to wash the cuvette with approximately 0.5 mL of the lowest concentration of detergent stock (0.0001 mg/mL). Discard the detergent solution.\nNote: This is a washing step. The cuvette is rinsed with the concentration to be measured so that any contaminations remaining are removed. The samples will be measured from lowest to highest concentration. Between the measurements the cuvette will be rinsed with the next higher concentration to ensure accurate measurements.\nTake a new Pasteur pipette and load approximately 0.5 mL of the solution containing the same detergent concentration (0.0001 mg/mL) into to the cuvette.\nNote: For accurate measurements the cuvette has to be filled so that the light beam passes through the solution. Here, we used 0.5 mL as minimum volume.\nPlace the cuvette into the sample holder of the Zetasizer instrument.\nStart the measurement. Following the parameters defined in the software (see Table in step 1e).\nNote: The sample will be thermally equilibrated for 2 min at 22.5°C, and analyzed by three measurements, each containing 11 runs. Each run takes 10 s, which gives a measurement time of approximately 4 min per detergent stock concentration. The total measurement time is 85 min.",
    "Use a Pasteur pipette to remove the sample solution from the cuvette.\nAdd approximately 0.5 mL of the next detergent stock concentration in the series (0.001 mg/mL) to the cuvette. Remove the solution from the cuvette.\nNote: This is a washing step. The cuvette is rinsed with the concentration to be measured so that any contaminations remaining are removed.\nAdd the same concentration from the previous step 2f and apply steps 2c-e.\nProceed with steps 2f and 2g and use the next higher concentration. Repeat until you reached the highest concentration (20 mg/mL).\nNote: Always start with the lowest concentration and gradually increase the concentration.\nAfter measuring the highest detergent concentration (20 mg/mL), rinse the cuvette with methanol (6 × 1.5 mL), MilliQ (3 × 1.5 mL) and methanol for a final rinse (1 × 1.5 mL).\nCaution: Methanol is volatile, flammable, and toxic. Keep away from heat, hot surfaces, sparks, open flames, and other ignition sources. Wear protective gloves, protective clothing, and safety glasses. Use under a fume hood.\nAlternatives: Methanol can be substituted for the less toxic isopropanol to rinse the cuvette.\nData processing.\nCalculate the average of the derived count rate values obtained from three measurements.\nNote: The unit of the derived count rate is kilo counts per second (kcps).\nPlot the logarithm of the derived count rate against the logarithm of the concentration.\nNote: The double logarithmic plots ideally show two characteristic regions: (1) a flat region with low count rates at lower detergent concentrations and (2) a linear growth of the count rate at higher detergent concentrations.\nFit both regions to linear functions and take the concentration at the intersection as the cac value (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2543-Fig1.jpg\nFigure 1. Determining the cac of detergents by DLS",
    "The logarithm of the derived count rate (kcps) is plotted against the logarithm of the detergent concentration. The flat region with low count rates at lower detergent concentrations and the linear growth of the count rate at higher detergents are fitted to linear functions. The intersection is takes as cac. (The image has been taken from (Urner et al.1[href=https://www.wicell.org#bib1]) with the permission of the authors).\nCritical: Measure detergent solutions in the order from lowest to highest detergent concentrations. Furthermore, the data output from Zetasizer Nano-ZS software can provide diffusion coefficients and hydrodynamic radii from any sample solution, regardless of the detergent concentration. The data related to detergent aggregates are most likely the ones obtainable above the cac.\nOptional: The measured sample can also be kept and used for other experiments.\nPause point: The sample solutions used during DLS experiment are not crucial for the following protein purification experiments. The cac determination by means of DLS is over at this point and related detergent samples can be stored at 4°C for up to 12 months.\nProtein extraction\nTiming: 5 h for 20 protein-detergent combinations\nDetergents are used to extract membrane proteins from E. coli membrane suspensions. At this step, the utility of detergents to enable the extraction and affinity purification of His-tagged membrane proteins from E. coli membrane suspensions is evaluated. First, membrane suspensions are solubilized with detergent. Second, membrane proteins are purified by immobilized metal affinity chromatography (IMAC). Third, membrane proteins are eluted from IMAC columns and quantified by absorption spectroscopy.\nPreparation of buffer solutions.\nUse the hybrid detergent stock solution made in step 4c (preparation of buffer and detergent solutions[href=https://www.wicell.org#sec1.2]) and add it to wash, elute and wash elute buffer.",
    "Note: The final concentration of the detergent-containing buffer solutions should be 2× the cac of the detergent (here 420 μM).\ntable:files/protocols_protocol_2543_22.csv\nStore at 4°C for up to 1 week.\ntable:files/protocols_protocol_2543_23.csv\nStore at 4°C for up to 1 week.\ntable:files/protocols_protocol_2543_24.csv\nStore at 4°C for up to 1 week.\nNote: It is recommended to use freshly prepared detergent-containing buffer solutions while the detergent-free buffer solutions can be stored for a month.\nPrepare the detergent-containing buffer solutions using the reference detergents according to the previous step 4a. Here, we used DDM and C8E4.\nPreparation of protein.\nCool all buffer and detergent solutions on ice.\nPut 900 μL extraction buffer to a centrifuge tube and add 100 μL of hybrid detergent stock solution (10 w% (w/v)) and add 100 μL of membrane suspension.\nMix the solution by inverting them and cool the samples on ice for 10 min.\nCentrifuge the samples for supernatant clarification (12,000 × g at 4°C for 5 min).\nPreparation of immobilized metal affinity chromatography (IMAC).\nAgitate bottle containing Ni-NTA agarose until it is a homogeneous suspension and add 800 μL of the Ni-NTA agarose suspension to empty spin columns.\nRemove the bottom caps of columns and apply pressure with your fingertip onto the upper opening of every column to initiate the solvent flow.\nAdd 1 mL detergent-containing wash buffers and wait until they ran through the columns.\nAccelerate solvent flows by applying pressure with your fingertip onto the upper openings of the columns.\nImmobilized metal affinity chromatography (IMAC) purification.\nIsolate clarified supernatants obtained from step 5f above and load them onto the columns.\nCritical: Do not accelerate solvent flows by applying pressure with your fingertip onto the upper openings of the columns at this step.\nNote: Load comparable volumes of protein-containing supernatant for every detergent.",
    "Pass the following detergent-containing buffers through the columns to purify membrane proteins: 1 mL wash buffer, 4 mL wash elute buffer.\nDiscard the flowthrough.\nPass the following detergent-containing buffer through every column to elute the purified membrane proteins: 400 μL elute buffer.\nCollect the flowthrough.\nRelative protein quantification.\nCollect the eluted sample in a polystyrene semi-micro cuvette (1 cm pathlength).\nMeasure the absorbance values at 485 nm for every sample on a photo spectrometer (IMPLEN). Troubleshooting 1[href=https://www.wicell.org#troubleshooting].\nPlot the absorbance values obtained at 485 nm against the detergents to compare relative protein yields.\nOptional: If samples are too diluted and no reliable absorption values at 485 nm can be determined in semi-micro cuvettes (1 cm pathlength), such as in the case of A485 values < 0.1, transfer all eluted membrane protein samples to Amicon 0.5 mL centrifugal filters with MWCOs that are lower than the molecular weight of the investigated membrane protein complex. Concentrate samples by centrifugation (12,000 × g at 4°C for 5 min). Determine concentrated sample volumes with an Eppendorf pipette. Determine the A485 value with a microvolume photo spectrometer (IMPLEN). Apply volume correction to the absorbance values: Divide the obtained sample volume by the largest sample volume detected among all samples from the same experiment. Multiply the result with the absorbance value detected at 485 nm. Apply this correction to all samples. Plot the A485 nm values against the detergent abbreviation to compare relative protein yields.\nNote: Some detergents may enable the isolation of large relative protein quantities upon extraction and affinity purification but may lead to protein precipitation during subsequent purification steps, such as concentrating or buffer exchange. If this is the case, then label the relative protein yields with an asterisk to indicate that the obtained membrane protein solution may be not stable (Figure 2[href=https://www.wicell.org#fig2]).",
    "imgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2543-Fig2.jpg\nFigure 2. Comparing relative protein yields obtained from AqpZ-GFP in different detergents\nHigher relative protein yields are obtained from DDM and C8E4. However, membrane protein solutions obtained from C8E4 were not stable as indicated by protein precipitation during subsequent purification steps, e.g., concentrating or buffer exchange. Relative protein yields are shown with standard deviation from three repeats (n = 3). (The image has been taken from (Urner et al.1[href=https://www.wicell.org#bib1]) with the permission of the authors).\nPause point: The samples can be frozen in liquid nitrogen and stored at – 80°C for up to 6 months. The stability may depend on the individual protein. Before usage thaw the sample on ice.\nNative mass spectrometry\nTiming: 1 h\nNative mass spectrometry (nMS) is used to liberate the apo form of membrane proteins and membrane protein-lipid complexes from detergent micelles inside the vacuum of a mass spectrometer. nMS experiments performed under comparable conditions can be used to compare relative delipidating properties of detergents.\nSample preparation.\nTake 75 μL Zeba™ Spin Desalting columns (MWCO = 7 kDa) and remove lids from bottom and top of the column.\nPlace the column into a 1.5 mL Eppendorf tube and remove shipping buffer by centrifugation (1,200 × g at 4°C for 1 min).\nLoad the column with 50 μL detergent-containing ammonium acetate buffer and centrifuge (1,200 × g at 4°C for 1 min).\nDiscard the eluted solvent.\nRepeat steps 9c-d four times in total.\nLoad the column with 8 μL of concentrated protein solution, place the column into a fresh 1.5 mL Eppendorf tube, and centrifuge (1,200 × g at 4°C for 1 min).\nStore Eppendorf tubes containing the eluted membrane protein samples on ice.\nDilute membrane protein-detergent mixtures with detergent-containing ammonium acetate to a comparable concentration, ideally a value between 1 – 10 μM.",
    "Instrument preparation.\nLoad .ipr file into the instrument software Tune.\nLoad 2 μL of eluted protein solution into a gold-coated nMS capillary.10[href=https://www.wicell.org#bib10]\nPlace gold-coated nMS capillary into the nMS interface.\nIn the instrument software, set HCD voltage to 0 V and capillary temperature to 50°C.\nApply gas pressure to the capillary until a small bubble is formed at the front end of the capillary.\nConnect the nMS interface with the MS instrument.\nSwitch on nMS voltage (capillary voltage).\nAcquire the mass spectra for approximately 5 s and save the data.\nLoad MS data into the software Xcalibur, sum up the acquired mass spectra and check if protein signals are visible. Troubleshooting 2[href=https://www.wicell.org#troubleshooting].\nIncrease the HCD voltage by 50 V steps.\nAt each HCD voltage change, acquire the spectra for 5 s and check if protein signals are visible by following the procedure described in step 10h above.\nNote: If protein signals are visible, identify the minimal HCD voltage required to obtain a resolved spectrum of your target protein with no detergents bound. Finish with a maximum HCD voltage of 300 V. It is recommended to scan the HCD voltage from 0 to 300 V to find the optimal conditions for the acquirement of membrane protein mass spectra. Troubleshooting 3[href=https://www.wicell.org#troubleshooting].\nData Analysis.\nCompare those mass spectra that were obtained from membrane proteins in different detergents and acquired using comparable protein concentrations and activation conditions (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2543-Fig3.jpg\nFigure 3. Comparing relative delipidating of AqpZ-GFP in different detergents by nMS",
    "Relative intensities of membrane protein apo form and membrane protein-lipid complexes are compared between different detergents. The relative intensity of membrane protein-lipid complexes decreases from DDM to hybrid detergent to C8E4. Samples were analyzed under comparable instrument conditions. (The image has been taken from Urner et al.1[href=https://www.wicell.org#bib1] with the permission of the authors).\nAssign membrane protein charge states by using MaCSED (For details and download see: http://benesch.chem.ox.ac.uk/resources.html[href=http://benesch.chem.ox.ac.uk/resources.html]) or Unidec.11[href=https://www.wicell.org#bib11]\nAssign signals for membrane protein apo form and membrane protein-lipid complexes.\nNote: Compare the analyte mass obtained from MaCSED or Unidec with the theoretical protein mass calculated from its amino acid sequence or the sum of the theoretical protein mass and its ligand complexes.\nCompare similar charge states to assess relative trends in membrane protein delipidation.\nAlternatives: Extract relative intensities of membrane protein apo form and membrane protein-lipid complexes from nMS data and calculate the relative amounts for comparison.\nNote: To compare delipidating properties of detergents, extract relative intensities of apo form and protein-lipid complexes from mass spectra acquired at similar activation conditions, e.g., similar HCD voltage and capillary temperature. Latest instruments also allow additional ion activation through in-source trapping."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Model Organisms",
    "Mass Spectrometry",
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}