{
  "id": 11192,
  "origin_website": "Jove",
  "title": "Endothelialized Microfluidics for Studying Microvascular Interactions in Hematologic Diseases",
  "procedures": [
    "1. Fabrication of the Endothelial Microdevice\nCreate a photomask by  submitting a computer assisted design (CAD) drawing of the microfluidic device  to an outside mask vendor. The mask used  was composed of a chrome layer on soda lime glass. In this case the microfluidic channel width  was 30 μm.\nClean a bare silicon  wafer with piranha (10:1 ratio of sulfuric acid and hydrogen peroxide) for 15  minutes and dip in hydrofluoric acid for 30 seconds. Rinse with deionized (DI) water for  approximately 10 seconds.\nUsing a spin coater,  spin Microchem SU-8 2025 photoresist onto the wafer to a height of 30 μm. For SU-8 2025, a spin speed of 3000 rpm is  recommended. Other viscosities of SU-8  are available which will achieve this height.  Full instructions for SU-8 use are available at www.microchem.com[href=http://www.microchem.com]\nPlace the wafer with  SU-8 on a hotplate at 95 °C for 5 minutes to drive off excess solvent.\n  Note: An oven will dry the wafer differently than a hotplate and is not recommended.\nPlace a mask with the  desired feature shape over the wafer, and expose to UV light (160 mJ/cm2 measured at 365 nm) in a mask aligner (Karl Suss, MA-6). This cross links the photoresist.\nPlace the wafer back  on a hotplate at 95 °C for an additional 5 minutes to further accelerate the  polymerization of SU-8.\nImmerse the wafer in  SU-8 Developer, composed primarily of PGMEA (propylene glycol methyl ether  acetate) for 4 minutes to remove the non-cross-linked SU-8.\nRinse the newly  developed wafer with 100% isopropyl alcohol (IPA) for 10 s. The wafer may then be dried using pressurized  nitrogen or by allowing the solvent to evaporate from the wafer in a clean fume  hood for several minutes.",
    "Tape the edges of the  dry wafer with patterned SU-8 into a petri dish to prevent movement.\nApply 1 mL of Sigmacote  to the wafer using a pipette, cover with the top of the petri dish, and swirl  wafer to ensure complete coating of the wafer, remove cover, and allow wafer to  dry for several minutes until all solvent has evaporated.\n2. PDMS (Polydimethylsiloxane) Preparation\nMix PDMS polymer and  curing agent at a 10:1 ratio (w/w) and remove air bubbles using a vacuum  desiccator. The length of time needed to  degas the PDMS varies on the strength of the available vacuum system, but  typically ranges from several minutes to one hour. For a six inch petri dish with no previously  poured PDMS, a total volume of 60 mL of polymer is recommended.\nPour the mixture onto the wafer, approximately 5 mm thick. Also pour onto a flat bottom dish to create a thin sheet of PDMS,  approximately 1 mm thick. Cure at 60 °C in an oven overnight.\nUsing a knife or  scalpel, cut out around the cured PDMS device and remove it from the wafer.  Additionally, cut a thin sheet of PDMS slightly larger than the device.\nCreate inlet and  outlet holes in the PDMS device using a 1.0 mm hole punch. This may be accomplished using either a pin  vice, Harris Uni-Core, or similar device.\nClean the surfaces of  the device and the sheet using scotch tape.\nUsing a plasma  cleaner, expose the surfaces of the PDMS device and PDMS sheet to oxygen plasma  for 30 s. The oxygen plasma creates  reactive species on the exposed surface of the PDMS which bond when brought  into physical contact.",
    "Connect smaller  tubing to a small length (several centimeters) of large tubing, which in turn  is connected to a syringe with a blunt-point needle, filled with 50 μg/ml  fibronectin from human plasma in PBS.  The tubing and needle are sized such that a friction fit is created  between the tubing. Insert smaller  tubing in the inlet of PDMS microdevice and apply pressure to the syringe to  fill the channels completely with fibronectin solution and to create a small  100 μL drop at the outlet port, to ensure that the channels stay wet. Incubate the device at 37 °C for 40-60 min.\nConnect a fresh  syringe filled with PBS to the blunt point needle. Apply pressure to the syringe to rinse the device with PBS.\n3. Seeding the Microfluidic Device with Endothelial Cells\nPrepare 1,000,000  cells/mL of human umbilical vein endothelial cells (HUVECs) in endothelial  growth media with 8% dextran. A range of 500,000 to 2,000,000 cells/mL has  been successfully used. Addition of dextran to the cell loading medium increases  the viscosity of the fluid, which decreases the velocity of endothelial cells  as they enter the fibronectin-coated microfluidic system. This, in turn, increases  the likelihood that the cells will adhere and culture successfully within the  microdevice.\nConnect the new  syringe and tubing as in Step 2.7. but with a longer tubing (approximately 1  meter in length).",
    "To  optimize the performance of this system, it is critical at this point to  prevent any leaks or bubbles in the entire perfusion system; any leakage of  solution or presence of bubbles in the media will change the flow and prevent  successful seeding of endothelial cells. Therefore, tight fitting of the tubing  is essential to eliminate leakage between any connections. Bubbles in the  syringe and/or tubing must be eliminated before cells are introduced in the  microdevice and the entire perfusion system should be primed with the cell  solution before attaching the tubing to the microfluidic to avoid the  introduction of air bubbles.\nUsing a syringe pump,  infuse cell suspension into PDMS device at volumetric flow rate of 1.23 μl/min  for 2 hours at 37 °C and 5% CO2. Optimal results were achieved when the  syringe pump was at the same height as the PDMS device. For the inlet, the longer tubing, which can  be coiled within the incubator, ensures that the cells and media are adequately  warmed before coming in contact with the device. In our system, the volumetric  flow rate of 1.23 μl/min approximates a midstream velocity of ~1 mm/s in the  smallest microchannels, corresponding to a wall shear stress of ~1 dyne/cm2 at those channels using whole blood.\nUsing the same  syringe pump and long tubing, perfuse fresh growth media for 2-8 days at ratio  of 1.23 μl/min. A successful device will  have a monolayer of endothelial cells growing on the inside of the device  within 24-48 hours. Previous experiments have shown that confluent monolayers  appropriately express VE-cadherin at cell-cell junctions throughout the device14.\nInject blood or cell  suspension into system for experimentation.\n4. Representative Results",
    "Using this protocol, standard lithographic microfabrication techniques are used to create the mold needed to produce the microfluidic channels that physiologically mimic the sizescale of the microvasculature (Figure 1A). Using an optimized perfusion technique, endothelial cells then seed and confluently culture the entire inner surface of the microfluidic system within 24-48 hours of cell seeding (Figure 1B).  As the microfluidic system is transparent, the entire microdevice can be placed on a brightfield/fluorescence microscope stage for imaging and data collection.\nOur system can then be applied to study hematologic diseases that involve altered biophysical properties, such as sickle cell disease, in which the increased rigidity of sickled red cells and aberrant leukocyte and endothelial adhesion contribute to microvascular obstruction. A clinically approved medication, hydroxyurea, ameliorates symptoms but its direct effect on microvascular flow is unknown. Our assay takes into account both cell rigidity and adhesion, and demonstrates that hydroxyurea significantly ameliorates flow in sickle cell disease (Figure 2).\nSickle cell disease is only one example of an application for the microvasculature-on-a-chip, as this system is ideally suited to study any hematologic process in which blood cells interact with each other and endothelial cells in the microvasculature. Other clinically relevant applications include inflammatory disorders, sepsis/lung injury, thrombotic microangiopathies, malaria, and cancer metastasis while more basic applications include leukocyte biology and hematopoietic stem cell biology, among many others.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3958/3958fig1.jpg\nFigure 1. A) the initial PDMS microfluidic device before endothelialization. Here, the microdevice is injected with food coloring to illustrate sizescale and overall design of the system.  B) Brightfield microscopy shows the microfluidic system is completely endothelialized within 48 hours of cell seeding using the protocol described here.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3958/3958fig2.jpg",
    "Figure 2. A) The  microvasculature-on-a-chip with microchannels approximates the size of post-capillary  venules (30 μm), the site of most sickle cell microvascular obstructive events.  Whole blood from sickle cell patients receiving hydroxyurea and from patients  not receiving hydroxyurea is flowed through two different microvasculature-on-a-chip  devices. B) Whole blood from sickle cell patients receiving hydroxyurea flows  with relative ease within the endothelialized microchannels. C) Under the same  hemodynamic conditions, whole blood from sickle cell patients not receiving hydroxyurea,  however, exhibits much more sluggish flow with microchannel obstruction. The bottom  channel is completely obstructed with no flow and the flow velocities in the  other endothelialized microchannels are significantly lower than in the  hydroxyurea condition. The scale bar in all three images is 30 μm.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}