{
  "id": 2082,
  "origin_website": "Cell",
  "title": "Protocol for in vitro lysine deacetylation to test putative substrates of class III deacetylases",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nEnzyme and substrate preparation: Day 1\nTiming: 30 min\nTransfection of cells should be done in the hood.\nTransfecting of the putative substrate and the deacetylase 10 μg of DNA of the substrate with 250 μL of Opti-MEM. To increase baseline substrate acetylation levels, it’s recommended to co-transfect 2–3 μg of DNA of the acetyltransferases known to target the substrate.\nNote: We recommend, as a starting point if the specific acetyltransferases are unknown, using a combination of p300, pCAF, and CBP (see troubleshooting[href=https://www.wicell.org#troubleshooting]: Problem 1[href=https://www.wicell.org#sec6.1] for further details). Separately, mix gently by tube inversion 18 μL of Lipofectamine 2000 in 250 μL of Opti-MEM. Let both mixtures stand for 5 min, then combine in one tube. Let sit at room temperature (23°C) for 20 min, then add to 5–6 million HEK 293T cells in one 60 mm dish. Add drop-wise, then gently mix the cells.\nMix 5 μg of DNA of the deacetylase with 250 μL of Opti-MEM.\nSeparately, mix 10 μL of Lipofectamine 2000 in 250 μL of Opti-MEM.\nLet both mixtures stand for 5 min, then combine together in one tube.\nLet sit at room temperature (23°C) for 20 min.\nAdd in a drop-wise fashion to 5–6 million HEK 293T cells in one 60 mm dish.\nGently mix the cells.\nIncubate the cells with the transfection reagents and DNA for about 16 h overnight. HEK 293T cells should be incubated at 37°C with 5% CO2 content, but if other cell lines are used, other conditions may be required. We recommend using HEK 293T cells with a passage number less than 30.\nAlternatives: Different acetyltransferases will optimally target different substrates. This step can be optimized for the substrate using a different combination of acetyltransferases. Refer to troubleshooting[href=https://www.wicell.org#troubleshooting]: Problem 1[href=https://www.wicell.org#sec6.1].",
    "Enzyme and substrate preparation: Day 2\nTiming: 15 min\nCheck the cell confluency and viability of the transfected cells from day 1.\nNote: The cells should be about 90%–95% confluent for both the cells transfected with the deacetylase and the cells transfected with the substrate. The number of dead cells should be minimal, but will depend on the substrate being transfected.\nTrpysinize the cells and split each dish equally into two 10 cm dishes for a total of four 10 cm dishes.\nEnzyme and substrate preparation: Day 3\nTiming: 15 min\nAdd to the cells with the substrate transfection ONLY: Tricostatin A (TSA) to a final concentration of 0.5 μM, and nicotinamide to a final concentration of 1 μM to inhibit class I and II, and class III acetyltransferases, respectively. Let cells incubate overnight for 12–16 h to maximize acetylation.\nDeacetylase and substrate preparation: Day 4\nTiming: 2 h\nTrypsinize the cells and collect cells in an Eppendorf tube, combining duplicate dishes into one tube. Add an equal amount of media to the amount of trypsin used to neutralize the trypsin.\nCentrifuge the cells at 3,500 × g – 5,000 × g for 5 min and discard the supernatant, being careful not to discard the cell pellet.\nFor each tube, wash cells once with 1 mL of PBS and spin for another 5 min at 3,500 × g – 5,000 × g. Remove the supernatant after the wash, leaving behind only the cell pellet.\nLyse each tube of cells with about 400 μL–500 μL cell lysis buffer (described under materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Gently rotate the tubes or place on a rocker at 4°C for 30–40 min.\nSpin the cells down at maximum speed (∼17,000 × g) for 15 min at 4°C.",
    "While the cells are spinning, prepare the beads that will be used for pre-clearing the lysate. 30 μL of a slurry of 50% beads will be used for every 500 μL of lysate. Spin the beads down, then wash the beads 2 times with 500 μL lysis buffer, then resuspend the beads in lysis buffer using a volume equal to ½ the initial volume of the bead slurry, to bring back up to the original volume.\nNote: To spin and wash the beads, spin the beads for 30 s at 100 × g, then turn the tubes 180 degrees in the centrifuge and spin again for another 30 s at 100 × g. Remove supernatant, leaving only the beads behind. Add 500 μL lysis buffer and repeat the spin using the same conditions as just described. Remove buffer leaving only the beads behind.\nKeep the beads on ice and centrifuge at 4°C. For FLAG-tagged substrates, CL-4B Sepharose beads can be used for pre-clearing.\nNote: Protein G agarose beads can also be used if the antibody that will be used for the IP will be mouse, while protein A agarose beads can be used for preclearing if the IP antibody will be rabbit.\nAfter the spin is complete from step 13, carefully transfer the supernatant to a clean tube; discard the cell debris. To preclear the lysate, add 30 μL of the cleaned pre-clearing beads per every 500 μL of lysate. Rotate the lysate and beads at 4°C for 15 min.\nWhile the lysate is pre-clearing, prepare the beads for immunoprecipitation for the tags that will be used. 30 μL of a 50% slurry of conjugated beads will be used for every 500 μL of lysate. Prepare the beads as described in step 12.",
    "Note: Protein G agarose beads should be used if the antibody that will be used for the IP will be mouse, while protein A agarose beads should be used if the IP antibody will be rabbit.\nAfter the pre-clear has completed, spin the lysate and beads down using the same conditions used in step 12 for washing the beads. Move the supernatant to their respective beads for immunoprecipitation using an anti-FLAG antibody (or antibody against the tag).\nAllow tubes to rotate at 4°C overnight (12–16 h). The amount of antibody used for the immunoprecipitation will depend on manufacturer’s instructions, but a 1 μg antibody:1 mg of lysate is generally suggested as a starting point for optimization.\nDeacetylase preparation: Day 5\nTiming: 45 min\nTo collect the deacetylase, wash beads 4 times with lysis buffer using the same conditions as described in step 12.\nWash the beads 3 more times with TBS using the same conditions as described in step 12 with. At the end, remove the supernatant, only leaving the beads. Add 100 μL of TBS for every two dishes of cells to the beads (this volume can be adjusted but should be 2 times the volume of the packed beads at minimum).\nFor elution using a FLAG-tagged deacetylase, add 3 μL of 3× FLAG Peptide stock (5 mg/mL) for every 100 μL TBS.\nTo elute, either manually agitate the beads by gentle tapping every 5 min for 30 min on ice or rotate at 4°C for 30 min, if the volume is sufficient (we recommend about no more than 2/3 of the volume of the tube be empty; e.g., for a 1.5 mL Eppendorf tube, the minimum volume would be about 500 μL).",
    "After 30 min, spin down the beads as described in step 12. Transfer the supernatant, which contains the eluted deacetylase, into small aliquots for storage at −80°C, for up to 1 year.\nTo quantify the concentration of the deacetylase, run a sample of the elutant on an SDS-PAGE gel against a BSA standard curve and stain with Coomassie blue.\nNote: Measurement using a Bradford protein assay can also be used, but may be less precise depending on the amount of non-specific proteins pulled down during purification. Roughly, the concentration of the deacetylase should be around 1 μg of protein/15 μL. About 1 μg of deacetylase will be needed for each reaction where the deacetylase is used.\nDeacetylase assay: Day 5\nTiming: 4 h\nWash the beads bound to the substrate 4 times with lysis buffer.\nAfter the wash with lysis buffer, wash the beads 2 times with 1× deacetylation buffer. Resuspend the beads in 1 mL of deacetylation buffer and equally split the beads into N tubes, where N is the number of treatments/conditions. We recommend four reactions below to demonstrate deacetylation of the substrate of interest.\nSpin the beads down as described in step 12 and carefully aspirate away all liquid using a vacuum or pipette, ensuring even distribution of the beads in each tube.\nThe reactions for the conditions should be set up as follows:\ntable:files/protocols_protocol_1566_8.csv",
    "Note: The deacetylase should be added LAST to each tube. ∗: A deacetylase-dead mutant may be used instead of the wild-type deacetylase in place of using nicotinamide to inhibit the enzymatic reaction. If this is done, omit the addition of nicotinamide and instead add 0.3 μL of dH2O. ∗∗: Volume may vary, refer to step 23. †: Alternatively, 4.8 μL of NAD+ and 5.1 μL of dH2O can be added instead as a control for contamination of the pull down of the substrate with class III deacetylases.\nReaction 1: No deacetylase.\nThis reaction should show the baseline levels of substrate acetylation.\nReaction 2: Deacetylase only.\nThis reaction should not show any change in acetylation levels compared to reaction 1 due to lack of necessary cofactor NAD+ for class III deacetylases. NAD+ can be added if contamination with other class III deacetylases is expected.\nReaction 3: Deacetylase + NAD+\nA stock of 50 mM of NAD+ is used for class III deacetylases for the cofactor. If the deacetylase directly targets the substrate, a decrease in acetylation should be seen.\nReaction 4: Deacetylase + cofactor + deacetylase inhibitor.\nA stock of 50 mM of NAD+ is used for class III deacetylases for the cofactor.\nA stock of 2 M nicotinamide is used to inhibit class III deacetylases. No change in acetylation levels of the substrate should be seen compared to Reaction 1 and 2 due to deacetylase inhibition. The volume of the deacetylase may vary depending on the concentration after purification (see step 23). 1 μg of deacetylase is suggested for use in Reactions 2–4.\nIncubate the reactions in a 30°C water bath with gentle tapping to agitate the beads every 15 min for 3 h. Alternatively, a 30°C shaker can be used.",
    "After 3 h of incubation, add ∼8 μL of 4× sodium dodecyl sulfate (SDS) loading buffer to stop the reaction. Boil the samples for 5 min at 100°C and run on western blot for analysis, or store at −20°C for later analysis.\nNote: Transfer conditions may depend on the substrate, but 1 h at 100 V or overnight (12–16 h) at 45 V should give sufficient transfer. Blocking can be done with 5% BSA or 5% milk but may need to be optimized.\nFor the best acetyl-lysine signal, it is suggested to incubate the membrane overnight (12–16 h) on a rocker at 4°C. The deacetylase should also be probed for to ensure there was even addition to the correct samples.\nCritical: Dual channel labeling is most ideal to show the overlap of the acetylated protein and total protein. We suggest using differently colored fluorescent probes, which can be imaged using a LI-COR Odyssey system (LI-COR), which allows for dual channel labeling detection. We also suggest probing for the deacetylase to ensure even levels of the enzyme were added to Reactions 2–4. During the primary antibody step, for dual-labeling, the antibody to the substrate should be a different species to the acetyl-lysine antibody (see reagents) without species cross-reactivity."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Cell-Based Assays",
    "Protein Biochemistry",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}