{
  "id": 9174,
  "origin_website": "Jove",
  "title": "Live Imaging of Nicotine Induced Calcium Signaling and Neurotransmitter Release Along Ventral Hippocampal Axons",
  "procedures": [
    "All animal experiments were carried out in accordance with the National Institutes of Health Guide for the Care and Use of Laboratory Animals (NIH Publications No. 80-23, revised 2012) and studies were approved by Institutional Animal Care and Use for Research Committees at Stony Brook University (#1618 and #1792).\n1. vHipp-nAcc Synaptic Co-cultures\nSacrifice mice (postnatal day 0 - 3, from wild-type (WT) or α7 nAChRs transgenic mouse line) with CO2. Decapitate each pup and save the tail in a 1.5 ml centrifuge tube for post facto genotyping. Perform the following steps in a sterilized hood.\nRemove the top of the skull with scissors and forceps to expose the whole brain. Starting at the juncture where the cerebral cortices part from each other caudally, obtain a coronal section that contains the posterior cortices including the vHipp5,21 under a dissecting microscope.\nDissect vHipp tissue strips containing the CA1-subiculum region out according to a developing mouse brain atlas22 (Figure 1A). Transfer to a 35 mm culture dish containing cold culture media (4 °C), cut into small thin slices (around 100 µm × 100 µm microslices).\nPre-incubate 12 mm poly-D-lysine/laminin-coated glass coverslips inside 24 well tissue culture plates with culture media (~ 500 μl) for at least 30 min in the incubator at 37 °C. Remove media before plating microslices.\nPlate with a fire-polished Pasteur pipette at the center of the coverslip with minimal amount of media (~ 50 μl, containing ~ 20 pieces of microslices) to facilitate attachment of the explants. Plate vHipp microslices originating from a single animal (either the +/+ or the -/- genotype of the transgenic α7 line) on each coverslip.",
    "After the explants settle onto the coverslip, gently add additional media (~ 100 μl) by the wall so that the level of the media is high enough to completely cover the explants on the periphery, but not those at the center of the coverslip.\nAfter an O/N incubation in 37 °C, 5% CO2 incubator, disperse nAcc neurons from embryonic days 18 to postnatal day 1 WT mice and add to the explants.\n\t\nDissect out nAcc tissues according to a developing mouse brain atlas20 (Figure 1B).\nCut into small pieces (around 500 µm × 500 µm microslices) and transfer to a 15 ml tube.\nTreat with 0.25% trypsin (2 ml) for 15 min at 37 °C. Wash tissue chunks three times with cold washing media (5 ml, 4 °C) followed by one wash in cold culture media (5 ml, 4 °C). Allow suspension to rest for 5 min in each wash step, and then pour off supernatant carefully.\nDissociate cells by gentle trituration in 2 ml of culture media with a lightly fire-polished Pasteur pipette.\nTransfer cell suspension to another 15 ml tube and centrifuge at 2,000 x rpm for 5 min. Remove the supernatant and resuspend the cells in culture media at 1 ml per 6 pups. Disperse cells by gently pipetting in media several times with a fire-polished Pasteur pipette.\nAdd 0.25 ml of dispersed nAcc cells to each coverslip with vHipp explants.\nMaintain the cultures in a humidified 37 °C, 5% CO2 incubator. Place culture plates on dampened sterile gauze pads to mechanically stabilize and maintain humidity, facilitating synapse formation.\n2. Immunocytochemistry\nFix cultures (5 - 7 days in vitro) in 4% paraformaldehyde/4% sucrose/PBS (~500 μl per coverslip, 20 min, RT).\nPermeabilize cultures with 0.25% Triton X-100/ PBS (~500 μl per coverslip, 5 min, RT).",
    "Block cultures with 10% normal donkey serum in PBS (~500 μl per coverslip, 30 min, RT) prior to antibody staining. Incubate with primary antibodies O/N at 4 °C. Use the following primary antibodies: anti- nAChRs (α4-ECD 1:500; anti-α5 subunits, 1:500), anti-vesicular glutamate transporter 1 (1:250), anti-GAD65 (1:100).\nWash primary antibodies out with PBS (3 times/~500 μl per coverslip, 5 min) and then incubate cultures in secondary antibodies conjugated to Alexa 488 (~500 μl per coverslip, 1:500) or Alexa 594 (~500 μl per coverslip, 1:500) for 1 hr at 37 °C.\nIncubate cultures in αBgTx conjugated to Alexa 594 (~500 μl per coverslip, 1:1,000 in culture media) for 45 min at 37 °C prior to fixation for labeling surface α7*nAChRs.\nMount and seal coverslips.\nCapture images with a fluorescence microscope equipped with Plan-Apochromat objectives (20X with 0.8 NA or 63X oil with 1.4 NA) and a CCD camera.\n3. FM1-43 Based Vesicular Fusion\nMaintain cultures (5 - 7 days in vitro) in an imaging chamber, mount the chamber on spinning disk confocal microscope. Continuously perfuse (1 ml/min) with HBS cocktail at RT.\nStop perfusion and load cultures with 10 µM FM1-43 in 56 mM K+ ACSF (~500 μl) for 90 sec (staining), wash external dye away for 15 min with Ca2+ free HBS containing ADVASEP-7 (0.1 mM) to scavenge membrane-bound FM1-43.\nStimulate the cultures with 56 mM K+ ACSF (~500 μl) without FM1-43 for 120 sec (destaining), reload cultures with FM1-43 using the same conditions, and wash again with Ca2+ free HBS containing ADVASEP-7 for 15 min.\nAcquire FM1-43 fluorescence images with spinning disk confocal microscope equipped with a Plan-Apochromat objective (60X water with 1.4 NA, excitation 488 nm, emission 530 nm) and capture images with a CCD camera.",
    "Collect baseline FM1-43 fluorescence images (every 2 s for 1 min) as pre-nicotine control; apply nicotine (1 µM) by rapid perfusion (2 ml/min) for 1 min, and then wash nicotine out with HBS cocktail. Keep capture time-lapse images before, during, and after nicotine application every 2 sec for 5 min.\nQuantify FM1-43 fluorescence intensity before (Fstaining) and after (Fdestaining) nicotine application at each synaptic bouton.\nCalculate total amount of releasable FM1-43 fluorescence along vHipp axons by quantifying the difference of FM1-43 fluorescence intensity before and after nicotine application (ΔF = Fstaining-Fdestaining). Analyze fraction of fluorescence intensity decrease after nicotine with the following equation: Fdecrease% = ΔF/Fstaining.\n4. Calcium Imaging\nRinse cultures (5 - 7 days in vitro) quickly with normal HBS, then load cultures with 5 µM Fluo-4 Ca2+ indicator (AM ester) and 0.02% Pluronic F-127 in HBS (2 ml) for 30 min at 37 °C and 5% CO2.\nWash out Fluo-4 solution with HBS (3 times/5 min). Return cultures to incubator (37 °C / 5% CO2) for at least 30 min.\nMaintain cultures in the same imaging chamber and same conditions as described in FM1-43 based vesicular fusion section (see step 3.1).\nCollect Fluo-4 fluorescence images of axonal projections from the vHipp micro-slices with a Plan-Apochromat objective (60X water with 1.4 NA, excitation 488 nm, emission 530 nm) and a CCD camera.\nCollect baseline Fluo-4 fluorescence images (every 10 sec for 2 min) as pre-nicotine control, apply nicotine (1 µM) by rapid perfusion (2 ml/min) for 1 min, and then wash nicotine out with HBS cocktail. Keep capture time-lapse images before, during, and after nicotine application every 10 sec for 30 min.\nSave all frames of the raw fluo-4 fluorescence images, export as a series of TIFF format images for further analyzing.",
    "Collect the integrated intensity of fluo-4 fluorescence along vHipp axons before and after nicotine application.\nNormalize integrated fluorescence intensity with the following equation: ΔF/F0 =  (F-F0)/F0, where F0 is the background-corrected pre-nicotine integrated fluorescence intensity and F is the integrated fluorescence intensity along vHipp axons at each time point after nicotine application. Analyze and plot normalized integrated fluorescence intensity.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}