{
  "id": 3304,
  "origin_website": "Cell",
  "title": "On-bead purification and nanodisc reconstitution of human chemokine receptor complexes for structural and biophysical studies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCell lysis and receptor solubilization\nTiming: 2–3 h\n      After harvesting chemokine receptor-expressing insect cells, the cell\n      pellets can be frozen at −80°C until use. For purification, the cell\n      pellets are either used directly or thawed (if frozen) and the chemokine\n      receptors are extracted from the cell membranes using detergent. The\n      protocol described below is optimized for 1 L of insect cells but can be\n      scaled to accommodate other volumes.\n    \n        Resuspend and thaw cell pellets with cold 40 mL Low Salt buffer on ice.\n      \n        Dissolve:\n        \n1 tablet of protease inhibitor in 1 mL Low Salt buffer.\n100 mg iodoacetamide in 1 mL Low Salt buffer\n            If the chemokine is not co-expressed with the receptor, solubilize\n            the ligand to the desired concentration in Low Salt buffer.\n          \n      Add the above reagents to the cell solution, homogenize with a 40 mL glass\n      dounce homogenizer 20–40 times, transfer to a 50 mL conical tube and\n      rotate at 4°C for 20 min.\n    \nNote: In the absence of co-expressed\n      chemokine, chemokine receptors do not extract efficiently from cell\n      membranes and are usually unstable after extraction. In this case, we\n      recommend using high affinity small molecule ligands or purified chemokine\n      at a concentration at least 1000-fold over the receptor:ligand\n      dissociation constant (Kd) for extraction.\n    \n        Add 40 mL cold 2× Solubilization buffer containing 2 mM ATP to the cell\n        lysate.\n      \n        Stir the solubilization mixture in a glass beaker with a stir bar at 4°C\n        for 3 h.\n      \n        Centrifuge the solubilization mixture at 50,000–100,000 × g, 4°C\n        for 30 min, and keep the supernatant on ice for subsequent purification\n        and reconstitution steps.\n      \nNote: The solubilized receptor is\n      generally not stable enough for long-term storage at 4°C, and\n      freeze-thawing can compromise the sample. Proceed immediately to the\n      purification and reconstitution steps.\n    \nOn-bead purification and reconstitution",
    "Timing: 1 day\n      Combining purification and nanodisc reconstitution steps while the\n      receptor of interest is still bound to the affinity resin is critical for\n      maintaining protein stability and avoiding protein loss during the\n      process. We highly recommend using high specificity affinity purification\n      systems such as Rhodopsin 1D4 or Flag tag. Here we describe our Rho 1D4\n      affinity purification strategy, which has been shown to be successful for\n      many GPCRs including chemokine receptors.17[href=https://www.wicell.org#bib17],18[href=https://www.wicell.org#bib18] However, other affinity\n      purification strategies such as Flag can be used with slight modifications\n      of the protocol.\n    \nNote: All steps should be performed on\n      ice.\n    \n        Wash the Rho 1D4 antibody resin by equilibrating 0.5 mL of the resin\n        slurry (containing 50% resin) with 5 mL Regular buffer in each of two\n        50 mL conical tubes. Centrifuge the tubes at 300 × g, 4°C for\n        5 min; discard the supernatant.\n      \n        Add the solubilized receptor from step 5 to the washed 1D4 resin. Rotate\n        at 4°C for 2 h.\n      \n        Centrifuge the receptor-1D4-resin mixture at 300 × g, 4°C for\n        5 min; then discard the supernatant.\n      \n        Wash the resin in each tube with 20 mL Regular buffer; centrifuge for\n        5 min at 300 × g, 4°C and discard the supernatant.\n      \n        Transfer the receptor-1D4-resin to two separate 2 mL Protein lo-bind\n        tubes, wash one more time with 1 mL Regular buffer, centrifuge as above\n        and discard the supernatant. The resin volume in each tube should be\n        around 250 μL.\n      \n        Dilute the POPC:POPG lipid stock to 2 mM (total lipid) with 1 mL Regular\n        buffer, add 500 μL of the 2 mM lipid mixture to each centrifuge tube of\n        receptor-1D4-resin, and rotate at 4°C for 30 min.\n      \n        Centrifuge the lipid-receptor-1D4 resin mixture for 1 min at 300 × g\n        and 4°C; discard the supernatant.",
    "Add 500 μL 2 mg/mL MSP1D1 to each tube; rotate at 4°C for 30 min.\n        To remove detergent, add ∼20 mg of washed Bio-beads SM-2 resin to the\n        MSP1D1-lipid-receptor-1D4 resin mixture; rotate at 4°C for 12–16 h.\n      \nNote: The Bio-beads need to be\n      reconstituted according to\n      instructions from the manufacturer[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/Lit195.pdf]\n      before use. The beads are first washed with methanol and then thoroughly\n      washed with water. The beads can be stored in water before use.\n    \n        Centrifuge the Bio-bead-MSP1D1-lipid-receptor-1D4 resin mixture for\n        1 min at 300 × g, 4°C; discard the supernatant.\n      \n        Wash each tube of Bio-bead-MSP1D1-lipid-receptor-1D4 resin with 500 μL\n        HBS buffer; centrifuge for 1 min at 300 × g, 4°C, and discard the\n        supernatant.\n      \nRepeat step 16 twice.\n        To elute the nanodisc-solubilized receptor from the 1D4 resin, add\n        500 μL of 200 μM 1D4 peptide solubilized in HBS buffer to each tube and\n        rotate at 4°C for 1 h.\n      \n        To separate the nanodisc-solubilized receptor from the beads and the\n        resin, centrifuge for 1 min at 300 × g, 4°C, and collect the\n        supernatant from each 2 mL centrifuge tube in a 15 mL conical tube.\n      \n        Repeat step 18–19 twice and combine all eluants in a single 15 mL\n        conical tube for a total of approximately 3 mL of nanodisc-solubilized\n        receptor. Store at 4°C for future use. The length of time the sample can\n        be stored without loss of integrity is dependent on the receptor systems\n        but in general it can be stored for at least a few days to a week.\n      \nAlternatives: Other affinity\n      purification strategies may be employed. For example, Flag-tagged receptor\n      may be purified with M2 Flag antibody resin and eluted with 3XFlag\n      peptide.\n    \nOptional: Depending on the intended\n      use of the reconstituted receptor, researchers can concentrate the elution",
    "collection to a desirable concentration and use directly. However, further\n      purification using methods such as size exclusion chromatography (SEC) are\n      strongly recommended.\n    \nNote: Freezing of the reconstituted sample\n      is not recommended.\n    \nSize exclusion chromatography\nTiming: 2–3 h\n      Nanodisc-solubilized chemokine receptors purified by affinity purification\n      strategies, such as that described above, usually do not have sufficient\n      purity for structural studies. A subsequent purification step using size\n      exclusion chromatography (SEC) can substantially improve purity, and the\n      SEC chromatograms provide a metric of the quality of the preparation. This\n      protocol uses a Superdex S200 Increase 10/300 GL column configured for an\n      AKTATM Fast Protein Liquid Chromatography (FPLC) system.\n    \n        Concentrate the nanodisc-solubilized receptor from step 20 down to\n        500 μL using a 100 KDa membrane cutoff spin concentrator.\n      \n        Centrifuge the sample for 15 min at 15,000–17,000 x g 4°C to\n        clear particulates before applying to the FPLC system.\n      \n        Equilibrate the ATKA FPLC system and the Superdex S200 column with HBS\n        buffer at 4°C.\n      \nCritical: Detergent in the FPLC system\n      and the SEC column should be avoided by ensuring their removal with\n      Biobeads (step 14 above).\n    \n        Load the cleared and concentrated nanodisc-solubilized receptor sample\n        onto the Superdex S200 column at a flow rate of 0.3–0.5 mL/min, 4°C.\n      \n        Continue to pass HBS buffer through the column at a flow rate of\n        0.3–0.5 mL/min using 1.5 times the volume of the column bed. Collect\n        0.5-mL fractions and monitor the absorbance at 280 nm (A280) as an\n        indicator of protein-containing fractions.\n      \n        Collect SEC fractions based on the A280 readings, analyze the fractions\n        using SDS-PAGE, and pool the desired fractions to yield the final\n        product."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}