{
  "id": 18716,
  "origin_website": "Jove",
  "title": "MRI Mapping of Cerebrovascular Reactivity via Gas Inhalation Challenges",
  "procedures": [
    "NOTE: The protocol was approved by the University of Texas Southwestern Medical Center’s Institutional Review Board.\n1. Diagram of the Gas Delivery System and Preparation Steps before the Experiment\nReview the diagram of the gas delivery system (Figure 1). Fill a 200 L Douglas bag (Item #1) with a medical-grade gas mixture containing 5% CO2, 21% O2, and 74% N2.\nPlace two diaphragms (Item #4) in the two-way non-rebreathing valve (Item #3) to ensure one way gas flow. Bring this assembled two-way valve and the gas-filled Douglas bag (Item #1) into the magnet room.\nConnect the gas delivery tube (Item #7) to the input end of the two-way valve (Item #3). Attach the gas delivery tube (Item #7) to the side of the head coil for weight support. Connect the other end of the gas delivery tube (Item #7) to the gas-filled Douglas bag (Item #1).\nConnect the mouthpiece (Item #5) to the U-shape tube (Item #12) via an elbow-connector (Item #13 with gas sampling port sealed).\nConnect the gas-sampling tubing (Item #9) to the U-shape tube (Item #12) via another elbow-connector (Item #13).\nConnect a small air-filter (Item #11) to the other end of the gas-sampling tubing (Item #9). Connect the other end of the air-filter (Item #11) to the CO2 (Item #14) monitor.\nIn the control room of the MRI suite, turn on CO2 (Item #14) and pulse oximetry (Item #15) monitors. Perform an auto-calibration for the CO2 monitor.\nConnect the monitors to a laptop using USB ports. Open the HyperTerminal software that communicates with the monitors. Synchronize the monitors’ times with a timer by writing down the timer time and corresponding monitors’ times. The differences of the timer time and monitors’ times will be accounted for in data processing (step 4.4).",
    "Insert one end of a signaling bar into a waveguide so that one end of the bar is inside the magnet room and the other end is in the control room.\n\tNOTE: The signaling bar is used for notifying the researcher inside the magnet room during the scan when switching of the three-way valve (Item #2) is needed.\n2. Procedures during the Experiment\nAsk the subject to lie on the MRI table but do not put him/her into the magnet bore yet. Instruct the subject to press the nurse-call button if they feel discomfort during the scan. Ask the subject to wipe his/her nose with a piece of cleaning towelette to remove any grease.\nInstruct the subject to breathe by mouth and to establish and maintain a breathing rhythm. Then apply a nose clip (Item #6) on the subject.\nConnect the open end of the U-shape tube (Item #12) to the middle port of the two-way valve (Item #3) via the elbow connector (Item #13).\nGently place the mouthpiece into the subject’s mouth so that the subject can breathe through the mouthpiece. Gently attach the finger sensor of the pulse oximetry (Item #15) to the finger tip of the subject.\nInsure that the head of the subject is in the iso-center of the head coil. Operate the MRI table to place him/her inside the magnet bore.\nEnsure that one researcher stays inside the magnet room to monitor the subject and to be prepared to switch the three-way valve on the Douglas bag (Item #1). Ensure that the researcher is wearing earplugs and a headset to block MRI noise.",
    "Close the magnet room door and, in the control room, check the EtCO2 and arterial oxygen saturation fraction (sO2) parameters displayed on the CO2 (Item #14) and pulse oximetry (Item #15) monitors. Start the recording of the parameters on the laptop.\nInstruct the MRI operator to begin scanning using Blood-Oxygenation-Level-Dependent (BOLD) sequence. For 3T MRI scanner, the BOLD imaging parameters are: TR/TE=1,500/30 msec, flip angle=60°, field of view=220 x 220 mm2, matrix= 64 x 64, 29 slices, thickness=5 mm, no gap between slices, 361 volumes. Review a pre-prepared sheet on which the timing of the valve switching is listed and gently swing the signaling bar when a switch is needed. Pay close attention to the subject’s physiology, including heart rate, sO2, and EtCO2.\nNow, inside the magnet room, switch on the Douglas bag (Item #1) based on the movement of the signaling bar which controls the type of gas that the subject inspires.\nContinue this procedure for the length of the study. During the 9 min imaging period, ensure that the valve switching takes place approximately once every minute. Note that the timing of the switch does not have to be exactly precise, as long as the EtCO2 time course is recorded.\n\tNOTE: If the subject presses the nurse-call button during the scan, the scan will be aborted and the subject will be moved out of the magnet bore immediately. The researcher will remove the mouth piece and nose clip from the subject.",
    "Use the intercom to notify the subject that the scan is completed. Pull the MRI table out. Gently remove the nose clip and mouthpiece from the subject while providing cleaning tissue to the subject to wipe any saliva. Gently remove the finger sensor of the pulse oximetry from the subject. The subject can then sit up and get off the MRI table.\n3. Clean-up Procedures after the Experiment\nDiscard the gas sampling tubing (Item #9), air-filter (Item #11), mouthpiece (Item #5) and nose clip (Item #6).\nClean the reusable components. Disconnect the two-way valve (Item #3) from the other components and remove the diaphragms (Item #4) from the valve. Soak the two-way valve (Item #3), diaphragm (Item #4) and U-shape tube (Item #12) in a concentrated phosphate-free disinfectant, containing surfactants such as Bacdown detergent disinfectant in a container for 20 min. The dilution ratio of the detergent disinfectant and distilled water is 1:64.\nRinse the items described in 3.2 thoroughly with distilled water.\nDry the U-shape tube (Item #12) with compressed air. Place the two-way valve (Item #3) and diaphragms (Item #4) on a clear countertop and allow them dry naturally and completely.\nEmpty the Douglas bag. Put away the signaling bar and gray tube.\n4. Data Analysis to Compute CVR Map\nSave MRI data in Dicom file format or any other vendor-specific format. Transfer the data to a lab computer and convert the data into volume-by-volume file series, in which each file contains a 3D volume (e.g., BOLD image) corresponding to one time point.\nPre-process the image data. Perform image pre-processing steps including realignment, normalization, and smoothing using a script that calls library functions provided by the software Statistical Parametric Mapping (SPM). See supplemental code file 1 for an example of the Matlab script.",
    "Use a script to read the CO2 recording, correct the sampling tubing delay by shifting the time course by a pre-calibrated amount (e.g., 12 sec in this setup which is determined as the time difference between one breath to the mouth piece and the appearance of that breath on the CO2 recording), and extract EtCO2 which is the envelope (positive peaks) of the raw time series. See supplemental code file 2 for the Matlab script.\nBased on the synchronizing timer, segment the EtCO2 data to keep only the recording from 25 sec prior to the first image acquisition to 100 sec after the last image acquisition. The EtCO2 time course is the input function to the vasculature and is used as independent variable in the later-described linear regression analysis.\nIdentify the physiological delay between EtCO2 (measured in lung) and MRI signal (measured in the brain) by calculating cross-correlation coefficient (CC) between these two time courses at varying time shifts. The shift value that yields higher CC is considered the optimal time.\nThe EtCO2 time course is shifted by the optimal delay and only the time points matching those of MRI signal are preserved, resulting in a time series that are of the same length as the MRI signal.\nConduct a voxel-by-voxel linear regression using SPM in which the shifted EtCO2 time course is the independent variable and the MRI signal time course is the dependent variable.\nCompute voxel-by-voxel map of CVR\nimgsrc://cloudfront.jove.com/files/ftp_upload/52306/52306eq1.jpg\n\twhere (i,j,k) is the voxel index, β1 is the regression coefficient associated with EtCO2 and β0 is the regression coefficient associated with the constant term. min(EtCO2) is the minimal value of EtCO2 in the time course."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}