{
  "id": 5673,
  "origin_website": "Bio",
  "title": "Differentiation of Human Induced Pluripotent Stem Cells (iPS Cells) and  Embryonic Stem Cells (ES Cells) into Dendritic Cell (DC) Subsets",
  "procedures": [
    "The differentiation of iPS cells (or ES cells) into hematopoietic progenitors is summarized in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170726/20170726221539_0501.jpgFigure 1. Schematic representation of the differentiation protocol of iPS cells (or ES cells) into hematopoietic progenitors. Differentiation time and corresponding differentiation steps and cytokine compositions (in colored boxes) are shown.To differentiate iPS cells (or ES cells) into hematopoietic progenitors, prewarm required amounts of collagenase IV solution (1 mg/ml, 37 °C, see Recipes) and KO-DMEM (room temperature, RT) before starting the experiment. Prepare induction medium d0 (see Recipes) and prewarm at RT.Harvest iPS cells (or ES cells) when they reached 70-80% confluence. Therefore, aspirate medium and add collagenase IV solution to the cells. The volume depends on the culture dish used. Make sure to completely cover the cells with collagenase IV solution (e.g., 1 ml per well of a 6-well plate, 4 ml per 10 cm dish). Incubate cells with collagenase IV at 37 °C in a normoxic incubator with 5% CO2 for 40-60 min. Check if colony edges start to roll up. Only if colony edges have rolled up from all sites and colonies are only loosely adherent to the plate proceed with step A4. If necessary, incubate 10-15 min longer but do not exceed 80 min collagenase IV treatment because this compromises cell viability. Dilute collagenase IV with KO-DMEM in a ratio 1/3, meaning add 2 ml KO-DMEM for each ml collagenase IV solution. Use a 10 ml pipette to rinse off colonies, resuspend and collect them in 50 ml Falcon tubes.If iPS cells (or ES cells) were cultured on mouse embryonic fibroblasts (MEF), separate iPS cell (or ES cell) clusters and single MEF by gravity for 10 min at RT. Large iPS cell (or ES cell) clusters will settle to the bottom, while single MEF will remain in suspension.",
    "Aspirate 80% of the supernatant to remove MEF. If iPS cells (or ES cells) were cultured feeder-free, directly continue with step A6. Collect iPS cell (or ES cell) clusters by centrifugation at 212 x g for 4 min. If not stated otherwise, all centrifugation steps are performed at RT. Aspirate supernatant and resuspend pellet in 1 ml induction medium d0. Pipette up and down with 1 ml pipette to break up clusters. Clusters should contain 50-100 cells (Figure 2). Therefore, transfer a drop of the cell suspension onto a microbiology grade Petri dish and check cluster size by microscopy. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170726/20170726221657_2070.jpgFigure 2. From iPS cells to hematopoietic progenitors. Representative phase contrast images of iPS cells during differentiation into hematopoietic progenitors. Undifferentiated iPS cell colonies on day 0 and small EB with some cell debris on day 2 and 6. Scale bars = 500 µm. Hemato-endothelial patches and hematopoietic progenitors on day 8, 10 and 14. Scale bars = 200 µm.If cluster size is appropriate, pass cell suspension through a 70 µm cell strainer to remove remaining larger clusters. Fill up flow-through to the final volume with induction medium d0 and transfer to microbiology grade Petri dishes to allow embryoid bodies (EB) to form. We usually use 10 ml induction medium d0 for two 6-well plates with iPS cells (or ES cells).Place cells in a 37 °C, 5% CO2 incubator and set O2 regulator of the automatic incubator to 5%. Thus, O2 levels will slowly decrease to 5%.On day 1 of differentiation (24 h after EB formation), many cells (approx. 40-50%) will have died. Prepare induction medium d1 (see Recipes) and prewarm at RT. Dilute old medium (induction medium d0) with fresh medium (induction medium d1) in a ratio of 1/2.",
    "Calculate volume of bFGF in induction medium d1 according to total volume (old medium + fresh medium). Example: 10 ml induction medium d0 + 5 ml induction medium d1 medium containing 1.5 µl bFGF and 1.6 µl BMP4. Final bFGF concentration should be 10 ng/ml. Continue culture under hypoxic conditions (5% O2, 5% CO2).On day 2 of differentiation, there will be a lot of cell debris visible (Figure 2). Collect EB in 50 ml Falcon tubes. Despite the use of microbiology grade Petri dishes, some EB loosely adhere to the dish. Rinse loosely adherent EB off the dishes twice with 1x PBS (prewarmed to RT) and add to EB suspension. Centrifuge EB at 136 x g for 4 min. Aspirate supernatant, gently resuspend pellet (if necessary with 1 ml pipette to break up aggregated EB) in induction medium d2 (prewarmed to RT, see Recipes) and transfer to new microbiology grade Petri dishes. Use the same volume as on day 0 (see step A7). Continue culture under hypoxic conditions (5% O2, 5% CO2).On day 4 of differentiation, proceed as in step A10. Finally, resuspend EB in induction medium d4 (prewarmed to RT, see Recipes) and transfer to new microbiology grade Petri dishes. Use the same volume as on day 0 (see step A7). Continue culture under hypoxic conditions (5% O2, 5% CO2).On day 6 of differentiation, proceed as in step A10. Finally, resuspend EB in induction medium d6 (prewarmed to RT, see Recipes) and transfer to tissue culture plastic (TCP) dishes coated with 0.1% gelatin (see Recipes). Use the same volume as on day 0 (see step A7). Continue culture under hypoxic conditions (5% O2, 5% CO2).On day 8 of differentiation, most EB are adherent on TCP. Collect medium and centrifuge at 136 x g for 4 min.",
    "Aspirate supernatant, resuspend in induction medium d6 (prewarmed to RT) and transfer carefully back to the TCP dish. Use the same volume as on day 0 (see step A7). From now on, avoid detaching EB from the dish. Transfer cells to 37 °C, 5% CO2 and normoxic incubator. On day 10 and 12 of differentiation, medium change is performed as in step A13. Depending on the iPS cell (or ES cell) clone used hematopoietic progenitors will start to bud off from adherent or loosely adherent EB between day 6-14 (iPS cells) or day 21-28 (ES cells) of differentiation, respectively (Figure 2, Video 1). iPS cell (or ES cell) derived hematopoietic progenitors are CD43+ (Figure 3) and used for DC differentiation between day 10-14 (iPS cells) and day 24-28 (ES cells).    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Emergence of iPS cell (or ES cell) derived hematopoietic progenitors. Representative video of iPS cell derived EB on day 6 of differentiation.                                                      imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170726/20170726221942_4994.jpgFigure 3. iPS cells develop via hemogenic endothelium into hematopoietic progenitors. Representative flow cytometry data on day 6 and 10 of differentiation. Upper row shows gating for CD34+ CD31+ hemogenic endothelium population. Center row shows gating for CD43+ CD31+ hematopoietic progenitors. Bottom row shows gating for mature CD43+ CD45+ hematopoietic progenitors.The differentiation of iPS cell (or ES cell) derived hematopoietic progenitors into DC subsets is summarized in Figure 4.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170726/20170726222310_6087.jpgFigure 4. Differentiation protocol of iPS cell (or ES cell) derived hematopoietic progenitors into DC subsets. CD43+ hematopoietic progenitors are co-cultured on OP9 stromal cells with FSG4 and FSG cytokines to generate cDC1 and cDC2 (FSG4), or cDC1 and pDC (FSG), respectively.To differentiate iPS cell (or ES cell) derived hematopoietic progenitors into DC, seed irradiated OP9 stromal cells (30 Gray) resuspended in OP9 culture medium (see Recipes) in a density of 1.",
    "2 x 104 cells/cm2 onto 0.1% gelatin coated TCP dishes one day prior to DC differentiation. We prefer using 6-well plates because later during DC differentiation we can use the same cells for different treatments and experiments. Collect hematopoietic progenitors from step A15 by gentle pipetting and pass cell suspension through a 40 µm cell strainer in order to remove remaining EB. Wash plates twice with 1x PBS (prewarmed to RT) and pass this suspension through the same cell strainer. Centrifuge flow-through at 416 x g for 4 min. Aspirate supernatant and wash pellet in defined volume of 1x PBS (prewarmed to RT, e.g., 5 ml). Count cells (e.g., with a Neubauer chamber and trypan blue as live/dead cell marker). Centrifuge cell suspension at 416 x g for 4 min. Aspirate supernatant and resuspend cells in DC differentiation basal medium (prewarmed to RT, see Recipes) in a density of 1 x 106-1.5 x 106 cells/ml. Split cell suspension in half in two separate Falcon tubes labeled FSG4 and FSG, respectively. Add 100 ng/ml FLT3L, 20 ng/ml SCF, 20 ng/ml GM-CSF and 20 ng/ml IL-4 final concentrations in one Falcon tube (FSG4). Add 100 ng/ml FLT3L, 20 ng/ml SCF and 10 ng/ml GM-CSF final concentrations in the other Falcon tube (FSG). Aspirate OP9 culture medium from OP9 stromal cells and distribute FSG4 and FSG cell suspension onto the OP9 stromal cells. For example, 6 ml of FSG4 and FSG suspension can be distributed in 3 wells of a 6-well plate (2 ml per well), respectively.Culture cells at 37 °C and 5% CO2.Perform a partial medium change every second day. Prepare fresh medium: take half of the volume of basal DC differentiation medium as in step B4 but add double the amount of cytokines.",
    "Carefully tilt the plate and slowly aspirate the supernatant. Cells are loosely adherent to the feeder layer and those in suspension will settle down to the bottom if the medium is removed slowly. Avoid disturbing the cells e.g., by rinsing them off the feeder layer. Remove approx. 50% of the old medium (e.g., 1 ml per 6-well). Add 50% of freshly prepared medium (see above, prewarmed to RT). Thereby cytokine concentrations in the total volume will be the same as given in step B5. DC have acquired DC morphology by DC differentiation day (dd) 4 (Figure 5) and can be used for analyses between dd4-dd7. To collect DC, carefully rinse them off the feeder layer. Wash plates twice with 1x PBS (prewarmed to RT). Avoid detaching OP9 stromal cells. Collect cells in a 50 ml Falcon tube on ice and proceed to required analyses and experiments, respectively.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170726/20170726222550_0381.jpgFigure 5. iPS derived DC acquire DC morphology during differentiation. Representative phase contrast images of iPS cell derived DC (yellow arrow) on irradiated OP9 stromal cells (white arrow) during differentiation. Scale bars = 25 µm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}