{
  "id": 9370,
  "origin_website": "Jove",
  "title": "Functional Imaging of Auditory Cortex in Adult Cats using High-field fMRI",
  "procedures": [
    "The following procedure can be applied to any imaging experiment in which anesthetized cats are used. Steps which are specifically required for auditory experiments (steps 1.1-1.7, 2.8, 4.1) can be modified to accommodate other sensory stimulus protocols.\nAll experimental procedures received approval from the Animal Use Subcommittee of the University Council on Animal Care at the University of Western Ontario and followed the guidelines specified by the Canadian Council on Animal Care (CCAC)44. The outlined experiment requires approximately 150 min from animal preparation to recovery. The time course of the experiment is illustrated in Figure 1.\n1. Stimulus Equipment Preparation\nFigure 2 shows the electronic components and corresponding connections required for generating an auditory stimulus in the MRI scanner. The requirements are as follows: a computer, an external sound card, a stereo power amplifier and an fMRI-compatible earphone system.\nConnect the computer which will be used to present the auditory stimulus to the external sound card via the Universal Serial Bus (USB) cable.\nAttach the cables connecting the output ports of the external sound card to the input ports of the stereo power amplifier.\nAttach the cables connecting the output ports of the stereo power amplifier to the input ports of the transformer box of the fMRI-compatible earphone system.\nConnect the binaural earphones to the output ports of the transformer box.\nUse shielded coaxial cables with BNC connections to connect the transformer box to the penetration panel outside the scanner room.\nConnect the earphone cable assembly to the corresponding BNC ports on the penetration panel inside the scanner room.",
    "Connect the foam ear tips to the earphones then connect the earphones to the cable assembly. Run a test auditory stimulus to confirm that sound is being transmitted from the computer to the earphones. Disconnect the earphones and insert the foam ear tips securely into the cat's ears during the animal preparation phase (step 2.7).\n2. Animal Preparation\nTo premedicate the cat, administer a sedative mixture of atropine sulphate (0.02 mg/kg) and acepromazine (0.02 mg/kg) via a subcutaneous (SC) injection.\nAfter 20 min, administer ketamine (4 mg/kg) and dexmedetomidine hydrochloride (0.02-0.03 mg/kg) via an intramuscular (IM) injection to induce anesthesia. Ketamine is usually combined with a sedative and muscle relaxant, in this case, dexmedetomidine hydrochloride, to reduce the tremors and muscle rigidity commonly observed when ketamine is used alone45. This anesthetic combination typically induces approximately 150 min of sedation and is frequently used in veterinary practice to induce anesthesia in small animals.\nOnce the cat has lost its righting reflex, apply ophthalmic ointment to the eyes to prevent dryness during the procedure. Place an indwelling catheter in the medial saphenous vein for intravenous delivery of ketamine.\nTest for successful anesthetic induction by pinching a toe on the forepaw then observing whether the cat withdraws its paw. Once the pedal reflex disappears, suppress the gag reflex by spraying lidocaine onto the pharyngeal walls then intubate the cat with a 4.0-4.5 endotracheal tube.\nMaintain anesthesia throughout the imaging session with a constant rate infusion of ketamine (0.6-0.75 mg/kg/hr) and inhaled isoflurane (0.4-0.5%) delivered in 100% oxygen at 1-1.5 L/min. Combine 60 ml of saline and 0.07 ml of ketamine in a 60 ml syringe then place the syringe in the syringe pump. This step can be performed before premedicating the cat.",
    "Place warm wax-filled heating pads on the floor of the MRI-compatible sled (Figures 3a and 3c) then layer the insulating plastic bubble wrap around the interior walls of the sled.\nPlace the cat in a sternal position within the insulating bubble wrap in the MRI-compatible sled (Figure 3c).\nOnce the cat is positioned, adjust the head to gain access to the ears. Roll the foam ear tips into the smallest diameter possible then insert each ear tip deep into the ear canal. Once inserted, the foam ear tips should expand to fill the space within the ear canals.\nAdjust the cat until its head is properly positioned within the 3-channel radio-frequency (RF) coil (Figure 3b). Stabilize the head with acoustic dampening memory foam (Figure 3d). Place foam around the ears to provide additional attenuation of the scanner noise.\nWrap the cat in the blanket of insulating plastic bubble wrap then secure and transport the sled to the scanner bed.\nConnect the infusion lines, anesthetic delivery tubes and monitoring equipment to the cat. Connect the earphones to the earphone cable assembly attached to the penetration panel.\nStart the ketamine infusion at the base flow rate of 0.6 mg/kg/hr then increase the flow rate as required based on the depth of anesthesia. Set the initial isoflurane dose to 0.5% then decrease to 0.4% once the anatomical scans have been collected.\nMonitor and record the cat's blood oxygen saturation, end-tidal CO2 levels, heart rate, respiration and rectal temperature (if possible) throughout the experiment using MRI-compatible monitoring equipment positioned at an appropriate distance from the scanner bore. Table 1 lists the mean values and ranges of the physiological measurements for successful execution of this procedure. Steady increases in heart rate and respiration are usually associated with imminent recovery from anesthesia.",
    "After the session is completed, remove the cat from the sled. Continue to provide supplemental heating with heating pads and towels until the animal fully recovers. Once the gag reflex returns, remove the endotracheal tube. Monitor the cat until the righting reflex is restored then return the animal to the facility. Assess the animal the day after the procedure to ensure no adverse effects from the experiment.\n3. Brain Imaging\nCollect anatomical scans of the cat's brain in an axial slice orientation. Use the following imaging parameters for the anatomical reference volume: FLASH imaging sequence with TR = 750 msec, TE = 8 msec, matrix = 256 x 256, acquisition voxel size = 281 μm x 281 μm x 1.0 mm. The duration of the anatomical scan is approximately 6 min. Figure 4 (left panel) provides a sample anatomical image slice obtained using the specified parameters.\nUse the following imaging parameters for the functional volumes: segmented interleaved echo-planar acquisition (EPI) with TR = 1,000 msec, TE = 15 msec, 3 segments/plane, 21 x 1 mm slices; matrix = 96 x 96; field-of-view = 72 mm x 72 mm; acquisition voxel size = 0.75 mm x 0.75 mm x 1.0 mm; acquisition time = 3 sec/volume. Figure 4 (right panel) provides a sample functional image slice obtained using the specified parameters.\n4. Stimulus Presentation",
    "Present a broadband white noise stimulus (0-25 kHz, 100 msec bursts with 5 msec rise/fall time, 1 presentation every 200 msec, 90-100 dB SPL) in a block design in which the auditory stimulus is played for 30 sec and alternated with a 30 sec baseline (no-stimulus) condition (Figure 5). Repeat this step until acoustically-evoked BOLD activity is observed in the auditory cortex. The duration of each functional run using a block design is approximately 4.5 min for 90 volumes.\nPresent the stimulus in the appropriate block design configuration for the desired number of functional runs.\n5. Data Analysis\nSelect appropriate fMRI analysis software (e.g. SPM, FSL) to process the acquired functional volumes.\nRealign each functional volume to the volume acquired closest in time to the reference anatomical scan. Save the resulting motion correction values for use in step 5.6. Exclude any functional runs in which rotational head movements exceed 1° or translational head movements exceed 1 mm.\nCoregister each volume to the reference anatomical scan.\nSmooth each volume with a 2 mm full-width half-maximum (FWHM) Gaussian filter.\nIncorporate a square-wave (boxcar) function which corresponds to the ON-OFF stimulus block design as a regressor to the general linear model (GLM).\nIncorporate motion correction values as regressors of no interest to account for movement-related artifacts. Apply an uncorrected statistical threshold of p = 0.001 to the GLM results to view clusters of BOLD activation. Determine the size of the smallest cluster which meets a corrected (family-wise error: FWE) threshold of p < 0.05 at the cluster level. Set the cluster extent threshold to this value to view statistically significant clusters in regions of interest.",
    "Define the BOLD percent signal change (PSC) at each voxel as the difference between the mean BOLD signal during the stimulation blocks and the mean BOLD signal during the baseline blocks.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}