{
  "id": 8521,
  "origin_website": "Jove",
  "title": "Long-range Channelrhodopsin-assisted Circuit Mapping of Inferior Colliculus Neurons with Blue and Red-shifted Channelrhodopsins",
  "procedures": [
    "Obtain approval from the local Institutional Animal Care and Use Committee (IACUC) and adhere to NIH guidelines for the care and use of laboratory animals. All procedures in this protocol were approved by the University of Michigan IACUC and were in accordance with NIH guidelines for the care and use of laboratory animals.\n1. Surgery Preparations\nPerform surgeries in aseptic conditions. Autoclave/sterilize all surgery tools and materials before surgery. Wear surgery gown and mask for the surgery.\nSanitize the surgery area (spray and wipe down with 70% ethanol), and place sterile towel drapes to cover the surgery area.\nPrepare the recovery cage. Remove cage bedding to limit risk of asphyxiation. Put a heating pad under cage. Provide a food and water source.\nPull a glass capillary for the nanoinjector on a pipette puller. The intense heat of the heating filament during the pulling process will sterilize the glass capillary. Cut or break off the tip to obtain an opening approximately 5 µm in diameter.\nBevel the capillary tip to an approximately 30° angle to improve tissue penetration and reduce clogging. Backfill the capillary with mineral oil and insert into a nanoliter injector.\nObtain an aliquot of the desired channelrhodopsin-encoding rAAV and dilute to the desired titer using sterile PBS.\n\tNOTE: We have found that serotype 1 rAAVs work well for transfection of auditory brainstem nuclei. Specifically, rAAV1.Syn.Chronos-GFP.WPRE.bGH (blue light-activated channelrhodopsin) and rAAV1.Syn.ChrimsonR-tdTomato.WPRE.bGH (red-shifted channelrhodopsin), which are available from publically accessible repositories and vector cores, consistently yield the high expression levels and good long-range axonal trafficking of channelrhodopsins needed for CRACM experiments.\nFollow injector instructions to front fill capillary with 1-3 µL of rAAV in sterile PBS.\n2. Surgery",
    "Put the animal into an induction chamber and induce anesthesia with 3% isoflurane in oxygen delivered via a calibrated isoflurane vaporizer. Observe the mouse until breathing becomes deep and slow and a toe pinch reflex is absent, about 3-5 min.\nTransfer the animal to a stereotaxic frame. Secure the animal's head by putting its mouth on a palate bar with a gas anesthesia mask and by positioning non-perforating ear bars in both ear canals.\nInsert a rectal temperature probe and switch on the homeostatic temperature controller.\nApply ophthalmic ointment to prevent eyes from drying out.\nAdminister preemptive analgesic (e.g., subcutaneous injection of 5 mg/kg carprofen).\nAdjust isoflurane to 1-2.5%, according to the depth of the anesthetized state. Monitor temperature, breathing and color of mucous membranes at least every 15 minutes during the procedure.\nShave scalp with electric clippers. Aseptically prepare scalp with three alternating swabs of povidone-iodine and 70% ethanol.\nMake an incision in the scalp along the midline starting between the ears and continuing rostral to the eyes, exposing the lambda and bregma sutures. Push skin to the side and remove periosteum from exposed bone if necessary.\nMark the lambda suture with a sterile surgical marker, position the tip of the nanoinjector so that it is just touching lambda, and zero the micromanipulator coordinates. Use the nanoinjector tip and micromanipulator to measure the difference in elevation between the lambda and bregma sutures. Adjust palate bar height to bring lambda and bregma to within ± 100 µm height difference.",
    "Map the injection site using the nanoinjector tip and micromanipulator coordinate system and mark the site with a sterile surgical marker. To inject the IC or DCN of P21-P30 mice, use coordinates relative to the lambda suture, as shown in Table 1. Note that the Z depth in our coordinates is measured from the surface of the skull at lambda.\nUse a micromotor drill with a sterile 0.5 mm drill burr to perform a craniotomy over the injection site.\nTo ensure broad transfection of neurons in the target nucleus, make injections at various depths into the tissue (Table 1, Z coordinates), and, in the case of larger brain regions like the IC, make injections over the course of two or more penetrations at different X and Y coordinates (Table 1, Right IC penetration 1 and Right IC penetration 2).\nPerform injections. For IC injections, deposit 20 nL of virus in intervals of 250 µm along the Z axis (injection depth) between 2,250 µm and 1750 µm depth. For DCN injections, deposit 20 nL of virus at a depth of 4,750 µm and 4,550 µm, respectively.\nAfter injection at each Z coordinate, wait 2-3 min before moving the injector to the next Z coordinate. This will allow time for the virus to diffuse away from the injection site, reducing the probability that virus will be sucked up the injection tract when the nanoinjector is repositioned.\nAfter last injection in a penetration, wait 3-5 min before retracting nanoinjector from brain.\nWhen the nanoinjector is removed from the brain between penetrations and between animals, eject a small volume of virus from the tip to check that the tip has not clogged.",
    "After injections, use sterile PBS to wet the cut edges of the scalp and then gently move the skin back towards the midline. Close the wound with simple interrupted sutures using 6-0 (0.7 metric) nylon sutures.\nApply 0.5-1 mL of 2% lidocaine gel to the wound.\nRemove ear bars and temperature probe, turn off isoflurane, remove the mouse from the palate bar and transfer it to the recovery cage.\nMonitor recovery closely. Once the animal is fully awake, moving around, and showing no signs of pain or distress, transfer it back into its cage and return the cage to the vivarium.\nIf surgeries will be performed on multiple animals in one day, use a hot bead sterilizer to sanitize surgery tools and drill burr before next surgery.\n3. Surgical Follow Up\nCheck animals daily for wound closure, infection, or signs of pain or distress over the next 10 days, adhering to the institution's animal care guidelines.\nWait 3-4 weeks before using animals in experiments to allow optimal expression of the channelrhodopsins.\n4. Brain Slice Preparation and Confirmation of Injection Target\nFor CRACM, use acutely prepared brain slices from transfected animals in standard in vitro electrophysiology experiments, described here only briefly (see Goyer et al. 2019 for a more detailed description27).\nPrepare artificial cerebrospinal fluid (ACSF) containing (in mM): 125 NaCl, 12.5 D-glucose, 25 NaHCO3, 3 KCl, 1.25 NaH2PO4, 1.5 CaCl2, 1 MgSO4. Bubble ACSF to a pH of 7.4 with 5% CO2 in 95% O2.\nPerform all following steps, including in vitro electrophysiology, in near-darkness or red light to limit activation of channelrhodopsins.\nDeeply anesthetize mouse with isoflurane and decapitate it quickly. Dissect the brain quickly in ~34 °C ACSF.",
    "Cut coronal slices (200-250 µm) containing the IC in ~34 °C ACSF with a vibrating microtome and incubate the slices at 34 °C for 30 min in a holding chamber filled with ACSF bubbled with 5% CO2 in 95% O2. After incubation, store slices at room temperature until used for recordings.\nIf the injection target was not the IC, cut additional coronal slices of the injected brain region and check the transfection of the target nucleus under a fluorescence microscope. If there is no transfection in the target nucleus or additional transfection in different brain regions, do not continue with experiment.\n5. In Vitro Recording and CRACM Experiment\nNOTE: To provide optical stimulation of Chronos and ChrimsonR, we use LEDs coupled to the epifluorescence port of the microscope. However, lasers can be used instead of LEDs. If using lasers, obtain prior approval from institutional safety officials and follow appropriate guidelines for safe laser use.\nPull electrodes from borosilicate glass to a resistance of 3.5-4.5 MΩ. The electrode internal solution should contain (in mM): 115 K-gluconate, 7.73 KCl, 0.5 EGTA, 10 HEPES, 10 Na2 phosphocreatine, 4 MgATP, 0.3 NaGTP, supplemented with 0.1% biocytin (w/v), pH adjusted to 7.3 with KOH and osmolality to 290 mOsm/kg with sucrose.\nTo make recordings, use standard patch clamp methods. Place the slice in a recording chamber under a fixed stage upright microscope and continuously perfuse with ACSF at ~2 mL/min. Conduct recordings near physiological temperature (~34-36 °C).\nPatch neurons under visual control using a suitable patch clamp amplifier. Correct for series resistance, pipette capacitance and liquid junction potential.",
    "During whole cell recordings, activate Chronos by delivering brief pulses (1-5 ms) of 470 nm light or ChrimsonR by brief pulses of 580 nm light through commercially available LEDs. Determine threshold of opsin activation and use a minimal stimulation protocol to elicit postsynaptic potentials. In general, use the shortest stimulus duration that elicits a PSP, and set the optical power to 120% of the threshold power required to elicit PSPs.\nTo confirm that the recorded changes in membrane potential are indeed synaptic inputs to the neuron, standard antagonists for excitatory/inhibitory postsynaptic receptors can be washed in during the experiment. To investigate different receptor contributions to a PSP (e.g. NMDA vs AMPA receptors), suitable receptor antagonists can be washed in. For each receptor antagonist, drug effects should reverse after washout.\nUse the latency, jitter, and reliability of PSPs to confirm that light-activated synaptic inputs originate from direct, optical activation of synapses on the recorded neuron, as opposed to activation of channelrhodopsin-expressing synapses on an intervening neuron that synapses on the recorded neuron. In general, low latency (<2 ms), low jitter (<1 ms standard deviation in latency), and high reliability (>50%) indicate a direct synaptic connection from the channelrhodopsin expressing presynaptic neuron to the recorded neuron.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}