{
  "id": 4488,
  "origin_website": "Bio",
  "title": "Thin Sections of Technovit 7100 Resin of Rice Endosperm and Staining",
  "procedures": [
    "Resin embedding of endospermCut out approximately 1 mm cubic blocks from the center region of the endosperm in brown rice seeds using razor blades.Put the blocks into an empty 1.5-ml plastic tube.Add 500 µl of FAA solution into the plastic tube. The blocks should be sunken at the bottom of tube.Make the tube open and place it in the aspirator and vacuum for 5 min.Release the negative pressure gently.Repeat steps 4 and 5 two more time.Take the tube from the aspirator and remove the FAA by micropipette.Add 1 ml of fresh FAA solution into the tube.Rotate at 30 r/min overnight at room temperature.Remove FAA and add 1 ml of 30% ethanol.Rotate at 30 r/min for 1 h at room temperature.Remove 30% ethanol and add 1 ml of 50% ethanol.Rotate at 30 r/min for 1 h at room temperature.Remove 50% ethanol and add 1 ml of 70% ethanol.15. Rotate at 30 r/min for 1 h at room temperature.Remove 70% ethanol and add 1 ml of 90% ethanol.Rotate at 30 r/min for 1 h at room temperature.Remove 90% ethanol and add 1 ml of 95% ethanol.Rotate at 30 r/min for 1 h at room temperature.Remove 95% ethanol and add 1 ml of 100% ethanol.Rotate at 30 r/min for 1 h at room temperature.Exchange 100% ethanol and rotate at 30 r/min for 1 h.Exchange 100% ethanol and rotate at 30 r/min overnight at room temperature.Exchange 100% ethanol and rotate at 30 r/min for 1 h at room temperature.Remove 100% ethanol and add 1 ml of 25% Technovit 7100 resin (I) Rotate at 30 r/min for 1 h at room temperature.Remove 25% Technovit 7100 resin (I) and add 1 mL of 50% Technovit 7100 resin (I).Rotate at 30 r/min for 1 h at room temperature.",
    "Remove 50% Technovit 7100 resin (I) and add 1 ml of 75% Technovit 7100 resin (I).Rotate at 30 r/min for 1 h at room temperature.Remove 75% Technovit 7100 resin (I) and add 1 ml of 100% Technovit 7100 resin (I).Rotate at 30 r/min for 1 h at room temperature.Exchange 100% Technovit 7100 resin (I) and rotate at 30 r/min for 1 h at room temperature.Exchange 100% Technovit 7100 resin (I) and rotate at 30 r/min overnight at room temperature.Exchange 100% Technovit 7100 resin (I) and rotate at 30 r/min for 1 h at room temperature.Remove 100% Technovit 7100 resin (I) from the tube at room temperature.Transfer the endosperm block into the 0.2-ml PCR tube. One PCR tubes should contain one endosperm block.Add 150-200 µl of 100% Technovit 710 (II) in the PCR tube.Confirm that the endosperm block precipitate on the bottom of the PCR tube. If floated, try to send to the bottom by pipetting.Incubate the PCR-tube at 37 °C for more than 2 day to solidify the resin.Trimming the solidified resinRemove the PCR tube from the solidified resin by razor blades.Trim the solidified resin by razor blades to remove the extra resin. Leave intact the part where the endosperm block is embedded.Adhere the trimmed resin on the wooden dowel by instant super adhesives.Thin sectioning and stainingFix the wooden dowel on the sample holder of ultramicrotome to make the resin facing outward.Set the diamond knife on the ultramicrotome.Adjust the angles, directions and positions of the dowel and diamond knife to make the knife-edge can approach at appropriate directions to the endosperm blocks in the resin.Start sectioning of resin by preceding the position of diamond knife by 1 µm each.Continue the sectioning of resin to obtain the thin sections containing endosperm blocks.Prepare a drop of water on a silanized slide.",
    "Pick up the thin section containing endosperm blocks by forceps.Put the thin section onto the surface of water drop on the slide. The thin section will expand on the surface of water.Leave the thin section overnight at room temperature to dry out the water.Add a drop of 40-times diluted Lugol solution on the dried thin section stuck on the slide.Note: It takes 1-5 sec to stain the sections. And there is no need  to remove the dye before observation under microscope. Mount a coverglass on the stained section.Note: No special mounting reagent is needed. The rest of the dye works as the mounting reagent.Examine the section under a normal light microscope."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}