{
  "id": 12111,
  "origin_website": "Jove",
  "title": "A Computational Method to Quantify Fly Circadian Activity",
  "procedures": [
    "1. Measuring Fly Locomotion Using Drosophila Activity Monitor (DAM)\nNOTE: For more details see reference5.\nPrepare individual fly tubes with food on one end and cotton on the other. The end with food should be sealed to prevent the food from drying out.\n\t\nPut 5-6 g of fly food in a 50 mL beaker. Cut the food into small pieces so that it is easier to melt it.\nConnect 32 individual glass tubes with a rubber band.\nMelt the food in the beaker by heating it in a microwave oven for 10-15 s. Stop the microwave every 5 s and carefully shake the beaker to ensure equal melting of food.\nWhile the food is still liquid, put the prepared individual tubes in the beaker with food. Move the tubes up and down so they are equally filled.\nAllow the food to cool down and solidify for approximately 1 h.\nAfter the food is solid, remove the tubes with the food from the beaker.\nSeal the end containing the food using wax. First, carefully clean a tube using a paper towel, then press the tube against the wax. Visually check the quality of the seal, and if necessary, repeat the sealing again.\nClose the other end of the tube with cotton; cotton will permit air to go through while keeping a fly locked in the tube.\nPlace a single fly in each individual tube and place the tubes in the DAM.\nPlace monitors in an incubator that maintains constant temperature and humidity. Based on the experiment, set the proper light/dark conditions as follows.\n\t\nFor light/dark experiments keep the flies in light/dark cycle for the whole experiment. Do not use the first day of measurements in the analysis.",
    "For constant darkness experiments, first keep the flies for two days in light/dark conditions for entrainment and synchronization of the clocks and then switch to constant darkness. Do not use the measurements from the first day of constant darkness in the analysis.\nCollect at least four days of data that can be used in the analysis.\n\tNOTE: The DAM system will output a single file with a locomotion recording of all flies in the monitor.\n2. Data Analysis\nSplit the monitor output file into multiple single fly activity files; each file should be a single column '.txt' file with an individual fly locomotion measurement.\nRun 'ModelFitPS3.m' function in a Matlab command window with the following input parameters:\n\t\nFor samplingrate, set the data sampling time interval in seconds. For example, if activity was measured every minute, enter 60 as the samplingrate.\nFor bin_interval, set the time interval in minutes to which data will be binned for better visualization; the recommended bin interval is 20-30 min.\nFor trend, enter \"1\" if the data show baseline trend and \"0\" otherwise; data with trend will be detrended first by fitting a second order polynomial and then subtracting it from the data.\nIn the popup window select a single fly activity file.\n\tNote: The first plot is data power spectrum, and not the familiar activity plot. From the plotted power spectrum, determine the primary period T0: Either click with the left mouse button on the circadian peak, or with right mouse button on the second harmonic peak (around T0/2).",
    "On the opened data plot, check if the morning and evening peaks are well visualized. If not, change the bin_interval value by right clicking anywhere on the graph and inputting the new bin_interval value in the dialog box. The program will redraw the data with the new value of the interval. To accept the bin_interval value, left click anywhere on the graph.\nThe program will redraw the data again and show the first five days of activity. On this plot, click on the first M peak that will be used in the analysis (sometimes it is necessary to skip one or two days).\n\tNOTE: The program will redraw the graph starting from the picked morning peak. The blue and red lines will show the approximate position of the E peak and next day M peak, respectively, based on the period determined in step 2.4.\nOn the same graph, choose data for a preliminary fit of the data with the model: Click on the following points (in this order; note that the click location will be indicated with a red star on the bottom): (i) Top of M peak; (ii) End of the M peak; (iii) Start of the E peak; (iv) Top of the E peak; (v) End of the E peak; (vi) Top of the M peak of the next day.\nNote that the program now presents the power spectrum.\n\tNOTE: The x axis is now given in frequency.",
    "In the opened window with the power spectrum, pick points that will be used for fitting the analytical expression for the model power spectrum. The period detected in step 2.4 is marked with a red line. To pick fitting points, first roughly determine the primary period, similar to step 2.4. Then using the slider, fine tune the primary period value so that the fitting points (shown with red circles, will appear after moving the slider) are closed to peak values.\nAfter the visual peak selection, click \"Accept\" and the program will fit selected points with the analytical expression to calculate the model parameters.\nNote that the parameters and spectral fit error are saved to the file \"model_fit_parameters.txt\"; the program will additionally save 2 figures with fits of the locomotor data and its power spectrum.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}