{
  "id": 12114,
  "origin_website": "Jove",
  "title": "Identification of OTX1 and OTX2 As Two Possible Molecular Markers for Sinonasal Carcinomas and Olfactory Neuroblastomas",
  "procedures": [
    "All the studies were performed according the Declaration of Helsinki (1975) with written informed consent and approved by the Ethical Committee of the University of Insubria in Varese.\n1. Collection of the Samples\nCollect and divide all the human Formalin-Fixed Paraffin-Embedded (FFPE) samples into different subgroups according the WHO classification of Head and Neck Tumors14.\nNOTE: Here we used the following samples: Normal sinonasal mucosa as control (10 samples); Inverted Papilloma (IP, ICD-O code 8121/1); Sinonasal ITAC (ICD-O code 8144/3, 32 samples); NITAC (ICD-O code 8140/3, 12 samples); Adenoid Cystic Carcinoma (ACC, ICD-O code 8200/3); Pleomorphic Adenoma (PA, ICD-O code 8941/3); ON (ICD-O code 9522/3, 13 samples); Poorly Differentiated Neuroendocrine Carcinoma (PDNEC, ICD-O code 8041/3, 19 samples); Neuroendocrine Tumor (NET, ICD-O code 8041/3).\n2. Immunochemistry\nDeparaffinization and rehydration of sections\nHeat the sample slides in an oven at 60 °C for 30 min and rehydrate 3 µm thick FFPE sections using an alcohol series to water.\nBriefly wash the slides in xylene for 10 min and repeat this step; wash the slides for 5 min in 100% alcohol and repeat this step using 95%, 85%, and 75% alcohol serially. Rinse the slides for 5 min in distilled water.\nBlocking the endogenous activity\nBlock the endogenous activity by placing the slides in 3% aqueous hydrogen peroxide for 12 min.\nAntigen retrieval\nPerform antigen retrieval by treating with 10 mM Citrate Buffer (pH 6) for 10 min in a microwave treatment.\nIncubation with primary antibody\nWash the sections in TBS buffer (pH 7.4), then add blocking solution for 10 min.\nWash the sections in TBS buffer (pH 7.4), then add 0.2% Triton X.\nIncubate overnight at 4 °C with goat anti-human OTX2 antibody diluted 1:100.\nIncubation with secondary antibody",
    "Incubate the sections for 1 h at room temperature with biotinylated rabbit anti-goat secondary antibody diluted 1:200 followed by ABC-peroxidase complex (see Tables of Materials).\nDeveloping the immunoreaction\nDevelop the immunoreaction using 3,3'-diaminobenzidine tetrahydrochloride and counterstain the nuclei with Harris Hematoxylin.\nMounting and imaging\nDehydrate the sections using a crescent alcohol-scale and clarify them using a clearing substance of terpene origin (see Table of Materials). Embed sections in mounting medium, place the sections on a microscope slide, and observe the sections through an optical microscope.\n3. RNA Extraction and Reverse-transcription\nRNA extraction\nExtract RNA from the sections by performing the first step of immunoprecipitation protocol (see section 2.1) and keep the slides in distilled water. Overlap the unstained sections with the corresponding hematoxylin-eosin stained sections in order to identify fragments of interest.\nPerform the RNA extraction using a commercial RNA extraction kit for FFPE samples (see Table of Materials) and following manufacturer's instructions.\nRNA reverse-transcription\nUse a commercial kit to retro-transcribe RNA into cDNA (see Table of Materials) following the protocol. Retro-transcribe at least 1,000 ng of total RNA to perform several analyses.\n4. Real-time PCR and Data Analysis\nReal-time PCR\nPerform quantitative real-time PCR analyses (qRT-PCR) with probe-based technology (see Table of Materials) and a thermal cycler.\nPreparation of the PCR reaction mix\nPrepare the PCR reaction mix using 12.5 µL of probe-based master mix, 1.25 µL each of OTX1, OTX2, and ACTB probes (see Table of Materials), 50 ng of cDNA, and nuclease-free water up to 25 µL of total volume.\nPerform all the reactions in triplicate using the ACTB gene as the endogenous control to normalize gene expression levels.\nCentrifuge the plate at 1,109 x g for 3 min and store the plate protected from light at 4 °C until the experiment.\nSetting the thermal cycler",
    "Set the thermal cycler profile with an initial hot start cycle at 50 °C for 2 min and 95 °C for 10 min, followed by 40 cycles at 95 °C for 15 s and a final cycle at 60 °C for 1 min.\nGene expression level analyses\nNormalize the gene expression levels through the comparative cycle threshold (ΔCt) method using the ACTB gene as the endogenous control.\nEvaluate gene expression levels using the 2-ΔCt method and plot the results.\nStatistical analyses\nPerform statistical analyses using Student's t-Test, considering statistically significant results with p < 0.05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}