{
  "id": 10396,
  "origin_website": "Jove",
  "title": "Prospecting Microbial Strains for Bioremediation and Probiotics Development for Metaorganism Research and Preservation",
  "procedures": [
    "1. Water and coral collection and storage for microbial isolation\nNOTE: It is essential to take the coordinates and temperature of the sampling sites. If possible, metadata such as salinity, pH, depth, and light intensity can also help in finding fine-tuned cultivation approaches and future interpretation of data. For reliable results, keep the samples stored for the minimum length of time possible. The water/coral microbiomes may change considerably if the samples are not kept at the right temperature and/or are stored for long periods. If the isolation step is not performed instantly after collection, it is crucial to maintain samples at 4 °C until processing. The longer the samples are stored, even at 4 °C, the more the microbial community will change.\nSample and store seawater.\n\t\nCollect 500 mL samples of water in at least triplicate from each targeted sampling site. Preferably use sterile bottles with screw caps.\nIf processing the water instantly after collection, keep the bottles at RT for a short interval. If sample processing is happening later, keep the bottles at 4 °C.\nSample and store the coral.\n\t\nUse a sterile pair of pliers to cut coral fragments from the same sampling site of the water samples. To avoid contamination, touch corals only with sterile gloves.\nRinse the sampled coral fragment using 20 mL sterile saline solution (3% NaCl in distilled water) or artificial seawater to get rid of the loosely attached free-living bacteria of the seawater.\nUsing forceps, place each coral fragment into a sterile 250−500 mL container with a screw cap containing sterile saline solution.\nIn the laboratory, using sterile forceps and pliers, weigh 5 g of coral fragments using sterile 100 mm x 20 mm Petri dishes on a weighing scale.",
    "Transfer the 5 g of coral sample to a sterile mortar and macerate it using a sterile pestle.\nUsing a sterile spatula, transfer the macerated sample to a sterile culture flask containing 45 mL of 3% NaCl sterile solution and 10−15 glass beads of 5 mm. Use some of the 45 mL sterile saline solution to wash the mortar and recover the maximum amount of the macerate.\nKeep the flasks under constant agitation (150 x g) for 16 h at the water temperature of the sampling site.\n\t\tNOTE: For shallow-water corals the optimum temperature will range from 24−28 °C. This step will detach microorganisms from different coral compartments, such as the ones attached to the host cells, or the ones living inside the tissue and the skeleton. After this step, the coral macerates should not be stored, and the isolation step must be instantly performed.\n2. Isolation of EE2-degrading bacteria from seawater and/or corals\nSelect bacteria.\n\tNOTE: After steps 1.1.2 and 1.2.7, the concentration of microorganisms in seawater that have detached from the different coral macerates will be unknown and variable. In order to guarantee the isolation of individual microbial colonies in Petri dishes containing agar media, serial dilutions are needed.\n\t\nPerform serial dilutions up to 10-9 in sterile saline solution for coral samples and up to 10-6 for water samples. Pipette dilutions up and down 5x before discarding the tip. Vortex samples for 5 s every time before performing the next serial dilution.\nPipette 100 µL of each dilution on Petri dishes containing 3% NaCl lysogeny broth (LB) agar medium, and plate them.\n\t\tNOTE: Use marine agar (MA) as an alternative medium. Triplicates of each dilution are required for reliable results.",
    "Incubate the plates for 1−3 days at the target temperature (e.g., 26 °C). Check the plates once a day.\nSelect and isolate the colonies presenting distinct growth morphologies on new plates using the streak plate technique. Repeat this step as many times as needed to have pure colonies growing on the plates.\nIf the procedure is not instantly continued to step 2.3.1, store isolates at 4 °C or in glycerol as described in section 2.2.\nPrepare glycerol stocks.\n\tNOTE: This step is optional and can be used for long-term bacterial stocks storage.\n\t\nPick single colonies from the fresh plate or from the plates stored at 4 °C and independently inoculate them in 2 mL of sterile LB medium.\nPlace tubes under constant agitation (150 x g) at 24−28 °C overnight (ON).\nAdd 1 mL of the bacterial cultures from step 2.2.2 and sterile glycerol to a final concentration of 20% to the 2 mL cryovials.\nLeave the cryovials ON at 4 °C.\nPlace the glycerol bacterial stocks at -80 °C until needed.\nPerform the EE2-degradation ability test.\n\t\nActivate the isolates in LB broth or alternative media. For this, pick a single colony from the fresh plates or the plate stored at 4 °C, and inoculate 2 mL of sterile LB medium. In case it is a glycerol stock, first streak it on LB agar plates and incubate at 24−28 °C ON to have single colonies growing. Place the tube containing LB medium inclined under constant agitation (150 x g) at 24−28 °C ON.\nAfter bacterial growth, pellet the cells by centrifuging them at 8,000 x g for 8 min at room temperature (RT). Discard the supernatant and, gently pipetting up and down, resuspend the cells in an equal volume (2 mL) of saline water to wash the remaining LB broth.",
    "Repeat step 2.3.2 twice to guarantee that there are no traces of carbon source, resuspending the cells in an equal volume of saline solution. For instance, if it was started with a 2 mL culture, resuspend the cells in a final volume of 2 mL saline solution.\nInoculate the washed and resuspended cells in minimum Bushnell Haas culture medium (BH Broth) containing EE2 as the only carbon source59.\n\t\tNOTE: EE2 is dissolved in ethanol at a final concentration of 5 mg/L in the culture medium. Make changes in the pollutant type and/or concentration if needed.\nAssess bacterial growth by optical density at 600 nm and/or colonies forming units (CFU) on LB agar medium33, for 16−72 h of incubation.\n\t\tNOTE: Alternatively, the microorganisms can be directly isolated on minimum media containing EE2, or other compounds, as the only carbon source. This step would direct the selection and avoid undesirable growth.\n3. Isolation of oil-degrading bacteria from seawater and/or corals\nPrepare minimum media containing an oil water-soluble fraction (oWSF) and oil water-insoluble fraction (oWIF) as the only carbon source21.\n\t\nAdd 1−2% crude oil to 500 mL of sterile distilled water. Use a filter flask opened on the bottom to take the soluble fraction out without disturbing the upper layer of the insoluble fraction.\nKeep the mixture under constant agitation at 24−28 °C at 150 x g for 48 h.\nPlace the filter flask containing the crude oil fractions on a stable surface and wait 10−20 min to allow soluble and insoluble fraction separation.\nTransfer the oWSF to a new sterile flask, saving the oWIF by opening the bottom filter flask and taking out the soluble fraction.\nUsing all the oWSF recovered in the previous step (~400 mL), prepare 1 L of BH agar minimum medium containing oWSF as the only carbon source.",
    "Using the oWIF remaining in the flask from step 3.1.4, prepare 1 L of BH agar minimum medium containing oWIF as the only carbon source.\nIsolate oWSF- and oWIF-degrading bacteria.\n\t\nUsing water and coral macerate from steps 1.1.2 and 1.2.7, respectively, dilute the samples up to 10-6 in sterile saline solution as described in step 2.1.1.\nPipette 100 µL of each dilution on Petri dishes containing BH-oWSF and BH-oWIF agar media and plate them.\nRepeat the procedures described from step 2.1.3 to step 2.1.5.\n4. Consortium member selection\nExtract and sequence the DNA for taxonomic identification.\n\t\nActivate the isolates stocked in glycerol as described in step 2.3.1.\nExtract the DNA using a DNA extraction kit (see Table of Materials).\nUse primers 27f (5′-AGA GTT TGA TCA TGG CTC AG-3′) and 1492r (5′-GTT TAC CTT GTT ACG ACT T-3′) for amplification of the 16S rRNA gene.\nPerform 50 µL PCR reactions according to the following protocol: 5 μL of 10x polymerase buffer, 2 mM MgCl2, 0.2 mM dNTPs, 5 mM of each primer, 10 ng of genomic DNA, and 2.5 U of Taq DNA polymerase. Add negative controls (i.e., blank DNA extractions and PCR reactions without template DNA) to ensure that there is no contamination.\nSet up the following thermal cycling steps: a first denaturation cycle at 94 °C for 4 min; 35 cycles at 94 °C for 1 min, followed by 50 °C for 1 min, and 72 °C for 2.5 min; a final extension cycle for 10 min at 72 °C.\nCheck amplicon integrity in 1.2% agarose gel using 80 V.\nGel purify the samples using a gel purification kit (see Table of Materials).\nQuantify PCR products using a fluorometer.\nSend product for sequencing.",
    "NOTE: For better taxonomical classifications, the Sanger method is recommended60, because it provides long sequences. The universal primers 27f and 1492r can be used to amplify nearly the entire length of the 16S rRNA gene61. If contigs cannot be assembled using one pair of primers, an extra pair in the middle of the sequence should be considered.\nDetermine the growth curve.\n\t\nActivate the isolates in glycerol stocks from step 2.2.5 as described in step 2.3.1 but using 5 mL instead of 2 mL.\nAdd 1% (v/v) of the grown 5 mL culture from step 4.2.1 in triplicates, to a 250 mL flask containing 100 mL of 3% LB media. Make sure to prepare triplicates of a negative control (no inoculum) as well.\nPlace the flasks in an incubator under constant agitation (150 x g) at 24−28 °C.\nTake 1 mL aliquots every 4 h for 48 h. If the strains present a high growth rate, decrease the 4 h interval.\nMeasure the optical density (OD) estimation at 600 nm wavelength and colony forming units (CFU) counted from serial dilutions plated on rich media plates (100 µL should be inoculated in each plate and normalized to the volume of 1 mL).\nPlot the OD and CFU curves and analyze the correlation of OD/CFU of each individual strain. From now on, calculate the number of cells based on the OD values.\nPerform antagonism test.\n\t\nActivate the isolates as described in step 2.3.1.\nInoculate one strain at a time along the middle of plates containing agar media and the other ones perpendicular to the central one. Repeat until every selected microbial strain is tested against all others.",
    "Incubate the plates at 24−28 °C and monitor them daily in order to observe potential halos indicating antagonistic activity. If halos are observed indicating antagonistic activity between two strains, one of them should be excluded.\nPerform consortium assembly.\n\t\nActivate the isolates as described in step 2.3.1.\nPellet the cells at 3,500 x g and gently wash them 2x in an equal volume of saline solution. Resuspend the cells in an equal volume (i.e., if the final volume was 2 mL of cells, wash them using 2 mL of saline solution and resuspend them in a final volume of 2 mL).\nInoculate 1 mL culture in 100 mL 3% NaCl LB medium and incubate ON at 150 x g.\nRepeat step 4.5.2, inoculate the 100 mL grown, washed, and resuspended cultures in 10 L cultures. Incubate ON in sterile air-lift bioreactors, receiving filtered air from a pump. If more culture is needed, always inoculate 1% of grown culture in fresh media.\nCentrifuge grown cultures at 8,000 x g for 8 min at 4 °C. Discard supernatant after centrifugation.\nWash the pellet, gently resuspending the cells in 500 mL of sterile saline solution.\nRepeat steps 4.5.5 and 4.5.6.\nResuspend each individual culture in 100 mL of saline solution and measure the OD to estimate the number of cells.\nCalculate the volume of each culture necessary to reach a final concentration of 107 cells mL-1.\nPerform CFU counts on rich media for a final confirmation of cell viability and concentration.\nMix an equal volume of each individual culture in sterile flasks and aliquot the consortium into 50 mL sterile tubes.\nKeep at 4 °C until inoculation.",
    "NOTE: Prepare the consortium assembly as fresh as possible to guarantee cells will still be viable. Alternatively, CFU counts can be performed before inoculation. To assemble an ideal consortium, it is necessary to use isolates presenting different and complementary metabolic capacities. Usually, 6−10 isolates are used to form consortia, but this number will vary depending on the members’ characteristics and purposes.\n5. Detection of putative beneficial characteristics for corals\nActivate the isolates from the glycerol stocks by streaking them on LB agar plates and incubating them at 24−28 °C ON to have single colonies growing. Pick a single colony from the plates and inoculate it in 2 mL of sterile LB medium. Place tube containing LB medium inclined under constant agitation (150 x g) at 24−28 °C ON.\nPerform DNA extraction as described in section 4.1 for detection of potentially beneficial genes by PCR.\n\tNOTE: PCR reaction conditions and primers will depend on the targeted gene. Methodologies to test BMC characteristics of individual strains and PCR detection for potentially beneficial genes are described in Table 1."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}