{
  "id": 10607,
  "origin_website": "Jove",
  "title": "The Use of a β-lactamase-based Conductimetric Biosensor Assay to Detect Biomolecular Interactions",
  "procedures": [
    "1. Protein Sample Preparation\nProduce and purify the hybrid protein BlaP-cAb-Lys3 as reported in our previous study15. Store the protein in 50 mM phosphate buffer pH 7.4 with the following composition: 8 g of NaCl, 0.2 g of KCl, 1.44 g of Na2HPO4  and 0.24 g of KH2PO4 dissolved in 800 mL of distilled water Fix the pH of the solution to 7.4 before adjusting the final volume of the solution to 1 L. Filter sterilize the protein solution.\nPrepare a hen egg white lysozyme (HEWL) stock solution. Dissolve 100 mg (40,000 units/mg) of commercially purchased HEWL in 10 mL of phosphate buffer saline (PBS see step 2.1.1). Sterilize the protein solution by filtration using filters with a 0.22 μm cutoff.\n2. Biosensor Assays\nSolution and buffer preparation\nPrepare 50 mM PBS by dissolving 8 g of NaCl, 0.2 g of KCl, 1.44 g of Na2HPO4, and 0.24 g of KH2PO4 in 800 mL of distilled water. Adjust to pH 7.4 with 1 N HCl or 1 N NaOH before adjusting the volume of the solution to 1 L. Filter sterilize and store at 4 °C.\nPrepare a saturation/blocking solution by dissolving 3 g of casein hydrolysate in 100 mL of PBS prepared as described above (see step 2.1.1). Filter sterilize and store at 4 °C.\nPrepare a binding solution by dissolving 1 g of casein hydrolysate in 100 mL of PBS prepared as described above (see step 2.1.1). Filter sterilize and store at 4 °C.\nPrepare a washing solution (0.1% Tween - PBS) by adding 100 μL of Tween 20 (100%) in 100 mL of PBS prepared as described above (see step 2.1.1). Store at 4 °C.",
    "Prepare an electrode preparation solution (1% Triton X-100 - PBS) by adding 1 mL of Triton X-100 (100%) in 100 mL of PBS prepared as described above (see step 2.1.1). Store at 4 °C.\nPrepare an electrode regeneration solution (3.5 M KCl) by dissolving 26 g of KCl in distilled water to a final volume 100 mL. Filter sterilized and store at 4 °C.\nPrepare a 5 mM NaCl solution by dissolving 0.29 g of NaCl in distilled water to a final volume of 1 L. Filter sterilize and store at 4 °C. Then, prepare a detection solution (4 mM benzylpenicillin) by dissolving 26.7 mg of benzylpenicillin in 20 mL of 5 mM NaCl solution. Filter sterilize and store at -20 °C.\nSensor preparation and regeneration\n\tNote: The polyaniline coated sensor chips were developed and kindly provided by Dr. P. Bogaerts, Dr. S. Yunus and Prof. Y. Glupczynski’s (Catholic University of Louvain-la-Neuve - CHU Mont-Godinne). The description of the sensor as well as the polyaniline electro-polymerization protocols used to synthesize these sensors are detailed in their previous work17. Briefly, this system uses re-usable sensors of eight individual chips that were manufactured by classical printed circuit board (PCB) techniques. Individual chips are composed of three electrode round spots. The top one is the working electrode on which polyaniline was electro-synthesized. The middle one is the reference electrode and the bottom electrode constitutes the counter electrode. Both, the reference and the counter electrodes are functionalized using solid Ag/AgCl amalgam on top of the carbon layer.\n\t\nPerform 3 washes of the electrodes by dipping the tips into wells of a 96-well plate containing 300 µL/well of electrode preparation solution (1% Triton X-100 - PBS, see step 2.1.5.). Perform each wash for 2 min with gentle mixing at room temperature.",
    "Rinse the electrodes by dipping the tips into wells of a 96-well plate containing 300 µL/well of distilled water for 2 min with gentle mixing at room temperature.\nRegenerate the electrodes by dipping the tips into wells of a 96-well plate containing 300 µL/well of regeneration solution (3.5 M KCl, see step 2.1.6) overnight at 4 °C or 1 h at room temperature.\nPerform 3 washes of the electrodes by dipping the tips into wells of a 96-well plate containing 300 µL/well of phosphate buffer saline (see step 2.1.1.). Perform each wash for 2 minutes with gentle mixing at room temperature.\nBinding assay performed on the sensor\nCoat HEWL onto the PANI (polyaniline) surface of the electrode by depositing a 15 µL drop of 40 µg/mL HEWL prepared in PBS onto the electrode surface. Incubate overnight at 4 °C or 1 hour at room temperature.\nPerform three washes of the electrodes with phosphate buffer saline (see step 2.1.1) by dipping the electrode parts of the sensor chips into wells of a 96-well plate containing 300 µL/well of phosphate buffer saline. Perform each wash for 2 min with gentle mixing at room temperature.\nSaturate the electrodes by adding a 50 µL drop of the blocking solution (see step 2.1.2) onto the electrode surface. Incubate for 1 h at room temperature. Then wash three times as described in the previous step (see step 2.3.2).\nDilute the BlaP-cAb-Lys3 solution to 20 µg/mL in binding solution (see step 2.1.3) and apply a 15 µL drop of this diluted solution onto the electrodes. Incubate for 10 min at room temperature. After antigen-nanobody reaction, wash three times as described in the previous step using the wash solution (see step 2.1.4). Then rinse the electrode once with PBS (see step 2.1.1).",
    "For detection, plug the sensor chip via the copper-circuitry part to a digital multimeter. Then, initiate the sensor response by applying a 50 µL drop of detection solution (see step 2.1.7) onto the positive electrodes and applying a 50 µL drop of NaCl 5 mM solution onto the negative electrodes (see step 2.1.7). Incubate for 30 min at room temperature. Monitor the conductance with a digital multimeter.\n\t\tNote: The multimeter was provided by Dr. P. Bogaerts, Dr. S. Yunus and Prof. Y. Glupczynski’s (Catholic University of Louvain-la-Neuve - CHU Mont-Godinne. This potentiostat is computer-controlled via a USB port and analyzes the eight different chips of the sensor simultaneously. The software created by Yunus and colleagues17 creates a real-time plot that represents the measurements of the conductance difference between the reference and sample electrodes against time.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}