{
  "id": 17518,
  "origin_website": "Jove",
  "title": "Low-Cost Single-Port (LoCoSP) Device for a Transcervical Approach in Minimally Invasive Transhiatal Esophagectomy",
  "procedures": [
    "The surgical procedure and the protocol were explained to the patients, and they signed a consent form. This study was approved by the local ethics committees of the institutional review board and informed consent were collected from patients, register number 1688/20. Patients who underwent transhiatal esophagectomy were included in the protocol, while those patients who underwent a transthoracic approach were excluded.\n1. Production of low-cost single-port device\nUse a nasogastric tube, a sterile number-eight glove, a sterile sponge, 3 permanent 5-mm trocars and surgical suture materials.\nMake one cylinder with the sterile sponge.\nUse three glove fingers to triangulation the trocars: little finger, middle finger and thumb\nUse the three trocars to pierce the sponge and perform a triangulation (Figure 1 and Figure 2).\nMake one ring with the nasogastric tube.\nPlace the sponge, the trocars and the glove between the ring to seal the air leak during mediastinoscopy and to stabilize the structures.\nUse the glove to cover all the structures to prevent air leak again.\n2. Laparoscopic and transhiatal procedure\nPut the patient under general anesthesia in a supine position.\nInsert an orotracheal, a central venous and an invasive arterial pressure catheter respectively in the trachea, jugular vein and radial artery.\nCreate a pneumoperitoneum using a Veress needle. Insert the needle in the midline above the umbilical scar.\nPlace laparoscopic trocars in the following positions: one 12-mm trocar in the supraumbilical area, two 10-mm trocars in the left and right hypochondrium, and two 5-mm trocars in the right hypochondrium and the epigastrium.\nPerform abdominal cavity inventory to search for peritoneal or liver metastasis.\nExamine the gastroepiploic arcade from the right gastroepiploic artery to the short gastric vessels.\nOpen up the gastrocolic ligament to the pilorus to gastric fundus while preserving the gastroepiploic arcade.",
    "Perform the posterior gastric wall release. Lift up the posterior aspect of the stomach and dissect using an ultrasonic harmonic scalpel to free it from the retroperitoneum. Identify the pancreas, left gastric vessels, and celiac trunk.\nMake a gastric tube with a stapler. Start stapling in the antrum by the lesser curvature and move towards the greater curvature. Make a slim gastric tube to create an anastomosis in the cervical esophagus and empty it properly.\nPerform dissection and ligation of the left gastric vessels at the origin to harvest the appropriate lymph nodes. Perform the dissection cranially to the origin of the left gastric vein and the left gastric artery.\n\t\nUse one clip proximally and other distally in the left gastric vein before sealing it. Use two hemolocks proximally and one distally in the left gastric artery before sealing it.\nSequentially dissect all the lymph nodes and connective tissue along the left gastric artery (7), common hepatic artery (8a), celiac trunk (9), proximal splenic artery (11p), lesser curvature (3), and the esophago gastric junction (1) and reflect toward the stomach.\nPerform dissection of the esophageal hiatus. Enlarge the hiatus anteriorly to facilitate dissection and mobilization of the thoracic esophagus and the other mediastinal structures.\nIdentify the aorta and dissect the posterior wall of the esophagus from the descending aorta with a harmonic scalpel.\nContinue the dissection of the esophagus in a paraesophageal plane in the lower mediastinum under pneumomediastinum. In the middle to upper portion of the mediastinum, however, this dissection is normally performed blindly and may lead to tracheal lesions or hemorrhage from tearing of the larger vessels.",
    "Stop the dissection in the transition of the middle to upper mediastinum up to the carina and started with a single-port mediastinoscopic cervical approach using a rendezvous technique (this technique is described below).\n3. Transcervical procedure\nMake an oblique incision along the anterior border of the left lower sternocleidomastoid parallel to the clavicle.\nIdentify the sternocleidomastoid muscle and divide.\nMobilize the cervical esophagus and initiate the dissection of the cervical lymph nodes along the left recurrent laryngeal nerve.\nInsert the single-port device into the cervical wound (Figure 3) and create a pneumomediastinum by carbon dioxide insufflation (8 mmHg). Use a 5-mm Otic and a Harmonic Scalpel for esophagus dissection along with a laparoscopic grasper.\nDissect the esophagus over the aortic arch and behind the superior portion of the trachea. Perform the dissection of the lymph nodes along the left recurrent laryngeal nerve and trachea.\nAfter this stage, completely mobilize the esophagus, and reach the region that was dissected using a transhiatal approach. Divide the cervical esophagus, and remove the esophagus with the tumor by an abdominal incision.\nPerform cervical anastomosis with gastric tube and esophageal stump.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}