{
  "id": 5158,
  "origin_website": "Bio",
  "title": "Extraction and Quantification of GABA and Glutamate from Cyanobacterium <em>Synechocystis</em> sp. PCC 6803",
  "procedures": [
    "GABA and glutamate extractionGrow Synechocystis cells, at 30 °C in BG11 medium with a total volume of 50 ml in a cotton-plugged 250 ml conical flask.Harvest cells at exponential phase of growth (3 to 8 days) by centrifuging at 2,500 x g for 10 min, room temperature. Discard supernatant, resuspend cell pellet in 500 µl of deionized H2O and transfer the cell suspension into a 1.5 ml Eppendorf tube. Spin down the cells at 10,000 x g for 10 min and remove all water by micropipette (at this point, cells can be frozen at -20 °C for up to a month).Resuspend the cells in 1.5 ml of 80% (v/v) methanol by vigorous mixing. Incubate the mixture for a few hours at room temperature (or incubate overnight) and homogenize using ultrasonic homogenizer for 2 min. Pellet cell debris by centrifuging at 10,000 x g for 10 min, 4 °C. Collect and transfer the supernatant into a new 1.5 ml Eppendorf tube to obtain the “methanol extract”.Dry the methanol extract in a vacuum evaporator at 40 °C for 5 h and keep the dried pellet at room temperature (steps A6 and 7 can be omitted, see Note 1 below).To the cell debris obtained from step A4, add 2 ml of 80% (v/v) ethanol for further re-extraction in the same way to get the “ethanol extract” (see steps A2 and A3). Add the ethanol extract to previously obtained dried pellet from methanol extract at step A5 and dry in a vacuum evaporator at 40 °C. Dissolve the pellet obtained after drying with 250 µl of deionized water and 50 µl of chloroform, followed by centrifugation at 10,000 x g for 10 min, 4 °C.",
    "Collect the upper aqueous phase (collect sufficient amount of aqueous phase and be careful not to collect the chloroform phase) and transfer into a new 1.5 ml Eppendorf tube.Add diluted HCl to the aqueous phase to make a final concentration of 0.1 N. Filter the solution through a 0.2 µm Millipore filter before GABA/glutamate detection by HPLC. The filtered sample can be stored at -20 °C until further use.HPLC analysis of GABA and glutamateFilter deionized water (or use UP water, HPLC grade), solvent A and solvent B through a 0.2 µm Millipore filter.The pre-column sample derivatization with OPA reagent is performed as described below.Transfer 30 µl of filtered sample from step A9 into a 1.5 ml Eppendorf tube and add 5 µl of borate buffer.Mix thoroughly and incubate for 15 sec at room temperature.Add 0.5 µl of OPA reagent and mix well (see Note 2).Transfer the solution into a 200 µl conical insert (Figure 1A). Place the insert in a transparent wide-opening vial (Figure 1B). Close the vial with screw cap (Figure 1C) and the sample is immediately injected into the HPLC system by an autoinjector.Separation is performed on a reverse phase column with solvent A and solvent B in 26 min at a flow rate of 2 ml/min at 40 °C (column oven temperature) using a gradient program (Table 1) (see Note 3). The UV-detection wavelength is 338 nm for OPA derivatized samples.Quantification of GABA and glutamate content is done by comparing the peak areas with those of standards (linearity is obtained for the concentration range of 4.5 to 450 pmol in 0.5 µl of sample). Retention time for glutamate and GABA using these HPLC conditions is 3.0-3.7 min and 10.0-10.5 min respectively (see the Data analysis, Figure 2) (see Note 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160908/20160908224338_4840.jpgFigure 1.",
    "A photograph of (A) conical insert, (B) transparent wide-opening vial, and (C) screw cap for GABA and glutamate analyses using the Shimadzu prominence autosamplerTable 1. HPLC gradient program settings for a single runimgsrc:https://en-cdn.bio-protocol.org/attached/image/20160908/20160908225130_3380.jpg"
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}