{
  "id": 4585,
  "origin_website": "Bio",
  "title": "Quantification of Extracellular Ammonium Concentrations and Transporter Activity in Yeast Using AmTrac Fluorescent Sensors",
  "procedures": [
    "Transform yeast with the pDR-F’ vector containing the desired AmTrac. We routinely use the lithium acetate method (Gietz et al., 1992). Briefly, we add about 100 ng plasmid to a PCR tube containing 100 µl of the transformation solution (containing PEG, lithium acetate, salmon sperm DNA and yeast cells) and heat-shock at 42 °C for 13 min. The first time the reader might also transform with an empty vector, to measure background fluorescence.Plate the transformation on selective synthetic dextrose minimal medium (SD), with 1 mM arginine (from a filter-sterilized 50x stock dissolved in water) as sole nitrogen source. Wrap the plate in plastic cling wrap to prevent dehydration.Incubate the plate (upside down to prevent condensation) at 28-30 °C for 3 days.In the sterile hood, pick a colony with a sterile 1 ml pipette and place it in a 50 ml tube containing 5 ml SD medium, supplemented with 0.1% proline (from a filter-sterilized 100x stock dissolved in water).Tape the opening of the tube with surgical tape to prevent contamination, still allowing gas exchange.Place the tube in a rack in the orbital shaker.Grow for 36-48 h at 30 °C, 230 rpm. The culture should at least be turbid (OD600 >0.5). Even at saturation, the sensor still works. Avoid overgrowth though, since cells will start to die and degrade the sensors. In that case, start a new inoculum.Remove the tip with forceps, and centrifuge at 3,000 rcf at RT for 5 min to pellet the cells.Discard the supernatant by inversion. The reader should see a whitish pellet.Resuspend the pellet in 20 ml washing buffer, RT. The reader can ease resuspension by pipetting up and down, or by pouring a few ml first, shaking vigorously, and then bringing to volume.Centrifuge as above (step 8).",
    "Wash the pellet a second time as in step 10, to remove any trace of growth medium and released ammonium.Resuspend the pellet in 5 ml resuspension buffer.Pipette 200 µl of the culture in a well of the microplate and measure OD600 using the spectrofluorometer (mode: absorbance). As blank, use 200 µl of resuspension buffer in another well.Adjust to OD600 = 0.5 by diluting with resuspension buffer in the 50 ml tube.Mix well and aliquot in the wells, 200 µl each. An excitation and emission spectrum should be recorded first to confirm the fluorescence properties of the cpGFP as part of the sensors (parameters: mode: fluorescence; read: bottom reading; excitation: Fix emission to 530 and record spectra from 350 - 510 nm; emission: fix the excitation to 480 nm and record the spectra from 500 - 600 nm; step size 5 nm: bandwidth: 7.5/7.5 nm; gain:100), see Figure 2A. With knowledge of the major excitation maximum the reader can decide on the excitation wavelength for the single point measurements. Read basal fluorescence. It should be the same for all wells (parameters: mode: fluorescence; read: bottom reading; excitation: 488 nm; emission: 513 nm; bandwidth: 7.5/7.5 nm; gain:100; shake: orbital, medium, 3 sec, initial and between readings). Since response is saturated above 1 mM for all variants, it can be useful to make a calibration curve with ammonium chloride ranging from 0 to 1 mM final concentration in the wells (0, 1 µM, 10 µM, 100 µM, 1 mM), see Figure 1B. It is useful to include negative controls, e.g. sodium chloride, to exclude artifacts and to include other salts to check for specificity. In that case, use the highest concentration (e.g. 1 or 10 mM), see Figure 2C.",
    "Add the treatment solutions (as 5x concentrated stocks, dissolved in water) to the compartments of the reservoir (Figure 3).Add 50 µl of each treatment solution or water control to each wells with a multichannel pipette, pipetting up and down for about 5 times for mixing the treatment with the cells. Set up at least three replicates per treatment.Response is immediate, within the time limits of the microplate reader. With the parameters as above, it takes about 1 min to read a full plate. Repeat reading as step 18 after 5 min from the treatment. We usually consider these latter responses, as they tend to be a bit stronger.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150103/20150103182607_6841.jpgFigure 2. A. Excitation and emission spectra of AmTrac-GS treated with indicated ammonium chloride concentration. Data are normalized to the initial value. B. Response of AmTrac and AmTrac-100 to increasing concentrations of ammonium chloride. C. Specificity of AmTrac, the concentration of the indicated salts was 1 mM (De Michele et al., 2013).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150103/20150103183610_6720.jpgFigure 3. Schematic representation of the treatment procedure for building a calibration curve. Wells in a microplate are filled with 200 µl of yeast culture, resuspended in 50 mM MES buffer with 5% glycerol. Samples can be arranged in columns, with triplicates for each construct. Fluorescence from yeast transformed with the empty vector will be used as background value. After reading basal fluorescence, 50 µl of 5x stock treatment will be added to the wells, by using a multichannel pipette. In this example, we use a solvent control (water), four concentrations of increasing magnitude of NH4Cl, and a chloride control at the highest concentration."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}