{
  "id": 11865,
  "origin_website": "Jove",
  "title": "Recording Horizontal Saccade Performances Accurately in Neurological Patients Using Electro-oculogram",
  "procedures": [
    "All experimental procedures in this study were approved and conducted according to the guidelines of the institution's human research ethics committee after obtaining informed consent.\n1. Prepare the Subject and the Room for Recoding\nPerform recording in a room with low ambient illumination, to allow sufficient light adaptation.\nHave subjects sit in front of a black, concave dome-shaped screen measuring 90-cm in diameter that contains light-emitting diodes (LEDs) embedded in pinholes, which serve as the fixation points and saccade targets used for the oculomotor paradigms.\n\tNOTE: The LEDs are arranged in horizontal, vertical and oblique arrays in a black, concave dome-shaped screen, i.e., in 8 directions separated by 45 degrees from the center and at an interval of 5 degrees from the center, as was originally devised by Kato et al.20 for behavioral and physiological studies, and modified for human use by Hikosaka et al.21\nFor controlling the oculomotor tasks, make each subject hold a microswitch button connected to a microcomputer, which allows the subject to initiate and terminate a task trial by pressing and releasing the button.\n\tNOTE: Tasks and data acquisition are controlled by a custom-made program operating on a typical Windows PC.\nStabilize the subject's head position by chin and forehead rests, as well as by a head band.\n2. Place the Electrodes for EOG\nUse an Ag-AgCl cup electrode for recording EOG (Figure 1), which has a diameter of 1.8 cm and a thickness of 3.5 mm. The bottom of the cup comprises the Ag-AgCl electrode and the lateral wall is surrounded by a plastic fringe of 5 mm thickness, enabling wide contact with the skin.\nWipe the skin with an alcohol swab.\nFill the cup with electrode paste.",
    "Stably fixate the electrode on the skin by placing double-stick adhesive tape beneath the plastic and attach the fringe to the skin.\nFor recording horizontal saccades by EOG, place the electrodes at the bilateral canthi of the eyes, whereas for recording vertical saccades, place the electrodes above and below one eye.\n3. Set Up the Amplifiers for Recording\nUse a direct current (DC)-amplifier for recording the EOG, with the signal digitized at 500 Hz.\nRecord VOG simultaneously, using the video-based eye tracking system, which records ocular fixation position data at a sampling rate of 500 - 1,000 Hz.\nFeed the analog output of the horizontal and vertical eye positions and set the filter of the data acquisition system, with the signal low-pass filter at 20 Hz.\nAlso, set the filter to attenuate the high-intermediate frequency noise, such as electromyography and electroencephalography.\n\tNOTE: For analysis, a further smoothing process is necessary for calculating saccade velocity profiles from the eye position data (here, 3-point smoothing was performed three times).\nIf possible, measure the impedance between the electrode and the skin and keep it below 20 kΩ.\n4. Waiting Period after Placing the Electrodes for Light Adaptation\nWait 10 - 20 min after placing the EOG electrode on the skin, until sufficient light adaptation takes place.\nAllow the recording to stabilize and the impedance between the electrode gel to decrease.\n5. Calibrate the EOG and VOG Signals\nPerform eye movement calibration before each test session by having the subjects look at 5 pre-specified locations.\nMore specifically, make subjects view visual targets in the center and those that appear 20 degrees to the left, right, upwards, and downwards of the fixation point, both for EOG and VOG.",
    "Adjust the gain of EOG as the subjects fixate on these spots, so that using the custom-built data acquisition system for monitoring the current eye position displayed on the computer screen matches the target position displayed on the screen.\n6. Record Saccades Using the Oculomotor Paradigms and Recalibrate the Eye Positions as Needed During the Session\nInstruct the subjects about the oculomotor paradigms.\n\tNOTE: Two oculomotor tasks are typically used for clinical studies, the visually guided saccade (VGS) and antisaccade (AS) tasks. Briefly, in VGS, when subjects press the button, a central spot is lit in the center of the dome, and the subjects are first required to fixate on this spot. 1.5 - 2 s later, a target is presented, randomly at a location 5, 10, 20, or 30 degrees horizontally to the left or right of it, at the same time as the central fixation spot is extinguished. The subjects are instructed to make a saccade toward that target. In the AS task, make the subjects first press the button and then require them to fixate on the central fixation point as it appears. 1.5 - 2 s later, the target jumps to the left or right of it, similar to above. The subjects are required to make a saccade towards a mirror-symmetrical position across the central fixation spot.\nHave the subjects press the button and begin the trials.\nDuring the session, adjust the gain of EOG during the task performance, so that the current eye position displayed on the monitor is always aligned with the target position simultaneously displayed on the same screen. Both for EOG and VOG, perform re-calibration for adjustment when necessary throughout the experiments.",
    "To compare the performances of the two methodologies, analyze the filtered and digitized EOG signals from the DC-amplifier and VOG by a custom-built computer program and show the EOG and VOG signals together in the same trace.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}