{
  "id": 1775,
  "origin_website": "Cell",
  "title": "Process control and in silico modeling strategies for enabling high density culture of human pluripotent stem cells in stirred tank bioreactors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThawing and adherent (pre-) culture of hPSCs for bioreactor inoculation\nTiming: 9 days\nThe aim of this part of the protocol is to describe well-defined adherent (two dimensional, 2D) culture of hPSCs to generate the required quality and quantity of cells required for inoculating the suspension culture (3D) in bioreactors at the desired culture scale. The procedure described here details the generation of hPSCs sufficient to inoculate 4 × bioreactors at 150 mL scale, or alternatively 1 × bioreactor at 500 mL scale. When aiming at larger culture scales, one or two additional cell passages might be required to produce the respective cell numbers in 2D.\nThawing of cells\nStart with a high quality aliquot i.e., a vial of frozen hPSCs representing ∼3 × 106 cells (previously generated e.g., by own adherent culture used for cryo-preservation).\nThaw the vial at 37°C in a water bath until only a small rest of ice is visually observable.\nSpray the vial with ethanol and place it under a flow hood and dilute the suspension in 10-fold volume of DMEM/12 in a 15 mL conical tube.\nCentrifuge at 300 × g for 3 min. Discard the supernatant and resuspend in 15 mL E8 adherent medium + 10 μM Y27632. Remove the coating medium from one coated T75 flask and transfer the cell suspension into the flask.\nPlace the T-flask in an incubator at 37°C and 5% CO2.\nAfter 48 h of incubation, replace the old medium with 15 mL fresh E8 adherent medium and place the flask back in an incubator.\nPassaging of cells",
    "72 h after seeding (ideally not later), the cells should be passaged to ensure that cells remain at proliferative conditions optimal for this protocol; at this stage the culture confluence should be at ∼60–80% (exemplary pictures are shown in Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Fig2.jpg\nFigure 2. Exemplary microscopical pictures of Monolayer cell growth\n(A–E) Exemplary bright field images of a monolayer culture on Geltrex and in E8, directly after seeding (A), on day 1 (B), day 2 (C), day 3 (D) and of the flask after cell detachment in order to highlight good cell detachment (E) (scale bars = 200 µm).\nFor passaging, wash cells with PBS, completely remove any residue of PBS and add 0.04 mL/cm2 StemPro™ Accutase™ and incubate for 3 min at 37°C. Check for cell detachment by tilting the flask.\nDilute Accutase with the 3-fold volume of DMEM/F12, transfer into a conical tube and centrifuge at 300 × g for 3 min. Discard the supernatant, resuspend in 5 mL E8 adherent medium + 10 μM Y27632 and determine the cell count with the Vi-CELL XR (alternatively manually via Trypan blue exclusion and Neubauer chamber (Zweigerdt et al., 2011[href=https://www.wicell.org#bib16])).\nRemove the coating medium from three coated T175 flasks, add 35 mL E8 adherent medium + 10 μM Y27632 (0.2 mL/cm2) containing 3.5 × 106 cells per flask (corresponding to 2 × 104 cells/cm2).\nNote: If Vitronectin (instead of Geltrex) is used for the adherent culture, Versene might be used for cell detachment/passaging alternatively to Accutase; the procedure is identical to the steps above but the incubation time should be expanded to 10 min (as compared to 3 min suggested for Accutase treatment).\nAfter 48 h of incubation, replace the medium with 35 mL fresh E8 adherent medium per flask and place the flask back in an incubator.",
    "72 h after seeding, the cells should have reached ∼ 60–80% confluence and must be passaged to ensure optimal proliferative conditions for this protocol.\nFor passaging, wash cells with PBS, completely remove any residue of PBS and add 0.04 mL/cm2 StemPro™ Accutase™ and incubate for 3 min at 37°C. Check and support cell detachment by tilting of the flask.\nDilute Accutase with the 3-fold volume of DMEM/F12, transfer into a conical tube and centrifuge at 300 × g for 3 min. Discard the supernatant, resuspend in 25 mL E8 adherent medium + 10 μM Y27632 and determine the cell density with the Vi-CELL XR (alternatively manually via Trypan blue exclusion and Neubauer chamber).\nRemove the coating medium from twelve coated T175 flasks, add 35 mL E8 adherent medium + 10 μM Y27632 (0.2 mL/cm2), and 3.5 × 106 cells per flask (2 × 104 cells/cm2).\nAfter 48 h of incubation, replace the old medium with 35 mL fresh E8 adherent medium per flask and place the flasks back in an incubator.\nObserve the cells 72 h after seeding. The confluence should be ∼60%–80% and the medium should be slightly yellow and clear. For the inoculation of 4 × bioreactors at 150 mL scale, or 1 × bioreactor at 500 mL scale, the next major step “Bioreactor inoculation” should be followed; otherwise (to generate more cells for inoculating multiple bioreactors and/ or larger scale processes) repeat the steps 3–5, while respectively increased the number of T175 flasks.",
    "Critical: The seeding density into T-flasks might require slight (cell line-dependent) adjustment for your hPSC line at hand. However, it is highly critical that cells do not exceed the suggested ∼60%–80% confluence within the 72 h suggested for passaging; higher confluence and/ or exceeding the passaging time beyond 72 h may negatively impact on cell viability after bioreactor inoculation and subsequently reduce the process robustness, efficiency and overall protocol reproducibility. Moreover, even if the cells are not fully detached after 3 minutes of Accutase treatment, do not prolong this incubation step, to avoid detrimental effects on cell viability and proliferation; if the confluence and the passaging interval is following the above-described range, 3 min of Accutase treatment is resulting an optimal detachment and dissociation.\nPreparation and assembly of the bioreactor system (DASbox; for 100–250 mL process scale)\nTiming: 3 days before bioreactor inoculation\nSiliconizing of the bioreactor glass vessel\nPlace the bioreactor glass vessel under the flow hood and repeatedly pipet 1 mL of Sigmacote to the vessel wall (to at least two-thirds of height) and bottom until no liquid is left. This step is necessary to decrease the chance of cells to the vessel to an increased hydrophobicity of the glass. Let the vessel dry for at least 12 h at 20°C–22°C.\nRinse the bioreactor vessel with water in order to remove any Sigmacote residues.\nPump calibration (exemplarily shown in Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Fig3.jpg\nFigure 3. Display of the pump calibration process\n(A) Exemplary image of a pump calibration process.\n(B) Exemplary of the software during pump calibration.",
    "Assemble the base, feed and waste tubing. Important: when the pump head tubing is placed in the pump heads, one tubing end must be long enough to allow placement of tube-attached bottles under the flow hood while being still attached to the bioreactor.\nThe pump head tubing for the base tubing should have an inner diameter of 0.5 mm. For both the feed and waste tubing, in addition to the 0.5 mm pump head tubing a 1.0 mm pump head tubing must be attached.\nPlace the pump head tubing of base, feed and waste (starting with the bigger diameter for feed and waste) into the pump heads. Use the DASware software for pump calibration. Prime the lines with pure water.\nWeigh empty conical tubes with caps and place the tubing outlets in each conical tube.\nStart dispensing at a defined flow rate, which is applied during the cultivation.\nWeigh the filled conical with caps and insert the weight of the dispensed water to the software interface.\nFor feed and waste lines, note the calibration values and repeat steps b–e while using the smaller diameter pump head tubing.\npH probe calibration\nRemove the pH probe from the storage solution, examine the pH probe’s diaphragm for damages and attach the probe to the cable of the bioreactor\nRinse with water, dry with a tissue without rubbing on the diaphragm, and place both the pH probe and the respective temperature probe into the pH 7.00 calibration buffer. It is important to ensure that the diaphragm is fully submerged in the buffer.\nAfter pH and temperature readings have stabilized, calibrate the offset\nRepeat steps b and c using pH 4.01 calibration buffer for slope calibration.\nAssembly of the bioreactor\nAssemble the head plate considering the schematic in Figures 4[href=https://www.wicell.org#fig4] and 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Fig4.jpg",
    "Figure 4. Schematic overview of the headplate arrangement for both DASbox and DASGIP Bioblock bioreactor systems\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Fig5.jpg\nFigure 5. Schematic overview of the assembly of bottles to the DASbox bioreactor\n(A) Exemplary images of the connection of bottles to the bioreactor. Starting with the waste bottle, followed by feed, base and inoculation.\n(B) Side and top view of the assembled bioreactor in order to highlight connections.\nTo enable sampling without process interruption, add a piece of silicone tubing (i.d. 1.0 mm) with a Mohr pinchcock clamp, a female Luer-Lock connector and a Luer-Lock sampling valve to the sample port. Fix connections with cable ties.\nExhaust and inlet air filter:\nAdd a piece of silicone tubing (i.d. 4.0 mm) with a vent filter to the exit port of the exhaust gas line.\nAssemble a piece of small silicone tubing (i.d. 1.0 mm) with a piece of larger silicone tubing (i.d. 4.0 mm) with the help of a hose reduction piece.\nAttach a vent filter to the larger tube and connect everything to the headspace gassing port (for overlay gassing); fix connections with cable ties.\nAttach the impeller (Pitched-Blade Impeller, 8-blade, 60° pitch) at the lowest-possible position of the impeller shaft and tighten with screws in the holding sleeve.\nAttach the sintered glass frit with a small piece of tubing to the dip tube and position it directly above the impeller. It will function as a cell retention filter while perfusion.\nAttach base-, feed- and waste-tubing with bottles and respective ports at the bioreactor head plate. Note that the longer part of the tubing should always be attached to the bottle (but not to the head plate).\nTo prepare the inoculation bottle:",
    "attach a silicone tubing (i.d. 4.0 mm; o.d. 6.0 mm) with the hose nozzle at the bottom of the inoculation bottle (Media bottle with two 9 mm hose nozzles).\nSubsequently, add a piece of silicone tubing (i.d. 4.0 mm) with a vent filter to the second hose nozzle at the top of the bottle.\nAttach the Inoculation Bottle to the respective port at the bioreactor.\nBioreactor sterilization\nCover the bottom of the bioreactor vessel with pure water in order to allow steam autoclaving and to prevent the pH probes from drying out.\nWrap vent filters with aluminum foil to protect from humidity. Close silicone tubing of the sampling port with the Mohr pinchcock clamp.\nAutoclave bioreactor at 120°C for 20 min.\nPlace the bioreactor vessel into the bioreactor station and connect to the overhead drive, exhaust condenser, temperature sensor, gas supply to the overlay port, and connect the cables of the pH and DO probe.\nRemove the water and replace it with 100 mL of sterile PBS with the help of the inoculation bottle. This step should be conducted as soon as possible to prevent the pH probe’s diaphragm from draining.\nPlace the base tubing in pump B, the feed tubing in pump C and the waste tubing in pump D.\nFill the base bottle with 100 mL of NaHCO3 and prime the tubing until one drop of base is dropping into the bioreactor.\nDissolved oxygen sensor calibration\nStart overlay gassing with 21% O2, temperature control at 37°C and stirring at 80 rpm. Let the DO probe polarize for at least 6 h.\nThe next day, perform one-point slope calibration at 100% DO.\nOptional: Additionally apply gassing with pure N2 for another 6 h followed by zero point calibration.\nSoftware set-up (shown in Figure 6[href=https://www.wicell.org#fig6])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Fig6.jpg",
    "Figure 6. Display of the software set up for bioreactor start\nTo set up the software first click on “New Workflow”\nUnder the tab “Default Template” select Control (Cell Cultivation: pH Control (CO2/base); DO Control (XO2, F)). Then select the respective number of reactors to be used and press “open”.\nRemove the tick at pH Calibration and DO Calibration, change the name of the process from “Manager X” to your specific process. Subsequently select the bioreactor units to be used; Optional: name each unit and press “Next”\nIn the next window, change the settings by pressing on “Feed C”, the tab “Pump C (Sub.)” and change “V.Mode” to “Ignore”; repeat for “Feed D”. Next press “pH” and the tab ”pH Control” and change the values at “Min” to “−25%” and at “Max” to “10 mL/h”. Subsequently select the tab “Pump B (Base)” and change “V.Mode” to “Ignore”. Finally press “Next”.\nCopy the Script by clicking on the individual Unit and press on “Vessel”, select the tab “Scripting”, paste the Script (available under Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Mmc2.pdf]), adjust the volume to your specific working volume and press “Apply”.\nPreparation and assembly of bioreactor system for larger process scale (DASGIP Bioblock; for 300–1000 mL process scale)\nTiming: 3 days before bioreactor inoculation\nThe Preparation of the DASGIP Bioblock is analogous to the preparation of the DASbox. Therefore, only changes between the DASGIP Bioblock and the DASbox preparation will be described here.\nChange to 8. a.\nUse 1.5 mL of Sigmacote.\nChange to 9. a. i.\nThe tube diameter for feed and waste should be 1.0 mm + 2.0 mm.\nChange to 12. e.\nFill the bioreactor with 400 mL of PBS after autoclaving.\nChange to 12. g.\nFill the Base bottle with 400 mL of NaHCO3.\nBioreactor inoculation\nTiming: 1.5 h",
    "This section describes how inoculate the bioreactor after the bioreactor was set-up along the description in “Preparation and assembly of the Bioreactor system” (shown in Figure 7[href=https://www.wicell.org#fig7])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1227-Fig7.jpg\nFigure 7. Exemplary images of how an inoculation bottle is used to transfer media and cell suspension into the bioreactor\nPlace the inoculation bottle on a lower level than the bioreactor and transfer the PBS from the bioreactor into the inoculation bottle, by gravity. Tilt the bioreactor to further transfer remaining PBS. Place the inoculation bottle (while being attached to the bioreactor) under the flow hood and discard the PBS.\nAdd 110 mL of fresh E8 suspension medium for bioreactor inoculation to the inoculation bottle, place the inoculation bottle on a higher level than the bioreactor and let it flow by gravity into the bioreactor.\nInitiate bioreactor agitation, gassing and temperature control.\nDissociate the cells from the T-flasks as described in 5; here, the use of a 500 mL centrifugation tube (instead of 50 mL conical tubes) facilitates the process. Resuspend the cell pellet in 100 mL of fresh E8 suspension medium for bioreactor inoculation and determine the cell density of the resulting cell suspension applying the Vi-CELL XR.\nCalculate the volume of your cell suspension that contains 75 million cells (this cell number is required to achieve the final cell density 0.5 × 106 cells/mL in 150 mL process scale) and transfer the calculated volume into the bioreactor utilizing the inoculation bottle, as described in 21.\nAdd the remaining volume of fresh E8 suspension medium for bioreactor inoculation to fill up to 150 mL to the inoculation bottle and transfer the medium into the bioreactor; this step is required to flush the tubing, thereby avoiding any cell loss in the tubing.",
    "Using the software interface, click on Inoculation and Press Start. This step is critical since it defines the (inoculation-) timing for the entire process script. Bioreactor settings are displayed in Table 2[href=https://www.wicell.org#tbl2].\ntable:files/protocols_protocol_1227_6.csv\ntable:files/protocols_protocol_1227_7.csv\nAs described in “Sampling from the bioreactor”, draw a first process sample at 30 min after inoculation.\nThe sample can be directly measured via the Vi-CELL XR to test/confirm the desired inoculation cell density aiming at 0.5 × 106 cells/mL; no enzymatic dissociation of the sample is necessary at this point since the cells have not yet attached into aggregates.\nFill the feed bottle of the bioreactor with E8 full feed medium I and II; two options can be applied:\nIf a dedicated fridge is available, the feed bottle can be placed in the fridge at 4°C. Such cooling allows depositing the entire feed medium required for the first 4 days of process duration.\nRequired volume calculation: process scale multiplied with sum of working volumes during this time span (see Table 2[href=https://www.wicell.org#tbl2]) i.e., 150 × 5.5 = 825 mL of E8 full feed medium I. After 4 days of process duration, additional 2.55 L (at the 150 mL scale) of E8 full feed medium II need to be filled in the feed bottle.\nWithout the cooling option, only 150 mL of E8 full feed medium I required for the next 24 h of feeding should be deposited in the feed bottle at 20°C–22°C. Subsequently, the feed bottle needs to be refilled on a daily basis based on the applied feed rate (see Table 2[href=https://www.wicell.org#tbl2]).\nAfter filling the feed bottle, prime the feed lines.",
    "Due to high cell growth, headspace gassing is not sufficient for the whole process duration. Therefore, it needs to be changed to submerse gassing, with a lower gassing rate in order not to damage aggregates by rising bubbles.\nAfter 4 days of process duration. Go to the bioreactor vessel script as described in 14.e. and change the line “Dim FSP as double = VR ∗ 6” to “Dim FSP as double = VR ∗ 1”. Subsequently detach the gassing from the overlay port and attach it to the submerged port in order to supply more oxygen to the culture.\nNote: Conduct the process equivalent to steps 20–30 applying the DASGIP Bioblock bioreactor system enabling process scales ranging at 300–1000 mL.\nSampling from the bioreactor\nTiming: 1.5 h, daily\nThis section describes how to draw cell suspension samples from the bioreactor for monitoring cell aggregation and growth kinetics without process interruption. Sampling and sample analysis should be conducted every 24 h (or more frequently on demand).\nRemove the cap from the bioreactor sample port and spray with 70% Ethanol.\nConnect a sterile syringe to the valve, create a slight underpressure by pulling the plunger, open the Mohr pinchcock clamp, slowly draw 1 mL of cell suspension into the syringe and close the clamp immediately.\nAfter the syringe has been unplugged, discard the cell suspension in order to remove residues that accumulated in the sample line since the last sampling. Subsequently, draw another 2.5 mL of sample volume. Fill the sample into a well of a low attachment 6 well plate. Clean the sample port with 70% ethanol before closing the cap.",
    "To assess aggregate morphological appearance and systematic size determination, conduct microscopic images of the hPSC aggregates directly after sampling. Subsequently, transfer 2 mL of the suspension sample into tubes and centrifuge at 300 × g for 3 min. The supernatant can be stored at −20°C before metabolic analysis e.g., to assess glucose, lactate or amino acid contents.\nFor cell counting, wash the obtained cell pellet carefully with 1 mL PBS (avoiding aggregate loss), add 500 μL of Accutase, mix well and incubate for 3 min at 37°C. Centrifuge at 300 × g for 3 min, discard the supernatant, resuspend in 2 mL PBS and determine the cell density with the Vi-CELL XR. Cells can be used for additional analysis such as gene expression patterning, cell cycle assessment or flow cytometry-based monitoring of pluripotency marker expression.\nFlow cytometry-based analysis of pluripotency markers\nTiming: 1 day\nUse dissociated cells from the previous step at ∼150000 cells/ well of a 96 well plate.\nThe pluripotency-associated surface markers SSEA-3, SSEA-4 and TRA-1-60 can be triple stained in 50 μL PBS/well applying the following dilutions: 1:25 for SSEA-4 and TRA-1-60, 1:50 (for SSEA-3). Incubate for 12 min at 20°C–22°C.\nFor the intracellular pluripotency- and proliferation-associated markers OCT-3/4, NANOG and KI-67, respectively, treat ∼150000 cells/ well with FIX&PERM® Solution A for 15 min at 20°C–22°C. Conduct triple staining in 50 μL PBS + FIX&PERM® Solution B (1:1 ratio) for 12 min at 20°C–22°C using 1:25 dilutions of each antibody.\nCleaning of the bioreactor\nTiming: 1 day\nThis section describes how to properly clean the bioreactor vessels and tubing before re-usage.\nFor process termination, remove the cell suspension using the inoculation bottle as described in 20. The cells can be further processed as required.",
    "Fill the bioreactor with 200 mL of Terg-a-zyme® solution, set the stirring at 150 rpm and incubate at 37°C for at least 12 h.\nDetach all tubing from the bioreactor, place the detached ends into a 500 mL beaker with ∼500 mL of distilled water and pump backwards into the attached feed-, waste- and base- bottles for 2 h.\nDetach the tubes from the bottles and place the other end of the tubes into the distilled water-filled beaker to pump in circles for at least 12 h.\nRinse all bioreactor ports with Terg-a-zyme® solution. Rinse the cell retention filter thoroughly to avoid future clogging.\nOn the next day, remove the Terg-a-zyme® solution from the bioreactor and replace with distilled water, rinse the ports with distilled water and incubate for 4 h.\nRemove tubes from the beaker. Continue to pump for 30 min in order to remove liquid residues from tubes.\nUnscrew DO and pH sensors from the head plate. Place the pH sensor back into the storage solution.\nRemove the water from the bioreactor vessel and pat dry."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Biotechnology And Bioengineering",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}