{
  "id": 10308,
  "origin_website": "Jove",
  "title": "Detergent-Free Decellularization of the Human Pancreas for Soluble Extracellular Matrix (ECM) Production",
  "procedures": [
    "This research study was approved by the human research committee of Wake Forest Baptist Medical Center. Human pancreases were ethically obtained from organ donors through Carolina Donor Services. Organ donors were screened for infectious diseases relevant to humans, according to UNOS regulations. Organs were received in sterile preservation solution where they were kept until use. Upon delivery to the lab, all organs were inspected, and samples of the native pancreas were collected for histological purposes. The organs were then frozen and stored in sterile conditions at -20 °C until further use.\n1. Surgical preparation of the human pancreas\nNOTE: Frozen pancreases were thawed overnight at 4 °C.\nBefore initiating surgical dissection of the human pancreas, prepare 1 L of washing solution, consisting of 950 mL of deionized water (dH2O), 50 mL of iodine-based reagent and 1% Pen/Strep solution.\nWear sterile gloves and a lab coat during the surgical dissection. Perform all surgeries under a cell-culture-grade hood to avoid possible contamination.\nTransfer the pancreas from the sterile transport bag into the sterile placenta basin. Ensure the pancreas is oriented with the head of the organ to the left and the tail to the right.\nCarefully dissect the duodenum from the head of the pancreas using sterile scissors and non-toothed forceps. Be careful not to make a hole in the duodenum, as this increases the chances of contamination.\n\tNOTE: If a hole is made in the gastrointestinal tract, quickly clamp the hole, and proceed with the dissection.\nOnce the dissection of the head of the pancreas is completed, dispose of the duodenum into an appropriate biohazard bag and follow institutional guidelines for its disposal.",
    "Dissect and discard all extra-pancreatic tissue remaining around the head of the pancreas, including major blood vessels and the common bile duct, which are usually marked at the time of organ procurement with non-absorbable sutures. Dispose of the tissue following institutional guidelines.\nDissect and discard all extra-pancreatic tissue and peripancreatic adipose tissue surrounding the tail of the pancreas, exposing the splenic blood vessels.\nOnce the vascular pedicle of the spleen is exposed, remove the spleen, and dissect the splenic blood vessels in their entirety, including those attached to the posterior surface of the pancreas (the splenic artery and vein). Dispose of the spleen and remove tissue following institutional guidelines.\nAppropriately dissect and dispose any extra-pancreatic fat clearly visible, especially peripancreatic fat.\n\tNOTE: At the level of the tail of the pancreas, the retroperitoneum may be visible. This should be lifted with non-toothed forceps, removed accordingly with surgical forceps, and disposed of properly. The pancreas should now be free of any extra-pancreatic tissue.\nDissect the pancreas to obtain 1 cm3 cubes of pancreatic tissue using surgical scissors, sterilized histological blades, or surgical scalpels. Pancreatic tissue cubes obtained after this dissection will undergo the decellularization process. The average number of pancreatic cubes that undergo decellularization depends on intrinsic characteristics of the organ. On an average, between 40–60 pancreatic cubes underwent decellularization in the presented study.\nProceed to step 2.1\n2. Decellularization of the pancreatic tissue\nNOTE: This protocol was used with pancreas with an average weight of 100 g; therefore, it is not recommended to exceed this weight when using this decellularization technique.\nPlace all the pancreatic tissue previously dissected in step 1.10 in a sterile plastic container (see Table of Materials) with the washing solution and incubate for 15 min at room temperature (RT).",
    "Remove the pancreatic tissue with the help of sterile forceps and place it in a new sterile container that contains sterile, endotoxin-free deionized water. Firmly close the cap of the container and place it on a refrigerated orbital shaker with a set temperature of 4 °C and a shaking speed between 180–200 rpm for 24 h.\nRemove the container with the pancreatic tissue and clean the outside appropriately before placing it into the hood for continuation of the process.\nRemove the pancreatic tissue using surgical forceps and place it into a new sterile container, along with 1 L of deionized water, 50 mg of DNase I, and 0.0025% magnesium chloride. Firmly close the cap of the container and place it in an orbital shaker, with a preset temperature of 37 °C and shaking speed of 100 rpm for 6 h.\nPrepare the EDTA-Trizma solution\n\t\nGather a new sterile 1 L container and clean it appropriately before introducing it into the hood. To prepare 1 L of EDTA-Trizma solution, add the following: 985 mL of sterile deionized water, 7.5 mL of Tris-HCl Buffer, and 7.5 mL of EDTA solution. Store it at 4 °C until use.\nRemove the container enclosing the pancreatic tissue and clean the outside appropriately before introducing it into the hood for the continuation of the process.\nRemove the pancreatic tissue with the help of surgical forceps and place it into a new sterile container with 1 L of EDTA-Trizma-based solution. Firmly close the cap of the container and place it in an orbital shaker, with a preset temperature of 4 °C and a shaking speed between 180–200 rpm for 18 h.\nRemove the container containing the pancreatic tissue and clean the outside appropriately before introducing it into the hood for the process.",
    "Remove the pancreatic tissue with the help of sterile forceps and place it in a new sterile container with sterile endotoxin-free deionized water. Firmly close the cap of the container and place it on a refrigerated orbital shaker, with a set temperature of 4 °C and shaking speed between 180 and 200 rpm for 24 h.\n\tNOTE: During this processing period, there will be a noticeable change in color, in which the tissue will appear brighter.\nCollect the pancreatic tissue and store it in sterile 50 mL centrifugation tubes, reaching a maximum of 25 mL per tube for subsequent freezing and lyophilization. The number of centrifugation tubes varies depending on the size of the pancreas. Store samples at -80 °C.\n3. Production of pancreatic ECM powder – lyophilization and cryo-milling\nAfter a minimum of 24–40 h of storage of the decellularized material at -80 °C, transfer the pancreatic ECM into a freeze dryer.\nTransfer the frozen material into a freeze dryer, preventing the material from thawing.\n\tNOTE: The lyophilization step takes approximately 3–5 days depending on several factors, such as the amount of material in each tube undergoing the process and the surface exposed for lyophilization. It is recommended that the decellularized tissue does not exceed the level of 25 mL in each tube and that the tubes are frozen at a 45° angle, allowing more surface to be readily exposed once the lyophilization starts. Remove the lids from the tubes.\nAfter lyophilization, transfer the materials into a cell-culture-grade hood.",
    "Cut each piece of the dried ECM into half of its size using sterile scissors. These dried ECM pieces will be subjected to an automated milling process to produce an ECM powder. Use a cryo-milled automatic processor to avoid a rise in temperature and subsequent denaturation of the biological properties of the ECM. Make sure to adjust the setting of the cryo-milling machine to obtain a fine powder after the milling process.\n\tNOTE: In this study, pancreas from donors with a BMI < 30 were used. Pancreata from donors with a BMI > 30 showed a tendency to contain more intraparenchymal fat. The process of lyophilization is not considered optimal and may be inhibited by fat content. If after lyophilization the tissue is visibly oleaginous, it must be discarded as it will not be optimal for manufacturing the ECM powder.\n4. Solubilization of the pancreatic ECM\nNOTE: At this point, from an average size pancreas (100 g), the yield of the decellularized pancreatic powder is 1–2 g.\nWeigh 1 g of ECM powder with the aid of a sterile plastic spatula.\nAchieve solubilization following protocols previously described: Solubilize 1 g of ECM in 100 mL of 0.01 M HCl and 100 mg of pepsin for 48 h at RT with constant stirring28.\nAfter 48 h, use NaOH to neutralize the pH (pH = 7) of the acidic ECM while keeping the beaker containing the acidic ECM on ice to avoid gelation.\n\tNOTE: Gelation kinetics varies according to the temperature, collagen content, pH, and neutralizing solution. In this research study, 0.01 M of NaOH was used. The volume of NaOH added for pH neutralization was approximately 100 mL. Consider measuring the pH multiple times while neutralizing the acidic ECM solution.",
    "Transfer the neutral ECM solution into sterile 50 mL centrifuge tubes. Close the tubes and place them into a centrifuge. Centrifuge the tubes containing the solubilized ECM at maximum speed (12,000 x g) for 15 min at 4 °C. Following centrifugation, transfer the tubes into a cell culture hood.\n\tNOTE: Following centrifugation of the sample, the insoluble component of the ECM will be deposited at the bottom of the tube, while the solubilized ECM-solution will be found at the top in the supernatant.\nUsing sterile techniques, collect the supernatant of the tube containing the solubilized ECM solution and transfer it into fresh 50 mL tubes, reaching a maximum of 25 mL per tube.\nStore the ECM-solution tubes at -80 °C.\n5. Production of pancreatic ECM powder – lyophilization and storage\nAfter at least 24–40 h of storage of the soluble ECM-solution at -80 °C, transfer the tubes into a freeze dryer.\nTransfer the frozen material into a freeze dryer, ensuring that the material does not thaw.\n\tNOTE: The lyophilization step takes approximately 3–5 days depending on several factors, such as the amount of material in each tube undergoing the process and the surface exposed for lyophilization. It is recommended that the solubilized ECM solution does not exceed the level of 25 mL in each tube and that the tubes are frozen at a 45° angle to allow more surface to be readily exposed once the lyophilization starts. Remove the lids from the falcon tube before lyophilization.\nAfter lyophilization of the solubilized ECM-solution, transfer the material into a cell culture-grade hood. After complete lyophilization, a fine ECM powder will be visible.\n\tNOTE: The obtained yield is 700 mg from 1 g of decellularized tissue.\nStore the solubilized ECM powder or use for the cell culture purposes.",
    "NOTE: It is advised to store the ECM at 4 °C for immediate use, at -20 °C for later use, and at -80 °C for long-term storage.\n6. Characterization of the pancreatic ECM with histological staining\nCollect a piece of native pancreas soon after the delivery of the organ and before the decellularization. Fix this for 24 h in 10% formalin. Wash the samples in deionized water. Dehydrate it in graded alcohol before embedding it in paraffin and slice into 5 mm sections.\nAt the end of the decellularization process, collect a sample of the decellularized material and fix it for 24 h in 10% formalin. Wash the sample in deionized water. Dehydrate it in graded alcohol before embedding it in paraffin and slice into 5 mm sections.\nTo verify a successful decellularization, perform H&E and DAPI staining on both the native pancreas and the decellularized counterpart.\nFor histological characterization, perform Masson’s Trichrome (MT) and Alcian Blue (AB) stainings, which will highlight the collagenous and GAGs structures, respectively.\n7. Characterization of the soluble ECM powder\nPerform DNA content and total collagen analysis of the native pancreatic tissue and the soluble ECM powder as described previously29.\nQuantify sulfated glycosaminoglycans (sGAG) based on the protocol provided by a commercially available kit (see Table of Materials). Use a microplate spectrophotometer to measure sulfated sGAG content in the pancreatic ECM at a wavelength of 595 nm30.\n\tNOTE: Report DNA content as ng/mg of dry tissue and the collagen and GAGs content as μg/mg of dry tissue.\n8. Human Islets encapsulation with the ECM and culture\nNOTE: Human pancreatic Islets were commercially obtained (see Table of Materials).",
    "Upon arrival, culture the human pancreatic islets in non-tissue culture treated plates for 24 h under standard condition with an approximate density of 2,000 IEQ in each 10 cm plate.\nManipulate the human islets to test the effect of the ECM on the islets’ functionality and viability with the following experimental groups: Free Islets, Islets encapsulated in alginate, and Islets encapsulated in alginate-ECM.\n\tNOTE: The above-mentioned groups of islets were cultured in vitro under standard condition for up to 8 days to assess the effect of the ECM on islets functionality and viability.\nWeigh alginate on a scale and suspend it with HBSS into a centrifugation tube in order to obtain a ratio of 1.5% (w/v). Place the centrifuge tube on a rotator overnight at 4 ˚C.\n\tNOTE: A molecular weight between 75–200 kDA and a G/M ratio of ≤ 1 were reported by the manufacturer for the alginate.\nWeigh 0.1 mg of ECM and suspend it in 1 mL of the alginate previously prepared in order to have ECM concentration of 0.1 mg/mL.\nEncapsulate human pancreatic islets in alginate and alginate-ECM according to a previously described protocol31. The procedure is described in brief below.\n\t\nGently collect and mix 3,000 IEQ in 1 mL of alginate and 3,000 IEQ in 1 mL of alginate-ECM at an ECM concentration of 0.1 mg/mL previously prepared in step 8.4.\nPump the obtained suspensions through a microfluidic encapsulation device set to 0.2 mL/min and flow rate and air pressure of 2.0 Pa, respectively.\nUpon production, collect the microcapsules in 100 mM of CaCl2 bath with 10 mM of HEPES. Allow alginate to crosslink for 10 min.\nPrior to being cultured, wash the encapsulated islets with HBSS under standard condition, for 2–3 min at 37 ˚C, with 5% CO2.",
    "Add the culture media (see Table of Materials) and change two-third of the media every other day until the end of the experiment.\n\t\tNOTE: The above steps must be performed both for the Islets in alginate and Islets in alginate-ECM.\nOn day 8, post-encapsulation, perform glucose-stimulated insulin secretion (GSIS) and DNA analysis to assess the production of insulin and islets viability, respectively.\nObtain brightfield images and Live/Dead staining of free and encapsulated islets to assess cellular morphology and viability.\n\tNOTE: Qualitative assessment of the images was performed to assess the islets’ health. Parameters taken into consideration include shape, border, integrity, and diameter of the islets, as well as the presence of single cells in culture.\n9. Glucose-stimulated insulin release (GSIS) and DNA measurement\nNOTE: On day 8, post-encapsulation, human pancreatic islets were collected and incubated with Kreb’s buffer, containing low (2.8 mM) and high (16.8 mM) glucose concentrations, followed by KCl depolarization solution (25 mM). The glucose challenge was performed with modification of a protocol previously described32.\nInsert gel filtration resin in polypropylene columns.\nInsert treatment groups (free islets or encapsulated islets) in the middle portion of the gel filtration resin within the polypropylene columns.\nPipette glucose and depolarizing solutions into the polypropylene columns described above and incubate for 1 h, in the following order: perform a pre-incubation period with low molarity glucose solution, then proceed with a series of incubations with low, high, low, and depolarizing glucose solution as mentioned in the NOTE at the beginning of section 9.\nCollect the medium from each incubation phase and store it at -80 °C for subsequent analysis.\nFollowing incubation and collection of the depolarizing solution, incubate human pancreatic islets with 1 mL of DNA extraction buffer and store it until further analysis.",
    "Measure the insulin content from the glucose and the depolarizing solution incubations with an Insulin ELISA assay, following the manufacturer’s protocol.\nMeasure the DNA content from the extraction buffer collected in step 9.5 using a DNA assay kit following the manufacturer’s protocol.\nNormalize the insulin measurements according to the DNA content.\n10. Statistical analysis\nNOTE: Group comparisons refer to the same batch of human islets with n = 3 independent assessment conducted for each assay described in this manuscript. Values are expressed as Mean ± SD.\nUse a statistical software to perform the Mann-Whitney test for the assessment of decellularization and DNA remnants analyses, compare the native, the decellularized pancreas, and the solubilized ECM.\nPerform an unpaired t-test for the assessment of the glycosaminoglycans and collagen between the native, the decellularized pancreas, and the solubilized ECM.\nPerform a 2-way ANOVA with post-hoc Turkey’s multiple comparisons for the Glucose Stimulation Test in the assessment of the islets stimulation on day 8.\nConsider statistical significance at p < 0.05 with designation of *p < 0.05, **p<0.01, ***p < 0.001, and ****p < 0.0001.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}