{
  "id": 2336,
  "origin_website": "Cell",
  "title": "Measurement of ciliary beating and fluid flow in the zebrafish adult telencephalon",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation of the adult brain explant\nTiming: 10–30 min\nDissecting intact brain explants (Figure 1[href=https://www.wicell.org#fig1]A) is critical for the success of the experiment. Damaged adult brain explants can be a major cause of experimental failure. Experimenters should carefully prepare brain explants during the process described below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig1.jpg\nFigure 1. Preparation of the adult brain explant\n(A) Diagrams showing how the pigmentless adult brain explant is prepared.\n(B and C) Detailed procedure for the dissection of the adult zebrafish brain. (C) Optional steps. Red marks indicate optional steps.\n(D) Diagrams showing the key steps for the preparation of a brain explant from a pigmented zebrafish. The black lines delineate the border of the adult brain (B3, D2). The dotted straight lines label the cutting sites. Red arrows indicate pulling directions. Black arrows mark brain regions. Anterior is to the right in all panels. Abbreviation: Telencephalon (Tel), olfactory bulb (OB), choroid plexus (ChP), pineal gland (Pi), anterior (A), posterior (P), left (L) and right (R). Scale bar: 100 μm.\nEuthanize adult zebrafish with ice-cold AFW.\nGently move one adult zebrafish into ice-cold AFW.\nWait for a few minutes until there is no body and gill movements.\nDuring the time, prepare a petri dish and fill it up with prechilled aCSF.\nNote: Hypothermic euthanasia by ice-cold water is not approved by the EU directive 2010/63/EU. Thus, this step could require an additional animal permit, depending on the legislation of each country. Alternatively, overdose of anesthetics could be used for euthanasia. Yet, we do not know if the use of anesthetics has an impact on fluid flow or ciliary beating.\nRecord information on the fish and prepare the sample.\nMeasure body length and log this information together with the gender (Figure 1[href=https://www.wicell.org#fig1]B1).",
    "Cut off the head posterior to the operculum, using scissors.\nFrom here onwards, work as quickly as possible to avoid brain degradation interfering with the sample quality.\nTransfer the head into a petri dish filled with aCSF and proceed to the next steps using cold aCSF to maintain the brain explant alive.\nThe lifetime of a brain explant is very variable. However, we recommend the experimenters to finish all dissection steps within 30 min and imaging within 60 min.\nRemove unnecessary organs such as jaws, eyes, and nose under a stereomicroscope.\nCut out under the jaw parts of the head with a small scissor (Figures 1[href=https://www.wicell.org#fig1]B2 and 1B3), and then remove the eyes followed by cutting the nose part carefully, using a small scissor (Figures 1[href=https://www.wicell.org#fig1]B5–1B7).\nCritical: Do not damage the olfactory bulb. Loss of olfactory bulbs causes leakage or loss of fluid in the telencephalon, which will impair the measurement of fluid flow in the ventricle (troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 1).\nCritical: If the nose part is not properly incised, olfactory bulb could be easily damaged when the dorsal skull is removed.\nCut the dorsal skull nearby the cerebellum or brain stem using a small scissor (Figures 1[href=https://www.wicell.org#fig1]B8 and 1B9).\nCautiously remove the dorsal part of skull by tearing both sides of the dorso-posterior skull, using fine forceps (Figures 1[href=https://www.wicell.org#fig1]B10–1B12).\nIf there are still bones connected to the olfactory epithelium and olfactory bulb, carefully remove them with the forceps.\nCritical: Be careful not to scratch the telencephalon, especially the dorsal part where the motile ciliated tela choroida is located. It will not be possible to image fluid flow in a telencephalon with a damaged tela choroida.\nRemove the ventral parts of the head gently using fine forceps (Figures 1[href=https://www.wicell.org#fig1]B13 and 1B14). Then, cut optic tracts with a small scissor (Figure 1[href=https://www.wicell.org#fig1]B15).",
    "Mount the brain explant on the small petri dish coated with Sylgard using a 10 mL plastic pipette (Figure 1[href=https://www.wicell.org#fig1]B16) and fix it with a tungsten pin tightly (Figure 1[href=https://www.wicell.org#fig1]B17) (Kermen et al., 2020a[href=https://www.wicell.org#bib11], 2020b[href=https://www.wicell.org#bib12]).\nNote: Be careful when fixing the explant with the tungsten pin since the pin could scratch the explant easily. Also, if the explant is not affixed firmly, the explant will move, which impairs data acquisition and analysis.\nRemove the lipid droplets above the pineal gland (Figures 1[href=https://www.wicell.org#fig1]B18 and 1B19) and pull the pineal gland out very cautiously using fine forceps (Figures 1[href=https://www.wicell.org#fig1]B20 and 1B21).\nNote: The presence of the pineal gland hinders the recording of ciliary beating and fluid flow in the choroid plexus and part of the telencephalon located below the pineal gland. If the target areas are not obscured by the pineal gland, this step is not necessary.\nCritical: The pineal gland is located above the choroid plexus and they are connected to each other. Be extremely careful when detaching it. If the choroid plexus is pulled out together with the pineal gland, fluid flow measurement will be impossible since the choroid plexus is linked with the ventricular system. Loss of the choroid plexus may also impair ciliary beating in other areas due to leakage of CSF.\nOptional: For imaging of ciliary beating at the telencephalic midline, first remove the choroid plexus (Figures 1[href=https://www.wicell.org#fig1]C1 and 1C2). Then, take the dura off from the posterior to anterior part of telencephalon (Figures 1[href=https://www.wicell.org#fig1]C3 and 1C4). Split the hemisphere of telencephalon using forceps or a small scissor (Figures 1[href=https://www.wicell.org#fig1]C5–1C8) and mount the midline upside by fixing with a tungsten pin (Figure 1[href=https://www.wicell.org#fig1]C9). Scratching brain areas is acceptable for recording ciliary beating if there is no direct injury at the surface of the midline.",
    "Note: This dissection requires some practice but should be achievable by anyone following our recommendations.\nNote: There is constant neurogenesis in the zebrafish brain, hence their brain keeps on growing during their life span. In our experience, it is easier to dissect bigger brain. Nevertheless, the same steps can be followed at any stages.\nRecording of ciliary beating\nTiming: 20–60 min\nMount the dish on the brightfield light transmission microscope and exchange to aCSF bubbled with carbogen (95% O2/5% CO2) at room temperature (Figure 2[href=https://www.wicell.org#fig2]A1).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig2.jpg\nFigure 2. Measurement of ciliary beating in the adult telencephalon\n(A) Diagrams presenting the overall procedure to measure ciliary beating in the brain explant using a light transmission microscope. (A1) Oxygenated artificial cerebrospinal fluid (aCSF) is delivered to the brain explant through a perfusion system (inlet is labeled as “IN” and outlet as “OUT”). (A2) A region of interest is identified using a 40× objective prior to the recording (A3). The pink areas indicate the regions where ciliary beating can be observed (the tela choroida and choroid plexus). The big red box on the right side indicates high magnification of the small red box in the left side. The clusters of magenta lines display motile cilia in the explant. (A4) The analysis can be performed using a MATLAB script or the FreQ plugin in ImageJ/Fiji.\nNote: Be cautious when exchanging cold aCSF to room temperature carbogenated aCSF via a perfusion/suction system. It may alter the location of the explant on the dish.\nNote: It is important to exchange to oxygenated aCSF at room temperature for 30 s at least, because temperature could affect ciliary beating (Clary-Meinesz et al., 1992[href=https://www.wicell.org#bib2]; Green et al., 1995[href=https://www.wicell.org#bib5]) (troubleshooting[href=https://www.wicell.org#troubleshooting] Problem 2).",
    "Note: We have a perfusion/suction system to exchange aCSF as shown in Figure 2[href=https://www.wicell.org#fig2]A1. It is very important to perfuse the sample as much as possible to keep it healthy. We stop perfusion only when an externally applied fluid flow impacts the recording (e.g., motile cilia are exposed or measuring fluid flow).\nNote: We do not use an incubator to maintain the temperature. However, we ensure that the temperature is consistent across animals.\nSearch the region of interest in the telencephalon (Figures 2[href=https://www.wicell.org#fig2]A2 and 2A3) and then record the explant with 40× water immersion objective at circa 100 Hertz (Hz) frame rate for 30 s (Figures 2[href=https://www.wicell.org#fig2]A2 and 2A3).\nWe record the explant using an upright Olympus microscope with a Manta camera and a custom designed software previously described (Reiten et al., 2017[href=https://www.wicell.org#bib16]). The resolution with the 40× objective is 1 pixel = 0.314 μm.\nNote: Other microscope and cameras can be used for this recording as long as they have similar specifications in spatial and time resolution.\nCritical: The frequency of acquisition needs to be at least 2–3 times the ciliary beating frequency. We usually record at 100 frames per second, which is circa 4–5 faster than the beating frequency and lead to good quality results.\nMultiple recordings are required to observe overall ciliary beating along the dorsal telencephalon. We recommend the experimenters to acquire recordings from multiple overlapping regions, and then collate the data after the image analysis.\nThe recorded files will be used in data analysis (Figure 2[href=https://www.wicell.org#fig2]A4).",
    "We recommend the following regions of interest to detect ciliary beating: the choroid plexus, the tela choroida (Figure 2[href=https://www.wicell.org#fig2]A3) which is located in the superficial mid-dorsal telencephalon, and the ventral telencephalon on the midline surrounding the anterior commissure (Figure 1[href=https://www.wicell.org#fig1]C9), as described in our prior study (D'Gama et al., 2021[href=https://www.wicell.org#bib3]).\nMicroinjection of fluorescent particles\nTiming: 10–20 min\nThis step is only necessary for measuring cerebrospinal fluid (CSF) flow. Experimenters who only want to assess ciliary beating can skip this step.\nLoad the mixture of fluorescent particles (SPHERO Fluorescent Yellow Particles in RITC-dextran) into the injection needle and mount on the needle holder connected with pressure injector (Femtojet 4i). Then, cut the needle tip open with fine forceps.\nNote: Start loading the mixture of fluorescent particles after preparation of the brain explant as the mixture easily clogs the needle tip.\nNote: Before loading the mixture in the needle, mix it by pipetting rather than using a vortex. In our experience, vortexing does not reduce the clogging of the needles. Also, it may reduce the quantity of the particles by attaching the particle to the tube wall.\nNote: Cut the needle tip as little as possible since a large tip diameter could create a large hole in the tela choroida, promoting leakage of CSF.\nMeasure the size of a single droplet by injecting into mineral oil on a microscale.\nThe single droplet size can be 1–3 nL.\nTry to ensure the reproducibility of your injection by using similar parameters on the pressure injector and needles with openings of similar size.",
    "Carefully inject the fluorescent particles into the ventricle. Do not penetrate the brain parenchyma. We recommend injecting up to 15 nL in the middle cavity of the most anterior telencephalic area, posterior to the olfactory bulb (Figure 3[href=https://www.wicell.org#fig3]A1), as this allows to carefully place the needle in the ventricle without touching the parenchyma.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig3.jpg\nFigure 3. Measurement of cerebrospinal fluid flow in the adult telencephalon\nThe illustration shows the overall procedure to record cerebrospinal fluid flow in the brain explant.\n(A) Microinjection of fluorescent beads into the brain explant, using a stereo microscope and a microinjector.\n(A1) Dorsal view of the brain explant. Before (left) and after (right) injection of fluorescent beads (1.13 μm diameter). Green colored needle indicates the injection needle containing the fluorescent beads. Green dots label the distributed fluorescent particles in the explant. (A2) Oxygenation of the brain explant with aCSF (dorsal view). (A3) A region of interest is identified using a 10× objective prior to the recording (A4). The red box in the right side indicates high magnification of the region of interest. Green dots mark the fluorescent beads in the brain. (A5) Data analysis using the TrackMate (Tinevez et al., 2017[href=https://www.wicell.org#bib23]) plugin in ImageJ/Fiji or MATLAB script (this manuscript).\nNote: Slowly pull out the needle from the injected site to avoid leakage of CSF and fluorescent particles.\nNote: Injection of over 15 nL could increase the ventricle size. This will alter CSF flow patterns in the telencephalon. The volume should be adapted to the size of the brain, e.g. if juvenile zebrafish is used for this analysis.\nNote: The needle can be reused. In this case, do not let the needle tip dry. Keep it inside aCSF to prevent clogging of the tip.",
    "Note: If the injection is successful, experimenters will be able to observe particles movements immediately using a light transmission stereomicroscope (Figure 3[href=https://www.wicell.org#fig3]A1).\nRecording of CSF flow\nTiming: 10–30 min\nMount the dish on a fluorescent microscope and exchange aCSF bubbled with carbogen (95% O2/5% CO2) at room temperature (Figure 3[href=https://www.wicell.org#fig3]A2).\nNote: Be cautious when exchanging cold aCSF to room temperature aCSF bubbled with carbogen. It often alters the location of the explant.\nFind the region of interest in the telencephalon (Figure 3[href=https://www.wicell.org#fig3]A3) and then record the brain explant with 10× water immersion objective at 50 frames per second (fps) for at least 1 min (Figure 3[href=https://www.wicell.org#fig3]A4).\nWe record 2D timelapse of the explant using an upright epifluorescence microscope with an ocular camera and an Ocular software previously described (D'Gama et al., 2021[href=https://www.wicell.org#bib3]). The resolution with the 10× objective is 1 pixel = 1.13 μm.\nNote: Other software and camera with similar specifications can be used for this recording.\nThe recorded files will be used in data analysis (Figure 3[href=https://www.wicell.org#fig3]A5).\nNote: Record the CSF flow as soon as possible. The fluorescent particles tend to stick to the brain parenchyma and tela choroida over time, which will render the recording unusable.\nNote: Injecting into the brain parenchyma or an inappropriate volume of particles will impact the quality of the recording and of the analysis (Figure 9[href=https://www.wicell.org#fig9]E). Hence, it is important that the experimenters optimize well their injections and their imaging parameters to ensure the best particle tracking.\nData analysis of ciliary beating frequency using a MATLAB script\nTiming: 30 min – several hours",
    "To analyze ciliary beating frequency (CBF), we suggest two methods using a MATLAB script or an ImageJ/Fiji plugin (FreQ). The experimenters can choose their method of choice because both methods adapt a similar Fourier-based principle to analyze CBF (Figure 4[href=https://www.wicell.org#fig4]A) (Haward et al., 2021[href=https://www.wicell.org#bib10]; Reiten et al., 2017[href=https://www.wicell.org#bib16]; Ringers et al., 2021[href=https://www.wicell.org#bib17]). However, we recommend the experimenters to always use the same method for their analysis, since there are slight differences in their output results, as indicated in the limitations section and in Figure 10[href=https://www.wicell.org#fig10].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig4.jpg\nFigure 4. Data analysis for ciliary beating images using a MATLAB script\n(A) The diagrams show the principle underlying the analysis for ciliary beating using the provided MATLAB scripts.\n(B) The interface of MATLAB.\n(C) The partial screenshot of “step 1” (C1) and “step 3” (C2) in the MATLAB script. The numbers with red lines can be modified to reflect the experimental or analyzing conditions.\n(D) Expected outcome of data analysis. (D1) Diagram of the brain explant (dorsal view). (D2) The PNG file output after analysis. The file contains the raw image, mean power spectrum, histogram of ciliary beating frequency (CBF) and color-coded raw/masked CBF. Red dotted circles with red arrows indicate difference between the results by the MATLAB script and FreQ plugin. Abbreviation: (D1) anterior (A), posterior (P), left (L) and right (R). (D2) Peak Frequency (Peak Freq) and Hertz (Hz). Scale bars are 50 μm.\nBefore starting this analysis, install the software (MATLAB, 2021a or the latest version of ImageJ/Fiji with FreQ plugin). Here we describe detailed steps for users who are unfamiliar with MATLAB scripts or ImageJ/Fiji.\nBe aware that the time of analysis will increase for larger image sizes and longer time of recording.",
    "Since the analyses calculate the frequency of the intensity changes for each individual pixel of the recording, any drifts will lead to artifacts (Figure 9[href=https://www.wicell.org#fig9]C). Hence it is crucial to make sure that there are no drifts in x and y axis prior to the analysis. If you observe drift in x,y, you may try to correct those with an alignment code prior to the CBF analysis described earlier (Reiten et al., 2017[href=https://www.wicell.org#bib16]; Ringers et al., 2021[href=https://www.wicell.org#bib17]). However, it is important that you check manually, frame by frame that, after correction, the sample is no longer drifting in the image. To do this you may pick 2–3 very obvious features in the image and check that these localize at the same pixel position in the image and do not change shape or rotate across all frames of the image. We provide in Figure 9[href=https://www.wicell.org#fig9]D an example of a recording with a large drift that cannot be corrected with the alignment code.\nNote: Drifts in z cannot be corrected. Hence it will not be possible to analyze recordings with z drift.\nNote: We have included the raw and aligned datasets in Mendeley Data (https://data.mendeley.com/datasets/p6sfdpjpj2/2[href=https://data.mendeley.com/datasets/p6sfdpjpj2/2]) to help the reader gain confidence in how to assess an aligned dataset\nDownload all provided MATLAB scripts (https://data.mendeley.com/datasets/p6sfdpjpj2/2[href=https://data.mendeley.com/datasets/p6sfdpjpj2/2]) into one folder and set the Path to this folder.\nTo add the folders to the Path, right click the folders at the “Current Folder” tab and choose “Add to Path”- “Selected Folders and Subfolders”. This will change the gray lettered name of folder to black lettered the name of folder.\nNote: The MATLAB codes and raw recording files can be located in different folders.\nNote: Adapt to the interface of MATLAB. (Figure 4[href=https://www.wicell.org#fig4]B).\nOpen the “Master_analysis_CBF” file using the MATLAB software.",
    "Note: The file “Master analysis_CBF” contains detailed comments on how to proceed the steps. Following the comments will be helpful for the analysis.\nTo align the recording file, at the “step 1” of “Master_analysis_CBF” at the “Editor” tab, enter the value of the frequency of acquisition (Figure 4[href=https://www.wicell.org#fig4]C1, red lines) as “CBF.Fs.”. Click the “Run Section” button. (Figure 4[href=https://www.wicell.org#fig4]B) Then, select the raw recording file (.mat format) when the window “Select Files to Open” pop up.\nTo do “Run Section”, the section should be indicated with yellow color (Figure 4[href=https://www.wicell.org#fig4]B).\nThis alignment step is optional, however, it will increase the quality of analysis if there are drifts. We recommend users to conduct this step and to visually inspect aligned files prior to further analysis to ensure that drifts are corrected. Note that the alignment codes will not be able to fix large drifts as shown in Figure 9[href=https://www.wicell.org#fig9]D. Hence, we recommend experimenters to discard recordings with drifts that cannot be corrected.\nPlace the exact value of frequency for accurate analysis.\nIt will take longer time when the image size and length of recording are larger. The estimated end-time will be shown in the “Command Window” tab (Figure 4[href=https://www.wicell.org#fig4]B). The time also changes depending on the computer specifications.\nWe usually analyze 10 s to measure ciliary beating frequency. However, it can be modified by the purpose of experimenters. Put the desired analysis time at “CBF.duration” and starting timepoint of analysis instead of “1” (Figure 4[href=https://www.wicell.org#fig4]C1, redlines).",
    "If there are already aligned files or users do not want to align the recording files, skip the “step 1” and proceed the “step 2” by clicking “Run Section.” Select the aligned or raw files after a new window “Select Files to Open” pop up. In case of using not aligned raw files, experimenters should enter extra information such as the frequency of acquisition and the duration of file for analysis when questions appear in the “Command Window.”\nDefine variables like the cutoff and displaying range of frequency and spatial resolution of microscope at the “step 3”. Then, run the section (Figure 4[href=https://www.wicell.org#fig4]C2).\nWe usually use 10 Hz for the lower cutoff frequency, 10–40 Hz for plotting frequency, based on our prior work (D'Gama et al., 2021[href=https://www.wicell.org#bib3]). These values can be adapted based on the cilia beating properties of the tissue. Also, 0.314 μm/pixel is the spatial resolution of our microscope with a 40× objective. Experimenters can adjust the values for their purpose and specification of their microscope.\nPerform the fast Fourier transform by running the “step 4” section. The analysis result will be saved as a PNG file and one structure array called CBF, containing all metadata and Fourier transform results.\nNote: This step including the plotting and saving takes time. The time will change depending on the specification of the analyzing computer.\nNote: The PNG file will show the raw image of the recording file, mean of power spectrum, histogram of CBF for the masked CSF heatmap, color-coded CBF heatmap and masked CBF heatmap (Figure 4[href=https://www.wicell.org#fig4]D2).\nData analysis of ciliary beating frequency using the FreQ plugin\nTiming: 30 min – several hours",
    "To analyze CBF, experimenters could also use ImageJ/Fiji with the plugin FreQ. To use this plugin, users should install the plugin (https://github.com/hansenjn/FreQ/[href=https://github.com/hansenjn/FreQ/]) and prepare the recording file as a TIF format. This approach provides another tool to analyze CBF. It could be more convenient for the users who are not familiar with handling MATLAB scripts or do not have access to MATLAB.\nTo correct small drifts, we suggest using an ImageJ plugin called “MultiStackReg” by Brad Busse prior to CBF analysis (http://bradbusse.net/downloads.html[href=http://bradbusse.net/downloads.html]). The MultiStackReg plugin is an adaptation of another ImageJ plugin called “TurboReg” (http://bigwww.epfl.ch/thevenaz/turboreg/[href=http://bigwww.epfl.ch/thevenaz/turboreg/]) (Thevenaz et al., 1998[href=https://www.wicell.org#bib21]), which also needs to be installed.\nNote: The MultiStackReg (= TurboReg) plugin uses the first frame in a time series as a reference and transforms the following frames to match the first frame. For the transformation, the user can select one of four different methods: Translation, Rigid Body, Scaled Rotation, and Affine. If you observe only drift in X or Y direction, a simple translation function suffices and should be selected, since translation does not change the scale in the images. Note, that the other transformation functions also allow to correct rotation of the sample or rotation around X and/or Y axis, as they can stretch and rotate the other frame images to match the first frame. This, however, may change relations of the distances between objects in the transformed frames and thus such transformed files should be only subjected to distance measures with caution. For a detailed description of the individual transformation methods please visit the TurboReg webpage: http://bigwww.epfl.ch/thevenaz/turboreg/[href=http://bigwww.epfl.ch/thevenaz/turboreg/].",
    "Note: The FreQ plugin used in the following workflow cannot analyze images that have been modified in Fiji / ImageJ and not saved somewhere in your file system - if unsaved images are subjected to the analysis, an error message will appear. Make sure to save the images after registration before continuing with a FreQ analysis.\nOpen ImageJ/Fiji after installation of the FreQ plugin.\nNote: The format of the files should be TIF format to use this plugin.\nNote: Experimenters can open recording files before starting the FreQ plugin.\nStart the FreQ plugin to set up parameters for analysis.\nClick the taps, “Plugin”- “JNH”- “FreQ” to open it. Then, a new window will popup (Figure 5[href=https://www.wicell.org#fig5]A1).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig5.jpg\nFigure 5. Data analysis for ciliary beating using the FreQ plugin\n(A) The screenshots show various setup conditions on the parameters of the analysis in the FreQ plugin.\n(B) Expected outcome of the analysis. (B1) Diagram of the brain explant (dorsal view). (B2) The output PNG files after analysis. The files are color-coded raw/masked CBF, power spectrum of primary/secondary peak frequency, histogram of ciliary beating frequency (CBF). Red dotted circles with red arrows indicate difference between the results by the MATLAB script and FreQ plugin.\nEnter values using the guidance described in the following steps.\nAt the new window, choose “multiple images (open multi-task manager)” in the “Process” to open recording files (Figures 5[href=https://www.wicell.org#fig5]A1 and 5A2).\nIn case the recording files are already opened, the user can also select “active image in FIJI” or “all images open in FIJI” to analyze the files (Figure 5[href=https://www.wicell.org#fig5]A2).\nEnter the exact value of acquisition frequency in the “Recording frequency.”\nIn the “Sliding window to smooth power spectrum”, put the number to smooth power spectrum.\nWe used 2 for assessing CBF of the adult brain explant.",
    "The value may be increased for recordings of samples with very instable beating frequencies to improve the detection of the average frequency or decreased for more sharp detection of the most predominant frequency instead of determining an averaged peak frequency.\nThe section under “Enhance peak detection” provides an extra function that is not implemented in the MATLAB script above. We have experienced that this function can help to detect frequencies in unstable / noisy recordings (for examples, see Note below). Under such conditions, users may try the default settings for this section.\nThe default state of “Percent of lowest-power pixels” and “Fold SD” (standard deviation) used to calculate power threshold” are “20.0” and “1.5”, respectively.\nNote: These parameters may require optimization to your data set. Importantly, the percent of lowest-power pixels needs to be set in a way that the percentage does not exceed the percent of the image’s field-of-view where ciliary beating is visible. If the percentage is set too high, signals from ciliary beating in the image will influence background estimations. In turn, the background will be estimated too high. Thus, not all ciliary beating in the image will be quantified. This also means that this function should not be used if your whole image is showing beating cilia and if there are no image regions, where no ciliary beating is present. The SD for the power threshold also determines the background estimations and requires fine-tuning. If the SD is set too high, you will miss-out lower-powered frequencies in the results. If the SD and/or the percentage are set too low, you will still see a lot of noisy regions in the output maps.\n“3.0” is usually used for the “Local SD filter” and corresponds to the value implemented in the MATLAB script.",
    "Note: Additional Examples: This function can help in analyzing recordings at extremely high temporal and spatial resolution (e.g. 3000 Hz, recordings where individual cilia are distinguishable in the image).\nIn high-temporal-resolution recordings, it can occur that the whole sample shivers with an additional stable high frequency (e.g., 100 Hz and higher), which can be, e.g., caused by an electrical device placed on the microscope’s table or the microscope itself. This function can be used to suppress this stable, overlying frequency in the frequency peak detection.\nIn high-spatial resolution recordings there maybe oscillations of background structures become apparent as an underlying oscillation at low amplitude (e.g., triggered by cilia remote from the focal plane). Such oscillations appear in the power spectrum at lower power but may distract the primary frequency peak detection and blur the whole spectrum. When using this function, the background frequency spectrum is determined from a region where no sharp cilia are present (low power region) and this spectrum is subtracted from all spectra so that detected peaks will reflect the obvious ciliary beating in the image.\nIn the section of “Limit frequency range for quantification and plots”, enter the values of minimum and maximum frequency that experimenters desire to analyze. Then click “OK”. (Figure 5[href=https://www.wicell.org#fig5]A1).\nWe commonly use the range from the minimum “10” to maximum “40” for our analysis. It can be set differently by users.\nOptional: If experimenters want to assess a specific region of interest (ROI), they can use it by activating “Report results for ROI set by user”. Then, for each analyzed image, FreQ will request the user to draw a ROI of interest and will output (in addition to all other results) results determined within that user-defined ROI only.\nOptional: Users could select formats of output file names (Figures 5[href=https://www.wicell.org#fig5]A1 and 5A3).",
    "If the user had selected to process “multiple images (open multi-task-manager)” above, a new window will pop up that allows to make a list of files to be processed. Click the “select file individually” to find the recording files after a new window pop up.\nExperimenters could select multiple files for the analysis.\nPress the button, “start processing”. Then, the process will start.\nLonger / larger recording files will take more time to finish the analysis.\nAfter this analysis is finished, the analysis files will be saved automatically at the same folder that the recording files are located.\nThe list of output files is identical to the output of the MATLAB scripts and contains color-coded CBF heatmaps unmasked and masked as well as the average power spectrum and histogram of CBF (Figure 5[href=https://www.wicell.org#fig5]B2).\nData analysis of CSF flow\nTiming: 10–30 min\nTo analyze the directionality of fluid flow in the adult brain explant, we use both ImageJ/Fiji and MATLAB script for the analysis. We describe the detailed steps below and provide a MATLAB script to examine the directionality of fluid flow.\nOpen the recording file using ImageJ/Fiji program and convert the image scale to pixel (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig6.jpg\nFigure 6. Data analysis for CSF flow using ImageJ/Fiji\n(A and B) The screenshots show each step of the analysis using the TrackMate plugin in ImageJ/Fiji using our suggested parameters.\n(C) The screenshots of recording files during the TrackMate analysis. Dorsal view of the adult brain explant with injected fluorescent particles. (C2) Particles detected by TrackMate are circled in magenta. (C3) Tracks detected by TrackMate are highlighted in yellow.",
    "To convert the scale, click the tabs “Image” > “Properties” and write “pixel” at the “Unit of length”. Then, set the values of width and height to “1.000” (Figure 6[href=https://www.wicell.org#fig6]A). Following, the image file will show pixel width and height rather than other scales (Figure 6[href=https://www.wicell.org#fig6]C1).\nOpen the “TrackMate” plugin (Tinevez et al., 2017[href=https://www.wicell.org#bib23]) in the ImageJ/Fiji. Then, click the “Next” after checking that each value is written correctly (Figure 6[href=https://www.wicell.org#fig6]B1).\nTo open “TrackMate” plugin, click the tables “Plugins”-“Tracking”-“TrackMate”.\nAll values should be “1.000” at the “calibration settings”. Whereas, “X” and “Y” of “Crop settings” indicate the pixel size of the image and “T” means the number of images, i.e., timepoints.\nIf the values do not match with recording images, try clicking “Refresh source” and then check the value again. If there is no change, start “TrackMate” plugin again after making sure that step 32 was done correctly.\nUse the default detector, “LoG detector” and proceed “Next”. Set the “Estimated blob diameter: 10.0” and “Threshold: 50” (Figure 6[href=https://www.wicell.org#fig6]B2). Then verify that fluorescent particles are detected by clicking “Preview” (Figures 6[href=https://www.wicell.org#fig6]B2 and 6C2). Click “Next” to proceed.\nNote: We use the 10 pixel of blob diameters and a lower threshold of 50 to detect the fluorescent particles. However, these values need to be modified based on the imaging conditions and particles used. Set these numbers to detect the fluorescent particles correctly (you can check which particles are detected using the “Preview” button).\nNote: Detected fluorescent particles are labeled by purple circles (Figure 6[href=https://www.wicell.org#fig6]C2).\nNote: It will take time from a few second to a few minutes after clicking “Next”. During the step, TrackMate will provide various information including the number of found spots.",
    "Proceed “Next” four times and select the default tracker “Simple LAP tracker.” Then, click “Next.” Use the default values of pixels for “Simple LAP tracker” and proceed “Next” (Figure 6[href=https://www.wicell.org#fig6]B3).\nDefault values of “Simple LAP tracker”: Linking max distance: 15.0, Gap-closing max distance: 15.0 and Gap-closing max frame gap: 2.\nNote: These values should be adapted to your image settings.\nYellow tracer lines by the particles will be shown at the image file (Figure 6[href=https://www.wicell.org#fig6]C3). Proceed “Next.”\nColor-coded tracer lines will be shown at the image file. Proceed “Next” three times to see “Selection a action (Figure 6[href=https://www.wicell.org#fig6]B4)”\nChoose “Export tracks to XML file” at the “Selection a action.” Click “Execute” and then save the file in the desired folder.\nThe folder saving XML files should be in the added paths for running MATLAB codes.\nThe next steps on MATLAB will allow to plot the tracks. If you do not have access to MATLAB, you can use the inbuild plotting functions of TrackMate or other programing languages (e.g., R or Python) to plot the track of the particles.\nPlace all provided MATLAB codes and files in the folders that experimenters want to analyze.\nNote: The MATLAB codes and raw recording files can be located in different folders.\nOpen the “masterfile_PlotParticlesTracks” file using the MATLAB software and find the folders at the “Current Folder” tab. Then, add both folders containing the codes and recordings to the Path.\nNote: To add the folders to the Path, right click the folders at the “Current Folder” tab and choose “Add to Path” > “Selected Folders and Subfolders”. This will change the gray lettered name of folder to black lettered the name of folder.",
    "Note: The file “masterfile_PlotParticleTracks” contains detailed instructions on how to proceed with the data analysis. Following the comments will be helpful for the analysis.\nTo import the track data, click “Run Section” at the “step1” of “masterfile_PlotParticleTracks” at the “Editor” tab (Figure 7[href=https://www.wicell.org#fig7]A1).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1827-Fig7.jpg\nFigure 7. Data plotting for CSF flow using a MATLAB script\n(A) The screenshots show partial parts of the MATLAB script. The numbers with red lines can be modified based on the experimental or analyzing conditions.\n(B) The figure files that are generated during analysis showing a subset of tracks (B1), all tracks that meet the experimenters’ thresholds with colors representing each track (B2) or the direction of movement (B3, direction is represented by the rose plot). Only the Figure 3 (B3) is saved.\nBefore click “Run Section”, put information of spatial resolution of data at the “data.spatres”. The resolution with our 10× objective is 1 pixel = 1.13 μm.\nConfirm that the “data” and “Tracks” files appear in the “Workspace” as well as the defined path and data at the “Command Window” after running.\nRun “step2” to recognize the traces of each particle in the image files and reorganize them in a new array “data.track”.\nRun “step3” to plot some tracks to make sure that there is no error (Figure 7[href=https://www.wicell.org#fig7]A2).\nThe “Figure 1” showing a few of tracks will pop up after running (Figure 7[href=https://www.wicell.org#fig7]B1). It will not be saved in the directory folder.\nRun “step4” to identify the good tracks based on some threshold values inputted by the experimenter (Figure 7[href=https://www.wicell.org#fig7]A3).\nThe values of “tracklength” and “trackdistance” at the script can be modified by the experimenters to fit their imaging settings.",
    "In our example, we have set a threshold of 40 datapoints of “tracklength” (corresponding to 0.8 s) and 20 pixels of “trackdistance” (corresponding to 22.6 μm). Hence, the code will identify tracks of the particles longer than 0.8 s and 22.6 μm.\nRun “step5” to plot the selected tracks (Figure 7[href=https://www.wicell.org#fig7]A4).\nThe “Figure 2” will open after running (Figure 7[href=https://www.wicell.org#fig7]B2). It will show each track with a different color. It will not be saved in the directory folder.\nRun “step6” to plot selected tracks color-coded based on the direction of the particle movement. It represents the angle of a particle from t=i to t=i+1.\nThis step will take time from a few seconds to minutes. The “Figure 3” will pop up after running (Figure 7[href=https://www.wicell.org#fig7]B3). It will be automatically saved as PNG file format and the name will be the data file name combined with “tracks”.\nRun “step7” to save the data."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Cell Biology",
    "Model Organisms",
    "Microscopy"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}