{
  "id": 4173,
  "origin_website": "Cell",
  "title": "Isolation and analysis of fractions enriched in WrappER-associated mitochondria from mouse liver",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse liver WAM-enriched fraction preparation\nTiming: 3 h\nThe following protocol describes the steps required to obtain WAM-enriched fractions from a mouse liver weighing between 1.0 and 1.4 grams.\nNote: In our experience, this protocol allows the simultaneous processing of up to 3 livers, but no more.\nCritical: Do not clean glassware with detergents. Always thoroughly rinse all glassware with ddH2O before and after using them.\nPrepare all the buffers and cool down the centrifuge to 4°C.\nNote: Use a fixed angle rotor type F34-6-38 for Eppendorf centrifuge 5800 (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/935-Fig2.jpg\nFigure 2. Some of the equipment needed to isolate WAM-enriched mouse liver fractions\n(A) Beaker containing mouse chopped liver in ice-cold B10 buffer.\n(B) Motorized tissue homogenizer.\n(C) Fixed angle rotor type F34-6-38 for Eppendorf centrifuge 5800 equipped with adapters for 50 mL Falcon tubes.\n(D) 1 mL and 2 mL plastic transfer pipettes.\nTo prepare B10PIC, transfer 11 mL of B10 to a 15mL-Falcon tube, then add 110 μL of protease inhibitor cocktail (PIC).\nCritical: Do not use a protease inhibitor cocktail containing EDTA, as chelating Mg++ interferes with retaining ribosomes attached to the ER membrane.\nTransfer 15 mL of B10 to a 50 mL-glass beaker. Keep it on ice.\nEuthanize the mouse, then incise the abdomen with surgical scissors to expose the liver. Excide the liver, discard the gallbladder, and transfer it to the 50 mL-glass beaker prepared in step 3.\nUse clean surgical scissors to cut the liver into small pieces (Figure 2[href=https://www.wicell.org#fig2]B), then rinse three times with 15 mL of B10 to remove the blood.\nNote: Let the small liver pieces decant, then remove most of the buffer by gently tilting the beaker. Use a P1000 pipette to remove the last few mL of B10.",
    "Add 4 mL of B10PIC to the chopped, rinsed liver and transfer it into the modified 5 mL Teflon Potter by tilting the beaker.\nNote: Use surgical scissors or a wooden spatula to assist in the transfer of the small liver pieces.\nNote: Do not fill the potter past the fill line. Depending on the size of the liver, it may be necessary to remove excess buffer with a P1000 before proceeding to the next step.\nPlace the modified glass potter with the chopped liver inside a 50 mL Falcon tube containing ice.\nNote: Keep the glass potter cold during liver homogenization.\nUse an electric homogenizer (Figure 2[href=https://www.wicell.org#fig2]C) to homogenize the liver by stroking up and down the potter.\nSet the homogenizer speed to 1,600 rpm, then perform 16 strokes: 8 ups and 8 downs, 2 s per stroke; then pause for 30 s.\nRepeat step 8a.\nTransfer the liver homogenate by tilting the glass potter into a 15 mL Falcon tube.\nRinse the potter with the remaining 7 mL of cold B10PIC and add them to the liver homogenate. Mix gently by inverting the tube a few times and pour the homogenate into two 30 mL glass centrifuge tubes.\nSpin at 400 × g for 10 min at 4°C to remove nuclei and tissue debris.\nNote: Use a fixed angle rotor type F34-6-38 for Eppendorf centrifuge 5800 (Figure 2[href=https://www.wicell.org#fig2]A).\nCollect the supernatant (∼5 mL per tube) and transfer it to a clean 30 mL glass centrifuge tube.\nCritical: Stay away from the pellet: it contains unbroken cells and nuclei that would contaminate the WAM-enriched fraction.\nNote: Use a P1000 pipette tip, cut ∼2 mm from the end to enlarge the opening.\nRepeat steps 12 and 13.",
    "Repeat step 12 one more time, collect the two supernatants and gently mix them into a 15 mL Falcon tube (the final volume should be ∼ 7.5 mL).\nCritical: Stay well away from the pellet.\nNote: Use a P1000 pipette tip, cut ∼2 mm from the end to enlarge the opening.\nNote: This is what, from here on, we call post-nuclear hepatic homogenate. You can set aside up to 500 μL and use it as a control in assays concurrent with biochemical validation of the WAM-enriched fraction.\nPour 7 mL of B27 (maintained at 20°C) into a 50 mL Falcon tube and carefully lay on top of it 7 mL of post-nuclear hepatic homogenate.\nNote: Use a P1000 pipette tip, cut ∼2 mm from the end to enlarge the opening.\nSpin at 2,000 × g for 20 min at 4°C.\nNote: Use a fixed angle rotor type F34-6-38 for Eppendorf centrifuge 5800 (Figure 2[href=https://www.wicell.org#fig2]A).\nCollect the top 5 mL of the supernatant and use it to prepare the control ER-enriched fraction (see below “complementary protocol: preparation of ER-enriched fraction[href=https://www.wicell.org#sec3.2]”).\nThoroughly remove the supernatant using a disposable glass Pasteur pipette connected to the vacuum line. The pellet is the WAM-enriched fraction (Figures 3[href=https://www.wicell.org#fig3]A and 3B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/935-Fig3.jpg\nFigure 3. Schematic representation of the procedure used to prepare wrappER-mitochondria (WAM)-enriched fractions\n(A) 7 mL of B27 are added into a 50 mL Falcon tube, on top of which 7 mL of post-nuclear liver homogenate are gently layered. The solution is centrifugated in a fixed rotor. The pellet is enriched in WAM.\n(B) An image of the pellet enriched in WAM. Note that its appearance depends on the nutritional status of the mouse liver from which it was prepared.\nFor omics analysis, resuspend the pellet in 500 μL B10PIC and store at −80°C.",
    "For Electron Microscopy (EM) analysis, gently add 500 μL of B27PIC on top of the pellet. Using a paintbrush, gently detach it from the side of the tube; then, follow “Complementary Protocol: EM Analysis of WAM-Enriched Fractions”.\nCritical: Step 19b goal is to obtain a flaky pellet, limiting its resuspension in the buffer.\nComplementary protocol: Preparation of ER-enriched fraction\nTiming: 1 h\nThe following procedure describes how to obtain ER-enriched fractions from WAM-depleted liver homogenates. They can be used per se or as a control to the proteomic/functional analysis of the WAM-enriched fractions. This protocol has been modified from (Hamilton et al., 1999[href=https://www.wicell.org#bib2]).\nStarting from step 18, aliquot the supernatant into two 2 mL Eppendorf tubes.\nNote: When collecting the supernatant in step 18, stay away from the fat layer that accumulates at the top and along the wall of the 50 mL Falcon tube.\nSpin at 12,000 × g for 10 min at 4°C to remove heavy organelles; collect the supernatants with a P1000 pipette tip and transfer them into two clean 2 mL Eppendorf tubes.\nCritical: Stay away from the pellet: it contains heavy organelles such as peroxisomes, lysosomes, mitochondria that would contaminate the ER-enriched fraction.\nRepeat step 21.\nCollect 1.5 mL of supernatant from each tube and gently mix them into a 50 mL Falcon tube. Gently add 22.5 mL of ice-cold CaCl2 8 mM solution.\nIncubate for 15 min at 4°C, with gentle rocking.\nPour gently into two 30 mL glass tubes (12 mL/tube), then spin at 8,000 × g for 10 min at 4°C.\nNote: Use a fixed angle rotor type F34-6-38 for Eppendorf centrifuge 5800.\nDiscard the supernatants; the pellet is the ER-enriched fraction.\nFor omics analysis, resuspend the pellet in 500 μL B10PIC and store at −80°C.",
    "For Electron Microscopy (EM) analysis, gently add 500 μL of B27PIC on top of the pellet. Using a paintbrush, gently detach it from the side of the tube; then, follow “Complementary Protocol: EM Analysis of WAM-Enriched Fractions”.\nCritical: Step 26b goal is to obtain a flaky pellet, limiting its resuspension in the buffer.\nNote: Proteomic analysis of this fraction should indicate that ∼40% of the proteins are ER proteins (Figure 4[href=https://www.wicell.org#fig4]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/935-Fig4.jpg\nFigure 4. Analysis of mouse liver WAM-enriched fractions\n(A–D) The pellet shown in Figure 3[href=https://www.wicell.org#fig3]B is analyzed by EM (A), immunoblot (B and D), and proteomic studies (C). Adapted from (Anastasia et al., 2021[href=https://www.wicell.org#bib1]).\n(E) EM analysis of the control mouse liver ER-enriched fractions.\nComplementary protocol: EM analysis of WAM-enriched fractions\nTiming: 3 days\nHere we describe how to fix and embed WAM- and ER-enriched fractions for EM analysis, a reliable method for verifying their quality.\nTransfer the flaky pellet (step 19b or 26b) into a 2 mL Eppendorf tube and add 500 μL of B27PIC.\nCritical: Use a tube with a round, not conical, bottom.\nCritical: Use a P200 pipette tip, cut ∼5 mm from the end to enlarge the opening, and avoid resuspending the pellet. The pellet must remain visibly flaky.\nSpin at 3,000 × g for 10 min at 4°C. Remove and discard the supernatant.\nGently add to the pellet 500 μL of B27 solution supplemented with 2% glutaraldehyde (freshly prepared), and incubate overnight (16 h) at 4°C.\nCritical: from this point on, the pellet must remain intact, possibly sticking against the wall of the Eppendorf tube. Through all the next steps, pay attention to always be gentle when adding and removing all various solutions; to this end, we recommend using plastic transfer pipettes (Figure 2[href=https://www.wicell.org#fig2]D).",
    "Note: Glutaraldehyde is highly toxic: work under a chemical hood.\nRemove the glutaraldehyde solution with a plastic transfer pipette, paying attention to leave the pellet undisturbed\nRinse the pellet three times to eliminate any residual glutaraldehyde. To this end, gently apply onto the wall of the Eppendorf tube 700 μL of B27 solution (use a P1000 pipette).\nIncubate the pellet in a solution of 1% (w/v) osmium tetroxide in ddH2O for 30 min at 20°C, keeping the Eppendorf tube protected from light by wrapping it in aluminum foil.\nNote: Osmium tetroxide is highly toxic: operate under a chemical hood.\nDuring the incubation (step 32), reconstitute the Durcupan epoxy resin:\nIn a 50 mL plastic beaker placed on a scale, add 5 g of Durcupan component A, 5 g of Durcupan component B, 0.15 g of Durcupan component C, and 0.15 g of Durcupan component D.\nNote: Durcupan components are dense liquids: use plastic pipettes (Figure 2[href=https://www.wicell.org#fig2]D).\nStir well with a wooden spatula until the resin changes color and becomes orange.\nNote: The reconstituted Durcupan epoxy resin is now ready to be used but it can be stored for up to 2 weeks at −20°C.\nRinse the pellet (step 32) three times to eliminate any residual osmium tetroxide. To this end, gently apply onto the wall of the Eppendorf tube 700 μL of ddH2O (use a P1000 pipette).\nPellet dehydration:\nNote: Use plastic transfer pipettes (Figure 2[href=https://www.wicell.org#fig2]D) to add/remove the solutions used in this step.\nAdd 1 mL of 50% ethanol:water and incubate for 15 min. Discard ethanol solution.\nAdd 1 mL of 1% uranyl acetate in 70% ethanol:water and incubate for 40 min keeping the Eppendorf tube protected from light by wrapping it with aluminum foil. Remove and discard the uranyl acetate solution.",
    "Add 1 mL of 90% ethanol:water and incubate for 15 min. Discard ethanol solution.\nAdd 1 mL of 100% ethanol and incubate for 15 min. Discard ethanol solution.\nRepeat step 35d.\nAdd 1 mL of 100% propylene oxide to the pellet and incubate for 15 min. Discard propylene oxide.\nRepeat step 35f.\nCritical: Work rapidly as propylene oxide evaporates quickly at 20°C. The sample must not dry out when changing the solutions; perform all steps at 20°C.\nNote: Propylene oxide is highly toxic: operate under a chemical hood.\nEmbed the pellet in the Durcupan epoxy resin:\nNote: Step 36b-d: leave the cap of the Eppendorf tube open.\nRemove and discard the 100% propylene oxide and quickly embed the pellet in ∼500 μL of reconstituted Durcupan epoxy resin.\nNote: From this stage, the sample can be handled on the lab bench.\nIncubate for 1 h at 37°C.\nRemove as much epoxy resin as possible, leaving the pellet undisturbed and, ideally, attached to the side of the Eppendorf tube. Add 500 μL epoxy resin and move the sample in an oven at 58°C.\nIncubate 48–72 h, to polymerize the reconstituted Durcupan epoxy resin.\nRelease the hardened epoxy resin block that contains the sample to analyze by EM; this can be done by cutting the 2 mL Eppendorf tube with a sharp blade or scissors.\nCut the epoxy resin-embedded sample in ∼50 nm -thick slices using a Leica Ultramicrotome and place them on single-slot formvar coated copper grids (up to 5 slices/grid).\nCounterstain slices by incubating the grid for 5 min with Reynold’s lead citrate.\nThe WAM and ER-enriched fractions can be now imaged under a transmission electron microscope (Figures 4[href=https://www.wicell.org#fig4]A and 4E)."
  ],
  "subjectAreas": [
    "Metabolism",
    "Cell Biology",
    "Cell Separation/Fractionation",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}