{
  "id": 12056,
  "origin_website": "Jove",
  "title": "Murine Model of Metastatic Liver Tumors in the Setting of Ischemia Reperfusion Injury",
  "procedures": [
    "All animal protocols are approved by the Institutional Animal Care and Use Committee and adhered to the National Institutes of Health (NIH) Guidelines. Instruments used for any surgical procedure were thoroughly sterilized.\n1. Initial preparation\nBefore injecting cancer cells into the mouse spleen, autoclave and sterilize all instruments to be used during the procedure.\nSterilize and/or autoclave a heating pad, surgical gloves, gauze, pairs of scissors, small clamps, vessel dilator, surgical forceps, and a needle holder.\nPrepare post-operative analgesic (0.1 mg/kg of buprenorphine) to be administered after splenectomy and every 12 h for 2 days.\n2. Cell culture\nEnsure that cancer cells are free from mycoplasma contamination by using a mycoplasma ELISA kit.\nPrepare a 500 mL solution of Dulbecco's Modified Eagle medium (DMEM) culturing medium at 4 °C for the culture of murine colorectal cancer cells (MC38). The culturing media should be supplemented with 10% heat-inactivated fetal bovine serum (FBS), 100 U/mL of penicillin, 100 µg/mL of streptomycin, 15 mM of HEPES and 200 mM of L-glutamine.\nCulture cancer cells in a DNAse- and RNAse-free flask (75 cm2). Incubate the cell culture in a cell/tissue humidified incubator containing 5% CO2. Maintain temperature at 37 °C.\nOnce the proliferating cells reach 90–100% confluency, aspirate the old media, wash cells with 1x phosphate-buffered saline (PBS) and then treat them with 1x trypsin (0.25%) to detach cells from the flask.\nCollect cells in a 15 mL conical tube and centrifuge for 5 min at 700 x g.\nAspirate the media and wash with 1x PBS twice by repeated centrifugation.\nProceed to confirm cell viability by staining cells with trypan blue stain (0.4%).\nResuspend cells to a concentration of 1 x 106 cells/ 100 µL in 1x PBS. Pipet cells thoroughly to avoid any clumps. Keep cancer cells on ice prior to injection.",
    "3. Injecting tumor cells\nAnesthetize 8–12-week-old male (C57BL6) mice by administering ketamine (150 mg/kg) and xylazine (12 mg/kg) intraperitoneally using a 1 mL 25 G (0.5 mm x 16 mm) needle.\nShave the abdominal skin of the mice using clippers to avoid any postoperative infections.\nPlace mice on the magnetic fixator retraction system. Confirm that the mice are completely under the effect of anesthesia by pinching a toe or the tail.\nAdd saline drops into the eyes to avoid dryness during the procedure.\nScrub povidone-iodine solution (7.5%) to the shaved abdominal wall to disinfect the skin before making a surgical incision.\nInitially lift the skin with the toothed forceps and make a midline incision with the help of surgical scissors. Then, lift the abdominal muscle and peritoneum to create a midline incision of approximately 3 cm length (midabdominal to xiphoid process to expose the abdominal contents. Take caution not to extend the incision beyond the xiphoid process to avoid extensive bleeding.\nPlace the hemostat at both sides of the incision and under the xiphoid process. Extend the abdomen by pulling the tail downward and taping it. Use the 6-inch sterile cotton tip applicator to separate and expose the spleen from the pancreatic fat tissue.\nBefore injection into the spleen, vortex the cancer cells to avoid any cell clumps.\nUse a 0.5 mL 28 G (0.36 mm x 13 mm) insulin syringe for injection. Avoid air bubbles.\nSlowly and carefully inject 100 µL of cells into the tip of the spleen. Place a cotton tip and add gentle pressure to avoid backflow into the abdominal region. A successful injection can be observed by identifying the change in the color of the liver during the injection.\nMoisten a sterile gauze with 1x PBS and place it over the dissected area.",
    "Transfer the mice onto a heating pad for 15 mins to allow cancer cells to circulate within the system.\nTo proceed with surgical ischemia and reperfusion injury, follow steps 5.3-5.10. \n\tNOTE: This procedure is to study the effect of I/R induced establishment of metastatic foci.\n4. Splenectomy\nTo perform a splenectomy, use a hand-held cautery device. Carefully lift the spleen with smooth forceps and cauterize the splenic blood vessels to avoid excessive bleeding. Remove spleen by transecting the vessels at the cauterized section.\nImmediately following the procedure, close the incision in a double layer pattern by first suturing the muscle layer and then the skin. Use 4-0 polypropylene sutures for both the abdominal wall and the skin.\nBefore repeating the procedure on another animal, disinfect all instruments by either spraying them with 70% isopropanol or inserting them into a bead bath.\nPlace mice back into original cages and look for signs of distress and post-surgical pain.\nInject post-operative analgesic (Buprenorphine 0.1 mg/kg) every 12 h for 2 days to avoid post-surgical pain.\n5. Ischemia reperfusion Injury\nAt 5 days after the first laparotomy, anesthetize mice by administering ketamine (150 mg/kg) and xylazine (12 mg/kg) intraperitoneally using a 1 mL 25 G (0.5 mm x 16 mm) needle. Follow steps 3.3–3.4.\nScrub povidone-iodine solution (7.5%) on the shaved abdomen of the mouse to disinfect the skin and perform a midline laparotomy as described above in step 3.6.\nUsing two moistened cotton tips, gently move the intestine from the cavity to expose the associated structures, including the portal vein. Dissect the liver hilum free of the surrounding tissue.",
    "Lift up the median and left lateral lobes against the diaphragm. Separate the quadrate lobe from the left lateral lobe by dissecting the liver hilum with the spring scissors using an operating microscope to allow clear visibility towards the portal triad structure.\nPlace a small moist cotton swab between the median lobe and right lateral lobe to create sufficient space for clamping. Using the vessel dilator forceps, carefully pass the 10 cm thread (4.0 polypropylene suture) to lift the portal triad. Occlude all structures in the portal triad (hepatic artery, portal vein, and bile duct) to the left and median liver lobes by placing a microvascular clamp using a micro-serrefine clamp applicator with lock.\nIf the lobes do not show significant blanching, readjust the clamp by removing and reapplying.\n\tNOTE: If the immediate blanching of the liver does not occur even after readjusting the clamp, carefully consider whether or not to proceed with the I/R.\nRemove the small cotton swab placed between the median and right lateral lobes. Gently replace the intestine into the abdominal cavity. Cover the abdominal wall with a moist gauze (soaked with 1x PBS) and cover with a plastic wrap to minimize evaporative loss.\nPlace the mouse on the heating pad and apply the clamp for a period of 60 min.\nThroughout the ischemic interval, seek evidence of ischemia injury by visualizing the pale blanching of the right medial and left medial and lateral lobes.\nInitiate reperfusion by removing the clamps after the 60 min period.\n\tNOTE: Evidence of reperfusion can be observed by an immediate color change of the median and left lateral lobes.",
    "Immediately following reperfusion, close the incision with a double layer suture pattern by first suturing the muscle layer and then the skin. Use the 4-0 polypropylene suture with the help of a needle holder to close the abdominal wall and the skin.\nBefore repeating the procedure on another animal, disinfect all instruments by either spraying them with 70% isopropanol or inserting them into a heated bead bath.\nPlace mice back into original cages and look for signs of distress and post-surgical pain.\nInject post-operative analgesic (0.1 mg/kg of buprenorphine) every 12 h for 2 days to avoid post-surgical pain.\nFor liver I/R sham mice, perform laparotomy, hilum dissection and abdominal sutures.\nNOTE: The role of surgical stress influencing the establishment of liver metastases can be investigated through two different experimental designs. The above protocol (Model-1) is used to establish micrometastatic liver disease and study the effect of liver I/R on their growth (Figure 1A). Alternatively, liver I/R and tumor injection can be performed concurrently (Model-2) to study the effect of I/R injury in the establishment of new metastatic foci (Figure 1B). To do this, inject cancer cells into the spleen as described above and allow them to circulate for 15 min. Perform liver I/R or sham surgery after the circulating period for 60 min. Perform lateral splenectomy 60 min later, and then close the laparotomy incision.\n6. Assessment of operated mice\nDuring the surgical procedure ensure that the mice are under the influence of stage III anesthesia by performing palpebral and corneal reflex test. Additional anesthetic dose must be given upon the signs of reflexes.\nProvide post-operative analgesic (Buprenorphine 0.1mg/kg) right after the surgery and every 12h for 2 days to avoid post surgical pain.",
    "Allow mice 30–60 min of recovery time from anesthesia. Constantly monitor mice and do not leave them unattended until complete recovery.\nLook for distress signs such as hunched back, closed eyes, slow movement, and failure to groom. Treat accordingly until mice return to their normal activity.\nSupplimental care including fluids, heat, Yohimbine reversal agent for xylazine, soft paper towel bedding (to avoid aspiration) should be provided after the surgery to improve the recovery period.\n7. Assessment of liver ischemia reperfusion injury\nImmediately after applying the clamp, make sure the pale blanching of the median and left lateral lobes occurs compared to the caudate and quadrate lobes.\nAssess liver ischemia injury by measuring serum alanine transaminase (sALT), serum aspartate transaminase (sAST) and serum lactate dehydrogenase (sLDH) levels. The blood can be drawn from the facial vein to extract serum 3–6 h after the initiation of reperfusion. Perform liver histology to analyze the percent tumor area within the ischemic lobe.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}