{
  "id": 11324,
  "origin_website": "Jove",
  "title": "Contrast Ultrasound Targeted Treatment of Gliomas in Mice via Drug-Bearing Nanoparticle Delivery and Microvascular Ablation",
  "procedures": [
    "1. Microbubble Production\nTo prepare albumin microbubbles ( MBs), place a 1% solution of serum albumin in normal saline in a flask with a blanket of gas (octafluoropropane) above the aqueous phase. Briefly sonicate the solution (30 sec) with an ultrasound disintegrator equipped with an extended ½\" titanium probe.  This formulation is similar to Optison (GE Heathcare), which is provided in a concentration range of 0.5- 1.2 x 109 MBs/ml.  Determine mean MB diameter with a Multisizer Coulter Counter.  The albumin mean MB diameter used in this study was 1.93um ±1.63um.\nTo fabricate lipid MBs, prepare an aqueous dispersion of 1 mg/ml polyethyleneglycol-40 stearate (Sigma Chemical Co., St. Louis, MO) and 2 mg/ml distearoyl phosphatidylcholine (Avanti Polar Lipids, Alabaster, AL) and sonciate as previously described (1.1) with decafluorobutane gas. Determine mean MB diameter with a Multisizer Coulter Counter.  The mean lipid MB diameter used in this study was 2.01um ±1.29um.\n2. Nanoparticle Fabrication\nThese methods were adapted from the water-in-oil-in-water emulsion solvent evaporation technique described by Davda (2002) and Chappell (2008).\nPrepare a 2% Poly(vinyl alcohol) PVA solution by dissolving 20g of PVA in 1000 ml of deionized (DI) water. Allow solution to fully dissolve on a stir plate overnight.  Centrifuge solution at 1000 rpm for 10 minutes and filter with a 0.22μm sterile filter to remove any residual undissolved PVA.\nTo fabricate bovine serum albumin (BSA) loaded poly(lactic-co-glycolic acid) (PLAGA) nanoparticles (NPs),  dissolve 180mg of uncapped 85:15 PLAGA in 6ml methylene chloride (MC) in a glass scintillation vial. Vortex the MC/PLAGA solution for 2 minutes.\nDissolve desired payload (15mg of BSA) in 1.5 ml of PBS. Add the PBS/BSA solution in two parts to the PLAGA/MC solution with intermittent vortexing. Place solution on ice for 5minutes and sonicate at 45W for 120 seconds.",
    "Add the MC/PLAGA/payload/PBS solution to 24ml of 2% PVA, in two portions with intermediate vortexing. \nPlacing the solution on ice for 5minutes and sonicate at 45W for 120.\nStir the NP emulsion for 12 hours on a stir plate in a fume hood to allow evaporation of MC and NP stabilization.  \nCentrifuge the suspension for 25minutes at 20,000 rpm at 4°C twice to isolate NPs and remove residual PVA. Resuspend the pellet in 8ml of DI water and centrifuge for 10 minutes at 1000 rmp at 4°C to isolate the 100nm population of NPs.\nIsolate the supernatant and flash freeze it at -80° C. Lyophilize the frozen sample for 48 hrs. Store the lyophilized particles in a dessicator at -80° C until time of use.\n3. Composite Delivery Vehicle Fabrication (Protocol Adapted from VisEn Chemistry Notes)\nConversion of  VivoTag680 to carboxy surface functionality\n\t\nCombine one vial of VivoTag680 with 50 μL of 1.0 M HEPES, pH 7 and Succinic anhydride (2.5 mg, 25 ìmol) in 25 μL DMSO.  Add 50 μL of 1.0 M NaOH to this solution, mixed thoroughly; allow solution to react for 2 hours at room temperature protected from light. Purify particles using Bio-Rad BioGel (P100, medium) eluting with 0.1 M MES buffer, pH 6.0. Collect the green band.\nActivation of carboxy-modified VivoTag680 \n\t\nCombine carboxy-modified VivoTag680 obtained in 0.1 M MES buffer, pH 6, with 1 mg of 1-Ethyl-3-(3-dimethylaminopropyl)-carbodiimide (EDC) and 2.2 mg of N-hydroxysulfosuccinimide (Sulfo-NHS). Allow to react for 2 h at room temperature.",
    "Purify activated particles from excess activating agent (EDC) by gel filtration using Bio-Rad BioGel (P100, medium) eluting with 0.1 M MES buffer, pH 6.0 and collect the green band. Immediately conjugate the activated particles to amine-containing molecules (e.g. BSA-loaded Nanoparticle). Allow the solution to react for 2 hours at room temperature. Amine conjugated NPs were purified from excess EDC by centrifuging at 20,000 rpm for 60min at 4 °C, pouring off the supernatant after centrifugation and resuspending in 0.1 MES buffer.\nStop here to fabricate VivoTag680 tagged NPs for drug delivery studies.\nConjugation of carboxy-modified PLGA-BSA-VivoTag680 Nanoparticles (NP680) to Albumin Microbubbles \n\t\nCombine NP680  obtained in 0.1 M MES buffer, pH 6 with 1 mg of 1-Ethyl-3-(3 dimethylaminopropyl)-carbodiimide (EDC) and 2.2 mg of N-hydroxy-sulfosuccinimide (Sulfo-NHS). Allow the solution to react for 1 hour at room temperature.\nPurify activated nanoparticles from excess EDC by centrifuging at 20,000 rpm for 60min at 4 °C, pouring off the supernatant after centrifugation. Resuspend nanoparticles in 0.1 MES buffer.\nWash albumin MBs three times in degassed PBS to remove excess BSA from solution.\nImmediately conjugate the activated particles to amine-containing molecules (e.g. Albumin Microbubbles).  Allow NP680 solution to react for 2 hour at room temperature. Purify NP680 conjugated microbubbles (MNCA) from unbound NP680s by washing three times with degassed PBS.\nDetermine the concentration of MNCAs using a Coulter Counter.\n4 .Tumor Model\nAll animal experiments were in compliance with an animal protocol approved by the University of Virginia Animal Care and Use Committee.\nC6 Giloma rat tumor cell line was provided by Dr. Jason Sheehan of UVA (Charlottesville, VA). \n     \nCells line was tested to ensure cells were mycoplasma free.",
    "Maintain the cell line in F-12K Nutrient Mixture supplemented with 16% horse serum, 3% fetal bovine serum (FBS) and 1% Pen-Strep, (Gibco, USA) at 37°C and 5% CO2.\nInoculate C57BLJ6/Rag1 mice (Jackson) with 3 x 106 C6 Giloma tumor cells suspended in 300 μl of PBS subcutaneously in the left hindlimb. Allow tumor to grow for 12 days to reach a maximum diameter of 8-10mm.\n5. In Vivo Ultrasound Application\nAnesthetize mice with an intraperitoneal (IP) combination injection of ketamine hydrochloride (60 mg/kg body weight) and  xylazine (0.1 mg/kg body weight) prior to treatment.\nPrepare a maintenance anesthetic of  ketamine hydrochloride (20 mg/kg body weight) and xylazine (0.3 mg/kg body weight). Administer as needed.\nCannulate the tail vein of each animal for the intravenous (I.V.) administration of a MB, MB/NP or MNCA solution.\nTumor perfusion measurements\n\t\nI.V. infuse a lipid MB solution (1x108 MBs/g body weight in 0.3 ml of 0.9% saline) at a rate of 15μl/min with a continuous infusion pump (Harvard Apparatus PHD 2000; Harvard Apparatus, Holliston, MA).\nAn Acuson Sequoia 512 ultrasonography system (Siemens Medical Solutions, Mountain View, CA) equipped with an 8 13 MHz linear 15L8 probe was used in this study to quantify contrast enhanced tumor perfusion.  Couple the 15L8 probe to the tumor with a water-based ultrasound gel (Parker Laboratories Aquasonic 100; Parker Laboratories, Inc., Fairfield, NJ). Scan the tumor in B-Mode to obtain the best imaging plane.\nIn contrast pulse sequence (CPS) mode, acquire a continuous video capturing microbubbles signal intensity 5 seconds prior, and 20 following, the high-amplitude \"burst\" pulse at a frame rate of 13Hz.  Repeat measurements in four imaging planes.\nWait ten minutes to infuse albumin MBs and initiate therapeutic low frequency treatment to allow lipid MBs to clear from the circulation.\nTherapeutic Ultrasound Treatment",
    "Ten minutes following tumor perfusion measurements (5.3) couple a 0.75'' diameter 1 MHz unfocused transducer (A314S; Panametrics, Waltham, MA) to the skin above the flank tumor.  I.V. infuse an albumin MB (1 x105 MBs/g body weight in 0.3 ml of 0.9% saline), MB/NP  (1 x105 MBs/g and 0.2 ug NPs/g body weight in 0.3 ml of 0.9% saline) or MNCA solution (1 x105 MNCAs/g body weight in 0.3 ml of 0.9% saline).\nDrug Delivery Treatment\n\t\t\nInsonate for sixty minutes with the \"1-Burst\" pulse sequence  (5.4.2.2) during  a continuous infusion of NPs, a co-injection of MBs and NPs, or MNCAs (5.4.1).\nThe \"1-Burst\" pulsing sequence consists of 100 consecutive 1 MHz sinusoids (duty cycle= 0.00002) each of 1V peak to- peak amplitude from a waveform generator (AFG-310; Tektronix, Inc., Beaverton, OR). Amplify the waveform signal by a 55 dB RF with a power amplifier (ENI 3100LA; Electronic Navigation Industries, Richardson, TX).\nAblative Treatment\n\t\t\nIdentical to 5.4.2.1, however insonate with the \"5-Burst-Medium\" or \"5-Burst - Extended\" pulsing sequence\nThe \"5-Burst-Medium\" pulsing sequence consists of 5000 1 MHz sinusoids (duty cycle= 0.005) each of 1V peak to- peak amplitude . The \"5-Burst-Exteneded\" pulsing sequence consists of 10000 1 MHz sinusoids (duty cycle= 0.01) each of 1V peak to- peak amplitude.\nDuring the time course of the experiment monitor tumor temperature by inserting a needle thermocouple probe (Omega T-type, HYP1-30-1/2-T-G-60-SMPW-M) 2cm into the tumor. Record temperature measurements every five minutes.\nRepeat tumor perfusion measurements as described in 5.3 ten minutes following therapeutic treatment.\n6. Tumor Perfusion Quantification",
    "Using the CPS program on the Sequoia, enter ACQ mode.  Select the region of interest encompassing the complete tumor volume.  Perfusion recovery curves will be generated of the form y = A (1 - e -βt) + C (Sadlowski 2002; Chromas 2001; Yeh 2004) that are fit to the CPS data.  Evaluate β, a relative measure of red blood cell velocity, pre-treatment and post-treatment.\nExport CPS files for off-line analysis. Convert data into avi files.  Break avi files into frame-by-frame image sequences.  Using Compaq Visual Fortan, or a similar software package, generate a time averaged image of all frames from the destructive pulse to 8 seconds following the destructive pulse.  \nTo determine perfused tumor area, using ImageJ software, apply a threshold of 247 to the 8-bite time averaged CPS image and quantify the percent enhanced pixels within the tumor volume. Overlay the corresponding B-mode image with the time averaged thresholded image to accurately define tumor area.\nAverage the percent perfused area for a minimum of four CPS clips to obtain a final perfused area at a given time point for a particular tumor. \nTake the product of percent perfused area (6.4) and β (.1) to determine relative tumor blood flow.\n7. Nanoparticle Biodistribution in Tumor\nTwelve days prior to treatment with fluorescently labeled NPs place mice on a low alfasprot diet (Harlan, Indianapolis IN) to reduce autofluorescence caused by normal mouse chow when imaging.\nShave the imaging site (flank to liver) to remove all hair.\nRemove residual hair with a chemical hair removal agent, such as Nair.\nRinse of all residual chemical hair remover or a chemical burn may occur.\nImage mice on the FMT system (VisEn Medical) before treatment and 0, 1, 4, and 24 hours after treatment as described in 5.4.2.",
    "Prior to imaging anesthetize mice with an IP combination injection of ketamine hydrochloride (60 mg/kg body weight) and  xylazine (0.1 mg/kg body weight).  Place mouse on the imaging cartridge. Acquire reflectance images in white light and fluorescent modes. Carry out fluorescent tomographic imaging in the VT680 channel.\nEmploy the FMT software to generate 3D reconstructions of the imaging data utilizing a normalized Born equation. Following the reconstruction, select volumes of interest (VOI's) by drawing a region of interest (ROI's) in all 3 imaging planes (X, Y, Z). A mean fluorescent value and total VOI volume and fluorochrome concentration, due to fluorescently tagged BSA NPs, will be generated for VOI's encompassing the feet and liver.\n8. Tumor Growth Rate\nEvaluate tumor volume by taking daily measurements using digital calibers. Calculate tumor volumes using an ellipsoid approximation; V= 1/6 π abc.  Where a, b, and c are the maximum diameters of the tumor measured in three orthogonal planes.\n9. Tumor Processing and Analysis\nSeven days following treatment euthanize animals. Cannulate the left ventricle and exsanguinate blood with 10ml of 2% Heparinized Tris CaCl2 Buffer (.68mM) perfusion, followed by 10ml Tris CaCl2 Buffer (.68mM), each for 10 minutes at 100 mmHg.\nPerfusion-fix tissue with an infusion of 4% paraformaldehyde in PBS (4°C) for 10minutes at 100 mmHg.  Allow sample to fix for 60 minutes. \nExcise specimens, embed in paraffin, and cut into 5-micron sections. \nPerform standard hematoxylin-eosin staining to evaluate histological changes that may have occurred as a result of the ultrasound exposures. \nTo detect apoptotic cells, use a terminal deoxynucleotidyl transferase mediated deoxyuridine triphosphate nick end labeling (TUNEL) assay (ApoptTag kit, Intergen Co., Norcross, GA, USA).\n10. Representative Results\n1. Nanoparticle Fabrication (2.0)",
    "If this protocol is preformed properly NPs will be spherical in shape, as determined by scanning electron microcopy (SEM), and have a Gaussian distribution around 100nm, as determined by light scattering techniques. Representative results are shown in Figure 1.\n2. Targeted Drug Delivery (5.4.1)\nBased on published studies performed in our laboratory (Song 2002, Chappell 2008)  and unpublished results present in Figure 2, ultrasonic microbubble destruction results in enhanced delivery of intravascular nanoparticles to tumor tissue.  We have also shown that our MNCA delivery technique results in heightened nanoparticle delivery immediately following treatment.\n3. Tumor Ablation (5.4.3)\nWe have shown that prolonged ultrasonic microbubble destruction, at relatively low duty cycles (0.005-0.01), results in mechanical ablation of the tumor microvasculature and regression of tumor growth. If this protocol is performed properly one should expect changes in (i) rate of tumor growth (Figure 3); (ii) tumor hemodynamics (Figure 4) ; (iii) necrotic area ; and (iv) apoptosis .\nimgsrc://cloudfront.jove.com/files/ftp_upload/2145/2145fig1.jpgFigure 1. Characterization of PLAGA nanoparticles bearing BSA. (A) SEM image of properly fabricated nanoparticles. (B) SEM image of improperly fabricated nanoparticles.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2145/2145fig2.jpgFigure 2. (A) Fluorescence-mediated tomography (FMT) images of ultrasound treated (top) and control treated (bottom) subcutaneous gliomas immediately following treatment with a MNCAs, where nanoparticles (NPs) are bearing 680 fluorescence signals are superimposed on grayscale planar excitation light image.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2145/2145fig3.jpgFigure 3.  Representative fold change in tumor growth following microbubble insonation with the five-burst extended pulsing protocol.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2145/2145fig4.jpgFigure 4. B-Mode (A,C) and contrast-enhanced ultrasonography  (B,D)  images of a subcutaneous C6 glioma tumor in a mouse.  In the initial pretreatment image (A) the boundary of mostly hypoechoic tumor has been traced in blue. Time average enhancement after intravenous injection of a contrast agent is shown in (B) pretreatment. Posttreatment, before contrast injection, tumor is again mostly hypoechoic (D). After contrast injection, there is significantly less enhancement in the tumor.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}