{
  "id": 11059,
  "origin_website": "Jove",
  "title": "Stretching Micropatterned Cells on a PDMS Membrane",
  "procedures": [
    "1. Passivation of the PDMS\nCut a piece of PDMS approximately 35 mm x 20 mm from a pre made sheet (for instance, GelPak, as listed in the table of materials).\nRemove the top and the bottom protective layers of plastic (if necessary) and use tweezers to place the PDMS in a plastic (not cell culture treated) Petri dish.\nWash the PDMS with 70% ethanol for 5 min on a rotator at 30 oscillations/min.\nDry the surface by flowing air on it.\nIlluminate with deep UV (λ = 180 nm) for 5 min at a distance from the UV bulbs of about 5 cm (see Materials sheet for lamp reference; parameters will vary for different lamps).\nPrepare 200 µl of EDC/NHS solution for each PDMS piece (this must be prepared just before use because the reactivity of the solution decays in a matter of hr). For 1 ml of 0.05 M MES + 0.5 M NaCl buffer at pH 6.0, add 11.5 mg of Sulfo-NHS and 19.2 mg of EDC.\nTransfer the PDMS sheets from the Petri dish to the lid of the Petri dish, which has not been illuminated. This will ensure that the surroundings of the PDMS are very hydrophobic and facilitate the next step.\nAdd EDC/NHS solution and incubate for 15 min at room temperature.\nRinse EDC/NHS with water.\nAdd PLL-g-PEG solution (0.5 mg/ml in HEPES 10 mM pH 8.6) and incubate from 3 hr to overnight at room temperature.\nRinse the PLL-g-PEG with water. Passivated PDMS (functionalized with PLL-g-PEG) can be stored for several days at 4 °C.\n2. Patterning of the PDMS",
    "Take a PDMS sheet and place it on a synthetic quartz photomask bearing the microfeatures for patterning (see Figure 1). Place the PDMS side bearing the PLL-g-PEG facing the chrome side of the photomask.\nIlluminate for 7 min through the photomask at a distance from the UV bulbs of about 5 cm.\nAdd water onto the mask + PDMS and peel the PDMS slowly off the mask.\nIncubate with fibronectin solution at 50 mg/ml in HEPES buffer at pH 8.6 for 1 hr at room temperature. It is possible to use others ECM proteins, but these have not been tested with this protocol.\nRinse with PBS.\n3. Mounting the Device\nMount the previously passivated PDMS onto the stretching device (see Discussion for troubleshooting).\n\t\nAttach one side of the PDMS to the fixed part of the stretcher.\nFix the other side to the mobile part of the stretcher without clamping too much of the PDMS sheet.\nCut a rectangle of PDMS (22 mm x 19 mm) in a thick PDMS stab and cut another rectangle inside in order to have a pool (or frame) that will retain the cells and media (see Figure 2).\nAdd silicone grease under this PDMS pool and place it on top of the PDMS sheet to create a medium retaining pool. The grease will allow the gliding of the pool over the PDMS sheet during stretching.\n4. Patterning the Cells\nDetach the cells from a 50% confluency culture flask with Versene.\nCount the cells and resuspend them at a concentration of 200,000 cells/ml.\nAdd 1 ml of cell suspension in the pool (see Discussion for additional details).\nLet the cells bind to the patterns for 10-30 min (depending on the cell type, RPE-1 cells will take 10 min and HeLa cells 20 min).",
    "Gently flush the floating cells with equilibrated medium (equilibrate medium in incubator).\nLet the cells spread for a few hr on the patterns (RPE-1 will need at least 2 hr; HeLa cells will need 3 hr).\nAdd a coverslip on top of the pool to avoid evaporation and medium leakage in case the PDMS breaks.\nPut the device on an inverted microscope and start imaging. Avoid the use of oil immersion objectives as it will not work due to focusing problems.\n5. Stretching\nTurn the micrometric screw while correcting the stage position in the x-, y-, and z-axis (mainly x). The stage position needs to be corrected to counteract the widening of the PDMS and the loss of focus. (See \"During the stretch\" paragraph in the DISCUSSION).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}