{
  "id": 9481,
  "origin_website": "Jove",
  "title": "Optogenetic Stimulation of Escape Behavior in Drosophila melanogaster",
  "procedures": [
    "1. Generate Channelrhodopsin Flies\nCross UAS-ChR2 flies with the Gal4 driver of your choosing, we use G105-Gal4, which is expressed in Foma-1 neurons in the optic lobe.\nTo eliminate the possibility of a visual response to the blue light stimulation, both fly lines are in a w+norpA background.\nEnd result: w+norpA;G105-Gal4/UAS-ChR2 +\nAfter adult flies eclose, put selected females on fresh food, supplemented with 10 μM all-trans-retinal (a co-factor required for ChR2) and protected from light, for 3 days before performing the behavioral assay.\n2. Make 10 μM All-trans-retinal Enhanced Food\nDissolve 100 mg of all-trans-retinal in 17.6 ml of 95% ethanol to make 20 mM retinal. Keep all-trans-retinal protected from light at all times.\nMelt standard cornmeal fly food in microwave, and let cool until warm to touch.\nMix 50 μl of 20 mM all-trans-retinal into vials of 10 ml of fly food.\nLet vials cool and keep protected from light.\n3. Equipment\nPipet tips: Standard 1,000 μl pipet tips are cut near the tip, creating a pore diameter of ~2.25 mm.\nPlatform (see Figure 1).\n \nA Delrin base, 17 cm X 25 cm, was constructed with threaded holes at each corner to fit ¼\" NPT coolant hose connectors.\nA vertical holder, made from Delrin, is attached to the center of the base. The overall dimensions are 25 mm X 40 mm X 65 mm (width X depth X height). A 10 mm wide groove runs the length of the holder, with a thumb screw at the bottom. A platform is attached to the top of the holder, 25 mm X 40 mm X 10 mm, with a 3.5 mm diameter hole aligned with the groove in the holder.\nLED arrays (see Figure 1).",
    "Four arms of coolant hose, ~18 cm long, are affixed to the platform base using the coolant hose connector. Coolant hose is used only as structural support and is not used for cooling purposes.\nProperly spaced grooves are cut into the final piece of coolant hosing of each arm to affix a heat sink to the end of each arm.\nA blue LED Rebel Tri-Stars is mounted to each heat sink using pre-cut thermal adhesive tape. A Carclo 18 ° Tri-lens is affixed to each Tri-Star.\nLED Tri-Stars are wired to the BuckPuck DC drivers and a power supply as specified. We have arranged our set-up with each BuckPuck powering two Tri-Stars in series.\nIllumination of all four LED Tri-Stars at 700 mA yielded an irradiance of 713 W/m2 on our platform.\nCamera: The camera is mounted on a small tripod and focused on the top of the platform.\n4. Behavioral Assay\nBriefly anaesthetize flies on ice.\nPlace individual flies in pipet tips, using tape to close both ends of the tip.\nAfter the flies have awoken and are actively exploring the pipet tip, remove the tape and place a pipet in the groove in vertical holder. The thumbscrew is used to secure the pipet tip in place and to close the bottom of the tip.\nAs the fly explores the pipet tip (typically 30 - 60 sec), start the camera recording just before the fly emerges from the tip onto the platform.\nAfter the fly has emerged onto the platform, wait 1-2 seco, and turn on the blue LEDs. Use a timer to manually measure the time until the fly initiates flight.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}