{
  "id": 5666,
  "origin_website": "Bio",
  "title": "Implantation of Human Peripheral Corneal Spheres into Cadaveric Human Corneal Tissue",
  "procedures": [
    "Note: This procedure has been described in previous work by our laboratory (Yoon et al., 2013), the following section however provides additional information on the process and describes the technique in a protocoled format. Sphere formation and culture (Video 1)    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 1. Corneoscleral tissue processing for Sphere Forming Assay. Corneoscleral tissue is rubbed with a cotton bud on the posterior side to remove endothelial cells, scraped on the anterior side to remove epithelial cells and washed in PBS. The corneal/limbal region is excised and cut into small pieces prior to enzymatic treatment for limbal cell isolation.                                                      Using sterile technique in a sterile tissue culture hood, prepare 1 container of 70% ethanol and 1 container of PBS for tools and 1 container of PBS for washing. Place straight scissors, scalpel blade and forceps in 70% ethanol for 10 min.Remove the above equipment from 70% ethanol and rinse briefly in sterile PBS to remove residual ethanol.Using forceps, place corneoscleral tissue into a 100 mm sterile Petri dish (the corneoscleral rim [Figure 1A] has an approximate 2-2.5 mm wide ring of corneal/limbal tissue, which when excised has an approximate wet weight of 55-57 mg).Using sterile cotton buds, rub the posterior surface of the corneal tissue to remove endothelial cells (Figure 1B).Using a crescent bevel up ophthalmic knife, gently scrape the anterior surface of the tissue to remove epithelial cells (Figure 1C).Using a sterile transfer pipette, wash tissue with PBS. Repeat epithelial scraping and washes until PBS washes run clear of cellular debris (Figure 1D). Excise the limbal region and exclude as much of the sclera as possible (Figure 1E). Rinse the excised limbus, mince the tissue using scissors (Figure 1F) and place into sterile 5 ml tubes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170715/20170715010456_0817.jpgFigure 1. Corneoscleral tissue processing for Sphere Forming Assay.",
    "Corneoscleral tissue (A) is rubbed with a cotton bud on the posterior side to remove endothelial cells (B), scraped on the anterior side to remove epithelial cells (C) and washed in PBS (D). The corneal/limbal region is excised (E) and cut into small pieces (F) prior to enzymatic treatment for limbal cell isolation.Incubate in 1.2 U/ml Dispase for 40 min at 37 °C. Incubate in 2 mg/ml collagenase and 0.5 mg/ml hyaluronidase in MEM with Anti/Anti overnight at 37 °C on an orbital shaker.Strain the solution and cells using a 40 µm strainer to remove undigested material.Centrifuge filtrate for 7 min at 405 x g and wash cell pellet with PBS.Suspend cells in 2 ml supplemented Neurobasal-A medium.Prepare sterile glass coverslips in 6-well tissue culture plates. Seed the 2 ml suspension evenly into wells.Culture cells in a humidified incubator at 37 °C in 5% CO2.Carefully change 50% of medium twice weekly pipetting from the surface to avoid removing cells or newly forming spheres.Cells often become adherent to glass coverslips and aggregate into sphere like structures (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170715/20170715010605_0841.jpgFigure 2. Sphere formation. Phase contrast microscopy showing isolated cells initially adherent to glass coverslips after seeding (A), which over the course of days to weeks aggregate and form sphere like structures (B). Scale bar = 100 µm.Preparation of tissue for sphere implantationUnder sterile conditions within a biological safety cabinet (Heal Force Model HF-safe 1800) donor corneoscleral rims, which have been in storage at -80 °C for over 3 months, are divided into 1/8th segments, stored in individual 5 ml containers and re-frozen at -80 °C.Each corneoscleral rim is subjected to a total of 3 freeze-thaw cycles in order to decellularise the tissue prior to use for implantation.",
    "Note: If complete decellularisation is required, LIVE/DEAD® 2 μM calcein AM and 4 μM ethidium homodimer-1 (Life Technologies) in standard culture medium can be used according to manufacturer directions to either confirm complete decellularisation or determine the need for additional freeze-thaw cycles. Corneal limbus microsurgery (Video 2)    <p>imgsrc:https://bio-protocol.org/javascript:;</p>   Video 2. Surgical excision of a wedge of limbal tissue. Fine forceps were used with the non-dominant hand to anchor the sclera and provide counter-traction as two diagonal ~3 mm incisions were made prior to gripping the apex of the incised tissue to cut away and remove the anterior tissue segment. Cornea-limbus-sclera demarcations have to be visually approximated.                                                      Using sterile technique in a laminar flow cabinet (Gelman model  HLF 120  ), prepare 1 container of 70% ethanol and 1 container of sterile PBS for tools.Place fine forceps and MicroScalpel blade into the ethanol and leave for 10 min.Remove a thawed limbal rim segment and place into a Petri dishAfter washing tools in PBS, visualize the limbal rim using a binocular stereomicroscope. Using a MicroScalpel, make two diagonal ~3 mm incisions (Figure 3A), into the limbus with the apices intersecting such that a triangular wedge is created (Figures 3B and 3C). Using fine forceps grip the tissue at the apex and lift up the wedge (Figure 3D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170715/20170715010809_3436.jpgFigure 3. Surgical excision of a wedge of limbal tissue. Fine forceps were used with the non-dominant hand to anchor the sclera and provide counter-traction as two diagonal ~3 mm incisions (A) were being made (B, C) prior to gripping the apex to cut away the incised tissue (D). Cornea-limbus-sclera demarcations have to be visually approximated.Cut away the anchoring tissue using the feather MicroScalpel while angling the blade anteriorly so that the depression created is shallower in the corneal direction (Figure 4).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170715/20170715010859_9130.jpgFigure 4.",
    "Removal of the wedge-shaped tissue. 3-D representation of the upward sloping floor of the wedge (A) that is created post excision (B) from the limbal region.Repeat to create additional incisions in tissue.Note: Visualization of the incisions are challenging initially to the untrained eye but will develop with practice. Good lighting will be helpful.The Petri dish is closed and the tissue is transferred to a class II biological safety cabinet. Sphere implantationUsing sterile cotton buds, excess fluid is first blotted away from the corneoscleral tissue in which limbal wedge incisions have been made.Spheres are visualized in wells under a binocular stereomicroscope within a class II biological safety cabinet. Using a sterile 2-20 µl Eppendorf® Pipette set at a volume of 5 µl, gently aspirate spheres from culture.Visualize the incisions made in the corneoscleral tissue and eject the spheres and medium into the wedge incisions.Note: It is best to eject as minimum possible volume of culture medium as possible while ensuring that spheres have been ejected. Occasionally, difficulties arise with spheres floating off the tissue if the sphere implantation, specifically the ejection of sphere from the micropipette, is not performed gently.Transfer the corneoscleral rim with implanted sphere into a 35 x 10 mm cell culture dish and incubate at room temperature for 15 min epithelial side up.Invert the tissue so that the epithelium faces down.Note: Through personal experience, inverting the tissue has proven to be better than culturing tissue the right side up as the cornea usually floats and the spheres become not fully submerged in culture medium which does not seem facilitate cell migration and survival. With inverted culture however, spheres occasionally do not remain in situ and become detached from the tissue.Gently overlay the tissue with 2 ml of standard culture medium.Perform half medium changes every second day.",
    "The following image panel and legend has been reproduced from Mathan et al. (2016) (Figure 5).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170715/20170715011129_7704.jpgFigure 5. Implantation of peripheral corneal spheres into donor corneoscleral rims. Spheres (arrowheads) were implanted into wedge-shaped incisions made at the limbal region. Under stereomicroscopy, the corneoscleral rim with incisions (arrows) and implanted spheres can be clearly visualised (A). Combined phase contrast and fluorescence microscopy show an implanted sphere stained positively for live cells with LIVE/DEAD® stain (B). This signal is confined to the sphere and not detected in the surrounding tissue. A 40x DAPI stained 10 µm thick cross section of frozen-stored corneoscleral rim confirmed the absence of DAPI positive cell nuclei prior to implantation (C). Through phase contrast microscopy, the position of the spheres in the semi-transparent region of tissue is shown (D). Scale bars = 500 µm (A), 100 µm (B and D), 50 µm (C)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}