{
  "id": 14377,
  "origin_website": "Jove",
  "title": "A Novel Procedure for Evaluating the Reinforcing Properties of Tastants in Laboratory Rats: Operant Intraoral Self-administration",
  "procedures": [
    "1. Animal Care and Housing\nAll experiments are approved by the Animal Care Committee of the University of Guelph, and are carried out in accordance with the recommendations of the Canadian Council on Animal Care. The current study includes 22 adult male Sprague-Dawley rats (Charles River, QC) weighing 200-225 g at the beginning of the experiment.\nSingle house rats and maintain them on a reverse light/dark cycle (7:00 am OFF - 7:00 pm ON) with ad libitum access to food and water except when otherwise indicated, or during behavioral testing which occurs during the active cycle.\nHabituate rats to the colony room and human handling by weighing daily for one week prior to surgery.\n2. Intraoral Cannulation Surgery: Materials and Procedures\nThe intraoral (IO) surgery and materials are described in Limebeer et al.14\nTo construct the IO cannula, cut a piece of polyethylene plastic tubing to approximately 130 mm in length (inner diameter of 0.86 mm and outer diameter of 1.27 mm).\nThe tube to be secured in the oral cavity requires a flanged end (~5 mm in diameter). Create this flanged end by heating the end of the tube with a soldering iron for 2-5 sec and then promptly flatten the heated edge of the tube against a flat surface. Cut a surgical mesh disc (approximately 6-7 mm diameter to fit around the diameter of the flanged end of the cannula) and thread it onto the length of the tube until the disc rests against the back of the flanged end of the IO cannula.\nFor each IO cannula, cut one additional surgical mesh disc (8 mm in diameter) and three squares of an elastic band (6 mm x 6 mm; see Figure 1).",
    "Sterilize the IO cannula, surgical mesh discs, and elastic squares in an antibacterial solution for a minimum of 24 hr prior to surgery.\nPrior to surgery, autoclave all surgical tools and disinfect the surgical field. Between surgeries, use a glass bead sterilizer to sterilize tools, and wear a hairnet, nitrile gloves, and surgical masks to maintain aseptic conditions.\nAnalgesia and anaesthesia\nApproximately 30 min prior to surgery administer a subcutaneous (SC) injection of the antibiotic Depocillin (0.33 mg/kg) and the analgesic Meloxicam (5 mg/kg SC).\nInduce general anaesthesia using Isoflurane (4% induction and 3% maintenance).\nOnce rats are unresponsive to toe pinch, and prior to making any incisions, use a cotton tipped swab to administer a topical anaesthetic along the inner left cheek of rats where the cannula is to be implanted, and inject a local anaesthetic such as lidocaine HCl at the incision site for the biopsy needle (base of neck) and head cap (scalp).\nApply lubricating eye ointment to both eyes prior to the beginning of surgery.\nSurgical procedures\nShave a 10 mm x 10 mm patch of hair at the base of the neck. Use sterile gauzes to swab and cleanse the shaved area in the following order: antibacterial soap, isopropyl 70% alcohol, and Betadine.\nInsert a 15 G stainless steel needle at the base of the neck and move it subcutaneously around the ear to the left cheek. Position the needle tip and pass it through the cheek behind the first molar inside of the oral cavity.\nPass the IO cannula through the tip of the needle protruding from the oral cavity and then remove the needle leaving only the IO cannula.",
    "Thread one surgical mesh disc followed by three square elastic discs onto the exterior portion of the IO cannula and draw them to the exposed skin at the back of the neck to stabilize it.\nFlush the IO cannula with an antibacterial oral rinse\nPrior to the beginning of surgery, modify a Nylon bolt (28 mm length; 4 mm point; 8 mm head) to remove its head and carve a 2 mm groove along the length of the thread (see Figure 2).\nShave a 10 mm x 20 mm strip of hair along the midline of the head. Use sterile gauzes to swab and cleanse the shaved area in the following order: antibacterial soap, isopropyl 70% alcohol, and Betadine.\nUse a surgical scalpel to make a 20 mm long incision along the sagittal suture. Use a hand drill to make 4 holes (2 on each side of the suture) and use a hand held screw driver to secure four jewelers screws to the skull.\nPlace the bolt in the center of the four jewelers screws with the groove positioned towards the posterior of the animal. Mount the bolt to the skull of the rat by building a headcap with dental cement (use sufficient dental cement to cover the surface of the jewelers screws). Allow the dental cement to dry before removing the animal from the surgical field and terminate anaesthesia.\nPost-operative monitoring and care\nIndividually house rats in bedded cages immediately following surgery and closely monitor for 24 hr.\nAdminister a second injection of the analgesic Meloxicam 24 hr post-surgery and flush the IO cannula with an antibacterial oral rinse once/day for three days.\nGive rats 3-5 days to recover from surgery prior to the beginning of the experiment.\n3. IO Self-administration Procedures\nApparatus",
    "For self-administration, Plexiglas operant conditioning chambers are used, and each chamber is enclosed in a larger sound-attenuating plywood box. Each operant conditioning chamber has a house light (28 V) and two retractable levers (active and inactive) located on opposite sides of the chamber, 8 cm above the floor. The active lever is connected to an infusion pump positioned outside the sound-insulating chamber and a white light (28 W) is located 3 cm above it to serve as a stimulus light paired with the delivery of IO infusions. The inactive lever serves to control for baseline, nonreinforced operant behavior; pressing this lever has no consequence, but all presses are recorded.\nFood\nProvide rats with a standard rat chow (3.1 kcal/g) in their home cage.\nDilute high fructose corn syrup (55% formula) to three different concentrations (8% = 0.026 kcal/80 μl infusion; 25% = 0.08 kcal/80 μl infusion; 50% = 0.17 kcal/80 μl infusion) using reverse osmosis water. These concentrations are selected because each produces a viscosity that is appropriate to deliver rapid (2.5 sec) IO infusions given the experimental apparatus (i.e. diameter of syringes and tubing).\nFood deprivation\nIn order to facilitate the acquisition of IO self-administration, but promote normal growth, rats are cycled through periods of food deprivation and ad libitum access to standard rat chow.\nWeigh rats daily at 7 pm and remove chow from the feeding trough of the cage.\nThe following day, weigh rats at 12:00 pm (approximately 18 hr later) and begin IO self-administration by 1:00 pm.\nReturn rats to their home cages at 4:00 pm and provide ad libitum access to chow for 3 consecutive hr. Then, record the weight of the rats and the total amount of chow consumed over the three hours. Resume food deprivation as described.\nGeneral IO self-administration procedure",
    "Operant responding for IO infusions of HFCS is evaluated on PR and continuous schedules of reinforcement. Rats are tested in IO self-administration until intake is stable as defined by: 1) a significant difference in responding between active and inactive levers for at least 2 consecutive sessions; and 2) less than 20% variation in the number of infusions earned per session for 2 consecutive sessions. Each session begins 6 hr into the dark cycle and lasts 3 hr. The acquisition phase consists of 10 consecutive IO self-administration sessions on a continuous schedule of reinforcement, and rats receive a single PR test 24 hr prior to the beginning of acquisition (PR test I) and 24 hr after the final acquisition session (PR Test II). For PR tests, the breakpoint (BP) is defined as the last infusion received prior to cessation of responding on the active lever for at least 1 hr18.\nCounterbalance rats on the basis of weights taken for three days prior to the start of the experiment and assign rats to self-administer one of three concentrations of HFCS: 8%, 25%, or 50%.\nWeigh rats at 12:00 pm and transfer them from the colony room to the testing room in their home cages. To remove food or bedding that can accumulate in the IO cannula, pump air through the cannula using a 12 ml syringe fixed with a 16 G needle with 50 mm of polyethylene tubing (inner diameter of 1.14 mm and outer diameter of 1.57 mm) attached to the end.",
    "In the operant chamber, connect the IO cannula to Tygon tubing (inner diameter of 0.02 mm and outer diameter of 1.53 mm) by a shaft constructed of a modified 20 G needle (remove the plastic hub and beveled tip). Position the lower portion of the tubing (i.e. closer to the animal) within the grove of the bolt. The higher portion of the tubing is connected to a swivel, and protected by a spring. Connect the base of the spring to the thread of the bolt mounted on the head of the rat.\nGive rats five minutes to acclimatize to the operant chamber and then start the IO self-administration session. The IO self-administration session begins with the activation of the house light, entry of the two retractable levers, and illumination of the light stimulus above the active lever for 30 sec.\nFor PR Test I, use the PR schedule described by Richardson and Roberts18 (response ratio escalation = (5e(injection number x 0.2)) - 5).\nFor acquisition sessions 1-10, use a continuous schedule of reinforcement whereby each press on the active lever results in the delivery of an 80 μl infusion of the test solution over 2.5 sec.\nTo allow sufficient time for ingestion, impose a time-out period of 27.5 sec during which the active lever is retracted and the stimulus light is activated (i.e. rats can obtain an IO infusion every 30 sec). Do not impose a limit on the number of infusions obtainable within each IO self-administration session.\nIf the rat does not make a response on the active lever for 20 consecutive minutes, prime the rat (open the operant chamber and facilitate the rat pressing once on the active lever). Prime the animals every 20 min up to 5x/session during the first three days of acquisition only.",
    "Administer the second PR test using the parameters described in step 3.10.\nFollowing IO self-administration sessions, remove rats from the operant chambers, flush the IO cannula with 2.0 ml water using the same materials described in 3.7, and return rats to their home cage in the colony room.\nFollowing three hours of ad libitum access to rat chow, weight rats at 7:00 pm, remove food from the feeding trough, and resume food deprivation.\nSelf-administration data are analyzed using two-factor repeated measures Analyses of Variance (ANOVA). Multiple comparisons using the Student-Newman-Keuls method (α=0.05) were employed to explore any significant interactions or main effects.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}