{
  "id": 2167,
  "origin_website": "Cell",
  "title": "Identification of myo-inositol-binding proteins by using the biotin pull-down strategy in cultured cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSynthesize biotin-labeled myoinositol\nTiming: 3 days\nA series of biotin-labeled inositol moieties with connecting linkers between biotin and myo-inositol are designed and synthesized. The procedure for the direct conjugation between biotin and myo-inositol is described as below. Based on the NMR studies including 1H NMR, 13C NMR, 2D COSY, and 2D HMBC spectra (Figures 1[href=https://www.wicell.org#fig1]A–1D) and the reactivity of each hydroxyl group in inositol, the chemical structure is proposed as shown as Scheme 1[href=https://www.wicell.org#sch1] below.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1645-Fig1.jpg\nFigure 1. NMR spectra\n(A) 1H NMR spectrum.\n(B) 13C NMR spectrum.\n(C) COSY NMR spectrum.\n(D) HMBC NMR spectrum.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1645-Sch1.jpg\nScheme 1. The structure of biotin-labeled myo-inositol\nSeal and heat the suspension of 180 mg of inositol (1 mmol), 258 mg biotin methyl (1 mmol) and 11 mg of sodium methoxide (0.2 mmol) in dry N,N-Dimethylformamide (DMF) (6 mL) in a 10–20 mL microwave vial with a magnetic stir bar in microwave irradiation (Biotage Initiator Classic).\nIrradiate the reaction mixture at a required ceiling temperature (180°C) using maximum power (250 W) for the stipulated time (30 min).\nCool to 50°C with gas jet cooling.\nTransfer the reaction mixture to a round-bottomed flask (20 mL).\nNote: Around 4 mL of the solvent is lost under reduced pressure.\nAdd 3 mL of DCM.\nNote: White solid is precipitated from the solvent).\nAfter filtering and washing with DCM, 310 mg of wax solid is obtained after dry.\nNote: The yield is 76% from HPLC.\nDissolve the crude product (50 mg) in 10% water/acetonitrile (1.0 mL) and carefully deposit a thin line across a pencil line on preparative thin layer chromatography.\nNote: PTLC, silica gel 60, 20 × 20 cm with 0.5 mm.\nAfter drying, place PTLC plate in the chamber with 10% water/acetonitrile.",
    "Run the crude product on PTLC plate by 10% water/acetonitrile.\nCritical: Seal the top of chamber.\nNote: A typical run takes 40 min to 1 h.\nTake out PLTC plate from chamber and cut down a thin line of the stain from an edge of the plate.\nUse the iodine fuming technique to mark the line of the targeted product.\nScrape off the band.\nSonicate the silica gel in acetonitrile (10 mL).\nFilter silica gel through the filter paper to concentrate the product.\nNote: 32 mg of compound after dry (purity > 98% from HPLC, 10% water/acetonitrile, Rf = 0.18.\nNMR studies including 1H NMR, 13C NMR, 2D COSY, and 2D HMBC spectra are shown in Figure 1[href=https://www.wicell.org#fig1]. 1H NMR (400 MHz, DMSO-d6) δ 8.42 (s, 5H), 6.49 (s, 1H), 6.40 (s, 1H), 4.32–4.29 (m, 1H), 3.71 (d, J = 2.6 Hz, 1H), 3.36 (t, J = 9.3 Hz, 2H), 3.12–3.10 (m, 3H), 2.91 (t, J = 9.1 Hz, 1H), 2.84–2.77 (m, 1H), 2.58 (d, J = 12.4 Hz, 1H), 2.13 (t, J = 6.8 Hz, 2H), 1.67–1.40 (m, 4H), 1.37–1.26 (m, 2H). 13C NMR (100 MHz, DMSO-d6) δ 166.54, 163.24, 75.71, 73.20, 73.04, 72.35, 61.53, 59.65, 55.93, 35.03, 28.75, 28.54, 25.43.\nHarvest protein extracts\nTiming: 2 days\nTo harvest protein extracts and quantify protein concentration for cell-based binding assay, PC3 cells are cultured in RPMI-1640 medium supplied with 10% (V/V) FBS and 2 mM glutamine. PC3 cells are harvested from 15 cm dishes once cell confluency reached 90%. Protein concentration is determined using the Bio-Rad Protein Assay Dye Reagent Concentrate (Catalog number #5000006). At least 1 mg of protein lysates for each experimental group is used in biotin pull-down assay including beads control, biotin pull-down control and biotin-labeled inositol pull-down groups.",
    "Use using lysis buffer (50 mM Tris pH7.4, 150 mM NaCl, 0.1% (W/V) SDS, 0.5% sodium deoxycholate, 1% NP-40 and 1 mM EDTA) to harvest cells. After scratching cells from dishes, cell lysates are incubated on ice for 20 min.\nNote: Store lysis buffer at 4°C for 1 year.\nCentrifuge cell lysates at 4°C for 20 min using 16,800 g (Sorvall™ Legend™ Micro 21R Microcentrifuge, Cat#75002445; 24 × 1.5/2.0 mL Rotor, Cat#75003424; VWR 1.5 mL Microcentrifuge Tube, Cat#10025-724).\nCollect the supernatant in fresh tubes, placed on ice and then protein extract is subjected to Bio-Rad Protein Assay to quantify protein concentration according to manufacturer’s instructions (https://www.bio-rad.com/webroot/web/pdf/lsr/literature/LIT33.pdf[href=https://www.bio-rad.com/webroot/web/pdf/lsr/literature/LIT33.pdf]).\nNote: Store Bio-Rad Protein Assay Dye Reagent Concentrate (Catalog number #5000006) at 4°C for 1 year.\nR-squared value for linear regression in the standard curve, which needs to reach close to 0.997–0.999, should be performed to ensure accurate quantification of protein concentration.\nPause point: Once protein extracts are prepared, cell lysates can be stored at −80°C, providing a potential pause point in this step.\nPre-clear protein extracts\nTiming: 30–40 min\nTo perform samples pre-clearing, Dynabeads MyOne Streptavidin T1 available in Thermo Fisher Scientific (catalog number 65602) are washed by lab prepared PBS and binding buffer in advance. Pre-clearing the samples with plain beads is a necessary step to reduce non-specific binding and minimize co-purification of off-target molecules before interacting complex is assembled.\nPrepare 30 μL of Dynabeads MyOne Streptavidin T1 for each experimental group. Calculate total volume of beads including extra one sample in case beads lose during washing and then wash beads by lab prepared PBS for 3 times.\nNote: Store lab prepared PBS at 4°C for 1 year.",
    "Use 30 μL X (the number of sample + 1) of lysis buffer to resuspend washed beads and aliquot 30 μL of beads in fresh tubes.\nAdd 1 mg of the protein extracts in each 1.5 mL tube with beads and then use the binding buffer to fill up the rest of volume until 500–800 μL, so that each sample has the same volume for pre-clearing step.\nNote: Store binding buffer at 4°C for 1 year.\nIncubate protein extracts with Dynabeads MyOne Streptavidin T1 for 30 min at 4°C in a rotating wheel at 20 rpm with vertical 90° position (Labnet Labroller Rotator II, Cat#H5000).\nUse a magnetic rack (1.5 mL microcentrifuge tubes SureBeads magnetic racks, Cat#1614916) to separate protein extracts from beads, followed by collecting pre-clearing protein extracts in fresh tubes put on ice.\nBiotin pull-down assay in cell-based protocol\nTiming: 2 days\nTo perform biotin pull-down assay in cell-based protocol, Dynabeads MyOne Streptavidin T1 is incubated with biotin or biotin-labeled inositol, followed by adding protein extracts.\nPrepare 30 μL of Dynabeads MyOne Streptavidin T1 for each experimental group. Calculate total volume of beads the total number of sample including extra one sample in case beads lose during washing. Wash total beads by using lab prepared PBS for 3 times, respectively.\nUse 30 μL X (the number of sample + 1) of Lab prepared PBS to resuspend washed beads and aliquot 30 μL of beads in fresh tubes.\nAdd 25 μM–40 μM of biotin or biotin-labeled inositol in each tube with beads and then use lab prepared PBS to fill up the rest of volume until 500 μL.\nIncubate biotin or biotin-labeled inositol with Dynabeads MyOne Streptavidin T1 for 30 min at 25°C in a rotating wheel.\nNote: Dynabeads stably bind to biotin at 25°C.",
    "Use a magnetic rack to collect beads that bind with biotin or biotin-inositol, followed by washing beads by using lab prepared PBS for 3 times.\nAdd pre-clearing 1 mg of protein extracts to incubate with the beads binding with biotin or biotin-labeled inositol in each experimental group for 2–3 h at 4°C in a rotating wheel.\nSpin down each sample using 2,400 g to make sure no beads left on the cap of tubes and then use a magnetic rack to separate beads and protein extracts.\nAfter removing protein extracts, wash the beads by lysis buffer for 30 s and subsequently by lab prepared PBS 30 s each time for 3 times at 4°C.\nAfter removing lab prepared PBS, add 30 μL of 2 times SDS loading dye in each sample, followed by boiling each sample at 95°C for 5 min.\nNote: 2 times SDS loading dye was prepared from 5 times SDS loading dye (250 mM Tris-HCl pH 6.8, 10% SDS, 30% glycerol, 5% β-mercaptoethanol and 0.02% bromophenol blue) by dilution.\nNote: Store SDS loading dye at −20°C for 1 year.\nPerform Western blotting by loading 10 μg of protein extracts as input and 30 μL of each experimental sample.\nRun protein extracts in the 12% SDS-PAGE.\nTransfer protein in the SDS-PAGE to PVDF membrane using Mini Trans-Blot Electrophoretic Transfer Cell from BioRad (Cat#1703930) under 90 voltage for 3 h.\nConduct PVDF membrane blocking by 3% (W/V) skim milk PBST (lab prepared PBS + 1% Tween 20) for 1 h.\nIncubate with primary antibodies such as AMPKα, AMPKβ and AMPKγ antibodies for over 12 h at 4°C.\nAfter membranes are washed by PBST 7 min each time for 3 times, incubate with HRP-conjugated secondary antibodies (Jackson ImmunoResearch Laboratories, Cat#111-035-003 and Cat#115-035-003) for 1 h at 25°C.",
    "After membranes are washed by PBST 7 min each time for 3 times, incubate with ECL western blotting substrate (Thermo Fisher Scientific, Cat#32106) with each membrane for 2 min at 25°C, following by visualizing signal on the autoradiography films.\nImmunoblotting of biotin pull-down assay in cell-based protocol by using AMPKα, AMPKβ and AMPKγ specific antibody is shown in Figures 2[href=https://www.wicell.org#fig2] and 3[href=https://www.wicell.org#fig3]A.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1645-Fig2.jpg\nFigure 2. AMPKαβγ binds to biotin-labeled inositol\nBeads only, 25 μM of biotin or 25 μM of biotin-labeled inositol (Biotin-Ins 1) incubating with cell lysates from PC3 cells was pulled down by Dynabeads Streptavidin, following by immunoblotting using specific AMPKα, AMPKβ and AMPKγ antibodies (Scheme 1[href=https://www.wicell.org#sch1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1645-Fig3.jpg\nFigure 3. Biotin-labeled inositol (Biotin-Ins) binds to AMPKαβγ complex in cells and binds to AMPKγ subunit in vitro\n(A) The cell lysates from PC3 cells were incubated with 40 μM of biotin or 40 μM of biotin-labeled inositol, and inositol interacting proteins were pulled down by streptavidin beads and subjected to immunoblotting using specific AMPKα, AMPKβ and AMPKγ antibodies.\n(B) The purity of the recombinant proteins of GST, GST-AMPKα, GST-AMPKβ and GST-AMPKγ were resolved by SDS-PAGE, followed by Coomassie blue staining.\n(C) 200 ng of GST, GST-AMPKα1, GST-AMPKβ1 or GST-AMPKγ1 incubated with 40 μM of biotin or biotin-labeled inositol (Biotin-Ins 1) for 3 h, followed by pulldown with streptavidin beads. The interaction was determined by immunoblotting with GST antibody.\n(D) The cell lysates from PC3 cells treated with 25 μM of biotin or biotin-labeled inositol (Biotin-Ins 1) treatment for 1 h were incubated with streptavidin beads and subjected to immunoblotting with indicated antibodies.\nBiotin pull-down assay in vitro protocol\nTiming: 2 days",
    "To perform biotin pull-down assay in vitro protocol, Dynabeads MyOne Streptavidin T1 is incubated with biotin or biotin-labeled inositol, followed by adding recombinant proteins. Pre-clearing the samples with plain beads is still necessary to reduce non-specific binding before binding complex is assembled.\nExpress the full-length recombinant proteins of GST, GST-AMPKα1, GST-AMPKβ1 or GST-AMPKγ1 in Escherichia coli BL21 and purify recombinant proteins by using glutathione-sepharose beads (GE Healthcare, Cat#17-0756-01). Dilute purified proteins by using 10 mM Tris pH 8.0 buffer. The purity of the recombinant proteins is assessed by SDS-PAGE, followed by Coomassie blue staining (Figure 3[href=https://www.wicell.org#fig3]B).\nPrepare 30 μL of Dynabeads MyOne Streptavidin T1 for each experimental group. Wash beads by using lab prepared PBS 30 s each time for 3 times, respectively.\nUse 30 μL X (the number of sample + 1) of binding buffer to resuspend washed beads and aliquot 30 μL of beads in fresh tubes.\nAdd 100–200 ng of recombinant proteins in each tube with beads and then use binding buffer to fill up the rest of volume until 500 μL.\nIncubate 1 mg of recombinant proteins with Dynabeads MyOne Streptavidin T1 for 30 min at 4°C in a rotating wheel.\nUse a magnetic rack to separate 1 mg of protein extracts from beads, and then collect pre-clearing recombinant proteins in fresh tubes put on ice.\nPrepare 30 μL of new Dynabeads MyOne Streptavidin T1 for each experimental group after washing with lab prepared PBS 30 s each time for 3 times.\nAdd 25–40 μM of biotin or biotin-labeled inositol in each tube with beads and use lab prepared PBS to fill up the rest of volume until 500 μL.\nIncubate biotin or biotin-labeled inositol with Dynabeads MyOne Streptavidin T1 for 30 min at 25°C in a rotating wheel.",
    "Note: Dynabeads stably bind to biotin at 25°C.\nUse a magnetic rack to collect beads that binds with biotin or biotin-inositol and then wash beads by lab prepared PBS 30 s each time for 3 times.\nAdd pre-clearing 100–200 ng of recombinant proteins to incubate with the beads binding with biotin or biotin-labeled inositol in each experimental group, followed by incubating with beads for 1–2 h at 4°C in a rotating wheel.\nSpin down each sample to make sure no beads left on the cap of tubes and then use a magnetic rack to separate beads and protein extracts.\nAfter beads incubate with recombinant proteins, wash beads by wash buffer 30 s each time for 3 times and lab prepared PBS 30 s each time for 3 times at 4°C.\nNote: Store wash buffer at 4°C for I year.\nAfter removing lab prepared PBS, add 30 μL of 2 times SDS loading dye in each sample, followed by boiling each sample at 95°C for 5 min.\nNote: 2 times SDS loading dye was prepared from 5 times SDS loading dye (250 mM Tris-HCl pH 6.8, 10% SDS, 30% glycerol, 5% β-mercaptoethanol and 0.02% bromophenol blue) by dilution.\nConduct Western blotting by loading 10 ng of recombinant proteins as input and 30 μL of each experimental sample.\nRun recombinant proteins with SDS loading dye were run in the 12% SDS-PAGE.\nTransfer protein in the SDS-PAGE to PVDF membrane using Mini Trans-Blot Electrophoretic Transfer Cell from Bio-Rad (Cat#1703930) under 90 voltage for 3 h.\nConduct membrane blocking by using 3% skim milk for 1 h.\nIncubate with primary GST antibody for 3 h at 25°C.",
    "After membranes are washed by PBST (PBS+1% Tween 20) 7 min each time for 3 times, incubate with HRP-conjugated secondary antibody (Jackson ImmunoResearch Laboratories, Cat#115-035-003) for 1 h at 25°C.\nAfter membranes are washed by PBST (PBS+1% Tween 20) 7 min each time for 3 times, incubate ECL western blotting substrate (Thermo Fisher Scientific, Cat#32106) with each membrane for 2 min at 25°C, following by visualizing signal on the autoradiography films.\nImmunoblotting of biotin pull-down assay in vitro protocol by using GST antibody is shown in Figure 3[href=https://www.wicell.org#fig3]C.\nBiotin pull-down assay in cell-based protocol upon treatment\nTiming: 2 days\nTo perform biotin pull-down assay in cell-based protocol upon biotin and biotin-labeled inositol treatment, biotin-labeled inositol treatment could also be taken up by cells, followed by detecting inositol-binding proteins using biotin pull-down assay.\nTreat 25–40 μM of biotin or biotin-labeled inositol for 1–2 h in 90% confluency of PC3 cells cultured in RPMI-1640 medium supplied with 10% FBS, 2 mM glutamine in 15 cm dishes.\nHarvest cells by using lysis buffer (50 mM Tris pH7.4, 150 mM NaCl, 0.1% SDS, 0.5% sodium deoxycholate, 1% NP-40 and 1 mM EDTA). After scratching cells from dishes, incubate cell lysates on ice for 20 min.\nCentrifuge cell lysates for 20 min at full speed (16,800 g). Collect supernatant in fresh tubes placed on ice and cell lysates are subjected to Bio-Rad Protein Assay for quantifying protein concentration.\nPrepare 30 μL of Dynabeads MyOne Streptavidin T1 for each experimental group after washing by lab prepared PBS 30 s each time for 3 times.\nAdd 1 mg of protein extracts from biotin or biotin-inositol treated cells in 30 μL of Dynabeads MyOne Streptavidin T1 and then use the lysis buffer to fill up the rest of volume until 500 μL.",
    "Incubate Protein extracts with beads for 2–3 h at 4°C in a rotating wheel.\nAfter beads incubate with protein extracts, wash beads by lysis buffer 30 s each time for 3 times and lab prepared PBS 30 s each time for 3 times.\nConduct Western blotting by loading 10 μg of protein extracts as input and 30 μL of each experimental sample.\nImmunoblotting upon biotin or biotin-labeled inositol treatment in PC3 cells by using AMPKα, AMPKβ and AMPKγ specific antibodies is shown in Figure 3[href=https://www.wicell.org#fig3]D.\nCompetition biotin pull-down assay by unlabeled myo-inositol\nTiming: 2 days\nTo perform biotin pull-down assay in cell-based protocol or in vitro protocol, unlabeled myo-inositol could be used as a competitor to determine whether target proteins specifically bind to biotin-labeled inositol.\nAfter 25–40 μM of biotin or biotin-labeled inositol binds to Dynabeads MyOne Streptavidin T1, add 1 mg of protein extracts or 100–200 ng of recombinant proteins in each tube with beads and use binding buffer to fill up the rest of volume until 500 μL.\nAdd 2.5–4 mM of unlabeled myo-inositol to the beads binding to biotin-labeled inositol and then incubate with pre-clearing protein extracts/recombinant proteins.\nIncubate beads binding with biotin-labeled inositol and unlabeled myo-inositol together for 1–2 h at 4°C in a rotating wheel like other experimental groups.\nAfter beads bind to protein extracts or recombinant proteins, wash beads by lysis buffer, wash buffer and lab prepared PBS.\nNote: For beads binding to protein extract, wash beads by lysis buffer 30 s each time for 3 times and lab prepared PBS 30 s each time for 3 times.\nNote: For beads binding to recombinant proteins, wash beads by wash buffer 30 s each time for 3 times and lab prepared PBS 30 s each time for 3 times at 4°C.",
    "After removing lab prepared PBS, add 30 μL of 2 times SDS loading dye in each sample, followed by boiling each sample at 95°C for 5 min.\nEach sample from biotin pull-down assay is subjected to immunoblotting by using specific AMPKα, AMPKβ, AMPKγ or GST antibody shown in Figures 4[href=https://www.wicell.org#fig4]A and 4B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1645-Fig4.jpg\nFigure 4. Unlabeled myo-inositol abolishes biotin-labeled inositol binding to its target proteins\n(A) The cell lysates from PC3 cells were incubated with 40 μM of biotin, 40 μM of biotin-labeled inositol (Biotin-Ins) or 4 mM of unlabeled myo-inositol (Ins); and inositol interacting proteins were pulled down by streptavidin beads and subjected to immunoblotting using specific AMPKα, AMPKβ and AMPKγ antibodies.\n(B) 200 ng of GST-AMPKγ1 was incubated with 40 μM of biotin, 40 μM of biotin-labeled inositol (Biotin-Ins) or 4 mM of unlabeled myo-inositol (Ins) for 2 h, followed by pulldown with streptavidin beads. The interaction was determined by immunoblotting with GST antibody."
  ],
  "subjectAreas": [
    "Chemistry",
    "Molecular/Chemical Probes",
    "Metabolism",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Cell-Based Assays",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}