{
  "id": 6311,
  "origin_website": "Bio",
  "title": "Eye Drops for Delivery of Bioactive Compounds and BrdU to Stimulate Proliferation and Label Mitotically Active Cells in the Adult Rodent Retina",
  "procedures": [
    "Animals are given one eye drop once a day from a backfilled 3 ml plastic disposable transfer pipette for various amounts of time depending on the experimental design of the study. One drop of solution from the transfer pipette contains 30 µl of diluted PNU-282987/BrdU. Eye drops are delivered directly to the center of the bulbar conjunctiva of the eye; a clear membrane that covers the anterior face of the sclera and the transparent surface epithelium of the cornea. A new disposable 3 ml transfer pipette is used each time eye drops are applied. Both sexes of adult rats and mice produce BrdU positive cells after 3 days of eye drop treatments. In vehicle control studies, eye drops containing PBS or eye drops containing PBS with 1% DMSO are applied as negative controls.Adding eye drops to adult mice Notes:The safe restraint and gentle handling of these rodents is a key part of the experimental procedures. All rodent handlings wear a lab coat and latex gloves in the animal facility. All handlers have Institutional Animal Care and Use Committee training before proceeding.  Animals should be approached with confidence and the animals should be handled gently, but firmly to avoid bites or scratches to the handler or injuries to the animal. One handed mouse restraint is usually performed with the non-dominant hand, leaving the dominant hand free for applying eye drops. Lift adult mice (ranging from 3-6 months) by the base of the tail from their cage and place them on the cage lid. Tuck the base of the tail between the 3rd and 4th finger (Figure 2A).Then immobilize the adult mice (ranging from 3-6 months) by scruffing the skin over their neck.",
    "Using the same hand that is holding the tail, grasp the skin near the base of the head with the index finger and thumb (Figure 2B).Note: Be sure to apply just enough pressure, or firmness, to the skin around the neck to ensure the eyes are opened and to prevent the mouse from turning or twisting out of the hand restraint. Once the mouse is firmly scruffed, place one drop of diluted PNU-282987/BrdU solution on the bulbar conjunctiva of the right eye. The right eye should be positioned up by twisting the wrist of the restrainer’s hand. The dilution should be dropped just over the eye. Do not bring the transfer pipette in direct contact with the cornea. The drop will cover the entire eye and should sit on top of the eye as a small ball for 1-2 s (Figure 2C). Note: If treatment is needed in the animal’s contralateral eye, the restrainer’s wrist containing the same scruffed animal should be turned so that the left eye is situated up. At this point, another single drop can be added to the left eye and allowed to sit in a small ball over the eye for 1-2 s. Once eyes have been treated, release the animal back into its cage. It is not unusual for the animal to shake its head once it is released to remove any excess fluid that remains over its eye (see Notes).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181101/20181101003837_5520.jpgFigure 2. Eye drop application to adult mice. A. A 3-month-old female adult SVJ 129 mouse is removed from cage and positioned for handling. B. The mouse is held for eye drop delivery. C. Eye drop applied to scruffed animal. Scale bar represents 1.25 cm.Adding eye drops to adult ratsDeliver eye drops to rats (aged 3-6 months) that are not physically restrained.",
    "Remove the top of a rat cage and add an eye drop containing a dilution of PNU-282987 and BrdU to the center of the rat eye using a disposable 3 ml backfilled transfer pipette (Figure 3A). Place the eye dropper within an inch of the eye before releasing one drop of fluid containing 30 µl of diluted PNU-282987/BrdU onto the bulbar conjunctiva. The rat will blink and shake its head when an eye drop has been successfully applied. Do not allow the transfer pipette to come in direct contact with the cornea. When one drop has been added, a drop can also then be added to the contralateral eye depending on the experimental design of the study. After all drops have been administered, give each rat 2-3 Cheerios before the top of the cage is replaced (example in Figure 3B) and then return the cage containing the treated animal to the colony. All animals are housed singly.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20181101/20181101003855_7784.jpgFigure 3. Eye drop application to adult rats. A. A 3-month-old adult female Sprague Dawley rat is positioned to receive one drop of PNU-282987/BrdU solution. B. The Cheerio reward is delivered after a successful eye drop delivery. Scale bar represents 2.5 cm."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}