{
  "id": 10001,
  "origin_website": "Jove",
  "title": "Maintaining and Assessing Various Tissue and Cell Types of the Eye Using a Novel Pumpless Fluidics System",
  "procedures": [
    "All procedures for harvesting tissue from rats and mice were approved by the University of Washington Institutional Animal Care and Use Committee.\n1. Pre-experimental preparation\nNOTE: The following tasks are completed at least a day in advance of the experiment.\nDesigning the experimental protocol\nAssignment of tissue placement in channels: Choose tissue or cell model to be placed in 3 of the 4 channels on each side of the MRM. One tissue chamber on each side is run without tissue to be used for baseline correction.\nArrange the samples using one of the two typical designs - different test compound protocols on each side (e.g., channels on one side of the MRM receive test compounds while the channels on the other side act as a control); same test compound injection protocol on both sides of the MRM, but different tissues or tissue model versus control on either side of the MRM.\nSelection of flow rate and tissue amount for optimal OCR measurement: Adjust the flow rate until the change in lifetime ratio times 100 is approximately 3.\n\t\tNOTE: Typical amounts of tissue and corresponding flow rates are shown in Table 1 for components of the eye, where the instrument functions best at flow rates between 6-80 µL/min/channel.\nCalculation of required media/buffer volume: Calculate the volume of media to be added to each MRM insert at the beginning of the experiment as\n\t\tVolumeMRM = 30 mL + Duration of Protocol (in min) x Flow Rate (in mL/min) x 4 channels (Eq.1)\n\t\t​For example, at 0.01 mL/min, a 60 mL starting VolumeMRM will allow for a 12.5 h protocol (where 30 mL will be depleted, while 30 mL will be remaining), whereas at 0.04 mL/min, 90 mL starting VolumeMRM will allow for a 6 h protocol (with 30 mL remaining).",
    "Test compounds injection protocol: Select test compounds to assess, the concentration to be tested (typically chosen to yield near maximal response or as concentration dependencies) and the duration of exposure. Consider solubility and make up stocks in desired solvent such as water, DMSO or ethanol.\nSelect the timing of injections and subsequent injections so that the response reaches a steady state prior to adding a subsequent agent. When repeating protocols, match the timing of injections so that multiple time courses can be averaged.\n\t\tNOTE: The compounds used here are from a previous mitochondrial (Mito) stress test 11 and both oligomycin and carbonyl cyanide 4-(trifluoromethoxy)phenylhydrazone (FCCP) require DMSO both in the stock solutions, as well as the final perifusate.\nOutflow sampling times: Select the desired fraction collection intervals (from 1-60 min/sample), where faster sampling rates are chosen for rapid changes, and longer time intervals are chosen as steady state is approached. Use adequate well volumes (0.3 to 1.5 mL) to avoid overflow during the sampling interval (choose volumes that are greater than flow rate x the time interval).\n\t\tNOTE: Sampling times will vary with choice of protocol, but for a Mito stress test, we have commonly used 5 min intervals during the baseline and 15 min intervals during the injections (-15, -10, -5, 0, 15, 30, 45, 60, 75, 90, 105, where each time is the start of the sampling interval).\nEnter the selected values for test compounds and fraction collection described above into the user interface (UI), which generates graphical representations of this information. Export and disseminate files for group evaluation and discussions (Supplementary Figure 1).\nSet out the accessories and consumable parts",
    "Set out the supplies provided and pre-packaged aseptically by the manufacturer which include: TCAs (pack of 8), outflow tubing assemblies (pack of 8 tubes), test compound injection tubing (2), forceps, tubing clamps (3), MRM, MRM inserts (2), stir bars (2), and purge tubing assembly (placed in a biological safety cabinet).\nDo not reuse disposable parts that come in contact with liquid, as this will lead to an increase in experimental failure. Reuse the forceps and stir bars by cleaning and autoclaving them between experiments.\n2. Preparation and equilibration of perifusate (Time: 30 min not including incubation time)\nPrepare the media or Krebs-Ringer bicarbonate buffer (KRB) the day before based on calculations from equation 1, typically 200 mL, and then incubate overnight in a 39 °C/5% CO2 incubator in T225 tissue culture flasks with no more than 90 mL in each flask.\nIf using commercially prepared KRB or media (warmed to room temperature), prepare the perifusate on the morning of the experiment and place in the 5% CO2 incubator for at least 1 h. Prepare all solutions aseptically.\n\t​NOTE: All liquids and parts of the fluidics system that come in contact with liquid are sterile at the outset of the experiment. However, assembly of the system and loading of the tissue is performed open to the air.\n3. Equilibration of temperature and dissolved gas to set up the instrument (Time: 75 min)\nAttachment of tubing assemblies to the MRM\n\t\nPlace the MRM and a fluidics package onto the bench next to the instrument. Ensure the tubing clamps (3), stir bars (2), and forceps are already on the tool tray.\nPlace an unused MRM insert with a stir bar in each side of the MRM (see Figure 3).",
    "Attach the TCAs to injection ports on both ends of the MRM so that the end of the tubing is positioned directly over the stir bar. Ensure that the longer of the two test compound injection assemblies is on the back of the MRM.\nNext, attach the gas inflow feed line and purge tubing assembly to the back and front vacant ports, respectively (see Figure 4A).\nPlacing the MRM/tubing assemblies in the enclosure\n\t\nPlace the MRM (with the tubing assemblies attached) into the MRM heater (Figure 4B).\nPosition the four tubing assemblies into the grooves of the walls in the base of the enclosure (two on each side) so they will protrude through to the exterior of the enclosure once the middle enclosure is put in place.\nSecure the MRM between the clamps by tightening the two wheels on the detector stand.\nFeed the longer test compound injection assembly protruding from the back of the enclosure through the two tube guides on the side of the enclosure so the opening of the tubes faces forward (Figure 4C).\nClamp each of the closed test compound injection assemblies.\nAssembling the enclosure and activating the temperature controllers\n\t\nToggle the power strip that supplies power to all of the electrical devices within the enclosure to the ON position. The fan on the detector stand will turn ON and the MRM temperature controller should light up displaying a set value of 38 °C (Figure 5).\nTurn ON the stirrers to 70 rpm using the UI to ensure that the stir bars are rotating smoothly. Once proper stirring is observed, turn off the stirrers.\nPlace the middle section of the enclosure on top of the base.",
    "Connect the cable on the middle section of the enclosure to the cable from the electrical box to engage power to the ambient temperature controller lever switch and supply power to the ambient temperature heater.\nPlace the lid on the enclosure and the display of the upper temperature controller (the ambient temperature controller) will light up and read 36 °C. Start a timer for 30 min, the time it takes for the MRM heater to reach set point temperature.\nInserting the TCAs into the PCM\n\t\nUse the TCA insertion tool to insert each of the 8 TCAs into the PCM holes by firmly pressing on the adaptor with the face of the insertion tool until the top of the tubing sleeve wrapped around the tissue chamber touches the surface circumscribing the holes in the PCM.\nCompletely insert one TCA before inserting the next one. Set the partially assembled PCM aside next to the PCM brace and 6 screws.\n\t\tNOTE: Incomplete insertion of a TCA will prevent the head space from reaching the pressure set point and perifusate will not flow.\nFilling the two inserts in the MRM with pre-equilibrated perifusate\n\t\nTo do this, 30 min after the enclosure was assembled and the MRM has reached temperature, transfer the pre-equilibrated perifusate into the pre-heated MRM insert by gently dispensing the liquid down the sides using a 50 mL pipette.\n\t\tNOTE: These steps as well as the ones in section 3.6, should be carried out immediately to avoid transfer of gas between the perifusate in the MRM and the atmosphere.\nAssembling the MRM/PCM to create a gas-tight seal and positioning the O2 detector",
    "Place the PCM onto the MRM by inserting the resistance tubes of the TCAs emanating from the bottom of the PCM into the MRM inserts, 4 on each side of the MRM Divider. Orient the PCM so that the tissue chambers can rest against the O2 detector once it is positioned.\nSecure the PCM and the PCM Support Brace with the 6 screws using the electric screwdriver.\nSecure the TCAs within the PCM support fins with the elastic band provided by stretching it around the fins of the PCM at the level of the rubber gaskets (Figure 6).\nPosition the O2 Detector on the detector stand so that the face of it rests against the fins of the PCM. Check that the LED/photodetector pairs line up with the O2-sensitive dye in the tissue chambers. If needed, adjust the O2 detector lateral guides after loosening the set screws on the side of the O2 detector holder.\nPlace the lid on top of the Enclosure.\nEquilibrating the gas in the head space in the MRM with the perifusate\n\t\nWith the high-pressure valve fully secured and closed, open the gas tank valve by turning the cylinder valve on top of the tank counterclockwise.\nAdjust the high-pressure regulator to a pressure of 10 psi using the knob on the regulator.\nPressurize the MRM by setting the low-pressure regulator to 1.0 psi (Figure 7A).\nUnclamp the purge tube (Figure 7B) to allow the gas from the tank to replace the air in the MRM headspace (the test compound injectors remain clamped) for 15 min. Confirm gas flow by submerging the end of the purge tube into a beaker of water to observe bubbling.\nOnce flow has been confirmed, start the O2 detector as described below in section 3.8.",
    "After 15 min, turn the stirrer on at 70 rpm and leave running for the rest of the experiment. After an additional 15 min, clamp the purge tubing assembly (Figure 7C).\nLower the pressure on the low-pressure regulator to the operating pressure that achieves the desired liquid flow rate (as specified by the experimental pack - usually between about 0.5-0.7 psi). If the flow rate is above 20 µL/min temporarily set the pressure to 0.3 psi to allow time to load the tissue without the chambers overflowing. This is not necessary if the tissue is loaded within 15 min of the clamp being placed.\n\t\tNOTE: Do not let buffer run down the outside of the tissue chamber, since the fluid can interfere with O2 sensing.\nStarting the O2 detector\n\t\nActivate the O2 detector software on the laptop by clicking on the icon labeled Oxygen Detector.\nOnce the program opens (Supplementary Figure 2), confirm the correct COM port is selected. If needed, the COM port may be identified by unplugging and plugging the O2 detector from the computer so that the port number is displayed. If the COM port is unplugged while the application is running, then the application must be closed and reopened before use.\nClick Start then Record (and save the data in the backup folder). Next, click Graph.\nChange the average value on the bottom left of the lifetime graph to 5 (which instructs the program to calculate a moving average with 5 consecutive points). After a minute has passed and the first data point is displayed on the graphing screen, click Auto Scale.\n4. Tissue loading and equilibration period (Time: 90 min)\nPositioning the frits in the tissue chambers\n\t\nRemove the lid and middle sections of the enclosure.",
    "After the perifusate in the tissue chambers have risen above the top of the pre-positioned frit, push the frit down with the frit cue by lightly tapping on the top of the frit to remove any air bubbles that formed below or within the frit.\nPosition frits about 0.25 inch above the bottom of the tissue chamber.\nLoading tissue into the tissue chambers\n\t\nOnce the level of media is 0.5 inch from the top, load the tissue into the chamber.\nLoading Retina or RPE-choroid-sclera: Harvest Retina or RPE-choroid-sclera as described in 6. To load the tissue, use fine point forceps to gently place the tissue into each chamber, being careful not to fold the tissue, while using a tissue wipe to prevent liquid from the tissue chamber dripping onto the O2 sensor. Observe tissue sinking toward and onto the frit.\n\t\tNOTE: Between the time of harvesting the tissue and loading tissue into the chambers, ensure that trauma to the tissue is avoided by not leaving the tissue in a bicarbonate-based buffer/media out of the incubator for more than 10 min and ensuring the tissue is bathed in enough buffer/media (at least 1 mL/10 mg of tissue) to keep the tissue from becoming hypoxic and preventing exposure to air.\nLoading RPE cells on transwell membranes: Prepare RPE cells as described previously 12 and in Supplementary File 1. Passage cells using 0.25% trypsin-EDTA and seed on polyethylene terephthalate, track-etched filters (cell culture inserts, pore size 0.4 mm) at a minimum of 2.0 x 105 cells/cm2. On the day of the experiment, cut the membranes into three strips of equal width and load with forceps into the tissue chambers (see Figure 8A).\nAttaching the outflow tubing assemblies to tissue chambers",
    "Remove the outflow tubing assemblies from the packaging and place the outflow tubing separator on the lip of the middle section of the enclosure so the outflow tubing adapters are on the inside of the enclosure (Figure 8B,C).\nBeing careful not to push too hard on the TCAs (or they will come loose from the MRM), attach the outflow tubing adapters onto the top of the tissue chambers TCAs (Figure 8D). Replace the middle of the enclosure and reconnect the ambient temperature control cable.\nPrior to replacing the lid of the enclosure, confirm that the components of the fluidics system inside the enclosure including the O2 detector, PCM, tissue chambers, outflow tubes, MRM and heater, are all positioned properly as shown in Figure 8E.\nReplace the lid of the enclosure. Feed the eight outflow tubes through the fraction collector guide arm.\nActivating the fraction collector\n\t\nMake sure the fraction collector is centered relative to the right wall of the enclosure and the outflow tube holder: the left support of the fraction collector base should rest against the edge of the enclosure wall.\nOn the laptop, click the UI shortcut and the experimental info page will open (Supplementary Figure 3 Top).\nFill in the information in the appropriate boxes on the experimental info page (this can be done prior to the experiment start) and then click the Flow & Fraction Collector page on the top (Supplementary Figure 3 Bottom).\nSetting parameters for automated flow rate measurement\n\t\nSelect the desired integration time in the sample acquisition time drop-down menu on the top middle that balances the desired accuracy (which is proportional to integration time) and the temporal resolution.",
    "If no outflow fractions will be collected in the experiment, then click Start and go to section 4.7. If outflow fractions will be collected, then carry out steps in section 4.6.\nCollecting outflow fractions\n\t\nIn the UI software, check the Collect fractions? box on either the experiment info page or the flow & fraction collector page. Then click the Compute FC Settings button.\nWhen the new window opens, fill in the time of the first injection in the protocol (defined as time = 0) and the flow rate per channel, as well as the time intervals for each sample. Then, click Compute.\nOnce the intervals of the collection are verified, click on Generate and Start.\nMeasuring flow rates for individual channels (Optional)\n\t\nIf flow rates of individual channels are to be measured (which under normal conditions vary by only a few percent), weigh eight (or less) microcentrifuge tubes, and record their weight.\nSet the tube holder containing the pre-weighed microcentrifuge tubes on the plate carriage. Click Measure Flow Rate Manually in the other utilities section.\nSelect the measurement duration and then click Generate Template. Close the window and click Start. The fraction collector will collect fluid from the outflow tubes for the measurement duration and then the arm will return to its home position.\nWeigh the microfuge tubes after collection and use the difference in weight divided by the measurement duration to calculate the flow rate (where 1 mg = 1 µL).\nBaseline stabilization\n\t\nOnce the tissue and/or cells have been loaded into the tissue chambers, allow the system to equilibrate for 90 min to establish a flat baseline of O2 consumption, at which time the first test compound can be injected (considered to be time = 0).",
    "At 30 min prior to the first injection, enter the average last 3 FR per channel value into the injection page for preparing test compound injections.\n5. Experimental protocol (Time: 2-6 h)\nNOTE: Once baseline stabilization is underway, the next tasks are injecting the test compounds and changing plates on the fraction collector if more than one will be used.\nPreparing test compound injectate\n\t\nEnter the names of the compounds, desired concentrations (final and stock solutions), and injection times of the test compounds into the table in the UI on the Injection page. Confirm the information displayed in the program including volumes in the MRM left at the time of the injections and how much stock solution to inject to achieve the desired concentrations (Supplementary Figure 4).\nTo calculate how much perifusate and stock are needed for the injection, fill in the white boxes of the injection table and click Compute. Using the calculated values, dilute the test compound stock solution with perifusate prior to injection so that the volume injected is 5% of the volume in the MRM after injection.\nPrepare each test compound by mixing the stock solution and perifusate. Load the syringes for at least 10 min prior to the injection time and keep in a CO2 incubator (maintained at temperatures between 37-40 °C) until ready to inject.\nInjecting test compounds\n\t\nConnect the syringe containing the test compound to the injection lines (Figure 9A). Unclamp the soft-walled pharmed tubing leading to the injection line and slowly inject test compounds (Figure 9B) at a rate of approximately 3 mL/min. Re-clamp the tubing on the injection line and then remove the syringe (Figure 9C); repeat for the other side of the MRM.",
    "After injecting each test compound, prepare each subsequent test compound to be injected according to the UI injection page.\nDetermining inflow O2 signal for each channel\n\t\nAt the end of every experiment, inject the respiratory inhibitor KCN (3 mM) to determine the inflow lifetime signal for each channel which is used to correct for the variation in baseline sensor lifetime and non-mitochondrial consumption of oxygen.\n6. Ending the experiment and breaking down the system (Time: 30 min)\nSaving oxygen data\n\t\nClick the Save button on the top left of the graphing window on the oxygen detector software; name the file and store it in the folder where the file will be kept. Click the Stop Recording button on the main window to save the backup file.\nSaving the UI experimental info file\n\t\nClick the Save profile button on the top left of the UI's general page; name the file and store it into the folder where the file will be kept. On the fraction & flow page of the UI, click the Tools drop down menu and then Save. Keep the generated name or choose another and store the file where desired. If necessary, there are backup files which can be accessed and saved.\nBreaking down the instrument\n\t\nSince KCN is volatile, dispose of fluidics assemblies in a fume hood; pour media from MRM and FC waste tray into a waste container, and rinse the MRM inserts and stir bars thoroughly with water. Pour the contents of the waste container (containing KCN) into a labeled chemical waste container for subsequent disposal by chemical safety. Prior to the next experiment, thoroughly clean and autoclave the stir bars and forceps.\n7. Data processing (Time: 15-45 min)",
    "Open the data processor application on a Mac or PC computer. Select the .csv data file generated by an experiment. If this experiment's protocol is similar to a previously analyzed experiment, then select that settings file and click Next Step. Otherwise just click Next Step to begin entering the experiment's settings.\nFill in the various settings of the experiment. On the determination of reference time point, select the time point directly before the KCN went into effect and the Lifetime values decreased. Select this point with the use of a slider or by typing the time value into the box.\nClick Calculate to generate OCR graphs according to equation 2:\n\tOCR = ([O2]in- [O2]out) x FR = (217 nmol/mL - [O2]out) x FR/tissue basis (Eq. 2)\n\twhere O2 concentration in KRB when in equilibrium with 21% O2 at 37 °C is 217 nmol/mL, FR is the flow rate (in mL/min), tissue basis is the amount of tissue loaded into the chamber (i.e., number of retinas, RPE-choroid-sclera or RPE cells).\nSave the graphs as .pdf files by pressing the Export Graph button. Graph OCR as either absolute values, or as a fraction of a steady state value by checking the boxes that correspond to the test compound to be set to 1 in the edit settings page.\n8. Assays of outflow fractions\nIf samples cannot be assayed immediately after the experiment, place the plates at 4 °C if assayed the next day, or frozen if stored longer. If plates are frozen, then thaw samples at 4 °C (so that samples remain cold).",
    "Once assays are performed on the selected outflow fractions, the columns of data (one per channel) are entered into a .csv file with time (in min) in the leftmost column, and concentration in the right (in either nmol/mL or ng/mL); a link in the data processing program when pressed uploads a template.\nUpload this file into the data processor to calculate and plot the data."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}