{
  "id": 18895,
  "origin_website": "Jove",
  "title": "Computerized Dynamic Posturography for Postural Control Assessment in Patients with Intermittent Claudication",
  "procedures": [
    "Participants were outpatients of a vascular surgical unit at a local teaching hospital and gave informed consent to participate in this study. The study was approved by the NHS Local Research Ethics Committee (REC reference: 07/Q1105/12) and the protocol complied with the IRB guidelines of the University of Hull. All participants completed the Sensory Organization Test and Motor Control Test on the EquiTest. Ankle brachial pressure index was measured preexercise to categorize disease severity.\n1. Ankle Brachial Pressure Index (ABPI) Measurement\nAllow the participant to rest in the supine position for at least 5 min before the ABPI measurement is taken.\nAdjust a standard sphygmomanometer cuff over the brachial artery above the elbow and the dorsalis pedis and posterior tibial arteries above the ankle. Rapidly inflate the cuffs to 20 mmHg above the audible systolic pressure before deflating at a constant rate of 2 mm/sec.\nRecord the systolic pressure as the pressure at which the first sustained systolic pressure is audible. Then using a hand-held Doppler probe (5-8 MHz), measure the systolic pressures of the dorsalis pedis and posterior tibial arteries.\nCalculate ABPI with ankle systolic pressure as the numerator, over the brachial systolic pressure as the denominator.\nNote: There are several methods currently used to determine the numerator value of the ABPI. The American Heart Association advocates using the higher systolic pressure of the two leg arteries for the numerator12 which is what we used, while another method reported in the literature states using the lower systolic pressure13. A third method recommends using the average systolic pressure from the dorsalis pedis and posterior tibial arteries13.\n2. Equipment Setup",
    "Ensure the area surrounding the EquiTest is free of obstructions and remove any object from the dual force plates and turn on the EquiTest system. Complete the dual force plate support surface and visual surround calibration.\nNote: Movement of the force plates occurs along an x- and y-axis. The dual force plates first translate forwards and backwards about the y-axis, which is parallel to the floor, at a maximum linear velocity of 15.24 cm/sec. They then rotate about the x-axis, so as to facilitate ankle dorsiflexion (toes up) and plantarflexion (toes down), at a maximum angular velocity of 50°/sec (0.87 rad/sec). The visual surround tilts forwards and backward about the x-axis at a maximum angular velocity of 15°/sec (0.26 rad/sec) across a range of ±10°. Four force transducers in two independent force plates measure vertical forces for each limb; a fifth transducer, beneath the pin joint that connects the two force plates, measures shear force overall.\nEnter the participant information (e.g. age and height) into the software program. Indicate their age and height accurately.\nNote: The participant's results will be compared against an age-matched normative dataset (20-59, 60-69, 70-79 years). Height will allow for the magnitude (small, medium, and large) of the backwards and forwards force plate translations to be scaled according to their height.\nChoose whether to turn the display screen within the visual surround on or off.",
    "Note: If the display screen is turned on, the participant will get real-time visual biofeedback about their COG movement, which may be useful for practice sessions or when the operator wants the participant to see their score. The results from each trial are processed upon completion of the trial and displayed as green or red bars. Green bars indicate the participant performed better than the age-matched normative data, while red bars indicate their performance was worse.\n3. Participant Preparation\nRequest that the participant wears comfortable loose clothing and removes their shoes for tests on the EquiTest. Have the participant put on the safety harness, while securing the long straps through their legs and fastening the waist buckle.\nPosition the participant onto the dual force plates and clip the karabiner from the safety straps into the D-rings of the security harness.\nNote: The participant is now securely fixed to the safety bar (via the safety straps) which will prevent them from actually falling, should they lose their balance (or feel like they are going to lose their balance) during the testing.\nCenter the participant's feet on the support surface: position the medial malleolus of each foot over the blue horizontal line, so that the ankle joint is aligned with the transverse rotational axis, and position the lateral side of the calcaneous according to the S, M, or T surface markings. Adjust the tension on the safety straps so they are neither too slack nor too taught.",
    "Note: According to the participant's height, small ranges from 76-140 cm, medium from 141-165 cm, and tall from 166-203 cm (Figure 1A). Backwards and forwards movements of the support surface (dual force plates) occur along the y-axis, while side to side movements on the support surface occur along the x-axis. The dual force plates can rotate about the x-axis, which represents the transverse axis of the ankle joint. When the participant is standing with ankles over the blue horizontal line and with feet equidistant laterally from the center line (y-axis) according to the S, M, or T markings, their center of gravity should be located directly above the x- and y-axis intercept. This position acts as a reference point for the calculation of sway angles\nAsk the participant to stand upright, with their hands at their sides, looking straight ahead at the visual surround. Request they refrain from moving their feet for the duration of the test (Figure 1B).\nNote: If the feet are correctly positioned, the center of gravity (COG) display should illustrate the stick figure at the intersection of the x- and y-axis. However, if the stick figure is misaligned and the feet are correctly positioned (according to the instructions above), do not readjust the feet.\n4. Sensory Organization Test (SOT)\nComplete Conditions 1-6 on the SOT protocol.",
    "Note: The SOT consists of 6 conditions, each comprised of 3 trials lasting 20 sec each. In Conditions 1 and 2, the participant stands quietly with eyes open and closed, respectively. This establishes whether sway increases when visual cues are removed and determines how effectively the participant makes use of somatosensory input. In Condition 3, the participant stands with their eyes open; the visual surround is sway-referenced and visual cues become inaccurate. In Condition 4, the support surface is sway-referenced; thus somatosensory cues become inaccurate. Condition 5 is performed with eyes closed and a sway-referenced support surface. This determines how the participant makes use of vestibular cues when visual cues are removed and somatosensory cues are inaccurate. Finally, in Condition 6, the visual surround and support surface are both sway-referenced, which identifies if the participant relies on visual cues even when they are inaccurate. The SOT conditions are graded in difficulty. The first 3 conditions are performed on a static support surface, while the last 3 conditions use a dynamic support surface.\nEvaluate the score after each trial (a green or a red bar will appear displaying the participant's Equilibrium score relative to the age-matched normative dataset). Interrupt any trial at any time if the participant looks like they require assistance.\nMark any trial where the participant takes a step, touches the visual surround or starts to fall as a loss of balance (LOB). Allow the participant to rest in between trials if necessary and accurately reposition feet afterwards.",
    "Allow the software to compute the results for the following variables of interest: Equilibrium score - an overall indicator of balance; Strategy analysis - an indicator of ankle vs. hip strategy dominance; Sensory analysis - an indicator of which sensory system is used to maintain balance (i.e. somatosensory, visual, vestibular or visual preference); and initial COG alignment prior to onset of each trial. Equilibrium score is computed according to Equation 1, where 12.5° represents the maximum normal postural sway in the anterior-posterior direction; θ represents the participant's s calculated maximum anterior-posterior COG displacements14. A score of 100 represents perfect stability; a score of 0 indicates a loss of balance.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51077/51077eq1.jpg\nStrategy score represents the peak-to-peak amplitude of the shear oscillation relative to the maximum possible shear force of 25 lbs (11.4 kg), where 25 lbs is the difference between maximum and minimum shear force generated by individuals who only used the hip strategy to maintain balance on a narrow beam (Nashner, unpublished data; cited in EquiTest System Operator's Manual)14. A score near 100 indicates a full ankle strategy; a score near 0 indicates a full hip strategy with maximum shear force. The Sensory analysis computes four sensory ratios by using the average Equilibrium scores from specific pairs of sensory test conditions. These are:\nimgsrc://cloudfront.jove.com/files/ftp_upload/51077/51077eq2-5.jpg\nInitial COG alignment is determined as the average anterior-posterior COG position in the preceding half second before each SOT trial.\n5. Motor Control Test (MCT)\nComplete all 6 conditions on the MCT, including 3 forwards and 3 backwards translations that are graded in magnitude (small, medium, and large).",
    "Note: Small translations represent a threshold stimulus, while large translations require the participant to produce a maximal response. Medium translations are in between the two ends of the spectrum. Each condition is performed 3x, with a random delay of 1.5-2.5 sec in between. The horizontal displacement of the support surface during each translation is scaled according to the participant's height.\nEnsure the feet are positioned precisely on the support surface according to the above instructions. Perform the trials in the standardized order (first backwards, then forwards translations). Interrupt any trial if necessary and record a loss of balance as above.\nNote: The full MCT takes approximately 5-10 min to complete without rests. Allow the software to compute the results for the following variables of interest: Weight symmetry - weight bearing distribution in the left vs. right limbs prior to the onset of a translation as measured by the force transducers; Latency - time lapse (in milliseconds) between the onset of support surface translation and the participant's active force response, measured for each limb independently; and Amplitude scaling (or Relative response strength) - strength of the participant's active force response to arrest the angular momentum imparted to the body during the backwards and forwards translations. The response strength is measured for each leg independently in units of angular momentum (degrees/second) and normalized to body height and weight.\n6. Participant Debriefing\nAssist the participant down from the platform following the completion of the SOT and MCT. Discuss the implications of their findings by explaining how they performed overall on the SOT and MCT.\nIf appropriate, discuss or refer the participant to a balance training program with qualified supervision if they scored poorly on any of the tests. Recommend further medical investigations if the participant scored poorly on any of the sensory scores.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}