{
  "id": 12086,
  "origin_website": "Jove",
  "title": "Modeling Breast Cancer via an Intraductal Injection of Cre-expressing Adenovirus into the Mouse Mammary Gland",
  "procedures": [
    "All methods described here have been approved by the Institutional Animal Care and Use Committee (IACUC) of Brigham and Women’s Hospital.\n1. Generation and maintenance of floxed mice\nObtain breast cancer-relevant floxed conditional knockout (e.g., Trp53tm1Brn [referred to as Trp53L/L], Brca1tm1Aash [Brca1L/L]) or conditional knock-in mouse lines (e.g., Gt(ROSA)26Sortm1(Pik3ca*H1047R)Egan) from The Jackson Laboratory (JAX) or NCI Mouse Models of Human Cancer Consortium (MMHCC) repository. In addition, to facilitate the chasing of MECs that undergo Cre-mediated recombination, a conditional Cre-reporter line can also be obtained from JAX (e.g., Gt(ROSA)26Sortm1(EYFP)Cos [referred to as R26Y]).\nBreed Trp53L/L homozygous mice with R26Y homozygous reporter mice or with homozygous mice carrying the R26Y reporter alleles and any additional floxed conditional knockout or knock-in alleles for different mouse models, to obtain heterozygous F1 male and female progeny.\nIntercross heterozygous F1 male and female mice to obtain F2 compound female mice that are homozygous for each allele (as experimental mice), as well as R26Y-only homozygous females (as control mice). Genotype F2 mice based on the PCR primers and cycling conditions listed below, by setting up two standard 20 µL PCR reactions (using Taq 5X Master Mix) in two different PCR tubes, one with the R26Y primers and the other with the Trp53L primers. Use adult mice (typically around 2–4 months of age) for all breeding.\n\t\nFor R26Y, perform PCR at 94 °C for 3 min, then at 94 °C for 30 s, 60 °C for 30 s, and 72 °C for 1 min for 35 cycles, followed by 72 °C for 3 min, and maintaining at 14 °C. Use primers (i) R26YFP-1: AAA GTC GCT CTG AGT TGT TAT; (ii) R26YFP-2: GCG AAG AGT TTG TCC TCA ACC; (iii) R26YFP-3: GGA GCG GGA GAA ATG GAT ATG.",
    "NOTE: A single PCR band of 250 bp indicates an R26Y homozygote, a single PCR band of 500 bp indicates a wild-type (WT), and two PCR bands (R26Y: 250 bp, WT: 500 bp) indicate an R26Y heterozygote (Figure 1A).\n\t\tFor Trp53L, perform PCR at 94 °C for 3 min, then at 94 °C for 30 s, 60 °C for 30 s, and 72 °C for 1 min for 35 cycles, followed by 72 °C for 3 min, and maintaining at 14 °C. Use primers (i) p53F2-10 1F: CAC AAA AAC AGG TTA AAC CCA G; (ii) p53F2-10 1R: AGC ACA TAG GAG GCA GAG AC.\n\t\tNOTE: A single PCR band of 370 bp indicates a Trp53L/L homozygote, a single PCR band of 288 bp indicates a Trp53+/+ WT, and two PCR bands (WT: 288 bp, Trp53L: 370 bp) indicate a Trp53L/+ heterozygote (Figure 1B).\n2. Preoperative preparation\nAutoclave all surgical tools 1 day before the surgery.\nPrepare 0.1% bromophenol blue in phosphate-buffered saline (PBS) and store it at 4 °C. Dilute the Ad-Cre that will be used for the intraductal injection in DMEM medium with 0.01 M CaCl2 and bromophenol blue at a ratio of 1:10 (i.e., the injection mixture).\n\tNOTE: The Ad-Cre used here was obtained from the University of Iowa Viral Vector Core, with a stock viral titer of ~1010–1011 pfu/mL.\nAnesthetize the female mouse (F2 generation as described in step 1.2, age ranging from 3–4 weeks of age to adult) using an isoflurane chamber and apply eye ointment. During the procedure, anesthetize the mouse continuously by ensuring it inhales 1%–2.5% isoflurane in oxygen. Check the depth of anesthesia at least every 15 min by performing a toe pinch. Carefully monitor the mouse for any change in respiratory rate, adjusting the level of isoflurane accordingly, if needed.",
    "Inject meloxicam as analgesia subcutaneously at a dose of 5 mg/kg, prior to the surgical procedure.\nExpose the nipple surgical site by applying several drops of hair removal cream; remove excessive cream and loose hair using soft paper towels.\n\tNOTE: Perform this step in an area separate from where the surgery is to be performed. Shaving is not recommended in order to avoid damage to the nipples. Use caution to remove chemical depilatory agent in a timely fashion. Leaving the agent on for too long may result in chemical burn to the skin\nDisinfect the surgical site with iodophors first, followed by 70% alcohol, and end with a final application of scrub iodophors. Do this in a circular motion from the center of the work area toward the periphery using a gauze sponge or cotton-tipped applicator. Repeat the cycle 3x–4x.\n3. Intraductal injection\nUse aseptic techniques throughout the surgical procedure.\nMake an incision site on the skin at a length of ~1 cm between the two fourth inguinal MGs (Figure 2). Carefully separate the skin flap (with the MG) from the parietal peritoneum so as to visualize the mammary ductal tree.\nCarefully hold the nipple with Watchmaker’s forceps and remove the exterior nipple without cutting any nearby skin, using a micro-dissection scissor.\nLoad ~3–5 µL of Ad-Cre injection mixture into a 25 µL Hamilton syringe with a 33 G metal hub needle affixed. Estimate the volume of the injection mixture in the syringe based on the blue dye included in the mixture.\n\tNOTE: Use a smaller volume (e.g., 3 µL) when injecting into MGs of 3–4 weeks old females and a larger volume (e.g., 10 µL) when injecting into MGs of lactating females.",
    "Gently hold the edge of the skin flap with a fine curved tweezer and inject the Ad-Cre injection mixture slowly into the nipple, meanwhile monitoring the spreading of blue dye into the mammary ductal tree. Maintain the injection rate as low as possible to avoid damage to the ductal lumen.\n\tNOTE: Injected fluid (as illustrated by the included bromophenol blue dye) spreading throughout the entire ductal tree without leaking into the stromal compartment indicates a successful intraductal injection.\nGently withdraw the needle from the nipple to avoid any leakage of the injected fluid.\nExamine the distal side (i.e., away from the nipple) of the MG or the surrounding area of the injected nipple. Note that swelling blue dye (i.e., dye diffusing into the nearby stroma) indicates a mammary fat pad injection rather than a successful intraductal injection.\nClose the surgical wounds (from step 3.2) in the skin with wound clips.\n4. Postoperative care\nRemove the mouse from the anesthesia and place it on a heating pad inside a clean cage for recovery.\nAdminister meloxicam subcutaneously at 5 mg/kg again, 24 h after the surgery.\nMonitor the general conditions of the animal and look for signs of infection at the incision site for 5 days.\nWound clips are removed ~7-10 days after surgery.\n5. Monitoring the development of the mammary tumor\nMonitor the injected mice twice weekly by palpation for any sign of mammary tumor development.\nOnce the tumor is palpable, monitor the mouse daily and measure the tumor size until it reaches the experimental endpoint, as determined by the size (e.g., reaching 10%–15% of the mouse’s body weight) or condition (e.g., ulcerated or necrotic) of the tumor, or by the general health condition of the mouse (e.g., comatose, moribund).",
    "Euthanize the mouse by carbon dioxide asphyxiation, followed by a secondary method (e.g., cervical dislocation).\nIsolate the mammary tumor tissues and analyze them by flow cytometry, immunofluorescence, or expression profiling (e.g., by RNA sequencing [RNAseq] or microarray), as described previously12.\nPerform flow cytometric analysis by gating for lineage-negative cells (Lin-: negative for lineage markers CD45 [leukocyte marker], CD31 [endothelial cell marker], and TER119 [erythrocyte marker]), and analyze the cells in the tumor based on their expression of YFP, CD24, and CD29.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}