{
  "id": 7187,
  "origin_website": "Bio",
  "title": "A Sensitive and Specific PCR-based Assay to Quantify Hepatitis B Virus Covalently Closed Circular (ccc) DNA while Preserving Cellular DNA",
  "procedures": [
    "Sample preparationSeed 2.5 × 105 cells per well in a 24-well format in growth medium one day before infection.Infect cells overnight with HBV virus stock in infection medium containing 4% PEG 8000 (Ni et al., 2014).Wash cells twice with PBS at room temperature (RT) and maintain in infection medium until desired harvest time.Wash cells with 500 μl PBS at RT and add 100 μl trypsin.Incubate at 37 °C until the cells detach (~5 min).Resuspend the cells with 900 μl cold medium and transfer to a 1.5 ml Eppendorf tube.Centrifuge for 5 min at 500 × g at RT and remove the supernatant.Optional: Freeze the pellet at -20 °C until further use. Extract total DNA from the cell pellets using NucleoSpin® Tissue kit according to the manufacturer’s instructions, but elute in 50 μl elution buffer pre-warmed to 70 °C.Inversion reactionClean a silicon sealing mat using the DNA Zap solutions, rinse in deionised water, and let dry on a paper towel.Prepare the restriction digestion reaction in a 96-well plate containing 10 µl of extracted total DNA, 2 µl of 10× Cutsmart buffer, 0.5 µl HhaI, 0.25 µl RecJf, and 7.25 µl H2O.Mix by pipetting up and down 10 times with a multichannel pipette, taking care to avoid generating bubbles.Seal with the clean and dry silicon mat.Run the following program in a thermo cycler: 3 cycles of 15 min at 37 °C and 15 min at 42 °C, 20 min at 80 °C, and hold at 16 °C.Remove the mat carefully and add 10 μl of the ligation mix.Mix by pipetting up and down 10 times with a multichannel pipette, taking care to avoid generating bubbles.Incubate in a thermo cycler at 16 °C for 2 h, 80 °C for 20 min, and hold at 16 °C.",
    "Remove the mat carefully and add 5 μl of the linearization mix.Mix by pipetting up and down 10 times with a multichannel pipette, taking care to avoid generating bubbles.Incubate in a thermo cycler at 37 °C for 60 min, 80 °C for 20 min, and hold at 16 °C.Optional: Store samples at -20 °C. Droplet generation and readingDilute the sample 2.5-fold by adding 52.5 μl H2O.Mix by pipetting up and down 10 times with a multichannel pipette, taking care to avoid generating bubbles.Prepare two reactions for each sample: (1) cccDNA and RNaseP cellular control and (2) total HBV DNA and RNaseP cellular control. Prepare ddPCR mix in a 96-well plate (22 μl per reaction) (see Table 1).Table 1. ddPCR mix composition for each reaction table:",
    "﻿0,1,2\nReagent,Concentration,μl\nddPCR Supermix for probes,2×,11\nTaqManTM Copy Number Reference Assay (VIC-labelled RNaseP),10×,1.1\nForward primer (cccDNA or total HBV DNA),100 μM,0.033\nReverse primer (cccDNA or total HBV DNA),100 μM,0.033\nFAM-labelled probe (cccDNA or total HBV DNA),100 μM,0.033\nH2O,,4.5\nDiluted template,,5.5\nUse microplastic-free Rainin tips. Generate droplets on the ddPCR droplet generator:Add 20 μl of the ddPCR mix to the sample chambers of a cartridge.Add 70 μl of droplet generation oil using a multichannel pipette in the oil chamber.Attach the rubber gasket, place the cartridge in the droplet generator, and run the droplet generation.Gently transfer 42 μl of the generated droplets using a multichannel pipette to a TwinTec 96-well plate.Repeat Steps C4a to C4d until all samples are loaded into the TwinTec 96-well plate.Seal the plate with an aluminum foil seal using the plate sealer.Directly after sealing, run PCR in deep-well PCR machine with the following program: 10 min at 95 °C; 40 cycles of 10 s at 95 °C, 15 s at 54 °C, and 20 s at 68 °C; 10 min at 95 °C, and hold at 12 °C.Transfer the TwinTec 96-well plate to the QX200 Droplet Reader.Set up template using the Quantasoft software (as per manufacturer’s user guide), reading droplets using channels for FAM (Channel 1) and VIC (Channel 2).Define thresholds for positive and negative droplets based on positive and negative controls, after which the software will automatically quantify values for cccDNA per RNaseP and total HBV DNA per RNaseP."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}