{
  "id": 11113,
  "origin_website": "Jove",
  "title": "Imaging of Biological Tissues by Desorption Electrospray Ionization Mass Spectrometry",
  "procedures": [
    "1. Tissue Sectioning\nStore flash-frozen, whole tissue in -80 °C freezer until ready for sectioning.\nAllow the tissue sample to reach the temperature in the cryomicrotome prior to sectioning (30 min). Set the blade and sample temperature to -30 °C.\nOnce tissue has reached the temperature, handling the specimen with tweezers, cut front or back of brain depending on what part of the brain is of interest for sufficient mounting surface (i.e. if the front of the brain is of primary importance, mount rear of brain on chuck).\n\t\nApply ~0.5 ml Optimal Cutting Temperature Compound (OCT, Tissue-Tek, Sakura) to chuck in center and, using tweezers, hold sample in place in OCT until it solidifies. Once OCT is completely frozen, mount chuck in sample holder.\nA minimal amount of OCT used to mount the sample is preferred (in contrast to mounting the specimen in a block of OCT as is commonly done in other histological procedures) to minimize the contamination of the sample. Contamination of the sample by OCT is detrimental to the DESI and imaging process due to ion suppression.\nTypical tissue sections necessary for MS imaging range from 12-18 μm in thickness. Section tissues at desired thickness within the recommended range. Thaw-mount each sectioned tissue by lightly touching a room-temperature microscope glass slide over section. Once a sample is mounted, use caution not to touch the tissue section as it will change the chemical distributions and compositions.\nNote: We recommend mounting two sections per slide, using one section for optimization, and the other for imaging. If sections are not for immediate imaging, store slides in -80 °C freezer in a slide box until ready for analysis.",
    "If analyzing stored sections, remove slide from freezer, immediately transfer to vacuum desiccator, and allow ~15-20 min to thaw. Leaving the specimen in the desiccator longer will dry the sample and reduce DESI efficiency. The optimization of the DESI ion source will be done with the tissue sample once it has thawed, however, in the interest of time, the period during which the sample is thawing serves as an ideal time for the initialization of the equipment.\n\t\nUsing acetonitrile with 1% acetic acid as the DESI solvent, turn on the syringe pump with a flow rate of 5 μl/min. A lower flow rate will reduce the impact spot side of the DESI spray and effective pixel size, but a higher flow rate may be necessary for sufficient sensitivity. Therefore the flow rate (typically 1-5 μl/min) should be optimized for each application and the desired sensitivity and resolution. Ensure that the syringe contains enough solvent for complete optimization and imaging at given flow rate.\nOnce the solvent appears dripping out of the source tip, turn on the nitrogen nebulizing gas with a pressure of 160 psi.\nTurn on the high voltage power supply connected to ion source applying 3,600 V.\nMount the slide on the motion stage and begin ion source and MS optimization\n2. DESI Optimization\nThe DESI system consists of a source probe (see Figure 2), a syringe and pump or alternative solvent delivery system, compressed nitrogen, translation sample stage and mount. Proceed with DESI source optimization once the mass spectrometer has been tuned for the appropriate mass range and analytes of interest.\n\t\nIf the source components have not been turned on yet, refer to sections 1.5.1-3 for directions.",
    "The variables discussed in these sections are recommended for imaging of biological tissues. However these variables should be optimized for different types of tissue or sample. Alternative solvents, flow rates, nebulizing gas pressures and voltages have been reported for imaging of biological tissues.16-18\nEnsure that initially the DESI source is not touching the glass slide, and not directed at any part of the tissue section. This will ensure that the probe isn't damaged in the initial optimization process and will not contaminate any part of the set up by coming into contact with the tissue sample.\n\t\nA good starting position is with the tip 3 mm from the sample surface and 5 mm from the MS capillary inlet, with the probe at an angle of 55° with respect to the sample surface. The inner capillary of the DESI probe should extend ~1 mm beyond the outer capillary. All of these parameters will be optimized.\nThe MS interface capillary should have a collection angle of ~15° with respect to the sample surface for optimal transfer of ions. Adjust the stage height so that the MS capillary hovers over the sample surface; the capillary should be <1 mm from the surface, as close as possible without touching.\nAlign the DESI probe in the x dimension with respect to the MS capillary inlet so that they are directly in line.\nAdjust the y and z positions of the DESI source for optimal sensitivity using the extra tissue section. Note that as the DESI probe is directed at one sample area, it will eventually desorb and ionize all of the analytes in that area and signal will gradually decrease as this occurs. Performing this step as quickly as possible is important.",
    "Therefore, throughout the optimization process, the sample needs to be moved underneath the spray head to ensure that fresh sample is being analyzed and that any changes in signal are due to source optimization, not sample depletion. However, considering that the varied chemical composition of different regions of the tissue, a direct comparison of ion intensity across the entire tissue section is not wholly accurate. The thalamus of the brain provides a reasonably large-sized area with more consistent chemical composition, but still not perfectly uniform. Alternatively, a marking of red Sharpie, which contains the dye rhodamine 6G ([M]+, m/z 443), on the glass slide away from the sample provides a strong MS response by DESI and can also be used for optimization, but given the different sample form and analyte, these conditions may still not correlate to an ideal set-up for biological tissues.\nRecommended y separation between source tip and capillary inlet: ~4 mm, recommended z separation between tip and sample surface: ~1.5 mm. Though these parameters will be slightly different for each experimental set-up.\nConsidering the geometry and angle of the probe, take into account that the y and z-dimension positions are inter-related with respect to the effective transmission of solvent and analyte-containing droplets. A change in one variable will require a subsequent modification in the other to maintain the same spray impact position and its transmission angles.\nAdjust the distance the inner capillary extrudes from the outer capillary of the source for maximum sensitivity, and minimal impact spot size. Caution: Ensure that the high voltage is OFF while making this adjustment.\nThe source geometry will be considered optimal when the maximum signal is observed.",
    "The variables optimized in sections 2.5-2.6 are inter-related, therefore the adjustment of one will inherently require the re-adjustment of the other to maintain the necessary source-sample-inlet geometry, or adjustment of conditions discussed in section 1.5.1-3.\nAdditionally, a heating element surrounding the transfer capillary to the mass spectrometer may improve sensitivity by facilitating desolvation of the charged analyte droplets produced during the ionization process. Here we use a rope heater coiled around the transfer capillary set to 100 °C.\n3. Tissue Imaging\nDuring the imaging process, the sample stage moves the sample beneath the DESI probe and MS inlet capillary and all other components remain stationary. The motion parameters of the stage should be selected based on DESI impact plume size and optimal sensitivity.\n\t\nA larger impact plume will result in a higher ion intensity, given that more sample is being desorbed, however for imaging, it will also result in a larger pixel size and thus worse image resolution.\nThe translation stage used in this experiment is home-built and controlled by a LabView program that allows for control of rastering speed and line spacing for an image of given dimensions. The stage motion control VI used in this experiment is available at omnispect.bme.gatech.edu. Alternatively, a commercially-available DESI source and stage could be used such as the 2D automated Omni Spray source from Prosolia Inc. (Indianapolis, IN USA).\n\t\nFor brain tissues a typical image size is 10 x 15 mm, and given the stage motion parameters used, the image will take approximately 3 hr.",
    "Program the LabView VI or equivalent control software for desired imaging conditions, using a stage scan speed of 80 μm/sec, and line spacing between rows of 200 μm. When using the Omni Spray source, motion parameters should be set for a scan speed of 100-200 μm/sec and a line spacing of 200 μm. Note that these motion parameters can be changed depending on the number of desired pixels in each dimension and necessary sensitivity.\n\t\t\t\nA smaller line spacing has been shown to improve the image quality, with the scan speed having less of an effect.25 However, it is significant to note that this does not necessarily indicate and improved image resolution, as that is strongly dependent on impact spot size. A slower scan speed and smaller line spacing will significantly increase the time of analysis and must therefore be optimized for each type of tissue or sample.\nWith the MS spectral acquisition set at 1 scan/sec, and the image created as 1 pixel/scan, the stage speed defines the pixel size in the x dimension, whereas the line spacing determines the pixel size in the y dimension. Although the true pixel size of the image is larger than this due to spray spreading, slower motion allows more time for desorption and detection of analytes.\nGive directory path and file name for position and time files to be recorded during images within the LabView VI.\nIn preparation for mass spectral data acquisition, calculate the total time required for imaging. The Labview program used by our group automatically provides this value, but if alternative stage control is used, this calculation is necessary for the MS data acquisition settings.",
    "When using an Omni Spray automated source and stage, each line of the image is acquired as individual runs. The time-per-line and number of lines necessary for given imaging dimensions are calculated using the Omni Spray control software to be input into the mass spectrometer software.\nEnsure that the mass spectrometer scan speed is 1 spectrum/sec, and set the instrument acquisition time to match the total time calculated.\n\t\nSet spectral scan speed to 1 spectrum/sec.\nAcquire data in PROFILE mode and ensure that the m/z range is appropriate for the species of interest. Remember that DESI also produces multiply charged analytes, as in ESI.\nSet acquisition time to match total image time given by LabView.\nPosition the spray impact spot in the top-left of the area to be imaged.\nBegin acquisition of MS data and stage motion simultaneously.\nUpon conclusion of the data acquisition, return mass spectrometer to STANDBY mode.\nTurn off high voltage of DESI source.\nTurn off nitrogen gas.\nTurn off syringe pump.\n4. Image Processing\nMass spectral data, in combination with stage time and position data saved as text files through LabView must be \"folded\" into a 2D image correlating coordinates of pixels with the corresponding spectra. The images presented here were processed using Matlab-based software that is freely available at: omnispect.bme.gatech.edu. If data are acquired using the Omni Spray source, the Firefly data conversion software is used to create the data cube for image visualization in BioMAP (www.maldi-msi.org).\nFor data acquired on the Jeol AccuTOF mass spectrometer, the recorded chromatogram must be exported in .cdf format for further analysis.\n\t\nUsing the DataManager within MassCenter, first convert acquired data to centroided data (Tools → Convert Acquistion Data to Centroid). Then export data in .cdf format by using the keyboard combination Ctrl+Shift+E followed by Tools → Export.",
    "Upload the raw .cdf mass spectral data and the two text files, position and time, to the OmniSpect website. Firefly-processed imaging data can be visualized in BioMAP.\n\t\nFurther processing of the data including statistical analysis by Non-Negative Matrix Factorization or plotting of a single ion of interest can be performed directly on the website.\nAlternatively, the raw data cube can be exported for analysis in Matlab.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}