{
  "id": 17223,
  "origin_website": "Jove",
  "title": "Point-Of-Care Ultrasound Screening for Proximal Lower Extremity Deep Venous Thrombosis",
  "procedures": [
    "All procedures performed in studies involving human participants were in accordance with the ethical standards of the Duke University Health System institutional research committee and with the 1964 Helsinki declaration and its later amendments or comparable ethical standards. The protocol was performed using inputs from the following publications3,10. Images were performed on the authors themselves for normal images and as part of routine educational ultrasound scans done for teaching purposes for positive images, with preceding verbal consent as per institutional standards. The patients were selected based on the following criteria: inclusion criteria: any patient with lower extremity pain, swelling, or other clinical reason to suspect DVT; exclusion criteria: patients with a lower extremity amputation who may be missing the popliteal or distal femoral views.\n1. Transducer selection\nSelect the high-frequency linear transducer (5-13 MHz) for the DVT scan to ensure a high-resolution image of the veins.\n\t​NOTE: In obese patients or, occasionally, for the popliteal vein, DVT scanning with a low-frequency curvilinear (2-5 MHz) transducer is necessary to have adequate penetration and depth. However, patients challenging enough to require a low-frequency transducer generally fall outside the scope of point-of-care ultrasound training and usually warrant a comprehensive radiology ultrasound.\n2. Machine settings\nSetting the depth, gain, and focus\n\t\nSet the depth so that the target vessels appear in the middle 1/3 of the ultrasound screen by pressing the up or down depth button (between 3-6 cm).\nSet the gain so that the vessels contain a few spots of grey but are otherwise black by pressing the right or left gain buttons (MIS between 0.6-0.8, TIS 0.1).",
    "If the machine has the capability, aim the focus beam at or slightly below the level of the target vessels by clicking the box on the screen and moving it while holding down the button, and then release.\nSet the machine mode. Click on B-Mode, which is a 2-dimensional (2D) greyscale ultrasound exam. Use B-mode to obtain both the non-compressed and compressed images.\n\tNOTE: If the B-mode images are ambiguous, providers trained in color and spectral Doppler can consider adding these techniques, but they are not classically included in lower extremity POCUS DVT protocols.\nFor optimal scanning ergonomics, place the machine with the ultrasound screen in direct line of sight with the ultrasound probe.\n3. Patient position\nBefore scanning, expose the patient's entire leg from the groin to the knee.\nPlace the patient in the supine position as this is the ideal view for DVT examination of the common femoral and femoral veins. Place the patient in the frog-leg position (external rotation at the hip with knees slightly bent) to enable better visualization and scanning of the distal veins.\n\t​NOTE: The popliteal veins can also be assessed with either a frog-leg position or with slight flexion of the knee. Although lateral decubitus and prone positioning might improve visualization (particularly for patients with a higher body mass index), they may not be feasible in all situations (e.g., in critically ill patients or intra-operatively).\n4. B-mode scanning\nGroin and thigh: Apply gel to the patient's skin in a linear path that traces out the expected path of the ultrasound transducer to increase the efficiency of motion for performing the examination of this part.\nKnee: Apply gel to the transducer itself, as a generous application of gel will facilitate the scanning efficiency.",
    "Transducer orientation: Place the transducer in a transverse position with the orientation marker directed toward the patient's right side to ensure that images captured during scanning correspond to the anatomical direction of the structures.\nPlace the probe perpendicular to the path of the vein to visualize the vein in a short-axis view. Center the venous structure on the screen. Add long-axis imaging in ambiguous cases by rotating the probe 90° so that the marker points toward the patient's head.\n5. Scanning and compression technique\nCompression sequence: Begin scanning immediately caudal to the inguinal crease, progress distally sequentially with downward compression, and then release at each point as shown in Figure 13,10.\n\t\nCompress such that the entire vein collapses, with the anterior wall touching the posterior wall, while the artery remains pulsatile. Do not apply resting surface pressure between each compression as it can obscure the visualization of the veins. The vein should collapse fully when enough pressure is applied with the transducer to indent an adjacent artery.\nClick Save Clip and compress and then release at the common femoral vein (CFV) and femoral artery (FA) just below the inguinal ligament.\nSlide the probe distally about 1 cm and record the same compression and release technique at the CFV and FA at the intake of the great saphenous vein (GSV).\nClick Save Clip, then compress, and release the probe at the CFV at the bifurcation of the FA into the superficial femoral artery (SFA) and deep femoral artery (DFA). Between the SFA and DFA, there will typically be a lateral perforator vein draining from lateral-to-medial into the CFV. Ensure that both the lateral perforator vein and GSV are compressible.",
    "NOTE: Though these are superficial veins, clots in these locations have the potential to embolize, resulting in the same life-threatening complications as caused by DVTs.\nClick Save Clip, then compress, and release the probe at the CFV at the bifurcation of the CFV into the femoral vein (FV) and deep femoral vein (DFV).\nClick Save Clip, then compress, and release the probe at the CFV at the popliteal vein behind the knee.\nOnce points 1-5 (as in Figure 1) are all fully compressible, scan the FV along the thigh from proximal to distal until the vein disappears in the adductor canal. During this scanning process, attempt to compress the vein approximately every 1-2 cm.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}