{
  "id": 6989,
  "origin_website": "Bio",
  "title": "Fluidigm Based Single-cell Gene Expression Library Preparation from Patient-derived Small Intestinal Organoids",
  "procedures": [
    "Part I: Crypt isolation and epithelial organoid culture Procedure to isolate and culture small intestinal organoids from patient-derived biopsy samplesSmall intestinal enteroscopic biopsy samples are obtained from patients undergoing evaluation for diseases such as small intestinal tumors, occult bleeding, or Crohn’s disease. Up to 8 biopsies from each patient are taken from a region approximately 100 cm proximal to the ileocecal valve. The Ethics Committee approval and written informed consent should be obtained from each patient.Using a 50 ml Falcon tube, wash the fragments with cold PBS until the supernatant is clear.Incubate the samples in 15 mM EDTA/PBS solution (rotating) at 4 °C for 30 min (10 ml PBS + 300 µl 0.5 M EDTA).After removing the EDTA buffer, add 10 ml of PBS and voltex for 2 min to isolate intestinal crypts (Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231724_9924.pngFigure 1. Freshly embedded of small intestinal crypts from patients. Scale bars = 1 mm (left) and 100 μm (right).Confirm intact crypt isolation by observation under a microscope (see Notes).After settling down the specimen in the tube, collect the supernatant and transfer to a 50 ml Falcon tube filtering through a 70 μm filter.Repeat the Step A5 of Part I about 2-3 times till an approximately 30 ml volume of crypts containing solution is collected.Centrifuge the tube at 300 x g for 3 min to pellet.Resuspend the cell pellet with10 ml of Advanced-DMEM/F12 and transfer to one STEMFULLTM tube.Centrifuge the tube at 300 x g for 3 min to pellet.After examining the pellet under a microscope, carefully aspirate the supernatant and add the desired amount of Matrigel (30-50 µl per well) to embed the crypts (20-30 crypts per well).After gently pipetting within the Matrigel, gently apply 30 µl of Matrigel on the 24-well plate. Incubate 30-60 min to allow Matrigel to polymerize.",
    "Add the 500 µl of human intestinal growth medium to each well. Add 10 µM of Y-27632 to the culture medium for the initial 3 days.Procedure to maintain and passage small intestinal organoidsAfter isolation, change the small intestinal growth medium every two days.After 13 days of isolation, you will be able to see the growth of organoids, and they start to form crypt-like structures called \"budding\" (Figure 2). In order to subculture, remove the growth media and add 800 µl of cold cell recovery solution to the well. Using cell recovery solution, scrape off the Matrigel containing organoids by 1,000 µl pipette.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231709_1263.pngFigure 2. Establishment of small intestinal organoids from patients. Scale bars = 1 mm (left) and 100 μm (right).Transfer the resuspension to a 15 ml STEMFULLTM tube. Using a P100 pipette, pipette up and down 50-100 times vigorously to mechanically disassociate the organoids into smaller fragments. After examining the fragments under the microscope, add 9 ml of cold Advanced-DMEM/F12 to the mixture.Centrifuge the cells at 300 x g for 3 min.Carefully aspirate the supernatant and resuspend the pellet in Matrigel. Usually, split at a 1:5-6 ratio. On the around day 13, established organoids start budding.Part II: Single cell-level gene expression analysis Single-cell dissociations of cultured organoid cellsRemove the entire volume of the growing medium from each well (use 2-3 wells to obtain a sufficient number of cells).Using the same method as its described in passing cultured organoids, collect the organoids in a 15 ml STEMFULLTM tube, pipette up and down 50-100 times vigorously to mechanically disassociate the organoids into smaller fragments. Add 9 ml of cold Advanced-DMEM/F12 to the mixture.Centrifuge at 300 x g for 3 min and aspirate the supernatant.",
    "Add 5 ml of TrypLE select to the pellet and vortex for 10 min at 600 rpm (add Hoechst 10 μl).After 10 min, shake the tube vigorously for 10 times to further dissociate them into single cells.Centrifuge at 500 x g for 3 min and confirm the palette.Resuspend with 1,000 μl of Advanced-DMEM/F12 and transfer them to a 1.5 ml Eppendorf tube and count the live cell number by using conventional Trypan Blue staining (optimized cell concentration: 3 x 105 cells/ml, expected cell viability > 70%).Take out the desired amount of cells containing solution and centrifuge at 500 x g for 3 min and aspirate the supernatant.Resuspend with 1,000 μl of PBS and proceed to C1 protocol.Loading single cells into the chip (C1 pre-amplification process)Prepare single-cell suspension for C1 loading by mixing previously prepared cell suspension (A9) and C1 Cell suspension reagent while thawing other reagents.table:",
    "﻿0,1\nComponents,Volume (μl)\nCells 166-250K/ml,30 μl\nC1 Cell Suspension Reagent (Fluidigm),20 μl\nTotal,50 μl",
    "C1 chip primingTurn on the C1 machine, place a new C1 single-cell auto prep IFC and apply each reagent as shown in the below (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231650_6175.pngFigure 3. Application of a plate priming (Fluidigm C1 to Taqman Primers protocol, PN100-6117)After loading each reagent, place the place on the stage and select Prime program and run (it takes 10min).Important: After the priming, apply the sample within 1 h to prevent the priming reagents from drying out. While priming the plate, prepare Lysis Final Mix, Reverse Transcription (RT) Final Mix, and PreAmp Final Mix and keep them on ice (Recipes 4-6).Cell application and stainingAfter the priming, remove the blocking solution as shown below (Figure 4).Pipet prepared cell mix for 10 times and apply 20 μl to the blue coded well. Prepare the C1 LIVE/DEAD (see Recipes) and apply 20 μl to the pink coded well.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231633_5872.pngFigure 4. Cell application and staining to a C-1 plate (Fluidigm C1 to Taqman Primers protocol, PN100-6117)Set the plate on the stage, select Cell Load & Stain program and run (this process takes 60-80 min)After the program is over, take out the plate and confirm the single-cell capture (Figure 5) and cell viabilities of 96 wells under a microscope (BX-X700, Keyence, Osaka, Japan).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231611_3998.pngFigure 5. Examples of a viable single-cell capture positively stained with calcein AM and a dead cell stained with Ethidium homodimer-1. Scale bar = 100 μm. After confirming the cells, apply each solution as shown in the below (Figure 6) (Recipes 4-6)imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231556_3442.pngFigure 6. Application of pre-amplification solutions onto a C-1 plate (Fluidigm C1 to Taqman Primers protocol, PN100-6117)Set the plate on the stage and select the PreAmp program and set the estimated end time (it is an over-night process).It is important to collect the sample within an hour of completion; otherwise, the samples will be evaporated.",
    "Prepare a new 96-well plate and aliquot 25 μl of C1 DNA Dilution reagent into each well of the labeled Diluted Harvest PlateHarvest the Pre-Amplified products showed in the below and mix with each well with DNA dilutions using an 8-channel pipette (each well has approximately 3.6 μl) (Figure 7).Store the harvested plate in -20 °C.table:",
    "﻿0,1\nComponents,Volume (μl)\nC1 DNA Dilution Reagent (Fluidigm),25\nC1 harvest amplicons,3\nTotal,28\nimgsrc:https://en-cdn.bio-protocol.org/attached/image/20200927/20200927231537_0794.pngFigure 7. Pipetting steps of pre-amplified products from a C1-plate to a 96-wells plate (Fluidigm C1 to Taqman Primers protocol, PN100-6117)Biomark HD workflowFurther amplification and data acquirement of the multiplex quantitative PCR analysis will be performed using the Biomark 48.48. Dynamic array IFC and Biomark HD system (Fluidigm, San Francisco, CA, USA). Dynamic array IFC system operates nanofluidic IFC circuits that automatically combines harvested samples with sets of gene assays.PreparingPrepare both “10x assay mix” and “Sample mix” as they are shown below.TaqMan primers 10x assay mixtable:\n﻿0,1,2,3,4\nComponents,Volume per Inlet (μl),Volume per Islet with Overage (μl),Volume for 48.48 (μl),Volume for 96.96 (μl)\n2x Assay Loading Reagent,2.5,6.0,X 60 = 360,X 120 = 600\n20x TaqMan Gene Expression Assay,2.5,6.0,,\nTotal volume,5.0,6.0,300.0,600.0\nFinal concentration at 10x,Primers: 9 μM Probe: 2.5 μM,Primers: 9 μM Probe: 2.5 μM,Primers: 9 μM Probe: 2.5 μM,Primers: 9 μM Probe: 2.5 μM\nStore at -20°CSample Mixtable:\n﻿0,1,2,3,4\nComponents,Volume per Inlet (μl),Volume per Islet with Overage (μl),Volume for 48.48 (μl),Volume for 96.96 (μl)\n2x Mater Mix,2.5,3.0,X 60 = 180.0,X 120 = 36.0\n20x GE Sample Loading Reagent,0.25,0.3,X 60 = 18.0,X 120 = 36.0\ncDNA,2.25,2.7,,\nTotal,5.0,6.0,198,396.0",
    "Priming IFC and sample loadingMake sure to use IFC Controller MX for 48.48 Dynamic Array IFC, and IFC Controller HX for 96.96 Dynamic Array IFC.Inject control line fluid into each accumulator on the IFC.Remove and discard the protective film from the bottom of the IFC.Place the IFC into the appropriate controller, then run the appropriate “Prime” script to prime the control line fluid into the IFC. Each IFC type corresponds to a distinct script number, and the plate ID number will be identified by the controller (Priming takes up to 30 min).Important: Please make sure to run “Load” within 1 h after completing the priming as the plate will dry out. Remove the IFC from the controller, and pipette samples and assay solutions into the inlets on the IFC (5 μl each).Return the IFC to the controller.Run the appropriate “Load Mix” script. Air pressure forces samples and gene assay solutions into the IFC where they mix.Remove the loaded IFC from the controller.Place the IFC into the Biomark HD instrument, making sure the A1 corner on the IFC aligns with the A1 on the instrument tray.Important: Make sure to run Biomark HD within 1 h after completing the “Load Mix” script as the plate will dry out. Running Biomark HDTurn on the Biomark HD and the computer.Click the icon named “Biomark Data Collection”.Wait until the application shows “Ready” when the temperature of the CCD camera reaches to -5 °C.Click “Start a New Run” of the default desktop. Confirm that the “Data Collection” screen appears in response.Place the pre-loaded IFC on the tray and click “Load”. The tray retracts and the system scans the barcode and identifies the IFC.Click “Next”. Browse and select a file that you desire to save.Select the Gene Expression application. Select the Passive Reference (ROX).",
    "Select Probe and select “Next”.Select Browse and Protocol file. Start the Run."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}