{
  "id": 3441,
  "origin_website": "Cell",
  "title": "Quantification of cell energetics in human subcutaneous adipose progenitor cells after target gene knockdown",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nKnockdown of a specific gene in human subcutaneous progenitor cells followed by oxygen consumption analysis\nTiming: 2 h + transfection\nWhile this protocol uses a 24-well cell culture microplate, the methodology and rationale of this protocol can be extended to a 96-well cell culture microplate-based assay.\nDay 0\nAfter cells grow to confluence in the T25 flask, remove the spent media and carefully add 1 mL of pre-warmed PBS to the side of the flask opposite the attached cell layer.\nRock the flasks back and forth to rinse.\nNote: The more passages the cells undergo, the longer the cells will take to become confluent.\nDiscard the PBS wash solution and add 800 μL-1 mL of Trypsin-EDTA solution.\nRock the flasks to equally distribute the solution over the cells, then place the flasks in the tissue culture incubator for 3–5 min.\nAfter 5 min, greater than 90% of the cells should be detached.\nStand each flask on its end and add 4 mL of room temperature PGM-2 to each flask.\nEqually distribute the solution over the cells.\nCentrifuge the cells at 300 × g for 10 min at 20°C–26°C (room temperature) to remove the trypsin.\nResuspend the cells in 5 mL PGM-2 and remove an aliquot (20 μL) for cell counting.\nPlate approximately 15,000 human subcutaneous preadipocyte cells (125 μL) per well into the Seahorse XF24 cell culture microplate.\nNote: We suggest leaving four wells as control wells for this protocol, specifically wells A1, B3, C4, and D6.\nPlate approximately 15,000 human subcutaneous preadipocyte cells (125 μL) per well into 8 wells in a standard 48-well tissue culture plate.",
    "Note: The volume of cell suspension added into each well of the Seahorse XF24 cell culture microplate will vary based on the final cell yield calculated after conducting a cell count.\nGently shake the Seahorse XF24 cell culture microplate in all directions by hand before allowing the plate to rest at 20°C–26°C (room temperature) in the cell culture hood for 10 min.\nThis enables equal distribution of the cells within the well.\nRepeat this step with the standard 48-well tissue culture plate.\nPlace both the Seahorse XF24 cell culture microplate and the standard 48-well tissue culture plate in the tissue culture incubator (with 5% CO2) overnight.\nTransfection (Day 1)\nRetrieve the Seahorse XF24 cell culture microplate and the standard 48-well tissue culture plate from the incubator.\nView the cells under the microscope and confirm that the cells are 80% confluent.\nMake a transfection mix using OptiMEM, Lipofectamine RNAiMAX, and siRNA stock solutions.\nDilute the Lipofectamine RNAiMAX (2.25 μL per well) in OptiMEM (37.5 μL per well), and siRNA (0.75 pM per well) in OptiMEM (37.5 μL per well) respectively.\nAdd at least 10% extra volume when making the transfection mix to ensure that all wells will be filled equally.\ntable:files/protocols_protocol_3018_7.csv\nAdd the diluted siRNA to the diluted Lipofectamine RNAiMAX reagent in a 1:1 ratio and incubate at 20°C–26°C (room temperature) for 5 min.\nAfter 5 min, add 75 μL of transfection mix into each well in both the Seahorse XF24 cell culture microplate and the standard 48-well tissue culture plate.\nPlace both the Seahorse XF24 cell culture microplate and standard 48-well standard tissue culture plate at the back of the tissue culture incubator to limit environmental changes.\nAllow the plates to rest overnight in the cell culture incubator.\nDay 2 (after transfection)",
    "Retrieve both the Seahorse XF24 cell culture microplate and standard 48-well tissue culture plate from the incubator.\nRemove the PGM-2 and add 200 μL of fresh Adipocyte Differentiation Medium to induce white adipocyte differentiation from human subcutaneous preadipocyte cells into each well in the Seahorse XF24 cell culture microplate.\nRepeat this step with the standard 48-well tissue culture plate.\nReturn both the Seahorse XF24 cell culture microplate and standard 48-well tissue culture plate to the back of the incubator for 48 h.\nAfter the 48 h have elapsed, view the cells under the microscope to assess cell health and morphology.\nThe cells should now be ready for oxygen consumption analysis.\nCells can be harvested from the standard 48-well tissue culture plate to assess knockdown efficiency at this time.\nNote: Before undergoing differentiation, human subcutaneous preadipocytes will show fibroblast-like physical features. After undergoing successful differentiation into white adipocytes, cells will accumulate fat droplets and develop a rounder shape.\nSensor cartridge hydration and creating the seahorse assay (Day 4)\nTiming: 30 min + overnight hydration\nNote: The Seahorse XF24 sensor cartridge needs to be hydrated the day prior to conducting the respiration assay.\nInvert the Seahorse XF24 sensor cartridge such that it is upside down.\nCritical: Do not touch the sensors on the Seahorse XF24 sensor cartridge. Should the Seahorse XF24 sensor cartridge sensors encounter any surface or object, the final data will be skewed, potentially leading to misinterpretation of results.\nFill each well of the utility plate with 1 mL of XF Calibrant, carefully lower the Seahorse XF24 sensor cartridge back onto the utility plate and ensure that each sensor is properly submerged.\nPlace the Seahorse XF24 sensor cartridge and utility plate overnight in a humidified, non-CO2 incubator at 37°C.",
    "Create a Seahorse assay template including the following protocol using Wave Desktop:\ntable:files/protocols_protocol_3018_8.csv\nRespiration media preparation (Day 4)\nTiming: 45 min\nOn the same day the sensor cartridge hydration is completed, the Respiration Assay Medium is prepared.\nAliquot 40 mL of Seahorse XF DMEM Medium into a 50 mL conical tube to be used for washing steps.\nIncubate the Seahorse XF DMEM Medium, Seahorse XF 1.0 M Glucose Solution, Seahorse XF 100 mM Pyruvate Solution, and Seahorse XF 200 mM Glutamine Solution (aliquot) at 37°C until ready for use.\nBegin preparing the Respiration Assay Medium.\nAdd appropriate volumes of the XF supplements (XF Glucose, XF Pyruvate, and/or XF Glutamine solution) indicated in the tables above.\nIt is recommended to incubate the Respiration Assay Medium at 37°C for no more than 4 h as substrates, such as glutamine, can degrade.\nWashing the cells and adding fresh respiration assay medium (Day 4)\nTiming: 30 min\nOnce fresh Respiration Assay Medium is prepared, the cells are washed prior to adding the medium into each well in the microplate.\nCritical: Only process one-half or one-third of the microplate at a given time to prevent the cells from drying out. Practice changing the medium prior to conducting the assay.\nRetrieve the Seahorse XF24 cell culture microplate from the incubator.\nView cells under a microscope to assess cell health and document for reference or publication.\nCarefully remove all but 50 μL of the Assay Differentiation Medium.\nAdd 200 μL of fresh Respiration Assay Medium.\nRepeat this step one more time.\nNote: Using a multichannel pipette will eliminate variability between results.\nAdd 500 μL of Respiration Assay Medium to each well.\nView the cells under the microscope and check for any cell damage.",
    "Incubate the Seahorse XF24 cell culture microplate at 37°C in a non-CO2 incubator for 60 min prior to assay commencement.\nPreparing and loading the injection ports and starting the assay (Day 4)\nTiming: 30 min + respiration assay run time\nCritical: It is imperative that all working solutions that are to be loaded into the sensor cartridge’s injection ports are prepared freshly on the day of the assay.\nRetrieve the Agilent Seahorse XF Cell Mito Stress Test Kit from -20°C storage and allow the compounds to warm to room temperature for approximately 15 min.\nResuspend the Oligomycin, FCCP, and Antimycin A with the freshly prepared Respiration Assay Medium using the volumes described in the table(s) above.\nGently pipette the medium up and down roughly 10 times to solubilize the compounds.\nThese are the compound stock solutions.\nUse Oligomycin, FCCP, and Antimycin A stock solutions to make working solutions for loading into the injection ports of the sensor cartridge.\nLoad the sensor cartridge ports with the working solutions (multichannel pipettes and reagent reservoirs are recommended to maintain consistency).2[href=https://www.wicell.org#bib2]\nCritical: Before loading the sensor cartridge, utility plate, or cell culture plate into the instrument tray, ensure that all external packaging has been removed. Make sure there is a secure fit between the utility plate, the cell culture plate, and the instrument tray, respectively. Conduct a final check to make sure all pieces are orientated correctly.\nPlace the utility plate with the loaded sensor cartridge onto the instrument tray.\nStart the respiration assay 40 min after the Seahorse XF24 cell culture microplate was placed in a non-CO2 incubator; calibration takes 20 min.\nWhen prompted, replace the utility plate with the Seahorse XF24 cell culture microplate.\nClick “Start.” The assay will take approximately 2 h.",
    "Once all measurements are completed, an “Unload Sensor Cartridge” message will be displayed.\nOnce this message appears, click “Eject” to eject both the sensor cartridge and the Seahorse XF24 cell culture microplate.\nSeparate the sensor cartridge from the Seahorse XF24 cell culture microplate.\nCritical: Check the injection ports of the sensor cartridge for any injection medium that has remained stuck in the port(s). These failed injections can be easily visualized and identified. Take note of any and all ports that were not completely emptied during the assay and plan for subsequent data analysis.\nOptional: Should you decide to conduct further analysis on the DNA, RNA, or protein content of the cells, the Seahorse XF24 cell culture microplate can be stored at -80°C at this time.\nTesting the protein content of each well\nTiming: 2 h\nWash each well twice in the Seahorse XF24 cell culture microplate with 500 μL PBS.\nLyse the cell with 50 μL Protein Extraction Buffer containing Complete Protease Inhibitor Cocktail EDTA-free.\nGently pipette up and down 10 times to homogenize.\nCentrifuge the homogenate at 4°C at 15,000 × g for 20 min.\nThe supernatant contains the protein fraction.\nAnalyze the protein concentration using a protein quantification assay using bicinchoninic acid."
  ],
  "subjectAreas": [
    "Cell Culture",
    "Metabolism",
    "Cell Biology",
    "Cell Isolation"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}