{
  "id": 13483,
  "origin_website": "Jove",
  "title": "Evaluation of Injury-induced Senescence and In Vivo Reprogramming in the Skeletal Muscle",
  "procedures": [
    "Animals were handled as per European Community guidelines and the ethics committee of the Institut Pasteur (CETEA) approved protocols.\n1. Preparations of the Stock Solutions\nPrepare the materials for muscle sample fixation.Dissolve 0.5 g of tragacanth gum with 20 mL water at RT to make the freezing-embedding medium for muscle fixation.\nPrepare the solutions for SA-β-Gal staining.\nPrepare the stock solutions of K3Fe(CN)6 (100 mM), K4Fe(CN)6 (100 mM), MgCl2 (1M) by dissolving the respective powders in distilled water.\nPrepare the stock solution of 0.2% C20H6Br4Na2O5 (Eosin) by diluting it in water.\nPrepare the stock solution of C14H15BrClNO6(X-gal) (50 mg/mL) by dissolving the X-gal powder in C3H7NO (dimethylformamide, DMF).\nStore K3Fe(CN)6 and K4Fe(CN)6 solutions at 4 °C, and MgCl2 at RT.\n\t\tNOTE: X-gal can be stored in aliquot at -20 °C, up to 6 months. Eosin solution can be kept at RT and reused after filtering if necessary. K3Fe(CN)6 and K4Fe(CN)6 solutions are protectedfromthe light. X-gal solution is not stable in water and has to be protected from light.\nPreparation of the solutions for Nanog staining: the permeabilization solution contains 0.1% Na3C6H5O7 (trisodium citrate), 0.1% C14H22O(C2H4O)n(n = 9-10) (Triton X-100) in distilled water, which should be stored at 4 °C. Prepare the blocking solution containing 5% fetal bovine serum (FBS) in phosphate-buffered saline (PBS), which should be stored at RT.\n2. SA-β-Gal Staining on Frozen TA Muscle Section\nPrepare the fixation material for the TA muscle by placing a small amount of the tragacanth gum on a slice of cork.",
    "Injured mice of both sexes (2 month old, C57/B6) were injured 10 days before with cardiotoxin (CDX) as described previously13. Use non-injured (PBS injection) TA from the same mouse as the negative control. If in vivo reprogramming is desired, treat each mouse with Dox (1 mg/mL) in the drinking water on the same day (protected from the light), right after CTX injury.\n\tNOTE: The Dox solution needs to be changed every 3 days for a total treatment duration of 7 days.\n\t\nIsolate both TA muscles (injured and control) from mice as described previously (Figure 1A)13. To ensure the transverse sections, insert the distal tendon of the TA muscle into the tragacanth gum and leave roughly ¾ part of the muscle outside (Figure 1B) and freeze directly in liquid nitrogen cooled isopentane for <1 min.\n\t\tNOTE: Make sure the TA muscle is in a perpendicular position and in the center of the cork. Samples can be stored at -80°C or directly cryosectioned in 10 µm sections.\nProcess the TA muscles as described in the Figure 1B.\nDistribute the 1st-10th sections in the correct order onto ten different slides at the upper left position of each slide. Place the 11th section adjacent to the 1st section on the first slide; the 12th section will follow the same order to be placed right besides the 2nd section on the second slide. Repeat this process till 10 sections/slide are obtained for ten slides (100 sections in total) to ensure minimum 1 mm distance between the first section and the last section.\nFix the sections for 4 min in PBS containing 1% paraformaldehyde and 0.2% glutaraldehyde. Wash with PBS, 2x 10 min. Next, incubate the sections in PBS (pH = 5.5) for 30 min. Perform all the steps at RT.",
    "NOTE: The fixation has to be mild to maintain enzymatic activity. Perform this step under the hood. The pH of the PBS is critical and the X-gal solution must be protected from light.\nIncubate sections in the X-gal solution containing: 4 mM K3Fe(CN)6, 4 mM K4Fe(CN)6, 2 mM MgCl2, and 400 µg/mL X-Gal in PBS, pH = 5.5. Incubate in the dark at 37 °C for a minimum of 24 h. Wash the slides with PBS, 3x 10 min, at RT.\n\tNOTE: The incubation requires a minimum of 24 hours and can last for 48 hours to maximize the SA-β-Gal signal. The solution needs to be changed after 24 hours of incubation. The slides should be protected from light. If only SA-β-Gal staining is desired, continue with step 2.5. If co-staining with Nanog is desired, please skip forward to step 3.1.\nFix slides in 1% paraformaldehyde in PBS for 30 min. Wash slides with PBS, 3x 10 min. Counterstain with 0.2% eosin. Immerse the slides in the eosin solution for 1 min and rinse them with distilled water briefly. Finally, mount the slides with aqueous non-fluorescing mounting medium (see Table of Materials).\n\tNOTE: It is essential to perform the post-fixation. Perform this step under the hood. All steps are performed at RT.\n3. Immunohistochemistry Using Anti-Nanog Antibody\nFix the slides with PBS containing 4% paraformaldehyde for 10 min. Wash with PBS, 2x 10 min. Add 200 µL of the permeabilization solution directly onto the slides and incubate for 5 min.\nWash slides with PBS, 2x 5 min and in the last wash, use 200 µL PBS containing 0.25% BSA directly on the slides. Perform all these steps at RT.\n\t\tCaution: Perform the fixation step under the hood.",
    "Incubate slides with the primary anti-Nanog antibody (final concentration: 1.25 ug/mL) overnight at 4 °C in PBS containing 5% FBS. Wash slides with PBS, 2x 10 min and in the last wash, use 200 µL PBS containing 0.25% BSA for 5 min. Perform all the washing steps at RT.\n\tNOTE: Incubate slides in a box with wet paper towel to prevent evaporation.\nIncubate slides with 100 µL of rAb-HRP secondary antibody from a ready to use kit (see Table of Materials) for 45 min. Wash slides with PBS, 3x 5 min, to remove secondary antibody. Perform all the steps at RT with protection from light.\nVisualization\nFirst, dilute the 3,3'-diaminobenzidine (C12H14N4C12H18Cl4N4(4HCl), DAB) in the substrate buffer provided by the ready to use kit (20 µL of DAB for 1 mL of substrate buffer solution). Add 100 µL of DAB solution directly onto each slide and incubate for a maximum of 10 min at RT.\n\t\tNOTE: The diluted DAB solution should be prepared freshly and can be stored for up to one week at 4 °C. The incubation time can be adjusted to minimize the background signal but must be kept the same for all slides.\nRemove the DAB solution by rinsing with water. Counterstain the slides with fast red solution (ready to use, see the Table of Materials) for 20 min. Wash the slides with water again briefly.\nDehydrate them with 95% ethanol for 5 min followed by 100% ethanol, 2x 5 min. Finally, mount the slides with quick-hardening mounting medium (see Table of Materials).\nObserve the slides under the microscope in bright field at 20X to avoid background.\n\t\tNOTE: Fast red solution can be kept at RT and re-used after filtering.\n4. Analysis and Quantification\nSA-β-Gal quantification",
    "Scan the slides and choose the best sections on each slide based on the acquired images. Use at least 2 sections/TA for the quantification. Judge the section's quality based on tissue integrity, quality of the staining, and counterstaining. For the quantification, choose the two highest quality sections with the maximum possible distance in between samples, which allows better representation of SA-β-Gal quantification throughout the whole TA muscle.\nQuantification of SA-β-Gal positive cells (Figure 2).\n\t\t\nDetermine the rank of the pixel size by manually selecting the smallest and the largest positive SA-β-Gal cells.\n\t\t\t\nOpen the digital image of the scanned slide using ImageJ software.\nIn the interface, click 'Analyze' > 'Tools' > 'ROI Manager' > 'Analyze' > 'set measurement' > 'select Area'. Use the selection tool and surround the smallest and biggest positive SA-β-Gal cell and add it to the ROI manager by clicking on 'Add'. Measure the sizes using the 'Measure' button and save the values for later use.\nAdjust the threshold parameter to ensure all the visible positive cells are selected.\n\t\t\t\nConvert the image to gray scale by clicking 'Image' > 'type' > '8-bit' (Figure 2A). Next, go to 'Image' > 'Adjust' > 'Threshold', move the second cursor until all the positive SA-β-Gal cells are covered in red (Figure 2B), then click 'Apply'.\nAnalyze particles by clicking 'Analyze' > 'Analyze Particles' > 'Size (pixel^2)', and apply the value defined in step 4.1.2.1, enter 'Circularity': '0.00-1.00', click 'ok' ; a summary of all the counted particles is shown in the ROI manager (Figure 2D).",
    "Transfer all the selected particles to the original image. Adjust the selection manually to ensure accurate quantification. Add positive cells (green arrow, Figure 2E) and/or remove false positive cells (red arrow, Figure 2E). Finally, measure the area by outlining the section (Figure 2D) using the 'selection tool'. Click 'ROI manager' > 'Add' > 'Measure'.\nImportantly, normalize the number of positive cells by the area of the section.\nNanog quantification\nCount the Nanog positive cells under the microscope in the bright field manually at 20X magnification.\n\t\tNOTE: The fast red counterstaining allows good evaluation of the morphology of the TA muscle. However, the staining is very light and lacks a clear outline of the section. The scanner often fails to identify the boundary of the sections and cannot focus correctly. It is possible to use marker to circle the edges of the sections before scanning or use a more sensitive scanner to detect the section. For the current protocol, it is most efficient to count the Nanog positive cells manually.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}