{
  "id": 17344,
  "origin_website": "Jove",
  "title": "Isolation of Monocyte-Macrophage Lineage Cells from Rat Bones by Secondary Adherence Method",
  "procedures": [
    "All experiments in this study were conducted in accordance with the animal experiment guidelines of the Zhejiang Chinese Medical University Laboratory Animal Research Center (Approval No: IACUC-20181029-11).\n1. Cell extraction\nPut the Sprague-Dawley rats (SD rats, 1-10 days old, male or female) in the euthanasia cages filled with CO2 at a balanced rate of 30%-70% container volume/minute. After the rats lose consciousness (20-60 min), euthanize the rat by cervical dislocation to ensure a painless death.\nImmerse the rats in 75% alcohol for 10 min for disinfection.\nCarefully remove all the limbs of the rat with scissors and forceps, aspirate with PBS using a pipette and flush the blood adhering to the limbs.\nAdd 5 mL of penicillin/streptomycin solution into 500 mL of DMEM and mix well. Take a 50 mL sterile centrifuge tube, add 5 mL of FBS and 45 mL of DMEM medium, and mix thoroughly to obtain a 10% FBS DMEM containing 1% penicillin/streptomycin solution. Add 2 mL of the above culture medium into a 5 mL tube.\nTransfer the limb bones into the 5 mL tube. Use scissors to cut the limb bones in the tube into small pieces (1-3 mm) and mix the homogenate to re-suspend the bone marrow cells into the culture medium. Stand for 5 min until the tissue fragments settled to the bottom of the tube.\nAdd 10 mL of 10% FBS DMEM into a 100 mm culture dish, and then transfer the supernatant into the culture dish. When aspirating the supernatant, avoid transferring the tissue debris into the culture dish.\nIncubate at 37 °C and 5% CO2 for approximately 24 h. After this incubation time, the majority of mesenchymal stem cells will adhere to the culture dish wall and grow slowly, while most BMMs will still be suspended in the culture medium.",
    "Transfer the cell suspension in the 100 mm culture dish to a new 25 cm2 flask and continue to cultivate the cells at 37 °C and 5% CO2 for an additional 24 h. BMMs will adhere to the flask wall at 24-48 h of culture. Remove the old medium carefully and replace with fresh medium after BMMs have adhered to the flask wall.\nSub-culture when the cells in the flask reached 80%-90% confluency.\n\t​NOTE: All the cells were cultured at 37 °C and 5% CO2. During culture, the cell morphology was gradually unified. Cells were large, irregularly shaped, radially growing and attached to the flask in a form of disc, where multiple nuclei could be observed.\n2. FACS staining of the cell\nTrypsin digest using 1-2 mL of commercial trypsin at 37 °C and 5% CO2 for 5 min and count secondary adherent cells to ensure a final cell count of 100,000/sample (count cells with Neubauer hemocytometer).\nDivide the cells into three groups (500 µL of PBS contains 100,000 cells): (1) the blank control group containing unstained cells; (2) the isotype control group; and (3) the experimental group (CD11b/c staining).\nIncubate primary antibodies (no antibody for the blank control group; anti-CD11 isotype control for the isotype control group, 0.6 µL of antibody/sample, 1 µg/sample; anti-CD11b/c for the experimental group, 1 µL of antibody/sample, 1 µg/sample) on ice for 30 min.\nCentrifuge at 300-350 x g for 5 min, discard the supernatant, and resuspend the cells with 500 µL of PBS. Repeat the above procedure once to ensure that the unbound primary antibodies are washed away.\nIncubate the corresponding secondary antibody (no antibody for the blank control group; goat anti-rabbit IgG for the isotype control and the experimental groups, 0.25 µL antibody/sample, 1:2,000) on ice in the dark for 30 min.",
    "Centrifuge at 300-350 x g for 5 min, discard the supernatant, and resuspend the cells with 500 µL of PBS. Repeat the above procedure once to ensure that the unbound second antibodies are washed away.\nDetect the CD11b/c positive cells by flow cytometry (10,000 cells/sample) and analyze the data by software (e.g., FlowJo 7.5).\n\t​NOTE: To obtain the final percentage of CD11b/c+ cells, the following formula was used: Percentage of CD11b / c + cells in the experimental group - the percentage of CD11 + cells in the isotype control group.\n3. Wright-Giemsa staining\nSeed the adherent secondary cells that have been passaged three times onto 35 mm2 cell climbing sheets (1 × 106 cells/well) and culture at 37 °C and 5% CO2 for 24 h.\nDiscard the culture medium and wash thrice with PBS.\nAdd Wright-Giemsa dye solution (0.5 mL-0.8 mL) to the cell climbing sheet for 1 min.\nMix the dye with distilled water (0.5 mL-0.8 mL) with a cotton swab, and stand for 10 min.\nWash the dye solution with distilled water, and then dry for 1-3 min. Observe under a microscope.\n4. TRAP staining\nSeed the adherent secondary cells that have been passaged three times onto 35 mm2 cell climbing sheets (1 × 106 cells/well) and culture at 37 °C and 5% CO2 for 24 h.\nReplace the old medium with the 10% FBS DMEM or osteoclast induction medium supplemented with 50 ng/mL receptor activator of nuclear factor-κB ligand (RANKL) and 30 ng/mL of macrophage colony-stimulating factor (M-CSF), and culture at 37 °C and 5% CO2 for an additional 7 days.\nStain the cells with the TRAP staining kit according to manufacturer's protocol and observe under a microscope.",
    "​NOTE: TRAP-positive cells were defined as osteoclasts, which were purple under a light microscope. The number of TRAP-positive cells was measured using ImageJ software.\n5. Western blot\nSeed the adherent secondary cells that have been passaged three times on 35 mm2 cell climbing sheets (1 × 106 cells/well) and culture for 24 h.\nReplace the old medium with fresh 10% FBS DMEM or osteoclast induction medium (50 ng/mL of RANKL and 30 ng/mL of M-CSF) and culture for an additional 7 days at 37 °C and 5% CO2.\nExtract total cellular proteins with RIPA buffer, separate by 10% SDS-PAGE, and transfer to polyvinylidene fluoride membranes18,19.\nBlock with 5% skimmilk powder (25 mL) for 2 h and wash three times, for 10 min each time, with TBS-Tween 20 (TBST).\nIncubate primary antibodies at 4 °C overnight (anti-β-actin, anti-TRAP, and anti-cathepsin K; all primary antibodies were diluted 1:1,000, 10 mL diluted antibody/band), and wash thrice with TBST.\nIncubate the secondary antibody (goat anti-rabbit IgG, 1:2,000 dilution, 10 mL diluted antibody/band) at room temperature for 2 h, and wash thrice with TBST. Visualize the protein bands using a developing solution.\n\tNOTE: The expression levels of the above proteins were normalized to β-actin.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}