{
  "id": 9287,
  "origin_website": "Jove",
  "title": "Telomerase Activity in the Various Regions of Mouse Brain: Non-Radioactive Telomerase Repeat Amplification Protocol (TRAP) Assay",
  "procedures": [
    "Animal experiments were approved by the ethical committee for animal experiments in the Ben-Gurion University (IL-39-08-2010).\n1. Mouse Brain Protein Extraction\nPrepare 3 tubes of 15 ml each containing 5 ml Ringer's solution and place tubes on ice.\nSacrifice the mouse using Isoflurane anesthesia (CAUTION – use chemical hood) for 10-20 sec followed by cervical dislocation and immediate decapitation.\nRemove the brain from the skull and rinse for a few seconds with ice cold Ringer's solution to prevent damage to the brain tissue.\nUsing a surgical blade, separate the cerebellum (CR) and brainstem (BS) from the frontal cortex. Next, separate the cerebellum from the brainstem and cut the frontal lobe (FL) from the frontal cortex; remove the olfactory bulb from the frontal lobe. Place the 3 brain regions in the designated 15 ml tubes.\nHomogenize the tissue in each tube. Add fresh ice cold Ringer's solution so each tube contains the same volume and centrifuge for 7 min at 800 x g.\nRemove the supernatant and add 100 µl of CHAPS lysis buffer to each tube. Mix well, by passing the solution several times (~10) through a 1 ml syringe with a 21 G needle, and incubate on ice for 30 min.\nTransfer the contents of each tube to a new micro-centrifuge tube and centrifuge for 30 min at 13,000 x g. Transfer the supernatant to a new micro-centrifuge tube and determine the protein concentration using a previously established method. Store the protein extracts in aliquots of 10 µl at -80 °C.\n2. TRAP Assay Preparation of Instruments, Reaction Solutions, and Protein Dilution Calculations\nPrepare appropriate number of labeled micro-centrifuge tubes for protein extract dilutions and telomerase reaction buffer. Perform all pipetting in the protocol using filter tips to prevent contamination.",
    "Thaw the following solutions on ice: TRAP reaction mix 10x, TS primer, dNTP's, UPW and protein extracts (see table of materials for reagents and reagents concentrations).\nDilute the solution of the protein extract to a final concentration of 1 µg/µl using ultra-pure water (UPW).\n3. Telomerase Reaction\nPrepare telomerase reaction mix by adding the following to a micro-centrifuge tube: 2 µl TRAP mix (10x), 1 µl TS primer (0.1 µg), 1 µl dNTPs (10 mM) and 15 µl UPW. For multiple samples, multiply aforementioned volumes by the number of samples, plus 1.\nAdd 19 µl of the reaction mix to each reaction tube and add 1 µl of the diluted protein extract (1 µg proteins) to each tube for a final volume of 20 µl.\nPlace the reaction tubes in a 30 °C pre-heated water bath for 45 min.\n4. PCR Reaction\nFifteen min before the end of the telomerase reaction, thaw the following solutions: ACX primer, Titanium Taq Buffer, UPW.\nPrepare PCR reaction mix by adding the following to a micro-centrifuge tube: 2.5 µl Titanium Taq Buffer (10x), 1 µl ACX primer (0.1 µg), 2 µl UPW (1 μl when IC is used) and 0.5 µl Titanium Taq Polymerase (50x). For multiple samples, multiply aforementioned volumes by the number of samples plus 2.\nAdd 6 µl of the PCR mix to each PCR tube and add the entire volume of the telomerase reaction (20 µl) to each tube for a final volume of 26 µl.\nInsert the PCR tubes to a PCR thermo cycler and run the following program:\n\t- 90 °C – 2 min.\n\t- 94 °C – 30 sec.*\n\t- 60 °C – 30 sec.*\n\t- 72 °C – 45 sec.*\n\t- 72 °C – 2 min.\n\tStore PCR products at -20 °C.\n\t* = 34 cycles",
    "5. Agarose Mini-gel Preparation, Samples Running, and Gel Staining\nAdd 25 ml chilled electrophoresis buffer (TBE) and a stir bar to a beaker that is 2-4 times the volume of the buffer solution and slowly sprinkle in 1.125 g of the high-resolution (HR) agarose powder while the solution is rapidly stirred. Remove the stir bar, cover the beaker with a plastic wrap and pierce in a small hole for ventilation. Heat the beaker in the microwave on \"Low\" power for 3 min and then switch to \"High\" power and heat the solution in short pulses with care not to cause spilling. Note that when the foam created by heating becomes large bubbles and disappears after a few seconds, the agarose is ready.\nCast the gel to a horizontal mini-gel apparatus, after the gel solidifies at room temperature allow the gel to chill for 20 min at 4 °C before use.\nLoad each lane with 25 µl of TRAP sample (20 µl TRAP PCR products and 5 µl 6x gel-loading dye) and run at 110 V for 3 hr in a 4 °C cold room.\nPrepare nucleic acid stain 3x working solution by adding 15 µl 10,000x nucleic-acid stain, stock solution to 50 ml Double Distilled Water (DDW) with 0.1 M NaCl (0.29 g). Stain the gel for 20 min with gentle shaking.\nUse UV transilluminator with 302 nm wavelength to view the TRAP ladder DNA bands.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}