{
  "id": 8117,
  "origin_website": "Bio",
  "title": "Preparation of Pneumococcal Proteins for Western Blot Analysis",
  "procedures": [
    "I.   Extraction of choline-binding proteins by choline wash     Grow lysogenic cells without holin activity, hence incapable of lysis, in C+Y at 37 °C until OD600 nm of approximately 0.9 is reached (overnight culture). We used a lysogenic strain since this protocol was developed to determine the localization of the phage lysin. Moreover, since holin function activates phage-mediated lysis, we eliminated holin activity in this strain to avoid possible phage lysin escape (Frias et al., 2013).    Dilute 1:100 in 7 ml of fresh C+Y and continue incubation at 37 °C to an OD600 nm of 0.2-0.25, which takes approximately 2 h. Then, induce the phage by treating with Mitomycin C (MitC) at a final concentration of 0.1 μg/ml or left untreated as control.   Take samples (7 ml) at different time points, for instance in 20 min-intervals, after MitC treatment. In the case of untreated cultures, collect the samples at the same time points after the culture reached OD600 nm 0.2-0.25.   Harvest the cells by centrifugation (3,200 x g for 10 min at 4 °C).    Wash the cells once with 0.5 culture volumes (3.5 ml) of cold 1x PBS.   To obtain the total cell pellet fraction, suspended the cells in 200 μl of 50 mM Tris pH 7.5 and store at -20 °C.   For choline wash, gently suspend the PBS washed cells (in step 5) in 200 μl of 2% choline chloride (w/v) prepared in 1x PBS and incubate 30 min at 4 °C without agitation to elute the choline binding proteins (avoiding cell lysis).    As control for the specificity of the choline wash in removing only choline binding proteins, incubate cells in the same conditions with 1x PBS or 2% (w/v) NaCl prepared in 1x PBS.   Collect bacteria by centrifugation (3,200 x g for 15 min at 4 °C).",
    "To obtain the cell pellet fraction after choline extraction, wash the pellet once with 0.5 volumes of cold 1x PBS, suspended in 200 μl of 50 mM Tris pH 7.5 and store at -20 °C.   Filter the supernatant, which corresponds to the choline wash fraction, through a 0.2 μm low-binding-protein membrane to ensure the removal of all bacteria. Store at -20 °C.   Separate proteins on SDS-PAGE: Boil 5-15 μl of the pellet fractions and 45 μl of the supernatant fractions for 5 min with 1x loading buffer and load onto the gel. You will need the antibody for your protein to visualize the protein on Western blot and it is important to control for possible cell lysis using an antibody for a known cytoplasmic protein (Figure 1). When comparing the amount of the protein of interest between samples, do not forget to normalize by a loading protein control. As an alternative to loading equal sample volumes followed by normalization, determine the protein concentration of each sample and load the same amount of total protein in each lane.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141201/20141201233937_8194.png Figure 1. Choline extracts increasing amounts of phage lysin (a choline-binding protein) from the cell surface. Equal aliquots were taken at the indicated times from MitC-treated lysogenic cultures (without holin activity). Cells were harvested by centrifugation and directly suspended in Tris buffer (cell pellet fraction, P) or choline washed (choline wash fraction, Scholine). As control, cells collected at 60 and 80 min were washed with PBS (SPBS). All fractions were tested by Western blotting for the phage lysin Svl (37 kDa) presence with the appropriate antibody. P and S fractions were also tested for the cytoplasmic elongation factor Ts (43 kDa) to control for cell lysis (Frias et al., 2013).     II.",
    "Preparation of culture medium fractions in the presence of 2% choline     Grow lysogenic cells without holin activity in C+Y at 37 °C until OD600 nm of approximately 0.9 is reached (overnight culture).   Dilute 1:100 in 7 ml of fresh C+Y and continue incubation at 37 °C to an OD600 nm of 0.2-0.25.    Collect cells by centrifugation (3,200 x g for 10 min at 4 °C) and discard the supernatant.   Suspend lysogens in 7 ml of C+Y with 2% choline chloride, treat the cells with MitC (0.1 μg/ml) to induce the phage and continue the incubation (alternatively, bacteria can be grown in the absence of choline).   Take samples (7 ml) at different time points after MitC treatment.    Harvest the cells by centrifugation (3,200 x g for 10 min at 4 °C). To obtain the cell pellet fraction, wash the cells once with 0.5 volumes of cold 1x PBS, suspend in 200 μl of 50 mM Tris pH 7.5 and store at -20 °C.   Collect the supernatant, which corresponds to the culture medium fraction, and filter through a 0.22 μm membrane filter. Besides the secreted proteins, this fraction also includes the choline binding proteins which are eluted from the pneumococcal surface in the presence of 2% choline chloride in the growth medium. Note that the choline binding proteins can be extracted using procedure described in Section I.   Concentrate the supernatant 35-fold (final volume of 200 μl) by centrifugation (3,200 x g at 4 °C for approximately 15 min) on an Amicon Ultra-15 centrifugal filter unit (cut-off 10 kDa). It is recommended that the molecular weight cut off of the membrane is at least 3 times smaller than the molecular weight of the protein being retained. Since we wanted to study the 37 kDa phage lysin, we selected a 10 kDa cut off.",
    "Note that this experiment also allows to test for the membrane permeabilizing effect of a specific compound since in this case one expects the release of cytoplasmic proteins into the culture medium. If this is the goal of the experiment, after challenging the (MitC-treated) cultures with the compound of interest in step 4, the samples are processed as described in the following steps.   Separate proteins on SDS-PAGE: Boil 5-15 μl of the pellet fractions and 45 μl of the supernatant fractions for 5 min with 1x loading buffer and load onto the gels. You will need the antibody for your protein to visualize the protein on Western blot and it is important to control for eventual cell lysis using an antibody for a known cytoplasmic protein."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}