{
  "id": 14988,
  "origin_website": "Jove",
  "title": "Pre-Implantation Genetic Testing for Aneuploidy on a Semiconductor Based Next-Generation Sequencing Platform",
  "procedures": [
    "All protocols and the trophectoderm (TE) biopsy (1.1.1.1 section) applied in this study were reviewed and approved by the human research ethics committee of No. 924 hospital on September 18th, 2017 (NO: PLA924-2017-59). The patients/participants provided their written informed consent to participate in this study.\n1. DNA isolation from human embryo biopsy and whole genomic amplification\nProtocol for whole genome amplification9,10\n\tNOTE: Pico PLEX WGA Kit is used to perform whole genome amplification.\n\t\nSample collection and storage\n\t\t\nTrophectoderm biopsy: Draw on an average of six to nine cells from herniated TE of D5/6 embryo after assisted hatching to obtain a qualified amount of DNA for the following amplification.\nTransfer the sample cells to a PCR tube in 5 µL of PBS.\nImmediately freeze the samples at -80 °C if the protocol does not directly proceed to the DNA extraction.\nCell lysis\n\t\tNOTE: Supplementary File 1 lists and serves as a reference for the recommended volumes of each component when preparing the master mix during cell lysis and whole genome amplification of batches of 1, 8, 16, and 32 samples (with overage to accommodate pipetting errors). When formulating other master mixes of this protocol, the volume of each component is additionally increased to accommodate the component consumption caused by repeated pipetting. All brief centrifugation is performed on a tabletop mini centrifuge for 2-10 s at room temperature (RT), with a fixed RPM of 10,000 with a centrifugal force of 5,300 x g. The centrifugal force must be between 2,000 x g and 12,000 x g.\n\t\t\nPrepare the cell lysis mix with 4.8 µL of the extraction enzyme dilution buffer and 0.2 µL of the cell extraction enzyme per sample.",
    "Pipette 5 µL of the freshly-prepared cell lysis mix into each 5 µL cell sample in PCR tubes, and briefly centrifuge the tube at RT for 5 s. Do not vortex the tube.\nIncubate the sample in a thermal cycler as follows: 75 °C, 10 min; 95 °C, 4 min; 25 °C, 14 min. Briefly centrifuge (5 s) the tube after the incubation.\nPre-amplification of the whole genome DNA\n\t\t\nPrepare the pre-amplification mix with 4.8 µL of the pre-amp buffer and 0.2 µL of the pre-amp enzyme per sample.\nPipette 5 µL of the pre-amplification mix into the sample tubes through the walls of the tube, and briefly centrifuge for 3 s. Avoid the tip reaching the bottom of the tube, and do not vortex the tube.\nIncubate the sample according to the thermal cycler program mentioned in Table 1.\nWhole-genome DNA amplification\n\t\t\nBriefly centrifuge the sample for 5 s and place the pre-amp incubation product on ice.\nPrepare the whole genome amplification mix with 25 µL of the amplification buffer, 0.8 µL of the amplification enzyme, and 34.2 µL of nuclease-free water per sample.\nMix 60 µL of the freshly prepared whole genome amplification mix with the 15 µL of pre-amp incubation product; the total volume needs to be 75 µL. Briefly centrifuge for 5 s. Avoid the tip reaching the bottom of the tube, and do not vortex the tube.\nPlace the PCR tube on the thermal cycler and run the thermal cycler program mentioned in Table 2.\nCentrifuge the tubes briefly for 5 s and transfer the products into a new 1.5 mL centrifuge tube.\nQuantify the WGA product concentration with a fluorometer11. Samples can be temporally stored at -20°Cfor less than 2 months if not proceeded to the next step.",
    "Protocol of the independently developed WGA reagents.\n\t\nSample collection and storage\n\t\t\nDraw the cells from the D5/6 embryo after assisted hatching for the following amplification.\nTransfer the sample cells with 1.5 µL of PBS into a PCR tube containing 2 µL of PBS.\n\t\t\tNOTE: PBS is free of Mg2+ and Ca2+.\nFreeze the samples immediately at -80 °C if not directly proceeded to the DNA extraction protocol.\nCell lysis\n\t\t\nMelt the cell lysis buffer (40 mM Tris (pH 8), 100 mM NaCl, 2 mM EDTA, 1 mM ethylene glycol tetraacetic acid (EGTA), 1% (v/v) Triton X-100, 5 mM sodium pyrophosphate, 2 mM β-glycerophosphate, 0.1% SDS) at RT and place it on the ice. Add 2 µL of cell lysis buffer to each sample, and centrifuge briefly (5 s).\n\t\t\tNOTE: Do not vortex the tube, and avoid the pipette tip touching the liquid surface in the tube to avoid bringing cells or DNA out of the reaction system.\nIncubate the sample in a thermal cycler as follows: 55 °C, 20 min; 95 °C, 10 min; 4 °C, hold. Briefly centrifuge the tube at RT for 10 s after the incubation.\nWhole-genome DNA amplification\n\t\t\nBriefly centrifuge the cell lysis product for 5 s and place it on ice.\nPrepare the whole genome amplification mixture for each sample by mixing with 16 µL of amplification pre-mixed solution, 1 µL of amplification enzyme, and 28 µL of nuclease-free water. Mix gently, centrifuge briefly (5 s), and place the mixture on ice. Do not vortex the tube.\nPipette 45 µL of the freshly prepared whole genome amplification mixture into the cell lysis product prepared in step 1.2.2.2; mix gently and centrifuge briefly for 5 s.\n\t\t\tNOTE: Do not vortex the tube and avoid the pipette tip touching the liquid in the tube.",
    "Place the PCR tube on the thermal cycler and run the program as detailed in Table 3.\nCentrifuge the tubes shortly for 5 s and transfer the products into a new 1.5 mL centrifuge tube.\nQuantify the WGA product concentration with a fluorometer11 and record the results on the QA (quality analysis) sheet. Products with qualified concentrations can be temporally stored at -20 °C for less than 2 months if not proceeded to the next step.\n2. Amplification fragment selection\nNOTE: Materials used in this section are available in the Library Preparation Kit (Table of Materials).\nPreparation before starting\n\t\nEquilibrate the magnetic beads (n x 100 µL) for purification at RT for 30 min.\nRestore the previous WGA product to RT. Vortex the product at RT for 30 s before centrifuging it briefly.\nPrepare fresh 70% ethanol.\nFragment selection procedure\n\t\nPipette 25 µL of the WGA products and transfer into a 1.5 mL centrifuge tube with 25 µL of nuclease-free water preloaded.\nVortex and mix the DNA purification beads well. Aliquot 50 µL of it into each sample tube (original sample: beads (volume) = 1:1), vortex, and centrifuge briefly (5 s). Set the tube for 5 min at RT for the DNA binding process.\nInsert the 1.5 mL centrifuge tube into a magnet rack, and wait till all the magnetic beads are attracted to the sidewall of the tube. Carefully transfer the supernatant into a new 1.5 mL centrifuge tube. Avoid pipetting the beads out.\nAccording to the original sample volume, pipette 30 µL (original sample: beads (volume) = 1:0.6) of magnetic beads, vortex, and centrifuge briefly (5 s). Set the tube for 5 min at RT for the DNA binding process.",
    "Insert the 1.5 mL centrifuge tubes into the magnet rack, and wait for 5 min till all the magnetic beads are attracted to the sidewall of the tube. Carefully remove and discard the supernatant. Avoid pipetting the beads out.\nPipette 300 µL of 70% ethanol into the 1.5 mL centrifuge tube, gently rotate the tube twice with a 180° angle, and move the beads along the tube wall for a thorough wash. Pipette and discard the supernatant. Avoid pipetting the beads out.\nRepeat the wash procedure once.\nRemove the 1.5 mL centrifuge tube from the magnet rack and centrifuge shortly (5 s). Insert the tubes back into the magnet rack, and wait till all the magnetic beads are attracted to the sidewall of the tube.\nCarefully pipette out the remaining liquid at the bottom. Keep the tube open to dry the beads at RT for 3-5 min. Keep moisture off the beads.\n\t\tNOTE: Close the lid immediately if any cracks emerge on the pellet of beads.\nRemove the tubes from the magnetic rack, pipette 25-30 µL of the DNA elution buffer into a tube, and close the cap and vortex. Centrifuge briefly (5 s) to get the turbid liquid to the bottom of the tube, and set the tube at RT for 5 min.\nInsert the tubes back into the magnetic racks, and wait till all the beads are attracted to the tube sidewall and the supernatant turns transparent. Carefully transfer the DNA solution into new 1.5 mL centrifuge tubes. Avoid pipetting the beads out.\nQuantify the concentration of DNA after fragment selection with a fluorometer11, store it at -20°C. Typically, the concentration of the DNA fragment selected ranges from 1.5-2.4 ng/µL.\n3. Preparation of the DNA library12",
    "NOTE: Materials used in this section are available in the Library Preparation Kit (Table of Materials).\nEnd repairing\n\t\nEquilibrate the magnetic beads at RT for 30 min.\nEquilibrate the DNA product of fragment selection in step 2.2.12 to RT. Check and record the tag on each vial containing the DNA.\nPrepare the DNA end-repair system with 30 µL of DNA products, 10 µL of end repairing buffer, 0.5 µL of end repairing enzyme, and 9.5 µL of nuclease-free water in a 1.5 mL centrifuge tube. Vortex the tube for 30 s and centrifuge briefly (5 s) at RT to get all liquid to the tube bottom.\nIncubate at 25 °C for 30 min, and briefly centrifuge (5 s) the tube after incubation.\nVortex or reverse-mix the magnetic beads, and transfer 75 µL of the magnetic beads into a tube containing end-repaired DNA samples (original sample: beads (volume) = 1:1.5). Pipette or gently vortex to mix the beads well and briefly centrifuge (5 s) to spin all the suspension down to the bottom of the tube. Set the tube for 5 min at RT for the DNA binding process. Flip the tubes gently to keep the beads dispersed.\nInsert the centrifuge tubes into the magnet rack, and wait for 5 min till all magnetic beads are attracted to the sidewall and the supernatant becomes transparent. Remove the supernatant, and avoid pipetting the beads out, keeping the tubes on the rack when pipetting.\nTransfer 300 µL of the newly prepared 70% ethanol into the tubes, gently rotate the tubes twice at a 180° angle, and move the beads along the tube wall for a thorough wash. Pipette and discard the supernatant. Avoid pipetting the beads out.\nRepeat the wash procedure once.",
    "Remove the 1.5 mL centrifuge tubes from the magnet rack, and centrifuge briefly (5 s). Insert the tubes back into the magnet rack, and wait for 5 min till all the magnetic beads are attracted to the sidewall of the tube.\nCarefully pipette out the remaining liquid in the bottom. Open the cap of 1.5 mL centrifuge tubes and dry the beads at RT for 3-5 min. Keep moisture off the beads.\n\t\tNOTE: Close the lid immediately if any cracks emerge on the pellet of beads.\nPipette 33 µL of DNA elution buffer into a tube, close the cap, and vortex. Centrifuge briefly (5 s) to get the turbid suspension to the bottom of the tube and set the tube at RT for 5 min.\nInsert the tubes back into the magnetic racks, and wait till all the beads are attracted to the sidewall and the solution turns transparent. Carefully transfer the DNA solution into new 1.5 mL centrifuge tubes with the proper tag, avoiding pipetting the beads out.\nBarcode ligation\n\t\nPlace the barcode ligation reagents in step 3.2.2 on ice to melt all the frozen reagents.\nPrepare the ligation system with 32 µL of end-repaired DNA products, 10 µL of nuclease-free water, 5 µL of ligase buffer, 1 µL of ligase, and 1 µL of P1 adapt in a 1.5 mL centrifuge tube. Pipette out 1 µL of each barcode reagent into the solution mix in the tube for one sample, vortex for 5 s, and centrifuge briefly (5 s) to get all liquid in the tube bottom.\n\t\tNOTE: When adding the barcodes, confirm that the number of barcodes and samples correspond; open only one barcode vial at each time to avoid the mixed pollution of barcodes; Change the gloves for every five or six barcodes added.",
    "Incubate the tubes at 25 °C for 30 min.\nPipette 75 µL (original sample: beads (volume) = 1:1.5) of the magnetic beads into a tube, and pipette or gently vortex to mix the beads well. Centrifuge briefly (5 s) to spin all the suspension down to the bottom, avoiding bead aggregation. Set the tube for 5 min at RT for the DNA binding process. Gently flip the tubes to keep the beads dispersed.\nInsert the centrifuge tubes into the magnet rack, and wait for 5 min till all the magnetic beads are attracted to the sidewall and the supernatant becomes transparent. Remove the supernatant and avoid pipetting the beads out, keeping the tubes on the rack when pipetting.\nTransfer 300 µL of the newly prepared 70% ethanol into tubes, gently rotate the tubes twice at a 180° angle, and move the beads along the tube wall for a thorough wash. Pipette and discard the supernatant. Avoid pipetting the beads out.\nRepeat the wash procedure once.\nRemove the 1.5 mL centrifuge tubes from the magnet rack and centrifuge briefly (5 s). Insert the tubes back into the magnet rack and wait for 5 min till all magnetic beads are attracted to the sidewall of the tube. Carefully pipette out the remaining supernatant in the bottom.\nKeep the tube cap open to dry the beads at RT for 3-5 min. Keep moisture off the beads.\n\t\tNOTE: Close the lid immediately if any cracks emerge on the pellet of beads.\nPipette 15 µL of the DNA elution buffer into the tube. Rinse the beads' pellet down to the bottom of the tube, seal the cap, and vortex. Centrifuge briefly (5 s) to get the turbid suspension to the bottom of the tube and keep the tube steady at RT for 5 min.",
    "Fragment amplification\n\t\nPlace the library buildingreagents on ice when the frozen reagent dissolves.\nTransfer 47.5 µL of the enzyme mix and 2.5 µL of the primer mix into the tube containing eluted DNA and beads, vortex for 5 s, and centrifuge briefly (5 s) to get all liquid to the tube bottom.\nSet the tube at RT for 5 min. Insert the tubes back into magnetic racks, and wait till all beads are attracted to the sidewall and the supernatant turns transparent. Carefully transfer the DNA solution into 0.2 mL PCR tubes with tags marked clearly, and avoid pipetting the beads out.\nIncubate the sample in a thermal cycler set with the following program: 72°C, 20 min; 98 °C, 2 min; 98 °C, 15 s; 62 °C, 15 s; 70 °C, 1 min (6 cycles); 70 °C, 5 min. Briefly centrifuge (5 s) the tube when the reaction is finished and store the products at 4 °C.\nTransfer the PCR products into a 1.5 mL centrifuge tube (low attachment). Add 97.5 µL (original sample volume: beads (volume) = 1:1.5) of magnetic beads into the tube when the reaction ends, pipette or gently vortex to mix the beads well, and briefly centrifuge (5 s) to spin all liquid down to the bottom. Avoid beads aggregation. Set the tube at RT for 5 min. Gently flip the tubes to keep the beads dispersed.\nInsert the centrifuge tubes into the magnet rack, and wait for 5 min until all magnetic beads are attracted to the sidewall and the supernatant becomes transparent. Remove the supernatant, avoid pipetting the beads out, and keep the tubes steady on the rack.",
    "Transfer 300 µL of the newly prepared 70% ethanol into tubes, gently rotate the tubes twice at a 180° angle, and move the beads along the tube wall for a thorough wash. Pipette and discard the supernatant. Avoid pipetting the beads out.\nRepeat the wash procedure once.\nRemove the 1.5 mL centrifuge tube from the magnet rack and centrifuge briefly (5 s). Insert the tube back into the magnet rack, and wait for 5 min till all magnetic beads are attracted to the sidewall of the tube. Carefully pipette out the remaining liquid in the bottom.\nKeep the tube cap open to dry the beads at RT for 3-5 min. Keep moisture off the beads.\n\t\tNOTE: Close the lid immediately if any cracks emerge on the pellet of the beads.\nPipette 22 µL of the DNA elution buffer into the tube, rinse the beads' pellet down, and close the cap and vortex. Centrifuge briefly (5 s) to get the turbid liquid to the bottom of the tube and set the tube at RT for 5 min.\nQuantify the concentration of constructed DNA library with a fluorometer11 and store the constructed DNA library at -20 °C; the concentration of the DNA fragment selected ranges from 0.6-10 ng/µL. Re-code the library information in the library database and store the samples accordingly.\n4. Preparation of sequencing template13,14\nNOTE: Materials used in this section are available in the Template Preparation Kit Set (Reagents/Solutions/Materials) of the Sequencing Reactions Universal Kit (Table of Materials).\nLibrary mix\n\t\nFill in the form of a pre-run records sheet in the server system and tag the sample tube with library concentration and barcode number. Avoid using the same barcodes on different samples in one run.",
    "Vortex and mix the library sample, and centrifuge briefly (5 s). Dilute all the samples to 100 pM with nuclease-free water, vortex for 30 s, and briefly centrifuge the sample.\n\t\tNOTE: Given that DNA has a mean length of 260 bp, and 1 bp is 660 g/mol, calculate the conversion of ng/µL to pM using the following equation: 1 ng/µL = 5,827.5 pM/L.\nPipette 10 µL of 100 pM diluted library into a 1.5 mL centrifuge tube, vortex for 30 s, and briefly centrifuge for 2 s. Keep the mixed library on ice.\nTemplate preparation\n\t\nStart the template amplification system and choose the clean program. Add the reaction oil to 1/2 of the tube, and add the emulsifier breaking solution to 1/3 of the tube.\nConfirm that the amplification plate and washing adapter are set in the ON position. Clean the waste bottle, and put a needle into a new 50 mL centrifuge tube to collect waste. Confirm the processed steps on the screen of the template amplification system. Press NEXT to start a clean program, which will take about 15 min.\nReplace the amplification plate with a new one after the clean program, insert the collection tubes containing 150 µL breaking solution II into the rotor, and place the bridge on the collection tubes. Add the reaction oil to 1/2 of the tube and the emulsifier breaking solution to 1/3 of the tube.\nEmulsify PCR reagent preparation: Equilibrate the emulsified PCR buffer at RT until it dissolves, briefly centrifuge (5 s) all reagents, and place them on ice before use.",
    "Pipette 120 µL of the emulsified PCR enzyme mix, 100 µL of template Ion Sphere Particle (ISPs) buffer, 170.5 µL of nuclease-free water, and 9.5 µL of the mixed library (100 pM) into a tube containing 2,000 µL of emulsified PCR buffer. Mix the solution well with repeated pipetting.\n\t\tNOTE: The mixed solution must be loaded on the template amplification system within 15 min; perform all procedures at RT.\nPlace a new filter for template preparation steady on the tube rack with the sample portal upwards. Vortex the solution for 5 s, centrifuge briefly (5 s), and transfer the solution into the sample portal of the filter after repeatedly pipetting 800 µL three times. Centrifuge the tube to decrease bubbles before the last injection. Avoid injecting air into the filter. Inject 200 µL of reaction oil II following the mixed solution.\nTurn the sample portal of the filter downwards, and replace the washing adapt with the filter. Insert the sample needle into the center hole of the rotor lid and then press the needle to the bottom.\nPress the RUN button on the screen, choose the program according to the corresponding kit, and press ASSISTED to check all steps. Press NEXT till the run is started; it takes about 4.5 h to finish.\nPress NEXT when the program is finished; the system will start a 10 min centrifugation. When the centrifugation stops, press the Open Lid button and move the collection tubes to racks. If the procedure does not go to the next step in 15 min, press on Final Spin to re-centrifuge.",
    "Remove the supernatant in the collection tube, leaving 100 µL of solution in the tube. Mix the remaining sample by pipetting and transfer the sample to the new 1.5 mL centrifuge tubes marked OT (One touch 2 system).\n\t\tNOTE: When pipetting the supernatant, avoid touching the tube bottom along the side.\nPipette 100 µL of nuclease-free water into each of the collection tubes, and transfer solution to the OT tube washed with repeated pipetting. Add 600 µL of nuclease-free water to the OT tube to make the total volume 1 mL, vortex for 30 s, and centrifuge at 15,500 x g for 8 min.\nGently remove the supernatant in the OT tube with 100 µL remaining and use the tip to discard the oil layer thoroughly. Add 900 µL of nuclease-free water, vortex for 30 s, and centrifuge at 15,500 x g for 8 min.\nRemove the supernatant until 20 µL is left, add template resuspending solution to make the volume 100 µL, vortex for 30 s, and briefly centrifuge for 2 s.\n\t\tNOTE: The solution obtained in this step must proceed to the next step in less than 12 h.\nRun the clean program on the template amplification system before shutting down its power.\nTemplate enrichment\n\t\nPrepare the melt-off mix with 280 µL of tween-80 and 40 µL of 1 M NaOH.\nWash the C1 beads. Vortex the C1 beads solution for 30 s. Transfer 100 µL of beads to a 1.5 mL centrifuge tube, insert the tube on a magnetic rack for 2 min and discard the supernatant.",
    "Transfer 1 mL of the C1 beads washing solution into the tube and vortex for 30 s. Centrifuge briefly (5 s), insert the tube into the magnetic rack for 2 min, and discard the supernatant. Pipette 130 µL of C1 bead resuspension solution into the tube, and mix the beads by repeated pipetting. Avoid creating bubbles.\nLoad 100 µL of the diluted library, 130 µL of C1 beads, 300 µL x 3 template washing solution, and 300 µL of the melt-off solution to the eight-well strips, as shown in Figure 1.\nInstall the eight-well strips on the enrichment module, load the pipetting tip, and set the 200 µL centrifuge tube in the collection position. Press on START to run the program; it takes about 35 min.\nThe sample will automatically be collected in the 200 µL centrifuge tube; close the lid and centrifuge it at 15,500 x g for 5 min. Check the tube bottom to verify if any C1 beads remain.\nIf C1 beads are remaining, repeatedly pipette the template solution 10x and insert the tube on the magnetic rack for 4 min. Transfer all the supernatant to a new 0.2 mL centrifuge tube and centrifuge at 15,500 x g for 5 min.\nIf no visible C1 beads are remaining, discard the supernatant till 10 µL is left, add 200 µL of nuclease-free water, and mix by pipetting 10x. Centrifuge at 15,500 x g for 5 min.\nDiscard the supernatant with 10 µL remaining, and add 90 µL of nuclease-free water to reach a total volume of 100 µL. Pipette up and down 10x to mix the solution, vortex for 5 s, and briefly centrifuge (5 s). The solution can be stored at 2-8 °C for less than 3 days.\n5. Next-generation sequencing9,15",
    "NOTE: All procedures in this section are performed on the DA8600 sequencing platform. Materials used in this section are available in the Sequencing Kit Set (Reagents/Solutions/Materials) of the Sequencing Reactions Universal Kit (Table of Materials).\nCheck all reagents and materials required in a run-on sequencing platform.\n\t\nSequencing reagent: Check for the availability of sequencing enzyme solution (6 µL), sequencing primers (20 µL), quality control template (5 µL), and dGTP/dCTP/dATP/dTTP (70 µL), stored between -30-10 °C.\nSequencing solution: Check for the availability of sequencing solution II (100 mL), sequencing Solution III (50 mL), annealing buffer (1,015 µL), loading buffer (10 µL), foaming agent (2 µL), chlorine tablet (1 tablet), and Streptavidin beads (100 µL), stored at 4 °C.\nMaterials: Check for the availability of 250 mL reagents tube (8), 250 reagents tube cap (8), sipper II (8), sipper (1), 2 L reagent bottle (1), and sequencing chip (1), stored at RT.\nWash the chip before use.\n\t\nSet one chip steady on a working plate, inject 100 µL of nuclease-free water into the sample hole, remove the solution in the out portal, and repeat the procedure.\nInject 100 µL of 0.1 M NaOH solution into the chip and incubate for 1 min at RT.\nInject 100 µL of isopropanol into the sample hole, remove extra solution in the out portal, and repeat the procedure again.\nCover the out portal with a filter paper, flow in the nitrogen to dry the remaining isopropanol in the chip's flow cell, and keep the ready-to-use chip at RT.\nSequencer initiation\n\t\nSwitch on the nitrogen valve and tune the pressure to 30 psi. Start the sequencer, press CLEAN on the main screen, and choose water or chloride to wash the machine accordingly.",
    "NOTE: Wash with water before every run, wash with chloride every week or the time the machine stands by with reagents over 48 h.\nChloride wash: Choose one reagent bottle specified for chloride wash, wash the bottle twice with 18 MΩ water and fill the bottle with 1 L of 18 MΩ water. Put one chloride tablet into the bottle, dissolve the tablet for 10 min, add 1 mL of 1 M NaOH, and then reverse the bottle to mix the solution. Use the chloride solution within 3 h after preparation.\nFilter 100 mL of chloride solution with a 0.45 µm filter and collect with two tubes. Install the two chloride tubes into positions C1 and C2. Press CLEAN on the main screen, and equip a chip for chloride wash.\nPress on NEXT and check all steps on the screen to start the wash program; the program will end in 30 min. Start a wash with water after the chloride wash.\nWater wash: Mark two tubes specific for water with C1 and C2, and wash the tubes with 18 MΩ water twice. Add 100 mL of 18 MΩ water to each of the water wash tubes, and set them in C1 and C2 positions, respectively.\nChoose the CLEAN program, install the chip prepared for water wash, press NEXT, and then check all steps on the screen to start the wash program.\nInitialization\n\t\nClean the wash bottle with wash solution II, mark it as W2, and wash it three times with 18 MΩ water.",
    "Clean the nitrogen tube with air-laid paper, insert it into the tube bottom, and tune the airflow to 0.5 L/min. Discharge the oxygen in the bottle and fill the bottle with 1,920 mL of 18 MΩ water. Add sequence solution II and 10 µL of 1 M NaOH to the bottle, close the cap, and reverse the bottle several times to mix the solution.\nMark two new tubes as W1 and W3. Add 32 µL of 1 M NaOH to W1, add 40-50 mL of 1x sequence solution III to W3, and close the caps.\n\t\tNOTE: 1x sequence solution III must be in a 37 °C water bath for 30 min when first used. Sequence solution II must be protected from light and stored at RT. The wash bottle must be replaced with a new one after being used 20 times.\nPress INITIALIZE on the main screen, change the sipper on the W1, W2, and W3 positions, set the tubes to their position accordingly, and seal them tightly by rotation. Install a chip for initialization and check the state parameters of the machine.\nPress NEXT to start the initialization program; it takes 40 min in the first section.\n\t\tNOTE: The gloves must be changed before changing the new sipper to avoid contaminating the body of the sipper. Once used for water wash and initialization, the chips can be applied to initialization, but do not use the chips used for chloride-wash chips for initialization.\nDissolve dGTP, dCTP, dATP, and dTTP on ice, and vortex to mix. Mark four new tubes as G, C, A, and T, and pipette 70 µL of the solution according to the tag of the tube.\nPrepare library for running.\n\t\nPlace the quality control template, primers, and enzyme solution on ice.",
    "Prepare the DNA library when the initialization program hass about 20 min left. Vortex the quality control template for 30 s to mix, and briefly centrifuge for 2 s. Transfer 5 µL of the quality control template into the template solution, vortex for 5 s, and centrifuge the tube for 15,500 x g for 5 min. Remove the supernatant by carefully pipetting, avoid touching the pellet, and leave a 10 µL volume in the tube.\nAdd 15 µL of annealing buffer into the tube; the total volume of the solution is 25 µL.\nVortex the sequence primers when it fully dissolves on ice and centrifuge briefly for 2 s. Transfer 20 µL of the sequence primers into the tube from the former step, vortex for 5 s, shortly centrifuge for 2 s, and then store at RT before use.\nLoading the sample and sequencing\n\t\nPipette 55 µL of the sample solution prepared in the previous step and inject it into the sample hole of the chip.\nSet the chip on the centrifuge; keep the notch towards the outside and the sample portal inside, balancing it with another used chip, and centrifuge for 10 min.\nPrepare the loading solution.\n\t\t\nMix 0.5 mL of the annealing buffer and 0.5 mL of nuclease-free water in a 1.5 mL centrifuge tube. Mark it as 50% annealing buffer and use within 7 days.\nMix 0.5 mL of isopropanol solution and 0.5 mL of annealing buffer. Mark it as 50% wash buffer and use within 24 h.\nMix 6 µL of sequence enzyme and 60 µL of 50% annealing buffer. Mark it as enzyme reaction buffer, and place the solution on ice after preparation.\nMix 49 µL of 50% annealing buffer and 1 µL of foaming agent, and mark it as foaming solution.",
    "Blow 100 µL of air into the foaming solution, repeatedly pipette the solution till the bubbles are in a dense foaming state, and keep the volume of foam around 250 µL.\nPlace the chip on the bench after centrifuge, inject 100 µL of foam into the sample hole, and remove the extruded solution in the out portal. Set the chip back in the centrifuge, and centrifuge briefly for 30 s.\nRepeat steps 5.6.4-5.6.5.\nInject 100 µL of 50% washing buffer twice, and remove the extruded solution in the out portal after every injection.\nInject 100 µL of 50% annealing buffer three times, and remove the extruded solution in the out portal after every injection.\nInject 65 µL of 50% enzyme reaction buffer, avoid bubbles, and remove the extruded solution in the out portal.\nStabilize the loaded chip at RT for 5 min, and install the chip on the sequencer chip portal. Choose the plan programmed in step 6, check the information, and start the run; it takes about 1.5 h to finish.\nPerform the water wash program within 72 h after the run ends. Perform the chloride wash before water wash when the time exceeds 72 h. Shut down the sequencer, and close the valve of the nitrogen.\n6. Plan an instructed sequencing run in the reporter server system16\nNOTE: All procedures in this section are performed on Ion Proton Sequencer with the reporter server system.\nSign in to the server system, select the Plan tab, and click on Plan Template Run. Choose the Whole Genome as run type, and select the appropriate template from the list of planned run templates.\nIn the Plan tab, enter or make the following selections:",
    "Enter a new run plan name according to the batch of samples, select hg19 (Homo sapiens) from the Reference Library dropdown list, and select None from the Target Regions and Hotspot Regions dropdown lists.\nEnter the number of barcodes used in the sample set, select a barcode from the dropdown list for each sample, and enter a unique, descriptive name, which can be helpful to group and track the sample. Avoid the use of the default Sample 1 and so on.\nSelect None in the Ion Reporter tab, click Next, and select DNA in the application and Whole Genome as the target technique.\nIn the Kits tab, verify the selections, or make changes while it is appropriate for a run.\n\t\t\nSelect Ion Plus Fragment Library Kit from the Library Kit Type dropdown list. Select Ion PI HI-Q OT2 200 kit in the Template Kit dropdown list, and choose OneTouch as the default. Select Ion PI HI-Q Sequencing 200 kit from the Sequencing Kit dropdown list.\nEnter 300 flows, select Ion PITM Chip from the Chip Type dropdown list, and select IonXpress from the Barcode Set dropdown list.\nCancel the selection of Mark as Duplicates Reads and the selection of Enable Realignment.\nChoose the appropriate plugin in the Plugins tab to perform data analysis in step 7. Complete the selections in the projects step, click on Next, and click the Plan Run in the lower right corner to list the Planned Runs.\nIn the Planned Runs tab, select the newly created run and check all the settings in the review window.\n7. Data analysis\nAnalyze the copy number variants (CNVs) using a bioinformatics workflow.",
    "NOTE: The CNVs were analyzed in bioinformatics workflow with the implementation of an algorithm based on a hidden Markov model (HMM)17; the model uses read coverage across the genome to predict the copy number or whole-number ploidy status (i.e., 0, 1, 2, 3, etc.). The overall bioinformatics pipeline was built in the plugin of a sequence server system, which is demonstrated in Figure 2. The bioinformatics analysis step takes an average of 4 h to complete.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}