{
  "id": 10391,
  "origin_website": "Jove",
  "title": "Spatial Temporal Analysis of Fieldwise Flow in Microvasculature",
  "procedures": [
    "All animal experiments were approved and conducted according to the Institutional Animal Care and Use Committee guidelines of Indiana University, and adhered to the NRC guide for the care and use of animals.\n1. Surgical Preparation for Intravital Microscopy\nNOTE: This is not a survival surgery. Once section 1 \"Surgical preparation for intravital microscopy” is begun, work cannot be paused until the completion of section 2 \"Intravital microscopy”.\nAcclimatize 9–10 week-old male C57BL/6 mice, for at least 4 days and fast for 16 h prior to studies.\nWeigh the animal, sedate with 5% isoflurane and place on a heating pad to maintain body temperature. Use an oxygen flow rate of 1–2 L/min and maintain sedation with 1-2% isoflurane. Check reflexes by toe pinch. Monitor temperature using a rectal thermometer. Monitor heart rate and respiration visually.\nWhen anesthesia is stable, shave the area for jugular cannulation placement and the area below the rib cage for the exposure of the liver.\nFor jugular cannulation, make a 1 cm left ventral incision 1–2 cm below the mouse’s jaw. Clear away all fat and fascia surrounding the jugular vein. Tie off the anterior end of the jugular using 06 suture string to prevent bleeding.\nMake a tiny nick in the jugular vein and slide the cannula (30 G x ½ in, needle), needle holder and polyethylene tubing (0.011 x 0.024 inches2 attached to a Luer stub adapter and filled with 0.9% saline) in about 1 cm, and secure at the posterior end of the jugular using 0-6 suture string.\nUsing the jugular cannula deliver 70 kDa fluorescein dextran (to a dose of 30 mg/kg via injection of 0.1 mL of a 9 mg/mL solution in saline).",
    "Expose the liver for imaging by making a 4–6 cm incision across the torso, 1–2 cm below the middle of the rib cage.\nPlace a wet (soaked in 0.9% saline) 2 x 2 inches2 gauze sponge below the left lateral liver lobe. Place tape on the periphery of the glass window of a 40 mm coverslip-bottomed dish and apply cyanoacrylate adhesive to the tape. Press the glass plate to the liver and using cotton tipped applicators press the gauze into the glue on the tape to minimize tissue motion for microscopy.\nMove animal to the microscope stage. Add sterile 0.9% saline into the coverslip-bottomed dish to keep the liver moist throughout the imaging session. Maintain temperature at 36–37 °C via heating pads mounted on the stage, a heating pad placed over the animal and an objective heater.\n2. Intravital Microscopy\nPerform intravital microscopy on an inverted epifluorescence microscope equipped with a video camera capable of high-speed image capture.\nNOTE: Here, a Xenon arc lamp, fluorescein-specific excitation (480–500 nm) and emission (507–543 nm) filters, Plan Fluor 20x, N.A. 0.75 water immersion objective, and a high-speed sCMOS camera were used.\nSelect the area of interest for capillary blood flow analysis using minimal illumination.\nSet the exposure time short enough for the camera to be able to acquire 100 fps. Set illumination level to clearly visualize red blood cell shadows and the topology of the vasculature while also avoiding phototoxicity and photobleaching of the fluorescent probe.\nCollect images at a rate of 100 fps. Set the camera pixel resolution between ~0.65 and ~1.3 µm/pixel. Set frame size between 512 x 512 and 1024 x 1024 pixels. Set bit depth between 8 and 16 bits. Use the highest resolution, frame size and bit depth that still allows 100 fps image collection on the system.",
    "Save time series file(s) as a sequence of TIF files or as native camera/microscope format if Bio-Formats14 in FIJI can open the native format files.\nImage multiple areas over time. Maintain the mouse on the microscope stage for up to 2 h. Euthanize the mouse at the end of imaging.\nNOTE: The duration of the time series will be based upon balancing the need to image for an interval of time that embraces the variability, while not affecting the viability of the tissue. The duration of the time series may also be dictated by file size considerations; a 1 min time series of 1024 x 1024 pixel 16-bit images collected at 100 fps will generate a file that is 12 GB in size. File size considerations may also dictate frame size and bit depth used. There are no explicit size limits within STAFF.\n3. Define the Vascular Network Using TrakEM2 in FIJI\nNOTE: The protocol can be paused after saving work at any point in section 3.\nDownload and install FIJI from https://imagej.net/Fiji/Downloads.\nNOTE: Version 1.51n of Fiji was used for this project, and can be downloaded from https://downloads.imagej.net/fiji/Life-Line/fiji-win64-20170530.zip. Note that on Windows, FIJI should be installed in the user space and not in Program Files.\nOpen the movie file in FIJI using File > Open or using File > Import > Image sequence. Select a single image from the stable images between respirations where the topology of the vascular network is easy to see. Select Image > Duplicate and duplicate the selected single image (not the stack) and save the image in a new folder. Do not include spaces in file or folder names.",
    "Set up a new blank TrakEM2 project by selecting File > New > TrakEM2 (blank). Select the new folder containing the single image from the movie as the project folder. The TrakEM2 windows will open.\nRight-click in the main work area and select Import > Import Image. Navigate to the single image saved in step 3.3 and select it.\nRight-click in the main work area again and select Display > Autoresize canvas/Layer set. Left-click in the main work window. The image will fill the work area.\nTo select the areas in the image that contain the vascular network, setup area list selection in TrakEM2. In the smaller TrakEM2 window (Template, Project Objects, Layers) right-click on \"• anything”. Select Add new child > area list.\nIn the smaller TrakEM2 window, drag \"Template > anything\" onto \"Project Objects > project\". Then drag \"Template > anything > • area list\" onto \"Project Objects > project > anything\". Under \"Project Objects > project > anything\", • area list will now be present.\nIn the main TrakEM2 window under the Z space tab, a bar labeled area list was created. Click to select it. In the main TrakEM2 window also select the paintbrush tool. Press Shift and roll the mouse wheel to select an appropriate size for the paintbrush, e.g., smaller than the diameter of the vasculature. To save the TrakEM2 setup press Control + S keys.\nPaint the vascular network using the paintbrush tool. To erase hold down Alt while using the paintbrush tool. Do not include out-of-focus regions. Save often using Control + S.",
    "When labeling of the vascular network is complete, right-click in the main TrakEM2 window and select Export > AreaLists as labels (tif). In the popup window select Scale 100% and Export All area list. Close TrakEM2 windows and choose yes for Save project.\nThe image of AreaLists will open and may appear as a blank black image. In the main FIJI Menu select Image > Adjust > Brightness/Contrast. In the B&C window press the auto button and the AreaList will become visible. In the main FIJI menu select Image > Lookup Tables > Invert LUT. Save this image of black labels on white background and close the image.\nOpen the labels file in FIJI. Select Plugins > Skeleton > Skeletonize. Save the skeletonized image as a tif. Use the skeleton.tif file as one of the input files needed to run the STAFF flow analysis. When saving the file, do not use spaces in file name.\nManually edit the skeleton file as needed, by placing a gap (using the paint tool) in the line drawing for example at locations where branches in the vasculature have not been captured because they go out of the image plane.\n4. Prepare the Movie Sequence for STAFF Analysis\nOpen the movie file in FIJI using File > Open or File > Import > Image sequence. Select a time period of the image sequence for flow analysis (can be seconds to minutes, hundreds to tens of thousands of frames) where tissue position has remained stable over time, except for during respiration.",
    "Select Image > Duplicate and duplicate the selected portion of the sequence by typing in the numbers of the beginning and end frames. Check image spatial and temporal calibration under Image > Properties and correct if necessary. Save the image file as a TIF (or as an uncompressed AVI). This movie.tif is needed as an input file to run STAFF analysis. Do not include spaces in file name.\n5. Install STAFF Macros into FIJI\nNOTE: (Important) Multiple folders within the FIJI folder subdirectories have similar file names, some capitalized, some not. Be certain that the correct folders are selected when installing STAFF.\nDownload the STAFF macros from https://github.com/icbm-iupui/STAFF.\nTo install, first open the FIJI folder.\nOn Windows find the folder where FIJI is installed in the user space, most commonly on the desktop. On MacOS find the FIJI icon in the Applications folder, right click and select Open.\nIn the FIJI folder, open the plugins folder. Inside the plugins folder, open the Macros folder. Copy STAFF.ijm into this Macros folder: Fiji\\plugins\\Macros\\STAFF.ijm.\nIn the FIJI folder, open the plugins folder. Copy STAFF_Dir.jar into this plugins folder: Fiji\\plugins\\STAFF_Dir.jar.\nIn the FIJI folder, open the macros folder. Inside this macros folder, open the AutoRun folder. Copy STAFF_Loader.ijm into this AutoRun folder: Fiji\\macros\\AutoRun\\STAFF_Loader.ijm.\nStart FIJI and verify macro installation. To verify installation, select Plugins > Macros. When correctly installed the dropdown menu will include: Open-Create Project, Analyze Skeleton, Edit Time Intervals, Analyze Flow and Produce Spatial Map.\nIf these commands are not present in the Macros menu, select Plugins > Macros > Install, open the Fiji\\plugins\\Macros folder, select the STAFF.ijm file, then click the OK button. The commands should now appear in the Plugins > Macros menu.\n6. Quantifying Vascular Flow Using STAFF\nCreate a new project.",
    "Select Plugins > Macros > Open-Create Project and follow prompts to create or update a configuration file.\nFrom the Open-Create Project menu, navigate to and select the Project Directory, Input File Folder and the input files Movie.tif and Skeleton.tif. Edit the auto-populated output file names if necessary.\nInput values for shortest segment length (20 µm), max speed measured (2,000 µm/s) and max speed mapped (1,000 µm/s).\nNOTE: The product of shortest segment length and frames per second gives the max flow speed that can theoretically be measured. The highest capillary flow speeds reported in literature are around 2,000 µm/s15. In the liver, we observed that capillary flow speeds generally averaged around 300 µm/s and rarely exceeded 1,000 µm/s.\nType in the values for pixel size and frame rate for the image sequence (from image metadata or experimental notes). These values require user input. Check the Flicker Correction box if the images have periodic background intensity flicker.\nSelect parameters for best visualization of the data. Select max speed mapped to include about 95% of the data so that the data is mapped across the full range of the color scale. STAFF maps high speed outliers to the high-speed end of the color scale.\nAnalyze the skeleton.\nSelect Plugins > Macros > Analyze Skeleton. The skeleton.tif file will open and the Region of Interest (ROI) Manager will open and run.\nNOTE: Analyze Skeleton classifies each pixel by its number of neighbors as either at an endpoint, at a junction, or within a segment. For each segment an identifying number (ID number), a calibrated branch length and the spatial coordinates of the branch ends are recorded.",
    "Wait for segment IDs to appear on the skeleton, the segment list to appear in the ROI manager, and a popup indicating that ROI Manager file for the skeleton is saved. Click OK.\nVerify that between respiration movements, the skeleton remains over where red blood cells pass through the capillary (e.g., not the edge and not outside the capillary). Display the labeled segments as an overlay on the movie, by opening the movie file, then dragging the ROI zip file onto the open movie. Play the movie with the segments overlaid.\nSelect time intervals.\nSelect Plugins > Macros > Select Time Intervals. Wait while the macro generates a kymograph from a single segment over the total time for the movie. From this kymograph, the user selects time intervals for analysis. Use Control + + keys to increase the size of the kymograph if needed.\nThe rectangle selection tool is automatically activated. Draw a rectangle around each time interval. A good starting point for time interval length is the 1–2 s interval between respirations, which are apparent as horizontal blurred regions in the kymograph.\nClick the T key or the Add button in the ROI manager to record time interval selections. Repeat for as many time intervals as desired. Make selections sequentially from the top (or left) to bottom (or right) of the kymograph.\nEvaluate parameter choices (from Open-Create Project) by selecting a small number of time intervals (3 to 4) and completing analysis for just those intervals, since Analyze Flow (the next step) can take hours for large datasets.\nClick OK in the Make an ROI for each time interval window when done. A popup window appears when the selected intervals have been saved in the Project Folder. Click OK.\nAnalyze flow.",
    "Select Plugins > Macros > Analyze Flow and the Analyze Flow Parameters dialogue box opens and displays the values entered in the Open-Create Project step. Edit if needed then click OK.\nThe Output File Names dialogue box opens and displays the names entered in the Open-Create Project step. Edit if needed then click OK.\nA dialogue box opens asking if the user is ready to begin analysis. Click OK and the analysis will begin. Wait for a dialog box that opens to indicate when Flow Analysis is complete.\nNOTE: Time needed depends on processor speed and size of the dataset.\nConfirm that results files have been stored as .csv format spreadsheet files in the Project Folder.\nNOTE: Output files include: segment_velocities.csv contains velocity values that have positive and negative values indicating flow direction. Cells representing segments less than the minimum length contain the text SHORT. Cells with velocity values greater than the maximum measured speed contain the text OUT (for outlier). kym_ang.csv contains kymograph angles measured by the Directionality plugin in FIJI. good_fit.csv contains goodness of fit of a curve to the distribution of angles measured from each kymograph. Poor goodness of fit (< 0.8) can indicate hidden branch points in a segment, change in velocity during the time interval, lamp or room light flicker.\nCheck to verify that segment_velocities.csv contains few OUT values. If there are a large number of OUT values, verify that the minimum segment length to analyze is not less than 15–20 µm, then rerun Analyze Flow. If the new segment_velocities.csv still contains a large proportion of OUT values, then check the flicker correction box, then rerun Analyze Flow.\nProduce spatial maps.",
    "Select Plugins > Macros > Produce Spatial Map and the Spatial Map Parameters window will open, displaying the values entered in the Open-Create Project step. Edit if needed, or to continue select OK.\nWatch as a temporal sequence of spatial maps of flow velocities is generated with color indicating flow speed. The output is in the form of a .tif image stack with one image for each time interval. Scroll through the .tif stack to visualize spatial and temporal variation in flow. Save the stack as an AVI file (uncompressed for maximum portability) to share as a movie.\n7. Quantitative Analysis Using STAFF Output\nOpen the segment_velocities.csv file in a spreadsheet or statistical analysis program. These values have positive or negative sign that indicates direction of flow relative to the start/stop points of that segment (recorded in the Segment ROI file).\nMake a new spreadsheet page containing the absolute values of all the velocity values. Use these values to calculate overall average flow velocity, average flow velocity for all vascular segments over time, flow velocity for each vascular segment over time, and make histograms of velocity distributions.\nCalculate values around specific morphological regions, or other regions of interest by first finding the specific relevant segments in the labeled skeleton and then performing analyses on these selected segments.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}