{
  "id": 7058,
  "origin_website": "Bio",
  "title": "Preparation of <em>Nippostrongylus brasiliensis</em> Larvae for the Study of Host Skin Response",
  "procedures": [
    "Part I: Infection by percutaneous administration Skin preparationNote: This step does not require anaesthesia of the mouse, however the experimenter may wish to utilise anaesthesia prior to the described skin preparation in order to increase the ease of the procedure, as well as ensure optimal welfare of the animal. Depilation of the infection siteOne day prior to infection, prepare the mouse skin for injection by depilation. For this purpose, hold the mouse by the scruff of the neck. Using tweezers, take out hairs that surround the infection site, around ~1.5 cm2 (typically on the abdomen or the back, see Video 1 and Figure 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. The mouse is hold by the scruff of the neck, while using tweezers the hairs are removed on the belly skin. This video was made at Monash University according to guidelines from the AEC committee of the Alfred campus, Melbourne Australia on Animal Care with authorization number E/1846/2018/M.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3849/bioprotoc-10-24-3849-g001.jpgFigure 1. Typical surface area obtained after depilation and tape stripping (here, the skin has been excised one day after infection to perform imaging). Scale bar = 0.4 cm.Note: Do not use depilatory cream or a razor, as they are toxic for larvae, and may injure the skin resulting in suboptimal larval penetration or alterations to the host immune response. We found that the parasite does not naturally penetrate the ear skin, but prefers to enter the skin in areas of the body that are warmer. Tape stripping of infection siteApply a tape band of 1.5 cm2 on the previously depilated skin area. Pull the tape off the skin. Repeat the application and the removal motion with a new tape strip for a total of ten times to the same skin area.",
    "Note: This step allows the breakage of the stratum corneum to facilitate entry of the parasite. The skin usually appears shiny after tape stripping. Larval preparationOn the day of infection, prepare sufficient Nb larvae (L3) for the planned experiment by washing larvae two times with 10 ml of PBS in a 15 ml tube. For each wash allow the larvae to settle to the bottom of the tube by gravity at room temperature. This should take approximately 10-15 min and the larvae should form a pellet at the bottom of the tube. Carefully remove the supernatant using a flexible plastic pasteur pipette, discard the supernatant and replace it with 10 ml of fresh PBS.Note: 100 Nb L3 are used per application, with a total of 3 applications (300 Nb L3) per mouse. The waste generated from washing Nb L3 needs to be treated with virkon or bleach for 30 min before disposal. Prepare a suspension of Nb L3 containing 100 L3 per 10 μl of PBS. Calculate the dilution required to generate this suspension by quantifying the larvae generated in step one using a stereomicroscope. Always thoroughly mix the worm solution prior to counting by inverting the tube several times before placing a drop of 2 μl of the worm solution onto a slide, or into a Petri-dish, and counting all of the larvae present in the drop. Adjust the larval concentration by adding more PBS or by removing PBS from the tube containing larvae that have settled to the bottom by gravity (as described in Step B1).Note: A minimum of three counts should be performed and averaged to optimally estimate the larval concentration. Topical application and infectionHumidify the treated area of the skin by applying a wet piece of tissue paper.",
    "Note: This step does not require anaesthesia of the mouse, however the experimenter may wish to utilise anaesthesia prior to the described skin preparation in order to increase the ease of the procedure, as well as ensure the optimal welfare of the animal. Remove the tissue and apply 10 μl of larval solution to the skin, then spread the solution evenly using a manually bent 10 μl tip to create a thin layer of liquid (see Video 2).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. The skin of the mouse is prepared as reported in Video 1 and humidified using a wet piece of tissue paper. The larval solution is then pipetted using a 10 μl tip. The tip is manually bent and the drop of larvae is applied and evenly spread onto the skin.Repeat three times every 15 min.Notes: Ensure thorough mixing of the larval suspension between each application to avoid settling of larvae. To check for efficacy of infection, mice can be sacrificed one or two days post-infection and the worm burden assessed in the lungs (please see bioprotocol Camberis et al., 2016). Alternatively, live imaging can be conducted following infection (see Figure 2). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20201217/20201217174246_5821.jpgFigure 2. Typical image of fluorescently-labelled larvae applied on the skin using the method described herein and imaged with a stereomicroscope. The protocol for fluorescent labelling of the larvae is available in Bouchery et al., 2017.Part II: Infection by intradermal injection Depilation of the infection siteOne day prior to infection, prepare the mouse skin for injection by depilation. For this purpose, hold the mouse by the scruff of the neck. Using tweezers, take out hairs surrounding the infection site around ~1.5 cm2 (typically on the abdomen or the back).",
    "Larval preparationOn the day of infection, prepare sufficient Nb larvae (L3) for the planned experiment by washing larvae two times with 10 ml of PBS in a 15 ml tube. For each wash allow the larvae to settle to the bottom of the tube by gravity at room temperature, this should take approximately 10-15 min and the larvae should form a pellet at the bottom of the tube. Carefully remove the supernatant using a flexible plastic pasteur pipette, discard the supernatant and replace it with 10 ml of fresh PBS.Note: 250 Nb L3 in 10 μl PBS are used per injection. Transfer the pellet of L3 into a 1.7 ml micro-centrifuge tube using a 1 ml pipette, allow the larvae to form a pellet at the bottom of the tube by gravity for approximately 15 min, and then discard any remaining PBS.Note: The larvae usually harbour bacteria at their surface. To avoid bacterial contamination during infection, it is possible to wash the larvae in antibiotic solution. To perform this wash, add 500 ul of PBS containing Penicillin/Streptomycin 1,000 μg/ml (Gibco), Gentamicin 1.6 μg/ml (Sigma) to the pelleted larvae. Incubate at room temperature for 30 min and then rinse in sterile PBS. This step can also be used for the percutaneous infection. However, after skin penetration, we have observed less bacterial contamination, potentially as the bacteria are naturally “cleaned” from the parasite surface during the entry into the skin. Prepare a suspension containing 250 Nb L3 per 10 μl PBS by quantification using a stereomicroscope. Always thoroughly mix the worm solution prior to counting by inverting the tube several times before placing a 2 μl drop of the worm solution onto a slide, or into a Petri-dish, and counting all of the larvae present in the drop.",
    "Adjust the larval concentration by adding more PBS or by removing PBS from the tube containing larvae that have settled to the bottom by gravity.Note: A minimum of three counts should be performed and averaged to estimate optimally the larval concentration. Mix worm solution thoroughly prior to infecting each mouse. Draw 10 μl of larval solution in an insulin syringe. Inject intradermally.Note: To check for efficacy of infection, mice can be sacrificed one or two days post-infection and the worm burden assessed in the lungs (please see bioprotocol Camberis et al., 2016). Do not inject more than 10 μl of solution, as this will damage the skin architecture."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}