{
  "id": 5977,
  "origin_website": "Bio",
  "title": "Preparation of Amyloid Fibril Networks",
  "procedures": [
    "Initial protein purificationTo ensure that the final morphology of the amyloid fibrils is as homogenous as possible, commercial grade protein (either hen egg white lysozyme or β-Lactoglobulin) must be further purified to remove trace impurities, such as ash or lipids that can affect fibril morphology. This initial purification is performed by dialysis as originally outlined in Jung et al. (2008). All steps in this protocol should be performed with appropriate Personal Protective Equipment (PPE) (gloves, lab coat and safety glasses).Calibrate the digital pH meter as per the manufactures instructions using pH 10, 7 and 1.68 calibration standards. Or just pH 7 and 1.68 if three point calibration is not available on the pH meter used. Prepare a 10% (weight/weight) solution of protein in fresh MilliQ water (Recipe 1) in 15 ml centrifuge tubes. Once the protein is completely dissolved into the solution, adjust the pH to 4.6 using the digital pH meter, by drop-wise addition of 1 N hydrochloric acid (HCl). To remove and precipitate impurities, centrifuge the solution at 20,400 x g (for the 1215-H rotor listed above this is equivalent to 15,000 rpm) for 15 min. Note: Ensure that the centrifuge is properly balanced before use. Discard the pelleted impurities and add 1 N HCl (dropwise) to the supernatant to adjust to pH 2.Pass the acidified supernatant through a 0.22 μm filter into a length of the dialysis tubing closed at one end using the dialysis tubing clamp.Note: Dialysis tubing should be cut to an appropriate length so that it is no more than ~70% full to prevent bursting. Seal the dialysis tube using a second clamp and immerse the filled tubing in a large beaker filled with an aqueous solution of 0.01 N HCl (dialysing solution), and containing a 60 x 8 mm magnetic stir bar.",
    "Note: The precise volume of the beaker is not important but it should be at least one order of magnitude larger than the volume of dialysate, we typically used beakers with a volume of at least 3 L.Dialysis should occur at 4 °C, with the dialyzing solution under constant stirring for 5 days. The dialyzing solution should be replaced at least every other day. Note: Ensure that the fresh dialyzing solution is pre-chilled to 4 °C before switching. Constant stirring at 4 °C will likely require a refrigerated room that can safely contain a stirrer plate. If this is not available then the dialysis tubing can be kept in a regular refrigerator with no stirring, but it may be necessary to increase the total dialysis time and replace the dialyzing solution more frequently to maintain osmotic pressure.After dialysis, the protein solution in the dialysis bag should be readjusted to pH 2 (1 N HCl) and freeze-dried.Note: Where possible an acid trap should be used with the freeze dryer as prolonged exposure to acidic solutions can lead to corrosion of the equipment. To freeze-dry the samples, first, to prevent the fibril suspension boiling under reduced vacuum, pre-freeze the fibril suspensions in a regular laboratory freezer. Once frozen switch on the vacuum pump connected to the freeze-dryer and allow it to warm up for 15 min. Turn on the freeze-dryer, select freezing mode and allow the instrument to cool to approximately -55 °C. Connect the round bottom flask containing the frozen fibril suspension to one of the outer ports of the freeze dryer, open the main valve on the vacuum pump and then slowly open the valve on the port with the attached round bottom flask.",
    "Switch the instrument to its ‘main drying’ mode, and leave the round bottom flask attached until completely dry (dependent on volume but overnight drying was typically used for 10-20 ml suspensions). At the end of the freeze-drying close the valve to the main pump and release the vacuum in the chamber of the freeze-dryer. If attached to the walls of the round bottom flask, then the freeze-dried fibrils can be gently scraped off with a spatula. The purified, freeze-dried powder can now be stored at -20 °C until it is required for fibril self-assembly.Note: Never turn off the pump when there is still a vacuum in the chamber as this could result in oil being sucked from the pump.Amyloid fibril self-assemblyAll steps in this protocol should be performed with appropriate Personal Protective Equipment (PPE) (gloves, lab coat and safety glasses). As the reaction occurs at 90 °C for 24 h or more, particular care should be taken to ensure the heated oil bath is properly set up and does not pose any danger to yourself or other users of the laboratory.Dissolve the purified protein in MilliQ water making a 2% solution (weight/weight), using the pH meter to adjust the acidity to pH 2 by dropwise addition of 1 N HCl (Recipe 2). Pass the resulting acidified solution through a 0.22 μm filter into a glass vial, with a heatproof sealable lid (Figure 1). Prepare the oil bath by filling an appropriate heat-proof glass beaker (e.g., a crystallization dish) containing a magnetic stirrer bar with clean silicon oil to a level where it will completely cover the protein solution in the glass vial but not totally submerge the vials (Figure 1).",
    "Heat the silicon oil in the crystallization dish to 90 °C with gentle stirring (60 rpm, using a digital stirrer hotplate). Stirring is required to ensure homogeneous heating of the oil. At this point, it is important to emphasize that the oil bath should be stable at 90 °C before addition of the protein solution, to ensure constant heating over the entire reaction. Note: If the hotplate is not equipped with a thermometer and thermostat, then the temperature of the oil bath should be checked and adjusted manually using an external thermometer (deviations in temperature will affect the morphology of the resultant fibrils).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180212/20180212211638_3415.jpgFigure 1. Heated (and stirred) silicon oil bath with a clamped glass vial containing soluble protein/amyloid fibrilsUsing a stand and clamp carefully secure the glass vial containing the protein solution in the stirred hot oil bath. Fibril formation occurs over time via a progressive denaturing and hydrolysis of the protein and the subsequent self-assembly of the resultant amyloidogenic peptide fragments in a mechanism outlined in Adamcik and Mezzenga (2012). Control over the resultant fibril diameters can be exerted by adjusting the reaction times (Lara et al., 2011; Reynolds et al., 2014). Single protofilaments start to appear after around 5 h; these protofilaments stack together in a modular way (Adamcik et al., 2010; Adamcik and Mezzenga, 2012) to form thicker multi-fibrillar mature fibres over time, before eventually closing up into nanotubes (Lara et al., 2013) or, with the addition of salt [20-50 mM (NaCl) at 2% wt protein], forming hydrogels (Bolisetty et al., 2012). It is worth noting that both the mean diameter and concentration of the fibrils increases over time, therefore it is non-trivial to obtain high concentrations of fibrils composed of only 1 or 2 protofilaments.",
    "For cell culture applications, we have found that incubation of lysozyme in the hot oil for between 24-30 h results in fibrils of an optimum concentration and morphology to promote cell growth after adsorption to a 2D substrate (Reynolds et al., 2014; Gilbert et al., 2017). For β-Lactoglobulin fibrils less extensive investigations on the effects of fibril diameter on cell responses have been performed, however fibrils formed after just 5 h incubation have been shown to support MSC culture (Gilbert et al., 2017). Upon removing the protein fibrils from the oil bath, the glass vial should immediately be placed in an ice bath to rapidly quench the reaction and prevent further assembly. Success of the reaction can be qualitatively assessed by observing the color and turbidity of the reaction products. Before heating, the dissolved protein solution should be completely transparent and colorless (Figure 2A), after fibril formation some cloudiness and a yellow hue should be apparent (due to the non-soluble suspension of fibrils) (Figure 2B). For a protocol describing how to quantitatively assess the morphology of the fabricated fibrils by Atomic Force Microscopy (AFM) see Charnley et al. (2018).Before use as a cell culture material, suspensions of lysozyme fibrils were dialyzed in order to neutralize the pH. The procedure in Step A4 can be repeated, however now pure MilliQ water should be used as a dialyzing solution and 24 h dialysis with no requirement to change the dialyzing solution is sufficient. This procedure shouldn’t be performed for β-Lactoglobulin fibrils due to concerns about a lack of long-term stability at pH values above its isoelectric point (Jones et al., 2011; Gilbert et al., 2014) instead additional washing steps are employed to remove the acidic solvent after fibril adsorption to the mica discs before incubation with the cells (see Step C2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180212/20180212211909_6823.",
    "jpgFigure 2. Visual differences between dissolved monomeric protein and amyloid fibril suspension. Photographs of the protein solutions present before heating (A) and the resulting fibril suspension (B) after 24 h of heating. Note the fibril solution has become slightly opaque and has a yellowish hue due to the presence of a suspension of amyloid fibrils.Fabricating Amyloid Fibril NetworksMany solid supports may be suitable for amyloid fibril deposition. However, in our experiments we exclusively use muscovite mica discs (diameter 12 mm). Mica was chosen for a number of reasons. First, at pH 7 lysozyme fibrils carry a net positive charge, and mica carries a net negative charge, thus electrostatic interactions ensure a good coverage of amyloid fibrils on the substrates. Second, mica is composed of many flat sheets held together by weak non-covalent interactions, these sheets can be easily cleaved producing a pristine, dust free surface. Third mica substrates are almost atomically smooth therefore make ideal substrates for characterization by Atomic Force Microscopy (AFM) (Charnley et al. [2018]). It is worth noting that the first listed benefit of mica (encouraging fibril binding through electrostatic interactions) is only appropriate for lysozyme fibrils, and not β-Lactoglobulin fibrils which have no net charge at neutral pH.Cleave mica disk. There are many methods of cleaving mica, we prefer to use double-sided tape to stick the disc down to a lab bench and then use a fine tipped pair of tweezers to cleave the top layer from the stuck down disk. Deposit 10-20 μl of the 2% (initial monomeric protein concentration) amyloid fibril suspension onto the center of the freshly cleaved mica disc.",
    "Incubate at room temperature for 10 min, before gently rinsing the surface of the mica disc with 1 ml of MilliQ water, and gently drying the disc using either a compressed air or nitrogen line. Care should be taken when drying laminated mica discs, to ensure that a homogenous drying is achieved and the dispersed amyloid suspensions are not concentrated at one end of the mica disc during the drying process. Whilst it is not strictly a part of the protocol for fabricating the amyloid fibril networks, it is important to note that immediately before using the fibril networks as substrates for cell culture they should be sterilized to remove any bacterial contamination. In our experiments, we did this by incubating the mica disks with the adsorbed networks in a solution of the antibiotic Pen-Strep (100 ngml-1) for 1 h see Gilbert et al. (2017) for details. Sterilization in an Autoclave was avoided due to concerns that it would damage the fibril network."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}