{
  "id": 2148,
  "origin_website": "Cell",
  "title": "Analysis of the interplay between hepatitis B virus-positive hepatocytes and Kupffer cells ex vivo using mice as a model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHydrodynamic injection\nTiming: 30 min\nThe use of hydrodynamic injection for gene delivery into mouse hepatocytes was first reported more than 20 years ago (Liu et al., 1999[href=https://www.wicell.org#bib3]; Zhang et al., 1999[href=https://www.wicell.org#bib5]). The volume of the DNA solution used for the injection is about 8% of the mouse body weight. The solution is injected rapidly into mice via the tail vein within 5–8 s.\nPrepare reagents and instruments required for hydrodynamic injection and mouse blood collection (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig1.jpg\nFigure 1. Hydrodynamic injection\n(A) Reagents and the apparatuses needed for the injection.\n(B) Dilating the tail blood vessels with a heat lamp.\n(C) Anesthetizing the mouse with ketamine.\n(D) Immobilizing the mouse with a restraining device.\n(E) Inserting the needle in the distal portion of the tail vein and injecting the DNA solution into the tail vein.\n(F) Removing the mouse from the restrainer for recovery.\nSelect 8-week-old C57BL/6 mice weighing about 19–25 g.\nMix 20 μg HBV DNA with a volume of DPBS equivalent to 8% of the mouse body weight. For a 20-gram mouse, the volume is approximately 1.6 mL.\nDilate tail blood vessels by warming mice with a heat lamp (120 W bulb) for 3–5 min before performing the injection (Figure 1[href=https://www.wicell.org#fig1]B).\nCritical: Be cautious not to overheat the mice such as by putting the lamp too close to the mice or warming the mice for too long. Excessive movements or sweating of mice is a sign of overheating. Alternatively, the tail can also be warmed in 50°C water for a couple minutes.\nDilute ketamine10-fold with DPBS and anesthetize the mouse by intraperitoneal (i.p.) injection of 20 μL of the diluted ketamine (Figure 1[href=https://www.wicell.org#fig1]C).\nImmobilize the mouse with a mouse restrainer (Figure 1[href=https://www.wicell.org#fig1]D).",
    "With the heat lamp on, locate the dilated vein on the ventral side of the mouse tail, preferably near the tip of the tail.\nWipe the intended injection site with an alcohol pad for disinfection and to further increase the visibility of the vein.\nAdd 8% body weight-equivalent of the DNA-saline solution to the syringe. Connect the needle to the syringe and make sure there are no air bubbles.\nNote: With the needle facing up, tap the syringe with your finger a few times to move the air bubbles to the needle, and then carefully expel the air until a small amount of solution is removed.\nWith the syringe needle beveled side up and nearly parallel to the mouse tail, insert the needle in the distal portion of the tail. This allows a better view of the needle when it enters the vein. Inject the entire volume of the DNA solution into the tail vein of the mouse with a constant speed and complete the injection within 5–8 s (Figure 1[href=https://www.wicell.org#fig1]E).\nCritical: The injection speed is critical for obtaining a good DNA transfection efficiency of hepatocytes.\nRemove the mouse from the restrainer and place it into the cage for recovery (Figure 1[href=https://www.wicell.org#fig1]F).\nMouse blood collection for serologic assays\nTiming: 4 h\nHere is an easy method for the collection of 100–500 μL blood from the mouse facial vein. This method involves the anesthetization of the mouse, the pricking of the freckle with a lancet, and the collection of the blood. Note that HBV is a human pathogen and therefore people working with mice should be vaccinated against HBV.\nCollect blood from the mouse facial vein on day 3 after hydrodynamic injection.",
    "To collect the blood, place the non-dominant hand on the mouse, then use the thumb and index finger to grasp the mouse. Find the hairless freckles on the side of the jaw.\nPick up the lancet with the other hand. Point the lancet at the distal end of the mouse’s face near the base of the ear or the base of the distal end of the mouth. Prick the freckle with a lancet (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig2.jpg\nFigure 2. Mouse blood collection and measurement of HBsAg and HBeAg\n(A) Pricking the freckle of the mouse with a lancet.\n(B) Collecting blood from the facial vein.\n(C) Centrifugation and collection of the serum.\n(D) Measuring the levels of HBsAg and HBeAg in the mouse serum by ELISA. The results represent the mean ± SEM.\nCollect 100–500 μL of blood in a 1.5 mL Eppendorf tube (Figure 2[href=https://www.wicell.org#fig2]B). After collecting the blood sample, put the mouse back into the cage. Bleeding should stop immediately.\nCentrifuge the sample at 12,000 × g for 5 min at 18°C–25°C.\nTransfer the supernatant (i.e., the serum) to a new Eppendorf tube and store the serum at −20°C (Figure 2[href=https://www.wicell.org#fig2]C).\nPause point: Serum can be stored at −20°C or −80°C.\nAs an injection control, measure HBV surface antigen (HBsAg) and e antigen (HBeAg) levels using the HBsAg and HBeAg ELISA kits following the manufacturer’s protocols[href=https://www.intlimmunodiagnostics.com/eia-hepatitis] (Figure 2[href=https://www.wicell.org#fig2]D).\nIsolation of hepatocytes and Kupffer cells from mouse liver\nTiming: 3 h",
    "Here is the method to isolate hepatocytes and Kupffer cells from the mouse liver. This method yields hepatocytes and Kupffer cells with a high viability and purity. In this method, the mouse liver is perfused twice: the first one with a solution containing EGTA and BSA, and the second one with a solution containing collagenase. The purpose of the first step is to remove calcium ions (i.e., by EGTA) from epithelial cells to cause the rapid destruction of intercellular junctions and the loss of cell–cell contacts. The second step is to use collagenase to disrupt the supporting extracellular matrix of liver lobes. This is followed by the use of Percoll to isolate hepatocytes and the use of the OptiPrep density gradient to separate Kupffer cells from other nonparenchymal cells (NPCs).\nReagents\nPre-warm Solution A and Solution B in a 42°C water bath.\nPrepare 70% ethanol solution (in spray and in a bottle).\nAutoclave at least 50 mL of water (needed for washing the pump system each time).\nInstruments\nMini-pump with size 14C tube.\nWater bath (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig3.jpg\nFigure 3. Procedures to isolate hepatocytes and Kupffer cells from the mouse liver\n(A) Reagents and instruments.\n(B) Surgical tools.\n(C) Abdominal cavity opened with the intestine aside to uncover the venous system.\n(D) Part of the portal vein and the suture beneath it held at both ends by a hemostat.\n(E) A suture under the upper part of vena cava.\n(F) An inserted 24-gauge catheter reaching the inferior vena cava downstream of the liver.\n(G) The pale liver after a two-step perfusion.\n(H) The liver removed from the mouse and placed in a petri dish with Solution C.\n(I) Breaking the perfused liver into single cells with tools.\n(J) Liver lobes dispersed into single cells.",
    "(K) Separation of NPCs and hepatocytes by centrifugation. Scale bars in centimeters (CM) are provided for panels (C–H). See Methods Video S1[href=https://www.wicell.org#mmc1] for details.\nSurgical tools (scissors, forceps, sutures, syringes, and catheters (24 gauge for mouse) (Figure 3[href=https://www.wicell.org#fig3]B).\nProtocol (See also Methods Video S1[href=https://www.wicell.org#mmc1]).\nProcedures for cleaning the pump.\nPre-clean the pump with 70% ethanol solution for more than 5 min.\nFlush the pump system with at least 50 mL of autoclaved water and ensure that all the water is completely removed.\nFill the pump system with Solution A.\nCirculate Solution A (38°C–39°C) through the pump using a pumping rate of 7 mL/min.\nCritical: Pre-warming Solution A is essential for improving the cell viability.\nAnesthetize the mouse with ketamine as described in step 7.\nApply 70% ethanol to the mouse abdomen for disinfection.\nPlace the sedated mouse on the operation board and fix the mouse legs with the tape to the board.\nOpen the abdominal cavity.\nCut open the mouse abdomen (Figure 3[href=https://www.wicell.org#fig3]C).\nMove the intestine to the right to uncover the venous systems (Figure 3[href=https://www.wicell.org#fig3]C).\nInsert the suture.\nPlace a suture under the upper part of the portal vein (suture 1).\nHold both ends of the suture with a hemostat (Figure 3[href=https://www.wicell.org#fig3]D).\nPlace another suture under the upper part of the vena cava (beside the right kidney) and tie a loose knot (suture 2) (Figure 3[href=https://www.wicell.org#fig3]E).\nOpen the thoracic cavity.\nOpen the thoracic cavity by cutting the diaphragm and chest bones beside the xiphisternum.\nGrab the xiphisternum with a tweezer and open the chest over the mouse face to unveil the heart.\nTurn the operation board around and puncture the heart’s center using the sharp end of a 24-gauge catheter.",
    "Insert the 24-gauge catheter, which is connected to the tube in Solution A, into the right auricle and allow the catheter to reach the inferior vena cava downstream of the liver (Figure 3[href=https://www.wicell.org#fig3]F).\nCritical: This is a critical step for a successful liver perfusion. It is essential to ensure that the catheter reaches the inferior vena cava downstream of the liver. This is important for the uniform distribution of the solution for liver digestion.\nPerfuse the liver with Solution A.\nCut the inferior vena cava.\nStart the perfusion of Solution A at a flow rate of 7 mL/min.\nCut the portal vein with a scissor after lifting suture 1. Do not cut the suture.\nLift suture 2 by grabbing both suture ends to remove remaining blood in the liver and then tie suture 2. Both steps c and d need to be carefully performed to allow smooth perfusion of Solution A.\nPerfuse the liver with a total volume of 50 mL of Solution A.\nCarefully monitor the flowing of Solution A through the liver.\nThe color of the liver should turn pale (Figure 3[href=https://www.wicell.org#fig3]G).\nThis step should be done as quickly as possible.\nPerfuse the liver with Solution B.\nAfter the perfusion of 50 mL Solution A, transfer the liquid inflow tube of the perfusion pump to the tube containing pre-warmed Solution B. Be careful not to trap any air bubble.\nPerfuse the liver with at least 25 mL but no more than 40 mL of Solution B at the flow rate of 7 mL/min.Continue the perfusion until the liver is swollen and shiny.\nBreakage of the liver can be seen.\nStop the pump and cut the inferior vena cava in the upper region of suture 2.\nIsolation of Liver Cells.",
    "Quickly remove the liver from the mouse abdominal cavity (Figure 3[href=https://www.wicell.org#fig3]H).\nPlace the liver in a petri dish with 35 mL of Solution C (Figure 3[href=https://www.wicell.org#fig3]H).\nHold the liver with tweezers and gently tap the perfused liver to disperse cells from the liver (Figure 3[href=https://www.wicell.org#fig3]I).\nContinue the process until all liver lobes disintegrate and separate into single cells (Figure 3[href=https://www.wicell.org#fig3]J).\nFilter liver cells with a 70 μm nylon cell strainer.\nCentrifuge the cells in a 50 mL tube at 60 × g for 2 min with both acceleration and break set at 3 to separate NPCs (supernatant) and hepatocytes (pellet) (Figure 3[href=https://www.wicell.org#fig3]K).\nPurification of Hepatocytes.\nPrepare the Percoll solution by mixing 5.2 mL of 10× Percoll buffer with the Percoll stock solution to a final volume of 40 mL. Keep the Percoll solution at 4°C.\nTransfer the supernatant, which contains NPCs, to a new tube on ice for later purification of Kupffer cells and leave behind a little bit more than 3 mL of the solution and the pellet, which contained hepatocytes, in the tube.\nAdd 30 mL of diluted Percoll solution to the pelleted cells in the tube. Gently resuspend the cells by pipetting. Avoid vortexing.\nCentrifuge at 1,200 × g in Eppendorf 5804R centrifuge for 3 min at 18°C–25°C.\nCells pelleted are purified hepatocytes.\nCount cells and seed them (at a density of 0.3 × 106/mL) in hepatocyte culture medium in a collagen-coated plate (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig4.jpg\nFigure 4. Hepatocytes and Kupffer cells purified from the mouse liver\n(A) The morphology of hepatocytes two days after plating.\n(B) The morphology of Kupffer cells. In both (A) and (B), the scale bar is 20 μm.",
    "(C–F) Analysis of the purity of Kupffer cells by flow cytometry. Kupffer cells on petri dishes were collected by trypsinization at 37°C for five minutes, and 2 × 105 Kupffer cells were incubated with isotype control antibodies (red) or antibodies against cell markers of interest (blue) on ice for 30 min. Cells were then rinsed with DPBS three times and subjected to flow cytometry for the analysis of F4/80 (C), dead cells using Fixable Blue Dead Cell Staining Kit (D), CD11b and CD45 (E), and TIM-4 and CD45 (F). Panel (C) was adapted from Figure S1A of Li et al. (Li et al., 2022[href=https://www.wicell.org#bib2]). Panels (D) and (E) were from different experiments.\nPurification of Kupffer Cells.\nCentrifuge the supernatant isolated in step 33b at 583 × g for 8 min at 18°C–25°C.\nResuspend the cell pellet in 5.5 mL DMEM and overlay cells on a step gradient consisting of OptiPrep Density Gradient Media with densities of (from top to bottom) 1.035 (1.5 mL), 1.042 (1.5 mL), 1.056 (1.5 mL) and 1.081 (2 mL). Overlay the centrifuge tube with additional DMEM if necessary.\nCentrifuge at 21,400 × g for 20 min at 18°C–25°C using a Beckman SW40Ti rotor.\nIsolate Kupffer cells at the interface of densities 1.042 and 1.056, mix with 5 mL DMEM in a 15 mL tube, and pellet cells at 583 × g for 8 min at 18°C–25°C.\nResuspend Kupffer cells in 5 mL DMEM.\nPellet cells at 583 × g and resuspend cells in 5 mL DMEM. Repeat this step one more time to rinse Kupffer cells.\nRemove the supernatant carefully and leave 1–2 mL medium behind depending on the pellet size.\nResuspend the pellet, stain dead cells with trypan blue, and count the purified Kupffer cells with a hemocytometer (i.e., Neubauer chamber) (Figure 4[href=https://www.wicell.org#fig4]B).",
    "Plate Kupffer cells in Kupffer cells culture medium (Figure 4[href=https://www.wicell.org#fig4]B).\nIncubate in 5% CO2 incubator at 37°C for 3 h and remove nonadherent cells with an aspirator. Kupffer cells on the plate can be resuspended by treatment with trypsin at 37°C for 3 min if there is a need.\nVerify the purity of Kupffer cells by flow cytometry (Figures 4[href=https://www.wicell.org#fig4]C–4F).\n    Your browser does not support HTML5 video.\n  \nMethods Video S1. Liver perfusion for isolation of hepatocytes and Kupffer cells, related to steps 22–33\nCo-culturing of HBV-positive hepatocytes and Kupffer cells\nTiming: 3 days\nHepatocytes isolated from mice injected with the HBV DNA or from HBV transgenic mice are seeded at a density of ∼0.3 × 106 cells per well of a collagen-coated 6-well plate as described in step 33f.\nCritical: The use of collagen-coated plate is necessary for maintaining the morphology and the differentiation phenotype of hepatocytes.\nPlace hepatocytes in a 37°C CO2 incubator for 4 h to allow the cells to attach to the plate and reach a confluency of 80%–90%.\nRinse cells once with DPBS and incubate them in the hepatocytes culture medium. If there is a need for long-term culturing, change the medium once every three days.\nNote: Hepatocytes can be maintained for up to a week without notable change of morphology.\nPerform the co-culturing experiment in the 6-well plate using the Transwell insert with 0.4 μm pore size for physical separation of two cell types.\nUse sterile forceps to gently place Transwell inserts in each well above freshly attached hepatocytes.\nPlate Kupffer cells at a density of 2 × 106 cells per Transwell insert. Co-culture Kupffer cells and HBV-positive hepatocytes in a medium containing 1:1 ratio of hepatocytes culture medium and Kupffer cells culture medium for three days.",
    "By their design, Transwell inserts will be secured in place by the walls of the well. They will remain suspended in the media and not touch the bottom of the plate, allowing exchange of soluble factors between hepatocytes at the bottom and Kupffer cells in the ±insert.\nCollect and replace the conditioned medium with fresh medium on day 1 after co-culturing at 37°C in a humidified incubator with 5% CO2, and collect the conditioned medium again on day 3.\nMeasure the levels of HBsAg and HBeAg using commercial ELISA kits following the manufacturer’s protocols[href=https://www.intlimmunodiagnostics.com/eia-hepatitis] (Li et al., 2022[href=https://www.wicell.org#bib2]). Examples of the ELISA results are shown in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig5.jpg\nFigure 5. Effect of Kupffer cells on HBV gene expression in hepatocytes\n(A and B) The incubation media of hepatocytes isolated from control mice (Cont HC), hepatocytes isolated from HBV transgenic mice (HBV HC), and HBV HC co-cultured with Kupffer cells isolated from control mice were analyzed by ELISA for the levels of HBsAg (A) or HBeAg (B) at different time points. This figure was modified from Figure S1B of (Li et al., 2022[href=https://www.wicell.org#bib2]). The results represent the mean ± SEM. ∗∗∗p<0.001.\nMetabolic analysis of Kupffer cells: Oxygen consumption rate (OCR)\nTiming: Around 4 h for the OCR assay\nTiming: 30 min for preparation of the Seahorse analyzer and microplate\nTiming: 10 min for preparation of the assay medium\nTiming: 15 min for preparation of compound stock solutions and working solutions\nTiming: 25 min for loading compound solutions into the ports\nTiming: 2 h for running the assay\nTiming: 30 min for data analysis\nDay before assay\nTurn on the Agilent Seahorse XFe/XF Analyzer and allow it to warm up for at least 5 h.",
    "Seed 105 Kupffer cells per well in Seahorse XF plate. Use appropriate medium for the cell culture. For Kupffer cells, use Kupffer cell culture medium for 200 μL/well.\nNote: For more information, see the basic procedure, “Seeding Cells in Seahorse XF Cell Culture Microplates,” available at the Agilent Cell Analysis Learning Center[href=https://www.agilent.com/en/product/cell-analysis/how-to-run-an-assay].\nAdd water to the Seahorse XF sensor box, and then place the calibrators in a non-CO2 incubator16 h at 37°C.\nDay of assay\nPrepare XF medium and XF supplement in the cell culture hood. Transfer a sufficient amount of XF medium to a 50 mL tube.\nNote: There is no need to warm up the medium and the supplement before this step.\nPrepare the assay medium by supplementing Seahorse XF DMEM with 1 mM pyruvate, 2 mM glutamine, and 10 mM glucose.\nNote: The medium composition can vary depending on the cell types or the desired experimental conditions.\nWarm up the assay medium in a 37°C water bath before use.\nPrepare compound stock solutions and working solutions\nTake the foil bag and the decapper out from the Seahorse XF Cell Mito Stress Test Kit box.\nOpen the bag, remove the three test tubes containing oligomycin (blue cap), FCCP (yellow cap), and rotenone/antimycin A (red cap) and place them on a small test tube rack.\nInsert the decapper’s tines into the cap’s inner lip and remove the cap from each tube.\nResuspend the contents of each tube with the volumes of assay medium shown in the Solution 1 table.\nGently pipet the medium up and down about 10 times to dissolve the compound.\nUse the compound stock solution to prepare the working solution for loading into the injection port on the sensor cartridge. A constant compound concentration and variable loading volume approach is recommended for each compound.",
    "Note: This method requires compound working solutions to be prepared at defined concentrations and different volumes of each compound to be loaded into the injection port (see Solution 2 table). For example, for the preparation of 20 μM oligomycin, mix 600 μL stock solution of oligomycin (100 μM) with 2,400 μL DMEM in the polystyrene reservoir. Load 20 μL diluted oligomycin (20 μM) per port using a multichannel pipette. Because the Seahorse XF cell culture microplate has 180 μL DMEM, the final concentration of oligomycin is 2 μM.\nPrepare 2–3 mL of working solution for each compound in the analytical medium, using the volumes shown in the Solution 2 table for the XFe/XF96 analyzer.\nLoad compound solutions into the ports on sensor cartridge\nThe correct port loading technique can be found in the basic procedure “Loading Sensor Cartridges with Compounds” in the Agilent Cell Analysis Learning Center[href=https://www.agilent.com/en/product/cell-analysis/how-to-run-an-assay].Read the relevant information before loading the compound. In addition, make sure that the sensor box is adequately hydrated before use. Refer to Figure 6[href=https://www.wicell.org#fig6] for port locations.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig6.jpg\nFigure 6. The location of ports in sensor cartridges\nPrepare the Agilent Seahorse XF cell culture microplate for the assay\nRemove the Seahorse XF cell culture microplate from the 37°C CO2 incubator and examine it under a microscope to confirm cell confluency.\nRinse Kupffer cells twice with 200 μL of Seahorse XF DMEM assay medium, leaving 20 μL behind after each rinse.\nAfter the second rinse, add 160 μL of Seahorse XF DMEM assay medium to each well to a final volume of 180 μL/well.\nPlace the Seahorse XF cell culture microplate at 37°C without CO2 for 45 min to 1 h before running the assay.",
    "Critical: It is essential to keep the culture microplate at 37°C without CO2 for 45 min to 1 h, as CO2 can interfere with the analysis.\nRunning the assay\nOpen the Wave software and retrieve the saved assay template file. Then, follow the instructions as described below:\nBrowse and open the saved design file, select the Review and Run tab, and click Start Run.\nPlace the sensor box with the calibration plate into the instrument and click “I am ready” when prompted. Calibration takes about 15–30 min (remove the cartridge lid and double-check to make sure that the microplate orientation is correct).\nAfter calibrating and equilibrating the cell culture microplate, click “I am ready” when prompted.\nLoad the Seahorse XF cell culture microplate and click “I am ready” to run the assay.\nData analysis\nThe Seahorse XF Mito Stress Test Report Generator automatically calculates Seahorse XF Cell Mito stress test parameters from Wave data and export the data to Excel or GraphPad Prism (Li et al., 2022[href=https://www.wicell.org#bib2]) (Figure 7[href=https://www.wicell.org#fig7]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1628-Fig7.jpg\nFigure 7. Metabolic analysis of Kupffer cells\n(A And B) The OCR (A) and ECAR (B) of Kupffer cells determined by Seahorse assay.\nMetabolic analysis of Kupffer cells: Extracellular acidification rate (ECAR)\nTiming: 5 min for preparation of the Seahorse analyzer and microplate\nTiming: 5 min for preparation of the assay medium\nTiming: 20 min for preparation of the microplates for the assay\nTiming: 15 min for preparation of stock compound solutions\nTiming: 15 min for dilution of stock compound solutions\nTiming: 10 min for loading sensor cartridges\nTiming: 30 min for download the glycolytic rate template into the Seahorse analyzer\nTiming: 2 h for running the glycolytic rate assay\nDay before assay\nTurn on the Seahorse XFe/XF96 Analyzer and let the temperature stabilize.",
    "Seed 105 Kupffer cells per well in the Agilent Seahorse XF Cell Culture Microplate using the Kupffer cells culture medium.\nHydrate a sensor cartridge in Seahorse XF Calibrant medium in a non-CO2 incubator at 37°C for 16 h.\nFor XFe/XF96 analyzers, select the Template for XF Glycolytic Rate Assay in Wave. Make necessary group modifications to tailor the template for the specific assay design.\nDay of assay\nPrepare Agilent Seahorse Glycolytic Rate assay medium: XF DMEM with 1 mM pyruvate, 2 mM glutamine, and 10 mM glucose. This medium contains an appropriate amount of HEPES and does not require pH adjustment.\nNote: It is recommended to start with 1 mM pyruvate, 2 mM glutamine, and 10 mM glucose. However, the assay medium composition can vary depending on the cell type or the desired research conditions.\nPrepare the XF medium and XF supplement in the cell culture hood. Transfer a sufficient amount of XF medium to a 50 mL tube.\nNote: There is no need to warm up the medium and the supplement before this step.\nPrepare the assay medium by adding XF supplement to XF medium to the desired concentration.\nNote: No pH adjustment is required when using the recommended supplement concentration.\nWarm up the assay medium in a 37°C water bath.\nPrepare agilent seahorse XF cell culture microplates for assays\nRemove the Seahorse XF cell culture microplate from the 37°C CO2 incubators and examine it under a microscope to confirm confluency and good cell morphology.\nCritical: The cell quality and confluency are important for the assay.\nRemove the cell culture medium from the Seahorse XF cell culture. Next, rinse cells twice with 200 μL warm Seahorse XF DMEM assay medium using a multichannel pipette. Leave 20 μL behind after each rinse.",
    "After the second rinse, add 160 μL of Seahorse XF DMEM assay medium to each well and incubate cells in the assay medium in a non-CO2 incubator at 37°C for 45–60 min before the assay.\nRemove the assay medium again and add 160 μL of fresh and warm Seahorse XF DMEM assay medium to each well for a final volume of 180 μL/well assay medium. The cells are now ready for the XF assay.\nPrepare stock compounds\nRemove the foil bag from the kit box, open the bag and take out the red cap vial Rot/AA and the green cap vial 2-DG.\nTap the vial to make sure that the powder is at the bottom of the tube before opening the vial.\nPrepare the relevant assay medium as shown in the Solution 3 table using a P1000 pipette. Vortex the tubes for 1 min to ensure thorough dissolution of the compounds.\nDiluting the compounds\nThe dilution of compounds for loading the cartridge is shown in the Solution 4 table. It is important to note that if a different starting assay volume or port volume is used, the compound concentrations will need to be adjusted to obtain the correct final concentrations for each well.\nLoad sensor cartridge\nStandard Assay - No compound injection is required before the glycolytic rate assay. Load the compound into the following ports of the hydrated sensor cartridge (Figure 6[href=https://www.wicell.org#fig6] and the Solution 4 table):\nPort A: For injection of Rot/AA.\nPort B: For injection of 2-DG.\nRunning the assay\nDownload the Agilent Seahorse Glycolytic Rate template into the Seahorse XFe analyzer. If the Seahorse XFe template already exists, this step can be skipped.\nRun the seahorse XFe/XF96 glycolytic rate assay\nSelect Seahorse XF Glycolytic Rate Assay template from the list of available templates and click Design.",
    "Confirm or modify the default groups and conditions in specific assays in the section Groups/Conditions.\nLicense plate map for your assay: Confirm or modify the default groups and conditions in the specific assay.\nAssign the distribution of the samples.\nPlace the sensor box with the calibration plate into the instrument and click “I am ready” when prompted. Calibration takes about 15–30 min.\nNote: Remove the cartridge lid and double-check to ensure that the microplate orientation is correct.\nAfter calibrating and equilibrating the cell culture microplate, click “I am ready” when prompted.\nLoad the Seahorse XF cell culture microplate and click “I am ready” to run the assay.\nAnalysis using the agilent seahorse glycolytic rate assay report generator\nThe XF Glycolytic Rate Assay Report Generator automatically calculates Seahorse XF Glycolytic Rate Assay test parameters from Wave data that are exported to Excel or GraphPad Prism (Li et al., 2022[href=https://www.wicell.org#bib2]) (Figure 7[href=https://www.wicell.org#fig7]B)."
  ],
  "subjectAreas": [
    "Immunology",
    "Metabolism",
    "Cell Isolation",
    "Cell Culture",
    "Cell Biology",
    "Microbiology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}