{
  "id": 15174,
  "origin_website": "Jove",
  "title": "ATAC-seq Assay with Low Mitochondrial DNA Contamination from Primary Human CD4+ T Lymphocytes",
  "procedures": [
    "This improved protocol provides step-by-step instructions for performing ATAC-seq of CD4+ lymphocytes, from the starting material of whole blood through data analysis (Figure 1).\n1. Isolation of CD4+ T Cells from Whole Blood\nNOTE: The starting material for this protocol is 15 mL of fresh whole blood collected using standard procedures, allowing the source of the starting material to be selected based on research requirements. Scale the protocol as needed. Pre-warm phosphate buffered saline (PBS) + 2% fetal calf serum (FCS) to room temperature (RT) and adjust the centrifuge to RT before starting the CD4+ T cell enrichment procedure.\nAdd 750 µL of human CD4+ T cell enrichment cocktail to 15 mL of whole blood in a 50 mL conical tube and mix gently by inversion. Incubate at RT for 20 min. When incubation is complete, add 15 mL of PBS + 2% FCS to the tube and mix gently by inversion.\nPrepare a fresh 50 mL conical tube with 15 mL of density medium. Carefully layer the diluted blood sample onto the top of the density medium, being sure not to disrupt the density medium/blood interface that forms. Centrifuge for 20 min at 1,200 x g and RT with acceleration set to 1 and the descending brake OFF.\nNOTE: It is critical to set the acceleration to 1 and descending brake OFF on the centrifuge to avoid disruption of the cell layer in the density medium.\nCollect the enriched CD4+ T cells from the density medium/plasma interface using a narrow stem transfer pipette. Transfer the collected cells to a fresh 50 mL conical tube. Centrifuge the collected CD4+ T cells for 8 min at 423 x g and RT.",
    "NOTE: Make sure to return the centrifuge acceleration to 9 and descending brake to ON for step 1.3 and all of the following steps.\nDiscard the supernatant and wash the cell pellet twice with 50 mL of PBS + 2% FCS, centrifuging for 8 min at 423 x g and RT. Discard the final supernatant wash and suspend the washed cell pellet in 2 mL of PBS + 2% FCS.\nCount cells using a hemocytometer. To continue with ATAC-seq, proceed to step 2.3. To freeze cells for later processing, proceed to step 1.6.\nAdd 1 mL of fresh freezing medium (90% FCS + 10% dimethyl sulfoxide) per 1 million cells. Aliquot 1 mL of cells in freezing medium in cryogenic safe tubes. Place tubes at -80 °C overnight in a slow-freezing container. The next day, transfer tubes to liquid nitrogen for long-term storage.\nNOTE: 1 million CD4+ T cells will be isolated per 2 mL of original volume of whole blood. Freeze 500,000 cells in 1 mL aliquots of freezing medium. Make fresh freezing medium at every use.\n2. Activate and Purify CD4+ T Cells\nNOTE: This rapid protocol for activating and purifying CD4+ T cells only requires 48 h and results in 95% viable, activated CD4+ T cells. Cool the centrifuge to 4 °C before beginning the protocol.\nThaw 1 vial (500,000) of CD4+ T cells in a 37 °C water bath until the ice has just melted. Gently transfer cells to a 15 mL conical tube containing 9 mL of pre-warmed Roswell Park Memorial Institute-1640 (RPMI-1640) media supplemented with 10% FCS, hereafter referred to as complete RPMI.\n\tNOTE: Do not let cells thaw completely to avoid exposure to DMSO.",
    "Centrifuge for 6 min at 1500 x g and 4 °C. Discard the supernatant and gently suspend the pellet in 2 mL of complete RPMI. Repeat the spin down, discard the supernatant, and gently suspend cells in 0.5 mL of complete RPMI.\nCount the cells using a hemocytometer. Adjust the density of the cell suspension with complete RPMI to plate 50,000 cells in 200 µL per well of a 96-well round bottom plate.\nNOTE: From one frozen tube of 500K CD4+ T cells, plate 10 wells of 50,000 CD4+ T cells in 200 µL per well.\nPrepare magnetic beads conjugated with human T-activator anti-CD3 and anti-CD28 antibodies.\nAliquot 12.5 µL of human T-activator CD3/CD28 beads per ATAC-seq sample to a 1.5 mL tube. Wash the beads with 1 mL of 1x PBS and place the tube on a magnet for 1 min.\nCarefully remove and discard the clear supernatant, remove the tube from magnet, and suspend the beads in 13 µL complete RPMI per ATAC-seq sample.\n\t\tNOTE: Calculate the amount of beads necessary based on the number of ATAC-seq samples being processed. This protocol requires 12.5 µL of CD3/CD28 beads per 500,000 cells, which constitutes one ATAC-seq sample.\nActivate the CD4+ T cells. Collect 500,000 cells in 2.1 mL of complete RPMI medium in a 15 mL conical tube and add 12.5 µL of pre-washed human T-activator beads. Mix gently by inverting the tube.\nGently transfer the cells with beads to a sterile reservoir and plate 200 µL of cells with beads per well of round bottom 96-well plate using a multi-channel pipette. Incubate for 48 h in a 37 °C, 5% CO2 incubator.",
    "Post incubation, centrifuge the 96-well plate for 8 min at 423 x g and RT. Remove 100 µL of medium per well from the 96-well plate, collecting it to a conical tube before discarding to ensure no bead loss. Resuspend the cell pellet in the remaining 100 µL and collect all in a 1.5 mL tube.\nNOTE: 10 wells of activated T cells will be collected in a 1 mL volume.\nPerform CD4+ isolation. Add 50 µL of pre-washed CD4 conjugated beads to 500,000 cells in 1 mL of complete RPMI. Combine beads and cells by pipette. Incubate for 20 min at 4 °C in the fridge. Agitate beads and cell mixture every 6 min.\nNOTE: This protocol is to be used for one sample of 500,000 cells. Adjust as necessary for two or more samples of 500,000.\nWhen the incubation is complete, place the tube on the magnet for 2 min. Remove and discard the supernatant when clear. Wash the bead-bound cells by removing the tube from the magnet, suspending the bead-bound cells in 1 mL of PBS + 2% FCS, replacing the tube on the magnet for 1 min, and discarding the clear supernatant. Repeat this process for a total of 3 washes.\nNOTE: Be careful not to discard any beads during washes.\nAfter the final wash, place the tube on the magnet for 1 min. Remove and discard the supernatant and place the pellet on ice. Proceed to section 3 (ATAC-seq).\n3. ATAC-seq",
    "NOTE: In this step, nuclei are isolated from activated CD4+ T cells for ATAC-seq. The lysis buffer used in this protocol has been improved to be gentler on the nuclei, resulting in more efficient digestion and higher quality results. All centrifugation steps in section 3 are performed with a fixed-angle centrifuge maintained at 4 °C. Cool the centrifuge before beginning protocol.\nPerform nuclei isolation. Resuspend beads and cells with cold lysis buffer (10 mM Tris-HCl, pH 7.4, 10 mM NaCl, 3 mM MgCl2, 0.03% polysorbate 20). Centrifuge immediately at 500 x g for 10 min at 4 °C. Remove and discard the supernatant.\nPerform the transposase reaction. Suspend the isolated nuclei pellet with 50 µL of Tn5 transposase mix (Table 1). Incubate in a thermocycler for 30 min at 37 °C with a 40 °C lid, holding at 4 °C when complete.\nAfter thermocycling, immediately perform a quick benchtop centrifuge spin down and place the tube on the magnet for 1 min to remove the beads from the product.\nTransfer the clear supernatant from the tube on the magnet to a DNA purification column. Wash the column once with 250 µL of Buffer PB and twice with 750 µL of Buffer PE. Elute the sample in 10 µL of elution buffer. Proceed directly to step 3.5.\nNOTE: This step amplifies the DNA fragments with the ligated adaptors, here referred to as the ATAC-seq library. In order to multiplex several ATAC-seq libraries to be run on one NGS lane, use unindexed Primer 1 for all samples and a different indexed Primer 2 for individual samples (Table 2). Primers are used at working concentrations of 1.25 µM.",
    "Set up the initial PCR amplification reaction in a nuclease-free PCR tube, combining the components in the order and volume specified in Table 3. Place the PCR tube into the thermocycler and run the PCR amplification program with cycling conditions as specified in Table 4.\nMonitor the reaction by qPCR. Set up the qPCR reaction in a nuclease-free PCR tube, combining the components in the order and amount specified in Table 5. Place in qPCR machine and cycle as specified in Table 6.\nTo determine the optimal number of additional amplification cycles for the remaining 45 µL reaction, create a plot with cycle number on the x-axis and relative fluorescence (RFU) on the y-axis. The optimal number of additional amplification cycles is one-third the number of cycles it takes for the qPCR reaction to reach plateau.\n\t\tNOTE: Monitoring the reaction by qPCR allows for determination of the optimal number of PCR cycles desired to obtain optimal library fragment amplification while minimizing GC content and size bias.\nComplete the final PCR amplification of the remaining 45 µL of PCR reaction. Place the PCR tube with the amplification reaction from step 3.5 back in the thermocycler and run the program as described in Table 7.\nNOTE: For samples processed as described in this protocol, the optimal total number of PCR amplification cycles was determined to be 12.\nAfter the amplification is complete, purify the libraries using a PCR cleanup kit following the manufacturer’s protocol, eluting in 25 µL of the elution buffer.\nNOTE: Amplified libraries can be stored at 4 °C for up to 48 h or frozen at -20 °C for long-term storage.\n4. ATAC-seq Library Quality Analysis",
    "NOTE: It is important to validate the quality and quantity of ATAC-seq libraries before next-generation sequencing. The quality and quantity of the libraries should be assessed using commercially available kits (see Table of Materials).\nAssess the quality and quantity of the ATAC-seq libraries using a microfluidics-based platform for sizing, quantification and quality control of DNA. See Figure 2 for representative quality assessment results.\nNOTE: The concentration of the ATAC-seq libraries must be >1 ng/µL to obtain quality sequencing results. On average, 30 nM in 25 µL was obtained.\n5. Sequencing and Data Analysis\nNOTE: This analysis pipeline allows users to control the quality of reads mapping procedure, adjust coordinates for experimental design, and call peaks for downstream analysis. The following are the commands lines and explanation of execution. The data analysis package is available at (https://github.com/s18692001/bulk_ATAC_seq).\nSequence the prepared libraries on a next generation sequencer to an average read depth of 42 million reads per sample.\nEstimate the quality of sequencing reads by checking files generated by FastQC12 software package using the command:\n\tfastqc -o <output_directory> <fastq_file>\nTrim the bases of reads by Trimmomatic13 software, if needed, as determined by the FastQC quality check, using the command (for pair-ended):\n\tjava -jar <path to trimmomatic jar file> PE <input1> <input2> <paired output1> <unpaired output1> <paired output2> <unpaired output2> HEADCROP:<crop bases>\nAlign reads to human reference genome (hg38) by Bowtie214 software:\n\tbowtie2 -x <reference genome> -1 <input pair 1> <input pair 2> -S <output SAM file>\nNOTE: The argument -x is for the basename of the index for the reference genome, and -S is for the SAM format output.\nCheck thequality of mapped reads using Samtools15 flagstat package:\n\tsamtools flagstat <BAM file>\nSort the mapped reads file and remove duplicates using Picard16 tool:",
    "java -jar picard.jar SortSam INPUT=<input SAM file name> OUTPUT=<output sorted BAM file name> SORT_ORDER=coordinate” and “java -jar picard.jar MarkDuplicates INPUT=<sorted BAM file> OUTPUT=<output BAM file without duplicates> REMOVE_DUPLICATES=TRUE\nIndex BAM file, trim the unused chromosome reads and shift the coordinates for the experimental reason of ATAC-seq17:\n\tjava -jar picard.jar BuildBamIndex INPUT=<BAM file>\n\tsamtools idxstats <Input BAM file> | cut -f 1 | grep -v chrY | grep -v chrM | grep -v chrUn | xargs samtools view -b <Input BAM file> > <Output trimmed BAM file>\n\tbedtools bamtobed -i <Input trimmed BAM file> > <Output trimmed BED file>\n\tawk 'BEGIN {OFS = \"\\t\"} ; {if ($6 == \"+\") print $1, $2 + 4, $3 + 4, $4, $5, $6; else print $1, $2 - 5, $3 - 5, $4, $5, $6}' <Input trimmed BED file> <Trimmed shifted BED file>\nDelete the reads that are shifted to negative coordination:\n\tawk '{if ($2 > 0) print $1 \"\\t\" $2 \"\\t\" $3 \"\\t\" $4 \"\\t\" $5 \"\\t\" $6 }' <Input BED file> <Output non-negative coordination BED file>.\nConvert the BED file to BAM file for following DiffBind18 analysis:\n\tbedtools bedtobam -i <Input BED file> -g <reference genome> <Output BAM file>\nPerform peak calling by DiffBind18 software package:\n\tmacs2 callpeak -t <Input BAM file> -f BAM -g hs -nomodel --nolambda --keep-dup all --call-summits --outdir <Output directory path> -n <Output name> -B -q 0.01 --bdg --shift -100 --extsize 200\nNOTE: After filtering, expect a median of 37 million reads per sample. Mitochondrial DNA contamination will range from 0.30%–5.39% (1.96% on average). There will be a low rate of multiply mapped reads (6.7%–56%, 19% on average) and a relatively high percentage of usable nuclear reads (60%–92%, 79% on average).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}