{
  "id": 15326,
  "origin_website": "Jove",
  "title": "Optimization and Comparative Analysis of Plant Organellar DNA Enrichment Methods Suitable for Next-generation Sequencing",
  "procedures": [
    "1. Generation of Plant Materials for Organellar Isolation and DNA Extraction\nStandard growth of wheat seedlings\nPlant seeds in vermiculite in small, square pots with 4 - 6 seeds per corner. Transfer to a greenhouse or growth chamber with a 16 h light cycle, 23 ºC day/18 ºC night.\nWater the plants each day. Fertilize the plants with ¼ teaspoon of granular 20-20-20 N-P-K fertilizer upon germination and at 7 days post-germination.\nAlternative etiolation of wheat seedlings\nFollow step 1.1, but place the pots in a dark growth chamber, 23 °C for 16 h/18 ºC for 8 h. Alternatively, cover the plants in the greenhouse (e.g., with a storage container; however, proper ventilation must be maintained).\nGrowth and tissue collection\nGrow the plants for 12 - 14 days. For most wheat genotypes, 75 - 100 seedlings yield around 10 - 12 g of tissue, which is sufficient for two organellar extractions using the differential centrifugation method (section 2); only one plant is necessary if utilizing the DNA CpG-methylation-based pulldown approach to fractionate organellar from nuclear DNA (section 3).\nIf utilizing the differential centrifugation approach, collect tissue fresh and proceed immediately to processing the samples, as described in section 2.\nIf utilizing the CpG-methyl pulldown approach, harvest 20 mg sections of young leaf tissue into microcentrifuge tubes (use either standard-grown or etiolated tissue, see the Representative Results). Snap-freeze on liquid nitrogen and freeze at -80 ºC until use. Proceed to the pulldown fractionation of DNA, as described in section 3.\n2. Method #1: DNA Extraction Using Differential Centrifugation (DC)",
    "NOTE: The differential centrifugation protocol was modified from two publications that optimized conditions to isolate both organelles but enrich for mitochondria17,24. The resulting protocol is less time-intensive and uses fewer toxic chemicals than the previous methods. Specifically, we made modifications to the buffers and wash steps, including the addition of polyvinylpyrrolidone (PVP) to the STE extraction buffer and the elimination of the final wash step in NETF buffer, which contains sodium fluoride (NaF).\nCaution: The preparation and use of STE buffer should be performed under a chemical fume hood with proper personal protection equipment, as this buffer contains 2-mercaptoethanol (BME).\nThings to do before starting\nEnsure that all equipment is extremely clean, and autoclave any equipment that can be autoclaved (e.g., grinding cylinders, high-speed centrifuge tubes, etc.).\n\t\tNOTE: Filter-tips are recommended for all steps requiring pipetting to avoid cross-contamination.\nSee the list of required equipment and reagents and prepare the required buffers and working stocks for Method #1 (Table 1). Chill the cryogenic grinding blocks to -20 ºC and the rotors and buffers to 4 ºC, set the microcentrifuge to 4 ºC, and turn on a 37 ºC water bath.\nIsolation of organelles\nHarvest 5 g of fresh tissue and rinse it in cold, sterile water in a chilled beaker on ice.\n\t\tNOTE: Always keep the samples on ice during all operations and transportations to and from the centrifuges, fume hoods, etc. Alternatively, work in a cold room if there is access to sufficient space and equipment to carry out the protocol.\nUsing scissors, cut leaf tissue into ~1-cm pieces directly into a 50 mL tube containing two ceramic grinding cylinders.\n\t\tNOTE: Clean or change the scissors between samples to avoid cross-contamination.",
    "If there is no tissue homogenizer, use a mortar and pestle and follow to replace steps 2.2.4 - 2.2.9.\n\t\t\nCut the leaf tissue into a pre-chilled mortar on ice. Grind the samples for 2 - 3 min in 15 mL of STE (in the fume hood).\nPour off the buffer (leave the tissue in the mortar) through a funnel containing one layer of pre-wet, sterile filtration cloth (~22- to 25-µm pore size; see the main protocol for details) into another 50-mL tube. Add an additional 10 mL of STE to the mortar and pestle and homogenize again.\nPour the homogenized tissue and buffer into the same funnel. Rinse the mortar and pestle with 10 mL of STE and pour it into the funnel. Squeeze and wring out the filtration cloth into the funnel to recover as much liquid as possible.\n\t\t\tNOTE: Change gloves between samples to avoid cross-contamination. Continue with the protocol at step 2.2.10.\nAdd 20 mL of STE (in the fume hood) to each 50 mL tube.\nPlace the samples into pre-chilled cryogenic grinding blocks in a tissue grinding apparatus and grind the samples for 2 x 30 s at 1,750 rpm. Rotate the sample positions and place the samples on ice for ~1 min between grinds.\n\t\tNOTE: A mortar and pestle, blender, or other tissue grinding/homogenizing device may be used in this step. However, each method will affect the resulting DNA quality to different degrees, and therefore DNA length and quality should be assessed before continuing with downstream applications.\nInsert a funnel into a clean 50-mL tube placed in ice. Place one layer of filtration cloth into the funnel and pre-wet it with 5 mL of STE. Do not discard the flow-through.",
    "Pour the homogenized tissue into the funnel. Rinse the grinding tube with 15 mL of STE, recap and invert the tube to rinse the walls and lid, and pour into the funnel.\nCarefully remove the ceramic stones and then squeeze and wring out the filtration cloth into the funnel.\n\t\tNOTE: Change gloves between samples to avoid cross-contamination.\nWrap the tube caps with parafilm to avoid spillage. Centrifuge at 2,000 x g for 10 min at 4 ºC.\nCarefully aspirate the supernatant using a serological pipette (avoid disturbing the pellet) and place it in a 50 mL high-speed centrifuge tube (if the tubes do not have tight sealing gaskets, wrap the tube caps with parafilm to avoid spillage). Discard the pellets.\nBalance the tubes to within 0.1 g using STE and centrifuge the resulting supernatant for 20 min at 18,000 x g and 4 ºC. To balance the tubes, place a small beaker of ice on the balance, tare the scale, and weigh the samples on ice to keep them cold. Alternatively, use a balance and a fume hood in a cold room.\nDiscard the supernatant. Add 1 mL of ST to the pellet and re-suspend gently using a soft paintbrush. Add 24 mL of ST (final volume of 25 mL) and mix/swirl (i.e., press the paintbrush on the side of the tube to remove all liquid).\nBalance the tubes to within 0.1 g using ST. Centrifuge for 20 min at 18,000 x g and 4 ºC. Meanwhile, prepare DNaseI solution (see Table 1 for stock and working solution recipes). For each sample, make one 200 µL aliquot in a 1.5 mL tube.",
    "Discard the supernatant, blot the tube, and re-suspend the pellet (still in a high-speed centrifuge tube) in 300 µL of ST using a soft paintbrush. Place the paintbrush in the previously prepared 1.5 mL tube containing 200 µL of DNaseI solution and swirl the paintbrush to remove any residual pellet stuck in the brush. Pipette the DNaseI solution back into the high-speed centrifuge tube and gently swirl to mix.\nIncubate at 37 °C for 30 min in a water bath (wrap parafilm around top of the tube to prevent condensation leaking into the cap). Gently mix by swirling 2 times during incubation.\nGently pipette the pellet mixture out of the tube using a pipette tip with a wide orifice and place it in a 1.5 mL low-bind tube. Add 500 µL of 400 mM EDTA, pH 8.0, to the high-speed centrifuge tube and gently pipette to get all of the residual pellet out of the tube. Transfer the EDTA to the same 1.5-mL, low-bind tube as the pellet mixture and gently mix by inversion.\nCentrifuge at 18,000 x g for 20 min at 4 ºC. Discard the supernatant, blot the tube, and use at once for DNA isolation. If necessary, freeze pellets at -20 ºC, but this may result in a yield reduction, as residual DNaseI may degrade the sample DNA if it is not immediately processed.\nDNA extraction from isolated organelles using a commercial column-based approach",
    "NOTE: See the kit handbook for the full protocol25, and see below for modifications. Proceeding directly from organellar isolation to DNA extraction is preferred. Repeated freezing and thawing will reduce DNA fragment sizes and lead to DNA degradation by residual DNaseI. Limit vortexing or vigorous pipetting, as this can shear the DNA. The use of low-bind microcentrifuge tubes is recommended to maximize DNA recovery.\n\t\nDNA extraction procedure\n\t\tNOTE: Read the detailed commercial protocol25 before starting to ensure that the buffers are properly made/stored and that the spin-column procedures are understood.\n\t\t\nAdd 180 µL of Buffer ATL directly into the tube with the pellet (thawed if previously frozen and equilibrated to room temperature on the benchtop).\nProceed with step 3 in the protocol for \"DNA Purifications from Tissues\" in the kit handbook, with the following modifications: a 30-min lysis in step 3, include the optional RNase A digestion, and elute in 3 x 200 µL of AE (each into a separate tube and then combine the elutions).\nSave an aliquot (at least 20 µL) for qPCR (see step 4.1). To quantify before concentrating, save an additional 1 µL for high-sensitivity quantification.\nIf desired, proceed with sample concentration.\nSample concentration with commercial filter units\n\tNOTE: See the commercial protocol26 for more details. Depending on the downstream use, it may not be necessary to perform sample concentration (e.g., for end-point PCR and qPCR applications). However, for NGS library construction, it will likely be necessary to concentrate dilute organellar DNA obtained after DNA extraction.\n\t\nConcentration column procedure\n\t\t\nCarefully pre-weigh (see Table 2) the empty filter unit (without a tube) on a clean piece of weighing paper on a digital analytical balance. Record the weight.\nPipette the combined elutions into the filter unit and carefully weigh again.",
    "NOTE: The commercial manual26 says that the filter unit maximum volume is 500 µL, but up to 575 µL can be added to the unit at once with no overflow.\nCarefully place the filled filter unit into a tube (provided with the columns). Centrifuge at 500 x g for the desired time to achieve the required concentrate volume. For a sample volume of ~575 µL, a 20-min spin will usually result in a concentrate volume of 15 - 30 µL.\nRemove the filter unit from the tube and weigh again. Use the table to determine if the desired concentrate volume has been achieved. If not, centrifuge again at 500 x g for a shorter length of time and weigh again; repeat until the desired concentrate volume is reached.\nPlace a new tube (provided with the columns) over the top of the filter unit and invert. Centrifuge for 3 min at 1,000 x g to transfer the concentrate to the tube.\nDetermine the volume recovered. This will usually be ~3 - 5 µL less than the calculated volume, due to filter retention. If over-concentrated, dilute with sterile water or TE to achieve the desired volume.\nQuantify the DNA using high-sensitivity quantification (per manufacturer instructions).\n3. Method #2: Methyl-fractionation (MF) Approach to Enrich for Organellar DNA from Total Genomic DNA\nNOTE: This protocol was modified from a user-developed Genomic Tip Kit DNA extraction protocol for plants and fungi27 and the commercial Microbiome DNA Enrichment Kit protocol28. In theory, any DNA isolation protocol that yields high-molecular weight DNA may be used for the pulldown. For short-read sequencing, any extraction yielding predominately >15 kb fragments is adequate for use in the pulldown. For long-read sequencing, larger fragments may be desirable. Therefore, we optimized this protocol to yield high molecular weight DNA.",
    "Isolation of total DNA\n\tNOTE: See the list of required equipment and reagents and prepare the required buffers and working stocks for Method #2 (Table 1). Add lysing enzymes to the lysis buffer stock to make the lysis buffer working solution. Turn on the thermomixer and set it to 37 °C. Turn on the water bath to 50 °C and place QF buffer in the bath. Place 70% EtOH in the freezer and set the microcentrifuge to 4 °C.\n\t\nTotal DNA extraction using commercial DNA extraction columns\n\t\tNOTE: Before starting, read the commercial handbook29 for detailed information regarding the use of the gravity-flow anion-exchange columns. The columns may be set up using a specialized rack or placed over the tubes using the provided plastic rings. All steps, including the genomic tips, should be allowed to proceed by gravity flow, and residual liquid should NOT be forced through.\n\t\t\nGrind 20 mg of frozen tissue in liquid nitrogen in a 2-mL low-bind tube using hand-held grinding pestles designed for 2-mL tubes.\nAdd 2 mL of lysis buffer working solution (the tubes will be very full).\nIncubate in a thermomixer at 37 °C for 1 h with gentle agitation at 300 rpm. If a thermomixer is not available, incubating on a heat block and mixing by gentle flicking every 15 min is a suitable alternative.\nAdd 4 µL of RNase A (100 mg/mL, final concentration of 200 µg/mL). Invert to mix and incubate in a thermomixer for 30 min at 37 °C, with gentle agitation at 300 rpm.\nAdd 80 µL of proteinase K (20 mg/mL, final concentration of 0.8 mg/mL), invert to mix, and incubate in a thermomixer for 2 h at 50 °C, with gentle agitation at 300 rpm.",
    "Centrifuge for 20 min at 4 °C and 15,000 x g to pellet the insoluble debris.\nWhile the samples are centrifuging, equilibrate the columns with 1 mL of Buffer QBT and allow the column to empty by gravity flow.\nUse a wide-bore pipette tip to promptly apply the sample (avoid the pellet) to the equilibrated column and allow it to fully flow through the column. If the sample becomes cloudy, filter or centrifuge again before application to the column (see the commercial handbook for details29).\nOnce the sample has fully entered the resin, wash the column with 4 x 1 mL of Buffer QC.\nSuspend the column over a clean, 2 mL, low-bind microcentrifuge tube. Elute the genomic DNA with 0.8 mL of Buffer QF prewarmed at 50 °C.\nPrecipitate the DNA by adding 0.56 mL (0.7 volumes of elution buffer) of room-temperature isopropanol to the eluted DNA.\nMix by inversion (10X) and centrifuge immediately for 20 min at 15,000 x g and 4 °C. Carefully remove the supernatant without disturbing the glassy, loosely attached pellet.\nWash the centrifuged DNA pellet with 1 mL of cold 70% ethanol. Centrifuge for 10 min at 15,000 x g and 4 °C.\nCarefully remove the supernatant (be cautious with this step as well) without disturbing the pellet. Air-dry for 5-10 min and resuspend the DNA in 0.1 mL of elution buffer (EB). Dissolve the DNA overnight at room temperature. Avoid pipetting, which may shear the DNA.\nQuantify the samples using a high-sensitivity DNA quantification assay (per manufacturer instructions).\nBead-based fractionation of methylated and unmethylated DNA",
    "NOTE: A recent publication demonstrated the use of a commercially available kit28 that takes advantage of a pulldown approach utilizing a CpG-specific methyl-binding domain protein fused to the human IgG Fc fragment (MBD2-Fc protein) to fractionate plant organellar genomes (unmethylated) from nuclear genome (highly methylated) content23. Fractionation efficiency in wheat samples was not previously tested using this commercial MF kit28.\n\t\nThings to do before starting\n\t\t\nFreshly prepare 80% ethanol (at least 800 µL per reaction). Set 5x bind/wash buffer to thaw on ice and prepare 5 mL of 1x buffer per sample (dilute 5X buffer with sterile, nuclease-free water and keep on ice during the protocol).\nPrepare MBD2-Fc protein-bound magnetic beads\n\t\t\nPrepare the required number of bead sets. Scale the reactions to use between 1 and 2 µg of total input DNA, requiring 160 - 320 µL of beads. Note that the reactions listed below are for 1 µg of total input DNA, so they require 160 µL of beads. Scale the reactions according to the needs.\nUsing wide-bore tips, gently pipette the Protein A Magnetic Bead slurry up and down to create a homogeneous suspension. As an alternative, gently rotate the tube of beads for 15 min at 4 °C.\n\t\t\tNOTE: Do not vortex the beads.\nProceed with the directions per the manufacturer instructions28.\nCapture methylated nuclear DNA\n\t\t\nFor each individual sample, add 1 µg of input DNA to a tube containing 160 µL of MBD2-Fc-bound magnetic beads.\nAdd 5x bind/wash buffer as appropriate given the volume of the DNA input sample for a final concentration of 1x (volume of 5x bind/wash buffer to add (µL) = volume of input DNA (µL)/4). Pipette the sample up and down a few times to mix using a wide-bore pipette tip.",
    "Rotate the tubes at room temperature for 15 min. Gently pipette the samples with a wide-bore pipette tip and flick the samples 2 - 3 times throughout the incubation to prevent bead clumping.\n\t\t\tNOTE: The pipetting and flicking is critical to ensure efficient pulldown of the methylated DNA.\nCollect enriched, unmethylated organellar DNA\n\t\t\nBriefly spin the tube containing the DNA and MBD2-Fc-bound magnetic bead mixture. Place the tube on a magnetic rack for at least 5 min to collect the beads to the side of the tube. The solution should appear clear.\nUsing wide-bore tips, carefully remove the cleared supernatant without disturbing the beads. Transfer the supernatant (contains unmethylated, organellar-enriched DNA) to a clean, low-bind, 2-mL microcentrifuge tube. Store this sample at -20 or -80 °C, or proceed directly to step 3.2.6 for purification.\nElute captured nuclear DNA from the MBD2-Fc-bound magnetic beads\n\t\t\nIf the nuclear fraction is also desired, follow the manufacturer instructions28 to elute the nuclear DNA from the MBD2-Fc-bound magnetic beads; purify as described in step 3.2.7.\nBead-based nucleic acid purification\n\t\t\nMake sure the purification beads are at room temperature and are thoroughly mixed. Proceed with the protocol per the instructions in the MF kit manual28.\n\t\t\tNOTE: The sample can now be used for NGS library construction or another downstream analysis.\n4. Sample Quantification and Quality Control\nqPCR assay to assess organellar enrichment",
    "NOTE: The qPCR reaction and assay parameters listed here were designed for use on a Roche LightCycler 480 and may need to be adjusted for different equipment and reagents. If qPCR is unavailable, end-point PCR and visualization on an agarose gel may be used as a qualitative measure of sample purity, using the same primers and conditions described here. Amplicon sizes will be ~150 bp for all primer sets. See Table 3 for primer sequences and pairings.\n\t\nqPCR reaction setup\n\t\t\nTo set up an individual 20 µL qPCR reaction, carefully pipette the following into a single well of a 96-well qPCR plate: 10 µL of 2x SYBR Green I Master; 2 µL of the 10 µM forward and reverse primer mix (for a final concentration of 0.5 µM); 2 µL of template (within the range of the standard curve); and 6 µL of sterile, nuclease-free H2O. To reduce pipetting errors, it is preferable to make a master mix with all reaction components except the template. Add the master mix to the qPCR plate and then add the template of interest to each well. Three technical replicates for each sample should be performed to minimize the effects of pipetting error.\n\t\t\tNOTE: Ultimately, the ratio of nuclear to organellar quantification cycles are compared between samples, so slight differences in concentration are acceptable. However, DNA concentrations should be roughly within the range of each other.\nSeal the plate with a high-quality qPCR sealing film. Gently vortex the samples, taking care to avoid the creation of any bubbles. Briefly spin the plate down for 2 min at 4 °C to collect the sample and eliminate any small bubbles.\nLoad the plate into the machine. Run the qPCR program per the guidelines listed below.\nqPCR reaction parameters",
    "NOTE: These are default parameters, except for the annealing cycle of the amplification stage. Adjust this setting to accommodate specific primers if those used differ from the primers presented in this protocol.\n\t\t\nPre-incubate at 95 °C for 5 min, with a ramp rate of 4.4 °C/s.\nPerform 45 amplification cycles of (1) 95 °C for 10 s, with a ramp rate of 4.4 °C/s; (2) 60 °C for 20 s, with a ramp rate of 2.2 °C/s; and (3) 72 °C for 10 s, with a ramp rate of 4.4 °C/s (data acquired during (3)).\nUse an optional melt curve cycle of 95 °C for 5 s, with a ramp rate of 4.4 °C/s; 65 °C for 1 min, with a ramp rate of 2.2 °C/s; and 97 °C, with a continuous acquisition mode.\nUse a cooling cycle of 40 °C for 30 s, with a ramp rate of 1.5 °C/s.\nAssay parameters\n\t\t\nSelect the SYBR template. Check the program parameters in the Experiment button. Once plate is loaded, the assay can be started, and the settings may be adjusted while the assay is running.\nAssign samples using the sample editor. Select Abs Quant as the workflow and designate the samples as unknown, standards, or negative controls. Designate replicates and fill in the sample names of the first of each replicate. Add concentrations and units to the standards.\nSet up subsets for analysis; these are assigned in the subset editor.\nFor analysis, select Abs Quant/2nd Derivative Max from the \"create new analysis\" list. Import the externally saved standard curve (if applicable) and then hit calculate; the report will contain the information selected.",
    "To perform accurate absolute quantification for the determination of copy number or concentration, use a standard curve that is representative of the sample being tested (e.g., organellar DNA isolated from the above methods). Since the amount of mitochondrial DNA required to prepare a standard curve is too high to be attained with a reasonable amount of tissue, do not utilize copy number calculations provided by the software, but instead examine crossing point (Cp) values to determine the relative enrichment of organellar compared to nuclear DNA in the samples. Compare these relative amounts to those of total genomic DNA (see the Representative Results). Test primer efficiencies on five 1:10 dilutions of total genomic DNA from fully light-grown, two-week-old wheat seedlings (representative efficiencies reported in the legend of Figure 2).\nPulsed-field gel electrophoresis (PFGE)\n\tNOTE: This protocol is based on manufacturer guidelines to perform PFGE to resolve high-molecular weight DNA. See the Materials Table.\nPreparing the gel and samples\n\t\t\nFollow the guidelines for gel and sample preparation and adapt them to the available system.\nRun the parameters\n\t\t\nFollow the guidelines for setting up the electrophoresis system and use the following parameters: initial switch time of 2 s, final switch time of 13 s, run time of 15 h and 16 min, V/cm of 6, and included angle of 120°.\nStain and image the gel\n\t\t\nStain the gel with a dye of choice (e.g., ethidium bromide or a suitable alternative) and image with a suitable gel documentation system.\nNGS and analysis\nUse 1 ng of DNA as the input for the DNA Library Prep Kit, per the manufacturer's instructions.\nBarcode and pool the samples for sequencing in a single run. Perform sequencing according to manufacturer guidelines.",
    "NOTE: Pooling and sequencing parameters may be altered depending on the species of interest, the desired coverage level, and the platform used to sequence the libraries. For example, a HiSeq lane has substantially more output than a MiSeq lane, so many more samples can be multiplexed. Sequence a smaller subset of samples to determine if the coverage levels of the organellar genomes are adequate for downstream analysis.\nExamine the read quality using FastQC31 to determine the extent of trimming and filtering required for the data.\nTrim and filter the raw reads using Trimmomatic32 or another comparable program. Use the following settings: ILLUMINACLIP 2:30:10 (to remove adapters), LEADING 3, TRAILING 3, SLIDINGWINDOW 4:10, and MINLEN 100.\nMap the quality-filtered and adapter-trimmed paired-end (PE) reads to Chinese Spring mitochondrial (NCBI Reference Sequence NC_007579.133), chloroplast (NCBI Reference Sequence NC_002762.134), and nuclear35 reference genomes using Bowtie236, with the following settings: -I 0 -X 800 --sensitive.\nConvert the sam alignment files to bam format (samtools) and sort the bam files. Use the bam files to calculate genome-wide coverage and per-base coverage with bedtools. Visualize the results with the R-plot function.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}