{
  "id": 19169,
  "origin_website": "Jove",
  "title": "Implantation of Radiotelemetry Transmitters Yielding Data on ECG, Heart Rate, Core Body Temperature and Activity in Free-moving Laboratory Mice",
  "procedures": [
    "The animal experiment was approved by the Cantonal Veterinary Office (Zurich, Switzerland). Housing and experimental procedures were in accordance with Swiss Animal Protection law and conform to the European Directive on the Protection of Animals Used for Scientific Purposes (DIRECTIVE 2010/63/EU OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL of 22 September 2010).\n1. Pre-operative considerations\n1.1 Mice: housing requirements, general condition and health monitoring\nIt is recommended that mice delivered from vendors or transferred from external rodent colonies should arrive at the housing facility at least two weeks prior to surgery. This period should allow the animals to adapt to the new environment and facility-specific housing conditions. Mice, as social living animals, should be housed in compatible groups during this adaptation period. For monitoring an individual's level of food and water consumption, each mouse is housed singly from 3 days before surgery until 10 days after surgical transmitter implantation. The time line for establishing telemetric-transmitter-bearing mice is shown in Figure 1. It is crucial that the animals come to surgery in good health and condition. Therefore, before surgery, animals should be monitored once per day for 2-3 days concerning general condition (appearance, posture, spontaneous behavior) as well as for body weight, food and water consumption. These data are documented on a medical record (general condition and health monitoring data sheet, Table 1) to establish individual baseline levels of general condition and overall health and wellbeing. Any animals showing symptoms of disease or impaired general condition before surgery should be excluded from the experiment.",
    "After the last health check or directly prior surgery, in order to shave the animals for surgery, mice are anesthetized briefly in a small (8x8x8cm) Perspex chamber using sevoflurane (8%) or isoflurane (5%) in pure oxygen (600 mL/min). Shaving the animals one day before surgery prevents hair stubbles in the operating field. After loss of the righting reflex, the mouse is taken out of the chamber and the anterior neck and abdominal hair is clipped with the animal lying in dorsal recumbence; anesthesia is maintained for approximately 5 minutes with a nose mask with sevoflurane 3-4% or isoflurane 1.5-3% in pure oxygen at a flow rate of 600 mL/min. After clipping the hair, the animals are allowed to awaken and are then brought back to their home cage.\n2. Implantation\n2.1 Operating environment, preparation of the telemetric transmitter",
    "On the day of implantation, all procedures regarding transmitter preparation and surgery are carried out on a work bench with a laminar flow hood equipped with a surgical microscope. Aseptic conditions are assured by the use of autoclaved instruments and sterilized materials and by disinfecting the work bench7. Prior to implantation, the telemetric transmitters (ETA-F10, Data Sciences International, St. Paul, MN, USA) are first prepared. After removing from their sterile package, the leads of the transmitter are shortened to a length appropriate for the size of the mouse to be implanted. In the majority of adult outbred or inbred mice, the red electrode may be shortened to approximately 42 mm and the white/colourless electrode to a length of approximately 55 mm. Insulation tubing is removed from the distal (sensory) part of the leads: approximately 20 mm of tubing is removed from the red electrode, approximately 10 mm of tubing is removed from the white/colourless electrode. The distal part of each electrode (which is now without tubing) is formed into a loop by fixing the end with thin silk sutures (PERMA-Handseide, 6-0, Ethicon, Norderstedt, Germany). After preparing the electrodes, the transmitter is placed in warm sterile saline ready to be implanted when the animal is anesthetized and surgically prepared.\n2.2 Anesthesia",
    "At 5-10 minutes before induction of inhalation anesthesia, a mixture of midazolam (4 mg/kg) and fentanyl (0.04 mg/kg) are administered subcutaneously as premedication, thus providing sedation and pre-emptive analgesia. General inhalation anesthesia is induced by placing the animal in the induction chamber and introducing the volatile anesthetic agent (sevoflurane 8% or isoflurane 5% in pure oxygen 600 ml/min). When the animal shows loss of the righting reflex it is transferred to the work bench under the laminar flow hood, and placed in dorsal recumbence on a specially designed metal plate fitted with a nose mask and tubing from the anesthesia apparatus. Anesthesia is maintained by spontaneous breathing (sevoflurane 3-4% or isoflurane 1.5-3% in pure oxygen at a flow rate of 600 mL/min). During anesthesia, the animal's eyes are protected with ointment (Vitamin A, Baush & Lomb, Steinhausen, Switzerland). While lying on the metal plate the animal is warmed by the water-bath heated surface (39°C +/-1) of the work bench.\n2.3 Surgery",
    "The skin of the anterior neck and abdominal region is disinfected for 5 minutes with 70% ethanol, chlorhexidine or iodine using a soaked cotton swab. A 1- to 1.5-cm-long incision in the skin is made from the lower thorax along the midline to the abdomen. The negative (white/colourless) lead is tunnelled subcutaneously from the thorax to the neck, where a small incision (≤0.5 cm) is made in the longitudinal direction. The skin and underlying tissues are prepared to make space for the fixation of the wire loop of the electrode. The wire loop is fixed between the muscles located to the right of the trachea, using two thin silk sutures (PERMA-Handseide, 6-0, Ethicon, Norderstedt, Germany). The wound in the neck is then closed with absorbable sutures (VICRYL 6-0, Ethicon, Norderstedt, Germany) in layers. The abdominal wall is then opened at the linea alba and the body of the telemetric transmitter is placed into the abdominal cavity of the mouse. The wire loop of the positive (red) electrode is sutured to the xiphoid process with silk sutures in such a way that it lies between the liver and the diaphragm in the left upper abdominal region (Figure 2). Then, the muscle layers of the abdominal region are closed with absorbable sutures (VICRYL 6-0, Ethicon, Norderstedt, Germany). Before finally closing the abdominal wall, a mixture of Sulfadoxin and Trimethoprim [(30 mg/kg and 6 mg/kg, respectively; dissolved in 1 mL of saline (0.9%) and at approximately body temperature (38-39°C)] is injected into the abdominal cavity for the purposes of anti-infective prophylaxis and to support fluid homeostasis. Finally, the skin of the abdominal region is restored with staples (Precise, 3 M Health Care, St. Paul, MN, USA) or intracutaneous, running, absorbable sutures (VICRYL 6-0, Ethicon, Norderstedt, Germany).\n3. Post-operative care",
    "After completion of surgery and anesthesia, 0.1 mg/kg of buprenorphine (Temgesic, Essex Chemie AG, Lucerne, Switzerland) and 5 mg/kg of meloxicam (Metacam, Boehringer Ingelheim, Basel, Switzerland) is administered subcutaneously for pain treatment, and the animals are left on the warm (39°C +/-1) surface of the work bench to recover for approximately 2h. Together with pain relief (twice daily: buprenorphine, 0.1 mg/kg and meloxicam 5 mg/kg), supportive therapy consisting of 300 μL glucose (5%) and 300 μL saline (0.9%) warmed to body temperature, is injected subcutaneously twice daily for 4 days. For further recovery support, it is worthwhile providing the animals with an additional drinking bottle containing 15% glucose solution. During the recovery period of 4-10 days, it is recommended that the animals are kept warm. Therefore, in our case, the mice are housed in a warming cabinet (30°C +/- 1). Monitoring of general condition and body weight, as well as food and water consumption, is performed once daily according to the general condition and health monitoring data sheet (Table 1) for 10 days post-operatively. Humane endpoints, i.e. the sacrifice of an animal to avoid unnecessary suffering and pain if progression of recovery is unsatisfactory, are realised under the following conditions:\nIf in poor general condition, i.e. the animal is substantially apathetic (no movement after being touched/pushed) and its body surface feels cold despite warming, the animal should be euthanatized immediately. \nIf, on day 4 after transmitter implantation, the animal shows clear signs of apathy, is extremely aggressive or does not show any food intake, it should be euthanatized immediately.",
    "On day 8 after transmitter implantation, the animal has to display a clear increase in body weight in comparison to the preceding post-operative days. Moreover, it has to consume at least 80% of the pre-operative daily food intake. If one of these conditions is not met, the animal should be euthanatized immediately.\nAt 10 days after implantation, the animal is transferred back to the animal room under standard housing conditions. In case staples have been used, these should be removed 7-10 days after surgery; absorbable sutures have not to be removed. Mice should be housed in compatible groups to allow social interaction and to prevent the adverse effects of long-term individual housing, which can have substantial impacts on the read-out of subsequent experiments8, 9. Mice should have a period of at least 4 weeks convalescence after transmitter implantation before the first experiment is conducted and data acquisition begins.\n4. Data acquisition",
    "Data collection is initiated by touching the animal with a magnet, whereupon the transmitter is switched on. Dataquest A.R.T. Software (Data Sciences International, St. Paul, MN, USA) coordinates the detection, collection, analysis and graphical presentation (in the form of wave forms) of signals from one or more animals. The Acquisition program collects data signals sent to the computer from the converters and receivers via a Data Exchange Matrix (Data Sciences International). This program can either collect data for a specific length of time at regular intervals or sample continuously and save the data on the computer's hard drive. As the range and the quality of the emitted signal depends strongly on the material composition of the cage and surrounding equipment (e.g. metal vs. plastic), it is suggested that the receiver plate is placed as close to the animal as possible, e.g. under the animals' cage or above the experimental area, e.g. laboratory bench or treadmill. It is recommended that the correct configuration of the recording and data transmission system be checked by making a short examination of real-time measurements in continuous sampling mode. After the data have been gathered and stored, they can be plotted, listed and analysed for a variety of different parameters using the Analysis program. Details of the configuration of the recording system (e.g. defining the sampling modus), and analysis software (e.g. for heart rate variability parameters, PQ interval and QT interval established from biopotential/ECG curves) can be found in the manufacturer's manuals. Valuable hints for biometric planning and statistical methods useful for telemetric data acquisition and interpretation are published elsewhere3.\n5. Representative Results:",
    "An overall scheme of the described procedure is shown in Figure 1. The position of the implanted transmitter, including the location of the electrodes for obtaining biopotentials from the heart (one-lead ECG) is shown in Figure 2. Examples of raw data from short term biopotential curves (one-lead ECG), and long-term heart rate, core body temperature and locomotor activity recordings of individual mice are given in Figure 3 and Figure 4, respectively. Figure 5 gives an example of published data from long-term measurements in groups of mice after an experiment. Several other parameters can be established from the biopotentials curves. Examples for presentation of heart rate variability parameters5, QT interval and PQ interval10, 11 are published elsewhere.\nTable 1. General condition and health monitoring data sheet. Click here to download the sheet.[href=http://www.jove.com/files/ftp_upload/3260/3260ConditionMonitoringDataSheet.doc] This template facilitates monitoring of an individual mouse's general condition and health. Baseline examination of an animal's appearance, posture, and spontaneous behavior, as well as determination of body weight, and food and water consumption must be established before implantation surgery once per day for 3 days. Comparison of baseline determinations with those obtained daily for 10 days after surgery serve to assess the progression of post-operative recovery. In addition, post-operative care and pain treatment are well documented in the form of a medical record. Instructions on humane endpoints are given in order to facilitate decisions on whether a mouse should be sacrificed to prevent unnecessary pain and suffering if the animal does not meet the criteria for fast recovery after implantation.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3260/3260fig1.jpg\nFigure 1. Schedule for establishing telemetric-transmitter-bearing mice. Chronological order of procedures relating to the implantation of a transmitter showing the time points at which a mouse can be used for experiments and data acquisition.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3260/3260fig2.jpg",
    "Figure 2. Radiograph/sketch showing location of the implanted telemetry transmitter. The body of the transmitter is positioned in the abdominal cavity. The positive lead is formed into a wire loop and fixed to the xiphoid process with sutures. The negative lead is tunneled subcutaneously from the thorax to the neck and fixed as a wire loop between the muscles directly next to the trachea. The radiograph is taken from the authors' previous publication in Laboratory Animals9.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3260/3260fig3.jpg\nFigure 3. Biopotential curves. Raw printout of one-lead ECG curves from a conscious mouse and of the same animal under inhalation anesthesia with sevoflurane. Heart rate is calculated automatically by the telemetry system. The 3-second sequence recorded under anesthesia indicates a heart rate of 440 bpm. The curve recorded in the conscious mouse shows a heart rate of 660 bpm, which falls within the expected range for heart rate during moderate physical activities such as grooming or eating. From biopotential/one-lead ECG curves, heart rate variability parameters, interbeat interval, and PQ and QT intervals can be established with use of the manufacturer's software.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3260/3260fig4.jpg",
    "Figure 4. Raw data from long-term measurements in healthy and diseased mice. Heart rate (bpm), core body temperature (°C) and locomotor activity (counts) are measured while mice are housed individually in their home cage without any disturbance from man or experimental procedures. Heart rate is recorded for 30 seconds every 5 minutes (sampling frequency 1000 Hz). Core body temperature is sampled for 10 seconds every 5 minutes. Locomotor activity is recorded continuously and stored at 5 minute intervals. Five-minute data points are traced for 6.5 days. The telemetric measurements are recorded from three mice with differing bodily conditions. The healthy mouse shows a clear circadian rhythm with normal increases in physiological values and locomotor activity behavior during the dark (night) phase. In contrast, after major surgery, heart rate is increased, particularly in the daylight phase, and locomotor activity is depressed. The third mouse suffered from chronic tumor disease-its circadian rhythm of heart rate and core body temperature appears flattened, and locomotor activity is diminished. Representative data of heart rate measurements (normal values and after major surgery) are taken from the authors' previous publication in Altex12.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3260/3260fig5.jpg",
    "Figure 5. Example of presentation of results from long-term telemetry measurements after an experiment. The figure is taken from the authors' previous publication in Laboratory Animals1. As an exemplary experiment, a 50-minute isoflurane or sevoflurane anesthesia was performed. The long-term impact of the anesthetics on heart rate, core body temperature and locomotor activity after the animals were awake was compared. Using 16 transmitter-implanted mice, telemetric data were recorded in eight mice per anesthetic while the animals were single-housed and allowed to roam freely in their home cages. For analysis of long-term postanesthetic effects, we took into account that values vary greatly during a 24-h cycle since mice are active mainly at night. Therefore, the means of the telemetric values for each animal were calculated separately for the night (12 h dark) and day (12 h light) phases. An individual's normal values were established by calculating means from the three days prior to anesthesia. For each day after anesthesia, the mean of the dark and light phase was compared with the individual's normal values, resulting in delta values. Thus, delta values represent deviation from normal values (established prior to anesthesia) at the corresponding 12 h day and night time. Columns represent the mean from eight mice; bars indicate standard deviation. Asterisks indicate significance at P ≤0.05 (One-way analysis of variance for comparison of group means at each of the four days after anesthesia with normal values)."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}