{
  "id": 1688,
  "origin_website": "Cell",
  "title": "Protocol for assessing the role of hippocampal perineuronal nets in aversive memories",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStereotaxic surgery—cannulation\nTiming: 1 day (15–20 min/mouse)\nThe purpose of this step is to implant and affix cannulas for intrahippocampal delivery. Stereotaxic coordinates for the dorsal hippocampus are 1.8 mm posterior, ±1.0 mm lateral and 2.0 mm ventral to bregma, according to the mouse brain atlas (Franklin and Paxinos, 2013[href=https://www.wicell.org#bib8]). In comparison to drug delivery via microsyringe infusions, this approach has several advantages: it allows for multiple drug deliveries and requires a much shorter recovery time (20 min, vs several days for microsyringe infusions). All steps below are repeated for each mouse. For our experiments we use 9-week-old male C57BL/6N mice (Envigo). Please follow your institutional guidelines on aseptic and analgesic managements during and after the surgery.\nAnesthetize mouse.\nWeigh the animal.\nCalculate the volume of 14 mg/mL working solution of avertin to be delivered. Mice should be injected with 350 mg/kg. We would suggest making in advance a table ranging from 15 to 35 g, with injection volumes for each 1 g increment.\nInject an appropriate volume of avertin intraperitoneally and return the animal to its home cage.\nDetermine that the mouse is fully anesthetized before proceeding by using an indicator of deep pain recognition (e.g., the pedal reflex, the tail pinch reflex, the eyelid reflex) (Tsukamoto et al., 2015[href=https://www.wicell.org#bib25]). It will take approximately 5 min.\nNote: Avertin is lipid soluble, so the exact dose may depend on body fat content. Dosage can vary from 250–500 mg/kg. If necessary, adjust the dose so the mouse is fully anesthetized.\nPrepare the mouse for surgery.\nApply ophthalmic ointment to prevent eyes from drying.\nPut the mouse in the stereotaxic instrument.\nHook the front teeth to the hole of the mouthpiece.\nFix the nose in place with the nose clamp.",
    "Fix the head using ear bars. They should be positioned against the skull, just behind the ears.\nShave the head using small animal shaver (or depilatory cream).\nDisinfect the surgical area using 10% povidone/iodine solution and alcohol at least three times, ending with povidone/iodine.\nProceed with the surgery.\nMake an incision, approximately 1 cm, along the midline using surgical scissors or sterile scalpel.\nRemove the periosteum using cotton swabs.\nRemove any blood and dry the skull with fresh cotton swabs.\nUsing anatomical features as guides (Figure 2[href=https://www.wicell.org#fig2]A), align the head with the stereotaxic instrument.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1148-Fig2.jpg\nFigure 2. Head alignment during surgery\n(A) Anatomical features of the mouse skull used as guides to position and level the head.\n(B) Top view of the mouse skull (top), and a proper anterior-posterior alignment (bottom). Scale bar: 3 mm.\n(C) Top view of the mouse skull (top), and a proper mediolateral alignment (bottom). Distance unit: mm. Scale bar: 3 mm.\n(D) Leveler positioned at bregma and lambda shows equal deviation when head is properly aligned.\n(E) Intercept of the vertical and horizontal lines of the stereoscope is aligned with bregma. Vertical line is aligned with the sagittal suture. Black lines are superimposed over the lines of the stereoscope for better visibility. Scale bar: 2 mm.",
    "Adjust the head position so it is leveled. The head is properly leveled when: (1) bregma and lambda are at the same height (Figure 2[href=https://www.wicell.org#fig2]B), and (2) two points, equidistant from the sagittal suture (1 mm, or as close to it as the instrument allows), are at the same height (Figure 2[href=https://www.wicell.org#fig2]C). We use a stereotaxic alignment indicator to achieve the proper head position (Figure 2[href=https://www.wicell.org#fig2]D). However, if one is not available, leveling of the head can be accomplished by using the tip of the drill bit, by adjusting the position of the head until the digital display of the coordinates shows the same Z-value when the tip is touching bregma or lambda (repeat for the two lateral points).\nUsing X- and Y-nobs, position the head so that bregma is in the center of the crossed lines of the centering scope (Figure 2[href=https://www.wicell.org#fig2]E). If the head is properly positioned, vertical line of the centering scope should be aligned with the sagittal suture.\nAdjust the digital display of the coordinates to show zero in X- and Y- coordinate. Z-coordinate is not of a concern since the depth of infusion is predetermined by the cannula.\nRemove centering scope and fit the stereotaxic instrument with the drill. The tip of the drill bit should be centered at bregma (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1148-Fig3.jpg\nFigure 3. Steps of the stereotaxic surgery\n(A) Left: mouse placed in the stereotaxic instrument and secured with ear bars and nose clamp. Skull is exposed, with bregma and lambda visible. Middle: drill tip is positioned at bregma to verify the head alignment. Right: holes in the skull, 2 mm apart, for cannula insertion. Scale bar: 1cm.",
    "(B) Preparation of carboxylate cement to secure cannula, showing the amounts and the consistency of the final mixture. Cement is mixed on a piece of photo film, for a clearer view.\n(C) Left: components of a hippocampal cannula - fully assembled cannula [1], dust cap [2], guide cannula [3], dummy cannula [4]. Right: cannula inserted into the skull.\n(D) Steps during cannula implantation (from left to right): carboxylate cement applied to the skull, skin pulled around the cannula, mouse at the end of surgery.\nMove the drill along the X-axis to the correct coordinate. For DH cannulas this coordinate is 1.8 mm posterior to bregma (Franklin and Paxinos, 2013[href=https://www.wicell.org#bib8]).\nMove the drill laterally along the Y-axis to 1 mm.\nDrill a hole. If bleeding occurs, press a cotton swab to the hole until it stops.\nMove the drill laterally along the Y-axis to 1 mm in the opposite direction.\nDrill a hole. The two holes will be 2 mm apart (Figure 3[href=https://www.wicell.org#fig3]A). Troubleshooting 1[href=https://www.wicell.org#sec8.1]\nImplant a cannula.\nMix the carboxylate cement (we use a sterile 46-well plate, a different well for each mouse): put one scoop of dry cement and one drop of liquid cement into a well. Mix thoroughly to combine. It should have a glue-like consistency (Figure 3[href=https://www.wicell.org#fig3]B). Adjust if needed by adding dry or liquid cement.\nInsert an assembled cannula into the holes drilled in the skull (Figure 3[href=https://www.wicell.org#fig3]C).\nAffix the cannula using the prepared cement. Work quickly so the cement does not dry.\nNote: It is very important to minimize the movement of the cannula once it is inserted in order to prevent tissue damage. Hold the cannula in place with forceps, while gently applying the cement around it.\nPull the skin and adhere it to the cement around cannula to close the wound (Figure 3[href=https://www.wicell.org#fig3]D).",
    "Apply 4% lidocaine gel (or another local anesthetic) to the skin to alleviate any pain that the animal may experience immediately after the surgery.\nSterilize the instruments in the glass bead sterilizer\nReturn the mouse to its home cage, placed on a heating pad (37°C). Monitor regularly until it awakens (1–2 h).\nHouse the mice individually before starting infusions and behavioral experiments. Ideally, they should be housed in the same room where the behavioral manipulations are going to be performed to minimize disturbances on the training and test days.\nPause point: Allow at least one week of post-surgical recovery before proceeding with infusions and behavioral tests.\nCritical: Make sure the head is completely immobilized during surgery. Any shift in head position during surgery would substantially affect the accuracy of the cannula placement.\nCritical: It is very important that the periosteum is completely removed, and skull dried before the cement is applied. Otherwise, the cement will not adhere properly, and the cannula will fall off before the end of the experiment.\nChABC infusions\nTiming: 3 h\nIn order to determine whether PNNs in CA1 region of DH are involved in memory processing, it is required to disrupt them by enzymatic digestion of CSPGs. In this protocol this is achieved by infusions of ChABC through the implanted cannulas.\nAssemble the equipment (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1148-Fig4.jpg\nFigure 4. Setup for infusion\n(A) Equipment and instruments needed for the infusion; hippocampal injectors [1, insert], forceps [2], Hamilton syringes [3], tubing [4], infusion pump [5], isoflurane induction chamber connected to a low-flow anesthesia system (not in view) [6].\n(B) Assembled infusion apparatus. Insert: magnified image of an air bubble used as a barrier between the water in the syringe and the drug. One side is filled with a methylene blue solution for contrast.",
    "(C) Closeups of a cannula on the mouse head showing step by step removal of dust cap and dummy cannula.\n(D) Cannula with an injector inserted.\n(E) Alternative isoflurane administration for infusions. Jar contains a piece of filter paper covered with perforated petri dish.\nFill two 25 μL Hamilton syringes with water (a 1.5 mL tube filled with water can be used for this purpose). If air bubbles are present, remove them by forcefully emptying the syringe into the 1.5 mL tube and filling it again. It may be necessary to repeat several times.\nPlace the syringes into the infusion pump.\nFit the injector with two pieces of tubing and connect to the syringes.\nRemove the air from the tubing and the injector by pushing the syringe plunger until a small water drop appears on the tips of the injector.\nSet the infusion volume to 250 nL, and infusion rate to 150 nL/min. This volume is sufficient to cause PNN degradation in CA1, but not in the surrounding regions. The infusion apparatus is now assembled and ready for use (Figure 4[href=https://www.wicell.org#fig4]B). Troubleshooting 2[href=https://www.wicell.org#sec8.3]\nFill the infusion apparatus with ChABC solution. Many reagents are either expensive or difficult to obtain, and it is desirable to use them in smallest possible quantities. Instead of filling syringes with the reagent that is to be infused, requiring close to 100 μL (to fill two 25 μL syringes, and two pieces of tubing), we prefer to create a small air bubble in the tubing, which acts as a barrier between the water in syringes and the infusion solution (Figure 4[href=https://www.wicell.org#fig4]B, insert).\nPull the syringe plungers out until a very small air bubble is formed.",
    "Insert the injector into the tube with ChABC solution and pull the plungers out gently. Monitor that the air bubbles are moving up while the tubing is filled with ChABC solution.\nMove the pusher of the infusion pump until it is pressed against the syringe plungers (a small drop should appear at the tips of the injector).\nInfuse ChABC into CA1 Troubleshooting 3[href=https://www.wicell.org#sec8.5]\nAnesthetize a mouse in the induction chamber, setting the concentration of isoflurane to 5%.\nNote: Closely monitor the breathing. Mouse is anesthetized when it stops moving and breathing slows down. Do not leave a mouse in the chamber too long, as 5% isoflurane may be too high for a longer exposure and may result in death.\nRemove the mouse from the induction chamber and transfer it to the assembled infusion equipment, setting the concentration of isoflurane to 1.4%.\nRemove the dust cap and the dummy cannula: hold the base of the guide cannula tightly with forceps, unscrew the cap and pull the dummy cannula out (Figure 4[href=https://www.wicell.org#fig4]C). Forceps should be thin enough to fit around the narrow portion of the cannula base not covered by the cap.\nInsert the injector (Figure 4[href=https://www.wicell.org#fig4]D).\nMark the position of the air bubble in the tubing with a fine marker and start the infusion.\nWhen the infusion is completed leave the injector in the cannula for 1 min. This helps prevent the liquid being pulled upward from the site of injection as the injector is removed.\nRemove the injector slowly, insert the dummy cannula and screw the cap onto the guide cannula.\nReturn the mouse to its home cage.\nNote: Mouse should awaken very quickly, typically just a few moments after it is returned to the cage.",
    "Alternatives: If an induction chamber for anesthesia is not available, a large glass jar can be used for isoflurane delivery instead. Place a piece of filter paper in the bottom of the jar, add 0.5 mL of isoflurane onto the paper and cover with a perforated petri dish (Figure 4[href=https://www.wicell.org#fig4]E). This should be done in a chemical fume hood.\nPause point: Allow sufficient time for ChABC to degrade PNNs. In our experiments this time was 5 days (Jovasevic et al., 2021[href=https://www.wicell.org#bib15]).\nBehavioral training and tests\nTiming: 3 h",
    "This step of the protocol is designed to train the mice in a behavioral paradigm, to acquire an aversive memory, and to determine the strength of the memory in subsequent tests. The protocol uses contextual fear conditioning as a model for aversive episodic memories (Radulovic et al., 1998[href=https://www.wicell.org#bib18]). This task is particularly suitable for studying long-lasting episodic memories in mouse models due to their hippocampal dependence and their robust and enduring behavioral manifestation (freezing). Contextual fear conditioning is performed in a plexiglass cage, with a stainless-steel rod floor (4 mm diameter, 0.9 cm center to center), within a constantly illuminated box, fitted with a camera to monitor and record the session (Figure 5[href=https://www.wicell.org#fig5]A). Fear conditioning consists of a single 3-min exposure to a context followed by a 2 s, 0.8 mA footshock (constant current). A test for freezing behavior is performed by re-exposing the mice to the box for 3 min. The freezing response, horizontal activity, exploratory activity, and shock bursts are determined. Freezing should be recorded by trained observers unaware of the experimental conditions while all other data are provided automatically by software analyzing the infrared beam signals from the context. The shock is mildly aversive and causes the mice to either jump or run during its presentation. It is important to use different groups of mice for each experimental condition (vehicle/ChABC, recent/remote memory). Testing the same group of mice for recent and remote memory creates a concern of a possible effect of reconsolidation or fear extinction on the outcome of the remote memory test.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1148-Fig5.jpg\nFigure 5. Equipment for contextual fear conditioning\n(A) Components of a contextual fear conditioning chamber.",
    "(B) Behavioral testing room during training or testing. The chamber door is closed, mouse behavior is observed on the computer monitor, and the light in the room is dimmed. See also Methods videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2].\nSet up the equipment and the room: fear conditioning apparatus should be clean, all instruments connected and turned on. The lights in the room should be dimmed during the experiment (Figure 5[href=https://www.wicell.org#fig5]B).\nTest the equipment: Set the test current to 0.8 mA. Using a voltameter, verify that the current passing through the floor rods is correct.\nTrain a mouse. Troubleshooting 4[href=https://www.wicell.org#sec8.7]\nClean the fear conditioning chamber with 70% ethanol. This step not only cleans the chamber, but also provides scent as the part of the context.\nTransfer a mouse from the home cage into the fear conditioning chamber.\nStart the program: 3 min context; 2 s, 0.8 mA footshock.\nRecord whether mouse is freezing every 10 s by briefly (∼ 2 s) observing the mouse’s behavior. Freezing is manifested as a complete lack of movement, except for respiration (Methods videos S1[href=https://www.wicell.org#mmc1] and S2[href=https://www.wicell.org#mmc2], Figures 6[href=https://www.wicell.org#fig6]A and 6B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1148-Fig6.jpg\nFigure 6. Mouse behavior during contextual fear conditioning training and test sessions\nRepresentative locomotor activity diagrams during (A) contextual fear conditioning training, and (B) test. XY plane indicates position of the mouse during the 3 min exposure to the context, Z axis indicates time spent in each position.\n(C) Correlation between manually scored freezing and locomotor activity recorded by the instrument. ∗∗∗∗p < 0.0001 (Simple linear regression, F1, 21 = 34.04, p < 0.0001).\nNote whether the mouse responded to the electric shock.\nReturn the mouse to home cage.\nRepeat the procedure (a-f) for each mouse.\nPause point: At this stage the experiment is paused until the recent memory test day.",
    "Perform recent memory test. In our protocol it is day 4 after training; however, other time points can be evaluated instead, typically day 1 to day 4. This procedure is for the most part an exact repeat of the training procedure (Step 11 above), comprising of the 3 min context exposure, but without footshock. Troubleshooting 5[href=https://www.wicell.org#sec8.9]\nPause point: At this stage the experiment is paused until the remote memory test day.\nPerform remote memory test. We assessed day 21 for remote memory test. As with recent memory, other time points can be evaluated as well (day 21 – day 35).\nQuantify the results (see “quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis]” for details).\nPerfuse animals one day after the remote test with ice-cold 4% paraformaldehyde in phosphate buffer (pH 7.4) following a standard transcardial perfusion protocol (Jovasevic et al., 2021[href=https://www.wicell.org#bib15]). Remove brains, post-fix for 24 h in the same fixative and then immerse for 24 h each in 20 and 30% sucrose in phosphate buffer. Freeze brains in an embedding medium (we use Tissue-Plus O.C.T. Compound). Cut 50 μm sections on a cryostat and store in 1× PBS/0.4 mg/mL thimerosal at 4°C.\nOptional: In addition to manual scoring, freezing can also be determined automatically, using infrared beam monitoring system. We have repeatedly verified the linear correlation between manually and automatically scored freezing, or between manually scored freezing and locomotor activity (Figure 6[href=https://www.wicell.org#fig6]C).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Representative video of mouse behavior showing 30 s fragments from the recording during exposure to the contextual fear conditioning chamber in a training session, related to steps 11 and 12\n    Your browser does not support HTML5 video.",
    "Methods video S2. Representative video of mouse behavior showing 30 s fragments from the recording during exposure to the contextual fear conditioning chamber in a test session, related to steps 11 and 12\nImmunohistochemical detection of PNNs\nTiming: 1 day\nThis step of the protocol is performed to evaluate the efficiency of ChABC treatment. PNNs are visualized using Wisteria Floribunda Lectin (WFA) staining. The staining is performed using Vector Biolaboratories reagents, according to manufacturer’s instructions (https://vectorlabs.com/media/folio3/productattachments/product_manual/Detect.Glycoproteins.pdf[href=https://vectorlabs.com/media/folio3/productattachments/product_manual/Detect.Glycoproteins.pdf]).All steps are performed at room temperature:\nWash sections in 1 x phosphate buffered saline, pH 7.4 (PBS)/0.04 mg/mL thimerosal for 5 min.\nIncubate in 1% hydrogen peroxide in methanol for 15 min.\nWash in 1 x PBS containing 0.2% Triton X-100, 3 times for 5 min.\nAdd 6 drops of streptavidin solution from the Streptavidin/Biotin Blocking Kit, incubate for 25 min.\nWash in 1 x PBS for 5 min.\nAdd 6 drops of biotin solution the Streptavidin/Biotin Blocking Kit, Incubate for 15 min.\nRemove the solution. Do not wash.\nAdd 0.5 mL of Carbo-free reagent, incubate for 30 min.\nRemove the solution. Do not wash.\nIncubate with 10 μg/mL biotinylated WFA in 1× PBS for 30 min.\nNote: Prepare ABC solution at this point (see step 27), as it requires 30 min incubation prior to use.\nWash in 1 x PBS/0.05% Tween-20 twice for 5 min.\nIncubate for 30 min in Vectastain Elite ABC Kit: 1:100 Reagent A, 1:100 Reagent B, in 0.3% Triton X-100/1 x PBS.\nWash in 1 x PBS/0.05% Tween-20 three times for 5 min.\nIncubate for 10 min with appropriate fluorescent dye (FITC for green, Rhodamine for red, or Coumarin for blue) diluted 1:62.5 in amplification diluent.\nWash in 1 x PBS, twice for 5 min.\nPlace tissue on Colorfrost Plus slides and let dry overnight.",
    "Coverslip with a mounting medium compatible with immunofluorescence microscopy (e.g., Vectashield mounting medium, FluorSave). Tissue can be examined on an epifluorescence or confocal microscope."
  ],
  "subjectAreas": [
    "Neuroscience",
    "Microscopy",
    "Model Organisms",
    "Behavior"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Ecology & Environmental Biology",
    "Molecular Biology & Genetics"
  ]
}