{
  "id": 13678,
  "origin_website": "Jove",
  "title": "Generating CRISPR/Cas9 Mediated Monoallelic Deletions to Study Enhancer Function in Mouse Embryonic Stem Cells",
  "procedures": [
    "1. Designing and Constructing the gRNA\nTo delete transcriptional enhancer regions use two gRNAs, one 5' and one 3' of the region of interest. Use the mouse UCSC genome browser track generated by the Zhang laboratory to identify unique gRNA sequences (http://www.genome-engineering.org15). Next check these gRNAs and their adjacent PAM for SNPs and indels using online tools provided by the Sanger Institute (www.sanger.ac.uk/sanger/Mouse_SnpViewer/rel-1211)27-28. To target both alleles with equal efficiency, avoid gRNA/PAM sequences that contain a SNP or indel.\n\t\nWhile choosing the gRNA, check for the feasibility of designing allele-specific primers for genotyping the deletion. Refer to section 5 for allele-specific primer design.\nAssemble the two gRNA plasmids based on the protocol described in Mali et al. 201315. Incorporate the selected unique 20 bp target sequence into the 61mer oligonucleotides as shown in Table 7 (sequences are displayed in the 5' to 3' orientation, and the bolded bases are the 20 bp target sequence that are reverse complements of each other).\n\t\nMix 10 µl of 10 µM gRNA Primer_F and 10 µl of 10 µM complementary Primer_R in a tube.\nAnneal the primers by incubating the primer mix at 100 °C for 5 min and then cool 1 °C/sec to 25 °C. For this step, use a PCR machine or place the tube in boiling water and allow it to cool to RT.\nTo the annealed primer mix, add the following reaction mix and incubate at 72 °C for 30 min to extend each primer: 18.5 µl of water, 10 µl of 5x HF buffer, 1 µl of 10 mM dNTP mix and 0.5 µl of high-fidelity DNA polymerase.\nRun 10 µl of target fragment on a 2% agarose gel to confirm the 100 bp guide fragments have been produced.",
    "Linearize the gRNA vector (a gift from George Church; Addgene plasmid # 41824)15 with AflII by using the following reaction set up: 5 µl of gRNA vector backbone (2-4 µg), 5 µl of 10x buffer, 3 µl of AflII (20 units/µl) and 32 µl of water. Incubate the reaction mix for 3 hr at 37 °C.\nRun the digested product on a 1% agarose gel and purify the DNA band corresponding to the 3.5 kb linearized gRNA vector using a gel extraction kit by following the manufacturer's instructions.\nSet up Gibson assembly reactions29-30 using linearized gRNA vector and target fragment from step 1.2.3 as follows: 1 µl of linear gRNA vector (50 ng/µl), 1 µl of target fragment, 10 µl of 2x Gibson assembly master mix and 8 µl of water. Incubate reactions at 50 °C for 60 min.\nTransformation of E.coli Cells with Assembled gRNA Vector.\n\t\nMix 1 µl of the assembled gRNA vector from 1.2.7 and 50 µl of DH5α (E.coli strain) cells in a tube. Transform the DH5α cells by heat shock method by exposing the cells to 42 °C for 45 sec.\nSnap chill the tubes on ice for 5 min; then add 400 µl of SOC medium and incubate at 37 °C for 45 min in a shaking incubator.\nSpread 100 µl of the DH5α cells on an LB-kanamycin (50 µg/ml) plate for positive selection of transformed cells and incubate O/N at 37 °C.\nScreening Positive E.coli Colonies for gRNA Insert.\n\t\nPick a kanamycin resistant colony and resuspend in 3 ml LB containing 50 µg/ml of kanamycin. Repeat the same for 6-8 colonies and incubate all tubes at 37 °C O/N in a shaking incubator.\nExtract plasmids from the O/N grown culture using plasmid mini prep kit by following the manufacturer's manual.",
    "Prepare an EcoRI digestion reaction mix to check for gRNA sequence insert in the plasmid. For each sample, prepare the reaction mix as follows: 2 µl of enzyme buffer, 1 µl of EcoRI, 15 µl of water. Aliquot the reaction mix into 1.5 ml tubes and add 2 µl of plasmid. Incubate the tubes at 37 °C for 2 hr.\nRun the digested product on a 1.5% agarose gel.\n\t\tNote: The samples with insert will display a 475 bp band size that is 100 bp higher than the clones without inserts.\n\t\tNote: Alternatively, the positive clones can be screened by a colony PCR using Sp6 (forward) and T7 (reverse) primers (Table 7) that bind to the vector sequence to give a 642 bp size fragment in the presence of a gRNA insert. The colony PCR approach is advantageous when there is an EcoRI restriction site within the gRNA sequence.\nConfirm the Sequence of the gRNA Insert by DNA Sequencing Using the T7 Primer.\n2. Transfection\nNote: Electroporation is an efficient method of transfecting plasmids into ES cells. The method described here uses microporator transfection technology.\nGrow F1 ES cells in a 10 cm gelatin-coated dish containing 10 ml of ES cell media (Table 1) at 37 °C/5% CO2. When the cells reach 85% confluency remove the media and add 2 ml of trypsin. Incubate at 37 °C in the CO2 incubator for 5 min.\n\tNote: F1 ES cells were obtained from Barbara Panning24 and are available on request.\nNeutralize the trypsin by adding 10 ml of spin media (Table 2). Pipette repeatedly to detach the cells completely.",
    "Collect all the cells in a 15 ml tube and spin at 300 x g for 5 min. Resuspend in 3 ml PBS and count the cells using a hemocytometer or automated cell counter.\nPellet 1 x 106 ES cells in a 1.5 ml tube by centrifugation at 300 x g for 5 min and resuspend in 100 µl of R (resuspension) buffer as supplied by the kit manufacturer.\nAdd 5 µg each of pCas9_GFP (a gift from Kiran Musunuru; Addgene plasmid # 44719)31, 5' and 3' gRNA plasmids for deletion of the target region and mix gently with a pipette to avoid the introduction of bubbles.\nUse the electronic pipette tip to aspirate 100 µl of the electroporation mix, being careful to avoid a bubble in the tip.\nProgram the volts, width and pulses for electroporation. For F1 ES cells, use 1,400 V, 10 msec for 3 pulses.\nWhile the electroporation is running observe the tip to watch for any sparks in the solution. A spark indicates the presence of an air bubble and will interfere with the transfection.\nEject the transfected ES cells into a 10 cm gelatin-coated dish containing 10 ml ES cell media (Table 1) and incubate at 37 °C/5% CO2.\n3. FACS Sorting Transfected Cells\nAfter 48 hr, detach the cells by adding 2 ml of trypsin and incubate at 37 °C in the CO2 incubator for 5 min.\nNeutralize the plate by adding 10 ml of collection buffer (Table 3). Collect the cells in a 15 ml tube and spin at 300 x g for 5 min.",
    "Discard the supernatant and resuspend the cells in 1 ml of sorting buffer (Table 4). Count the cells and dilute based on the sorting platform. Dilute the cells to 0.5-1 x 106 cells/ml for sorting into 15 ml tubes and for sorting individual cells directly into 96-well plates, dilute the cells to 2-5 x 106 cells/ml.\nSort Cas9-GFP+ ES cells using a FACS flow cytometer32. Collect cells in bulk in tubes with 2 ml recovery media (Table 5) and plate as described in 3.5 for colony picking, or sort individual cells directly into gelatin-coated 96-well plates containing 100 µl ES cell media/well (Table 1).\nSeed 1-1.5 x 104 GFP+ ES cells in a 10 cm gelatin-coated dish containing 10 mL ES cell media (Table 1). Plating at this low density will facilitate picking individual ES cell colonies.\n4. Culturing Clones for Genotyping, Expression Analysis and Freezing Cell Stocks\nOn day 4-5 after sorting, score each well of direct sorted 96-well plates for the presence of ES cell colonies.\n\t\nDissociate ES cell colonies by removing the media and adding 30 µl of trypsin. Incubate at 37 °C for 5 min. Neutralize the trypsin by adding 170 µl of ES cell media (Table 1), and pipette up and down for complete dissociation of the colony into single cells. Grow the cells at 37 °C/5% CO2 until most wells are over 70% confluent (usually 2-3 days).\nAlternatively pick individual ES cell colonies from 10 cm dishes using an inverted microscope. After aspirating the colony into the pipette tip follow step 4.1.1 placing each colony in one well of a 96-well plate, pretreated with gelatin and containing 30 µl of trypsin.\n\tNote: Colonies can sit in trypsin at RT while one entire row of colonies is picked.",
    "Once all colonies have been picked and dissociated into media grow the cells at 37 °C in the CO2 incubator until most wells are over 70% confluent (usually 2 days).\nWhen the 96-well plates are ready for splitting, remove the media, add 30 µl of trypsin and incubate at 37 °C for 5 min. Neutralize the trypsin by adding 180 µl of ES cell media (Table 1) to each well and pipette up and down for complete dissociation into single cells.\nFrom the resulting 210 µl, seed 70 µl into three gelatin coated 96-well plates each containing 130 µl of ES cell media/well (Table 1). Use these plates for genotyping, expression analysis and freezing cell stocks for each clone as described below.\nWhen the genotyping plate reaches 70-85% confluence, treat the plate as described in section 6 \"Genotyping the deletion\".\nWhen the expression analysis plate reaches 70-85% confluence, remove the media, seal the plate with sealing tape and store at -80 °C until the clones have been genotyped.\n\tNote: The expression analysis plate is useful to analyze changes in gene expression at early passages of the clones. Gene expression analysis from the 96-well plate is possible but as the cell numbers are low a RNA micro extraction kit is recommended.\nPreparation of 96-well Plate Freeze Stock:\n\t\nWhen the plate for frozen cell stocks (stock-1) reaches 70-85% confluence, aspirate the media, add 30 µl of trypsin and incubate at 37 °C for 5 min.\nNeutralize the trypsin by adding 100 µl of ES cell media (Table 1) to each well and pipette up and down for complete dissociation into single cells.",
    "Transfer 15 µl of suspended cells from each well to two gelatin coated 96-well plates, each containing 185 µl of ES cell media (Table 1) and allow to grow at 37 °C/5% CO2.\n\t\tNote: This is for stock-2 and -3 plates which are additional back-up clones in case reviving the cells from stock-1 is not successful.\nMeanwhile, to the 100 µl of the remaining cells in the 96-well plate (stock-1), add 100 µl of 2x freezing media (Table 6). Seal the plate with a sealing tape and quickly invert the plate 4-5 times for proper mixing. Store the plate at -80 °C until clones are genotyped.\nWhen the stock-2 and stock-3 plates are ready for freezing aspirate the media, add 30 µl of trypsin and incubate at 37 °C for 5 min. Neutralize the trypsin by adding 70 µl of ES cell media (Table 1) to each well and pipette up and down for complete dissociation into single cells.\nAdd 100 µl of 2x freezing media, seal the plate with sealing tape and quickly invert the plate 4-5 times for proper mixing. Store the plate at -80 °C until these plates are needed.\n5. Allele-specific Primer Design\nDesign 4 sets of primers (Figure 1C) to screen the clones for the desired deletion: inside primers, outside primers, and gRNA flanking primers (for both 5' and 3' gRNA target sites) as described below.\n\t\nObtain the SNP track corresponding to the 129 and Cast genotypes at http://labs.csb.utoronto.ca/mitchell/crispr.html. The given track shows base substitutions between 129 and Cast at coordinates in the mm9 mouse genome assembly.\n\t\tNote: The link at the above site will redirect to the UCSC genome browser and add a custom track containing the SNPs between the 129 and Cast genomes.",
    "Enter the co-ordinates of the region to be deleted. Zoom in on a region of about 500 bp in the middle of the desired deletion containing >3 SNPs.\nGo to view>DNA in the option bar and click get DNA to download the target sequence in all upper case format.\nCreate two FASTA sequences; one for 129 and one for Cast by base substitution at the SNP position. Mark the SNPs by a lower case.\nGo to Primer3 plus (http://www.bioinformatics.nl/cgi-bin/primer3plus/primer3plus.cgi/) and paste the SNP substituted 129 sequence. Use the default settings to design primers.\nTo design the inside allele-specific primers select Primer_List in the task drop menu and click Pick Primers. Choose a forward or reverse primer that has a SNP either in the 3' end or within 4 bases from the 3' and falls inside the region to be deleted.\n\t\tNote: Primers that have a SNP at the 3'end display increased allele specificity in qPCR.\nTo select the second primer return to the main page, select Detection in the task drop menu and paste the first primer sequence in the appropriate box at the bottom of the page. In the General Settings tab change the setting for product size range to 80-200 bp and click Pick Primers. Chose a primer set from the listed primer pairs; these will be the 129 inside allele-specific primers.\nRepeat steps 5.1.5 to 5.1.7 to design primers for the Cast allele.\nReturn to the UCSC genome browser and enter the co-ordinates of the region to be deleted. Go to view>DNA in the option bar, under Sequence Retrieval Region Options add 1,000 bp upstream and downstream click get DNA to download the target sequence.\nMark the gRNA target sequence in brackets. Save this entire sequence before proceeding.",
    "To design the outside primers remove the sequence between the two gRNA target sequences. Repeat step 5.1.4-5.1.8 to design the outside allele-specific primers but change the product size 400-800 bp.\nSplit the sequence obtained in step 5.1.10 into two sequences, each with 500 bp 5' and 3' of the gRNA target sequence. Repeat steps 5.1.5 to 5.1.7 designing non-allele specific primers for gRNA flanking regions but change the product size 400-800 bp.\n\t\tNote: For non-allele specific primers, either 129 or Cast sequence can be used and primers should be chosen that do not contain a SNP. It is advisable to set a product size of 400-800 bp for designing outside and gRNA flanking primers. This allows for amplification even if small indels are present.\nTest the inside primers for allele specificity by qPCR using pure 129 and Cast strain genomic DNA at 2 ng/µl. Follow step 6.2-6.4 to set up the qPCR reaction.\n\tNote: If the 129 genotype in the targeted region is the same as C57BL/6J, DNA from C57BL/6J can be used in the place of 129 DNA. Allele-specific primers should display at least 5 cycles difference between the Ct (cycle threshold) value on the correct vs. the incorrect genotype. The outside primers can be tested to ensure they amplify the deletion using Cas9/gRNA transfected ES cells, and F1 genomic DNA respectively as positive and negative controls. The allele-specificity of outside primers can be tested once the monoallelic clones have been identified.\n6. Genotyping the Deletion\nExtract genomic DNA from the genotyping 96-well plate using the plate from step 4.6 that is generated after colony expansion.",
    "Prepare the genomic DNA extraction mix: 89 µl of water, 10 µl of 10x buffer and 1 µl of extraction reagent (supplied by the manufacturer). Add 100 µl of genomic DNA extraction mix to each well and seal the plate with a sealing tape.\nIncubate the plate at 75 °C for 5 min followed by 95 °C for 5 min.\nAllow the plate to cool by incubating on ice for a few min and then centrifuge briefly to settle any condensation to the bottom of the well. This serves as the template DNA plate for deletion screening.\nSet up the qPCR reactions in duplicate for each clone as follows: 5 µl of 2x SYBR qPCR mix, forward and reverse primer (3 µM) each 1 µl and 1 µl of water. Use a multichannel pipette to add 2 µl of template DNA followed by 8 µl of reaction mix to each well of a 384-well plate.\nSeal the plate with sealing tape and spin at 600 x g for 2 min to mix the contents. Place the 384-well plate array in the real time cycler.\nProgram the real time cycler for a 2-step PCR followed by melt curve analysis with detection as follows: 1 cycle at 95 °C for 10 min, 40 cycles of 95 °C for 15 s, 62 °C for 30 sec with plate read and 95 °C for 10 s, 65 °C to 95 °C with increment of 5 °C for 5 sec + plate read.\n\tNote: In addition to primer design, the qPCR mix and the cycle parameters also contribute to primer specificity. The parameters described above and reagents listed in the materials more frequently yield allele specific amplification.\nAnalyzing qPCR Results",
    "Check each allele for amplification with inside allele-specific primers. No amplification of one allele or high Ct value differences (>5 cycles) between alleles suggest these clones carry a heterozygous deletion of the allele with the high/absent Ct value. No amplification of both alleles suggests that they carry a homozygous deletion.\nCheck each allele for amplification with outside allele-specific primers. When the target deletion is larger than 1 kb amplification with outside primers occurs only when a deletion is present. A Ct value of 22-28 confirms the deletion. For target deletions smaller than 1 kb, confirm the amplicon size by electrophoresis.\n\t\tNote: If the outside primers show only moderate allele-specificity (see Figure 2), amplicons may be obtained with both allelic primer sets in monoallelic clones due to off target amplification of the outside primers. In this case a Ct value difference between the two alleles of at least five cycles should confirm the correct allele (lower Ct value) is deleted based on the results obtained from the inside primers. If the on target versus off target allele Ct difference is less than five cycles design new allele specific outside primers.\nIn monoallelic deletion clones check for the integrity of the non-deleted allele by using the secondary screening, gRNA flanking primers.\n\t\tNote: Indels of >25 bp size around the gRNA target site can be identified by observing a shift in the melt curve in the qPCR for 400-800 bp amplicons. Alternatively, the amplicons from the gRNA flanking primers can be sequenced to detect small indels of <25 bp.",
    "Perform qPCR with 2 sets of gRNA flanking primers i.e., 5' and 3' gRNA used in generating CRISPR deletion. No amplification with these sets of primers indicates indels larger than the qPCR amplicon are present at the gRNA target site on the non-deleted allele of monoallelic deletion clones. Discard clones containing these large indels from further analysis as the results may be difficult to interpret without knowing the extent of the deletion.\nPurify the amplicons obtained from the outside primer qPCR reaction using a PCR clean up kit following manufacturer's instruction.\nConfirm the sequence of the deleted allele by DNA sequencing the purified PCR product from the previous step. Use the qPCR amplification primers for forward and reverse sequencing.\n\tNote: At this stage SNPs within the amplicon act as a secondary confirmation of the genotype of the deleted allele.\n7. Analyzing Expression with Allele Specific Primers\nThaw the 96-well cell stock plate stored at -80 °C (stock-1 from step 4.9) by placing it on a warm bead bath. When more than half of the wells in the plate are thawed, spin at 300 x g for 5 min.\nCarefully, remove the sealing tape and quickly transfer the cells from the deletion positive wells into gelatin-coated, 12-well plates containing 1 ml of ES cell media (Table 1) and incubate at 37 °C/5% CO2.\nWhen the plate reaches 70-85% confluence, passage the cells and split them into three wells of a gelatin-coated, 6-well plate, each containing 2 ml of ES cell media (Table 1). Use two wells to prepare 2 vials of frozen cell stocks for long-term storage in liquid nitrogen (described in step 8) and the third well for RNA extraction.\nExtract RNA using an RNA extraction kit.",
    "Convert 100-500 ng of RNA to cDNA by reverse transcribing (RT) the RNA using the cDNA synthesis kit following the manufacturer's protocol. Include an RT negative reaction for each RNA sample to monitor the amount of contaminating DNA in the RNA samples.\nDilute the cDNA before qPCR in a ratio of between 1:2 and 1:4; depending on the expression level of the target gene in ES cells.\nSet the qPCR as described above including F1 genomic DNA as standard curve (5 fold dilutions from 250 to 0.08 ng/µl) for absolute quantification of transcript levels. Compare the expression of each allele of the gene of interest in each confirmed deleted clone to a suitable control gene, for example Gapdh (primers listed in Table 7).\n\tNote: Control gene primers do not need to be allele specific. Allele-specific primer design is the same for RT-qPCR primers as described for genotyping primers with the exception of the target region for amplification. The gene sequence should be used; if using primers for a single exon or an exon-intron boundary (to monitor primary transcript) F1 genomic DNA can be used for the standard curve. For further details on RT-qPCR please refer to Forlenza et al. 201233.\n8. Freeze Stock Preparation for Long-term Storage of ES Cells\nAdd 300 µl of trypsin to each 6-well (from step 7.3) and incubate for 5 min at 37 °C. Add 2 ml of spin media (Table 2) to neutralize trypsin and pipette up and down several times to dissociate into single cells.\nTransfer the cells into a 15 ml tube and spin at 300 x g for 5 min.\nAspirate the supernatant and add 500 µl of ES cell media (Table 1). Pipette up and down to resuspend the cells.",
    "Transfer the content to a 1.5 ml cryovial tube and add 500 µl of 2x ES cell freezing media (Table 3). Mix well by inverting the tube and place the tube into an alcohol-free cell freezing container. Place this cell freezing containers at -80 °C for at least 12 hr before transferring into a liquid nitrogen storage tank.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}