{
  "id": 17188,
  "origin_website": "Jove",
  "title": "Isolation of Murine Intestinal Mesenchyme Resulting in a High Yield of Telocytes",
  "procedures": [
    "All procedures described below were approved by the Institutional Animal Care and Use Committee (IACUC) at the Hebrew University of Jerusalem.\n1. Preparation of reagents and buffers\nPreheat a water bath to 37 °C.\nPrepare all the solutions in Table 1.\n2. Intestinal mesenchyme isolation\nEuthanize the mouse by CO2 inhalation, immediately followed by cervical dislocation.\nPlace the mouse in a supine position and spray the abdomen with 70% EtOH. Lift the abdominal skin and cut longitudinally along the midline to expose the peritoneal cavity (see Figure 1 I,II).\nLocate the stomach, cut from the esophagus, and slowly pull the intestine out of the peritoneal cavity. Clean excess fat and connective tissue using forceps. Excise the small intestine from the duodenum to approximately 0.5 cm from the cecum (Figure 1 III,IV).\nWash the intestine in a Petri dish containing cold sterile PBS. Using ball-tip scissors, open the intestinal tube longitudinally and wash out the feces (Figure 1 V). Transfer the intestine into a new dish containing fresh cold PBS and wash again.\nCut the small intestine into 1 cm long segments and transfer into a 15 mL conical tube filled with 8 mL of PBS. Shake the tube manually at one or two cycles/s for 1 min.\nTransfer the segments using forceps into a 50 mL conical tube filled with 20 mL of freshly made solution A (see Table 1). Place the tubes in an orbital shaker incubator at 37 °C for 20 min. After incubation, shake the tube vigorously by hand at four or five cycles/s for 1 min to dissociate the epithelium.\nRepeat step 2.6 once.\nTransfer the segments into a new 50 mL tube filled with 10 mL of sterile PBS, and invert the tube at one or two cycles/s for 1 min.",
    "Transfer the segments into a new 15 mL tube filled with 10 mL of sterile PBS, and tilt up and down gently at one or two cycles/s for 2 min.\nUnder a biosafety cabinet, use forceps to place the segments on a sterile laboratory wipe to dry them out. Once dried, cut the segments further into 0.5 cm pieces.\nTransfer the small segments using forceps into a 6-well plate filled with 4 mL of prewarmed digestion solution per well. Incubate at 37 °C for 50 min. Gently shake the plate by hand every 20 min.\nTransfer the segments using a Pasteur pipette into a 15 mL conical tube filled with 4 mL of DMEM. Shake the tube manually at four or five cycles/s for 1 min to get a single-cell suspension.\nFilter the suspension through a 100 µm strainer into a 50 mL conical tube. Centrifuge the filtrate at 700 × g for 5 min at 4 °C.\nDiscard the supernatant by aspiration and resuspend the cell pellet in 5 mL of 2% FBS/PBS. Centrifuge the suspension at 700 × g for 5 min at 4 °C.\nDiscard the supernatant by aspiration, resuspend the cell pellet with 12 mL of culture medium, and seed 1 mL per well onto two 6-well plates. The following day, wash and aspirate any dying cells and replace the spent medium with fresh medium.",
    "NOTE: For optimal maintenance of the culture, it is recommended to change the medium every 2 days. Depending on the mouse strain, genetic background, and age, 4 days to 2 weeks are needed for the mesenchyme to be ready for co-culture experiments. For further co-culture experiments, mesenchyme should reach confluency, displaying flat and fully stretched cellular morphology as shown in Figure 2. In general, cells with round morphology are not viable or functional.\nimgsrc://cloudfront.jove.com/files/ftp_upload/64169/64169fig01.jpg\nFigure 1: Mouse dissection. (I) Place the mouse in a supine position and spray the abdomen with 70% EtOH. Lift the abdominal skin. (II) Open the peritoneal cavity longitudinally along the midline. (III) While gently pulling the stomach, sever the esophagus. (IV) Pinch the stomach and slowly pull out the intestine. (V) Insert the tip of the ball-tip scissors in the lumen and open the intestinal tube longitudinally. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/64169/64169fig01large.jpg]\n3. Mesenchyme resuspension for passaging or co-culture\nResuspend the mesenchyme with 2 mL of 0.25% trypsin-0.5 mM EDTA/well in a 6-well plate. Incubate for 5 min at 37 °C. Following incubation, if several cells have not already started detaching from the dish, incubate for an extra 2 min.\nUsing a cell scraper, gently scrape the surface of the well. Transfer the cell suspension into a 15 mL conical tube. Add 2 mL of DMEM-F12/well and gently pipette the suspension up and down.\n\tNOTE: It is important not to overfill the tube with more than 50% of the tube volume. It is therefore recommended to use a 15 mL conical tube filled with 8 mL of suspension for every two wells.\nCount the cells.\n\tNOTE: A fully confluent well yields between 2 × 106 cells and 2.5 × 106 cells.",
    "Dilute the cell suspension to achieve a seeding density of 3-5 × 105 cells/mL. Centrifuge for 5 min at 500 × g at 4 °C and discard the supernatant by careful aspiration.\n\tNOTE: It is important to remove as much liquid as possible.\nResuspend the cell pellet in prewarmed culture medium and plate.\n4. Flow cytometry analysis for telocyte purification\nObtain the mesenchymal cell pellet (step 2.14). Resuspend the cell pellet in 1 mL of FACS buffer and filter through a 40 µm strainer.\nIncubate the cell suspension with allophycocyanin (APC)-conjugated CD326 (1:100), CD45 (1:400), and CD31 (1:250) antibodies in 400 µL of FACS buffer for 15 min at room temperature to exclude epithelial, immune, and endothelial cells, respectively, from the sort.\nWash the cells by adding 1 mL of FACS buffer and spin down at 700 × g for 5 min at 4 °C. Resuspend in 400 µL of FACS buffer and add 4',6-diamidino-2-phenylindole (DAPI, 5 mg/mL, 1:1,000) for flow cytometry analyses. Gate the single cells according to the SSC-height by SSC-area. Gate the DAPI- live cells and gate out CD45+/CD31+/CD326+ to sort the GFP+ telocytes, as shown in Figure 3."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}