{
  "id": 6062,
  "origin_website": "Bio",
  "title": "Host-regulated Hepatitis B Virus Capsid Assembly in a Mammalian Cell-free System",
  "procedures": [
    "Make RNase-free plasmids for in vitro translation in rabbit reticulocyte lysateTreat plasmid DNA with Proteinase K and SDS to remove any contaminating RNases in plasmid DNA. As shown in the table below, incubate HBc-expressing plasmids with SDS (final concentration 0.6% w/v) and Proteinase K (final concentration 0.4 µg/µl) at 50 °C for 30 min.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417190111_5593.jpgNotes: Always dilute 20% of SDS in the TE buffer first before adding Proteinase K.Any plasmid vector containing a bacteriophage promoter (T7 in the example below) that can be used for in vitro transcription using the cognate phage RNA polymerase can be used for coupled transcription and translation in this system. Add an equal volume (200 µl) of phenol to the digestion reaction, mix well and spin at the maximal speed (17,000 x g) for 5 min at room temperature. Transfer the aqueous (top) layer to a new tube and repeat this step. Add an equal volume of chloroform and extract once as described in Step A2.Measure the aqueous solution and add an appropriate volume of 3 M of sodium acetate (final concentration at 0.3 M) and 100% of ethanol (final concentration at 70%), mix well and incubate at -20 °C for 30 min. Centrifuge at the maximal speed (17,000 x g) for 20 min at 4 °C and wash the pellet 3 times each with 1 ml of 70% ethanol, with spinning at the maximal speed for 10 min at 4 °C.Resuspend DNA with 30 µl of RNase-free water. Measure DNA concentration with a spectrophotometer (NanoDropTM 1000) and adjust the DNA concentration to 1 µg/µl and then verify DNA integrity by agarose gel electrophoresis.In vitro translation in rabbit reticulocyte lysate A TNT® Coupled Rabbit Reticulocyte Lysate (RRL) in vitro translation system (Promega) is used to express the HBc protein as recommended by the manufacturer.",
    "Preparation of the translation kitPut TNT® RNA Polymerase (T7) on ice.Quickly thaw the TNT® Rabbit Reticulocyte Lysate by hand-warming and immediately put on ice.Thaw the other components at RT (25 °C) and put on ice.Notes: The TNT® Reaction Buffer may contain a precipitate after thawing and sitting on ice. Redissolve the precipitate by vortexing at room temperature for 30 sec.Do not freeze-thaw the lysate more than twice.Any unused lysate should be refrozen in a dry ice/ethanol bath as soon as possible after thawing to minimize loss of translational activity.Assemble the reaction components in a 1.5 ml microcentrifuge tube following the table below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417190252_4362.jpgNote: Small-scale reactions may be performed by reducing all components proportionally.Incubate reaction at 30 °C for 90 min.Put the reactions on ice and proceed to the assembly steps or store the reactions at -80 °C for future use.Notes: Except for the actual translation incubation, all handling of the lysate components should be done at 4 °C or on ice.A ribonuclease-free environment is required during all of the operations: Add RNasin® Ribonuclease Inhibitor to all TNT® Lysate reactions to prevent RNA degradation.Microcentrifuge tubes and pipette tips should be RNase-free.Use a cleaning agent (such as RNaseZAPTM) to clean the bench and gloves to remove RNase.In vitro capsid assembly in RRLOur recent studies have shown that both HBc NTD and CTD are required for HBV capsid assembly at physiologically low HBc concentrations translated in RRL (Ludgate et al., 2016). CTD likely facilitates assembly under these conditions via RNA binding and protein-protein interactions. Moreover, CTD is subject to phosphorylation and dephosphorylation by endogenous host kinase(s) and phosphatase(s) in RRL, which further regulates capsid assembly.",
    "To confirm the roles of CTD in capsid assembly in RRL, especially its RNA binding activity and regulation of assembly by phosphorylation state, the following treatments, as shown in Figure 1, are applied to the HBc in vitro assembly assay in RRL.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180416/20180416193230_5936.jpgFigure 1. Conditions for in vitro capsid assembly in RRL. Mock, the reaction is incubated at 37 °C for 16 h without any treatment. CIAP, CIAP (10 U/µl) is added in the reaction during the assembly incubation. CIAP + RNase, RNase A (0.1 mg/ml) is added and incubated for another 1 h after the CIAP incubation. RNase + CIAP, the reaction is treated with RNase A before the CIAP incubation. PPI, PPI (1x) is added during the assembly incubation. PPI, a mixture of phosphatase inhibitors (see Recipes below), CIAP, calf intestinal alkaline phosphatase.Mock incubationAssemble the reaction components in a 1.5 ml microcentrifuge tube following the table below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417190556_6590.jpgNote: PI, a mixture of protease inhibitors (see Recipes below).Incubate the reaction at 37 °C for 16 h.Put the reactions on ice and proceed to the analysis steps or store the reactions at -80 °C for future use.CIAP incubationAssemble the reaction components in a 1.5 ml microcentrifuge tube following the table below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417191237_4852.jpgIncubate the reaction at 37 °C for 16 h.Put the reactions on ice and proceed to the analysis steps or store the reactions at -80 °C for future use.CIAP followed by RNase incubationAssemble the reaction components in a 1.5 ml microcentrifuge tube following the table below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417191409_4639.jpgIncubate the reaction at 37 °C for 16 h.Add 0.1 µl of RNase A (10 mg/ml) to the assembly reaction and incubate at 37 °C for another 1 h.Put the reactions on ice and proceed to the analysis steps or store the reactions at -80 °C for future use.",
    "RNase followed by CIAP incubationAssemble the reaction components in a 1.5 ml microcentrifuge tube following the table below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417191607_0017.jpgIncubate the reaction at 37 °C for 1 h.Add 1 µl of CIAP (10 U/µl) to the assembly reaction and incubate at 37 °C for another 16 h.Put the reactions on ice and proceed to the analysis steps or store the reactions at -80 °C for future use.PPI incubationAssemble the reaction components in a 1.5 ml microcentrifuge tube following the table below.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180417/20180417192023_2304.jpgIncubate the reaction at 37 °C for 1 h.Put the reactions on ice and proceed to the analysis steps or store the reactions at -80 °C for future use."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}