{
  "id": 6757,
  "origin_website": "Bio",
  "title": "Preparation of Single Epithelial Cells Suspension from Mouse Mammary Glands",
  "procedures": [
    "Isolation of mammary glands from female mice (Figure 1)Sacrifice the female mouse via cervical dislocation and restrain it with abdomen up by pinning its feet into a foam surface using pushpins.Make a parallel incision along the mouse’s abdomen without puncturing the peritoneum by using scissors and forceps. Then enlarge the incision along the hind legs to the feet, to make a “Y-type” incision.Pull back the skin and pin it to the foam surface to expose the fourth pair of the mammary glands. Remove the whole mammary mounts free from the body.Transfer the mammary glands into a sterile 50 ml centrifuge tube and mince it into pieces as small as possible inside the tube with scissors.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200216/20200216053044_4440.jpgFigure 1. Isolation of fourth pairs of mouse mammary glands for cells dissociation. A. The sacrificed mouse was restrained on a foam surface. B. A “Y-type” incision was made to expose the fourth pair of mammary glands (within the red circles). C. The mammary glands were removed and transferred into a 50 ml centrifuge tube. D. The minced mammary tissue was treated with digestion buffer A for cells dissociation.Digestion of mammary glands into cell suspensionAdd 5 ml digestion buffer A (for 1 pair of mammary glands) into the 50 ml centrifuge tube with minced mammary pieces. And pipet several times to efficiently mix with a 5 ml sterile serological pipette.Put the 50 ml centrifuge tube into the holder of the orbital shaker which is settled in the cell culture incubator (37 °C, 5% CO2). Set the speed as 120 rpm.Pipetting the mammary tissue repeatedly (pipetting once every 15-20 min) for sufficient dissociation. It usually takes about one hour.Once there are only very few macroscopic pieces left in the tube, spin down the dissociated mammary cells at 300 x g for 3 min at room temperature.",
    "Remove the supernatant, and re-suspend the cells pellets with 2 ml digestion buffer B. And put the tube on the orbital shaker within the cell culture incubator for 5 min at 120 rpm.Spin down the cells and wash them with 5 ml HBSS.Spin down again, remove the supernatant and re-suspend the cells pellets with 1 ml 0.25% Trypsin-EDTA for a further digestion on the orbital shaker within the cell culture incubator for 2 min at 120 rpm.Neutralize the digestion by adding 9 ml DMEM/F12 medium with 5% FBS and spin down the cells. Wash them once with HBSS and spin down again.Epithelial cells enrichmentTo remove the red blood cells, re-suspend the cells pellets with 1 ml 1x RBC lysis buffer and incubate at room temperature for 5 min.Stop the reaction by adding 5 ml HBSS. Mix and then spin down the cells.Note: If the cells pellets appear red or pink color, which indicates there are still some red blood cells left, re-treat the cells with 1 ml 1x Red Blood Cells (RBC) lysis buffer for another 5 min and then wash with HBSS. Re-suspend the cells pellets with 5 ml DMEM/F12 medium + 5% FBS. Then filter the cells through a 40 µm cell strainer.Count the cell number by using the Nexcelom Cellometer Auto 2000 with a cell counting chamber.To enrich the mammary epithelial cells, an EasySeq Mouse Epithelial Cell Enrichment kit is used to remove the lineage markers positive (Lin+) non-epithelial cells following the manufacturer’s instructions. Briefly, the Lin+ cells are bound with immune-magnetic beads targeting the lineage markers and attracted to the EasySep magnet, then the desired Lin- epithelial cells remain free for collection.",
    "Cell sorting to separate basal and luminal cellsCount the number of the enriched epithelial cells and re-suspend the cells at a concentration of 1 x 106 cells per 100 μl of FACS buffer with anti-mouse CD24-PE-Cy7 antibody (1:200), anti-mouse CD29-APC antibody (1:200) and DAPI (1 μg/ml).Stain the cells in ice for 30 min in dark. And then wash cells with DPBS (3-5 volumes of staining buffer) twice (spin down at 300 x g for 3 min).Re-suspend the cells with FACS buffer (3 volume as the staining buffer to make a final cell concentration around 3 x 106 cells/ml).Load the cells suspension for cell sorting. DAPI-CD24MidCD29Hi cells and DAPI-CD24HiCD29Lo cells were gated and sorted out as basal and luminal mammary epithelial cells, respectively (Shackleton et al., 2006; Sun et al., 2018). The collected basal and luminal cells could be used for single cell RNA sequencing or other purposes."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}