{
  "id": 3481,
  "origin_website": "Cell",
  "title": "Protocol for live imaging of transferred mouse bone marrow cells by two-photon microscopy",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nFixation of the mouse to the stage\nTiming: 30–45 min\nThe skull bone was exposed non-invasively (steps 1–2) and fixed using a head holder and stage (steps 3–5) to obtain a clear imaging view of the bone marrow cavity during time-lapse imaging.\nAnesthetizing the mouse:\nVolatilize the isoflurane (4.0%–5.0%) and fill the anesthesia box.\nPlace the mouse in the anesthesia box and close the lid.\nPlace the anesthetized mouse on a paper towel.\nPlace the tip of the inhalation anesthesia tube at the nose of the mouse and fasten the tube with cellophane tape to anesthetize the mouse with isoflurane (2.5%–3.5%).\nSurgical procedure to expose the front parietal region of the skull bone (Figure 4[href=https://www.wicell.org#fig4]):\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3056-Fig4.jpg\nFigure 4. Exposing the skull bone\n(A) Shave the head hair.\n(B) Remove the remaining hair with removal cream and a cotton swab.\n(C) Wipe off the hair removal cream completely.\n(D) Cut the skin in a cephalocaudal direction from the ear to the tip of the nose (yellow dotted line).\n(E) Cut the skin in a proximodistal direction from the top of the head to the side of the ears (yellow dotted line).\n(F) Remove the excess skin by cutting along the yellow dotted line.\nShave the head hair with clippers (Figure 4[href=https://www.wicell.org#fig4]A).\nApply hair removal cream to the skin and spread thinly using a cotton swab (Figure 4[href=https://www.wicell.org#fig4]B).\nWipe off the hair removal cream with a paper towel to completely remove the hair (Figure 4[href=https://www.wicell.org#fig4]C).\nThe skin is pinched with tweezers and split in a cephalocaudal direction using surgical scissors. This longitudinal split runs from the ear to the level of the nose tip (Figure 4[href=https://www.wicell.org#fig4]D).",
    "The skin is cut in a proximodistal direction from the top of the head to the side of the ears (Figure 4[href=https://www.wicell.org#fig4]E).\nExcess skin is removed for a later attachment of the plate to the bone (Figure 4[href=https://www.wicell.org#fig4]F).\nCritical: Avoid injuring the blood vessels, which may disturb the visual field. Pay particular attention to branches of the superficial temporal vein that runs between the eyes and ears, the supra-orbital vein that runs above the eyes, and the dorsal nasal vein that runs to the tip of the nose.\nNote: Hair auto-fluoresces, which interferes with clear imaging. Therefore, hair must remain out of the field of view throughout the procedure.\nFix the head holder to the skull bone (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3056-Fig5.jpg\nFigure 5. Fixing the head holder\n(A) Apply “Aron Alpha” and “M3 tissue bond” to the outside of the window edge.\n(B) Flip the plate, adhere it to the skull bone, and press the plate down gently.\n(C) Create a glue pool using “Aron Alpha” in the corner of the plate.\n(D) Fill in the gaps using the needle tip.\nApply glue to the back of the head holder, which has a hexagonal window, and attach it to the skull bone.\nApply Aron Alpha instant adhesive to a line 5 mm outside the window edge.\nApply tissue bond (M3) to the area inside of the Aron Alpha zone (Figure 5[href=https://www.wicell.org#fig5]A).\nFlip the plate over and adhere the bonded side to the skull bone (Figure 5[href=https://www.wicell.org#fig5]B).\nPress the plate down gently.\nAllow the plate to stand for about 3 min until the adhesive dries.\nFill the gap between the head holder and the bone.\nCreate a glue pool using Aron Alpha in one corner of the right side of the hexagon of the head holder (Figure 5[href=https://www.wicell.org#fig5]C).",
    "Stretch the adhesive along the hexagonal sides and fill in the gaps using the tip of a needle (Figure 5[href=https://www.wicell.org#fig5]D).\nPerform the same technique on the left side.\nAllow the plate to stand for about 15 min until the adhesive dries.\nCritical: Do not get any adhesive in the observation field of view within the hexagon, as noise may appear in the image.\nNote: A mortise exists between the skull bone surface and the head holder. Because of the use of a water immersion objective lens, this area must always be filled with phosphate-buffered saline (PBS) under a two-photon microscope. The gap between the head holder and the skull should be filled with adhesive to prevent the PBS from leaking.\nSet the mouse on the stage (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3056-Fig6.jpg\nFigure 6. Setting the mouse on the fixing stage\n(A) Side view of the mouse fixed on the stage.\n(B) Top view of the mouse fixed on the stage.\nSecure the head holder and stage.\nTurn the three-way stopcock to switch the anesthetic route to the tube extending to the stage.\nQuickly place the mouse and head holder on the stage.\nAdjust the position of the anesthesia tube to fit the nose and fix the tube firmly with tape.\nSecure the head holder and stage with two screws on each side.\nCritical: The stage should be pre-warmed to prevent a z-axis deviation due to thermal expansion.\nNote: Tape the anesthesia tube to the stage before moving the mouse to the stage. This tube has an opening in the middle not at the tip. The position of the tube should be adjusted after moving the mouse. Then, tape the tube securely in place.\nMake sure there is no gap between the skull bone and the head holder.",
    "Drip about 1 mL of PBS over the mortise of the head holder using a dropper.\nMake sure that the liquid level does not decrease.\nSoak up the PBS and add new PBS. Repeat several times using a dropper to clean up the visual field.\nCritical: If the liquid level drops, there must be a gap between the head holder and the skull. Fill the gap with adhesive again.\nOptional: If the time-lapse imaging is continued for more than several hours, the PBS in the head holder at the beginning of imaging will be dry by the middle of imaging. To maintain water immersion towards the objective lens, lay out an 18G needle with the route on the groove carved into the plate. The route is connected to a syringe pump which enables continuous infusion of PBS (Figure 6[href=https://www.wicell.org#fig6]B).\nInsert an injection line in the tail vein (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3056-Fig7.jpg\nFigure 7. Injection line at the tail vein\n(A) Warm the tail on a 50 mL tube containing hot water.\n(B) Insert the needle into the caudal vein and check for back-flow of blood.\n(C and D) Glue the needle to the tail with Aron Alpha and tape the tube to the tail at an appropriate angle.\nWarm the tail vein.\nFill a polypropylene conical tube (50 mL) with hot water.\nPlace the tail on the tube and warm it for a few minutes to dilate the tail vein (Figure 7[href=https://www.wicell.org#fig7]A).\nSettle the injection line.\nFill the pre-made intravenous route with PBS using a syringe.\nInsert the needle into the caudal vein.\nCheck for back-flow of blood from the tail vein to the needle (Figure 7[href=https://www.wicell.org#fig7]B).\nInject PBS by pushing the syringe and confirm that the needle tip is inserted in the vessel.",
    "Glue the intravenous route to the mouse tail with Aron alpha A and Scotch tape (Figures 7[href=https://www.wicell.org#fig7]C and 7D).\nNote: The blood vessel staining solution can be injected in one shot without placing the injection line inside the vein for short imaging of less than 1 h.\nOptional: If the imaging is continued for more than several hours, an electrocardiographic monitoring system can be used to control the anesthesia level. Extra needles must be inserted into the limb skin to set the electrocardiographic electrodes.\nIntravital bone marrow imaging\nTiming: variable (several hours to days)\nAcquiring the imaging data using a multi-photon microscope.\nSet up for imaging.\nStart up the multi-photon microscope and turn on the heater in the environmental dark box for the laser and to stabilize the temperature.\nPlace the mouse fixed to the stage on the ThermoPlate which is inside an environmental dark box (Figure 3[href=https://www.wicell.org#fig3]).\nConnect the end of the anesthesia tube to the other end of the tube extending from the anesthetic machine to the environmental dark box. Connect the anesthesia tube for the anesthetic machine, the electrocardiographic monitoring system (optional) and syringe infusion pump through the environmental dark box to the mouse stage.\nIntravenously inject 100 μL of blood vessel staining solution. Thereafter, inject the solution continuously at a rate of 0.1 mL/h using the syringe infusion pump.\nLook through the ocular lens using a mercury lamp and focus on the bone marrow cavity at an appropriate depth.\nDetermine the appropriate visual field to conduct time-lapse imaging.\nTurn off all room lights.\nAcquiring the imaging data.\nChange the light source and light path to the femtosecond-pulsed infrared laser.\nSet the excitation wavelength, zoom ratio, z-positions, interval time, and duration time in the microscope software.\nCommence imaging.",
    "Optional: Monitor the heart rate of the mouse using an electrocardiographic monitoring system during time-lapse imaging.\nNote: The excitation wavelength of 840 nm was used to excite SHG (second harmonic generation), CellTracker Green, and Alexa Fluor 594–conjugated isolectin GS-IB. The image stacks for intravital time-lapse bone imaging were collected at 3 μm vertical steps at a depth of 50–125 μm below the skull bone surface with 1.0× zoom, 512 × 512 X–Y resolution, and time resolution of 2 min.\nData processing and analysis\nTiming: variable (several hours to days)\nCreating the images and movies and analyzing the cell dynamics.\nData processing.\nCreate the images and movies (Figure 8[href=https://www.wicell.org#fig8], Methods video S1[href=https://www.wicell.org#mmc1]).\nOutput the images as tiff files from the original file extension using software such as Fiji, NIS-Elements, or Imaris. Movies were created from the tiff files using After Effects software.\nPre-processing.\nFirst, the imaging data were pre-processed to remove background and accentuate the signal. For example, “background subtraction” is a widely used method to remove the background. Additionally, drift should be aligned using “Align” in NIS-Elements or \"Correct drift\" in Imaris.\nAnalyzing and quantifying the images (Figure 9[href=https://www.wicell.org#fig9], Methods video S2[href=https://www.wicell.org#mmc2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3056-Fig8.jpg\nFigure 8. Intravital time-lapse 3D imaging of LSK cells\n(A) 3D time-lapse images of LSK cells inside the bone marrow. Image stacks were collected at 75 μm depth for 24 min. Bone (SHG) is shown in blue, LSK cells (CellTracker Green) are shown in green and blood vessels (isolectin) are shown in red. Scale bar = 100 μm.\n(B) Consecutive time-lapse images indicated by a white square in (A). Scale bar = 30 μm.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3056-Fig9.jpg\nFigure 9. Cell dynamic analysis using Imaris",
    "(A) Trajectory analysis of LSKs observed in Figure 8[href=https://www.wicell.org#fig8] using “spots” in Imaris. LSK centroids are shown as yellow spots and each trajectory is shown as a white line, n = 8.\n(B) The speed of LSKs in each time frame was calculated from (A). Each line applied to a cell, n = 8.\n(C) The surface of the bone with the LSK trajectory.\n(D) The distance of the LSKs from the bone surface in each time frame. Each line applies to a cell, n = 8.\n(E) The surface of the blood vessel with the LSK trajectory.\n(F) The distance of the LSKs from the blood vessel in each time frame. Each line applies to a cell, n = 8.\nAnalyze the images by measuring the cell movement, contact frequency and duration of contact using the software. \"Imaris\" is a powerful tool for analyzing cell velocity or distance in 3D (X, Y, and Z with or without time).\nDesign the rendering automatically or semi-automatically using the \"Surface\" mode for bone and blood vessels or \"Spot\" mode for cells.\nAfter the rendering, measure or track the structures by selecting an appropriate algorithm at \"Track Spots/Surface (over Time)\".\nNote: The results of the calculation are shown in the statistics tab in each mode.\nTo measure the distance from the spots to the surfaces, create a channel representing the distance gradient of the surface by selecting \"Distance transformation\" and \"Outside of surface object\" listed in the tool tab of Surface mode.\nThe distance between the surface and the spots can be exported in the statistics tab of Spot mode, \"Intensity Center\".\nNote: If you want to use your own algorithms, the \"Imaris XT\" interface makes it possible to incorporate the programming designed with MATLAB.",
    "Note: To improve the reproducibility of the analysis, appropriate parameter values must be determined, and all images must be processed using the same parameter values. Appropriate parameters are determined by the experimenter using multiple images or using deep learning.\nOptional: \"NIS-Elements (NIKON)\" and other software that are released by each microscope company are helpful for the 2D (X, Y with or without time) analysis.\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Intravital time-lapse 3D imaging of LSK cells, related to step 8\n    \nThree-dimensional time-lapse images of LSK cells inside the bone marrow. Bone (SHG) is shown in blue, LSK cells (CellTracker Green) in green, and blood vessels (isolectin) in red. Scale bar = 100 μm.\n    Your browser does not support HTML5 video.\n  \n      Methods video S2. Time-lapse movie of LSK trajectory, bone surface, and vessel surface, related to step 9\n    \nCentroids of the LSKs are shown as yellow spots and each trajectory is shown as a white line. The bone surface is in blue and the blood vessel surface is in red. Scale bar = 100 μm."
  ],
  "subjectAreas": [
    "Atomic Force Microscopy (Afm)",
    "Antibody",
    "Stem Cells",
    "Microscopy",
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}