{
  "id": 8787,
  "origin_website": "Jove",
  "title": "Chronic Transcranial Electrical Stimulation and Intracortical Recording in Rats",
  "procedures": [
    "All methods described here are in accordance with the directives of the European Communities Council (86/609 ECC) and have been approved by the Ethical Committee for Animal Research at the Albert Szent-Györgyi Medical and Pharmaceutical Center of the University of Szeged (XIV/218/2016).\n1. Fabrication of the Stimulation Electrodes\nTo make one stimulation electrode, cut six 10 cm long pieces of miniature hook-up wires, remove 2 cm of the cladding on one end, and 1 cm on the other end.\nTwist two cables together and solder them at the shorter peeled side.\nAcquire a strip of three tape packaging of any integrated circuit with SOT-353 case.\nStitch the twisted wires through the three holes of the package. The longer peeled segment of the wires should be in the cavities of the package. Position the cables so that the end of the insulation is in line with the edge of the holes.\nPut the dental cement on the holes to fix the wires.\n\tCaution: The dental cement must be dense enough to avoid leaking into the cavity of the package.\nOnce the cement is solidified (minimum 10 min), flip the package and put a thin layer of superglue into the hole to form a watertight seal towards the porous cement. Avoid gluing the peeled wires.\nTwist the cables together on the shorter peeled side and solder them (Figure 1A).\nGrab the longer peeled segment of the wires with the tip of fine tweezers, roll them around, and wrap them into the cavities (Figure 1B). Cut excess cable, if necessary.\n2. Fabrication of the Recording Electrodes",
    "To make one recording triplet electrode (Figure 1C-D), cut a one cm long piece of stainless steel tube using high-speed rotary saw. Remove the fin from the ends of the tube with a sharp needle and ensure that the tube is clean of debris and completely permeable.\n\tNOTE: Do not use pliers, as they will distort the tube.\nBend a gold-plated board spacer pin with a minimum length of 3 cm to form a J-shape holder. Cut the longer leg of the 'J' shape, and solder it together to get back the original shape to make a detachable joint between the long linear part, which will be held by the stereotaxic device, and the 'U' shape, which will hold the electrode, and serve as an anchoring point. Glue the tube and the shorter leg of the 'J' holder together. Glue some additional 1 cm long bars, if necessary, for stability.\nCut 3 pieces of 2.5 cm long electrode wires with stainless steel, ultrafine scissors. Make sure that it is a clear and sharp cut, and the insulation is intact at the circular surface of the electrode wire. Also make sure that the cut tip is not bent due to the force applied. Bend 1 or 2 mm on one end of each of the wires at different angles (e.g., one left straight, one 45°, and one right angle) to make them distinguishable.\nFill the tube with the wires, choose an appropriate spacing of the electrodes for the experiment (e.g., for cortical local field potential (LFP) and current source density (CSD) registration, the recommended protrusion of the tips of the wires from the opening of the tube: 4.5 mm, 4.1 mm, and 3.7 mm, respectively). Note which wire corresponds to which depth for maintaining a proper channel order.",
    "Once the wires align right next to each other and are parallel with the tube, to fix the electrode wires, place a single drop of liquid superglue at both ends of the tube with a sharp needle. Make sure that the glue is flowing into the tube due to the capillary effect, but not towards the recording sites at the protruding ends.\nPrepare an electrode interface board with a proper microconnector compatible with the recording system to be used.\nIntroduce the non-recording, bent ends of the wires into the holes of the electrode interface board corresponding to the desired recording channel. When all the wires are in position, push the gold pins into the holes with tweezers.\n\tNOTE: Gold pins may be fixed in place using dental cement, but in most cases, it is stable enough even without this safety step.\n3. Anesthesia\nPlace the animal in a sealed anesthesia induction chamber and fill it with 4 - 5% of isoflurane in 2 L/min medical air.\nWhen the rat is recumbent, remove the animal from the chamber and place it in a stereotaxic frame with an appropriate ventilation nose piece.\nSet the isoflurane level to 2%, though the rate of airflow should remain the same. Check the level of anesthesia. If there is an absence of the paw withdrawal reflex in response to pinching, continue, otherwise increase the depth of anesthesia.\nMonitor and maintain the rat's body temperature at 37 ± 0.5 °C with a homeothermic monitoring system. Apply a droplet of paraffin ointment on the eyes to prevent desiccation of the cornea. Repeat this procedure during the surgery several times, if necessary.",
    "Subcutaneously inject 0.3 mg/kg atropine to avoid mucus formation in the airways. Repeat this every four hours in case of longer surgeries. Monitor breathing and adjust vaporizer, if needed.\n4. Implantation of the Stimulation and Recording Electrodes\nNOTE: Autoclave all the necessary surgical instruments and carefully follow the general rules of asepsis and antisepsis during the whole procedure. Avoid touching nonsterile areas outside of the surgical area. Immerse the electrodes in ethyl alcohol (70%) for 30 min before implantation.\nRemove most of the hair from the scalp with a hair clipper. Apply depilatory cream on the scalp, spread it evenly on the surface, and wait a few minutes. Use a spatula to gently remove the cream and the remaining hair. Rinse the skin with water, then with disinfectant.\nInject 1 - 2% lidocaine (do not exceed a total dose of 7 mg/kg) subcutaneously to numb the skin. Apply a single drop of vet ointment for the eyes (e.g., paraffin).\nMake a thorough and a long (~2 cm) sagittal incision in the midline with a scalpel, from the forehead to the neck. Dissect the tissues including the periosteum from the skull, then using a chisel or tooth tweezers clean the area between the cristae of the two temporal bones. Keep the skull exposed by retracting the dissected skin using four bulldogs.\nGently place fine tweezers between the steep edge of the temporal bone and the muscles and separate them. Make jigging movements to expose as much of the large surface of the temporal bone as possible, preferably from the edge of the occipital bone to the plane of the coronal sutures, without damaging the muscles.\nPlace retractors bitemporally to keep the temporal bones exposed.",
    "Rinse the surface of the skull with 1 - 2 mL 3% H2O2, then wash it with 1 - 2 mL water.\nAir-dry the surface of the temporal bones very carefully, mop up the moisture with ocular sticks. Test if the stimulation electrodes fit onto the cleaned vertical skull surface (the upper edge of the stimulation electrode should be in line with the edge of the crista of the temporal bone). Re-adjust the bulldogs and the retractors or shape the stimulation electrodes with scissors, if necessary.\nFill the cavities of the stimulation electrodes with electroconductive gel and put a thin layer of glue onto the rim of the electrodes.\nPlace the stimulation electrode on the dry surface of the temporal bone with one accurate movement, and hold it firmly in place for one minute with fine tweezers. Make sure that no moisture is in contact with the glue. Mop up with ocular sticks, if necessary.\n\tCaution: In case any instability of the electrode is experienced, remove it. After cleaning the bone, repeat this step with a new stimulation electrode.\nPut dental cement over the edges of the stimulation electrode, while the leaking moisture of the tissues is continuously dried up with ocular sticks. Cover the whole stimulation electrode with cement.\nAfter the cement is completely hardened, repeat these steps on the contralateral side.\nDrill some holes all over the skull for anchoring screws. Drive miniature screws into the holes and put dental cement over them. Use a ~10% smaller diameter drill head compared to the screw diameter.",
    "Depending on the purpose of the experiments, either solder a connector to the ends of the cables, place it on the surface, and cover with cement, or continue implanting the recording electrodes and optical fibers, or prepare a cranial window over the skull. In this latter case, solder the connectors and anchor them to the construct only at the end. In case of the need of long-term simultaneous TES and LFP recordings, implant the aforementioned electrode triplets instead of single wires.\n\tNOTE: This setup allows for the removal of common mode stimulation artefacts8. For the details of recording electrode implantation, see previous protocols14,15.\nWash the exposed tissues abundantly with disinfectant. Inject 1 - 2% lidocaine (do not exceed a total dose of 7 mg/kg) subcutaneously.\nDebride wound edges and close them with simple interrupted sutures around the connector/implant. Disinfect the wound with povidone-iodine.\nInject 5 mg/kg carprofene subcutaneously. Repeat this if necessary.\n\tNOTE: Any other analgesics may be used matching the requirements set by the local ethical permission board.\nSuspend anesthesia, release the earbars and nosepiece, and put the animal in a postoperative recovery cage to regain consciousness.\nEnsure that the animal is under close supervision during the first postoperative hours. Continue to monitor the implant area periodically.\n\tNOTE: The animal should not be left unattended until it has regained sufficient consciousness to maintain sternal recumbency. House the animal individually until full recovery from the procedure.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}