{
  "id": 7367,
  "origin_website": "Bio",
  "title": "Analysis of Leukemia Cell Metabolism through Stable Isotope Tracing in Mice",
  "procedures": [
    "A schematic representation of the entire procedure is provided in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4171/bioprotoc-11-19-4171-g001.jpgFigure 1. Schematic overview of the procedure.Metabolic tracer preparation and injectionPrepare the tracer by dissolving 13C5-glutamine or 15N2-glutamine powder in saline at a concentration of 54.3 mg/ml. Heat gently in a water bath at 37°C until dissolved. Per mouse, 200 µl of tracer solution is needed.Place the mouse in a cage under a heating lamp for 5 to 10 min prior to injection (or use an alternative to cause vasodilation, such as a heating pad or by soaking the tail in warm water). Ensure the animal does not overheat.Place the animal in the restraining device.Swab the tail with an alcohol preparatory pad.Aspirate 200 µl of the tracer solution into a 300 µl insulin syringe with 31 G needle.Slowly inject the tracer solution in the lateral tail vein.Start a timer set for 10 min.Cell isolation and preparationExactly 10 min after tracer injection, euthanize the mouse.Obtain peripheral blood by cardiac puncture using a 1 ml syringe with 25 G needle.Transfer blood to a K2-EDTA tube and place on ice.Isolate the femora and tibiae, clean them well to remove the muscle tissue, and place the bones in a pre-chilled mortar containing 5 ml of ice-cold flow buffer.Note: The mortar should be pre-chilled by placing it in an ice bucket for 15 min before euthanizing the mouse. Remove the mortar containing the bones from the ice bucket and crush the bones using a pestle by applying force in a vertical motion. Return the mortar to the ice bucket.Note: Avoid grinding the bones as this will create small debris that can interfere with cell sorting. Break up any visible cell clumps by pipetting the cell solution up and down several times using a 1 ml micropipette.",
    "Transfer the cell suspension to a 50 ml conical tube with 40 µm cell strainer, placed in an ice bucket.Add another 5 ml of flow buffer to the mortar containing the bone fragments, crush again using a pestle until the bone fragments are completely white.Break up any visible cell clumps by pipetting the cell solution up and down several times using a 1 ml micropipette.Transfer the cell suspension to the 50 ml conical tube with 40 µm cell strainer containing the cells from the first crush.Centrifuge the cell suspension in a refrigerated swinging bucket centrifuge for 5 min at 350 × g, 4°C.Decant or aspirate the supernatant.Resuspend the cell solution in 5 ml of ice-cold ACK lysing buffer (to remove red blood cells) and incubate on ice for 5 min.Add 20 ml of flow buffer.Centrifuge in a refrigerated swinging bucket centrifuge for 5 min at 350 × g, 4°C.Decant or aspirate the supernatant.Resuspend the cells in 2-3 ml flow buffer containing 7-AAD at a 1/200 dilution, and transfer the cell solution to a 5 ml flow tube with cell strainer cap.Note: In the original study (van Gastel et al., 2020), we only used GFP (marking the leukemia cells) and 7-AAD for cell sorting. It is possible to also stain the cells with fluorescently-labeled antibodies against cell surface markers. In that case, it is preferred to resuspend the cells first in a smaller volume (500 µl) containing the antibodies, incubate them on ice in the dark for 10 min, and then add 1.5-2.5 ml of flow buffer containing 7-AAD. If an appropriate antibody dilution is used, it is usually not necessary to remove unbound antibody. It is recommended to perform pilot experiments to ensure adequate staining is achieved with a 10-min staining time and no washing.",
    "Proceed immediately with cell sortingCell sortingEnsure the sample input and sample collector of the cell sorter are cooled to 4°C and that laser voltage set up and compensation are performed prior to starting the experiment. This can be done before the tracer injection in the mice or by a different person during sample preparation.Identify the target population (Figure 2), and sort at least 10,000 cells into a microcentrifuge tube containing 500 µl of ice-cold saline. Ideally, 50,000-200,000 cells are sorted. Limit sorting time to a maximum of 30 min. Be sure to write down the cell number obtained for each sample.Place cells on ice immediately after sorting is completed.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4171/bioprotoc-11-19-4171-g002.jpgFigure 2. Representative FACS experiment. Gating strategy for sorting viable AML cells (7-AAD-GFP+) from the bone marrow of mice. Top graphs show the gating strategy for viable cells; bottom graphs show gating of AML cells in a mouse with low (left), medium (middle), or high (right) leukemic burden. P1 gate, leukocytes; P2 gate, single cells; P3 gate, viable cells; P4 gate, AML cells that are sorted.Metabolite extraction from cellsCentrifuge cells in a refrigerated table-top microcentrifuge for 2 min at 500 × g, 4°C.Gently aspirate the supernatant, leaving <20 µl behind. To avoid aspirating the cell pellet, which may be nearly invisible if the number of sorted cells is low, place the aspirator tip at the side of the tube that was nearest to the center of the centrifuge (thus farthest from the cell pellet).Add 200 µl of cell lysis buffer, cooled to -20°C. Pipet up and down to mix well.Store the samples at -70°C to -80°C.Metabolite extraction from peripheral blood plasmaCentrifuge blood samples in a refrigerated table-top microcentrifuge for 5 min at 2,500 × g, 4°C.Transfer supernatant to a microcentrifuge tube.",
    "Transfer 5 µl of the plasma to a separate microcentrifuge tube (the rest of the plasma can be stored at -70°C to -80°C).Add 100 µl of cell lysis buffer, cooled to -20°C. Pipet up and down to mix well.Store the samples at -70°C to -80°C.Sample preparation for liquid chromatography-mass spectrometry (LC-MS)Prepare Mobile Phase Buffer A and Buffer B.Remove samples from -70°C to -80°C storage and dry down in a SpeedVac Vacuum Concentrator set to 4°C.Resuspend dried samples in 40 µl Mobile Phase Buffer A.Vortex at 4°C for 10 min.Centrifuge samples at 10,000 × g at 4°C for 10 min.Move supernatant into LC-MS vials and load into the autosampler.LC-MS analysisCreate a compound database on the Agilent MassHunter Acquisition software and include the compounds you wish to analyze, including information on the compound name, chemical formula, precursor ion mass, product ion mass, fragmentation energy, collision energy, and retention time. All this information can be found on the Agilent dMRM metabolomics database. For all new compounds, a standard must be run to optimize all of these parameters. When adding stable isotopes of metabolites to the list (such as 15N-UMP), use the same retention fragmentation energy, collision energy, and retention time as the light metabolite (14N-UMP).Set up the liquid chromatography method as follows: Set up a ZORBAX Extend-C18, 2.1 × 150  mm, 1.8  μm column, and equilibrate the column for 15 min with Buffer A at 0.25 ml/min. Begin each run with a flow rate of Buffer A at 0.25 ml/min for 2.5 min, followed by a linear gradient from 100% Buffer A to 80% Buffer A: 20% Buffer B for 5 min. Follow with linear gradients of 80% Buffer A: 20% Buffer B to 55% Buffer A: 45% Buffer B for 5.",
    "5 min; 55% Buffer A: 45% Buffer B to 1% Buffer A: 99% Buffer B for 7 min; and 1% Buffer A: 99% Buffer B for 4 min. After the run is done, a backwash of 100% acetonitrile should be used to clean the column for 10 min followed by 8 min of re-equilibration with 100% Buffer A.Ensure the instrument is cleaned and calibrated prior to use. Turn on the Agilent 6470 Triple Quadrupole mass spectrometer and let it warm up for at least 30 min prior to use. Set up the mass spectrometry method as follows: Agilent Jet Spray ionization; nebulizer, 45 psi; capillary voltage, 2,000 V; nozzle voltage, 500 V; sheath gas temperature, 325°C; and sheath gas flow, 12 L/min. Set the instrument to collect mass data for the duration of the first 24 min of the liquid chromatography method in which the metabolites are expected to elute.Write a sequence applying the above compound database, liquid chromatography, and mass spectrometry protocols to each sample that will be run. Include in the sequence a 15 µl injection from the autosampler into the LC-MS for each sample and a subsequent needle wash to ensure that there is no cross contamination between samples."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}