{
  "id": 15173,
  "origin_website": "Jove",
  "title": "Characterizing Histone Post-translational Modification Alterations in Yeast Neurodegenerative Proteinopathy Models",
  "procedures": [
    "1. Transforming S. cerevisiae with neurodegenerative proteinopathy-associated protein constructs\nGrow wild type (WT) 303 yeast in yeast extract peptone dextrose (YPD) broth overnight with shaking (200 rpm) at 30 °C.\nAfter 12−16 h of growth, dilute yeast to an optical density at 600 nm (OD600) of 0.25 with YPD. As 10 mL of yeast liquid culture will be needed for each transformation, prepare 50 mL of yeast liquid culture for five transformations corresponding to FUS, TDP-43, a-synuclein, and vector only (ccdB) constructs, as well as a negative control transformation without DNA.\nGrow yeast with agitation at 30 °C until an OD600 between 0.60 and 0.80 is reached. This generally takes 4−6 h.\nThirty minutes before yeast growth is complete, linearize plasmid constructs.\n\tNOTE: The plasmid constructs used here must be integrated directly into the genome, and hence linearization is required prior to transformation.\n\t\nCalculate the volume of plasmid stock that amounts to 1 µg. Subtract this volume from 44 µL to calculate the amount of nuclease free H2O needed.\nAdd nuclease free H2O, 5 µL of 10x restriction enzyme buffer (Table of Materials), 1 µL of NheI restriction enzyme (Table of Materials), and the appropriate amount of plasmid (calculated in step 1.4.1) to a microcentrifuge tube. Mix thoroughly by pipetting up and down and incubate at 37 °C for 15 min. The plasmid is now linearized and ready for transformation.\nAfter yeast culture reaches an OD600 of 0.6-0.8, harvest cells in a 50 mL conical tube and spin down at 850 x g at 4 °C for 3 min. Discard supernatant.\nWash cell pellet in 10 mL of sterile H2O and centrifuge at 850 x g at 4 °C for 3 min. Discard supernatant. Repeat 3x for a total of four washes.",
    "At the start of the third wash, thaw and boil 10 µL of salmon sperm DNA per transformation reaction for 5 min on a heating block.\nResuspend cell pellet in 100 µL of dH2O per transformation and split into appropriate number of microcentrifuge tubes. For five transformations, resuspend pellet into 500 µL of dH2O and split evenly into five separate microcentrifuge tubes.\nCentrifuge for 5 min at 850 x g at room temperature (RT) and remove all remaining water.\nAdd, in the following order, 50 µL of sterile H2O, 240 µL of 50% polyethylene glycol (PEG), 36 µL of 1 M LiAc, 10 µL of salmon sperm DNA, 20 µL of linearized plasmid DNA (or nuclease free water for no DNA control transformation). Mix thoroughly after each addition and vortex briefly after all transformation components have been added.\nIncubate transformation reactions at 42 °C for 20 min.\n\tNOTE: Carry out this incubation in a water bath for more consistent temperature control.\nCentrifuge at 470 x g at RT for 5 min. Discard supernatant and resuspend each cell pellet in 200 µL of sterile H2O.\nPlate yeast suspension on selective media plates and spread with rolling beads or spreader. Incubate plates for 2−3 days at 30 °C.\n\tNOTE: Synthetic-defined (SD)-His plates are used for the plasmids described here.\n2. Surveying colony growth suppression and storage in glycerol stocks\nInoculate single colonies from transformation plates in 5 mL of selective media supplemented with 2% raffinose. Grow on a shaker at 30 °C overnight. Select at least 12 colonies per transformation.\n\tNOTE: No colonies are expected in the “no DNA” transformation control plate.\nSterilize pin-frogger with ethanol, followed by flaming.",
    "For each culture, aliquot 100 µL of saturated cell suspension in the first row of a 96-well plate. Add 200 µL of sterile H2O in all wells of the adjacent well columns. For 1:5 serial dilutions, add 50 µL from the first column to the adjacent column behind with multichannel pipet. Mix thoroughly by pipetting. Then add 50 µL from the second column to the third column and mix by pipetting. Repeat this for the rest of the plate.\nPlate yeast by placing frogger in a 96-well plate and then stamping by gently and evenly pressing down on selective media plates with and without galactose. Incubate at 30 °C for 2−3 days.\n\tNOTE: SD-His and SGal-His plates are used for the plasmids described here.\nFor FUS, TDP-43, and a-synuclein transformations, identify the colony displaying the most growth suppression in the presence of galactose. Select this colony from the SD-His plate and inoculate into 10 mL of selective media supplemented with 2% raffinose for overnight growth. For the vector control, pick a colony displaying no growth suppression in the presence of galactose.\nTo prepare glycerol stocks, combine 0.5 mL of saturated liquid culture with 0.5 mL of 50% glycerol. Mix by pipetting up and down and freeze at -80 °C.\n\tNOTE: Glycerol stocks can be stored for up to a year at -80 °C.\n3. Overexpression of neurodegenerative proteinopathy associated proteins in S. cerevisiae\nFrom frozen glycerol stocks, re-streak yeast on histidine, 2% glucose agar selective media plates and incubate at 30 °C for 2−3 days.\nInoculate single colonies for each of overexpression models and control in 5 mL of histidine selective liquid media supplemented with 2% raffinose. Grow with shaking (200 rpm) at 30 °C overnight.",
    "Grow 100 mL of liquid culture for each of the overexpression models and controls (FUS, TDP-43, and vector control; a-synuclein and vector control).\n\t\nPrepare 100 mL of culture in selective media supplemented with 2% galactose.\nMeasure the OD600 of overnight cultures and calculate the amount of overnight culture needed to render overexpression cultures at a starting OD600 of 0.3. Typically, overnight cultures will reach an OD600 of 0.9−10, requiring about 5 mL of overnight culture to start 100 mL of fresh culture.\nInduce protein overexpression by growing yeast on galactose media (see step 3.3.1) for 5 h (FUS and TDP-43) or 8 h (a-synuclein) with shaking at 30 °C.\nMeasure OD600 of each culture at the end of the induction period. Standardize all cell counts to the lowest OD600 value. Harvest culture in 50 mL tubes by centrifuging at 850 x g for 5 min at 4 °C. Discard supernatant.\n\tNOTE: If the OD600 values measured at the end of induction are 0.654 and 0.984, respectively, for 100 mL of a-synuclein culture and 100 mL of control culture, harvest 95 mL of the a-synuclein culture and 67.1 mL of the control culture.\nResuspend pellet in 1 mL of sterile dH2O for every 10 mL of culture grown. Split pellet evenly by aliquoting 1 mL of cell resuspension into microcentrifuge tubes. For example, if starting with 100 mL of culture, resuspend pellet in 10 mL of sterile dH2O and divide it into 10 microcentrifuge tubes.\nCentrifuge at 850 x g for 5 min at 4 °C, then remove supernatant. Snap freeze cell pellets in liquid nitrogen and store at -80 °C.\n\tNOTE: Cell pellets can be stored at -80 °C for up to one year.\n4. Cell lysis and western blotting to detect histone post-translational modifications\nCell lysis",
    "Thaw yeast cell pellets on ice and resuspend cell pellets in 100 µL of dH2O.\nTo the cell resuspension, add 300 µL of 0.2 M NaOH and 20 µL of 2-mercaptoethanol. Resuspend by pipetting up and down.\nIncubate cells on ice for 10 min and then centrifuge at 3,200 x g on a tabletop centrifuge for 30 s at RT. Discard supernatant.\nResuspend cell pellet in 100 µL of 1x loading dye and boil for 10 min on a heating block.\n\t\tNOTE: The recipe for 6x loading dye can be found in the Table of Materials.\nSodium dodecyl sulfate polyacrylamide gel electrophoresis and membrane transfer\n\t\nPrepare gel chamber by placing two gels in a gel holder and filling inner chamber to the top with running buffer and filling the outside chamber to the two-gel line mark.\nLoad 15 µL of sample from step 4.1.4 per well into a 10-well 12% polyacrylamide gel. For the protein ladder lane, load 5 µL.\nRun gel for approximately 45 min at 150 V, or until loading dye front reaches the bottom of the gel.\nWhile the gel is running, prepare for membrane transfer by soaking fiber pads (two per gel) in transfer buffer (Table of Materials) and soaking polyvinylidene fluoride (PVDF) membrane in methanol. Rinse membrane in transfer buffer before transfer.\n\t\tNOTE: The PVDF membrane should be cut to the size of the gel and use one PVDF membrane for every gel being transferred.\nAssemble, on semi-dry transfer apparatus cell, a transfer ‘sandwich’: from bottom electrode, place (1) presoaked fiber pad, (2) presoaked and rinsed PVDF membrane, (3) gel from step 4.2.3, and (4) a second presoaked fiber pad.",
    "NOTE: Make sure to avoid air bubbles in the transfer ‘sandwich.’ Gently roll ‘sandwich’ with serological pipet to force out bubbles. Once the gel has been placed on top of the PDVF membrane, make sure not to move it.\nCarry out protein transfer by setting power pack to 150 mA for 1 h (for one ‘sandwich’).\nDetection of histone PTMs with modification specific antibodies\n\t\nRemove membrane from transfer apparatus. Rinse briefly with dH2O.\n\t\t\nOptionally, check transfer of proteins with Ponceau-S stain by pouring enough Ponceau-S stain to cover membrane in a small plastic box and incubating at RT with gentle shaking for 30−60 s. Remove Ponceau-S stain and rinse with dH2O until background stain disappears and protein bands are visible to the naked eye. Continue to rinse with dH2O until all stain is removed from membrane.\nBlock membrane by incubating blot for 1 h at RT with gentle rocking with tris buffered saline (TBS) blocking buffer (Table of Materials) in a small staining box. Use enough blocking buffer to cover blot.\n\t\tNOTE: Be careful to place membrane upright in the staining box so that the membrane side on which proteins lie is not facing down.\nIncubate blot in the staining box overnight with a histone modification-specific antibody reactive towards yeast at 4 °C. Dilute the antibody in TBS blocking buffer according to manufacturer specifications. Also include a proper nuclear loading control, such as anti-total H3 raised in a different host species from the modification-specific antibody. For instance, if probing for H3S10ph with an anti-H3S10ph antibody raised in rabbit, use an anti-total H3 antibody raised in mouse as a loading control. Repeat this for every blot as necessary.\n\t\tNOTE: Antibody dilutions can be reused for a total of three times within a month. Store them at 4 °C.",
    "Wash the membrane 4x in house-made TBS + 0.1% polysorbate 20 (TBST) for 5 min with rocking at RT.\nIncubate blot with fluorescent secondary antibodies at manufacturer-specified dilutions (donkey anti-rabbit 680 and donkey anti-mouse) for 1 h at RT.\n\t\tNOTE: Fluorescent secondary antibodies must be protected from light during both storage and usage. Carry out incubation in dark plastic boxes or cover with aluminum foil.\nWash membrane 4x with TBST for 5 min and wash with TBS for 5 min while rocking at RT.\nVisualize blot on a fluorescent Western blot imaging system for 2 min. Visualize the anti-rabbit 680 and anti-mouse 800 secondary antibodies in the 800 nm and 700 nm channels, respectively.\n\t\tNOTE: Replicates are independently conducted starting from section 1. It is necessary to verify that the antibody signal response is within the range over which the signal response is linear for appropriate data interpretation in these experiments.\n5. Data analysis and statistics\nOpen image of blot in an imaging software (Table of Materials). Acquire the raw density of modification-specific bands in the vector control, TDP-43, and FUS (or vector control and a-synuclein) samples, by drawing a rectangle that frames the band in analysis mode.\nRepeat step 5.1 for loading control bands.\n\tNOTE: There will be a loading control band and a modification-specific band in each sample.\nCalculate the relative density of the modification-specific bands by dividing each band by the density of corresponding band in the vector control sample. This normalizes the data to the vector control.\nCalculate the relative density of the loading control band by dividing each band by the density of corresponding loading control band in the vector control sample.",
    "Calculate the adjusted relative density of each band by dividing the relative density of the modification-specific band over the relative density of the loading control band for each sample. Now, the data can be visualized in histogram form.\n\tNOTE: For ease of processing, steps 5.3–5.5 can be done in a spreadsheet (Supplemental File).\nAfter multiple independent replicates, run Welch’s T-tests between the two control samples and the appropriate proteinopathy model (control versus FUS, control versus TDP-43, and control versus a-synuclein) with p = 0.05 as the cutoff for significance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}