{
  "id": 13595,
  "origin_website": "Jove",
  "title": "Isolating and Analyzing Cells of the Pancreas Mesenchyme by Flow Cytometry",
  "procedures": [
    "Experiments were conducted according to protocols approved by the Committee on Animal Research at Tel Aviv University.\n1. Isolation of Pancreatic Tissue from Mice\nFor adult mice:\nPrepare the digestion buffer: 0.4 mg/mL collagenase P and 0.1 ng/mL DNase I dissolved in Hanks' Balanced Salt Solution (HBSS). Freshly prepare 5 mL of buffer per mouse in 15-mL conical tubes and keep them on ice until use.\nEuthanize the mice according to institutional guideline.\nDissect each mouse to remove the pancreas (for instruction, please see Reference 18); place it in a culture dish containing HBSS. It is possible to perform this stage under a stereomicroscope, and to increase digestion efficiency, cut the tissue into 2 - 4 pieces.\nPlace the pancreatic tissue into a tube containing digestive buffer (prepared in step 1.1.1). Keep the tubes on ice until all mice are dissected and pancreatic tissues collected.\nRepeat steps 1.1.2 - 1.1.4 with the remaining mice.\nFor embryos and neonatal mice:\nPrepare the digestion buffer: 0.4 mg/mL collagenase P and 0.1 ng/mL DNase I dissolved in HBSS. For embryos and pups at postnatal day 7 (p7) or younger, freshly prepare 1.5 - 2 mL of buffer per mouse in a 15-mL conical tube. For p7 or older pups, prepare 3 - 4 mL of buffer per mouse in a 15-mL conical tube. Keep on ice until use.\nEuthanize the mice according to institutional guideline. For embryos, remove all embryos from their mother's uterus and place them in a 10-mm culture dish containing PBS. Dissect one embryo at a time.\nLay the mouse on its back, with its head pointing away from the investigator. Using fine forceps, pull up the abdominal skin and open at the midline to expose the abdominal cavity up to the mouse diaphragm18.",
    "Using fine forceps, detach the liver from the back abdominal wall. With a continuous motion toward the mouse tail, scoop out the internal organs (including the liver, stomach, spleen, intestines, kidney, and pancreas) and place them in a culture dish containing HBSS.\nUnder a stereomicroscope, remove the liver and kidneys to expose the pancreas (Figure 1). Using fine forceps, detach the pancreas from the stomach, duodenum, and finally, from the spleen.\nPlace the pancreatic tissue into a tube containing digestive buffer (prepared in step 1.2.1). For p14 or older pups, cut the tissue into 2 pieces to increase the digestion efficiency. Keep the tubes on ice until all mice are dissected and pancreatic tissues collected.\nRepeat steps 1.2.2 - 1.2.6 with the remaining mice.\n2. Pancreas Digestion\nIncubate the tubes containing the pancreatic tissue (in digestion buffer) in a heating block at 37 °C for 30 min with agitation at 700 rpm. After 15 min, manually shake the tubes by inverting them 3 - 4 times and place them back in the heating block.\n\tNOTE: If using a heating block without agitation capabilities, invert the tubes every 5 - 10 min. Make sure that the tissue is properly digested. If not, cut the tissue into smaller pieces before incubation or increase the agitation.\nTo stop the tissue digestion, place the tubes on ice and add 10 mL of cold HBSS to each tube. Centrifuge the tubes at 4 °C and 300 x g for 5 min and aspirate the supernatant.\nRe-suspension:",
    "For adult mice and p14 or older pups, re-suspend the pellet with 6 mL of PBS and strain it through a 70-µm cell strainer placed on top of a new 15-mL conical collection polypropylene tube. To ensure maximal cell recovery, wash the original tube with an additional 6 mL of PBS and strain it through the cell strainer onto the collection tube.\nFor embryos and pups younger than p14, re-suspend the pellet with 2 mL of PBS and strain it through a 35-µm cell strainer placed on top of a 5-mL round-bottom polystyrene collection tube (FACS tube). To ensure maximal cell recovery, wash the original tube with an additional 2 mL of PBS and strain it through the cell strainer onto the collection tube.\nCentrifuge the tubes at 4 °C and 300 x g for 5 min and aspirate the supernatant. Remove the liquid carefully, as cells are loosely attached to the polystyrene tube.\n3. Preparing Labeled Single Cells\nBuffer preparations: For cell isolation by FACS, prepare sorting buffer by mixing PBS (without calcium chloride and magnesium chloride), 5% fetal bovine serum (FBS), and 5 mM EDTA. For flow cytometry analysis, prepare analysis buffer by supplementing sorting buffer with 0.05% sodium azide. Both buffers may be stored at 4-8 °C for up to 2 months.\nRe-suspend cells in sorting or analysis buffer. Re-suspend each pancreas isolated from embryos and pups younger than p7 in 1 mL, from pups between p8 and one month old in 1.5 mL, and from mice older than one month in 3 mL. Strain the cells through a 35-µm cell strainer placed on top of a round-bottom polystyrene tube (FACS tube).",
    "For staining controls, take out 50- to 100-µL aliquots from the samples made in the previous step (not more than 5% of the total sample volume) and place them into new FACS tubes; include a tube for each fluorophore used, including DAPI and fluorescent proteins, as well as for an unstained control.\n\tNOTE: When using transgenic mice with cells expressing a fluorescent protein, or when cell number is limited, include a non-transgenic tissue as a staining control. If cells expressing a fluorescent protein are used without further staining, proceed to step 3.8.\nSpin-down the cells at 300 x g for 5 min at 4 °C and aspirate the supernatant.\nFor blocking, re-suspend the cells with blocking solution (100 µL sorting or analysis buffer supplemented with 1 µL of goat IgG) and incubate for 30 min on ice.\nTo stain cell surface markers, prepare a mixture that includes all desired fluorophore-conjugated antibodies in a volume of 100 µL per sample . Prepare 2x antibody dilutions in sorting or analysis buffer (i.e., dilute the antibody to obtain double the required concentration; if a final dilution of 1:200 is desired, dilute the antibody 1:100). Without washing the blocking solution, add 100 µL of the mixture to the sample cells to achieve a final staining volume of 200 µL. Incubate for 30-60 min on ice and in the dark.",
    "To set the analysis or sorting parameters (see steps 4.3 and 5.2), prepare additional tubes that contain only one of the antibodies used (staining control). Prepare 2x antibody dilutions in sorting or analysis buffer (as described in step 3.6). Make sure to include a single staining control dilution for each fluorophore used, as well as an unstained control. Without washing the blocking solution, add 100 µL of antibody mixes to the cells (prepared in step 3.3) to achieve a final staining volume of 200 µL. Incubate for 30 - 60 min on ice and in the dark.\nWash by filling each tube with analysis or sorting buffer to a maximal volume of 4 mL. Optionally, re-strain the cells through a 35-µm cell strainer (as described in step 3.2).\nCentrifuge at 300 x g for 5 min at 4 °C and remove the supernatant carefully.\nRe-suspend the samples in analysis or sorting buffer. Re-suspend the cells isolated from embryos in 500 µL, from pups younger than one month in 1 mL, from 1 - 3 months old in 2 mL, and from mice older than 3 months in 3 mL. Staining controls may be re-suspended in 300 µL of buffer.\nAdd 200 ng/mL of DAPI to re-suspended cells to identify the dead cells. Make sure to include a tube containing unstained cells without DAPI for cytometer settings. Proceed to cell sorting (step 4) or analysis (step 5).\n4. Cell Sorting\nPreparations:\nFor cell sorting prior to RNA extraction, coat a 1.5-mL collecting tube with RNase inhibitor immediately before sorting. To this end, add 1 mL of sorting buffer, containing 0.01 U/mL RNase inhibitor, to a sterile 1.5-mL collection tube. After 5 min, vortex the tube and remove the liquid.",
    "For cell sorting prior to cell culture, add 3 mL of sterile culturing media (Dulbecco's Modified Eagle Medium (DMEM) supplemented with 20% FBS, 1% L-glutamine, and 1% penicillin-streptomycin) into a sterile 15-mL collection tube.\nBefore loading a tube into a FACS sorter, vortex it briefly to re-suspend the cells. Keep the remaining tubes on ice.\nStart by analyzing the staining controls to determine the sorting parameters (e.g., voltage and compensation) and sorting gates (e.g., total cell population, live DAPI-negative cells, and cell populations to be sorted).\nOnce the sorting parameters and gates are set up, load the samples and initiate cell sorting into the collection tubes.\n\tNOTE: Sorting conditions are highly dependent on the instrument. We use a nozzle width of 100 µm, a pressure of 23.1 psi, and a maximal sorting speed of 5.\nProceed to RNA extraction or the culturing of sorted cells.\n\tNOTE: For RNA extraction, centrifuge the cells at 2,000 x g for 5 min and remove the excess liquid before continuing with a standard extraction protocol. For culturing cells, if the cells were sorted under non-sterile conditions, wash them twice by filling the tube with culturing medium and centrifuging it at 300 x g for 7 min before culturing in order to minimize their contamination.\n5. Cell Analysis by Flow Cytometry\nBefore loading each tube into the cytometer, vortex it briefly to re-suspend the cells. Keep the remaining tubes on ice.\nStart by analyzing the unstained and single-stained samples in order to determine the analysis parameters (e.g., voltage and compensation).\nOnce the analysis parameters are set up, load each sample, including the staining control, and record the results. Analyze the obtained results using flow cytometry analysis software."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}