{
  "id": 6705,
  "origin_website": "Bio",
  "title": "RNA Interactome Identification via RNA-BioID in Mouse Embryonic Fibroblasts",
  "procedures": [
    "A flowchart demonstrating the general outline of the experimental procedure is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191228/20191228232906_4499.jpgFigure 1. Flowchart of the RNA-BioID procedure Generating stable cell lines expressing an MCP-GFP-BirA* fusion proteinThe MCP-GFP-BirA* gene fusion under control of the UBC promoter was integrated into a third-generation lentiviral vector and is available in three different versions via Addgene (Addgene 131132/131133/131136). The three different versions can be used in similar ways.For transduction, use the MCP-GFP-BirA* plasmid Gag/Pol in combination with Env and VSV-G plasmids to assemble and generate the complete viral particles in Hek293FT cells.On the day before transfection, seed 4 x 106 Hek293FT cells in complete growth media in a 10 cm dish.On the day of transfection, set up two 1.5 ml centrifuge tubes, each containing 500 μl of OptiMEM media.To one tube, add the corresponding amounts of the following plasmids:table:\n﻿0,1\nMCP-GFP-BirA* backbone plasmid:,20 µg\npCEP4-tat,1 μg\npRSV-Rev,1 μg\npMDLg/pRRE,1 μg\npMD2.G (Insert name VSV-G),2 μg\nIn total,25 μg of plasmid DNA",
    "To the other OptiMEM-containing centrifuge tube, add 75 µl Fugene HD transfection reagent (3 μl per μg plasmid).Incubate both tubes separately for 5 min at room temperature.Add the OptiMEM media containing plasmid DNA to the tube containing the OptiMEM-Fugene HD mix, mix briefly by pipetting 2-3 times, and incubate for at least 25 min (up to 45 min) at room temperature. This results in the formation of the DNA-Fugene complex.Exchange the media of the 10 cm dish containing Hek293FT cells with fresh 10 ml of complete growth media.Add the DNA-Fugene complex on top of the cells in a dropwise manner. Swirl the dish gently to mix the Fugene-DNA mix with the medium and incubate the dishes at 37 °C for at least 16 h.Notes:For biosafety reasons, keep the dishes on a tray inside the incubator to avoid spilling of the media in the incubator due to handling errors. At this stage, the lentivirus is being produced, so strictly follow the biosafety class II regulations. After the 16 h incubation period, all dishes and pipettes that have and will come in contact with virus-containing solutions have to be treated with bleach prior to disposal. Always wear a lab coat and wipe the entire hood with ethanol. When you leave the working space treat your gloves with bleach as well. Before the end of the 16 h incubation, prepare 500 ml of 10% bleach and keep it in a large beaker in the tissue culture hood for treating surfaces (prepare fresh 19% bleach every day, it remains effective only for 24 h).Once the bleach solution is ready under the hood, carefully remove 8 ml of the media from the 10 cm dish and transfer it to a 50 ml conical tube. Keep it at 4 °C overnight.",
    "Add 8 ml of fresh complete growth media to the dish and return it to the incubator for another 24 h.At this time, seed wildtype (WT) MEFs and MBS MEFs (3 x 106/10 cm dish) and incubate at 37 °C in a cell culture incubator (5% CO2).Repeat Steps A11-A13 twice more during the consecutive days. Collect the media from each day and pool it in the same 50 ml conical tube from Step A12, keep at 4 °C. After collecting all supernatants, spin the conical tube for 10 min at 500 x g and 4 °C to pellet large debris.Filter the supernatant from this centrifugation through a 0.45 μm filter.Concentrate the lentiviral particles in the supernatant with a LentiX concentrator according to manufacturer’s instructions.After concentrating the viral particles, add 1 ml of serum-free media (Recipe 2) and carefully resuspend the pellet.Remove the dishes with WT MEFs and MBS-MEFs from the incubator for transduction, replace the old media with fresh complete medium (Recipe 1) and add 100 μl of the viral particle solution per 10 cm dish with 10 ml of media. Store the rest of the virus particles at -80 °C. Place the MEFs back into the cell culture incubator and leave for 24 h.Check the viral transduction efficiency under a fluorescence microscope (filter setting for GFP). If no GFP fluorescence is visible, repeat Step A19 with another aliquot of the stored viral particles.Fluorescent cells should stably express the MCP-GFP-BirA* fusion protein.On the last day of collection, bleach all the dishes that came in contact with the viral particles.",
    "Isolating cells expressing a functional MCP-GFP-BirA* fusion proteinAfter generation of stable cell lines (WT-BirA*: WT MEFs expressing MCP-GFP-BirA*; MBS-BirA*: MEFs with 24x MBS in the 3'-UTR of β-actin and expressing MCP-GFP-BirA*), sort positive, GFP-expressing cells by fluorescence-activated cell sorting against GFP, in FACS (fluorescence-activated cell sorting) tube containing 1 ml of complete growth media. This can be done by a core facility at your institution.After sorting, spin down the cells at 500 x g for 5 min at room temperature. Resuspend and, depending on the number of positive cells identified in cell sorting, culture them either on 10 cm dish or bigger dishes (10,000 cells/each 10 cm dish).When at least 10,000 cells have been isolated, test for the GFP expression levels in both transduced cell types (WT-BirA*/MBS-BirA*). For checking GFP expression, prepare cell lysates in the lysis buffer (Recipe 10). Add 3 packed cell volume (PCV) of lysis buffer and and pass 10-12 times through a 21 G needle. Centrifuge the lysate at 12,000 x g for 10 min at 4 °C to remove cell debris. Take out the soluble fraction and keep in a new 1.5 ml centrifuge tube at 4 °C. Use at least 10 µg of total protein for a Western blot against GFP and a housekeeping gene (e.g., GAPDH). Use untransfected WT MEFs as negative control and GAPDH as loading control. This step is important to check whether the full NLS-HA-2XMCP-eGFP-BirA* construct is expressing giving a band at 91.4 kDa (Figure 2A).To check for the activity of BirA* and biotinylation efficiency, use a 6-well dish. Seed duplicates of 3 x 104 cells of WT untransfected, WT-BirA* and MBS-BirA* and culture them in complete media for 24 h. On the next day, exchange the media.",
    "Use complete media containing 50 μM of biotin with only on one well of each duplicate. To the second set of duplicates just exchange the media with new complete media without biotin.Culture the cells with the new media (with or without biotin) for at least 6 h and up to 24 h. Biotinylation efficiency might not increase after 6 h, depending on the cell line.At the end of the incubation, wash the wells of the 6-well dishes two times with cold PBS and finally isolate the cells by adding trypsin.Isolate the cells by adding 500 μl/well of warm trypsin solution and incubate the dish at 37 °C for 2-3 min. After 2 min, check under a cell culture microscope (at 10x magnification) if all cells are completely detached. If not, leave the cells in the incubator but do not incubate longer than 5 min.Remove the solution with the cells and transfer them to a 15 ml conical tube. Add 6 ml of complete media containing FBS to deactivate the trypsin.Spin down the cells for 5 min at 500 x g at room temperature.Remove the media and add 1 ml of cold 1x PBS, resuspend the pellet with a 1 ml tip and pellet the cells again by centrifugation for 4 min at 500 x g at 4 °C.Repeat Step B10 to completely remove the media.Add 3 PCV lysis buffer containing 1x complete protease inhibitors to each pellet, resuspend cells and keep them on ice for 10 min. Lyse the cells by passing the pellet 10-15 times through a 21 G needle. After the lysis, spin the lysates for 10 min at 12,000 x g at 4 °C to remove the unbroken cells.Determine the protein concentration (e.g., by a Bradford assay following the manufacturer’s protocol).",
    "Mix 10 µg of total protein with SDS-PAGE loading buffer.Boil the mixture for 5 min at 95 °C and afterward spin down debris for 3 min at 12,000 x g at room temperature.Load the supernatant from step 15 on a Nu-PAGE SDS-PAGE gel in 1x MOPS running buffer and run at 200 V until the front dye exits the gel.Transfer the protein from the gel onto an activated PVDF membrane by semi-dry Western blotting (2.5 h at 250 mA).After the transfer is complete, wash the PVDF membrane in a small box with TBST (Recipe 9) twice for 5 min each at room temperature with rotation or tilting.In order to probe for biotinylated proteins, incubate with alkaline phosphatase-conjugated streptavidin.Incubate the membrane with AP substrate buffer (Recipe 7) for 5 min at room temperature.Remove AP substrate buffer. In a 15 ml conical tube, mix 5 ml of freshly made AP substrate buffer together with NBT (Recipe 6) (final concentration 50 μg/ml) and BCIP (Recipe 5) (final concentration 50 μg/ml). Pour the mixture on top of the membrane and protect it from light.Incubate the membrane on a shaker protected from light and check at 1 min intervals until you can see purple bands from the biotinylated proteins (Figure 2B).Once you tested the biotinylation is working properly, continue with large scale biotinylation experiment for purification of biotinylated proteins and mass spectrometry.RNA-BioIDTo capture and analyze biotinylated proteins in RNA-BioID, you need a confluent T175 flask of cells (2-3 x 107) for each round of mass spectrometry analysis.On the day before the streptavidin pulldown, confluency should have reached 80%. Exchange media of one T175 flask, containing WT-BirA* or MBS-BirA* cells biotin-containing medium and culture for 16-24 h.Wash the cells twice with PBS at room temperature to dispose of dead cells and serum-containing medium.",
    "Trypsinize for 2-3 min in the incubator. After checking cell detachment under a microscope, transfer cells into a conical tube and add 5 ml of serum-containing media to inactivate the trypsin.Collect cells by centrifugation for 5 min at 500 x g for at 4 °C.Wash cells twice with ice-cold PBS to completely remove the media.Add 3 PCV of lysis buffer (including CompleteTM protease inhibitor mix) to each pellet and resuspend.Lyse cells, collect lysate and determine protein concentration as mentioned above (Steps B12-B13).For the isolation of biotinylated proteins, use at least 1 mg of total protein per lysate and 300 μl of magnetic streptavidin beads per 1 mg of protein.To prepare the beads, mix the bead solution in the original vendor’s tube by quick vortexing, remove 200 μl of bead slurry to a fresh 1.5 ml tube and separate the beads from its storage buffer by capturing the beads on a magnetic stand for 5 min. Remove storage solution and wash the beads three times with 1 ml of lysis buffer. Rotate tubes with the bead slurry on an end-to-end rotator for 5 min.Collect the beads on a magnetic stand and discard the wash buffer. Add 1 mg of total cell lysate onto the beads, remove from magnetic stand and leave mixture overnight with end to end rotation at 4 °C.On the next day, collect the beads on a magnetic stand and wash twice with 1 ml of wash buffer 1 (Recipe 11), once with 1 ml of wash buffer 2 (Recipe 12), once with 1 ml of wash buffer 3 (Recipe 13) and once with 1 ml of wash buffer 4 (Recipe 14), each time by end-to-end rotation for 5 min at room temperature.",
    "During the final washing with 1 ml of wash buffer 4, take 100 μl into a new 1.5 ml centrifuge tube and collect the beads via a magnetic stand and store the beads on ice until Step C14 to check enrichment of proteins with silver staining. Collect the beads from the remaining 900 μl on a magnetic stand.Wash the beads 3 times with 50 mM of ammonium bicarbonate buffer each for 5 min at room temperature with rotation. Collect the beads and proceed immediately to Procedure D or store beads at -80 °C (safe stopping point).From the remaining beads from step C12, add 50 μl of 1x SDS sample buffer (Recipe 16), boil the mixture for 5 min at 95 °C and afterward spin for 1 min at 12,000 x g at room temperature.Keep the centrifuge tube on a magnetic stand for 2 min at room temperature and take out the supernatant to a new 1.5 ml centrifuge tube. Load 20 μl of the supernatant on a Nu-PAGE SDS-PAGE gel in 1x MOPS running buffer and run at 200 V until the front dye exits the gel.Perform silver staining (Aboulaich, 2011) on this gel to compare proteins from WT-BirA* (shows proteins which are background biotinylated like mitochondria carboxylases and proteins which are unspecifically bound to the beads) and MBS-BirA* cells after treatment with biotin (Figure 2C).On-bead tryptic digestionAdd an appropriate volume of denaturation buffer (Recipe 17) to the beads (usually 30-80 μl), such that they are well covered and can float in the suspension during incubation.Add reduction buffer (Recipe 18) to a final concentration of 1 mM, incubate for 1 h at room temperature in a Thermomixer at 1,000 rpm.Add alkylation buffer (Recipe 19) to a final concentration of 5.",
    "5 mM, incubate for 1 h at room temperature in a Thermomixer at 1,000 rpm.Add 1 μg LysC for predigestion and check pH on a pH 6-10 pH strip. The pH needs to be around pH 8, otherwise, adjust with 1 M Tris-base pH 8. Incubate for 3 h at room temperature in the Thermomixer at 1,000 rpm.Add 4 volumes of 20 mM ammonium bicarbonate buffer to dilute the urea in the buffer.Add 1 μg trypsin for digestion and check pH on a pH 6-10 pH strip (pH should be 8), incubate overnight at room temperature in a Thermomixer at 1,000 rpm.Separate beads and supernatant by using a magnetic stand and transfer the supernatant to a new tube.Acidify samples with TFA to pH ≤ 2.Peptide clean-upLoad sample onto a PHOENIX Peptide Clean-up Kit device.Perform clean-up procedure by following the kit protocol (washing and elution steps).After elution, reduce the sample volume to ≤ 9 μl in a vacuum concentrator (30-40 min at 30 °C).Add 1 μl solvent A* (Recipe 20) and adjust the sample volume to 10 μl with solvent A (Recipe 21).Mass spectrometry analysisF.Mass spectrometry analysisPeptide samples are analyzed using online nanoflow liquid chromatography tandem mass spectrometry (LC-MS/MS). Note that this is a routine analysis in proteomics that can be done on any high-performance liquid chromatography system coupled to a state-of-the-art high-resolution mass spectrometer.Here, nanoLC-MS/MS analyses are done on an EASY-nLC 1200 system connected to an LTQ-Orbitrap Elite through an electrospray Ionization source.Pack a 25 cm long 75 μm-inner diameter analytical column with reversed-phase C18-AQ Reprosil-Pur 1.9 μm particles at a constant pressure of 600 bar, and cut the column to a final length of 20 cm.Load peptides directly onto the column at a flow rate of 500 nl/min.",
    "Reduce flow rate to 200 nl/min after loading, and separate peptides with a segmented linear gradient of HPLC solvent B (Recipe 23) (5-33-50-90%) for 87 min.Operate the mass spectrometer in the positive ion mode, with the following acquisition cycle: a full scan is measured using the Orbitrap cell at a resolution R 120,000 followed by MS/MS of the top 15 most intense peptide ions in the linear ion trap using collision-induced dissociation (CID). Acquire precursor ions in the mass range from m/z 300 to 2,000 and use the target values 1E6 charges for the full scans (Orbitrap analyzer), and 5E3 charges for the collision-induced dissociation (CID) in the Linear Ion Trap. Sequenced precursor masses need to be excluded from further selection for 60 s.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20191228/20191228232929_9699.jpgFigure 2. Functional validation of the integrated BirA* fusion construct. A. Expression check of full-length BirA* construct via Western blot. The full-length fusion protein from the nls-HA-2x mcp-egfp-BirA* transgene, in total 91.4 KDa, is detectable by Western blot against the GFP part only in MBS MEF cells. GAPDH can be used as a negative control protein since it can be detected in lysates from WT and MBS-BirA* MEFs. B. Testing for BirA* activity in MEFs using AP coupled streptavidin. After incubation of MEFs with 50 μM biotin for 24 h, cells were lysed and 10 μg of total cell lysates from WT and MBS-BirA* MEF cells were loaded per lane. Biotinylated proteins were detected in a colorimetric assay by Western blot using AP-streptavidin. C. A pattern of biotinylated proteins in RNA-BioID obtained after purification via streptavidin-coupled magnetic beads. 1/10th of the amount of magnetic beads that are normally used for mass spectrometry analysis were boiled in 100 μl of SDS sample buffer.",
    "Twenty microliter of these were loaded on a 10% SDS-PAGE, separated and detected by silver staining. The number and intensity of protein bands from the lysate of MBS-BirA* MEFs are much larger than that from WT-MEFs, indicating successful RNA-dependent biotinylation and capturing of associated proteins."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}