{
  "id": 19025,
  "origin_website": "Jove",
  "title": "Time-lapse Imaging of Primary Preneoplastic Mammary Epithelial Cells Derived from Genetically Engineered Mouse Models of Breast Cancer",
  "procedures": [
    "1. Overall Scheme\nGenerate primary cultures of preneoplastic mammary epithelial cells from mammary glands of genetically engineered and control wild-type mice.\nCapture live-cell images every 15 min using Volocity image acquisition software (version 5.3.1, PerkinElmer, Waltham, MA) for up to 5 days.\nView time-lapse images directly to assess timing and mechanism of epithelial cell colony formation, incidence of apoptosis, and phasing of morphological changes.\nConvert Volocity generated .TIFF stacks to .JPG files using MetaMorph Microscopy Automation & Image Analysis Software (Molecular Devices, LLC Sunnyvale, CA) and rename digital image files (THE Rename 2.1.6, http://www.softpedia.com/get/System/File-Management/THE-Rename.shtml[href=http://www.softpedia.com/get/System/File-Management/THE-Rename.shtml]) to enable compatibility with Timm's Tracking Tool software (TTT, http://www.helmholtz-muenchen.de/en/isf/hematopoiesis/software-download/index.html[href=http://www.helmholtz-muenchen.de/en/isf/hematopoiesis/software-download/index.html]).\nUsing TTT, generate cell fate maps for determination of the time between cell divisions (cell lifetimes) and patterns of cell division (symmetric versus asymmetric).\nAnalyze quantitative data from steps 3 and 5 above to determine if there are statistically significant differences between different genetically engineered mouse models and/or wild-type controls.\n2. Generation of Primary Mammary Epithelial Cell Cultures\nPrepare Complete Media for isolation of single mammary epithelial cells following a variation of manufacturer's instructions (EpiCult-B Mouse Medium Kit, Stemcell Technologies, Vancouver, BC). Combine 450 ml Epi-Cult-B medium, 50 ml Epi-Cult B proliferation supplement, 5% Fetal Bovine Serum (FBS), 50 μg/ml Penicillin/Streptomycin (PenStrep) and 10 ng/ml Epidermal Growth Factor (EGF).\nPrepare Dissociation Media by combining 1 part of a 10x Collagenase/Hyaluronidase mixture with 9 parts Complete Media from 2.1.",
    "Euthanize mouse and immediately proceed to necropsy. Place mouse on its back on a styrofoam necropsy platform and secure all four limbs so ventral skin is taut. Saturate ventral skin and hair, including that overlying the limbs, with 70% ethanol. Expose #2/3 (thoracic) and #4/5 (inguinal) mammary glands by making a midline incision through the skin (do not enter the peritoneum) that is extended into a Y-incision through the medial skin of each front limb and an upside down Y incision through the medial skin of each rear limb.\nUsing blunt dissection, separate the skin from underlyingperitoneum, pull back on both sides of the skin until it is taut, and secure it to the styrofoam necropsy platform using pins. Starting from the outer side, use blunt dissection with judicious use of dissection scissors to isolate the intact inguinal and/or thoracic mammary glands from underlying connective tissue and muscle. Place no more than two mammary glands in a 10 cm sterile Petri dish and move to tissue culture hood.\nIn tissue culture hood, examine glands for mammary lymph nodes that are identified as small, well-circumscribed nodules with a yellowish color. Remove lymph nodes from the surrounding gland using sterile scalpel and forceps. Mince mammary tissue into ~1 mm3 cubes using two sterile scalpels, one in each hand.\nPlace minced mammary tissue in 5 ml Dissociation Media, mix by gently pipetting up and down 2-3 times using a 10 ml pipette, and incubate overnight (up to ~16 hr) in a 37 °C incubator with 5% CO2 in a 50 ml conical tube with loosened cap.",
    "The next morning, prepare a cold mixture of 1 part Hanks' Balanced Salt Solution (HBSS) containing 2% FBS and 4 parts buffered Ammonium Chloride Solution to promote red blood cell lysis (HFAmCl) as well as cold HBSS supplemented with 2% FBS (HF). Pre-warm Trypsin-EDTA (0.25%), 5 mg/ml Dispase in Hank's Balanced Salt Solution Modified, 1 mg/ml DNase I, and Complete Media.\nRemove the conical centrifuge tube with the mammary tissue from the incubator and gently pulse vortex 2-3 sec two times. Centrifuge the tube at 450 × g for 5 min (room temperature or 4 °C), and discard the supernatant.\nResuspend the pellet in a minimum of 10 ml HFAmCl and centrifuge at 450 × g for 5 min (room temperature or 4 °C) and discard supernatant.\nAdd 3 ml Trypsin-EDTA to the pellet and mix first with a 5 ml pipette and then with a P1000 micropipettor until stringy (1-3 min). Add 10 ml HF, centrifuge at 450 × g for 5 min (room temperature or 4 °C) and discard supernatant.\nAdd 2 ml of 5 mg/ml Dispase and 200 μl of 1 mg/ml DNase I to the pellet and mix with a P1000 micropipettor for 1 min. Sample should be cloudy but not stringy. If stringy, add 100 μl of DNase I and mix again.\nAdd 10 ml cold HF, strain through a 40 μm cell strainer and centrifuge at 450 × g for 5 min (room temperature or 4 °C) and discard supernatant.\nResuspend the final pellet in Complete Media. Quantify the total number of cells (using a hemocytometer or Coulter Counter). Two mammary glands yield approximately 1 x 106 to 1 x 107 cells. Plate primary epithelial cells in a flat-bottomed 6-well plate at a density of 1.5 x 105 cells per well.\n3. Live-cell Imaging",
    "Immediately after plating the cells, place the 6-well plate securely on a microscope stage within a 5% CO2/saturated humidity/37 °C temperature incubation chamber. Adjust the condenser for Kohler illumination and center the phase rings. For the experiments presented here, an inverted Nikon Eclipse TE300/PerkinElmer Spinning Disc Confocal microscope system in widefield phase contrast mode with a 10x objective lens was used.\nOpen image acquisition software, create and name a library for the time-lapse images, and save to a location with sufficient space for large files. The experiments presented here utilized Volocity image acquisition software (version 5.3.1, PerkinElmer, Waltham, MA).\nAllow the plate to equilibrate in the microscope incubator for a minimum of 15 min. Lower the lenses to avoid stage-lens interference. Under the \"Stage\" heading, select \"Calibrate Stage.\" Reacquire the focal plane, set Z=zero under the x, y, z tab and mark imaging points by selecting \"Add point\" under the \"Stage\" heading. Place points in the middle of each well of the 6-well plate for imaging as phase contrast imaging may be distorted near the periphery of plastic wells. Arrange points in a square in 4 x 4 fields (650 μm x 700 μm fields), each with a small overlap (about 5%). Save the selected points under \"Stage.\"\nUnder \"Stage\" select \"Make focus map\" and follow the prompts to set the focus of each point. Set image acquisition timing to capture 4 pictures per hour (every 15 min). This can be adjusted depending on the requirements of the specific experiment. Save the focus map under \"Stage\".\nRight click on the right side tool bar \"Image Acquisition\" and save the imaging settings. Press the record button to begin the imaging. After 1 hr, check the focus of the images to see if any adjustment is needed.",
    "Monitor and continue live imaging for 5 days, ending when cells become confluent.\n4. Direct Viewing of Time-lapse Images to Assess Timing and Mechanism of Initial Epithelial Cell Colony Formation, Incidence of Apoptosis, and Phasing of Morphological Changes\nDirect viewing of time-lapse images can be performing using any compatible video viewing software (e.g. http://www.real.com/[href=http://www.real.com/]realplayer or other freeware or commercially available software). Images can be viewed in .TIFF format at this step or after conversion to .JPG files (see Step 5).\nTo determine mechanism of initial colony formation, start with a single-image stack representing one imaging site on the plate. In initial frames, cells will be floating. Follow serial images to determine when the first epithelial cell adheres to the plate. At this step, epithelial cells can be identified and differentiated from fibroblasts by their more cuboidal morphology. Follow this single epithelial cell through serial images and follow its fate over the subsequent 24 hr. Record if it becomes surrounded by additional epithelial cells or undergoes cell division or apoptosis. If surrounded by epithelial cells, the mechanism of colony formation can be determined directly by viewing if the surrounding cells are derived from floating cells that then aggregate with the initial adherent cell(s) or from division of the initial adherent cell. Record the number of colonies formed by cell aggregation versus cell division during the first 24 hr.\nTo determine the number of initially adherent cells that undergo apoptosis over a specific time period, follow serial images for the appearance of classic features of apoptosis developing in a cell that has been adherent (http://www.alsa.org/research/about-als-research/cell-death-and-apoptosis.html[href=http://www.alsa.org/research/about-als-research/cell-death-and-apoptosis.html]), and the number of apoptotic cells identified during the entire duration of the imaging or within specific time frames recorded.",
    "Over time, epithelial cells in culture alter their morphology from an initial cuboidal shape to a more elongated appearance consistent with EMT. Follow serial images to determine the day/hour after plating when this occurs.\n5. Image File Modification\nThrough the Volocity software, export the image files to TIFF stacks. Here MetaMorph Microscopy Automation & Image Analysis Software (Molecular Devices, LLC Sunnyvale, CA) was used to open the TIFF stack files and they were then saved in MetaMorph as single .JPG images.\nRename the image folders and files according to the requirements for Timm's Tracking Tool software (http://www.helmholtz-muenchen.de/fileadmin/ISF/PDF/Haematopoese/publications/TTT_Operating_Instructions_July_2009_.pdf[href=http://www.helmholtz-muenchen.de/fileadmin/ISF/PDF/Haematopoese/publications/TTT_Operating_Instructions_July_2009_.pdf]). Use a freeware program like THE Rename 2.1.6 (http://www.softpedia.com/get/System/File-Management/THE-Rename.shtml[href=http://www.softpedia.com/get/System/File-Management/THE-Rename.shtml]) to rename files in groups. Create one folder containing all folders and files of the experiment and name the folder (e.g. EXPERIMENTNAME).\nCreate a subfolder for each point/position where the culture was imaged. Name the subfolders: EXPERIMENTNAME_pPOSITIONNUMBER. The position number should have 3 digits. Example: 072511RN_p001. Put all the image files of that individual position in the subfolder.\nAdd the timepoint (using 5 digits) and channel number (since there is only one bright field channel, use \"0\") at the end of each file name in this format:\n\tEXPERIMENTNAME_pPOSITIONNUMBER_tTIMEPOINT_wCHANNELNUMBER.jpgExample: 072511RN_p001_t00001_w0.jpg\nGenerate a log file for each position by first downloading the free program TTTlogfileconverter from the TTT website. Start the TTTlogfileconverter program and select the experiment folder. Input an image interval (in seconds). For a picture taken every 15 min, enter 900 sec. Then press the green covert log files button.\n6. Generation of Cell Fate Maps of Single Cells Using TTT\nCreate a folder called TTTexport and a subfolder called TTTfiles where all cell tracking data will be stored following TTT software instructions (http://www.helmholtz-muenchen.de/fileadmin/ISF/PDF/Haematopoese/publications/TTT_Operating_Instructions_July_2009_.pdf[href=http://www.helmholtz-muenchen.de/fileadmin/ISF/PDF/Haematopoese/publications/TTT_Operating_Instructions_July_2009_.pdf]).\nStart the TTT program, select user initials, and click \"Continue.\"",
    "Press the \"Set NAS,\" select the user created \"TTTexport\" folder, and click Ok. In the browser, select an experiment folder, select a position folder, and then press \"Load position\" button.\nSet ocular factor to \"10x.\" Load the number of images required (loading all images is recommended for first time).\nIn cell editor window, select \"New colony\" under the File menu. In the Movie window, press the \"Track cell\" or F2 to begin tracking a cell.\nIdentify a cell in the Movie window and use mouse to place cursor over the cell. A circle with the number of the cell should appear after F2 has been clicked. Use the \"0\" key on the number pad of the keyboard to track the placement of the cell and advance to the next picture. Move the cursor to follow the placement of each cell through each frame. To delete a track and return to the previous image press \"Del\" on the number pad. To move forward frames without tracking the cell press \"3,\" and to move backward without tracking press \"1\" on the number pad.\nTo mark a cell division click the \"Division\" button in the Movie window. To mark cell death click the \"Cell death\" button in the Movie window. Once a division has occurred, the daughter cells can be tracked in the same cell fate map by right clicking on the circle symbol of the designated daughter cell in the Cell editor window to start tracking mode automatically.\nPress F10 to save the tree. Each tree will save in the designated output folder (TTTExport). To start a new cell fate map, select \"New colony\" under the \"File\" then \"Open\" menu in the Cell editor window.\nTabulate cell lifetime data after gathering from \"Cell data\" tab in the Cell editor window.",
    "7. Statistical Analyses\nUse either Student's t-test (if comparing two genotypes) or ANOVA (if comparing > two genotypes) to determine if differences in parametric data such as numbers of initial cell colonies, cell lifetimes or hours until the appearance of EMT between different genotypes are statistically significant. Apoptotic frequency can be compared as the number/total number plated cells using Student's t-test or ANOVA or with Mann-Whitney or Kruskal-Wallis when derived as a percentage of adherent cells.\nPerform power tests using data from analyses of initial experiments to determine how many experimental replicates need to performed and cell fate maps generated from each replicate for adequate statistical power using available freeware (e.g. http://statpages.org/[href=http://statpages.org/]). In the experiments presented here, cell cultures derived from three mice per genotype were sufficient to determine if there were statistically significant differences in cell colony formation and cell lifetimes when specific genetic modifications were made.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}