{
  "id": 8371,
  "origin_website": "Jove",
  "title": "Primary Microglia Isolation from Postnatal Mouse Brains",
  "procedures": [
    "All the animal procedures were approved by the committee on Animal Research and the Institutional administration panel of laboratory animal care at Shanghai Jiao Tong University. Every effort has been made to minimize animal suffering.\n1. Preparation of culture buffer, flasks, and coverslips\nCulture medium and microglia culture medium: Supplement DMEM with 10% FBS to make the culture medium. The microglia culture medium is made by adding 10% FBS and 20% LADMAC conditioned medium to the DMEM. Add 1% Penicillin/Streptomycin to both the medium.\n\t\nTo prepare 20% LADMAC conditioned medium, collect the culture medium from the LADMAC cells, centrifuge at 200 x g for 10 min, filter using 0.22 µm cell strainer, and then store the aliquots at -80 °C.\nDigestion buffer: Prepare digestion buffer by adding 8 U/mL papain and 125 U/mL DNase to DMEM.\n\tNOTE: For best results, the digestion buffer should be prepared freshly. Calculate the desired amount based on the number of pups (1 mL solution for every 2 pups).\nCoating flasks: Use T25 or T75 flasks for pre-plating the isolated brain cells. Before the brain dissection, coat T25 flasks with 2 mL (or 4 mL for a T75 flask) of 0.1 mg/mL Poly-D-lysine (PDL) and incubate at 37 °C for at least 1 h. Aspirate the PDL solution, wash twice with 1x PBS, and then allow the flask to air-dry in the cell culture hood.",
    "NOTE: The size and number of flasks used in the experiment were dependent on the number of postnatal pups. To let the cells reach the confluent astrocyte cell layer in a short time, prepare one T25 flask for 3-5 brains, or one T75 flask for 5 brains. Unused coated flasks can be stored at 4 °C for up to a month. To save time, 10x (1 mg/mL) stock solution of PDL can be prepared before the start of the experiment and stored at -20 °C as single-use aliquots. Dilute the aliquots in sterile 1x PBS right before use.\nPrepare coverslips: Wash commercial glass coverslips with 0.1 M HCl for 1 h, rinse twice with autoclave water, then store in 100% ethanol. Before use, flame the coverslips using fine forceps with a burner lamp to remove residual ethanol. 8 mm glass coverslips can be placed in a 48-well plate, and 12 mm glass coverslips can be placed in a 24-well plate.\nPrepare dissection tools: Soak fine scissors, forceps, and stainless steel micro-spoons in 75% ethanol for at least 20 min. Then place these tools under ultraviolet radiation in the tissue culture hood for 30 min.\n2. Dissection of mouse brain\nNOTE: To evaluate the efficacy of the protocol, here we used CX3CR1GFP knock-in mice for tracing microglia9. CX3CR1GFP/GFP mice and wild type C57BL/6J females at 2- to 8-month were crossed to generate CX3CR1+/GFP mice, both were originally obtained from commercial sources. Mice were housed under a 12-12 h light-dark cycle in a specific pathogen-free (SPF) environment at Shanghai Jiao Tong University. Pups from postnatal day 1 to day 4 can be used for this protocol.",
    "Decapitate all pups with surgical scissors. To minimize contamination, rinse all heads with 75% ethanol and quickly put in the ice-cold 1x PBS. Meanwhile, warm the digestion buffer and co-culture medium in a 37 °C water bath.\n\tNOTE: Decapitate and isolate brain tissue from one pup at a time to preserve structural integrity. To prevent contamination, all surgical tools should be placed in 75% ethanol between decapitation.\nUse fine dissecting scissors to cut the skull along with the medulla oblongata. Place a stainless steel micro-spoon beneath the brain tissue from the cutting site to squeeze out the brain from the head cavity. Transfer it to a new chilled 6-well plate containing 2 mL of pre-cold 1x PBS per well.\nCut off and discard the cerebellum and olfactory bulbs. Gently transfer the remaining brain tissue to a chilled 6-well plate containing 2 mL of pre-cold 1x PBS.\n\tNOTE: Place 4-5 brain tissues in one well.\nRepeat the same procedure for the remaining heads until all tissue is collected.\n3. Seed the mixed primary cells\nAspirate 1.5 mL of 1x PBS in the 6-well plate, and fully mince the brain tissue into small pieces (approximate 1 mm2) with the help of spring scissors.\n\tNOTE: To reduce the amount of fine debris, do not over mince the tissue.\nAdd the desired amount of digestion buffer to the well (0.5 mL of digestion buffer per brain), then place the plate in the 5% CO2, 37 °C humidified incubator for 20 min. Swirl the plate every 10 min.\n\tNOTE: During the incubation time, wet a 70 µm cell strainer with culture medium (10% FBS in DMEM), and then place the cell strainer onto a fresh 50 mL collection tube.",
    "Take the plate out of the incubator and terminate papain digestion by adding 3 mL of culture medium to each well. Mildly pipette the cells up and down 10 times using a 1 mL pipette. Transfer the mixture to a 15 mL tube, and let it settle for 1 min. A cloudy cell pellet can be seen at the bottom. To remove big clumps and cell debris, carefully pass the cell suspension through a 70 µm cell strainer and collect the flow-through in the 50 mL collection tube.\nAdd 3 mL of warmed culture medium (10% FBS in DMEM) to the undissociated cell pellet in the 15 mL tube. Triturate 10 times as in steps 3.3 to continue the dissociation. Let the tissue settle for 1 min and then pass the cell suspension through the strainer to the 50 mL collection tube. Repeat this step, and discard the remaining cell debris.\nTransfer the cell suspension from the 50 mL collection tube to 15 mL tubes and centrifuge the cells at 200 x g for 10 min at room temperature.\nAspirate the supernatant, and resuspend the cells in 5 mL of culture medium. Seed the primary cells in a T25 or T75 flask at a cell density of about 5 x 106 and culture in the humidified incubator (5% CO2, 37 °C). This is Day 0 in this culture schedule.\n\t​NOTE: If cells are seeded in a T25 flask, a final volume of 5 mL medium per flask is sufficient. Add an extra 5 mL of culture medium to each flask when seeded in a T75 flask.\n4. Collection of primary microglia",
    "Evaluate the confluency of the mixed cells on the next day (Day 1). Since the mixed cells were seeded at a pretty high density, it takes 3-4 days for the astrocytes to reach confluency, allowing the microglia to be collected 1-2 days later.\n\tNOTE: Be cautious if cells are not attached to the bottom of the flask on the next day; it might be due to cell contamination or cell death caused by over digestion or harsh handling.\nOn Day 2, wash the flasks with 3 mL of warm 1x PBS twice and change the medium by adding 3-5 mL of fresh culture medium to each T25 flask (7-10 mL for a T75 flask). The discarded culture medium contains cell debris and various types of cells, including neurons, oligodendrocytes and microglia.\nOn Day 4, ensure that astrocytes attached to the bottom of the flask are at 100% confluency. Meanwhile, a subpopulation of microglia is loosely attached to the mixed cell surface layer which can easily detach from the surface and float in the culture medium by handshaking. Transfer the culture medium to a fresh 6-well plate, and primary microglia enriched in the medium are collected during this process. Next, provide the cells on the original 6-well plate with fresh culture medium for further cell collection.\n\tNOTE: Tapping the flasks on the table or shaking the flasks on a laboratory shaker at 180 rpm for 30 min before medium transferring is appropriate to yield more cells.",
    "Carefully place the 6-well to the incubator to allow cell attachment. About 2 h after incubation, all the cells will be attached to the plate. When the cells are attached, gently wash them with warm 1x PBS twice to remove cell aggregates and cell debris; then, supply the cells with 3 mL of fresh microglia culture medium. The isolated microglia cells can be maintained for more than a month in vitro by refreshing the microglia culture medium every 2 days.\n\tNOTE: Colony-stimulating factor 1 (CSF1) is an important growth factor to support microglia survival in vitro. Previous studies report that CSF1 can be secreted from the LADMAC cell line, which is a transformed cell line originated from mouse bone marrow cells. The LADMAC conditioned medium can be collected by centrifuging the LADMAC culture at 200 x g for 10 min; then, pass the supernatant through a 0.22 µm cell strainer. Microglia culture medium was prepared by adding 20% LADMAC conditioned medium to the culture medium (10% FBS, DMEM).\nEvery 2-3 days, continue to collect the microglia from the mixed cell culture medium as in step 4.4. Culture the remaining mixed cells in the flask and use them for consistently harvesting microglia every 2-3 days for up to 1 month.\n\tNOTE: Microglia can be successfully harvested by collecting the medium form mixed culture cells for up to 50 days. Each time, the collected co-culture medium will yield about ~1-3 x 105 microglia cells per T75 flask. Combine microglial cells, if needed.\nUse primary microglial cells for the desired functional assay.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}