{
  "id": 1781,
  "origin_website": "Cell",
  "title": "Purification of astrocyte subtype based on a double reporter mice approach for downstream transcription profiling",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDissection of the P7 spinal cord\nTiming: 1 h depending on expertise and the number of pups to be dissected (∼15 min/pup)\nIsolate the animal’s head by decapitation using scissors at the base of the skull.\nAfter drenching the fur with 70 % ethanol, a small incision is made in the dorsal skin to remove the pelt from the head to the hind limbs.\nInsert small scissors through the abdominal wall muscles and cut laterally to the spinal column in both directions.\nThen with the scissors cut the ribs on both sides of the spinal column before removing the viscera connected on its anterior side.\nThe spinal column is then removed by making a transverse cut at the level of the femurs.\nOnce clear of soft tissues, cut the column at the level of the last rib which is a landmark of the last thoracic segment. Keep the cervical and thoracic spinal column for further isolation and remove the lumbar part.\nNote: Until step 6, the dissection is performed at room temperature. Once the spinal cord is removed from the body, all the following dissection steps are performed on ice.\nPlace the cervico-thoracic column in a petri dish containing cold PBS, and under a dissecting microscope (Nikon SMZ800) start cutting the column from one end and peel off the vertebrae with a forceps little by little, revealing the spinal cord.\nRemove dorsal root ganglion and meninges from the spinal cord explants.\nNote: It is very important to carefully remove the meninges which can be identified as a translucent sheet of tissue covering the spinal cord. If the meninges are not fully removed it can interfere with the following dissociation and result in a poor number of cells purified.",
    "Check the fluorescence on the spinal cord explants to confirm genotyping using a Nikon AZ100 multizoom microscope\nDissociate dissected P7 spinal cord tissue\nTiming: 1.5 h\nThese steps describe the enzymatic treatment and physical homogenization procedures to dissociate dissected tissue pieces into single-cell solution ready for FACS isolation of targeted cells.\nSlice the spinal cord into 100 μm sections using a tissue-chopper (Mc Ilwain).\nPlace each diced spinal cord in a 35 mm tissue culture dish.\nAdd 250 μL of the DNase solution in the falcon tube containing the papain solution.\nAdd 1 mL of the papain/DNase solution per petri dish containing one chopped spinal cord.\nIncubate for 60 min at 37°C in a 95%O2:5%CO2 incubator.\nCritical: Monitor dissociation and adjust the timing accordingly. Prolonged enzymatic digestion can affect cell viability.\nNote: In our context, the perinatal spinal cord, we adapted the method used to purify astrocytes from adult spinal cord in order to establish their transcriptome (Cahoy et al., 2008[href=https://www.wicell.org#bib4]; Zamanian et al., 2012[href=https://www.wicell.org#bib16]; Molofsky et al., 2014[href=https://www.wicell.org#bib11]; Chaboub et al., 2016[href=https://www.wicell.org#bib5]). This method has been used, in particular, by B. Barres and collaborators to compare transcriptomes of wild-type astrocytes versus reactive astrocytes induced by LPS or MCAO (Zamanian et al., 2012[href=https://www.wicell.org#bib16]). To minimize the effect of stress, we focused on reducing the incubation time with the dissociation enzyme (60 min instead of 90 min) and the time period between dissection and cell sorting (less than 3 h).\nGently triturate the mixture by pipetting up and down 10–15 times using a 5 mL pipette\nCritical: The dissociation needs to be quick yet gentle to separate the cells rather than rip them apart. Also avoid creating bubbles during the pipetting as it could result in poor cell health.",
    "Centrifuge the dissociated cells at 300 g for 5 min at room temperature.\nDuring this spin, mix 2.7 mL of EBSS with 300 μL of ovomucoid solution in a 15 mL falcon tube and 150 μL of DNase solution (low-ovo inhibitor solution).\nDiscard supernatant and resuspend each cell pellet in 500 μL diluted DNase/ovomucoid solution (low-ovo inhibitor solution) prepared in step 17.\nCritical: Be at the centrifuge, as soon as it stops and handle 15 mL conical falcon tubes very carefully to avoid disturbing the fragile pellet. Remove the supernatant slowly using a P-1000 pipette (do not pour off) ensuring no pellet is aspirated.\nAdd 1 mL of ovomucoid in a 15 mL falcon tube and layer the cell suspension on top.\nCentrifuge the dissociated cells at 70 g for 6 min at room temperature.\nDiscard supernatant and resuspend the cell pellet in 300 μL of PBS + 10% FBS and filtered through a 40 μm cell strainer to remove any remaining clumps of tissue.\ntable:files/protocols_protocol_1232_1.csv\nTransfer in a 5 mL polypropylene round-bottom tube or other adapted to your cell sorter and keep on ice. Proceed to sorting as fast as possible.\nCollect target cells by FACS\nTiming: Approximately 1 h\nDissociated tissue is now ready for FACS, target cells are collected and processed for RNA-Seq.\nProceed to the FACS facility.\nRun control samples to establish gating parameters: GFP-reporter mouse, tdTomato-reporter mouse and wild-type mice. (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1232-Fig2.jpg\nFigure 2. Gating strategies for isolation of eGFP+/tdT-, tdT+/eGFP-, and eGFP+/tdT+ cell populations\n(A–C) Debris and doublets were removed as described in steps 25a and 25b.",
    "(D–F) Representative FACS plots showing the last step of the gating strategy. Gates for eGFP+ (E) and tdT+ (F) cells were defined from cell populations purified from wild-type mouse (D), aldh1l1-eGFP (E) and olig2-tdTomato single transgenic mouse (F).\n(G) Representative FACS plot of the purification of tdT+/eGFP-, eGFP+/tdT- and tdT+/eGFP+ cell populations from P7 aldh1l1-eGFP/olig2-tdTomato double transgenic mice.\nRun double transgenic samples and set up gates. (Figure 2[href=https://www.wicell.org#fig2])\nRemove dead cells and debris according to the plot of forward scatter area (FSC-A) and side-scatter area (SSC-A) (Figure 2[href=https://www.wicell.org#fig2]A).\nExclude doublets by two successive gating approaches, first forward scatter height (FSC-H) vs forward scatter width (FSC-W) and then side scatter height (SSC-H) vs side scatter width (SSC-W) (Figures 2[href=https://www.wicell.org#fig2]B and 2C).\nThen gate for fluorescence, to identify the three awaited cells population using a PE-A vs GFP-A: high eGFP fluorescence for the nonOlig2-AS; high tdTomato fluorescence for the OPC/OL and high eGFP and tdTomato fluorescence for the Olig2-AS (Figures 2[href=https://www.wicell.org#fig2]D–2G).\nPrepare a set of three 1.5 mL collection tubes per spinal cord sample to collect the eGFP+/tdT-; eGFP-/tdT+ and the eGFP+/tdT+ cell populations.\nSort the populations of interest into the prepared 1.5 mL tubes\nCentrifuge at 2000g for 5 min\nDiscard the supernatant\nProcess the samples for RNA extraction using standard Trizol reagent with glycogen added as carrier according to manufacturer instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Ftrizol_reagent.pdf&title=VXNlciBHdWlkZTogVFJJem9sIFJlYWdlbnQ=[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Ftrizol_reagent.pdf&title=VXNlciBHdWlkZTogVFJJem9sIFJlYWdlbnQ=]).\nElution of RNA into 35 μL RNase-free water.\nPause point: The eluted RNA samples can be stored at −80°C for up to 3 months.\nLibrary preparation and RNA-Sequencing were performed by Beijing Genomics Institute (BGI, Hong Kong, China) using a BGISEQ-500 RNA-seq platform (paired-end sequencing, 100 bp reads, 30M reads/sample).\nRaw data processing\nTiming: ∼12 h on Genotoul Galaxy cluster 48 broadwell nodes (each 64 threads, 256 GB of memory)\nQuality control of the raw data from sequencing",
    "Use FastQC (v0.11.5) to check the quality of each raw fastq file from each sample: two files per sample, one for read1 and one for read2 of the RNA fragment sequenced paired-end (Andrews, 2010[href=https://www.wicell.org#bib2]).\nNote: This tool provides some quality control checks on raw sequences coming from the sequencing platform in FASTQ format and gives an overview of the data quality with graphs and indicators in a HTML report. The report contains basic statistics, sequence quality summary, sequence content summary, information about read lengths and estimation of duplication levels. It also lists potential overrepresented sequences and verifies the presence of reads’ adapters based on a list of known adapters.\nUse MultiQC (v1.7) to aggregate all FastQC reports and generate one single HTML report summarizing the output from all the FastQC reports (Figures 3[href=https://www.wicell.org#fig3]A and 3B) (Ewels et al., 2016[href=https://www.wicell.org#bib8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1232-Fig3.jpg\nFigure 3. MultiQC report\n(A) Sequence counts for each sample, showing number of unique and duplicate reads.\n(B) Distribution of reads’ sequence quality Phred score for each sample\nAlignment of the raw data from sequencing on the reference genome\nUse STAR aligner (v2.1) to align paired-end files from raw sequencing on the reference mouse genome from Ensembl database: FASTA and GTF file.\nNote: Based on sequential maximum mappable seed search in uncompressed suffix arrays, STAR is reliable, accurate, aligner designed for RNA-Seq dataset. The output is a single aligned file per sample in sequence alignment map (SAM) format (Dobin et al., 2013[href=https://www.wicell.org#bib6]).\nNote: For example, we perform alignment on the following version of the mouse reference genome: Ensembl Mus Musculus GRCm38.91 (mm10).\nConversion, sorting, and indexing alignment output Use Samtools (v1.9) to process alignment output files in SAM format (Li et al., 2009[href=https://www.wicell.org#bib9]).\nConvert each SAM file in a compressed Binary Alignment Map (BAM) file.",
    "Sort each BAM file following genomic coordinates order.\nGenerate an index, in BAI format, for each BAM file.\nQuantification of reads’ pairs on the chosen features\nUse HT-seq count (v1.0) to count the raw number of reads’ pairs aligned on each annotated feature from Ensembl gtf (Anders et al., 2015[href=https://www.wicell.org#bib1]).\nNote: The output is a table containing, for each gene, the raw number of reads’ pairs overlapping with its exon. The overlap resolution parameter is set to «union» to assign any ambiguous pair.\nAt the same time, use Cufflinks (v2.2.1) compute for each gene the number of fragments per kilobase million reads (FPKM) (Trapnell et al., 2010[href=https://www.wicell.org#bib13]).\nNote: This metric normalizes raw pair counts, taking account of sequencing depth and gene length. Each number of reads’ pairs is multiplied by 109 and divided by the total number of pairs in the sample (library size) and the length of the gene, in kilobases.\nData processing control (Tables 1[href=https://www.wicell.org#tbl1] and 2[href=https://www.wicell.org#tbl2])\ntable:files/protocols_protocol_1232_2.csv\ntable:files/protocols_protocol_1232_3.csv\nCompute percentage of read pairs aligned and quantified for each sample. Usually, the number of reads aligned should be > 60% and the number of reads falling on feature should be > 50%\nControl the specificity of each sample\nTiming: ∼6 h on Genotoul Galaxy cluster 48 broadwell nodes (each 64 threads, 256 GB of memory)\nAlignment of raw reads on specific sequences\nTo validate the selection of cells, use STAR aligned to map raw sample files on the sequences of eGFP and td-Tomato.\nQuantification of these reads\nUse Samtools idxstat to quantify the number of reads of each file on the 2 specific sequences.\nVisualization of the output\nVisualize these quantifications normalized by total sequencing depth into a bar plot (Figure 4[href=https://www.wicell.org#fig4]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1232-Fig4.jpg\nFigure 4. Control and cleaning of the raw data",
    "(A) Comparison of eGFP and tdTomato gene expression levels (by RPKM values) for the three cell populations.\n(B) Principal component analysis (PCA) on raw data.\n(C) Hierarchical Clustering dendrogram Euclidean distance and ward criteria on raw data.\n(D) Pairwise scatter plot between replicates.\n(E) Bar plot illustrating the raw and cleaned data from non-expressed genes for all samples.\nPrerequisite before differential analysis\nTiming: ∼1.5 h on personal computer with R (v3.6)\nImport raw datasets in the workspace\nImport the raw pairs count table for each sample. Check that each table is completely loaded then merge all tables in one common data frame with all the samples.\nNote: The number of genes and the genes’ order should be the same for all the samples. Remove rows corresponding to ambiguous or not assigned pairs.\nExplore the complete raw dataset\nCheck the quality of the count table: proportion of null counts per sample, most expressed genes in each sample, statistical indicator for the distribution of reads’ pairs counts for each sample and correlation between each replicate (Figure 4[href=https://www.wicell.org#fig4]D).\nApply Principal Component Analysis and Hierarchical Clustering (Euclidean distance – Ward criterion) on the raw data to explore the entire data frame. Use ggplot2 R-package (v3.3.5) to draw graphs of PCA results (Figures 4[href=https://www.wicell.org#fig4]B and 4C) (Wickham, 2016[href=https://www.wicell.org#bib15]).\nClean data from non-expressed genes. Before running differential analysis, remove from the raw count table any gene having an averaged raw read count per sample lower than 1 (Figure 4[href=https://www.wicell.org#fig4]E).\nDifferential analysis\nTiming: ∼1.5 h on personal computer with R (v3.6)\nPerform normalization and parameters estimation with DESeq2\nUse DESeq2 (v1.22.2) to perform Relative Log Expression (RLE) normalization on the raw counts and estimate dispersion parameter modeling the Negative-Binomial distribution of the data (Figures 5[href=https://www.wicell.org#fig5]A and 5B) (Love et al., 2014[href=https://www.wicell.org#bib10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1232-Fig5.jpg\nFigure 5. Differential analysis",
    "(A and B) Boxplots on cleaned raw counts before (A) and after (B) normalization.\n(C) Hierarchical Clustering dendrogram Euclidean distance and ward criteria on the normalized data.\n(D) Principal component analysis (PCA) on normalized samples.\n(E–G) MA plots of differentially expressed genes representing the log2FC and log (basemean) from the differential analysis DA1 (E), DA2 (F) and DA3 (G). Red dots represent transcripts with a significant padj < 0.05 and a log2FC > 0 or a log2FC < 0.\nNote: RLE is based on the computation of a scaling factor applied on each raw count. This factor is the median over all the genes of the ratio of raw gene count per gene divided by the geometric mean of the gene across all samples. This normalization method corrects both sequencing depth and mRNA composition bias that are usual in RNA-Seq. RNA-Seq count data are then modeled by a negative binomial distribution with fitted mean and a gene-specific dispersion parameter.\nCritical: This normalization method is based on the hypothesis that the majority of genes are not regulated between the 2 populations. In case of drastic variability between this normalization method might not be applicable. Moreover, this normalization method corrects both sequencing depth and mRNA composition bias but not gene length associated bias. Indeed, genes will not be compared within the same sample. To compare genes within sample FPKM normalization (described in 34.b) would be more appropriate.\nApply Wald tests\nUse DESeq2 to apply inferential testing between pairs of cell populations in order to get the results of three different differential analysis (DA): between Olig2-AS and nonOlig2-AS cells (DA1), between Olig2-AS and OPC/OL (DA2) and between nonOlig2-AS and OPC/OL (DA3).",
    "For each DA a Wald test is applied to each gene, the p value is then corrected for multiple testing with Benjamini–Hochberg method and we obtain an output with log2 fold change (log2FC) values as well as p value and adjusted p value for each gene (Benjamini and Hochberg, 1995[href=https://www.wicell.org#bib3])\nFind associated gene symbol with each ID\nUse the R-package Biomart (v2.48.2) to convert Mouse ENSEMBL IDs to mouse official gene names (Durinck et al., 2005[href=https://www.wicell.org#bib7]).\nVisualization of the results\nTiming: ∼3 h on personal computer with R (v3.6)\nGlobal visualization of the normalized samples\nTo get an overview of the samples after normalization, apply Principal Component Analysis and Hierarchical Clustering (Euclidean distance – Ward criterion) on the normalized data set (Figures 5[href=https://www.wicell.org#fig5]C and 5D).\nControl correlation between sample computing Pearson correlation and use the ggplot::heatmaps.2 R-package (v3.1.1) to plot the correlation results in a heatmap plot. (Warnes et al., 2015[href=https://www.wicell.org#bib14])\nGlobal visualization of the DESeq2 outputs In order to visualize the result of each DA, generate plots from DESeq2 output:\nMA plot (log (basemean) against log2FC for each gene)\nVolcano plot (log2FC against log10 (adjusted p value)) (Figures 5[href=https://www.wicell.org#fig5]E–5G).\nFor the top 20% most variable mRNA, based on the |log2FC|, compute euclidean distances between the cell types and plot results using the ggplot::heatmaps.2 R-package function (Figure 5[href=https://www.wicell.org#fig5]C).\nVisualization of list of markers\nUse log2FC and adjusted p values of the different DA to select subset of genes. Then for each gene of interest compute the mean per condition, and center and scale each gene using the z-score. With the computation of z-score we are able to visualize genes of different levels of expression in the same color scale in a heatmap (Figures 6[href=https://www.wicell.org#fig6]A and 6B). The two heatmaps have been made using the Prism 8 software (GraphPad).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1232-Fig6.jpg",
    "Figure 6. Visualization of list of genes\n(A and B) Heatmaps depicting the abundance of mRNA corresponding to the top 50 genes enriched in OPC/OL(A) and the 649 genes enriched in the nonOlig2-AS. The gene names highlighted in red are genes known to be involved in OL/OPC function. All heatmaps are presented as z-score and genes are ordered by the log2FC (DA3) for (A) and the log2FC (DA1) for (B).\n    z - score   ( gene condition )   =    Normalized read counts  ( gene condition )   −  Row mean normalized read counts  ( gene )     Row standard deviation  ( gene )     \nValidation of the selected candidate genes by either qPCR and/or in situ hybridization (ISH)."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Sequence Analysis",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Biology",
    "Neuroscience",
    "Gene Expression",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}