{
  "id": 9811,
  "origin_website": "Jove",
  "title": "How to Build a Laser Speckle Contrast Imaging (LSCI) System to Monitor Blood Flow",
  "procedures": [
    "1.  Imaging Setup\nA camera with a macro zoom lens should be mounted to a vertical stage or surgical microscope (Instead of a macro zoom lens, a microscope objective and lens or a simple two lens system could be used depending on the desired magnification).\nDownload appropriate software from our website to control the camera (http://bach.bme.utexas.edu/mediawiki/index.php/Software[href=http://bach.bme.utexas.edu/mediawiki/index.php/Software]).\nThe camera software should be used to confirm an object is in focus at the desired height\nA laser diode with a collimation kit should then be set up so that divergent laser light illuminates the object.\nTurn down/off all ambient light to confirm that the laser light is evenly illuminating the entire field of view of the camera.\nIn this example, red laser light was used because it was easier to demonstrate how to build the system, but infrared laser light could just as easily be used and would have the additionally benefit of penetrating deeper in tissue. Also, with appropriate filters in front of the camera to block visible light, infrared light could be used with the room lights on.\n2.  Surgical Preparation\nThis is a non-survival surgery, although the experiment could be done chronically in a survival study by using a chamber window.\nAnesthetize the animal and place it into a stereotactic frame.\nRemove the skin and tissue surrounding the skull.\nUsing a dental drill, thin the skull over the desired brain region to transparency being careful to flush the surface with saline frequently in order to avoid damaging the brain.\nUse dental cement to create a well around the desired region and then place a drop of mineral oil or silicone gel into the well to improve visibility.\nAlternatively, the skull could be removed and a chamber window could be created here.\n3.  Collecting Data",
    "Use the camera software to acquire images and also calculate speckle contrast values.\nPlace the animal into the field of view of the camera and adjust the camera height or lens focus until clear images of the vasculature are seen.\nMake sure that enough laser light is reaching the camera without saturating it. Using the histogram of the image, adjust the laser power to ensure the majority of camera pixels are excited to about half their capacity.\nSelect the number of images you wish to acquire and how much averaging to do before beginning the experiment.\nOnce the experiment begins, blood flow changes can easily be monitored by selecting regions of interest or by generating an image of relative blood flow.\n4.  Representative Results\nFigure 1 shows an example of a typical raw speckle image and a converted speckle contrast image that should be generated when using the software to examine blood flow in the brain.  For visualizing changes in blood flow, it is easier to have the software generate relative maps of blood flow.  Figure 2 shows a typical series of relative blood flow images during a transient increase in blood flow that travels across the field of view.  The red color represents an increase in blood flow while the blue color shows a decrease.  The green color indicates that there is no change in blood flow relative to a given baseline.\n imgsrc://cloudfront.jove.com/files/ftp_upload/2004/2004fig1.jpg\nFigure 1.  Example of a raw speckle image (left) and speckle contrast image (right).\n imgsrc://cloudfront.jove.com/files/ftp_upload/2004/2004fig2.jpg\nFigure 2.  Example of several relative blood flow images at different time points during a transient increase in blood flow followed by a decrease in blood flow.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}