{
  "id": 19308,
  "origin_website": "Jove",
  "title": "Split Retina as an Improved Flatmount Preparation for Studying Inner Nuclear Layer Neurons in Vertebrate Retina",
  "procedures": [
    "Mice were provided with water and food ad libitum and were maintained on a 12 h light/dark cycle. Mice were euthanized by exposure to isoflurane followed by cervical dislocation. All animal procedures were in accordance with the National Institutes of Health guidelines and approved by the Oregon Health and Science University Institutional Animal Care and Use Committee.\nNOTE: Eye enucleation, retina dissection, and retina splitting should be performed as quickly as possible to preserve the health of the living tissue. Aim to complete the dissection in < 4 min per eye. These three steps are to be performed sequentially. Wild-type mice: Adult (>3 months) male and female C57BL/6J mice were used for experiments. For synapse morphology, mice expressing green fluorescent protein (GFP) under the Pcp2 promoter (Pcp2-cre/GFP)14 were used. Transgenic mice: For horizontal cell visualization with GFP during immunohistochemistry or electrophysiology experiments, a triple-transgenic mouse was used: vGATFLPo; vGlut2Cre; Ai80d. The vGATFlpo and vGluT2Cre strains are knock-in mice expressing Flpo or Cre recombinase downstream of their respective promoters. The Ai80d mouse is an intersectional reporter mouse (CatCh/EYFP) and will only express Ca2+ permeable channel rhodopsin (ChR2) in cells expressing Cre and Flpo recombinases. Thus, the triple transgenic mouse only expresses ChR2 in cells with a history of both VGAT and vGluT2 expression.\n1. Materials preparation for retina dissection and retina splitting\nPrepare pieces of nitrocellulose membrane\n\tNOTE: Detaching the split retina from the nitrocellulose membrane reduces background fluorescence in microscopy and simplifies patch clamp recording. Membrane removal can be performed before or after tissue fixation. For fixed split retinas, it is not necessary to treat the pieces of nitrocellulose membrane. For live split retinas, treat the membrane according to steps 1.1.3 - 1.1.5 to facilitate gentle detachment from the tissue.",
    "Cut 16 pieces (or more) of nitrocellulose membrane into 5 mm x 5 mm squares. Extra can be prepared in bulk and stored for future use.\nSet aside half of the pieces of membrane for later use. These pieces will not be treated with a blocking solution.\nIncubate the remaining pieces in a detergent-free IHC blocking solution (such as 3% horse serum + 0.025% NaN3 diluted in PBS) for 10 min at room temperature, shaking gently.\n\t\tCAUTION: Use appropriate PPE when handling NaN3, as it is a potent toxin.\nWash the membrane pieces thoroughly by incubation in bicarbonate-buffered Ames media for 10 min at room temperature, shaking gently.\nCompletely air dry the blocked pieces of membrane (~20 min). Label and store the membrane pieces at room temperature, keeping them separate from the untreated pieces of membrane.\nPrepare Ames media\n\t\nPrepare bicarbonate-buffered Ames media and maintain the solution at room temperature under constant carbogenation (95% O2 and 5% CO2).\n2. Mouse eye enucleation\nEuthanize the mouse by any available method according to institutional IACUC guidelines.\nFlip the mouse onto one side and use two fingers to gently press down around the eye socket. This will cause the eye to bulge out from the skull.\nUsing curved dissection scissors, snip underneath the bulged eye to sever the optic nerve and to separate the eye from the skull.\nScoop the eye with scissors and place it into a Petri dish filled with ice-cold Ames media.\n\tNOTE: For downstream applications in which the tissue will be fixed after splitting, ice-cold PBS can be used instead of Ames media.\nRepeat steps 2.1 - 2.4 for the remaining eye.\n3. Retina dissection\nUse the custom glass transfer pipette to transfer one eye to a new Petri dish containing fresh, ice-cold Ames media.",
    "NOTE: The wide opening of the custom transfer pipette prevents accidental squishing of the tissue, and using glass minimizes adhesion of the tissue to the walls of the pipette. However, a wide-mouth plastic transfer pipette is also acceptable if the experimenter is already proficient at using this tool.\nUse forceps to stabilize the eye by pinning its extra connective tissue to the bottom of the Petri dish. Then, puncture the eye along the ora serrata line using a 25G needle to create an entry point for the Vannas scissors.\nUse Vannas scissors to cut along the ora serrata line until the cornea comes free from the rest of the eye (Supplementary Figure 1A). Remove the lens from the eyecup using forceps (Supplementary Figure 1B).\nUse the custom glass pipette to transfer the eyecup to a large volume (≥100 mL) of carbogenated Ames and repeat steps 3.1 - 3.3 with the remaining eye.\n\tNOTE: Eyecups are placed into carbogenated Ames to maintain tissue health while the dissection is performed on the other eye.\nTransfer one eyecup to a Petri dish filled with freshly carbogenated Ames.\nUsing Vannas scissors, make a small snip inward from the edge of the sclera, then use two pairs of forceps to peel the sclera away from the retina (Supplementary Figure 1C). Avoid grabbing the retina with the forceps. Instead, pull apart the flaps of the sclera created by the scissor snip.\nUse the Vannas scissors to snip the optic nerve connecting the sclera and the retina (Supplementary Figure 1D), then gently pry the retina from the sclera using the scissors or forceps to isolate the retina. (Figure 1A).",
    "NOTE: While the RPE will typically remain attached to the eyecup, no extra steps are required to remove the RPE in the event it is attached to the retina. At this point, the edges of the retina may be optionally trimmed with a scalpel to prevent curling during the flattening step (Figure 1B).\nUse a scalpel to cut the retina into halves or quarters (Figure 1C), then use the custom transfer pipette to return the pieces to a large volume (≥ 100 mL) of continuously carbogenated Ames media.\n\tNOTE: The choice of halves or quarters is subjective. Choose the best option for the desired application.\nRepeat steps 3.5 - 3.8 for the remaining eye before proceeding to retina splitting.\n4. Retina splitting\nDiscard the Ames media from the Petri dishes and replace it with freshly carbogenated Ames.\n\tNOTE: To maintain carbogenation throughout the remainder of the retina splitting procedure, replace the media in the Petri dish with freshly carbogenated Ames roughly every 5 min.\nUsing the custom transfer pipette, place a piece of retina onto a glass slide (7.5 cm x 5 cm), ganglion cell side up, then flatten it by removing the surrounding liquid with a delicate task wipe (Figure 1D). If necessary, gently pull the retinal edges with a fine tip paintbrush under a dissection microscope.\nUse forceps to lower a dry 5 mm x 5 mm piece of nitrocellulose membrane onto the retina, causing it to adhere to the ganglion cell side (Figure 1E).\n\tNOTE: If membrane removal from live tissue is required (i.e., for electrophysiology), use a dry piece of serum-treated membrane for this step (see steps 1.1.3 - 1.1.5 for details). This reduces the strength of the adhesion to the ganglion cell layer, making it easier to remove the retina from the nitrocellulose post-split.",
    "Flip the retina over so that the nitrocellulose is resting on the glass slide and place a dry piece of 5 mm x 5 mm membrane onto the photoreceptor side of the retina (Figure 1F).\nTouch the wetted tip of the paintbrush to the space between the two membranes and allow capillary action to suck the Ames into the sandwich (Figure 1G). This reduces the adherence of the membranes to the retina and is only necessary if the retina has been overly dried with the delicate task wipe.\n\tNOTE: If the retina has lost its shiny appearance, it has been overly dried, and step 4.5 is necessary.\nTo ensure uniform adherence, apply light downward pressure to the upper membrane with a wet paintbrush (Figure 1H).\nWhile pinning the lower membrane to the glass with one pair of forceps, use a slow, steady motion to gently peel the upper membrane away with a second pair of forceps. This will cause the retina to split just above the OPL (Figure 1I).\nDiscard the upper membrane containing the photoreceptors (Figure 1J, left). The lower membrane contains the inner retina, henceforth referred to as a split retina (Figure 1J, right).\nImmediately return the split retina to carbogenated Ames media.\n\tNOTE: For experiments on living tissue, retinas may benefit from a 15-30 min recovery period in carbogenated Ames after splitting.\nimgsrc://cloudfront.jove.com/files/ftp_upload/65757/65757fig01.jpg",
    "Figure 1: Split retina procedure. (A) Following enucleation and eyecup preparation in cold PBS or Ames media, isolate the mouse retina from the eyecup and replace the PBS with room temperature, carbogenated Ames media. (B) Using a scalpel, trim the edges of the retina away until there are no regions with an inward curl (optional). (C) Cut the retina into quarters or halves using a scalpel. (D) Place one piece of retina on a glass slide (ganglion cell side up) using the custom transfer pipette and remove all excess Ames using a delicate task wipe. Ensure that the semi-dry retina is lying flat on the glass before proceeding to the next step. Use an Ames-wetted paintbrush tip to gently unfold regions of the retina that are not flat. (E) Using forceps, place a pre-cut piece of dry nitrocellulose membrane (5 mm x 5 mm) onto the flattened retina. (F) Flip the piece of nitrocellulose so that the photoreceptor side of the retina is now facing up. Then place another dry piece of membrane onto the retina. (G) Touch the wet tip of the brush to the space between the two membranes and allow capillary action to suck the Ames into the sandwich. This reduces the adherence of the membranes to the retina and is only necessary if the retina was overly dried with the delicate task wipe. (H) Use a wet paintbrush tip to gently press downward onto the center of the sandwiched retina. (I) Use one pair of forceps to pin the bottom piece of membrane onto the glass slide, while using another pair of forceps to gently peel the top piece of membrane away from the bottom one.",
    "(J) The inner retina (left) remains on the bottom membrane while the photoreceptors (right) are pulled away with the top membrane. Panels (A), (B), (C), (D), and (J) were acquired using a dissection microscope; the scale bar represents approximately 1 mm; panels (E-I) were acquired with a smartphone camera without magnification. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/65757/65757fig01large.jpg]",
    "5. Preparation of split retinas for immunofluorescence experiments\nNOTE: The split retina will still be attached to the nitrocellulose membrane until step 5.5. Complete either step 5.1, 5.2, 5.3, or 5.4, not all four as these are for different experiments.\nCAUTION: Use appropriate PPE and proceed carefully when handling paraformaldehyde (fixative).\nPreparation for flatmount immunofluorescence\n\t\nIncubate the split retina in 4% paraformaldehyde on ice for 30 min using enough solution to completely cover the retina.\nWash the split retinas 3x in 5-10 mL of room temperature PBS. Optional pause: Split retinas may be left in PBS at 4 °C for up to 24 h.\nPreparation for immunofluorescence with vertical sections of split retina\n\t\nIncubate the split retina in 4% paraformaldehyde on ice for 30 min using enough solution to completely cover the retina.\nWash the split retinas 3x in 5-10 mL of room temperature PBS. Optional pause: Split retinas may be left in PBS at 4 °C for up to 24 h.\nWith the membrane still attached, sequentially immerse the split retina in 10%, 20%, and 30% sucrose at 4 °C for 1 h each to cryoprotect the tissue.\nEmbed the cryoprotected split retinas in optimal cutting temperature (O.C.T.) compound and store them at -80 °C (up to 6 months) until cryosectioning.\nRemove the embedded split retinas from -80 °C and use a cryostat to cut sections 20 µm thick. Mount the sections onto electrostatically charged glass microscope slides, allow them to air dry, then store them at -20 °C for up to 6 months.\nPreparation for dual fluorescence in situ hybridization and immunohistochemistry\n\t\nIncubate the split retina in 4% paraformaldehyde on ice for 2 h using enough solution to completely cover the retina.",
    "Wash the split retinas 3x in 5-10 mL of room temperature PBS. Optional pause: Split retinas may be left in PBS at 4 °C for up to 24 h.\nPreparation for electrophysiology\n\t\nPrepare patch pipettes by pulling thick-walled borosilicate glass pipettes with filament using a micropipette puller. Only use pipettes with a measured resistance between 6-10 MΩ.\nBack fill the pulled pipettes with internal solution containing (in mM): 125 K-gluconate, 8 KCl, 5 HEPES, 1 MgCl2, 1 CaCl2, 0.2 EGTA, 3 ATP-Mg, and 0.5 GTP-Na.\nRemoval of the split retina from the nitrocellulose membrane\n\t\nUsing a hydrophobic barrier pen, prepare circular wells on a microscope slide (~1 cm in diameter) and allow them to air dry for 5-10 min.\nPlace the split retinas within the prepared hydrophobic barrier pen wells and add enough PBS to completely cover them.\nUnder a dissection microscope, push the bristles of a fine paintbrush under the edges of the tissue and gently lift upward. In this manner, work around the retina in a circle to lift it away from the membrane.\nUse forceps to remove the membrane from underneath the floating piece of retina.\nCarefully aspirate away the remaining PBS so that the piece of retina comes to rest on the microscope slide, ganglion cell-side down.\n\t\tNOTE: The following steps are not to be performed sequentially. Choose the appropriate protocol for the desired application (i.e., immunostaining or dual fluorescence in situ hybridization [FISH] and immunohistochemistry [IHC] or electrophysiology).\n6. Immunostaining\nIf not yet prepared, use a hydrophobic barrier pen to create circular wells on a microscope slide (~1 cm in diameter) and allow them to air dry for 5-10 min. All incubation steps and wash steps will be performed within these pen wells.",
    "Incubate the split retinas or vertical split retina sections in antibody incubation solution (AIS: 3% horse serum, 0.5% Triton X-100, 0.025% NaN3 in PBS) for 30 min at room temperature.\nIncubate the split retinas or vertical split retina sections with primary antibodies diluted in AIS for 1 h at room temperature.\n\tNOTE: Primary antibody incubation time will require optimization for different protein targets and antibodies.\nWash the tissue 3x in room temperature PBS.\nIncubate the tissue with secondary antibodies diluted in AIS for 1 h at room temperature. Wash the tissue 3x in room temperature PBS.\nIf nuclear staining is desired, incubate the tissue with DAPI diluted in PBS for 30 s at room temperature. Wash the tissue 1x in room temperature PBS.\nApply a drop of slide mounting media to each piece of tissue and mount a glass coverslip.\nApply nail polish around the edges of coverslip to seal the sample. Store the slide at 4 °C.\n7. Dual FISH and IHC\nBake the split retinas at 40 °C for 30 min in a hybridization oven to increase adherence to the slide.\nComplete the RNAscope FISH protocol according to the manufacturer's protocol with the following exceptions and alterations:\n\t\nNo antigen retrieval step is required. Use protease III with an incubation time of 18 min at room temperature.\nPerform all wash steps on the slide within the wells made by a hydrophobic barrier pen.\nIncubate the samples in primary antibody diluted (see Table of Materials) in PBS for 30 min at 40 °C in the hybridization oven. Wash the samples 3x in room temperature PBS.\nIncubate the samples in secondary antibody diluted (see Table of Materials) in PBS for 30 min at 40 °C in the hybridization oven. Wash the samples 3x in room temperature PBS.",
    "Incubate the samples in 1x DAPI for 30 s at room temperature. Wash the samples 1x in room temperature PBS.\nApply a drop of anti-fade mounting media to each piece of tissue and mount a glass coverslip.\nApply nail polish around the edges of coverslip to seal the sample. Store the slide at 4 °C.\n8. Electrophysiology\nAfter removing the nitrocellulose membrane, transfer a split retina into the patch-clamp recording chamber and gently anchor it in place with a platinum harp.\nThroughout the experiment, continuously perfuse the split retina with Ames solution carbogenated with 95% O2 and 5% CO2. Maintain the solution between 32-34 °C.\n\tNOTE: During the experiment, the tissue can be visualized using Dodt gradient contrast microscopy.\nUnder room lighting, perform whole-cell voltage-clamping to record from INL neurons.\n\t\nWhile recording, simulate light responses using a microcellular injection unit to apply pharmaceutical compounds, or a 470 nm LED to stimulate channelrhodopsin (ChR2).\n\t\t​NOTE: Light intensity can be measured using a digital optical power meter.\n9. Confocal microscopy\nFor confocal immunofluorescence, take images with a confocal microscope using a 40x/1.3 or 63x/1.40 oil immersion objective. Use FIJI to adjust brightness and contrast and to generate Z-projections from image stacks."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}