{
  "id": 8128,
  "origin_website": "Bio",
  "title": "Isolation, Culture and Differentiation of Primary Acinar Epithelial Explants from Adult Murine Pancreas",
  "procedures": [
    "I.   On the bench:   Mice should be between 4 and 7 weeks of age. Isolation of acinar issue does not work with older mice. Because time is a critical step for the viability of acinar cells, we usually do not process more than 2 mice at the same time.  From one mouse it is possible to obtain about 1,000 acinar-explants. Acinar tissue can be seeded for example in 15 wells of a 48-well plate, thus the obtimal denisty for differetiation of acinar tissue is obtained when you see about 30 acinar explants in a well through a 10x objetive. If density is too high differentiation will take longer, if too low acinar cells will die.    Put forceps and scissors into 80% EtOH.   Anesthetize the mouse with isofluorane, sacrifice the mouse by cervical dislocation and resect the pancreas as fast and possible (time is a critical step).   Place the resected pancreas into a tissue culture dish containing ice cold sterile PBS.       II.  Up to now all protocol steps should be performed under sterile conditions.   Centrifugation steps at 720 x g (18 °C) are a critical step!    In the hood, transfer the pancreas into a culture dish containing 10 ml of PBS.   Immediately put the pancreas in culture dish with 5 ml collagenase VIII solution (see Recipe 4) and cut the organ in very small pieces (less then 1 mm of diameter) with a scalpel within 2 min. Pipette the tissue up and down.   Incubate the dish at 37 °C for 10 min. Shake from time to time.   Transfer the sample into a 50 ml falcon. Pipette the solution 3x up and down.   Wash the dish with 10 ml wash solution and transfer to the 50 ml falcon.   Centrifuge, 720 x g, 5 min, 18 °C.   Carefully remove the supernatant.",
    "Resuspend the pellet in 5 ml collagenase VIII solution. Put in a culture dish. Pipette the tissue up and down.    Incubate at 37 °C for 10 min. Shake from time to time.   Aspirate the sample and filter through a 100 μm nylon cell strainer positioned on a 50 ml falcon.   Macerate the tissue pieces through the cell strainer with a syringe plunger.  Note: This step is difficult to describe, try to press the tissue through the strainer with the syringe plunger without applying a shear stress. It is possible you have to optimize this step in your hands.   Wash the mesh with 10 ml wash solution to carefully collect any remaining cell.   Centrifuge, 720 x g, 5 min, 18 °C.   Carefully remove the supernatant.   Aspirate the pellet in 20 ml wash solution, and transfer the solution in a fresh tube. Do not aspirate up and down!   Centrifuge, 720 x g, 5 min, 18 °C.   Resuspend the pellet in 2 ml culture medium 30% and transfer it on a well of a 6-well culture dish.    Check the quality of isolated acinar tissue under the microscope. Isolation is good if you see clusters of acinar cells (epithelial explants, the morphology is the same as in the Ctr. of the figure below) and only rare isolated acinar cells swimming around. Sometimes damaged acinar cells agglomerate together, remove such sticky agglomerates with a forceps.   Let the isolated acini recover for 60 min in the incubator (37 °C with 5% CO2).   Meanwhile precoat a cell culture plate of the desired size with collagen (see below). Calculate the required volume of collagen - medium mixture required for step 25. The volume depends from your application. Calculated 100 μl volume/well for a 48-well plate or 80 μl volume/well for an 8 well chamber slide.",
    "Typically you will seed the acinar explants obtained from one wild type mice in 15 wells of a 48 well plate. In this case you need 100 μl x 15/2 = 750 μl collagen and 100 μl x 15/2 = 750 μl medium 0.1%.   Collect the acinar suspension from the plate and transfer it to a fresh 15 ml tube.   Centrifuge acinar suspension, 720 x g, 5 min, 18 °C.   Carefully aspirate the supernatant.   Resuspend the pellet in a mixture of collagen and culture medium 0.1% (1:1 vol. /vol.)    Pipet the acini/collagen-medium suspension mixture into each coated well in the  plate (at least in triplicate). For the typical 48-well example you pipet 100 μl of the mixture in 15 wells.   Wait until solidification of the collagen (about 30 min)   Add some more collagen (100 μl/well for the 48 well plate). You may skip this step when you will perform immunofluorescence as a downstream application. Wait until solidification (about 30 min)   Add culture medium 0.1% with/without the desired supplements to each well. Typically 400 μl/well for a 48 well plate.   To induce transdifferentiation of acinar explants, add TGFa (10 ng ml-1) or EGF (25 ng ml-1) into the culture medium 0.1% at day 1-3-5 where day 1 is the day of isolation. Note:  1) We usually quantify transdifferentiation of wild type acinar explants after EGF treatment at day 5 (Figure 1).  2) Culture can be kept until day 8. For longer periods of culture you have to reseed the acinar explants into fresh collagen because cultures become acidic and collagen breaks down.       III. Gelation Procedure for Rat Tail Collagen I, 2.5 mg ml-1    Place on ice: Collagen, sterile 10x PBS, sterile water, sterile 1 N NaOH, falcon tubes. Keep all reagents on ice.",
    "Calculate the total amount of collagen (final concentration of 2.5 mg ml-1) needed with the formula: (final Vol. x 2.5)/ (collagen concentration in the bottle). You need a 100/120 μl collagen layer/well for a 48-well plate or 80 μl collagen layer/well for a 8 well chamber slide.   Prepare a tube on ice with the following volume of 10x PBS: (final Vol.)/10.   Add the following volume of 1 N NaOH to the tube containing 10x PBS: (Vol. collagen to be added) x 0.023 ml.   Add to the 10x PBS/1 N NaOH the following volume of sterile ice-cold water: (final Vol.) - (Vol. collagen) - (Vol. 10x PBS) - (Vol. 1 N NaOH).   Mix the contents of tube and hold in ice.   Add the calculated volume of collagen and mix. Leave on ice (stable for 2-3 h) until ready for use.   Coat tissue culture dishes with collagen (use 24/48 wells for quantification of transdifferentiation, protein or RNA extraction, or use 8 well chamber slides for later staining applications).   Allow collagen to solidify at 37 °C (about 30 min) Note: Downstream applications include immunofluorescence, protein extraction, RNA extraction and cytotoxicity assay.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130702/20130702195630_8726.jpg Figure 1. Example of acinar explants at day 5. Acinar explants from a wild type mouse were isolated and cultivated for 5 days in collagen as described. Ctr (medium only): a typical acinar explant is composed by a sphere of several acinar cells. EGF: in presence of 25 ng/ml of EGF cell clusters get a more flattened morphology and differentiate to a duct-like structure characterized by a lumen (arrow) lined by several cells."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}