{
  "id": 16999,
  "origin_website": "Jove",
  "title": "NMR-Based Fragment Screening in a Minimum Sample but Maximum Automation Mode",
  "procedures": [
    "1. Fragment library\nIn-house fragment library\n\tNOTE: Within the framework of one of the joint research activities of the iNEXT, a robust and downstream chemistry friendly first generation fragment library was developed12 and subsequently a second generation of the library was put together in collaboration with Enamine and is known as the DSI (Diamond-SGC-iNEXT)-poised fragment library (from now on termed as \"In-house library\"). This library can be made available at the BMRZ for screening purposes.\n\t\nAssess the fragment library for its integrity and solubility using a previously reported NMR-based protocol9.\n\t\t​NOTE: The in-house library consists of 768 fragments with a very high chemical diversity (>200 Singletons). Performing the screening in fragment mixtures can significantly speed up the screening campaign; however, the number of fragments in a mix is limited due to signal overlap in 1H-NMR spectrum. The higher chemical diversity offered by the in-house library allows for the preparation of mixtures containing 12 different fragments without any significant chemical shift overlap in the 1H observed NMR spectra.\n103 fragments within the 768 fragments possess a fluorine atom. For 19F screening purposes, divide all 103 fragments that possess a fluorine group into 5 mixes based on minimum 19F chemical shift overlap. To minimize signal overlap in the 19F screening, use the chemical shift information from single compound measurements to design mixtures with maximum number of fragments and minimal signal overlap. Each mix has 20-21 fragments with distinct 19F chemical shifts allowing for unambiguous assignment of fragments.\nUser defined/provided fragment library\n\t\nPerform screening campaigns with the user defined or provided fragment library; however, the following steps need to precede the screening campaign.\nIf not specified by the user beforehand, perform NMR-based quality control of the fragments (at the BMRZ, advanced software tools are used for this; 9, Chapter 6.1.1).",
    "Check the solubility of the fragments in buffer-of-choice for the biomolecular target, structure integrity, and concentration of fragments prior to use.\nDesign the mixture to decrease both signal overlap in NMR spectra and measurement time.\nDesign mixtures according to step 4.2.\nScreen single fragments or a subset of mixtures instead of the entire library.\n2. Sample preparation\nNOTE: High-throughput screening by NMR utilizes a pipetting robot for sample preparation. NMR spectra, but also stabilities over several days of signal acquisition of proteins, RNAs and DNA are extremely sensitive to temperature fluctuations and therefore temperature-controlled automated systems will greatly facilitate the stability of the samples being pipetted. For this purpose, an additional add-on device, which works between 4 to 40 °C, is coupled to the pipetting robot for liquid handling of the NMR samples in a temperature-controlled environment.\nLigand mixture preparation\n\t\nPrepare screening samples for NMR measurements using a sample preparation robot. The flexible configuration of the robot allows for a wide range of applications (e.g., recovery of the samples from NMR tubes back into storage containers or general liquid handling tasks). NMR-tubes with different diameters (1.7, 2.0, 2.5, 3.0 and 5.0 mm) can be used. The sample robot system along with the advanced control software reads the barcode assigned for each container type and executes the liquid filling protocol optimally.\nFor the preparation of the in-house library ligand mixtures, use barcoded vials. The barcoded vials guarantee the highest level of reliability and optimal traceability of the samples.\nDistribute 768 compounds into 8 plates of 96-well format. The stock concentration of each individual fragment is 50 mM in d6-DMSO/D2O (9:1). In total, prepare 64 mixes each containing 12 fragments. The final concentration of each fragment in a mix is 4.2 mM.",
    "NOTE: The pipetting robot can accommodate a variety of container types with varied geometries (cryo- or auto sampler vials, 96-well plates round or square deep, barcoded standard vials, microcentrifuge tubes) and assists efficient execution of the liquid transfer to a variety of NMR tubes and racks.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62262/62262fig01.jpg\nFigure 1: (A) High-throughput NMR sample preparation and NMR-tube filling robot installed at BMRZ. (B) High-throughput sample changer with individual temperature-controlled racks installed on a 600 MHz spectrometer at the BMRZ facility. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62262/62262fig01large.jpg]\nScreening sample preparation blank (reference ligand spectrum) and with target (ligand in the presence of target)\n\t\nFor the preparation of the NMR screening samples, in the presence of the target biomolecule (protein/RNA/DNA) and the ligand mixture, use 3 mm NMR HT sample changer tubes selected from the Bruker NMR portfolio of standard NMR tubes.\nTransfer the biomolecular target (e.g., 1H Screening: 10 µM RNA or Protein) in a defined screening buffer into the 3 mm NMR tube (final volume of 200 µL) manually or using the pipetting robot.\nTransfer 10 µL (e.g., 1H Screening) of the ligand mixture in the next step using the robotic system into the barcoded 3 mm NMR tubes containing the target biomolecule and mix using the inbuilt protocol of the control software.\n\t\t​NOTE: The barcode number of the NMR tube is conveniently and automatically incorporated into the acquired NMR-dataset, thus ensuring ID oriented workflow without any mix-up. The pipetting robot temperature control accessory allows to keep the prepared samples in the NMR tubes under constant temperature.\nIn-house defined conditions and parameters",
    "Establish optimal buffer conditions for performing screening of RNA and protein against the in-house fragment library. The following sample conditiond are used for the RNA at the BMRZ: 25 mM KPi, 50 mM KCl, pH 6.2. Mg2+ is optional.\nProteins are extremely sensitive for solution conditions; use buffers optimal for the target of choice. For each of those buffers, acquire additional reference spectra of the ligands to serve as blank for the analysis.\nUser specified conditions\n\tNOTE: In cases in which the in-house established conditions are not suitable for the targets to be screened from a potential user, the following steps should be implemented.\n\t\nPerform 1H-NMR of the buffer alone to ensure minimal interference from the components of the buffer in performing and analysing the ligand observed screening experiments. Interfering components could be suitably replaced with deuterated equivalents.\nLimitations in sample production (target quantities)/conditions and availability\n\tNOTE: Isolation or recombinant production of certain biomacromolecules can in certain cases prove challenging and result in limited availability of the target to pursue a successful drug screening campaign. In cases of limited or unlimited availability of the targets, the following alternatives could be utilized for conducting a successful NMR-based fragment screening.\n\t\nIf limited, use 19F-NMR based screening. Typical fluorinated ligands have a single 19F signal; therefore, use cocktails with 25-30 fragments without any signal overlap. There are fewer signals to analyse, no signal interference from buffer components, and fewer signals to rely on for hit identification.\nIf unlimited, use larger screens like 1H-NMR. The larger fragment library can be screened. Typically, fragments are composed of more than one proton, which means more signals to rely upon for the analysis.\n3. NMR acquisition conditions\nIn-house generally defined conditions\n\t\nSpectrometer equipped with HT sample changer (Automation)",
    "For high-throughput screening, use 96-well plates that can only be measured using a HT sample changer. The HT sample changer also offers the possibility to temper each rack individually.\nFor optimal signal-to-noise, use a spectrometer with a cryogenic probe that is either helium or nitrogen cooled. An automated tunning and matching module (ATM) are necessary for automation.\nParameter sets & pulse sequences\n\t\t​NOTE: Many NMR experiments can characterize binding events. The hit identification varies depending on the experimental setup. The following experiments are routinely used in BMRZ screening campaigns. Nevertheless, changes can be made for user defined screening campaigns and according to user specifications.\n\t\t\nIf usingTopSpin software, include the parameter set for ligand-based experiments: SCREEN_STD, SCREEN_T1R, SCREEN_T2, SCREEN_WLOGSY. The parameter set includes all necessary parameters and the pulse sequences: STD: stddiffesgp.3; T1ρ: t1rho_esgp2d; T2: cpmg_esgp2d; and waterLOGSY: ephogsygpno.2.\nFor all the listed experiments, use excitation sculpting13 as water suppression. For a reference, use 1D excitation sculpting (zgesgp). The number of scans depends on the sensitivity of the system (magnetic field strength and probe head), the sample concentration, and choice of the experiment. A recommendation is: 1D with NS=64, T1ρ & T2 with NS=128, STD with NS=256 and waterLOGSY with NS= 384 or 512.\nFor the 19F screening, use both 1D and T2 experiments: 1D: F19CPD (pp=zgig) for 19F{1H}-probe head and F19(pp=zg) for 19F/1H-probe head; SCREEN_19F_T2 (pp = cpmgigsp).\nUse a spectral width of 220 ppm and an excitation frequency at -140 ppm. The experiment time is between 1 and 5 hours (ensure the long-term stability of the biomacromolecule) depending on the hardware and sample concentration. For T2, the CPMG time should alternate between 0 ms and 200 ms.\nProcessing",
    "Record the STD, T1ρ and T2 experiments as pseudo 2D. To process the two single 1D spectra, IconNMR uses the au-program proc_std either with or without the option relax. The first option provides the reference 1D and the difference of two spectra. The second option yields two separate spectra with short and long relaxation time. The waterLOGSY is a single 1D which should be phased with a negative for the solvent signal.\nUser specific conditions\n\t\nAdapt any of the previously mentioned parameters to user-defined conditions. For example, if a facility user-provided protein is not stable at the generally used temperature, optimization experiments can be conducted varying temperature, concentration, buffer conditions etc.\n4. Data Analysis\nFragment library QC (d6-DMSO/specific buffer) and quantification\n\t\nCMC-q\n\t\tNOTE: Quality control of fragment libraries is essential prior to initiation of screening campaigns. Furthermore, long-term stability of fragment library needs to be ensured for the application of several screening campaigns, which is why periodic evaluation of the quality of the library must be conducted. For this purpose, the integrated software CMC-q and CMC-a from TopSpin is used for quality and quantity assessment. The CMC-q and CMC-a are software modules within Topspin which enable smooth acquisition, analysis including structure verification using 1H-NMR spectrum obtained from small organic molecules 9.\n\t\t\nFor integrity, prepare assessment samples with a fragment concentration of 1 mM in d6-DMSO. Prepare samples in an automated manner with a pipetting robot by filling liquid sample collection into a 3 mm NMR-tube.\nFor solubility assessment, use sample consisting of 1 mM compound in 50 mM sodium phosphate buffer at pH 7.4, 150 mM sodium chloride, 90% H2O/ 10% D2O and 1 mM of 3-(trimethylsilyl)propionic-2,2,3,3-d4 acid sodium salt (TMSP-Na).",
    "Collect NMR spectra at 298 K or 293 K using a 600 MHz NMR spectrometer equipped with triple resonance 5 mm TCI cryogenic probe and a HT sample changer, which can handle 579 samples at once.\nFor setting up CMC-q software follow the instructions of the user manual, which implements the creation of an IconNMR user, the activation of FastLaneNMR, and changing the HT sample changer.\nCalibrate the 90° pulse and save it in the TopSpin prosol table.\nPlace the 96 sample well plate in one of the 5 rack positions in the HT sample changer.\nTo load an SDF file (structure data file) that should contain its proposed chemical structure, a unique identifier, and the position in the HT sample changer of each sample in a batch, go to Browse in the CMC-q Setup window and click Open after selecting a file that ends in .sdf.\nIn the CMC.q Batch Automation settings, set the verification type that defines the experiment that will be measured, the IconNMR user and define the Solvent.\nDefine SDF files for the Path for SDF file, the molecule ID and the sample position.\nStart the acquisition by clicking on Start. Click on Start Acquisition again. The CMC-q Setup can also be saved by clicking on Save.\nFor in-detail description of CMC-q setup steps, follow the user manual instructions from Bruker.\nCMC-a\n\t\t\nFor CMC-a, use the software module within Topspin that enables analysis including structure verification using 1H-NMR spectrum obtained from small organic molecules9.\nMixture design",
    "NOTE: A proper mixture design plays an important role for screening using NMR as a platform. A high number of fragments per mixtures allows for faster screening but increases the risk of false positive and negatives. A lower number decreases that risk but increases the time it takes to conduct the screening. In general, a signal overlap has to be avoided when creating mixtures. Using the In-house library, this can be neglected for the 1H screening as the library was specifically designed to be diverse and show little signal overlap while maintaining a high chemical diversity. This in turn means that no special design procedure has to be undergone for creating the 64 mixes.\n\t\nAs the 19F screening relies on the fragments of the in-house library that contain fluorine and the library was not created to reduce the signal overlap for these specific fragments, design a proper mixture.\nMeasure single compound spectra for all fragments containing 19F.\nNote the chemical shift information of each signal.\nAccording to this information, choose 20-21 fragments per mixture. This in turn gives 5 mixtures each containing 20-21 fragments with no signal overlap and allows a semi-automated analysis of the data.\nPerform hit identification within a ligand observed biomacromolecule-ligand interaction\n\tNOTE: There are different definitions of a hit between the 19F and 1H screening procedure. The following hit identifications were set up by us and follow specific rules. The subject of hit determination is a very subjective manner and can differ from user to user. Nevertheless, it is of utmost importance that the rules for hit identification do not change once agreed upon to maintain validation and credibility.\n\t\n1H Screen",
    "To confidently determine hits, acquire 1D 1H spectra, waterLOGSY and T2 relaxation experiments both in the presence and absence of target to identify binders. All three experiments have the potential to show a binding event. If a CSP of greater than 6 Hz is visible in the sample spectra compared to the blank spectra, this is considered as an indication for a hit. The same goes if a strong positive signal in the waterLOGSY as well as more than 30% T2 reduction in the sample spectra is visible. Binding events can be showcased in all three experiments, when comparing the sample containing spectra with their respective blank spectra. However binding events may not be visible in all three experiments. Because of this it was agreed upon that at least two of the before described events must occur in order to classify a fragment as a binding hit.\nUse the FBS tool in TopSpin to define the state of fragments into binding, ambiguous, unknown, aggregates and not-binding.\nWhen finished with a mix, approve it within the FBS tool.\nIn the summary tab within the FBS project, click on Create a screening report. This will open a window that creates a .xlsx file. The user may then opt to choose between all ligands, binding ligand only, not binding ligand only and ambiguous ligands to be reported in the spreadsheet.\n19F Screen\n\t\t\nTo differentiate between non-binder, week-binder, and strong-binder, divide the integration quotient between the 200 ms target measurement and the 200 ms blank measurement by the quotient of the 0 ms target measurement and the 0 ms blank measurement is used:\nimgsrc://cloudfront.jove.com/files/ftp_upload/62262/62262eq01.jpg\n\t\t\tNOTE: This gives values ranging from 0 to ~1 (the hit-score), making it possible to assign thresholds for each binding state.",
    "Use the average of the reference 200 ms measurement as a baseline threshold, to mark cases where the hit-score exceeds 1. This can occur, if the imported integrals contain negative values or the reference measurement is higher than the target measurement. A hit-score of ≤ 0.67 is considered a weak-hit, < 0.33 a strong hit, and anything > 0.67 as no-hit. An example is shown in Figure 2.\nimgsrc://cloudfront.jove.com/files/ftp_upload/62262/62262fig02.jpg\nFigure 2: Hit identification for the 19F screening. Section of 19F CPMG NMR spectra of an exemplary compound. This pictorial representation explains the properties of a binder. 19F-CPMG spectra of a compound acquired of mixture samples in the presence and absence of RNA. The values represent the normed integral values of the corresponding peak. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/62262/62262fig02large.jpg]\nData analysis\n\t\nPrepare data for analysis\n\t\tNOTE: It is important that the acquired data has no visible flaws. This means that data where the shimming was problematic, or water suppression was insufficient should not be considered for analysis. Rather it is recommended to record data again and making sure that everything is fine with the sample (e.g., no air bubbles), with the temperature, the shimming, and water suppression. Data correctness can always be assessed when comparing DMSO signals.\n1H screening\n\t\t\nTo analyse 1H screening data, use the FBS tool (needs additional license) in TopSpin 4.0.9.\nFollow the instructions in the FBS tool manual to start with the data analysis. The following steps summarize the procedure reported in the manual.\nStore the BMRZ NMR data from screening campaigns such that each different screening mixture has its own directory in which a subdirectory holds the different experiments measured on the sample.",
    "For using the FBS tool, store the reference spectra that has all data saved from samples without the biomolecular target but with the mixtures as well as the single compound measured in different /nmr directories. This is important as FBS tool will ask for the directory path of each individually.\n\t\t\tNOTE: The FBS tool will recognize a directory as a screening project if the following datasets were stored in the same directory where the mixtures of a screening sample are stored (csv, FragmentScreen XML documents and BAK file).\nWhen using TopSpin 4.0.9, create a direct path to the directory containing the acquired data, a so-called DIR. Choose the /nmr directory in which all mixtures should have a distinct directory.\nTo start the FBS tool of a screened sample drag the symbol FBS project into the middle of the TopSpin window. In the chosen directory the FBS project symbol should appear if previously said datasets were copied into it.\nThe window Fragment Based Screening Options should automatically open when first loading a new FBS project. In this window choose a cocktail file. The cocktail file is a csv file containing the assignment of the name of the mixes, the name of each fragment and their division into the mixes. Also define a reference ligand spectra folder which has all measured spectra of the single fragments. Lastly, define a reference blank experiment folder, which is usually the folder containing the datasets of the mixes without the investigated target.",
    "The Fragment Based Screening Options has a tab called Spectra types that lets one define the investigated spectra as well as the colour for displaying the spectra. Set the Spectype according to the beforehand processed data. In the Display layout tab, define the spectra that will be compared with each other according to their spectypes.\nPress Ok to start the FBS project.\nWhile looking at the data, a separate window will open, summarizing all cocktail mixes and all ligands of each mix in a table. By double clicking on a cell, the respective datasets will open, comparing for example 1H 1D Blank spectra with the dataset containing the target.\nBefore assigning binders make sure that reference peaks (DMSO of all measurements as well as the single compounds) match with each other and have the same chemical shift. If differences are observed, correct them by using the serial processing option from TopSpin.\nThe serial processing option is under the Process tab under Advanced. It applies changes to all selected spectra from a dataset. This way, Spectypes can easily be assigned to experiment numbers and all spectra can be shifted at once to align with the reference.\n19F Screening\n\t\t\nFor the first analysis of the 19F mixtures, create an integration file for each mix. To define the integration region, click on the Integrate function in the Analyse tab. Make sure that for every fragment in the mixture a clear integration region for the corresponding 19F-singal is defined.\nUse the Save/Export integration regions button to export the integration-file for future use. Save any used integration-files in C:\\Bruker\\TopSpin4.0.9\\exp\\stan\\nmr\\lists\\intrng, or the corresponding path of the TopSpin installation directory.\nFor 19F data, open a dataset either with or without the investigated target.",
    "To load the integration-file into the current spectrum, open the Analyse tab again, go to Integrate and using the Read/Import integration regions button, load the corresponding integration-file. This will load any defined regions of that file into the current spectrum.\nSave and return to find a list of all integrated regions in the Integrals tab. Copy this into a spreadsheet or any other tool used for the further analysis of the data.\nRepeat this procedure for every mix, with and without target.\nData Management\n\t\t\nFor ease of use and productivities sake, have a uniform work-flow set up for the further analysis and storage of the acquired data. For both the 1H and the 19F screening, use a specifically designed spreadsheet for each.\n\t\t\tNOTE: For the 1H screening this was purely used for data management and to summarize each target while for the 19F screening it used the in chapter 4.3 explained quotient to automatically label each fragment as hit/no hit after the integral data was copied into it. This reduces the risk of human error during the analysis, assuming the file was set up properly, and makes sharing of information easier, as all the important information is gathered in one place in a file that can be opened by virtually anyone without the need of further programs for taking an initial look at the data."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}