{
  "id": 10975,
  "origin_website": "Jove",
  "title": "Fabrication and Implantation of Miniature Dual-element Strain Gages for Measuring In Vivo Gastrointestinal Contractions in Rodents.",
  "procedures": [
    "All procedures followed National Institutes of Health guidelines and were approved by the Institutional Animal Care and Use Committee at the Penn State Hershey College of Medicine. Rats were housed using common vivarium practices. Note: This protocol uses male Wistar rats ≥8 weeks of age and initially weighing 175 - 200 g.\n1. Procedures for Fabrication of Strain Gage\nMost tooling and components remain available from the original or successor companies and are summarized in Table 1.\nPreparation and Bonding of two single element strain gages\n\t\nHandle the strain gage elements (EA-06-031-350) carefully with clean Dumont #5 forceps. To limit unwanted movement of elements, use a small, clean, self-adhesive piece of paper with the adhesive side facing up to secure elements to the work surface without the risk of contamination or excessive adhesion.\nBond two single strain gage elements back-to-back, to form a dual element. Clean the back of each element film with Isopropyl alcohol and allow drying by evaporation (drying with gauze often introduces fiber contaminants that are difficult to remove). Under stereomicroscope guidance (1 - 3x), and using a clean artist brush (10-0 camel hair), apply a thin film of epoxy-phenolic adhesive to the back of one element and immediately place the opposing back of the second element in contact and align the foil grids (Figure 1A).\nPlace the bonded elements in a 50 - 60 °C oven O/N to fully cure the epoxy.\n\t\tNOTE: Do not clamp the bonded elements since excess epoxy may seep onto the elements and pressure may cause misalignment of the grids. The two-part epoxy has a usable refrigerated-life of only 6 weeks after mixing. Bond and cure a sufficient supply of elements at one time and store them in a clean, dust free, environment for later use.",
    "Sizing and wiring dual element strain gages\n\t\nTrim bonded dual elements to a final size of 3 x 3 mm with a #11 scalpel or single edge razor blade. Delay trimming the topmost portion of the dual elements at this time in order to have an area for safely handling the element (Figure 1A).\nEach element requires a four-conductor wire fabricated from three-conductor, bondable, Teflon insulated wire (P/N 336-FTE). Disassemble one 30 cm braided strand of three-conductor wire into three constituent wires.\nTo make a four wire cable, pair one of the resulting single wires with the like-colored wire contained within a second 30 cm length of three conductor wire. In the following steps, these matching colored wires will be joined at the terminal end to form a common wire for the final strain gage (Figure 1B).\nRemove approximately 1mm of Teflon insulation from both ends of each wire with thermal wire strippers. Using activated rosin soldering flux and low temperature solder (melting point 183 ºC) tin the wire ends with a soldering pencil.\nFor the next stage, a microsoldering tip is needed to form a more discrete solder joint to prevent heat damage to the film layer of the element (Figure 1C). To fabricate a smaller microsoldering tip, wrap a small piece of copper wire (~0.25 mm diameter) once around the standard soldering tip, ensuring that the copper wire extends beyond the length of the standard soldering tip.\nFlux just the solder pads on one side of the bonded dual element with a clean 10-0 brush and solder one single lead and one of the paired common leads to the solder pad (Figure 1D). Residual flux can be removed afterward with a clean brush dipped in resin solvent.",
    "Repeat the process on the opposite side, ensuring that the remaining common wire lead is soldered to the pad opposite the original common lead.\nTesting and epoxying dual element strain gages\n\t\nSolder gold socket connectors (E363/0) to the free ends of the wire leads. At this point, connect the strain gage to a recording amplifier (described below) to test the integrity of the dual element assembly.\nMeasure the resistance with a good quality volt-ohm meter. Elements register a resistance of approximately 350 Ω. Resolder inadequate connections at this point with fresh solder.\nIf the solder connections and the dual element assembly are deemed satisfactory, trim off any remaining element film.\nInsulate the solder joints on the element solder pads with a thin layer of two-part silicone-rubber epoxy resin (P/N E211). For best results, partly cure the resin for 20 - 30 min prior to application (Figure 1E).\nEncapsulating dual element strain gages in silicone\n\t\nCut three pieces of 0.5 mm thick silicone sheet (P/N 20-20) to 15 mm 2 and clean the silicone with distilled water. Cut one piece of silicone sheet into a U-shape in order to accommodate the final dual element assembly without deforming the encapsulating silicone (Figure 1F).\nCoat the inner surfaces of the notch-free silicone sheets with clear silicone adhesive.\nSandwich the dual element assembly within the notch and the aligned outer sheets, then gently press out any excess silicone, as well as air bubbles, from the center outward. Carefully clamp the encapsulated assembly between two blocks of metal bar stock for 24 hr to ensure uniform thickness and that no deformations occur.",
    "Allow the excess silicone to remain along the boundaries of the assembly and cure. This excess will be removed when the sheet silicone is trimmed to the desired final dimensions (commonly 6 mm x 8 mm; Figure 1G).\nCompletion of wire connector and calibration\n\t\nReinforce the solder joint of the gold socket connectors on the individual terminal wire leads with 3 mm (1/8 inch) shrink tubing and align within a plastic electrode pedestal (MS363, Figure 1H). Secure the electrode pedestal and wires with 0.125 and 0.25 inch diameter shrink tubing to prevent disconnection during the experiment (Figure 1I).\nStrain gage signals are processed through a high gain bridge amplifier (P/N AMP-01-SG). Connect the strain gage to the amplifier using a cable with a mated plug (363 - SL/6) to match the electrode pedestal. The threaded cap provides additional security to maintain uninterrupted signals during the experiment.\nAdjust the Bridge, Balance and Gain settings on the amplifier to a dedicated strain gage per manufacturer instructions. Affix the end of the strain gage where the wires exit horizontally to a rigid clamp and calibrate by placing a 1 g static load on the opposite end as originally described by Pascaud and colleagues 2, 16, 17.\n2. Surgical Procedures for Acute Implantation of Strain Gage\nAnimal Care and Preparation:\n\t\nFood deprive experimental animals the night before surgical implantation (water may be provided ad libitum).\nDeeply anesthetize the animal. Thiobutabarbital (100 – 150 mg/kg; i.p. for rats) is preferred for terminal (i.e., non-survival) strain gage implantation and experimentation due to sustained anesthetic effect and minimal alteration of gastric reflexes in the rat 10. Test for absence of paw pinch reflex to determine depth of anesthesia.",
    "Prepare the rat for aseptic surgery as dictated by the experimental design and approved IACUC guidelines including sterilizing surgical tools, shaving incision sites, applying vet eye ointment and disinfecting all surgical areas. NOTE: If the strain gage is being adapted for chronic use, sterilize the the strain gage only with ethylene oxide (gas) sterilization. The use of heat or chemical sterilization techniques may damage the strain gage.\nTracheal intubation for terminal experiments:\n\t\nFor long duration, terminal, experiments intubate the rat with a tracheal tube to maintain an open airway. Make a 1 - 2 cm midline incision on the ventral side of the neck from the inferior border of the mandible to the sternal notch.\nSeparate the underlying strap muscles using blunt dissection at the midline to expose the trachea. Isolate the trachea from the underlying esophagus and place a loop of 3-0 ethilon suture between the trachea and esophagus to form a ligature.\nOpen the trachea anteriorly by making a small incison in the membrane between two of the cartilaginous rings of the trachea just distal to the thyroid gland. Insert a small piece of polyethylene tubing (P/N PE-270), 5mm in length (and beveled at one end) into the trachea and secure it into place with the ligature.\nPut the strap muscles back in place and suture the overlying skin with 3-0 ethilon.\nStrain gage instrumentation to gastrointestinal surface:\n\t\nThread the four corners of the strain gage with 4 - 5 cm lengths of 4-0, or smaller, sterile silk suture using a #14 taper point 3/8 circle needle prior to surgery. Silk suture provides a high level of flexibility and is less likely to damage the silicone encapsulating the strain gage element.",
    "NOTE: silk thread is acceptable for non-survival surgeries and for internal applications, where the wicking of bacteria across an epithelial barrier is not a risk. In applications requiring survival surgery, a prolene suture is necessary in order to reduce the risk of infection inherent in the braided cloth fibers of the silk suture.\nPerform a laparotomy by incising the abdominal skin along the midline. Section the rectus abdominus musculature along the connecting linea alba (avascular) to prevent bleeding. Then make a very superficial midline incision in the parietal peritoneum to avoid lacerating underlying abdominal viscera.\nExteriorize the stomach with the aid of saline soaked cotton tipped applicators. Keep the stomach in position by carefully placing it on a saline soaked gauze pad at the caudal end of the abdominal incision.\nAlign the grid of the encapsulated strain gage in parallel with the circular smooth muscle fibers. Using the previously threaded sutures (step 2.3.1), attach the corners of the gage to the ventral serosal surface of the gastric corpus using a #14 taper point 3/8 circle needle. In order to minimize tissue damage and potential bleeding, do not use cutting-edged needles and do not perforate any superficial blood vessels on the surface of the stomach.\nBegin the suture pattern of the gage along the greater curvature of the stomach near the fundus/corpus boundary and proceed next along the fundus/corpus boundary toward the lesser curvature. The serosa underlying the strain gage should neither be slack nor overly stretched in order to obtain the best results.\nCarefully return the stomach to its anatomical position using saline-soaked cotton tipped applicators.",
    "In an acute model, exteriorize the strain gage leads at the caudal end of the midline incision before closure of the abdominal incision. Secure the free wires to the animal (e.g., hind foot) in order to provide strain relief during manipulation of the animal or terminal wire connector. Close the rectus abdominus muscles and the abdominal skin separately with 3-0 nylon suture. In a chronic model, secure the leads subcutaneously along the dorsal side of the rat and exteriorize them above the skull 18.\nAfter surgical instrumentation, place animals in a stereotaxic frame to support the head and elevate the upper torso. The latter step helps to reduce respiration artifact during recording. Monitor rectal temperature and maintain at 37±1 °C using a feedback-controlled heating pad.\nAt the conclusion of terminal experiments utilizing thiobutabarbital anesthesia, the animal must be euthanized in a manner consistent with American Veterinary Medical Association (AVMA) Guidelines on Euthanasia.\nGastric Motility recordings:\n\t\nAmplify the strain gage signal with any commercially available DC bridge amplifier.\nRecord the DC output signals on a computer using the chart recorder function of any commercially available data acquisition system.\n\t\tNOTE: A hardcopy of the amplifier output can be generated through a polygraph chart recorder.\n3. Representative Measurement of Gastric Contractions Following Brainstem Stimulation\nExposure of brainstem and fourth ventricle\n\t\nAfter surgical instrumentation, and placement of the Thiobutabarbital-anesthetized animal in a stereotaxic frame, make a 1.5 - 2 cm midline skin incision from the occipital bone toward the base of the neck.\nSeparate the connective tissue joining the bilateral muscle bellies of the underlying neck muscles along the midline (muscles from superficial to deep are levator auris longus cranial portion, levator auris longus caudal portion, and platysma cranial portion).",
    "Detach the levator auris longus from the occipital bone once the midline is clearly defined and exposed.\nCarefully expose the caudal region of the skull by using blunt dissection to detach platysma muscle from the underlying dura mater.\nUse a new 25 G needle to carefully detach the dura mater along the foramen magnum extending bilaterally to the occipital condyles.\nUse #5 Dumont forceps to remove the pia and arachnoid meninges overlying the fourth ventricle and expose the brainstem.\nAdministering fourth ventricle thyrotropin releasing hormone or intravenous sodium nitroprusside\n\t\nWeigh and dissolve thyrotropin releasing hormone (TRH) in sterile saline to reach a final concentration of 50 µM TRH.\nWeigh and dissolve sodium nitroprusside (SNP) in sterile saline to reach a final concentration of 150 µM SNP.\nUsing a 10 µl syringe, administer 2 µl of TRH (final dose equals 100 pmol) to the dorsal surface of the brainstem fourth ventricle to facilitate recording of gastric contractions.\nUsing a sterile syringe and 27 G needle, administer 150 µmol/kg of SNP through the tail vein to facilitate recording of gastric relaxation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}