{
  "id": 2106,
  "origin_website": "Cell",
  "title": "Two-color in vitro assay to visualize and quantify microtubule shaft dynamics",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nTubulin incorporation assay\nTiming: 45 min for preparation, 20 min for imaging\nIn this assay, tubulin dimer exchange along the GDP-microtubule shaft can be visualized, by sequential exchange of tubulin labeled with different fluorophores (Figure 3[href=https://www.wicell.org#fig3]). The impact of proteins, small molecules, buffer conditions, or temperature on microtubule shaft dynamics can be studied with this assay.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1590-Fig3.jpg\nFigure 3. Experimental set up of the incorporation assay:\nI) Microtubules polymerize form double stabilized GMPCPP/Taxol- seeds in the presence of tubulin 8 μM (20% labeled); II) Stabilizing dynamic GDP-microtubules with a GMPCPP-Cap. Exchange of nucleotide from GTP to GMPCPP and free tubulin 5 μM (70% labeled); III) Incorporation condition with 9 μM tubulin (100% labeled different color). At this step proteins, small molecules, temperature, ion strength, pH… can be varied to study their effect on shaft dynamics; V) Depolymerization of all dynamic structures grown on top of the microtubule in BRB with no tubulin; V) Stabilizing the microtubule for imaging with 8 μM black tubulin.\nAssemble a flow chamber as described above.\nPrepare anti-bleaching buffer 3× stock (30 mM DTT, 0.9 mg/mL D-glucose, 0.3 mg/mL glucose oxidase, 0.06 mg/mL catalase, 0.375% methyl cellulose) in BRB80 1× (100–200 μL) and keep it on ice.\nThaw on ice: 1 aliquot of ATTO-488-labeled tubulin, 1 aliquot of ATTO-565-labeled tubulin and 1 aliquot of black tubulin.\nNote: Once on ice, tubulin can be used for several experiments, but needs to be used within 2 h after thawing.\nThaw seeds at 37°C for 2 min. Transfer to 24°C. Seeds can be kept 24°C and used for 4 h.\nNote: In order to mix tubulin and seeds aliquots it is recommended to tap the bottom of the cryotube, or pipet, never vortex.",
    "Flow in 100 μL of 50 μg/mL neutravidin in BRB80 1× into the flow chamber. The neutravidin will bind the biotin present on the coverslip surface. Through the binding to neutravidin, biotinylated seeds will attach to siPEG-biotin.\nNote: Use a yellow tip to flow solutions into one side of the channel and kitchen paper on the opposite site to perfuse the solutions into the chamber.\nCritical: Avoid introducing air bubbles to the flow chamber. Air bubbles can detach components bound to the glass, disrupt the flow of the introduced solutions and cause oxidation. Microtubules will not polymerize where an air bubble passed.\nNote: To avoid drying out of the reaction chamber, leave few drops of the reaction mix at both sites of the flow chamber in all of the following incubation steps.\nIncubate for 3 min at 24°C.\nNote: For seed dilution and washing steps, store an aliquot of BRB80 1× at 24°C.\nWash out neutravidin with 1 × 100 μL BRB80 1× (at RT).\nFlow in 100 μL of GMPCPP-seeds diluted in BRB80 1× (e.g., dilute seeds 100-200-fold).\nCritical: To pipet seeds, cute the tip of the yellow tip, to minimize shearing microtubules into smaller fragments.\nWash out non-attached seeds with 3 × 100 μL BRB80 1× containing 0.2% BSA.\nNote: For all the following steps to avoid dilution, dry the entry of the flow chamber with paper before you flow in the new buffer.\nPrepare 30 μL of Elongation buffer with 8 μM tubulin (20% ATTO-488-labeled, 80% black), 10 μL of anti-bleaching buffer and 1 mM GTP in BRB80 1× 0.2% BSA and flow it through the chamber.\nIncubate for 15 min at 37°C in a closed and humidified chamber (e.g., square Petri Dish with wet tissue) to allow microtubule to polymerize.",
    "Note: In our hands the optimal condition to get microtubules with an average length of 10 μm was 15 min of polymerization reaction at 37°C using 8 μM tubulin. To reach the desired microtubule length, incubation time and tubulin concentration can be adapted.\nTo cap microtubules, flow in 30 μL of pre-warmed Capping buffer containing 5 μM tubulin (70% ATTO-488-labeled, 30% black) in BRB80 1× supplemented with 0.5 mM GMPCPP.\nNote: Stabilizing the dynamic microtubule tip with a GMPCPP-microtubule cap enables to study GDP-shaft for at least 45 min, while the microtubule is protected from depolymerization. We use 70% labeled tubulin to be able to differentiate under TIRFM the GDP-microtubule (20% labeled) from the GMPCPP-cap.\nCritical: Pre-warm the capping solution to 37°C for 30 s. Keep the flow chamber at 37°C, while perfusing the mixture to prevent microtubule depolymerization.\nIncubate for 12 min at 37°C.\nWash one time with 100 μL of BRB80 1× + 0.2% BSA that is pre-warmed to 37°C.\nFlow in 30 μL of Incorporation buffer containing 9 μM tubulin (100% ATTO-565-labeled) in BRB80 1× supplemented with 0.2% BSA, anti-bleaching buffer and 1 mM GTP.\nNote: To study which parameters impact shaft dynamics, you can add your protein or molecule of interest at this step. You can incubate between 1 – 45 min depending on your research question. To study how kinesin-1 impacts shaft dynamics, we incubated for 15 min.\nCritical: Pre-warm the incorporation solution at 37°C for 30 s. Keep the flow chamber at 37°C, while perfusing the mixture to prevent microtubule depolymerization.\nIncubate for 1–45 min at 37°C.\nWash one time with 200 μL BRB80 1× + 0.2% BSA in the absence of tubulin and incubated for 1 min at 37°C. This incubation time is sufficient to depolymerize all dynamic structures beyond the GMPCPP-cap.",
    "Flow in 30 μL of Imaging buffer containing 6 μM tubulin (100% black) in BRB80 1× supplemented with 0.2% BSA, anti-bleaching buffer and 1 mM GTP.\nNote: Addition of 6 μM tubulin protects microtubule from breaking and elongates the imaging time.\nSeal both openings of the chamber with sealing wax (e.g., haematocrit sealing wax from Hecht Assistant).\nImage with TIRFM (e.g., Axio Observer Inverted TIRF microscope (Zeiss, 3i) and a Prime BSI (Photometrics)):\nWarm the 100× objective before starting the imaging (e.g., Chamlide Live Cell Instrument incubator to keep the temperature constant during the experiment).\nVerify that the flow chamber is well sealed, and clean the coverslip with ethanol and a wipe.\nPlace the chamber in the stage, so that the coverslip faces the objective.\nSet several positions. Choose positions where microtubules are grown from seeds, do not contact each other, and are capped with a GMPCPP-cap (Figure 4[href=https://www.wicell.org#fig4]). We take between 10 – 20 positions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1590-Fig4.jpg\nFigure 4. Whole field of view of a representative position imaged\nOnly isolated microtubules grown from a seed (green) and capped by GMPCPP (magenta) were analyzed (white arrowhead). Scale bar 10 μm.\nRecord each position over 5–10 frames. Within this time frame microtubules should fluctuate (Figure 5[href=https://www.wicell.org#fig5]). Only analyze fluctuating microtubules, this decreases the possibility that microtubule - surface interactions impact shaft dynamics in your experiments.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1590-Fig5.jpg\nFigure 5. Representative tubulin incorporation site (cyan) along a GDP-microtubule (magenta; 20% labeled) grown from a seed (green) and capped by a GMPCPP-microtubule (magenta; 70% labeled).\nWhite arrowhead shows an incorporation site, yellow arrowhead shows an aggregate on the coverslip. Right: time projection (max intensity) of 3 subsequent images of a single fluctuating microtubule. Scale bar 2 μm.\nNote: The imaging frame rate depends on how many positions are imaged, but should not exceed 2 min.",
    "Critical: Imaging for several frames enables to differentiate whether the measured signal is an incorporation site moving with the microtubule, or an aggregate on the surface. Microtubules sticking to the surface of the coverslip are excluded from analysis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Protein Biochemistry",
    "Biophysics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}