{
  "id": 4237,
  "origin_website": "Cell",
  "title": "An antigen microarray protocol for COVID-19 serological analysis",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMicroarray printing\nTiming: 10 h\nAlternatives: This protocol describes the use of an antigen microarray incorporating 64 microarray slides printed with microarrays of 8 by 8 spots (Figure 1[href=https://www.wicell.org#fig1]). Alternative formats can be used such as 24, or 16 and 8 microarray slides allowing for the increase in targets included on each microarray though requiring the reduction of samples assessed per microarray slide. The provided bioinformatic application can be adjusted to facilitate the design of such arrays.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Fig1.jpg\nFigure 1. Example of a 64 array with 8 × 8 matrix\nAlternatives: This protocol describes the utilization of a GeSim Nanoplotter 2.1 for the production of microarrays. Other contactless and contact printers are available and can be utilized as an alternative following the operation instructions of the Nanoplotter available.\nIn this step, the user will prepare the antigen microarrays. This includes setting up the GeSim Nanoplotter, running a ‘warm-up’ test print and preparing of a ‘Print Plate’ with the antigens of interest.\nSet up the GeSim Nanoplotter 2.1. for printing.\nPreparing the GeSim Nanoplotter 2.1 for printing.\nTurn on the nanoplotter.\nTurn on the chiller to cool the printing surface to 17°C.\nTurn on the humidifier to 60% relative humidity.\nWait for 1 h for the print environment to stabilize.\nSwitch on the computer and launch the NP2.1 software.\nUnder “System” select “Initialize Nano-Plotter” allowing it to run through its start-up processes.\nWhilst in “Interactive mode” under “Work Plate” select “Open Work Plate settings” and load a work plate file ∗.npw (Data S1[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Mmc1.zip]) describing the physical layout of the nanoplotter with slides detailing 64 microarrays per slide with a 8 by 8 grid layout matching the dimensions of the 64 microarray ONCYTE® SuperNOVA.\nPlace glass slides in the nanoplotter for a ‘warm-up’ print run.",
    "Fill column A of a 384 square well plate with 1× Print Buffer to create a print plate.\nPlace the prepared print plate on the nanoplotter and select as “usable” by right clicking the corresponding location in the GeSIM software.\nPlace one (or more) blank glass slide onto the slide deck of the nanoplotter and select as “usable” by right clicking the corresponding location in the GeSIM software.\nRun a ‘warm-up’ print run.\nMake sure the software is in “Run” mode.\nUnder “Program” select “Run NPL-Application”.\nSelect a “TransferSimMultiPlates_06A1” program with default parameters and the ‘Print Plan’ provided as Data S2[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Mmc2.zip] or prepared using the provided R-based Shiny Software provided.\nNote: A visual inspection of the printed slides can be done by eye to ensure correct printing by holding the slide to the light. Printed arrays should form an aligned grid of droplets without missing positions. If the piezoelectric tip has not been in use for some time, the tip is dirty or has degraded, then droplets may not emit from the piezoelectric tip reproducibly or may emit with an unacceptable diffraction. Such issues are commonly observed after a period of inactivity of a few day but are resolved after 2–3 blank print runs.\nPrepare a ‘Print Plate’ from which microarrays will be printed (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Fig2.jpg\nFigure 2. Schematic of print plate layout along with corresponding array layout using the provided print plan and print design\n(A) Layout of the print plate. 20 antigens and their dilutions are placed in alternating positions as indicated by the different colors.",
    "(B) Arrangement of the antigens on the microarray. Antigen from the print plate has the same color in the microarray arrangement. The 20 antigens included can be seen in different colors, each represented by three spots. The different sizes are representing different dilutions. Layout of the array is randomized to prevent spatial effects. If a new print plan and print design was produced by the provided shiny-based application, the layout would be altered correspondingly.\nPrepare a solution of 1× Print Buffer by diluting 10 mL of 2× Print Buffer with 10 mL ddH2O and add to a pipette basin.\nUsing a 16-channel pipette dispense 50 μL of 1× Print Buffer to columns 3 to 6 of a 384 square well plate.\nNote: These columns contain the diluted antigens and location is based on the print plan assuming a dilution shift of 32.\nDilute each antigen with 50 μL of 2× print buffer before transferring sequentially down column 1 and 7 of a 384 square well plate.\nUsing a 16-channel pipette prepare a serial dilution of the antigen by aspirating 25 μL from column 1 and mix in column 3. Mix by pipetting 50% of the solution 5 times in the same tip avoiding foam creation.\nRepeat this procedure from column 2 to 4. Then using fresh tips from 3 to 5 and 4 to 6.\nAdd Immunoglobulin controls to the print plate.\nDilute immunoglobulins G, M and A with 50 μL print buffer and add to wells A24, B24 and C24 respectively.\nTransfer 25 μL of immunoglobulins added to the print plate above and mix into well D24.",
    "Pause point: Once the print plate is prepared, it can be sealed using an adhesive Aluminium StarSeal attached to the top of the 384 square well plate and stored at −20°C for later use or after a print run for re-use in a subsequent print run.\nPrepare ‘Print Plan’.\nTo print the microarrays using a GeSim Nanoplotter a print plan must be created describing the arrangement of spots for the microarray printer to print. An example file is included in Data S3[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Mmc3.zip].\nOptional: Different arrangements of the antigens can be created using the R-based Shiny tool provided.\nLoad the nanoplotter.\nIf the print plate was frozen before the print, place the plate on ice to thaw for 15 min on ice.\nCentrifuge the print plate at 100 x g for 5 min at room temperature (18°C–24°C).\nRemove the aluminium cover placing on the print plate of the Nanoplotter and selecting as “usable” in the GeSIM software.\nPlace as many ONCYTE® SuperNOVA 64 pad slides as desired for the print run onto the Nanoplotter. Push each slide to the top right corner of the stops so each slide consistently aligns and select as “usable” in the GeSIM software.\nRun the nanoplotter.\nWhilst in “Run” mode under “Program” select “Run NPL-Application”.\nSelect a “TransferSimMultiPlates_06A1” program with default parameters and the ‘Print Plan’ that was prepared above.\nRemoval of printed microarrays.\nRemove printed microarrays and store at 4°C.\nNote: Printed microarrays should be left for at least 12 h at 4°C until the spots are fully absorbed by the nitrocellulose surface.\nPause point: The printed microarrays can be stored at 4°C for up to a month. Do not freeze!\nMicroarray staining\nTiming: 5 h",
    "This section describes the preparation of the serum samples for the analysis. The antigen microarrays are blocked before incubation with the patient sera. Following the incubation step, the microarrays are washed. Finally, the bound antibodies are detected with a fluorescently labeled secondary antibody and read on a scanner.\nPrepare a control mixture.\nPool together a representative pool of positive patient sera for the cohort being investigated to create a positive pool control for the cohort. The positive control pool will serve as the positive reference. Create 100 μL positive control pool aliquots and store them at −20°C for up to one year or longer at −80°C.\nPool together multiple negative patient sera to derive a negative pool control for the cohort. The negative control pool will serve as the negative reference. Create 100 μL negative control pool aliquots and store them at −20°C.\nNote: The experimenter has to ensure that the positive and the negative pool are representing valid controls for the experiments. In the presented example the positive sera pool was collected from patients who were tested positive in a Covid-19 PCR test. The negative pool was assembled at an early stage of the COVID-19 pandemic, where exposure to Covid-19 can be assumed to be low.\nThe microarray contains additionally four other human Corona virae (HCoV). For these samples the negative pool will generate still signals as virus infections with HCoVs are common. For these samples a proper negative control would be the “no serum” control.\nOptional: Reconstitute pre-2019 normalized human serum and dispense into 50 μL aliquots.\nPrepare a sample plate of serum samples (Figure 3[href=https://www.wicell.org#fig3])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Fig3.jpg\nFigure 3. Schema of the layout of a sample plate\nDesigned to accommodate 96 serum samples and to be processed on two 64 array antigen microarrays.",
    "Note: The antigen microarrays slides have 4 columns of 16 arrays allowing 64 sera assessments per slide. Reserving 16 arrays per slide for controls, a collection of 48 serum samples can be assessed per slide. Figure 3[href=https://www.wicell.org#fig3] shows an example layout optimized for the transfer of half of a 96 well sample plate/box to form a sample plate.\nUsing a 16-channel pipette, add 190 μL of TBS-T with 10% FBS to the first 8 odd-numbered columns of a 384 Well Deep Well Plate (Corning, Cat#3342).\nAdd 10 μL of the negative pool to wells of row M previously loaded with buffer mixing by pipetting up and down gently 5 times.\nAdd 10 μL of the positive pool to wells of row N previously loaded with buffer mixing by pipetting up and down gently 5 times.\nAdd 10 μL of normalized human serum to wells of row O previously loaded with buffer mixing by pipetting up and down gently 5 times.\nAdd 10 μL of up to 96 serum sample to be assessed to rows A-L previously loaded with buffer mixing by pipetting up and down gently 5 times. If using samples stored in a 96 well/box format samples can be transferred using an 8 channel pipette rotated as shown in Figure 3[href=https://www.wicell.org#fig3].\nAdd aluminum foil tape to the top of the plate to seal.\nPause point: After preparation of the sample plate, the plate can be stored at −20°C for up to 3 months, allowing the processing on a subsequent day. If the sample plate is to be used on the same day it should be stored at 4°C to avoid freeze/thaw cycles.\nBlock antigen microarrays",
    "To measure the different immunoglobulins (IgG, IgA, IgM) of the patient sera use three antigen microarrays per Immunoglobulin. Place each into a separate chamber of a quadriPERM® 4 - slide plate.\nGently add 4.5 mL TBS-T and place on a gentle rocker for 30 min.\nRemove TBS-T buffer.\nGently add 4.5 mL Print Buffer with 10% FBS and place on a gentle rocker for 30 min.\nRemove Print Buffer with 10% FBS buffer.\nGently add 4.5 mL TBS-T with 10% FBS and place on a gentle rocker for 60 min.\nAttach ProPlate (Figure 4[href=https://www.wicell.org#fig4])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Fig4.jpg\nFigure 4. Image of the antigen microarray slide, ProPlate® multi-well chambers 64 well slide, spring clips and ProPlate® multi-array slide system\nClipping the ProPlate on the Antigen microarray slide creates wells, which can be used for the incubation with different sera.\nCritical: It is important that the slides are not drying out during the incubation. Use one slide at a time to ensure rapid processing (see troubleshooting[href=https://www.wicell.org#troubleshooting] point number 5 for further details).\nRemove the slide from the blocking plate and add a 64 well ProPlate on top of the slide aligning the nitrocellulose pads and the wells of the ProPlate. Keeping the Slide Tab to the upper right corner.\nAdd the spring clips and ensure the wells are still well aligned with the slide pads.\nPlace the slide with ProPlate frames into the ProPlate Tray maintaining the tab to the top right corner.\nUsing a 16-channel pipette add 40 μL TBS-T with 10% FBS.\nSerum incubation\nCritical: Handling of serum must be carried out in appropriate safety conditions for primary human samples such as serum.\nIf the sample plate was frozen prior to use, place at 4°C until thawed.",
    "For each antigen microarray slide transfer 10 μL of sample from four columns of the sample plate prepared in step 8. Add aluminum foil tape to the top of each slide to seal.\nIncubate slides for 3 h on a rocker at room temperature with gentle agitation.\nReturn the sample plate to the −20°C unless the second batch of three slides is being assessed concurrently.\nRemove Serum\nUsing the 16-channel pipette set to 100 μL, remove the majority of fluid from each well.\nUse the “pipette and mix” function to add 50 μL TBS-T to each well, cycling 25 μL 3 times to mix the well-contents.\nRepeat steps 14a and 14b for a total of 3 times to exchange the fluid.\nUsing the 16-channel pipette set to 100 μL remove the majority of fluid from each well.\nRemove the ProPlate transferring the slide into a quadriPERM® 4 - slide plate.\nGently add 4.5 mL TBS-T.\nExchange the buffer in the plate for fresh TBS-T. Incubate for 3 min on the rocker with gentle agitation.\nRepeat the previous step for a second incubation.\nExchange the buffer in the plate for fresh TBS-T 10% FBS.\nDetection antibody staining\nImmediately prior to use prepare the detection antibody by adding 30 μL of the selected detection antibody (IgG, IgM, IgA) to 12 mL of TBS-T 10% FBS.\nGently add 4 mL of the prepared detection antibody and place on a rocker with gentle agitation for 30 min at room temperature. Cover to protect from light.\nRemove antibody solution from the plate and gently add 4mL of TBS-T.\nRemove TBS-T from the plate and gently add 4mL TBS-T. Incubate on the rocker for 3 min.\nRemove TBS-T from the plate and gently add 4mL TBS.",
    "Remove TBS from the plate and gently add 4 mL TBS. Incubate on the rocker for 3 min.\nRemove slides from quadriPERM® 4 - slide plate placing into a 50 mL tube. Gently fill with ddH2O close and invert gently 5 times.\nRemove the slide from the 50 mL tube careful not to touch the microarrays and blow-dry with a gentle stream of nitrogen.\nPause point: After drying, the slides may either be scanned immediately or stored in the dark at 4°C until ready to scan. Scanning up to 7 days later has a negligible effect on quantification.\nSlide scanning\nTiming: 2 h\nIn this section the stained slides are scanned. Scanning is performed across several detection gains to cover a wide range of binding conditions. After scanning, the intensities are quantified through the image recognition software.\nPrepare Scanner.\nLoad the Mapix Software and switch on the InnoScan 710 Microarray Scanner.\nConnect the Mapix software to the scanner selecting “Scanner>Connect”.\nGently insert a validation slide into the instrument and select “Scanner>Check Scanner” to validate the current performance of the scanner.\nNote: The Scanner takes some time to warm up to the working temperature. Running the validation slide 15 min before the first analysis slide is advantageous allowing the scanner’s temperature controls to normalize.\nPrepare a batch method.\nOpen the batch editor to begin sampling multiple gains. “Batch>Batch editor”.\nOpen an existing method (an appropriate ∗.mbt is provided in Data S4[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Mmc4.zip]).\nAlternatively, a new batch method can be created.\nOptional: Creation of a new batch method:\nSelect Add Scan Step.\nUnder “Scan Parameters”.\nSelect slide layout as “Nitrocellulose 1 Pad slide”.\nClick “Set scan area”.\nSelect pixel size as “5.0”.\nSet Speed as “35”.\nSet Scan Mode as “Normal”.\nSet Detection as “Smooth”.\nSet Acquisition Mode to “785 only”.",
    "Set the Gain as 0.\nSet Laser power to “high”.\nUnder “Filename & Directory”.\nProvide an appropriate filename for the scan.\nProvide a folder where the scan should be saved.\nSelect “Export folder to all steps”.\nNext to step 1 on the step list click to duplicate the step. This will duplicate the parameters so only the gain needs to be changed within each step. Gains of 0,1,5,10,20,25,50,75 and 100 were used to record the data provided here.\nScan slides.\nGently insert the analysis slide to be scanned into the scanner with a tab to the front right as orientated when loading the samples.\nA preview scan of the slide can be performed to visually assess the staining of the slides by selecting “Scanner>Preview whole slide”.\nRun the batch method by opening and selecting “Start”.\nUpon completion of all steps of the batch scan method, the slide can be returned to the dark at 4°C for potential rescan. An example of a scanned array is provided in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Fig5.jpg\nFigure 5. Example slides of an antigen microarray scanned at a gain of 50\nLayout of serum on showing inclusion of 48 serum samples with controls NP (Negative Pool), PP (Positive Pool), NS (Normalized Serum), AB (RBD antibody) and B (Blank).\nQuantify Images.\nOpen the batch editor of Mapix.\nNote: The Scanner does not need to be on whilst processing analysis steps.\nClick “Add Analysis Step”.\nUnder “Quantification”.\nSelect an appropriate GAL file. This can be obtained from the Nanoplotter. An appropriate file for the 64 array format used here is provided as Data S5[href=https://prod-shared-star-protocols.s3.amazonaws.com/protocols/993-Mmc5.zip].\nUnder “find all automatically” select “Grid + Block + Spots”.\nUnder “Gridding” set max position offset (% pitch)” to 30 “Min. Diameter (% Dth)” to 50 and “Max. Diameter to (% Dth)” to 200.",
    "Under “Photometric calculations” set “S/B border width (pixels)” to 2 and “Background calculation” to “Locally” with “Background diameter (pitch)” set to 2.\nUnder “Save results” select “File Format” to “Mapic Results files (∗.txt)” selecting “All blocks in a file” with desired number format.\nIf the desired select “Save a JPEG image containing analyzed spots”.\nUnder “Files”.\nSelect the ∗.tif images of the scanned arrays.\nRun the batch method by selecting “Start”."
  ],
  "subjectAreas": [
    "Immunology",
    "Bioinformatics",
    "Antibody",
    "Health Sciences",
    "Proteomics",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}