{
  "id": 18225,
  "origin_website": "Jove",
  "title": "Cardiopulmonary Bypass in a Mouse Model: A Novel Approach",
  "procedures": [
    "All animal experiments were performed in compliance with the German Animal Protection Law (TierSchG) and were approved by the local animal welfare committee (Lower Saxony State Office for Consumer Protection and Food Safety, Protocol TSA 14/1556). The minimal weight of mouse suitable for this model is 25 g.\n1. Preoperative Preparations\nNOTE: All procedures are carried out under clean, non-sterile conditions, with autoclaved instruments.\nPlace 50-60 8-cm long propylene hollow fibers in parallel in a tube and connect with a T-adapter on both sides. Fill the space between the hollow fibers and the external branch of the T-adapter with glue.\nAllow at least 24 h for the glue to harden. Cut the hollow fibers extending out from the T-adapter using a standard microtome and pull the silicone tube over to the connection sites.\nInsert a 27 G metal needle (from a 26G branule) into a 2 Fr polyurethane cannula. Use a surgical blade and micro-scissors under a microscope (8-12X magnification) to make three to four fenestrations of about 0.15 cm each within the distal third of the cannula to assure optimal venous return flow.\nRemove the wire when completed. Use cotton swabs for blunt dissection and retraction of structures. Use gauze swabs (5 x 5 cm2) to soak up excess fluid to prevent tissue dehydration.\nPrepare the priming volume. For completion, add 30 IU of heparin per mL priming solution and 2.5% v/v of an 8.4% solution of NaHCO3 for buffering. Store this solution at 4 °C until used.\nFill the CPB circuit (i.e., pump, air trapper, tubing and both cannulas) with 850 µL priming solution via the venous cannula. Once filled, keep the CPB circulating until the animal is ready for cannulation.\n2. Animal Anesthesia",
    "To administer anesthesia, place the animal in an induction chamber under 2.5% v/v isoflurane/oxygen mixture. Confirm proper anesthesia by assessing pedal withdrawal reflex, tail pinch reflex, and eye blink reflex. Apply veterinary eye ointment to avoid eye dryness.\nPlace the animal on a warming pad with temperature-regulating function. Measure body temperature with a probe inserted rectally and connected to the data acquisition system.\nAfter full anesthesia is achieved, intubate the animal orotracheally using a 20G plastic braunule, inserting it orally and pushing it into the trachea under visual control. Start mechanical ventilation using an isoflurane vaporizer connected to a mouse ventilator. Depending on the animal weight, adjust the ventilation so that a tidal volume of 250 - 350 µL is achieved.\nTo assure complete analgesia, inject 5 mg/kg animal bodyweight carprofen subcutaneously. It is recommended that isoflurane concentration be kept between 1.3 - 2.5% in oxygen. Isoflurane concentration may be manually adjusted depending on the stage of the procedure.\n3. Surgical Procedures\nAfter full anesthesia and intubation is achieved, perform a midline skin incision to the neck with sharp fine scissors, separate muscles in a blunt fashion, and expose the right jugular vein and left carotid artery. During preparation, coagulate small vessels using a veterinary coagulator connected to bipolar forceps to ensure minimal blood loss.\nAfter preparation of the jugular vessels, cranially ligate the distal segment of the left common carotid artery to its bifurcation using 8-0 silk sutures.\nConnect the distal end of a 27 G cannula to the arterial inflow tubing using a silicone connector (0.5 mm ID, 1 mm OD), place 8-0 silk suture slip knots at the proximal segment of the artery, and insert the tip of the cannula into the carotid artery.",
    "After correct placement of the cannula tip, advance the cannula tip so that it lays 3 - 4 mm proximally to the aortic arch. Fix the cannula tip by securing with 8-0 silk knots.\nUsing microsurgical forceps and scissors, perform blunt and sharp dissection, expose the right jugular vein by blunt preparation of tissue laterally to the sternocleidomastoid muscle, close to clavicle, and place an 8-0 silk knot at the distal end and an 8-0 loop at the proximal end.\nAfter ligation of the distal end of the jugular vein, place the tip of the venous cannula in the right jugular vein and progress towards the right atrium and secure using the silk knot. For optimal venous return, it may be necessary to advance the venous tip into the right ventricle.\nOnce the correct cannula position is achieved, carry out systemic heparinization by adding 2.5 IU of heparin per gram of the animal bodyweight via direct intravenous injection into the jugular vein.\nFor real-time invasive pressure monitoring, cannulate the left femoral artery. Expose the groin area and gently separate the common femoral artery from the femoral vein and femoral nerve under 25X magnification.\nLigate the distal part of the femoral artery. Temporarily occlude the proximal part with a slip-knot and make a small incision on the anterior wall using micro-forceps.\nAfterwards, insert a 1 Fr polyurethane cannula into the femoral artery and secure it with a silk 10-0 suture. This cannula is used to extract blood samples for blood gas analysis.",
    "After successful placement of the arterial and venous cannulas, initiate cardiopulmonary bypass by turning on the pump. The time from intubation to starting of CPB is approximately 45 min. Start using a flow rate of 0.5 mL/min, depending on systemic pressure measurements, and increase blood flow within 2 min to full flow (4 - 6 mL/min) by increasing the pump speed.\nUnder full monitoring, perform an upper sternotomy using sharp scissors starting from the manubrium and going 5 mm in the caudal direction. Coagulate the sternal edges immediately to avoid bleeding. Expose the aortic arch by pulling the right carotid artery in the cranial direction.\nFor optimal control, circumferentially free the aortic arch from the thymus and surrounding tissue to facilitate clamping. Place a 8-0 silk loop around the ascending aorta. To place the cross clamp for cardioplegia, pull the silk loop in the cranial direction to better expose the ascending aorta.\n4. Cardiopulmonary Bypass and Blood Gas Analysis\nFor blood gas analysis (BGA), use glass capillary tubes to collect 60 - 90 µL arterial blood via the femoral artery catheter.\nUse a small clamp on the silicone tubing and detach the tubing from the catheter. Release pressure slowly on the clamp to allow controlled filling of the capillary tube.\nReattach the silicone tube to the catheter. Insert capillary tubes into the blood gas analyzer for measurements at the following time points:\n\t\t10 min after initiation of CPB with ventilation (BGA1)\n\t\tafter 25 min of CPB and 15 min of respiratory arrest (BGA2)\n\t\tafter 40 min of CPB and 30 min of respiratory arrest (BGA3)\n\t\tafter 55 min of CPB, 45 min of respiratory, and 20 min of cardiac arrest (BGA4)\nUnder stable CPB flow, initiate respiratory arrest by stopping ventilation.",
    "After termination of ventilation, set the warming pad to 28 ºC and start topically cooling the animal to 28 ºC body temperature within the first 20 min of respiratory arrest using gauze soaked in cold saline.\nOnce a body temperature of 28 ºC is achieved, and after a total of 30 min of respiratory arrest, administer 0.3 mL of 7.45% KCl solution into the CPB circuit to initiate cardioplegia.\nFor cross clamping of the aorta, pull the previously placed silk loop (step 3.10) in the cranial direction for better exposure and place a micro-serrefine clamp on the ascending part of the aorta.\nPerform a total of 60 min respiratory arrest and 30 min of cardiac arrest. Remove the micro-serrefine clamp from the ascending aorta to initiate reperfusion of the heart. Simultaneously, re-ventilate and warm the animal to 37 °C.\nAfter reperfusion is completed and the animal has reached normothermia, terminate the CPB by turning off the pump and continue to monitor physiological measurements (e.g. body temperature, ECG, and invasive blood pressure) for 20 min.\nAt the end of the experiment, exsanguinate the animal under full anesthesia (5% isoflurane) and collect blood and organs for further analysis14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}