{
  "id": 17134,
  "origin_website": "Jove",
  "title": "Protection of H9c2 Myocardial Cells from Oxidative Stress by Crocetin via PINK1/Parkin Pathway-Mediated Mitophagy",
  "procedures": [
    "The experiments were performed in the Laboratory of Physiology at the Beijing University of Chinese Medicine, China. All study methods were performed in accordance with the relevant guidelines and regulations of Beijing University.\n1. Cell culture\nAdd 10% fetal bovine serum and 1% penicillin/streptomycin to Dulbecco's modified Eagle medium (DMEM) basic medium (with 4.5 g/L D-glucose, 4.g.g/L L-glutamine, and 110 mg/L sodium pyruvate; see Table of Materials) to prepare DMEM complete medium.\nThaw the liquid nitrogen-frozen H9c2 myocardial cells (see Table of Materials) in warm water at 37 °C with a quick and uniform stir until the ice melts.\nTransfer the cells to a centrifuge tube and add four times the volume of the DMEM complete medium. Centrifuge at 358 x g for 5 min at room temperature and discard the supernatant using a pipette.\nDilute the obtained cell suspension with culture medium, blow gently, and inoculate the cells in a culture flask. Culture in an incubator at 37 °C with 5% CO2.\n2. Determination of cell viability\nDissolve crocetin (see Table of Materials) in dimethyl sulfoxide (DMSO) to concentrations of 0.05 mM, 0.1 mM, 0.5 mM, 1 mM, 5 mM, 10 mM, 50 mM, 100 mM, and 200 mM.\nDissociate the H9c2 myocardial cells by trypsin, then neutralize the mixture with DMEM complete medium.\nTransfer the cells to a centrifuge tube and centrifuge at 179 x g for 5 min at room temperature. Discard the supernatant and mix the cells in DMEM complete medium by gently blowing.\nCount the cells using a blood cell counting plate22 (see Table of Materials) and dilute them to 5 × 104 cells/mL with DMEM complete medium.",
    "Divide the cells into nine equal portions. Add DMSO (diluted in a 1:1,000 ratio with DMEM complete medium) to the control group and add different concentrations of crocetin to the remaining groups at a ratio of 1:1,000.\nSeed the cells in 96-well plates at 100 µL per well. Discard the supernatant after incubation for 24 h and wash the cells three times with PBS.\nAfter adding 100 µL of DMEM basal medium, incubate the cells for 4 h and add 20 µL of MTS (see Table of Materials).\nIncubate the cells for another 2 h, measure the absorbance at a wavelength of 490 nm, and calculate the cell viability.\n\t​NOTE: Cell viability = (OD treated - OD blank) / (OD control - OD blank) × 100.\n3. Determination of lactate dehydrogenase (LDH), creatine kinase (CK), malondialdehyde (MDA), superoxide dismutase (SOD), glutathione peroxidase (GSH Px), and catalase (CAT)\nSeed the H9c2 cells in a 6-well plate at a density of 1 × 105 cells. Collect the supernatant after the intervention and detect LDH and SOD levels, according to the manufacturer's instructions (see Table of Materials).\nCollect the supernatant and wash it with phosphate-buffered saline (PBS) once. Add the cell lysate to the culture dish and allow it to sit on ice for 20 min. Collect the liquid from the culture dish into a centrifuge tube.\nDetect CK, MDA, GSH-Px, and CAT levels according to the manufacturer's instructions23 (see Table of Materials and Supplementary File 1).\nDetect the total protein concentration of the lysis by the bicinchoninic acid (BCA) method to correct the concentration of CK, MDA, GSH-Px, and CAT24(see Table of Materials).\n4. Determination of ROS",
    "Seed the H9c2 cells in a 48-well plate at a density of 5 × 103 cells. Dilute DCFH-DA (see Table of Materials) at a 1:1,000 ratio with the serum-free medium. Discard the cell supernatant and wash the cell twice with a serum-free medium.\nAdd 150 µL of diluted DCFH-DA into each well and incubate at 37 °C for 20 min. Wash the cells three times with a serum-free medium and capture images under a fluorescence microscope (see Table of Materials).\n5. Detection of mitochondrial membrane potential\nDetect the mitochondrial membrane potential using a JC-1 mitochondrial membrane potential assay kit25 (see Table of Materials). Discard the culture medium and wash them once with serum-free medium.\nAdd JC-1 working solution to each tube and mix them well. Incubate at 37 °C for 20 min and wash the cells twice with JC-1 staining buffer. Add complete medium to each well and capture photographs under a fluorescence microscope.\n6. TUNEL staining assay\nUse a TUNEL apoptosis assay kit (see Table of Materials) to determine apoptosis rates26. Discard the supernatant and wash the pellet once with serum-free medium.\nAdd cell fixation solution and wash them with PBS once after incubating at room temperature for 30 min.\nAdd 0.3% triton-100 to each well and incubate at room temperature for 5 min. Wash the cells with PBS twice. Add TUNEL detection working solution and incubate at 37 °C in the dark for 60 min.\nAdd an anti-fluorescence quenching sealing tablet containing 4′,6-diamidino-2-phenylindole (DAPI; see Table of Materials) and capture photographs under a fluorescence microscope.\n7. Monitoring autophagic flow by transfection of mCherry GFP-LC3B adenovirus",
    "Replace half of the medium in each well with fresh medium. Add Ad-mCherry GFP-LC3B adenovirus (multiplicity of infection [MOI] of 2) to the culture medium and add 5 µg/mL polybrene (see Table of Materials) to improve the infection efficiency.\nReplace the fresh medium after 24 h and observe the expression of the fluorescent protein under a confocal microscope.\nCulture the cells with the same conditions as section 1 after confirming successful virus infection and capture images under the confocal microscope27.\n\t​NOTE: More than 20% of cells showed green fluorescent protein (GFP) fluorescence, indicating a successful infection.\n8. Western blot analysis\nCollect cells for whole protein extraction and lyse them (RIPA, protease inhibitor, and phosphatase inhibitor = 100:1:1; see Table of Materials) on ice for 30 min.\nAdd 5x protein loading buffer to the protein sample after protein quantification and boil the samples for 10 min.\nElectrophorese the samples that contain equal amounts of protein with sodium dodecyl-sulfate polyacrylamide gel electrophoresis (SDS-PAGE) gels28. Then, transfer the samples onto polyvinylidene difluoride (PVDF) membranes.\nBlock the PVDF membranes for 1 h with 5% skim milk powder and incubate with the primary antibody (PINK1, Parkin; see Table of Materials) at 4 °C overnight and the secondary antibody at room temperature for 1 h.\nDetect the target bands using enhanced chemiluminescence (ECL) solution and the chemiluminescence detection system. Use Image J software to quantify the bands via densitometry28.\n9. Detection of Parkin's mitochondrial translocation by immunofluorescence\nObserve the colocalization of Parkin with mitochondria by double immunofluorescence staining. Discard the cell supernatant from each group and wash them three times with PBS.\nFix the cells for 10 min at room temperature with 4% paraformaldehyde and add 0.1% triton-100 in PBS.",
    "Block with animal-free block solution (see Table of Materials) for 1 h to prevent non-specific binding between proteins and antibodies and reduce the fluorescence background.\nIncubate with a primary antibody (Parkin and Tom20; see Table of Materials) at 4 °C overnight.\nAdd a fluorescent secondary antibody (see Table of Materials) and incubate in the dark for 1 h.\nAdd the DAPI-containing anti-fluorescence quenching tablets and capture images under the confocal microscope.\n10. Statistical analysis\nPerform statistical analysis using graphing and analysis software (see Table of Materials).\nCompare continuous variables between groups using one-way ANOVA. p < 0.05 was considered statistically significant.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}