{
  "id": 19953,
  "origin_website": "Wiley",
  "title": "Gnotobiotic Plant Systems for Reconstitution and Functional Studies of the Root Microbiota",
  "procedures": [
    "At-SPHERE (Bai et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0002]; http://www.at-sphere.com/[href=http://www.at-sphere.com/]) is a culture collection of A. thaliana root- and leaf-derived bacteria isolated from plants grown in natural soils. The At-R-SPHERE collection is composed of >200 strains isolated from roots of healthy A. thaliana representing >60% of the OTUs detectable by culture-independent community profiling using 16S rRNA short-read NGS (Bai et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0002]). The draft genomes of the majority of bacterial isolates in the At-SPHERE collection are available for strain validation and genomic analyses. This protocol summarizes the procedures and quality control measures used to work with these bacteria.\nMaterials\nBacterial strain in glycerol stock\nTryptic soy broth (TSB) plate, half strength (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0004])\nTSB medium, half strength (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0004])\nGlycerol\n10 mM MgSO4, sterile (e.g., Sigma-Aldrich, cat. no. M7506)\n25°C incubator with variable shaking\n1.5-ml microcentrifuge tube\nMicrocentrifuge (e.g., Eppendorf Centrifuge 5424)\nSpectrophotometer (e.g., Implen) and compatible cuvettes (e.g., Ratiolab, cat. no. 2712120)\n1. Request individual strains of interest from the At-SPHERE collection (http://www.at-sphere.com/[href=http://www.at-sphere.com/]).\n2. Upon arrival of strains, use a sterile pipette tip to streak out an individual strain on a half-strength TSB plate. Incubate at 25°C until single colonies appear.\nTSB was used as a generic medium for growth of plant-derived bacteria. Other common media (e.g., Luria-Bertani) could be used to tailor for different bacterial needs.\n3. Inoculate a single colony into 2 ml half-strength TSB medium, and incubate at 25°C, 200 rpm, until saturation.\nRefer to Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0002] for validation by sequencing of the 16S rRNA region.\n4. Save pure bacterial culture as 25% (v/v) glycerol stocks, and store at ‒80°C.",
    "5. Use a sterile pipette tip or loop to inoculate individual strains from a clean glycerol stock into half-strength TSB medium. Depending on incubation time of the individual strain, allow culture to grow at 25°C for 1 to 4 days.\nAs a reference, the incubation time can be found at http://www.at-sphere.com/[href=http://www.at-sphere.com/].\nOptional: Streak out strain from glycerol stock on half-strength TSB plate to check for potential contamination.\n6. On the day of the inoculation experiment, subculture fully grown bacterial culture in a 1:3 ratio (e.g., 1 ml stock culture to 3 ml fresh medium) in the morning. Allow to grow at 25°C for 3 to 5 hr.\nThis step can be important for certain bacteria that tend to form aggregates in older cultures.\n7. Take 500 µl of an actively growing bacterial culture, and transfer to a sterile 1.5-ml microcentrifuge tube. Centrifuge 2 min at 6500 × g, room temperature.\n8. Wash pellet with 1 ml of 10 mM MgSO4.\n9. Repeat washing step two more times, and then resuspend pellet in 1 ml of 10 mM MgSO4.\n10. Measure optical density at 600 nm (OD600): Fill cuvette with 900 µl of 10 mM MgSO4, and use as a blank. Dilute bacterial culture in a 1:9 ratio (e.g., 100 µl resuspended bacterial culture and 900 µl of 10 mM MgSO4), and measure the OD600 value. Dilute stock solution to an OD600 range of 0.2 to 0.5.",
    "Unlike common laboratory strains, the strains within At-R-SPHERE may not express a known selection marker (i.e., antibiotic resistance) and thus are prone to contamination. It is strongly recommended to perform regular quality control checks to ensure that the original stock is clean from contamination. This protocol provides a method to extract genomic bacterial DNA for subsequent PCR amplification and Sanger sequencing of the 16S rRNA gene for validation.\nMaterials\nFully gown bacterial culture in half-strength TSB medium (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0001])\nBuffer 1 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0001])\nBuffer 2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0002])\nDFS-Taq DNA Polymerase kit (e.g., BIORON) containing: \n               \n10× Taq incomplete buffer\n100 mM MgCl2\n5 U/μl Taq polymerase\n10 mM dNTPs\n10 μM forward primer 799F: 5'-AACMGGATTAGATACCCKG-3'\n10 μM reverse primer 1192R: 5'-ACGTCATCCCCACCTTCC-3'\nHeating block\nThermal cycler\n1.5-ml microcentrifuge tubes\nPCR tubes\nVortex mixer\nMicrocentrifuge (e.g., Eppendorf Centrifuge 5424)\nAdditional reagents and equipment for agarose gel electrophoresis (see Current Protocols article: Armstrong & Schulz, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0001]) and Sanger sequencing (see Current Protocols article: Shendure et al., 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0028])\n1. Preheat heating block to 95°C.\nIf PCR tubes are used in step 2, the heating step can be performed in a thermal cycler.\n2. Transfer 10 µl fresh bacterial culture to a 1.5-ml microcentrifuge tube or PCR tube.\nThe amount of bacterial cultures and subsequent reaction mixture can be scaled up (e.g., from 10 to 100 µl).\n3. Add 10 µl buffer 1 and vortex briefly.\n4. Spin down mixture briefly to collect the liquid.\n5. Incubate mixture at 95°C for 30 min.\n6. Add 10 µl buffer 2 and vortex.\n7. Spin down mixture briefly to collect the liquid.\n8. Set up the following PCR reaction to amplify the 16S rRNA region (25 μl final volume):\n         \n2.5 μl of 10× Taq incomplete buffer\n0.5 μl of 100 mM MgCl2",
    "0.5 μl of 10 mM dNTPs\n0.75 μl of 10 µM forward primer\n0.75 μl of 10 µM reverse primer\n0.4 μl of 5 U/μl Taq polymerase\n1.0 to 3.0 μl template DNA\nBring to 25 µl with water.\nWe use the BIORON DFS-Taq system as an example. The PCR reaction mixture can be changed according to the manufacturer's suggestion.\nThe primer pair will amplify the V5V7 hypervariable region of the 16S rRNA gene.\n9. Carry out PCR in a thermal cycler using the following amplification cycles:\n         \ntable:\n﻿0,1,2\nInitial step:,2 min,94°C\n34 cycles:,30 s,94°C\n,30 s,55°C\n,60 s,72°C\nFinal step:,5 min,72°C\nHold:,indefinitely,4°C.\nThe PCR cycling conditions can be changed according to the manufacturer's suggestion.\n10. Confirm presence of PCR product on a 1.5% (w/v) agarose gel, and then confirm sequences by Sanger sequencing.\nThe expected size of the PCR product is about 500 bp.\nFor strains that are indistinguishable based on a single marker gene, other universal bacterial genes (e.g., gyrB) could be used as phylogenetic marker.",
    "Plants grown in natural soil host a complex microbiota. Studying plant‒microbiota associations, however, remains a challenge because plant‒microbe and microbe‒microbe interactions occur simultaneously. Germ-free plants are commonly grown on a sterile agar-based system to exclude interference from microbes in the environment. Selected bacterial root commensals can then be supplemented either as a drop inoculum or homogeneously embedded into the agar, as illustrated in this protocol. Such a gnotobiotic system provides a convenient means to grow plants axenically or in cocultivation with a specific microbial inoculum (SynCom) and harvest different plant parts (e.g., roots and shoots), which are compatible with downstream applications including transcriptomics and community profiling through genomic marker sequencing.\nDue to the solid agar matrix with aqueous pores, different elicitors, including the immunogenic peptide elicitor flg22, can be coinoculated with the SynCom to stimulate chronic immune responses in roots. We previously showed the use of the agar-based system together with a flg22-hypersensitive A. thaliana line (i.e., pWER::FLS2-GFP; Wyrsch, Dominguez-Ferreras, Geldner, & Boller, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0038]) significantly increases the signal-to-noise ratio of flg22-mediated root growth inhibition. However, plant roots grown with the agar-based system are continuously exposed to light without extensive physical damage normally experienced when plants are grown in soil or peat matrix. Readers may refer to the Alternate Protocol or other published gnotobiotic systems (Kremer et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0020]) as possible alternatives. Up to 30 individual bacterial strains can be assayed per day routinely.\nMaterials\nBacterial strains (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0001])\nMurashige and Skoog (MS) medium, half strength (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0003])\nChemical elicitors\n10 mM MgSO4, sterile (e.g., Sigma-Aldrich, cat. no. M7506)\nA. thaliana seeds, sterile (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0005])\nOptional: 50°C water bath\n50-ml conical tube\nOptional: magnetic stir bar and stir plate with heating function\nSpectrophotometer (e.g., Implen) and compatible cuvettes (e.g., Ratiolab, cat. no. 2712120)",
    "Square plates, 12 cm × 12 cm (e.g., Greiner Bio-One, cat. no. 688102)\n3M Micropore Surgical Tape, 1.25 cm width (e.g., VWR, cat. no. 115-8172)\nPhytochamber (e.g., Panasonic Chamber MLR-352)\n1. After obtaining resuspended bacterial culture (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0001]), calculate volume needed for the inoculation experiment.\nWe usually inoculate individual strains to a final concentration corresponding to an OD600 of 0.0005.\nFor example, for a bacterial stock with an OD600 of 0.2, the volume of stock required to inoculate a 50-ml plate is 25 / 0.2 = 125 µl.\nThe concentration of each strain should be optimized for different experiments.\n2. Prepare and autoclave half-strength MS medium containing agar. Allow medium to cool to ∼50°C by leaving medium at room temperature or in a preset water bath.\nThis step is critical to minimize the risk that excessive heat kills the inoculated bacteria.\n3. Pour 50 ml warm half-strength MS medium into a 50-ml conical tube. Add chemical elicitors when necessary.\nFor example, a final concentration of 1 µM flg22 (e.g., 5 µl of 10 mM flg22 stock in 50 ml medium) will be added to the medium to induce plant immune responses.\nInoculate flg22 into a larger volume to minimize variation of flg22 amount. For example, inoculate the still-warm medium with flg22 first, and then supplement bacterial strains in conical tubes. Always prepare plates with mock treatment (150 µl MgSO4 only) and 1 µM flg22 alone (also with 150 µl MgSO4) as a positive control.\n4. Add the corresponding volume of bacterial stock culture as calculated from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0001], step 10. Add extra MgSO4 to bring to a total volume of 150 µl (30 μM MgSO4 final concentration).\nPerform all steps in a laminar flow hood.",
    "If more time is need for the inoculation process, place a magnetic stir bar in the medium before autoclaving, and keep the medium warm using a magnetic stir plate with heating up to 50°C.\n5. If a SynCom is inoculated, add each strain to a final concentration corresponding to an OD600 of 0.0005.\nWe previously showed that a five-member SynCom composed of immunosuppressive strains depresses flg22-mediated root growth inhibition and defense marker gene expression (Ma et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0023]).\n6. Pour medium into a 12 cm × 12 cm square plate. Mix medium well by inverting the conical tube gently upside-down twice to minimize the trapping of air bubbles.\n7. Dry plates in a laminar flow hood by leaving plates open for ∼10 min to minimize excessive condensation during incubation.\n8. Allow plates to stand for 1 hr to overnight before adding A. thaliana seeds on top of the solidified agar plate.\nThis is a potential stopping point if the whole inoculation experiment cannot be finished in 1 day.\nRefer to Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0005] for surface sterilization of A. thaliana seeds.\n9. Depending on experimental requirements, add five to 15 seeds (two rows for more than eight seeds) on each plate.\n10. Seal stacked petri dish with 3M micropore surgical tape, and allow plants to grow vertically in phytochamber for 2 to 3 weeks. Randomize position of the plates once a week.\nGrowth conditions should be: 10 hr light, 14 hr dark; 21°C/19°C cycle; 65% relative humidity; and light intensity of 120 mE/m2/s.\nExpected outcome",
    "A. thaliana plants can be grown under the indicated conditions for 2 to 3 weeks. It is typical for wild-type plants (i.e., Col-0) to develop a primary root up to 5 cm in 2 weeks. Addition of immunogenic elicitor such as flg22 generally results in about 20% reduction in primary root length (Fig. 1A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0001],B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0001]). The use of a hypersensitive line (i.e., pWER::FLS2-GFP) can boost flg22-mediated root growth inhibition from 20% to 80% (Fig. 1C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0001]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/034c2fd4-1793-46ad-a09a-a5022838101e/cpz1362-fig-0001-m.jpg</p>\nFigure 1\nExpected phenotypes of Arabidopsis thaliana plants grown on agar plate. (A) Phenotypes of 2-week-old axenic wild-type Col-0 grown in the presence or absence of 1 µM flg22. (B) Primary root length of plants shown in A. Significant difference was determined based on the Dunn's Kruskal-Wallis test. (C) Representative images of 3-week-old flg22 hypersensitivity line (pWER::FLS2-GFP) inoculated with 1 µM flg22 and a suppressive strain 101. Scale bar = 1 cm.",
    "Growing plants in an agar-based system provides multiple advantages from easy visual assessment of the root architecture to compatibility of harvesting for downstream assays. However, extrapolating results gained from plants grown on agar plates is complicated by their artificial environment: root exposure to light and lack of physical damage for surface-grown roots. Additionally, the choice of gelling agent (i.e., agar) or even batches can impose significant variation on nutrients (Gruber, Giehl, Friedel, & von Wirén, 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0013]). In contrast, plants grown in soil-like peat matrix are closer to natural cultivation conditions. Kremer and colleagues have recently developed a peat-based gnotobiotic system known as flowpot. However, the setup of flowpot requires additional equipment and is more time-consuming. The jiffy pot‒based gnotopot (Kremer et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0020]) is easier to set up but is nevertheless incompatible with the exogenous application of certain microbial elicitors, possibly due to absorption by peat matrix and/or chemical modification by this growth substrate (Sasse et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0026]). Furthermore, plants grown in peat are difficult to harvest and can complicate downstream assays that rely on accurate and clean tissue amounts for normalization or quick harvesting for transcriptomic analyses. Lastly, these peat-based systems are incompatible with mineral malnutrition experiments owing to nutrient leaching. To address these concerns, we have developed an alternative gnotobiotic system that takes advantage of the perlite material as expanded volcanic glass matrix that is commonly used in hydroponics. The perlite system is advantageous due to its compatibility with some nutritional stress (e.g., phosphate starvation, peptide elicitor treatment) and the feasibility to harvest relatively intact and clean roots.\nMaterials\nPerlite (e.g., Knauf, PERLIGRAN)\nMS medium, half strength (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0003])\nElicitor (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003])\nBacteria (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003])\nA. thaliana seeds, sterile (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0005])\nAutoclave-resistant container",
    "92 mm × 16 mm petri dish (e.g., Sarstedt, cat. no. 82.1473.001)\n3M Micropore Surgical Tape, 1.25 cm width (e.g., VWR, cat. no. 115-8172)\n1. Wash perlite three times with tap water. Then wash two additional times with Milli-Q water. Transfer washed perlite into a deep autoclave-resistant container.\nPerlite has a lower density than water. To aid washing, put perlite in a big container sealed with mesh with a suitable pore size (e.g., 2 to 3 mm) so that dust and water can flow through freely.\n2. Autoclave perlite once at 121°C for 30 min. Let autoclaved material cool overnight, and repeat autoclave process.\nOptional: Perlite can hold a considerable amount of water. After two rounds of autoclaving, transfer the material to a 60°C oven to dry the materials completely. This drying step can take up to 3 days to complete.\nA small amount of perlite could be inoculated in half-strength TSB medium or on a TSB agar plate at this stage to check for potential contamination.\n3. Fully fill a regular 92 mm × 16 mm petri dish with sterile perlite. Pour half-strength MS medium supplemented with elicitor or bacteria according to the procedures described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003].\nThe original cap of the petri dish can be used to apply even pressure to make the perlite more compact.\nA maximum of 25 ml medium is enough to fully wet perlite depending on how dry the material is. Excessive liquid can be left behind but should occupy <5 mm of depth in the plate.",
    "Perlite is low in nutrients and could be used for nutritional experiments. Such experiments proved to be an alternative to the agar plate system to impose nutritional stress, such as phosphate starvation (data not shown). For additional information regarding the nutritional starvation experiment, please refer to a previously published protocol (Harbort, Hashimoto, Inoue, & Schulze-Lefert, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0015]).\n4. Germinate up to 10 seeds in each petri dish.\n5. Use lower half of another petri dish as a cap. Seal stacked petri dish with 3M tape.\n6. Grow plants in this system up to 3 weeks before harvesting.\nSince perlite is lighter than water, a large volume of water or buffer could be added to the petri dish, and individual plants could be separated from the perlite particles easily under water.\nExpected outcome\nIt is feasible to grow plants in a regular 92 mm × 16 mm petri dish for 3 weeks (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0002]). Additional nutrient solution or water may be added to keep the plants hydrated. In addition, immunogenic elicitors (i.e., flg22) can be applied to induce plant immune responses, as evidenced by flg22-mediated root growth inhibition (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0002]). Relatively intact plant roots can be harvested after 2 to 3 weeks of growth.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/27bdd063-938b-4597-8017-dae7a878fab8/cpz1362-fig-0002-m.jpg</p>\nFigure 2\nExpected phenotypes of Arabidopsis thaliana plants grown with the perlite system. (A) Phenotype of 2-week-old axenic pWER::FLS2-GFP plants grown in the perlite system. (B) Phenotypes of pWER::FLS2-GFP plants directly collected from the perlite system. Plants grown in this system are sensitive to 1 µM flg22 stimulation as evidenced by the clear reduction in primary root length. Scale bar = 1 cm.",
    "In contrast to some plant species, most of the seed-associated microbiota of A. thaliana are found only on the surface. A typical surface sterilization protocol using ethanol or bleach is sufficient to remove the seed-associated microbiota and prepare the germ-free plants for subsequent experiments. For these experiments, we recommend using seeds collected from plants propagated in greenhouses without any infestation.\nMaterials\nA. thaliana seeds\n70% and 96% ethanol\nOptional: 50% bleach\n1.5-ml microcentrifuge tubes\nOptional: rocking platform\n1. Aliquot an appropriate amount of seeds into a 1.5-ml microcentrifuge tube.\nPerform all subsequent steps in a sterile laminar flow hood.\n2. Wash seeds with 70% ethanol for 5 min.\nOptional: Fix tube on a rocking platform for more thorough surface sterilization.\n3. Remove 70% ethanol by pipetting, avoiding taking seeds in the process. Repeat step 2 twice.\nDo not leave the seeds in ethanol for too long or it will kill the seeds.\n4. Remove 70% ethanol, and wash with 96% ethanol for 2 min.\n5. Remove 96% ethanol, and add sterile water.\nSeeds may float after replacement of ethanol with water. Spin down briefly to collect the seeds at the bottom of the tube.\nOptional: If sequential ethanol washes are insufficient, an additional 5-min wash with 50% bleach could be performed. Afterward, wash the seeds extensively with sterile water as a small amount of remaining bleach will be toxic and will seriously compromise your experiments.\n6. Remove water by pipetting. Repeat washing step for a total of three times, ∼1 min each.\n7. Leave a small amount of water that barely covers the seeds. Keep seeds in the dark at 4°C for at least 2 days.\nThe seeds can be stored in the dark at at 4°C for up to 5 days.",
    "Pseudomonas is a highly diversified genus within the Gammaproteobacteria that can associate with multiple eukaryotic hosts. While some Pseudomonas spp. are beneficial microbes, others are infectious agents, and together they form one of the core lineages of the A. thaliana root microbiota. There are numerous Pseudomonas pathovars that can successfully establish and infect A. thaliana leaves including the commonly used P. syringae pv. tomato DC3000. However, only a limited number of Pseudomonas root pathogens have been described so far. Previously, we characterized an opportunistic Pseudomonas pathogen strain R401 from the At-R-SPHERE collection. Inoculation of nonimmunosuppressive or immunosuppressive SynComs, designed based on the immunosuppressive activity of individual strains in mono-association, affect plant susceptibility to the opportunistic pathogen R401 (Ma et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0023]). Therefore, following the proliferation of R401 can serve as an output of root immunity. Here, we provide a detailed infection protocol of A. thaliana by R401.\nMaterials\nMS agar plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0003])\nElicitor, bacterium, or SynCom (see Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003])\nA. thaliana seeds, sterile (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0005])\nBacterial suspension of pathogens (e.g., Pseudomonas strain R401)\n10 mM MgSO4, sterile (e.g., Sigma-Aldrich, cat. no. M7506)\nSilwet l-77 (e.g., Lehle Seeds, cat. no. VIS-30)\nTSB plate (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0004])\nSpectrophotometer\nScalpel, sterile (e.g., VWR, cat. no. 233-5315)\nFilter paper, sterile (e.g., Whatman)\n2-ml tubes, sterile\nMetal beads, sterile (e.g., Biospec, cat. no. 11079113c)\nScale\nTissue homogenizer (e.g., Bertin Technologies Precellys 24)\n96-well plate or equivalent\n12-channel pipette\n25°C incubator\n1. Prepare half-strength MS agar plate without sugar so that the inoculated bacteria depend on plants for organic carbon source. Supplement plate with elicitor, single bacterium, or SynCom as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003]. Pregerminate surface-sterilized seeds on half-strength MS agar plate for 14 days.",
    "Older plants (e.g., 3 weeks old) could be used, but we noticed that older plants may show significant variation in terms of plant growth under the influence of the microbiota. Such variations should be considered in the interpretation of the result.\n2. Flood inoculate plants with a bacterial suspension of pathogens (e.g., Pseudomonas strain R401) at a final OD600 of 0.0001 (in 10 mM MgSO4 supplemented with 0.005% Silwet).\nThe volume of the bacterial culture should be enough to completely submerge the plants. For example, 20 ml culture is sufficient to flood inoculate a 12 cm × 12 cm square plate.\nThe bacterial culture can be prepared as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003].\n3. Incubate plants with bacterial culture for 5 min. Afterward, remove excessive liquid.\nPlants can be kept on the same plate or transferred to a new half-strength MS agar plate for further incubation.\n4. After 1 to 2 days, separate shoots and roots using a sterile scalpel, and pool roots and shoots from five and three individual plants, respectively. Wash samples briefly in sterile water, and blot dry with sterile filter paper.\nDepending on the strains used, optimize the time point(s) at which samples are taken.\n5. Prepare a sterile tube, and add sterile metal beads to about 1 cm depth. Weigh tubes with metal beads.\n6. Transfer washed and dried samples from step 4 to tubes with beads. Weigh tubes with plant samples, and calculate the difference as the weight of your samples.\n7. Homogenize samples with metal beads once. Homogenize sample again in 500 µl sterile 10 mM MgSO4 using a tissue homogenizer (6200 rpm, 2 × 30 s, 15 s pauses in between).\n8. Perform serial dilutions in a sterile 96-well plate using the format shown in Figure 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0003].\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/798b6706-57b2-488f-a945-a7cb855309c4/cpz1362-fig-0003-m.jpg</p>\nFigure 3",
    "Schematic illustration of how to perform serial dilution and spotting of the bacterial culture on a square petri dish. (A) Serial dilutions of samples in a 96-well plate. (B) How to perform spotting of diluted samples on a square plate. We typically perform four dilutions from six samples on the same plate. (C) Example of viable plate counting; see the gradual dilution of each sample.\n9. After preparing serial dilutions, use a 12-channel pipette to aliquot 10 µl samples on a half-strength TSB plate, and flip plate sidewise to let the liquid flow evenly, moving the plate back and forth a few times (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0003]).\nWe typically perform a total of 24 dilutions from six different samples at the same time.\nDry the plate under a hood to minimize the risk that the liquid samples run over each other.\n10. Incubate plates at 25°C for 1 to 4 days until single colonies appear (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0003]).\nThe pathogen strain could be transformed with a plasmid expressing an antibiotic resistance gene. Supplement the plate with the corresponding antibiotic for selection against contamination.\nExpected outcome\nDepending on the starting bacterial inoculum and the developmental stage of the plants upon inoculation, plants infected with R401 will be inhibited in growth and will develop leaf chlorosis symptoms (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0004]). Typically, axenic 14-day-old plants inoculated with R401 at a starting inoculum of OD600 = 0.0001 will have a titer of 108 to 109 colony forming units (CFUs) per gram of root tissue 2 days after inoculation (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0004]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/9096b1e8-7c96-4f8d-8c50-3571515a39d6/cpz1362-fig-0004-m.jpg</p>\nFigure 4",
    "Typical results of plants after infection with the opportunistic pathogen R401. (A) Symptoms of axenic plants 1 week after inoculation with strain R401 at a starting inoculum of OD600 = 0.0001. Plants are inoculated at 2 weeks old. Scale bar = 1 cm. (B) Bacterial titer of R401 on leaf and root 2 days after inoculation on axenic 2-week-old Arabidopsis thaliana.",
    "In mono-association studies of bacteria with plant roots, roots are inoculated with individual bacterial strains. The system described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0003] is limited in terms of the capacity to perform high-throughput screening of bacteria resulting in altered plant phenotypes. We adopt and modify the previously published phytostrip system (Burrell et al., 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0006]) based on a 96-well microplate format to allow parallel A. thaliana mono-association experiments with one bacterial strain or SynCom per well in the presence or absence of microbial elicitors. Routinely, 380 bacterial strains in 96-well formats can be tested per day. Here, we demonstrate the feasibility to screen for bacterial root-derived commensal mutants of a transposon library to modulate flg22-mediated root growth inhibition by using the A. thaliana flg22-hypersensitive transgenic line pWER::FLS2-GFP (Wyrsch et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-bib-0038]).\nMaterials\nBacterial stocks\nTSB medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0004])\n10 mM MgSO4, sterile (e.g., Sigma-Aldrich, cat. no. M7506)\nMS medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-rec-0003])\nPhytagel (e.g., Sigma-Aldrich, cat. no. P8169)\nA. thaliana seeds, sterile (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0005])\n96-deep-well plates, 2 ml (e.g., Eppendorf, cat. no. 0030506308)\nMicropore foil (e.g., AeraSeal; Sigma-Aldrich, cat. no. A9224)\nThermoshaker\nMicrocentrifuge with swinging bucket rotor and plate adapter\nMultichannel pipettes\nVortex mixer\nGlass petri dish, minimum diameter: length of phytostrips (e.g., Sigma-Aldrich, cat. no. BR455701-10EA)\n50°C incubator\nPhytostrips (e.g., Brooks Life Sciences, cat. no. 4ti-0310)\nAdhesive PCR foil (e.g., Bio-Budget, cat. no. 30-SP-0027)\n96-deep-well square microplates, 1.2 ml, U bottom (e.g., Brooks Life Sciences, cat. no. 4ti-0126)\nRectangular container (e.g., Sac O2, TP1600+TPD1200)\n3M Micropore Surgical Tape, 1.25 cm width (e.g., VWR, cat. no. 115-8172)\nGrowth cabinet\nScanner\nPrepare bacterial culture\n1. Fill 96-deep-well plates with 1.2 ml half-strength TSB medium, and inoculate with bacteria.\nPreparation of bacterial cultures is generally analogous to Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-prot-0001] but scaled up.\nOptional: Supplement strains with the corresponding antibiotics if necessary.",
    "If you are inoculating the 96-deep-well microplates from a glycerol stock stored in a 96-well format, the inoculation can be facilitated using a 96-long-pin disposable replicator. Return the original stock to ‒80°C after sealing the plate with aluminum foil.\n2. Seal 96-deep-well plate with micropore foil.\n3. Incubate inoculated plates in a thermoshaker until the bacterial culture reaches prestationary phase titers.\nWash bacteria culture before inoculation\n4. Pellet bacteria by centrifuging 96-deep-well plates 10 to 20 min at 3200 × g, room temperature, using a compatible plate adapter.\nTake images to make sure all the bacteria in the individual wells grow (Fig. 5A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0005]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/b66696ec-be59-4ba0-92d5-d5282a8f2cbd/cpz1362-fig-0005-m.jpg</p>\nFigure 5\nMajor steps in the preparation of phytostrips. (A) Pelleted bacteria in a 96-well plate 4 days after incubation in half-strength tryptic soy broth (TSB) medium at 25°C. (B) Positioned and sealed phytostrips using an adhesive PCR foil. (C) Filling of sealed phytostrips with bacteria resuspended in half-strength MS medium using a multichannel pipette. (D) Assembling of filled and solidified phytostrips into the 96-well storage microplate. (E) Positioning of 96-well storage microplate into a rectangular container to assemble the final cultivation box (F).\n5. Discard supernatant by pipetting.\n6. Use a 12-channel pipette to add 1 ml of 10 mM MgSO4.\n7. Resuspend bacteria using a vortex mixer or by pipetting.\n8. Repeat steps 4 to 7.\n9. Pellet bacteria by centrifuging 96-deep-well plates 10 to 20 min at 3200 × g, room temperature, using a compatible plate adapter.\n10. Discard supernatant.\n11. Add half-strength MS medium to get a bacterial suspension for inoculation.\nThe volume should be determined empirically so that the concentration of the bacterial stock solution is approximately three times the final concentration.\nPrepare phytostrips",
    "12. Transfer a sterile glass petri dish to a laminar flow hood, and prewarm plate to about 50°C.\n13. Hold a single 8-well phytostrip in position by taping to adhesive PCR foil (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0005]).\n14. Fill 100 µl resuspended bacteria culture into sealed phytostrips using a multichannel pipette (Fig. 5C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0005]).\nAlways prepare wells without bacteria by adding half-strength MS medium only.\n15. Prepare warm half-strength MS medium supplemented with 1.2% (w/v) Phytagel.\nAdd chemical elicitors here if necessary (e.g., 1 µM flg22 [final concentration]) to induce the plant immune responses. Always prepare wells with mock treatment by adding 230 µl warm half-strength MS medium to the respective wells before adding supplements.\n16. Pour supplemented half-strength MS medium into a prewarmed glass petri dish.\n17. Add 230 µl supplemented half-strength MS medium into individual wells of the phytostrips using an 8-channel pipette, and mix well with bacterial culture by pipetting up and down once.\nTry to minimize the trapping of air bubbles in this step.\n18. Wait for medium to solidify (∼15 min).\n19. Fill 96-deep-well square microplates with 1 ml half-strength MS medium.\n20. Place prepared phytostrips in the storage microplates (Fig. 5D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0005]).\n21. Add two to five A. thaliana seeds on top of the agar-supplemented medium in each well.\n22. Place 96-well plate holding the phytostrips in a rectangular container (Fig. 5E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0005]).\n23. Close container with the lid, and seal with 3M micropore surgical tape if necessary (Fig. 5F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0005]).\n24. Transfer phytostrips to a growth cabinet, and grow plants for up to 3 weeks.\nGrowth conditions should be: 10 hr light, 14 hr dark; 21°C/19°C cycle; 65% relative humidity; and light intensity of 120 mE/m2/s.\nAdditional substances can be added in the half-strength MS medium throughout the cultivation period.",
    "25. Scan individual 8-well phytostrips on a scanner with a black background to phenotype root architecture.\nExpected outcome\nAt the end of a 2- to 3-week cultivation period, primary roots of untreated wild-type (Col-0) or hypersensitive (pWER::FLS2-GFP) plants (no flg22) should reach the half-strength MS medium reservoir. Application of the immunogenic elicitor flg22 in combination with the hypersensitive line (pWER::FLS2-GFP) is expected to induce strong root growth inhibition, in which roots are barely visible to the naked eye. Depending on the ability of up to 90 individual mutant bacterial strains to suppress flg22-induced root growth inhibition, intermediate phenotypes in terms of root length will be observed. Due to the fact that each phytostrip (12 per plate) can be moved individually, the effect of single bacteria can be quantified not only for the shoot (Fig. 6A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0006]) but also for the root organ by a side view over time (Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.362#cpz1362-fig-0006]). Note that roots can also be directly harvested from individual wells for downstream assays.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/79b2c4b9-4629-40ac-b951-8617637bf370/cpz1362-fig-0006-m.jpg</p>\nFigure 6\nRepresentative images of 3-week-old Arabidopsis thaliana plants grown in phytostrips. (A) Top view of one 96-well plate with 12 phytostrips (two to four plants per well). (B) Exemplary side view of one phytostrip with two to four plants per well."
  ],
  "subjectAreas": [
    "Plant Biology"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}