{
  "id": 5600,
  "origin_website": "Bio",
  "title": "Hippocampal Neuron Dissociation Transfection and Culture in Microfluidics Chambers",
  "procedures": [
    "Coverslip and Chamber PreparationDay 1:PDMS devices are fabricated as described in Park et al. (2006).Day 2:Corning No.1, or No.1.5 coverglasses are both suitable for our microscope (24 mm x 40 mm). Or, Carolina coverglasses 24 mm x 50 mm.Sonicate the cover glasses in autoclaved ddH2O for 60 min.Sonicate again in 70% EtOH for 30 min.Sonicate in 100% EtOH for 30 min.Wash with autoclaved ddH2O in TC hood, air dry the coverglasses overnight in the hood.Day 3:Assemble the coverglass and PDMS device by using the plasma-bonding machine.Press firmly on the corners but only lightly touch the middle channel. Coat the chamber with PDL (>150K mol wt, prepared in borax boric acid buffer):0.5 mg/ml PDL is added to a well on one side of the device and allowed to flow through into the connecting well (leave the other side unfilled). Allow the PDL to flow through the device for about 10 min and then add more PDL to the wells to fill them up.Place the devices containing PDL in an incubator at 37 °C for a minimum of 30 min to let the PDL fill the micro-groves.Fill the wells and major channel on the other side of the chamber with PDL and return the chamber to incubator at 37 °C for a minimum of 4 h, overnight is preferable.Day 4:Pipette out the excess PDL after treatment, but be careful not to suck all the liquid out of the device.Add autoclaved ddH2O to each well on either side of the device, and allow to flow to the other well by capillary action.Aspirate off the water (again being careful not to fully remove all the liquid from the device), then add another 150 μl of autoclaved ddH2O to one of each connected well and allow it to flow through to the corresponding well.",
    "Repeat this quick wash twice, then place the device containing ddH2O in an incubator at 37 °C for 1 h.Then, repeat the wash step again. Wash the devices at least three times with ddH2O for one hour each, which is the total. Add NBM with the necessary factors (glutamax, B27, PenStrep) to the top wells. Let it flow through, incubate at 37 °C overnight. Prepare 40 ml plating media: 800 μl B27 + 30 μg/ml gentamicin + 400 μl glutamax + 25 μM glutamatePrewarm 10 ml dissociation media in 15ml tube: Neurobasal + 5% FBS + gentamicin. Prewarm 10 ml plain neurobasal media for papain.Day 5:Add laminin (20 μg/ml) to each well and incubate at 37 °C for at least 30 min: Coat the chamber with laminin: take a 20 μl aliquot out from -80 °C freezer and put it on ice immediately, wait until it dissolves completely on ice then add cold neurobasal media to 1.8 ml.Turn the UV light on and UV sterilize one 6 cm cell culture dishs for 15 min.Pre-warm 14 ml plating media in this 6 cm cell culture dish, 37 °C incubator.Replace the laminin solution with plating media 1 h before plating the cells.Dissection of hippocampal neuronsActivate papain 10 mg aliquot with 750 μl papain buffer at 37 °C for 30 min.Add to prewarmed neurobasal media, filter sterialize, then add one DNase 20 μl aliquot.Wash the tissue with 10 ml cold dissection media in TC hood (wash twice).After the tissue settled by gravity, remove HBSS completely.Add one aliquot of DNase to 10 ml digestion media (prewarmed yesterday).Place half of digestion media (5 ml) onto the tissue for 15 min at 37 °C water bath.",
    "Add the remaining half of digestion media into the tube and incubate for another 15 min at 37 °C water bath.Let the tissue settle to bottom by gravity or spin shortly.Re-suspend the pellet with 5 ml papain dissociation media and triturate up and down with 5 ml pipette for 5 times, avoid bubbling the media.Let debris settle slowly, or short spin to 100 g up and down (600 rpm), transfer the supernatant to a new 15 ml tube.Continue triturate the undissociated tissues for 5-10 times, take the supernatant and combine with previous 5 ml.Take 10 μl out and mix with 10 μl trypan blue.Load 10 μl mixture on hemacytometer and count:All cells in 16 small squares x 104 = cells/ml (A typical yield from 12 E18 pups is ~50 M in total).Amaxa transfectionMix 82 μl nucleofector solution with 18 μl supplement before use.Prepare 50 μl nucleofector with 5 μg total DNA (if using more than 1 plasmid, mix in equimolar ratios).Spin down 5 million (1-6 million for each transfection) neurons at 150 x g 5 min. During spinning, transfer 7 ml pre-warmed plating media to a 15 ml tube, add 350 μl FBS, keep at 37 °C. Prepare the 1 ml pipette with a tip.After spinning, remove all media using aspiration pipette with a 200 μl pipette tip.Resuspend the cells in a 50 μl nucleofector solution.Mix 50 μl of the cells with the premix of DNA + neucleofector (a total of 100 μl).Zap with program G-13 (better for Hc) or O-03 (better for Cx). A foam of dead cells will form.Immediately pipette in 1 ml warmed plating medium with FBS and pipette out to a 1.7 ml eppendorf tube. Do not pick up dead foam. Be gentle.Incubate at 37 °C 10 min after rescue.",
    "Spin down the cells at 150 x g, 5 min.Resuspend in 300 μl plating media with FBS.Load 5 μl/well, filling the two upper wells of each microfluidic.Let cell adhere at 37 °C for 10 min.Fill the wells from both ends simultaneously with two pipettes with plating media with FBS.Completely change media to fresh plating media W/O FBS 2 h later.Day 6:Change media once again the next morning with plating media.Change half of the media every 2 days."
  ],
  "subjectAreas": [
    "Developmental Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}