{
  "id": 3875,
  "origin_website": "Cell",
  "title": "Combining electrophysiology and optogenetics for functional screening of pyramidal neurons in the mouse prefrontal cortex",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMajor step 1-1: Construction of plasmid expressing RNA interference (RNAi)-mediated single gene knockdown and scramble vectors\nTiming: 3–5 days\nAs a first step, you will make the following three different types of plasmids; 1) Control miRNA, 2) Scramble (Scr) miRNA, and 3) Knockdown (KD) miRNA for the targeted gene in which you are interested (Figure 1[href=https://www.wicell.org#fig1] and Table 1[href=https://www.wicell.org#tbl1]). For construction of the miRNA plasmids, we usually use BLOCK-iT Pol II miR RNAi Expression Vector Kit (Invitrogen) which includes the reagents that are required for the construction including a competent cell and Super Optimal Broth with Catabolite repression (S.O.C. medium). The following plasmids will be constructed for this protocol;\ntable:files/protocols_protocol_597_6.csv\nTo exclude possible side effects of GFP expression, we use an empty vector carrying only GFP without miRNA sequences as the control miRNA vector for the validation of KD efficacy of the miRNAs in HEK293T cells later.\nNote: The construction of pCAG-miRNA-mOrange is the same with that of pCAG-miRNA-GFP except the fluorescent proteins. The following process presents the protocol for the pCAG-miRNA-GFP. In the case of the pCAG-miRNA-mOrange, you will use pCAG-mOrange empty vector instead of the pCAG-GFP empty vector.\nAlternatives: We subcloned the mOrange sequence from pmOrange2-N1 Vector (Takara Bio USA) and replaced GFP with mOrange on the pCAG-GFP empty vector. Any other red fluorescent protein like tdTomato will work for constructions of the WT-cDNA and cDNA-rescue vectors, pCAG-DIO vector, and pCAG-miRNA vector as well.",
    "Alternatives: We subcloned the double-floxed inverted open reading frame (DIO) sequence from the pAAV-EFa-DIO-mVenus (gifted from Dr. Akiko Hayashi-Takagi) and replaced GFP by the DIO and mOrange sequence on the pCAG-GFP empty vector to construct the pCAG-DIO-mOrange. A DIO sequence from any other plasmids containing the DIO will work as well. We also recommend to replace the Chronos-GFP sequence on the pCAG-DIO-Chronos-GFP with the mOrange subcloned from the pmOrange2-N1 Vector.\nDay 1\nMix 5 μL each of the top- and bottom-oligonucleotides constructed in the step “Design and Generation of Oligonucleotides for RNA Interference (RNAi)-Mediated Knockdown Experiment”. Add 1 μL of any kind of oligo annealing buffer.\nIncubate the mixture at 84°C for 4 min.\nElute 1 μL of the annealed oligonucleotides with 499 μL MilliQ water. You can keep the leftover of the eluted oligonucleotides at −20°C.\nNote: In the meantime, thaw the ligation enzyme and competent cells (DH5α) on ice.\nMix 1 μL of the 500×-eluted oligonucleotides and 0.5 μL pCAG-GFP empty vector without any inserted miRNA oligonucleotides with 1.5 μL Ligation high Ver. 2. at 24°C–27°C for 1h. You can keep the leftover of the diluted oligonucleotides at −20°C.\nTransform all of these samples into 50 μL of competent cells.\nIncubate the sample on ice for 30 min.\nHeat shock the sample at 42°C for 30 s.\nIncubate the sample on ice for 2 min.\nAdd warm 250 μL S.O.C. medium to the sample.\nIncubate it at 37°C for 45–60 min.\nSpread the sample evenly on an LB agar plate with ampicillin.",
    "Note: We usually make the LB agar plate using agar powder (CAT: # 01028-85, Nacalai Tesque, Japan), LB medium powder (LB Broth, Lennox, CAT: # 20066-95, Nacalai Tesque, Japan) and ampicillin sodium (CAT: # 02739-32, Nacalai Tesque, Japan). We recommend 1.5% agar, 2% LB and 0.01% ampicillin should be included in the plate.\nAlternatives: The commercially-available LB plate can work as well.\nIncubate the plate for 12–16 h at 37°C.\nDay 2\nPick several colonies from the LB plate using plastic tips.\nPut each tip into a tube (15 mL centrifuge tube) of 3 mL 2% LB medium with 300 μg ampicillin sodium.\nIncubate the tubes for 12–16 h at 37°C.\nDay 3\nUse 1 mL of the 3 mL LB medium with the competent cells to make a glycerol stock for long-term storage at −80°C.\nUse what is leftover of the 3 mL LB medium and competent cell mixture for mini-prep.\nPerform the mini-prep following the manufacturer’s instructions.\nNote: We use PureYieldTM Plasmid Miniprep System (Promega, USA). Other miniprep kits work as well.\nAfter the mini-prep, check the concentration of the plasmid. 300–450 ng/μL is a usual range of the concentration.\nNote: You can check the insertion of the oligonucleotides using restriction enzymes if the vector has the appropriate cleavage sites. It is better to confirm the insertion of the correct oligonucleotides by Sanger DNA sequencing before in utero electroporation.\nNote: In the BLOCK-iT Pol II miR RNAi Expression Vector Kit, we usually use MscI (NEB to confirm the insertion of the oligonucleotides of miRNA sequences.\nMajor step 1-2: Construct a rescue vector to express cDNA of the targeted genes\nTiming: 1 week: Constructing a wild-type (WT)-cDNA vector\nTiming: 3–5 days: Designing and Making a cDNA Rescue Vector",
    "For the rescue experiments, we will generate a vector expressing a miRNA-resistant cDNA of the targeted gene.\nAlternatives: We usually use KOD-plus Neo DNA polymerase to clone a sequence of the targeted gene from the cDNA library. The accuracy of this polymerase is quite good, but other polymerases may work as well.\nSearch the cDNA sequence of the targeted gene using the National Center for Biotechnology Information (NCBI) database (https://www.ncbi.nlm.nih.gov/[href=https://www.ncbi.nlm.nih.gov/]).\nChoose the gene name on Mus musculus (house mouse) from the search results (Figure 3[href=https://www.wicell.org#fig3]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig3.jpg\nFigure 3. Process to search cDNA sequences in the NCBI database\n(A) Example of the genomic data of targeted gene (Setd1a) on different species.\n(B) mRNA and protein data of the mouse SETD1A protein.\n(C–E) A whole DNA sequence of Setd1a including the cDNA (C). Clicking the “CDS” tab (D) visualize the cDNA sequence of the targeted gene (E).\nClick the mRNA tab on the “mRNA and Protein (s)” section (Figure 3[href=https://www.wicell.org#fig3]B).\nIn the next page, click the “CDS” tab to highlight the coding region of the targeted gene (Figures 3[href=https://www.wicell.org#fig3]C–3E).\nDesign both forward and reverse PCR primers for the cDNA to clone whole sequences of the targeted gene. Order the primers commercially.\nNote: We usually design PCR primers ourselves. A commercial website can also be used to design the primers.\nUse KOD-plus Neo DNA polymerase kit (TOYOBO, Japan) and make a pre-mixed master solution containing 4 μL 10× PCR buffer, 4 μL dNTPs, 2.4 μL MgSO4, 2.4 μL primer mix (1.2 μL forward and 1.2 μL reverse primers) (10 μM), 1.6 μL cDNA library that is already prepared at the “Preparation of cDNA Library” section, and 24.8 μL MilliQ water for each of the desired reactions. Vortex it well.",
    "Add 0.8 μL of DNA polymerase per reaction to the pre-mixed master solution. Mix gently by pipetting.\nAdd 40 μL of the pre-mixed master solution into each 200 μL PCR tube.\nRun the PCR using an appropriate program. One example of 2-step PCR is found as follows.\ntable:files/protocols_protocol_597_7.csv\nAlternatives: We usually use C-1000 Touch Thermal Cycler (Bio-Rad, USA). Any other PCR machines work as well.\nNote: If the targeted gene is longer than 3.0 kb, we recommend dividing the sequence into at least 2 fragments. This is because the KOD-plus Neo DNA polymerase will only produce products up to 3.0 kb. Clone each fragment individually and ligate them prior to insertion into the pCAG vector (troubleshooting 1[href=https://www.wicell.org#sec7.1]).\nPerform 1.5% agarose gel electrophoresis using the PCR samples.\nExtract the band from the agarose gel under UV light.\nPurify the PCR product from the extracted band using the DNA purification kit.\nAlternatives: We usually use Wizard® Genomic DNA Purification Kit (Promega, USA). Other DNA purification kits will also work.\nMix 1 μL of the PCR product and 1 μL of linearized pCAG-mOrange empty vector without any inserted sequences with 2 μL of Ligation high Ver. 2 (Takara Bio USA, Inc., USA). Incubate this mixture at 24°C–27°C for 1 h.\nNote: Any other ligation enzyme can work as well.\nNote: We usually use GFP and mOrange as reporter markers for the miRNAs and cDNA respectively. Other fluorescent proteins work as reporters for the miRNAs and the cDNA if they can be distinguished visually.\nTransform and isolate the plasmid as shown in the construction of the KD-miRNA plasmid (See the Protocol No. 5-No. 19 at the step 1-1).\nCheck the insertion of the cDNA sequence using restriction enzymes and agarose gel electrophoresis.",
    "Note: EcoRI and AgeI are effective at cutting the insert. Other restriction enzymes may work as well.\nAlternatives: We usually use the QuikChange Lightning Site-Directed Mutagenesis Kit (Agilent, CA, USA) to insert the mutations into the cDNA sequence. Any other mutation kit could work as well.\nDesign primers using the QuikChange Primer Design site (https://www.agilent.com/store/primerDesignProgram.jsp[href=https://www.agilent.com/store/primerDesignProgram.jsp]).\nNote: When designing the primers, replace 4–6 nucleotides in the miRNA-targeted sequences without changing any codons from the DNA sequences. It is critical to prevent binding of the KD miRNA to the cDNA rescue vector.\nAfter getting the primers, mix 1 μL forward and 1 μL reverse primers (125 ng/μL each) with 1 μl WT-cDNA plasmid (50 ng/μL), 5 μl 10× reaction buffer, 1 μl dNTP mix, 1.5 μl QuikSolution reagent (included in the kit) and 38.5 μl MilliQ water in 200 μl PCR tubes. Vortex it well.\nAdd 1 μl QuikChange Lightning Enzyme into each PCR tube. Mix it gently by pipetting.\nRun the PCR using appropriate program. One example of the program is found as follows.\ntable:files/protocols_protocol_597_8.csv\nAfter the PCR, apply 2 μl Dpn I restriction enzyme to the PCR mixed sample. Mix it gently by pipetting.\nIncubate it at 37°C for 5 min.\nTransform the sample into the competent cells in the same way as explained from the Protocol No. 5 to No. 19 in the step 1-1.\nCritical: All miRNA and cDNA expression vectors carrying fluorescent proteins (GFP or mOrange) should include the CAG promoter. The CAG promoter is most effective at inducing strong expression of the Scr/KD/cDNA vectors (Bitzenhofer et al.,2017[href=https://www.wicell.org#bib2]). Other promoters, such as the EF1α and human synapsin promoters, do not induce efficient gene expression by in utero electroporation.\nCritical: The exact sequences of each plasmid should be confirmed by DNA sequencing.",
    "Major step 1-3: Evaluation of KD efficiency of the miRNAs on HEK293T cells\nTiming: 3 days\nValidation of the miRNAs is necessary before applying them to in vivo experiments. We usually perform this validation in HEK293T cells (Figure 4[href=https://www.wicell.org#fig4]A and 4B). Additionally, we recommend to quantify the mRNA expression by qPCR using the electroporated brain to confirm the reduction of the targeted gene (Nagahama et al., 2020[href=https://www.wicell.org#bib10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig4.jpg\nFigure 4. Validation of efficiency of the KD miRNA in HEK 293T cells\n(A) Illustration of workflow to evaluate the efficiency of the KD-miRNA vector compared to the Scr-miRNA vector for targeted genes in HEK293T cells. The illustration was made by BioRender. WT: wildtype, Res: rescue.\n(B) Representative images of the GFP and mOrange from the transfected HEK293T cells in each condition. Scale, 100 μm.\nDay 1\nPrepare a 100 mm dish of 50% confluent HEK293T cells.\nReplace the medium with HBSS (3 mL) and add trypsin (500 μL) to the new medium.\nIncubate the dish for 3–5 min at 37°C with 95% O2 and 5% CO2 gas.\nAdd 7 mL HBSS to the dish and mix well.\nCentrifuge the mixture in a 50 mL tube at 110 × g for 3 min at any temperature under 20°C.\nRemove the supernatant and suspend the cells in 12 mL of DMEM medium.\nPut 0.5 mL of the suspended cell solution into each well of a 24 well plate for cell culture (Nunc Multidish 24 NunclonTM Delta Surface).\nDay 2\n(6–24 h later) Prepare four 1.5 mL-tubes containing OPTI-MEM (50 μL/well; 300 μL/6 well).\nNote: 6 wells are enough to quantify the fluorescent signals in each condition.\nAdd mixed plasmids to the four 1.5-mL tubes for the following four different conditions:\ntable:files/protocols_protocol_597_9.csv",
    "Add 1.5 μL of X-tremeGeneTM HP DNA Transfection Reagent (Millipore-Sigma) to each tube.\nKeep the tubes at 24°C–27°C or 15 min.\nAdd the mixed solution to each well of the HEK 293T cells.\n(6 h later) Repeat the same procedures from 8 to 12.\nNote: We recommend the repeated transfection of the vectors in the same HEK-cell wells because the mOrange signal of the cDNA vectors after the single transfection might not be strong enough to evaluate the KD efficiency.\nNote: It might be better to adjust the volume of the plasmids if the fluorescent signals are weak (troubleshooting 2[href=https://www.wicell.org#sec7.3]).\nDay 3\n(24 h later) Remove the medium and add 4% paraformaldehyde (PFA) into each well.\nKeep the plate at 24°C–27°C for 10 min.\nRemove the PFA and wash three times using phosphate buffered saline (PBS).\nStopping Point: The samples can be kept in 1-mL PBS at 4°C for several months.\nAdd 300 μL PBS containing 0.1% Triton X to each well. Keep at 24°C–27°C for 10 min.\nAdd 30 μL of donkey serum (as a blocking agent) to each well. Keep at 24°C–27°C for 30 min.\nWash the wells with PBS three times.\nAdd primary antibody for GFP (diluted 1:1000 with PBS) and RFP (diluted 1:300 with PBS).\nKeep the samples at 4°C for 12–24 h.\nNote: It is possible to see the fluorescent signals from GFP and mOrange alone, but we recommend staining them by immunocytochemistry due to the weakness of their native signals.\nNote: The primary antibodies for the targeted proteins might be useful to visualize the presence of the molecule, if these antibodies are readily available.\nDay 4\n(24 h later) Wash the wells with PBS three times.\nIncubate in the secondary antibody (diluted 1:400 with PBS) at 24°C–27°C for 1 hour.",
    "Perform a confocal imaging of the fluorescent signals from each well.\nNote: To quantify the fluorescent signals, we recommend capturing 5-6 images per well.\nAlternatives: Any other fluorescent microscopes work for the quantification as well, but the quality of imaging is better in the confocal microscope depending on the sample condition.\nMajor step 2: In utero electroporation\nTiming: 3–5 days\nYou will transfect several types of combination composed of the different plasmids using the in utero electroporation (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_597_10.csv\nThese steps induce efficient expression of the single gene-Scr/KD miRNA in layer 2/3 pyramidal neurons in the mPFC (Figure 5[href=https://www.wicell.org#fig5] and Methods video S1[href=https://www.wicell.org#mmc1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig5.jpg\nFigure 5. Experimental setup and essential equipment for in utero electroporation\n(A) Image of the whole setup for in utero electroporation.\n(B) Images of the electroporator to deliver electrical stimulation to pups (upper) and the micro injector to inject the plasmids (lower).\n(C) Images of surgical implements and a glass pipette which contains the diluted solution including plasmids for in utero electroporation.\n(D) Scheme of the in utero electroporation. The plasmid is injected into the fetal lateral ventricle and electrical stimulation is delivered via the forceps-shaped bipolar electrode. The electroporation is performed on 6–8 embryos in a single operation.\n(E) Inject the solution containing the plasmid into one side of the lateral ventricles on each embryo.\nThe injection site of the plasmid should be 0.75–1.0 mm anterior from lambda and 0.5 mm lateral from the sagittal suture.\n(F) The positions of the electrode to target the mPFC. Note that the negative pole is positioned over the injected hemisphere while the positive one is positioned on the contralateral side. The two electrodes are slightly angled rostrocaudally and vertically as seen.",
    "(G–I) Low (G) and high (H) magnification Images of injection of the plasmids and image of delivering electrical stimulation through a forceps-shape electrode (I) during in utero electroporation.\n(J) Image of the mPFC from an electroporated mouse. The green signal shows GFP and the blue signal represents DAPI staining. Scale, 1mm.\n(K) High-magnification image of the electroporated mPFC expressing GFP. Scale, 50 μm.\nSee also Methods video S1[href=https://www.wicell.org#mmc1].\nPrepare injection glass pipettes (1.5 OD × 0.86 IK × 100 L mm, # 30-0057, Harvard Apparatus, Co. UK) with a certain width (approximately 0.1–0.2 mm) of the tip right before the experiment using a micropipette puller (Flaming/Brown Micropipette Puller, # CAT SU-P-97, Sutter Instrument Co., USA). The pipettes are made by the following two-step puller protocol; Step1: HEAT=602, PULL=35, VEL=200, Time=250; Step2: HEAT 604, PULL=0, VEL=200, TIME=250.\nAnesthetize a pregnant ICR mouse. Embryonic day 14.5 is suitable to target L2/3 pyramidal neurons.\nSet the anesthetized pregnant mouse on a stage composed of several paper towels.\nOpen the abdominal wall of the dam and make 3–5 cm hole using a surgical scissors.\nPick up each pup with a round-shaped forceps gently from the hole on the abdomen.\nInject a 2–3 μL solution including a single plasmid or a combination of several plasmids into a lateral ventricle (Methods video S1[href=https://www.wicell.org#mmc1]). During the operation, you should keep the embryo wet using autoclaved PBS.\nSet the bipolar electrode to target the mPFC.\nDeliver electrical stimulations (35 V for 50 ms, 5 times at 950 ms intervals) via the forceps-shaped bipolar electrodes connected to the electroporator.\nAfter finishing the electrical shock for the pups as you want, suture the abdominal hole using surgical strings and inject painkillers into the abdomen.",
    "Alternatives: Other hand-made bipolar electrodes such as a triple-electrode probe are also acceptable for in utero electroporation.\nAlternatives: The other strain such as C57B6 strain work as well for the in utero electroporation.\nNote: The concentration of the injected DNA plasmid is adjusted to 1.0–3.0 μg/μl with phosphate-buffered saline (PBS). The total volume of the injected plasmids is approximately 2–9 μg for each mouse.\nNote: To stimulate presynaptic neurons with miRNA-KD selectively and to compare the amplitudes and ratios of paired-pulse synaptic responses between the KD and control neurons in the same slices, you need to express an opsin sparsely in a subset of the KD neurons using Cre-loxP system. For example, we recommend transfecting 1–2 μg/μl of pCAG-DIO-Chronos-GFP plasmid and the same dose of the pCAG-KD-miRNA-mOrange plasmid with a smaller dose (0.5–1 ng/μl) of pCAG-Cre plasmid into L2/3 pyramidal neurons. These doses should be adjusted based on the expression levels of each fluorescent protein (Figure 8[href=https://www.wicell.org#fig8]). Because the composition of opsin and fluorescent protein is possible to affect the function of the opsin, we have replaced GFP for mOrange as a reporter gene on the KD-miRNA plasmid for the sparse labeling of the Chronos (Figure 8[href=https://www.wicell.org#fig8]).\nCritical: Use an extremely light-sensitive opsin such as Chronos because it is essential to increase the probability of obtaining the synaptic responses despite the opsin’s sparse expression. Other recent high-sensitive opsins will work as well.\n1–3 days after birth, verify the fluorescent expression in each pup through the skull with green/red-light glasses, and select the pups carrying efficient fluorescent expression.\nNote: Keeping only 6–7 pups might be appropriate for their proper development.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Demonstration of in utero electroporation, related to Major step 2 and Figure 5",
    "Major Step 3: Ex-vivo electrophysiology on acute slices combined with optogenetics\nTiming: 4–5 h per day\nPrepare recording patch pipettes from borosilicate glass capillary (1.5 OD × 1.17 ID × 100 L mm, # 30-0062, Harvard Apparatus, Co. UK) using the Micropipette Puller (Model P-97, Sutter Instrument Co. USA). The 2-step protocols of the puller are; Step1, HEAT=572, PULL= 0, VEL=81, TIME=250; step 2, HEAT=570, PULL=0, VEL=60, TIME=250. It is recommended to adjust it appropriately according to the fineness of the pipette (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig6.jpg\nFigure 6. Experimental images from patch-clamp recording using LED light\n(A) Patch-clamp setup for electrophysiological experiments.\n(B) Amplifier for the recording (upper) and patch pipettes made from glass capillaries using a puller machine (lower).\n(C) Blue light shining during the experiments to confirm the fluorescent expression of mOrange or GFP.\n(D) Images of GFP-negative control and GFP-positive knockdown neurons through DIC microscope during the experiment. The upper neuron that is surrounded by the black circle is the control neuron and white cells mean the GFP-positive neurons (lower black circle). Scale, 50 μm.\n(E) PC screen on which the PATCHMASTER program is running to record synaptic currents evoked by optogenetic stimulation.\n(F) Scheme of possible neuron pairs in the electroporated mPFC.\nNote: The pipet resistance should be 2.4–5 MΩ for the layer 2/3 pyramidal neurons in the mPFC.\nChill the cutting solution on ice for 30 min–1 h bubbled with mixed gas composed of 95% O2 and 5% CO2.\nAnesthetize and sacrifice a mouse with CO2 gas or another anesthetic in accordance with your approved Institutional Animal Care Use Committee (IACUC) protocol.\nAlternatives: Isoflurane also works well as an anesthetic.",
    "Note: It is easier to record synaptic currents in mice aged postnatal day 16–25 than in adult mice. For mice older than 1 month, we recommend cardiac perfusion of the Choline Cl-based cutting solution for 5–10 min prior to removing the brains from the mice.\nWe also recommend to use the potassium gluconate-based cutting solution for more than P60-older mice (Hong et al., 2014[href=https://www.wicell.org#bib6]).\nRemove the brain from the mouse immediately (< 1 min).\nPut the brain into the cold cutting solution on ice. Incubate it around 3 min.\nTrim the posterior part of the brain at the +1.0 to +2.0 mm anteriorly from the bregma.\nSet the brain at the chamber of the slicer.\nStart to cut the brain slices in the cold cutting solution at a certain thickness (see note below).\nCut 4–5 brain slices, including those from the mPFC.\nNote: The thickness of the slices depends on the brain region (e.g., Cerebral cortex: 300 μm; Cerebrum: 250 μm)\nAlternatives: This protocol uses a vibratome slicer (VT1200, Leica, Germany) to cut acute mPFC slices for electrophysiological recordings. Other slicers can be used as well.\nIncubate the slices in a reservoir chamber at 24°C–27°C for 30–60 min with the ACSF.\nAlternatives: Incubation of the slices in a water bath at 37°C works as well.\nTransfer one of the slices to the recording chamber on the stage of the differential interference contrast (DIC) microscope.\nPlace a patch pipette towards a targeted pyramidal neuron under the DIC microscope (Figure 6[href=https://www.wicell.org#fig6]A-D). The temperature should be kept at 30°C–32°C during the recording. Otherwise, synaptic responses become small and it is hard to quantify them accurately.",
    "Note: For successful recording, we recommend choosing relatively small and teardrop-or pyramidal-shaped neurons in which you can clearly identify the soma (Figure 6[href=https://www.wicell.org#fig6]D). Usually large neurons are either dead or severely damaged.\nNote: The layer 2/3 pyramidal neurons can be identified morphologically or by fluorescence. The neurons expressing GFP or RFP can be judged to be layer 2/3 pyramidal neurons because the layer showing the fluorescence is determined according to the date of the embryonic stages in which the in utero electroporation was performed (Fukuchi-Shimogori and Grove, 2001[href=https://www.wicell.org#bib5]; Saito, 2006[href=https://www.wicell.org#bib13]).\nNote: As far as we know, around 30% of the electroporated neurons are CaMKII-positive neurons in the mPFC (Nagahama et al., 2020[href=https://www.wicell.org#bib10]; Sacai et al., 2020[href=https://www.wicell.org#bib11]).\nPut the patch pipette on the targeted neuron with positive pressure during approaching the neuron.\nRelease the positive pressure to make the tight seal between the pipette and the targeted neuron.\nNote: After putting the pipette on the neuron, you should change the holding potential from 0 mV to −70 mV gradually. The tight contact between the patch pipette and the membrane of the targeted neuron will be generated within several minutes, which is called a giga-ohm seal.\nCritical: Carefully watch how the cell responds to this activity. Sometimes rapidly decreasing the holding potential can be toxic to the targeted neuron.\nSuck by mouth or make a negative pressure by a plastic syringe through tube connected to the glass pipette and connect the glass pipette to the targeted neuron (Figure 6[href=https://www.wicell.org#fig6]D).\nNote: Small amount of electrical stimulation called as “Zap” sometimes work well to make the connection between the pipette and targeted neurons.\nNote: If the neuron expresses the GFP, you can see the fluorescent signal in the pipette after the suck.",
    "After waiting about 5 min, record the synaptic current using stimulation protocols in the program using the amplifier (Figure 6[href=https://www.wicell.org#fig6]E).\nNote: The synaptic current is recorded by the amplifier and filtered at a certain amount of the range. We usually use the default setting (2.9 kHz). The series resistance should be below 20 MΩ (preferably 10 MΩ or less) and must be controlled during the experiment.\nNote: Record the synaptic currents from the fluorescent-positive KD neurons or fluorescent-negative control neurons from the same electroporated mice (Figure 6[href=https://www.wicell.org#fig6]D). Otherwise, it is also recommended to record and compare the currents from the fluorescent-positive Scr and KD pyramidal neurons in independent Scr and KD mice respectively.\nNote: Each parameter requires the presence of the following drugs in the perfused ACSF during the recording in each holding potential:\ntable:files/protocols_protocol_597_11.csv\nNote: The appropriate holding potential should be changed depending on reversal potentials calculated by compositions of internal solutions and ACSF.\nCritical: Monitor the input resistance during the recording. Also, the value of the leak current could be critical in affecting the condition of the recording. We usually exclude the data showing the leak current under −200 pA.\nRecord the spontaneous and/or miniature synaptic currents initially to check the overall synaptic transmission in the targeted neurons.\nNote: If any abnormalities in either amplitude or frequency are found, we recommend recording the evoked synaptic responses by local electrical stimulation using a bipolar tungsten stimulating electrode as the next step. The magnitude of the amplitude and paired-pulse synaptic responses should be recorded (Nagahama et al., 2020[href=https://www.wicell.org#bib10]; Sacai et al., 2020[href=https://www.wicell.org#bib11]) (troubleshooting 3[href=https://www.wicell.org#sec7.5]).\nNote: When applying the electrical stimulation, the bipolar tungsten stimulating electrode should be placed 50–100 μm away from recorded neurons to prevent the direct stimulation of neurons (Nagahama et al., 2020[href=https://www.wicell.org#bib10]; Sacai et al., 2020[href=https://www.wicell.org#bib11]).",
    "Critical: Keep the same distances between the electrode and a pair of the neurons with and without fluorescent proteins especially when analyzing the amplitude of the evoked synaptic responses because this directly affects the magnitude of the evoked synaptic responses.\nNote: When recording the paired-pulse synaptic responses induced by the electrical stimulation, it might be better to record them at several inter-stimulus intervals such as 20, 50, 100, and 500 msec (Nagahama et al., 2020[href=https://www.wicell.org#bib10]; Sacai et al., 2020[href=https://www.wicell.org#bib11]).\nIf any impairments in the initial paired-pulse ratio (PPR) are found, record the paired-pulse responses at 20, 50, 100, 500 ms inter-stimulus intervals (ISI) by the 0.1-ms electrical stimulation and 2 to 5-ms light shining to identify which pre or postsynaptic site is affected by the KD of targeted gene (Nagahama et al., 2020[href=https://www.wicell.org#bib10]). There are four different types of expression patterns of the miRNAs in the pairs of pyramidal neurons in the electroporated mPFC (Figure 6[href=https://www.wicell.org#fig6]F). In the first pair, both presynaptic and postsynaptic neurons are controls (Ctr-Ctr pair). The second pair means that the presynaptic neurons are control, but the postsynaptic neurons are GFP-positive KD neurons (Ctr-KD pair). The third one is a pair that both presynaptic and postsynaptic neurons are the GFP-positive KD neurons (KD-KD pair), and the fourth pair is composed of presynaptic GFP-positive KD neurons and postsynaptic GFP-negative control neurons (KD-Ctr pair) (Figure 6[href=https://www.wicell.org#fig6]F and Table 3[href=https://www.wicell.org#tbl3]).\ntable:files/protocols_protocol_597_12.csv\nAlso see Figure 6[href=https://www.wicell.org#fig6]F.\nTo analyze the effect of KD in only presynaptic neurons (Figure 6[href=https://www.wicell.org#fig6]F; Ctr-Ctr and KD-Ctr), make the slices that only presynaptic pyramidal neurons should express the Chronos and the Scr/KD miRNAs with GFP (Figure 7[href=https://www.wicell.org#fig7]A) from individual mice expressing Scr-miRNA or KD-miRNA plasmid respectively co-expressed with Chronos-GFP expression under Cre-induced recombination.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig7.jpg\nFigure 7. Optogenetically induced EPSCs from the fluorescent-negative neurons",
    "(A) Scheme of the patch-clamp recording from layer 2/3 (L2/3) pyramidal neurons in the mPFC combined with optogenetic light stimulation. Record from the GFP-negative control neurons.\n(B) Excitatory postsynaptic current induced by the activation of Chronos.\n(C) Latency (left) and jitter (right) of the optogenetically induced EPSCs.\n(D–H) Actual traces of the optogenetically induced paired-pulse EPSCs at 20 ms (D), 50 ms (E), 100 ms (F), 500 ms (G), and 1000 ms(H) inter-stimulus intervals. The paired-pulse responses were recorded in the presence of 100 μM picrotoxin.\nPerform whole-cell patch clamp recording on the GFP-negative pyramidal neurons next to the opsin and GFP double positive pyramidal neuron (Figure 7[href=https://www.wicell.org#fig7]A).\nApply paired-light-pulse stimuli at several inter-flash intervals (IFI). We usually use 20, 50, 100, 500 msec IFI (Figures 7[href=https://www.wicell.org#fig7]D–7G). You can also apply the light stimuli at longer IFI like 1,000 msec (Figure 7[href=https://www.wicell.org#fig7]H).\nCompare the PPR values between the neurons from the mice showing the Scr miRNA + opsin and the KD miRNA + opsin.\nTo analyze effect of the KD in both pre- and postsynaptic neurons (Figure 6[href=https://www.wicell.org#fig6]F; KD-KD and KD-Ctr), make the slices that both pre- and postsynaptic neurons show the KD miRNA expression and only presynaptic neurons show the opsin (Figures 8[href=https://www.wicell.org#fig8]A–8D).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig8.jpg\nFigure 8. Sparsely-labeled opsin (Chronos with GFP) in the miRNA expressing neurons in the electroporated neurons\n(A–C) Representative Images of fluorescent expression of Chronos with GFP (A) and, KD miRNAs with mOrange (B), and the merge image showing the double-positive neurons (C). Scale, 500 μm.\n(D) Scheme of the patch-clamp recording using optogenetic stimulation.\n(E) Representative traces of optogenetically induced EPSCs from a non-fluorescent control neuron.\nLocate appropriate pairs of cells composed of the mOrange-positive KD and negative control pyramidal neurons without the opsin-GFP right next to the opsin-GFP/KD-miRNA-mOrange double positive pyramidal neuron (Figures 8[href=https://www.wicell.org#fig8]A–8C).",
    "Perform whole-cell patch clamp recording on those pyramidal neurons one by one (Figure 8[href=https://www.wicell.org#fig8]D).\nApply paired-light-pulse stimuli at several inter-flash intervals (IFI). We usually use 20, 50, 100, 500 msec IFI (Figure 8[href=https://www.wicell.org#fig8]E).\nCompare the amplitudes and the PPR values between non-fluorescent control neurons and the neurons showing the KD miRNA without the opsin in the same slices.\nNote: For this experiment, we used the pCAG-miRNA-mOrange to knock down the targeted gene because the pCAG-DIO-Chronos-GFP has the GFP expression under Cre recombination and we need to use the different reporter gene for the KD-miRNA expression.\nNote: 465-nm blue LED light pulse should be maintained at an appropriate strength (4 mW/mm2) and duration (2−10 ms) by the LED controller LEX2-LZ4-B (Brainvision, Inc., Tokyo, Japan). You can adjust these values to keep the value of the first amplitude in the PPR around 50−100 pA (Troubleshooting 4[href=https://www.wicell.org#sec7.7]).\nNote: According to the shorter latency and the smaller jitter of the traces (Figures 7[href=https://www.wicell.org#fig7]B and 7C), the Chronos-induced traces are monosynaptic responses. You can also validate the traces using TTX and 4-aminopyridine (4-AP) (Nagahama et al., 2020[href=https://www.wicell.org#bib10]).\nTo analyze effect of the KD in only postsynaptic neurons (Figure 6[href=https://www.wicell.org#fig6]F; Ctr-Ctr and Ctr-KD), you can stimulate presynaptic axons from layer 5/6 of the mPFC without any expression of the KD miRNAs (Nagahama et al., 2020[href=https://www.wicell.org#bib10]).\nSet a bipolar tungsten stimulating electrode in the layer 5/6 without any fluorescent signals in the electroporated mPFC.\nRecord paired-pulse-synaptic responses from appropriate pairs composed of the GFP-positive and negative pyramidal neurons in the layer 2/3 when stimulating the layer 5/6 by the electrode.\nCompare the amplitude and the PPR values between GFP-positive KD and negative control neurons.",
    "Note: Through these three different types of recording the paired-pulse responses, you can easily specify which synaptic site is responsible for the impairments of presynaptic glutamate release induced by KD of the targeted gene (Nagahama et al., 2020[href=https://www.wicell.org#bib10]).\nTo analyze the KD effect on the postsynaptic site, perform immunohistostaining for GFP and mOrange in the slices and observe spine structures (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/597-Fig9.jpg\nFigure 9. mOrange-sparse labeling for spine analysis\n(A) Images of the sparse labeling of GFP vector for the miRNA (left), mOrange vector (middle) as a reporter to label the individual neuron sparsely, and merge (right). Scale, 50 μm.\n(B) Representative images of dendrites from the mOrange-labeled neurons. Scale, 5 μm.\nStain the slices, including the GFP-positive Scr/KD neurons from independent Scr/KD mice, using anti-GFP and RFP antibodies. Follow a general staining protocol.\nObserve the spine structures using a confocal microscope.\nCapture several images from each neuron (usually 5-6 images per neuron is optimal for quantification).\nCount the number of spines present and measure the head-width of each individual spine using a program such as Neurolucida360.\nNote: Using the mOrange signal expressed sparsely on the GFP-positive pyramidal neurons might be better to get more visible images in each spine. Alternatively, decreasing the volume of the injected miRNA-GFP vector would also be fine to express the GFP sparsely (troubleshooting 5[href=https://www.wicell.org#sec7.9]).",
    "Critical: High-quality images are essential to analyze the spine structures. The criteria used to capture the images and detect each spine should be kept uniform for all neurons. We usually use the 60× oil immersion objective using digital zoom 2.0 at 0.48 μm-z series (1024 × 1024 pixels resolution) to capture the confocal images. To detect and classify the spines, we use the following criteria: outer range: 2.5 μm, minimum height: 0.3 μm, detector sensitivity: 50%, minimum count: 10 voxels for detecting spines and head-to-neck ratio: 1.1, length-to-head ratio: 2.5, mushroom head size: 0.35 μm, and filopodium length: 3 μm for the classification of spines (Nagahama et al., 2020[href=https://www.wicell.org#bib10]). Also see the instruction of Neurolucida 360.\nNote: Additionally, you can record the evoked IPSC and evoked EPSC from the same pyramidal neuron to determine the inhibition/excitation balance. The following procedure can be a reliable way to record the inhibitory/excitatory (I/E) ratio (Nagahama et al., 2020[href=https://www.wicell.org#bib10])\nRecord evoked EPSCs at the Cl− equilibrium potential initially (−40 mV in this protocol) with the application of 50 μM D-AP5.\nConfirm the suppression of the evoked EPSCs by applying 10 μM NBQX to the bath solution.\nRecord evoked IPSC at 0 mV, the reversal potential of EPSC in the protocol.\nConfirm the suppression of the evoked IPSC by 0.1 mM PTX.\nCritical: The liquid junction potential calculated by the composition of the ACSF and each internal solution should be corrected."
  ],
  "subjectAreas": [
    "Microscopy",
    "Neuroscience",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology"
  ]
}