{
  "id": 18449,
  "origin_website": "Jove",
  "title": "Circumscribed Capsular Infarct Modeling Using a Photothrombotic Technique",
  "procedures": [
    "All procedures were conducted according to the institutional guidelines of Gwangju Institute of Science and Technology (GIST), and all procedures were approved by the Institutional Animal Care and Use Committee at GIST.\n1. Pre-lesioning Steps\nIdentification of the Forelimb Area in the Internal Capsule using AAV-GFP\nHouse and handle Sprague Dawley rats (~400 g, 11 - 13 weeks) in compliance with institutional and national guidelines.\nSterilize all surgical tools and electrodes using an appropriate sterilizer (Steam or Plasma sterilizer). Use steam sterilizer at 121 °C as setting of 30 min for sterilization and 30 min for dry.\nAnesthetize the animal with a mixture of ketamine hydrochloride (100 mg/kg) and xylazine (7 mg/kg) via an intramuscular injection. Check the depth of anesthesia by paw pinching. Maintain the body temperature at 37.5 ± 0.5 °C via a heating pad under the body of the animal.\nPlace the animal in a stereotactic frame using an ear bar and mouth holder.\nClean and disinfect the surgical site with 70% alcohol and povidone iodine solution. Infiltrate 2% lidocaine hydrochloride under the scalp in the intended skull incision area to reduce the intraoperative pain.\nApply vet ophthalmic ointment to prevent drying of the eyes. Place a sterile drape over the animal to the operative sites. Maintain all procedures in sterile conditions.\nPerform a midline skull incision of 2 cm using a scalpel and retract the skin bilaterally with wire retractors. Dry the skull with cotton swabs and 30% hydrogen peroxide.\nMake a hole using a hand piece drill over the forelimb area of motor cortex (AP: +2.5 from bregma, ML: ±2.5 from the midline) and clear the tract with micro-currette for virus-injection.",
    "Thaw the AAV-GFP (2 x 1012 virus molecules/ml) on ice and load 1 µl of the virus in a 10 µl syringe. Place the syringe on the stereotactic frame.\nMove the needle to the pre-made hole and lower the needle 1 mm deep into the dura.\nInject the virus slowly (0.1 µl/min) using a high precision micropump and leave the needle in place for an additional 10 min to allow the virus to diffuse out.\nAfter cleaning the operative site with saline irrigation, secure the wound with 3-0 nylon suture; release the rat from the stereotactic frame and transfer it to a recovery chamber. Administer  ketoprofen (2 mg/kg) via an intramuscular injection  for postoperative pain control.\nMaintain the body temperature (37 °C) with heating pad and administer second generation cephems-class antibiotics (0.1%, 1 ml) via an intramuscular injection and 2% lidocaine hydrochloride via subcutaneous injection as necessary.  Do not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency. Single house the animal until full recovery.\nFollowing 2 - 3 week recovery, deeply anesthetize the rat with an overdose of ketamine hydrochloride (300 mg/kg) via an intramuscular injection in the hood. Confirm the death of animal by lack of toe pinching response, pulse, and breathing. Place the rat supine in the hood.\nOpen the abdominal cavity via a 'Y'-shaped incision to open the chest cavity. Tightly clamp the descending aorta with a hemostat and rupture the right atrium of the rat heart for blood drainage. Initiate perfusion into the left ventricle of the heart with cold 1% paraformaldehyde for 5 min (10 ml/min) followed by 4% paraformaldehyde for 30 min (10 ml/min).",
    "Remove the rat head from carcass using a pair of scissors. Make a midline incision from the neck to the nose and remove the neck muscles using scissor or rongeur so that skull is exposed. Gently dissect the skull bones and duras out from the brain.\nExtract the brain and place the rat brain in a 50 ml conical tube filled with 4% paraformaldehyde overnight. The next day, wash the brain with 1x PBS 3 times and place it in a 30% sucrose solution.\nAfter the brain completely sinks to the bottom of the 30% sucrose solution, place the brain in the cryomold with OCT compound at -20 °C in cryotome. Slice the brain in coronal plane at a thickness of 40 μm and an interval of 200 μm.\nPerform GFP immunohistochemistry staining using the slide method14. Apply primary antibody (1:200 of Anti-Green Fluorescent Protein, Rabbit IgG fraction) to brain slices overnight at 4 °C. On 2nd day, wash with 1% Phosphate Buffered Saline with Tween-20 (PBST) solution 3 times and apply the secondary antibody (1:500 of Goat Anti-Rabbit IgG (H + L)) for 1 hr. Rinse the slide with 1% PBST 3 times. Place the cover glass on the brain slice.\nUsing a fluorescent microscope (excitation wavelength 470 nm, emission wavelength 525 nm, magnification 5X), observe the AAV-GFP transduced axons in the internal capsule. Compare the locations of transduced axons with the Rat Brain Atlas15 to determine the stereotactic coordinates of the transduced axons\nPre-lesioning Adjustment of the Light Intensity Appropriate for Capsular Infarct Modeling\nConstruction of the Optical Neural Interface\nCut an appropriate length (4 cm) of a 27 gauge spinal needle with a stylet inside using a cutting drill.",
    "NOTE: Cutting may compress and crush the spinal needle tip; remove the stylet and polish the spinal needle tip to remove the crushed portion of the spinal needle and maintain the inner caliber of the spinal needle.\nStrip an appropriate length (10 cm) of the jacket of the optical fiber (125 µm with a 62.5 µm core) of one side patch cord.\nInsert the unjacked optical fiber into the metal tube (external diameter: 3.8 mm, internal diameter: 3.3 mm and length: 17 mm), which is then clamped around the fiber. The metal tube is helpful to fill the space between the optical fiber and the hub of the spinal needle. Clamp the lower 1/2 of the metal tube with a presser twice.\nApply the heat-curable epoxy on the optical fiber and insert the optical fiber into the spinal needle. Apply an additional epoxy to the empty space in the hub. Cure the epoxy for 20 min at 100 °C for stable fixation.\nCleave the optical fiber that protrudes out of the spinal needle and polish the optical fiber at the tip of the spinal needle using diamond lapping (polishing) sheets.\nConnect the FC/PC connector part of patch cord to the coupler of green laser system and measure the light intensity from the tip of the optical fiber using digital optical power and energy meter.\n2. Photothrombotic Infarct Lesioning in the Internal Capsule\nSterilize all surgical tools and electrodes using an appropriate sterilizer (Steam or Plasma sterilizer). Use steam sterilizer at 121 °C as setting of 30 min for sterilization and 30 min for dry.",
    "Anesthetize the animal (~400 g, 11 - 13 weeks) with a mixture of ketamine hydrochloride (100 mg/kg) and xylazine (7 mg/kg) via an intramuscular injection. Check the depth of anesthesia by paw pinching. Maintain the body temperature at 37.5 ± 0.5 °C via a heating pad under the body of the animal.\nPlace the animal in a stereotactic frame using an ear bar and mouth holder.\nClean and disinfect the surgical site with 70% alcohol and povidone iodine solution. Infiltrate 2% lidocaine hydrochloride under the scalp in the intended skull incision area to reduce the intraoperative pain. Apply vet ophthalmic ointment to prevent drying of the eyes.\nApply a sterile drape over the animal and expose the operative sites. Maintain all procedures in sterile conditions.\nPerform a midline skull incision of 2 cm and retract the skin bilaterally with wire retractors. Dry the skull with cotton swaps and hydrogen peroxide.\nAdjust the height of the nose clamp until the bregma and lambda are aligned at the same level. CRITICAL STEP: This alignment is critical to correctly approach a deeper structure, such as in performing an infarct lesion in the internal capsule in the main experiment.\nMake a hole (diameter: 2 mm; AP: -2.04 from bregma; ML: ±3.0 from the midline) using a drill to induce photothrombosis.\nPolish and clean the optical fiber tip of the optical interface. Fix the ONI to the stereotaxic frame without bending. Check the tip of the ONI and wipe it out clearly before and after the insertion of the optical interface.",
    "Measure the laser intensity from the tip of the optical fiber prior to the insertion of the optical interface to the target site of the rat brain. Adjust the laser intensity to 3.5 mW, as confirmed by pre-surgery steps, at the tip of the optical fiber.\nInsert the ONI into the target area of the internal capsule (-7.8 mm confirmed from pre-surgery step) through the drill hole.\nMaintain the body temperature at 37.5 ± 0.5 °C during photothrombosis. A lower body temperature may not produce the expected extent of infarction. Inject Rose Bengal (2 ml/kg) through the tail vein.\nTurn on the 532 nm green laser for 90 sec 1 min after the Rose Bengal injection. After irradiation, gently remove the ONI from the brain. After cleaning the operative site, secure the wound secure the wound with 3-0 nylon suture; release the rat from the stereotactic frame and transfer it to a recovery chamber.\nFor sham-operated group (SOG), perform an identical lesion-making procedure, except for injection of saline (0.2 ml/100 g) instead of Rose-Bengal.\nMaintain the body temperature (37 °C) with heating pad after surgery and administer antibiotics (second generation cephalosporin, 0.1%, 1 ml) via an intramuscular injection. Do not leave the animal unattended until it has regained sufficient consciousness to maintain sternal recumbency. Do not return post-surgical animals to the cage occupied by other animals until fully recovered.\n\tNOTE: Preliminary experiment was performed in the same procedures to find the optimal light intensity from 1 mW to 5 mW and the procedure may be required to acquire the satisfactory extent of lesion in different condition.\n3. Evaluation of Capsular Infarct Lesioning\nBehavioral Testing and Animal Grouping",
    "Perform single pellet reaching tasks as described by Whishaw et al.14 to evaluate the motor deficit of the forelimb every day for 1 week after the stroke modeling. Perform a single pellet reaching task (SPRT) in  food-restricted animals (90% of control body weight) using clear Plexiglas (30 x 15 x 35 cm height) with a 1 cm wide slit and a food shelf in the front of the middle of the front wall.\nPlace a pellet on the food shelf obliquely contralateral to the preferred forelimb. Administer 20 pellets per session for 3 weeks.\n\t\tNOTE: A successful number of SPRTs is defined as a reach in which the animal grasps a food pellet and puts it into the mouth without dropping it.\nCalculate the score as a percentage of successful reaches, which is defined by the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/53281/53281equation1.jpg\n\t\tNOTE: We divide animals into 3 groups: the sham-operated group (SOG), moderate recovery group (MRG), and poor recovery group (PRG). If a post-stroke SPRT score >50%, we classify the rats as the MRG, which indicates the presence of a substantial lesion, but not complete destruction of the target. If the post-stroke SPRT score is <50% compared with the pre-stroke SPRT score, we classify the group as PRG, which indicates complete lesioning in the target.\nNeurohistological Confirmation of Infarct Lesioning\nPerform cardiac perfusion with 4% paraformaldehyde as previously described. After the brain completely sinks in the 30% sucrose solution, perform coronal sectioning at a thickness of 10 µm and an interval of 200 µm using a microtome or cryotome4.\nStain with H&E, Nissl, Luxol fast blue-PAS, Neurofilament protein-L or Glial fibrillary acid protein staining and observe the histological findings to determine the optimal light intensity that can cover the entire breadth of the internal capsule in the target area to observe staining4,17.",
    "Using ImageJ software, measure the volume of the photothrombotic infarct area of the internal capsule on the brain slides.\n\t\t\nTo measure the volume of infarct area, launch the 'ImageJ' software. To open the files to be stacked, select 'Image to Stacks' ('Image' → 'Stacks' → 'Image to Stacks'). Edit file name and select 'Set the Scale' ('Analyze' → 'Set the Scale') to edit scale.\nIn 'Plugins', select 'Measure Stacks' to calculate volume or area of images. Insert the distance interval of 2 images into 'Slice Spacing'. Make a drawing of the ROI (Region Of Interest) of all images and click 'Measure'.\n\t\t\tNOTE: The software 'ImageJ' automatically calculates the area and volume of each image and total volume of them.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}