{
  "id": 19780,
  "origin_website": "Wiley",
  "title": "Generation of Bispecific Antibodies by Functionalized Poly-ADP-Ribose Polymers",
  "procedures": [
    "In this protocol, plasmids expressing full-length human PARP1 with a C-terminal His6-tag, anti-human CD3 monoclonal antibody IgG (clone: UCHT1), and anti-human HER2 monoclonal antibody IgG (clone: trastuzumab; brand name: Herceptin) are used to express the proteins. cDNA of human PARP1 (GE Healthcare Dharmacon) was cloned into the pET-28a(+) vector (Milipore Sigma, cat. no. 69864) for bacterial expression. DNA fragments encoding heavy and light chains of UCHT1 and Herceptin antibodies were cloned into the pFuse vector (Invivogen, cat. no. pfuse-hg1fc2) for mammalian cell expression. Please refer to previous studies for molecular cloning and plasmid preparation (Cheng et al., 2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0005]; Zhang et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0027]). Full-length human PARP1 is expressed via a bacterial expression system, while the antibodies are transiently expressed in mammalian cells. Expressed PARP1 and antibody IgGs are then purified using different chromatographic methods.\nMaterials\nBacterial expression of PARP1 reagents:\n               \nBL21(DE3) bacterial cells (Invitrogen, cat. no. C600003)\nLB broth, Miller (Fisher Bioreagents, cat. no. BP1426-2)\nKanamycin sulfate (VWR, cat. no. 0408-25G)\nZnSO4 (Thermo Fisher Scientific Chemicals, cat. no. 33399)\nIsopropyl-β-D-thiogalactopyranoside (IPTG), dioxane free (Chem-IMPEX INT'L INC., cat. no. 00194)\nPurification of PARP1 reagents:\n               \nPARP1 purification buffers (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-rec-0003])\nHisPur Ni-NTA resin (Thermo Fisher Scientific, cat. no. 88221)\nHeparin sepharose 6 fast flow (Cytiva, cat. no. 17099801)\nSuperdex 200 Increase 10/300 GL (Cytiva, cat. no. 28990944)\nPierce LAL chromogenic endotoxin quantitation kits (Fisher Scientific, cat. no. PI88282)\nAntibody expression and purification from mammalian cells reagents:\n               \nZymoPure maxiprep kit (Zymo Research, cat. no. D4203)\nExpi293F cell line (Gibco, cat. no. A14527)\nBalanCD HEK293 medium (Fuji Film, cat. no. 91165)\nL-Glutamine (Corning, cat. no. 25-005-CI)\nTrypan blue solution, 0.4% (Gibco, cat. no. 15250-061)\nOpti-MEM (Gibco, cat. no. 31985-070)\nPEI MAX, transfection grade linear polyethylenimine-hydrochloride (Polysciences Inc., cat. no. 24765-1)\nProtein G resin (GenScript, cat. no. L00209)\nPhosphate-buffered saline (PBS) (Current Protocols, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0007])",
    "Protein G column elution buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-rec-0001])\n1 M Tris, pH 8.0 (Current Protocols, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0007])\nDialysis tubing, 10-ft (Science First, cat. no. 2852)\nElectroporator with 1-mm gap cuvettes (Bio-Rad)\nIncubator shaker (Series 25, New Brunswick Scientific)\nNanodrop 2000c (Thermo Fisher Scientific)\nErlenmeyer flasks (Nest Biotechnology, cat. no. 783011)\nCentrifuge (Beckman J6B Centrifuge with JS-4.2 rotor & JA-17 rotor)\nFrench Press G-M (Fisher Scientific, cat. no. NC0355680)\n0.45-μm cellulose acetate membranes (Advantec, cat. no. C045A047A)\nGravity flow column (Bio-Rad, cat. no. 7321010)\nAKTA Pure chromatography system (Cytiva)\nAmicon centrifugal filters, 30 kDa (EMD Milipore, cat. no. UFC803008)\nAcrodisc unit with a mustang E membrane (VWR, cat. no. 28140-521)\nVortex (VWR)\nStandard analog shaker (VWR)\nMegafuge 16 (Thermo Fisher Scientific)\nAdditional materials for SDS-PAGE (Gallagher, 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0011])\nBacterial expression of full-length human PARP1\n1. Electroporate BL21(DE3) cells with the constructed pET-28a(+) vector encoding full-length human PARP1.\nVoltage of 1.8 kV for the electroporation in 1-mm gap cuvettes.\n2. Inoculate the transformed bacterial cells in 10 ml LB broth medium containing 50 μg/ml kanamycin overnight.\nUse settings of 37°C and 250 rpm for the shaker.\n3. Transfer the 10 ml LB broth medium into 1 L LB broth medium with 50 μg/ml of kanamycin.\n4. Grow the bacterial cells until a nanodrop OD600 measurement reaches 0.6 to 0.8.\nMake sure to use the LB broth medium for the blank.\n5. Add ZnSO4 with a final concentration of 0.1 mM into the cell medium.\n6. Keep growing the bacterial cells until OD600 reaches 0.8 to 1.0.\n7. Incubate the flask on ice for 1 hr.\n8. Add IPTG of a final concentration of 0.5 mM in order to induce the protein expression, followed by overnight incubation at 16°C.\nUse settings of 16°C and 250 rpm for the shaker.\nPurification of full-length human PARP1",
    "9. Centrifuge the bacterial cell culture using a JS-4.2 rotor for 30 min at 4550 × g, 4°C.\n10. Discard the supernatant and resuspend the cells in lysis buffer.\n11. Lyse the cells by passing through a French Press 3 times at 25,000 psi.\n12. Centrifuge the lysates using a JA-17 rotor for 100 min at 27,000 × g, at 4°C.\n13. Collect the supernatant and filter it through a 0.45-μm cellulose acetate membrane.\n14. Pack a gravity flow column with 5 ml of Ni-NTA resin.\nFor 5 ml of resin, load 10 ml of the resin with storage buffer into the column and open the column to remove the storage buffer.\n15. Add 10 ml of filtered water, followed by 15 ml of equilibrium buffer to equilibrate the column.\n16. Load the filtered solution from step 13 onto the column.\n17. Wash the column with 50 ml high-salt wash buffer.\n18. Elute the protein with 25 ml elution buffer.\n19. Add 25 ml no-salt buffer to the eluted proteins then load the mixed solution to a 5-ml heparin column by a low-pressure peristaltic pump at a flow rate of 3 ml/min.\n20. Place the heparin column on an AKTA Pure chromatography system to elute PARP1 using a gradient of 0% to 100% buffer B in a buffer A at a flow rate of 1 ml/min.\n21. Combine the fractions with eluted PARP1 and spin it down to 500 μl using centrifugal filters with 30 kDa molecular weight cut-off.\n22. Inject the concentrated PARP1 into a Superdex 200 Increase 10/300 GL size-exclusion chromatography column and elute it using gel filtration buffer.\n23. Pass the purified protein through an Acrodisc unit with a mustang E membrane.\n24. Determine the final endotoxin levels using Pierce LAL chromogenic endotoxin quantitation kits.",
    "<0.5 EU mg-1 ml−1 of endotoxin is expected.\n25. Use SDS-PAGE gels to evaluate the purified human PARP1 (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/04b5f1ad-8594-42f7-ac4d-eddf5d7f777c/cpz1958-fig-0002-m.jpg</p>\nFigure 2\nAnalysis of purified proteins, auto-modified PARP1, and generated bispecific antibodies. (A) Coomassie-stained SDS-PAGE analysis of purified PARP1, Herceptin, and UCHT1 antibodies. (B) Immunoblot analysis of PARP1 and PARylated PARP1 by 3′-azido NAD+. (C) Coomassie-stained SDS-PAGE (left) and immunoblot (right) analysis of PARylated PARP1 and the generated bispecific antibodies. Adapted with permission from Cheng et al. (2023[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0005]). Copyright 2023 American Chemical Society.\nTransient transfection of mammalian cells for antibody expression and purification\n26. Amplify the sequence-verified plasmids using maxiprep kits.\n27. Grow Expi293F cells in BalanCD HEK293 medium supplemented with L-glutamine for >3 passages in a 37°C incubator with 5% CO2.\n28. Count the cells using trypan blue stain and passage them to reach at the final density of 5 million cells/ml in 120 ml medium.\n29. Prepare the transfection reagent by mixing 12 ml Opti-MEM medium, 120 μg plasmid encoding antibody IgG heavy chain, 120 μg plasmid encoding antibody IgG light chain, and 960 μl transfection grade PEI-MAX (1 mg/ml).\nAdd the reagents in order and make sure to thoroughly mix the solution by vortexing and inverting in-between each addition.\n30. Incubate the solution at room temperature for 20 min.\nThis allows for the plasmid-reagent complexes to form for efficient transfection.\n31. Add the transfection complexes to the cell medium and incubate the cell medium in the incubator for 2 hr at 37°C with 5% CO2.\n32. Add an additional 120 ml BalanCD HEK293 medium into the cell flasks for a final density of 2.5 million cells/ml in 240 ml medium total.\n33. Incubate the cells in the incubator for 5 days.",
    "34. On day 5, centrifuge the cells 10 min at 100 × g, room temperature, to collect the supernatant with secreted antibodies.\n35. Centrifuge the collected supernatant 30 min at 4000 × g, 4°C, to further remove cell debris or impurities, then collect the supernatant.\n36. Pack a gravity flow column with 2 ml protein G resin and equilibrate the column with 10 ml PBS.\nFor 2 ml of protein G resin, initially load 4 ml resin and storage buffer mixture and remove the storage buffer by opening the column.\n37. Load the supernatant collected in step 34 onto the column.\n38. Wash the column with 15 ml PBS and elute the protein with Protein G column elution buffer (100 mM glycine, pH 2.7).\nCollect the first 10 fractions of 1 ml eluate and measure the protein concentration using a nanodrop. Select only the fractions with significant protein concentrations for the following steps.\n39. Neutralize the fractions with significant protein concentrations with 100 μl of 1 M Tris buffer (pH 8.0).\nAdd 100 μl of 1 M Tris to 1 ml fractions then combine them.\n40. Dialyze the collected fractions against PBS two times (one overnight and one 6-hr dialysis) using 10 kDa molecular weight cutoff dialysis bags at 4°C.\n41. Use SDS-PAGE gels to evaluate each of the purified antibodies (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-fig-0002]).",
    "In this protocol, purified PARP1 from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-prot-0001] undergoes auto-modification with 3′-azido NAD+ in order to generate azido-functionalized PAR polymers. Please refer to a previous study for the synthesis protocol of 3′-azido NAD+ (Zhang et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0027]). Purified antibodies from Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-prot-0001] are functionalized with BCN groups for conjugation with auto-PARylated PARP1 by 3′-azido NAD+ via copper-free click chemistry to form bispecific antibodies.\nAdditional Materials (also see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-prot-0001])\nEndo-BCN-PEG4-N-hydroxysuccinimide (NHS) ester linker (BroadPharm, cat. no. BP-22851)\nDMSO\nPARP1 auto-modification reaction buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-rec-0002])\nAdditional materials and reagents for immunoblotting (Ni et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-bib-0022])\nAntibody NHS-BCN linker conjugation\n1. Add endo-BCN-PEG4-NHS ester linker to purified Herceptin or UCHT1 antibody suspended in PBS at a molar ratio of 20 linkers to 1 protein.\nDissolve the linker in 100% DMSO before addition.\n2. Gently mix the solution and incubate at room temperature for 2 hr.\nBCN is added onto the antibodies via NHS ester-mediated amine coupling reactions.\n3. Buffer exchange the mixture against PBS using 30 kDa molecular weight cut-off Amicon centrifugal filters.\nThis step removes unreacted linkers.\nPARP1 auto-modification\n4. Prepare the reaction buffer.\n5. Incubate the purified human PARP1 (3 μM) in the reaction buffer for 20 min for activation.\n6. Add 150 μM of 3′-azido NAD+ in the reaction buffer and incubate the mixture at 30°C for 8 hr.\nThis step produces PARylated PARP1 by 3′-azido NAD+.\n7. Buffer exchange the mixture against PBS using 30 kDa molecular weight cut-off Amicon centrifugal filters.\nThis step removes unreacted NAD+ molecules.\n8. Perform immunoblot analysis with an anti-PAR antibody (clone: 10H) to evaluate the formation of PAR polymers following auto-modification (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-fig-0002]).\nGeneration of bispecific antibodies\n9. Mix Herceptin-BCN and UCHT1-BCN antibodies and PARylated PARP1 with a molar ratio of 3:3:1, respectively, in PBS.",
    "Use a 2 ml reaction volume with antibodies at a concentration of 2 mg/ml and PARylated PARP1 at a concentration of 0.5 mg/ml for the optimal condition.\n10. Incubate the reaction mixture at room temperature for 3 days.\n11. Load the reaction mixture to a Superdex 200 Increase 10/300 GL column for size exclusion chromatography purification.\nThis step separates the generated bispecific antibodies from unconjugated mono-specific antibodies present in the reaction mix. Each unconjugated antibody is expected to have an molecular weight of ∼180 kDa (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-fig-0002]). Therefore, only fractions of the generated bispecific antibodies (>180 kDa) should be collected to avoid unconjugated mono-specific antibodies in the samples.\n12. Elute the fractions with PBS.\n13. Collect the first peak of eluate and concentrate it using Amicon centrifugal filters with 30 kDa molecular weight cut-off.\n14. Evaluate antibody conjugation using both Coomassie-stained SDS-PAGE gels and immunoblotting (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.958#cpz1958-fig-0002])."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}