{
  "id": 11062,
  "origin_website": "Jove",
  "title": "Transplantation of Induced Pluripotent Stem Cell-derived Mesoangioblast-like Myogenic Progenitors in Mouse Models of Muscle Regeneration",
  "procedures": [
    "1. Assessment of Myogenic and Engraftment Potential\nIn vitro: MyoD-induced differentiation\n\t\nGenerate a stable cell line of IDEMs transduced with the tamoxifen-inducible MyoD-ER lentiviral vector, titrating the multiplicity of infection (MOI; e.g. 1, 5 and 50) using the staining described in 1.1.9 (MyHC) as an outcome of the efficiency of the procedure.\nCoat a 3.5 cm dish with 1 ml of 1% Matrigel and incubate for 30 min at 37 °C.\nWash the plate twice with medium, seed 1 x 105 MyoD-ER transduced IDEMs in the 3.5 cm tissue culture dish and incubate at 37 °C in growth medium.\nExpect that cells reach confluence in one or two days and then add 1 μM 4OH-tamoxifen into the growth medium (1st dose).\nAfter 24 hr, replace the growth medium with differentiation medium supplemented with 1 μM 4OH-tamoxifen (2nd and last dose).\nReplace half of the medium with fresh differentiation medium every other day.\nExamine daily the cultures for myotube formation.\nAfter one week (5 days in differentiation medium), wash the plates gently with PBS and fix with 4 % paraformaldehyde for 5 min at RT.\nPerform an immunofluorescence staining with antibodies against myosin heavy chain (MyHC) to confirm the presence of myotubes. Counterstain with a nuclear dye (e.g. Hoechst).\nThe efficiency of differentiation is evaluated as the percentage of nuclei inside MyHC-positive cells: proceed to the next step if the efficiency is >50%.\nIn vivo: engraftment in a model of acute muscle regeneration",
    "To evaluate the in vivo contribution of MyoD-ER IDEMs to muscle regeneration, the cells are previously labeled with a vector encoding for the green fluorescent protein (GFP) that will enable to trace them inside the tissue. MyoD-ER GFP IDEMs are then injected into adult murine muscles, previously injured with a myotoxin (e.g. cardiotoxin). To avoid immune rejection against xenogeneic (such as HIDEMs) or genetically manipulated/corrected cells it is required to use either immunodeficient or immunosuppressed mice.\n\t\nPretreat the animals with an intra-peritoneal injection of 3.5 μl/g of 10 mg/ml tamoxifen (liposoluble form) 24 hr before transplantation and pretreat cells adding 1 μM 4OH-tamoxifen (aqueous form) into the growth medium overnight before the transplantation day.\nAdminister anesthesia and analgesia to the mouse following the specific guidelines that regulate surgical procedures in the animal facility.\nInject 25 μl of 100 μM cardiotoxin (CTX; from Naja mossambica mossambica; CAUTION: potentially harmful substance) in the tibialis anterior (TA) muscles.\n24 hr after treating the animals with tamoxifen and CTX, detach the cells by trypsinization and count.\nCentrifuge the cells at 232 x g for 5 min.\nWash the cell pellet in Ca2+- and Mg2+-free PBS, centrifuge and then gently resuspend the cell pellet in Ca2+- and Mg2+-free PBS to a final concentration of 106 cells/30 μl, which will be the final volume of each injection.\nInject 30 μl of cell suspension into the previously injured muscles using a syringe with 29 or 30 G needle. Pay particular attention while removing the needle from the muscle. Do it slowly, avoiding spilling the cell suspension through the needle's track. Do not transplant the contralateral TA and use it as control, injecting 30 μl of Ca2+- and Mg2+-free PBS to replicate the conditions of the transplanted one.",
    "Treat the animals with tamoxifen for six additional days and administer analgesia (e.g. Carprofen) for two additional days.\nExplant the muscles from 14 days after transplantation onwards. Process and analyze the samples as detailed in Protocols 4 and 5.\n2. Transplantation in Mouse Models of Muscular Dystrophy\nThis transplantation assay allows evaluating the extent of engraftment of IDEMs in mouse models of muscular dystrophy. The animals, treated as follows, can also be assessed for functional amelioration of the disease phenotype. Functional tests can be performed starting from two weeks after transplantation. In order to enhance engraftment consider performing pretransplantation treadmill exercise (as described in Protocol 3) and/or serial cell injections every three weeks for 3x (i.e. for a total of 3 injections/muscle).\nIntramuscular transplantation\n\t\nPretreat the animals with an intra-peritoneal injection of 3.5 μl/g of 10 mg/ml tamoxifen (liposoluble formulation) 24 hr before transplantation and pretreat cells adding 1 μM 4OH-tamoxifen (aqueous formulation) into the growth medium overnight before the transplantation day.\nDetach by trypsinization, count and centrifuge the cells at 232 x g for 5 min.\nWash the cell pellet in Ca2+- and Mg2+-free PBS, centrifuge and then resuspend the pellet in Ca2+- and Mg2+-free PBS to a concentration of 106 cells/30 μl.\nAdminister analgesia and disinfect the skin of the animal (optional) with a povidone iodine- or chlorexidine-based disinfectant. This will also help to localize the tibialis anterior (TA), gastrocnemius (GC), and quadriceps femoris (QC; specifically the vastus intermedius) muscles.",
    "Inject 30 μl of cell suspension into the muscles using a syringe with 29 or 30 G needle. For the TA, insert 5 mm of the needle 2 mm below the insertion of the proximal tendon (craniocaudal direction) with a 15° inclination relative to the tibia and slowly inject the cell suspension while retracting the needle (empty the syringe with 2 mm of the needle still inside the muscle). For the GC and QC, repeat the same procedure as detailed for the TA, with the main difference being the caudocranial insertion of the needle 2 mm above the myotendinous junction of the Achilles tendon for the GC and 2 mm above the distal tendon for the QC (15° inclination with respect to the femur). Pay attention while removing the needle from the muscle in order to avoid spilling the cell suspension through the needle's track.\n\t\tTROUBLESHOOTING: In case of low engraftment consider injecting juvenile (1-2 weeks old) mice7 with 3 x 105 cells/10 μl (note that in this case tamoxifen needs to be administered subcutaneously).\nIntra-arterial transplantation\n\tThis part of the protocol allows the evaluation of the ability of MIDEMs and HIDEMs to be delivered in the arterial circulation, cross the vessel wall and contribute to skeletal muscle regeneration in the muscles downstream to the injection site.\n\t\nPretreat animals and cells as described above in step 2.1.1.\nDetach by trypsinization and filter with a 40 μm cell strainer (to remove clusters from the cell suspension in the unlikely event that overnight exposure to tamoxifen could drive fusion and formation of myotubes from adjacent cells) count and centrifuge the cells at 232 x g for 5 min\nWash the cell pellet in Ca2+- and Mg2+-free PBS, centrifuge and then resuspend the pellet in Ca2+- and Mg2+-free PBS with 0.2 International",
    "Units of sodium heparin (optional) to a final cell concentration of 106 cells/50 μl. Add 10% Patent blue dye (final concentration: 1.25 mg/ml in normal saline or Ca2+- and Mg2+-free PBS) to the solution in order to visualize the distribution of the cell suspension.\nAdminister anesthesia and analgesia to the mouse according to the guidelines regulating surgical procedures in the specific institutional animal facility.\nShave the inguinal region (also know as femoral or Scarpa's triangle) and disinfect the skin with a povidone iodine- or chlorhexidine-based disinfectant.\nMake a 5-7 mm incision and localize the femoral bundle: vein, artery and nerve (the nerve lays laterally to the artery and the vein medially).\nGently remove the connective fascia that covers the bundle with forceps.\nSeparate the femoral vein and nerve from the artery by gently introducing the tip of a forceps (or a 30 G needle) in between them and by progressively enlarging the hole.\n\t\tTROUBLESHOOTING: The femoral vein is fragile: pay attention not to pinch it with the forceps during its detachment from the femoral artery. In case of hemorrhage, drain the blood with sterile gauze and use a micro cauterizer to facilitate hemostasis.\nLift the artery with one tip of the forceps and clamp the artery with the other tip.\nPuncture the artery with a syringe equipped with a 30 G needle. Inject 50 μl of cell suspension downstream of the clamped area, at an infusion speed of approximately 5 μl/sec.",
    "TROUBLESHOOTING: Carefully resuspend the cells in the syringe before the injection: it is vital to avoid precipitation of cells and air bubble formation inside the syringe. The diameter of the femoral artery is slightly smaller than a 30 G needle: be careful not to truncate the artery while inserting the needle. Patent blue dye allows recognizing the effectiveness of the injection: if correctly injected, the whole limb will rapidly turn light blue.\nSlowly remove the needle and the forceps from the artery to restore bloodstream in the limb.\nApply pressure with sterile gauze to avoid bleeding and/or cauterize as required.\nSuture the wound and monitor the animals until recovery from anesthesia.\nAdminister analgesia for 3 days and inspect the wound daily (in case of wound infection discuss this with the animal facility personnel and administer antibiotics as required).\n3. Outcome Measures on Transplanted Dystrophic Animals: Treadmill Test\nStarting from two weeks after cell transplantation, it is possible to evaluate functional amelioration of the motor capacity of treated mice with the treadmill tests. This test allows the evaluation of exercise tolerance/endurance of treated mice. A mouse is considered fatigued when lays in the resting area for more than 5 sec, without attempting to reengage the treadmill after a series of 3 consecutive mechanical stimuli (one every 5 sec). Baseline measurements start approximately one month before treatment and are used to evaluate the improvement of each single tested animal. This test can be followed by additional assays to monitor fiber fragility, force improvement, engraftment, differentiation of transplanted cells, and morphological amelioration of the transplanted muscles (see Discussion).",
    "Acclimatize the animals (usually three groups: treated, untreated, and wild type/non dystrophic controls) to the exercise before the first measurement: set the treadmill at a speed of 6 m/min for 10 min. Repeat the procedure every other day for one week.\n\tTROUBLESHOOTING: Record all the measurements at the same hour of the day to avoid biases owing to the circadian cycles.\nPlace the animals into the treadmill, which has been previously set up with an inclination of 10°.\nTurn on the treadmill, with a starting speed of 6 m/min (provide a gentle mechanical stimulus in case the animals are not willing to start the exercise).\nStart the timer and increase the speed 2 m/min every 2 min.\nAs soon as an animal lies in the resting area for more than 5 sec without attempting to reengage the treadmill, gently touch it with a stick to stimulate the restart of the exercise (see above).\nRecord the performance (time and or distance) of each animal.\nRepeat the measurements weekly or every 10 days for at least 3x.\nRepeat the same procedure after transplantation.\nAnalyze performance data comparing the measurement of each animal to its baseline performance. We suggest to plot the values in a graph as a percentage of the average motor capacity relative to baseline and to analyze them by a one- or two-way ANOVA test followed by appropriate post-test to compare the groups.\nTROUBLESHOOTING: use a minimum of 5 age-, genotype-, and sex-matched animals/group and repeat the measurements for at least 3x after transplantation.\n4. Evaluation of Cell Engraftment and Differentiation in Transplanted Muscles",
    "Transplanted and control muscles are harvested at the appropriate time point (<2 days for short-term engraftment analysis, 2-3 weeks for mid-term and >1 month for long-term analysis). If the transplanted cells are labeled with GFP, the engraftment in freshly isolated muscles can be assessed by direct fluorescence under an UV-equipped stereomicroscope.\nLay and orient along the vertical axis freshly isolated muscles in tragachanth gum (6% w/v)\nDehydrate the samples in prechilled isopentane for one minute, freeze them in liquid nitrogen for at least 2 min and place them immediately at -80 °C for storage.\nProcess the samples with a cryostat to obtain 7 μm thick sections on polarized slides. Sample the majority of the muscle on the slides, collecting approximately 8-10 slides with 30-40 sections/slide. It is advisable to collect a series of sections into a 1.5 ml tube to perform molecular biology/biochemistry assays.\nEvaluate cell engraftment with different immunofluorescent staining, depending on the experimental setup. For example, in case of HIDEM transplantation in Sgca-null/scid/bg mice, stain sections with: a) an antibody against Lamin A/C to detect grafted human cell nuclei; b) an antibody against Laminin to visualize the overall structure of the muscle; and c) an antibody against Sgca to detect donor-derived restoration of the protein absent in the dystrophic animal.\nQuantify, using a fluorescence microscope, the number of donor nuclei per muscle section inside and outside muscle fibers and the number of donor-derived skeletal myofibers per section.\n5. Muscle Histopathology\nHistopathological analyses allow the evaluation of the morphological structure of the transplanted muscle. Architectural improvement in the tissue structure is expected as an outcome of the cell therapy approach.\nFix the freshly isolated muscles with 4% paraformaldehyde for 1 hr at 4 °C.\nDehydrate the samples with an ascending sucrose gradient (e.g. 7.5-15-30% w/v).",
    "Leave the muscles overnight in the highest sucrose solution.\nEmbed the samples in Tissue Tek OCT, place them in prechilled isopentane until the OCT becomes solid (avoiding complete immersion of the samples), freeze them in liquid nitrogen for at least 2 min and place them immediately at -80 °C for storage.\nProcess the samples with a cryostat to obtain 7 μm thick sections as described above.\nStain the sections with hematoxylin and eosin or Masson's trichrome according to standard manufacturer's protocols.\nHematoxylin and eosin staining enables calculating hallmarks of regenerating muscle, such as: a) the number of myofibers; b) cross sectional area; c) the number of myofibers containing a central nucleus. Masson's trichrome is used to calculate the fibrotic index, done by subtracting the total area occupied by the skeletal myofibers from the total area of the image: the resulting area mainly reflects the connective and fat infiltrate of the muscle. All the analyses on the images could be performed using ImageJ software (NIH) with the measurement tool and cell counter plugin.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}