{
  "id": 1570,
  "origin_website": "Cell",
  "title": "Protocol for the Generation of Human Pluripotent Reporter Cell Lines Using CRISPR/Cas9",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nsgRNA Cloning and Donor Plasmids Construction\nTotal Timing: 2 weeks\nsgRNA Design\nWe design sgRNA targets using the Benchling CRISPR Design Tool ( https://www.benchling.com/#[href=https://www.benchling.com/]). The choice of N vs. C terminal tagging should be based on a literature search and the functional properties of the protein of interest. For example, if an important domain is localized to one end, that end should be avoided. The TBXT gene, the example we used in writing the protocol, is an embryonic transcription factor which binds to a specific DNA element through its N terminus ( Kispert and Herrmann, 1993[href=https://www.wicell.org#bib5]). Therefore, we chose its C terminus for tagging.\nFor TBXT-GFP knockin, the sgRNA target sequence: 5′ ACCTTCCATGTGAAGCAGCA 3′ which the CRISPR is expected to cut right after the STOP codon of the TBXT gene.\nsgRNA Cloning\nOrder Forward and Reverse sgRNA oligos: Forward: 5′ CACC+ “G+ 20 bp sgRNA sequence” 3′ Reverse: 5′ AAAC+ reverse complement of the “G+ 20 bp sgRNA sequence” 3′ As an example of TBXT-GFP knockin, we order the: Forward: 5′ CACC+ “G+ ACCTTCCATGTGAAGCAGCA” 3′ Reverse: 5′ AAAC+ “TGCTGCTTCACATGGAAGGT+C” 3′\nOligos annealing. Prepare the following reaction in an Eppendorf tube, put the reaction tube in boiled water for 10 min, and then let the water temperature gradually cool down to 20°C–22°C.\ntable:files/protocols_protocol_101_3.csv\nGolden gate cloning to ligate the annealed oligos to PX330 vector. Prepare the following reaction in 0.2 mL PCR tube.\ntable:files/protocols_protocol_101_4.csv\nRun the following program in the thermocycler.\ntable:files/protocols_protocol_101_5.csv\nTransformation (day 1). Transform the product in Step 2.4 into a competent E. coli strain (Thermo Fisher Cat# C409601) according to the protocol supplied with the competent cells.",
    "Day 2, pick colonies. Use a sterile pipette tip to inoculate a single colony into a 3 mL culture of LB medium with 100 μg/mL Carbenicillin. Incubate and shake the cultures at 37°C for 16–18 h.\nDay 3, isolate the plasmid DNA from the cultures by using a QIAprep spin miniprep kit according to the manufacturer's instructions.\nSequence validation of CRISPR plasmid. Verify the sequence of each colony by sanger sequencing using the U6-Fwd primer: 5′GACTATCATATGCTTACCGT3′.\nNote: The sgRNA cloning efficiency is generally high. Normally, there are tens to hundreds of colonies on the plate. Pick two or three colonies should be enough to get the sequence correct sgRNA plasmid.\nMake endotoxin free midi-prep plasmid by using ZymoPURE II Plasmid Midiprep Kit according to the manufacturer’s instructions.\nNote: A good quality and endotoxin free plasmid is important for successful electroporation in hPSCs.\nDonor Plasmid Design\nTiming: ∼1–2 weeks\nGibson assembly tool in Snapgene software is a very helpful tool to make the donor plasmid construction strategy. Generally, the donor plasmid contains four parts: (1) the vector backbone; (2) the left homology arm (HAL); (3) the insertion cassette (P2A-H2B-GFP-loxp-PGK-puro-loxp); and (4) the right homology arm (HAR). The structure of the TBXT donor plasmid is shown in Scheme 1[href=https://www.wicell.org#sch1] .\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Sch1.jpg\nScheme 1. The Structure of TBXT Donor Plasmid\nVector backbone. A simple vector backbone, such as PUC57BsaI (Addgene #128859), PUC19 (Addgene #50005), or others can be served for the donor plasmids construction. To generate the TBXT-GFP donor plasmid, we used restriction enzyme SmaI (NEB Cat# R0141S) to linearize the PUC57BsaI vector to process the Gibson cloning.",
    "Homology Left Arm (HAL) and Right Arm (HAR). 400–1,000 bp of HAL and HAR works efficiently for knockin in our hands. The dsDNA of HAL and HAR can be ordered from IDT or other similar companies. To generate the TBXT-GFP donor plasmids, we chose a 400-bp nucleotide sequence before the sgRNA cutting site as HAL, and a 400-bp nucleotide sequence after the sgRNA cutting site as HAR. With this information, we used the Gibson assembly tool in Snapgene software to generate full size of the dsDNA sequence of HAL and HAR with 15 bp identical to the vector backbone and the insert cassette at both sides for the Gibson cloning. The dsDNA sequences of HAL and HAR are listed in Key Resources Table[href=https://www.wicell.org#key-resources-table].\nThe Insertion Cassette (P2A-H2B-GFP-loxp-PGK-puro-loxp). A PCR from an existed donor plasmid is the simplest way to obtain the reporter insertion cassette. To obtain the insertion cassette (P2A-H2B-GFP-loxp-PGK-puro-loxp) for TBXT-GFP reporter, we performed a PCR from a previous published PAX6 donor plasmid (Addgene #105239) using a designed pair of primer Forward (STCLM0014F) and reverse primer (STCLM0015R) (listed in Key Resources Table[href=https://www.wicell.org#key-resources-table]).\nNote: H2B fragment is a nuclear localization signal tag, which allows the H2B fusion protein to localize into the nucleolus. The H2B-GFP fragment is only used for tagging nuclear protein, such as the transcription factors. For tagging a protein that not located in the nucleus, the H2B fragment needs to be removed to allow GFP reflect the subcellular localization of the endogenous protein.",
    "Note: We recommend that whenever possible, choose a sgRNA target site as close as to the KI location. This could not only increase KI efficiency, but the insertion could also disrupt the original sgRNA recognition site. However, if your CRISPR cutting site is far away from the KI location and the insertion does not disrupt the sgRNA target sequence after KI, a silent mutation can be designed on the repair template (eg. on HAL or HAR) to prevent the CRISPR from re-cutting the recombined sequence. To do that, we usually mutate the PAM (NGG) by changing one of the G to an A, T or C (avoid changing NGG to NAG), without changing the resultant amino acid.\nDonor Plasmid Cloning\nTiming: ∼1–2 weeks\nAfter each part of the donor plasmid are designed and obtained, we used the Gibson cloning method to ligate each part to construct the full donor plasmid.\nGibson assembly reaction. Prepare the following reaction in 0.2 mL PCR tube, and run the 50°C for 30 min, and then hold at 4°C in the thermocycler.\ntable:files/protocols_protocol_101_6.csv\nTransform the product in Step 12 into a competent E. coli strain (Thermo Fisher Cat# C409601), according to the protocol supplied with the cells.\nUse PCR to screen the positive colonies. Design the PCR primer pairs that one targets the vector backbone, and the other one targets the insert fragment. For TBXT-GFP donor plasmids, we used M13 forward/STCLM0118R and STCLM0072F/ M13 reverse to screen the positive colonies. The sequences of the primers are listed in Key Resources Table[href=https://www.wicell.org#key-resources-table].\nPick at least 2 PCR positive colonies using a sterile pipette tip and then inoculate each single colony into a 3 mL culture of LB medium with 100 μg/mL carbenicillin. Incubate and shake the culture at 37°C for 16–18 h.",
    "Isolate the plasmid DNA from cultures by using a QIAprep spin miniprep kit according to the manufacturer's instructions.\nSequence validation of the donor plasmid by using M13 forward, M13 reverse primers and the internal primers. For TBXT-GFP donor plasmid, primers (STCLM0118R, STCLM0072F, STCLM0119F, STCLM0051R and PGK-F) are used for sequencing to validate the whole inserts. The sequencing primers are listed in Key Resources Table[href=https://www.wicell.org#key-resources-table].\nMake endotoxin free midi-prep plasmid by using ZymoPURE II Plasmid Midiprep Kit according to the manufacturer’s instructions.\nNote: A good quality and endotoxin free plasmid is important for successful electroporation in hPSCs.\nPlasmids Electroporation and Single-Cell Clone Generation\nTotal Timing: 20–30 days\nWhen the sgRNA plasmid and donor plasmid are ready, hPSCs can be prepared for the knockin experiment which involves plasmids electroporation, puromycin selection and single-cell clone generation.\nElectroporation\nTiming: ∼1 h\nhPSCs preparation. hPSCs are maintained in StemFlex medium. We routinely passage hPSCs at a ratio of 1:6 every 3–4 days using 0.5 mM EDTA. High quality hPSCs with standard growth rate in the absence of random differentiation are important for achieving highly efficient hPSC electroporation.\nhPSCs digestion for electroporation. When the hPSCs reach ∼70%–80% confluency, aspirate the medium, wash the cells once with DPBS, and then add 1 mL Accutase to the cells and incubate at 37°C for 10 min. Add 3 mL of medium and detach cells by slowly pipetting up and down. Collect the cells to a 15 mL conical tube and spin at 120 × g for 3 min. Aspirate the supernatant, add 1 mL StemFlex medium and count the number of cells using the Nexcelom Bioscience Cellometer K2.\nPrepare cells and reagents for one electroporation reaction:\n2 × 106 cells\nMix the reagents: 82 μL P3 Primary Cell Nucleofector Solution and 18 μL Supplement 1",
    "Plasmids: 4 μg sgRNA plasmids+ 5 μg Donor Plasmids. Eg. We electroporated 4 μg of TBXT-GFP sgRNA and 5 μg of TBXT-GFP donor plasmid for TBXT-GFP reporter line generation.\nNote: A single GFP expression plasmid provided in the supplied reagents should be electroporated separately as a positive control for the electroporation.\nNote: Scale up accordingly if doing multiple electroporation reactions. In our experience, 70%–80% confluent of one 6-well of hPSCs is ∼4 × 10 6 cells, which can yield two electroporation reactions.\nTransfer the cell mixture to the Nucleocuvette Vessel using a P200 pipet.\nNote: Avoid creating bubbles when transferring; if there are bubbles, tap the cuvette gently or manually remove them as bubbles may impact the efficiency of the electroporation.\nTransfer the cuvette to the 4D-Nucleofector and electroporate the cells. Select Solution “Primary Cell P3”, Pulse Code “CB-150”, and press “Start”.\nNote: Pulse Code for your hPSC lines can be optimized according to the protocol supplied with the reagents. In our hands, Pulse Code “CB-150” with the Solution “Primary Cell P3” is the best condition for H1 and H9 hESCs nucleofection, and the cell survival rate of post-nucleofection in this condition is routinely around 60% calculated by Cellometer K2 Fluorescent Viability Cell Counter.\nAlternatives: Lonza 2B-Nucleofector or other Nucleofector equipment that you may have in lab can be also tested for hPSCs electroporation. Lonza 4D-Nucleofector works best for hPSCs electroporation in our hands, considering the electroporation efficiency and cell survival rate.\nUsing the provided single-use-pipet, transfer the cell mixture from the cuvette to a 15 mL conical tube containing 12 mL of StemFlex + CloneR medium. Rinse the cuvette once with a small amount of StemFlex + CloneR medium using the pipet and transfer to the 15 mL conical tube.",
    "Transfer the 12 mL cells equally to a fresh Matrigel-coated 6-well plate (2 mL cells in each well, and totally six wells). Place the plate in a 37°C, 5% CO2 incubator for 24 h.\nNote: Gently shake the plate back and forth and front to back to evenly distribute the cells. Avoid circular motions to prevent concentrating cells in the middle or around the edge of the well.\n24 h post electroporation, change to 3 mL fresh StemFlex medium for each well, and check the efficiency of the GFP control plasmid electroporation. We routinely get ∼50% efficiency based on fluoresces microscopic images and flow cytometry results ( Figure 1[href=https://www.wicell.org#fig1]A and 1B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Fig1.jpg\nFigure 1. Electroporation Efficiency of hPSCs\n(A) Fluoresces Microscopic analysis of H1 hESCs at 24 h post-electroporation with a GFP expression plasmid included in the P3 Primary Cell 4D-Nucleofector X Kit L. Scale bars, 250 μm.\n(B) Flow cytometry analysis of GFP+ hESCs at 24 h post-electroporation.\nPuromycin Selection and Collecting the Surviving Clones\nTiming: 4–6 days\nContinue culturing the cells for 2 or 3 days until the cells reach to 70%–80% confluency ( Figure 2[href=https://www.wicell.org#fig2]A), change to 3 mL StemFlex + puromycin (0.5 mg/mL) + CloneR medium for each of the well.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Fig2.jpg\nFigure 2. Representative Images of the Cells after Puromycin Selection\n(A) Bright field image of H1 hESCs at 3 days post electroporation with TBXT-GFP sgRNA and donor plasmids. It shows the cells reach to ∼70%–80% density which is the start point for puromycin selection.\n(B) Bright field image shows the small survived clones after 6 days of puromycin selection. Scale bars, 250 μm.",
    "Puromycin selection will be continued for the following 4–6 days. A dramatic cell death will happen on the first day of puromycin selection and survived small colonies will appear in each well after 4–6 days selection ( Figure 2[href=https://www.wicell.org#fig2]B).\nNote: In rare cases, there are some differentiated colonies after puromycin selection. It is optimal to remove them before collecting and passaging.\nAfter puromycin selection complete, add 1 mL of 0.5 mM EDTA to each well, and leave the plate at 20°C–22°C for 10 min, fully detach the cells in all six wells and collect the cells together in a 15 mL conical tube.\nSpin at 120 × g for 3 min. Resuspend the cell pellet in 1 mL StemFlex medium and transfer the cells to one well of a Matrigel-coated 24-well plate.\nAt the following 2–3 days, culture the cells in StemFlex medium until cells reach ∼80% confluence.\nPause Point: At this point, the cells are in a mixed population which contains corrected knockin cells or other cells. The mixed cells can be collected and frozen. PCR with the mixed population can be performed to confirm the presence of any targeted KI event before splitting for single-cell clone generation.\nSingle-Cell Clone Generation\nTiming: 2–3 weeks\nDetach the mixed cell population with Accutase and incubate in 37°C for 10 min. Resuspend the cell pellet in 1 mL of StemFlex media and count the cell number.\nWe perform single-cell clone generation in Matrigel-coated 96-well plates. For knockin in H1 hESCs, we seeded the cells to 2 × 96-well plates as the number 20 cells/per well. Place the plates in a 37°C, 5% CO 2 incubator. We consider this splitting day to be day 0.",
    "Note: The number of splitting cells to each well is the key condition to generate single-cell clones. hPSC single-cell clone survival rate is extremely low when just splitting one cell/per well. However, if you split many cells per well, the clones will merge together so that the resulted “clones” are not actually a single-cell clone. To balance well, we suggest testing the cell number for splitting for your hPSC line before the knockin experiments. 10–20 cells/per well is a good start for testing.\nNote: The best condition we have tested for the H1 hESCs cell based single-cell clone generation. As a result, we routinely can get ∼30 clones/per 96-well plate, ∼60 clones for two plates.\nNote: StemFlex medium along (without the CloneR or Rock inhibitor) supports for single-cell clone survival and growth in 96-well plate. We try to avoid adding CloneR or Rock inhibitor when it is not necessary since whether CloneR or Rock inhibitor affects pluripotency or cell differentiation of hPSCs it is not fully clear yet.\nDay 0 to day 3, do not move the plate.\nAt day 4, change each well of 96-well plates to 100 μL fresh StemFlex. Tiny colonies will show up.\nDay 5-day 7, no need to change medium.\nAt day 8, change the medium in each well of 96-well plates to 100 μL fresh Stemflex. Around day 7 to day 8, the clones should be discernable easily, where one (the most cases), two or merged clones can be found in each well ( Figures 3[href=https://www.wicell.org#fig3] A–3E). The potential single-cell clones have round edge and without boundary inside a clone ( Figure 3[href=https://www.wicell.org#fig3]A and 3B), while clones of possible two or multiple-cell origin or clones being very close to each other should be excluded ( Figures 3[href=https://www.wicell.org#fig3] C–3E).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Fig3.jpg",
    "Figure 3. Representative Images of Emerging Clones after Splitting with 10–20 Cells/Well of a 96-Well Plate\n(A–E) In most cases, you should see one possible single-cell origin clone in one 96-well, similar to the one shown in (A) and (B) around Day 7 (A) and Day 10 (B) respectively. Clone similar to the one shown in (C) and (D) should be avoided because they are most likely of mixed origin. Two clones in close proximity as shown in (E) should also be avoided. Scale bars, 250 μm.\nDay 9, no need to change medium.\nAt day 10, the colonies are usually big enough to be picked (Figure 3[href=https://www.wicell.org#fig3]B), and split at a ratio of 1:2 (split one clone to two wells of a 96-well plate). There are no digesting enzymes needed. Directly scratch the bottom of the well using a P200 pipet for the splitting. We usually split 20–50 single-cell clones for the follow up assays.\nMark the location of the single-cell clone on the bottom of the well under the microscope. This way you will easily see the location of the clone in culture hood.\nUsing a P200 pipet, gently scratch the marked location on the bottom of the well in a horizontal, vertical, and a circular motion to detach the clone. Pipet up and down gently once, then transfer and split evenly between two wells of a Matrigel-coated 96-well plate.\nMark the number for the splitted clones, such as “1”, “2”, “3” … for each clone. You have now two copies for each clone.\nPlace the plates in a 37°C, 5% CO 2 incubator.\nNote: Clear boundaries can be noticed by eyes if two or more colonies merge together. Do not pick non-single-cell clone in gene editing experiments.",
    "Change to StemFlex medium for the following 2–3 days, and the cell density will be then ∼30%–50% of the well. At this point, 1 copy of each clone is ready for following lysis, PCR and sequencing, and the other copy of each clone is keeping maintained in culture.\nSingle-Cell Clone Screening by PCR and Sequencing\nTotal Timing: 3–7 days\nLysis to Collect Genomic DNA\nTiming: 2–4 h\nRemove medium from each one copy of the clone and wash once by adding ∼100 μL of 1× DPBS.\nRemove 1× DPBS wash and add 20 μL of Sigma Lysis Solution for Blood to each well.\nUsing a P200 pipet, scratch the bottom of the well in a vertical, horizontal, and circular fashion. Slowly transfer cell suspension into the tip and expel into a PCR tube or PCR plate well, labeled respective to the particular clone. (eg. Clone #1 goes into well 1, etc.). Seal tubes/plate.\nNote: Change tips for each well when scratching colonies for lysis.\nQuickly spin down the PCR tubes or plate and immediately move to a thermal cycler.\nIncubate at 75°C for 15 min followed by a 4°C hold.\nCarefully remove the seal and add 180 μL of Sigma Neutralization Buffer to each well. Re-seal and store at 4°C until ready for use as PCR template.\nNote: The prepared lysis is stable for PCR for at least 6 months in our testing.\nPCR to Verify the Positive Single-Cell Clones\nTiming: 1–3 days\nPCR primers design: there are several ways to design PCR primers to amplify the inserts:",
    "Using a pair of the primers that targets to the nucleotide outside of the both homologous arm ( Scheme 2[href=https://www.wicell.org#sch2]). This will be the idea case since one PCR reaction can detect knockin clones and can also differentiate heterozygous or homozygous knockin clones. However, this PCR amplify product is long (>2 kb) and for some cases the PCR reaction does not work well.\nUsing one primer target to the inserts and the other primer target to the nucleotide outside of homologous arm ( Scheme 3[href=https://www.wicell.org#sch3]). In this way, two PCR reactions (5′-end and 3′-end junction PCR) are needed to verify the inserts, and additional a PCR reaction to detect the WT sequence is also needed for detecting heterozygous or homozygous knockin clones. The benefits of this design is the PCR product is usually <1 kb and it is easier to make the PCR works, but more PCR reactions are need for the screening.\nIn our lab, we use one primer targets to one homologous arm and one other primer targets to the nucleotides outside another homologous arm (Scheme 4[href=https://www.wicell.org#sch4]). The design is similar as a), but with shorter PCR length.\nAs the example of PCR screening for H1 TBXT-GFP reporter knockin single-cell clones ( Scheme 5[href=https://www.wicell.org#sch5]): We use primer TBXT-PCR-F1 targets to the HAL, and STCLM0153R targets to the nucleotide outside of the Right homologous arm (HAR) for screening the single-cell clones.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Sch2.jpg\nScheme 2. One pair of the Primers to Amplify the Whole Inserts\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Sch3.jpg\nScheme 3. 5′-End and 3′-End Junction PCR Primers Design\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Sch4.jpg\nScheme 4. Modified PCR Primers Design for Screening Positive Knockin Clones\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Sch5.jpg\nScheme 5. PCR Primers Design for Screening of Positive TBXT-GFP Clones\nFor the PCR reaction:\nPrepare the PCR mix\ntable:files/protocols_protocol_101_7.csv",
    "Note: We recommend using KOD Xtreme Hot Start DNA Polymerase from EMD Millipore for the lysis PCR reaction to screen positive single-cell clones.\nSet the PCR program\ntable:files/protocols_protocol_101_8.csv\nGel electrophoresis for H1 TBXT-GFP single-cell clones.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-UndFig1.jpg\nClone 1, 9, 10, 13, 16, 19, 20 which only have the larger band (3,227 bp) are homologous knockin clone candidates.\nClone 2, 3, 5, 7, 14, 17, 18, 22 which have the larger band (3,227 bp) and the smaller band (653 bp) are heterozygous knockin clone candidates.\nClone 4, 6, 8, 11, 12, 15, 21 which only have the smaller band (653 bp) are wildtype clone candidates.\nSanger Sequencing Verification for PCR Product\nTiming: 2–5 days\nFor which only have one clear band of the PCR products, we do enzymatic cleanup using ExoSAP before sending for sequencing. Prepare the following reagent, and 37°C for 30 min and then 4°C hold.\ntable:files/protocols_protocol_101_9.csv\nFor which have two bands of the PCR products, we do gel extraction to purify them before sending for sequencing.\nSend the purified PCR product for sequencing to confirm the junctions between the original genomic DNA sequence and the insert sequence and the sequence of the wildtype allele.\nAn example of H1-TBXT-GFP single-cell clone sequencing and the alignment results are shown in Figures 4[href=https://www.wicell.org#fig4]A and 4B.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Fig4.jpg\nFigure 4. An Example of H1-TBXT-GFP Single-Cell Clone Sequencing Results\n(A) Sanger sequencing results with primer TBXT-PCR-F1 confirms the 5′ end junction of the insert in the genome of the single-cell clone 1.\n(B) Sanger sequencing results with primer STCLM0072F confirms the 3′ end junction of the insert in the genome of the single-cell clone 1.",
    "Note: To make sure the KI clones are bona fide one-cell origin, a subsequent round of subcloning is required to verify the selected clones are indeed a homogeneous population by Sanger sequencing.\nFunctional Characterization of the Corrected Knockin Reporter Lines\nTotal Timing: ∼1 week\nFor generating tissue-specific reporter line in hPSCs, it is important to perform the functional characterization of the line through tissue-specific differentiation. In this protocol, we generated TBXT-GFP reporter lines based on H1 hESCs. TBXT gene encodes Brachyury, an embryonic nuclear transcription factor involves in the transcriptional regulation of genes required for mesoderm formation and differentiation, and TBXT gene is widely used as a marker gene in hPSC mesoendoderm differentiation ( Lian et al., 2013[href=https://www.wicell.org#bib6]). Here, we performed a one-day mesoendoderm differentiation using an established protocol (Lian et al., 2013[href=https://www.wicell.org#bib6] ) to monitor the GFP signal by imaging and flow cytometry analysis.\nMesoendoderm Differentiation\nWe performed mesoendoderm differentiation for one homozygous knockin clone (clone #1) and one heterozygous knockin clone (clone #2). When cells are 70%–80% confluency, detach the cells with Accutase and count the cell number.\nNote: Freeze all the sequencing-confirmed knockin clones for backing up in case aberrant karyotyping and differentiation happened in the selected clones.\nFor each clone, split ∼250,000 cells / well to three wells of a Matrigel-coated 24-well plate. The rest of the cells can be expanded or frozen down.\nOn the next day, add 1 mL of RPMI + B27(-insulin) + 10 μM CHIR99021 medium to each well (Day 0).\nDay 1, GFP+ cells can be detected in the differentiated cells under fluorescence microscope, but not in the cells at the undifferentiated stage (Figures 5[href=https://www.wicell.org#fig5] A–5H).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Fig5.jpg\nFigure 5. Functional Characterization of the TBXT Reporter Lines",
    "(A–H) Fluoresces microscopic analysis of a H1 TBXT-GFP homozygous reporter line clone #1 (A–D), and a heterozygous reporter line clone #2 (E–H) before and after mesoendoderm differentiation. Day 0 indicated the cells before differentiation and day 1 indicate the cells after differentiation. Representative bright field and GFP images for Clone #1 at day 0 (A and B), Clone #1 at day 1 (C and D), Clone #2 at day 0 (E and F), and Clone #2 at day 1 (G and H). Scale bars, 250 μm.\nThe undifferentiated cells (day 0), and the differentiated cells (day 1) was also fixed with BD Cytofix Fixation Buffer at 20°C–22°C for 10 min, and then stained by Brachyury APC-conjugated Antibody for flow cytometry analysis. The results showed >90% of the differentiated cells became Brachyury and GFP double positive, while Brachyury and GFP expression were both negative at day 0, suggesting a faithful GFP expression of the TBXT-GFP reporter line (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/101-Fig6.jpg\nFigure 6. Flow Cytometry Analysis of the H1 TBXT-GFP Homozygous Reporter Line Clone #1 and the Heterozygous Reporter Line Clone #2 before and after Mesoendoderm Differentiation\nThe day 1 differentiated cells showed >90% of Brachyury+GFP+, while both Brachyury and GFP expression were negative at day 0."
  ],
  "subjectAreas": [
    "Cell Differentiation",
    "Stem Cells",
    "Crispr"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}