{
  "id": 5916,
  "origin_website": "Bio",
  "title": "Analysis of Direct Interaction between Viral DNA-binding Proteins by  Protein Pull-down Co-immunoprecipitation Assay",
  "procedures": [
    "This protocol analyzes the direct interaction between two DNA-binding proteins by pull-down co-immunoprecipitation (Figure 1). In this protocol one of the proteins, P1 from bacteriophage Bam35, is overexpressed in E. coli as an HA-tagged recombinant protein and bound to the HA-affinity resin. Three different IPs are performed, using Nt- or Ct-tagged P1 with the HA motif (HA-P1 and P1-HA, respectively), as well as the empty plasmid as a negative control. After a washing step, the putative partner protein, B35TP, is incubated with the P1 bound to the resin. This might also be done using both extracts or both purified proteins. We advise not to use cell extracts in the second step in order to avoid false positives derived from interactions mediated by third proteins with the HA-tagged recombinant protein.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171229/20171229010615_6139.jpgFigure 1. Flow chart of the co-immunoprecipitation procedure Bacterial cell-free extract preparation (Figure 1A)Inoculate a starter culture of E. coli BL21(DE3) harboring the corresponding expression vector or the empty plasmid (as a control to reduce false positives) from a -80 °C glycerol stock in 10 ml LB with 150 µg/ml of ampicillin and 40 mM glucose in 50 ml flasks. Grow overnight at 37 °C, 200 rpm. Different expression vectors may require different antibiotics.Dilute saturated cultures 1:100 in 10 ml of fresh TYM-5052 media supplemented with 150 µg/ml of ampicillin and incubate at 30 °C for 16 h in 50 ml flasks. This step may require optimization for each particular recombinant protein. Harvest the bacterial cells by centrifugation for 1 min at 20,000 x g at 4 °C. If required pelleted cells could be stored at -80 °C.Resuspend pellet in 450 µl of sterile PBS pH 8 (see Recipes) supplemented with protease inhibitor.",
    "Notes:  PBS at pH 8 was used because of the high isoelectric point of many DNA-binding proteins, which in the case of B35TP strongly affects its stability and function in vitro (Berjón-Otero et al., 2016). This may need to be optimized for each protein.Protease inhibitor tablets can be added directly to the buffer according to the manufacturer’s instructions. However, since we prefer to prepare a small volume of each buffer, we prepared a 5x stock in PBS buffer (kept at -80 °C) and diluted up to 1x prior to use.Add 50 µl of lysozyme 10 mg/ml and incubate for 20 min on ice.Disrupt the cells by sonication.Set the sonicator at amplitude of 18 µ.Sonicate the bacterial suspension on ice for 2-5 sec.Keep on ice for 15-30 sec to avoid overheating of the sample.Repeat 6-8 times Steps A6b and A6c.Add 1.5 µl of benzonase and 2.5 µl of 500 mM MgCl2 and incubate for 30 min at room temperature. Stop the reaction by adding 1.5 µl of 500 mM EDTA. Note: This step is essential to rule out DNA-mediated indirect interactions between DNA-binding proteins. Centrifuge for 10 min at 20,000 x g at 4 °C to pellet cellular debris.Transfer the supernatant containing the cell-free protein extract to a new 1.5 ml microcentrifuge tube. We recommend performing the immunoprecipitation on the same day.Co-immunoprecipitationImmunoprecipitation of the bait protein expressed in bacteriaPrepare the required tubes by adding 50 µl of Anti-HA agarose to a 1.5 ml microcentrifuge tube. In this case, we used three tubes for the extracts of bacteria expressing HA-P1 and P1-HA, and the negative control.Centrifuge for 10-20 sec at 12,000 x g at 4 °C and discard the supernatant.Wash the resin twice with one resin volume of PBS pH 8 supplemented with complete protease inhibitor.",
    "Centrifuge for 10-20 sec at 12,000 x g at 4 °C and discard the supernatant.Add the bacterial cell-free extract from Procedure A to the resin. Incubate the mixture at 4 °C for 18 h on a rotating wheel.Spin briefly (10-20 sec, 12,000 x g) at 4 °C and keep the supernatant for analysis of binding efficiency. Samples for analysis can be stored either on ice or at -20 °C for a longer period of time.Wash the resin with ten volumes of PBS-T pH 8 (see Recipes) for 5 min at 4 °C on a rotating wheel. Spin briefly (10-20 sec, 12,000 x g) at 4 °C and repeat three times. Keep the supernatant of the three washing steps for analysis.Pull-down co-immunoprecipitation of putative interacting proteinsAdd a mixture of 2 µg of the purified putative partner protein and 30 µg of bovine serum albumin in 500 µl of PBS-T to the resin and incubate at 4 °C for 2 h on a rotating Wheel. We used purified B35TP as partner protein, which was purified and quantified as described in Berjón-Otero et al., 2016.Wash the resin as before (Steps B1f-B1g).Note: It is recommended to transfer the resin to a new tube before the last wash step to discard proteins that may be retained on the plastic.Elute the bound proteins with 50 µl of 1x Laemmli SDS-PAGE sample buffer (see Recipes).Note: According to the manufacturer’s instructions, immunoprecipitated proteins can usually be eluted with 0.1 M glycine pH 2.0-2.8 for downstream procedures.Western blottingAdd 4 µl of 4x Laemmli SDS-PAGE sample buffer to 10 µl of binding and washing samples. Heat all samples (elution samples included) to 95-100 °C for 3 min and spin briefly (10 sec at 10,000 x g).",
    "Load samples onto an SDS-PAGE gel (5 µl of the elution sample and the entire volume of binding and washing samples) and load 6 μl eBlueTM Plus2 Pre-stained Protein Standard to determine molecular weights.Electrophoresis at constant 150 V for one hour.Note: Gels can be stained by incubation for 1 h in Coomassie Blue solution and destained by incubation for 1 h in destaining solution instead of/besides doing Western blotting. For staining protocol see He (2011).Transfer to PVDF membrane using transfer buffer (see Recipes) and pieces of Grade 3MM Chr Blotting Paper (constant 100 V for 90 min at 4 °C).Notes: In this case, because of the high isoelectric point of the protein, a modified transfer buffer with 0.025% SDS and without methanol was used (see Recipes and Figure 2).To improve the transfer result, it is highly recommended to equilibrate both gel and membrane in the corresponding transfer buffer (5 min at room temperature).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171229/20171229011402_4047.jpgFigure 2. Effect of WB transfer buffer on B35TP detection. Increasing amounts of B35TP were separated by 15% SDS-PAGE and wet-transferred for 40 min either in standard transfer buffer (see Recipes) or in modified transfer buffer (see Recipes). The range of detectable protein amount may need to be optimized. WB was carried out as described in the text and, after detection (lower panels), PVDF membranes were stained with Coomassie Blue solution (upper panels).Wash membrane with PBS for 20 sec.Incubate membrane in 100% methanol for 20 sec and dry at room temperature.Incubate membrane in 20 ml of blocking solution (see Recipes) for 30 min at room temperature or overnight at 4 °C.Incubate membrane with the primary antibody (concentration depends on the antibody) in 10 ml antibody dilution buffer with gentle agitation for 1 h at room temperature.Wash three times for 10 min each with 20 ml of PBS-T.",
    "Incubate membrane with the secondary antibody (concentration depends on the antibody) in 10 ml antibody dilution buffer with gentle agitation for 1 h at room temperature.Wash five times for 5 min each with 20 ml of PBS-T.Incubate membrane with 2 ml ECLTM Blotting Reagents for 1 min at RT.Drain membrane of excess developing solution, wrap in plastic wrap and expose to X-ray film."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}