{
  "id": 18956,
  "origin_website": "Jove",
  "title": "The Goeckerman Regimen for the Treatment of Moderate to Severe Psoriasis",
  "procedures": [
    "1. Evaluation and Preparation\nPerform a complete history and physical prior to initiating therapy. In the history and physical, document important information such as current/past medications, response to past psoriasis therapies, any history of adverse reactions to ambient sunlight or phototherapy, severity of pruritus, and sleep quality.\nSet up a clinic room with all the necessary material for dermal application of medications and occlusion [See Materials Section and Figure 1]. Also, place other materials in the room such as gloves, plastic wrap, socks, and scrubs/pajama gowns.\nAssess the patient for diffuse and intense erythema prior to starting therapy.\nIf the patient exhibits widespread or intense erythema, perform a \"cool down\" procedure (see below) until the erythema is significantly reduced. If no widespread or intense erythema is seen, proceed to the \"phototherapy + tar\" step.\n2. Cool Down (If Needed)\nApply topical corticosteroids to the affected areas. Apply triamcinolone 0.1% ointment to the trunk and extremities, desonide 0.05% cream/ointment to the face/axillae/groin, and fluocinolone 0.01% oil or triamcinolone 0.1% lotion to the scalp. Reserve clobetasol 0.05% ointment for areas with the most intense inflammation.\nOcclude the topical medications with plastic wrap for the trunk and extremities, impermeable gloves for the hand and shower caps inside socks for the feet, and a shower cap for the scalp.\nCool down the patient until the erythema is significantly reduced (range from 3-14 days).\n3. Phototherapy + Tar\nAfter the patient finishes the cool down period, administer phototherapy daily in the morning prior to the application of crude coal tar [Figure 2]. Phototherapy options include narrowband UVB (most commonly used in psoriasis) or broadband UVB (most commonly used in eczema). Determine the initial phototherapy dose by Fitzpatrick skin type [see Table 1 and Table 2].",
    "Slowly titrate the subsequent phototherapy doses upwards as tolerated. Dosing regimen and schedule need to be individualized based on patient response to phototherapy.\nAfter phototherapy, apply 2% crude coal tar (CCT) in aquaphor topically to affected areas of the body [Figure 3]. If patient has scalp involvement, apply 20% liquid carbonis detergens (LCD) in nutraderm to the scalp.\nInitially, use 2% CCT (lowest strength). On subsequent treatment days, increase the strength of the tar as tolerated by the patient from 2% to 5% and then to 10% to achieve better results.\nFor thickened areas of psoriasis, use tar compounded with salicylic acid (2%/5%/10% salicylic acid) to help reduce the scaling and induration of the plaques. Initially use preparations of 2% salicylic acid with 10% CCT, and titrate the percentage of salicylic acid up as tolerated by the patient on subsequent days. Salicylic acid may be contraindicated in patients with diabetes or gastric ulcers.\nOcclude topical tar in the same manner as described in step 2.2 for the cooling down procedure.\nKeep topical medications on the skin for at least 4 hr. After a minimum of 4 hr, remove the occlusion materials and wash off the tar in the shower with mineral oil and soap [Figure 4].\nGive the patient 20% LCD in aquaphor and 20% LCD in nutraderm to apply on the body and scalp, respectively, at home.\nPatients with eczema tend to have sensitive skin. Use 2% CCT initially for eczema patients. Be careful when titrating up to 5% CCT, as patients with eczema tend to have sensitive skin. Do not use 10% CCT (or any percentage of CCT higher than 5%) and do not use any preparations with salicylic acid.\n4. Daily Assessment",
    "Each day, perform an evaluation and assess the patient's skin and response to treatment. Evaluate specifically for sensations of burning, which can indicate the patient's inability to tolerate light therapy, or itching, which can indicate irritation from the tar and/or plastic wrap.\nIf a patient exhibited signs of burning (burning sensation, significant increasing erythema, or rarely increased itch as a harbinger of impending burn if dosimetry is increased further), decrease phototherapy dose or do not give phototherapy that day, as it may have been caused by a phototoxic reaction to the previous UV light dose.\nIt is not uncommon for patients to have different regional anatomical responses and tolerability to phototherapy. For optimal treatment, adjust the amount of phototherapy dose exposed to different regions of the body according to patient's response. For example, if a patient experiences mild burning of the trunk, then first treat the entire body with the lowered phototherapy dose, than cover the trunk, and give additional light to the extremities.\n5. Discharge Planning and Maintenance\nContinue Goeckerman therapy until disease is cleared and patient is ready to be discharged.\nPlace patients on a maintenance program, which can include outpatient phototherapy and topical medications\nAdminister outpatient phototherapy three times a week (for at least the first month). Eventually the frequency is gradually tapered down to twice a week and then once a week)\nOutpatient topical medications include: Triamcinolone cream/ointment to the body twice daily, Clobetasol to recalcitrant lesions (if needed) twice daily, 20% LCD in aquaphor to the body and 20% LCD in nutraderm to the scalp.\nWithin a month of discharge, schedule a follow up physician visit with the patient to monitor disease state.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}