{
  "id": 10472,
  "origin_website": "Jove",
  "title": "A Tripeptide-Stabilized Nanoemulsion of Oleic Acid",
  "procedures": [
    "1. Synthesis of the Oleic Acids–Platinum(II) Conjugate\nActivation of cisplatin\n\t\nSuspend 50 mg (0.167 mmol) of cisplatin in 4 mL of water (e.g., nanopure) at 60 °C.\nAdd dropwise 55.2 mg (0.325 mmol) of AgNO3 in 0.5 mL of water to the solution of cisplatin and stir the reaction for at least 2 h at 60 °C. The white precipitate of AgCl will form indicating the progress of the reaction.\nTo determine if the activation reaction is completed, perform the test with 10% HCl for the presence of free Ag+ ion in solution. The test should be negative (no additional AgCl precipitate should form).\nCentrifuge the reaction mixture at 3,220 x g for 10 min and remove the white precipitate of AgCl.\nCollect the supernatant and filter it via a 0.2 μm syringe filter. Test the supernatant for the presence of platinum by applying 2-3 drops of the solution via Pasteur pipette to SnCl2 crystals. The test is positive if the color of coordinate complex of tin with platinum is dark yellow/orange.\nUse the supernatant with activated Pt(II) for the second step.\nReaction of oleic acid with activated Pt(II)\n\t\nSuspend 94.2 mg of oleic acid (0.333 mmol) in 3 mL of water at 60 °C.\nAdd 13.3 mg (0.333 mmol) of NaOH in 1 mL of water, and mix with the solution of activated Pt(II) from step 1.1\nStir the reaction for 2 h at 60 °C and next at room temperature overnight. The crude product is an oily brown/yellow precipitate.\nCentrifuge the reaction mixture at 3,220 x g for 10 min and remove the supernatant. Dry the crude product at 25 °C using a rotary evaporator. Purify the product by multiple washes with acetonitrile. The final color of pure oleic acids–Pt(II) conjugate is pale yellow.",
    "2. Synthesis of KYF-Pt-NE, and the FITC-labeled Nanoemulsion FITC-KYF-Pt-NE\nSynthesis of the KYF tripeptide and the fluorescently labeled tripeptide FITC-KYF\n\t\nSynthesize the KYF using standard solid-state peptide chemistry. Use the following standard coupling conditions to attach each amino acid: Wang resin (2.19 mmol), Fmoc protected amino acid (4.38 mmol), 2-(1H-Benzotriazole-1-yl)-1,1,3,3-tetramethylaminium tetrafluoroborate (TBTU) (4.38 mmol) and diisopropylethylamine (DIPEA) (8.76 mmol). Dissolve the amino acids with TBTU in dimethylformamide (DMF) and DIPEA.\nSoak 5.7 g of Fmoc-L-Phe 4-alkoxybenzyl alcohol resin (0.382 meq/g) in 25 mL of DMF for 1 h prior to use.\nDeprotect the amine group of L-phenylalanine amino acid with 15 mL of 20% piperidine/DMF solution for 5 min, discard the solvent and repeat the wash with 20 min cycle.\nWash the resin for 1 min with the following solvents: DMF, isopropyl alcohol (IPA), DMF, IPA, DMF, IPA, DMF, DMF. Discard the solvent after each wash.\nPerform the Kaiser test to determine the presence of free NH2 group on the resin (see substeps) and if positive (the resin seed is purple), add the Fmoc-L-tyrosine amino acid and perform the coupling overnight.\n\t\t\nPrepare Kaiser test solutions in separate bottles.\nDissolve 5 g of ninhydrin in 100 mL of ethanol.\nDissolve 80 g of phenol in 20 mL of ethanol.\nMix 2 mL of 0.001 M aqueous solution of potassium cyanide with\n\t\t\t98 mL of pyridine.\nAdd 2-3 drops of each Kaiser test solutions to sample and heat in boiling water for 5 min.\nUpon successful coupling of second amino acid, perform the Kaiser test and if negative proceed with deprotection protocol (steps 2.1.3 to 2.1.5). Repeat the process with the Fmoc-phenylalanine amino acid.",
    "Upon coupling of all amino acids, wash the resin for 1 min with 5 mL of DMF, IPA, DMF, methanol, dichloromethane and diethyl ether, after each wash discard the solvent. Save the resin for further processing.\nUse half of the resin for the next steps (2.1.7-2.1.9) to modify the peptide with FITC. To obtain unmodified KYF tripeptide, follow the procedure starting at 2.1.10.\nModify the N-terminal amino acid of the KYF to KYF-N3 with 6-azidohexanoic acid. To this end, mix 1 g (0.382 mmol) of KYF Wang resin and 120.1 mg (0.764 mmol) of 6-azidohexanoic acid with 245.2 mg (0.764 mmol) of TBTU and 197.1 mg (1.528 mmol) of DIPEA in 30 mL of DMF. Stir the reaction overnight at room temperature.\nObtain the KYF-FITC from the synthesis of the KYF-N3 with propargyl fluorescein via a click reaction. To this end, mix 253 mg (0.097 mmol) of the KYF-N3 Wang resin with 3.78 mg (0.019 mmol) of CuI solid, 71.9 mg (0.193 mmol) of propargyl fluorescein, and 2.24 mg (0.017 mmol) of DIPEA. The reaction should change color from green to brown.\nAfter 24 h, wash the resin for 1 min alternately with 5 mL of DMF and IPA five times, methanol and water thrice, DMF and water thrice, and with dichloromethane and diethyl ether thrice. Discard the solvent after each wash.\nCleave the KYF-FITC or KYF peptide from the resin with a solution of trifluoroacetic acid (TFA)/triisopropylsilane (TIPS)/H2O at the ratio of 95/2.5/2.5 over 3 hours.\nPrecipitate the crude peptide in a cold diethyl ether, wash thrice with cold ether, and then dry under the vacuum.\nSynthesis of FITC-KYF-stabilized nanoemulsion with Pt(II) (FITC-KYF-Pt-NE) and KYF-Pt-NE\n\t\nDissolve 10 mg (0.0126 mmol) of oleic acids–Pt(II) conjugate in 1.5 mL of isopropanol and place in a 5 mL syringe.",
    "Place the syringe with oleic acids–Pt(II) conjugate in a syringe pump and set the flow to 0.1 mL/min.\nIn order to synthesize the FITC-KYF-Pt-NE, dissolve 1 mg (0.00105 mmol) of FITC-KYF and 1 mg (0.00219 mmol) of KYF (1:2 molar ratio of FITC-KYF:KYF) in 20 mL of water and adjust the temperature of the solution to 37 °C. Cover the walls of the container with aluminum foil to avoid photobleaching of the FITC fluorophore. To synthesize the KYF-Pt-NE, dissolve 2 mg (0.0044 mmol) of KYF tripeptide in 20 mL of water and adjust the temperature of the solution to 37 °C.\nAdd the oleic acids–Pt(II) conjugate dropwise to the solution of FITC-KYF/KYF or KYF tripeptide. Perform this step under the hood.\nStir the solution overnight at room temperature to evaporate organic solvents and to allow the self-assembly of FITC-KYF-Pt-NE or KYF-Pt-NE.\nConcentrate the FITC-KYF-Pt-NE or KYF-Pt-NE in a centrifugal concentrator (10k MWCO), and wash thrice with 4 mL of the nanopure water.\nStore the aqueous solutions of KYF-Pt-NE and FITC-KYF-Pt-NE at 4 °C.\nAnalyze for platinum content using atomic absorption spectroscopy (AAS), following the manufacturer’s guide48.\n\t\t\nPrepare platinum standards in 10% HCl solution for the calibration curve (effective range for AAS is between 100 to 1,200 ppb (parts per billion)).\nDissolve 50 µL of KYF-Pt-NE solution from step 2.2 in 100 µL of aqua regia (a mixture 3:1 of concentrated hydrochloric acid and nitric acid) and leave at room temperature overnight. Add 850 µL of water to reach a final sample volume of 1 mL. Analyze the sample using AAS. The final acid concentration should be 10% in all analyzed samples.\nRecord the reading of Pt concentration in ppb, and compute the final platinum content in the sample (account for sample dilution and initial volume of nanoemulsion).",
    "3. Confocal Imaging of the Cellular Uptake of FITC-KYF-Pt-NE\nSeed 6 ovarian cancer cell lines (A2780, CP70, SKOV3, OV90, TOV21G, and ES2), into 4 well-chamber confocal dishes at the density of 4.7 x 104 cells per chamber, and pre-culture overnight at 37 °C.\nAfter 24 h, wash the cells thrice with phosphate buffer saline (PBS) and incubate with FITC-KYF-Pt-NE in cell culture medium (see step 6.1 for cell line specific details) for 15 min at 37 °C.\nAfter incubation, remove the media and wash the cells three times with PBS.\nFix the cells with cold methanol for 5 min at -20 °C and wash three times with 1 mL of PBS.\nPermeabilize the cells with 1 mL of 0.1% Triton-X for 10 min at room temperature and wash three times with 1 mL of PBS.\nIncubate the cells for 90 min with LAMP1 antibody conjugated with Alexa Fluor 647 (1 mL) at 1:50 dilution in PBS at room temperature. Next, wash the cells 3 times with PBS.\nDilute DAPI stock solution (1 mg/mL) to 1 μg/mL in PBS. Then, add 1 mL of the diluted solution to each chamber and incubate for 15 min at room temperature. Wash the cells 3 times with PBS.\nMount coverslips on a slide using mounting medium.\nImage the cells using live cell confocal microscope at excitation wavelength of 405 nm, 488 nm and 633 nm. Set the detection parameters as follow: laser power from 0.2% and no more than 1%, Pinole 1 Airy unit, Gain master 650-750, Digital offset 0.\nOpen image in imaging software. Under displayed image, select Graphics and select Insert Scale Bar, to insert the scale bar to the image.\n4. Drug Release Studies",
    "Carry out the drug release studies in PBS. Adjust the pH values of three PBS buffers to 7.4, 6.8 and 5.0 respectively.\nDilute 5 μL of KYF-Pt-NE in 180 μL of appropriate pH PBS buffer, transfer to 3.5 kDa MWCO mini dialysis cup and incubate at 37 °C in PBS.\nRemove buffer from each three mini dialysis tubes at 2, 4, 6, 24, 48, and 140 h, and measure the platinum concentrations by AAS. Prepare all samples according to step 2.2.8 but adjust the final volume of the sample to 500 µL.\n5. Cell Culture Methods\nCulture cell lines A2780, CP70, SKOV-3, OV-90, TOV-21G, ES-2 in cell culture medium (DMEM) supplemented with 10% (A2780, CP70, SKOV-3, ES-2) or with 15% (TOV-21G, OV-90) fetal bovine serum (FBS), with L-Glutamine and penicillin/streptomycin. Grow all cells in a 5% CO2, water saturated atmosphere at 37 °C.\nSeed 3 x 105 cells in each 96-well plate and pre-culture overnight for in vitro incubation experiments. Prepare the KYF-Pt-NE, cisplatin, and carboplatin solutions in water. Adjust the concentration of Pt(II) in KYF-Pt-NE to match the concentration of carboplatin and cisplatin for each cell line. Incubate for 72 hours at 37 °C.\nAfter incubation, evaluate the cellular viability using a colorimetric assay (the MTT Cell Proliferation assay). Briefly, remove medium and add 110 μL of 10% MTT in medium to each well and incubate for 2 h at 37 °C. Then add 100 μL detergent to each well and incubate for 5 h at 37 °C.\nCheck the absorbance at 570 nm by using plate reader. Analyze results using statistical analysis with Z-test and P-test.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}