{
  "id": 4210,
  "origin_website": "Cell",
  "title": "3D in vitro culture system to study collective migration in mammary organoid epithelium",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMammary gland harvest and organoid preparation\nTiming: 2.5 h\nPreparation of properly-sized organoids.\nBased on our experience, this migration assay works the best when the size of the organoids is between 100 and 200 μm. Mincing of mammary glands (MGs) at around 300–400 times per mouse is optimal for getting enough properly-sized organoids. Moreover, minimizing the number of dead cells and maximizing the vitality of the organoids is essential for the success of the migration assay. Thus, the entire organoid preparation procedures, which are shortened when compared to the most commonly used organoid preparation protocols, need to complete as fast as one possibly can.\nTo harvest mammary glands, first put two 10 cm Petri dishes and surgery tools on the surgery table and turn on the dry glass bead sterilizer.\nTurn on 37°C heat block and 37°C shaker in tissue culture room.\nWarm-up DMEM/F12 bottle to room temperature in tissue culture hood.\nPrepare collagenase digestion solution:\nAdd 0.02 g collagenase to a 15 mL tube containing warm 9.3 mL of DMEM/F12, and put it on a 37°C shaker.\nNote: Before mincing the mammary glands: add 0.5 mL of FBS, 200 μL of 100 mg/mL trypsin, 10 μL of 50 mg/mL gentamicin, 25 μL of 2 mg/mL insulin. Sterilize the solution by running it through a 0.22 μm vacuum filter.\nCritical: Collagenase does not dissolve well. So add it to the medium early to allow more time for it to dissolve. Add the trypsin stock solution last, i.e., right before the filtration step, to minimize collagenase digestion by trypsin. Collagenase digestion solution should be freshly prepared each time.",
    "Prepare to harvest the MGs from a mature virgin female mouse of 6–10 weeks of age. Sterile techniques should be used on an open bench during mammary gland harvest.\nWipe down the dissection station with 70% ethanol.\nDisinfect the dissecting tools by heat in a glass bead sterilizer at 280°C for 1 min. Cool the surgical tools on an open Petri dish.\nSterilize all the surgical supplies, a surgical board (a Styrofoam board covered in an aluminum foil ), and pins with 70% alcohol. Use sterilized cotton swabs during mammary gland harvest.\nEuthanize the mouse in a CO2-saturated chamber for 3–5 min, followed by cervical dislocation.\nWith the carcass on its back, pin it to the surgical board. Then spray with 70% ethanol until the fur is soaking wet.\nTo harvest the #3, 4, and 5 MGs from the mouse, identify the midline between the two hind legs. Pinch a small piece of the skin with a tweezer (JZ, Cat# JD1080), and make a small incision on the abdominal skin with sharp scissors (SCRC, Cat# 92360147), then extend the cut along the ventral midline up to the neck (Figures 2[href=https://www.wicell.org#fig2]A and 2B). Be careful to cut only the skin and not the peritoneum underneath.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/969-Fig2.jpg\nFigure 2. Collection of the mammary glands from a mouse\n(A) Schematic diagram of isolation and three-dimensional culture of mouse mammary organoids for migration assay.\n(B) Use surgical scissors to cut the mouse skin, and the incision sequence is marked with numbers.\n(B′) Expose glands #3, 4, and 5 by pushing the abdomen with a cotton swab toward the mouse’s center. The solid black line indicates the general area of the mammary gland corresponding to the label.\n(C and C′) Remove lymph node from the #4 mammary gland with scissors and forceps.",
    "(D–D'') A thin layer of muscle partially covers gland #3 (D). Pick up the muscle with forceps, and then use the cotton swab to push gland #3(D′) below the muscle to isolate gland #3 (D''). The solid black line represents the approximate area of gland #3.\n(E) Use scissors and tweezers to remove gland #5 below the thigh. The solid yellow line represents the approximate area of gland #5.\nExtend the cuts laterally towards the legs and arms. Use the tweezer and a cotton swab to release the skin from the peritoneum. Pull the skin away and stretch it tight before pinning it down (Figure 2[href=https://www.wicell.org#fig2]B'). Remove the lymph nodes (Figure 2[href=https://www.wicell.org#fig2]C) located at the intersection of three blood vessels in gland #4 (Figure 2[href=https://www.wicell.org#fig2]C'). Then harvest the remaining #4 MGs similarly as the #5 MGs using forceps (JZ, Cat# JD1050) and scissors to grasp and cut them from the skin (Figure 2[href=https://www.wicell.org#fig2]E). For harvesting the #3 MGs (Figure 2[href=https://www.wicell.org#fig2]D), pull up a thin layer of muscle located on top of gland #3 to expose the mammary gland (Figure 2[href=https://www.wicell.org#fig2]D’), and use a cotton swab to push the #3 MG together (Figure 2[href=https://www.wicell.org#fig2]D''). This will reduce the contamination by muscle tissue.\nCollect and pool the MG tissues on the lid of a Petri dish (Figure 4[href=https://www.wicell.org#fig4]A). The edge of the lid is shallow, thus making the tissues more accessible to the blades and easy to mince.\nBring the dissected MG tissue to a tissue culture hood.\nPrepare collagenase solution as mentioned in step 4.",
    "Mince the glands in the Petri dish lid using two surgical blades (Jinhuan, surgical blade #22, Cat# V500620, scalpel knife handle, Cat# K6-20). Rotate the lid after mincing every ten times so that the tissues will be chopped again in a different orientation. The MGs will have been finely minced after chopping with two scalpels for ∼300–400 times per mouse (Figure 4[href=https://www.wicell.org#fig4]A′).\nNote: The mincing conditions have been optimized for this assay. For harvesting organoids, fibroblast cells for FGF2 induced branching assay, chopping should be less than 120 times. If over-chopped or under-chopped, the organoids might be too small or too big, either of which will negatively affect the performance of the assay.\nTransfer the minced tissue into the collagenase solution, mix well (Figure 4[href=https://www.wicell.org#fig4]B). Place it horizontally in a 37°C shaker to ensure even mixing. Shake for 22 min.\nNote: While waiting for digestion, warm 4 mL of the medium for the DNase solution (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Coat the inner surfaces of a 15 mL tube (Figure 3[href=https://www.wicell.org#fig3]A) and two 35 mm dishes (Figure 3[href=https://www.wicell.org#fig3]B) with 2.5% BSA (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]). Without the coating, organoids tend to stick on the plastic surfaces. So all serological pipettes (Figure 3[href=https://www.wicell.org#fig3]D) and pipette tips (Figure 3[href=https://www.wicell.org#fig3]C) must be coated with the BSA solution. To coat the tubes, mix BSA solution thoroughly to cover the inner walls, then it can be removed. A short coating with BSA works well enough, though more prolonged exposure does not seem to pose adverse effects either.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/969-Fig3.jpg\nFigure 3. Precoating the tube, dish, and pipette tip with BSA\nFresh organoids tend to stick on the uncoated plastic surface, so it is necessary to precoat all the plastic surfaces with 2.5% BSA.",
    "(A) Precoat a 15 mL tube by adding BSA solution, mixing up and down to coat all plastic surfaces, and removing the BSA solution.\n(B) Precoat a 35 mm dish by adding 2 mL of BSA solution and removing it.\n(C) Precoat a 1 mL pipette tip by taking up BSA solution and eject out.\n(D) Use the same way to coat a 10 mL pipette.\nAfter digestion (Figure 4[href=https://www.wicell.org#fig4]C), add 40 μL of DNase solution to the mixture. Pipette it up and down ten times with a 10 mL serological pipette (Figure 4[href=https://www.wicell.org#fig4]C').\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/969-Fig4.jpg\nFigure 4. Isolation of mammary organoids\n(A and A ′) Collected mammary tissue was placed in the lid of a Petri dish (A). The MG tissue was minced (A ′) with double surgical blades about 300 times.\n(B and C) (B) Transfer mammary gland to collagenase solution, (C) incubated at 37°C for 22 min with rotation, thereby breaking down the fat pad into relatively dispersed pieces.\n(C′) After digestion, DNase was added, and the suspension was pipette up and down ten times with a 10 mL serological pipette.\n(C'') Centrifugation separates the suspension into three layers, the top layer is an opaque fatty layer, the middle is a transparent aqueous phase, and the bottom precipitation is the organoid pellet.\n(D) The organoid pellet was resuspended in 4 mL DMEM/F12 containing DNase and transferred to new tubes.\n(D′) DIC images of the resuspended pellet with many single cells.\n(E) Pellet of grayish-white organoids after four differential centrifugations.\n(E′) DIC images of the resuspended pellet. Single cells were removed.\n(F) DIC image of picked organoids. The proper size is about 50 μm diameter × 100–200 μm length.",
    "(G and G′) Pictures of organoid epithelium under different focus levels. It is hard to distinguish endothelium from organoid epithelium under the stereo microscope.\nNote: DNase treatment will digest the viscous genomic DNA leaked out of the dead cells during digestion and thus will make the solution clearer and less sticky.\nSpin the tube at 560 g for 10 min at 25°C, accel/brake set as 8 (Eppendorf centrifuge 5810 R).\nNote: After centrifugation, the solution in the tube will form three layers: a fatty layer on the top, an aqueous layer in the middle, a pellet layer of organoids at the bottom (Figure 4[href=https://www.wicell.org#fig4]C'').\nRemove the fatty layer and the aqueous layer.\nTap on the tube wall to loosen up the pellet, transfer it into the BSA-coated 15 mL tube containing 4 mL of warm DMEM/F12 medium, add 40 μL of DNase solution (Figures 4[href=https://www.wicell.org#fig4]D and 4D′). Mix well by pipetting up and down, and let the tube sit in the hood for 5 min. The cotton-like genomic DNA will slowly disappear.\nAdd 6 mL DMEM/F12 and mix gently.\nDifferential centrifugation\nPulse at 450 g (accel/brake set 8), then stop as quick as possible.\nPour out the supernatant.\nResuspend pellet in 10 mL of DMEM/F12 with 250 μL of 2.5% BSA solution.\nRepeat the above steps for three more times.\nNote: The purpose of differential centrifugation is to wash out enzymes and remove unwanted single cells from organoids. It is crucial to add extra BSA after each centrifugation. If BSA is not added, organoids will still stick to the tube, and the yield will be compromised.\nThe remaining pellet (Figure 4[href=https://www.wicell.org#fig4]E) should be mostly organoids. Resuspend it in 2 mL of basal medium (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) (Figure 4[href=https://www.wicell.org#fig4]E’), then place the mixture on ice.",
    "Transfer the organoids into a 35 mm dish coated with 2.5% BSA and place it on ice (Figure 5[href=https://www.wicell.org#fig5]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/969-Fig5.jpg\nFigure 5. Prepare the equipment and materials for the experiment\n(A) Full view of the workbench. Materials that necessary for the migration experiment are on the table. The table is set in a sterilized room.\n(B) Experimental materials on ice. Coated heparin beads and fresh organoids are stored in a 35 mm dish. PBS, BSA, Matrigel, and needles are store in tubes.\n(C–D''') Setting up of the stereo microscope during the operation of the migration experiment. (C) Align the center of the working well with one cold block hole and the stereo microscope views. (D) A blue rack was used for picking up the beads and organoids. Use the top light on the stereo microscope. (D′–D''') The black disk was removed when arranging the beads and organoids in a 24-well plate. Use the cold light source.\n(E and E′) Water condensation on the cold block surface (E), wipe the water off the surface (E′).\nSet up 3D culture for migration assays\nTiming: 2–6 h\nPairing organoids with FGF10-coated beads.\nManually juxtapose the organoids with the FGF10-coated beads under a stereo microscope. The goal is to arrange five pairs in each well.\nWash FGF10-coated beads three times with 0.1% BSA in PBS, 200 μL per wash, spin 15 s on a mini centrifuge. Transfer washed beads into a 35 mm dish containing 2 mL of 0.1% BSA in PBS. Let the samples sit on ice.\nJuxtapose a bead with an organoid in 80% Matrigel (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nNote: Before starting the experiment, prepare the working station (Figures 5[href=https://www.wicell.org#fig5]A and 5B).",
    "Before handling the Matrigel, pipette tips should be cooled by soaking in ice-cold PBS for 20 s. Before handling organoids, pipette tips should be coated with 2.5% BSA in PBS. Both 60% and 80% Matrigel works for this assay. However, in 60% Matrigel, there is a higher chance that the organoid may settle and touch the glass bottom, at which point it will spread on the bottom surface rather than directionally migrate toward FGF10 beads. This assay is sensitive to Matrigel concentration. When the concentration of Matrigel is too high, organoid migration may be hindered. When opening a new vial of Matrigel, record the concentration of the gel. The Matrigel protein concentration between 5.7 mg/mL to 7.6 mg/mL works well for this assay. The calculation is based on the protein concentration of different lot numbers provided by the manufacturer.\nChoose five organoids of appropriate sizes under the stereo microscope (Figures 5[href=https://www.wicell.org#fig5]D and 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/969-Fig6.jpg\nFigure 6. Schematic diagram of the migration experiment steps\n(A) Organoids of appropriate size were selected under a stereo microscope and placed in a 35 mm dish for later use.\n(B) Side view of the process of laying Matrigel on a 24-well plate. First, place the plate on the cold block for 1 min, draw a 1 cm circle on the bottom using a 10 μL tip containing 7.5 μL Matrigel, fill the circle, then add an extra 7.5 μL Matrigel.\n(B ′ and B'') A top view diagram of the above process. Once Matrigel is laid, the plate is heated on the metal block at 37°C for 2 min and then cooled down on the cold block for 2 min. All subsequent operations are performed on the cold block.\n(C) Add 20 μL top Matrigel to the solidified coating gel.",
    "(D) Aspirate five organoids at a time with a P2 pipette setting at 1.2 μL and add them to the right side of the top Matrigel. In the same way, aspirate five beads and add them to the left side of the top Matrigel. Under the dissection microscope, line up the beads with the fine needle, >300 μm apart between beads. Then, the organoid was juxtaposed to the right side of the bead in a one-to-one manner, 50 μm–100 μm apart between the bead and organoid.\n(E) After completion, the overall view of the position and proportion.\n(F) The plate was heated on the metal block at 37°C for 8 min to solidify the Matrigel, and then 1 mL basal medium was added.\n(G) For time-course images or IF staining, the sample can be cultured in an incubator at 37°C. The sample can also be maintained in time-lapse microscopy.\n(H) Flip the image horizontally when present the data.\nNote: The proper size is about 50 μm diameter × 100–200 μm length (Figures 4[href=https://www.wicell.org#fig4]F, 4G, and 4G′). When an organoid length is less than 50 μm, its morphology tends to look defective. Organoids first undergo a sealing process to form a cyst (Figure 7[href=https://www.wicell.org#fig7]B’). If the organoid length is longer than 200 μm, the area center of the cyst will be more than 150 μm away from the bead. Such organoids often respond poorly to FGF10 stimulation and do not migrate well toward the bead.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/969-Fig7.jpg\nFigure 7. Different responses of epithelial organoids to beads pre-soaked in BSA (A–A'''), or FGF10 (B–B''')\n(A–A''') Organoids did not migrate toward the beads pre-soaked in BSA.",
    "(B–B''') Time course of directional migration of epithelial organoid toward the FGF10 bead. The beads of ~100 μm in diameter were juxtaposed with mammary organoids at a distance of ~100 μm. Scale bars, 50 μm.\n(C–D′) (C and D) Immunofluorescence examination of cell markers in organoids at the migrating cyst stages. IF of CD49f (Integrin alpha 6, staining with 1:100 dilution) on organoid juxtaposed with BSA (C) or FGF10 (C′) soaked bead. IF of SMA (staining with 1:200 dilution) on organoid juxtaposed with BSA (D) or FGF10 (D′) soaked bead.\nPlace a glass-bottom plate on a cold block for 1 min (Figure 6[href=https://www.wicell.org#fig6]B).\nUse a cold tip (10 μL tip), transfer 7.5 μL of 80% Matrigel, and coat a small circle (1 cm diameter) on a 24-well glass-bottom plate (Figures 6[href=https://www.wicell.org#fig6]B and 6B′). Make sure the tip does not touch the wall. Add an extra 7.5 μL of 80% Matrigel in the coating area. So the coating is finished with a total of 15 μL gel (Figure 6[href=https://www.wicell.org#fig6]B’’). It is easier to spread the gel when using a small volume.\nNote: When leaving the chamber on the ice block for too long, water condensation might form in the well. If this occurs, water condensation can be removed with a vacuum before laying on the coating gel.\nIf the sample will be used for subsequent immunofluorescence (IF) staining, an 8-well glass-bottom chamber can be used. In this case, 2 μL of coating gel should be used. The coating area is a 0.6 cm diameter cycle.\nPut the plate on a 37°C heat block for 1–2 min to solidify the Matrigel (Figure 6[href=https://www.wicell.org#fig6]B).\nTransfer the 24-well glass-bottom plate on the cold block for 2 min (Figure 6[href=https://www.wicell.org#fig6]B).",
    "Use a cold tip to transfer 20 μL of 80% Matrigel onto the coating gel (Figure 6[href=https://www.wicell.org#fig6]C).\nAdd 5 organoids to the right side of the top gel (Figure 6[href=https://www.wicell.org#fig6]D).\nAdd five beads into the left side of the top gel (Figure 6[href=https://www.wicell.org#fig6]D).\nNote: Align the center of the well with the cold block hole (Figure 5[href=https://www.wicell.org#fig5]C) and visualize them under a stereo microscope. The diameter of the beads should be within 100 μm–150 μm of range.\nLine up the beads with a fine needle prepared earlier, and allow >300 μm of distance between beads. Juxtapose the organoids with the beads and allow a 50–100 μm of distance between them. Repeat the above steps until five organoid-bead pairs have been set up for each well (Figures 6[href=https://www.wicell.org#fig6]D and 6E).\nLet them sit still for 1 min.\nTransfer to 37°C heat block for 8 min (Figure 6[href=https://www.wicell.org#fig6]F).\nNote: Double-check and make sure all of the wells have the organoids and beads in the right places before transferring them to the 37°C heat block. While waiting for the gel to solidify, find the right-sized organoids under the stereo microscope to get ready for the next round of set-up. Four wells of samples can be set up together for each experiment.\nSetting up one well usually takes about 1 h. And setting up four wells together takes approximately 1.5–2 h.\nAdd 1 mL of basal organoid culture medium to each well (Figure 6[href=https://www.wicell.org#fig6]F).\nRepeat the above steps for the next well (Figures 6[href=https://www.wicell.org#fig6]A–6F).\nWhen finished, add autoclaved water with P/S in the empty wells to maintain humidity.\nSamples can be cultured in the incubator and imaged at different time points. The usual time points include 0, 24, 36, and 72 h (Figures 6[href=https://www.wicell.org#fig6]G, 7[href=https://www.wicell.org#fig7]A–7A’’’, and 7B–7B’’’).",
    "Alternatively, the samples can be imaged via differential interference contrast (DIC) microscopy for the whole course of 72 h and by taking images every 15 min.\nLive cell imaging\nTiming: 3 days\nOrganoid collective migration is monitored by time course or time-lapse microscopy.\nThe migration status of the organoid can also be evaluated by time-lapse imaging.\nFor time-lapse imaging, DIC microscopy can be performed on a Zeiss Cell Observer SD spinning disk confocal microscope using an EC Plan-Neofluar 10×/0.3 Ph1 M27 objective lens (Item no.: 420341-9911-000), an Analy DIC Transmission light reflector, an sCMOS camera at 37°C with 5% CO2. Images were taken every 15 min using ZEN (blue edition) software. Refocus was performed every 12 h. Images can be assembled using Fiji software (Methods video S1[href=https://www.wicell.org#mmc1]).\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Organoid migrates toward FGF10-bead, related to step 27\nDIC movie of directional migration of epithelial organoid toward an FGF10-bead. Images were recorded using time-lapse microscopy over 86 hours and 45 minutes. Images were taken every 15 minutes, and the playing speed is 20 frames per second.\nImmunofluorescence staining of 3D cultured samples\nTiming: 3 days\nFor IF staining, the samples are set up in an 8-well glass-bottom chamber. Samples are harvested 36 h later. Remove medium from the chamber.\nFix Matrigel and organoid by incubating the samples with 300 μL of 4% PFA solution (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) for 15 min.",
    "Note: In the PFA solution, Matrigel shrinks and becomes fragile. The shrinkage will reduce the thickness of the coating gel and make it easier for imaging. The lowest percentage of the Matrigel is 80%. If the concentration gets lower even more, the gel will fall apart during fixation. Different lot numbers of Matrigel might have different concentrations of protein. This will also influence the gel stability in the PFA solution. If the pH of the 4% PFA solution is not correct, the Matrigel can also be dissolved. A pilot experiment should be done to check if the Matrigel is stable upon fixation.\nFor if your protein of interest shows weak IF signals, putting the sample on a rocking shaker at 30 rpm for all the incubation steps can improve the signal/noise ratio.\nRemove PFA solution, and wash 3-times, 15 min each, with quenching solution (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]).\nPermeabilize the gel with permeabilizing buffer (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) for 3 h at room temperature.\nAfter permeabilization, wash 3-times 15 min each with PBS.\nImmediately block samples with blocking buffer (see recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment]) for 2 h at room temperature or overnight at 4°C. Remove the blocking solution, add primary antibody diluted in blocking buffer at the desired ratio, and incubate for 1–2 days at 4°C.\nNote: To avoid spilling of the primary antibody over to the next well, remove the chamber’s lid. And put the chamber in a wet box. Seal the box with a zip bag.\nRemove the primary antibody solution, and wash 3-times 15 min each with PBS at room temperature.\nAdd secondary antibody in blocking buffer at the desired ratio, and incubate for 1–2 days at 4°C.\nStain with DAPI 1:2000 in PBS for 15 min.",
    "Wash 3-times 15 min each with PBS at room temperature.\nStore samples in PBS at 4°C.\nConfocal images should be taken within three days. Still confocal images can be acquired using a Leica SP8 STED 3× Leica microscope using an HC PL APO CS2 40×/1.30 OIL objective. The magnification is 40×. Image resolution is 1,024 × 1,024 square pixels, with a calibration factor 0.098 μm/pixel (Figures 7[href=https://www.wicell.org#fig7]C and 7D), 0.117 μm/pixel (Figure 7[href=https://www.wicell.org#fig7]C’), and 0.125 μm/pixel (Figure 7[href=https://www.wicell.org#fig7]D’). Red-green-blue (RGB) images can be assembled using Fiji software (Figure 6[href=https://www.wicell.org#fig6]H, 7[href=https://www.wicell.org#fig7]C, 7C′, 7D, and 7D′). For imaging CD49f, a laser line with a 631 nm of wavelength, 32% of intensity, 132% of HyD detector gain is used, and the image processing threshold range is 200–2000. For imaging SMA, a laser line with a 498 nm of wavelength, 2% of intensity, 146% of HyD detector gain is used, and image processing threshold range is 100–3000. For imaging DAPI, a laser line with a 405 nm of wavelength, 4% of intensity, 100% of HyD detector gain, and image processing threshold range is 100–3000."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Culture",
    "Cell Biology",
    "Developmental Biology",
    "Organoids"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}