{
  "id": 3695,
  "origin_website": "Cell",
  "title": "Mitochondria-specific delivery system for targeted regulation of mitochondrial gene expression",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparation and characterization of the mito-NP\nTiming: ∼2 days\nThe classic nanoprecipitation method is employed to prepare the mito-NP (Zhang et al., 2008[href=https://www.wicell.org#bib15]). The detailed preparation is as follows (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/414-Fig3.jpg\nFigure 3. Schematic illustration of the preparation of the mitochondria-specific mito-NP\nTake 50 mg of Meo-PEG-b-PDPA polymer to 10 mL of glass vial and add 5 mL of DMF using a pipette (Metric, 100–1,000 μL).\nPlace the glass vial to a sonicator bath for 1–2 min sonication (50 W) to prepare homogenous polymer solution at a concentration of 10 mg/mL.\nSimilarly, take 10 mg of mitochondria-targeting peptide TACP and dissolve it in 2 mL of DMSO prepare homogenous peptide solution at a concentration of 5 mg/mL.\nTake 200 μL of Meo-PEG-b-PDPA solution (step 2) and 50 μL of TACP solution (step 3) using a pipette (Metric, 20–200 μL) to 1 mL of glass vial and add 10 μg of circRNA-expressing vector (1 mg/mL aqueous solution).\nTake 5 mL of commercially available HyPure water (molecular biology grade) to 20 mL of sterilized glass vial containing a stirring bar (15 mm in length and 5 mm in diameter) inside a standard laboratory biosafety cabinet.\nNote: The pH value of the Hypure water should be a neutral pH that is higher than the pKa (∼6.35) of the Meo-PEG-b-PDPA polymer. If not, add small volume of NaOH aqueous solution (1 M) to adjust the solution pH to a neutral value using a pH meter.\nPlace the glass vial on a magnetic stirrer and use a pipette (Metric, 100–1,000 μL) to add the mixture (step 4) dropwise into the Hypure water under vigorously stirring at 400 × g.",
    "Seal the glass vial and keep stirring on the magnetic stirrer at ∼20°C–25°C for ∼2–3 min followed by transferring the mito-NP suspension to an ultrafiltration device (15 mL, MWCO 100K).\nCentrifuge at ∼800–1,800 × g for 10 min to remove the organic solvent and free compounds.\nNote: Although centrifugation at a low speed (<800 × g) could also remove the organic solvent and free compounds from the mito-NP suspension, longer experimental time is required, in which part of encapsulated circRNA-expressing vector may release from the mito-NP. Higher centrifugation speed (>1,800 × g) is not suggested because it usually induces the aggregation of the mito-NP. Our experience suggests that ∼800–1,800 × g is an appropriate speed for the purification of mito-NP.\nAdd 5 mL of Hypure water to resuspend the mito-NP inside a standard laboratory biosafety cabinet and then centrifuge at ∼800–1,800 × g for 10 min.\nRepeat step 9 and then disperse the mito-NP into 1 mL of Hypure water inside a standard laboratory biosafety cabinet for the next experiments.\nTake 10 μL of the mito-NP suspension and add to a copper grid. After air-drying at ∼20°C–25°C for around 12 h, observe the mito-NP morphology on a Tecnai G2 Spirit BioTWIN TEM.\nTake 200 μL of the mito-NP suspension and then disperse in 1 mL of Hypure water. Subsequently, transfer the mito-NP suspension to a cuvette and then measure the particle size using Malvern Zetasizer.\nThe NPs without mitochondria-targeting ability are prepared as control NPs. The Meo-PEG-b-PDPA polymer and an amphiphilic peptide without mitochondria-targeting TPP group (C17H35CONH-GR6GGGKG-OH, synthesized by GL Biochem Ltd) are used to prepare the control NPs. The preparation protocol is similar as the mito-NP by changing the peptide TACP with the above amphiphilic peptide without mitochondria-targeting ability.",
    "Note: If the prepared mito-NP and control NPs are not immediately used for the following in vitro or in vivo experiments, frozen storage at −80°C is needed, and the encapsulated circRNA-expressing vector could maintain its biological function within 4–6 months.\nCritical: Since the Meo-PEG-b-PDPA is sharp pH-responsive polymer with a pKa of ∼6.35, the formed mito-NP could disassemble once the solution pH is lower than the pKa. Therefore, the solution pH of Hypure water needs to be examined before the mito-NP preparation and the pH value must be higher than the pKa. In addition, to determine the encapsulation efficiency of the circRNA-expressing vector and evaluate the mitochondria-targeting ability of the mito-NP, labeling the circRNA-expressing vector with fluorescent dye Cy5 using Label IT Tracker Intracellular Nucleic Acid Localization Kit and then encapsulating the resulting vector into the mito-NP. The vector encapsulation efficiency is determined by comparing the fluorescence intensity of Cy5 (Ex = 647 nm, Em = 662 nm) of the mito-NP to the standard curve.\nIsolation of primary liver fibroblasts\nTiming: ∼10 h\nLiver is one of the important metabolic organs and the mitochondria of liver fibroblasts play vital roles in the development and progression of liver immunometabolic diseases such as non-alcoholic fatty liver disease (NAFLD) (Friedman et al., 2018[href=https://www.wicell.org#bib2]). Therefore, the primary liver fibroblasts are isolated and used as an example to evaluate the mitochondria-specific gene delivery of the mito-NP.\nThe detailed isolation of primary liver fibroblasts is as follows (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/414-Fig4.jpg\nFigure 4. Schematic illustration of the isolation of primary liver fibroblasts\nCollect surgically removed liver tissue during hepatic hemangioma resection or liver transplantation (Friedman et al., 1992[href=https://www.wicell.org#bib3]; Zhai et al., 2019[href=https://www.wicell.org#bib14]).",
    "Place the liver tissue (∼20 g) into a 50 mL of sterilized glass vial on ice and add 20 mL of DMEM containing 10% FBS and 1% penicillin-streptomycin.\nRemove DMEM and then rinse the tissue with 10 mL of cold PBS solution containing 2% FBS and 1% penicillin-streptomycin thrice inside a standard laboratory biosafety cabinet.\nInside a standard laboratory biosafety cabinet, place the liver tissue on a 15 mm glass bottom cell culture dish and remove fat, necrotic tissue, and other miscellaneous tissue with sterilized forceps.\nInside a standard laboratory biosafety cabinet, cut the tissue into tiny pieces (∼1–2 mm in diameter) with autoclaved surgical instruments on ice.\nInside a standard laboratory biosafety cabinet, transfer the tiny tissue pieces (∼10 g) into a 50 mL of centrifuge tube and then add 10 mL of digestion solution (DMEM containing 5% FBS, 1% penicillin-streptomycin, 2 mg/mL collagenase I, 0.4 mg/mL pronase, and 2 mg/mL hyaluronidase).\nSeal the centrifuge tube and then shake at 37°C with a speed of 150 rpm until the tissue pieces are digested.\nOpen the centrifuge tube inside a standard laboratory biosafety cabinet and add 40 mL of cold PBS solution followed by centrifugation at 450 × g for 10 min.\nRemove the supernatant inside a standard laboratory biosafety cabinet and wash the pellet with 10 mL of cold PBS solution followed by centrifugation at 450 × g for 10 min.\nAfter repeating step 22 thrice, add 10 mL of trypsin (0.05%) inside a standard laboratory biosafety cabinet and incubate the tube at 37°C for 20 min.\nResuspend the cell cluster using a pipette (Metric, 1–10 mL) inside a standard laboratory biosafety cabinet, add 1 mL of FBS to stop the digestion, and centrifuge at 450 × g for 10 min.",
    "Remove the supernatant, resuspend the precipitate with 10 mL of PBS solution, and filter the cell suspension through a 70 μm cell strainer inside a standard laboratory biosafety cabinet.\nCollect the filtered cell suspension and centrifuge at 20 × g for 5 min to deposit hepatocytes.\nTransfer the supernatant to a new tube inside a standard laboratory biosafety cabinet and centrifuge for at 450 × g for 10 min.\nResuspend the precipitate with 11.5% OptiPrep inside a standard laboratory biosafety cabinet followed by density gradient centrifugation (1,400 × g, 20 min).\nGently collect the second layer (containing primary liver fibroblasts) from the top and transfer to a new tube inside a standard laboratory biosafety cabinet. After adding 40 mL of PBS solution, centrifuge the tube at 450 × g for 10 min.\nResuspend the cell precipitate with 10 mL of pre-warmed cell culture medium (DMEM containing 10% FBS and 1% penicillin-streptomycin) and culture the obtained primary fibroblasts in a 75 cm2 cell culture flask at 37°C in a humidified atmosphere containing 5% CO2.\nWhen the primary liver fibroblasts attach to the cell culture flask and the cell proliferation reaches 70%–80% confluence, use the cells for the following experiments.\nCritical: In order to obtain more primary liver fibroblasts, the collected liver tissues should be dissected as tiny as possible before digestion. Occasionally, little amount of red blood cells (RBCs) may mix with the extracted primary liver fibroblasts, which can be removed via repeated change of the culture medium. If residual RBCs still exist, RBC lysis buffer is recommended. In addition, aseptic operation is recommended to avoid contamination and penicillin-streptomycin could be used during cell culture.\nIn vitro evaluation of mitochondria-targeting ability of mito-NP\nTiming: ∼5 days",
    "To evaluate the mitochondria-targeting ability, fluorescent dye (e.g., Cy5 and Cy7) labeled vector or fluorescence-expressing vector (e.g., pXCX-CMV-EGFP) (Glover et al., 2002[href=https://www.wicell.org#bib5]) needs to be encapsulated into the mito-NP, which could facilitate to real-time track the vector distribution in the liver fibroblasts. Herein, GFP-expressing vector is used an example and encapsulated into the mito-NP, which can be used to evaluate the in vitro mitochondria-targeting ability and examine the transfection efficacy of the mito-NP.\nRemove the medium from the cell culture flask and wash the primary liver fibroblasts with 10 mL of PBS solution thrice inside a standard laboratory biosafety cabinet.\nAdd 3 mL of 0.25% trypsin to digest the cells for 3–5 min and then stop digestion using 10 mL of DMEM containing 10% FBS.\nTransfer the cell suspension into a 15 mL of centrifuge tube inside a standard laboratory biosafety cabinet and centrifuge the tube at 450 × g for 10 min.\nRemove the medium and add 1 mL of cell culture medium to resuspend the cells using a pipette (Metric, 100–1,000 μL) inside a standard laboratory biosafety cabinet. Count the cell number using a cell counter and finally adjust the cell concentration to a value of 1 × 106 cell/mL.\nAdd 50 μL of the cell suspension into 15 mm of cell culture dish (5 × 104 cell/well) inside a standard laboratory biosafety cabinet and culture the cells in 2 mL of cell culture medium.\nAfter 24 h incubation, replace the medium with 2 mL of fresh cell culture medium and add the mito-NP loading GFP-expressing vector at a plasmid concentration of 200 ng/mL. As a control, add the mixture of Lipofectamine 3000 and GFP-expressing vector to the liver fibroblasts at the same plasmid concentration.",
    "Note: The pH of the medium used in this step should be a neutral pH. If the pH value is lower than the pKa (∼6.35) of the Meo-PEG-b-PDPA, add small volume of NaOH aqueous solution (1 M) to adjust the solution pH using a pH meter to a neutral value.\nAfter 24 h incubation, remove the medium, wash the cells with 2 mL of PBS solution thrice, and add 2 mL of fresh medium for another 48 h incubation.\nRemove culture medium and add 200 nM of MitoTracker Red diluted in 2 mL of HBSS buffer solution.\nAfter 30 min incubation, remove the medium, wash the cells with 2 mL of PBS solution thrice, and stain the nuclei with 1.5 mL of Hoechst 33342 (diluted with PBS at 1:1000 ratio) for 10 min.\nRemove the medium, add 2 mL of fresh PBS solution, and use confocal laser-scanning microscope to observe the intracellular GFP expression and colocalization of GFP with mitochondria.\nCritical: Since the encapsulated vector could gradually be released from the mito-NP, stronger mitochondria-targeting ability and better gene transfection could be achieved when using freshly prepared mito-NP. If large amount of NPs are needed, frozen storage at −80°C is recommended. In addition, in order to observe well-structured mitochondria, the live fibroblasts should be viewed under confocal laser-scanning microscope once the nucleus staining is finished.\nIn vivo evaluation of mitochondria-targeting ability\nTiming: ∼3 days\nTo evaluate the in vivo mitochondria-targeting ability, fluorescent dye such as Cy5 is needed to label the circRNA-expressing vector (Zhao et al., 2020[href=https://www.wicell.org#bib16]), which is then encapsulated into the mito-NP and injected into healthy male C57BL/6J mice (5 weeks old) intravenously.\nLabel circRNA-expressing vector with Cy5 using Label IT Tracker Intracellular Nucleic Acid Localization Kit according to the manufacturer’s instruction.",
    "Repeat steps 1–9 to prepare the mito-NP loading Cy5-labeled circRNA-expressing vector.\nAfter washing the NPs with 5 mL of PBS solution thrice, collect the NPs and resuspend the NPs in PBS solution at a vector concentration of 50 μg/mL.\nNote: If the Cy5-labeled NPs are not immediately used for the following in vivo experiments, frozen storage at −80°C is needed.\nRandomly divide six healthy male C57BL/6J mice into 2 groups (n = 3) and intravenously inject 200 μL of mito-NP (50 μg/mL vector-equivalent concentration in PBS solution) or naked Cy5-labeled vector (50 μg/mL in PBS solution).\nTwenty-four hours post injection, sacrifice the mice, harvest the major organs (heart, liver, spleen, lung, and kidney) and image the major organs by Maestro 2 In-Vivo Imaging System to observe the accumulation of Cy5-labeled vector in each organ.\nCut the mouse liver tissue into tiny pieces and repeat steps 17–29 to extract the primary liver fibroblasts.\nUse flow cytometry to analyze and compare the fluorescence intensity of Cy5 in the liver fibroblasts of mice treated with mito-NP or naked Cy5-labeled vector.\nExtract the mitochondria from the liver fibroblasts using the commercial kit according to the manufacturer’s instruction and use flow cytometry to analyze and compare the fluorescence intensity of Cy5 in the mitochondria of the liver fibroblasts of mice treated with mito-NP or naked Cy5-labeled vector.\nCritical: To eliminate the interference of blood autofluorescence, the harvested organs need to be washed repeatedly with PBS solution. Near-infrared (NIR)-emitting fluorescent dyes (e.g., Cy5, Cy5.5, and Cy7) are recommended to label the cirRNA-expressing vector."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Gene Expression",
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}