{
  "id": 9402,
  "origin_website": "Jove",
  "title": "Intracellular Recording, Sensory Field Mapping, and Culturing Identified Neurons in the Leech, Hirudo medicinalis",
  "procedures": [
    "1. Preparation of Electrodes and Saline Solution\nPrepare physiological saline and electrodes before the animal is dissected. Leech Ringer’s solution consists of the following: 115.3 mM NaCl, 1.8 mM CaCl2, 4.0 mM KCl, 10 mM Tris/maleic acid or HEPES. Adjust the pH to 7.4.\nPrepare a Ag-Cl wire by dipping a cleaned silver wire into a small amount of bleach for 20 min or until the wire has a smooth dark gray finish. Wash the wire with distilled water before using. Then place the wire into a micropipette holder that plugs into the amplifier.  \nPrepare a sharp glass electrode of borosilicate glass using a pipette puller. The electrode resistance should be on the order of 20 MΩ.\nBackfill the pipette with 3 M potassium acetate solution and insert in into the micropipette holder.\nFor an extracellular electrode prepare a sharp glass pipette as described above,  break the tip back by rubbing another sharp pipette near the sharp edge. Then fire polish the tip so that it does not tear the connectives. Plastic extracellular electrodes will also work as long as there is good contact between the electrode and the nerve.\nInsert the extracellular recording electrode into a micropipette holder (with Ag-Cl wire) that is fitted with a rubber tube and syringe for suction. Use the syringe to draw saline into the electrode at least to the level of the silver wire.\nSet up the hardware (amplifier and stimulus isolator) and software recording parameters by following the manual for your specific signal recording unit. See Leksrisawat et al.22 to view details on equipment used in the experiments described below.   \n2. Ventral Ganglion Dissection",
    "Dissect the leech in a large silicone elastomer-lined dish with leech Ringer’s solution. If the animal is stretched longitudinally it will be easier to remove the ventral nerve cord (see Figure 1A).\nWith #10 or #11 size scalpel, make a longitudinal incision with very shallow cuts in the ventral midline. About the middle 2/3rd of the ventral cut is shown in Figure 1B. Try not to cut through the black stocking (the ventral blood sinus) until the animal is fully opened and the blood sinus is stretched without kinks. This blood sinus runs the length of the animal along the ventral midline. The VNC is contained inside of this blood vessel.\nAfter the skin has been cut the full length of the animal use the fine iris scissors to nick the blood sinus (Figure 2). Slip one blade of the fine iris scissors under the sinus and slightly raise the blade to separate it from the nerve tissue. Cut the sinus the length of the VNC while avoiding the nerve roots, segmental nerves, or the connectives between ganglia.\nNext, remove part of the ventral nerve cord by cutting the roots distal to where the blood vessel joins the roots. Repeat this process for each ganglion along the length of the ventral nerve cord.\nTransfer a segment of one or two ganglia to a smaller Petri dish. The ganglia or the single ganglion needs to be pinned taut with some slack.",
    "Pin the connectives and the roots so the ganglion glial sheath is slightly stretched to prevent the neuron cell bodies from moving around when impaling through the glial sheath and into the neuron of interest. The pins should be placed through the black sinus for the roots and in the middle of the two connectives to minimize damage of the axons (Figure 3).\nPlace the Petri dish with preparation under the microscope and secure it with wax at the bottom of the dish to prevent movement.\nCarefully focus the light beam using a mirror and light condenser to see the neurons as in Figure 4A (schematically shown in Figure 4B). Notice the two large Retzius cells in the center of the ganglion.\nTo make an intracellular recording of the Rz, T, P, and N neurons, carefully place the tip of the electrode over the cell of interest and gently lower the tip until a dimple is seen in the glial sheath.\nTap the electrode holder or manipulator (very carefully) so that the electrode tip “pops” into the cell of interest.\nInject short pulses (30-40 msec) of positive current (1-10 nA) into the cell to evoke action potentials.\n3. Culturing Neurons from the Ventral Ganglion Preparation\nPin the ganglia ventral side up in a clean dish containing L-15 with fetal calf serum (FCS) (Figure 3). Pin the roots so that the ganglia are slightly stretched as done above for intracellular recordings. With fine scissors, nick the glial capsule at one end, slip one scissors blade under the capsule, then cut across the glial capsule as shown in Figure 5A.",
    "Add 100 µl aliquot of Collagenase/Dispase to the dish and place on a shaker for 15 min. Examine cells by moving the culture media around the exposed cell bodies. Return the cells to the shaker for another 15 min or longer until the cells come out with minimal suction.\nUse a pipette attached to a syringe to gently extract cells from the ganglion. Fire polish the pipette tip so that it is slightly larger than the cell body diameter. For Rz cells in an adult leech, the diameter should be approximately 50 µm.\nPrepare a variety of pipettes with different diameters without a filament as this decreases the chances of the cells sticking inside the pipette. Store the pipettes in a bottle containing 80% ethanol (EtOH) using a cotton ball at the bottom to protect the tips from chipping. Remember to wash the EtOH out of the pipette with medium before aspirating cells.\nAfter the enzyme treatment, wash out the enzyme-containing medium with L-15 (with FCS) 2x. Identify the cells of interest and gently draw them into the pipette by pulling the syringe (Figure 6A). Discharge the aspirated cells into another dish which contains L-15 (with FCS).\nUntil now, all procedures were non-sterile. Perform the following steps in a sterile hood. Place 3-4 large drops of sterile L-15 (with FCS) in different locations inside a sterile Petri dish.\nPipette the cells into one of the before-mentioned drops, blowing them around in the drop to wash them. Repeat this in series in 3 or 4 drops of medium.\nPlace cells in a clean Petri dish filled with L-15 (with FCS).",
    "Incubate the cells for 1-24 hr at room temperature. Afterwards the clean cells can be plated. By leaving the cells for a few hours or overnight the extracellular matrix comes off easily. Plate the cells immediately to generate longer processes.\nUse sterile substrate to coat a microwell dish and allow it to dry completely (overnight) before culturing experiments.\nAfter the dish has been coated, wash the dish gently with sterile water and then with a small amount of the L-15 medium. Remember to use the L-15 solution without the FCS added to allow the cells to adhere to the dish. The medium can be gently changed to L-15 with FCS after the cells have adhered to the substrate. If the cells are to be used a few hours after plating, then switching the medium to L-15 with FCS is not necessary.\nPosition the cells next to each other at the time of plating to induce rapid synaptogenesis (Figure 6B). After 24 hr measure physiological activity in pairings of neurons.\nUse intracellular electrophysiological techniques to record RP or synaptic responses in cultured pairs of cells (stimulate 1 neuron through an intracellular electrode and record responses from the paired cell using a 2nd intracellular electrode).\n4. Ganglion-body Wall Preparation\nPin the leech dorsal side down in an elastomer-lined dish as described above.\nPin the skin to one side with roots on the other side of the severed ganglion (Figure 7A, magnified in Figure 7B) or make a window on the ventral aspect of the leech over a ganglion (Figure 7C) with all the roots to the body wall intact.",
    "After obtaining a stable intracellular recording in one of the sensory cells (T, P, N) use a small glass rod that has been fire polished to lightly touch the skin in the same segment. If the neuron being recorded from is an N cell then more pressure will need to be applied to the skin. In most cases, the N cell will only respond if the skin is pinched with tweezers. For this reason these cells should be tried last as one might damage the skin or displace the intracellular recoding by disturbing the preparation in such a manner.\nOne should be able to quickly sketch the skin and ganglion with details sufficient enough that a map of where one touched can be used to determine the receptive field for a particular neuron. After recording from as many T and P cells as possible on both sides of a ganglion try the N cells.\nIn order to examine if the sensory neurons have processes that travel through the connectives in a rostral or caudal manner and then out the roots in the adjoining segment to the skin, the connectives between ganglia can be cut and the receptive fields reexamined in regards to the spread of detection. Basically one is examining if there has been any loss in the receptive field.\n5. Injecting Fluorescent Dyes\nPrepare a leech ganglion as described above.\nFill a microelectrode with a solution of Lucifer yellow-CH (3.0%) and lithium chloride (300 mM).\nImpale one of the sensory cells or Rz cells on the ventral side of the ganglion as described above.\nInject dye into the cell by passing negative current (3nA) through the electrode for 15 min. Set the pulse duration to 100 msec and the frequency to 2 Hz.",
    "Visualize the dye-filled neurons by exciting the dye with a mercury lamp and a FITC/GFP filter set."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}