{
  "id": 3225,
  "origin_website": "Cell",
  "title": "Quantifying mitochondrial redox and bilirubin content in intact primary hepatocytes of obese mice using fluorescent reporters",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nLiver digestion and collection\nTiming: 15–20 min/mouse\nCritical: Proper perfusion of the liver is essential for maximum yield of hepatocytes.\nNote: Two mice can be performed simultaneously using two pumps or a dual-independent channel pump.\nAnesthetize one mouse using isofluorane and wait until the mouse is fully anesthetized.\nTest whether the mouse is fully anesthetized, by checking the withdrawal reflex (pinch the mouse’s foot with pliers).\nPlace the mouse in a prone position and spray the abdomen with 70% ethanol to avoid contaminating samples with hair.\nUse a tweezer to lift the skin near the genitals and, with scissors, make an incision and cut the peritoneum in the longitudinal and horizontal axis to expose the abdominal cavity.\nFirst, locate the inferior vena cava (IVC) in the abdominal cavity and the portal vein underneath the liver (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2794-Fig2.jpg\nFigure 2. Picture showing the cannulation of the IVC for liver perfusion\n(A) The white arrow shows the inferior vena cava (IVC).\n(B) Cannulation of the IVC with two clamps used, one clamp holding the needle inserted in the IVC (orange arrow) and another one clamping the IVC behind the liver (yellow arrow) to prevent the perfusion not inflating the liver and just reaching the heart. Perfusion of the IVC starts at 2 mL/min before cutting the portal vein. Image is taken after 4 min perfusion and see how the liver inflated and some of the blood was washed, changing the color of the liver to a whitish color and losing elasticity.\nInsert 1 cm of the needle into IVC and clamp it with a small bulldog-type clamp at the edge of the vessels and the needle (Figure 2[href=https://www.wicell.org#fig2]B).\nClamp the superior IVC by cutting the diaphragm first, between the liver and the heart.",
    "Start the peristaltic pump at 2 mL/min.\nThen cut the portal vein to allow proper perfusion.\nOptional: Ketamine/xylazine can be used in place of isofluorane. You can inject ketamine (30 mg/mL) and xylazine (6 mg/mL) IP in 100 μL PBS.\nPerfuse the IVC with Perfusion Media with EDTA (store at +4°C up to 1 month) using the peristaltic pump at a 5 mL/min rate. For a better reaction, use up to 50 mL. The liver should start to appear pale and beige.\nApply gentle pressure on the portal vein regularly.\nWhen 2–3 mL of Perfusion Media are left, switch rapidly the tubing from Perfusion Media to Digestion Media (freshly made 1 h before experiment). Use up to 50 mL.\nNote: The collagenase concentration might need to be changed depending on the batch and digestion efficiency (see troubleshooting[href=https://www.wicell.org#troubleshooting]).\nNote: Some air bubbles can enter the tubing during the switch of perfusion to Digestion Media. However, they will be trapped in the air bubble trap.\nNote: After the Digestion Media perfusion, the liver is supposed to increase in volume, whitening, and lose elasticity if well digested.\nCritical: Set the pump at a low speed before inserting the needle to avoid the introduction of air bubbles inside the liver vasculature.\nExcise the liver.\nCarefully remove the needle from the liver.\nResect the liver from the body cavity and directly remove the gallbladder.\nPlace the liver in a petri dish with 10 mL of Plating Media (store the media at +4°C up to 1 month).\nRemove the liver capsule, hold it with forceps, and shake it in the media. Once the liver is well digested, hepatocytes will be released easily just by shaking.\nTransfer the suspension into Falcon 50 mL.\nComplete to 30 mL with Plating media.\nHepatocyte isolation\nTiming: 1 h",
    "Under culture hood.\nDo several gentle up and down with a 10 mL graduated pipette.\nPass the liver pieces through a 100 μm nylon cell strainer into a 50 mL tube.\nSpin down cells for 5 min at +21°C; 200 g.\nAspirate the supernatant but keep a certain volume above the pellet, and re-suspend cells in 30 mL Plating Media.\nNote: Centrifuge with low acceleration and low brake to avoid stressing the hepatocytes.\nCell counting (Mix well the cells before each counting since the cells quickly precipitate).\nDo a 1/10 dilution of the cells.\nMix well, add 20 μL of cells suspension with 20 μL Trypan blue, and add 10 μL to the hemacytometer.\nCount both live and dead cells in all 4 large quadrants.\nFormulas.\nViability: Live cells/Total cells.\nCells per mL: Average cells per square × Trypan blue Dilution (2) × dilution factor (10) × 104.\nNumber of cells / volume (mL).\nNote: Viability should be above 80%. Lower viability may result in significant cell mortality in the next few hours.\nNote: With this method we expect ∼40–60 × 106 cells from a single mouse liver.\nCell plating.\nTo assess redox status with a high-content microscope, plate cells into a dark 96-well plate.\nSeed 2 × 104 live cells per well in 100 μL.\nShake gently in straight horizontal and vertical movement (avoid swirling) to make sure that cells are evenly attached and leave cells in the incubator at +37°C for 4 h.\n4 h later, change ∼70% of Plating Media to remove unattached or dead hepatocytes with Maintenance Media (store at +4°C up to 1 month). At this time, hepatocytes can be cultured without FBS.",
    "Note: Density separation by centrifugation in Percoll is used to separate viable hepatocytes from dead hepatocytes and cell debris. However, in our hands, it doesn’t work for hepatocytes from obese mice. Therefore, good viabilibity is key to obtained appropriate hepatocyte culture.\nNote: When changing the media, keep ∼30% of the media as hepatocytes full of lipid droplets are sensitive to air.\nHepatocyte transduction and imaging of redox and bilirubin probes\nTiming: 2.5 h\nThe same day, after changing the media for maintenance media, incubate primary hepatocytes with adenoviruses for 2 h.\nMultiplicity of Infection (MOI) 400 for roGFP2 adenoviruses.\nMOI 10 for UnaG adenoviruses.\n2 h later, wash the cells twice with maintenance media.\nNote: different probes can be use in the same plate and imaged sequentially. Ex. 12 well with cytosolic-roGFP2-ORP1, 12 well with mito-roGFP2-ORP1, 12 well with mito-GRX1-roGFP2, etc…\nImage acquisition\nTiming: ∼2–8 h (see Figure 3[href=https://www.wicell.org#fig3])\n24 h after transduction, perform live-cell imaging using the High-content Fluorescence Microscope imaging system.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2794-Fig3.jpg\nFigure 3. Workflow of imaging redox and bilirubin probes\nCells are plated in black 96-well plate at a density of 2.0e5 cells per well. Then 4 h later, Primary hepatocytes are transduced 2 h with the adenoviruses then washed. 24 h–48 h later cells are imaged with the high-content microscope. If cells are treated with different compounds, prepare them before imaging the fluorescence in baseline conditions. Then, treat the cells outside the microscope. Allow 5 min equilibration for the temperature and CO2 before acquiring images in treated conditions.\nSet the temperature at +37°C and the CO2 at 5% 1 h before imaging.\nSelect the right plate properties.\nSelect the right filter for each channel:\nOxidized form of roGFP2 (roGFP2ox) with Ex 460–490 nm and Em 500–550 nm.",
    "Reduced form of roGFP2 (roGFP2red) with Ex 410–480 nm and Em 500–550 nm.\nUnaG with Ex 460–490 nm and Em 500–550 nm.\nSelect the objective (we recommend 20×) and select at least 5 different fields for each well to be imaged.\nSelect one of the wells and one of the fields to adjust the focus, intensity of the light, and exposure.\nRepeat this last process on multiple wells.\nOnce the image previews are satisfying, acquire the images of all the wells selected.\nNote: depending on the number of fields, intensity of the light and exposure, the minimal time between the images and the condition will vary.\nImage analysis\nImage analysis can be performed using the Harmony software. The analysis sequence can be saved and applied to multiple images (see Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2794-Fig4.jpg\nFigure 4. Image analysis process",
    "To analyze images, the user can export images and use its own software analysis or use the Harmony software. The integrated analysis of the software allows for fast and batch analysis of all images. Here, we give an example on how to analyze roGFP2 redox probes. Reduced roGFP2 signals can be segmented to perform a mask using the common or absolute threshold parameters. Then this mask can be selected and applied to all the channels. The obtained images can be reverted on each channel to select the outside of the object threshold which will be the background. The next step is to identify with the same thresholding parameters all objects and calculate their fluorescence intensity (FI) and morphology properties. Based on these values (FI and morphology), the user can select the objects and filter them based on their size, FI, FI std, roundness, etc… Artifacts or unwanted objects can be discarded. Finally, the FI and background intensity from each channel are calculated and can be subtracted using the formula option in the define results panel. The users will obtain two results oxidized roGFP2 minus background and reduced roGFP2 minus background. The ratio of oxidized roGFP2 over reduce roGFP2 will give an estimate of oxidized levels of the probes that can be compared between conditions. Selected images can be exported as raw images (Tiff) using the right click and transform with image J to obtain a ratiometric image as representative images among different conditions.\nThe general procedure is.\nIn your analysis sequence, add the “Find image region” panel with selected output population: image region reduced channel.\nSelect the cells or mitochondria using the common threshold or absolute threshold properties contained in “Find image region” panel.\nAdd another “find image region” and select whole image region using roGFP2 reduced channel.",
    "Repeat with the roGFP2 oxidized channel.\nTo perform a Mask of selected object to calculate the background, add another “Select region” window with:\n    Output population: whole image oxidized.\n    Region: whole image region oxidized.\n    Method: Restrict by Mask.\n    Population: Image region reduced (selected in step 2).\n    Mask region: Image region reduced (selected in step 2).\n    Check Use inverted mask.\n    Name output region Background Oxidized.\nRepeat with the whole image reduced and name output region Background Reduced.\nAdd “calculate intensity properties” panel to calculate both reduced and oxidized background fluorescence intensity.\nAdd a “calculate morphology properties” panel to calculate properties of the image region reduced populations.\nAdd also a “calculate the intensity properties” panel.\nRepeat the same process with the oxidized channel.\nThen add a “select population” panel based on the reduced channel population.\nYou can then select the cells based on properties: roundness, area, and intensity, stdev, etc... This selection is useful to remove debris and dead cells.\nIn the defined results panel, you can select the results to show in the evaluation and also add a formula to subtract background from FI of selected region.\nGo the evaluation window and start analysis. Harmony will calculate the mean fluorescence intensity,\nExport the data.\nNote: To adjust the analysis sequence, multiple images from different experiments are required to test whether the analysis sequence is working with all the conditions tested for your specific experiments.\nNote: Each individual image for each excitation needs to be exported in tiff manually. Then, we use Image J to overlay the oxidized images on the reduced images.",
    "Note: The imaging parameters such as time of exposure, the number of fields per well and the number of wells will influence the time of image acquisition. Therefore, these parameters will limit the temporal resolution of real time measurements of the redox state. In our experiments, we could image 24 wells, obtaining 4–5 images per well. For example, if one well took 15 s to image, these means that we could measure changes in fluorescence every 6 min (24 wells × 15 s = 360 s / 60 s = 6 min). Thus, to determine whether the acute response to the addition of bilirubin or oxidations, we spaced the treatment between individual wells for 15 s, on a heater plate set at 37°C and then add the plate back in the system to image the cells every 10 min. The time taking out and putting in the plate was recorded as well.\nNote: We recommend testing the dynamic range of the redox probes ORP1-roGFP2 and roGFP2-Grx1 using oxidants and reducing agents. This is achieved by measuring roGFP2 ratiometric fluorescence before and 30 min after treating separate groups of cells with H2O2 0.5 mM to maximally oxidize ORP1-roGFP2, diamide 0.25 mM to oxidize roGFP2-GRX1 and DTT 0.25 mM to maximally reduce both probes. These treatments will work for both cytosolic and mitochondrial targeted probes.\nNote: For the UnaG probes, it is recommended to verify the expression levels of UnaG-Flag among the different conditions to control for the expression of the probe.\nNote: This protocol has been optimized for primary hepatocytes but could be used also with other cells. Optimization for adenoviral transduction and fluorescence detection in other cells and different batches of the same viruses are needed."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Metabolism",
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}