{
  "id": 18796,
  "origin_website": "Jove",
  "title": "Construction of Vapor Chambers Used to Expose Mice to Alcohol During the Equivalent of all Three Trimesters of Human Development",
  "procedures": [
    "All Animal procedures were approved by the University of New Mexico-Health Sciences Center Institutional Animal Care and Use Committee.\n1. Vapor Chamber Assembly\nCut polycarbonate sheets with a circular saw or jigsaw to the dimensions provided in the video for the top, bottom, front, back, sides, and door (Figure 1 and Table 1).\nWith a circular saw or jigsaw, cut an opening 8 inches high by 16 inches wide in the middle of the front panel.\nMeasure and mark the holes for the piano hinge onto the 18 inch by 10 inch polycarbonate sheet that will become the door of the chamber.\nIn the door, drill counter sink holes with a 5/16 inch drill bit, and with a 3/16 inch drill bit, drill the hole for the screws. Make sure to drill counter sink holes on the inside of the door for the screw heads.\nPrepare the polycarbonate sheets for welding.\nAssemble front, back, and side panels onto the bottom panel using Weld-on #16.\nSeal any gaps between panels with Weld-on #16.\nAttach the top panel with Weld-on #16.\nUse bar clamps or heavy text books to hold everything in place while the welds cure.\nAttach a 1 inch by a 12 inch piece of polycarbonate onto the front panel 1 inch below the opening for the attachment of the door hinge.\nAllow at least 24 hr for Weld-on to cure.\nCut 2 pieces of PEX tubing 12 inches long and 1 piece of 1 inch long PEX tubing.\nWith a 5/16 drill bit, drill a hole in each of the 12 inch PEX tubing approximately 1 to 2 inches from one end.\nAttach 2 x 12 inch PEX tubing to a 3/8 inch T-connector with the holes located away from the connector.",
    "Cap the open ends of the PEX tubing with 3/8 inch plugs.\nAttach the piano hinge to the front panel and door using 4-40 machine screws and nuts.\nUsing the door as a guide, mark the holes needed for the piano hinge onto the 1 inch spacer on the front panel of the chamber.\nWith a 3/16 inch drill bit, drill the holes into the front panel for the piano hinge.\nAttach the door and piano hinge to the front panel using 4-40 machine screws and nuts.\nAssemble the toggle clamps as shown in the video with a washer and nut on either side of the side arm.\nMark and drill 3/16 inch holes for the toggle clamps on the front panel and attach toggle clamps with 4-40 machine screws and nuts.\nAdd 3/8 inch rubber bulb seals to the inside of the door.\nWith a 5/8 inch boring drill bit, drill a hole in the center of the top panel for the inlet port.\nDrill a 1/2 inch hole in bottom / center of the back panel for the exit port.\nAssemble the exit port by pushing the threaded part of the 3/8 inch through-wall adaptors through the back wall of the vapor chamber in the exit port hole. Attach the nut from the inside of the chamber to hold in place.\nRemove the protective covering from polycarbonate sheets.\nAttach the 1 inch piece of PEX tubing to the T-connector and force the PEX tubing through the hole in the top of the chamber from the inside.\nAttach a 3/8 inch 90 elbow to the top of the 1 inch PEX tubing from the outside.\n\tNOTE: Drill a 1/2 inch hole in the door and insert a 1/2 inch seal septa into the hole.",
    "Repeat steps 1-22 for the air only control chamber.\n2. Rack and Air Delivery Assembly\nIf placing the chambers on the cart/rack mentioned in the material list, assemble the cart according to the manufacturer’s instructions.\nWith spare nuts and bolts, attach a scrap piece of polycarbonate to the rack to hold the airflow regulators.\nAnywhere on the scrap piece of polycarbonate, mark and drill 3/4 inch holes for the airflow regulators and attach regulators with the nuts provided.\nAttach 3/8 inch through-wall adapter to the inlet and outlet ports of the air flow regulators.\nAssemble the ethanol flask with the aeration stone, #8 stopper and quick release in-line connectors.\nUsing 3/8 inch TYGON tubing, connect the flow regulators to the air pump and ethanol flask as shown in Figure 1.\nFor the air only chamber, attach the exit port of the airflow regulator to the inlet 3/8 inch 90 elbow with 3/8 inch TYGON tubing as shown in Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/51839/51839fig1highres.jpg",
    "Figure 1. Schematic representation of the configuration of the vapor chambers. A T-connector is attached to the low noise air pump. One side of the T-connector is directly connected to an airflow regulator for the air only vapor chamber. The other side is split again and attached to 2 different airflow regulators, one for air and one for ethanol. The air chamber is directly connected to the regulator as shown. For the ethanol vapor chamber, one airflow regulator is connected to the aerator stone immersed in liquid ethanol in the filter flask. The side arm port of the filter flask is connected with the output of the air regulator as indicated. The merged ethanol vapor and air is then connected to the inlet of the ethanol vapor chamber. The outlet tubes (not shown) are connected to a ventilation outlet in the room.\n3. Test Vapor Chambers and Adjust Ethanol Levels\nAdd 600 ml of 190 proof ethanol to the filter flask, insert the aeration stone, and hook up to inlet tube to the side arm of the flask.\nClose chamber doors and turn on air pump.\nAdjust airflow regulators so that approximately half as much air flows through the liquid alcohol as the air it is mixed with. Adjust the air only airflow to the combined flow of the alcohol and air of the ethanol chamber.\nAllow chambers to equilibrate for at least 30 min before measuring the air ethanol concentration.",
    "Measure air ethanol concentration by extracting 5 ml of air with an 18G needle and a 60 ml syringe through the septum. Dilute that sample with room air by drawing the plunger back to 60 ml (1:12 dilution). Measure air ethanol level using a breathalyzer in accordance to manufacturer’s directions. The dilution of the chamber air is needed to achieve alcohol vapor levels within the detection range of the breathalyzer.\n\tNOTE: If using different levels of alcohol exposure the dilution may need to be adjusted.\nAs a starting point, adjust the airflow regulators as needed to achieve an air alcohol concentration of approximately 4.5-5 g/dl (g of vaporized alcohol per dl of air).\n4. Animal Breeding\nGroup house females C578BL/6 mice (2-3 months old) for at least 1 week to synchronize ovarian cycles.\nIndividually house male C57BL/6 mice (2-5 months old) for at least 2 weeks.\nAfter synchronizing, put a single female in with a single male for 5 days to allow for mating.\nFollowing mating, remove males and individually house females and place them into chambers.\n5. Pre- and Post-natal Ethanol Vapor Exposure\nExpose pregnant dams to ethanol vapor for 4 hr per day starting at 10 am during the light cycle (lights on from 6 am-6 pm) except the day of birth to prevent pup death.\nWeigh dams on gestational day (G) 5, G13-G14, and G18-G20 to monitor pregnancies; bedding was changed on days that females were weighed to minimize handling.\nEach day replace the food for the ethanol exposed groups to avoid consumption of pellets with any ethanol absorbed into them.\nOn the day of birth do not expose animals. After birth expose the dams and pups for 4 hr per day starting at 10 am from P1-P12.",
    "Weigh pups on P2, P8, P12, and P25; and change bedding on P8 and P12 to minimize additional handling.\nImmediately after the last exposure (P12), transfer the cages to a standard animal housing room.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}