{
  "id": 6221,
  "origin_website": "Bio",
  "title": "Phagocytosis Assay for α-Synuclein Fibril Uptake by Mouse Primary Microglia",
  "procedures": [
    "α-Synuclein preformed fibrils preparationSubcloning recombinant human α-synuclein with myc tag in N-terminal to pGEX-4T-2-GSTFor the sequence of α-synuclein (GenBank: CR457058.1), see Supplemental file[href=https://os.bio-protocol.org/attached/file/20180817/2986 Supplemental file.docx].EcoR I-H and Xba I restriction enzyme sites are added to the 5’ and 3’ terminal of α-synuclein-myc respectively and used to subclone the gene encoding α-synuclein into the plasmid pGEX-4T-2-GST.Sequence to confirm the correct clone and isolate the plasmids (pGEX-4T-2-GST-α-synuclein-myc). Transformation and induction of protein expression in E. coliThaw 10 μl Escherichia coli BL21 (DE3) on ice.Add 1 pg-100 ng circular plasmid DNA (pGEX-4T-2-GST-α-synuclein-myc) to the cell and mix gently. In parallel, transfect BL21 with plasmid pGEX-4T-2-GST as a negative control.Incubate the mixture on ice for 30 min.Heat shock at 42 °C for 60-90 sec in a dry bath.Cool the cell on ice for 5 min.Plate cells onto selection plate (Recipe 1) and incubate at 37 °C overnight.Pick one single clone and culture in 3 ml LB medium (Recipe 2) with 100 μg/ml ampicillin and shake at 37 °C, 250 rpm overnight.Transfer the 3 ml culture to 0.5 L LB medium containing 100 μg/ml ampicillin and shake at 37 °C, 250 rpm for 2-3 h (when OD600 is 0.5-0.7).Cool the culture to room temperature and add 0.1 mM IPTG, shake at room temperature, 250 rpm for 4-6 h.α-Synuclein monomer purificationCollect cells by centrifugation at 5,000 x g for 15 min at 4 °C and discard the supernatant. Wash the pellet each with cold 10 ml 0.01 M PBS (Recipe 3) for three times.Resuspend the cell pellet with cold 10 ml 0.01 M PBS (pH 7.4) containing 80 μl 25 mM EDTA, 500 μl 10 mg/ml lysozyme, 20 μl 1 U/μl DNase1, 100 μl 100 mM PMSF and 1x protease inhibitor.",
    "Sonicate the cells for 5 min on ice (parameter: 2 sec duration, 2 sec interval at 350 W). Centrifuge at 10,000 x g, 4 °C in an Eppendorf centrifuge for 25 min and collect the supernatant into a 50 ml tube.Add 200 μl glutathione sepharose beads into column assembled with filter and move to a 4 °C fridge to chill.Wash the beads each with cold 10 ml 0.01 M PBS (pH 7.4) for three times at 4 °C.Incubate the beads with cell lysates at 4 °C overnight.Wash the beads each with cold 10 ml 0.01 M PBS (pH 7.4) for three times.Add 3 ml 0.01 M PBS (pH 7.4) with 25 U thrombin to cleave the α-synuclein protein from the beads for 4 h on a rotator at 20 rpm at room temperature.Collect the cleaved protein in a 15 ml Falcon tube on ice.Use the 30 kD centrifugal filter unit to remove protein aggregates over 30 kD. Centrifuge at 4,000 x g for 5 min at 4 °C. Collect the fraction which passes through the filter unit.Sterilize by filtrating through a 0.22 μm filter.Use the 3 kD centrifugal filter units to concentrate α-synuclein. Centrifuge at 4,000 x g for 15-25 min at 4 °C (till the remaining volume reaches 400 μl).Add buffer A (Recipe 4) and centrifuge at 4,000 x g for 15-25 min at 4 °C to change buffer. Around 400 μl protein is collected.Measure the α-synuclein protein concentration by BCA assay. The yields of the protein are around 3-5 mg/ml, and they will be used for calculating the pre-formed fibrils concentration. Protein samples are aliquoted per 200 μl in 500 μl EP tubes, quick frozen by liquid nitrogen, and stored at -80 °C.",
    "α-Synuclein preformed fibrils formationShake 2 mg/ml α-synuclein monomers at 37 °C, 1,000 rpm for 5 days to get α-synuclein preformed fibrils.Double-gloved. In a class II biosafety cabinet, sonicate α-synuclein preformed fibrils on ice (parameter: 2 sec duration, 2 sec interval at 350 W) for 1 min. Finally, use 1% SDS solution to clean-up and inactivate fibrils in the biosafety cabinet.Notes: Quick freeze the α-synuclein fibrils at -80 °C for future use. 1x protease inhibitor: 1 tablet per 50 ml extraction solution.Primary microglia cultureNotes: 20 C57BL/6 mice on postnatal day 1 without gender preferences are used for microglia culture. Mice were sacrificed by decapitation. Coating the flasks and plates: In a hood, aseptically coat culture surface with 10 ml of solution (1 mg of poly-D-lysine/10 ml of sterile double distilled water) per 75 cm2 flask, or with 200 μl of solution per cover glass of 24-well plates. Shake gently to ensure even coating of the culture surface. After 30 min, remove solution by aspiration and thoroughly rinse surface with sterile double distilled water for 3 times. Allow them to dry at least two hours before use.Dissect the brain with the help of the scissors and then put the brain in a 10 cm2 dish containing 10 ml cold DMEM/F12 medium.Strip off the meninges under a stereomicroscope and transfer the brain into a 50 ml Falcon tube containing 20 ml DMEM/F12 medium.Dissociate the brain tissue by repeated pipetting with 10 ml serological pipet. Put a 1 ml tip on the serological pipet and pipet for 15 times. Put a 200 μl tip on the 1 ml tip and pipet for 5 times.Filter the cell mixture by 40 μm cell strainer.Centrifuge at 400 x g for 5 min at room temperature.",
    "Discard the supernatant and resuspend the pellet with DMEM/F12 medium supplement with 10% heat-inactivated fetal bovine serum, 1% penicillin-streptomycin.Plate 10 ml cell mixture in PLL-coated 75 cm2 flasks at a density of 2.5 brains per flask.Incubate the cell at 37 °C with humidified 5% CO2, 95% air incubator.Change the culture medium completely on the next day with 10 ml serological pipets and then change half volume of the culture medium every three days.After two weeks, harvest the microglia from the medium by shaking at 180 rpm for 2 h at 37 °C in a shaker.Plate the microglia at 5 x 104 cells per well in PLL-coated 24-well plates with cover glass and culture for 24 h before the experiment.Phagocytosis assayAdd α-synuclein preformed fibrils into the microglia culture at a final concentration of 200 nM and incubate at 37 °C in a humidified 5% CO2, 95% air incubator for 2 h.Wash away the extracellular α-synuclein preformed fibrils with 500 μl/well cold PBS for three times, 5 min each time.To block microglia phagocytosis, add cytochalasin D at a final concentration of 3 μM and incubate for 1 h before phagocytosis.Immunofluorescence analysisWash cells with 0.01 M cold PBS twice.Fix the microglia with 4% paraformaldehyde diluted in PBS for 30 min at room temperature.Wash the cells with 500 μl/well 0.01 M PBS for 3 times, 5 min/time at room temperature.Permeablize the cells by 500 μl/well 0.3% TritonTM X-100 diluted in 0.01 M PBS for 5 min.Discard the TritonTM X-100 and block with 500 μl blocking buffer/well (2% bovine serum albumin, 0.02% saponin in PBS) for 1 h at room temperature.Incubate with mouse anti-myc antibody at 4 °C overnight (1:200 diluted in blocking buffer, 30 μl each cover glass).Wash with 500 μl blocking buffer/well, 10 min/time for 3 times at room temperature.",
    "Incubate with secondary antibody Alexa Fluor594 goat anti-mouse IgG (H+L) at room temperature for 1 h (1:200 diluted in blocking buffer, 30 μl each cover glass).Wash with 500 μl blocking buffer/well for 2 times and 500 μl/well PBS for 1 time, 10 min/time at room temperature.Mount cover glass on the slide with 5 μl DAPI-containing mounting solution.Seal cover glass with nail polish and store in the dark at 4 °C.Acquire both DIC and fluorescence images by confocal microscopy with 63x oil-immersion lens (Figure 1) and analyze images with NIH ImageJ.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180827/20180827224006_7975.jpgFigure 1. α-Synuclein is phagocytosed by primary microglia. α-Synuclein preformed fibrils are visualized by myc antibody (red puncta) with or without the phagocytosis inhibitor, cytochalasin D (CD, 3 μM). Scale bars = 10 μm.Each cell is outlined, and the total fluorescence intensity per cell is used to quantify uptake of α-synuclein (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180827/20180827224024_0808.jpgFigure 2. Draw single cell area with ImageJ. Freehand selection tool is used to outline cells according to DIC images."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Immunology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}