{
  "id": 3928,
  "origin_website": "Cell",
  "title": "Generation, maintenance, and monitoring of gnotobiotic mice",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe steps described in this section must be performed by two people unless stated otherwise. One person will don a sterile surgical gown and sterile gloves and be responsible for handling the sterile materials and experimental tasks within a biosafety cabinet (BSC). The other will remain “non-sterile” and assist with all tasks that require contact with non-sterile materials.\nPrepare materials for inoculation by gavage\nTiming: 60 min\nThe gavage kit will contain all materials necessary to introduce a bacterial species or consortium into the gastrointestinal tract of a germ-free animal.\nSet up:\nDecontaminate BSC to create a sterile working surface following the steps above under biosafety cabinet decontamination[href=https://www.wicell.org#sec1.3] (steps 4–8 of before you begin[href=https://www.wicell.org#before-you-begin] section).\nWash hands with antiseptic soap, and don sterile surgical gown and gloves. Refrain from making contact with the inner surface of the decontaminated biosafety cabinet while performing the next steps.\nCover the bottom of a decontaminated biosafety cabinet with a sterile drape, thus creating a sterile work surface.\nClearly delineate a working area for the person handling the sterile materials and a working area for the individual handling materials which are not sterile on the outside, e.g., bacterial culture flask, phosphate-buffered saline for washing, micropipette.\nOpen the “gavage kit” (described above in step 1 of the before you begin[href=https://www.wicell.org#before-you-begin] section) and place the sterile internal contents on the sterile drape-covered working surface.\nPrepare the bacterial inoculum for gavage:\nTransfer the cultured bacteria (see step 3 of section before you begin[href=https://www.wicell.org#before-you-begin] - prepare bacterial culture) into a conical tube and centrifuge at 4°C, 3000 g, for 10 min.",
    "Discard supernatant and resuspend the pellet of bacteria in phosphate-buffered saline (PBS) to the desired concentration/volume for gavage, which we now refer to as the inoculum. For adult mice, a gavage volume of 0.2–0.4 mL is recommended.\nTransfer inoculum into sterile 2 mL tubes using a 2-person technique within the sterile work surface in the BSC to ensure that the outside of the tubes remains sterile for later use in the germ-free and gnotobiotic facility. This is accomplished by having the gowned and gloved person hold the 2 mL tube while the assistant transfers the inoculum with a sterile micropipette tip without touching the tube.\nPlace the tube(s) containing the prepared inoculum into the sterile “gavage kit”.\nUnder sterile conditions, place the bacterial inoculum tube(s) into the “gavage kit” (containing the gavage needle and syringe) and seal properly. The internal contents of this container are now sterile and should only be opened within the sterile work area of a decontaminated BSC.\nInoculation of germ-free mice by gavage\nTiming: 1 or more h (depending on the number of mice and experimental groups)\nTo guarantee gnotobiotic conditions of your experiment, the next steps should be performed in a specialized animal facility with specific infrastructure and engineering for housing germ-free and gnotobiotic mice.\nDecontaminate BSC to create a sterile working surface as described above in steps 4–8 of the section before you begin[href=https://www.wicell.org#before-you-begin], biosafety cabinet decontamination[href=https://www.wicell.org#sec1.3].\nImport germ-free animals into the BSC. If animals are being kept in an isolator, they must be imported through a sterilized sleeve. If animals are being kept in isocages, the outside of the cage must be decontaminated with VirkonTM before handling.",
    "Open the gavage kit within the BSC and remove the sterile internal contents. Attach the gavage needle to the 1 mL syringe and draw up 0.2 mL of bacterial inoculum (volume required for gavage of one mouse).\nRestrain the mouse, hold upright, insert tip of gavage needle into the stomach of the animal, and administer the bacterial inoculum. Return mouse to the sterile isocage. Gnotobiotic animals must be maintained under otherwise sterile conditions to avoid contamination from environmental sources (ideally in a specialized animal facility that is engineered to house germ-free and gnotobiotic mice). Of note, the cage, water, chow and bedding must be autoclaved and sterile. For a cage of 5 mice, the sterile water and chow should be changed weekly, and the bedding every 2 weeks.\nMonitoring of germ-free and gnotobiotic conditions in mice\nTiming: 1 h to 3 days (depending on the method and number of samples)\nSteps 10 to 13 may be performed in a standard laboratory by one person, with sample handling performed inside a biosafety cabinet to avoid contamination. Please note that there are multiple methods to monitor the colonization status of gnotobiotic animals. This section describes and compares three common methods that are optimized for analysis of monocolonized gnotobiotic mice, and how these methods can be used to confirm successful colonization as well as rule-out contamination: bacterial culture, microscopy to visualize the presence (or absence) of bacteria using Gram staining or nuclear DNA staining, and 16S rRNA gene amplification and sequencing.\nFollowing colonization by gavage, fecal samples should be collected at least once per week to monitor gnotobiotic status. For all fecal sampling:\nDecontaminate a BCS and create a sterile work surface as described above in steps 4–8 of the section before you begin[href=https://www.wicell.org#before-you-begin], biosafety cabinet decontamination[href=https://www.wicell.org#sec1.3].",
    "Open autoclaved 1.5 mL microcentrifuge tubes onto your sterile work surface (see steps 9 and 10 of section before you begin[href=https://www.wicell.org#before-you-begin] above). The number of tubes and number of fecal pellets required varies depending on the monitoring method to be used: For microbiologic culture and Gram staining, collect 1 fecal pellet in 1 tube per mouse; for SYTOXTM Green staining, collect 3–5 fecal pellets in 1 tube per mouse, for 16S rRNA gene amplification and sequencing collect 1 fecal pellet in 1 tube per mouse. Thus, if collecting for all four monitoring methods, three 1.5 mL microcentrifuge tubes are needed per animal.\nDon a sterile surgical gown and sterile gloves and import isocages containing gnotobiotic mice into decontaminated BSC (as described above in step 5) and collect under otherwise sterile conditions.\nMicrocentrifuge tubes containing fecal samples can now be transported to the laboratory for further analysis.\nMicrobiological culture from a fresh fecal sample (10 – 20 min per sample)\nWeigh fecal pellets and add sterile PBS at a concentration of 100 mg/mL. Mix using a vortex mixer for 1 min until a homogeneous suspension is achieved.\nPrepare 10-fold serial dilutions in sterile PBS, and plate 10 μL of each dilution in triplicate on agar plates. For example, L. intestinalis ASF360 is cultured on MRS agar plates at 37°C under anaerobic conditions.\nIncubate in conditions appropriate for the bacterial species or consortium of choice.\nCount CFU, and express results as CFU/g of feces.\nSytox Green Staining (2–3 h)\nHomogenize feces (3–5 fresh fecal pellets) in 0.3 mL of sterile 1× PBS by vortex mixing.\nAdd 0.15 mL of the homogenate to 0.15 mL of 4% paraformaldehyde stock solution (m/v, in PBS, pH = 7.2). Mix using a vortex mixer.\nIncubate for 45 min at room temperature (21°C–25°C).",
    "In a new tube, prepare a SYTOXTM green working solution by adding 1.5 μL of 5mM SYTOXTM green nucleic acid stain into 0.9 mL of 1× PBS.\nAdd 0.1 mL of the fixed fecal homogenate into the SYTOXTM green working solution.\nProtect from light and incubate at room temperature for 1 h.\nSpread 25 μL on a glass slide and air dry.\nVisualize using a fluorescence microscope at 400× to 1000× magnification. SYTOXTM green excitation/emission: 504/523 nm.\nGram Staining (10 min per sample)\nHomogenize feces as described in step 10a.\nAdd 10 μL of fecal homogenate onto a glass slide. Air dry.\nFix by quickly exposing the back of the slide over a flame three times.\nImmerse the fixed slide in Crystal Violet solution for 1 min.\nImmerse the fixed slide in Stabilized Iodine for 1 min.\nWash the slide thoroughly with a mixture of acetone and isopropanol (1:3) using a plastic pipette until excess Crystal-Violet and Stabilized Iodine are removed and the run-off is clear.\nRinse with distilled water.\nImmerse in Safranin solution for 2 min.\nRinse with distilled water and air dry.\nVisualize using a bright-field microscope (400–1000× magnification).\n16S rRNA gene amplification and sequencing (2–3 days)\nExtract genomic DNA from fecal sample using the components of QIAamp PowerFecal Pro DNA Kit following the manufacturer’s instructions\nAmplify the 16S rRNA gene via PCR using the following thermocycling conditions (refer to the Materials and Equipment section for the PCR mix recipe):\ntable:files/protocols_protocol_650_2.csv\nRun the PCR products on a 1% agarose gel at 120 V. The expected amplicon size is 1,600 base pairs.\nPrepare the PCR reaction product for sequencing by cleaning up with QIAGEN’s PCR MinElute Purification kit following the manufacturer’s instructions.\nElute with 10 μL of molecular grade water and measure the final DNA concentration.",
    "Sequence the PCR reaction product (Sanger method) and analyze by alignment using a sequence database (e.g., Nucleotide BLAST)."
  ],
  "subjectAreas": [
    "Immunology",
    "Microscopy",
    "Microbiology",
    "Molecular Biology",
    "Sequencing",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}