{
  "id": 18339,
  "origin_website": "Jove",
  "title": "A Model of Free Tissue Transfer: The Rat Epigastric Free Flap",
  "procedures": [
    "All procedures involving animal subjects were approved by the Institutional Animal Care and Use Committee and Ethical Committee at Nova University Medical School, Lisbon, Portugal (08/2012/CEFCM).\n1. Surgical Procedure Set-up Notes\nUse adult Wistar rats weighing 250 to 350 g.\nKeep the rats with food and water ad libitum with 12 hr light-dark cycles 7 days prior to surgery.\nWeigh the rat in order to determine the amount of anesthetic required.\nAutoclave all surgical instruments before surgery.\nLayout all the surgical supplies and instruments needed for the procedure (see the Table of Materials).\nPerform the surgery under an operating microscope using conventional and microsurgical instruments.\nPosition the homeothermic blanket, rectal probe, and heat lamp.\nPlace one 20 ml sterilized vial containing 0.9% saline in a water bath warmed to 37 ºC.\nWear sterilized gloves to disinfect all surfaces of the operating setting with an alcoholic solution. Remove the gloves.\nPlace a scrub cap and mask.\nDisinfect hands with water and soap and wear another pair of sterilized gloves.\nWear a sterile surgical gown.\n2. Anesthesia and Skin Preparation\nNOTE: Have an assistant help with the following four steps, as a sterile gown and gloves are worn.\nAnesthetize the rat with a mixture of Ketamine and Diazepam given intraperitoneally. The dose is 5 mg/kg ketamine and 0.25 mg/kg diazepam. Judge the depth of anesthesia by toe pinch and by observance of respiration rate throughout the entire procedure8,14,15,32.\nApply an ophthalmic gel over the anterior surface of the eyes to avoid corneal abrasion.\nRemove the hair over the ventral surface of the abdomen with a depilatory cream. After hair removal, remove the depilatory cream with warm saline.",
    "Spray a substantial amount of alcoholic solution over the operative site. Leave the product on the operative site and do not wipe it off. Wait at least 15 sec. Repeat the application 3 times. Leave a contact time of at least 2 min before proceeding with the surgery. Other research units use other protocols to prevent surgical site infection.\nWearing sterilized gloves, place 2 surgical drapes on both sides of the rat.\n3. Donor Site Surgical Procedure\nSet the boundaries of an epigastric flap ranging approximately 5 cm in length and 3 cm width.\nUsing a surgical skin marker, draw a line from the xiphoid process of the sternum to the pubic symphysis, in order to mark the midline over the ventral surface of the rat's abdomen.\nOn the left side of the rat, using a surgical skin marker, draw two perpendicular lines to the first line: one crossing immediately caudal to the thoracic cage, and another one, parallel to the latter and just cranial to the groin fold (Figures 3 and 6).\nMark the lateral incision with a surgical skin marker with a line parallel to the midline and around 3 cm apart from it.\nFlap harvesting\nIncise the skin with a number 15 scalpel blade until reaching the panniculus carnosus layer.\nDeeper to the panniculus carnosus plane, make the incision with an electric cautery until reaching the muscle fascia.\nRaise the flap from medial to lateral and from cranial to caudal, exposing the flap's pedicle.\nCarefully ligate and divide the perforating vessels coming up from the deep muscle layer and going into the flap's deep surface.\nPlace a retractor in the caudal aspect of the flap and dissect the flap's pedicle cautiously by gently teasing away the loose surrounding tissues (Figure 7).",
    "Ligate and divide the lateral femoral circumflex artery and vein using 9/0 Nylon for the ligatures.\nIsolate the femoral artery and vein. When present, ligate (using 9/0 Nylon) and divide branches of these vessels to adjacent muscles.\nFirstly, use a double vascular clamp to clamp the proximal aspect of the femoral vein. Subsequently clamp its distal aspect. Then, clamp the distal aspect of the femoral artery and finally its proximal aspect.\nClamp the distal aspect of the femoral artery and finally its proximal aspect.\nPlace a single vascular clamp in the superficial epigastric vein and another one in the superficial epigastric artery. Use a pair of straight microsurgery scissors to cut the superficial epigastric artery and vein at their origin and termination, respectively.\nCopiously irrigate the lumen of these vessels with heparinized normal saline 10 IU/ml, until no blood or debris are seen inside the vessels' lumen33.\nPull and trim a cuff of adventitia close to the vascular section sites.\nTransfer the epigastric flap to the neck using Addison's forceps (Figure 8).\nClose the donor site with subcuticular interrupted 5/0 absorbable stitches.\nClose the skin with interrupted 5/0 Nylon stitches.\n4. Recipient Site Surgical Procedure\nExposure of Recipient Site Vessels\nUsing a surgical skin marker, draw a line over the medial border of the left sternocleidomastoid (SCM) muscle.\nUsing a surgical skin marker, draw another line immediately cranial and parallel to the left clavicle. These two lines must converge at the left sternoclavicular joint.\nIncise the skin using a number 15 scalpel blade.\nUse an electric cautery to cut through the subcutaneous tissue.\nUse a pair of dissecting scissors to skeletonize the external jugular vein lateral to the SCM muscle.\nIsolate and ligate the tributaries of the external jugular in this (Figure 9).",
    "Ligate the external jugular vein just below the mandible with a 9/0 Nylon suture.\nPlace a single venous clamp beneath the latter ligation and cut the external jugular vein using a pair of straight microsurgery scissors.\nWash the lumen of the vein with heparinized normal saline in a concentration of 10 IU/ml.\nIsolate the medial margin of the SCM muscle and retract this muscle laterally, thus exposing the carotid artery and the vagus nerve (Figure 10).\nMake a transverse incision in the middle third of the SCM muscle using the electric cautery.\nPlace a retractor between the deep surface of the SCM muscle and the strap muscles.\nTease away the vagus nerve from the carotid artery, taking care not to damage these structures.\nVascular anastomoses\nPosition a double arterial clamp in the carotid artery.\nPlace a 9/0 Nylon stitch in the lateral aspect of the carotid artery, and use this stitch to pull this part of the vessel wall.\nUse a pair of straight microsurgery scissors to produce an opening in this region of vessel wall.\nUsing interrupted 10/0 Nylon sutures perform a termino-lateral anastomosis between the superficial epigastric artery of the flap and the carotid artery at the level of the recently created carotid opening.\nApproach the proximal stump of the external jugular vein and the superficial epigastric vein and inspect the caliber of these two veins.\n\t\t\nIf the discrepancy in size is slight to moderate, dilate the lumen of the cut end of the superficial epigastric vein using dilation forceps.\nIf the caliber difference is very pronounced, in addition to forceps dilation, bevel the end of the superficial epigastric vein in a 30 to 45° angle.\nPerform the venous anastomosis, using interrupted 11/0 Nylon sutures.\nRemove the single clamps placed onto the flap's vessels.",
    "Remove the double clamp positioned in the femoral vein.\nRemove the double clamp placed in the femoral artery.\nAssess patency and competency of anastomoses\nVerify if the flap's artery and vein are fully dilated and no significant bleeding is observed after 3 min of removing the vascular clamps (Figure 11).\n\t\t\nIf there is bleeding during this period place a moist saline gauze over the anastomosis and apply gentle pressure.\nIf bleeding from anastomoses does not stop after 3 min, add additional 11/0 Nylon interrupted sutures, after vascular clamp placement, as needed.\nWait 10 min with the flap connected to the neck vessels and wrapped by a gauze moistened in warm saline.\nAssess flap's perfusion and neck wound hemostasis. Inspect the anastomoses for signs of hemorrhage, thrombosis or excessive traction.\nSecure the flap in the recipient site starting with 5/0 subcuticular interrupted sutures.\nClose the skin with 5/0 Nylon interrupted sutures (Figure 12).\n5. Post-operative Care\nLeave the rat to recover inside its individual cage in the right lateral decubitus position. Keep the cage warm by placing an electric heat pad set on low beneath. Place a light cloth between the cage and the electric heat pad to avoid hyperthermia.\nWatch the animal continuously turning it to the opposite lateral decubitus every 5 min, until it resumes sternal recumbency and it is able to ambulate.\nHouse the rats individually until removing the surgical stitches two weeks after the surgical procedure.\nGive an anti-inflammatory drug 1 mg/kg subcutaneously once a day for the 3 days following surgery, for postoperative analgesia.\n6. Flap Assessment\nPresent a food treat over the head of the rat and assess flap's viability by visual inspection.",
    "If exposure is insufficient using the previous step, have an assistant applying gentle touch over the interscapular region of the rat, while examining the flap.\nUse digital photography and ImageJ software to quantitatively evaluate the areas of wound dehiscence, flap epidermolysis, hyperemia, congestion and/or necrosis, as explained in detail by Trujillo et al.15."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}