{
  "id": 8358,
  "origin_website": "Jove",
  "title": "Small-Scale Colorimetric Assays of Intracellular Lactate and Pyruvate in the Nematode Caenorhabditis elegans",
  "procedures": [
    "1. Synchronized Culture of C. elegans\nBefore seeding, culture the Escherichia coli (E. coli) strain OP50 overnight at 37 °C in 300 mL of Luria-Bertani (LB) broth liquid medium. Store the cultured OP50 at -4 °C.\n\t\nTo make LB broth liquid medium, use 10 g of tryptone, 5 g of yeast extract, 10 g of NaCl and 1.5 mL of 1 N NaOH, and add to 1 L with deionized water. Autoclave.\n\t\tNOTE: OP50 and C. elegans strains are available from the Caenorhabditis Genetics Center (University of Minnesota, St. Paul, MN, USA).\nTo make nematode growth medium (NGM) agar, use 3 g of NaCl, 2.5 g of peptone, 17 g of agar, and 975 mL of deionized water. Autoclave. Cool to 55 °C, then sterilely add, in order, 1 mL of 1 M MgSO4, 1 mL of 1 M CaCl2, 1 mL of 5 mg/mL cholesterol in EtOH, and 25 mL of 1 M potassium phosphate pH 6.0 in 90-mm Petri dishes.\n\t\nFor 1 M potassium phosphate pH 6.0, use 108.3 g of KH2PO4 and 46.6 g of K2HPO4, and add deionized water to 1 L. Autoclave6.\nSpread 1-2 mL of the cultured OP50 on the NGM agar plates. To make a thin layer of OP50, incubate the plates overnight at room temperature before adding any nematodes.\n\tNOTE: The NGM agar plates inoculated OP50 can be stored at room temperature for 2-3 weeks.\nAdd at least 100 worms onto an NGM agar plate with OP50, and culture at 20 °C until the adult stage. At least three plates are required.",
    "To collect eggs in utero, transfer gravid hermaphrodites from the three NGM agar plates each with 5 mL of S buffer in a 15-mL conical tube, and wash the worms 3 times with 15 mL of S buffer using centrifugation at 300 x g for 30 s at room temperature.\n\t\nTo make S buffer, use 5.9 g of NaCl and 50 mL of 1 M potassium phosphate pH 6.0, add to 1 L with deionized water. Autoclave6.\nDissolve the worms in an alkaline hypochlorite solution for axenization and bulk egg isolation (0.5 mL of fresh bleach or equivalent: 5-6% sodium hypochlorite, 0.1 mL of 10 M NaOH, approximately 4.5 mL of S buffer)6, and stand the solution for 10-15 min at room temperature with mixing by inverting.\n\tNOTE: Within 15 min, adult worms should dissolve, leaving a hazy solution of eggs liberated from their carcasses (the liberated eggs should be confirmed using a stereoscopic microscope). Instead of 0.1 mL of 10 N NaOH, 0.2 mL of 5 N NaOH can also be used.\nAfter hypochlorite treatment, wash the egg pellet 3 times with 15 mL of S buffer, and resuspend in 5-6 mL of S buffer. Hatch the released eggs during an overnight incubation at 20 °C in S buffer without E. coli for an age-synchronous culture of L1 stage larvae.",
    "To determine the approximate number of L1 stage larvae, count the worms using a stereoscopic microscope in 10 µL of S buffer after resuspending the larvae at least 3 times, and calculate the average. Then, transfer the L1 stage larvae to five NGM agar plates with OP50 (1,500-3,000 worms per plate using a 90-mm Petri dish), and culture at 20 °C until they have grown to the young adult stage, when the self-fertilization begins and a few eggs are laid (ordinarily after 3 days).\n2. Extraction of Cellular Fraction from C. elegans\nCollect the young adult stage (5-day-old animals) worms from the five NGM agar plates with S buffer (Figure 1A).\n\t\nTo select only living worms using the sucrose method6 for flotation on 30% (w/v) sucrose, mix the worms suspended in 3-4 mL of S buffer with an equal volume of ice-cold 60% (w/v) sucrose in a 15-mL conical tube. Spin the tube at 1,500 x g for 15 s at 4 °C and remove the floating worms into a fresh tube by moving them off the wall of the tube with a Pasteur pipette.\nWash the worms 3 times with S buffer by centrifugation at 1,500 x g for 30 s at 4 °C. Check the wet volume of washed worms after centrifugation using a 1,000 µL micropipette tip (Figure 1B).\nAdd the washed worms to an equal volume of ice-cold 10% (w/v) trichloroacetic acid (TCA; final concentration of 5%) for protein precipitation (Figure 1C). Instead of TCA, perchloric acid (PCA) or metaphosphoric acid can be used.\nHomogenize the worms with the precipitant using 40 strokes of a pestle in a Teflon homogenizer (Potter-Elvehjem tissue grinder) with rotation at up to 1,300 rpm on ice.",
    "Transfer the homogenate into a fresh 1.5-mL microtube with a Pasteur pipette, and sonicate using an ultrasonic homogenizer for 3 min (3 times of 1 min) with a 20% duty cycle on ice.\nClarify the homogenate by centrifugation at 8,000 x g for 10 min at 4 °C. Neutralize the supernatants with 4 M KOH (0.25 volume to 10% TCA) for 20 min on ice, and centrifuge at 8,000 x g for 10 min at 4 °C. The supernatant (as a test sample) can be stored at -80 °C until the following assays.\n3. Lactate Assay Using a Colorimetric Assay Kit\nMeasure the concentration of lactate in the test samples using a colorimetric assay kit (Table of Materials). Carry out duplex examinations for the test samples. Add 5 or 10 µL of the test samples to a 96-well plate and adjust the volume to 50 µL per well with the Lactate Assay Buffer provided with the kit.\nFor the lactate standard curve, dilute 100 mM L(+)-Lactate Standard to 1 mM with Lactate Assay Buffer. Add 0, 2, 4, 6, 8, and 10 µL of the 1 mM L(+)-Lactate Standard, which is provided with the kit, into a series of wells.\nAdd 50 µL of Reaction Mix (containing 46:2:2 of Lactate Assay Buffer, Lactate Enzyme Mix and Lactate Probe in DMSO, anhydrous; all reagents are provided with the kit) or Background Control Mix (containing 48:2 of Lactate Assay Buffer and Lactate Probe) into each well and incubate at room temperature for 30-60 min while the samples are protected from light.\nMeasure the absorbance of each well at 570 nm using a microplate reader and subtract the absorbance of the Background Control Mix from the absorbance of the Reaction Mix.",
    "Plot the lactate standard curve. Calculate the lactate concentrations of the test samples from the lactate standard curve.\n4. Pyruvate Assay Using a Colorimetric Assay Kit\nMeasure the concentration of pyruvate in the supernatants (test samples) using a colorimetric assay kit (Table of Materials). Carry out duplex examinations for the test samples. Add 10 µL of the test samples and 90 µL of Working Reagent (containing 94:1 of Enzyme Mix and Dye Reagent, which are provided with the kit) into a 96-well plate and incubate at room temperature for 30 min while the samples are protected from light.\nMeasure the absorbance of each well at 570 nm using a microplate reader.\nPlot the pyruvate standard curve. Calculate the pyruvate concentrations of the test samples from the pyruvate standard curve.\n5. Protein Assay for Normalization with Protein Content\nMeasure the protein concentration in the supernatants (test samples) using a colorimetric assay kit (Table of Materials). However, this step is not limited to an assay kit, and other approaches can be utilized to measure the protein concentration.\nNormalize the values of lactate and pyruvate concentrations among the test samples using each total protein concentration.\n\tNote: Protein concentration in the test samples is sufficiently detected even after protein precipitation and is utilized for the normalization step among samples.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}