{
  "id": 5017,
  "origin_website": "Bio",
  "title": "Measurement of Intracellular cAMP Levels Using the Cyclic Nucleotide XP Enzymatic Immunoassay Kit in Bacteria",
  "procedures": [
    "Grow an overnight culture (~16 h) of the required strain on an agar plate, including any antibiotic selection if required. Prepare MH broth media for culture and sterile PBS.Next Day: Under sterile conditions, using a sterile inoculating loop remove a single colony from the agar plate and inoculate 5 ml of MH broth in a 50 ml tube including any antibiotic selection if required. Grow culture overnight (~16 h) at 37 °C at 200 rpm.Next Day: Make a 1:100 dilution of the overnight culture into 15 ml of MH broth in a 50 ml tube. Grow culture at 37 °C shaking at 200 rpm until the culture reaches an OD600 = 0.7 (approximately 3-4 h), measure using a spectrophotometer.While the bacterial culture is growing, pre-cool the centrifuge to 4 °C, prepare ice bucket, pre-cool PBS on ice.Remove bacterial cells from incubator and put on ice, centrifuge sample for 20 min, 4 °C at 8,000 x g, decant supernatant and keep cell pellet on ice; sample can be frozen at -20 °C for up to 6 months.Resuspend the pellet in 3 ml of cooled PBS buffer and keep sample on ice.Set up cell disruptor with a one shot head (pre-cooled to 4 °C); set to 30,000 psi, and process sample, collect lysed cells into a new 15 ml tube on ice. Centrifuge sample at 8,000 x g for 20 min at 4 °C, remove the supernatant and store at -80 °C until required, up to 6 months.Remove 10 μl of sample to quantify total protein in sample using the Protein assay DCTM kit following manufacturer’s instructions.Using a microtitre tray, add 20 μl of Reagent A across 7 wells of row A; this is to be used for the BSA standard samples.",
    "Add 20 μl of Reagent A across 3 wells of row B; this is to be used for your sample.To the 20 μl of Reagent A in row A, add 5 μl of each BSA protein standard (0, 0.125, 0.25, 0.5, 1, 2.5, 5 mg/ml) to the 7 individual wells. To the 20 μl of Reagent A in row B, add 5 μl of your sample to each of the three wells.Subsequently add 200 μl of Reagent B into all wells used and leave samples to react for 3 min at room temperature.Measure the absorbance of the wells using a Multiskan at 600 nm; create a standard curve using the BSA protein standards in an Excel spread sheet. Then using the equation of the line calculate the amount of protein in your sample. See Note 3 for experimental details, as well as Table 1 and Figure 1 as a representative example.Using the calculated protein concentration of your samples from step 13 adjust the final protein concentration to 1 mg/ml in PBS for cAMP analysis.Put all Cyclic AMP XPTM assay kit solutions and the cAMP XPTM Rabbit mAb coated microwell strips at room temperature.Dilute the 20x wash buffer in Milli-Q to 1x buffer.Prepare a 1x cell lysis buffer from the 10x stock solution provided in Milli-Q water, then add 1 mM of phenylmethylsulfonyl fluoride provided.Make fresh cAMP standards in 1x cell lysis buffer: In 450 μl of 1x cell lysis buffer add 50 μl of cAMP standard (2.4 M) to make 240 nM of cAMP.Using the 240 nM cAMP solution make a 1:3 serial dilution in the cell lysis buffer producing the following concentrations: 80 nM, 26.7 nM, 8.9 nM, 3.0 nM, 1 nM, 0.3 nM and 0 nM.",
    "For the unknown samples add 50 μl of the crude protein extract (at 1 mg/ml) in triplicate into the microwell strips. Subsequently, add 50 μl of provided horseradish peroxidase-linked cAMP solution to all standards and samples. Cover with aluminum foil and incubate at room temperature for 3 h on a horizontal orbital plate shaker (~30 rpm). Tip out the solution in the microwell strips and wash 4 times with 200 μl/well of 1x wash buffer; discard all liquid each time but do not allow wells to dry.Add 100 μl of 3, 3', 5, 5'-tetramethylbenzidinesubstrate solution provided in the kit and incubate the plate at room temperature for 30 min. Continue to monitor the wells as they will have a transparent color at the start of the reaction which will change to a yellow. Monitor wells for color change and when an intense yellow color is seen the reaction should be stopped; this may be necessary to do prior to the 30 min incubation time-frame described in the kit.Add 100 μl of stop solution and then immediately measure the absorbance at 450 nm see representative data 3 for example (Table 2 and Figure 2).Using the inverse for the standards derived from a standard curve, and adjusted for the amount of total protein added from the protein assay; calculate the amount of cAMP in nM/1 mg of crude protein extract."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}