{
  "id": 9291,
  "origin_website": "Jove",
  "title": "In Vivo Two-Photon Microscopy of Single Nerve Endings in Skin",
  "procedures": [
    "Procedures involving animal subjects have been approved by the National Animal Experiment Board, Finland.\n1. Animal Preparation for Imaging\nAnesthetize a mouse by intraperitional (IP) injection of ketamine (0.08 mg per body weight) and xylazine (0.01 mg per body weight). Check the anesthesia with the rear toe pinch reflex.\nImmerse animal’s eyes in eye drops (Viscotears) to protect the eyes from dehydration.\nPut the mouse on a heating pad (Supertech) at 37 °C to prevent hypothermia.\nClean the foot pad designated for imaging with 70% ethanol.\nAdd a drop of water on the skin of the foot pad for the immersion coupling between skin and cover glass.\nPut plastic packaging material under the hind paw that is positioned under a metal ring with cover class.\nAdjust the thickness of the plastic packaging material to flatten the skin.\nPut a drop of water on the cover glass for immersion between cover glass and the objective.\n2. Metal Fixator Ring Preparation\nFor the stabilization of the skin utilize the metal fixator. We use Community Design-protected two-wing fixator with a metal ring (courtesy of Neurotar Ltd, Finland). Fill the syringe with superglue, put the small drop of superglue through the needle on the ring and gently spread the glue for uniform coverage of the ring surface. It is critical to put the minimal amount of glue that is needed only for uniform coverage, because excessive amount of glue may reduce the field of the view and obstruct subsequent imaging.\nNOTE: Alternatively the combination of a metal bar (from beneath) and standard microscope glass slide (as a cover) could be used to flatten the skin and to ensure proper optical coupling of the assembly14. Two paper clips could be used to fix the paw between glass and metal bar surface (Figure 4).",
    "Cover the ring with microscope cover slide (5 mm diameter, Electron Microscopy Science).\nScrew on the ring fixator to the rigid metal bar that is montaged on the motorized microscope stage.\n3. Imaging Procedure\nIn case of using thy1-YFP-H mice, choose the blue part of fluorescence lamp spectra to visualize nerve fibers. Find the nerve of interest in epifluorescence mode and focus on it.\nWrite down the coordinates of a spot for longitudinal imaging. Use a carpal pad as a reference point. During the following imaging sessions, detect first the carpal pad and then find the same upstream big nerve fibers and go back using the saved coordinates. It is essential to position the foot pad in the same direction perpendicular to the metal bar to keep the same system of reference.\nTurn on the two-photon mode. For the thy1-YFP-H mice, it is suitable to use the 950 nm wavelength of laser radiation to visualize the nerve fibers.\nSelect laser wavelength and emission channels (from 450 to 480 nm for second harmonic generation detection, from 520 to 550 nm for imaging of YFP-labeled nerves and from 580 to 630 nm for detection of YFP fluorescence and autofluorescence of the hair), start with low laser power (3-5%) to prevent photodamage and bleaching. The typical voltage on the photomultiplier tubes is 600-700 V for this kind of imaging.\nSet the desired resolution (512 x 512 or 640 x 640 for fast events measurements, 800 x 800 or 1,024 x 1,024 for morphological imaging), axial step (1-3 µm), thickness of the sample and the time intervals (1-10 min). The exposure time is in the order of 1 msec per one pixel.\nFirst mark the upper and lower boundaries of the imaging volume in the software.",
    "Acquire the reference image stack for the reference before the lesion. When needed, it is possible to record the baseline during several minutes.\nRepeatedly (at least every 10-15 min) check animal breathing rate and reflexes, when needed apply an additional amount of anesthetics.\nAfter imaging clean the pad with a tissue and put the mouse in a recovery box at 36 °C until it is fully awake.\nNOTE: Usually, the duration of one imaging session combined with laser induced lesion (see below) does not exceed 1 hr. We recommend verifying that the animal is deeply anaesthetized every 10-15 min; this should not interfere with imaging itself but should be considered while experimental procedure is planned. The duration of the effect of a single ketamine/xylazyne dose is around 30 to 40 min, thus we recommend to apply additional ¼ to ½  dose after 25-30 min.\nNOTE: It should be considered as well when the experimentation is planning that the frequency of imaging sessions for an individual animal should not exceed 1 session per 2 days to avoid adverse effects of repetitive anesthesia.\n4. Laser Lesion\nAfter acquiring the reference image stack, use the bleaching protocol to make a micro lesion.\nIncrease the laser power to 100%.\nIncrease the exposure time to 100-1,000 msec per region of interest (100-1,000x more than in case of standard imaging).\nOutline the area for the lesion.\nMake the lesion by switching on the bleaching.\nSwitch back to the regular imaging mode and continue with time-lapse recordings.\n5. Data Processing and Analysis\nProceed with unmixing using Spectral Unmixing plugin in ImageJ8 (Joachim Walter, http://rsbweb.nih.gov/ij/plugins/spectral-unmixing.html[href=http://rsbweb.nih.gov/ij/plugins/spectral-unmixing.html]).\nOpen the image stack and split the channels.\nFind the area free of the nerves or hair for the background measurements. Put a region of interest in that area.",
    "Outline carefully the part of the hair where it is clearly distinguishable from the nerves.\nOutline the nerve in the part of the image where it is separate from the hair.\nSave unmixing matrix.\nApply measured unmixing matrix for the whole stack.\nSave the new processed image stacks in *.tif format.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}