{
  "id": 4137,
  "origin_website": "Cell",
  "title": "Protocol for rapid manipulation of mitochondrial morphology in living cells using inducible counter mitochondrial morphology (iCMM)",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nSeeding and culturing of the cells (day 1)\nTiming: 3 h\nBefore starting this protocol, cells should be cultured for at least one week after thawing; additionally, the confluency of the cells should not exceed 80%.\nAdd 4 mL prewarmed PBS at the periphery of the dish and slowly tilt to gently wash the cells.\nRemove PBS.\nAdd 1 mL 0.05% trypsin-EDTA solution to the dish.\nIncubate the cells at 37°C for 4 min in a 5% CO2 incubator.\nGently tap the dish to completely detach the cells.\nAdd 5 mL prewarmed fresh culture medium and suspend the cells by gentle pipetting.\nTransfer the cells to a sterilized 15-mL conical tube.\nCentrifuge the tube with swing buckets at 161 × g and at room temperature (15°C–25°C) for 2 min.\nAdd 7 mL prewarmed culture medium and suspend the cells by gentle pipetting.\nTo count cells, mix 40 μL of the cell suspension with 40 μL trypan blue in a 1.5-mL microcentrifuge tube. Gently pipette up and down several times to mix.\nUse an automated cell counter with 10 μL of the mixture.\nAlternatives: A hemocytometer may be used for cell counts.\nNote: Verify, at least qualitatively, that cell viability, shape, and size are not atypical. If the cell counter used can measure quantitative information about viability and size, among others, it is recommended to record such numerical information.\nPlate 2.4 × 105 cells in a 3.5-cm poly-lysine-coated glass bottom dish and culture at 37°C in 5% CO2 (2 mL/dish).",
    "Alternatives: A 3.5-cm poly-lysine-coated glass-bottom dish can be substituted for either glass cover slips coated with poly-D-lysine or a 35-mm imaging dish with a polymer coverslip bottom (e.g., iBidi, Fitchburg, WI, USA; cat# 81156). Notably, as changes in cell adhesion conditions may alter cellular responses to various factors, it is recommended that cell adhesion conditions be kept consistent.\nAfter plating, culture cells at 37°C and 5% CO2 in an incubator for 4 h (until cells attach well) and then transfect.\nTransfection (day 1)\nTiming: 30 min\nTransfect as follows:\nAdd 0.5 μg of each plasmid-encoding effector and anchor (1:1 ratio; total 1 μg) to 100 μL Opti-MEM (Thermo Fisher Scientific) in a 5-mL polystyrene round-bottom tube.\nAdd 3 μL FuGENE HD (Promega) and mix gently to avoid introducing bubbles.\nIncubate the transfection mixture at room temperature (15°C–25°C) for 10 min.\nAdd 100 μL of the mixture to the cells that are plated on a 3.5-cm poly-lysine-coated glass-bottom dish and mix gently.\nNote: The amount and proportion of plasmids need to be optimized according to the used cell line, the transfection reagents, and the purpose of the experiment.\nAlternatives: Other transfection reagents such as LipofectamineTM 3000 Transfection Reagent (Thermo Fisher Scientific, L3000001) may be used to transfect cells according to the manufacturer’s instructions (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Flipofectamine3000_protocol.pdf&title=TGlwb2ZlY3RhbWluZSAzMDAwIFJlYWdlbnQgUHJvdG9jb2wgKEVuZ2xpc2gp[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Flipofectamine3000_protocol.pdf&title=TGlwb2ZlY3RhbWluZSAzMDAwIFJlYWdlbnQgUHJvdG9jb2wgKEVuZ2xpc2gp]).\nAfter transfection, culture cells under 5% CO2 at 37°C for 20–32 h.\nLive cell imaging using epifluorescence microscopy (day 2)\nTiming: 2 h\nCells were viewed using a 40× objective (Plan Apochromat Lambda Series, Nikon) mounted on an inverted Eclipse Ti2-E microscope (Nikon) and imaged using a Zyla 4.2 PLUS sCMOS camera (Oxford Instruments). Imaging data were processed using the NIS-Elements AR imaging software (Nikon).\nTwo hours before live cell imaging, replace culture medium containing the transfection mixture with 2 mL prewarmed fresh culture medium.",
    "Note: To reduce cytotoxicity of transfection reagents, the culture medium should be replaced at least 12–16 h after transfection.\nActivate the STX stage top incubator system (Tokai Hit, Fujinomiya, Japan) to maintain a temperature of 37°C in 5% CO2 for 1 h before live cell imaging.\nAdd 1 μL 1 mM MitoTracker Red CMXRos (Thermo Fisher Scientific) into the glass-bottom dish (final concentration: 500 nM) 30 min before live cell imaging.\nNote: To stain the cells uniformly, 1 μL MitoTracker Red CMXRos may be aliquoted to a 1.5-mL microcentrifuge tube and suspended in 100 μL culture medium. The suspension may then be added to the dish followed by gentle agitation. Additionally, the concentration of MitoTracker Red CMXRos should be optimized for each cell line used according to the manufacturer’s protocol (https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fmp07510.pdf&title=VXNlciBHdWlkZTogTWl0b1RyYWNrZXIgTWl0b2Nob25kcmlvbi1TZWxlY3RpdmUgUHJvYmVz[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https%3A%2F%2Fassets.thermofisher.com%2FTFS-Assets%2FLSG%2Fmanuals%2Fmp07510.pdf&title=VXNlciBHdWlkZTogTWl0b1RyYWNrZXIgTWl0b2Nob25kcmlvbi1TZWxlY3RpdmUgUHJvYmVz]).\nDuring the staining process, start the microscopy system according to the manufacturer’s instructions (https://www.microscope.healthcare.nikon.com/products/inverted-microscopes/eclipse-ti2-series/eclipse-ti2-e[href=https://www.microscope.healthcare.nikon.com/products/inverted-microscopes/eclipse-ti2-series/eclipse-ti2-e]).\nThirty minutes after adding MitoTracker Red CMXRos, remove the culture medium and wash twice using 1 mL prewarmed imaging medium.\nAdd 2 mL prewarmed imaging medium.\nFind and focus cells expressing NiCMM/iCMM.\nSelect five positions for live cell imaging.\nSet the imaging parameter of the NIS-Elements AR imaging software (Nikon) (Figure 2[href=https://www.wicell.org#fig2])\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/901-Fig2.jpg\nFigure 2. An example of acquisition setting in the NIS-Elements AR imaging software\nDetails of acquisition settings in the NIS-Elements AR imaging software are shown.\nNote: Although we do not have strict criteria for determining the imaging positions, we believe it is important to select the imaging positions so that we can capture iCMM/NiCMM-expressing cells without bias as much as is possible.\nNote: Live cell imaging was performed under the same imaging conditions for each experiment. Representative imaging conditions are described below.\nGeneral information\nCamera Name: Andor Zyla VSC-07685\nNumerical Aperture: 0.95\nNo Z-stack imaging\nmCherry (for mitochondria imaging)\nModality: Widefield Fluorescence",
    "Filter: mCherry-B-NTE-ZERO filter (excitation: 542–582 nm, emission: 604–679 nm)\nBinning: 1×1\nExposure: 100 ms\nPerfect focus (PFS), state: On\nZoom: 1.00×\nIntensilight, Illuminator(Illuminator (EPI)) NDFilter: 3.1\nECFP (for anchor imaging)\nModality: Widefield Fluorescence\nFilter: CFP-A-Basic-NTE filter (excitation: 425.5–442.5 nm, emission: 459–499 nm)\nBinning: 1×1\nExposure: 100 ms\nPFS, state: On\nZoom: 1.00×\nIntensilight, Illuminator (Illuminator (EPI)) NDFilter: 3.1\nEYFP (for effector imaging)\nModality: Widefield Fluorescence\nFilter: YFP-A-Basic-NTE filter (excitation: 489–505 nm, emission: 524–546 nm)\nBinning: 1×1\nExposure: 100 ms\nPFS, state: On\nZoom: 1.00×\nIntensilight, Illuminator (Illuminator (EPI)) NDFilter: 3.1\nStart time-lapse imaging.\nNote: The interval between image acquisition is changed depending on the purpose of the experiment. Two representative imaging schedules are shown below.\n[Schedule 1] Interval: 2 min, Duration: 40 min, Adding chemical dimerizer: frame 6\n[Schedule 2] Interval: 5 min, Duration: 60 min, Adding chemical dimerizer: frame 5\nAdd a chemical dimerizer (1 μL 100 μM rapamycin in this protocol) at the appropriate time point to induce mitochondrial morphology changes (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/901-Fig3.jpg\nFigure 3. How to add chemical dimerizer during time-lapse imaging\nDuring time-lapse imaging, it is recommended that the samples are kept out of the light of the room. We create a simple dark room by shading the underside of the microscope and placing a kim towel on top of the stage-top incubator where light can enter. When adding rapamycin, the cover of the stage-top incubator is removed, and rapamycin is added. After the addition of rapamycin, the cover is closed, and the images are taken again in a simple darkroom. In this figure, the light is turned on to facilitate the photo shoot; however, in the actual experiment, the light in the room is switched off.",
    "Note: To treat the cells uniformly with rapamycin, aliquot 1 μL 100 μM rapamycin into a 1.5-mL microcentrifuge tube and suspend in 100 μl imaging medium. Add the suspension so that it is spread evenly over the entire culture dish and is not accumulated in only one place.\nNote: The addition of rapamycin does not necessarily have to be performed in the dark. However, it is recommended that imaging is performed in the dark.\nNote: It is essential to use imaging conditions that do not cause changes in mitochondrial morphology unless the iCMM is activated. To optimize imaging conditions, it is recommended to perform time-lapse imaging without adding rapamycin and confirm that mitochondrial morphology does not change (no fragmentation or aggregation of mitochondria).\nProcess the imaging data using NIS-Elements AR imaging software (Nikon).\nNote: For image processing, it is necessary to follow the Data and Image Processing Policy of each journal. We show in Figure 4[href=https://www.wicell.org#fig4] the image processing to be performed for a representative mitochondrial image acquired by epifluorescence microscopy.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/901-Fig4.jpg\nFigure 4. An example of image processing for mitochondria\nAn image of the processing in NIS-Elements AR imaging software of a raw image of mitochondria in HeLa cells visualized by MitoTracker Red CMXRos dye is shown.\nNote: When performing quantitative analysis of mitochondrial morphology, it is necessary to perform image processing according to the method used. Methods using Image J (Valente et al., 2017[href=https://www.wicell.org#bib5]) and machine learning (Leonard et al., 2015[href=https://www.wicell.org#bib2]; Zahedi et al., 2018[href=https://www.wicell.org#bib6]) have been developed for mitochondrial morphology analysis."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biotechnology And Bioengineering",
    "Protein Biochemistry",
    "Molecular/Chemical Probes"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}