{
  "id": 17613,
  "origin_website": "Jove",
  "title": "Virtual Reality Tools for Assessing Unilateral Spatial Neglect: A Novel Opportunity for Data Collection",
  "procedures": [
    "This study was approved by the local Institutional Review Board and meets all criteria set forth by Good Clinical Practice Guidelines. All participants provided informed consent before any study procedures began. Study participants were expected to participate in three separate sessions (outlined in Table 1). The elements of the experiment are described in stepwise fashion below. Session order was randomized.\ntable:\n﻿0,1,2,3,4\nSession A,Pre-rTMA VR Task,Resting Motor Threshhold*,rTMR at STG or SMG,Post-rTMS VR Behavioral Task\nSession A,,5/10 pulses elicit MEP o finger twitch (*First session only),110% of RMT for 20 min at 1 Hz (1200 pulses total),\nSession A,15 min,60 min,20 min,15 min\nSession B,Pre-rTMA VR Task,Resting Motor Threshhold*,rTMR at Vertex,Post-rTMS VR Behavioral Task\nSession B,,5/10 pulses elicit MEP o finger twitch (*First session only),110% of RMT for 20 min at 1 Hz (1200 pulses total),\nSession B,15 min,60 min,20 min,15 min\nSession C,Pre-rTMS paper & Pencil Behavioral Task,Resting Motor Threshhold*,rTMR at STG or SMG,Post-rTMS paper & Pencil Behavioral Task\nSession C,Bell's test; Ota's circle cancellation; stay cancellation; line bisection task,5/10 pulses elicit MEP o finger twitch (*First session only),110% of RMT for 20 min at 1 Hz (1200 pulses total),Bell's test; Ota's circle cancellation; stay cancellation; line bisection task\nSession C,10 min,60 min,20 min,10 min\nTable 1. Structure for each study session. Session order was randomized. Estimated time for each item in italics. MEP=motor evoked potential; rTMS=Repetitive Transcranial Magnetic Stimulation; P&P=Paper and Pencil Stroke Diagnostic Tests; RMT=Resting Motor Threshold\n1. Paper & pencil behavioral tasks\nHave the subject complete the line bisection task (LBT).\n\t\nHave the subject sit at a table directly across from the tester. Provide the subject with a writing utensil. Provide the subject with the stimulus sheet (Figure 1), ensuring it is placed directly in front of the subject.",
    "​NOTE: Although not performed in this experiment, it would be ideal to present each line to be bisected individually on separate sheets of paper to avoid biasing subject with additional context (See Ricci and Chatterjee, 200142).\nInstruct the subject to bisect (divide into halves) each line printed on the stimulus sheet and get as close to the middle as possible.\nTell the subject to keep their head and shoulders centered as best as possible, to complete the task as quickly and accurately as possible, and to notify the tester when they are finished. Monitor the subject to ensure they are not leaning or tilting their head excessively.\nCollect the sheet from the subject when the subjects say they are done.\nHave the subject complete the Bell's Test.\n\t\nProvide the subject with the Bell's test stimuli sheet (Figure 2).\nInstruct the subject to circle or cross out all of the bells on the stimulus sheet, to do so as quickly and accurately as possible, to keep their head and shoulders as centered as possible, and to notify the tester when they are finished.\nMonitor the subject to ensure they are not leaning or tilting their head excessively. When the subject says they are finished, ask the subject if they are sure, and allow them to double check their work.\nCollect the sheet from the subject when the subjects say they are done a second time.\nHave the subject complete the star cancellation task.\n\t\nPresent the subject with the stimulus sheet (Figure 3), ensuring it is directly in front of them.",
    "Instruct the subject to circle or cross out all of the stars on the stimulus sheet, to do so as quickly and accurately as possible, to keep their head and shoulders as centered as possible, and to notify the tester when they are finished.\nMonitor the subject to ensure they are not leaning or tilting their head excessively.\nCollect the sheet from the subject when the subjects say they are done.\nHave the subject complete the Ota's circle cancellation task.\n\t\nProvide the subject with the Ota's circle cancellation stimulus sheet (Figure 4), ensuring it is placed directly in front of the subject.\nInstruct the subject to cross out or circle all of the open/incomplete circles, to do so as quickly and accurately as possible, to keep their shoulders as centered as possible, and to notify the tester when they are finished.\nMonitor the subject to ensure they are not leaning or tilting their head excessively.\nCollect the sheet from the subject when the subjects say they are done.\nRepeat this task (steps 1.4.1 through 1.4.4) with another copy of the stimulus sheet, but this time the stimulus sheet should be rotated 180 degrees from the orientation it was originally presented.\n2. TMS procedures\nCreate a model for neuronavigation prior to the first session.\n\t\nObtain the subject's 3T T1 MRI scan in a NIFTI or dicom file type.\nUpload that MRI scan into the neuronavigational software to create a 3D representation of the subject's brain.\n\t\t\nSelect New Empty Project within the software. Drag the subject's MRI scan onto the field labeled \"File:\".\nGo to the Reconstructions tab.\nSelect New Skin and on the next screen, drag the green boundary lines to encompass the entire image of the brain. Select compute skin. Adjust the Skin/Air Threshold accordingly to get an optimal reconstruction.",
    "Go back to the Reconstructions tab and select New Full Brain Curvilinear and drag the green boundary lines to encompass the entire image of the brain. Set slice spacing to 1 mm and set end depth to 18 mm. Select Compute Curvilinear.\nGo to Landmarks tab and select Configure Landmarks. Select New to create a landmark on the reconstruction. Place landmarks on the tip of the nose, bridge of the nose, left tragus, and right tragus.\nGo to the Targets tab and select Configure Targets. Select the Curvilinear Brain & Targets view. Using the inspector, peel to a depth of 5-7 mm.\nFollow guidelines of Shah-Basak et al. (2018)14, Neggers et al. (2006)11 and Oliveri and Vallar (2009)39 to locate the superior temporal gyrus or the supramarginal gyrus, and place a marker at those sites.\nPlace a marker where the two central sulci meet along the median longitudinal fissure for sham stimulation at the vertex.\nDuring the first session, find the subject's Resting Motor Threshold (may be completed before or after behavioral task).\n\t\nHave the subject seated in front of an optical tracking camera and place a tracker on the subject using a headband or glasses.\nAttach three disposable electrodes on the subject's right hand and wrist.\n\t\t\nAttach one disk electrode to the subject's first dorsal interosseous. Attach a second disk electrode to the subject's second knuckle on their right pointer finger. Attach a ground electrode to the subject's right wrist.\nPlug these electrodes into an electrode adaptor, which inputs into an MEP tracking software.\nOpen the subject's project within the neuronavigational software by selecting New Online Session.\nSelect the targets to be stimulated in this session (Vertex, SMG, STG).\nGo to the Polaris tab and ensure the subject tracker is within view of the camera.\nGo to Registration tab.",
    "Using a pointer registered to the neuronavigational software, touch the subjects' face in the same locations that the landmarks were placed in step 2.1.2.5.\n\t\t\nClick Sample and go to Next Landmark when the pointer is positioned properly on the subject's head for each landmark.\nGo to Validation tab.\nUsing the pointer, touch the subject in various spots on their head and ensure the crosshairs on the screen line up with the spot being pointed to on the subject.\n\t\t\nIf they do not line up, redo step 2.2.8 and make sure the pointer is as precisely placed on the landmarks as possible.\nGo to Perform tab and ensure the Full Brain Curvilinear View is selected so the experimenter can precisely locate brain regions to target.\nSet driver to be the TMS coil that will be used.\nPlug handheld TMS coil into TMS machine.\nTurn on the TMS Machine and set to single pulse. Set stimulation intensity appropriately; in this experiment, 65% of machine output was used as a starting point.\nPlace the handheld TMS coil on the left side of the subject's head and stimulate within the motor cortex using single pulses of TMS to identify the location that stimulates the FDI. It may be helpful to have an assistant to watch the subject's finger to identify when the FDI muscle twitches due to stimulation.\nAlter the stimulation intensity until stimulation elicits MEP of at least 50 mV exactly 5/10 times, and this will be the resting motor threshold (rMT).\nStimulation in between tasks\n\t\nRepeat steps 2.2.1 through 2.2.13, substituting an air-cooled TMS coil for the handheld coil.",
    "Set stimulation parameters to repetitive TMS at a rate of 1 Hz for 20 minutes (1200 pulses total) with an intensity of 110% of rMT in accordance with parameters set by Shah-Basak et al. (2018)15.\nPlace an air-cooled TMS coil with a built-in cooling system on the subject's head targeting the SMG or STG for active sessions or the Vertex for sham sessions (Figure 5).\nProceed with stimulation.\n3. VR behavioral task\nInstall supporting software.\n\t\nDownload and install Pupil core software from the Pupil Labs website.\nDownload and install Unity 3D 2018.3 from the Unity website.\nDownload and install OpenVR tool through Unity Asset Store or through Steam.\nSet up the VR hardware (e.g., HTC Vive Pro).\n\t\nPlace base stations on opposite sides of the room, ensuring a clear line of sight, and plug them in.\nPress the Channel/Mode button on the back of each sensor to cycle through channels until one of them is set to channel \" b\" and one is set to \" c.\" Both status LEDs should be white.\nInstall Pupil Labs Binocular insert into HTC Vive Pro. Connect the Link Box to the computer (Power, USB-A, and HDMI or Mini DisplayPort).\nConnect the headset to the Link Box. Adjust top and side straps on headset. Adjust the lens distance.\nLaunch SteamVR.\n\t\nLaunch SteamVR by clicking on the VR icon in the top right corner of Steam.\n\t\t\nTurn on controllers with the power button.\nOn SteamVR, click Settings | Pair New Device to pair each controller by following on-screen instructions.\nClick Room Setup from the SteamVR menu and follow on-screen instructions.\nLaunch Pupil Core Software.",
    "Place headset on the seated subject's head and give them both controllers. Ensure the straps are tight but comfortable. Ensure both eyes are visible by visually confirming they are centered in the Pupil Core Software's camera feeds.\nOpen the VR task in the Unity Editor and hit the Play button.\nRun the experiment.\n\t\nAsk the subject to look straight ahead and click the Tare Camera button on the screen.\nClick the Begin Tutorial button and wait for the subject to complete the tutorial. The tutorial consists of audio instruction about the operation of the VR system controller, descriptions and examples of symmetrical (decoy) and asymmetrical (target) flowers, and a 1-minute practice session with a small number of decoy and target flowers. The tutorial lasts 75-100 seconds and tutorial performance data is not collected.\nWhen subject is finished, click the Calibrate Eye Tracking button.\n\t\t\nIf the calibration is successful, the subject will automatically begin the task. Otherwise, repeat step 3.7.3.\nBegin the first trial by clicking the Next Trial button.",
    "NOTE: During the VR task, subjects are placed in a virtual forest (Figure 6). Three curved box hedges formed a semi circle within reaching distance in front of the subject. Each trial consisted of a varying number of flowers, each with 16 petals, distributed among the hedges at a direct line of sight (Figure 7). Subjects were instructed to \"pick\" (hold their controller over a flower so that the flower would highlight, then depress the trigger button with their index finger) all asymmetrical \"target\" flowers and leave alone all symmetrical \"decoy\" flowers. Each trial would end when the subject successfully picks all of the asymmetrical target flowers, but also would end if the subject ran out of time (2-minute time limit) or if the subject inadvertently picked all of the symmetrical decoy flower. In all of these cases the remaining flowers on the bushes would be cleared, and the experimenter would be prompted to begin the next trial.\nWait until the subject is no longer actively completing a trial and then repeat step 3.7.4 unless at least 12 trials have been completed.\nClick the Play button again to end the task.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}