{
  "id": 6075,
  "origin_website": "Bio",
  "title": "Glycogen and Extracellular Glucose Estimation from Cyanobacteria <em>Synechocystis</em> sp. PCC 6803",
  "procedures": [
    "Cultivation of cyanobacteriaCyanobacterium (Synechocystis) cell stocks are kept at -80 °C in 20% glycerol. Add ~100 µl of the frozen stock to 50 ml BG-11 media (see Recipe 1) in a 100 ml conical flask. Grow a starter culture for 3-4 days (until OD730 is around 0.5) under white light (25 μmol m-2 sec-1) in a light-incubator at 30 °C with shaking at 150 rmp. To conduct glucose consumption and glycogen estimation experiments, make a fresh culture in 100 ml BG-11 media in a 200 ml conical flask with an initial OD730 of 0.1 and incubate in a photo-incubator under the same conditions mentioned above. When the OD730 is around 0.4 (it usually takes ~36 h), 1 ml (0.5 M) sterile D-glucose solution (see Recipe 2) is added to the 100 ml culture media to get a final glucose concentration of 5 mM. Grow cultures in two conditions: (1) Dark-glucose condition, in which the conical flask is wrapped with aluminum foil and (2) Light-glucose condition in which the conical flask is not wrapped in foil. Collect a sample for glucose and glycogen measurement every 24 h from both conditions.For each 2 ml collection, transfer it to a 2 ml Eppendorf tube, measure the OD730 using a spectrophotometer and record it. Centrifuge the 2 ml samples at 17,000 x g for 2 min at room temperature and transfer the supernatant to a separate 2 ml Eppendorf tube. The supernatant is used for assaying glucose and the rest is used for assaying glycogen (more details in glycogen measurement section).Extracellular glucose measurementThe sample from Step A3 is used to assay for glucose (Table 1)Table 1. Experimental design for extracellular glucose testimgsrc:https://en-cdn.bio-protocol.org/attached/image/20180502/20180502034346_5255.jpgNote: We take 5 biological & 3 technical replicates for each experiment.Open the spectrophotometer.",
    "Add 2 ml assay reagent (see Recipe 3) to each tube. Mix thoroughly by vortexing. Add 500 µl of samples and standard to cuvettes and measure the absorbance at 540 nm against the blank. Record as ‘initial reading’.Place the tubes in a water bath at 37 °C for exactly 30 min. Stop the reaction by adding 2 ml of 12 N H2SO4 (add the acid in the chemical hood for safety) and mix thoroughly with extra care by vortexing. To get the exact incubation duration, keep a 30-60 sec interval of pipetting of blank, standard and test samples. The presence of glucose results in the development of pink color (Figures 1A and 1B). The more glucose in the sample, the stronger the pink color looks.The OD at 540 is measured after 30 min against the blank and recorded as ‘final reading’.Note: The Step B4 should be performed immediately after Step B3. The time interval should be maintained strictly equal. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180502/20180502034616_3203.jpgFigure 1. Quantitative assay of extracellular glucose from growth medium. Three replicates are shown for WT (panel A) and a mutant cyanobacterium (panel B). In principle, glucose is oxidized to gluconic acid and hydrogen peroxide by glucose oxidase. Hydrogen peroxide then reacts with reduced o-Dianisidine in the presence of peroxidase to form a brown colored oxidized o-Dianisidine. Oxidized o-Dianisidine reacts with sulfuric acid to form a more stable pink-colored product. The intensity of the pink color measured at 540 nm is proportional to the original glucose concentration. Thus, the pink color indicates the presence of glucose, whereas the white/clear color indicates very little glucose. The results are also available in Khan et al., 2016.Glycogen measurementUse the sample collected in Step A3. Calculate the approximate cell number from the OD730 value as follows; OD730 value of 1.",
    "0 can be taken as 1.03 x 108 cells per ml. Centrifuge approximately 3 x 109 cells from wild type and mutant Synechocystis cultures each at 1,700 x g for 2 min. Remove the supernatant. Wash the pellet each with 1 ml sterile ddH2O two times. Immediately, move the cell pellet to -80 °C for 5 min to stop the metabolism. Next, place the cell pellet in a freeze dryer at -70 °C overnight under a continuous flow of nitrogen. On the next day, after drying ~14 h in the freeze dryer, weigh the dried cell pellet and record the weight. Resuspend the dried cell pellet in 1 ml of 30% (w/v) KOH (see Recipe 4). Mix completely by pipetting (3 to 5 min).Place the mixture in a 97 °C water bath for 2 h with swimming holder (set the water bath in advance to make sure the temperature is correct). Divide the 1 ml of 30% KOH-suspended sample into two separate Eppendorf tubes, each with 500 µl. Add ~1.3 ml ice cold ethanol to a final concentration of 70-75%. Incubate on ice for 2 h.Centrifuge the mixture at 17,000 x g for 2 min at room temperature. Remove the supernatant while being careful not to disturb the pellet at the bottom of the tube. Wash the pellet three times with 98% ethanol. The pellet seen at the bottom of the Eppendorf tube is glycogen.Open the lid of the Eppendorf tube and place in a 60 °C oven for 10-20 min (depends on how long it takes to dry completely).Resuspend the dried pellet in 0.5 ml 100 mM sodium acetate (pH 4.5) (see Recipe 5). If two tubes contain the same sample (divided in Step C5), they can be added together to get a volume of 1 ml.",
    "Dissolve a fixed amount of glycogen (0.005 mg) in 1 ml 100 mM sodium acetate (pH 4.5). This is the STDglyc.Add 2 mg amyloglucosidase to the 1 ml suspension obtained in the Step C8 (final concentration 2 mg/ml). Incubate in a 60 °C water bath for 2 h. Amyloglucosidase hydrolyzes glycogen into glucose.Measure the glucose following Steps B4 to B7 described in ‘Procedure B’."
  ],
  "subjectAreas": [
    "Microbiology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}