{
  "id": 3269,
  "origin_website": "Cell",
  "title": "Generation of mouse hippocampal brain organoids from primary embryonic neural stem cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nMouse embryonic (E14.5) neural stem cells isolation from SGZ\nTiming: 1 h\nThe starting point for the generation of mouse brain organoids is the isolation of neural stem cells (NSCs) from the subgranular zone (SGZ), a well-known stem cells niche.2[href=https://www.wicell.org#bib2],3[href=https://www.wicell.org#bib3] The peak of neurogenesis of mouse brain is at embryonic day 14.5 (E14.5)4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5] therefore to ensure an efficient isolation of NSCs we extract cells at this developmental stage.\nCritical: tissue harvesting, and cells isolation procedures should take no more than 1 h to ensure a high yield of viable stem cells.\nNote: This protocol is based on the use of c57Bl/6J mouse colonies. Similar results could be obtained with other mouse colonies (e.g. CD1 mice).\nSacrifice pregnant adult female mouse by cervical dislocation.\nNote: to ensure the collection of embryos at E14.5 it is important to determine the day 0 of pregnancy by following specific procedure6[href=https://www.wicell.org#bib6] or by relying on vendor information.\nCritical: cervical dislocation must be performed by trained and qualified personnel only. Cervical dislocation without prior anesthesia with CO2 or isofluorane inhalation ensures high yield of healthy, viable embryos7[href=https://www.wicell.org#bib7],8[href=https://www.wicell.org#bib8] however a fast CO2 narcosis or isoflurane induction before the cervical dislocation can be performed.\nClean the mouse skin with Et-OH 70% and quickly harvest the embryos.\nGrab skin below the center of the belly with forceps and cut through the skin to expose the abdominal and thoracic cavities.\nRemove the sac containing the string of embryos.\nRemove the embryos one-by-one by gently cutting away the outer membrane (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig1.jpg\nFigure 1. Representative images of embryonic (E14.5) mouse brain to facilitate SGZ recognition and dissection\n(A) Procedure of embryos extraction.",
    "(B) Coronal view of intact brain extracted from E14.5 mouse embryo. Both hemispheres and a portion of brainstem are visible. Cut off the brainstem to proceed only with the hemispheres.\n(C) The hemispheres are separated by cutting at the middle. Red dashed lines in B-C indicate the cutting lines.\n(D) One by one hemisphere is flipped 90° side down. The flipped hemisphere presents a tissue hump (delimitated by green dashed line and black head arrow) representing the midbrain and thalamus inner brain regions.\n(E) Scheme of a sagittal section of E14.5 mouse brain highlighting the anatomical structures. The hippocampal allocortex (delimitated by blue dashed line) hosts the primordium of SGZ.\n(F) The SGZ resides behind the midbrain and thalamus inner brain tissue; carefully lift it to harvest the SGZ. LH: left hemisphere, RH: right hemisphere; SGZ: sub granular zone.\nCollect the embryos’ heads in HBSS 1× on ice.\nNote: hereafter work under sterile hood.\nUnder stereomicroscope isolate the brain, divide the hemispheres and process one-by-one (Figures 1[href=https://www.wicell.org#fig1]B–1D, Methods video S1[href=https://www.wicell.org#mmc1]).\nCritical: keep the half hemispheres hydrated with HBSS 1× during the procedure to avoid tissue degradation.\nIdentify the SGZ region (Figures 1[href=https://www.wicell.org#fig1]E and 1F), carefully isolate the zone by using forceps.\nNote: at this embryonic stage, the hippocampal region is not completely formed and thus the dentate gyrus and the SGZ is not clearly visible.\nRefer to Methods video S1[href=https://www.wicell.org#mmc1] for the procedure of SGZ isolation.\nCollect the extracted tissues in a 15 mL falcon tube, previously filled with 6 mL of HBSS and keep it on ice (4°C).\nRepeat step 4–6 for each embryos’ brain and pool all the harvested SGZs together.\nCentrifuge 1 min 300 g and discard the supernatant solution by using pipette.",
    "Critical: the tissue pellet is faint, do not turn the falcon tube to remove the supernatant.\nWash the tissue pellet with PBS 1×.\nRepeat step 8.\nResuspend the tissue pellet in 3 mL of SGZ-NSCs extraction solution by gently mixing.\nTransfer the suspension in a gentleMACS tube (Purple-cap C Tubes – for tissue dissociation) (Miltenyi Biotec).\nInsert the tube into the gentleMACS Dissociator instrument, running the following pre-set gentleMACS Program: BRAIN_01_01′.\nIncubate the tube at 37°C water bath for 10 min.\nInsert the tube into the gentleMACS Dissociator instrument.\nRunning the pre-set gentleMACS Program BRAIN_02_01′.\nRunning the pre-set gentleMACS Program BRAIN_03_01′.\nCritical: if the tissue looks not completely homogenate, repeat once again step 15a-b.\nAlternatives: if the gentleMACS Dissociator instrument is not available, tissue dissociation can be performed by manual mechanical dissociation: vigorously pipette up and down (at least 20 times) the solution by using a p1000 and then 10 times by using a Pasteur pipette. Note that this procedure could result in a high number of dead cells.\nFilter the solution with a 40 μm cell strainer in a 50 mL falcon tube.\nCentrifuge 10 min 300 g, gently remove the supernatant by using a pipette.\nResuspend the pellet in 1 mL of Expansion medium to obtain the cell suspension.\nCount cells:\nMix 90 μL of Trypan Blue with 10 μL of the cell suspension (step 18) in a 500 μL Eppendorf.\nPut 10 μL of the suspension prepared in a. into the Burker counting chamber.\nCount viable cells by using a bright-field inverted microscope.\nNote: cell count can be performed with the preferred method; automatic cell counter or different chambers e.g., Neubauer chamber can be used.\nSeed 500′000 viable cells in a 75 cm2 flask filled with 12 mL of Expansion medium.",
    "Critical: low yield of cells could be obtained from isolation due to few starting embryos or to an incomplete tissue dissociation. Seed the cells in 25 cm2 flask or 6-wells plate accordingly to the number of cells obtained.\nCulture the NSCs in incubator 37°C until the formation of neurospheres.\nCritical: daily examinate the NSCs culture under microscope to check potential contamination.\nRefill the cells medium with 1 mL of fresh Expansion medium every other day.\nNote: at least 1–2 weeks are necessary for neural stem cells neurospheres to reach the right density before splitting them (see steps 23–34).\n    Your browser does not support HTML5 video.\n  \n      Methods video S1. Procedure for the isolation of the subgranular zone of E14.5 mouse embryos, related to steps 4 and 5\n    \nNeurospheres splitting and expansion\nTiming: 20 min\nThis section describes the procedure to enzymatically dissociate neurospheres to obtain single cells necessary to generate organoids. Single cells can be expanded and maintained in culture or even frozen.\nCollect the medium containing neurospheres into a 15 mL falcon tubes.\nCritical: check under the microscope if any neurospheres are still present in the flask to ensure to collect most of the cells.\nNote: if a lot of neurospheres are still visible in the flask, wash it with PBS 1× ensuring to harvest almost all of them.\nCentrifuge 5 min at 300 g.\nCarefully discard the supernatant by using a 10 mL serological pipette.\nUse p1000/p200 tip to completely remove any liquid residual.\nCritical: excess of liquid will affect the Accutase dissociation.\nAdd 200 μL of Accutase to the pellet.\nNote: 200 μL of Accutase is used for a cell pellet derived from 2 T75 flasks.\nGently homogenize the pellet with Accutase for max 3–5 min avoiding bubbles formation.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig2.jpg",
    "Figure 2. Representative images of neurospheres to be processed for Accutase treatment\nThe majority of cells inside the Flask should be as neurospheres before splitting. Once the Accutase is added to cell pellet, gently pipetting up and down the cellular suspension until the solution became milky and neurospheres are no longer visible.\n(A) Neurospheres not ready to be splitted.\n(B) Neurospheres ready to be splitted.\n(C) Cell suspension before Accutase treatment.\n(D) Cell suspension after Accutase treatment.\nNote: stop the Accutase process as soon as the solution become opaque and neurosphere aggregates are no longer visible to unaided eye (see Figure 2[href=https://www.wicell.org#fig2]).\nCritical: long Accutase treatment or aggressive pipetting may cause cell death.\nAdd PBS 1× up to 6 mL to dilute the Accutase.\nCentrifuge 5 min at 300 g.\nCarefully discard the supernatant by using a 10 mL serological pipette.\nUse p1000/p200 tip to completely remove any liquid residual.\nResuspend the single cells pellet in 1 mL of Expansion medium to obtain cell suspension.\nCell count:\nMix 90 μL of Trypan Blue with 10 μL of the cell suspension (step 30) in a 500 μL Eppendorf.\nPut 10 μL of the suspension prepared in a. into the Burker counting chamber.\nCount viable cells by using a bright-field inverted microscope.\nNote: 3 millions of cells are generally obtained from a single T75 flask. If high number of cells is obtained, NSCs can be frozen (step 33) or used to further expansion (step 34).\nAt this step cells can be directly used in step 35 to generate organoids following unguided protocol or in step 38 to generate organoids with for hippocampal specification.\n(Optional) Resuspend the cells to be frozen in at least 1 mL of 50% expansion medium and 50% of freezing solution (20% DMSO plus 80% FBS).",
    "Quick store the vial at −20°C for few hours to let the cells freeze.\nMove the frozen cells at −80°C.\nNote: frozen cells can be stored at −80°C for several months.\nMove the frozen cells in liquid azote for long (years) storage.\n(Optional) Plate 500′000 viable cells or 250′000 viable cells in T75 or T25 flask, respectively.\nSupplement the T75 or T25 flask with 12 mL or 6 mL of Expansion medium, respectively.\nRefill with 1 mL or 500 μL fresh Expansion medium every other day, until neurospheres forming.\nCritical: avoid repeated splitting and expansion of cells as neurospheres to prevent NSCs differentiation and attachment to the plate. The maximum number of splitting recommended is 4–5.\nBrain organoid culture (unguided protocol)\nTiming: 1 month\nThis section describes the three phases (see Figure 3[href=https://www.wicell.org#fig3]) that lead to the generation of mouse brain organoids with consistent size, organized neural network and functional neurons within 32 days. The organoid generation method described in this section relies on spontaneous neuronal differentiation without any extrinsic patterning to guide the development into a specific brain region. However, due to the neural stem cell source used, the organoids may have an intrinsic patterning toward dorsal, rather than ventral, brain region specification. To generate organoids with hippocampal-specific phenotype directly go to step 38.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig3.jpg\nFigure 3. Culturing steps of mouse brain organoids protocol and related media and factors used\nThe protocol consists of three steps: expansion (days 0 to 4), induction (days 5 to 14) and differentiation (days 15 to 32) phase. In each phase, the organoids are provided with media enriched with defined growth (bFGF and/or EGF) or differentiation (BDNF) factors. For hippocampal phenotype induction the morphogen WNT3a is added to culture media during the expansion and induction phase.",
    "Note: Keep brain organoids in dynamic culture throughout all the phases (ORBi shaker at 75rpm).\nExpansion phase (days 0‒4):\nDay 0: seed 20′000 single viable cells/well (day 0) on 24 well plates in 500 μL of culture medium Expansion medium.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig4.jpg\nFigure 4. Representative organoids images at critical step of the protocol. Scale bars: 200μm\nCritical: seeding must be homogeneous for the organoids to form in a proper way (see Figure 4[href=https://www.wicell.org#fig4]). Ensure pipetting before each seed. Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nNote: seed the cells only in 18 wells of the 24 well plate can help to maintain the humidity of the plate and better allow the growth of the brain organoids. Putting sterile PBS 1× into the last row of the plate.\nDay 1: check cells assembly under a microscope. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nDay 2: discard 80 μL of the culture medium and refill with 100 μL of fresh Expansion medium.\nDay 4: discard 80 μL of the culture medium and refill with 100 μL of fresh Expansion medium.\nInduction phase (days 5‒14): to promote spontaneous NSCs differentiation, gradually lower growth factors’ concentration.\nDay 5: completely replace Expansion medium with 500 μL of Induction medium I.\nCritical: at this stage, brain organoids are fragile, and it is recommended to avoid touching them during the medium change. To ease the medium change, put a black sheet under the plate to better visualize the samples and tilt the plate to let the brain organoids lay on one side of the well.\nDay 7: completely replace Induction medium I with 500 μL of Induction medium II.\nCritical: To ease the medium change, put a black sheet under the plate to better visualize the samples and tilt the plate to let the brain organoids lay on a side.",
    "Day 9: discard 80 μL of the medium and refill with 100 μL of fresh Induction medium II every other day (on day 11 and day 13).\nDifferentiation phase (days 15‒32): boost brain organoids’ neural differentiation by supplementing the culture medium with BDNF.\nDay 15: completely replace Induction medium II with 500 μL of Differentiation medium.\nCritical: at this stage, brain organoids are small and they could be accidentally taken up. To ease the medium change, put a black sheet under the plate to better visualize the samples and tilt the plate to let the brain organoids lay on a side.\nDay 17: discard 80 μL of the medium and refill with 100 μL of fresh Differentiation medium every other day (on days 19, 21, 23, 25, 27, 29, 31).\nNote: Brain organoids characterization can be performed at different time points (i.e., day 7, day 14, day 21 and day 32) to follow the cellular organization and the differentiation progress. To do that, some of the organoids kept in culture can be appropriately stored at the desired time for further analysis (see step 41 for immunofluorescence analysis; step 79 for calcium imaging; step 85 for mtDNA analysis; step 107 for protein extraction).\nRepresentative images of brain organoids morphology at different stages of the culture protocol are reported in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig5.jpg\nFigure 5. Organoids morphology at different stages of the culture protocol. Scale bars: 200μm\nHippocampal phenotype specification in brain organoids\nTiming: 1 month\nThis section describes the generation of mouse brain organoids with hippocampal-specific phenotype.",
    "The hippocampus is one of the brain regions mostly involved in the pathology progression of many neurodegenerative disorders including Alzheimer’s disease and epilepsy.9[href=https://www.wicell.org#bib9],10[href=https://www.wicell.org#bib10] By adding the WNT3a factor, crucial for the hippocampal fate determination,11[href=https://www.wicell.org#bib11] it is possible to generate mouse brain organoids that specifically own hippocampal signature. To this end, the three steps of the brain organoid culture are maintained (steps 35–37) (see Figure 3[href=https://www.wicell.org#fig3]), with slight modification on the media provided during the expansion and induction phase. Specifically, 5 ng/mL WNT3a is added to Expansion medium, Induction medium I and Induction medium II. Key passages are reported below.\nNote: Keep brain organoids in dynamic culture throughout all the phases (ORBi shaker at 75 rpm).\nExpansion phase (days 0‒4):\nDay 0: seed 20′000 single viable cells/well (day 0) on 24 well plates in 500 μL of Expansion medium plus 5 ng/mL WNT3a. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nDay 1: check cells assembly under microscope. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nDay 2: discard 80 μL of the culture medium and refill with 100 μL of fresh Expansion medium plus 5 ng/mL WNT3a.\nDay 4: discard 80 μL of the culture medium and refill with 100 μL of fresh Expansion medium plus 5 ng/mL WNT3a.\nInduction phase (days 5‒14): to promote spontaneous NSCs differentiation, gradually lower growth factors’ concentration.\nDay 5: completely replace Expansion medium with 500 μL of Induction medium I plus 5 ng/mL WNT3a.\nDay 7: completely replace Induction medium I with 500 μL of Induction medium II plus 5 ng/mL WNT3a.\nDay 9: discard 80 μL of the medium and refill with 100 μL of fresh Induction medium II plus 5 ng/mL WNT3a every other day (on day 11 and day 13).\nDifferentiation phase (days 15‒32): boost brain organoids neural differentiation by supplementing the culture medium with BDNF.",
    "Note: hereafter, addition of Wnt3a is not necessary anymore.\nDay 15: completely replace Induction medium II with 500 μL of Differentiation medium.\nDay 17: discard 80 μL of the medium and refill with 100 μL of fresh Differentiation medium every other day (on day 19, 21, 23, 25, 27, 29, 31).\nWe did not report any statistically significant differences in the morphology of brain organoids with hippocampal signature and the ones generated with the unguided protocol when observed in brightfield microscopy (see Figure 6[href=https://www.wicell.org#fig6]). Likewise, we didn’t find any significant differences in size between the two set of brain organoids (see Figure 6[href=https://www.wicell.org#fig6]). However, by adding WNT3a at low concentration (5 ng/mL) you will be able to obtain hippocampal specific neurons, expressing both the pan-hippocampal ZBTB20 marker, typical of all neurons committed to hippocampal identity, and the KA1 marker, primarily expressed by pyramidal neurons in the CA3 subfield1[href=https://www.wicell.org#bib1] (see also Figure 9[href=https://www.wicell.org#fig9]). Conversely, by using a high concentration of WNT3a (20 ng/mL) it is reported the specific induction of the DG hippocampal neurons phenotype.12[href=https://www.wicell.org#bib12],13[href=https://www.wicell.org#bib13]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig6.jpg\nFigure 6. Representative brain organoids brightfield images and size at different stages of the culture protocols. Scale bars: 200μm\nCharacterization of brain organoids by immunofluorescence:\nBrain organoids’ fixing for immunofluorescence\nTiming: 20 min",
    "Fixing the brain organoids at critical time points allow to perform IF analysis and compare their development at different stages. Early organoids (before the differentiation phase) are very fragile so must be handled with care. On the contrary, late organoids, although being more compact, are smaller. Fixing brain organoids at different stage of the protocol, e.g., at 7, 14, 21 and 32 days, allows us to have a snap of the cellular organization at each phase of the culture as well as to follow the neuronal maturation. Any other desired time point can be selected to perform the analysis.\nCollect the brain organoid by using a p1000 with cut tip, at any desirable time points.\nPut the organoid in a well of a 24-well plate.\nAspirate and discard any medium residual.\nAdd 500 μL of fixing solution (see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section for fixing solution recipe).\nIncubate at 20°C–22°C for 15 min.\nCritical: longer periods of incubation will determine the deterioration of the 3D structures.\nAspirate and remove the fixing solution and replace with 500 μL of PBS 1×.\nAspirate and remove the PBS 1× with any residual of fixing solution and replace with 500 μL of PBS 1×.\nCritical: To ease this passage, put a black sheet under the plate in order to better visualize the samples and tilt the plate to let the brain organoids lay on a side.\nRepeat step 44.\nStore the fixed brain organoids in PBS 1× at 4°C for no longer than 3 weeks.\nNote: for best results proceed to step 47 (for immunofluorescence on sliced brain organoids) or step 68 (for immunofluorescence on whole mount brain organoids) within a week.\nCryosectioning of brain organoids for immunofluorescence\nTiming: 30 min",
    "In this section we describe the steps to obtain 30 μm organoid’s slices for further immunostainings. Thinner slices are very likely to break during the cutting. Given their smaller dimensions compared to human brain organoids, be careful not to lose the organoids during the various steps. Early organoids (before differentiation phase), although having bigger size, are more fragile compared to the late ones. Refer to Figure 7[href=https://www.wicell.org#fig7] to visualize all the passages of the brain organoids’ cutting procedure.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig7.jpg\nFigure 7. Steps of organoids’ cutting for immunofluorescence analysis\nCritical: carefully avoid air bubbles throughout all the steps, since they will determine the breaking/loss of the brain organoid’s slices.\nNote: for best results, it is important to maintain constant the working temperature of the cryostat (−20°C/−25°C) during all the steps. Keeping the room at cool temperature may help avoiding unwanted increased temperature of the instrument.\nCreate OCT stamps.\nCooling the OCT solution in the pre-formed mold (Figures 7[href=https://www.wicell.org#fig7]A–7C).\nNote: We use transmission electron microscopy (TEM) silicon grids (Figure 7[href=https://www.wicell.org#fig7]A) but any other suitable mold can be used to create OCT stamps.\nKeep the OCT stamps at −20°C.\nNote: OCT stamps can be prepared in advance.\nOnce the OCT is solidified, define the zone where the brain organoid will be placed with a dark marker (Figure 7[href=https://www.wicell.org#fig7]D). This step will ease the cutting process by making the organoid visible when it will be placed on the stamp.\nPut a drop of OCT on a black support (Figure 7[href=https://www.wicell.org#fig7]E) in order to make the brain organoid visible while transferring it.\nPick up the organoid from the 24 well with a cut p1000/p200 pipette tip.\nPlace the organoid into the OCT drop (Figures 7[href=https://www.wicell.org#fig7]F–7J).\nNote: Work at 20°C–22°C.\nCritical: minimize the volume of PBS transferred with the organoid. Troubleshooting 3[href=https://www.wicell.org#sec6.5].",
    "Pick up the brain organoid from the OCT drop using a needle and place it on the marked zone of the OCT stamp (Figure 7[href=https://www.wicell.org#fig7]N).\nCritical: carefully pick up the organoid with the back part of the needle (Figures 7[href=https://www.wicell.org#fig7]K‒7M), since the organoid gets stuck into the gauge. Alternatively, use a cut pipette tip but be careful not to get the organoid stuck in it.\nPlace the stamp containing the brain organoid into the cryostat to allow the sample freezing.\nPrepare cryostat chucks, covering them with a thin layer of OCT (Figures 7[href=https://www.wicell.org#fig7]O and 7P).\nWhen the sample is frozen, cover the brain organoid into the stamp with additional OCT. Let it freeze.\nOnce the brain organoid is frozen, place the stamp vertically on the cryostat chunk and use some liquid OCT to allow it to stick to the chunk (Figure 7[href=https://www.wicell.org#fig7]Q).\nCover the structure with additional OCT to obtain a resistant structure that will not detach from the chunk while cutting (Figure 7[href=https://www.wicell.org#fig7]R).\nWhen the structure is frozen, start cutting at 30μm (Figures 7[href=https://www.wicell.org#fig7]S–7V).\nCheck the integrity of the brain organoids slices under microscope (Figure 7[href=https://www.wicell.org#fig7]W) and dark mark the glass slice in correspondence of organoid’s slices to ease their visualization.\nPause point: slices can be eventually stored at −20°C until use or directly used (step 59).\nImmunofluorescence on sliced brain organoids\nTiming: 8 h",
    "In this section we report the protocol for immunofluorescence analysis on sliced brain organoids, that allow to visualize the spatial distribution of the cells composing the organoids and to characterize their phenotype, as well as their developmental stage. By immunofluorescence analysis at defined time point i.e., 7, 14, 21 and 32 days it is possible to follow the progression of cellular organization and maturation within the brain organoids. The list of antibodies used to characterize the mouse brain organoids is reported in Table 1[href=https://www.wicell.org#tbl1]. To characterize the brain organoid development, we use Vimentin and SOX2 antibodies for neural stem cells14[href=https://www.wicell.org#bib14],15[href=https://www.wicell.org#bib15],16[href=https://www.wicell.org#bib16]; Ki67 marker for proliferative cells17[href=https://www.wicell.org#bib17],18[href=https://www.wicell.org#bib18]; DCX, B3Tubulin and MAP2 markers for neuronal precursors cells, immature and mature neurons,19[href=https://www.wicell.org#bib19],20[href=https://www.wicell.org#bib20],21[href=https://www.wicell.org#bib21],22[href=https://www.wicell.org#bib22],23[href=https://www.wicell.org#bib23] respectively; GFAP marker is used for glial cell identification.24[href=https://www.wicell.org#bib24],25[href=https://www.wicell.org#bib25] Representative images of immunofluorescence analysis performed on sliced brain organoids at different time point are reported in Figure 8[href=https://www.wicell.org#fig8].\ntable:files/protocols_protocol_2861_25.csv\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig8.jpg\nFigure 8. Representative confocal images of immunofluorescence analysis performed on sliced organoids generated with the unguided protocol at different stages of the culture protocol to evaluate the cellular organization and maturation. Scale bars: 50μm\nImmunofluorescence analysis on sliced organoids can also give information about specific brain regional identity. Indeed, specific brain regional markers can be used to highlight the presence of hippocampal (i.e., ZBTB20, Ka1, OCT6 and FZD9)12[href=https://www.wicell.org#bib12],13[href=https://www.wicell.org#bib13],26[href=https://www.wicell.org#bib26] rather than cortical (i.e., FOXG1) cells within brain organoids. Pre-albumin (TTR) and NKX2.1 or GSX2 can be used to detect cells with choroid plexus and ganglionic eminences signature,26[href=https://www.wicell.org#bib26] respectively. Representative images of sliced organoids stained with brain regional identity markers are reported in Figure 9[href=https://www.wicell.org#fig9].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig9.jpg\nFigure 9. Brain organoid's regional identity characterization",
    "Representative confocal immunofluorescence images of sliced organoids at 32 days with hippocampal specification stained for pan-hippocampal (ZBTB20), CA3- (KA1) and CA2- (FZD9) hippocampal markers and sliced organoids at 32 days generated with the unguided protocol stained for choroid plexus (TTR, positive cells indicated by white arrows), cortical (FOXG1) and CA1- hippocampal (OCT6, positive cells indicated by white arrows) markers. Scale bars: 50μm.\nNote: Check the integrity of the brain organoids’ slices at the microscope. Perform immunofluorescence staining only on well-preserved slices.\nCritical: be careful throughout all the steps, brain organoids’ slices may detach from the slide. To prevent this, we recommend to gently apply drop by drop each solution near the slices avoiding the direct contact with the organoid’s slice.\nThaw the cryosectioned slices at 20°C–22°C.\nAdd 200 μL of PBS 1× per slice to hydrate it.\nRemove PBS 1× by gently drain the solution.\nIncubate brain organoids’ slices at 20°C–22°C for 1 h with 200 μL of blocking solution per slice.\nNote: create a humidified chamber to prevent the evaporation of solutions.\nCritical: use 0.25% Triton-X for cytosolic markers and 0.5% Triton-X for nuclear markers.\nDrain the blocking solution and incubate with appropriate concentration of primary antibodies in 200 μL of blocking solution per slice for 2 h at 20°C–22°C.\nNote: the primary antibodies validated on mouse brain organoids and used to characterize the organoids during development are reported in the key resources table[href=https://www.wicell.org#key-resources-table] and in Table 1[href=https://www.wicell.org#tbl1]. Please refer to Ciarpella et al.1[href=https://www.wicell.org#bib1] for further details. Any other antibodies against protein of interest could be used. Refer to related datasheet to check the applicability.\nDrain the primary antibodies solution and wash 6 times 5 min with 200 μL of blocking solution",
    "Drain the last blocking solution used for washing and incubate with secondary antibodies in 200 μL of blocking solution per slice for 1.5 h at 20°C–22°C in dark.\nNote: the secondary antibodies validated on mouse brain organoids are reported in the key resources table[href=https://www.wicell.org#key-resources-table]. Please refer to Ciarpella et al.1[href=https://www.wicell.org#bib1] for further details. Any other secondary antibodies could be used. Refer to related datasheet to check the applicability.\nDrain the secondary antibodies solution and wash 3 times 5 min with 200 μL of blocking solution.\nDrain the last blocking solution used for washing and wash 3 times 5 min with 200 μL of PBS 1×.\nAt this step, nuclear staining is performed:\ndrain the PBS 1× and incubate each slice with TOPRO-3 in 200 μL of PBS 1× per slice for 10 min at 20°C–22°C in dark.\nNote: Any other nuclear staining could be performed, also accordingly to the wavelength of the laser’s microscope used.\nDrain the nuclear staining solution and wash once with 200 μL of PBS 1×.\nDrain the PBS 1× and close slides with 2 drops of DABCO and the glass coverslip, avoiding the formation of DABCO bubbles. Seal the glass coverslip on the slide with transparent nail polish.\nAlternatives: ready-to-use commercial Mountant reagent could be used rather than DABCO.\nNote: to ensure the optimal imaging, we usually acquire by confocal microscope the stained slices the following day.\nImmunofluorescence on whole mount brain organoids\nTiming: 48 h\nIn this section we report the protocol to perform immunofluorescence on whole mount brain organoids. Preserving the 3D structure, this protocol allows us to analyze the network formation and gives information about the 3D spatial architecture and morphology of the organoids. To perform whole mount immunofluorescence, brain organoids must be previously fixed in Fixing solution (see steps 41–46).",
    "Put the fixed organoid in a well of a 96-well plate and incubate it with 80 μL of 0.5% blocking solution at 20°C–22°C for 1 h.\nCritical: always use 0.5% Triton-X when performing the whole mount IF.\nCarefully remove the blocking solution avoiding withdrawing the organoid and incubate with appropriate concentration of primary antibodies (see Table 1[href=https://www.wicell.org#tbl1] and key resources table[href=https://www.wicell.org#key-resources-table]) in 80 μL of blocking solution per organoid at 4°C 12 h, on an orbital shaker (60 rpm).\nRemove the primary antibodies solution:\nwash 6 times 5 min with 80 μL of blocking solution.\nRemove the last blocking solution used for washing and incubate with secondary antibodies in 80 μL of blocking solution per organoid for 6 h, at 20°C–22°C, static, in dark.\nRemove the secondary antibodies solution:\nwash 3 times 5 min with 80 μL of blocking solution.\nReplace the last blocking solution used for washing with PBS 1×, wash 3 times 5 min.\nPerform the nuclear staining:\nremove the PBS 1×.\nincubate each organoid with TOPRO-3 in 80 μL of PBS 1× for 10 min at 20°C–22°C in dark.\nAlternatives: Any other nuclear staining could be performed, also accordingly to the wavelength of the laser’s microscope used.\nRemove the nuclear staining solution and wash once with 80 μL of PBS 1×.\nCreate a parafilm chamber on the slide (see Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig10.jpg\nFigure 10. Immunofluorescence on whole mount brain organoids\n(A) Parafilm chamber for whole mount organoid immunostaining confocal microscope acquisition.\n(B) Representative maximum intensity projections of the z-stack confocal images of the entire mouse brain organoid stained for the mature neuronal marker MAP2 at 32 days. Scale bar: 200μm.",
    "(C) Representative maximum intensity projections of the z-stack confocal images of a region of the entire mouse brain organoid stained for the mature neuronal marker MAP2, the astrocytes marker GFAP and the neuronal progenitors’ cells marker DCX. Scale bar: 50μm.\nCritical: this step is important to preserve the 3D morphology of the brain organoids. The parafilm chamber should be as thick as the sample to prevent its mashing and to avoid any extra space between the organoid and coverslip.\nPlace the organoid inside the chamber and close it with 1 drop of DABCO using a round coverslip.\nCritical: Do not break the organoid while moving it. Make sure the organoid does not move into the corners of the chamber while closing with DABCO. Avoid the formation of DABCO bubbles.\nAlternatives: ready-to-use commercial Mountant reagent could be used rather than DABCO.\nSeal the glass coverslip above the chamber by applying transparent nail polish at the edge.\nNote: Images acquisition should be performed as soon as possible, since organoids will either move inside the chamber or become auto-fluorescent as time passes by.\nFunctional assessment of brain organoids’ by using Fluo-4 calcium assay\nTiming: 5 h\nFunctional assessment of the brain organoids’ spontaneous activity provides information about the maturation of the forming organoids.27[href=https://www.wicell.org#bib27],28[href=https://www.wicell.org#bib28] Fluo-4 assay on whole mount organoids allows detecting cellular activity preserving the organoids’ structure, rather than dissociating or slicing them as performed in several published protocols.29[href=https://www.wicell.org#bib29],30[href=https://www.wicell.org#bib30],31[href=https://www.wicell.org#bib31],32[href=https://www.wicell.org#bib32] This is a rapid assay that could be easily used to discriminate the effect of specific drugs on the cellular maturation and functionality.\nNote: Fluo-4 is not exclusive for neuronal activity, but also for glial one. To exclusively examinate the neuronal activity, GcAMP6 lentiviral construct under the synaptophysin promoter can be used.33[href=https://www.wicell.org#bib33]",
    "Wash the brain organoids with HEPES 0.3 M pH 7.3 for 10 min.\nIncubate organoids for 3 h at 37°C with a solution of 50% Fluo4 + 50% PSS (100 μL for each organoid).\nCritical: work in sterile conditions, protected from light.\nWash organoids three times with culture medium.\nIncubate organoids for 30 min at 37°C with appropriate culture medium.\nNote: this step ensures that all the AM-group of the Fluo4 are de-esterification so that the fluorescence signal is constant during acquisition.\nPerform time-lapse analysis using the Nikon microscope, at 37°C and 5% CO2. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nAlternatives: other fluorescence, confocal, two-photon microscopes equipped with laser and/or lamp with the desired wavelength can be used to visualize the Fluo4. A microscope equipped with a temperature and gas controller is highly recommended. Keeping the temperature and CO2 constant during acquisition help to avoid Ca2+ fluctuation artefacts.\nAnalyze the generated videos, for a qualitative indication of the Ca2+ flux, using ImageJ software:\nOpen ImageJ software, then load the time-lapse images sequence: File > open.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2861-Fig11.jpg\nFigure 11. Step-by-step of qualitative calcium imaging analysis using ImageJ software\nNote: an \"Import image sequence” tab will be open. Be sure to select the “use virtual stack” option. ImageJ also supports file .avi. An “AVI reader” tab will be open and “use virtual stack” should be clicked. We recommend working in greyscale. (Figure 11[href=https://www.wicell.org#fig11]A)\nDraw a sufficient number of ROI for each organoid, related to a single cell or small group of cells: Oval/Rectangular selection > Analyze > Tools > ROI manager > add (Figures 11[href=https://www.wicell.org#fig11]B–11D).\nNote: draw a ROI in a background zone for further quantitative analysis.\nSelect one ROI by one from the ROI manager: Image > Stacks > Plot Z-axis Profile (Figure 11[href=https://www.wicell.org#fig11]E).",
    "A graph showing the Ca2+ fluctuations is now open (Figure 11[href=https://www.wicell.org#fig11]F) and, if needed, it could be saved.\nSave the values related to the graph for further analysis: Data > Save data > (.xls/.csv).\nNote: it is also possible to save the list of values, to be processed with any other analysis software: List > Plot Values (Figures 11[href=https://www.wicell.org#fig11]F and 11G).\nAlternatives: different software or custom-made calcium analyzer could be used to quantify Ca2+ flux and cellular activity. We report here a fast analysis to qualitatively analyze the Fluo4 assay output.\nDNA extraction from brain organoids\nTiming: 4 h\nFully mature neurons display high energy consumption to sustain their active metabolism and thus, neuronal differentiation implies a switch from glycolytic to oxidative metabolism.34[href=https://www.wicell.org#bib34],35[href=https://www.wicell.org#bib35],36[href=https://www.wicell.org#bib36],37[href=https://www.wicell.org#bib37],38[href=https://www.wicell.org#bib38],39[href=https://www.wicell.org#bib39] Characterizing the metabolic profile of organoids allows us to acquire information about brain organoids’ development: early organoids rely mainly on glycolysis, while late organoids activate oxidative phosphorylation hence, lower mtDNA copy number and mitochondrial subunits amount are expected in early differentiated compared to fully mature organoids. The DNA extracted with this optimized protocol can be used to evaluate the mtDNA copy number, a good indicator of the amount of mitochondrial mass, by following the method reported in.40[href=https://www.wicell.org#bib40]\nPut single organoids in a 1.5 mL Eppendorf, at any time point considered.\nWash organoids with sterile PBS 1×.\nSpin quickly.\nNote: step 87 can be skipped for early organoids.\nCarefully remove the supernatant.\nCritical: organoids must be dry after this step.\nPause point: organoids can be eventually stored at −20°C or directly used (step 90).\nOn the day of the extraction thaw your samples and keep them on ice.\nAdd 250 μL of lysis buffer plus 2.5 μL of Proteinase K (10 mg/mL) inside the Eppendorf with the organoid and lysate the sample, avoiding bubbles.",
    "Incubate at 55°C in a thermoblock for 2–2.5 h and vortex occasionally.\nAt the end of the incubation time, vortex the Eppendorf and centrifuge for 10 min at maximum speed, 20°C–22°C.\nThe pellet contains cellular debris. Take the supernatant and put it in a new Eppendorf.\nAdd 250 μL (1 volume) of isopropyl alcohol and 1 μL of glycogen (it helps visualizing the DNA).\nCritical: glycogen concentration cannot be over 4 μg/μL, otherwise it may inhibit PCR reaction.\nNote: if DNA clump is not visible, put the Eppendorf at −80°C for about 30 min, it helps the glycogen precipitate the DNA.\nCentrifuge at 17.530 g for 30 min at 20°C–22°C.\nWash the DNA pellet with 50 μL of EtOH 70%.\nAir-dry the pellet.\nDissolve the pellet into 30 or 50 μL for late or early organoids, respectively of TE buffer pH 7.5.\nQuantify the DNA concentration using the Nanodrop.\nPause point: DNA may be stored at −20°C until use or directly used (step 100).\nReal-time PCR for mitochondrial DNA\nTiming: 4 h\nEvaluation of the mtDNA copy number can be a good indicator of the amount of mitochondrial mass. We report here the steps to perform the PCR reaction for the analysis of mtDNA/nDNA ratio in mouse cells using a SYBR green assay. It will allow to estimate the mtDNA copy number, by comparing the amount of mitochondrial versus nuclear DNA.40[href=https://www.wicell.org#bib40]\nNote: In a single 96 well plate, two different amplification reactions will be run: one for the genomic DNA, and one for the mitochondrial DNA; so ideally the plate will be divided in two sections. Each sample will run in three technical replicates for each amplification reaction. In the following steps, solutions amount is calculated for one sample in three technical replicates.",
    "Dilute the DNA samples at a concentration of 5 ng/μL.\nPrepare two separate PCR working solution (48 μL total volume each; see “materials and equipment[href=https://www.wicell.org#materials-and-equipment]” section for PCR working solution receipt):\nGenomic PCR working solution containing forward and reverse primers for the nuclear gene HK2 (hexokinase 2).\nMitochondrial PCR working solution containing forward and reverse primers for the mitochondrial-encoded gene ND1.\nAdd 12 μL of DNA sample to each PCR working solution (genomic and mitochondrial).\nLoad the plate with 20 μL/well of the solutions obtained in step 102.\nSeal the plate with the appropriate coverslip.\nSet the software and run the PCR with the following settings for 45 cycles:\n      Hold Stage: 50°C for 2 min followed by 95°C for 5 min.\n      PCR Stage: 95°C for 5 s followed by 60°C for 1 min.\n      Melt curve Stage: 95°C for 5 s, 66°C for 1 min, 97°C for 1 s.\nNote: we use the Real Time QS3 system (Thermofisher) equipped with QuantStudio™ Design & Analysis Software v1.5.1.\nCalculate the number of copies of mtDNA with the following formulas40[href=https://www.wicell.org#bib40] :\nΔ\nC\nT\n=\nC\nt\n(\nn\nD\nN\nA\ng\ne\nn\ne\n)\n−\nC\nt\n(\nm\nt\nD\nN\nA\ng\ne\nn\ne\n)\nC\no\np\ni\ne\ns\no\nf\nm\nt\nD\nN\nA\n=\n2\nx\n2\nΔ\nC\nt\nProtein isolation and analysis of brain organoids\nTiming: 2 h",
    "These steps allow the extraction of the protein content of the brain organoids. Organoids change in the morphology, dimension and cellular density during the in vitro culturing protocol. We optimized the number of organoids to be pooled together at each time point and the volume of solutions in order to have a reasonable yield of material. This resulted in pools of different number of organoids depending on the stage of maturation.\nCollect pools of 3 organoids (for early organoids: day 7 and day 14) or 5 organoids (late organoids: day 21 and day 32) in 500 μL Eppendorf.\nWash organoids with sterile PBS 1×.\nSpin quickly.\nNote: for early organoids you can avoid this step.\nRemove the supernatant.\nCritical: organoids must be dry after this step.\nPause point: organoids may be stored at −80°C until use or directly used (step 111).\nResuspend the pools of organoids in 25 or 13 μL of Complete RIPA buffer for early and late organoid respectively, dissociate by pipetting until the organoids are not visible.\nNote: early organoids are quite easy to dissociate, since they are not very compact; the late ones may require a bit more effort to completely dissociate.\nVortex and keep on ice for 30 min. Vortex every 10 min.\nAdd 1 μL of Benzonase per sample and incubate at 20°C–22°C for 30 min.\nCentrifuge at 10000 g for 15 min at 4°C.\nTransfer the supernatant, that contains the extracted proteins, to a new Eppendorf.\nQuantify extracted proteins with BCA assay kit following manufacture instructions (https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0011430_Pierce_BCA_Protein_Asy_UG.pdf[href=https://assets.thermofisher.com/TFS-Assets/LSG/manuals/MAN0011430_Pierce_BCA_Protein_Asy_UG.pdf]). Troubleshooting 5[href=https://www.wicell.org#sec6.9].",
    "Neuronal differentiation requires a switch from glycolytic to oxidative metabolism35[href=https://www.wicell.org#bib35] and an increase of OXPHOS subunits and mitochondrial proteins is expected during organoid maturation. Extracted proteins are used to perform Western Blot analysis to detect and quantify the mitochondrial proteins and OXPHOS system quantity. The voltage-dependent anion-selective channel 1 (VDAC 1) protein, a mitochondrial channel of the outer mitochondrial membrane, is used as an indicator of mitochondrial mass while the amount of mitochondrial respiratory chain complexes I-V is given by the OXPHOS cocktail antibody. We usually express the mitochondrial markers as fold-change of the nuclear marker Lamin B, rather than to the total protein content per lane. Indeed, given the heterogeneity of cell composition of brain organoids across the developmental stages, equal amounts of protein/organoid pool at different maturation phases may not reflect the cell number. Specific antibodies can be used for any other proteins of interest."
  ],
  "subjectAreas": [
    "Organoids",
    "Stem Cells",
    "Cell Biology",
    "Neuroscience",
    "Cell Differentiation",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}