{
  "id": 13262,
  "origin_website": "Jove",
  "title": "Isolation and Differentiation of Primary Myoblasts from Mouse Skeletal Muscle Explants",
  "procedures": [
    "This protocol follows the animal care guidelines of Scripps Research.\n1. Collection and Processing of Muscle Tissue Explants\nThe day prior to dissection, sterilize all dissection equipment (forceps, razor blades, and scissors) and prepare all required media: phosphate buffered saline (PBS), MB Plating media (12.5 mL of DMEM, 12.5 mL of HAMS F12, 20 mL of heat-inactivated fetal bovine serum (FBS), 5 mL of amniotic fluid medium supplement), and Coating Solution (24 mL of DMEM, 24 mL of HAMS F12, 1.7 mL of collagen, 1 mL of matrigel).\nThe day of dissection, coat one 6-cm dish with Coating Solution for each muscle to be dissected. Add 2 mL of Coating Solution to the surface of each plate, shake gently to create an even coat on the surface, and incubate the plates with solution at 4 °C for 1 h.\nRemove Coating Solution from the plates and return to the stock solution.\nNOTE: Coating Solution can be reused for up to six months and should be stored at 4 °C.\nRinse the plates twice with 2 mL of PBS to remove unbound collagen and matrigel.\nPlace the plates in a 37 °C tissue culture incubator during dissections.\nPrepare a moist chamber by placing 2-3 sheets of thick absorbent paper into a plastic bag or a sterile 15 cm dish and use a pipette to wet the surface of the paper with sterile water.\nPlace the chamber under UV light for 5 min to sterilize.\nDissect desired muscles from a 4 to 8-week old mouse. To sterilize muscle tissue, rinse gently in PBS containing 40 μg/mL gentamicin.\nNOTE: For quadriceps and gastrocnemius muscles, plate one muscle per plate. For soleus, plantaris and EDL, combine muscles from both legs in one plate.",
    "Use sterile forceps to transfer the muscle to a sterile 10 cm non-coated Petri dish. Add 0.5-1.0 mL of Plating media over the muscle such that the tissue is moist but not floating (Figure 1A).\nUse a sterile scalpel or razor blade to gently slice the muscle into small fragments (approximately 1-3 mm3).\nNOTE: It is important to minimize handling the muscle tissue for best results.\nUse forceps or a pipette to transfer the muscle fragments onto the surface of a pre-coated 6-cm plate. Very gently overlay an additional 0.8 mL of Plating Media over the tissue. There should be enough media to keep the tissue pieces hydrated but not floating (Figure 1B).\nPlace the 6-cm dishes containing the muscle fragments inside the moist chamber and return to an incubator (37 °C, 5% CO2) for 48 h (Figure 1C).\nNOTE: It is vital that muscle fragments adhere to the surface of the plate to allow for myoblast outgrowth. Do not move the plates/chamber for at least 48 h.\nAfter 48 h, carefully check the plates to ensure that muscle fragments have adhered. Overlay with 2 mL of Plating Media, taking care not to dislodge the fragments.\nNOTE: If there is visible contamination or debris on the plates, carefully wash the muscle pieces. Plate 2 mL of PBS/gentamicin solution at the edge of the plate and tip gently to wash over the muscle tissue. Remove the PBS and repeat the wash step. Following the second wash, overlay 2 mL of Plating Media.\nKeep the plates in the 37 °C incubator for up to an additional 3 days (5 days from original dissection) before harvesting myoblasts. Check every other day for outgrowth of myoblasts.",
    "NOTE: The appearance of cells emerging from muscle explants will be variable and heterogeneous. Primary myoblasts appear as small, round, and bright cells. However, it is neither necessary nor reliable to identify them by their appearance at this stage (Figure 2).\n2. Harvesting Outgrowing Myoblasts\nPrepare and pre-warm Myoblast Media (17.5 mL of DMEM, 17.5 mL of HAMS F12, 10 mL of FBS, 5 mL of amniotic fluid medium supplement), trypsin, and PBS/gentamicin. Coat one T25 flask per muscle group being harvested with Coating Solution and as described in step 1.2 (see Table 1).\nRemove Plating Media and gently rinse the muscle explants with 2 mL of PBS/gentamicin. Quickly remove PBS (rinse one plate at a time and do not let the plate sit in PBS at this step).\nGently add 1 mL of PBS/gentamicin and place the plate in the 37 °C incubator for 1 min.\nUse a P1000 pipette to collect PBS/cells in a 15 mL centrifuge tube.\nAdd 1 mL of trypsin to the plate and return to the 37 °C incubator for 3 min. Gently tap the plates to dislodge myoblasts. Collect the trypsin/cells and combine with the PBS collection. Add 8 mL of Myoblast Media to the centrifuge tube and gently invert to mix.\nGently overlay 2 mL of Plating Solution on the muscle plates and return to the 37 °C incubator.\nSpin the centrifuge tubes containing cells in a centrifuge for 3 min at 200 x g.\nAspirate the supernatant to ~1 mL, being careful to avoid cell pellet. Gently add Myoblast Media (see Table 1) and transfer the cells to the pre-coated flask and place in the 37 °C incubator. This is the P0 harvest. If observed under a microscope, there may be very few cells (Figure 3).",
    "Repeat the harvest described above every other day up to three times. After the third harvest, discard the explants.\n3. Expansion and Enrichment of Proliferating Myoblasts\nNOTE: The P0 harvest will be heterogeneous (~60% myoblasts). The next 2 passages use PBS to selectively harvest myoblasts. Many of the more adherent cells will be left behind and the rapidly proliferating myoblasts will be ≥95% pure within 2 passages. Once myoblasts are established, they should be maintained at a low density to avoid spontaneous differentiation.\nFor each T25 flask of ~40-50% confluent cells from section 2, coat one T75 flask with 5 mL of Coating Solution and place at 4 °C for 1-4 h.\nRemove Coating Solution from the flasks and return to stock solution. Rinse the flasks twice with 2 mL of PBS/gentamicin and place in the 37 °C incubator.\nAspirate the media from P0 myoblast T25 flasks. Rinse the cells briefly with 2 mL of warm PBS/gentamicin. Aspirate PBS from the flask.\nNOTE: The purpose of this step (3.3) is to reduce the possibility of bacterial contamination. If performed quickly and gently, it should not result in loss of myoblasts. It can be omitted to maximize myoblast preservation if desired.\nPipette 2 mL of warm PBS (not trypsin) into each flask containing myoblasts. Place the flasks with PBS into the 37 °C incubator for 3 min.\nNOTE: Myoblasts should easily detach from flasks with PBS. Using PBS rather than trypsin at this step is critical for reducing contamination of the myoblast population with other cell types.\nRemove the cells from the 37 °C incubator and firmly tap side of the flasks to dislodge the cells. Check under a light microscope for freely floating myoblasts.",
    "Place the flasks upright in a tissue culture hood and rinse the bottom of the flasks with 10 mL of Myoblast Media 2-3 times to ensure all cells are dislodged.\nCollect the cell/media mixture in a 15 mL centrifuge tube. Centrifuge for 3 min at 200 x g.\nAspirate the media to around 1 mL, being careful to avoid the cell pellet. Gently add an appropriate volume of Myoblast Media to centrifuge tube and gently mix.\nDistribute the cell mixture to new T75 flasks. Add 10 mL of Myoblast Media to each new T75 flask. Gently shake the flasks horizontally to distribute the cells and place in the 37 °C incubator overnight.\nTwo days later, passage once more with PBS, splitting each T75 flask into three T75 flasks.\nNOTE: Do not allow myoblasts to become more than 50%-60% confluent, as this would cause them to start differentiating and lose prolifaterive capacity.\nFor additional passages, use trypsin. Passaging twice with PBS yields >95% myoblasts; attempts to further improve the purity tends to result in poorer differentiation.\n4. Differentiation of Primary Myoblasts to Myotubes\nPlate P2 (or later passage) myoblasts in Myoblast Media on coated plates (see Table 1 for suggested coating and plating volumes and cell numbers). Two or three days later, when cells are at 70-80% confluency, change the media to Differentiation Media (24 mL of DMEM, 24 mL of HAMS F12, 1.5 mL of heat inactivated horse serum, 0.5 mL of Insulin-Selenium-Transferrin).\nChange Differentiation Media every other day during differentiation of primary myoblasts into myotubes. Differentiation is typically complete by Day 4-5 and will be marked by elongated, fused cells that spontaneously twitch. Perform experiments on differentiated myotubes within 6 days. Typically cells are assayed five or six days after initiating differentiation.",
    "5. Measuring Oxygen Consumption Rate in Myoblasts or Myotubes in 96-well Plates\nCoat 96-well plates with 25 μL of coating solution per well. Centrifuge the plates at 58 x g for 1 min to remove any bubbles.\nIncubate the plates in coating solution for 1-4 h at 4 °C. Use multi-channel pipette to remove the coating solution and wash three times in 25 μL of cold PBS/gentamicin. Centrifuge at least one of these washes to ensure that no bubbles are trapped.\nAdd 40 μL of Differentiation Media to each well. Centrifuge the media on the coated plate with no cells for 1 min at 58 x g to avoid bubbles and remove surface tension to get a uniform layer of media.\nAdd cells suspended in an additional 40 μL of media to each well. Spin again at 58 x g.\nNOTE: Consistency in plating is important for best results and the number of cells plated per well should be optimized for each experimental setup, and will likely be in the range of ~10,000-25,000 myoblasts plated in differentiation media per well of a 96-well plate.\nGently change the media daily during differentiation. Do not aspirate the media but rather remove it with a pipette, leaving a small volume behind to avoid dislodging the cells or exposing them to the air. For example, replace 50 μL at a time for three repeats rather than all 80 μL at once.\nUse 8-15 wells per condition. It may be necessary to omit some wells if cells do not form a uniform layer of myotubes.\nNOTE: Omit wells on the edges of the plate because they are highly susceptible to evaporation. Vary the plate setup for experimental replicates to avoid systematic errors.",
    "Perform desired assay on differentiated myotubes within 1-2 days of full differentiation (Day 4-6 from start of differentiation). Recommended instruments and reagents for measurement of oxygen consumption rates are listed in the Table of Materials.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}