{
  "id": 19304,
  "origin_website": "Jove",
  "title": "Transthoracic Echocardiography in Mice",
  "procedures": [
    "1. Preparing Mice for Imaging Studies\nPrior to the imaging studies, anesthetize the mouse (2% isoflurane mixed with 0.5 L/min 100% O2)in the induction chamber. Be sure to filter waste gas for the safety of the operator. Remove the animal from the induction chamber and use hair clippers to shave the fur from the neckline to mid chest level. Then remove the remaining body hair with hair removal cream. This preparation may be performed a day prior to imaging studies to minimize potential undesired stress responses in the mice.\nApply duralube gel to both eyes to prevent drying of the sclera (avoid contacting the cornea with the gel applicator). Place the anesthetized mouse in a supine position atop a heating pad with embedded ECG leads in order to maintain body temperature.\nPlace the snout within a nose cone connected to the anesthesia system to maintain a steady-state sedation level throughout the procedure (1.0% to 1.5% isoflurane mixed with 0.5 L/min 100% O2). Perform a toe or tail pinch to confirm sedation. If necessary, the level of anesthesia can be adjusted to obtain a target heart rate of 450 ± 50 beats per minute (bpm). \nGently insert a rectal probe (after lubricating) to continuously monitor and adjust body temperature via the heating pad.  It is important to maintain the body temperature within a narrow range (37.0 °C ± 0.5 °C), as even moderate changes in temperature and heart rate affect cardiac function in mice. \nApply electrode gel to the four paws and tape them to the ECG electrodes. \n2. Evaluating Systolic Function of the Heart",
    "To begin this procedure, apply a layer of preheated ultrasound gel to the chest, primarily the area overlying the heart. Gel should be warmed to approximate body temperature. A volume of  cold  gel may rapidly add to the rate of body temperature loss. Avoid air bubbles in the gel, which can interfere with ultrasonic imaging.\nImmobilize the mouse in a slight upward position (head up) under a slight angle. Using a micromanipulator, immobilize the ultrasound probe with a 90° angle between the probe and the heart. \nTo begin making short-axis echocardiographic measurements, lower the probe onto the thorax parasternally. Avoid placing the probe directly over the sternum or onto the skin, as this will distort the signal.\nFirst, we will perform two-dimensional (2D) imaging ('B-mode') to obtain a view along the parasternal short axis. Adjust the viewing area of the probe to obtain a complete image depending on the size of the animal's heart. \nA proper image in this orientation will include the left ventricle and a slight portion of the right ventricular wall. The arrow (shown in video) indicates the anterolateral and posteromedial papillary muscles, the posterior and anterior walls of the LV, the intraventricular septal wall, and a slight portion of the right ventricular wall. During these measurements, pay special attention to potential wall motion abnormalities (e.g., hypokinesia, akinasia, asynchrony) or aneurysms. \nNext, we will use M-mode echocardiography, which provides a 1-dimensional (1D) view, to obtain fine measurements of cardiac dimensions and contractility. Store acquired images for later evaluation of parameters of systolic left ventricular function. \n3. Evaluating Diastolic Function of the Heart",
    "While still viewing the parasternal short axis, we can perform tissue Doppler imaging (TDI) to measure velocity of myocardial motion. The region of interest is marked to include a posterior left ventricular wall for radial axis evaluation. The waveform obtained will have four peaks to evaluate diastolic function: IVRT, E', A', and IVCT. S' represents systolic velocity. (Figure 3B) These parameters will be described later in the representative results section. \nPulse-wave Doppler (PWD) can be used to measure blood flow velocity within a small area at a specific depth in the myocardial tissue. To image the trans-mitral flow pattern, tilt the animal backwards in the Trendelenburg position. Tilt the probe upward, such that the probe is orthogonal with the apex of the heart. \nNow increase the isoflurane level to lower the heart rate to 300-350 bpm, which will slow the movement of the mitral valve. For comparison studies, it is important to maintain similar heart rates between animals. \nVisualize the movements of the mitral valve as a reference point to measure the flow across the valve. Place the sample volume at the tip of the mitral valve. \nMeasure the flow patterns across the mitral valve using PWD. Two waves are characteristically seen, one representing passive filling of the ventricle (early [E] wave), and one consistent with active filling with atrial systole (atrial [A] wave). In a healthy heart, the E-wave velocity is slightly greater than that of the A wave (Figure 3C). \nOnce all measurements are completed, remove the electrode gel (by gently wiping with standard gauze pads) and restraints from the animal. Allow the unrestrained animal to recover atop the heated ECG pad in an upright position and turn off the anesthesia. When the mouse awakens, return it to its cage. \n4. Representative Transthoracic Echocardiography Results",
    "Noninvasive echocardiographic studies can be used to assess left ventricular morphology and function in murine models of cardiac disease.4,5 This technique is widely used and provides an alternative to terminal procedures to assess LV function, such as intracardiac pressure-volume loop measurements.8 or the ex vivo working heart model.9 Assessment of LV chamber dimensions by transthoracic M-mode echocardiography allows for detection of abnormal LV chamber enlargement or increased wall thickness in various models of heart disease.5 Thus, transthoracic echocardiography, combined with pulse wave Doppler, constitutes a comprehensive avenue for the non-invasive evaluation of systolic and diastolic cardiac function in mice.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1738/1738fig1.jpgFigure 1. Overview of Vevo 770 High Resolution In Vivo Micro-Imaging System for Echocardiography and Doppler Imaging. (A) We use the VisualSonics integrated rail system with physiological monitoring unit, EKG board, and RMV 30mHz scan head. (B) The mouse is positioned and properly restraint on the heating board with integrated ECG electrodes (gold color). The four limbs are taped into the ECG electrodes. (C-D) Photographs showing proper angles for pulse-wave Doppler used to obtain diastolic function measurements, as described in section 4 of the protocol. Probe orientation for systolic function measurements are show in the video protocol.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1738/1738fig2.jpgFigure 2. Representative 2D Echocardiography Images (B-mode). (A) Para-sternal short-axis view showing the left ventricular anterior (AW) and posterior (PW) walls, the intraventricular septal wall (SW), and lateral wall (LW). The diameter of the left ventricular lumen can be measured as the left ventricular internal diameter (LVID). The asterisk indicates the posteromedial papillary muscle. (B) Apical four-chamber view with a viewing area over the mitral valve for determination of E/A peak velocities. MVAL, mitral valve anterior leaflet; MVPL, mitral valve posterior leaflet; RV, right ventricle; LV, left ventricle.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1738/1738fig3.jpgFigure 3. Acquisition and Quantification of Echocardiography and Doppler Data. This figure contains representative images of acquired data corresponding to the 2D echocardiography images presented in Figure 2. (A) M-mode tracing with lines indicating end-systolic (ESD) and end-diastolic diameters (EDD). LVAWD/S, left ventricular anterior wall thickness (diastole/ systole); LVPWD/S, left ventricular posterior wall thickness (diastole/ systole). (B) Representative tracings for tissue Doppler imaging of the LV posterior wall. IVRT, isovolumic relaxation time; IVCT, isovolumic contraction time. The E' wave corresponds to the motion of the mitral annulus during early diastolic filling of the LV, and the A' wave originates from atrial systole during late filling of the LV. S' represent systolic velocity. (C) Pulse wave Doppler recording of mitral valve leaflet tips provides mitral inflow velocity patterns from which early diastolic velocity (E), late diastolic velocity with diastolic contraction (A), and the E/A ratio can be derived. The IVRT is also a useful variable to characterize diastolic function and filling pressures. ET indicates ejection time."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}