{
  "id": 13408,
  "origin_website": "Jove",
  "title": "CARIP-Seq and ChIP-Seq: Methods to Identify Chromatin-Associated RNAs and Protein-DNA Interactions in Embryonic Stem Cells",
  "procedures": [
    "1. Culture of Mouse ES Cells in Feeder-Free Conditions.\nNOTE: Mouse ES cells are conventionally cultured in media on a cell culture dish coated with gelatin and a mono-layer of mouse embryonic fibroblasts (MEF), which have been mitotically inactivated (iMEFs). However, MEFs should be removed prior to downstream epigenetic or expression analyses to prevent the contamination of MEF-associated chromatin and RNA.\nPreparation of a feeder layer: Gelatin coat a 6-well cell culture plate by adding 2 mL of 0.1% gelatin in water, and incubate the plate at 37 °C for 20-30 min.\nPrepare 10% DMEM high-glucose media containing 2 mM L-glutamine, 10% fetal bovine serum (FBS), and 1x penicillin/streptomycin.\nIsolate MEFs from E13.5 to E14.5 mice18,19 or acquire from a commercial vendor. Mitotically inactivate MEFs by treating with mitomycin C or gamma irradiation using standard protocols19. Alternatively, mitotically inactivated MEFs (iMEFs) can be acquired from a commercial vendor.\nCulturing MEFs. Pre-warm MEF media at 37 °C, thaw frozen vial of iMEFs and culture in 10% FBS MEF media at 37 °C with 5% CO2. Plate MEFs at ~200,000 cells per well of a 6-well culture dish.\nCulturing ES cells on a layer of feeder cells (iMEFs).\n\t\n12-24 h after plating iMEFs, pre-warm a 50 mL tube of ES cell media (DMEM high-glucose, LIF (10 ng/mL), 15% ES cell-qualified FBS, 1× cell-culture qualified 2-mercaptoethanol, 1× glutamine, nonessential amino acids (NEAA), 1× penicillin/streptomycin), at 37 °C with 5 % CO2.",
    "Aspirate the media from the cell culture plates containing iMEFs, re-suspend the ES cells in 2 mL of media (after thawing at 37 °C), and plate the cells on the layer of iMEFs. When placing the culture dish in the incubator, it is important to move the dish in a \"t\" shape to evenly distribute the cells and to prevent aggregation towards the center of the dish.\nPassage the ES cells onto feeder-free gelatin-coated dishes. Passage the ES cells before they become confluent. ES cell colonies maintain self-renewal best if the colonies are evenly spaced and not confluent. The presence of many ES cell colonies that are touching indicates that the cell density is too high.\n\t\nCoat a 6-well culture dish with gelatin as described above. Incubate 0.25% trypsin-EDTA at 37 °C for ~10-15 min to pre-warm trypsin.\nNext, passage the ES cells by first washing with 1x phosphate buffered saline (PBS) and adding 1 mL of 0.25% trypsin-EDTA solution. Wait 1-2 min for the colonies to detach. Dissociate the colonies to a single-cell suspension by pipetting with a 1 mL tip for ~5 times.\nUse a microscope to confirm single cell dissociation of the ES cells. To quench the reaction, or to \"neutralize\" the trypsin, add 10% FBS MEF media. Centrifuge the cells at 300 x g at room temperature for 3-5 min, and aspirate the media.\nRe-suspend the cellular pellet in 2 mL of media (ES cell) supplemented with glycogen synthase kinase-3 (GSK3) inhibitor (CHIR99021; GSK3i), or 2i (MEKi/GSK3i) conditions (2-3 µM GSK3i: CHIR99021, 1 µM MEKi: PD0325901).",
    "Aspirate the gelatin from the cell culture dish, and add 2 mL of media containing ESCs to the dish, and place the dish in the 37 °C incubator (Figure 1A-D). Dual inhibition of GSK3i and MEKi promotes ground state naïve pluripotency of ES cells in the absence of feeder cells (iMEFs) and without serum20. ES cells should be passaged two to three times to remove MEFs before proceeding to crosslinking.\n2. Crosslinking of ES Cells for ChIP and CARIP\nHarvest the ES cells by washing them with PBS, then add 0.25% trypsin pre-warmed at 37 °C. Incubate the cells for several minutes at room temperature. Avoid over trypsinization of ES cells, which will lead to cell death. Use a microscope to evaluate single cell dissociation.\nQuench trypsin digestion as described above for passaging ES cells, and centrifuge the cells at 300 x g at room temperature for 3-5 min.\nRe-suspend the cells in pre-warmed (37 °C) MEF media (10% FBS/DMEM) at 2 × 106 cells/mL.\nTo crosslink the cells, add 37% formaldehyde solution to a 1% final concentration, and incubate the cells in a conical tube (15 mL or 50 mL) at 37 °C for 8 min. Invert the tube several times during the 8 min period to achieve homogenous fixation.\n\tNOTE: The fixation time can be empirically optimized for CARIP. If the fixation time is altered, the number of sonication cycles should also be adjusted. Also, the 37 °C temperature increases crosslinking efficiency compared to crosslinking at room temperature. The temperature of fixation can be empirically optimized.",
    "To stop the fixation reaction, add 1.25 M glycine (pre-chilled at 4 °C) to a concentration of 0.125 M. Invert the tube at 8 rpm using a rotator for 5 min at room temperature. Centrifuge the sample at 300 x g for 5 min at room temperature and aspirate the media.\nWash the cell pellet with pre-chilled PBS (4 °C), centrifuge the sample at 300 x g for 5 min at room temperature, and aspirate PBS. Wash the cells with PBS again. Next, aliquot 15 × 106 cells per 15 mL tube.\nFreeze the cell pellet by placing it in liquid nitrogen for 1 min, on dry ice for 5 min, or place immediately at -80 °C.\n\tNOTE: Fixed ES cell pellets can be stored for up to 6 months without decreased quality in downstream experiments.\n3. Chromatin sonication for ChIP and CARIP\nThaw fixed ES cell pellet on ice. Re-suspend the cell pellet in sonication buffer (2.5 mL). For transcription factors or epigenetic regulators (protein factors), re-suspend the pellet in 1x TE, 1mM PMSF, 1x proteinase inhibitor cocktail. For histone modifications, re-suspend the pellet in 1x TE, 0.1% SDS, 1mM PMSF, 1x proteinase inhibitor.\n\tNOTE: While the addition of SDS enhances sonication efficiency, it may not be beneficial for evaluating certain chromatin constituents or transcription factors.\nFor chromatin immunoprecipitation (ChIP), sonicate chromatin with 14-18 cycles (30 s on, 30 s rest) at 40% amplitude. For chromatin-associated RNA immunoprecipitation (CARIP), reduce the number of sonication cycles (8-10 cycles). Due to cellular, fixation, and sonifier variability, conditions for sonication should be empirically determined.\nSupplement the sonication buffer with 28 µL of 10% SDS for protein-factors, 28 µL of sodium-deoxycholate, and 0.28 mL of 10% Triton-X100, and mix well.\n\tNOTE: Addition of these components to the sonication buffer generates RIPA buffer.",
    "Centrifuge the sample at 10,000 x g for 10 min at 4 °C to pre-clear the chromatin. Move the supernatant to a fresh tube and proceed with chromatin immunoprecipitation.\nAlternatively, sonicated chromatin can be stored at -80 °C until use. However, the storage of sonicated chromatin at -80 °C may lead to diminished quality for protein-factor ChIP.\n4. ChIP and CARIP Process\nAdd 40 µL of protein A or G magnetic beads to a 1.5 mL, low binding tube. Add 600 µL of PBS to wash the beads. Place the tube onto a rack containing a magnet, incubate the tube for 1 min at room temperature , remove PBS, and re-suspend the magnetic beads in 100 µL of PBS.\nAdd 2-4 µg of antibody to the tube with magnetic beads. Incubate and rotate the tube at room temperature for 40 min at 8 rpm using a rotator to facilitate the antibody binding to the magnetic beads. Insert the tube onto the magnetic rack, incubate it for 1 min at room temperature, then remove PBS.\nAdd 200 µL of PBS to wash the magnetic beads. Washing with PBS is performed to remove free IgGs. Incubate and rotate the tube at room temperature for 5 min between wash steps. Attach the tube to the magnet and remove the PBS.\nImmunoprecipitate chromatin-bound proteins by incubating the sonicated chromatin extract (4 × 106 cells per ChIP), with the magnetic beads and rotate the sample at 4 °C (overnight).",
    "Wash the magnetic beads. Incubate the sample at room temperature with the following buffers and rotate the sample for 10 min with each buffer: Twice with 1 mL of RIPA buffer (TE (10 mM Tric-HCl, 1 mM EDTA) pH 8.0, 1% Triton X-100, 0.1% sodium deocycholate, 0.1% SDS), twice with 1 mL of RIPA buffer containing 0.3 M NaCl, twice with 1 mL of LiCl buffer (0.5% sodium deocycholate, 0.5% NP40, 0.25 M LiCl), once with 1 mL of TE buffer with 0.2% Triton X-100, and once with 1 mL of TE.\nDe-crosslinking for ChIP. Re-suspend the magnetic beads in 100 µL of TE. Add 3 µL of 10% SDS and 5 µL of proteinase K (20 mg/mL). Incubate the sample at 65 °C (overnight).\n\tNOTE: It is important to cover the tubes during this step with parafilm or plastic wrap to prevent evaporation.\n\t\nThe following day, invert the tube several times to mix. Next, use the magnet rack to transfer the supernatant to a fresh tube. To wash the magnetic beads, add 100 µL of TE containing 0.5 M NaCl, and subsequently combine the two supernatants.\nDe-crosslinking for CARIP. Re-suspend the magnetic beads in 100 µL of TE. Add 3 µL of 10% SDS and 5 µL of proteinase K (20 mg/mL). Incubate the sample at 65 °C for 4 to 12 h. Incubation time at 65 °C needs to be empirically determined due to variability between cell types, sonication and fixation conditions, etc.\n\t\nInvert the tube 3-5 times to mix, apply the tube to the magnetic rack, and subsequently move the supernatant to a fresh tube.\nTo wash the magnetic beads, add 100 µL of TE containing 0.5 M NaCl, and subsequently combine the two supernatants.",
    "NOTE: It is important to use nuclease-free reagents (e.g., TE buffer, SDS, etc.) to prevent the loss of DNA or RNA during the de-crosslinking step.\nExtract DNA/RNA using 200 µL of phenol:chloroform:isoamyl alcohol (PCI) (25:24:1, v/v).\n\tNOTE: RNA can also be extracted using commercial kits using the manufacturer's instructions. Shake for 30 s, spin at 10,000 x g at room temperature for 10 min, and move supernatant to a fresh tube.\n\t\nTo precipitate DNA/RNA, add 2 µL of GlycoBlue, 20 µL of 3 M sodium acetate, and 600 µL of ethanol. Mix by inverting ~5-8 times, and place the sample on dry ice or at -80 °C for at least 1-2 h.\nCentrifuge the sample at 10,000 x g for 30 min using a refrigerated (4 °C) table-top centrifuge. Air dry the pellet for <1 min and re-suspend it in 40 µL of EB buffer (10 mM Tris-HCl). For ChIP-Seq library preparation, continue to step 6.\nRemove DNA from chromatin-associated RNA IP samples using DNase. Add 10x DNase buffer to 1x concentration in the CARIP sample. Add 1 µL of DNase for up to 10 µg of RNA (50 µL reaction). Incubate the sample at 37 °C for 30 min. Extract the RNA sample with PCI. Resuspend in nuclease-free H2O.\n5. Double-stranded cDNA Synthesis for CARIP-Seq\nSynthesis of first-strand cDNA. For the reverse-transcription reaction, set up the following reaction in a tube designed for a PCR machine: 10.5 µL of RNA and 1 µL random of hexamer primers (3 µg/µL).",
    "Incubate the tube at 65 °C for 5 min to denature the secondary structure, and store it on ice for 2 min. Mix the following components: 4 µL of first-strand buffer, 2 µL of 0.1 M DTT, 1 µL of dNTP, and 0.5 RNase OUT. Next, to the PCR tube, add 7.5 µL of the master mix. Incubate the tube for 2 min at 25 °C. Add 1 µL of Superscript II (200 U/µL) and incubate as follow: 25 °C for 10 min, 42 °C for 50 min, 70 °C for 15 min, and hold at 4 °C.\nSecond-strand cDNA synthesis. Place the tube on ice. Next, add the following components in order: 91 µL of diethyl pyrocarbonate (DEPC) treated water, 30 µL of 5x second-strand reaction buffer, 3 µL of dNTP mix (10 mM), 1 µL of E. Coli DNA ligase (10 U/µL), 4 µL of E. Coli DNA Polymerase (10U/µL), and 1 µL of E. Coli RNase H (2U/µL). Mix by gently vortexing and incubate at 16 °C for 2 h.\n\tNOTE: Mixing by flicking or inverting the tube may not be sufficient to thoroughly mix the reagents.\nAdd 2 µL of T4 DNA Polymerase and incubate at 16 °C for 5 min. Purify cDNA (double-stranded, dscDNA) using PCR purification kit. Elute the dscDNA in 40 µL of EB buffer.\nFragment double-stranded cDNA. Shear cDNA (dscDNA) using a water bath sonifier and a 1.5 mL tube to a size of 250-500 bp. Sonication of dscDNA is critical to reduce fragment sizes to facilitate sequencing of the entire RNA transcript.\nWhen using a standard model of a water-bath sonifier, sonicate the sample for 3× 10 min, or 4× 10 min.",
    "NOTE: Three cycles should be used for up to 1 µg of total RNA, while four cycles are recommended for 1-5 µg of total RNA. Centrifuge the tube briefly after each sonication cycle, and maintain a cool water bath by adding fresh ice.\nWhen using a Pico sonifier, it is recommended to use six cycles for 1-5 µg of total RNA and the following cycling conditions (30 s on, 90 s off). Centrifuge the tube briefly after 2-3 sonication cycles. The efficiency of sonication can be determined by loading a fraction of the sheared dscDNA (3-4 µL) on an agarose gel (2%). It is important to empirically test sonication conditions due to variability between sonifiers.\nPerform library preparation as described in step 6 for next-generation sequencing.\n6. ChIP-Seq and CARIP-Seq Library Construction\nRepair ends of DNA using a DNA end-repair kit. This kit is used to generate blunt-ended DNA. For this reaction, set up the following in a 1.5 mL, low binding tube: 34 µL of DNA, 5 µL of 2.5 mM dNPTs, 5 µL of 10 mM ATP, 5 µL of 10x end-repair buffer (5 mM DTT, 100 mM magnesium acetate, 660 mM potassium acetate, 300 mM Tris-acetate, pH 7.8), and 1 µL of end-Repair Enzyme mix (T4 polynucleotide kinase, T4 DNA polymerase).\nIncubate the sample for 45 min at room temperature.\nPurify DNA using a reaction cleanup kit. Elute end-repaired DNA in 32 µL of pre-warmed (65 °C) EB buffer. While we do not usually quantitate the concentration of DNA following ChIP, or RNA following CARIP, prior to library preparation, it is recommended to start with at least 5-10 ng of ChIP DNA or CARIP RNA.",
    "Addition of a 3' \"A\" overhang to end-repaired DNA. Add the components to a 1.5 mL, low binding tube: 30 µL of DNA from above, 5 µL of 10x NEB buffer 2, 1 µL of dATP from 10 mM stock, 11 µL of H2O, and 3 µL of 5 U/ µL Klenow fragment (3'-5' Exo-), and mix gently by pipetting.\nIncubate the sample for 30 min at 37 °C.\nUse a reaction cleanup kit to purify DNA. Elute DNA in 25 µL of pre-warmed (65 °C) EB buffer.\nLigate adapter. Add the following components on ice: 23 µL of DNA from above, 3 µL of 10x T4 DNA ligase buffer, 1 µL of annealed PE or multiplexing adapter (4 µM), and 3 µL of T4 DNA ligase (400 U/µL), and mix gently by pipetting.\n\tNOTE: Adapter sequences may also be obtained from a commercial source.\nOligonucleotide sequences:\nPE Adapters\n\t5' P-GATCGGAAGAGCGGTTCAGCAGGAATGCCGAG\n\t5' ACACTCTTTCCCTACACGACGCTCTTCCGATCT\nMultiplexing Adapters\n\t5' P-GATCGGAAGAGCACACGTCT\n\t5' ACACTCTTTCCCTACACGACGCTCTTCCGATCT\nIncubate the sample for 30 min at room temperature.\nPerform size selection of DNA using a pre-cast (2%) agarose gel. Run the gel for 10 min.\nExcise the region corresponding to 250-450 bp.\n\tNOTE: By cutting the gel above above 200 bp, there is a decreased possibility of contamination from unligated adapter dimers. It is important to remove any unligated adapters prior to the PCR step.\nUse a gel extraction kit to purify DNA. Elute in 20 µL of EB buffer.\nPCR and library purification for ligated DNA samples containing paired-end (PE) adapters. Add the components in a PCR tube: 12 µL of 50% of DNA from above, 12 µL of water, 25 µL of master mix (Phusion HF), 1 µL of PE PCR primer 1.0, and 1 µL of PE PCR primer 2.0.",
    "NOTE: Oligonucleotide sequences may also be obtained from a commercial source.\nOligonucleotide sequences:\nPE PCR Primer 1.0\n\t5' AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTCTTCCGATCT\nPE PCR Primer 2.0\n\t5' CAAGCAGAAGACGGCATACGAGATCGGTCTCGGCATTCCTGCTGAACCGCTCTTCCGATCT\nPCR and library purification for ligated samples containing Index PE adapters. Add the components: 12 µL of 50% of DNA from above, 12 µL of water, 1 µL of PCR primer InPE 1.0 (diluted 1:2), 1 µL of PCR primer InPE 2.0 (diluted 1:2), and 1 µL of PCR primer Index (diluted 1:2).\n\tNOTE: oligonucleotide sequences may also be obtained from a commercial source.\nOligonucleotide sequences:\nMultiplexing PCR Primer 1.0\n\t5' AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTCTTCCGATCT\nMultiplexing PCR Primer 2.0\n\t5' GTGACTGGAGTTCAGACGTGTGCTCTTCCGATCT\nPCR Primer Index Sequences 1 - 12\nPCR Primer, Index 1\n\t5' CAAGCAGAAGACGGCATACGAGATCGTGATGTGACTGGAGTTC\nPCR Primer, Index 2\n\t5' CAAGCAGAAGACGGCATACGAGATACATCGGTGACTGGAGTTC\nPCR Primer, Index 3\n\t5' CAAGCAGAAGACGGCATACGAGATGCCTAAGTGACTGGAGTTC\nPCR Primer, Index 4\n\t5' CAAGCAGAAGACGGCATACGAGATTGGTCAGTGACTGGAGTTC\nPCR Primer, Index 5\n\t5' CAAGCAGAAGACGGCATACGAGATCACTGTGTGACTGGAGTTC\nPCR Primer, Index 6\n\t5' CAAGCAGAAGACGGCATACGAGATATTGGCGTGACTGGAGTTC\nPCR Primer, Index 7\n\t5' CAAGCAGAAGACGGCATACGAGATGATCTGGTGACTGGAGTTC\nPCR Primer, Index 8\n\t5' CAAGCAGAAGACGGCATACGAGATTCAAGTGTGACTGGAGTTC\nPCR Primer, Index 9\n\t5' CAAGCAGAAGACGGCATACGAGATCTGATCGTGACTGGAGTTC\nPCR Primer, Index 10\n\t5' CAAGCAGAAGACGGCATACGAGATAAGCTAGTGACTGGAGTTC\nPCR Primer, Index 11\n\t5' CAAGCAGAAGACGGCATACGAGATGTAGCCGTGACTGGAGTTC\nPCR Primer, Index 12\n\t5' CAAGCAGAAGACGGCATACGAGATTACAAGGTGACTGGAGTTC\nPerform PCR cycling using the following conditions (denature for 30 s at 98 °C, 18 cycles of 10 s at 98 °C, 30 s at 65°C, 30 s at 72 °C, 5 min at 72 °C, hold at 4 °C).\n\tNOTE: The number of PCR cycles should be determined empirically.\nSize selection of PCR products. Run DNA on a pre-cast E-Gel EX (2%) or homemade 2% gel (agarose) and excise the 300 - 500 bp region.\nUse a gel extraction kit to purify the DNA from the gel. Elute final PCR product in 20 µL of EB buffer.\nUse a fluorometer to measure the concentration of the library. Perform next-generation sequencing.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}