{
  "id": 8832,
  "origin_website": "Jove",
  "title": "Characterization and Isolation of Mouse Primary Microglia by Density Gradient Centrifugation",
  "procedures": [
    "The following procedures have been approved by the Animal Ethics Committee at the Monash University. Healthy untreated neonate C57Bl6/J P3-6 mice were used to generate the representative results.\n1. Enzymatic Digestion\nNOTE: It is important to consider sterility when isolating and culturing primary cells. Whilst ensuring the environment is as sterile as possible, the initial dissection and harvest of murine brains can be completed outside of a laminal flow hood, with all subsequent steps performed within a laminar flow hood.\nUsing sterile instruments, euthanize the mouse by cervical dislocation, decapitate the animal and rinse with 100% ethanol. Using small sterile scissors, make small incisions along the right and left sides of the head. At this age, the skin peels away easily. Using the tips of the curved forceps, gently slide the tissue towards the rostrum to expose the skull, including the Bregma.\nInsert the tip of scissors in the opening of the spinal canal and make a lateral incision to the ear canal. Make an incision along the sagittal suture to the Bregma, gently pointing the tip of the scissors upwards to prevent damaging the brain. Insert tip of scissors at Bregma and make lateral incisions to the right and left sides of the head along the coronal suture.\nUsing forceps, gently peel away the skull to expose the brain. To do so, grasp the edges of skull exposed by the lateral incision, and gently pull the skull to the side. The skull should peel away easily. Using curved forceps, gently scoop under the brain to remove it.\nPlace the brain in a 5 mL sterile container, wash 2-3 times with ice-cold wash media (low glucose Dulbecco's Modified Eagle Medium (DMEM) supplemented with 1% penicillin-streptomycin), approximately 5 mL media per wash, to remove blood.",
    "In a laminar airflow hood, place the contents of the 5 mL container in a small petri dish (35 mm), resting on ice. Using a sterile scalpel blade or sterile scissors, remove the cerebellum and olfactory bulb. Make a midline cut to separate the two hemispheres.\nCarefully peel away the meningeal layer with fine forceps, taking care not to damage the cortices. Identify the meningeal layer as a very thin layer of cells with a red tinge on the surface of the brain, with visible blood vessels. Keeping the brain cold is essential for proper meninges removal. If the meningeal layer breaks, continue peeling away the torn fragments until it is completely removed.\nTransfer the hemispheres to a new small petri dish (on ice) and fill with wash media. Chop the brain into small pieces with sterile scalpel blade/scissors.\n\tNOTE: These should be ~1 mm2 in size, and care should be taken not to cut them into too small pieces as this may reduce yield.\nAdd 100 µL papain (17 U/mg stock) and 150 µL DNase I into the media and incubate for 30 min at 37 °C\nFollowing digestion, triturate tissue using a P1000 pipette. If tissue pieces are too large to enter the pipette, consider using a pair or sterile scissors to widen the pipette tip. During this process, take care not to introduce bubbles into the media as this may reduce cell viability.\n2. Myelin Debris Removal",
    "Under a laminar flow hood use sterile equipment, prepare a 50-mL conical tube with a 100 µm cell strainer, for each brain. Pour contents of the petri dish, containing the digest medium and brain pieces onto a strainer. Push through the pieces of brain by using the plunger of a sterile 3 mL syringe in a grinding motion until there is no more tissue visible. Following digestion, the brain tissue should fall apart easily.\nContinuously wash the filter with the wash media, by topping up the cell strainer throughout this process. This will wash through any cells trapped in the strainer.\n\tNOTE: This should be done until there is approximately ~15 mL in the tube. This is to ensure that the strainer is sufficiently washed through and to maximize the amount of cells collected.\nCentrifuge the single cell suspension at 500 x g for 5 min at 4 °C. During this time, prepare the density gradient medium as described.\nPrepare the stock isotonic percoll (SIP), which is the density gradient medium used. Do this by adding 9:1 ratio of density gradient medium to 10x sterile Hanks balanced salt solution (HBSS).\nPrepare gradients as 30% SIP in DMEM and 70% SIP in 1x HBSS. For example, to prepare 10 mL of 30% SIP, add 3 mL of SIP to 7 mL DMEM.\nAspirate the supernatant from the conical tubes and resuspend the cell pellet with 8 mL of 30% SIP in DMEM. Transfer the full volume to a fresh 15 mL conical tube.\nUnderlay the 70 % SIP solution. To do so, fill a transfer pipette with 70% SIP and carefully push through the transfer pipette to the bottom of the conical tube. Once the tip is close to the bottom, gently push through the contents of the transfer pipette.",
    "NOTE: Do this slowly so as not to disrupt the 30/70 interface. There must be a clear line separating the two layers.\nCentrifuge the SIP layers, including the cells, at 650 x g with brake 0 and acceleration 4, for 25 min at room temperature.\n\tNOTE: It is essential to complete the spin with brake OFF and to allow the centrifuge to slowly come to a halt, as application of brake will disrupt the interphase and dramatically reduce the cell collection between the SIP layers.\nAspirate the cellular debris at the top of the tube, and remove approximately 4 mL media from the top. This will ease the removal of the mononuclear cells in the following step. Using a P1000 pipette, carefully lower the pipette tip towards the interphase. Isolate the mononuclear cells from the 30/70 density gradient medium interface. Collect approximately 3 mL from the cloudy interface and transfer to a new 15 mL conical tube. Following this, dilute the mixture with 9 mL of HBSS to aid removal of the density gradient medium.\nCentrifuge the diluted density gradient medium interphase, containing the mononuclear cells at 500 x g for 5 min. Aspirate supernatant and resuspend with 1 mL growth medium (DMEM supplemented with 10 % fetal bovine serum and 1% antibiotics). Following this, stain the resuspended cells with trypan blue and perform a cell count using a haemocytometer.\n3. Magnetic Activated Cell Sorting\nNOTE: These steps are modified from manufacturers' protocol.",
    "Centrifuge the collected mononuclear cells at 300 x g for 10 min at 4 °C to remove the growth medium as this will interfere with the magnetic isolation. Using the same cell count obtained from Step 2.8, resuspend at 1 x 108 nucleated cells/mL in PBS (Ca++ and Mg++ free) containing 2 % FBS and 1 mM EDTA, within a volume range of 0.1-2.5 mL.\nAdd the full volume of nucleated cells in PBS from the previous step to a fresh 5 mL (12 x 75 mm) polystyrene round bottom tube. Add 50 µL CD11b PE labelling reagent per 1 mL of sample. Incubate at room temperature for 15 min protected from light.\nAdd 70 µL of selection cocktail (a combination of monoclonal antibodies against CD11b in PBS) per 1 mL of sample. Incubate at room temperature for 15 min protected from light.\nMix magnetic particles by pipetting up and down more than 5 times. Add 50 µL/mL to the sample. Incubate at room temperature for 10 min protected from light.\n\tNOTE: These particles then form a tetrameric complex with the antibodies and will get attached to the magnetic column.\nIf the total volume of cell mixture is less than 2.5 mL, top up to this volume with PBS (Ca++ and Mg++ free) containing 2 % FBS and 1 mM EDTA, and mix by gently pipetting 2-3 times. Place the tube (without lid) into the magnet and incubate at room temperature for 5 min.\nIn one continuous motion, fully invert the magnet containing the tube for 2-3 s, pouring off the supernatant. Return the magnet to an upright position, and remove the tube from the magnet. Prepare to wash the remaining cells out from the column.",
    "NOTE: The supernatant contains unlabelled and unwanted cells, which are removed by inverting the tube while still in the magnet. The tube contains the attached Cd11b+ cells.\nWash the cells by repeating steps 3.5 and 3.6 twice more. If the sample is greater than 1 mL, a further repeat of steps 3.5 and 3.6 is recommended.\nResuspend the cells in a desired growth medium. Rinse the side of the collection vessel as well (e.g. a 15 mL tube) to collect cells from the sides of the tube and maximize yields.\n4. Verification of Microglia Purity\nNOTE: The primary microglia isolated from 3 L (n = 5 animals total) were verified via fluorescent activated cell sorting (FACS) to determine purity for the representative results.\nCulture cells in a T-25 flask in the growth medium containing 10% FBS overnight, seeding at a density of 1 - 2 x 106 cells per flask.\nWash the cells in the T-25 flasks with PBS 3x for 5 min to remove any remaining growth media which might interfere with the trypsinization.\nAdd 2 mL of 0.25% trypsin to detach the cells from the flasks. Ensure that the volume of trypsin is sufficient to cover the entire surface of the flask. Following gentle swirling of the flask to ensure uniform coverage of trypsin, incubate for 5 min at 37 °C.\nQuench the trypsinization process by adding 2 mL of growth media containing 10% FBS into the flask.\nCollect the supernatant containing the trypsinized cells and centrifuge at 500 x g for 5 min at 4 °C to collect cells.\nRemove the supernatant containing the growth medium and trypsin and resuspend the pellet in 500 μL FACS buffer. Perform the cell count using trypan blue.",
    "Centrifuge at 500 x g for 5 min at 4 °C. Perform Fc receptor block by adding 50 μL FACS buffer + 1 μL FcR blocker per 5 x 106 cells. Incubate for 15 min at 4 °C.\n\tNOTE: The Fc receptor block is a critical step in the staining procedure to prevent non-specific binding of immunoglobulins to Fc receptors in immune cell populations. This blockade does not affect downstream binding of other antibodies.\nTerminate the blocking process by diluting with 500 μL FACS buffer. Following this, centrifuge the mixture containing the cells at 500 x g for 5 min at 4 °C.\nResuspend in fresh 500 μL FACS buffer.\nPlace the majority of cells (e.g. if resuspending the cells in 500 μL of FACS buffer, use 400 μL) into a sample tube. Distribute the remaining cells amongst the control tubes and top up to 100 μL per control tube (e.g. for 6 control tubes, put 16.67 μL into each control tube and top up with 83.33 μL FACS buffer). Make the groups (control tubes in bold) as Unstained, single stained (CD45, CD11b), single live/dead stain, FMOs, and sample tubes.\nPellet the cells in all tubes by centrifuging at 500 x g for 5 min at 4 °C.\nStain the cells in the tube with 1 μL antibody per 100 μL FACS buffer per 5 x 106 cells. Incubate for 20 min at 4 °C.\n\tNOTE: Use 50 μL antibody cocktail if less than 2 x 106 cells are used.\nWash the cells with 500 μL FACS buffer. Centrifuge the cells at 500 x g for 5 min at 4 °C.\nResuspend the cells in 300 μL FACS buffer.\n\tNOTE: Use ~100 μl if cell count is less than 2 x 106.",
    "Using flow cytometry analysis, quantify the cells that are CD45low and positive for CD11b staining. This percentage corresponds to the isolated primary microglia.\n5. Immunohistochemical Staining of Primary Microglia\nPlate the cells in a 96-well plate at a density of 1 x 105 cells with the growth medium and incubate overnight.\nRemove the supernatant and wash 3 times with PBS.\nFix the cells with 4% paraformaldehyde in PBS for 15 min. Remove the PFA with a P1000 pipette, then wash them 3 times with PBS + 0.1 % Triton-X.\nBlock for non-specific binding with 3% bovine serum albumin for 1 h at room temperature.\nIncubate with rabbit Iba-1 (1:100) for 24 h at 4 °C. Following this, remove the primary antibody mixture and wash 3 times with PBS.\nIncubate with secondary anti-rabbit GFP conjugate (1:200) for 1 h at room temperature. Following this, remove the secondary antibody mixture and wash 3 times with PBS.\nMount slides with a fluorescent mounting medium and capture images using a fluorescent microscope.\n6. Quantification of Microglia Using the pHrodo Assay\nNOTE: The pHrodo assay allows for identification of levels of phagocytosis in cultured cells. Upon uptake via endocytosis, internalization into the more acidic environment increases levels of fluorescence of the bioparticle conjugates. Fluorescence levels can then be quantified by FACS. The following steps are modified from manufacturers' protocol.\nCulture the cells in a T-25 flask in the growth medium overnight, seeding at a density of 1 - 2 x 106 cells per flask. Wash the cells in T-25 flasks with PBS 3 times for 5 min.\nDetach the cells using 2 mL 0.25% trypsin. Incubate for 5 min at 37 °C.\nQuench the trypsinisation process by adding 2 mL of growth media containing 10% FBS into the flask.",
    "Centrifuge the cell suspension at 500 x g for 5 min at 4 °C to pellet cells.\nRemove the supernatant and resuspend the pellet containing the primary microglia in culture medium at 106 cells/mL.\n\tNOTE: Alternatively, plate cells in a 96-well plate at least a day before and aim for 1 x 105 viable cells per well on the day the assay is to be performed.\nPlate cells into 96-well plate at 1 x 105 cells/well, 100 μL per well. Plate controls and experimental wells in triplicate, and leave one empty well per positive control for a no-cell control background subtraction.\nAdd 100 μL of growth media to the wells left empty for no-cell background subtraction.\n\tNOTE: Like any other in vitro assay, appropriate controls are vital for the accuracy of the readouts. Alongside the no-cell control (background reading), also include the negative control well (pHrodo conjugate added, but placed on ice).\nCover the plate and incubate for 1 h in an incubator with 5 % CO2 at 37 °C.\nPrepare experimental wells by adding stimulant and treatment. Add vehicle controls (growth media only) to untreated wells.\n\tNOTE: Lipopolysaccharide 1 µg/mL [stimulant] and human amnion epithelial cell (hAEC)-conditioned media [treatment] were used to generate the representative results.\nThaw a vial of conjugated dye, add 2 mL uptake buffer and briefly vortex. Transfer the tube contents into a clean glass tube and sonicate for 5 min, to ensure that particles are evenly dispersed.\nAspirate the culture medium from microplate wells and quickly replace with 100 μL of dye suspension. Cover and incubate at 37 °C for 1 h.\n\tNOTE: Remember to stain the control tubes as well.\nUsing flow cytometry analysis, quantify cells staining positive for the conjugated pHrodo beads and present as a percentage (of parent) of actively phagocytosing microglia.",
    "7. Quantification of Microglia Apoptosis Following Inflammatory Insult\nRepeat the steps 1-7 from \"Verification of microglia purity\" section.\nPlace the majority of cells (e.g. if you resuspended the cells in 500 μL of FACS buffer, use 400 μL) into a sample tube. Distribute the remaining cells amongst the control tubes and top up to 100 μL per control tube (e.g. for 6 control tubes, put 16.67 μL into each control tube and top up with 83.33 μL FACS buffer). Groups (control tubes in bold): Unstained, single stains (AnnexinV, Propidium iodide), single live/dead stain, FMOs, sample tubes.\nPellet the cells in all the tubes by centrifuging at 500 x g for 5 min.\nIncubate with 1 μL antibody/100 μL FACS buffer/5 x 106 cells for 20 min at 4 °C.\n\tNOTE: Use 50 μL if less than 2 x 106 cells.\nWash the cells by adding 500 μL FACS buffer and centrifuge at 500 x g for 5 min.\nResuspend the cell pellet in 300 μL FACS buffer.\n\tNOTE: ~100 μL if cell count is less than 2 x 106.\nQuantify cells within each quadrant (Q1: necrotic, Q2: late apoptotic, Q3: viable, Q4: early apoptotic).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}