{
  "id": 9419,
  "origin_website": "Jove",
  "title": "Heat-Induced Antigen Retrieval: An Effective Method to Detect and Identify Progenitor Cell Types during Adult Hippocampal Neurogenesis",
  "procedures": [
    "1. Pre-immunohistochemistry: Perfusion and Histology\nPerfuse mice as per a general transcardial protocol adapted for mice and extract the brains into 4% paraformaldehyde (PFA)9.\nLeave the brains in PFA overnight at 4 °C (e.g. a 10 ml conical tube filled with PFA). Keep in PFA for at least 12-24 hr, no more than 36 hr for full fixation. After overnight fixation, empty out PFA from conical tube but leave brains inside. Pour 30% sucrose into tube and wash the brains for a brief 5 sec to remove any residual PFA. Finally, fill tube containing brains with 30% sucrose again. Keep brains in sucrose at 4 °C until brains sink to the bottom of tube.\nCut 40 μm brain sections on a microtome. Consult a mouse brain atlas to start collecting sections from the beginning of the dentate gyrus till its end. Preserve sections in anti-freeze solution (a simple recipe is 300 g sucrose in 500 ml 0.1 M PBS and 300 ml ethylene glycol) until ready for immunohistochemistry.\nMount the cut tissue on microscope slides specifically designed to adhere strongly to tissue. These slides provide a strong hold to tissue during the boiling stage. After mounting the tissue, please let the slide dry for 10 min or until it is fully dry. Drying can be expedited if the slide is rested against a vertical surface with the slide's bottom edge on a paper towel. If more than one slide is being mounted, the other slide(s) may be left dry during that time (1-2 hr is okay) until ready to proceed to the next step.",
    "Once slide is dry, wash with PBS three times for 5 min each and dry again (PBS buffer = 0.137 M NaCl, 0.0027 M KCl, 0.0119 M Na2PO4). This ensures any previous chemical (such as glycerol from anti-freeze storage solution) is sufficiently removed and cannot impair the tissue's adherence to the slide.\n2. Preparation of Reagents and Minor Equipment\nPrepare Solution A (0.1 M or 19.21 g/l citric acid) and Solution B (0.1 M or 24.9 g/l tris-sodium citrate) in which tissue sections will be boiled.\nIn a graduated cylinder, combine 9 ml of Solution A and 41 ml of Solution B. Add 450 ml of ddH2O to this mixture.\nPour this mixture into an empty container (e.g. an empty pipette tips box) that is microwave safe.\n3. Heat-induced Antigen Retrieval\nBoil solution made in step 2 for 5 min at standard setting in a standard microwave. The solution will start boiling at or above 100 °C.\nOnce boiling is complete, carefully remove container from microwave and place dried slides into it, ensuring the slide-face with hippocampal sections is facing down and fully exposed to the liquid. If possible, place slides at an angle against the walls of the box and stack other slides around them. Ensure their \"fit\" inside the box is tight so the slides have no room to move on top of each other.\nBoil this mixture with slides for 7 min at standard settings in the microwave. The solution will boil during this time at or above 100 °C.\nDuring this boiling stage, fill two ice buckets halfway with ice.",
    "Once boiling in step 3.3 is complete, remove the container from the microwave and place it inside one of the ice buckets. Pour the rest of the ice from the other bucket all around the container and completely cover it. Let it sit for 1 hr.\n4. Primary and Secondary Antibody Staining\nAt the end of the 1 hr waiting period, remove the slides from the container and wash with TBS-T buffer 3x for 5 min each. Any apparatus may be used to perform these basic washes. (Buffer TBS = 50 mM Tris HCl, 150 mM NaCl, TBS-T = 0.05% Triton X-100 TBS buffer, TBS-TT = 4% donkey serum TBS-T buffer).\nAfter washing, let the slides dry in a dark place (e.g. inside a bench drawer, place a paper towel inside the drawer and tilt the slide against it) for 5-10 min or until slide is fully dry. During this period, prepare a chamber for overnight primary antibody staining. A simple staining chamber may include a container with large surface area filled with ddH2O and a stage inside the container, on top of which the slide may be rested above the ddH2O.\nOnce the slide has dried, draw an outline around the tissue sections using a water-repellant pen. During step 4.5, this outline acts as a barrier preventing the antibody mixture from flowing over.\nPrepare the primary antibody mixture in TBS-TT. At least 500 μl is required to cover one entire slide for instance, if antibody stock is at 1:500 concentration, add 1 μl of particular antibody to 500 μl of TBS-TT). Utilize primary antibodies as mentioned in the reagents table.",
    "Place the dried slide on top of the stage in the staining chamber. Add 500 μl of the primary antibodies slowly and cover entire surface. Cover entire apparatus and wrap in aluminum foil to block external light. Let it sit overnight at room temperature.\nThe next day, wash the slide three times for 5 min each with TBS-T buffer. Let it dry in a dark area as described in step 4.2.\nPrepare secondary antibody mixture similar to step 4.4. Refer to reagents table for secondary antibodies.\nPlace the dried slide in the staining chamber as described in steps 4.2 and 4.5. Add 500 μl of the secondary antibodies slowly and cover entire surface. Wrap the staining chamber in aluminum foil to protect it from external light. Let it sit covered and protected from external light for at least 2 hr at room temperature.\nAfter completion of secondary staining, wash the slide three times for 5 min each with TBS-T buffer. Let the slide dry in a dark area. After drying, put mounting solution and cover the slide with a cover slip carefully preventing any introduction of bubbles. Let the slide sit in a dark area for at least 2 hr before subsequent analysis.\nPerform time-lapse or confocal analysis on the stained tissue.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}