{
  "id": 3409,
  "origin_website": "Cell",
  "title": "Scalable generation of 3D pancreatic islet organoids from human pluripotent stem cells in suspension bioreactors",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe differentiation protocol takes the hPSCs through the 6-stage media protocol. See Figure 5[href=https://www.wicell.org#fig5] for the overall directed differentiation path, as well as quality controls, media, and factors used at each differentiation step.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig5.jpg\nFigure 5. Overview of the six-step 3D differentiation protocol\nThe schematic follows the cells through their consecutive fates, induced by the steps of the protocol, along the journey from stem cell to maturing islet. Shown are the number of days at each step, the necessary media and factors added each day, the quality checks performed at the beginning of each step, and the protein markers to be assessed for completion of each differentiation stage.\nSC-islet differentiation in 3D bioreactors\nTiming: 2 days of incubation, 20 days of differentiation, 5 weeks of maturation\ntable:files/protocols_protocol_2989_7.csv\nStage 0- pluripotent stem cells\nNote: Stage 0 begins on the first day after clump passaging in 3D (stage 0 day 0) differentiation preparation.\nNote: Stage 0 is the only stage when no Penicillin-Streptomycin is added to the media, to prevent loss of pluripotency.15[href=https://www.wicell.org#bib15] Follow strict sterile protocol to avoid contamination during this time.\nNote: To prepare complete mTeSR1 medium (basal medium + 5× supplement), thaw 5× mTeSR1 supplement at 4°C (do not place in water bath), then add to mTeSR1 basal medium.\nNote: The day after splitting (24 h half-feed), complete mTeSR1 should contain ROCK inhibitor. The next day (48 h full feed) it should not contain any ROCK inhibitor.",
    "Day 0: Passage maintenance line as described in step 4: Clump Passaging hPSCs in 3D Culture”. Reseed the maintenance line, start a parallel line for later differentiation. Seed at optimal density (e.g., 0.6 × 106 cells/mL in mTeSR1 + 1:1000 ROCK inhibitor for Hues8). For 30 mL bioreactors, 18 M cells in 30 mL is typical. Take a sample for analysis of pluripotency by flow cytometry (see before you begin[href=https://www.wicell.org#before-you-begin] step 8: QC sample collection).\n24 h (Day 1): After 24 h, perform a half-media change as described below:\nRemove bioreactor from incubator, clean the outer surface with 70% ethanol and place in BSC. Wipe dry with a Kim wipe.\nWait 3–5 min until cell clusters have mostly settled.\nCritical: Clusters should be small at this point but will settle to the bottom third of the bioreactor if given enough time. Visually confirm the absence of particles in the top half of the bioreactor.\nOpen the bioreactor cap and aspirate half the volume (15 mL for the 30 mL bioreactor or 150 mL for the 300 mL bioreactor). Be careful not to aspirate any clusters.\nCritical: Keep the aspiration tip as close to the surface of the media as possible to minimize cell loss.\nReturn culture to full volume by replacing with either 15 mL or 150 mL fresh complete mTeSR1 medium (no ROCK inhibitor). Replace and tighten cap. Return bioreactor to the incubator.\n48 h (Day 2): After all cell clusters have settled, perform a full-media change as described in step 11: Step-by-Step Media Change in Bioreactors. Replace spent media with fresh complete mTeSR1.\nStage 1- definitive endoderm\nTiming: Days 1–3\nIn stage 1 of this protocol, stem cells are differentiated into definitive endoderm using the transforming growth factor Activin A (AA) and the GSK-3 inhibitor/Wnt activator CHIR9902.",
    "Note: Stage 1 media is exchanged over two consecutive days: stage 1 day 1 uses Activin A and CHIR99021, and stage 1 day 2 uses only Activin A (see day-by-day differentiation guide for concentrations).\nS1d1 (Day 1)\nCollect QC for the completion of stage 0:\nUse a P1000 pipette to spin the impeller and draw up a representative sample.\nTransfer 0.5 mL of cell clusters to a 24-well plate to take bright field images.\nMeasure cluster size, then use for flow cytometry QC.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig6.jpg\nFigure 6. Good and bad morphology for 3D human pluripotent stem cell clusters\n3D hPSC clusters entering stage 1 should be round and uniform in morphology, with clear, sharp edges. An average cluster diameter in the 200–270 μm range is expected. Poor clusters are not uniform in size or morphology, lack sharp edges, and can present a hollow core and cell shedding (resulting in cloudier media).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig7.jpg\nFigure 7. Example flow cytometry quantification of stage-specific markers\nUpon quantification by flow cytometry, hPSC clusters should be >85% OCT4+; DE clusters >85% SOX17+; PP1 >85% PDX1+; PP2 35–60% NKX6.1+/PDX1+; SC-islets 15%–30% NKX6.1+/C-peptide+ and 15%–30% NKX6.1+/C-peptide+. An unstained sample (secondary antibody only) is shown as control for flow cytometry gating. Antibodies used are shown in the key resources table[href=https://www.wicell.org#key-resources-table].\nNote: see before you begin[href=https://www.wicell.org#before-you-begin] step 8: QC sample collection and expected outcomes[href=https://www.wicell.org#expected-outcomes] for collection, flow cytometry markers, and morphology.\nNote: see Figures 6[href=https://www.wicell.org#fig6] and 7[href=https://www.wicell.org#fig7] for expected hPSC flow cytometry marker results and cluster morphology.\nPerform a full-media change to s1d1 media (S1 Medium + Activin A and CHIR99021) as described in step 11: Step-by-step media change in bioreactors. Try to remove all spent media without aspirating clusters.",
    "S1d2 (Day 2): Wait a full 24 h after s1d1 media change to perform a full-media change to s1d2 media (S1 Medium + Activin A) as described in step 11: Step-by-step media change in bioreactors.\nS1d3 (Day 3): No media change. Bioreactor remains in culture undisturbed.\nStage 2- primitive gut tube\nTiming: Days 4–6\nPrimitive gut tube is induced in stage 2 using keratinocyte growth factor (KGF).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig8.jpg\nFigure 8. Success of primitive gut tube morphogenesis depends on initial definitive endoderm cluster diameter\nA cubic model predicts morphogenesis during differentiation from DE to PGT. The surface area to volume ratio of PGT clusters as a function of their diameter at the DE stage is shown. Smaller DE clusters, which have excess surface area relative to volume, are easier to fold and thus more susceptible to excessive folding into a “flower” circular morphology with fluffy edges (over-flowering, green). Larger clusters, with lower surface area to volume ratios, undergo normal flowering (blue). A transition region (orange) exists where normal flowering morphology and over-flowering morphology co-exist in the same differentiation.\nNote: Stage 2 uses KGF on its first and third day.\nNote: There is no flow cytometry QC taken upon stage 2 completion.\nNote: See Figure 8[href=https://www.wicell.org#fig8] for the expected relationship between definitive endoderm cluster diameter and primitive gut tube surface area/volume, for differentiations conducted in 30 mL bioreactors in a magnetic stir culture system set to 60 RPM. Larger clusters are necessary for proper flowering in lower bioreactors volumes, likely due to increased shear forces.\nS2d1 (Day 4):\nCollect QC for the completion of stage 1 (stage 1c):\nUse a P1000 pipette to spin the impeller and draw up a representative sample.\nTransfer 0.5 mL clusters into a 24-well to take bright field images.",
    "Measure cluster size, then use for flow cytometry QC.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig9.jpg\nFigure 9. Good and bad morphology for 3D definitive endoderm clusters\n3D DE clusters entering stage 2 should be round and uniform in size and can present rough edges or a hollow core. Poor clusters are smaller and less uniform in morphology due to excessive cell shedding (resulting in cloudier media).\nNote: (see before you begin[href=https://www.wicell.org#before-you-begin] step 8: QC sample collection). See Figures 7[href=https://www.wicell.org#fig7] and 9[href=https://www.wicell.org#fig9] for expected Definitive Endoderm flow cytometry marker results and cluster morphology.\nPerform a full-media change to s2d1 media (S2 Medium + KGF) as described in step 11: step-by-step media change in bioreactors. It is difficult to tell when clusters have settled at this point due to cloudiness in the media. However, slowly lifting the bioreactor should allow you to see settled clusters. Typically, this takes 4–5 min.\nS2d2 (Day 5):\nNo media change. Bioreactor remains in culture undisturbed.\nS2d3 (Day 6):\nPerform a full-media change to s2d3 media (S2 Medium + KGF) as described in step 11: step-by-step media change in bioreactors.\nNote: The clusters take longer to settle at this stage due to flowering (up to ∼7–9 min). If there are a few clusters suspended in media after this time, aspirate them to keep the sunken cells from sticking to the bioreactor.\nStage 3- pancreatic progenitors 1\nTiming: Days 7 and 8\nIn Stage 3 early PDX1+ pancreatic endoderm progenitors (PP1) are induced using a combination of KGF and hedgehog inhibitor (SANT1), along with a BMP inhibitor (LDN193189), the PKC activator Phorbol 12,13-dibutyrate (PDBU), and retinoic acid (RA)\nNote: Stage 3 involves feeding every 24 h. The first day requires KGF, Sant1, LDN, RA, ROCK inhibitor, and PDBU. The second day requires all the same factors except LDN (see day-by-day differentiation guide).",
    "S3d1 (Day 7):\nCollect QC for the completion of stage 2 (stage 2c):\nuse a P1000 pipette to spin the impeller and draw up a representative sample.\nCollect 0.35 mL into a 24-well to take bright field images and measure cluster size (no flow cytometry sample).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig10.jpg\nFigure 10. Good and bad morphology for primitive gut tube clusters\n3D PGT clusters entering stage 3 should show a uniform “flower” circular morphology with fluffy edges. Poor clusters show over-flowering, leading to excessive cell shedding, or underflowering, indicating failed differentiation.\nNote: (see before you begin[href=https://www.wicell.org#before-you-begin] step 8: QC sample collection).\nNote: See Figure 10[href=https://www.wicell.org#fig10] for expected Primitive Gut Tube cluster morphology.\nPerform a full-media change to s3d1 media (S3 Medium + KGF, LDN193189, Sant-1 RA, PDBU, ROCK inhibitor) as described in step 11: step-by-step media change in bioreactors.\nNote: The clusters take longer to settle at this stage due to flowering, up to ∼7–9 min. If there are a few clusters suspended in media after this time, aspirate them to keep the sunken cells from sticking to the bioreactor.\nS3d2 (Day 8):\nPerform a full-media change to s3d2 media (S3 Medium + KGF, Sant-1 RA, PDBU, ROCK inhibitor) as described in step 11: step-by-step media change in bioreactors. The clusters should settle much faster than on s3d1, and the medium is clear after clusters settle.\nStage 4- pancreatic progenitors 2\nTiming: Days 9–13\nIn Stage 4 late PDX1+ NkX6.1+ pancreatic endoderm progenitors (PP2) are induced using a combination of KGF and hedgehog inhibitor (SANT1), along with a BMP inhibitor (LDN193189), the PKC activator Phorbol 12,13-dibutyrate (PDBU), and retinoic acid (RA), and AA.\nNote: Stage 4 requires a wash on the first day, due to a decrease in the retinoic acid concentration.",
    "Note: Stage 4 feedings differ from stage 3 in that they require Activin A, but not LDN191189 or PDBU, and the RA concentration drops (see day-by-day differentiation guide).\nS4d1 (Day 9):\nCollect QC for the completion of stage 3(stage 3c):\nuse a P1000 pipette to spin the impeller and draw up a representative sample.\nTransfer 0.5 mL clusters into a 24-well to take bright field images.\nMeasure cluster size, then use for flow cytometry QC.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig11.jpg\nFigure 11. Good and bad morphology for early pancreatic progenitors\n3D PP1 clusters entering stage 4 should show a uniform round morphology, a solid core, and be relatively even in size. Poor clusters are smaller and less uniform in morphology.\nNote: (see QC sample collection).\nNote: See Figures 7[href=https://www.wicell.org#fig7] and 11[href=https://www.wicell.org#fig11] for expected Early Pancreatic Progenitors flow cytometry marker results and cluster morphology.\nIn addition to the volume required for media change, prepare an extra half volume of basal S3 media (no factors) on this day for wash.\nMandatory Wash:\nPerform a full-media change as described in step 11: step-by-step media change in bioreactors, through step 2.\nInstead of adding fresh differentiation media, add half culture volume of fresh basal S3 media (no factors) and gently swirl bioreactor to mix.\nWait 2–4 min for clusters to settle, then aspirate away basal S3 media.\nCritical: this is required to remove residual retinoic acid from stage 3.\nProceed to step 3 of “step-by-step media change in bioreactors and feed with s4d1 media (S3 Medium + KGF, Sant-1 RA, ROCK inhibitor, Activin A).\nS4d2 (Day 10):\nNo media change. Bioreactor remains in culture undisturbed.\nS4d3 (Day 11):\nPerform a full-media change to s4d3 media (S3 Medium + KGF, Sant-1 RA, ROCK inhibitor, Activin A) as described in step 11: step-by-step media change in bioreactors.\nS4d4 (Day 12):",
    "No media change. Bioreactor remains in culture undisturbed.\nS4d5 (Day 13):\nPerform a full-media change to s4d5 media (S3 Medium + KGF, Sant-1 RA, ROCK inhibitor, Activin A) as described in step 11: step-by-step media change in bioreactors.\nStage 5- endocrine progenitors\nTiming: Days 14–20\nStage 5 achieves endocrine differentiation using the epidermal growth factor betacellulin, the γ-secretase inhibitor XXI, thyroid hormone (T3), the ALK5 transforming growth factor inhibitor II, SANT1, and RA.\nS5d1 (Day 14):\nCollect QC:\nuse a P1000 pipette to spin the impeller and draw up a representative sample.\nTransfer 0.5 mL clusters into a 24-well to take bright field images.\nMeasure cluster size, then use for flow cytometry QC.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig12.jpg\nFigure 12. Good and bad morphology for late pancreatic progenitors\n3D PP2 clusters entering stage 5 should show a uniform “crater”-like appearance and may present small lumps. Poor clusters are smaller and less uniform in morphology and may present over-lumping.\nNote: See before you begin[href=https://www.wicell.org#before-you-begin] step 8: QC sample collection.\nNote: See Figures 7[href=https://www.wicell.org#fig7] and 12[href=https://www.wicell.org#fig12] for expected Late Pancreatic Progenitors flow cytometry marker results and cluster morphology.\nPerform a full-media change to s5d1 media (BE5 Medium + Sant-1, Betacellulin, XXI, Alk5i, T3, RA) as described in step 11: step-by-step media change in bioreactors.\nCloudy media may develop later in this stage, as with stage 1.\nS5d2 (Day 15):\nNo media change. Bioreactor remains in culture undisturbed.\nS5d3 (Day 16):\nPerform a full-media change to s5d3 media (BE5 Medium + Sant-1, Betacellulin, XXI, Alk5i, T3, RA) as described in step 11: step-by-step media change in bioreactors.\nS5d4 (Day 17):\nNo media change. Bioreactor remains in culture undisturbed.\nS5d5 (Day 18):\nPerform a full-media change to s5d5 media (BE5 Medium + Betacellulin, XXI, Alk5i, T3, RA) as described in step 11: step-by-step media change in bioreactors.",
    "Critical: Pay attention to the difference in media composition between days 3 and 5. After day 3, Sant1 is no longer added, and the concentration of retinoic acid is reduced.\nS5d6 (Day 19):\nNo media change. Bioreactor remains in culture undisturbed.\nS5d7 (Day 20):\nPerform a full-media change to s5d7 media (BE5 Medium + Betacellulin, XXI, Alk5i, T3, RA) as described in step 11: step-by-step media change in bioreactors.\nStage 6- maturing SC-Islets\nTiming: Days 21–56\nTiming: ∼4 h (for step 27)\nStage 6 has no exogenously added factors and yields SC-islets that gain increasing levels of NKX6.1 and C-peptide along with robust glucose-stimulated insulin and glucagon secretion function over 4–5 weeks of extended culture.\nS6d1 (Day 21):\nCollect QC:\nuse a P1000 pipette to spin the impeller and draw up a representative sample.\nTransfer 0.5 mL clusters into a 24-well to take bright field images.\nMeasure cluster size, then use for flow cytometry QC.\nUse clusters for flow cytometry QC.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig13.jpg\nFigure 13. Good and bad morphology for endocrine progenitors\n3D EN clusters entering stage 6 should show a less uniform, lumpy, and somewhat uneven appearance, including craters and buds containing endocrine cells. Poor clusters are smaller in size and show greater variability.\nNote: see before you begin[href=https://www.wicell.org#before-you-begin] step 8: QC sample collection.\nNote: See Figures 7[href=https://www.wicell.org#fig7] and 13[href=https://www.wicell.org#fig13] for expected Endocrine Progenitors flow cytometry marker results and cluster morphology.\nNote: Reference Figures 7[href=https://www.wicell.org#fig7] and 15[href=https://www.wicell.org#fig15] for expected flow cytometry results by stage and by week.\nPerform a full-media change with S3 media (no differentiation factors) as described in step 11: step-by-step media change in bioreactors.\nS6d2 (Day 22):\nNo media change. Bioreactor remains in culture undisturbed.\nRest of Stage 6:",
    "Every other day for the rest of Stage 6 (e.g., Stage 6 day 1, 3, 5), perform a full-media change to fresh S3 media as described in step 11: step-by-step media change in bioreactors.\nCritical: if necessary, the feeding regimen can be shifted to e.g., even instead of odd days by performing a media change two days in a row.\nCollect QC weekly to track the level of Nkx6.1/c-peptide copositive cells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig14.jpg\nFigure 14. Expected morphology for maturing SC-islets\n3D SC-islets cultured for several weeks in stage 6 should maintain an even morphology and may increase size due to larger endocrine buds.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig15.jpg\nFigure 15. Expected stage-specific marker results\nExpected average results and the standard error of the mean for stage-specific protein markers, quantified by flow cytometry, during directed SC-islet differentiation. hPSC, human pluripotent stem cells (OCT4+); DE, definitive endoderm (SOX17+); PP1, early pancreatic progenitors (PDX1+); PP2, late pancreatic progenitors (PDX1+ NKX6.1+); EN, endocrine progenitors (NGN3+); SC-β, stem-cell-derived β cells (NKX6.1+ C-peptide+); PH, polyhormonal cells (NKX6.1+ C-peptide+). Antibodies used are shown in the key resources table[href=https://www.wicell.org#key-resources-table].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig16.jpg\nFigure 16. Expected glucose-stimulated hormone secretion function\nThis figure represents the average and standard error of the mean of weekly glucose-stimulated hormone secretion. 3D SC-islets cultured for several weeks in stage 6 should progressively amplify their insulin (A) and glucagon (B) secretion fold-change in 20 mM glucose relative to 2.8 mM glucose and expand their absolute secretion capacity. Peak glucose-stimulated hormone secretion function is observed after 3–4 weeks of culture.\nNote: See Figures 14[href=https://www.wicell.org#fig14] and 15[href=https://www.wicell.org#fig15] for expected maturing SC-islet cluster morphology and flow cytometry marker results.\nNote: The percentage of Nkx6.1/c-peptide copositive cells typically peaks between s6d7-s6d25. Glucose-stimulated hormone secretion function typically peaks between weeks 3–5 of extended culture (see Figure 16[href=https://www.wicell.org#fig16] for expected results).\nGlucose-stimulated Hormone Secretion.",
    "Glucose-stimulated Hormone secretion assays are a method of quality checking the function of sc-islets as they move through the maturation phase. Steps to measure SC-islet hormone secretion through serial static incubations are described below. See (Alvarez-Dominguez et al., 2020) for dynamic SC-islet hormone secretion measurements using a perfusion instrument.\nNote: Use freshly made 20 mM glucose, 2.8 mM glucose and 30 mM KCl in 2.8 mM glucose buffers.\nNote: Store KREBS buffer at 4°C for up to 1 week.\nNote: Use wide bore P1000 pipette tips to safely transfer cell clusters without accidental trituration.\nNote: 0.5 mL samples should contain about 1,000 cell clusters (about 1 million cells). Typical cluster pellet sizes for 1,000 cell clusters in a 15 mL conical tube is about 5 mm.\nNote: This preparation is sufficient for assaying glucose-stimulated hormone secretion in triplicate for each of 4 samples. If you have more samples, prepare more plates accordingly.\nSet Up.\nMake 2.8 mM glucose (LOW) buffer: dilute 1 M glucose 1:357 into KREBs buffer. 20 mM glucose (HIGH) buffer: dilute 1 M glucose 1:50 into KREBs buffer. 30 mM KCl buffer: dilute 2 M KCl into LOW glucose buffer with 0.75:50 dilution.\nTotal\nLOW\nglucose\nbuffer\nneeded\n=\n(\n5\nmL\n∗\nX\n)\n+\n(\n6\nmL\n∗\n3\n∗\nX\n)\nTotal\nHIGH\nglucose\nbuffer\nneeded\n=\n(\n2\nmL\n∗\n3\n∗\nX\n)\nTotal\nKCl\nin\nLOW\nglucose\nbuffer\nneeded\n=\n(\n1\nmL\n∗\n3\n∗\nX\n)\nX = sample number (samples are run in triplicate).\nEach sample is tested in triplicate (3 inserts/sample). Place 12 inserts into the top two rows of a low-attachment 24-well plate (Figure 17[href=https://www.wicell.org#fig17].) The bottom two rows will be used for wicking.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2989-Fig17.jpg\nFigure 17. Overview of protocol for measuring glucose-stimulated hormone secretion",
    "(A) 3D SC-islets are subjected to sequential challenges with low and high glucose concentrations, followed by a challenge with KCl and subsequent dissociation to obtain a cell count.\n(B) Procedure for changing inserts.\n(C) Procedure for SC-islet cluster collection and mechanical dissociation.\nPre-fill wells containing inserts with 0.5 mL of LOW glucose Buffer, inside and outside the insert by adding about 250 μL on each. Then pre-fill the top 12 wells of 4 additional 24-well plates without inserts: one with 1 mL/well LOW glucose buffer, another with 1 mL/well HIGH glucose buffer, another with 1 mL/well KCl buffer, and the last one with TrypLE (1 mL/well) (Figure 17[href=https://www.wicell.org#fig17]).\nPlace pre-filled plates in a 37°C incubator to equilibrate for at least 15 min.\nCollect 5 mL of each bioreactor.\nWash each sample with 2 mL of LOW glucose buffer in a 15 mL conical tube, spin down at 200 g and resuspend in 2 mL of LOW glucose buffer for distribution to the 24-well plate.\nCritical: out of 2 mL, 3 × 0.5 mL volume is used for assaying hormone secretion in triplicate, and the remaining 0.5 mL volume can be used for intracellular insulin content estimation.\nFasting step.\nDistribute 0.5 mL from each sample into each of the 3 replicate inserts/sample (final volume per well is 1.0 mL) using wide bore P1000 pipette tips, then place the plate in the 37°C incubator for 1 h. If you have more than one 24-well plate, process one plate at a time.\nInsulin Content Preparation.\nAfter placing plates into the incubator for the fasting step, aspirate LOW glucose buffer from the 0.5 mL leftover of each sample in the 15 mL conical tube and add 1 mL of M-Per mammalian protein extraction reagent to lyse cells.",
    "Incubate samples at room temperature (20°C–25°C) for about 15 min.\nUsing a P1000 pipette, triturate clusters by pipetting up and down until all the cells are lysed. Transfer 1 mL of insulin content sample into a 1.5 mL microcentrifuge tube and store at −80°C until the time of the ELISA assay.\nLOW glucose challenge step.\nAfter 1 h of LOW glucose buffer incubation, remove plate containing ‘glucose starved’ cell clusters from the incubator, as well as the other LOW glucose prefilled plate.\nUsing forceps, gently take out the insert and shake it, then transfer each insert into an empty well in the bottom two rows and let LOW buffer drain from insert into the well by wicking (Figure 17[href=https://www.wicell.org#fig17], B).\nPromptly pass inserts into the “LOW” plate and place it in the 37°C incubator for 1 h. This is the start of the LOW glucose challenge.\nCritical: when transferring inserts, push each gently into the bottom of the well ensuring that there are no air bubbles blocking buffer flow into the insert.\nAfter 1 h of the last LOW glucose buffer incubation, remove the plate containing the inserts as well as the HIGH glucose buffer prefilled plate.\nHIGH glucose challenge step.\nRepeat step 21dii of the LOW glucose challenge and transfer inserts into the HIGH glucose buffer containing plate and place the plate in the incubator for 1 h. This is the start of the HIGH glucose challenge.\nCritical: When transferring inserts, push each gently into the bottom of the well ensuring that there are no air bubbles blocking buffer flow into the insert.",
    "To collect the first LOW glucose incubation supernatant, remove the ‘wicked’ liquid from the 24-well plate and combine it with the liquid in the original well from which the insert was removed. Mix using a P200 pipette then transfer 0.2 mL into a low-attachment 96-well plate and store at −20 to −70°C. Store for up to 6 months.\nAfter 1 h of HIGH glucose buffer incubation, remove the plate containing the inserts as well as the KCl plate.\nKCl challenge step.\nRepeat step 21dii of the LOW glucose challenge and transfer inserts into the KCl buffer containing plate. This is the start of the KCl challenge.\nCritical: When transferring inserts, push each gently into the bottom of the well ensuring that there are no air bubbles blocking buffer flow into the insert.\nTo collect the HIGH glucose incubation supernatant, follow step 21eii of the HIGH glucose challenge step.\nAfter 1 h of KCl buffer incubation, remove the plate containing the inserts as well as the TrypLE prefilled plate.\nCell cluster dispersion and cell counting step.\nRepeat step 21dii of the LOW glucose challenge, transfer inserts into the TrypLE containing plate and incubate in the 37°C incubator for 30 min. This is the start of the cluster dissociation step.\nCritical: When transferring inserts, push each gently into the bottom of the well ensuring that there are no air bubbles blocking buffer flow into the insert.\nTo collect KCl incubation supernatant, follow step 21eii of the HIGH glucose challenge step.\nAfter 30 min of TrypLE incubation, triturate clusters by pipetting up and down using a P1000 pipette, removing as many cells from the insert mesh as possible without rupturing the mesh. Transfer 0.5 mL of dispersed cells into a microcentrifuge tube (Figure 17[href=https://www.wicell.org#fig17], C1).",
    "Remove the remaining 0.5 mL volume from the mesh by puncturing through it with a P1000 pipette and transferring liquid into the same microcentrifuge tube (Figure 17[href=https://www.wicell.org#fig17], C2). Each microcentrifuge tube should now contain 1 mL of cells + TrypLE.\nCount the total number of cells. The total cell count will be used to normalize insulin secretion level from each replicate measurement.\nHuman Hormone level measurement by protein ELISA.\nDilute the collected samples using x mL KREBs buffer for x number of cells.\nCritical: Sample dilution must be optimized according to the number of cells assayed and their hormone content / secretion level. For Hues 8 SC-islets, we typically use a 1:10 dilution for assaying glucagon secretion, 1:50 dilution for insulin secretion, and 1:5000 dilution for intracellular insulin content.\nMeasure human insulin and glucagon levels using human insulin ELISA (ALPCO Diagnostics; 80-INSHUU-E01.1) and Glucagon ELISA (Mercodia; 10-1271-01), respectively, according to the manufacturer’s instructions. (https://www.alpco.com/insulin-elisa.html[href=https://www.alpco.com/insulin-elisa.html] , https://www.mercodia.com/products/glucagon-elisa/[href=https://www.mercodia.com/products/glucagon-elisa/])\nDivide the measured hormone concentration by the total cell number in the sample, calculate the average from the triplicates, and express secretion results per 1000 cells (uIU/mL/1000 cells (insulin) or pmol/L/10000 cells (glucagon)."
  ],
  "subjectAreas": [
    "Organoids",
    "Stem Cells",
    "Biotechnology And Bioengineering",
    "Cell Culture",
    "Cell Differentiation"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}