{
  "id": 18835,
  "origin_website": "Jove",
  "title": "Molecular Profiling of the Invasive Tumor Microenvironment in a 3-Dimensional Model of Colorectal Cancer Cells and Ex vivo Fibroblasts",
  "procedures": [
    "1. Establishment of Primary Fibroblast Cultures from Colonic Explants\nObtain samples of normal human colon mucosa tissue directly from the surgical operating theatre, and suspend in 7-10 ml of PBS supplemented with 100 units/ml penicillin, 100 μg/ml streptomycin, and 0.25 μg/ml Fungizone.\nIn the laboratory, place the specimen at the center of a 10-cm tissue culture dish and wash 3 times with PBS/Pen-strep/Fungizone. Do not aspirate after the final wash.\nWith sterile forceps and scalpel, cut the tissue into small pieces (approximately 2mm) and place each piece at the center of a cross drawn with the scalpel blade in a 12-well plate. Rock the scalpel gently over the tissue to allow it to adhere.\nCulture the specimens in 750 μl primary fibroblast growth media (DMEM supplemented with 20% fetal calf serum (FCS), 100 U/ml penicillin, 100 μg/ml streptomycin and 292 μg/ml L-Glutamine), which should submerge the tissue without enabling it to float. Avoid disturbing the plate over the next 5 days except to re-feed every 2 days.\nOver the next 5 days fibroblasts will slowly start to grow out from the edge of the tissue. At approximately 7 days, this will be more visible. After approximately 3-4 weeks, and if there are sufficient fibroblasts growing out, add 750 μl trypsin to each well. After cells have detached (which may take 5-10 min), pool and transfer to a T-25 tissue culture flask.\n2. Organotypic Preparation\nPreparation of the fibroblast impregnated organotypic gel:\nPrepare a fibroblast cell suspension containing 5 x 105 cells per organotypic in DMEM supplemented with 10% FCS and 292 μg/ml L-Glutamine.\nMake up the organotypic gels on ice, in the following ratios:\n\t\n7 volumes of Rat-Tail Collagen: Matrigel mix (1:1)\n1 volume of filtered 10x DMEM\n1 volume of FCS",
    "1 volume of fibroblast cell suspension containing 5 x 105 fibroblasts\n\t\tFor 9 gels (1 ml per gel) prepare 10 ml and mix gently to avoid bubbles.\nAdd 1 ml to each well of a 24-well plate and incubate for 1 hour at 37 °C in a humidified atmosphere to allow gels to set. After 1 hr add 1 ml DMEM (10% FCS)/Glut on top of the gels and return to the incubator overnight.\nThe following day, aspirate medium from the top of the gels and plate 1ml of media containing 5 x 105 CRC epithelial cells.\nPreparation of gel coated nylon sheets:\nPrepare sterile, autoclaved nylon sheets measuring 1.5 cm x 1.5 cm, in advance.\nUsing sterile forceps, place the required number of nylon sheets in a 10 cm culture dish (usually 4 nylon sheets can be accommodated per dish).\nMake up gel on ice in the following order (250 μl total volume is required per nylon sheet):\n\t\n7 volumes of Rat-Tail Collagen\n1 volume of filtered 10x DMEM\n1 volume of FCS\n1 volume of DMEM 10% FCS/Glut\nIf the solution is yellow, neutralize by adding 0.1 M NAOH in 50 μl aliquots until the solution turns pink.\nAdd 250 μl of this solution to each nylon sheet and incubate at 37 °C in a humidified atmosphere of 5% CO2 for 30 min to allow gel to set.\nMake up 1% glutaraldehyde solution in PBS. Add 10 ml to each 10 cm culture dish once the gel has set and incubate at 4 °C for 1 hr.\nWash nylon sheets 3x in PBS and 1x in DMEM (10% FCS)/Glu and incubate overnight in DMEM/Glu at 4 °C.\nRaising organotypic gels onto steel grids for invasion:",
    "Pre-prepare scaffolding grids by folding stainless steel sheets into a tripod formation. Autoclave prior to use.\nUse forceps sterilized in ethanol to place a steel grid into each well of a six well plate.\nPlace a gel-coated nylon sheet with the collagen side uppermost, onto each grid.\nCarefully transfer the organotypic gels from the 24-well plate to the raised nylon sheet using a spatula sterilized in ethanol.\nFill the well with DMEM 10% FCS/Glut supplemented with 10% FCS until the nylon sheet is in contact with the medium but not submerged. Make sure the medium does not touch the organotypic gel.\nIncubate for 14 days at 37 °C in a humidified atmosphere of 5% CO2, replacing media every 2 days.\n3. Organotypic Fixation\nRemove whole organotypic including nylon sheet from well and place on cling film.\nBisect organotypic and nylon sheet using a clean disposable scalpel and fix both halves in formaldehyde for 24 hr at room temperature.\nReplace formaldehyde with 70% ethanol after 24 hr and leave overnight prior to embedding in paraffin, sectioning, and staining.\n4. Laser Microdissection of the Invasive Margin\nSection to 10 μm-thickness onto membrane mounted slides.\nDeparaffinize sections by applying Xylene for 1 min, then remove Xylene and fix in 75% ethanol for a further 1 min.\nRemove ethanol and stain with 0.125% Cresyl Violet solution for 1 min. Cresyl Violet highlights epithelial cells and permits easy discrimination from the stroma.\nRemove Cresyl Violet and apply 100% ethanol for a further 1 min before rinsing with 100% ethanol. Allow slides to air dry for 30 min.\nConduct laser microdissection using chosen platform (e.g. the Leica AS system).\nPlace the glass slide with the stained section to be microdissected face down on the microscope stage.",
    "Mount a 0.5 ml microcentrifuge tube into the collection cassette and add 50 μl of cell lysis buffer (e.g. DNA, RNA or protein lysis buffer) to the cap into which microdissected tissue will collect.\nUnder direct vision, use the joystick to identify tissue of interest, and using the software interface, annotate the stained organic section, highlighting cells to be microdissected at the tumor invasion front.\nInstruct the laser to fire, which should both cut out the highlighted section and propel microdissected tissue into the cap of the microcentrifuge tube.\nOnce sufficient material has been collected, eject the collection cassette, close the microcentrifuge tube and spin gently to draw the lysis buffer to the bottom of the tube.\nPlace samples on ice until microdissection is complete. Process samples by an appropriate method to extract the analyte of interest.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}