{
  "id": 18943,
  "origin_website": "Jove",
  "title": "Direct Measurement of KDM1A Target Engagement Using Chemoprobe-based Immunoassays",
  "procedures": [
    "Blood samples were obtained from the Instituto de Investigación Biomédica Sant Pau Biobank according to Spanish legislation (Real Decreto de Biobancos 1716/2011) and approval of the local ethics committees. Studies with animal tissues were performed in accordance with the institutional guidelines for the care and use of laboratory animals (European Communities Council Directive 86/609/EEC) established by the Ethical Committee for Animal Experimentation at the PRAAL-PCB.\n1. Preparation of biological samples for the assay.\nCAUTION: This protocol involves manipulation of biological samples which may be subjected to the Occupational Safety and Health Administration (OSHA) Blood Borne Pathogens standard (29 CFR 1910.1030), Directive 2000/54/EC of the European Parliament and of the Council of 18 September 2000 or equivalent regulations. In addition, the biological samples may contain traces of biologically active investigational chemical compounds and the protocol may involve further manipulation of such compounds. Review the safety data sheet (SDS) of the compounds used prior to the initiation of the experiment and strictly observe all applicable safety measures established in the research center, including the use of adequate personal protective equipment (PPE). Wear proper protective clothing and use proper shielding during the course of the experiment. Discard residues in the appropriate waste containers (biological/cytotoxic waste).\nNOTE: This protocol starts with cells or samples of subjects treated with a KDM1A inhibitor and their untreated or vehicle/placebo treated controls3.\nCells treated with vehicle or KDM1A inhibitor in vitro\n\t\nFor the cells grown in suspension, as 10 mL cultures, transfer the suspensions into clean 15 mL conical tubes and proceed to 1.1.3.",
    "For the adherent cells (grown in 75 cm2 flasks), remove the medium from the flask and wash briefly using 4 mL PBS. Detach the cells from their vessels using 1.5 mL of 0.5% Trypsin-EDTA during 2 - 5 min (trypsinization conditions may vary, follow provider recommendations for the cell line), add 4 mL PBS and transfer the cells into clean 15 mL conical tubes.\nInsert the tubes in a bench top centrifuge and collect the cells by centrifugation for 5 min at 400 x g at 4 °C. Remove the supernatant, resuspend the pellet in 1 mL of PBS dispensed using a micropipette and transfer the suspension into a 1.5 mL microcentrifuge tube.\nInsert the samples in a microtube centrifuge and centrifuge them for 5 min at 400 x g at 4 °C. Remove the PBS by aspiration with a micropipette and either keep the pellets on the ice and proceed to Step 2; or freeze the pellets on dry ice and store them at -80 °C until Step 3.\nSamples from subjects or animals treated with vehicle/placebo or KDM1A inhibitor\n\t\nTissues: Cut the tissue in small, ≈1 cm3 pieces using a scalpel. Freeze the tissues pieces in liquid N2 in a Dewar container and store them at -80 °C until Step 3.\nPolymorphic blood mononuclear cells (PBMCs): Dilute 10 mL of fresh blood (process maximum 2 h after blood withdrawal) collected in K2-EDTA tubes with 2 volumes of PBS in a 50 mL conical tube. Isolate the PBMCs from blood using commercially obtained PBMC separation tubes according to the manufacturer’s instructions. Keep pellets on the ice and proceed to Step 3.2; or freeze the pellets on dry ice and store them at -80 °C until Step 3.",
    "NOTE: A wet cell pellet of 20 to 50 μL contains ≈ 1 x 107 cells, depending on the cell size. A wet PBMC pellet obtained from 10 mL of healthy human blood has a volume of ≈ 20 μL and contains ≈ 1 x 107 PBMCs. Tissues or cell pellets can be stored at -80 ºC for up to 6 months.\n2. Solution preparation\nPrepare 2 μM OG-881 working solution: Take a 10 μL single-use aliquot of the 20 mM biotinylated probe OG-881 stock solution out of the 4 °C fridge and leave it at room temperature (RT) for 10 min. Prepare the 2 μM working solution by serial dilution of the OG-881 stock solution in PBS, using a micropipette with filter tips and changing the tip between the different dilution steps.\nPrepare 10x Protease inhibitor: dissolve 1 tablet in 1 mL PBS in a microcentrifuge tube.\nPrepare the desired volume of 1x Cell lysis buffer with 25 nM OG-881 chemoprobe. For each mL, mix 100 μL commercially obtained 10x Cell lysis buffer, 150 μL of 10x Protease Inhibitor, 12.5 μL of 2 μM OG-881, and 737.5 μL of Type 1 double distilled water.\nOptionally prepare the desired volume of 1x Cell lysis buffer but with 25 nM ORY-1001 instead of OG-881 as in Step 2.3. Less potent inhibitors may be used but may require higher concentrations, for use in the positive control with 100% inhibition (see Step 3.5).\n\tNOTE: Take appropriate measures to avoid any unintended contamination of solutions or samples with the OG-881 or KDM1A inhibitor stock solutions. To calculate the desired volume of 1x Cell lysis buffer with 25 nM OG-881, assume that 400 µL is required per 40 mg of pulverized tissue, or 200 µL per wet pellet of 107 cells.\n3. Native protein extraction",
    "From tissues:\n\t\nPulverize and homogenize a ≈ 1 cm3 cube of frozen tissue with a mortar and pestle chilled on dry ice. Aliquot the samples in single-use vials containing ≈ 40 mg of tissue powder, avoid thawing at all times. Proceed to step 3.1.2. for immediate processing or store at -80 °C.\nResuspend 40 mg of powdered tissue in 400 µL of 1x Cell Lysis buffer with 25 nM OG-881, vortex for 10 s, and force the sample at least five times through an 18-gauge blunt syringe needle until lysis of the tissue is achieved and a turbid light yellow to orange suspension is obtained. Avoid bubble formation.\nContinue to Step 3.3\nFrom cell pellets (PBMCs and cell lines):\n\t\nResuspend a pellet of ≈ 1 x 107 cells in 200 µL of 1x cell lysis buffer containing 25 nM OG-881. Vortex the samples briefly and keep them on ice for 5 min.\nSonicate the samples in a sonicator using 3 pulses of 20 s each at 45 kHz; place them on ice for 20 s between pulses.\n\t\tNOTE: As soon as the biological samples have been resuspended in the 1x cell lysis buffer, keep them on the ice during the rest of the process.\nKeep the samples on ice for an additional 5 min, vortex briefly and centrifuge the samples for 10 min at 14 000 x g in a pre-cooled centrifuge at 4 °C.\nUsing a 1 mL micropipette, transfer the supernatants into fresh 1.5 mL microcentrifuge tubes and leave them on the ice during 2 h. Continue to Step 4.\nOptionally, a positive control to simulate 100% target engagement may be prepared as follows:",
    "Resuspend the cell pellet or powdered tissue from a vehicle or untreated (predose) sample in the required volume of 1x Cell Lysis buffer with 25 nM ORY-1001 and process as outlined in Step 3.1 to 3.3.\nTransfer the supernatants of the positive control into fresh 1.5 mL microcentrifuge tubes and leave them on ice for 1 h. ORY-1001 willfully inhibit KDM1A and block chemoprobe binding.\nAdd 5 μL of 2 μM OG-881 working solution to the positive control supernatant (volume for positive control generated from a 40 mg tissue sample) or 2.5 μL of 2 μM OG-881 working solution (volume for positive control generated from a 107-cell sample) to obtain the same OG-881 concentration as the other samples and leave on ice during 2 h. Continue to Step 4.\n4. Quantification of native protein using Bradford assay\nDilute the commercially sourced Bradford Protein Assay reagent 5 times with H2O Type 1 double distilled water. Calculate the volume of the reagent required for the total amount of samples and standards (1 mL per sample or standard + 5 mL excess volume).\nFor the Bovine Serum Albumin (BSA) standard curve, prepare one microcentrifuge tube with 1 mL diluted Bradford Protein Assay solution (blank) and seven microcentrifuge tubes with 995 μL of the diluted Bradford Protein Assay solution. Add 5 μL of each of the BSA Standards (concentration ranging from 125 to 2,000 µg/mL) to each of the 7 microcentrifuge tubes and mix them by gently inverting the tubes several times. Incubate for 5 min at RT.\nTransfer the diluted Standards to cuvettes and read the OD of the blank and Bovine Serum Albumin Standard samples in a spectrophotometer at 280 nm.",
    "For the biological samples, prepare one microcentrifuge tube with 1 mL diluted Bradford Protein Assay solution (blank) and as many microcentrifuge tubes with 999 μL of the diluted Bradford Protein Assay reagent as samples that need to be quantified. Using an automatic P2 micropipette, add 1 μL of native protein extract prepared in Step 3 to each microcentrifuge tube and mix by gently inverting the tubes several times. Incubate the samples 5 min at RT.\nTransfer the volumes to cuvettes and read the OD of the samples in a spectrophotometer at 280 nm.\nPreferentially, proceed immediately to Step 5. Alternatively, store the native protein extracts at -80 °C until Step 5. Avoid freeze thaw cycles.\n5. Luminescent ELISAs for Total and Free KDM1A determination\nNOTE: Keep the lab temperature constant at 23-24 °C (RT).\nCoating of microtiter plates with capture KDM1A antibody or Streptavidin\n\t\nTotal KDM1A ELISA: for each plate, prepare 10 mL of KDM1A capture antibody to a final concentration of 2 μg/mL in PBS. Transfer 100 µL into each well of the plate.\nFree KDM1A ELISA: for each plate, prepare 10 mL of streptavidin at 10 µg/mL in PBS. Transfer 100 µL into each well of the plate.\nTop-seal the Total and Free KDM1A ELISA plates with adhesive film and incubate the plates overnight at 4 °C in the refrigerator.\nWashing and Blocking the plates\n\t\nTake the plates out of the refrigerator and let them equilibrate for around 45 min at RT before use.\nPrepare 1,000 mL wash buffer (0.1% Tween in PBS) and 50 mL blocking buffer (1% BSA in PBS) per plate.\nWash the plates 3 times with wash buffer. In this and subsequent steps, tap the plate on paper towels after every washing step to remove residual solution.",
    "Add 200 µL of blocking buffer per well to both plates, top-seal both plates with an adhesive film and incubate 2 h at RT.\nBiological sample preparation\n\t\nDilute the native protein extracts obtained at the end of Step 3 to the appropriate concentration using PBS. The recommended concentration will vary in function of the level of KDM1A expression in the biological sample. Examples of appropriate ranges are (1) Cell pellets: 0.5 - 10 μg per well. (2) PBMCs: 5 - 30 μg per well. (3) Pulverized tissue (brain, lung, skin): 20 - 100 µg per well. Keep the samples on the ice during the preparation. When possible, run technical triplicate sample analyses.\nPrepare a Standard Curve using human rKDM1A:\n\t\t\nTo prepare the KDM1A Standard working solution, pipet the appropriate volume of rKDM1A for a final concentration of 25 pg/µL, add 75 μL of 2 μM OG-881, and complete with 1 x PBS to a total volume of 6 mL in a 15 mL falcon tube. Keep the KDM1A Standard working solution on ice during 1 h and mix the solution gently by inverting the 15 mL falcon tube several times every 20 min.\nPrepare the KDM1A Standard Dilution Series in 1.5 mL microcentrifuge tubes according to Table 1 (Standard Preparation), in volume enough for the triplicate analysis of two 96 well microtiter plates.\ntable:\n﻿0,1,2\nSTANDARD SERIES,KDM1A Standard working solution (µL),\n(pg KDM1A/well),KDM1A Standard working solution (µL),PBS (µL)\n2500 for C-*,800,-\n2500,800,-\n1750,560,240\n1250,400,400\n750,240,560\n250,80,720\n25,8,792\n0,0,800\nNOTE:,,\n(1) The volume prepared of each dilution is enough to run in triplicate 2 plates of assay.,(1) The volume prepared of each dilution is enough to run in triplicate 2 plates of assay.,(1) The volume prepared of each dilution is enough to run in triplicate 2 plates of assay.",
    "\"(2) The recommended range is between 2.5 and 5,000 pg / well\",\"(2) The recommended range is between 2.5 and 5,000 pg / well\",\"(2) The recommended range is between 2.5 and 5,000 pg / well\"\n\"* For the negative control C-, without KDM1A detection antibody\",\"* For the negative control C-, without KDM1A detection antibody\",\"* For the negative control C-, without KDM1A detection antibody\"\nTable 1: Standard Preparation. To prepare the Standard Series of KDM1A protein, pipette the indicated volumes of KDM1A Standard working solution and PBS into eight properly labeled 1.5 mL microcentrifuge tubes.\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390table2.jpg\nTable 2: Deep Well Plate Design.Standards (blue) and samples (yellow) from step 5.4.2. were pipetted into the reflected positions of the Deep Well Plate to facilitate loading into the ELISA plates following the direction of the blue (standard) and yellow (samples) arrows. Please click here to download this file.[href=https://www.jove.com/files/ftp_upload/59390/Table_2.xlsx]\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390table3.jpg\nTable 3: ELISA Plate Design. The assay plate includes the standard curve with decreasing amounts of recombinant KDM1A target (in blue); the biological samples (S) in yellow; and corresponding negative controls (contain the samples but not the primary detection antibody) in white, to be loaded on the ELISA plates from the Deep Well Plate. The blank (0 in standard curve) contains all capture and detection reagents but no sample. Please click here to download this file.[href=https://www.jove.com/files/ftp_upload/59390/Table_3.xlsx]\nELISA\n\t\n(Continued from Step 5.2.4.) After 2 h of incubation, discard the blocking buffer and wash the plates with wash buffer.\nTransfer the appropriately diluted samples (native protein extracts and standard curve from Step 5.3.) to a refrigerated 96 deep well storage block following the plate distribution shown in Table 2 (Deep Well Plate Design).",
    "Keep this block on ice until pipetting 100 μL sample / well in the Total and Free ELISA plates following the plate distribution shown in Table 3 (ELISA Plate Design).\nIncubate for 1 h at RT, discard the samples and wash the plates 5 times with wash buffer.\nPrepare 20 mL of rabbit anti-KDM1A detection antibody at 0.125 µg/mL in blocking buffer, add 100 µL per well in each plate of the assay, except in wells corresponding to the negative controls C-. Top-seal the plate and incubate 1 h at RT.\nDiscard the detection antibody solution and wash the plates 6 times with wash buffer.\nPrepare 25 mL of secondary goat anti-rabbit antibody HRP to a dilution 1:5,000 in blocking buffer, add 100 µL per well to the microtiter plates; and incubate 1 h at RT.\nChemiluminescent Detection\n30 min before the end of Step 5.4.7. and under soft light conditions, mix equal parts of Luminol-Enhancer and Peroxide Solution (10.5 mL: 10.5 mL, for 2 plates) in an amber bottle and leave it at RT.\n\t\tNOTE: Keep the Luminol Working Solution in an amber bottle and avoid prolonged exposure to any intense light. Short-term exposure to typical laboratory lighting will not harm the working solution.\nAt least 20 min before measuring the luminescence, switch on the microplate reader at 25 °C and set up readouts to 1,000 ms integration time and 150 ms settle time. Parameter settings may require optimization in function of the instrument.\nAfter 1 h of incubation in Step 5.4.7., discard the secondary antibody solution and wash the plates 6 times with wash buffer.",
    "Pipette 100 µL per well of the Luminol Working Solution (Chemiluminescent Substrate) prepared in Step 5.5.1. Pipette very slowly and avoid bubble formation. Use a timer to control the time between the addition of the addition of the solution and the luminescence measurement of the plates and keep this time constant to achieve a good inter assay reproducibility.\nTop-seal the plates and centrifuge to 500 x g at RT for 45 s in a plate centrifuge to eliminate any remaining bubbles. Incubate the plates for 1 min on a plate shaker at 100 rpm.\nInsert the plate inside the reader and leave it for 3 min to stabilize the temperature at 25 °C (without adhesive film). Always start with the Free ELISA plate.\nRead the relative luminescence units (RLU) of each ELISA plate assay (free and total KDM1A).\nSave and copy the Raw RLU values from the Raw Data excel files for further analysis of the results.\n6. Calculation of the target engagement\nIn a spreadsheet software, calculate the RLU Free and RLU Total values of samples SX and reference samples REF (untreated, vehicle or pre-dose sample) from their technical replicate Raw data as detailed below:\n\t\nEnter the individual Raw RLUi Total and Raw RLUi Free data from blanks, standard curve, negative controls C- and biological samples (SX and REF) into the analysis datasheet (e.g., Excel). Also, enter the amounts (in pg) of KDM1A from the Standard Curve in the datasheet.\nCalculate the Raw mean RLU, standard deviations σRLU, and coefficient of variation CVRLU from the individual Raw Total and Raw Free RLUi data for each technical replicate datapoint.",
    "Apply the outlier elimination (example for triplicates): for each individual Raw RLU Total and Raw RLU Free data point RLUi from a technical triplicate datapoint, apply Grubbs criteria when the CV for the triplicate > 0.15, and reject single suspect Raw RLU value when\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390eq1.jpg,\n\t\twhereby Z = 1.148 for n = 3 and 90 % confidence interval (CI).\nIf outlier elimination was applied, re-calculate the Raw mean RLU, standard deviation σRLU and CVRLU from the non-rejected (nr) Raw RLUi Total and Raw RLUi Free values for each datapoint.\nApply the background correction: Calculate the mean RLU Free and RLU Total values for each standard sample, and each sample SX and reference sample REF as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390eq2.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390eq3.jpg\nGraphically represent the data as follows:\n\t\nPlot the RLUFree and RLUTotal values (Y-axis) relative to their sample identification (X-axis) in a bar graph.\nAlso plot the RLU values (Y-axis) of the standards in a scatter plot relative to their amount of pg of rKDM1A protein (X-axis) for Free and Total measurements, as well as the corresponding lineal trendlines and calculate the r2  (the square of the linear correlation coefficient) values.\nCalculate the target engagement (TE); i.e. the percentage of KDM1A bound by the KDM1A inhibitor in each sample SX relative to a reference sample REF (untreated, vehicle or pre-dose sample) as follows:\n\t\nCalculate the ratio R of the mean RLU Free to Total values for the SX and REF samples as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390eq4.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390eq5.jpg\nThen calculate the target engagement (TE) of the sample SX as:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59390/59390eq6.jpg\n\t\tOptional: (1) If N biological replicate experiments were conducted, each with n technical replicates; first calculate the TESX for the technical replicate sets. Subsequently, calculate the mean TE, SD and the CV values for the biological replicate set.",
    "Revise whether the assay acceptance criteria are met: Verify that (1) the assay background is acceptable and the mean Blank < 0.05 x 107 RLU; (2) the sample auto-luminescence is absent and the RLUs of the negative controls C- are below the Lower Limit of Quantification (LLOQ = Mean Blank + 10x SD); (3) the rKDM1A standard curve is linear and r2 ≥ 0.98; (4) the biological samples have RLU values that fall in the dynamic and linear range of the assay i.e. between LLOQ and 2,500 pg/well.\n\tNOTE: Steps 6.1. to 6.4. can be readily automated in a calculus datasheet.\nExport the TE data to an open source or commercially obtained statistics software of choice for the graphical representation of the TE values and additional statistical evaluations.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}