{
  "id": 1959,
  "origin_website": "Cell",
  "title": "Generation of a pooled shRNA library for functional genomics screens",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPooling of shRNAs and addition of XhoI, EcoRI restriction sites\nTiming: 1 day\nThis step pools each individual shRNA in an equimolar mixture, which can then leverage the miR-E backbone to add the restriction sites necessary for cloning into the vector.\nTransfer 1 μL of each shRNA out of the 384-well plate into a 1.5 mL tube.\nAfter all shRNAs have been pooled, dilute the 10 μM mixture to 330 nM (ca. 10 ng/μL) by adding 20 μL of the pool to 580 μL nuclease-free water.\nNote: Any library size of pooled single-stranded DNA oligos can be safely amplified without the risk of underrepresenting or losing shRNAs.\nStore the original, undiluted shRNA pool at −80°C.\nCarry out the following PCR to add XhoI, EcoRI restriction sites. Setup at least 4 identical reactions. Include a negative control (no DNA template):\ntable:files/protocols_protocol_1441_3.csv\ntable:files/protocols_protocol_1441_4.csv\nTake 10 μL out of the reaction, mix them with 2 μL 6× DNA loading dye and load all 12 μL on a 3% TAE/agarose gel.\nNote: The PCR product is small (144 bp), so use an appropriate DNA marker. We recommend the GeneRuler 1 kb Plus DNA Ladder (Thermo Fisher Scientific, Cat#SM1332).\nRun the gel at constant 140 V for 30 min.\nInspect the gel for a band at around 140 bp corresponding with the expected PCR product (Figure 2[href=https://www.wicell.org#fig2]). Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nCritical: Do not proceed with purification if overamplification (a second band above the expected PCR product) is visible.\nIf no overamplification is visible, pool the PCR reactions in 1.5 mL tube and purify by ethanol precipitation.\nAdd 0.1 volume Na-Acetate pH 5.2, 2.5 volumes ice-cold 100% ethanol and 1 μL Glycoblue (15 mg/mL stock) to the sample.",
    "Note: Volume refers to the initial volume of the PCR reactions, so if for example the PCR reaction is 50 μl, 0.1 volume means adding 5 μl Na-Acetate pH 5.2 and 2.5 volumes means adding 125 μl ethanol.\nVortex the tube and incubate for at least 30 min at −20°C.\nCentrifuge for 30 min at 20,000×g at 4°C.\nCarefully aspirate the supernatant with a 100–1,000 μL pipette.\nAdd 700 μL 70% ethanol to the pellet.\nCentrifuge for 10 min at 20,000×g at 4°C.\nAspirate the supernatant and air-dry the pellets for 5 min.\nResuspend pellet in 20 μL nuclease-free water and measure sample concentration and quality. Expected concentration is 500–1,000 ng/μL and the 260/280, 260/230 ratios should be close to pure DNA (1.8 and 2.1, respectively).\nPause point: Samples can be safely stored at −20°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1441-Fig2.jpg\nFigure 2. TAE/agarose gel image of PCR product after restriction site addition\nNo overamplification is visible after 8 PCR cycles. The H2O negative control is appropriately empty.\nRestriction digest of vector and shRNA library\nTiming: 1 day\nIn this step both the vector as well as the pooled shRNAs will be incubated with the XhoI and EcoRI restriction enzymes to generate sticky ends, facilitating their ligation.\nSetup at least 2 restriction digests for both the plasmid, as well as the pooled shRNAs (PCR product). Also include undigested controls (everything except enzymes) for both:\ntable:files/protocols_protocol_1441_5.csv\nIncubate the reactions for at least 90 min at 37°C.\nPool the reactions and load them on 1% and 3% TAE/agarose gels for the plasmid and PCR product, respectively.\nCritical: Ethidium bromide is used for TAE gels, which is carcinogenic.",
    "Critical: The TAE gels should have low amounts of ethidium bromide to minimize the risk of it intercalating with the DNA before purification. We recommend adding 2.5 μl ethidium bromide (10 mg/ml stock solution)/100 ml TAE buffer. Furthermore, if possible, adjust the UV lamp to the lowest possible intensity and expose the gels for the shortest duration possible to prevent damage to the DNA. Troubleshooting 2[href=https://www.wicell.org#sec6.3]\nInspect the bands on the agarose gel.\nThe undigested PCR product should run slightly higher (at 144 bp) than the digested PCR product (at 130 bp).\nThe linearized digested plasmid should exhibit one clear unique band, while the supercoiled undigested plasmid should exhibit a double band that has progressed faster down the gel than its linearized counterpart.\nAfter verifying the successful digest (Figure 3[href=https://www.wicell.org#fig3]), excise the gel containing the digested bands using sterile scalpels.\nTransfer the excised gel pieces into 2 mL tubes.\nProceed with extraction of DNA using the GeneJET Gel Extraction Kit, according to manufacturer’s protocol A (https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012661_GeneJET_Gel_Extraction_UG.pdf[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0012661_GeneJET_Gel_Extraction_UG.pdf]).\nCarry out all protocol A (DNA extraction from the gel using centrifuge) steps including optional steps 4 and 6.\nNote: Carry out all centrifugation steps at 20,000×g at 20°C–25°C in a table-top microcentrifuge.\nElute the linearized plasmid and PCR product from the spin columns using 40 μL nuclease–free water. Repeat the elution once to increase DNA concentration.\nMeasure the concentration and quality of linearized plasmid and PCR product.\nCritical: For the linearized plasmid expect concentrations of at least 50 ng/μl, and for the PCR product around 5–10 ng/μl. Aim for at least 600 ng and 120 ng total DNA yield for plasmid and PCR product, respectively, before moving forward with the next step.",
    "Note: Quality ratios (260/280, 260/230) are relevant only for the plasmid, as the low concentration of the PCR product perturbs these measurements.\nPause point: Samples can be safely stored at −20°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1441-Fig3.jpg\nFigure 3. TAE/agarose gel images of plasmid (left) and PCR product (right) after restriction digest\nLigation of digested vector and PCR product\nTiming: 2 days\nThis step brings the plasmid and PCR product containing complementary sticky ends together in a ratio that guarantees the cloning of all shRNAs in the pooled library.\nCritical: The PCR product:plasmid ratio is important to ensure that all shRNAs are cloned in the vector.\nWe highly recommend using a 15:1 molar ratio. To calculate the ratio, we recommend using the NEB ligation calculator (https://nebiocalculator.neb.com/#!/ligation[href=https://nebiocalculator.neb.com/]). For this particular reaction, the insert (digested PCR product) is 130 bp and the plasmid around 10 kb. A 15:1 ratio thus requires ca. 40 ng and 200 ng of PCR product and plasmid, respectively.\nNote: This ligation reaction allows cloning of libraries of any size without the risk of underrepresenting or losing shRNAs.\nSetup ligation reactions, as follows:\ntable:files/protocols_protocol_1441_6.csv\nIncubate at 4°C–7°C (fridge) for 14–16 h.\nAlternatives: Incubate the ligation reaction at 20°C–25°C for 60 min. We, however, recommend the 14–16 h incubation.\nOptional: After ligation is finished, heat inactivate the T4 DNA ligase by incubating at 70°C for 5 min.\nProceed with the next step of the protocol without freezing the ligation reactions.\nTransformation of competent cells and plasmid isolation\nTiming: 1 week",
    "In this step, we transform competent E. coli XL1-Blue cells (Agilent) with the ligation reactions, plate them on agar plates and then isolate the plasmid DNA. First, we carry out a small-scale transformation using one 10 cm plate to sequence 10–15 plasmids in order to check the ligation efficiency and the sequences of cloned shRNAs. Afterwards, we carry out the ligation in numbers that maintain a high representation of the shRNA library (>100-fold). For libraries comprising around 500 shRNAs, we recommend preparing fresh 15 cm culture plates (around 25–30 plates are required) with LB-agar and the antibiotic of choice for selection. In our case, we used 15 cm plates (30 plates in total) with carbenicillin (100 μg/mL) for around 600 shRNAs.\nCritical: Also plate untransformed bacteria, as a negative control, and bacteria transformed with the original undigested plasmid, as a positive control.\nAlternatives: Instead of XL1-Blue bacteria, any competent bacterial strain can be transformed, such as XL10-Gold Ultracompetent Cells (Agilent, Cat.# 200314) or Agilent SURE2 Competent Cells (Agilent, Cat.# 200152).\nThaw the XL1-Blue cells on ice.\nTransfer 50 μL to a 1.5 mL tube.\nAdd 6 μL of the ligation reaction to the cells.\nAdd 60 ng of the original undigested plasmid, as a positive control.\nAdd only water, as a negative control.\nIncubate on ice for 20 min.\nHeat shock the cells by placing the tubes for 45 s in a 42°C water bath.\nCritical: Do not exceed the duration of heat shock and proceed immediately to the next step.\nIncubate the cells for 2 min on ice.\nAdd 800 μL LB medium to each tube.\nAlternatives: Instead of LB medium, Super Optimal broth with Catabolite repression (SOC) medium (Thermo Fisher Scientific, Cat.# 15544034) can also be used.\nNote: The medium should be at 20°C–25°C.",
    "Incubate the tubes for 45 min at 37°C with shaking at 150 rpm.\nNote: This step is necessary to allow the bacteria to start expressing the ampicillin resistance gene on the vector that they took up.\nDuring this time pre-warm the LB-agar plates at 37°C.\nPlate 100 μL of transformed bacteria on each of the carbenicillin (100 μg/mL) 15 cm culture plates.\nPlate also the positive and negative control bacteria.\nNote: Carbenicillin and ampicillin resistance are encoded by the same gene. We recommend carbenicillin as it prevents satellite colony growth.\nIncubate all plates up-side-down for 16–18 h at 37°C.\nOn the next day, inspect the plates for colonies.\nThe negative control plate must be empty.\nThe positive control should have a very large number of colonies.\nNote: First carry out the small-scale transformation to make sure that the quality of the pooled library is adequate. Troubleshooting 2[href=https://www.wicell.org#sec6.3] and 3[href=https://www.wicell.org#sec6.5]\nPick out 10–15 individual colonies with a yellow pipette tip and transfer each into 14 mL round-bottom tubes containing 3 mL LB-medium with ampicillin (100 μg/mL).\nIncubate for 16 h at 37°C with shaking.\nTransfer 1.5 mL from each culture into a 2 mL tube.\nCentrifuge at 20,000×g for 5 min at 20°C–25°C.\nAspirate supernatant completely.\nResuspend the pellet in 200 μL resuspension buffer.\nNote: Do not forget to freshly add RNase A to the resuspension buffer.\nAdd 200 μL lysis buffer.\nMix by inverting the tube 5–10 times.\nIncubate for 5 min at 20°C–25°C.\nAdd 350 μL precipitation buffer and mix by inverting.\nIncubate for 3 min at RT.\nCentrifuge at 20,000×g for 5 min at 20°C–25°C.\nTransfer the supernatant to a fresh tube.\nAdd 500 μL isopropanol.\nIncubate for 15 min at −20°C.\nCentrifuge at 20,000×g for 5 min at 4°C.",
    "Discard supernatant and wash pellet with 500 μL ice-cold 70% ethanol.\nCentrifuge at 11,400×g for 5 min at 4°C.\nDiscard supernatant and air-dry the pellets for 5 min.\nResuspend pellets in 30 μL nuclease-free water.\nOptional: Facilitate resuspension by incubating the tubes for 15–20 min at 37°C with shaking.\nMeasure DNA concentration and quality.\nCheck the shRNA sequences by Sanger sequencing, using the mirE_seq primer (Figure 4[href=https://www.wicell.org#fig4]).\nAfter validating that at least 80% of plasmids contain correct shRNAs, proceed with the large-scale transformation using 25–30 carbenicillin 15 cm culture plates.\nCarry out transformation as described above. Setup at least two ligation reaction reactions for a transformation of this scale.\nAfter colonies are clearly visible, add 1 mL LB-medium to each culture plate.\nPool all cells using a sterile cell scraper into a 50 mL tube.\nCritical: Proceed immediately with plasmid isolation, do not continue bacterial culture.\nIsolate plasmid DNA using the PureLink HiPure Maxiprep kit (Thermo Fisher Scientific, Cat.# K210007) with a slightly modified protocol.\nCentrifuge the bacterial suspension at 11,400×g for 20 min at 4°C.\nDiscard the supernatant.\nAdd 10 mL resuspension buffer (R3 from kit).\nNote: Do not forget to freshly add RNase A to the resuspension buffer.\nAdd 10 mL lysis buffer (L7 from kit).\nMix by inverting the tube. Do not vortex.\nIncubate for 5 min at 20°C–25°C.\nAdd 10 mL precipitation buffer (N3 from kit).\nMix by inverting until mixture is clearly homogeneous. Do not vortex.\nIncubate for 5 min at 20°C–25°C.\nCentrifuge at 11,400×g for 20 min at 20°C–25°C.\nDuring centrifugation, add 30 mL equilibration buffer (EQ1 from kit) to a HiPure Maxi column and allow the solution to drain by gravity flow.\nAfter centrifugation, place filter paper on the column and load the supernatant onto the column through the filter paper.",
    "Note: DNA will pass through the filter paper.\nAdd 60 mL wash buffer (W8 from kit) to the column. Discard the flow-through.\nPlace a 50 mL tube under the column. Add 15 mL elution buffer (E4) to the column.\nNote: The flow-through that ends up in the 50 ml tube is the eluted plasmid DNA.\nAdd 10.5 mL isopropanol to the eluate and mix well.\nIncubate for at least 30 min on ice.\nCentrifuge at 11,400×g for 25 min at 4°C.\nDiscard the supernatant.\nWash the pellet with 5 mL ice-cold 70% ethanol.\nCentrifuge at 11,400×g for 15 min at 4°C.\nRemove supernatant and air-dry the pellet.\nResuspend the pellet in 1–2 mL nuclease-free water.\nNote: Incubate the pellet for around 30 min at 20°C–25°C to facilitate DNA resuspension.\nMeasure plasmid DNA concentration and quality.\nDilute the DNA sample to 1 μg/μL.\nNote: Our 30 15 cm culture plate preparation yielded a total of 2.5 mg of highly-pure plasmid DNA.\nPause point: Plasmid DNA can be safely stored at −20°C.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1441-Fig4.jpg\nFigure 4. Chromatogram showing Sanger sequencing data of plasmid shRNA cloning site\nThe complete 97mer sequence is shown in the red box. Note that the base peaks are clearly distinct from each other indicating high DNA and sequencing quality.\nPreparation of shRNA library for next-generation sequencing\nTiming: 2 days\nThis step uses a small amount of the isolated plasmid DNA to generate a library suitable for Illumina sequencing. This is accomplished by two sequential PCRs that will specifically amplify the guide-strand of each cloned shRNA and will then add the index sequences necessary for multiplexed sequencing and the sequences required for hybridization of denatured libraries to Illumina NextSeq flowcells.\nSetup the 1st PCR as follows. Also include a negative water control:\ntable:files/protocols_protocol_1441_7.csv\ntable:files/protocols_protocol_1441_8.csv",
    "As with step 3, take 10 μL of the PCR reaction, add 2 μL of 6× DNA loading dye and load all 12 μL on a 3% TAE/agarose gel.\nInspect the gel. A single band at around 188 bp is expected. Make sure no overamplification is visible (Figure 5[href=https://www.wicell.org#fig5]). Troubleshooting 1[href=https://www.wicell.org#sec6.1]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1441-Fig5.jpg\nFigure 5. TAE/agarose gel image of 1st PCR product\nThe PCR product displays faint secondary structures after 10 amplification cycles and will thus be discarded. The 8 cycle PCR product will be purified and used further. The water control is appropriately empty.\nPurify the PCR product without secondary structures with ethanol precipitation as described in step 5.\nAlternatives: Gel extraction of the 188 bp band is also possible, but it will result in significantly reduced DNA yield and quality.\nMeasure the DNA concentration and quality.\nDilute the sample to 1 ng/μL.\nCritical: All subsequent steps need to be carried out in a post-PCR workspace to avoid contaminating other workspaces with indexed samples.\nPause point: Samples can be safely stored at −20°C.\nSetup the 2nd PCR as follows:\ntable:files/protocols_protocol_1441_9.csv\ntable:files/protocols_protocol_1441_10.csv\nNote: Setup at least two 2nd PCRs.\nLoad the entire reaction to a 3% TAE/agarose gel.\nInspect the gel and excise the band at around 250 bp (expected size is 257 bp).\nCarry out gel extraction as described in step 10.\nLoad the DNA library on a parallel capillary electrophoresis system. We used a Fragment Analyzer system (Agilent)\nLoad samples according to manufacturer’s protocol (https://www.agilent.com/cs/library/usermanuals/public/quick-guide-dnf-474-hs-ngs-fragment-kit-SD-AT000134.pdf[href=https://www.agilent.com/cs/library/usermanuals/public/quick-guide-dnf-474-hs-ngs-fragment-kit-SD-AT000134.pdf]).\nAfter electrophoresis, assess the concentration and quality of the library with smear analysis (Figure 6[href=https://www.wicell.org#fig6]). Troubleshooting 4[href=https://www.wicell.org#sec6.7]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1441-Fig6.jpg\nFigure 6. Fragment analyzer image and smear analysis of a pooled shRNA library, suitable for next-generation sequencing",
    "The sample shows a sharp peak around 260 bp, which was the size of the 2nd PCR product. Index primer (100–185 bp) or secondary structure contamination (800–3,000 bp) are appropriately low. LM, UM = lower and upper marker.\nPause point: Samples can be safely stored at −20°C (separate post-PCR sample storage).\nSequencing and analysis of shRNA library\nTiming: 3 days\nSequence the library using an Illumina sequencing system according to manufacturer’s protocol. We used the Illumina NextSeq 500 sequencing system.\nPrepare samples according to manufacturer’s protocol (https://support.illumina.com/content/dam/illumina-support/documents/documentation/system_documentation/nextseq/nextseq-500-system-guide-15046563-07.pdf[href=https://support.illumina.com/content/dam/illumina-support/documents/documentation/system_documentation/nextseq/nextseq-500-system-guide-15046563-07.pdf]).\nCritical: Sequence for at least 41 cycles.\nNote: Sequencing can be done as single-read (SR) or as paired-end (PE) sequencing. However, for all analysis steps, only the generated “read1” is required. The length of read1 has to be at least 41 cycles (= 41 bp of the template sequence). The first 19 bp sequenced correspond to the invariable shRNA-loop sequence used for binding of the first-step PCR primer “1st_PCR_F”. The following 22 bp correspond to the variable sequence of the shRNA guide-stem.\nAnalyze the shRNA distribution and generate plots as follows:\nDemultiplexing and FASTQ generation directly via the Illumina Base Space Sequencing Hub using the tool FASTQ Generation software v1.0.0 or BCL Convert v2.0.0.\nThe sample-specific FASTQ files are used for a Bowtie alignment to a reference dataset comprising all initially cloned shRNA sequences. Counting of all alignments per recovered and sequenced shRNA allows to calculate and visualize their distribution (frequencies) within the library.\nCritical: Make sure that the programs bowtie1, samtools and R are installed in a linux environment.\nNote: The steps shown below are applicable to any kind of shRNA screening sample, provided that guide-strand recovery from plasmid DNA was done according to the above outlined steps.\nGenerate a reference library for Bowtie alignments",
    "Generate a table in FASTA format that contains the guide-stem sequences of all shRNAs that were cloned and are expected to be represented in the pooled library.\nUse this table to build a bowtie1 compatible “reference genome”:\n>bowtie-build table.fasta reference_name\nAlign the sequence raw data (in FASTQ format) to the reference genome using bowtie1. In case of a paired-end sequencing approach, only use the sample-specific FASTQ files containing read1 for the alignment and write the alignment-output into a sam-file.\n>bowtie -v 0 -m 1 -5 19 --best -S /path-to-\nreference/reference_name input.fastq output.sam\nNote: The option “-v 0” in the command does not allow any mismatches during alignment. The option “-m 1” in the command reports only reads with one valid alignment. The option “-5 19” specifies that the first 19 bp are ignored for the alignment to the reference genome.\nNote: If read1 is longer than 41 bp, the additional option “-3 xx“ has to be used in the alignment command to ignore the xx bp from the 3′-end of the read that do not belong to the guide-stem.\nConvert the output.sam file into a bam-file\n>samtools view -bS output.sam output.bam\nCount the number of reads aligned to each entry in the reference dataset\n>samtools view output.bam | cut -f 3 | sort | uniq -c >\ncounts_per_shRNA.txt\nConvert the generated “counts”-file into a comma-separated-value (.csv) table that consists of rows corresponding to all individual shRNAs in the library and of columns containing the counts per shRNA identified in the sequenced sample(s). For this step, either Microsoft Excel or R can be used.\nNormalize the raw counts per shRNA by calculating CPM values (counts per million). This is achieved by applying the following formula to every individual raw count value of a sample:",
    "(  i n d i v i d u a l  r a w  c o u n t  ÷  c o l u m n  s u m  c o u n t  ×  1,000,000  )   =  i n d i v i d u a l  C P M  v a l u e  \nRead the CPM normalized counttable into R and generate a histogram to plot the distribution of shRNAs within the library:\n>counttable=read.csv(file=\"complete-path-to-\ntable/countable.csv\", header=TRUE, row.name=1)\n>hist(log10(counttable$CPM_values),breaks=100,\nborder=\"blue\", xlim= c(2,6), ylim=c(0,60),\nxlab=\"log10(number of counts per million (CPM))\"\nInspect the generated plot and the distribution of shRNAs in the library (Figure 7[href=https://www.wicell.org#fig7]). Troubleshooting 5[href=https://www.wicell.org#sec6.9]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1441-Fig7.jpg\nFigure 7. Histogram of normalized counts showing the number and distribution of shRNAs in the sequenced library\nPackaging of shRNA library plasmids into lentiviruses\nTiming: 4 days\nIn this step HEK293TN cells are transfected with the shRNA plasmid library along with two packaging plasmids required for the production of lentiviruses encompassing the shRNA library. In our case, we used the psPAX2 and pMD2.G packaging plasmids.\nAlternatives: HEK293TN cells are optimized for lentivirus production, however the parental HEK293 cells (CLS, Cat# 300192) can also be used. Additionally, the African green monkey COS-7 kidney cells (ATCC, Cat.# CRL-1651) and human TE671 rhabdomyosarcoma cells (CLS, Cat.# 300355) can be used, albeit with lower expected virus titers than the HEK293TN cells (Marino et al., 2003[href=https://www.wicell.org#bib5]).\nCount HEK293TN cells and seed 5 million cells in a 10 cm culture plate.\nNote: Make sure to spread the cells evenly across the culture plate.\nLet the cells grow for 14–16 h.\nPrepare the transfection mixtures in two 1.5 mL tubes as follows: Transfection mixes/ 10 cm culture plate\ntable:files/protocols_protocol_1441_11.csv\nNote: Avoid prolonged exposure of PEI to light sources.\nMix both mixes by pipetting up and down.",
    "Incubate for 5 min at 20°C–25°C.\nAdd the complete DNA mix to the PEI mix drop-wise.\nMix by pipetting up and down. Do not vortex.\nIncubate for 20 min at 20°C–25°C.\nMeanwhile, aspirate the growth medium from the HEK293TN cells and wash once with PBS.\nAdd 5 mL transfection medium (medium supplemented with 2% FBS, no antibiotics).\nAfter incubation is finished, add the transfection mix dropwise to the cells and gently swirl the plates.\nCritical: After this point lentiviruses are being produced and thus cell culture needs to continue in a biosafety level 2 compliant facility.\n8 h after transfection, aspirate transfection medium, wash with PBS and add 6 mL full medium to the cells.\nHarvest the lentiviruses 24 and 48 h after transfection. Troubleshooting 6[href=https://www.wicell.org#sec6.11]\nNote: Virus production peaks at 48 h and then rapidly decreases. Any further harvests would just dilute the virus titer.\nCollect the virus-containing culture medium with a 10 mL syringe.\nFilter the medium through a 0.45 μm filter.\nAfter the second harvest, aliquot the virus in 15 mL tubes.\nDirectly transduce the cells of choice.\nAlternatively, flash-freeze the tubes and keep the viruses at −80°C."
  ],
  "subjectAreas": [
    "Genomics",
    "Sequence Analysis",
    "Bioinformatics",
    "Molecular Biology",
    "Sequencing",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}