{
  "id": 19300,
  "origin_website": "Jove",
  "title": "High-frequency High-resolution Echocardiography: First Evidence on Non-invasive Repeated Measure of Myocardial Strain, Contractility, and Mitral Regurgitation in the Ischemia-reperfused Murine Heart",
  "procedures": [
    "Experimental Protocols\nThe following different protocols were used to establish feasibility of measurements aimed at investigating the IR murine heart non-invasively. Baseline echocardiographic imaging was followed by surgical induction of ischemia-reperfusion (IR, protocol 1) which was followed by echocardiography at multiple time-points during recovery from IR.\nProtocol 1. Left Anterior Descending (LAD) artery IR: Surgical Procedure\nMale C57BL/6 adult mice (8-week old; 24.5±1.5g, mean±SD; Harlan Technologies, IN) were maintained under standard laboratory housing conditions with access to chow and drinking water ad libitum. Mice were anesthetized using intraperitoneal injection of a mixture of ketamine (100 mg/kg) and xylazine (10mg/kg), laid on a warm surgical table, and intubated endotracheally. Proper anesthetic plane for rodents is deduced by a cessation of toe pinch reflexes and a slowing of respiration. Instruments were sterilized via 70% ethanol washes and autoclaving. Any instruments that left the sterile field were inserted into a hot-bead instrument sterilizer for 1 minute before continuing use. The mice were ventilated (Harvard Apparatus, Boston, MA) using air-isoflurane mixture at an appropriate rate and tidal volume. Cardiac electrophysiology was monitored throughout the surgery using a three-lead ECG setup, and changes were recorded using PC Powerlab software (AD Instruments).\nThe heart was accessed via left thoracotomy. The left lung was retracted to allow access to the pericardium. The left auricle was elevated to expose the coronary LAD artery, which was isolated using 7-0 Prolene suture mounted on a tapered needle. The suture was tightened over a piece of PE-10 tubing to induce reversible ischemia. LAD was occluded for 60 minutes. After 60 min, the suture was released to allow for reperfusion of the injured myocardium. Upon successful reperfusion, the thorax was closed with interrupted 7-0 Prolene sutures as well as the skin incision with 5-0 Prolene sutures.",
    "Throughout the surgery, body temperature was maintained at 36.7 ± 0.5°C using a heated surgical table and monitored with a rectal thermal probe. The ischemic-episode causes pale coloration of LV myocardium that can be visually appreciated. Thorax was closed, sutured, and tracheal tube was disconnected enabling the mouse to breathe on its own. The animal was then returned to its cage and placed on a heating block set to 37°C. Once the recovery was complete, the animal was returned to the rodent vivarium unit prior to echocardiographic imaging. All procedures were approved by the Institutional Laboratory Animal Care and Use Committee (ILACUC) of the Ohio State University.\nProtocol 2. M-mode imaging protocol for the determination of cardiac function and detection of wall motion abnormality\nTo assess radial and longitudinal changes in cardiac function and wall motion abnormalities, we performed pre-IR imaging using high frequency, high resolution ultrasound scanner (Visual Sonics Inc., Toronto, Canada). Standard M-mode echocardiography parameters such as wall dimensions, volumes at systole, diastole and stroke volume, ejection fractions (EF), fractional shortening (FS), cardiac output (CO), and internal diameters at systole and diastole, were assessed using in-built M-mode protocol at each time point (pre-IR, day 3 and day 7).\nProtocol 3. VevoStrain Speckle tracking algorithm protocol\nB-mode movies were acquired and subjected to process using in-built  VevoStrain  algorithm to perform strain analyses. This allows assessment of velocity, displacement, strain, and strain rate through separate radio buttons provided in the interface giving interactive plots and M-mode images along with the data values which was done by clicking desired icons in the control panel.\nSpeckle Tracking Assessment of Strains",
    "2-D Grayscale cine loops were acquired in the LV short-axis view at a frame rate of >275 frames/s. For each experiment, at least three consecutive cardiac cycles were recorded and digitally stored on a hard disk for offline analysis on a workstation. We used a speckle-tracking algorithm incorporated into Vevo2100. The strain analysis was performed by the same trained observer. The region of interest was overlaid across a cross section of the ventricle at the image corresponding to the minimal endocardial area. The software algorithm then automatically divided the LV short-axis view into six segments for speckle tracking throughout the cardiac cycle. The tracking quality was then visually inspected, and, if it was satisfactory for at least five segments, the tracing was accepted.\nProtocol 4. Doppler flow measurement protocol\nTo study the mitral valve regurgitation and to calculate the rate of change of LV systolic blood pressure (dP/dt), Doppler flow detection protocol was used. For this purpose, power Doppler blood flow velocity profiles were acquired by placing the probe on the mitral valve regurgitant jet and aortic jet. Imaging of blood flow velocity was followed by measurement to obtain values of the parameters such as peak and mean velocity, peak and mean pressure gradients, velocity time integral, and time. For the computation of dP/dt, mitral valve regurgitant velocity profile was used to measure velocity at early systole (steepest slope of the velocity profile to minimize load dependency) and corresponding time of slope. Finally, Bernoulli s equation provided the velocity-pressure conversion to determine the rate of increase of systolic pressure.\nEchocardiographic Data Acquisition",
    "Mice were imaged in a conscious state at a room temperature of 37°C with decreased ambient lighting while held by an experienced handler in a prone left decubitus position. The heart was imaged in the 2-D mode in the parasternal long- and short-axis views with a depth setting of 1.0 cm and at a frame rate of ≥ 270 frames/s. An M-mode image was obtained at a sweep speed of 200 mm/s. All measurements were done according to guidelines provided by the American Society of Echocardiography.\nImaging was performed in conscious mice along with tandem registration of the electrocardiogram. End systole was defined as the minimum LV area. Segmental Scirc and Srad curves were then constructed by integrating appropriate signals starting from the end-diastolic points and then averaged to obtain average segmental strain curves. End-systolic strains were then obtained from the average strain curve.\nRepresentative Results\nTwo-dimensional movies acquired at high frame rate (8 kHz) were utilized to estimate high-quality myocardial strain. Two-dimensional elastograms (strain images), as well as strain profiles as a function of time helped appreciate the functional consequence of IR.  The above-mentioned approach led to the reliable detection of the following parameters:\nStandard IR Outcomes (commonly reported in the literature)\nleft-ventricular (LV) contraction\n  \ninjury impairs the contraction and relaxation in the heart resulting in functional loss \nchanges in LV chamber area and mass (hypertrophy)\nLV relaxation of isovolumetric phases of both pre-IR and post-IR of beating hearts \ncompromised sector-wise wall motion \nturbulence in blood flow pattern as revealed by the color Doppler movies and velocity profiles\nLV shape changes towards sphericity\ncompromised ejection fraction\nattenuated fractional shortening\nUnique post-IR Outcomes\n(never before reported in a murine IR setting but known to be of clinical significance in humans)\neffective regurgitant orifice (ERO)\na fundamental measure of valvular incompetence",
    "decreased myocardial strains (circumferential as well as radial)\n  \na fundamental measure of myocardial strength and anatomical deformation \nasynchrony in LV sectors\n  \na fundamental measure of inherent periodic pumping characteristics of the heart \nwall motion and symmetry\nchanges in magnitude and direction of vectors demonstrating magnitude, direction and  symmetry at the affected site\ndimension of mitral valve and aorta\nchanges in internal diameters of mitral valve orifice and aorta\nmitral regurgitation\nback flow of blood from LV to left atrium due to incomplete closure of mitral leaflets\nsector-wise changes in magnitude of the radial (Srad) and circumferential (Scir) strain \nchanges in strain rates along with the marked variation in their changing patterns relative to pre-IR data \nsynchronicity of LV sectors as divided according to the American Society of Echocardiography\nassociation of ventricular mechanical synchronicity with the myocardial stiffness and decreased myocardial strength as assessed by tissue Doppler and strain imaging\nchanges in magnitude and direction of vectors shown in movies depicting compromised movement (slow and asymmetric) of the IR-affected site\ninternal diameters of mitral valve orifice and aorta\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig1.1.jpgFig. 1i. myocardial strain measurement: end-diastole full relaxation shown by shortest vectors (M1)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig1.2.jpgFig. 1ii. myocardial strain measurement: LV is contracting shown by length and direction of vectors, the injury site (green point) has limited contraction (M2)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig1.3.jpgFig. 1iii. myocardial strain measurement: end-systole, full contraction shown by shortest vectors (M3)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig1.4.jpgFig. 1iv. myocardial strain measurement: long axis at diastole (M4)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig1.5.jpgFig. 1v. myocardial radial strain (Srad) measurement: the color coded curves represent the strain at respective colored points in images of Fig1.i-iv (M5)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig1.6.jpgFig. 1vi. myocardial circumferential strain (Scir) measurement: the color coded curves represent the strain at respective colored points in images of Fig1.i-iv (M6)",
    "Figure 1. B-mode movies visualizing end-diastole (ED) and end-systole (ES) and changes in LV chamber size post-IR. B-mode images to determine left ventricular (LV) circumferential strain (Scirc) and radial strain (Srad) by two-dimensional speckle tracking echocardiography.\nVevoStrain speckle tracking algorithm to observe vectors depicting the magnitude and direction of the motion of myocardium, axial and parasternal long axis views demonstrating the vectors at the injury site of the impaired myocardium.\nRadial and longitudinal strains on a baseline mouse and a mouse post IR day7. The color coded strain profiles showing different color coded points in sites on the myocardium of baseline (pre-IR) and treated (post-IR, day7) hearts. LV-left ventricle, RV-right ventricle, Srad-radial strain, Scir-circumferential strain.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig2.jpgFigure 2. Myocardial sectoral synchronicity. Analyses based on the strain data pre- and post-IR. LV divided into six sectors (1 = posterior basal, 4 = anterior basal, 2 = posterior mid, 5 = anterior mid, 3 = posterior apex, 6 = anterior apex) according to American Society of Echocardiography. Validation of ventricular mechanical synchrony to see its association with myocardial stiffness as assessed by tissue Doppler and strain imaging.\nColor coded image panel showing the sectors from 1-6 with values for time to peak on the corresponding sectors in milliseconds. Radial and longitudinal synchronicities provided for pre-IR and post-IR in terms of graphs. The colors on the graphs correspond to colors of the corresponding sectors.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig3.1.jpgFig. 3i. anatomical measurements: mitral regurgitation orifice diameter in mice heart (blue lines with repeated measurements), sample volume in aorta (yellow lines) (M8)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig3.2.jpgFig. 3ii. regurgitant flow profiles in mouse heart, upper forward and lower backward flow at mitral valve (M9)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig3.3.jpgFig. 3iii. aortic out flow velocity profiles in mouse heart (M10)",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig3.4.jpgFig. 3iv. regurgitant orifice at mitral Valve, Ao = aorta, LA = left atrium, LV = left ventricle, r = radius (M11)\nFigure 3. Mitral valve V regurgitant fraction (RF).\nEchocardiographic image panel for the measurement of regurgitant fraction (RF). Measurement of aortic diameter (AoD) and mitral valve orifice diameter (MVD) showing placement of the sample volume in the regurgitant jet and aorta. These measurements provide the regurgitant velocity profiles and ascending aortic flow in which velocity profiles above and below baseline indicate forward and backward blood flow to the LV and back to left atrium. RF (in %) computation using the formula, RF = MV CSA*VTI of MV jet at diastole - Ao CSA*VTI of Ao jet at systole)*100 / MV CSA*VTI of MV.\nQuantification of regurgitant fraction showing the regurgitant fraction in post-IR mice indicator to regurgitated mitral valve. Changes in mitral valve effective regurgitant orifice (ERO) post-IR due to sphericity of LV. Representative color Doppler images depicting the blood flowing from left atrium to the LV. Enlarged blood flow orifice indicates turbulent flow and increased abnormal flow velocity. ERO indicating valvular incompetence. The flow velocity aliased. The pulsed wave is utilized as to benefit in determining transitions from laminar to turbulent flow. ERO computed using the formula, ERO = Flow/Vmax = 2 π r2 Va /Vmax, Va = Aliasing velocity, r = orifice radius, Vmax = maximum velocity.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig4.1.jpgFig. 4i. measurement of functional parameters in pre-IR mouse. Soft ware calculates parameters by tracing, red vertical line = diastole, green vertical line systole (M12)\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig4.2.jpgFig. 4ii. measurement of functional parameters in post-IR mouse. Soft ware calculates parameters by tracing, red vertical line = diastole, green vertical line systole (M13)",
    "Figure 4. The rate of change of ventricular systolic pressure (dP/dt): pre- and post-IR.Correlation of ejection fraction (EF) with dP/dt. Image panel showing an M-mode from which the basic functional measurements are taken.\nThe discrimination of heart contractility over time; bar graphs showing dP/dt post-IR. Indicating measurement of one parameter gives clinical information to the other.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig5.jpgFigure 5. Short axis movie demonstrating pre-IR strain measurement.\nEchocardiographic movie obtained from the parasternal view of heart to visualize the morphology in the mouse heart pre-IR.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig6.jpgFigure 6. Short axis movie demonstrating post-IR LV strain measurement\nRepresentative axial movie of a mouse LV traced to endocardium demonstrating the tissue strain vectors with five specific points in measurement considered.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1781/1781fig7.jpgFigure 7. Parasternal long-axis color Doppler movie\nColor Doppler flow movie demonstrating the blood pumped in from left atrium through mitral valve into the LV during diastole and the blood is pumped out through the aorta during systole phase of the heart with the direction of flow blue color away and red color towards (BART) the ultrasound probe."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}