{
  "id": 16366,
  "origin_website": "Jove",
  "title": "Simple In-House Ultra-High Performance Capillary Column Manufacturing with the FlashPack Approach",
  "procedures": [
    "The packing protocol consists of five steps (Figure 1): 1) Packing station preparation, 2) capillary preparation, 3) sorbent slurry preparation, 4) capillary packing in the pressure bomb, and 5) column packing-up in the HPLC system, cutting up to the size and UHPLC connection installation. The FlashPack optimization requires adjustments to be made in sections 3 and 4 as compared to the common protocol.\n1. Packing station assembly\nPrepare a gas tank filled with either nitrogen, helium or argon furnished with a single stage gas regulator with the outlet pressure > 50 bars. Maximum pressure is limited by the pressure bomb compatibility.\nConnect the regulator to the vent valve of the pressure bomb.\nIf the pressure bomb is not equipped with an integrated magnetic stirrer, place the bomb on a magnetic stirrer.\nConnect a narrow ID plastic tubing (e.g., 0.13 mm) to the vent outlet of the pressure bomb and put it into a vessel with water.\n2. Capillary preparation\nPrepare a fritted capillary with an integrated glass frit formed from Kasil and formamide15 or a pulled emitter capillary prepared by a laser puller16. The capillary is made 10-15 cm longer than the intended column length.\n\tNOTE: See Table 1 for the discussion of possible issues associated with different capillary sizes and frit types. Table 2 contains an example of a P2000 laser puller program for making pulled-emitter capillaries.\nProtect a pulled emitter end with a cut gel-loading pipette tip.\n\t\nCut the tip so it fits tightly around the 360 μm OD capillary (it can be moved along the capillary but requires some effort to do that).\nSlide the cut pipette tip onto the capillary from the direction of the capillary front end and move it up to the emitter end.",
    "Slide back the protecting tip when the column is spraying. Slide the tip forward to have the emitter end inside the tip when the column is not spraying (even when the column is under the flow, but still not spraying).\n3. Sorbent slurry preparation\nPrepare a stock sorbent vial: Place ~50 mg of dry sorbent into a 1.5 mL centrifuge tube. Here, Reprosil Pur C18 is used as an example.\nAdd 1 mL of methanol to the sorbent tube.\nTo mix it completely, vortex the tube for 10 s using a vortex mixer.\nSonicate in a sonication bath for 10 s.\nLet the sorbent get soaked thoroughly for 20-30 min. Then, vortex and sonicate it once more.\nPrepare a working sorbent vial. Use a conical bottom vial which fits into the bomb.\n\tNOTE: It can be either another 1.5 mL centrifuge tube or any other vial depending on the particular pressure bomb design. For this experiment, conical bottom screw cap tube cut to the height of the pressure bomb is used.\nResuspend the sorbent in the stock sorbent vial and transfer 500 µL into the working sorbent vial with a magnet bar of 2 x 3 mm size.\nAdd methanol up to ~1 mL to the working vial.\nLet the working vial stand on the table for 10 min for the sorbent to settle by gravity.\nIf, after settling, the sorbent layer is below 4 mm, add more of the stock sorbent slurry and wait for the sorbent to settle for another 10 min.",
    "​NOTE: The prepared working vial is intended for preparation of multiple columns over months. If the working sorbent vial stays without stirring for more than 2 h, it must be vortexed for 10 s, sonicated for 10 s and settled by gravity. Routinely, the sorbent is resuspended in the morning before packing. Then, it is good for packing for the whole day if there are no long pauses between sequential column packing. If the sorbent in the working vial dries out, add methanol, and run the full sorbent preparation procedure as for the stock sorbent vial (steps 3.2-3.5).\n4. Capillary packing in a pressure bomb\nCAUTION: Always wear protective glasses when working with the pressure bomb. Do not wear gloves. These severely reduce the sense of touch required for proper handling of small diameter capillaries and lead to mistakes.\nPlace the sorbent vial into the pressure bomb and fix all the nuts tightly.\nStart the rotation at 60-100 rpm.\nInsert the fritted or pulled emitter capillary into the bomb: push it to the very bottom of the vial, and then lift it up 2-3 mm and fix the nut.\n\tNOTE: Apply a minimum required force to fix the capillary to avoid capillary and ferrule damage. The best is hand-tightening. If a hex-wrench is used, apply minimum sufficient effort for tightening.\nCheck whether the capillary is properly fixed-it must be impossible to move the capillary by pulling it out by hand.\nVery slowly open the pressure bomb valve while keeping the open end of the capillary pointed away from your face.\nWatch the initial steps of the packing process.",
    "NOTE: Immediately upon pressurization, the sorbent fills the capillary and it becomes non-transparent for the whole length. As soon as the sorbent starts to pack inside the distal end, the backpressure increases, the flow slows down and the even sorbent slurry inside the capillary reforms into several sorbent packets separated by sorbent-free gaps. Already packed sorbent is visible as a densely colored continuously growing region.\nKeep the sorbent filled regions to be at least 70% of the capillary length with small sorbent free gaps for the whole duration of the packing process.\nThere are several common issues to watch during the packing process, that require on-the-flight setup adjustment to keep efficient sorbent delivery into the capillary.\n\tNOTE: More details on the sorbent-delivery efficiency adjustment are described in Table 3.\n\t\nIssue 1: When new sorbent stops entering the capillary while the sorbent already inside keeps moving, follow the steps below.\n\t\tNOTE: This is the most frequent issue. In most cases the capillary entrance gets blocked by self-aggregating sorbent clusters. Apply the following steps one by one until the sorbent flow is restored, and then skip the rest of the issue-related steps.\n\t\t\nIncrease the rotation speed to 500 rpm and immediately reduce it back to 60-100 rpm. Usually, it restores the sorbent flow. Check the rotation speed to be at least 60 rpm for the rest of the packing process.\nIf it does not help, briefly vent the packing bomb and immediately pressurize it back.",
    "If it does not help or the blocking happens again, reposition the capillary inside the sorbent layer. The absence of the sorbent can be due to the capillary open end being either too high above the magnet bar, so the column end does not touch it, or the capillary sticking into the vial bottom. First, vent the bomb completely, loosen the nut, push the capillary to the bottom, and then pull it 2 mm back. Fix the nut.\nIf the blocking persists, vent the system, take out the sorbent vial and vortex and sonicate it once more. Check the capillary frontal end for damage under the microscope and cut ~5 mm of the front end if needed.\nIssue 2: When the sorbent fills only a small part of the capillary with long empty regions, follow the steps below.\n\t\t\nCheck the rotation speed. If the rotation is too slow, the cupola breaking is not efficient enough. Increase the rotation speed to ~150 rpm.\nIf the rotation is too fast, the sorbent gets resuspended into the larger vial volume and the local sorbent concentration around the column entrance is low. Slow the rotation speed down to 60-100 RPM.\nCheck the sorbent level. The same issue with little sorbent inside the capillary is observed when there is not enough sorbent in the vial. When the sorbent gets used up, fill the vial with the new sorbent to keep the sorbent layer no less than 4 mm high after gravity-induced settling.\nKeep on packing the column till the target column length plus 5-7 cm is achieved.\nStop the rotation and very slowly depressurize the bomb.",
    "Open the bomb valve a little and wait for the bubble burst inside the water bottle to subside. Then, open the valve a little wider and again wait for the bubble burst to slow down.\nRelease the pressure in increments until no gas comes out of the valve.\n\t\tNOTE: Do not open the valve all the way at once - it will lead to bubbling inside the capillary and the sorbent going back into the vial. If that happens, pressurize the bomb back and wait for the column to get packed again.\nWhen the gas stops coming out of the vent valve, take the packed capillary out of the pressure bomb.\n\tNOTE: Do not let the column dry out. If not connected to the HPLC system immediately for further packing, put the packed capillary into storage by submerging it whole into 10% EtOH solution. A liquid-tight polypropylene food storage container can be used for capillary storage. Disconnected HPLC columns are stored in the same manner.\nIf no further packing is planned, take out the sorbent vial from the bomb and close it tightly. Keep it for further column packing.\n5. Packing in the HPLC column\nConnect the packed capillary to the HPLC system via an HPLC connection.\nStart the flow at 95% solvent B (80 or 100% acetonitrile, 0.1% formic acid (FA)) targeting 250-300 bar pressure. For 40 cm packed capillary, use the flow rate of 200-300 nL/min.",
    "NOTE: The packing flow rate is 200 nL/min for 40-50 cm column with 100 µm ID packed with 2 µm sorbent. Some other column sizes are listed in Table 4. Flow rates for other column lengths and IDs are estimated from the direct proportionality between the backpressure and the column length and cross-section. The exact flow-rate is adjusted to the actual packed length, which is by default longer than the targeted column length. Also note, that the 300 bar pressure targets the physical pressure limit of the HPLC connection. For higher-pressure connections, higher flow-rates up to the connection pressure limit are to be used for faster packing.\nWatch for the loose sorbent inside the capillary getting packed and getting added to the total packed length.\nWithout stopping the flow, dip the column body two times into the sonication bath.\n\tNOTE: Do not immerse column ends and capillary connections-only a part of the column body. Sonication step helps to improve column reproducibility, especially for extremely long columns >50 cm long (unpublished data); however, it adds a random chance of breaking the self-assembling sorbent frit inside the emitter end of the pulled emitter capillary and blocking the column completely. While sonication can be universally applied to any glass-fritted columns, we suggest sonicating pulled emitter columns only for the column length > 50 cm.\nWhen the sorbent bed stops shrinking, dip the column body into the sonication bath two times more without stopping the flow.\nRun the column for an additional 10 min at 300 bars.\nStop the flow, wait for the pressure to drop to below three bars, and disconnect the column.\nVisually inspect the column for the lack of gaps and discolorations. If any are found, sonication under the flow can be repeated. For critical experiments, consider making a new column.",
    "Cut the column to the desired length.\n\tNOTE: Properly done cutting is a prerequisite for column efficiency. Make a notch in polyimide coating with the scribe, partially crack the capillary and pull two pieces apart.\nPolish the column front end on a ceramic wafer or with lapping film.\nReconnect the column to the LC system using a UHPLC connection.\nStart the working flow rate at 2% B depending on the column ID according to Table 4. Wait for the pressure to equilibrate and check the column backpressure.\n\tNOTE: The working flow rate is adjusted according to column parameters. For instance, a 30 cm long 100 µm ID column is run at 500 nL/min.\nEnsure that the backpressure is within 5% of the expected value (see Table 5), This confirms that the column is packed properly and is ready to use.\n\tNOTE: The column backpressure is the total pressure in the gradient channel of the HPLC system with the column connected minus the backpressure of the capillaries before the column. At the same time, the values in Table 5 are arbitrary (they give an arbitrary scale of what to expect). The intra-laboratory similarity of the backpressure from column to column is a more important indicator that everything works properly. The actual absolute backpressure depends on many parameters, such as the sorbent size and characteristics, the capillary ID, manufacturer and batch, the shape of the pulled emitter end or the density and length of the glass frit, the solvent characteristics and the ambient temperature in the room, etc. If the backpressure is too high, see Table 1 for possible issues."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}