{
  "id": 5921,
  "origin_website": "Bio",
  "title": "Micro-computed Tomography to Visualize Vascular Networks in Maize Stems",
  "procedures": [
    "Sample fixation and staining with contrasting reagentsMaize stem dissection and fixationGrow maize plants for 6-8 weeks. Our growth condition is at 26 °C under 14-h-light and 10-h-dark condition in the green house. At 6 weeks, the floral transition of the shoot apical meristem has already occurred and the tassel primordium is developing.Dissect maize shoot into ~10 cm long sections (Figure 2). Make sure to include the shoot apex in this region. As internodes become shorter toward the apex, we can assume the approximate position of the shoot apex.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195131_1948.jpgFigure 2. A maize stem sample fixed in FAAPut the sample into a 50 ml conical tube and fill the tube with FAA solution (see Recipes).Slowly vacuum the sample until small air bubbles begin to come out from the samples, then seal the chamber. After 15 min, slowly release the vacuum pressure.After releasing the vacuum, replace the solution with new FAA. Vacuum the sample for 15 min again.Replace the solution with new FAA and store the sample at 4 °C for at least 1 week. g. Replace FAA with 70% EtOH and rotate the sample tube at 4 °C for 3 h. Replace 70% EtOH with new 70% EtOH. Store the sample in 70% EtOH at 4 °C until observation.Note: FAA and 70% EtOH containing formaldehyde must be disposed of according to regulations of your institute/university and local governments.Sample staining with contrasting reagentsReplace 70% EtOH with 35% EtOH and incubate for 2 h at room temperature.Discard 35% EtOH and incubate the samples in distilled water at room temperature for 1.5 h. Repeat this step two more times with fresh distilled water. Replace the water with 25% Lugol solution (see Recipes) and vacuum for 15 min. Stain the sample for 6 days at room temperature in the dark.",
    "Note: Staining duration depends on the type of tissues and their size. Check the staining before detailed observation (please see Step C2). For maize stems, it takes 6 days (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195232_5985.jpgFigure 3. Time-course observation of a maize stem stained with Lugol solution. A maize stem stained in 25% Lugol solution for 1 day (A), 2 days (B), 4 days (C) and 6 days (D) was scanned using micro-CT. These images were processed and displayed in OsiriX. Scale bar = 5 mm.Mounting samplesPlace wet Kimwipes and filter foams at the bottom of 50 ml conical tube.Put the stained maize stem in the center of the tube. Make sure to insert the sample so that the lower side of the sample comes to the bottom of the tube (Figure 4A).Notes:  Softwares used in the downstream data analysis (OsiriX and Imaris) display the imported data upside down. To avoid cumbersome data processing to correct this, we simply mount the samples upside down.As Lugol staining is rapidly released from tissue into water, just remove excess solution with paper towels. Do not rinse the sample with water. Samples will be rotated on the stage in micro-CT equipment during the data acquisition. It is important to place samples in the center of the stage to obtain high resolution images.Place filter foams and wet Kimwipes on the other end of the sample and close the tube.Note: Maize stems become softer after Lugol staining. Handle the sample gently to avoid deformation. At the same time, make sure to place enough wet Kimwipes and filter foams so that the sample doesn’t move in the tube. The movement of samples during data acquisition will result in a blurred image. Also, moisture in the tube is important to avoid sample drying and deformation.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195422_5553.jpgFigure 4. Mounting a maize stem for micro-CT scanning.",
    "A. The stained maize stem was mounted in a 50 ml polypropylene tube using wet Kimwipes and filter foams. B. The tube was attached on the stage in micro-CT scanner with a piece of clay.Data acquisitionPut a piece of clay on the sample stage in the micro-CT equipment and fix the sample tube tightly on the clay (Figure 4B).Set the voltage at 90 kV and the current at 85 µA. Close the door of the equipment and turn on the X-ray. Now you can see the sample displayed in the fluoroscopic image monitor. To make the stem inner structure visible in the monitor, narrow down the luminance window of the fluoroscopic image. If the sample is stained enough, you can see the conical shape of the shoot apex in the monitor at this point (Figure 5). Determine the position of the shoot apex.Check the sample by rotating the stage. Adjust the tube angle so that the sample stands upside down in the center at a right angle to the stage (Figure 5A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195543_9235.jpgFigure 5. X-ray fluoroscopic imaging before scanning. A. The stem sample mounted on the stage. Note that the stem sample is upside down. A yellow box represents region magnified in (B). B. A magnification of the boxed region in (A). Dashed lines and circle depict a young stem and tassel primordium, respectively. The image was rotated 180° from (A).Return the luminance window to its full range.Note: We adjusted the luminance window just to make the sample visible on the monitor. In data acquisition, the luminance window should be the full range.Determine the scanning area and set scanning parameters (e.g., Table S1[href=https://os.bio-protocol.org/attached/file/20171222/Supplemental file Table S1 Table S2 updated.docx]) depending on the purpose of your experiment. It is a trade-off between data acquisition area and resolution as shown in (Figure 6).",
    "imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195713_2682.jpgFigure 6. Maize stem images scanned using micro-CT at various resolution. A. A vertical section of the stem. Dashed boxes (c) (d) and (e) represent the magnified regions in (C), (D) and (E), respectively. B-E. Transverse sections of the stem. The resolutions are 67.7, 30.0, 17.0 and 10.0 µm/pixel in (A and B), (C), (D) and (E), respectively. The detailed settings in the scanning are provided in Table S1[href=https://os.bio-protocol.org/attached/file/20171222/Supplemental file Table S1 Table S2 updated.docx].Scan the samples.Note: When the sample size is larger than the area of data acquisition, the surrounding tissue outside of the field of view causes various noise (Figure 6E). If higher resolution is necessary, trimming the sample to remove surrounding tissue/organs will reduce noise in the data (see below).If necessary, remove leaves and stems to expose the part of your interest. To mount smaller samples, we use micro-tubes of appropriate size. Put wet Kimwipes and filter foams to fix the sample inside of the tube (Figure 7).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195831_5121.jpgFigure 7. Mounting trimmed maize stems in 1.5 ml tubes. A. Tenth and eleventh leaves from the tassel were removed from the stem sample shown in Figure 2. B. Ninth and eighth leaves were further removed. C. Diagrams showing the trimmed maize stem mounted in 1.5 ml tubes. Red arrows indicate supporting points of samples.Scan the samples with the setting for higher resolution (Table S2[href=https://os.bio-protocol.org/attached/file/20171222/Supplemental file Table S1 Table S2 updated.docx]). Figure 8 shows that trimming the samples greatly reduces the noise and enables to increase the resolution.Note: The resolution of micro-CT images could be further improved by increasing frame average and number of projections (and hence, scanning time as well) (Table S2[href=https://os.bio-protocol.org/attached/file/20171222/Supplemental file Table S1 Table S2 updated.docx] and Figure 9).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101195935_6631.jpgFigure 8. Micro-CT images at improved resolution achieved by trimming samples. A, C and E.",
    "Transverse sections of untrimmed (A) and trimmed (C and E) stem. B, D and F. Longitudinal sections of untrimmed (B) and trimmed (D and F) stem. Dashed green lines represent planes shown in transverse sections. Stem samples in Figures 2, 7A and 7B correspond to the micro-CT images in (A and B), (C and D) and (E and F), respectively. Scale bars = 1 mm.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101200013_8435.jpgFigure 9. Micro-CT images at further improved resolutions achieved by increasing frame average and number of projections. Micro-CT images of the maize shoot apex scanned for 9.5 min (A-C) and 26 min (D-E). A, B, D and E. Transverse sections. C and F. Longitudinal sections. Note that provascular bundles enclosed by yellow dashed lines became more distinguishable in (D-E) compared to (A-C). Green lines (a), (b), (d) and (e) represent the plane of transverse sections shown in (A), (B), (D) and (E), respectively. The detailed settings of frame average and number of projections are shown in Table S2[href=https://os.bio-protocol.org/attached/file/20171222/Supplemental file Table S1 Table S2 updated.docx]. Scale bars = 1 mm.The raw data will be saved as .raw files. Import the raw data into a built-in reconstruction software in the micro-CT system (e.g., coneCTexpress). Trim blank spaces, determine axes for coronal/sagittal sections, reduce noises using the noise reduction filter and convert the raw data into 8-bit Tiff images. Save the reconstructed Tiff image dataset.Note: To compare multiple samples, a uniform setting in this step will be important.Before importing the Tiff files into an image analysis software OsiriX, we rename them as following: Date_sample_resolution (µm)_number.tiff. This is important so that the image files are read by OsiriX in the correct order.Constructing scanning movie from micro-CT dataHere, we introduce how to make a scanning movie using the software OsiriX to explore the micro-CT data (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1.",
    "A 2D movie showing transverse sections of a maize stem. Green bars represent the plane shown in the transverse window. Structural annotations were added using Adobe Premiere Pro CC.To import Tiff image data, disable ‘Import DICOM file format only’ option in the preferences of OsiriX. (Top Menu ‘OsiriX MD’ → ‘Preferences’ → ‘Database’ icon → ‘File Management window’ → uncheck the box of ‘Import DICOM file format only’.)Import Tiff images. (‘Import’ icon → Select the data folder. → ‘Copy Links’)To display the imported data, select the data file shown in ‘Documents DB window’ and click ‘2D Viewer’ icon. Then, select ‘3D Volume Rendering’ from the ‘3D Viewer’ in the top menu and enter resolution information in the fields of pixel X, Y and slice interval (Figure 10A). Notes:  If OsiriX gives an error message, click ‘Continue’.The unit of the resolution is mm/pixel. Convert the resolution in µm/pixel into mm/pixel (e.g., 30 µm/pixel → 0.030 mm/pixel).After clicking ‘OK’, a new window will open. Close this window.At this point, ‘Orientation’ icon has become active (Figure 10B). Now we can set the direction of 2D sections shown in the display using this icon and explore the sections using the slider located on the upper side of the 2D window.Open additional two windows by clicking ‘Window’ icon and selecting ‘3 window’ (Figure 10C). Enter the resolution information for these two windows as described in the Steps D3 and D4. Display coronal, sagittal and transverse sections in each window using ‘Orientation’ icon (Figures 10B and 9D). Select settings for window appearance using ‘WL/WW & CLUT’ and ‘Thick Slab’ functions.",
    "Our setting is below:WL/WW & CLUT (Figure 10E (a))WL/WW (window level/window width): OtherCLUT (color look up table): B/W InverseOpacity: Linear TableThick Slab (Figure 10E (b))Mode: MIPSlider: 5Adjust image WL/WW, position, magnification and angle in the window using tools shown in Figure 10E (c), (d), (e) and (f), respectively.To adjust size and arrangement of each window for the movie preparation, disable ‘Magnetic Windows for move & resize’. (Top Menu ‘OsiriX MD’ → ‘Preferences’ → ‘Viewers’ icon → uncheck ‘Magnetic Windows for move & resize’.) Adjust size and arrangement of windows (e.g., Figure 10F). Also, you can change the magnification of sections in each window using icon shown in Figure 10E (e).Export a movie file. (Select a window of transverse sections → ‘Movie Export’ icon → Set the data area exported as a movie and check the box of ‘Include all displayed 2D viewers’ (Figure 10G). Select the directory, set the format and frame rate. → Save the movie. Note: As default, ‘Basic’ option is selected in ‘Annotations’ function area and various information about source data will be displayed in the 2D windows. You can disable this setting by checking ‘Graphic’.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101211555_4889.jpgFigure 10. Movie preparation of the maize stem micro-CT data using OsiriX for easy observation. Magenta boxes and circles highlight icons, check boxes and numeric input fields selected in each step. A. A window to set the resolution; B. Orientation icons; C. Window icon to select ‘3 windows’; D. Three windows displaying different sections of the same sample. Left, middle and right windows display coronal, sagittal and transverse sections, respectively. E. Tools and icons used to modify window appearances. (a) WL/WW & CLUT, (b) Thick slab, (c) WL/WW, (d) position, (e) magnification and (f) angle. F. Arranged and resized windows to produce a movie.",
    "Note that the red-framed window displaying transverse sections is selected and active. Green bars in coronal and sagittal windows represent planes shown in transverse sections. G. A window to set parameters to export a movie.Creating 3D model of maize stem vascular networksHere, we extract vein traces and reconstruct vascular networks in maize stems using Imaris, a software which can be used in various analysis of 3D data including the extraction of filamentous structure such as veins. As this procedure includes many steps of manual operation, we provide videos to explain how to determine vein traces in 3D data (Videos 2 and 3).Preparation of a 3D model of the maize stem in ImarisImport the sequential Tiff data into Imaris (Top Menu ‘Surpass’ icon → ‘File’ → ‘open’ → Select the first Tiff image in the data folder. → ‘Open’. Video 2: 0~10 sec).Enter the scale information (Top menu ‘Edit’ → ‘Image Properties’ → ‘Geometry’ (Figure 11A) → Enter the resolution (µm/pixel) → ‘OK’ → The 3D object often becomes very small after entering the resolution. Resize and fit the object to the window using ‘Fit’ icon at the bottom of the screen. Video 2: 12~27 sec).Change the model color. We selected white in this example. (Top menu ‘Edit’ → ‘Show Display Adjustment’ → ‘Channel 1’ (Figure 11B) → ‘Base color’ tab (Figure 11C) → Select color. Video 2: 33~38 sec).Change the model size and angle. (Video 2: 38~43 sec)Note: You can rotate, move and enlarge/reduce the imported 3D model using left-dragging, right-dragging and wheeling actions of your computer mouse, respectively.Crop 3D model to determine the data area analyzed. In this example, we cropped the stem into a quarter cylinder (‘Setting’ tab (Figure 11D) → ‘Blend’ → Top menu ‘Edit’ → ‘Crop 3D’ → Crop the 3D model (Figure 11E). → ‘OK’.",
    "Video 2: 44 sec~1 min 13 sec).Save the cropped 3D model. (Top menu ‘Export’ icon → Enter file name → ‘Save’. Video 2: 1 min 14 sec~1 min 35 sec).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101211833_5268.jpgFigure 11. Preparation of a 3D model of the maize stem in Imaris. Magenta boxes highlight icons, check boxes and numeric input fields selected in each step. A. Geometry window to set resolution; B. Display adjustment window; C. Color selection window; D. Setting tab in the property area of the selected volume object; E. Crop 3D window.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. A movie introducing procedures to prepare the maize stem 3D model in Imaris Tracing veins to create 3D model of vascular networksVein traces are the combination of relatively straight lines in internodes and winding lines in nodes. To make a vein trace from the micro-CT data, we divide a vein into a few segments depending on the position (internode or node), extract them independently and join them into a single trace.Change settings of FilamentTracer to extract veins manually (Top menu ‘3D view’ icon → ‘Filament’ icon (Figure 12A) → Click ‘Skip automatic creation, edit manually’ (Figure 12B) → ‘Draw’ tab → Check ‘Manual’, ‘Automatic Placement’ and ‘XZ Plane’ (magenta boxes in Figure 12C). Video 3: 0~14 sec).Note: Setting ‘XZ Plane’ is to extract a vertical segment of a vein in internodes in the Step E2d.As default, the volume object shown as ‘Volume’ in the object list area is selected. To display slices of the XZ plane, uncheck ‘Volume’, otherwise the slices hide behind the volume object. Determine a vein to be traced using the slider (the bottom magenta box in Figure 12C and Video 3: 15~24 sec).",
    "Before starting to trace a vein, check ‘Select’ in ‘Camera/Labels’ window and then adjust the line width to that of the vein by wheeling the computer mouse. The size of square around the mouse pointer represents the line width. (The magenta box in Figure 12D and Video 3: 26~31 sec).Note: This step is important for Imaris to recognize a vein efficiently based on the brightness of the 3D data.Manually trace a segment of the vein in an internode. (Check ‘Select’ in ‘Camera/Labels’ window (the magenta box in Figure 12D) → Trace the vein by left-dragging while pressing ‘Shift’ key. Video 3: 32~43 sec).Edit the width and color of the traced line (Line width: ‘Filament’ tab → ‘cylinder’ → Enter the width (Figure 12E, e.g., 150). Line color: ‘Color’ tab → ‘Base’ → Change the color (Figure 12F). Video 3: 44~55 sec).Correct the traced line based on the brightness of the 3D data (‘Edit’ tab → ‘Segment’ → Click and select the traced line. (The line color will be yellow.) → ‘Center’ (Magenta boxes in Figure 12G). Video 3: 56 sec~1 min 04 sec).Manually trace a segment of the vein running horizontally in the node (‘Draw’ tab → Check ‘Manual’ and ‘Automatic Placement’ and ‘XY Plane’ (a blue box in Figure 12C) → Confirm the start and end of the segment of the vein in the node using a slider (Figure 12C and 12H). → Trace the segment and edit the line as described in Steps E2c-E2f. Video 3: 1 min 05 sec ~1 min 55 sec).Manually trace a segment of the vein in the lower internode as described in Steps E2c-E2f (Video 3: 1 min 58 sec~2 min 18 sec).",
    "Join the upper two segments (‘Camela/Labels’ window → Check ‘Navigate’ (A blue box in Figure 12D) → Enlarge the joint between upper two segments → Check ‘Select’ in ‘Camera/Labels’ window (a magenta box in Figure 12D). → ‘Edit’ tab (blue boxes in Figure 12G) → ‘Point’ → While pressing ‘Ctrl’ key, click the lower end of the upper segment and the upper end of the lower segment. Then both ends turn into yellow. → ‘Join’ → Click a blue joint point. → ‘Delete’ → Click newly formed ends while pressing ‘Ctrl’ key. → ‘Join’. Video 3: 2 min 19 sec~2 min 42 sec).Join the lower two segments as described in the Step E2i. (Video 3: 2 min 42 sec~3 min 00 sec).Correct the whole vein trace based on the brightness of the 3D data as described in the Step E2f (Video 3: 3 min 05 sec~3 min 14 sec).Repeat Steps E2c-E2k to extract traces of other veins. An example of the extracted vein network is shown in Figure 12I.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180101/20180101212044_4440.jpgFigure 12. Tracing veins to create 3D model of vascular networks. Magenta boxes and circles highlight icons, check boxes and numeric input fields selected in each step. Blue boxes indicate those used in later steps. A. Filament icon; B. A button to skip automatic creation in the creation wizard window; C. Draw tab; D. Camera/Labels window; E. Setting tab; F. Color tab; G. Edit tab; H. Confirming the start and end of the segment running horizontally in the node. Top, middle and bottom panels represent the start, middle and end of the segment, respectively. Arrows indicate the vein to be traced shown in the node slices. I. A vascular network extracted from the micro-CT data of the maize stem.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3.",
    "A movie introducing procedures to extract vascular networks in the maize stem"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}