{
  "id": 9236,
  "origin_website": "Jove",
  "title": "Unilateral Pyramidotomy of the Corticospinal Tract in Rats for Assessment of Neuroplasticity-inducing Therapies",
  "procedures": [
    "Ethics statement: All procedures were in accordance with guidelines from the UK Home Office and Animals (Scientific Procedures) Act of 1986.\n1. Surgery and Injury\nNOTE: Using rats heavier than 220 g can help with postoperative recovery if the surgeon finds animals often lose more than 10% of their preoperative body weight.\nBefore surgery, test the animals for their forepaw preference with the cylinder rearing test 15 or the Montoya staicase test 24. Preferably, cut the pyramid/ the CST corresponding to the dominant forepaw.\n\tNOTE:  For two days prior to surgery, place the following items into the cages, so that the rats become familiar with food items that will be beneficial during recovery from surgery: hydrogel packs, wet mash, and high caloric food supplements. Sterile versions of these food supplements are available from various vendors.\nAnesthetize female Lister hooded rats (weighing between 200 and 250 g) with isoflurane (5% for induction and 1 to 2% for maintenance) in oxygen (flow-rate: 1.5 L/min).  NOTE: The choice of anesthetic is important. Inhalation anesthetic allows for faster regulation of the depth of anesthesia than ketamine, which is also commonly used. Isoflurane allows for better control of the breathing frequency and depth. The choice of anesthetic is isoflurane. NOTE: Using rats heavier than 220 g can help with postoperative recovery if the surgeon finds animals often lose more than 10% of their preoperative body weight.\nAdminister Carprofen subcutaneously as an analgesic when the animals are anaesthetized to reduce inflammation and to provide analgesia. Note: Carprofen is given during pyramidotomy surgery in our laboratory according to our veterinarian's advice. Opioids might cause further respiratory depression during surgery. \nMaintain the animals at 37 °C during surgery using a homeothermic blanket system and a rectal temperature probe.",
    "Confirm full anesthesia by checking for the paw pinch withdrawal reflex and the blink reflex. \n\tNote: Optional: To counter respiratory problems during surgery, intubation and ventilation might be feasible. However, bear in mind that the trachea needs to be displaced during surgery.\nOnce anesthetized, place the rat in a supine position, shave the ventral neck and sterilize it with 1% chlorhexidine wipes and/or alcohol wipes. Apply a sterile surgical blanket over the animal and keep the area sterile at all times.\nOnce anesthetized, place the rat in a supine position, shave the ventral neck and sterilize it with 1% chlorhexidine and alcohol wipes. Apply a sterile surgical blanket over the animal and keep the area sterile at all times.\n\tNOTE: Optionally, the rat’s head can be fixed in a stereotaxic frame in the supine position during surgery to disable mobility of the head, i.e. the occipital bone.\nMake a 2 to 3 cm long midline incision from the chin to almost the rostral end of the sternum using a sterile scalpel (#10). Optionally, apply small bulldog clamps to retract the skin.\nBlunt dissect the upper layers of tissue such as glands (e.g. submaxillary gland and parotid gland) and muscles covering the trachea using reverse action with blunted scissors and toothed forceps. Always stay on the midline. The tissues should separate easily.\nOnce the trachea is exposed, displace it to one side. The midline is visible underneath it with two white fat pads, marking the midline at the rostral end.\nRostral to the white fat pads, blunt dissect tissue until the ventral surface of the skull (the basioccipital bone) is reached.",
    "Insert long-toothed retractors (tooth length 5.5 mm or 16 mm) to keep the trachea displaced to one side (maximum 1 cm) and to expose the base of the skull. Displacement of the trachea can obstruct breathing.\n\tNOTE: For some animals, loosen the retractors at multiple times during the surgery to remove the strain on the trachea, e.g. every 10 min for 2 min. Hook retractors can be used instead of long-toothed retractors to reduce the strain of displacement.\nCarefully cauterize small visible blood vessels at the rostral end going towards the larynx to avoid bleeding.\n\tNOTE: In order to prevent cauterizing the recurrent laryngeal nerve blood vessels are carefully pulled away from the tissue wall before they are cauterized.\nAdjust the microscope for the remainder of the surgery.\nRemove the periosteum covering the base of the skull with fine forceps. Adjust the retractors to achieve the best possible view for drilling.\nFeel the uneven surface of the basioccipital bone with fine forceps, noting an elevation at the midline, which covers the basilar artery. Rostrally, the skull becomes raised as a slight convexity.\nDepending on which side the lesion is desired, drill a hole roughly 1 mm lateral to the midline in mediolateral movements.\n\tNOTE: Remember that the rat is in the supine position, and its left side may be on the investigators right hand side!\nOnce a hole is made, enlarge towards the midline with small vertical up-and-downwards-movements with the drill until the basilar artery is clearly visible and enlarge laterally for at least 2 mm.\nMake sure the basilar artery is clearly visible. The pyramid can be identified by its slightly bulging shape (Figure 2) and by bordering blood vessels.\nRemove any remaining bone fragments with fine forceps.",
    "Apply one drop of Doxapram hydrochloride, a respiratory stimulant, on the tongue.\nOpen the dura longitudinally with a 26 gauge needle and fine forceps lateral to the basilar artery. Soak up the cerebrospinal fluid (CSF) and any bleeding with cotton buds.\nAvoiding injury to the basilar artery, make a cut approximately 1.5 mm wide spanning the width of the pyramid and 0.5 mm deep with Vannas Spring Scissors perpendicular to the basilar artery (Figure 2) to interrupt the CST fibers.\n\tNOTE: Mark the microscissors beforehand at 0.5 mm from the tips. Once the dura is opened the basilar artery can be moved slightly to one side allowing better access to the pyramid.\nRepeat the cut using the tip of a 26 gauge needle to ensure the lesion includes the fibers close to the basilar artery.\nStop the bleeding with light pressure applied by cotton buds. Optionally, the cut can be covered with gelfoam.\nRemove the retractors, replace the tissues and suture only the skin with 3-0 Vicryl sutures.\nAfter the surgery, keep the animal in an incubator at 32 °C until fully awake and administer 5 ml saline subcutaneously, if required. Do not leave the animal unattended.\nGive Carporfen subcutaneously as an antiinflammatory and as an analgesic for the post-surgical pain one day postsurgery.\nMonitor animals closely for one week after surgery and at least once a week thereafter.\nAs required after surgery, place hydration gel packs, pureed baby food, wet mash and dry chow on cage floor. Provide water bottles with long spouts (lacking ball bearing valves)."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}