{
  "id": 15832,
  "origin_website": "Jove",
  "title": "Semi-Targeted Ultra-High-Performance Chromatography Coupled to Mass Spectrometry Analysis of Phenolic Metabolites in Plasma of Elderly Adults",
  "procedures": [
    "The plasma samples used in this protocol were collected in a previous study following all the ethical guidelines and approved by the Institutional Ethics and Bioethics Committee (CIEB-2018-1-37) from the Universidad Autónoma de Ciudad Juárez. The complete protocol for the extraction and identification of the phenolic compounds and metabolites in plasma by UPLC-MS/MS is represented in Figure 1.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63164/63164fig01.jpg\nFigure 1: Schematic representation of the extraction and identification of phenolic compounds and metabolites in plasma by the semi-targeted UPLC-MS/MS method. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63164/63164fig01large.jpg]\n1. Sample preparation\nStore the plasma samples at -80 °C until analysis.\nDefrost the plasma samples at room temperature for 15 min.\n\tNOTE: The samples can be placed in a water bath at 37 °C to accelerate the process (5 min).\nPlace 200 µL of plasma sample in a 2 mL microtube and mix with 1,000 µL of pure ethanol. Vortex the plasma sample for 30 s.\n\tNOTE: Always use gloves when working with plasma samples.\nCentrifuge the sample at 6,580 x g for 5 min. After centrifugation, collect the supernatant with a micropipette or Pasteur pipette and place it in a new microtube. Store the supernatant at 4 °C.\nMix the pellet from the previous step with 1,000 µL of 100% ethanol, vortex for 30 s, and then centrifuge at 6,580 x g for 5 min.\n\tNOTE: The pellet is strongly packed and needs to be resuspended well to ensure contact between the sample and pure ethanol. The use of a micropipette to flush the pellet with ethanol is recommended.\nAfter centrifugation, collect the supernatant and mix with the supernatant previously obtained from Step 1.4. in a 2 mL microtube.",
    "Remove ethanol from the sample by using pure nitrogen (99.997%) at 135 psi. Keep the needle 1 cm away from the top of the microtube to prevent sample loss and flush until the sample is dry. No heat is needed to evaporate the ethanol.\n\tNOTE: The nitrogen flow must be low to prevent sample loss. Once the ethanol is dried, keep the nitrogen flow for at least 5 min to ensure sample dryness. The protocol can be paused at this point; samples must be stored at -20 °C. Avoid storing the samples for more than 12 h.\nResuspend the dry samples in 100 µL of a mixture of acetonitrile: water at a proportion of 50:50 (v:v).\nFilter the sample through a 0.45 µm nylon syringe membrane directly into an HPLC vial micro insert.\n\tNOTE: The samples in the vial can be stored at -20 °C before analysis. Store the samples for no more than 8 h. It is recommended to inject the samples into the UPLC system just after filtration.\n2. UPLC-MS/MS analysis\nInject 3 µL of sample onto a UPLC equipped with a C18 reverse-phase column (50 mm x 2.1 mm; 1.8 µm). Set the autosampler temperature at 20 °C and the column thermostat at 25 °C. Inject each sample in triplicate.\nUse 0.1% (v:v) formic acid in water as solvent A, and 100% acetonitrile as solvent B. Set the flow rate at 0.4 mL/min and a gradient program as follows: 0-1 min 10% B, 1-4 min 30% B, 4-6 min 38% B, 6-8 min 60% B, 8-8.5 min 60% B, 8.5-9 min 10% B (Table 1).",
    "Set the mass spectrometer to negative mode ionization. Use nitrogen as a drying gas at 340 °C and a flow rate of 13 L/min. Set the nebulizer pressure at 60 psi. Set the capillary voltage at 4,000 V, the fragmentor voltage at 175 V, and the Skimmer voltage at 65 V. Use collision energy at 20 V (Table 2).\nScan the masses between 100-1100 mass to charge ratio (m/z) and, for MS/MS, scan masses between 50-1000 m/z (Table 2). Set data acquisition to Auto MS/MS mode. Use the following reference mass: 119.036 and 966.0007.\ntable:\n﻿0,1,2\nTime (min),Solvent A (0.1 % formic acid in HPLC water),Solvent B (100 % acetonitrile)\n0 to 1,90,10\n1 to 4,70,30\n4 to 6,62,38\n6 to 8,40,60\n8 to 8.5,40,60\n8.5 to 9,90,10\nTable 1: Mobile phase gradient used for the separation of phenolic compounds by UPLC.\ntable:\n﻿0,1\nIonization mode,Negative\nDrying gas,\"Nitrogen at 340 °C, flow rate 13 L/min\"\nNebulizer pressure,60 psi\nCapillary voltage,175 V\nMS scan masses,100-1100 m/z\nMS/MS scan masses,50-1000 m/z\nTable 2: Ionization parameters for the MS/MS analysis.\n3. Database construction\nSearch for phenolic compounds, phenolic metabolites, or other compounds of interest in the scientific literature.\nOpen the database management software included in the UPLC system. Select File | New Personal Database Compound Library (PCDL) | Create New PCDL. Select the type of PCDL: LC/MS Metabolomics. Set a name for the PCDL. Then select Create.\nIn the toolbar, select PCDL and then the Allow editing option. Then click the Find compounds button.\n\tNOTE: Since it is a new PCDL, the table results will be empty. This will change once new compounds are added into the PCDL.",
    "Add compounds to the specialized personal database compound library by copying them from the instrument's general library. Open the instrument's existing database included in the database management software. Click the button Find compounds. In the Single search option, enter the compound search criteria to find the compound of interest.\n\t\tNOTE: Compounds can be found by name, molecular formula, exact mass, and retention time.\nIn the compound results table, select the compound of interest. To select more than one compound, click the first compound, hold down the CTRL key, and then click each compound of interest. Then, right-click on all the highlighted compounds and select Append to PCDL.\nIn the new window, search and select the specialized personal database file. Mark the boxes Include spectra for compounds if present and Include ion mobility info for compounds if present. Click the Append button. In the new dialog box, select Yes to check the new compounds added. Select No to keep searching for more compounds of interest.\nIf the compounds of interest are not available in the instrument's general library, add new compounds manually.\n\t\nOpen the specialized personal database. Once opened, follow Step 3.3. Select the Edit compounds option. Click the Add new button.\nIn the upper section of the window, complete the information for the new compound. Fill in the formula, name, IUPAC name, CAS number, Chemspider ID, and other identifiers.\nUse the information available in the free online libraries (Chemspider, PubChem, and Phenol Explorer) to fill in the information for the new compound of interest. Once finished, click the button Save as new to save the new compound information in the specialized personal database.",
    "NOTE: When adding information from free libraries, be sure to include the compound information without the presence of chloride or iodide ions. This may modify the exact mass and molecular formula of the compound of interest.\nRepeat the process with all the compounds of interest to complete the specialized personal database.\n4. Data analysis\nUse the instrument´s qualitative manager software to identify the phenolic compounds and phenolic metabolites present in the samples.\nOpen the sample file. In the Chromatogram panel, select Define Chromatograms and extract the total ion chromatogram (TIC), the extracted ion-chromatogram of MS (EIC), and the EIC of MS/MS. Select the integrate chromatogram option.\nIn the Find Compounds panel, select Find by Formula-Options. In the new window, select Formula Source and then the Database/Library option. Find the personal database previously created and click on Open.\nSelect the Formula Matching option and set a mass match tolerance of 5 parts per million (ppm).\n\tNOTE: A different match tolerance of masses can be set at 10 ppm; this difference depends on the mass spectrometer used.\nSelect the Negative Ions option and select only the -H dialog box. In the Results option, mark the Extract EIC, Extract Cleaned Spectrum, Extract Raw Spectrum, and include Structure dialog boxes.\nSelect the Result Filters option. Mark Warn if score is and set the score match at 80.00%. Mark Do not match if the score is and set the score at 75.00%.\n\tNOTE: The match/not match scores can be changed to lower values if needed. This will reduce the accuracy of identification.\nClick on the Find Compounds by Formula to identify compounds of interest in the sample.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}