{
  "id": 19371,
  "origin_website": "Jove",
  "title": "Whole Neonatal Cochlear Explants as an In vitro Model",
  "procedures": [
    "All the animal procedures were performed in accordance with the guidelines and regulations of the Animal Welfare Committee of Canton Basel City, Switzerland. Postnatal C57BL/6JR mice, Wistar rats, and STAT1-deficient mice (mixed C57BL/6-129/SvEv)7 aged 3-5 days and of either sex were used for the experiments.\n1. Coating the multi-well chambers\nPrepare complete culture medium.\n\t\nFor organ of Corti explants, prepare medium containing Dulbecco's Modified Eagle's Medium (DMEM), 10% fetal bovine serum (FBS), 25 mM HEPES, and 30 U/mL penicillin.\nFor organ of Corti explants and cochlear explants, prepare a medium containing DMEM/F12, 1x N2 supplement, 1x B27 minus antioxidants, and 30 U/mL penicillin.\nPrepare a stock solution of poly-D-lysine by adding 10 mL of cell culture water to 5 mg of poly-D-lysine in a laminar hood. The final concentration of poly-D-lysine is 0.5 mg/mL.\n\tNOTE: Aliquot the remaining stock solution, and store at −20 °C.\n\t\nPrepare working solutions of poly-D-lysine by diluting the stock solution 1:10 in sterile water.\nCoat an 8-well chamber with 150 µL/well of poly-D-lysine working solution, and incubate for 30 min at room temperature.\n\tNOTE: If a 4-well chamber is used, coat with 300 µL/well of poly-D-lysine working solution.\nAspirate the solution by vacuum or pipetting.\nWash 2x with 200 µL of sterile water and once with 200 µL of complete culture medium or DMEM.\nAdd 150 µL of complete culture medium to each well.\n\tNOTE: If a 4-well chamber is used, add 250 µL/well of complete culture medium.\nPlace the chamber in the incubator at 37 °C and 5% CO2 for at least 30 min before placing an explant.\n2. Dissection of the temporal bone\nDisinfect the surgical table with 70% ethanol, and sterilize all the instruments in a glass microsphere sterilizer.\nPlace a sterile 60 mm Petri dish on a bucket containing ice.",
    "Pour a few milliliters of 1x phosphate-buffered saline (PBS), and keep it on ice.\n\tNOTE: Use 30 U/mL penicillin in 1x PBS to avoid bacterial contamination.\nPlace a sterile pad on an sterile tray and quickly decapitate the pup animal with operating scissors. Submerge the head in 70% ethanol for 5s, if contamination is a frequent event.\n\tNOTE: This protocol was tested for mice and rats aged P3-P5. Cochlear tissues are more difficult to dissect from older mice and rats, and the survival of explants in culture is limited.\nPlace the animal head on a sterile pad. Remove the mandible. Lift the skin and peel it back from the skull. \nHold the skull by placing the forceps in the orbital cavities.\nCarefully cut the skull along the sagittal suture, and then cut in the coronal suture area with a sharp scalpel blade without damaging the cochlea.\n\tNOTE: Avoid applying too much pressure, and avoid forward and backward movements with the scalpel, as this may damage the cochlear bone and, thus, the cochlear duct.\nCarefully remove the brain from the two skull halves.\nTransfer the skull halves into a 60 mm Petri dish with the ice-cold PBS prepared in step 2.3.\n3. Isolation of the cochlea\nLocalize the cochlea in the temporal bone under the microscope. Place the forceps in the superior semicircular canal.\nLoosen the surrounding tissue between the cochlea and the temporal bone using an insulin syringe (mice) or forceps (rats).\nCarefully pull the temporal bone away from the cochlea, keeping the cochlea attached to the vestibule with the temporal bone. Ensure that the cochlea is free from the surrounding tissue before pushing the temporal bone aside.\n\tNOTE: Applying too much force will damage the cochlear duct.",
    "Hold the cochlea in a fixed position, and use the other hand to carefully remove the cartilaginous cochlear capsule. Carefully insert the tips of the forceps into the apex region or between the turns (visible as a white line), and remove the capsule piece by piece. Expose the cochlear duct.\nCarefully place the forceps under the cochlea, and detach it from the vestibular organ and temporal bone.\nTransfer the cochlea into a new 60 mm dish containing ice-cold PBS.\nAdjust the magnification of the microscope to better visualize the explants.\nFollow the next steps for organ of Corti explants:\n\t\nHold the organ at the base with forceps. Gently remove the cochlear duct by grabbing it with forceps at the basal hook region.\nUnwind the cochlear duct from the modiolus without tearing it.\nCarefully remove the spiral ligament with the stria vascularis by holding the organ at the base and pulling them away.\n\t\tNOTE: Tissue separation can also be achieved by holding the apex region instead of the base region. This can be helpful when dissecting rat organs or older mouse pups (>P5).\nCarefully remove the Reissner's membrane by holding the organ at the base and pulling it off piece by piece.\n\t\tNOTE: This is an optional step as the Reissner's membrane does not interfere with the acquisition of the imaging.\nFollow the next steps for cochlear explants:\n\t\nDetach the spiral ganglion from the osseous spiral lamina using an insulin syringe (mice) or forceps (rats).\nGently unwind the modiolus during the detachment.\n\t\tNOTE: The explants can be divided into two pieces for better handling.\nGrasp the hook region with forceps.\nCarefully remove the spiral ligament with the stria vascularis by pulling it off.",
    "Carefully remove the Reissner's membrane by holding the organ at the base and pulling it off piece by piece.\n\t\t​NOTE: This step is recommended, because the Reissner's membrane usually folds and covers the neuron filaments and, therefore, might affect the experiments.\n4. Culture of cochlear explants\nTransfer the explants from the Petri dish to the multi-well chambers. Lift the explants with the hair cells facing up using a laboratory spatula. Include a few microliters of 1x PBS to prevent the samples from sticking to the spatula.\n\tNOTE: Severely damaged explants will stick to the spatula.\nAllow the explants to slide from the spatula into the chamber by gently waving the spatula in the medium. Place one explant per well of an 8-well chamber slide.\n\tNOTE: If the explant sticks to the spatula, hold the spatula in the medium, and use the forceps to detach the explants. Always place the forceps at the inner border of the explant (away from the hair cells).\nCheck under the microscope that the explants have been transferred in the correct orientation and placed in the center of the wells.\n\tNOTE: Incorrectly oriented explants with hair cells facing downwards tend to show a U-shape upward along their width. Correct their orientation by moving the explants to the corners of the chambers (more medium is available) and direct them to rotate.\nRemove 80 µL of the medium using a 100 µL pipette, and discard it.\nCheck under the microscope if the hair cells and spiral ganglion neuron cells are visible. If necessary, use forceps to gently push apart some overlapping tissue.\nRemove the rest of the medium, and wait for ~10 s.",
    "Pipet the medium back. Add one or two drops of the medium next to the explant and the rest of the medium at some distance away from the explant to prevent the explant from detaching.\n\tNOTE: Even if the explants are attached to the chambers, the medium should always be added first by pipetting one to two drops next to the explants. In this way, the explants will not be lifted up when the remaining complete media is added.\nReturn the chamber to the incubator, and incubate for 2 h to allow the organs to attach firmly to the bottom of the chamber.\nRemove the medium, and carefully add 300 µL of fresh prewarmed complete medium using a 100 µL or 200 µL pipette. Do not use a 1 mL pipette.\n\t​NOTE: If a pretreatment is desired, after 2 h of attachment, add 300 µL of complete medium containing the substance of interest. If a 4-well chamber is used, use up to 500 µL/well.\nReturn the chambers to the incubator.\n5. Test of ototoxic agents\nLeave the explants overnight to adapt to the culture conditions and to recover.\nPrepare different concentrations of ototoxic agents to find the appropriate concentration to establish an ototoxic model with approximately 50% hair cell loss. Use between 50 µM and 250 µM for gentamicin and between 40 µM and 320 µM for cisplatin. Prepare the cisplatin solutions fresh, and protect them from light.\nRemove the medium, and carefully add 300 µL of medium containing the desired ototoxic drug.\nIncubate the explants with gentamicin and cisplatin at 37 °C for 24 h to 48 h to determine the hair cell survival.",
    "NOTE: The drug concentrations and exposure time are chosen depending on the purpose of the study. The preservation of the explants was here tested up to 72 h. Do not use serum if planning to perform a long-term culture.\nFollow the next section to stain the cochlear cells.\n6. Fixation and immunofluorescence\nDiscard the medium at the end of the experiment, and immediately wash the explants with 200 µL of prewarmed 1x PBS.\nFix the explants with 200 µL of 4% paraformaldehyde (PFA) for 15 min under a chemical fume hood.\n\tCAUTION: PFA is a hazardous chemical; read the material safety data sheet (MSDS) before working with PFA for the first time.\nWash the explants twice with 200 µL of 1x PBS. Store the explants in 1x PBS at 4 °C in case the staining procedures need to be postponed.\nPrepare the permeabilization solution consisting of 1x PBS and 1%-5% Triton-X100.\nDiscard the 1x PBS, add 200 µL of permeabilization solution, and incubate the explants for 15 min.\nPrepare blocking solution.\n\t\nFor organ of Corti explants, prepare blocking solution consisting of 1x PBS, 10% normal goat serum (NGS, for goat secondary antibodies, or another serum from the same species as the secondary antibodies). Alternatively, use 1%-5% bovine serum albumin (BSA) if the cells are stained only with phalloidin.\nFor cochlear explants, prepare blocking solution consisting of 1x PBS, 10% NGS, and Fab fragment (Fab fragment goat-anti mouse IgG H+L, dilution 1:200) if using mouse primary antibodies (e.g., mouse anti-TuJ1) to stain the spiral ganglion cells.\nAdd 200 µL of blocking solution, and incubate the explants for 1 h.\nDiscard the blocking solution. To those explants incubated with Fab fragment, add 200 µL of 4% PFA, and incubate for 5 min.\nWash the explants with 1x PBS for 5 min.",
    "Prepare an antibody solution consisting of 1x PBS, 5% NGS, and 0.1%-0.25% Triton-X100.\nDilute the primary antibody in antibody solution-MYO7A (ab3481 at a dilution of 1:500 or MYO7A 138-1 at 1:100)-to label the hair cells and TuJ1 (1:400) to label the spiral ganglion neurons.\n\tNOTE: If the hair cells are only labeled with phalloidin, dilute the phalloidin at 1:150 in 1x PBS, incubate for 40 min to 1 h at room temperature, and proceed to step 6.22.\nInclude a control for the nonspecific binding of the secondary antibody by omitting the primary antibody.\nAdd 170 µL of the antibody solution with the primary antibody to the corresponding well, and incubate overnight at 4 °C with gentle shaking (40-60 rpm).\nWash the explants 4x for 5 min each with 1x PBS.\nDilute the secondary antibody in antibody solution (e.g., goat anti-rabbit Alexa Fluor 488 or goat anti-mouse Alexa Fluor 568 IgG at a dilution of 1:500).\nAdd 170 µL of the antibody solution with the secondary antibody, and incubate for 1 h at room temperature.\n\tNOTE: From this step on, protect the explants from prolonged light exposure.\nWash the explants 2x for 5 min each with 1x PBS.\nProceed to the next step for the sequential double labeling of the explants. Incubate with a second primary antibody of interest (e.g., MYO7A for hair cells) overnight at 4 °C with gentle shaking (40-60 rpm). Alternatively, incubate with phalloidin (1:150) for 40 min to 1 h at room temperature, and proceed to step 6.22.\n\tNOTE: Perform sequential labeling if the primary antibodies are from the same host species. Perform phalloidin labeling at the end for multiplex immunofluorescence.\nWash the explants 4x for 5 min each with 1x PBS.",
    "Dilute the secondary antibody in antibody solution (e.g., goat anti-rabbit Alexa Fluor 488 or goat anti-mouse Alexa Fluor 568 IgG at a dilution of 1:500).\nAdd 170 µL of the secondary antibody, and incubate for 1 h at room temperature.\nWash the explants 2x for 5 min each with 1x PBS.\nPrepare a DAPI stock solution of 1 mg/mL, and store at −20 °C. Dilute the DAPI stock solution 1:10 to prepare working solutions of 0.1 mg/mL, and store at 4 °C.\n\tNOTE: Skip step 23 and go to step 26 if the mounting medium containing DAPI is used.\nDilute the DAPI working solution 1:100 in 1x PBS, and incubate the explants with 200 µL of DAPI solution for 5 min.\nWash the explants 2x for 5 min each with 1x PBS.\nRemove the 1x PBS as much as possible to allow the bottom of the chamber to dry. Do not let the explant dry.\nWait for 2-5 s, and add one drop of mounting medium directly onto the explant.\n\tNOTE: The mounting medium on the explant will remain in place due to surface tension. Hardening mounting medium can be used.\nStore the chambers at 4° C until imaging.\n7. Immunofluorescence of live cells from explants\nUse the isolated explants after overnight incubation.\nRemove the medium, and carefully add 300 µL of medium containing 125 µM cisplatin.\nIncubate the explants for 18 h to measure the mitochondrial superoxide in the live explants.\nDiscard the medium at the end of the drug exposure.\nAdd 300 µL of a permeable probe to detect the cellular ROS (e.g., 250 nM of mito-hydroethidine) and/or Caspase-3 (e.g., 2 µM DEVD peptide conjugated to a nucleic acid binding dye).\nIncubate at 37 °C for 30 min.",
    "Wash the explants twice gently with 200 µL of warm Hank's balanced salt solution (HBSS) or an appropiate buffer.\nImage the cells within 2 h with fluorescence excitation at 400 nm and emission detection at 590 nm.\nDiscard the medium at the end of the experiment, and immediately wash the explants with 200 µL of prewarmed 1x PBS.\nFix the explants, and stain the cochlear cells as described above.\n8. Visualization by confocal imaging\nImage the explants using a microscope equipped with a spinning disk confocal unit or a confocal microscope equipped with a point-scanning confocal unit.\nAcquire the images using a spinning disk with a 20x air objective (numerical aperture: 0.75) for cell counting. Alternatively, acquire the images using a point-scanning confocal microscope with a 40x air objective (numerical aperture: 0.95) or a 100x oil objective (numerical aperture: 1.45) to visualize and count the synapses or image the stereocilia.\n\tNOTE: Adjust the laser intensity and exposure time for each channel to avoid over- and undersaturation of the images. Apply the same settings to all the explants of the same experiment.\nSet up the microscope to capture a 3D image of the entire cochlear explant using a 20x air objective, z-stack, and automatic stitching tools. Use 3 x 3 adjacent fields with 15% overlap for mouse explants and 4 x 4 adjacent fields for rat explants to be stitched together.\nAdjust the images using the microscope's software or the free open-source FIJI software8.\n\tNOTE: Deconvolution, an image processing technique, can be applied to confocal images to sharpen their contrast and resolution9-11."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}