{
  "id": 8092,
  "origin_website": "Bio",
  "title": "<sup>35</sup>S pulse Labelling of <em>Chlamydomonas</em> Chloroplast Proteins",
  "procedures": [
    "I.  Sulfur deprivation    Grow your strain of interest and the control strains at 23 °C to the early log phase (cell density < 2 x 106 cells/ml).   Spin down your cells (5 min, 1,000 x g, RT) in sterile 50 ml reaction tube and resuspend carefully in 10 ml TAP-B, centrifuge again (5 min, 1,000 x g, RT) and resuspend the cells in 10 ml TAP-B.   Transfer cells to a sterile 25 ml Erlenmeyer flask (it is best to set up the medium in this flasks and put the resuspended cells back in the same flask), shake for 16 h at 23 °C in medium light (30 – 50 μmol x m-2 x s-1).   Spin down your cells (5 min, 1,000 x g, RT) and resuspend carefully in 10 ml TAP-B/T.   Centrifuge again (5 min, 1,000 x g, RT) and resuspend the cells in exactly 10 ml TAP-B/T, transfer cells back to 25 ml Erlenmeyer flask.    Agitate cells for 2 h in the dark (wrap flasks with aluminium foil or cover with cardboard box).     II. Adjustment of cells to the same amount of chlorophyll/cells    Transfer 0.5 ml of the cultures to a microreaction tube (keep the remaining culture shaking in the dark).   Centrifuge tube (2 min, 20,000 x g, 4 °C) and discard supernatant, resuspend pellet thoroughly in 1 ml methanol.   Centrifuge again (1 min, 20,000 x g, 4 °C) and use supernatant for chlorophyll measurement at 652 nm, dilute with methanol (prechilling not necessary) if optical density is higher than 1 (do not forget to adjust your calculation for that dilution factor).   Calculate chlorophyll content:  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130601/20130601220347_2771.jpg    Adjust Adjust chlorophyll content with TAP-B/T to 80 μg ml-1:  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130601/20130601220408_2123.jpg    Centrifuge cells (5 min, 1,000 x g, RT) and resuspend carefully in calculated volume of TAP-B/T to get 80 μg Chl/ml.",
    "If your cells are lacking chlorophyll better adjust the cell number than the chlorophyll amount, prepare a 1: 10 dilution of cultures and count the cells (hemocytometer, microscope), spin down cells and adjust cell number to 7.25 x 107 cells/ml (that corresponds to ~ 80 μg Chlorophyll/ml if using a green culture).     III. Pulse    Add 25 μl of cycloheximide stock solution (100 μg/ml, final: 10 μg/ml) per culture to a screw cap tube (cycloheximide is for inhibition of cytosolic protein synthesis).   Take your cultures and prepared tubes and go to fume hood in the radioactive lab (don’t inhale 35S! Release of radioactive gaseous SO2).   Add 225 μl of each culture to the cycloheximide.   Incubate for 10’ in rotary shaker in the dark (covered with cardboard box).   Add 12.5 μl of 35S (H235SO4, 10 mCi/ml).   Light pulse: incubate for 5-20 min in front of a appropriate light source and agitate cells occasionally.   Spin down cells, discard supernatant (radioactive waste) and freeze the tube with the pellet in liquid nitrogen for at least 5 min to stop cellular activity.     IV. Cell lysis    Thaw your cells on ice and keep them on ice from now on.   Add 200 μl of buffer A and break the cells by pipetting up and down for ~ 1 min or sonication (three times 5 pulses at 50% output with 30’’ pauses in between).   Remove soluble material: spin down membranes at 20,000 x g for 25 min at 4 °C, discard supernatant into radioactive waste.   Resuspend membrane pellet with 100 μl of buffer B.     V.  Protein electrophoresis    Use a protocol for Laemmli-SDS-PAGE and adjust conditions for your protein depending on its molecular weight, e.g.",
    "a 6 M urea-16% polyacrylamide-SDS-PAGE gel for separation of the photosystem II reaction center proteins D1 (encoded by the psbA gene) and D2 (encoded by the psbD gene).    VI. Coomassie staining and drying of gel    Use a protocol for Coomassie Blue staining (to visualize size marker and lanes).   Put gel (upside down) on plastic tray, put Whatman paper (moistened with water) on top, flip over (Figure 1).   Place Whatman paper and gel on top of two more layers of Whatman paper, cover with plastic foil and dry in gel dryer.     VII.Autoradiography    Place phosphor imaging screen on top of your gel and expose for 1-3 days (or use X-ray film for longer time).   Scan screen / develop X-ray film.   Compare bands in your strains of interest with negative controls to identify affected protein, e.g. the band for the photosystem II reaction center protein D1 (encoded by the psbA gene) is missing in the investigated mutants as in the psbA mutant FuD7 in Figure 5 of (Morais et al., 1998).  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20130527/20130527060511_4121.jpg Figure 1. Scheme of step (VI-2)."
  ],
  "subjectAreas": [
    "Plant Science",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}