{
  "id": 11744,
  "origin_website": "Jove",
  "title": "Cell-Free DNA Extraction of Vitreous and Aqueous Humor Specimens for Diagnosis and Monitoring of Vitreoretinal Lymphoma",
  "procedures": [
    "The present protocol follows the human care guidelines and with approval of the institutional review board (IRB) of the University of Michigan. A waiver of informed consent was obtained for this from IRB. There are no relevant inclusion or exclusion criteria for the patients involved.\n1. Separation of cellular and cell-free components\nNOTE: Three types of samples can be received for VRL diagnostic testing: vitreous (undilute; fluid from vitrectomy collected prior to beginning infusion), diluted vitreous within a cassette bag (Figure 1), and aqueous humor (fluid from the anterior chamber of the eye).\nFor undiluted vitreous fluid, which is very viscous, dilute with 3-5 mL PBS to facilitate pipetting.\nFor dilute vitreous within the cassette bag (Supplemental Figure 1), drain fluid into 50 mL conical tubes (one for every 45 mL of fluid).\nAqueous humor is very low in volume (<200 µL). To ensure maximum recovery of cells, transfer the sample to a 1.5 mL tube, rinse the original 500 µL microcentrifuge tube the sample was collected in with an equal volume of PBS, and add to the 1.5 mL tube.\nCentrifuge vitreous or aqueous fluid at 3,000 x g for 15 min at room temperature.\nCarefully remove the supernatant using a pipette, being careful not to disturb the pelleted cells.\n2. DNA extraction from the cellular component\nAdd an appropriate amount of cell lysis solution (300 µL for small pellet, 1 mL or more for larger pellet) (see Table of Materials). Mix by pipetting up and down.\nWhen completely lysed, add 1/3 total volume of the protein precipitate solution (100 µL for 300 µL lysate) (see Table of Materials).\nVortex vigorously for 20-30 s. Spin for 3 min at 3,000 x g at room temperature.",
    "Pipette 300 µL of isopropanol into a clean microcentrifuge tube. Carefully pipette the supernatant from the previous step to the isopropanol tube.\nAdd 1.5 µL of 20 mg/mL glycogen (for 300 µL lysis) (see Table of Materials).\nMix well by inversion, then place the sample in a -20 °C freezer for 1 h to overnight to aid in DNA precipitation.\nCentrifuge the 1.5 mL tube for 5 min at 3,000 x g at room temperature. Pipette off the isopropanol.\nAdd 0.5 mL of 70% ethanol and invert the tube to wash the pellet.\nSpin for 1 min at 3,000 x g at room temperature and decant the ethanol. Repeat the ethanol wash once.\nInvert the tube on clean gauze to drain the solution and dry the pellet or decant. Quickly spin the DNA in a microcentrifuge and pipette the remaining drop of ethanol with a fine-tip disposable pipet tip (once no residual ethanol is left in the tube, the DNA should be dry and ready to hydrate in 5-10 min).\nAdd 45 µL of DNA hydration solution (see Table of Materials) to the dried DNA pellet.\nPlace the tube in a heating block at 50 °C and allow it to solubilize for 1-2 h. Pipet the DNA up and down to speed up the hydration process.\n\t​NOTE: Add more DNA hydration solution if the sample appears too viscous.\n3. Cell-free DNA extraction\nThe amount of supernatant from step 1.5 is variable. Add 70 µL of conditioning buffer (see Table of Materials) for every milliliter of the supernatant.\nMix clearing beads well by vortexing. Add 10 µL of clearing beads if processing <14 mL of cell-free supernatant, 20 µL if processing 14-40 mL.\nMix sample/bead mixture well by vortexing. Centrifuge at 3,000 x g for 15 min at room temperature.",
    "Without disturbing the pellet, pipette out the supernatant leaving behind 100 µL if 10 µL of clearing beads are used, and 200 µL if 20 µL of clearing beads are used.\nAdd an equal volume of Urine Pellet Digestion buffer (see Table of Materials) to the pellet and resuspend the pellet well by vortexing or pipetting.\nAdd Proteinase K (5% (v/v)) to the resuspended pellet (e.g., add 10 µL of Proteinase K to 200 µL mixture) and mix well by gentle vortexing.\nIncubate the pellet mixture at 55 °C for 30 min.\nAdd one volume of Genomic lysis buffer (see Table of Materials) to the digestion mixture (e.g., 210 µL Genomic lysis buffer to 210 µL of digestion mixture) and mix by vortexing.\nTransfer the commercially available spin column (see Table of Materials) to a new collection tube.\nAdd 200 µL of Urine DNA Prep buffer to the spin column, centrifuge at ≥16,000 x g for 1 min at room temperature, and discard flow-through.\nAdd 700 µL of Urine DNA wash buffer to the column, centrifuge at ≥16,000 x g for 1 min at room temperature and discard flow-through.\nRepeat the step with 200 µL Urine DNA wash buffer.\nTransfer the spin column to a DNase/RNase-free microcentrifuge tube.\nAdd the appropriate volume of DNA elution buffer (based on the molecular tests to be performed) directly onto the column matrix and allow it to stand for 3-5 min at room temperature.\n\tNOTE: 30 µL of elution buffer was used in the example cases. More elution buffer is used if additional testing is required.\nCentrifuge at ≥16,000 x g at room temperature for 1 min to obtain the cell-free DNA.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}