{
  "id": 4975,
  "origin_website": "Bio",
  "title": "Analysis of T Cell Proliferating and Polarizing Potential of Murine Dendritic Cells in Allogeneic-mixed Leukocyte Reaction",
  "procedures": [
    "Harvest mouse bone marrow-derived dendritic cells (BMDCs) from plates by gentle pipetting, give a wash with PBS and prepare the suspensions of 1.0 x 105, 2.0 x 105 and 4.0 x 105 cells per ml in RPMI-10 medium. (BMDCs are derived by culturing mouse bone marrow cells in the presence of GM-CSF. Briefly, add 4 x 106 bone-marrow cells per well of 6-well plate in RPMI-10 medium supplemented with 20 ng/ml GM-CSF. Remove culture medium along with non-adherent cells on day 3 and day 5, and fresh 4.0 ml GM-CSF-supplemented medium to each well. Harvest immature DCs on day 7 by gently pipetting. After giving a wash in RPMI-10 medium, cells can be used for subsequent experiments. The purity of DCs derived following this protocol is ~85%. These cells can be used directly in allo-MLR or can be further purified.)To analyze the ability of DCs to induce T-cell proliferation, add 50 µl of DC suspensions (equivalent to 0.5 x 104, 1.0 x 104 and 2.0 x 104 DCs) per well in a round bottom plate in triplicates.(It is necessary to plate the increasing number of DCs to achieve an increasing ratio of stimulator cells to responder cells. It is advised not to add DCs into outer wells of the plate because culture media tend to evaporate from these wells at higher rates. Instead, these wells can be filled with autoclaved distilled water).To analyze the ability of DCs to induce T-cell polarization, similarly add 50 µl of 2.0 x 105 cells/ml DC suspension (= 1.0 x 104 cells) per well in a round bottom plate in triplicates.Add the desired stimuli such as LPS or heat-killed mycobacteria to plated DCs and adjust final volume of total contents per well to 100 µl.",
    "[Dilute stock solution of LPS or mycobacterial suspension to required concentration in RPMI-10 medium. LPS could be used at a concentration of 0.1 to 1.0 µg/ml, whereas heat-killed bacteria (prepared by autoclaving) can be used preferably at a multiplicity of infection (MOI) of 5 to 10].Keep plates in a humidified CO2 incubator for 24 h.Next day, isolate CD4+ and CD8+ T lymphocytes from the spleen of naïve allogeneic mice using a negative selection kit as suggested by manufacturer. Determine purity of lymphocytes using anti-mouse CD3/CD4 and CD3/CD8 antibodies by flow cytometry. Note: If DCs are derived from C57BL/6 mice, lymphocytes can be prepared from Balb/c mice.Irradiate DCs with gamma-rays in a gamma-irradiation chamber (irradiation dose, 25 Gy). Irradiation will prevent the proliferation of DCs, which could otherwise give false results.Adjust concentration of lymphocytes to 1.0 x 106 cells/ml. Add 100 µl of cell suspension to irradiated DCs.Set positive controls by stimulating CD4+ T cells and CD8+ T cells with Concanavalin A (final concentration, 5 µg/ml).Keep plates at 37 °C in a humidified CO2 incubator. After 72 h, add 1.0 µCi 3H-thymidine per well of the plate set up with T cell proliferation assay. Keep plates back into the CO2 incubator. After 18 h, transfer plates to -20 °C. Plates can be thawed immediately or next day.Harvest the cells onto a filter paper and wash them using an automated cell harvester. Measure the 3H-thymidine levels on filter paper using a beta scintillation counter.Collect culture supernatants from plate set up with T cell polarization assay, after 96 h. Store supernatants at -80 °C or immediately analyze for TH1, TH2, TH17 signature cytokines by ELISA."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}