{
  "id": 10488,
  "origin_website": "Jove",
  "title": "Live Cell Analysis of Shear Stress on Pseudomonas aeruginosa Using an Automated Higher-Throughput Microfluidic System",
  "procedures": [
    "1. Media Preparation\nPrepare minimal media (MM) with 0.25% glucose. To make 1 L of MM with 0.25% glucose, add 200 mL of sterile M9 salt solution, 2 mL of sterile 1 M MgSO4, 100 µL of sterile 1 M CaCl2, and 12.5 mL of sterile 20% (w/v) glucose to water (dH2O) at a final volume of 1 L.\nTransfer required media to a sterile bottle using sterile techniques. Prepare the amount required depending on the number of channels being used. Typically, each channel requires 200 µL for priming, 300 µL for seeding and 1300 µL for the 24 h experiment.\nPlace the bottle in an incubator or water bath set at the experimental temperature. The media should be at the experiment temperature before use to avoid bubbles forming in the microchannels.\n2. Preparation of an Overnight and Experimental Culture of PA01-EGFP.\nPlace 15 mL of experimental media into a sterile sidearm flask and inoculate with one or two colonies from an agar plate streaked with PA01-EGFP. Expand the culture for 12-16 h on an incubator/shaker table at 37 °C and 180-220 rpm.\nMeasure the OD600 of the overnight culture. When the OD600 is greater than 0.80, dilute the overnight culture to the final OD of 0.8 using fresh MM. Place the experimental culture in an incubator or water bath at 37 °C until needed for seeding the microfluidic channels. Check the OD600 again immediately before seeding to ensure that it has not changed significantly from the target OD600, 0.8 in this case.\n3. Equipment Startup\nSet up the system station according to the user guide, similar to the setup in Figure 1. To avoid an error in the connection of the instrument to the software, turn on the instrument in the following order:\n\tPC Workstation",
    "Fluorescence Module. Make sure the fluorescence shutter is ON (blue light by shutter button on)\n\tHardware Controllers\n\tImaging system Controller (see Table of Materials)\n\tCCD Camera\n\tImaging Station (Microscope)\n\tNOTE: The temperature of the heated plate should be adjusted to the desired experimental temperature.\nStart the control application and enter the plate number located on the label on the side of the plate.\n\tNOTE: After control application starts there will be two separate application windows, one for the software that controls the microscope/imaging software and one for the control module that controls the pump and the well-plate interface. This is shown in Figure S1, where the \"Multi Dimensional Acquisition\" menu is open on the top and the Control Module is set for an autorun on the bottom.\n4. Priming and Seeding the Microfluidic Plate\nNOTE: The priming, seeding, bacterial attachment and growth are illustrated in Figure 3.\nRemove the 48-well microfluidic plate from the packaging making sure to not touch the glass surface at the bottom of the plate. Clean the glass slide at the bottom of the plate well with a lens tissue, a lint free cloth, or a low-lint wipe.\nTo prime the microfluidic channels, pipette 200 µL of 37 °C MM into the output well, being careful to avoid bubbles. Place the plate into the plate stage and wipe the interface with ethanol, allowing to dry, before sealing it onto the plate stage.",
    "In Manual Mode on the Control Module, set Fluid as LB at 37 °C and Max Shear at 5.00 dyne/cm2. Click the output wells to activate flow from the output to the input well, priming the channels. After the 5 min priming, pause the flow to prepare for seeding. Carefully remove the plate from the stage and pipette residual media from the output but not removing any of the media from the inner circle that leads to the microfluidic channels.\nTo seed the experimental channels, first pipette 300 µL of MM into the input well followed by pipetting 300 µL of the bacterial culture into the output well into the output well. Place the plate back into the plate stage making sure to wipe the interface before placing it on the plate.\nOn the Control Module, focus on a single channel using the live camera feed after placing the plate stage onto the microscope stage. While visually monitoring by the live feed, resume flow at 1.00-2.00 dyne/cm2 for approximately 2-4 s to allow cells to enter the experimental channel but not in the serpentine channels. Leave the plate on the temperature controlled stage for 1 h to allow for cell attachment. During the 1 h incubation, the Control Module and Montage software can be set up for the autorun (Step 5).\n\tNOTE: The amount of time needed for seeding will vary with media and organism, so it should be monitored closely by the live feed until optimized and used as a general time frame. Seeding throughout the plate may vary which would require more time of applied flow to certain columns of channels for complete seeding.",
    "After the attachment period, gently remove the plate from the stage and pipette the bacteria from the output first avoiding disturbing the channel. With a new pipette tip, remove the media from the input wells.\nimgsrc://cloudfront.jove.com/files/ftp_upload/58926/58926fig3.jpg\nFigure 3: Experimental overview of priming, seeding, and attachment of PA01-EGFP in the microfluidic channels. The priming, seeding, and attachment is outlined. The first step of priming requires fresh media introduced to the output. The seeding entails equal volumes of media and bacterial culture in the input and output wells, respectively. The culture should not pass the viewing segment of the experimental channel (red line) to avoid clogging the serpentine channels. After the incubation period is over, fresh media continuously flows from the input, to the viewing chamber and into the outlet. This initiates the attachment and growth of the bacterial biofilm. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/58926/58926fig3large.jpg]\n5. Setting the Software\nIn the software, open \"Multiple Dimensional Acquisition\" to control the microscope image acquisition. Under the \"Main\" menu, select \"Timelapse\", \"Multiple Stage Positions\", and \"Multiple Wavelengths\" (Figure S1A).\n\t\nSetting up the Saving settings, create a simple Base Name, making sure that Increment base name if file exists is checked. Click Select Directory to select the folder in which all files will be saved. Include essential details of the experiment in the Description.\nUnder the Timelapse tab, adjust the Duration of the experimental time to 24 h. To control how often images are acquired, set the Time Interval so images are acquired every 5 min throughout the experiment. The Number of Time Points automatically adjusts with the set parameters.",
    "Set stage positions using the live camera feed in the bright field microscope, allowing for correct placement and focus. Starting with the 10X objective, focus on the center of the channel, located above or below the channel numbers engraved on the plate. Switch to the 20X objective, finding the optimal viewing area and focal plane within the channel. Add the position to the list or replace the preset channel position with the new settings.\nUnder the Wavelengths menu, set the number of wavelengths to 3. For wavelength 1 (W1), select the FITC 100% CAM with a 10 ms exposure time. For wavelength 2 (W2), select the Brightfield 50% CAM 50% VIS with a minimal exposure time of 3 ms. For wavelength 3 (W3), set as the All Closed filter so no light remains on the last channel between acquisition times.\nWhen setting up the Control Module, check to make sure that the manual run has been stopped.\n\t\nIn the Edit Autorun menu under the Protocol Setup tab, set a new protocol for 24 h of duration time, flowing in the forward direction at the desired shear rate. Shear rate is varied to study the effect of biofilm growth with shear rate. Click Add and Save As the protocol.\nUnder the Sequence Setup tab, create a new sequence by selecting LB@37degrees as the default fluid for all channels. Under Step Iteration 1, for channels 1-12, select the protocol with the desired shear rate and enable all channels. For channels 13-24, select the protocol with the second desired shear rate and enable all channels. Select Apply and Save As the sequence.\nIn the Autorun menu, select the saved sequence to be used for the autorun.\n6. Timed Biofilm Growth Experiment Setup",
    "Pipette a maximum of 1,300 µL of sterile MM into the input well of the microfluidic plate. Place the plate back onto the plate stage and wipe the interface with ethanol, allowing ethanol to dry completely, before sealing the plate. \nPlacing the plate stage onto the microscope stage, and be sure that the protocol(s) and sequence(s) are set up correctly. Select Start to start the autorun quickly followed by clicking Acquire to start the microscope image collection.\nAdjust the focus and placement of all stage positions between image acquirements. Select Pause and, using the live image mode in the bright field wavelength, select Go To to view each stage positions. Set new settings by selecting Set to Current. Click Resume before the next scheduled acquisition time.\n7. Review and Analyze Image Sequences after the Timed Biofilm Growth Experiment\nTo review each channel following the 24 h autorun, in the software, open Review Multidimensional Data, located under Analysis Tools. Click on Select Base File | Select Directory to navigate to the folder with image sequences for the experiment of interest. In the list of Data Sets in the folder that appears, select the base name of the data of interest.\nOnce the data of interest is selected, click View to review this data. Select a wavelength to review that data under Wavelength window (Figure S2).\nReview the image sequence for each channel by selecting the channel number under Stage Position and using the video controls to analyze the data for the 289 time points (assuming that images are obtained every 5 min over a 24 h time frame). Take note of useable growth data.",
    "NOTE: In each channel, watch for the development of air bubbles and clogs that will disturb the biofilm growth within the channel, affecting the data. However, if these occur later in the run, data prior to these circumstances may be found useful.\nAfter reviewing and selecting the desired data for analysis, create stacks of the images for each channel. Under the File menu, select Open Special | Build Stack | Numbered Names. In the Build Stack window, select the Select First Image button then select the first image for the stack in the file folder; select the Select Last Image button and then select the file corresponding to the last image in the stack. Click on OK to open the stack with all the images of the channel in chronological order. Stacks can be saved under the File menu, Save As as tiff files.\n\tNOTE: Do not create stacks with the thumb images. These files are not very useful and can be deleted to save room on the hard drive. Also, image files are saved as the following:\n\tBASE NAME_WAVELENGTH_sCHANNEL#_tIMAGE#.\n\tFor example, 07062018_W1FITC 100_s12_t112 is for the channel 12, time point 112, image in the first wavelength-FITC 100% camera data with the base name \"07062018\".\nFinally, select Save As from the File drop-down menu to save the sequence as a tiff stack. Stacks can also be overlaid and saved as a movie. This is addressed in step 9.\nBefore quantifying the % surface coverage, calibrate the image distances. Under Analysis Tools, click on Calibrate Distances. Select the appropriate calibration measurement and click Apply to All Open Images.",
    "While the stack is on the first image of the sequence, click on the Threshold button. Use Auto Threshold for Light Objects to threshold for fluorescent signal (FITC wavelength) and Auto Threshold for Dark Objects to threshold in bright field. Adjust threshold to the coverage that represents the coverage of the image.\n\t\nFor fluorescent thresholds, utilize a channel with non-fluorescent cells to establish any background signal and set the minimum threshold value to exclude signal detected in channels containing these non-fluorescent cells to ensure the signal measurement does not overestimate the area of fluorescence. This may be different from run to run so it is a good idea to use at least one, if not more, channel(s) for non-fluorescent controls.\nFor bright field thresholds, if all cells are not covered by the orange threshold signature, adjust the maximum threshold value either via the sliding toolbar or using the Threshold Image (found under the Analysis Tools) so that all cells are covered but any background is excluded.\n\t\tNOTE: While these threshold values ideally would be used for all images within a stack and for all channels, threshold values selected for one image/channel may not be appropriate for other images or channels, therefore the user may need to adjust the threshold range periodically. For this reason, it is a good idea to always record the maximum and minimum threshold values used should the data need to be reviewed later.",
    "To quantify the coverage, under Analysis Tools, click Show Region Statistics. Make sure that Use Threshold is checked, the Entire Image is selected, and under Obtained Data, make sure the desired measurements/settings are selected (threshold area, average, standard deviation, min, max, and % threshold area). Click on Open Log and make sure DDE file is selected before clicking OK. Select Microsoft Excel and click OK. In the spreadsheet that will open, click Log Data to automatically record the measurements of the image being analyzed.\nLeaving this spreadsheet open, use the same sheet to collect all image analysis data for a single stack. In the stack, go to the fourth image and threshold to the optimal settings. Click on Log Data in the Show Region Statistics screen and the values are logged into the spreadsheet. Repeat this for analysis of images every 15 min.\n8. Other Analysis Including Morphology and Surface Coverage Measure Using Python scripts from the Biofilm Morphology Suite\nInstall a distribution of Python 3.6 that includes standard scientific modules by using a standard scientific Python distribution such as Anaconda, available at https://www.anaconda.com/download.\nObtain the Biofilm Morphology Suite from GitHub in a browser by navigating to https://github.com/cdwentworth/Biofilm-Morphology-Suite.git, then select Clone or download (green button) and select Download Zip. Unzip the file and move the code folders to a working directory.\nMeasure percent thresholded coverage by copying the image stack into the \"Coverage\" folder. Use a terminal window to navigate to that folder and then execute the script with the command\n\tpython bfCoverage.py tiffStackName.tif",
    "from the command line interface, where tiffStackName.tif is the name of the file containing the tiff stack of images. A text file containing the coverage measurements at each time point will be created with the name tiffStackName.txt and a graphics file with a plot of coverage as a function of time will be created with the name tiffStackName.png.\nUse the same procedure specified in step 8.3 to measure the other morphological characteristics: biofilm accumulation, roughness coefficient, and textural entropy. Use the bfAcc.py script for the accumulation measurement, the roughCoef.py script for the roughness coefficient measurement, and the TEvsTime.py script for the textural entropy measurement.\n9. Other Software Applications - Making Overlays and Movies\nIf multiple wavelengths are used, create overlay stacks including these wavelengths. Open all stacks of interest and calibrate the distance as done in step 7.6.\n\t\nUnder Analysis Tools, select Overlay Images. Set the sources as the stacks of interest. In the FITC stack, click on the rainbow circle and select green color filter to be added in order to highlight this wavelength.\nUse bal to adjust the overlay so that the FITC stack is apparent in the images. After all adjustments have been made, select All Planes for both stacks and click Apply. Save the overlays in the same way as stacks described in step 7.5 or as a movie described in step 9.2.\nTo save stacks or overlays as a timelapse movie, under MM Standard and Stack, click on Make Movie. Select the source as the stack or overlay that is desired. Click Save and save as a Microsoft Video 1 with a quality set between 70-80."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}