{
  "id": 12091,
  "origin_website": "Jove",
  "title": "Performing Data Mining And Integrative Analysis Of Biomarker in Breast Cancer Using Multiple Publicly Accessible Databases",
  "procedures": [
    "1. Expression Pattern Analysis\nGo to the ONCOMINE web interface26.\nObtain the relative expression levels of gene ID1 in various types of malignancies by typing ID1 to the Search Box.\nSelect Analysis Type from the Primary Filters menu. Then, select Cancer vs. Normal Analysis, Breast Cancer vs. Normal Analysis.\nSelect Gene Summary View from the OTHER VIEWS menu. Set the threshold of P-value at 0.01. Download the figures.\n\tNOTE: The threshold of fold change is 2, as described in the previous study27.\n2. Expression Correlation Analysis\nGo to the bc-GenExMiner v4.0 web interface28.\nSelect CORRELATION from the ANALYSIS menu, press the EXHAUSTIVE button. Type ID1 to the search box. Press the Submit button and the Start analysis button.\n\tNOTE: Default setting show expression correlation analysis of all patients, which can be more accurate in different subtypes of breast cancer by pressing the Molecule subtype filter.\n3. Subgroup Analysis\nSubgroup analysis in bc-GenExMiner v4.0\n\t\nGo to the bc-GenExMiner v4.0 web interface28.\nSelect EXPRESSION from the ANALYSIS menu, press the EXHAUSTIVE button. Type ID1 to the search box and press the Submit button and the Start analysis button.\nClick the Nodal status (LN) and Scarff Bloom & Richardson grade status (SBR) thumbnails to view full images. In the SBR images, press the button below to visualize the P-values of the figures. Download the figures.\nSubgroup analysis in Gene expression-based Outcome for Breast Cancer Online (GOBO)\n\t\nGo to the GOBO web interface14.\nType Gene symbol of interest ID1 to the screen upload the gene set.\nSet the search range of Define gene/probe identifiers to Gene Symbol. Set All in Tumor selection. Select Node status and Grade stratified in the Multivariate parameters. Other items remain default. Submit the inquiry and download the figures.\n4. Survival Analysis\nSurvival analysis in bc-GenExMiner v4.0",
    "Go to the bc-GenExMiner v4.0 web interface28.\nSelect PROGNOSTIC from the ANALYSIS menu, press the EXHAUSTIVE button. Type ID1 to the search box and press the Submit button and the Start analysis button.\nIn the Exhaustive prognostic analysis, select Nm, ERm, MR in the Population and event criteria and press the Submit button to obtain more information. Press the Kaplan-Meier curve thumbnails to export the full graphs.\n\t\tNOTE: N (+, -, m): nodal status (+: positive, -: negative, m: mixed); ER (+, -, m): oestrogen receptor status (+: positive, -: negative, m: mixed); MR: metastatic relapse\nSurvival analysis in The Human Protein Atlas (HPA)\n\t\nGo to the Human Protein Atlas web interface29.\nType ID1 to the search box and click the Search button. Select Pathology sub-atlas.\n\t\tNOTE: The mRNA expression levels across the 17 cancer types are shown in the RNA Expression overview section. Every cancer tissue label of the box plot is clickable to access a detailed page providing survival analysis data and RNA expression levels.\nClick the label of Breast Cancer, then the detailed page to show interactive survival scatter plot and survival analysis. Download the figures.\nSurvival analysis in The Kaplan-Meier Plotter Survival\n\t\nGo to the Kaplan-Meier Plotter web interface30. Click Start KM plotter for breast cancer in the mRNA gene chip zone.\nType ID1 to the search bar and select the green item in the candidate menu.\nSelect RFS as survival type and Other items remain default. Click Draw Kaplan-Meier plot and download the figures.",
    "NOTE: Settings of the survival types, cutoff types, and follow-up threshold, as well as probe set options, can be changed as required. Subgroup prognostic analysis including ER, PR, HER-2, lymph nodes, grade, Tp53 status, and molecular subtypes can be obtained via changing the setting in the Restrict analysis to subtypes box1. Likewise, the filter limitation of treatment could be set in Restrict analysis to selected cohorts’ box.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}