{
  "id": 8265,
  "origin_website": "Bio",
  "title": "Dissection of Different Areas from Mouse Hippocampus",
  "procedures": [
    "Place container of 1x Cutting Solution in a filled ice bucket, and transfer ~15 ml of the solution into a 20 ml beaker also on wet ice.   Oxygenate the solutions in both the bottle and beaker for at least 20 min before beginning (see below).   Surround bench with cloth diapers, and secure a biohazard waste bag near the work bench.   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205257_2113.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205333_3098.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205344_6822.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205413_1990.jpg    Place all dissection tools except razor blades and scalpel into a 600 ml beaker containing sterile water and WypAll or KimWipe cloths submerged in the water. Place the tools facing down on the cloths so as to minimize direct contact with the glass beaker.   Place labeled microtubes in a bucket containing dry ice (blue bucket above). Likewise, place one piece of a petri dish on the dry ice and let cool.   Place small ice bucket containing ice under microscope (purple bucket above).   Fill one ice bucket with ice and secure the other piece of the petri dish on the ice so that the edges are facing down. Place one piece of filter paper on the dish.   Immediately before beginning, transfer enough cutting solution from the 20 ml beaker to the filter paper and spread evenly.   Place a new cloth diaper over the bench before each dissection. Place the mouse on the diaper, maintaining a grip over the tail with the right hand (for right-handed individuals).   Rapidly secure the mouse with the left hand such that the scruff posterior to the rodent’s head is firmly held between the left thumb and proximal forefinger. The mouse should be firmly in the experimenter’s control at this point. Transfer the base of the tail from the right hand to the left hand so that it is secured between the distal ring and little fingers.",
    "Place smooth end of large scissors just behind the skull and hold down firmly with the right hand. Rapidly pull on the tail with the left hand until the rodent skull is dislocated from the spinal cord.   After cervical dislocation, decapitate with the same scissors, being sure to cut just behind the skull. If the cut is too far posterior, excess tissue will occlude the foramen magnum.   While gently pulling the scalp to lateral sides, cut scalp skin from between the rodent’s eyes down the midline using a razor blade.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205519_1872.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205606_8452.jpg    Place one tip of the fine scissors into the foramen magnum and cut laterally into the skull. Repeat for the other side. Gently cut from the same cavity up the midline towards the nose, trying to keep the end of the scissors as superficial as possible so as not to perturb the brain.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029205943_3112.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210000_7832.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210035_0565.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210055_5705.jpg    Make small cuts from the midline incision near the eyes laterally.   Use forceps to apply gentle tangential, lateral pressure to either of the newly formed skull flaps. Repeat for the remaining side. If force is properly applied, the skull should be fully removed and the brain exposed. If a piece of skull breaks off before the respective hemisphere is exposed, discard it and use forceps again to coerce the remaining flap to the side. In this case, be sure to minimize contact between the forceps tips and brain tissue.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210211_3711.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210227_1115.jpg    Use longer microspatula to gently transfer the brain to the 20 ml beaker of oxygenated cutting solution. This involves tearing cranial nerve fibers near the base of the brain.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210357_5605.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210448_7598.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210555_7775.jpg    Use the spoon to transfer the brain to the wetted filter paper, and hemisect the brain using a clean razor blade. Transfer either hemisphere back to the 20 ml beaker.",
    "Using the two short microspatulas, remove the hippocampus: Anchor one spatula tip just over the cerebellum near the junction with the cortex. Place the other spatula tip near the same junction and peel the cortical hemisphere laterally in a gentle manner. Periodically use the transfer pipette to apply fresh cutting solution to the tissue.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210759_6729.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210841_9490.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210900_7938.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029210921_6822.jpg    Once the cortical hemisphere is fully peeled laterally, the hippocampus should be exposed. While anchoring the brain with one spatula tip, place the other just under the caudal tip of the hippocampus. Carefully apply pressure to the medial white matter tracts with the anchoring spatula while moving the second spatula tip slightly anteriorly and laterally. “Scoop” or “roll” the hippocampus laterally with that spatula tip. If done properly, the hippocampus should land on the filter paper with “glossy” end up. Repeat for the second hemisphere.   Once both hippocampi are removed and placed on the filter paper, transfer it along with the petri dish piece to the ice bucket underneath the microscope. Align each hippocampus so that the anterior end (slightly thinner than the posterior end – this is more easily seen by observing the hippocampus from the side rather than the top) is facing upward.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211115_0788.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211126_9037.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211137_6677.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211147_3553.jpg    Use the scalpel to make small vertical incisions in both the anterior and posterior tips of the hippocampus. This will create flat, blunt tips.   Make a similar incision about 1/3rd or 1/4th of the way from the anterior to posterior end while observing through the microscope. Carefully “stand” the small segment of the tissue above the blade on the face created earlier (right figure below – CA1 is on top). Be sure to apply fresh cutting solution but only in small quantities – excess solution will blur the distinctions of the hippocampal subregions.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211247_1814.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211254_7942.",
    "jpg    Using the scalpel, dissect out area CA1, CA3 or dentate gyrus (DG) with one curved cut downwards through the tissue (see diagram below for approximate dissection guidelines for a right hippocampus cross-section). Immediately transfer the dissected tissue with the scalpel to the petri dish piece on dry ice. The tissue should freeze very rapidly.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211922_2365.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211935_5589.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029211946_3073.jpgimgsrc:https://en-cdn.bio-protocol.org/attached/image/20131029/20131029212005_8386.jpg    Repeat step 23 with the remaining piece of tissue, keeping in mind that CA1 ends approximately 2/3rds of the way from the anterior to posterior end. Depending on the thickness of pieces cut, a total of 2-4 segments will have been created. Work quickly and minimize overall disruption of brain tissue.   Once all pieces of tissue are frozen on dry ice, use the scalpel blade to detach the tissue from the petri dish and place in a labeled microtube. It is often convenient to “stack” tissue on the petri dish as it is collected. This way, one larger piece will be created, and it can be dislodged more easily than multiple small pieces of frozen tissue.   Store microtubes at -80 °C until tissue is ready for processing."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}