{
  "id": 19626,
  "origin_website": "Jove",
  "title": "Co-Culturing Microglia and Cortical Neurons Differentiated from Human Induced Pluripotent Stem Cells",
  "procedures": [
    "The human iPSCs used in this study were reprogrammed from fibroblasts that had been obtained through informed consent from healthy control subjects, with approval from the institutional review board (IRB). The reprogramming and characterization of iPSCs used in this study (ML15, ML27, ML40, ML56, ML141, ML 250, ML292) were described in a prior study51.\n1. Maintenance of iPSCs\nPrepare a 1:50 dilution of LDEV-free reduced growth factor basement membrane matrix in DMEM/F12 without phenol red and pre-coat a 6-well plate with 1 mL of the diluted solution for at least 2 h at 37 °C prior to thawing cell stocks.\nThaw cryopreserved iPSC stocks in a 37 °C water bath for 2 min. Add the cells to a 15 mL centrifuge tube containing 5 mL of DMEM/F12. Spin the cells down at 300 x g for 5 min.\nRemove the coating solution from the pre-coated LDEV-free reduced growth factor basement membrane matrix plate and add 1 mL of stem cell medium (SCM) with 10 µM Rock inhibitor (Y-27632).\nResuspend the cell pellet in SCM with 10 µM Y-27632 and add to the pre-coated plate for a final volume of 2 mL of SCM plus Y-27632. Maintain iPSC cell cultures in this medium for 24 h in a 37 °C incubator.\nReplace the medium with 2 mL of fresh SCM without Y-27632 24 h after thawing.\nAfter iPSCs reach 80-90% confluence, passage them onto 75 mL flasks coated with LDEV-free reduced growth factor basement membrane matrix.\n\t\nPassage cells by first rinsing cells with HBSS and remove after letting sit for 30 s. Add 1 mL of non-enzymatic cell dissociation reagent and incubate for 4 min at 37 °C. Prepare the plate with SCM containing 10 µM Y-27632.",
    "Aspirate non-enzymatic cell dissociation reagent and add 1 mL of SCM + 10 µM Y-27632 to each well. Gently scrape the well with a cell lifter and obtain cells with a 1000 µL pipette.\nDeposit cells onto LDEV-free reduced growth factor basement membrane matrix-coated 75 mm flask in a total volume of 8 mL of SCM + Y-27632.\n2. Microglia differentiation\nNOTE: A schematic outlining the microglia differentiation protocol is depicted in Figure 1A. Media were warmed to room temperature before use.\nDay 0: Perform a complete medium change with SCM medium supplemented with 80 ng/mL BMP-4. Perform daily medium changes with this same medium during Days 1-3, without any washing between medium changes.\nDay 4: Prepare Day 4-5 medium: Hematopoietic medium (HM), supplemented with 25 ng/mL FGF, 100 ng/mL SCF, and 80 ng/mL VEGF. Remove the medium and replace with Day 4-5 medium containing 5 µM Y-27632.\n\tNOTE: Cells begin to float at this point - about half the cells are floating, and half are adherent.\nDay 6: Prepare Day 6-13 medium: HM supplemented with 50 ng/mL SCF, 50 ng/mL IL-3, 5 ng/mL TPO, 50 ng/mL m-CSF, and 50 ng/mL Flt3-L. Collect the supernatant, add to a 15-mL conical tube and spin down for 8 min at 300 x g. Resuspend the pellet in a flask with 8 mL of Day 6-13 medium supplemented with 5 µM Y-27632.\nDay 10: Add 8 mL of Day 6-13 medium on top of the existing medium.",
    "Day 14: Prepare Day 14+ medium: HM supplemented with 50 ng/mL m-CSF, 50 ng/mL Flt3-L, 50 ng/mL GM-CSF. Collect the supernatant, add to a 50 mL conical tube and spin down for 8 min at 300 x g. Resuspend the pellet in 8 mL of Day 14+ medium containing 5 µM Y-27632 and continue to culture in this medium.\nDay 18: Add 8 mL of Day14+ medium.\nDay 22: Add 8 mL of fresh Day14+ medium without removing the existing medium.\nDay 25: Move cells to step 2.9 or continue to maintain in Day14+ medium until day 50 of differentiation.\nAfter Day 25, collect the supernatant in a 50-mL conical tube and spin down for 8 min at 300 x g.\n\t\nPrepare adherent medium: RPMI supplemented with 1% of 200 mM L-alanyl-L-glutamine dipeptide in 0.85% NaCl solution, 25 ng/mL GM-SCF and 100 ng/mL IL-34.\nResuspend the pellet in the adherent medium containing 5 µM Y-27632.\nPlate cells at a density of 50,000 cells per cm2 on 24-well plates for different experiments: LDEV-free reduced growth factor basement membrane matrix-coated plates for microglial monoculture, 10 µg/mL poly-L-ornithine and 10 µg/mL laminin coated glass imaging plates for imaging experiments.\nDilute poly-L-ornithine and laminin in DPBS and add 250 µL/well for a 24 well imaging plate.\n\t\tNOTE: Cells in culture are now adherent in nature (Figure 1C).\nMaintain cells in culture for at least 14 days, with bi-weekly medium changes. After day 14 post-adherence, cells have reached maturation and may be used for experiments.\n3. Cortical neuron differentiation\nNOTE: A schematic outlining the cortical neuron differentiation protocol is depicted in Figure 1G.\nDay 0:",
    "Once iPSCs are confluent on LDEV-free reduced growth factor basement membrane matrix-coated plates, switch from SCM to a 50/50 mix of N2/B27 medium supplemented with 10 µM SB431542, 1 µM dorsomorphin, 100 nM LDN193189.\n\t\tNOTE: N2 medium consists of basal medium supplemented with 1% N-2 supplement, 1% 200 mM L-alanyl-L-glutamine dipeptide in 0.85% NaCl solution, 1% pen/strep. B27 medium consists of DMEM/F12 supplemented with 2% B-27 supplement, 1% 200 mM L-alanyl-L-glutamine dipeptide in 0.85% NaCl solution, 1% pen/strep.\nChange the medium with the above supplements added daily for 7 days.\nDay 7:\n\t\nPre-coat plates in LDEV-free reduced growth factor basement membrane matrix for at least 2 h.\nPassage cells 1:1 onto pre-coated plates. Rinse cells with 1 mL/well HBSS and remove after letting it sit for 30 s. Add 1 mL/well of cell detachment medium (e.g., Accutase) and incubate for 4-5 min at 37 °C. While incubating, prepare 15 mL conical tubes with 5 mL of DMEM.\nGently pipette enzymatic dissociation agent to remove cells from the plate with a P1000 pipettor. Collect enzymatic dissociation agent and cell mixture in the 15 mL conical tube containing 5 mL DMEM.\nCentrifuge the tubes for 5 min at 300 x g. Resuspend the pellet in 1 mL of N2/B27 medium containing 10 µM Y-27632. Continue daily feedings with N2/B27 medium without any supplements.\nDay 12: Passage cells 1:1 using methods described in 3.2.2. Continue daily feedings with N2/B27 medium.\nDay 15/16: Passage cells 1:2 using methods described in 3.2.2. Continue daily feedings with N2/B27 medium.\nDay 18/19: Passage cells 1:3 using methods described in 3.2.2. Continue daily feedings with N2/B27 medium until day 25.\nDay 25: Feed cells with N2/B27 medium supplemented with 10 µM of DAPT.\nDay 28: Feed cells with fresh, untreated N2/B27 medium.",
    "Day 30: Passage cells using methods described in 3.2 onto the microglia culture plates and maintain in BrainPhys medium supplemented with 1% B-27 supplement.\n4. Microglia/neuron co-cultures\nPlate Day 30 cortical neurons on top of microglial cultures at a density of 50,000 cells per cm2. Supplement medium with laminin 1 µg/mL to improve cell adherence.\nMaintain cultures in a mix of 50% adherent medium and 50% Brainohys medium supplemented with 1% B-27 supplement. Perform half-medium change bi-weekly until experimentation.\nPerform experiments after neurons reach day 60.\n5. Interferon-γ treatment\nPrepare fresh medium supplemented with 100 ng/mL IFN-γ. Add the medium and let it incubate for 24 h. Remove the medium and proceed to experimentation.\n6. Immunocytochemistry\nFix cells in the culture dish with 100 μL of 4% paraformaldehyde at room temperature for 20 min.\nRinse cells in 1 mL of PBS thrice for 5 min each.\nAdd 1 mL of PBST (PBS + 0.1% Triton X) for 10 min.\nAdd blocking buffer: 1 mL of PBS plus 5% goat serum for 1 h.\nAdd primary antibody diluted in 100 μL of PBS + 1% goat serum - overnight at 4 °C. Optimize all primary antibodies accordingly.\nRinse cells in 1 mL of PBS thrice for 5 min each.\nAdd secondary antibody, diluted in 100 μL of PBS plus 1% goat serum - for 1 h at room temperature.\n7. Spine analysis\nObtain images on a confocal microscope at 60x magnification.\nUse ImageJ function NeuronJ52 to analyze images.\nObtain measurements for neurite length, spine length, and spine count through NeuronJ.\n8. Calcium imaging\nPrepare fresh medium with 3 µM Fluo-4AM dye. Incubate co-cultures in this medium for 30 min at 37 °C. Then rinse the cells with PBS, add live-cell imaging solution to the cells, and proceed to the imaging.",
    "Using a confocal microscope equipped for live-cell imaging, obtain time-lapse images at 40x for 2 min. Activity can be recorded at baseline, with exposure to 15 mM glutamate, or in the setting of depolarization with 5 mM potassium chloride.\nUsing ImageJ, measure fluorescence intensity over time for individual cell bodies. Using the selection tool, select individual region of interest (ROI) surrounding each cell body. Open the ROI Manager and press Add to select. Continue to add new selections to the ROI manager.\nUse the Set Measurements tool to measure Mean Gray Area. When the number of desired cell bodies has been added to the ROI manager, select them all and then use the Multi-Measure tool. This will provide a readout of the mean gray area for each over the time course of the video file. The exported data will give mean fluorescence intensity for the region of interest for each frame.\nDetermine fluorescence intensity ratio, F/F0, where F is the fluorescence intensity at a given time and F0 is the initial fluorescence intensity. F/F0 can be graphed over time to examine spontaneous activity in neurons or examined at the maximum fluorescent intensity in the setting of stimulation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}