{
  "id": 13709,
  "origin_website": "Jove",
  "title": " Murine Dermal Fibroblast Isolation by FACS",
  "procedures": [
    "This protocol follows methods approved by the Stanford University Administrative Panel on Laboratory Animal Care.\n1. Digestion of Murine Dermis\nEuthanize mice by cervical dislocation after anesthesia with an intraperitoneal injection of ketamine 100 mg/kg + xylazine 20 mg/kg + acepromazine 3 mg/kg.\n\tNote: Various ages and backgrounds can be used.\nShave and depilate the dorsal skin. Approximately 100,000 cells can be isolated from a piece of dorsal skin 60 mm x 100 mm.\nSubmerge the mouse in 70% ethanol and place on a clean, sterile surface to dry.\nImmediately harvest dorsal mouse skin using sterile dissecting scissors. In female mice, avoid including the mammary tissue.\nStarting the base of the tail, use forceps to tent up the skin and make a transverse cut before dissecting along the supra-fascial plane.\nCarefully avoid including any subcutaneous fat while harvesting the skin. Examine the harvested skin for any subcutaneous fat and carefully scrape it off using the blunt edge of a scalpel.\nRinse the harvested skin in betadine followed by 5x PBS washes on ice.\n\tNote: It is important to keep the skin as close to sterile as possible to avoid contamination.\nMince the skin using razor blades and dissecting scissors in a sterile dish until the sample is of a uniform consistency with 2-3 mm pieces.\nPrepare 50 ml conical tubes containing 20 ml collagenase IV at a concentration of 1 mg/ml in DMEM. Divide the dermis into the tubes on the basis of five mice per tube.\nAgitate samples vigorously while incubating at 37 °C for 1 hr in either a water bath or oven.\nRemove samples from the incubator and pass through a 10 ml syringe without a needle 3-5x in a sterile hood.",
    "Place the samples back into the incubator at 37 °C and shake vigorously for a further 30 min.\nIn a sterile hood, pipette the samples up and down 3-5x using a 10 ml pipette. Pipette the sample through a 100 µm filter into a new 50 ml conical tube.\nPass 20 ml of 10% FBS DMEM through the same filter to maximize cell yield and bring the total volume to 40 ml. Centrifuge at 300 g for 8 min at 4 °C.\nRemove the supernatant using a sterile glass pipette, taking great care to first remove the upper fat layer prior to remaining supernatant.\n\tNote: This step is critical to reduce adipocyte contamination.\nResuspend the pellets in 20 ml 10% FBS DMEM.\nPass the cell/DMEM suspension through a 70 µm filter.\nRinse the filter with 10 ml 10% FBS DMEM and centrifuge the filtered suspension at 300 g for 8 min at 4 °C.\nRemove the supernatant using a sterile glass pipette, again taking care to first remove any remaining fat layer.\nIf there is significant RBC contamination (the pellet is visibly red), re-suspend the pellets in 20 ml ACK lysis buffer and incubate for 5 min at RT. Otherwise skip to step 24.\nAdd an equal volume (20 ml) of FACS buffer (PBS, 10% FBS, 0.1% sodium azide), then mix, and keep aside a 5 ml aliquot as an unstained control. Centrifuge the remaining sample at 300 g for 8 min at 4 °C.\nRemove supernatant and put pellet on ice. The cells may be frozen down at this point if FACS time is not available.\n2. Isolation of Fibroblasts by FACS",
    "Make 500 µl of lineage antibody incubation mix for each pellet. Do this by first adding 475 µl of FACS buffer containing DNase (10 µg/ml) to a tube, and then adding fluorophore-conjugated CD31 (1:100), CD45 (1:200), Tie2 (1:50), Ter-119 (1:200), and EpCAM (1:100) antibodies to achieve the respective dilution for each antibody.\nRe-suspend each pellet in 500 µl of lineage antibody incubation mix and incubate this suspension on ice for 20 min.\nAdd 5 ml FACS buffer containing DNase (10 µg/ml) to the sample and gently mix. Centrifuge at 300 g for 8 min at 4 °C.\nRemove the supernatant and wash the cell pellet with 5ml FACS buffer containing DNase (10 µg/ml) and centrifuge using the same conditions as in step 26.\nResuspend the pellet in 500 µl FACS buffer containing DNase (10 µg/ml) and put aside a 50 µl aliquot as a viability dye control.\nAdd viability dye of choice to the remaining sample in the concentration indicated for the chosen dye.\nPerform FACS analysis31 and sorting for Viability Dye-/CD31-/CD45-/Tie2-/Ter-119-/EpCAM- cells (see Figure 2A). Sort directly into FACS buffer.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}