{
  "id": 13117,
  "origin_website": "Jove",
  "title": "Rapid Isolation of Single Cells from Mouse and Human Teeth",
  "procedures": [
    "All animal experiments were performed according to the International and local regulations and approved by the Ministry of Education, youth and sports, Czech Republic (MSMT-8360/2019-2; MSMT-9231/2020-2; MSMT-272/2020-3). This protocol was tested with both male and female wildtype C57BL/6 and CD-1 mice and with genetically modified Sox10::iCreERT2 mice17 (combined with various reporter systems) on a C57BL/6 background. Experiments with human samples were performed with the approval of the Committees for Ethics of the Medical Faculty, Masaryk University Brno & St. Anne´s Faculty Hospital in Brno, Czech republic.\n1. Experimental set-up and preparation of solutions\nInstrument set-up\n\t\nCool down the centrifuge to 4 °C.\nHeat the incubation chamber to 37 °C.\nStart the Fluorescence-activated cell sorting (FACS) machine and set all the temperatures of the sorter (including collection tube holder) to 4 °C. Perform the instrument quality control, set the drop delay.\nSet the preliminary gating strategy and perform the test sorting.\n\t\tNOTE: When using FACS, use the 100 µm nozzle.\nPrepare the solutions (steps 1.2.1-1.2.3).\n\t\nWash solution: Prepare fresh 2% FBS (Fetal Bovine Serum) in HBSS (Hanks' Balanced Salt Solution).\nDigestion mixture: Prepare fresh collagenase P (3 U/mL) fully dissolved in HBSS.\nOptional: Prepare fresh HBSS + BSA (0.04%) and chill analytical grade methanol in a -20 °C freezer for storing single-cell suspension at -80 °C.\n\t\t​NOTE: Step 1 needs to be performed before the start of the experiment. The composition of the utilized solutions is summarized in Supplementary Table 1.\n2. Preparation of experimental animal/s and human tooth\nPrepare the experimental animals (mouse).\n\t\nEuthanize the mouse according to the local regulations; e.g. by anaesthetics overdose as described previously1.\n\t\tCAUTION: Regulations for humane euthanizing of experimental animals varies locally. Always follow valid local regulations.\nImmediately proceed to the tissue dissection step (step 3).",
    "NOTE: If the tissue from the experimental animals cannot be dissected immediately (e.g., because of transfer from animal housing facility), place the experimental animals on ice and perform tissue dissection as soon as possible. To obtain more cells from mouse molar pulps, use younger (6 weeks and less) animals. With increasing age, the size of dental pulp decreases. Mouse incisors mostly keep their structure with increasing age so animals of various ages can be used for tissue dissection.\nPrepare the human tooth\n\tNOTE: Human teeth were extracted for a clinically relevant reason. Every diagnosis was treated individually, and an experienced dental surgeon always performed the tooth extraction.\n\t\nPut the freshly extracted tooth immediately into a 50 mL tube with ice-cold HBSS and keep the tube on ice until further processing.\n\t\tNOTE: Using retained wisdom teeth from patients until age 25-30 is recommended for the highest cell yield.\n3. Tissue dissection\nHold the experimental animal behind its head, looking on the ventral aspect of its head so that the tail points away.\nUsing small, sharp scissors, quickly remove the skin from the mandible to expose the mandibular arch, the soft tissue between each half of the mandibles, and the adjacent facial muscles.\n\t\nMake a deep cut from each side of the mandible; firstly, through m. masseter along the buccal side of the mandible up to the temporomandibular joint, and then along the inner part of each half of the mandible through the base of the oral cavity (see Supplementary Figure 1).\nCut all the muscles and ligaments along the mandible up to the temporomandibular joint from both outside and inside of the oral cavity.\n\tNOTE: Avoid cutting bones. This might damage the most apical part of the incisor.",
    "Grasp the mandible using bent tip tweezers and remove it. Then, split the dissected mandible into two halves with scissors by cutting through mandibular symphysis (see Supplementary Figure 1).\nUse an industrial low lint wipe to chafe the remaining soft tissue from each half of the mandible. After both parts of the mandible are cleaned, place them into a pre-prepared Petri dish with ice-cold HBSS.\n\tNOTE: From this point forward, work on ice. Further dissection of mouse incisors and molars is performed under a stereomicroscope with a black background.\nMouse mandibular incisors\n\t\nFor the dissection of mandibular incisors, remove the alveolar ridge with all three molars and transversally crack the mandibular arch in the place corresponding to the position between the first and second molar.\n\t\tNOTE: A sharp scalpel blade no. 11 and tweezers are used to perform this step (see Table of Materials).\nCarefully pull the incisor out of the rest of the dental socket.\n\t\tNOTE: If successful, the extracted incisor will contain intact apical parts, including epithelial tissue with complete cervical loops.\nIf needed, remove the remaining fragments of bone still attached to the incisor with tweezers and a scalpel.\nPlace the dissected incisors into fresh, ice-cold HBSS and dissect the tissue of interest: cervical loop, dental pulp, or other parts of the tooth.\nPlace the dissected soft tissue into a droplet of fresh, ice-cold HBSS in the middle of a 10 cm Petri dish. Keep on ice.\nMouse mandibular molars\n\t\nFor dissecting mandibular molars, completely remove the alveolar ridge from the rest of the mandible using a scalpel blade.\nMove the dissected alveolar crest into fresh, ice-cold HBSS in a Petri dish and carefully remove all the remaining fragments of alveolar bones attached to the roots.",
    "Place the dissected molars without alveolar bone into fresh, ice-cold HBSS. To expose the pulp, start to remove parts of the dentin from the apical side using fine, sharp tip tweezers until you reach the pulp cavity.\nOnce the pulp cavity is reached, carefully dissect dental pulp using a pair of sharp tip tweezers and place the soft tissue of the dental pulp into a droplet of fresh, ice-cold HBSS in the middle of a 10 cm Petri dish kept on ice.\n\t\tNOTE: Since mouse molar pulps are extremely small, adapt magnification on the stereomicroscope accordingly.\nHuman tooth\n\t\nWash human tooth once again in ice-cold HBSS to remove the remaining blood.\nPlace the tooth into three thick-walled sterile plastic bags and use a cast iron benchtop engineer's vise to crack the tooth. Use vise jaws with a flat surface to avoid penetrating the bags.\nSlowly tighten the vise until you hear the tooth cracking; remove it from the bags and place it into fresh, ice-cold HBSS in a Petri dish.\nUsing two tweezers, take out the dental pulp, clean it from all the remnants of hard tissue and place it into one droplet of ice-cold HBSS in the middle of a 10 cm Petri dish kept on ice.\n\t\t​CAUTION: Human tissue might potentially be infectious. When working with human tissue, use protective equipment to avoid direct contact with the tissue.\n4. Preparation of single-cell suspension\nPrepare a 15 mL tube with 2.5 mL of digestion mixture composed of Collagenase P (3 U/mL) fully dissolved in HBSS. Keep the solution on ice until use.",
    "NOTE: Always use freshly prepared Collagenase P; do not freeze the aliquots. Collagenase P activity varies from batch-to-batch. Check the activity of your batch before diluting. Collagenase P is activated by calcium, whose amount is already sufficient in the lyophilized powder. Therefore, it is unnecessary to enrich the enzyme mix with calcium. Collagenase P is not inactivated by FBS but can be inactivated by chelating agents (e.g., Ethylenediaminetetraacetic - EDTA). Stopping the dissociation process is ensured by diluting the Collagenase P in Wash solution (2% FBS in HBSS). It has been shown that adding FBS increases cell viability and the final number of cells after sorting18.\nUsing a round-shaped scalpel blade no. 10, cut the tissue in all directions into the smallest possible pieces. Reaggregate the tissue pieces in the middle of the droplet and repeatedly cut the tissue aggregates using a round-shaped (No. 10) scalpel blade. Repeat this process several times until the material is sufficiently minced.\nTransfer the shredded tissue pieces using a 1 mL pipette tip into the prepared digestion mixture.\n\tNOTE: In the case of a larger number of animals being processed at once, split the tissue into several tubes with Collagenase P. The maximum amount per tube are pulps obtained from approximately 10 mouse incisors. In the case of molars, where pulps are much smaller, the number of processed pulps can be increased adequately. When using human teeth, use a maximum of 2-3 pulps per tube, depending on the pulp size.\nPlace the tube into a 37 °C preheated incubator with a shaker. Tilt the tube inside the shaker to an angle of 60° and set the speed to 150-200 rpm to ensure constant suspension movements inside the tube.",
    "Vigorously triturate the suspension every 3-4 min with a 1 mL pipette tip to disintegrate all the clumps.\n\tNOTE: With time, the clumps will become smaller and softer until they almost disappear.\nIn total, incubate for 15-20 min. At the end of the incubation, triturate for the last time, and then slowly add ice cold Wash solution to a final volume of 12 mL.\nRemove the remaining clumps or pieces of calcified tissue by filtering the suspension using a 50 µm cell strainer.\nTake 10-20 µL of the filtered cell suspension and count the cells during centrifugation using a cell counting chamber (Hemocytometer). Centrifuge for 5 min at 300 x g at 4 °C. Remove the supernatant using a 10 mL serological pipette.\n\tNOTE: If the number of cells is limited that cannot be counted in diluted suspension, skip the cell counting and use all the cells for further processing.\nOptional: Proceed for fixation and storage21.\n\t\nRe-suspend the pellets (up to 107 cells) in 100 uL of HBSS + BSA (0.04%).\nAdd 400 µL of chilled methanol and mix slowly.\nIncubate the cell suspension for 15 min on ice.\nStore at -80 °C until processed (no longer than 1 month).\nResuspend the pellet in the Wash solution. Aim for 700-1200 cells/µL of the Wash solution.\nKeep the tube on ice until further processing.\n\tNOTE: If necessary, perform the fixation and storage at -80 °C. However, immediate processing of the cell suspension for scRNA-seq is recommended. Further steps will depend based on the single-cell RNA seq protocol. When the scRNA-seq protocol uses a microfluidic system (some sc-RNA-seq companies do), load the cells based on the manufacturer's guidelines either directly or after cell sorting.\nFor FACS, proceed to step 5.\n5. Fluorescence-activated cell sorting (FACS)\nBefore sorting, prepare the cell sorting instrument.",
    "Cool down the whole system to 4 °C, perform the instrument quality control, set the drop delay and the voltage of the deflection plates. Put collection tubes in the collection tube holder.\n\t\tNOTE: To avoid additional centrifugation steps resulting in an inevitable cell loss, sort cells into a microtube (1.5 mL) with a small amount (25-50 µL) of the Wash solution.\nOptional: perform viability staining before FACS.\n\t\nAdd Propidium iodide into cell suspension before FACS to a final concentration 0.5 µg/mL and incubate for 15 min at 4 °C.\nLoad the sample into the cell sorter. Set a strict gating strategy to remove cell debris, doublets, and dead cells. Sort the cells into a prepared tube or multi-well plates. An example of a gating strategy is shown in Figure 2.\n\tNOTE: To minimize manipulation steps and accelerate the protocol, applying a strict gating strategy is recommended (suggested in Figure 2) rather than using a viability staining. To separate the immune cells from the isolated population, CD45 antibody staining can be performed. To perform this, resuspend cell suspension in 100 µL of staining solution (PBS + 2% FBS + anti-CD45-APC conjugated antibody 1/100 dilution). Incubate for 15 min on ice protected from light and perform FACS directly."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}