{
  "id": 16976,
  "origin_website": "Jove",
  "title": "Profiling Volatile Compounds in Blackcurrant Fruit using Headspace Solid-Phase Microextraction Coupled to Gas Chromatography-Mass Spectrometry",
  "procedures": [
    "1. Fruit harvesting\nGrow between 4 to 6 plants per genotype and/or treatment to ensure sufficient fruit material and variability.\nIf possible, harvest the samples on the same date; if there is not enough fruit material, pool together samples harvested on different dates.\n\tNOTE: It is recommended that the harvest time (morning, noon, afternoon) remains approximately identical as VOC profiles are affected by daytime/circadian rhythm28,29,30,31.\nAssess fruit ripening stage by visual observation32. Pool fruits from the same ripening stage, as ripening status strongly impacts VOC emission. Discard any damaged or pathogen-infected fruits.\n\tNOTE: To better assess fruit ripeness, texture analysis can be performed33. In addition, counting days after flowering can be used to ensure that pooled fruits belong to a similar ripening stage.\nInclude a minimum of 10-15 fruits per biological replicate (3 to 5) for VOC analysis.\n\tNOTE: Here, three separate pools of 13-20 fruits (biological replicates) of 'Andega', 'Ben Tron', 'Ben Gairn', 'Ben Tirran', and 'Tihope' cultivars were harvested in two locations (Poland and Scotland) in summer 2018 and directly frozen in liquid nitrogen. Samples were then sent to the laboratory and processed as described below.\nOnce harvested, freeze all fruits immediately in liquid nitrogen, and subsequently store them at -80 °C until processing.\n\t​NOTE: If possible, fruits can be directly processed after harvest. In this case, fresh fruits can be homogenized in a mixer, weighed, and directly analyzed (step 3.1 onwards). However, to prevent fruits from further postharvest degradative processes, the fresh material should be stored in a cooler (4 °C) and processed as rapidly as possible. If not properly handled, liquid nitrogen can produce cold burns and can cause asphyxiation in poorly ventilated spaces.\n2. Fruit sample and reagent preparation",
    "Grind the fruits into a fine powder, taking care to always keep them frozen with the help of liquid nitrogen. Use a cryogenic mill, bead mill, or a mortar and pestle for homogenization. Precool stainless grinding jars or mortar and pestle with liquid nitrogen to avoid sample thawing.\n\tNOTE: It is critical to homogenize samples to a fine powder to ensure proper VOC extraction.\nWeigh 1 g of frozen material (from step 2.1.) in a 5 mL tube that is previously cooled in liquid nitrogen, and note the exact weight. Keep the material at -80 °C until processing step 3.1.\nInclude 'reference' or 'control' samples in the analysis to check technical variation, including VOC extraction and HS-SPME/GC-MS performance. For this purpose, pool together a mixture of randomly chosen fruit samples, and include at least one control sample per day for VOC analysis. In addition, use an internal standard, as described in step 2.5., to minimize the impact of intensity drift.\nPrepare 20% (w/v) sodium chloride solution in high-performance liquid chromatography (HPLC) grade water (hereafter, referred to as NaCl solution). Dissolve NaCl with the help of a magnetic stirrer; ensure the availability of 1 mL of the solution per sample.\nPrepare a 1 ppm solution in HPLC grade methanol of N-pentadecane (D32, 98%) from pure commercial standard (hereafter, referred to as the internal standard).\n\tNOTE: N-pentadecane-d32 will be used as an internal standard, and 5 µL per sample will be needed. Methanol should be manipulated under a fume hood.\nPrepare 1 ppm solutions in HPLC grade methanol of pure commercial standards for VOC identification (see Table 1 for the list of commercial standards used in this study).",
    "Prepare 10 mL screw-cap headspace vials by adding 0.5 g NaCl in each needed vial. Ensure that screw caps include a septum composed of a soft material, i.e., silicone, with a thin polytetrafluoroethylene film on the inner side, to avoid contamination.\n3. Sample preparation\nAdd 1 mL of NaCl solution to the 5 mL tube containing the weighed frozen sample. Shake the tube until the sample is completely thawed and homogenized.\nCentrifuge at 5000 × g for 5 min at room temperature.\nTransfer the supernatant with a 1000 µL pipette tip to the NaCl-containing headspace vial. Cut the end of the tip to facilitate this process.\nAdd 5 µL of internal standard to each sample-containing headspace vial.\n4. HS-SPME/GC-MS data acquisition\nPlace the closed headspace vial in a GC-MS autosampler at room temperature, for an automated HS-SPME/GC-MS run, which is described in section 4. Do not place biological replicates in successive positions in the autosampler; instead, randomly distribute them to minimize the impact of intensity drift.\n\tNOTE: Approximately 10-12 vials can be placed at once in the autosampler, without affecting sample stability.\nPreincubate the headspace vials 10 min at 50 °C with agitation at 17 x g.\nInsert an SPME device into the vial to expose the fiber to the headspace for VOC extraction for 30 min at 50 °C with agitation at 17 x g.\nIntroduce the fiber into the injection port for 1 min at 250 °C in splitless mode for volatile desorption.\nClean the fiber in an SPME cleaning station with nitrogen (1 bar N2, ≥ 99.8% pure) for 5 min at 250 °C. Reuse the fiber approximately 100x.",
    "Analyze VOCs with a gas chromatograph coupled to an ion trap mass spectrometer (see the Table of Materials), and perform chromatography under a constant flow of helium (He ≥ 99.9999% purity) of 1 mL/min, with a column that has dimensions of 60 m x 0.25 mm x 1 μm thickness. Use an oven temperature program that is isothermal at 40 °C for 3 min, followed by an 8 °C/min ramp to 250 °C and holding at 250 °C for 5 min. For mass spectrometry, set the transfer line and ion source temperatures to 260 °C and 230 °C, respectively. Set the ionization energy to 70 eV and the recorded mass range to m/z 35-220 at 6 scans per s.\nExtract and analyze 1 ppm solutions of commercial standards as described above. In addition, run a mixture containing all the diluted commercial standards mixed with 300 µL NaCl solution and 900 µL HPLC grade water before sample data acquisition to check the correct calibration of the equipment. Furthermore, include a blank sample containing NaCl solution alone in every batch.\n5. Analysis of GC-MS profile chromatograms: VOC identification and semi-quantification\nOpen raw GC-MS profile files with the software provided by the manufacturer. To identify compounds, compare their retention times and mass spectra and Kovats linear retention indices determined from the chromatograms of the samples with retention indices obtained from authentic standards. For each commercial standard, annotate retention time and the most abundant m/z ions. Then, select a specific m/z ion for each VOC (Table 1).",
    "Automatically integrate VOC peaks based on standard retention times and chosen m/z ions of the selected GC-MS raw files. For this, provide a list for each VOC with retention time and selected m/z ion. Although the software automatically integrates peak area corresponding to the same retention time and m/z ion as provided in the sequence setup, check the correct integration of each peak and correct it manually if necessary.\nCalculate the peak area of each VOC relative to that of the internal standard to minimize instrumental variation and intensity drift.\n\tNOTE: When analyzing fruit from different genotypes or growth and storage conditions, it is highly recommended to determine the VOC content relative to the fruit dry weight content to rule out dilution effects due to differences in water content.\nFor batch effect correction, normalize the VOC peak area of each sample to the corresponding peak area in the control sample analyzed in the same run.\n\tNOTE: A relative VOC quantification is obtained; however, for the purpose of the experiment, VOC content can be then determined relative to any sample (e.g., untreated fruits to compare the effect of storage upon VOC levels).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}