{
  "id": 9957,
  "origin_website": "Jove",
  "title": "Mimicking the Function of Signaling Proteins: Toward Artificial Signal Transduction Therapy",
  "procedures": [
    "1. Synthesis of the 'Chemical Transducer'\nPreliminary Preparations\n\t\nPrepare 2 M triethylammonium acetate (TEAA) buffer by mixing 278 ml of triethylamine with 114 ml of acetic acid and 400 ml of ultrapure water. Adjust the pH to 7 and add water to a final volume of 1 L. Keep it in a dark bottle.\n\t\tNote: This solution is stable for years.\nPrepare a 5 mM ascorbic acid solution by dissolving 18 mg of ascorbic acid in 20 ml of ultrapure water. Use a fresh solution; the solution is stable for one day.\nPrepare a 10 mM Cu(II)/Tris(benzyltriazolylmethyl)amine (TBTA) solution by dissolving 25 mg of copper(II) sulfate pentahydrate in 10 ml of ultrapure water and 58 mg of TBTA in 11 ml dimethyl sulfoxide (DMSO). Mix the two solutions. Keep it at room temperature and protect it from light.\nConjugation Procedure\n\t\nDissolve 100 nmol of the modified oligonucleotide (ODN-1) in 80 µl of fresh ultrapure water. Add 20 µl of 2 M TEAA, pH = 7. Add 80 µl of a freshly made solution of ascorbic acid (5 mM in water).\nDissolve 1.5 µmol (574.5 µg) of azido-modified ethacrynic acid in 180 µl of DMSO and add it to the solution. Degas the solution using Argon for 60 sec and quickly add 40 µl from the Cu(II)/TBTA solution (10 mM in 55% (v/v) DMSO/water).\nPurge again with Argon, close tightly, and stir overnight.\nMonitor the progress of the reaction and purify the conjugate by RP-HPLC (mobile phase: A) 5% Acetonitrile, 5% TEAA, 90% ultrapure water; B) 65% Acetonitrile, 5% TEAA, 30% ultrapure water).24\n2. Controlling GST Activity by PDGF\nPreliminary Preparations",
    "Prepare 50 ml of the Assay buffer by mixing 33.9 ml of phosphate buffered saline (PBSx1) with 16.1 ml of ultrapure water to achieve an 8 mM final phosphate concentration and add 23.8 mg of MgCl2 to achieve a 5 mM final concentration.\nPrepare a stock solution of GST M1-1 by dissolving the protein in a buffer containing 50 mM Tris pH 7.5, 50 mM NaCl, 1 mM dithiothreitol (DTT), and 5 mM ethylenediaminetetraacetic acid (EDTA) to a final concentration of 30 µM. Divide this solution into small aliquots and store at -80 ˚C. Dilute freshly, according to section 2.1.5.1, in the Assay buffer and keep on ice.\n\t\tNote: The solution will be stable for about 5 hr, or until there is a reduction in the enzyme activity.\nPrepare the substrate according to the following instructions:\n\t\t\nDissolve 10 mg of reduced Glutathione (GSH) in 325 µl of ultrapure water to a final concentration of 100 mM stock solution. Dilute 21 µl from this stock solution in 979 µl of Assay buffer for a final concentration of 2.1 mM working solution.\nDissolve 10 mg of 2,4-dinitrochlorobenzene (CDNB) in 492 µl of ethanol to a final concentration of 100 mM stock solution. Dilute 43.2 µl from the stock solution in 956.8 µl of an Assay buffer for a final concentration of 4.32 mM working solution.\nIn a 96-well plate, put each substrate in a separate line (12 wells). Insert at least 60 µl into each well to allow fast and easy withdrawal of the solution. Cover the plate with an aluminum sheet for light protection.\nPrepare the following stock solutions in the Assay buffer:\n\t\t\nDilute GST M1-1 by 50 to a final concentration of 0.6 µM of the dimer.\nDilute the 'chemical transducer' to a 30 µM stock solution.",
    "Dilute PDGF to a final concentration of 40 µM.\nDilute PDGF aptamer to a final concentration of 250 µM.\nMeasure the GST Activity in the Presence of the 'chemical transducer' and PDGF.\n\t\nSet up an experimental procedure in the plate reader for kinetic measurement.\n\t\t\nCreate a new experiment as a 'standard protocol'.\nPress on 'procedure' to open up the procedure settings window.\nIn the pop up list on the upper side of the window, choose '384 plate' type according to the plate manufacturer.\nPress 'Read' on the left menu.\nRegarding the detection method choose 'Absorbance'.\nRegarding the read type choose 'End point'.\nWrite 340 nm on the wavelength window.\nPress on the 'Full plate' bottom on the upper-right side and choose the well to be measured.\nPress 'ok' to close the 'Read' window.\nChoose 'start kinetic' on the left menu.\nMake the run time 10 min.\nSelect the minimum intervals option.\nPress 'ok' to close the kinetic window.\nDrag the 'Read' line into the kinetic measurement.\nPress the 'validate' button and then the 'ok' button.\nSave the experiment.\nPress the 'play' button. A dialog box will appear — press the 'ok' button only when the measurement should be started.\nIn order to perform the triplicates experiment, prepare four samples each containing 3.25 µl of the 'chemical transducer' and 3.25 µl of GST M1-1. Add to each sample 0, 1.2, 2.4, or 4.9 µl of PDGF and 123.5, 122.3, 121.1, or 118.6 µl of the Assay buffer, respectively.\nIncubate the solution at room temperature for 10 min.\nIn a 384-transparent well plate, insert 40 µl of sample to each well. Insert the samples only in the odd wells or only in the even wells in the same line to allow the use of a multi-pipettor for substrate addition.",
    "Using a 12-channel multi-pipettor, quickly add 10 µl from each of the substrates that were pre-prepared in the 96-well plate (section 2.1.4). Mix gently and quickly to avoid bubbles. Insert the plate into the reader and start the kinetic measurement. Since GST kinetics is quite fast, try to minimize the time between substrate addition and the beginning of the kinetic measurement.\nGST Activation/Inhibition Cycles Mediated by the 'chemical transducer'.\n\t\nIn order to perform the triplicates experiment, prepare 5 samples each containing 84.5 µl of Assay buffer, 3.25 µl of 'chemical transducer', and 3.25 µl of GST M1-1. Incubate at room temperature for 3 min.\nAdd 3.65 µl of Assay buffer to sample 1 and 3.65 µl of PDGF to samples 2-5. Incubate at room temperature for 3 min.\nAdd 3.12 µl of Assay buffer to samples 1-2 and 3.12 µl of PDGF aptamer to samples 3-5. Incubate at room temperature for 3 min.\nAdd 24.4 µl of Assay buffer to samples 1-3 and 24.4 µl of PDGF to samples 4-5. Incubate at room temperature for 3 min.\nAdd 7.8 µl of Assay buffer to samples 1-4 and 7.8 µl of PDGF aptamer to sample 5. Incubate at room temperature for 5 min.\nIn a 384-transparent well plate, insert 40 µl of sample into each well. Insert samples only into the odd or only into the even wells in the same line.\nUsing a 12-channel multi-pipettor, quickly add 10 µl from each substrate (pre-prepared in the 96-well plate). Mix gently and quickly to avoid bubbles. Insert the plate into the reader and start the kinetic measurement.",
    "Calculate the V0 [mOD/min] under each condition by subtracting the OD measured at 340 nm at t = 0.5 min from the OD measured at 340 nm at t = 1.5 min to assess the activation/inhibition recyclability.25\nEvaluate the Real-time Response of the 'chemical transducer' to Changes in the Environment.\n\t\nReal-time effect of PDGF addition\n\t\t\nSet up an experimental procedure in the plate reader for kinetic measurement.\nRepeat steps 2.2.1.1-2.2.1.10.\nMake the run time 3.5 min.\nSelect the minimum intervals option.\nPress 'ok' to close the kinetic window.\nDrag the 'Read' line into the kinetic measurement.\nChoose Plate Out/In on the left menu.\nChoose the option 'plate out (no dialog)'.\nChoose the 'Delay' option on the left menu and enter 30 sec.\nChoose Plate Out/In on the left menu.\nChoose the option 'plate in (no dialog)'.\nCreate a second kinetic measurement by repeating steps 2.2.1.4 - 2.2.1.14 but in section 2.2.1.11 set the kinetic to be 25 min instead of 10 min.\nPress the 'validate' button and then the 'ok' button.\nSave the experiment.\nPress the 'play' button. A dialog box will appear – press the 'ok' button only when the measurement should be started.\nPrepare two samples by mixing 1 µl of GST M1-1 and 1 µl of the 'chemical transducer' in 38 µl of Assay buffer. Insert the samples into two wells of a 384-transparent well plate, leaving an empty well between these two wells.\nUsing a 12-channel multi-pipettor, quickly add 10 µl from each substrate, mix gently and quickly to avoid bubbles, insert the plate into the reader and start the kinetic measurement.\nWhen the plate opens up (after 3.5 min), quickly add 1.125 µl of PDGF to one of the wells, mix gently, and allow the plate to close up for the remaining kinetic measurements.",
    "Real-time effect of adding the PDGF aptamer\n\t\t\nRepeat steps 2.4.1.1-2.4.1.15.\nPrepare two samples by mixing 1 µl of GST M1-1, 1 µl of the 'chemical transducer', and 1.125 µl of PDGF in 36.9 µl of Assay buffer. Insert the samples into two wells of a 384-transparent well plate, leaving an empty well between these two wells.\nUsing a 12-channel multi-pipettor, quickly add 10 µl from each substrate, mix gently and quickly to avoid bubbles, insert the plate into the reader, and start the kinetic measurement.\nWhen the plate opens up (after 1.5 min), quickly add 1.2 µl of PDGF aptamer to one of the wells, mix gently and allow the plate to close up for the remaining kinetic measurements.\nMeasure JS-K Prodrug Activation by GST in the Presence of the 'chemical transducer' and PDGF.\n\t\nSet up an experimental procedure in the plate reader for kinetic measurement.\n\t\t\nCreate a new experiment as a 'standard protocol'.\nPress on 'procedure' to open up the procedure settings window.\nIn the pop up list on the upper side of the window choose '384 plate' type according to the plate manufacturer.\nPress 'Read' on the left menu.\nRegarding the detection method chose 'Absorbance'.\nRegarding the read type choose 'End point'.\nWrite 305 nm on the wavelength window.\nPress on the 'Full plate' button on the upper-right side and choose the well to be measured.\nPress 'ok' to close the 'Read' window.\nChoose 'start kinetic' on the left menu.\nMake the run time 10 min.\nSelect the minimum intervals option.\nPress 'ok' to close the kinetic window.\nDrag the 'Read' line into the kinetic measurement.\nPress the 'validate' button and then the 'ok' button.\nSave the experiment.",
    "Press the 'play' button. A dialog box will appear - press the 'ok' button only when the measurement should be started.\nFor NO production measurements use a nitrite/nitrate calorimetric kit. In a 96-well plate insert 50 µl of assay buffer into one row, 70 µl of Griess I reagent into a second row, and 70 µl of Griess II reagent into a third row.\nIn order to perform the triplicates experiment, prepare four samples each containing 4.8 µl of the 'chemical transducer'. To sample 1, add 155.2 µl of Assay buffer; to sample 2, add 3.2 µl of GST-M1-1 and 152 µl of Assay buffer; to sample 3, add 9.6 µl of PDGF and 145.6 µl of Assay buffer; and to sample 4, add 3.2 µl of GST-M1-1, 9.6 µl of PDGF, and 142.4 µl of Assay buffer.\nIncubate the solution at room temperature for 10 min.\nIn a 384-transparent well plate, insert 50 µl of sample into each well. Insert samples only in the odd or only in the even wells in the same line to allow the use of a multi-pipettor for substrate addition.\nAdd 0.54 µl of JS-K (5 mM in DMSO) to each well.\nUsing a 12-channel multi-pipettor, quickly add 10 µl from the GSH solution (pre-prepared in the 96-well plate), mix gently and quickly to avoid bubbles. Insert the plate into the reader and start the kinetic measurement.\nImmediately after the kinetic measurement, using a 12-channel multi-pipettor, take 50 µl from each sample into the assay buffer row in the pre-prepared 96-well plate and quickly add to it 50 µl of Griess I reagent and 50 µl of Griess II reagent. Incubate while protecting from light for 10 min at RT and measure the absorbance at 550 nm.",
    "Note: The assay buffer and reagents volumes are dependent on the kits' protocol.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}