{
  "id": 6129,
  "origin_website": "Bio",
  "title": "Preparation of Cell-free Synthesized Proteins Selectively Double  Labeled for Single-molecule FRET Studies",
  "procedures": [
    "Cell-free expression and incorporation of unnatural amino acidsThaw DNA on ice (plasmid containing the gene of interest, with an amber stop codon and a cysteine codon in its sequence) (see Note 1).Thaw the components of the cell-free protein synthesis (CFPS) kit on ice.Two different options are described below. Either incorporate into the protein unique chemical groups that can be specifically labeled post-translationally (see Procedure A1) or directly incorporate fluorophores (see Procedure A2). A combination of the two methods can also be used, where one fluorophore is directly incorporated and the second fluorophore post-translationally reacts with a unique chemical group.  A1. Incorporation of p-azido-phenylalanine (AzF) Mix all reaction components in an Eppendorf protein low binding tube. Use the RTS 100 Site-specific Label Kit (Table 1) in batch mode (see Note 2).Table 1. RTS 100 Site-specific Label Kit reaction miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613032737_4468.jpgPlace the tube with the reaction mix into an Eppendorf thermomixer.Set the thermomixer at 32 °C and 900 rpm and let react for 2 h.A2. Incorporation of fluorophores using precharged tRNAs Mix all reaction components in an Eppendorf protein low binding tube. Use a customized cell-free system (Table 2) in batch mode (see Note 3).Table 2. Customized cell-free system reaction miximgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613033146_7450.jpgAdd a fluorophore-charged amber suppressor tRNACUA and a fluorophore-charged tRNACys. The two fluorophores should constitute a FRET pair. For example Atto633-AF-tRNACUA and BODIPY FL-Cys- tRNACys (see Note 4).Place the tube with the reaction mix into an Eppendorf thermomixer.Set the thermomixer at 32 °C and 900 rpm and let react for 2 h.Purification of protein with Ni-NTA and buffer exchange (see Note 5)Add 50 μl magnetic Ni-NTA beads to a protein low binding tube.Equilibrate the Ni-NTA beads by adding 200 μl of lysis buffer (see Note 6 and Recipes).Use a magnet to hold the beads and remove the supernatant.Repeat 2 or 3 times.",
    "Add the 50 μl of the reaction and 150 μl of lysis buffer to the equilibrated Ni-NTA beads.Leave for 2 h at 4 °C on a rotor (Stuart Rotator).Use a magnet to hold the beads and transfer the supernatant in an Eppendorf tube (Flow-through).Add 200 μl of wash buffer (see Note 6 and Recipes) to the Ni-NTA beads and vortex shortly (2-3 sec).Leave for 10 min at 4 °C on the rotor.Use a magnet to hold the beads and transfer the supernatant in an Eppendorf tube (Wash 1).Repeat 2 times (Washes 2 and 3).Add 70 μl of elution buffer (see Recipes) to the Ni-NTA beads and vortex shortly (2-3 sec).Leave for 10 min at 4 °C on the rotor.Use a magnet to hold the beads and transfer the supernatant to an Eppendorf protein low binding tube (Elution).Take a Zeba desalting column.Remove the column’s bottom and loosen the cap.Place the column into a collection tube.Centrifuge for 1 min at 1,500 x g in an Eppendorf microcentrifuge and discard the flow-through.Add 200 μl of the final buffer (see Recipes) or PBS (see Recipes) for further labeling of the sample.Centrifuge for 1 min at 1,500 x g in an Eppendorf microcentrifuge and discard the flow-through.Repeat 2 more times.Transfer the column to an Eppendorf protein low binding tube.Apply the 70 μl of sample eluted from the Ni-NTA beads.Centrifuge for 2 min at 1,500 x g in an Eppendorf microcentrifuge and keep the flow-through that contains the protein.",
    "The protein is either already double labeled (see Procedure A2), in which case can be used directly for smFRET measurements (see directly Procedure D) or it contains two orthogonal chemical groups, namely an azido- (from AzF) and a thiol-group (from Cys) (see Procedure A1), in which case they need to be labeled in a next step (see Procedure C).In the second case, measure protein concentration using a Nanodrop to calculate the concentration of dyes needed for the labeling.Labeling with fluorescent dyesAdd to the protein sample (in PBS buffer) a 25x excess of the azido-reactive dye (e.g., Alexa647-DIBO).Place the tube with the reaction mix into an Eppendorf thermomixer.Set the thermomixer at 25 °C and 300 rpm and let react for 15 h in the dark.Prepare PBS-TCEP, pH 7.5 (see Recipes).Degas PBS-TCEP buffer for 2 h in a vacuum pump.Purify the single-labeled protein with magnetic Ni-NTA beads and size exclusion following the same procedure like before (see Procedure B). Use the degassed PBS buffer for the purification and elution of the protein.Add a 20x excess of the thiol-reactive dye (e.g., Alexa488-maleimide).Place the tube with the reaction mix at 4 °C for 15 h in the dark.Purify the double-labeled protein with magnetic Ni-NTA beads and size exclusion following the same procedure again (see Procedure B). Elute the double-labeled protein with the final buffer.Preparation of passivated microscope slides for measurements in solutionPlace the microscope slides into a Coplin staining jar.Prepare a Piranha solution (see Recipes) (see Note 7).Carefully fill the Coplin staining jar with the Piranha solution.Leave it under the hood for at least 1 h (see Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Chemically clean microscope slides with Piranha solution Fill three beakers with MilliQ water.Hold the slides with tweezers and dip them from one beaker to the next to clean them.",
    "Keep them in the third beaker (see Figure 1).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613035335_0148.jpgFigure 1. Cleaning microscope slides after Piranha treatment by dipping successively into three beakers with MilliQ waterTake the slides with tweezers, rinse them with methanol and dry with nitrogen flow.Place the dried slides into a clean and dry Coplin staining jar. Prepare a 2% APTES solution in Uvasol acetone for silanization of the slides.Fill the Coplin staining jar with the APTES solution.Incubate for 10 min.Take the slides with tweezers and rinse them first with acetone and then with methanol.Dry the slides with nitrogen flow and place them on a clean surface.Cut Eppendorf protein low binding tubes just below the 1 ml line (see Note 8).Smooth the cut edge using sandpaper (see Figure 2 and Video 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613035409_2466.jpgFigure 2. Use a tubing cutter to cut the tubes below the 1 ml line<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 2. Cut and smooth Eppendorf tubes Apply optical glue on the rim of the cut tubes and place a single tube on one slide. Repeat with the other tubes on different slides.Place the slides with the tubes under UV light. The tube should touch the UV transilluminator, not the slide.Turn on UV light for 1-2 min to polymerize the glue (see Figure 3 and Video 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180613/20180613035453_3247.jpgFigure 3. Slide with a tube glued onto it<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 3. Gluing tubes onto microscope slides using UV light Prepare 100 mM NaHCO3 solution, pH 8.3.Dissolve 50 mg PEG-NHS ester in 400 μl of NaHCO3 solution.Apply 80 μl in each tube to cover the surface.Close the tube carefully and keep the slides at 4 °C until use.Before use rinse the slides with MilliQ water, then methanol and dry with nitrogen flow.",
    "smFRET measurements on a confocal microscopePlace 100 μl of double-labeled protein sample at a concentration ~2 nM inside the half-cut tube that is glued onto the slide.Mount the slide on the confocal microscope.Perform a Fluorescence Correlation Spectroscopy (FCS) analysis for each fluorophore separately by exciting it using a 485 nm (for the blue dye) or a 640 nm laser (for the red dye).Determine the number of molecules N present in the confocal volume for the donor and the acceptor dyes, validate monomeric/non-aggregated protein, determine quantum yields (Kempe et al., 2015).Dilute the sample respectively for the single molecule measurement to N = 0.03, to make sure that at any given time at the most one molecule is present in the confocal volume.Perform an smFRET measurement by exciting the two fluorophores alternatingly (Müller et al., 2005) using both lasers (485 nm and 640 nm lasers)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}