{
  "id": 3509,
  "origin_website": "Cell",
  "title": "Reactivity-based RNA profiling for analyzing transcriptome interactions of small molecules in human cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nThe timing for each step is calculated for the preparation of ten sequencing samples.\nIn cellulo RNA target acylation\nTiming: 3–4 h\nThis step outlines treatment with competing parent drug, detachment of the cells, and target acylation with acylating probe in the relevant cell line. Pre-treatment with the parent drug 1 competes for acylation labeling of probe 2 for RNA targets, for identification of drug-specific sites (Figure 1[href=https://www.wicell.org#fig1]C). Treatments with parent drug or vehicle control (DMSO) are performed to correct for random site acylation, random RNA breaks, and non-specific RNA binding events by biotin-mediated pulldown.\nPre-treatment with competing parent drug. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nAdd 200 μL of 15 mM (50×) stock of compound 1 in DMSO to 10 mL pre-warmed (37°C) DMEM medium supplemented with 10% v/v FBS.\nNote: The final concentration of 1 reaches 300 μM (2.0% DMSO).\nOnce the cells reach ∼80%–90% of confluency, replenish the medium with 10 mL fresh DMEM medium generated in step 1a.\nIncubate cells at 37°C for 30 min with 5% CO2.\nCritical: Potential effects of drug treatment on transcript abundance will be corrected with the next-generation sequencing as described later. The drug concentration of compound 1 is determined so that the stoichiometry of compound 1: probe 2 is 5:1 for effective competition. The concentrations should be adapted and tested for other drugs. In our experience, the optimal drug concentration can range from low to high micromolar depending on the biologically relevant concentration of drug and its solubility in water.",
    "Note: We find that performing RBRP with two biological replicates is sufficient for target identification. Bioinformatics analysis is performed for RNA regions with high concordance in transcript abundance and RT stop counts between biological replicates. The RBRP pipeline is compatible with any number of replicates. Optionally, users can add an additional biological replicate to enhance the statistical significance for target identification.\nDetachment of compound 1-treated cells. Troubleshooting 1[href=https://www.wicell.org#sec6.1].\nAspirate the medium and wash cells with 10 mL of PBS supplemented with 300 μM of compound 1 (2.0% DMSO).\nRemove PBS and scrape the cells into 4 mL PBS supplemented with 300 μM of compound 1 (2.0% DMSO).\nCount the cells and aliquot 20 million cells into a 15-mL falcon tube.\nCentrifuge at 110 × g for 2 min at 20°C and aspirate the supernatant.\nUse a cut-tip p1000 pipette tip to suspend the cell pellet in 1 mL of PBS supplemented with 1 (300 μM, 2.0% v/v DMSO).\nTransfer the cell suspension to a 1.5 mL conical vial.\nNote: Warm all reagents in a water bath at 37°C to minimize perturbation to cells.\nLive cell RNA target acylation. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nAfter suspending cells, in the same suspension, add 1 μL of 50 mM probe 2 to both 1-treated and DMSO-treated cells.\nNote: The final concentration of probe 2 is 50 μM (0.1% v/v DMSO).\nIncubate for 30 min at 37°C on a sample revolver with continuous rotation (20 rpm).\nStop the reaction by centrifuging the cells at 2,500 × g for 1 min at 4°C.\nAspirate the supernatant. Immediately proceed to step 7.\nPre-treatment for bystander controls (treatment with DMSO or only compound 1). Troubleshooting 1[href=https://www.wicell.org#sec6.1].",
    "(For DMSO-treated samples) Once the cells reach ∼80%–90% of confluency, remove the medium and add 10 mL fresh DMEM medium supplemented with 10% v/v FBS and 2% v/v DMSO.\n(For samples only treated with compound 1) Once the cells reach ∼80%–90% of confluency, remove the medium and add 10 mL fresh DMEM medium supplemented with 10% v/v FBS and 300 μM of compound 1 (2% v/v DMSO).\nIncubate cells at 37°C for 30 min with 5% CO2. Move to step 5.\nDetachment of cells in bystander controls.\nAspirate the medium and wash cells with 10 mL of PBS supplemented with 2.0% v/v DMSO.\nRemove PBS and scrap the cells into 4 mL PBS supplemented with 2.0% v/v DMSO.\nCount the cells and aliquot 20 million cells into a 15-mL falcon tube.\nCentrifuge at 110 × g for 2 min at 20°C and aspirate the supernatant.\nUse a cut-tip p1000 pipet tip to suspend the cell pellet in 1 mL of PBS supplemented with 2.0% v/v DMSO.\nTransfer the cell suspension to a 1.5 mL conical vial and proceed to step 6.\nLive cell RNA target acylation. Troubleshooting 2[href=https://www.wicell.org#sec6.3].\nAfter suspending cells, in the same suspension, add 1 μL of 50 mM probe 2 (final concentration of probe 2: 50 μM, 0.1% v/v DMSO) to both 1-treated and DMSO-treated cells.\nIncubate for 30 min at 37°C on a sample revolver with continuous rotation (20 rpm).\nStop the reaction by centrifuging the cells at 2,500 × g for 1 min at 4°C.\nAspirate the supernatant. Immediately proceed to step 7.\nIsolation of total cellular RNAs and quality control\nTiming: 2 h",
    "This following method describes the steps of RNA isolation after the acylation reaction. This methodology is based on the instructions from the Trizol LS reagent (Thermo Scientific, Cat# 10296028) and Zymo QuickRNA midiprep kit (Zymo, Cat# R1056; Binding capacity: 1 mg of RNA). For more details and troubleshooting, please refer to the manuals on Thermo website[href=https://www.thermofisher.com/order/catalog/product/10296028] and Zymo website[href=https://www.zymoresearch.com/products/quick-rna-midiprep-kit].\nCell lysis with Trizol LS reagent.\nSuspend the cell pellet with 500 μL PBS and transfer cells to a 15-mL conical vial containing 6 mL of Trizol LS reagent.\nVortex for 15 s to homogenize the samples.\nCritical: Trizol LS reagent is toxic when in contact with skin and if swallowed. Trizol LS reagent should be handled in a chemical fume hood. Be sure to wear a lab coat, disposable gloves, and safety googles when working with Trizol LS reagent. If in contact with skin, wash immediately with soap and water.\nAdd 1.2 mL of chloroform and vortex for 15 s at 20°C.\nIncubate the sample at 20°C for 5 min.\nCentrifuge at 2,500 × g for 15 min at 4°C.\nTransfer the aqueous layer on the top to a new 15 mL conical vial.\nNote: The top aqueous layer should be collected carefully using a pipette. Avoid making contact or disturbing the organic layer. It’s preferred to tilt the vial to maximize the recovery of the aqueous layer during the collection.\nAdd 1× volume of 96%–100% of ethanol and vortex to mix thoroughly.\nExtraction of total cellular RNA.\nTransfer the mixture to a Zymo-Spin V-E Column (binding capacity: 1 mg of RNA) from Zymo Quick-RNA Midiprep kit (Zymo, Cat#R1056) with reservoir on a vacuum manifold.",
    "Note: The vacuum manifold should be attached to a vacuum pump that is ideally capable of producing at least 400 mm Hg pressure. This step can also be performed on a centrifuge as an alternative, but it is not recommended as it requires extensive rounds of centrifugation. Steps 8b-f are performed with a microcentrifuge at 20°C.\nDigest genomic DNAs.\nAdd 400 μL of RNA Wash Buffer to the Zymo-Spin V-E Column. Centrifuge at 10,000 × g for 30 s at 20°C.\nAdd 80 μL of DNA Digestion Buffer containing 5 μL of DNase I (1 U/μL) and incubate for 15 min at 20°C. Centrifuge at 10,000 × g for 30 s at 20°C.\nAdd 400 μL RNA Prep Buffer to the column and centrifuge. Discard the flow-through.\nAdd 400 μL RNA Wash Buffer to the column and centrifuge. Discard the flow-through.\nAdd 400 μL RNA Wash Buffer and centrifuge for 2 min for complete removal of the wash buffer.\nTransfer the column to a 1.5 mL RNase-free conical tube. Elute RNA from the column twice with 200 μL of water per elution (final ∼400 μL).\nUse 2 μL of the eluted sample to determine the RNA concentration with Nanodrop UV-Vis Spectrophotometer.\nPause point: RNA samples can be stored at −80°C for up to one month.\nNote: The Zymo QuickRNA Midiprep kit contains all reagents required for step 8. The expected RNA output is about 300–400 μg per sample.\nRNA Quality control.\nDetermine RNA quality using capillary electrophoresis (CE) with an Agilent RNA 6000 Pico kit (Agilent, Cat#5067-1513) on a 2100 BioAnalyzer (or similar instrument) following the manufacturer’s protocol from Agilent website[href=https://www.agilent.com/en/product/automated-electrophoresis/bioanalyzer-systems/bioanalyzer-rna-kits-reagents/bioanalyzer-high-sensitivity-rna-analysis-228255]. RNA Integrity Number (RIN) should be > 0.90 before being used in the sequencing library preparation.\nExtraction of poly(A)+ RNA\nTiming: ∼2 h",
    "The following method describes the steps of extracting poly(A)+ RNA. This methodology is based on the instructions from the Poly(A)Purist MAG kit (Thermo Fisher Scientific, Cat#AM1922). For more details and troubleshooting, please refer to the manuals on the Thermo website[href=https://www.thermofisher.com/order/catalog/product/AM1922].\nAlternatives: Other poly(A)+ RNA selection kits are commercially available and can be used in this protocol, although they have not been explicitly tested. These kits are NEB Next Poly(A) mRNA Magnetic Isolation Module (New England Biolabs, Cat#E7490L), Poly(A) RNA Selection Kit V1.5 (Lexogen, Cat#157.96), PolyATtract mRNA Isolation Systems (Promega, Cat#Z5210), Seq-Star poly(A) mRNA Isolation Kit (Arraystar, Cat#AS-MB-006-01), RNeasy Pure mRNA Bead Kit (QIAGEN, Cat#180244).\nPrepare the total RNA sample.\nDilute 250 μg of total RNA from step 8 into 400 μL with RNA Storage Solution.\nAdd 400 μL of 2× Binding Solution and vortex to mix thoroughly.\nPrepare the Oligo(dT) MagBeads.\nFor each biological replicate, transfer 25 μL of the Oligo(dT) MagBeads suspension (contains 250 mg of beads) to a 1.5-mL conical vial.\nPlace the vial on a magnetic rack for 1 min and carefully aspirate the supernatant with a p1000 pipette tip.\nNote: Handle with caution. Avoid contacting and disturbing the beads.\nWash the beads with 125 μL Wash Buffer 1 off the rack by inverting the vial ten times.\nPlace the vial on a magnetic rack for 1 min and carefully aspirate the supernatant with a p200 pipette tip.\nNote: Handle with caution. Avoid contacting and disturbing the beads.\nRepeat steps11c-d for one time.\nCapture poly(A)+ RNA with Oligo(dT) MagBeads.\nAdd 400 μL of total RNA sample to the Oligo(dT) MagBeads pellet.\nMix by inverting the conical vial ten times.\nHeat the sample at 70°C for 5 min and then incubate at 20°C for 60 min on a revolver (20 rpm).",
    "Place the vial on a magnetic rack for 1 min and carefully aspirate the supernatant.\nAdd 400 μL of Wash Solution 1 and mix by inverting the conical vial ten times.\nPlace the vial on a magnetic rack for 1 min and carefully aspirate the supernatant.\nRepeat steps 12e-f.\nElute poly(A)+ RNA.\nPreheat RNA Storage Solution at 70°C.\nAdd 200 μL of RNA Storage Solution (70°C) to the bead pellet and mix thoroughly by vortexing for 5 s.\nImmediately place the vial on a magnetic rack for 1 min.\nTransfer the supernatant to a new 1.5 mL RNase-free collection tube.\nRepeat steps 13b-d to yield approximately 390 μL of RNA sample in total.\nDesalt and concentrate poly(A)+ RNA samples with QIAGEN RNeasy Mini kit (QIAGEN, Cat#74104).\nLyophilize the RNA samples from step 13e and redissolve in 100 μL of RNase-free water.\nNote: Alternatively, RNA samples can also be dried on a SpeedVac vacuum concentrator at 4°C.\nAdd 350 μL of buffer RLT (QIAGEN) and 900 μL of 96%–100% ethanol and vortex thoroughly to mix.\nTransfer the sample to a QIAGEN RNeasy mini column (binding capacity: 100 μg of RNA).\nCentrifuge for 30 s at 10,000 × g and discard flow-through.\nAdd 500 μL of Buffer RPE (QIAGEN) to the column.\nCentrifuge for 60 s at 10,000 × g and discard flow-through. Repeat once.\nAdd 50 μL of RNase-free water to the column.\nIncubate for 3 min at 20°C and then centrifuge for 30 s at 10,000 × g to elute RNA samples. Repeat once.\nUse 2 μL of the eluted sample to determine the RNA concentration with Nanodrop UV-Vis Spectrophotometer.\nPause point: Frozen RNA samples can be stored at −80°C for up to one month.",
    "Note: Expect to recover about 4 μg–5 μg of poly(A)+ RNA. Freeze poly(A)+ RNA samples as 500 ng aliquots at −80°C for storage. Buffer RLT and buffer RPE are included in the QIAGEN RNeasy Mini kit.\nAlternative: Another RNA desalting and concentrating kit in the market is Zymo RNA Cleanup and Concentrator Column-5 (Zymo, Cat#R1013). This kit can be used in step 14 without decreasing the integrity of RNA, although it has not been explicitly tested.\nPreparation of next-generation sequencing libraries\nTiming: 1–2 weeks\nThe following method describes the steps of biotin click reaction, RNA fragmentation, RNA end repair, RNA 3′-end ligation, cDNA synthesis and enrichment, cDNA circularization, and library amplification (Figure 2[href=https://www.wicell.org#fig2]). The following steps are established by modifying a previously published protocol of next-generation sequencing library preparation for RNA structural analysis.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5]\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3081-Fig2.jpg\nFigure 2. Workflow of sequencing library preparation\nSchematic illustration of biotin click reaction, RNA fragmentation, RNA end repair, RNA 3′-end ligation, cDNA synthesis and enrichment, cDNA circularization, and library amplification.\nClick reaction to install biotin to probe-labeled RNA.\nDilute 500 ng of poly(A)+ RNA from step 14 with RNase-free water to 16 μL.\nAdd 1 μL of RiboLock RNase inhibitor and 2 μL of 1.85 mM solution of DIBO-biotin in DMSO.\nAlternatives: In principle, other biotin-containing alkynes (for example, Click-iT sDIBO Biotin-alkyne. ThermoFisher, Cat#C20023) for copper-free click chemistry can also be used in this step.\nIncubate samples at 37°C for 2 h on an orbital shaker.\nAfter the reaction, purify RNA samples with Zymo RNA cleanup & concentration column-5 kit following the manufacturer’s protocol from the Zymo website[href=https://www.zymoresearch.com/products/rna-clean-concentrator-5].\nElute RNA with 20 μL of water for two times (final ∼39 μL). Lyophilize the RNA sample.\nPause point: Biotinylated RNA samples can be stored at −80°C for up to one month.\nRNA fragmentation.",
    "Dissolve free-dried RNA from step 15e in 9 μL of RNase-free water and transfer the sample to a 200-μL PCR tube.\nHeat the sample at 95°C for 60 s on a thermal cycler (lid temperature: 105°C).\nAdd 1 μL of 10 x Fragmentation Reagent.\nIncubate at 95°C for 50 s to yield a desired medium length of RNA fragments at ∼100 nucleotides.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3081-Fig3.jpg\nFigure 3. Denaturing urea PAGE analysis of fragmented RNA\nPoly(A)+ RNAs are incubated with RNA fragmentation reagents for varied duration in step 16. The time (in seconds) denotes the duration of RNA fragmentation at 95°C.\nNote: The fragmentation pattern and the length of RNA fragments can be confirmed by electrophoresis on a 6% denaturing Urea PAGE gel as shown in Figure 3[href=https://www.wicell.org#fig3]. We recommend optimizing the fragmentation conditions for different thermocyclers by varying the duration of fragmentation to yield RNA fragments with desired length. An example of RNA fragmentation under varied conditions is shown in Figure 3[href=https://www.wicell.org#fig3].\nImmediately quench the reaction by adding 1 μL of 10 x Stop Solution. Flick to mix three times and immediately transfer onto ice.\nPurify RNA samples with Zymo RNA cleanup & concentration column-5 kit following manufacturer’s protocol from Zymo website[href=https://www.zymoresearch.com/products/rna-clean-concentrator-5].\nElute RNA with 20 μL of water twice (final ∼39 μL). Lyophilize the RNA sample.\nPause point: The RNA samples from step 16g can be stored at −80°C for up to one month.\nRNA end repair and ligation.\nDissolve the freeze-dried RNA from step 16g in 10 μL of Repair Mix.\nTransfer samples to a 200-μL PCR tube.\nIncubate at 37°C for 1 h on a thermal cycler.\n3′-End ligation reaction:\nFor samples treated with probe 2: After 3′-end repair reaction, in the same tube, add 15.875 μL of Ligation Mix-ddC.",
    "Note: please see materials and equipment[href=https://www.wicell.org#materials-and-equipment] - Recipes with ≥ 3 ingredients for detailed recipe.\nFor samples treated with vehicle control (DMSO): After 3′-end repair reaction, in the same tube, add 15.875 μL of Ligation Mix-ddBiotin.\nNote: Please see materials and equipment[href=https://www.wicell.org#materials-and-equipment] - Recipes with ≥ 3 ingredients for detailed recipe.To quantify and locate the probe-promoted 2′-acylation, it is crucial to characterize the basal level of RT-stop frequencies transcriptome-wide. For samples treated only with the vehicle control (DMSO) or drug, it is necessary to conjugate a biotin moiety to the fragmented RNAs via 3′-end ligation using an adaptor oligo containing a Biotin group (ddBiotin). Its purpose is to allow enrichment of the fragmented RNAs, which serves as the background sample to locate and quantify the basal level of RNA breaks due to RNA fragmentation. In contrast, probe 2-treated samples already contain a biotin moiety for enrichment with streptavidin beads. Thus, probe 2-treated samples do not require a biotin-containing adaptor oligo.\nIncubate at 25°C for 4 h in a thermocycler.\nPurify RNA samples with Zymo RNA cleanup & concentration column-5 kit following manufacturer’s protocol from the Zymo website[href=https://www.zymoresearch.com/products/rna-clean-concentrator-5].\nElute RNA with 20 μL of water twice.\nLyophilize the RNA sample.\nSize selection of ligated RNA products:\nDissolve RNA pellet with 7 μL of RNA loading dye (2×). Mix by flicking.\nLoad 7 μL sample onto a 6% denaturing Urea PAGE gel.\nRun electrophoresis in 1× TBE buffer at 17 W until the bromophenol blue band travels for 2.5–3.0 cm.\nStain the gel with 1xSYBR Gold staining solution for 3 min at 20°C.\nTransfer the Urea PAGE gel onto a blue-light gel imager to record gel images.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3081-Fig4.jpg\nFigure 4. Denaturing urea PAGE analysis of ligated RNA",
    "The ligated RNA products are generated in step 18. The regions of gel to excise and collect are highlighted with the red dashed box. Unligated 3′-ddC and 3′-ddBiotin adapters are labeled. For probe-treated samples: 1—treatment with only probe 2; 2—treatment with probe 2 + drug 1. For bystander controls: 1—treatment with only DMSO; 2—treatment with only drug 1.\nNote: The RNA loading buffer contains two dyes. Bromophenol blue migrates faster than the xylene cyan band. Thus, the band of bromophenol blue is at the bottom; the band of xylene cyan is on the top. Protective equipment for visual protection must be used (e.g., organge filter safety googles).\nCritical: Add a lane of 7 μL of Low Range ssRNA Ladder (New England Biolabs, Cat#N0364S) to identify the location of ligated RNA product. Dilute 1 μL of Low Range ssRNA Ladder with 6 μL of RNA loading dye (2×). Mix by flicking.\nNote: As shown in Figure 4[href=https://www.wicell.org#fig4], the RNA adapter bands exhibit higher electrophoretic mobility than the ligated RNA fragments. The distribution of ligated RNAs should match the unmodified RNA fragments in step 16.\nExcise and collect the gel bands between 50 nt to 500 nt.\nTransfer the gel slices to a 600-μL PCR tube with a 20-gauge needle-hole.\nPlace the 600-μL PCR tube into a 2-mL conical vial.\nCentrifuge at 16,000 × g for 5 min at 20°C to crush the gel slices into smaller particles.\nAdd 250 μL of RNase-free water.\nTransfer the resulting gel slurry into a 1.5-mL conical vial with a cut-tip p1000 pipette tip.\nNote: Use a pair of sterilized scissors to cut the tip of p1000 pipette tip. The scissors must be cleaned with RNase AWAY Surface Decontaminant.\nTransfer the gel slurry onto an orbital shaker.\nHeat samples at 67°C for 15 min at∼700 rpm.",
    "Transfer the gel slurry to a Spin-X column with a cut-tip p1000 pipette tip.\nCentrifuge at 7,000 × g for 1 min at 20°C and collect and transfer the eluent to a new 1.5-mL conical vial.\nAdd 250 μL of RNase-free water to the drained gel slurry and transfer the gel slurry back to a 1.5-mL conical vial.\nTransfer the gel slurry onto an orbital shaker and heat at 67°C for 15 min at ∼700 rpm.\nTransfer the gel slurry to the same Spin-X column from 17h(vii) and centrifuge at 7,000 × g for 1 min at 20°C.\nCollect and combine the eluent with the eluent from 17h(xv).\nTransfer 500 μL eluent to a 0.5-mL 10K Amicon filter. Centrifuge at 13,500 × g for 5 min at 4°C.\nNote: The volume of RNA sample should be reduced to ∼100 μL.\nPurify RNA samples with Zymo RNA cleanup & concentration column-5 kit following manufacturer’s protocol from Zymo website[href=https://www.zymoresearch.com/products/rna-clean-concentrator-5]. Elute RNA with 20 μL of water twice and lyophilize the eluted RNA sample.\nPause point: 3′-Ligated RNA samples can be stored at −80°C for up to one month.\nReverse transcription and enrichment of biotinylated RNAs via streptavidin-mediated pulldown.\nReverse transcription:\nDissolve RNA from step 17 in 11 μL of RNase-free water.\nAdd 1 μL of a uniquely barcoded RT primer and mix thoroughly by flicking.",
    "Critical: Each RT primer contains a unique 4-nt long barcoded index. The sequence of the RT primer is /5phos/DDDNNXXXXNNNNAGATCGGAAGAGCGTCGTGGA/iSp18/GGATCC/iSp18/TACTGAACCGC (D = A/G/T and N = A/T/G/C are used to discriminate PCR duplicates. ‘XXXX’ is the specific experimental barcode. Please see the key resources table[href=https://www.wicell.org#key-resources-table] for the validated RT primer sequences). For a given 3′-ligated RNA sample, the choice of barcoded RT primer should not influence cDNA synthesis. Thus, users can assign one RT primer to each sample, as long as the barcodes of RT primers are different among samples. Sequencing reads of each sample will be demultiplexed later based on the 4-nt barcoded index sequence.\nNote: The barcoded RT primer anneals to the adaptor sequence, which was ligated to the RNAs at step 17. Users can expand the number of multiplexes by generating more uniquely barcoded RT primers with different index sequence “XXXX” in /5phos/DDDNNXXXXNNNNAGATCGGAAGAGCGTCGTGGA/iSp18/GGATCC/iSp18/TACTGAACCGC. The change of the barcoded index should not affect cDNA synthesis.\nHeat samples at 70°C for 5 min, then ramp down to 25°C by 0.3°C/s.\nAdd 8 μL of RT Mix.\nHeat reactions at 25°C for 3 min, 42°C for 5 min, 52°C for 30 min.\nAfter the reaction, proceed immediately to step 18b.\nEnrichment of biotinylated RNAs.\nPrepare 20 μL of Dynabeads MyOne streptavidin C1 beads for each sample in a 1.5 mL conical tube.\nAdd 1 mL of cDNA Binding Buffer and incubate for 15 min at 20°C to pre-equilibrate the beads.\nPlace the beads on a magnetic rack for 1 min and remove the supernatant.\nAdd 10 μL of cDNA Binding Buffer.\nTransfer samples from 18a to 20 μL of pre-equilibrated beads.\nIncubate for 1 h at 20°C on a sample revolver (20 rpm).\nPlace samples in a magnetic rack for 1 min at 20°C.\nAspirate the supernatant carefully.",
    "Add 500 μL cDNA Washing Buffer and mix by inverting 5 times.\nPlace samples on a magnetic rack for 1 min at 20°C.\nAspirate the supernatant carefully.\nRepeat 18b(ix-xi) for four times.\nAdd 500 μL of PBS and mix by inverting 5 times.\nPlace samples in a magnetic rack for 1 min at 20°C.\nAspirate the supernatant carefully.\nRepeat 18b(xiii-xv) once.\nCritical: During step 18b, users must ensure the sample temperature stays at or below 37°C. Handle samples with fingers on the rim of the lid. Avoid heating the sample by touching the bottom of the sample tube with fingers.\nElution of cDNA.\nSuspend drained beads with 50 μL of cDNA Elution Mix.\nIncubate at 37°C for 30 min on an orbital shaker (∼700 rpm).\nNote: cDNA Elution Mix contains RNase H, RNase A, and RNase T1. cDNA is released from the streptavidin beads upon digestion of the RNAs. The beads do not need to be air-dried before elution.\nAdd 1 μL DMSO and incubate at 95°C for 5 min.\nPlace the samples immediately on a magnetic rack for 1 min at 20°C.\nTransfer and collect the supernatant in a new 1.5-mL conical vial.\nPurify the eluted samples with Zymo DNA cleanup & concentrator column-5 kit (Zymo, Cat# D4014) as follows.\nAdd 350 μL (7× volume) of DNA Binding Buffer and 350 μL of 96%–100% ethanol. Vortex to mix.\nTransfer the sample to the Zymo-Spin Column (binding capacity: 5 μg of DNA).\nCentrifuge at 10,000 × g for 30 s at 20°C. Discard the flow-through.\nAdd 200 μL of DNA washing buffer.\nCentrifuge at 10,000 × g for 30 s at 20°C. Discard the flow-through. Repeat the washing step once.\nElute cDNA with 20 μL of water twice and lyophilize the eluted cDNA sample.",
    "Note: The cDNA can be stored at −80°C for up to 3 months.\nSize selection of cDNA:\nDissolve the cDNA pellet with 7 μL of RNA loading dye (2×). Mix by flicking.\nLoad 7 μL sample onto a 6% denaturing Urea PAGE gel.\nRun electrophoresis with 1× TBE buffer at 17 W until the bromophenol blue band travels for 2.5–3.0 cm.\nStain the gel with 1xSYBR Gold staining solution for 3 min at 20°C.\nTransfer the Urea PAGE gel onto a blue-light gel imager.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3081-Fig5.jpg\nFigure 5. Denaturing urea PAGE analysis of cDNA products\nThe cDNA products are generated in step 18. The regions of gel to excise and collect are highlighted with the red dashed box. The unreacted adapters are labeled. For probe-treated samples: 1—treatment with only probe 2; 2—treatment with probe 2 + drug 1. For bystander controls: 1—treatment with only DMSO; 2—treatment with only drug 1.\nNote: The RNA loading buffer contains two dyes. Bromophenol blue migrates faster than the xylene cyan band. Thus, the band of bromophenol blue is at the bottom; the band of xylene cyan is at the top. Protective equipment for visual protection must be used (e.g., orange filter safety goggles). Urea PAGE gels are toxic. When handling urea PAGE gels, wear personal protection equipment, including gloves, goggles, and lab coats. As shown in Figure 5[href=https://www.wicell.org#fig5], The abundance of cDNA is typically low. Add a lane of 10 bp DNA Ladder (Invitrogen, Cat#10821-015) to locate cDNA products within the gel. To generate the ladder solution, dilute 1 μL of 10 bp DNA ladder to 6 μL of RNA loading dye (2×), and heat denature at 70°C for 3 min. Place the ladder solution on ice for > 2 min.",
    "Note: cDNAs incorporate sequences from the barcoded RT primers, seemingly longer than the ligated RNAs on the denaturing PAGE gel. The cDNA generated from the probe-treated samples is less abundant and visually unrecognizable on denaturing PAGE gel due to RNA targets making up only a small portion of the extracted cellular RNAs. RT primers migrate faster than the cDNA at ∼70 nt. The cDNAs generated from the bystander controls (DMSO- or drug-treated samples) are more abundant, since in principle all RNA fragments are conjugated to biotin-containing adapters (Figure 5[href=https://www.wicell.org#fig5]).\nExcise and collect the gel above 80 nt.\nTransfer the gel slices to a 0.5-mL PCR tube with a 20-gauge needle-hole using a single-sided carbon steel razor blade.\nPlace this 0.5-mL PCR tube onto a 2-mL conical vial.\nCentrifuge at 16,000 × g for 5 min at 20°C.\nAdd 250 μL of nuclease-free water.\nTransfer the crushed gel with a cut-tip p1000 pipette tip into a 1.5-mL conical vial.\nNote: Use a pair of sterilized scissors to cut the tip of the p1000 pipette tip. The scissors must be cleaned with RNase AWAY Surface Decontaminant.\nHeat at 67°C for 15 min on an orbital shaker (∼700 rpm).\nTransfer the gel slurry to a Spin-X column with a cut-tip p1000 pipette tip.\nCentrifuge at 7,000 × g for 1 min at 20°C.\nCollect and transfer the eluent to a new 1.5-mL conical vial.\nAdd 250 μL of water to the drained gel slurry and transfer to a 1.5 mL conical vial with a cut-tip p1000 pipette tip.\nHeat at 67°C for 15 min on an orbital shaker (∼700 rpm).\nTransfer the gel slurry to a Spin-X column with a cut-tip p1000 pipette tip.\nCentrifuge at 7,000 × g for 1 min at 20°C.\nCollect and combine with the eluent from step 18d(xv).",
    "Transfer 500 μL eluent to a 0.5-mL 10K Amicon filter.\nCentrifuge at 13,500 × g for 5 min at 20°C.\nPlace the Amicon filter upside down in a clean microcentrifuge tube.\nCentrifuge at 1,000 × g for 2 min at 20°C and collect the eluent (∼100 μL).\nPurify eluted samples with Zymo DNA cleanup & concentrator column-5 kit (Zymo, Cat#D4014) as follows.\nAdd 700 μL (7× volume) of DNA Binding Buffer and 700 μL of 96%–100% ethanol. Vortex to mix.\nTransfer the sample to the Zymo-Spin Column (binding capacity: 5 μg of DNA).\nCentrifuge at 10,000 × g for 30 s at 20°C. Discard the flow-through.\nAdd 200 μL of DNA washing buffer.\nCentrifuge at 10,000 × g for 30 s at 20°C. Discard the flow-through.\nRepeat the washing step once.\nElute cDNA with 8.5 μL of water twice to yield ∼16 μL of the final cDNA sample.\nPause point: cDNA samples can be stored at −80°C for up to one month.\ncDNA circularization, library amplification, and next-generation sequencing.\ncDNA circularization:\nMix 16 μL of cDNA sample from step 18 with 2 μL of 10×CircLigase II Buffer, 1 μL of 50 mM MnCl2, and 1 μL of CircLigase II.\nFlick to mix reaction thoroughly.\nIncubate at 60°C for 3 h in a thermocycler.\nPurify the circularized cDNA samples with Zymo DNA cleanup & concentrator column-5 kit (Zymo, Cat# D4014) as follows.\nAdd 140 μL (7×) of DNA Binding Buffer and 140 μL of 96%–100% ethanol. Vortex to mix.\nTransfer the sample to the Zymo-Spin Column (binding capacity: 5 μg of DNA).\nCentrifuge at 10,000 × g for 30 s at 20°C and discard the flow-through.\nAdd 200 μL of DNA washing buffer.\nCentrifuge at 10,000 × g for 30 s at 20°C and discard the flow-through.",
    "Repeat this washing step once.\nElute circularized cDNA with 10 μL of water twice (final ∼19 μL sample).\nLibrary amplification with qPCR. Troubleshooting 3[href=https://www.wicell.org#sec6.5].\nAssemble qPCR reaction as follows:\ntable:files/protocols_protocol_3081_11.csv\nCritical: The qPCR reaction mixture should be assembled on ice freshly before qPCR amplification.\nNote: The PE1 and PE2 primers are not barcoded, as the sample-specific barcodes were introduced during cDNA synthesis. Each barcoded RT primer in step 18a contains two universal sequences that anneal to the PE1 and PE2 primers. Thus, PE1 and PE2 primers are universal PCR primers to amplify the circularized cDNAs. In addition, PE1 and PE2 primers already contain Illumina P5 and P7 adapters and should anneal to their complementary oligos on the flowcell surface in the Illumina sequencing platforms.\nNote: Each barcoded RT primer in step 18a contains a unique 4-nt index. Users should assign one uniquely barcoded RT primer to each sample (see the key resources table[href=https://www.wicell.org#key-resources-table] for 14 validated sequences of barcoded RT primers). The experiment can be further multiplexed by using a uniquely barcoded RT primer for each additional sample (see Note in step 18a for guidance on designing RT primers). Importantly, the choice of barcoded RT primers should not influence the qPCR amplification. The design of the final sequencing library is as follows: 5′- AATGATACGGCGACCACCGAGATCT (P5 adapter) - ACACTCTTTCCCTACACGACGCTCTTCCGATCT (PE1 annealing sequence) - NNNNGGTTNNDDD - insert sequence - AGATCGGAAGAGCGGTTCAGCAGGAATGCCGAGACCG (PE2 annealing sequence)-ATCTCGTATGCCGTCTTCTGCTTG (P7 adapter)-3′\nPerform qPCR using the following PCR cycling conditions:\ntable:files/protocols_protocol_3081_12.csv",
    "Critical: Avoid overamplification of the sequencing library. We recommend conducting a qPCR experiment with 1 μL of circularized cDNA product from step 19a for each experiment. Dilute 1 μL of circularized cDNA product with 18 μL of nuclease-free water and proceed to step 19b for qPCR amplification. Each sample’s optimal number of qPCR amplification cycles is defined as the number of qPCR cycles that provide 50% of the maximum fluorescence signals. In our experience, PCR amplification with final fluorescence intensity above 20,000 a.u. is sufficient on an Applied Biosystems StepOnePlus Real-Time PCR System. Probe-treated samples usually require ∼16–22 cycles for sufficient amplification on the Applied Biosystems StepOnePlus, while DMSO-treated samples usually require ∼8–12 cycles. Troubleshooting 4[href=https://www.wicell.org#sec6.7].\nPurify the PCR product with Zymo DNA cleanup & concentrator column-5 kit (Zymo, Cat#D4014) as follows.\nAdd 202 μL (5× volume) of DNA Binding Buffer and vortex to mix.\nTransfer the sample to the Zymo-Spin Column (binding capacity: 5 μg of DNA).\nCentrifuge at 10,000 × g for 30 s at 20°C and discard the flow-through.\nAdd 200 μL of DNA washing buffer.\nCentrifuge at 10,000 × g for 30 s at 20°C and discard the flow-through.\nRepeat the washing step once.\nElute the PCR product with 20 μL of water twice and freeze-dry.\nSize selection of qPCR products. Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nPrepare a 3% (w/v) low-melting point agarose gel (Topvision agarose) in 1× TBE buffer containing 1× SYBR Gold stain.\nNote: Do not vigorously swirl the dissolved agarose gel to avoid introducing bubbles into the gel. Bubbles can be trapped and skew the shape of DNA bands during electrophoresis.\nDissolve the DNA pellet with 7 μL of 6× Blue/Orange Loading Dye (Promega, Cat#PR-G1881).",
    "Perform the electrophoresis at 110 v until the primer dimer (if observed; characteristically runs at 130–150 nt) is fully separated from the main PCR product (>150 nt).\nNote: Specifically, image the gel on a blue-light transilluminator every 25–30 min to check if the separation has occurred. Continue running the gel if the primer dimer band has not separated from the PCR product band. If full separation has taken place, proceed to the next step.\nNote: Samples with low amplification cycles may not contain detectable primer dimer bands after running the gel for 2 h. In this case, stop the electrophoresis and proceed to the next step.\nTransfer the agarose gel to a blue-light gel imager.\nExcise and collect the gel bands between 150 nt to 300 nt to remove the unreacted primers and primer dimers (Figure 6[href=https://www.wicell.org#fig6]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3081-Fig6.jpg\nFigure 6. Agarose gel and capillary electrophoresis analyses of qPCR amplification products\n(A) 3% Agarose gel analysis of qPCR amplification products in step 19. The regions of gel to excise and collect are highlighted with the red dashed box. For probe-treated samples: 1—treatment with only probe 2; 2—treatment with probe 2 + drug 1. For bystander controls: 1—treatment with only DMSO; 2—treatment with only drug 1.\n(B) DNA quality analysis of qPCR amplification products with capillary electrophoresis (CE) on a 2100 BioAnalyzer with HS DNA kits. The CE trace should characteristically resemble a natural distribution curve, with a peak at ∼200 nt and the absence of primer dimer around 130 nt.\nExtract PCR products with a QIAGEN MinElute Gel Extraction kit (QIAGEN, Cat#28604) following the manufacturer’s protocol from QIAGEN website[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/dna-clean-up/minelute-gel-extraction-kit].\nElute with 10 μL of nuclease-free water twice.\nQuality control and pooling strategy of the final sequencing library",
    "Characterize 1 μL of sample by BioAnalyzer with a High Sensitivity DNA Analysis kit (Agilent, Cat#5067-4626). Troubleshooting 5[href=https://www.wicell.org#sec6.9].\nCritical: High-quality libraries exhibit a bell-like capillary electrophoresis trace, with a peak at ∼200 nt and the absence of primer dimer at 130–150 nt (Figure 6[href=https://www.wicell.org#fig6]B).\nDetermine the DNA concentration of each sample with a Qubit dsDNA HS Assay kit (Thermo Fisher Scientific, Cat#Q32851) following the manufacturer’s protocol from the Thermo Scientific website[href=https://www.thermofisher.com/order/catalog/product/Q32851].\nPrepare 50 μL of a pooled library (≥ 0.5 ng/μL) by mixing an equal mass quantity (determined by Qubit assay in the previous step) of each sample.\nPause point: The sequencing library can be stored at −20°C until sequencing.\nPerform next-generation sequencing of the pooled DNA library using the Illumina HiSeq X-ten or an equivalent platform: 2 × 150 bp read (read 1/read 2 sequencing reads) without demultiplexing.\nCritical: We strongly recommend spiking 20%–25% of PhiX into the final sequencing library to increase the library complexity.\nNote: The minimum sequencing depth for a sample mainly depends on the complexity of the sequencing library. In our experience, we recommend a sequencing depth of at least 20 million reads for probe-treated samples and at least 80 million reads for bystander controls.\nSequencing data processing\nTiming: 1–2 days\nThe alignment and quantification methods used herein are based on the icSHAPE pipeline5[href=https://www.wicell.org#bib5] and RBRP pipeline1[href=https://www.wicell.org#bib1] with custom modifications.\nObtain paired-end FASTQ files from the sequencer.\nNote: Each sample should have one Read 1 and one Read 2 FASTQ files. Depending on the sequencer or data delivery platform used, it may be necessary to change the file format to ‘.fastq’. Only Read 1 file will be used in the downstream analysis.\nDemultiplex the sequencing data based on the barcoded index of each sub-library.\n>splitFastq.pl -U Read1.fastq -l GGTT:LIB_1::TTGT:LIB_2::ACCT:LIB_3::CAAT:LIB_4::TGGC:LIB_5::GGTC:LIB_6::AATC:LIB_7::TCAA:LIB_8::CCAG:LIB_9::AGGA:LIB_10::others:unknown -b 5:4 -d /out_directory/ -s Summary_barcode.stat",
    "Note: Use a unique RT primer with a unique barcoded index for each sample. ‘Read1.fastq’ is the raw Read 1 FASTQ file. The 4-digit nucleotides are the barcoded indices determined by the sequences of barcoded RT primers. ‘LIB_x’ (e.g., ‘LIB_1’, ‘LIB_2’) is the name to be given to the demultiplexed FASTQ file for each sample. ‘Summary_barcode.stat’ lists the number of reads with each barcode.\nRun FastQC on the demultiplexed FASTQ files to evaluate their quality.\n>fastqc -o /out_directory/ LIB.fastq\nNote: “out_directory” is the pathway to output the results of FastQC.\nRemove PCR duplicates. Troubleshooting 8[href=https://www.wicell.org#sec6.15].\n>readCollapse.pl -U LIB.fastq -o LIB.rmdup.fastq -f LIB.fa\nNote: PCR duplicates are defined as reads coming from the same DNA amplicon via qPCR. ‘LIB.fastq’ is the output of step 21.\nTrim the adapter sequence and barcoded index sequence from all reads.\n>trimming.pl -U LIB.rmdup.fastq -o LIB.trimmed.fastq -l 13 -t 0 -c phred33 -a adapter.fa -m 25\nNote: If the trailing nucleotides have poor sequencing quality (with an average Phred score < 30 or an average mismatch rate > 0.01) based on the FastQC results of step 22, trim these nucleotides using the -t option. Use -t to specify the number of trailing nucleotides to trim from the reads. ‘LIB.trimmed.fastq’ is the name to be given to the trimmed FASTQ file. ‘LIB.rmdup.fastq’ is the output of the previous step. ‘adapter.fa’ is a FASTQ file containing the sequences of the adapters. “-m 25” defined the minimal length of reads to retain for accurate alignment to the human transcriptome\nAlign amplicons to the human transcriptome using bowtie2. Troubleshooting 6[href=https://www.wicell.org#sec6.11].\n>bowtie2 -U LIB.trimmed.fastq -S LIB.sam -x /index/transcriptome --non-deterministic --time",
    "Note: ‘LIB.sam’ is the name to be given to the alignment SAM file. /index/ is the path to the bowtie2 transcriptome index generated in the “prepare the software and computing environment[href=https://www.wicell.org#sec1.3]” section of “before you begin[href=https://www.wicell.org#before-you-begin].” Bowtie2 transcriptome index should contain six files, including ‘transcriptome.1.bt2’, ‘transcriptome.2.bt2’, ‘transcriptome.3.bt2’, ‘transcriptome.3.bt2’, ‘transcriptome.4.bt2’, ‘transcriptome.rev.1.bt2’, and ‘transcriptome.rev.2.bt2’.\nCalculate transcript abundance (RPKM).\n>estimateRPKM.pl -i LIB_x.sam -o LIB_x.rpkm\nCount the number of reverse transcriptase stops (RTstops) in each identified transcript.\n>calcRT.pl -i LIB.sam -o LIB.rt -r LIB.rpkm -c 1\nNote: Only count RTstop frequency for transcripts with an RPKM value ≥ 1 (-c 1). ‘LIB.rt’ is the output RTstop file. ‘LIB.sam’ and ‘LIB.rpkm’ are the SAM alignment file and transcript abundance file.\nMerge background RTstop files of two biological replicates.\nMerge background RTstop files of DMSO-treated samples separately.\n>combineRTreplicates.pl -i Background_DMSO-1.rt:Background_DMSO-2.rt -o Background_DMSO.rt\nNote: DMSO-treated samples provide background RTstop files to correct for random RNA breaks and non-specific RNA binding for samples that are treated with Probe 2 only.\nMerge background RTstop files of drug-treated samples separately.\n>combineRTreplicates.pl -i Background_Drug-1.rt:Background_Drug-2.rt -o Background_Drug.rt\nNote: Drug-treated samples provide background RTstop files to correct for random RNA breaks and non-specific RNA binding for samples that are treated with Probe 2 and parent drug 1.\nNote: ‘Background_x-1.rt’ and ‘Background_x-2.rt’ are RTstop files of two biological replicates from step 27. ‘Background_x.rt’ is the name to be given to the merged background RTstop files.\nNormalize the format of each RTstop file for all samples and combined RTstop files from step 28.\n>normalizeRTfileScaleFactor1.pl -i LIB.rt -o LIB.normalized.rt -d 32 -l 32\nNote: ‘LIB.rt’ is the input RTstop file. ‘LIB.normalized.rt’ is the output file with normalized format. The first 32 nt (“-d 32”) and the tailing 32 nt (“-l 32”) will be excluded for normalization.",
    "Calculate the RBRP score at each nucleotide for all identified transcripts.\nCalculate RBRP score of samples with only probe 2:\n>calcRBRPminusCtrl.pl -f LIB.normalized.rt -b Background_DMSO.normalized.rt -o LIB.tmp.out -e dividing -y 0.5\nCalculate RBRP score of samples with probe 2 and competing compound 1:\n>calcRBRPminusCtrl.pl -f LIB.normalized.rt -b background_Drug.normalized.rt -o LIB.tmp.out -e dividing -y 0.5\nNote: ‘LIB.normalized.rt’ is the format normalized file of the probe-treated sample. ‘Background_x.normalized.rt’ is the format normalized file of the background samples. ‘LIB.tmp.out’ is the output RBRP score file. This step quantifies the level of acylation as the acylation ratio = RTstops/base_density of each nucleotide in the identified transcripts. Setting “-e dividing -y 0.5” computes RBRP score of each nucleotide as [acylation ratio (probe-treated sample)] - [acylation ratio (background sample)]/2.\nNote: RTstop sites are identified as the first base of the trimmed Read 1. These sites are due to RTstops caused by drug-promoted acylation, random RNA breaks, random acylation, and non-specific RNA binding. As acylation prematurely stops the reverse transcriptase at the neighboring 3′-nucleotide, we shift the RTstop counts of each nucleotide one nucleotide toward its 5′-end. To quantify the acylation signal, we divide the RTstop count for each nucleotide by its sequencing depth (base density), resulting in a ratiometric value. This ratiometric value represents acylation signal (acylation signal = RTstop count/base density). Next, we adjust the acylation signal value of each nucleotide in the probe-treated samples subtracting the corresponding background acylation signal value:\nRBRP\nscore\n=\n[\nAcylation\nsignal\n(\nprobe\n−\ntreated\nsample\n)\n]\n−\n0.5\n×\n[\nAcylation\nsignal\n(\nbackground\nsample\n)\n]\n.",
    "The RBRP score is then calculated for each identified transcript in probe-treated samples to account for the effects of random RNA breaks, random acylation, and non-specific RNA binding. Since the probe-treated and background libraries undergo sequencing at different depths, the strength of removing background acylation signal is optimized at 0.5 for human HEK293 cells and acylimidazole-conjugated acylating probes. This factor was trained with probe 2 to maximize the correlation between RBRP score and the level of 2′-acylation determined by RT-qPCR for identified RNA targets. To enhance the confidence in target identification, the nucleotides are further filtered based on RTstop counts and base densities.\nFilter out low-quality RBRP scores for regions that do not meet the stringency requirements.\n> filterRTstopBD.pl -i LIB.tmp.out -o LIB.out -t 200 -s 5 -e 30\nNote: The threshold of sequencing depth (“-t”) is the minimal sequencing depth of a nucleotide required to provide sufficient correlation of RTstop files between the two biological replicates. ‘LIB.tmp.out’ is the input RBRP score file from the previous step. ‘LIB.out’ is the output RBRP score file that contains only the high-quality RBRP scores from regions that pass the stringency filter. Setting “-t 200” requires the valid RBRP score must come from nucleotides with a sequencing depth (base density) ≥ 200. Setting “-s 5 -e 30” skip the first 5 nt and the tailing 32 nt for calculation.\nThe correlation of RTstop files is evaluated with the following command.\n> correlationRT.pl -1 LIB-1.rt -2 LIB-2.rt -t X > Correlation.txt",
    "‘LIB-1.rt’ and ‘LIB-2.rt’ are input RTstop files of two biological replicates. ‘Correlation.txt’ outputs the correlation coefficient of each nucleotide across the entire identified transcripts. ‘X’ is the numeric threshold of sequencing depth for the correlation analysis. ‘Correlation.txt’ can be visualized by ggplot in the R program. An optimal “-t” threshold value should be the smallest numeric value that provides relatively high concordance in RTstop files between two biological replicates. Troubleshooting 7[href=https://www.wicell.org#sec6.13].\nOptional: To enhance the stringency of this step, users can filter out nucleotides with RTstop counts below a certain threshold by “-R” option. For example, “-R 15” requires the valid RBRP score must come from nucleotides with RTstop counts ≥ 15.\nGenerate bedgraph files for downstream data visualization.\n> enrich2Bedgraph.pl -i LIB.out -o LIB.bedgraph -g Genome.gtf -a transcriptome.fa\nNote: ‘LIB.out’ is the input RBRP score file. ‘LIB.bedgraph’ is the output bedgraph file. ‘Genome.gtf’ is the human GRCh38 genome annotation file downloaded from Ensembl website[href=https://ftp.ensembl.org/pub/release-109/gtf/homo_sapiens/] in gtf format. ‘transcriptome.fa’ is the human transcript sequence file generated from “before you begin[href=https://www.wicell.org#before-you-begin]”.\nGenerate bigwig file.\n> sort -k1,1 -k2,3n LIB.bedgraph -o LIB.sorted.bedgraph\n> uniqueTrack.pl LIB.sorted.bedgraph LIB.sorted.uniq.bedgraph\n> cut -f1-4 LIB.sorted.uniq.bedgraph | grep -v NULL > LIB.sim.bedgraph\n> bedGraphToBigWig LIB.sim.bedgraph genome.size LIB.sim.bw\nNote: The ‘genome.size’ file is a tab-delimited text file consisting of two columns, with the first column listing the name of chromosomes and the second column presenting the length of each chromosome.\nCalculate the negative log-transformed p-value “-log10(p-value)” as the confidence score.\n> write p-value.wig ttest LIB(probe-only)-1.sim.bw LIB(probe-only)-2.sim.bw : LIB(probe + compound 1)-1.sim.bw LIB(probe + compound 1)-2.sim.bw\n> write logP-value.wig log 10 p-value.wig\n> write neglog10P-value.wig scale -1 logP-value.wig\n> wigToBigWig neglog10P-value.wig genome.size neglog10P-value.sim.bw",
    "Note: A p-value is calculated for every nucleotide in the identified transcript by Welch t-test using WiggleTool 1.2. ‘LIB(probe-only)-1.sim.bw’ and ‘LIB(probe-only)-2.sim.bw’ are input bigwig files of probe-treated samples from two biological replicates. ‘LIB(probe + compound 1)-1.sim.bw’ and ‘LIB(probe + compound 1)-2.sim.bw’ are input bigwig files of samples treated with probe 2 and competing compound 1 from two biological replicates.\nGenerate bigwig files to represent differential RBRP score. To determine the regions of each transcript targeted by probe 2, we compute a parameter called “differential RBRP score,” which represents the difference in RBRP scores between probe-only and competition samples. The differential-RBRP parameter is a numeric value ranging from -1 to 1, with RNA-binding sequences having a value close to 1.\n> wiggletools write mean.LIB(probe-only).wig mean LIB(probe-only)-1.sim.bw LIB(probe-only)-2.sim.bw\n> wiggletools write mean.LIB(probe + compound 1).wig mean LIB(probe + compound 1)-1.sim.bw LIB(probe + compound 1)-2.sim.bw\n> wigToBigWig mean.LIB(probe-only).wig genome.size mean_LIB(probe-only).sim.bw\n> wigToBigWig mean.LIB(probe + compound 1).wig genome.size mean_LIB(probe + compound 1).sim.bw\n> wiggletools write diff_RBRP.wig diff mean.LIB(probe-only).sim.bw mean.LIB(probe + compound 1).sim.bw\n> wigToBigWig diff_RBRP.wig genome.size diff_RBRP.sim.bw\nIdentify RNA binding sites of small molecules\nTiming: 1–2 days\nIn IGV (version 2.15.4), select ‘Human (GRCh38/hg38)’ as the host genome.\nLoad the ‘diff_RBRP.sim.bw’ and ‘neglog10P-value.sim.bw’ into IGV as track files.\nFor ‘diff_RBRP’ IGV track, select “Bar Chart” as the Type of Graph, “Mean” as the Windowing Function, and “Autoscale.”\nFor ‘neglog10P-value’ IGV track, select “Heatmap” as the Type of Graph, “Max” as the Windowing Function, and “Autoscale.”\nZoom into the transcriptome loci with high confidence scores (-log10P-value) to the single-nucleotide level.\nPutative drug-binding RNA loci are defined as nucleotides with RBRP scores ≥ 0.12 and P-values ≤ 0.05 (Figure 6[href=https://www.wicell.org#fig6])."
  ],
  "subjectAreas": [
    "Rnaseq",
    "Chemistry",
    "Bioinformatics"
  ],
  "bigAreas": [
    "Bioinformatics & Computational Biology"
  ]
}