{
  "id": 4003,
  "origin_website": "Cell",
  "title": "Protocol for Application, Standardization and Validation of the Forskolin-Induced Swelling Assay in Cystic Fibrosis Human Colon Organoids",
  "procedures": [
    "Step-by-Step Method Details\nStep-by-Step Method Details\nObtaining Human (Colon) Rectal Biopsies\nTiming: ∼2 h\nCritical: Clinical procedures to isolate rectal or colon biopsies from patients either through forceps biopsy (A) or rectal suction biopsy (B) should ALWAYS be performed by trained medical staff in a medical clinic. Make sure all necessary precautions are in place for a safe procedure.\nFill a 50 mL conical tube with +/− 20 mL of PBS0 at 4 °C\nIf biopsies are transported over long distance or long duration (>8 h) before crypt isolation procedure can take place, biopsies should be stored at 4 °C in Ad-DF +++ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL).\nCaution: Authorized personnel should wear gloves and a physician’s coat. This is the minimum protection that should be worn when working in the OR (operating room). Make sure all the apparatus are calibrated and sterilized.\nCritical: Procedures should not take place:\nIf the patient suffers from thrombocytopenia (less than 50 x 109 thrombocytes /L).\nIf the patient suffers from coagulation disorder.\nIf the patient is currently suffering from severe inflammation of the intestine.\nIn case of visibility problems during the endoscopy.\nPossible Complications during and after the Procedure\nPerforation of the intestinal wall.\nSevere or persistent bleeding.\nAttention Points\nThe nurse notifies the physician if the biopsies are of excellent, decent or inferior quality (see Figure 3[href=https://www.wicell.org#fig3]).\nBe considerate with regards to the position and signs of any pain or discomfort of the patient.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig3.jpg\nFigure 3. Example of a Good Quality Biopsy\nNote the pink colour and round shape.\nForceps Biopsy Procedure\nAdditional information on forceps biopsy procedure including video can be found elsewhere (Servidoni et al., 2013[href=https://www.wicell.org#bib5]).\nNote: A nurse/endoscopy-assistant guides the patient through the process and assists the physician throughout the procedure.",
    "Caution: The (jumbo) forceps should be closed and pulled back when entering or exiting the endoscopic instrumentation channel.\nCaution: The procedure should not take place in case there are visibility problems during the endoscopy.\nNote: Before starting the procedure, be sure you have read and understood all the instructions detailed in this paragraph.\nMake sure the patient agrees to the procedure before starting and the appropriate informed consent form is signed.\nThe nurse opens the 50 mL collection tube containing PBS0 or storage media (Ad+++ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL)) at 4°C and properly labelled for the rectal biopsies (with clean gloves).\nThe nurse proceeds by opening a new sterile jumbo forceps packaging, removing the cover at the end of the forceps around the mouth of it and presents it to the physician.\nThe physician enters the forceps inside the endoscopic instrumentation channel.\nThe nurse/assistant opens or closes the forceps as instructed by the physician.\nWhen removing the forceps out of the endoscopic instrumentation channel it should be cleaned with a gauze to avoid blood spatters. The biopsies are collected in the collection tube.\nNote: If the rectal/ colon biopsy is sticking to the jumbo forceps, use a sterile needle or sterile tweezers to remove the biopsy.\nRinse the forceps in a cup of clean water before re-entering the jumbo forceps into the endoscope to collect more biopsies from the patient. Make sure the forceps are clean.\nRepeat steps 4–7 until a minimum of 4 good quality biopsies have been successfully isolated and collected (all biopsies can be collected in the same tube).\nAfter the procedure the nurse firmly closes the collection tube and takes off her gloves.",
    "If there is more than one biopsy collection tube, make sure it is marked and numbered by the nurses.\nMaintain the collection tube with the biopsies on ice at ∼4°C in a styrofoam box.\nAfter the procedure is finished the patient should remain in the hospital for an additional hour to check for potential rectal bleeding. In case of severe or persistent rectal bleeding a qualified physician should be consulted.\nWhen no complications are observed the patient can be discharged.\nInform the patient about potential late onset rectal bleeding. In case of late onset rectal bleeding a qualified physician should be consulted.\nObtaining Biopsies by Rectal Suction Device\nA nurse/endoscopy-assistant guides the patient through the process and assists the physician throughout the procedure.\nNote: Before starting the procedure, make sure to have read and understood all the instructions detailed in this paragraph\nMake sure the patient agrees to the procedure before starting and the appropriate informed consent form is signed.\nEnsure an appropriate bowel preparation: apply an enema to the patient (Sodium phosphate enema (2.5 mL∗ (per) kg body weight; maximum dose 130 mL) by inserting the sodium phosphate solution rectally +/− 2–3 h before the biopsy procedure.\nWait for the result of the enema.\nTest the rectal suction device for vacuum pressure before using it in the patient (see Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig1.jpg\nFigure 1. Rectal Suction Biopsy Device with Manometer for Defined Suction Pressure and Syringe to Create Suction\nThe nurse opens the 50 mL collection tube containing PBS0 or storage media (Ad-DF+++ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL)) at 4°C and properly labelled for the rectal biopsies (with clean gloves).\nApply lubricant (e.g. K-Y Jelly) to the rectal suction biopsy device.",
    "Carefully introduce the suction biopsy device rectally, approximately 5 cm distance from the anal verge.\nPosition the opening of the suction biopsy device between 45 and 90 degrees laterally from the dorsal side to avoid arteries (see Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig2.jpg\nFigure 2. Cross-Sectional View of the Colon with Advised Positioning of the Rectal Suction Biopsy Device Opening\nObtain a biopsy from the rectum/ colon, with a defined suction pressure of 30 kPa/0.3 Bar.\nRelease the rectal (colon) biopsy from the device by twirling and shaking the frontal side in the collection tube containing 20 mL storage media at 4 °C (either PBS0 or Ad-DF+++ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL)) and until the biopsy is visible in the fluid.\nRepeat steps 5–10 until a minimum of 4 good quality biopsies have been successfully isolated and collected (all biopsies can be collected in the same tube).\nAfter the procedure the nurse firmLy closes the collection tube and takes off her gloves.\nMaintain the collection tube with the biopsies on ice at ∼4°C in a styrofoam box\nAfter the procedure is finished the patient should remain in the hospital for an additional hour to check for potential rectal bleeding. In case of severe or persistent rectal bleeding a qualified physician should be consulted.\nWhen no complications are observed the patient can be discharged.\nInform the patient about potential late onset rectal bleeding. In case of late onset rectal bleeding a qualified physician should be consulted.\nTransport of Biopsies to the Laboratory",
    "Critical: Intestinal crypts can be retrieved from a rectal/ colon biopsy (hereafter referred to as “colon biopsy”) with a high efficiency (> 95% success rate) within 48 h of the biopsy collection. However, tissue quality gradually decreases over time leading to a reduced chance of successfully isolating crypts from the biopsies. Therefore, immediate transport of the colon biopsies at 4 °C in AD-DF+++ is essential to ensure successful crypt isolation and establish efficient colon organoid cultures.\nNote: Good quality colon biopsies should be round and have a slightly pink to red color (see Figures 3[href=https://www.wicell.org#fig3] and 4[href=https://www.wicell.org#fig4]). When you are uncertain about the quality of the rectal biopsies, please check if intestinal crypts are visible under the light microscope. Good quality biopsies show a honeycomb- like structure in which the stem cell crypts reside. If this structure is not visible, the biopsy is of bad quality (Figure 4[href=https://www.wicell.org#fig4]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig4.jpg\nFigure 4. Examples of Biopsies as Viewed under a Microscope (Bright Field, 4 x Magnification)\n(A) Good quality biopsies; note the honeycomb structure indicative of intestinal crypts.\n(B) Bad quality biopsies, this can be due to lack of tissue depth of the biopsy leading to an absence of intestinal crypts.\nThe colon biopsies should be stored on ice or at 4°C (fridge) in properly labelled 50 mL polypropylene conical tubes containing 30 mL of PBS0. Make sure the tissue is NOT frozen.\nNote: If the biopsies are transported over long distances or over a long duration (>8 hs) before the crypt isolation procedure can be initiated, the biopsies should be stored in Ad-DF+++ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL) at 4°C.",
    "Make sure the 50 mL conical tube containing the colon biopsy in the storage medium is tightly closed and properly labelled. The date of the biopsy collection should be written on the tube (preferably on a sticker).\nDuring the biopsy transport, the temperature needs to be 4°C. Please use cold gel or ice packs during the shipment.\nCritical: Wet ice should not be used for the shipment, since thawing ice might damage the labelling of the tubes.\nOrganoid Crypt Isolation from Human Colon (Rectal) Biopsies\nTiming: ∼3 h\nCritical: All laboratory procedures related to colon organoid or cell cultures should be performed in a laminar flow to avoid contaminations and to protect the operator from biological risks.\nCritical: Always keep matrigel at 4°C or on ice to prevent polymerization above 10 °C.\nCritical: Pre-warm 24- and 96-wells plates used for organoid culturing to 37 °C for a minimum of >1 day. This is essential to ensure that after the colon organoids are plated, the matrigel polymerizes in the well efficiently and forms stable drops.\nPreparations\nPrepare cold Ad-DF+++ and cold PBS0 (4 °C).\nThaw (and keep) matrigel on ice or at 4 °C and dilute 1:1 with cold CM +/+ (= 50% matrigel).\nPrepare CM +/+ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL) to reduce the risk of infection.\nEDTA Incubation\nCritical: In every step of this procedure, when handling the biopsies with pipettes, it is necessary to pre-coat the pipettes with Ad-DF+++ by aspirating media into the pipettes and discard the media. This covers the inside of the pipets with liquid and prevents biopsies from adhering to the plastic.\nWash the colon biopsies several times in cold PBS0 until the supernatant is clear using the following procedure:",
    "Pipet the biopsies up and down ∼10 times in 10 mL with a 10 or 25 mL pipet.\nLet the biopsies settle at the bottom for 30 seconds.\nRemove the supernatant and add 10 mL of clean cold PBS0.\nRepeat these steps 2–4 times until the biopsies and supernatant are clear of debris.\nDiscard the supernatant and add 10 mL of clean PBS0 to the biopsies and supplement it with 200 μL ultrapure EDTA pH 8, 0.5 M (final concentration 10 mM).\nPlace the tube on a roller mixer for 90–120 min at 4 °C. The incubation time is dependent on the time between the biopsy collection and the start of the crypt isolation procedure. The longer the interval between biopsy collection and isolation procedures, the longer it is required to incubate. Crypts can be isolated from colon biopsies up until 48 h after biopsy collection but crypt yield decreases over time.\nIsolate Intestinal Crypts from Biopsies\nAllow the colon biopsies to settle at the bottom of the tube.\nDiscard the supernatant (PBS0 + EDTA).\nAdd 3 mL cold PBS0 to the tube containing the biopsies and pipet the biopsies up and down vigorously 10–20 times. Crypts are released from the biopsies and float in the PBS0, which is visible by eye through the observation of the solution becoming more cloudy. If no crypts emerge from the colon biopsies after 90–120 min of EDTA incubation add new PBS0 + EDTA and incubate for another 60 min.\nAllow the biopsies to settle at the bottom and transfer the supernatant with the crypts to a clean 15 mL tube.\nAdd fresh 3 mL of cold PBS0 to the biopsies again and repeat previous steps until no more crypts detach or until a sufficient amount of crypts are transferred to the clean tube.",
    "Add Ad-DF+++ to top up the solution containing the crypts in the 15 mL tube and centrifuge the crypts at 130 g for 5 min at 4 °C.\nGently remove the supernatant, the crypt cell pellet is vulnerable and can easily be lost by aspiration.\nAdd 10 mL of Ad-DF+++ to the crypt pellet for a second washing step and centrifuge at 130 g for 5 min at 4 ºC.\nPlating Intestinal Crypts in Matrigel\nFor the first passage (p.0) make sure to use a separate 24-wells plate per patient sample since isolated crypts from primary intestinal material during the first passage are most susceptible to infections.\nKeep the intestinal crypt pellet on ice.\nAnalyze the size of the pellet by eye to determine the appropriate volume of 50% matrigel.\nUsually, 4–6 wells per biopsy is sufficient for p.0. However, a higher number of wells can be used if the crypt yield is very high (7–12 wells) or a lower number when the yield is low (1–3 wells).\nTo ensure the crypt density is not too low, first resuspend the crypt pellet in 100 μl 50% matrigel.\nCheck the crypt density by plating a test droplet and view under the light microscope. Preferably do not plate out crypts too dense to allow for efficient (out)growth and proliferation of the structures. The ideal density is 15–20 crypts per 7.5 μL of matrigel drop.\nNote: the crypt density can be adjusted according to the observations in the test droplet.\nToo dense: If crypts are too densely seeded, dilute the sample in more matrigel and seed additional wells with the extra matrigel.\nToo sparse: If crypts are too sparsely seeded, crypts can be centrifuged at 130 g 5 min at 4 °C and resuspended in smaller volumes of matrigel to increase the density.",
    "Note: Prevent bubble formation during pipetting and plating.\nPlate 4∗ 7.5 μL of matrigel with about 15–20 crypts per drop of a (pre-warmed) 24-well plate.\nResuspend the matrigel after plating out 3 wells to ensure the crypts have not settled at the bottom of the microcentrifuge tube.\nIncubate 30 min. at 37 °C.\nAdd 500 μL of pre-warmed CM +/+ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL). An example of crypts directly after isolation can be found in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig5.jpg\nFigure 5. Crypts on Day 0 Directly after Isolation (Bright Field, 4 x Magnification)\nNote: gentamicin and vancomycin are only added to CM +/+ in the first week of culturing\nIncubate for 7 days at 37 °C, 5% CO2.\nFirst Week of Culture\nNote: Crypts close quickly and start to proliferate (visible as “budding”) after several days (see Figure 6[href=https://www.wicell.org#fig6]).\nOften check wells for infections. When any of the wells shows clear signs of infection, aspirate the medium from the well and add 1 mL ethanol for 30 s. Aspirate ethanol and matrigel drops and re-add 1 mL of ethanol for 30 s. Aspirate and leave well empty (important: leaving ethanol creates ethanol vapor in the plate, which leads to cell death in the other wells). This approach prevents cross contamination of other wells from this patient sample.\nRefresh the wells with 500 μL colon organoid medium +/+ with additional gentamicin (50 μg/mL) and vancomycin (50 μg/mL) every 2–3 days (e.g. Monday, Wednesday, Friday). If crypts are isolated on a Friday, add 1 mL CM +/+ instead of 500 μL (with additional gentamicin and vancomycin) to ensure optimal growth during the weekend\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig6.jpg\nFigure 6. Development of Crypt into Budding Organoid Structure on Day 1; 3; 4 and 7 (Passage 0)",
    "Arrows point to proliferating crypt and subsequent organoid structure (bright field, 4 x magnification).\nNote: To remove the media, use a new tip for every well to decrease infection and well to well contamination risks.\nOnce the crypt structures are budding, closed and proliferated (see Figure 6[href=https://www.wicell.org#fig6]), passage them as described in 5.1. This can usually be performed around day 6–8.\nNote: FIS experiments should only be performed after a minimum of two passages after isolation.\nGeneral Handling and Passaging of Human Colon Organoid Cultures\nTiming: ∼3 h\nCritical: Pre-warm 24- and 96-wells plates used for organoid culturing to 37 °C for a minimum of >1 day. This is essential to ensure that after the colon organoids are plated, the matrigel polymerizes in the well efficiently and forms stable drops.\nPreparations\nPrepare cold Ad-DF+++ and warm CM +/+.\nThaw (and keep) matrigel on ice or at 4 °C and dilute 1:1 with cold CM +/+ (= 50% matrigel).\nNote: the splitting ratio should be usually 1:4–1:8 24-wells. If seven day old organoid cultures cannot be split according to this ratio because they have not proliferated sufficiently, check the medium quality or reseed organoids in 1:1 wells without disruption to allow more time to recover or proliferate until disruption.\nPassaging Colon Organoids\nDiscard the CM +/+ from the wells containing the colon organoids.\nDetach the matrigel with the organoids by aspirating 1 mL Ad-DF+++ and forcefully dispensing the medium directly onto the matrigel drops in the well several times with a p1000 filter tip. If necessary gently scrape the well with the end of the pipet tip to detach residue.\nTransfer the colon organoid suspension to a sterile 15 mL tube on ice. Several wells (up to 12) can be combined in the 1 mL.",
    "Put a p200 tip (without filter) on top of a p1000 filter tip (see Figure 7[href=https://www.wicell.org#fig7]) and place the tip in the 1 mL organoid suspension on the bottom of the tube. Mechanically shear/disrupt the organoid structures by pipetting the 1 mL organoid suspension up and down 15–20 times through the p1000/ 200 tip combination. The organoids will be broken up into smaller parts. Resuspend with firm speed and fully take up and dispense the 1 mL suspension. Slow, mechanic shearing does not create efficient disruption. Minor foam formation is normal but try to prevent it by avoiding foam aspiration or dispension.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig7.jpg\nFigure 7. Put a p200 Tip on Top of a p1000 Filter Tip to Disrupt the Organoid Structures\nNote: steps 5 and 6 are relevant when colon organoid cultures are passaged before performing a FIS experiment or to clean an organoid culture that has many differentiated structures which need to be removed (see Figure 10[href=https://www.wicell.org#fig10]C). Otherwise proceed with step 7.\nAdd 5 mL of cold Ad-DF+++ to the 1 mL of disrupted organoids.\nClean up the organoid suspension by resuspending the organoids and let the bigger, differentiated organoid structures sink down in a tube angles at 70° for 10 s (see Figure 8[href=https://www.wicell.org#fig8]). Take up the smaller organoids by removing 1 mL from the top of the medium and transfer this to a sterile 15 mL tube on ice. Repeat this step until only 0.5–1 mL medium with bigger structures is left.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig8.jpg\nFigure 8. Hold the 15 mL Tube Tilted at 70 ° and Transfer the Organoids from the Top of the Medium to a New Tube",
    "Note: if many large structures are still left in the remaining 1 mL after steps 5 and 6 (visual by eye), repeat steps 4–6 but during step 4 only disrupt 10 times.\nTop up the 15 mL tube containing the smaller, disrupted organoids with 10 mL cold Ad-DF+++.\nCentrifuge at 130 g for 5 min at 4 °C.\nAspirate the supernatant and keep the organoid pellet.\nCritical: the colon organoid pellet is vulnerable and can be easily lost through aspiration of the supernatant. Be careful while aspirating the media: it is best to leave > 50 μL of supernatant on the organoids to avoid pellet aspiration. Remove the last supernatant with a p200 tip.\nPlating Colon Organoids in 24-Well Plates\nResuspend the organoid pellet in an appropriate volume of 50% matrigel. The volume of matrigel needed is 30 μL per seeded well of a 24-wells plate assuming enough organoids have been passaged.\nExample: 2 wells of a 7-day old, good quality organoid culture can be split into approximately 8–16 new wells of a 24-wells plate. To avoid too sparsely seeded wells, it is advisable to first resuspend in a matrigel volume sufficient to seed 6 wells. Therefore, the pellet can be resuspended in approximately 180 μL of 50% matrigel. In case the organoids are too densely seeded, the organoid suspension can be diluted by adding more matrigel.\nCheck the number of organoids in a 10 μl test drop of matrigel by light microscopy, to decide if the organoid suspension should be further diluted (the density should be 15-30 structures per drop, see Figure 9[href=https://www.wicell.org#fig9]B). Always recheck a new test drop after further dilution.",
    "While preventing bubbles, plate 4∗ 7.5 μL matrigel with a p20 tip per well in a (pre-warmed) 24-well plate (see Figure 9[href=https://www.wicell.org#fig9]A). Slightly tilting the plate helps to deposit the drops in the desired positions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig9.jpg\nFigure 9. Organoid plating examples in 24-wells plates\n(A and B) As shown in (A), add 4 drops of 7.5 μL containing organoids in a pre-warmed 24-wells plate. Slightly tilting the plate helps to deposit the drops in the designated location. Shown in (B) is an example of the ideal density of organoids in one 7.5 μl matrigel drop (bright field, 4 x magnification).\nNote: Organoid structures will quickly settle at the bottom of the tube within 30 s so frequently resuspend the organoid suspension with a p200. While resuspending keep the tube on ice to prevent the matrigel from solidifying in the tube.\nIncubate the plate for 15–20 min at 37 °C.\nAdd 500 μL of pre-warmed of CM +/+ per well.\nIncubate the organoid cultures for 7 days at 37 °C, CO2 5% and refresh the wells with 500 μL of CM +/ + per well, every 2–3 days (Monday, Wednesday, Friday).",
    "Note: Human colon organoids can usually be passaged every 7 days. Therefore, it is important to regularly check the quality of the organoid cultures. Good quality organoid cultures show a stem cell phenotype which is characterized by efficient budding structures. For wild type (or very mild CF genotype) colon organoids a clear pre-swollen lumen can be seen with bright field imaging compared to colon organoids with a CF genotype where no lumen is visible (see Figures 10[href=https://www.wicell.org#fig10]A and 10B).When colon organoids lose their stem cell phenotype (usually due to insufficient Wnt-3A activity in the WCM) the organoids appear as thick-walled, differentiated structures (see Figure 10[href=https://www.wicell.org#fig10]C). These bad quality organoid cultures are not appropriate for CFTR-related experiments because this leads to unreliable results.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig10.jpg\nFigure 10. Examples of 7-Day Old Human Colon Organoid Cultures (Bright Field, 4 x Magnification)\n(A) Typical pre-swollen stem cell phenotype of a high quality, proliferated wild type (non-CF) human colon organoid culture.\n(B) Non-swollen stem cell phenotype of a high quality, proliferated CF colon organoid culture.\n(C) Example of a bad quality CF colon organoid culture with thick-walled, differentiated structures with decreased stem cell phenotype which is often due to low activity of Wnt-3A in WCM.\nFreezing Human Colon Organoid Cultures\nTiming: ∼2 h\nTwo different methods of organoids freezing are described here. First is freezing trypsinized human colon organoids after 1–3 days replating (Freezing protocol A). This is an efficient method to store source colon organoid samples in a master cell bank. Second is freezing small organoid structures directly after disruption (Freezing protocol B); this is a fast, timesaving and efficient procedure appropriate for storing a local working cell bank.\nDisrupt and freeze organoids when well is full (7–10 days cultured organoids)",
    "Freeze one full well (of a 24-wells plate) per cryovial which should be sufficient to plate into 3–4 new wells after thawing.\nPrepare cold Recovery™ Cell Culture Freezing Medium.\nPrepare cold Ad-DF+++\nPrepare ROCKi 10 mM stock.\nPrepare warm CM +/+ with additional ROCKi 10 μM.\nFor freezing protocol A: thaw (and keep) matrigel on ice and dilute 1:1 with cold CM +/+ (= 50% matrigel)\nPrepare 0.05% Trypsin EDTA to 18–23 ° C\nFreezing Protocol A\nPerform step 1–4 and 7,8 of ‘General handling and passaging of human colon organoid cultures’, part B.\nAspirate and discard the supernatant and add 4 mL of 0.05% Trypsin EDTA, and vortex for 30 s.\nPut the tube in a warm water bath at 37 °C for 1 min and vortex vigorously for 30 s.\nInspect the solution in the tube by horizontally placing the tube on the light microscopy stage (4x objective), adjust focus so that organoids in solution are in visible. Observe the size of the organoid structures. If intact organoids are still visible put the tube in a warm water bath at 37 °C for an additional 1 min and vortex vigorously for 30 sec.\nWhen the organoids are sufficiently disrupted (∼100 x smaller), add 8 mL of Ad-DF+++ to neutralize the trypsin and resuspend 10 times the organoid suspension.\nCentrifuge the tube for 3 min at 450 g at 4 °C.\nAspirate and discard the supernatant and add the required amount of medium and matrigel to the organoid pellet.\nNote: For freezing, organoids must be seeded in a 1:1 ratio after trypsinization. Thus, 1 well of organoids from a 24-wells plate can be seeded into 1 new well of a 6-well tissue culture plate.\nMix the organoid suspension by resuspending without creating bubbles.",
    "Tip: Avoid bubbles by not fully aspirating and dispensing the pipet, but always keep a small amount of liquid in the tube.\nSeed 250 μL in a single well of a pre-warmed 6-well tissue culture plate by seeding 25 ∗ 10 μL matrigel drops .\nPlace the plate in the incubator at 37 °C and leave the matrigel to solidify for 20–30 min.\nAdd 2.5 mL of fresh CM +/+ + ROCKi in each 6-well plate well and transfer the plate to the incubator.\nNote: 1–2 day old organoid cultures are ready to be frozen. This increases the efficiency of survival after thawing.\nDetach the matrigel and organoids by aspirating 1 mL Ad-DF+++ and forcefully dispensing the medium directly onto the matrigel drops in the well several times with a p1000. If necessary gently scrape well with end of pipet tip to detach everything.\nTransfer the organoid suspension to a sterile 15 mL tube.\nWash the wells with another 1 mL of Ad-DF+++ and transfer to the same 15 mL tube.\nFill up the 15 mL tube with with 12 mL of cold Ad-DF+++ and pipet up and down with a 5 mL pipet.\nCentrifuge the suspension for 3 min at 450 g at 4 °C, remove the supernatant and keep the pellet.\nDissolve the organoid pellet with cold Recovery™ Cell Culture Freezing Medium and pipet up and down to properly resuspend all the organoid structures.\nNote: one full well from a 6-well plate is frozen in 1 mL of Recovery™ Cell Culture Freezing Medium and is divided over 2 cryovials. Each vial should contain enough cells to be thawed into ≥ 4 wells of 24-well plate.\nTransfer 0.5 mL of organoids suspension in Recovery™ Cell Culture Freezing Medium to sterile cryovials.",
    "Place the cryovials at −80°C in a cell container that will freeze the organoids 1°C per minute (e.g. mr Frosty).\nAfter 24 h, transfer the cryovials for storage in liquid nitrogen.\nFreezing Protocol B\nPerform step 1–4 and 7,8 of ‘General handling and passaging of human colon organoid cultures’, part B. However, shear/ disrupt the colon organoids 30–35 times to create even smaller organoid structures.\nAdd cold Recovery™ Cell Culture Freezing Medium\nUse 1 mL of Recovery™ Cell Culture Freezing Medium in 1 cryovial per isolated well. 1 frozen well in 1 cryovial can be thawed into 3–4 wells of a 24 - well plate\npellet of 1 full well + 1 mL Recovery™ Cell Culture Freezing Medium or FM → add to 1 cryovial\npellet of 3 full wells + 3 mL Recovery™ Cell Culture Freezing Medium or FM → divide over 3 cryovials\nPlace the cryovials at -80°C in a cell container that will freeze the organoids 1°C per minute (e.g. mr Frosty).\nAfter 24 h, transfer the cryovials for storage in liquid nitrogen.\nThawing Human Colon Organoids from Frozen Nitrogen Stock Vials\nTiming: ∼3 h\nCritical: Pre-warm 24- and 96-wells plates used for organoid culturing to 37 °C for a minimum of >1 day. This is essential to ensure that after the colon organoids are plated, the matrigel polymerizes in the well efficiently and forms stable drops.\nNote: Human colon organoids cultures can be thawed from two different types of nitrogen stock vials: Thawing cultures that have been collected after 2-3 days in culture after trypsinization (freezing protocol A) or thawing cultures from vials with small organoid structures frozen directly after disruption (freezing protocol B).\nPrepare warm Ad-DF+++ (37 °C).",
    "Thaw (and keep) matrigel on ice or at 4 °C and dilute 1:1 with cold CM +/+ (= 50% matrigel)\nPrepare ROCKi 10 mM stock.\nPrepare warm CM +/+ with additional ROCKi 10 μM.\nNote: Addition of ROCKi is only necessary during the first week after thawing\nColon Organoid Thawing Procedure\nAdd 13 mL pre-warmed Ad-DF+++ in a 15 mL tube\nRinse the outside of the cryovial with warm water or place in 37 °C water bath until the cell suspension in the vial is thawed. Clean the outside of the cryovial with 70% EtOH.\nAlternative: first clean the outside of the cryovial with 70% EtOH and then add warm Ad-DF+++ to the organoid suspension to thaw it.\nRapidly transfer organoids to 15 mL tube with 13 mL Ad-DF+++ (37 °C).\nWhen thawing colon organoids frozen according to freezing protocol A\nGently mix the suspension and centrifuge 450 g for 5 min at 4 °C.\nDiscard supernatant and resuspend pellet in 100 μL of 50% matrigel.\nCheck the organoid density under the microscope by seeding a 7.5 μL matrigel test drop. The matrigel drop should contain >100 structures of very small colon organoid structures. Organoids frozen according to freezing protocol A should be thawed and seeded with higher density due to the smaller sized structures compared to protocol B. To ensure optimal outgrowth and budding of the colon organoid structures it is suggested to seed multiple densities to cover the most optimal density for recovery and proliferation.\nPlate 4∗ 7.5 μL matrigel drops without bubbles to a single well of a (pre-warmed) 24-wells tissue culture plate. Usually one cryovial should contain enough organoids to seed in 3–4 wells.\nDilute the remaining colon organoid suspension 1:1 with matrigel and plate two additional wells.",
    "Again, dilute the remaining colon organoid suspension 1:1 with matrigel and plate the fourth well.\nWhen thawing colon organoids frozen according to freezing protocol B\nGently mix the organoid suspension and centrifuge 130 g for 5 min at 4 °C.\nDiscard the supernatant and resuspend the organoid pellet in 100 μL of 50% matrigel.\nCheck the organoid density under the microscope: seed the organoid structures with a 10%–20% higher density compared to organoids already in culture, aiming for 50–70 structures per drop (10%–20% of the structures are usually not viable). Organoids frozen according to freezing protocol B should be thawed and seeded with lower density due to the larger sized structures compared to protocol A.\nPlate 4∗ 7.5 μL matrigel drops without bubbles per single well of a (pre-warmed) 24-wells tissue culture plate. Usually one cryovial should contain enough organoids to seed in 3–4 wells. Colon organoids will settle to the bottom quickly, so resuspend the organoids in the matrigel suspension frequently while plating.\nIncubate a maximum of 10 min at 37 °C. Thawed human intestinal organoids are sensitive to being left without warm CM +/+\nAdd 500 μL of (pre-warmed) CM +/+ with additional ROCKi inhibitor (10 μM) to each well. Refresh the medium with 500 μL CM +/+, every 2–3 days (Monday, Wednesday, Friday).\nIncubate at 37 °C, 5% CO2 for 1 week.\nCritical: Monitor the progress of the thawed organoid structures daily.\nForskolin Induced Swelling (FIS) Assay\nTiming: ∼5 h",
    "The FIS assay was developed to measure CFTR function in human colon organoids. Upon forskolin (fsk) stimulation (which indirectly activates CFTR through cyclic adenosine monophosphate (cAMP)), CFTR function can be assessed by observing the subsequent swelling of human colon organoids. Organoid swelling occurs through chloride excretion into the organoid lumen and osmosis. The assay can determine residual CFTR function and the effect of CFTR modulators (Dekkers et al., 2013[href=https://www.wicell.org#bib4], Boj et al., 2017[href=https://www.wicell.org#bib1]).\nCritical: Pre-warm 24- and 96-wells plates used for organoid culturing to 37 °C for a minimum of >1 day. This is essential to ensure that after the colon organoids are plated, the matrigel polymerizes in the well efficiently and forms stable drops.\nPreparations\nIncubate 96-well plates at 37 °C > 7 days. It is important to have warm plates to prevent dislodging of matrigel drops.\nPrepare cold Ad-DF+++.\nThaw (and keep) matrigel on ice and dilute 1:1 with cold CM +/+ (= 50% matrigel).\nPrepare warm CM +/ +.\nPlating Human Colon Organoids (Day 1)\nNote: Some CFTR modulators (e.g. correctors) require longer periods incubation. Example: correctors VX-809 and VX-661 require 24 h incubation and are added directly to the CM +/+ on the day of the organoid plating, whereas potentiator (e.g. VX-770) should be added directly before the FIS measurement. Take this into account when CM +/+ is added. See ‘European FIS validation & standardization protocol’ for corrector preparations.\nPerform step 1-9 of ‘General handling and passaging of human colon organoid cultures’, part B.\nResuspend the organoid pellet in 50% matrigel (plating volume = 4 μL ∗ amount of wells + 50 μL)\nWith good quality organoid cultures, one full well of organoids from a 24-wells plate can be seeded into 10–20 wells of a 96-wells plate",
    "Example: 8 wells of a 7-day, good quality organoid culture can be split and seeded into ∼80–160 wells of a 96-wells flat bottom plate. To avoid too sparsely seeded wells, it is advisable to first resuspend in a matrigel volume sufficient to seed 80 wells. Therefore, the organoid pellet can be resuspended in approximately 370 (80∗4 + 50) μL of 50% matrigel. In case the organoids are too densely seeded, organoids can be diluted by adding more matrigel.\nCheck the amount of organoids in a 4 μL test drop of matrigel under a light microscope, to determine whether the organoid suspension should be further diluted (the density should be 30–50 structures per drop). Always recheck a new test drop after further dilution.\nNote: when the organoid density is too low, matrigel can be resuspended in 10 mL of Ad-DF+++ and centrifuged at 130 g for 5 min at 4 °C. Next, aspirate medium and resuspend the organoid pellet in less matrigel.\nTransfer the organoid suspension to a cold microcentrifuge tube.\nWhile preventing bubbles add a 4 μL drop to a (warm) flat-bottom 96-well plate (see Figure 11[href=https://www.wicell.org#fig11]). This can be performed with a regular p20 pipet.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/72-Fig11.jpg\nFigure 11. Add 4 μl Drops Containing 20–50 Organoids per Drop to Every Well in a Pre-warmed 96-Wells Plate\nNote: Organoid structures will quickly settle at the bottom of the microcentrifuge tube within 30 s so resuspend the organoid suspension with a p200 regularly. While resuspending keep the tube on ice to prevent the matrigel from solidifying in the tube. It is advisable to use a repetitive pipet (like a Viaflo||, Integra) since the organoid seeding is performed more efficient, faster and homogeneously.\nIncubate the 96-wells plate for 5–10 min at 37 °C.\nAdd 50 μL of CM +/+ to each well.",
    "Incubate 20–24 h (overnight) at 37 °C, CO2 5%.\nNote: Regular organoid passaging and organoid seeding for FIS experiments can be combined. Guideline: prepare excess organoid suspension for seeding in a 96-well plate. Remaining organoid suspension can be diluted at least 1:1 and used for seeding in a 24-well plate for a following 7-day culture.\nFIS Assay & Confocal Microscopy (Day 2)\nIncubate Ad-DF+++ at 18–37 °C.\nTurn on the live cell compartment of the confocal microscope and pre-incubate at 37 °C and 5% CO2 (Pre-heating the live cell compartment takes a minimum of 30–45 min).\nPrepare fsk and/or CFTR-modulators as desired. Prepare fsk and CFTR-modulator compounds in a 2 x concentration in Ad-DF+++ so when 50 μL is added to the organoids in a well of the 96-well plate containing already 50 μL of CM+/+, , the 1:1 dilution creates a 1 x final concentration of the desired fsk or compound concentration.\nExample: if the desired final concentration of fsk within the well is 5 μM, prepare a fsk dilution of 10 μM. If 50 μL of 10 μM fsk is then added to the 50 μL CM +/+, the final concentration will be 5 μM.\nPrepare 8.4 mM stock of calcein green AM by adding 6 μL of DMSO to one 50 μg calcein green vial. For one full 96 well plate, add 1 μL of 8.4 mM calcein green solution in 1000 μL Ad-DF+++.\nAdd 5 μL of calcein green solution to each well (final concentration is 0.84 μM)\nGently resuspend the well 2–3 times with a multichannel for homogeneous staining and efficient uptake of calcein green by the organoid structures. Try tilting the plate and point tips of multichannel in the corner of each well to prevent touching the matrigel drop.",
    "Incubate the plate at 37 °C, CO2 5% for 15–30 min before starting the experiment.\nPut the 96-well plate in the plate holder of the live cell imaging device and ensure the plate is in fixed position. Live cell imaging settings:\nOrganoid structures with calcein green stain can be visualized upon emission at 488 nm and excitation at 515 nm (detection wavelength range 450–700 nm).\nUse 5 x objectives and ensure an overview of the full matrigel drop by adjusting the focus.\nSet the position (x, y) and focus (z) of the matrigel drops in the acquisition software.\nNote: an autofocus option may be used when available.\nMeasurement settings for 60 min measurement:\nInterval = 10 min,\nCycles = 7 (Cycle 1 is t = 0).\nNote: the acquisition of images from the total 96-well plate in each time point should not exceed 5 min to ensure optimal comparison of time points between wells.\nMake sure the calcein green signal in the organoids structures is slightly oversaturated and the signal to noise ratio is optimized as much as possible (this is essential for optimal recognition of the organoid structures by the imaging software).\nAdd 50 μL Ad-DF+++ containing fsk stimuli (and/or CFTR-modulators) to each well containing 50 μL of CM +/+. It is preferred to add the stimuli from a 96-well dummy plate with an 8-multichannel for accuracy and efficiency if the size of the live cell chamber allows this. If this is not possible, add the stimuli with a regular pipet.\nStart the acquisition immediately after stimuli are added.\nEuropean FIS Validation & Standardization Protocol\nTiming: ∼ 8 weeks",
    "To ensure correct implementation of the human organoid technology and the application in the FIS assay, six reference human colon organoid lines (covering different classes of CFTR mutations from severe to mild -see Table 4[href=https://www.wicell.org#tbl4]). These organoids lines were tested for basal CFTR function and specific drug response to available CFTR modulators (VX-661 and VX-770). Based on the following protocol, swelling data (technical duplicates at three time points with weekly intervals (n=3)) were generated to compare the qualitative and quantitative results of the implemented organoid technology and FIS assay (not yet published data). These reference organoid lines were selected based on prevalent CFTR genotypes (see Table 4[href=https://www.wicell.org#tbl4]) and differences in CFTR basal function and response to CFTR modulators. Researchers that follow the detailed work instructions presented in this protocol should find identical or highly reproducible results (within 10% of AUC values, not yet published data) for these reference lines to confirm successful implementation of the human intestinal organoid technology and FIS assay.\ntable:files/protocols_protocol_72_5.csv\nPreparations for Validation Protocol\nMedium amounts:\n1 liter CM +/+ (see ‘Stock preparation of human colon organoid medium components’ for instructions on media preparation)\n500 mL 2x CM −/− Prepare 10 x 100 mL bottles with 50 mL stock and store at −20 °C\n500 mL WCM Prepare 2 batches of > 375 mL (> 20 x 145 mm Petri dishes per batch) and pool. Store at 4 °C)\n0.25 mg R-spo3 Stock and aliquot volume dependent on LOT#. Store for 3 months at −80 °C.\n35 mL 50% Matrigel Aliquot 2 x 10 mL vials in 500 μL per microcentrifuge tube and store at −20 °C\nGeneral Experimental Set Up\nThe FIS validation assay is based on the experimental set up as previously performed and described (Dekkers et al., 2016[href=https://www.wicell.org#bib3], Science; Boj et al., 2017[href=https://www.wicell.org#bib1], Jove).",
    "Each reference organoid line was tested using four different conditions (basal CFTR function, VX-661; VX- 770 and VX-661 + VX-770, each in combination with 8 different fsk concentrations (0.008; 0.02; 0.05; 0.128; 0.32; 0.8; 2 or 5 μM) which results in 32 different experimental conditions.\nBiological replicates for each condition were measured in duplicate and experiments were repeated n=3.\nHuman colon organoids were plated in a 96-well plate as schematically depicted in Table 5[href=https://www.wicell.org#tbl5].\ntable:files/protocols_protocol_72_6.csv\nVX-661 was added 24 h before the FIS experiment\nVX-770 was added acutely before the FIS experiment was initiated.\nHuman Colon Organoid Culturing & Workflow (Also See Table 6)\ntable:files/protocols_protocol_72_7.csv\nWhen received, store cryovials with organoid reference lines in liquid nitrogen until ready for the FIS experiments.\nWhen ready, thaw a cryovial per reference organoid line as described in thawing protocol A\nSeed 3–4 wells of a pre- warmed 24- well plate for each organoid reference line and add CM +/+ with additional ROCKI.\nCheck the organoid structures by light microscopy after 3 days and ensure there is enough space for the structures to expand. If not consider reseeding the cells with decreased organoid density to allow more space to proliferate and expand.\nAfter 7 days of culture check the growth and quality of the organoid structures (compare to structures in Figure 10[href=https://www.wicell.org#fig10]) :\nWhen the organoids are not yet budding, but appear small and round, densely proliferating organoids: take up and wash the organoids, centrifuge at 130 g for 5 min at 4 °C without disruption/shearing and reseed 1 well into 3 new wells to create more space and allow for continuous proliferation of the structures.",
    "When the organoids appear as already “budding” and healthy, large structures: disrupt 1 well according to ‘General handling and passaging of human colon organoid cultures’ (without the cleaning step) and seed into 3–4 new wells.\nAfter week 2 and a further 7 days in culture check the appearance of the organoid structures.\nWhen grown into appropriate budding, proliferated organoid structures (see Figure 10[href=https://www.wicell.org#fig10]B): Freeze two full wells into two cryovials according to freezing protocol B. Take the 3rd full well, disrupt and wash the organoids and seed into 3–4 new wells (without the cleaning step).\nWhen not yet grown/proliferated into efficient budding organoid structures and the organoid structures still appear dense and small: repeat the washing and reseeding step without disruption/shearing and seed in 3 wells.\nAfter week 3, all organoid lines should be of good culture quality, meaning they should appear as efficiently budding, proliferating structures and sufficient growth. Colon organoids are then ready to be frozen and to start experimental cultures to use in the FIS assay. Make sure a working cell bank is stored for every reference organoid cell line before any FIS experiments are started (see Table 6[href=https://www.wicell.org#tbl6]).\nTo start the FIS experiment, expand each organoid reference line into 8 wells in a 24-well plate. This should be sufficient to perform a FIS experiment as well as to reseed organoids for the FIS experiment of the following week. After week 4, plate out organoids to perform the FIS assay. Use the experimental plate lay out as depicted in Table 5[href=https://www.wicell.org#tbl5].\nPreparation of CFTR Corrector VX-661 (Day 1)",
    "Prepare CM +/+ with VX-661 before plating out the organoids. VX-661 needs to be added 24 h in advance of the FIS measurement in CM+/+ with a final concentration of 3 μM. For example: from a 20 mM stock: add 95 μL of Ad-DF+++ to 5 μL of 20 mM stock creating 1 mM of VX-661 solution.\nPer 96-well plate add 9.6 μL of 1 mM VX-661 to 3 mL of CM+/+ creating a final concentration of 3.2 μM.\nAdd 50 μL to each well that requires 24 h of VX-661 incubation (see Table 5[href=https://www.wicell.org#tbl5] for plate lay out)\nThe rest of the wells can be filled with regular CM +/+.\nPreparation of CFTR Stimuli VX-770 & fsk (Day 2)\nPer 96-well plate:\nAdd 1 μL fsk (10 mM) to 1 mL Ad-DF+++ (= fsk (10 μM)), final concentration in assay will be 5 μM).\nAdd 2 μL of VX-770 stock (20 mM) to 6 mL of Ad-DF+++ (= VX-770 6.4 μM, final concentration will be 3.2 μM.\nTake 1 mL of VX-770 6.4 μM solution and add 1 μL fsk (10 mM) (= fsk + VX-770 solution)\nPrepare the titrations (serial dilution) according to Table 7[href=https://www.wicell.org#tbl7] below. Resuspend every suspension 10 times and use a new tip for every dilution step.\ntable:files/protocols_protocol_72_8.csv"
  ],
  "subjectAreas": [
    "Organoids",
    "Clinical Protocol",
    "Stem Cells"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}