{
  "id": 6724,
  "origin_website": "Bio",
  "title": "Low-cost and Multiplexable Whole mRNA-Seq Library Preparation Method with Oligo-dT Magnetic Beads for Illumina Sequencing Platforms",
  "procedures": [
    "In this protocol, we used MagnaStand YS-model (FastGene) in nucleotide acid purification with magnetic beads. All experiments were conducted in 0.2 ml PCR tubes. Reaction solutions should be mixed by tapping or inversion. All operations should be conducted under a DNA/RNA-free environment. The overview of this protocol is shown in Figure 1.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617225212_9221.jpgFigure 1. The protocol flow chart of this protocol. The approximate time required is shown for each step. mRNA purificationWash 15 μl of Dynabeads® Oligo (dT)25 (Thermo Fisher Scientific) twice each with 50 μl of 2× binding buffer (Recipe 1) using Magna Stand for 0.2 ml PCR Tube (FastGene) and then resuspend the beads in 30 μl of 2× binding buffer for the later use.‘Wash’ indicates:Put on a magnet, 5 min, remove supernatant.Add 2× binding buffer and mix by pipetting.Repeat.Denature total RNA (more than 1 μg and RIN > 7.0 is recommended) in 30 μl of distilled water or 10 mM Tris·HCl (pH 8.5) at 65 °C for 2 min and then immediately transfer onto ice. All thermal control procedures in this protocol can be processed in a thermal cycler. Then add 30 μl of the washed Dynabeads® Oligo (dT)25. Mix the mixture well by pipetting and incubate at room temperature for 10 min. And next wash the mixture with 70 μl of washing buffer (Recipe 2) twice using the Magna Stand.‘Wash’ indicates:Put on a magnet, 5 min, remove supernatant.Add washing buffer and mix by pipetting.Repeat.Elute the RNA in 30 μl of pre-warmed distilled water at 80 °C for 5 min and then immediately chill on ice. For a second round of polyA-selection, add 30 μl of 2× binding buffer to the solution, and incubate at room temperature for 10 min. Again, wash the mixture with 70 μl of washing buffer twice using the Magna Stand.",
    "Elute the RNA in 14 μl of pre-warmed distilled water at 80 °C for 2 min, then immediately place on the magnet and collect into a new tube. The expected volume of the product is 13 μl, with which the following experiments may only be performed twice at most.RNA-seq library preparation and sequencingMix 5 μl of purified mRNA obtained in the above section with 4 μl of 5× Super Script IV buffer (Invitrogen) and 1 μl of frozen stock of 100 mM DTT (Invitrogen).mRNA is fragmented by incubating at 94 °C for 4.5 min and then immediately cooled down on ice.Then add 0.6 μl of 100 μM random primer (N)6 (TaKaRa) and 0.9 μl of distilled water to the fragmented mRNA. The volume of the mix is 12 μl.Incubate the mixture at 50 °C for 5 min and immediately chill on ice to relax the secondary structures of the mRNA.Add the reverse transcription master mix (1 μl of frozen stock of 100 mM DTT, 0.4 μl of dNTP (25 mM each) (Promega); 0.1 μl of SuperScript IV (Invitrogen); 0.2 μl of Actinomycin D (1,000 ng/μl) (Nacalai Tesque); and 5.9 μl of distilled water). Now the volume of the mix is 20 μl.For the reverse transcription step, incubate the mixture at 25 °C for 10 min, followed by 10 min at 50 °C. Inactivate SuperScript IV by heating the mixture at 80 °C for 15 min. Then add 24 μl of AMPure XP (Beckman Coulter) and 12 μl of 99.5% EtOH, and perform the purification step according to the manufacturer’s manual.The detail of purification with AMPure XP beads in this protocol is as below:Mix by pipetting.Room temperature, 5 min.Put on magnet, 5 min, remove supernatant.Add 70 µl of 70% EtOH on the magnet stand and remove it. Repeat this step again.",
    "Dry up for 1 min.Add 10.0 µl or other Nuclease free water, mix by pipetting.R.T. for 1 min.Put on magnet, collect 10.0 µl or other of supernatant to 384-well PCR plate.Elute the transcription product with 10 μl of distilled water. Mix the purified DNA/RNA hybrid solution without beads with the second strand synthesis master mix [2 μl of 10× Blue Buffer (Enzymatics), 1 μl of dUTP/NTP mix (Fermentas), 0.5 μl of frozen stock of 100 mM DTT, 0.5 μl of RNase H (Enzymatics), 1 μl of DNA polymerase I (Enzymatics), and 5 μl of distilled water] The final volume of the mixture is 20 μl.Incubate the mixture at 16 °C for 4 h. Purify dsDNA with 24 μl of AMPure XP according to the manufacturer’s manual. Elute the purified dsDNA with 10 μl of distilled water. Use 5 μl of the dsDNA solution for the following step.Perform end-repair, A-tailing and adapter ligation using a KAPA Hyper Prep kit (KAPA Biosystems) with 1/10× volume of the solutions according to the manufacturer’s manual. Use 1 μl of 0.1 μM Y-shape adapter (Recipe 3, Nagano et al., 2015) in the adapter ligation step and incubate for 15 min at 20 °C. The final volume of this reaction product is 11 μl.Perform size selection of the ligation product with 5.5 μl of AMPure XP, resulting in 0.32× AMPure XP. The first size-selection is conducted at the smaller ratio than the second due to strong viscosity of ligation reaction mix. Elute the purified dsDNA using 10 μl of distilled water. Carry out the second round of size selection with 10 μl of AMPure XP, resulting in 0.5× AMPure XP. Elute the size-selected ligation product with 15 μl of 10 mM Tris-HCl, pH 8.0.",
    "Add 1 μl of uracil DNA glycosylase (UDG) (Enzymatics) to the size-selected ligation product. The volume of the mix is 16 μl.Incubate the mixture at 37 °C for 30 min to exclude the second-strand DNA.For library amplification, mix 2 μl of the UDG-digested DNA with 1 μl of 2.5 μM index primer (CAAGCAGAAGACGGCATACGAGATXXXXXXXXGTGACTGGAGTTCAGACGTGT, XXXXXXXX indicates index sequence in the supplemental file[href=https://os.bio-protocol.org/attached/file/20200507/3496 Supplemetal file.docx]) (Nagano et al., 2015), 1 μl of 10 μM universal primer (AATGATACGGCGACCACCGAGATCTACACTCTTTCCCTACACGACGCTCTTCCGATCT) (Nagano et al., 2015), 0.5 μl of distilled water and 5 μl of KAPA HiFi HotStart ReadyMix (2×) (KAPA Biosystems). The volume of the mix is 10 μl.Amplify DNA fragments with the adapters and an index sequence using a thermal cycler with the following program: denature at 94 °C for 2 min, 18 cycles at 98 °C for 10 s, 65 °C for 30 s, 72 °C for 30 s as an amplification step, and 72 °C for 5 min for the final extension. Then perform two rounds of size selection to remove adapter dimer with an equal volume of AMPure XP to the library solution with 10 µl of D.W. for elution. Next elute the purified library with 10 μl of distilled water. Now, you can pool the libraries, if needed. Also use library quantification kit (e.g., KAPA Library Quantification Kit Illumina (KAPA Biosystems)) to determine the concentration followed by pooling.Take out 1 μl of the purified library for electrophoresis using an Agilent High Sensitivity DNA kit (Agilent Technologies) to evaluate quality. The typical concentration of the library is more than 1 ng/µl, and the size distribution is shown below (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200617/20200617225305_0501.jpgFigure 2. The typical size distribution of the final product of this protocol. A result from electrophoresis produced with Agilent High Sensitivity DNA kit."
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Systems Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}