{
  "id": 17035,
  "origin_website": "Jove",
  "title": "Establishment of Coloproctitis Cancer Model in Mice and Evaluation of Therapeutic Effect of Chinese Medicine",
  "procedures": [
    "The animal procedure has been approved by the Ethics Committee of Changchun University of Chinese Medicine (Record number: 2021214). Specific pathogen-free C57BL/6J mice (8-10 weeks, weight 18-22 g), male and female, were housed in independently ventilated cages at 22 °C and 65% relative humidity. The mice began the experiment after 7 d of adaptive feeding, during which they had free access to water and diet.\n1. Drug preparation\nPreparation of LJZD\n\t​NOTE: The Chinese medicine used was purchased from the Affiliated Hospital of Changchun University of Chinese Medicine and was identified as genuine Chinese medicine (see Table 1).\n\t\nPut Dangshen (12 g), Baizhu (12 g), Gancao (6 g), Chenpi (12 g), Jiangbanxia (9 g) into a specialized ceramic pot (see Table of Materials). Add 1000 mL of distilled water and soak at room temperature for 1 h (see Figure 1A).\nPowder 12 g Fuling into fine powder with a grinder and soak in 300 mL of distilled water in another container for 1 h at room temperature.\nMix the above Chinese medicine in the specialized ceramic pot. Boil the mixture and then keep on medium flame until only 300 mL of decoction remains. Use medical gauze for filtering and preserve the filtrate at room temperature.\nAdd 1000 mL of distilled water and repeat the above decoction operation once more.Filter again using medical gauze. Combine the filtrate and boil it until only 150 mL remains.\nCentrifuge the concentrated liquid at 10,000 x g for 5 min, and further concentrate the obtained supernatant to 30 mL on medium heat. Transfer the final concentrate to a dish and dry it using an electric drying oven until only the solute remains as a powder.",
    "Weigh the above solid and dissolve it in sterile distilled water to obtain a solution containing 22.85 mg of drug per 0.2 mL (114.16 mg/mL), which is the daily dosage of mice.\nPreparation of 5-amino salicylic acid\n\t​NOTE: 5-amino salicylic acid (5-ASA; see Table of Materials) has a good preventive effect on UC-CRC, and it was used as a positive drug in this study23.\n\t\nDissolve 64 mg 5-ASA powder in 200 mL of sterile distilled water to obtain 1.82 mg/mL 5-ASA solution. The daily dosage for a single mouse was 0.2 mL.\nPreparation of AOM injection solution\n\t\nAdd 2.5 mL of sterile distilled water into 25 mg AOM powder (see Table of Materials), and mix by vortex mixer (see Table of Materials) to make 10 mg/mL AOM stock solution, store at -20 °C until use.\nPrepare the AOM injection solution by diluting the AOM stock solution with sterile distilled water at 10:1 (1 mg/mL).\n2. Establishment of UC-CRC model\nNOTE: The experiment was divided into 4 groups: control, model, LJZD, and 5-ASA group, 10 mice in each group. Except the control group, the other groups were treated with AOM and DSS.\nIntraperitoneal injection of AOM injection solution\n\tNOTE: After adaptive feeding for 7 d, mice were given AOM injection solution (1 mg/mL) by intraperitoneal injection (see Figure 1B).\n\t\nHold the mouse with its belly up and head slightly down. Grip the back skin to tighten the abdominal skin and pierce the skin approximately 1 cm to the right of the intersection of the root line of both thighs on the mid-abdomen line with a 1 mL syringe (see Table of Materials).",
    "Push the 1 mL syringe needle to a distance of 3-5 mm under the skin, keeping it parallel to the abdominal midline, and insert the needle 0.3-0.5 mm into the abdominal cavity at a 45°.\nAfter the tip passes through the abdominal muscle, the operator senses a sudden loss of resistance. Subsequently, pull the syringe outward and backward to observe whether liquid seepage occurs. If not, push the AOM injection solution slowly into the mice at 0.1 mL/10 g.\nCyclic stimulation of 2% DSS solution\n\t​NOTE: Each AOM-induced mouse was given 500 mL of DSS solution at weeks 3, 6, and 9, and the mice drank freely during this period.\n\t\nPrepare 2% DSS solution by adding 500 mL of sterile distilled water to 10 g DSS (see Table of Materials). Mix with a vortex mixer and store at 4 °C until use.\nEach AOM-induced mouse drinks 500 mL of 2% DSS solution freely for 7 d on weeks 3, 6, and 9 after AOM induction.\n3. Drug treatment\nNOTE: Adult humans need 63 g LJZD per day. According to the conversion formula of experimental mouse and human drug dose, equivalent experimental dose for mice (mg/kg) = human dose (mg/kg)/body weight (60 kg) x 9.1, the daily dose of mice was about 9.6 g/kg.\nTreat the LJZD and 5-ASA group with 0.1 mL/10 g of the prepared LJZD and 5-ASA solution by gastric gavage at week 7 and week 15, respectively.",
    "For intragastric administration in mice, perform the following procedure. Hold the mouse in the left hand, and in the right hand, hold the stomach perfusion apparatus. Insert the syringe needle in the mouth and slide it down the back wall of the pharynx of the mice. Slide down the pharynx as the mice swallow and continue to move ahead. When there was a sense of resistance, and the syringe could be pushed into the pharynx, pull the needle out and complete the injection.\nTreat the control and model group with the same amount of saline (see Table of Materials).\nTreat the mice in each group with appropriate drug once a day at the same time during the administration period.\n4. Evaluation of UC-CRC model and efficacy of LJZD\nDisease activity index score\n\tNOTE: According to Table 2, the disease activity index (DAI) score was evaluated by combining weight loss, fecal viscosity, and stool bleeding of the mice.\n\t\nRecord the weight of the mice daily from the beginning of adaptive feeding until the end of drug treatment.\nObserve the fecal consistency of each experimental mouse carefully and record the bowel movements as one of the three conditions: normal, loose stools, and watery diarrhea.\nRecord the fecal bleeding of experimental animals as one of the three conditions: no bleeding, little bleeding, and visible blood in stool.\nDetection of IL-6 level in serum\n\t\nTreat mice with LJZD or 5-ASA for 9 weeks. Fix the mice by grasping the neck skin of the mouse with the left hand and gently pressing on the experimental table to take the lateral decubitus position. Cut off the whiskers of the mice with scissors. Cut off the whiskers of the mice with scissors carefully(see Table of Materials) to prevent blood contamination.",
    "NOTE: Mice that could not wiggle freely were considered to be properly fixed. If this does not happen, the mice should be fixed.\nSterilize the skin around the eyeball with ethanol (see Table of Materials). Press the eye skin on the side gently to make the eyeball congested and protruding.\nClamp the eyeball with an elbow tweezer and remove the eyeballs accurately and quickly. Allow the blood to drip into the centrifugal tube (see Table of Materials). In the process, tap the mouse's heart to speed up blood collection.\nKeep the collected blood at room temperature for 30 min and centrifuge it at 3,500 x g for 10 min. Collect the supernatant and detect the IL-6 level according to the IL-6 content detection kit instructions (see Table of Materials).\nSeparating colorectal tissue\n\t\nEuthanize the mice after blood sampling by inhaling 5% overdosed isoflurane and cervical dislocation (see Table of Materials) in accordance with animal ethics.\nKeep the mice in a cryogenic anatomical environment. Immobilize the mice in a supine position. Cut the lower abdomen hair with scissors and sterilize it with ethanol.\nPinch the intersection point between the two thigh roots and the abdominal midline with eyelid forceps (see Table of Materials). Cut a transverse incision about 1-1.5 cm with scissors.\nClip a longitudinal incision along the median line of the abdomen from the midpoint of the transverse incision towards the xiphoid process.\nRemove the peri-colorectal tissues in the direction of the anus to separate the colorectum from the surrounding tissue. Be careful not to damage the colorectum.",
    "Push the skin of the abdomen to the sides to fully expose the colorectum. Remove the colorectum from the abdominal cavity with eyelid forceps and cut off the segments from the anus to the cecum (excluding); the total length is about 10 cm. Store the obtained colorectal tissues in saline at 4 °C.\nEvaluation of the length and weight of the rectum\n\t\nExtract the saline at 4 °C with a 5 mL needle (see Table of Materials) to flush the inside of the colorectum. Then, place the colorectum on absorbent paper to absorb the moisture of the tissue.\nWeigh the colorectal tissues and then place them on A4 paper to measure their length.\nMeasure the number of tumors in the colorectum\n\t\nCut the colorectum lengthwise to fully unfold it and observe the number and size of the tumors in the colorectum.\nPathological analysis of the colorectum\n\t\nFix the colorectum in 4% paraformaldehyde for 24 h. Embed the fixed rectal tissue in melted paraffin and section continuously with a thickness of 5 µm by a tissue freezing microtome.\nAccording to the procedure of Hou et al.24, dewax the sections in xylene and then dehydrate it with serial concentrations of ethanol. After staining with hematoxylin solution for 5 min, rinse the sections with pure water. After that, stain with 0.5% eosin solution for 1 min(see Table of Materials).\nPerform gradient dehydration and xylene transparent treatment again. Seal the sections and observe them under the optical microscope (see Table of Materials) and photograph, as described by Xie et al.25.\nImmunohistochemical analysis of colorectum\n\t\nDewax and dehydrate the sections according to the above method. Repair the antigen in the sections with high-pressure thermal repair technique, as described by Gok et al.26.",
    "Soak the sections in endogenous peroxidase blockers at room temperature for 15 min. Seal the sections with goat serum (see Table of Materials).\nAdd the primary antibody ZO-1 (1:1000), Occludin (1:1000) and KI67 (1:500; see Table of Materials) to the sections and incubate overnight at 4 °C. Rinse the sections with PBS buffer (see Table of Materials), add general purpose secondary antibody (1:5000; see Table of Materials) to it and incubate at 37 °C for 30 min.\nAdd the DAB solution (see Table of Materials) to the sections for color development. Counterstain the sections with hematoxylin solution.\nDehydrate, transparentize, and seal the sections again. Observe the expression of protein by the optical microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}