{
  "id": 6930,
  "origin_website": "Bio",
  "title": "Mapping mRNA-18S rRNA Contacts Within Translation Initation Complex by Means of Reverse Transcriptase Termination Sites and RNAseq",
  "procedures": [
    "Preparation of mRNA containing 4-thio-UTP (4sU-mRNA) by in vitro transcriptionWe synthesized a 128-nt mRNA containing minimal secondary structure bearing a short (19 nt) 5′ UTR an 3' polyadenylated. Photoactivatable 4-thio-UTP can be incorporated at positions +2 (the A of AUG is denoted as +1), +24, +27, +31 or +34 of mRNA. We use 4-thio-UTP at a four-fold higher concentration than UTP to ensure that every mRNA molecule is labeled with a least one 4-thio-UTP (Figure 1A).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200814/20200814073750_4697.jpgFigure 1. Overview of the protocol for the identification of mRNA:18S rRNA contacts within 48S complex assembled in vitro. A. Schematic diagram of the mRNA used to assemble translation initiation complex (48S-PIC) in RRL. The positions in the mRNA labeled with 4-thio-U are numbered respect to the AUGi. B. Overview of the experimental method to identify mRNA-18S rRNA contacts by specific crosslinking of 4-thio-U, followed by reverse transcriptase termination site (RTTS) assay and next-generation sequencing (NGS).DNA template preparationMix primers Flat_fw and U_rev polyA at 1 μM final concentration in 50 μl of 1x Supreme green master mix and incubate at 95 °C for 5 min, followed by 1 min at 45 °C and 10 min at 72 °C.Then, use 2 μl of this mixture to program a PCR amplification with T7_U_fw and U_rev polyA primers (both at 0.5 μM final concentration) in 50 μl 1x Supreme green master mix (30 cycles, 95 °C 2 min, 45 °C 2 min, 72 °C 45 s, final extension of 72 °C 10 min).Use a 2 μl sample to check the size of the PCR product (about 200 nt) by electrophoresis in 1.5% agarose gel in TAE 1x buffer.Then, purify the PCR fragment with DNA clean & Concentrator-25 columns, that typically yields 25 μl at 0.3-0.5 μg/μl.",
    "mRNA synthesis and purificationProgram an in vitro transcription using the HighScribe T7 polymerase kit in the presence of 4-thio-UTP.Mix the following components in a final volume of 20 μl:2 μl of 10x Reaction buffer1 μl of ATP/CTP/GTP 20mM each (1 mM final concentration)1 μl UTP 5 mM (0.25 mM final concentration)1 μl 4-thio-UTP 20 mM (1 mM final concentration)0.5 μl RNasin® Plus RNase Inhibitor1 μg DNA template2 μl T7 RNApolBring to 20 μl with H2O and incubate in the dark for 2-3 h at 37 °C.Digest the DNA template with 1 μl of DNase I (1U/ μl) for 15 min at 37 °C. Then, bring the final volume of the mixture to 40 μl with H2O.Then load the mixture in a prepacked chromaspin-30 column and centrifuge at 700 x g for 5 min in a benchtop centrifuge at room temperature.Recover the elute and use 1 μl to measure the concentration of the RNA in a NanoDrop spectrophotometer (typically 0.2-0.5 μg/μl). Store the mRNA at -70 °C. Assembly of translation initiation complex (48S-PIC) in rabbit reticulocyte lysate (RRL) and UV crosslinkingProgram two 100 μl translation mixtures with 4sU-mRNA in the presence of non hydrolyzable GMP-PNP to promote the accumulation of 48S preinitiation complex (PIC) (Figure 1). One of the samples will not receive irradiation (control).48S-PIC assemblyMix the following components per duplicate:70 μl of RRL (70% of final volume)16 μl of H2O2 μl aminoacid mix (1 mM)8 μl of magnesium acetate 20 mM (2.5 mM final concentration)2 μl of GMP-PNP 100 mM (2 mM final concentration)2 μl of RNase inhibitorPre-incubate 5 min at 30 °C and then add 0.5 μg of 4sU-mRNA.Mix gently and incubate another 25 min at 30 °C.Place the tube on ice to stop the reaction.UV crosslinking.",
    "Cut a piece of parafilm and place it between two metal blocks with the plastic cover facing up.Fix the assembly carefully with elastic rubber bands and precool for at least 2 h at -20 °C.Carefully remove the upper block and the plastic cover, and place the bottom block with the parafilm on an ice box as indicated below (Figure 2):imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200814/20200814073900_7525.jpgFigure 2. UV lamp assembly on sample for crosslinking. Sample (red dot) is placed on parafilm for UV irradiation as indicated. Up to six samples can be irradiated simultaneously.Using a P200 pipet, place one of the samples on the parafilm and extend it with the tip to form a 2 cm diameter smear.Place the lamp holder on the box so that UV lamps are 3 cm away from the sample and irradiate 20 min.Let the other sample on ice (not irradiated control).Poly (A) mRNA isolation from whole ribosomal pelletTransfer both the irradiated and not irradiated samples (100 μl) to new Eppendorf tubes on ice and slowly add 800 μl of polysome buffer (Recipe 1)Mix well and carefully place the mix (850-900 μl) on sucrose cushion made in a 1 ml ultracentrifuge tube (100 μl 20% sucrose solution in polysome buffer).Place the tubes in a TLA 100.2 rotor and centrifuge at 250,000 x g for 3 h at 4 °C. At this step, the ribosomal pellet resembles a translucent lentil.Remove the supernatant with a P1000 pipette and gently wash the ribosomal pellet with 200 μl of TE buffer for 3-5 s avoiding touching the pellet with the tip.Repeat washing twice more. Add 500 μl of Lysis-Binding Buffer (Recipe 6) and let pellet dissolve for 15 min at room temperature.Save a 30 μl aliquot from the not irradiated sample to isolate total RNA (see below).",
    "To the rest, add 200 μl of oligo d(T)25 magnetic beads (0.25 ml of 5 mg/ml suspension) previously equilibrated in 500 μl Lysis/Binding Buffer for 5 min.Incubate at room temperature for 15 min in a rotating carousel at 30 rpm.Place the tube into magnetic rack and pull magnetic beads to the side of the tube.Then remove and discard the supernatant and add 0.5 ml of Wash Buffer 1 (Recipe 7) to the beads.Mix with rotation for 1 min (as describe in Step C8) and capture the beads as described above.Repeat washing once more with Wash Buffer 1, twice with Wash Buffer 2 (Recipe 8) and once with Low Salt Buffer (Recipe 9).Finally, add 100 μl of H2O to the beads and heat at 50 °C for 2 min in a thermomixer to elute the RNA.Measure the concentration in a NanoDrop (typically 50-100 ng/μl) and store at -70 °C.Total RNA extractionTo extract total RNA, bring the 30 μl aliquot saved before (Step C6) to 200 μl with H2O.Then, add 200 μl of phenol:chloroform:isoamyl alcohol and vortex vigorously for 1 min.Let the tube stand for 5 min and repeat the vortexing three more times.Centrifuge at maximum speed for 5 min in a minifuge at room temperature and transfer the upper phase to a new tube avoiding touching the interphase.Finally, precipitate the RNA with 2 volumes of 100 % ethanol and 0.2 M of sodium acetate pH 5.2 (final concentration) at -20 °C O/N.Centrifuge at maximum speed for 15 min in a minifuge at 4 °C and wash the pellet with 0.5 ml 70% ethanol.Repeat the centrifugation at room temperature, remove the ethanol and let the pellet dry 5 min on the bench.Then, dissolve the pellet in 20 μl of H2O and store at -70 °C.",
    "Retrotranscription of 18S rRNAUse irradiated, not irradiated and total RNA samples for retrotranscription with primer 18S_rev (targeting 18S rRNA) following the manufacturer specifications:Mix 0.5 μg of RNA samples (typically 5-10 μl) with 0.5 μM of 18S_rev and 1 μl of 10 mM dNTPs in a final volume of 10 μl.Denature the RNA by heating at 65 °C for 5 min and then place the tubes on ice for 1 min.Prepare the SuperScript III cDNA synthesis mix (Recipe 4) and add 10 μl to the RNA samples.Incubate 50 min at 50 °C and then terminate the reaction by heating at 85 °C for 10 min. Spin down the tubes briefly and keep them on ice.Then add 1 μl of RNase H to the tubes and incubate 20 min at 37 °C to degrade the RNA.Purify the cDNA using the AMPURE XP magnetic beads following the manufacturer´s recommendation, but using two-fold more beads to keep smaller fragments https://www.beckmancoulter.com/wsrportal/techdocs?docname=B37419[href=https://www.beckmancoulter.com/wsrportal/techdocs?docname=B37419].Elute the samples in 15 μl of H2O.Adapter ligation and first PCR amplificationAdapter ligation to the 3′ OH of cDNA and circularization is carried out with Circligase in a final volume of 20 μl, containing 10 μl of purified cDNA, 2.5 μM of adapter_ligation primer and 10 μl of Circligase enzyme mix (Recipe 5).Incubate the samples 2 h at 60 °C, then 1 h at 68 °C and 10 min at 80 °C.Let the samples on ice for at least 2 min.Perform the first PCR amplification using Phusion DNA polymerase in a final volume of 10 μl using the PR_fwd and 18S adapter primers (0.5 μM) and 5x Phusion HF buffer.To optimize the amplification, try three different volumes of the ligated cDNA mix described above (0.5, 1 and 2 μl).",
    "Program the PCR using the following parameters:3 min initial denaturation at 95 °C, followed by 30 cycles of 15 s at 95 °C, 15 s at 50 °C and 20 s at 72 °C with a final extension of 10 min at 72 °C.Run a 2 μl aliquot of each sample in an 1% agarose-TAE gel to check the amplification sizes (bands between 100-950 nt are expected).Second PCR amplification with index primersUse 3 μl of the first PCR amplification to program a second PCR amplification with PR_fwd and INDEX primers (0.5 μM final concentration). Use a different index primer for each sample (three in this case).Perform a PCR amplification using the same parameters as described above but reduce the number of cycles to 10.Then, bring the samples to 40 μl with H2O and purify the PCR fragments with AMPURE XP beads following the manufacturer specifications.Elute the samples in 20 μl H2O and check them in a Bioanalyzer.A distribution of peaks in the range of 100-950 nt is expected (see Figure 3A). In some samples a strong peak of around 150 nt is observed, that presumably corresponds to adapter dimers. In this case, perform a size fractionation of the sample in a 1% agarose-TAE gel by cutting the piece of gel above the 150 nt marker. Extract the DNA from agarose piece by using QIAquick gel extraction kit.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200814/20200814073930_8651.jpgFigure 3. An example of the results obtained. A. A typical picture of agarose gel electrophoresis showing final PCR libraries obtained from RNA total and oligo d(T) captured (right panel). Left panel shows the electropherogram corresponding to oligo d(T) captured sample from above. The sample was analyzed in a bioanalyzer and the range of DNA peaks obtained is indicated by a blue bracket. Size markers are also shown (M). B.",
    "A typical histogram of 5′ reverse transcription (RT) arrests on 18S rRNA after crosslinking of mRNA assembled into the 48S-PIC. Total or oligo(dT)-purified RNA was subjected to reverse transcriptase termination site (RTTS) assay of 18S rRNA. Some arrests enriched in oligo(dT)-purified RNA are indicated by green arrows. A strong RT arrest at C726 was frequently observed in total RNA, presumably due to fragmentation of 18S rRNA during the purification process.SequencingMix the resulting indexed libraries (three in this case) by adjusting to the sample of lower concentration to get a similar representation of each library in the mix. Send samples for sequencing in a NextSeq550 platform, 1x75 reads. The typical output was 0.5Mreads/sample."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}