{
  "id": 15295,
  "origin_website": "Jove",
  "title": "Laser Microirradiation to Study In Vivo Cellular Responses to Simple and Complex DNA Damage",
  "procedures": [
    "1. Basic Cell Preparation\nNote: This step is for standard immunofluorescence detection of the endogenous protein recruitment or modification, and for the use of a cell line stably expressing a fluorescently tagged recombinant protein. For example, Potorustridactylus (PtK2) marsupial kidney epithelial cells stably expressing EGFP-53BP11220-1711 or TRF2-YFP were used in our previous study (Figure 1)32. In the former case, the focus forming region of 53BP1 (amino acid 1220-1711) that contains the oligomerization domain, the Tudor domain, and the ubiquitylation-dependent recruitment (UDR) motif, was fused to enhanced GFP (EGFP-53BP11220-1711). This fusion protein recapitulates the damage site recruitment of the full-length 53BP153,54,55. In HeLa cells, fluorescently tagged subunits of cohesin (e.g., hSMC1-GFP51, GFP-Scc1 (Rad21)52, and GFP-SA2 51) must be stably expressed to ensure efficient incorporation into the complex and to recapitulate the S/G2 cell cycle phase-specific damage site recruitment of the endogenous cohesin51.\nSeed any adherent cell type onto a 35 mm tissue culture dish with a gridded coverslip to allow for individual cell identification. Adjust the initial cell number to achieve 60% confluency in 36-48 h based on the proliferation rate of the particular cell line. For example:\nFor PtK2 marsupial kidney epithelial cells (either wild type or those stably expressing EGFP-53BP11220-1711 or TRF2-YFP): plate 2.0 x 104 cells in 2 mL Advanced Minimum Essential Medium (MEM) supplemented with 2 mM L-Glutamine, 4% fetal bovine serum (FBS), and antibiotics (100 U/mL penicillin and 100 µg/mL streptomycin), and incubate at 37 °C with 7% CO2.",
    "For HeLa cells with stably expressing fluorescently tagged recombinant proteins GFP-SA2: seed 1.0 x 105 cells in 2 mL Dulbecco's Modified Eagle's Medium (DMEM) supplemented with 10% FBS, 2 mM L-Glutamine, 100 U/mL penicillin, and 100 µg/mL streptomycin, and incubate at 37 °C with 5% CO2. Other HeLa cells may also be used including unmodified cells or cells expressing hSMC1-GFP.\nAllow cells to adhere and proliferate for 36-48 h before DNA damage induction at 30-60% confluence (to allow visualization of the grid number). Proceed to Section 4.\n2. Transient Transfection\nNote: Sometimes good antibodies are not available to detect the endogenous proteins. If cell lines stably expressing marker proteins are not available, carry out transient transfections to monitor fluorescently labeled proteins for live cell analyses.\nFor HeLa cells, on day 1, seed 6-8 x 104 cells in 0.5 mL culture media in one well of a 24-well plate and incubate in a 100% humidified incubator at 37 °C and with 5% CO2. See step 1.1 for culture media conditions.\nDay 2, use a mammalian expression plasmid encoding a fluorescently tagged DNA repair factor (e.g., GFP-NTH1 or GFP-OGG1 for base damage32,44,56, GFP-Ku for high dose DSBs57, GFP-53BP132 for relatively simple DSBs, or other proteins of interest fused to fluorescent tag) to perform liposome-mediated DNA transfection. Dilute 0.3 µg plasmid DNA into 25 µL of serum-free culture media in a 1.5 mL tube.\nIn another 1.5 mL tube, dilute 1 µL liposome-based DNA transfection reagent into 25 µL of serum-free culture media and mix gently.\nMix the diluted DNA and transfection agent gently, and incubate for 10 min at room temperature (RT) to form DNA-lipid complexes.\nRinse cells with 0.5 mL culture media once, remove the media, and add 0.5 mL fresh culture media to the cells (as in step 1.1).",
    "Add the DNA-lipid complexes to the cells. Mix gently by rocking the plate a few times. Put the cells back in the incubator as in step 2.1.\nAfter 4-6 h, remove the culture media from the cells, and add 300 µL 0.05% Trypsin-EDTA. Remove it, add 200 µL Trypsin-EDTA, and incubate in the 37 °C incubator for 3-4 min.\nAfter confirming that the cells are detached, add 800 µL culture media and resuspend the cells by gently pipetting to break up the cell clumps. Transfer the cell suspension to a 35 mm culture dish with a gridded coverslip, and add culture media to a final volume of 2 mL.\nIncubate cells in the incubator as in step 2.1 for 48 h, then proceed to Section 4.\n\tNote: If the expression of the recombinant protein is toxic (transfected cells show round or irregular morphology after incubation in step 2.8), shorten the expression time, and perform laser microirradiation (Section 4) at 16-20 h after transfection as long as the protein expression can be confirmed (for fluorescence detection, see step 4.3). In this case, perform transfection directly in the 35 mm dish. Seed 3.0 x 105 HeLa cells in a 35 mm dish with a gridded coverslip to achieve approximately 50-70% confluence after 30 h. Transfect DNA plasmids, and change media 2-6 h after transfection. Proceed with laser microirradiation 12-20 h later if protein expression is reasonable and cells appear healthy.\n3. Cell Cycle Synchronization\nNote: For homologous recombination repair (HR) proteins, such as Rad51 and cohesin, the recruitment is more prominent in S/G2 phase of the cell cycle, in which HR repair takes place51. Thus, to monitor the recruitment of these proteins, cell synchronization to S/G2 phase is necessary.\nS/G2 phase synchronization",
    "Use the double thymidine block protocol for cell synchronization to S/G2 phase50,51. After seeding the cells in a 35 mm gridded coverslip dish (see step 1.1), incubate the cells with thymidine (to a final concentration of 2.5 mM) in culture media (as in step 1.1) for 17 h at 37 °C and with 5% CO2.\nRinse the cells with 1 mL thymidine-free culture media (as in step 1.1) twice, and incubate the cells in 2 mL thymidine-free culture media for 9 h as in step 1.1.\nAdd 200 µL of 27.5 mM thymidine stock solution (dissolved in culture media) into the culture media with the cells to a final concentration of 2.5 mM thymidine. Incubate the cells as in step 3.1.1 for another 15 h. Rinse and incubate the cells in thymidine-free culture media for 4-6 h and induce DNA damage (Section 4).\nConfirm synchronization efficiency by using cell cycle markers (Cyclin A2 and B1 for S/G2 and G2, respectively), S/G2 phase-specific DNA damage repair factors (e.g., Rad51 or cohesin), or by IdU/EdU incorporation (for S phase cells)51.\nG1 phase synchronization\nSeed 6-8 x 104 HeLa cells in a 35 mm culture dish with gridded coverslip (step 2.1).\nAfter 2 days, identify metaphase cells, which are slightly lifted and round-shaped, under an inverted microscope using 10X objective and 10X ocular lenses. Acquire images to record the position of metaphase cells on the gridded coverslip.\nAfter 3-4 h, confirm cell division into two daughter cells (in G1 phase), and induce DNA damage (Section 4).\n4. Titration of Laser Input Power",
    "Note: In this protocol, we induce DNA damage using a 780 nm pulsed fs NIR laser system attached to a confocal microscope, or an 800 nm pulsed fs NIR laser coupled to an inverted epi-fluorescence microscope. Although input power (actual irradiance at the laser focal point in the specimen) needed to induce comparable DDR is different in these systems, the basic principle of input power titration is applicable to both, or any, NIR systems32,57. The in situ energy per laser pulse and peak irradiance at the focal point for the two laser systems were in the range of 5.33 × 10-2-4 × 10-1 nJ and 7 × 1010-5.24 × 1011 W/cm2, respectively32.\nTurn on the NIR laser and allow the laser system to warm-up for 1 h before use.\nPlace a dish of cells on a heated (37 °C) stage in a chamber that allows CO2 (5%) and humidity (100%) control.\n\tNote: If a CO2 chamber is not available, use CO2-independent culture media for up to 5-6 h. If a heating stage is not available, keep the cells under the microscope for < 20 min and immediately replace into the tissue culture incubator with proper temperature, CO2, and humidity control. These culture conditions may vary depending on the specific cell type used as well as the organism of derivation (e.g., mammals versus amphibians).\nFor live cell analysis of fluorescently tagged proteins, select a GFP filter (450-490 nm excitation, 515-586 nm emission) or Cy3 filter (540-552 nm excitation, > 590 nm emission) for GFP or mCherry-fused protein, respectively, using a 100X or 63X oil immersion objective.\nSearch for cells that have comparable fluorescence signals, reflecting comparable levels of protein expression. Avoid cells that have too weak or too strong expression in order to reduce cell-to-cell variability in fluorescence measurements.",
    "Titrate the laser input power.\n780 nm NIR laser attached to a confocal microscope\n\t\t\nUse the software bleach function to target linear tracks inside the cell nucleus for exposure to single laser scans (resolution 512 x 512 pixels, zoom X1, bleached region 50 x 4 pixels, 12.8 µs pixel dwell time, iteration x1) through the oil objective (100X/1.3 NA).\nAdjust the laser transmission percentage (using the software/hardware built into the laser microscope system by the manufacturer) to 5% without changing any other settings.\nPlace a cell in the center of the field. Click the region of interest (ROI) tool, and draw a line or box (approximately 50 x 4 pixels) in the nucleus using the mouse, and click the \"Bleach\" button to induce DNA damage.\n\t\t\tNote: In subsequent irradiation steps, \"bleaching\" should be increased in 5% increments to 40% or up to 100% if necessary.\n800 nm NIR laser attached to epi-fluorescence microscope\nControl input power through a (63X/1.4 NA) phase contrast oil immersion objective by motorized rotation of a polarization filter introduced in the beam path and mounted on a computer-controlled motorized rotational stage32,39,58.\nAdjust the polarizer angle (°) and measure the input power (mW) entering the microscope, using a laser power meter. Determine the polarizer angles that provide input powers that range from 20 mW-155 mW at 5-10 mW increments.\nSet the polarizer angle that corresponds to 20 mW input power.\n\t\t\tNote: For our laser system, if the polarizer angle is 40 °, the input power is 65 mW. Increase input power with 5-10 mW increments.",
    "For live cell analysis, go to steps 6.1 and 6.3. For immunofluorescence detection of the endogenous proteins or modifications proceed to Section 5. After the analysis, go to step 4.7 for further titration of the laser power. To analyze the upstream factor requirement, go to Section 7.\n\tNote: Recruitment of BER and NHEJ factors is rapid (within a few minutes) and transient (< ~ 30 min-1 h depending on the factor and < ~4 h post damage induction, respectively). In contrast, the recruitment of HR factors Rad51 and cohesin is detectable at ~30 min-1 h and they tend to persist more than 8 h at unrepaired DNA lesions44,50,51. Thus, it is necessary to examine different time points post irradiation for different repair factors.\nIncrease input power by desired increments (i.e., 5% for 780 NIR laser and 5-10 mW for 800 NIR) as in step 4.4, and repeat steps 4.5-4.7 on a new set of cells to determine the threshold (50% of damaged cells show recruitment) and peak (100% of cells show recruitment) for each protein.\n5. Immunofluorescence Staining\nNote: For detection of covalent protein modification, such as PAR (complex damage marker) and H2AX phosphorylation (γH2AX) (DSB marker), as well as cyclobutane pyrimidine dimer (CPD)/(6-4) photoproducts (6-4PP) and 8-oxoguanine (8-oxoG) (crosslinking and base damage markers, respectively), cells must be fixed and stained with specific antibodies. In addition, it is best to confirm the results obtained with the fluorescently tagged recombinant proteins by antibody detection of the endogenous proteins, to distinguish artifacts induced by overexpression of recombinant fusion proteins.\nFix cells at different time points after damage induction (step 4.5) depending on the factors by replacing the culture media (see step 1.1) with 1.5 mL of 4% paraformaldehyde/1X PBS for 10 min at RT.",
    "Caution: Paraformaldehyde fumes are toxic and all work should be done in a ventilated fume hood.\nRemove 4% paraformaldehyde/PBS and add 1 mL of 0.5% detergent/PBS for 10 min at RT.\nRemove 0.5% detergent/PBS and rinse cells with 2 mL of PBS for 5 min twice, and incubate cells in 2 mL of blocking solution (10% calf serum, 1% BSA/PBS) for 1 h at RT.\nRemove blocking solution and add 2 mL of PBS to cells, and replace PBS with 250 µL primary antibody solution of 3% BSA/PBS overnight at 4 °C or 1 h at RT. Use a 1:200-1:500 dilution (typical concentration approximately 1 µg/mL, empirically determined) for antibodies specific for different DNA damage markers (e.g., γH2AX/53BP1 (DSB); Ku (DSB, NHEJ); Rad51/cohesin (DSB, HR); CPD/6-4PP (crosslinking damage); 8-oxoG/DNA glycosylases (e.g., NTH1) (base damage); PAR (high dose complex damage)).\nRemove the antibody solution and rinse with 2 mL of PBS for 5 min twice, remove PBS, and incubate with 250 µL 0.1% secondary antibody in 3% BSA/PBS for 1 h in the dark at RT.\nRemove the secondary antibody solution and add 2 mL of PBS for 5 min twice and keep cells in 1.5-2 mL PBS at 4 °C for imaging in steps 6.1 and 6.2.\n6. Quantitative Fluorescence Analysis of Immunostained or Live Cells\nCapture images of stained or live cells (n >10) using microscope used for irradiation. For the epi-fluorescence microscope system, use the resolution of 1,344 x 1,024 pixels and save images as TIFF 16-bit files. For a confocal microscope, use 1X magnification; Argon laser for GFP/FITC, HeNe 594 laser for Cy3/mCherry; 512 x 512 or 1,024 x 1,024 pixels for image resolution; scan speed 5, number: 1 for quick scan or 2+ for averaging over multiple scans to improve signal to noise ratio.",
    "Use an image analysis programs designed to measure pixel intensity.\nUse the Volume Rectangle Tool to draw a ROI around the damage site in the individual cell image. Use the same size ROI to measure the background fluorescence signal in the nucleoplasm adjacent to, but not overlapping with the damage sites. This is important for normalization of photobleaching associated with the non-confocal microscope system.\nTo measure fluorescence signals using the image analysis program, click \"Volume Analysis Report\" found in the tool box. A new window will appear. Under the \"Data to Display\" section, check only the \"Name\" and \"Density\" boxes. Then click \"Done\" to visualize the measurements.\nExport the values to a spreadsheet program by clicking on the table icon found at the bottom of the Volume Report window and select \"Tabs (excel format)\" for Field Separators and \"File\" for Export Destination.\nTo obtain relative signals, use the spreadsheet program to divide the fluorescence intensity at the damage site (column 1) by that in the control background region (column 2) in the nucleoplasm and subtract by 1 for normalization.\nReal-time quantitative fluorescence time-course analysis using the confocal microscope\nIdentify fluorescently tagged protein-positive cells using the microscope as in step 4.3.\nPerform time-lapse fluorescence imaging before damage and at different time points after damage induction in Section 4. First draw the bleach ROI (for damage induction), then select the \"Acquire>Time Series\" submenu, set \"Number\" as 20, and the \" cycle delay\" as 30 s, choose \"bleach once after first scan\", and then clicking \"start B\". In this case, the first image is acquired immediately before damage induction, followed by 19 image acquisitions at a 30 s interval. Intervals (\"cycle delay\") can be changed depending on the purpose of the study.",
    "Once image acquisition is complete, click \"Mean\", and draw the ROI at the damage region. Click \"Show Table\" to get a table listing the intensity within the selected ROIs. Normalize the data by dividing the fluorescence intensity of the damage site at different time points by the intensity of the same region before damage, and subtract by 1.\n7. Small Interfering RNA (siRNA) Transfection\nNote: Depletion of the target protein is an effective way to delineate the upstream factor requirement for the observed protein recruitment to damage sites (Section 4). Furthermore, the strategy is the best way to address the specificity of an antibody used for immunofluorescence detection (see Section 5).\nDay 1: Prepare 2 wells of HeLa cells in a 24-well plate by seeding 6-8 x 104 HeLa cells in 0.5 mL culture media in each well, one for control siRNA transfection and one for PARP1 siRNA (5'-CCG AGA AAT CTC TTA CCT CAA-3').\nDay 2: Confirm that cells are approximately 40-50% confluent. Perform the first round of siRNA transfection: Dilute 5 pmol siRNA into 25 µL of serum-free culture media, add 3 µL lipids based transfection reagent into the tube, mix gently, and incubate for 5-10 min at RT.\nRinse the cells with 0.5 mL fresh culture media once, and keep the cells in 0.5 mL fresh culture media (see step 1.1).\nAdd the RNA-lipid complexes to the cells, and mix gently by tilting the dish back and forth. Put the cells back in the incubator as in step 2.1.\nAspirate the transfection mix, and add 0.5 mL fresh culture media (step 1.1) after 6 h.\nDay 3: Perform the second round of siRNA transfections (see step 7.2). Then, seed 60-100% of the cells into a 35 mm gridded coverslip dish as described in step 2.3.",
    "Day 5: Proceed with laser microirradiation using the optimal laser power condition for maximum recruitment of the factor of interest, as determined by Section 4. Typically, efficient depletion can be observed in approximately 60-90% of HeLa cells.\n\tNote: As an alternative and complementary approach, inhibitors, if available, can be used to inhibit the function of the factor of interest32,44. For analyzing the effect of inhibiting DDR signaling, add 20 µM PARP inhibitor, 1 µM PAR glycohydrolase (PARG) inhibitor, or 10 µM DNA-dependent protein kinase with catalytic subunit (DNA-PKcs) inhibitor and 10 µM ATM inhibitor in dimethyl sulfoxide (DMSO) to the dishes 1 h prior to damage induction. Add DMSO only to control cells.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}