{
  "id": 9835,
  "origin_website": "Jove",
  "title": "Novel Apparatus and Method for Drug Reinforcement",
  "procedures": [
    "*=most important steps\nWell-handled male Sprague-Dawley rats are trained to lever press with food reward (45 mg sucrose pellets; Bio-Serv, Frenchtown, NJ).\n*Intravenous catheters are constructed out of stainless steel cannula (Plastics One, VA) and Silastic tubing.  Rats undergo a jugular catheterization surgical procedure to allow drug self-administration. Anesthesia consisted of a mixture of oxygen (0.8 l/min; Airgas Southwest, Corpus Christi, TX) and isoflurane (2.5-4%; AErrane, Baxter Healthcare, Deerfield, IL) delivered via a gas delivery system (VetEquip, Inc, Pleasanton, CA).  After surgery, catheter patency is maintained by daily flushing with 0.1 ml of a 0.9% saline, heparin and Timentin (antibiotic) solution. Gentamicin, a topical antibiotic, is applied to the skull cap and chest incision to prevent infection.  All surgical procedures followed the guidelines for sterile animal surgeries.  Surgery supplies were autoclaved and instruments were sterilized in a chemical solution and hot bead sterilizer.  Implanted catheters were flushed with methanol, water and air during preparation and then bathed in 70% ethanol solution on the day of surgery. Rats were prepared for surgery by shaving the head and chest area followed application of a betadine solution.  After surgery, rats were monitored for several hours before beginning returned to the animal colony.\nCocaine (NIDA Drug Inventory and Supply and Control Program; RTI International, Research Triangle Park, NC) used in this experiment was dissolved in isotonic saline solution (0.9%) in the appropriate dose concentrations according to animal weights. Cocaine solutions were then filtered through 0.2 um sterile syringe filters prior to daily use.",
    "*The apparatus is constructed out of two single-lever operant chambers (28 x 22 x 21 cm) equipped with house and stimulus lights and 3 sets of photobeams (Med Associates, St. Albans, VT). Chambers are joined together by a constructed Plexiglas alley (21 x 25 x 25 cm). The alley consists of two black walls with white stripes and two metal walls, a clear Plexiglas top, and a white Plexiglas floor. The two operant chambers have steel grid rod (4.8 mm) floors installed over removable metal cage bottoms. Sensory cues are placed within the operant chambers to create unique, distinguishable environments. The visual cues consist of either white or black felt material attached to the front and back walls and over the cage top. The olfactory cues are oil-based scents (rose or cinnamon) saturating a cotton ball located under the rod floor of the chamber.\nThe experimental procedure occurs over multiple days, starting with baseline preference tests (2 days), followed by drug self-administration sessions (8 or 16 days), and ending with a conditioned place preference (CPP) test (1 day).\n*During baseline preference and CPP test procedures, animals have access to both operant chambers. A video camera mounted above the apparatus records the rats' entrances and exits for each chamber. Photobeams within the chambers detect beam breakages that are used as an index of locomotor activity. During drug self-administration sessions, animals are restricted to a single operant chamber while lever response and locomotor activity (e.g., photobeam breakages) data are recorded with a Med Pentium 100 MHZ computer equipped with Med-PC software (Med Associates, Inc., St. Albans, Vermont).",
    "Baseline preference measurements are collected on two consecutive days. To begin, the rat is placed in the center alley with access to both operant chambers for a 20-min period. Immediately after placement in the chamber, the video camera, Med-PC software program and timer are simultaneously activated. The baseline preference data are assessed during viewings of the video recordings.\n*Drug self-administration sessions commence the day after the last baseline test. Sensory cues (e.g., white or black wall coverings and rose or cinnamon scents) and a panel to block off access to the Plexiglas center alley are placed into the chamber before the animal. To start the session, the animal is placed within the chamber while tubing from the mounted drug syringe is attached to the animal's catheter inlet. After closing the operant chamber door, the Med-PC program and timer is started and cocaine access is available for 1 hour. Each lever response results in the infusion of 0.1 ml of cocaine (0.75 mg/kg/inj) or saline solution. At the end of each self-administration session the rat is disconnected from the drug tubing, removed from the chamber and placed in the home cage.\nThe day after the last self-administration session, animals undergo a conditioned place preference (CPP) test. The procedure is the same as described for baseline measurements (see 7).\n*Data Assessment: An experimenter blind to group assignments determines the amount of time the animals spend in each compartment by viewing the videotape to assess entrances and exits between the compartments for a 15-min period (beginning 5 min after placement within the apparatus). The same procedure is used to determine baseline preference and CPP test scores.",
    "*Data Analyses: Differences between baseline measurements and post-conditioning CPP scores are used to determine drug-conditioning effects. Difference scores are calculated by subtracting the amount of time spent in the saline-paired compartment from the amount of time spent in the drug-paired compartment during the CPP test (Number of seconds in Drug-paired compartment) - (Number of seconds in Saline-paired compartment). Statistical analyses on difference score changes from Baseline to Test sessions can be performed to determine effects of drug conditioning.\nCPP scores can also be expressed as CPP Difference Scores Percentage (%). In the present study, CPP Difference Score % was calculated first by determining the percent of time spent in each operant chamber using the formula: (Time in Drug (OR Saline) Chamber/Total Time in Each Chamber) * 100 = % Conditioned Place Preference (CPP). The difference score percentage was determined by the formula: (Drug-paired %) - (Saline-paired %) = CPP Difference Score %.\nimgsrc://cloudfront.jove.com/files/ftp_upload/1998/1998fig1.jpgFigure 1. Relationship between Cocaine Intake and Conditioned Place Preference. Pearson's Correlation analyses determined a significant positive correlation between Total Cocaine-Reinforced Lever Responses and CPP Difference Score % for animals that had self-administered cocaine for eight sessions (e.g., the  Long-term  group; p < 0.05), but not for animals in the Short-term group (e.g., 4 cocaine sessions). Open diamonds represent individual data points for the Cocaine Long-term (n=9) and filled circles represent the Cocaine Short-term (n= 8) groups. Best-fit lines are dashed for Long-term, and solid for Short-term data points."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}