{
  "id": 1561,
  "origin_website": "Cell",
  "title": "Isolation of mouse Kupffer cells for phenotypic and functional studies",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nHarvesting the liver for ex vivo LNPCs isolation (method #1)\nTiming: 10 min\nEuthanize the mouse according to the authorized ethical guidelines.\nSanitize the mouse abdomen surface with 70% ethanol (Figure 1[href=https://www.wicell.org#fig1]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1001-Fig1.jpg\nFigure 1. Surgical preparation and harvesting of the liver\n(A and B) (A) Euthanized mouse is sanitized with 70% ethanol and the peritoneal cavity is exposed (B).\n(C) The intestine is pushed sideward in order to expose the portal vein and the vena cava.\n(D and E) (D) Liver is perfused through the vena cava. After 2 mL of perfusion the liver vasculature becomes engorged (E); at this moment the portal vein is cut.\n(F and G)(F) Liver is perfused with 10 mL of PBS and the organ clears immediately turning into a light brown color (G).\n(H–J) (H) The gallbladder is removed, and the hepatic ligaments are cut (I) before the complete harvest of the liver (J).\nCut through the peritoneum (Figure 1[href=https://www.wicell.org#fig1]B), by first performing a vertical cut from the lower end of the abdomen to the ribcage, and then performing horizontal cuts at the mid-section of the abdomen to both sides until the organs of the mouse are exposed. Pay attention not to damage any organs and gently expose the liver.\nPush the intestine right-hand sideward by using the blunt end of a forceps to get access to the liver (Figure 1[href=https://www.wicell.org#fig1]C).\nLoad a 10 mL syringe with 10 mL of PBS and a 27G needle.\nCarefully insert the needle in the inferior vena cava and perfuse 2 mL until the organ starts to swell (Figure 1[href=https://www.wicell.org#fig1]D).\nCut the portal vein with scissors, paying attention not to damage the liver (Figure 1[href=https://www.wicell.org#fig1]E).",
    "Complete the perfusion until 10 mL of PBS have been injected in about 2 min (Figures 1[href=https://www.wicell.org#fig1]F and 1G).\nRemove the gallbladder (Figure 1[href=https://www.wicell.org#fig1]H) and cut the liver ligaments connecting the liver to surrounding tissues (Figures 1[href=https://www.wicell.org#fig1]I and 1J).\nCollect the liver in ice-cold plain RPMI until next step.\nNote: the following protocol has been adapted from (Blériot et al., 2020[href=https://www.wicell.org#bib2]) and optimized for the digestion of half a liver. However, the volume of the digestion medium can be adjusted according to the amount of liver to be processed. If KC isolation is performed to be followed by a cell culture experiment, both mouse surgery and organ processing should be performed under sterile conditions (e.g., under a cell culture hood).\nProcessing the liver for ex vivo LNPCs isolation\nTiming: 60 min\nTransfer the liver to a 60 mm Petri dish and use blunt-end scissors to mince it in 1–2 mm3 small pieces.\nTransfer the liver pieces in a 50 mL Falcon tube containing 10 mL of pre-warmed ex vivo digestion medium (see above).\nIncubate at 37°C for 30 min.\nVortex the sample every 10 min at 2000 rpm.\nAfter incubation, gently homogenize the digested liver pieces by forcing them 7–8 times into a 10 mL syringe loaded with a 18G needle.\nFilter the homogenized liver solution through a 70 μm cell strainer in a new 50 mL Falcon tube and wash the filter with 10 mL of plain RPMI.\nCentrifuge at 50 rcf for 3 min.\nRecover the aqueous phase and transfer it in a new 50 mL Falcon tube. Discard the pellet containing dead hepatocytes and debris.\nCentrifuge at 400 rcf for 5 min.\nAfter this centrifugation step the pellet contains target LNPCs. Discard the top aqueous phase.",
    "Lyse red blood cells resuspending the cell pellet with 2 mL of ACK and incubate for 30 s at 20°C–25°C.\nAdd 20 mL of plain RPMI to restore osmolarity and centrifuge at 400 rcf for 5 min.\nResuspend the cell sediment in 10 mL of ice-cold plain RPMI. From now on all the steps are done at 4°C.\nFilter cell suspension through a 70 μm cell strainer in a new 50 mL Falcon tube.\nMix an aliquot of the cell suspension cell suspension 1:2 in trypan blue and determine cell count of viable cells with a Neubauer chamber.\nProceed with the desired downstream application (steps 49 through 53 for cell culture or steps 54 through 63 for flow cytometry and cell sorting).\nCritical: cell sediment in step 20 is loose, pay attention if a vacuum aspiration system is used to discard the supernatant.\nOptional: at steps 20–21 there might be clogs in the cell pellet, cut the tip of a 1 mL pipette to facilitate the resuspension process.\nIn situ liver digestion for the isolation of hepatocytes and LNPCs (method #2)\nTiming: 90 min\nThe following step-by-step section describe an alternative, longer but more gentle protocol for the isolation of LNPCs. This method also allows the simultaneous recovery of hepatocytes and replaces steps 1 through 28.\nPrewarm the Liver perfusion medium and liver digestion medium in the water bath at 37°C (see Figure 2[href=https://www.wicell.org#fig2] for pump configuration).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1001-Fig2.jpg\nFigure 2. Configuration of the equipment for the in situ digestion of the liver\nPrime and wash the pump tubes with prewarmed HBSS. Pump flux during the procedure should be set at 5 mL/min.",
    "Inject the mouse intravenously with 200 μL of heparin solution (100 Units in PBS) to avoid coagulation issues that can potentially interfere with the perfusion and with the digestion.\nAnesthetize the mouse with Avertin (600 μL for a mouse of 25 grams) at 37°C intraperitoneally.\nSpread the mouse with 70% EtOH and cut through the peritoneum, by first performing a vertical cut from the lower end of the abdomen to the ribcage, and then performing horizontal cuts at the mid-section of the abdomen to both sides und the organs of the mouse are exposed.\nGently push the intestine right-hand sideward by using the blunt end of a forceps to get access to the liver.\nCanulate the inferior vena Cava (25G needle).\nOptional: Place an open silk suture around inferior vena Cava to help the canula to be in place.\nStart the perfusion with Liver Perfusion Medium for 3 min after severing the portal vein. This medium is meant to clean the liver from blood and to start the loosening of cell-to-cell contacts.\nPerfuse with warm Liver digestion medium for 12 min and pay attention that no air bubbles should be introduced during the entire process. After 8 min, start checking the liver consistency with a wet cotton applicator. Digested liver loses elasticity and assumes a reticulated appearance.\nOnce the liver is completely digested, remove the gallbladder, and cut the liver ligaments connecting the liver to the surrounding tissue.\nTransfer liver into a 60 mm Petri dish with Hepatocyte Wash Medium and carefully decapsulate the organ using surgical forceps (for more information see the online Methods video S1[href=https://www.wicell.org#mmc1]).\nGently shake the liver while holding it with a tweezer. This procedure allows digested cells (Hepatocytes and LNPCs) to be released in the Hepatocyte wash medium (online Methods video S1[href=https://www.wicell.org#mmc1]).",
    "Transfer the obtained cell suspension to a 50 mL falcon tube and reach 50 mL of volume with the Hepatocyte Wash Medium.\nCentrifuge at 20 rcf for 3 min.\n    Your browser does not support HTML5 video.\n  \nMethods video S1. Liver decapsulation and release of in situ digested cells\nNote that at the end of each 20 rcf centrifugation the pellet is enriched by Hepatocytes, while soluble fraction by LNPCs.\nAt this step the pellet is composed mainly by Hepatocytes (HC) and the soluble fraction by LNPCs.\nRepeat steps 40 to 41.\nCollect separately HC and LNPC and resuspend each fraction in separate 15 mL tubes containing 10 mL of 36% Percoll solution and gently mix.\nCentrifuge 2000 rpm for 20 min without brake.\nNote: the purpose of the Percoll separation is to get rid of cellular and tissue debris to obtain a clearer cell preparation.\nAt the end of the centrifugation, discard the Percoll soluble fraction (containing cellular debris) and resuspend each cell pellet in the appropriate medium (LNPC fraction should be suspended in RPMI, hepatocytes in hepatocyte medium).\nFilter LNPCs fraction through a 40 μm cell strainer.\nOptional: lyse red blood cells with 2 mL of ACK for 30 seconds at 25°C, centrifuge and resuspend the cell pellet in 10 mL of RPMI.\nMix an aliquot of each cell suspension 1:2 in trypan blue and determine cell count of viable cells with a Neubauer chamber.\nProceed with the desired downstream application (step from 49 to 53 for cell culture or step from 54 to 66 for flow cytometry and cell sorting).\nCritical: make sure that the tube carrying the digestion medium to the liver is at 37°C when reaches the vena cava. If the solution is at lower temperature, enzymatic activity might be suboptimal.",
    "Note: Hepatocytes are extremely fragile cells and should be maintained at 37°C during the entire procedure to maximize cell vitality.\nIsolating KCs by cell adhesion\nTiming: 3 h\nPrepare the culture medium supplementing plain RPMI with 10% FBS and 100 U/mL Penicillin/Streptomycin.\nResuspend LNPCs to a density of 1–3×107/mL in culture medium.\nPlate 1×107 LNPCs per well in a 6-well culture plate.\nIncubate for 2 h at 37°C with 5% CO2.\nRemove cell debris and non-adherent cells by gently washing adherent cells with cold PBS.\nNote: more than 95% of adhering cells are Kupffer cells (Li et al., 2014[href=https://www.wicell.org#bib6]). To maintain Kupffer cell differentiation, add 50 ng/mL of recombinant M-CSF (R&D system cat #416-ML) in the culture medium.\nStaining KCs from isolated LNPCs for FACS sorting\nTiming: 2 h\nTransfer LNPCs in FACS tubes at 5×107/mL.\nNote that in order to sort 106 KCs, a good starting point is 2×107 of total LNPCs.\nWash with 1–2 mL of FACS buffer and spin down for 5 min at 400 rcf.\nIncubate with 200 μL of anti-CD16/CD32 (5 μg/mL in FACS buffer) for 15 min at 4°C.\nWash with 1–2 mL of FACS buffer and spin down for 5 min at 400 rcf.\nIncubate with 300 μL of antibody mix for 40 min at 4°C.\nWash with 1–2 mL of FACS buffer and spin down for 5 min at 400 rcf.\nIncubate with 200 μL of DAPI (5 μg/mL in FACS buffer) for 5 min at 4°C.\nWash with 1–2 mL of FACS buffer and spin down for 5 min at 400 rcf.\nResuspend in FACS buffer at 5×106 cells per mL.\nSort target cells at 4°C using a 100 μm nozzle.\nCritical: sheath pressure should not exceed 20 psi to preserve cell viability.",
    "Recommended: To enhance viability of sorted cells, collection FACS tubes pre-coated with 5% BSA or 5% FBS for 14–16 h at 4°C to neutralize the electrostatic charges of polystyrene tubes should be used. Otherwise, polypropylene tubes can be used since have neutral charge.\nNote: If cells are sorted for functional downstream applications (e.g., cell culture), do not supplement FACS buffer with NaN3. To further improve cell viability, collection media should contain at least 10% FBS.\ntable:files/protocols_protocol_1001_5.csv\nOptional: brilliant stain buffer can be used in place of FACS buffer to minimize Brilliant Violet dyes staining artifacts.\nAlternatives: fixable Live/Dead (L/D) dyes can be used to gate live cells instead of DAPI. In this case, at the end of LNPC isolation procedure, cells must be washed in plain PBS and Live/Dead staining should be performed at 20°C–25°C for 20 minutes.\nNote: sessile LNPCs (e.g., KCs and Liver Sinusoidal Endothelial cells - LSECs), once extracted from the liver during the digestion process, are slightly auto fluorescent and have more proteins on their membrane surface. For this reason, since fixable dyes stain amine reactive groups, the use of Live/Dead might be suboptimal in separating dead cells. DAPI – being impermeable to the membrane of live cells – is more appropriate when possible (see Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1001-Fig3.jpg\nFigure 3. Different strategies to gate live cells\nRepresentative dot plots of LNPC preparation in which live cells have been gated with DAPI staining (A) or with fixable Live/Dead staining (B). In separate samples, LNPCs have been mixed in 1:1 ratio with LNPCs placed at 70°C for 5 min to show actual dead cell population."
  ],
  "subjectAreas": [
    "Immunology",
    "Cell Isolation",
    "Flow Cytometry",
    "Cell Culture",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}