{
  "id": 2057,
  "origin_website": "Cell",
  "title": "Directed differentiation of human pluripotent stem cells to epicardial-derived fibroblasts",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nPreparing plates\nTiming: 1.25 h (Hands-on time: 15 min) for step 1\nTiming: 1 day (Hands-on time: 15 min) for step 2\nThese steps describe preparation of tissue culture plates for cell culture.\nPreparing Matrigel-coated plates.\nNote: This step describes preparation of Matrigel-coated plates that can be used for hPSC maintenance, hPSC differentiation, CPC differentiation, EpiC maintenance, and EpiC differentiation.\nPipette 32 mL of D-MEM/F-12 medium into a 50 mL conical tube.\nObtain tissue culture plates to be coated. One aliquot of Matrigel solution (2.5 mg, approximately 250 μL) is enough to coat 5 plates.\nRemove Matrigel stock solution from the −80°C freezer immediately prior to preparing plates.\nUsing a P1000, take up 1 mL of D-MEM/F-12 medium from the conical tube prepared in step 1a and pipette to mix with the single Matrigel solution aliquot until thawed (∼10–30 s). Return all contents to the conical tube.\nUsing a 10 mL pipette, mix the Matrigel solution.\nAdd 1 mL of Matrigel solution to each well of the 6 well plate. Add 0.5 mL per well to 12 well plates, etc.\nIf storing the plates for more than 3 days, add extra D-MEM/F-12 so plates do not dry out.\nNote: We suggest adding 1–2 mL of D-MEM/F-12 every 3–7 days to prevent the Matrigel wells from drying out.\nPlace the plate in the incubator (37°C, 5% CO2, humidified). Move the plate in 3 quick, short, back-and-forth and side-to-side motions to ensure the Matrigel solution fully coats the surface of the wells. Matrigel plates should be incubated for at least 1 h prior to use.",
    "Critical: Matrigel-coated plates can be stored in the incubator (37°C, 5% CO2, humidified) for up to 2 weeks. If dry spots appear on the plate, those well(s) should not be used for further cell culture.\nPreparing gelatin-coated plates.\nNote: This step describes preparation of gelatin-coated plates that can be used for CPC differentiation, EpiC maintenance, and EpiC differentiation.\nObtain 5 tissue culture plates to be coated.\nTransfer 32 mL of sterile water to a conical tube.\nAdd 160 μL gelatin solution to the conical tube.\nUsing a 10 mL pipette, mix the gelatin solution. Add 1 mL of gelatin solution to each well of a 6 well plate. Add 0.5 mL per well for 12 well plates, etc.\nNote: We suggest adding 1–2 mL of sterile water to prevent the gelatin wells from drying out if the plates are to be stored for more than a day.\nTransfer the plate to the incubator (37°C, 5% CO2, humidified). In the incubator, move the plate in 3quick, short, back-and-forth and side-to-side motions to disperse the solution across the surface of the wells.\nOn the day of using gelatin plates, aspirate the gelatin solution. Leave lid off the plate for 2–3 h in the sterile biosafety cabinet. Do not use this biosafety cabinet while the plate is drying and do not dry the plate in the incubator. We have observed reduced cell attachment if the gelatin plates are not correctly prepared.\nCritical: Gelatin-coated plates can be kept in the incubator for up to 3 days if they are not allowed to dry out. If dry spots appear on the plate, those well(s) should not be used for further cell culture.\nThawing and freezing cells\nTiming: 1 h (Hands-on time: 30 min) for step 3",
    "Timing: 1 h (Hands-on time: 30 min) for step 4\nTiming: 1 h (Hands-on time: 30 min) for step 5\nTiming: 1 day (Hands-on time: 30 min) for step 6\nThese steps describe thawing of hPSC lines for producing healthy colonies suitable for EpiC-FB differentiation, CPCs and EpiCs for further differentiation to CFBs, and EpiC-FBs. Additionally, these steps describe freezing of hPSCs, CPCs, EpiCs, and EpiC-FBs for storage in liquid nitrogen.\nThawing of human pluripotent stem cells.\nWarm mTeSR1 medium at 15°C–25°C for approximately 30 min.\nRemove a Matrigel-coated 6 well plate from the incubator.\nTransfer 5 mL of mTeSR1 to a 15 mL conical tube.\nTransfer 10 mL of mTeSR1 to another 15 mL conical tube. Add 10 μL of 5 mM Y27632 (ROCK inhibitor, final concentration of 5 μM) to the mTeSR1.\nCritical: Including ROCK inhibitor is important for high hPSC recovery after freezing and thawing. If ROCK inhibitor is omitted, hPSCs will not adhere.\nRemove a frozen cell cryotube of hPSCs from liquid nitrogen and immerse the cryotube in a 37°C water bath without submerging the cap. Swirl the cryotube gently for 2–3 min until the contents are completely thawed.\nSpray the cryotube with 70% (vol/vol) ethanol and move it into a tissue culture hood. Use a sterile 1 mL pipette to gently transfer the cells from the cryotube to the sterile 15 mL conical tube containing 5 mL of 15°C–25°C mTeSR1 medium prepared in step 3c.\nNote: Submerging the cryotube cap in the water bath will increase the likelihood of contamination.\nNote: Keeping the cryotube in the water bath too long will reduce cell viability.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nLabel the Matrigel-coated plate with hPSC line, hPSC passage number, date frozen, date thawed, and initials.",
    "Aspirate the supernatant from the 15 mL conical tube and aspirate the liquid from the wells of the Matrigel-coated plate.\nResuspend the cell pellet in 10 mL of mTeSR1 medium containing 5 μM Y27632 prepared in step 3d. Slowly add 1.5 mL of the cell suspension into each well of the Matrigel-coated 6 well plate.\nReturn the plate to the 37°C, 5% CO2 incubator. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to evenly disperse the cells across the surface of the wells. Please see Table 2[href=https://www.wicell.org#tbl2] for further information regarding cryopreservation. Troubleshooting 1[href=https://www.wicell.org#sec7.1].\ntable:files/protocols_protocol_1540_24.csv\nThawing of cardiac progenitor cells and epicardial cells.\nWarm LaSR medium at 15°C–25°C for 30 min.\nRemove a Matrigel-coated or gelatin-coated 12 well plate from the incubator.\nTransfer 5 mL of LaSR medium to a 15 mL conical tube.\nTransfer 12 mL of LaSR to another 15 mL conical tube. For CPCs, add 12 μL of 5 mM Y27632 (ROCK inhibitor, final concentration of 5 μM). For thawing EpiCs, add add 12 μL of 5 mM Y27632 (ROCK inhibitor, final concentration of 5 μM) and 0.6 μL of 10 mM A83-01 (TGFβ inhibitor, final concentration of 0.5 μM).\nCritical: Including ROCK inhibitor is important for efficient EpiC and CPC attachment after thawing.\nOptional: For thawing EpiCs, add 120 μL FBS of tothe medium (final concentration of 1% (vol/vol) FBS). This helps to increase viability and attachment of EpiCs.\nRemove a frozen cryotube of CPCs or EpiCs from liquid nitrogen storage and immerse the cryotube in a 37°C water bath without submerging the cap. Swirl the cryotube gently for 2–3 min until the contents are completely thawed.\nNote: Submerging the cryotube cap in the water bath will increase the likelihood of contamination.",
    "Note: Keeping the cryotube in the water bath too long will reduce cell viability.\nSpray the cryotube with 70% (vol/vol) ethanol and transfer it into a tissue culture hood. Use a sterile 1 mL pipette to gently transfer the cells into a sterile 15 mL conical tube containing 5 mL of warmed LaSR medium prepared in step 4c.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nLabel plate with hPSC line, hPSC passage number, date thawed, date frozen, and initials. When thawing EpiCs, also record the EpiC passage number.\nAspirate the supernatant from the conical tube, and aspirate the liquid from the wells of the fresh Matrigel or gelatin-coated plate.\nResuspend the cell pellet in the medium prepared in step 4d. Slowly add 1 mL of the cell suspension into each well of the 12 well Matrigel or gelatin-coated plates.\nReturn the plate to the 37°C, 5% CO2 incubator. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells across the surface of the wells. Please see Table 2[href=https://www.wicell.org#tbl2] for further information regarding cryopreservation. Troubleshooting 3[href=https://www.wicell.org#sec7.5], Troubleshooting 4[href=https://www.wicell.org#sec7.7].\nThawing of epicardial-derived fibroblasts.\nWarm FibroGRO medium at 15°C–25°C for 30 min.\nObtain a 6 well tissue culture plate (uncoated).\nTransfer 5 mL of FibroGRO to a 15 mL conical tube.\nRemove a frozen cryotube of EpiC-FBs from liquid nitrogen and immerse the cryotube in a 37°C water bath without submerging the cap. Swirl the cryotube gently for 2–3 min until the contents are completely thawed.\nNote: Submerging the cryotube cap in the water bath will increase the likelihood of contamination.\nNote: Keeping the cryotube in the water bath too long will reduce cell viability.",
    "Spray the cryotube with 70% (vol/vol) ethanol and transfer it into a tissue culture hood. Use a sterile 1 mL pipette to gently transfer the cells into a sterile 15 mL conical tube containing 5 mL of warmed FibroGRO medium prepared in step 5c.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nLabel plate with hPSC line, hPSC passage number, EpiC passage number, EpiC-FB passage number, date thawed, date frozen, and initials.\nAspirate and discard the supernatant from the conical tube.\nResuspend the cell pellet in 12 mL of FibroGRO. Slowly add 2 mL of the cell suspension into each well of the 6 well tissue culture plate (uncoated).\nTransfer the plate to the 37°C, 5% CO2 incubator. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells across the surface of the wells. Troubleshooting 10[href=https://www.wicell.org#sec7.19].\nFreezing of cells.\nNote: This step describes freezing of cells for long term storage in liquid nitrogen.\nCritical: Do not refreeze cells that were recently thawed as this will decrease overall viability. We suggest expanding cells for at least two passages after thaw before refreezing.\nPrepare freezing medium: 10% DMSO, 30% FBS, 60% medium (for hPSCs use mTeSR1, for others use D-MEM/F-12) supplemented with 5 μM Y27632. Prepare 1 mL of freezing medium/cryotube of frozen cells. Freezing medium can be stored for several months at −20°C.\nObtain a Mr Frosty freezing container.\nCritical: The Mr Frosty freezing container must be at 15°C–25°C. If not, this will alter the freezing rate of the cells and reduce overall viability.\nLabel cryotubes with hPSC line, cell type, hPSC passage number, freezing date, initials, and number of cells/cryotube. For EpiCs and EpiC-FBs, add information on respective passage numbers.",
    "Treat wells to be frozen with Accutase until cells are singularized and lifted. Add 1 mL of Accutase per well to each well of a 6 well plate or 0.5 mL of Accutase per well to each well of a 12 well plate. Incubate plate at 37°C, 5% CO2 for 5–7 min for hPSCs, 10–30 min for CPCs, 5–10 min for EpiCs, and 5–10 min for EpiC-FBs.\nNote: If there is a large amount of cell debris in the wells, we recommend washing with 1 mL/well sterile, DBPS (at 15°C–25°C) prior to addition of Accutase.\nPrepare the quench solution by filling a conical with 1:1 (vol/vol) of medium (for hPSCs, use mTeSR1, for others use D-MEM/F-12) to Accutase solution.\nAfter cells have begun to lift off the plate, use a 1 mL pipette to pipette up and down singularizing the cells, and transfer Accutase-lifted cell solution to the conical containing the quench medium.\nCount the total number of cells in the conical using a hemocytometer.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nAspirate supernatant from the conical tube. Resuspend the cell pellet at desired concentration in freezing medium such that there is 1 mL of freezing medium/cryotube. Quickly aliquot into cryotubes.\nQuickly cap all freezing cryotubes and transfer them into the Mr Frosty freezing container. Do not tighten Mr Frosty freezing container cap fully.\nNote: Mr Frosty freezing container cap may become difficult to unscrew if tightened too much at 15°C–25°C.\nChill the Mr Frosty freezing container in −80°C freezer for 8–24 h.\nThe next day, move all cryotubes to liquid nitrogen storage. We do not suggest leaving cryotubes in the −80°C for long term storage.",
    "Note: Table 2[href=https://www.wicell.org#tbl2] shows the suggested number of cells to freeze per cryotube and the number of wells to thaw a single cryotube into for hPSCs, CPCs, EpiCs, and EpiC-FBs.\nMaintenance of human pluripotent stem cells\nTiming: 45 min (Hands-on time: 15 min) for step 7\nTiming: 45 min (Hands-on time: 15 min) for step 8\nThese steps describe daily maintenance of hPSCs. Additionally, these steps describe passaging of hPSCs colonies using Versene. hPSCs split at a 1:6 ratio should be passaged at 70%–90% confluency approximately every 3–4 days. If split at a 1:12 ratio, hPSCs should be passaged approximately every 4–5 days.\nDaily maintenance of human pluripotent stem cells.\nDaily, warm mTeSR1 at 15°C–25°C for approximately 30 min.\nAspirate the medium from each well of the 6 well plate and replace it with 2 mL of fresh warmed mTeSR1 medium. Repeat this medium replacement daily until cells are ready for passage.\nPassaging human pluripotent stem cells using Versene.\nWarm Versene and mTeSR1 at 15°C–25°C for approximately 30 min. Obtain a Matrigel-coated 6 well plate.\nAspirate the medium from a single well of a 6 well plate of hPSCs and add 1 mL of warmed Versene. At this point, 1–2 million cells should be present in each well.\nNote: We suggest using a single well from a confluent 6 well plate of hPSCs for Versene passaging to expand the hPSC line and using the remaining 5 wells to start a differentiation.\nIncubate the plate at 37°C, 5% CO2 and wait for 5 min.",
    "Note: Versene incubation time may need to be adjusted. If cells do not detach easily by mechanical dissociation after a 5 min Versene incubation, incubate longer during the next passage. If cells are floating in the Versene in less than 5 min, incubate for less time during the next passage.\nTransfer 10 mL of mTeSR1 to a 15 mL conical tube.\nAspirate the Versene.\nUsing a P1000, remove 1 mL of mTeSR1 from the conical containing mTeSR1 medium prepared in step 8d. Dispense the mTeSR1 medium over the surface of the plate well with the pipette tip perpendicular to the surface until all the colonies are detached (∼2–3 washes). After the cells are detached from the surface of the well, transfer the contents of the single well into the sterile conical tube containing 10 mL of mTeSR1.\nCritical: hPSCs must be gently passaged. If there are only a few cells per colony after Versene passaging, we suggest using a 5 mL or 10 mL glass pipette instead of a P1000 at this step.\nAspirate the liquid from a fresh 6 well Matrigel-coated plate.\nGently mix the conical contents using a 10 mL pipette.\nSeed 1.5 mL of the cell suspension into each well of a Matrigel-coated plate.",
    "Critical: The split ratio is variable, although generally between 1:6 and 1:18 is appropriate when using Versene for passaging. A general rule is to observe the last split ratio and adjust the ratio according to the appearance of the hPSC colonies. If the cells have an undifferentiated morphology (colony diameter <500 μm) and colonies have enough space (more than 10 μm) between them to expand, split them using the same ratio. If they are overly dense and crowded (colony diameter >500 μm, spacing between colonies <10 μm), increase the ratio; decrease the ratio if the cells are sparse (colony diameter <50 μm, spacing between colonies >500 μm). Ideally, hPSCs should be split every 3–5 days.\nReturn the plate to the incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to evenly disperse the cells across the surface of the wells.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig2.jpg\nFigure 2. Brightfield images of 19-9-11 hiPSCs\nLeft image shows high quality 19-9-11 colonies two days after passaging at a 1:6 split ratio with Versene. Right image shows low quality hPSC colonies with arrows pointing out single cells, spontaneous differentiation, and protrusions off the edges of the colonies. Scale bar is 100 μm.\nNote: hPSC culture can be maintained by repeating these steps until cardiac differentiation. We have been able to accomplish successful differentiations across a range of passages from 30 to 70.",
    "Critical: hPSC colonies should be constantly monitored for spontaneous differentiation, changes in colony morphology, and/or large changes in growth rate. Example images are shown in Figure 2[href=https://www.wicell.org#fig2]. If these events occur, we suggest thawing a new cryotube of hPSCs. If this problem is consistent throughout multiple banked cryotubes, we suggest performing colony picking or obtaining a new cryotube of hPSCs from commercial sources. If this problem is consistent across multiple hPSC lines, we suggest obtaining new Matrigel and mTeSR1 stocks.\nDifferentiation of human pluripotent stem cells to cardiac progenitor cells\nTiming: 8 days\nTiming: 1 h (Hands-on time: 30 min) for step 9\nTiming: 45 min (Hands-on time: 15 min) for step 10\nTiming: 45 min (Hands-on time: 15 min) for step 11\nTiming: 45 min (Hands-on time: 15 min) for step 12\nTiming: 45 min (Hands-on time: 15 min) for step 13\nTiming: 45 min (Hands-on time: 15 min) for step 14\nThese steps describe the differentiation of hPSCs to cardiac progenitor cells (CPCs). CPCs can be further differentiated into cardiomyocytes or EpiCs. For background on the development of this protocol and differentiation to cardiomyocytes, please see (Lian et al., 2015[href=https://www.wicell.org#bib4]). In this part of the protocol, we will describe differentiation of hPSCs into CPCs in terms of a single 12 well plate which requires approximately 12 million hPSCs or 5 wells of a confluent 6 well plate. This differentiation can be scaled to a 24 well plate or a 48 well plate as shown in Table 1[href=https://www.wicell.org#tbl1]. Additionally, we will use a common convention in hPSCs differentiations where we denote Day 0 as the day where we induce differentiation using CHIR99021 and use negative numbers to denote expansion of hPSCs.\nDay -2.\nWarm mTeSR1 at 15°C–25°C for approximately 30 min.",
    "Remove hPSCs cultured on Matrigel-coated 6 well plates in mTeSR1 medium to confluency from the incubator.\nAspirate the medium from each well and add 1 mL of Accutase to 5 wells of a 6 well plate.\nIncubate the plate at 37°C, 5% CO2 until cells are suspended, approximately 5 min.\nNote: Gentle agitation of the plate should be sufficient to resuspend the hPSCs in the Accutase solution.\nPrepare the quench medium by adding 5 mL of mTeSR1 to a conical tube.\nTransfer all of the cell suspensions to the conical tube prepared in step 9e using a P1000.\nCount the total cell number in the conical tube using a hemocytometer.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nPrepare the plating medium by adding 27 mL of mTeSR1 with 27 μL of 5 mM Y27632 (ROCK inhibitor, final concentration of 5 μM) in a conical tube.\nObtain a 12 well Matrigel-coated plate and label with hPSC line, “Cardiac”, “Day -2”, seeding density, hPSC passage number, date, and initials.\nAspirate liquid from a fresh Matrigel-coated plate and add 2 mL of mTeSR1 with 5 μM Y27632 to each well using the plating medium prepared in step 9i.\nAfter centrifuging the cell suspension, aspirate the supernatant from the conical tube and resuspend the cell pellet in mTeSR1 with 5 μM Y27632 at a cell density of 1 million cells per 100 μL using the plating medium prepared in step 9i. Add the corresponding volume of cell suspension to each well. For 1 million cells, add 100 μL. Troubleshooting 1[href=https://www.wicell.org#sec7.1].",
    "Critical: The starting seeding cell density is crucial for efficient cardiac differentiation. The initial plating density and/or the time of expansion before initiation of differentiation may require optimization for different hPSC lines or expansion conditions. We suggest optimizing the differentiation by testing various seeding densities and CHIR99021 concentrations at Day 0. We recommend plating at a cell density of 0.5 million cells per well of 12 well plate and increasing this stepwise to 2 million cells per well for a specific hPSC lines in the first experiment, and then expanding the cells for 2 days before initiation of differentiation. After determining the optimal seeding density for a given hPSC lines, this seeding density can be used for subsequent differentiation experiments. Another alternative is to try expanding the cells for 3 days before initiating the differentiation on day 0 rather than 2 days.\nReturn the plate to the 37°C, 5% CO2 incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells evenly across the surface of the wells.\nDay -1.\nWarm mTeSR1 at 15°C–25°C for approximately 30 min.\nOn Day −1 of differentiation, aspirate the medium and add 2 mL of mTeSR1 to each well of the 12 well plate.\nReturn the plate to the 37°C, 5% CO2 incubator.\nDay 0.\nWarm RPMI/B27 minus insulin medium at 15°C–25°C for approximately 30 min.\nOn Day 0 of differentiation, prepare a conical tube with 25 mL of RPMI/B27 minus insulin supplemented with 5.55 μL of 36 mM CHIR99021 (final concentration of 8 μM).\nAspirate the previous medium and then add 2 mL of RPMI/B27 minus insulin with CHIR99021 to each well of the 12 well plate. Record the time.",
    "Critical: Recording the time when RPMI/B27 minus insulin with CHIR99021 is added is important, as replacing medium should to be done exactly 24 h after CHIR99021 addition. Although we identified 8 μM CHIR99021 as the optimal concentration for the H9 hESC line, other hPSC lines will likely respond to CHIR99021 treatment differently. Thus, optimization of CHIR99021 concentration may be required. We recommend screening in a 12-well or 24-well plate a range of seeding densities as discussed in step 9l and treating that range with 6–14 μM CHIR99021 in 2 μM steps in the first experiment. We suggest follow-up experiments in the range of desired seeding densities and CHIR99021 concentrations to identify the optimal conditions and verify these across multiple differentiations. Additionally, we have identified that optimal length of CHIR99021 treatment varies between hPSC lines and may range from 23-48 h. We have also observed variability among CHIR99021 lots, so we recommend optimizing differentiation for each lot.\nReturn the plate to the 37°C, 5% CO2 incubator. Troubleshooting 2[href=https://www.wicell.org#sec7.3].\nDay 1.\nWarm RPMI/B27 minus insulin at 15°C–25°C for approximately 30 min.\nAfter 24 h (Day 1 of differentiation), aspirate the medium from each well of the 12 well plate and replace it with 2 mL of warmedRPMI/B27 minus insulin. Timing here is critical. We recommend that medium is changed within 5 min of the 24 h mark.\nReturn the plate to the 37°C, 5% CO2 incubator.\nDay 3.\nWarm RPMI/B27 minus insulin at 15°C–25°C for approximately 30 min.\nOn Day 3 of differentiation (72 h after addition of CHIR99021, although timing here is not as critical, ±2 h is acceptable), prepare a conical tube with 12.5 mL of fresh RPMI/B27 minus insulin medium. Add 25 μL of 5 mM IWP2 (final concentration in conditioned medium of 5 μM) to the medium.",
    "Do not shake the plate after taking from the incubator. Collect 12.5 mL of conditioned medium from the induced cells, add the conditioned medium to the conical tube prepared in step 13b, and mix.\nBefore aspirating the remaining medium in the well of the 12 well plate, gently rock the plate back and forth to suspend cell debris, ensuring that the debris will be removed via aspiration. Aspirate the remaining medium from the 12 well plate.\nNote: If there is a large amount of cell debris still remaining in the wells, we recommend washing each well with 1 mL DPBS (at 15°C–25°C) prior to adding the prepared medium.\nAdd 2 mL of the combined medium containing IWP2 to each well and return the cells to the 37°C, 5% CO2 incubator.\nDay 5.\nWarm RPMI/B27 minus insulin at 15°C–25°C for approximately 30 min.\nOn Day 5 of differentiation, aspirate the medium from each well of the 12 well plate and add warmed RPMI/B27 minus insulin at a volume of 2 mL per well. Timing here is less critical, we recommend ±3 h from Day 3.\nNote: If there is a large amount of cell debris in the wells, we recommend washing each well with 1 mL DPBS (at 15°C–25°C) prior to adding fresh medium.\nReturn the plate to the 37°C, 5% CO2 incubator.\nDay 6 – CPCs.\nPause point: Cryopreserved CPCs can be stored for more than 3 years in liquid nitrogen.\nOn Day 6, CPCs will be present. These cells can be frozen or differentiated into EpiCs. For freezing CPCs, follow the previous instructions for cryopreservation (step 6). For differentiating CPCs into EpiCs, following the upcoming instructions (steps 16–18).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig3.jpg\nFigure 3. Brightfield images of 19-9-11 hiPSC-derived D6 CPCs (left) and D7 cells (right) after replating for EpiC differentiation",
    "Scale bar is 100 μm.\nNote: An example brightfield image of D6 CPCs prior to replating for differentiation to EpiCs and one day later (D7 differentiating cells) is shown in Figure 3[href=https://www.wicell.org#fig3].\nNote: CPCs can be further differentiated into cardiomyocytes with a medium change to LaSR medium or RPMI supplemented with 2% B27 with insulin medium every 2–3 days until spontaneous beating is observed around Day 12. The cardiomyocytes can be maintained for more than 6 months. (Bao et al., 2016[href=https://www.wicell.org#bib1]; Lian et al., 2015[href=https://www.wicell.org#bib4]).\nDifferentiation of cardiac progenitor cells to epicardial cells\nTiming: 6 days\nTiming: 1 h (Hands-on time: 30 min) for step 16\nTiming: 45 min (Hands-on time: 15 min) for step 17\nTiming: 45 min (Hands-on time: 15 min) for step 18\nTiming: 1 h (Hands-on time: 30 min) or cryopreservation for step 19\nThese steps describe differentiation of hPSC-derived CPCs into EpiCs. For additional details on development of this protocol, see (Bao et al., 2016[href=https://www.wicell.org#bib1]). In this part of the protocol, we will describe the EpiC differentiation in a single 6 well plate which requires approximately 2 M CPCs or 1 well of a 12 well plate. This protocol can be scaled to other plate sizes as shown in Table 1[href=https://www.wicell.org#tbl1].\nDay 6 – CPCs.\nWarm LaSR medium at 15°C–25°C for approximately 30 min.\nRemove a gelatin-coated or Matrigel-coated 6 well plate from the 37°C, 5% CO2 incubator. If using gelatin-coated plates, make sure that the plates have dried completely before replating.\nPrepare plating medium by adding 13 mL of LaSR basal medium and 13 μL of 5 mM Y27632 (ROCK inhibitor, final concentration of 5 μM).\nRemove CPCs from the incubator, aspirate medium from a single well of a 12 well plate, and add 0.5 mL of Accutase.",
    "Incubate the plate at 37°C for 10–30 min. We recommend gently agitating the plate every 5 min. If the cells are detached and in solution, proceed to the next step.\nNote: Trypsin is also a suitable reagent for singularizing CPCs but requires a much shorter incubation time and needs to be quenched with serum-containing medium.\nNote: D5 CPCs are also suitable for differentiation to EpiCs. However, we have found that for most hPSC lines D6 CPCs generate a higher percentage of WT1+ EpiCs.\nPrepare a conical with 0.5 mL of LaSR medium for quenching.\nTransfer the cell suspension from the well to the conical tube using a P1000. Pipette the cell suspension on the plate to singularize the cells and detach any remaining cells from the plate.\nCount the total cell number in the conical using a hemocytometer.\nNote: If necessary, splitting 1 well of CPCs to a 6 well plate is acceptable. This is approximately the correct density; however, this depends on the seeding density for the cardiac differentiation. Some hPSC lines are more sensitive to than others to the replating, so the seeding density may need to be adjusted. A range of seeding densities, approximately 20,000–40,000 cells/cm2, is acceptable for differentiation to EpiCs.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nAdd 2 mL of plating medium (prepared in step 16c) to each well of the 6 well plate.\nLabel the 6 well plate with hPSC line, hPSC passage number, date, “Day 6 CPCs to EpiC”, and initials.\nAfter centrifuging the cell suspension, aspirate the supernatant from the conical tube and resuspend the cell pellet in plating medium (prepared in step 16c) at a cell density of 1 million cells per 100 μL. Add 300k cells to each well of a 6 well plate.",
    "Note: If CPCs are thawed from cryopreservation, we recommend replating 350k cells in each well to account for a reduction in cell viability due to freezing.\nReturn the plate to the 37°C, 5% CO2 incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells evenly across the surface of the wells. Troubleshooting 3[href=https://www.wicell.org#sec7.5].\nDay 7 and 8.\nWarm LaSR medium at 15°C–25°C for approximately 30 min.\nPrepare differentiation medium by adding 12.5 mL of LaSR and 1.04 μL of 36 mM CHIR99021 (final concentration of 3 μM) to a conical tube.\nAspirate medium and add 2 mL of LaSR supplemented with CHIR99021 to each well.\nReturn the plate to the 37°C, 5% CO2 incubator.\nDay 9, 10, and 11.\nWarm LaSR medium at 15°C–25°C for approximately 30 min.\nAspirate the medium and add 2 mL of LaSR to each well.\nReturn the plate to the 37°C, 5% CO2 incubator.\nDay 12 – EpiCs.\nPause point: EpiCs at Day 12 or any passage afterward can be stored in liquid nitrogen for long periods of time.\nWarm LaSR at 15°C–25°C for approximately 30 min.\nRemove gelatin-coated or Matrigel-coated plates from the incubator. If using gelatin-coated plates, make sure that the plates have dried completely before replating.\nPrepare plating medium by adding 12.5 mL of LaSR, 12.5 μL of Y27632 (final concentration 5 μM), and 0.625 μL of A83-01 (TGFβ inhibitor, final concentration 0.5 μM) to a 15 mL conical tube.\nOptional: Add 125 μL of FBS to the plating medium (final concentration of 1% (vol/vol) FBS). This helps to increase viability and attachment of EpiCs.",
    "Remove Day 12 EpiCs from the incubator, aspirate medium from 2 wells, and add 1 mL Accutase to those wells. Incubate the plate for 8 min at 37°C, 5% CO2.\nNote: Trypsin can also be used to singularize EpiCs. We recommend using a shorter incubation time and quenching in serum containing medium.\nPrepare quenching medium by adding 2 mL of LaSR medium to a 15 mL conical tube.\nCollect the cell suspension from 2 wells and pool in the conical tube using a P1000.\nNote: Vigorous pipetting is required to disperse the cells since the cells typically detach as sheets. It is acceptable if the cells are not completely singularized at this stage.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nLabel 6 well Matrigel-coated or gelatin-coated plate with hPSC line, hPSC passage number, date, “EpiC P1”, and initials.\nAspirate supernatant from the conical tube. Using a 10 mL pipette, add 12.5 mL of prepared plating medium from step 19c to the cell pellet and resuspend the cells. Transfer 2 mL of the cell suspension to each well of the 6 well plate.\nNote: We recommend splitting at a ratio of 1:3, however up to 1:12 is acceptable.\nReturn the plate to the 37°C, 5% CO2 incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells evenly across the surface of the wells. Troubleshooting 5[href=https://www.wicell.org#sec7.9].\nMaintenance of epicardial cells\nTiming: 1 h (Hands-on time: 30 min) or cryopreservation for step 20\nTiming: 45 min (Hands-on time: 15 min) for step 21\nEpicardial Cell Maintenance.\nDaily, warm LaSR medium at 15°C–25°C for approximately 30 min.",
    "Prepare EpiC maintenance medium by mixing 50 mL of LaSR medium and 2.5 μL of 10 mM A83-01 (TGFβ inhibitor, final concentration of 0.5 μM).\nNote: 50 mL aliquots of LaSR with 0.5 μM A83-01 can be stored for 3–4 days at 4°C.\nDaily, aspirate medium from each well and add 1 mL of LaSR medium supplemented with A8301 to each well of the 6 well plate.\nReturn the plate to the 37°C, 5% CO2 incubator.\nEpicardial cell passaging with Versene.\nWarm LaSR medium and Versene at 15°C–25°C for approximately 30 min.\nObtain a Matrigel-coated or gelatin-coated 6 well plate.\nFor passaging to a single 6 well plate, prepare a conical tube with 6.25 mL of LaSR medium supplemented with 0.31 μL of A83-01 (TGFβ inhibitor, final concentration 0.5 μM).\nNote: We recommend splitting at a ratio of 1:3, however 1:2-1:12 is acceptable.\nNote: If thawing cells, we suggest using 2 mL of media per well of a 6 well plate for better attachment.\nOptional: Add 62.5 μL of FBS of to the medium (final concentration of 1% (vol/vol) FBS). This helps to increase viability and attachment of EpiCs.\nWhen the cells are >90% confluent (usually about 5–8 days after passaging, daily monitoring is necessary), aspirate the medium and add 1 mL of warmed Versene to 2 wells. At this point, 300k–500k cells should be present in each well.\nIncubate the plate at 37°C, 5% CO2 for 8 min.\nNote: Accutase incubation time should be adjusted based on visual observation of the detachment process. If cells do not easily detach from the plate after mechanical dissociation with a pipette tip, cells should be incubated longer the next time EpiCs are passaged. If cells are floating in the Versene before 8 min, EpiCs should be incubated for less time.",
    "Aspirate the Versene. Using P1000, take 1 mL of medium out of the conical prepared in step 21c. Dispense the medium over the surface of the plate, with the tip perpendicular to the plate, until all of the colonies are detached (∼2–3 washes). Vigorous pipetting is required to disperse the cells since the EpiCs tend to detach from the plate in clumps. After the cells are removed from the surface of the well, pool the contents of all wells into the conical tube containing medium.\nAspirate remaining liquid from a fresh Matrigel-coated plate or obtain a fresh gelatin-coated plate. Gently mix the conical tube contents 5–10 times using a 10 mL pipette. Seed 1 mL of the cell suspension into each well of a Matrigel-coated or gelatin-coated 6 well plate.\nReturn the plate to the 37°C, 5% CO2 incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells across the surface of the wells. Troubleshooting 6[href=https://www.wicell.org#sec7.11], Troubleshooting 7[href=https://www.wicell.org#sec7.13], Troubleshooting 8[href=https://www.wicell.org#sec7.15].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig4.jpg\nFigure 4. Brightfield images of passaging H9 hESC-derived EpiCs\nLeft image shows EpiCs immediately prior to Versene passaging and right image shows one day later passaged at a 1:3 split ratio. Scale bar is 200 μm.\nNote: We expect passaged cells to look similar to those shown in Figure 4[href=https://www.wicell.org#fig4].\nNote: hPSC-derived EpiCs can be passaged 15–20 times. If there are significant changes in morphology (e.g., emergence of mesenchymal-like cells), then discard the plate and perform a new differentiation. Passaging cells at a low density may induce mesenchymal transitions.\nDifferentiation of epicardial cells to cardiac fibroblasts\nTiming: 10 days\nTiming: 45 min (Hands-on time: 15 min) for step 22",
    "This step describes differentiation of hPSC-derived EpiCs to CFBs. For detailed characterization of EpiC-FBs, please see (Floy et al., 2021[href=https://www.wicell.org#bib3]). We will describe the differentiation in terms of a confluent 6 well plate of EpiCs, however the differentiation can be adapted for other well plate sizes as shown in Table 1[href=https://www.wicell.org#tbl1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig5.jpg\nFigure 5. Optimization of EpiC-FB differentiation by flow cytometry\n(A-B) Effect of bFGF concentration on TE7 (Cat#CBL271, RRID:AB_93449) expression. Bars represent the average of 3 wells across one differentiation and error bars represent the standard deviation. Black represents 10 ng/mL bFGF and gray represents 75 ng/mL bFGF. One representative differentiation of 3 independent differentiations is shown. Statistics are a two-way ANOVA with Tukey’s post-hoc test where ∗ is p<0.05.\n(C–H) Effect of duration of 10 ng/mL bFGF concentration on WT1 (Cat#Ab89901, RRID:AB_2043201), TE7 (Cat#CBL271, RRID:AB_93449), and VIM (Cat#IC2105G, RRID:AB_2889353) expression. Bars represent the average of 3 wells across one differentiation and error bars represent the standard deviation. One representative differentiation of 3 independent differentiations is shown. Statistics are a one-way ANOVA with Tukey’s post-hoc test where ∗ is p<0.05 and ∗∗ is p<0.01.\nDay EpiCs + 0–9.\nWhen EpiCs are at ∼100% confluency, based on visual observation, begin the fibroblast differentiation. The initiation of fibroblast differentiation is defined as Day EpiC + 0 in this part of the protocol.\nNote: We have successfully differentiated EpiCs at a range of confluencies from 50%-100%.\nWarm LaSR at 15°C–25°C for approximately 30 min.\nPrepare medium by adding 5 μL of 0.1 mg/mL bFGF (final concentration of 10 ng/mL) to 50 mL of LaSR.\nNote: LaSR containing bFGF can be stored at 4°C for 3–4 days. We do not recommend longer storage as bFGF degrades at 15°C–25°C.",
    "Aspirate medium from EpiCs and treat them with 1 mL of LaSR medium containing 10 ng/mL bFGF daily.\nNote: We optimized this differentiation protocol by treating EpiCs with 10 ng/mL bFGF or 75 ng/mL bFGF (Figure 5[href=https://www.wicell.org#fig5]). We did not observe a difference in percentage cells staining positive with TE7 or mean TE7 fluorescence intensity by flow cytometry between treatment with 10 ng/mL bFGF and 75 ng/mL bFGF over 3–10 days of treatment. Additionally, we observed an increase in TE7 staining and VIM expression by flow cytometry across 10 days of 10 ng/mL bFGF treatment but additional treatment out to 14 days did not significantly increase TE7 staining. Therefore, we suggest differentiation with 10 ng/mL bFGF for 10 days.\nReturn the plate to the 37°C, 5% CO2 incubator.\nMaintenance of epicardial-derived cardiac fibroblasts\nTiming: 1 h (Hands-on time: 30 min) for step 23\nTiming: 45 min (Hands-on time: 15 min) for step 24\nPassaging of EpiC-FBs (Day EpiC + 10, etc.).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig6.jpg\nFigure 6. Brightfield images of H9 EpiC-FBs\nLeft image shows EpiC-FBs immediately prior to Accutase passaging and right image shows one day after passage at a 1:6 split ratio. Scale bar is 200 μm.\nPause point: EpiC-FBs at Day EpiC + 10 or any passage afterward can be stored in liquid nitrogen for long periods of time.\nNote: Passaging is usually required every 4–6 days if EpiC-FBs are passaged at a 1:6 split ratio. After thawing, EpiC-FBs typically take 8–10 days to reach confluence. In 3 independent differentiations, we observed senescence after ∼60 days (15 passages).\nNote: We expect passaged EpiC-FBs to exhibit morphology similar to the cells shown in Figure 6[href=https://www.wicell.org#fig6].\nWarm FibroGRO medium containing 2% (vol/vol) FBS at 15°C–25°C for approximately 30 min.",
    "Add 1 mL of Accutase to one well of a 6 well plate of day 10 EpiC-FB cells. Incubate at 37°C, 5% CO2 for 10 min.\nNote: Trypsin can also be used to singularize EpiC-FBs. We recommend using a shorter incubation time.\nPrepare quenching medium by adding 1 mL of FibroGRO medium containing 2% (vol/vol) FBS to a conical tube.\nHarvest Accutase cell suspensions using a P1000 and combine the Accutase cell suspension with the quench medium.\nNote: Vigorous pipetting is required as cells tend to detach in clusters.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nLabel a 6 well tissue culture plate (uncoated) with hPSC line, hPSC passage number, EpiC passage number, EpiC-FB passage number, date, and initials.\nAspirate the supernatant from the conical tube. Using 10 mL pipette, resuspend the cell pellet in 12 mL of FibroGRO medium containing 2% (vol/vol) FBS. Transfer 2 mL of cell solution to each well of the uncoated 6 well tissue culture plate.\nNote: We do not recommend a lower split ratio than 1:6 as the cells will quickly become confluent. A 1:12 split ratio is also acceptable.\nNote: We recommend replating approximately 66k cells (approximately a 1:6 split ratio) in each well of a 6 well plate.\nReturn the plate to the 37°C, 5% CO2 incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells across the surface of the wells. Troubleshooting 9[href=https://www.wicell.org#sec7.17].\nEpicardial-derived fibroblast maintenance.\nWarm FibroGRO medium containing 2% (vol/vol) FBS at 15°C–25°C for approximately 30 min.\nIf cells are below 70%–80% confluent, aspirate medium and add 2 mL of FibroGRO medium containing 2% (vol/vol) FBS to each well every 2 days. Otherwise, passage as described in the previous section.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig7.jpg",
    "Figure 7. Testing media formulations for maintaining hPSC-FBs. H9 EpiC-FBs were seeded at 5,200 cells per well of a 96 well plate\nImmunostaining of H9 EpiC-FBs for vimentin (green, Cat#IC2105G, RRID:AB_2889353) with Hoechst nuclear counterstain (blue) were taken 3 days after seeding cells from thaw are shown where a) FibroGRO containing 2% (vol.vol) FBS b) FibroGRO without FBS c) FibroGRO without FBS with 0.5 μM A83-01 d) FibroGRO without FBS, with 10% (vol/vol) knockout serum replacement e) RPMI f) RPMI with 2% (vol/vol) B27 with insulin supplement g) RPMI with 2% (vol/vol) B27 with insulin supplement and 10 ng/mL bFGF h) RPMI with 5 μg/mL insulin, 10 ng/mL bFGF and 3.75% (vol.vol) GlutaMAX i)RPMI with 2% (vol/vol) B27 with insulin supplement and 3.75% (vol/vol) GlutaMAX j) RPMI with 10 ng/mL bFGF and 5 μg/mL insulin k) RPMI with 10% (vol/vol) knockout serum l)RPMI+GlutaMAX. Examples of one representative differentiation out of 3 independent differentiations are shown in H9 or 19-9-11 hPSC lines. Scale bar is 100 μm.\nNote: Maintenance of EpiC-FBs in medium containing higher percentages of serum increased cell size, a marker associated will FB stress. Removal of serum significantly reduced proliferation of EpiC-FBs (Figure 7[href=https://www.wicell.org#fig7]). Hence, we recommend using FibroGRO medium containing 2% (vol/vol) FBS as the maintenance medium.\nReturn the plate to the 37°C, 5% CO2 incubator. Troubleshooting 10[href=https://www.wicell.org#sec7.19].\nDownstream assays\nTiming: 2 days (Hands-on time: first day 1 h, second day 30 min with additional time for imaging) for step 25\nTiming: 2 days (Hands-on time: first day 1 h, second day 1 h with additional time for analyzing flow cytometry samples) for step 26\nTiming: 1–3 days (Hands-on time: 3 h) for step 27\nThese steps describe immunofluorescence microscopy, flow cytometry, and qPCR as quality control metrics for a successful EpiC-FB differentiation.\nImmunofluorescence microscopy.",
    "Note: These steps describe immunofluorescent analysis of fibroblast marker expression via imaging. We recommend plating EpiC-FBs in a 96 well plate for immunofluorescence analysis with 3 well replicates for each staining condition. We suggest including EpiCs and undifferentiated hPSCs as staining controls. If staining for ECM proteins, we recommend using an empty well as a negative control as Matrigel contains ECM proteins that may be bound by the antibodies.\nNote: Immunofluorescence can be performed on slides or other well sizes. For a 48 well plate, we recommend using a volume of 100 μL. For a 24 well plate, we recommend using a volume of 150 μL. For a 12 well plate, we recommend using a volume of 300 μL. We do not suggest using a larger plate size since this would require a large amount of antibody.\nAspirate medium from the 96 well immunofluorescence plate. Fix cells by adding 50 μL of 4% PFA to each well and incubate at 15°C–25°C for 10 min. Alternatively, fix by adding 50 μL of ice-cold methanol to each well and incubating for 5 min at 15°C–25°C.\nAspirate PFA or methanol solution from the cells.\nPause point: If desired, 50 μL/well DPBS can be added to the fixed plates and plates can be sealed with Parafilm for storage at 4°C. We recommend not storing plates more than a few days prior to staining and imaging.\nAdd 50 μL of blocking solution (0.4% (wt/vol) dry milk in 0.1% (vol/vol) Triton X-100 in DPBS or 0.5% (wt/vol) BSA in 0.1% (vol/vol) Triton X-100 in DPBS) to each well. Incubate for 1 h at 15°C–25°C or 8–24 h at 4°C.\nPrepare primary antibody solutions by diluting antibodies in the blocking buffer according to the key resources table[href=https://www.wicell.org#key-resources-table].",
    "Note: We recommend preparing a slight excess in volume of primary and secondary antibody solution as it is important to treat all wells with the same amount of antibody. We also recommend preparing at least 500 μL of antibody solution.\nAfter blocking, aspirate blocking solution and add 50 μL of primary antibody solution to each well. Incubate at 15°C–25°C for 1 h or 4°C for 8–24 h. We recommend staining with conjugated antibodies (e.g., VIM) at the same time as the secondary antibodies to prevent photodegradation of the fluorophore.\nAfter incubation, aspirate the primary antibody solution from each well and wash each well 3 times with >50 μL of DPBS.\nPrepare secondary antibody solutions by diluting antibodies in the blocking buffer according to the key resources table[href=https://www.wicell.org#key-resources-table].\nAspirate the DPBS wash and add 50 μL of secondary antibody solution to each well. Incubate in the dark at 15°C–25°C for 1 h or 4°C for 8–24 h.\nAspirate antibody solution and wash each well with >50 μL of DPBS.\nAspirate the DPBS wash and add 50 μL of Hoechst solution to each well. Incubate in the dark at 15°C–25°C for 5 min.\nNote: Incubating for 10–15 min is acceptable; it will increase the brightness of the Hoechst staining. For image quantification, we suggest that incubation time is kept consistent between experiments.\nAspirate Hoechst solution. Add 50 μL DPBS to each well to keep wells from drying out.\nImage on a fluorescence microscope.\nProcessing of immunostaining results can be done in the Fuji or similar software.\nNote: We suggest imaging on an epifluorescence or confocal microscope at 20× or higher magnification to be able to visualize antibody localization.\nNote: Expected immunofluorescence results for selected fibroblast markers are shown in Figure 8[href=https://www.wicell.org#fig8].",
    "Pause point: Immunostained plates sealed in Parafilm and wrapped in aluminum foil can be stored at 4°C for several days to several weeks depending on the brightness of the stain. We recommend imaging plates as soon as possible.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig8.jpg\nFigure 8. Example immunofluorescence results for EpiC and EpiC-FB differentiations\nExample immunofluorescence results of H9 hESC-derived EpiC and H9 hESC-derived EpiC-FB differentiations for WT1 (green, Cat#Ab89901, RRID:AB_2043201), FN (red, Cat#Sc-8422, RRID:AB_627598), FSP1 (green, Cat#ABF32, RRID:AB_11203822), CD90 (red, Cat#328102, RRID:AB_940393), VIM (green, Cat#IC2105G, RRID:AB_2889353), and TE7 (red, Cat#CBL271, RRID:AB_93449). Blue represents nuclear Hoechst staining. Scale bar is 100 μm.\nFlow cytometry.\nNote: These steps describe flow cytometry to assess fibroblast differentiation efficiency. Flow cytometry can be performed at P1 or any subsequent passage. We suggest using between 0.3 M-0.5 M cells from each sample for a given staining condition and using 3 well replicates from a given differentiation.\nSingularize cells using Accutase to detach the cells from the substrate. Follow steps 9b–9h to singularize hPSCs, steps 16d–16i to singularize CPCs, steps 19d-19g to singularize EpiCs, and steps 23b–23e to singularize EpiC-FBs. We recommend using 1 mL/well (6 well plate) or 0.5 mL/well (12 well plate) of Accutase and incubating for 5 min (undifferentiated hPSCs), 8 min (EpiCs), or 10 min (EpiC-FBs) at 37°C, 5% CO2. We recommend moving the plate and checking if cells are detaching; longer exposure to Accutase may be necessary if cells remain attached.\nPrepare a 15 mL conical tube for each sample with equal volume D-MEM/F-12 to volume Accutase used for quenching. Label each tube.\nTransfer Accutase cell suspension into the appropriate conical using a P1000.\nCount the total number of cells in each conical using a hemocytometer.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.",
    "Aspirate the supernatant and add 1 mL of 1% (wt/vol) PFA to each conical and resuspend the pellet using a P1000. Incubate at 15°C–25°C for 20 min to fix the cells.\nNote: Fixation for between 5-20 min is acceptable.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nAspirate the supernatant and resuspend cells in 1 mL/tube of ice cold 90% (vol/vol) methanol in water to allow for permeabilization and analysis of intracellular targets.\nPause point: Store samples at −20°C prior to antibody staining if necessary. Samples can be store at least up to one month for highly expressed proteins.\nTo perform antibody staining and flow cytometry analysis, aliquot 0.3–0.5 M cells in a 15 mL conical. Label the conical tube appropriately.\nAdd 2 mL of Flow buffer 1 to each tube.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nAspirate the supernatant and resuspend the pellet in 2 mL of Flow buffer 1. Centrifuge the cells at 200 × g for 5 min at 15°C–25°C. Repeat the Flow buffer 1 wash.\nPrepare 100 μL/sample of primary antibody solution in Flow buffer 2 according to the key resources table[href=https://www.wicell.org#key-resources-table].\nAspirate the supernatant and resuspend the pellet in 100 μL of primary antibody solution.\nIncubate samples at 15°C–25°C for 1 h or 4°C for 8–24 h.\nFollowing incubation, add 2 mL of Flow buffer 1 to each tube.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nPrepare 100 μL/sample of secondary antibody solution in Flow buffer 2 according to the key resources table[href=https://www.wicell.org#key-resources-table].\nAspirate the supernatant and resuspend the pellet in 100 μL of secondary antibody solution.\nIncubate samples in the dark for at least 30 min at 15°C–25°C.",
    "Aspirate the supernatant then add 2 mL of Flow buffer 2 to resuspend cells. Centrifuge the cells at 200 × g for 5 min at 15°C–25°C. Repeat the Flow buffer 2 wash.\nAspirate the supernatant then resuspend the cell pellet in 300 μL Flow buffer 1. Transfer the samples to 5 mL flow cytometry round bottom tubes.\nNote: We recommend using flow cytometry tubes that have a filter in the lid. This allows for easy filtration at this step immediately prior to flow analysis.\nNote: The cell pellet can be resuspended in a volume range from 200-500 μL depending on the desired cell flowrate though the cytometer.\nKeep samples on ice until performing flow cytometry.\nAnalyze by flow cytometry according to instrument instructions.\nProcessing of flow cytometry data can be done in the FlowJo or similar software.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig9.jpg\nFigure 9. Example flow cytometry results for EpiC and EpiC-FB differentiations\nFor WT1 (Cat#Ab89901, RRID:AB_2043201), EpiCs were gated as positive compared to the EpiC-FB population. By these gates, 90% of the EpiCs and less than 1% of the EpiC-FBs expressed WT1. For VIM (Cat#IC2105G, RRID:AB_2889353) and TE7 (Cat#CBL271, RRID:AB_93449), undifferentiated hPSC samples were used as a negative control compared to EpiC-FBs to determine appropriate gating. By these gates, 99% of the EpiC-FBs and less than 2% of the undifferentiated samples expressed VIM. Additionally, 83% of the EpiC-FBs and less than 1% of the undifferentiated samples expressed TE7.\nNote: We recommend collecting at least 10,000 events. For controls, we recommend including samples that express and do not express the marker of interest such as primary cardiac fibroblasts and hPSCs. Isotype controls or no primary controls can be used in addition to validate gating strategies.\nNote: Expected flow cytometry results are shown in Figure 9[href=https://www.wicell.org#fig9].\nqPCR.",
    "Note: These steps describe qPCR for cardiac markers (GATA4, TBX18, and TBX20) in the hPSC- derived fibroblast populations compared to housekeeping gene GAPDH. Primer sequences are shown in the key resources table[href=https://www.wicell.org#key-resources-table]. We recommend using at least one confluent well of a 6 well plate of hPSCs, EpiCs, or EpiC-FBs for qPCR analysis per sample. Additionally, we recommend using 3 well replicates from each differentiation. From mRNA extractions, expected yield of one confluent well of a 6 well plate is 40 μL at 100–200 ng/μL for hPSCs, 100–200 ng/μL for EpiCs, and 100–200 ng/μL for EpiC-FBs.\nSingularize cells using an Accutase lift. Follow steps 9b–9h to singularize hPSCs, steps 16d–16i to singularize CPCs, steps 19d–19g to singularize EpiCs, and steps 23b–23e to singularize EpiC-FBs. We recommend using 1 mL/well (6 well plate) or 0.5 mL/well (12 well plate) and incubating for 5 min (undifferentiated hPSCs), 8 min (EpiCs), or 10 min (EpiC-FBs) at 37°C, 5% CO2. We recommend shaking the plate and visually checking if cells are lifting; longer exposure to Accutase may be necessary if cells are attached.\nPrepare a 15 mL conical tube for each sample with equal volume D-MEM/F-12 to volume Accutase used. Label each tube.\nTransfer the Accutase cell solution to the appropriate conical tubes using a P1000.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.\nAspirate the supernatant.\nOptional: Freeze the cell pellet at −80°C prior to mRNA extraction for at least 1 h.\nPause point: Cell pellets can be stored at −80°C for several months prior to extraction. We recommend only storing cell pellets for about a week before RNA extraction to minimize RNA degradation.\nExtract mRNA using a commercially available kit (e.g., Qiagen RNeasy kit) according to manufacturer’s instructions, including the optional DNase treatment (Qiagen).",
    "Critical: At this stage the mRNA is very susceptible to degradation. Clean gloves well using ELIMINase decontaminant. Take care to not contaminate samples.\nCritical: Change pipette tips between every sample. Do not cross contaminate RNA samples or contaminate the stock reagents with RNA.\nNote: Although we suggest using a Qiagen mRNA extraction kit and DNAse kit, other similar kits are acceptable. We strongly recommend DNAse treatment as this will remove genomic DNA.\nQuantify mRNA using Nanodrop spectrophotometer. Ensure that A260/A280 peak ratio is approximately 2, and A230/A280 is approximately 2 to verify mRNA quality.\nNote: A low 260/280 peak suggests that the sample has deteriorated or that there is DNA contamination and a 230/280 peak that is far from 2 is indicative of organic contaminants.\nStore mRNA at −80°C.\nPause point: mRNA can be stored at −80°C for over a year if freeze-thaw cycles are avoided. We recommend thawing mRNA on ice.\nReverse transcribe 1,000 ng mRNA into cDNA using Omniscript Reverse Transcriptase kit (Qiagen) and Oligo(dT)20 Primers (Life Technologies) according to manufacturer’s instructions.\nCritical: Clean gloves well using ELIMINase decontaminant. Take care to not contaminate samples.\nNote: Although we suggest using a Qiagen Reverse Transcriptase kit, other similar kits are acceptable.\nStore cDNA at −80°C until qPCR analysis.\nNote: cDNA can be stored for over a year at −80°C. Try to avoid freeze-thaw cycles. If a significant change in Ct values is observed over time, then prepare new cDNA as this likely is due to degradation of the cDNA.\nDilute primers (sequences in the key resources table[href=https://www.wicell.org#key-resources-table]) to 100 nM in DNA/RNA free water. Prepare working aliquots of 10 μL 100 nM forward primer, 10 μL 100 nM reverse primer, and 180 μL DNA/RNA free water in a conical tube. We recommend storing primers at −20°C.",
    "To perform qPCR, prepare reaction mixtures in a microcentrifuge tube with 1 μL primer mixture, 10.5 μL DNA/RNA free water, and 12.5 μL PowerUP Sybr Master Mix per desired reaction. We recommend performing technical replicates of each sample. A reference gene should be included; we recommend GAPDH.\ntable:files/protocols_protocol_1540_25.csv\nPipette 24 μL of reaction mix into each well and add 1 μL of cDNA. We suggest adding cDNA to the side of the well.\nCritical: It is critical to add exactly the same amount of primer mix and cDNA to every well.\nCritical: Change pipette tips between every well.\nCarefully cover the qPCR plate with the cover seal. We recommend going over the cover with a scraper. When the cover secured, tear along edges of cover to remove excess flap.\nCentrifuge briefly so that the reaction mixture is pooled at the bottom of each well. We recommend 50 × g for 10 s. Turn on the qPCR machine and load the plate.\nRun samples using the program shown in Table 3[href=https://www.wicell.org#tbl3].\ntable:files/protocols_protocol_1540_26.csv\nAfter performing qPCR, store the plate at −20°C. The products can be separated and visualized on an agarose gel if desired to verify product size and that there was only one product amplified.\nTo analyze, average technical replicate Ct values. There should be less than 0.5 Ct difference between technical replicates. Similar quality control can be performed by checking the melting curves. Quantify relative expression using ΔΔCt and perform appropriate statistical analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig10.jpg\nFigure 10. Example qPCR results for expression of GATA4, TBX18, and TBX20 in an H9 EpiC-FB differentiation\nDots are the average of 2 technical replicates and each dot is representative of a well in the differentiation where relative expression is calculated compared to GAPDH using the ΔΔCt method.",
    "2  − ΔΔ C t   =  2   C  t  c o n t r o l   − C  t interest    C  t  h o u s e k e e p e r  c o n t r o l   − C  t  h o u s e k e e p e r  interest       \nNote: Expected qPCR results are shown in Figure 10[href=https://www.wicell.org#fig10].\nDownstream assay: Fibroblast stress activation\nTiming: 4 days\nTiming: 1 h (Hands-on time: 30 min) for step 28\nTiming: 45 min (Hands-on time: 15 min) for step 29\nThese steps detail how to analyze fibroblast stress fiber activation after treatment with serum and TGFβ1. Stress fiber activation is quantified by flow cytometry for SMA expression. Additional activation media such as activation by Angiotensin-II are described in (Floy et al., 2021[href=https://www.wicell.org#bib3]). We recommend performing this assay in a 6 well plate with at least 3 wells per condition as a smaller plate size may not yield a sufficient number of cells for flow cytometry analysis.\nFibroblast activation Day 0, seeding of EpiC-FBs for fibroblast activation assay.\nWarm FibroGRO medium containing 2% (vol/vol) FBS at 15°C–25°C for approximately 30 min.\nAdd 1 mL of Accutase to one well of a 6 well plate of day 10 EpiC-FB cells. Incubate at 37°C, 5% CO2 for 10 min.\nNote: Trypsin can also be used to singularize EpiC-FBs. We recommend using a shorter incubation time with Trypsin.\nPrepare quenching medium by adding 1 mL of FibroGRO medium containing 2% (vol/vol) FBS to a conical tube.\nHarvest Accutase cell suspensions using a P1000 and combine the Accutase cell suspension with the quench medium.\nNote: Vigorous pipetting is necessary as cells tend to detach in clusters.\nCentrifuge the cells at 200 × g for 5 min at 15°C–25°C.",
    "Label an uncoated 6 well tissue culture plate with hPSC line, hPSC passage number, EpiC passage number, EpiC-FB passage number, date, and initials.\nAspirate the supernatant from the conical tube. Using a 10 mL pipette, resuspend the cell pellet in 12 mL of FibroGRO medium containing 2% (vol/vol) FBS. Transfer 2 mL of cell solution to each well of the labelled 6 well tissue culture plate.\nNote: We recommend replating approximately 66k cells (approximately a 1:6 split ratio) in each well of a 6 well plate.\nReturn the plate to the 37°C, 5% CO2 incubator after plating the cells. Move the plate in 3 quick, short, back-and-forth and side-to-side motions to disperse the cells across the surface of the wells.\nFibroblast activation Day 2.\nTwo days after seeding the EpiC-FBs, warm FibroGRO medium containing 2% (vol/vol) FBS and D-MEM/F-12 containing 10% (vol/vol) FBS at 15°C–25°C for approximately 30 min.\nPrepare a conical tube containing 6 mL of D-MEM/F-12 containing 10% (vol/vol) FBS.\nAdd 40 μL of 15 μg/mL TGFβ1 (final concentration of 100 ng/mL) to the conical tube.\nAspirate the medium from the EpiC-FBs. Add 2 mL/well of FibroGRO to 3 wells. Add 2 mL/well of D-MEM/F-12 containing 10% FBS and 100 ng/mL TGFβ1 to the remaining 3 wells.\nReturn the plate to the 37°C, 5% CO2 incubator.\nFibroblast activation assay day 4.\nTwo days later, analyze activation potential by flow cytometry analysis for SMA expression following step 26.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1540-Fig11.jpg\nFigure 11. Example fibroblast activation flow cytometry results",
    "19-9-11 EpiC-FBs were treated with FibroGRO maintenance medium (F), D-MEM/F-12 containing 10% (vol/vol) FBS (D), or D-MEM/F-12 containing 10% (vol/vol) FBS and 100 ng/mL TGFβ1 for two days prior to flow cytometry analysis for SMA (Cat#MA5-11544 RRID: AB_10981631) expression. Shown are the flow cytometry gating strategy using undifferentiated hPSCs and no primary negative controls, percentage SMA+ cells and normalized median FSC-A. Statistics are a one-way ANOVA with Dunnett’s post-hoc test comparing to FibroGRO conditions where ∗ is p<0.05 and ∗∗ is p<0.01.\nNote: An example of flow cytometry data after EpiC-FB activation is shown in Figure 11[href=https://www.wicell.org#fig11]. We typically see little variability between wells of a given differentiation. However, basal activation level and degree of activation between differentiations varies significantly as described in (Floy et al., 2021[href=https://www.wicell.org#bib3])."
  ],
  "subjectAreas": [
    "Stem Cells",
    "Microscopy",
    "Flow Cytometry",
    "Cell Biology",
    "Developmental Biology",
    "Cell Differentiation",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}