{
  "id": 10722,
  "origin_website": "Jove",
  "title": "Intraductal Delivery to the Rabbit Mammary Gland",
  "procedures": [
    "Procedures using animal subjects have been approved by the Institutional Animal Care and Use Committee of the University of Texas at Austin.\n1. Preoperative Preparation\nRecord the body weight of each rabbit. As with all preclinical studies, monitor animal weights regularly to assess potential toxicity.\nPrior to anesthetizing the rabbit, fill a 50 mL conical tube with commercially available ultrasound gel and spin at 500 x g for 30 s; there should be no visible bubbles in the gel upon completion of the centrifugation.\nAdminister glycopyrrolate subcutaneously at a dose of 0.1 mg/kg and acepromazine intramuscularly at a dose of 0.75 mg/kg. Wait 15-20 min for the sedative to take effect while monitoring vital signs and behavior.\n\tNOTE: Glycopyrrolate is an anti-cholinergic agent that prevents bradycardia and reduces respiratory and GI secretions. Acepromazine is a sedative that serves as a premedication for anesthesia.\nAdminister 35 mg/kg of ketamine and 5 mg/kg of xylazine subcutaneously as an anesthetic. However, as the operator becomes more experienced and can accomplish the intraductal delivery more rapidly, decrease the drug dosages to 15 mg/kg of ketamine and 3 mg/kg of xylazine subcutaneously; this will shorten the anesthesia time and the time required for the animal to recover from anesthesia.\nCheck and document the heart rate, SPO2, temperature, respiratory rate, and mucus membrane color every 15 min. Apply eye lubricant to both eyes.\n\tNOTE: Only personnel who have undergone appropriate training and have been approved by their institution's IACUC should administer or monitor anesthesia. The use of a veterinary anesthesia monitor can aid in acquiring vital signs and is recommended. The veterinary anesthesia monitor, however, does not replace the need to manually check the animal every 15 min. See the manufacturer's instructions for the proper use of a veterinary monitor.",
    "Verify the onset of anesthesia by a gentle toe pinch; the rabbit should be non-responsive before continuing.\nCarefully shave the caudal abdomen of the rabbit in the area around the third and fourth pairs of inguinal teats.\nWith the majority of the hair removed, apply an over-the-counter hair removal cream to the shaved area. Remove the cream 10 min after application using damp paper towels wetted with warm water.\n\tNOTE: Rabbit skin is very fragile/sensitive. The hair removal cream should be used for no more than 10 min. In fact, it is safer to try a “test spot” at 5 min and only leave on longer if test spot indicates a longer time period is needed.\nWipe the area with alcohol-soaked gauze pads to clean the injection site.\nPlace the rabbit on its dorsum in a v-shaped trough lined with a recirculating warm water blanket and an absorbent pad.\n2. Preparation of the Contrast Agent\nReconstitute the non-targeted contrast reagent according to the manufacturer's instructions. Pipette up and down gently to mix.\n\tNOTE: The contrast agent used in this protocol is stable at room temperature for 4 - 6 h after reconstitution. Gently rock the vial between each retrieval.\n\tNOTE: The volume of solution required will depend on the number of ducts to be injected. The rabbit has 4 ductal openings per teat, and 0.2 mL of solution is sufficient to fill one ductal tree of an adult New Zealand White Rabbit (Oryctolaguscuniculus). Thus, a total volume of 0.8 mL may be delivered to one mammary gland.\n3. Intraductal Delivery\nLocate the appropriate teats to be injected; the 3rd and 4th pairs of inguinal teats are recommended, as they are easily visualized when the animal is positioned on its dorsum.",
    "Load 0.2 mL of sterile 0.9% saline into a 1 mL Luer-lock tuberculin syringe with a 22 G needle. Properly dispose of the 22 G needle once the saline is in the syringe and replace it with a sterile 25-gauge needle. Gently wipe the area with 85% isopropyl alcohol on a gauze pad.\nWith the bevel of the needle up and the syringe parallel to the body of the animal, insert the bevel of the needle into the side of the teat and slowly inject 0.1-0.2 mL of saline; this will allow for better visualization of the ductal openings.\nLoad 0.2 mL of injection solution into a 1 mL Luer-lock tuberculin syringe.\nHold the teat gently with the thumb and index finger and lift it slightly to position it for the intraductal injection; a wearable ocular loupe may aid in visualizing the ductal openings.\nWhile maintaining the lifted position of the teat, carefully cannulate the duct of interest using a 25 G blunt-tip needle.\nAfter cannulation, gently twist the Luer-lock syringe on the hub of the blunt-tip infusion needle until it is locked in place.\nLift the teat and inject the solution slowly to minimize potential damage caused by rapidly moving fluid within the duct; at no time should there be resistance when injecting the solution.\n4. Ultrasound Imaging\nApply a liberal amount of centrifuged ultrasound gel to the skin of the area of interest. Ensure that there are no bubbles in the gel, as these will compromise the image quality.\nSet the imaging depth to 6 mm. Place the 21-MHz transducer in contact with the gel and scan the area of interest in B-mode. Observe the contrast medium in the scanned region including the ductal opening and throughout the duct.",
    "NOTE: These settings have been developed for use with a specific photoacoustic ultrasound machine. Refer to the Table of Materials for more details. It may be necessary to adjust the transmit power and imaging depth of other imaging systems to optimize mammary gland visualization.\nRemove the ultrasound gel from the animal's skin with a gauze pad.\n5. Postoperative Care\nObserve the injection site: there should be no signs of trauma to the teat region or to the surrounding tissue, and swelling in the area surrounding the teat likely indicates a mammary fat pad injection rather than a successful intraductal injection.\nPlace the rabbit in a sternal position. If needed, give 0.2 mg/kg of yohimbine intravenously to the marginal ear vein; this will reverse the effect of the xylazine and allow the animal to recover more quickly from anesthesia.\nMonitor the rabbit every 15 min throughout the recovery period until the animal is alert, responsive, and maintains a sternal position.\n\tNOTE: This procedure should not result in tissue damage or swelling. If redness or swelling are observed, administer a dose of meloxicam 0.1-0.2 mg/kg PO once the animal is alert and able to take medication orally. Contact the institution's veterinary staff for further guidance.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}