{
  "id": 13138,
  "origin_website": "Jove",
  "title": "Generation, Maintenance, and Characterization of Human Pluripotent Stem Cell-derived Intestinal and Colonic Organoids",
  "procedures": [
    "1. Generation of human intestinal and colonic organoids\nPreparing ECM-coated plates\n\t\nAdd 50 mL of cold DMEM medium into a 50 mL conical tube.\nRemove an aliquot of 4x hESC-qualified ECM (see the Table of Materials) from the -80 °C freezer and thaw on ice.\n\t\tNOTE: Refer to the product's certificate of analysis to determine the volume of ESC-qualified ECM required to prepare a 4x stock.\nIf hESC-qualified ECM is not fully thawed, take 750 µL of DMEM from the 50 mL conical tube and mix it with the ECM.\nTransfer the DMEM/hESC-qualified ECM mixture to the 50 mL conical tube with DMEM and mix well. Add 0.5 mL per well into each of 4 x 24-well cell culture plates.\nShake the plates to spread the ECM evenly throughout the well to ensure that the entire surface is covered. Using parafilm, seal the ECM-coated plates and leave them at room temperature in a biosafety cabinet for at least 1 h. Store ECM-coated plates at 4 °C for up to 2 weeks or until needed.\nhPSCs single-cell plating\n\t\nPlace an ECM-coated 24-well plate inside a biosafety cabinet for 30 min to allow it to reach room temperature.\nPlace mTeSR1 complete medium, cell detachment solution, and advanced DMEM inside a 37 °C water bath and allow them to warm up for 30 min.\nVerify that hPSCs are at least 85% confluent with minimal differentiation. Remove any differentiated cells if necessary.\nPrepare the plating medium in a 50 mL conical tube as follows: 13 mL of mTeSR1 and 13 µL of 10 mM Y-27632 Rho-associated protein kinase (ROCK) inhibitor.\n\t\tNOTE: Y-27632 inhibits anoikis and increases the survival of single cells.",
    "To collect cells from a 6-well plate, aspirate the medium from 3 to 4 wells and wash once with 2 mL of advanced DMEM per well.\nAspirate the advanced DMEM and dispense 1 mL of the cell dissociation solution into each well. Incubate the plate for 5-7 min inside a 5% CO2, 37 °C incubator. Check under the microscope that cells are in suspension.\nDissociate any remaining clumps of cells by pipetting up and down 4-5 times using a 5-mL pipette.\nAdd 2 mL of advanced DMEM into each well, gently pipette up and down 4-5 times, and transfer to a 15 mL conical tube. Spin down the cells at 300 × g for 3 min at room temperature.\nAspirate the medium from the tube without aspirating the cell pellet and add 6 mL of the prepared medium of mTeSR1 plus ROCK inhibitor. Gently resuspend the cells by pipetting up and down 3-4 times and then transfer the suspension to the rest of the mTeSR1/ROCK inhibitor medium inside the 50 mL tube. Resuspend vigorously 4-5 times and count the cells using a hemacytometer.\nAspirate the ECM from the 24-well plate just before plating the cells. Resuspend the cells again by pipetting up and down 2-3 times and dispense 0.5 mL of the cell suspension in each well.\n\t\tNOTE: The optimal plating density needs to be determined by the experimenter. Here, the optimal cell number is 80,000-200,000 cells per well.\nGently rock the plate 3 times clockwise, 3 times counterclockwise, 3 times forward and back, and 3 times side to side to evenly disperse the cells.\nTransfer the plate to a 37 °C, 5% CO2 incubator and incubate for 24 h.\n\t\tNOTE: Do not disturb the plate for the first few hours to ensure proper dispersal of cells within the wells.",
    "After 24 h (Figure 2A), aspirate the spent medium, add 0.5 mL per well of mTeSR1, incubate again at 37 °C, 5% CO2 for 24 h (Figure 2B), and then proceed to the next step.\nDifferentiation of definitive endoderm (DE) from hPSCs\n\t\nIn a 15 mL conical tube, add 13 mL of Activin Day 1 medium (see the Table of Materials), 13 µL of 100 µg/mL Activin A, and 1.95 µL of 100 µg/mL BMP4. Warm the medium in a 37 °C water bath.\nAspirate the mTeSR1 medium from the 24-well plate and add 0.5 mL of Activin Day 1 medium per well. Place the plate in a 37 °C, 5% CO2 incubator and incubate for 24 h. Check the cells after 24 h.\n\t\tNOTE: Extensive cell death should be apparent, as depicted in Figure 2C. Although the monolayer will appear sparse, colonies of cells will have expanded.\nPrepare Activin Day 2 complete medium by adding 12.5 µL of 100 µg/mL Activin A into 12.5 mL of Activin Day 2 medium in a 15 mL conical tube. Place the tube in a 37 °C water bath.\nTake the 24-well differentiation plate out of the CO2 incubator and remove the spent medium. Dispense 0.5 mL of prewarmed Activin Day 2 medium per well and place the plate back inside the CO2 incubator for 24 h.\n\t\tNOTE: Care should be taken when dispensing the medium. Do not dispense medium directly in the center of the well, as this will detach cells in the monolayer. Carefully dispense medium down the side of the well. The next day, a monolayer of cells is formed with negligible cell death. Cells should now be ~90 to 95% confluent (Figure 2D).",
    "Prepare Activin Day 3 complete medium by adding 12.5 µL of 100 µg/mL Activin A into 12.5 mL of Activin Day 3 medium in a 15 mL conical tube. Place the tube in a 37 °C water bath.\nRemove the spent medium and dispense 0.5 mL of Activin Day 3 medium per well.\n\t\tNOTE: Care should be taken when dispensing medium. Do not dispense medium directly in the center of the well as this will detach cells in the monolayer. Carefully dispense medium down the side of the well. The next day, the monolayer should reach full confluency with little to no cell death at this stage. Do not attempt to generate mid-hindgut spheroids if the monolayer is not confluent 24 h after adding Activin Day 3 medium. Refer to Figure 2E for the ideal morphology of the DE monolayer before proceeding to the generation of mid-hindgut spheroids.\nPerform immunofluorescence (IF) staining of the monolayer for the expression of forkhead box A2 protein (FOXA2) and sex-determining region Y (SRY)-box transcription factor 17 (SOX17) when optimizing DE differentiation.\nDifferentiation of DE into mid-hindgut spheroids\n\t\nIn a 50 mL conical tube, add 25 mL of mid-hindgut induction medium with FGF4 (no CHIR99021) and place it in a 37 °C water bath for 30 min.\nTo prepare the complete mid-hindgut induction medium, add 7.5 µL of CHIR99021 after the medium is warm.\nRemove the spent medium, dispense 0.5 mL of mid-hindgut induction medium per well and incubate at 37 °C, 5% CO2 for 24 h.\nAfter condensation of cells within the monolayer has occurred the next day (Figure 3A), replace the spent medium with fresh mid-hindgut induction medium and place the plate back in a 37 °C, 5% CO2 incubator for 24 h.",
    "NOTE: Tubular structures will be noticeable after 48 h of mid-hindgut induction, as shown in Figure 3B. Mid-hindgut spheroids will start budding off the monolayer on day 3, as depicted in Figure 3C.\nTo avoid discarding the floating spheroids while changing the medium, transfer the old medium into a 15 mL tube and centrifuge at 300 × g for 1 min. Resuspend the spheroids in 12.5 mL of fresh mid-hindgut induction medium, add 0.5 mL per well into the same 24-well plate, and incubate at 37 °C, 5% CO2 for 24 h.\nOn day 4 of hindgut induction (Figure 3D), harvest floating spheroids from the plate wells by collecting the medium into a 15 mL tube followed by centrifugation at 300 × g for 1 min. Proceed to the next step for embedding mid-hindgut spheroids in ECM.\nPlating and patterning of mid/hindgut spheroids in ECM\n\t\nThaw ECM basement membrane matrix at 4 °C overnight before the embedding.\n\t\tNOTE: This ECM is different from the hESC-qualified ECM. The ECM should be put on ice, and the appropriate volume of ECM can be aliquoted into prechilled 1.5 mL microcentrifuge tubes on ice. Table 1 contains information about ECM volume. Ensure that the volume of ECM is at least 75% in the droplet in which the spheroids will be embedded.\nWarm up a 24-well plate in a 37 °C incubator.\nCollect the floating spheroids from all the 24-wells using a 1000 µL pipet and transfer them to a 15 mL conical tube. Spin down the spheroids at 300 × g for 1 min at room temperature. Aspirate most of the medium but leave the volume required for plating (Table 1).\nPrepare 1000 µL and 200 µL pipette tips by cutting their ends. Take out the prewarmed 24-well plate.",
    "Mix the floating spheroids, transfer the appropriate volume to the ECM tube placed on ice, and then resuspend the spheroids and ECM by pipetting to mix them well.\nTake 65 µL of the mixture of spheroids and ECM with the cut 200 µL pipette tips and load to the center of each well in the 24-well plate. To make sure a good ECM droplet is formed, lift the pipet gently and slowly while the mixture is dispensed.\n\t\tNOTE: Plate 30-100 spheroids per well.\nGently transfer the plate to a 37 °C, 5% CO2 incubator and incubate for 5 min.\nFlip the plate upside down and incubate for 15-25 min, which will help the ECM droplets to maintain a dome-like structure.\nDuring the incubation, prepare the required medium and warm it up. Once the ECM is solidified, add 0.5 mL of HIO- or HCO-patterning medium in each well and incubate at 37 °C, 5% CO2. See Figure 3E for an image of spheroids in ECM.\nCulture the spheroids in the patterning medium for 3 days.\nAfter 3 days, change the HIO- or HCO-patterning medium to normal growth medium and incubate at 37 °C, 5% CO2.\n\t\t​NOTE: The organoids at this time point (Day 10) are early-stage organoids. Based on the project goal, some early-stage organoids can be used for early patterning analysis, as detailed in section 2.\nOutgrowth and passaging of human intestinal and colonic organoids\n\t\nAfter day 10, change the growth medium every 3 days.\n\t\tNOTE: Depending on the plating density and the growth of the organoids, more frequent media changes may be required. Medium changes should be done before the phenol red (pH indicator) in the medium becomes yellow.\nIncubate the organoids until Day 21 (Figure 3F).",
    "NOTE: BMP2 treatment will result in a reduced number of organoids (~3-fold less than HIOs) that grow from spheroids. Therefore, a larger number of spheroids needs to be plated for the generation of HCOs.\nSplitting of organoids on Day 21\n\t\nInspect the organoids.\n\t\tNOTE: The organoids need to be split on Day 21 as the ECM is almost degraded by Day 21 due to organoid growth and expansion.\nPrepare the 1000 µL and 200 µL pipette tips by cutting their ends.\nWarm up a 24-well Nunc plate in a 37 °C incubator.\nAliquot the appropriate volume of ECM into the prechilled 1.5 mL tubes (Table 1).\nGently scrape the ECM droplet with the organoids with a 1000 µL pipette tip and pipette the mixture up and down several times to break up the ECM.\nTransfer the mixture to a 60 mm Petri dish and check the organoids under a microscope. If necessary, separate the organoids from each other using sterile forceps. Ensure that the separation does not damage the epithelium of the organoids.\nTransfer the organoids to a 15 mL conical tube and centrifuge at 300 × g for 30 s. Aspirate the supernatant and leave ~1 mL of medium in the tube.\n\t\tNOTE: The volume of the medium can be changed based on the purpose of the experiment. If more organoids are required per ECM droplet, the medium volume can be decreased. However, if fewer organoids are required, the medium volume can be increased.\nMix the organoids well, transfer the appropriate volume to the ECM tube placed on ice, and then resuspend the organoids and ECM by pipetting to mix them well.\nAdd 65 µL of the mixture of spheroids and ECM to the center of each well of the 24-well plate using the cut 200 µL pipette tips.",
    "NOTE: It is critical to take up the organoids first and then the ECM during the pipetting. Thus, while dispensing the mixture, the organoids are at the top of the ECM droplet.\nPut the plate in a 37 °C, 5% CO2 incubator for 5 min.\nFlip the plate upside down for another 15-25 min to help the ECM droplets maintain a dome-like structure.\nAdd 0.5 mL of HIO/HCO outgrowth medium in each well and incubate at 37 °C, 5% CO2.\n\t\tNOTE: Outgrowth medium is the same for both HIOs and HCOs after patterning.\nChange the medium every 2-3 days until Day 35 (Figure 3G).\n2. Verifying the patterning of organoids by reverse-transcription quantitative polymerase chain reaction (RT-qPCR)\nBefore collecting RNA, prepare 1x RNA lysis buffer following the manufacturer's instructions.\nDiscard the spent medium and add 350 µL of lysis buffer to each well of the 24-well plate. Lyse the organoids by pipetting up and down using a 1 mL pipette. For better lysis, vortex briefly at maximum speed for 5 s.\nKeep all samples at -80 °C until ready for RNA extraction. Once ready, remove the RNA samples from the -80 °C freezer and thaw them on ice for 10 min. Vortex the tubes vigorously at room temperature for 10-15 min to ensure complete lysis of the samples.\nPlace the samples on ice again and proceed to RNA extraction as instructed by the manufacturer. Transfer the RNA samples to a -80 °C freezer if not ready to proceed to the next step.\nPerform RNA extraction, DNAse treatment, cDNA synthesis, and RT-qPCR using standard methodology. Refer to Table 2 for a list of primer names and sequences.\n3.​ Verifying the patterning of organoids by immunofluorescence\nCollection and fixation of organoids",
    "Aspirate HIO or HCO medium from the appropriate wells and add 1 mL of ice-cold phosphate-buffered saline (PBS) to each well. Dissociate the organoids from the ECM using a cut 200 µL pipette tip. Pipette up and down to dissociate large chunks of ECM from the organoids.\nTransfer the organoids to a 15 mL conical tube and fill the rest of the tube with ice-cold PBS and mix gently by inverting the tube. Allow the organoids to settle by gravity and aspirate the PBS.\n\t\tNOTE: If the organoids do not settle by gravity, centrifuge at 300 × g for 1 min.\nAspirate the PBS and add 1 mL of ice-cold ECM-degrading solution. Keep the tube on ice for 10-15 min on a rotating platform with gentle shaking.\n\t\tNOTE: Tilt the tube at a 45° angle to allow proper mixing of the organoids and the Cell Recovery Solution. After 10-15 min, the organoids should settle to the bottom of the tube, indicating the complete digestion of the ECM.\nAdd cold PBS in the tube up to 15 mL; mix well by inverting the tube several times. When the organoids settle to the bottom of the tube, aspirate the PBS and add 1 mL of prechilled 4% paraformaldehyde to fix the organoids. Incubate the organoids with 4% paraformaldehyde on ice for 1 h.\nFill the rest of the tube with ice-cold PBS and place it horizontally on a rocking platform at 4 °C overnight. The next day, dispose of the paraformaldehyde/PBS in the specified waste container and wash once with 15 mL of ice-cold PBS, as described in step 3.1.2.\nAspirate the PBS and fill the tube with 30% sucrose in PBS. Place the tube horizontally on a rocking platform at 4 °C overnight.",
    "The next day, embed the organoids in a 7 mm x 7 mm x 5 mm base model with OCT medium and flash-freeze using a dry ice/ethanol bath.\nDry the blocks with laboratory wipes, wrap them in a paper towel, and keep them in a -80 °C freezer overnight. The next day, cut 5 µm sections onto microscope slides using a cryostat. Store the slides at -80 °C.\nImmunofluorescence staining of the organoids\n\t\nProcess the slides from the -80 °C freezer and perform IF staining using standard protocols.\nApply coverslips to the slides and dry them at room temperature, protected from light for at least 2 h or overnight before imaging.\nImage the slides using a 25x objective of a confocal microscope.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}