{
  "id": 10690,
  "origin_website": "Jove",
  "title": "A High-performance Compact Photoacoustic Tomography System for In Vivo Small-animal Brain Imaging",
  "procedures": [
    "All animal experiments were performed according to the guidelines and regulations approved by the Institutional Animal Care and Use Committee of Nanyang Technological University, Singapore (Animal Protocol Number ARF-SBS/NIE-A0263).\n1. System Description\nMount the PLD inside the circular scanner, as shown in Figure 1a. Connect the PLD to the laser driver unit (LDU).\n\tNOTE: The PLD provides ~136-ns pulses at a wavelength of ~803 nm, with a maximum pulse energy of ~1.42 mJ and a repetition rate up to 7 kHz. The laser driving unit (LDU) includes: a temperature controller, a variable power supply, a power supply (12 V), and a function generator; see the Table of Materials. The variable power supply is used to control the laser power, and the function generator is used to change the repetition rate of the PLD.\nSwitch on the PLD laser. Set the PLD repetition rate to \"7,000\" Hz by using the function generator in the LDU. Increase the pulse energy to 1.42 mJ by setting the voltage of the variable power supply to \"3.1\" V.\nMount the optical diffuser (OD) in front of the PLD exit window to make the output beam homogenous, as shown in Figure 1a.\n\tNOTE: Use a diffuser with a fine grit (i.e., 1,500-grit polish).\nMount the focused UST on the UST holder, such that it faces the center of the scanning area, as shown in Figure 1a.\n\tNOTE: The central frequency of the UST is 2.25 MHz, and the focal length is 1.9 in.\nPlace the ultrasound detector inside the acrylic tank, as shown in Figure 1a. Fill the tank with water such that the UST is totally immersed.",
    "NOTE: A water medium is used to couple the photoacoustic signal from the brain (sample) to the UST. An acrylic water tank (WT; see the Table of Materials) was custom-designed for small-animal imaging. The schematic of the water tank design is shown in Figure 1b.\nCheck the PA signal from the sample using a pulser/receiver unit (PRU; see the Table of Materials).\n\tNOTE: These signals were digitized by a 12-bit DAQ card (see the Table of Materials) at a 100 MS/s sampling rate and were saved on a computer.\n2. Animal Preparation for Rat Brain Imaging\nNOTE: The PLD-PAT system described above was demonstrated for imaging small animal brains. For these experiments, healthy female rats (see the Table of Materials) were used.\nAnesthetize the animal by intraperitoneally injecting a cocktail of 2 mL of ketamine, 1 mL of xylazine, and 1 mL of saline (dosage of 0.2 mL/100 g).\nRemove the fur on the scalp of the animal using a hair clipper. Gently apply hair removal cream to the shaved area for further depletion of the fur.\n\t\nRemove the applied cream after 4-5 min using a cotton swab.\nApply artificial tear ointment to the eyes of the animal to prevent the dryness due to anesthesia and laser illumination.\nMount the custom-made animal holder (see the Table of Materials) equipped with a breathing mask (see the Table of Materials) on a lab-jack.\nPlace the animal in prone position on the holder. Secure it to the holder using surgical tape to avoid movement of the animal during imaging.\nEnsure that the breathing mask covers the nose and mouth of the rat to deliver inhaled anesthetic.\n3. In Vivo Rat Brain Imaging",
    "Connect the breathing mask to the anesthesia machine. Switch on the anesthesia machine and set it to deliver 1.0 L/min of oxygen with 0.75% isoflurane.\nClamp the pulse oximeter to its tail to monitor the physiological condition of the animal.\nApply a layer of colorless ultrasound gel to the scalp of the rat. Adjust the lab-jack position to the center of the scanner. The breathing mask is customized to suit the imaging window. 10% of the commercially available nose cone is cut then connected to a piece of glove.\nAdjust the height of the lab-jack manually so that the imaging plane is at the focus of the UST.\nSet the parameters in the data acquisition software (see the Table of Materials) as required. Run the data acquisition software program to start acquisition (i.e., imaging).\n\tNOTE: The program is used to rotate the UST and collect A-line PA signals. The collected A-lines will be saved on the computer.\nObserve the animal during the entire imaging period and proceed to PAT reconstruction after the imaging is complete.\nAfter the data acquisition is over, reconstruct the cross-sectional brain image from the A-lines using the reconstruction software program.\nTurn off the anesthesia system, remove the animal from the stage, return it to its cage, and monitor it until it regains consciousness.\n\tNOTE: For example, if the UST is rotated for 5 s, the PLD delivers 35,000 (= 5 x 7,000) pulses and the UST collects 35,000 A-lines. The 35,000 A-lines are reduced to 500 by averaging over 70 signals (after averaging A-lines = 35,000/70 = 500). Figure 1c illustrates the illumination of the laser pulses and A-line collection. A reconstruction program based on delay-and-sum back projection algorithm should be used.\nimgsrc://cloudfront.jove.com/files/ftp_upload/55811/55811fig1.jpg",
    "Figure 1: Schematics of the PLD-PAT System. (a) Schematic of the PLD-PAT. PLD: pulsed-laser diode, CSP: circular scanning plate, AM: anesthesia machine, M: motor, MPU: motor pulley unit, LDU: laser driver unit, PRU: pulser/receiver unit, UST: ultrasound transducer, WT: water tank, PF: polymer film, and DAQ: data acquisition card. (b) Schematic of the water tank, top view (1) and cross-sectional view (2) for in vivo small-animal brain imaging. A: metric Screw, B: acrylic annular plate, C: silicone \"O\" ring, D: 100 µm-thick, transparent polythene cover. The tank had a 9 cm diameter hole at its bottom and was sealed with an ultrasonically and optically transparent, 100 µm-thick polyethylene membrane. (c) Schematic of the illumination of laser pulses from the PLD and A-lines, collection in a 5 s continuous scan time. Please click here to view a larger version of this figure.[href=http://cloudfront.jove.com/files/ftp_upload/55811/55811fig1large.jpg]Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}