{
  "id": 9036,
  "origin_website": "Jove",
  "title": "Immunohistochemical Analysis in the Rat Central Nervous System and Peripheral Lymph Node Tissue Sections",
  "procedures": [
    "Ethical Statement\nPresent study is performed in accordance with guidelines from the Swedish National Board for Laboratory Animals and the European Community Council Directive (86/609/EEC) under the ethical permits N338/09, N15/10 and N65/10, which were approved by the North Stockholm Animal Ethics Committee.\n1. Tissue Preparation\nPerfusion & fixation\nAnesthetize the animal with isoflurane to perform transcardial perfusion via left ventricle. Initiate the rinsing of vasculature with phosphate buffered saline (PBS) to remove the blood components, followed by 4% paraformaldehyde in 0.1 M PBS (PFA).\nFixate dissected brains, spinal cords and peripheral LN tissue by immersing into PFA. After 24 hr at 4 °C, transfer the tissue from PFA into PBS and store at 4 °C until further processing. Alternatively to commercial PBS, dissolve 9 g NaCl in 250 ml the Sörensen buffer and add 750 ml deionized water (dH2O); to prepare 0.2 M Sörensen buffer (pH 7.4) dissolve 13.8 g NaH2PO4 x 1H2O and 71.2 g Na2HPO4 x 2H2O in 2.5 L dH2O.\nDehydration & embedding\nCut the tissue into approximately 5 mm thick portions by using a razor blade.\nInitiate the tissue hardening process (dehydration) by using the Tissue-TekV.I.P Vacuum Infiltration Processor (standard procedure based on submersion into ascending concentrations of ethanol, followed by xylene and finally paraffin (Table 1).\nPlace the tissue in a mold and pour in the liquid paraffin around the sample to form a \"paraffin block\". Long-term storage requires room temperature (RT). However, prior to sectioning, it is recommendable to cool down the blocks, e.g., overnight (o/n) at 4 °C.\n2. Sectioning",
    "Place the paraffin block into a fixed holder of the sledge microtome, which can move backwards and forwards across the knife. Adjust the optimal angle between the block and the microtome knife (that depends on knife geometry, but also on the cutting speed and technique).\nCut 3 - 5 µm thick cross-sections from the paraffin block.\nTransfer just cut section into a water container and mount it subsequently from the water onto the glass slide.\nPress the mounted section carefully against a paper towel to remove residual water and potential air bubbles. Commercially pre-coated adhesive glass slides are recommendable.\nDry mounted slides for a couple of hours in a stove on 50 - 60 °C.\n3. Deparaffinization (Rehydration & Blocking the Endogenous Peroxidase)\nImmerse the slides 2x into xylene (alternatively xylene substitute XEM-200), each time 15 - 20'.\nRinse in 99% ethanol.\nTo block the endogenous peroxidase activity, incubate the sections for 30' in methanol solution containing 0.25% hydrogen peroxide.\nContinue rehydration by using ethanol with increasing water content (99%, 70%, ending up in distilled water.\nFrom this point until mounting of the cover slips sections have to be kept moist.\n4. Antigen Retrieval\nUse a food steamer for boiling the slides in an antigen retrieval solution (in this case EDTA pH 8.5 buffer) for 60' (EDTA buffer stock solution contains 1.21 g Tris and 0.37 g EDTA dissolved in 50 ml dH2O; to prepare the working solution dilute 2.5ml EDTA stock solution in 47.5 ml dH2O).\nCool down the slides on RT for approx. 1 hr and then rinse 3 - 5x with Tris buffered saline (TBS, use alternatively PBS) consisting of 0.05 M Tris and 0.15 M NaCl; pH 7.5 adjusted with HCl. Alternatively use commercial TBS.\n5. Blocking the Unspecific Binding Sites",
    "To avoid unspecific background reactions, incubate the sections on RT for 30' in the blocking solution containing 10% fetal calf serum (FCS) and 90% DAKO buffer.\n6. Double Immunolabeling: Simultaneous Incubation with the Primary Abs\nDilute required amount of primary antibodies in the blocking solution and incubate o/n at 4 °C. For the double immunostaining combine α-eotaxin (Ccl11; 1:300) with α-Cd68 (Ed1; 1:1,000) or α-Iba1 (Aif1, 1:1,000) or α-Cd8α (Ox-8; 1:200).\nRinse the slides 3-5x with TBS buffer (use alternatively 10x diluted DAKO buffer).\nDilute required amount of secondary antibodies (biotinylated anti-goat and AP-conjugated anti-mouse, both 1:200) in the blocking solution and incubate 1 hr on RT.\nRinse the slides 3 - 5x with TBS buffer (use alternatively 10x diluted DAKO buffer).\nIncubate the slides with avidin-horseradish peroxidase complex (HRP) diluted in the blocking solution for 1 hr on RT.\nRinse the slides 3 - 5x with TBS buffer (use alternatively 10x diluted DAKO buffer).\n7. Visualization\nVisualization of the bound AP-labeled secondary antibody\nPrepare 0.1 M Tris-HCl buffer by dissolving 12.1 g Tris in 1 L dH2O and adjust pH to by using HCl. Use the same Tris-HCl buffer to prepare 1 M levamisole solution. Prepare freshly 4% NaNO2 solution in dH2O.",
    "To obtain 50 ml of the Fast Blue (FB) substrate (volume required for one standard glass cuvette) dissolve 6.25 mg Naphtol-AS-MX-Phosphate in 312.5 µl DMF in the glass tube and stir into 50 ml of pre-warmed (37 °C) Tris-HCl buffer. To dissolve 12.5 mg FB RR Salt in 312.5 µl 2 N HCl add 312.5 µl of previously prepared 4% NaNO2 solution and stir the mixture into the same 50 ml of pre-warmed Tris-HCl buffer. Shake lightly until the yellow liquid becomes clear and finally add 77 µl of previously prepared 1 M Levamisole solution. Filtrate obtained mixture and pour onto slides placed in the glass cuvette.\nInitiate the incubation at 37 °C and control developing process under the light microscope approx. every 15 - 30 min. If turning fuzzy, replace the FB solution with the fresh mixture.\nRinse the slides 3 - 5x with TBS buffer and transfer subsequently into PBS buffer.\nVisualization of the bound biotinylated secondary antibody\nPrepare DAB/H2O2 developing solution by diluting 1 ml DAB stock solution (25 mg DAB per 1 ml PBS) in 49 ml PBS. Add 16.5 µl H2O2 and filtrate prior pouring onto sections.\nConversion of the chromogen DAB into precipitating brown pigment can be immediate. Control the developing process under the light microscope (even couple of seconds longer incubation may raise a high background and mask the specific signal).\nThe intensity of the brown pigment precipitate can be alternatively enhanced by incubation in the solution consisting of 2% copper sulphate and 0.9 % NaCl for 5'.\nRinse the slides 3 - 5x with PBS and finally with dH2O, use alternatively tap water.\nMount the slides with cover slips directly from the water by using aqueous GelTol mounting medium. Avoid creating air bubbles.",
    "Allow complete drying of the mounting medium, e.g., o/n at 4 °C. Store dried slides on RT.\ntable:\n﻿0,1,2,3\n1.0,% Ethanol,20',40 °C\n2.0,% Ethanol,60',40 °C\n3.0,% Ethanol,90',40 °C\n4.0,% Ethanol,60',40 °C\n5.0,% Ethanol,90',40 °C\n6.0,% Ethanol,60',40 °C\n7.0,% Ethanol,90',40 °C\n8.0,% Ethanol,120',40 °C\n9.0,Xylol,30',40 °C\n10.0,Xylol,60',40 °C\n11.0,Paraffin,60',60 °C\n12.0,Paraffin,60',60 °C\n13.0,Paraffin,60',60 °C\n14.0,Paraffin,120',60 °C\nTable 1. Tissue Processing by Tissue-TekV.I.P Vacuum Infiltration Processor.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}