{
  "id": 5152,
  "origin_website": "Bio",
  "title": "Measurement of Transferrin- and Non-transferrin-bound Iron Uptake by Mouse Tissues",
  "procedures": [
    "For tissue NTBI uptake measurement, inject 0.1 ml of ferric citrate solution (containing 70 µg iron) to a mouse via tail vein to transiently saturate the iron-binding capacity of plasma transferrin.This step is required so that any subsequently injected iron will not bind to transferrin and hence will be non-transferrin-bound iron (NTBI). Return the mouse to the cage and wait for 10 min before going to step 2. See Figure 1 for a typical injection station setup. For tissue TBI uptake measurement, inject 0.1 ml of 59Fe-labeled transferrin (containing 150 µg transferrin) to a mouse via tail vein. Return the mouse to the cage and wait for 2 h before going to step 3.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160824/20160824205714_9835.jpgFigure1. Typical setup for tail vein injection station (A) and tissue harvesting station (B)Inject 0.1 ml of 59Fe-labeled ferric citrate solution (2 µCi) to the mouse via tail vein. Return the mouse to the cage.Two hours after injection of 59Fe-labeled ferric citrate solution (for NTBI uptake) or 59Fe-labeled transferrin (for TBI uptake), euthanize the mouse with an overdose of isoflurane or other proper methods and place the mouse on an absorbent pad. Cut the mouse tail off to remove residual 59Fe radioactivity that is retained in the tail (i.e., radioactivity that did not enter the circulation). See Figure 1 for a typical harvesting station setup.Sterilize the mouse abdomen and chest area with 70% ethanol. Open the abdominal cavity with blunt-end sterile scissors and collect tissues of interest (e.g., pancreas, spleen, liver, kidney, etc.). Then open the chest cavity to collect tissues such as lung and heart. Rinse tissue in 0.9% NaCl solution poured in a disposable weigh boat and remove excess liquid by dabbing the tissues on a stack of paper towels.",
    "Use plastic wrap to wrap each tissue briefly prior to transfer into a gamma counting tube to minimize cross contamination of 59Fe radioactivity between samples. Optionally, transfer tissue to a clean 1.5-ml microcentrifuge tube if the tissue sample can fit in it. Then measure the tissue radioactivity using a gamma counter by putting the 1.5-ml tube containing the tissue sample into a gamma counting tube rack (see Figure 2).For the mouse carcass, use plastic wrap to securely wrap the whole carcass prior to transfer into a gamma counting tube (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160824/20160824205925_9457.jpgFigure 2. Illustration of radioactive tissue handling and loading to gamma counting tubes prior to measurement by a gamma counter. A. Materials required for tissue sample wrapping. B. Top view of the gamma counting rack with previously wrapped samples loaded in each gamma counting tube. C. The gamma counting rack containing the sample tube is placed on the rack belt of the gamma counter, ready to be loaded inside the gamma detector (left panel). The gamma counter screen showing real-time radioactivity being detected from the tissue sample (right panel).Measure organ and carcass 59Fe radioactivity by using a gamma counter. Calculate tissue NTBI and TBI uptakes as a percentage of whole-body counts per minute (CPM) (whole-body CPM = CPM values from all tissues + CPM value from carcass) (see Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160824/20160824215650_1042.jpgFigure 3. Example of raw data and analysis of results. Two hours after injection with 59Fe-labeled ferric citrate, WT and Zip14 KO mice at 3 weeks of age were sacrificed and their tissues and carcasses were subjected to gamma counting. A. Counts per minute (CPM) values from each sample were recorded. Whole-body CPM values were calculated from the sum of all tissues and carcass CPMs. B.",
    "Tissue 59Fe accumulation is expressed as % of whole body and calculated as (tissue CPM/whole body CPM) x 100. C. Resultant figure from panel B is shown. Data were analyzed by using unpaired student’s t-test. Values are means ± SE (n = 3/group). ***P < 0.001, **P < 0.01."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Biochemistry",
    "Cancer Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}