{
  "id": 10716,
  "origin_website": "Jove",
  "title": "Applying Incongruent Visual-Tactile Stimuli during Object Transfer with Vibro-Tactile Feedback",
  "procedures": [
    "The following protocol follows the guidelines of human research ethics committee of the university. See Table of Materials for reference to the commercial products.\nNOTE: After receiving approval of the university ethics committee, 20 healthy individuals (7 males and 13 females, mean and standard deviation [SD] of age 30.2 ± 16.3 years) were recruited. Each subject read and signed an informed consent form pretrial. Inclusion criteria were right-handed individuals aged 18 or above. Exclusion criteria were any neurological or orthopaedic impairment affecting the upper extremities or uncorrected sight impairment. The subjects were naïve to the occurrences of incongruent visual-tactile feedback.\n1. Pre-trial preparation\nUse the wooden box from the box and blocks test10. The dimensions of the box are 53.7 cm x 26.9 cm x 8.5 cm and in the middle of it, is a 15.2 cm high partition. Place a soft sponge layer on both sides of the partition. Place six passive reflective markers on the aspect opposite to the screen, at the four corners and on both ends of the partition (Figure 1a).\nUse a 3D-printer to manufacture a cube with the dimensions of 2.5 cm x 2.5 cm x 2.5 cm, attached to a base with the dimensions of 4.5 cm x 4.5 cm x 1 cm. Before printing, cut each corner of the base to create a square of size 1 cm x 1 cm at each corner (Figure 1a). Attach passive reflective markers on the four corners of the base.\nPlace a large screen approximately 1.5 m in front of a table, so that a subject, standing behind the table, is approximately 2 m from the screen. Place the box on the table, 10 cm from the edge opposite to the screen.",
    "Use a 6-camera motion capture system, activated at 100 Hz, with a plug-in to visualize the partition and the movement of the block in real-time (Figure 1). Calibrate the motion capture system, according to the guidelines of the manufacturer, so that the block and partition of the box are recognized as rigid bodies.\n\tNOTE: Proper calibration of the motion capture system and usage of small markers that are firmly attached to the block and partition are required to maintain the illusion.\n2. Placing the vibrotactile feedback system on the subject\nNOTE: The VTF system described herein was previously published11,12,13,14.\nInstruct the subject to remove wristwatch, bracelets and rings. Attach the VTF system controller to the forearm of the subject (Figure 2, left image).\nAttach two thin and flexible force sensors to the palmar aspect of the thumb and index fingers over a thin spongy layer (Figure 2, right image).\nPlace a cuff on the skin of the upper arm of the subject (Figure 2, left image) and use the fastener to close the cuff comfortably. The cuff will contain three vibrotactile actuators activated via an open-source electronic prototyping platform at a frequency of 233 Hz in a linear relation to the force perceived by the force sensors. The force sensors and vibrotactile actuators are connected to the open-source electronic prototyping platform via shielded electric wires.\n3. VTF activation\nPress the button to activate the battery attached to the controller (Figure 2, left image).\nAsk the subject to press the force sensor’s instrumented fingers (i.e., the thumb and index fingers) together lightly. Note that the subject will report a sense of vibration at the area under the cuff.",
    "Instruct the subject to train for 10 min in grasping the block as lightly as possible, using only the two instrumented fingers. Ask the subject to lift the block, move it, and place it back on the table several times, attempting to apply a minimal amount of force on the block. Encourage the subject to attempt to reduce the applied force, even if the block is dropped during grasping.\n4. Positioning and preparing the subject\nInstruct the subject to stand close to the table (up to 10 cm from it), where the box and partition are placed.\nPlace a divider at the edge of the table near the subject and above the box, so that the subject is unable to see the box but can easily see the screen in front of him or her (Figure 1a). For the divider, use a hard non-reflective material, preferably wood, fixed on a four legs, which permit the adjustment of their height, to accommodate subjects of different heights.\nInstruct the subject to place the earphones on his or her head.\nPlace the block in the middle of the right compartment of the box and guide the hand of the subject to it.\n5. Commencing trial\nNOTE: The described trial is repeated twice, with and without the VTF (a cross-over design is recommended to verify a no learning effect). To perform the trial without the VTF, turn off the battery attached to the controller (Figure 2).\nActivate the software controlling the cameras of the motion capture system.\nIn the control panel of the visual feedback software (Figure 1b), select with/without VTF, type the code of the subject, click Run, Connect, Open and Start.",
    "Instruct the subject to perform 16 repetitions of transferring the block with the force sensor’s instrumented hand while viewing the movement of the virtual block on the screen (Figure 1b). After each transfer, move the block back across the partition to its starting location.\nAfter the subject completed 16 repetitions, click Stop.\nAsk the subject to rate the difficulty level of performing the task of transferring the block 16 times twice, with and without the VTF, according to the following scale: ‘0’ (not difficult at all), '1' (slightly difficult), '2' (moderately difficult), '3' (very difficult), and ‘4’ (extremely difficult).\n6. Post analysis\nUse the 3D coordinate data of the block the compute the path of the block and its transfer time. Mark the onset and offset time of each transfer manually as when the block is at the height of the rims of the right (onset) and then left (offset) sides of the box. Calculate the path length of each transfer according to the following equation:\n\t(1) imgsrc://cloudfront.jove.com/files/ftp_upload/59493/59493eq1.jpg\n\twhere imgsrc://cloudfront.jove.com/files/ftp_upload/59493/59493eq2.jpg and imgsrc://cloudfront.jove.com/files/ftp_upload/59493/59493eq3.jpg are the 3D coordinate of the block in two subsequent time points.\nFor both conditions, with and without VTF, average the path length and transfer time once for the two transfers with incongruent visual-tactile signals and once for the 14 transfers with the congruent visual-tactile signals.\nNormalized the path and time during block transfer in the presence of incongruent visual-tactile signals by the path and time during block transfer with the presence of congruent visual-tactile signals. Perform the normalization separately for the two conditions (with and without VTF).\nPerform a within-subject repeated-measures ANOVA with two factors: VTF (with and without) and incongruent visual-tactile feedback (with and without).",
    "If there are no statistical differences when analyzing the results following the instructions in subsection 6.4, use Bayesian repeated measures ANOVAs with two factors15.\nUse the Spearman’s correlation test with the perceived difficulty level of performing the task with the VTF activated and with the normalized path and duration of the motion\nSet the statistical significance to p < .05.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}