{
  "id": 18842,
  "origin_website": "Jove",
  "title": "An Orthotopic Glioblastoma Mouse Model Maintaining Brain Parenchymal Physical Constraints and Suitable for Intravital Two-photon Microscopy",
  "procedures": [
    "All experimental procedures were performed in accordance with the French legislation and in compliance with the European Community Council Directive of November 24, 1986 (86/609/EEC) for the care and use of laboratory animals. The research on animals was authorized by the Direction Départementale des Services Vétérinaires des Bouches-du-Rhône (license D-13-055-21) and approved by the ethical committee of Provence Cote d'Azur n°14 (Project 87-04122012).\n1. Spheroids Preparation\nPreparation of the agarose-coated Petri dishes\nMix 1 g of agarose with 100 ml of cell culture medium not supplemented with fetal bovine serum. Use a microwave oven (850 Watts for 40 sec, then 3 x 15 sec; stir the solution in between each microwave session) to boil the solution and to completely dissolve the agarose. Autoclave this 1% agarose solution for 20 min at 120 °C to insure sterility. Note: Take care to completely dissolve the agarose before the autoclave protocol. Inhomogeneity may compromise the formation of spheroids.\nOnce retrieved from the autoclave, pour 10 ml of the 1% agarose solution in 100 x 20 mm Petri dishes. Leave the Petri-dishes 20 min at room temperature to allow the 1% agarose solution to solidify.\nAdd 10 ml of PBS above the agarose to maintain humidity. Seal the lid of the agarose-coated Petri dishes by wrapping them with parafilm to avoid evaporation. Petri dishes can be stored for up to 2 months at 4 °C if properly humidified by the PBS layer.\nSpheroid culture\nIn a 75 cm2 flask, culture the glioma cells in their recommended medium as a monolayer.\nReplace the PBS from one of the 1% agarose-coated Petri dish by 1.5 ml of  \"preconditioned medium\" collected from the flask containing the 2D monolayer of glioma cells.\nRemove the medium from the flask containing the 2D monolayer of glioma cells.",
    "Gently rinse the monolayer with 10 ml of PBS.\nAdd 2 ml of 0.05% of a Trypsin/EDTA solution and incubate the flask 4 min at 37 °C. Note: The incubation time may vary according to the cell line used.\nAdd 8 ml of culture medium to stop the action of Trypsin, gently flush the cell suspension. Note: Take care not to flush air in the cell suspension as it increases cell death.\nPut 6 ml of the cell suspension in a sterile vial.\nCentrifuge the vial 4 min at 800 rpm.\nRemove the supernatant and gently suspend the cell sediment in 3 ml of culture medium.\nSeed the cell suspension in the prepared agarose-coated Petri dish.\nPut the Petri dish at 37 °C in a 5% CO2 atmosphere for 2 to 3 days until spheroids of desired diameter are formed.\n2. Spheroid and Window Implantation\nPreparation of the injection system\nClean glass capillaries (1 mm in diameter) by sonicating in 70% ethanol for 10 min. Rinse two times with water prior placing inside an incubator until dry.\nPull several cleaned glass capillaries with a pipette puller in order to prepare a small stock.\nBreak the tip of the pulled capillary by scratching the extremity on a piece of tissue paper to obtain a beveled extremity of the desired size: typically an external diameter of 300-350 µm and an internal diameter of 250-300 µm. During this shaping process, control the diameter of the capillary using a macroscope whose ocular is equipped with a graduated mira.\nConnect the non-beveled extremity of the capillary to a 3 way manifold using a piece of plastic tubing whose inner diameter fits the outer diameter of the capillary.",
    "Using plastic tubing, connect the two other ways of the manifold to a 25 µl microliter syringe and to a 1 ml syringe loaded with histo-compatible mineral oil.\nAdjust the manifold selector to establish a pathway between the microliter syringe and the 1ml syringe. Remove the piston of the microliter syringe and inject mineral oil backward into the microliter syringe until it leaks out by pushing the piston of the 1ml syringe. Replace the piston of the microliter syringe while taking care not to leave air bubbles in the tube.\nAdjust the manifold selector to establish a pathway between the capillary and the 1 ml syringe. Fill the capillary with mineral oil until it leaks out from the tip while taking care not to leave air bubbles in the tube.\nAdjust the manifold selector to establish a connection between the microliter syringe and the capillary. Expel about 10 µl of mineral oil.\nDip the capillary tip into PBS solution and using the gauge of the microliter syringe, suck in 5µl of PBS in the capillary. Note that the meniscus between oil and PBS is clearly visible.\nFix the capillary on a 3 axis micromanipulator fitting under the surgery macroscope. This system will be used to target the capillary to the injection site under visual control.\nSpheroid implantation\nLightly sedate the mouse by inhalation of Isoflurane in an induction chamber (1.5% in air during 1 to 1.5 min).\nAnesthetize the animal with an intra-peritoneal injection of a mixture of Ketamine/Xylazine (120 mg/kg, 12 mg/kg). Note that anesthesia often reduces the body temperature of the animal. It is recommended to proceed with surgery in a room at 26 °C and to keep the animal warm with an underlying thermocontrolled heating pad.\nApply eye ointment to avoid desiccation of the eyes.",
    "Shave the scalp of the animal.\nPlace the animal in a stereotactic frame using ear bars and a mouthpiece.\nClean the skin with povidone iodine (3% soap, then 10% solution).\nMake a 1 cm long incision longitudinally in the middle of the scalp with a scalpel. Using scissors cut and remove the skin above the parietal bones.\nWith a scalpel blade gently remove the periosteum above the skull. Generously apply cyanoacrylate on top of the bone to generate a rough surface for later cement adherence.\nDrill the parietal bone under a surgical macroscope to generate a craniotomy of 4 mm diameter. Generously add ice-cold PBS containing Pencillin (1,000 U/ml) and Streptomicin (1 mg/ml) during the whole procedure to prevent heating. Remove the small bone fragments with forceps and a wet sterile gauze. Take care to drill at least 1mm away from parietal skull sutures to avoid hemorrhages.\nThin the bone at the border of the craniotomy where the glass window will be sealed. Aim is to ensure later planar positioning of the glass window with maximal contact surface between the brain and the glass. Slowly remove the bone using a forceps and clean the exposed dura-mater with the PBS solution.\nTake a 5 mm diameter round glass coverslip, clean it with alcohol and dry it with tissue paper. Try to use the coverslip as a lid for the craniotomy and confirm that a large flat surface of the brain gets into contact with the glass. If necessary remove the coverslip to further thin the side bones. Proceed until the brain can get squeezed flat if gently applying pressure on the coverslip once in place.\nClean again the coverslip with alcohol, dry it with tissue paper, and save it apart.",
    "With a 26 gauge needle make a hole in the dura-mater in the center of the craniotomy yet avoiding main blood vessels. Make sure not to damage the brain parenchyma as the purpose of this step is just to open the dura-mater.\nGently clean the dura-mater with PBS solution to remove hemorrhagic blood. Cover with a piece of tissue paper while preparing the spheroid injection.\nWith the spheroid injection system prepared in step 2.1, suck a round spheroid fitting the capillary inner diameter (approximately 200-250 µm) from the Petri dish prepared in step 1.2. Spheroid should come along with roughly 5 µl culture medium. It should fall down to the tip of the capillarity under its weight.\nRemove the wet tissue paper used to cover the craniotomy and position the animal under the injection system.\nLower the injection pipette until it touches the hole made in the dura-mater. Then, lower it again by 250 µm. Wait 30 sec.\nSlowly inject the spheroid using the piston of the microliter syringe (2-3 µl) while pumping out the excess liquid with a thin piece of tissue paper. Wait 30 sec and then gently lift the injection pipette by 50 µm toward the surface. Wait again 30 sec and repeat the lifting procedure by steps of 50 µm until the surface. Waiting times avoids extraction of the spheroid that would stick to the pipette.\nConfirm the presence of the spheroid in the brain using a fluorescence macroscope.\nMix 100-300 µm diameter cross-linked dextran gel beads with PBS solution in a Petri dish. Wait 1min and fish some hydrated beads. Place them on the bone adjacent to the craniotomy.",
    "Under macroscopic control, choose one bead with a diameter similar to the size of the dura-mater opening. Cut the cross-linked dextran gel bead in two halves using forceps.\nGently put a cross-linked dextran gel hemi-bead into the injection hole with the convex face toward the spheroid. Take care not to remove the spheroid and press gently downward until the frontier of the concave get into contact with the surrounding dura-mater.\nPut a drop of cyanoacrylate glue on a glass slide; dip the tip of a toothpick into the drop to take a small amount of glue. Quickly seal the edges of the cross-linked dextran gel hemi-bead to the adjacent dura-mater by stamping glue around. Take care to perform fast and accurate movements in order to avoid gluing the cross-linked dextran gel hemi-bead to the toothpick. Avoid excess of glue that can spread and impede if not prevent imaging once dried. Wait 2 min for the glue to dry and then clean the craniotomy and the surrounding bone with PBS solution.\nWindow implantation\nPut the 5 mm diameter round coverslip above the craniotomy (see 2.2.12). The edges of the coverslip must be on the thinned skull at the exterior of the craniotomy. The coverslip must be in contact with the dura-mater and the thinned bone on the edges. It is very important to have a direct contact between the dura-mater and the glass coverslip otherwise scar tissue may develop and impede optical clarity.\nWith a tissue, absorb the PBS on the coverslip edges so that solution does not fully cover the craniotomy when applying a small pressure in the center of the coverslip. This will ensure that bone, glass and brain are glued together on the side of the region of interest.",
    "Maintain a small pressure at the center of the coverslip with a forceps while gently applying cyanoacrylate at the border between the bone and the coverslip. The glue will spontaneously spread until the interface with PBS solution. Solution will act as a barrier given the hydrophobicity of the glue. Sealing should be effective in less than a minute but take an extreme care not to move the coverslip until it is fixed. This would otherwise result in cyanoacrylate leakage on the dura-mater hence lead to a failure of the surgery.\nIn case glue would have spread on top of the glass, remove it using a micro-scalpel blade by doing spiral movements as it may otherwise reduce optical clarity. Watch out not to break the glass coverslip during the procedure due to excessive pressure.\nConsolidate the glass fixation by applying dental cement on the edges of the coverslip toward the adjacent skull. Make sure to cover the whole exposed skull until the scalp. Using extra cement, build up side walls around the coverslip to create the pool required for immersion of the objective. The dental cement will cure in less than 10 min.\n3. Post-operative Care and Preparation for Imaging\nPost-operative care\nRemove the mouse from the stereotactic frame, inject Dexamethazon (0.2 mg/kg) and Rimadyl (5 mg/kg) s.c. over the pelvic regions and lay her in a cage with a warm tissue-nest. \nMonitor the animal until the effects of anesthesia have vanished. In general 2 to 3 hr after surgery, mice are fully mobile. Make sure that the animal has an easy access to food and water. Provide the animal with agarose containing glucose (agarose 3%, glucose 3%).",
    "Monitor the animal weight every day and inject Dexamethazon (0.2 mg/kg) and Rimadyl (5 mg/kg) s.c. for the first 10d after surgery. For ethical considerations, euthanize the mice when loss exceeds 15% of its original weight. Intracranial pressure increases with tumor size leading to motor impairments for the animal. This is tumor cell line dependent and occurs at various delays post-surgery. Special care should be taken to characterize the endpoint of the experiment with the cell line used.\nPreparation for imaging\nLightly sedate the mouse by inhalation of Isoflurane in an induction chamber (1.5% in air for 1 to 1.5 min).\nAnesthetize the animal with an intra-peritoneal injection of a mixture of Ketamine / Xylazine (100 mg/kg, 10 mg/kg). Such an anesthesia typically allows 45 min of observation. To perform longer imaging sessions, mouse is placed under continuous inhalation of Isoflurane in air (0.25-0.75%).\nApply eye ointment to avoid desiccation of the eyes.\nPut the animal on a stereotactic frame and block the skull with the earbars.\nTo visualize the blood vessels, a fluorescent dye can be injected intravenously.\nIf the window appears dirty, it can be cleaned by gently removing the debris with a thin blade and the corner of a tissue. Do not use alcohol to clean the window as it is not always compatible with dental cement and it can cool the brain below the window.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}