{
  "id": 6205,
  "origin_website": "Bio",
  "title": "Generation of Human Mesenchymal Stem Cell 3D Spheroids Using Low-binding Plates",
  "procedures": [
    "Preparing the cellsCulture the cells in flasks (cells may come from a frozen vial or from a previously established culture. Cells identity can be confirmed by using specific markers, detailed in Dominici et al., 2006 or Redondo-Castro et al., 2017). Recommended initial densities are around 2,500 cells/cm2, but numbers can be adjusted (depending on the donors and their proliferation properties). Ensure cells are evenly distributed and incubate at 37 °C in MesenPRO RSTM Medium (or any other suitable culture media for MSCs).When cells are being cultured (from a previous passage sub-culture or from the frozen vial) and reach 70-80% confluency, they are ready to be sub-cultured or used to generate spheroids. One passage normally takes one week, but this time can change depending on the donor; proliferation of cells from some donors can be as slow as three weeks between passages. Cells should be used up to passage 6, and the medium should be changed every 3-6 days (slower growing cells require less changes of media).Warm gelatin solution in a water bath (~37 °C), and add enough gelatin solution to cover the entire surface of the flask/well. Ideally, leave them in an incubator overnight (37 °C). Aspirate the gelatin and rinse wash with warm or room temperature PBS. Flasks and plates coated with gelatin can be kept in the incubator until cells are ready (ideally this step needs to be done on the same day, but can be done the day before if needed. Flasks can be kept in the incubator ON, at 37 °C).Once cells are ready, aspirate media and wash cells twice with warm PBS. Then add the solution containing trypsin, diluted 1/10 in PBS, from the 10x stock [final concentration of trypsin is 0.5% (w/v)].",
    "Use the minimum volume necessary to cover the flask surface (normally 1-2 ml for a T25 or 5 ml for a T75, volumes may vary). It should be warm, as trypsin works optimally at 37°C. Return flasks to the incubator for 5 min, checking them every 2 min for detachment of cells. Once detached, transfer the solution containing cells and trypsin to a falcon tube. Add the double of the volume of DMEM low glucose (containing FBS, check recipe section. MesenPRO RSTM medium can be used at this step, but DMEM is normally cheaper) to the flask, to wash out the remaining cells in the flask (if you added 5 ml of trypsin, add then 10 ml of media to stop the reaction). Transfer the whole volume to the tube and centrifuge at 770 x g for 5 min. Discard the supernatant and resuspend the cells in 1-2 ml of media. Count the viable cells (using trypan blue) in a glass hemocytometer and divide the cells into new flasks or seed them to generate spheroids if they are in the right passage (P5-P6). Spheroid formationResuspend the pellet in MesenPRO RSTM medium (14,000-60,000 cells per well [Figure 1C] do not need further modifications of this protocol–suspension volumes or incubation days), and add 50 µl of cell suspension to each well of the low cell binding plate. Variations of density can be used, according to specific requirements. Mixing and resuspending the cell suspension during the plating can help obtaining more reproducible spheroid sizes across the plate.Spheroids will begin to appear in less than 24 h (Figures 1A and 1D). Just few hours after seeding, most of the wells should contain small spheroids that will progressively converge into one large spheroid.",
    "After 5 days in culture, spheroids are visible by eye and are stable enough for experimental investigation (Figure 2). Cells from different donors may grow faster or slower (Figures 1A and 1B), therefore culture times may need to be adjusted. If longer periods of culture are needed, or big numbers of cells are used, media can be changed by slowly removing the medium without disrupting the spheroid. Small preparations (14,000-25,000 cells) do not need media change during those 5-6 days.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815024723_9850.jpgFigure 1. Formation of spheroids. A. Area of spheroids from 2 different human donors (in white dots for the cells purchased from Lonza and black dots for the cells purchased from 3H Biomedical), at days 1, 4 and 6 after cell seeding. Notice the difference in size between donors, the progressive reduction on size and the exclusion criteria for all structures smaller than 0.15 mm2 (indicated with a dotted line). B. Average area of spheroids from the same donors at the same time points; donor from 3H Biomedical in black, donor from Lonza in grey. C. Representative images of spheroids formed with 14,000 and 60,000 cells, after 5 days. Scale bar = 500 µm. D. Time course of the formation of a spheroid (20,000 cells) up to 6 days in vitro. Notice the reduction on size. Scale bar = 500 µm.Treating and collecting spheroidsTreatments can be added directly to the media, without need of moving the spheroids. Make sure to adjust volumes and concentrations. Be sure that your incubator has water to avoid evaporation which could lead to changes in the final volume of media surrounding the spheroid and give rise to inaccuracies in the results.",
    "Supernatants can be easily collected with a plastic pipette tip (200 µl or 1 ml size will be suitable), just taking care to avoid the spheroid. Collect spheroids individually or together with the supernatants and transfer them to a tube using a plastic pipette tip (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815024743_8952.jpgFigure 2. Working with spheroids. Spheroids can be seen in the wells from above (A) and below (B) the plate (5 days spheroids in the picture, 20,000 cells). Spheroids can be easily aspirated with a pipette tip (C) and transferred into centrifuge tubes (D). Spheroids are indicated with arrows. As a reference, the wells from (A) and (B) are from a 96-well plate.Immunostaining of spheroidsTransfer spheroids to non-adherent microfuge tubes containing 4% paraformaldehyde in PBS containing 1% Triton X-100 at 4 °C for 4 h or overnight with gentle rocking (any tube rotator can be used here, use ~500 µl to ensure proper fixation of the spheroids).Wash spheroids in 0.1% Triton X-100 in PBS, at least a couple of times (~15 min/wash; all washes require ~500 µl to ensure efficient washing; no centrifugation is needed, wait 1 min before aspirating the liquid so the spheroids will sediment into the bottom of the tube).Dehydrate by exposure to an increasing series of methanol (10%, 20%, 50%, 75% and 95%) in PBS solution for 15-20 min each at 4 °C(~500 µl of each concentration should be enough). Incubate spheroids in 100% methanol at 4° C for 4 h or overnight with gentle rocking. Rehydrate spheroids (involve the same decreasing methanol series). Block unspecific staining by incubating spheroids in 3% fish skin gelatin (FSG) in 0.1% Triton X-100/PBS solution at 4 °C for 10 min-1 h to overnight with gentle rocking. Incubate with primary antibody diluted in 0.",
    "1% Triton X-100/PBS + 3% FSG, overnight at 4°C with gentle rocking. Optimal concentration of antibodies should be tested by users. We present an example using fibronectin and fibrillin-1, but other proteins can be detected by this method.Wash spheroids three times in 0.1% Triton X-100 each for 30 min at room temperature. Incubate spheroids with secondary antibody in 0.1% Triton X-100/PBS for 3-24 h at 4°C with gentle rocking. DAPI or other staining steps can be added at this point.Wash three times using 0.1% Triton X-100/PBS. Spheroids are ready to be imaged (e.g., by fluorescence or confocal microscopy, see examples in Figure 3). We imaged the spheroid by using dipping confocal lenses whilst the spheroid was immersed in PBS solution, but different approaches can be used and every researcher needs to adapt this step to their own microscopes and resources.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180815/20180815024803_0928.jpgFigure 3. Example of immunofluorescent staining of spheroids. Confocal images of an immunostained spheroid (A, scale bar = 100 µm), and details at higher magnification (scale bars = 50 µm) of fibronectin (B) and fibrillin-1 staining (C), as well as the merge image (D)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}