{
  "id": 12120,
  "origin_website": "Jove",
  "title": "A Simple Migration/Invasion Workflow Using an Automated Live-cell Imager",
  "procedures": [
    "NOTE: Two cell lines should be handled separately. The following procedures should be applied to one single cell line if not specified.\n1. Optimize Cell Density Prior to Wounding\nCulture adherent cells in T75 cm2 tissue culture flasks to about 80% confluence in phenol-red free Dulbecco's Modified Eagle Medium (DMEM) supplemented with 10% fetal bovine serum (FBS), 200 mM L-glutamine and 2 µg/mL insulin at 37 °C with 5% CO2 (standard incubation conditions for most cancer cell lines, culture formulations are cell line-dependent).\nRemove the culture media by pipetting off into a waste container. Pipet 2 mL of pre-warmed 0.1% trypsin-EDTA to briefly rinse the cell monolayer and pipet off. Add another 2 mL of 0.1% trypsin-EDTA and place the flask under standard incubation conditions at 37 °C for 5 min.\nGently tap the flask to ensure detachment of the cells and then add 10 mL of pre-warmed culture media to stop the proteolytic reaction.\nTransfer the cell suspension into a 15 mL centrifuge tube and spin down at 200 x g for 5 min at room temperature (RT). Carefully remove the supernatant without agitating the cell pellet and resuspend with another 10 mL pre-warmed culture media.\n2. Counting Cell Number Using an Automated Cell Counter (or Any Counting Methods)\nDilute 200 µL of resuspended cell suspension with 800 µL of 1x Dulbecco's Phosphate buffered Saline (DPBS) in a 1.5 mL centrifuge tube.\nAttach a 60 µm cell count sensor to the cell counter, hold down the toggle and merge the tip into the cell suspension. Slowly release the toggle until the cell suspension is successfully drawn into the sensor. Cell concentration is displayed in cells/mL.\nCalculate the cell number in the 10 mL cell suspension.\n3. Cell Plating",
    "Plate cells at a range of cell densities (40,000-90,000 cells/well) in triplicate in a 96-well plate.\nPlace the plate into the live-cell imager, and schedule scanning every 2 h for 24 h.\nIn the software, click Schedule scans from the task list. In the drawer setup pane, determine the position of the plate, click Add vessel and choose the plate type. In the Scan Setup pane, choose or edit the scan pattern according to the experimental plate setup, and set Scan Type as Standard.\nRight click on the Timeline and select Set Intervals. Set Add Scans Every to 2 h at a 24-h schedule. Click Apply.\n4. Determine the Optimal Cell Seeding Density for the Migration Assay\nStop scanning after 24 h, apply the confluence processing analysis tool to the HD-phase contrast images automatically collected, and generate a cell proliferation curve against time.\nDetermine 3-6 representative images and place them in a new Image Collection.\nDetermine a proper mask as Processing Definition.\nLaunch an analysis job.\nDetermine optimized cell density according to confluence against time (approximately 100% confluence within 6 -18 h depending on when the migration assay commences).\nNOTE: The amount of time it takes to grow the cells to confluence varies depending on the seeding dilution.\n5. Days 1 and 2: Preparation for Migration and Invasion Assays\nOn Day 1, coat the plate for invasion assay.\n\tNOTE: ECM gel should always be handled on ice and with tips that have been placed in the fridge overnight.\n\t\nDilute ECM gel with ice-cold culture media to 100 µg/mL and add 50 µL of diluted ECM gel/media into designated wells.\nPlace the plate at standard incubation conditions overnight.",
    "On day 2, gently aspirate the excess media. Plate cells with optimized cell densities into 2 96-well plates designated for the migration assay (uncoated) and the invasion assay (coated) in triplicates following sections 1-3 in the late afternoon (in the current protocol, optimized seeding densities for ZR75-1 and MDA-MB-231 were 90,000/well and 50,000/well, respectively).\nPlace plates at standard incubation conditions overnight.\n6. Day 3: Wound Scratch\nSpray and wipe the scratch tool and 2 washing boats with 70% ethanol before placing them in the biosafety cabinet. Fill the washing boat 1 and 2 with exactly 45 mL of sterile (autoclaved) distilled water and 70% ethanol respectively.\nFor sterilization, place the scratch tool pin block (top) on washing boat 1 and 2 for 5 min each.\nStart with the migration assay plate.\nMove the plate containing cells from the incubator and make sure no well is dry to avoid damage of the scratch tool. Remove the plate cover and insert into the base plate holder of the scratch tool, and carefully place the top part onto the base part by guiding dowels. Press and hold the black lever, and meanwhile carefully lift the pin block. Gaps in each well are usually visible with the naked eye and under the microscope.\nQuickly soak the pins in water; this is sufficient to clean the scratch tool prior to scratching the invasion assay plate if plate setup is identical. Otherwise, repeat the sterilization steps with sterile distilled water and then 70% ethanol for 5 min each.\nWash the plate 1 or 2 times with pre-warmed culture media to avoid detached cells or cell sheets reattaching to the well.\nAdd 100 µL of fresh warm media into designated wells with or without treatments.\nAdditional steps for invasion assay.",
    "Place the invasion assay plate at 4 °C for 5 min to equilibrate and carefully aspirate the cold media.\nDilute ECM gel with ice-cold culture media to 5 mg/mL, add 50 µL of diluted ECM gel into designated wells, and place under standard incubation for 30 min.\nAdd 100 µL of warmed-up media with or without testing compounds.\nPlace the plate into live-cell imager and let it equilibrate for 5 min. Choose Vessel Type as imagelock plate. Set Scan Type as Scratch Wound, choose or edit Scan Pattern according to the experimental plate setup (1 image/well and wide mode) and schedule 24-h repeat scanning every 1-2 h for 72 h until the wounds are healed.\nTo clean the scratch tool, put the top pin block in each of the following solutions (45 mL in washing boats) for 5 min: 0.5% detergent 1 (see Table of Materials), 1% detergent 2 (see Table of Materials), sterile distilled water and 70% ethanol. Place the scratch tool back onto its base plate and store in a dust-free environment.\n7. Data Analysis\nStop scanning the designated plate after all the wounds have healed by choosing the experimental plate on the Drawer Setup and clicking Remove Vessel.\nCollect 3-6 representative images spanning a range of sound percentages, including images right after the wound has been made, wound closure by 10% and 50%.\nTo determine a proper processing definition, use Segmentation Adjustment, Cleanup and Filters to apply appropriate Scratch Wound Mask and Confluence Mask. Use Preview current/all to view the accuracy of the masks.\nLaunch the analysis job.",
    "Data can be analyzed within the software or exported for further analysis. Three metrics provided by the software can be used to evaluate the HD-phase images: wound width (µm), wound confluence (%) and relative wound density (%). Comparisons will be discussed in the following section.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}