{
  "id": 2772,
  "origin_website": "Cell",
  "title": "Prediction and verification of glycosyltransferase activity by bioinformatics analysis and protein engineering",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nNote: The developer-intended scope of most resources listed in Table 1[href=https://www.wicell.org#tbl1] extends far beyond the specific purpose for which we choose to use each of them here. Please refer to online tutorials by the respective software developers to gain initial information and experience.\nMajor step 1: Define a suitable protein fragment for validating catalytic activity\nTiming: ∼1 h\nIf a protein of interest is long and/or if it contains numerous domains, working with full-length protein in the laboratory could have drawbacks. Eventually the target protein (or a fragment of it) that you choose will have to refold into its native (or native-like, for mutants) 3D-structure when expressed in vitro at high concentrations. Thus, if an independently folding but catalytically active portion of the protein can be identified, working with that may facilitate purification and/or functional assaying. Depending on the build of its 3D-structure, this portion may encompass one or several domains (e.g., in the common fold adopted by GT-A glycosyltransferases, it is formed by a highly conserved catalytic core domain and diverse insertions/extensions that contribute to the diversity of acceptor substrate binding sites found across the superfamily.19[href=https://www.wicell.org#bib11]\nInformation about a target protein’s “architecture” is therefore helpful, especially the approximate boundaries of its potential catalytic domain(s). In absence of thorough characterization, the predicted domain boundaries shown in UniProt[href=https://www.uniprot.org/]3[href=https://www.wicell.org#bib6] can provide a starting hypothesis for these, as can implicit clues from published research if available (e.g., truncation mutants).\nHere we include a simple additional step to support selecting a preliminary target fragment.\nCorroborate prior knowledge of the target proteins architecture.\nSubmit the full-length protein sequence in an HHpred search online[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/]9[href=https://www.wicell.org#bib16] (MPI Bioinformatics Toolkit server) against a library of HMMs (Hidden Markov Models) derived from known protein structures in the PDB,4[href=https://www.wicell.org#bib3] using the following parameter suggestions:\ntable:files/protocols_protocol_2282_8.csv",
    "Note: Parameter settings are shown as we used them to analyze GLT8D1. We prefer to set parameters in HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] slightly more conservatively than proposed by default but for most analyses the impact of this on the results will be minimal, i.e., different parameter settings may work equally well (or better) for your target. All parameters that are potentially relevant for this step are listed.\nCheck at the top of the HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] results page:\nHHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] may recommend that you (re-)submit a sequence fragment (“section”) rather than full-length. Consider HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/]’s fragment suggestion to define what might be a sensible portion of your target protein to produce in the laboratory, together with information from other sources (literature and databases) but also your intended use of the mutants in research. If you lack a more meaningful way to do this, consider extending the HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] fragment by 30 amino acid residues at both ends, and proceeding with this fragment.\nIf HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] does not make any recommendations, your protein is likely built from a single domain and you should include it entirely in all next steps.\nNote: In rare cases, a 30 residue “overhang” as suggested above is confidently identified to be part of another known adjacent domain by HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] (by a high score and very low E-value). In this case, shorten your working fragment accordingly.\nDevise basic “consistency checks” to avoid errors even if they seem unlikely.\nNote: For example, one could verify that all established conserved sequence motifs are included in the fragment that are associated with the enzymatic function (for members of the GT-A superfamily, these include the metal-coordinating [DxD] motif, a conserved [H] near the C-terminus and two motifs in between (Figure 1[href=https://www.wicell.org#fig1], step 1; see Figure 4 in Taujale et al.20[href=https://www.wicell.org#bib18] for details).",
    "Alternatives: If your target protein’s superfamily has been studied extensively by others, it is also possible to skip major step 1 and rely on literature or other sources to define a suitable fragment (e.g., on reviews of fold characteristics and diversity, recognizable sequence motifs etc.). Similarly, a well-characterized closely homologous protein with a known 3D-structure will usually make inferring domain boundaries straightforward, and major step 1 unnecessary.\nMajor step 2: Assemble a multiple sequence alignment (MSA)\nTiming: ∼3–4 days\nThe most effective way to assemble a high-quality MSA for your protein family depends on many factors. For underpinning the subsequent steps of the protocol, and generally for designing mutations, we recommend a comparatively narrow MSA. Aim for approximately 40%–45% minimum pair-wise sequence identity as your limit across the aligned segment, or approximately 200 maximum PAM (Point Accepted Mutations) width if you use this evolutionary distance measure. Erroneous sequences should be eliminated as best possible. The steps below (steps 2–9) outline one path that often works for producing a family or subfamily MSA that is helpful for rational protein engineering by visually inspection. In rare instances, alternative resources might be needed (e.g., if the OrthoMCL group alone proves inadequate for practical use here, i.e., too narrow, too wide, or non-existent, see troubleshooting problem 2[href=https://www.wicell.org#sec7.3]). In step 10 we describe an optional consistency check (an easy, qualitative test) for such MSAs that uses derived phylogenetic trees.\nExtract automatically generated sequence sets of orthologs using OrthoMCL[href=https://orthomcl.org/orthomcl/app].18[href=https://www.wicell.org#bib9]\nLook up the OrthoMCL group (OG) that contains your protein of interest, using either the general search window (input: a protein identifier, e.g., GLT8D1) or “Tool>BLAST” (input: protein sequence in one-letter amino acid code or in “FASTA” format).",
    "Note: If you use BLAST for this, default parameters are ok (parameter settings are irrelevant because the goal is merely to look for an exact match). Find the OG that includes your query sequence in the “Protein Results” display (OrthoMCL release 6, accessed online in June 2022).\nLook up the OG for the paralogs and produce a joint MSA.\nNote: In some cases you will find human paralogs that are very similar to your target protein (e.g., human GLT8D1 and GLT8D2 are 49% sequence identical, GLT8D1 is included in OG6_106350[href=https://orthomcl.org/orthomcl/app/record/group/OG6_106350] and GLT8D2 is included in OG6_110970[href=https://orthomcl.org/orthomcl/app/record/group/OG6_110970]). In such cases, we recommend to identify the OG for the paralog(s) like in step 2a and produce a joint MSA. This adds diversity and will account for that in rare cases, automated ortholog resources could have misassigned orthology in closely paralogous groups.\nNote: If the target is a human protein within a large and diverse protein family, including only metazoan (i.e., animal) orthologs often results in a sufficiently evolutionary diverse MSA for designing active site mutations.\nAlternatives: Bioinformatics web resources change every now and then in appearance, in the tools or in the derived data that are offered. For example, in OrthoMCL release 5 that was used in our GLT8D1 study1[href=https://www.wicell.org#bib1] we downloaded two OGs from the site so as to include the close paralog GLT8D2 [OG5_136216 and OG5_135167; last accessed November 2021] and aligned the sequences with a local installation of ClustalX[href=http://www.clustal.org/clustal2/]7[href=https://www.wicell.org#bib13] (step 3a). Using the current OrthoMCL website[href=https://orthomcl.org/orthomcl/app] and data instead (release 6), an initial automated MSA can be generated directly using ClustalΩ[href=https://www.ebi.ac.uk/Tools/msa/clustalo/]21[href=https://www.wicell.org#bib19] with selected sequences. While we have not tested this feature, we expect it to yield similar MSA quality. Therefore this could alternatively serve as the initial alignment in step 3.",
    "Identify likely erroneous protein sequences and eliminate them by visually inspecting the generated MSA.\nNote: Automatically inferred protein sequences often contain errors, particularly eukaryotic sequences (where intron/exon boundaries have to be predicted). To recognize potentially erroneous protein sequences fast, we recommend simply inspecting an automated MSA visually.\nGenerate an automated MSA from your complete set of protein sequences.\nNote: Convenient tools for doing this include ClustalX[href=http://www.clustal.org/clustal2/]7[href=https://www.wicell.org#bib13] (local), Jalview[href=https://www.jalview.org/]8[href=https://www.wicell.org#bib15] (local is recommended) and UGENE[href=http://ugene.net/]14[href=https://www.wicell.org#bib14] (local). Popular alignment algorithms that can be run within these programs include CLUSTAL21[href=https://www.wicell.org#bib19] (e.g., CLUSTALW[href=http://www.clustal.org/clustal2/] or CLUSTALΩ[href=http://www.clustal.org/omega/]), MUSCLE[href=https://www.ebi.ac.uk/Tools/msa/muscle/],22[href=https://www.wicell.org#bib20] MAFFT[href=https://mafft.cbrc.jp/alignment/server/],23[href=https://www.wicell.org#bib21] and others. There is no need to worry about which is the best because the automated alignment will be refined later for modeling through manual edits.\nNote: Use a common tool that also displays the MSA in a way that helps you identify oddities. We find the ClustalX[href=http://www.clustal.org/clustal2/] coloring scheme ideal for this.\nMake sure that the order of sequences in your display groups close homologs together.\nNote: For example in Jalview[href=https://www.jalview.org/], this is “aligned” order.\nLook for exceptionally different segments compared to the MSA that occur within a single protein sequence and remove them entirely from the alignment (e.g., a deletion or an exceptionally different stretch of amino acids in a region that is otherwise highly conserved among closely related sequences, or even among all sequences).\nRepeat steps 3a-c until no striking problem regions remain.\nNote: Do not worry about throwing out valuable diversity information in this way. For rationally designing mutations, errors can be misleading. Usually, sufficient sequences remain after this step for that the resulting MSA reflects diversity in the protein family informatively.",
    "Note: If you work with several orthologous groups, keep in mind that evolutionary pressure can differ between them, and give rise to segmental differences. If each paralog is represented by several sequences in the MSA, it is generally easy to distinguish such adaptive differences from (non-biological) variation that is introduced by sequence prediction errors.\nTrim your MSA if necessary at the N- or C-terminal end of the segment of interest.\nSave a copy of the MSA prior to truncating.\nUse a systematic criterion of your choice to truncate.\nNote: For example, you could remove positions at the start and end of your MSA that are represented in <50% of all sequences kept in your MSA, or truncate where they deviate beyond recognizable relatedness over several start or end positions. If you notice any obviously misaligned individual sequence endings, correct the alignment by shifting or by excluding the affected positions prior to trimming.\nYou should end up with a MSA that begins and ends with regions that are well represented across many species.\nCritical: After this step, the automatically displayed sequence numbers in alignment viewers are no longer accurate for any trimmed sequences, i.e., in figures for publications they will have to be corrected manually.\nNote: Use an alignment editor to do this (e.g., Jalview[href=https://www.jalview.org/] or UGENE[href=http://ugene.net/]).",
    "Note: The intention of this step is primarily to eliminate the risk that endings could be included in the MSA that do not belong to the common (conserved) core of the targeted catalytic region. This could occur particularly in evolutionary diverse families, e.g., if individual homologs have differing protein architectures outside of the target domain. Keeping such regions in your catalytic fragment MSA, instead of trimming, might affect the accuracy of the alignment and of derived information (e.g., pair-wise sequence identity calculated across the aligned sequences). By contrast, the full MSA or longer segments might be more informative for figures in scientific publications.\nRemove identical sequences within your MSA (if any remain).\nGenerate a “percent identity matrix” of your MSA.\ne.g., in ClustalX[href=http://www.clustal.org/clustal2/] (Trees > Output Format Options > …) or in UGENE[href=http://ugene.net/] (Actions > Statistics > …).\nIf you use neither of these programs you can generate this output retrospectively by uploading your MSA to the CLUSTALΩ web server at the EBI[href=https://www.ebi.ac.uk/Tools/msa/clustalo/)] if you set the options to not de-align aligned sequences and to return a distance matrix.\nKeep only one sequence of any pairs or groups that are 100% sequence identical over the segment covered by your MSA.\nNote: For the scope of this protocol, we do not worry whether a duplicate is real or artifactual because removing duplicates of either type will not hurt in our next steps (and keeping them does not provide any additional information). If a better distinction between truly identical sequences and artifacts is of interest (e.g., for evolutionary analyses) this is easy to follow up upon provided that a whole genome has been assembled, via the gene loci (which are cross-referenced e.g., in UniProt[href=https://www.uniprot.org/] records).",
    "Note: Well-programmed analysis steps and/or software should be unaffected by duplicates. Regardless, it is safest to remove them and it yields a better suited MSA for visual inspection as well as for publication.\nRepeat step 3a to re-align all sequence fragments, to finalize the automated family MSA.\nPerform enzyme-specific consistency check(s) of your MSA.\nVisually inspect the MSA that your (sub)family of interest reflects. Are any known conserved sequence motifs, e.g., from literature, conserved in your MSA?\nIf you detect inconsistencies that could be due to erroneous sequences that were overlooked in step 3, consider removing them, then realign once more by repeating step 3a.\nCritical: If you are transferring this protocol to proteins outside the GT-A glycosyltransferases, you might encounter some that have evolved through internal duplications. In such cases, it is worth verifying very carefully that the MSA aligns the proteins correctly because repeats are a challenge for MSA algorithms.\nRename the sequences of your MSA.\nUse an alignment editor that allows doing this or save your MSA as a text file in “FASTA” format [.fa or .fasta] and edit each sequence heading using a text editor.\nDo not create names that are identical over their first eight characters or more (some alignment programs as well as PhyML[href=http://www.atgc-montpellier.fr/phyml/]12[href=https://www.wicell.org#bib22] might misinterpret such labels as being identical altogether).\nRemember to record all name changes that you make in your electronic lab/work notes with the sequences’ accession codes, to facilitate back-“translation”.\nNote: You should be able to identify paralogs and species of respective sequence within the first 10 characters (e.g., Hsap1 for GLT8D1, Hsap2 for GLT8D2, Drer1 for the zebrafish ortholog of GLT8D1, etc.).\nNote: Use these very short labels for your work with the MSA and sequences. For publication figures, it is advisable to reinstate more descriptive, longer labels.",
    "Save the target (sub)family MSA in “CLUSTAL” [.aln] or “FASTA” [.fa or .fasta] format.\nNote: Use this MSA in subsequent steps of your research, unless additional consistency checking (step 10, and/or using further quality control measures of your choice) reveals the need for further elimination of sequences.\nNote: In steps 2–9, a MSA was produced and refined through careful selection of homologous sequences (steps 2, 3, 5, 7), and (if applicable) through trimming off of region(s) that may not be part of the common catalytic domain (step 4). No manual editing of individual sequences or of their automated alignment was undertaken. Therefore, the resulting MSA should be reproducible by anyone.\n(Optional Step) Consistency check: is a phylogenetic tree derived from your MSA compatible with species evolution?\nSubmit your MSA (in FASTA format) to PhyML12[href=https://www.wicell.org#bib22] at NGPhylogeny.fr[href=https://ngphylogeny.fr/tools/tool/271/form].\nRun a fast tree calculation without extensive statistics, as a test run. Set the statistical test to “Likely aLRT statistics”, other parameters can be kept as they are suggested by default, or with minor deviations as listed below:\ntable:files/protocols_protocol_2282_9.csv\nNote: This will generate an unrooted phylogenetic tree, which is generally sufficient for this purpose.\nAlternatives: Experts may prefer to produce rooted trees by adding outgroup sequences to their MSA prior to submission (i.e., more distant homologs than those included in the (sub)family MSA) if this is possible without altering the original MSA substantively.",
    "View your test tree, e.g., by linking to the iTOL viewer[href=https://itol.embl.de/]13[href=https://www.wicell.org#bib12] directly, this is offered from within the results display. Use advanced options to display branch support values and to “midpoint root” the unrooted tree returned by PhyML[href=https://ngphylogeny.fr/tools/tool/271/form] (unless you added an outgroup sequence intentionally to establish the root position). When evaluating consistency with species evolution (step 10b), beware that the true root could be misrepresented by midpoint rooting. However, in most cases this process will yield trees that you can easily examine visually (examples are shown in Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig2.jpg\nFigure 2. Phylogenetic consistency checking (step 10)\n(A) Example of a very well balanced tree that is consistent with species evolution; it was derived from the MSA we used to design GLT8D1 mutants.1[href=https://www.wicell.org#bib1] No further corrections are required. Note: Minor topological differences, like those between the GLT8D1 and GLT8D2 mammalian groups, are common and tolerated because the amount of sequence variation is insufficient to expect stable, accurate positions in these subtrees).\n(B) An illustrative example constructed with Glycogenin (GYG) sequences. Arrows mark inconsistencies in the original tree. Together with MSA inspection these could be resolved by removing a single (likely erroneous) sequence (Bmaa), and by correcting a mislabeled paralog specification (Tnig1|2). Inconsistencies may point to erroneous sequences, misalignments, or mislabeling (they could also be caused by exceptional evolutionary rates but this is rare). Note: Examining the target phylogeny will rarely turn up new errors if good sequence resources were used to generate the MSA and if sequences were inspected in MSA context (steps 2–9). Even then, gaining an overview of the protein family in this way is recommended as an informative and scientific best practice.\nIf the test calculation was completed without errors, repeat the analysis asking for more computationally extensive statistical/bootstrapping support using the following parameters:\ntable:files/protocols_protocol_2282_10.csv",
    "Note: If your submission produces strange errors before the program is running but is formatted correctly, try deleting your submission history. To reset completely, clear the browsing data in your browser settings, then resubmit.\nAlternatives: Generate branch support through classical bootstrapping (100 sets). Calculation using the SH-like method is faster, quite comparable, and sufficient for this application.12[href=https://www.wicell.org#bib22]\nView the resulting tree as above, noting that well-supported branch points (clades) have support values >0.7.\nRemove any sequence whose position in the tree seems incompatible with species evolution (allowing minor deviations but not major rearrangements, Figure 2[href=https://www.wicell.org#fig2]). In this case also repeat from step 6 onward after removal, until the automated alignment of close homologs in the target (sub)family is compatible with species evolution.\nNote: The “correct” topology depends on the species included in the MSA. Literature or textbooks may serve as references or ENSEMBL resources[href=http://uswest.ensembl.org/info/about/species_tree.pdf].\nNote: Consistency in this quality control step does not rule out unnoticed errors in your sequences or alignment entirely. Nonetheless, phylogenetic evaluation is good practice, quickly done and it depicts the protein (sub)family from a different perspective.\nNote: To actually perform a scientific evolutionary analysis, more extensive and specialized protocols would have to be followed than what is outlined above, using multiple programs, and parameters set specifically for the sequence set that is investigated. Such advanced phylogenetic calculations are beyond the scope of this protocol.\nAlternatives: For this MSA consistency check, fast alternative methods for phylogenetic tree construction would suffice, e.g., deriving a highly bootstrapped neighbor-joining tree (1000 bootstrapped sets) using any reputed software should be adequate. Only be careful (if you are a bioinformatics beginner) not to use “guide trees” [.dnd], those are not adequate (their underlying assumptions are too simplistic to be used in evolutionary comparison).",
    "Major step 3: Generate 3D-structural context through template-based modeling (TBM)\nTiming: ∼1 week\nWe outline a simple but thorough applied bioinformatics path to a template-based 3D-structural model of the potentially catalytic fragment (approximately defined in major steps 1 and 2). The modeling accuracy achieved by the recommended steps is likely sufficient to make it useful also for research beyond the design of active site mutations, since attention to quality is also paid outside the highly conserved sites. First, the (sub)family MSA (result from major step 2) is submitted to HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] to find template structures and to provide a good initial target-template sequence alignment to later guide TBM. Using SWISS-MODEL online[href=https://swissmodel.expasy.org/]10[href=https://www.wicell.org#bib38] the actual model of the protein of interest (atomic xyz coordinates) is produced conveniently with user-provided input (template structure and target-template sequence alignment). The steps outlined below are designed to produce a 3D-structural model of the target protein but also to ensure that the scientist is confronted with structural (and functional) diversity within the target protein superfamily.\nAlternatives: If the focus of your project is predominantly on producing a 3D-structural model (i.e., less on exploring and understanding the functional diversity in order to modify it through mutation), or if you lack the structural bioinformatics experience to confidently carry out the steps below, we recommend considering the pre-computed AlphaFold24[href=https://www.wicell.org#bib23] (also known as AlphaFold2[href=https://alphafold.ebi.ac.uk/]) predictions. In recent testing their accuracy is often comparable to experimentally solved structures, at least for monomeric proteins.\nIdentify suitable template structure(s) for TBM.\nSubmit the final (sub)family MSA generated above (steps 2-9 or 2-10) to search the HHpred database[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] of known protein structures, using parameters as shown below:\ntable:files/protocols_protocol_2282_11.csv",
    "Note: Parameter settings are shown as we used them to analyze GLT8D1 from the MSA shown in Ilina et al.1[href=https://www.wicell.org#bib1] We prefer to set HHpred parameters slightly more conservatively than it is proposed by default but for most analyses the impact of this on the results will be minimal, i.e., different parameter settings may work equally well (or better) for your target. All parameters that are potentially relevant for this step are listed.\nIdentify promising hits within the HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] results list.\nIf the structure of a close homolog is known and found by HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] that is already in your target (sub)family MSA, or if it could be included based on comparable sequence similarity values, then add the sequence of this best template to your MSA (see note below) and skip forward to step 14. Otherwise, proceed with step 11c.\nNote: The target-template sequence alignment will have to include the “PDB sequence” of the template for modeling, with potential synthetic mutations (if any), and omitting all residues for which no coordinates are available (at the ends or within the protein that was crystallized or analyzed by n.m.r.). For best results, ensure that you include both the natural sequence and the “PDB sequence” in your MSA if they differ even slightly. Both are accessible, e.g., via links from the RCSB PDB website[href=https://www.rcsb.org/] record’s Structure Summary Page (“Display Files” will offer the “PDB sequence” and e.g., Uniprot[href=https://www.uniprot.org/] provides links to proteins natural sequences in their respective online records). Trim the natural sequence at its ends if necessary, then realign and save your MSA as text files in “CLUSTAL” [.aln] as well as in “FASTA” format [.fa or .fasta].\nSelect from the representative structures proposed by HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] with high confidence by prioritizing those that:\nare predicted to be of a homolog with low E-value,",
    "cover your entire fragment/domain of interest or nearly (if there is enough choice),\nare from a source species from the same taxonomic domain of interest, e.g., mammalian if you are interested in a human protein like GLT8D1.\nNote: GT-A (sub)family submissions will typically return many hits to choose from, all predicted to be homologous to the query MSA with E-values <1E-10. Within this group, the ranking by numerical scores is not necessarily relevant for their suitability for modeling. Due to the strong definition of this large protein superfamily, suitable high-confidence template sequences do also not have to be strongly similar to the target (i.e., pair-wise sequence identity can be <30%).\nAlternatives: For targeting proteins that are not GT-As, the landscape of potential template structures and HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] result scores may look very different. Generally, a high probability hit in HHpred (“HHpred Probability” >95%) spanning the region of interest indicates a potentially suitable template structure in the PDB. Experienced structural bioinformaticians will be able to evaluate and dissect the list further (and may pursue less confident and/or partial HHpred hits).\nSelect and download the best-suited coordinate structure(s) from the PDB[href=https://www.rcsb.org/].\nEach promising HHpred hit returned (step 11b and step 11c) may represent a group of potential templates in the PDB[href=https://www.rcsb.org/]. Select one or several coordinate file(s) from these that (ideally) meet the criteria listed below. In order of priority, highest first, we recommend:\ntable:files/protocols_protocol_2282_12.csv\nFollow the HHpred hit link to the RCSB PDB[href=https://www.rcsb.org/] “Structure Summary” for each representative structure (or open it by searching the PDB with the PDB ID, e.g., 4WMA).",
    "If not all criteria are fulfilled by this structure, a better template may be found within the group of structures that it represented in the HHpred database[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] search (step 11a). One way to browse such a group effectively (e.g., a 70% identity cluster of structures) is via the respective “Entity Group Summary Page[href=https://www.rcsb.org/docs/grouping-pdb-data/group-summary-pages]” at the RCSB PDB website[href=https://www.rcsb.org/].\nInformation about synthetic mutations (if any) may be available directly on the Structure Summary page, in the “Macromolecule” Section relating to the relevant protein entity (“Details”) and in the “Protein Feature” section further below.\nDownload and save the coordinate file [.pdb] for each ultimately selected template structure (or use UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/]6[href=https://www.wicell.org#bib17] later to download those interactively).\nNote: If systematic evaluation of the available structures seems too cumbersome and many are available, the title of the structural entry can also provide helpful information for selecting manually. For example, PDB:4WMA, a suitable modeling template for GLT8D1, is entitled: “Crystal structure of mouse Xyloside xylosyltransferase 1 complexed with manganese, acceptor ligand and UDP-Glucose”.\nNote: We generally advise against using PDB entries reported with X-ray resolution >3Å as modeling templates. However, below this threshold this generic parameter should not be overvalued for active site modeling. Co-crystallization of substrates and cofactors may result in worse overall resolution for far superior modeling templates, compared with less informative conformations of the same protein.\nNote: Selecting a small number of well suited, high-quality template structures is sufficient for generating realistic and helpful models of the target protein’s catalytically crucial portion.\nNote: If available, the main scientific journal publication associated with a suitable template PDB entry can be an excellent source of additional information, also for catalysis-mechanistic knowledge that is of interest later in this protocol.\nSuperimpose template structures.",
    "Open the selected template structure(s) within UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/] using either the locally saved coordinate file(s) [.pdb] (step 11dv), or using UCSF Chimera’s ability to connect with RCSB PDB “Fetch by ID…” (enter a PDB ID, e.g., 4WMA).\nIf you selected only one template structure, skip the next steps (go directly to step 13).\nSuperimpose the structures using the program’s Structural Comparison Tool “Matchmaker”. Default parameter settings will produce a good result, except you may (1) have to select the correct chain(s) to match if you have multiple/distinct protein chains in your open structures, (2) optionally de-select the use of secondary structure scores (especially if your template structures are highly divergent, which is a good selection strategy otherwise).\nNote: Most importantly, request that a structure-based MSA is computed after the superposition.\nAlternatives: A structure-based MSA can also be generated from already previously superimposed structures, using the “Match -> Align” Tool.\nVerify that:\nthe catalytic segments of the 3D-structures have been well superimposed generally,\nany hallmark residues known to be conserved across the family have been superimposed precisely,\nknown sequence motifs are also aligned in the structure-based sequence alignment derived from this automatic superposition.\nIf any of these conditions are not met, work with a smaller selection when superimposing or revise your selection of template structures.\nSave your UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/] session so that you can reopen it later (“Restore Session…”) without having to repeat any work.\nRefine gap positions in the target-template sequence alignment manually using structural and evolutionary considerations.",
    "Note: The goal of this step is to adjust the initial, sequence profile-based input alignment slightly, prior to TBM (step 14), to maximize 3D-structural compatibility where this could be relevant for modeling, namely at insertion/deletion sites. The items most helpful for supporting this are: the template structure(s) viewed e.g., in a UCSF Chimera session (step 13e) and the high-quality (sub)family MSA with the target sequence (from step 9 or step 10).\nRestore the superimposed template structure(s) session of UCSF chimera[href=https://www.cgl.ucsf.edu/chimera/].\nHave the target (sub)family MSA available in a color scheme of your preference (e.g., ClustalX coloring).\nNote: This can be in an alignment viewing/editing program (e.g., Jalview[href=https://www.jalview.org/]) but it is often more efficient to work with a colored print of the MSA to avoid having to switch windows frequently.\nHave the HHpred target-template alignment output for each template structure that you selected (from the results page from step 11a) printed out in color or on the computer screen.\nCreate a text version of the HHpred predicted target-template alignment(s), for manual modification and ultimately as input for modeling (step 14).\nNote: You can copy and paste this from the HHpred output to a text editor, or extract from the comprehensive HHpred results [.hhr] file offered for download. A format similar to [.aln] is recommended (over FASTA) to avoid mistakes during manual editing.\nVisually inspect the locations of the gap positions (proposed in the HHpred target-template output) on the superimposed template 3D-structures in UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/], and modify the target-template alignment following the guidelines below:\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig3.jpg\nFigure 3. Bridging undefined template regions (step 13d)",
    "(A) Modification of target-template alignment for human GLT8D1 modeling on human Glycogenin-1 (PDB:3QVB). Coordinates between P126 and P129 (ends are 4.8 Å apart) are resolved in the template but extremely variable, as superposition reveals. To treat this as if the connection were undefined, G127-W128 are de-matched in addition to protocol instructions (blue font). In the resulting model the (Gly)3 bridge (red font) will align with these 2 residues in the template and replace 37 residues in the target that cannot be modeled (D201-S237, red font). It marks their insertion site. Note: (1) Alternatively, G127-W128 could be deleted from the coordinate file for 3QVB manually, and SWISS-MODEL run with this user-provided template and a target-template alignment modified exactly as per step 14d. (2) This region is known in GT-A glycosyltransferases for its conformational diversity between families (“HV2”).20[href=https://www.wicell.org#bib18]\n(B) 3D-Close-up showing the resulting model (lilac/red) with two template structures (blue, green). Part of the structure is removed to emphasize the conserved metal site (black stick representation, numbering is for GLT8D1).\ntable:files/protocols_protocol_2282_13.csv\nFor each potentially disrupting insertion or deletion noted (step 13d and step 13e), inspect and compare the sequence alignments (HHpred prediction and (sub)family MSA). Are there any potential alternative locations, i.e., alignment alternatives less disruptive for modeling but still similarly plausible at the sequence level as the original proposal? Where none can be found, use the original location predicted by HHpred[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/].\nNote: Do not give in to the temptation to edit the target-template based on their two sequences alone, e.g., to obtain a seemingly better pair-wise percent sequence identity value. HHpred predictions have considered multiple sequence context in another way and will generally be superior to pair-wise alignment editing.",
    "Note: HHpred’s[href=https://toolkit.tuebingen.mpg.de/tools/hhpred/] alignment proposals are excellent starting points and TBM is possible directly from them. Gap position readjustments are recommended out of practical consideration, to avoid unnecessary disruptive deviations from the template structure and to minimize the risk that errors could lead to loose packing and hydrogen bonding disruption within in the core regions around the active site. No general claim or evaluation is made here that gap modification by expert judgment based on 3D local structural context yields more accurate MSAs and there is to our knowledge no software that facilitates such manual intervention effectively e.g., by interactively comparing MSA scores.\nIf any gap positions remain within highly variable regions in the MSA(s), consider consolidating insertion and/or deletion sites in the target-template alignment that are near one another.\nVerify that the 3D-location of the variable region(s) is not in the structural core.\nVerify that no highly conserved block in the MSA(s) is destroyed by consolidating. Otherwise, keep the multiple gaps.\nNote: Especially where score-based arbitration is precluded by the substantive evolutionary distance between the target and template proteins, consolidating gaps can help limit the number of disruptive events during TBM.\nMake all gap shifts that you feel comfortable with in the editable target-template alignment (step 13d). If you used an [.aln] equivalent format, open the alignment in e.g., Jalview[href=https://www.jalview.org/] to ensure both sequences (including gaps) have the same length and that no other errors occurred while editing it manually.\nConvert or save the aligned two sequences in FASTA format.\nProduce 3D-structural model(s) based on user-provided target-template alignment(s).\nGo to SWISS-MODEL’s entry page[href=https://swissmodel.expasy.org/]8[href=https://www.wicell.org#bib15] and choose “Start Modelling”.\nGo to “Supported User Inputs” (at the time of writing located on the right side of the webpage) and choose “Target-Template Alignment”.\nPaste or upload the alignment produced above (step 13i).",
    "After automatic validation, launch by clicking on “Build Model”.\nNote: If you get an error asking to choose a Biounit, following the renaming suggestion for the template sequence and re-entering will allow you to proceed.\n“Save all Project Data (except web files)”.\nNote: Most important among them will be the “Static Project Report”, and a file in the downloaded Archive called “model.pdb” with your model’s xyz-coordinates.\nExamine the model visually for plausibility.\nNote: For example, inspect the model(s) in UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/] superimposed onto the template structure bundle (step 12). Be particularly attentive to any artificial poly-Gly linker that you may have introduced in step 13 to bridge regions that lacked template coordinates.\nRenumber the structural file e.g., within UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/] (“Tools -> Structure Editing -> Renumber Residues”) so that it correctly reflects the reference numbering of your choosing (e.g., that of the UniProt[href=https://www.uniprot.org/] entry).\nSave your session as well as a copy in [.pdb] format (“File -> Save PDB…”).\nRepeat steps 13-14 with any alternative template(s) and target-template alignments that you would like to consider.\nFinally, superimpose a diverse selection of 3D-structural models (that you generated) with the bundle of template structures e.g., in UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/] like in step 12. This bundle will be helpful for designing mutations rationally in step 15.\nNote: Backbone deviation within the bundle provides a qualitative intuitive clue to the conformational diversity (and indirectly, to potentially limited accuracy) that must be anticipated in some regions. The active site region should superimpose nearly perfectly across all structures (RMSD(Calpha) <1Å).\nNote: For most human eyes, inspecting more than five homologous superimposed structures is difficult, in diverging regions even three can be challenging to follow. In most 3D-structure viewing programs, you can toggle the display of individual structures on and off while retaining them in your bundle.",
    "Note: Alternative excellent and reliable online TBM platforms exist. We favor SWISS-MODEL[href=https://swissmodel.expasy.org/] online here for two reasons primarily the option to provide a target-template alignment that is passed to the modeling process as is, and that co-crystallized entities in the template structure (including metal ions) are copied into the model if the binding residues are exactly conserved in the target. For example, our model of GLT8D1 based on XXYLT1 included the divalent cation (Mn2+) without further intervention due to the strongly conserved binding site in the GT-A superfamily, bound geometrically accurately in the active site.1[href=https://www.wicell.org#bib1]\nNote: There are TBM strategies also that utilize several template structures simultaneously (multiple template modeling), e.g., by averaging coordinates from automatically superimposed bundles. This may be interesting in some projects but in general, we recommend single template modeling for designing active site mutations and similar applications (where within the active site we benefit from preserving precise geometry of the potentially catalytic amino acid residues).\nAlternatives: For mutational design, we still favor manual-assisted methods but the recent successes and openness of Deep Learning developments for protein 3D-structure prediction offer a potential new shortcut to structural models in general, at least for monomeric structures. The pre-computed AlphaFold[href=https://alphafold.ebi.ac.uk/] predictions are particularly promising. Based on spot-check testing their coordinates can be expected to be of very high accuracy overall, although note that they are not focused as strongly on the catalytic core domain as manual TBM protocols are i.e., any deviation from the true structure could occur anywhere in principle. Once sufficient experience has been gained in practice with using them, it is likely that protocols like ours will be revised in the future to incorporate the use of publicly available, fully automated 3D-models more generally, e.g., from the leading AlphaFold[href=https://alphafold.ebi.ac.uk/]25[href=https://www.wicell.org#bib24] and RoseTTAFold[href=https://robetta.bakerlab.org/]26[href=https://www.wicell.org#bib25] efforts.",
    "Major step 4: Design site-directed mutations to support functional investigations in the laboratory, by considering the enzymatic mechanism\nTiming: ∼1 day\nIn GT-A glycosyltransferases, a good strategy for creating loss-of-function mutant proteins is to selectively impair the coordination of the essential divalent metal ion in its active site. The cation’s roles in catalysis may be to stabilize a nucleotide sugar donor substrate (e.g., UDP-glucose) and/or transition state conformation, and/or to engage as a Lewis acid or in another rate-enhancing interaction. Supported by a modeled 3D-structure and alignments generated as described above, we rationally designed mutants with reduced catalytic activity for GLT8D1, a member of the GT8 group of GT-A glycosyltransferases classified in Taujale et al.20[href=https://www.wicell.org#bib18] This was successful despite uncertain UDP-sugar donor substrate specificity in vivo, and in absence of any knowledge regarding its acceptor substrate1[href=https://www.wicell.org#bib1]\nChoose metal-coordinating target sites for mutation in the active site of your target.\nIn case that you used a different TBM program in step 14, or in case that SWISS-MODEL[href=https://swissmodel.expasy.org/] could not include a metal ion in your model because there was none reported in the template structure, you may have to infer the predicted ion position by displaying GT-A structures with coordinated metal ions in UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/], superimposed with your model.\nCritical: If the metal ion was omitted in the model, double-check that this was not due to errors in the input alignment.\nNote: For most GT-A targets, identify the residues that are primarily predicted to coordinate the Mn2+ (or an alternative cation) as suitable mutation sites, using the 3D-structural model.\nFor GT-A these should be three residues [DxD/H], and [H] if this motif is conserved in the target subfamily (Figure 4 in Taujale et al.20[href=https://www.wicell.org#bib18]).",
    "Critical: In the (sub)family MSA from step 9 or step 10, all critical metal-coordinating residues should be conserved positions across all natural homologs if there are no errors (exceptions are very rare).\nNote: If the fourth motif is not conserved in the target MSA, focus primarily on just the two sites in [DxD/H] when designing mutations.\nAlternatives: In such cases (where the fourth motif seems to be missing) look around in the structure and MSA because an alternative, potential third metal-coordinating residue might be used in this GT-A (sub)family (and predictable). It is also possible in principle that a divergent GT-A superfamily member has lost the ability to bind a cation here. However, this would be rare and affect catalytic function (see troubleshooting problem 1[href=https://www.wicell.org#sec7.1]).\nChoose smaller amino acids that lack the ability to coordinate “hard” metal ions as replacement for coordinating residue(s) in the designed mutants.\nSuitable substitution options for inhibiting the coordination of hard M2+ ions:\ntable:files/protocols_protocol_2282_14.csv\nNote: If only one of the metal-coordinating residues is mutated, we recommend alanine in order to eliminate coordination from that position. If multiple coordinating residues are mutated, structurally more similar residues could be a good alternative e.g., out of consideration for packing integrity, or to retain partial activity.\nBased on the surrounding local 3D-structure (i.e., neighboring residues and residues from farther away in the protein sequence that are packed against the active site), could the designed mutant protein fortuitously compensate for the modification at the coordination site? All mutations should be designed with the 3D-context and geometry for the specific target protein in mind.",
    "Consider whether another potential ligand residue is positioned adequately to contribute to the M2+ coordination sphere alternatively, specifically whether another potential ligand residue could move into the place of the original through a minor rearrangement during the folding process.\nIf yes, then design additional custom mutation(s) to reduce this risk, if possible.\nNote: For example, in GLT8D1 and in the GT8 superfamily to which it belongs, the [DxD] motif (D171-D173 in GLT8D1 UniProt numbering) is anchored by a salt bridge between an additional aspartate residue (D172 in GLT8D1) and an arginine residue (R76 in GLT8D1). To prevent that misfolding could move this aspartate into a previously Mn2+-coordinating position in two prospective, single site GLT8D1 loss-of-function mutants (D171A and D173A), an additional mutation was introduced pre-emptively in each mutant (D172S). Serine was chosen here due to its similarity in size to aspartate, and its modest polarity (i.e., to neither clash nor strongly impact on folding of the arginine partner R76). The resulting mutants (mAS1:D171A+D172S and mAS2:D172S+D173A) were both demonstrably catalytically impaired.1[href=https://www.wicell.org#bib1]\nNote: It is possible in UCSF Chimera[href=https://www.cgl.ucsf.edu/chimera/] to exchange the residues in the 3D-structural model according to the designed mutations if this is desired. Except for generating illustrative images, we do not recommend doing this because accurate atomic detail here rarely required (neither for effective mutant design nor for interpreting results/observations from laboratory validation and application), and difficult to guarantee even with more advanced methods (except in rare instances when a GT-A superfamily template is used for modeling a closely related target protein).",
    "Alternatives: The classic rational design strategy presented here is transferable in principle to select other enzyme activities that depend on coordinating a (hard) divalent metal cation throughout their respective superfamilies, or largely throughout. At minimum, a high-level mechanistic hypothesis is required for attempts to adapt the protocol (especially to an enzyme/activity that is not related to the GT-As). This could come from specific literature about the target protein or from crystal structure or review papers about the chosen templates if they are also catalytic. Additionally, there are highly valuable online resources like EMBL’s Mechanism and Catalytic Site Atlas (M-CSA[href=https://www.ebi.ac.uk/thornton-srv/m-csa]) that aim to compile the latest established information but do not contain insight for all families, yet (e.g., none was available for any GT8 family GT-A at the time of writing).\nNote: Generally, between a target enzyme and suitable templates from different (sub)families, the very central catalytic aspects and residues will often have been conserved. However, one must not expect the same for substrate specifics, or even co-factors. GLT8D1 and two viable template structure proteins within the GT8 clade,1[href=https://www.wicell.org#bib1],20[href=https://www.wicell.org#bib18] XXYLT1 (Xyloside xylosyl transferase 1, PDB:4WMA, E.C. 2.4.2.62) and Glycogenin-1 (PDB:3QVB, E.C. 2.4.1.186) are excellent examples for this.\nMajor step 5: Generate site-directed mutagenesis protein overexpression constructs\nTiming: ∼14 days\nTiming: ∼1 week (for step 16)\nTiming: ∼1 h (for step 17)\nTiming: ∼1 week (for step 18)",
    "In this part of our protocol, we describe the generation of several protein expression constructs to verify the in silico predicted enzymatic activity, as well as to reveal whether the designed substitutions of in silico predicted active site residues (step 15b and step 15c) affect the enzymatic activity of the protein under investigation (Figure 4[href=https://www.wicell.org#fig4]). Specifically, we describe the actual experimental set-up for generating the GLT8D1 mutation constructs used for the study Ilina et al.,1[href=https://www.wicell.org#bib1] but this protocol can be adapted to generate different overexpression constructs.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig4.jpg\nFigure 4. Schematic illustration of experiments described in major step 5 (steps 16–18)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig5.jpg\nFigure 5. Regulatory elements included in our expression plasmid useful for an increased protein expression\nThe human elongation factor promotor (EF1α) is known to drive high and efficient gene expression28[href=https://www.wicell.org#bib26]; the woodchuck hepatitis virus posttranscriptional regulatory element (WPRE) is a DNA sequence that upon transcription creates a tertiary structure enhancing insert expression; the SV40 poly-A sequence promotes transcript stability; the origin of replication (ORI) from SV40 enables the construct to be replicated in cells that express the SV40 large T antigen such as 293T cells that are used within described protocol.\nCritical: Ensure that your target vector contains the right elements to ensure proper and high expression in the cell system used for recombinant protein expression in major part 6 of this protocol. Important regulatory elements of our vector system used, resulting in high protein yield when executing following overexpression protocol are schematically illustrated in Figure 5[href=https://www.wicell.org#fig5]. Comparable overexpression constructs can be used (for more information read Makrides27[href=https://www.wicell.org#bib27]).\nNote: Vector-specific properties (e.g., position of restriction sites) have to be considered before starting this protocol section and adjusted respectively if required.\nGenerate overexpression construct of wild-type target protein.",
    "Note: The commercially available vector carrying the gene of our interest (GLT8D1) already contained a C-terminal HA-tag (pcDNA3.1-GLT8D1-HA).\nAlternatives: We used the hemagglutinin-tag (HA-tag) containing vector, as this is a standard in our laboratory. Alternatively, one may use other vectors with different tags, also with different tag localization (N- or C-terminal), depending on the protein of investigation. If there’s no commercial tag-carrying vector available, one can design and add an extra step to clone the gene sequence of interest in the pcDNA3.1-”Tag-of-interest” vector.\nNote: This protocol describes the cloning strategy of the tagged gene sequence from the commercially available vector into another vector suitable for lentiviral particle production (pCDH-EF1α-IRES-Neo) since the next steps of our experimental set up in Ilina et al.1[href=https://www.wicell.org#bib1] included transduction of cells with DNA sequence of the construct under investigation. However, a lentiviral plasmid backbone is not necessarily required for this protocol.\nAmplify the tagged insert (GLT8D1-HA) using primers that introduce XbaI and NotI restriction sites to generate XbaI-GLT8D1-HA-NotI insert.\nPrepare the PCR reaction mix as follows using primer set #1 (see key resources table[href=https://www.wicell.org#key-resources-table]):\ntable:files/protocols_protocol_2282_15.csv\nNote: Prepare primer mix in advance (1:1 mix of forward and reverse primers, final concentration 10 μM).\nNote: Master mix of water, buffer, dNTPs and polymerase can be prepared for several reactions if amplification of different template DNAs with different primers is planned in parallel.\nAlternatives: We used Phusion Hot Start polymerase[href=https://www.thermofisher.com/order/catalog/product/F549S] from ThermoFisher Scientific that is less sensitive to the temperatures on ice. Alternative products can be used e.g., from NEB (#M0530[href=https://international.neb.com/products/m0530-phusion-high-fidelity-dna-polymerase]) or APExBIO (#K1031[href=https://www.apexbt.com/fusion-high-fidelity-dna-polymerase.html]) but the protocols need to be adapted according to manufactures recommendations.\nRun PCR under following conditions using an annealing temperature of 61°C:\ntable:files/protocols_protocol_2282_16.csv",
    "Alternatives: Annealing temperature highly depends on the primers used. Please verify it for your primers and adjust the PCR program, if necessary.\nPause point: Rest on ice (up to 1 h) or store at -20°C until proceeding to the next step.\nPurify the insert (GLT8D1-HA) via gel electrophoresis on agarose.\nPrepare 1% agarose gel with Ethidium Bromide.\nAlternatives: if your lab is Ethidium Bromide-free, GelRedTM or GelGreenTM can be used as an alternative.\nLoad 50 μL of the PCR product mixed with 8 μL of 6× Gel Loading Dye and run for 60 min at 120 V.\nCheck the band size with the UV light, excise the correct sized band (for GLT8D1 amplicon with restriction sites: 1,177 bp).\nCritical: do not to expose the gel to the UV light for too long, since it may lead to undesired DNA damage.\nPerform the gel elution with QiaQuick gel extraction kit according to the manufacturer's protocol[href=https://www.qiagen.com/us/resources/resourcedetail?id=a72e2c07-7816-436f-b920-98a0ede5159a&lang=en].\nAlternatives: Other DNA gel elution kits can be used e.g., GeneJET Gel Extraction Kit[href=https://www.thermofisher.com/order/catalog/product/K0691], Monarch® DNA Gel Extraction Kit[href=https://international.neb.com/products/t1020-monarch-dna-gel-extraction-kit] or Zymoclean Gel DNA Recovery Kits[href=https://www.zymoresearch.com/collections/zymoclean-gel-dna-recovery-kits].\nMeasure the concentration of the eluted DNA using a photometer (e.g., Nanodrop or similar device).\nPause point: Rest on ice (up to 1 h) or store at −20°C until proceeding to the next step.\nPerform restriction digest of empty vector (pCDH-EF1α-IRES-Neo) and the (insert GLT8D1-HA) with XbaI and NotI enzymes.\nPrepare the digestion mix for each digestion probe as follows:\ntable:files/protocols_protocol_2282_17.csv\nAlternatives: If your protocol requires different restriction enzymes, make sure to adjust the restriction buffer, respectively.\nAlternatives: restriction enzymes from other companies than New England Biolabs[href=https://www.neb-online.de/en/cloning-synthetic-biology/restriktionsenzyme/], e.g., Thermo Scientific Restriction & Modifying Enzymes[href=https://www.thermofisher.com/lu/en/home/brands/thermo-scientific/molecular-biology/thermo-scientific-restriction-modifying-enzymes.html].\nGently mix the reaction by pipetting up and down and microfuge briefly.\nIncubate at 37°C for 2 h.",
    "For de-phosphorylation of the backbone add 2 μL of Alkaline Phosphatase in the vector digestion mix.\nIncubate at 37°C for 30 min.\nInactivate restriction enzymes at 65°C for 20 min.\nPause point: Rest on ice (up to 1 h) until proceeding with the next step. Alternatively, store at −20°C.\nPurify insert (GLT8D1-HA) and open vector (pCDH-EF1α-IRES-Neo) via gel electrophoresis on agarose (according to step 16b). Excise GLT8D1 insert of 1,177 bp and pCDH-EF1α-IRES-Neo vector fragment of 7,845 bp.\nLigation of purified vector (pCDH-EF1α-IRES-Neo) and insert (GLT8D1-HA).\nPrepare vector-insert (1:3) and vector only (negative control) mixes for ligation procedure as follows:\ntable:files/protocols_protocol_2282_18.csv\nNote: Vector-to-insert ratio is defined by their molar mass. Biomath Calculator[href=https://www.promega.lu/resources/tools/biomath/] is a useful online tool for calculation.\nAlternatives: Other ligases alternatively to NEB Quick ligase[href=https://international.neb.com/products/m2200-quick-ligation-kit] can be used e.g., T4 DNA Ligase from ThermoFisher[href=https://www.thermofisher.com/order/catalog/product/EL0011] or T4 DNA Ligase from Promega[href=https://www.promega.lu/products/cloning-and-dna-markers/molecular-biology-enzymes-and-reagents/t4-dna-ligase/?catNum=M1801]. The protocol needs to be adapted accordingly to the respective manufacturer's recommendations.\nGently mix the reaction by pipetting up and down and microfuge briefly.\nIncubate at 20°C–25°C for 5 min.\nRest on ice until (up to 1 h) proceeding to the next step.\nPlasmid amplification and purification (pCDH-EF1α-GLT8D1-HA-IRES-Neo).\nPrepare the LB agar plates with Carbomycin antibiotic (100 μg/mL).\nTransform 1 μL of the reaction into 50 μL of competent cells (NEB Stbl. E.coli) and incubate for 30 min on ice.\nAlternatives: Depending on the bacterial strain used, the type of media and/or antibiotics may vary. Please verify it with your available laboratory materials/equipment before starting.\nHeat shock for 35 s at 42°C and place on ice afterwards.\nAdd 400 μL of low salt LB media into the bacteria and pipette up and down gently.",
    "Transfer the bacteria on agar plates: one plate for ligation product of vector and insert and one plate for ligation product of vector only (as a negative control). Turn the plates upside down and incubate 16–20 h at 37°C.\nCritical: Upside-down placement is necessary to prevent formation of water condensate onto the agar that would prevent formation of single bacterial colonies.\nCheck the plates for ratio (ligation vs. control) and decide if 1–3 colonies can be expanded.\nCritical: If there is no difference in the colony numbers between the control and the ligation plates, the ligation reaction most likely did not work. Repeat the ligation reaction (including new negative control) again before proceeding with the next step.\nExpand 1–3 colonies by picking the single colonies and transferring them to the LB medium (5 mL).\nIncubate the picked colonies at 37°C 16–20 h, while shaking (220 rpm).\nAlternatives: in the current set-up we used colony expansion followed up with plasmid isolation and quality control, as the colony yield and quality check revealed good results. Alternatively, an additional step of colony PCR on a larger number of colonies (e.g., 8–16) can be introduced prior to plasmid isolation.\nPerform plasmid preparation for each colony with Macherey-Nagel Nucleospin plasmid kit according to manufacturer’s protocol[href=https://www.takarabio.com/documents/User%20Manual/PT4022/PT4022-1.pdf].\nAlternatives: Other commercial available kits for plasmid preparation can be used instead e.g., ZymoPURE Plasmid Miniprep Kit[href=https://www.zymoresearch.com/collections/zymopure-plasmid-kits/products/zymopure-ii-plasmid-miniprep-kit], Monarch® Plasmid Miniprep Kit[href=https://international.neb.com/products/t1010-monarch-plasmid-miniprep-kit] or QIAprep Spin Miniprep Kit[href=https://www.qiagen.com/us/products/discovery-and-translational-research/dna-rna-purification/dna-purification/plasmid-dna/qiaprep-spin-miniprep-kit/].\nMeasure the concentration of the plasmid DNA using a photometer (Nanodrop or similar device).\nSend the plasmids for Sanger sequencing using primers located within the backbone. Proceed only with plasmids with mutation-free sequencing results.\nPause point: Store plasmid DNA at −20°C until further use.\nDesign PCR primers for overlapping PCR to introduce desired mutations in your target proteins DNA sequence.",
    "Design primers manually or by using appropriate software e.g., we recommend designing overlapping PCR primers by using a SnapGene software[href=https://www.snapgene.com/] according to a standard manufacturer’s protocol. The tool “modify the primer” can be used to introduce a point mutation in the desired sequence.\nAlternatives: we used SnapGene software for visualization of cloning strategy and primer design since it is the standard software used in our laboratory; however, different software or programs may be used for any of this, depending on laboratory preferences and licenses (e.g., free software ApE plasmid editor[href=https://jorgensen.biology.utah.edu/wayned/ape/] or Benchling[href=https://benchling.com/]).\nOrder the oligo sequences at your company of choice using standard synthesis parameters (e.g., 10 nmol, 100 μM, without additional modifications, SePOP purified).\nGenerate mutation constructs by overlapping PCR. This step aims to generate a eukaryotic overexpression vector (pCDH-EF1α-IRES-Neo) that carries tagged insert (human GLT8D1-HA) with mutations in the metal ion-coordinating amino acids predicted to be crucial for its enzymatic activity (in step 15b).\nNote: This section describes the constructs we generated during our study.1[href=https://www.wicell.org#bib1] The first construct, named mAS1, generates a mutant protein in which asparagine (D) on position 171 is replaced by an alanine (A) and D172 is replaced by a serine (S) (pCDH-EF1α- GLT8D1[D171A/D172S]-HA-IRES-Neo). The second construct, named mAS2, generates a mutant protein in which D171 is replaced by an S and D173 by an A (pCDH-EF1α-GLT8D1[D172S/D173A]-HA-IRES-Neo).\nGenerate two overlapping fragments of the insert (GLT8D1-HA) carrying point mutations by PCR amplification of the wild-type sequence generated in step 16 (pCDH-EF1α-GLT8D1-HA -IRES-Neo). Use the custom-designed primers from step 17 (see key resources table[href=https://www.wicell.org#key-resources-table]; Primer set #2 + #3 for mutation mAS1; Primer set #4 + #5 for mutation mAS2).",
    "Repeat step 16a and step 16b to amplify and purify overlapping, mutated insert fragments 1 and 2. Excise the insert fragments of 548 bp (fragment 1) and 663 bp (fragment 2).\nPerform an overlapping PCR to generate mutated insert sequence carrying mAS1 or mAS2 point mutations (mAS1: XbaI-GLT8D1(171ASD173)-HA-NotI, overlapping region between the fragments: 34 bp; mAS2: XbaI-GLT8D1(171DSA173)-HA-NotI, overlapping region between the fragments: 35 bp). The PCR program is carried out in two consecutive steps:\nThe PCR mix containing both fragments, buffer, dNTPs, polymerase and water undergoes several PCR cycles to make sure that full length insert is produced from the two annealing fragments.\ntable:files/protocols_protocol_2282_19.csv\nAlternatives: We used Phusion Hot Start polymerase[href=https://www.thermofisher.com/order/catalog/product/F549S] from ThermoFisher Scientific that is less sensitive to the temperatures on ice. Alternative products can be used e.g., from NEB (#M0530[href=https://international.neb.com/products/m0530-phusion-high-fidelity-dna-polymerase]) or APExBIO (#K1031[href=https://www.apexbt.com/fusion-high-fidelity-dna-polymerase.html]) but the protocols needs to be adapted according to manufacturer's recommendations.\nRun 11 cycles of PCR.\ntable:files/protocols_protocol_2282_20.csv\nCritical: This step allows amplifying the full-length sequence carrying desired mutations, but the quantity of PCR product will not be enough for cloning. Therefore, it is crucial to proceed with the next steps (adding primers and running the second step of the PCR).\nAlternatives: Annealing temperature highly depends on the primers used. Please verify it for your primers and adjust the PCR program, if necessary.\nAdd 1 μL of the primer set #1 (see key resources table[href=https://www.wicell.org#key-resources-table]) to each reaction tube and run additional 25 cycles of PCR under following conditions to amplify the full length sequence that carries the desired mutation and restriction sites.\nNote: One primer mix is used for amplification of both mutants, since these primers are located outside of the mutated regions and are for the full-length sequence.\ntable:files/protocols_protocol_2282_21.csv",
    "Alternatives: Annealing temperature highly depends on the primers used. Please verify it for your primers and adjust the PCR program, if necessary.\nPause point: Rest on ice until proceeding with the next step (up to 1 h). Alternatively, store at −20°C.\nRepeat step 16b. Excise the mutation-carrying mutant inserts (GLT8D1-HA inserts of 1,177 bp).\nRestriction of empty vector (pCDH-EF1α-IRES-Neo) and the inserts (GLT8D1-HA) carrying mAS1 or mAS2 point mutations with XbaI and NotI enzymes according to step 16c.\nRepeat step 16b to purify the insert (mAS1-GLT8D1-HA or mAS2-GLT8D1-HA) and the open vector (pCDH-EF1α-IRES-Neo). Excise mutation-carrying insert (GLT8D1-HA of 1,177 bp) and vector fragment (pCDH-EF1α-IRES-Neo of 7,845 bp).\nLigate the purified mutation-carrying inserts (mAS1-GLT8D1-HA or mAS2-GLT8D1-HA) and the vector (pCDH-EF1 α -IRES-Neo) according to step 16e, following plasmid expansion and preparation following the steps noted in step 16d.\nAlternatives: in the current set up we used the overlapping PCR method for introducing point mutations in the plasmid, as it is a standard established technique in our laboratory. Alternatively, commercially available mutagenesis kits (e.g., QuikChange® Site-Directed Mutagenesis Kit[href=https://www.agilent.com/en/product/mutagenesis-cloning/mutagenesis-kits/site-directed-mutagenesis-kits/quikchange-ii-233117] or Q5® Site-Directed Mutagenesis Kit[href=https://international.neb.com/products/e0554-q5-site-directed-mutagenesis-kit]) may be used, especially if they are already established as a standard technique in your laboratory.\nMajor step 6: In vitro glycosyltransferase activity assay\nTiming: ∼3 days\nTiming: ∼4 h (for step 19)\nTiming: ∼1 h (for step 20)\nTiming: ∼3 h (for step 21)\nTiming: ∼1 h (for step 22)\nTiming: ∼3 h (for step 23)",
    "An in vitro assay should reveal whether the substitution of the in silico predicted active site amino acids affects the enzymatic activity of the protein under investigation. For this purpose, wild-type and mutated versions (wt, mAS1, mAS2) of the protein of interest will be overexpressed, purified and used for an in vitro glycosyltransferase activity assay (Figure 6[href=https://www.wicell.org#fig6]). The following section describes the use of Hek293T cells as mammalian cell-based recombinant protein expression system.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig6.jpg\nFigure 6. Schematic illustration of experiments described in major step 6 (steps 19–23)\nAlternatives: Cell-free protein synthesis or other host systems for recombinant protein expression can be used e.g., from insect, yeast, bacterial or algal depending on the origin and properties of the protein under investigation.29[href=https://www.wicell.org#bib28],30[href=https://www.wicell.org#bib29] In general, one should use a cell system matching to the origin of the protein under investigation.\nTransfect Hek293T cells using CaCl2-BES transfection method.\nNote: Mutated proteins will be overexpressed in Hek293T cell by transiently transfecting the cells with the respective plasmid DNA. There are several protocols for how to transfect cells. We used the CaCl2-BES transfection method as it is low cost. Calcium phosphate forms an insoluble precipitate with DNA, this complex then attaches to the cell surface where it is transported into cells by endocytosis. However, lipofection yields a higher transfection efficiency resulting in increased recombinant protein expression and should be preferably used over CaCl2-BES transfection when noticing insufficient protein amounts after immunoprecipitation (IP).",
    "Alternatives: We used the Hek293T human embryonic kidney cell line to overexpress our protein of interest. Hek293T cells express the SV40 large T antigen and therefore produce high amounts of recombinant proteins when using overexpression plasmids containing SV40 ORI. However, other mammalian cell lines can be used as well e.g., HeLa cells. For a review about general considerations to make when planning recombinant protein overexpression in mammalian cells, please refer to Khan.31[href=https://www.wicell.org#bib30]\nSeed 3 × 106 Hek293T cells in a 10 cm dish (around 30% confluence) in 10 mL culture media. Incubate the cells for at least 3 h at 37°C, 5% CO2 in a humidified atmosphere.\nDilute 25 μg of plasmid DNA in 375 μL ddH2O. Add 125 μL of 1 M CaCl2 and mix by pipetting up- and down several times. Slowly add 500 μL 2×BES solution dropwise into the DNA-CaCl2 mixture and incubate for 20 min at room temperature.\nNote: The formation of calcium phosphate DNA complexes becomes visible in the formation of fine haze.\nCritical: As the pH of the 2×BES solution is critical for proper complex formation, all solutions need to be adjusted to room temperature before use.\nCritical: It is very important to carefully and drop-wise add the 2×BES solution to the DNA-CaCl2 mix.\nCritical: Do not extend incubation time, as this will lead to increased aggregation of particles.\nAfter incubation apply the mix drop-wise onto the Hek293T cells and place the cells back into the incubator.\nNote: Particles should appear as fine haze under the microscope.",
    "Note: Cell number and reagents can be scaled up and down if required. We would recommend to maximum prepare a transfection-mix of 1 mL volume total, meaning that if you plan to upscale the experiment don’t upscale the reaction mix; instead prepare several mixes of max. 1 mL total. Increasing the volume leads to reduced formation of CaCl2-BES-DNA crystals.\nHarvest transfected cells and perform target protein extraction.\nRe-fresh the media after 6–10 h post transfection.\nCritical: Longer incubation times will increase cell death.\nCollect the cells 48 h post transfection,\nFlush them two times with ice-cold PBS.\nAdd 2 mL of ice-cold PBS, and directly scrape the cells off the surface.\nQuickly collect the cells in a 15 mL tube on ice.\nNote: Scraping already destroys the outer membrane and thereby increases lysis efficiency. One can use trypsin instead to detach the cells from the surface but be careful as trypsin might interfere with your protein of interest.32[href=https://www.wicell.org#bib31]\nCentrifuge the cells for 3 min at 300 g and remove the supernatant.\nNote: No pause point at this step, directly proceed to protein extraction as freeze thawing seems to affect enzyme activity and might change results of the activity assay.\nNote: All steps of protein extraction should be strictly performed on ice or at 4°C.\nLyse the cell pellets in non-denaturing extraction buffer for 30 min on ice, while pipetting up and down several times each 10 min of incubation.\nAlternatives: Adapt your extraction buffer if required depending on the properties of your protein of interest.",
    "Critical: The detergent used in this buffer is relatively gentle and allows solubilization of proteins that retain enzymatic activity, but this may result in extractions that are less complete than with extraction buffers using detergents that are more stringent. Eventually upscale amount of cells to compensate for that effect.\nNote: The amount of lysis buffer applied is dependent on the size of the cell pellet. As a rule of thumb, the volume of protein extraction buffer should be three times the volume of cell pellet. We usually applied 500 μL protein extraction buffer on a cell pellet collected from an 80%–90% confluent 10 cm plate of Hek293T cells.\nAfter lysis, centrifuge for 15 min 16.000 g at 4°C, transfer the supernatant in a fresh tube and discard the pellet.\nNote: No pause point. Directly proceed to immunoprecipitation.\nPurify target protein by immunoprecipitation.\nNote: All steps of IP will be strictly performed on ice or at 4°C and with ice-cold buffers and solutions.\nWash 50 μL Anti-HA Magnetic Beads per IP reaction 3 times in each 300 μL extraction buffer.\nCompletely remove liquid after the last wash.\nUse a magnetic bar to separate magnetic beads from supernatant efficiently.\nAlternatives: When using a different tag than HA on your protein of interest use other coupled beads. We strongly recommend using a tagged protein for this experiments as this allows for peptide elution increasing the yield. Native elution without peptide is possible but requires adaption.\nApply the 500 μL protein extract onto the HA-magnetic beads and incubate for 1 h rotating at 4°C.\nNote: Seal the tubes containing the cell lysate-bead mix (e.g., with parafilm) to prevent leakage.\nSeparate the protein-coupled magnetic beads from the supernatant using a magnet.\nWash the protein-coupled magnetic beads twice with each time 300 μL lysis buffer.",
    "Wash one time with 300 μL PBS.\nDuring each washing step, invert the tube several times delicately.\nRemove liquid completely after the last washing step and re-suspend the protein-coupled beads in 50 μL HA synthetic peptide solution (c: 1 μg/μL in PBS) for target protein elution.\nIncubate for 1 h rotating at 4°C.\nSeparate beads from supernatant containing the protein.\nTransfer the supernatant into a fresh tube and discard the beads.\nOptional: Before proceeding with IP, keep a small fraction of the cell extract as an input control for immunoblot (about 1/20). Collect once more a 1/20 supernatant as control for immune blot. To validate efficiency of immunoprecipitation, control samples for input and supernatant were analyzed by immunoblotting. Ideally, the amount of detectable target protein by incubation with an antibody against the HA-tag reduces dramatically after immunoprecipitation.\nNote: No pause point. Directly proceed to the next step.\nDetermine protein concentration of purified protein.\nAlternatives: We used the Pierce BCA protein assay[href=https://www.thermofisher.com/order/catalog/product/23225] suitable for the detection of protein concentrations as low as 5 ng/μL. If you expect lower amounts or face problems detecting proteins using this kit, you can use other assays that are suitable for protein concentrations as low as 0.5 ng/μL (e.g., the BCA protein assay kit for low concentrations from abcam #ab207002[href=https://www.abcam.com/bca-protein-assay-kit-for-low-concentrations-ab207002.html]).\nDilute 2 μL of your elution sample in 48 μL PBS to prepare a 1:25 dilution.\nPipette 25 μL of your sample-dilution in duplicates into a well of a U-bottom 96 well plate.\nApply 25 μL of each standard in duplicates onto the plate. The standard is composed of the following BSA concentrations in PBS: 0 ng/μL, 5 ng/μL, 25 ng/μL, 50 ng/μL, 125 ng/μL, 250 ng/μL.",
    "Add 25 μL of the working reagent prepared according to the instruction of the manufacturer[href=https://www.thermofisher.com/document-connect/document-connect.html?url=https://assets.thermofisher.com/TFS-Assets%2FLSG%2Fmanuals%2FMAN0011430_Pierce_BCA_Protein_Asy_UG.pdf] into each well and mix using a plate shaker for 30 s.\nSeal the plate using parafilm or sealing tape and incubate for 30 min at 65°C.\nAfter incubation, quickly centrifuge the plate for 1 min at 300 g and cool the plate down to room temperature. Remove the tape and measure the absorbance at 562 nm using a plate reader.\nDetermine the protein concentration of your sample.\nCalculate the average of each duplicate (sample and standard).\nSubtract the value of the blank standard (0 ng/μL) from all other values.\nPrepare a standard curve by plotting the average blank–corrected 562 nm measurement value for each BSA standard according to its concentration in ng/μL.\nUse the standard curve to determine the protein concentration of your sample.\nNote: On average we yield concentrations around 30–50 ng/μL for each IP we performed according to this protocol.\nDetermine enzymatic activity of target protein by glycosyltransferase assay. We used the Promega UDP-Glo™ glycosyltransferase bioluminescent assay[href=https://www.promega.lu/products/cell-signaling/signaling-pathway-assays/udp-glo-glycosyltransferase-assay/?catNum=V6961] to detect glycosyltransferase activity of our target protein. Following the glycosyltransferase reaction, free UDP is converted into ATP, which is then converted into a luminescent signal that is proportional to the glycosyltransferase activity in the reaction. We designed our glycosyltransferase assay to analyze GLT8D1 wild-type and mutant (mAS1, mAS2) enzyme velocity for two different glycosyltransferase donor substrates (UDP-glucose and UDP-galactose).\nAlternatives: Based on the in silico sequence analysis we expected that our protein of interest possesses glycosyltransferase activity. More specifically, we were able to propose already a donor substrate preference for a hexose, possibly glucose. If your protein of unknown function shows similarities to enzymatic protein families other than the GT-A glycosyltransferases, you should use an activity assay designed to detect the respective enzymatic activity.",
    "Note: We used the UDP-GloTM Glycosyltransferase Assay kit from Promega and slightly adapted the manufacturer’s instructions.[href=https://www.promega.com/-/media/files/resources/protocols/technical-manuals/101/udp-glo-glycosyltransferase-assay-protocol.pdf?rev=27d988d982a04c3fa88c4fb7250ac3d9&sc_lang=en] To determine kinetic parameters of the glycosyltransferase reaction, multiple reactions with varying concentrations of the respective substrate were carried out simultaneously.\nNote: We took advantage of the fact that HA peptide can be an acceptor substrate for N-linked glycosylation.33[href=https://www.wicell.org#bib32] For this reason, we did not apply any additional acceptor substrate in our reaction.\nNote: We performed several glycosyltransferase activity assays in advance to figure out the optimal volumes, concentrations and conditions.\nNote: Ideally, the reactions are performed at least in duplicates.\nPrepare each set of reactions in a 384 well plate as follows:\ntable:files/protocols_protocol_2282_22.csv\nNote: in addition to the peptides under investigation, we applied one set of reactions without peptide as no-peptide control.\nPrepare a UDP-standard with the following concentrations in glycosyltransferase reaction buffer: 0 μM, 0.1 μM, 1.56 μM, 6.25 μM, 25 μM. Apply 10 μL of each standard concentration on the 384 well plate.\nIncubate the plate for 1 h at 37°C.\nAfter incubation, add 10 μL of detection reagent prepared according to the manufacturer's instructions[href=https://www.promega.com/-/media/files/resources/protocols/technical-manuals/101/udp-glo-glycosyltransferase-assay-protocol.pdf?rev=27d988d982a04c3fa88c4fb7250ac3d9&sc_lang=en] to each well and mix 30 s using a plate shaker.\nNote: This step terminates the reaction.\nIncubate the plate for 1 h at room temperature protected from light.\nTransfer each sample into a well of a white flat bottom 96 well plate.\nMeasure the luminescence signal (endpoint) using a plate reader. See Figure 7[href=https://www.wicell.org#fig7] for an exemplary plate set-up.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig7.jpg\nFigure 7. Exemplary set-up of a 96-well plate for luminescence measurement after glycosyltransferase activity assay (step 23)",
    "The reaction of each peptide with respective substrate concentration is applied in duplicates. Reactions incubated without peptide but with varying substrate concentrations serve as no-peptide control required for later quantification. UDP-standard ranging from 0 μM–25 μM is also applied in duplicates onto the plate.\nRefer to Figure 8[href=https://www.wicell.org#fig8] and the quantification and statistical analysis[href=https://www.wicell.org#quantification-and-statistical-analysis] section of this protocol for our method of glycosyltransferase activity assay data analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2282-Fig8.jpg\nFigure 8. Workflow—Determination of the substrate turnover rate based on the results of the glycosyltransferase assay (step 23)"
  ],
  "subjectAreas": [
    "Sequence Analysis",
    "Bioinformatics",
    "Protein Expression And Purification",
    "Molecular Biology",
    "Protein Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology",
    "Bioengineering & Technology"
  ]
}