{
  "id": 11962,
  "origin_website": "Jove",
  "title": "Isolation of Proximal Fluids to Investigate the Tumor Microenvironment of Pancreatic Adenocarcinoma",
  "procedures": [
    "For all patients enrolled, peripheral blood and pancreatic juice were collected at the time of surgery according to protocols approved by the Ethical Committee of the Institution. All the patients were enrolled in the study after signed informed consent including collection of biological specimens and clinical data. The study was approved by the Ethical Committee of the Institution (protocol number ICH-595, approval issued on May 2009). Procedures involving mice and their care were conformed to EU and Institutional Guidelines (protocol ID 121/2016-PR).\n1. Isolation of pancreatic juice\nNOTE: The withdrawal of pancreatic juice is executed in the context of an open procedure of pancreatic resection (e.g., pancreaticoduodenectomy, total pancreatectomy, distal pancreatectomy) by an equipe of expert pancreatic surgeons.\nPatient selection\n\t\nConsider for the procedure any patient scheduled for an open pancreatic resection.\nConfirm inclusion if main pancreatic duct size is deemed sufficient to allow pancreatic juice retrieval. The minimum limit in diameter of the main pancreatic duct is considered 2 mm at contrast-enhanced CT imaging.\nPre-operative study of pancreatic duct at contrast-enhanced CT imaging to help the planning of pancreatic juice retrieval\n\t\nTridimensionally localize the main pancreatic duct within the gland at the level of the pancreatic neck: measure the distance of the main pancreatic duct from the anterior, superior and inferior pancreatic margin on cross-sectional slides, and coronal and sagittal renderings. Once in the operating theatre, use these measurements to approximate the correct place where to puncture the pancreas to cannulate the Wirsung duct and to retrieve pancreatic juice.\nPreparation of material\n\t\nSterile material: Open the sterile envelope of one 25 G needle and one 3 mL syringe, and position them in the sterile field with the cooperation of the scrub nurse.",
    "Unsterile material: Keep a 3 mL K2EDTA vacuum test tube ready at hand in the operating room for the storage of the fluid.\nPreparation of the patient\n\t\nPosition the patient on the operating room bed. Induce mixed general anesthesia, using Remifentanil, Sevorane and Rocuronium, then intubate and start ventilating the patient. Position the patient in supine decubitus with the right arm tucked to the body and the left arm abducted to 90° degrees secured on an armboard.\nDisinfect the skin of the abdomen at the site of the incision. Create and maintain a sterile field on the abdomen draping the patient.\nSurgical procedure\n\t\nPerform a subcostal incision and gain access to the abdominal cavity. Position a Rochard abdominal retraction for organ exposure.\nExpose and mobilize the pancreas through Kocher maneuver, opening of the gastrocolic ligament, incision of the retroperitoneal tissue along superior and inferior border of the pancreas creating a dissection plane between pancreatic neck and superior mesenteric vein located posteriorly.\nOnce the pancreas is mobilized and exposed, proceed to pancreatic juice withdrawal before sectioning of pancreatic neck.\nIdentification and localization of the pancreatic duct\n\t\nEstimate the location of the pancreatic duct using the measurement taken at imaging and then palpate the anterior surface of the pancreas to identify its precise location.\nCollection of pancreatic juice\n\t\nHold the pancreatic head and the duodenum from underneath and elevate it with the left hand, marking the location of the pancreatic duct with the first digit.\nTake hold with the right hand of the 3 mL syringe with the 25 G needle mounted on.",
    "Use the right hand to insert the needle in the pancreas just distal to the left thumb. Decide the depth of penetration and the degree of inclination of the needle based on preoperative measurements and on the perception of having penetrated the duct wall.\nWithdraw the juice with the syringe. If it is not possible to retrieve the juice, relocate the needle in the four directions trying to cannulate the pancreatic duct.\nOnce the pancreatic juice is retrieved, move it outside the sterile field and transfer it to the 3 mL K2EDTA vacuum test tube. Keep at 4 °C until the sample is transferred to the lab and proceed to further processing as early as possible.\n\t\tNOTE: The volume of pancreatic juice that can be recovered with this procedure varies greatly, ranging approximately from 0.2 mL to 3 mL in our experience. The amount of juice retrieved is highly dependent on the patient: the dimension of the Wirsung duct and the functional status of the pancreas (functioning versus atrophic gland). In our experience there is no expedient that can be used to increase the amount of pancreatic juice retrieved.\n2. Processing of pancreatic juice\nCentrifuge pancreatic juice at 400 x g for 10 min at 4 °C to remove any cells or debris.\n\tNOTE: Pancreatic juice should be clear and transparent in color before centrifugation. Blood contamination during surgery can sometimes occur, making the sample appear murkier and redder in color. Consider excluding such samples from further analyses.\nRecover the supernatant, aliquot and store at -80 °C until further analyses.\n3. Induction of subcutaneous tumors",
    "NOTE: The murine Panc02 and DT6606 cell lines were obtained from Prof. Lorenzo Piemonti (San Raffaele Diabetes Institute, Milan, Italy) and Prof. Francesco Novelli (Center for Experimental Research and Medical Studies, Torino, Italy) respectively, as previously described12.\nGrowth of tumor cells\n\t\nCulture Panc02 and DT6606 cells in Roswell Park Memorial Institute (RPMI) 1640 medium containing 10% fetal bovine serum (FBS), 2mM L-Glutamine and 1% penicillin-streptomycin antibiotic.\nThaw frozen cells 1-2 weeks before tumor injection, according to the growth rate of the cell line.\nGrow cells at 37 °C with 5% CO2 and 95% humidity in sterile conditions.\nDetach cells with 0.025% Trypsin/EDTA solution for 5 min at 37 °C when they reach 80% confluency and eliminate trypsin by centrifugation.\n\t\tNOTE: DT6606 are primary, not immortalized, cells, derived from the LSL-KrasG12D-Pdx1-Cre mouse, and should not be passaged more than 3 times before injection in vivo in order to maintain their original characteristics. It is recommended to thaw DT6606 cells 7-10 days prior to injection.\nInjection of tumor cells in vivo\nTrypsinize cells (see step 3.1.4) and wash them once with Phosphate-Buffered Saline (PBS). Eliminate PBS by centrifugation and resuspend cells in fresh PBS before counting.\nCount the cells and resuspend them in PBS at a concentration of 0.5-1 x 107 cells/mL in order to have a final concentration of 0.5-1 x 106 cells/100 μL to inject in each mouse. Prepare the cells in excess. Keep the cells at 4 °C or on ice until the end of the procedure.\nGroup the animals (8-week old female C57BL/6J mice) in different cages according to different cell lines or treatments.\nRestrain the animals manually and anaesthetize them using a mixture of Ketamine (80 mg/kg) and Xylazine (10 mg/kg) or according to locally-approved procedures.",
    "Shave the site of injection, usually a flank above a leg, with an electric shaver and carefully clean the site of injection with alcohol.\nPipette up and down the cell suspension with a 1 mL syringe, removing any air bubbles by moving the piston up and down. Attach a 25 G needle to the syringe and push the piston upwards until the cell suspension reaches the needle opening.\nPinch the skin of the flank with flat-tipped forceps and carefully insert the needle at the base of skin fold between the forceps without puncturing the peritoneal cavity or the musculature. To verify the correct position of the needle, gently try to move the tip of the needle sideways under the skin. The needle should move freely.\nSlowly inject 100 μL of cell suspension (containing 0.5-1 x 106 cells), clamp gently the site of injection for a few seconds and slowly withdraw the needle without any sideways movement.\nReturn the mouse back to its cage and monitor the recovery from anesthesia.\nCheck tumor growth using a caliper for 3-4 weeks. Euthanize the animals when tumors reach approximately 0.5-1 cm3 using CO2 or according to locally-approved procedures.\n4. Isolation of tumor interstitial fluid (TIF)\nExcision of subcutaneous tumors\n\t\nBlock the limbs of the animals with paper tape and clean the skin with alcohol. Cut the skin open on the abdomen in order to separate it from the peritoneum and go on up to the limbs. Excise the tumor grown under the skin of the flank with the help of scissors, clamps and eventually a scalpel.\nWeigh the tumor and keep it in a clean tube on ice until following isolation of TIF.\nIsolation of TIF by centrifugation",
    "Cut the tumor in half, rinse the two parts quickly in PBS and blot them gently on filter paper to remove excess of PBS. Carry out these steps as fast as possible to avoid evaporation from the tumor.\nImmediately transfer the tumor into a 20 μm nylon cell strainer affixed atop a 50 mL conical tube.\nCentrifuge the tube at 400 x g for 10 min at 4 °C.\n\t\tNOTE: This low speed centrifugation preserves cell integrity avoiding contamination of TIF by intracellular compartment. Intracellular content leakage can be tested in downstream applications for example by assessing the presence of intracellular housekeeping proteins, such as ribosomal proteins25.\nRecover the TIF from the bottom of the tube, eventually aliquot it and immediately freeze it on dry ice and store at -80 °C until further analysis.\n\t\tOptional: Based on the downstream proteomic analysis to be performed, dilute the sample in PBS with a protease inhibitor cocktail to avoid degradation of specific molecules.\n\t\tNOTE: Depending on the composition of the tumor, in some cases very small tumors do not yield any fluid.\nIsolation of TIF by elution\n\t\nCut the tumor into small pieces (≈1-3 mm3) with scissors or a scalpel and rinse carefully with cold PBS.\n\t\tNOTE: In this step it is very important to work fast and perform minimum manipulation to avoid cell damage.\nTransfer the tumor pieces into a 1.5 mL tube and add 500 μL of PBS with a protease inhibitor cocktail to avoid degradation of analytes. Incubate for 1 hour at 37 °C and 5% CO2.\nRecover the supernatant and transfer it to a new 1.5 mL tube. Centrifuge at 1,000 x g for 5 min at 4 °C to remove any cells from the sample.",
    "Transfer the supernatant to a new tube and centrifuge again at 2,000 x g for 8 min at 4 °C.\nTransfer the supernatant to a new tube and centrifuge again at 20,000 x g for 30 min at 4 °C to remove any debris. Recover the supernatant. Immediately aliquot and freeze TIF sample on dry ice and store at -80 °C until further analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}