{
  "id": 7618,
  "origin_website": "Bio",
  "title": "Protocol to Isolate Germinal Centers by Laser Microdissection",
  "procedures": [
    "Preparation of lymphoid organs for isolation of GC by laser microdissectionTo enable transcriptional analysis, it is required to isolate GC while preserving mRNA at a high quality. Therefore, activated lymph nodes were fixed by snap-freezing in liquid nitrogen immediately after harvest and removal of adipose tissues (Figure 1A). Subsequently, tissues are stored in a -80°C refrigerator. Cryosections are prepared at -20°C using a cryomicrotom without allowing the tissue to thaw. To minimize the loss of RNA, two stainings are required to accurately identify GC: a short staining protocol with toluidine blue that preserves the mRNA and an immunohistochemical staining that allows the identification of GC and Tfh cells. To compare both stainings, serial cryosections were prepared on two slides: (i) a membrane slide for toluidine blue-staining and for laser microdissection; and (ii) a glass slide for immunohistochemical staining to visualize GC, T cells, and B cells (Figure 1B–1C and Figure 2). Of note, to preserve the mRNA, the incubation of the tissue sections in aqueous solutions should be as short as possible, such as the 2-2-2 min washing-toluidine blue-washing incubation described here (steps e–g). Because RNases lose most of their activity in dehydrated dried tissues (step h), the slides can be stored before further processing (step i).  For troubleshooting, to optimize the staining protocol and to test for RNA integrity, it is recommended to cut one whole section from the membrane slide before and after staining and compare RNA concentrations (either by OD measurements or by PCRs).Staining of cryosections on membrane slides with toluidine blue for laser microdissectionOptional: Expose membrane slides to UV light for 30 min at a distance of 400 mm for disinfection and to improve stickiness for tissue sections.Embed collected frozen lymph nodes in tissue freezing medium and cut until a plain cut-level is present.",
    "Cut 12 µm-sections of lymph nodes using a cryomicrotom and mount several individual sections on UV-treated membrane slides and on glass slides (Figure 1).Fix tissues in 75% ethanol for 10 min.Rinse membrane slides in laboratory-grade H2O for 2 min.Stain tissue by applying 0.1% toluidine blue for 2 min.Rinse two times in laboratory-grade H2O for 2 min.Dehydrate tissues by incubating in 96% ethanol for 15 s.Use slides immediately or store them at -80°C until further processing.Staining of cryosections for GC, T, and B cells on glass slidesTake the serial sections that have been mounted on glass slides.Dry slides at RT for at least 1 h.To fix tissues, incubate glass slides in chloroform for 10 min and acetone for 10 min. Afterwards, rinse tissues in TBS-Tween for 15 min and cover the lymph node section with 4% PFA and incubate them at 4°C for 45 min.Rinse glass slides in TBS-Tween for 10 min and draw a circle around each tissue section with a Dako Pen to confine the liquids during staining.Incubate sections with the first primary antibody anti-mouse Ki-67 at ambient temperature overnight (1:100 dilution in antibody solution).Wash unbound antibodies away by incubation with TBS-Tween for 10 min and add the first secondary biotinylated anti-rat IgG antibody (1:500 dilution in PBS with 5% normal mouse serum) for 30 min.Rinse with TBS-Tween for 30 min and cover tissue sections with ExtrAvidin Alkaline Phosphatase (1:100 in TBS-Tween) for 30 min.Rinse with TBS-Tween for 10 min and apply Fast Red staining solution for 25 min.Rinse with TBS-Tween for 10 min for removal of leftover staining solution.Incubate sections with the second primary biotinylated anti-mouse TCRβ antibody (1:50 in TBS-Tween) for 1 h and rinse glass slides in TBS-Tween for 10 min to remove the unbound antibody.",
    "Add ExtrAvidin Peroxidase (1:100 in TBS-Tween) for 30 min, wash slides in TBS-Tween for 30 min, and rinse glass slides in TBS-Tween for 10 min.Incubate sections with Liquid DAB+ Substrate for 5 min to visualize T cells and wash with TBS-Tween for 10 min.Add the third primary anti-mouse B220 antibody (1:100 in antibody solution) for 1 h and rinse with TBS-Tween for 10 min.Incubate sections with the second secondary biotinylated anti-rat IgG antibody (1:500 dilution in PBS with 5% normal mouse serum) for 30 min and wash in TBS-Tween for 10 min.Apply ExtrAvidin Alkaline Phosphatase for 30 min and rinse slides with TBS-Tween for 15 min.Add Fast Blue staining solution 10 min to stain B cells. Subsequently, rinse sections again in TBS-Tween for 15 min and mount them with Aquatex and coverslips.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4431/bioprotoc-12-11-4431-g001.jpgFigure 1. Preparation of lymph nodes for isolation of GC by laser microdissection. A. Activated murine popliteal lymph node. The surrounding adipose tissue was removed carefully before snap freezing. B. Serial cryosections of lymph nodes distributed on two slides, which were either stained with toluidine blue (left slide) or with anti-Ki67 (red) for proliferating cells, with anti-TCRβ for T cells (brown) and with anti-B220 for B cells (blue) (right side). The numbers indicate the order of serial sections. C. Example of two adjacent sections shown at higher magnifications. Toluidine blue-stained lymph node sections are shown on the left. Four GC are marked by white arrowheads (upper panel). Two GC are shown at a higher magnification on the lower panel. The immunohistochemical staining of the adjacent section on the right side confirms the identified GC (see Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4431/bioprotoc-12-11-4431-g002.jpgFigure 2. Workflow showing how the tissue is treated and processed in detail.",
    "Isolation of GC by laser microdissectionComparison of toluidine blue- and immunohistochemical-stained slidesPlace a usual light transmitted microscope close to the PALM MicroBeam microscope (Figure 3A).Take the toluidine blue-stained slides and dry them at RT for 10 min.Switch on the PALM MicroBeam microscope and put the slide with the toluidine blue-stained sections onto the slide holder of the object table.Open the Palm Robo software.Take the immunohistochemical-stained slide and put it on the object table of a usual light microscope that should stand close to the PALM MicroBeam microscope.Carefully compare the two slides for the identification of GC. Note that samples that were closer in cryosections must be compared together (e.g., identify the GC by comparing cryosections 1 to 2 and 3).Isolation of GC by laser microdissectionBefore activating the laser beam, prepare the cap of the microtube and moisten it carefully with a very thin layer of mineral oil.Put the cap and the microtube into the provided holder (Figure 3B).Following the instruction of the manufacturer’s protocol, adjust the laser beam to the digital pen of the painting app by using the Palm Robo software. In addition, use a spot on the slide that is not covered with tissue to select the thickness of the laser beam. This can be done by fine-tuning the laser energy and the speed of the microbeam mover.Cautiously surround the identified GC by using the digital pen of the painting app. It is required to carefully close the circled area with the digital pencil (Video 1).<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Laser capturing of lymphoid tissue compartments. A toluidine blue-stained section of a rat spleen is used as an example for the microdissection of a B cell zone from lymphoid tissues.1. The T- and B-cell zone can be clearly distinguished. 2.",
    "The area of interest, in this case, is a primary B cell follicle, which is circled using the drawing tool from the Palm Robo software. 3. The command “RoboLPC” from the Palm Robo software activates the laser beam to cut the marked tissue and the underlying membrane. An additional UV laser pulse catapults the isolated area into the cap of the microtube.Place the cap holder directly over the slide to collect these predefined areas (Figure 3C).Activate the laser beam to cut and catapult the isolated area by using the command “RoboLPC”. The UV-laser cuts the marked line and catapults the GC into the cap of the microtube (Video 1 and Figure 3D).After collection of GC tissue (here: 2 × 106–10 × 106 µm2 per sample), remove the cap and microtube. Pool all microdissected and catapulted tissue pieces by closing the microtube with the cap and spinning down with a centrifuge. Collected tissues can be used for subsequent analysis.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4431/bioprotoc-12-11-4431-g003.jpgFigure 3. Equipment to isolate GC by laser microdissection. A. The workplace shows the PALM MicroBeam microscope for laser capturing the tissues (left side) and the transmitted light microscope for immunohistochemical-stained sections to ensure the correct identification of GC (right side). B. A microtube is positioned into the holder. The white arrow indicates the membrane slide that contains the toluidine blue-stained sections in the slide holder. C. The cap- and microtube-holder must be placed directly over the slide to collect the catapulted tissues. D. The microdissected pieces of tissues can be clearly seen as toluidine blue-stained spots at the bottom of the microtube caps."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}