{
  "id": 13756,
  "origin_website": "Jove",
  "title": "Protocols for Obtaining Zygotic and Somatic Embryos for Studying the Regulation of Early Embryo Development in the Model Legume Medicago truncatula",
  "procedures": [
    "1. Zygotic Embryo Development\nPlant Material\n\t\nGrow the Medicago truncatula wild type Jemalong or its near isogenic, highly re-generable genotype Jemalong 2HA13 (known as 2HA) in a glasshouse with a 14 hr photoperiod and 23 °C/19 °C day/night temperature.\n\t\t\nPierce the surface of the seed coat (with a 23 G needle) prior to sowing the seed so that water is allowed to enter the seed and soak in water overnight. Add enough water to fully cover the seed.\nSow 3 seeds in each 15 cm diameter pot (total of 10 pots) in potting mixture (coarse sand, perlite, coir-peat (1:1:1) plus 5 g of Osmocote Exact Standard: slow release fertilizer) and transfer to the glasshouse. Retain the healthiest seedling after germination so there is 1 plant per pot and surround by a trellis for the plant stems to climb.\nHarvesting Pods\n\t\nCollect pods from the wild type Jemalong or 2HA to obtain the appropriate early embryo stages as first described9.\n\t\tNOTE: The different pod stages are shown in Figure 1 and the corresponding embryo stages are shown in Figure 2.\nCheck the different pod stages at harvest using criteria as per Table 1. Measure the time elapsed from stage 6 to help separate stages 6 and 7 (Table 2).\nDissecting ovules from pods and checking the embryo stage\n\t\nIsolate ovules from pods using fine forceps alone or a stereo dissecting microscope and forceps as necessary. If required the embryo stage can be quickly checked using a standard compound microscope (Figure 3B).\nPrepare modified Hoyer's solution containing 7.5 g gum Arabic, 100 g chloral hydrate, 5 ml glycerol, 60 ml deionized distilled water. Dissolve by stirring for 3-5 hr or overnight.",
    "For more refined microscopy clear the dissected ovules in modified Hoyer’s solution15,16. Carefully pick up the intact ovules and place in a small volume of Hoyer’s solution (enough to cover the ovule) at room temperature until clear.\nView the samples with differential interference contrast (DIC) optics. Capture the images iwth a digital camera9 (Figure 2).\nObtain the most uniform ovules from the central region of the pod and accumulate the required number. An example is shown in Figure 3A. Collect the ovules on ice and store at required temperature (-80 °C for nucleic acids) for further analysis.\n\t\tNOTE: For details on analysis of histological sections, transmission electron microscopy, and in situ hybridization please see papers8,9.\n2. Somatic Embryo Development In Vitro\nUse an M. truncatula cultivar that is able to readily form embryos in culture. For this protocol for leaf explants use 2HA plants13,17 that are 2-4 months old.\nTake leaflets from the latest nearly fully expanded trifoliate leaf of an elongating stem.\nKeep the trifoliate leaves on moist paper toweling in a culture pot to avoid dehydration.\n\tNOTE: Once the trifoliate leaves are harvested they need to be utilized with minimal delay.\nPreparation of the culture medium\n\t\nUse the P4 10:4:1:5 medium in agar (0.8% w:v) in 9 cm Petri dishes.\n\t\tNOTE: The P4 10:4:1:5 medium consists of the P4 basal medium18 plus 10 μM 1-naphthaleneacetic acid (NAA), 4 μM 6-benzylaminopurine (BAP), 1 μM abscisic acid (ABA) and 5 μM gibberellic acid (GA). The use of GA + ABA accelerates embryo formation and causes substantive increases in embryo number14.\nMake up the the P4 basal medium in 1 L; consisting of major salts (make calcium up separately), minor salts and vitamins (Table 3), chelated iron (make up separately), casamino acids (casein hydrolysate), 30 g sucrose, 8 g agar.",
    "Store stock solutions of major salts, calcium, casamino acids, minor salts and vitamins at -20 °C in suitable aliquots. Store chelated iron at 4 °C.\nMake up the chelated iron (200x) by dissolving 7.44 g of Na2EDTA•2H2O in approximately 900 ml of deionized distilled water while stirring, then bring the solution to 98-99 °C while adding 1.853 g of FeSO4•7H2O. Finally make up to 1 L when the ingredients are dissolved. Store in amber colored bottles at 4 °C.\nMake up the P4 basal medium with the stock solutions as in Table 4. The hormones in the medium are 10 μM NAA, 4 μM BAP, 1 μM ABA, 5 μM GA (see Table 4 and Specific Materials Table). Add the NAA and BAP prior to autoclaving and add ABA and GA after autoclaving and cooling to about 55 °C, using filter sterilization with a 0.22 µm filter attached to a syringe. Mix well by gentle swirling.\nAdjust the media to pH 5.8 with 1 M KOH prior to autoclaving. Autoclave at 121 °C for 20 min.\nAfter autoclaving add the filter sterilized ABA and GA, and pour approximately 25 ml of media into sterile 9 cm Petri dishes in a laminar flow hood or biohazard cabinet. Cool and let the agar set with the lid off. Then put on the lid and make sure there is no condensate on the lid. Label as required and store at 4 °C (in a cardboard box to prevent lid condensate).\nSterilization of Leaf Tissue\n\t\nWork in a UV-sterilized laminar flow hood or biohazard cabinet.\nPlace leaves into the mesh ball of a previously autoclaved spring tea infuser.\nImmerse tea infuser containing the leaves in 70% (v:v) ethanol in a culture pot for 30 sec.",
    "NOTE: For all steps in this procedure use 250 ml screw cap polycarbonate culture pots that are autoclaved.\nDrain and then transfer and immerse the leaf tissue in 1:8 (v:v) diluted bleach (0.5% chlorine) for 10 min. Swirl gently from time to time.\nDrain the bleach and transfer the tea infuser in a culture pot containing sterile deionized distilled water. Gently swirl and drain excess water. Repeat one more time with a fresh culture pot of sterile deionized distilled water.\nRemove leaves from the tea infuser with sterile forceps to a fresh culture pot of sterile deionized distilled water. Screw on the sterile cap and rinse by inverting and swirling. Leave leaves floating on the sterile water until ready to prepare explants.\nPreparing and Plating Explants\n\t\nUsing sterile techniques, trim individual sterilized leaflets from the edge with a scalpel, and cut the remaining rectangle into two or three rectangular explants (8-10 x 3-5 mm) with the mid-vein in the center of each explant (Figure 5A).\n\t\tNOTE: The size of the explant is quite important in initiating the first callusing. Carry out the cutting on sterile lids from take-away food containers.\nPlate 6 explants on agar-solidified culture medium in 9 cm diameter Petri dishes (Figure 5B). Plate the explants abaxial side down to maintain usual leaf orientation.\nSeal the Petri dishes with Parafilm (Figure 5C) stretched around the dish. The tissue is now ready for incubation.\nTissue Incubation\n\t\nIncubate the plates in the dark at 28 °C in a controlled temperature room or growth cabinet throughout the culture period.\n\t\tNOTE: The explants will initiate dedifferentiation, undergo cell division, proliferation (callus formation) and embryogenesis (differentiation).",
    "Subculture the differentiating explants after 3 weeks on to fresh medium. At this subculture transfer the whole explant using a sterile stainless steel spatula and forceps, in a laminar flow hood or a biohazard cabinet. As callusing occurs and the callus exceeds the size of the largest one in Figure 5C, transfer 50% of the individual callus when subculturing to fresh medium.\nObserve the first embryos in about 4 weeks. While there is a degree of synchrony, collect different embryo stages over a 4-8 week incubation period (Figure 6A,B). Collect under a dissecting microscope and process according to experimental objectives.\nSubculture every 3 weeks and remove embryos periodically so that the explants will continue to produce embryos for 3 months.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}