{
  "id": 19593,
  "origin_website": "Jove",
  "title": "Efficient and Cost Effective Electroporation Method to Study Primary Cilium-Dependent Signaling Pathways in the Granule Cell Precursor",
  "procedures": [
    "All animal-related procedures were carried out in compliance with animal handling guidelines and the protocol approved by the Department of Health, Hong Kong. Animal experiment licenses following Animal (Control of Experiments) Ordinance (Cap. 340) were obtained from the Department of Health, Hong Kong Government. The animal work was carried out in compliance with the animal safety ethics approved by HKBU Research Office and Laboratory Safety Committee. Refer to the Table of Materials for details about all materials used in this protocol.\n1. Preexperiment preparation\nPreparation of culture media and buffers\n\t\nSerum-free medium (SFM)\n\t\t\nTo prepare 50 mL of SFM, add 500 µL of 100x L-glutamine substitute, 500 µL of Penicillin-Streptomycin, 1 mM of sodium pyruvate, and 12.5 µL of 1 M KCl (final 250 µM) to 49 mL of Neurobasal medium.\nSplit the SFM into 2 aliquots of 10 mL and 40 mL in 50 mL conical tubes and store them at 4 °C for up to one month.\nDigestion blocking medium: 10% FBS in SFM\n\t\t\nAdd 1.1 mL of heat-inactivated FBS to a 10 mL aliquot of SFM to prepare digestion blocking medium.\nGCP culture medium: SFM with B27\n\t\t\nTo prepare GCP culture medium, add 800 µL of serum-free B-27 supplement to a 40 mL aliquot of SFM.\n\t\t\tNOTE: B-27-supplemented SFM can be stored at 4 °C for up to one month. However, freshly prepared media produce optimal outcomes.\nDissection buffer: EBSS with glucose + HEPES\n\t\t\nAdd 6 g/L of glucose to calcium- and magnesium-free Earle's Balanced Salt Solution (EBSS) containing 10 mM HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid).\nSterilize the solution by passing through a 0.2 µm syringe filter and store it at 4 °C for long-term storage.\nDigestion Buffer\n\t\tNOTE: Prepare freshly before use.",
    "Prepare 2 mL of digestion buffer for the digestion of 2-4 cerebellar tissues and 4 mL for 4-10 tissues. To prepare 4 mL of digestion buffer, dissolve 1.5 mg of L-cysteine (final concentration 200-400 µg/mL) in 4 mL of EBSS. Invert the tube repeatedly until the powder is fully dissolved.\nSterilize the solution using a 0.2 µm syringe filter and a 5 mL syringe, and transfer the solution to a sterile 35 mm cell culture dish.\nAdd 4 µL of papain (1:1,000 dilution from a stock concentration of 20 units/mg) and 40 µL of DNase I (1:100 dilution from a 10 mg/mL stock for a final concentration of 0.1 mg/mL).\nIncubate the solution at 37 °C in a CO2 incubator for at least 30 min or until use.\n\t\t\t​NOTE: This step is critical to activate the papain. For optimal outcomes, do not exceed 45 min at 37 °C before use. Ensure the solution turns transparent and there are no white precipitates before use.\nPrecoating coverslips\n\t\nTo prepare the coverslips for cell attachment, incubate autoclaved 12 mm glass coverslips with 100 µg/mL of poly-D-lysine (PDL, 1 mg/mL in sterile dH2O) for at least 1 h at 37 °C. Keep the coverslips in the same PDL solution at 4 °C until use.\nOn the day of primary cell culture, collect the PDL in a clean conical tube and rinse the coverslips three times with sterile dH2O thoroughly to remove residual PDL.\n\t\tNOTE: The PDL can be stored at 4 °C for reuse.\nTransfer the PDL-coated glass coverslips onto a 24-well plate by placing one coverslip in each well.\nRemove excess water and add 200-300 µL of Matrigel (reconstituted according to the instructions in the product datasheet in serum-free DMEM-F12) to fully cover the coverslips.",
    "Incubate the coverslips in the Matrigel for 1 h at 37 °C in the CO2 incubator.\n\t\tNOTE: Remove the Matrigel before cell seeding. This Matrigel can be collected and stored at 4 °C for multiple reuses.\nPreparation of preplating culture dish\n\t\nCoat a 60 mm cell culture dish with 2 mL of 100 µg/mL PDL (reconstitute the 1 mg/mL PDL stock solution in sterile dH2O) by incubation at 37 °C for 1 h.\nImmediately before cell seeding, remove and collect the used PDL in a clean conical tube and store it at 4 °C for multiple reuses. Rinse and wash the PDL-coated dish three times with sterile dH2O. Air-dry the culture dish before cell seeding.\nUse one 60 mm cell culture dish to seed cells harvested from a maximum of 2 whole-cerebellum tissues.\nPrepare additional culture dishes for additional cerebellums.\n\t\t​NOTE: See steps 2.1.18 and 2.1.19 for the use of the preplating culture dish.\n2. Experimental day 0\nIsolation and culturing of mouse primary GCPs\n\tNOTE: The GCP culture method was modified from a standard protocol, and the brief protocol was briefly described in our previous work6,11,12. For optimal GCP yield, use postnatal (P) day 6 or P7 pups for the isolation of GCP. Complete the following dissection steps 2.1.6-2.1.10 as quickly as possible for optimal cell viability.\n\t\nPrewarm SFM, digestion blocking medium, culture medium, and Opti-MEM at 37 °C during dissection.\nOn a clean bench, presoak all the dissection apparatus in 70% ethanol for disinfection.\nFill a 60 mm cell culture dish with 2-3 mL of dissection buffer and chill it on ice.\nPrepare fresh digestion buffer as described in section 1.1.5 and keep it warm at 37 °C.\nUse 70% ethanol to wipe the head of the pup for disinfection.",
    "Decapitate the pup without anesthesia. Use forceps to hold the head and sterilized surgical scissors to cut from the back of the skull to decapitate the pup. Carefully remove the skin and skull to uncover the brain by using forceps.\nUse forceps to pinch off the cerebellum and quickly soak it in the pre-chilled dissection buffer prepared in step 2.1.3.\nRemove the meninges with the cerebellum submerged in the dissection buffer under a dissecting microscope. Blood vessel-enriched meninges should appear pinkish under the dissecting microscope.\nRemove all the meninges using forceps.\n\t\tNOTE: A cerebellum without meninges should have a whitish appearance.\nRemove any visible midbrain tissues and the choroid plexus from the cerebellum.\nTransfer the cerebellum to a 35 mm culture dish prefilled with warm digestion buffer prepared in step 2.1.4. Avoid transferring excess dissection buffer. Cut the cerebellum into fine pieces using microspring scissors as quickly as possible.\nImmediately incubate the minced cerebellum at 37 °C for 15 min in a CO2 incubator. Extend the incubation time to 20 min if more than 4 cerebellums are to be processed.\n\t\tNOTE: After incubation, the tissue will clump together.\nImmediately transfer the digested tissue to the bottom of a new sterile 15 mL centrifuge tube using a P1000 pipette tip prewet with digestion blocking medium (avoid transferring digestion buffer).\nAdd an appropriate volume of digestion blocking medium (1 mL for 1 cerebellum) to terminate the digestion and pipette up and down gently 30 times using a P1000 micropipette to further dissociate the tissue into a single-cell suspension. Avoid air bubble formation.\nGently pass the cell suspension through a 70 µm cell strainer into a new sterile centrifuge tube to remove cell clumps.",
    "Pass an additional 1 mL of fresh digestion blocking medium through the cell strainer to collect residual cells from the cell strainer.\nCentrifuge the filtrate at 200 × g for 5 min at room temperature (RT). Remove the supernatant and resuspend the pellet with 1 mL of SFM. Repeat this step twice. Avoid forming air bubbles.\nResuspend the pellet in a final volume of 2 mL of GCP culture medium and transfer the cell suspension to the PDL-coated 60 mm preplating culture dish prepared in step 1.3. Incubate for 15 min at 37 °C in a CO2 incubator.\n\t\tNOTE: Do not exceed 20 min.\nAfter incubation, tap the culture dish from the side to dislodge the loosely adherent GCP cells. Collect the adherent GCP cells in culture medium by gentle pipetting using a P1000 pipette. Collect this GCP suspension into a new 15 mL centrifuge tube. Discard the 60 mm dish.\n\t\tNOTE: Strongly adherent astroglia and fibroblast cells will remain attached on the 60 mm dish bottom and will be separated in this step. Omitting this step will compromise the purity of the GCP culture.\nCount the cells and proceed to electroporation immediately.\nDay in vitro (DIV) 0: Electroporation for Hh receptor transgene overexpression: pEGFP-Smo\n\t\nFor electroporation using a 2 mm gap cuvette, prepare the following plasmid-cell electroporation mixture for each reaction of electroporation: 1.2 × 106 cells and 10 µg of pEGFP-mSmo (adjust the DNA stock concentration to ~2-5 µg/µL in Tris-EDTA buffer or sterile dH2O) in 100 µL of Opti-MEM.",
    "NOTE: Reduce the total cell number if the cells are insufficient (though this may reduce the electroporation efficiency). However, do not adjust the amount of plasmid nor the total volume of Opti-MEM used per cuvette. If the total cell number required for the experiment exceeds 1.5 × 106 cells, scale up the electroporation mixture accordingly and perform multiple electroporation reactions separately. The cuvette may be reused up to 5 times.\nPrepare the post-electroporation cell seeding plate by adding 0.5 mL of culture medium into each well of the 24-well culture plate containing coated coverslips (from step 1.2) and keep it warm at 37 °C in a CO2 incubator.\nFrom step 2.1.20, pipette the required number of cells into a sterile 1.5 mL microcentrifuge tube and spin at 200 × g for 5 min at RT. Discard the supernatant and resuspend the cell pellet in 200 µL of Opti-MEM. Repeat this step twice with Opti-MEM to ensure no residual culture medium is present in the tube\n\t\tNOTE: For every well/coverslip of a 24-well plate, electroporate and seed 1.2-1.3 × 106 cells/well to obtain ~70-75% cell confluency on the next day of culture.\nSet the parameters of electroporation as shown in Table 1.\nPipette the electroporation reaction gently to mix well and use a long P200 tip to transfer an exact volume of 100 µL of the mixture into the 2 mm gap cuvette. Avoid forming bubbles.\nPlace the cuvette in the cuvette chamber.\nPress the Ω button of the electroporator (see the Table of Materials) and make a note of the impedance value, which should be ~30-35. To ensure the electric impedance value Ω falls within the range of 30-35, adhere to a precise volume of 100 µL.\nPress the start button to initiate the pulse.",
    "Record the values of the measured current and joules shown on the reading frame.\nRemove the cuvette from the cuvette chamber.\nImmediately add 100 µL of prewarmed culture medium into the cuvette and resuspend it by gentle pipetting up and down 2-3 times. Immediately transfer the cell suspension to the 24-well plate prepared in step 2.2.2.\n\t\tNOTE: To minimize cell death, seed the cells immediately after electroporation.\nIncubate the cells at 37 °C in a CO2 incubator. Leave the cells undisturbed for 3 h to avoid cell detachment.\nAt 3 h post seeding, gently aspirate and discard half of the supernatant medium to remove floating dead cells and debris and replace with the same amount of prewarmed culture medium.\nIncubate the cells at 37 °C in the CO2 incubator and replenish half of the medium every other day.\nObserve the cells under the fluorescence microscope on the next day, i.e., DIV1 (Figure 1) for GFP signal to determine the efficiency of Smo overexpression.\nFor the stimulation of the Hh signaling pathway on DIV 1 after replenishing half of the medium, add 0.2 µM Smoothened agonist (SAG) to the cells while adding an equal volume of DMSO to the control. Incubate for 24 h prior to cell fixation.\n\t\t​NOTE: Keep the volume of DMSO/SAG added as low as possible. Here, 0.5 µL DMSO or 0.5 µL of 0.2 mM SAG was added per 500 µL of medium per well, which is a dilution ratio of 1:1,000.\n3. DIV 2: Visualization of primary cilia and investigation of the Hh signaling pathway\nCell fixation\n\t\nAt 24 h post treatment, remove the culture medium and rinse the cells 2-3 times with phosphate-buffered saline (PBS) using a disposable Pasteur pipette while avoid dislodging the cells.",
    "Fix the cells by adding ~400 µL of 4% paraformaldehyde (prepared in PBS) and incubate at RT for 10 min.\nRinse and wash 2-3 times with PBS using a disposable Pasteur pipette.\nStore in PBS at 4 °C for up to 2 months or proceed to immunostaining.\nImmunocytochemical staining of GCPs and primary cilium marker\n\t\nIn a 24-well plate, washthe cells twice in PBS with gentle shaking for 5 min each time.\nAdd 0.5 mL of 100 mM ammonium chloride to the cell and incubate at RT for 10 min to quench the fixative.\nRinse once and wash 2-3 times with PBS with gentle shaking for 10 min each time.\nGently pipette 30 µL of blocking buffer (BB: 0.1% Triton X-100, 1% BSA, 2% heat-inactivated horse serum in PBS) onto a piece of parafilm to form a droplet without air bubbles.\nGently transfer the coverslip from the well onto the BB droplet with the cell-seeded side facing downwards. Incubate the cells with BB in a humid chamber for 1 h at RT.\nPrepare the primary antibody mix in BB as shown in the Table of Materials. To probe the cells with primary antibody, repeat steps 3.2.4 and 3.2.5, replacing BB with the primary antibody mix. Incubate the cells with the primary antibody for 2 h at RT.\nUsing forceps, transfer the coverslips back to the 24-well plate with the cell-seeded side facing upwards. Rinse the cells once and wash 3-4 times in PBS with gentle shaking for 10 min each time.\nPrepare the secondary antibody mix in BB as shown in the Table of Materials. To incubate the cells with the secondary antibody, repeat steps 3.2.4 and 3.2.5, replacing BB with the secondary antibody mix. Incubate in the dark for 1 h at RT.",
    "Repeat step 3.2.7 for post-secondary antibody incubation washing.\nMount the coverslip on a clean microscopic glass slide using mounting medium.\nAir-dry the slide in the dark overnight and proceed to confocal imaging13.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}