{
  "id": 4536,
  "origin_website": "Bio",
  "title": "Stable Transformation of Cyanobacterium <em>Synechocystis</em> sp.",
  "procedures": [
    "All the handling of Synechocystis cells was done in a flow cabinet. Sterile working conditions are critical throughout the whole procedure.   Synechocystis cells were maintained on BG11 agar plates under continuous illumination (20 μmol/m2/s) at 28 °C and were restreaked in 2-week intervals.    To generate batch cultures, 25 ml liquid BG11 medium (in a 100-ml-glass beaker) was inoculated with one inoculation loop of Synechocystis cells and cells were grown to an optical density (OD750) of 0.5 to 0.8 (mid-exponential growth) under continuous illumination at a light intensity of 20 μmol/m2/s at 28 °C and permanent agitation (150 rpm). Depending on the inoculation density it takes several days to about one week to reach the indicated OD750 of 0.5 to 0.8.   10 ml of cell cultures were centrifuged (5 min, 28 °C, 1,107 x g) and the cell pellet was resuspended in 5 ml BG11 medium and equally distributed to five sterile 2 ml-reaction tubes.    DNA (3 to 5 μg of circular plasmid DNA) was added and cells were gently mixed by tapping and incubated in darkness at 28 °C over night. To measure the viability and spontaneous mutation frequencies one aliquot was left without plasmid DNA and incubated in darkness at 28 °C over night.    Following dark incubation, 200 μl of the cell cultures were plated on BG11 agar plates (94 x 16 mm, see “Materials” for details) lacking antibiotics and incubated in continuous light at a light intensity of 20 μmol/m2/s at 28 °C.   After 2 days of incubation under constant light, the agar plates were supplied with antibiotics at a concentration of 15 μg/ml. Therefore, the agar was lifted with a sterile spatula and 1 ml of the appropriate antibiotic solution was applied to the bottom of the petri dish (Figure 1).",
    "In case several different antibiotics have to be applied prepare an antibiotic mixture containing each antibiotic combined in 1 ml of total volume.    Plates were sealed with tape to avoid drying-out and further incubated under continuous illumination at a light intensity of 20 μmol/m2/s at 28 °C. Colonies appeared after 2 to 3 weeks.    To achieve complete segregation, single colonies were picked and streaked on BG11 plates containing the appropriate antibiotics (see step 10 for appropriate antibiotic concentrations). When cells were gown (about one to two weeks) cells were streaked again on new BG11 plates containing the appropriate antibiotics. This successive streak purification was repeated at least four rounds (in total) to ensure segregation.    To check for positive genomic integration of the construct PCR on genomic DNA was performed. It might happen that complete segregation cannot be achieved even after several rounds of successive streak purification. This might happen when a gene knock-out is attempted of a gene, which is indispensable for viability of the cells. In such a case anti-sense approaches or overexpression of dominant negative forms might be applied to interfere with the function of the gene of interest.   Positive clones were maintained on BG11 agar plates containing appropriate antibiotics under continuous illumination (20 μmol/m2/s) and were restreaked in 2-week intervals. Common antibiotics used are chloramphenicol at 8 μg/ml, spectinomycin at 10 μg/ml, kanamycin at 10 μg/ml.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20141103/20141103232730_6366.jpg Figure 1. Applying antibiotics beneath the agar layer. A sterile curved spatula was used to lift the agar layer and antibiotic solutions were applied to the bottom of the petri dish."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}