{
  "id": 8730,
  "origin_website": "Jove",
  "title": "Quantifying Acute Changes in Renal Sympathetic Nerve Activity in Response to Central Nervous System Manipulations in Anesthetized Rats",
  "procedures": [
    "All methods described were approved by the Institutional Animal Care Committee at the University of Illinois at Chicago.\n1. Create Bipolar RSNA Electrodes\nTo create the electrode, cut two pieces of stainless steel wire each approximately 18 mm long. Cut one piece of polyethylene (PE-50) tubing approximately 15 mm long. Feed both pieces of wire into the tubing, leaving the wire protruding from both ends.\nRemove the insulation from the ends of the wires; trim the wires leaving 2-3 mm of exposed wire. On one end, crimp male pins over the exposed wire. Solder the pins securely to the wire, secure the pins inside a connector strip, and cover the connection with epoxy.\n\tNOTE: An alternative approach that avoids soldering is to use quick connect/release alligator clips.\nOn the opposite end of the electrode, remove the insulation from the ends of the wires, leaving 2-3 mm of exposed wire. Bend this portion of the wires to create small \"V\" shaped hooks in the uninsulated wire.\n\tNOTE: This is the portion of the electrode that will be in contact with the renal sympathetic nerve. It is important to seal this end to prevent fluids from entering the tubing. Silicone or epoxy effectively can be used.\n2. Administer Anesthesia and Prepare Surgical Sites\nAdminister anesthesia to a male Sprague Dawley rat (age 9-11 weeks, weighing 150-400 g). Administer pentobarbital sodium 50 mg/kg via an intraperitoneal (IP) injection. To assess a stable plane of anesthesia during surgery, check toe-pinch reflex every 15 min and re-dose anesthesia as needed.\n\tNOTE: Pentobarbital sodium (Nembutal) was used in previous studies to achieve a sustained plane of anesthesia without interfering with the modulation of RSNA4,5,6. This protocol is for non-survival surgery, so there is no recovery/post-operative monitoring period.",
    "Prepare the surgical site according to institutional animal care guidelines (i.e., shave the rat's abdomen, back, and head; cleanse the skin with 10% povidone-iodine solution; apply eye lubricant; and place the rat on a heating pad). Maintain the body temperature at 37 °C during the experiments.\n3. Cannulate the Femoral Vein (for Intravenous Access)\nAdd heparin to 0.9% sterile saline (to achieve 20 units/mL). Fill a 1 mL syringe with the heparinized saline through a 22G needle. Connect 15 cm of PE-50 tubing to the needle and fill tubing with the solution.\nWith the rat lying supine, create a 2 cm horizontal incision through the inguinal area. Using cotton-tipped applicators, dissect the connective tissue to expose the femoral vein and artery. To hold the incision open, either apply single-hook elastic surgical stays secured to the surgical field with silk tape or use small hemostats.\nUse hemostats to bend the tip of a 22G needle at a 90° angle to serve as a catheter introducer10.\nVisualize the vessels under the microscope. Gently separate the vein and artery using curved forceps. Place two 12 cm long 5-0 silk suture beneath the vein (one distal and one proximal); place the suture in the same manner beneath the artery.\n\t\nTie the distal (bottom) suture to occlude the vein; secure the edges of this suture to the surgical field using either silk tape or small hemostats. Gently pull the vein taut but not with so much force that the vessel will tear. Position the vein perpendicular to the surgeon's dominant hand.",
    "Use a loose overhand half knot in the proximal suture to briefly occlude the vein. With delicate hemostatic forceps, gently clamp this suture to occlude blood flow. Hold the 22G needle with the bent tip in the non-dominant hand; clasp the tubing with forceps using the dominant hand.\nPuncture a small hole in the vein with the catheter introducer (Step 3.3) and insert the PE-50 tubing (pre-filled with heparinized saline) into the vessel; use the bent needle to keep the opening in the vessel open and to assist in positioning the tip of the catheter into the vessel10.\n\t\nRelease the proximal suture and gently flush 0.2 mL of heparinized saline into the vein; advance the catheter. Check the blood return from the vein to ensure proper placement. Complete the proximal knot and, with distal suture tie, secure the tubing inside the vein.\nUse venous access during the experiments for administering supplemental anesthesia or medications and for blood collection. Incorporate a 3-way connector if regular intravenous infusions and blood sampling will be necessary. Check noxious toe-pinch reflex every 15 min to titrate anesthesia.\n4. Cannulate the Femoral Artery for Mean Arterial Pressure Monitoring\nVisualize the artery under the microscope. Similar to the method used for venous cannulation, tie the distal suture (Step 3.4) to occlude the artery; secure the edges of this suture to the surgical field with silk tape and position the artery perpendicular to the surgeon's dominant hand.\nArterial access if using a pressure transducer/infusion system\n\t\nConnect the pressure transducer/tubing to a 500 mL 0.9% saline bag. Flush the tubing with saline, removing all bubbles, and place the bag inside a pressure inducer bag to pressurize the system.",
    "As described in Step 3.1, fill a 1 mL syringe with the heparinized saline through a 22G needle and connect 15 cm of PE-50 to the needle (flush tubing with heparinized saline).\nUse a loose half knot in the proximal suture to briefly occlude the artery. Hold the catheter introducer (Step 3.3) in the non-dominant hand; hold the distal tip of the PE-50 with vessel cannulation forceps in the dominant hand. Puncture a hole in the artery with the bent 22G needle and insert the cannula into the vessel.\nRelease the proximal suture, gently flush 0.2 mL of heparinized saline into the artery and advance the catheter as far as possible. Check for arterial blood return to ensure proper placement. Complete the proximal knot and, with distal suture tie, secure the tubing inside the artery. Connect the arterial line to the pressure transducer/tubing.\n\t\tNOTE: The distal portion of tubing can be taped to the rat's hindlimb to secure the arterial line. An alternative approach to vessel cannulation is described by Jespersen et al.;11 their protocol differs by using retractors to spread the incision, glue-rather than suture-to secure the tubing, and the approach does not include the bent needle introducer.\nArterial access if using telemetry\n\t\nInspect the pressure-sensing catheter under high magnification before arterial cannulation. Ensure that the catheter is free of bubbles/debris and has an intact meniscus between the fluid-filled (proximal) and gel-filled (distal) components. Prior to each implantation, refill the gel at the distal tip of the catheter. Turn on the transmitter using a magnet; monitor BP during the surgery to endure perfect placement.",
    "Use a loose overhand half knot in the proximal suture to briefly occlude the femoral artery. Hold the catheter introducer (Step 3.3) in the non-dominant hand. Hold the tip of the cannula of the telemetry unit with vessel cannulation forceps to avoid displacing gel from the tip.\nPuncture a hole in the artery with the bent 22G needle and insert the cannula into the artery using vessel cannulation forceps to avoid displacing gel from the tip. Advance the cannula as far as possible. Using the proximal and distal suture ties, secure the pressure catheter.\nTuck the body of the telemetry implant inside the flank adjacent to the incision, and close this incision using 4-0 nylon suture on a cutting needle. Turn the telemetry devices off by magnet at the conclusion of the recording period to conserve battery life.\n5. Position the Rat in the Stereotaxic Surgery Frame to Access the Brain\nGently move the rat into the prone position in the stereotaxic surgery frame.\nPosition the rat between the ear bars, and adjust the incisor bar to equalize the height of lambda and bregma. Positioning may depend on the rat strain, weight, and locations of CNS targets.\nMake a 2 cm rostrocaudal scalpel incision through the midline of the scalp. Using cotton-tipped applicators, firmly remove connective tissue from the skull surface. Apply hydrogen peroxide to the skull to assist in visualizing the bregma, lambda, and midline sutures.\nUsing an atlas of the rat brain to guide targeting12, drill a burr hole osteotomy, sized for electrode access, through the skull.\n6. Isolating the Renal Sympathetic Nerves\nConnect the wire RSNA electrode (Steps 1.1-1.3) to a 10X pre-amplifier and microelectrode amplifier.",
    "Isolate the renal nerves through a retroperitoneal incision prior to, or after, the rat is secured in the stereotaxic frame. Position the RSNA electrodes once the rat is in the stereotaxic frame. Make a scalpel incision extending from 4-5 cm below the ribs in the caudal direction, slightly lateral to the spine. Blunt dissect the incision to visualize the paraspinal muscles.\nUse scissors to make a very superficial 1-2 cm rostrocaudal incision where the fat meets the muscle. Using cotton-tipped applicators, spread the fat away from the muscle to visualize the kidney. It is important not to enter the peritoneal space.\nUse retractors to gently separate the kidney from the paraspinal muscles to visualize the renal artery and abdominal aorta. Do not stretch the vessels excessively to avoid damaging the renal nerves. Use a 2\" x 2\" cotton gauze pad soaked in saline to protect the kidney from injury.\nUnder high magnification, identify the renal nerves in the incision pocket. The nerve bundles are most easily visible in the right angle formed by the aorta and the renal artery. The renal nerves closely follow the renal artery from the aorta to the kidneys.\nSelect a segment of the nerve bundle that will be placed on the recording electrode. Gently dissect the nerve fibers from the surrounding tissue/vessel using micro-dissecting tweezers.\nSecure the wire RSNA electrode in a holder (e.g., an alligator clip attached to a support stand). Lower the electrode to the level of the nerve segment. Use a nerve hook to gently lift the segment of the renal nerve onto the electrode without stretching the nerve.\n\tNOTE: The nerve should rest inside both \"V\" shaped hooks in the uninsulated wire, parallel to the nerve. The electrode wires must not touch any other tissue, blood, or lymph fluid.",
    "Fill the incision with mineral oil to prevent the exposed renal sympathetic nerve from becoming dry. Use a grounding clip with one end on the skin of the incision and the other attached to the Faraday cage.\nDirect the signal to the amplifiers using high- and low-pass filtering (10 Hz and 3 kHz). Adjust the gain up to 10 K. Include an audio monitor to assess the bursting pattern of the RSNA. Use sampling rates ranging between 2,000-10,000 Hz4,5,6,7,8. Use an increased sampling rate when a CNS manipulation is hypothesized to cause rapid/brief sympathetic responses.\n7. Record Data\nAssess the quality of the RSNA recording by evoking the baroreflex with a bolus injection of 1 mL of saline or 10 µg/mL phenylephrine (in 0.1 mL) intravenously. As illustrated in Figure 1, the infusion should increase BP and inhibit RSNA. An increase in mean arterial pressure of 60-80 mmHg is sufficient for renal sympathoinhibition4,13,14.\nAdjust the position of the electrodes to improve the signal if necessary. Repositioning is required if the nerve is not in contact with both hooks on the electrode or if any tissue, blood, or lymph fluid is in contact with the wires.\n\tNOTE: The need for repositioning is based on the auditory characteristics of the nerve discharges.\n\t\nIf the bursts of RSNA are not occurring cyclically with the cardiac cycle, and if there is any interference in the recording, then carefully reposition the electrode.\nAs respiratory movements can also affect the quality of the RSNA recording, improve the signal by gently moving the electrode into a position where the muscle movements do not disrupt the electrode during breathing.",
    "Once a clear signal is obtained, secure the RSNA electrode in place by withdrawing mineral oil and applying a silica gel to cover the nerve/electrode connection in the incision pocket. Do not move the rat before the gel has set completely.\nPerform CNS manipulation protocols while continuously recording RSNA and mean arterial pressure. If a microinjector/pulser is used for brainstem manipulations, a logic signal from this device can be introduced into the RSNA/BP recordings to document the timing of CNS manipulations.\nWhen the experiment is complete, determine the noise level by crushing the nerve proximal to the recording electrodes between the silica gel and the spinal muscle. Record at least 30 s of this \"zero\" value for RSNA4,5,6. As an alternative approach for quantifying noise, administer a short-acting ganglionic blocker such as atropine, hexamethonium, chlorisondamine, or pentolinium tartrate8,15,16,17.\nCarefully remove the RSNA electrode and remove any traces of silica gel from the wire electrodes. Save the electrode for re-use. Turn off the telemetry transmitter and remove it, taking care not to damage the tip of the catheter.\n8. Euthanasia (Transcardiac Perfusion)\nIdentify the locations of CNS manipulations by injecting dyes or fluorochromes, creating electrolytic lesions, or by detecting of c-fos expression.\nIf brain analyses will require fixation, prepare the rat for transcardiac perfusion. Assess the toe-pinch reflex to ensure that the rat remains deeply anesthetized. Provide supplemental anesthesia if needed. Perform transcardiac perfusion of paraformaldehyde fixative in a fume hood.\n\tCAUTION: Avid skin/eye irritant.\nInsert tubing into the perfusion pump and prime with 0.9% normal saline.",
    "Make a 5-6 cm lateral incision through the skin and abdominal wall immediately beneath the rib cage and open the chest cavity. Carefully separate the liver from the diaphragm. Make a small incision in the diaphragm using curved blunt scissors. Inject 0.1 mL of heparin directly into the left ventricle.\nPass a perfusion needle into the left ventricle (a stainless steel gavage needle works well for this step) by either puncturing it into the heart or by cutting a small incision using sharp scissors and passing the gavage needle through so the tip is visible through the wall of the aorta (but does should not reach the aortic arch). Use a surgical or electrical clip to secure the needle in place.\nUsing an infusion pump, administer 0.9% normal saline (room temperature). Immediately create a 2-3 mm incision in the right atrium to create an outlet for the saline rinse. Do not cut the descending aorta. Continue the saline rinse until the liver changes color from red/brown to pale yellow, an infusion of approximately 400 mL over 2-3 min.\nStop the pump. Switch the perfusate to the fixative (e.g., 10% formalin or 4% paraformaldehyde); infuse 400 mL over 2-3 min. Remove the brain and store the specimen in fixative solution overnight at 4 °C before transferring the tissue to 30% sucrose (30 mL of sucrose dissolved in 100 mL of 0.1 M phosphate-buffered saline) for at least 3 days or until the brain sinks, for cryoprotection before cryogenetic sectioning18.\n9. Analyze Data",
    "Full-wave rectify the raw RSNA to obtain absolute values. Full-wave rectify a 10 s segment of the raw noise signal. It is important to exclude any studies that were affected by a low signal-to-noise ratio. In studies quantifying RSNA, investigators applied a priori criteria such as requiring signal to noise ratios to exceed 2:1 to 6:117,19,20.\nCalculate the mean rectified RSNA for non-overlapping segments (µV) and subtract the noise estimate (µV). Depending on the aims of the experiment, investigators may select intervals such as 10 s (Figure 1) or 1 s. Calculate means by using waveform analysis options in the physiologic software or exporting the data into spreadsheets to calculate averages for selected time intervals.\nTo normalize across different animals, express values for further analysis as the percent change from baseline. Use parametric statistics to conduct group comparisons.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}