{
  "id": 5453,
  "origin_website": "Bio",
  "title": "A Co-culture Model for Determining the Target Specificity of the <em>de novo</em> Generated Retinal Ganglion Cells",
  "procedures": [
    "Dissection of Superior (SC)/Inferior Colliculus (IC) from PN1/3 rat brainEthical statement: Experimental protocols and the use of animals were approved by the Institutional Animal Care and Use Committee, at the University of Nebraska Medical Center (UNMC) and conducted in accordance with the Association for Research in Vision and Ophthalmology (ARVO) Statement for the Use of Animals in Ophthalmic and Vision Research. Sprague-Dawley rats of both sexes at postnatal day 1/3 are sacrificed by decapitation.The brains are removed and transferred to 100-mm Petri dish containing HBSS solution and placed on ice (Figures 1A-1C).Dissections of SC/IC are done under a stereomicroscope. The tectum was exposed by carefully removing the overlying cortex. A pair of rostral and caudal bumps, superior and inferior colliculi, respectfully, can be observed. Anterior and posterior incisions are made to the rostral bumps to collect SC. Similarly another incision posterior to the caudal bump reveals IC (Figures 1D-1E).Both sides of SC/IC are carefully separated from each other and kept in ice cold HBSS for further processing (Figures 1F-1G).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328014229_9633.jpgFigure 1. Brain dissection. Decapitate a PN2 rat pup and gently remove the brain from the skull (A-C). Remove the cortex overlying the midbrain, which is removed by horizontal cut to anterior-posterior axis (D-G).Preparation of slices from SC/IC tissues Stoelting tissue slicer is used to slice SC/IC tissues. Section as thin as 100 μm is readily prepared.Clean the Stoelting tissue slicer with 70% ethanol, wipe completely with Kim-wipe and place inside the sterile dissection hood.Wipe a new razor blade with Kim-wipe moistened in 70% ethanol and mount on blade holder located on the right side of slicer arm by unscrewing two nuts from the left side of slicer arm to release the blade holder.",
    "Mount the razor with cleaned side of the blade facing towards the side of vernier micrometer (Figures 2A and 2B).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328014422_6968.jpgFigure 2. The stoelting tissue slicer apparatus with double-edge stainless steel blades for slice cutting (A, B)Move the sample stage (base pad) to the left or to right by turning the vernier micrometer clockwise or anticlockwise to ensure proper functioning of the instrument.Cut the filter paper into 2.5 x 8 cm and moisten with HBSS.Transfer the tissue to wet area of filter paper.Meanwhile, prepare freshly made 4% low melting point agarose.Weigh 4 mg of agarose in glass beaker and add 100 ml of HBSS. Microwave the beaker for 3-4 min until agarose is completely melted and starts to boil. Keep the melted agarose in a water bath set at 50 °C to avoid solidification. Keep agarose well mixed throughout the procedure by shaking the beaker intermittently.Add the melted agarose drop by drop over the tissue with the help of plastic pipette tip, completely covering the SC/IC tissues until a mound of agarose is formed. Remove air bubble, if any (Figure 3).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328014537_4241.jpgFigure 3. Schematic representation of agarose covered tissuePlace the agarose-covered tissue on ice for 5-10 min to allow the agarose to solidify.Once agarose solidifies completely, place the filter paper on sample stage and secure the paper with tape (Figure 4A).Position the tissue for its first cut by moving the sample stage either to the left or to right.Set the slice thickness to 100 µm (range: 100-300 µm).Bring the slicer arm down, release slowly and let it fall by gravity.Lift the slicer arm gently once first slice is done, turn the vernier counter clockwise forward by 100 µm and then subsequently cut another slice (Figure 4B).",
    "When the whole tissue is sliced, lift the slicer arm and gently remove the slices off the surface with the help of wet soft paintbrush.Transfer the slices in to culture Petri dish containing HBSS.Transfer the slices using plastic pipette tip, the end broadened by a cut, with cut end to PDL and Laminin coated glass coverslips.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328014634_1828.jpgFigure 4. Filter paper mounted on sample stage (A) and tissue slices after slicing (B)Poly-D-lysine (PDL) and laminin coating and plating of SC/IC tissue slicesNote: Poly-D-lysine and laminin are stored in a -80 °C freezer as 100 µl aliquots as stock solution of 10 mg/ml and 1 mg/ml, respectively.SC/IC slices on to PDL and Laminin coated sterile glass coverslips are transferred to 24-well culture plates.Briefly, one day prior to SC/IC tissue slices, coverslips/culture plates are coated with PDL and laminin. Prepare working PDL solution (0.25 mg/ml) in sterile water. Add enough solution to cover surface of sterile glass coverslips.Incubate overnight at room temperature in a tissue culture hood.Next day, aspirate PDL solution and wash coverslips with sterile water twice at room temperature and allow to dry at room temperature.Prepare laminin solution (5 µg/ml) in sterile DMEM/F12 media. Coverslips are then coated with 250-300 µl of laminin/per coverslip/well.Incubate for 2 h at room temperature. Aspirate to remove laminin and wash coverslips with DMEM/F12 media twice at room temperature.Carefully plate SC/IC slices on the coated glass coverslips as described above. Do not allow coating to dry.Add 50 µl media drop on tissue slices in order to prevent drying and facilitate proper attachment. Incubate at 37 °C/5% CO2 overnight.Next day, gently add 300 µl of hiPSC-RGCs media per coverslip/well as described previously (Teotia et al., 2016).",
    "Carboxyfluorescein diacetate, succinimidyl ester (CFDA SE) labeling of hiPSC-RGCs hiPSC-RGCs are labeled with CFDA cell tracing agent for in vitro tracing of neurite outgrowth. CFDA SE passively diffuses into cells. The well-retained fluorescent conjugates are formed when the succinimidyl ester group reacts with intracellular amines. Preparations of the dye and labeling of cells should be protected from light.Prepare CFDA solution (5 μM) immediately prior to use by diluting in PBS.Grow hiPSC-RGCs in a 12-well plate, remove the media from the plate and add CFDA solution to hiPSC-RGCs in a 12-well culture plate.Incubate cells at 37 °C/5% CO2 for 15 min.Replace the diluted CFDA solution with fresh medium and incubate cells for another 30 min at 37 °C/5% CO2.CFDA labeled cells are visualized by fluorescence microscopy using standard fluorescein isothiocyanate (FITC) filter sets. Cells are now ready to use for co-culture experiment. CFDA labeled cells can be cultured for 1-2 weeks post staining.Co-culture of hiPSC-RGCs with SC/IC tissue slices in vitro Setting up the co-culture of hiPSC-RGCs in the same plate as described in Procedure C.Remove the PDL and laminin coated plate containing SC/IC tissue slices as described in Procedure C from 37 °C/5% CO2 incubator, aspirate the medium and keep in tissue culture hood.Meanwhile, detach hiPSC-RGCs from 12-well plate using cell scraper.Centrifuge the cells at 220 x g for 5 min to obtain cell pellet and aspirate the supernatant.Resuspend the cells in 1 ml of fresh medium, gently mix and add 50 μl of media containing hiPSC-RGCs (~3-6/coverslip) away from the SC/IC slices on the above PDL and laminin coated coverslips.Return the plate to the incubator and incubate at 37 °C/5% CO2 overnight. Allow the cells to adhere, next day, add 300 µl hiPSC-RGCs medium.Change the medium every 2-4 days.",
    "hiPSC-RGCs can be co-cultured with SC/IC slices up to 8 days in vitro. Once neurite outgrowth reaches considerable length, mount the coverslips on glass slides and image under the fluorescent microscope (Figure 5). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328014951_2878.jpgFigure 5. CFDA-tagged hiPSC-RGCs elaborated long processes toward SC cells aggregate (A), compared to the one co-cultured with IC cells aggregate (B). *Represents RGCs extending processes. Scale bars = 50 μmCompare the length and complexity of neurite outgrowth of hiPSC-RGCs extending towards both SC and IC slices. hiPSC-RGCs can be discriminated from clear-cut boundaries of SC/IC slices by CFDA staining of cell soma.Electrophysiology of hiPSC-RGCs co-cultured with SC tissue slicesWhole-cell patch clamp electrophysiology allows for recording membrane voltage changes such as action potentials and excitatory and inhibitory synaptic potentials from hiPSC-RGCs co-cultured with SC tissue slices as well as the ionic currents that give rise to those voltage changes. The former is accomplished using the current clamp-recording mode while the latter is accomplished in voltage clamp recordings (Molleman, 2003; Marty and Neher, 2009; Teotia et al., 2016). Mount a coverslip containing hiPSC-RGCs co-cultured with SC slice on a recording chamber using several dots of vacuum grease. Position the recording chamber on the stage of an upright, fixed-stage microscope equipped with electrophysiology hardware and superfuse at ~1-4 ml/min with Ames’ Medium bubbled with a gas mixture of 5% CO2 and 95% O2. To establish a whole-cell recording, provide gentle positive pressure through the pipette and position it on the membrane of the target cell using a micromanipulator while viewing the cell and pipette under the microscope. Use the patch clamp amplifier to provide a 5 mV depolarizing step to measure resistance. The resistance will climb slightly as the pipette contacts the cell membrane.",
    "Release the positive pressure and provide gentle suction while monitoring resistance to form a GΩ seal (seal resistance > 1 GΩ). Once the GΩ seal is formed, apply a holding potential (-70 mV) and rupture the patch using either strong pulses of suction, gradual gentle suction with a syringe, or the ‘zap’ feature of the amplifier. The appearance of whole-cell capacitance transients indicates successful rupture of the patch and establishment of whole-cell recording. In voltage-clamp, to record voltage-gated sodium and potassium currents (INa and IK), design a protocol in which the amplifier depolarizes the cell in increments of 10 mV (up to +50 mV). Use a P/8 leak subtraction protocol to subtract membrane leak and whole-cell capacitance transients from the data.INa will be a fast inward current that rapidly inactivates, while IK is typically a slowly-developing and non-inactivating outward current (Figure 6). Monitor the quality of the whole-cell recording by noting access resistance (Ra) using a 5 mV depolarizing pulse. Ra should be as low as possible (i.e., < 40 MΩ) and should remain relatively stable throughout the recording. Large Ra will introduce substantial voltage errors, distorting measures of current voltage-dependence and amplitude. If INa is sufficiently large, the cell might generate action potentials in response to depolarizing current injections (+10 to +300 pA) in current-clamp mode (Figure 1). INa is typically blocked by the pufferfish toxin tetrodotoxin, which can be added to the extracellular solution and superfused onto the cells at a concentration of 0.5-2 μM. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20170328/20170328015220_7419.jpgFigure 6. Example recording of hiPSC-RGCs co-cultured with SC slices. A. Whole-cell voltage clamp recording of INa and IK in response to step depolarizations (150 msec, -66 mV to +24 mV from a holding potential of -76 mV). INa is blocked by 1 mM TTX. B.",
    "Expanded time axis of current responses to a depolarizing step to -26 mV in control conditions and in the presence of 1 mM TTX. C. Current-clamp recording showing voltage responses to hyperpolarizing and depolarizing current injections (-20 to +50 pA). The cell fires action potentials in response to depolarizing current injections."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}