{
  "id": 3209,
  "origin_website": "Cell",
  "title": "Modified Protocol for A Mouse Heart Failure Model Using Minimally Invasive Transverse Aortic Constriction",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nAnimal Preparation\nTiming: 5 min\nAnesthetize and fix animals for surgery.\nMice must be deprived of food and water 6-hour before the surgical operation.\nCritical: Food deprivation before surgery is essential to avoid the risk of vomiting or bringing up food to the throat or lungs.\nAnesthetize the mouse using 2% isoflurane and oxygen with a flow rate of 0.5 L/min in an induction chamber connected with an animal anesthesia machine.\nQuickly shave the fur from the neckline to the xiphoid process level using an electric razor.\nApply ophthalmic gel to the eyes to avoid eye dryness, settle the animal on a heating pad in a supine position with the head facing the operator, and fix the paws with medical pressure-sensitive adhesive tape.\nNote: The head of the mouse faces the operator giving a more clear view and facilitates handle, and it can be operated clearly without a Stereo Microscope in the next step.\nMaintain the anesthesia with 1.5%–2% isoflurane with an airflow of 0.1–0.3 L/min (Brede et al., 2002[href=https://www.wicell.org#bib3]).\nNote: Maintenance of anesthesia with an oxygen flow rate of around 0.3 L/min provides several benefits, including decreased use of inhaled agents, improved body temperature and humidity homeostasis, and reduced environmental pollution (Adelsperger et al., 2016[href=https://www.wicell.org#bib1]; Brattwall et al., 2012[href=https://www.wicell.org#bib4]).\nSurgical Procedure for Ligation\nTiming: 15 min\nBind the aortic arch using Prolene 6-0 suture with a curved 27-gauge needle help.\nSterilize the skin using 2% povidone-iodine solution and 75% alcohol, separately.\nConfirm sufficient level of anesthesia by performing a toe pinch with a straight forceps. The anesthetized mouse should not respond to the stimulation.\nNote: Increase isoflurane vol % if the mouse in response to the toe pinch.",
    "Begin with partial thoracotomy by creating a 1.5–2 cm incision (Figure 2[href=https://www.wicell.org#fig2]A) in the skin to the second rib with fine scissors (Hu et al., 2003[href=https://www.wicell.org#bib6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/278-Fig2.jpg\nFigure 2. Some of the Details in the Procedure\n(A) A 1.5–2 cm incision. ① Salivary glands; ② sternum.\n(B) Cut the sternum about 5 mm.\n(C) The string threaded in the drag hook was fixed to the surgical pad with adhesive tape.\n(D) Drag hooks.\n(E) ① The aortic arch; ② the brachiocephalic artery; ③ the right common carotid arteries; ④ the left common carotid arteries.\n(F) The tissue under the aortic arch was separated (arrow).\n(G) The pricking point (arrow).\n(H) The curved needle with silk suture under the aortic arch.\n(I) The suture was clipped out.\n(J) The retrieved curved needle.\n(K) The blunted spacer in the suture loop.\nPull the salivary glands toward the head with Semken Forceps (straight) to reveal the sternal notch, and try to maintain the integrity of the salivary glands.\nCut the sternum about 4–5 mm using a dissector scissor (Figure 2[href=https://www.wicell.org#fig2]B).\nCritical: Pay special attention to this step; do not cut over 6 mm to avoid damaging the parietal pleura and to prevent developing the pneumothorax.\nGently separate the muscle tissue on the trachea with two Iris forceps.\nPull the sternum apart on both sides with two manual made drag hooks (Figure 2[href=https://www.wicell.org#fig2]D), and fix the middle of string threaded in the drag hook to the surgical pad with an adhesive tape (Figure 2[href=https://www.wicell.org#fig2]C).\nNote: The power of adhesive tape is enough to fix the drag hook. You can also easy to adjust the pull strength of the drag hook by pulling the end of the string thread and push the tape to fix.",
    "Carefully separate the connective tissue and thymus lobes with two pairs of Iris Forceps (straight) up and to both sides. At the same time, the brachiocephalic artery, the left and the right common carotid arteries, and the aortic arch will be visible (Figure 2[href=https://www.wicell.org#fig2]E).\nSeparate the connective tissue cautiously and gently just under the aortic arch using two pairs of Iris forceps so that the curved needle with silk suture can pass through the aortic arch smoothly (Figure 2[href=https://www.wicell.org#fig2]F).\nCritical: Do not separate the tissue down toward the thoracic cavity too deep and broad, and just under the aortic arch; otherwise, it is easy to lead to the formation of pneumothorax. Excessive tissues around the aortic arch should be excluded or it will affect the degree of coarctation of the aortic arch.\nPlace the curved needle with Prolene 6-0 suture under the aortic arch, then pull the curved needle toward the head a little, and then prick the tissue covering the head of the curved needle with a pair of Iris forceps (Figures 2[href=https://www.wicell.org#fig2]G and 2H).\nNote: The forceps can only prick the head of the curved needle to avoid damaging the aorta.\nNote: The advantage of threading the curved needle with silk suture before the operation is that it can save the time of threading during operating.\nClip the suture out slowly and gently with forceps and gently retrieve the curved needle (Figures 2[href=https://www.wicell.org#fig2]I and 2J).\nPlace the blunted spacer (curved 27-gauge needle, diameter: approximately 0.410 mm) into the suture loop (Figure 2[href=https://www.wicell.org#fig2]K).\nTie a loose double knot, then fasten the fist knot and second knot in turn, and finally, tie a knot again; Immediately, remove the spacer quickly but softly.",
    "Critical: The degree of tightness of the ligation is critical to the success and reproducibility of the procedure: too tight a ligation can result in high mortality, but too loose will delay the formation of the HF model.\nCut the redundant suture, and check for bleeding around the aortic arch, sternal edges, and other soft tissue. If there is bleeding, stanch the bleeding site using the electrocoagulation hemostatic device (LEIYEA, 19-5002).\nRelease the string thread and remove the drag hooks from sternal edges on each side.\nClose the chest muscle wall using 6/0 Polyglicolic Acid (PGA) suture with a simple interrupted suture pattern.\nClose the skin using 4/0 PGA suture in a continuous suture pattern.\nDisinfect the suture site with povidone-iodine solution, remove adhesive tape from limbs, and return the mouse to the warmed cage.\nNote: For trained operators, the entire modified transverse aortic constriction (TAC) surgical procedure usually takes 7–12 min, not including preparation time. For beginners, it might take even longer.\nPostoperative Care\nTiming: 3 days\nUse the pain reliever to minimize animal pain.\nFor postoperative analgesia, inject an opiate drug buprenorphine (0.1 μg/g) intraperitoneally after the surgery.\nNote: The postoperative analgesia is indispensable for mice after surgery. According to Animal Welfare, laboratory animals need to be given analgesia during and after an operation, and every effort should be made to minimize animal pain, suffering, and distress.\nPut the mouse in a warmed (30°C–35°C) cage, and the mouse will regain consciousness approximately 2 min later.\nKeep the mouse in the warmed cage for 1 h for completely recover from the surgical operation, then move to the housing environment (25°C).",
    "Note: To reduce pain, mice are injected with buprenorphine every 8 h for three days. Buprenorphine is administered intraperitoneally in this protocol. Using subcutaneous injection can extend the time to 12 h.\nAlternatives: ibuprofen (Motrin) can be administered in drinking water (0.2 mg/mL).\nCritical: Postoperative care has a positive effect on the speedy recovery of the animals. Poor postoperative care may cause the animal to die."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}