{
  "id": 17576,
  "origin_website": "Jove",
  "title": "Closed Chest Biventricular Pressure-Volume Loop Recordings with Admittance Catheters in a Porcine Model",
  "procedures": [
    "This protocol was developed and utilized for studies conducted in compliance with the Danish and Institutional guidelines on animal welfare and ethics. The Danish Animal Research Inspectorate approved the study (license no. 2016-15-0201-00840). A Danish, female slaughter pig (crossbreed of Landrace, Yorkshire, and Duroc) of approximately 60 kg was used.\n1. Anesthesia and ventilation\nPre-anesthetize the awake pig with Zoletil mix 1 mL/kg (see Table of Materials) as an intramuscular injection to reduce stress, pain, and anxiety of the animal during transportation.\nTransport the animal from farm facilities to research facilities.\nEstablish intravenous access in an ear vein.\n\t\nTo do so, lightly tourniquet the ear to cause venous blood stasis. Disinfect the skin over a visible, straight vein with ethanol.\nPuncture the vein with a 20 G venous catheter and release the tourniquet. Make sure to fix the access with adhesive tape to avoid displacement.\nFlush with isotonic saline to ensure the proper positioning of the venous catheter. Observe for slight de-coloring of the vein as the saline passes.\n\t\tNOTE: If a subcutaneous bulge appears, the venous catheter is in a subcutaneous position and must be removed. Consider establishing the second intravenous access as a backup.\nMove the animal to an operating table. Place it in a supine position.\nIntubate the pig by direct laryngoscopy with a size 7 tube. Fixate the tube to the snout/head of the animal to avoid any accidental extubation. Ensure correct positioning of the tube by looking for equal thoracic movements on ventilation, stethoscopy and/or sufficient expiratory carbon dioxide.",
    "Connect the tube to a pre-tested mechanical ventilator and start the ventilation. Use the pressure-controlled, volume-gated ventilation with a tidal volume of 8 mL/kg and low-flow ventilation. The fraction of inspired oxygen (FiO2) can be 0.21 for normoxia or higher. Adjust the respiratory rate to target the end-tidal carbon dioxide of 5 kPa.\nStart the total intravenous anesthesia by propofol 3 mg/kg/h and fentanyl 6.25 g/kg/h. Ensure sufficient anesthesia by the lack of corneal reflexes and response to a painful stimulus. Increase infusion, if necessary.\n\tNOTE: Do not leave the animal unattended at any time until it has regained sufficient consciousness to maintain sternal recumbency (survival protocol) or has been euthanized.\nMonitor the animal with a 3-lead electrocardiogram and pulse oximetry.\nMeasure the body temperature. If necessary, heat the animal targeting a normal porcine temperature of 38-39 °C.\n\tNOTE: Hypothermia may increase the risk of arrhythmogenesis triggered by instrumentation19.\nInsert the bladder catheter (size 14) by transvaginal access and connect to a urine sampling bag.\nDepending on the research protocol and the scientific hypothesis to be investigated, consider administering heparin intravenously (5000 IE repeated every 4-6 h, if necessary) and/or amiodaron (300 mg infusion over 20 min).\n\tNOTE: Heparinization can be performed after intravascular accesses are established. These drugs may ease the instrumentation but might bias results. Alternatively, slow saline infusion on intravenous sheaths can prevent intra-luminal thrombosis.\nUse vet ointment on the eyes to prevent dryness.\n2. Intravascular accesses\nNOTE: Intravascular accesses are to be established in the right external jugular vein, the left external jugular vein, left carotid artery, left femoral artery, and right femoral vein. In the pig, the external jugular vein is much larger than the internal jugular vein and, therefore, easier to access. All materials required for this section are shown in Figure 2A.",
    "Shave the animal at the sites of puncture for intravascular accesses.\nDisinfect the skin with chlorhexidine (or povidone iodine) and wipe clean using isopropyl alcohol. Repeat for 2 more cycles.\nPlace a sterile drape at the disinfected area with a centrally located hole in the cover.\nUse an ultrasound device with a linear probe. Cover the probe with a sterile cover and use sterile gel for vascular examination.\nUse a 17 G sterile venous catheter to puncture the skin and guide the needle to intravascular positioning by ultrasound (Figure 2B,C).\nReplace the needle with a guidewire using the Seldinger technique. Remove the venous catheter leaving just the guidewire in the intravascular lumen. Next, make a small skin incision (~5 mm) adherent to the guidewire to ease the insertion of the sheath.\nPlace an 8 French (F) sheath over the guidewire and into the vessel of choice (the Seldinger technique). Choose an 8F sheath in the right external jugular vein (for the right heart catherization) and in the left carotid artery (for LV PV loop catheter). Sufficient lumen is necessary to avoid damaging the catheters.\nPlace a 7F sheath in the left external jugular vein. It will later be exchanged for a larger sheath (see steps 4.4-4.6).\nPlace a 7F sheath in the left femoral artery. The access is for invasive blood pressure measurement and blood gas sampling.\nPlace a 12F (or 14F if available) sheath in the right femoral vein for the inferior vena cava (IVC) balloon insertion. Consider using a dilator in a two-step approach for the larger sheaths.\nConfirm and control the positioning of all sheaths by drawing blood (venous or arterial, respectively) and easy flushing with isotonic saline. The sheaths are correctly positioned inside a blood vessel if one can draw blood without resistance.",
    "Fixate all sheaths with a skin suture (size 3.0) to avoid any accidental removal of a sheath. Skin sutures will be removed after protocol completion along with the removal of sheaths.\nConnect the femoral arterial access to the pressure transducer and calibrate to atmospheric pressure. Ensure this setup generates the correct form of the arterial pressure curve.\nDraw an arterial blood sample from an arterial sheath and analyze it on an arterial blood sampler device to evaluate pH, arterial partial pressure of carbon dioxide (PaCO2), and oxygen (PaO2, depending on your chosen FiO2), as well as hemoglobin, electrolytes, blood glucose, and lactate levels.\n\t\nCorrect electrolytes and blood glucose, if necessary, to the standard values by infusion of the needed product. Especially, consider the correction of potassium levels as potassium disturbances may increase the risk of arrhythmogenesis triggered by instrumentation.\nIf the pig was fasting prior to the experiment, consider bolus infusion of isotonic saline (10 mL/kg infused over 30-60 min) or similar crystalloid to counteract hypovolemia.\nConsider a continuous infusion of 4 mL/kg/h isotonic saline to counteract perspiration throughout the protocol.\n\t​NOTE: The experiment can be paused at this step.\n3. Right heart catherization\nFlush a Swan Ganz catheter with saline and ensure the balloon is inflating correctly.\nConnect the Swan Ganz catheter's ports to the pressure transducers. Reset the pressure to atmospheric pressure holding the two pressure ports (for pulmonary arterial and central venous pressure, respectively) at the mid-axillary level of the pig.\nInsert the Swan Ganz catheter through the 8F sheath in the right jugular vein (step 2.7).\n\tCAUTION: Lead aprons or similar protection should be worn whenever using fluoroscopy.\nObserve on fluoroscopy when the distal part of the Swan Ganz catheter is out of the sheath. Inflate the balloon with the associated syringe.",
    "NOTE: Inflation of the Swan Ganz balloon inside the sheath will damage the balloon. Anterior-posterior view of fluoroscopy is sufficient for all described procedures.\nAdvance the Swan Ganz catheter slowly following its movements on fluoroscopy. Slower advancements will allow the blood flow to guide the catheter.\nObserve changes in the pressure signal from the distal port as it enters the RV and shortly after the pulmonary artery (Figure 3). Ensure that the catheter advances without any resistance.\n\t\nEnsure that the pressure changes from 5-8 mmHg in the central venous circulation to 20-30 mmHg in systole and 0-5 mmHg in diastole in the RV. After passing the pulmonic valves, the diastolic pressure will be 10-15 mmHg (see Figure 3 for changes in shapes of the pressure signal).\n\t\tNOTE: Systolic pressures in the RV and in the pulmonary artery above 40 (or a mean pulmonary arterial pressure above 25) might be a sign of pulmonary hypertension due to pneumonic infection in the animal. Please remember that positive pressure mechanical ventilation also may increase pulmonary arterial pressure.\nDeflate the balloon and ensure that the distal pressure port is still in the main pulmonary artery. Use both fluoroscopy and the pressure signal for this verification.\n4. Right ventricular pressure-volume catheter insertion (Figure 4)\nRead and follow the manufacturer's instructions. Allow the PV catheter to soak in saline for at least 30 min.\nOpen the data acquisition software (see Table of Materials) with an 8-channel setup (pressure, volume, phase, and magnitude from both ventricles). Click Start to ensure the pressure signal is recorded. Look for the excessive noise in the pressure signal. Values will be close to 0 mmHg as the pressure recorder is still outside the animal.",
    "Calibrate the pressure to the zero-level by holding the pressure port just below the surface of saline to avoid unwanted pressure effects from the water column above.\nInsert a long guidewire through the 7F sheath in the left jugular vein (step 2.8). Guided by fluoroscopy, advance the guidewire through the upper central veins, the right atrium (RA), and into the inferior vena cava. Ensure that the advancement is without any resistance. Premature systolic events are common as the guidewire passes the RA.\nExtract the 7F sheath leaving the guidewire in the venous circulation. Compress the entry point to avoid bleeding. Using the Seldinger technique, exchange the 7F sheath for the 16F sheath. Extend the skin incision for the larger sheath if necessary.\nGuided by fluoroscopy, advance the 16F sheath over the guidewire until the tip of the sheath (not the dilator) has reached the level of the superior vena cava (Figure 4B).\nBy carefully pulling, extract the dilator and guidewire, but be careful not to remove the sheath. Flush the sheath with isotonic saline to avoid intra-luminal blood clotting.\nInsert the PV catheter in the 16F sheath.\nUse fluoroscopy to follow the PV catheter as it passes through the sheath until the pressure-port has left the sheath.\nCarefully advance the sheath and PV catheter collectively until the sheath is just outside the pericardial border.\nAdvance the PV catheter into the RA (Figure 4C).\nUse the sheath length to help advance the PV catheter from the RA into the more anteriorly positioned RV; point the external end of the 16F sheath downwards (posterior to the supine animal) and medially, which will point the internal end of the sheath anteriorly.",
    "Advance the PV catheter into the RV. This can be verified by the change in pressure-signal from the PV catheter to a classic ventricular shape and by the tactile resistance as the PV catheter meets the right ventricular apex.\nOnce the PV catheter is in the RV, retract the 16F sheath outside the thoracic cavity to avoid any hemodynamic or electrical influence of the device located close to the heart (Figure 4D).\nOptimize the PV catheter positioning, based on fluoroscopy, as close to the RV apex as possible, but do not let it touch the endocardium.\n\tNOTE: Use fluoroscopy to observe the excess mechanical contact between PV catheter and endocardium, if any. This is viewed as a bended PV catheter (including its pigtail) and persistent premature systolic events via the electrocardiographic monitoring.\n\t\nFixate the PV catheter to the external end of the sheath with adhesion tape to ensure the stability of catheter positioning.\n\t\tNOTE: Occasionally, a floating catheter may cause extra-beats. If so, try fixating it without compressing the endocardium too much.\nFollow the manufacturer's protocol to choose the relevant number of recording segments and to optimize the PV catheter positioning in the RV, based on the recorded phase and magnitude signals.\n\t​NOTE: For pigs weighing 60 kg, two or three segments for the RV and most often three segments for the LV were used for this experiment. Fewer segments will be required in smaller animals and vice versa. Positioning of the catheter was based on the magnitude of signals initially; the shape of the pressure-magnitude loop should look like the desired pressure-volume loop. The magnitude amplitude should be as high as possible (5-10 mS). The phase angle should be within 1-3 o with the highest possible amplitude (approximately 1.5 o).\n5. Left ventricular pressure-volume catheter insertion (Figure 5)",
    "Read and follow the manufacturer's instructions. Allow the PV catheter to soak in saline for at least 30 min.\nCalibrate the pressure to zero-level (step 4.3).\nInsert the PV catheter in the 8F sheath in the left carotid artery.\nFollow the PV catheter by fluoroscopy as it passes through the sheath towards the aortic valves (Figure 5B). A resistance is felt when the PV catheter is stopped by the aortic valves. On fluoroscopy, bending of the catheter is observed.\n\tNOTE: Occasionally, the PV catheter turns into the descending aorta. This is recognized by fluoroscopy, and a less prominent aortic notch on the pressure-curve of the PV catheter.\nRetract the PV catheters approximately 1 cm above the aortic valves.\nSynchronize the next quick advancement of the PV catheter to a systolic phase of the cardiac cycle. This will happen through the open aortic valves. Success can be verified by the change in the pressure signal from the PV catheter to a classic ventricular shape.\nIf attempts to advance through the valves fail, rotate the PV catheter for better positioning in the center of the ascending aorta. Retry, if needed.\nOnce inside the LV, optimize the left ventricular PV catheter positioning based on fluoroscopy, as close to the LV apex as possible, but do not let it touch the endocardium (Figure 5C). See step 4.15.\n\tNOTE: Occasionally, a floating catheter may cause premature cardiac contractions. If so, try fixating it without compressing the endocardium too much.\nFollow manufacturer's protocol to choose the relevant number of recording segments and to optimize the PV catheter positioning in the LV, based on the recorded phase and magnitude signals (see step 4.16).\n6. Inferior vena cava balloon insertion",
    "Fill the syringe for inflation with saline or contrast agent as preferred and ensure that the balloon can be inflated correctly.\nInsert the guidewire in the 12F sheath in the right femoral vein.\nAdvance the guidewire to the IVC at the level of the diaphragm.\nInsert the balloon over the guidewire and advance it to the diaphragm level at the end expiration (Figure 5D).\nRetract the guidewire and flush the lumen with saline to avoid blood clotting.\n7. Pressure-volume catheter calibration\nRead and follow the manufacturer's instructions.\nEnsure stable sinus rhythm on the electrocardiographic monitor and stable cardiopulmonary variables for 5-10 min.\nUse the Swan Ganz catheter to measure the cardiac output (CO) by thermodilution. Use an average of three injections of 10 mL of 5 °C isotonic glucose with less than 10% variation. Observe the animal's heart rate (HR) during the CO measurement. Calculate the stroke volume (SV) as SV = CO/HR (unit mL). Normal CO is 4-6 L/min for a 60 kg pig with a stroke volume of 80-110 mL.\nEnter the SV into the PV boxes for both the LV and RV.\nCheck that optimal phase and magnitude signals are received from both ventricles. Notably, the two PV boxes must record at different frequencies to avoid electronic cross-talking.\nIn transient apnea, calibrate (\"scan\") the PV signals.\nIf calibration is satisfactory, ensure the proper shape of both ventricular PV loops, as well as realistic pressures and volumes. If not, re-do the calibration.\n8. Baseline evaluation\nNOTE: Experiment can be paused at this level for the stabilization of hemodynamics before the research protocol begins.\nWhen PV loops are to be recorded, follow the manufacturer's instructions. Press Start in the data acquisition software. Ensure the PV loops are still acceptably shaped.",
    "Record PV loops over 30-60 s of continuous ventilation. Perform analysis by finding the average of e.g., three respiratory cycles. Alternatively, perform a transient breath-hold for the end expiration on the ventilator and analyze these loops from apnea. Consider having low/no positive end-expiratory pressure (PEEP) and minimal adjustable pressure limiting (APL) valve.\n\tNOTE: Ventricular function, especially the RV, is affected by cyclic changes of intrathoracic pressures during ventilation (or spontaneous respiration). Importantly, report in the paper if PV loops were recorded during ventilation or in apnea.\nFor load-independent PV variables, do a breath-hold and wait a few heart beats before slowly inflating the IVC balloon with the chosen liquid (step 6.1). The balloon progressively decreases the cardiac preload.\nObserve how the RV PV loops become progressively smaller and leftward shifted.\n\tNOTE: The gradual decrease in RV preload will lower RV end diastolic volume progressively. Lower volumes will cause lower pressures and output (Starling mechanism). For further details, see references1,2,3.\nImportantly, keep the balloon inflated by keeping the pressure on the associated syringe long enough for the reduction in LV preload (serially connected with the RV). Observe progressive decrease in LV pressure and volume as well. See the Representative Results section for examples.\nQuickly, deflate the balloon and turn on ventilation.\nRe-do 8.3-8.7 if the response was not satisfactory, i.e., without premature cardiac complexes, sinus bradycardia, or similarly affected cardiac function.\nAllow the pig to stabilize for 2-5 min before the next IVC occlusion.\n\tNOTE: Hemodynamics are transiently affected by the breath-hold and preload reduction, especially in models of cardiovascular impairment.\nConsider performing three satisfactory occlusions (see 8.7) to increase the robustness of the statistical analyses.\n9. Post Protocol\nIn survival studies, remove and clean all intravascular equipment (PV catheters, IVC balloon, and Swan Ganz catheter).",
    "Cut the skin sutures that kept the sheaths in place. Remove each sheath by manual pulling. Compress on each venous access site for a few minutes to achieve hemostasis.\nFor arteries, remove the sheath and compress longer (5-10 min) to achieve hemostasis. Alternatively, consider using a vascular closure device.\nClose the skin incisions from the sheaths with one adaptive skin suture (3.0, absorbable suture) to avoid bleeding and infection. Apply 5 mL of bupivacaine (5 mg/mL) subcutaneously around each skin incision for pain relief.\nOnce all devices have been removed and hemostasis is achieved, stop the infusion of anesthesia. Carefully observe the animal in this phase.\nKeep the animal intubated (initially with the cuff inflated) until throat reflexes are present and the animal is sufficiently awake for extubation. Keep measuring the oxygen levels via pulse oximetry before and after extubation to ensure proper ventilation. Apply oxygen if necessary.\nDo not return the animal to the company of other animals until fully recovered.\nFor survival surgery, maintain proper sterile conditions. Please see steps 2.2-2.5. Observe the skin incisions and sutures daily for signs of infection including measurement of the animal's temperature.\nOnce the experiment ends, perform euthanasia with a lethal dose of pentobarbital (15 mL, 400 mg/mL).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}