{
  "id": 3954,
  "origin_website": "Cell",
  "title": "Screening for Arabidopsis mutants with altered Ca2+ signal response using aequorin-based Ca2+ reporter system",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nScreening EMS AEQsig6 libraries for mutants with reduced Ca2+ signal response\nPreparing plant materials for the first round of screening\nTiming: 2–4 h\nThe purpose of these steps is to prepare plant materials for analyzing Ca2+ signal response.\nSterilize the M2 seeds with 5% sodium hypochlorite for 10 min in a 1.5 mL tube (one tube for each pool).\nRinse seeds in sterile-deionized water for 4 times.\nPlant seeds evenly on a 150 mm × 15 mm round disposable Petri dish with a 0.9–1 cm interval (about 200 seeds per dish) on 0.3% Phytagel containing 1/2 MS nutrients, 1% sucrose, pH5.7 (one plate for each pool).\nSeal plates with micropore tape (3M).\nStratify the seeds at 4°C–8°C for 3 days in the dark.\nGrow seedlings horizontally in a Percival CU36L5 incubator at 21°C–23°C under a 16-h light, 8-h dark photoperiod for 9 days.\nCritical: Excessive light in the growth chamber and excessive sucrose in growth media should be avoided because the stressed seedlings are not suitable for monitoring Ca2+ signal response. Coelenterazines are very sensitive to oxidation and are used as a chemiluminescent indicator of ROS accumulation (Dubuisson et al., 2000[href=https://www.wicell.org#bib9]). To avoid resulting problems, seedlings must be grown under optimal growth conditions, and aequorin should be reconstituted in the dark. We recommend screening 10–20 plates per day for skilled researchers.\nAnalyzing transient Ca2+ signal response\nTiming: 6–9 h\nThe purpose of these steps is to monitor the Ca2+ signal response of M2 AEQsig6 seedlings for screening mutants.\nDraw a big arrowhead on the back of the plate to orientate the plate.\nSpray the 9-day-old seedlings evenly with ∼2–3 mL/per dish of coelenterazine working solution (NanoLight, final concentration 10 μM in sterile dH2O, 0.1% Triton X-100 with a laryngeal or nasal spray).",
    "Critical: Apoaequorin binds to a prosthetic group, coelenterazine, to be converted to aequorin that reacts with Ca2+ (Shimomura et al., 1962[href=https://www.wicell.org#bib38]). In the presence of Ca2+, coelenterazine is decomposed into coelenteramide and carbon dioxide with the emission of blue light at approximately 465 nm (Mithofer and Mazars, 2002[href=https://www.wicell.org#bib26]). Coelenterazines are stable in solid form when stored at −80°C under nitrogen or argon, but unstable under light or in an aqueous solution because they are prone to be oxidized. The stock solution (2 mM in ethanol) should be prepared in ethanol or methanol and stored at −80°C in light-tight tubes and handled in the dark. Do not use DMF or DMSO to prepare stock solution because these solvents cause oxidation of coelenterazine. Use freshly prepared working solution.\nIncubate Petri dishes for 4–6 h at room temperature (20°C–25°C) in the dark for aequorin reconstitution.\nPre-cool down the operating temperature of the CCD camera to −100°C.\nTransfer the Petri dish to the light-tight box of the CCD imaging apparatus in the dark.\nCritical: To prevent chlorophyll autofluorescence from interfering with the luminescence recording, do not expose the seedlings to light after applied coelenterazine. If the seedlings are occasionally exposed, keep in the dark for 5 min to minimize chlorophyll autofluorescence.\nTreat the seedlings with 600 mM mannitol in water (30 mL per 150 mm × 15 mm Petri dish) in the dark.\nNote: The solution of given stimuli should submerge the seedlings, but not too much.\nAcquire the luminescence image (Image1) continuously for 2–5 min, immediately after treatment.\nDiscard the mannitol solution.\nPlace the Petri dish back to the light-tight box of the CCD imaging apparatus as previously orientated.\nTreat the seedlings with 10 mM H2O2 in water (30 mL per 150 mm × 15 mm Petri dish).",
    "Acquire the luminescence image (Image2) continuously for 2–3 min immediately after treatment.\nCompare the Image1 with the Image2.\nPick up seedlings showed weaker luminescence in Image1 and normal luminescence in Image2 (about 0.5% of the total seedlings).\nNote: We assumed that most mutations do not affect the Ca2+ signal. Thus the majority of the M2 seedlings are considered as wild-type controls.\nRinse the mutant candidates with 25 mg/L cefotaxime solution in sterile-deionized water 2 times.\nNote: The use of cefotaxime reduces contamination by micro-organisms (Mittal et al., 2020[href=https://www.wicell.org#bib27]).\nTransfer the mutant candidates to 1/2 MS medium (without sucrose) with 25 mg/L cefotaxime under low light for recovery.\nNote: Dissolve cefotaxime in 1/2 MS medium. This step is not necessary for stimuli that do not cause severe damage.\nTransfer the mutant candidates to the soil after 1–2 days recovery, and grow seedlings under optimal growth conditions.\nCritical: Steps 14–18 are optimal and should be carefully designed. Although these steps reduce the false positive mutant candidates, they may also have mutant candidates escaped. Some stimuli may share similar receptors or upstream regulators (Laohavisit et al., 2020[href=https://www.wicell.org#bib18], Wu et al., 2020[href=https://www.wicell.org#bib49]). The alternative strategy is to pick up about 1.5%–2% of the total seedlings only according to Image1 (Figure 1[href=https://www.wicell.org#fig1]A). The recommended ranges for stimuli were listed in Table 2[href=https://www.wicell.org#tbl2].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/675-Fig1.jpg\nFigure 1. Identification of mutant candidates with reduced Ca2+ signal response\n(A) Isolation of putative candidates with reduced osmotic stress-triggered Ca2+ luminescence response in the first-round screen. The seedlings with red circles are the candidates.\n(B) Mutant candidate with reduced osmotic stress-induced Ca2+ luminescence response (left), but with similar discharged Ca2+ luminescence intensity (right).\n(C) A false mutant candidate with reduced osmotic stress-induced Ca2+ luminescence response (left), but with reduced discharged Ca2+ luminescence intensity (right).\nScale bars, 1 cm.",
    "Pause Point: Seeds can be safely stored at dry conditions at room temperature (20°C–25°C) for 2–5 years. As an alternative, seeds can be safely stored at −20°C for more than 5 years with high viability.\nSecond- to fourth-round screens\nTiming: 2 weeks\nThe purpose of these steps is to confirm the defective Ca2+ signal response of these mutant candidates isolated during the first-round screen.\nSterilize the seeds of mutant candidates and the wild type AEQsig6, as steps 1 and 2.\nPlant seeds evenly on a 90 mm × 15 mm round or 100 mm × 15 mm square disposable Petri dish with a 0.9–1 cm interval on 0.3% Phytagel containing 1/2 MS nutrients, 1% sucrose, pH5.7 (at least three plates for each line). Prepare plant materials as steps 4–6.\nTreat the 9-day-old seedlings with 600 mM mannitol, 10 mM H2O2 or other stimuli, as steps 7–13.\nAcquire the luminescence image (Image3) continuously for 2–5 min, immediately after treatments.\nDiscard the mannitol solution and place the Petri dish back to the light-tight box of the CCD, as steps 14 and 15.\nTreat the seedlings with discharging buffer (2 M CaCl2 in 20% ethanol).\nNote: The high concentration of ethanol destroys the cell membrane, allowing Ca2+ to penetrate the cells and discharge the remaining aequorin.\nAcquire the luminescence image (Image4) continuously for 5 min, immediately after treatments.\nMutant candidates with reduced luminescence in Image3, and standard or enhanced luminescence in Image4 are preferable for third- to fourth- round screens (Figure 1[href=https://www.wicell.org#fig1]B).\nSelect candidate mutants with reduced Ca2+ signal for third- to fourth-round screens and transfer the mutant plant to soil and harvest seeds from 8 individual seedlings using the single pedigree-based seed collection to obtain the homozygous, in case of a dominant mutation.",
    "Analyze phenotypes of mutant candidates under osmotic stress. It should be aware that stimuli responses are controlled both by Ca2+-dependent and -independent processes (Kadota et al., 2014[href=https://www.wicell.org#bib12], Li et al., 2014[href=https://www.wicell.org#bib20], Chen et al., 2020[href=https://www.wicell.org#bib6], Yuan et al., 2014[href=https://www.wicell.org#bib51]).\nScreening AEQub EMS library for altered Ca2+ signal responsive mutants using the film adhesive seedling (FAS) system\nPreparing plant materials for the first-round screen\nTiming: 12 days\nThe purpose of these steps is to monitor the Ca2+ signal of M2 AEQub seedlings.\nPrepare M2 AEQub seedlings for luminescence imaging. Sterilize EMS-mutagenized M2 seeds of AEQub plants with a 10% bleach solution containing 0.01% Triton X-100 or 0.1% HgCl2 for 5 min and rinse with sterile water 4–5 times. Sow the sterilized seeds on a square plate (10 × 10 cm square Petri dish with grid) containing 1/2 MS, 1% sucrose, and 1.2% agar. Place plates vertically in a growth chamber for 7 days, after stratification at 4°C for 2 days. \nTransfer the seedlings onto a film. Place an adhesive film (Thermo Scientific Adhesive PCR Plate Seals) on the top of 7-day-old seedlings growing on the vertical plate. Gently push the film by hand to ensure that seedlings adhere to the film, and peel the film gently to let the seedlings adhered to the film (Figures 2[href=https://www.wicell.org#fig2]A–2C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/675-Fig2.jpg\nFigure 2. The workflow of EMS AEQub library screening for the mutants with altered Ca2+ response using the FAS system\n(A) Prepare a square plate with 7-day-old seedlings (left) and an adhesive film (right).\n(B) Place the film on the top of seedlings and gently touch the film to have seedlings adhered to.",
    "(C–E) Peel the film (C) and place it into the plate containing coelenterazine solution with the seedlings side down (D) to have seedlings co-incubated with coelenterazine overnight (9–11 h) at room temperature (20°C–25°C) with gently shaking (E).\n(F) Discard the coelenterazine solution and place the film back to the plate with the seedling side up.\n(G and H) Acquire Ca2+ luminescence images for the first-round of the screen (G) and the second-round of verification (H).\nScale bars, 1 cm.\nIncubate the seedlings with coelenterazine. Place the adhered seedlings onto the square plate (10 × 10 cm) containing 15 mL of 1 μg/mL h-coelenterazine (15 μl of 1 mg/mL coelenterazine added to 15 mL dH2O). Incubate the seedlings at room temperature (20°C–25°C) for 4 h to overnight (9–11 h) (Figures 2[href=https://www.wicell.org#fig2]D and 2E).\nPrepare for luminescence imaging. Discard the h-coelenterazine solution and place the film with seedlings face-up within the same plate. Leave the plate in the dark for 5 min (Figure 2[href=https://www.wicell.org#fig2]F).\nAcquire luminescence images. In the dark, place the plate on the stage of the CCD imaging system. Acquire images immediately and continuously for 2–5 min upon adding 20 mL of stimuli solution to the plates (Figures 2[href=https://www.wicell.org#fig2]G and 2H). The concentrations of stimuli were listed in Table 2[href=https://www.wicell.org#tbl2].\nAnalyze luminescence images and pickup mutant candidates. Set the same display range for all acquired luminescence images. Pick the seedling with altered Ca2+ luminescence, let them recover on 1/2 MS medium (without sucrose) with 25 mg/L cefotaxime for two days before transferring to soil.\nSecond- to fourth-round screens\nTiming: 2 weeks\nThe purpose of these steps is to confirm the mutant candidates isolated during the first-round screen.",
    "Sterilize the seeds of mutant candidates and their wild-type AEQub and grow the seedlings on a square plate as indicated in Figures 3[href=https://www.wicell.org#fig3]A–3C. Prepare four replicates of the same orientated seedlings for FAS imaging as steps 33–36.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/675-Fig3.jpg\nFigure 3. Verification of mutant candidates\n(A–C) Prepare mutant candidates for the second-round of FAS Ca2+ imaging as described above. Red-letter E is marked for the orientation of the film. The seedlings of each mutant together with wild type AEQub were grown in one line.\n(D–F) Second-round of FAS Ca2+ imaging for mutant verification. Acquire H2O2 (D), NaCl (E), and mannitol (F) induced Ca2+ luminescence images for 160 s at an interval of 40 s.\n(G) Acquire discharged images. Discard the stimuli and acquire images for one minute right after applying the discharge solution to stimuli-treated films.\n(H) The third round of FAS Ca2+ imaging for mutant verification. Mutant candidates and wild-type control were grown on the same plate and transferred onto the same film for FAS Ca2+ imaging. Altered Ca2+ luminescence responses of the mutant were recorded under cold, oxidative, salt, and osmotic stress as compared to wild type.\nScale bars, 1 cm.\nAcquire images at an interval of 40 s for 160 s immediately upon adding 20 mL of 100 mM NaCl, 400 mM mannitol, 1 mM H2O2 to each plate, respectively (Figures 3[href=https://www.wicell.org#fig3]D–3F). Acquire discharged images by applying 20 mL of discharge solution (2 M CaCl2 in 20% ethanol) to the plate containing the previous stimuli-treated seedlings (Figure 3[href=https://www.wicell.org#fig3]G).\nAnalyze luminescence images by comparing Ca2+ signal response images to its discharge images of mutant candidates. Mutant candidates with enhanced or reduced Ca2+ luminescence to given stimuli, but with similar luminescence intensity of discharged images should be considered for further verification by performing third- to fourth-round confirmation (Figure 3[href=https://www.wicell.org#fig3]H).",
    "Note: As noted above, the physiological status of seedling significantly affects Ca2+ signal response. To avoid the interference by defect of seed germination and growth, we recommend using the different batches of mutant seeds together with their wild-type AEQsig6 or AEQub that were harvested under the same growth condition for each round screen.\nCritical: Mutant candidates with reduced luminescence intensity of discharged aequorin should be eliminated (Figure 1[href=https://www.wicell.org#fig1]C and mutant 11 in Figures 3[href=https://www.wicell.org#fig3]D–3G). These could be caused by reduced expression of the apoaequorin gene due to mutations or silencing, or defects in coelenterazine absorption or aequorin reconstitution as described above.\nQuantitative Ca2+ measurement using a luminometer with AEQ seedlings\nTiming: 10 h\nThe purpose of these steps is to determine the Ca2+ signal dynamical features of mutants in response to given stimuli.\nPlace a single 7-day-old AEQsig6 or AEQub seedling into a 1.5 mL Eppendorf tube that contains 1 mL of 1 μg/mL h-coelenterazine and place them in a light-seal box and leave it on a shaker (80 rpm/min) at room temperature overnight (20°C–25°C, 9–11 h).\nPlace the tube contains the seedling into the luminometer chamber. Acquire the signal for 60 s at 1 s intervals for resting luminescence.\nAcquire luminescence intensity (Lstimuli) at 1 s intervals for 80–120 s (depended on the duration of Ca2+ luminescence response) immediately after adding 1 mL of 400 mM mannitol, or 100 mM NaCl, or 5 mM H2O2 solution into the tube.\nDiscard the stimuli solution, and acquire the luminescence intensity (Lrest) at 1 s intervals about 2 min until values were within 5% of the highest discharged value, immediately after adding 1 mL of discharging buffer (2 M CaCl2 in 20% ethanol).",
    "Note: Steps 42–45 can be adjusted depending on the type of luminometer used (Mittal et al., 2020[href=https://www.wicell.org#bib27], Tanaka et al., 2013[href=https://www.wicell.org#bib39]).\nThe total luminescence (Lmax) is calculated by Lrest plus Lstimuli. The calibration equation is adopted from the previously described equation (Knight et al., 1996[href=https://www.wicell.org#bib15]): pCa = 0.332588 (-logk) + 5.5593, where k is a rate constant equal to stimuli triggered aequorin luminescence (Lstimuli) divided by total luminescence (Lmax). Mutants with either altered amplitudes or durations are shown in Figure 4[href=https://www.wicell.org#fig4].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/675-Fig4.jpg\nFigure 4. Quantification of cytosolic Ca2+ elevation in mutant candidates with altered Ca2+ signal responses using a luminometer\n(A) Quantification of cytosolic Ca2+ elevation in WT and m1 after treated with 400 mM mannitol.\n(B) Quantification of cytosolic Ca2+ elevation in WT and m2 after treated with 5 mM H2O2.\nArrows indicate the time points for treatments.\nWhole-genome resequencing\nTiming: 10 months\nThe purpose of these steps is to clone the gene with the mutation responsible for the altered Ca2+ signal response.\nBackcross the mutant with wild-type AEQsig6 or AEQub, and analyze the mannitol-induced Ca2+ signal in F1 seedlings. When F1 shows a wild-type phenotype, it is a recessive mutation, and vice versa, it is a dominant mutation. We suppose the mutation is recessive here.\nGenerate the backcrossed F2 population, the ratio of mutant-like and WT-like seedlings is 1:3 in the backcrossed F2 population.\nAnalyze the mannitol-induced Ca2+ signal response in the F2 population as steps 1–22, and pick up putative mutant seedlings with reduced mannitol-induced Ca2+ luminescence response. At least 200 F2 seedlings were selected and planted in soil. Collect the DNA of each candidate F2 mutants.\nHarvest F3 seeds from single F2 seedlings.\nAnalyze the mannitol-induced Ca2+ signal in the F3 seedlings.",
    "Select 40–50 single lines with reduced Ca2+ luminescence, and pooled the corresponding previously collected F2 DNA together for whole-genome resequencing (Abe et al., 2012[href=https://www.wicell.org#bib2]).\nResequence the mutant parent line and the wild-type AEQsig6.\nLook for SNP changes only present in the mutant bulk as described previously (Abe et al., 2012[href=https://www.wicell.org#bib2]).\nAlternatives: Map-based cloning using Wassilewskija (Ws) background also works (Yuan et al., 2014[href=https://www.wicell.org#bib51]), but will also require a larger population to be screened."
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Plant Sciences",
    "Genetics",
    "Model Organisms",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Ecology & Environmental Biology"
  ]
}