{
  "id": 9422,
  "origin_website": "Jove",
  "title": "Fast Micro-iontophoresis of Glutamate and GABA: A Useful Tool to Investigate Synaptic Integration",
  "procedures": [
    "1. System Requirements\nMicroscope system: Good visualization of the dendrite is crucial. If available, use a two-photon laser scanning microscope system. In our experiments we used a TRIM Scope II, LaVision Biotec, Bielefeld, Germany or an Ultima IV system, Prairie Technologies, Middleton, Wisconsin equipped with a Ti:Sapphire ultrafast-pulsed laser (Chameleon Ultra II, Coherent) and a high NA objective (60X, 0.9 NA, Olympus) to visualize the dendrites which we had filled with a fluorescent dye via the patch pipette. Although photo-damage is thought to be less severe using 2-photon scanning, reduce the laser power (below 8 mW at the tissue) and dwell times (below 1 μsec) or as much as possible.\nA second possibility is to trigger a wide-field fluorescence light source (LED or a fluorescent lamp) synchronously with acquisition to reduce exposure time as much as possible. We have used a monochromator with an integrated light source (TILLPhotonics, Gräfelfing, Germany) on a Zeiss Axioskop 2 FS upright microscope which was equipped with Dodt-contrast infrared illumination (TILLPhotonics, Gräfelfing, Germany). In our experiments exposure times ranged from usually 10 msec to max. 30 msec.",
    "Use a fast micro-iontophoresis amplifier, e.g. a two-channel micro-iontophoresis system MVCS-C-02 (npi electronic, Tamm, Germany) with fast capacitance compensation. The fine-tipped iontophoresis microelectrodes have resistances of 25 - 100 MΩ (crucially depending on the tip size and the pipette shape), and fast rise times can only be achieved if the capacitance compensation of the iontophoretic amplifier is optimally tuned. This fast compensation is necessary to apply current pulses with a brief and rapid onset in the sub-millisecond range to the iontophoretic pipette and thereby to eject the transmitter with high spatial resolution in spot sizes below 1 μm13. Iontophoresis amplifiers are also available from several other companies, which we have not tested in our laboratory. These devices are to our knowledge not equipped with capacitance compensation circuitry.\n2. Prepare Solutions\nPrepare artificial cerebrospinal fluid (ACSF) and internal solution as it is required for the experimental design. The only addition to the internal solution, which is required, is a red or green fluorescent dye (e.g. 50 to 200 μM Alexa Fluor 488 or 594 hydrazide, Invitrogen), depending on the optical equipment. Here an example for ACSFsucrose which can be used for dissection, in mM: 60 NaCl, 100 sucrose, 2.5 KCl, 1.25 NaH2PO4, 26 NaHCO3, 1 CaCl2, 5 MgCl2, 20 glucose; and for normal ACSF solution for patch-clamp experiments in mM: 125 NaCl, 3 KCl, 1.25 NaH2PO4, 26 NaHCO3, 2.6 CaCl2, 1.3 MgCl2, 15 glucose.\nCarbogenize (95% O2, 5% CO2) all extracellular solutions constantly.\nPrepare internal solution, for example, in mM: 140 K-gluconate, 7 KCl, 5 HEPES-acid, 0.5 MgCl2, 5 Phosphocreatine, 0.16 EGTA; with 50 - 200 μM Alexa 488.\nFor glutamate micro-iontophoresis prepare a solution with 150 mM glutamic acid and adjust the pH to 7.0 with NaOH. Add 50 -200 μM Alexa Fluor 488 or 594 hydrazide (Invitrogen) for visualization.",
    "For iontophoresis of GABA prepare a 1 M GABA solution and adjust the pH to 5 with HCl15. At this pH GABA is charged, only then it can be applied using iontophoresis. Please note that the low pH in the solution ejected to the extracellular space might effect GABA transmission itself 16,17.\n\tProtect the GABA solution from light and frequently prepare fresh GABA stock solution, since older solution can lose its effectiveness.\nIf it is difficult to see GABAergic events, a high Cl- driving force internal solution, for example by leaving out KCl, might help to visualize the GABAergic events to see if the GABA iontophoresis is working; however to investigate synaptic integration a physiological driving force might be recommended. For general detection of small GABAergic events, a protocol shown in Figure 8C can help.\n3. Pull and Test the Iontophoresis Pipettes\nIn general, pulling the right pipettes is maybe the most critical step to achieve controlled neurotransmitter iontophoresis. When using iontophoresis in cell culture, it is possible to pull very fine electrodes similar to sharp microelectrodes10. In patch-clamp experiments in acute slices, however, these very thin pipettes bend on the slice surface when they are lowered into the tissue with an angle, making it impossible to reach deeper dendrites.\nTherefore, pull a pipette with a very small tip, so that no neurotransmitter can leak out, but the tip has to be still rigid enough to penetrate into the tissue (Figure 2). For example, use 150 GB F 8P class pipettes (Science Products, Hofheim, Germany) and a horizontal puller (for example a DMZ-Universal Puller, Zeitz-Instruments GmbH, Martinsried, Germany; or a P-97 Puller, Sutter Instrument Company, Novato, CA) with several pulling steps to achieve a small opening, but also a short tapper with a steep angle (Figure 2 and Table 2).",
    "It is also possible to use quartz glass pipettes to pull iontophoretic pipettes10. These are supposed to have better mechanical properties and to be more reliable; however special laser pullers are required. But it is also possible to achieve good results with normal glass pipettes, which are usually used for pulling patch pipettes.\nTest the pipette performance and resistance in a chamber without tissue, before using them for the first time, since leakage of glutamate could harm the tissue.\nSet up the iontophoresis amplifier correctly. Then fill the pipette with the neurotransmitter and dye containing solution and place it into the bath (ACSF).\nCompensate the capacitance (Figure 3). Usually very sharp pipettes will have a higher capacitance than blunt ones.\nCheck the resistance of the pipette: The micro-iontophoresis amplifier used here has a build-in feature for measuring the pipette resistance. It evokes brief rectangular test pulses, which can be monitored with a standard oscilloscope or an A/D board connected to a computer with acquisition software. Depending on the shape and the tip size, the tip should have a resistance between 25 - 90 MΩ.\nFocus on the tip with a 60X or 40X water immersion objective and switch to fluorescent imaging and if possible, zoom in. If fluorescent dye leaks out of the pipette tip, apply a small positive (in the case of glutamate) or negative (in the case of GABA, Figure 4) retain current (<0.02 μA). If that doesn't help to cancel the leakage, change the pipette.",
    "Apply a strong step current or use the manual trigger and monitor the tip in the fluorescent image to see if the solution can be ejected out of the pipette. As mentioned above, the polarity of the current pulse is depending on the charge of the molecule that is supposed to be ejected. To eject glutamate it is a negative current and for GABA a positive current (Figure 4).\nAir bubbles in the pipette that block ejection of dye and transmitter, can be cleared by applying a high ejection current several times.\nTaken together, if there is no visible leakage and test ejection was successful, compensate the capacitance and start the experiment.\nCaution: Since capacitance compensation is achieved by a feedback circuit, this circuit can overshoot or oscillate if it is overcompensated. Gently use the dial setting for capacitance compensation.\nDepending on the puller stability it is sometimes necessary to adjust the puller settings from time to time, since the filament may have changed properties. However, if once a good pipette is designed, it can be used for several days. Therefore, after finishing the experiment store the iontophoretic pipette in a closed container without damaging the tip.\nFor the next experiment fill the pipette with the neurotransmitter solution, apply several strong eject pulses to clear the tip and then check if the properties (e.g. resistance) change significantly. Then compensate the capacitance and use the pipette again. Do not use a single pipette with different neurotransmitter solutions.\n4. Prepare the Brain Slices\nIf micro-iontophoresis is used for the first time definitely prepare the slices after establishing a reliably working puller program.\nPerform anaesthesia and decapitation procedures in accordance to the animal care guidelines of your institution or local authority.",
    "After the removal of the brain, transfer it to ice cold ACSFsucrose (see Protocol 2.1).\nCut the region of interest into slices of appropriate thickness (for example 300 μm).\nIncubate the slices in ACSFsucrose at 35 °C for 30 min. Subsequently, transfer them to a submerged holding chamber containing normal ACSF at room temperature.\nThroughout the preparation and experiment carbogenize the ACSF surrounding the slices with 95% O2, 5% CO2 .\n5. Establish a Whole-cell Recording\nPosition the iontophoresis pipette(s) already near the slice surface before patching a cell, to avoid long lasting positioning, after establishing the whole-cell mode.\nPull a low resistance patch pipette (3 - 5 mΩ), fill it with the dye containing internal solution and apply positive pressure to the pipette (30 - 60 mbar).\nEnter the bath and approach the cell under visual guidance (infrared dodt contrast or two photon gradient contrast image).\nMonitor the pipette resistance with a test pulse (e.g. -10 mV, 20 msec) in voltage clamp mode. When touching the tissue correct the offset potential.\nApproach the cell and gently push the pipette tip into it until a \"dimple\" can be seen clearly. Immediately release the pressure of the pipette, apply 40 - 60 mbar negative pressure and switch the membrane potential to -65 mV.\nWhen the holding current reaches values below 100 pA, release the negative pressure.\nAfter establishing a giga seal (resistance >1 GΩ), rupture the membrane with a short, strong suction to the pipette or brief overcompensation of the capacitance compensation circuit.\nDepending on which mode (voltage or current clamp) is required for the experimental design, compensate appropriately.\nStart to bring the iontophoretic pipette into its final position. If a more detailed description of how to successfully perform patch clamp recordings is needed, there are several excellent guidelines available18,19.",
    "6. Place the Iontophoretic Pipette and Generate a Postsynaptic Iontophoretic Potential\nIn general, iontophoretic events can be evoked at defined locations depending on the desired experiment, for example, at a spiny dendrite for glutamate micro-iontophoresis, at the dendritic shaft, soma or axon initial segment for GABA micro-iontophoresis.\nApproach the cell up to approximately 1 μm distance without touching it. After reaching the position of interest it is crucial that no neurotransmitter is leaking out and that the pipette capacitance is compensated correctly.\nIf approaching the cell with a glutamate filled iontophoretic pipette causes detectable depolarization of the membrane potential, adjust the retain current if possible, or change the pipette.\nApply short negative current pulses, starting from zero and increase the current systematically (e.g. 0.1 - 0.4 msec, 0.01 - 1 μA pulses). This helps to find out in which range the iontophoretic current evokes the desired responses in the specific experimental set-up.\nIf there is no response detectable, lift the pipette several hundred micrometers and apply a strong eject current (>0.1 μA) to clean the tip. Adjust the capacitance compensation, approach the cell, and try again.\nIf there is still no response, reduce the retain current. Be very careful with the dial settings since this procedure can cause uncontrolled neurotransmitter release. Therefore, constantly monitor the recording to detect respective changes in membrane potential.\nIf it is difficult to detect GABAergic events, it can be helpful to use an internal solution composition yielding in a high Cl- driving force. To achieve this, reduce the Cl- concentration in the pipette solution (see protocol section 2.6.). This will result in larger GABAergic events at resting membrane potential due to a higher driving force.",
    "Alternatively, inject long current steps resulting in membrane potential chances from -100 mV to -48 mV (Figure 8C). With this protocol the Cl- driving force is increased at hyperpolarized potentials causing a depolarizing GABA response.\nIt is also possible to use the step current injection protocol to determine the reversal potential of the evoked events, which helps to determine the GABAergic nature of the events. Leakage of GABA is harder to detect than leakage of glutamate. In this case, a constant monitoring of the input resistance can help, when the GABA filled pipette is approached. If the input resistance decreases, the retain current can be increased or a different pipette should be used.\nAs control experiments for glutamate iontophoresis, we suggest a Ca2+ imaging experiment, using 200 μM OGB-1 and no EGTA in the pipette solution to visualize local calcium influx that might be caused by leaking glutamate.\nIn general, to achieve a stable response it is very important to have a mechanically stable pipette to avoid drift over time. Drift can be caused by temperature changes, therefore it is recommended to switch on the equipment at least half an hour before the measurements to avoid thermal drift. Be sure to use good cartridge seals in the pipette holder and the tip is really fixed. The holder itself can be additionally fixed with Teflon tape; furthermore, be sure that there is no tension on the cables from the headstage or manipulator, which also is a potential source of drift.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}