{
  "id": 17341,
  "origin_website": "Jove",
  "title": "Whole-Kidney Three-Dimensional Staining with CUBIC",
  "procedures": [
    "All experiments were approved by the University of Tokyo Institutional Review Board. All animal procedures were performed according to the National Institutes of Health guidelines. Male C57BL/6NJcl mice, 8 weeks old, were used for the present study. The mice were obtained from commercial sources (see Table of Materials).\n1. Animal preparation and kidney fixation\nPerform perfusion fixation following the steps below.\n\t\nAnesthetize the mouse by inhalation of isoflurane (3%, 2.0 L/min) and intraperitoneal administration of medetomidine hydrochloride (0.3 mg/kg), butorphanol tartrate (5 mg/kg), and midazolam (4 mg/kg) (see Table of Materials).\nPerfuse the animal with 20 mL of PBS (pH 7.4) and 30 mL of 4% PFA in phosphate buffer (PB) through the left ventricle of the heart12.\nPerform the immersion fixation just after the perfusion fixation and kidney sampling9.\n\t\nImmerse the kidney in 4% PFA at 4 °C for an additional 16 h, then wash it with PBS for 2 h (three times)9 (Figure 1).\n\t\t​CAUTION: Formaldehyde and paraformaldehyde are toxic irritants. Handle reagents in a fume hood with appropriate personal protective equipment.\n2. Decolorization and delipidation\nPrepare CUBIC-L for decolorization and delipidation consisting of 10 wt% of Triton X-100 and 10 wt% of N-buthyldiethanolamine (see Table of Materials), following previously published reports4,8,9.\nPerform decolorization and delipidation by CUBIC-L following the steps below.\n\t\nImmerse the fixed kidney in 7 mL of 50% (v/v) CUBIC-L (1:1 mixture of water and CUBIC-L) in a 14 mL round bottom tube (see Table of Materials) with gentle shaking at room temperature for 6 h (Figure 2A). Then, immerse it in 7 mL of CUBIC-L in a 14 mL round bottom tube with gentle shaking at 37 °C for 5 days.",
    "Refresh CUBIC-L every day during this process. After the decolorization and delipidation process, wash the kidney with PBS at room temperature for 2 h (three times)9 (Figure 1). Use a dispensing spoon for sample handling (Figure 2B).\n3. Whole-mount immunofluorescent staining\nPrepare the staining buffers.\n\t\nPrepare the staining buffer for primary antibodies by mixing 0.5% (v/v) Triton X-100, 0.5% casein in PBS, and 0.05% sodium azide9.\nPrepare the staining buffer for secondary antibodies by mixing 0.5% (v/v) Triton X-100, 0.1% casein in PBS, and 0.05% sodium azide9.\nPerform staining with primary antibodies.\n\t\nImmunostain the delipidated kidney with primary antibodies (1:100 or 1:200, see Table of Materials) in the staining buffer at 37 °C with gentle shaking for 7 days.\n\t\tNOTE: The amount of the staining buffer needed for one kidney is 500-600 µL (Figure 2C).\nWash the kidney with 0.5% (v/v) Triton X-100 in PBS (PBST) at room temperature for 1 day9 (Figure 1).\nPerform staining with secondary antibodies.\n\t\nImmunostain the kidney with secondary antibodies (1:100 or 1:200, see Table of Materials) in the staining buffer at 37 °C with gentle shaking for 7 days. Wash the kidney with PBST at room temperature for 1 day9 (Figure 1).\nPost fixation9, immerse the kidney in 1% formaldehyde in PB (1:36 mixture of 37% formaldehyde and PB) for 3 h, and wash it with PBS at room temperature for 6 h (Figure 1).\n4. Refractive index (RI) matching\nPrepare CUBIC-R+.\n\t\nPrepare CUBIC-R by mixing 45 wt% of 2,3-dimethyl-1-phenyl-5-pyrazolone/antipyrine and 30 wt% of nicotinamide (see Table of Materials).\nPrepare CUBIC-R+ for refractive index (RI) matching by adding 0.5 v% of N-buthyldiethanolamine to CUBIC-R following the previously published reports4,8,9.\nPerform the RI matching.",
    "Immerse the kidney in 7 mL of 50% (v/v) CUBIC-R+ (1:1 mixture of water and CUBIC-R+) in a 14 mL round bottom tube with gentle shaking at room temperature for 1 day. Then, immerse it in 7 mL of CUBIC-R+ in a 14 mL round bottom tube with gentle shaking at room temperature for 2 days9 (Figure 1).\n\t\tNOTE: Although the kidney floats in 50% CUBIC-R+ at the beginning of the RI matching, it sinks and becomes transparent in CUBIC-R+ at the end of the process (Figure 2D).\n5. Image acquisition and reconstruction\nImmerse the RI-matched kidney in a mixture of silicon oil (RI = 1.555) and mineral oil (RI = 1.467) (55:45) during image acquisition (RI = 1.51)5 (Figure 3).\nAcquire 3D images of the whole kidney with a custom-built9 light-sheet fluorescent microscope (see Table of Materials). Collect all raw image data in a 16-bit TIFF format. Visualize and capture the 3D-rendered images with the imaging analysis software (Imaris, see Table of Materials).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}