{
  "id": 15314,
  "origin_website": "Jove",
  "title": "Sequential Salt Extractions for the Analysis of Bulk Chromatin Binding Properties of Chromatin Modifying Complexes",
  "procedures": [
    "1. Preparations\nPrepare 100 mL of hypotonic solution Buffer A: 0.3 M sucrose, 60 mM KCl, 60 mM Tris pH 8.0, 2 mM EDTA, and 0.5% NP-40. Store at 4 ºC.\n\tNOTE: Some cell lines, such as HEK293T, require less stringent lysing conditions. If nuclei lyse easily, use Modified Buffer A: 25 mM HEPES pH 7.6, 25 mM KCl, 5 mM MgCl2, 0.05 mM EDTA, 0.1% NP-40, and 10% glycerol.\nPrepare a 250 mL stock solution of 2x mRIPA solution: 100 mM Tris pH 8.0, 2% NP-40, and 0.5% sodium deoxycholate.\nPrepare a 100 mL stock solution of 5 M NaCl.\nUsing the 2x mRIPA and 5 M NaCl solutions, prepare 50 mL of 1x mRIPA solution for each of the six salt concentrations: 0 mM, 100 mM, 200 mM, 300 mM, 400 mM, and 500 mM NaCl. Prior to starting the experiment, cool all solutions on ice.\nGrow cell lines under desired conditions.\n\tNOTE: When determining the effects of knocking down a protein, SSE for the knockdown line must be compared to wildtype cells. These SSE must be performed side by side. For examples using chemical inhibitors or stimuli, refer to sections 3 - 5.\n2. Basic Sequential Salt Extraction\nHarvest 8 million cells of each condition and wash twice with 5 mL of ice cold PBS.",
    "NOTE: It is critical to have equal number of cells to have equivalent protein concentrations. The exact number of cells may need to be optimized for individual cell lines or particular proteins. It is important not to have too many, as the increase in protein concentrations will prevent observation of the elution curve, which is dependent on equilibrium binding. However, with too few cells there may not be enough protein to detect the curve, and the chromatin pellet is harder to isolate and can be lost between fractions.\nRe-suspend cells in 1 mL of Buffer A + protease inhibitors, transfer into 1.5 mL micro centrifuge tubes, and rotate top over bottom at 4 ºC for 10 min.\nIsolate the nuclei by centrifugation at 6000 x g for 5 min at 4 ºC .\n\tNOTE: After this step the nuclear envelope should still be intact. If the nuclear envelope is intact, the pellet will re-suspend fully; however, when the envelope is lysed and the chromatin is released, the pellet will not re-suspend. If the nuclear envelope is not intact after Buffer A incubation, use Modified Buffer A.\nAdd 200 µL of mRIPA 0 mM NaCl + protease inhibitors to each nuclei pellet before re-suspending pellet. Homogenize each sample by pipetting 15 times with a 1 mL pipette. The pellet should re-suspend easily, however, the nuclei will lyse as it is pipetted and the sample will become thick and sticky and difficult to pipette.\n\t\nIn order to draw up the pellet into the tip, tap the end of the pipette tip against the bottom of the centrifuge tube. The pellet will not fully dissolve once the DNA is released from the nuclei, but pipetting will break it up.",
    "When all the samples have been homogenized, incubate all the samples on ice for 3 min.\n\tNOTE: The incubation time may need to be optimized depending on the protein of interest.\nIsolate chromatin pellet by centrifuging the samples for 3 min at 6500 x g at 4 ºC.\nTransfer supernatant to a clean 1.5 mL centrifuge tube. This will be the 0 mM fraction. This 0 mM mRIPA solution can act as a wash step to lysis the nuclei and remove any loose proteins not associated with chromatin.\nAdd 200 µL of mRIPA 100 mM NaCl + protease inhibitors to each chromatin pellet before re-suspending pellet. Break up the chromatin pellet by pipetting the pellet up and down 15 times.\n\tNOTE: It is critical to be consistent with the number of times the pellet in pipetted.\nIncubate on ice for 3 min. This incubation step allows all samples to reach an equilibrium state, which is particularly important when there are multiple samples.\nCentrifuge at 6500 x g for 3 min at 4 ºC and transfer supernatant to a clean 1.5 mL tube.\nRepeat 2.6 - 2.10 for the remaining salt concentrations.\n\tNOTE: After 400 mM NaCl, mRIPA the pellet should be clear and gloopy and will not stay at the bottom of the tube. The pellet can be placed in the lid of the centrifuge tube while the supernatant isolated.\nAdd 70 µL of 4x protein loading dye to each fraction and load 30 µL of each fraction on to an SDS acrylamide gel for western blot analysis.\n\tNOTE: To determine the binding profile of the protein, it is critical to load equivalent volumes of lysate, rather than loading equal protein concentrations.\nPerform a standard western blot by transferring onto a membrane and use primary antibodies for proteins of interest.",
    "To quantitate the protein eluted from the chromatin, incubate the blot in infrared fluorescence IRDye secondary antibodies and image blot with an imager. While other methods of development can be used, we recommend fluorescence or infrared imaging, as it is more quantitative in nature.\nUse ImageJ or similar software to calculate the intensity for the protein eluted at each salt concentration. By graphing the band intensity against the salt concentration, the elution pattern of your protein of interest can be determined.\n3. Sequential Salt Extraction in the Presence of a \"Reader\" Inhibitor\nHarvest two sets of cells (4 million) and isolate the nuclei as in a standard SSE.\nRe-suspend both sets in 200 µL of mRIPA 0 mM NaCl and incubate for 3 min. This will allow for the removal of any free protein in the nuclei.\nAdd 200 µL mRIPA 0 mM NaCl to each pellet. Add the inhibitor (2 µL of 1 mM (+)JQ1) to one sample and DMSO to the control set.\nAgitate the pellet by pipetting 15 times and incubate on ice for 5 min.\nCentrifuge at 6500 x g for 3 min at 4 ºC and transfer supernatant to a clean 1.5 mL tube.\nRepeat 3.3 - 4 for all the salt concentrations and perform a standard western blot.\n4. Sequential Salt Extraction in the Presence of a \"Writer\" Inhibitor\nTreat cells with the inhibitor (10 µM SAHA) or DMSO for 3 h.\nHarvest 4 million cells for each treatment.\nPerform a standard SSE for the samples with the inhibitor added to all the buffers.\n5. Sequential Salt Extraction Following DNA Damage\nTreat cells with 1 µM doxorubicin for 1 h.\nChange the media on the cells and allow them to recover for 3 h.\nHarvest 8 million cells and perform the basic SSE.",
    "6. Non-Sequential Salt Extraction\nHarvest 12 million cells and wash with PBS.\nDivide cells so that there are 2 million cells per micro centrifuge tube.\nRe-suspend in 500 µL of Buffer A and incubate for 10 min.\nIsolate the nuclei by centrifugation at 6000 x g.\nRe-suspend pellets in a 200 µL of each of the mRIPA buffers + NaCl.\nHomogenize each sample by pipetting 15 times with a 1 mL pipette tip.\nIncubate on ice for 3 min.\nIsolate the chromatin by centrifugation at 6500 x g and transfer the supernatant to clean tubes. Add 70 µL of loading dye and run 30 µL on a SDS-page gel for western blot analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}