{
  "id": 2553,
  "origin_website": "Cell",
  "title": "Protocol for intranasal chemoprevention delivery in a urethane mouse lung cancer model",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nUrethane injection\nTiming: 2 h (depending on number of mice); injections completed in the morning\nIn this step, urethane is injected to initiate the carcinogenesis process. Saline injections are used in control animals. FVB/N or A/J mice are administered with one intraperitoneal (IP) injection of 1 mg urethane/g body weight dissolved in 0.9% saline.\nWeigh mice and record weights.\nPrepare urethane.\nStock urethane is stored at 20–25°C for up to two years. Urethane should be diluted the morning of the injections and can be stored at 20–25°C for eight hours.\nUse the table below to determine the required volume and concentration of urethane solutions based on mouse weights and number of mice in each weight category.\nWeigh urethane calculated from the table into pre-tared tubes.\nAdd sterile saline and vortex to dissolve urethane.\nSterile filter solution into new sterile tubes.\ntable:files/protocols_protocol_2057_1.csv\nInject urethane or saline.\nFill a new sterile syringe with needle (25 gauge, 5/8 inch) with 100 μL of the appropriate urethane concentration for each mouse according to its weight.\nPut mouse cages in a biosafety cabinet, remove a mouse to identify and verify its weight with recorded weights, swab abdomen with 70% alcohol, and inject urethane IP (Figure 1[href=https://www.wicell.org#fig1]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2057-Fig1.jpg\nFigure 1. Urethane exposure\nUrethane is delivered by a 100 μL IP injection as a 1 mg/g body weight dose to 8–10 week old mice. Control mice are injected IP with 100 μL saline. Mice become lethargic and are monitored during recovery but do not lose ability to right themselves or regulate body heat.\nFor saline control injections, fill a new sterile syringe with needle with 100 μL sterile saline, remove a mouse to identify, swab abdomen with 70% alcohol, and inject IP.",
    "Return mice to cage and monitor hourly until fully recovered.\nCritical: Urethane is an anesthetic and mice should experience lethargy within minutes of injection that persists for 1–5 h. Mice do not lose the ability to right themselves or to maintain body heat but assess the mice for ability to right themselves before beginning hourly monitoring. Mice regain activity and show no negative effects of injection within a few hours. Any mice which become unresponsive or fail to recover should be euthanized, but this is an extremely rare event. Troubleshooting 1[href=https://www.wicell.org#sec6.1]. Technical expertise with IP injections is key to consistent experimental results. Personnel should wear appropriate PPE when working with urethane or urethane exposed animals and their bedding and SOPs should be established with individual IACUCs.\nNote: Dissolving urethane in saline requires extensive mixing and care should be taken to ensure complete dissolution. Dosing for other strains of mice or other carcinogens should be determined experimentally or from published studies. Plan to deliver 1 mg/g body weight in 100 μL volume sterile saline to each mouse. For example, for 20 mice weighing 24 grams each, 480 mg of urethane would be dissolved in 2 mL of sterile saline. At the low dose of urethane used in this protocol, mice are lethargic for only a short time and do not lose the ability to right themselves or regulate body heat. Heated cages or heating pads can be used if animals need assisted recovery.\nMonitor animals\nTiming: For 14 weeks after urethane injection\nAnimals are monitored daily for the first week and weekly thereafter during lesion development for overall health. This step ensures humane treatment of the animals and can identify early in the study any major problems (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2057-Fig2.jpg\nFigure 2. Mouse health monitoring",
    "As with all chemical carcinogen protocols, mice are monitored closely for signs of declining health. For the first week after urethane injection, mice are weighed daily and evaluated for pain or distress. Thereafter and until sacrifice, mice are weighed weekly and evaluated daily for pain or distress. Weight loss is the most common sign of declining health in urethane studies.\nWeigh mice and record weights daily for the first week after urethane injection.\nEvaluate animals who approach 15% weight loss. Determine if nutritional support is appropriate.\nEuthanize animals who have more than 15% weight loss or are demonstrating sick rodent postures, abdominal distension, a black-hued abdomen, or difficulty breathing. Necropsy when indicated to determine cause of death.\nWeigh mice and record weights weekly for weeks 2–14 after urethane injection.\nEvaluate animals who approach 15% weight loss. Determine if nutritional support is appropriate.\nEuthanize animals who have more than 15% weight loss or are demonstrating sick rodent postures, abdominal distension, a black-hued abdomen, or difficulty breathing. Necropsy when indicated to determine cause of death.\nNote: Depending on the strain, some mice are more strongly affected by urethane toxicity and need additional nutritional support (treats) or monitoring. Before conducting carcinogen studies, lab experience or the literature should be used to estimate the risk of off-target health effects in specific strains. Necropsies of animals euthanized before study endpoint may identify areas for technical improvement or susceptibilities in specific strains. Our recommended weight loss cutoff of 15% for humane euthanasia are included in the steps above and were established by our experience and preference of institutional veterinary staff. Investigators should establish weight loss thresholds with individual institutional IACUCs.\nAdminister intranasal iloprost\nTiming: At week 9 after urethane injection; 1 h (to treat, depending on animal number)/day, 5 days/week, for 5 weeks",
    "In this step, intranasal iloprost is administered as a chemopreventive agent to reduce development of premalignant lesions and carcinomas. Monitoring of overall animal health, as described above, continues throughout iloprost administration.\nPrepare iloprost.\nStock iloprost is stored at -20°C for up to one year. Diluted Iloprost should be prepared immediately before use at 20–25°C and not stored beyond the time required for administration.\nDilute iloprost in sterile saline to achieve a concentration of 5 μg/100 μL and the volume needed for 100 μL per mouse.\nUse a sterile syringe and needle to collect iloprost from vial.\nAdd sterile saline to a sterile tube at a volume of 100 μL per control mouse.\nUse a sterile syringe and needle (or other sterile approach) to collect saline from stock container.\nAdminister intranasal iloprost.\nAnesthetize mice with isoflurane (3% in oxygen) according to institutional guidelines.\nOnce mice have stopped moving and are breathing slowly and deeply (3–4 min), load a p200 pipette with 100 μL iloprost or saline solution.\nHold the mouse by its ears and tilt its head back. Deliver a drop of solution to the edge of the mouse’s nare (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2057-Fig3.jpg\nFigure 3. Intranasal iloprost administration\nIloprost is delivered nine weeks after the urethane injection. Mice are anesthetized with isolflurane (3% in oxygen) and 5 μg of Iloprost is delivered by two 50 μL doses, one to each nare of the mouse. Control mice are administered two 50 μL doses of saline. Treatments occur 5 days/week for five weeks. Recovery from the brief dose of anesthetic is quick and when mice are confirmed to be breathing normally and awakening, they are returned to their home cage.\nWait for the mouse to inhale the solution, then apply more until 50 μL have been dispensed.",
    "Deliver the second 50 μL to the other nare.\nBefore returning the mouse to its cage, make sure it is breathing regularly. If not, tap on its chest or back or move it around gently.\nEnsure mouse is waking up before returning cage to housing.\nRepeat steps 6 and 7 to deliver iloprost five days per week for five weeks.\nMonitor animals during iloprost treatment weeks according to urethane guidelines (step 5).\nCritical: Training and practice with intranasal delivery should be conducted with saline before an experiment is initiated to establish efficient and swift technique. Initial attempts may result in solution dripping into the mouth and being breathed in or swallowed through the mouth.\nOptional: In this model, mice receive 5 μg of iloprost in 100 μL five days/week for five weeks. The combination of iloprost with other carcinogens or in different strains may require alternate dosing. Chemoprevention agents can be delivered in smaller volume depending on required concentration and solubility. Iloprost can be requested from Cayman Chemical in different formulations depending on experimental needs.\nNote: The 5 day/week administration of 5 μg/100 mL iloprost/saline parallels dosing of iloprost in humans, but if needed, alternative dosing schedules that reduce animal-human contact could be tested for efficacy. Dosing for other strains of mice or other chemopreventive agents should be determined experimentally or from published studies. Concentrated agents may result in nasal irritation, so a pilot study should be conducted with new agents to ensure mice can tolerate the desired dose. Work quickly when delivering agents intranasally because mice quickly recover from their brief exposure to isoflurane. If intranasal iloprost administration is slow and mice are receiving longer delivery of gas anesthetic, heated cages or heating pads can be used to support recovery.\nStudy endpoint",
    "Timing: 14 weeks after urethane (depends on experiment parameters); harvest time depends on sample collection needs\nHyperplasia and adenomas begin to appear 3–6 weeks after urethane injection in FVB/N mice. At 14–16 weeks, FVB/N have 3–6 adenomas >1 mm and adenocarcinoma appears after 30 weeks. This step counts lesions and collects samples for analysis. Standard protocols for lung lesion and tissue harvest have been previously published. (Sozio et al., 2021[href=https://www.wicell.org#bib8]; Davenport et al., 2020[href=https://www.wicell.org#bib1]) Exact protocols for harvest depend on the specific study and samples being collected.\nHarvest lesions and tissue.\nMice are injected IP with 200 mg/kg Fatal Plus and when animals are unresponsive to toe pinch, blood samples can be collected by cardiac puncture with a syringe and needle (25 g × 5/8) and processed for downstream analysis.\nDeath is confirmed by exsanguination and cessation of heartbeat and breathing in accordance with IACUC guidelines.\nSpray mouse with 70% ethanol, cut open skin to expose thoracic and abdominal cavity, cut the inferior vena cava, and expose the lungs by cutting through the rib cage (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2057-Fig4.jpg\nFigure 4. Sample collection\n14 weeks after the urethane injection, mice are sacrificed by pharmacologic euthanasia and exsanguination.\n(A) The thoracic cavity is opened.\n(B) The rib cage is cut through the sternum and separated. The lungs are perfused with cold saline solution.\n(C) The trachea is cut and connective tissue is separated to facilitate removal of the lungs.\n(D) Lung, tracheal, and lesion tissue can be collected according to study needs.\nPerfuse the lungs with cold saline solution in a 5 mL syringe by inserting the syringe into the right heart ventricle. Perfusion is indicated by lung inflation and white color of the tissue.\nSample collection.",
    "Lungs can be inflated with 10% formalin for fixation and the trachea tied off before removal.\nAlternatively, use a hemostat to clamp the left bronchus, remove the left lobe for fresh or frozen analysis, and then proceed with inflating the right lung with formalin.\nLobes can be flash frozen in liquid nitrogen, stored in nucleic acid preservative (RNA Later) for nucleic acid extraction, or processed for fresh tissue or cell analysis.\nAlternatively, whole lung can be dissected by holding the trachea and gently removing connective tissue around the lungs, leaving them intact.\nWhole lung can be transferred to saline or formalin, depending on downstream analysis.\nTroubleshooting 2[href=https://www.wicell.org#sec6.3], troubleshooting 3[href=https://www.wicell.org#sec6.5].\nCritical: Pharmaceutical overdose should be used for mouse euthanasia to protect airway and lung tissue from damage or physiological alterations (for example, Fatal Plus or ketamine/xylazine). Alternatively, CO2 with cervical dislocation can be used for euthanasia.\nOptional: Our experience is with harvesting lesions and tissues after urethane and iloprost at 14 weeks, but depending on the experimental plan, the harvest could be conducted at a later time point. If fixed tissue analysis is planned, the simplest approach is to add animals to each group for fixation of the whole lung. It is possible to tie off and remove the left lobe for biochemical analysis and fix only the right lobe, but if tumor counting is an endpoint, the left lung should be counted immediately after removal and the right fixed lung should be serially sectioned at 5 μm and every tenth slide analyzed for lesions (about 15 slides per mouse)."
  ],
  "subjectAreas": [
    "Model Organisms",
    "Cancer"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}