{
  "id": 6928,
  "origin_website": "Bio",
  "title": "RETRACTED: Paper Lateral Flow Biosensor for Nodavirus Reverse Transcribed RNA Detection",
  "procedures": [
    "Tailing of dA20 oligonucleotide probes with dATPDissolve the lyophilized oligonucleotide dA20 with the amount of PCR-grade water which is required to have 100 pmol/µl stock solution of the oligonucleotides, according to the manufacturer instructions.Set up the tailing reaction (20 µl) by mixing 2 µl of the terminal transferase reaction buffer, containing potassium acetate (50 mM), Tris-acetate (20 mM) and magnesium acetate (10 mM), in pH 7.9, 2 µl of CoCl2 (0.25 mM); 0.7 µl of dATP (3.5 mM), 0.5 µl of terminal deoxynucleotidyl transferase (TdT, 10 units) and 7 µl of dA20.Incubate for 1 h at 37 °C.Stop the reaction with incubation at 70 °C for 10 min.Store the poly(dA) tailed oligonucleotides at -20 °C.Preparation of the dry-reagent lateral flow biosensorsWash the TLC applicator syringe:Wash 10 times with distilled-deionized water (ddH2O).Wash 10 times with 50% ethanol (EtOH).Leave filled until use.Wash 20 times with distilled-deionized water (ddH2O).Prepare the poly(dA) oligonucleotide working solution by diluting the 35 pmol/µl poly(dA) tailed stock with the appropriate volume of a solution containing 50 ml/L methanol and 20 g/L sucrose in 1× PBS buffer, to a final concentration of 4 pmol/µl.Prepare the streptavidin (SA) working solution by diluting a 10 µg/µl SA stock solution with the appropriate volume of a solution containing 150 ml/L methanol and 20 g/L sucrose in 1× PBS buffer, to a final concentration of 4 µg/µl.Load 7 µl of the 4 pmol/µl poly(dA) tailed working solution to the syringe.Spray the poly(dA) tailed working solution to the immobilized membrane in the TLC applicator instrument with velocity of 60 nl/s, to result in the control zone (CZ) of 2.4 pmol poly(dA) per 4mm LFB.Spray the SA working solution to the immobilized membrane in the TLC applicator instrument with velocity of 250 nl/s, to result in the test zone (TZ) of 1.",
    "6 µg SA per 4 mm LFB.Dry the membrane at 80 °C for 1 h.Store the membrane at ambient temperature overnight.After each use wash the TLC applicator syringe as follows:Wash 5 times with NaOH 0.1 M.Leave the syringe filled for 15 min.Wash 20 times with ddH2O.Wash 5 times with HCl 0.1 M.Leave the syringe filled for 15 min.Wash 20 times with ddH2O.Assemble the LFB on a plastic adhesive backing (laminated card) as follows (Figure 1):First place the diagnostic membrane on the center of the laminated card.Then place the conjugate pad below the membrane, overlapping by 2 mm.Place the immersion pad below the conjugate pad, overlapping by 2 mm.Place the absorbent pad above the membrane, overlapping by 2 mm.Cut the LFBs to a 4mm with by the paper cutter.Store the LFBs at ambient temperature in the dark.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200730/20200730011552_2277.jpgFigure 1. Schematic depiction of the lateral flow biosensor preparation procedure and side-view of the LFB assembling parts on a plastic backingTailing of SH-dT30 with dTTPDissolve the lyophilized oligonucleotides (SH-dT30) with PCR-grade water in order to have an 100 pmol/µl stock solution of the oligonucleotides.Set up the tailing reaction (20 µl) by mixing 2 µl of the terminal transferase reaction buffer (see A2), in pH 7.9; 2 µl of CoCl2 (0.25 mM); 0.7 µl of dTTP (3.5 mM); 0.5 µl of TdT (10 units) and 7 µl of SH-dT30.Incubate for 1 h at 37 °C.Stop the reaction with incubation at 70 °C for 10 min.Store the SH-poly(dT) tailed oligonucleotides at -20 °C.Gel Permeation Chromatography (GPC) for tailed SH-poly(dT) purificationPreparation of dextran cross-linked G-25.Put 5 g of dextran particles in a glass bottle.Add ddH2O until all particles are covered, even after they are swallowed.Incubate overnight at 4 °C.Pour the pre-treated dextran G-25 in the GPC column.Centrifuge at 750 × g for 6 min.",
    "Put the tailed SH-poly(dT) oligonucleotides in the center of the column by a pipett tip.Centrifuge at 750 × g for 2 min.Collect the flowthrough (~50 µl) in a 1.5 ml tube.Store the purified tailed SH-poly(dT) oligonucleotides at -20 °C.Preparation of oligonucleotide conjugated gold nanoparticlesPut 1 ml of gold nanoparticles (Au NPs: 40 nm, 7.2 × 1010 particles) in siliconized tubes.Add 75 pmol of purified tailed SH-poly(dT) oligonucleotides (10 µl) and 0.8 ml of absolute pyridine.Incubate at 4 °C, for 24 h, in the dark. Subsequently, add 16.7 µl of 900 mM NaCl solution and incubate at 4 °C, for 2 h, in the dark.Repeat step E.4 for 6 times, up to a final concentration of 90 mM (“salt aging” protocol).Incubate at 4 °C, for 24 h, in the dark. Centrifuge at 1,300 × g for 30 min.Discard the supernatant carefully.Resuspend the Au NPs pellet in 100 µl of an aqueous solution containing 30% sucrose, 0.25% Tween-20, 0.25% sodium dodecyl sulfate (SDS), and 45 mM NaCl, by vortexing and brief sonication (5 min).Store the poly(dT) conjugated gold nanoparticles at 4 °C, in the dark.Fish brain dissectionPut the fish onto a dissecting mat and carefully break the skull open with scissors and forceps.Dissect the whole brain and remove it carefully with the forceps.Transfer the samples in sterile polypropylene tubes and store at -80 °C, until use.Note: Naturally infected European sea bass (Dicentrarchus (D.) labrax) with or without VNN clinical signs were collected and euthanized from sea-cage fish farms. Total RNA extractionRemove the excised fish tissue from storage and thaw it in ice.Weigh an empty sterile 1.5 ml tube and add the tissue. Determine its weight and cut 30 mg of tissue with sterile scissor.",
    "If the isolated brain is bigger than 30 mg, the remaining tissue can be stored at -80 °C for future use.Add 6 µl of β-mercaptoethanol (β-ME) to 600 µl of Buffer RLT before use.Note: Dispense β-ME in a fume hood and wear appropriate protective clothing. Place the tissue in a sterile 1.5 ml tube and add ~600 µl Buffer RLT with β-ME.Add one stainless steel bead (5 mm) to the tube and put it in the TissueLyser Adapter.Disrupt the tissue and homogenize the lysate on the TissueLyser LT for 5 min at 50 Hz.Notes: Do not exceed this time as it may result in nucleic acid shearing. The TissueLyser Adapter is used directly after storage at -20 °C and the tissue disruption is performed at RT. Therefore, due to the short disruption time the adapter temperature remains low throughout the procedure. Centrifuge the homogenized sample for 5 min at full speed to ensure that all the tissue debris is on the bottom of the tube.Carefully remove the supernatant by pipetting, and transfer it to a new 1.5 ml tube.Add 1 volume of 70% ethanol (stored at RT) to the cleared lysate, and mix by pipetting. Do not centrifuge.Note: Precipitates may be visible after addition of ethanol. Transfer 700 μl of the sample, including any precipitate that may have formed, to an RNeasy spin column placed in a 2 ml collection tube.Centrifuge for 30 s at 10,000 × g. Discard the flow-through.Repeat Steps G10 and G11 with the remaining sample.Add 700 μl Buffer RW1 to the RNeasy spin column to wash the spin column membrane.Centrifuge for 30 s at 10,000 × g. Discard the flow-through.Add 500 μl Buffer RPE to the RNeasy spin column to wash the spin column membrane.Centrifuge for 2 min at 10,000 × g. Discard the flow-through.",
    "Place the RNeasy spin column in a new 2 ml collection tube.Centrifuge at full speed for 1 min.Place the RNeasy spin column in a new 1.5 ml collection tube and add 30 μl RNase-free water directly to the spin column membrane.Centrifuge for 1 min at 10,000 × g to elute the RNA.Repeat Steps G19 and G20 using another 30 μl RNase-free water.Store the eluted RNA in -20 °C.Spectrophotometric quantification and quality determination of RNA with NanoDropOpen the NanoDrop 1000 software. Select nucleic acid analysis and then RNA in the respectives tabs.Put 1 µl of the eluted RNA sample on the sample loading position.Measure the absorbance.Note: A260/A280 ratios of the purified aliquots above 1.9-2.1, indicate that the isolated total RNA is efficiently purified for further use. Reverse transcription of NNV RNA from fish samplesSet up the reverse transcription reaction (20 µl) by mixing 5 µl of oligonucleotide dT20 (2.5 mM), 1 µl of dNTPs (dNTPs: dATP, dTTP, dCTP, dGTP; 0.5 mM each), 100 ng of purified total RNA and the appropriate volume of RNase-free H2O up to 13 µl.Heat the mixture to 65 °C for 5 min, and quickly chill on ice (0 °C, 1 min).Collect the contents of the tube by centrifugation and add 4 µl of first-strand buffer (1×), 1 µl of dithiothreitol (0.1 M), 1 µl RNase OUT RNase inhibitor (40 U) and 1 µl of Superscript II reverse transcriptase (200 U).Incubate at 50 °C for 60 min.Inactivate at 70 °C for 15 min.Store the produced cDNA at -20 °C.PCR of NNV cDNASet up the PCR mastermix (18 µl) by mixing 4 µl of the DNA polymerase reaction buffer (1×), 1.6 µl of MgCl2 (2 mM), 0.4 µl of dNTPs pool (200 µM each), 1 µl of the upstream and downstream primers (0.5 mM), 0.",
    "1 µl of GoTaq Flexi DNA polymerase (0.5 U) and ddH2O.Add 2 µl of cDNA to the PCR mastermix.Put samples in the thermal cycler, with the following cycling conditions: 95 °C for 5 min, followed by 35 cycles at 95 °C for 30 s, 60 °C for 60 s, and 72 °C for 60 s.Incubate the samples reactions at 72 °C for 7 min and cool down to 4 °C.Store the produced amplification products at -20 °C.Note: Include negative controls (containing PCR-grade water instead of DNA) in each series of PCRs to confirm the absence of contamination.Visualize the PCR products by 2% agarose gel electrophoresis.Quantify the PCR products by ImageJ software based on the φX174 DNA HaeIII digest DNA molecular weight marker.Note: All concentrations are the final concentration in 1× reaction. The procedure should be performed in DNA Workstation equipped with UV-Vis lamp to decontaminate reagents and equipment.Tailing of nodavirus-specific (probe_Ndv) oligonucleotide probes with dATPDissolve the lyophilized probe_Ndv oligonucleotides with the proper amount of PCR-grade water for 100 pmol/µl stock solution preparation.Set up the tailing reaction (20 µl) by mixing 2 µl of the terminal transferase reaction buffer (see Step A2), in pH 7.9; 2 µl of CoCl2 (0.25 mM); 4 µl of dATP (2 mM); 0.5 µl of TdT (10 units) and 4 µl of probe_Ndv (400 pmol).Incubate for 1 h at 37 °C.Stop the reaction with incubation at 70 °C for 10 min.Mix the probe_Ndv with 1.5 µl N-methylmaleimide (40 nmol/µl).Store the probe_Ndv tailed oligonucleotides at -20 °C.Lateral flow biosensor detection assay of NNV amplification productsMix a 5 µl aliquot of PCR products solution with 1 µl of NaCl 0.9 M, 0.5 pmol of dATP-tailed probe_Ndv and ddH2O, to final volume of 10 µl.",
    "Heat the mixture at 95 °C for 3 min and place on ice for 30 s.Incubate the mixture to 37 °C for 10 min to allow hybridization to proceed.Apply the hybridization mixture to the conjugation pad next to the poly(dT)-functionalized gold nanoparticles.Dip the immersion pad of the biosensor into 250 µl of the LFB developing solution.Wait for signal formation. The visual detection is completed within 20 min.Scan the LFBs with a desktop scanner and quantify the band densities with ImageJ software."
  ],
  "subjectAreas": [
    "Microbiology",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}