{
  "id": 2491,
  "origin_website": "Cell",
  "title": "Introducing the Stem Cell ASCL2 Reporter STAR into Intestinal Organoids",
  "procedures": [
    "Step-By-Step Method Details\nStep-By-Step Method Details\nIntegration of STAR into the Genome\nThe protocols below describe the integration of STAR via (A) lentiviral transduction, (B) transposase-based integration with electroporation, and (C) transposase-based integration using a transfection reagent.\nProtocol A: Lentiviral Transduction\nTiming: 5 days\nFor complete details on the use and execution of this part of the protocol, please refer to Van Lidth de Jeude et al. for the organoid transduction protocol with lentiviruses (Van Lidth de Jeude et al., 2015[href=https://www.wicell.org#bib12]).\nProtocol A1: Production of Lentiviral Particles\nThis protocol describes the production of lentiviral particles using VSV-G envelopes. All lentiviral STAR plasmids listed in Table 1[href=https://www.wicell.org#tbl1] are suitable for 3rd generation lentivirus making with VSV-G envelopes and the packaging vectors gag, pol, and rev. Transduced stem cells will generate STAR organoids.\nCritical: Protocol steps involving lentiviral particles must be performed in a BSL-2 lab (indicated below). This involves careful attention to BSL-2 regulations on sample handling and disposal of plasticware and media.\nDay 1:\nTiming: 30 min\nSplit HEK293T cells to 25%–30% confluency in T75 flask or 100 mm petri dish and plate in DMEM supplemented with 10% fetal bovine serum (DMEM/FBS).\nNote: Each plate at 80% confluency can be split over 4 plates.\nDay 2:\nTiming: 25 min\nPrepare transfection solution as indicated in the table below. Troubleshoot 2[href=https://www.wicell.org#sec6.5]: No access to indicated lentiviral packaging plasmids or transfection reagent\nMix transfection solution thoroughly, and incubate at 20°C for 15 min.\nCritical: Do not incubate the transfection mixture for more than 30 min.\ntable:files/protocols_protocol_200_4.csv\nCritical: The following step must be performed in a BSL-2 lab.\nDrip 127 μL DNA transfection solution onto HEK293T cells growing in DMEM/FBS and store them in a humidified cell culture incubator at 37°C.\nDay 3:\nTiming: 5 min",
    "Critical: The following step must be performed in a BSL-2 lab.\nCarefully aspirate medium from HEK293T culture plates and add 8 mL DMEM/FBS to each plate.\nNote: This culture media volume allows to pool the virus suspension of up to 4 plates into one bucket for ultracentrifugation on Day 5.\nDay 5:\nTiming: 3.5 h, including 2.5 h centrifugation\nCritical: The following steps must be performed in a BSL-2 lab.\nBefore you begin:\nPre-cool ultracentrifuge to 4°C\nPrepare transduction medium as described in section “Additional Organoid Media Required for Lentiviral Transduction (Protocol A)[href=https://www.wicell.org#sec2.3]”\nOptional: Prepare freezing medium for lentiviruses as described in section “Additional Organoid Media Required for Lentiviral Transduction (Protocol A)[href=https://www.wicell.org#sec2.3]”\nOptional: If dead cells are floating in the culture medium, collect supernatant in 15 mL flask and centrifuge for 5 min at 500 × g. Continue with supernatant.\nCollect the culture medium from the plates and push it through a 0.45 μm filter using a large 60 mL syringe.\nLoad ultracentrifuge buckets with tubes and pipet virus suspension into the tube.\nNote: Culture media of up to 4 plates can be combined into one ultracentrifugation bucket.\nCarefully equal balance opposite buckets (lids included) by topping up with DMEM/FBS. Afterwards, carefully cap buckets with corresponding lids.\nCentrifuge for 2.5 h at 170,000 × g at 4°C.\nIn the meantime, prepare N∗550 μL transduction medium with N being the total number of flasks or plates in which virus has been produced.\nTransfer ultracentrifuge buckets very carefully into a laminar flow hood, remembering the orientation of the tube inside the centrifuge.\nOpen bucket containing ultracentrifuge tube and decant medium carefully in such orientation that the opaque brown pellet is on the upper side of the tube. Take a micropipette and remove leftover medium, while taking care not to agitate the pellet.",
    "Resuspend the virus pellet in N∗500 μL of organoid transduction medium.\nUse 250 μL virus suspension (N/2) to transduce organoids grown in 50–100 μL Matrigel (see protocol A2[href=https://www.wicell.org#sec3.1.3]). Residual virus suspension can be aliquoted in single-use fractions (250 μL each) and frozen at −80°C.\nPause Point: The lentivirus can be frozen at −80°C and transduction can be done on a different day with a minor loss in efficiency.\nNote: In our experience, 2-year old virus stocks are suitable for high efficiency transductions (minor loss compared to fresh virus), when previously stored as single-use aliquots at −80°C.\nProtocol A2: Lentiviral Transduction of Organoids\nTiming: 3.5–6.5 h, including 1 h centrifugation and 1–4 h incubation\nCritical: Protocol steps involving lentiviral particles must be performed in a BSL-2 lab (indicated below). This involves careful attention to BSL-2 regulations on sample handling and disposal of plasticware and media.\nBefore you begin:\nPre-heat water bath to 37°C\nPre-cool centrifuge to 4°C\nHarvest organoids with ice-cold medium and transfer into a 15 mL tube.\nNote: For one transduction, 50–100 μL of Matrigel containing approx. 5,000–20,000 organoids which were passaged 7–10 days ago should suffice.\nTop up to 10 mL with ice-cold Advanced DMEM and spin at 4°C, 300 × g for 5 min.\nNote: Ice-cold medium will dissolve the Matrigel.\nDiscard supernatant.\nOptional: If residual Matrigel is visible (not a clean pellet), repeat steps 19 and 20.\nDiscard supernatant and resuspend pellet in 500 μL trypsin. Incubate for about 3 min in a 37°C water bath until organoid have dissociated into single cells or small fragments.\nNote: (Non-cancerous) Organoids might have reduced outgrowth potential when trypsinized to single cells.",
    "Inactivate trypsin by adding 500 μL trypsin inhibitor (1:1 ratio with trypsin), top up to 10 mL with Advanced DMEM, and spin at 4°C, 500 × g for 5 min.\nDiscard the supernatant and resuspend pellet in 20 μL transduction medium.\nCritical: The following steps have to be performed in a BSL-2 lab.\nAdd 250 μL virus suspension to the organoids and spin at RT, 75 × g for 1 h.\nIncubate samples in a 37°C incubator for 1–4 h with a loosened lid.\nNote: Prolonged incubation of up to 4 h may increase the transduction rate significantly.\nIn the meantime, thaw Matrigel on ice and keep on ice after thawing.\nSpin samples at RT, 500 × g for 5 min.\nTake off supernatant and resuspend cell pellet in 100–200 μL Matrigel. Plate in 10 μL droplets onto a pre-warmed 24-well plate with 4–5 droplets per well.\nIncubate plate upside-down in the incubator for 10–20 min until the Matrigel has solidified.\nNote: Turning the plate upside-down prevents organoids from sinking to the bottom of the culture plate and attaching to the plastic.\nAdd 500 μL organoid medium supplemented with 10 μM Y-27632 to each well.\nStart with selection procedure, 3 days after transduction (see section “Selection Procedure for STAR Organoids[href=https://www.wicell.org#sec3.2]”).\nTroubleshoot 1[href=https://www.wicell.org#sec6.1]: STAR integration by lentiviruses\nTroubleshoot 3[href=https://www.wicell.org#sec6.7]: Cell death upon transduction\nProtocol B: Transposon-Based Integration with Electroporation\nTiming: 3 days\nFor complete details on the use and execution of this part of the protocol, please refer to Fujii et al. for the organoid electroporation protocol (Fujii et al., 2015[href=https://www.wicell.org#bib4]).\nPre-heat water bath to 37°C\nPre-cool centrifuge to 4°C\nThaw Matrigel on ice",
    "Prepare electroporation mixture as follows: For each electroporation condition mix 100 μL BTX electroporation solution + 10 μL STAR reporter DNA (stock concentration 1 μg/mL)+ 5 μL miniTol2 transposase(stock concentration 1 μg/mL).\nLabel collection tubes for after electroporation.\nPrepare 100× dispase: Dilute 0.05 g Dispase II in 500 μL Advanced DMEM/F12 and mix well by pipetting and vortexing until completely dissolved.\nPrepare 1× dispase (inside a flow cabinet): Add 100 μL of 100× dispase stock to 9.9 mL Advanced DMEM/F12 and mix by vortexing briefly.\nNote: Dispase stocks (100× and 1×) can be stored at 4°C but dispase is most active during the first days after preparation.\nPrepare transfection medium as described in section “Additional Organoid Media Required for Transposon-Based Integration (Protocols B and C)[href=https://www.wicell.org#sec2.4]”\nProtocol B1: Preparation of Organoids for Transfection\nDay 1:\nTiming: 5 min\nReplace organoid medium with transfection medium while using 500 μL transfection medium for each well of a 24-well plate.\nNote: 200–400 μL Matrigel containing organoids grown for 7–10 days after the last passage should suffice for one electroporation.\nDay 2:\nTiming: 1–1.5 h\nAdd 1.25% v/v DMSO to the transfection medium.\nKeep organoids in the incubator for 2–4 h.\nTake off medium, collect organoid droplets using 1× dispase, and transfer into a 15 mL tube.\nIncubate in 37°C water bath for 3–10 min until Matrigel is properly dissolved.\nAlternatives: to steps 43 and 44: Harvest organoids with ice-cold medium and transfer into 15 mL tube. This approach might require additional washing/centrifugation steps as indicated in step 46.\nTop up to 10 mL with cold Advanced DMEM/F12 and spin at 4°C, 300 × g for 5 min.",
    "If a clean organoid pellet is visible, discard the supernatant. Otherwise, carefully take off the clear supernatant on top of the Matrigel cloud (approx. 8 mL of supernatant). Then, repeat steps 45 and 46.\nResuspend pellet in 1 mL of trypsin. Incubate for about 3 min in a 37°C water bath until organoid have dissociated into small fragments.\nNote: Dissociation to small fragments, rather than to single cells, will increase the survival and outgrowth potential upon electroporation.\nInactivate trypsin by adding 1 mL of trypsin inhibitor (1:1 ratio with trypsin), top up to 10 mL with Advanced DMEM/F12, and spin at 4°C, 500 × g for 5 min.\nOptional: Discard the supernatant, resuspend the pellet in 1 mL Advanced DMEM/F12, and roughly estimate the cell number by counting. 500,000–1 million cells are recommended for one electroporation. Afterwards, pellet cells again by spinning at 4°C, 500 × g for 5 min.\nDiscard the supernatant and put tube on ice.\nProtocol B2: Transfection of Organoids Using Electroporation\nTiming: 45 min\nSet up the electroporator. During the subsequent steps, avoid prolonged incubation of the cells in electroporation buffer.\nResuspend cell pellet in 115 μL electroporation mixture and transfer 100 μL into electroporation cuvette.\nCap the cuvette with its lid and place the electroporation cuvette in the cuvette holder of the electroporator.\nMeasure the impedance and adjust if value outside 30–55.\nNote: Increasing the volume in the cuvette will lower the impedance.\nOptional: If impedance is larger than 30, add residual cell suspension to the cuvette to increase the number of cells which are being electroporated.\nElectroporate cells with the settings indicated in the table below. Troubleshoot 4[href=https://www.wicell.org#sec6.9]: Cell death upon electroporation\nAdd 400 μL of Opti-MEM supplemented with 10 μM Y-27632 to the electroporation cuvette.",
    "Use the plastic pipette provided with the cuvette to transfer the cells from the cuvette into an Eppendorf tube and put on ice.\nRest cells for 10–20 min on ice.\nSpin tubes at 4°C, 500 × g for 5 min.\nTake off supernatant.\nResuspend pellet in approx. 200 μL Matrigel and plate cells at high density in 10 μL droplets onto a pre-warmed 24-well plate with 4–5 droplets per well.\nNote: A significant fraction of cells will not survive this harsh procedure. Hence, cells can be plated more densely than usual for maintenance of the organoid line.\nIncubate the plate upside-down in the incubator for 10 min until the Matrigel has solidified.\nAdd 500 μL transfection medium + 1.25% DMSO per well for at least 30–60 min.\nRefresh each well with 500 μL transfection medium without DMSO.\ntable:files/protocols_protocol_200_5.csv\nDay 3:\nTiming: 5 min\nReplace medium with 500 μL standard culture medium.\nStart with selection procedure, 3–7 days after transfection (see section “Selection Procedure for STAR Organoids[href=https://www.wicell.org#sec3.2]”).\nTroubleshoot 1[href=https://www.wicell.org#sec6.1]: Transposon-based STAR integration via electroporation\nProtocol C: Transposon-Based Integration Using a Transfection Reagent\nThe protocol for organoid transfection with transfection reagents was inspired by a transfection protocol using liposomes of Schwank et al. (Schwank et al., 2013[href=https://www.wicell.org#bib19]), while the key transfection step was adapted by the Snippert lab.\nPre-heat water bath to 37°C\nPre-cool centrifuge to 4°C\nPrepare 100× dispase: Dilute 0.05 g Dispase II in 500 μL Advanced DMEM/F12 and mix well by pipetting and vortexing until completely dissolved.\nPrepare 1× dispase (inside a flow cabinet): Add 100 μL of 100× dispase stock to 9.9 mL Advanced DMEM/F12 and mix by vortexing briefly.\nNote: Dispase stocks (100× and 1×) can be stored at 4°C but dispase is most activeduring the first days after preparation.",
    "Prepare transfection medium as described in section “Materials and Equipment[href=https://www.wicell.org#materials-and-equipment]/Additional Organoid Media Required for Transposon-Based Integration (Protocols B and C) ”\nProtocol C1: Preparation of Organoids for Transfection\nTiming: 3 days\nNote: Protocol is written for the transfection of one well of a 24-well plate containing 50 μL Matrigel. Sufficient organoid amounts for successful transfection are between 4 and 8 wells of a 24-wells (approx. 200–400 μL Matrigel).\nDay 1:\nTiming: 5 min\nReplace organoid medium with 500 μL transfection medium per well.\nDay 2:\nTiming: 1–1.5 h\nTake off medium, collect organoid droplets using 1× dispase, and transfer into a 15 mL tube.\nIncubate in 37°C water bath for 3–10 min until Matrigel is properly dissolved.\nAlternatives To Steps 73 And 74: Harvest organoids with ice-cold medium and transfer into 15 mL tube. This approach might require additional washing/centrifugation steps as indicated in step 76.\nTop up to 10 mL with Advanced DMEM and spin at 4°C, 300 × g for 5 min.\nIf a clean organoid pellet is visible, discard the supernatant. Otherwise, carefully take off the clear supernatant on top of the Matrigel cloud (approx. 8 mL of supernatant). Then, repeat steps 75 and 76.\nDiscard supernatant and resuspend pellet in 250 μL of trypsin. Incubate for about 3 min in a 37°C water bath until organoid have dissociated into single cells or small fragments.\nNote: (Non-cancerous) Organoids might have reduced outgrowth potential when trypsinized to single cells.\nInactivate trypsin by adding 250 μL of trypsin inhibitor (1:1 ratio with trypsin), top up to 10 mL with Advanced DMEM, and spin at 4°C, 500 × g for 5 min.\nTake off supernatant and put cells on ice.\nProtocol C2: Transfection of Organoids with a Transfection Reagent\nTiming: 6–7 h, including 5–6 h incubation",
    "Prepare transfection mixture as follows: For one well mix 50 μL Opti-MEM + 0.5 μL STAR reporter DNA at 1 μg/mL + 0.25 μL miniTol2 transposase at 1 μg/mL + 2.25 μL X-tremeGENE 9. Problem: No access to X-tremeGENE 9\nRecommended: If more wells (N wells) are used for transfection, scale transfection mixture linearly.\nMix transfection mixture well by vortexing, spin the tube briefly to remove drops from the lid or the side of the tube, then incubate for 15 min at RT.\nCritical: Do not incubate the transfection mixture for more than 30 min.\nResuspend cell pellet in 225 μL transfection medium (previously prepared as described at the beginning of this protocol).\nAdd N∗53 μL transfection mixture to the cell suspension with N being the total number of wells the organoids were derived from and mix well by pipetting up and down.\nIncubate for 5–6 h in the incubator with a loosened lid.\nToward the end of the incubation period, thaw Matrigel on ice and keep on ice after thawing.\nSpin tubes at 4°C, 500 × g for 5 min.\nTake off supernatant.\nResuspend pellet in Matrigel and plate cells in 10 μL droplets onto a pre-warmed 24-well plate with 4–5 droplets per well.\nIncubate the plate upside-down in the incubator for 10 min until the Matrigel has solidified.\nAdd 500 μL transfection medium to each well.\nDay3:\nTiming: 5 min\nReplace medium with 500 μL standard culture medium.\nStart with selection procedure, 3 days after transfection (see section “Selection Procedure for STAR Organoids[href=https://www.wicell.org#sec3.2]”).\nTroubleshoot 1[href=https://www.wicell.org#sec6.1]: Transposon-based STAR integration via transfection reagent\nSelection Procedure for STAR Organoids\nTiming: 3 days to 2 weeks",
    "Selecting for STAR organoids can be started as early as 3 days post integration. If viability is low (usually after electroporation), start selecting 7 days post integration to not further disturb the outgrowth process. Representative figures of organoids prior, during, and after selection are depicted in Figure 4[href=https://www.wicell.org#fig4]. (The fraction of surviving organoids is representative for STAR integration by transfection. Lentiviral transduction rates usually are between 20%–80% in our hands.)\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/200-Fig4.jpg\nFigure 4. Organoids during STAR Integration\n(A–C) Electroporated organoid culture prior to selection. (A) Individual cells, one day after electroporation. (B) Small organoid structures at day 3. (C) Representative image of 4–7 day old viable organoids on which selection can be applied.\n(D) Organoid cultures during the selection process. Efficiency of integration may fluctuate per condition (high on the left, low in the middle). Late administration of selection antibiotics (e.g., day 7) results in dead organoid structures (right panel), rather than dead single cells.\n(E) Organoids having survived the selection procedure for high (left) and low (right) STAR integration efficiency. Scale bars, 250 μm.\nTiming: 5 min\nRefresh medium and supplement with the appropriate selection antibiotic (puromycin at 1–4 μg/mL and blasticidin at 2–50 μg/mL).\nOptional: As the sensitivity to the drugs might vary across lines, a dose-response test on non-transduced/transfected organoids might be informative.\nNote: We usually use concentrations which kill off negative clones within 3 and 7 days for puromycin and blasticidin, respectively. In our experience, organoid lines with a WT genome can be selected for using drug concentrations at the lower end of the indicated spectrum, while cancerous organoids might require higher concentrations.\nSelection in Case of a Ubiquitously Expressed Resistance Cassette\nTiming: 1–2 weeks\nKeep organoids on selection medium for at least 1–2 passages to ensure proper selection.",
    "Note: Organoids are most vulnerable at a single cell state which is why passaging organoids to single cells during the selection process is recommendable. Exceptions to this may be organoid lines with a poor single cell outgrowth efficiency.\nOptional: FACS-purify STAR+ cells and grow them into a culture.\nNote: This procedure is suitable in particular if a polyclonal line shall be used for future experiments. (For more detail, see first note below.)\nOptional: Pick individual organoids grown from a single cell state to establish a clonal culture [see section “Establishing a clonal STAR organoid line[href=https://www.wicell.org#sec3.5]”].\nSelection in Case of a STAR-Driven Resistance Cassette\nTiming: 1–2 weeks\nKeep organoids on selection medium for about 3–5 days to enrich for STAR+ cells.\nContinue to culture organoids in the absence of the selection drug.\nRecommended: FACS-purify STAR+ cells and grow them into a line.\nNote: This procedure is suitable to establish a polyclonal line and could be used for future experiments. (For more detail, see first note below.)\nOptional: Pick individual organoids grown from a single cell state to establish a clonal culture [see section “Establishing a clonal STAR organoid line[href=https://www.wicell.org#sec3.5]”].\nNote: We recommend to perform this step after FACS-purifying STAR+ cells (step 98) to ensure that reporter-positive clones are picked.\nNote: FACS purification of STAR+ cells is suitable for all organoid lines in which STAR+ cells constitute the stem cell population and therefore regenerate the organoid culture. It further ensures proper selection for cells having integrated the reporter which is particularly reassuring in cases of transient antibiotics selection. For designs in which a separate promoter drives the expression of a selection cassette, FACS purification of STAR+ cells rules out partial silencing of the reporter at the STAR sites.",
    "Note: When infecting mouse SI organoids, keep organoids on WENR medium during the selection process. Passaging mouse WENR organoids can be performed by mechanical fragmentation using stacked pipet tips (e.g., stack a p200 tip on top of a p1000 tip and vigorously pipet up and down). Subsequently, organoids can be reverted to a crypt-like state in a 2-step process: First, culture organoids for 2–7 days in medium consisting of 50% WENR and 50% ENR. As soon as Paneth cells have reformed (recognizable by their dark and granular appearance inside small budding structures on a bright field table-top microscope), the organoids can be maintained in ENR medium. As not all organoids revert at the same speed, it is advisable to carefully monitor the culture daily and base the timing of media change on the average organoid morphology. Different stages of reverting organoids are depicted in Figure 5[href=https://www.wicell.org#fig5].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/200-Fig5.jpg\nFigure 5. Mouse Small Intestinal Organoids Reverting from a Cyst-like State to a Crypt-Villus Architecture\n(A) Cyst-like organoid structures growing at two different densities in WENR medium. Scale bars, 500 μm. (B-C) Various examples of organoid cultures during the reversion process toward 'budding organoids'.\n(B) Upon downscaling of WNT (50% WENR + 50% ENR medium), organoids start to shed cells. Some organoids may already revert to crypt morphology. Scale bars, 500 μm.\n(C) Re-appearance of Paneth cells (arrows) in small buds indicates that the organoids can be passaged on ENR medium. Right: after first passage most organoids reverted back to ENR state. Scale bars: left/right 250 μm and middle 50 μm.\n(D) Mature organoid with crypt-villus phenotype. Scale bar, 50 μm.\nTroubleshoot 5[href=https://www.wicell.org#sec6.11]: STAR signal in resistant organoids.\nEstablishing a Clonal STAR Organoid Line",
    "The outgrowth of isolated single cells into organoids is a highly inefficient process. Therefore, organoids need to be grown at a low-to-intermediate density prior to picking to ensure outgrowth while maintaining clonality. (A plating density of approximately 2,000–10,000 cells/100 μL Matrigel is recommended.)\nCritical: The organoid density should be monitored carefully to ensure that no organoids are fusing during the outgrowth process. For organoid lines which are very sensitive to density, this process might involve plating cells at a density supporting single cell outgrowth and over the course of the next weeks replating intact organoid structures (without disruption) into larger volumes to ensure sufficient space for clonal organoid growth.\nCritical: The organoid should exceed a size of 300 cells prior to picking, to ensure successful passaging (approx. size depicted in Figure 4[href=https://www.wicell.org#fig4]E, right panel). Growing the organoids as big as possible while ensuring their clonality and suitable culturing conditions will increase the success rate in establishing clonal organoid lines.\nThere are three time points at which a clonal organoid can be picked (ordered according to our preference):\nafter selection on the initial plating\nNote: This option does not require dissociation to single cells. Therefore, it is very suitable for sensitive lines and can also be applied to mouse SI organoids which are growing in their regular crypt-like budding structure (ENR medium).\nafter selection and subsequent FACS purification of single STAR+ cells\nNote: Broadly applicable strategy given that STAR+ cells constitute the stem cell population, i.e., can regenerate the organoid culture.\nafter selection and subsequent thorough trypsinization to single cells.",
    "Note: This option is preferable in organoid systems in which STAR+ cells do not constitute the (sole) stem cell population. For instance, some lung and stomach cancers show upregulation of ASCL2, while it is not expressed during homeostasis (Hu et al., 2016[href=https://www.wicell.org#bib8]; Huang et al., 2018[href=https://www.wicell.org#bib9]; Zuo et al., 2018[href=https://www.wicell.org#bib23]). Thus, the nature of STAR+ cells in respective cancer organoids is not well defined yet.\nNote: Before you start: Label Eppendorf collection tubes and put them on ice\nOptional: Add 10 μL of Advanced DMEM/F12 into each collection tube to more easily release the organoids into medium.\nTiming: 1 h (may be longer if multiple clones are picked)\nSelect a Matrigel droplet with a big STAR fluorescent organoid using a table-top microscope.\nDiscard culture medium of the selected culture well.\nUse 50 μL ice-cold (4°C) Advanced DMEM/F12 to dissolve selected Matrigel droplet by tilting the culture plate and placing a pipette-tip (200 μL) above the droplet.\nTake up the Matrigel droplet and transfer it into a 15 mL falcon tube.\nOptional: Add 200 μL 1× dispase to the tube and incubate at 37°C for 5 min until Matrigel is properly dissolved.\nTop up to 10 mL with ice-cold Advanced DMEM/F12 and carefully pellet organoids by spinning at 300 × g at 4°C for 4 min.\nTake off medium and carefully resuspend organoids in 100 μL Advanced DMEM/F12.\nNote: If there are many organoids, increase the volume of Advanced DMEM/F12 to facilitate the next steps.\nSpot organoid suspension onto the inside of the lid of a 10 cm culture dish, while making droplets of approximately 20 μL volume (Figure 6[href=https://www.wicell.org#fig6]C).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/200-Fig6.jpg\nFigure 6. Selecting and Picking a Clonal STAR Organoid",
    "(A and B) Organoids with low and high STAR expression levels (white) are depicted on the left and right, respectively. (A) Four examples of crypt structures with STAR expression (uniform cell labeling) that demonstrate clear separation between stem cell niche and TA-region and exclusion of Paneth cells. (B) Four examples of clonal organoids with nuclear STAR expression. (∗) auto-fluorescence. Scale bars, 50 μm.\n(C) Example setup for picking of clonal organoids using a benchtop microscope.\nLocate organoids using a table-top or stereomicroscope.\nFor droplets having just one organoid, take up the medium droplet and transfer the organoid into a separate collection tube by carefully pipetting up and down. Verify that the organoid is transferred. If multiple organoids are in the same droplet, carefully take up single organoids using a 20 μL pipet, while checking through the oculars that the other organoids stay put. Transfer organoid into an Eppendorf tube (Figure 6[href=https://www.wicell.org#fig6]C).\nKeep Eppendorf tubes on ice while picking.\nAdd 100 μL fresh Trypsin EDTA and incubate at 37°C for 5 min, while vortexing every minute.\nNote: This step is recommended for most organoid lines as it allows for the highest plating density. Mouse SI organoids, however, and organoids with a low single cell plating efficiency may benefit from mechanical disruption instead.\nAlternatives: (to step 114) Mechanically disrupt organoid by adding 200 μL cold Advanced DMEM and pipetting up and down with a p200 tip several times.\nCheck under the microscope that the organoids has dissociated into small fragments/single cells. Otherwise, prolong the trypsin incubation step.\nAdd 100 μL trypsin inhibitor and top up to 1 mL with Advanced DMEM.\nSpin Eppendorf tube at 4°C, 500 × g for 5 min.\nCarefully take of supernatant, while leaving 5–10 μL supernatant to not agitate the pellet",
    "Troubleshoot 6[href=https://www.wicell.org#sec6.13]: Cell loss when picking clonal organoids\nAdd 30–50 μL Matrigel and mix gently by pipetting up and down.\nPlate Matrigel in 2 droplets onto a pre-warmed 48-well plate with one droplet per well.\nNote: Efficient clonal outgrowth requires at least 5 crypt-like structures (mouse small intestinal organoids in ENR state) or 100 single cells per Matrigel droplet of 10 μL.\nIncubate the plate upside-down in the incubator for 10–25 min until the Matrigel has solidified\nAdd 250 μL organoid medium with 10 μM Y-27632 and 100 μg/mL primocin (since clonal organoids has been exposed to an environment outside the hood).\nNote: In case of a low yield or organoid lines that are particularly sensitive to low density, it may be conceivable to plate STAR+ cells together with reporter-negative cells to support organoid growth. FACS purification can be subsequently used to isolate all STAR+ cells. Troubleshoot 7[href=https://www.wicell.org#sec6.15]: Cell death after passaging clonal organoids"
  ],
  "subjectAreas": [
    "Molecular/Chemical Probes",
    "Stem Cells",
    "Cancer",
    "Cell Culture",
    "Cell Biology",
    "Organoids"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}