{
  "id": 17221,
  "origin_website": "Jove",
  "title": "Transplantation of Neonatal Mouse Cardiac Macrophages into Adult Mice",
  "procedures": [
    "All experiments were conducted in accordance with the Guide for the Use and Care of Laboratory Animals. All animal protocols were approved by the Institutional Animal Care and Use Committee (IACUC), Fuwai Hospital, Chinese Academy of Medical Sciences. Aseptic technique is required throughout the procedure to prevent contamination of the surgical site.\n1. Apical resection operation in neonatal 1-day-old Cx3cr1 GFP/+ mouse (C57BL/6 background)\nAnesthesia\n\t\nTake all the mouse pups out from the cages and put them in a clean dry box.\nEmbed each mouse in the ice for about 2-3 minutes. Ensure that there is a thin barrier such as latex or gauze between the ice and the mouse pup to prevent frostbite. \nIdentify sufficient anesthesia by observing for the following signs: pale skin, lack of limb movement, and lack of pedal reflex.\nThoracotomy\n\t\nPrecool the bronze operating platform overnight at -20 °C to help maintain anesthesia.\nTake the anesthetized mouse out of the ice box and put it on a bronze operating platform. Anchor the mouse on the operating platform in a supine position using medical adhesive tape.\nPut the operating platform with the mouse on it under a stereoscope.\nDisinfect the mouse chest using a prep pad soaked with betadine and 70% alcohol or as consistent with institutional policy.\nIncise the skin with a 1 cm cut at the fourth intercostal area of the chest cavity and then separate the intercostal muscles using microsurgical scissors until the heart is accessed.\nAlternately press the chest and abdomen with the help of two forceps until the heart is exteriorized out of chest without any mechanical damage.\nSet the ribs below and above the small incision as a natural fixation to immobilize the heart.\nVentricular apex resection",
    "Locate the apex of the left ventricle. Cut a 1 mm diameter of ventricular apex tissue using iridectomy scissors under a stereoscope.\nConfirm that the left ventricular chamber is exposed, and begin oozing.\nGently press the heart back to chest cavity using a cotton swab.\nSuture the muscles, ribs, and skin using 8-0 Prolene sutures.\nClean the mouse thoroughly after the operation.\nPost-operation care\n\t\nTransfer the mouse from the operating platform to a 37 °C heating blanket to warm up the body immediately after the operation.\nConfirm anabiosis of the mouse by observing for the following signs: spontaneous respiration restoration, skin color change from pale to pink, and movement of limbs.\nTake the operated mouse back to its mother once it has recovered.\nMingle the operated mouse with its mother's nesting materials if necessary.\n\t\t​NOTE: It is important to remove all the 1-day-old pups from the mother at once and then return them all at once after all the pups are recovered.\n2. Preparation of the neonatal cardiac macrophage suspension\nNOTE: All these experimental procedures should be carried out in a dark place and under sterile conditions.\nHarvest the heart of a neonatal Cx3cr1GFP/+ mouse 1-day after apical resection\n\t\nEuthanize the Cx3cr1GFP/+ mouse one day after the apical resection. Use an excess of carbon dioxide and decapitate the mouse sequentially to apply euthanasia.\nTake the heart out of the chest and immerse it in a 10 cm dish with PBS.\nCut the vessels and remaining connective tissue away from the ventricles. Cut the auricular appendix and outflow tract away from the heart.\nAfter the heart stops beating, cut the heart into 1-2 mm3 pieces in PBS buffer using microsurgical scissors (Figure 2A).\nNeonatal mouse heart dissociation",
    "Transfer the harvested heart tissue to a tube containing 2.5 mL of preheated enzyme mix (Table of Materials), and tightly close the tube.\nInvert the tube and place it with the cap down (Figure 2B).\nRun the neonatal heart dissociation program (Table of Materials).\nDetach the tube from the dissociator after the program is completed.\nAdd 7.5 mL of 1x DMEM with 10% FBS to the tube.\nFilter and transfer the suspension to a 15 mL centrifuge tube (Figure 2C). Centrifuge the cell suspension at 300 x g for 5 minutes.\nResuspend the cell pellet in 1 mL of blood cell lysis solution and incubate for 2 minutes at room temperature.\nAdd 5-10 mL of PBS buffer to the suspension and centrifuge at 300 x g for 5 minutes.\nResuspend the cell pellet in 1 mL of DMEM with 10% FBS.\nNeonatal cardiac macrophage isolation\n\t\nSort GFP+ neonatal cardiac macrophages by FACS. Receive the sorted macrophages in a sterile tube containing 500 µL of DMEM with 10% FBS.\nCount the GFP+ macrophages (Figure 2D). Resuspend the macrophage in DMEM with 10% FBS at the concentration of 1 x 106 macrophages per 200 µL of DMEM for later injection.\n\t\tNOTE: The number of GFP+ macrophages is small in one neonate (approximate 1 x 105); therefore, at least 10 neonates should be used to obtain enough macrophages for each adult mouse injection.\n3. Neonatal cardiac macrophage transplantation\nPerform a myocardial infarction operation on an adult (6-8-week-old) male C57BL/6 mouse by ligation of the left anterior coronary artery8.\nPut the operated mouse on a 37 °C heated blanket until it recovers.\nIntravenously inject 200 µL of DMEM with 1 x 106 GFP+ neonatal cardiac macrophages into the infarcted adult mouse after the operation (approximate 6 hours later) via the tail vein.",
    "Send the mouse back to a clean cage.\n4. Result evaluation\nInjection efficiency validation\n\t\nAnesthetize the operated mouse and harvest the heart 7 days after the myocardial infarction operation.\nImmerse the heart in the pre-cooled PBS buffer.\nFix the heart tissue with 4% polyformaldehyde for 72 hours at room temperature with shaking.\nDehydrate the heart tissue in dimethylbenzene and ethanol.\nEmbed the heart tissue in paraffin and slice it into sections with a thickness of 5 µm.\nPerform the standard immunofluorescence staining protocol1. Use α-actinin to mark cardiomyocytes.\nDetect the GFP+ macrophages in the heart receiving transplantation.\nPerform the standard immunofluorescence staining protocol1. Use α-actinin and pH3 to mark cardiomyocytes and cell proliferation, respectively (Figure 3A).\nCardiac repair evaluation after the transplantation\n\t\nUse echocardiography on the operated mouse one month after the operation1.\nAnalyze the cardiac function by comparing the left ventricular ejection fraction and fractional shortening in different groups (Figure 3B).\nAnesthetize the operated mouse and harvest the heart.\nRepeat steps 4.1.2-4.1.5.\nPerform a Masson's staining protocol.\nAnalyze the infarcted area after macrophage injection (Figure 3C)."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}