{
  "id": 10601,
  "origin_website": "Jove",
  "title": "Preparation, Purification, and Use of Fatty Acid-containing Liposomes",
  "procedures": [
    "1. Vesicle preparation\nPreparation of thin films\nUse gas tight syringes to transfer certain amount of lipids as described in Table 1.1 to chloroform in a glass vial.\nEvaporate the resulting solution under a stream of nitrogen or argon in the fume hood.\nSubject the resulting thin film to house vacuum for at least 2 h to remove any chloroform residue. The lipid can be left under vacuum overnight at this point.\nRehydration of vesicles\nPrepare 10 mL of 5 mM calcein 250 mM tris-HCl pH 8.0 hydration buffer by dissolving 31 mg of calcein powder in 2.5 mL of 1 M tris-HCl pH 8.0 buffer and adding another 7.5 mL of deionized (DI) water.\nPipette 250 µL of above hydration buffer into an empty tube and add 1.875 µL of 10 M NaOH for a final 75 mM base (½ equivalent of total fatty acids). Transfer the solution to the thin film of dry lipid to form vesicles with a total lipid concentration of 0.15 M .\nUse high-speed (>3000 rpm) vortexer to vortex the resulting mixture for 4-5 s.\nLeave the lipid-buffer mixture on a low speed (ca. 30 rpm) rotating shaker to rehydrate, at least overnight.\nSizing of vesicles (optional)\nUsing tweezers, apply one filter support to each inner surface of the syringe ports of the extruder.\nWet each filter support with 250 mM tris-HCl, pH 8.\nUsing tweezers, apply one track-etched 100 nm polycarbonate membrane to one of the extruder O-rings and filter supports. Taking care to not tear or puncture the membrane, gently push the membrane into the O-ring so as to make good contact between the two surfaces.\nAssemble the extruder, taking care not to displace the membrane and filter supports.",
    "Fill an extruder syringe with ca. 0.5 mL of 250 mM tris-HCl, pH 8. Insert this syringe into one side of the extruder.\nInsert an empty syringe into the other side of the extruder.\nBy hand, push the plunger of the syringe containing buffer slowly (≤ 50 µL/s), and verify that resistance is felt, indicating the track-etched membrane is in place and intact. It is helpful to practice this step without a membrane in place in order to gauge the expected level of resistance.\nRemove and empty the two syringes. It is not necessary to clean the two syringes at this stage since they contain buffer of identical composition to the liposome preparation.\nLoad the liposome preparation into one of the two syringes.\nReassemble the extruder with syringe containing vesicle sample on the left side and empty syringe on the right side.\nBy hand, push the plunger of the syringe containing vesicle sample very slowly (10-25 µL/s).\nCarefully observe the syringe on the right side of the extruder; clear buffer will initially enter the right side of the extruder (ca. 50 µL, this is due to the inner dead volume of the extruder), followed by a small plume of extruded liposomes. Immediately stop pushing at this point, remove the syringe on the right side of the extruder, and discard this solution.\nReplace the syringe on the right side of the extruder and extrude until the left syringe is empty.\nReverse the orientation of the extruder and repeat step 13. Continue for the desired number of cycles (typically 7, 9, or 11); an odd number is always used to ensure un-extruded liposomes are not collected from the syringe initially containing the pre-downsizing liposome preparation.",
    "Gently dispense the contents of the right syringe into an Eppendorf tube and place the tube on a low speed (ca. 30 rpm) rotating shaker for around 0.5 h.\nProceed with vesicle purification, as described in Section 2. Extruded vesicles should be used within 24 h or re-extruded before next time use.\n2. Vesicle purification\nPreparation of vesicle purification mobile phase\nPrepare 5 mL of 250 mM tris-HCl pH 8 hydration buffer by adding 1.25 mL of 1 M tris-HCl pH 8 buffer, 3.75 mL of DI water to a 15 mL Falcon tube. Then add 37.5 µL of 10 M NaOH (½ equivalent of base relative to unesterified fatty acid) to the hydration buffer. Pipette 235 µL of pure oleic acid directly into the Falcon tube resulting a vesicle solution with 0.15 M total lipids.\nUse high-speed (>3000 rpm) vortexer to vortex the mixture for 4-5 s, then tumble on a low speed rotating shaker for at least 2 h. The lipid preparation can be left overnight on the rotating shaker at this point. Filter the mobile phase through 0.22 μm syringe filter unit before use to remove any potential aggregates.\nPurification of vesicles on Sepharose\nRemove ca. 5 mL of ethanolic Sepharose 4B slurry from the bottle using a pipette. Apply this to a disposable 10 mL chromatography column.\nAllow the slurry to settle and ethanol flow-through until ethanol approaches top of the resin bed.\nApply 5 mL of deionized water to the top of the resin and let flow-through to wash away ethanol residue.\nApply 250 mM tris-HCl, pH 8 in 1-2 mL portions to the top of the resin, applying a new portion each time the liquid level approaches the top of the resin bed. Repeat for 3-5 times.",
    "Clamp the column on the retort stand, then connect the tip of column with stopcock connector and tubing to the fraction collector. Add another portion of buffer to flush the tubing, close the stopcock when the liquid level in column approaches the top of resin.\nApply the extruded vesicles from Section 1 to the top of the resin using a 200 µL pipettor, taking care to apply the vesicle preparation as evenly as possible to the resin without touching the resin bed or column wall.\nOpen the stopcock to begin the flow and start collecting fractions into a 96-well plate. Apply vesicle purification mobile phase to the top of the resin bed in 0.5-1 mL portions as the buffer depletes, taking care not to allow the resin bed to dry out. Collect in five-drop fractions, collecting at least 36 wells (three rows of a 96-well plate).\nFluorescence characterization of purification fractions\nTake the 96-well plate from the previous section and read it on a plate reader (λex=485 nm, λem=515 nm).\nPlot the resulting fluorescence data as fluorescence vs. fraction number. Vesicles elute first, followed by the unencapsulated fraction (Figure 1).\nRepurification of vesicles to monitor vesicle leakage\nRepeat the purification and characterization steps in Sections 2.2 and 2.3. Vesicles that have retained their contents will exhibit no peak of unencapsulated solute (or a very small one of ca. 5-10% of the intensity of the vesicle peak).\n3. Use of Vesicles in the Presence of Magnesium\nUse of unliganded magnesium\nPrepare and purify vesicles as described in sections 1, 2.1 and 2.2.",
    "Prepare 1 mL of 50 mM MgCl2 solution in 250 mM tris-HCl pH 8.0 buffer by adding 250 µL of 1 M tris-HCl pH 8.0 buffer and 50 µL of 1 M MgCl2 to 700 µL of DI water. Vortex to mix well.\nTo give the desired magnesium concentration of 5 mM, mix 0.9 mL of purified vesicles and 100 µL of magnesium solution and stir rapidly to minimize vesicle disruption by transient exposure of vesicles to high local concentration of magnesium.\n\t\tNOTE: Rapid mixing of magnesium solution is critical to vesicle stability. If magnesium and vesicles are not quickly mixed by immediate vortexing, some vesicles will be exposed to higher concentrations of magnesium, resulting in inconsistent results from sample to sample.\nLeave the vesicle sample on a tumbler for at least 30 min before repurification as described in 2.4 to check for contents leakage. Add the same concentration of magnesium as in vesicle sample to the repurification mobile phase.\nUse of liganded magnesium\nPrepare and purify vesicles as described in sections 1, 2.1 and 2.2.\n\t\tNOTE: Use ½ equivalent KOH instead of NaOH to deprotonate fatty acids; it has been found that this produces more stable liposomes in chelated MgCl2 systems.\nPrepare 2M potassium citrate solution and adjust pH to 8.0 with KOH.\nPremix MgCl2 and potassium citrate at the specified ratio (ca. 1:4 for stable oleic acid vesicles) in 250 mM tris-HCl pH 8.0 buffer.\nAdd premixed magnesium citrate solution to the vesicle sample, briefly vortex.\n\t\tNOTE: Always premix magnesium and ligand solution. Never expose vesicles to unchelated magnesium solution alone.\nLeave the vesicle sample on a tumbler for at least 30 min before repurification as described in 2.4. Add the same concentration of magnesium and citrate as in the vesicle sample to the repurification mobile phase.",
    "4. Non-enzymatic RNA Copying in Vesicles\nPreparation of monodisperse RNA encapsulated vesicles\nPrepare a dry oleic acid film as described in section 1.1.\nPrepare vesicle rehydration buffer with 50 µM fluorescent labeled RNA primer, 150 µM RNA template and 250 mM tris-HCl pH 8.0 containing ½ equivalent KOH relative to oleic acid.\nAdd 250 µL of rehydration buffer to the lipid film and follow step 1.2.2 and 1.2.3 to make vesicles with total 0.15 M lipid concentration.\nIn order to make small unilamellar monodisperse vesicles, follow section 1.3 for vesicle extrusion.\nMagnesium-citrate addition and vesicle purification\nPremix magnesium and citrate stocks, and then mix this with the vesicle sample to a final lipid concentration of 0.1 M.\nPurify vesicles on Sepharose 4B size exclusion column, with 250 mM tris-HCl pH 8.0, 0.1 M lipids and given magnesium and citrate as mobile phase.\nCollect vesicle fractions by following section 2.3.\nPrimer extension reaction\nPrepare 200 mM 2-MeImpG (guanosine 5'-monophosphate 2-methylimidazolide) stock solution with 250 mM tris-HCl pH 8.0. (NOTE: Follow previous published protocol10 for 2-MeImpG synthesis.)\nTo initiate primer extension reaction, transfer 150 µL of 2-MeImpG stock solution to 450 µL vesicle sample to reach a final concentration of 75 mM lipid and 50 mM activated monomer. Start the timer and keep the reaction sample tumbling all the time.\n(Optional) For continuous fresh monomer feeding, transfer 300 µL of reaction solution to one chamber of a lab constructed small-volume liposome dialyzer11 and put 300 µL feeding solution in the other chamber. The feeding solution should contain all the ingredients at the same concentration as in the reaction solution, except for replacing RNA containing vesicles with empty vesicles. Each round of dialysis takes 1-24 h, depending on the analyte and membrane used.",
    "For kinetic studies, take a 100 µL aliquot at each time point, and repurify the aliquot through a Sepharose 4B size exclusion column with 250 mM tris-HCl pH 8.0 as the mobile phase.\nCollect the vesicle fractions in a 1.5 mL eppendorf tube.\nPipette Triton to the vesicle fractions to a final around 0.1% v/v.\nAdd 0.5 mL of cold ethanol to the tube and incubate at -20 °C for at least 2 h.\nCentrifuge all the samples at 16.1×1000 rcf (16.1 × g) for 10 min and gently pipette out the liquids. Wash the RNA pellets with 70% cold ethanol and centrifuge again for 5 min. Discard the liquid and put the tube with RNA pellets on an 80 °C heat block for 2 min to evaporate residual ethanol. Dissolve the pellets in 50 µL of 8 M Urea with 1xTBE loading buffer.\nPAGE analysis\nPrepare 20% PAGE gel by mixing 200 mL of UreaGel system concentrate, 25 mL of UreaGel system diluent, 25 mL of 10xTBE buffer, 80 µL of TEMED and 250 mg of ammonium persulfate. Quickly pour the gel mixture between clamped gel plates (35 cm × 45 cm) and insert the comb. Wait for at least 30 min till complete polymerization.\nAssemble the gel plate onto the gel stand and fill the gel boxes with 1xTBE gel running buffer. Take off the comb and flush the wells with syringe. Pre-run the gel with 60 W for 30 min.\nHeat the samples on 80 °C heat block for 2 min and load 5 µL of each sample per well.\nTurn on gel power box and set gel running with constant watts at 60 W for 2.5 h.",
    "Disassemble the gel plate from the gel stand, wipe clean the glass and put the whole plate in gel scanner to start the gel scanning.\nQuantify the gel with ImageQuant TL 1D analysis. Plot the natural logarithm of the ratio of the amount of primer remaining at a given time point to the initial amount of primer vs. time, fit to a line, and calculate the pseudo-first order reaction rate (Figure 2).\n5. Hammerhead RNA Self Cleavage in Vesicles\nPreparation and purification of ribozyme encapsulated in vesicles\n\t\nPrepare a lipid thin film (OA: GMO=9:1) as in section 1.1 with components as in Table 1.2. NOTE: warm GMO to at least 60 °C for complete melting before using.\nPrepare vesicle rehydration buffer with 5 µM of each hammerhead ribozyme strand and 250 mM tris-HCl pH 8.0.\nAdd 250 µL of rehydration buffer to the lipid film and follow steps 1.2.2 and 1.2.3 to make vesicles with 0.15 M total lipid concentration.\nIn order to make small unilamellar monodisperse vesicles, follow section 1.3 for vesicle extrusion.\nPurify vesicles on a Sepharose 4B size exclusion column, with 250 mM tris-HCl pH 8.0, 0.15 M mixed lipids as mobile phase.\nHammerhead ribozyme self-cleavage reaction\nPrepare magnesium solution and mix with purified vesicles as described in section 3.1 to initiate the self-cleavage reaction.\nFor kinetic studies, take 100 µL of the mixture at each time point and directly repurify this aliquot through a Sepharose 4B size exclusion column with 250 mM tris-HCl pH 8.0 as mobile phase. Collect the vesicle fraction.\nPAGE Analysis\nFollow steps 4.3.6 to 4.3.8 to prepare RNA loading sample.\nPlace commercially casted 15% TBE-Urea gel into gel box and fill the gel box with 1xTBE gel running buffer.",
    "Heat the samples on 80 °C heat block for 1 min and load 5 µL of each sample per well.\nRun the gel with constant 200 V for around 1 h.\nScan the gel.\nQuantify the gel with an analysis software, like ImageQuant TL 1D, to measure the extent of cleavage by comparing the intensity of remaining substrate RNA band and cleaved RNA fragment band (Figure 3).\n6. Giant Fatty Acid Vesicles for Microscopy\nPreparation of giant fatty acid vesicles\nFollow section 1.1 and Table 1.3 to prepare an oleic acid thin film with 0.2 mol% of fluorescently labeled lipid for better membrane observation.\nRehydrate lipid film with 500 µL 250 mM tris-HCl pH 8.0 to make the vesicle sample 10 mM lipids in total. The buffer may contain fluorescent dyes or RNA molecules if desired. Leave vesicle sample tumbling overnight.\nPrepare 150 mL of pure fatty acid dialysis buffer with 10 mM total lipids by mixing 470 µL of oleic acid and 150 mL of 250 mM tris-HCl pH 8.0 containing ½ equivalent NaOH.\nExtrude the vesicle sample through a 10 µm polycarbonate membrane to remove large aggregates.\nTransfer the vesicle sample into 1 µm large-pore dialysis cassette, as previously described.12\nPlace the dialysis cassette into a 100-mL beaker containing 30 mL dialysis buffer. Agitate the beaker gently on a table-top shaker at 80-100 rpm.\nChange the dialysis buffer every 30 min for 5 times to remove free dyes or RNA and small vesicles.\nCarefully remove the vesicle sample from the dialysis cassette with a syringe and transfer to an Eppendorf tube.\nMicroscopy Observation\nPipette 10 µL of vesicles onto a clean standard microscope slide and place a glass cover slip over the sample. Seal cover glass with transparent nail polish.",
    "Observe the vesicles with a 60X oil-dispersion or similar objective by confocal microscopy using the appropriate laser source for the fluorescently-labeled membrane, RNA or encapsulated dye (Figure 4)."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}