{
  "id": 3301,
  "origin_website": "Cell",
  "title": "Protocol for analyzing antibody responses to glycoprotein antigens using electron-microscopy-based polyclonal epitope mapping",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolate IgG from serum/plasma\nTiming: Buffer exchange 30 min\nTiming: Incubation 1–3 days\nTiming: Elution 30 min\nThis section uses affinity resin targeting the Fc region of an antibody to separate polyclonal IgG from serum or plasma.\nBuffer exchange Protein G into 1× PBS pH 7.5.\nAliquot 1 mL of resin (or 2 mL 50% slurry) per 1 mL serum/plasma into 15 mL conical.\nCentrifuge for 3 min at 3,200 × g and decant supernatant.\nFill 15 mL conical with PBS, mix into resin, spin down, and decant.\nRepeat 2 more times.\nAlternatives: Swap Protein G with affinity resin better suited for a specific species (Table 1[href=https://www.wicell.org#tbl1]).\nResuspend resin with PBS back to original slurry volume.\ntable:files/protocols_protocol_2890_4.csv\nIn BSC with proper personal protective equipment (PPE), combine 2 mL slurry and 1 mL serum in 15 mL conical.\nBring volume up to 5 mL with PBS.\nSecure tube lid with parafilm.\nMix serum and resin for 1–3 days at 4°C.\nSeparate resin-bound IgG from serum.\nIn BSC with proper PPE, remove parafilm and centrifuge for 3 min at 3,200 × g.\nDecant serum into 10% bleach.\nFill 15 mL tube with PBS, mix and centrifuge for 3 min at 3,200 × g, decant into 10% bleach.\nRepeat 2 more times.\nFinish by adding 1 mL PBS to resin-bound IgG.\nNote: Sample is now safe to remove from BSC.\nElute IgG from Protein G resin.\nAdd 5 mL (5 CV) 0.1 M Glycine pH 2.5 to resin-bound IgG slurry.\nSecure lid and incubate for 15 min at 20°C, gently mixing on rocker.\nCentrifuge for 3 min at 3,200 × g.\nDecant supernatant (IgG-containing) into 4 mL (4 CV) of 1 M Tris pH 8.",
    "Optional: Can perform another round of elution from resin (step 5) to recover maximum amount of IgG (Figure 1[href=https://www.wicell.org#fig1]).\nFilter elution into new tube using 0.2 μm (or 0.45 μm) pore filter to remove remaining resin beads.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2890-Fig1.jpg\nFigure 1. IgG Elution\n2 mg of purified naïve human IgG was added to Protein G and CaptureSelect. 2 mg of purified NHP was added to protein A and incubated for 72 h at 4C. Total IgG recovery was recorded after 1 or 2 rounds of elution.\nBuffer exchange into PBS with 30 or 100 kDa molecular cut-off 15 mL concentrator.\nSpin down IgG-containing elution buffer.\nFill concentrator with PBS.\nSpin down to 0.5–1 mL total volume.\nTransfer IgG to microcentrifuge tube.\nMeasure IgG concentration (extinction coefficient 13.7 A1% 280 nm) and calculate total IgG.\nNote: IgG yield will vary depending on species and serum processing, among other things. From experience and recent studies, 5–10 mg of IgG is expected from 1 mL human or NHP serum, 3–8 mg from ferrets, and 1–5 mg from mice.\nPause point: IgG can be stored at 4°C for up to 2 weeks, after which it is recommended to store at −80°C indefinitely.\nDigest IgG\nTiming: 6 h\nPapain enzyme is used to digest IgG into Fab and Fc fragments. It targets the hinge region of the antibody where the Fab domains connect to the Fc domain. We are interested in the paratope/epitope interaction of Fab and antigen. Complexes made with IgG will most likely cause aggregation and will be difficult to process. Troubleshooting 1[href=https://www.wicell.org#sec5.1].\nNote: Protocol calculated for 5 mg of IgG. Adjust ratios accordingly.\nActivate papain.\nSee recipe in materials and equipment[href=https://www.wicell.org#materials-and-equipment].\n200 μL of activated papain is required for 5 mg of IgG.",
    "Combine 10× Tris/EDTA, 10× L-cysteine and isolated IgG with PBS for a total of 9.8 mL (total reaction of 10 mL) (Table 2[href=https://www.wicell.org#tbl2]).\ntable:files/protocols_protocol_2890_5.csv\nAdd 200 μL activated papain.\nIncubate digestion reaction for 4–5 h at 37°C.\nQuench reaction by adding 600 μL of 500 mM iodoacetamide (final concentration 30 mM).\nPause point: Digested Fab can be stored at 4°C for up to one month when 0.025% azide is added to prevent contamination growth. Place in −80°C for long-term storage.\nFab/Fc purification\nTiming: 2 h\nAfter antibody digestion, we want to isolate polyclonal Fab from papain, cysteine, and iodoacetamide. Fab and Fc are similar sizes so Fc will be isolated along with Fab in SEC. The Fc region does not interfere with Fab/antigen complexes and will be included in the excess Fab peak in SEC. There is often undigested IgG which will come off before the Fab/Fc peak in SEC. Papain will come off after the Fab/Fc peak in SEC (Figure 2A[href=https://www.wicell.org#fig2]) .\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2890-Fig2.jpg\nFigure 2. IgG Digestion with papain\n(A) SEC trace from S200i of digestion products. After the void peak there is an undigested IgG peak then Fab2′ shoulder with the largest peak being digested Fab followed by papain.\n(B) negative stain EM 2D class averages of peaks collected from SEC.\n(C) Percent papain versus incubation time for digestion of IgG.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2890-Fig3.jpg\nFigure 3. Antigen/Fab complex mixes\n(A) Fab combinations of Env naïve polyclonal Fab with known Env bnAbs representing possible ratios of antigen specific Fabs in polyclonal mixes added to 15 μg of.\n(B) SEC traces of mix combinations purified with Env focusing on complex peak.\n(C) SEC traces of polyclonal complex purification, zoomed in on antigen/Fab peaks.\n(D) Zoomed in on excess Fab peak corresponding to unbound and unspecific antigen Fabs.",
    "Equilibrate SEC column (we use a GE S200i) with PBS.\nOptional: Use TBS buffer instead.\nInject polyclonal Fab/Fc digest sample onto SEC column and collect 500 μL per well using a 96 deep-well block.\nCollect entire column volume.\nCombine wells from largest peak corresponding to 50 kDa proteins (Figure 2A[href=https://www.wicell.org#fig2]).\nPeak often has smaller peaks before and after Fab/Fc peak (Troubleshooting 1[href=https://www.wicell.org#sec5.1]).\nDo not include contaminating peaks or shoulders.\nConcentrate Fab/Fc to about 500 μL.\nPause point: Isolated Fab can be stored at 4°C for up to one month when 0.025% sodium azide is added, after which it is recommended to store at −80°C indefinitely.\nNote: Clean SEC with 1 mL 0.5 M NaOH in between sample purification runs.\nAntigen complex and purification\nTiming: 1.5 days\nAn excess of polyclonal Fab (and Fc) is added to an antigen of interest. Polyclonal Fab with an affinity to the antigen will bind and the excess or non-binding Fab will elute in a separate peak in SEC. Incubating the complex overnight will give sufficient time for Fab to bind. Troubleshooting 3[href=https://www.wicell.org#sec5.5], 4[href=https://www.wicell.org#sec5.7].\nAdd 15 μg of HIV Env (antigen) to 250–500 μg of polyclonal Fab/Fc (Figure 3A[href=https://www.wicell.org#fig3]).\nDepending on concentration of antigen-specific Fabs, more or less of polyclonal Fab/Fc can be combined.\nNote: 10–15 μg of antigen is enough to see an SEC peak for complex isolation at 215 nm absorbance.\nNote: A large molar excess of Fab is used and elutes off separately from complex so the exact ratio is less important.\nIncubate complex overnight at 4°C.\nEquilibrate SEC column (GE S200i) with TBS.\nNote: Complex needs to be purified with TBS because PBS reacts during staining and crashes out.\nInject complex and collect 500 μL per well using a 96 deep-well block.\nCollect entire column volume.",
    "Combine small peak corresponding with estimated antigen/fab mass (Figures 3B[href=https://www.wicell.org#fig3] and 3C).\nConcentrate to about 200–500 μL.\nNote: Concentration for negative stain EM only needs to be about 0.04 mg/mL. Dilute with TBS as needed.\nCombine peak corresponding to excess Fab peak (Figures 3B[href=https://www.wicell.org#fig3] and 3D).\nSave for later if needed and add 0.025% sodium azide to prevent contamination growth.\nMake negative stain EM grids\nTiming: 15 min\nNegative stain grids are made with purified Fab/antigen complexes. Troubleshooting 2[href=https://www.wicell.org#sec5.3].\nNote: Negative stain grids were made in-house. Directions as follows: 400 mesh copper grids were floated on top of a single layer of sterile collodion 2% amyl acetate, let to dry and then sputter coated with carbon using graphite rods and a Cressington carbon evaporator.\nAlthough staining techniques differ between individuals, this is a good place to start.\nGlow discharge grid at 15 mA for 25 s.\nPlace 2, 3 μL drops of UF onto parafilm.\nLoad 3 μL sample at final concentration of 0.04 mg/mL onto grid.\nBlot with filter paper.\nPick up UF droplet by blotting with grid, wait 10 s.\nBlot with filter paper, wait 10 s and pick up second drop of UF.\nWait 50–60 s, blot with filter paper.\nImage grid same day or screen for dilution and stain quality.\nSee Figure 4[href=https://www.wicell.org#fig4]A for ideal conditions.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/2890-Fig4.jpg\nFigure 4. UF thickness and epitope signal\n(A) Cartoon representation with negative stain EM micrographs of mix 2 complexes at thin, medium, and thick UF stain thickness. 2D representative classes of mix 2 complexes.\n(B) 3D maps of data collected with varying UF stain thickness at ¾ volume threshold.",
    "(C) Average signal of epitope detected from data collected with varying UF stain thickness. Each dataset was processed according to steps 30–37. Average signal was calculated in Chimera by placing an 80A spherical mask over each epitope. Volume eraser tool was used to remove all external volume including antigen. The remaining volume mean with standard deviation and RMS were measured for semi-quantitative analysis.\n(D) Average signal of all mixes and epitopes detected of data collected with thin, medium, and thick UF stain.\nScale bar is 200 nM.\nNote: Grids of complexes need to be made on the same day to capture representative response as Fab will disassociate overtime.\nPause point: Stained grids are stable for months stored at 20°C.\nCollect negative stain EM data\nTiming: 2–4 h\nA negative stain grid containing polyclonal complexes from an individual timepoint is loaded onto an electron microscope and micrographs are collected for processing.\nCollect enough micrographs for ∼100,000 initial particles (typically 200–300 micrographs).\nNote: We collect EMPEM data on a variety of microscopes ranging from 120 kV to 200 kV equipped with either a LaB6 or FEG electron emission source. CCD cameras that have been used are the TVIPS, Eagle and CETA. Pixel size ranges from 1.677–2.063 Ångstrom/pixel. Micrographs are .mrc files and are taken in linear mode so motion correction is not necessary. Defocus range from −1.5 to −2.5 μm. Total dose is about 25 e-/Å2.4[href=https://www.wicell.org#bib4],5[href=https://www.wicell.org#bib5] Acquisition can be automated with software such as Leginon/Appion5[href=https://www.wicell.org#bib5],7[href=https://www.wicell.org#bib7] or EPU (ThermoFisher).\nProcessing EMPEM data\nTiming: 1–2 days\nThis section describes the standard processing workflow after micrographs containing polyclonal complexes were imaged on a negative stain electron microscope.\nNote: The following uses RELION 3.0 software.2[href=https://www.wicell.org#bib2]\nImport micrographs. CTF estimation can be skipped for negative-stain data.",
    "Pick particles using Laplacian-of-Gaussian autopicking and adjust minimum diameter setting. Ensure that “particles are white” is selected. If too few particles are picked, try decreasing the minimum diameter. If too much background noise is picked up, try increasing this value.\nExtract (do not invert contrast for negatively-stained particles), and perform 2D classification (50–100 classes) using default RELION parameters.\nSelect 2D classes that resemble antigen with or without Fabs bound. Troubleshooting 5[href=https://www.wicell.org#sec5.9].\nPerform another round of 2D classification (50–100 classes).\nChoose 2D classes that resemble antigen.\nUsing a low pass (20 Å) filtered ligand-free antigen as the initial model, perform 3D classification (25 classes) using default RELION parameters. Troubleshooting 6[href=https://www.wicell.org#sec5.11].\nTotal input particles divided by number of classes should be greater than or equal to 1000.\nSelect 3D classes that resemble antigen with Fab bound.\nRepeat 3D classification jobs as needed to sort maps of fab bound to antigen.\nNumber of classes requested should follow this approximation: total input particles divided by number of classes is greater than or equal to 1000, or maximum of 40 classes.\nPerform 3D refinements of final classes selected from 3D classification.\nUsing UCSF Chimera,3[href=https://www.wicell.org#bib3] isolate Fab volume from antigen with Segger tool.\nSave desired segment and apply Gaussian filter.\nResample filtered volume on the grid of input map.\nSave filtered and resampled volume.\nThe low-pass filtered initial model used in RELION can be displayed along with the segmented Fab volume to generate a composite figure.\nRepeat for all unique epitope Fab densities.\nExpected outcomes",
    "IgG recovery from serum will vary depending on species, concentration, and processing. Recent studies have recovered on average 8 mg of IgG from 1 mL of human serum. For 1 mL of NHP, a total of 10.5 mg was recovered although the average was roughly 6 mg. After digestion, the total recovery of Fab may drop significantly due to digestion efficiency and SEC purification. Expect to lose about half of the protein amount. 500 μg of polyclonal Fab/Fc is generally enough to see a response to the antigen, but this is heavily dependent on the study, timepoint, and relative abundance of target-specific antibodies.\nOvernight incubation of antigen and polyclonal Fab should be more than enough time to see binding. Often, in sequential blood draws of a vaccination regimen, the antigen is seen to increasingly degrade with antibodies binding internal regions at later time points.8[href=https://www.wicell.org#bib8] Different constructs of the antigen may be needed to observe intact complexes. After purification of complex with SEC, negative stain EM grids should be made immediately because antibodies tend to fall off depending on affinity and a shift of equilibrium.\nTogether with serum neutralization and binding assays, e.g., enzyme linked immunosorbent assay (ELISA), this data will provide a detailed portrait of the immune response to an antigen of interest. EMPEM helps visualize antibody-mediated immune responses and allows for correlation of epitope specificities with pathogen neutralization as well as determination of antigen stability upon antigen binding. This technology is rapidly becoming an important tool in evaluating antibody responses to candidate vaccines."
  ],
  "subjectAreas": [
    "Microscopy",
    "Immunology",
    "Structural Biology",
    "Antibody"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}