{
  "id": 18385,
  "origin_website": "Jove",
  "title": "Establishment of a Segmental Femoral Critical-size Defect Model in Mice Stabilized by Plate Osteosynthesis",
  "procedures": [
    "Ethics Statement: The mice used in the present study were treated in accordance with the guidelines published by the European Committee for \"Care and Use of Laboratory Animals\" (Directive 2010/63/EU and the European Convention ETS 123). The experimental protocol was approved by the Ethics Committee of the Faculty of Medicine Lariboisière Saint-Louis (CEEA LV/2010-01-04).\n1. Animals\nUse athymic mice (10 weeks old). Use a minimal number of 6 mice with defect left empty as negative control group.\n2. Scaffolds Preparation\nSyngenic Graft Preparation\nUse bone isograft to fill the defect to provide control group with a minimum number of 6 animals.\nObtain bone isografts by harvesting excised femoral bone from mouse belonging to either \"defects left empty or \"defects filled with coral scaffold\" groups (this avoids the use of extra animal to collect bone isograft)11.\nFlush the resected bone with Phosphate Buffered Saline (PBS) and keep it sterile using moist gauze compress.\nCoral Scaffold Preparation\nUse scaffold that are made of natural coral: Acropora sp. coral exoskeleton cubes, 3 x 3 x 3 mm as potential bone substitute with a minimum of 6 animals.\nCarve by hand each coral cube to the shape of cylinder (3.5 height; 2 mm diameter).\nSterilize each scaffold by autoclaving (121 °C for 20 min), wash it with sterile PBS, and immersed it in complete culture medium (α-MEM) for 24 hr before implantation in mice.\n3. Anesthetic Procedures and Analgesia\nProvide preventive analgesia, 15 min prior to anesthesia, by subcutaneous injection of buprenorphine (0.1 mg/kg animal body weight).\nApply ointment in the animal eyes to prevent dryness every 30 min while the animals are under anesthesia.\nPlace the mice on a warming pad to prevent hypothermia.\nAnesthesia and Analgesia during the Surgical Procedure\nInject intraperitoneally a solution containing xylazine (8 mg/kg) and ketamine (100 mg/kg).",
    "Deliver oxygen via flow-by (50 ml/min).\nConfirm adequate depth of anesthesia by the presence of good muscle relaxation and lack of animal response to a noxious stimulus (e.g., firm toe pinch).\nInject subcutaneously a single dose of enrofloxacin (0.05 mg/kg) as microbial prophylaxis.\nPost-operative Analgesia\nProvide postoperative analgesia by subcutaneous injection of buprenorphine (0.1 mg/kg) every 12 hr for 3 consecutive days.\nAnesthesia during Diagnostic Imaging Procedures\nPlace the mice in an anesthetizing-box, and then induce and maintain anesthesia using approximately 4% and 2% isoflurane in oxygen, respectively.\nConfirm adequate depth of anesthesia by good animal muscle relaxation and the lack of movement.\nRecovery Conditions\nKeep the mice on warming pad until full recovery\nDo not leave an animal unattended until it has regained sufficient consciousness to maintain sternal recumbency after surgery.\nDo not return an animal that has undergone surgery to the company of other animals until fully recovered.\nPost-operative Conditions\nHost the mice separately during the first 3 days Host the mice by 4 in cages after day 3.\nProvide water and adapted food ad libitum. Allow the mice to weight-bear, without any activity restriction throughout the post-operative period.\n4. Surgical procedure: Femoral Segmental Defect Model11,12\nAfter anesthesia, place each mouse in ventral recumbency with the left hind limb in extension.\nScrub the limb for aseptic surgery using 10% povidone iodine for 5 min and then place a sterile drape under the limb to create a sterile surface (a sterile transparent drape is used in order to be able to monitor respiratory movement during the procedure). Care is taken to maintain sterility of the surgical field during the procedure.\nMake a 15 - 17-mm longitudinal skin incision over the anterolateral aspect of the femur, extending from the hip joint to the stifle joint.",
    "Incise the fascia lata, split the vastus lateralis muscle and the biceps femoris muscle to expose the full length of the femoral diaphysis. Caution should be taken to preserve the sciatic nerve caudally and the articular capsule distally (Figure 1).\nTo enhance femoral diaphysis exposure, transect the gluteal muscle and biceps femoris from the 3rd trochanter.\nPerform a circular dissection of the femur at the middle of the diaphysis.\nApply a 6-hole titanium micro-locking plate (10 mm long; 1.5 mm wide, weight: 30 mg) on the anterior femoral side.\n\tNOTE: The holes of the plate, which are conically recessed with a cylindrical portion, accommodate titanium self-tapping locking screws (2 mm long, 0.47 mm outer diameter, weight: 5 mg, with undersurface of the head screw threaded to enable locking within the plate hole) that are connected to a stem, which twists off when locked.\nDrill the most proximal hole of the plate using a 0.3 mm drill bit and either dedicated engine power or non-dedicated engine power operated at 2,500 rpm at approximately 500 mW12).\nInsert the first screw using a dedicated screwdriver and then lock it (Figure 2).\n\tNOTE: Since alignment of the plate is determined by application of this first screw, it is important to position the plate parallel to the femur when inserting the screw.\nDrill the most distal hole of the plate in a similar fashion, insert and lock the screw (Figure 3).\nInsert, but do no lock, the two other outer screws.\nPlace the wire of the 0.22 mm Gigli saw closely around the bone in a medio-lateral orientation and then insert it in the slots of the jig (Figure 4).\nInsert the dedicated jig on the stem of the two last screws and apply it above the plate (Figure 5).",
    "Perform a 3.5-mm long mid-diaphyseal femoral ostectomy using the Gigli saw under irrigation (using sterile isotonic saline) to prevent thermal necrosis. Have the surgeon's assistant take the jig. Have the surgeon apply a constant steady tension. Be careful not to tangle the saw wire and to use the middle two-thirds of the wire. Avoid excess movement in order to obtain a straight bone cut (Figure 6).\nAfter the ostectomy, remove the Gigli saw. To avoid damage of the soft tissue, cut the saw wire close to the bone on one side.\nRemove the jig and lock the two last screws (Figure 7).\nEither leave the segmental defect empty or surgically fill it by putting materials to be tested inside the defect.\nCopiously rinse the surgical field with sterile isotonic saline.\nPlace the vastus lateralis muscle loosely over the plate. Close the fascia and subcutaneous planes using a simple continuous suture pattern and 5.0 glycomer 631 suture; close the skin with a simple interrupted suture pattern using 4.0 glycomer 631 suture. Alternatively, it is also possible to close the skin using skin glue.\n5. In Vivo Assessments of Bone Regeneration\nWith the mice under anesthesia, perform radiographic assessments in a longitudinal manner using both conventional X-rays (26 kV, 10 sec; 2X magnification; 20 lines/mm spatial resolution) and high-resolution micro-computed tomography (μCT).\nFor μCT analysis, acquire images at a resolution of 36 μm (50 kV and 478 mA, at 40 msec exposure time, using a 0.5 mm aluminum filter, rotation step of 0.7º, and tomographic rotation of 180º). Analyze the images using the resident software.\n6. Ex Vivo Assessments of Bone Regeneration\nTen weeks after surgery, induce anesthesia using isoflurane in oxygen, and then sacrifice the mice by intraperitoneal injection of an overdose of barbiturate (1 ml of pentobarbital).",
    "Excise the femoral bones, remove overlaying muscle tissue, and fix the bone specimens in 4% paraformaldehyde (pH 7.4) for four days.\nRemove the plate and screws from each excised bone specimen after paraformaldehyde fixation.\nEx Vivo μCT Analysis\nPlace each excised and fixed bone in polyethylene tubes filled with 75% alcohol and analyze it using ex vivo μCT.\nAcquire images at 80 kV and 100 μA (exposure time of 1,000 msec, aluminum 0.5 filter, and 4 μm camera pixel size (2,400 x 4,000 with a voxel size of 7 μm), average four frames for each rotation increment of 0.9º.\nReconstruct 3-dimensional images (average voxel size of 13 μm) using a Hamming-filtered back-projection with the resident software.\nFor quantitative analysis of bone formation, use resident software to obtain the volume of mineralized tissue (lower grey threshold of 45 grayscale indices and upper grey threshold of 240 grayscale indices) in a determined and consistent region of interest corresponding to the defect.\nPerform analyses in the same manner for each mouse with the same region of interest.\nUse the one-way analysis test (confidence interval - at 95% and the significant level at p < 0.05) to compare the bone union rate and the volume of mineralized tissue in the region of interest between groups.\nHistological Analysis\nEmbed each excised and fixed femoral bone in methyl methacrylate resin and process it for undecalcified histology.\nCut each bone specimen lengthwise into thick section (200 μm) using a circular water-cooled diamond saw.\nGrind each bone specimen section down to a thickness of 100 μm, polish it, and stain it using Stevenel blue and van Gieson picrofuchsin stains.\n\t\tNOTE: After staining, cells appear in blue, bone in pink, and coral in brown under light microscopy."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}