{
  "id": 19801,
  "origin_website": "Wiley",
  "title": "Quantifying the Probing and Selection of Microenvironmental Pores by Motile Immune Cells",
  "procedures": [
    "This protocol uses PDMS-based micro-channels and micro-pillars to mimic the complex 3D microenvironment of motile cells in vitro, while giving the user the advantage of precisely controlling the experimental parameters like pore sizes, chemokine gradients, the number of possible cellular paths, and the number of path decisions. Specifically, we describe PDMS-based micro-channels and micro-pillars to quantify cell migration along paths of differentially sized pores (Kopf et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0022]; Renkawitz et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0037]; Renkawitz, Reversat, Leithner, Merrin, & Sixt, 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0038]).\nWhereas the micro-structures are different, the usage of both micro-channels and micro-pillars follows the same protocol: First, a mold with a template of the desired micro-structures is needed to prepare micro-structures with defined width, height, length, and constriction/pore sizes. These templates can either be a custom-made wafer produced by photolithography, a commercially acquired wafer, or an “epoxy replicate” of an already existing micro-structure shared by another research group (the latter option is a simple option for research groups without micro-engineering expertise; see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0002]).\nOnce the micro-fabricated mold is available, the transparent and gas-diffusible polymer PDMS can be used to generate a replica of the micro-structure. For this purpose, PDMS is mixed with a curing agent to start a polymerization reaction. This still liquid mixture is then added to the mold (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]-C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]), such as a wafer or an epoxy replicate. After solidification of the PDMS, the device is diced (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]-H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]), loading holes are punched (Fig. 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]), and the PDMS device is irreversibly attached to a glass surface using a plasma cleaner. This generates a microenvironment in which the channel/pillar walls and the ceiling are composed of PDMS, whereas the bottom is made of a glass coverslip (Fig. 2J[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002], 2K[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]) enabling high-resolution microscopy (Fig. 2L[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]-O[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3c7c1331-e400-4359-a4a1-f4ea9bcf7cbe/cpz1407-fig-0002-m.jpg</p>\nFigure 2",
    "Step-by-step guide to generate micro-channel and micro-pillar assays. Representative images of critical steps when generating micro-channels or micro-pillars. (A-D) Making an aluminum foil dish for the wafer, casting PDMS, and defoaming in a vacuum desiccator. (E-H) Consecutive steps of removing the cured PDMS from the wafer. (I-K) Punching of the loading holes and representative images of final PDMS devices. (L-O) Microscopic views of exemplary 4-way pore-decision micro-channels. The red dotted square highlights the magnified area shown in each subsequent image. The loading holes in I and J were generated using a 3-mm commercial puncher, and the loading holes in K-M were generated using a wide 9- × 3-mm custom-made puncher.\nIn the next step, the PDMS device has to be prepared for loading with cells by filling the micro-channels/micro-pillars with cell culture medium. The devices are placed into a plasma cleaner followed by addition of the cell culture medium to the PDMS device. Thereby, the surface of the device is converted from hydrophobic to hydrophilic, enabling subsequent flooding of the whole device and the micro-structures. A vacuum chamber can be used to remove residual air bubbles inside the micro-structures.\nThe assay can be combined with a chemokine gradient to guide migrating cells into the micro-structures. After addition of the respective chemoattractant (for the cellular model of interest; e.g., CCL19 for DCs, fMLP for human neutrophils) into one loading hole, the cells are added into a second loading hole. Subsequently, the cells can be imaged inside the pore-decision micro-channels and micro-structures by live cell microscopy (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/726651a3-b8aa-411a-afbf-8db809201350/cpz1407-fig-0003-m.jpg</p>\nFigure 3",
    "Dendritic cell migration in micro-channels and micro-pillars with defined pore sizes. (A) Macroscopic overview (left panels), close-up microscopic scheme (middle panels), and adjustable parameters (right panels) of micro-channel and micro-pillar assays. (B) Representative Hoxb8-FL-derived Lifeact-GFP encoding dendritic cell (DC) migrating in a pore-size decision micro-channel along a CCL19 gradient. The micro-channel bears a 4-way path junction with four differently sized pores (2, 3, 4, and 5 µm wide; all 5 µm high). The cellular nucleus is visualized using Hoechst 33342. The cellular and nuclear paths are shown by the cellular and nuclear contours, respectively (over time from dark red to yellow to dark blue). (C) Representative bone marrow-derived DCs migrating along a CCL19 gradient through micro-pillars that are arranged in 5 µm distances to generate a microenvironment composed of 5 µm pores. The cellular velocity is color-coded (left panel; the spectral scale represents velocities from 0 to 9.36 µm/min) and quantified (right panel; mean ± 95% confidence interval). (D) Representative Hoxb8-FL-derived Lifeact-GFP encoding DC migrating along a CCL19 gradient in a micro-pillar assay composed of 5 µm pores. The cellular nucleus is visualized using Hoechst 33342. The cellular and nuclear paths are shown by the cellular and nuclear contours, respectively (over time from dark red to yellow to dark blue). (E) Representative Hoxb8-FL-derived Lifeact-GFP DCs migrating along a CCL19 gradient through micro-channels with single pores (no path junctions) of 5 and 2 µm sizes, respectively. Note the nuclear (Hoechst 33342) deformation particularly in the 2 µm pore.",
    "We have used these PDMS-based migration micro-structures already with a wide variety of different cell types. For instance, DCs (see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0003]), neutrophils, and T cells efficiently migrate in the described pore-decision micro-channels as well as in the pore-decision micro-pillars (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0003]; Leithner et al., 2016[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0026]; Renkawitz et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0037]; Renkawitz et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0038]). Further, we successfully employed macrophages (MCs), HT1080 fibrosarcoma cells, and 3T3 fibroblasts inside pore-decision micro-pillars (Renkawitz et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0037]). These pore-decision micro-pillars are particularly advantageous when investigating slowly and/or nondirectionally migrating cells, as they enable imaging directly upon exit from the loading hole.\nImaging cell migration inside micro-structures with alternative pore sizes allows the ability to receive information about general migration parameters like the speed of the cell but also more specific information like (1) the time a cell requires to cross pores of a specific size, (2) the mechanisms underlying cellular decision making, and (3) cellular preference for specific pore sizes. It is also possible to perform these experiments with genetic and non-genetic fluorescent labels to visualize specific cellular compartments or proteins during migration. For example, it is possible to use cells labeled with fluorescent Lifeact (Riedl et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0040]) to visualize F-actin dynamics during migration through narrow pores and decision making, or to label the cellular nucleus with DNA binding dyes like Hoechst 33342 to visualize nuclear positioning and squeezing during migration. The described assay can also be coupled with the CRISPR/Cas9 technology to investigate the function of specific proteins or protein subdomains on cellular migration (Hammerschmidt et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0015]; Leithner et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0025]; Orosz, Walzog, & Mócsai, 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0033]; Redecke et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0036]; Xu et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0064]).\nMaterials\nPolydimethylsiloxane (PDMS) SYLGARD™ 184 Silicone Elastomer Kit (Biesterfeld)\nCuring agent: SYLGARD™ 184 Silicone Elastomer Kit (Biesterfeld)\nWafer (custom-made) or epoxy replica (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0002])",
    "Isopropanol, Certified AR for Analysis (Thermo Fisher Scientific, 10366430)\nEthanol, Absolute 99.8+ %, Certified AR for Analysis (Thermo Fisher Scientific, 10437341)\nImaging medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-rec-0002])\nChemokine: Recombinant Mouse CCL19/MIP-3 beta Protein (Bio-Techne, 440-M3-025)\nDendritic cells (DCs; see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0003])\nDNA stain: Invitrogen NucBlue™ Live ReadyProbes™ (Hoechst 33342; Thermo Fisher Scientific, R37605)\nThinkyMixer Cups (Thinky-250AD-200DSP-Disposable Cups; C3 Prozess- und Analysentechnik)\nScotch tape (Scotch® RemovableTM M8111933)\nRazor blade (Thermo Fisher Scientific, 11904325)\nPuncher (Harris Uni-Core™, 3 mm)\nPetri dish: CELLVIEW cell culture dish (Greiner Bio-One, 627860)\nBeaker (SCHOTT DURAN® Beaker, low form, with spout, 211063604)\nPipet tips (starlab): \n               \n10 µl graduated TipOne® Tip (S1111-3700-C)\n1,000 µl graduated TipOne® Tip (S1111-6701-C)\n200 µl UltraPoint® graduated TipOne® Tip (S1113-1706-C)\nScale (Ohaus CL501 or equivalent)\nThinkyMixer (Thinky ARE-250)\nVacuum desiccator (Kartell filtration and vacuum desiccators, Art. 230 or equivalent)\nVacuum pump (Dekker RVR003H-OT or equivalent)\nOven (mini oven STZ 5.4 720.2070.04 or equivalent)\nUltrasonication bath (Elma Elmasonic S or equivalent)\nPressured air (from house gas supply)\nAir blower (Bahco BP218 or equivalent)\nForceps\nPlasma cleaner: Expanded Plasma Cleaner (Harrick Plasma, PDC-002-CE)\nPipet (Eppendorf Research plus or equivalent)\nCell culture microscope (Leica or equivalent)\nCell culture incubator (Eppendorf Galaxy 170R or equivalent)\nMicroscope with automated stage, incubation chamber, temperature control unit, and CO2 control unit (Leica DMI 8, Incubator i8, Pecon® TempController 2000, Pecon® CO2-Controller 2000 or equivalent)\nTemplates of micro-channels and micro-pillars",
    "This protocol is based on molds with templates for the respective micro-channels and micro-pillars. As a template one can either use (1) a custom-made wafer generated by photolithography, (2) a commercially generated wafer, or (3) an epoxy replicate of an existing wafer. The generation of custom-made wafers by high-resolution photomasks to pattern photoresists has been described earlier (Merrin, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0030]; Renkawitz et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0038]). The generation of epoxy replicates of existing wafers represents a suitable possibility to replicate and thus share already existing micro-structures (see Support Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0002]). Once the template with the respective micro-channels and micro-pillars is available, our protocol starts with pouring PDMS onto the template (the wafer or epoxy replicate) to generate the microstructure of interest as a PDMS block (steps 1-6).\nGenerating a PDMS block bearing the respective micro-channels or micro-pillars\n1. Weigh a 10:1 (w/w) mixture of PDMS and PDMS curing agent in a Thinky mixer cup.\nUsually, a mixture of 60 g PDMS and 6 g PDMS curing agent is sufficient for a wafer with a diameter of 10 cm. The expected height of the resulting PDMS pieces would be 6-8 mm.\n2. Mix PDMS and PDMS curing agent in the Thinky ARE-250: 2,000 rpm for 2 min in mixing mode and 2,200 rpm for 2 min in defoaming mode.\nStep 2 is necessary to remove air from the mixture. If a Thinky ARE-250 mixer is not available, mixing and defoaming can be performed in a 50-ml Falcon tube by using ten repetitive cycles of mixing with a scoop and subsequent centrifugation (2,000 × g, 20 min).\n3. Pour PDMS mix into the aluminum mold with the wafer (Fig. 2C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]).",
    "A custom-made dish of aluminum foil is used around the wafer (Fig. 2B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). A cardboard disc slightly more than 100 mm in diameter and ∼2 cm in height is used to shape the aluminum foil (Fig. 2A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). The aluminum foil dish has the advantage that it can be removed without breaking the wafer as opposed to curing in a petri dish where the wafer cannot be removed easily.\n4. Place wafer in a vacuum desiccator to remove remaining air bubbles (Fig. 2D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]).\nNormally, a lot of air bubbles occur directly after turning on the vacuum. Venting after a couple of minutes should be considered to avoid spillover of the PDMS.\n5. Degas in the vacuum desiccator until no air bubbles are left.\nUsually, this should not take longer than 60 min.\n6. Place wafer in an oven set to 80°C overnight (at least 4 hr).\nTogether, steps 1-6 produce a negative replica of the micro-structures in a PDMS block, which still is inside the aluminum mold on top of the wafer.\nPlasma bonding of the PDMS block to a glass surface\n7. Remove PDMS from the wafer.",
    "First, remove the aluminum foil from the side of the wafer (Fig. 2E[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). Cut off the excess PDMS from the outside of the wafer using a razor blade (Fig. 2F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). In the next step carefully lift the PDMS on the bottom of the wafer (the side that does not contain the micro-structures) and peel it off (Fig. 2G[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). Then slowly lift the PDMS from the top of the wafer (the side that does contain the micro-structures) by only putting force on the PDMS itself but not on the wafer as it is fragile and might break (Fig. 2H[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). As soon as the PDMS is detached from the wafer, work with the features on the PDMS facing upward and avoid touching the PDMS surface as the micro-structures might get dirty. For long-term storage of PDMS pieces, cover the surface with Scotch tape. PDMS pieces can be stored for several months or even years.\n8. Cut each PDMS piece in size.\nThe PDMS piece has to fit on the desired imaging dish or through the drilled hole in the cell culture dish (see step 11). Be careful not to cut into the micro-structures. Never cut out PDMS pieces with a razor blade before removing the wafer. The wafers are silicon crystals and can break easily.\n9. Punch holes for cell and chemokine administration into the PDMS piece with a puncher (Fig. 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]).\nUse a 3-mm puncher to punch multiple single holes on each side of the micro-channels (Fig. 2I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]-J[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]). The number of holes depends on the width of the micro-structures. It is also possible to use custom made punchers to generate larger loading holes. We normally use a custom-made elliptic puncher (3 mm × 9 mm; Fig. 2K[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]).",
    "10. Cover the surface with Scotch tape for storage to avoid dust particles on the micro-structures.\nIn addition, Scotch tape can be used to remove punching debris and dust particles before plasma bonding (see step 14).\n11. Clean glass-bottom petri dishes with isopropanol to provide a glass surface suitable for imaging with an inverted microscope (see Materials section) by placing them into a beaker. Sonicate for 3 min.\nIt is also possible to use other imaging-suitable devices or adjust different cell culture dishes to be suitable for imaging. For the latter purpose, drill a hole into the desired cell culture dish. Bond the PDMS onto cleaned coverslips and glue the coverslip with the device into the hole of the dish using aquarium glue. When directly comparing different samples, it can be useful to use a 6-well plate with drilled holes to be able to record different conditions at the same time.\n12. Transfer imaging dish into a new beaker with pure ethanol and repeat sonication step.\n13. Remove remaining ethanol from the imaging dish with compressed air.\n14. Place PDMS pieces from step 10 with micro-structures facing upwards and the cleaned imaging dish from step 13 into a plasma cleaner.\n15. Plasma clean PDMS pieces and imaging dishes at high power for 2 min.\nThe needle valve on the plasma cleaner should be slightly open to ensure a constant plasma intensity.\n16. Turn off plasma cleaner and carefully press PDMS pieces (features now facing downwards) onto the imaging dish.",
    "The plasma cleaner generates a plasma, which leads to the formation of free radicals on accessible surfaces. Consequently, when the activated surfaces are placed on top of each other directly after activation, the radicals form molecular bonds with each other, thereby bonding both surfaces irreversibly to each other. Notably, the activation of the surface diminishes over time. Therefore, it is crucial to perform this step immediately after turning off the plasma cleaner.\n17. Place bonded PDMS devices in an oven set to 80°C overnight.\nTogether, steps 7-17 result in PDMS devices bearing the respective microstructures (Fig. 2L[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]-O[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0002]) with the PDMS properly bonded on the glass surface, which can be stored for months or used directly for experiments.\nFilling the micro-channels with medium\n18. Prepare imaging medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-rec-0002] section).\nIt is possible to add, for example, pharmacological inhibitors or other compounds of interest according to the research question into the medium. In this case, the respective medium should be already used for the initial flushing of the device, as well as for dilution of the chemoattractant and resuspension of the cells to ensure proper distribution of the compound within the assay.\n19. Activate device for 2 min on high power in the plasma cleaner.\nIt generates a hydrophilic surface and ensures proper entry of the medium.\n20. Flush PDMS device by pipetting 20 µl imaging medium into each entry hole.\nAlternatively, it is also possible to cover the whole device with medium. Again, activation of the surface diminishes over time. Therefore, it is crucial to perform this step immediately after turning off the plasma cleaner.",
    "21. If the plasma cleaning is not sufficient for flooding the entire micro-structure with imaging medium (e.g., narrow constrictions inside micro-channels might take longer to be filled with medium), place the dish in a vacuum desiccator for 5 min.\nRepetitive cycling of depressurizing and repressurizing removes the air bubbles from the micro-structures. Check under a microscope and repeat vacuum until all air bubbles are successfully removed. Alternatively, put the PDMS device onto a flat surface and press lightly on the PDMS piece to remove air bubbles in the interface. Do not press too hard as some structures might collapse.\n22. Overlay the entire PDMS device with medium (if not done during step 20).\n23. Incubate for at least 1 hr in a humidified incubator at 37°C and 5% CO2.\nIt is possible to flush the device 1 day before the experiment and leave it in an incubator overnight. This longer incubation time also helps to remove air bubbles efficiently.\nTogether, steps 18-23 provide PDMS devices with medium-filled microstructures.\nGenerating a chemokine gradient and cell administration\n24. Remove most of the medium from the petri dish and entirely from all entry holes.\nLeave some medium in the bottom of the device as it prevents drying of the assay. Make sure it does not cover the entry holes as this would disturb the gradient.\n25. Add 20 µl chemoattractant solution (0.625 µg/µl CCL19 in imaging medium, 40× stock: 25 µg/µl CCL19 in 0.1% BSA in PBS) to each entry hole on one side of the micro-channels.",
    "Avoid introducing air bubbles. The loading hole for the chemoattractant and the loading hole for the cells have to be specifically selected for some micro-structure designs. For instance, the pore-decision micro-channels require loading of the cells on the side before the path junction and loading of the chemoattractant behind the path junction.\n26. Place device in an incubator for 30 min to let the gradient be established.\nAdding the diluted chemokine just to one hole helps to push the chemokine into the micro-structures (complementing chemokine diffusion).\n27. Add cell suspension to each of the entry holes on the other side of the micro-channels.\nThe cell number strongly depends on the design, cell type, treatment, and loading hole size. For untreated dendritic cells we recommend using 1–2 × 104 cells per loading hole (3-mm diameter). If necessary, cells can be stained before administration to the entry holes in this step (e.g., Hoechst 33342 for nuclear staining).\n28. Place device in an incubator and wait until the cells migrate to the structure of interest.\nUsually, it takes between 30 min and 2 hr depending on the design, cell type, treatment, and distance between the two entry holes.\nTogether, steps 24-28 lead to cells migrating into the micro-structures toward the chemokine source.\nImaging\n29. Use an inverted microscope with an incubation chamber heated to 37°C and supplied with humidified 5% CO2. Set up the microscope according to your experimental setup and research question.\nFor instance, brightfield and epifluorescence microscopy can be employed (1) to track many cells in lower resolution (e.g., 20×; Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0003]) and (2) to visualize subcellular spatio-temporal dynamics in higher resolution (e.g., 100×), such as actin and nuclear dynamics (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0003]).",
    "30. Optional: In addition to brightfield and epifluorescence microscopy, this assay can also be used with a wide range of other microscopic techniques. Total internal reflection fluorescence (TIRF) microscopy can be used to visualize structures in close proximity to the glass surface of the imaging dish (e.g., actin, integrins). Fluorescence lifetime imaging microscopy (FLIM) can be used to measure membrane tension in migrating cells, while a spinning disk confocal microscope allows the possibility of observing fast and dynamic processes within the migrating cells such as microtubule polymerization.\nTogether, steps 29-30 result in microscopy data, e.g., videos of cells migrating through micro-channels or micro-pillars.",
    "Micro-structures can be replicated with epoxide resin (Kamande, Wang, & Taylor, 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0020]). As an alternative to wafers, epoxide replicas are recommended when access to wafers is limited. Epoxide replicas can be used to avoid the risk of breaking the fragile wafers accidentally during repeated production of PDMS devices. Manufacturing new wafers may also not always be feasible because the generation of wafers requires specialized laboratory equipment. Additionally, epoxide replicas can be used to share existing micro-structure designs with other research laboratories. To produce an epoxide replica, the micro-structures on the PDMS block (described in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0001]) are imprinted into the resin, resulting in a replica of structures of wafer. The epoxide resin is mixed with a hardener to start a polymerization reaction, then the PDMS block is placed with the micro-structures pointing downwards into the still liquid epoxide. Upon solidification of the epoxide resin and removal of the PDMS, a negative replica of the PDMS is generated, which features the same micro-structures as the wafer and hence can be repeatedly used as a template to produce further PDMS blocks. However, it should be noted that minimal size alterations of the micro-structures (e.g., height, width) can occur during the replication procedure.\nMaterials\nEpoxy Resin: Epoxy Resin L + Hardener S kit (R&G Faserverbundwerkstoffe)\nHardener: Epoxy Resin L + Hardener S kit (R&G Faserverbundwerkstoffe)\nPetri dish: Cell culture dish, 150 mm, TC-treated (VWR, 734-2322)\nSerological pipets: Advantage™ Serological Pipets (Corning, FALC 356543)\nVacuum desiccator (Kartel filtration and vacuum desiccators Art. 230 or equivalent)\nVacuum pump (Dekker RVR003H-OT or equivalent)\n1. Cure PDMS as indicated in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0001] to generate structures for replication.\n2. Mix epoxy components as indicated by the manufacturer on the bottle.\n3. Mix carefully by stirring and transfer into a clean petri dish.",
    "The size of the petri dish depends on the size of the micro-structures or the number of PDMS pieces you want to replicate. It is possible to replicate multiple structures in parallel. The polymerization reaction of epoxide is exothermic. Only perform under airflow hood in a fireproof environment.\n4. Wait for 15 min.\n5. Remove the majority of air bubbles by putting the dish into a vacuum desiccator.\nVent as necessary to pop air bubbles until no large air bubbles occur.\n6. Add PDMS piece(s) on top of the epoxy, features facing downwards.\n7. Put petri dish under vacuum for 1 hr.\nThe vacuum helps to remove bubbles that were introduced by placing the PDMS on top of the epoxy.\n8. Let epoxy harden at room temperature overnight.\n9. Remove PDMS from the epoxy mold carefully.\nThe PDMS used for replication should be discarded afterwards as the micro-structures are no longer intact. The epoxy can now be used instead of a wafer to cure new PDMS pieces. PDMS pieces should be removed carefully from the epoxy mold using a razor blade as the sharp blade could damage the epoxy over the long term. In addition, it might be necessary to silanize the epoxy replicate for 1 hr so the PDMS does not stick to it, as it coats the epoxy replicate with a monolayer of hydrophobic silane (Kamande et al., 2015[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0020]).",
    "Epoxide replicates can have small alterations in their dimensions (e.g., differences in channel heights, sizes of pillars, and pore sizes). Thus, we highly recommend that the dimensions of the first microstructures generated by new epoxy replicates are measured. The easiest way to check for possible alterations is to generate a PDMS device from the new epoxy replicate, bond it, and check the dimensions of the device on a light microscope by measuring them.\nThis protocol should result in an epoxy mold with the same micro-structures as the original wafer, which can be used to generate further PDMS devices (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0001]).",
    "Dendritic cells (DCs) are an important cell type linking the innate and adaptive immune system (Worbs, Hammerschmidt, & Förster, 2017[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0063]). Immature DCs take up antigens in the tissue for MHC-II presentation. After antigen uptake, the DCs mature and migrate towards the lymph nodes where they present their captured antigens via MHC II to T cells and B cells. Their high migratory capacity in combination with the ability to migrate directly towards chemokines such as CCL21 and CCL19 makes DCs a versatile tool to investigate directed migration mechanisms in three dimensional (3D) environments.\nIn this support protocol, we describe the generation of immature and mature DCs using bone marrow derived cells (Lutz et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0029]) or the immortalized progenitor cell line Hoxb8-FL (Leithner et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0025]; Redecke et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0036]). To initiate differentiation, the precursor cells are stimulated with granulocyte-macrophage colony-stimulating factor (GM-CSF). This activates the differentiation of monocytes and other progenitor cells into immature DCs and proinflammatory M1 macrophages. The macrophages are “sticky” (adhesive) and adhere to surfaces while the immature DCs stay in suspension or just weakly adhere to surfaces, allowing removal of the macrophages by collecting only “floating” (non-adhesive) cells (Sixt & Lämmermann 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0049]). Stimulation of immature DCs with bacterial derived lipopolysaccharides (LPS) leads to differentiation into mature DCs (Lutz et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0029]). Mature DCs are chemotactic to CCL21 and CCL19 and can be identified by surface expression of Cd11c and MHC-II, while immature DCs do not express MHC II.\nCAUTION: DC maturation can be triggered by freezing, thus immature DCs can only be used directly after differentiation without freezing.\nMaterials\nHoxb8-FL cells (kindly provided by Prof. Michael Sixt's lab, ISTA)\nBone marrow cells (isolated from male C57Bl6/J mice aged 2 to 3 months, bred in the Core Facility - Animal Models at Biomedical Center Munich)",
    "R10 medium supplemented with 10% GM-CSF supernatant (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-rec-0004])\nR10 medium supplemented with 20% GM-CSF supernatant (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-rec-0005])\nLipopolysaccharide (LPS) from Escherichia coli O26:B6 (MilliporeSigma, L2654-1MG)\nFreezing medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-rec-0001])\n100-mm petri dish (PS, 94/16; Greiner Bio-One, MM 632180)\nSerological pipets: Advantage™ Serological Pipets (Corning, FALC 356543, FALC 356551)\nPipet tips (starlab): \n               \n10 µl graduated TipOne® Tip (S1111-3700-C)\n1,000 µl graduated TipOne® Tip (S1111-6701-C)\n200 µl UltraPoint® graduated TipOne® Tip (S1113-1706-C)\nCryotubes: Nunc™ Biobanking and Cell Culture Cryogenic Tubes (Thermo Fisher Scientific™, 368632) or equivalent\nCell culture treated petri dish (Eppendorf® Cell Culture Dishes, 0030702115)\nCell counting chamber (Marienfeld Superior™ Counting Chamber or equivalent)\nPIPETBOY (ClearLine® pipet controller or equivalent)\nPipet (Eppendorf Research plus or equivalent)\nCell culture incubator (Eppendorf Galaxy 170R or equivalent)\nCell culture centrifuge (Hettich Rotina 35R or equivalent)\nStyrofoam box\n-80°C freezer (Thermo Scientific HERAfreeze™ HFU T Series or equivalent)\nLiquid nitrogen tank (Thermo Scientific™ CryoPlus™ Storage Systems or equivalent)\nDay 0\nDCs can be differentiated from either murine bone marrow or an immortalized progenitor Hoxb8-FL cell line. For detailed information see Lutz et al., 1999[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0029]; Redecke et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0036]; and Leithner et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0025].\n1. Count cells and seed 2 × 105 cells for Hoxb8-FL derived DCs or 2.5 × 106 cells for bone marrow derived DCs per 100-mm petri dish containing 10 ml R10 medium supplemented with 10% GM-CSF.\nThe dishes used for the differentiation should be bacterial dishes and not tissue culture treated. Bone marrow can be frozen after isolation and thawed before differentiation. In this case, seed 5 × 106 cells per dish.\n2. Incubate in a humidified incubator at 37°C and 5 % CO2.\nDay 3\n3. Add 10 ml R10 medium supplemented with 20% GM-CSF.",
    "GM-CSF in the medium is consumed by the cells over time. Thus, note that on day 3 and on day 6, R10 medium supplemented with 20% GM-CSF is added to maintain a final concentration of 10% GM-CSF within the cell culture (whereas R10 medium with 10% GM-CSF is used on day 0 in step 1).\n4. Incubate in a humidified incubator at 37°C and 5% CO2.\nDay 6\n5. Remove 10 ml medium.\nCarefully remove from the top to avoid removing too many cells.\n6. Add 10 ml R10 medium supplemented with 20% GM-CSF.\nAgain, R10 medium supplemented with 20% GM-CSF is added to maintain a final concentration of 10% GM-CSF.\n7. Incubate in a humidified incubator at 37°C and 5% CO2.\nDay 8\nCells can be used directly as immature DCs or stimulated with LPS to generate mature DCs. Cells can also be frozen for storage and stimulated after thawing at a later time point.\n8. Collect nonadherent and loosely adherent cells by taking up the medium and flushing the plate multiple times.\nDo not harvest adherent cells.\n9. Centrifuge at 300 × g for 5 min.\n10. Optional: Resuspend cells in freezing medium at a density of 5 × 106 cells/ml and place into a Styrofoam box at −80°C.\nCryotubes should be transferred into liquid nitrogen after 2-3 days for long-term storage (6-12 months; longer storage reduces the number of surviving cells upon thawing).\n11. Count cells, resuspend in R10 medium supplemented with 10% GM-CSF, and seed cells on a 100-mm tissue culture treated petri dish.",
    "For LPS stimulation, the dish should be tissue culture treated to further separate non-adherent mature DCs from remnant adherent cells like immature DCs or macrophages. For a 100-mm dish, we recommend using 5 × 106 cells either directly after differentiation (step 11) or from frozen cryotubes (step 10). Frozen cells should be resuspended in medium followed by a centrifugation step at 300 × g for 5 min. Aspirate the medium and resuspend the cell pellet in fresh R10 medium to eliminate DMSO from the freezing medium.\n12. Add 200 ng/ml LPS (5,000× stock in PBS).\n13. Incubate in a humidified incubator at 37°C and 5% CO2 overnight.\nWe recommend performing subsequent migration assays 24 hr after LPS stimulation (to give sufficient time for the transcriptional maturation program but without extending into later apoptotic responses of stimulated DCs).\nIn this protocol mature DCs are generated, which can be directly added to the PDMS devices or the collagen gels.",
    "The described generation of PDMS-based “pore-choice” micro-channels and micro-pillars (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0001]) requires equipment, which may not be readily available, such as physical templates of the desired micro-structures and a plasma cleaner. In contrast, 3D collagen networks are defined microenvironments that can be generated with equipment available in most laboratories.\nIn the following protocol, we generate 3D in vitro networks of collagen type I which represents a major constituent of most interstitial tissues (Wolf et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0061]). As an experimental setup, we use 6-well plates or 30-mm petri dishes in which we drill holes of 17-mm diameter. Closing these holes with glass slides on both sides generates chambers with defined dimensions and suitable optical properties for imaging (Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]). These chambers are filled with a suspension of collagen and cells. It is important to note that the formed collagen network is heterogeneous in its porosity, meaning that different pore sizes are next to each other. Notably, the pore sizes and complexity of these collagen networks can be adjusted by changing the amount of collagen added to the mixture. For this purpose, we describe the usage of three different bovine collagen type I preparations: PureCol® which contains 3 mg/ml collagen, Nutragen® containing 6 mg/ml collagen, and FibriCol® containing 10 mg/ml collagen. Accordingly, collagen networks generated with PureCol® are the least dense collagen networks with the largest average pore sizes while the collagen networks generated with FibriCol® have the highest collagen density with the smallest average pore sizes (Renkawitz et al., 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0037]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/882c5d5a-cfc0-460c-8489-09e8ea9d6464/cpz1407-fig-0004-m.jpg</p>\nFigure 4",
    "Dendritic cell migration in 3D collagen networks of variable sizes (A) Scheme of the chamber setup for the collagen assay. (B) Representative Hoxb8-FL-derived Lifeact-GFP encoding dendritic cell (DC) migrating in 1.7 mg/ml (left panel) or 5.6 mg/ml (right panel) bovine collagen type I along a CCL19 gradient. Collagen fibers (gray) are visualized by reflection microscopy using a scanning laser confocal microscope, and Lifeact-GFP and Hoechst 33342 are shown in green and blue, respectively (data was denoised with a 1 pixel gaussian filter, the cell channel was averaged over all z-slices that contained the cell; to accurately display collagen network density, z-slices over 500 nm were stacked with a maximal intensity projection for each image, the nucleus channel was stacked with maximal intensity projection over the z-slices containing the nucleus). (C) Velocity color-coded tracks of bone marrow-derived DCs migrating in 1.7 mg/ml bovine collagen type I along a CCL19 gradient (the spectral scale represents migration velocities from 0 to 9.36 µm/min, cells were tracked for up to 5 hr). (D-F) Tracks, directionality, and velocity of bone marrow-derived DCs migrating in collagen networks of different densities (1.7, 3.3, and 5.6 mg/ml with n = 16, 10, and 16, respectively; cell tracks (D) or averages of each track (E and F) over the timespan from minute 45 to 170 of the recording are shown; red bar (E and F) is the mean ± 95% confidence interval.\nSimilar to the PDMS-based micro-channels, a chemokine gradient can be used to guide directed cell migration. For this purpose, the chemokine is diluted in cell culture medium and added on one side of the solidified collagen gel. A chemokine gradient is formed upon diffusion into the collagen network, which attracts the cells towards the respective side of the collagen gel.",
    "We here describe the usage of collagen networks as porous environments for DC migration (Lämmermann et al., 2008[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0023]; Sixt & Lämmermann 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0049]), yet collagen networks are versatile as they have been already used with neutrophils (François et al., 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0010]; Salvermoser et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0044]; Wolf et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0062]), T cells (Wolf et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0062]), fibroblasts, and cancer cells (Doyle, Sykora, Pacheco, Kutys, & Yamada, 2021[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0007]; Ilina et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0018]; Infante et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0019]; Sabeh et al., 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0042]; Wolf et al., 2013[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0062]). In summary, collagen networks give insights into cell migration in physiologically close porous environments with different complexity and pore sizes. Thereby, collagen networks can be used to investigate migration mechanisms like cellular squeezing through individual pores and cell motility through less or more dense microenvironments. From a technical perspective, this assay further allows the imaging of large numbers of motile cells simultaneously. Yet, quantifying individual pore sizes is not trivial.\nMaterials\nParaffin wax (MilliporeSigma, 76242)\nDendritic cells (DCs; see Support Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-prot-0003])\nR10 medium (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-rec-0003])\nGibco™ MEM, 10×, no glutamine (Thermo Fisher Scientific, 11-430-030)\n7.5% sodium bicarbonate (NaHCO3) solution (MilliporeSigma, S8761)\nCollagen (CellSystems): \n               \nBovine collagen solution Nutragen® (5010-50ML)\nPureCol® (5005-100ML)\nFibriCol™ (5133-20 ml)\nChemokine: Recombinant Mouse CCL19/MIP-3 beta Protein (Bio-Techne, 440-M3-025)\n60-mm petri dish with 17-mm hole (Falcon™ Easy-Grip Tissue Culture Dishes, 60 mm; Corning, 353004; holes need to be added manually)\nPaintbrush\n22- × 22-mm coverslip: Karl Hecht™ Microscope Cover Slips (Thermo Fisher Scientific, 41014515)\n20- × 20-mm cover slip: Karl Hecht™ Microscope Cover Slips (Thermo Fisher Scientific, 41014512)\nCell counting chamber (Marienfeld Superior™ Counting Chamber or equivalent)\nPipet tips (starlab): \n               \n10 µl graduated TipOne® Tip (S1111-3700-C)\n1,000 µl graduated TipOne® Tip (S1111-6701-C)\n200 µl UltraPoint® graduated TipOne® Tip (S1113-1706-C)\nHeating plate (Ikamag RH or equivalent)\nPipet (Eppendorf Research plus or equivalent)",
    "Cell culture incubator (Eppendorf Galaxy 170R or equivalent)\nMicroscope with incubation chamber and temperature control unit (Leica DMI 8, Incubator i8, Pecon® TempController 2000 or equivalent)\nPreparing collagen chamber\n1. Make use of a petri dish with a hole (diameter 17 mm; Fig. 4A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]).\nUsually, we use a 6-well plate to test different conditions in one experiment. However, it is possible to use any other cell culture dish with a custom-made hole. If it is not feasible to generate holes in cell culture dishes, it is also possible to use a microscopy glass slide and a coverslip to generate a chamber for the collagen (Sixt & Lämmermann 2011[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0049]). Further, there are custom-made microfluidic chips (Frick et al., 2018[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-bib-0011]) and commercial chambers to study cell migration in collagen, e.g., µ-Slide Chemotaxis (ibidi, cat. no 80326).\n2. Make a circle of liquid paraffin around the hole on the bottom of the plate using a paintbrush.\nParaffin is heated in a beaker on a heating plate until it becomes liquid. Paraffin should not get too hot and should not be left unsupervised on the heating plate.\n3. Carefully press a coverslip (22 × 22 mm) on the hole and heat paraffin by holding the plate over a hot plate. Wait until the paraffin has melted and thereby tightly sealed the coverslip to the plate.\n4. Seal coverslip from the bottom by painting around the coverslip with paraffin.\n5. Place a coverslip (20 × 20 mm) on the inside of the dish leaving a small opening on the top.\n6. Fix coverslip with paraffin.\nIt helps to first fix the two bottom corners of the coverslip with two drops of paraffin so that it can no longer get out of place and then go around the remaining edges.",
    "Together, steps 1-6 result in a ready-to-use chamber for the collagen assay.\nPrepare cells and collagen mixture\n7. Adjust the number of mature dendritic cells to 3–5 × 105 cells in 100 µl R10 medium (per well).\n8. Prepare collagen mixture in the order given in Table 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-tbl-0001] (indicated volumes are needed for one well).\nThe collagen solutions contain HCl. The high acidity prevents polymerization of the collagen. Upon addition of NaHCO3, the HCl is neutralized (releasing CO2), which enables collagen polymerization at 37°C. After adding NaHCO3 to the 10× MEM solution the solution should turn pink. Otherwise, the pH may not be correct and the mixture may not polymerize (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-tbl-0002] for troubleshooting suggestions). All components of the collagen mixture should be pre-warmed to room temperature. Collagen of different concentrations can be added to the mixture depending on the complexity of the environment necessary for specific experimental questions. Mixtures with higher collagen concentrations (e.g., FibriCol®) are extremely viscous and should be mixed very carefully to avoid introducing air bubbles. It can also be useful to increase the volumes for each well to compensate for bigger pipetting errors caused by the increased viscosity.\nTable 1..\n                Components of Collagen Mixture and Their Respective Volumes\ntable:\n﻿Component,Volume\n\"MEM, 10×\",30 µl\nNaHCO3,15 µl\nCollagen,225 µl\nTable 2.\n                Troubleshooting Guide for Immune Cell Migration in 3D Collagen Networks of Variable Pore Sizes\ntable:\n﻿Problem,Possible cause,Solution\nCollagen does not polymerize,The ratio of components used is not correct,\"Collagen solidifies at neutral pH, NaHCO3 neutralizes the HCl from the collagen solution. The ratio of the two components has to be accurate.\"\n,NaHCO3 is too old. The color should turn purple when adding NaHCO3 to 10× MEM and orange-red when adding the collagen,Make sure the pipetting is accurate and test with fresh NaHCO3",
    ",The collagen needs more time to fully polymerize,\"The gel should solidify at 37°C and 5% CO2 after 45 min for high collagen concentrations (5.6 mg/ml). However, lower collagen concentrations may need up to 75 min.\"\n,A drift of the gel is observed,\"Drift can be caused by the microscope stage or by gel distorting when not fully polymerized. For the analysis, discard the first 30 min of recording.\"\nCollagen does not polymerize homogeneously (streaks are visible),Collagen solidifies partially while mixing or before adding it into the chamber,\"Especially for high collagen concentrations, pipet each well individually to reduce the time between mixing and adding collagen mix in the chamber\"\n,Components are not mixed properly,\"Make sure to properly mix collagen mixture and cells. If necessary, prepare larger volumes to be able to pipet without introducing bubbles. A combination of swirling the pipet and pipetting up and down can be used to improve mixing.\"\nCollagen does not build a flat line at the top,Highly concentrated collagen may not easily flow to the bottom of the chamber,Strongly knock the dish against the metal surface of the incubator repeatedly until the cell-collagen suspension fills the chamber and creates a flat surface line. This process also can eliminate larger bubbles.\n\"Cells are dying in the collagen (e.g., during imaging)\",\"37°C, 5% CO2 or humidity is not maintained, which leads to high pH or evaporation\",\"The chamber can be sealed directly after adding the chemokine solution but if the seal is not air tight the gel will turn purple, indicating a basic pH and cells will die quickly. Make sure to seal chamber properly or use 5% CO2 + high humidity during imaging.\"",
    ",High laser power might lead to phototoxicity,\"Make sure laser intensity and exposure time is not too high. Especially during setting autofocus under constant illumination, cells might die quickly.\"\nStaining bleaches quickly,\"Collagen scatters light, leading to lower fluorescence signals. Compensation with higher light intensity can lead to bleaching. For discussion of bleaching see above.\",\"Scattering can be limited by use of longer wavelengths (using respective fluorophores), improving the signal and necessary light intensity. Also, by imaging relatively close to the glass surface facing the objective. Note that collagen polymerization might be different close to the glass compared to the center of the gel. Typically, 100-200 µm distance to the glass is appropriate for fluorescence imaging.\"\nCells are not migrating and stay spherical,Insufficient chemokine is present for the cell type,Check the appropriate concentration of chemokine. Different chemokines may require other concentrations.\n,\"Chemokine needs more time to diffuse to cells or chemokine gradient is too shallow for cells to detect it, e.g., if imaging started too late\",\"Avoid air bubbles in the gel and chemokine solution, as they prevent local diffusion of chemokine. Depending on the hydrodynamic radius of the chemokine, the time to diffusion to the cells may vary. Optimize distance of the imaging area to the chemokine or incubate it longer before imaging. To this end, regularly check if the cells start migrating. With CCL19, the chemokine gradient establishes ∼30-60 min after adding chemokine, depending on the distance to the chemokine solution. After 3-5 hr the gradient will get shallower and cells will no longer migrate in a directional manner.\"",
    ",\"Gel does not solidify well. In particular, if the gel does not stick to the glass surface, which is the case when the gel can slide around in the chamber.\",\"Make sure collagen is completely solidified. If the gel can “turn” in the chamber (e.g., when you turn the dish and it slides around), the chemokine will diffuse at the glass wall and diffuse into the gel from the top and bottom.\"\n9. Add 200 µl collagen mix to the cell suspension and gently pipet up and down to avoid air bubbles.\n10. Pipet 280 µl of the mixture into the prepared chamber.\nCarefully knocking the plate on the bench helps distribute the collagen mixture evenly in the chamber and helps to get a straight edge on the top.\n11. Incubate chamber for 45-75 min (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-tbl-0002] for troubleshooting suggestions) at 37°C and 5% CO2 to allow the polymerization of the gel.\nPolymerization is visible by a change of transparency from highly transparent to slightly opaque.\nTogether, steps 7-11 result in polymerized collagen gels with embedded cells.\nGradient formation and imaging\n12. Dilute chemokine to a final concentration of 0.625 µg/µl in R10 medium supplemented with 10% GM-CSF (40× stock with 0.1% BSA in PBS).\n13. Fill chamber on top of the gel with chemokine solution.\nDepending on the chamber used, the amount of chemokine solution can vary. For 6-well chambers with 17-mm holes, 80 µl chemokine solution per well is normally sufficient. Chemokine diffusion into the top part of the collagen takes only minutes. Therefore, it is crucial to proceed with the following steps immediately after adding the chemokine solution.\n14. Seal the small opening of the chamber with pre-warmed liquid paraffin.",
    "Together, steps 12-14 lead to the final collagen setup with cells, collagen, and chemokine, which can be directly used for imaging.\nImaging\n15. Use an inverted microscope with an incubation chamber heated to 37°C. Set up the microscope according to your experimental setup and research question.\n16. Optional: Normally, we record the collagen assay at a relatively low resolution (e.g., 4× or 10×; Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]) for a time period of 5 hr with an image recorded every minute. Here, cells should start migrating towards the chemotactic gradient (Fig. 4C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]-F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]), which diffuses to the cells after ∼10-30 min at the gel side facing the chemokine. This allows the possibility of recording and quantifying (Fig. 4D[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]-F[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]; see also the section Understanding Results) large cell numbers and different conditions in one assay (using an automatic microscope stage). In addition to brightfield microscopy, this assay can also be used for a wide range of other microscopic techniques. Dark-field microscopy can be used to remove background light in the image (cells appear white on a dark background) for automatic tracking. Furthermore, the collagen migration assay is compatible with confocal and epifluorescence microscopy (Fig. 4B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-fig-0004]). For this purpose, we recommend using lower collagen concentrations as collagen fibers scatter light which can interfere with the fluorescence signal (see Table 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.407#cpz1407-tbl-0002] for troubleshooting suggestions). Instead of live-cell imaging, the collagen gel can be used for immunofluorescence imaging. To this end, the collagen gel with the cells is carefully removed from the plate after a desired migration period and fixed in 4% paraformaldehyde (PFA), followed by subsequent staining steps and confocal imaging.\nTogether, steps 15-16 result in microscopy data, for example, videos of cells migrating in collagen gel."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}