{
  "id": 7632,
  "origin_website": "Bio",
  "title": "Protocol for High Throughput Screening of Antibody Phage Libraries",
  "procedures": [
    "HELPER PHAGE PRODUCTION A helper phage is necessary for transferring phagemid particles into E. coli. Phagemid particles contain (i) an antibiotic maker, (ii) antibody-G3P fusion protein, and (iii) phage origin of replication.The phagemid libraries are amplified along with the antibody-G3P fusion protein and helper phage genes, which are required for infection, replication, assembly, and budding.Take three Corning® 50 mL Falcon centrifuge tubes (FCTs) and label them A, B, and C.Add 5 mL of 2× YT media to each FCT tube.Take B and C as negative controls by adding ampicillin to one and kanamycin to the other.Add 20 μL of TG1 E. coli cells to all three FCTs.Incubate the FCTs at 37°C with shaking for overnight growth.Subculture 20 μL of the previously inoculated TG1 cells in FCT A (Step A1) in 5 mL of fresh 2× YT media; incubate for 2–4 h at 37°C with shaking.Then, add 40 μL of helper phage to the cultured TG1 cells.Grow for 30 min at 37°C without shaking.Grow for 30 min at 37°C with shaking.Add this culture to 200 mL of fresh 2× YT media with kanamycin in a 50 μg/mL working concentration.Allow to grow overnight at 30°C with shaking.Remove the flask from the incubator, collect the culture in an autoclaved caesium bottle.Centrifuge at 14,260 × g for 30 min at 4°C.Pour the supernatant into another fresh caesium bottle and centrifuge at 14,260 × g and 4°C for 30 min.Without disturbing the pellet, collect the supernatant in a glass bottle and add PEG/NaCl [20% (wt/vol) Polyethylene glycol 6000, 2.5 M NaCl], keeping the ratio of the supernatant and PEG/NaCl as 50:15.Store in a cold room at 4°C for 4–5 h, or overnight for better results.Spin the culture at 14,260 × g and 4°C for 1 h to allow the cells to settle down.",
    "Without disturbing the pellet, discard the supernatant, and resuspend the pellet with 1× PBS, keeping it in 1.5 mL tubes.Centrifuge the microtubes at 16,200 × g for 5 min. In case a pellet is formed, transfer the supernatant into fresh tubes and store at 4°C (                Figure 1                ).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4450/bioprotoc-12-12-4450-g001.jpgFigure 1. Schematic representation of the steps involved in Helper Phage preparation. GROWING TOMLINSON I + J AND MAKING SECONDARY STOCK Take 100 mL of 2× YT media containing ampicillin and 1% (vol/vol) glucose. To this media, add 500 μL of the Tomlinson I + J phage library stock.Incubate for 1–2 h at 37°C with shaking, until the O.D. at 600 nm is approximately 0.4.Divide the 100 mL of culture media into two parts. First, use 50 mL to grow the library; then, use the remaining media to make secondary stocks of the library.Growing the library (phage stocks):  Take 50 mL of the 100 mL of grown media and add 200 μL of helper phage.Incubate for 30 min at 37°C without shaking.Centrifuge at 1,200 × g for 10 min.Carefully discard the supernatant without disturbing the pellet.Dissolve the pellet in 100 mL of 2× YT media containing 100 μg/mL ampicillin, 50 μg/mL kanamycin, and 0.1% (wt/vol) glucose.Incubate the resuspended pellet overnight at 30°C with shaking.After overnight incubation, transfer the culture to a centrifuge bottle (caesium bottle) and centrifuge at 14,260 × g and 4°C for 30 min.Transfer the supernatant to another caesium bottle and centrifuge again at 14,260 × g and 4°C for 30 min.Carefully transfer the supernatant into another autoclaved glass bottle and discard the pellet. Add PEG/NaCl (20% Polyethylene glycol 6000, 2.5 M NaCl) to the supernatant collected (15 mL of PEG/NaCl to 50 mL supernatant).",
    "Store this in a cold room at 4°C for 4–5 h, or overnight for better results.Spin the culture at 14,260 × g and 4°C for 1 h to allow the cells to settle down.Without disturbing the pellet, discard the supernatant and resuspend the pellet with 1× PBS; keep it in 1.5 mL tubes.Centrifuge the microtubes at 16,200 × g for 10 min. In case a pellet is formed, transfer the supernatant into fresh tubes and store at 4°C for short term storage. Add 15% (vol/vol) glycerol for longer storage at -80°C (                Figure 2                ).Making secondary stocks of phage library:  Grow the remaining 50 mL of media further for 2 h at 37°C with shaking.Allow the cells to settle down by centrifuging the culture at 1,500 × g for 15 min.Resuspend the pellet in 3 mL of 2× YT media containing 15% (vol/vol) glycerol.Store at -80°C until further use (                Figure 2                ).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4450/bioprotoc-12-12-4450-g002.jpgFigure 2. Schematic representation of the steps involved in library amplification for screening purposes and library secondary stock preparation. BIO-PANNING In this step, the target proteins are immobilized onto the surface of the microtiter plate. The first step is the addition of the rescued Tomlinson phage library. The second step involves binding, where the phage displaying scFvs, the highest affinity antibodies, bind the epitopes of the antigen, and those with low binding affinity are removed by washing. The antigen bound phage are eluted by enzymatic digestion using trypsin. The eluted phage are infected to TG1 followed by addition of helper phage for amplification. To accumulate phage displaying high-affinity antibody fragments, these steps were repeated three times with the amplified phage from the preceding round of panning, and each time, the number of washing cycles is increased.",
    "ROUND 1 One day before the experiment, coat one row (say row C) of the ELISA plate, namely plate A, with the required antigen (100 μL per well), with a concentration of 5 μg. Coat the antigen with coating buffer.Incubate plate A at 4°C overnight.Next day, make 3% BSA in 5 mL of PBS and incubate for 10 min at 37°C. Then, coat another plate, i.e. , plate B; coat two rows (say rows C and D) and incubate the plate at 37°C for 1 h.Plate C: coat one row (say row C) with a pinch of skim milk in 1 mL of autoclaved PBS + 700 μL of phage stock. Coat 100 μL per well.Incubate plate C at room temperature for 30 min. Then, transfer the coating from row C to any other row, say row D. Incubate for 30 min more.After 1 h of coating plate B, wash the plate once with autoclaved PBS (250 μL per well) and transfer the content of plate C onto row C of plate B.Again, incubate plate B at room temperature for 30 min and then transfer the content of row C onto row D, followed by another 30 min incubation.While washing plate B, simultaneously wash plate A, by using autoclaved PBS (250 μL per well) and then block with 3% (wt/vol) BSA (200 μL per well). Incubate at room temperature for 1 h.Wash plate A three times with autoclaved PBS.Then, transfer plate B content onto plate A; followed by incubation for 1 h at room temperature.After incubation, wash plate A with PBST 10 times. Make 1 mL of PBS containing 50 μL of trypsin and add 95 μL of this solution to each well.Keep the plate for 10 min at 37°C.Then, collect all the trypsinized content into one aliquot.",
    "This will be the output of bio-panning round 1.Use the output of bio-panning 1 to calculate the transducing unit (TU) (                Figure 3                ).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4450/bioprotoc-12-12-4450-g003.jpgFigure 3. Schematic representation of the steps involved in the bio-panning process. Preparation of the next round of bio-panning Add 500 μL of bio-panning output into 5 mL of TG1 cell growth media.Keep for 30 min at 37°C with shaking.Centrifuge at 700 × g for 10 min.Use 1 mL of supernatant to dissolve the pellet formed during centrifugation and throw the rest of the supernatant out.Spread this on a bioassay dish containing 2× YT agar with ampicillin.Allow the bacteria to grow at 37°C overnight.Next day, add 3–5 mL of 2× YT media containing 15% glycerol onto the bioassay dish and scrape all the colonies grown overnight. Collect them in a fresh tube.Use 100 μL of the scraped colonies and store the rest.Add 100 μL of scraped colonies to 50 mL of 2× YT media containing ampicillin (100 µg/mL) and 1% (vol/vol) glucose.Allow it to grow for 2 h at 37°C with shaking.Take 10 mL of the above culture and add a 40 μL of helper phage. Incubate for 30 min at 37°C without shaking.Centrifuge the culture at 700 × g for 15 min and discard the supernatant without disturbing the pellet.Dissolve the pellet in 50 mL of 2× YT media containing 100 µg/mL ampicillin, 50 µg/mL kanamycin, and 0.1% glucose. Incubate overnight at 30°C with shaking.Centrifuge the overnight grown culture at 14,260 × g and 4°C for 30 min, collect the supernatant in a fresh cesium bottle and centrifuge again at 14,260 × g and 4°C for 30 min.Carefully transfer the supernatant into an autoclaved glass bottle and discard the pellet. Add PEG/NaCl (20% Polyethylene glycol 6000, 2.",
    "5 M NaCl) to the supernatant collected (15 mL of PEG/NaCl to 50 mL of supernatant).Store this in a cold room at 4°C for 4–5 h, or overnight for better results.Spin the culture at 14,260 × g for 1 h at 4°C to allow the cells to settle down.Without disturbing the pellet, discard the supernatant and resuspend the pellet with 1× PBS, keeping it in 1.5 mL tubes.Centrifuge the microtubes at 16,200 × g for 10 min. In case a pellet is formed, transfer the supernatant into fresh tubes and store it at 4°C.The collected phage is to be used as an input in the next round of bio-panning by coating this on plate C instead of phage stock.Note: With each bio-panning round, decrease the antigen coating concentration (for example, round 1 with 5 μg/μL, round 2 with 3 μg/μL, and round 3 with 1.5 μg/μL) and calculate the TU of every input and output used during phage selection. SCREENING BY PHAGE ELISA Day 0: One day before performing ELISA For the phage selection process, grow the colonies of the last bio-panning round output. Inoculate the colonies formed during the last round of bio-panning output; each inoculation is done in 5 mL of 2× YT media containing 100 μg/mL ampicillin.Incubate for 30 min at 37°C without shaking. Wait until OD 600 of the culture reaches 0.4–0.6.Back up set:  At this step, take 200 μL of the culture of each clone and add 200 μL of autoclaved 50% (vol/vol) glycerol solution to make a stock and store at -80°C for future experimentsAdd 20 μL of helper phage.Incubate again for 30 min at 37°C with shaking.Add 50 μg/mL of kanamycin and incubate overnight at 30°C with shaking at 140–160 × g .",
    "Coat the 96 well assay plate with the required antigen with a concentration of 2 μg/μL. Do BSA coating as negative control and keep the plate overnight at 4°C (                Figure 4                ).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4450/bioprotoc-12-12-4450-g004.jpgFigure 4. Schematic representation of the steps involved in the Phage ELISA screening process. ELISA Next day, take the antigen-coated plate out of 4°C and wash once with PBS.Block the plate with 200 μL of 5% skim milk in PBS per well.Incubate the plate for 1 h at room temperature.Take all the colony inoculation out of the incubator and centrifuge the tubes at 3,900 × g for 20 min.After 1 h blocking, wash the ELISA plate three times with PBS (250 μL).Note: Blocking can be extended to 90 min if required, based on the timing of the parallel steps After 1 h of incubation, wash the plate three times with PBS.Then add 100 μL of primary antibody per well, i.e. , 50 μL of supernatant from all the centrifuged tubes and 50 μL of skim milk (diluted in 1:1).Incubate for 1 h at room temperature.Wash the plate with 250 μL of 0.1% PBST four times.Add 100 μL of secondary antibody per well (1:2,000). Follow with a 1 h incubation at room temperature in the dark.Wash the plate with 250 μL of 0.1% PBST six times.Add 100 μL of the substrate (TMB) to each well.Allow the reaction to take place for 15–20 min in the dark.To stop the reaction, add 50 μL of stop solution (2 NH2SO4 ) per well, and read the plate at 450 nm on a multimode ELISA reader.ISOLATION OF PLASMID DNA Identify the positive binding clones in Phage ELISA (at least four times more than the negative control).",
    "Take two FCTs and label them A and B; add 5 mL of 2× YT media to each FCT.Take B and add ampicillin (100 µg/mL) and C as negative control by adding kanamycin (50 µg/mL) in it.In FCTs A and B, inoculate from a glycerol stock that is preserved at -80°C.Incubate the FCT at 37°C with shaking for overnight growth.Next morning, check tubes A and B. Tube A culture should be turbid, and in tube B, there should be no growth.Spin down by centrifuging the culture at 2,820 × g for 15 min.For plasmid isolation, use the Qiagen Miniprep kit following the manufacturer’s instructions.Check the quality and concentration of the isolated plasmid DNA using a nanodrop spectrophotometer. The 260/280 ratio of the isolated DNA should be 1.8.Prepare a 0.8% Agarose gel and check the quality of the isolated plasmid DNA on the gel.Make a 10 μL aliquot of the plasmid DNA, and use LMB3 and PHEN sequencing primers for sequencing the scFv insert sequence.Soluble ELISA Perform ELISA as described in the phage ELISA section.Add 100 μL of purified scFv and incubate for 1 h at room temperature.Wash the plate three times with 0.1% PBST.Use a 1:1,000 dilution of primary antibody (anti-His tag) in 2% MPBS and incubate at room temperature.Wash three times with 0.1% PBST.Use 1:2,000 diluted anti-rabbit-HRP conjugated secondary antibody in 2% MPBS and incubate at room temperature, followed by washing, as mentioned above.Add 100 µL of TMB substrate and allow the color to develop. Once the color appears, add 8 NH2SO4  to stop the reaction.Read the plate at 450 nm in ELISA reader.DILUTION AND PLATING FOR TRANSDUCING UNIT (TU) CALCULATION imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4450/bioprotoc-12-12-4450-g005.jpgFigure 5. Representative image showing dilution preparation strategy for helper phage/library TU calculation. The plating of each dilution is done on a different plate containing ampicillin.",
    "Pour the mixture of phage and bacteria on a plate and spread slowly using a spreader. Label each plate with the dilution that it contains.Incubate the plates at 37°C for overnight growth. Next day, count the colonies for TU calculation (                Figure 5                ).CALCULATE TRANSDUCING UNIT TU = (No. of colony × 1000)/(10 × dilution). For a 10-8  dilution plate, we got nine colonies;Then the TU is calculated as: (9 × 1000)/(10 × 10-8 ) = 9 × 1010 PREPARATION OF COMPETENT CELLS Streak E. coli TG1 cells on an LB plate and allow cells to grow at 37°C overnight.Inoculate a single colony in 5 mL of LB media and grow overnight at 37°C.Subculture in 100 mL of LB by inoculating 1 mL of an overnight culture of E. coli , and grow at 37°C on a shaker until the O.D. at 600 nm reaches approximately 0.6.Cool culture on ice immediately, and harvest cells by centrifugation at 4,200 × g and 4°C for 5 min.Remove the supernatant carefully; remove any traces of supernatant by inverting the centrifuge tube on paper towels.Resuspend the bacterial pellet in 10 mL of ice-cold 0.1 M CaCl2  (autoclaved) and incubate on ice for 30 min.Recover cells by centrifugation as described above, resuspended in 5 mL of 0.1 M CaCl2 , and aliquot 200 μL of cells in microcentrifuge tubes.VECTOR DESIGN A representative strategy for vector design is shown in            Figure 6            .A set of designed PCR primers to replace TAG amber codon into TAA in the junction of the scFv-pIII junction is used for vector construction.Forward Primer: 5’CACATCATCATCACCATCACGGGTAATAAGAACAAAAACTCATCTC3’Reverse primer: 5’GAGATGAGTTTTTGTTCTTATTACCCGTGATGGTGATGATGATGTG3’.PCR Reaction setup:table:",
    "﻿0,1,2,3,4,5,6\nSteps,Initial Denaturation,Cycling 16×,Extension,Hold,,\nTemperature,95°C,95°C,52°C,72°C,72°C,10°C\nTime,2 min,30 s,50 s,4 min,5 min,∞\nThe PCR product is digested by Dpn 1 enzymetable:\n﻿0,1\nPCR product,20 µL\nDpn 1 enzyme,1 µL\nCut smart buffer,2.5 µL",
    "Incubate the reaction mixture at 37°C for 2 h. Tap the tube in between.Thaw two vials of competent cells from the -80°C freezer on ice for 5–10 min. DO NOT tap at this step.Add 5 µL of Dpn 1 digested product into one tube, and keep the other tube as blank or negative control. Incubate the cells on ice for 30 min.After 30 min, place both the tubes in the floater to heat shock for 60 s (at this step, set water bath at 42°C).Immediately place the tubes in ice for 5 min; at this step, pre-warm the media at 37°C.Add 900 µL of pre-warmed 2× YT medium to the cells in the tube.Incubate the tubes in the shaker for 60 min at 220 rpm to grow the cells.Take out the tubes from the shaker, aspirate 100 µL of cell suspension, and plate/spread on LB-Agar-ampicillin plates. Incubate plates in a 37°C incubator for 16 h or overnight.Next morning, take out the plates, count the colonies, and store at 4°C until further use.Add 5 mL of 2× YT supplemented with a standard concentration of ampicillin to five tubes. Pick a single colony for inoculation and culture of the colony obtained on the plates; incubate at 37°C with 220 rpm shaking. Incubate also one tube of media as a control.Next morning, isolate the plasmid DNA from all four tubes using the Qiagen plasmid isolation kit as per the manufacturer’s instructions.Check the quality of the isolated plasmid using a spectrophotometer by observing the 260/280 DNA ratio.Aliquot the DNA and send these samples for sequencing using vector-specific primers.Analyze the DNA sequence data for point mutations and mark the positive clones for further use. Discard the negative clones.Digestion of designed vector Reaction mixture for restriction digestion:table:\n﻿0,1\nComponent,Volume (μL)\nPlasmid DNA (250 ng·μL-1),10 μL",
    "10× CutSmart Buffer (NEB),5 μL\nNco I-HF (NEB),2 μL\nNot I-HF (NEB),2 μL\nNuclease free water,31 μL\nIncubate the reaction at 37°C for 2 h.After 2 h, add 10 μL of 5× gel loading dye and run the sample on a 0.8% Agarose gel, at 100 V for approximately 60 min.Cut and excise the digested vector DNA from the agarose gel using a sharp surgical blade. Place the excised fragment in a 1.5 mL Eppendorf tube. Purify the digested vector from the excised DNA using the Qiagen Gel extraction kit as per the manufacturer’s protocol.Evaluate the quality of the purified digested vector DNA using the spectrophotometer by calculating the 260/280 ratio. This purified vector is used for future cloning reactions.Digestion of scFv clones The phage ELISA binding positive clone that showed no binding in soluble ELISA was further used to isolate plasmid DNA from single colonies, as described in this section.The digestion reaction is set up as described below:table:\n﻿0,1\nComponent,Volume ( μL)\nPlasmid DNA (250 ng·μL-1 ),10 μL\n10× CutSmart Buffer (NEB),5 μL\nNco I-HF (NEB),2 μL\nNot I-HF (NEB),2 μL\nNuclease free water,31 μL",
    "After 2 h add 10 μL of 5× gel loading dye and run the sample on a 1% Agarose gel, at 100 V for approximately 40–60 min.Two bands should be observed in the agarose gel, one band size of approximately 4 kb corresponding to vector DNA and another of 800 bp corresponding to scFv DNA.Excise the agarose gel slice containing the relevant DNA Fragments (scFv insert 800 bp) and remove extra agarose to minimize the gel slice.Transfer the gel slice into a microcentrifuge tube and purify using the Qiagen gel extraction kit as per the manufacturer's instructions.Use this purified scFv DNA for cloning into a newly designed vector.Cloning of scFv DNA into newly designed vector table:\n﻿0,1\nComponent,Volume ( μL)\nscFv DNA insert,10 μL\nDesigned vector,5 μL\n10× Ligase buffer,2 μL\nLigase,2 μL\nNuclease free water,31 μL",
    "Incubate the ligation reaction mixture at room temperature for 4–6 h. Alternatively, this can be kept at room temperature overnight.After 4–6 h incubation, thaw the TG1 competent cells on the ice for 5 min.Add 5 μL of ligation mixture to one tube and keep the second tube without insert and/or ligation mixture as a negative control.Heat-shock the cells for 60 s and immediately keep on ice for 5 min.Add 900 μL of 2× YT medium and incubate the tubes in a shaker incubator at 37°C for 1 h.After 1 h, centrifuge the tube at 2,400 × g for 5 min. Decant the supernatant and resuspend the pellet in reaming leftover media. Plate this on pre-warmed 2× YT-Agar plates supplemented with ampicillin, or optionally you can use LB-Agar plates with ampicillin.Incubate the plates in a 37°C incubator overnight or 12–16 h.Next morning, count the colonies on the reaction plate. NO COLONIES should be there in the control plate; otherwise, repeat the experiment with all new and freshly prepared reagents.Inoculate the single colony in 5 mL of 2× YT containing a standard concentration of ampicillin in two 50 mL FCTs. Label one tube as reaction and the other as blank, and incubate both tubes in a shaker incubator (200 to 220 rpm) at 37°C overnight.Transfer a small inoculum (approximately 4 mL) from the overnight primary culture to a 2 L flask (400 mL media) 2× TY containing 100 μg/mL ampicillin and 0.1% glucose. Grow shaking (250 rpm) at 37°C until the OD600 is approximately 0.9 (approximately 3 to 3.5 h).Once the OD of the culture reaches 0.9, add isopropyl β-D-thiogalactoside at a final concentration of 1 mM IPTG. Continue shaking (250 rpm) at 30°C overnight.Harvest the cells by centrifugation at 4,000 × g for 15 min.",
    "Store the cell pellet at -20°C if desired or process immediately.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4450/bioprotoc-12-12-4450-g006.jpgFigure 6. Schematic representation of the modified vector design strategy. Diagram depicting a modified method for soluble expression of scFv genes with amber stop codons. The amber stop codon (TAG) between the scFv-pIII gene in the original vector is altered to TAA, which prohibits the creation of scFv-pIII fusion proteins. The scFv genes are cloned directly into the modified vector using the same restriction site Nco1/Not1 that is used to clone the scFv gene into the original vector (Perween et al. , 2021a).Resuspension of cell pellet and cell extract preparation Adjust pH to 8.0 using NaOH.Resuspend the pellet in 30 mM Tris-HCl, 20% (wt/vol) sucrose, pH 8.0, at 80 mL/gram of wet weight. Incubate on ice and add 500 mM EDTA dropwise to a final concentration of 1 mM; then incubate the cells on ice for 20 min with gentle agitation.Clarify the cell suspension by centrifuging at 8,000 × g and 4°C for 20 min.Collect the supernatant and resuspend the cells in the same volume of ice-cold 5 mM MgSO4 and incubate on ice for 20 min with gentle agitation.Centrifuge the cells at 8,000 × g and 4°C for 20 min. Collect the supernatant (supernatant is osmotic shock fluid containing periplasmic proteins) and dialyze extensively against lysis buffer.Filter the dialyzed supernatant through a 0.2 μm filter before continuing with the purification. Equilibrate the resin with lysis buffer (50 mM NaH2PO4 , 300 mM NaCl, 10 mM Imidazole, and pH = 8.0) prior the use of the Ni++ ions.Purification OfscFvs For purification, use Ni-NTA beads; add 5 mL of 50% slurry of Ni-NTA-Agarose resin in a purification column and allow the beads to settle down.Wash the beads using MilliQ (MQ) water; add 10 column volume (CV) of MQ.",
    "Use 10 CV of binding buffer (20 mM Tris; pH = 7.2, 500 mM NaCl and 10 mM Imidazole) to equilibrate the column. Thus, the same pH and buffer composition as that of the Ni++ ion resin ensuring that the sample binds properlyAdd the filtered supernatant into the column and allow it to pass through gravitational force.After the supernatant has been passed, wash the column to remove any impurity. Add 20–30 CV of washing buffer (20 mM Tris; pH = 7.2, 500 mM NaCl, and 25 mM Imidazole).Elute the bound protein from beads, and use 5–6 CV of elution buffer (20 mM Tris pH = 7.2, 500 mM NaCl, and 500 mM Imidazole). Analyze the protein quality in terms of purity on a 15% Tri-glycine SDS-PAGE.Dialyze the protein using activated dialysis tubing, clip both the ends of the tube tightly, and put it in a beaker containing cold PBS. With the help of a magnetic stirrer, allow it to spin overnight at 4°C in a cold room.Mount the Superdex75 Increase column in AKTA FPLC system. Wash the pump thoroughly with PBS.Use 2 CV of PBS to equilibrate the column; load approximately 500 μL of the purified concentrated protein through the loop with 0.5 mL of fraction volume.Collect the different factions and analyze through SDS PAGE. Store the protein at -80°C in aliquots for further use. Mix 30 µL of sample with 5× SDS gel loading dye (6 µL). Heat the sample for 10 min at 100°C before loading."
  ],
  "subjectAreas": [
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}