{
  "id": 7119,
  "origin_website": "Bio",
  "title": "Rapid and Simplified Induction of Neural Stem/Progenitor Cells (NSCs/NPCs) and Neurons from Human Induced Pluripotent Stem Cells (hiPSCs)",
  "procedures": [
    "Figure 1 shows the schematic diagrams for neural differentiation using human iPSCs via NSCs/NPCs.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3914/bioprotoc-11-03-3914-g001.jpgFigure 1. Schematic diagrams of neural induction (for NSCs/NPCs and neurons) from human iPSCs. Time points of differentiation, corresponding steps, and culture conditions are shown. A. NSCs/NPCs induction from iPSCs (days -1-7). B. Neuronal differentiation from NSCs/NPCs (neuronal day 0: N0-N56). The preparation of human iPSCs for neural differentiation (~day -1)Before using, disinfect the working area inside a biological safety cabinet by exposing it to UV light for 1 h, and wipe out tools and supplies used in the cabinet with 70% ethanol.Start with high-quality human iPSCs (with no differentiated colonies) grown on cell feeder of mitomycinC-treated MEF in iPSC medium (Recipe 1) on a 100-mm dish (Figure 2A). iPSCs are passaged every 3-7 days when they reach 70-80% confluence.Notes: If you recognize differentiated colonies of iPSCs, remove the differentiated areas using a glass pasteur pipette or 200 μl pipette tip under an inverted microscope kept in the biological safety cabinet. The efficiency of successful neural induction depends on the quality of iPSCs. Therefore, we recommend that you examine several iPSC lines for neural differentiation. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3914/bioprotoc-11-03-3914-g002.jpgFigure 2. Representative phase-contrast images of cells during neural differentiation from iPSCs into NSCs/NPCs. A. Undifferentiated iPSC colonies kept on MEF feeder cells before starting neural induction. B. iPSC colonies on a Geltrex-coated well on the day of starting the induction. C. Day 7 of successful neural induction, P0 NSCs/NPCs displaying uniform and compact morphology are ready to be harvested and expanded. D. Day 7 of failed neural induction. The cell population consists of flat non-neural cells with a heterogeneous morphology (indicated by red arrows) and compact NSCs/NPCs (indicated by blue arrows). To purify, it is required to pick up the compact NSCs/NPCs. E.",
    "P1 NSCs/NPCs at 24 h after the harvest and a passage of P0 NSCs/NPCs. F. P2 NSCs/NPCs show uniform morphology and grow in a honeycomb-like structure. Scale bars, 500 μm.Precoat wells of a 6-well plate with 1 ml Geltrex and incubate in a 37 °C, 5% CO2 incubator for at least 1 h.When iPSCs culture reaches 70-80% confluence, detach iPSC colonies with collagenase IV solution. i.e., aspirate the iPSC medium, wash once with 5 ml of PBS, and add 4 ml of collagenase IV solution to the cell colonies.Incubate the cells with collagenase IV solution in a 37°C, 5% CO2 incubator for 30 min.Note: If necessary, incubate 10-15 min longer but do not exceed 60 min to prevent the reduction of cell viability. When edges of the colonies start to roll up, remove the collagenase IV solution and add 10 ml iPSC medium to dilute and wash out collagenase IV.Collect the detached colonies (after gentle rinsing with the iPSC medium using a 10 ml pipette) into a 15-ml conical tube.To remove MEF feeder cells, leave the tube containing cell suspension to stand for 10 min. Then, aspirate the supernatant containing MEF without disturbing the iPSC pellet.Note: iPSC colonies settle to the bottom by gravity, while MEF single cells do not. Add a 6 ml iPSC medium to generate cell suspension and follow the following Steps A9a-A9d to estimate a cell concentration.Transfer a portion of the suspension (1 ml) to a new 15-ml conical tube.Centrifuge the 15-ml conical tube from 9a at 200 × g for 3 min and aspirate the supernatant.To dissociate iPSC clusters into single cells, add 1 ml of Accutase to the 15-ml conical tube, followed by incubation for 5 min at 37 °C.",
    "After pipetting the cells up and down, perform a cell count via your preferred method (e.g., Trypan blue exclusion method).Aspirate the Geltrex coating buffer from Step A3 and add 2.5 ml iPSC medium into a coated well of 6-well plate.Gently shake the conical tube containing the iPSCs suspension from Step A9, and plate the cells on the well at 2.5 × 105-3 × 105 cells/well.Note: iPSCs for neural differentiation should be prepared as clusters. Single iPSCs will not survive in the present protocol. Add Y27632, a ROCK inhibitor, to the cell suspension in the well to a final concentration of 10 μM.Rock the plate gently in a back-and-forth and side-to-side fashion to distribute the cells evenly.Note: Do not swirl the plate as this will cause uneven distribution of the iPSC clusters. Place the plate and incubate the cells in a 37 °C, 5% CO2 incubator overnight.The induction of iPSCs into neural stem/neural progenitor cells (NSCs/NPCs) (days 0-7)On the next day (day 0) (Figure 2B), aspirate iPSC culture medium on the plate and add 2.5 ml prewarmed Neural Induction Medium (NIM; Recipe 2) to the well of the 6-well plate. Then, return the plates to the incubator.On day 2, change the medium with 2.5 ml of prewarmed fresh NIM per well.On day 4, change the medium with 2.5 ml of prewarmed fresh NIM per well.On day 6, change the medium with 2.5 ml of prewarmed fresh NIM per well.On day 7, NSCs/NPCs (identified passage 0; P0) are ready to be harvested and expanded (Figure 2C).Note: The differentiated cells' morphology should be uniform and compact when NSCs/NPCs are successfully induced. Expansion and cryopreservation of the NSCs/NPCs (day 7~)Confirm that the morphology of resultant NSCs/NPCs is in a homogenous and compact shape.",
    "If you observe flat non-neural cells with a heterogeneous morphology (red arrows in Figure 2D), follow the following Steps C2a-C2g to purify the NSCs/NPCs from the non-neural cells.Precoat a well of 6-well plates with Geltrex in the same manner as described above.Aspirate the Geltrex from Step C1a and add 2.5 ml prewarmed Neural Expansion Medium (NEM; see Recipes) containing 5 μM of Y27632 into a coated well of 6-well plate.Under an inverted microscope in the biological safety cabinet, pick the compact-shaped NSCs/NPCs (blue arrows in Figure 2D) by physically scratching them using a 20 μl pipette tip.Transfer the cells to the well containing NEM from Step C1b.Repeat Steps C1c-C1d several times to collect NSCs/NPCs in the well.Note: There is no minimum or maximum number of compact NSCs/NPCs, which can be transferred in one well; however, we recommend you collect cells as many as you can. Rock the plate gently in a back-and-forth and side-to-side fashion to distribute the cells evenly and place the plate in a 37 °C, 5% CO2 incubator.After overnight incubation, change to fresh NEM without Y27632 and return the plate to the incubator and incubate NSCs/NPCs for one more day.The next day, confirm that the morphology of the cells is in a homogenous and compact shape.Precoat wells of 6-well plates with Geltrex in the same manner as described above.Aspirate medium from the well containing the NSCs/NPCs and gently add 2 ml of PBS to rinse the cells.Aspirate PBS; then, add 1 ml Accutase to each well of the 6-well plates and incubate at 37 °C for 5 min to detach the cells from the wells' surface.",
    "After adding 1 ml of PBS to the well of the 6-well plates, transfer the cell suspension to the 15-ml conical tube followed by gentle pipetting of the cell suspension up and down 3 times to disrupt the cell clumps.Centrifuge the tube at 300 × g for 5 min.Aspirate the supernatant, resuspend the cells in 3 ml PBS, and centrifuge the cells at 300 × g for 5 min.Aspirate the supernatant and resuspend the cells in 1 ml prewarmed NEM.Perform the cell count via your preferred method (e.g., Trypan blue exclusion method).Dilute the cell suspension with prewarmed NEM to 2 × 105-4 × 105 cells/ml.Aspirate the Geltrex from Step C2 and plate 2.5 ml of the cell suspension into the well (2.5 × 105-3 × 105 cells per well).Add Y27632 to the cell suspension to a final concentration of 5 μM.Rock the plate gently in a back-and-forth and side-to-side fashion to distribute the cells evenly.Note: Do not swirl the plate to prevent an uneven distribution of the cells. The next day, aspirate the culture medium on the plate and add 2.5 ml prewarmed fresh NEM without Y27632 to the well of the 6-well plate. The cells' culture medium has to be changed with 2.5 ml of fresh prewarmed NEM every other day.When NSCs/NPCs reach confluence, they can be further expanded by following Steps C2-C14 above, cryopreserved, differentiated to neurons or analyzed by immunofluorescence (Figure 3).Notes: It is of great importance to passage the cells at a density of 0.5 × 105-1 × 105 cells/cm2 (2 × 105-4 × 105 cells/ml) since they easily lose their multipotency to differentiate to neuron/glial cells if they are grown at low density. On passaging, we recommend you apply Y27632 to the medium to prevent cell death.",
    "Y27632 should be removed by replacing fresh medium the next day. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3914/bioprotoc-11-03-3914-g003.jpgFigure 3. Immunofluorescence staining of NSCs/NPCs with antibodies for neural stem cell markers. iPSC-derived NSCs/NPCs (P1) are immunostained with anti-SOX1 (green), anti-NESTIN (red) (A), and anti-PSA-NCAM (green), anti-PAX6 (red) antibodies (B). Cell nuclear was identified by Hoechst staining (blue). Scale bars, 200 μm.When NSCs/NPCs are ready to be cryopreserved, they can be detached by following Steps C3-C9 above. After that, make cell suspension in NSC freezing medium (see Recipes) at 2 × 106-4 × 106 cells/ml, and dispense 1 ml cell suspension into each cryovial and freeze cells at −80 °C overnight. If necessary, transfer the frozen vials to a liquid nitrogen storage tank after the vials have been frozen for at least 24 h.The differentiation and maturation of neurons from the NSCs/NPCs (neuronal day 0: N0-N56)Before starting neuronal differentiation, precoat the surface of glass bottom dishes with 0.2 ml polyethylenimine (PEI) solution (2.8 × 102 μM; Recipe 5) and incubate overnight at room temperature.On the day of starting neuronal differentiation (day N0), wash the PEI-coated dishes with autoclaved water at least 5 times. Until use, keep the surface of the dishes covered with water after the final wash step.Notes: An extensive washout of the remaining PEI solution is necessary to reduce the cell toxicity by excess PEI. The PEI-coated dishes can be stored at room temperature for up to 2 days. Aspirate medium from the well of the 6-well plates containing NSCs/NPCs and gently add 2 ml of PBS to rinse the cells.Aspirate PBS. Then, add 1 ml Accutase to each well of the 6-well plates and incubate at 37 °C for 5 min to detach the cells from the wells' surface.",
    "After adding 2 ml of PBS to the well of the 6-well plates, transfer the cell suspension to the 15-ml conical tube followed by gentle pipetting of the cell suspension up and down 3 times to disrupt the cell clumps.Centrifuge the tube at 300 × g for 5 min.Aspirate the supernatant, resuspend the cells in 3 ml PBS, and centrifuge the cells at 300 × g for 5 min.Aspirate the supernatant and resuspend the cells in 1 ml prewarmed Neuronal Medium (NM; Recipe 6).Perform the cell count using your preferred method (e.g., Trypan blue exclusion method).Dilute the cell suspension with prewarmed NM to 5 × 105 cells/ml (0.2 ml is needed for a well of the glass-bottom dish).Aspirate the water on the PEI-coated dishes from step 2 and plate 0.2 ml of the cell suspension on each dish (1 × 105 cells per dish: 1 × 105 cells/cm2).Add Y27632 to the cell suspension to a final concentration of 5 μM.Rock the dishes gently in a back-and-forth and side-to-side fashion to distribute the cells evenly.Note: Do not swirl the dishes to prevent an uneven distribution of the cells. Place the cell dishes in a 37 °C, 5% CO2 incubator overnight.The next day, aspirate the culture medium and add 2 ml prewarmed fresh NM without Y27632 to the dishes. Return the dishes to a 37 °C, 5% CO2 incubator.Until day N28, half of the medium (1 ml) for the cells must be changed carefully and gently with fresh prewarmed NM twice a week.Note: The differentiated neurons are easy to be detached from the surface of the dishes by physical force such as moving the dish and removing medium; therefore, extreme care must be taken when performing medium change operation.",
    "After 4weeks of neuronal differentiation (day N28), change half of the medium with Neuronal Maturation Medium (NMM; Recipe 7).Continue to change half the medium with fresh NMM once or twice a week for further 4 weeks (at least until day N56) for neurons' maturation.After 4weeks of neuronal maturation (day N56~), the neurons are ready to be analyzed by immunofluorescence (Figure 4) and functional assays such as FM1-43 exocytotic imaging.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3914/bioprotoc-11-03-3914-g004.jpgFigure 4. Immunofluorescence staining of neurons differentiated from NSCs/NPCs. iPSC-derived neurons are immunostained with anti-Tuj1 (red) (A), and anti-MAP2 (green) antibodies (B). Cell nuclear was also stained with Hoechst (blue). Scale bars, 200 μm.Immunofluorescence (Video 1)Aspirate the culture medium without dislodging the cells.Note: The differentiated cells, especially neurons, are easily detached from the dishes' surface by physical force; therefore, extreme care must be taken when adding and removing buffers. Fix the cells with 4% Paraformaldehyde Phosphate Buffer Solution at room temperature for 15 min.After aspirating the paraformaldehyde solution, rinse the cells 3 times with PBS.Permeabilize the cells with 0.1% Triton X-100 in PBS at room temperature for 10 min.After aspirating the permeabilization buffer, block the cells with 5% BSA in PBS at room temperature for 60 min.After aspirating the blocking buffer, immunostain the cells with primary antibodies diluted in blocking buffer overnight at 4 °C. Anti-SOX1 (rabbit; dilution 1:100), anti-NESTIN (mouse IgG; 1:500), anti-PSA-NCAM (mouse IgM; 1:400) and anti-PAX6 (rabbit; dilution 1:1,000) antibodies are used for NSCs/NPCs, and anti-Tuj1 (mouse IgG; 1:500), anti-MAP2 (rabbit; 1:500) antibodies for neurons, respectively.After aspirating the primary antibodies, wash the cells with PBS 3 times to rinse off the non-binding primary antibodies.Incubate the cells with relevant fluorescence-labeled secondary antibodies diluted in PBS at room temperature for 60 min in the dark.",
    "Alexa 488-conjugated anti-rabbit IgG (1:1,000), Alexa 488-conjugated goat anti-mouse IgM (1:1,000), Alexa 594-conjugated donkey anti-rabbit IgG (1:1,000), and Alexa 594-conjugated anti-mouse IgG (1:1,000) are used.After aspirating the secondary antibodies, wash the cells with PBS 3 times to rinse off the non-binding secondary antibodies, and in the last wash, counterstain the nuclei with Hoechst 33258 (1 μg/ml).Analyze the cells on a fluorescence microscope.<p>imgsrc:https://bio-protocol.org/javascript:;</p> Video 1. Immunofluorescence Tutorial. In this tutorial, we cover the basics of immunostaining cells with primary and fluorescence-labeled secondary antibodies.Functional analysis of mature neurons with FM1-43 fluorescent dye.Remove the neurons' culture medium maintained on the glass-bottom dish using a 1,000 μl-micropipette without dislodging the cells.Note: It is important to use the micropipette for removing the medium. Do not use an aspirator as it can damage the neurons during the process. Gently wash the cells once with 200 μl prewarmed Artificial Cerebrospinal Fluid (ACSF; Recipe 8) using a 1,000 μl-micropipette without dislodging the cells.Incubate the cells with 200 μl ACSF containing 5 μM of FM1-43 for an hour in a 37 °C, 5% CO2 incubator.Remove the FM1-43 solution using 1,000 μl-micropipette without disturbing the cells.Gently wash the cells 3 times with 200 μl prewarmed ACSF using 1,000 μl-micropipette without dislodging the cells, as described in step2.Immerse the cells with 2 ml fresh ACSF without FM1-43.Analyze the FM1-43 intensity of the cells on a fluorescence microscope (Leica).Note: FM1-43 should be excited using a 488 nm (wavelength) blue light laser and its emission (520 nm) is acquired every second as a series of images through a ×40 objective lens. For analysis, the quenching of FM1-43 caused by the treatment with high potassium (KCl) solution at 50 mM can be considered an exocytotic activity. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e3914/bioprotoc-11-03-3914-g005.jpgFigure 5. Functional analysis of human neurons with FM1-43 fluorescent dye.",
    "Mature neurons were used for functional analysis with FM1-43 imaging, a powerful tool to determine exocytotic activity. A. Bright and fluorescent images of neurons loaded with FM1-43 dye before the stimulation to induce cell depolarization. B. 60 s after the stimulation. Scale bars, 25 μm. C. The time-course of the intensity of FM1-43 fluorescence before and after the stimulation. The reduction of FM1-43 intensity can be recognized as an exocytosis. A high KCl solution (final 50 mM) was added to evoke the cell depolarization."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Stem Cell"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}