{
  "id": 19508,
  "origin_website": "Jove",
  "title": "Topographical EEG Recordings of Visual Evoked Potentials in Mice using Multichannel Thin-film Electrodes",
  "procedures": [
    "All animals were handled and housed according to German (TierSchG, BGBl. I S. 1206, 1313) and European Union (ETS 123; Directive 2010/63/EU) guidelines for animal research. The animal experiments were approved by German state authorities (Lower Saxony State Office for Consumer Protection and Food Safety, LAVES) and were monitored by the university animal welfare officer. A 3-month-old male C57BL/6J mouse was used for the present study.\n1. Animal details\nPerform the VEP measures in mice adequate for the particular research question.\nBe aware of mouse strain peculiarities in physiology that can impact the experiment by altered anesthetic sensitivities, seizure susceptibility, age, or genetic background.\n\t​NOTE: Mouse strains with different genetic backgrounds may often develop other sensory impairments (e.g., C57BL/6 progressive hearing loss), which might go unnoticed but indirectly affect visual processing (e.g., cross-modal influences19).\n2. Induction of general anesthesia\nPrepare a surgical field at the recording site. Determine the pre-surgical weight of the mouse.\nInduce anesthesia with ketamine/xylazine, i.p., with a dosage of 100 mg/kg ketaminehydrochloride, 4 mg/kg xylazinhydrochloride, and 5mg/kg carprofen (see Table of Materials).\nImmediately after injection, place the mouse back in the cage.\nPlace an infrared heating lamp (see Table of Materials) at an adequate distance and wait for full induction of general anesthesia for at least 5 min.\nObserve the stopping of spontaneous movements and loss of the righting reflex. Check for loss of the toe-pinch reflex.\n3. Physiological monitoring and maintenance of general anesthesia\nTransfer the mouse to the recording site onto a heating pad.\nUse a rectal temperature probe attached to a temperature control system to keep the core body temperature at 37.6-37.8 °C.\nEnsure optimal body temperature of the mouse. In addition to the heating pad, minimize heat loss by increasing room temperature if required.",
    "Place two subcutaneous silver wire electrodes (0.2 mm diameter, see Table of Materials) near the right shoulder and left hind leg for ECG monitoring.\nAttach the silver wire ECG electrodes to the ECG amplifier.\nMonitor heart rate and ECG waves on an oscilloscope (see Table of Materials) during the experiment.\n\tNOTE: During adequate ketamine/xylazine anesthesia, heart rate can range between 160-250 bpm32,33. Heart rate can vary depending on mouse strain, age, and physiological status.\nCheck the toe-pinch reflex and vital signs. The absence of the toe-pinch reflex response indicates a sufficient level of anesthesia.\nMonitor the status and quality of the eyes during the procedure closely, and apply ophthalmic drops or gel.\nMonitor adequate anesthesia levels by regularly checking physiological parameters, heart rate, reflexes, and EEG activity.\nIf the general anesthesia level gets too light, apply an additional dose of ketamine/xylazine (i.p.).\nProceed fast with the experimental steps to minimize the duration of general anesthesia and the number of subsequent doses of additional ketamine/xylazine used to maintain general anesthesia.\n4. Electrode placement and recording setup\nAt the recording site, reassess adequate anesthetic depth by checking the toe-pinch reflex.\nShave the top of the head with an electric shaver.\nTo allow a free visual field, do not fixate the mice in a stereotactic frame during the experiment.\nApply lidocaine (if additionally required by your local institutional guidelines for animal care).\nMake a 1 cm midline incision of the scalp.\nRetract the skin to both sides using small vessel clamps to hold the skin in place and to expose the skull.\nClean the surface of the skull with a cotton swab and saline NaCl (0.9%).\nAttach a silver wire reference electrode (diameter 0.2 mm) for the EEG subcutaneously above the nose (nose reference) or behind the ear (mastoid).",
    "Connect the nose reference via the probe connector to the headstage (see Table of Materials) reference output.\nNext, attach the EEG electrode to the headstage using an adapter attached to the headstage via a probe connector and attached to an electrode holder (see Table of Materials).\nPlace the multichannel thin-film EEG electrode (see Table of Materials) on the skull with bregma as a reference position to ensure a standardized electrode position for each experiment.\nUse a drop of saline to adjust the electrode's position. While the skull surface is still wet, the electrode is easily movable. Then, dry the skull carefully with a cotton swab. \nWait until the saline solution dries and the electrode firmly attaches to the skull.\nCover the electrode with a small drop of silicone oil to avoid the adherence of the electrode to the overlying skin. This step helps to easily remove the electrode after the recording.\n\tNOTE: Be careful not to apply too much silicone oil to avoid deteriorating the contact of the electrode with the skull.\nClose the skin over the electrode for protection and to minimize electrical noise.\nApply a small drop of tissue adhesive (see Table of Materials) to the skin to prevent the reopening of the skin incision.\n5. EEG recording and VEP measurement\nFilter EEG signals during acquisition with a wide filter between 1-9000 Hz. Use wide filter settings for the control of artifacts. Perform noise and adequate filtering later during offline processing.\nCheck the signal quality of the ongoing EEG activity by checking for high-frequency electrical noise, 50/60 Hz artifacts, and ECG artifacts. Apply adequate ground and reference connections to the animal and equipment or apply adequate shielding.",
    "Check anesthesia depth by observing EEG activity. Try to avoid a 'too deep' anesthesia state which is characterized by the occurence of burst-suppression EEG activity. Consider the experiment's time course and ensure that anesthesia does not get too light during the recording.\nUse an LED stroboscope (or other types of visual stimulation) to produce ultra-short flashes (see Table of Materials) (Figure 1).\nPlace the stroboscope at a 30 cm distance for binocular visual stimulation in front of the mouse.\n\tNOTE: The mouse and stroboscope are placed in a dark and soundproof chamber during the experiment.\nAdapt the mice to the dark for 5 min before stimulation.\nElicit stroboscope flashes by triggering the stroboscope with a TTL pulse.\n\tNOTE: A stimulation artifact can occur due to the high voltage of the stroboscope. This can be attenuated by increasing the distance or shielding the electrode.\nGenerate hardware TTL triggers with a multifunction I/O device (see Table of Materials) controlled by a stimulation PC to trigger the light source (i.e., stroboscope).\nSend TTL signal in parallel to the acquisition system to provide high-precision timestamps for the stimulus onset.\nSend TTL output, which is synchronized with the flash, from the LED stroboscope as feedback and as a second control for accurate stimulus onset trigger timestamps. Register this together with the recordings.\nSet the stimulus rate (e.g., inter-stimulus interval = 2 s). Set the number of stimulus repetitions (e.g., n = 150 repetitions)\nAdjust the intensities manually on the stroboscope (e.g., flash duration of 512 µs at a fixed value of 3000 lm).\n\tNOTE: This, however, has to be adapted to the specific experimental question.\nStart the stimulus presentation, record the EEG signals with recording software (see Table of Materials), and save the data on the recording PC.",
    "6. Completion of the experiment, electrode removal, and electrode cleaning\nIf the recording is part of a longer protocol, continue with further experimental steps.\nAt the end of the experiment, euthanize the animal according to institutional guidelines23,34.\nRemove the EEG electrode with care (since they can be reused).\nSlowly with the application of fluid remove the electrode from the skull.\n\t​NOTE: The electrodes can stick to the surface of the skull; avoid damage to the platinum sites during removal.\nClean the electrode after the experiment with isotonic saline NaCl (0.9%) and immerse it in a protein remover and disinfecting solution (see Table of Materials) for 30 min.\nStore the electrode array in a dry, protected place.\n7. Basic VEP signal processing: Time and frequency domain\nImport the raw data files into the analysis software (see Table of Materials).\nFilter EEG signals with a Butterworth bandpass zero-phase filter between 1-100 Hz.\n\tNOTE: Select adequate filter types and parameters depending on the respective research question27,35,36.\nDownsample the signals to 1000 Hz.\nSegment the EEG signals into trials and average the trials to yield visual evoked potentials and determine the N1 peak latency.\n\tNOTE: Re-referencing can be performed offline if necessary (e.g., common average referencing, bipolar referencing, local average \"Laplacian\" referencing)23.\nDetermine the voltage values at specific time points of interest and plot voltage distribution maps using the analysis software.\nCalculate global field power37 by calculating the spatial standard deviation of all the electrode channels.\nCalculate a multi-taper time-frequency spectrogram with Chronux Toolbox28,31. Use a bandwidth product TW = 3 and K = 5 tapers with a 300 ms window size and 30 ms step size.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}