{
  "id": 3434,
  "origin_website": "Cell",
  "title": "Protocol for multispectral imaging on cryosections to map myeloid cell heterogeneity in its spatial context",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nCutting of sequential tissue sections\nTiming: 1 h to several days\nThe first step describes sample preparation and storage of the tissue sections. The estimated time for cutting depends on the cohort size and experience.\nTissue collection and sectioning.\nCollect fresh, unfixed tissue samples.\nPlace the tissue, with the cutting plane down, in a labelled cryomold and add OCT compound until the tissue is completely covered.\nTransfer the cryomold into a dry ice-cooled container of isopentane and let it float until the OCT has solidified.\nStore the cryomold on dry ice until all samples are collected and store them at −80°C in sealed bags or wrapped in aluminum foil to minimize drying out.\nCut 7 μm thick cryosections (e.g., with Cryostat, CM 3050, Leica) and collect them on sequential microscopy slides.\nNote: Sequential cutting will furnish flanking tissue sections, positioned on consecutive slides, to enable complementary analyses to the multispectral image, such as immunohistochemistry, mass spectrometry or spatial transcriptomics.\nDry the slides in a desiccator for several hours at room temperature (at around 20°C) before storing them at −80°C (for up to several months).\nCritical: It is important to air-dry the tissue sections completely before freezing to prevent tissue damage through crystallization.",
    "Critical: For mass spectrometry imaging, conductive indium tin oxide (ITO) slides are used to mount the tissue sections. The use of OCT medium for embedding is not advisable as residues of OCT may remain on the tissue sections and cause analyte signal suppression in mass spectrometry imaging through competition with tissue compounds for ions during the ionization process.3[href=https://www.wicell.org#bib3] Instead, tissue sections can be cut from non-embedded snap frozen tissue. Cut tissue sections on ITO slides should be kept at −20°C and not be dehydrated. For spatial transcriptomics, continue with specific slides and/or collect tissues in a confined area of the slide, as recommended by the respective manufacturer.\nAntibody titration and the composition of a spectral library\nTiming: 2 days\nThis section describes the preparation steps for multispectral imaging. It details how the fluorescent emission spectrum for each individual fluorochrome must be recorded on tissue sections single-stained with correspondingly labelled antibodies to compose a spectral library. In Figure 1[href=https://www.wicell.org#fig1], the principle of multispectral imaging and spectral unmixing can be observed, while Table 1[href=https://www.wicell.org#tbl1] shows the filter setup used by Goossens et al.,1[href=https://www.wicell.org#bib1] which can still be further adapted to the users’ preferences. When combining a set of fluorochrome-coupled antibodies for multispectral imaging only dyes should be included that are excited by a similar electromagnetic wavelength but whose emissions have different peak intensities and limited spectral overlap.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3011-Fig1.jpg\nFigure 1. Principle of multispectral imaging and spectral unmixing\nThe tissue section is incubated with a set of dye-coupled antibodies and subsequently imaged using the Nuance FX camera. Spectral unmixing of the composite image will produce an image cube containing the spectral contributions of each dye to the composite image. Using a spectral library, this image cube can be deconvoluted into single grayscale images, each representing one spectral component (dye).\ntable:files/protocols_protocol_3011_1.csv",
    "Fix, block and optionally bleach cryosections.\nThaw and air-dry cryosections.\nFix 5 min with dry acetone.\nImmerse slides in blocking buffer.\nOptional step: Overnight exposure slides in blocking buffer to high-power near-UV light in a cold room (4°C), as we previously described.1[href=https://www.wicell.org#bib1] An alternative bleaching method is detailed in the troubleshooting[href=https://www.wicell.org#troubleshooting] section (problem 2[href=https://www.wicell.org#sec6.3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3011-Fig2.jpg\nFigure 2. Bleaching of tissue autofluorescence and subsequent immunofluorescent imaging of atherosclerotic plaque tissue\n(A) Schematic representation of the custom-designed bleaching box, as previously described by us.1[href=https://www.wicell.org#bib1] This box features a mounting plateau that can accommodate up to 12 tissue slides (orange); near-UV (400 nm) light (purple) by 4 rows of 7 high-power (3 W) LEDs (yellow), evenly distributed over the box; two power sources (green), and both active (fans) and passive (fins) cooling units to prevent the LEDs and tissue sections from overheating. Figure reprinted with permission from Goossens et al., 2022.1[href=https://www.wicell.org#bib1]\n(B) Screenshot of the Nuance 3.0.2 software (PerkinElmer), with a spectral library on the left and unmixed images of an image cube representing the spectral library’s individual markers’ fluorescent emission patterns on the right.\nCritical: In tissues with high autofluorescence, such as liver, brain, and vasculature, we recommend an autofluorescence bleaching step prior to staining. This could for instance be done via the custom-designed bleaching box, depicted in Figure 2[href=https://www.wicell.org#fig2]A which proved very effective to reduce tissue autofluorescence, increasing the stainings’ signal-to-noise ratio and thereby facilitating spectral unmixing.1[href=https://www.wicell.org#bib1] This measure makes multispectral imaging also suitable for analysis of previously challenging tissues where high levels of autofluorescence competed with the dyes’ signal.\nFluorescent staining.\nDilute antibodies individually in cold blocking buffer containing 7-AAD nuclear dye just prior to staining.\nApply antibody solution on tissue sections and incubate for 4 h in the dark at 4°C.",
    "Note: Optionally, tissues can be lined with a PAP pen (Thermo Fisher Scientific) to avoid spill-over of the antibody mix on neighboring tissue sections.\nWash three times with PBS.\nMount coverslip with 50 μL water-based antifade mounting medium (e.g., Prolong Gold, Thermo Fisher Scientific).\nLeave the mounted slides to dry for 60 min at room temperature (around 20°C) in the dark before imaging or storing at 4°C.\nSpectral library composition.\nFor each stained tissue section, acquire image cubes for each of the excitation filters (Table 1[href=https://www.wicell.org#tbl1]).\nNote: This is done to visualize the antibody-specific signal and possible bleed-through in different image cubes.\nNote: Repeat for different antibody concentrations to titrate the optimal dilution.\nDefine the mean emission spectrum over several pixels with sufficiently high signal-to noise ratio. Check if the detected spectrum corresponds with the theoretical spectrum (as provided by the manufacturer).\nCritical: Assess the risk of bleed-through in other spectra and image cubes. For example, when imaging a signal from a dye that is excited at 420 nm and detected at around 650 nm, check whether a similar signal is also detectable upon excitation with 488 nm (problem 3[href=https://www.wicell.org#sec6.5]).\nSave the spectrum in the spectral library as a reference for this dye.\nNote: These individually recorded fluorescent emission patterns will be combined in a spectral library, which aggregates the dyes’ spectra for a fixed excitation wavelength with the tissue’s endogenous autofluorescence spectra, recorded on an unstained section.\nUnmix the image cube into background and dye-specific signal components to assess the specificity of the newly defined spectrum.\nRepeat for the individual dyes and combine the reference spectra into spectral libraries.",
    "Note: When a tissue section is stained with a combination of dye-coupled antibodies and imaged using the exact same settings, this spectral library can be used as a reference to computationally deconvolute each of the pixels into their individual fluorescent components, thereby creating a series of images that represent each fluorochrome’s contribution to the overall-measured fluorescence (Figure 1[href=https://www.wicell.org#fig1]).\nNote: Contrary to conventional immunofluorescence, where the signal from each fluorochrome is measured as the average intensity in a broad, dye-specific wavelength range, multispectral fluorescence imaging is based on full emission spectra detected for each pixel. In brief, while keeping the excitation constant, multiple images of one field-of-view (FOV) are recorded at narrow, stepwise incrementing wavelength ranges covering the whole visible spectrum. All these two-dimensional images are assembled into a so-called image cube, thereby creating for each individual pixel a third “wavelength” dimension.\nNote: In order to increase the number of compatible antibodies per staining, spectral scans with different excitation wavelengths can be combined. As an example, Table 1[href=https://www.wicell.org#tbl1] shows the setup as used in the article by Goossens et al.1[href=https://www.wicell.org#bib1] Different sets of dye-coupled antibodies were excited using four consecutive filter cubes: blue (I3 filter), green (N2.1 filter), UV (A filter) and near-UV light (S Blue Aqua filter, all Leica). Every excitation filter comes with its own spectral library, covering the corresponding excited fluorochromes and tissue autofluorescence.\nNote: Compare the fluorescent emission pattern of each dye with the theoretical pattern on the manufacturer’s website. Both experimental and manufacturer’s pattern should resemble each other in peak emission, range and shape.",
    "Note: The antibody titration and composition of spectral library must be repeated for every tissue type because of tissue-specific autofluorescence that can contribute to the detected fluorochrome-specific spectrum. Thus, separate spectral libraries should be created for every tissue type/species. When designing variations of a library to allow the combination of several custom markers with a fixed set of antibodies, consider assigning the varying slot to a commercially common fluorochrome, such as Alexa Fluor 488.\nCritical: Fluorescent dyes strongly differ in emission intensity and the intensities of fluorochromes cannot be scaled individually. Therefore, it is important to stain the markers that show the lowest expression with antibodies coupled to the brightest fluorochromes. In addition, antibody concentrations should be titrated for each of the markers in the panel until similar signal intensities are detected for each, which reduces spectral overlap-based erroneous identification of combined dyes upon unmixing.\nCritical: For staining we strongly recommend the use of primary dye-conjugated antibodies to minimize the risk of cross-reaction between antibodies resulting from a limited number of commercially available species during multiplexing. The associated disadvantage is that signal amplification is not possible and that relatively high antibody concentrations are required for detectable signal.\nCritical: After the short fixation step, tissue sections must stay hydrated during the whole procedure. Drying will decrease staining quality and increase tissue autofluorescence.\nCritical: It is important to keep all variables (e.g., magnification, lamp intensity, exposure time) constant during spectral library composition and multiplex imaging.\nMultispectral imaging\nTiming: 3 days\nAfter definition of the spectral library and titration of all markers according to step 3 and 4, tissue sections will be stained with the complete antibody panel in one single shot.",
    "Note: This single-shot approach is less time-consuming and laborious compared to sequential staining methods that often compromise antigen and fluorochrome stability as well as tissue integrity over the course of several staining cycles.\nNote: The images shown in this protocol were obtained from multiplex staining on murine atherosclerotic plaques.\nFix and bleach cryosections.\nRepeat procedure as in Step 2.\nMultiplex antibody staining.\nDilute antibodies included in the complete antibody panel, using the appropriate titration in cold blocking buffer.\ntable:files/protocols_protocol_3011_2.csv\nNote: The complete 15-plex antibody panel and the respective dilutions used for staining of murine atherosclerotic plaque are listed in Table 2[href=https://www.wicell.org#tbl2].\nApply the antibody mix on PAP pen-lined tissue sections.\nIncubate the slides for 4 h in the dark at 4°C.\nWash 3 times by fully immersing the slides in PBS.\nNote: If required, incubate another 60 min with secondary antibodies, each specific for not more than one of the primary antibodies, and wash again 3 times with PBS.\nMount coverslip with 50 μL water-based antifade mountant (e.g., Prolong Gold).\nLeave slides to dry for 60 min at room temperature (at around 20°C) in the dark.\nPause point: The slides can be stored at 4°C in the dark until the next day for imaging.\nAcquire image cubes for every region of interest.\nUnmix the image cubes based on their corresponding spectral libraries to obtain single channel grayscale images.\nSave each grayscale image as a .jpg file.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3011-Fig3.jpg\nFigure 3. Multispectral imaging of a murine aortic root atherosclerotic plaque section\n(A–P) Unmixed grayscale images for the individual spectra and thus markers.\n(Q) A selection of these images was pseudo-colored and merged using ImageJ4[href=https://www.wicell.org#bib4] to illustrate the relative distributions of these markers over the tissue. Scale bar, 50 µm.",
    "(R) H&E image cropped to the same size, orientation, and resolution as the fluorescent images.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/3011-Fig4.jpg\nFigure 4. Schematic representation of a dye combination that can be set-up for multispectral imaging\n(A) A panel of dyes that are excited at 340–380 nm (A) and at 395–415 nm (S Blue/Aqua). The depicted spectra correspond to: Super Bright 436, eFluor 450, BV480, BV510, BV570, BV605, BV650, and SB702 in ascending order.\n(B) A Panel of dyes that are excited at 450–490 nm (I3) and at 515–560 nm (N2.1). The depicted spectra correspond to: Alexa Fluor 488, PE-eFluor 610, 7-AAD, PerCP-Cy5.5, PE-Cy5, BB700, and PerCP-eFluor 710 in ascending order.\nNote: All images from the same FOV should be saved in a shared folder and should be named consistently to allow automated analysis of larger amounts of data.\nNote: The individual unmixed grayscale images from a 15-plex antibody panel can be observed in Figure 3[href=https://www.wicell.org#fig3]. A Schematic representation of the dye combination used for Figures 3[href=https://www.wicell.org#fig3]A–3P and shown in Table 2[href=https://www.wicell.org#tbl2] is depicted in Figure 4[href=https://www.wicell.org#fig4].\nCritical: The tissue section must not be moved in between the acquisition with different excitation filters to allow alignment of all grayscale images.\nNote: The acquisition of multiple, non-overlapping images from one tissue section ensures a better definition of cell subsets as it reduces the possible bias inherent to a manual selection of a field of view.\nNote: Depending on the study objective, parallel cell type-specific markers or several phenotypic markers to distinguish subsets of a single cell type, if desired complemented with reporters of the cell’s status (e.g., activation, proliferation, ROS), can be utilized to visualize cells and their cellular context.",
    "Note: In case of a high similarity between emission spectra, the use of a negative control and fluorescence-minus-one (FMO) stainings is necessary to validate the correct unmixing of the staining.\nNote: Documentation of the localization of each field of view on the slide will facilitate retracing it on the subsequently H&E-stained tissue section. This can be done by either annotating a schematic drawing of the tissue section or by annotation on a histology image of an adjacent section.\nNote: To limit undesired photobleaching, we recommend starting exposure with the image cube requiring the shortest exposure time. Starting with the highest excitation wavelength could also prevent spectral bleaching at lower wavelength due to Stokes’ shift.\nNote: For optimal visualization, signal-to-noise ratios for each image can be increased in ImageJ. Apply the same settings for all images of the same marker over the different fields of view to avoid bias.\nH&E staining.\nSubmerge the fluorescently imaged slides, angled and with the coverslip facing down, in PBS and leave them at 37°C until the cover slip spontaneously detaches (about 20–30 min) to avoid tissue damage during coverslip removal.\nProceed with a standard H&E staining.\nMount the slide with a non-aqueous mounting medium (e.g., Prolong Gold) to allow long-term storage.\nAcquire images of the same regions of interest that were fluorescently imaged, but at a lower magnification (e.g., multispectral imaging with a 20× objective, subsequent bright-field imaging with a 10× objective) to later allow cropping it to the same dimensions.\nMultispectral imaging data preparation for downstream analysis\nTiming: 1–5 days",
    "Here we describe steps that serve as a guideline on how to prepare the acquired multiplex images for downstream analysis. The H&E image acquired in Step 7c will be aligned with the fluorescent images and used for cell segmentation. Afterwards, the mean fluorescent intensity of every dye can be measured for each segmented cell.\nAlignment of the H&E image and the fluorescent images.\nNote: Alignment of the H&E image allows the quantification of fluorescence intensities of each marker per individual cell, as well as histopathological characterization of the cells’ morphology, location and microenvironment\nDownload the ‘AutoRegi_Nuance_HE.mlapp’ app from GitHub.\nInstall it in MATLAB.\nNote: Make sure you have previously added the 'Image processing Toolbox’ to your MATLAB.\nRun the script, a pop-up window will appear.\nClick “load” to open a fluorescent image of the nuclear staining (7-AAD) and the corresponding H&E image file (H&E) from the same tissue section.\nStay in the ‘manually’ panel to align the image manually by selecting landmarks on both fluorescent image and H&E image.\nNote: Use the ‘auto’ panel for automatic alignment.\nSelect the ‘selectpoint’, and click ‘run’, a new window will show the fluorescent and bright-field images next to each other.\nClick to place a crosshair on a recognizable landmark in one image and select the corresponding point in the other image.\nRepeat this step several times until minimally 5 landmarks, spread over the field of view, are assigned.\nNote: To verify accuracy of overlay, click the icon depicting two landmarks to let the script predict additional points. Adjust these manually if necessary.\nClose this pop-up window, the main window will now show a merged image.\nSave the cropped H&E image (HE.jpg) if the overlap is accurate.",
    "Note: You can save the transformation matrix (tform.mat), or landmarks location by selecting check boxes in the ‘save panel’.\nCritical: H&E and fluorescent images must be perfectly aligned (preferred alignment precision: equal or lower than 5 μm) to guarantee that fluorescent signal is cell specific.\nNote: If you want to perform the alignment of a set of images again, you can load the landmark file from the previous registration or tform.mat into the app by clicking ‘alignwithpoint’ or ‘alingnwithtform’, instead of having to select the landmarks again.\nNote: You can also align H&E image and 7-AAD image automatically by switching to the ‘auto’ panel. First, adjust the parameters of image processing for both H&E and 7-AAD images. Clicking the ‘processing’ button will display the processed images in the interface. After clicking the ‘registration’, the reregistered image will pop up (Depending on the computer configuration, image size and resolution, this can take some time).\nCell segmentation.\nOpen QuPath.5[href=https://www.wicell.org#bib5]\nOpen an aligned H&E image (HE.jpg) and set the image type to Brightfield (H&E).\nSelect the whole image as region of interest or exclude irrelevant areas or artifacts.\nSelect Analyze > Cell detection > Cell detection.\nA settings window will open. For a detailed description of the settings, please refer to the QuPath documentation on this topic.\nToggle off the ‘include cell nucleus’ option and alter the settings until all cells are correctly segmented.\nThe cell segmentation can now be copied to ImageJ (Extensions > Image J > Send region to ImageJ).",
    "In ImageJ, the cell segments will be saved as a mask (Image > Overlay > to ROI manager; select all ROIs in the ROI manager and save them as RoiSet.zip in the corresponding folder) that can be overlaid on each of the fluorescent images to measure the mean dye intensity over each numbered segment (Image > Overlay > from ROI manager).\nContinue with measuring fluorescent marker (co-)expression per cell segment using standard image analysis programs such as Cell profiler, ImageJ, QuPath or others (see also Goossens et al. (20221)).\nNote: This fluorescent marker expression per cell can be summarized in one (co-)expression matrix, to be used for downstream heterogeneity analysis and mapping of the cell type or subset distribution.1[href=https://www.wicell.org#bib1]"
  ],
  "subjectAreas": [
    "Immunology",
    "Antibody",
    "Microscopy",
    "Molecular Biology",
    "Single Cell"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioengineering & Technology"
  ]
}