{
  "id": 7496,
  "origin_website": "Bio",
  "title": "Rapid <em>in vitro</em> and <em>in vivo</em> Evaluation of Antimicrobial Formulations Using Bioluminescent Pathogenic Bacteria ",
  "procedures": [
    "Preparation of bacteria for in vitro and in vivo experimentsUsing a bacterial inoculation loop, pick a colony of P. aeruginosa Xen41 from a stock culture plate and inoculate it in 5 mL of TH broth held in a bacterial culture tube. Keep the cap of the tube loose and incubate in a shaking incubator at 37°C overnight.The next morning, to refresh the culture, take 100 μL from the overnight culture and add to a new bacterial culture tube with 5 mL of TH broth. Keep the cap of the tube loose and incubate in a shaking incubator at 37°C.After 1 h of incubation, take the tube and measure OD at 620 nm in a spectrophotometer. The aim is to achieve an OD of 0.4 so, if its less, place the tube back in the incubator and measure the OD after every 15 min, until it reaches 0.4. Then, take the tube and prepare for washing.Note: The use of a spectrophotometer that accepts 10-15 mL culture tubes helps, as OD can be measured without taking a separate sample. Centrifuge for 10 min (3,000 × g, room temperature) and remove the supernatant. Add 500 μL of Tris buffer (10 mM Tris, pH 7.4) to the pellet and dissolve by mixing with a pipette. Centrifuge again for 10 min (3,000 × g, room temperature). Remove the supernatant, add 300 μL of Tris buffer to the pellet, and mix with a pipette to obtain a ~109 CFU/mL bacterial suspension.Note: For each bacterial strain, the OD vs. CFU relationship may be different. Thus, growth curves should be prepared for each bacterial strain. In vitro assay to determine antimicrobial efficacyFigure 1 illustrates the experimental set-up and workflow of the in vitro assay.",
    "Note: We use the IVIS imaging system for data acquisition of the in vitro assay with bioluminescent bacteria in a 96-well plate format. Any other luminometer can be used for the plate format assay. The added advantage of the IVIS imaging is that it can also produce a heat map image of each well representing the total flux emitted by the bacteria. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4302/bioprotoc-12-02-4302-g001.jpgFigure 1. Illustration of the experimental set-up and workflow for the in vitro assay. From the bacterial suspension obtained in Step A4, prepare a suspension of 2 × 108 cfu/mL in Tris buffer.Add 50 µL (i.e., 107 CFU/mL) of the suspension to each well of a clear 96-well plate.Note: Use duplicates or triplicates for each condition according to the experimental plan. Add 250 µL of TCP-25 solution prepared in Tris buffer. Here, to study dose response, we use 5 µM, 10 µM, 20 µM, 50 µM, and 100 µM final concentrations of TCP-25. For controls, add 250 µL of Tris buffer. Mix with a pipette gently to avoid bubble formation.Note: At this step, in place of the TCP-25 solution, 100 to 250 µL of any other test formulation can be added. If a drug is solubilized in a different buffer than Tris, include the relevant buffer control group in the experimental plan. Use a multichannel pipettor to add the formulation, as this will allow for quick data acquisition to study rapid antimicrobial activity of the drug. Transfer the plate to the IVIS imaging system. Keep plate aligned with the horizontal ‘field of view’ lines on the stage.Note: Read the IVIS spectrum user manual before using the IVIS. Start the Living Image software at least 15-20 min prior to imaging and initialize it. The initialization process brings the camera temperature down to -90°C.",
    "Stage heating should be set to 37°C. Set parameters in the IVIS acquisition control panel. Select luminescent (imaging mode), auto (exposure), and C (field of view). Click ‘Acquire’ to start imaging. Immediately after imaging, keep the plate in the incubator (37°C). For kinetic analysis, the plate can be left on the stage too.Note: We do imaging for 2, 5, 15, 30, 60, and 120 min. As most buffers do not support bacterial growth, additional supplements or growth mediums should be tested and used for experiments requiring longer incubation periods. Move to data analysis.Preparation of PU discs for subcutaneous implantationFigure 2 illustrates the experimental set-up and workflow of the in vivo assay.Note: Perform this step in a class II biosafety cabinet or use sterile conditions. Discs can be coated with other peptides or drugs as well. Optimize and test the coating method for each compound. imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4302/bioprotoc-12-02-4302-g002.jpgFigure 2. Illustration of the experimental set-up and workflow for the in vivo assay. Remove the protective plastic coverings from the polyurethane (PU) dressing (Mepilex Transfer). Cut PU discs of 6 mm in diameter with a biopsy punch.Solubilize the TCP-25 in sterile water to prepare stock solutions (5.0 and 0.5 mg/mL). Use 20 μL of each stock solution to prepare discs with 100 μg and 10 μg TCP-25, respectively.Keep PU discs in a petri dish and add 20 μL of the stock solution to each PU disc. Add only 20 μL of sterile water to the control discs. Leave the petri dish in a biosafety cabinet and air dry them at room temperature (20°C ± 1°C) for 12 h.After coating, store discs immediately at -80°C in a moisture free box.Subcutaneous implantation of PU disc in miceNote: Disc implantation can be performed under general anesthesia either via parenteral (e.g.",
    ", ketamine and xylazine cocktail) or inhalation routes (e.g., isoflurane gas). Since this procedure requires a short time (3-5 min), anesthesia with isoflurane is preferable and safer for the animal. Anesthesia with isoflurane requires an anesthesia system capable of delivering isoflurane to the mouse through a mouse nose cone. In an induction chamber, anesthetize BALB/c mice (8-10 weeks old) with a mixture of 4% isoflurane and oxygen (flow rate: 1.5 L/min). Once anesthetized, remove the mice from the induction chamber and place on the table. Immediately adjust the nose cone to the mouse and maintain anesthesia with 2% isoflurane and oxygen mixture.Note: Induction of anesthesia can be achieved in the induction chamber of the IVIS or in any other isoflurane-oxygen delivery system. BALB/c mice are preferred for bioluminescence imaging as dark pigments interfere with emitted signals. If unavoidable, C57BL/6 or mice with darker coat color can be used with optimized protocols. Isoflurane is toxic and its use requires following standard safety protocols for your facility. Using hair clippers, shave hair from the back of the mouse, in an area slightly below the interscapular region. Clean the skin with an alcohol wipe and dry it with sterile gauze.Note: Fur removal is necessary, as mouse hair can interfere with luminescence signals during imaging. Hair removal can also be achieved with depilatory creams. Depilatory creams should be used at least 2-3 days prior to the disc implantation. If using mice with darker coat color, hair removal with depilatory creams gives better results. Using scissors, under aseptic conditions, make a 5-10 mm long cut on the skin of the mouse’s back. Use the tip of the scissors to create a small subcutaneous pocket under the skin. With the help of a tweezer, insert a PU disc in the subcutaneous pocket.",
    "Grasp the wound edge with a tweezer and, with the help of a pipettor, add 50 µL of P. aeruginosa Xen41 bacterial suspension (1 × 107 CFU) to the PU disc. Close the skin wound with two simple interrupted sutures using Vicryl.Note: In our experience, an inoculum of 1 × 106 to 1 × 107 CFU of P. aeruginosa Xen41 gives a good detectable signal during imaging. Factors such as luminescent bacterial strain, mice strain, and mice coat color may affect the signal intensity and, therefore, inoculum size should be optimized in pilot experiments. Skin wounds can also be closed with mouse skin staples or with tissue glue. Use a fresh bacterial suspension. After preparation of the bacterial suspension, keep it on ice for a maximum of 1-2 h. Return the mice to the cages.Note: If using general anesthesia or if the procedure takes longer, a heating pad underneath the mice should be used to maintain their body temperature. In vivo imaging with IVISNote: Read the IVIS spectrum user manual before using the IVIS. Start the Living Image software at least 15-20 min prior to imaging and initialize it. The initialization process brings the camera temperature down to -90°C. Stage heating should be set to 37°C. In the induction chamber, anesthetize mice using 4% isoflurane-mixed oxygen.Note: Read the IVIS spectrum user manual before using the IVIS. Transfer the mice to the IVIS imaging chamber. Position them in a prone position and ensure that their noses are inside the nose cones. Immediately start 2% isoflurane supply to the chamber to maintain anesthesia.Note: A maximum of five mice can be imaged at once. Unless imaging one mouse at a time, including mice from different experimental groups in a single imaging snapshot is appropriate. Select appropriate parameters for imaging.",
    "On the IVIS acquisition control panel, set luminescent (imaging mode), auto (exposure), and D (field of view for 5 mice), or C (field of view for 3 mice).Note: The ‘imaging wizard’ option can be used to change imaging mode or other parameters. Click ‘acquire’ in the IVIS acquisition control panel to start imaging.Note: Increase exposure time to acquire weak bioluminescent signals. In vivo imaging time points should be determined according to the need of the project. In this model, we usually image 15 min, 3, 6, 24, and 48 h after disc implantation. Frequency of imaging should be kept to the minimum, as anesthesia has adverse effect on the health of mice."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}