{
  "id": 7132,
  "origin_website": "Bio",
  "title": "An Imaging Flow Cytometry Method to Measure Citrullination of H4 Histone as a Read-out for Neutrophil Extracellular Traps Formation",
  "procedures": [
    "Neutrophil solation using Polymorphprep mediumNotes: Choose a high yield one step neutrophil purification method as this NETs detection protocol requires relatively high number of neutrophils (2 × 106 per sample) with minimal background activation. The centrifugation step must be performed in a swing bucket rotor as the 500 × g speed has to be reached in the middle of the tube, at the interface between the blood and the Polymorphprep medium. It is not uncommon that the Polymorphprep separation fails when using blood from female donors. In our experience this separation works consistently with donors of both sexes that have a MHCH (mean corpuscular hemoglobin concentration) value within the normal range. Keep the purified neutrophils on ice at all times and use them for experiments within 2 h. Collect whole blood in 10 ml EDTA (purple top) vacutainers and start neutrophil isolation within 1 h of the blood draw.Equilibrate rotors and adaptors of the centrifuge to room temperature (18 °C to 22 °C). Set “Acceleration” to one; set “Deceleration” to zero. Set centrifugation to 500 × g for 30 min.Layer, very gently, undiluted whole blood on to the Polymorphprep medium always kept at room temperature, at 1:1 ratio and proceed to centrifugation. Centrifuged tubes will have the following layers from top to bottom: plasma, peripheral blood mononuclear cells – polymorphonuclear cells (neutrophils) – red blood cells (as shown in Figure 1B).Collect the neutrophil ring and gently re-suspend in 50 ml ice-cold DPBS. Centrifuge at 400 × g for 10 min at 4 °C, with acceleration and deceleration set at maximum. Remove and discard platelets-containing supernatant.Flick the pellet to resuspend, then add 3 ml ice-cold sterile water and make sure the pellet is fully re-suspended by gently pipetting up-and-down a few times.",
    "After 30 s restore osmolarity with 6 ml sterile ice-cold 0.6 M KCl. Fill up with ice-cold DPBS and centrifuge at 330 × g, 7 min at 4 °C.Discard the supernatant and re-suspend the pellet in complete neutrophil medium equilibrated at room temperature (RPMI supplemented with 2 mM L-glutamine) at 4 × 106 cells/ml.Induction of NETosisNotes: Adapt the choice of NETs inducers and the length of the treatment according to the experimental requirements. Distinctive NETs agonists induce optimal responses at different lengths of the treatment period. Five time points (2, 7, 15, 30 and 60 min) and 5 different agonists (calcium ionophore, Hemin, LPS, IL-8 and PMA) have been tested in this protocol. Allow purified neutrophils to rest before treatment with the NETs inducers to reduce their background activation. For each experiment prepare fresh 8% PFA dilution in 1× DPBS and keep it cold and in the dark until needed (this will be further diluted to a final concentration of 4% in a further step. Do not store for second use). All steps below can be performed directly in 1.5 ml Eppendorf tubes if so chosen. However, vigorously mixing the PFA into the cell suspension by pipetting can result in splashing and loss of cells. Using 5 ml tubes provides more space for thorough mixing and to prevent loss of cells. Add purified neutrophils, 2 × 106 cells (in 500 μl of complete neutrophil medium) in a 5-ml sterile tube and allow the purified neutrophils to equilibrate at room temperature.Transfer tube to a 37 °C incubator at 5% CO2 and allow them to rest for at least 30 min without closing the cap.",
    "Add 100μl of complete RPMI for the untreated control or the RPMI containing the NETs inducers of choice, mix gently the same number of times in all tubes and return tubes to incubator for the desired periods of time. Do not close the caps of the tubes during this incubation period.Remove from incubator and stop reaction by adding 600 μl of freshly made 8% PFA in 1× DPBS for a final concentration of 4% PFA, mix at least 5 times by pipetting, and allow to stand at least 30 min at room temperature, cover with aluminum foil.Add 1ml Wash Buffer (WB) at room temperature and centrifuge at 1,120 × g for 5 min, at 4 °C. Discard the PFA-containing supernatant into the designated chemical waste. Note: To ensure that the PFA is removed, repeat this wash step one more time. Gently re-suspended the pellet with 500 μl of WB and transfer it into 1.5 ml Eppendorf tube for subsequent staining steps.Repeat the washing of the 5-ml tube with another 500 μl of WB to make sure all cells have been collected for staining.NETosis staining technique for imaging flow cytometryNotes: Remove the supernatant completely from cells at all steps, while paying attention not to lose cells in the process. Determine the optimal working dilutions for all the antibodies used in the staining panel by titrating with a range of dilutions above and below of those recommended by the vendors (for example, for a recommended dilution of 1:1,000, up to 5 different dilutions should be tested – 1:250; 1:500, 1:1,000, 1:2,000, 1:3,000). This is required as the lasers on different ImageStream cytometers might have different powers.",
    "Optimal H4cit3 dilution is defined as the concentration that provides the greatest separation of the positive staining against the background (and has highest index score when antibody titration is performed). Because the concentration of the antibody stock provided by the company might vary between lots, the optimal H4cit4 dilution has to be determined for each new lot of antibody. Acquire the samples within 72 h of the end of the staining protocol. Longer wait times might interfere with the strength of the signal, particularly for Hoechst (which leaks freely from the stained cells with time). Our recommendation is to acquire them immediately. Store stained cells at 4 °C in the dark and keep them on ice and in the dark during acquisition on the ImageStream cytometer. In the 1.5 ml Eppendorf tubes re-suspend fixed and thoroughly washed cells in 100 μl of 2% BSA containing CD66b-PE, mix vigorously at least 5 times by pipetting and incubate for 20 min, at room temperature, in the dark.Washing step: Add 500 μl WB and centrifuge at 1,120 × g for 5 min, at 4 °C. Remove the supernatant and repeat washing two more times.Re-suspend washed pellet in 300 μl of BD Cytofix/Cytoperm, mix by pipetting up and down at least 5 times, incubate 15 min at room temperature, in the dark.Washing (step #2).Re-suspend washed pellet in 500 μl of blocking buffer, mix by pipetting up and down at least 5 times, incubate overnight at 4 °C, in the dark.Washing (step #2).Re-suspend in 100 μl of 2% BSA containing anti-histone H4 citrulline 3 (H4cit3) primary antibody at the optimal determined dilution. Pipet up and down at least 10 times and incubate overnight at 4 °C.",
    "Note: The concentration of this primary antibody is the limiting factor for the final strength of the fluorescence signal (see note b above). Washing (step #2).Re-suspend pellet in 100 μl of 2% BSA containing secondary antibody DyLight 680, at the determined optimal dilution and the anti-MPO-AlexaFluor 594 conjugated. Pipet up and down at least 10 times and incubate for 30 min, at room temperature, in the dark.Washing (step #2).Re-suspend in 200 μl of 2% BSA containing Hoechst diluted as suggested by the vendor (1:1,000). Mix thoroughly by pipetting and incubate for 15 min, at room temperature, in the dark.Add 500 μl WB and centrifuge at 1,120 × g for 5 min, at 4 °C. Remove supernatant.Re-suspend in 50 μl WB for ImageStream (Imaging Flow cytometer) acquisition (see notes d and e above).Imaging flow cytometry acquisition.Within the INSPIRE software, establish the acquisition settings and create a template to be used with all experimental repeats.Under the “Illumination” tab turn on the 785 laser (side scatter laser – SSC) and all other lasers to be used in the experiment, based on the fluorochromes panel (a chart showing the laser excitation wavelength and its corresponding dyes is available in the company’s website).Under the “Magnification” section, adjust magnification to 60×.Under the “Fluidics” section, slide the Speed/Sensitivity bar to the left (to ensure acquisition with low speed and high sensitivity).Under “File Acquisition”, create a new folder to save the acquired files (with a .rif extension – raw image file).Load a sample stained with all the colors and expected to yield the brightest signals for all the dyes used (stimulated with PMA as an example – the rational here is to ensure the positive fluorescent signal is within range and will not be saturating the channel).",
    "Adjust the laser voltages based on the maximum of fluorescence without channel saturation of each fluorochrome according to their correspondent laser excitation.Note: When setting the channel-specific laser power, the optimal voltage of the laser is the one that does not saturate the detectors (less than 4096 pixels in the generated image) and also promotes a clear distinction between negative and positive population. A ‘Raw Max Pixel’ feature of each of the used channels should be applied. This feature provides the highest value of the pixels contained in the input mask. Once the laser voltages are set, “Return” the sample and set it aside to re-acquire it after the single color compensation control tubes have been acquired for spillover matrix calculation.To generate a compensation matrix file, start the compensation wizard on Inspire and acquire at least 1,000 events from each of the compensation control tubes.Note: The customers portal on the Amnis ImageStream website provides detailed instructions of how to run and validate compensation matrix using the Wizard in the INSPIRE (acquisition software). A compensation matrix has to be applied to every acquired .rif file when first opened for analysis in the IDEAS software (even when a compensation matrix was also applied during the acquisition of that file with INSPIRE). Spillover compensation can be done during acquisition or post-acquisition of data files. If the stop gates on acquisition of the files are based on fluorescent signals, for example, acquisition based on 5,000 positive cells for CD66b, then it is advisable to perform compensation on INSPIRE (use the compensation wizard) to ensure that the fluorescent signal is corrected for spillover in other fluorescent channels.",
    "Create a dot plot of Area of the Brightfield (BF) versus intensity of Side Scatter (SSC) channels and by clicking around the dots (clusters of populations) and evaluating the correspondent imagery displayed in the gallery, the single cells can be found and boundaries determined. In this protocol, for purified neutrophils, the gate of single cells should be in the range of 50 µm2 to 200 µm2 area. This should exclude most of the debris, small particles (to the bottom and left) and aggregates (slightly upper and right – please refer to Figure 2A).Note: Due to the nature of neutrophils, we thought it would be easier to identify singlets by the use of Area versus SSC; however, one can also use Area versus Aspect Ratio (AR) of BF to determine single cells. Aspect Ratio is the ratio of width by the height, events closer to AR of 1 will be where the single events should be located. From the gate above, create a histogram using the gradient RMS (root mean square) feature of the BF (Channel 1 or 9), to select the cells in focus. Because this feature measures the sharpness quality of an image, changes of pixel values of 40 and above, usually corresponds to the cells in best focus. Selecting the bin and visualizing the correspondent cells within the bin in the image gallery will help determine where to begin the focused gate in this histogram.Set the “Acquisition” tab to acquire 20,000 single and focused cells (first and second plots created, respectively).Save this template to be used for subsequent acquisitions with the same settings for laser powers, magnification and number of events acquired.Type the name of the sample into the “Acquisition” tab.“Load” the sample, confirm cells are centered and in focus and click “Acquire”.",
    "Note: Follow one of the two available brightfield channels (channel 1 or channel 9) to confirm the cells are centered (i.e., the cells are flowing in the middle of the channel) and in focus (the images of the flowing cells are clear and crisp)."
  ],
  "subjectAreas": [
    "Cell Biology",
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}