{
  "id": 4377,
  "origin_website": "Bio",
  "title": "Immunofluorescence Labeling of Pollen Tubes",
  "procedures": [
    "In vitro pollen tube germination   Lily, tobacco or Arabidopsis pollen tubes are in vitro germinated according to the methods described before (Wang and Jiang, 2011; Wang et al., 2013). In general, freshly harvest anthers from 1 lily (Lilium longiflorum) flower, 10-15 tobacco (Nicotiana tabacum) flowers or 30-40 Arabidopsis thaliana flowers. Transfer them into 20 ml species-specific pollen germination medium in a 50-ml Falcon tube. Vortex vigorously 1 min to release the pollen grains into the medium and remove the anthers with forceps. Spin down the pollen grains at 2,500 rpm for 5 min at room temperature (RT) using free angle rotor. Remove the supernatant and resuspend the pollen grains with species-specific pollen germination medium (5 ml for lily or tobacco pollens in a 50-ml conical tube and 250-300 μl for Arabidopsis pollens in a 2 ml Eppendorf tube).  Pollen tube germination condition:  Lily: 27.5 °C, 85 rpm/min shaker, 1.5-2.5 h;  Tobacco: 27.5 °C, 85 rpm/min shaker, 2-3 h;  Arabidopsis: 22.5 °C, water bath without shaking, 8-10 h.    Spin down the germinated pollen tubes at 1,000 rpm for 5 min at RT using free angle rotor.       Pollen tube fixation and immunolabeling   Fix germinated pollen tubes with 1% glutaraldehyde in germination medium for 15 min at RT, 60 rpm/min shaker.   Spin down the fixed pollen tubes at 1,000 rpm for 3 min at RT using free angle rotor. Sample washing procedure: Remove the supernatant and wash the pollen tubes by adding 2 ml pollen germination medium. Gently resuspend pollen tubes by mixing them in the medium by end-to-end rotating the tube by hands. Then keep the pollen tubes on bench undisturbed and wait for them naturally sink to the bottom of the tube at RT (repeat four times). Note: All the washing steps afterwards are performed as the same with step B2.",
    "Treat with 0.1% pectinase and 1% cellulase (prepared with 1x PBS) for 45 min at 28 °C (skip this step if immunolabel cell wall or cell wall associated proteins).   Wash three times with 1x PBS.   Transfer the pollen tubes to 10 ml of freshly prepared PBS containing 0.1% NaBH4 at 4 °C overnight without disturbance.   Wash the cells twice by blocking buffer 1 (B1).   Block the cells by B1 for 45 min at RT.   Discard B1 and wash the cell with blocking buffer 2 (B2) once.    Add primary antibody (in B2) and incubate at 4 °C overnight (1:50 or 1:100 dilution for polyclonal antibody serum or 4 μg/ml for affinity-purified antibody).   Warm up the pollen tubes to RT and wash the cells with B2 twice. And then incubate pollen tubes with B2 for 30 min at RT without shaking.   Remove supernatant B2, add secondary antibody (Alexa 1:3,000 dilution in B2) and keep the samples undisturbed in the dark for 1 h at RT.   Wash the pollen tubes with B2 for three times and keep the samples in B2 in the dark without shaking (first time: 15 min, second time: 15 min, third time: 20 min).   Add about 150 μl sample cells in confocal dish for confocal observation. Figure 1 shows the representative confocal images showing the results of immunofluorscences labeling of tobacco pollen tubes with anti-VSR antibodies (Figure 1A) and control labeling using anti-GFP antibodies (Figure 1B). The confocal fluorescence images were collected using a Leica TCS SP8 system with the following parameters: 63x water objective, 2x zoom, 900 gain, 0 background, 0.168 µm pixel size, photomultiplier tubes (PMTs) detector.",
    "The images from pollen tubes labeled with antibodies were collected with a laser level of ≤3% to ensure that the fluorescence signal was within the linear range of detection (typically 0.5 or 1% laser was used).   imgsrc:https://en-cdn.bio-protocol.org/attached/image/20140510/20140510060156_3280.jpg Figure 1. Tobacco pollens were germinated for 2.5 h and subsequently fixed and immunolabeled with anti-VSR antibodies (A) and anti-GFP antibodies as a control (B). Scale bar = 25 µm. DIC: differential interference contrast"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}