{
  "id": 8254,
  "origin_website": "Bio",
  "title": "[<sup>3</sup>H]-Spiperone Competition Binding to Dopamine D<sub>2</sub>, D<sub>3</sub> and D<sub>4</sub> Receptors",
  "procedures": [
    "Before the assay   Prepare assay and wash buffer.    For a D3 assay: Prepare 0.1% PEI solution and pipet 100 μl/filter on the filterplate, subsequently place in refrigerator (4 °C) for at least 2 hours.    The experiment is performed in 96 well plates (polysterene) with a total assay volume of 1,000 μl (450 μl assay buffer + 200 μl radioligand + 200 μl of assay buffer or 5 μM (+)-butaclamol + 150 μl membrane preparation).    Prepare NSB solution.   Prepare dilutions of competitor compound (dopamine used as example here).   Prepare radioligand solution.   Membrane preparation.   Prepare receptor-containing membrane suspension according to preparation protocol. Re-homogenize suspension in small volume (< 2 ml) using short burst of Ultra-Turrax. Dilute to the desired protein concentration and to yield a total volume of about 8 ml per 48 data point experiment. The protein concentration of the membrane suspension should be chosen so that a robust specific binding signal is obtained but at the same time total binding should be < 10% (even better < 5%) of free radioligand concentration. Protein content can be assayed by a variety of essays, e.g. Bradford (1976). Prepare the membrane suspension initially in ice.    Pre warm all solutions for 15 min in 25 °C waterbath.    Final preparation (Table 1), add components to wells in following order:   250 μl assay buffer.   150 μl membrane suspension.   200 μl competitor, assay buffer (TB) or butaclamol (NSB). Use increasing concentrations of competitor.   200 μl assay buffer.   Start reaction by adding 200 μl radioligand solution.   Table 1. Pipetting scheme for competitor concentrations on microtiter plate table:\n﻿0,1,2,3,4,5,6,7,8,9,10,11\nTB,TB,NSB,NSB,10,10,2 x 10,2 x 10,3 x 10,3 x 10,5 x 10,5 x 10\n9,9,2 x 9,2 x 9,3 x 9,3 x 9,5 x 9,5 x 9,8,8,2 x 8,2 x 8",
    "3 x 8,3 x 8,5 x 8,5 x 8,7,7,2 x 7,2 x 7,3 x 7,3 x 7,5 x 7,5 x 7\n6,6,2 x 6,2 x 6,3 x 6,3 x 6,5 x 6,5 x 6,5,5,NSB,NSB\n,,,,,,,,,,,\n,,,,,,,,,,,\n,,,,,,,,,,,\n,,,,,,,,,,Total,Total",
    "During the assay   Incubate for 120 min at 25 °C in water bath.   Terminate reaction by rapid vacuum filtration over Whatman GF/C filters using a cell harvester. Wash filter 10 times with ice-cold wash buffer.      After the assay   Add aliquots of 50 μl radioligand to wells of counting plate to determine total radioactivity.   Dry, e.g. in oven for 2 h.   Place sticker on bottom and add scintillation cocktail (20 μl) to filters, place sticker on top of plate and count in a scintillation counter, allow adequate time (15 min) before counting samples.      Data analysis The data being obtained can be analyzed to yield several types of information. The following should be considered.   Carefully inspect raw data for consistency of replicates and resist the temptation to beautify the data by eliminating apparent ‘outliers’. It is our recommendation that one should very conservative in this regard; the result of a well-designed experiment will not be heavily affected by a single outlier. In other words, if the outcome of the experiment hinges on the question whether a single data point is an outlier, the overall experiment may have been designed and/or executed poorly and should probably be repeated.   Plot amount of binding in the absence and presence of competitor on the y-axis vs. concentration of the competitor on the x-axis. In such plots the amount of binding in the absence of competitor (total binding, TB) can be entered at a virtual concentration lower than any tested competitor concentration, and non-specific binding (NSB) at a virtual concentration higher than the highest tested competitor concentration. A representative experiment with D2 receptors may look like this.  imgsrc:https://en-cdn.bio-protocol.org/attached/image/20131021/20131021183455_0868.jpg    Using all replicates without averaging them is preferable for the data analysis.",
    "In a well performed experiment, the concentration range of the competitor has been chosen in a way that the lowest competitor concentration does not cause any measurable inhibition and that the highest competitor concentration yields a degree of inhibition close to non-specific binding. If one of these two conditions is not met, data analysis becomes tricky as curve fitting may yield spurious values.   Apply one of many available data analysis software packages, e.g. Prism, to fit a sigmoidal curve to the data. In most of such computer programs, you have a choice of settings which have important implications for the interpretation of the resulting parameter estimates.   The preferred option is to let the top and the bottom of the curve to be found be the software, and the resulting values should be checked whether they are close to the experimentally determined total and non-specific binding.   The turning point of the sigmoidal curve should be found by the software in most cases as this will yield the IC50 of the curve.   The slope of the curve can be found by the software. Values close to unity indicate interaction with a single site. If the slope is smaller than unity, i.e. the curve is shallow, this may indicate interaction with multiple sites (see below) but does not necessarily prove it.   If the assumption is made that an interaction with multiple sites, e.g. receptor subtypes, is possible, it can be defined that the curves should follow a monophasic or a biphasic function with each component having a slope of unity. On theoretical grounds a biphasic fit always yields a smaller residual error, as there are more fitting parameters.",
    "Therefore, a biphasic fit should only be accepted if it yields a significantly smaller residual error as judged by an F-test or similar (already implemented in most software packages for such use). If a biphasic fits is superior, it will yield IC50 values for both components and a percentage of each of the two components. e.g. for the representative experiment shown above, the sum of squares of distances of data points to the fitted curve was 24177 and 18221 for the one- and two-site fit, respectively, yielding an F value of 6.734, which indicates with a p-value of 0.0040 that the null hypothesis (single site is preferred) should be rejected and a two-site model should be preferred.     The ability to pick up biphasic curves depends on the selectivity of the competitor for the two subtypes being present (or the intrinsic activity of the agonist, if agonist high- and low-affinity states are being analyzed) as well as the number of inhibitor concentrations being tested per log unit increment of concentration.   The results of the curve fitting should always be inspected visually to check whether they make sense. e.g. in some cases the computer program yields estimates which are outside the range of tested competitor concentrations. Such extrapolations are highly unreliable and should not be used; rather the experiment should be repeated with a better choice of competitor concentrations.   Estimates of IC50 depend on the concentration of radioligand in the assay, expressed as fold of its Kd value. To obtain the more informative Ki value, transformation of IC50 is necessary by the Cheng & Prusoff equation:  Ki = IC50/((L/Kd) + 1) in which L and Kd are the concentration and affinity of the radioligand.",
    "Notes:   A competition binding experiment by virtue of its design cannot prove a competitive interaction between inhibitor and radioligand. This requires e.g. saturation experiments in the absence and presence of one or more inhibitor concentrations.   As IC50 values are obtained from a log scale, the replicates from multiple experiments typically do not exhibit a Gaussian distribution on a linear scale. Hence, the average from multiple experiments should be presented as means (with SD) of –log IC50 (or –log Ki). Alternatively, the median IC50 or Ki can be presented with (asymetric) confidence intervals. Means (with SD) of linear IC50 or Ki values are inappropriate."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}