{
  "id": 6265,
  "origin_website": "Bio",
  "title": "Expression and Ni-NTA-Agarose Purification of Recombinant Hepatitis C Virus E2 Ectodomain Produced in a Baculovirus Expression System",
  "procedures": [
    "Generation of recombinant baculoviruses by cotransfectionSeed the 35 mm tissue culture dishes with 1.5 x 106 Sf9 cells in 2 ml of Insect-XPRESSTM medium with gentamicin at a final concentration of 10 μg/ml to form a sub-confluent monolayer. The number of insect cells is determined by using a Neubauer’s camera.Incubate for 1 h at 27 °C in the CO2 incubator to allow cell attachment to the plate.Add the following reagents to prepare the co-transfection mix of DNA and transfection reagent in a 1.5 ml polystyrene tube:100 μl of serum-free medium (TC100)100 ng of virus DNA from the flashBAC kit500 ng of transfer plasmid (pAcGP67A-E2661 recombinant plasmid or lacZ positive control transfer vector from the flashBAC kit)1.2 μl of baculoFECTIN II from the flashBAC kitMix and leave at room temperature for 15 min.Wash the cell monolayers twice by pouring 5 ml of TC100 medium without serum onto monolayer, shake gently and decant into waste. Add 1 ml of TC100 medium without serum to each 35 mm dish. If the cells are maintained in serum-free medium, it is not necessary to wash the monolayer. In this case, remove and discard 1 ml of medium from the 35 mm dishes.Add the transfection mix (111.2 μl) to the 35 mm dish.Incubate overnight at 27 °C in the CO2 Incubator without shaking.Add 1 ml of Insect-XPRESSTM medium with gentamicin at 10 μg/ml to the 35 mm dish.Incubate at 27 °C for 4 days in the CO2 Incubator without shaking.Harvest the culture medium that contains the recombinant virus by decanting the medium into a 15 ml sterile container. Centrifuge in the laboratory centrifuge for 15 min at 325 x g. Collect the supernatant and store in the dark in a refrigerator at 4 °C. For a long-term storage, save the container at -80 °C.",
    "Amplification of recombinant virusesNote: Once the purified recombinant baculovirus is available, it must be amplified in order to obtain recombinant protein.Seed 2 x 106 Tni insect cells per 25 cm2 of surface area and incubate for 1 h at 27 °C.Add 1 ml of the supernatant containing the recombinant viruses for every 25 cm2 of surface area (Flask F25, 1 ml; Flask F75, 3 ml; Flask F150, 6 ml).Incubate for one hour at 27 °C in the CO2 incubator with very slow agitation (rock the flask every 10 min) to maintain the hydration of the cell monolayer with the minimum volume of inoculum. Add the relevant volume of Insect-XPRESSTM medium with gentamicin at 10 μg/ml to the flask (Flask F25, until 5 ml; Flask F75, until 10 ml; Flask F150, until 30 ml).Incubate at 27 °C for 5 days in the CO2 Incubator without agitation.Collect the supernatant in a 15 or 50 ml sterile tube in order to recover the amplified recombinant virus and centrifuge in the laboratory centrifuge for 15 min at 325 x g.Use the supernatant for a second round of amplification. Transfer the supernatant to a separate sterile tube and repeat Steps B2 to B6. Usually, two or three rounds of amplification are sufficient for large-scale infection to allow expression of the recombinant protein of interest.Production and Purification of HCV E2661 proteinPrepare 10 flasks of 150 cm2 surface area with 8-10 x 106 Tni insect cells in 20 ml medium with gentamicin at 10 mg/ml and incubate for one hour at 27 °C in the CO2 incubator without agitation.Remove the medium and add 6 ml of supernatant containing the recombinant E2661 baculovirus per flask.",
    "Incubate for one hour at 27 °C in the CO2 incubator with very slow agitation (rock the flask every 10 min) to maintain the hydration of the cell monolayer with the minimum volume of inoculum.Add 24 ml of Insect-XPRESSTM medium with gentamicin at 10 μg/ml per flask.Incubate at 27 °C for 5 days.Collect the supernatants and centrifuge for 15 min at 325 x g.Dialyze the supernatant (300 ml, 10 flasks of 30 ml) against 20 L (10 L, 2x) of 50 mM Tris-HCl, pH 8.0, 300 mM NaCl buffer in a 15 L plastic bucket.Load the supernatant onto a 2 ml Ni-NTA-Agarose column previously equilibrated with 50 mM Tris-HCl, pH 8.0, 300 mM NaCl buffer.Wash the column by adding 20-40 ml of 50 mM Tris-HCl, pH 8.0, 300 mM NaCl, 10 mM Imidazole buffer to the top, let the solution flow into a beaker to collect the waste. Wash until optical density at 280 nm is below 0.03. The adsorption at 280 nm is determined by using an UV-spectrophotometer.Wash the column by adding 10-30 ml 50 mM Tris-HCl, pH 8.0, 300 mM NaCl, 30 mM Imidazole until optical density at 280 nm is below 0.03.Elute the E2661 protein by adding 50 mM Tris-HCl, pH 8.0, 300 mM NaCl, 200 mM Imidazole. Collect fractions of 1-1.2 ml. either in 1.5 ml Eppendorf or in glass tubes. Usually 10-12 tubes are enough for elution; thus, manual collection with the operator changing the tube after 1 ml is recommended. The protein is detected by measuring the optical density at 280 nm of each fraction in the UV-spectrophotometer.Check the purification steps of the recombinant E2661 protein by SDS-PAGE. In order to check the purity of the protein, load 20 μl of sample per well from each 200 mM Imidazole fraction.",
    "After Coomassie blue staining, the purity of recombinant E2661 is tested by the appearance of a unique, isolated band at 48 kDa.Collect the fractions containing significant amounts (optical density at 280 nm higher than 0.3) of pure E2661 protein in a single fraction.Dialyze the E2661 protein against 50 mM Tris-HCl, pH 8.0, 300 mM NaCl buffer. A scheme to obtain the pure recombinant protein E2661 is shown in the Figure 1. Note that step A is not included in the protocol.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20180927/20180927013135_8334.jpgFigure 1. Scheme to produce the recombinant protein E2661SDS-PAGE (Protein electrophoresis)Note: A more detailed protocol to carry out SDS-PAGE is described in He (2011) and Yan (2011).Prepare the electrophoresis system.Prepare the separating gel (see Recipe 5). Mix with a Pasteur pipette and deposite into the gel stand.Prepare the concentrating gel (see Recipe 6). Mix with a Pasteur pipette and deposit on top of the separating gel.Add 10 μl of 3x Protein electrophoresis application buffer (see Recipe 1) to 20 μl of sample.Heat at 95 °C for 5 min.Load into the concentrating gel.Develop the electrophoresis in the Running electrophoresis buffer (see Recipe 2) at room temperature at 25 mA per gel until the marker reached the end of the gel.Incubate the gel in a Coomassie blue staining solution (see Recipe 3) at room temperature for 10 min.Incubate the gel in the bleaching solution (see Recipe 4) to detect the proteins."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}