{
  "id": 11990,
  "origin_website": "Jove",
  "title": "Immunofluorescence Imaging of DNA Damage and Repair Foci in Human Colon Cancer Cells",
  "procedures": [
    "1. Preparation of cell culture and experimental set-up\nMaintain human colon cancer cells, HCT-116 as recommended by the supplier, in monolayers in 75 cm2 culture flasks containing 10 mL of formulated McCoy's 5a Medium Modified, supplemented with 10% fetal bovine serum and 1% antibiotic antimycotic solution.\nGrow cells in a humidified 5% CO2 environment at 37 °C until 70% of confluency with medium renewal every 2 to 3 days.\nTo gain BNCT beam (e.g., neutron beam plus 10BPA) and BNCT effect of killing cancer cells as heavy particles and to deposit most of their energy within the boron-containing cancer cells, the day before irradiation, add boron delivery agent to the cell culture medium – e.g., 10BPA, 4-Borono-L-phenylalanine (10 μg 10B/mL, 0.925 mM final) 12–16 h (maximum uptake of boron) before the irradiation, as previously studied for colon cancer cells and thyroid cancer cells20,21.\n\tNOTE: If using another cell line, for which no data exists in the case of BNCT study, test the boron uptake for each cell line to obtain optimal boron concentration. Measure the 10BPA cellular uptake by inductively coupled plasma optical emission spectroscopy (ICP-OES) as performed by Dagrosa group21.\nAfter 12-16 h of boron delivery, aspirate the medium and wash the cells with 10 mL of 1x PBS. Then trypsinize the cells by adding 2 mL of Trypsin-EDTA solution to the cells and incubate for 5 min at 37 °C to enhance the cell detachment. When cells start to detach, stop the trypsin action by adding 10 mL of complete medium.",
    "Aspirate the cell suspension in the 15 mL tube and count the cells using an automated cell counter by adding 10 µL of 0.4% trypan blue to 10 µL of cells, mix, and aliquoting 10 µL on a counting slide. Dilute the cell suspension to a concentration of 1 x 106 cells/mL of the medium. Aliquot 1 mL of the cell suspension per cryotube.\nPrepare thermoluminescent dosimeters (TLDs) for the measurement of gamma-ray doses and gold foils for neutron fluencies and attach TLDs to the cryotubes or cell culture flask before the irradiation.\nIrradiate the 1 x 106 cells/mL with the neutron-mixed beam at recommended minimal thermal neutron flux of 5.9 x 1011 (n/cm-2 min−1)4 in culture flasks or cryotubes depending on the facility capabilities.\n\tNOTE: Set up the time of irradiation before to obtain recommended neutron flux.\nAfter irradiation, seed 1 mL of irradiated cells (1 x 106 cells/mL) on 22 x 22 mm coverslips in 35 mm Petri dishes or 6 well plates, supplement with 2 mL of required medium. Incubate cells for a maximum of 3 h at 37 °C in a humidified 5% CO2 environment to let them attach to the coverslips. Observe the attachment of cells from time to time under an inverted microscope with 20x objective.\n\tNOTE: For HCT-116 cells minimum density is 600,000 cells to seed. For quick further staining procedure use chamber slides, reduce cell density accordingly.\n2. Fixation of cells\nAfter irradiation and incubation of cells, remove the medium from the attached cells and wash cells once with 2.5 mL of PBS.\nFix cells with 1 mL of 70% ethanol for 10 min at RT.",
    "NOTE: Alternatively use 1%-3.7% paraformaldehyde (PFA) for fixation as recommended previously19. The protocol is paused here. Store fixed cells in ethanol in a freezer at -20 °C for not more than a few weeks for further analysis and immunofluorescence staining.\n3. Permeabilization of cells\nAfter fixation remove ethanol from the Petri dish and wash with 2.5 mL of 1x PBS.\n\tNOTE: Do not let the cells dry between the rinsing steps.\nGently add 1 mL of 0.2% of Triton X-100/PBS to cover the coverslips with cells in Petri dishes.\nIncubate for 5 min at RT.\nWash the cells 3x with 2.5 mL of 1x PBS.\n\tNOTE: Increase the percentage of Triton X-100 in PBS up to 0.5% if needed (more foci detectable, dependent on the tested cell line). Perform additional washes with PBST (PBS with 0.5% Tween) to avoid unspecific binding.\nBlock permeabilization step with 1 mL of 2% BSA (Bovine Serum Fraction V albumin) diluted in PBS and incubate for a minimum of 30 min or 1 h with 1% BSA.\n\tNOTE: This step can be omitted and is dependent on the type of antibody used. Alternatively, use 5% FBS as recommended in ref4.\n4. Immunofluorescence staining\nAdd the proper amount of primary antibody (Anti-ɣ-H2AX, Anti-DNA-PKcs, and Anti-Rad52) diluted in PBS with BSA (2% Bovine Serum Fraction V albumin) as recommended (see Table 1 with recommended dilutions) (100 µL is needed per sample).\ntable:\n﻿0,1,2,3\nPrimary antibody,Function,Recommended dilution,storage [°C]\nAnti-ɣ-H2AX,detection of DNA-DSBs,1:1000 (PBS-BSA),4\nAnti-DNA-PKcs,detection of RIFs of DNA-PKcs protein belonging to NHEJ,1:200 (PBS-BSA),-20\nAnti-Rad52,detection of RIFs of Rad52 protein belonging to HRR,1:200 (PBS-BSA),-20\nSecondary antibody,,in the dark,\nanti-mouse IgG FITC,ɣ-H2AX foci,1:400 (PBS-BSA),4\nGoat Anti-Rabbit IgG H&L (Alexa Fluor 488),for NHEJ and HRR repair proteins foci,1:500 (PBS-BSA),-20",
    "Table 1: Recommended dilutions and notes for the usage of antibodies used in section 4.\nCover the Petri dish to maintain the humidity in a plastic box with moisturized lignin using distilled water and incubate for 30 min at 37 °C in the incubator.\n\tNOTE: The protocol can be paused here. Incubation can be performed at 4 °C for overnight.\nAfter incubation perform 3 washes with 2.5 mL of PBS.\n\tNOTE: Do not allow the slide to dry during rinsing steps.\nAdd the proper amount of secondary antibody (anti-mouse IgG FITC, Goat Anti-Rabbit IgG (Alexa Fluor 488) diluted in PBS with BSA (see Table 1) (100 µL is needed per sample). For this and the following steps work in the dark.\nCover the Petri dish again to maintain the humidity in a plastic box with moisturized lignin and incubate for 30 min minimum at 37 °C in the incubator.\nAfter incubation perform 3 washes with 2.5 mL of PBS.\nAdd 100 µL of DAPI diluted in PBS to a final concentration of 1 µg/mL to counterstain the nuclei.\nIncubate shortly, for a maximum of 2 min at RT.\nAfter incubation perform 3 washes with 2.5 mL of PBS.\nRemove the PBS and gently put a coverslip on the top of the mounting medium, avoiding the formation of air bubbles and seal edges of the coverslip with nail polish. Wait until the varnish will dry and paint the coverslip around.\nWait for the hardening of the mounting medium (up to 3 h) before image analysis under fluorescence microscopy.\n\tNOTE: The protocol can be paused here. Store glass slides in a plastic box at 4 °C in the dark.\n5. Image acquisition and analysis\nAcquire images with a fluorescence microscope under 100x objective with immersion oil.",
    "Analyze foci in the nuclei with a fluorescence microscope equipped with the following filters for: Alexa Fluor 488: excitation⁄emission (nm): 496/519, emission color green; DAPI: excitation⁄emission (nm): 358⁄461, emission color blue.\n\t\tNOTE: Analysis of DSBs along single-particle tracks may require advanced microscopy like confocal laser scanning microscopy with higher resolution.\nSave acquired images and process with appropriate imaging software e.g., ImageJ or Image Pro3,20.\n\tNOTE: Use of individual macros and plugins developed for automatic analysis or development/purchase of individual bioinformatic software is recommended.\nIf using Image-Pro software for foci analysis, process images in TIFF files: select Count/Size Button, then click Types [choose the type of measurement (e.g., diameter or area)], click Ranges [set range of the measurement], click Split objects if necessary. To adjust brightness, click Bright [adjust treshold]. Then click Count [red button].\nTo export data, click Data Table | Statistics | Export to Excel. In the spreadsheet software, draw graphs with the required statistical analysis.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}