{
  "id": 13501,
  "origin_website": "Jove",
  "title": "Shifting Zebrafish Lethal Skeletal Mutant Penetrance by Progeny Testing",
  "procedures": [
    "All experiments described in this protocol were completed in accordance and compliance with the University of Colorado and the University of Oregon Institutional Animal Care and Use Committees (IACUC).\n1. Preparing the Unselected Starting Stock\nIdentify heterozygous carriers of the mutant allele of interest by fin clip11 and genotyping a stock of full-sibling animals by a method of choice, such as KASP12,13,14. This protocol was performed with the zebrafish mef2cab1086 strain.\nKASP genotyping\n\tNOTE: Allele specific primers for KASP are designed by the company that provides the reagents (see Table of Materials). To obtain the appropriate 6-carboxyl-X-rhodamine (ROX) dye concentration for the specific real-time PCR machine visit the company website.\n\t\nPlace the zebrafish tail tissue in 50 µL of lysis buffer (10 mM tris (pH 8.3), 50 mM KCl, 1.5 mM MgCl2, 0.3% non-ionic surfactant, 0.3% Octylphenyl-polyethylene glycol). Add 10 µL of 10 mg/mL Proteinase-K per well of a 96-well PCR plate and digest in a thermal cycler at 55 °C for 2 - 5 h followed by a 20 min 94 °C inactivation step. Refrigerate the lysis product after digestion. \n\t\tNOTE: Lysis products can be successfully used for several months after preparation. When tissue was lysed using 50 mM NaOH, the KASP reactions were unsuccessful. These findings suggest that the NaOH method of genomic DNA preparation is not compatible with KASP.\nQuantify the genomic DNA using a spectrophotometer. Dilute the genomic DNA template using molecular biology grade water so that each reaction contains approximately 20-30 ng.\n\t\tNOTE: Quantify 4 or 5 samples, pool them, then prepare dilutions for all samples based on the average. When using this protocol for adult tail tissue, a 1:100 dilution is often sufficient. The precise quantification of DNA concentration is not required.",
    "Add 0.14 µL of the KASP primer mix and 5 µL of the KASP master mix per sample on ice into a 1.5 mL microcentrifuge tube and mix well before briefly centrifuging to collect contents at the bottom of the tube.\n\t\tNOTE: KASP master mix is heat and light sensitive, keep stock on ice and avoid direct light.\nPipet 5 µL of primer/master mix solution into the wells of a 96-well optical PCR plate suitable for the real-time PCR machine being used.\nPipet 5 µL of diluted (approximately 5 - 7 ng/µL) DNA template samples into each well and aspirate with a pipette to mix.\nAdd 5 µL of nuclease-free water to 3 wells to serve as no-template controls (NTC) and add 5 µL of diluted confirmed homozygous wild type, heterozygous and homozygous mutant DNA template for positive controls.\nPlace an optically clear film seal over the plate ensuring that the film is fully sealed on each well.\nBriefly centrifuge the plate at 600 x g to collect the contents at the bottom and to remove bubbles from the mix.\n\t\tNOTE: Keep the plate on ice and shield from light until ready to proceed.\nUse the cycling program shown in Table 1 to perform the main KASP reaction.\nView the resulting scatter plot produced by the analysis computer. A successful reaction will show 4 distinct groupings of points on the plot (Figure 3): three sample groupings corresponding to genotype, and one grouping of the NTCs near the origin. The positive controls should segregate with the appropriate sample grouping.\nIf the computer program does not recognize the plot groupings as corresponding to specific genotypes, additional cycling sets may be required (Table 2). Repeat the additional program until the computer recognizes tight groupings by genotype.",
    "Export the genotyping results to a spreadsheet file for easier use and analysis.\nHouse the identified heterozygous animals together on the main water system.\n2. The First Round of Progeny Scoring\nPairwise cross sibling heterozygotes\nAfter the animals recover from the fin clip, set up pairwise intercrosses. Use dividers to ensure embryos are synchronous16.\nCollect the embryos and keep the parental pairs isolated in breeding cages.\nMonitor isolated adults so that aggressive fish can be separated or provided with cover (shredded fish nets work nicely). Fish should be fed and their water changed following IACUC guidelines while in static water.\nEmbryo rearing\nStage and raise the zebrafish embryos to larvae under standard conditions17.\nCollect phenotypically wild-type animals using a glass pipette on day 5 or 6 when the swim bladder is inflated in 75% of the clutch. Place phenotypic wild types in the nursery recording of which parents yielded them.\n\t\tNote: With mutant alleles that are recessive lethal, which is true of many skeletal mutants, homozygous mutants fail to form swim bladders18,19. Therefore, phenotypic wild types can be easily discerned from their mutant siblings based on inflated swim bladders.\nAlcian Blue/Alizarin Red cartilage and bone staining\nAnesthetize larvae that do not inflate their swim bladders using 0.17 g/L Tricaine-S in embryo media. Collect animals into 1.5 mL microcentrifuge tubes with a wide-bore glass Pasteur pipet. Add no more than 100 larvae per tube.\nRemove embryo water from each tube and fix animals in 1 mL of 2% paraformaldehyde in 1x PBS per tube.\nCAUTION: Aqueous PFA is combustible and will cause serious skin and eye irritation. Wear appropriate personal protective equipment such as gloves and eye protection, and wash hands thoroughly after use.",
    "Rock for 1 h; longer fixation impairs bone staining. Check the tubes regularly during this and all subsequent rocking steps to ensure no larvae have become stuck to the side or clumped in the bottom of the tube.\nRemove the fixative from tubes using a glass pipette, add 1 mL of 50% ethanol, and rock for 10 min.\nPrepare fresh staining solution by adding 20 µL of 0.5% Alizarin Red per 1 mL of Alcian premix (0.04% Alcian Blue/10 mM MgCl2/80% ethanol). Remove 50% ethanol, add 1 mL of staining solution to each tube, and rock overnight. Larvae can remain in the stain for up to 5 days.\nRemove the stain solution from the tubes and add 1 mL of 80% ethanol/10 mM MgCl2 solution to each tube. Rock the tubes for at least 1 h; rinsing overnight can produce a clearer Alcian Blue stain.\nRemove the 80% ethanol/10 mM MgCl2 solution from the tubes and add 1 mL of 50% ethanol; rock for 5 min.\nRemove the 50% ethanol solution from the tubes and add 1 mL of 25% ethanol and rock for 5 min.\nRemove the 50% ethanol solution from the tubes and add 1 mL freshly prepared 3% H2O2/0.5% KOH bleaching solution. Leave the caps open and let the tubes stand in in a micro-tube rack for approximately 10 min or until a faint brown coloration can be seen in the upper part of the solution.\n\t\tNOTE: A layer of bubbles form on top of the solution. Careful timing is required at this step, as over bleaching will result in a poor double stain.\nRemove the bleaching solution and add 1 mL of 25% glycerol/0.1% KOH; rock for 10 min to 1 h.",
    "Remove 25% glycerol/0.1% KOH solution from the tubes, add 1 mL of 50% glycerol/0.1% KOH solution to each tube, rock for 10 min to overnight.\nRemove 50% glycerol/0.1% KOH solution from the tubes and again add 50% glycerol/0.1% KOH solution to each tube. Rocking overnight will help remove air bubbles that can accumulate inside larvae. Store stained skeletal preparations at 4 °C when not being used.\nPhenotype scoring\nScore stained mutant offspring for the penetrance of the selected phenotype. In Nichols et al.1 mutants were scored for any occurrence of ectopic bone.\n\t\tNote: Because the zebrafish parents are in static water and the Alizarin Red stain can fade with time, it is important to score skeletons within a few days of completing the skeletal preparation.\nPenetrance is the proportion of a genotype that has a phenotype. Calculate the percent penetrance by the following formula:\n% penetrance = (mutants with phenotype)/(total number of mutants) × 100\n3. Family Selection\nChoose two high penetrance and two low penetrance families for the next generation. In addition to penetrance, it is important to consider fecundity and vigor when choosing which families to propagate; see Discussion for more details on this.\nGive each parental pair a sub stock identifier: family .01, .02, etc.\nHouse parental pairs on the main system with several mixed sex 'companion' fish. Companion fish can be any zebrafish line with permanent, obvious distinguishing features, such as altered pigmentation or fin structure.",
    "NOTE: While many researchers successfully keep only breeding pairs in a tank, favorable results are seen by housing pairs with several companion fish. This optional step allows breeding pairs of animals to be kept in larger schools and easily retrieved so they can be repeatedly crossed as needed. Parental pairs can be crossed repeatedly to generate large full-sibling families; wait at least one week before repeat crossing the same parental pair.\nCull the larval families from step 2.2.2. that were not selected for the next generation.\nLabel the tanks containing the wild-type sibling larvae from selected families with the penetrance from their mutant siblings and raise to adulthood as normal.\nThe next generation will have at least four full-sibling families, two for the upward line and two for the downward line.\nWhen larvae reach sexual maturity, repeat the protocol starting at step one with the new generation.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}