{
  "id": 9551,
  "origin_website": "Jove",
  "title": "Comprehensive Profiling of Dopamine Regulation in Substantia Nigra and Ventral Tegmental Area",
  "procedures": [
    "1. Dissection\nOn a bed of wet-ice, chill a rodent brain matrix (coronal sections segregated 1 mm apart), a Petri dish containing 5 razors, and a #11 scalpel. In a separate container, place labeled 2 ml size microfuge tubes into dry ice.\nThe investigator will choose the method of euthanasia.  We have reproducible results conducting a very brief anesthesia with isoflurane,  Ideally, a vaporizer should be used.  However, if not available, we use a large battery jar containing a platform.  With the battery jar located in an approved ventilating hood, place an isoflurane-saturated gauze pad below the platform and wait 3-5 minutes to allow the isoflurane to saturate the battery jar.  Place the rat inside and remove for decapitation as soon as the rat has lost consciousness.  Rapidly remove the brain (ideally in under two minutes), rinse under cold water, and place immediately in the chilled rodent brain matrix.\nOne minute after positioning the brain into the matrix, insert cold razor blades into the cooled brain, beginning around 2 mm rostral to the optic chiasm if the striatum and nucleus accumbens are desired for analysis in addition to the midbrain nuclei. Continue inserting cold razor blades with each 1 mm section until arriving midway through the pons, staggering the placement of each subsequent razor blade so as to facilitate easier removal of each individual blade.\nWhen pulling out the razors, look for the start of the hippocampus. When it has completely wrapped around the midbrain, begin to take sections using the #11 scalpel blade, as illustrated in Figure 2.",
    "Immediately place the dissected tissue into the pre-cooled microfuge tube on the dry ice. In the rat, expect to be able to dissect SN and VTA from a minimum of two coronal slices and a maximum of three. Store tissues at -80 °C until ready for processing.\n2. Tissue Analysis: HPLC for Dopamine and Metabolites\nFor complete information on the HPLC equipment and maintenance, refer to HPLC analysis at the end of the manuscript.\nGently homogenize tissue immediately after removal from dry-ice using ice-cold 0.1 M HClO4-EDTA solution (0.1 M HClO4 & 0.1 mM EDTA) 9, which contains N-methyl dopamine at a concentration of 20 ng/mL that serves as an internal standard for recovery of sample during the HPLC analysis. The homogenizer we use is a Branson Sonifier 150, with the setting at 10% of full power (1 of 10). The following sonication volumes are recommended:\n\tIn rat, SN = 250 μl (unilateral dissection), 400 μl (bilateral dissection), VTA = 200 μl (unilateral dissection), 400 μl (bilateral dissection).\n\tIn mouse, (bilateral dissections only), SN = 200 μl, VTA = 200 μl.\nAfter homogenization, hold samples on dry ice. Samples are then centrifuged (DuPont Sorvall Microspin 24S) at 12,000 RPM to sediment the protein pellet to be used for western blot determinations. The supernatants are injected directly into the HPLC. The following injection volumes are recommended for precise analysis in rat or mouse: SN = 150 (from either prep.), VTA = 160 μl (from either prep.)",
    "The stock standard is prepared at 1 mg/ml by adding the appropriate amount of monoamines and metabolites* of dopamine component to 0.1 M perchloric acid 0.1 mM EDTA. The concentration of each compound is 1 mg/ml except tryptophan which is 5 mg/ml. The stock standard is divided into 10 μl aliquots and stored in the ultralow until needed.\n\t*All weights are corrected for the salt form of the compound if applicable.\n\tPrepare the working standard by diluting a 10 μl aliquot of stock standard to 100 ml of the perchloric acid solution. Concentration of the working standard is 0.1 μg/ml except tryptophan which is 0.5 μg/ml. 50 μl of this working standard is injected into the HPLC for an on-column amount of 5 ng of each component except tryptophan which is 25 ng.\nDetermination of dopamine recovery within sample aliquot:\n\tThere are several steps involved to determine the dopamine recovery from a sample aliquot.\nFirst, divide the dopamine peak height of the sample by the dopamine peak height of the standard and multiply this ratio by the total amount (ng) of dopamine in the standard. Our standard dopamine concentration is 0.1 ng/μL and 50 μL of standard is assayed. Thus, the quantity of dopamine in the standard is 5 ng. Thus, the equation below can be used to determined dopamine recovery in a given sample:\n\t(Dopamine peak height in sample/dopamine peak height in standard)*5 ng\nCorrecting for loss of sample using the internal standard N-methyl dopamine:",
    "The actual recovery of N-methyl dopamine is calculated in the same way as dopamine by dividing the N-methyl dopamine peak height in the sample by the N-methyl dopamine peak height of the standard and multiplying this ratio by the total amount (ng) of N-methyl dopamine in the standard. Like dopamine, our standard N-methyl dopamine concentration is 0.1 ng/μL. 50 μL of the standard is assayed. Thus, the amount of N-methyl dopamine in the standard is 5 ng. Thus, the equation below can be used to determine N-methyl dopamine recovery in a given sample:\n\t(N-methyl dopamine peak height in sample/N-methyl dopamine peak height in standard)*5ng\n\tHowever, because the N-methyl dopamine in each sample comes not from the sample itself but from the HPLC buffer, the amount of N-methyl dopamine expected in each sample is calculated. The N-methyl dopamine concentration in HPLC buffer is 20 ng/mL or 0.02 ng/μL, so the expected amount of N-methyl dopamine in each sample is found by multiplying the N-methyl dopamine concentration of the HPLC buffer by the aliquot volume of each sample used for HPLC analysis. This is demonstrated in the equation below:\n\t(0.02 ng/μL)*(aliquot volume of sample used for HPLC analysis)\nThe difference between the expected and recovered N-methyl dopamine can then be used to correct the for the amount of dopamine recovered by adjusting for any sample loss. Simply take the ratio of expected N-methyl dopamine/recovered N-methyl dopamine and multiply this by the amount of dopamine recovered. Thus, the overall equation for the amount of dopamine in a sample aliquot is given below:\n\t(Dopamine peak height in sample/dopamine peak height in standard)*(N-methyl dopamine peak height in standard/N-methyl dopamine peak height in sample)* (0.02 ng/μL)*(aliquot volume of sample used for HPLC analysis)\nTotal dopamine recovered from a sample:",
    "The value of dopamine recovered from a sample aliquot is then used to extrapolate the total amount of dopamine in a given sample. This is done by dividing the recovered amount (ng) of DA by the aliquot volume and multiplying this value by the total volume of HPLC buffer that the sample was sonicated in. This is given by the equation below:\n\t(amount (ng) of dopamine in sample aliquot/volume of sample aliquot)*(Total volume of HPLC buffer into which sample was sonicated).\n\tThe reader is referred to the following studies 2,4,10 for a comprehensive presentation of the assessment of dopamine and metabolites in conjunction with readouts from dopamine-regulating proteins in not only SN and VTA, but striatum and nucleus accumbens as well.\n3. Tissue Analysis: Total Protein and Final Normalization of TH and DAT Results\nPlace the precipitated protein pellets (derived from the HPLC buffer treatment) into wet ice to maintain 4 °C. Ensure that all buffer has been removed and archived (if confirmatory analysis is required). If the SN or VTA is to be processed bilaterally (rat only), add 300 μL (SN) or 200 μL (VTA) of 1% SDS containing 5 mM Tris (pH 8.3) and 1 mM EDTA to the pellet and sonicate. Add 150 μL of the SDS solution to SN pellets or 100 μl to VTA pellets if processing tissue from unilateral dissections.\nPlace the samples in near boiling water for ~5 minutes to complete protein denaturation and allow to cool to room temperature. Ensure caps are securely held at this step.",
    "Determine protein concentration in the samples using the BCA assay, including a protein standard curve (albumin standard) range of 2 - 40 μg protein. Assay 5 μl volume of the sample in triplicate and use the median value to determine protein quantity against the standard curve. Divide by the assay volume for protein concentration. Note this is the first of two steps taken for normalizing total TH, DAT, and VMAT2 results to total protein recovery.\nPrepare the samples with sample buffer (containing dithiothreitol) for reducing SDS-electrophoresis on 10% acrylamide gels. Ideally, the final total protein concentration should be ~2 μg/μl. The reason for this concentration selection is to reduce the sample volume necessary for the ultimate determination of TH phosphorylation, as ~100 μg of total protein will be necessary for loading to precisely quantify ser31 and ser40 TH phosphorylation. If yellow color is seen in sample after adding sample buffer, the sample is too acidic. Add 1 M Tris (pH 8.2) in 10 μl increments until blue color is restored.\nPrepare the samples as follows for the following determinations of dopamine-regulating proteins:\nTH: Against a calibrated standard for TH protein (as ng), the concentration of TH (as per ng TH per total μg protein) in the SN is expected to range from ~0.05-0.27 ng TH per μg total protein 2,4,7,10,11. Against a linear TH standard curve, ranging from 0.5 - 5.0 ng TH and using primary antibody to TH (Millipore cat# AB152, 1:1000 dilution in PVP T-20 blocking solution) which produces a linear standard curve, the optimal load of total protein from the SN should be ~10 μg. The concentration of TH in the VTA ranges from ~0.4 to 1.0 ng TH per μg protein 4,11. Thus, total protein load for VTA should be ~5 μg.",
    "DAT: The relative quantities of DAT in SN or VTA are significantly less than that in the cognate terminal field regions of striatum and nucleus accumbens 4. The relative expression of DAT as normalized to recovered TH protein is also significantly lower in SN and VTA. Accordingly, protein loads for quantifying DAT protein in SN or VTA need to be much greater compared to sample loads of the terminal field regions. A minimum of 30 μg of total protein is needed for precision in DAT assessment in VTA and a nominal load of 50 μg total protein is need for assessment in the SN. The primary antibody used is Santa Cruz, cat# sc-1433.\nVMAT2: The expression of VMAT2, as normalized to total protein, is greater in the mesoaccumbens than nigrostriatal regions. However, relative to TH expression, VMAT2 expression is greatest in SN and least in striatum 4. Using Santa Cruz cat# sc-15314, a nominal total protein load of ~40 μg to be best for quantification of VMAT2.\nRun the appropriate quantity of total protein using SDS-PAGE on 10% acrylamide gels. The Bio-Rad Protean II electrophoresis unit is used for the determinations, which is a large gel format. Transfer the proteins onto 0.45 μm pore size nitrocellulose. For the transfer, a Hoeffer tank set to at least 27 Volts allows the transfer to take place over night.\nAllow the blots to dry for at least 30 minutes and then stain with Ponceau S solution (1% Ponceau S in 5% glacial acetic acid) for ~5 minutes. De-stain vigorously with 0.2% HCl solution until individual protein bands clearly resolve and background staining is removed. Obtain an image of the Ponceau S staining using Image J to further quantify relative protein loads in each lane and normalize TH, DAT, or VMAT2 results (Figure 3).",
    "4. Tissue Analysis: Site-specific TH Phosphorylation\nThe phosphorylation of TH at ser31 or ser40 can increase L-DOPA biosynthesis in catecholaminergic cells 12. Although the amount of phosphorylation at each site necessary to increase L-DOPA biosynthesis in dopaminergic brain regions like SN and VTA is not established, there is evidence that ser31 phosphorylation plays a significant role in regulating L-DOPA biosynthesis 10 and co-varies with DA tissue content among the striatum, nucleus accumbens, SN, and VTA 2, 10. Nonetheless, inclusion of ser40 determinations are necessary, as numerous studies show it can affect TH activity, particularly if a threshold of phosphorylation is reached 12.\nWhile ser19 phosphorylation does not affect TH activity alone 13,14, it can be considered a sentinel for Ca2+-dependent signaling in the DA neuron, given that extracellular Ca2+ is necessary to increase ser19 phosphorylation under depolarizing conditions 12. Furthermore, there is a significant positive correlation of ser19 phosphorylation with ser31 phosphorylation only in the SN and VTA 10, signifying that ser19 phosphorylation status could affect ser31 phosphorylation, and thus indirectly L-DOPA biosynthesis.\nSample load considerations for optimal quantification of site-specific TH phosphorylation stoichiometry: Below, the considerations required for accurate and precise determinations of site-specific TH phosphorylation in dissected tissues is presented. When possible, a calibrated TH phosphorylation standard should be included in the assessment of sample TH phosphorylation. The sample load must take into account inherent stoichiometry at each phosphorylation site so that the assay quantifies phosphorylation within the dynamic working range of the antibody being used. As a final note, the inherent total protein coming into the assay for each sample should be also loaded in the standard curve lanes. This is easily achieved with a carrier protein (such as rat liver) which does not express TH.",
    "ser19. Of the three phosphorylation sites, ser19 phosphorylation stoichiometry levels are greatest in SN and VTA, ranging from 0.15 - 0.25 2,10,11. The other consideration is that by our detection method, ser19 ps is quantified in linear range between 0.5 and 5.0 ng phospho-ser19 10. Given these considerations, a total TH protein load between 5 and 10 ng (thus giving an estimated 0.75 - 2.5 ng phospho-ser19 from the sample) would provide a reliable measure of ser19 TH phosphorylation. We use Phosphosolutions primary (Cat. #p1580-19) at 1:1000 dilution.\nser31. ser31 phosphorylation stoichiometry levels are comparatively less in SN and VTA compared to their cognate terminal field regions, ranging from ~0.04 - 0.10 2,4,10,11. By our detection method, ser31 ps is detected in linear range between 0.5 and 7.0 ng phospho-ser31 10. Given these considerations, a total TH protein load between 10 and 30 ng (thus giving an estimated 0.50 - 3.0 ng phospho-ser31 from the sample) would provide a reliable measure of ser31TH phosphorylation. See Figure 4A for an example of ser31 quantification. Our primary antibody is an in-house affinity-purified antibody that was manufactured by 21st Century Biochemicals, (Boston, MA), and validated for specificity the phospho-epitope using our in-house standards 2.\nser40. ser40 phosphorylation stoichiometry levels in SN and VTA range from ~0.02 - 0.06 2,4,10,11. By our detection method, ser40 ps is detected in linear range between 0.2 and 2.0 ng phospho-ser40 10. Given these considerations, a total TH protein load between 10 and 30 ng (thus giving an estimated 0.20 - 1.8 ng phospho-ser40 from the sample) would provide a reliable measure of ser40TH phosphorylation. See figure 4B for an example of ser40 quantification. We use Phosphosolutions primary (Cat. #p1580-40) at 1:1000 dilution.\n5. Representative Results",
    "Dopamine in SN vs. VTA. There are three readouts of dopamine (or metabolites) that may be taken in quantitative analysis; as per total recovered from dissection, per protein, and per TH protein (demonstrated for striatum, SN, nucleus accumbens, and VTA in Table 1 below). Total dopamine recovery between SN and VTA is fairly comparable, ranging between 6-9 ng for two to three coronal slice dissections 2. Normalizing dopamine recovery to total protein will show that, based upon the dissection method employed, that the VTA will have greater dopamine per total protein, averaging 6-8 ng / mg protein in SN and 9-10 ng / mg protein in VTA 2, 4. Finally, normalization of dopamine to total TH recovered should also reveal a difference between SN and VTA, being greater in the VTA 10, and ranging between 0.2 and 0.8 ng dopamine per ng TH protein between the two regions 2,10.\n\ttable:\n﻿0,1,2,3\nDA region,Total DA recovered,DA per mg protein,DA per ng TH\nstriatum,214 ± 16,165 ± 13,0.56 ± 0.11\nSN,8.4 ± 0.8,6.1 ± 0.5,0.18 ± 0.03\nNucleus accumbens,60 ± 6,75 ± 4,0.77 ± 0.03\nVTA,6.0 ± 1.0,9.2 ± 1.4,0.22 ± 0.03\nTotal proteins: TH, DAT, VMAT2 Using the calibrated TH protein standard for quantification, more TH is recovered in SN than the VTA from the dissection (60 ng in SN and 26 ng in VTA 2). However, when normalized to protein, this relationship reverses, with TH per total protein in the VTA being ~3- to 5-fold greater than in the SN, (~0.32 ng / μg protein in VTA and ~0.09 in SN) 4,10.",
    "The expected recovery of DAT in SN and VTA is similar, with slightly more recovery in the VTA as per total protein or as per total TH recovered 4. Notably, DAT protein is much less abundant in these regions compared to the cognate terminal field regions 4.\n\tVMAT2 recovery as per total protein is greater in the VTA versus SN 4. However, when normalized to TH protein, there is slightly greater recovery in the SN 4.\nSite-specific TH phosphorylation From a number of studies, there have been consistent results in ser19, ser31, and ser40 phosphorylation quantity in the SN and VTA, and also in relation to the cognate terminal field regions. Ser19 phosphorylation is notably greater in the SN and VTA (~0.2-0.3) compared to striatum and nucleus accumbens (~0.05-0.15) 2,4,7,10,11. Ser31 phosphorylation is significantly less in the SN and VTA compared to their cognate terminal field regions, being ~0.06 - 0.10 between these somatodendritic regions 2,4,7,10,11. During inhibition of aromatic acid decarboxylase with NSD-1015, there is a 2-fold increase in ser31 phosphorylation in the VTA only 10. Ser40 phosphorylation ranges between 0.02 and 0.05 in the SN and VTA and generally this stoichiometry does not significantly differ from the cognate terminal field regions 2,4,7,10,11.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4171/4171fig1.jpg\nFigure 1.  Dopaminergic readouts from one tissue dissection.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4171/4171fig2.jpg",
    "Figure 2.  Dissection Technique for isolating the midbrain dopaminergic neuropil. Technique for dissecting substantia nigra (SN) from ventral tegmental area (VTA). 1. Remove overlying cortex and hippocampus (these structures have already been removed in the above image). 2. Make a vertical cut separating the pigmented area of the SN from the VTA. 3. Make a horizontal cut at or near the midline just above the dorsal and lateral most part of the SN. 4. Tease the SN away from the rest of the brainstem. Once SN has been removed, similarly tease the VTA away from the rest of the midbrain. Note: this section is typically observed at coordinates, relative to Bregma, at AP    5.7.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4171/4171fig3.jpg\nFigure 3.  second (and final) normalization of total protein load-Ponceau S staining for Image J analysis. Ponceau S protein staining of a total TH determination in rat substantia nigra samples. The first five lanes form the left are the standard total TH curve, to which 28 μg protein from rat liver homogenate was added to mirror the protein load from the substantia nigra samples. The next lane contains molecular weight (MW) markers. The remaining lanes contain ~28μg protein from rat substantia nigra samples. The protein loads are based on the protein concentration of each sample as determined by the BCA method. However, despite what should be equal loads, there are variations in the darkness of Ponceau S staining between the samples indicating a slight variability in protein concentrations, which is corrected for by normalization using ImageJ analysis to analyze the amount of Ponceau S staining for each sample.\nimgsrc://cloudfront.jove.com/files/ftp_upload/4171/4171fig4.jpg",
    "Figure 4.  Representative TH phosphorylation results from controls and treatments. Representative ser31 phosphorylated tyrosine hydroxylase (pTH) and ser40 pTH Western blots from saline and methamphetamine treated Wistar rats from a previous study4. A. ser 31 pTH in rat substantia nigra samples. The calibrated ser 31 pTH standard curve ranges from 0.3 ng to 2.0 ng and is within the linear range of detection. Based on previous Western blot analysis of total TH levels, 6 ng of total TH were loaded for each sample. B. ser40 pTH in rat ventral tegmental samples. The calibrated ser40 pTH standard curve ranges from 0.2 ng to 1.5 ng and is within the linear range of detection. Based on previous Western blot analysis of total TH levels, 9 ng of total TH were loaded for each sample.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}