{
  "id": 18126,
  "origin_website": "Jove",
  "title": "Technique and Patient Selection Criteria of Right Anterior Mini-Thoracotomy for Minimal Access Aortic Valve Replacement",
  "procedures": [
    "The protocol follows our institutional guidelines of the human research ethics committee.\n1. Patient Selection (Table 1)\nIdentify patients necessitating isolated aortic valve replacement14.\nSelect among these patients a subgroup without major chest deformities (Kypho-scoliosis), previous history of irradiation or surgery of the right hemi-thorax, need for emergency operation, and operation for active endocarditis.\nPerform a chest computed tomography (CT) scan to exclude patients with ascending aortic aneurysm ≥4.5 cm.\nMake the final decision according to the measurements provided by the chest CT (Figure 1 and 2 and Table 1). Choose between the second or third intercostal space, based on closer distances to the aortic cannulation site and the aortic annulus.\n2. Preparation for Surgery\nPrepare the patients for surgery following the institutional guidelines and recommendations for adult cardiac surgery patients, as previously described14.\nPlace the external defibrillator pads on the back and left chest anteriorly prior to draping.\n3. Surgery\nAccess to the heart through a right anterior mini-thoracotomy\n\t\nIncise the skin transversally over 8 cm with an 18-blade knife over the chosen intercostal space, starting 1 cm to the right of the right sternal edge.\nCut the pectoralis and the superficial layers of the intercostal muscles using the electrocautery. To avoid injury to the right lung, enter the right pleura first with Metzenbaum scissors. Then enlarge the opening of the intercostal muscles with electrocautery.\nPreserve the right internal thoracic pedicle by freeing it from the fascia and soft tissue around it using Metzenbaum scissors.\nInsert the soft tissue retractor into the right pleura and fix it onto the wound. Take care not to injure the right internal thoracic pedicle.\nPlace the minimal access retractor over the soft tissue retractor and open it gently and gradually.",
    "Grab the cranially overlying fat with Carpentier forceps and cut it with electrocautery. Take care not to injure the right phrenic nerve.\nOpen the pericardium over the right atrium with electrocautery and place 2/0 polyglactin stay sutures on both sides of the opening in order to spread the pericardium.\nContinue opening the pericardium cranially over the ascending aorta and caudally over the right atrium. Place 2/0 polyglactin stay sutures on both sides of the opening to spread the pericardium.\nCheck the distal pericardial reflection line over the ascending aorta and the basis of the aortic root to prepare for the placement of the aortic cannulation purse-strings.\nVerify the anatomy of the right superior pulmonary vein for the placement of the left ventricular vent.\nTo expose the distal part of the ascending aorta, gently push down the ascending aorta using a peanut gauze mounted on an Allis clamp.\nPlace the first purse-string for aortic cannulation just below the distal pericardial reflection line over the ascending aorta using 4/0 polypropylene suture. Complete the preparation for aortic cannulation by adding a second purse-string around the first one using 4/0 polypropylene suture.\nGive 300 I.U. of heparin/kg (concentration 5,000 U/mL) through the IV line.\nConnect the patient to the cardiopulmonary bypass\n\t\nFirst puncture the right femoral vein and place the guidewire through the needle into the vein. Enlarge the skin opening with an 11-blade knife. Dilate the puncture site with successive dilators and introduce percutaneously the femoral venous cannula over the guidewire under transesophageal echocardiographic control (Figure 3).\nGently push down the ascending aorta using a peanut gauze mounted on an Allis clamp and puncture the ascending aorta in the middle of the purse-strings. Cannulate the aorta over the guidewire.",
    "Start the cardiopulmonary bypass and cool down the patient to 30 °C (Figure 4). To improve the venous return, let the perfusionnist apply assisted negative pressure of -50 mmHG.\nGently push the superior vena cava towards the left side and place a purse-string on the right upper pulmonary vein with a 4/0 polypropylene monofilament suture. Insert the left ventricular vent through the purse-string to unload the left heart.\nPrepare for valve resection and replacement\n\t\nCross-clamp the ascending aorta just below the aortic cannula using a flexible clamp with a retractable rigid shaft.\nPerform an inverted-L aortotomy parallel and at the level of the sino-tubular junction, extending to the non-coronary Valsalva sinus. Retract the inferior ridge of the aortotomy with an Allis clamp.\nIn case of aortic regurgitation, deliver the antegrade crystalloid cardioplegia directly into the coronary ostia.\nExtend the aortotomy through the non-coronary sinus to 1 cm above the aortic annulus. Check the left and right coronary ostia.\nPlace a 5/0 polypropylene suture on the inferior ridge of the aortotomy and fix it superficially to the anterior aspect of the right ventricle to improve the exposure of the aortic valve.\nPlace another 5/0 polypropylene suture on the superior ridge of the aortotomy and fix it superficially to the pericardium to improve the exposure of the aortic valve.\nGrab in turn the right, non-coronary, and left coronary cusp with endo-forceps and excise them with endo-scissors. Check the mitral valve through the aortotomy.\nUse commercially available valve sizers to determine the labeled size of the valve to be inserted. Choose a sizer which comfortably passes through the aorto-ventricular junction.",
    "Place the first braided polyester 2/0 with pledget U-suture on the commissure between the left and right coronary sinuses, using an endo-needle holder. Pass the suture from the ventricle up so that the pledget is on the ventricle side.\nContinue the placement of the braided polyester 2/0 with pledget U-sutures clockwise to complete the right coronary sinus.\nPlace clockwise braided polyester 2/0 with pledget U-sutures on the non-coronary sinus.\nComplete the annulus sutures by placing counter-clockwise braided polyester 2/0 with pledget U-sutures on the left coronary sinus, starting at the commissure between the right and left coronary sinuses.\nPass the braided polyester 2/0 sutures onto the sewing ring of the valve prosthesis using a Ryder needle holder.\nSlide down the valve prosthesis and remove the valve holder. Tie the sutures and check for any gap between them and the aortic annulus. Verify that the left and right coronary ostia are unobstructed.\nCut the tied sutures using Metzenbaum scissors. Remove the 5/0 exposure sutures on the inferior and superior ridge of the aortotomy.\nClose the aortotomy by two 5/0 polypropylene running hemi-sutures. Place the first one on the nadir of the aortotomy in the non-coronary sinus and tie it. Then come up to the angle of inverted L-aortotomy. Put the end of the suture under slight tension.\nContinue the closure of the aortotomy by the second 5/0 polypropylene running hemi-suture starting on the left end and coming towards the right side to meet the end of the first hemi-suture. Tie the two ends together and cut them.\nPlace the ventricular pacing wires on the right ventricle before unclamping the aorta.",
    "Let the operating table tilt in the Trendelenburg position. Reduce the pump flow to 50% of the full flow. Under gentle aspiration of the left ventricular vent, slowly remove the aortic cross-clamp14.\nResume the full flow of the cardio-pulmonary bypass. Check the hemostasis of the aortotomy closure. Remove the left ventricular vent and tie its purse-string. Check for hemostasis.\nRewarm the patient to 37 °C. Separate the patient from the cardio-pulmonary bypass. When a stable blood pressure is reached, neutralize the heparin by a protamine-infused IV in a 1:1 ratio (3 mg/kg corresponding to 300 U/kg of heparin)14.\nPrepare for removal of the aortic cannula by tying down the first purse-string. Let the assistant gently remove the aortic cannula and finish tying the purse-strings.\nDouble-secure the aortic cannulation site with a figure of eight 4/0 polypropylene suture. Cut the sutures.\nRemove the femoral venous cannula and secure the hemostasis by manual compression for 20 min.\nPlace one pericardial and one right pleural chest tube. Adapt the pericardium with three loosely tied braided 2/0 polyglactin sutures.\nAdapt the ribs with two braided 0 polyglactin sutures. Close the wound in layers in a standard fashion.\n4. Post-Operative Patient Care\nFollowing the transfer to the intensive care unit, provide the patient with standard post-operative care for cardiac surgical operations14.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}