{
  "id": 8697,
  "origin_website": "Jove",
  "title": "A Novel In Vitro Model of Blast Traumatic Brain Injury",
  "procedures": [
    "The experiments described in this manuscript were done in compliance with the United Kingdom Animals (Scientific procedures) Act of 1986 and have been approved by the Animal Welfare & Ethical Review Body of Imperial College London. Animal care was in compliance with the institutional guidelines of Imperial College London.\n1. Hippocampal Organotypic Slice Preparation and Culture\nNOTE: This protocol allows the production of organotypic hippocampal slices according to the interface method described by Stoppini and colleagues with minor modifications21,22,23. Ideally, no more than three animals should be euthanized and dissected in one session to ensure each step is done swiftly and to avoid compromising the quality of the slices. Use aseptic technique throughout.\nEnsure the following steps are taken before starting the dissection protocol.\n\t\nPrepare and filter sterilize all solutions in advance using a 0.22 µm filter.\nKeep the solutions at 4 °C during the storage and throughout the brain dissection and hippocampal slice preparation by keeping the storage containers and Petri dishes on a metal heat sink sitting on wet ice at all times.\nAutoclave all metal instruments, rings and paper tissues.\nEnsure all instruments and material to be used for each step of the protocol are ready to use, laid out in advance and sprayed with 70% ethanol. Ensure that they are allowed to cool down and dry.\nEuthanize a 5–7 day-old C57BL/6N mouse pup by cervical dislocation and briefly wipe the whole skin surface with sterile paper tissue soaked in 70% ethanol. Pat the skin dry and decapitate the pup using Mayo scissors.\nCut the scalp skin with iris scissors along the midline of the head starting in the occipital region and ending near the snout and retract it laterally.",
    "Insert the tip of Vannas scissors in the foramen magnum and make two small lateral cuts on the bone along the transverse sinuses, then cut the skull along the midline up to the olfactory bulb and make two small cuts perpendicularly to the midline in this region.\nUsing fine point curved forceps, retract the flaps of bone laterally away from the midline, carefully remove the brain with a small spatula and transfer it to a 90 mm silicone elastomer-coated Petri dish containing \"dissection medium\".\n\tNOTE: Dissection medium is Gey's balanced salt solution (5 mg/mL D-glucose, 1% antibiotic-antimycotic solution, with 10,000 units/mL penicillin, 10 mg/mL streptomycin and 25 µg/mL amphotericin B).\nRemove the cerebellum and separate the cerebral hemispheres along the midline using a razor blade. Use a spatula to transfer the cerebral hemispheres to a new 90 mm silicone elastomer-coated Petri dish filled with fresh ice-cold dissection medium. If more than one animal is to be used in one session, repeat Steps 1.2–1.6.\nUnder a stereomicroscope, cut the olfactory bulb and the tip of the frontal cortex with a razor blade and separate the cerebral cortex from the rest of the cerebral tissue using fine tip forceps. This step leaves the hippocampus exposed on the medial surface of the cortical tissue. From this step onward, use a laminar flow tissue culture hood (ultraviolet sterilized and cleaned with 70% ethanol solution).\nApply ice-cold dissection medium to a flat plastic chopping disk and, using a spatula, position the brain tissue on the disk such that the medial surface of the cortex is facing up and the axis of the hippocampus is perpendicular to the axis of the chopping blade.\nRemove as much as possible of the dissection medium from the chopping disk using a fine tip Pasteur pipette.",
    "Cut the brain into 400 µm slices using a tissue chopper at a 50% chopping speed and force.\n\tNOTE: It is very important that this step is done as quickly as possible as the brain tissue is not submerged in dissection medium.\nReplace the dissection medium in the silicone elastomer-coated Petri dish with fresh ice-cold medium.\nOnce the tissue chopper is finished, carefully submerge the brain tissue in fresh dissection medium, and transfer the cut tissue back to the 90 mm silicone elastomer-coated Petri dish using a straight blade scalpel.\nUnder a stereomicroscope, carefully separate the cortical slices using fine tip forceps. For each slice, inspect the hippocampus for morphology and potential tissue damage resulting from the dissection or slicing.\nSeparate the hippocampi from the entorhinal cortex and from the fimbria using fine tip forceps and small Vannas scissors. Typically, around 6 to 8 hippocampal slices are generated per hemisphere.\nTransfer up to 6 hippocampal slices to a tissue culture insert using a cut Pasteur pipette and place it inside a 35 mm Petri dish. Ensure that the slices are spread a few millimeters apart (this will ensure each slice can be imaged individually).\nImmediately add ice-cold \"growth medium\" to the bottom of each Petri dish, under the tissue culture insert, just below the top of the tissue culture insert rim.\n\tNOTE: Growth medium contains 50% Minimum essential medium Eagle, 25% Hanks' balanced salt solution, 25% horse serum, 5 mg/mL D-glucose, 2 mmol/L L-glutamine, 1% antibiotic-antimycotic solution, and 10 mmol/L HEPES, titrated to pH 7.2 with sodium hydroxide.",
    "Change the growth medium the day after the dissection and then every 2 to 3 days thereafter (use growth medium at 37 °C). Ensure that the growth medium is added in sufficient amount, but not so much that it overflows over the tissue culture insert membrane, which could compromise the viability of the tissue slices.\nKeep the tissue slices in a humidified incubator at 37 °C with 5% carbon dioxide in air for 12 to 14 days prior to being used in experiments.\n2. Preparation of the Hippocampal Organotypic Slices for the Experimental Blast TBI Protocol\nNOTE: All the steps of this section, except imaging, take place in a laminar flow tissue culture hood.\nInsert the custom-made stainless-steel rings into a 6 well plate (one per well).\n\tNOTES: The rings have a rim with a notch (which should sit in the 12 o'clock position) and fit snugly inside the wells, while the tissue culture inserts fit easily in this rim. Ensure that the rings are washed with a bactericidal disinfectant, thoroughly rinsed with purified water, autoclaved and allowed to cool down in advance.\nFill the well of the 6-well plate with pre-warmed (37 °C) serum-free \"experimental medium\" with propidium iodide.\n\tNOTE: Experimental medium with propidium iodide is: 75% Minimum essential medium Eagle, 25% Hanks' balanced salt solution, 5 mg/mL D-glucose, 2 mmol/L L-glutamine, 1% antibiotic-antimycotic solution, 10 mmol/L HEPES and 4.5 µmol/L propidium iodide, titrated pH to 7.2 with sodium hydroxide.\nEnsure that the level of the medium does not reach above the notch of the ring. Transfer the 6-well plate with the rings back to the incubator for 1 h to ensure that the medium is at 37 °C immediately before the tissue culture inserts are transferred.",
    "Transfer the tissue culture inserts with the organotypic slices from the 35 mm Petri dishes into the 6-well plate with the rings and the experimental medium with forceps.\nMake a dot on the insert rim in the 3 o'clock position with a permanent marker pen.\n\tNOTE: The inserts are going to be removed from the 6-well plate during the experiment and this step facilitates returning the insert to its original position after the shock wave exposure and to easily keep track of each slice throughout the protocol.\nLabel each 6-well plate with a unique name & date and make a map of the wells of each plate, naming each well (e.g., A, B, C, etc.) and each slice in each well (e.g., 1, 2, 3, etc.), so that each slice has a unique identifier (e.g., A1, A2, A3, etc.).\nTransfer the 6-well plate to the incubator for 1 h to ensure the slices are at 37 °C immediately before imaging.\n\tNOTE: Avoid overflow of medium or any bubbles of air underneath the tissue culture insert membrane, which could compromise the viability of the slices.\n1 h after transferring to experimental medium, image each slice individually using a fluorescence microscope (2X objective, NA 0.06) fitted with an appropriate excitation (BP 535/50 nm) and emission (LP 610 nm) filter to assess slice health before the injury protocol is carried out.",
    "NOTES: The slices that exhibit areas of dense red staining at this stage should be considered to present compromised viability and should be excluded from further analysis (these typically represent less than 10% of the total number of slices generated). Ensure that imaging is performed in a sequential manner and as swiftly as possible to minimize the time that the slices are outside the incubator (typically 6 wells should take just under 30 min to image).\nKeep the lid of the 6-well plate on at all times. Some condensation may build up on the inside of the lid. If this happens, briefly use a hairdryer on the low setting.\nEnsure that all imaging conditions are identical on different days and between experiments.\n\tNOTE: The aim of imaging is to quantify the tissue fluorescence, hence this step is important to ensure the reproducibility of the results and allow the comparison of the data obtained.\n3. Submersion and Transport of the Tissue Culture Inserts with the Hippocampal Organotypic Slices\nImmediately after imaging, in a laminar flow hood, take one tissue culture insert out of the 6-well plate using forceps.\nCarefully transfer the insert to a sterile polyethylene bag (3\" x 5\") pre-filled with 20 mL of warm (37 °C) experimental medium freshly bubbled with 95% oxygen and 5% carbon dioxide.",
    "NOTE: Ensure that the oxygen and carbon dioxide enriched experimental medium was bubbled for at least 40 min with 95% oxygen and 5% carbon dioxide using a scintered-glass bubbler inside a Dreschel bottle and transferred into the sterile polyethylene bags inside a laminar flow tissue culture hood using a 20 mL syringe with a bacterial filter and a sterile filling tube (127 mm) attached. Seal the bags immediately and transfer them to a 37 °C incubator for at least 1 h before the tissue culture insert transfer.\nEnsure that each sterile bag is correctly labelled (with the plate and well identification). Repeat this step for each tissue culture insert. Exclude the air bubbles carefully upon sealing the sterile bags (done securely by twisting the top of the bags and by applying a plastic clamp).\nReturn the sterile bags with the tissue culture inserts and the 6-well plates with experimental medium into the 37 °C incubator.\nAfter 1 h, carefully pack the sterile bags with the tissue culture inserts in plastic boxes inside a thermo-regulated box filled with de-ionized water at 37 °C in order to keep the organotypic slices at physiologic temperature throughout the shock wave exposure protocol.\n4. Preparation of the Shock Tube and Hippocampal Organotypic Slice Shock Wave Exposure\nWear steel-toe protective boots, a laboratory coat and gloves during the preparation of the shock tube and the shock wave exposure.\nBolt the sterile bag holder frame to the shock tube distal flange, ensuring that the central hole is aligned with the shock tube outlet (using a blanking rod).",
    "Mount two pressure transducers radially: sensor 1, in the middle part of the driven section and sensor 2 in the distal flange of the shock tube (Figure 1A). Connect the pressure transducers to an oscilloscope through a current source power unit.\nEnsure that all shock tube release valves and flow controls are closed.\nOpen the external compressed air line and charge the solenoid valve to 2.5 bar.\nOpen the compressed air cylinder safety valve and slowly open the pressure regulator to increase the pressure to approximately 5 bar.\n\tNOTE: The pressure set for this regulator should be slightly above the highest diaphragm bursting pressure.\nPrepare the diaphragms by cutting 23 µm-thick polyester sheets into 10 x 10 cm2 squares. Prepare the handles using autoclave tape and sticking them to the top and bottom of each diaphragm.\nPosition one diaphragm (single slot of the double breech - single diaphragm configuration) or two diaphragms (both slots of the double breech - double diaphragm configuration) in the breech (Figure 1B).\nCenter the diaphragms, and clamp them using four M24 bolts and nuts, fastening them sequentially in a diagonally symmetric way, and ensuring that the diaphragms are wrinkle-free.\nClamp each sterile bag individually in vertical position on the holder frame, ensuring that the surface of the tissue culture inserts with the organotypic hippocampal slices is facing the shock tube outlet and the tissue culture insert is centered inside the sterile bag (Figure 1C). Make sure that the sterile bag is securely clamped all around to ensure firm and even immobilization.\nWear ear defenders and safety spectacles when pressuring the shock tube. Switch on the current source power unit and oscilloscope to acquire the shock wave data (acquisition rate of 50 mega-samples/s, record length 20 ms, 1 million points) and close solenoid valve.",
    "Using the flow control knob on the shock tube control panel, slowly pressurize the driver volume section of the shock tube for single diaphragm configuration or both the driver volume section and the double breech section of the shock tube for double diaphragm configuration.\n\tNOTE: For single diaphragm configuration, the burst pressure will depend only on the diaphragm material and thickness and the diaphragm will rupture spontaneously once the material bursting pressure is reached. For double diaphragm configuration, the bursting pressure will also depend on the gas pressure differential in both the driver and the double breech chambers and, for the diaphragms to burst in a controlled way, the double breech safety valve is opened manually once the target pressures are reached.\nAs soon as the diaphragm ruptures (producing a loud noise), quickly close the compressed air flow using the flow knob and open the solenoid valve.\n\tNOTE: The total volume of the driver section can be modified by the insertion of blanking segments, allowing a wider range of shock wave peak overpressure and durations to be obtained. The ideal combination of shock wave parameters should be enough to cause tissue injury but not so high that it causes tissue culture insert or sterile bag distortion or rupture.\nExpose each sterile bag with a tissue culture insert to a single shock tube wave and return it immediately to the thermo-regulated box before a new sterile bag is taken from the box and clamped on the holder frame. Ensure that Steps 4.10–4.14 are performed as smoothly and swiftly as possible (within a few minutes) to prevent the experimental medium cooling down, as temperatures below 37 °C may interfere with injury development.",
    "Once all tissue culture inserts have been exposed to a shock wave (or sham protocol), return the tissue culture inserts to the original 6-well plate and to their respective well (inside a laminar flow tissue culture hood) and return to the incubator.\nKeep the 6-well plate in the incubator with 5% carbon dioxide in air at 37 °C until further imaging.\nInclude sham controls for each experiment, together with the slice shock wave exposure.\n\tNOTE: Sham slices are treated identically to the slices exposed to a shock wave (sealed in the sterile bags with experimental medium, transported to the shock tube laboratory in the same thermo-regulated box and suspended on the metal frame for an equivalent period of time) but the shock tube is not fired.\n5. Hippocampal Organotypic Slice Injury Quantification\nAt 24 h, 48 h and 72 h, image the slices as described in Steps 2.8 and 2.9.\nAfter imaging at 72 h post shock wave exposure, discard the tissue following local biological waste protocols and disinfect and autoclave the metal rings."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}