{
  "id": 4527,
  "origin_website": "Bio",
  "title": "Measurement of Proton-driven Antiport in <em>Escherichia coli</em>",
  "procedures": [
    "Growth and harvesting of bacterial cultures and preparation of inverted membrane vesiclesPerform a fresh transformation with the pBAD/Myc-His A plasmid DNA encoding wild type or mutant transporter (or your vector of choice encoding your transporter of interest) into chemically competent E. coli  TO114 cells. Plate the cells onto Luria Bertani Potassium (LBK) agar containing 100 μg/ml carbenicillin for selection. LBK agar must be used instead of regular Luria Bertani (LB) agar because the latter contains NaCl and the TO114 strain is sensitive to this salt due to deletion of the chromosomally encoded Na+/H+ antiporter NhaA. Incubate the plate overnight (~15 to ~18 h) at 37 °C.Pick a few single colonies from the agar plate and use to inoculate 2 x 250 ml conical flasks, each containing 100 ml of LBK liquid medium supplemented with 100 μg/ml carbenicillin. Grow the cultures overnight (~15 h) at 30 °C with 250 rpm shaking in a temperature-controlled shaking incubator. Measure the optical density at 600 nm (OD600) of the culture using a spectrophotometer; it should be between 3.0-3.3. If the OD600 is less than 3.0, then incubate for a further 0.5-1.0 h and re-measure. If the OD600 is greater than 3.3, the cultures have overgrown and fresh cultures will need to be prepared.Inoculate 2 x 5 L conical flasks, each containing 1,000 ml of LBK liquid medium supplemented with 100 μg/ml carbenicillin, with 15 ml of overnight culture. Incubate at 32 °C with 270 rpm shaking for ~2.5 h in a temperature-controlled shaking incubator. The OD600 should be ~0.6. Drop the temperature to 25 °C and grow with 270 rpm shaking until the OD600 is 1.0. This usually takes between 0.5 to 1.0 h.Induce overexpression of MdtM by addition of 0.1% w/v L-(+)-arabinose [5 ml of 20% w/v L-(+)-arabinose] to each flask.",
    "After addition of arabinose, grow the cells for a further 1.5 h at 25 °C with 270 rpm shaking prior to harvesting.Transfer the E. coli TO114 cells that contain overexpressed transporter into 500 ml or 1,000 ml capacity centrifuge pots that have been pre-chilled on ice for at least 15 min. Pre-cool the centrifuge to 4 °C and harvest cells by centrifugation at 5,000 x g for 20 min. Decant the supernatant and wash the pelleted cells by resuspending in chilled (4 °C) TCDS buffer. Use 30 ml of TCDS buffer for each one litre of cell culture that was pelleted. Maintain the cells on ice during this procedure. Harvest the washed cells by centrifugation as described in step A1 (above) and repeat the washing procedure. Resuspend the resultant cell pellet in 30 ml of chilled TCDS buffer containing 2 mM PMSF (which should be made up as a 100 mM stock in ethanol and stored at -20 °C; ensure the solution is thawed thoroughly and vortexed vigorously before use) and 5 µM DNase and maintain the mixture on ice.Notes: Typically, a 1 L culture of bacterial cells will provide sufficient material for these experiments. Cells should be resuspended either by gentle vortexing using a benchtop vortexer or by gentle aspiration using a 25 ml sterile plastic pipette. Decant the resuspended cells into a 100 ml beaker containing a stir bar, place on magnetic stirrer and stir in a cold room at 4 °C for 20 min. Alternatively, place the beaker on ice in an ice bucket, place on the magnetic stirrer and stir for 20 min.The method for production of inverted vesicles relies on a combination of the fluid shear forces and decompression created as the cell mixture passes through the needle valve of a French pressure cell.",
    "Generate inverted membrane vesicles by a single passage of the resuspended cell mixture through a French pressure cell at a minimum of 4,000 psi. If the pressure is too low, inverted vesicles will not be formed. The pressure cell should be chilled on ice for ~30 min prior to use. The resulting inverted vesicle mixture should be collected in a 100 ml conical flask kept on ice.Decant the mixture into a pre-chilled ~50 ml centrifuge tube and remove any unbroken cells and cell debris by centrifugation at 18,000 x g for 10 min at 4 °C. Carefully decant the supernatant (do not disturb the pellet that contains unbroken cells and cell debris) containing the cell membrane vesicles into a pre-chilled 30-50 ml volume polycarbonate ultracentrifuge tube on ice. Harvest the inverted vesicles by ultracentrifugation at 100,000 x g for 1 h at 4 °C. Carefully decant the supernatant and retain the pellet. Place the ultracentrifuge tube containing the pelleted vesicles on ice.Resuspend the inverted vesicle pellet in 1 ml of ice-cold TCDS buffer by gentle aspiration using a 1,000 µl pipette. Transfer the resuspended vesicles to a pre-chilled 1.5 ml Eppendorf tube on ice for use in the transport assay. In our experience, vesicles stored on ice are stable for several hours.Quantify the total membrane protein content of the inverted vesicles by UV absorbance spectroscopy at 280 nm. Blank the spectrophotometer using a 10 mm pathlength quartz cuvette containing 1,000 µl of TCDS buffer. The buffer should be at room temperature to prevent frosting of the cuvette faces. Clean the faces of the cuvette using a fresh paper wipe prior to measurement. Once the spectrophotometer is blanked, remove 5 µl of buffer from the cuvette using a 10 µl pipette and replace with 5 µl of vesicles.",
    "Cover the opening of the cuvette with a square of Parafilm and invert the cuvette a few times to ensure a homogeneous distribution of vesicles. Record the absorbance of the vesicle mixture at 280 nm and calculate the total membrane protein concentration assuming that an A280 of 1.0 is equivalent to a protein concentration of 1.0 mg/ml.Notes: Remember to multiply the 280 nm absorbance value you obtain by a factor of 200 to calculate the concentration of the undiluted vesicle mixture in mg/ml.At this stage of the preparation, the resuspended vesicles can be transferred to tubes in aliquots of 25-100 µl, snap-frozen in liquid nitrogen and stored at -80 °C for subsequent use. Vesicles frozen in this way will retain their integrity for several months. However, if frozen vesicle stocks are used for the subsequent transport measurements, the vesicles must be thawed very slowly on ice prior to use to prevent their fracture. Fluorometric antiport assaysIn this section we describe the set-up parameters for a Fluoromax-4 fluorometer. These parameters, however, can form the basis for the set-up of other fluorometers. Once the instrument is switched on and the software booted up, set the temperature of the cuvette holder to 25 °C. Open the instrument software and select for time-based data acquisition with excitation and emission wavelengths of 492 nm and 525 nm, respectively. Set the excitation and emission slit widths to 1.5 nm and 2.5 nm, respectively.Add an aliquot of inverted vesicles (which should be maintained on ice in TCDS buffer) to room temperature transport assay buffer containing the acridine orange probe in a 10 mm x 4 mm quartz cuvette to a final concentration of 0.5 mg/ml membrane protein in a total volume of 1,500 µl. The longest pathlength of the cuvette should face the excitation light source.",
    "Place a small magnetic flea into the cuvette and stir the contents gently. Allow the vesicles and assay buffer to equilibrate for ~200 sec.Start recording the fluorescence emission. After approximately 50 sec, add 15 µl of 200 mM stock sodium DL-lactate solution to the cuvette contents to give a final sodium DL-lactate concentration of ~2.0 mM. Addition of lactate energises the vesicles and generates a respiration dependent ΔpH (acid inside) across the inverted vesicle membrane as H+ is pumped into the vesicle interior. This causes a dequench of the acridine orange fluorescence signal (see Figure 1in Representative data).Following the establishment of a ΔpH, monitor the acridine orange fluorescence dequench for a further ~200 sec until it stabilises. Initiate MdtM-mediated, proton-driven antiport by adding substrate (in this case the bile salt sodium cholate) to the inverted vesicle mixture. We added 12.5 µl of 250 mM stock solution made up in high purity water to give a final concentration of sodium cholate in the cuvette of ~2.0 mM. For other substrates we suggest testing a range varying from 1 mM to 100 mM to establish the concentration that gives the best dequench signal. Upon addition of substrate, there should be an immediate dequench (rise) of the acridine orange fluorescence emission signal (see Figure 1a) due to dissipation of the established ΔpH as a result of MdtM-mediated sodium cholate/H+ antiport activity and concomitant alkalinisation of the vesicle lumen.Record the fluorescence dequench signal for 50 sec to allow the antiport reaction to achieve a steady state (as observed by a plateauing of the fluorescence signal). Addition of the protonophore CCCP to a final concentration of ~100 µM (1.6 µl of a 100 mM stock made up in ethanol) in the assay mixture should be performed to abolish ΔpH-driven, MdtM-mediated antiport activity.",
    "Addition of CCCP will cause a further dequench of the fluorescence signal as the ΔpH is dissipated (see Figure 1). Record the fluorescence signal for a further ~50 sec then terminate the acquisition and save the electronic data.Decant the cuvette contents into a suitable waste container and wash the cuvette thoroughly with ethanol then high-purity water. Dry the cuvette carefully with compressed air."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}