{
  "id": 3893,
  "origin_website": "Cell",
  "title": "Mapping of domain-mediated protein-protein interaction by SPOT peptide assay",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nDay 1: Designing the peptide array\nTiming: [2 h]\nNote: Multimedia presentation for procedure of peptide synthesis can be obtained from (Kudithipudi et al., 2014[href=https://www.wicell.org#bib6]) and freely accessible at PubMed Central portal.\nNote: Membranes are designed with the help of the spotter software.\nSwitch on the peptide synthesizer, its accessories, and start the instrument-controlling computer.\nRun the peptide synthesis software on the computer. For example, perform the following steps (a‒e) to run the spotter software when using the MultiPep 1 synthesizer from CEM (Figure 1[href=https://www.wicell.org#fig1]A):\nFrom the “Edit sequence” function of the software, open the peptide sequence file and transform it into to the proper format, which is readable by MultiPep.\nEnter the protein name.\n‘peptide walk’ is performed. Type the length of the peptides to be synthesized on the next line, and the number of overlaps between subsequent peptides (e.g., “.seq, 20,2” means each peptide contain 20 amino acids and shifted by two residues).\nGive the order: “.space.” if you want to insert a single space between spots. The command “.newline.” will leave the remaining row after your last peptide vacant.\nEnter “.end” to command the instrument to stop the peptide spot.\nAfter inputting all the sequences, ensure all information are in the right format. For the MultiPep 1 program this is done by pressing the “clean sequence” tab.\nNote: For the MultiPep software, ‘SHOW PEPTIDES’ will display the position of each peptide together with their designated number of lines or spaces, which have been inserted.\nNote: A full-length purified protein can be used as positive control for the peptide-protein interaction.",
    "Critical: Prudently design your SPOT arrays to maximize yield and simplify use. Since the amount of consumables is irrelevant to the number of peptide spots, you can perform several parallel experiments in a single synthesis. Try to avoid separating one experiment over two blots.\nDay 1–3: Peptide array synthesis\nTiming: [3–4.5 Days]\nNote: Peptide production is a repeated process, including a series of each aa adding. First, Fmoc is deprotected, and then washed with DMF, followed by an ethanol rinse, and air-dry of the membrane. Activated amino acids are subsequently spotted. A capping step can be added as an option. The final step is DMF wash. These procedures are cycled until final assembly of your desired peptides. After that, a side chain deprotection protocol will get rid of the side chain protection groups.\nPut the aa derivatives into the loading tubes. Since we used the MultiPep 1 synthesizer (Figure 1[href=https://www.wicell.org#fig1]A), we specifically did the following before loading the aa derivatives:\nUnder the “EDIT METHODS” function, click “file”/“SPOTpreactiv.”\nCalibrate and assemble the 1 mL syringe and the spotter needle.\nPrime the two dilutors to get rid of air bubbles.\nNote: For priming, switch on the vacuum pump and press 5 times to drain the waste reservoir and press the dilutor 2 solvent 1 prime button. Both DMF and ethanol in dilutor 2 require priming. The same goes for the solvent 2 after finishing solvent 1.\nPipette the prepared aa derivatives into MultiPep 1 tubes in the fume hood.\nNote: Remember that each tube and cap should be well labeled.\nProperly mount the membrane on the device frame in the fume hood. For instance, fix the frame into the MultiPep 1 machine and keep the vacuum tube attached to underneath of the frame.",
    "Critical: Avoid introducing any bubble or wrinkle on the membrane after placing it on the frame.\nWash the membrane in ethanol thrice.\nNote: If you find bubbles on the membrane or the membrane does not dry evenly, take the membrane off the frame and redo DMF washing.\nRun the synthesis, for example, as in (a‒d) when using MultiPep 1.\nRepeat the “File/SPOTpreactiv”step for peptide synthesis.\nDecap the reagents, which consists of 1.1 M DIC, 1.1 M HOBt⋅H2O, 5% acetic anhydride solutions and 20% piperidine).\nMount all reagents (1.1 M DIC, 1.1 M HOBt⋅H2O, 5% acetic anhydride solutions and 20% piperidine,) in the correct points on the substance stand of MultiPep 1 machine and place aa cylinders/tubes into the specified points on the stand.\nNote: Remove all the caps from the aa cylinders/tubes, before loading them into the stand.\nUnlid the 0.5 mL micro-centrifuge tubes and load into holders, which are beside the aa tubes.\nNote: Activation of amino acid derivatives is carried out in these mixing tubes. Activator is then mixed with amino acids in the 3:2 ratio.\nNote: Make sure reagents are in the correct place and the cabinet door is closed.\nPress the START button under “Run Synthesis” tab.\nNote: Check the reaction occasionally during the first cycle to make sure the spotting is running well. Usually it takes 3–4 days for a synthesis to complete, therefore you can keep the synthesis proceeding through the night. Keep track of the reagents over the course of the synthesis as the reagents may run out and require replenishment.",
    "Critical: Press the “PAUSE” button to pause the synthesis in order to refill reagents. The pause is only allowed, if the needle is disengaged from the reagent stand, the membrane, and aa tubes. It is suitable to halt during the countdown between deprotection steps.\nOnce the peptide synthesis is finished, discard all remaining reagents in proper waste containers.\nNote: Collect the waste according to institutional hazardous waste rules. Connect a carboy to the synthesizer equipment during peptide synthesis.\nUpon completion of the synthesis, mark (with pencil) the corners of the membrane and any other membrane position to be cut.\nTake out the membrane and put it in a single solvent-resistant container slightly larger than the membrane.\nUse 20 mL dH2O to wash the membrane thrice for 5 min on a shaker.\nIncubate the membrane in 0.02% bromophenol blue solution with gentle shaking at 20°C‒25°C for about 1 h.\nRinse the membrane with dH2O until background disappears. Peptide spots on the membrane should be observed.\nNote: Weak signal for peptide spots at this step indicates synthesis problem.\nWash the membrane with ethanol and air-dry it at 20°C‒25°C.\nWhen the membrane is absolutely dry, use a pencil to draw a grid on the membrane which encircles each spot location.\nCritical: Do not use pen to draw the membrane, as pen marks would fade in deprotection phases.\nOptional: Make either photocopy or scan the membrane for reference for spot map.\nTransfer the membrane into a container labeled TFA in the fume hood, and incubate it in 15 mL of deprotection solution for 1.5 h.\nCritical: Cover the container with a lid. Agitate the container every 15 min.\nWash the membrane in 30 mL dichloromethane (DCM) four times for 10 min each.",
    "Wash the membrane in 30 mL DMF four times for 2 min each.\nWash the membrane in 30 mL ethanol twice for 2 min each.\nCaution: Waste deprotection and washing solutions in the deprotection steps must be collected in separate waste containers. TFA reacts strongly with DMF and can cause lesion to the skin when in contact. Usage of protective wears (e.g., glasses, nitrile gloves, coat) and working under the fume hood are strongly advised.\nThe membrane should be kept in the fume hood until it is thoroughly dry.\nFor a short-term storage for a month, the membrane can be loosely wrapped in tin foil and kept in a box at 4°C until peptide assay.\nPause Point: For a long storage, the membrane can be kept at −20°C after being heat-sealed in a polyester bag.\nDay 4: Transfection and cell culture\nTiming: [2 days]\nIn many cases, especially for small proteins, the cDNA(s) encoding for the GST-fused protein could be cloned into a bacterial expression plasmid and the bacterially expressed GST-fused proteins then are purified for peptide assay as previously described (Luo et al., 2004[href=https://www.wicell.org#bib7]). Compared with eukaryotes, prokaryotic cells lack protein folding system. Thus, bacteria-based expression and purification system might not be suitable for big proteins such as BAF155 (155 kDa) and BAF170 (170 kDa) as most large proteins form inclusion body. To avoid difficulty in protein purification, the exogenous BAF155-flag and BAF170-flag were overexpressed in mammalian cell system and were purified to examine their interaction with JMJD3 (Kdm6b).\nNote: Cells are transfected with plasmids encoding for flag-tagged proteins.\nDilute 24 μg of the plasmid, for our purpose either CMV-BAF155-flag (Narayanan et al., 2018[href=https://www.wicell.org#bib9]) or CMV-BAF170-flag plasmids (Xie et al., 2019[href=https://www.wicell.org#bib13]), in 1.5 mL of Opti-MEM I medium and mix gently.",
    "Dilute 60 μL of Lipofectamine 2000 in 1.5 mL of Opti-MEM I medium and mix thoroughly by inverting the tube.\nAfter 5 min incubation, combine the Lipofectamine and DNA solutions (total volume is 3 mL).\nMix gently by slowly inverting the tube for a few times and incubate the solution for 20 min at 20°C‒25°C, which allow DNA-Lipofectamine complex formation.\nNote: Complexes maintain stability for 6 h at 20°C‒25°C.\nCritical: Opti-MEM I Reduced (minimum 50%) Serum Medium, in resource table, must be used for plasmid transfection using Lipofectamine 2000.\nAdd the 3.0 mL of DNA-Lipofectamine solution to cell cultures and gently agitate the dish to dispense the complex evenly over the cells.\nPlace the dishes at 37°C in the CO2 incubator for 24–48 h.\nNote: Add the complex drop-wise and spread out to ensure even distribution.\nNote: It is not necessary to remove the excess DNA-Lipofectamine complex by changing the medium.\nNote: In order to avoid excessive cytotoxicity and maximize transfection efficiency, you can optimize transfection conditions by adjusting cell density along with DNA and Lipofectamine 2000 concentrations. Ensure that cells are greater than 90% confluent and modify Lipofectamine 2000 (μL): DNA (μg) ratios from 0.5:1 to 5:1.\nCritical: Do not add antibiotics to media during transfection as this will result in cell death.\nDay 5: Cell lysis\nTiming: [2.5 h]\nCells are first dissociated with trypsin and collected in a falcon. Cells are then lysed for subsequent protein extraction.\nWash cells by removing the medium and rinse twice with PBS buffer.\nNote: Caution must be taken not to dislodge the cells.\nAdd 2.5 mL Trypsin for cell dissociation and incubate the cells for 5min at 37°C in the CO2 incubator.\nNote: Swirl the content gently for the Trypsin to cover the entire cell layer.",
    "Add 7.5 mL medium to deactivate trypsin and gently dissociate cells by pipetting.\nThen move cells to a 50 mL falcon.\nNote: Pre-warm the growth medium and trypsin solution to 37°C.\nCritical: Avoid cell exposure to trypsin solution for more than 10 min, otherwise this will damage cell membranes and lead to cell death.\nCentrifuge at 1000 rpm for 5 min.\nRinse with PBS twice.\nAdd 1–1.5 mL lysis buffer with protease inhibitor.\nSonicate the cell lysate (50% duty cycles, 5 output control, 3 pulsed)\nPlace the lysates on a shaker with agitation for 15–30 min.\nCentrifuge the lysates for 10 min at 12000 × g.\nMove the supernatant to a tube on ice.\nPause Point: Lysates can be kept at −80°C for later use.\nCritical: If there are still clumped cells in lysates, the protein extracts should be filtered using a 0.45 μm strainer.\nOptional: Save 1/30 volume of the lysate (sample S1, Figure 2[href=https://www.wicell.org#fig2]) to test the expression of FLAG fusion protein by Western blotting or coomassie blue analysis.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/616-Fig2.jpg\nFigure 2. Expression and purification of Flag-BAF155 and Flag-BAF170 from mammalian culture system\n(A and B) Coomassie blue staining was performed to check the expression and purity of Flag-BAF155 (A) and Flag-BAF170 (B). Different samples such as lysate (S1), flow-through (S2), in washing steps (S4 and S5) and in elution steps (S6‒S8) during protein purification were collected for the staining.\nDay 5 and 6: Enrichment of the FLAG-tagged protein\nTiming: [6–7 h]\nFlag-fused proteins in a large-scale could be affinity-immunoprecipitated and purified, using FLAG-M2 antibody. The immunoprecipitation is done with FLAG-M2-coupled affinity gel, an antibody-based purification resin. Subsequently elute the immunoprecipitated FLAG-fused proteins from the resin with acidic buffer or by competition with the FLAG peptide. Proteins are ultimately concentrated to remove solvents and undesirable molecules.",
    "Optional: It is recommended to include two control reactions. The positive control is immunoprecipitation with a known FLAG- tagged protein and the negative control is an un-transfected sample.\nNote: Using a column for the immunoprecipitation reaction is highly recommended to avoid loss of resin during the wash and elution steps. Therefore, we placed a spin column (with FLAG-M2- coupled resin) in a centrifuge tube in the following procedure.\nNote: Multimedia presentation for procedure of ECL Plus detection can be obtained from (Ma et al., 2017[href=https://www.wicell.org#bib8], Chen et al., 2014[href=https://www.wicell.org#bib1]) and freely accessible at PubMed Central portal.\nRinse the empty column with 1× washing buffer.\nLoad 0.8 mL of anti-FLAG M2 affinity gel on the column. Suspend the resin thoroughly. To achieve homogeneous suspension of the resin, use a 2:1 proportion of the suspension to packed gel volume.\nNote: Enlarge plastic pipette tip by cutting to allow easy transfer of resin.\nNote: Calculate required reagent volumes based on the amount of samples to be processed.\nSpin the resin for 30 s at 5000–8200 × g.\nDiscard the flow-through.\nRinse the column with 1 mL 1× washing buffer and centrifuge to remove the wash solutions.\nWash with 1 mL of elution buffer thrice, allowing each milliliter to pass through the column before making the next addition.\nPass 10 mL of 1× washing buffer through the column, pipetting the beads up and down to accelerate the process.\nAdd cell lysate to the washed resin.\nCritical: This is a slow process. Therefore, prevent beads from drying out during the process.\nAgitate the sample gently on a shaker for 2 h.\nNote: Passing cell lysates several times through the column may increase the amount of extracted proteins.",
    "Note: Agitating the sample on shaker for up to 16 h might increase the binding efficiency of proteins to resin.\nOptional: Collect the lysate that has passed through the column (sample S2, Figure 2[href=https://www.wicell.org#fig2]) for Western blotting or coomassie blue analysis. The efficiency of the column in removing FLAG fusion protein from the cell lysate can be determined by how much remaining FLAG fusion protein is in S2 compared with the starting material (S1).\nSpin the resin for 30 s at 5,000–8,200 × g and discard the flow-through.\nWash the beads with at least 3 column volumes of ice-cold washing buffer.\nOptional: Collect the washing buffer that has passed through the column (sample S3‒S5, Figure 2[href=https://www.wicell.org#fig2]) for Western blotting or coomassie blue analysis.\nElute the proteins with 3× 2 mL of the elution buffer. Incubate the sample at 20°C‒25°C with gentle shaking for 5 min. Then centrifuge the resin for 30 s at 5000–8200 × g. Allow the beads to drain between each addition and collect 1 mL of fractions in separate tubes which contain 50 μL of 1 M Tris (pH 8) (S3–S8).\nCritical: All steps should be carried out at 20°C‒25°C. The resin should not be left in the elution buffer longer than 20 min.\nOptional: Save 30 μL elution buffer that has passed through the column (sample S6‒S8, Figure 2[href=https://www.wicell.org#fig2]) for Western blotting or coomassie blue analysis.",
    "Optional: Protein can also be eluted under native condition by competing with 3× FLAG peptide, which brings about high elution efficiency. Prepare 3× FLAG elution buffer by mixing 180 μL of 5 μg/μL 3× FLAG peptide solution with 6 mL of 1× wash buffer to make a final concentration of 150 ng/mL). Add 6 × 1 mL of 3× FLAG elution buffer to the resin. The sample is then incubated for 30 min at 4°C with gentle shaking. Collect the fractions by centrifuging the resin for 30 s at 5000–8200 × g.\nWash the beads with 2 column volumes of elution buffer, pipetting the beads up and down to accelerate the process.\nNeutralize the beads with 2 column volumes of PBS.\nNote: For long term storage of the column, add sodium azide (to 0.1% v/v final concentration) directly to the PBS in the column. Seal the column and store at 4°C.\nPause Point: The eluted fractions can be stored at −20°C for long term storage.\nSave 20 μL samples (S3 to S8) for blotting and coomassie blue staining to validate the purity of purified proteins (Figure 2[href=https://www.wicell.org#fig2]).\nPrepare blotting samples by adding 10–50 μg of lysates or purified protein (above samples S1–8) into 12 μL total volume of Non-Reducing Sample Buffer (Cat#39001, Thermo Scientific).\nLoad samples in SDS-PAGE gel (7.5%–12%).\nRun SDS-PAGE as standard protocol for blotting.\nAfter completing the SDS-PAGE running, move the gel into a staining box containing Coomassie staining buffer.\nGel should be incubated in the buffer for 2 h with slow shaking.\nAfter staining, pour off the Coomassie staining buffer into a bottle marked \"Used Coomassie staining buffer\".\nNote: Coomassie staining buffer can be re-used for several times, provided fresh 10% acetic acid is added.",
    "Add appropriate amount of the Coomassie destaining buffer to completely cover the gel and incubate the gel with slow shaking for some hours until protein bands are visible.\nAfter completing the destaining process, gel can be dried by using a gel dryer for documentation purpose. Coomassie blue staining analysis revealed a high purity of purified Flag-BAF155 and Flag-BAF170 proteins as their elution samples (elution 1–3, samples S6-S7, Figure 2[href=https://www.wicell.org#fig2]) show only one band.\nNote: The expression and purity of proteins in the samples can also be confirmed by Western blot analysis with anti-FLAG or antibodies against the protein(s) of interest, in our case anti-BAF155/BAF170.\nNote: amount of purified proteins could be also measured by densitometry or standard BSA- based Bradford assay.\nPool the eluted fractions containing FLAG tagged protein as detected by the Western blot analysis.\nPlace the pooled fractions from the above steps in a Vivaspin centrifugal concentrator. Fill the concentrator to the maximum volume.\nNote: In this protocol, we used VIVASPIN20, 10,000MWCO PES. The selection of the most MWCO depends on the molecular size of the sample. To obtain maximum recovery, choose a MWCO 1 to 2 the molecular size of the species of interest.\nNote: Dilute the sample up to the maximum volume before the first centrifugation step for samples smaller than the maximum device volume. This will speed up the salt removal rate.\nCentrifuge for 30 min at 1000 × g.\nEmpty the filtrate container. Refill the concentrator using fresh buffer to make concentrate back up to original volume.\nCentrifuge again as before.\nEmpty the filtrate container. Repeat the process to achieve considerable reduction in the concentration of contaminating microsolute. Transfer the concentrated, de-salted sample from the bottom of the concentrate pocket to new tubes. Keep the sample on ice.",
    "Note: Three wash cycles can typically remove 99% of initial salt content.\nCritical: Some proteins may stick to the ultrafiltration membrane. It is possible to take them off the membrane using blocking solution.\nPause Point: For long storage, it is important to freeze the protein preparation. Freeze it rapidly with dry ice/ethanol mixture or using liquid nitrogen in an attempt to prevent denaturation. Additionally, it is suggested that small aliquots of the solution be frozen to prevent multiple thaw-freeze cycles that may impair the biological activity or alter the structure of proteins. Add stabilizing agents such as glycerol (50% [w/v]). Store the sample at −20°C.\nDay 7–9: Peptide analysis\nTiming: [3.5 days]\nMembrane containing the synthesized JMJD3/Kdm6b peptides was washed and then incubated with the mixture of purified Flag-BAF155 and Flag-BAF170 proteins for 16 h. On the next day, membrane was washed and exposed to anti-Flag antibody, and a HRP-conjugated secondary antibody. Peptides on membranes were scanned for interaction between BAF155/BAF170 and synthesized peptides using enhanced chemiluminescence (ECL) reagents.\nSoak the membrane in about 5‒10 mL of methanol for 5‒10 min.\nNote: The above step helps to prevent the aggregation of hydrophobic peptides in the following TBST washing steps.\nRinse the membrane with TBST with four times shaking for 5 min each.\nBlock the membrane with the prepared blocking solution for 1 h at 20°C‒25°C.\nMove the membrane into new blocking, containing 5 μg/mL of purified Flag-BAF155 and Flag-BAF170 protein solution and incubate it for 16 h at 4°C.\nNote: Different proteins may require different concentrations to achieve optimal interaction affinity. The purity of proteins is also a factor that influences the amount of protein used for the experiment. Thus, appropriate concentrations of protein should be used according to one’s experience.",
    "Rinse the membrane with TBST with shaking for four times, 5 min each.\nDetect the protein-peptide binding by incubating the blocked membrane first with anti-Flag (dilution 1:1000) primary antibody in blocking solution.\nKeep the membrane at 4°C with slow shaking for 16 h.\nRinse the membrane with TBST with shaking for four times, 5 min each.\nIncubate the membrane in blocking solution, containing appropriate HRP-conjugated secondary antibody (dilution 1:5000) at 20°C‒25°C rocking for 1‒2 h.\nRinse the membrane with TBST with shacking for four times, 10‒15 min each.\nDetect signals of HRP reaction using ECL Plus detection reagents.\nCover the membrane with 1 mL of SuperSignal west substrate solution and incubate for 1 min.\nPlace the X-ray film against the membrane in a light-proof cassette and expose for an appropriate time period from 15 s to 10 min.\nDevelop the X-ray film with an X-ray film developer.\nNote: To obtain an optimal signal, several X-ray films should be exposed for different time periods (e.g., 15 s, 1 min, 3, min, 5 min and 10 min).\nNote: Multimedia presentation for procedure of X-ray film signal detection with chemiluminescent reagents can be obtained from (Gallagher and Chakavarti, 2008[href=https://www.wicell.org#bib3]) and freely accessible at PubMed Central portal.\nOptional: If detection of the protein-peptide binding by anti-Flag primary antibody causes a high background or low signal on the X-ray film or for interaction detection of synthesized peptides with either BAF155 or BAF170, the membrane can be stripped (see below steps: 71‒88) and should be incubated with either anti-BAF155 or anti-BAF170 antibody (dilution 1:200).\nNote: The membrane can be re-used several times to detect the interaction of the spotted peptides and proteins of interest.",
    "Critical: If the membrane is not directly used in the next experiment, it should be wetted with TBST solution and kept in a heat-sealed polyester bag for a long-term moisture condition at 2°C‒8°C. Avoid membrane dry out.\nStripping and re-probing\nStripping to remove transient PPI, primary and secondary antibodies, and re-probing of the membrane should be done for several purposes: (1) analysis of a given membrane using different purified protein and antibodies; (2) confirmation of the results with the same or different antibody; (3) correction of errors or improvement of exposing signal (e.g., high background, weak signal) by incubation of the membrane with new antibody or under new condition.\nThe below three protocols (stripping protocol 1‒3) describe the stripping procedure with their increasing harshness. It should be noted that the stripping can be performed for several times for new staining, although the signal on exposed X-ray films from the membrane may become weaker with higher background after additional stripping round(s). Generally, the membrane should be tripped with the milder protocol (stripping protocol 1) first. With this gentle condition, the stripping on membrane could be repeated for probing with several new proteins. If the signal is still detected after stripping with the protocol 1, then the membrane should be stripped with harsher conditions (protocol 2 or 3). Nevertheless, membrane can be stripped only limited number of times in these stringent conditions.\nStripping protocol 1\nTiming: 1 h\nThis protocol uses Re-BlotWestern Blot Recycling kit (Chemicon, Cat# 2060), which contains 10× Stripping buffer I and 20× milk-based Blocking Buffer. By using this protocol, the membrane can be re-used for several peptide assays.\nIncubate membrane in 1× stripping buffer I with gentle shaking for 10‒15 min at 20°C‒25°C.",
    "Note: It may be necessary to increase the stripping incubation time (additional 5‒10 min) when using membrane that have been stripped previously.\nAdd an equal volume of 1× blocking buffer.\nWash/rinse blots two times 5 min with PBS.\nCheck the success of the stripping by exposing the membrane with ECL Plus detection reagents and with X-ray film for about 10 min to confirm the complete removal of transiently interacting protein and bound antibodies.\nRe-block for 10 min with 5% milk in PBS.\nThe blot is now ready for reprobing with protein (e.g., purified Flag-Brg1 protein) and antibodies (e.g., Flag or Brg1 antibody) as in the above steps: 63‒70.\nStripping protocol 2\nTiming: 2 h\nRinse the membrane thrice with ddH2O for 10 min.\nRinse the membrane with stripping buffer II at least four times for 30 min at 50°C.\nNote: Avoid temperatures more than 50°C since it will cause damage to the membrane and/or the peptides.\nWash the membrane with 10× PBS at least thrice for 20 min each at 20°C‒25°C.\nWash thrice for 20 min with TBST at 20°C‒25°C.\nWash thrice for 10 min with TBS at 20°C‒25°C.\nCheck the success of the stripping by exposing the membrane with ECL Plus detection reagents and with X-ray film for about 10 min to confirm the complete removal of transiently interacting protein and bound antibodies.\nStripping protocol 3\nTiming: 1 h\nIf signal is still observed in the above protocol 2, then rinse the membrane with ddH20 twice for 10 min each.\nIncubate the membrane with stripping buffer IIIA three times for 10 min each.\nIncubate the membrane with stripping buffer IIIB three times for 10 min each.\nRinse the membrane with ddH20 twice for 10 min each.\nWash the membrane with TBST three times for 10 min each.",
    "Check the success of the stripping by exposing the membrane with ECL Plus detection reagents and with X-ray film for about 10 min to confirm the complete removal of transiently interacting protein and bound antibodies.\nOptional: If spots still remain repeat stripping protocol 3."
  ],
  "subjectAreas": [
    "Protein Expression And Purification",
    "Proteomics",
    "Protein Biochemistry",
    "High Throughput Screening"
  ],
  "bigAreas": [
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}