{
  "id": 6754,
  "origin_website": "Bio",
  "title": "Estimating Cellular Abundances of Halo-tagged Proteins in Live Mammalian Cells by Flow Cytometry",
  "procedures": [
    "Cell cultureNote: Perform all cell culture procedures in a biosafety cabinet to maintain sterility. General guidelines to perform cell and tissue culture are available from different organizations/companies [Abcam (Reference 1); ATCC (Reference 4); ECACC (Reference 11); LifeTechnologies (Reference 18)]. Culture your cell line(s) of interest side-by-side with the U2OS C32 cell standard you received from our lab. To thaw U2OS cells:Warm up U2OS media (Recipe 4) in a water bath set to 37 °C.Add 9 ml of U2OS media to a 15 ml conical tube.Put the cryovial in the 37 °C water bath and gently swirl until almost completely thawed.With a P1000 pipet, transfer the content of the cryovial (1 ml or less) to the 15 ml conical tube and invert the tube a few times.Spin cells down in a tabletop centrifuge (200 x g, 5 min, at room temperature).Aspirate the supernatant, flick the tube to resuspend the cells and add 10 ml of U2OS media.Plate to a 100-mm tissue culture dish and put cells overnight in the incubator set at 37 °C and 5.5% CO2.When cells are ready (60-80% confluent) split them to 6-well platesNote: We normally perform the labeling experiment in 6-well plates, but you can scale it up or down as required. Warm up U2OS media and 1x PBS in a water bath set to 37 °C, and trypsin at room temperature.Take the 100-mm plate out of the incubator.Aspirate media and wash with 10 ml of 1x PBS.Aspirate PBS and add 1.5 ml of trypsin.Move plate to the incubator for 1-2 min or until the cells look round and partially detached under a microscope (hitting the side of the plate with your hand helps detaching most of the cells).Add 10.5 ml of U2OS media and pipet extensively up and down to achieve a single-cell suspension.",
    "Distribute the cell suspension to 6-well microplates. Seed at least 2 wells per cell type: one to be left unlabeled to measure background fluorescence and the other to be stained with TMR. One ml of cells per well will give you enough cells to perform staining and flow cytometry the day after seeding (1 ml will contain ~250,000-500,000 U2OS cells when starting from a 60-80% confluent 100-mm plate). Use less if you need to delay the experiment (e.g., 0.5 ml to wait one additional day or 0.25 ml to wait a couple of days).Note: We suggest you create your own stocks of the U2OS C32 cell standard at this point. To freeze U2OS cells, spin down all the cells you spare in a 15 ml conical tube. Resuspend the pellet in freezing media (Recipe 5) and aliquot to cryovials (we typically prepare 2 vials starting from a confluent 100-mm plate, resuspending the pellet in 500 μl to 1 ml of freezing media per vial). Add media to 2 ml final volume and put plates back in the incubator.TMR labelingNote: When working with fluorophores, try and minimize light exposure (e.g., keep the hood’s lights off, cover plates and tubes with foil). Pre-warm 1x PBS, U2OS media and any other media required for your specific cell line(s) at 37 °C, and trypsin at room temperature. You will need ~5 ml of media per each well of the 6-well plate.Note: If your cell line of interest grows in suspension, spin cells down to replace media or to perform PBS washes. Because the cells will not need trypsinization, after the 5 min incubation to wash off unreacted ligand you can perform a PBS wash and directly resuspend cells in fresh media for flow cytometry. Thaw the 5 mM TMR-HaloTag® ligand provided by Promega.",
    "Dilute 1:10 in DMSO to create a 1,000x stock solution (500 μM) and make smaller aliquots to be stored at -20 °C (e.g., dilute 10 μl to 90 μl DMSO and prepare 10x 10 μl aliquots). Avoid freeze-thawing the 1,000x stock if you can, although a few freeze-thawing cycles should not be an issue.Prepare 1.5 ml of labeling media per each well to be stained, diluting the 1,000x TMR-HaloTag® ligand stock in cell culture media (1:1,000 dilution: 1.5 μl in each 1.5 ml of media). Remember to leave 1 well unlabeled for each cell line to be measured.Take out the 6-well plates you prepared the previous day(s) from the incubator.Aspirate the regular cell culture media and add 1.5 ml of either labeling media (labeled wells) or regular media (unlabeled wells for background measurement).Transfer the plates back to the 37 °C incubator for 30 min.Aspirate the supernatant and wash with 4 ml of 1x PBS.Aspirate the PBS and add 2 ml of regular media.Transfer the plates back to the 37 °C incubator for 5 min to remove unreacted ligand.Collect cells for flow cytometryTrypsinize cells. For each well:Wash with 2 ml 1x PBS.Aspirate PBS and add 300 μl of trypsin.Move the plates back to the 37 °C incubator as long as needed to detach the cells.Inactivate trypsin by adding 900 μl of cell culture media.Resuspend each well up and down a few times with a P1000 and transfer the contents to a 1.5 ml Eppendorf tube.Spin cells down in a microfuge (200 x g, 5 min, at room temperature).Resuspend cell pellets in 500 μl of fresh media.Transfer cells to flow cytometry test tubes passing them through the tubes’ cell strainer snap cap.Store tubes on ice, protected from light, and proceed immediately to flow cytometry.",
    "Measure fluorescence intensities by flow cytometryMost flow cytometers and software will work, but here we illustrate the protocol using a BD LSRFortessaTM instrument and the associated BD FACSDivaTM acquisition software.Note: If you are using a different flow cytometer and/or a different acquisition software, refer to their operation manuals. If you are not familiar with flow cytometry, we advise running at least the first flow analysis with an experienced user. Also, we suggest to set up the flow cytometry experiment and adjust all the required settings in advance, so that the stained cells only sit on ice for a limited time (~20 min). Turn on the BD LSRFortessaTM flow cytometer and the computer connected to it.Open the BD FACSDivaTM acquisition software and wait for the cytometer to connect. If you are not familiar with the software, you can find the complete reference manual for the 6.0 version at https://www.bu.edu/flow-cytometry/files/2010/10/BDFACSDivaSoftwareReferenceManual.pdf[href=https://www.bu.edu/flow-cytometry/files/2010/10/BDFACSDivaSoftwareReferenceManual.pdf].If a “CST Mismatch” window appears, click on “Use CST Settings”.In the upper menu bar, click “View” and make sure the following items are checked, and thus the corresponding window open: Toolbar, Status Bar, Browser, Cytometer, Inspector, Worksheet and Acquisition Dashboard.In the upper menu bar, click “Experiment” and choose “New Experiment” from the dropdown menu.Select a blank template. Your experiment will now appear as an opened book in the Browser window. Right-click on the experiment name and click “Rename” to assign a different name.Below the experiment icon in the Browser window, click on “Cytometer Settings”.Move to the Inspector window to setup the Cytometer Settings. In the “Parameters” tab, select and delete everything but FSC (forward scatter), SSC (side scatter) and PE-Tx-Red-YG (for TMR staining; the instrument will use a 561-nm laser as an excitation source and read the emission through a 610/20 band pass filter or similar (TMR emission max is ~585 nm).",
    "If you are using a different fluorophore, modify accordingly. Check “A” and “H” for the FSC and SSC parameters to record the signal area and height (this will allow you to distinguish single cells from doublets during analysis). For the PE-Tx-Red-YG parameter, check “A” and “Log”, for the data to be in logarithmic scale.Move back to the upper menu bar, click “Experiment” and choose “New Specimen” from the dropdown menu. A Panel Template window will appear. Click “OK”. A new specimen will be created (syringe icon) as a dependent of your open experiment in the Browser window. Right-click on the specimen name and change it to today’s date (YYYYMMDD).In the Browser window, select the Global Worksheets and then move to the Global Worksheet window.Draw a dot plot (5th button from the left in the window toolbar, click and drag anywhere in the sheet; the dot plot will appear as you release the mouse).Create a polygon gate (14th button from the left) by positioning the cursor inside the dot plot and clicking several times to draw your shape of choice. You will adjust the gate to select live cells later, when acquiring your sample.Create a histogram plot (7th button from the left) and, if needed, click on the x-axis to change the displayed parameter to PE-Tx-Red-YG.With the histogram plot selected, move to the Inspector window and check “P1”. This will only display the TMR signal from the live cells that you gated in 12.Move back to the Browser window.Expand the specimen icon by clicking on the “+” sign to expose the “Tube” icon. Right-click on it and rename it with your sample name (U2OS_C32_unlabeled).Click on the left grey pointer to select the sample you have just created.",
    "Take your first sample (U2OS_C32_unlabeled), vortex briefly, remove the cap and load it on the flow cytometer.Set the flow rate to low using the “LO” button in the instrument control panel.Hit the “RUN” button in the instrument control panel.Go back to the Diva software, move to the Acquisition Dashboard and hit “Acquire” to visualize your cells in the Worksheet window.In the Cytometer window, adjust FSC and SSC voltages to distinguish dead from live cells in the Worksheet dot plot (for U2OS we use ~220 for the FSC and ~280 for the SSC). In the Acquisition Dashboard window, hit “Restart” to only visualize the cells acquired with the adjusted voltages. Now you can adjust your P1 gate to only include live cells.Note: Forward and side scatter values vary from cell to cell depending on cellular size (FSC) and internal complexity (SSC). Live cells have larger FSC and SSC values than dead cells or cell debris, and normally constitute the majority of the population. Cell doublets/aggregates will have higher FSC and SSC values than single cells but should not represent the majority of cells, if you have thoroughly resuspended the samples (you will exclude doublets at the analysis stage. See Step E5 below). Back to the Inspector window, adjust the PE-Tx-Red-YG voltage to move the Worksheet histogram to the leftmost part of the x-axis while still displaying all the events (for U2OS we use ~520).In the Acquisition Dashboard window, hit “Stop Acquiring”, and in the instrument control panel hit “STNDBY” to pause acquisition.Quickly check other unlabeled samples to make sure that the voltages you chose for U2OS cells are reasonable for the other cell types as well. If not, adjust them as necessary.Notes: We usually run water between one sample and the other, to avoid cross-sample contamination.",
    "When working with different cell types you might need to move the P1 gate between one cell type and the other. However, you must find voltage values that are acceptable for all cell types and keep them constant during acquisition of all samples. Go back to your original sample. Repeat Steps D18-D21. If no further voltage adjustments are required, in the Acquisition Dashboard window modify the Acquisition Setup to decide which Stopping Gate to use (choose P1) and how many Events to Record (choose 50,000). In case you need to re-adjust voltages, go back to Step D25.Click the “Record Data” button to save data to an FCS file. Increase the flow rate to MED or HIGH to speed up the acquisition if samples are too diluted. Once the specified number of events are recorded, on the instrument control panel hit “STNDBY” to pause acquisition.In the Acquisition Dashboard window click on “Next Tube” to create the next sample. You can rename it either right-clicking on it in the Browser window or from the “Tube” tab in the Inspector window.Take the next sample and repeat Steps D18-D21 and D27-D28, until you have acquired and recorded all your samples.Perform any recommended cleaning procedure for your flow cytometer.In the Browser window, export your data by right-clicking on the specimen name. Select “Export”, “FCS files” and leave the default FCS3.0 format. Click “OK”, when prompted choose a directory where to save your data and click “Save”.Quit the BD FACSDIVATM software (from the top menu click first “File” and then “Quit”).Analyze flow cytometry data and obtain mean fluorescence intensities using the FlowJo software (see docs.flowjo.com/d2/ for full software documentation)Note: You can use the BD FACSDivaTM software for both data acquisition and analysis, instead of FlowJo.",
    "A license-free alternative is the Matlab code we used to analyze the data in our original manuscript (Cattoglio et al., 2019), available at https://gitlab.com/tjian-darzacq-lab/cattoglio_et_al_absoluteabundance_2019[href=https://gitlab.com/tjian-darzacq-lab/cattoglio_et_al_absoluteabundance_2019]. Open the FlowJo program.Drag and drop your FCS 3.0 files into the lower workspace window.Select the U2OS C32 unlabeled control.Create a gate on live cells.Double-click on the file name; this opens a dot plot of forward (FSC-A) and side scatter (SSC-A) values.Create a free-polygon gate (5th button from the top left) to enclose live cells (name it “Live Cells”).In the workspace window select the “Live Cells” gate and apply it to all samples (simply drag and drop it on the above window on the “All Samples” group).Go back to the forward and side-scatter plot; move from one sample to the next using the arrow at the top-right of the window and adjust the “Live Cells” gate as needed, dragging it around. If necessary, you can also modify the gate shape (Figure 2).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218174419_0832.jpgFigure 2. Live-cell gating in FlowJo. Forward- and side-scatter plots generated by FlowJo that illustrate the “Live Cells” gating applied to the data re-analyzed here. The gating choice is likely to affect your absolute quantifications, since cell size correlates with protein abundances.Exclude cell doubletsNote: In the original flow cytometry experiments published in Cattoglio et al. (2019) we did not record FSC-H and SSC-H values. Thus, in the re-analysis of Table 1 below we could not exclude cell doublets as recommended in Step E5. Go back to the U2OS C32 unlabeled control’s scatter plot and double-click anywhere inside the “Live Cells” gate. This will open a new scatterplot that only displays gated cells.Set the y-axis to FSC-H and the x-axis to FSC-A to exclude doublets. Single cells localize along the same diagonal, while doublets lie underneath (Figure 3).",
    "Create another free-polygon gate to only include cells along the top diagonal. Click “OK” to name it “Single Cells”.In the workspace window select the “Single Cells” gate and apply it to all samples (simply drag and drop it on the above window on the “Live Cells” subgroup).Adjust the “Single Cells” gate to each sample individually as you did in Step E4d for the “Live Cells” gate.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200218/20200218174100_2495.jpgFigure 3. Doublets exclusion in FlowJo. FSC-H and FSC-A scatter plot generated by FlowJo that illustrate single cells lying on the main diagonal (black polygon gate) and cell doublets just underneath it (red dashed gate).Obtain a mean fluorescence intensity (MFI) tableBack to the workspace, select the Table Editor and click the “Edit” tab. Click “Add Column” and select “Mean” on the left, and the “Single Cells” Population and the “PE-Tx-Red-YG-A” Parameter from the dropdown menus on the right.Click OK and go back to the “Table Editor” tab. Click on “Create Table”. This generates a table with the mean fluorescence intensities for all the samples and the unlabeled controls. To download the table as an Excel file, from the dropdown menus to the right of the “Create Table button” choose “To File” and “Excel”. Choose a “Destination” folder and hit “Create Table” again.Quit FlowJo saving the workspace.Obtain the absolute amount of your protein of interestOpen the table generated by FlowJo in Microsoft Excel.",
    "For each TMR-labeled cell line, subtract the MFI of the unlabeled sample (background fluorescence, bkg) from the MFI of each TMR-labeled sample to obtain the adjusted MFI as follows:MFIadj = MFITMR -  MFIbkg Use the MFIadj values to calculate the absolute abundance of the protein of interest (nPOI) as follows: nPOI = (MFIadj,COI) ÷ (MFIadj,C32) × 109,800 where MFIadj,COI is the adjusted mean fluorescence intensity of the cell line of interest (COI) that expresses the Halo-tagged protein under investigation, MFIadj,C32 is the background-subtracted mean fluorescence intensity of the C32 cell standard and 109,800 is the absolute amount of Halo-CTCF we estimated in our standard U2OS C32 cell line.Average nPOI obtained over several biological replicates to get mean and standard deviation values.Table 1 details a FlowJo re-analysis of the original data published in Cattoglio et al. (2019). You can download the raw FCS 3.0 files from github at https://gitlab.com/tjian-darzacq-lab/cattoglio_et_al_absoluteabundance_2019/tree/master/Data[href=https://gitlab.com/tjian-darzacq-lab/cattoglio_et_al_absoluteabundance_2019/tree/master/Data]. Note that FSC/SSC gating can affect final absolute estimates, because cells of different size will also have different protein amounts (the gating applied in FlowJo for these samples is in Figure 2). The numbers we report here for mouse embryonic stem cells thus vary from those we initially published. Specifically, we now estimate ~539,000 ± 36,500 Sox2 molecules (vs. ~460,500 ± 25,600 in Cattoglio et al., 2019) and ~111,000 ± 32,000 TBP molecules (vs. ~99,100 ± 29,100 in Cattoglio et al., 2019)Table 1. Absolute quantification of Sox2 and TBP in mouse embryonic stem cells. For each cell line, where a different protein of interest (POI) is endogenously Halo-tagged, the table reports flow cytometry fluorescence values (MFI, mean fluorescence intensity) obtained in 4 biologically independent replicates, separated by commas. We then subtract the background fluorescence of the unlabeled sample to obtain adjusted MFI values (MFIadj).",
    "We finally use these values to calculate absolute abundances of Sox2 and TBP in the mouse embryonic stem cell (mESC) lines C3 and C41, as detailed in Steps F2 to F4. The nPOI we report in the last column is the absolute quantification averaged across the 4 replicates ± standard deviation.table:",
    "﻿0,1,2,3,4\nCell line,POI,MFI (A.U.),MFIadj,nPOI\nU2OS_unlabeled,,\"574, 1071, 1216, 513\",Subtracted from C32,\nU2OS_C32_TMR,CTCF,\"7761, 10883, 10978, 5285\",\"7187, 9812, 9762, 4772\",\"109,800; standard\"\nmESC_unlabeled,,\"451, 616, 640, 309\",Subtracted from C3 and C41,\nmESC_C3_TMR,Sox2,\"32260, 49995, 49373, 25052\",\"31809, 49379, 48733, 24743\",\"538,996 ± 36,512\"\nmESC_C41_TMR,TBP,\"6434, 9036, 9562, 7175\",\"5983, 8420, 8922, 6866\",\"110,991 ± 31,549\"\nA.U.: fluorescence arbitrary units"
  ],
  "subjectAreas": [
    "Cell Biology",
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}