{
  "id": 5044,
  "origin_website": "Bio",
  "title": "Respiratory Syncytial Virus Infection in Mice and Detection of Viral Genomes in the Lung Using RT-qPCR",
  "procedures": [
    "Infection (Figure 1)Note: This section describes the infection of Balb/C mice with RSV using the intranasal route. Dilute RSV stock [for preparation of RSV stocks see Sun and López (2016)] in sterile PBS to a concentration of 5 x 106 TCID50 / 35 μl. Keep the diluted virus on ice.Anesthetize the mice with 40 μl/20 g of weight of Ketamine/Xylazine solution. Make sure each mouse is completely asleep and unresponsive to a toe pinch stimulus.Hold the mouse vertically with the head tilted back and slowly deliver 35 μl of virus dilution into its nostrils using a 100 μl pipette. The solution should be completely aspirated into the lung and not be swallowed through the mouth.Place the mouse back into its cage and monitor it until it wakes from anesthesia.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160518/20160518194725_4170.pngFigure 1. Procedure for intranasal immunization of mice. A. Use a P100 pipette to administer 35 μl of virus solution per mouse. B. Hand-hold a fully-anesthetized mouse vertically and place the virus solution into its nostril drop by drop. C. Place the mouse back into its cage and monitor it until it awakens.Lung tissue collectionNote: This section describes the collection of infected tissue from mice to later examine viral load.Prepare collection tubes: For each sample, add 1 ml TRIzol into one MP Fastprep tube containing one ceramic sphere. Other similar homogenizing techniques can be used.Euthanize the mice at the desired time point post infection (usually 6 h, 10 h, 24 h, and daily for up to one week) using CO2 or other approved method. Place a dead mouse on polystyrene foam and pin each limb with needles, belly up.Spray the fur of the mouse using 70% ethanol.Use scissors to cut open the abdominal and thoracic cavities. Opening the abdominal cavity exposing the underside of the diaphragm.",
    "Use scissors to pierce through the diaphragm. Cut away the ribcage of the mouse and fully expose the heart and lungs. Collect two of the left lobes and place into a Fastprep tube containing TRIzol. Always take the same lobes of the lung to maintain consistency. Other lobes can be used for other purposes. Homogenize the lung on the FastPrep-24 homogenizer or similar equipment. Homogenize for 20 sec. Repeat three times.Aliquot the homogenized samples into 500 μl aliquots. Place them at -80 °C for storage.Total RNA extraction Note: This section describes the extraction of RNA from infected tissue, which will be later used for detection of viral genomes.Thaw one aliquot and add 500 μl of fresh TRIzol for a 1 ml total volume.Add 200 μl of chloroform and shake vigorously for 15 sec. Leave for 3 min at room temperature to allow for phase separation. Centrifuge for 15 min at 12,800 x g in a microcentrifuge at 4 °C. Carefully collect 3/4 of the upper aqueous phase without disturbing or touching the interface or organic layer. Combine the aqueous phase with an equal volume of isopropanol. Gently invert to mix.Leave for 10-20 min at -20 °C for precipitation.Centrifuge for 15 min at 12,800 x g in a microcentrifuge at 4 °C.Discard the supernatant with care not to lose the pellet.Wash the pellet with 1 ml of 75% ethanol. Vortex briefly or pipette up and down the sample multiple times. Centrifuge for 10 min at 12,800 x g in a microcentrifuge at 4 °C.Remove the supernatant and invert the tubes. Allow the pellet to air-dry until clear. Resuspend the pellet in 30-40 μl of ultra-pure nuclease-free dH2O.Incubate at 65 °C for 5 min. Measure RNA concentration in a Nanodrop 1000 or equivalent.",
    "Reverse transcription (RT)Note: This section describes the conversion of total RNA prepared in section C into cDNA. In brief, mRNAs are converted into total cDNA (T-cDNA) using oilgo-dT. This cDNA will be then used to amplify housekeeping genes as controls. RSV genomes are converted into viral genome cDNA (V-cDNA) using an RSV genome RT primer that specifically binds to the 5’ end of the genome. V-cDNA will be used for the amplification of RSV viral genomes.D1. RT of total mRNA (T-cDNA)Use 2 μg of RNA for reverse transcription.Prepare the RT reaction mix in PCR tubes on ice using the High Capacity RNA-cDNA kit as follows (per sample): 2x RT buffer 5 μl, 20x RT Enzyme mix 0.5 μl, RNA 2 μg, nuclease-free H2O quantity sufficient to 10 μl. Note: The oligo-dT primers are included in the RT buffer.Gently mix and briefly centrifuge to collect all the components at the bottom of the tube.Place into a BioRad C1000 Thermal Cycler and run program to synthesize cDNA as follow: 37 °C for 60 min, 95 °C for 5 min, 4 °C hold.Store total cDNA (T-cDNA) at -20 °C until ready for qPCR analysis.D2. RT of viral genomes (V-cDNA)Use 2 μg of RNA for reverse transcription.Mix the following ingredients per sample in one tube: 1 μl of the genome RT primer (50 μM), 1 μl of dNTPs (10 mM), 2 μg of RNA, nuclease-free H2O (add up to 10 μl).Incubate 10 min at 65 °C.Prepare the RT reaction mix in the PCR tubes on ice using SuperScript® III First-Strand Synthesis System as follows (per sample): 5x RT buffer 2 μl, 25 mM MgCl2 4 μl, 0.1 M DTT 2 μl, RNase OUT 1 μl, SS III 1 μl.After incubation, add 10 μl of RT mix to each sample. Mix well.",
    "Incubate at 50 °C for 50 min.Heat at 85 °C for 5 min.Add 1 μl of RNase H per sample (from SuperScript III reverse transcriptase kit) and incubate at 37 °C for 20 min.Keep the viral genome cDNA (V-cDNA) at -20 °C until ready for the qPCR analysis.Quantitative PCR (qPCR)Note: This section describes the quantification of viral genomes presented in the infected tissue. T-cDNA and V-cDNA generated from section D are used as templates for housekeeping genes and RSV genomes, respectively. The copy numbers of two housekeeping genes are used to calculate the housekeeping index (hki) that is then used to calculate the relative copy number of viral genomes. An example of the results from viral genome qPCR at day 1 post-infection in vivo is shown in Figure 2.qPCR reactions are performed in triplicate using specific primers and the Power SYBR® Green PCR Master Mixture in a Viia7 Applied Biosystem Lightcycler or equivalent. Thaw both T- and V-cDNA and spin down before use.Dilute cDNA 1:40 using dH2O.Load the plate with 4 μl of the diluted cDNA/well in triplicate.Prepare Master Mix: SYBR green (5 μl) with 1 μl of qPCR primer mix. Load the plate with Master Mix 6 μl/well. For housekeeping genes, Rsp11 and α-tubulin are examined as reference using T-cDNAs as template. For RSV genome, RSV g primer pair is used and V-cDNAs serve as template.Run the qPCR using the following program (Table 1):Table 1. DI-PCR programimgsrc:https://en-cdn.bio-protocol.org/attached/image/20160518/20160518233605_1262.pngViral genome copy numbers are normalized based on levels of Rsp11 and α-tubulin for mouse samples using the formula: relative copy number=2,500*1.93^ (Ctgenome - hki), hki=median of CtRsp11 and Ctα-tubulin. Sequences of primers used for qPCR can be found in the materials under qPCR primers. Results see Figure 2.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20160518/20160518194800_7042.pngFigure 2. RSV viral genome qPCR. Mice were infected with PBS (mock) or RSV.",
    "Lungs were harvest on day 1 post-infection and analyzed using a RSV genome RT-qPCR assay. Each dot represents RSV genome quantification per mouse."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}