{
  "id": 7525,
  "origin_website": "Bio",
  "title": "Pull-down of Biotinylated RNA and Associated Proteins",
  "procedures": [
    "Culturing yeast strains and UV-crosslinkingDay-1: Sample Growth Inoculate a single yeast colony of the strain X2159 and X2160 in 10 mL of SC-uracil and SC-leucine medium, respectively.Grow the yeast overnight at 30°C in a shaking incubator.Day-2: Sample Harvesting and UV-crosslinking Inoculate the overnight culture to a starting OD600 value ~0.1 in 100 mL of SC-uracil or SC-leucine medium in a baffled flask.Grow the yeast at 30°C in a shaking incubator until the OD600 value reaches ~0.6.Add 100 µL of 0.1 M 4-thiouracil and 500 µL of 1.0 M DTT to each culture (final concentration of 4-thiouracil=100 µM and of DTT=5 mM).Grow them for a further 3 h at 30°C in a shaking incubator.Harvest each culture in a fresh 50 mL Falcon tube by centrifugation at 2,900 rpm (291 × g) for 10 min, using an Eppendorf 5810R.Resuspend each cell pellet in 20 mL of 1× PBS and centrifuge at 2,900 rpm (291 × g) for 10 min, using an Eppendorf 5810R.Discard the supernatant and resuspend the cell pellet again in 20 mL of 1× PBS.Place each cell suspension into a petri dish (150 mm × 15 mm) and UV-crosslink for 2.5 min twice, with a 2 min interval, using a Stratalinker 2400 UV crosslinker.Transfer the cells into a 50 mL Falcon tube and centrifuge at 2,900 rpm (291 × g) for 10 min, using an Eppendorf 5810R.Discard supernatant and store the cell pellet at -20°C.Preparation of whole cell extract (WCE)Day-3: Whole cell extract preparation and fractionation Prepare Buffer A and keep it on ice for 5–10 min.Take out the cell pellets from -20°C and immediately add 1 mL of Buffer A.Resuspend the cells and place them in a fresh 1.5 mL microcentrifuge.Add 500 µL equivalent of 0.5 mm zirconia beads to each cell pellet.",
    "Break the cells using a vortexer for 10 min at 4°C.Centrifuge the broken cells at 10,000 rpm (9,300 × g) for 10 min at 4°C using an Eppendorf centrifuge (5415R).Collect the supernatant (WCE) which contains RNA-protein mixture in a fresh 1.5 mL microcentrifuge tube.Add 1 mL of Buffer A and repeat Steps B6 and B7. Collect the supernatant, and pool to the previously RNA-protein mixture.Clarify the RNA-protein mixture by centrifugation at 13,000 rpm (15,700 × g) for 10 min at 4°C using an Eppendorf centrifuge (5415R).Quantify protein concentration using the Bio-Rad Bradford’s reagent.Quantify RNA using a NanoDrop spectrophotometer.Pull down of biotinylated RNA-protein mixture from WCEIn a 1.5 mL microcentrifuge tube, mix 100 µL of streptavidin Sepharose resin with 500 µL of Buffer A and centrifuge at 2,000 rpm (400 × g) for 1 min using an Eppendorf centrifuge (5415R). Repeat this washing step at least five times.Add 300 µg of protein from the WCE to 100 µL of washed streptavidin Sepharose resin.Mix the reaction by inverting the tube 3–4 times and incubate at 4°C for 1 h on a nutator shaker.Centrifuge the reaction mixture at 2,000 rpm (400 × g) for 1 min using an Eppendorf centrifuge (5415R). Discard the supernatant.Resuspend the resin with 500 µL of Buffer A and centrifuge at 2,000 rpm (400 × g) for 1 min using an Eppendorf centrifuge (5415R). Repeat this washing step five times.Add 50 µL of 2× SDS-loading dye to the resin.Heat the samples for 5 min at 90°C and centrifuge at 10,000 rpm (9,300 × g) for 1 min using an Eppendorf centrifuge (5415R).Load 15 µL of supernatant on a 10% SDS-PAGE gel.Run the SDS-PAGE gel at a constant voltage of 120 V.",
    "Detection of RNA binding proteinsLoad the (i) protein ladder, (ii) input, and (iii) pull down samples on the SDS-PAGE gel. Run the SDS-PAGE gel at a constant voltage of 120 V.Coomassie staining:  Fix the gel using the fixing solution for 1 h.Remove fixing solution and stain the gel using the Coomassie staining solution for 30 min.Remove staining solution, destain the gel in destaining solution overnight, and wash 3–4 times with double distilled water.Silver staining:  Wash the gel in water twice for 5 min.Fix the gel in fixing solution twice for 15 min.Wash the gel twice in 10% ethanol for 5 min.Wash the gel twice in water for 5 min.Incubate the gel in sensitizer solution for 1 min.Wash the gel twice in water for 1 min.Incubate the gel in staining solution for 30 min.Quickly wash the gel twice with water for 20 s.Immediately add the developer solution and incubate until protein bands appear.Add the stop solution, wash gently, replace with stop solution, and incubate for 10 min.Pull down of biotinylated RNA-protein mixture and RNA isolationWash 200 µL of streptavidin Sepharose resin in a fresh 1.5 mL microcentrifuge tube with 1 mL of Buffer A at 2,000 rpm (400 × g) for 1 min. Repeat the washing step at least five times.Add 300 µg of RNA from the WCE to 200 µL of washed streptavidin Sepharose resin.Mix the reaction by inverting the tube 3–4 times and incubate at 4°C for 1 h on a nutator shaker.After incubation, spin down at 2,000 rpm (400 × g) for 1 min. Separate pellet (P) and supernatant (S) fractions.Wash the P fraction with 1 mL of Buffer A at 2,000 rpm (400 × g) for 1 min. Repeat the washing step five times.",
    "Isolate RNAs from both P and S fractions using the Trizol method (see below). Also, isolate RNA from the WCE (input).Day-3: Whole cell extract preparation and fractionation Add 1 mL of QIAzol reagent to each sample. Mix thoroughly by pipetting up and down.Incubate on ice for 5 min.Add 200 µL of chloroform and vortex thoroughly.Incubate on ice for 2–3 min.Spin down at 12,000 rpm (13,400 × g) for 15 min.Transfer the aqueous phase containing RNA to a fresh tube.Add 1 µL of RNase-free glycogen (20 µg) to the aqueous phase.Add 500 µL of isopropanol to the aqueous phase, mix gently by inverting the tube, and incubate at -20°C overnight.After incubation, spin down at 12,000 rpm (13,400 × g) for 20 min.Discard the supernatant and resuspend the pellet in 1 ml of 75 % ethanol.Vortex briefly and spin down at 10,000 rpm (9,300 × g) for 5 min.Discard the supernatant and air dry the pellet for 5–10 min.Note: DO NOT dry the pellet by vacuum centrifuge and DO NOT dry the pellet completely, to ensure the total solubilization of RNA. Resuspend the pellet in 40 µL of RNase free water.Incubate the RNA in 70°C for 3 min and immediately transfer to ice.Quantify the RNA using a NanoDrop spectrophotometer.Store the RNA at -80°C or proceed to cDNA preparation and RT-PCR.cDNA preparation and Reverse Transcriptase (RT)-PCRFormaldehyde gel electrophoresis:  Add 0.7 g of agarose to 50 mL of 1× MOPS buffer and heat to dissolve.Add 730 µL of formaldehyde and 1 µL of ethidium bromide (10 mg/mL) to the gel, mix gently, and pour the gel in a gel casting tray inside a chemical hood.RNA Sample preparation and electrophoresis:  Take 1 µg of RNA sample in 10 µL with 1× MOPS buffer and mix with 2 µL of 6× RNA loading dye.",
    "Heat the sample at 70°C for 3 min in a dry bath and immediately transfer it to ice.Load the sample onto the formaldehyde gel. Run the gel in 1× MOPS buffer at a constant voltage (80 V).Visualize RNA the in gel using a gel documentation system.DNase I treatment (for 10 µL reaction): Mix together 10 µg of RNA, 1 µL of 10× DNase I reaction buffer, and 1 µL of DNase I in a 10 µL reaction mixture.Incubate at 37°C for 10 min in a thermocycler.Add 1 µL of 0.05 M EDTA to the reaction mixture (final concentration of 5 mM).Inactivate the reaction by heating at 75°C for 10 min.cDNA preparation:  Prepare two master mixtures (MM1 and MM2) as shown below (Table 1):Table 1. cDNA preparationtable:",
    "﻿0,1,2,3\nMaster mix MM1 for 5 reactions,Master mix MM1 for 5 reactions,Master mix MM2 for 5 reactions),Master mix MM2 for 5 reactions)\nReagent,Volume (µL),Reagent,Volume (µL)\n10 mM dNTPs,5.0,5× RT buffer,20\n*RMB-specific reverse primer (10 µM),2.5,0.1 M DTT,5.0\nDEPC water,40,RNaseOUT,1.0\n,,RTase,1.0",
    "* 5’-CCCGCGACTATCTTACGCACTT-3’Add 9.5 µL of MM1 and 2 µL of RNA (1 µg/mL) in a 0.2 mL PCR tube.Incubate the reaction mixture at 70°C for 3 min.Immediately transfer the tube onto ice.Add 5.4 µL of MM2 to the reaction mixture to a final volume of 16.9 µL.Place the tube in a thermocycler with the following setting.Temperature           Time Number of cycles cDNA synthesis         50°C 45 min 1Inactivation                65°C 10 min 1Store cDNA samples at -80°C or proceed to PCR amplification.PCR amplification of 3’-BE-RMB and 5’RD-RMBUse the following primers to amplify the 3’-BE-RMB and 5’-RD-RMB cDNA.Primer Sequence (5’ to 3’) Forward primer for the 3’-BE-RMB 5’-ACGGAAAATGTACCAGAGTCGACGACG-3’Forward primer for the 5’-RD-RMB 5’-CATAACAACCTCCTCCTCCCCCACCTACG-3’Reverse primer from the RMB sequence 5’-CCCGCGACTATCTTACGCACTT-3’PCR reaction: To 20 µL of 2× PCR super mix, add 1 µL of forward and reverse primer and 2 µL of cDNA, and bring the volume to 40 µL with water.PCR conditions: Run the PCR cycle program as follows: Initial denaturation at 95°C for 2 min, then 30 cycles of denaturation: 95°C for 15 s, annealing: 55°C for 30 s, extension: 72°C for 30 s.Gel electrophoresis: Load 5 µL of PCR products on 1.5% agarose gel and run at 110 V for 30 min. Visualize the DNA bands in gel by UV light.Biotinylated RNA-bound protein digestion and clean up for Mass Spectrometry analysisTake the remaining 45 µL of protein-RNA mixture from Section C, step 6 (in 2× SDS-loading dye) and dilute this to 900 µL with MilliQ water in a 1.5 mL microcentrifuge tube.Immediately add 100 µL of 100% TCA solution, mix, and incubate on ice for 30 min.Add 400 µL of cold acetone, mix, and incubate on ice for an additional 30 min.Pellet the precipitated proteins by centrifugation at 16,000 × g for 10 min.",
    "Carefully discard 1,200 µL of the supernatant with a P1000 pipette. Then, use a P200 pipette with a gel loading tip to remove the remaining 200 µL of supernatant, without disturbing the tiny pellet formed on the side of the tube facing away from the center of the centrifuge rotor. Of note, if <2–5 µg of protein is recovered, no pellet will be visible.Add 800 µL of cold acetone, vortex, and centrifuge at 16,000 × g for 8 min.Remove supernatant in two stages as in Step 5, but only 700 µL with the P1000 and 100 µL with the P200 pipette.Add 800 µL of cold acetone, vortex, and centrifuge at 16,000 × g for 8 min.Remove supernatant as in Step 7, and leave the tube open to air-dye for 5-30 min (lay the tube sideways to prevent any air-drop contamination).Solubilize the pellet in 15 µL of 8 M urea in 50 mM AMBIC, pH 8.5, whenever the sample contains 10-80 µg of total protein. For samples with <10 µg protein, use half the volume for all the steps. For samples with >100 µg of protein, solubilize those with 8 M urea in 50 mM AMBIC, pH 8.5, to 4 µg/µL final concentration, and take 15 µL (60 µg) of that solution for the next steps.If the pellet is not solubilized completely within 30 minutes at room temperature (RT), proceed to the next step to facilitate solubilization by reducing the cysteine disulfide bridges.Add 2.5 µL of 25 mM DTT in 25 mM AMBIC, pH 8.5, and 42.5 µL of 25 mM AMBIC, pH 8.5.Incubate the tube at 56°C for 15 min.Cool to RT and add 3.0 µL of 55 mM iodoacetamide (IAA) in 25 mM AMBIC for 15 min (alkylation).",
    "Terminate the alkylation reaction by adding 8 µL of 25 mM DTT. Considering a sample with 10–80 µg of protein, the total volume would be 71 µL [15 µL of 8 M urea (Step 10), 2.5 µL of 25 mM DTT and 42.5 µL of 25 mM AMBIC (Step 12), 3.0 µL of 55 mM IAA (Step 14), and 8 µL of 25 mM DTT (Step 15)].Prepare the Trypsin/Lys-C protease mixture in 25 mM AMBIC, pH 8.5, with equal amounts (100 ng/µL) of Trypsin (Sequencing-Grade-Modified Trypsin) and Lys-C (Lysyl Endopeptidase). Add the Trypsin-Lys-C protease mixture to the protein substrate in a ratio of 1:30 (for example, 30 µg protein substrate will have 1 µg protease mixture).Use 25 mM AMBIC, pH 8.5, to bring the total volume to 100 µL (50 µL for samples with <10 µg of protein substrate).Incubate at 37°C overnight.Terminate the digestion with 2.5% TFA to 0.3% final concentration (acidification).Perform solid phase peptide extraction (according to the manufacturer’s protocol) prior to loading on the instrument. Bond Elute OMIX C18 (10–100 µL; 80 µg capacity) pipette tips from Agilent are preferred, due to binding capacity, reproducibility with small substrate amounts, and ease of use.Dry the clean peptide samples and reconstitute in 0.1% formic acid to ~0.5–1 µg/µL final peptide concentration.Inject 0.5 to 2 µL of sample for the nano LC-MS/MS analysis, depending on the sample complexity and instrument used.Analyze the sample on a hybrid linear ion trap-orbitrap mass spectrometer, where speed of MS/MS identifications in the ion trap is combined with high mass accuracy for the precursor peptides in the orbitrap. A nanoflow system for the chromatographic reverse-phase separation is also advised for greater sensitivity.",
    "Set the Ion trap-Orbitrap as follows: MS1 resolution: 120–240k, mass range: 350–1,600 m/z, CID- or HCD-type MS/MS of 20–30 most intense ions detected in MS1 scan, limited redundancy with dynamic exclusion, and MIPS filter mode-ON.Convert raw data files to mgf. file format using the Trans Proteomic Pipeline (Seattle Proteome Center, Seattle, WA) and search with the Mascot search engine (Matrix Science), or use the Proteome Discoverer suite (Thermo Fisher Scientific) without file conversion.Use Mascot search engine with static cysteine carbamidomethylation and dynamic methionine oxidation, plus asparagine and glutamine deamidation as possible modifications.Set the peptide tolerance at 10ppm and the fragment mass tolerance at 0.6Da (Ion Trap instruments).Representative data:  Experimental details used to validate the system are provided in the original published research article (Ghosh et al., 2021). In brief, we identified a previously uncharacterized protein called Pal2, which was bound to the 3’-BE-RMB. This was further confirmed by an electrophoretic mobility shift assay. The results can be accessed through the following link: https://pubmed.ncbi.nlm.nih.gov/34035143/[href=https://pubmed.ncbi.nlm.nih.gov/34035143/]."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}