{
  "id": 4723,
  "origin_website": "Bio",
  "title": "Visual Assessment of the Severity of <em>Fusarium</em> Seedling Blight (FSB) and <em>Fusarium</em> Head Blight (FHB) Disease in Barley",
  "procedures": [
    "Preparation of fungal conidial inoculumStore F. culmorum mycelia at -70 °C in 10% (vv-1) glycerol. Prior to use, culture the Fusarium isolate on potato dextrose agar (PDA) plates and incubated at 25 °C for 7 days.For conidial production, inoculate 3-4 PDA-agar plugs in 100 ml conical flask containing 25 ml Mung bean broth media (see Recipes) and incubate cultures at 200 rpm, and at 25 °C for 5 days without light. Pass the conidial suspension through two layers of sterile cheese cloth and wash three times with sterile distilled water. Resuspend conidia in 0.2% Tween 20 and determine the concentration using disposable KOVA Glasstic Slides 10. Adjust the concentration to 2 x 106 spores/ml 0.2% Tween 20. Note: For spore counting using KOVA Glasstic slides, determine the average number of spores per small grid and multiply with 90,000 to get number spores/ml. Fusarium seedling blightPlace barley seeds in a 9 cm petri plate containing 2 pieces of filter paper (90 mm diameter) soaked with 6ml of sterile distilled water.Cover the petri plates with aluminum foil and stratify in the dark for 2 days at 4 °C.Transfer plates to 21 °C in the dark for 2 days to facilitate germination.Transfer germlings to a 6 cm-diameter pot containing John Innes compost No 2 and place a 2-cm length of sterile silicon tubing (0.5-cm-diam.) as a collar around the stem base.Place plants in a climate-controlled growth room at 22 °C under long day conditions (16 h/8 h), bottom watering every second day. Relative humidity was maintained at 70%. Inoculate the stem bases of 10-day-old seedlings with a 400 μl F. culmorum conidial suspension [1 x 106 spores/ml 0.2% Tween 20 in 1% (wv-1) agar]. Treat the mock control plants with 1% agar containing 0.2% Tween 20.",
    "Note: Prepare 2% (wv-1) sterile agar solution and bring it to 50 °C. Mix the spore suspension (2 x 106 spores/ml) and the agar solution at a 1:1 ratio.Score visible disease symptoms (Figure 1) on the stems at 12 days post-inoculation using the following disease scoring system: FSB disease scores were the product of lesion length (cm) by lesion colour (lesion colour scale: 0, no disease; 1, very slight brown necrosis; 2, slight/moderate brown necrosis; 3, extensive brown necrosis; 4, extensive black necrosis) (Nicholson et al., 1998).Repeat the experiment three times, each time including three replicate pots (each containing two plants) per treatment combination in a randomised layout. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150620/20150620202104_6986.jpgFigure 1. Barley seedlings displaying symptoms of Fusarium (cultivar Lux). Ten-day-old seedlings were treated with: A 0.2% Tween 20 and 1% (wv-1) agar, or B conidia of Fusarium culmorum (strain FCF 200) in 0.2% Tween 20 and 1% agar. Disease symptoms (browning of the stem base) were visualised 12 days post-treatment.Fusarium head blightGerminate the barley seeds as described above for the Fusarium seedling blight experiments. Transfer germinated seed to a 15 cm-diameter pot containing John Innes compost No 2. Cultivate plants in the glasshouse. Add 2 g of NPK 10-10-20 fertiliser to each pot at growth stages (GS; Zadoks et al., 1974) 20 and 30.Note: For more information on different Zadoks growth stages go to http://www.cerealcentral.ca/crop-management_cereal-staging.aspx[href=http://www.cerealcentral.ca/crop-management_cereal-staging.aspx]. Treat the heads at mid-anthesis (GS 65) by injecting 4 µl of conidial suspension (5x 104 spores/ml 0.2% Tween 20) or mock 0.2% Tween 20 treatment into each of the four middle spikelets of a head. Immediately cover treated heads with a polythene bag for 48 h in order to promote Fusarium infection.",
    "Score the FHB disease symptoms (Figure 2) (percentages bleached spikelets per head) at GS 70, 80 and 90 and calculate the Area Under the Disease Progress Curve (AUDPC) [as described by Shaner and Finney (1977)]. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150621/20150621000901_1152.jpgWhere, Yi is an assessment of a disease progression (percentages bleached spikelets per head) at the ith observation, ti is time (day) at the ith observation, and n is the total number of observations (Shaner and Finney, 1977). When ripe (GS 91), harvest the cereal heads, freeze-dry for 48 h and determine the number and weight of grains in each head. Use this data to calculate the 1,000 grain weight. The glasshouse FHB disease trials should be conducted at least twice and each trial should include at least 5 replicate plants (2 heads per plant) per treatment combination arranged in a randomised layout.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20150620/20150620202132_3574.jpgFigure 2. Symptoms of Fusarium head blight in barley (cultivar Akashinriki). Four middle spikelets were injected with 4 µl of A conidia suspension of Fusarium culmorum (strain FCF 200) in 0.2% Tween 20, or B 0.2% Tween 20. Disease symptoms (percentages of bleached spikelets per head) and AUDPC were scored at GS 80. White arrow indicates the point of inoculation."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}