{
  "id": 16254,
  "origin_website": "Jove",
  "title": "Synthesis of Masarimycin, a Small Molecule Inhibitor of Gram-Positive Bacterial Growth",
  "procedures": [
    "1. General methods\nNOTE: All compounds were purchased from standard suppliers and used without further purification.\nCarry out thin-layer chromatography (TLC) on an aluminum plate precoated with silica gel XG F254. Detect spots under a UV lamp, by immersion in p-anisaldehyde stain, or by exposing to I2 vapor.\nRecord all nuclear magnetic resonance (NMR) spectra on a 400 MHz spectrometer.\n\tNOTE: 1H- NMR and 13C-NMR spectra were referenced to residual solvent peaks. Coupling constants are given in [Hz] and chemical shifts in [ppm].\nRecord atmospheric pressure chemical ionization (APCI) mass spectrometry spectra of masarimycin on a compact mass spectrometer equipped with an atmospheric solids analysis probe.\n2. General procedure for preparation of masarimycin\nNOTE: Perform the below steps in a fume hood.\nPrepare a 0.1 M solution in methanol of each reactant: cyclohexylamine, cyclohexyl carboxaldehyde, o-iodobenzoic acid, and cyclohexyl isocyanide35.\n\tCAUTION: Cyclohexylamine, cyclohexyl isocyanide, and cyclohexyl carboxaldehyde are flammable. They can cause skin corrosion and induce oral, dermal, respiratory, or reproductive toxicity. Keep compounds away from open flames, hot surfaces, and ignition sources. Wear appropriate skin and eye protection, work in a well-ventilated area and avoid inhalation of vapors or mist. For storage, keep bottles tightly closed and store them in a cool, dry place. Store cyclohexyl carboxaldehyde in a desiccator under an N2 atmosphere.\nMix 5 mL of cyclohexylamine (0.1 M solution in methanol) and 5 mL of cyclohexyl carboxaldehyde (0.1 M in methanol) in a capped round bottom flask and stir the solution using a magnetic stir bar on a stir/hot plate for 30 min at 40 °C in a sand bath. Monitor temperature using a thermometer placed approximately 1 cm below the sand surface.",
    "After 30 min, add 5 mL of cyclohexyl isocyanide (0.1 M solution in methanol) to the solution from step 2.2 and stir for an additional 20 min at 50 °C. Lastly, add 5 mL of o-iodobenzoic acid (0.1 M solution in methanol) to the reaction mixture and continue stirring at 55 °C for 3-5 h.\nMonitor the progress of the reaction periodically by TLC approximately every hour after the above reaction mixture had been stirred for 3 h.\nCut a 3 cm x 6 cm strip of aluminum-backed TLC plate. Using a #2 pencil, draw a line approximately 1 cm from the bottom. Using a glass microcapillary, spot approximately 5 µL of the reaction mixture onto the TLC plate and allow it to dry.\nTo a 150 mL beaker, add enough mobile phase (90:10 hexane: isopropanol) to cover the bottom of the beaker. Using a pair of tweezers, carefully place the above TLC plate into the beaker ensuring that the TLC plate enters the mobile phase evenly. Cover the top of the beaker with a piece of tinfoil.\n\tNOTE: Ensure that the mobile phase does not cover the line and spotted sample.\nAllow the mobile phase to travel up the TLC plate until it is approximately 1 cm below the top of the plate. Remove the TLC plate and using a pencil, draw a line indicating the distance traveled by the mobile phase. Allow the TLC plate to dry in a fume hood.\nOnce dried, place the TLC plate in a beaker containing a small amount of solid I2 and cover the beaker with a piece of tin foil. Monitor the TLC for the development of yellow/brown spots. Once developed, remove the TLC plate and mark the location of the spots using a pencil (Supplementary Figure 1).",
    "NOTE: If I2 spots are not marked, the stain will dissipate over time. Spots can also be visualized on the TLC plate by UV-light, p-anisaldehyde staining, or potassium permanganate staining (see Supplementary Information).\nCalculate Rf values for all visualized spots using the following formula:\n\tRf = imgsrc://cloudfront.jove.com/files/ftp_upload/63191/63191eq01.jpg\nConsider the reaction complete when only one spot with Rf = 0.3 is visible on the TLC plate. Remove the solvent in a rotatory evaporator under reduced pressure and dry the crude product (obtained as a yellowish-brown oil) under a high vacuum until all methanol is evaporated.\nDissolve the dried crude product in 30 mL of ethyl acetate and transfer it to a separatory funnel. Extract ethyl acetate sequentially with 1 M HCl (2 x 30 mL), H2O (30 mL), saturated NaHCO3 solution (2 x 30 mL), H2O (30 mL) and saturated NaCl solution (2 x 30 mL). Discard the aqueous layers.\n\tNOTE: The ethyl acetate layer is the top layer in each of the extractions. For each extraction, vigorously shake the separatory funnel containing the ethyl acetate and aqueous solution (HCl, H2O, NaHCO3, or NaCl) and allow the layers to fully separate.\nRemove the ethyl acetate layer from the separatory funnel and collect it in an Erlenmeyer flask. Add a spatula full of Na2SO4 (anhydrous) to remove residual water from ethyl acetate.\n\tNOTE: The ethyl acetate solution is considered dry when Na2SO4 in the flask runs freely and does not clump. If Na2SO4 is clumping, an additional spatula of Na2SO4 can be added.",
    "Filter the dried ethyl acetate solution through #1 filter paper to remove Na2SO4. Wash the filter paper with a small amount of ethyl acetate. Place the filtered ethyl acetate solution in a round bottom flask and remove the solvent on a rotatory evaporator under reduced pressure to obtain masarimycin as oil once all the ethyl acetate is removed.\nDissolve the masarimycin oil obtained above in a minimal amount (1-2 mL) of 9:1 hexane: isopropanol and stir on a magnetic stir plate until all the compound is dissolved.\nPurify the dissolved masarimycin by flash chromatography using a 12 g normal phase silica flash column.\n\t\nEquilibrate the flash column with 10 column volumes of mobile phase (99:1 hexane: isopropanol) with the instrument set at a flow rate of 15 mL/min.\n\t\tNOTE: After equilibration is completed, stop the flow and disconnect the top of the column from the system.\nDraw up dissolved masarimycin using a 5 mL syringe. Connect the syringe directly to the top of the equilibrated flash column and inject the solution into the column. Reconnect the loaded column to the flash chromatography system and initiate the gradient elution.\nElute masarimycin from the column using gradient elution to a final mobile phase concentration of 10:90 hexane: isopropanol over 12 column volumes. Monitor the elution of masarimycin via absorption at 230 and 254 nm.\nCollect the compounds eluted from the column by a fraction collector that collects 20 mL of solvent per fraction.\n\t\tNOTE: If a flash chromatography system is not available, purification of masarimycin can be performed via a gravity silica column with a 3:1 (hexane: ethyl acetate) mobile phase. Fractions containing masarimycin can be identified by TLC using the same mobile phase. Visualization of TLC spots was done with either UV light, I2 vapor, or potassium permanganate staining.",
    "Identify fractions containing masarimycin by TLC (steps 2.5-2.9) or mass spectrometry on a compact mass spectrometer equipped with an atmospheric solids analysis probe. Dry the final product under vacuum (~0.3 mbar).\n\t\tNOTE: Masarimycin is routinely obtained as a colorless oil or solid with a yield of 55%-70% with respect to mmol of cyclohexyl carboxaldehyde added to the reaction. Calculate the final yield of masarimycin by obtaining the mass of the purified masarimycin and calculating the theoretical yield of the reaction using the following formula:\n\t\t% yield = imgsrc://cloudfront.jove.com/files/ftp_upload/63191/63191eq02.jpg x 100%\nConfirm the structure of masarimycin by NMR.\n\t\nDissolve ~10 mg of masarimycin sample in 0.5 mL of CDCl3. Using a Pasteur pipet, transfer the solution to a 5 mm NMR tube and cap the tube. Place the NMR tube in the spectrometer.\nAcquire 1H and 13C NMR spectra using manufacturer preset experiments. Chemical shift assignments and representative spectra are provided in Supplementary Figures 3-4.\nStore masarimycin dry or dissolved in DMSO (25 mM final concentration) at -20 °C until use.\n3. Microwave procedure for preparation of masarimycin\nPrepare 0.6 M solutions of cyclohexylamine, cyclohexyl carboxaldehyde, cyclohexyl isocyanide, and o-iodobenzoic acid in acetonitrile.\nAdd a stir bar and 10 mL of acetonitrile to a glass microwave reaction vial.\nAdd 2 mL of cyclohexylamine (0.6 M in acetonitrile), 2 mL of cyclohexyl carboxaldehyde (0.6 M in acetonitrile), and 7 mL of acetonitrile to the vial.\nPlace the microwave reaction vial in the microwave carousel. Stir the mixture, heat it for 30 min at 50°C at a power setting of 400 W, and allow it to cool to room temperature.",
    "Add 2 mL of o-iodobenzoic acid (0.6 M in methanol) and 2 mL of cyclohexyl isocyanide (0.6 M in acetonitrile) to the vial. Stir the mixture, heat it to 100 °C in the microwave for 40 min at a power setting of 400 W and allow it to cool to room temperature.\nMonitor the progress of the reaction by TLC (90:10 hexane: isopropanol) using I2 vapor after the completion of step 3.5.\n\tNOTE: If TLC shows that the reaction is incomplete (i.e., multiple spots on TLC), place the reaction vial back in the microwave and set the microwave conditions described in step 3.5.\nOnce the reaction is complete, pour the solution into a 100 mL round-bottom flask and evaporate it to dryness using a rotary evaporator.\nFollow steps 2.6-2.16 above to complete the aqueous workup, purification, and characterization of masarimycin.\n4. Synergy and antagonism assay\nGrow Streptococcus pneumoniae R6 on Mueller-Hinton (MH) agar plates containing 5% (v/v) sheep blood at 37 °C under anaerobic conditions. In all experiments, use second passage cells grown in 5 mL of MH broth at 37 °C under anaerobic conditions until OD600 is ~0.4.\nSubject the inhibitors masarimycin and optochin to serial 1:2 dilutions in respective solvents, with the resulting concentrations flanking the minimum inhibitory concentration (MIC) values of each inhibitor.\n\t\nMake the initial dilution of masarimycin in dimethyl sulfoxide (DMSO) until a concentration of 100 µM is reached. From this point, make masarimycin dilutions in MH broth. Prepare optochin stock solution (3.5 mM) by dissolving commercially available optochin (see Table of Materials) in sterile MH broth.\n\t\tNOTE: Masarimycin stock solutions were made at 25 mM in DMSO.",
    "To a sterile 96-well microtitre plate, add 2 µL aliquots of each optochin dilution to each row of the plate. To the same plate, add 2 µL aliquots of each masarimycin dilution to each column to create an array of optochin and masarimycin concentrations on the plate (Figure 2).\nAdd sterile MH broth (93 µL) to each well containing the above inhibitors. Inoculate the microtitre plates with 5 µL of culture (OD600 ~0.4) from step 4.1.\n\tNOTE: Inoculation of the 96-well plate is typically done under anaerobic conditions in an anaerobic workstation. The final volume in the well is 100 µL.\nGrow cultures for 18 h at 37 °C under anaerobic conditions, followed by the addition of 30 µL of 0.01% (m/v) solution of resazurin sodium salt. Incubate the plate at room temperature for 15 min to allow the formation and stabilization of color.\n\tNOTE: Resazurin solution is prepared by dissolving the compound in distilled water and can be stored at 4 °C for up to two weeks.\nDirectly read the concentration values from the plate and assign the lowest inhibitor concentration for which no bacterial growth is observed (blue color) as [X] (see step 4.7.1), i.e., the lowest inhibitory concentration of the drug in the presence of the co-drug.\n\tNOTE: Positive bacterial growth is identified in the wells by the resazurin dye turning pink. MIC values for each drug alone (i.e., in the absence of co-drug) are determined in a similar manner using the resazurin MIC assay35 with each drug separately (Supplemental Figure 5). MICs in S. pneumoniae are 7.8 µM and 15.85 µM for masarimycin and optochin, respectively.\nDetermine the fractional inhibitory concentration (FIC) and FIC index (FICI) using the following equations.",
    "FIC= [X]/MICx, where [X] (from step 4.6) is the lowest inhibitory concentration of the drug in the presence of the co-drug, and MICx is the lowest inhibitory concentration of the drug in the absence of the co-drug.\nFICI= FICmasarimycin + FICantibiotic\n\t\tNOTE: FICI < 0.5 = synergistic, 0.5 < FICI < 1 = additive, 1 < FICI < 4 = indifferent, FICI > 4 = antagonistic.\n5. Morphological study\nGrow Bacillus subtilis 11774 on Luria-Bertani (LB) agar plates (10 g/L tryptone, 5 g/L yeast extract, and 5 g/L NaCl) containing 1.5% Bacto agar at 37 °C. In all experiments, use second passage cells grown in 5 mL of LB broth at 37 °C until OD600 = 1. Grow S.pneumoniae in the same manner as in step 4.1.\nAfter obtaining a cell culture density with OD600nm = 1 for B. subtilis, or OD600nm = 0.4 for S. pneumoniae, add masarimycin using a pipette to the culture tube labeled \"treated\" to a final concentration of 3.8 µM (0.75x MIC for B.subtilis), or 5.85 µM (0.75x MIC for S.pneumoniae). To the second culture tube labeled \"control\", add an equivalent volume of DMSO.\nFor B.subtilis, place the samples in an incubator at 37 °C for 90 min with shaking at 150 rpm. For S. pneumoniae, incubate the cells without shaking under anaerobic conditions.\nAfter 90 min, chemically fix the cultures in a 1:10 mixture (v/v) of culture media and fixing buffer (20 mM HEPES, 1% formaldehyde (pH 6.8)) at 4 °C overnight. After fixing is complete, apply 10-20 µL of samples to glass microscope slides using a pipette and allow them to air dry. Fix the air-dried samples by heating the glass slides using a Bunsen burner.",
    "After heat-fixing, stain samples with the addition of 100 µL of 0.1% (m/v) methylene blue (solution in 20% (v/v) ethanol). Incubate the stained slides for 10 min and wash away the excess dye with dH2O. Then, gently heat the stained slides to 60 °C in an oven for 15-20 min to bring cells to a common focal plane.\nSeal the stained samples by placing a microscope coverslip over the stained cells. Then, seal the edges using microscope slide cement. Place the sealed microscope slide on the microscope stage and bring the image into focus at 100x magnification using bright-field microscopy.\nPlace a drop of immersion oil on the microscope slide and bring the field of view to focus using 1000x magnification. Acquire micrographs using a camera attached to the microscope and its associated software. Acquire images using the auto white balance and aperture settings on the software.\n\tNOTE: Alternatively, images can be processed using the open-source ImageJ software.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}