{
  "id": 11155,
  "origin_website": "Jove",
  "title": "Procedure for Decellularization of Porcine Heart by Retrograde Coronary Perfusion",
  "procedures": [
    "1. Tissue Preparation and Experiment Setup\nHarvest porcine organ immediately after euthanasia from an abattoir or research facility and rinse off excess blood. Trim the heart of excess fat and tissue, keeping the atria and aorta intact. Trim away fat to separate the pulmonary artery from the aorta. If there are any cuts in the tissue, discard appropriately.\nWrap each heart individually in freezer paper and store all tissue in a -80 °C freezer for at least 24 hr to ensure complete freezing.\nWhen ready for use (usually less than 3 months), thaw one intact frozen porcine heart in Type 1 water overnight submerged in a 4 L beaker at 4 °C.\nAfter the heart is completely thawed, pat the heart dry, weigh the heart, and record the weight. The heart of a market weight pig should weigh approximately 375-450 g.\nConnect size 18 Masterflex tubing to the ¼\" end of a barbed reducer. Insert the barbed reducer and tubing inside the aorta. Place 2 hose clamps or secure zip ties around the aorta, just below the brachiocephalic trunk. The reducer and tubing must remain above the aortic valve, so the coronary arteries can be perfused (Figure 1).\nUse a 30 or 60 ml syringe to fill the tubing with Type I water. Insert the tubing within the cartridge of a Masterflex roller pump at its approximate midpoint. Submerge the inflow end of the tubing in the bottom of a 4 L beaker filled with 2.5 L of water and secure the tubing.",
    "Place the heart in the beaker filled with water, and prime the pump to remove air bubbles. If bubbles are observed coming from the aorta where the tubing is inserted, the aorta may need to be repositioned or secured with additional ties. An airtight seal is important to maintain adequate pressure during the decellularization process (Figure 2).\nPlace the 4 L beaker containing 3 L of a 0.2% Trypsin/0.05% EDTA/0.05% NaN3 solution on stir plate and warm it to 37 °C in preparation of the decellularization process.\n2. Tissue Rinses\nSet the pump to a flow rate of 400 ml/min, ensuring that the correct tubing size is selected. Flush the heart with Type I water for 15-25 min. As the pump is started, the heart should swell and effuse blood from the ventricles. Fresh solution should be substituted every 5-10 min, or as needed based on the amount of blood removed from the heart. If blood is not effused from the heart, adjust the tubing and clamps as necessary.\nStop the pump and transfer the heart to a separate beaker filled with 2X Phosphate Buffered Saline (PBS). After the tubing is submerged in solution, start the pump and increase the flow rate to 700 ml/min. The heart should remain in solution for 15 min, changing the solution every 5 min. Each solution change requires the pump to be stopped temporarily while the tissue and tubing is moved to the new beaker.\nTransfer the heart to Type I water for 10 min and increase the flow rate to 750 ml/min.\n3. Decellularization and Solution Perfusion",
    "Transfer the heart to the beaker containing 0.2% Trypsin/0.05% EDTA/0.05% NaN3 at 37 °C. Increase the pump speed to 1,200 ml/min and start the pump. Use a stir bar placed at the bottom of the beaker to circulate solution in the beaker. The heart should remain in the 0.2% Trypsin/0.05% EDTA/0.05% NaN3 solution at 37 °C for a total of three hours. After 1 hr, increase the pump speed to 1,500 ml/min. After an additional hour, increase the pump speed to 1,800 ml/min. The tissue is slowly subjected to increased perfusion speeds to condition the tissue and prevent rupture of the vessels. The heart will swell and nearly double in size during this step of the protocol. The tissue will lose its natural color, progressing from the atria to the apex throughout the protocol (Figure 3).\nAfter each solution perfusion, a two step rinse is performed to remove cellular debris, chemical residue, and aid cell lysis. Each rinse consists of a 10 min rinse in Type I water followed by a 10 min rinse with 2X PBS solution at room temperature. Each wash consists of removal of solution from the original beaker, adding rinse solutions, and circulating the perfusate within the beaker containing the submerged heart. After the 0.2% Trypsin/0.05% EDTA/0.05% NaN3 solution, perfuse water at 1,900 ml/min and then perfuse 2X PBS at 1950 ml/min.\nTransfer the heart to a solution of 3% Triton X-100/0.05% EDTA/0.05% NaN3 at room temperature. Increase the pump speed to 2,000 ml/min and perfuse solution for one hour. Remove the solution from the beaker and replace with fresh solution, increase the pump speed to 2100 ml/min, and perfuse the fresh solution for an additional hour and a half, bringing the total time in 3% Triton X-100/0.05% EDTA/0.05% NaN3 to 2.5 hr.",
    "Rinse the tissue in Type I water at 2150 ml/min and 2X PBS at 2180 ml/min for 10 min each.\nTransfer the heart to a 4% Sodium Deoxycholate solution at room temperature. Increase the pump speed to 2,200 ml/min and perfuse solution for 3 hr.\nRinse the tissue in Type I water at and 2X PBS at 2,200 ml/min for 15 min each, changing the solutions after 5-10 min for each solution. The described perfusion steps may be split over multiple days by performing the rinse step twice and storing the heart with attached tubing overnight at 4 °C and submerged in Type I water.\nThe following day, perform a 5 min rinse with Type I water at 750 ml/min, followed by a 5 min rinse in 1X PBS at 1,500 ml/min. The protocol may then be continued at the described flow rate in the proper solution.\n4. Disinfection and Final Processing\nTransfer the heart to a 0.1% peracetic acid/4% ethanol solution and perfuse solution for 1.5 hr at 2,200 ml/min.\nThe final rinses for the tissue are all performed at 2,200 ml/min. Perfuse the tissue with 1X PBS for 15 min, followed by two 5 min washes in Type I water. This series of rinses is repeated once more in order to complete the solution perfusion procedure.\nTurn the pump off and remove the heart from solution to drain the heart. Cut the ties from the aorta, remove all tubing, and place the heart in an empty beaker to drain for 1 hr. Excess liquid will need to be drained periodically. Lay the heart on an absorbent pad to fully drain the heart (Figure 4).",
    "After most of the water is removed, record the weight of the cardiac extracellular matrix (C-ECM). The heart can be expected to lose approximately 20-25% of its initial weight during the decellularization process.\nDissect the right and left ventricles, as well as the ventricular septum for DNA quantification and histological processing in order to confirm complete decellularization of the tissue (Figure 5).\nFreeze the C-ECM at -80 °C for at least 2 hr before lyophilization.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}