{
  "id": 9694,
  "origin_website": "Jove",
  "title": "A Rapid Approach to High-Resolution Fluorescence Imaging in Semi-Thick Brain Slices",
  "procedures": [
    "1. In situ brain fixation\n*Prepare a 10 ml syringe (28 gauge needle) filled with phosphate buffered saline (PBS).\n*Prepare a 10 ml syringe (28 gauge needle) filled with 4% paraformaldehyde (PFA) in PBS.  Reserve an additional 5-10 ml of PFA/PBS for post fixation.\nInject experimental mouse intraperitoneally with a lethal dose of Avertin or Nembutal.\nOnce the mouse is sedated, wet the abdomen with ethanol and secure the mouse to the bottom of a tray layered with cork, wax, or silicone elastomer using dissection pins.  With abdomen facing up, secure the four paws to the surface - spreading them as wide as possible.\nGrab the skin with forceps at the level of the sternum, and cut crosswise to expose the liver. Cut laterally and then up through the ribs and diaphragm. Remove the rib tissue flap and continue cutting until the heart is accessible.\nPierce or snip the right atrium to drain circulated blood.\nFlush residual blood from circulatory system by perfusion of PBS through left ventricle.\n Accessing the same needle hole, fix whole mouse by subsequent perfusion of PBS/PFA through left ventricle.\n2. Dissection and brain extraction \nRemove the skin from head, neck, and cranium by cutting around ear canal and eye orbits, followed by pulling skin anteriorly to expose the cranium.\n*See Figure 2 for an illustration of steps 2.2) to 2.5)\nUsing a bone scissors, cut crosswise from eye the socket through the nasal turbinate bones.  Do this for each side.  The crosscut should be anterior to the eyes and olfactory bulbs.\nCut lengthwise from each ear canal to eye socket.\nUsing a small dissection scissors, cut the occipital bone plate overlying the cerebellum from one ear canal to the other.",
    "With the same dissection scissors, cut anteriorly along the midline to the level of the olfactory bulbs.\nUsing forceps, remove each bone plate from the brain, taking care to remove any connective tissue so that the brain remains intact when lifting off the bone.\nSnip optic and cranial nerves, cut the top cervical vertebrae, and remove the brain into fixative.\nPost-fix for 1-2 hrs at 4° C.  Wash 3 times 15 min each in PBS.\n3. Agarose embedding\nMelt 2% high-strength, low-gel point agarose type I-B (Sigma catalog number: A0576) in PBS saline with microwave oven.\nTransfer molten agarose to a test tube.  Place test tube in a warm incubator or water bath (40°-41° C) until temperature equilibration.\nGlue fixed brain tissue onto the plunger of the specimen syringe with cyanoacrylate glue (Figure 3A).  Brush a thin layer of saturated sucrose-PBS solution on the surface of the brain tissue to facilitate the later release of the agarose ring from the brain slices.\nDraw down the plunger with brain tissue into the plunger housing (Figure 3B).\nPipette or pour warm agarose into the plunger housing, covering the brain tissue.  Avoid trapping air bubbles into the agarose.  Air bubbles in the agarose will compromise the slice quality.\nClamp the specimen syringe with a cold (0° to -25° C) chilling block for 1 minute to set the agarose (Figure 3C).\n4. Sectioning brain slice with the Compresstome\nAssemble the specimen syringe containing the brain tissue into the Compresstome (Figure 3D).\nAlign the edge of the razor blade closely with the outlet of the specimen syringe (Figure 3E).\nFill up the buffer tank with PBS solution.\nRotate the micrometer one slice thickness forward to extrude the agarose-brain tissue block out of the specimen syringe.",
    "Press the “start” button on the control unit of the Compresstome to initiate the sectioning process.\nRepeat steps 4.4) to 4.5) until desired slices are obtained at determine thickness.\nHarvest brain slices with brush or pipette to vials or staining wells filled with PBS (Figure 3F).\n5. Optical Clearing\nPrepare a 75% vol:vol solution of glycerol:PBS.\nPour (or pipette) off half the volume of PBS wash from the collected brain slices.\nAdd back the volume removed with glycerol/PBS.\nAllow to equilibrate with gentle mixing at 4° C until the slices sink.\nRepeat steps 6.2) to 6.4) until a final glycerol concentration reaches 75%.\n Replace solution with 90% glycerol in PBS and allow to equilibrate.\n*Note: Take care not to introduce air bubbles while adding glycerol solutions.  Pour solutions slowly and mix gently, since air bubbles will interfere with uniform equilibration and will be carried over to slide mounting.\n6. Slice mounting for imaging\nCut double-sided seal adhesive (SA-S-1L, Grace Bio-Labs) into an open rectangle to fit the viewable area of a micro slide (Superfrost Plus, 25 X 75 X 1 mm, cat. # 48311-703, VWR) with sides 2-3 mm wide.\nPlace brain slices inside the center of the adhesive tape rectangle using a pipette or paintbrush.  Remove excess glycerol with gentle aspiration.\nArrange brain slices on slide in desired order with a paintbrush.\nGently lower cover glass (24 X 60 mm, cat. # 48383-139, VWR) onto the adhesive tape, taking care not to introduce air bubbles.  Gently apply pressure onto cover glass to ensure contact with adhesive tape.\nAspirate excess glycerol from edges between slide and coverglass.\nSeal slide and coverslip using clear nail polish.\nAllow to dry before imaging, or store long-term in slide boxes at 4° C.\n7. Representative Results:",
    "Processing, imaging, and analyzing fluorescently labeled brain tissue have become indispensible to the study of neurobiology.  Many of these investigations require sophisticated genetic manipulations to obtain reporter expression in targeted neuronal subsets, followed by both low- and high-resolution image analyses.  Often experimental and technical limitations make it impossible to obtain these types of data from the same animal, or in a rapid manner.  Preparation of optically-cleared, semi-thick brain sections for fluorescent imaging aids in this challenge.  An example of an intact thick brain slice labeled with a genetically modified rabies virus engineered to express EGFP, and imaged using epifluorescent and confocal microscopy is shown in Figure 4 and Figure 5 respectively.  For epifluorescent imaging we used a Leica M205 FA, and for confocal image acquisition we used a Zeiss LSM 510.  Due to the relative simplicity of the attached protocol, this method is capable of yielding useful image data from tissue expressing fluorescent reporters with a turnaround time of less than one day, and is compatible with both low- and high-resolution light microscopy.  \nIf the investigator chooses to incorporate additional postmortem labeling methods, immunohistochemical staining, or make thinner sections, the protocol lengthens accordingly.  However, the method described above represents a simple and relatively high-throughput method for screening patterns of vital reporter expression in intact brain.  \nimgsrc://cloudfront.jove.com/files/ftp_upload/2807/2807fig1.jpgFigure 1. Flow chart diagraming the fixation, dissection, slicing, clearing, and mounting procedure of semi-thick brain slices.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2807/2807fig2.jpgFigure 2. Diagram of sequential cutting steps to extract the intact mouse brain.",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/2807/2807fig3.jpgFigure 3. Steps to mount and slice brain tissue using the Compresstome.  A) Placement of brain tissue onto cutting plunger using superglue. B) Drawing down the mounted brain tissue into the plunger for agarose embedding. C) Solidifying an agarose brain plug using a chilled compression block. D) Insertion of agarose brain plug and plunger into Compresstome cutting chamber. E) Alignment of razorblade to the plunger device. F) Cutting and collection of brain slices into Compresstome buffer chamber.\nimgsrc://cloudfront.jove.com/files/ftp_upload/2807/2807fig4.jpgFigure 4. Light microscopy images of a thick slice from glycerol-cleared brain tissue through the frontal cortex expressing enhanced green fluorescent protein (EGFP).  A) Coronal slice through a mouse brain (200 um thick) labeled with a viral vector expressing EGFP and imaged at low resolution using an epifluorescent stereoscope.  Scale bar, 2 mm. \nimgsrc://cloudfront.jove.com/files/ftp_upload/2807/2807fig5.jpg  Figure 5. High magnification image of fluorescently labeled layer 5/6 cortical neurons in a cleared thick brain slice. A) High resolution confocal image of a maximum projection Z-stack (150 um thick) through the region highlighted in (Figure 4).  Scale bar, 25 um.Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}