{
  "id": 17471,
  "origin_website": "Jove",
  "title": "Four-Dimensional Computed Tomography-Guided Valve Sizing for Transcatheter Pulmonary Valve Replacement",
  "procedures": [
    "All cardiac CT data were obtained from GrOwnValve preclinical trials with the approval of the legal and ethical committee of the Regional Office for Health and Social Affairs, Berlin (LAGeSo). All animals received humane care in compliance with the guidelines of the European and German Societies of Laboratory Animal Science (FELASA, GV-SOLAS). In this study, the Pre-CT from sheep J was chosen to illustrate the procedures.\n1. Perform 3D cardiac CT in sheep\nIntravenous anesthesia\n\t\nTranquilize sheep (3 years, 47 kg, female, Ovis aries) with premedication of midazolam (2 mg/mL, 0.4 mg/kg), butorphanol (10 mg/mL, 0.4 mg/kg), and glycopyrronium bromide (200 mcg/mL, 0.011 mg/kg) by intramuscular injection.\nCheck the physical condition of the sheep when they became docile, 15 min after the injection.\nPlace an 18 G catheter with injection port aseptically in the cephalic vein with perfusion lines jointed to a T-connector for anesthesia and contrast agent.\nAnesthetize the sheep by intravenously injecting propofol (20 mg/mL, 1-2.5 mg/kg) and fentanyl (0.01 mg/kg). Check for symptoms of tranquilization like jaw relaxation, loss of swallowing, and ciliary reflex. Intubate the sheep with a 6.5 mm - 8 mm tracheal tube, and place a gastric tube into the stomach for gastric fluid aspiration followed by intravenous injection of propofol (20 mg/mL, 1-2.5 mg/kg) and fentanyl (0.01 mg/kg).\nAchieve total anesthesia by injecting propofol (10 mg/ml, 2.5-8.0 mg/kg/h) and ketamine (10 mg/mL, 2-5 mg/kg/h) intravenously, in preparation for cardiac CT.\nCardiac CT\n\t\nTransfer the sheep from the Research Institutes for Experimental Medicine (FEM) to the CT room of the German Heart Center Berlin (DHZB) after the preparations. Scan all sheep in the prone position after securely fixing them on the CT bed with 3 bandages on the arms, abdomen, and legs.",
    "Perform cardiac CT on a 64-slice dual-source multidetector CT system with ECG-gating using the following parameters. Set the standard acquisition technical parameters as follows: gantry rotation time 0.33 s, 100-320 mAs per rotation, 120 kV tube voltage, matrix 256 with a 16-bit depth, deviation effective x-ray dose 15.5± 11.6 mSv, slice thickness 0.75 mm.\nAchieve contrast enhancement by administering 2 -2.5 mL/kg of iodinated contrast agent at the rate of 5 mL/s via the T- connector on the arm.\nPerform the 4D CT scanning protocol in sequential. Divide the entire cardiac cycle into 11 frames from 0% to 100% with 10% of R-wave to R- wave (RR) interval covering the cardiac cycle. Carry out an end-diastolic phase at approximately 70% of the RR-interval for analysis for the 3D series. Obtain sagittal, coronal, and axial data in each frame of 4D CT, as well as in 70% 3D series.\nUse a bolus tracking method for contrast bolus timing in the region of interest on the main pulmonary arteryto achieve ideal synchronization. Do not administer beta-blocker in any sheep.\nTransfer the sheep back to the FEM and stop the perfusion of propofol, and ketamineafter scanning. The sheep regained consciousness 10 - 20 min after the extubation. Anesthesiologists and veterinarians oversaw the entire anesthesia treatment until the sheep were completely awake and able to move freely.\n2. Open-source 3D reconstruction software application settings and extension installments\nClick Edit in the top menu to modify the application settings after launching 3D reconstruction software.\n\t\nClick on DICOM, then Acquisition Geometry Regularization, and select Apply Regularization Transform in the DICOM Scalar Volume Plugin section. Select Volume Sequence as the preferred multi-volume import format in the Multi Volume Importer Plugin section.\nClick on Views, select Small Axes. In the Orientation marker, select Thin Ruler.",
    "Restart the 3D slicer software to save the application settings.\nClick the Extension Manager in the toolbar to open the extensions page.\n\t\nFind the required extensions and left-click to install them. Use the following extensions in this study: Sequence Registration, Slicer Elastix, Sandbox, Slice Heart, Slicer IGT, Slicer VMTK, DICOM web Browser, Intensity Segmenter, Markups To Model, Easy Clip, mp Review, Slicer Prostate, and VASSTAUgorithms.\nRestart the 3D slicer software to confirm the installation of the selected extensions.\n3. Load cardiac CT data into 3D slicer from the DICOM files\nUse one of the two steps described below to load the cardiac CT data into 3D slicer from the DIOCM files (Figure 1).\nImport CT data: Add cardiac CT data (the Pre-CT from sheep J was selected to illustrate the procedures) into the application's database by switching to the DICOM module and dragging-and-dropping files to the application window.\nLoad CT data: Load data objects into the scene by double-clicking on items (In sheep J, the EKG- Ao asc 0.75 126f 3 70% is the 3D sequence at the end-diastolic phase, and Funkion EKG- Ao asc 0.75 126f 3 0- 100% Matrix 256 is the 4D sequence as an 11-frame volume sequence by cardiac cycle).\nLeft-click the Eye icons in the data tree to show the 3D and 4D sequences from the axial, sagittal, and coronal views in the 2D viewers.\nLeft-click the Slicer layout icon on the top toolbar and select Four-Up or Conventional layout.\nClick on the Links icon in the top left corner to link all three viewers, and on the Eye icon to display the slices in 3D Viewer.",
    "Click on the Save icon and save all the data loaded into the 3D slicer in a selected destination to build a dataset for the segmentation and volume editing.\n4. Create 4D beating heart volume and beating right heart volume\nSelect Volume Rendering in the modules drop-down menu, then select the 4D sequence in the Volume drop-down menu.\nSelect CT-Cardiac3 in the Preset drop-down menu to display the 4D heart. Adjust the cursor below the Preset drop-down menu to show the heart only.\nClick on Sequence Browser in the modules drop-down menu to select and display the 4D sequence. The beating heart is in the scene. Drag the 4D heart into the 3D scene to observe the heart from various directions.\nSelect the Enable and Display ROI functions in the Crop options below the shift bar to crop the 4D volume of the beating heart in order to better observe the structures of the heart.\nCreate the 4D beating heart volume as outlined above. Select Segment Editor in the modules drop-down menu, then click the Scissors effect with the Fill Inside operation to cut one single frame.\nClick on the Mask Volume effect and apply it to link the segmentation to the 4D heart as a masked volume. The input volume and output volume in the mask volume effect are the 4D sequences.\nSelect the Scissors effect with the Erase inside operation to remove the bones and other unexpected areas. Select the Islands effect with the Keep Largest Island operation to remove small areas.",
    "Choose the Erase effect with the 1-3% Sphere Brush to remove the tissues at the aortic arch with attachments to the main pulmonary artery, as well as the tissue between the ascending aorta and the superior vena cava. After each step, apply the Mask Volume effect to mask the 4D volume.\nRepeat steps 4.7 - 4.8 to carry on removing the areas until the right heart model is shown in the 3D scene.\nClick on the Sequence Browser and go to the next frame. Use the Scissors effect with the Erase Inside operation to cut any area in the 3D scene; the right heart model will automatically appear in the contemporary frame. Apply the same method to the rest of the frames until the entire 4D sequence has been segmented.\nClick on the Sequence Browser button to display the right heart 4D volume.\n\t​NOTE: When removing the left anterior descending coronary artery in some frames as well as the bifurcation of the left coronary artery, it will remove a tiny portion of the right ventricle. Because of this, it is highly recommended to keep a tiny piece of these coronaries to maintain the right ventricular volume in each frame.\n5. Create straightened models from the 4D sequence\nNOTE: It is highly recommended to build each 10% of the cardiac cycle frame in a single 3D slicer folder, otherwise there will be too many data trees aligned in the DATA module, making it inefficient to create the straightened models. To get the single 3D slicer folder of each 10% frame, it needs to load the 4D sequence several times, choose every frame and save them in a single folder.",
    "Create right heart segmentations for each frame by selecting the Segment Editor module in the toolbar. Add two segmentations for each 10% frame of the 4D sequence, and name them accordingly, e.g., 60% segmentation and Other.\nSelect the Paint effect tool in the Segment Editor module with Editable Intensity Range which depends on the CT images to paint the right heart with the sequence superior vena cava, right atrium, right ventricle, and pulmonary artery.\nClick on Other Segmentation, use the paint tool to paint other areas to trace the boundaries of the right heart in general.\nSelect the Grow From Seeds effect, select Initialize and Apply to apply the effect. Click on the Show 3D button in the Segment Editor module to display the 3D model of the contemporary frame.\nRepeat steps 4.7 - 4.8 to remove or improve the 3D model according to the CT images in the three directions. Remove the left and right branches of the pulmonary artery at the bifurcation. The right heart 3D model will then show the 3D scene in each frame.\n\t​NOTE: It is highly recommended to paint the boundaries of the right heart with a 1% - 2% diameter sphere brush at the attachments between the pulmonary artery and coronary arteries, as well as the pulmonary artery and the superior vena cava.\nClone the segmentations in the DATA tree as a backup, name the segmentations, for example, 10% Segmentation Original and 10% Segmentation for Straightened Model.\nAdd a centerline to the right heart model as described below.\n\t\nSelect Extract Centerline in the modules drop-down menu.",
    "Select Segmentation in the surface drop-down menu in the Inputs section of the extract centerline module. This creates a segmentation, such as 10% segmentation for straightened model as a segment. Click on Create New Markups Fiducial in the endpoints drop-down menu. Click on the Place a Markup Point button to add endpoints on the top plane of the SVC and the end plane of the main pulmonary artery.\nSelect Create a New Model as a Centerline model and Create New Markups Curve as a centerline curve in the Tree of the Outputs menu. Click on Apply to show the centerline right heart model.\nClick on the DATA module, then right-click on the Centerline Curve to edit its properties. Click on the Eye icon to display the control points, and in the Resample section set the number of resampled points to 40 to lower the computer load.\nCreate a straightened model\n\t\nSelect Curved Planar Reformat in the modules drop-down menu.\nShift the cursor after Curve resolution and Slice resolution to 0.8 mm, set the Slice Size to 130140 mm which was according to the range of the right ventricle displayed on the images, and then select Create a New Volume as Output Straightened Volume.\nClick on Apply to obtain the straightened volume.\nSelect Volume Rendering in the module drop-down menu to show the straightened volume. Select the Straightened Volume in the volume drop-down menu and click on the Eye icon. Select CT-Cardiac3 as the Preset, move the Shift cursor to show the straightened right heart volume in the 3D scene.\nColumn the straightened volume in the DATA tree in the name of straightened volume for segmentation, and right-click to segment this straightened volume.",
    "Select the Threshold effect in the segment editor module to color the desired straightened right heart and click Apply to apply the operation. Select the Mask Volume effect to mask the straightened volume by choosing the Straightened Volume for Segmentation, volume as Input Volume and Output Volume and click Apply to apply the operation.\nClick Apply to apply the same operation as outlined above in steps 4.7- 4.8 to keep the straightened right heart segmentation only. Check the straightened right heart volume and 3D model of the straightened right heart segmentation in the 3D scene.\nClick Apply to apply the same operation outlined above for other frames to obtain the straightened right heart volume rendering and straightened segmentations and save them in the folder of each frame.\n6. Export the figures and STL files\nExport the figures of the straightened volume rendering by clicking on the Capture and name a scene view effect on the toolbar and saving the scenes in 3D view.\nExport the STL files of the straightened 3D segmentations by clicking on the Segmentation module.\n7. Perform five planar measurements\nPerform a five planar measurement of the perimeter, cross-sectional area, and circumference in the straightened models from the 4D sequence and right ventricular volume measurements in the straightened model as described below.\nApply the following five planar settings: Plane A: at the main pulmonary artery 2 cm offset from the plane of the sinotubular junction; Plane B: at the sinotubular junction; Plane C: at the sinus; Plane D: at the base of the leaflet; Plane E: at RVOT 1 cm offset from D.",
    "Add all the above five planes into the straightened models in each frame by holding the Shift key on the keyboard and using the crosshair function in the toolbar to the five planes. Click on the Create and Place module in the toolbar to select the Plane effect.\nSelect the Line effect to measure the perimeters, select the Closed Curve effect to obtain the circumferences and cross-sectional area. Copy the data to build the dataset.\nPerform right ventricular volume measurements in the straightened model as described below.\n\t\nColumn the straightened segmentation in each frame obtained from the 4D sequence, and label the segmentation according to the matching frame for volume measurement.\nSelect the Segment Statistics module in the module drop-down menu. Select the X% Segmentation for volume measurement after Segmentation and Scalar Volume in the inputs menu. Select Create New Table as the Output Table and then click on Apply to apply the operations to get the volume table.\nCopy the volume data to create the volume measurement dataset for each frame of the straightened segmentation.\n8. 3D multiplanar reconstruction (MPR) measurements and right ventricular volume measurement from the 3D sequence (the best-reconstructed phase at the end of diastole)\nNOTE: In this study, the sheep J Pre-CT was chosen to illustrate the MPR measurement procedures.\nLoad the diastolic 3D sequence as illustrated in the following steps. Select the downward arrow next to the crosshair effect, choose Jump Slices- Offset, Basic+ Intersection, Fine Crosshair, and The Slice Intersections for crosshair settings.\nShift + left-click to drag the crosshair to the plane, for instance, the sinus. Press Ctrl+Alt to adjust the crosshair to the desired position in the axial, sagittal, and coronal scenes perfectly in the center of the targeted position.",
    "Select the Line effect to perform the measurements in each plane as illustrated in step 7.4. Copy the data to build the 3D MPR measurement dataset.\nClick on the Segment Editor module to create a right ventricular segmentation as outlined above in step 5.8.6.\nClick on the Segment Statistics module to perform the right ventricular volume measurement as outlined above in step 7.5.2.\nCopy the volume information to build the diastolic 3D right ventricular volume dataset.\n9. Calculation for stented heart valve selection\nNOTE: In this section, the measurements of the sinotubular junction were used to illustrate the procedure.\nCalculate the mean of the long axial (d1) and short axial perimeters (d2) = (d3), followed by the mean of d1, d2, and d3 to obtain d4, as shown in formulas (1) - (2).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq01.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq02.jpg\nDivide the calculation of the cross-sectional area (S1) by π to obtain d5 followed by the square root of d5 to obtain d6, and then the mean of d5 and d6, as shown in formulas (3) - (5).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq03.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq04.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq05.jpg\nDivide the circumference (C1) by π to obtain d8, as shown in formula (6).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq06.jpg\nObtain the overall general diameter d9 by calculating the mean of d4, d7, and d8, as shown in formula (7).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq07.jpg\nApply formula (8) to calculate the best choice of valve size (h).\nimgsrc://cloudfront.jove.com/files/ftp_upload/63367/63367eq08.jpg\n\tNOTE: The stented heart valve is available in diameters 30 mm, 26 mm, and 23 mm. The valve size (h) shows the match as a percentage for the three diameters, namely an ideal match as 10-20%, big for implantation as 30% and above, and small for implantation below 10%.",
    "Import the 3D and 4D data into a versatile statistics software to build the trend diagrams of the measurements in the five planes and export the diagrams in TIFF format. Import all the figures into graphics software for organization.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}