{
  "id": 2287,
  "origin_website": "Cell",
  "title": "Protocol for electron microscopy of Drosophila photoreceptor cells",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nIsolation and primary fixation of fly eyes (day 1)\nTiming: 4 h for those who choose fixation for 2 h\nThe purpose of this step is to ensure that the cell ultrastructure of the isolated eye remains intact.\nNote: The purpose of primary fixation is to preserve the ultrastructural details of the cells as completely as possible in the living state, so as to avoid autolysis caused by the decomposition of their own enzymes or corruption caused by the invasion and reproduction of external microorganisms, resulting in the destruction of the ultrastructure of the cells. At the same time, the various components in the cell can be fixed to avoid dissolving and loss during subsequent washing and dehydration.\nPrepare the fixation buffer and keep it on ice.\nIsolation of samples.\nTake the required strains of flies, anesthetize them with carbon dioxide, and quickly cut off their heads with a blade on a slide (Figures 1[href=https://www.wicell.org#fig1]A and 1B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig1.jpg\nFigure 1. Isolation and primary fixation of fly eyes\n(A) Anesthetize flies with carbon dioxide.\n(B) Use the blade to cut heads off on a slide.\n(C) Use tweezers to expose the mouthparts.\n(D) Remove the mouthparts of the heads.\n(E) Cut the heads into two halves from the middle.\n(F) Place the tube diagonally on ice to ensure the eyes are fully immersed in fixation buffer.\nQuickly remove the mouthparts and cut the heads into two halves from the middle (Figures 1[href=https://www.wicell.org#fig1]C–1E).\nNote: The whole process of sample isolation should be done quickly and the eyes should be put into fixation buffer immediately after isolation, so that the tissues and cells can keep their original living conditions as much as possible.",
    "Note: Choose a sharp cutting instrument such as a fresh blade to reduce pulling or squeezing tissues.\nPrimary fixation.\nAdd 1 mL of fixation buffer to the Eppendorf tube.\nUse tweezers to clamp the samples gently and insert them into the fixation buffer.\nSlowly place the Eppendorf tube on ice, keeping the eyes immersed in the fixation buffer (Figure 1[href=https://www.wicell.org#fig1]F).\nNote: The eyes are light and float easily on the surface of the fixation buffer. Make sure all the eyes are immersed in the fixation buffer.\nFix the samples for 20 min on ice.\nChange the samples to 1 mL of fresh fixation buffer in the Eppendorf tube, maintaining all the eyes’ immersion in the buffer (Figure 1[href=https://www.wicell.org#fig1]F).\nFix the samples for 2 h on ice or 12 h at 4°C.\nNote: The red-eyes of flies have pigments. It will damage the structure of the eyes if they are fixed for 12 h at 4°C. So, if the flies’ eyes are red, fix the samples for 2 h on ice. If the flies’ eyes are white, you can choose to fix them for 2 h on ice or 12 h at 4°C.\nCritical: During the fixation process, bubbles will appear in the Eppendorf tube. Pay attention and make sure all the eyes are immersed in the fixation buffer.\nWash samples: Change the samples into 1 mL of fresh 0.1 M sodium cacodylate in the Eppendorf tube on ice to wash for 5 times, 15 min/time.\nNote: Make sure all the eyes are immersed in the 0.1 M sodium cacodylate.\nStorage: Change the samples to 1 mL of fresh 0.1 M sodium cacodylate in the Eppendorf tube and store them at 4°C for 12 h.\nPost-fixation with osmium tetroxide and uranyl acetate (day 2)\nTiming: 3–3.5 h",
    "The purpose of this step is to use osmium tetroxide and uranyl acetate to fix and ensure that fixation works well.\nNote: Osmium tetroxide can react with most of the components in cells and protect fat, but the protection of carbohydrates, sugars and nucleic acid is poor (Palay et al., 1962[href=https://www.wicell.org#bib7]). Osmium tetroxide has poor permeability and a high molecular density. The tissue fixed by osmium tetroxide can obtain good contrast under transmission electron microscope.\nNote: Uranyl acetate is both a fixative and a stain. It can react with phosphate groups to fix DNA and RNA, as well as phospholipids containing phosphate groups, thus helping to preserve membrane structures. In addition, it can react with acidic groups (e.g., aspartic acid residues, glutamic acid residues) and basic groups (e.g., lysine residues) in the protein, thus acting as a fixed protein. But uranyl acetate does not preserve glycogen very well (Ackermann, 2009[href=https://www.wicell.org#bib1]). After the fixation with aldehydes and osmium tetroxide, a third fixation with uranyl acetate is often performed.\nWash samples: Change the samples to 1 mL of fresh 0.1 M sodium cacodylate in the Eppendorf tube on ice to wash for 3 times, 15 min/time.\nNote: The samples should be at the bottom of the Eppendorf tube at this time.\nFixation with 1% osmium tetroxide: Change the samples to 1 mL of 1% osmium tetroxide solution for 1 h at 25°C in a fume hood.\nNote: For the best contrasting color, proper osmium tetroxide fixing time is very important. For compound eyes, 1 h always works well.\nCritical: Osmium tetroxide is highly toxic and volatile reagent that causes strong irritation of the respiratory tract and must be operated in a fume hood. The waste must be collected in a closed container. Be careful during the experiment!",
    "Wash samples: Change the samples to 1 mL of fresh distilled water in the Eppendorf tube at 25°C to wash for 5 times, 15 min/time.\nNote: Once the fixation with 1% osmium tetroxide is finished, suck out the osmium tetroxide quickly. Add 1 mL of fresh distilled water to rinse and quickly suck out the water before the washing process to ensure the osmium tetroxide is diluted.\nCritical: The waste should be recycled into the corresponding waste liquid bottle and be treated by the department.\nFixation with 1% uranyl acetate.\nPrepare 1 mL of 1% uranyl acetate in a fume hood carefully.\nChange the samples to 1 mL of 1% uranyl acetate for 12 h at 25°C, protected from light in a fume hood.\nNote: The Eppendorf tube could be wrapped in tin foil to protect samples from light.\nEthanol dehydration, penetration, and polymerizing tips (day 3)\nTiming: 5.5–6 h\nThe purpose of this step is to dehydrate and gradually permeate the tissue with the embedding agent (Spurr’s resin).\nNote: Dehydration is the step leading to the complete removal of free water from tissues (Mollenhauer, 1993[href=https://www.wicell.org#bib6]). Since most commonly used embedding agents are water-immiscible resins, they can only be immersed into tissues if the free water in biological tissues is removed. Ethanol extracts less cell matter and shrinks less tissue, but it is poorly soluble with resin, so propylene oxide is used as an intermediate solvent when ethanol is used for dehydration.\nWash samples: Change the samples to 1 mL of fresh distilled water in the Eppendorf tube at 25°C to wash for 5 times, 15 min/time.",
    "Note: Once the fixation with 1% uranyl acetate is finished, suck out the uranyl acetate quickly. Add 1 mL of fresh distilled water to rinse and quickly suck out the water before the washing process to ensure the uranyl acetate is diluted.\nCritical: The waste should be recycled into the corresponding waste liquid bottle and be treated by the department.\nDehydration with different concentration gradients of ethanol.\nPrepare 1 mL 10%, 30%, 50%, 70%, 85% ethanol and 2 mL 95% ethanol on ice.\nChange the samples to 1 mL of 10% ethanol on ice for 15 min.\nChange the samples to 1 mL of 30% ethanol on ice for 15 min.\nChange the samples to 1 mL of 50% ethanol on ice for 15 min.\nChange the samples to 1 mL of 70% ethanol on ice for 15 min.\nChange the samples to 1 mL of 85% ethanol on ice for 15 min.\nChange the samples to 1 mL of 95% ethanol on ice for twice, 30 min/time.\nChange the samples to 1 mL of ethanol absolute on ice for 3 times, 30 min/time.\nCritical: Dehydration should strictly follow the gradients of ethanol concentrations mentioned above. Rapid dehydration can cause cell contractions. This step should be phased rather than rapid dehydration.\nPrepare Spurr’s resin mixture at 25°C in a disposable measuring beaker.\nNote: Mix the Spurr’s resin very thoroughly for 1 h when dehydrating with ethanol absolute the second time.\nPenetration: Replace dehydrating regents in tissue with embedding regents gradually.\nChange the samples to 500–800 μL of 100% propylene oxide for twice, 5 min/time.\nNote: Ethanol and Spurr’s resin are not mutually soluble, so when using ethanol dehydration, propylene oxide is used as an intermediate solvent. Make sure the samples are immersed in the propylene oxide.",
    "Critical: Propylene oxide is a toxic, colorless, ether-smelling, low boiling point and flammable liquid. Vapors irritate eyes, skin, and respiratory system. It should be stored in a cool, ventilated and dry place below 25°C, and should not be directly exposed to sunlight and isolated from fire sources.\nPrepare 100% propylene oxide/Spurr’s resin mixture in an Eppendorf tube and invert the tube till they mix well.\nChange the samples to 1 mL of propylene oxide/Spurr’s resin mixture and leave them cupped at 25°C in a fume hood for 12 h. Using a shaker to improve resin infiltration is recommended. Shake gently to prevent the sample from flinging out of the resin.\nNote: The Spurr’s resin is in the form of oil droplets, and it can be sucked with a Pasteur pipette.\nPolymerizing tips.\nUse the vacuum drying oven by heating it to 65°C.\nAdd one drop (about 10 μL) of Spurr’s resin (Figure 2[href=https://www.wicell.org#fig2]) to each well of the embedding mold and polymerize in the vacuum drying oven at 65°C for 12 h.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig2.jpg\nFigure 2. Tip and intact embedded resin samples in the Pyramid-Tip Mold\nEach groove of the embedding mold is in the shape of an inverted pyramid. Polymerize tips first, and then place the eyes on the tip’s surface so that the embedded eyes are in a favorable location, not too deep for shaping, and the resin surrounding the eyes per slice is reasonable (see step 19 for details).\nUse detergent to clean the disposable measuring beaker containing the Spurr’s resin and dry it in the vacuum drying oven at 65°C for 12 h.\nEmbedding and polymerizing (day 4–6)\nTiming: 53 h\nThe purpose of this step is to penetrate the tissue with the Spurr’s resin and finally embed the tissue.",
    "Take out the embedding mold containing the tip from the vacuum drying oven.\nPrepare Spurr’s resin mixture.\nNote: Take out the disposable measuring beaker from the vacuum drying oven and mix the Spurr’s resin in it very thoroughly for 1 h.\nPenetration: Change the samples to 1 mL of Spurr’s resin mixture three times, 1 h/time, at 25°C, in a fume hood.\nNote: The Spurr’s resin is in the form of oil droplets. Use the scissors to cut off the pipette tip at the appropriate position for the convenience of the experiment (Figure 3[href=https://www.wicell.org#fig3]A). Use the remaining pipette tip to absorb the Spurr’s resin and gently blow the samples (Figure 3[href=https://www.wicell.org#fig3]B), so that the samples are suspended in the Spurr’s resin.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig3.jpg\nFigure 3. Preparation of the pipette tip for absorbing the Spurr’s resin\n(A) Use the scissors to cut off the pipette tip at the position indicated by the blue dotted line.\n(B) Use the remaining pipette tip in the square to absorb the Spurr’s resin and gently blow the eyes.\nEmbedding and polymerizing.\nPrepare the vacuum drying oven by heating it to 65°C.\nFill with Spurr’s resin and place a compound eye in each hole of the embedding mold containing the tip.\nUnder a stereoscopic microscope, move the compound eye with tweezers to adjust its direction so that the most prominent part of the compound eye is as far down as possible (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig4.jpg\nFigure 4. Embedding the compound eyes\n(A) Schematic diagram of the sample orientation in the resin.\n(B) One intact embedded sample in the embedding mold.\nNote: When embedding the compound eyes, try to make the sample in the field of vision appear round to ensure that the sample is aligned (Figure 4[href=https://www.wicell.org#fig4]).",
    "After placing the sample in each groove of the embedding mold, slowly place the embedding mold into the oven at 65°C for 1 h.\nCritical: Avoid violent shaking to make the adjusted sample orientation change.\nTake out the embedding mold, fine-tuning the compound eye’s direction with tweezers under a stereoscopic microscope to ensure the sample is aligned.\nReturn the embedding mold to the vacuum drying oven at 65°C for 48 h.\nCritical: The polymerizing time depends on the specific situation. Excessive solidification will make the sample too brittle and affect the later sectioning.\nNote: After embedding, the blocks containing the samples are pyramid-shaped (Figure 4[href=https://www.wicell.org#fig4]). They can be kept at 25°C for up to a year.\nShaping and sectioning (day 7)\nTiming: 3 h for one sample\nThe purpose of this step is to shape and section to facilitate subsequent staining and sample observation.\nShaping.\nUse a fresh blade to trim away excess resin from the block underneath the embedded compound eye under the stereomicroscope (Figure 5[href=https://www.wicell.org#fig5]A). Shape the upper part, which contains the eye, into an equilateral trapezoid (Figure 5[href=https://www.wicell.org#fig5]B), and below that is a square base.\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig5.jpg\nFigure 5. Shaping the sample block\n(A) Diagram of the shaping of an embedded sample prior to sectioning. Glue the bottom surface of the shaped block to the cylindrical plastic base after shaping.\n(B) A vertical view of the upper part of the shaped block.\n(C) The shaped block is glued to the cylindrical plastic base.\n(D) A vertical view of the shaped block that is glued to the cylindrical plastic base.\nNote: When sectioning, feeding from the short base of the shaped equilateral trapezoid is helpful to protect the diamond sectioning knife.",
    "Adjust the initial section angle of the top surface according to the direction of the compound eye after embedding.\nNote: Take care to avoid cutting too close to the compound eye to prevent damage to the sample. The initial rough trimming will reduce the time spent on achieving the trapezoid face shape when sectioning.\nCritical: Take note of the distance between the sample and the top surface; too far will result in more early empty slices, while too close will make it easy to cut and expose the sample accidentally. In addition, the top surface should be smooth as far as possible to avoid diamond sectioning knife marks.\nCheck whether the embedded sample is free of any imperfections or debris after reaching the area of interest and achieving the trapezoid surface shape. Otherwise, start shaping a new one.\nUse the sandpaper to rough the bottom surface of the shaped block flat.\nApply a small drop of super glue on a cylindrical plastic base and put the shaped resin-encased compound eye on. Glue the bottom surface of the shaped block to the cylindrical plastic base (Figures 5[href=https://www.wicell.org#fig5]A and 5C).\nAllow the glue to dry before sectioning.\nAlignment and sectioning.\nPlace the cylindrical plastic base glued with the shaped block into the chuck on the ultramicrotome and tighten it firmly (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig6.jpg\nFigure 6. Use the ultramicrotome to section\nSet parameters on the touchscreen control panel after adjusting the direction of the block and the angle of the diamond sectioning knife, start the automated movement of the ultramicrotome specimen arm.\nPlace the diamond sectioning knife on the sectioning knife holder stage on the ultramicrotome (Figure 6[href=https://www.wicell.org#fig6]).\nAdd a little excess water to the groove of the diamond sectioning knife to make it convex and ensure that the blade is soaked.",
    "Allow the diamond sectioning knife to soak up distilled water for about 15 min.\nA portion of the water is then slowly drawn under the microscope with a syringe or Pasteur pipette. Adjust the lighting system so that when the liquid surface becomes concave, a curved surface reflecting light can be seen, which is the correct liquid surface and appears white under the microscope. As the liquid evaporates during sectioning, distilled water should be added to ensure the correct liquid level.\nAdjust the sample under the microscope such that the short side of the trapezoid is facing down, so that sectioning from the short edge will cause less damage to the diamond knife blade.\nAdjust the knife angle so that the two parallel sides of the trapezoid are parallel to the blade. At this point, the compound eye is perpendicular to the cross section of the knife.\nMove the knife to align the available part with the block surface.\nRaise the block until it stops slightly above the knife blade.\nSet parameters in the control panel: feed of 400 nm, and a rate of 2 mm/s. Start the automated movement of the ultramicrotome specimen arm.\nPause sectioning when a large circle (compound eye) appears in the slice (Figure 7[href=https://www.wicell.org#fig7]A). Place the sections on the slide, stain with 0.1% toluidine blue and use a light microscope to check if the ommatidia (small circles) have been sliced (Figure 7[href=https://www.wicell.org#fig7]B).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig7.jpg\nFigure 7. The light microscope image of the section\n(A) A large circle (compound eye) is visible on each section. Top, actual picture. Bottom, schematic diagram of one section.\n(B) The image of a toluidine blue stained section. Under a light microscope, within the large circle (compound eye), many small circles (ommatidia) can be seen. Scale bar: 100 μm.",
    "(C) A large circle (compound eye) is visible on each section on the grid. Top, schematic diagram. Bottom, actual picture.\nWhen ommatidia begin to appear on the section (the big circle is relatively small at this time), continue to cut 200 sections using the parameter of 200 nm thickness. During this process, the size of the big circle increases gradually, and the number of ommatidia appearing in one section approaches its maximum.\nPause sectioning, clean the groove of the diamond sectioning knife and replace it with fresh distilled water. Adjust the liquid level and sectioning parameters. At a speed of 1 mm/s, cut sections of 90–100 nm thickness.\nNote: The section thickness can be determined according to the interference color. The section thickness of 90–100 nm is golden, with good resolution and contrast, and is easy to observe under a transmission electron microscope.\nStop the automated movement after cutting 40 sections. Use an eyelash brush to gently move the ribbon sections away from the blade.\nCarefully collect the sections on a grid. Make sure that there are 5–6 sections on one grid (Figure 7[href=https://www.wicell.org#fig7]C).\nPlace the grids with sections into the transmission electron microscope sample box.\nNote: Keep the room quiet without vibration during the whole process of sectioning, so as not to affect the sectioning.\nPost-staining with lead citrate and uranyl acetate (day 8)\nTiming: 20–30 min\nThe purpose of this step is to enhance contrast by staining with lead citrate and uranyl acetate to facilitate the observation of ultrastructure.",
    "Note: The following steps describe how post-staining is done (Figure 8[href=https://www.wicell.org#fig8]). Lead citrate has high electron density and wide affinity for cell ultrastructure, and can improve the cell membrane system and lipid contrast. Lead citrate is easily contacted by CO2 in the air to form lead carbonate precipitate and pollute sections (Cattini and Davies, 1983[href=https://www.wicell.org#bib2]). Staining for a long time with lead citrate can increase all of the contrast, which is not conducive to observation. At present, uranyl acetate is the most widely used dye (Ackermann, 2009[href=https://www.wicell.org#bib1]). It can be combined with most components and can stain nucleic acid, nuclear protein, connective tissue fiber, glycogen, secreted particles and lysosome, but it has a poor staining effect on membrane structure. Prolonged staining with uranyl acetate can cause glycogen extraction and tissue deformation (Daddow, 1983[href=https://www.wicell.org#bib3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1754-Fig8.jpg\nFigure 8. Post-staining with lead citrate and uranyl acetate\n(A) Post-staining diagram with lead citrate and uranyl acetate.\n(B) A lead citrate droplet with grids.\n(C) A uranyl acetate droplet with grids.\n(D) The Petri dish used for washing grids.\nPrepare a parafilm of about 5 cm in width (the length depends on the number of samples, e.g., about 10 cm), and place lamellar NaOH solids in rows on both sides (Figure 8[href=https://www.wicell.org#fig8]A).\nAdd a drop of 1% lead citrate (about 100 μL) between two rows of NaOH, one drop for each sample (Figure 8[href=https://www.wicell.org#fig8]A).\nInsert the grid face up into the droplet and let it stand for 6–8 min (the specific time can be adjusted according to the final staining degree) (Figures 8[href=https://www.wicell.org#fig8]A and 8B).",
    "Note: During the staining, it is necessary to minimize the contact with CO2 in the air, so some solid NaOH or filter paper soaked with 0.1 mol/L sodium hydroxide is added to the staining environment to adsorb CO2 and reduce the pollution of CO2 in the environment.\nPrepare three 2 cm Petri dishes, fill them with distilled water, and put the leaded grids into Dish 1 for a rinse for 10 s. Move the grids to Dish 2 for washing for 10 s, then move them to Dish 3 for washing for 10 s, and finally place them on filter paper to dry (Figures 8[href=https://www.wicell.org#fig8]A and 8D).\nPrepare a fresh parafilm of about 5 cm in width with lamellar NaOH solids in rows on both sides (Figure 8[href=https://www.wicell.org#fig8]A).\nAdd a drop of 2% uranyl acetate (about 100 μL) between two rows of NaOH, one drop for each sample (Figure 8[href=https://www.wicell.org#fig8]A).\nInvert the grids to the surface of the uranyl acetate droplet by using the surface tension of the droplet (the side where the sections are placed is attached to the surface of the droplet), and the grids are left for 7–8 min (Figures 8[href=https://www.wicell.org#fig8]A and 8C).\nReplace the three dishes in step 25 with fresh distilled water and wash in the same way for three times, 10 s/time (Figures 8[href=https://www.wicell.org#fig8]A and 8D).\nAfter drying the grids on the filter paper, place them in the transmission electron microscope sample box.\nImaging (day 8)\nTiming: 30 min for one sample\nThe purpose of this step is to observe the ultrastructure of the sample.\nAcquire images using a Hitachi 7650 transmission electron microscope operated at 80 kV.\nCollect images of photoreceptor cells from the compound eye."
  ],
  "subjectAreas": [
    "Microscopy",
    "Cell Biology",
    "Neuroscience",
    "Developmental Biology",
    "Model Organisms"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Bioengineering & Technology",
    "Molecular Biology & Genetics"
  ]
}