{
  "id": 5851,
  "origin_website": "Bio",
  "title": "Infection of <em>Caenorhabditis elegans</em> with Vesicular Stomatitis Virus via Microinjection",
  "procedures": [
    "Preparation of Vesicular Stomatitis Virus (VSV) stocksNote: VSV is a Biosafety Level 2 (BSL-2) pathogen and thus should be handled using proper personal protective equipment (gloves, lab coat, eye protection). The virus can be inactivated and equipment decontaminated using either 70% ethanol or 10% Bleach solutions. Therefore, it is important to soak plastic ware, media, and needles exposed to virus in 10% Bleach for a minimum of 30 min prior to discarding in appropriate biohazard waste receptacles that are further decontaminated through autoclaving. Seed ~5 x 106 BHK cells/dish into four 150 x 25 mm tissue culture dishes. Allow cells to attach overnight which should result in dishes that are 80-90% confluent by the next day (Figure 1). Note: Confluency can affect VSV titers and the optimal confluency to initiate infection is when cells cover 80-90% of the plate surface.The following day, dilute starter VSV stock into 20 ml of DMEM with the appropriate volume (dependent upon titer of starting stock) to achieve a multiplicity of infection (MOI) of 0.01 using 5 ml of this VSV-DMEM mixture per dish for infection. For example, assuming a cell doubling time of ~24 h (producing a total cell number of 1 x 107/dish), 1 x 105 PFU would be needed per 5 ml of DMEM for infection of each dish. Incubate cells at 37 °C with 5% CO2 for 2 h, rocking every 30 min to spread the inocula evenly across the dish.2 h post-infection (hpi) replace inocula with 25 ml of complete DMEM (see Recipes).After 24-36 hpi, when significant cytopathic effect has been observed such that ~50% of the cell monolayer has lifted off the plate and cells have become rounded in appearance (Figure 1), collect supernatants from infected cultures and place in 50 ml conical tubes.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115183455_8345.jpgFigure 1.",
    "BHK cell culture before (A and C) and after ~30 h of VSV infection (B and D)Spin harvested supernatants in a benchtop centrifuge with a swinging bucket rotor at 1,000 x g for 10 min at 4 °C to pellet cells. Transfer equal volumes of cleared supernatants (~25 ml/each) to Beckman Ultra-Clear ultracentrifuge tubes and place tubes in an SW28 swinging bucket rotor.Pellet virus particles by ultracentrifugation at 25,000 rpm (~50,000 x g) for 2 h at 4 °C. Pellets should be observable at the bottom of each tube after ultracentrifugation.Aspirate supernatants and resuspend virus particles in 0.5 ml or less DMEM.Aliquot 10 µl of concentrated VSV stock into cryovials and freeze at -80 °C. Note: It is important to freeze multiple, small aliquots of VSV as virus titers rapidly decrease after multiple freeze-thaw cycles and thus each tube should be thawed for a single use.To determine the number of plaque-forming units (PFU)/ml in the resulting VSV stock, titer the concentrated stock using 10-fold serial dilutions and plaque assays in 6-well dishes of Vero (or BSC-40) cells (Yamada and Takaoka, 2017). Briefly, ~5 x 106 Vero cells are seeded in 6-well dishes and allowed to come to confluence and then are infected for 2 h with serial dilutions of the VSV stock in (usually ranging from 10-5 to 10-9) and overlaid with 2 ml of complete DMEM containing 2.4% methyl cellulose for 24 h. The cells are then formaldehyde-fixed using fixation solution (Yamada and Takaoka, 2017), the overlaid media is removed and plaques are visualized with crystal violet staining. For more details and recipes for plaque assays, see Yamada and Takaoka, 2017. Note: VSV titers of ~1 x 1010 PFU/ml are typically obtained with this method.",
    "Preparation of agarose padsBoil a solution of 2% agarose in water and place in a 50 °C water bath.Use a Pasteur pipette to transfer a drop of hot agarose onto the middle of a large coverslip, then immediately drop a second coverslip at a 90° angle to the first on top of the agarose drop.Once agarose has solidified, slide coverslips apart. Place the coverslip-pad in an 80 °C oven for one hour to dry the pad. Note: See Pastuhov et al. (2017) for a demonstration of how to make an agarose pad.Preparing the needlesNote: The procedure below describes our methods for preparing needles for microinjection and the injection procedure itself. For additional details on microinjection see Evans, 2006. Pull needles using glass capillary tubes in PN-30 needle puller.Note: Determining the proper settings to pull the needles requires trial and error, as variations in capillary tube diameter and size and orientation of filament changes the quality of needles pulled. Good needles should easily pierce worms without killing them. Slide the capillary tube through the filament ring using the grooves as a guide, being careful not to disturb the filament itself. Position the tube so the filament is halfway down then tighten the knobs on either side of the filament to hold the capillary tube in place (Figure 2A). imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115183736_6223.jpgFigure 2. Preparation of needles for microinjection. A. Positioning of capillary tube in PN-30 needle puller; B. Resulting needle after needle pull; C. Setup for breaking pulled needle on microinjection scope; D. Positioning of needle next to cover glass edge prior to breaking; E. Bending of needle against cover glass edge to create opening; F. Confirmation of needle end opening by air bubble creation. Note: Images in D-F are field of views at 40x magnification.",
    "Close the cover lid and press the Start button. The pulling of the capillary tube should result in a needle with a pointed end (Figure 2B).The needles have closed tips and thus require breaking before use. Load a needle into the microinjection apparatus as if to inject worms (Figure 2C). Carefully wrap a cover glass in cloth or paper towel and gently bend the glass until it breaks. Ideally, break a 50 mm cover glass into 4-6 fragments.Place a fragment of a broken coverslip on top of a second coverslip with a drop of microinjection oil to keep the broken piece in place (Figure 2C). Place the coverslip on the stage and bring the edge of the glass fragment into focus using the 5x objective. Bring the needle into focus next to the glass fragment edge and switch to the 40x objective (Figure 2D). Refocus if necessary and gently push the needle against the side of the glass fragment. Once the needle tip bends slightly (Figure 2E) and vibrates against the glass, pull it away and inject a small amount of air into the oil. An air bubble confirms the tip has been broken open (Figure 2F).Preparation of test animalsSynchronize worms (N2 and test animals) in the L1 stage using bleach solution (see Recipes) as described (He, 2011b). Distribute roughly 50 to 100 L1 worms/genotype to test onto 35 mm NGM plates containing OP50 bacteria. Grow worms to young adult stage. Notes: Determine the optimal growth condition, including temperature, to assure that worms of different genetic backgrounds reach the young adult stage on the day of injection. We suggest seeding multiple plates with worms and keeping plates at multiple temperatures [e.g., 15 °C, room temperature (RT), 25 °C] as mutant animals may develop at different rates.",
    "We recommend roughly 96 h at 15 °C, or roughly 48 h at RT to generate young adults.In addition to N2 animals, it is recommended to include a hypersusceptible mutant to VSV such as drh-1 mutants, which have a defective antiviral RNAi response (Gammon et al., 2017), to ensure the virus stock is infectious and to compare test animals to both extremes of infection.Preparation of needles with injection mixturePlace a strip of modeling clay inside a 150 x 25 mm Petri dish in order to hold needles.Thaw 10 µl 1 x 1010 PFU/ml VSV-dsRED or VSV-LUC on ice, then mix with 90 µl DMEM. Based on an estimated injection volume of ~10 nl/worm (using femtojet injection pressure and timing settings of 30 psi and 2 sec, respectively), this injection mixture results in the delivery of ~104 PFU/animal. Note: Lower doses (102-103 PFU) can also establish infection although infection rates are dose-dependent (Gammon et al., 2017).Centrifuge injection mixture at 5,000 x g at 4 °C for 10 min to pellet any particulates that could clog the needle. Transfer 20 µl of supernatant to a new 1.5 ml tube to use as injection media. Note: DMEM lacking VSV is used for mock-infection media, which serves as a negative control for infection.Lightly soak a Kimwipe with water, fold it into a strip and tape it to the inside of the needle-holding Petri dish to maintain humidity. Use microloader tips to load 2 µl of injection media (or DMEM for mock-infections) into 4-6 needles. Place each loaded needle into the needle container. An example of the needle holder setup is shown in Figure 3.Note: To remove air bubbles in needles, let them set vertically (with the needle point facing downward) for a few minutes to allow gravity to remove bubbles.",
    "If air bubble persists, gently tap the side of the needle to agitate air bubble into escaping.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115184042_8288.jpgFigure 3. Needle holder setup. Needles are placed firmly into modeling clay within a 150 x 25 mm Petri dish that also contains a dampened Kimwipe to maintain humidity.Microinjection of virus mediaNote: Because microinjection is a procedure that takes time to master, we suggest practicing by injecting worms with virus-free DMEM and ensuring that the vast majority (> 80%) of injected worms survive the next day before proceeding with VSV injections. Dip a pipette tip in microinjection oil and spread a very thin layer of oil across the agarose pad of a coverslip. Note: If the oil layer is too thick, worms will retain freedom of movement and it will take extra time to carefully press down the worm so that it settles and sticks in place on the agarose injection pad. Once the worm is on the pad, it begins to desiccate and will not survive injection if left too long. Load a prepared needle into the needle holder and mount it on the manipulator as in Figure 2C. On a dissecting stereoscope, transfer one to several worms from their NGM plate to the agarose pad using a worm pick. Note: To do so easily, first touch the pick to the microinjection oil, then use the oil to help pick up the worms using the bottom of your pick. Minimize the transfer of bacteria from the plate to the pad. Use the pick to gently orient the worms all into a row where all the worms are facing the same direction. Transfer the slide to the microinjection scope and focus the worms using the 5x objective.",
    "Raise the level of focus to slightly above the worms, then use the manipulator to position the needle until its tip is in focus, right above the worms. Switch to the 40x objective, re-focus on the worms and then lower the needle into the field of view. The needle tip should be in focus next to the worm, at the focal plane where the worm is the widest. The goal is to insert the needle just posterior to the terminal bulb of the pharynx in order to inject virus into somatic (not gonadal) tissues (Figure 4). The needle should be inserted at a slight angle (15° to 40°) to ease its entry. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115184736_2005.jpgFigure 4. Demonstration of microinjection siteInject the worms using femtojet injection pressure and timing settings of 30 psi and 2 sec, respectively.After injection, quickly transfer the coverslip back to the stereoscope. Pipette 5 µl of M-PEG (see Recipes) directly onto the worms in the oil. The worms will free themselves from the agarose and swim in the M-PEG. Once all worms are free, pipette up the M-PEG containing the worms, and then pipette the worms onto NGM plates containing Fluorodeoxyuridine (FUdR) (see Recipes). Notes:  FUdR interferes with DNA replication and prevents the development of eggs and early larvae and thus allows injected animals to be tracked over several days without interference from worm progeny. Each FUdR plate should have 30-40 injected worms.Once all injections have been performed, place all FUdR plates in an incubator at 15-25 °C. Note: Virus replication and lifespan of infected nematodes are significantly altered by incubation temperature with lower temperatures typically resulting in fewer worms infected and greater survival (Gammon et al., 2017). We typically incubate infected worms at 25 °C to achieve higher rates of virus replication (Gammon et al., 2017).",
    "Scoring infection using fluorescence assay (after injection with VSV-dsRED)Note: Worms injected with virus-free DMEM serve as a negative control group for infection in this experiment. These animals can be used to ensure fluorescence observed in VSV-dsRED-injected animals is not an artifact. Worms that are unresponsive to a light touch by a platinum worm pick are considered dead and are removed from the experiment. All animals that die within 18 hpi are considered to have not recovered from the microinjection procedure itself and are removed from the experiment. Animals that crawl off the plate and are lost during the experiment are also censored. Scoring of the remaining worms is started 24 hpi.Using a fluorescent stereomicroscope, score worms for the presence of dsRED signal every 24 h and record the number of animals that are still alive, removing dead animals. Note: N2 worms will typically present with dsRED signal in muscle tissue in the head, vulva, and tail (Figure 5). However, worms that are hypersusceptible to injection, such as drh-1 mutants, will display dsRED signals in multiple tissues throughout the body (Figure 5). Always check the GFP channel when scoring worms with apparent fluorescence signals to ensure the signal is not gut autofluorescence and that the signal is specific to the dsRED channel. Also, dsRED signals should be absent from the negative control group injected with just DMEM. Any animals with dsRED signal (in any tissue) that is clearly distinct from background autofluorescence observed in control animals are scored as positive for infection. Animals appearing to have different VSV susceptibilities can be further tested using luminescence assays (see below).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20171115/20171115185048_3631.jpgFigure 5. Differential interference contrast (DIC) and fluorescence micrographs of N2 and drh-1 animals infected with VSV-dsRED 72 hpi. Green fluorescence indicates autofluorescence signal in the intestine. See also Gammon et al.",
    ", 2017 for more examples.Scoring infection using luminescence assay (after injection with VSV-LUC)Note: Worms injected with virus-free DMEM serve as a negative control group for infection in this experiment. At specific intervals post-infection (typically 24-72 hpi), worms should be harvested from each treatment to score for luciferase activity, which is used as a readout for VSV-LUC replication (Gammon et al., 2014 and 2017).At each time point chosen, pick 10 worms for each strain/treatment in 100 µl of reporter lysis buffer (in triplicate).Snap freeze in a -80 °C freezer or using liquid nitrogen, thaw at room temperature, sonicate using a Bioruptor® II sonicator (30 sec on high setting), snap freeze again, thaw at room temperature again.Spot 20 µl of lysates into a 96-well dish and mix each well with 100 µl Luciferase Assay Reagent.Measure arbitrary light units (LU) using Envision 2102 Multilabel Reader with Wallac EnVision Manager software. Note: Lysates from worms injected with virus-free DMEM (control group) can be used to determine the background LU signals in order to subtract the average of these values from LU signals obtained from the lysates of VSV-LUC-challenged animals."
  ],
  "subjectAreas": [
    "Microbiology",
    "Immunology"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}