{
  "id": 13810,
  "origin_website": "Jove",
  "title": "The Attentional Set Shifting Task: A Measure of Cognitive Flexibility in Mice",
  "procedures": [
    "NOTE: Animals used in this study are male C57Bl/6J mice between 4 and 6 months of age for optimal results. Mice are maintained on a reverse light cycle in order to conveniently test them during the active (dark) phase. If behavior is performed in a room separate from housing, mice are allowed at least 1 hr to acclimate following transportation to the testing room. Behavioral testing is performed under red light conditions minimize disruption to the normal activity of the mice as little as possible while still allowing the experimenter adequate illumination to visually monitor the testing session.\nNOTE: All aspects of the experimental procedure described herein were carried out in accord with the Guide for the Care and Use of Laboratory Animals, 8th edition (NRC) and were approved by the Institutional Animal Care and Use Committee at the University of Texas Health Science Center at San Antonio.\n1. Experimental Setup\nFill ceramic ramekins (non-porous; 1.5” depth x 2.5' diameter), to inner rim with digging medium (approximately 1” from bottom); filter paper rounds cut in half and taped to inside back of ramekin (Figure 1A)\nBreak lightly sweetened dry breakfast cereal (food reward) – Honey Nut or sugar coated varieties, into approximately 20 mg pieces for acclimation, training and testing stages.\nMake an attentional set shifting task (AST) chamber (Figure 1B): Acclimate train and test each mouse in individual chambers; recommend production of at least 8 chambers.\n\t\nBuild a 12” x 8” x 7” AST chamber; walls and start gate made of opaque white acrylic that is easy to clean with 70% ethanol. The guillotine-style, removable starting gate separates chamber into a waiting area (5” x 8”) and testing area (7” x 8”).",
    "Include a Clear 5”x7” removable partition that separates two sides of testing area evenly; cut three ¼” diameter holes into bottom portion of partition to allow sniffing access, spaced 1” apart and 1” from the front of the partition (Figure 1C).\n2. Procedure Overview (Figure 2)\nPrior to AST, house mice individually and allow them to adjust to a reverse light cycle for at least one week.\nAcclimate, train and test each animal in individual testing chambers. Assign each chamber to one mouse and clean with 70% ethanol after finishing the final day of testing. This will minimize stress during testing by making the chamber smell like “home-cage” or “self”.\nScent the testing pots 2 days prior to testing to allow the scent to dissipate; mice will not dig in pots that have a very strong odor. Using a syringe with a 25 G needle, add approximately 0.1 ml of essential oil to the top of the filter paper.\n3. Handling (Days 1-8)\nHandle mice starting 8 days prior to the first day of food restriction. This will reduce stress associated with handling during testing.\nWeigh and record body weights each day of handling. Handle each mouse 2-3 min per day.\nIf multiple experimenters are to be involved in testing a set of mice, ensure that each experimenter participates in the handling process to increase familiarity with experimenters and reduce stress and anxiety experienced on training or testing days.\nContinue handling and recording weights throughout the duration of testing.\n4. Food restriction (Days 9-12)",
    "Beginning 4 days prior to the start of acclimation, place mice on a restricted diet to maintain mice at 80-85% of their free feeding body weight. Give 1 gram of food per mouse per day. If body weight falls below the specified range give 2 grams per day until they return to the appropriate range.\nPlace 2 ramekins at the front of each home cage in order to allow mice to acclimate to the testing pots. These are the same spots used to train the mouse to dig for a food reward.\nAdd 2 grams of food and 1 piece of food reward (half a piece of cereal in each) in the ramekins each day for 4 days.\nIf behavior is to be performed in a separate room than the one in which the mice are housed, beginning on day 1 of food restriction, transport mice to the testing room for at least 1 hr per day prior to returning to the housing room to allow them to acclimate to the testing room.\nOn the last day of food restriction, before the start of acclimation, change the home cage bedding. The cage bedding will not be changed again until after testing is complete to reduce stress or anxiety experienced during training and testing (unless absolutely necessary).\nMaintain mice on food restriction until the end of testing. On days 13-17, give mice food after acclimation, training, or testing based on an estimate of the amount of food reward consumed (generally <1g of food pellet).\n5. Acclimation (Days 13-14)\nBeginning 2 days prior to the start of training, perform acclimation during the dark cycle under red light.",
    "Spread a small amount of dirty bedding from the home cage in the chamber, this will reduce the stress of being in a new environment by introducing a familiar “home-cage” or “self” smell to the testing chamber (the same chamber will be used for a single mouse for the duration of training and testing).\nPlace a clean ramekin with water in the waiting area of the chamber; mice tend not to eat if they do not have access to water.\nPlace the two ramekins that have been used for food restriction in the testing area with a food reward (~20 mg cereal piece) in each.\nPlace the mouse in the waiting area; remove the start gate and allow the mouse to explore the chamber for 1 hr.\nContinuously add food rewards (~20 mg cereal piece) to the empty ramekins in order to encourage the mice to explore the testing area and the pots frequently.\nEnsure that the mouse can see the experimenter throughout the acclimation period so that the presence of the experimenter is not an added stressor during testing.\n6. Training (Day 15)\nPlace the mouse in the waiting area.\nPlace the empty ramekins, each containing a food reward (~20 mg cereal piece), into the testing area and lift the start gate. Allow mouse 3 min to retrieve both food rewards. Repeat this step several times.",
    "Gradually add sawdust/mouse cage bedding to the pots in subsequent trials. Allow the mouse 3 min to retrieve the food reward from each pot before ending the trial. Once the mouse has retrieved the food reward from each pot, proceed to the next trial. If the mouse does not make attempts at digging once the food reward is partially covered, hints may be provided (i.e., sprinkle cereal dust over area of the food reward, make an indention in the sawdust over area of food reward, uncover part of the food reward).\nContinue adding sawdust/bedding after each trial until the food reward is fully covered and the mouse reliably demonstrates the ability to dig in a full pot to find the food reward.\nIf a mouse has not reliably demonstrated the ability to find a food reward in a full pot within 2 hr of the start of training, continue to a second day of training. Maintain the mouse on food restriction and repeat this procedure the next day.\nIf the mouse fails to dig for a food reward after two successive days, exclude it from the remainder of the experiment, and annotate as a “failed to dig” in the experimental record.\n7. Testing (Days 16-17):\nOn day one, test simple discrimination (SD), compound discrimination (CD), reversal (R1), and intra-dimensional shift (IDS).\nOn day two, test the intra-dimensional shift 2 (IDS2), intra-dimensional shift 3 (IDS3), reversal 2 (R2; optional), extra-dimensional shift (EDS).\nPair media and scents as shown in Table 1.\nAt the time of handling on testing day, give mice one food reward to avoid a lack of focus during testing due to hunger. From this point until the end of the testing day, do not provide any food except rewards for correct choices.",
    "At the start of testing, using forceps (limits the spread of scents between pots), place a piece of the food reward in the pot that indicates a correct choice. The food reward should be fully covered by media (see Figure 3). To avoid a scent cue from the food reward, sprinkle cereal dust over all pots at the start of the stage.\nPlace the mouse in the waiting area with the start gate closed. Place the pots on either side of the testing chamber. The trial begins when the start gate is removed and the timer is started. Allow each mouse 3 min per trial to make a choice. Record the choice (correct or incorrect) and time until the mouse made a choice for each trial.\n\tNOTE: A “choice” is indicated by an attempt to dig in either pot. A dig is only recorded as a choice if the mouse has displaced the media and poked its nose far enough in the space it creates to find the food reward or displaced enough of the media to uncover the food reward. If a mouse has not made a choice within 3 min, this is recorded as no choice (incorrect).\nOnce a choice has been made for either pot, remove the pot that was not chosen from the testing chamber. If a correct choice was made, allow the mouse to finish the food reward before placing the mouse back in the waiting area. If an incorrect choice is made, allow the mouse to explore the pot to show that there is no food reward for that choice before returning the mouse to the waiting area.\nAt the end of each trial, place the mouse back in the waiting area and replace the start gate.",
    "Ensure that the mouse meets the criterion of 8 correct trials consecutively to advance to the next stage of AST. If a mouse does not obtain 8 correct choices consecutively within 50 trials, it fails that stage and cannot move on to complete the test. 6 consecutive no choices (3 min without a choice) is a failure to participate and prohibits the mouse from moving on to the next stage.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Behavior"
  ],
  "bigAreas": [
    "Ecology & Environmental Biology"
  ]
}