{
  "id": 6739,
  "origin_website": "Bio",
  "title": "Structural Alignment and Covariation Analysis of RNA Sequences",
  "procedures": [
    "Prepare a set of related (homologous) RNA sequences to analyze, either using local sequences or by downloading sequences from a database. Sequences can be retrieved via keyword searches from general-purpose databases such as NCBI GenBank/RefSeq (https://www.ncbi.nlm.nih.gov/[href=https://www.ncbi.nlm.nih.gov/]), ENA (https://www.ebi.ac.uk/ena[href=https://www.ebi.ac.uk/ena]), or Ensembl (http://www.ensembl.org/[href=http://www.ensembl.org/]), or from specialized RNA databases such as SILVA (https://www.arb-silva.de/[href=https://www.arb-silva.de/]), ncRNA databases (https://ncrnadatabases.org/[href=https://ncrnadatabases.org/]), RNAcentral (https://rnacentral.org/[href=https://rnacentral.org/]), the Comparative RNA Website (http://www.rna.icmb.utexas.edu/[href=http://www.rna.icmb.utexas.edu/]), or Rfam (https://rfam.org/[href=https://rfam.org/]; e.g., see the Nucleic Acids Research website for a non-exhaustive listing of RNA sequence databases; http://www.oxfordjournals.org/nar/database/cat/2[href=http://www.oxfordjournals.org/nar/database/cat/2]). Some of the RNA databases (e.g., SILVA, Rfam, Comparative RNA Website) provide sequences that are already aligned in the form of structure-aware multiple alignments. Homologs of RNA sequences of interest can also be identified by sequence similarity search, e.g., using the well-known BLASTN tool. All general databases and some of the RNA databases provide a BLAST service. One can also search for related RNA sequences at the structural level with the help of covariance models using INFERNAL (Nawrocki and Eddy, 2013) or CMfinder (Yao et al., 2006).  All collected sequences must be put in a single file in the commonly used FASTA format (https://en.wikipedia.org/wiki/FASTA_format[href=https://en.wikipedia.org/wiki/FASTA_format]; Figure 1).Note: The composition of the dataset may influence the analysis of covariation, depending on the amount of similarity or dissimilarity between the sequences and their phylogenetic relationships.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200115/20200115221314_8538.jpgFigure 1. Example of unaligned RNA sequences in FASTA format (visualized in Emacs)Compute a structural multiple alignment by running MAFFT in the ‘X-INS-I’ mode:mafft-xinsi --scarnapair --nuc --reorder --maxiterate max_number_of_iterations --thread number_of_CPUs_to_use sequence_file.fasta 1> mafft_alignment.fasta 2> mafft_alignment_details.logThe alignment generated will be in FASTA format (Figure 2).Notes: The option “--scarnapair” instructs MAFFT to use MXSCARNA to perform pairwise structural alignments, which is the default option. To use the LaRA aligner instead, invoke the pair of options “--larapair --laraparams parameter_file”, where “parameter_file” is a file with LaRA configuration parameters. A template file “lara.",
    "params” is provided with the LaRA software. To use the FOLDALIGN aligner, invoke the option “--foldalignlocalpair” or “--foldalignglobalpair” to perform local or global pairwise alignment, respectively. In benchmarking comparisons (Katoh and Toh, 2008) the accuracy of MXSCARNA was generally higher than that of LaRA, except when the identity among the sequences was low (<40%), in which case LaRA may be preferred. FOLDALIGN is another structural alignment program that is highly accurate and that can carry out structural alignments of sequences with low similarity ( Havgaard et al., 2005; Sundfeld et al., 2016). To obtain high accuracy alignments, use a large number of iterative refinements, e.g., set “max_number_of_iterations” to 1,000 for the “--maxiterate” option”. For the “--thread” option, increase “number_of_CPUs_to_use” to speed up alignment computation. Runtime increases with the number and length of the sequences. For example, for a set of 100 sequences of length 50-200 nt calculations can take 3-10 min on a single CPU, and under a minute when using at least 8 CPUs. In some environments, MAFFT may abort with the following error: “mafft-xinsi: line 2369: /dev/stderr: Not a directory”. The error can be solved by replacing “/dev/stderr” by “/dev/null” in the mafft-xinsi bash script. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200115/20200115221352_3488.jpgFigure 2. Structural alignment produced by MAFFT visualized in 4SALE(Optional) Predict a reference secondary structure:In order to reveal covariation, a reference secondary structure is needed. It can be the structure of one of the RNA sequences included in the analysis, a consensus structure inferred from the alignment, or an external structural model. In lack of a known or experimentally-determined model, the structure needs to be predicted. Prediction of the 2D structure of a single RNA sequence can be done with widely used tools such as MFOLD (Zuker, 2003), http://unafold.rna.albany.edu/?q=mfold[href=http://unafold.rna.albany.edu/?q=mfold]), RNAfold from the ViennaRNA package (Lorenz et al., 2011), https://www.tbi.univie.ac.at/RNA/[href=https://www.tbi.univie.ac.",
    "at/RNA/]), Fold or MaxExpect from the RNAStructure package (Reuter and Mathews, 2010), https://rna.urmc.rochester.edu/RNAstructure.html[href=https://rna.urmc.rochester.edu/RNAstructure.html]), or RNAshapes from the RNA shapes studio (Janssen and Giegerich, 2015; https://bibiserv.cebitec.uni-bielefeld.de/rnashapesstudio[href=https://bibiserv.cebitec.uni-bielefeld.de/rnashapesstudio]). All these tools can be run on-line at dedicated webservers or installed locally as command-line programs. For example, standard commands to run MFOLD or RNAfold with default parameters on an RNA sequence in FASTA format would be:mfold SEQ=sequence_file.fasta (structures will be output in files named “sequence_file*.ct”) RNAfold < sequence_file.fasta > structure_file.bThe above-mentioned packages have numerous options to tune the folding computation (e.g., by changing the algorithm, temperature, ionic conditions), and most of them provide the possibility to impose constraints on the structure.  There exists also several pieces of software for predicting consensus structures from alignments, such as RNAalifold (Bernhart et al., 2008) from the ViennaRNA package, the graphical tool ConStruct (Wilm et al., 2008b); http://www.biophys.uni-duesseldorf.de/construct3/[href=http://www.biophys.uni-duesseldorf.de/construct3/]), and RNAalishapes from the RNA shapes studio (Voß, 2006); https://bibiserv.cebitec.uni-bielefeld.de/rnaalishapes[href=https://bibiserv.cebitec.uni-bielefeld.de/rnaalishapes]). Notably, RNAalifold does not weight the sequences and is highly sensitive to the particular sample of sequences under study and the prediction can be affected by the varying amount of similarity between the sequences as well as by sequences containing insertions. ConStruct incorporates custom sequence weighting for optimal consensus prediction while RNAalishapes is based on the concept of abstract structural shapes and also includes gap-aware energy evaluation which makes it outperform RNAalifold when sequences contain insertions and/or alignment is of low quality (Voß, 2006). In our experience RNAalishapes performed quite well. RNAalishapes relies on older Linux libraries and may not install on current architectures, thus the on-line version may have to be used.Analyze the covariation in the alignment and generate an image of the covariation-annotated alignment using R-chie:Covariation is revealed by mapping the reference secondary structure onto the multiple alignments.",
    "The structure can be provided to R-chie in one of the common formats used by structure prediction and analysis software, including dot-bracket (or Vienna; “.b”), connect-table (“.ct”), as well as bpseq (from The Comparative RNA Website [Cannone et al., 2002], http://www.rna.icmb.utexas.edu/[href=http://www.rna.icmb.utexas.edu/]). The alignment must be in FASTA format.rchie.R --msafile=mafft_alignment.fasta --pdf --output=alignment_covariation_figure.pdf --format1=vienna --rule1=7 --group1=4 --legend1 --legend3 --msaspecies --msagrid --msatext reference_structure.b &> rchie.logThis will create a figure of the alignment in PDF format, in which the paired regions in the reference secondary structure are represented by arcs colored according to the covariation score and nucleotides in the sequences are colored according to their base-pairing status (Figure 3).Notes: The above command runs with a reference structure in dot-bracket (“.b”) format, which is indicated by the option “--format1=vienna”. For a structure in connect (“.ct”) or bpseq format “--format1=connect” or “--format1=bpseq” would be used, respectively. Option “--rule1=7” is used to group base-pairs on covariation scores and option “--group1=4” is used to set the number of groups to 4. Various other criteria can be chosen for grouping; run “rchie.R --help” for details. R-chie is highly customizable. Options “--legend1”, “--legend3”, “--msaspecies”, “--msagrid”, and “--msatext” can be invoked or omitted at will in order to turn on or off legends, sequence names, and other graphical settings. Colors for every element in the image can be specified by additional options such as “--colour1”, “--palette1”, or “--msacol”; run “rchie.R --help” for details. imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200115/20200115221720_2329.jpgFigure 3. Structure- and covariation-annotated alignment drawn by R-chie(Optional) If necessary, manually edit the alignment produced by MAFFT to correct errors or adjust the alignment using a structure-aware editor such as RALEE (Griffiths-Jones, 2005), http://sgjlab.org/ralee/[href=http://sgjlab.org/ralee/]), 4SALE (Seibel et al., 2006); http://4sale.bioapps.biozentrum.uni-wuerzburg.de/[href=http://4sale.bioapps.biozentrum.uni-wuerzburg.de/]), S2S (Jossinet and Westhof, 2005); http://bioinformatics.org/assemble/[href=http://bioinformatics.org/assemble/]), ConStruct (Wilm et al., 2008b); http://www.biophys.uni-duesseldorf.de/construct3/[href=http://www.biophys.uni-duesseldorf.de/construct3/]), or SARSE (Andersen et al., 2007). Then, regenerate the covariation-annotated figure using R-chie."
  ],
  "subjectAreas": [
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}