{
  "id": 2097,
  "origin_website": "Cell",
  "title": "Protocol to analyze the bacterial pangenome using PAN2HGENE software",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nStep 1: install dependencies\nTiming: 1 h\nThe complete installation of PAN2HGENE starts with the installation of the system dependencies and then continues with the installation of other programs that are part of the pipeline.\nTo start the installation run the commands in the Box 1. Below to update the system.\nBox 1\nsudo apt-get install make\nsudo apt-get install build-essential\nsudo apt-get install curl\nCritical: If you face any problem with the commands of the Box 1, we suggest update your system with the commands ‘sudo apt-get update’ and ‘sudo apt-get upgrade’. After this try to run the Box 1 again.\nThen we will install some packages and programs with the commands below.\nBox 2\nsudo cpan install YAML.pm\nsudo cpan install YAML::XS\nsudo cpan install Bio::AlignIO\nsudo cpan install Statistics::LineFit\nsudo cpan install Statistics::Distributions\nsudo cpan install Bio::Perl\nsudo cpan install Bio::SearchIO:::hmmer3\nsudo apt-get install screen\nsudo apt-get install bowtie2\nsudo apt-get install blast2\nsudo apt-get install samtools\nsudo apt-get install python3-distutils\nsudo apt-get install python\nsudo cpan install DBI\nsudo apt-get install mafft\nsudo apt-get install mcl\nsudo apt-get install phylip\nStep 2: installation of software that compose the pipeline\nTiming: 2 h 22 min 30 s\nThe following are the steps to install the external software that are part of the PAN2HGENE pipeline.\nSPAdes Installation. SPAdes is available at http://cab.spbu.ru/software/spades/[href=http://cab.spbu.ru/software/spades/], the installation process follows below.\nBox 3\nwget http://cab.spbu.ru/files/release3.15.3/SPAdes-3.15.3-Linux.tar.gz[href=http://cab.spbu.ru/files/release3.15.3/SPAdes-3.15.3-Linux.tar.gz]\ntar -xzf SPAdes-3.15.3-Linux.tar.gz\nAt the end of the installation, the user must move the SPAdes folder to the /opt directory.\nBox 4\nmv SPAdes-3.15.3-Linux/ SPAdes/\nsudo mv SPAdes/ /opt/\ncd /opt/\nsudo chmod 777 -R SPAdes/\nTo validate the installation, run the command (see Box 5), shown in Figure 1[href=https://www.wicell.org#fig1].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig1.jpg\nFigure 1. SPAdes test: Demonstrates the SPAdes test run",
    "Box 5\n/opt/SPAdes/bin/spades.py\nPGAP Installation. The PGAP software is available at https://sourceforge.net/projects/pgap/[href=https://sourceforge.net/projects/pgap/], after downloading it follow the steps below, it is important to note that at the time of building this protocol the most current version was PGAP-1.2.1.\nBox 6\ntar -xzf PGAP-1.2.1.tar.gz\nmv PGAP-1.2.1/ PGAP/\nsudo mv PGAP/ /opt/\ncd /opt/\nsudo chmod 777 -R PGAP/\nThe following step is the configuration of the PGAP script (/opt/PGAP/PGAP.pl), it can be done using gedit or other text editor preferred by the user.\nBox 7\nsudo gedit /opt/PGAP/PGAP.pl\nModify the path of the software leaving the lines of the file the same as the lines without comments (lines that do not start with the # character). It is necessary to adjust the execution path of the programs e.g., /usr/bin/formatdb according to the path where the software is in your operating system. In Box 8 below, the lines that do not start with the character # demonstrate the configuration performed in the Ubuntu operating system.\nBox 8\n### programs from BLAST\nmy $formatdb=\"/usr/bin/formatdb\";\nmy $blastall=\"/usr/bin/blastall\";\n### programs from mcl\nmy $mcl=\"/usr/bin/mcl\";\n### programs from mafft\nmy $mafft=\"/usr/bin/mafft\";\n### programs from PHYLIP\nmy $seqboot=\"/usr/lib/phylip/bin/seqboot\";\nmy $neighbor=\"/usr/lib/phylip/bin/neighbor\";\nmy $consense=\"/usr/lib/phylip/bin/consense\";\nmy $dnaml=\"/usr/lib/phylip/bin/dnaml\";\nmy $dnadist=\"/usr/lib/phylip/bin/dnadist\";\nmy $dnapars=\"/usr/lib/phylip/bin/dnapars\";\nLook for the 3 lines below and replace \"./\" with \"/opt/PGAP/\". After the replacement the lines should look like Box 10.\nBox 9\nsystem(\"perl ./multiparanoid.pl -species \".join(\".pep+\",@species).\".pep -unique 1\");\nsystem(\"perl ./Blast_Filter.pl All.blastp All.pep $coverage $identity $score | $mcl - --abc -I 2.0 -o All.cluster\");\nsystem(\"perl ./inparanoid.pl $blastall $thread $formatdb $score $global $local\n$species[$i].pep $species[$j].pep\");\nBox 10\nsystem(\"perl /opt/PGAP/multiparanoid.pl -species \".join(\".pep+\",@species).\".pep -unique 1\");\nsystem(\"perl /opt/PGAP/Blast_Filter.pl All.blastp All.pep $coverage $identity $score | $mcl - --abc -I 2.0 -o All.cluster\");\nsystem(\"perl /opt/PGAP/inparanoid.pl $blastall $thread $formatdb $score $global $local $species[$i].pep $species[$j].pep\");",
    "Save the file and close gedit. To validate that PGAP was installed correctly, run the command below and result should be similar to this (Figure 2[href=https://www.wicell.org#fig2]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig2.jpg\nFigure 2. PGAP test: Demonstrates the PGAP test run\nBox 11\n/opt/PGAP/PGAP.pl\nProkka Installation. The Prokka software is available https://github.com/tseemann/prokka[href=https://github.com/tseemann/prokka], to install the version for Ubuntu/Debian/Mint run the commands below.\nBox 12\nsudo apt-get install libdatetime-perl libxml-simple-perl libdigest-md5-perl git default-jre bioperl\nsudo cpan Bio::Perl\nsudo git clone https://github.com/tseemann/prokka.git/opt/prokka[href=https://github.com/tseemann/prokka.git/opt/prokka]\nsudo chmod 777 -R /opt/prokka\n/opt/prokka/bin/prokka --setupdb\nsudo chmod 777 -R /opt/prokka\nTo verify that Prokka was installed correctly, run the command below and the result should be similar to this (Figure 3[href=https://www.wicell.org#fig3]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig3.jpg\nFigure 3. Prokka test: Demonstrates the Prokka test run\nBox 13\n/opt/prokka/bin/prokka\nR Installation. The R software is installed by following the commands below.\nBox 14\nsudo apt-get update\nsudo apt-get install r-base r-base-dev\nAfter installation, run R and install the libraries.\nBox 15\nsudo R\ninstall.packages('ape')\ninstall.packages(\"plotrix\")\ninstall.packages(\"minpack.lm\")\ninstall.packages('ctv')\nlibrary('ctv')\ninstall.views('Phylogenetics')\nupdate.views('Phylogenetics')\nq()\nTbl2asn Installation. The tbl2asn tool is installed by running the following commands.\nBox 16\nwget -N\nftp://ftp.ncbi.nih.gov/toolbox/ncbi_tools/converters/by_program/tbl2asn/linux64.tbl2asn.gz\ngunzip linux64.tbl2asn.gz\nsudo chmod +x linux64.tbl2asn\nmv linux64.tbl2asn /usr/local/bin/tbl2asn\nAnd to test if everything is correct, run the command below and the result should be similar to this (Figure 4[href=https://www.wicell.org#fig4]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig4.jpg\nFigure 4. Tbl2asn test: Demonstrates the Tbl2asn test run\nBox 17\ntbl2asn --help\nMySQL Installation. To install MySQL server run the following commands.\nBox 18\nsudo apt-get install mysql-server\nsudo mysql_secure_installation\nMySQL will ask you to create a password for the root user. Enter the password and answer Y when asked.\nThe component checks to see if the new password is strong enough. Choose one of the three levels of password validation:\nLow. A password containing at least 8 characters.",
    "Medium. A password containing at least 8 characters, including numeric, mixed case characters, and special characters.\nStrong. A password containing at least 8 characters, including numeric, mixed case characters, and special characters, and compares the password to a dictionary file. Enter 0, 1, or 2 depending on the password strength you want to set.\nThe script then prompts for the following security features: Remove anonymous users? Disallow root login remotely? Remove the test database and access to it? Reload privilege tables now?\nTo check if your MySQL was installed correctly run the command below and the result should be similar to this (Figure 5[href=https://www.wicell.org#fig5]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig5.jpg\nFigure 5. MySQL test: Demonstrates the MySQL test run\nBox 19\nsudo systemctl status mysql\nStep 3: using PAN2HGENE\nTiming: 1 h 27 min\nAfter installing all dependencies, the user must download PAN2HGENE. To start using it, follow the steps below.\nPAN2HGENE Download. The PAN2HGENE jar package is available at (https://sourceforge.net/projects/pan2hgene-software/[href=https://sourceforge.net/projects/pan2hgene-software/]). Download the pan2hgenev2.0.jar and lib_v2.tar.xz files leaving both in the same directory. See the example below. The PAN2HGENE pipeline can be executed in three different ways, each one performing a specific analysis.\nBox 20\ncd /home/pablo/panTest/\ntar -xf lib_v.2.tar.xz\nsudo chmod 777 -R /home/pablo/panTest/\njava -jar pan2hgenev2.0.jar\nPAN2HGENE Product Identification analysis. The input for this analysis is a pair of files in FASTA and FASTQ format, the FASTA file can contain a complete genome or a draft of the organism. An attempt is made to identify possible new gene products for the analyzed genomes.\nNote: In this example, product identification analysis is performed using a Bifidobacterium breve DSM20213 genome and paired reads from the Illumina HiSeq 2000. To start the Product Identification analysis, place the fasta genome and fastq reads in the same folder, follow the steps below.\nBox 21\njava -jar pan2hgenev2.0.jar",
    "If this is your first use, enter the root user and password and press the create DB button, else enter the root user and root password in the indicated fields and then click the Connect button, then click on the Next button (Figure 6[href=https://www.wicell.org#fig6]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig6.jpg\nFigure 6. Database management: The window has all functions to handle database, like status, drop, create e connect database\nOn the following screen, it is necessary to enter the project name and select the type of analysis to be performed. In the following example, the name “Test1” and the Product Identification option were added, after that press the New button (Figure 7[href=https://www.wicell.org#fig7]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig7.jpg\nFigure 7. Project management: In this window, the user will create the project, so just inform the name of the project and the type of analysis to be performed\nData input is done in the following window. Press the Browse button to select the FASTA file (Remember that fasta genome and fastq reads must be in the same folder). The reads files will be displayed below, select the appropriate reads for the organism, inform the type of reads and if it is paired, inform the order and orientation (Figure 8[href=https://www.wicell.org#fig8]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig8.jpg\nFigure 8. Input data: In this window, the user will add the files in fasta and fastq format depending on the analysis chosen\nPress Add Read button and confirmation message will be displayed (Figure 9[href=https://www.wicell.org#fig9]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig9.jpg\nFigure 9. Confirmation warning\nNote that the reads are now marked as used, repeat the same process if there are more genomes. Then click Next (Figure 10[href=https://www.wicell.org#fig10]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig10.jpg\nFigure 10. Input data confirmation: Demo files after being added to the analysis",
    "The screen below will be shown, here it is possible to modify the parameters of PAN2HGENE for Bowtie, Comparative Analysis, and Annotation process. In this case, we will use the default parameters. So just click the Save Data button, then click Next (Figure 11[href=https://www.wicell.org#fig11]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig11.jpg\nFigure 11. Parameters window: In this window, the user can edit the parameter values or can choose to use the default value\nThe screen below will be shown. To start the analysis, click on the Perform analysis button. And in the Logs field, it is possible to check the analysis steps being performed. When the analysis is finished, the message Complete Analysis will appear in the Logs field, as can be seen on the screen below. Now close PAN2HGENE and go to the folder where the data was analyzed (Figure 12[href=https://www.wicell.org#fig12]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig12.jpg\nFigure 12. Perform analysis and Log: In this window, the user executes the analysis and follows the execution steps\nSeveral files will be inside the folder, in addition to the fasta genome and the fastq reads used in the analysis. The result of the Product Identification analysis are the three files marked below, GenomeNameBlastResult_Products.fasta, GenomeNameBlastResult_report.pdf, and GenomeNameBlastResult_Report.txt (Figure 13[href=https://www.wicell.org#fig13]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig13.jpg\nFigure 13. Product identification analysis results\nPAN2HGENE Comparative analysis. In this example, three fasta genomes, Bifidobacterium breve DSM20213 (complete), Bifidobacterium breve NCTC11815 (complete) and Bifidobacterium breve PRL2020 (draft with six contigs) were used. To start Comparative Analysis, place all fasta genomes in the same folder as shown below.\nCritical: The initial steps are the same as shown in Figures 6–12[href=https://www.wicell.org#fig6], with the exception of the input data window that changes for this specific analysis.\nWhen informing the directory of the FASTA files, they will be listed as shown in the figure below (Figure 14[href=https://www.wicell.org#fig14]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig14.jpg",
    "Figure 14. Input data window: In this window, the user input complete or draft genomes in FASTA format\nThe analysis results are organized in the pgfiles directory. The files that are the results of the Comparative Analysis are the files that start with the numbers 1, 2, 3, 4, 5 and the figures in PNG format (Figure 15[href=https://www.wicell.org#fig15]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig15.jpg\nFigure 15. Comparative analysis results\nPAN2HGENE Full pipeline. The Full Pipeline analysis performs Product Identification analysis and Comparative Analysis automatically and sequentially. Thus, the new gene products identified in the Product Identification step will be used in the Comparative Analysis step.\nNote: Now follow the steps described previously in the item ‘10. PAN2HGENE Product Identification analysis’, selecting Full Pipeline analysis instead of Product Identification (Figure 16[href=https://www.wicell.org#fig16]).\nMain graphical results. The graphs are produced by running the comparative analysis, so the creation is included in the processing time (Figures 17[href=https://www.wicell.org#fig17] and 18[href=https://www.wicell.org#fig18]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig16.jpg\nFigure 16. Full pipeline analysis results\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig17.jpg\nFigure 17. Graphics results of pangenome: On the left we have the graph with the information about pangenome, together with the Heap’s Law calculation and on the right, in the pie chart, the information about the amount of unique gene products and genes shared between the analyzed organisms\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig18.jpg\nFigure 18. Graphics results of unique genes: On the left we have the graph with information about the amount of unique genes per organism present in the analysis and on the right an example of a phylogenetic tree graph\nStep 4: patric optional usage\nTiming: 2 min\nPatric software has been integrated into the pipeline as an alternative to automatic annotation software. Thus, the user is free to choose between Patric or Prokka, for the annotation execution.",
    "Your PAN2HGENE is now ready to use, If the user does not want to use Patric to make the annotation, it is not necessary to perform the following steps.\nNote: However, the PAN2HGENE offers the option to perform all annotation analyses through PATRIC instead of Prokka (which is the default option). If you want to use PRATIC in the annotation process, follow the steps below. If you do not already have a PATRIC account, you will have to register on (https://patricbrc.org/[href=https://patricbrc.org/]).\nInstall PATRIC Command Line Interface.\nBox 22\ncurl -O -L https://github.com/PATRIC3/PATRIC-distribution/releases/download/1.034/patric-cli-1.034.deb[href=https://github.com/PATRIC3/PATRIC-distribution/releases/download/1.034/patric-cli-1.034.deb]\nsudo dpkg -i patric-cli-1.034.deb\nsudo apt-get -f install\nIf you prefer you can also install PATRIC using the tool gdebi.\nBox 23\nsudo apt-get install gdebi-core\nsudo gdebi patric-cli-1.034.deb\nSetting, copy the file “p3-login.pl”, provided with the pan2hgene files, and replace it in the installation directory of Patric-cli.\nBox 24\ncp -r < file directory > usr/share/patric-cli/deployment/plbin/\nWhen performing any of the PAN2HGENE analyses, it is possible to choose the Patric annotation instead of the Prokka annotation. Before saving the parameters, click on the PATRIC button (Figures 19[href=https://www.wicell.org#fig19] and 20[href=https://www.wicell.org#fig20]).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig19.jpg\nFigure 19. Input data parameters: The user can select Patric annotation tool\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1581-Fig20.jpg\nFigure 20. Parameter patric: The user enter with your credentials, taxonomy ID and Domain organism, for instance, Escherichia coli, Taxonomy ID 562 and Domain Bacteria"
  ],
  "subjectAreas": [
    "Genomics",
    "Sequence Analysis",
    "Bioinformatics",
    "Microbiology",
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}