{
  "id": 6151,
  "origin_website": "Bio",
  "title": "Streptavidin Bead Pulldown Assay to Determine Protein Homooligomerization",
  "procedures": [
    "Cell cultureThe PS1/PS2-deleted HTL cells are routinely grown in DMEM supplemented with 10% (v/v) fetal bovine serum at 37 °C under a humidified 5% CO2 atmosphere.Treat the cells with 0.25% trypsin-EDTA at 37 °C for about 2 min. Dilute the cells to 0.4 x 106/ml with DMEM medium (supplemented with 10% [v/v] fetal bovine serum) and split at 0.8 x 106/well into a 6-well plate one day prior to transfection.TransfectionPrepare a master mix for one sample:To a sterile 1.5 ml Eppendorf tube, add:50 µl Opti-MEM medium2.6 µl Lipofectamine 2000 Transfection Reagent. Notes:  Avoid touching the side of the tube while adding reagent.Make a Master Mix for larger sample size: for example, for 10 samples, multiply by 11 to prepare some extra mix (50 x 11 = 550 µl medium; 2.6 x 11 = 28.6 µl Lipofectamine 2000 Transfection Reagent).Add 1.3 µg total DNA to 50 µl Opti-MEM medium per well in a 96-well plate.Note: 1.3 µg total DNA contains 300 ng BirA biotin ligase encoding DNA, 500 ng Avi-C99 encoding DNA, and 500 ng C99-TEV site-rTA-Flag encoding DNA.Add 50 µl master mix to DNA mix per well of the 96-well plate and mix gently by pipetting.Incubate at room temperature for about 30 min.Transfer 100 µl mix into each well of cells cultured in a 6-well plate.Note: Carefully add the 100 µl mix drop by drop with a pipette.Add biotin solution (see Recipes) to a final concentration of 40 µM just after the transfection using a standard 0.1-2.5 µl pipettor.Note: We usually culture 2 ml cells in a 6-well plate, so just add 2 µl biotin solution. Make sure you add the small amount of biotin. Culture the cells in DMEM supplemented with 10% (v/v) fetal bovine serum at 37 °C under a humidified 5% CO2 atmosphere.",
    "Prewash the MagBeadsCompletely resuspend the beads by shaking.Add 20 µl 25% slurry of MagBeads (Beads with their storage buffer) into each sample in a new 1.5 ml tube.Note: Prepare a total volume of MagBeads for all samples in one tube.Place the tube on a magnetic separation rack to collect the beads. Remove and discard the supernatant by pipetting.Note: Use gel loading pipette tips to avoid accidental pipetting of beads.Add 0.1 ml/sample PBS buffer (see Recipes) to the tube and invert the tube several times to mix. Use the magnetic separation rack to collect the beads and discard the supernatant by pipetting with loading tips from the very bottom. Repeat this step twiceCell lysis and protein purificationOne day after transfection, remove the medium from the cultured cells by vacuum pump using loading pipette tips and gently rinse with a sufficient volume of PBS (i.e., 500 µl/well). Dispense 150 µl CelLyticTM M lysis buffer supplemented with 1x protease inhibitor cocktail in each well.Lyse the cells on ice for about 30 min.Transfer the lysate to 1.5 ml Eppendorf tubes with a pipette and spin at full speed (about 20,000 x g) in a microcentrifuge for 10 min at 4 °C to remove insoluble material.Take 10 µl supernatant and mix with 10 µl SDS loading buffer supplemented with 100 mM β-mercaptoethanol as input.The crude supernatant protein extracts are incubated with prewashed Streptavidin MagBeads for about 30 min at 4 °C on a shaker.Use the magnetic separation rack to collect the beads and discard the supernatant. Note: If necessary, keep the supernatant for analysis.Add 0.5 ml CelLyticTM M lysis buffer to the tube and gently vortex to mix. Use the magnetic separation rack to collect the beads and discard the supernatant. Repeat this step twice.",
    "Elute the sample with 20 µl SDS loading buffer containing 100 mM β-mercaptoethanol at 54 °C for 10 min.SDS-PAGE and Western blot analysisPlace a premade 4-20% SDS PAGE gel in Invitrogen SDS-PAGE cassette.Load 10 µl prestained protein standard and 25 µl samples with beads into the wells of the gel and run the gel in electrophoresis buffer (see Recipes) at 200 V for 1 h.Soak the PVDF membrane with methanol and transfer to transfer buffer.Soak the sponge and filter paper in transfer buffer.Prepare the blot sandwich in the following order: anode (-, black), sponge, filter paper, SDS gel, PVDF membrane, filter paper, sponge, anode (+, white).Perform protein transfer in a tank blot device at constant 90 V and 4 °C for about 90 min.Disassemble the blot-sandwich and immediately transfer membrane to 1x TBST (see Recipes) for a brief rinse. Note: Check the protein standard to see the transfer efficiency.Incubate the membrane with 20 ml blocking solution (see Recipes) at room temperature for 1 h on a shaker.Wash the membrane 3 x with 10 ml TBST at room temperature, 10 min each time.Incubate with 10 ml/membrane anti-Flag antibody solution (see Recipes) for 1 h at room temperature or overnight at 4 °C.Wash the membrane 3 x with 10 ml TBST at room temperature, 10 min each time.Incubate the membrane with enough freshly prepared substrate solution (2 ml for each membrane, see Recipes) at room temperature.Transfer the membrane between 2 layers of transparent sheets of plastic wrap and apply to Bio-Rad Imager system using the blots-chemi application from 1 sec to 120 sec to get 20 pictures.Strip the primary antibody with stripping buffer at room temperature for about 15 min.Repeat the Western blot starting from the blocking step, using anti-beta Actin primary antibody solution (see Recipes) for 1 h.",
    "After 3 x washing with 10 ml TBST (at room temperature, 10 min each time), incubate with 10 ml/membrane anti-mouse IgG secondary antibody solution (see Recipes) for about 45 min.After 3 x washing with 10 ml TBST (at room temperature, 10 min each time), record images using Bio-Rad Imager system.Note: Image Lab 5.2.1 software setting for Western blot: choose Blots Chemi application; signal accumulation with the first image starts 1 sec, the last image ends 120 sec, total number of images is 20; select Position Gel and use ‘+’ or ‘-’ button to adjust the image area; run protocol to get images. Choose the best one for data analysis"
  ],
  "subjectAreas": [
    "Molecular Biology",
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}