{
  "id": 9081,
  "origin_website": "Jove",
  "title": "Correlative Light and Electron Microscopy to Study Microglial Interactions with β-Amyloid Plaques",
  "procedures": [
    "Note: All experiments were approved and performed under the guidelines of the Institutional animal ethics committee, in conformity with the Canadian Council on Animal Care guidelines as administered by the Animal Care Committee of Université Laval. APP-PS1 male mice between 4 and 21 months of age were used. These animals were housed under a 12 hr light-dark cycle at 22 - 25 °C with free access to food and water.\n1. Methoxy-X04 Solution Preparation\nPrepare a 5 mg/ml solution of methoxy-X049 by dissolving methoxy-X04 into a solution containing 10% dimethyl sulfoxide (DMSO), 45% propylene glycol, and 45% sodium phosphate buffered saline (0.9% NaCl in 100 mM phosphate buffer, pH 7.4).\n\t\nUsing a microbalance, weigh 5 mg of the methoxy-X04 compound. Under a fume hood, dissolve the methoxy-X04 in DMSO and stir until a clear greenish solution is obtained. Successively add propylene glycol and phosphate buffer saline while stirring with each addition.\nStir the solution at 4 °C on a rotator O/N. Obtain a yellowish green emulsion. The solution may be stored at 4 °C for up to two months without degradation.\n2. Methoxy-X04 Solution Injection\n24 hr prior to perfusion, weigh the mice and give each mouse an intraperitoneal injection of methoxy-X04 at a dose of 10 mg/kg of body weight using a 27 ½ G needle.\n3. Transcardial Perfusion of the Injected Mice\nOn the day before the perfusion, prepare appropriate volumes of phosphate buffered saline (PBS), 3.5% acrolein, and 4% paraformaldehyde (PFA) solutions13 and store them at 4 °C O/N.\n\tNote: These solutions will be used for both perfusion and pre-embedding immunohistochemistry. Take special care when working with acrolein, as it is corrosive and toxic to both researchers and the environment. In addition, since acrolein is corrosive to plastic, always use suitable glassware to prepare acrolein solutions.",
    "On the day of perfusion, filter the PFA and acrolein by using coarse filter paper of 25 µm particle retention.\nDuring the perfusion, use a peristaltic pump to deliver 15 ml of PBS, 75 ml of acrolein, and 150 ml of PFA successively into the mouse circulation, at a flow rate of 25 ml/min.\n\tUse caution. Perform perfusion strictly inside a fume hood to avoid harmful fumes of PFA and acrolein.\n\t\nTo set up the pump, insert one end into the PBS solution, fill the tubing (holding approximately 15 ml) with PBS, and fix a 25 G winged blood collection needle to the other end. At all times, ensure that the tubing is free from any trapped air bubbles.\nPlace the tube directly in the acrolein bottle after setting the perfusion pump with the tubing filled with PBS.\nAnaesthetize one mouse at a time with a 90 mg/kg of body weight dose of sodium pentobarbital injected intraperitoneally using a 27 ½ G needle. Assess responses to tail/toe pinches. Proceed only if the mouse is unresponsive to such aversive, painful stimuli.\nSecure the mouse in the supine position (lying on the back with face upward) by taping the forepaws and hindpaws to the work surface and carefully expose the heart without causing damage to other organs. Be sure to work quickly after puncturing the diaphragm.\n\t\nPerform an incision through the skin with surgical scissors along the thoracic midline beginning caudal to the ribcage and proceed rostral to the clavicle.\nMake two additional lateral incisions along the base of the ventral ribcage. Gently move and pin the two flaps of skin, making sure to expose the entire thoracic cavity.",
    "Hold the xiphoid process with blunt forceps to expose the thoracic cavity and steady the pointed scissors. Cut through the diaphragm and ribcage, being careful to avoid puncturing the lungs, and continue the incision rostral to the clavicles. Be sure to work quickly after puncturing the diaphragm.\nGently tear the pericardial sac with blunt forceps. Hold the heart steady with blunt forceps, cut the right atrium, and start the infusion of PBS. Immediately insert the blood collection needle into the left ventricle.\nPerfuse the mouse with PBS (in the tubing) followed by acrolein for 3 min (corresponding to 75 ml) then switch to PFA for 6 min (corresponding to 150 ml). Be sure to pause the pump flow before switching solution to prevent bubbles from entering the tube.\nDecapitate the mouse and extract the fixed brain and place it directly into a glass vial containing 4% PFA for at least 2 hr at 4 °C.\n\t\nTo extract the brain, use scissors and tweezers to cut through the skin to expose the skull. Carefully break the skull open in between the eyes, and chip off small pieces of it to expose the underlying brain.\nCarefully remove the exposed brain and post fix it with 4% PFA for an additional 2 hr before proceeding for vibratome sectioning.\n4. Brain Sectioning Using a Vibratome\nWash the fixed brain 3 times with chilled PBS. Using a sharp razor blade, remove the olfactory bulb (unless this region is under investigation) and cut the brain transversally into 2 - 3 pieces of approximately equal height, all of which can be sectioned simultaneously in order to accelerate the procedure.",
    "Glue the pieces of brain tissue vertically onto the specimen plate secured into the tray. Make sure that the smooth cut surface sticks firmly to the specimen plate and does not get dislodged during the sectioning procedure. Add enough PBS solution into the tray until the entire brain surface is completely submerged. It is important to keep the brain pieces and subsequent sections fully immersed in PBS throughout this step.\nPlace the tray in the vibratome, adjust the sectioning speed to 0.5 mm/sec, the sectioning frequency to 90 Hz, and the feed thickness to 50 µm in order to yield 50 µm thick sections. Then transfer the sections into 20 ml glass vials containing cryoprotectant solution (40% PBS, 30% ethylene glycol, and 30% glycerol) using a fine paintbrush. Store the vials at -20 °C until further use. Alternatively, keep the sections in PBS for immediate screening as described in the following steps.\n5. Section Screening for the Presence of Methoxy-X04-stained Plaques\nWith the aid of a stereotaxic mouse brain atlas14, select brain sections containing the region of interest, for instance, the hippocampus CA1 as used in the present example. Place each section into a well within a 24-well culture plate containing enough cryoprotectant solution so as to prevent the sections from drying out.\nExamine each section successively, to avoid drying out the sections, using the following procedure:\n\t\nAdd a droplet of PBS to a microscope slide with a disposable pipette, and place the section on the droplet.\nExamine the section under a fluorescent microscope to identify regions containing methoxy-X04 labeled Aβ plaques.\n\t\tNote: methoxy-X04 can be easily visualized using a fluorescence ultraviolet (UV) filter (excitation 340 - 380 nm).",
    "Capture images of regions of interest (ROI) in bright field as well as in fluorescence mode without moving the microscope stage, since each image must show the same region in both fields in order to correlate the presence of the plaques directly to the structural region of the tissue section.\nSave and name the images taken according to the animal number. Also record the well number in the plate and the field of the pictures taken. For example, Ex: 9978A1B; Animal number: 9978; Well number: A1; Field: Bright. Place the section back in its designated well once the imaging is completed.\n\tNote: In the end, for each section examined, two pictures are obtained, one in bright field and another in UV field.\nOpen the two images of the same ROI (one in bright field and the other in UV field) in Image J, and using the MosaicJ plugin, align the edges of the two images and save the aligned and combined image according to the well number it came from.\nSave the picture in a separate folder with the number of the particular animal. Combine the images to identify and localize the plaques in the tissue section, and have a full view of the whole section in the two different fields (bright and UV).\nAfter the screening process is completed, store the examined sections at -20 °C in a 24-well culture plate containing cryoprotectant until immunostaining or further processing is carried out.\n6. Pre-embedding Immunostaining for IBA1\nNote: Perform the immunostaining for IBA1 on selected freely-floating sections by placing the plate on a slowly moving rocker at RT.\nThoroughly wash the sections 3 times with approximately 1 ml PBS, each wash lasting for 10 min.",
    "Quench endogenous peroxidases with 0.3% hydrogen peroxide in PBS solution for 10 min. This step prevents non-specific peroxidase activity, which is important to avoid background staining.\nWash the tissue in PBS 3 times for 10 min each.\nIncubate the sections in 0.1% sodium borohydride in PBS solution for 30 min. This step is important to reduce any remaining aldehydes from the fixation step, and is especially important if acrolein is used in tissue fixation.\nWash the tissue in PBS 3 times for 10 min each time and make sure to remove all the bubbles.\nBlock the sections for 1 hr. Different antibodies may require different blocking times and solutions. For IBA1, prepare blocking buffer containing 10% fetal bovine serum, 3% bovine serum albumin, and 0.01% Triton X-100 in 50 mM Tris-buffered saline (TBS; pH 7.4).\n\tNote: The blocking step is to prevent nonspecific binding of the primary antibody. The low concentration of Triton X-100 allows slight permeabilization of membranes for better staining, and is low enough to preserve most ultrastructural features of tissue under EM.\nRemove the blocking buffer from the tissue, and incubate in primary antibody solution (rabbit anti-IBA1, diluted [1:1,000] in blocking buffer) at 4 °C O/N.\nWash in TBS 3 times for 10 min each time.\nIncubate in secondary antibody (goat anti-rabbit conjugated to biotin) [1:200] in 0.05 M TBS for 90 min.\nWash in TBS 5 times for 5 min each time.\nIncubate in Avidin-Biotin complex solution (Avidin [1:100], Biotin [1:100]) in TBS solution for 1 hr.\nWash in TBS 5 times for 5 min each time.\nReveal the IBA1 staining with 0.05% diaminobenzidine (DAB) and 0.015% hydrogen peroxide in TBS for 8 min.",
    "Note: The timing of DAB development may vary from protocol to protocol and should be determined by quickly examining the stained sections under a light microscope.\n\tNote: For IBA1, one should be able to clearly visualize the cell bodies and processes of the IBA1-stained microglia at 20X (see Figure 2 for representative example). Be cautious using DAB, as it is a known carcinogen.\nAvoid over-developing by carefully monitoring the sections (as described above) during this step. Stop the reaction by washing the sections in chilled PB 5 times for 5 min each time.\n7. Processing for Electron Microscopy\nPrepare 1% osmium tetroxide solution in PBS in a glass vial. Osmium tetroxide is photosensitive; cover the glass vial with aluminum foil to protect the solution from light.\n\tBe cautious using osmium tetroxide, as it is a very hazardous chemical. Perform this and the following steps inside a fume hood.\nRemove the PBS from the sections and spread them flat using a fine paintbrush. Perform this step one well at a time to keep the sections from drying out. Be sure to flatten the sections immediately before adding osmium tetroxide, as any folds in the sections will become permanent and attempting to flatten tissue post osmium fixation will only break the sections.\nImmerse the sections in osmium tetroxide for 30 min at RT, adding one drop of osmium tetroxide at a time with a transfer pipette, to prevent the sections from folding. Cover the well with aluminum foil to protect the sections from light.\n\tNote: This step fixes the lipids within the sections. The tissue will appear very dark after osmium post-fixation.",
    "While sections are in osmium tetroxide, prepare plastic resin in a disposable beaker by mixing 20 g component A, 20 g component B, 0.6 g component C, and 0.4 g component D. Combine the components together in the above order and mix them well using a 10 ml serological pipette until a uniform color is obtained.\nTransfer the prepared mixture to aluminum weighing dishes. They will receive the tissue sections once they have been dehydrated.\nDehydrate the sections in increasing concentrations of ethanol for 2 min in the following order: 35%, 35%, 50%, 70%, 80%, 90%, 100%, 100%, 100%.\nTo remove residual ethanol, immerse the sections in propylene oxide 3 times for 2 min each time. Remove the dehydrated-sections from the 24-well culture plate into 20 ml glass vials. Always use glass vials when working with propylene oxide as it dissolves plastic, and maintain caution, as it is hazardous.\nUse a bent glass pipette tip or a fine paintbrush to transfer the sections from propylene oxide solution into the resin and leave O/N for infiltration at RT. Be careful not to dilute the resin with propylene oxide.\nEmbed the section with the resin on poly-chloro-tri-fluoro-ethylene (PCTFE) filmsheets:\n\t\nPlace the aluminum weighing dishes containing the specimens into a 50 - 60 °C oven for 10 - 15 min prior to embedding the sections on PCTFE filmsheets.\nWhen embedding sections, work with one aluminum weighing dish at a time. Using a fine paintbrush, paint a thin layer of resin onto one PCTFE film sheet.\nMove one section of tissue at a time from the aluminum weighing dish to the PCTFE film sheet. Remove excess resin from around the tissue, being careful not to disturb it.",
    "After moving all the sections from one weighing dish to the PCTFE film sheet, place a second PCTFE sheet over the first, creating a sandwich of tissue and resin in between 2 sheets.\nPolymerize the resin in an incubator for 3 days at 55 - 60 °C.\nThe material is now ready for ultrathin sectioning and ultrastructural examination, specialized techniques which are often performed by EM core facilities. Store the samples between PCTFE film sheets safely at RT without ultrastructural degradation.\n\tNote: The subsequent steps for ultrathin sectioning and transmission electron microscopy examination are explained in a separate protocol13.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}