{
  "id": 11991,
  "origin_website": "Jove",
  "title": "Evaluation of Colorectal Cancer Risk and Prevalence by Stool DNA Integrity Detection",
  "procedures": [
    "Patients were recruited at the Istituto Scientifico Romagnolo per lo Studio e la Cura dei Tumori (IRST) of Meldola (FC, Italy) between 2013 and 2015. Enrolled patients were into protocol IRSTB002, approved by the Ethics Committee of IRST - IRCCS AVR (25/10/2012, ver. 1). All methods were performed in accordance with relevant guidelines and regulations. Written informed consent was obtained from all patients.\n1. DNA extraction from stool\nUse a kit to prepare stool samples (see Table of Materials). Select and treat the fecal material by performing the extraction according to the manufacturer’s instructions. Amplify the purified DNA directly or store at -20 °C for subsequent analysis.\n2. Preparation of positive control, standards, spike-in DNA, and clinical samples\nPreparation of standards and samples\n\t\nTo prepare the positive control, standards, spike-in DNA, and all clinical samples, centrifuge an aliquot of positive control, standards, and spike-in DNA, then resuspend each reagent by adding the correct amount of provided water (see below). Then, carefully vortex the positive control, standard, and spike-in DNA, then centrifuge for 10 s. To achieve a complete resuspension of the dry reagents, store the liquid reagents at room temperature (RT) for 30 min before use.\n\t\t\nThe positive control is human DNA in a dry format. Resuspend each aliquot with 750 µL of water.\nThe spike-in DNA is salmon (Oncorhynchus keta) DNA, which is used as an exogenous internal control to verify the possible presence of inhibitors in DNA samples extracted from stool. Resuspend each aliquot with 100 µL of water.\nTo prepare the standard curve, produce four 1:5 dilutions starting from the stock solution. The standard points must be 10 ng/reaction, 2 ng/reaction, 0.4 ng/reaction, and 0.08 ng/reaction.\nPreparation of the 1x spike-in DNA\n\t\nPrepare the spike-in DNA control directly before use.",
    "Prepare the 1x spike-in DNA control by mixing 5 µL of FL-DNa spike with 20 µL of sterile water. The number of 1x spike-in DNA control samples will be prepared according to the number of the samples to be analyzed, plus the positive control.\nPreparation of samples\n\t\nMix 75 µL of the samples (clinical samples or positive control) with 25 µL of 1x spike-in DNA, yielding a total volume of 100 µL.\n3. Amplification and determination of the FL-DNA value using qPCR Easy PGX\nNOTE: Complete amplification mixtures containing specific primers and probes targeting the human DNA and the internal control are provided in a lyophilised format in 8 well strips for FL-DNA Mix A and FL-DNA Mix B. Standards, positive and negative controls, and samples must be amplified with both lyophilized mixes. Clinical samples only must only be amplified in duplicate with both lyophilized mixes.\nSee the Table of Materials for qPCR instrument and operating software.\n\t\nOpen the operating software and set up the plate and thermal profile:\n\t\t\nSet up the plate as shown in Table 1.\n\t\t\t\nSet the well type for all eight positions in column 1 as Standard.\nSet the well type for the A2 and B2 wells as NTC.\nSet the well type for C2 and D2 (the positive controls) as Unknown.\nSet the well type for all other positions as Unknown.\nSelect all 96 positions, and add the Dyes FAM and HEX. Click Sync Plate.\nSet the thermal profile according to Table 2.\nCentrifuge the needed number of strips for 10 s to bring the contents to the bottom of the tube.",
    "Gently remove the seals from the strips, while paying attention to retain the contents, and add to the respective strips: negative control: 20 µL of water; sample: 20 µL of DNA; standard curve: 20 µL of standard 1, 2, 3, or 4; positive control: 20 µL of positive control.\nClose carefully all the strips using the 8 strip flat optical caps and vortex for few seconds.\nCentrifuge the strips for 10 s and load them into the instrument. Then, start the run.\n4. Data analysis\nNOTE: Data analysis can be performed automatically or manually depending on the software (see Table of Materials).\nAt the end of the run, select columns A, C, E, G for \"FAM: FL-DNA-A\" and \"HEX: IC\", and columns B, D, F, H for \"FAM: FL-DNA-B\" and \"HEX: IC\".\nSet the following for the Standard Quantities Starting Amount: 10 ng/reaction for A1 and B1 wells, 2 ng/reaction for C1 and D1, 0.4 ng/reaction for E1 and F1, and 0.08 ng/reaction for G1 and H1.\nSet Threshold Fluorescence values to 150 for both FAM (FL-DNA A and FL-DNA B) and HEX (IC) channels.\nIn the box Result Table, click Column Options | Select All | Ok to obtain the results in both channels with their respective Cq (∆R) and ∆R last values.\n\tNOTE: These values are supplied by the Real Time PCR instrument software. ΔR last corresponds to the fluorescence value normalized to the last amplification cycle.\nIn the box Result Table, right-click on the table to open the context menu and click Send to Excel to export the raw data.\nCheck the values of the standards to verify the suitability of the standard curve.",
    "For each FL-DNA mix, check the R2 [\"R² (∆R)\" column] and efficiency [\"Efficiency (%)\" column] values. If they are in an acceptable range, it is possible to proceed with analysis accordingly to manufacturer’s instructions (Table 3).\nIf the results of the FAM channel are not in the expected range, omit one point of the standard curve and reanalyze the run.\nDetermine the values of the negative and positive controls with the following formula, considering the \"No Cq\" values as zero:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq1.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq2.jpg\nCompare the obtained values with those reported in Table 4.\nIf the reaction controls are in the range of expected values, proceed with analysis of the samples.\n\tNOTE: Verify that the Cq values obtained are generated from a real amplification reaction (sigmoidal fluorescence curve) and not from an artifact (linear fluorescence curve).\nTo analyze suitability of the sample for each FL-DNA mix, compare the Cq values of the HEX channel. If the value is ≥16, proceed with analysis of the samples. If the value is <16 or there is no Cq, it is likely due to a dispensing error of the FL-DNA Spike. Therefore, it is not possible to analyze the samples.\nCalculate the average of the Cq values in the \"HEX\" channel of the positive control using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq3.jpg\nCalculate the average of the Cq values in the \"HEX\" channel of the sample replicates using the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq4.jpg\nCalculate the ∆CqHEX values according to the following formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq5.jpg\nCompare the ∆CqHEX values of the samples with those reported in Table 5. \nFor each mix (Mix A and Mix B), compare the Cq values of the FAM channel with those reported in Table 6.\nTo determine the FL-DNA value of each suitable sample, use the following formula, considering the \"No Cq\" values as zero:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq6.jpg",
    "imgsrc://cloudfront.jove.com/files/ftp_upload/59426/59426eq2.jpg\n\tNOTE: Colorectal cancer risk and prevalence is a function of iFOBT and FL-DNA evaluations according to the Fagan nomogram results obtained by Rengucci et al.12 (Table 7).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Cancer Research"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}