{
  "id": 18435,
  "origin_website": "Jove",
  "title": "Studying the Role of Alveolar Macrophages in Breast Cancer Metastasis",
  "procedures": [
    "All animal studies have been approved by Institutional Animal Care and Use Committee of Texas Tech University Health Sciences Center and followed the guidelines outlined in the \"Guide for the Care and Use of Laboratory Animals\" published by the National Institutes of Health. Use eight to twelve week old female BALB/c mice that are commercially available. Inject 1 x 105 4T1 or 1 x 105 4T1 cells expressing GFP, which can be purchased from various vendors, into the mammary fat pad.\n1. Culture of 4T1 and 4T1-GFP Cells & Preparation of Tumor Cell Suspension for Injections14\n4T1 and 4T1-GFP Cell Culture\n\tNOTE: Perform all steps using sterile solutions in a laminar airflow (LAF) bio-safety cabinet unless specified otherwise.\n\t\nMaintain 4T1 and 4T1-GFP cells in RPMI medium supplemented with 10% heat inactivated fetal bovine serum and 100 U/ml penicillin G and 100 μg/ml streptomycin sulfate.\n\t\tNOTE: Determine a passage number by counting every trypsinization and plating of cells. It is important to use cells with the same passage number to all mouse experiments, as the number of passages affects cell tumorigenicity and metastatic potential.\nPrior to cell injections remove the T75 cm2 flask, containing tumor cells at 80 % confluency, from an incubator and aspirate medium. Add 10 ml of PBS and rotate the flask gently to wash out remaining medium, and then aspirate PBS.\nAdd 2 ml of 0.25 % trypsin with EDTA to the flask and tilt it to distribute the solution uniformly on the surface and incubate in a humidified incubator for 3 min at 37 ˚C with 5 % CO2.\nTap the flask to facilitate detachment of cells and add 8 ml of fresh medium. Pipette up and down several times to disrupt clumps and get a single cell suspension.",
    "Centrifuge cells for 5 min. at 500 x g at RT. Aspirate the supernatant and wash cells in 10 ml of PBS.\nPipette up and down several times to disrupt clumps and get a single cell suspension. Take 100 µl of a cell suspension and count the cells using the cell viability analyzer as per manufacturer's instructions.\nCalculate number of cells required for all injections using formula: 105 cells per mouse x # of mice used in an experiment (always prepare extra cells to be on a safe side).\nCentrifuge cells as in 1.1.5. Remove the supernatant through aspiration and resuspend cells in the amount of fresh PBS required to obtain a final cell concentration of 1 x 106 cells/ml. Keep the cell suspension on ice until ready for injection.\n4T1 or 4T1-GFP Cell Injection-mouse Procedures\nThe day before tumor cell injection, anesthetize mice in an induction chamber with 3 % isoflurane. Once mice are asleep and breathe regularly, place the mouse on a surgical pad with nose inside the nose cone, and connect it to the isoflurane vaporizer. Maintain anesthesia with 2.5 % isoflurane. Pinch the mouse toe to ensure that the mouse is anesthetized.\nApply hair removal cream using a cotton swab to the injection site (right pectoral mammary fat pad) and wait for 2 min. Clean the site using a wet paper towel, place the mouse back into the cage and monitor an animal until it regains sufficient consciousness to maintain the sternal recumbency.\nOn the day of injection, anesthetize the mice as in 1.2.2 and place on the surgical pad.\nVortex the tube containing tumor cells to get uniform cell suspension. Aspirate 100 μl of a cell suspension, containing 1 x 105 tumor cells, into a 0.5 ml insulin syringe (29 G, 12.7 mm-needle length).",
    "Lift the skin using the thumb and finger index near the 2nd and 3rd nipple, insert the needle of the syringe into the mammary fat pad just below the third nipple under the skin between the fingers and inject cells slowly to form a bubble (subcutaneous injection).\nPlace the mouse back into the cage after injection and monitor as in 1.2.2.\nMonitoring Tumor Growth\nCaliper Measurements14\n\t\tNOTE: Injected 4T1 or 4T1-GFP cells form aggressive breast tumor. Usually the palpable tumors appear ~ at day 4 - 5 after cell inoculation. 4T1-GFP cells form tumors that grow slower and give metastases later. Measure the tumor two to three times a week. If clinical status of animals deteriorates, animals lose more than 10 % body weight, tumors exceed 10 % of body weight or become ulcerated, euthanize mice immediately.\n\t\t\nAnesthetize a mouse as in 1.2.1., weigh, place on the surgical pad and wet the area with 70 % ethanol.\nPalpate tumor in the site of injection (4 - 5 days after cell inoculation).\nMeasure the largest diameter (D) and smaller diameter (d1) with a caliper.\nCalculate tumor volume using formula Volume= (D X d1 X d1)/2 mm3. Monitor mouse recovery from anesthesia as in 1.2.2.\nImaging (Only for 4T1 GFP Cells)\nAnesthetize the mouse as in 1.2.1. Place the mouse on a movable stage inside the imaging instrument. Maintain anesthesia through the nose cone.\nTurn on the imaging instrument and the light source as per manufacturer's instructions.\nUnder the tab \"Acquisition\" go to \"Lighting\" and switch to the empty position (no filter) for white light. Ensure that the light engine is ON and select 'Trans' in the light table.",
    "Under the tab \"Microscope\", select \"Clear\" emission filter and 0.5X magnification. In the \"Camera\" tab, make sure that binning for capture is '1 x 1' and preview '4 x 4'.\nClick on preview to locate the tumor in white light, focus to get clear image, and click capture.\nGo to \"Acquisition\" tab and change lighting to filter 1 (filter for GFP as per manufacturer's instruction). In the \"Microscope\" tab, change emission filter to \"530/20 GF\". Preview and capture image in a green channel. Adjust exposure time to get the appropriate brightness.\nApply pseudocolor to the image and save in appropriate folder (Figure 1).\n2. Intranasal Administration of Liposomes10\nNOTE: Perform all steps using sterile solutions in a laminar airflow (LAF) Bio-safety cabinet unless specified otherwise.\nOn day 6 after tumor cell injection anesthetize mice as in 1.2.1.\nVortex the clodronate or control (PBS) liposome suspension obtained from the manufacturer. Take 60 µl liposome suspension using sterile pipette tip.\nSlowly release liposome solution (5 µl each time) near the nostrils allowing the mouse to breathe in the solution, repeat until the entire dose of 60 µl is administered.\nLet the mouse regain consciousness before placing it back in the cage.\nRepeat liposome administration every 3 days until the mice are sacrificed. Do not administer liposomes on a day of sacrifice.\n3. Mouse Sacrifice and Tissue Collection\nNOTE: Use autoclaved and sterile instruments for mouse dissection. Euthanize mice while under anesthesia through the exsanguination and removal of the vital organs.\nOn day 22 (for 4T1 cells) or day 26 (for 4T1-GFP cells) after tumor cell injection anesthetize the mouse as in 1.2.1. and place on the surgical pad with a nose cone connected to vaporizer, maintain anesthesia as in 1.2.1. Pinch one of the toes to ensure that the mouse is unconscious.",
    "Pin the toes using needles to the dissection board. Spray ethanol on the mouse skin.\nLift the skin using forceps and make an incision with the surgical scissors. Slowly expose the peritoneum and continue cutting skin through the thorax until the neck.\nUsing the surgical scissors make an incision in the peritoneum and expose carefully the organs with cotton tips avoiding damage to the blood vessels.\nMove the organs to one side and expose the inferior vena cava. Puncture the vein and collect blood with the 29 G insulin syringe. Place collected blood into the tube and leave on ice for further processing.\nCut the diaphragm to expose the rib cage, lungs and heart. Slowly cut the rib cage on both sides using the bone cutter and lift the top of ribcage. Grab the heart with forceps and cut the connective tissue connecting the heart and lungs to the chest cavity.\nPlace the lungs in small amount of PBS in the 60 mm Petri dish on ice until ready for imaging and further processing to frozen sections for immunofluorescent microscopy or routine histology [including hematoxylin and eosin (H & E) staining].\n4. Lung Metastases Evaluation\nCounting and Scoring Surface Metastases\nPlace the Petri dish with the lungs under the dissection microscope. Focus to get a clear view of the lung surface.\nUsing a dissection microscope observe the lung surface. Count metastases on the anterior and posterior sides of both lungs.\n\t\tNOTE: The normal lung is whitish or pinkish and porous and has a sponge like structure. 4T1 metastases are solid and nonporous, sometimes appear to be similar to a drop of liquid (Figure 2A).\nLung imaging\nPlace the Petri dish with lungs on the movable stage inside the imaging instrument.",
    "Turn on the instrument and the biolite multispectral source. Open the software. Under the tab, \"Acquisition\", go to \"Lighting\", and switch to empty position (no filter) for white light. Light Engine--> ON, Light table--> Epi. Under the tab \"Microscope\" Select 'Clear' emission filter and 1.66X magnification. In the \"Camera\" tab, make sure that binning for capture is '1 x 1' and preview '4 x 4'.\nClick on preview and focus to get a clear picture of lungs in white light and click capture.\nGo to \"Acquisition\" tab and change to the filter 1 (filter for GFP as per manufacturer's instruction). In the \"Microscope\" tab, change emission filter to \"530/20 GF\". Preview and capture image in a green channel. Adjust exposure time to get the appropriate brightness.\nApply pseudocolor to the image and save in appropriate folder.\nFlip the lungs to get image of the other side in a similar way. This procedure generates images of GFP-positive metastases that can be further quantified using appropriate software (Figure 2B)14.\nImmunofluorescent Microscopy\nFix the lungs in 4% paraformaldehyde, at 4 °C for 4 hr in dark.\nWash the tissue twice with 10 ml PBS for 5 min to completely remove the fixative. Transfer to 18 % sucrose in PBS and incubate O/N at 4 °C.\nRemove the tissue from the sucrose and dab off any excess.\nTake a cryomold, cover the bottom layer with OCT medium. Place the tissue on OCT medium. Fill the mold with OCT medium to completely cover the tissue and place on dry ice.\nStore block at -80 °C until sectioning.\nPrepare 5 µm thick sections with a cryostat and place on charged slides.\nStore unused slides in -80 °C until further usage.",
    "Air dry the slides for 7 min. and wash with PBS to remove OCT. Wipe the slide with tissue or paper towel to remove excess of water, mount cover slips with mounting medium containing DAPI and visualize with GFP filter under microscope.\nQuantify GFP metastases (Figure 3A) with the use of appropriate software14.\nHistology and Digital Pathology\nClick the manual load button under the start tab and wait for the slide holding rack to eject from the scanner.\nTake the H&E stained tissue section, clean it with tissue to remove any dirt, and place it securely in the slide holding rack.\nEnter the slide description in the popped-up window.\nSelect the Scan Area tab on the SS imaging console window and adjust the green square to define the region of interest (ROI) to be scanned.\nDrag the blue calibration diamond to a clear portion of the slide, where tissue is absent, however, within the ROI.\nNext, select the Focus Points tab and click the auto select button to obtain several focus points (yellow plus signs) on the tissue in the ROI.\nIf necessary, place additional focus points manually by double-clicking within the ROI.\nProceed to the calibrate tab and select the calibrate button to begin slide calibration at the blue calibration diamond point. After the calibration is completed the image from the calibration point will be displayed.\nInspect this image to ensure that it is clear and free of dirt or artifacts.\nProceed to the Scan tab and select Start Scan to begin scanning of the ROI. Scanned histological section is converted to a digital slide (Figure 3B and 4A)\nQuantify metastatic burden as previously described (Figure 4B)14.\n5. Flow Cytometry (FACS) Analysis of Alveolar Macrophages in the Lungs\nPreparation of Single Cell Suspension",
    "After imaging and counting of metastases, wash the lungs with sterile PBS and place to the Petri dish. Make 1 - 2 mm pieces of the lungs using surgical scissors and forceps.\nTransfer the lung pieces to the 15 ml conical tube with 3 ml of the digestion buffer containing 1 mg/ml collagenase P, 0.04mg/ml DNase I, and 10 µg/ml trypsin inhibitor dissolved RPMI medium (sterile).\nIncubate the conical tube on a rotating shaker in the incubator at 37 °C for 40 min.\nRemove the tube conical from the incubator and pipette the solution up and down to dissociate the tissue.\nPass the solution through the 40 µm strainer to avoid clumps and get a single cell suspension. If needed, to disintegrate better the digested tissue press tissue against the cell strainer with the help of a syringe plunger.\nWhen a single cell suspension has been achieved, collect the cells by centrifugation and lyse red blood cells with 2 ml of ACK buffer for 10 min at RT. Then, wash a pellet two times in 8 ml of RPMI.\nResuspend cells in 3 ml of the complete RPMI medium and proceed to cell counting using the cell viability analyzer as per manufacturer's instructions.\nStaining of Lung Cells for Surface Markers\n\tNOTE: Perform all incubations at 4 °C. Centrifuge plate at 500 x g and 4 °C.\n\t\nPipette 1 x 106 cells in 100 µl of FACS buffer (1% FBS in PBS) to individual wells of a V-bottom 96-well plate. Using a V-bottom 96 well plate facilitates handing of multiple samples.",
    "Pre-incubate the cell suspension with 1 µg Mouse Fc Block purified anti-mouse CD16/CD32 in 100 µl of FACS buffer for 15 min. Centrifuge the V-bottom 96 well plate to pellet the cells and remove the supernatant by flipping the plate and letting the solution drain.\nFor surface staining, in advance, dilute the antibodies to murine antigens in one tube (master mix): BV605 CD45 (30-F11), PE CD11b (M1/70), PE/Cy7 F4/80 (BM8), APC/Cy7 CD11c (N418), PerCPCy5.5 IA/IE (MHCII) (M5/114.152), PE CD80 (16-10A1), AF 647 CD86 (GL-1) to a final concentration of 2.5 µg/ml in FACS buffer containing 10 µg/ml of Fc block CD16/CD32 antibody.\n\t\tNOTE: This set of antibodies is useful for the identification and the evaluation of a functional status of alveolar macrophages and dendritic cells.\nAdd 100 µl of diluted antibodies (master mix) to the wells of the V-bottom 96 well plate and incubate at 4 ˚C for 30 min.\nCentrifuge the plate to pellet cells and remove supernatant as in 5.2.2. Wash cells with 200 µl of FACS buffer, centrifuge at 500 g for 5 min. Remove the supernatant as in 5.2.2. and resuspend cells in 200 µl of PBS.\nCentrifuge the plate to pellet cells and add viability dye diluted in PBS (1:1,000). Incubate for 20 min at 4 ˚C.\nCentrifuge the plate to pellet cells and remove the supernatant as in 5.2.2. Wash with 200 µl of PBS and centrifuge the plate again.\nResuspend cells in 100 µl of 1% paraformaldehyde and store at 4 °C until the acquisition by FACS instrument. Prior to acquisition transfer cell suspensions to the polypropylene FACS tubes.\n6. Analysis of FACS Data: Gating Strategies and the Identification of Cell Subpopulations",
    "Perform FACS analysis as previously reported10. Gate acquired cells/events based on forward-(FSC) and side-scatter (SSC); and then gate live and CD45+ cells. For alveolar macrophage identification, gate CD11b-negative and then CD11c+F4/80+ cells. (Figure 5A).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}