{
  "id": 2401,
  "origin_website": "Cell",
  "title": "Analysis of germline-driven ancestry-associated gene expression in cancers",
  "procedures": [
    "Step-by-step method details\nStep-by-step method details\nQuality control analysis of germline data\nTiming: Approximately 1–2 weeks. Dependent on server capabilities\nThis section describes quality control (QC) assessment of the TCGA Affymetrix Genome-Wide SNP 6.0 germline genotyping data (Figure 1[href=https://www.wicell.org#fig1]) using PLINK to generate a high-quality set of SNPs for all whitelisted TCGA samples (i.e., a list of platform-specific samples verified to be appropriate for use). See key resources table[href=https://www.wicell.org#key-resources-table].\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1887-Fig1.jpg\nFigure 1. Schematic overview of genotype quality control workflow\nStepwise description of pre-processing steps taken to generate clean quality-controlled germline genotyping data for stranding and imputation. The protocol requires specific calculations to be performed (yellow), and steps to filter SNPs (green) or individuals (blue).\n(A) Histogram of X chromosome homozygosity estimate (XHE) inbreeding F coefficient. F coeff thresholds at 0.2 and 0.8 are shown.\n(B) Heterozygosity rate vs. log10 of the proportion of missing genotypes per ancestry group. Thresholds for the proportion of missing genotypes at log10(0.05) and mean heterozygosity +/- 3∗standard deviations per ancestry group are shown.\n(C) Empirical cumulative distribution function of HWE log10 p-value for the European ancestry group. HWE threshold at p=10-6 is shown.\n(D) Histogram of log10 MAF. MAF threshold at log10(0.005) is shown.\nReview other resources for suitable QC steps based on the study design (Anderson, 2011[href=https://www.wicell.org#bib3]; Anderson et al., 2010[href=https://www.wicell.org#bib4]; Aron and Choudhury, 2015[href=https://www.wicell.org#bib6]).\nNote: Original QC steps were performed in PLINK version 1.9. QC analysis requires a high-performance compute cluster.\nNote: To skip this step, download the controlled access “QC Unimputed Genotyping Data” generated from (Sayaman et al., 2021[href=https://www.wicell.org#bib20]), as described in step 11 of the “prepare germline genetic variation dataset[href=https://www.wicell.org#sec1.6]” section of this protocol OR proceed with the QC protocol steps provided below.\nNote: Scripts used in this section are available at: https://github.com/rwsayaman/TCGA_PanCancer_Genotyping_Imputation[href=https://github.com/rwsayaman/TCGA_PanCancer_Genotyping_Imputation].",
    "Map birdseed genotyping file names to corresponding TCGA aliquot barcode using the download annotation JSON file from GDC TCGA Legacy archive.\nVerify sample list for inclusion in the analysis and filter out samples which are not represented in the whitelist, and which do not pass the analyte code filter.\nCross-reference sample set with whitelisted germline samples from GDC PanCanAtlas Publications page (https://gdc.cancer.gov/about-data/publications/pancanatlas[href=https://gdc.cancer.gov/about-data/publications/pancanatlas]). Non-whitelisted samples have since been flagged for withdrawal in the various TCGA projects.\nDownload the Merged Sample Quality Annotations file (merged_sample_quality_annotations.tsv[href=http://api.gdc.cancer.gov/data/1a7d7be8-675d-4e60-a105-19d4121bdebf]).\nTo select whitelisted samples, filter for samples with “platform” column set to “Genome_Wide_SNP_6” and the “Do not use”’ column set to “FALSE”.\nBased on established TCGA barcode identifiers, ensure all whitelisted samples have Analyte code “D” (DNA). Exclude samples with other Analyte codes.\nNote: The final TCGA whitelisted samples used in this analysis are available from (Sayaman et al., 2021[href=https://www.wicell.org#bib20]), Table S1. The GDC Genome Wide SNP 6.0 platform whitelisted files included samples with TCGA analyte barcode identifiers annotated “D” (DNA) or “G” (Whole Genome Amplification). Samples with analyte barcode identifier “G” were excluded from our analysis.\nLoad and concatenate individual whitelisted genotyping birdseed files using custom scripts, selecting SNPs with call confidence values ≤ 0.1. Annotate variants and generate PLINK files.\nTo take advantage of parallel processing, concatenate and filter birdseed text files in batches.\nRead each birdseed text file as a tab delimited table with 906,600 SNPs as rows and three columns containing the following information: (See page 1, http://tools.thermofisher.com/content/sfs/brochures/genome_wide_snp6_sample_dataset_readme.pdf[href=http://tools.thermofisher.com/content/sfs/brochures/genome_wide_snp6_sample_dataset_readme.pdf]).\nComposite Element REF: the probeset ID.\nCall: the genotype call with values of {-1, 0, 1, 2} corresponding to {NoCall, AA, AB, BB}.\nConfidence: the call confidence with values ranging from [0,1] with lower values corresponding to greater confidence.",
    "Pre-filter to exclude SNPs with lower call confidence and set the “Call” value to NA for SNPs with “Confidence” > 0.1 prior to concatenation.\nIteratively concatenate each call column, generating a table with SNPs as rows, samples as columns, and call values as elements of the matrix.\nCheck that probeset IDs match prior to concatenating a genotyping call; if not, exclude and log the mismatched birdseed file.\nUsing a custom script, convert batch concatenated birdseed files into PLINK standard input transposed text format files.\nUsing the Affymetrix SNP Array 6.0 (release 35) annotation file, convert concatenated data into PLINK transposed text genotype tables (.tped) with allele calls (See .tped file format specification: https://www.cog-genomics.org/plink2/formats#tped[href=https://www.cog-genomics.org/plink2/formats#tped]).\nCreate corresponding PLINK sample information files (.tfam) (See .tfam file format specification: https://www.cog-genomics.org/plink2/formats#tfam[href=https://www.cog-genomics.org/plink2/formats#tfam]).\nImport whitelisted germline data into PLINK for QC. Convert PLINK standard input transposed text files (--tfile) to standard input binary files (--bfile). https://www.cog-genomics.org/plink2/input[href=https://www.cog-genomics.org/plink2/input].\nImport the tfile set (--tfile) into PLINK and create a bfile set (--make-bed --out) that generates corresponding PLINK binary biallelic genotype tables (.bed), PLINK extended MAP files (.bim) and PLINK sample information files (.fam). See file format specifications: https://www.cog-genomics.org/plink2/formats#bed[href=https://www.cog-genomics.org/plink2/formats#bed]. https://www.cog-genomics.org/plink2/formats#bim[href=https://www.cog-genomics.org/plink2/formats#bim]. https://www.cog-genomics.org/plink2/formats#fam[href=https://www.cog-genomics.org/plink2/formats#fam].\nImpute the genotyping sex associated with each sample by calculating the X chromosome homozygosity estimate (XHE): https://www.cog-genomics.org/plink/1.9/basic_stats#check_sex[href=https://www.cog-genomics.org/plink/1.9/basic_stats#check_sex].\nNote: To minimize loss of TCGA samples when no self-reported sex is available and sex information is needed as a covariate in the analysis, sex can be imputed based on the XHE (F or inbreeding coefficient).\nSplit off the X chromosome’s pseudo-autosomal region (--split-x) which is treated by PLINK as a separated XY chromosome. Indicate the proper build code.\nPerform LD pruning (--indep-pairphrase).\nRun check sex (--check-sex) which compares reported sex assignments with those imputed from X chromosome F coefficients.\nPlot a histogram of the XHE F coefficients (F coeff). See Figure 1[href=https://www.wicell.org#fig1]A.",
    "A very tight distribution of F coeff around 1 is expected for males, and a more spread distribution of F coeff centered around zero is expected for females.\nIn PLINK, F estimates < 0.2 are by default assigned female and F estimates > 0.8 assigned male. However, when (i) is observed and there is a clear gap between the two distributions, F coeff thresholds can be loosened and adjusted to correspond to the empirical gap. See “--check-sex” implementation and notes on TCGA sex assignment below.\nImpute sex (--impute-sex) based on the XHE F coefficient.\nCurate imputed sex assignments as needed and update sex assignments (--update-sex).\nNote: Not all TCGA samples have self-reported sex information and we imputed sex based XHE. However, we found cases where self-reported and imputed sex were discordant; sex assignments were curated depending on whether F coefficients fall within the expected range (F coeff < 0.2 for females and > 0.8 for males) or F coefficients fall out of the expected range (F coeff > 0.2 and < 0.8) (see troubleshooting[href=https://www.wicell.org#troubleshooting] section, Problem 4). These imputed/curated sex assignments for TCGA germline samples are available in Table S1 from (Sayaman et al., 2021[href=https://www.wicell.org#bib20]).\nExclude SNPs and individuals with greater than 5% missingness.\nFilter variants (--geno) to include only SNPs with 95% genotyping rate (5% missing).\nFilter samples (--mind) to exclude individuals with more than 5% missing genotypes.\nCalculate heterozygosity within each ancestry cluster, and filter samples with excess heterozygosity. https://www.cog-genomics.org/plink/1.9/basic_stats#ibc[href=https://www.cog-genomics.org/plink/1.9/basic_stats#ibc].\nCalculate heterozygosity (--het) vs. missingness (--missing) rates.\nUsing downloaded UCSF ancestry assignments, calculate heterozygosity means and standard deviations within each of the European (EUR), African (AFR), East Asian (EAS) and Admixed American (AMR) ancestry clusters.\nPlot the log10 proportion of missing genotypes against heterozygosity rates with mean +/-3∗SD for each ancestry cluster for QC. See Figure 1[href=https://www.wicell.org#fig1]B.",
    "Flag samples with heterozygosity >3∗SD above the mean for each ancestry cluster; remove individuals as part of 8b sample filtering.\nNote: Samples with low heterozygosity are expected for certain ancestry groups and are not removed.\nNote: Not all TCGA samples have self-reported race and ethnicity data. Initial ancestry cluster assignments can be calculated based on principal component analysis (PCA) of germline data (--pca). In (Sayaman et al., 2021[href=https://www.wicell.org#bib20]) initial ancestry calls were made based on Partition Around Medoids (PAM) clustering with k=4 using the first 3 principal components as described in (Sayaman et al., 2021[href=https://www.wicell.org#bib20]), (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib7]).\nSelect a representative sample for each individual with more than one sample. Conduct final filtering steps for all autosomal SNPs across the set of unique individuals.\nRestrict to autosomal chromosomes by excluding all unplaced and non-autosomal SNPs (--autosome).\nCreate a final list of samples to include in the study (--keep).\nExclude samples flagged in 7d for excess heterozygosity. ii. For individuals with more than one sample, preferentially select blood-derived normal samples; for those with more than one blood-derived sample, retain the samples with higher call rates.\nNote: All individuals and selected representative sample aliquots from TCGA germline data are listed in Table S1 from (Sayaman et al., 2021[href=https://www.wicell.org#bib20]).\nCalculate Hardy-Weinberg Equilibrium (HWE) within the largest ancestry cluster (EUR ancestry cluster). https://www.cog-genomics.org/plink/1.9/basic_stats#hardy[href=https://www.cog-genomics.org/plink/1.9/basic_stats#hardy].\nSubset for samples in EUR ancestry cluster. Calculate HWE (--hardy) across autosomal chromosomes.\nPlot the -log10 HWE p-value distribution for QC. See Figure 1[href=https://www.wicell.org#fig1]C.\nExclude SNPs (--exclude) that deviate from the expectation under HWE (p < 1 × 10-6) within the EUR ancestry cluster with the exception of SNPs previously associated with any cancer as reported in the GWAS catalog (p < 5 × 10-8) (Rashkin et al., 2020[href=https://www.wicell.org#bib18]) since they may deviate from HWE in cancer patients.",
    "Calculate Minor allele frequency (MAF) and exclude SNPs with MAF less than 0.5%. https://www.cog-genomics.org/plink/1.9/filter#maf[href=https://www.cog-genomics.org/plink/1.9/filter#maf].\nCalculate SNP MAFs (--freq).\nPlot the MAF cumulative distribution and histogram of -log10 MAF for QC. See Figure 1[href=https://www.wicell.org#fig1]D.\nFilter out SNPs (--maf) with MAF < 0.005.\nRemove duplicate SNPs with identical genomic first position.\nUsing a custom script, find SNPs with duplicate genomic first positions in the .bim file or alternatively identify SNPs sharing the same bp coordinate and allele codes in PLINK (--list-duplicate-vars).\nFilter out duplicate SNPs (--exclude).\nNote: The final QC’d list of sample (.fam) and SNP (.bim) files are available as part of the “Quality-controlled unimputed genotyping data plink files - QC_Unimputed_plink.zip” file under the “QC Unimputed Genotyping Data” sub-section of “TCGA QC HRC Imputed Genotyping Data used by the AIM AWG (from Sayaman et al.)” section of the “Supplemental Data Files”: https://gdc.cancer.gov/about-data/publications/CCG-AIM-2020[href=https://gdc.cancer.gov/about-data/publications/CCG-AIM-2020].\nStranding\nTiming: Approximately <1 day. Dependent on server capabilities\nThis section describes the stranding of the QC’ed genotyping data to the Haplotype Reference Consortium (HRC) prior to imputation.\nNote: To skip this step, download the controlled access “HRC Stranded Genotyping Data” generated from (Sayaman et al., 2021[href=https://www.wicell.org#bib20]), as described in step 11 of the “prepare germline genetic variation dataset[href=https://www.wicell.org#sec1.6]” section of this protocol OR proceed with the Stranding protocol steps provided below.\nNote: Scripts used in this section are available at: https://github.com/rwsayaman/TCGA_PanCancer_Genotyping_Imputation[href=https://github.com/rwsayaman/TCGA_PanCancer_Genotyping_Imputation].\nPrior to stranding, identify and remove all palindromic SNPs (A/T or G/C) (--extract).\nPerform stranding to the Haplotype Reference Consortium using the McCarthy Group tools (https://www.well.ox.ac.uk/∼wrayner/tools/[href=https://www.well.ox.ac.uk/%7Ewrayner/tools/]; see section “HRC or 1000G Imputation preparation and checking”).\nDownload and unzip the tab delimited HRC reference file (version v1.1 HRC.r1-1.GRCh37.wgs.mac5.sites.tab or current version) from the Haplotype Reference Consortium (http://www.haplotype-reference-consortium.org/site[href=http://www.haplotype-reference-consortium.org/site]).",
    "Perform stranding of the quality-controlled genotyping file against the HRC reference panel using the high performance cluster version of the script (HRC-1000G-check-bim-v4.2.13-NoReadKey.zip[href=https://www.well.ox.ac.uk/~wrayner/tools/HRC-1000G-check-bim-v4.2.13-NoReadKey.zip]), which compares genotyping alleles to the corresponding SNP alleles from HRC.\nProvide the .bim file, the calculated allele frequencies (--freq) and the reference panel as inputs (See “Usage with HRC reference panel”).\nNote: The McCarthy Group tools (https://www.well.ox.ac.uk/∼wrayner/tools/[href=https://www.well.ox.ac.uk/%7Ewrayner/tools/]) stranding script removes SNPs with differing alleles, SNPs with > 0.2 allele frequency difference, and SNPs not in the reference panel. The McCarthy Group stranding script would also remove A/T & G/C palindromic SNPs with MAF > 0.4, however we chose to remove all palindromic SNPs in the preceding step to remove ambiguity.\nGenotype imputation\nTiming: Approximately 1 week. Dependent on imputation server availability\nThis section describes generation of Haplotype Reference Consortium (HRC) imputed genotyping files from the stranded and QC’ed data (Figure 2[href=https://www.wicell.org#fig2]A).\nimgsrc:https://prod-shared-star-protocols.s3.amazonaws.com/protocols/1887-Fig2.jpg\nFigure 2. Expected distributions of imputation R2 and MAF values\n(A) Schematic of the number of SNPs (i) originally downloaded, (ii) after QC, (iii) after imputation, and (iv) after imputation QC.\n(B) Hexagonal heatmap of 2d bin counts of the number SNPs post-imputation, showing the distribution of SNP HRC Imputation R2 (x-axis) against the log10 Minor Allele Frequency (MAF) values across all autosomal chromosomes (y-axis). (c) Table showing the number and percent of SNPs below and above the suggested threshold levels of R2 ≥ 0.5 and MAF ≥ 0.005.\nNote: To skip this step, download the controlled access “HRC Imputed Genotyping Data” generated from (Sayaman et al., 2021[href=https://www.wicell.org#bib20]) as described in step 11 of the “prepare germline genetic variation dataset[href=https://www.wicell.org#sec1.6]” section of this protocol OR proceed with phasing and imputation protocol steps provided below.\nNote: Scripts used in this section are available at: https://github.com/rwsayaman/TCGA_PanCancer_Genotyping_Imputation[href=https://github.com/rwsayaman/TCGA_PanCancer_Genotyping_Imputation] https://github.com/rwsayaman/TCGA_PanCancer_Immune_Genetics[href=https://github.com/rwsayaman/TCGA_PanCancer_Immune_Genetics].",
    "Perform phasing and imputation using the Haplotype Reference Consortium (HRC) (Loh et al., 2016[href=https://www.wicell.org#bib14]; McCarthy et al., 2016[href=https://www.wicell.org#bib16]).\nTo reduce the run time, divide the HRC stranded PLINK file into 22 files corresponding to individual autosomal chromosomes, recode to VCF files and compress as .vcf.gz files.\nConduct phasing and imputation using a standard pipeline on the Michigan Imputation Server (MIS).\nPerform phasing using Eagle (version v2.3 or current version) on the variant call file (VCF) (Loh et al., 2016[href=https://www.wicell.org#bib14]). By default, Eagle restricts analysis to bi-allelic variants that exist in both the target and reference data.\nRun Minimac3 (Das et al., 2016[href=https://www.wicell.org#bib10]) for imputation. For each of the 22 VCF files, the MIS breaks the dataset into non-overlapping chunks prior to imputation. For HRC imputation, select the HRC reference panel (version r1.1.2016 or current version) using mixed population for QC.\nDownload the HRC imputed germline files for each chromosome (“chr∗.zip) from the MIS.\nUnzip each file using the provided password.\nEach unzipped folder contains 3 files:\n.dose.vcf.gz - imputed genotypes with dosage information.\n.dose.vcf.gz.tbi - index file of the .vcf.gz file.\n.info.gz file - information for each variant including quality and frequency (For Minimac3 info file, see: https://genome.sph.umich.edu/wiki/Minimac3_Info_File[href=https://genome.sph.umich.edu/wiki/Minimac3_Info_File]).\nFilter to exclude SNPs with imputation R2 < 0.5 using bcftools, see Figure 2[href=https://www.wicell.org#fig2]B. The imputation R2 is the estimated value of the squared correlation between imputed genotypes and true, unobserved genotypes.\nFilter “chr∗.dose.vcf.gz” files for R2 ≥ 0.5 and index. Generate filtered “chr∗.rsq0.5.dose.vcf.gz” and “chr∗.rsq0.5.dose.vcf.gz.tbi “files.\nGenerate new filtered “chr∗.info.rsq0.5.gz” files.\nConvert VCF files to PLINK files. Filter to exclude SNPs with MAF < 0.005, see Figure 2[href=https://www.wicell.org#fig2]B.\nConvert VCF “chr∗.rsq0.5.dose.vcf.gz” files to PLINK “tcga_imputed_hrc1.1_rsq0.5_chr∗.bed” files (--double-id --vcf).\nFilter out SNPs (--maf) with MAF < 0.005 in PLINK.",
    "Note: If you plan to analyze only a subset of the samples, recalculate the MAF in PLINK (--freq) for the population of interest. Filter SNPs based on the recalculated frequency.\nDetermination of ancestry-associated SNPs\nTiming: 2 h\nThis section describes the association analysis between inferred genetic ancestry and SNP genotypes using the logistic regression implementation in the Hail framework.\nLoad imputed genotype data into the Hail framework.\nImport multi-sample .vcf files for each chromosome into Hail to create a ‘matrix table’ object.\nLoad sample metadata (described above) and annotate matrix table object using the hail ‘annotate_cols’ function.\nPerform sample quality control analysis using the hail ‘sample_qc’ function by filtering out samples that do not meet the following criteria:\nSample call rate, the proportion of non-missing or filtered genotype calls ≥ 95%.\nNon-admixed samples according to the consensus ancestry call annotation.\nPerform variant quality control analysis by filtering out SNPs that:\nDeviate from Hardy-Weinberg Equilibrium (HWE test p < 1 × 10-6).\nGlobal allele frequency < 1%.\nFor each comparison (EUR-AFR and EUR-EAS), test the association between genetic ancestry and SNP genotypes using logistic regression (Hail function ‘logistic_regression_rows’).\nbinary response variable: ancestry (encoding: 0 EUR and 1 AFR/EAS).\nexplanatory variable: number of alternate alleles per sample (Ref: 0, Homozygous:1, Homozygous Alternative: 2).\ncovariates: biological sex, age.\nDetecting ancestry-associated quantitative expression trait loci\nTiming: 2 h\nLastly, we integrate the SNP genotype associations with ancestry and cancer-specific eQTLs to determine the extent to which germline genetic variation explains differential expression between ancestries.\nExtract significant cancer-specific eQTLs from the PancanQTL database.\nKeep eGene-eSNP pairs for which a given eGene is in the set of genes with significant ancestry-association expression.\nPerform table joins between the filtered eQTL results table and SNP genotype associations by SNP identity (dbSNP identifier).",
    "Note: The underlying datasets may be derived from different versions of dbSNP. Alternatively, you can consider joining tables by the chromosome name, genomic position, reference allele and alternate allele, assuming that both datasets are derived from the same version of the reference genome.\nFor each gene with demonstrated ancestry-differential expression, determine whether it has at least one ancestry-associated eSNP.\nCalculate summary statistics and visualize representative loci by cancer type as shown in Figure 6 of (Carrot-Zhang et al., 2020[href=https://www.wicell.org#bib7])."
  ],
  "subjectAreas": [
    "Genomics",
    "Rnaseq",
    "Sequence Analysis",
    "Bioinformatics",
    "Computer Sciences",
    "Cancer",
    "Gene Expression"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics",
    "Bioinformatics & Computational Biology"
  ]
}