{
  "id": 11206,
  "origin_website": "Jove",
  "title": "Monitoring the Wall Mechanics During Stent Deployment in a Vessel",
  "procedures": [
    "1. Preparation of the Latex Vessel\nFix both ends of the latex vessel to barbed hose connections, which are fastened on a sturdy workbench.\nMeasure the area of interest on latex vessel to determine the field of view. The area of interest for a stent test should be centered between the barbed hose connectors and include approximately one inch on each side of the stent in order to observe the strains outside the stented area.\nRecord the distance from the outside edge of one barbed hose connector to the center location between the connectors, which is also the approximate center of the latex vessel. Translate the distance onto the catheter by measuring from the center of the stent up the catheter. Then mark the catheter with a marker.\nRemove the latex vessel from the barbed hose connectors.\nPrepare the latex vessel by spraying the area of interest with a stochastic pattern of white and black spray paint or marking the area of interest with random dots using permanent marker. For smaller samples and finer stochastic pattern is required.\n2. In vitro Test System and Calibration of ARAMIS System\nSelect the calibration panel that is slightly larger than the area of interest measured in step 1.\nPlace the calibration panel between the barbed hose connectors at the area of interest and ensure that the area of interest is well lit.\nAdjust the distance between two cameras, the distance from the sample, and the camera height based on the calibration panel selected. Each calibration panel is different; therefore the ARAMIS user manual will have to be consulted to determine these distances.\nOpen a new project in ARAMIS by selecting \"File\", then \"New Project\". Next click on the \"Sensor\" tab and select \"Calibration\", then \"Full Calibration\".",
    "The ARAMIS software will now walk the user through the steps to calibrate the cameras.\nWith the lens aperture fully open, focus the camera on the calibration panel by loosening the set screw on the camera and rotating the lens. Once focused, retighten the set screw and close the aperture.\nTake the first image of the calibration process. Displace or rotate the calibration panel according to the demonstration on the computer, until the image is focused on the computer screen. Take the second image. Repeat this process for the remainder of the calibration images.\nOnce all of the calibration images are taken, the ARAMIS imaging analysis software will calculate the calibration settings. The calibration process should be repeated if the calibration deviation is greater than 0.04. Any adjustments made to the focus of the camera or the distance between cameras will render the calibration process void.\nRemove the calibration panel and place the painted latex vessel back onto the barbed hose connectors.\n3. Pretest to Avoid Excessive Background Noise\nDetermine the number of frames per second that is desired for the test. Increased frames per second will produce more uniform strain results.\nAdjust the shutter speed to less than 1 frame per second and so that no red is displayed on the image.\nTake 5 images.\nAdd start points on the image series and compute the test.\nWhile holding \"ctrl\", click on the center of sample to observe the background noise. If the pretest noise is above 75 microstrain the calibration process must be redone.\n4. Stent Deployment\nSelect the amount of images desired to take during the test. 200 images will suffice for the stent expansion.",
    "Gradually insert the catheter into the latex vessel, and using the marker indicator on the catheter to guide the stent insertion until it reaches the central location.\nBegin taking images with ARAMIS.\nFor the balloon-expandable stent, gradually increase the balloon pressure to expand stent until the balloon is fully expanded; then gradually decrease the pressure of balloon to zero and the balloon is deflated and withdrawn along with the catheter.\nFor the self -expanding stent, gradually remove the sheath until the stent is fully expanded; then gradually retract the catheter.\n5. Images Analysis\nStrain history of a specific point on the vessel\nCreate a stage point by holding the \"ctrl\" key and clicking on the area of interest.\nSelect the type of strain that is desired, i.e. strain in the X, Y, XY, major strain, minor strain, or Mises strain.\nThe plot in the lower right corner will display the strain at the point selected over the duration of the test.\nSpatial strain along a specific path of the vessel\nCreate a multistage point line by clicking on the \"sections\" tab, then \"create section\". Select a line on the image parallel to the X axis at Y equals zero. This will create a number of stage points in a line.\nAfter the multistage line is created the plot in the lower corner will display a series of lines on one plot. Each line represents the strain at one instance in time along the length of the section.\nCreating a best fit cylinder to analyze expansion rate and radius of the vessel\nIn the upper tool bar select \"primitives\", then \"best fit cylinder\".\nSelect a small section of the image using the \"select through surface\" tool on the right tool bar.",
    "The ARAMIS software will generate a three dimensional best fit cylinder.\nThe images can then be cycled through to observe how the diameter of the latex vessel is varying.\nEvaluating the distance between two points\nUnder the \"analysis\" tab click on \"point to point distance\".\nSelect a length on the image that is desired for analysis by selecting two points.\nThe images can then be cycled through to observe the change in distance between the two points over time.\n6. Representative Results\nThe stent struts expand the vessel wall outwards, strains will generally be higher around stent location. Figure 1 is an example of strain mapping during the recoil process of balloon-expandable stent, as well as major strain history at one specific point. The black dots in Figure 1 are reference points, which were used by the high-speed cameras to capture and track the displacements of these reference points on the conduit. Based on the recorded movement of reference points, the software will then be used to calculate the strains of the conduit or any other targeted object. Major strain, also referred to as the maximum principal strain, is calculated as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/3945/3945eq1.jpg\nIt is clear that the implanted stent led to non-uniform strain distribution on the vessel surface. This could be explained by the recoil loading from ends-constrained latex conduit and the mesh structure of stent. This strain field corresponds to the initial stage of stent recoil, as identified by the red cross marker in the bottom image of Figure 1. The major strain-history curve of a specific point 10 demonstrated distinguishable stages of stent implantation. The balloon expansion occurs from approximately 10 to 12 seconds and stent recoil following the deflation of the balloon occurs between 12 and 14 seconds.\nimgsrc://cloudfront.jove.com/files/ftp_upload/3945/3945fig1.jpg",
    "Figure 1. Experimental setup (top); non-uniform strain distribution on the stented conduit surface (middle); the major strain history at the point 10 (bottom).Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}