{
  "id": 17382,
  "origin_website": "Jove",
  "title": "Retzius-Sparing Robot-Assisted Radical Prostatectomy",
  "procedures": [
    "This study has been submitted to the local ethics committee of Ghent University Hospital and institutional approval has been granted (EC UZG 2019/1506). The study has been registered in the Belgian study registry under reference B670201941650. All patients provided written informed consent.\n1. Patient preparation and positioning\nPreparation\n\t\nFollow contemporary internationally accepted guidelines to diagnose prostate cancer and to set the indication for radical prostatectomy1. Use multiparametric MRI for local staging as this provides important information about prostate volume, concomitant prostatic enlargement and median lobe, and tumor location and extension. This will help in the decision whether to perform nerve-sparing and/or bladder-neck-sparing10. Be sure that this imaging is available at the time of the operation.\nOffer RS-RARP to patients with local or locally advanced prostate cancer and a life-expectancy >10 years. Discuss alternative treatment options such as active surveillance, other modalities of radical prostatectomy, and irradiation whenever applicable. Do not offer RS-RARP to patients with metastatic prostate cancer.\nRule out medical conditions that are a contra-indication for robotic surgery in steep Trendelenburg position by preoperative anesthesiologic examination. If these medical conditions are present, treat them first (if possible) or discuss alternative treatment with the patient. Include the type and screen of the patient's blood in the preoperative evaluation in the rare case a blood transfusion will be necessary.\nAdminister natriumlaurylsulfoacetate-sorbitol-natriumcitratedihydrate clysma 4-8 h before the operation to clean the rectum. Allow food intake and intake of clear fluids until 6 h and 4 h before induction, respectively.\nPerform general anesthesia with endotracheal intubation. Administrate a single-shot prophylactic shot of cefazolin 2g at induction.\nInsert one large-caliber peripheral intravenous line and one arterial line to ensure access and monitoring of the circulatory system. Use pulsoxymetry and 4-lead cardiac monitoring during the entire procedure.\nPositioning",
    "Place the patient in the supine position. Place and secure the arms along the body of the patient and secure the legs by a strap at the level of the knees. Secure any compression points with gel pads.\n\t\tNOTE: The patient wears thrombo-embolus deterrent stockings.\nApply shoulder supports to avoid shifting due to the steep Trendelenburg position. Secure the thorax of the patient to the table with adhesive tape (7.5 cm width) to prevent further shifting. Cover the patient with a thoracic warming blanket device.\nDisinfect the surgical field by povidone-iodine alcoholic solution or, alternatively, by chlorhexidine in case of iodine-allergy. Include the anterior abdomen, groins, and genitalia into the surgical field. Attach sterile drapes at the borders of the field after disinfection.\nPlace a 16 F hydrogel-coated latex transurethral catheter to ensure urinary drainage and bladder emptying at the time of trocar insertion. Be sure to have easy access to the transurethral catheter as it will aid in the identification of the urethra later during the procedure.\n2. Docking the robotic system\nCover the robotic arms of the patient cart with sterile drapes as they will be later in contact with the surgical field. Use a 30째 camera.\n\tNOTE: The Da Vinci Xi system is used for this operation (Figure 1). This system consists of three basic parts: a surgeon console that is placed at a distance of the operation table; a patient cart with four robotic arms that will be docked to the trocars and a vision cart with the monitor for scrub nurse and assistant, electrocautery system and CO2-insufflator placed alongside the patient.\nTrocar insertion\n\t\nInsertion of camera trocar\n\t\t\nMake a skin incision longitudinally over 2-2.5 cm about 1 cm above the umbilicus. Dissect the subcutaneous fatty tissue bluntly until the rectus fascia is identified.",
    "Incise the rectus fascia longitudinally and place absorbable polyglactin 1 stay sutures at the fascia on both sides.\nOpen the peritoneum with scissors. Ensure by digital palpation with the index finger that there is no contact of the bowel to this opening.\nInsert an 8 mm robotic camera trocar with Hasson cone in the peritoneal cavity. Attach the clamps of the cones to the stay sutures at the fascia.\nAttach the camera trocar to the CO2 insufflator and inflate to 12-15 mmHg pressure. Bring the patient in the 30-35째 Trendelenburg position to free the minor pelvis from the small bowel. Ensure that there is no shifting of the body during steep Trendelenburg positioning.\nPlace at the horizontal level of the camera trocar, two and one 8 mm trocars for the robotic instruments, respectively, at the left and right sides of the camera trocar with 6-8 cm distance between any robotic trocars. Place all trocars under direct vision with the camera. Use the blunt tip obturator to place the trocars.\nPlace a 5 mm assistant trocar 5 cm cranially to the midline between the camera trocar and the right robotic trocar. Place a 12 mm assistant trocar 3 cm above the right spina iliaca anterior superior.\n\t\tNOTE: The assistant is at the patient's right-handed side while the scrub nurse is at the patient's left side.\nDisconnect the insufflation cable at the camera trocar and connect to the 12 mm assistant trocar.\nDocking of the patient cart and insertion of robotic instruments",
    "Move the patient cart to the right-hand side of the patient until the third arm can be connected to the camera trocar. Optimize the positioning of the patient cart further using the automatic application of the system. Connect the three other 8 mm trocars with at least 10 cm distance between the arms to avoid collision during operative movements.\nUse as robotic instruments, a monopolar curved scissor, a fenestrated bipolar forceps, a Cadiere forceps, and a large needle driver. At the start of the operation, place the monopolar scissor in the right robotic trocar, the bipolar fenestrated forceps in the medial left robotic trocar, and the Cadiere forceps in the lateral left robotic trocar.\nControl insertion of robotic instruments by a direct vision to avoid perforation of viscera, omental adhesions, or vascular structures.\nAs assistant instruments, use a laparoscopic suction-irrigation device placed in the 5 mm assistant trocar and a laparoscopic grasper placed in the 12 mm assistant trocar. Take place at the surgeon console to start the robot-assisted part of the operation.\n\t\tNOTE: These laparoscopic instruments are handled by the assistant and are not connected to robotic arms.\nimgsrc://cloudfront.jove.com/files/ftp_upload/63592/63592fig01.jpg\nFigure 1: The patient cart with 4 robotic arms. Please click here to view a larger version of this figure.[href=https://www.jove.com/files/ftp_upload/63592/63592fig01large.jpg]\n3. Dissection of the seminal vesicles\nAccess to the minor pelvis\n\t\nPerform adhesiolysis by releasing any adhesions that hamper easy access to the minor pelvis and rectovesical pouch. Perform this adhesiolysis with the lens turned 30째 downward.\nFacilitate access to the rectovesical pouch (or Douglas') by pushing the bladder upward with the Cadiere forceps and by pushing the rectum downward with the suction-irrigation device.\nAccess to the seminal vesicles\n\t\nIncise the peritoneum over the vas deferens on both sides and continue medially until these incisions reach each other.",
    "NOTE: The vas deferens is most easily identified when it crosses over the external iliac vessels, especially in obese men.\nAt the lateral edge of the incision, dissect the vas deferens in a circumferential fashion and transect it. Dissect the vas deferens medially until the tip of the seminal vesical is reached.\nDissection of the seminal vesicles\n\t\nPeel off the Denonvilliers' fascia medially from the vas deferens in case there is no evidence of seminal vesicle invasion. If there is suspicion of seminal vesicle invasion, incise the Denonvilliers' fascia 1-2 mm below the lower edge of the seminal vesicle to ensure a safe surgical margin.\nSecure the vessels where they enter at the tip and lateral surface of the seminal vesicle by bipolar hemostasis or with 5 mm metallic clips and transect them. Continue this dissection until the base of the prostate has been reached. Perform the same procedure on the opposite side.\n\t\tNOTE: The erectile nerves are close to the tip and lateral surface of the seminal vesicles and monopolar coagulation should be avoided in case nerve-sparing is attempted.\n4. Posterolateral dissection of the prostate\nLateral dissection of the prostate\n\t\nRetract the seminal vesicle medially by the Cadiere forceps for the right side and by the assistant laparoscopic grasper for the left side. This allows visualization of the fatty tissue at a triangle between the base of the seminal vesicle and the region lateral to the base of the prostate.\n\t\tNOTE: This triangle is just above the erectile nerves and prostatic pedicle.\nPerform blunt dissection in this fatty tissue along the lateral surface of the prostate until the reflection of the endopelvic fascia is encountered. Perform hemostasis by the bipolar forceps as monopolar current could damage the erectile nerves.\nSuspension of the peritoneum",
    "Facilitate access to the prostate and bladder neck by two suspension sutures through the upper part of the peritoneal incision.\nInsert the large needle driver in the right robotic arm. Place a straight needle with a non-resorbable suture through the abdominal wall 2-3 cm above the pubic bone just medially from the medial umbilical ligament.\nPerforate the upper part of the peritoneal incision and the underlying fatty tissue with the straight needle. Bring the needle back outside the body close to the insertion tract. Keep this suspension stitch under tension using a mosquito clamp outside the abdomen. Do the same on the contralateral side.\nPosterior dissection of the prostate\n\t\nRemove the needle driver and bring back the curved scissors in the right robotic arm. Retract the seminal vesicles upward and slightly lateral with the Cadiere forceps and the assistant laparoscopic grasper for the left and right sides, respectively, to bring the Denonvilliers' fascia under tension.\nHandling of erectile nerves.\n\t\t\nBilateral nerve-sparing approach: Develop a plane by blunt dissection between the prostatic fascia and the Denonvilliers' fascia up to the apex of the prostate and laterally until the prostatic vessels are encountered.\nNon-nerve sparing approach: Incise the Denonvilliers' fascia 1-2 mm below the prostate base. Dissect the anterior surface of the rectum and more laterally in the perirectal fatty tissue.\nUnilateral nerve-sparing approach: Perform step 4.3.2.1 at the site of nerve-sparing and step 4.3.2.2 at the site of non-nerve sparing. Incise the Denonvilliers' fascia at the midline over the rectal wall.\nHemostasis of the prostatic pedicle and dissection of the neurovascular bundle\n\t\nAccess to the right side: Grasp the prostate base with the Cadiere forceps just under the attachment of the ipsilateral seminal vesicle. Retract the prostate base medially and slightly upward to bring the prostatic pedicle under tension.",
    "Make a window with the monopolar scissors in the prostatic pedicle and secure this part of the pedicle using a large polymer locking clip that is applied through the 12 mm assistant trocars. Transect this part of the pedicle at the prostatic side of the clip.\nRepeat 4.4.2 (usually 2-3 times) until the entire prostatic pedicle is secured. Keep tension on the prostatic pedicle after each time a part of the pedicle is transected.\nRepeat step 4.4.2 until the apex of the prostate is reached. Keep a safe distance from the prostatic surface each time a window is made.\n\t\tNOTE: This will sacrifice the neurovascular bundle containing the erectile nerves.\nPeel off the neurovascular bundle from the prostatic fascia by blunt dissection and by keeping the bundle under slight tension using a progressive medial and upward retraction with the Cadiere forceps.\nSecure small vessels attached to the prostate by 5 mm metallic clips and transect them with scissors. Proceed until the apex of the prostate is reached. Ensure suction and irrigation by the assistant through the 5 mm trocar whenever needed.\nAccess to the left side: Switch the Cadiere forceps to the medial left-sided trocar and the fenestrated bipolar forceps to the lateral left-sided trocar. Retract the prostate base medially and upward. Use the endowrist of the instrument to create a 90째 angle downward under which the assistant has easy access to place the clips. Repeat the procedure at the left side as described above (steps 4.4.2 until 4.4.6).\n5. Dissection of the bladder neck\nGrasp the seminal vesicles by the Cadiere forceps and retract them downward to create tension between the bladder neck and the prostate base.",
    "Develop the plane between the bladder neck and prostate base using a combination of monopolar incisions with the scissors and blunt dissection. Preserve the circular muscle fibers of the bladder neck in case of bladder neck sparing. Move the seminal vesicles more laterally to facilitate the lateral dissection of the bladder neck.\nOpening of the bladder neck\n\t\nIncise the mucosa at the posterior aspect of the bladder neck over 1 cm. Visualize the urethral catheter.\nPlace an absorbable polyglactin 3-0 suture at the posterior aspect of the bladder neck. Deflate the balloon of the catheter and retract the catheter.\nGrasp the stay suture with the fenestrated bipolar forceps and move upward until the anterior part of the bladder neck becomes visible. Incise the mucosa further and release the bladder neck from the base of the prostate.\nPlace a second stay suture at the anterior aspect of the bladder neck with absorbable polyglactin 3-0 suture just before the bladder neck is completely released.\n\t\tNOTE: These stay sutures will facilitate later identification of the bladder neck for the vesico-urethral anastomosis.\n6. Anterior and prostatic apex dissection\nAnterior dissection\n\t\nContinue slight upward tension at the stay suture on the posterior aspect of the bladder with the fenestrated bipolar forceps. Place the Cadiere forceps in the prostatic urethra and apply downward traction to create tension at the anterior surface of the prostate.\nFollow the anterior surface of the prostate using a combination of blunt dissection and monopolar incision sparing the Santorini's plexus, the puboprostatic ligaments, and the Retzius' space. Move the Cadiere forceps laterally to facilitate anterolateral dissection.\nProstatic apex dissection\n\t\nIdentify the membranous urethra by grasping the urethral catheter with the Cadiere forceps.",
    "Incise the circular fibers of the urethra 1-2 mm caudally to the apex of the prostate. Push the circular fibers toward the apex of the prostate to expose the inner longitudinal layer of the urethra (the so-called lissosphincter). Transect this inner layer as close to the prostate as possible to maximally preserve the lissosphincter.\nIncise any attachments dorsally to the membranous urethra until the prostate is completely freed from the surrounding tissues. Insert an endobag through the 12 mm assistant trocar to put in the prostate (and seminal vesicles). Close the endobag and leave it closed in the right iliac fossa.\n7. Vesico-urethral anastomosis\nPlace the large needle driver in the right robotic trocar and the Cadiere forceps and fenestrated bipolar forceps, respectively, in the medial and lateral left robotic trocar. Use the fenestrated bipolar forceps to gently push the bladder toward the urethra in order to reduce tension at the anastomosis.\nSuturing of the vesico-urethral anastomosis\n\t\nPlace the first suture of the first absorbable barbed wire (3-0, 23 cm in length) outside-in just lateral to the right of the 12 o'clock position on the bladder neck. Pull the anterior stay suture that was placed in step 5.3.4 to identify the bladder neck and the mucosa of the bladder.\n\t\t\nPlace the suture inside-out on the urethra, also slightly lateral to the right of the 12 o'clock position. Identify the urethra by moving the tip of the urethral catheter into the membranous urethra.\nPlace the first suture of the second absorbable barbed wire (3-0, 23 cm in length) outside-in just lateral to the left of the 12 o'clock position on the bladder neck and inside-out on the urethra at the same position.",
    "For posterior suturing at the left side, approximate the bladder mucosa against the urethral mucosa by progressive traction on both ends of the barbed wires. Repeat the suturing with the second barbed wire outside-in on the bladder neck and inside-out on the urethra twice at which moment the 9 o'clock position is reached. Approximate the bladder mucosa against the urethral mucosa after each suture.\nFor suturing at the right side, perform suturing with the first barbed wire outside-in on the bladder neck and inside-out on the urethra, until the 6 o'clock position is reached. Do not approximate the last suture yet in order to allow space to finalize the left-handed side of the anastomosis.\nFor anterior suturing at the left side, continue the anastomosis at the left side going from 9 o'clock to 6 o'clock position. Do not approximate the last suture yet to allow the tip of the catheter to pass between the left and right barbed wires.\nGrasp the tip of the catheter and place it in the bladder. Insufflate the balloon.\nTighten the last sutures on the left and right sides until the bladder and urethral mucosa are approximated. Check the water-tightness of the anastomosis by instillation of 120 mL of water in the bladder (leak-test).\nRemove the suspension sutures at the upper part of the peritoneal incision. Use the remains of the barbed wires to close the peritoneal incision from medial to lateral on both sides. Perform a bilateral pelvic lymph node dissection if indicated by contemporary internationally accepted guidelines1.\n\tNOTE: No surgical drain is left in case pelvic lymph node dissection has not been performed.\n8. Extraction of the prostate and closure of the incisions\nTransfer the extraction wire of the endobag from the right robotic trocar to the camera trocar under direct vision.",
    "Deflate the abdomen and remove the trocars under direct vision. Change the Trendelenburg position to the neutral supine position. Further incise the supra-umbilical skin incision and fascia incision to allow easy extraction of the prostate.\n\tNOTE: The size of this incision depends on the size of the prostate.\nClose the rectus fascia with a resorbable polyglactin 1 suture. Close the subcutaneous tissue at the camera trocar and 12 mm assistant trocar with resorbable polyglactin 3-0 suture. Close all skin incisions with skin staplers.\n9. Postoperative care\nTransfer the patient to the postoperative care unit and monitor for 2-3 h. Transfer the patient to the hospitalization unit after approval by the anesthesiologist and surgeon.\nAllow the patient to resume intake of clear fluids. Allow intake of solid food and stimulate to walk around during the first postoperative day. Remove the urethral catheter at the third postoperative day and measure micturition volume and residual bladder volume. Replace the catheter in case of substantial residual volume and remove it at the polyclinic 1 week later.\nDischarge the patient on the third postoperative day. Remove the skin staplers between the 10th and 14th postoperative days by the general practitioner. Administrate low molecular weight heparin subcutaneously until the 20th postoperative day by a nurse at home or by the patient himself.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}