{
  "id": 15406,
  "origin_website": "Jove",
  "title": "In Vitro Transcription Assays and Their Application in Drug Discovery",
  "procedures": [
    "Caution: Experiments involve the use of the radioactive isotope 32P and no work should be undertaken until all appropriate safety conditions have been met. Generally personnel are required to attend a safety course and undergo supervised practice prior to experiments using radioactive reagents. Please wear personal protection equipment (thermoluminescent dosimeter, safety glasses, gloves, radiation room lab coats, full length pants, closed-toe shoes) when performing the reaction.\n1. Preparation of Assay Materials\nObtain the Proteins Required for Transcription assay.\n\t\nFor the experiment described here, overproduce and purify E. coli RNAP in the laboratory as described11, or obtain from a commercial source (Materials List).\n\t\tNote: Both provide similar results. Other methods for purification of native or affinity labeled RNAP can also be used12,13. Sigma/NusA factors can be obtained as described in previous work14,15.\nPreparation of Diethyl Pyrocarbonate (DEPC) Treated Water\n\tNote: Alternatively, RNase-free water can be obtained from commercial sources (Materials List).\n\t\nAdd 1 ml diethyl pyrocarbonate (DEPC) to 1 L of purified water (0.1% v/v) and mix overnight.\nAutoclave DEPC water and tips twice.\nDNA Template Preparation\n\t\nPurify plasmid pSG115416 and/or pIA22617 using a plasmid purification kit (Materials List) according to manufacturer's instructions.\nTo amplify the template for run-off transcription assays (a 360 bp fragment encompassing the Pxyl promoter region), assemble a PCR reaction on ice including 25 μl 2x PCR mix (Materials List), 2 μl each of the primers (5 µM): 5′-CAAAGCCTGTCGGAATTGG-3′ (forward) and 5′-CCCATTAACATCACCATC-3′ (reverse), 1 μl pSG1154 plasmid preparation (250 µM) and 20 μl purified water).",
    "Or alternatively, for single round transcription assays, amplify a 447 bp fragment encompassing the λ PR promoter region from pIA22617. Set up a PCR reaction on ice using 25 μl 2x PCR mix, 2 μl each of the primers (5 µM): 5′-GTGCTCATACGTTAAATCT-3′ (forward) and 5′-CAGTTCCCTACTCTCGCATG-3′ (reverse), 1 μl pIA22617 plasmid preparation (250 µM) and 20 μl purified water).\n\t\t\tNote: This template lacks cytosine until the +26 nt position, which is the 26th nucleotide from the transcription start site. Therefore, transcription using this template will allow initiation, promoter clearance and stalling at the +26 nt to form a stable transcription elongation complex (EC) when only ATP, UTP and GTP are present in the reaction.\nSet up a PCR reaction with the following conditions: 95 °C for 30 sec, 50 °C for 30 sec, 72 °C for 30 sec, repeating for 30 cycles.\nPurify the product using a PCR clean-up kit (Materials List) according to manufacturer's instructions and elute in 100 μl transcription buffer for the transcription assay.\nDetermine the template DNA concentration using a fluorospectrometer (Materials List).\nNTP Preparation\n\tNote: NTPs can be obtained from different commercial sources (Materials List).\n\t\nDissolve NTPs (≥99% pure) in DEPC-treated water to make 1 M stock, aliquot 1 ml of the solution into 1.5 ml tubes (50 μl in each tube) and store at -20 °C.\nOrder α-32P UTP (3,000 Ci/mmol) prior to the experiment. 32P has a short half-life of 14.29 days.\n\t\tNote: Using alpha-labeled UTP avoids comparing the intensity of bands with different length.\nRNA Ladder Preparation",
    "Assemble the following reaction at room temperature: 0.5 μg RNA Template Mix (Materials List), 80 mM HEPES buffer pH7.5, 12 mM MgCl2, 10 mM NaCl, 10 mM DTT, 2 mM ATP/CTP/GTP, 0.5 mM UTP, 2 μl α-32P UTP, 0.5 μl T7 RNAP (Materials List), DEPC-treated water to 20 μl.\nAllow reaction to proceed at 37 °C for 1 hr. Use immediately or store at -80 °C.\n2. Preparation of RNA Sequencing Gel\nGel Preparation\n\t\nClean the plates from a sequencing gel apparatus (Materials List) twice with 70% ethanol and purified water, and assemble the cell with a comb and two spacers.\n\t\tNote: One plate can be coated with siliconizing reagent (Materials List) to facilitate gel removal in Step 4.2.\nDissolve 33.6 g urea in 22 ml water and 16.4 ml of 5x Tris/Borate/EDTA (TBE) buffer (54 g tris(hydroxymethyl)aminomethane; 27.5 g boric acid; 10 ml of 1 M ethylenediaminetetraacetic acid (EDTA), pH 7.4 in 1 L water) using a magnetic stirrer.\nAdd 16 ml of 40% Acrylamide/bis-acrylamide solution (19:1) to the urea solution and filter through a 0.45 µm filter.\nAdd 514 µl 10% (w/v) freshly prepared ammonium persulfate in water followed by 51.4 µl N,N,N′,N′-Tetramethylethylenediamine (TEMED) to the filtered solution.\nGently invert the gel solution to avoid excessive aeration and inject immediately and smoothly into the horizontally positioned pre-packed sequencing cell from the bottom injection hole. Take care to avoid making bubbles during injection.\nAllow 1-1.5 hr until the gel is completely set before use in a transcription assay. The gel can be stored at room temperature for two or three days when wrapped with water-wet tissue on the top of the sequencing cell.\n3. Transcription Reaction\nTranscription Elongation Pausing Assay\n\t\nFormation of a transcription elongation complex",
    "Add 1 µl of RNAP core enzyme (1 µM stock in transcription buffer) to a 1.5 ml tube.\nAdd 1 µl of purified sigma-70 factor (σ70; 3 µM stock in transcription buffer) to the RNAP and incubate on ice for 10 min to form RNAP holoenzyme.\nAdd 3 µl 500 nM purified template DNA (λ PR promoter from the pIA226 PCR product) in transcription buffer to the RNAP holoenzyme and incubate at 37 ºC for 5 min to form the open complex.\nPrepare a mixture of reaction components in another 1.5 ml tube using 5 µl of 10x transcription buffer (Materials List: 400 mM Tris-HCl, 1.6 M KCl, 100 mM MgCl2, 10 mM DTT, 50% glycerol, pH 7.9 in DEPC treated water), 2 µl of 250 µM each GTP and UTP, 1 µl of 1 mM ATP, and 1 µl of α-32P UTP (3,000 Ci/mmol). Add DEPC treated water to 41 µl.\n\t\t\tNote: RNase inhibitor (Materials List) can be used to minimize the RNase contamination.\nTransfer the mixture solution to the tube containing the open complex and incubate at 37 ºC for 15 min to form the transcription elongation complex stopped at +26 nt.\nMove the reaction to room temperature (~21 °C) and add 1 µl of 2.5 mg/ml rifampicin to a final concentration of 50 µg/ml.\nAdd 1 µl of 0.1 mM purified NusA to the reaction mixture and incubate for 5 min at room temperature.\nAdd 2 µl of 250 µM CTP into the reaction mixture to make a final volume of 50 µl and measure the reaction time using a timer.",
    "Transfer 5 µl of the reaction solution into 2 µl of RNA gel loading buffer (95% formamide, 0.05% bromophenol blue and 0.05% xylene cyanol) at 30, 60, 120, 240, 480, and 1,200 sec to quench the reaction.\nDispose the 32P UTP tips and tubes in a radioactive waste container.\nTranscription Initiation Assay\n\t\nFormation of the Open Complex \n\t\t\nDilute purified σ70 to 0.5 µM.\nRepeat Steps 3.1.1.1 to 3.1.1.3 using 0.5 µM (instead of 3 µM) purified σ70, and the DNA template (the Pxyl promoter region from pSG1154 PCR product).\nInhibition of transcription initiation assay\n\t\t\nAdd the inhibitor designed to prevent RNAP holoenzyme formation to RNAP core enzyme prior to addition of σ70 (after step 3.1.1.1), followed by Steps 3.1.1.2 and 3.1.1.3 to examine whether the inhibitor is able to disrupt holoenzyme formation.\nAlternatively, after Step 3.1.1.2, add the inhibitor to examine whether it is able to competitively inhibit σ70 binding to RNAP.\nUse the same amount of DMSO, the solvent of the inhibitor, instead of the inhibitor stock in control reactions.\nCompletion of the reaction\n\t\t\nDissolve heparin in water to a stock concentration of 1 mg/ml and stock at -20 °C.\n\t\t\tNote: Heparin is a competitor of DNA that can sequester RNAP that has not formed an open complex. Once the open complex is formed, heparin cannot enter the DNA binding site of RNAP and inhibit transcription from pre-formed open complex. Therefore, heparin is only required for single-round assays; it is not needed for multi-round assays.\nPrepare the reaction mixture using 5 µl of 10x transcription buffer (Materials List), 1 µl of 1 mg/ml heparin solution, 1 µl of 10 mM each ATP, GTP, and CTP, 2.5 mM UTP, and 1 µl of α-32P UTP (3,000 Ci/mmol). Add DEPC treated water to 45 µl.",
    "Mix the reaction mixture with the transcription open complex, pulse spin and incubate at 37 °C for 20 min.\nTransfer 10 µl of the reaction solution into 5 µl of RNA gel loading buffer (95% formamide, 0.05% bromophenol blue and 0.05% xylene cyanol) to quench the reaction.\n4. RNA Gel Running and Development\nRunning the Denaturing Polyacrylamide Gel\n\t\nRun the gel at 50 ºC and 50 W in 1x TBE buffer for approximately 1.5 hr until the temperature of the gel and the buffer is stable at 50 ºC.\nHeat samples at 90 ºC for 30 sec and move them onto ice prior loading onto the gel.\nLoad samples into the wells on the top of the gel alongside one lane containing 2 µl RNA ladder (1:100 dilution).\nRun the gel at 50 W and 50 ºC in 1x TBE buffer until the bromophenol blue dye reaches ~2/3 down the gel.\nGel Treatment\n\t\nOpen slowly and carefully separate the upper plate from the sequencing cell. Take great care to avoid breaking the gel.\nCut chromatography paper (Materials List) to match the gel size from the top to the bromophenol blue dye. Use a Geiger counter to confirm the approximate position of radioactively labelled RNA transcripts.\nCarefully cover the gel with the filter paper, and press firmly till the gel adheres to the filter paper. Cut off and discard the bottom of the gel to radioactive waste as the unincorporated NTPs run to the bottom of the gel, which can be very hot.\nPlace a similar sized piece of filter paper on the drying bed of a vacuum-drying machine, and carefully lay the gel-coated paper onto it with the gel side up.\nCover the gel with a plastic wrap and dry at 60 °C for 1.5 hr.",
    "Wrap the other side of the gel coated filter paper with plastic wrap, and place on a photostimulable phosphor plate in the imaging case, with the appropriate exposure time, which can vary from 1 hr to overnight depending on the reaction efficiency.\nImage the phosphor plate using an imager scanner according to manufacturer's instructions. Determine the relative band intensity using ImageJ software according to the software manual.\nUse a Geiger counter to check the radioactive contamination in the work area, wipe the suspected items and area with tissue and a cleaning agent and dispose the tissue in the disposal container.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}