{
  "id": 7529,
  "origin_website": "Bio",
  "title": "Immunoprecipation Assay to Quantify the Amount of tRNAs associated with Their Interacting Proteins in Tissue and Cell Culture",
  "procedures": [
    "Notes:  The starting material can be any tissue of interest, or mammalian cell culture endogenously expressing, stably transfected, or ectopically expressing the tRNA-interacting protein of interest. It is recommended to test and optimize the protocol with easily accessible material, e.g., cell culture, before performing experiments in tissue. For quantitative assessment, it is important to perform the experiment in multiple independent biological replicates, i.e., at least ≥4 to enable statistical assessment. All steps should be performed in an RNase-free environment. Sample preparationa. In-vivo UV crosslinking to stabilize transient tRNA-protein interactions in cell culture (here HEK293T cells, hereafter named only HEK)Culture HEK cells in a 15 cm cell culture dish in DMEM supplemented with 10% FBS and 2.5 mM L-glutamine in 5% CO2 at 37°C.Note: For one experiment, approximately 20 million cells are required. However, for scarcely available cell culture material, as little as 6 million cells can be used. To prepare the cells for UV-crosslinking, aspirate the medium and gently add 5 mL of cold 1× PBS.Note: The PBS volume should be adjusted in each experiment. It should minimal, but suffient to cover the specimen or the surface of the plate in adherent cell culture. Place the cell culture plate on ice and illuminate with the UV light source (254 nm) of a crosslinker at 150 mJ/cm2 radiation.Note: In parallel, cells treated the same way without UV crosslinking (i.e., omitting Step 3) could be used as a control. Keep the cell culture dish on ice, gently aspirate the PBS solution, and add 800 µL of pre-cooled cell lysis buffer. Harvest the cells using a cell scraper and transfer them into a pre-cooled 1.5 mL Eppendorf tube.Using a 1 mL syringe with a 26-gauge needle, pass the lysate through eight times, to further shear open the cells and facilitate lysis.",
    "To obtain a clear lysate, centrifuge at 16,000 × g and 4°C for 10 min. This is the starting material for the IP (Step C-a).b. In-vivo UV Crosslinking to stabilize transient tRNA-protein interactions in tissue samples Note: To choose the most appropriate tissue for the experiment, one can refer to the Human Protein Atlas. In our experiment, we use brain tissue from 3- to 6-week-old CMT model mice (GarsC201R/+; Achilli et al., 2009) and compare it to wild-type littermates (i.e., mice expressing WT GlyRS (C57Bl/6J). GarsC201R/+ mice carry an ENU-induced dominant point mutation that causes a cysteine to arginine substitution at residue 201 of the GlyRS protein. Heterozygous stock colonies of GarsC201R mice were maintained in the C57Bl/6J background. One hemisphere of the mouse brain tissue was enough to obtain a sufficient amount of tRNA and GlyRS for the IP. For scarcely expressed proteins of interest, organs from several animals (preferably littermates) can be pooled. Flash freeze the freshly dissected brain tissue sample in liquid nitrogen and pulverize it in a pre-cooled CellCrusher tissue pulverizer. Transfer the pulverized tissue into a 3.5 cm cell culture dish placed on ice.Note: Use homogenous tissue powder, as clumps and bigger tissue chunks would limit the crosslinking effectiveness. Place the dish on an ice bath under the UV light source (254 nm) inside the UV crosslinker and apply 400 mJ/cm2 radiation.Note: Dependent upon tissue availability, a non-crosslinked control should also be used. Add 500 µL of cold tissue lysis buffer and mechanically shear by pipetting up and down, using pre-cooled wide-bore pipette tips (or 1,000 µL-pipette tips with the end cut out).Add an additional 500 µL of cold lysis buffer to the lysed tissue and agitate at 4°C for 1 h.",
    "Clear the lysate by centrifugation at 16,000 × g and 4°C for 10 min. This is the starting material for the IP (Step C-b).Preparation of magnetic beads and antibody couplingNote: Select magnetic beads according to the immunoglobulin (Ig) type of the antibody to be used for the IP. a. For the HEK cell lysate Use protein G-coupled Dynabeads®. Use 20 µL of the bead slurry for each antibody coupling reaction.Place the tube with the beads on the magnetic separator, wash twice with 500 µL of cold 1× PBS, and resuspend them in 50 µL of cell lysis buffer.Add 2 µg of the antibody to the beads and incubate on a tube rotator for 45 min at room temperature. Leave on ice while preparing the lysates (Step A-a).b. For the brain tissue lysate Use protein G-coupled Dynabeads®. Use 50 µL of the bead slurry for each coupling reaction.Prepare the beads by washing them twice with 500 µL of cold 1× PBS solution, and resuspend them in 100 µL of tissue lysis buffer.Add 4 µg of the antibody to the beads and incubate for 45 min on a tube rotator at room temperature. Leave on ice while preparing the lysates (Step A-b).Note: For our experiment in both cell culture and mouse tissue, we used a mixture of two different anti-GlyRS antibodies, which we mixed in equal amounts (e.g., 1 or 2 µg each for the HEK sample or mouse brain lysate, respectively). Using a mixture of antibodies from different suppliers enhances the IP reproducibility between various supplier charges. Immunoprecipitation (IP)Note: To determine the efficiency of the antibodies, we suggest to first perform the pulldown with more accessible material (e.g., cell culture), thereby optimizing the amount of the beads with coupled antibody and the IP incubation time.",
    "For incubation time, we recommend starting with 1 h, or a few hours, up to overnight incubation. The optimal incubation time will be the one at which the antibodies maximally retain the desired target, with minimal to no non-specific RNA bands detectable on an ethidium bromide stained denaturing polyacrylamide gel. a. For the HEK293 cell lysate Add the cleared supernatant obtained from Step 5A-a (approximately 800–900 µL) to the prepared beads (Step B-a3).Add 20 U of RNase inhibitor (SUPERase-IN) and rotate at 4°C for 2 h.Place the tube on a magnetic separator to separate the immunoprecipitated tRNA-GlyRS bound to the antibody-coupled beads. Carefully discard the supernatant.Wash the beads twice with 500 µL of 1× wash buffer for cell culture, and resuspend them in 500 µL of wash buffer for cell culture.Withdraw 10 µL of the IP reaction (beads) and keep on ice for protein quantification in Step E.Perform hot acid-phenol extraction of the remaining IP sample, directly on the beads, to denature the protein (here, GlyRS) and elute the bound tRNAs.Note: Briefly, the procedure for hot-acid phenol extraction: add one volume of acid phenol:chloroform (5:1, pH 4.5) pre-heated to 65°C and 0.1 volume of 10% SDS to the reaction, incubate for 5 min, followed by incubation on ice for 5 min. Centrifuge at 21,000 × g for 5 min, remove the aqueous phase and add equal volume of acid phenol:chloroform. Incubate at room temperature, followed by centrifugation at 21,000 × g for 5 min. Collect the aqueous phase and add equal volume of chloroform:isoamyl alcohol (24:1) and 0.1 vol of 3 M NaOAc (pH 5.5). Centrifuge at 21,000 × g for 5 min to collect the final aqueuos phase. Precipiate the RNA in the aqueous phase with isopropanol. Dissolve the recovered tRNA in 5 µL of sterile nuclease-free water.b.",
    "For the brain tissue lysate:  Add the cleared supernatant obtained from Step A-b4 to the prepared beads (Step B-b3).Add 20 U of RNase inhibitor and rotate at 4°C overnight.Place the tube on a magnetic separator to separate the immunoprecipitated tRNA-GlyRS-coupled beads. Carefully discard the supernatant.Wash twice with 500 µL of 1× wash buffer for tissue, and resuspend the beads in 500 µL of wash buffer for tissue.Withdraw 10 µL of the IP reaction (beads) and keep on ice for protein quantification in Step E.Perform hot acid-phenol extraction of the remaining IP to denature the protein (here, GlyRS) and elute bound tRNAs.Dissolve the recovered tRNA in 5 µL of sterile nuclease-free water.Identification and quantification of the bound tRNAs in the IPa. Detection Method 1: tRNA identification by northern blot Note: An in vitro transcribed tRNA of interest is required as a positive control. Here, tRNAGlyGCC was prepared by a standard T7-RNA polymerase run-off transcription reaction, using DNA template as described before (Albers et al., 2021). Two partly overlapping DNA primers were designed to cover the full-length tRNAGlyGCC, and the 5’ end of the forward primer bears the T7 promoter site (5’-TAATACGACTCACTATA-3’; Table 1). Both primers (100 µM each) were dissolved in 20 mM Tris-HCl (pH 7.5), denatured for 2 min at 95°C, and incubated for 3 min at room temperature, for their overlapping parts to anneal. Primer extension was performed for 40 min at 37°C, using 0.4 mM dNTPs and 4 U/μL RevertAid H Minus Reverse Transcriptase. The double-stranded DNA (dsDNA) was purified by phenol/chloroform and ethanol precipitation, and dissolved in DEPC-H2O. In vitro T7 promoter-based transcription of the dsDNA template was performed overnight at 37°C, with 0.6 U/μL T7 RNA polymerase in the presence of 2 mM NTPs, 5 mM GMP, and 1× transcription buffer.",
    "The transcribed tRNA was purified by denaturing polyacrylamide gel electrophoresis. tRNA was excised from the gel and eluted in crush and soak buffer rotating at 100 × g and 4°C overnight. Gel pieces were pelleted by centrifugation at 3500 × g for 5 min and tRNA was precipitated with ethanol. Table 1. Example of DNA primers for in vitro T7 promoter-driven synthesis of tRNAGlyGCC. The forward primer contains 5’ upstream of the tRNA transcription start site the T7 promoter (underlined).table:",
    "﻿0,1\nForward,5’-TAATACGACTCACTATAGCATCGGTGGTTCAGTGGTAGAATGCTCGCCTGCCACGCGGGC-3’\nReverse,5’-TGGTGCATCGGCCGGGAATCGAACCCGGGCCGCCCGCGTGGCAGGCGAGCATTCTA-3’\nTo prepare the RNA recovered from the IP sample (Step C-a7 or C-b7) for northern blot analysis, mix the sample with RNA loading dye, heat at 95°C for 3 min, and place it on ice.Load samples on a 10% denaturing polyacrylamide gel and run at 10 W for 30 min. In vitro synthesized tRNA is also loaded on the gel as a positive control (Figures 2A and 3A).Transfer RNA from the gel onto Hybond-N blotting membrane in pre-cooled 0.5× TAE buffer at 10 V and 4°C overnight.Immobilize the RNA to the membrane by illumiinating at 365 nm and 999.9 mJ/cm2 dosage.Hybridize the membrane with an Atto565-labeled DNA oligo probe (5 µL of 100 µM probe), recognizing the tRNA of interest in hybridization buffer at 28°C overnight.Note: If the tRNA-binding protein binds all tRNA isoacceptors of one tRNA family (that are all tRNAs recognizing different codons for a given amino acid, and thus aminoacylated with the same amino acid), we recommend using a mixture of probes to all isoacceptors. Here, we used two probes, including one with degenerate nucleotide sequence that recognizes all three tRNAGly isoacceptors (Table 2). Both probes were labeled with the same Atto-565 fluorophore. However, a mixture of probes labeled with separate fluorophores could have been chosen. Probes were fluorescently labeled at their 5’ ends by the manufacturer. Wash blots thrice with 6x SSC supplemented with 0.1% SDS.Wash once with 6× SSC.Wash once with 2× SSC.Wash once with 0.2× SSC.Image the blot on a ChemiDoc TM MP Imaging system.Table 2. Sequences of the Atto565-labeled DNA probes used in the northern blot experiment. One probe contains degenerate bases, thus recognizing both tRNAGlyCCC and tRNAGlyGCC. The probes are labeled at their 5’ ends with Atto565.table:\n﻿0,1\nProbe,Sequence\ntRNAGlyTCC,5’-CCCGGGTCAACTGCTTGGAAGGCAGCTAT-3’\ntRNAGlyCCC/GCC,5’-GYCTCCCGCGTGGSAGGCGAG-3’",
    "b. Detection Method 2: Quantification of the tRNA bound to GlyRS by fluorescent tRNA labeling Note: The IP (Step C) yields enough RNA for tRNA detection by northern blot and fluorescent quantification. Since the northern blot is performed only for tRNA identification, we recommend performing it in a single biological replicate, by loading the entire remaining extracted tRNA amount in multiple wells [e.g., 2 wells with equal amount of sample (Figure 2B)] onto the gels, and using them as multiple technical replicates, to average the signal in the fluorescent quantification step. Label the tRNA from Step C-a7 or C-b7 with fluorescently labeled RNA: DNA hairpin oligonucleotide specific to tRNA with the following sequence: 5’-pCGCACUGCdTdTdTCy3dTdTdGdCdAdGdTdGdCdGdTdGdGdN-3’ or pCGCACUGCdTdTdTAtto647dTdTdGdCdAdGdTdGdCdGdTdGdGdN-3’ (d, denotes deoxyribose or DNA nucleotide, and p is the 5’ monophosphate).For labeling, prepare the following labeling reaction: 1 µL of 10× T4 ligation buffer (NEB, #M0202), 1.5 µL of DMSO, 0.5 µL of Cy3-labeled 25-mer oligonucleotide (90 µM), 0.5 µL of T4 DNA ligase, and 1.5 µL of DEPC-H2O.Note: The fluorescently labeled RNA:DNA hairpin oligonucleotide is designed to basepair to the unique unpaired 3’-NCCA end of the tRNAs, and is used to specifically label tRNAs as described previously (Kirchner et al, 2017). Combine 5 µL of extracted tRNAs (Step C-a7 or C-b7) with 5 µL of the above labeling mix (Step D-a2 or D-b2) and incubate for 1 h at 25°C in the dark, to protect the fluorophores.Heat the ligation mixture at 95°C for 3 min and place it on ice immediately.Run it on a 10% denaturing-polyacrylamide gel at 10 W for 30 min in the dark.",
    "Visualize the tRNA on a ChemiDocTM MP Imaging System in the respective fluorescent channel, and save a good quality image for further quantification of the fluorescent tRNA bands (a representative image is shown in Figures 2B and 3B).Quantification of the GlyRS protein in the IP.Use the 10 µL of IP sample reserved in Step C-a5 or C-b5. Use the magnetic rack to separate the beads with the bound antibody and protein-tRNA complexes from the liquid phase.Add 10 µL of 1× SDS buffer to the beads and incubate at 50°C for 10 min by gentle shaking.Use the magnetic rack to collect the beads, and transfer the solution to a fresh Eppendorf tube—this eluent consists of the bound tRNA-interacting protein.Use the Jess automatic western blot system—a capillary-based automated western blot instrument—to quantify the protein (Figures 2C and 3C).Note: Jess (Protein Simple) is an automated high-throughput western blotting system, that combines capillary electrophoresis to separate proteins by mass and immunodetection by antibodies in chemiluminescent or fluorescent detection mode. A conventional western blot can also be used instead, though the automated Jess system offers much higher sensitivity. We used purified human wildtype GlyRS protein at varying concentrations to establish a standard curve. Wildtype GlyRS was cloned into pET28 vector and expressed in the Escherichia coli Rosetta strain. The GlyRS sequence was extended by two purification tags, 6xHis and SUMO. The protein was purified to homogeneity using two consecutive chromatography steps, i.e., Ni-NTA-based affinity purification, followed by cleavage of both tags, and purification by size-exclusion chromatography. The detailed purification protocol is described in Zuko et al. (2021). imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4335/bioprotoc-12-04-4335-g002.jpgFigure 2. Establishing of the experimental conditions and quantification of tRNA bound to GlyRS in HEK cells. A. Detection of tRNAGly bound to GlyRS by northern blot using Atto565-labeled probes recognizing all three tRNAGly isoacceptors.",
    "In vitro transcribed tRNAGlyGCC was loaded as a positive control and has a size of 74 nt. UV and no UV denote cells treated with UV and with no UV treatment, respectively. B. Quantification of tRNAGly bound to GlyRS with Cy3-labelled fluorescent stem-loop RNA/DNA oligonucleotide. The ligated tRNA product was monitored on a 10% denaturing polyacrylamide gel. Fluorescently labeled extended tRNAs have a size of 98 nt. C. Immunoblot of of the IP analyzed by Jess automated western blot and probed with antibodies recognizing GlyRS. Different dilutions of the IP reactions were analyzed. Protein weight markers are shown on the left in kDa. D. Quantification of tRNA bound to GlyRS. Note that HEK cells were used to optimize the protocol and, hence, performed as a single experiment. UV crosslinking increased the yield of tRNAGly bound to GlyRS.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4335/bioprotoc-12-04-4335-g003.jpgFigure 3. Quantification of tRNA bound to GlyRS in brain tissue from GarsC201R/+ mice (C201R-IP) and wildtype littermate (WT-IP). A. Detection of tRNAGly bound to mutant and wildtype GlyRS by northern blot using Atto565-labelled probes recognizing all three tRNAGly isoacceptors. In vitro transcribed tRNAGlyGCC was loaded as a positive control and has a size of 74 nt. B. Quantification of tRNAGly bound to GlyRS with Cy3-labelled fluorescent stem-loop RNA/DNA oligonucleotide. The ligated tRNA product was loaded on a 10% denaturing polyacrylamide gel. Fluorescently labeled extended tRNAs are with a size of 98 nt. C. Immunoblot of the Ips analyzed by the Jess automated western blot and probed with antibodies recognizing GlyRS. Different dilutions were analyzed. Protein weight markers are shown on the left in kDa. D. Quantification of tRNA bound to GlyRS and normalized to the tRNA/GlyRS ratio of wild-type mice, which is set as 100%. Data are shown as mean ± SEM (n=5 independent biological replicates)."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}