{
  "id": 16065,
  "origin_website": "Jove",
  "title": "Ex Vivo Hepatic Perfusion Through the Portal Vein in Mouse",
  "procedures": [
    "Experiments involving mice were handled in compliance with the University of Florida Institutional Animal Care and Use Committee (protocol number #201909320). The mouse strain used was C57BL/6J; all mice were male. This method is generally applicable for studies using other standard mouse strains as well. This surgery is optimally performed by two individuals working together.\n1. Initial set-up\nPerfuse livers with perfusate containing Krebs-Henseleit electrolytes6(25 mM NaHCO3, 112 mM NaCl, 4.7 mM KCl, 1.2 mM each of MgSO4, KH2PO4, and 0.5 mM sodium-EDTA, 1.25 mM CaCl2), 6 mM sodium lactate, 0.6 mM sodium pyruvate, 0.2 mM [U-13C] sodium propionate, 10% (v/v) D2O, and 0.63 mM mixed fatty acids (containing palmitic acid (22.1% of total), palmitoleic acid (5.2%), stearic acid (2.7%), oleic acid (27%), linoleic acid (37.7%), γ-linolenic acid (2.4%), and decosahexanoic acid (2.8%)) along with 2% (w/v) bovine serum albumin. Set final pH of perfusate to 7.3 using HCl (and NaOH, if necessary).\n2. Pre-surgery set-up\nAssemble two 1 mL syringes with a 23G needle which are 19.05 mm long. Fill one syringe with 0.01 mL of 1000 units/mL heparin and 0.19 mL of saline (0.9% (w/v) NaCl in water; Table 1).\nFill the second syringe with 0.2 mL of 2% lidocaine and 0.6 mL of 0.9% saline (Table 1). In another 1 mL syringe with a 27 G 38.1 mm needle, fill with the perfusate and maintain at 37 °C.\n3. Perfusate column set-up\nSet the glass bottle containing 500 mL of perfusate into the water bath (Figure 1B). Turn the water bath on and set the temperature to ~42 °C. The higher temperature in the water bath enables maintaining 37 °C in the perfusion column.",
    "Once the water heats up to 42 °C, turn on the two pumps to circulate the perfusate from the bottle throughout the thin film oxygenator and the water-jacketed 100 cm glass column (Figure 1A-E).\nTurn on the oxygenating gas (95% oxygen and 5% carbon dioxide) to pressurize the oxygenator7 (Figure 1C). Adjust perfusate column height to achieve a flow rate of 8 mL/min with the catheter attached (see step 9 for flow rate measurement)5,8,9.\n\t​NOTE: Flow rate refers to the rate at which perfusate is being expelled by the liver.\n4. Anesthetization of the mouse\nDon PPE as required by IACUC protocol and other appropriate safety guidelines.\n\tNOTE: The following steps have been optimized for mice that are 9 - 13 weeks old.\nPlace the mouse in the isoflurane chamber. Turn the delivery gas to 100% oxygen, a flow rate of 1 L/min, and the isoflurane to 2%10. Wait till breathing slows down and is steady.\n\tNOTE: For the mouse to reach a stable surgical plane, as evidenced by a slow and steady respiratory rate and lack of toe pinch reflex, the oxygen flow rate can be adjusted to ~1.5 L/min to ~3 L/min and the isoflurane concentration from 1 - 3%. The delivery rate of carrier gas and isoflurane concentration depends on the animal's age and weight and factors such as noise and light.\nDisinfect the abdomen with 70% alcohol. Administer heparin through a deep subcutaneous injection in the abdominal fat layer (Figure 2). Place the mouse back into the anesthesia chamber for 10 min.\n\t​NOTE: Shaving is not required as this procedure is terminal.\n5. Celiotomy\nTransfer the mouse from the anesthesia chamber to the surgery platform and place it in the supine position (Figure 3).",
    "Place the nose of the mouse into a nose cone and tape the paws down. Take care to not apply any strain on the neck that may lead to suffocation.\nAdminister lidocaine through a subcutaneous injection bilaterally in the anterior iliac crest region11 (Figure 3). Perform a toe pinch test to confirm the absence of all pain reflexes.\nPerform celiotomy to expose the internal organs (Figure 4). Make a 3 cm wide incision (the width of the entire abdomen of the mouse).\n\t​NOTE: Width will change with the age and diet of the mouse.\nExpand the incision by using a hemostat that pulls traction by clamping on the xiphoid process (Figure 4).\n6. Cannulation of portal vein\nUse a cotton-tipped applicator to clear the small and large intestines covering the portal vein. Position a silk suture under the arch of the portal vein proximal to the liver (Figure 4A).\nDepending on the anatomical structure, place the second silk suture proximal or distal of the inferior mesenteric vein distal from the liver (Figure 4A)12,13. Use a 2-0 suture for both sutures.\nOnce the sutures are in place, cannulate the portal vein with a 22G catheter14 (Figure 4B). When inserting the catheter, keep the bevel pointed up. Enter the portal vein at no more than a 15° angle.\nTie the first suture past the catheter tapper. After the portal vein is cannulated, anchor the catheter 2-3 mm distal from the branch of the portal vein with the silk suture (Figure 4B).\n\tNOTE: The assistant should roll shoulders and wrists to prevent dislodging the catheter or tearing of the portal vein. Each suture requires two knots.",
    "Next, secure the lower portion of the catheter with the second suture. With the help of the surgical assistant, tie a knot with the suture to secure the catheter to the distal portion of the portal vein and the surrounding tissue.\n7. Resection of liver post portal vein cannulation\nAfter the catheter is secured, insert a 1 mL syringe with a 27G needle which is 38.1 mm long into the catheter to flush blood and air bubbles.\n\tNOTE: There is usually a backflow of blood out of the catheter from the pressure.\nUse a 1 mm I.D. x 5 mm O.D. silicone tube with a fixed stopcock to couple the perfusion column (Figure 1A) to the catheter allowing the flow of the buffer into the liver marking the start of the perfusion. Start a timer at this point to mark the start of the perfusion.\nRelieve increased vascular pressure by making an incision, using scissors, into the inferior vena cava.\nConfirm flow of perfusate through the liver by observing the homogenous change in liver color from pink/red to a pale yellow. Once the flow is confirmed, excise the stomach, small intestine, large intestine, and the right kidney from surrounding tissue.\nWith the help of the surgical assistant, maneuver the liver around the abdominal and thoracic cavity as the surgeon cuts through the parietal peritoneum and thoracic tissue to resect the liver\nLastly, lift the liver upwards and cut the remaining connective tissues holding the liver in place with scissors. Slowly manipulate the liver for ease of view. Remove any fur that sticks to the liver by rinsing off with perfusate before encapsulating it within the NMR tube.",
    "NOTE: In this procedure, only the liver is removed. All other organs are left in the body of the animal. The bile duct can be removed based on the protocol of the experiment. Although for this experiment, it was left in place.\n8. Hanging the liver from the column\nOnce the surgeon hands the liver and tubing to the assistant, the assistant disconnects the tubing from the catheter and column.\nFill the catheter with perfusate until a meniscus is formed on the top of the catheter. Attach the catheter to the column for the liver to hang and perfuse.\n\tNOTE: The bead of perfusate on the catheter provides sufficient volume for the liver to function until its connected.The catheter attached to the liver is press fitted to the bottom of the column.\nScrew a 20 mm NMR tube onto the 100 cm glass column to encapsulate the liver (Figure 5). To avoid torsion of the liver and the portal vein, slowly screw on the NMR tube. If torsion does occur and flow is stopped, unscrew and rescrew the NMR tube. This will remedy the occlusion and flow will return.\nPerfuse the liver for 30-60 min based on the details of the study.\n\t​NOTE: Time is based on the perfusion experiment. For this experiment, metabolic turnover was measured within 30 min. The liver perfusion can take up to 10 min to reach a steady state. The time to steady-state starts once the inferior vena cava has been cut and hepatic flow is established.\n9. Flow measurement\nPlace a weigh boat on a top loading balance and zero the balance. Place the tubing from the roller pump pulling efferent perfusate from the NMR into the weigh boat and start the timer.",
    "Weigh the mass of liquid accumulated over 1 min which yields the flow rate of the liver. Place the tube back into the waste/collection container.\n10. Oxygen Measurement\nNOTE: Oxygen meter measurements were set up according to the manufacturer's instructions15.\nPlace the electrode containing 20 µL of 50% KCl saturated solution on the platinum dome and place five 10 µL drops around the lower platinum ring of the electrode.\nRemove the adhesive off the cigarette paper. Lay a piece of polytetrafluoroethylene membrane over the cigarette paper.\nPlace the two pieces on top of the electrode. Fit a small O-ring around the top of the electrode. Trim the paper to lay flat onto the lower platinum ring on the electrode.\n\tNOTE: Some overhang is acceptable. It's essential to cover the silver of the electrode.\nPlace the larger O-ring on the electrode. Couple the electrode to the water chamber and tighten the base to hold the electrode in place. Turn on the water bath and allow to heat up to 37 °C.\nOpen oxygen meter software. Click on Calibrate > Air-Saturated Water. Set stirrer speed to 75 and the temperature to 37 °C.\nFill a 50 mL vial halfway with water and shake vigorously for 2 min. This is air-saturated water, use it as 100% standard. Fill the oxygen meter chamber with ~2 mL of water and place the two-piece stopper on.\nClick Okay on the screen and allow the signal to plateau. Once the signal has reached a plateau, click Okay. Dispose of liquid in the chamber and dry with tissue paper.\nRepeat steps 10.6-10.7 but with 200 mM sodium sulfite (0% standard). Click on Save calibration.\n\tNOTE: No vigorous shaking is needed for the 0% standard.",
    "During perfusion, use two 5 mL syringes. One syringe for circulating perfusate (oxygen in) and the second for efferent perfusate from the NMR tube (oxygen out).\nWhen drawing up perfusate for both in and out measurements, draw 3-4 mL each time.\n\tNOTE: This column has glass tubing to allow for access into the NMR tube to withdraw the perfusate that has flowed through the liver.\nMeasure the circulating perfusate, first just as water in step 10.6 and dispose of in step 10.7. Repeat the same steps for the efferent perfusate.\nPerform oxygen measurements every 10 min.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}