{
  "id": 13711,
  "origin_website": "Jove",
  "title": "Initiating Differentiation in Immortalized Multipotent Otic Progenitor Cells",
  "procedures": [
    "1. Maintaining Self-renewal in IMOP Cells\nPrepare iMOP culture media: DMEM/F12, 1X B27 supplement, 25 µg/ml carbenecillin and 20 ng/ml bFGF. Make 50 ml of iMOP culture media using sterile reagents. Warm up 49 ml of DMEM/F12 in a 50 ml conical in a 37 °C water bath.\n\t\nThaw 50X B27 supplement and filter-sterilized 100 mg/ml carbenecillin aliquots for 5 min in a 37 °C water bath. Thaw out 100 µg/ml bFGF aliquot at RT. Add 1 ml 50X B27, 10 µl of 100 µg/ml bFGF and 12.5 µl of 100 mg/ml carbenecillin into DMEM/F12.\nUse 3 ml of media in a 60 mm tissue culture dish for culturing iMOP cells. Add fresh media to cultures every other day by doubling the volume of media. Ensure that concentration of bFGF does not drop below 5 ng/ml.\n\t\nCulture iMOP cells at 37 °C with 5% CO2. Passage cells after 5 - 7 days in culture as listed in the steps below. Transfer culture to a 15 ml conical using a 10 ml pipette tip.\nMake 1 mM EDTA in HBSS by diluting 0.1 ml of 0.5 M EDTA pH 8.0 into 50 ml of HBSS. Pre-warm 1 mM EDTA made in HBSS in a 37 °C water bath.\nHarvest cells by gravity sedimentation or centrifugation at 200 x g for 5 min. at RT. For gravity sedimentation, place the 15 ml conical containing the cultures in the 37 °C incubator for 5 - 10 min. After that time, observe the otospheres collect at the bottom of the 15 ml conical.\n\tNOTE: Excessive centrifugal force can cause cell damage.",
    "Carefully aspirate spent media using a 2 ml aspirating pipette without disturbing the cell pellet. Add 0.5 ml of pre-warmed 1 mM EDTA HBSS solution to cell pellet. Using a P1000 pipette, gently pipet up and down 2 - 3 times. Place conical at 37 °C and incubate for <5 min to facilitate dissociation into single cells.\nGently swirl the cell solution to determine if otospheres are dissociated. If no otospheres sediment to the bottom of the conical, the cells are dissociated. The time of incubation may vary.\n\tNOTE: Prolonged incubation with EDTA will result in excessive cell death.\nRemove cells from 37 °C, add 2 ml of media to neutralize and dilute the EDTA. Collect the cells by centrifugation at 200 x g for 5 min at RT. Aspirate out diluted EDTA using a 2 ml aspirating pipette and add 5 ml of 1X PBS to wash the cells.\nSpin cells down at 200 x g for 5 min at RT and aspirate out 1X PBS using a 2 ml aspirating pipette. Resuspend the cells using a P1000 pipette in 0.5 ml of iMOP culture media by gently pipetting up and down 2 - 3 times.\nCount cells using a microfluidic particle counter with the appropriate cassettes28. A confluent plate of iMOP cells will contain ~6 X106 cells. Dilute cells 1:100 in media and add 75 ul of cell solution into the cassette for counting. Plate 1 x 106 cells in a 6 cm dish in iMOP culture media (~1:10 dilution). Passage iMOPs every 5 - 7 days.\n\tNOTE: Cells that form large otospheres or attach to the bottom of the tissue culture dish will differentiate. Cells will also die if the cultures are over confluent.\n2. Freezing and Thawing IMOP Cells",
    "Prepare synthetic freezing medium by thawing and equilibrating the solution to 4 °C prior to freezing cells.\nCollect cells from a confluent 6 cm dish of iMOP cells. Use a 10 ml pipette and transfer cells (~6 - 8 x 106 cells) into a 15 ml conical.\nHarvest cells by gravity sedimentation or centrifugation at 200 x g for 5 min at RT. If the otospheres are small, cells will not settle by gravity sedimentation. Optional: Count cells using step 1.9 to determine total cell numbers.\nAspirate spent media using a 2ml aspirating pipette while leaving the loose cell pellet behind.\nAdd 0.25 ml of synthetic freezing media to resuspend cells at a density of ~5 x 105 to 3 x 106 cells/ml. Gently pipette cells with a P1000 pipette. Transfer the cell suspension to cryogenic vials using a P1000 pipette with 1 ml filtered tip.\nPlace the vials in an alcohol free freezing container and place the freezing container at -80 °C to reduce the temperature 1 °C per minute until the temperature reaches -80 °C.\nFor long-term storage of cells, transfer the vials to the vapor phase of a liquid nitrogen storage tank. To thaw out cells for culture, equilibrate cryogenic vial containing frozen cells at -80 °C.\nPre-warm iMOP culture media in a 37 °C water bath.\nThaw the frozen vial quickly by swirling the bottom of the vial in a 37 °C water bath. Add 1 ml of pre-warmed iMOP culture media to thawed cells once the last ice crystal disappears. Transfer cells into a 15 ml conical and add an additional 4 ml of iMOP culture media",
    "Spin the 15 ml conical for 5 min. at 200 x g and aspirate the spent media. Resuspend the cells in 2 ml of iMOP culture media and plate cells in a 6 cm dish. Incubate cultures at 37 °C with 5% CO2 for expansion.\n3. Differentiating IMOP Cells into Sensory Epithelia\nPrepare 50 ml of iMOP sensory epithelia differentiation media: DMEM/F12, 1X B27 supplement, 25 µg/ml carbenecillin. Make 50 ml of iMOP sensory epithelia differentiation media. Warm up 49 ml of DMEM/F12 in a 50 ml conical in a 37 °C water bath. Thaw 50X B27 supplement and 100 mg/ml carbenecillin aliquots for 5 min. in a 37 °C water bath. Add 1 ml 50X B27 and 12.5 µl of 100 mg/ml carbenecillin into DMEM/F12.\nTo harvest, dissociate, resuspend and count cells repeat steps 1.4-1.9\nPlate 1 x 106 cells in a 6 cm dish at Day -3 using iMOP culture media. On Day 0, transfer cultures using a 10 ml pipette into a 15 ml conical. Collect the otospheres by gravity sedimentation as stated in step 1.6. Aspirate out spent media using a 2 ml aspirating pipette and leave the otospheres on the bottom of the conical.\nGently add in 2 ml of sensory epithelia differentiation media. Transfer otospheres to a 6 cm dish using a large bore 10 ml pipette.\n\tNOTE: Mechanical shearing from harsh pipetting can dissociate cells from the otospheres.\nAdd 2 ml of fresh sensory epithelial differentiation media to cultures every other day. If necessary, cells can be collected by gravity sedimentation and media replaced.\nCollect otospheres at Day 10 by transferring to a 15 ml conical and allowing the otospheres to sediment as stated in step 1.6.Aspirate the spent media using a 2 ml aspirating pipette and leave the otospheres undisturbed.",
    "Fix otospheres by incubating in 4% formaldehyde in 1X PBS for 15 min at RT. Remove formaldehyde solution, wash otospheres with wash buffer (1X PBS containing 0.1% TritonX-100) before incubating in blocking buffer (1X PBS containing 10% normal goat serum and 0.1% Triton X-100) for 1 hr.\n\t\nReplace buffer and incubate samples in blocking buffer with diluted antibody. Incubate at 4 °C. Wash samples with 1X PBS containing 0.1% Triton X-100 subject the otosphere to immunostaining27. Transfer otospheres into 1X PBS and place otospheres into mounting media on a glass slide using a P1000 pipette. Put a coverslip over the sample and allow mounting media to dry at 4 °C.\nAcquire epifluorescence images using an inverted microscope setup equipped with a 16 bit CCD camera and either a 20X 0.75 air or a 40X 1.3 NA oil immersion objective. Collect fluorescence from different color channels using the listed (excitation and emission) wavelengths: blue (377 ± 25 nm/447 ± 30 nm), green (475 ± 25 nm/540 ± 25 nm), red (562 ± 20nm/ and 625 ± 20nm) and infrared (628 ± 20nm/ and 692 ± 20 nm).\n4. Assaying EdU Incorporation\nOn Day -3, plate 1 x 106 iMOP cells in a 6 cm dish. Three days later on Day 0, harvest, dissociate, resuspend and count cells by repeating steps 1.4-1.9.\nPlate 2.5 x 105 cells in iMOP culture media and 5 x105 cells in sensory epithelia differentiation media in different wells of a 6 well dish.\nDetermine the percentage of cells in S phase by EdU incorporation on day 3 by using an EdU incorporation assay\n\t\nAdd EdU stock directly to the iMOP cultures to obtain a final concentration of 1 µM EdU in the culture media.",
    "Incubate EdU in iMOP cultures for 2 hr and incubate at 37 °C with 5% CO2. Harvest, dissociate and collect cells repeat steps 1.4-1.9. Add in 4% formaldehyde in 1X PBS for 15 min. at RT to fix cells. Harvest cells by centrifugation at 200 x g for 5 min at RT. Remove formaldehyde solution and properly dispose.\nLabel nuclei of cells with Hoechst and incorporated EdU with green fluorescence dye-azide according to manufacturer's protocol.\n\t\tNOTE: All washes are done with 1X PBS, 3% BSA and 0.1% Tween 20. Wash cells with 1X PBS twice.\nMount cells on a slide using antifade reagent and place a 1.5 cover glass over the sample. Acquire fluorescent images of labeled cells using an epifluorescence microscopy.\n5. Differentiating IMOP-Derived Neurons\nMake 50 ml of neuronal differentiation media: Neurobasal media, 1X B27 supplement, 2 mM L-Glutamine. Thaw bottle of 50X B27 and 200 mM L-Glutamine in 37 °C water bath for 5 min. Add 1ml 50X B27 and 0.5 ml 200 mM L-Glutamine to 48.5 ml of Neurobasal media.\nCoat coverglass by placing 12 mm round 1.5 glass coverslips in a sterile 10 cm plate and add 70% EtOH to the plate to sterilized and clean the coverslips.\nGently agitate the coverslips to ensure they are covered in ethanol. Leave the plate for 10 min at RT. Rinse the coverslips 3 times with sterile 1X PBS to wash out the remaining ethanol. Rinse the coverslip once with sterile H20 to wash out remaining 1X PBS.\nAspirate the H20 using a 2 ml aspirating pipette and let the coverslips dry. Expose the coverslips to UV light in the tissue culture hood for 15 min. Store coverslips in a sterile environment if not immediately used.",
    "Place one 12 mm round coverslip in each well of a 24 well dish. Shake plate gently to ensure that the coverslips lie flat on the bottom of the well.\nThaw 2 mg/ml poly-D-lysine stock solution at RT and dilute to a 10 µg/ml poly-D-lysine concentration in 1X PBS. Add 0.25 ml of 10 ug/ml poly-D-lysine to the wells. Leave the plate in the 37 °C incubator for 1 hr.\nWash the wells 3 times with sterile 1X PBS. Thaw 10 mg/ml laminin stock solution at RT and dilute to 10 µg/ml in 1X PBS. Add 0.25 ml of 10 µg/ml laminin working solution into a single well of a 24 multi-well dish. Incubate the plate at 37 °C incubator. Aspirate out the laminin solution using a 2 ml aspirating pipette.\nWash the coverslip 3 times with 1X PBS by adding in 1 ml of 1X PBS with a P1000 pipette and removing the 1X PBS by aspirating with a 2 ml aspirating pipette. Leave 1X PBS from last wash in the well until cells are ready to be plated. Initiate neuronal differentiation by harvesting, dissociating and counting cells in steps 1.4-1.9.Plate 1 x 106 cells in a 6 cm dish at Day -3.\nOn Day 0, harvest, dissociate and count cells by repeating 1.4-1.9. Seed 1 x 105 - 1.5 x 105 iMOP cells into 0.5 ml pre-warmed neuronal differentiation media per well in a 24 multi-well dish. Aspirate and add pre-warmed neuronal differentiation media to cultures every other day.\nFix iMOP-derived neurons in 4% formaldehyde for 15 min. at RT on Day 7. Remove formaldehyde solution, wash iMOP-derived neurons with wash buffer (1X PBS containing 0.1% TritonX-100) before incubating in blocking buffer (1X PBS containing 10% normal goat serum and 0.1% Triton X-100) for 1 hr.",
    "Replace buffer and incubate samples in blocking buffer with diluted antibody. Incubate at 4 °C. Wash samples with 1X PBS containing 0.1% Triton X-100 subject cells to immunostaining27. Wash the coverglass with 1X PBS before placing onto mounting media. Allow the mounting media to dry at 4 °C before acquiring epifluorescence images as listed in step 3.8.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}