{
  "id": 18614,
  "origin_website": "Jove",
  "title": "Mouse Model of Alloimmune-induced Vascular Rejection and Transplant Arteriosclerosis",
  "procedures": [
    "All the protocols in this study were reviewed and approved by the Simon Fraser University animal care ethics committee. Use Balb/cYJ (H2d) donor mice and C57Bl/6 (H2b) recipient mice to examine allogeneic reactions. Mice are used for experiments between the ages of 8 to 12 weeks. Use either female or male mice. Syngeneic controls consist of aortic segments from C57Bl/6 donors into C57Bl/6 recipients.\n1. Donor and Recipient Preparation\nNote: Both the donor and recipient are anesthetized and prepared before the surgery to minimize ischemia of the graft. Injectable anesthetics are used in the protocol to prevent obstruction of the animal by equipment needed for the delivery of inhaled anesthetics. However, if desired, inhaled anesthetic is an appropriate alternative. From the initial injection of the anesthetics, the entire procedure takes approximately 90 min to complete. Ischemic time of the graft is less than 30 min.\nAnesthetize the mouse with intraperitoneal injections of ketamine (100 mg/kg; 10 mg/ml) and xylazine (10 mg/kg; 1 mg/ml). The mouse will be sedated within 10 to 15 min. Assess the depth of anesthesia by pinching the fatty part of the animal foot pad. Administer 1/3 of the original dose of the anesthetic cocktail, as needed, until the animal does not exhibit withdrawal reflex. Monitor the respiratory rate closely after every cocktail is administered. During surgery, assess the level of anesthesia every 15 min by pinching the anterior abdominal wall with a pair of forceps. The mice should remain deeply anaesthetized for 60 to 90 min.\nLubricate the mouse’s eyes with an ophthalmic ointment to prevent dryness while under anesthesia.",
    "Shave hair as close to the skin as possible on the abdominal ventral region from the mid-thorax to the pubis. Be particularly careful not to nick any skin. Do not use depilatory cream because it may be absorbed into the skin and could be inflammatory.\nPlace the animal in supine position on a towel above the heating table or pad.\nClean the surgical site with a preliminary scrub with 2% chlorohexidine. Prepare a large working area to maximize the surgical field. Start scrubbing at the center of the surgical site and move to the outside in a linear or circular manner. Dispose of the gauze. Repeat this procedure at least 5 more times. Apply an alcohol prep pad to the same area. Once the alcohol is dry, prepare the clean area with Betadine solution and drape with sterile gauze.\n2. End-to-end Anastomosis Procedure\nDonor Operation\n\t\nMaintain aseptic technique throughout the operation. Clean all countertop and surgical table surfaces with 0.5% accelerated hydrogen peroxide solution prior to use. Wrap and autoclave all surgical instruments, gauzes, drapes and gowns prior to use. Verify sterility of the instruments with a steam sterilizer indicator strip placed in each pack. Sterile surgical gloves are used and disposed of between surgeries. For multiple surgeries, sterilize the surgical instruments between uses with the hot glass bead sterilizer.\nPlace the donor mouse in a supine position on a clean, thin Plexiglas board wrapped with sterile drape under the operating microscope at 8-30X magnification.\nAfter ensuring adequate surgical anesthesia as outlined in section 1.1, proceed with surgery.\nUsing sterile scissors, make a single midline lower longitudinal abdominal incision, from the pubis to the xyphoid process.\nUsing a small retractor, open the abdominal walls to expose the cavity.",
    "Using sterile cotton tipped applicators, gently retract the intestines superiorly to the animal’s left and cover with gauze moistened with saline solution. Move the reproductive organs inferiorly and locate the infrarenal aorta and the inferior vena cava (IVC). Moisten the exposed tissues periodically with saline solution.\nUsing the medical No. 5 forceps, separate the aorta from the IVC, from the level of the left renal artery to the bifurcation. Use 10-0 polyamide monofilament sutures to ligate the small branches near the aorta.\nOnce the donor’s aorta has been separated from the IVC, saturate the vessel with saline, cover the exposed cavity with moistened gauze and set the donor aside onto a sterile area. Check the status of the donor (respiratory and cardiovascular function, and depth of anesthesia) every 15 min. Begin operating on the recipient, isolating the aorta as described below (Steps 2.2.1 to 2.2.7).\nOnce the recipient aorta has been separated from the IVC and set aside, return the donor under the microscope. Cross clamp (proximal and distal to the segment of interest) the donor aorta, approximately 5 mm apart, with two 4 mm microvascular clamps.\nUsing the Vannas-Tubingen microscissors, transect a small graft segment (3 to 4 mm in length) of the abdominal aorta.\nUsing a 25 G 5/8 needle attached to a syringe, flush the excised aorta with heparinized (100 U/ml) saline solution. Ensure the tip of the needle does not come into contact with the vessel.\nPlace aorta in heparinized (100 U/ml) saline solution on ice and set aside. While still under deep anesthesia, release the microvascular clamps. Euthanize the donor by exsanguination.",
    "Implant the donor vessel within 30 min of excision. Although it is possible to use one donor vessel for multiple recipients by excising a larger length of aorta, keep the ischemic time to less than 30 min.\nRecipient Operation\n\t\nMaintain aseptic technique throughout the operation, as in donor operation.\nPlace the recipient mouse in a supine position on a thin Plexiglas board wrapped with sterile drape under the operating microscope at 8-30X magnification.\nAfter ensuring adequate anesthesia, proceed with surgery when the animal does not exhibit withdrawal reflex.\nUsing sterile scissors, make a single midline lower longitudinal abdominal incision, from the pubis to the xyphoid process.\nUsing a small retractor, open the abdominal walls to expose the cavity.\nUsing sterile cotton tipped applicators, gently retract the intestines superiorly to the animal’s left and cover with gauze moistened with saline solution. Move the reproductive organs inferiorly and locate the infrarenal aorta and the IVC. Moisten the exposed tissues periodically with saline solution.\nSeparate the aorta from the IVC, from the level of the left renal artery to the bifurcation. If necessary, use 10-0 polyamide monofilament sutures to ligate the small branches near the aorta.\nCross clamp (proximal and distal to the segment of interest) the aorta, approximately 5 mm apart, with two 4 mm microvascular clamps.\nUsing the Vannas-Tubingen microscissors, make a single horizontal aortotomy and resect a small segment (no more than 0.5 mm) of the abdominal aorta to accommodate the donor aortic graft.\nFlush the excised aorta with heparinized (100 U/ml) saline solution. The donor aortic graft should be of appropriate length to connect the recipient’s transected aortic ends.\nPlace the donor aortic graft in the orthotopic position and anastomose the donor’s graft end to the recipient’s end, matching the respective graft anatomical orientation with that of the recipient.",
    "Gently grasp the tunica externa of the vessel and evert it slightly using the medical No.5 forceps. Using the forceps, drive the needle attached to the 10-0 polyamide monofilament suture through the full thickness of the vessel wall in order to secure the donor aortic graft to the recipient’s resected vessel. Take care to ensure that the vessel opening is not closed off due to inadvertent stitching of the back wall of the vessel.\nFor continuous stitches, place stay sutures at 9 o’clock in both the upper and lower ends of the graft. Starting at the upper end of the graft from 3 o’clock, anastomose the resected ends with 2 running sutures and secure the suture to the stay suture.\n\t\t\nFlip the graft over and continue the running suture to dorsal part of the vessel, meeting the origin stay suture. Secure without applying much pressure on the vessel. Repeat the suturing for the lower anastomosis.\n\t\t\tNote: The interrupted sutures start the same way as the continuous suture with the exception that the vessel is anastomosed with three separated stitches between the stay sutures. Anastomosis time is usually 20 min.\nOnce the anastomosis is complete, release the distal microvascular clamp to allow retrograde blood to flow and check for leakage of the anastomosed sites. If there is a leakage, immediately place a stitch to close the defective site. If there is no bleeding at the sites, then release the proximal clamp.",
    "Examine the transplant and check that there is no blood obstruction in the graft, and the proximal and distal portion of the recipient’s vessel. Vigorous pulse pattern in both the donor’s and recipient’s vessel is a primary indication that the blood is flowing freely. Using the pair of forceps, gently grasp one end of the stay sutures and slightly evert the vessel to inspect the back wall of the vessel.\n\t\tNote: There should be no puckering of the vessel wall at both ends of the anastomosed sites. Poor blood flow after removal of the clamps is a sign of thrombosis.\nUsing cotton tipped applicators, return the intestines into the abdominal cavity.\nWith the Castroviejo needle holder and Graefe forceps, close the abdominal wall with 5-0 polypropylene sutures using continuous stitching. Close the skin layer with the same sutures using subcuticular closure.\nAdminister Torbugesic (1 mg/kg) i.m. immediately upon completion of the transplant.\nGive immediately, in the order, Atipamezole (1 mg/kg), ketoprofen (5 mg/kg) and warmed Lactated Ringer’s solution subcutaneously.\nImmediately after surgery, place mice in a heated cage under a water blanket overnight (12 hr). During the anesthetic-recovery period, place the animals alone in a clean, dry unobstructed area. Line the cage (autoclaved) with clean paper towels and adjust the temperature of the water blanket to approximately 20 to 22 °C. Provide dry and wet kibbles ad libitum on the cage floor.\n\t\tNote: An important component of post–surgical care is the observation of the animal and appropriate intervention, as required, during recovery from anesthesia and surgery. The necessary intensity of monitoring will vary with the animal and might be greater during the immediate anesthetic recovery period as compared to later in postoperative recovery.",
    "Continually monitor animals having undergone anesthesia monitored until they recover completely. The animal must be able to maintain unassisted sternal recumbency and it must appear calm and free of pain before it can be left unattended.\nGive Buprenorphine (0.1 mg/kg BID) and ketoprofen (5 mg/kg SID) for a period of three days, both subcutaneously.\nMonitor cardiovascular and respiratory function, body temperature, and postoperative pain or discomfort during recovery from anesthesia for a minimum of three days. Additional care may be required, such as administration of analgesics and other drugs, and parenteral fluids to minimize dehydration and electrolyte loss.\nAssess the success of the transplant surgery by observing the motor function of the hind limbs. Complete success of the transplant involves unobstructed blood flow to the hind limb and tail, which should be immediate upon recovery of the animal, and complete recovery with no paralysis of the hind limbs on the second day\n3. Tissue Collection\nNote: Pre-determined end points range from 3-60 days depending on the type of analysis desired and the nature of the antigen mismatch. Generally, intimal thickening is robust at day 30 after transplantation across complete MHC mismatched mouse strains.\nAnesthetize the mouse with intraperitoneal injections of ketamine (100 mg/kg; 10 mg/ml) and xylazine (10 mg/kg; 1 mg/ml). Assess the depth of anesthesia by pinching the fatty part of the animal foot pad. Proceed with surgery when the animal does not exhibit withdrawal reflex.\nClean the surgical site with water and ending with 70% alcohol.\nPlace the animal in supine position on a tray lined with absorbent pad.\nOpen the abdominal cavity with a large midline longitudinal incision. Place a self-retaining retractor to expose the cavity, the IVC and the abdominal aorta.",
    "Gently separate the transplanted donor aortic segment from the neighboring IVC using a pair of medical No. 5 forceps. Be particularly careful not to strip the adventitia of the transplanted vessel.\nExpose the thoracic cavity by cutting through the ribs along both sides of the thoracic spine all the way to the thoracic inlet. Reflect the anterior chest wall superiorly to expose the pericardium and secure the ribcage with a pair of hemostat.\nOnce the heart is exposed, insert a 25 G 5/8 needle (attached to a syringe) into the left ventricle and flush with 0.1 ml of heparinized (100 U/ml) saline solution.\nUsing a pair of scissors, remove the right atrium to allow the blood, heparinized saline, and fixative to leave the body during perfusion. Perfuse the animal with 5 ml of 4% paraformaldehyde or until the fluid runs clear. Remove the heart to ensure euthanasia.\nExcise transplanted vessel segment and immerse in 4% paraformaldehyde for no more than one hour. Set the transplanted vessel in OCT (optimal cutting temperature) matrix and flash freeze. Section the vessel under a cryostat set at 8 um thickness. Stain sections with Haematoxylin & Eosin and/or Verhoeff-van Gieson (van Gieson) elastic stain.\n4. Morphological Analysis of Grafts\nNote: TA is characterized by intimal thickening 13. In this model, intimal thickening and a resultant reduction in the size of the lumen are reflective of the severity of immune-mediated vascular injury. Syngraft controls are used to determine the baseline characteristics of vessels in the absence of allogeneic immune responses. These controls also permit evaluation of arterial damage that occurs as a result of the surgical procedure. There should be no intimal thickening in syngrafts.",
    "To examine intimal thickening and luminal occlusion, measure the area within the endothelial cell layer, internal elastic lamina (IEL) and external elastic lamina (EEL) on elastic van Gieson stained artery segments with an image analysis software. The parameters below can be used to determine arterial changes reflective of TA.\n\t\nMeasure the absolute intimal area: area within the internal elastic lamina - the area within the endothelial cell layer. This provides an absolute measurement of intimal expansion, which is the hallmark of TA.\nMeasure the absolute medial area: area within the external elastic lamina - area within the internal elastic lamina. This provides an absolute measurement of medial degradation or growth, which can occasionally occur as a result of immune-mediated changes to this region of the vessel wall.\nMeasure the total vessel area as the area within the external elastic lamina. This provides a measurement of vessel remodelling which involves expansion or constriction of artery as a result of immunological damage.\nMeasure the intima/Media: (area within the internal elastic lamina – area within the endothelial cell layer) / (area within the external elastic lamina – area within the internal elastic lamina). This provides a relative measure of intimal expansion and normalizes for differences in vessel size.\nMeasure the % Luminal Narrowing: [ (area within the internal elastic lamina – area within the endothelial cell layer) / area with the internal elastic lamina) ]*100. This provides a measure of the extent of luminal occlusion, which results from a combination of intimal expansion and remodeling (inward or outward) of the vessel wall.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}