{
  "id": 6863,
  "origin_website": "Bio",
  "title": "Precise Targeting of Single Microelectrodes to Orientation Pinwheel Centers",
  "procedures": [
    "Animal Preparation ProceduresDetailed descriptions of procedures for animal surgery and anesthesia can be found in previous studies (Song and Li, 2008).Anesthetize cats before surgery with ketamine hydrochloride (30 mg/kg), and then perform endotracheal intubation and venous cannulations. After surgery, the animal was placed in a stereotaxic frame for performing a craniotomy and conducting neurophysiological procedures. During recording, maintain anesthesia (urethane 20 mg/kg/h), paralysis (gallamine triethiodide 10 mg/kg/h), and blood sugar and fluids (glucose 200 mg/kg/h in Ringer’s solution 3 ml/kg/h i.v.). Monitor continuously heart rate, electrocardiography, electroencephalography (EEG), end-expiratory CO2, and rectal temperature. Anesthesia is considered to be sufficient when the EEG indicates a stable sleep-like state marked by sleep spindles. Reflexes, including cornea, eyelid, and withdrawal reflexes are tested at regular intervals.The eyes are prepared for vision experiments: Retract nictitating membranes and dilate the pupils using 1% atropine sulfate eyedrops. Apply contact lenses and use additional corrective lenses to achieve focus of the retina on a computer monitor in front of the animal.Perform a craniotomy and durotomy above area 17 (V1) and cement a stainless steel chamber on the surrounding skull. To dampen cortical pulsations, either seal the chamber with a cover glass and fill with silicone oil, or cover cortex with 4% agar and a cover glass.At the end of the experiment, sacrifice the animal by an overdose of barbiturate administered intravenously (dosage, 5 ml, 6% barbiturate).Optical Imaging ProceduresPosition camera and lens over the optical window. Crude positioning of the camera was enabled using a homemade camera arm to which a micromanipulator with 100 millimeter of freedom (manually adjust x, y, z position). Fine positioning of the camera was achieved by electrically adjusting the x, y, z position (10 millimeter freedom) and the declination angle α (45 degree freedom) with a micromanipulator platform.",
    "The optical instrument is a 14-bit video camera (Andor Technology, Northern Ireland) equipped with two front-to-front connected 50 mm Nikon lenses.Illluminate the cortical surface as evenly as possible using green light (546 nm) illumination. Obtain a reference image of the blood vessel pattern (see Figure 2A).Focus the camera ~400 μm below the surface of the cortex and collect optical images using red light illumination (605 nm, a wavelength optimal for hemodynamic oximetry signals).Obtain orientation preference maps. The intrinsic signals were recorded in response to binocularly viewed full-screen, high-contrast (100%) sinewave gratings. The main set of stimuli included drifting gratings, presented at 8 equally spaced orientations, in both directions (16 conditions). Each stimulus was presented 20 times for 9 s followed by an inter stimulus interval of 16 s. The visual stimuli were generated by a Cambridge Systems VSG graphics board. Stimuli were presented on a high-resolution monitor screen (40 × 30 cm) at a 100 Hz vertical refresh rate. The screen background was maintained at the identical mean luminance as the stimulus patches (10 cd/m2). The monitor was placed 57cm from the animal’s eyes.Generate colored-coded orientation preference maps (Figure 2B) via pixel-by-pixel vector summation of the 8 orientations (Bonhoeffer and Grinvald, 1991). In some experiments, drifting gratings were presented at 16 equally spaced orientations (at 11.25° intervals).Carefully choose only highly accurate and reproducible maps. That is, first generate maps from different subsets of trials. Then select only maps in which there is no displacement (shifted by no more than 13-26 μm) of pinwheel centers. These are deemed acceptable (Mariño et al., 2005).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603030204_9296.jpgFigure 2. Highly accurate and quantitative determination of PC locations. A. Vascular pattern of the cortical surface. B. The color-coded orientation map of the cortex in (A). C.",
    "Two neighboring pinwheel centers (PC, locations 1 and 2) and three evenly spaced intervening points (DP, domain point, location 3; DM, domain midway, locations 4 and 5) in the orientation domain. The eight stimulus orientations are color coded at 22.5° intervals. Scale bars in (A) and (B): 500 μm. Scale bar in (C): 100 μm.Electrophysiological Recording ProceduresSingle unit isolationInsert and advance the electrode through the cortex, and record the signals using the Cerebus System.Spike signals were band-pass filtered at 250-7,500 Hz and sampled at 30 kHz. Only well-isolated cells satisfying the strict criteria for single-unit recordings (fixed shape of the action potential and the absence of spikes during the absolute refractory period) are selected and saved for further analyses.Single unit functional characterizationAll cells recorded were located in the area of the cortex representing the central 10° of the visual field. When the single-cell action potentials were isolated, the preferred orientation, SF, and TF of each cell were determined. Each cell was stimulated monocularly through the dominant eye, with the no dominant eye occluded. To locate the center of the CRF, a narrow rectangular sine wave grating patch (0.5° to 1.0° wide, 3.0° to 5.0° long, 100% contrast) was moved at successive positions along axes perpendicular or parallel to the optimal orientation of the cell, and the response to its drift was measured.The grating was set at the optimal orientation and SF and drifted in the preferred direction at the optimal speed for the recorded cells. The peak of the response profiles for both axes was defined as the center of the CRF.",
    "We determined the size of the CRF by performing an occlusion test, in which a mask consisting of a circular blank patch and centered on the CRF was gradually increased in size on a background drifting grating (Song and Li, 2008).LFP recordingObtain the orientation tuning of LFP signals.Present visual stimuli for LFP recordings (10° sine wave grating at 50% contrast), and pseudorandom sequences of gratings of varying orientation and spatial phase, each flashed for 32 ms.To analyze stimulus-evoked LFP responses, filter the recordings between 3 Hz and 100 Hz, and compute z scores by averaging responses across trials (for more detail, please see Figure 1 in Katzner et al. [2009]).Procedure for Determining Pinwheel Centers AccuratelyThe following 3 steps ensure high accuracy of targeting PCs. (1) Identifying preliminary PC locations based on blood vessel maps. (2) Ensuring perpendicularity of electrodes. And (3) Selecting sites based on ‘non-sine-like’ LFPs.Preliminarily identify pinwheel centers based on surface blood vessel pattern aligned to the orientation map (see Figures 2A and 2B).Make electrode penetrations perpendicular to the cortical surface. To ensure that the electrode penetration is perpendicular to the cortical surface, extra effort must be expended (Figures 3A-3C). First, to ensure the camera’s angle is exactly perpendicular to the plane of the cortex, image a large field of view (e.g., 1 cm) with a narrow depth of field (~50 μm, front-to-front lens with f1.2 [Ratzlaff and Grinvald, 1991]). We then obtain α value of the declination angle (α, shown in Figure 3D). Adjusted the declination angle of clamping device (clamp electrode) in Narishige stereotaxic instrument (whose mechanical accuracy is about 10 µm), made it equaling to α value, to ensure the electrode parallels exactly the axis of optical imaging.",
    "Using this procedure, we have estimated that the deviation of electrodes from perpendicular is less than 2 deg (shown in Figure 3D).imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603030225_8744.jpgFigure 3. Illustration of electrode deviation from perpendicular. A. The yellow dots are the positions of 10 penetrations. Orange frame is the ROI (region of interest) in B. B. With the fine-tipped electrodes, there is a very little cortical deformation when the electrode is inserted. Scale bars in (A) and (B): 500 μm. C. We designed a lens (105-mm) with a close-up tube producing a working distance of 17 centimeters, which allows enough distance to make electrode penetrations obtaining images. D. The electrode was kept parallel to the optical axis by aligning the electrode at exactly the same angle as the CCD camera holder. The angle between the optical axis and the line perpendicular to the cortex (Δα) is Δα =actan (field_depth/field_length). As our depth of field is about 50 μm and the field of view is several millimeters, then we estimate Δα is less than 2 deg.Selecting sites based on ‘non-sine-like’ LFPsMake a penetration at or near presumed PC within the superficial layers (depth < 600 μm) and record the LFP orientation tuning curve and fit with sinewave function. Then calculate the non-sine-like index (NSI) of this sinewave. See Data analysis. Repeat this for several penetrations within the very local region (about 200-500 μm diameter area around the preliminary PC) until a non-sine-like LFP curve is obtained (NSI > 0.10). Explanation: Based on our recent work (Li et al., 2019), we demonstrated that true PCs have ‘non-sine like’ LFPs (NSI > 0.1), while locations away from PCs exhibit ‘sine-like’ LFPs (Li et al., 2019). Figures 4A and 4B shows a ‘false’ PC site.",
    "The recorded LFP orientation tuning curve (4A) is sine-like (NSI = 0) and several single unit recordings in this penetration (4B) have low orientation scatter (MOS = 18°). Figures 4C and 4D shows a ‘true’ PC site. The recorded LFP orientation tuning curve (4C) is non–sine-like (NSI = 0.34) and several single unit recordings (4D) have high orientation scatter (MOS = 65°), a consistent marker of PCs (Maldonado et al., 1997). Across 26 sites, we showed there is a strong positive relationship between NSI and MOS (shown in the Figure 1F in reference [Li et al., 2019]; when the NSI > 0.1, the MOS > 60°). Thus an LFP of NSI > 0.1 provides precise localization of the pinwheel center.imgsrc:https://en-cdn.bio-protocol.org/attached/image/20200603/20200603030243_1442.jpgFigure 4. Comparison of LFP and single unit recordings in true PC site and false PC site. A. Examples of the sine-like LFP orientation tuning at the false PC site (NSI = 0, highly sine-like). B. Single unit recordings (four neurons) in same penetration as A. The MOS among these cells is 18°. C. An example of the non-sine-like LFP orientation tuning curve at the true PC site (NSI = 0.34). D. Single unit recordings (four neurons) in the same penetration as C. The MOS among these cells is 65°.Record the position of the non-sine-like site. This is the first PC position (point 1 in Figure 2C).Repeat Steps D3a-D3b, and obtain an adjacent PC position (point 2 in Figure 2C).Procedure for Determining DP and DM PositionsDetermine domain point (DP) by calculating the geometric midpoint of the two PCs identified in Step D (see Figure 2C).Determine domain midway (DM) by calculating the geometric midpoint of PC and DP (see Figure 2C).Note: DM and DP are non-PC sites and both have sine-like LFPs.",
    "Proceed with Electrophysiological Study of Orientation SubdomainsOnce these key orientation domain anchors (PC, DP, DM) are determined, continue with electrophysiological characterization of orientation subdomains."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}