{
  "id": 17267,
  "origin_website": "Jove",
  "title": "Voltage-Dependent Potassium Current Recording on H9c2 Cardiomyocytes via the Whole-Cell Patch-Clamp Technique",
  "procedures": [
    "The commercially obtained H9c2 rat cardiomyocytes (see the Table of Materials) were incubated in DMEM containing 10% heat-inactivated fetal bovine serum (FBS) and 1% penicillin-streptomycin at 37 °C in a 5% CO2 humidified atmosphere. The whole-cell patch-clamp technique was then employed to detect the changes in IKv in normal H9c2 cells and 4-AP- or AC-treated cells (Figure 1 and Figure 2).\n1. Solution preparation\nPrepare the DMEM cell culture medium containing 10% FBS and 1% penicillin-streptomycin (see Table of Materials).\nPrepare 1.5 M 4-AP solution by adding 14.1165 mg of 4-AP to 100 µL of DMSO solution (see Table of Materials). Dilute 1.5 M 4-AP to 1.5 mM by adding the extracellular solution (step 1.5).\nPrepare 400 mM AC by adding 5 mg of AC to 19.36 µL of DMSO solution (see Table of Materials).\n\tNOTE: All the above solutions were stored in a 4 °C refrigerator, and the final concentration of the DMSO must not exceed 0.1% (v/v).\nPrepare 50 mL of intracellular solution by adding 0.4100 g of KCl (110.0 mM), 0.0120 g of MgCl2 (1.2 mM), 0.1270 g of Na2 ATP (5.0 mM), 0.1190 g of HEPES (10.0 mM), and 0.1900 g of EGTA (10.0 mM) into 50 mL of double-distilled water (see Table 1 and Table of Materials).\n\tNOTE: The pH value of the intracellular solution was adjusted to 7.2 using 1 M KOH and was aliquoted into small volumes (1.5-2 mL) and stored at −20 °C.\nPrepare 50 mL of extracellular solution by adding 0.0185 g of KCl (5.0 mM), 0.3945 g of NaCl (135.0 mM), 0.0203 g of MgCl2·6H2O (2.0 mM), 0.0595 g of HEPES (5.0 mM), and 0.0990 g of D-glucose (10.0 mM) into 50 mL of double-distilled water (see Table 1 and Table of Materials).",
    "NOTE: The extracellular solution must be prepared for immediate use, and its pH value needs to be adjusted to 7.4 by using 1 M NaOH.\n2. Cell culture\nOnce the H9c2 culture dish becomes 80% confluent, digest the cells with 0.25% trypsin for 30 s.\nCulture 2 x 105 cells/mL with normal medium or drug-containing medium (25 µM, 50 µM, 100 µM, and 200 µM AC) in a 35 mm dish carpeted with glass plates for 24 h at 37 °C, with a 5% CO2 atmosphere and 70% to 80% relative humidity (see Table of Materials).\n3. Fabrication of micropipettes\nTurn on the micropipette puller (see Table of Materials), and preheat for 30 min.\nPut a borosilicate glass capillary with a filament (OD: 1.5 mm, ID: 1.10 mm, 10 cm length) on the micropipette puller. Select the program set in step 3.3, and click on Enter on the control panel. Click on the Ramp program in the upper-right corner to determine the \"Heat\" value of the glass capillary.\nWrite the program for pulling the electrode according to the value determined by the \"Ramp\" test, and use the following steps: \"Heat\" value = \"Ramp\" value, Pull = 0, Vel = pulling rod moving speed, Time = 200-250. Click on Pull to start fabricating the pipettes.\n\tNOTE: Observe the color of the desiccants in the sealed container of the micropipette puller before using it. If the color changes from blue to pink, the desiccants must be replaced. To prevent the contamination of the electrode tip, try not to touch the middle part of the glass capillary during the pipette preparation. Subsequently, carefully remove the produced pipettes, and place them in a closed and sealed container.\n4. Instrument setup",
    "Turn on the corresponding instruments in the following order: the digital-analog converter, the signal amplifier, the micromanipulator, the microscope, and the camera (see Table of Materials).\nOpen the imaging application, the signal-amplifier software, and the data acquisition software in sequence (see Table of Materials).\n\tNOTE: The instrument must be turned on sequentially; otherwise, the \"Demo Digitizer\" state will appear after opening the software.\n5. IKv parameter setting\nEdit the protocol for recording the IKv following the steps below.\n\t\nClick on Edit, and select Edit Protocol in the data acquisition software (see Table of Materials).\nEdit the program in the \"Waveform\" interface: Epoch A (First level = −60 mV, Delta level = 0 mV, First duration = 20 ms, and Delta duration = 0 ms); Epoch B (First level = −40 mV, Delta level = 10 mV, First duration = 150 ms, and Delta duration = 0 ms), and Epoch C (First level = −60 mV, Delta level = 0 mV, First duration = 30 ms, and Delta duration = 0 ms).\nThen, click on the Mode/Rate interface, and set the \"Trial Hierarchy\" data: Trial delay = 0 s, Runs = 1, Sweeps = 11, and Sweep duration = 0.22 s22,23.\n\t\tNOTE: Acquire the IKv channel currents by applying 150 ms depolarizing steps from −40 mV to +60 mV with an increment of 10 mV at a holding potential of −60 mV under control conditions. The total time of the protocol needs to be greater than the time set in the \"Waveform\" program.",
    "Edit the P/N Leak Subtraction program: click on Edit Protocol to select the Stimulus button, and set the leak subtraction program in the P/N Leak Subtraction dialog box: number of Subsweeps = 2-8 (4 in this study), Settling time = 100-1,000 ms (200 in this study), \"Polarity\" = \"Opposite to waveform\", holding level = −80 mV.\n\tNOTE: The P/N Leak subtraction must have a holding level lower than the \"First holding\" (−60 mV).\n6. Whole-cell patch-clamp recording of the I Kv in voltage-clamp mode\nEstablish the data storage path: click on File, and select Set Data File Names in the data acquisition software. Open the established IKv protocol (step 5.1) by selecting Edit and clicking on Open Protocol in the data acquisition software. Finally, click on the Tools option, and select Membrane Test to start running the protocol.\nAdd the extracellular solution (step 1.5) to the cell bath on the whole-cell patch-clamp apparatus (see Table of Materials), and place the coverslip upward with the H9c2 cells (cultured in step 2.1) in the bath.\nFill 30% of the pipette (fabricated in step 3) with the extracellular solution, and install it on the recording electrode holder integrated into the patch-clamp apparatus. Tighten the pipette with the o-ring rubber gasket and plastic washer. Then, drop the pipette into the bath with the micromanipulator. Click on the Pipette offset interface of the signal-amplifier software (see Table of Materials) to maintain the IKv current baseline at 0 pA.",
    "NOTE: The intracellular solution (step 1.4) must be in contact with the AgCl/Ag portion of the silver wire, and the silver wire must not be close to the inner wall of the pipette. The resistance of the pipette needs to be 2-6 MΩ. To avoid the occlusion of the pipette tip, a continuous positive pressure must be delivered to the pipette using a 1.0 mL syringe connected to the recording electrode holder via plastic tubing24.\nDeliver an appropriate positive pressure manually with a 1.0 mL syringe connected to the recording electrode holder through a plastic tube. Move the pipette slightly by manipulating the micromanipulator in three dimensions to contact the cell.\nOnce the membrane test square wave drops by 1/3 to 1/2 after the pipette touches the cell membrane, remove the positive pressure, and manually deliver an appropriate negative pressure. Then, click on the Patch interface of the data acquisition software to form the GΩ seal. Use the \"Cp Fast\" and \"Cp Slow\" signal-amplifier software during cell sealing to compensate for the fast and slow capacitance.\n\tNOTE: When the membrane test is ≥1 GΩ, a cell-attached configuration is formed between the pipette tip and the cell.\nApply brief pulses of negative pressure to rupture a patch of the cell membrane.\n\tNOTE: A precipitous reduction in membrane resistance characterizes a successful whole-cell recording pattern. If the access resistance (Ra) ≥30 MΩ, the cells must be reselected for steps 6.3-6.6. In order to ensure the accuracy of the recorded IKv data, the negative pressure must be removed after the cell membrane is broken.\nExecute whole-cell membrane capacitance compensation by clicking on the Whole-cell button of the signal-amplifier software. Finally, save and record the data by clicking on the Data recording button.",
    "Open the saved IKv data with the data analysis software. Save the current-voltage (I−V) relationships: click on Analyze to select Statistics to do the following: select the Range as Cousors 1,2 for data analysis; click on the Peak Amplitude and Mean buttons, and then click on OK to view the data in the Results page. Finally, copy the column of IKv mean data into the function drawing software (see Table of Materials) for further analysis.\nSave the representative IKv current traces: click on Edit to select Transfer Traces; then, select the Full trace in the Region to transfer; next, click on Select in Trace Selection, and select IN 0 (pA) in Signals; finally, click on OK to view the data in the \"Results\" page, and copy the total data into the function drawing software to draw the current traces.\nSave the IKv protocol: click on Edit to select Create Stimulus Waveform Signal, and select OK. Then, redo step 6.9 except for selecting A0 # 0 (mA) in \"Signals\".\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}