{
  "id": 13768,
  "origin_website": "Jove",
  "title": "Viral-mediated Labeling and Transplantation of Medial Ganglionic Eminence (MGE) Cells for In Vivo Studies",
  "procedures": [
    "Ethics statement: The following procedures have been approved by our institution and animal protocol. Make sure to get approval for all procedures involving survival surgeries before beginning experiments and verify all protocols are up to date.\n1. Lentivirus Preparation (Optional Step)\nSplit three 10 cm plates of HEK293T cells for each lentivirus to be made, in the presence of 10 ml DMEM/10% FBS, and grow to ~60-70% confluence. Grow cells in an incubator at 37 °C with 5% CO2.\nTransfect the following DNA plasmids (10 µg total) into each plate using any transfection reagent: 6.4 µg CAG-Flex-GFP lentiviral vector (DNA vector sequence provided in Table 1), 1.2 µg pMD2.G (encodes VSV-g), 1.2 µg pRSV-Rev, and 1.2 µg pMDLg/pRRE. The three lentiviral packaging vectors are commercially available (Table\n\tNote: This particular approach utilizes 3rd generation lentiviral vectors but 2nd generation vectors and associated plasmids will also work.\nPrepare a waste container containing a 10% bleach solution within a BSL2 certified hood to inactivate any solutions or devices that contacted or contain lentivirus. Next, completely remove the media 4-6 hr after transfection into the bleach solution, replace with the same volume of new media, and allow the cells to grow.\nAfter 4 days, collect media into 50 ml conical tubes and centrifuge at 1,000 x g for 15 min to pellet any cell debris. Next, filter the supernatant through a 0.45 µm membrane. Any low protein binding filter, like PVDF, works well. Caution: place both solid and liquid viral waste into the bleach solution.",
    "Load 30 ml filtered supernatant into ultracentrifuge tubes and into an ultracentrifuge. Centrifuge at 100,000 x g for 2.5 hr at 4 °C. Open the centrifuge tubes in a BSL2 hood and remove supernatant into 10% Bleach. Add ~100 µl of PBS to the pellet, which yields titers of 1x10^7-8 infectious units/ml. Aliquot the following day and store at -80 ºC. Lentivirus aliquots are stable at -80 °C for at least six months.\nImportant consideration: Many institutions now have viral cores. Acquire concentrated virus with a minimum titer of 1x107 infectious units/ml, for optimal results.\n2. Donor Mice for MGE Dissection\nFirst, set up a timed mating between a Cre-expressing line of interest and either a wild type (WT) mouse or a mouse that will express a reporter after Cre-mediated recombination.\n\tNote: Many Cre-driver lines are transgenics and are maintained and bred in the hemizygous state. Thus, only half of the embryos will contain the Cre transgene. DNA can be quickly prepared from the embryos for a short PCR to detect the Cre allele. The Cre+ embryos can then be harvested so that only the MGE tissue of the desired genotype is used. Alternatively, a Cre-dependent reporter may be used, to select the embryos for MGE dissection and transplantation.\nCalculate which day will correspond to E13.5. If animals were paired the evening before, the day of the plug is 0.5. Order timed-pregnant mice or a WT female with P1 pups in order to time having postnatal (P)1 mice on the day the donor tissue will be E13.5. Alternatively, set up these matings in house one week prior to pairing the donor animals.\n\tNote: The former strategy of generating both E13.5 and P1 embryos/pups for the same day is often difficult to do reliably.\n3. Preparation of Media, Tools and Equipment.",
    "Prepare the reagents and tools for MGE cell preparation (Table 2).\n\t\nPrepare a clean surface and place clean forceps, scissors and either a microsurgical knife or fine forceps (for precise tissue dissection) on the surface.\nPrepare Hank's balanced salt solution (HBSS), for dissection, and Dulbeco's modified eagle's medium (DMEM) with 10% fetal bovine surem (FBS), for transduction.\nPreincubate 20-30 ml DMEM/10% FBS in a 37 °C tissue culture incubator for about 1 hr. The lid should be loosened to allow for gas exchange and pH equilibration of the media.\n\t\tNote: The media preincubation can be prepared just before starting the dissection.\n4. MGE Cell Preparation\nSacrifice the pregnant mouse according to an approved animal protocol and remove the embryos into a 10 cm petri dish containing ice-cold HBSS.\nRemove the brain from each embryo using a dissecting scope (do one at a time, leaving the rest of the embryos in ice-cold HBSS) and then proceed to cut out the MGE tissue.\n\tNote: Detailed below, and in Figure 1, are key steps showing how to remove the MGE. In addition, Figure 2 is a movie showing the entire dissection procedure.\n\t\nPosition the brain with ventral side facing up (Figures 1A, A'). Note: it is also okay to have the dorsal aspect facing up. Cut the brain in half along the saggital plane to generate two pieces. An example hemisected brain is shown (Figures 1B, B'), notice that dorsal (the overlying cortex) and ventral aspects of the brain cover and surround the ganglionic eminence (GE) tissue.",
    "Next, with a dominant hand, hold either very fine forceps or a stabknife (Table 2), while immobilizing the hemisphere with forceps held by a non-dominant hand. (The hemisphere's medial aspect should be facing up). Unfold the dorsal and ventral tissue with forceps and a stab knife to reveal the underlying GE tissue (Figure 1C and diagrammed in Figure 1C').\n\t\tNote: Removing some media from the dissection petri dish can make it easier to stabilize the tissue while performing the MGE dissection.\nMake straight cuts with the stabknife or fine forceps to separate the CGE, LGE and septal tissues (see example cuts denoted by red dashed lines, Figures 1D and D'). These cuts can be made in any order.\n\t\tNote: Imagine the MGE as a 'box' that is cut out of the surrounding tissue. Doing so helps reproducibly make similar cuts for each dissection, thus reducing variability in tissue dissections.\nFinally, turn the MGE on its side and trim off the bottom (what was the lateral aspect of the brain). This removes the mantle zone of the MGE (discard in Figures 1E and 1E') from the rest of the MGE. The remaining aspect of MGE contains primarily ventricular zone and subventricular zone portions of the MGE, which contains nearly all the MGE progenitor cells. Proceed with this tissue.\nImportant consideration: The addition of silicone gel to the bottom of a petri dish can serve as an excellent dissection surface as it protects the delicate tips of forceps and provides a soft surface for pinning tissue with forceps.\n4.3 Additional strategies for MGE Dissection.",
    "Cut the skin of the embryo using forceps like scissors to quickly remove the brain. As the embryo lays on its side, hold the tissue at the base of the head with the forceps used to anchor the tissue. First, cut anterior ventral to the brain and posterior ventral to the brain, and then connect the two cuts along the side of the embryo. Then grab the flap of skin and pull it over the top of the brain. The brain can then be quickly dissected away from the remaining tissue.\nAlternatively, anchor the posterior aspect of the whole brain behind the cortex. Meanwhile, grasp each hemisphere at the most dorsal caudal aspect of the cortex and tear the cortex away from the anchored tissue in an anterior direction. In this way, both cortices can be removed and the bilateral ganglionic eminences are revealed, still attached to the rest of the tissue preserving the medial-lateral anatomy.\nSwitch to the stab-knife to make precise cuts around the MGE on each hemisphere. Use either a separate clean set of forceps to collect the MGE or a pipette with a large tip (i.e., P1000).\nNote: Keep the collected tissue away from all other dissected material, as some media is unavoidably transferred when the MGE is collected.\nCollect the MGE and put the tissue into a 1.5 ml collection tube containing DMEM/10% FBS, (a volume of 500 µl is sufficient to collect the MGEs). Repeat for the other hemisphere and place in the same collection tube. Keep samples on ice until all tissue is collected.\n5. Lentiviral labeling and Transplantation\nMove the tubes of MGE tissue into a BSL2 certified hood and remove the media.",
    "Note: The MGE tissue is big enough to be visible to the eye and will settle to the bottom of the tube allowing for the cold media to be easily and gently removed.\nAdd ~500 ul of DMEM/10% FBS media, that was preincubated in a 37 °C tissue culture incubator. Next, add polybrene to facilitate transduction to each tube at a final concentration of 8 µg/ml. Triturate the MGE tissue to create a single cell suspension, using a P1000 pipette tip. Finally, add ~15-20 µl of concentrated lentivirus to each tube.\nImportant consideration: A trituration of 10-12 times is sufficient to break up MGE tissue from a single embryo, but more triturations may be required if multiple MGEs are pooled together. Try out different trituration conditions to determine what works best.\nSecurely close each tube, invert to mix, than place all the tubes in a 37 °C incubator. Incubate the cells in lentivirus for at least 30 min and up to 1 hr. Longer times have resulted in decreased cell viability. Invert the tubes every 10 min until the time is up.\nAfter incubation with lentivirus, remove the tubes from the incubator and centrifuge at ~700 x g for 3 min to pellet the cells. In the BSL2 hood, remove the supernatant and discard into 10% bleach. Next, add 1 ml DMEM/10% FBS and triturate the pellet 2-3 times to wash, then centrifuge again at the same speed to pellet the cells. Repeat this wash-step 2-3 more times to remove excess virus.\n\tNote : Perform centrifugation steps at 4 °C, however, reduced viability has not been observed when short spins are performed at RT.",
    "After the final wash, remove as much media as possible and put each tube on ice. Due to residual media on the sides of the tube, ~2-3 µl of media will end up covering the cell pellet by the time the transplantation procedure has begun.\n6. Transplantation and Validation\nAcquire host P1 pups and prepare the procedure area by spraying down with 70% ethanol. To maintain sterility during the procedure it is recommended to perform these procedures in a dedicated clean procedure room. In addition, use either autoclaved surgical tools sterilize surfaces that the pups will be in contact with using 70% ethanol. An example of representative equipment needed to perform the transplantations and a representative procedure area is shown in Figure 3.\nNote: While this procedure is an injection of small volumes, and not a surgical procedure that would require an incision, open wound or sutures, it is still recommended that a new micropipette is used for each mouse to be injected. The micropipettes are heat sterilized when pulled and beveled on a surface that was sprayed with 70% ethanol being stored in a sealed container.\nGenerate micropipettes to have a diameter at the tip between 40-80 µm. Following these dimensions will yield optimal results. Heat sterilize the micropipettes when pulled and beveled on a surface and spray with 70% ethanol before storing the micropipettes in a sealed container.\n\tNote: Alternatively, if access to the devices needed to create these needles (Table 2) is limiting, use any other injection device. However, these may not be as well suited as the micropipettes due to different diameters.",
    "Draw up mineral oil into a 1 ml syringe, and with a 30 1/2 G needle, fill the glass pipette completely with mineral oil. Next, mount the plunger onto the stereotaxic device, then attach the glass pipette to the stereotaxic device and load onto the plunger. Using the hydraulic drive, move the plunger about halfway into the glass pipette, removing mineral oil that spills out with a clean a clean paper towel.\n\t\nAlternatively to using a syringe, submerge the back end of the pipette in mineral oil and filled by capillary action. To prevent air bubbles in the pipette, maintain positive pressure on the syringe until completely out of the glass pipette.\n\t\tNote: Other devices can be used to successfully transplant MGE cells 14. Any device that can deliver a volume less than or near 100 nl works well for this procedure.\nNext, use a sterile paper towel, or any absorbent material, with the corner twisted into a fine point to delicately remove excess media above the MGE cell pellet. This step concentrates the cell density so that smaller injection volumes can be achieved. Next, use a low volume (P2 is preferred) pipette to slowly draw up the cell pellet and triturate 1-2 times before moving the cell suspension onto a hydrophobic surface. The volume should be just under 1 µl. Move the tip of the needle into the cell suspension and using the hydraulic drive, draw up the cell suspension into the pipette.",
    "Anaesthetize a P1 pup via hypothermia (wrap in a latex glove and put on ice for ~ 2-4 min). Check for effectiveness of anesthesia with a noxious stimulus. Pinch the skin between the toes with fine forceps: the pup should be unresponsive if pinched. Next, place the pup onto a mold that is under the injection device, then make the skin taut by pulling back the skin on the head and securing with standard lab tape.\n\tNote: While hypothermia is very effective on neonatal mice and results in low mortality rate, procedures must be done quickly, as pups will begin to recover in under 10 min. In addition, 4 min on ice is an upper limit of what can be tolerated. Try to only induce hypothermia once if a longer time is required for injections. However, if a pup recovers early, first allow the pup to fully recover before inducing hypothermia again. Moreover, only induce hypothermia one more time to perform injections.  Pups will recover within 5-10 min of hypothermia. This can be facilitated by placing the pups with litter and mom or by placing the pup on a warm surface to recover.\nUsing a stereotaxic device, position the tip of the glass pipette on the surface on the pup's head, perpendicular to the surface of the head. When the pipette is in contact with the head, consider this as '0'. Next, push the pipette through the surface of the skin and skull into the cortex, then insert and retract the pipette ~ 2 times before stopping. For optimal targeting of cells into the neocortex, injections are performed when the micropipette is at a depth of 0.1 mm. However, this should be optimized by the user (see note below).",
    "Note: While this depth reliably targets deeper neocortical layers with the devices described above, a few depths should be tested determined empirically. In addition, a range of depths at different rostro-caudal and medio-lateral position should be tested to determine what depth is optimal at each site. Also, the initial puncture should be rapid, as slow penetration into the neocortex diminishes the ability to cleanly penetrate the tissue. Try different speeds when first starting this procedure to find what works best. In addition, for testing coordinates, there is no real substitute for using labeled cells, as dyes have been unreliable to denote position.\nOnce the needle is in position, rotate the hydraulic device to advance the plunger into the glass pipette, pushing a set volume of cell suspension into the cortex. Inject 50-70 nls per site. Repeat this procedure at 3-6 different sites at different rostral-caudal levels if the goal is to obtain a wide distribution of cells throughout the neocortex.\n\tNote: Volumes of 100 nl or greater can cause lesions and lead to large clumps of injected cells that fail to efficiently migrate out of the injection site. Thus, smaller injection volumes (~70 nl or less) are optimal, over more sites if time permits.\nWhen injections are complete, remove the pup from the stage and mark it (toe clipping is a reliable way to identify the pups later). Once the pup has recovered and is able to move on its own (this occurs within minutes of removing them from the stage), put it back with the mom and litter.",
    "Note: Since this is a minimally invasive procedure there are no post-surgical procedures once the pup is freely moving and warmed. However, pups should be checked not only after the procedure but also the following day to assure they have no signs of deteriorating health.\nBefore starting the procedure on the next pup, spray down the area with 70% ethanol to maintain a sterile working area. Allow the injected pups to develop and then assess the tissue at the appropriate developmental stage(s).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}