{
  "id": 8880,
  "origin_website": "Jove",
  "title": "Proofreading and DNA Repair Assay Using Single Nucleotide Extension and MALDI-TOF Mass Spectrometry Analysis",
  "procedures": [
    "1. Primer/template Preparation\nDesign primers/templates with a balanced G+C content between 40% and 60% as in a sequencing or PCR primer design. Use primers of 18 to 21 nt for an appropriate annealing and better MS signals.\nDesign the template by setting 50 °C as the minimum melting temperature for the duplex region with at least 7 nt of 5'-overhang to separate the signals between the primer and the template.\n\tNOTE: For example, for the substrate P21/T28 in Table 1, the 21-nt primer is paired with a 28-nt template. Option: the use of alternative nucleic acids such as nuclease-resistant phosphorothioate bonds to replace the last 4 phosphodiester bonds at the 3' end of the template can prevent possible interference by a non-specific 3' end degradation of the templates (e.g., T28S4 in Table 1), although this will add some cost for the template preparation.\nUsing standard desalted oligonucleotides without any further purification is satisfactory for this study. Use oligonucleotide primers/templates at a concentration of 100 pmol/µL in H2O as a stock and store it at -20 °C. Check the quality and purity of the primers and templates by running the oligonucleotides on MALDI-TOF MS (steps 4 - 7) to ensure unique peak signals and a good signal to noise ratio.\nDetermine the relative MALDI-TOF MS signal intensities (step 7) of the equal molar primers of the relevant sequences in the reaction for calibration and concentration normalization (Figure 2).\n2. Proofreading Reactions\nNote: The same proofreading reaction condition and protocol applies to a DNA repair of A-I, G-I, C-I, and T-I.",
    "Using a T-G mismatch of substrate P21/T28 for the proofreading in Table 1 as an example, dilute primer P21 and template T28 to 12.5 pmol/µL with H2O; then transfer 12 µL of the diluted primer and 12 µL of the diluted template to a 1.5-mL sterilized microcentrifuge tube.\n\tNOTE: The amount of template/primer mix is sufficient for 2 reactions; proportionately increase the volume of the reagents accordingly for multiple reactions.\nClose the tube tightly. Incubate it for 30 min in a covered 65-°C water bath, followed by 30 min in a 37-°C water bath, and finally on ice to ensure a proper annealing.\nTo a 1.5-mL sterilized microcentrifuge tube, add 8 µL of primer and template mix (50 pmol), 2 µL of 10x proofreading reaction buffer, 4 µL of 4 ddNTPs mix (2 mM of each 4 dNTPs), and H2O up to 18 µL. Flick the tube to mix.\n\tNOTE: 1x proofreading reaction buffer contains 50 mM NaCl, 10 mM MgCl2, 1 mM dithiothreitol, and 10 mM Tris-HCl (pH 7.9 at 25 °C). See the Table of Materials for the commercial source of 10x proofreading reaction buffer. The final concentration of each ddNTP in the reaction is 0.1 mM.\nDilute DNA polymerase in ice-cold 1x proofreading reaction buffer to the desired concentration [e.g., to a 1.5-mL microcentrifuge tube, add 4 µL of 1x proofreading reaction buffer and 1 µL of 5-U Klenow polymerase from a commercial source (Table of Materials)]. Store the diluted enzyme on ice at all times.\n\tNOTE: The amount of diluted DNA polymerase is sufficient for 2 reactions; proportionately increase the volume of the enzymes accordingly for multiple reactions. A volume of 2.0 µL, containing 2.0 units of Klenow polymerase, can proofread more than half of 50 pmol of T-G terminal mismatched P21/T28 in 5 min.",
    "Prewarm the microcentrifuge tube with the substrate mix from step 2.3 to the desired reaction temperature (e.g., typically 37 °C for Klenow polymerase and 25 °C for T4 DNA polymerase). Then transfer 2.0 µL of the diluted DNA polymerase from step 2.4 to the prewarmed substrate mixture and flick the tube to mix its contents.\nCentrifuge the tubes with enzyme and substrate for a few seconds at 3,200 x g at ambient temperature to spin down the components of the reactions. Immediately transfer the reaction to a heating block or a water bath at the desired incubation temperature as in step 2.5.\nTerminate the reaction\nAdd an equal volume of buffered phenol, mix it by vortexing for a few seconds, and centrifuge it in a microcentrifuge at 3,200 x g at ambient temperature for 5 min.\n\t\t\nTransfer the aqueous phase to a clean microcentrifuge tube and add an equal volume of chloroform, mix it by vortexing for a few seconds and centrifuge it in a microfuge at 3,200 x g at ambient temperature for 3 min. Transfer the aqueous phase to a clean microfuge tube and incubate it at 95 °C for 5 min; then place it on ice.\n\t\t\tCAUTION: Phenol and chloroform are hazardous chemicals. Handling and waste disposal should follow institutional regulations.\nAlternatively, use an acid quenching protocol. For this, add 2 µL of 1 M HCl to stop the reaction on ice for 6 min, then add 0.64 µL of 1 M diethanolamine (DEA) to neutralize the pH of the reaction mixture and incubate it at 95 °C for 5 min; then place it on ice.\n3. Resin Addition to Eliminate Salt Contamination",
    "Using the resin scoop from the commercial desalting kit (see the Table of Materials), take sufficient resin to cover the dimples of the 384-dimple, 6-mg resin dimple plate.\nDistribute the resin across all the dimples evenly (6 mg/dimple) by scraping across the top of the plate. Recover any excess resin and replace it in the bottle.\nTransfer the final reaction products from step 2.7 from the microfuge tubes to a 384-well plate. Dispense 16 µL of H2O to dilute the final reaction products in each well and then seal the plate and centrifuge it to remove any bubbles.\nRemove the seal, turn the 384-well plate with the reaction products upside down to cover the resin-filled dimple plate.\nTurn over the well-to-dimple plates sandwich and carefully let the resin drop into the 384-well plate (be sure the 384-well plate is flush against the metal peg on the resin-filled dimple plate).\nRemove the dimple plate on top, seal the 384-well plate containing the mixtures of the reaction products and resin, briefly centrifuge it at 3,200 x g to remove any bubbles and place it on a rotator for at least 15 min at room temperature for desalting its contents.\nAfter the resin cleanup, centrifuge the 384-well plate at 3,200 x g for 5 min to compact the resin to the bottom of the wells.\n4. Transfer Reaction Products to a Matrix Chip\nSet the sample plates in the nanoliter dispenser (nanodispenser, see the Table of Materials).\nPut the matrix chip (see the Table of Materials) and the 384-well plate from section 3.7 in the corresponding tray.\nOperate the nanodispenser to spot the reaction products to the chip; push the RUN button on the touch screen of the nanodispenser to start.",
    "Check the automated captured image of the sample spots containing saturation information on the screen to ensure the overall spotted volume on the chip is around 5 - 10 nL. Repeat the sample spotting if the volume is insufficient.\n5. Setup the Assay Information on the Mass Spectrometry\nPrepare a file in .xls format containing the anticipated signal information for importing. For example, use the setting of \"P21_T28.xls\" (Table 2) for the proofreading reaction of P21/T28 in steps 2, 3, and 4.\nCreate and define a new assay in the application program (see the Table of Materials) by right-clicking Import Assay Group in Designer Format and select the .xls file (e.g., \"P21_T28.xls\" from step 5.1).\nEstablish the target assay plate via the Customer:Project:Plate option tree on the left side of the screen by right-clicking the top of the tree and giving it a file name (e.g., \"CTT20171201\" represents the assay code and date).\nSelect the 384-well plate type and press OK; a blank plate will appear.\nSelect the appropriate assay (e.g., P21_T28) on the left side of the screen.\nAssign the selected assay (e.g., P21_T28) for each sample spotted sample position on the chip by highlighting the well and right-clicking to select Add Plex.\nPrepare a working list of all the tests on the chip in .xlsx format with no header (e.g., 1201.xlsx of Table 3). Import the working list via the Add New Sample Project option.\nAssign the test in the working list (e.g., from 1201.xlsx) to each position of the P21_T28 assay and choose by right-clicking.\n6. MALDI-TOF MS Operation\nLink the mass spectrometer to the chip using the application program (see the Table of Materials).\nSelect the default setting at the right side of the screen.",
    "Fill in the assay name from step 5.3 (e.g., CTT20171201), chip ID at the corner of the chip, and save the settings.\nStart the MS control program (see the Table of Materials).\nPress the In/Out button and take out the scout plate. Place the spotted chip from step 4.4 onto the scout plate and press the In/Out button for the spotted chip to enter the mass spectrometer.\nClick the Acquire button of the application program (see the Table of Materials) to start the mass spectrometry and acquire data.\n7. Data Analysis\nOpen the program for the data analysis (see Table of Materials).\nBrowse the tree of the database at the upper left corner and select the chip ID from step 6.3. Open the data file on the right side of the screen.\nClick the spectrum icon to display the mass spectrum. To crop a specific range of m/z, right-click to select Customization Dialog and in the new window click on X-Axis and set the desired upper and lower limit and press OK to show the specified range of the spectrum.\nExport the spectrum for record keeping by right-clicking Export.\n\tNOTE: Using a scale of 1,600 width/1,200 unit is a reasonable size for data inspection on a computer screen.\n\t\nSelect the JPEG file type, click on Destination, select Browse Disc (e.g., flash disc E:), type the file name (e.g., 1201-1.jpg), and then click on Export.\nFor data quantitation, use the cursor and click on the peak to show the peak height at the upper left-hand corner.\n\t\nAlternatively, print out an exported JPEG file and measure the peak height with a ruler manually.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}