{
  "id": 19731,
  "origin_website": "Wiley",
  "title": "Measuring Mitochondrial Respiration in Previously Frozen Biological Samples",
  "procedures": [
    "The following protocol details how tissue samples should be collected and stored prior to being analyzed using the previously frozen tissue respirometry assay. In this protocol, the tissue of interest will be isolated from the organism and frozen for long-term storage. Samples will then be manually homogenized and isolated via centrifugation, or, optionally mitochondria may be isolated from the homogenate. Finally, a BCA protein assay will be performed to normalize the samples either for immediate loading or for normalization to mitochondrial mass (described in Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0003]). If the protocol is followed accurately, the samples should progress from whole tissue to a homogenate or mitochondrial isolate that is ready for normalized loading on a Seahorse sample plate in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0002].\nThis sample preparation protocol is optimized for mouse liver isolation. See Troubleshooting (Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-tbl-0003]) for alterations to be made for the collection, preparation, and measurement of other tissue types using the frozen tissue respirometry method.\nMaterials\nMice\nPhosphate-buffered saline (PBS; Sigma, P3813)\nLiquid nitrogen (optional)\n1× MAS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-rec-0001])\nCollagenase Type II (Worthington Biochemical, 4174; optional)\nBCA Protein Assay Kit (ThermoFisher, 23225, or equivalent)\nScissors and other dissection tools\nGlass-glass or glass-Teflon Dounce homogenizer\nRefrigerated centrifuge\nAdditional reagents and equipment for euthanasia of mice ((see Current Protocols article: Donovan & Brown, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-bib-0002])\nTissue collection\n1. Euthanize mice using isoflurane anesthesia followed by cervical dislocation (see Current Protocols article: Donovan & Brown, 2006[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-bib-0002]) as approved by Institutional Guidelines for Animal Care in compliance with U.S. Public Health Service Regulations.\n2. Dissect the tissue of interest, wash with PBS, and optionally mince with scissors.\nWhen possible, dissections should be done on ice to keep the tissue as cold as possible.\n3. Snap freeze in liquid nitrogen. For long-term storage, store the frozen tissue at −80°C.",
    "Liver samples have been shown to have little loss in respirometry results if stored at room temperature or 4°C for up to 3 hr prior to being snap frozen (Fig. 3A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0003]).\nThough snap freezing is the most ideal method of tissue preparation, the tissue may be immediately stored at −80°C or at −20°C for up to 4 hr prior to being stored at −80°C without affecting the respirometry results (Fig. 3B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0003]).\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7b6cc667-7c96-4849-9675-58b96b860e0b/cpcb116-fig-0003-m.jpg</p>\nFigure 3\nTissue collection and homogenization. (A) Complex I, complex II, and complex IV oxygen consumption rates of mouse liver homogenates. Liquid nitrogen (LN) samples were immediately snap-frozen after isolation: 4°C 0.5 hr and 4°C 3 hr were kept at 4°C for 0.5 and 3 hr, respectively after isolation prior to being snap-frozen. RT 0.5 hr and RT 3 hr were kept at room temperature for 0.5 and 3 hr, respectively after isolation prior to being snap-frozen. (B) Complex I, complex II, and complex IV oxygen consumption rates of mouse liver homogenates. LN homogenates were isolated then snap-frozen in liquid nitrogen prior to storage at −80°C. −80°C samples were isolated then stored at −80°C until homogenization. −20°C samples were isolated then stored at −20°C for 4 hr before being stored at −80°C until homogenization. (C) Mouse liver before and after 10 strokes of homogenization using a glass-Teflon homogenizer.\nTissue homogenization\n4. Thaw samples in ice-cold PBS and mince with pre-chilled scissors or razor blades.\n5. Homogenize using 250 µl to 500 µl per 10 mg of tissue of ice-cold MAS buffer using the appropriate homogenizer (Fig. 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0003] illustrates this process). For liver, brown adipose tissue, brain, kidney, lung, and skeletal muscle, use ten to twenty strokes in a glass-Teflon Dounce homogenizer. For heart and white adipose tissue, use twenty strokes in a glass-glass Dounce homogenizer.",
    "CRITICAL: For muscle tissue, incubate homogenized tissue in collagenase Type II (0.25 mg/ml final concentration) in MAS at 37°C for 30 min prior to centrifugation.\nOur studies have shown that using smaller-volume homogenizers (e.g., using a 7-ml homogenizer rather than a 15-ml homogenizer when working with <5 ml of sample material) results in less sample retention in the homogenizer and produces better homogenization.\n6. Centrifuge homogenates 5 min at 1000 × g, 4°C.\nCRITICAL: If using swinging-bucket centrifuge, measure the precise distance between rotor center and the center of mass of the liquid homogenate in the tube in the horizontal swinging position in order to correctly calculate the g to rpm conversion:\n         \n7. Collect the resulting supernatant as the homogenate sample. Discard the pellet (Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0004]). The supernatant (tissue homogenate) may be stored at −80°C for long-term storage.\nThis sample may also be used for other assays like enzymatic assays, western blots, or Blue Native gel electrophoresis.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/3dec8cfa-4ccc-468e-872d-35e46333650e/cpcb116-fig-0004-m.jpg</p>\nFigure 4\nHomogenate isolation from frozen tissues. After homogenization, the homogenate must be isolated from the cellular debris. This is performed using a 1000 × g centrifugation for 5 min at 4°C. Highlighted in this figure is the pellet resulting from this centrifugation (boxed) and the supernatant (not boxed). The supernatant is your tissue homogenate, which should be collected and may be used for normalization prior to respirometry, for mitochondrial isolation, or for non-respirometry assays like Blue Native Gel Electrophoresis. The pellet should be discarded.",
    "8. If you are running the sample as a tissue homogenate, perform a BCA protein assay to normalize your samples according to protein content prior to loading on the Seahorse XF96 sample plate (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0005], Method 1). If you are normalizing according to mitochondrial content, perform a BCA protein assay and continue with the steps detailed in the optional Basic Protocol 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0003] (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0005], Method 2). If you are isolating mitochondria from the tissue homogenate, proceed with the following steps for mitochondrial isolation protocol.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/7d8454e4-7891-4bff-8210-9304092db523/cpcb116-fig-0005-m.jpg</p>\nFigure 5\nNormalization and loading of tissue homogenates or mitochondrial isolates. Normalization may be performed in one of two ways: protein normalization using a BCA assay or mitochondrial mass normalization using MTDR dye. Method 1 describes the protein-based normalization using the BCA assay. Method 2a describes mitochondrial normalization performed prior to running the XF96 Seahorse plate. Method 2b describes mitochondrial normalization performed after running the XF96 Seahorse plate.\nMitochondrial isolation from homogenate (optional)\n9. If mitochondrial isolation is desired, centrifuge the rest of the homogenate preparation (the supernatant from the above centrifugation) 10 min at 10,000 × g, 4°C.\n10. Optionally, wash mitochondrial pellets twice in 1× volume of MAS buffer, each time centrifuging as in step 9.\n11. Re-suspend final mitochondrial pellet in ice-cold MAS buffer.\n12. Perform a BCA protein assay using the mitochondrial homogenates. This may be used to normalize the sample according to protein content for loading, or optionally to prepare for mitochondrial mass normalization using MitoTracker Deep Red dye as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0002].\nSample data",
    "Figures 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0003] and 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0004] depict the results one should obtain after sample collection. Figure 3C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0003] shows a mouse liver sample that has been homogenized using a glass-Teflon homogenizer. Figure 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0004] shows the same sample after centrifugation, highlighting the pellet formed (which should be discarded) and the supernatant (which should be saved). If this sample separation does not occur after centrifugation, you should repeat the centrifugation step a second time.",
    "This protocol will detail the process of loading normalized samples onto an XF96 Seahorse plate, loading the Seahorse cartridge with compound injections, and running samples on the Seahorse platform. Samples will be loaded onto a XF96 sample plate, then centrifuged and diluted before loading the plate onto the Seahorse. Additionally, this protocol describes the loading of the Seahorse cartridge with compound injections. If this protocol is followed accurately, an operator will be capable of loading samples onto an XF96 sample plate, loading compound injections into a Seahorse cartridge, and running the plates on a Seahorse XF96 system. While this protocol is optimized for use with the Seahorse platform, with optimization, it could be adjusted to work with other respirometry platforms like the Oroboros.\nMaterials\nTissue homogenates or mitochondrial isolates (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0001])\n1× MAS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-rec-0001])\nCytochrome c (Sigma, C2506)\nAlamethicin (Sigma, A4665; optional)\nNADH (Sigma, N8129)\nSuccinate (Sigma, S9512)\nRotenone (Sigma, R8875)\nAntimycin A (ENZO, ALX380075M010)\nTMPD (Sigma, 87890)\nAscorbic acid (Fisher, A61-100)\nSodium azide (Sigma, S8032)\nPotassium hydroxide (KOH)\nHydrochloric acid (HCl)\nSeahorse XF96 flux pack (Agilent 102416-100)\nSwinging-bucket centrifuge with plate carrier adapter\nMultichannel pipettes\nSeahorse XF96 instrument\n1. Load homogenates or mitochondrial isolates, based on your BCA normalization results, into a Seahorse XF96 microplate (from the Seahorse XF96 flux pack) in 20 µl of MAS buffer. Optimal loading concentration will vary depending on the sample material, but for most samples a concentration between 2.5 and 20 µg of sample per well will be sufficient. See Table 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-tbl-0003] in the Troubleshooting section of this document for approximate loading concentrations for different tissue types.\nCoating the XF96 plate with substrates promoting cell adhesion like laminin, Cell-Tak, and poly-D-lysine has been shown to not improve performance.",
    "2. Centrifuge the loaded plate 5 min at 2000 × g, 4°C, using a plate carrier.\nCRITICAL: Turn OFF the centrifuge brake and let buckets slow down by themselves. Sudden deceleration due to braking will result in uneven distribution of materials on the bottom of the plate.\n3. Carefully add 130 µl (or enough to achieve a final volume of 150 µl) per well of 1× MAS buffer containing cytochrome c (10 µg/ml, final concentration) for homogenates, or the same volume of MAS buffer alone for isolated mitochondria.\nCRITICAL: For brain and lung homogenates, add alamethicin (10 µg/ml, final) to the MAS buffer containing cytochrome c to allow complete membrane permeabilization to substrates.\n4. Load the cartridge to deliver 25 µl of the following injections (Fig. 6A[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006]):\n         \nPort A: NADH (1 mM) for complex I assessment, or 5 mM succinate + 2 µM rotenone for complex II assessment.\nPort B: Antimycin A (4 µM)\nPort C: TMPD + ascorbic acid (0.5 mM TMPD + 1 mM ascorbic acid)\nPort D: Sodium azide (50 mM) at port D.\nAll compound injections should be diluted in 1× MAS buffer. When making the TMPD + ascorbate solution, add 0.5 mM TMPD into 1 mM ascorbate and adjust the solution to pH 7.2 using potassium hydroxide (KOH) and hydrochloric acid (HCl). NADH and TMPD/ascorbate solutions must be made freshly on the day of the assay, but all other compound injections can be made ahead of time and stored at −20°C until time of use.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/8b6ed7ee-ac5f-4fcf-9568-24c21f5dca5b/cpcb116-fig-0006-m.jpg</p>\nFigure 6",
    "A standard frozen tissue respirometry method, compound injections, and Seahorse trace. (A) An example frozen respirometry Seahorse protocol. (B) Sample compounds for injection ports for the measurement of complex I or complex II oxygen consumption in frozen tissues. (C) An optimal Seahorse trace measuring ETC complexes I, II, and IV. Red trace represents NADH and complex IV dependent and blue trace represents succinate and complex IV dependent respiration. (C-I) NADH-induced respiration, representative of complex I activity. (C-II) Succinate + rotenone-induced respiration, representative of complex II activity. (C-IV) TMPD + ascorbate-induced respiration, representative of complex IV activity.\n5. Mix and measure times for the Seahorse run protocol are 0.5 and 4 min, respectively. If a protocol includes an oligomycin injection, a 2-min wait time should be included between the injection of oligomycin and the 4-min measurement period (Fig. 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006]).\nFigure 6B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006] describes a typical Seahorse program.\nSample data\nFigure 6C[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006] depicts a representative Seahorse trace for a standard assay which measures complex I, II, and IV in mouse liver homogenates. Figure 6C-I[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006] and C-II[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006] highlight the complex I NADH peak and complex II succinate + rotenone peak, respectively. Figure C-IV[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0006] highlights the complex IV TMPD + ascorbate peaks from the complex I and complex II samples. This Seahorse trace not only has distinct peaks for all substrate injections, but also has strong and distinct responses to the inhibitors (antimycin A and azide) used in the assay, making it an optimal-looking trace.",
    "The following protocol describes normalization of the results from respirometry samples according to mitochondrial content. Homogenates or mitochondrial isolates (made in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0001]) will undergo MitoTracker Deep Red (MTDR) staining and measurement. Using this data, samples can be normalized based on their mitochondrial content rather than using a whole protein measurement.\nMaterials\nTissue homogenates or mitochondrial isolates (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0001]) or Seahorse sample plate from Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0002]\n1× MAS buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-rec-0001])\nMitoTracker Deep Red FM (MTDR; Thermo, M22426)\nClear, flat-bottom, black 96-well plate (Corning, 3904 or equivalent)\nSeahorse XF96 flux pack (Agilent 102416-100) including sample plate\nMultichannel pipette\nRefrigerated centrifuge with plate adapter\nFluorescence plate reader or high-throughput microscope\nNormalizing to mitochondrial content\nFor protein content−based normalization using homogenates or mitochondrial isolates, use the BCA protein data previously generated (in Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0001]) to load equivalent protein amounts in the XF96 Seahorse plate as described in Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0002] (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0005], Method 1).Normalization for mitochondrial content using MitoTracker Deep Red (MTDR) may be performed before or after running the Seahorse sample plate.\nWhile MTDR normalization can be performed at any step after BCA values have been generated, loading onto the Seahorse sample plate is exclusively done based on BCA values. Normalization to mitochondrial content should only be done after oxygen consumption rate (OCR) values are obtained.\nNormalizing to mitochondrial content before running a Seahorse experiment (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0005], Method 2a\n1a. Perform protein normalization via BCA assay as described above (Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-prot-0001]).\n2a. On a clear, flat-bottom, black, 96-well plate, seed 2.5-80 µg of mitochondria or lysate sample (according to protein normalization values) in 100 µl of MAS buffer containing MTDR at 1 µM final concentration.",
    "If your sample material is limited, MTDR normalization may be done in the XF96 sample plate afterwards, or using a sister plate loaded alongside the XF96 sample plate.\n3a. Incubate the sample plus dye at 37°C for 10 min.\n4a. Remove the dye by centrifuging the sample 5 min at 2000 × g, 4°C, with no brake for deceleration. Carefully remove the supernatant and resuspend in 100 µl of MAS buffer.\n5a. Measure fluorescence in a plate reader or high-throughput microscope using a clear-bottom black 96-well plate (Corning 3904 or equivalent). MTDR is excited at 625 nm and emits at 670 nm.\n6a. Calculate relative mitochondrial content after controlling for background fluorescence using a blank well.\nNormalizing to mitochondrial content after running a Seahorse experiment (Fig. 5B[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-fig-0005], Method 2b)\n1b. Remove the Seahorse sample plate from the Seahorse machine.\n2b. Carefully, without agitation of the sample material at the bottom of the Seahorse sample plate, remove the MAS buffer from the plate until approximately 80 µl of liquid remains in each well.\n3b. Add 20 µl of 5 µM MTDR in MAS buffer to each sample such that each sample now has 100 µl of liquid with a final MTDR concentration of 1 µM.\n4b. Incubate the sample plus dye at 37°C for 10 min. Ensure that the incubation period is no more than 10 min; too long of an incubation period can result in high background MTDR fluorescence.\n5b. Add 100 µl of MAS buffer without MTDR to each sample. Remove 100 µl of solution from each well. Perform this washing procedure up to three times.\n6b. Measure fluorescence in a plate reader or high-throughput microscope.\nMTDR is excited at 625 nm and emits at 670 nm.",
    "7b. Calculate relative mitochondrial content after controlling for background fluorescence using a blank well. For absolute quantification, use an isolated mitochondria standard.\nSample data\nTable 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-tbl-0001] showcases data from a MTDR plate reader assay to normalize mouse liver by mitochondrial content before loading a Seahorse sample plate. The columns titled “raw absorbance units” and “µg of protein loaded via BCA” will be filled in by the user based on the plate reader results and the amount of protein added to the plate for the MTDR reading (determined via BCA). Dividing the raw absorbance minus the background absorbance and the µg of protein loaded results in the data in the farthest right column entitled “(Raw AU - background)/(µg protein),” which is now a reading of mitochondrial content per µg of protein in the sample. Normalization may then be performed such that the OCR values obtained are normalized to measurements of OCR per mitochondrial content.\nTable 1.\n                Sample MTDR Plate Reader Assay Dataa[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpcb.116#cpcb116-tbl1-note-0001_56]\ntable:\n﻿Sample number,Raw absorbance units (AU),Raw AU − background,µg protein loaded via BCA,(Raw AU − background)/(µg protein)\nBackground,1940,,,\n1,21540,19600.0,10.0,1960.0\n2,19411,17471.0,10.0,1747.1\n3,23593,21653.0,10.0,2165.3\n4,36932,34992.0,10.0,3499.2\n5,41933,39993.0,10.0,3999.3\n6,18971,17031.0,10.0,1703.1\n7,34057,32117.0,10.0,3211.7\n8,39941,38001.0,10.0,3800.1\n9,49203,47263.0,10.0,4726.3",
    "a This figure shows an example data set of MTDR readings from mouse liver homogenate samples. The user will be generating data to fill the “raw absorbance units” and “ug protein loaded via BCA” columns of the table. The “raw absorbance units” column will be filled with the absorbance readings from the plate reader or high-throughput microscope taking MTDR measurements. The “µg protein loaded” via BCA will be filled with the amount of protein loaded (calculated via BCA) into the well for the MTDR reading. Using these two values, the final column titled “(Raw AU - background)/(µg protein)” can be calculated by dividing the raw absorbance minus background and the µg protein loaded via BCA. Normalizing your samples based upon the values in this column will result in equivalent sample loading based upon mitochondrial content."
  ],
  "subjectAreas": [
    "Cell Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}