{
  "id": 9020,
  "origin_website": "Jove",
  "title": "Isolation and Culture of Adult Neural Stem Cells from the Mouse Subcallosal Zone",
  "procedures": [
    "1. Preparation of Materials and Culture Medium\nFor the dissection and dissociation of the SCZ, wrap the brain matrix, double-edged razor blade, and forceps with aluminum foil, and then sterilize them by autoclaving.\nPrepare 50 ml of cold PBS buffer to wash the whole mouse brain.\nSet up a dissection microscope and prepare the surgical tools required for the dissection of the brain (autoclaved scissors and forceps) and the isolation of the SCZ (1 ml syringe, 30 G needle, brain matrix, and fine forceps).\nPreparation of N2 Medium:\n\t\nPrepare F-12/DMEM (+L-glutamin, +sodium bicarbonate) medium with 2% B27, 1% N2 supplements, and 1% Penicillin-Streptomycin.\n\t\tNote: The growth medium consists of N2 medium and growth factors (20 ng/mL purified epidermal growth factor (EGF) and 20 ng/mL basic fibroblast growth factor (bFGF2)).\nPrepare a digestion buffer (40 unit/ml papain, 2.4 unit/ml dispase II, and 2% penicillin-streptomycin in PBS) for tissue digestion.\nPreparation of Coating Plate and Coverslip:\n\t\nPrepare poly-L-ornithine (PLO; 0.01%) and laminin (10 µg/ml dissolved in DH2O). To coat 6-well plates for the maintenance of SCZ-aNSCs as a monolayer or 18 mm coverslips for immunostaining, incubate them with PLO overnight at 4 °C. Then wash them 3 times with DH2O. Allow the plates and coverslips to dry after the last washing.\nNext, incubate the plates with laminin overnight at 4 °C. Then, wash them 3 times with DH2O.\n\t\tCaution: Do not dry the laminin, which will affect cell attachment.\n\t\tNote: The coating solutions can be reused 3 times.\n2. Isolation and Dissociation of the Adult SCZ\nPrior to culture preparation, place the brain matrix and double-edged razor on ice.\n\tNote: Do not freeze the brain matrix, because the brain could attach to it.\nSacrifice a mouse (8 weeks old) by CO2 asphyxiation or cervical dislocation.",
    "Cut off the head with sharp scissors after spraying 70% ethanol. To immobilize the head, hold both sides of the head tightly. Cut the skin with scissors at the midline in a caudal-rostral direction. This promotes the complete removal of the skin from the skull.\nRemove the caudal part of skull (posterior to lambda) first, and then insert the forceps between the skull and brain at the dorsal midline position. Grab the left (or right) parietal bone and carefully peel it off. Repeat this procedure for the removal of the other parietal bone.\n\t\tNote: Disconnection of optic nerve and removal of the meninges from the brain make it easier to detach the brain from the skull.\nTransfer the brain to cold PBS buffer (25 ml) and rinse it twice to remove excess blood.\nPlace the brain into the brain matrix on ice and make coronal cuts to obtain 1 mm thick slices. Transfer the brain slices (1 mm) containing the SCZ regions that are located in the posterior part of the brain to a cold PBS in a 35 mm plastic petri dish.\n\tCaution: In order to obtain a parallel plane of coronal sections, ensure that the brain fissure is placed in the midline of the brain matrix; it is critical to avoid unnecessary variations in the sections.\n\tNote: Obtain brain slices at 2-3 mm posterior to bregma; this allows the separation of the SCZ from the SVZ.\nUnder the dissecting microscope with a low magnification, micro-dissect the SCZ from the white matter area of the cortex and hippocampus with a bent 30G needle6,9. Then, remove the cortex regions above the SCZ. Place the dissected SCZ region from the slices into a 35 mm plastic petri dish on ice without cold PBS.",
    "Note: Contamination of extra regions containing mature neurons could affect the viability of aNSCs and neurosphere formation because they undergo cell death in aNSC culture conditions.\nUsing a bent 30 G needle, immediately chop the dissected tissues into small pieces.\n\tNote: If a longer time is required for dissecting the SCZ tissue, immerse the dissected tissues in cold PBS before chopping.\nRe-suspend the chopped tissue with 1 ml of digestion buffer, transfer the tissue to a 15 ml tube containing 2 ml of digestion buffer, and incubate it for 30 min in a 37 °C water bath.\n\tNote: Shake the tube every 10 min to mix well.\n3. Subcallosal Zone-derived Adult Neural Stem Cell Culture\nTap the tube mildly to dissociate the digested tissue, and then centrifuge the tube at 145 x g for 5 min. Discard the supernatant, re-suspended the digested tissue with 1 mL of pre-warmed N2 medium to wash out the digestion buffer, and gently pipet the sample solution a maximum of 5 times using a P1000 pipette.\n\tNote: Over-triturating with a narrow pipet tip can diminish cell viability and subsequent growth.\nCentrifuge the tube at 145 x g for 5 min. After discarding the supernatant, re-suspend the cell pellet in 1 ml of N2 medium.\nPrepare 1 ml of N2 medium in a non-coated 6-well plate and add 1 ml of the suspended cells to make a final volume of 2 ml.\nAdd EGF (20 ng/ml) and bFGF (20 ng/ml) into each well. Gently shake the 6-well culture dish by hand to mix the added growth factors with the plated cells. Keep the 6-well plate in a 37 °C and 5% CO2 incubator.",
    "Add EGF (20 ng/ml) and bFGF (20 ng/ml) to each well every day for 8 days. Every third day, add 200 µl of N2 media to maintain the approximate 2 ml volume of the medium.\n4. Passaging of NSCs as Neurospheres and to Monolayer Cultures\nGather the neurospheres and transfer them to a new 15 ml conical tube.\n\tNote: The number of neurospheres (>50 µm diameter) per well from the SCZ of a single mouse brain was 64.3 ± 7.31, which was less than that of the SVZ (190.5 ± 6.33)9.\nIncubate the neurospheres with 0.5 ml of dissociation buffer for 5 min in a 37 °C water bath to dissociate the neurospheres into single cells. Primary neurospheres can be dissociated into single cells and maintained over several passages as neurosphere or monolayer cultures.\n\tNote: Expanding SCZ-aNSCs as a monolayer is superior to neurospheres because SCZ-aNSCs can be passaged >10 times in a monolayer culture format, but <5 times in a neurosphere culture format.\n\tCaution: SCZ-aNSCs exhibit strong aggregation, and it is difficult to dissociate them into single cells. Thus, the neurosphere culture format is not recommended for routine cell expansion.\nGently pipet the sample solution up and down with a P1000 pipette less than 5 times and centrifuge the tube at 145 x g for 5 min. Discard the supernatant and re-suspend the neurospheres with 1 ml of N2 medium.\n\tNote: Over triturating with a narrow pipette tip can diminish cell viability and subsequent growth.",
    "To count the cells, make a 1:1 mixture of the cell suspension (10 µl) and the 0.4% trypan blue solution, and then count the number of live cells on a hematocytometer. After coating a 6-well plate with PLO/laminin, plate the cells at 2.5 x 105 cells/ml with 2 ml of N2 medium for each well.\n\tNote: Changes in cell density can affect their condition and differentiation potential.\nMaintain the SCZ-aNSCs with a daily treatment of growth factors (2 ml, 20 ng/ml) for 5 days, and them passage them.\n5. Differentiation of Subcallosal Zone-derived Adult Neural Stem Cells\nPlate aNSCs onto a PLO/Laminin-coated 18 mm coverslip with 1 x 105 cells/ml in 1 ml N2 with growth factors (20 ng/ml) for differentiation of the SCZ-aNSCs.\nThe next day, when the cells are firmly attached to the coverslip, exchange the growth medium with N2 to remove the growth factors.\nAfter 6 days, wash the differentiated cells with 1 ml of PBS to remove cell debris and fix them for immunostaining.\n\tNote: BrdU can be incorporated into the newly-synthesized DNA of proliferating cells. Therefore, if desired, BrdU (10 µg/ml) can be added to live cells before the fixation of cells.\n6. Immunostaining Adult Neural Stem Cells and Differentiated Progenitors\nFor immunostaining, wash the cells with PBS and fix them with 4% PFA for 20 min at room temperature.\n\tCaution: PFA is highly toxic; avoid contact with the skin and eyes.\nRemove the 4% PFA, rinse the fixed cells with PBS 3 times, and then store them at 4 °Cuntil they are needed for immunostaining.\nIncubate the cells on the coverslip with blocking solution (3% bovine serum albumin and 0.1% Triton X-100 in 1x PBS) for at least 30 min at room temperature.",
    "Prepare the primary antibodies in fresh blocking solution and incubate the samples overnight at 4 °C.\n\t\nImmunostaining the aNSCs\n\t\t\nStain the aNSCs using anti-Nestin and anti-BrdU antibodies. Before fixation, add 20 µg of BrdU to the aNSCs and incubate them for 2 h. Perform the denaturing step using 2 N HCl for 20 min at 37 °Cbefore performing the blocking step.\nImmunostaining the differentiated progenitors:\n\t\t\nUse anti-O4, anti-bIII-tubulin, and anti-glial fibrillary acidic protein (GFAP) antibodies to label the differentiated progenitors.\nWash the samples with PBS 3 times and incubate them with secondary antibodies conjugated to fluorescent dyes (1:500) in blocking solution for 30 min at room temperature. Then, wash the samples 3 times with PBS.\n\tNote: Use secondary antibodies that match the hosts of the primary antibodies. Hoechest33343 (1:2,000) is used for nuclear staining.\nAdd mounting solution to a slide glass and proceed with mounting. Observe and image the sample on a confocal microscope at multiple wavelengths: FITC (488 nm), Cy3 (543 nm), Cy5 (647 nm), and Hoechest33343 (405 nm).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}