{
  "id": 8417,
  "origin_website": "Jove",
  "title": "Laser-Induced Brain Injury in the Motor Cortex of Rats",
  "procedures": [
    "The following procedure was conducted according to the Guidelines of the Use of Experimental Animals of the European Community. The experiments were also approved by the Animal Care Committee at the Ben-Gurion University of the Negev.\n1. Animal selection and preparation\nSelect 65 male Sprague-Dawley rats weighing 300 to 350 g with no overt pathology for this procedure. The smaller size poses technical difficulties for the MCAO procedure.\nAssign 3 rats per cage and let them adapt for least 3 days.\n2. MCAO procedure\nSelect 25 rats for MCAO allowing for 10—20% mortality associated with the procedure11.\nPerform MCAO using a standard technique, as previously described in detail12.\n3. Laser-induced brain injury experimental procedure\nAssign 20 rats to a group marked as laser group and 20 rats to another control group (sham-operated).\nSubject the laser group rats to laser irradiation at 50J X 10 points in the following manner:\n\t\nAnesthetize rat with a mixture of 2% isoflurane in oxygen allowing for the spontaneous ventilation. Check for sufficient anesthetic depth by pinching the tail with forceps to see the absence of the withdrawal reflex.\nMaintain the core body temperature of the rat at 37 ˚C throughout the experimental procedure using a rectal temperature regulated heating pad.\nRemove local hair with a shaver and disinfect with 70% alcohol and 0.5% chlorhexidine gluconate. Repeat the disinfection step two more times.\n\t\tNOTE: The size of the surgical incision should be approximately 3 cm. Remove hair at least 2 cm around the incision area.\nPlace the rat on a stereotaxic head holder in a prone position and make a 3 cm incision to reflect the scalp laterally and to expose the area between Bregma and Lambda.\nMaintain anesthesia through the nose cone.",
    "Use Neodymium-YAG (Nd-YAG) laser (peak wavelength 1064 nm) to administer 50J X 10 points, with 1 s pulse duration, to the exposed area of the skull above the right hemisphere.\nEnsure that the laser generating part of the apparatus is at a 2 mm distance from the exposed area to produce a laser beam. 50J X 10 points was selected after careful evaluation of different energy/surface combinations. This combination is efficient and does not cause bone destruction of the skull after administration for less than a second10.\n\t\tNOTE: 2 mm is the distance between the terminal of the laser beam (from the optical cable it is passed through) and the skull bone. In case a focusing lens is used, the distance should be calculated taking into account the angle of inclination of the lens to focus the beam in the desired area of damage. Ensure proper safety when using a laser device including appropriate training and eye protection.\nRemove the rat from the device and close the scalp with 3-0 silk surgical sutures.\nDiscontinue anesthesia and return the rat to its cage for recovery. Administer 0.1 mL of 0.25% bupivacaine locally to reduce the postoperative pain immediately after surgery.\n\t\tNOTE: The entire procedure should last less than 5 min if performed correctly.\nObserve the rat for any signs of distress during post- anesthesia recovery. Prior to emergence from anesthesia, give 0.01mg/kg intramuscular buprenorphine for postoperative analgesia and continue with repeated doses every 12 h for at least 48 h.\nSubject control rats to the same conditions without subjecting them to the laser.\n4. Neurological severity score (NSS)",
    "Evaluate the neurological severity score 24 h after the laser-induced brain injury using a 43-point score13. Test the animals for neurological deficits, behavior disturbances, beam-balancing task, and reflexes, assigning higher scores for more severe disabilities, as previously detailed13.\n5. Post-injury manipulations\nAfter NSS evaluation, euthanize the rats by exposing them to 20% oxygen and 80% CO2 (via inspiration) and transcardially perfuse the rat with heparinized phosphate-buffered saline (PBS, 0.9% NaCl).\n\tNOTE: Ensure that CO2 is delivered at a predetermined rate in accordance with the Institutional Animal Care and Use Committee guidelines. This step may also be performed under 5% isoflurane anesthesia.\nHarvest brains and prepare for further examination as described in an earlier protocol11. \nEvaluate for subarachnoid hemorrhage (SAH) through visual examination of the whole brain after its isolation from the skull. If necessary, a microscope or magnifying glasses may be used for this purpose.\n6. Evaluation of the brain injury\nDetermining the brain infarct volume and brain edema by TTC staining\n\tNOTE: 2,3,5-Triphenyltetrazolium chloride (TTC) staining is a convenient procedure for brain infarct detection11.\n\t\nSection the harvested brains into 6 coronal slices, each 2 mm thickness.\nIncubate the set of slices from each brain for 30 min at 37 °C in 0.05% TTC.\nFollowing staining, scan the slices with an optical scanner with a resolution of 1600 X 1600 dpi.\nThe unstained areas of the fixed brain slices are defined as infarcted12.\nUsing an image processing software (e.g., freeware Image J) measure the unstained infarcted area, ipsi- and contralateral hemispheres for each of the 6 coronal slices.\nCalculate the infarcted volume as a percentage of the total brain:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60928/60928eq1.jpg\nCalculate brain edema using Kaplan method:\nimgsrc://cloudfront.jove.com/files/ftp_upload/60928/60928eq2.jpg\nDetermining the extent of blood brain barrier (BBB) breakage\n\tNOTE: Assess BBB breakage 24 h after the laser-induced brain injury as follows:",
    "Administer 2% Evans Blue mixed with 4 mL/kg saline solution intravenously to rats via the cannulated tail vein and allow the solution to circulate for 1 h.\nEuthanize rats by exposing them to 20% oxygen and 80% CO2 (via inspiration) 24 h after the last NSS, as previously described13.\nHarvest the intravascularly localized dye as follows:\n\t\t\nOpen the chests of the rats with surgical pincettes and surgical scissors.\nPerfuse the animals with cooled 0.9% saline via the left ventricle using 110 mmHg until obtaining a colorless perfusion liquid from the right atrium.\nHarvest the brains and slice them rostrocaudally into 2 mm slices.\nSeparate the left brain slices from the right portions to evaluate injured and non-injured hemispheres separately.\nWeigh, homogenize using mortar and pestle, and then incubate the brain tissues in 50% trichloroacetic acid for 24 h.\nCentrifuge the homogenized brain slices at 10,000 × g for 20 min.\nMix 1 mL of the supernatant from the centrifuged brain with 1.5 mL of 96% ethanol at 1:3 and assess blood-brain barrier breakage using a fluorescence detector at 620 nm excitation wavelength (10 nm bandwidth) and 680 nm emission wavelength (10 nm bandwidth).\n\t\tNOTE: Both groups of rats undergo the same protocol for determining BBB breakdown.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}