{
  "id": 13579,
  "origin_website": "Jove",
  "title": "Modified MicroSecure Vitrification: A Safe, Simple and Highly Effective Cryopreservation Procedure for Human Blastocysts",
  "procedures": [
    "The development of the µS-VTF procedure was conducted as part of an approved Institutional Review Board (IRB) study in 2008-2009 (Aspire IRB, Santee, CA) on human oocyte and embryo cryopreservation. The procedure has since been routinely applied to the clinical treatment of infertility patients who have signed informed consent forms.\n1. Quality-control Considerations\nUse different colors (e.g., pens, labels, or identification (ID) rods or plugs) to distinguish patients if cryopreserving more than one group of embryos in a day.\nUse different dishes and pipettes for each patient. Minimize the volume of medium transferred when moving the blastocysts from one solution to another.\nCryopreserve one blastocyst per straw or device. Maintain aseptic/sterile technique and adhere to all safety precautions.\nConfirm the Physicians' Referral Form and signed patient consent before initiating the procedures. Check the disposition of the patients' embryo(s) in inventory.\nUse a \"Release of Liability and Consent for Transport\" if the blastocysts are to be transferred to another facility. Ensure that all signatures are witnessed onsite or notarized.\nConfirm proper quality-control measures for the medium and the protein supplements, as appropriate, including bioassays, endotoxin determinations, and expiration/lot number verification and tracking.\nEstablish critical limits (i.e., low levels of concern) for clinical cryopreservation outcome monitoring and evaluation, such as recovery rates: < 95%, survival rates: < 80%, and clinical pregnancy rates using single-euploid blastocysts: < 50%.\n2. Cryopreservation Procedure\nPreparation\n\t\nComplete the appropriate paperwork, including entering data into the worksheets and the cryopreservation database and inventory log(s).\nPrepare fresh cryopreservation solutions or use a commercial source (abiding by the manufacturer's recommended storage and shelf-life conditions).\nStraw preparation.",
    "Open the labeling side of the individualized sterile packets. Detach the filling nozzle found on the traditional 0.3-mL embryo straw by grasping it against the packaging and partially lifting and pulling the straw out; this will expose the label end to ambient conditions while the straw rests aseptically inside the plastic package.\n\t\t\t\n(Modification) For 0.3-mL semen/embryo straws, push the plug down 0.5 cm. Apply an internal seal in front of the cotton-PVP plug through use of a basic tabletop impulse sealer.\nSet the straw onto the Teflon surface of the electrode, just in front of the plug. Depress the handle to activate the heat. Release the handle when the red light appears. To ensure a complete weld seal, heat at a temperature that sufficiently flattens the opposing surfaces, then flip it over 180° and reseal the opposite surface19 as needed.\nUsing a cryomarker, label each straw/device and cryogoblet with the patient name, a unique ID number (e.g., SSN, DOB, or patient ID number), and the date of freezing. Also include a unique number on each straw/device (e.g., 1, 2, 3, etc.).\n\t\t\nSecure the label (preferably colored) onto a color-weighted ID rod to be inserted and sealed into a 0.3-mL embryo straw. Return the straw to its individual sterile package until use.\nNote: If only 30-mm color-weighted ID rods are available, then the additional insertion of two ball bearings is needed, adjacent to each side of the ID rod.\nIdentify each cane with a unique inscribed ID number. Identify a LN2 storage tank number and a canister number where each patient's specimen(s) can be stored long-term.",
    "Prepare fresh cryo dishes (100 mm) by labeling the bottom surface with the patient name, solution ID, and embryo/holding droplet ID (Figure 1A). Specifically, set up 4 rows of droplets: isotonic hepes-buffered medium (top), V1 (equilibration solution (ES)), V2 (intermediate solution (IS)), V3 (vitrification solution (VS); bottom). Write the embryo ID on the upper-right side with labeled columns.\nNote: A series of 25- to 50-µL wash droplets (n = 3) is used to ensure that each individual final 10- to 15-µL holding droplet/solution type (i.e., V1, V2, or V3) is pure and undiluted. Using this approach, up to five individual embryos can by vitrified using a single dish. Keep each dish covered when not in use to avoid any room temperature evaporation/dehydration of the droplets.\nPrepare sterile flexipettes by cutting 3 cm off their base end (referred to as \"VTF tips\"). Insert them onto individual pipettes (set at 3 µL) and set the pipette-VTF tips upright in a styrofoam tube rack (Figure 1B).\nEmbryo Selection\n\t\nConfirm patient/specimen identification.\nUsing an inverted microscope (200 - 400X magnification), grade and classify the blastocysts according to the Gardner grading system20, using a numeric classification of 1 to 6 for early to hatched blastocysts, respectively, and an A, B, or C grade assigned to the inner cell mass (ICM) and trophectoderm (TE).\nNote: In preparation for blastocyst biopsy and euploidy analysis, the zona pellucida is pre-hatched by laser ablation on Day 3 to promote the early herniation of the TE and thus requires a modified grading classification2. In brief, Grade 3 full blastocysts exhibit up to 10% TE herniation, Grade 4 expanded blastocysts are 10 - 50% hatched, and Grade 5 hatching blastocysts have > 50% TE extrusion (Figure 2A-C).",
    "Note: Our preference is to cryopreserve Grade 3 or higher blastocysts of ≥BB quality on Day 5 or 6. However, vitrified blastocysts of lower quality (C) and post-compaction embryos at earlier stages (including late morula to Grade 1 or 2 blastocysts) can certainly survive warming completely intact and yield viable embryos capable of achieving live births.\nCollapse the blastocoele of each blastocyst prior to the onset of the cryodilution process by micropuncturing a trophectoderm junction or by performing a laser pulse ablation of a trophectodermal cell21 if using low-molarity vitrification solutions (< 6.5 M or 40% v/v).\nNote: The need to collapse the blastocysts is not device dependent. In our own early development of µS-VTF (2008), we initially used ethylene glycol (EG)/DMSO solutions successfully with oocytes (1 out of 1 full-term pregnancy), but a sub-optimal (< 80%) survival/development of mouse blastocysts16 was experienced by others21. Since high molar glycerol-based solutions (exceeding 7.9 M) are used in our current VTF system (since 2009), physical blastocoele collapse is unnecessary. However, the selective hatching of hatched blastocysts is advisable in general.\nCryodilution and Blastocyst Loading\n\t\nRemove the patient culture dish from the incubator and confirm patient/specimen identification with another person (i.e., witnessed by a secondary source) before removing the embryo(s) to be vitrified.\nConfirm blastocyst development per step 2.2.2, update the cryo data sheet, and, under stereomicroscopy, pipette blastocyst(s) from the culture dish into an isotonic holding droplet of the cryo dish.\nMove each blastocyst into individual holding droplets using the vitrification flexipette (i.e., the VTF tip).\nMove each blastocyst into V1 (ES) solution.\n\t\t\nPrefill the flexipette with V1 solution (3 µL) and place half the contents onto the embryo.",
    "Aspirate the embryo and move to the first of three V1 wash droplets (referred to in step 2.1.6), pipette the embryo 2 - 3 times around perimeter, and clear the pipette contents in the droplet (avoiding bubble formation) or outside on the dish surface.\nFill the VTF tip with the next V1 wash drop and repeat the aspiration of the embryo(s). Repeat a third time and move the blastocyst(s) to an individual V1 holding drop. The dilution/washing steps should take 30 to 45 s. Pre-load each VTF tip with the next solution (e.g., V2), insert the pipette in a rack, and use the next pipette (according to the setup in step 2.1.7) (Figure 1B).\nNote: Since the total exposure time in non-dimethyl sulfoxide (DMSO) containing V1 and V2 solutions is 5 min each, the pipetting of individual blastocysts should be evenly staggered within that interval, considering that the final V3 step will require at least 1 min per blastocyst to perform. For example, if there are 4 blastocysts in a vitrification group, pipette blastocysts #1-2-3-4 at 75-s intervals.\nNote: The Innovative Cryo Enterprises (ICE) dilution protocol described above is distinctly different than most other commercial vitrification procedures, which generally involve DMSO-containing solutions. Those protocols achieve the same stepwise dilutions through a gradual, but less controlled, merging of wash solution (i.e., isotonic medium), ES, and VS.\nRepeat steps 2.3.4 and 2.3.5 using V2 (IS) solutions.\nRepeat steps 2.3.4 and 2.3.5 using V3 (VS) solutions.\nUpon placing each blastocyst in the V3 holding droplet, clear the residual solution and bubbles from the VTF tip (outside the droplet), and then fill the tip completely with clean V3 around the embryo. Expel approximately one-third of the volume (1 µL) and pipette the blastocyst(s) and remaining V3 completely into the VTF tip.",
    "Remove the VTF tip from the pipette, wipe the tip dry of residual V3 on the outer surface by using a sterile gauze pad, and insert the tip end-first into the open end of the pre-labeled straw. A \"dry tip\" is critical to preventing possible inner straw adherence.\nInvert the straw (label end down), observe the tip at the inner plug or seal, and safely seal the open end with 1 cm of air space. Preferably, use an automatic sealing device (e.g., Syms I) to eliminate technical variation.\nNote: The advantage of using straws that are composed of an ionomeric resin plastic (e.g., HSV or µS-VTF) is that using any properly-operated heat sealing device creates a reliable \"weld\" seal, as noted in step 2.1.3.1.\nOnce sealed, plunge the closed straw directly into LN2 in a stainless steel Dewar flask and place the straw(s) into the open goblet attached to the patient's cane for storage.\nNote: Because µS-VTF straws use 40-mm weighted ID rods to offset the buoyancy of the air-filled straw, the use of inverted goblets or empty cryovials to cover the specimen(s) is not required unless transportation is involved.\nWarming and Cryo-solution Elution/Dilution\n\t\nConfirm the Physicians' Referral Form regarding vitrified embryo transfer date, scheduled time, and embryo details (number to thaw/transfer, specific embryo number if PGS tested, etc.).\nPrepare fresh warming solutions (1.0 M sucrose stock solution) and/or use a commercial source (recommended 1 week-1 month of shelf life once in use, 4 °C storage).\n\t\t\nAliquot 17.1 g of sucrose into 50-mL sterile flasks upon initial opening (e.g., weekly supply source) due to the risks of endotoxin accumulation in sucrose granules upon repeated ambient exposure.",
    "Mix pre-weighed granular sucrose into solution (1.0 M stock = 3.42 g/10 mL of hepes-buffered human tubal fluid [H-HTF]) and warm the solution up to 37 °C to increase the solubility of the granules. Repeatedly invert the container to help speed up and complete the final mixing.\nNote: Filtration (0.22-µm filter) performed using positive pressure filtration units is recommended for viscous solutions (> 0.5 M sucrose) or high volumes. Hand pressure pumps are sufficient and inexpensive, whereas an electrical pump is noisy, causes vibrations, and is simply not required.\nWarm (37 °C) one 10-mL tube each of 1.0 M sucrose solution and H-HTF medium per patient for µS-VTF warming bath use.\nPrepare fresh thawing dishes (6-well plate) by labeling the cover surface with the patient name and the solution IDs.\nNote: In this case, we used: (1) T1 wash (200 µL without oil overlay, (2) T1 (100 µL) with 1 mL of oil, (3) T2 (100 µL) with oil, (4) T3 (100 µL) with oil, (5) T4 (100 µL) with oil, and (6) T5/200 µL isotonic HEPES-buffered medium with 10% human serum albumin (HSA) or 20% serum substitute without an oil overlay. Apply a universal sucrose solution step-down protocol-T1 = 1.0 M, T2 = 0.5 M, T3 = 0.25 M, and T4 = 0.125 M-if the ICE or another commercial source is not available, as proposed for slow-frozen embryos22. Furthermore, note that the initial T1 wash and the final T5 equilibrations can be performed in 30-mm Petri dishes and the 4-well dish used for steps 2-5 above, involving an oil overlay.\nThaw only one patient's embryo(s) at a time.",
    "Check the Physicians' Referral Form and confirm the cycle before warming the indicated number (i.e., 1 or 2 blastocysts); assess survival/probable viability by observing osmotic changes (i.e., shrinkage and rehydration) and intact membranes, and, if questionable, contact the physician and/or patient before warming another blastocyst.\nConfirm patient/specimen identification with a co-worker (i.e., witnessed by a secondary source).\nPlace the patient cane in a Dewar flask filled with LN2 and isolate identify the straw to be warmed.\nBring the 6-well dilution dish to the center of the stereomicroscope stage. Placing a 60-mm Petri dish off to one side (i.e., depending on the left-hand or right-hand preference of the technician), add the warmed sucrose (1.0 M) and H-HTF solutions to create a 0.5 M sucrose warming bath (uncovered).\nNote: VTF tips are only warmed in 0.5 M sucrose solutions as a QC safeguard, to insure the retention of embryo viability in the rare event that an embryo is expelled upon rapid warming22.\nHold the upper straw seal above liquid level to confirm the identity, and then grasp and secure the straw below the internal plug using Mayo scissors (the VTF tip should still be submerged in LN2).\n\t\t\nFirmly tap the scissors on the Dewar flask (a couple times) to remove the VTF tip from the inner straw sidewall as a QC precaution; if the VTF tip is adherent, the tapping ensures that the tip base drops to the sealed end opposite the labeled end, thus providing an air space near the plug end.",
    "Lift the straw with the scissors into ambient air in a horizontal position (next to or below the stereoscope surface) and grasp the non-labeled end (label to the right side). Cut the straw at the inner plug or seal and lift it above the warming bath dish. Pour the VTF tip into the warm sucrose bath at a 60° angle until it is completely extruded and has been rapidly warmed (> 6,000 °C/min); the base of the flexipette will rest above the dish sidewall.\n\t\t\nAllow the VTF tip to free-fall into the bath. Gently tap the upper straw surface if the tip does not immediately emerge. If it only appears part way, assist in the extrusion by grasping the shaft of the flexipette with the scissors or fine forceps.\nAfter 5 - 10 s, grasp the pipette base and insert into a disposable pipetting device; a hole in the bulb acts to release pressure upon insertion. Cover the bulb hole with an index finger and gently squeeze the bulb to release the vitrified blastocyst into the T1 wash (#1) while viewing by stereomicroscopy. Once confirmed, clear the residual V3 (VS) solution and bubbles by positive pressure, evacuating the contents into the center, unused discard well. Start a 5-min timer.\nNote: All sucrose dilution steps are performed at room temperature (21 ± 2 ºC).\nRemove VTF tip and place it onto a pipette. Proceed by moving the embryo into T1 #2 under oil for the remaining time (approximately 3 - 4 min).\n\t\t\nIf a second blastocyst is required for transfer, immediately warm a second straw and VTF tip (repeating steps 2.4.9 - 2.4.11) from the patient before initiating step 2.4.12. Move both blastocysts together for a minimum elution in T1 (1.0 M sucrose) of at least 3 min.",
    "Pre-fill the flexipette with the next solution, and then move and dilute the blastocyst(s) in T2, T3, and T4 at 3-min intervals. If the zona pellucida has not been previously laser ablated (i.e., hatched), do so in T4. Place the dish onto the stage of an inverted microscope and image the embryo on a computer monitor. Align the zona within a designated red circle and activate 2 or 3 impulses of a diode laser (beginning at the edge of the perivitelline space and moving outward) to create an opening2,19.\nEquilibrate the blastocysts in T5 (i.e., isotonic medium) for 5 min on a warm surface (37 °C).\nAssess the initial embryo survival based on the predominant presence of intact cell membranes with even, translucent cytoplasms devoid of pyknotic darkening. Place the embryo(s) into culture for 2 - 6 h before embryo transfer, at which time, the embryo development/survival should be re-evaluated and documented.\nNote: If more than 1 viable blastocyst exists at the time of transfer and the patient opts to proceed with only 1 blastocyst, the supplemental blastocyst can then be successfully re-vitrified (rVTF) by repeating steps 2.3.3 - 2.3.11. We have several confirmed live births following single rVTF events.\nNote: rVTF has been experimentally performed up to 5 times without a significant effect on the survival/viability of aneuploidy human blastocysts vitrified in a metastable glycerol-based solution."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}