{
  "id": 11078,
  "origin_website": "Jove",
  "title": "Millifluidics for Chemical Synthesis and Time-resolved Mechanistic Studies",
  "procedures": [
    "Millifluidics set-up: Purchase a millifluidic chip (made of polyester terephthalate polymer) from Microplumbers Microsciences LLC, which has serpentine channels with dimensions of 2 mm (W) x 0.15 mm (H) x 220 mm (L). Use FEP Tubing  with dimensions of 0.25 mm I.D., 1/16 in O.D., for connecting the chip to the pump. Use two different pumps for the two different experiments. Use P-Pump for the first experiment (copper nanoparticles) and the millifluidic device for the second experiment (gold nanoparticles). To minimize the problem of gas bubbles within the channels, freshly prepared NaBH4 solution was left open to stand for ~10-15 min before pumping into the chip so that the gas bubbles escape from the solution. This step was followed for all of our experiments.\n1. Synthesis of Ultra-small Copper Nano Clusters (UCNCs)\nChemicals required: Obtain copper(II) nitrate hydrate, sodium borohydride, sodium hydroxide pellets and O-[2-(3-mercaptopropionylamino)ethyl]-O'-methylpolyethylene glycol (MW=5,000) [MPEG] and use all chemicals without further purification. Use nanopure water (18.2 MΩ-cm) for the experiment.\nUse P-Pump regulated under nitrogen pressure for the experiment. Test the pumps with water as solvent at different pressures prior to the experiment to correlate with the corresponding flow-rates (ml/hr). Rinse the millifluidic reactor and tubing with deionized water before initiation of the experiment.\nDissolve 174 mg (0.95 mmol) of copper(II) nitrate and 610 mg (0.122 mmol) of O-[2-(3-mercaptopropionylamino)ethyl]-O'-methylpolyethylene glycol in 28 ml of nanopure water and keep them in a vial to be connected with one input channel\nKeep another solution of 111 mg (2.93 mmol) of sodium borohydride and 102 mg (2.78 mmol) sodium hydroxide in 28 ml (pH ~13) in a different vial and connect it with the other input channel.",
    "Flow both the solutions simultaneously within the millifluidic reactor at different flow-rates (given below) and collect the resulting UCNCs at the outlet in glass vial. Purge the solution with nitrogen and store it under nitrogen.\nOperate the pumps under different constant pressures of 50 mbar (6.81 ml/hr), 100 mbar (14.31 ml/hr), 200 mbar (32.7 ml/hr) and 300 mbar (51.4 ml/hr) at room temperature for the synthesis of UCNCs at different flow-rates.\nWhile the synthesis procedure was demonstrated using the millifluidic set-up with P-Pump, it can also be carried out using the hand-held millifluidic device from Millifluidica.\n2. Time Resolved In situ Kinetic Studies on Gold Nanoparticle Formation\nChemicals required: Obtain chloroauric acid (HAuCl4.3H2O) meso-2,3-dimercaptosuccinic acid (DMSA) and sodium borohydride and use all chemicals without further purification. Use nanopure water (18.2 MΩ-cm) for the experiment.\nUse high precision, fully automated, pulsation free syringe pumps to flow the liquids within the chip. Test the pumps with water as solvent at different flow-rates prior to the experiment to optimize the required flow-rate.\nPrepare standard solutions of (i) HAuCl4.3H2O (10 mmol, 118.2 mg/30 ml) and (ii) DMSA (20 mmol, 109.2 mg/30 ml) with 50 mg of sodium hydroxide (pH 12) in nanopure water.\nFeed the two solutions through two separate syringes into the millifluidic chip at a constant flow-rate of 10 ml/hr using the automated pump.\nCouple the millifluidic chip to the synchrotron beam line using a metal stage that has access to movement in XYZ directions and collect the XAS data at different zones on the chip as the solutions were pumped through the chip.\nWhile the in situ analysis procedure was demonstrated using the millifluidic set-up with P-Pump, it can also be carried out using a hand-held millifluidic device.\n3. Continuous Flow Gold Catalysis",
    "This procedure was demonstrated using a hand-held millifluidic device.\nChemicals required: Obtain chloroauric acid (HAuCl4.3H2O), meso-2,3-dimercaptosuccinic acid (DMSA), sodium borohydride, 4-nitrophenol, 4-aminophenol and use all the chemicals without further purification. Use nanopure water (18.2 MΩ-cm) for the experiment.\nCatalyst preparation: Prepare standard solutions of HAuCl4.3H2O (10 mmol, 118.2 mg/30 ml), DMSA (20 mmol, 109.2 mg/30 ml) and NaBH4 (10 mmol, 11.34 mg/30 ml) in Nanopure water.\nTake 10 ml each of HAuCl4 and DMSA solutions into two separate vials and flow them within the chip using the hand-held millifluidic device with a uniform flow-rate of 12 ml/hr for 45 min.\nFlow 10 mmol NaBH4 within the chip at 12 ml/hr flow-rate for 15 min to reduce the Au(I) to Au(0).\nFinally, wash the chip with nanopure water for 30 min at the same flow-rate before conducting the catalysis experiments.\nCatalysis reaction: Perform the chemical conversion reaction (reduction) of 4-nitrophenol (4-NP) into 4-aminophenol (4-AP) within the gold catalyst (prepared above) coated millifluidic channel as given below.\nMix 15 ml of 9 x 10-5 mol solution of 4-NP with 3.3 ml of 0.65 mol NaBH4 solution to form 4-nitrophenolate ion (4-NPI).\nPass the resultant solution over the gold catalyst deposited within chip at a constant flow-rate of 5 ml/hr to evaluate the catalytic activity. Analyze the UV-Vis spectra of the collected products within the wavelength range of 250-500 nm to confirm the conversion of 4-NP.",
    "Estimate the catalytic activity of the reaction by obtaining the calibration curve of 4-NPI. Calibration curve can be acquired by plotting the experimentally observed absorption intensity (I) of 4-NPI at different standard concentrations. The peak heights (at 399 nm) for the UV-Vis absorption curves represent the absorption intensity (I) values and according to the Beer Lambert's law, any change in the peak height value would show corresponding change in its concentration. Therefore, estimate the catalytic activity by finding the difference in initial and final concentrations of the reactant from the calibration curve. For example, if the peak height is 1 unit (Figure 6) it corresponds to a catalytic conversion of 90% (based on the calibration plot).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}