{
  "id": 13436,
  "origin_website": "Jove",
  "title": "Dissection and Staining of Drosophila Pupal Ovaries",
  "procedures": [
    "1. EggLaying\nCombine approximately ten male and fifteen female adult Drosophila flies of the desired genotype in a vial of normal rich fly food supplemented with yeast. To avoid overcrowding the vial, allow mated females to lay eggs for no longer than 2–4 h14.\nTransfer the adults from the vial into a new vial by tapping the vial opening against a different vial with fly food. Allow the eggs to develop into larvae at room temperature for 3–4 days.\n2. Selecting Female Larvae\nUsing a moist fine brush with soft bristles, make a rolling movement with the brush along the wall of the vial to transfer wandering third-instar larvae from the vial to a glass well filled to the brim with 1x phosphate-buffered saline (PBS). Wash the food debris off the larvae by transferring them to another well filled with 1x PBS.\nSeparate the male and female larvae using forceps. Identify the male larvae by a pair of large, round, and translucent testes embedded in fat body on the lateral side of the body approximately two-thirds down from its anterior end15. Female larvae are on average bigger, less translucent than males, and have much smaller gonads that are more difficult to detect.\nSelect against male larvae to collect female larvae. Collect at least ten females from the well. Place the female larvae into a separate well filled with 1x PBS.\nUse forceps to transfer the female larvae gently into a new vial of fresh fly food supplemented with yeast.",
    "Place the vial with the female larvae in a dark location to facilitate pupariation16. Throughout the day, monitor the larvae for pupariation. As each larva immobilizes and develops into a prepupa, circle the prepupa against the vial and record the approximate time when it first forms into a prepupa. Identify prepupae by the protrusion of anterior spiracles and timing of puparium formation17. Allow the prepupae to develop to the desired time point (measured in hours after puparium formation, APF).\n\tNOTE: Any animal that undergo puparium formation within an approximately 10 h interval can be considered a prepupa. The pupal stage begins approximately 12 h after puparium formation after an internal molt has taken place.\n3. Preparing Pupae for Antibody Staining\nForm a thin glass pipet to be used in later steps for clearing out the pupal fat body.\nMelt the glass tip of a Pasteur pipet over a Bunsen burner. As the glass melts, use forceps to pull the tip horizontally away from the rest of the pipet to form a thinner tip.\nAfter cooling, break off a small portion of the pipet tip to form a neat circular opening. Attach a bulb to the other end of the pipet.\nLoad the pipet with 1x PBS.\nTo harvest the pupae, which are glued to the wall of the vial, apply a small drop of water along the contact zone between pupa and vial. Wait 1–2 min to let the protein glue dissolve before gently lifting the pupa off the wall with a moist fine brush. Transfer the pupa to a glass well filled with 1x PBS. Dedicate a single well per pupa to avoid overcrowding the well.",
    "While grasping the posterior end of the pupa with one pair of forceps, carefully tear the anterior portion of the pupal case with another pair until the head of the pupa is visible.\nGrip the anterior-most tip of the pupal head with forceps and gently pull the pupa out of its pupal case.\n\tNOTE: A portion of the fat body may spill out during this process.\nSeparate and discard the anterior half of the pupa from the posterior half until only the abdominal sack remains.\nExtract the fat body cells from the abdominal sack.\nGrasp the abdominal sack against the bottom of the well with forceps in one hand while holding the thin glass pipet filled with 1x PBS in another hand.\nAim the thin pipet tip towards the opening of the sack and slowly pipet 1x PBS into the abdomen to wash away the fat body cells surrounding the pupal ovaries.\n\t\tNOTE: The ovaries are a pair of small, translucent, striated, and oblong structures that should remain inside the abdominal sack.\nWash away the fat body cells until at least two-thirds of the fat body is gone or until the ovaries are visible near the opening of the abdominal sack. It is very important to execute this step slowly so as not to wash the ovaries out of the abdomen by accident.\nExamine the well to check if the ovaries have spilled out during the fat body cell wash. If the ovaries are not visible inside the well, they should have remained in the abdomen. If the ovaries have come out, place a new pupa in the well and repeat this step.",
    "Transfer the abdomen into a clear coverglass chamber filled with fixation buffer (1x PBS, 4% paraformaldehyde) and place the lid on top. To ensure a sufficient number of ovaries withstand the staining and mounting process, dissect more ovaries than needed.\n\tCaution: The fixation buffer contains paraformaldehyde which is toxic. Please wear appropriate protections such as gloves, safety glasses, etc.\n4. Immunohistochemistry\nThroughout the staining process, use forceps to gently push down any floating ovaries to the bottom of the cover glass well to ensure that the ovaries are completely immersed in antibody solution.\nPlace strips of double-sided tape onto the flat surface of a Nutator and then place the chambered coverglass on the adhesive surface.\nIncubate the ovaries in fixation buffer from step 3.7 for 15 min at room temperature.\nRinse the ovaries three times in 1x PBS with 1% Triton X-100 for 5, 10, and 45 min (1 h in total), respectively, to allow thorough permeabilization.\nBlock the ovaries in 10% normal goat serum in 1x PBS with 0.5% Triton X-100 for 30 min.\nIncubate the ovaries overnight in 600 µL of primary antibody of choice diluted to the appropriate concentration in 1x PBS with 0.5% Triton X-100 at 4 °C.\nRinse the ovaries three times for 5 min in 1x PBS with 0.5% Triton X-100.\nIncubate the ovaries for 2 h in 600 µL of secondary antibody of choice diluted to the appropriate concentration in 1x PBS with 0.5% Triton X-100 at room temperature.\nRinse the ovaries twice for 5 min in 1x PBS with 0.5% Triton X-100 and once for 5 min in 1x PBS.\n5. Dissecting and Mounting Pupal Ovaries",
    "Place a small drop of 1x PBS onto a microscope slide. Use forceps to transfer the abdominal sack from the chambered coverglass to a glass well filled with 1x PBS. Dedicate a single well per pupa to avoid overcrowding the well.\nTear apart the abdominal sack and any remaining fat body with forceps.\n\tNOTE: The ovaries, which are a pair of small, translucent, striated, and oblong structures, should be visible inside the well. The ovaries are often tightly surrounded by the fat body, so it is important to make sure all fat body is thoroughly torn apart.\nTransfer the ovaries from the well into the drop of 1x PBS on the microscope slide by grasping the center of the ovaries between the tips of the forceps. It is very important to use a firm grip without squeezing the ovaries so as not to lose or destroy them during the transfer. Add a few drops of 1x PBS to the slide when the solution dries out over time.\nOnce all ovaries have been dissected and transferred to the microscope slide, pipet 40 µL of mounting medium onto a 22 mm x 22 mm coverslip and place the coverslip gently on top of the ovaries. Let the slide dry overnight prior to imaging.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}