{
  "id": 13145,
  "origin_website": "Jove",
  "title": "Cryo-injury Induced Heart Regeneration in the Axolotl and Echocardiography and Unbiased Quantitative Histology to Evaluate Regenerative Progression",
  "procedures": [
    "This protocol complies to all institutional (Aarhus University) and national (Danish National Animal Experiments Inspectorate protocol# 2015−15−0201−00615) animal care regulations and guidelines.\n1. Preparation of cryoprobe\nCut three strands of copper wire with 1 mm diameter into 10 cm pieces.\nCoil copper strands into one string.\nWith a gas torch melt one end of the copper string to form a spherical ending with a 2 mm diameter.\n\tNOTE: Copper has a high thermal conductivity (401 W m-1 K-1 at 0 °C) and can be molded at easily manageable temperatures (melting point 1084.6 °C) but a copper surface has a tendency to corrode over time especially if it comes into contact with blood, which lowers thermal conductivity markedly. Thus, a copper based cryoprobe must be polished occasionally. Alternative more stable metals that can also be used for cryoprobes are silver (thermal conductivity 428 W m-1 K-1 at 0 °C, melting point 961.8 °C) and gold (thermal conductivity 318 W m-1 K-1 at 0 °C, melting point 1064.2 °C).\nRemove the piston from a 2-mL syringe and pull off the soft rubber head.\nInsert the non-spherical end of the copper string through the syringe and tie it to the pistol\nPut the piston back in place in the syringe (Figure 1A).\n\tNOTE: When the cryoprobe is not in use, the copper string should be protected by drawing the piston fully back. When in use, the piston is pushed all the way in to expose the copper string to the cooling bath.\n2. Cryoinjury induced myocardial infarction\nAnaesthetize axolotl by immersing it in 200 mg/L of benzocaine anesthetic. Thirty minutes of immersion will yield ~2.5 h of complete anesthesia.",
    "NOTE: Benzocaine is insoluble in water and should first be solubilized in 3 mL (per 200 mg benzocaine) acetone that is subsequently added to the water bath. Prolonged immersion in benzocaine can impair recovery, therefore time in benzocaine should be monitored carefully.\nPlace the axolotl with the ventral side up on a surgery dish (head to the left for a right-handed surgeon). Immobilize by encasing all body parts except the thorax in tissue wipes soaked in anesthetic solution (Figure 1B).\n\tNOTE: Encasing the animal in wet tissue wipes ensures a moist environment crucial for an aquatic amphibian and eliminates the need for vet ointment on eyes. Use autoclaved instruments in subsequent steps to ensure sterility during surgery.\nUse iridectomy scissors to make a ~1-cm longitudinal incision in the skin slightly right to the midline of the thorax (Figure 1C).\nUse forceps to free the cartilage plates of the pectoral girdle.\n\tNOTE: The pectoral girdle is a delicate structure and care should be taken not to damage its elements as this can impair later wound healing and animal locomotion and welfare.\nGently open the exposed pericardium with an incision without damaging underlying cardiac structures. Before pericardial fluid leaks out aspirate this into a 1 mL syringe carrying a blunt 2 Gauge needle (Figure 1D).\nPlace blunt forceps with a set opening (~1 cm) in the wound to keep wound edges and cartilage plates apart (Figure 1E).\nPlace the cryoprobe in liquid N2 with the copper wire exposed for at least 2 minutes.\n\tNOTE: If the mass of the copper wire is too small (i.e., it is too short) or if it is cooled insufficiently, an undesirable incomplete transmural cryoinjury can result.",
    "Gently wipe the exposed ventricle with a cotton swab or firmly rolled tissue wipes to make sure no fluid is present on the ventricle surface (Figure 1F).\nRemove the cryoprobe cooled to -196 °C from the liquid N2 and apply it directly to the exposed ventricle (Figure 1H). It will attach to the ventricle. Cryoprobe placement should be on the lateral side of the ventricle toward the apex to avoid damage to other cardiac structures and allow for subsequent transversal sections for microscopy containing both healthy and infarcted myocardium. After 10 s apply the previously collected pericardial fluid to the cryoprobe tip (Figure 1I). This will thaw the probe and allow for detachment from the ventricle.\n\tNOTE: Applying the cryoprobe on a ventricle with excessive water results in either incomplete cryoinfarction, if the probe is heated too rapidly, or too extensive myocardial damage, if a thin water layer covering the full surface of the ventricle is instantaneously frozen. Neither situation is desirable. In the case of a successful induction of cryoinjury, a small red circular swelling will appear on the ventricle (Figure 1J). When handling sham animals, a non-cooled cryoprobe is placed in a similar fashion for 10 s (Figure 1G).\nPlace the pericardium on top of the ventricle, remove the forceps that kept the wound open, and rearrange the cartilage plates of the pectoral girdle.",
    "NOTE: If performing subsequent echocardiography to evaluate cardiac function, it is crucial that all air pockets, even minute bubbles that are prone to occur under the cartilage plates, are removed as these induce imaging artifacts. These bubbles can be removed by gently pressing the tissue or by adding autoclaved amphibian Ringer’s solution (6.6 g/L NaCl, 0.15 g/L KCl, 0.15 g/L CaCl2, 0.2 g/L NaHCO3 in distilled water) to the wound surface to dissolve the air bubbles.\nSuture the skin (3-5 stiches) using dissolvable thread (6-0) (Figure 1K).\nCover the surgery area with wet tissue wipes lifted above the wound and then soak with anesthetic solution.\nPlace the surgery dish with the animal on ice for 2 h to allow the initial formation of a wound epidermis, sealing the wound edges before the animal is exposed to its non-sterile aquatic environment.\nTransfer the animal to a clean container with aquarium water. The animal it should be regaining consciousness by this time. Observe the animal until it has regained full consciousness and coordinated movements. Cease feeding and water changing for two days post-surgery and keep the axolotl alone in its own aquarium to allow wound closure before disturbances are reintroduced.\n\tNOTE: After regaining consciousness, most axolotls have a desire to gulp air. To ease this process and to limit the amount of movement needed, it can be beneficial to lower the water level in the aquarium shortly after surgery for 1-2 days post-surgery. A low concentration of benzocaine (20 mg/L) can be used as analgesic for 24 h post-surgery.\n3. Non-invasive measurement of infarction fraction with echocardiography\nAnesthetize axolotl as described in step 2.1.\nPlace the animal in a supine position in a small container with 3-5 mm of anesthesia solution covering the ventral surface.",
    "Place the ultrasound transducer along the long axis of the animal slightly to the right of the midline of the thoracic region.\nFor a two-dimensional estimation of infarction fraction [IF(ultrasound, 2D)], translate the transducer until the infarction zone and ventricle appear maximal on B-mode (Figure 2A-D, Supplementary Material 1-2).\nAcquire ≥3 cardiac cycles with > 50 frames/s.\nMeasure the cross-sectional area of the ventricle (CSAv) and of the infarction zone (CSAi) at end-diastole and estimate the two-dimensional infarction fraction by assuming a spherical ventricle shape and hemispherical infarction zone shape using the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61966/61966equ01.jpg (1)\n\tNOTE: To evaluate the geometrical assumptions of the shape of the ventricle and infraction zone, the transducer can be rotated 90˚ to display the short axis view of the heart (Figure 2E-F, Supplementary Material 3).\nFor a three-dimensional estimation of the infarction fraction, position the transducer to either the left or right until only a small portion of the ventricle appears in view at the end of ventricular diastole.\nIn steps (z) of 0.5 mm (for small animals, body mass ≤ 20 g) or 1 mm (large animals, body mass > 20 g) move the transducer across the ventricle and acquire at least 3 cardiac cycles per step/slice.\n\tNOTE: For reasonable precision 8 – 12 slices (n) should be acquired.\nMeasure CSAv and CSAi at end-diastole for each slice (j) and estimate three-dimensional infarction fraction [IF(ultrasound, 3D)] without any geometrical assumptions of ventricle and infraction shape using the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61966/61966equ02.jpg (2)",
    "NOTE: Both two-dimensional and three-dimensional acquisition can be used to measure cardiac function (stroke volume and cardiac output) geometrically as described in sections 3 and 6 of Dittrich et al. (2018)20. Likewise, pulsed wave velocity-acquired velocity time integrals (Figure 2G) can also be used to measure cardiac function as described in section 3 in Dittrich et al. (2018)20.\nExtract regions of interest of drawn CSAv and CSAi in step 3.9 as binary masks with z spacing between slices to three-dimensionally model the ventricle and infarction zone at end diastole and end systole (Figure 2H, Supplementary Material 4).\n4. Unbiased quantitative histology to measure infarction fraction\nExplore the heart of an anesthetized axolotl described in step 2.2 – 2.6.\nUsing a 1-mL syringe equipped with a 26-gauge needle, slowly inject 5 µL/g body mass of 1000 IU/mL heparinized amphibian Ringer’s solution into the sinus venosus and wait 2 min to let the anticoagulant distribute in the circulation.\nEuthanize by decapitation and brain pithing and excise the entire heart by first cutting the inflow vessels and then the outflow tract.\nTransfer the heart by gently lifting it by the outflow tract to a 60 × 15 mm2 Petri dish containing amphibian Ringer’s solution.\nUnder magnification, wash out any remaining blood in the heart by gently filling the sinus venosus with 100 IU/mL of heparinized Ringer’s solution.",
    "NOTE: While pre-fixation of the heart can be conducted by perfusing the heart with buffered formalin or paraformaldehyde, this is not necessary, since sectioning is carried out at a freezing temperature. Subsequently, fixation of the sections on glass slides can be performed. A fully washed heart will appear pale and whitish and contain no traces of red blood cells. Small blood clots on the surface of ventricle and atria are likely to form. They do not affect precision in the subsequent quantitative histology procedure.\nTransfer the heart to lint-free tissue paper to blot for 1 min.\nPrepare a cryomold of adequate size by applying a single drop of optimal cutting temperature compound and transfer the heart to the drop. Squeeze the heart gently to the bottom.\nApply more optimal cutting temperature compound to fill up the cryomold and make sure that the ventricle stays at the bottom. Leave the mold for 5 min to let the optimal cutting temperature compound distribute in the sample.\nSnap freeze the mold by placing it on a lid from a pipette tip box floating on liquid nitrogen.\n\tNOTE: For a more controlled snap freezing, hearts can be stored for 1 h-overnight in 10-30% sucrose solution and snap freezing can be performed using liquid nitrogen-cooled isopentane (2-methylbutane). In our experience, the end result is not markedly different.\nTemper the cryomold in a cryostat set at -18 to -22 °C for at least 1 h before sectioning.\nSection sample at 10 µm slice thickness and collect every 10th slice to provide a slab thickness (t) of 100 µm. Continue sectioning until entire heart is sectioned.",
    "NOTE: Different slice and slab thicknesses can be used, however it is important that slice collection starts at the very point the blade touches the ventricle and that the entire heart is sectioned with at least 10-12 evenly spaced slabs. More than one slice per slab can be collected to provide duplicate sets.\nStain tissue sections with standard protocols for hematoxylin & eosin or Masson’s Trichrome to provide a clear distinction between epicardium, myocardium, valves, and infarction zone.\nDigitize the tissues section using a camera microscope or slide scanner at sufficient magnification to clearly reveal the trabeculated structure of the axolotl ventricle (Figure 2I).\nLoad the image stack into ImageJ (https://imagej.nih.gov/ij/index.html) and initialize the cell counter plugin (https://imagej.nih.gov/ij/plugins/cell-counter.html).\nRun a multipurpose grid macro (https://imagej.nih.gov/ij/macros/Multipurpose_grid.txt) and generate a point grid with an adequate grid density.\n\tNOTE: Grid density (grid area) depends on the sample size and morphology. To provide a desirable precision, at least 100-200 intersections of grid points and each of the structures of interest should be ensured.\nCount the number of intersections between point grid and structures of interest using the cell counter plugin (Figure 2I, magnification on the right).\n\tNOTE: It is important for precision to include only those intersections that appear precisely at the aim point of the crosshair.\nCalculate the infarction fraction from the pre-defined point grid area [Ai(p) and Av(p)], the slab thickness, and the number of point grid intersections at each slab (Pj) with infarcted myocardium and total ventricular myocardium using the formula:\nimgsrc://cloudfront.jove.com/files/ftp_upload/61966/61966equ03.jpg (3)"
  ],
  "subjectAreas": [
    "Developmental Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}