{
  "id": 7353,
  "origin_website": "Bio",
  "title": "A Co-purification Method for Efficient Production and Src Kinase-mediated Phosphorylation of <em>Aplysia</em> Cortactin",
  "procedures": [
    "Transformation of plasmids into competent E. coli cellsObtain wild-type (WT) or mutant plasmids and thaw freshly prepared aliquots of competent BL21(DE3) cells while on ice.Add 2 µl (75-100 ng) of plasmid DNA to 50-100 µl of chemically competent cells.Mix thoroughly by flicking each tube and then placing the tubes on ice for 10 min.Transfer the tubes to a water bath set at 42°C for 45-60 s to ensure the uptake of plasmid DNA by E. coli cells.Following heat shock, put the mixture on ice for 5 min and then add 800 µl of room temperature LB media.Note: No antibiotic should be added to the media. Incubate the tubes at 37°C while shaking for 1 h to allow the bacteria to express the antibiotic resistance proteins.After 1 h, spread 50-100 µl of transformed cells onto solid LB media supplemented with antibiotics.Allow colonies to grow by incubating the plates at 37°C overnight (Figure 2a).Protein Expression and PurificationTransform kinase (Src2 or DNSrc2; pET-Duet), yopH (pT7-7) along with His6-SUMO fused WT cortactin or mutants (pSMT3) into E. coli BL21-DE3 competent cells as described above.Note: Each pET-Duet, His6-SUMO fusion, and GST-fusion constructs must be transformed separately into the competent cells. Pick a single colony of E. coli BL21 cells transformed with the expression plasmid and inoculate 10 ml of LB media containing 50 µg/ml kanamycin (for pSMT3) or 100 µg/ml ampicillin (for pT7-7 or pET-Duet) (Figure 2a). Incubate the bacterial culture overnight at 37°C while shaking.The next day, transfer the 10 ml starter culture to 1 liter of LB media containing 50 µg/ml of kanamycin (pSMT3) or 100 µg/ml of ampicillin (pT7-7 or pET-Duet).Note: 1 ml of overnight culture can be used to make 25% glycerol stocks and used in subsequent protein expression to save time and resources.",
    "Allow the large cultures to grow while shaking at 200 rpm at 37°C to an optical density (OD600nm) between 0.6 and 0.9 (3-4 h), and then induce expression with IPTG to a final concentration of 0.4 mM (Figure 2b).Grow induced cultures for an additional 4 h at 37°C while shaking.To eliminate the phosphorylation of induced proteins by bacterial kinase, combine YopH phosphatase cultures with cultures overexpressing cortactin or kinase (Src2 or DNSrc2) in a 1:1 ratio and 1:2 ratio, respectively (Figure 2b).Harvest the cells by centrifugation at 7500-8,000 × g at 4°C for 5-10 min.Flash freeze and store the pellets at -80°C until needed.Lysis and co-purification of pre-phosphorylated proteins with YopH phosphataseResuspend the bacterial pellets containing prephosphrylated proteins and YopH in 50 ml lysis buffer (see Recipes) supplemented with 5 mM PMSF protease inhibitor.Lyse cells by sonicating on ice for 4 min with a 30% duty cycle (30 s with continuous setting and 1 min rest).Transfer the lysate to a 50 ml centrifuge bottle. Isolate the soluble fraction by spinning at 27,000 × g for 35-40 min at 4°C (Figure 2c).Load the clarified lysate onto an equilibrated gravity flow column filled with 4 ml of cobalt resin. To accomplish binding of the his6-tagged proteins to the cobalt resin, shake gently at 4°C for 1 h.Wash the resin twice with 15-20 ml of wash buffer and then elute the protein of interest using elution buffer (see Recipes) stored at 4°C.Assess the purity of protein via 10% SDS-PAGE.To ensure cortactin purity, further subject the eluted cortain fraction to size exclusion chromatography (SEC) in SEC buffer stored at 4°C. Transfer the eluted protein onto a Hiload 16/600 Superdex 200 PG column using an ÄKTA pure system at a flow rate of 1 ml/min (Figure 4a and 4b).",
    "Note: Wavelength at 280 nm can be used to monitor the protein elution profile and chromatograms recorded using UNICORN software. Pool the peak fractions based on the SEC chromatogram and concentrate using an Amicon Ultra-4 concentrator (60 kDa cut-off) in a refrigerated benchtop centrifuge at 4°C.Determine the total protein concentration spectrophotometrically at 280 nm and/ or by Bradford assay of the fractions and measuring the absorbance at 595 nm. The extinction coefficient of Aplysia cortactin is 55,810 M-1 cm-1, and its predicted molecular weight is 100 kDa.Confirm the purity by 10% SDS-PAGE and western blotting (Figure 3a). Flash-freeze the proteins in aliquots and store at -80°C for further downstream experiments.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4158/bioprotoc-11-18-4158-g002.jpgFigure 2. Experimental outline of recombinant protein expression and co-purification process for Cortactin. A flow chart of the overall experimental steps described in this procedure. Pre-phosphorylated proteins (Cortactin or Src) are co-purified in the presence of YopH phosphatase followed by sequential affinity and Size Exclusion Chromatography (SEC).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4158/bioprotoc-11-18-4158-g003.jpgFigure 3. Recombinant expression of wild-type Aplysia cortactin and Src kinase in E. coli. (A) SDS-PAGE gel of affinity-purified WT cortactin co-purified with YopH phosphatase. The sample shows cortactin migrating as a predominant band corresponding to cortactin’s molecular weight of 95 kDa and fainter bands of lower molecular weight contaminants prompting the need for further purification by SEC. (B) Immunostaining of samples with 4F11 monoclonal cortactin antibody and monoclonal anti-His antibody confirmed the heterologous expression of Aplysia His6-tagged cortactin. His6-tagged dominant negative Src2 kinase (DNSrc2) was used as a control for both conditions.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4158/bioprotoc-11-18-4158-g004.jpgFigure 4. Purification profile of wild-type cortactin and mutants following Size Exclusion Chromatography (SEC). (A) Representative elution chromatogram of bacterially expressed and affinity-purified, recombinant WT and tyrosine phosphorylation mutants of cortactin (YFF, FYF, FFY, and FFF) (see Materials and Reagents section for details about mutants).",
    "The single peak at 55 ml elution volume corresponds to cortactin. Smaller peaks at 85 and 130 ml represent low molecular weight contaminants. WT cortactin also showed a second small peak at 45 ml, which may represent potentially oligomeric forms. (B) Coomassie-stained gel of WT and mutant cortactin proteins collected in the 55-ml elution volumes of the SEC peak in A. This figure is adapted from Figure 5A and 5B in our previous publication (Ren et al., 2019).Verifying cortactin expression using a specific antibodyObtain purified WT cortactin or mutant (pSMT3) and separate by SDS-PAGE on a 10% gel and then transfer to a nitrocellulose membrane.Block the membrane with 5% bovine serum albumin dissolved in TBST (see Recipes) for 30 min at room temperature.Probe the blots with the primary antibodies anti-cortactin (4F11) (Ren et al., 2019) or anti-His for 2 hours at room temperature.After washing with TBST, incubate the membrane with goat anti-mouse 680 antibody for 30 min at room temperature.Following extensive washing of the membrane with TBST, detect the signal using Odyssey imaging system (Figure 3B).In vitro kinase assay to assess cortactin phosphorylation by Src2Note: This procedure uses radioactive material, which should be handled with care. Consult the radiation guidelines of your institution to make sure you are authorized to work with radioactivity. Wear the proper personal protection equipment (PPE), keeping in mind exposure can cause deleterious effects.Prepare the phosphorylation reaction by adding 2 µg of SEC co-purified His6-SUMO-tagged WT or mutant cortactin with 0.2 µg Src2 or DNSrc2. In addition, perform reactions with WT Src2 and DNSrc2 alone to assess autophosphorylation as a control (see Figure 5).Incubate the proteins in kinase reaction buffer while on ice (20 µl aliquots).Initiate the kinase reaction by adding 2.5 uCi [γ-32P] ATP. Incubate for 20 min at 30°C.",
    "Quench the reaction by adding 5 µl of 4x SDS PAGE loading buffer.Separate the samples on a 10% polyacrylamide gel, and image the sample by auto-radiograpy or by using the Typhoon phosphor-imager (Figures 5 and 6).imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4158/bioprotoc-11-18-4158-g005.jpgFigure 5. Treatment with YopH phosphatase allowed the functional characterization of cortactin as a target for Src2. (A) Non-specific phosphorylation inhibited the ability of Src2 to phosphorylate cortactin in vitro. Representative autoradiograph and corresponding Coomassie stained gel of an in vitro kinase reaction showing no phosphorylation signal when the WT cortactin is incubated with Src2 at 30°C. The reaction was also examined in the presence and absence of phosphotyrosyl phosphatase inhibitor, Na3VO4, while being treated with a commercially available phosphatase; the results showed no phospho-specific signal. A known bacterial kinase (hpSEAA) was used as a positive control; no inhibitor or phosphatase was used here. (B) Autoradiograph and corresponding Coomassie stained gel of a representative in vitro kinase reaction showing that co-purification of YopH eliminated residual ATP from the protein, thus showing that Aplysia cortactin is a direct substrate of Src2 kinase in vitro. Dominant negative Src2 (DNSrc2) failed to phosphorylate cortactin.imgsrc:https://en-cdn.bio-protocol.org/attached/image/e4158/bioprotoc-11-18-4158-g006.jpgFigure 6. Co-purifying Aplysia proteins with YopH allowed the visualization of differences in phosphorylation pattern of cortactin by Src2 in vitro. Autoradiograph and corresponding Coomassie-stained gel of a representative in vitro kinase reaction showing the phosphorylation of WT or cortactin mutants by active Src2 or enzymatically dead dominant negative DNSrc2. Bands corresponding to phosphorylated Src2 (~65 kDa) and phosphorylated cortactin (95-110 kDa doublet) are indicated (Ren et al., 2019); see the Materials and Reagents section for detailed information about each construct. In contrast to living neurons, where phosphorylation of Y499 appears to have the most significant phenotypic effects, in vitro kinase data suggest that Y505 is preferentially phosphorylated.",
    "This figure is adapted from Figure 5C in our previous publication (Ren et al., 2019)."
  ],
  "subjectAreas": [
    "Biochemistry",
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research",
    "Molecular Biology & Genetics"
  ]
}