{
  "id": 18936,
  "origin_website": "Jove",
  "title": "Renal Capsule Xenografting and Subcutaneous Pellet Implantation for the Evaluation of Prostate Carcinogenesis and Benign Prostatic Hyperplasia",
  "procedures": [
    "1. Preparation of Compressed Hormone/Drug Pellet\nThis procedure should be done in a chemical safety hood while wearing a laboratory coat, gloves, mask, safety glasses, and bonnet. To prevent cross-contamination, it is critical that the pellet making equipment is thoroughly cleaned with 70% ethanol prior to and after manufacture of each type of pellet.\nUsing an analytical scale and weigh paper, measure desired amount of hormone/drug powder. Approximately 5% extra material is recommended to accommodate loss during pressing.\nSome hormones/drugs require a binding agent or filler, which is mixed prior to pellet manufacture. For example, to manufacture a 2.5 mg pellet of 17β-estradiol, combine the hormone with 22.5 mg of cholesterol, which results in a 25 mg pellet.\nCarefully transfer into die set, place under the press and push lever firmly down to compress pellet. Use consistent pressure to maintain constant surface area to volume ratio.\nNext reverse the die holder and push the lever down again to release the pellet.\nInspect pellet for integrity and determine if final mass is within desired range. An acceptable range is a ± 5% difference in the final mass (for example, an acceptable range for a 25 mg pellet is 23.8-26.3 mg).\nPellets can be made prior to surgery and stored (conditions and length of storage depends on stability of the hormone or drug used in pellet manufacture). Hormone pellets can be purchased as an alternative to pellet manufacture.  Purchasing pellets avoids the use of non-pharmaceutical grade drugs since they will be formulated and compounded.\n2. Preparation of Cell Recombinant Xenografts\nHarvest and culture primary mouse urogenital mesenchyme (UGM) stromal cells for less than 4 weeks before being collected for counting.",
    "Culture immortalized prostate epithelial cell lines in the usual fashion and collect for counting. For this example, prepare cell recombinant grafts by mixing 100,000 BPH-1 epithelial cells per graft with 250,000 UGM stromal cells per graft in suspension.\nPellet cells together and re-suspend in enough neutralized type 1 rat tail collagen to make desired number of grafts, each in a volume of 25 μl to 50 μl.\nSet recombinant grafts at 37 °C for 15 minutes and then cover with growth medium for storage at 37 °C for up to 48 hours before grafting.\n3. Preparation of Tissue Xenografts\nMaintain universal precautions for blood borne pathogens during tissue procurement and surgical procedure. Following institutional review board approval and informed consent, obtain fresh prostate tissue from surgical resection. For studies of BPH growth, tissues can be harvested from transurethral resection of the prostate or simple prostatectomy procedures. Primary xenografts of PrCa or benign prostate tissue can be obtained from radical prostatectomy specimens.\nStore harvested tissue in isotonic buffered cell media or normal saline on ice. Depending on the tissue and storage conditions, specimens may be stored for up 24 hours prior to preparation of tissue grafts. Common practice is to divide the specimen into three pieces, with one section fixed in formalin and routinely processed for histology, one piece snap frozen for molecular analysis and one piece further divided into tissue xenografts (1-3 mm in size).\n4. Preparation of Fire Polished Glass Pipette\nWearing eye protection, laboratory coat and heat resistant gloves, place glass Pasteur pipette tip into Bunsen burner flame at approximately a 60° angle to start.\nKeep a constant, slight movement to the pipette so as to avoid hot spots.\nDraw the tip thinly and fire-polish with the goal being a slightly curved end with a rounded, closed tip.",
    "5. Preparation of Instruments and Surgical Suite\nAutoclave all instruments. Prior to surgery, inspect all instruments, taking care to maintain sterile field.\nSet up sterile surgical area with absorbent pads, dissection scope, anesthesia nose cone, surgical instruments and heating lamp directed toward the working area. To sterilize tools in between mice, prewarm bead sterilizer.\nAssemble and test anesthesia apparatus; weigh gas scavenger.\nUsing the microwave, heat wax pads for up to 5 min (in 1 min increments, kneading the wax pad in order to combine melted and unmelted wax) at 70-80% power, until all the wax is evenly melted. By touch, ensure the pad is not too hot and place under the empty rodent recovery cage.\nDon personal protective equipment for rodent surgical procedures, including surgical mask, bonnet, gloves and gown.\n6. Surgical Procedure: Renal Capsule Xenografting\nAll procedures involving research animals should be performed with approval of institutional animal care and use committees. Prior to induction of anesthesia, observe the mouse to ensure health and well-being.\nPlace the mouse into chamber for induction of isoflurane anesthesia at 3-5%. When the animal has stopped moving and respiratory rate has decreased, transfer to nose cone in the prone position, and maintain anesthesia at 1-3%.\nIf necessary, use clippers to shave the back of the mouse. This is not needed when utilizing athymic nude (nu/nu) mice.\nApply firm pressure to the webbing of the extended hind foot to evaluate adequacy of anesthesia. If the mouse responds to pressure, more time is needed for the anesthesia to take effect. If necessary, adjust anesthesia flow slightly to achieve adequate anesthesia.\nWhen the mouse is adequately anesthetized, disinfect the surgical site with surgical iodine (Betadine) solution followed by 70% alcohol.",
    "Don sterile gloves and gown; apply sterile drapes to the surgical site. Lift the back skin with a pair of toothed forceps, and using the coarse scissors make a 2-3 cm dorsal midline incision.\nUsing blunt scissors or a probe, separate the underlying dermis from the body wall (on both sides of the incision for bilateral grafting or on one side for unilateral grafting).\nReposition the mouse into lateral position, and identify the location of the kidney by viewing the renal profile through the muscle wall. Applying gentle manual pressure with the thumb and index finger on the abdomen may assist with visualizing internal organs.\nUsing fine iris scissors, and taking care to avoid major vessels and spinal nerves, make a 1 cm incision in the body wall parallel to the spine. Widen this incision to 1.5-2.0 cm (slightly longer than the long axis of the kidney) by gently opening the scissors wider after placing them in the initial incision.\nExteriorize the kidney by applying gentle pressure outside the muscle wall on either side of the kidney using the index finger and thumb. Tuck the skin edges below the exteriorized kidney, which will rest on the body wall. While the kidney is exteriorized, maintain hydration of the renal capsule by applying sterile saline.\nUsing fine #5 forceps gently lift the kidney capsule from the parenchyma of the kidney and with a fine scalpel, make a 2 -4 mm incision in the capsule. The size of the incision is determined by the size of the graft, but should be minimized in order to maintain integrity of the capsule.",
    "Manipulate a glass Pasteur pipette that has been drawn thin and fire-polished with a rounded closed end under the capsule tangential to the surface of the kidney. Gently open a small capsule pocket for the grafts, using great care not to damage the kidney parenchyma.\nThe cut edge of the kidney capsule is lifted with the fine forceps, and the graft is inserted into the pocket under the capsule using the fire-polished glass pipette. Several grafts can be placed under the kidney capsule and evenly spaced on the kidney surface.\nIf, during the course of grafting, the capsule becomes dehydrated, it should be moistened by applying sterile saline.\nWhen grafting is complete, gently lift the sides of the muscle wall incision to replace the kidney back into the body cavity. Observe that the grafts do not slip out from under the capsule.\nClose the muscle wall with a single suture (4-0, FS-2 vicryl suture). The surgical procedure can be repeated on the contralateral kidney by repositioning the mouse.\nWhen grafting is complete, the mouse may undergo subcutaneous pellet implantation during the same surgical procedure (See Protocol step 7).\nUsing toothed forceps, align the skin incision edges and apply 2-3 surgical wound clips to close the incision. Administer analgesia (we use 5-10 mg/kg carprofen using a subcutaneous injection) and place the mouse in the lateral recumbent position in the recovery cage. Ensure maintenance of body temperature with heat from a lamp or heating pad. Observe for full recovery of the mouse, which should occur in less than 15 minutes.\nMice should be observed for the next 24 hr for signs of post-operative pain, bleeding and/or other complications. Regularly inspect surgical incision for signs of infection.\nRemove wound clips with surgical wound clip removal device 7-14 days after surgery.",
    "7. Surgical Procedure: Subcutaneous Pellet Implantation\nRepeat steps 6.1-6.5 from renal capsule xenografting surgical procedure.\nLift the back skin with a pair of skin forceps, and using the coarse scissors make a 1-2 cm dorsal midline incision.\nUsing blunt scissors or a probe, separate the underlying dermis from the body wall in a cranial direction.\nUsing skin forceps, gently lift the cranial aspect of the skin incision, and holding the hormone pellet gently with straight, serrated forceps, insert the pellet and release at the scruff of the neck, in the pocket you created with the blunt probe.\nRepeat steps 6.18-6.20 from renal capsule xenografting surgical procedure. If performing subcutaneous pellet implantation only, use 1 surgical wound clip to close the surgical incision.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}