{
  "id": 6088,
  "origin_website": "Bio",
  "title": "Detecting the Interaction of Double-stranded RNA Binding Protein, Viral Protein and Primary miRNA Transcript by Co-immunoprecipitation <em>in planta</em>",
  "procedures": [
    "Material preparationAgrobacterium tumefaciens-mediated transient co-expression of corresponding proteins and RNAs was performed with 4- to 6-week old N. benthamiana. N. benthamiana leaves (~8 g). Harvest the samples at 3 dpi (days post inoculation).Nuclei isolationCross-link N. benthamiana leaves with 1% formaldehyde in 1x PBS for 15 min. Note: Make sure the sample is submerged in the buffer, apply the vacuum for 5 min, release, Reapply vacuum, repeat this for 10 times.Add glycine to a final concentration of 0.125 M, mix well the buffer and apply vacuum for 5 min to stop cross-linking.Rinse the plants three times with sterile water. Remove excess water, freeze the plants in liquid nitrogen. If not proceed to the next step immediately, store the frozen plants at -80 °C.Grind the plant material into fine powder with liquid nitrogen in mortar. Transfer the power to a 50 ml centrifuge tube.For each sample (2 g), add 15 ml Honda buffer, rotate at 4 °C for 5 min.Filter through one layer of Miracloth, then wash the Miracloth by adding another 10 ml of Honda buffer (in a 50 ml centrifuge tube).Centrifuge at 3,500 x g for 5 min at 4 °C. Discard the supernatant, softly resuspend the pellet in 1 ml Honda buffer with 1 ml pipet with end-cut tip.Centrifuge at 3,500 x g for 5 min, wash the pellet once more with 1 ml Honda buffer. Centrifuge at 10,000 x g for 1 min and remove the supernatant thoroughly.ImmunoprecipitationAdd 2.5 volumes/weight high salt nuclear lysis buffer in nuclear pellets, resuspend nuclei and sonicate (30 sec long pulses, 30 sec intervals, 10 cycles) by using a Diagenode Bioruptor.",
    "Centrifuge (16,000 x g, 4 °C) for 10 min, take supernatant (400 μl) into a 2 ml centrifuge tube, add four volumes of dilution buffer, mix well, take out 1/20, and keep it as input.Add anti-Myc (10 μg/2 ml) antibody, rotate at 4 °C for 2 h, then add 50 μl of Protein G and rotate for another 2 h.Centrifuge at 1,500 x g for 5 min at 4 °C. Remove supernatant carefully and add IP buffer. Wash beads with IP buffer for 3 times.Take out 1/10 of IP extract for Western blot detection.Centrifuge at 1,500 x g for 5 min at 4 °C, remove the supernatant thoroughly.RNA extraction and RT-PCRAdd 1 ml Trizol, 65 °C for 10 min.Add 200 μl chloroform, vortex, incubate the tubes on ice for 5 min.Centrifuge at 16,000 x g for 5 min.Take 400 μl aqueous phase.Add 1 μl GlycoBlue and 40 μl sodium acetate, then add 1 ml anhydrous ethanol, incubate at -80 °C, 2 h.Centrifuge at 16,000 x g for 5 min, discard the supernatant.Suspend the RNA pellet in 89 μl of nuclease-free water.Add 10 μl 10x DNase I buffer and 1 μl DNase I, 37 °C for 10 min.Add 300 μl nuclease-free water then 400 μl chloroform, vortex.Centrifuge at 16,000 x g for 5 min.Take 400 μl aqueous phase.Add 1 μl GlycoBlue and 40 μl sodium acetate, then add 1 ml anhydrous ethanol, -80 °C, 2 h.Centrifuge at 16,000 x g for 5 min, discard the supernatant.Suspend the RNA pellet in 20 μl of nuclease-free water.Reverse transcript by SuperScriptIII (follow the manufacturer's instructions) with gene-specific primer, and detect RNAs by RT-PCR (melting temp.: 95 °C, annealing temp.: 60 °C, cycle numbers: 30 cycles)."
  ],
  "subjectAreas": [
    "Microbiology",
    "Plant Science",
    "Molecular Biology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}