{
  "id": 9921,
  "origin_website": "Jove",
  "title": "Combining Wet and Dry Lab Techniques to Guide the Crystallization of Large Coiled-coil Containing Proteins",
  "procedures": [
    "NOTE: A diagram of the conceptual framework or workflow is described in Figure 1 for reference. The protocol can be broken down into four stages: computational or sequence based predictions, protein expression and purification, biochemical characterization, and crystallization. The examples shown analyze Shroom SD2 domains and/or Shroom-Rock complexes, but can be utilized with any protein.\n1. Use Established Web-based Tools to Generate Computational Predictions of Coiled-coil Domain Boundaries\nCollect an Evolutionarily Diverse Set of Sequence Homologs.\n\t\nGo to www.uniprot.org and type in Shroom in the upper search bar.\nSelect sequences to download by checking the box next to their accession number. Sequences with a star indicate sequences reviewed by Uniprot and are generally more reliable. Take care to ensure that all sequences are complete and accurate.\nSave the selected sequences by clicking the Download button.\nAlign the collection of Shroom sequences using Clustal-Omega21 (http://www.ebi.ac.uk/Tools/msa/clustalo/). Click the “Browse” button to select the file with the Shroom sequences and then push Submit.\nAfter the alignment is complete, click the \"Download Alignment File\" button.\nOpen the multiple sequence alignment generated in 1.1.5 using Jalview (File|Input Alignment|From file). Within the new alignment window, color by identity (Color|Percent Identity).\nCalculate predictions of secondary structure, predictions of flexible or disordered sequence, and predicted coiled-coil regions within the protein(s) of interest.\n\t\nGo to http://gpcr.biocomp.unibo.it/cgi/predictors/cc/pred_cchmm.cgi, to calculate Coiled-Coil predictions. Copy and Paste the sequence into the Sequence Box and click Submit.",
    "NOTE: This analysis may take a couple of hours to complete. Since Shroom sequences are quite large, the sequences may need to be split into blocks of less than 1,000 amino acids to fit within the size constraint of the webserver. When analyzing Shrm2, it is recommended that the C-terminal 1,000 amino acids are used as this section contains the Shrm SD2 domain which is known to contain coiled-coil regions. When repeating this analysis with other proteins, it is recommended to use the full-length protein sequences when possible. If that is not an option, use the largest fragment possible or dissect the sequence based on known biochemical or functional data.\nGo to http://gpcr.biocomp.unibo.it/cgi/predictors/cc/pred_cchmm.cgi, to calculate Coiled-Coil predictions. Copy and Paste the sequence into the Sequence Box and click Submit.\nCombine the results of steps 1.1 to 1.2.2 into a single comprehensive annotation of the Shroom sequence.\n\tNOTE: It is highly encouraged to also include any and all relevant information that can be gleaned from the literature or other sources about protein function or purification at this stage.\nUsing this comprehensive annotated sequence, predict domain boundaries (or a series of possible boundaries) for the protein, trying to maximize conservation and predicted structural features while minimizing the amount of disordered or flexible sequence. If known, the resulting protein should retain the functional properties of interest.\n2. Express and Purify Proteins with the Domain Boundaries Identified in Section 1\nNOTE: The goal of this section is to use a series of quick and easily quantifiable assays to screen hypothetical domain boundaries generated in Section 1.\nUsing standard molecular biology techniques, generate an expression plasmid with the desired coding sequence in frame within the His10-mRuby2-XH2 plasmid (See Figure 3 for the vector map and additional details).",
    "Test expression levels for each expression plasmid using BL21(DE3) E. coli or other suitable expression strain in autoinduction media1 at room temperature for 18-24 hr.\n\t\nTransform expression plasmids as well as an empty plasmid control into BL21(DE3) following the instructions that came with the cells or using robust transformation protocol, such as the one here (https://www.addgene.org/plasmid-protocols/bacterial-transformation/).\nFrom the freshly transformed plate, pick a single colony and grow a 5 ml starter culture at 37 °C overnight in Lysogeny Broth (LB) media with 34 µg/ml kanamycin.\nThe following day, pellet the culture and wash the pellet with fresh LB.\nAdd the starter culture to 50 ml of autoinduction media with 34 µg/ml kanamycin. Allow the culture to grow to saturation at either room temperature or 37 °C. Typically, grow for ~18-24 hr.\nPellet cells and freeze the resulting cell pellets at -80 °C indefinitely prior to purification.\nCompare whole cell extracts from each expression strain and the empty vector control by SDS-PAGE to determine the strain that most efficiently produces the desired fusion protein. For His10-mRuby2-Shroom SD2 fusion proteins, run 10% SDS-PAGE gels at 180 V for ~50 min or until the dye front reaches the bottom of the gel22.\nStain gel with Coomassie Blue to visualize total cellular proteins within each strain23.\nPerform an initial affinity chromatography step on each strain that successfully expressed mRuby2-fusion protein. Typically, perform purification steps 2.3.2-2.3.7 at room temperature, unless the protein will benefit from altered conditions such as purification at 4 °C.\n\t\nThaw cell pellets from step 2.2.5.\nResuspend each cell pellet in 1.5 ml of lysis buffer (10% glycerol, 500 mM NaCl, 40 mM imidazole, 20 mM Tris pH8.0, 1 mM beta-mercaptoethanol). Supplement the lysis buffer with protease inhibitors as appropriate.",
    "Add 30 µl of 10 mg/ml lysozyme and incubate at room temperature for 20 min. Sonicate following the instructions for the instrument being used.\nTransfer into a 1.5 ml tube and centrifuge in a table top centrifuge for 30 min at 14,000 x g to pellet insoluble material or unlysed cells. Save both supernatant and pellet for subsequent analysis via SDS-PAGE.\nPerform nickel affinity purification, incubating the soluble fraction with 100 µl of Ni-NTA beads. Incubate the beads with soluble lysate for 5-10 min, inverting several times to mix beads.\nCentrifuge at 800 x g for 30 sec in a tabletop centrifuge to pellet the beads. Follow this by washing the pellet 3-5 times with lysis buffer to clean off non-specific contaminants.\nElute Ruby fusion protein from the beads with lysis buffer supplemented with 1 M imidazole.\nUse SDS-PAGE to compare the behavior of His-mRuby2-Shroom proteins in the \"quick and dirty\" purification above.\n3. Characterize Protein Sample to Identify Those with Advantageous Properties\nUse a spectrophotometer set at 280 nm to measure the concentration of the Ruby fusion protein, and then assess the homogeneity of the sample by loading 1-5 µg of fusion protein onto a native PAGE gel24. Run the 10% Native PAGE gel at 4 °C for 140 min at 175 V.\n\t\nImage the native PAGE using an imager equipped to visualize fluorescence, observing where the mRuby-tagged fusion migrates in this assay.\n\t\tNOTE: Be careful to observe fusion protein that is stuck in the well as this protein is likely aggregated. If a fluorescence imager is not available, one can often visualize and image concentrated samples of Ruby tagged protein under a black light or with a UV light box.",
    "Perform limited proteolysis to identify stably folded domains. Incubate 95 µl of Ruby-Shrm SD2 fusion at ~1 mg/ml with 5 µl of 0.025% Subtilisin A.\n\t\nSample the reaction at time points of 0, 0.5, 2, 5, 15, 60, and 120 min, removing 10 µl from the reaction for each time point and visualizing the progress of the reaction via SDS-PAGE using a 15% acrylamide gel.\nStain with Coomassie Blue as in step 2.2.7 and evaluate whether a protease resistant species can be identified.\nIntegrate data from the purification efficiency, behavior in native PAGE, and limited proteolysis on the partially purified mRuby2-Shroom fusion proteins into a comprehensive assessment of the overall behavior of these proteins in solution.\n\t\n(Optional) If a suitable functional assay is available, check for activity at this point.\n4. Producing High Quality Crystals of the Coiled-coil SD2 Domain from Shroom\nNOTE: All steps within section 4.1 are performed at room temperature unless the protein would benefit from purification at a different temperature, usually 4 °C.\nUsing the 50 ml growths as a rough estimate of expression and purification potential, perform large scale expressions of mRuby2-Shroom SD2 with the goal of achieving 5-20 mg of completely purified sample. Typically 2 L of culture provides adequate starting material. After growth pellet cells by centrifugation at 8,000 x g for 10 min.\n\t\nResuspend the pellet from the 2 L growth in lysis buffer as before, using ~2 ml of lysis per gram of frozen cell pellet if using lysozyme for lysis. Alternatively, resuspend at ~8 ml/g of pellet if using a homogenizer or French press. Pellet cellular debris via centrifugation at 30,000 x g for 30 min.",
    "Batch bind the soluble fraction from 4.1.1 using 10 ml of Ni-NTA resin. Pour into appropriate gravity column and allow unbound proteins to drain off.\nWash resin 3-5 times with 40 ml of lysis buffer, followed by a wash with lysis buffer supplemented to 1 M NaCl.\nWash resin with 40 ml of lysis buffer supplemented with 80 mM imidazole.\nElute the Ruby-Shroom fusion protein with 40 ml of lysis buffer supplemented to 1 M imidazole. Manually fractionate the eluted protein into 4-10 ml fractions.\nConfirm fractions containing Ruby-Shroom fusion protein using 10% SDS-PAGE.\nDialyze appropriate fractions (typically fractions 2-4) into 8% glycerol, 250 mM NaCl, 15 mM imidazole, 20 mM Tris pH8.0, 1 mM β-ME, using 6-8 kDa MWCO dialysis tubing. Add 1 mg of TEV protease for every 25-50 mg of fusion protein. Dialyze overnight at room temperature with slow stirring.\nRepeat nickel affinity purification steps 4.1.2. to 4.1.6. The Shroom SD2 domain should now remain in the unbound fraction while the His10-mRuby2 will remain bound to the resin and will be found in the elution fractions. Confirm this using 12% SDS-PAGE staining with Coomassie Blue.\nDialyze fractions containing Shroom SD2 domain into 8% glycerol, 100 mM NaCl, 20 mM Tris pH 8.0, 5 mM beta-mercaptoethanol buffer overnight.\nPerform anion exchange chromatography25 using an FPLC, and eluting with a NaCl gradient from 0.1-1.0 M NaCl. Analyze fractions using 12% SDS-PAGE.\nUsing a spin concentrator (MWCO of 10 kDa or greater depending on the protein being studied), concentrate peak fractions to ~ 0 mg/ml, and then perform size exclusion chromatography26, analyzing peak fractions via 12% SDS-PAGE.\nPool peak fractions and dialyze into 20 mM Tris pH 8.0, 50 mM NaCl, 2% glycerol, 1 mM β-ME, and concentrate to 10 mg/ml prior to crystallization.",
    "Optional: During this step, remove 5 µl samples at concentrations of 1, 2, 5, and 10 mg/ml during the course of concentrating the sample. Run a native PAGE loading 2-5 µl of each sample to look at the behavior of the sample during this step.\nScreen a small array of 12 conditions to identify an optimal protein concentration for crystallization trials. The composition of these conditions is described in Figure 7.\n\t\nUsing 24-well sitting drop crystallization trays, perform crystallization trials using the vapor diffusion method, pipetting 500 µl of each of the 12 conditions into separate wells followed by drops that initially contain 1 µl of well solution and 1 µl of protein sample on the coverslips. Please see27 for additional information on this technique.\nQuickly seal the tray with clear tape and move the tray to a suitable temperature controlled environment that is vibration free. The temperature used can vary, but 4 °C, 16 °C, and 20 °C are quite common.\nExamine the drops in the trays over the next 3 days using a microscope at up to 100X magnification. At the end of the 3-day period, score each drop as containing no precipitation (clear), light precipitation, heavy precipitation (brown), or crystals. A suitable protein concentration should contain no more than 6 heavy precipitations.\nUsing the protein concentration identified in 4.2, screen a broad range of commercially available crystallization screens. The use of a liquid handling or crystallization robot greatly speeds up this process while also minimizing error in the drops. It requires far less protein as well, allowing the user to screen more conditions with a single sample.\nImprove initial conditions identified from broad screens by systematically varying each of the variables within the crystallization drop using 24-well screening trays as before.",
    "Subscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}