{
  "id": 17566,
  "origin_website": "Jove",
  "title": "Utilization of Grafix for the Detection of Transient Interactors of Saccharomyces cerevisiae Spliceosome Subcomplexes",
  "procedures": [
    "1. Yeast total extract preparation\nGrow the yeast cells expressing one of the splicing factors fused to the TAP tag9 in 1 L YNB-glu media (Yeast Nitrogen Basis supplemented with 2% m/v glucose) with the appropriate amino acids or nucleic bases, in this case, adenine (20 µg/mL), leucine (30 µg/mL), tryptophan (30 µg/mL), up to OD600 = 1.0.\nCollect the cells from the 1 L culture by centrifuging in three 500 mL centrifuge bottles at 17,000 x g for 10 min at 4 °C and wash twice with 10 mL cold sterile water.\nResuspend the collected yeast cells in 1/10 of the cell volume of cold buffer A (10 mmol L-1 HEPES pH = 7.9, 1.5 mmol L-1 MgCl2, 50 mmol L-1 KCl, 5% v/v glycerol, 0.5 mmol L-1 DTT, EDTA-free Protease Inhibitor Cocktail).\nFreeze small drops of cell suspension in liquid nitrogen. The small drops can be obtained by pipetting the resuspended cell solution and dropping 50 µL directly into liquid nitrogen.\n\tCAUTION: Liquid nitrogen can cause injuries in contact with skin or eyes. Handle using appropriated safety equipment.\n\tNOTE: The protocol can be paused here. The frozen drops of cell suspension can be stored at -80 °C.\nPrepare yeast cells lysates by grinding in a Ball Mill device through six cycles at 20 Hz/s for 3 min.\n\tNOTE: After each cycle, immerse the container harboring the frozen cells in liquid nitrogen to avoid melting. The protocol can be paused here. The frozen extracts can be stored at -80 °C. Yeast splicing extracts can also be prepared using homogenizers to lysate spheroplasts10, or using mortar and pestle11,12.\nMelt the extract by placing the tubes containing them in water at room temperature, shaking occasionally.\nCentrifuge extracts at 45,000 x g for 1 h at 4 °C.",
    "Quantify the protein content of the cleared supernatant by the BCA method13.\nPrepare aliquots of the extracts, fast freeze them in liquid nitrogen and store at -80 °C.\n\tNOTE: The protocol can be paused here.\n2. Glycerol gradient preparation\nPrepare two glycerol solutions in Buffer A, one containing 10% v/v and the other containing 30% v/v glycerol.\nAdd the crosslinking agent glutaraldehyde to 0.1% v/v in the 30% v/v glycerol solution and mix to homogenize.\n\tCAUTION: Handle glutaraldehyde inside the fume hood using appropriate safety equipment.\nAdd 6 mL of the cold 10% v/v glycerol solution at the bottom of the 12 mL centrifuge tube (14 x 89 mm).\nAdd 6 mL of the cold 30% v/v glycerol solution supplemented with glutaraldehyde with a syringe attached to a long needle provided with the Gradient Master device at the bottom of the tube, just beneath the 10% v/v glycerol solution.\n\tNOTE: Alternatively, the 10% v/v glycerol solution can be carefully pipetted on the top of the 30% v/v glycerol/glutaraldehyde solution.\nUse the Gradient Master device to generate a continuous density gradient.\n\tNOTE: In the Gradient Master device, the tubes are placed into an appropriate rack and rotated briefly, following the manufacturer’s recommendations for determining the parameters (time/angle/speed). In this work we used: 2:25 min/81.5°/11 rpm.\nCarefully add 200 μL of a 7% v/v glycerol/buffer A cushion on the top just before the addition of the cell extracts.\n\tNOTE: The glycerol concentration of the cushion must be lower than the less concentrated glycerol solution used to create the linear gradient.\n3. Extracts centrifugation\nLoad approximately 2 mg of total protein on the top of each 12 mL linear glycerol gradient 10%–30% glutaraldehyde with cushion.\nPlace the tubes in a pre-cooled swing-bucket rotor.\n\tNOTE: Handle the tubes gently to avoid mixing before ultracentrifugation.",
    "Centrifuge at 194,000 x g for 16 h at 4 °C.\nAliquot each 12 mL tube in twenty-four 500 μL fractions using an adapted EconoSystem or by carefully pipetting.\n\tNOTE: An adapted EconoSystem consists of a peristaltic pump, the UV detector, and the fraction collector connected to the tube-perforating device. The sedimentation profile can be monitored by the measurement of the absorbance at 280 nm.\nUse a 40% v/v glycerol solution through the peristaltic pump to push the glycerol 10%–30% gradient from the tube to the fraction collector.\n\tNOTE: The protocol can be paused here. Store the fractions at -80 °C until use.\nLoad 50 μL of each fraction directly on nitrocellulose membranes on a dot blot or slot blot device. Detect protein by immunoblot using antibody against CBP (1:6,000, to detect the CBP portion of the TAP tag) and anti-rabbit IgG conjugated with Horseradish Peroxidase (1:15,000) as the secondary antibody.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Biochemistry"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}