{
  "id": 15113,
  "origin_website": "Jove",
  "title": "Pooled CRISPR-Based Genetic Screens in Mammalian Cells",
  "procedures": [
    "The experiments outlined below should follow the institute’s Environmental Health and Safety Office guidelines.\n1. Pooled CRISPR sgRNA lentiviral library plasmid amplification\nDilute the ready-made CRISPR sgRNA plasmid DNA library to 50 ng/μL in TE (e.g., TKOv3).\nElectroporate the library using electrocompetent cells. Set up a total of four electroporation reactions as described below.\n\t\nAdd 2 μL of 50 ng/μL TKO library to 25 μL of thawed electrocompetent cells to pre-chilled cuvettes (1.0 mm) on ice.\nElectroporate using optimal settings suggested by the manufacturer’s protocol. Within 10 s of the pulse, add 975 μL of Recovery Medium (or SOC medium) to the cuvette.\nTransfer electroporated cells to a culture tube and add 1 mL of Recovery Medium. Incubate tubes in a shaking incubator at 250 rpm for 1 h at 37 °C.\nSet up a dilution plate to titer the library and estimate transformation efficiency.\n\t\nPool all 8 mL of recovered cells and mix well. Transfer 10 μL of the pooled cells to 990 μL of Recovery Medium for an 800-fold dilution and mix well.\nPlate 20 μL of the dilution onto a pre-warmed 10 cm LB + carbenicillin (100 µg/L) agar plate. This results in a 40,000-fold dilution of the transformants that will be used to calculate the transformation efficiency.\nPlate 400 μL of recovered cells on each plate across a total of 20 pre-warmed 15 cm LB + carbenicillin agar plates. Incubate the plates for 14–16 h at 30 °C.\n\t\tNOTE: Growth at this lower temperature minimizes the recombination between long-terminal repeats (LTR)18.",
    "To calculate the transformation efficiency, count the number of colonies on the 40,000-fold dilution plate (step 1.3.2). Multiply the number of colonies counted by 40,000 to obtain the total number of colonies on all plates. Proceed if the total number of colonies represents a library coverage equivalent to minimum of 200x colonies per sgRNA (most optimal is 500-1000x).\n\t\t\nFor example, the minimal colony number for TKOv3 library (71,090 sgRNA) is 1.4 x 107, which is equivalent to 200x colonies per sgRNA. If colony representation is insufficient, increase the number of electroporations in step 1.2 based on the number of colonies on the dilution plate to achieve the minimum library coverage.\nHarvest the colonies as described below\n\t\nTo each 15 cm plate, add 7 mL of LB + carbenicillin (100 µg/L) medium, then scrape the colonies off with a cell spreader. With a 10 mL pipette, transfer the scraped cells into a sterile 1 L conical flask or bottle.\nOnce again rinse the plate with 5 mL of LB + carbenicillin medium and transfer the solution to the bottle.\nRepeat for all plates to pool cells from 20 plates into a sterile bottle.\nMix collected cells with a stir bar for 1 h at room temperature (RT) to break up cell clumps. Transfer cells to pre-weighed centrifuge bottles and centrifuge at 7,000 x g to pellet bacteria, then discard media.\nWeigh the wet cell pellet and subtract the weight of the centrifuge bottle to determine the final weight of the wet pellet. Purify plasmid DNA using a maxi- or mega-scale plasmid purification kit depending on the amount of bacterial pellet each column can process.\n2. Large-scale CRISPR sgRNA library lentivirus production",
    "NOTE: All steps in this section of the protocol are performed in a BSL2+ facility in a Class II, Type A2 biosafety cabinet.\nCalculate the number of 15 cm plates required for virus production based on the estimate that 18 mL of virus is typically harvested from one 15 cm plate.\nPrepare cells for transfection by seeding HEK-293T packaging cells in low-antibiotic growth media (DMEM + 10% FBS + optional: 0.1x pen/strep) at 8 x 106 cells per 15 cm plate in 20 mL of media. Incubate cells overnight at 37 °C, 5% CO2. Ensure that the plated cells are 70%–80% confluent and evenly spread at moment of transfection.\nNext day, prepare three transfection plasmids mixture as outlined in Table 1 for 15 cm plates. Calculate the amount of plasmid needed for one transfection and make a mix of plasmids for the number of plates, plus one to be transfected.\nPrepare a lipid-based transfection reagent for each transfection as outlined in Table 2. Aliquot reduced serum media into individual 1.5 mL microcentrifuge tubes for the number of plates to be transfected. Add transfection reagent, mix gently, and incubate for 5 min at RT.\nFollowing 5 min incubation, add the amount of DNA required for one transfection to the transfection reagent for a 3:1 ratio of transfection reagent-to-µg of DNA complex. Mix gently and incubate for 30 min at RT.\n\tNOTE: Subsequent transfections can be prepared in sets of five or less, with 5 min intervals to optimize for time and avoid over-incubation.\nAfter 30 min of incubation, carefully transfer each transfection mix to each plate of packaging cells. Add the entire mix using a 1 mL pipette tip dropwise in a circular, zigzag motion without disturbing the cell monolayer. Incubate cells at 37 °C for 18 h at 5% CO2.",
    "Prepare viral harvest media: 500 mL of DMEM medium + 32 mL of BSA stock (20 g/100 mL, dissolved in DMEM, filter sterilized with 0.22 µm filter) + 5 mL of 100x pen/strep.\nAfter 18 h, remove media (use proper handling of lentivirus waste such as incubation in 1% sodium hypochlorite for 30 min before disposal). Gently replace with 18 mL of viral harvest media to each plate. Incubate cells at 37 °C for 18 h at 5% CO2.\nAfter 24 h, check packaging cells for abnormal and fused morphology as an indication of good virus production. Then, harvest the lentivirus by collecting all supernatant and transferring into a sterile conical centrifuge tube.\nSpin the media containing virus at 300 x g for 5 min and pellet the packaging cells. Aliquot the supernatant into a sterile polypropylene tube without disturbing the pellet.\nStore the virus at 4 °C for short periods (less than 1 week) or immediately at -80 °C for long-term storage. Aliquot large-scale virus preps to single use volumes for long-term storage to avoid freeze/thawing.\n3. Cell line characterization for screening\nSelect the desired cell line.\n\t\nMeasure and record the approximate doubling time of the cells.\nDetermine optimal cell plating density for culturing cells every 3–4 cell doublings in a tissue culture vessel of choice (e.g., 15 cm tissue culture plates).\nDetermine the puromycin concentration to use in the desired cell line for selection of TKO libraries containing puromycin resistance marker as follows:\n\t\nSeed cells in a 12 well plate at the density required to reach confluence after 72 h, then incubate overnight (37 °C, 5% CO2).\nThe next day, change to a media containing a dilution range of puromycin concentrations from 0 μg/mL to 10 μg/mL, in 0.5 μg/mL increments. Incubate the cells for 48 h.",
    "After 48 h, measure the cell viability by cell counting or alamarBlue staining.\nDetermine the lowest concentration that kills 100% of cells in 48 h. Use this concentration to select for CRISPR library transduced cell populations in steps 4.6 and 5.2.6.\n\t\tNOTE: For cell lines with longer doubling times, longer incubations with puromycin can be tolerated. In these situations, determine the kill curve for the incubation time required for <3 cell doublings. Minimize the time for selection to avoid dropout of essential genes before the start of screening.\nCheck cells for sensitivity to hexadimethrine bromide (up to 8 μg/mL) by performing a dose response curve in the same method as used for measuring puromycin sensitivity (step 3.2). If toxicity is observed with <8 μg/mL of hexadimethrine bromide, do not use.\n4. Functional titration of pooled CRISPR lentivirus library for determination of MOI\nThaw a fresh aliquot of pooled CRISPR sgRNA library lentivirus (e.g., LCV2::TKOv3) and keep on ice.\nDesign a series of virus volumes to test between the range of 0–2 mL (i.e., 0 mL, 0.25 mL, 0.5 mL, 1 mL, and 2 mL).\nHarvest target cells and seed cells in 15 cm plates at the density required to reach confluence in 72 h.\nFor each virus volume to be tested, prepare duplicate plates. Add cells, virus, hexadimethrine bromide (8 µg/mL), and media to a final volume of 20 mL. Mix plates thoroughly, sit plates level in incubator and incubate for 24 h (37 °C, 5% CO2).\nAfter 24 h, remove virus containing media and dispose (use biosafety precautions for handling of lentivirus waste). Optionally, gently wash the plate with warm PBS to remove extraneous virus.",
    "For each virus condition, replace with 20 mL of media containing puromycin using the concentration determined to kill cells in section 3, to one replicate plate. To the other plate, add 20 mL of fresh media without puromycin. Incubate for 48 h (37 °C, 5% CO2).\nAfter 48 h, check that all uninfected cells (0 mL virus condition) treated with puromycin are dead. Harvest all plates individually and disperse cells by repeated gentle pipetting.\nCount cells from all the plates and calculate the MOI for each virus volume by comparing cell counts with puromycin selection to cell counts without puromycin (i.e., +/- puromycin).\nGraph results to determine the virus volume that leads to 30%–40% cell survival with puromycin selection versus without puromycin. Use this virus volume to achieve a MOI of 0.3–0.4 during the screen under the same tissue culture conditions.\n5. Primary screen infection, selection, and cell passaging\nSelect the CRISPR sgRNA library coverage to be maintained throughout the screen (recommended minimum of 200-fold).\n\t\nBased on the library coverage, determine the number of cells required to maintain this coverage per sgRNA and the number of cells required for infection at MOI 0.3 (Table 3).\nDetermine the number of plates required to set up the infection (Table 4).\nInfecting the cells with CRISPR library\n\t\nHarvest cells and seed the required cell number to each 15 cm plate.\nAdd hexadimethrine bromide (8 µg/mL) to all plates.\nAdd the virus at the volume required for MOI 0.3 to screening and the Control 2 plates. For the Control 1, do not add virus, and replace that volume with media.\nMix plates thoroughly by tilting. Place plates in incubator, making sure they are level.",
    "NOTE: Batch infections can be done by combining a master mix of virus, media, and hexadimethrine bromide to cells in suspension before plating.\nRemove media and replace with fresh media containing puromycin at the concentration determined in step 3.2.4 to the screening and control 1 plates 24 h after virus infection. Add fresh media with no puromycin to the control 2 plate. Incubate cells for 48 h (37 °C, 5% CO2).\n48 h after puromycin addition, ensure that all uninfected cells are dead (control 1) to confirm puromycin activity, then harvest the infected cells.\nHarvesting infected cell population and cell passaging\n\t\nHarvest the puromycin-selected cells from all screening plates into one sterile container. Collect the cells from each control plate separately. Disperse cells by gentle repeated pipetting.\nCount cells from pooled screening cells, control 1, and control 2 separately and calculate the number of cells per 1 mL.\nCalculate MOI and fold coverage achieved as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59780/59780eq1.jpg\nimgsrc://cloudfront.jove.com/files/ftp_upload/59780/59780eq2.jpg\nCollect three replicates of cell pellets from the pooled cells at the selected library coverage for genomic DNA extraction. Centrifuge the cells at 500 x g for 5 min. Wash with PBS. Label the tubes and freeze-dry the cell pellets at -80 °C (these are T0 reference samples).\nSplit the pool of infected cells into three replicate groups (e.g., replicate A, replicate B, replicate C), while maintaining library coverage within each replicate. Seed cells at the same seeding density as would normally be used when expanding them. Use the same number of cells for each replicate plate and same total number of cells between replicates.",
    "Continue to passage cells and harvest three replicates of cell pellets from each replicate of pooled-infected cells as above, every 3–8 days depending on the cell line, for up to 15–20 cell doublings. At each passage, harvest the cells from all plates in each replicate group with each other (i.e., all cells from replicate A plates are re-mixed together, all cells from replicate B plates are re-mixed together, etc.).\nLabel each pellet with a time (T) and replicate designation. This corresponds to the number of days post-T0 the pellet is collected (e.g., T3_A, T3_B, T3_C, etc).\nFor the negative selection drug screens, allow cells to recover for at least one passage after T0 before treatment. At T3 or T6, split the cells from each replicate group (A, B, C) into drug treatment and control populations, using the same seeding density used in step 5.3.5.\n\t\nSeparately pool the number of cells required for library coverage for each replicate in the drug treatment group. Add the drug at intermediate concentrations (IC20-IC50). Seed the cells and incubate (37 °C, 5% CO2) until next passage.\nSeparately pool the number of cells required for library coverage for each replicate in the vehicle control group. Add the vehicle control using the same volume as the drug (<0.5% v/v). Seed the cells and incubate (37 °C, 5% CO2) until the next passage.\nContinue to passage the cells and harvest the cell pellets for genomic DNA every 3 days as described in step 5.3.5, while refreshing the drug or vehicle at each passage.",
    "For the positive selection or drug resistance screens, split each replicate group according to the number of cells required for library coverage. Add IC90 drug concentrations to each replicate. At IC90, a majority of cells will be killed. Allow resistant populations to grow and collect cell pellets (1–2 x 107 cells) for genomic DNA extraction.\n6. CRISPR sample preparation and sequencing\nGenomic DNA purification\n\t\nIncubate the frozen cell pellets for 5–10 min at RT for thawing.\nAdd 1.4 mL of PBS to a 50 mL centrifuge tube containing a cell pellet. Vortex for 20 s to resuspend the cells and rest for 1 min. If required, pipette 15x with P1000 to break up the remaining cell clumps. If transferring cells from a 15 mL or 1.5 mL tube, resuspend the cells with 1 mL of PBS, then transfer cells to a 50 mL tube and rinse the original tube with 400 µL of PBS.\nAdd 5 mL of Nuclei Lysis Solution to the resuspended cells. Using a 10 mL pipette, mix the sample by pipetting up and down 5x.\nAdd 32 µL of RNase A (20 mg/mL; to obtain a final concentration of 100 µg/mL) to the nuclear lysate and mix the sample by inverting the tube 5x. Incubate the mixture at 37°C for 15 min and allow sample to cool for 10 min at RT.\nAdd 1.67 mL of Protein Precipitation Solution to the lysate and vortex vigorously for 20 s. Small protein clumps may be visible after mixing.\nCentrifuge at 4,500 x g for 10 min at RT.\nUsing a 10 mL pipette, transfer the supernatant to a 50 mL centrifuge tube containing 5 mL of isopropanol. Gently mix the solution 10x by inversion until the DNA is observed.",
    "NOTE: DNA can be observed as white, thread-like strands that form a visible mass.\nCentrifuge at 4,500 x g for 5 min at RT to pellet the DNA.\nUsing a 10 mL pipette, carefully remove the supernatant and avoid dislodging the DNA pellet. Add 5 mL of 70% ethanol at RT to the DNA. Gently rotate the tube to wash the DNA pellet and sides of the centrifuge tube.\nCentrifuge at 4,500 x g for 5 min at RT.\nUsing a 10 mL pipette, carefully remove the 70% ethanol and avoid dislodging the DNA pellet. Air-dry genomic DNA for 10 min at RT.\nAdd 400 µL of TE solution to the tube and let the DNA dissolve by incubating at 65 °C for 1 h. Mix the DNA by gently flicking the tube every 15 min. If the DNA does not dissolve completely, incubate tube at 65 °C for an additional 1 h while gently flicking the tube every 15 min, and leave it at 4 °C overnight.\nCentrifuge at 4,500 x g for 1 min at RT and transfer genomic DNA to a 1.5 mL low-binding tube.\nQuantify and measure the purity of genomic DNA on both the spectrophotometer (for total nucleic acid content) and fluorometer (for double-stranded DNA content).\nOptionally, precipitate genomic DNA if there are issues with downstream PCR amplification of the sgRNA as follows.\n\t\nTransfer 400 µL genomic DNA into a 1.5 mL microcentrifuge tube.\nAdd 18 µL of 5 M NaCl (final concentration of 0.2 M) and 900 µL of 95% ethanol.\nInvert tube 10x until thoroughly mixed, then centrifuge at 16,000 x g for 10 min at RT.",
    "Carefully remove the supernatant and avoid dislodging the DNA pellet. Wash the DNA pellet with 500 µL of 70% ethanol. Gently rotate the tube to wash the DNA pellet.\nCentrifuge at 16,000 x g for 5 min at RT.\nCarefully remove supernatant and avoid dislodging DNA pellet. Air-dry genomic DNA for 10 min at RT.\nAdd 300 µL of TE to dissolve DNA as described in steps 6.1.12.\nQuantify and measure the purity of genomic DNA as described in step 6.1.14.\nCRISPR sequencing library preparation\n\t\nSet up PCR 1 as outlined in Table 5 using a total of 100 μg of genomic DNA. Add 3.5 μg of genomic DNA per 50 μL reaction and set up identical 50 μL reactions to achieve the desired coverage. Table 6 lists examples of primer sequences for amplification of LCV2::TKOv3 sequencing libraries. Table 7 lists examples of primer sequences for amplification of pLCKO2::TKOv3 sequencing libraries.\nAmplify PCR 1 reactions in a thermocycler using the program outlined in Table 8.\nCheck PCR 1 amplification by running 2 μL of the PCR product on a 1% agarose gel. PCR 1 yields a product of 600 bp.\nPool all individual 50 μL reactions for each genomic DNA sample and mix by vortexing.\nSet up one PCR 2 reaction (50 μL) for each sample as outlined in Table 9 using 5 μL of the pooled PCR 1 product as template. Use unique index primer combinations for each individual sample to allow pooling of sequencing library samples.\nAmplify the PCR 2 reaction in a thermocycler using the program outlined in Table 10.\nClean agarose gel equipment for purifying amplified products with 0.1 N HCl for 10 min prior to casting a gel. Prepare a 2% agarose gel containing DNA stain for purifying PCR 2 amplified products.",
    "Run the PCR 2 product on the 2% agarose gel at low voltage (1.0–1.5 h run). PCR 2 yields a product of 200 bp.\nVisualize the PCR products on a blue light transilluminator. Excise the 200 bp band and purify DNA from the agarose gel slice using a gel extraction kit. Quantify and measure the purity of the sequencing library on both the spectrophotometer and fluorometer.\n\t\tNOTE: A typical gel-purified sequencing library concentration ranges from 5–10 ng/μL and a total yield of 150–300 ng.\nHigh-throughput sequencing\n\t\nSequence the CRISPR sequencing libraries on next-generation sequencers.\nSequence reference T0 samples at higher read depth of 400- to 500-fold library coverage. Sequence experimental timepoint samples for drop-out screens at a minimum read depth of 200-fold. For strong positive selection screens, a minimum of read depth of 50-fold coverage is sufficient for identification of enriched sgRNAs.\n\t\tNOTE: It is critical to sequence the T0 sample to determine library representation for a particular screen and serve as a reference for the determining sgRNA fold changes over time.\n7. Data analysis\nAlign sequence using programs such as Bowtie to map sequence reads to the reference library using the following parameters: -v2 (allowing two mismatches) and -m1 (discarding any read that mapped to more than one sequence in the library).\nNormalize the number of uniquely mapped reads for each sgRNA for a given sample to 10 million reads per sample as follows:\nimgsrc://cloudfront.jove.com/files/ftp_upload/59780/59780eq3.jpg107\nCalculate the log2 fold change of each sgRNA for each replicate at each timepoint (Tn) compared to the T0 sample (Tn/T0). Add a pseudo count of 0.5 reads to all read counts to prevent discontinuities from zeros. Exclude sgRNAs with <30 raw reads in the T0 sample from fold-change calculation and downstream analysis.",
    "Analyze fold changes with the Bayesian Analysis of Gene Essentiality (BAGEL) algorithm <https://github.com/hart-lab/bagel>, using the core essential and non-essential training sets defined previously19 for gene essentiality screens (Supplementary Table S1) or DrugZ <https://github.com/hart-lab/drugZ> for drug screens20.\nCalculate the precision and recall for screen performance assessment using BF scores. Use the essential set from step 7.4 as the true positive list for the precision_recall_curve function of the Scikit-learn library for Python, along with the above BF score subset. Alternatively, perform the same using the PRROC package in R.\nCalculate the mean fold change of all guides for each gene. Generate density plots for the essential and non-essential genes (see step 7.4) in R or equivalent software. In R, if x.ess is a vector containing the log fold change values of essential genes and x.nonEss contain non-essential genes, plot using the following command:\n\tplot( density( x.ess ), xlab=”mean logFC”,col=”red”,lwd=2 )\n\tlines( density( x.nonEss ), col=”blue”,lwd=2 )\n\tNOTE: For Python version details and packages used, see scikit-learn v0.19.1: (published by Pedregosa et al.21).\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Genetics"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}