{
  "id": 18279,
  "origin_website": "Jove",
  "title": "Quantitative Visualization of Leukocyte Infiltrate in a Murine Model of Fulminant Myocarditis by Light Sheet Microscopy",
  "procedures": [
    "All animal experiments were conducted in accordance with EU guidelines and were approved by the relevant local authorities in Essen (AZ 84-02.04.2014.A036 - Landesamt für Natur, Umwelt und Verbraucherschutz Nordrhein-Westfalen, Essen, Germany). The animals were used and housed under specific pathogen-free (SPF) conditions.\n1. Induction of Myocarditis by Diphtheria Toxin (DTX)\nPrepare the DTX solution for the induction of myocarditis by diluting the DTX stock solution with phosphate-buffered saline (PBS) to a 1 µg/mL working solution.\nApply 100 µL of this solution intratracheally (i.t.) into 8 to 10 week-old CD11c.DTR mice (ca. 5 ng/g bodyweight (bw)), as shown by Hasenberg et al. for the i.t. application of a fungal spore suspension20.\n\tNOTE: The intraperitoneal application of the toxin might result in a similar induction of fatal myocarditis. However, this approach would have to first be validated.\n\t\nFor i.t. application, anesthetize the animals by an intraperitoneal (i.p.) injection of 100 mg/kg bw ketamine and 10 mg/kg bw xylazine.\nAfter reaching deep narcosis (toe pinch test), intubate the animals by using a 22 G indwelt venous catheter through the oral cavity. Check the correct positioning of the lens tube by ventilating the animals with a small-animal respirator at a rate of 250 breaths per min and an inhalation volume of 250 µL per breath, also shown by Hasenberg et. al.20.\n\t\tNOTE: When positioned correctly, the breath rate of the animals will change according to the applied ventilation settings.\nDisconnect the ventilation system and instill the 100 µL of DTX solution or an equal amount of PBS as a control through the catheter into the lung and continue to ventilate the animals for 1 additional min.\nLet the animals recover from anesthesia and monitor the general health status and body weight change for 4 days.",
    "NOTE: Depending on the genetic background, mouse strain, or initial weight, the severity and onset of myocarditis might vary and should be determined first.\n2. Sample Preparation for Light-sheet Microscopy\n4 days after toxin application, anesthetize the mice by flushing an induction chamber with a vaporized 2% isoflurane/oxygen mixture. Inject 15 µg of a directly labeled anti-CD45 antibody (clone 30-F11, AlexaFluor647 (AF647)) in 50 µL of PBS intravenously (i.v.) using the retro-orbital application route, which ensures a very fast and highly accurate application of the correct amount of antibody.\n\tNOTE: The desired depth of narcosis has been reached when the mice are recumbent and do not react to toe pinch testing.\nAfter 2 h of incubation, sacrifice the mice by cervical dislocation and perfuse the hearts in situ with 5 mL of PBS/EDTA (5 mM).\nExpose the heart and inject the perfusion solution into the right ventricle using a 21 G catheter. Perfuse with slow, constant pressure and make sure that the blood can be drained after cutting open the aorta.\n\t\tNOTE: This transcardial perfusion might result in minor preparation artifacts, which could disturb the final 3D visualization of the organ. Therefore, advanced animal experimenters could perform the perfusion through the inferior vena cava, excising the abdominal aorta.\nFor chemical fixation, perfuse the heart through the same recess with 5 mL of 4% paraformaldehyde (PFA). Keep the catheter in place and simply attach a new syringe filled with PFA. Perfuse with slow and constant pressure.\n\tNOTE: Paraformaldehydeis highly toxic; avoid contact with the skin, eyes, and other mucosa.\n\t\nGently grasp the heart with serrated forceps; pull it slightly upwards; and cut all tissue connections, including the incoming and outgoing arteries and veins. Store the organ for an additional 4 h in 4% PFA for further fixation.",
    "To dehydrate the organ, incubate the heart in an ascending ethanol series at 50%, 70%, and twice at 100%, each for 12 h, at 4 °C in the dark. Here, use black 5 mL polypropylene reaction tubes, allowing them to constantly rotate in a tube rotator using a slow rotation speed to prevent air-bubble formation.\nComplete sample preparation by chemical clearing. To make the hearts transparent, incubate them in 98% dibenzyl ether (DBE) whilst constantly rotating overnight.\n\tNOTE: DBE is irritating to eyes, skin, and the respiratory system.\n3. Light-sheet Microscopy\nConduct LSFM using the light-sheet microscope (see the table of materials). Place the sample on the standard sample holder of the microscope into the DBE-filled cuvette, which is suitable for specimens up to 30 mm x 30 mm x 15 mm.\nHold the sample firmly in place during the image acquisition using dehydrated and cleared agarose blocks.\nTo prepare the agarose blocks, pour 2% molten agarose into a mold (15 mm x 15 mm x 5 mm). Let the agarose cool down until it solidifies.\nDehydrate it in an ascending ethanol series (50%, 70%, and twice at 100%). Incubate the agarose blocks overnight in 98% DBE. Store the agarose in DBE until it is used.\n\t\tNOTE: As the agarose is comprised mainly of water, the incubation times for each dehydration step may be extended, depending on the size of the block.\n\t\tNOTE: DBE is irritating to the eyes, skin, and respiratory system.\nWhen needed, cut the prepared agarose block to the desired shape using a sharp scalpel. Typically, cut prism- or wedge-shaped forms to place at the edges of the sample adapter.\n\t\tNOTE: As the agarose blocks are elastic, the sample stays in place when pushed with little force.",
    "Detect the fluorescence signals of interest (here, autofluorescence and anti-CD45 antibody staining) with the appropriate excitation and emission filter settings.\nFor the detection of the connective tissue-derived autofluorescence signal, use a 525/50 nm bandpass filter at an excitation wavelength of 488 nm (OPSL: 50 mW); CD45 staining with an AF647-coupled antibody is detected at 668 nm (bandpass filter: 680/30 nm) and at an excitation wavelength of 647 nm (diode laser: 50 mW).\nChoose 4 µm as the distance between the two individual z-planes.\n4. Image Post-processing\nNOTE: The acquired digital image data were further processed with a scientific 3D/4D image processing and analysis software (see the table of materials).\nOpening and pre-adjustment of the data files.\nAfter starting the analysis software, select the \"Surpass\" button in the upper-left corner. To open the image stacks, choose \"File,\" \"Open,\" and select a folder containing the data from the first acquired channel. Choose \"Edit\" and \"Add Channels\" to add further acquired channels.\n\t\tNOTE: Depending on the data size and the computer system, this process can take several minutes. The presented protocol demonstrates all steps for 2 acquisition channels (autofluorescence and AF647).\nCorrect the x, y, and z voxel dimensions by clicking \"Edit\" and selecting \"Image Properties.\" When the new window opens, adjust the parameters.",
    "NOTE: This step depends on the employed microscope system and the particular data format. Correct x-y-z values are critical for subsequent size and distant measurements. In most cases, these parameters are stored as meta data in the micrograph files. However, if the file format cannot be interpreted correctly by the analysis software, it is important to manually enter the pixel size. The pixel size in the x and y dimensions depend on the camera pixel size, the potentially applied binning, and the lens and objective magnification. The pixel size in z is equivalent to the self-defined z-step size (e.g., 4 µm).\nChannel adjustments\nFirst transform the autofluorescence signal to grayscale by opening the \"Display adjustment\" (\"Edit\" and \"Show Display Adjustment\"). A new window will list all opened channels and the display settings for all of them; to change its default color, select the autofluorescence channel and choose the \"white\" display style. Click \"ok\" to apply.\nFor black level adjustment, go back to \"Display adjustment\" and adjust the black level value to exclude unwanted background signals that do not represent sample structures.\n\t\t\nTo do so, use the upper-left triangle on the channel bar and drag it from left to right.\n\t\t\tNOTE: Changes will be visualized immediately. Make sure to only suppress signals not deriving from the sample. Minimum values in the background should never be \"0\" to avoid pitch-black pixels, as the noise signals might be needed for additional calculations. Make sure that all black level changes are performed after image acquisition. Otherwise, valuable sample information may be lost. The black-level adjustment just serves representative purposes. To use the same display settings over different samples, precise values can be entered into the \"min\" numerical field below the channel list. This is very helpful for quantitative analyses.",
    "Perform intensity adjustment, either by using the upper-right triangle to adjust the respective channel intensity or by entering precise values into the \"max\" numerical field below the channel list.\nPerform contrast adjustment by dragging the lower triangle in the middle of the channel bar to increase or decrease the gamma value or by entering the precise values.\nAdjust the AF647 channel according to the autofluorescence channel. As a difference, set the visualization of the AF647 signal to a heat-map color look-up table. Do this by choosing the channel mode \"fire\" in an approach similar to that in step 4.2.1.\n\t\tNOTE: As the overall signal intensities are significantly lower compared to the autofluorescence channel, the black levels are usually adjusted to much lower values. As for the autofluorescence channel, the brightness of this channel is usually increased.\nSelect the \"blend mode\" to visualize tissue structures in detail. Analyze all samples from one series with the same parameter values.\nVirtual clipping\nTo virtually cut open the organ before the 3D scene export, apply a clipping plane on the rendered 3D object.\n\t\t\nClick the \"Clipping Plane\" icon (scissors) in the object list. Inside the image view, a yellow frame and a manipulator (white spindle) will appear. Rotate the spindle at the thinner end with the mouse, thereby changing the orientation of the clipping plane, and move the thicker middle part of the spindle to select the desired depth of clipping.\nHide the frame and manipulator by unchecking the respective checkboxes below the object list and create the desired snapshots.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Medicine"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}