{
  "id": 10576,
  "origin_website": "Jove",
  "title": "Isolation of Mesenchymal Stem Cells from Human Alveolar Periosteum and Effects of Vitamin D on Osteogenic Activity of Periosteum-derived Cells",
  "procedures": [
    "The study protocol was approved by the Institutional Review Board of Chang Gung Memorial Hospital. All participants provided written informed consent.\n1. Tissue Preparation\nHarvest the periosteal tissues from patients during dental surgery (Figure 1). After flap reflection under local anesthesia, take a piece of periosteum tissue from the alveolar bone using a periosteal separator31.\nAfter harvesting, store the periosteal tissues slices of approximately 5 mm × 2 mm in Dulbecco’s phosphate buffered saline (DPBS) with 300 U/mL of penicillin and 300 mg/mL of streptomycin. Transfer the tissues to the laboratory within 24 h.\nMince the alveolar periosteal tissue fragments with scalpels until well minced and maintain the samples in passage 0 medium (composed of 300 U/mL of penicillin and 300 mg/mL of streptomycin, α-MEM, and 5% fetal bovine serum [FBS]) cultured in an incubator at 37 °C with humidified air (5% carbon dioxide). In the incubator, prepare a water basin to maintain humidity.\nChange the medium after 3 days and twice per week thereafter.\nWhen the cells have reached subconfluence (80%), release the adherent cells with 200 µL of 0.25% trypsin in the incubator (37 °C) for 3 min, and then use 4.5 mL of medium to terminate the reaction.\nPlate the cells again in fresh passage 1 medium (α-MEM, 10% FBS, 100 units/mL of penicillin, and 100 μg/mL of streptomycin). Plate is 5 × 103 Cells (as counted by a hemocytometer).\nPerform each subsequent passage after the cells achieve 80% confluence31.\n\tNOTE: In the beginning, the medium will be orange red. After roughly three days, the medium color should change to a yellowish shade. The doubling time of the cells is roughly 30–40 h, needing 7 days for 3–5 generations.",
    "Culture the isolated PDCs in α-MEM supplemented with 10% FBS, 100 U/mL of penicillin, and 100 mg/mL of streptomycin in an incubator (37 °C, 5% CO2).\nObserve cell growth daily and replace the growth medium twice per week. Use third- to fifth-generation cells for all further experiments.\n2. Flow Cytometry\nHarvest 1 × 106 cells through trypsin digestion:\n\t\nAdd 200 µL of 0.25% trypsin. After 3 min, use 4.5 mL of culture medium containing FBS to terminate the reaction of trypsin and collect through centrifugation (1500 rpm, 5 min, 22 °C).\nWash the cell pellets three times using 1x DPBS. Resuspend the cells in 200 µL 1x permeabilization buffer. Count the cells with a hemocytometer.\nExamine the expressed surface markers expressed of the PDCs through flow cytometry (fluorescence-activated cell sorting)32. Use monoclonal antibodies (MAb) against CD19 (fluorescein isothiocyanate (FITC)), CD34 (FITC), CD44 (Phycoerythrin [PE]), CD45 (FITC), CD73 (PE), CD90 (allophycocyanin [APC]), CD146 (PE), STRO-1 (Alex), and HLA-DR (FITC)32.\n\t\nAdd the antibodies to the samples and culture in the dark at 4 °C for 30 min.\nWash the cells with 1x DPBS three times.\nFix the cells using 2% formaldehyde and proceed with flow cytometry analysis32.\n3. Cell Attachment and Viability with Osteogenic, Adipogenic, and Chondrogenic Differentiation\nInduce differentiation in the cells into osteogenic, adipogenic, and chondrogenic lineages by culturing the periosteal cells in all three passages on six-well plates with specific differentiation media.\nFor osteogenic differentiation, culture the cells in α-MEM at a density of 5000 cells per well on six-well culture plates.\n\t\nOn achieving 80% confluence, culture the cells in media containing α-MEM, 5% FBS, β-glycerophosphate (10 mM), 10−7 M dexamethasone (0.1 mM), and 5 mL of ascorbic acid (100 uM). Culture the negative control in media consisting of α-MEM and 5% FBS.\nChange the media twice per week.",
    "After 4 weeks, assess the potential of the cells to differentiate into an osteogenic lineage by staining the cells using a von Kossa assay, which distinguishes the presence of calcified deposits in a culture33.\n\t\t\nAdd 10% formalin for fixing. Within 30 min, add 5% silver nitrate and treat under ultraviolet (UV) light for 1 h at room temperature.\nAdd 5% Na2SO4 four times, allowing 3 min for each reaction. Finally, wash the cells twice with distilled water.\n\t\t\tNOTE: Von Kossa staining is a precipitation reaction where silver ions and phosphate react in the presence of acidic material; this staining technique is not specific to calcium. In this study, when the investigated cells were treated with silver nitrate solution, calcium—which is reduced by strong UV light—was replaced by silver, which became visible as metallic silver.\nFor adipogenic differentiation, culture the cells at a density of 5000 cells per well on six-well culture plates containing α-MEM.\n\t\nOn achieving 80% confluence, culture the cells in media containing α-MEM, 5% FBS, 0.5 mM 3-isobutyl-1-methylxanthine (100 mg/mL), 1% penicillin, 10−6 M dexamethasone (1 mM), insulin (5 mg/mL), and indomethacin (60 mM).\nCulture the negative control in media consisting of α-MEM and 5% FBS.\nAfter 6–9 weeks, use oil red O to stain the cells and highlight lipid drops, thereby determining the presence of adipogenic differentiation33:\n\t\t\nAdd 10% formalin for fixing. Within 30 min, stain the cells with 0.5% oil red O at room temperature for 10 min, and then wash the cells three times with 60% isopropanol for 3 min each time; finally, wash the cells with distilled water.",
    "NOTE: Oil red O is a lysochrome (fat-soluble) diazo dye used for the staining of neutral lipids, primarily triacylglycerol, lipoprotein, and cholesterol esters. The dye dissolves in the lipid droplets in the cell, turning the lipid droplets red.\nFor chondrocyte differentiation, culture cells on six-well culture plates with each well containing 5000 cells.\n\t\nAdd a differentiation medium containing α-MEM, 5% FBS, 10−7 M dexamethasone (0.1 mM), sodium pyruvate (100 µg/mL), insulin-transferrin-selenium-A (1 × ITS), transforming growth factor-β (10 ng/mL), and 5 mL of ascorbic acid (100 µM).\nCulture the negative control in media consisting of α-MEM and 5% FBS.\nAfter 4–5 weeks, use Alcian blue staining to highlight the acidic polysaccharides, such as glycosaminoglycans or some types of mucopolysaccharides, in the cartilage of the cells to determine the presence of chondrocyte differentiation33.\n\t\t\nAdd 10% formalin for fixing. Within 30 min, add 3% acetic acid and allow 2 min for the reaction. Subsequently, wash with distilled water three times, add 1% Alcian blue 8GX incubated for 30 min, and then wash with distilled water. Finally, add 3% acetic acid and wash for 3 min, and then wash with distilled water to finish.\n\t\t\tNOTE: The parts of the cell that specifically stain by this dye become blue to blue-green after staining and are called “alcianophilic.”\n4. Effects of 25-Dihydroxyvitamin D3 (1,25-(OH)2D3) on Osteogenesis\nSplit the P3 to P5 PDCs into six groups and culture on 6-well plates with various culture media:\nnegative group (α-MEM and 5% FBS);\nVitamin C group (α-MEM, 5% FBS, 10 mM β-glycerophosphate, and 10−7 M dexamethasone + 100 uM Vitamin C);\nand 10−7 M 1,25-(OH)2D3 group (α-MEM, 5% FBS, 10 mM β-glycerophosphate, and 10−7 M dexamethasone + 10−7 M 1,25-(OH)2D3).",
    "Add 2 mL of the medium to an incubator (37 °C) in each well and change the medium twice every week.\n5. Reverse Transcription/Quantitative Real-Time Polymerase Chain Reaction\nAfter 7 d of osteoblast differentiation, isolate the total RNA on ice by using a commercial reagent (see Table of Materials):\n\t\nAdd 1 mL of isolation reagent to each well. Add 200 µL of bromochloropropane and leave for 10 min to generate layered RNA, and then centrifuge at 10,000 rpm for 15 min at 4 °C.\nAfter centrifugation, add 500 µL of 2-propanol to 500 µL of the supernatant containing RNA. Precipitate the RNA on the ice and allow 15 min for the reaction.\nAfter the procedure, centrifuge at 12,000 rpm for 15 min at 4 °C, after which the RNA is located at the bottom of the tube. Subsequently, remove the supernatant by using 1 mL of 75% alcohol for washing and centrifuge at 7,500 rpm for 8 min in 4 °C.\nRemove the supernatant and use a vacuum concentrator to produce RNA from the bottom of the liquid. Recover with water.\nReverse transcribe the RNA (1 μg) using avian myeloblastosis virus reverse transcriptase. Set the polymerase chain reaction (PCR) to run at 25 °C for 10 min followed by 50 °C for 60 min and then 85 °C for 5 min, before finally maintaining at 4 °C.\nSynthesize first-strand complementary DNA (cDNA). Perform quantitative PCR (qPCR) using 5 μL of 1:10 diluted cDNA. Conduct quantitative RT-PCR (qRT-PCR) using primers for ALP, BSP, OCN, CBFA1, and collagen-1.\n\tNOTE: To avoid DNA contamination by the signals, the forward and reverse sequences of each primer were designed on distinct exons.",
    "Perform qPCR by using a commercial PCR Master Mix (see Table of Materials) in accordance with the manufacturer’s instructions. Set the thermal cycler at 50 °C for 2 min followed by 95 °C for 10 min and then 40 cycles each at 95 °C for 15 s followed by 60 °C for 60 s.\n\tNOTE: The SYBR protocol also requires a melt curve stage, which is run at 95 °C for 15 s, 60 °C for 60 s, and then 95 °C for 15 s.\nNormalize the cycle threshold values for ALP, BSP, CBFA1, collagen-1, and OCN to that of the housekeeping gene GAPDH.34\nPrimer pairs are listed in the Table of Materials.\n6. Alkaline Phosphatase Activity\nAssess the ALP enzyme activity of the cells using the previously described technique35, which converts p-nitrophenyl phosphate to p-nitrophenol; p-nitrophenyl phosphate is a phosphatase substrate that turns yellow when dephosphorylated by ALP, as determined at a 405-nm wavelength. Normalize the total p-nitrophenol formed based on the total protein as determined by the Bradford assay.\nCompare the ALP activities of the control (α-MEM, 5% FBS), Vitamin C (α-MEM, 5% FBS, 10 mM β-glycerophosphate, 10−7 M dexamethasone + 100 uM Vitamin C), 1,25-(OH)2D3 (α-MEM, 5% FBS, 10 mM β-glycerophosphate, and 10−7 M dexamethasone + 10−8 M 1,25-(OH)2D3), and Vitamin C + 1,25-(OH)2D3 (α-MEM, 5% FBS, 10 mM β-glycerophosphate, 10−7 M dexamethasone + 100 uM Vitamin C +1,25-(OH)2D3) groups after 1, 2, 3, and 4 week of culture.\nPerform a protein extraction procedure on ice:\n\t\nScrape the cells from the 6-well plates and add 50 µL of lysis buffer. Subsequently, place the cells on the ice for 30 min to destroy the cells and free the protein.",
    "After 30 min, centrifuge at 13000 rpm at 4 °C for 15 min. After centrifugation, extract the supernatant for storage and use.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}