{
  "id": 19824,
  "origin_website": "Wiley",
  "title": "A Basic Guide to the Growth and Manipulation of the Blast Fungus, Magnaporthe oryzae",
  "procedures": [
    "Filamentous fungi can be effectively stored by growing mycelium through dry filter paper (Fong, Anuar, Lim, Tham, & Sanderson, 2000[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0013]; Gupta et al., 2020[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0015]; Jia, 2009[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0019]). This is a simple, inexpensive method to preserve fungal mycelium for many years. M. oryzae overwinters in rice straw in the form of fungal mycelium. In contrast to many fungal species, conidia of M. oryzae are not dormant structures and are not long lived; their primary role is to germinate rapidly and produce appressoria (Talbot, 2019[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0034]). The fungus therefore uses mycelium within infected plant tissue as its dormant state. Infected rice straw provides a dry environment in which the fungus survives the winter. Following rainfall in the spring, M. oryzae sporulates from straw material and conidia then infect new plants. This protocol mimics this stage of the life cycle of the fungus, using filter paper as an environment in which the fungal mycelium can survive for long periods, once desiccated. Viability of fungal mycelium from desiccated filter stocks preserved using this protocol has shown to still recover perfectly after 30 years at −20°C, demonstrating the efficiency of the technique.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\n70% (v/v) ethanol (in water) for decontaminating materials and equipment\nViable M. oryzae strains (e.g., Guy11, the most commonly used rice blast strain, available from the corresponding author's laboratory)\nComplete medium (CM) sterile plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0001])\nCirculating Class II flow hood (BSC Class II or equivalent)\nStainless-steel surgical scalpel handle and scalpel (e.g., Fisher Scientific cat. no. 11890862 and 12961645)\nStainless-steel forceps (e.g., Fisher Scientific Nickel Electro™ cat. no. 15699310)\nWhatman 3MM filter paper cut into ∼2-mm2 squares (e.g., Fisherbrand™ cat. no. 09800)",
    "Incubator with timer (e.g., Fisher Scientific cat. no. 15500214), set at 24°C with a 12-hr photoperiod\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\n60 × 15-mm disposable polystyrene petri dishes (e.g., Sigma-Aldrich cat. no. P5481)\nMicropore surgical paper tape (e.g., Fisher Scientific cat. no. 12787597)\nVacuum desiccator\nLidded plastic/Tupperware container (e.g., Lakeland lidded box food storage 2.5 L)\n2- to 5-mm orange indicator silica gel desiccant beads (e.g., Trustleaf cat. no. SK-9304226)\n30 × 50-mm paper bags (e.g., Fisher Scientific cat. no. 2152101), autoclaved\nFreezer (e.g., Fisher Scientific cat. no. TSX2320FA), set at −20°C\n1. Using a steel scalpel, cut a 1- to 5-mm2 piece of mycelium from the growing margin of a 7- to 10-day-old M. oryzae culture (as indicated in Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0001]) and transfer to a fresh CM agar plate.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize scalpel before and after it is in contact with the fungus following proper aseptic techniques.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/08dd2720-9db2-4f0a-9df3-bffe47fbf501/cpz1523-fig-0001-m.jpg</p>\nFigure 1\nLeft, a 7-day-old plate culture of M. oryzae (Guy11) after incubation at 24°C with a 12-hr photoperiod. The red square indicates the growth margin where the mycelium should be cut to be transferred onto fresh CM agar for subculture. Middle, a CM medium agar plate with a piece of M. oryzae mycelium inoculated in the center and Whatman filter paper squares for the generation of fungal filter stocks. Right, a 12-day-old M. oryzae culture grown on CM agar with filter papers through which fungal mycelium has grown (at top right, a filter through which mycelium has grown has been collected from the plate).",
    "2. Using steel forceps, place 20-30 pieces of Whatman filter paper, cut into ∼2-mm2 squares, around the transferred piece of mycelium on the CM agar plate (as indicated in Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0001]).\nThe size of the cut pieces of Whatman filter paper can vary, but smaller pieces are recommended to allow the fungus to grow through them successfully. When generating filter stocks, CM agar is usually not supplemented with any antibiotics, allowing the fungus to grow in optimal conditions before storage.\n3. Incubate plates at 24°C with a 12-hr photoperiod until mycelium has grown through all of the filter papers.\nDo not leave plates incubating for >2 weeks before collecting the filter papers. Leaving plates for too long can reduce viability of the strain during storage.\n4. Using flame-sterilized steel forceps, collect the filter papers covered with M. oryzae mycelium, place these in 60 × 15-mm vented petri dishes, and seal them with micropore surgical paper tape.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize forceps before and after they are in contact with the fungus following proper aseptic techniques.\n5. Place petri dishes in a vacuum desiccator for 48 hr to dry fully. Alternatively, if a vacuum desiccator is not available, the petri dishes containing filters can be placed in a lidded plastic container containing a 1- to 2-cm depth of silica gel desiccant and left to desiccate for 10-15 days at room temperature.\nMake sure the plastic/Tupperware container is in a dry place, using fresh silica gel each time to enable complete desiccation of the filter papers. Freezing humid filter papers greatly diminishes the viability of the fungal culture stock.\n6. Once the filter papers are completely desiccated, transfer them to autoclaved flat paper bags using sterilized steel forceps.",
    "Work should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize forceps before and after they are contact with the fungus following proper aseptic techniques.\n7. Filter bags containing the fungal stocks are stored at −20°C inside a lidded plastic/Tupperware container with 1-2 cm3 of silica gel.\nIf kept properly, M. oryzae filter stocks can be stored for many years. Currently, in our laboratory, we still revive 30-year-old filter stocks successfully.",
    "M. oryzae is commonly cultured in solid CM (complete medium) agar plates. The strain can be grown directly by placing a frozen filter paper stock on a plate or by transferring a 2- to 5-mm piece of mycelium of another growing culture onto fresh growth medium. Every transfer must be done carried out in a circulating Class II flow hood under sterile conditions.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\n70% (v/v) ethanol (in water) for decontaminating materials and equipment\nViable M. oryzae filter frozen stocks (e.g., Guy11; see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0001])\nComplete medium (CM) sterile plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0001]), with or without antibiotics (see step 1)\nCirculating Class II flow hood (BSC Class II or equivalent)\nStainless-steel forceps (e.g., Fisher Scientific Nickel Electro™ cat. no. 15699310)\nIncubator with timer (e.g., Fisher Scientific cat. no. 15500214), set at 24°C with a 12-hr photoperiod\nStainless-steel surgical scalpel handle and scalpel (e.g., Fisher Scientific cat. no. 11890862 and 12961645)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\n1. Using steel forceps, pick one M. oryzae desiccated filter stock (directly from frozen at −20°C) and place it on the middle of a CM agar plate. Alternatively, a small fragment of a filter stock paper is easily sufficient and can be cut from a stock paper using flame-sterilized scissors.",
    "Work should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize forceps and scissors before and after they are in contact with the fungus following proper aseptic techniques. Use appropriate antibiotics to prevent bacterial contamination, if necessary, but this is not advised for routine subculture. If required, stock filter papers can be cut and separated to numerous CM agar plates, as 1 mm2 of desiccated filter containing M. oryzae will provide sufficient mycelium to revive on CM medium.\nRoutinely used antibiotics include penicillin-streptomycin (50 U/ml; e.g., Fisher Scientific cat. no. 15140122) for prevention of bacterial contamination. For selection of fungal transformants, hygromycin B (200 μg/ml; e.g., Fisher Scientific cat. no. 10687010), BASTA (glufosinate ammonium; 100 μg/ml; e.g., Sigma-Aldrich cat. no. G4670), and sulfonylurea (chlorimuron ethyl; 100 μg/ml; e.g., Sigma-Aldrich cat. no. 06846) are commonly used for M. oryzae.\n2. Incubate plates 7-10 days at 24°C with a 12-hr photoperiod to obtain a 5- to 7-cm M. oryzae culture.\nUse 7- to 10-day-old colonies, and never older than 14 days, to avoid viability issues.\n3. Using a steel scalpel, cut a 1- to 5-mm2 piece of mycelium from the growing margin of the 7- to 10-day-old M. oryzae culture (as indicated in Fig. 1a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0001]) and transfer to a fresh CM agar plate.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize the scalpel before and after it is in contact with the fungus following proper aseptic techniques. Use appropriate antibiotics to prevent contamination.\n4. Incubate plates 7-10 days at 24°C with a 12-hr photoperiod to obtain a 5- to 7-cm M. oryzae culture.",
    "Use the colony as soon as possible once grown and when no older than 2 weeks. Culture transfer for successive use should only be performed once because original viability and phenotypes can be lost, which is why reviving M. oryzae from filter stocks is always recommended.",
    "For many manipulations, M. oryzae will need to be grown in liquid CM broth. This type of mycelial growth is fast, and 24-48 hr of incubation generates large amounts of fungal mycelium that can be used to extract genomic DNA, total RNA, and protein from the fungal tissue. Furthermore, fungal protoplasts for M. oryzae transformation are also generated from fugal mycelium grown in liquid culture.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\nViable M. oryzae filter frozen stocks (see Basic Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0001])\n70% (v/v) ethanol (in water) for decontaminating materials and equipment\nComplete medium (CM) sterile plates (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0001])\nLiquid CM (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0002])\nCirculating Class II flow hood (BSC Class II or equivalent)\nStainless-steel surgical scalpel handle and scalpel (e.g., Fisher Scientific cat. no. 11890862 and 12961645)\nStainless-steel forceps (e.g., Fisher Scientific Nickel Electro™ cat. no. 15699310)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\nStainless steel blender container (e.g., Container for Waring® Blenders, 360 ml, cat. no. 58983-004)\nTwo-speed 1-liter laboratory blender (e.g., Waring® cat. no. WZ-04242-11)\n250-ml glass Erlenmeyer flask (e.g., Fisher Scientific cat. no. 15436143)\nPolyurethane foam stopper (e.g., Fisher Scientific cat. no. 12984291)\nAluminum foil (e.g., Lakeland foil)\nRotary shaking platform (e.g., Fisher Scientific cat. no. 11676076)\nIncubator with timer (e.g., Fisher Scientific cat. no. 15500214), set at 24°C with a 12-hr photoperiod\n1. Using a steel scalpel, cut all the mycelium from the growing margin of a 7- to 10-day-old M. oryzae culture and transfer it to a stainless-steel container for blending. Add 250 ml liquid CM.",
    "Work should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize scalpels before and after they are in contact with the fungus following proper aseptic techniques. Include appropriate antibiotics in the liquid CM only when necessary to prevent contamination (penicillin-streptomycin, 50 U/ml; e.g., Fisher Scientific cat. no. 15140122). Steel blending containers must be autoclaved before use.\n2. Blend the solid inoculum with the liquid CM in a two-speed blender, 5 s at the first speed followed by 10 s at the second speed.\nDo not remove blender lid outside a circulating Class II flow hood to prevent contamination of the culture.\n3. Transfer the blended culture into an autoclaved 250-ml glass Erlenmeyer and cover with a foam stopper and sterilized aluminum foil, as indicated in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0002].\nTransfer must be done in a circulating Class II flow hood.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/5f31b4d9-c7ac-4977-9df5-2f326156300e/cpz1523-fig-0002-m.jpg</p>\nFigure 2\nM. oryzae liquid culture of strain Guy11 in liquid CM medium before (left) and after (right) incubation for 30 hr at 24°C with a 12-hr photoperiod in a rotary shaker set at 100 rpm. A typical liquid culture is shown, made using a 250-ml Erlenmeyer flask covered with a foam stopper and aluminum foil to prevent contamination.\n4. Incubate the flask on a rotary shaker set at 100 rpm in an incubator at 24°C with a 12-hr photoperiod for 30-48 hr.\nUsually, the liquid culture will turn a light brown color as shown in Figure 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0002]. However, if the culture is overgrown, it will turn a darker color, indicating that it is too old and overgrown for experimentation.",
    "M. oryzae genomic DNA extraction can be performed starting from fungal mycelium grown on liquid or solid agar medium. This is a multi-step protocol aiming to obtain purified fungal DNA free from proteins, polyphenols, tannins, and polysaccharides. After several years of refining DNA extraction methods, we have found that a cetyl trimethyl ammonium bromide (CTAB) protocol works successfully for extraction of high-quality plant, bacteria, yeast, and fungal DNA (Rogers & Bendich, 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0026]; Saghai-Maroof, Soliman, Jorgensen, & Allard, 1984[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0028]). This protocol, which has been updated and modified, works very well for M. oryzae genomic DNA extraction.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\n70% (v/v) ethanol (in water) for decontaminating materials and equipment\n7- to 10-day-old M. oryzae fungal culture grown on CM agar medium (e.g., Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0002] or Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0003])\nComplete medium (CM) with agar (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0001])\nCTAB buffer (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0003]), prewarmed to 65°C\n24:1 (v/v) chloroform/isoamyl alcohol (CIA)\nIsopropanol, prechilled to −20°C\nTE buffer with RNase (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0003])\n3 M NaOAc, pH 5.2 (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0002])\n100% ethanol, prechilled to −20°C\nSterile distilled water\nCirculating Class II flow hood (BSC Class II or equivalent)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\nStainless-steel surgical scalpel handle and scalpel (e.g., Fisher Scientific cat. no. 11890862 and 12961645)\nStainless-steel laboratory spatula (e.g., Fisher Scientific cat. no. 11523482)\nPrecut 5-cm cellophane discs, sterilized in distilled water by autoclaving\nPorcelain pestle and mortar (e.g., Fisher Scientific cat. no. 11740269 and cat. no. 10443471), prechilled in liquid nitrogen\nSpatula, prechilled in liquid nitrogen\nIncubator with timer (e.g., Fisher Scientific cat. no. 15500214), set at 24°C with a 12-hr photoperiod\nLiquid nitrogen",
    "1.5- and 2-ml microcentrifuge tubes (e.g., Eppendorf ® Microtube capacity 1.5 ml cat. no. EP0030125150 and capacity 2 ml BRAND® microcentrifuge tube cat. no. Z628034)\nSingle-channel micropipets, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000241 and EP3123000250)\nFilter tips, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000055 and EP3123000063)\nPaper towel (e.g., DIY)\nWater bath (e.g., Fisher Scientific cat. no. TSCOL19), set at 65°C\nHigh-speed microtube shaker (e.g., Fisher Scientific cat. no. 02217737)\nMicrotube centrifuge (e.g., Fisher Scientific cat. no. 75002435)\nFreezer (e.g., Fisher Scientific cat. no. TSX2320FA), set at −20°C\n1. Using a steel scalpel, cut a 1- to 5-mm2 piece of mycelium from the growing margin of a 7- to 10-day-old M. oryzae culture (as indicated in Fig. 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0001]) and transfer it to a fresh CM agar plate containing a precut and sterilized 5-cm cellophane disc. Incubate at 24°C with a 12-hr photoperiod for 7-10 days, until fungal mycelium has grown over the edge of the cellophane.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize the scalpel before and after it is in contact with the fungus following proper aseptic techniques. Mycelium plug should be placed on top of the cellophane.\n2. The fungus will grow over the cellophane, covering it completely. Once grown, transfer using sterilized forceps the cellophane with fungal mycelium onto a prechilled pestle and mortar containing liquid nitrogen for grinding. Grind vigorously to obtain a fine light-brown powder.\nCAUTION: Use appropriate personal protective equipment when handling liquid nitrogen.",
    "Do not overgrow culture, as eventually the fungus will disintegrate the cellophane, making it impossible to collect. Do not allow fungal tissue to defrost while grinding or transferring to microcentrifuge tube. Either before or after grinding, the sample can be frozen and stored at −80°C for future use.\n3. With a prechilled spatula, transfer the powder to a 2-ml microcentrifuge tube, filling it to two-thirds of the total capacity.\nDo not fill tube to more than two-thirds of capacity, as larger volumes will be difficult to mix with CTAB buffer, and this will reduce the efficiency of the extraction.\n4. Add 600 μl prewarmed CTAB and incubate sample 30 min at 65°C on a shaking platform set to 100 rpm.\nPreheating CTAB to 65°C facilitates the mixing of fungal material with the buffer.\n5. Once mixed, add 1 vol CIA (24:1 chloroform/isoamyl alcohol) and incubate 30 min at room temperature on a shaking platform set to 400 rpm.\nUsually ∼600 μl CIA is added. Perform all steps involving CIA in a fume hood.\n6. Centrifuge the sample 20 min at 14,000 × g, room temperature, to separate the aqueous phase of the sample.\nThe aqueous phase will be on top, and it is transparent.\n7. Transfer the aqueous phase (supernatant) of the sample to a fresh 1.5-ml microcentrifuge tube, add 1 vol CIA, and incubate 20 min at room temperature on a shaking platform set to 400 rpm.\nUsually ∼600 μl CIA is added.\n8. Centrifuge sample at 14,000 × g for 10 min at room temperature.\nCan also be centrifuged chilled (4°C) up to 1 hr.\n9. Transfer the supernatant to a fresh 1.5-ml microcentrifuge tube, add 1 vol prechilled isopropanol, and leave to precipitate in ice for 5 min or for longer (1-24 hr) in a −20°C freezer.",
    "Longer precipitation is recommended to obtain higher concentrations of DNA.\n10. Centrifuge the sample 10 min at 14,000 × g, room temperature, to recover the DNA.\n11. Discard the supernatant and drain the tube inverted on a paper towel for 10 min.\nLonger draining might be needed if there is still liquid inside the tube.\n12. Resuspend pellet with 500 μl of TE buffer containing RNase and mix gently until pellet is no longer visible. Let stand for 30 min at room temperature or for 10 min at 37°C. Then add 50 μl of 3 M NaOAc (pH 5.2) and 1000 μl prechilled 100% ethanol, mix gently, and incubate sample in a −20°C freezer for at least 30 min.\nSample might take longer to resuspend than 10 min/30 min, but never vortex sample. Longer precipitation is recommended to get higher concentrations of DNA.\n13. Centrifuge the sample 20 min at 14,000 × g, room temperature, to recover the DNA.\n14. Decant the supernatant, and drain upside down on a paper towel for 5 min.\n15. Wash DNA by adding 400 μl of 70% ethanol and gently mixing.\nDo not resuspend pellet, just gently wash it.\n16. Decant the supernatant, and drain upside down on a paper towel for 20 min.\nMake sure there is no ethanol remaining inside the tube; longer draining might be needed.\n17. Resuspend the pellet with 50-200 μl sterile distilled water.\nVolume of water used will depend on the size of the pellet of DNA to resuspend and the desired concentration. Concentration is usually measured using a NanoDrop spectrophotometer and then the samples stored at −20°C.",
    "It is also possible to extract genomic DNA from M. oryzae mycelium using a simple, fast protocol that can be performed in <1 hr. This protocol is commonly used to extract slightly lower-quality DNA that can nevertheless be routinely used for genotypic characterization of M. oryzae strains performed by PCR.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\n70% (v/v) ethanol (in water) for decontaminating materials and equipment\n7- to 10-day-old M. oryzae fungal culture grown on CM agar medium (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0002] or Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0003])\nTE buffer with RNase (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0003])\nComplete medium (CM) with agar (see recipe[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-rec-0001])\nCirculating Class II flow hood (BSC Class II or equivalent)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\nStainless-steel surgical scalpel handle and scalpel (e.g., Fisher Scientific cat. nos. 11890862 and 12961645)\n1.5- and 2-ml microcentrifuge tubes (e.g., Eppendorf ® Microtube capacity 1.5 ml cat. no. EP0030125150 and capacity 2 ml BRAND® microcentrifuge tube cat. no. Z628034)\nHomogenizer metal beads (e.g., Fisherbrand™ cat. no. 15340158), sterilized in 70% ethanol\nSingle-channel micropipet, volume 100-1000 μl (e.g., Eppendorf cat. no. EP3123000250)\nFilter tips, volume 100-1000 μl (e.g., Eppendorf EP3123000063)\nMicrotube centrifuge (e.g., Fisher Scientific cat. no. 75002435)\nGeno/Grinder (e.g., SPEX™ Sample Prep 2010 cat. no. 2010115)\nFreezer (e.g., Fisher Scientific cat. no. TSX2320FA), set at −20°C\n1. Using a steel scalpel, cut a 1- to 5-mm2 piece of mycelium from the growing margin of a 7- to 10-day-old M. oryzae culture (as indicated in Fig. 1a[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0001]) and transfer it to a 2-ml microcentrifuge tube containing one sterile homogenizer metal bead.",
    "Work should be performed in a circulating Class II flow hood near a Bunsen burner. Remember to sterilize the scalpel before and after they are in contact with the fungus following proper aseptic techniques.\n2. Add 400 μl TE buffer containing RNase to the sample.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner.\n3. Grind the mycelium in a Geno/Grinder for 2 min at 17,700 × g, room temperature.\nWork is performed at room temperature.\n4. Centrifuge 10 min at 14,000 × g, room temperature.\n5. Transfer 100 μl of the supernatant to a fresh 1.5-ml microcentrifuge tube, using 1-5 μl per eventual PCR reaction. Sample can be stored in a freezer set at −20°C for future uses.\nUsually, 1 μl of the obtained supernatant should be enough to perform one PCR reaction. This volume will depend on the size of mycelium cut for the extraction. Concentration is usually measured using a NanoDrop spectrophotometer and samples stored at −20°C. The homogenizer metal bead can be cleaned, sterilized, and reused.",
    "In order to study M. oryzae appressorium development, methods to induce conidial germination and induction of appressorium formation have been developed in the laboratory. In vitro appressorium formation was initially shown to be possible on hard surfaces, such as a coverslip, in 1906 (Hasselbring, 1906[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0017]). Surface hydrophobicity was later shown to be a crucial determinant for appressorium development (Lee & Dean, 1994[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0021]), and hard surfaces normally need to have contact angles with water of >90o to stimulate appressorium formation (Talbot, Ebbole, & Hamer, 1993[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0035]). For this reason, appressorium formation has been routinely carried out on polytetrafluoroethylene (PTFE, Teflon) surfaces or GelBond film, but it can also be stimulated on some types of glass coverslips with sufficient surface hydrophobicity, which have better optical properties for microscopy than PTFE. Currently, with specific hydrophobic coverslips and the right humidity settings, appressorium formation and maturation is easily achieved in the laboratory (Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0003]). This protocol describes how to achieve conidial germination in the laboratory for the visualization of appressorium development by light microscopy.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/05f4f65b-0f1d-41fd-9000-a73267fc5a85/cpz1523-fig-0003-m.jpg</p>\nFigure 3\nSchematic representation of the induction of M. oryzae appressorium development on hydrophobic coverslips. 30-μl droplets of conidial suspension (5 × 104 conidia/ml) are inoculated on hydrophobic coverslips and incubated from 2 hr up to 24 hr on square petri dishes containing water-soaked tissue paper to create a humid environment; they are later visualized by microscopy. On the right, a typical microscopy image (×100) of germinated appressoria (of strain Guy11) on coverslips after 8 hr of inoculation. Scale bar, 10 μm. Figure created with BioRender (biorender.com).\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\n70% (v/v) ethanol (in water) for decontaminating materials and equipment",
    "7- to 10-day-old M. oryzae fungal culture grown on CM agar medium (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0002] or Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0003])\nSterile distilled water\nCirculating Class II flow hood (BSC Class II or equivalent)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\nL-shaped cell spreaders (e.g., Fisherbrand™ cat. no. 15615467)\nFilter cloth or polypropylene membrane (e.g., Sigma cat. no. Z104256), sterile\n50-ml conical Falcon tubes (e.g., Fisher Scientific cat. no. 10788561)\n1.5-ml microcentrifuge tubes (e.g., Eppendorf ® Microtube capacity 1.5 ml cat. no. EP0030125150)\nFilter tips, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat no s. EP3123000055 and EP3123000063)\nSingle-channel micropipets, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000241 and EP3123000250)\nMicrotube centrifuge (e.g., Fisher Scientific cat. no. 75002435)\nHemocytometer (e.g., Sigma cat. no. Z359629-1EA)\nBiological microscope (e.g., Fisherbrand™ cat. no. 15374398)\n120-mm square plastic petri dish (e.g., Scientific Laboratory Supplies cat. no. PET3008)\nPaper towel (e.g., DIY)\nHydrophobic coverslips (Eprendia coverslips 18 × 18 mm #2)\nIncubator (e.g., Fisher Scientific cat. no. 15500214), set at 24°C\n1. Pour ∼3 ml sterile distilled water onto a 7- to 10-day-old M. oryzae culture grown on CM agar medium and gently harvest mycelium with an L-shaped cell spreader to release fungal conidia.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Use 5 ml of water for cultures that sporulate in abundance and 1.5-2 ml of water for cultures with deficient sporulation.\n2. Place a double-folded sterile filter cloth on a 50-ml Falcon tube and filter the liquid containing fungal mycelium and conidia.\nAfter filtering, squeeze filter cloth, enabling extra conidia to filter through.\n3. Transfer 1.5 ml of the filtered liquid to a 1.5-ml microcentrifuge tube using a micropipet.",
    "If filtered liquid is very light colored, indicating low abundance of conidia, repeat step 3 to obtain a visible pellet of conidial cells after centrifugation in step 4.\n4. Centrifuge 5 min at 8000 × g, room temperature.\n5. Discard the supernatant and resuspend pellet (conidia) in 1000 μl sterile distilled water.\n6. Count conidial cells using a hemocytometer and a biological microscope, and adjust conidial suspension to a concentration of 5 × 104 conidia/ml.\nFor microscopy purposes, prepare ∼100 μl of conidial suspension.\n7. Prepare square plastic petri dishes with two layers of paper soaked in sterile distilled water and place hydrophobic coverslips on top (see Fig. 3[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0003]).\nMake sure paper towels have enough water to be completely soaked, but pour away any water that has not been absorbed by paper towel, as it can prevent germination. Usually, three cover slips per sample are used.\n8. Pipet 30-μl droplet of conidial suspension onto each coverslip, place the lid on the plastic dish, and incubate at 24°C for appressorium induction.\nBe careful so droplets do not lose shape during incubation. Appressoria will be visible from 2 hr after spore inoculation and will continue to mature for up to 24 hr before collapsing.\n9. To visualize under the microscope, carefully collect coverslip after the desired incubation and place it on a microscopy slide. Dry out excess water and visualize.",
    "For tissue collection from appressoria, experiments must be performed at a larger scale than described in Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0006]. This protocol explains how to achieve large amounts of conidial germination in the laboratory using hydrophobic coverslips mounted onto petri dishes. Commonly, appressorial tissue collection is performed to extract genomic DNA, RNA, or protein from the fungal material.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nAdditional Materials (also see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0006])\nSuperglue (e.g., Loctite)\n1,16-Hexadecanediol\nCirculating Class II flow hood (BSC Class II or equivalent)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\n120-mm square plastic petri dish (e.g., Scientific Laboratory Supplies cat. no. PET3008)\nHydrophobic coverslips (Eprendia coverslips, 18 × 18 mm, #2)\n1.5-ml microcentrifuge tubes (e.g., Eppendorf ® Microtube capacity 1.5 ml cat. no. EP0030125150)\nSingle-channel micropipets, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000241 and EP3123000250)\nFilter tips, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000055 and EP3123000063)\n50-ml conical Falcon tubes (e.g., Fisher Scientific cat. no. 10788561)\nIncubator (e.g., Fisher Scientific cat. no. 15500214), set at 24°C\nSteel razor blades (e.g., Fisher Scientific cat. no. 11904325)\nLiquid nitrogen\nFreeze dryer (e.g., Labconco™ cat. no. 16212551)\nUltra-low freezer (e.g., Fisherbrand™ cat. no. 17426432), set to −80°C\n1. Prepare as much volume as possible of conidial suspension adjusted to 5 × 104 conidia/ml following steps 1-6 of Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0006] (50 ml of conidial suspension will be used per square petri dish, and usually 2-5 petri dishes will be used per sample).",
    "Work should be performed in a circulating Class II flow hood a Bunsen burner. Use as many M. oryzae culture plates grown on CM as needed to obtain the desired volume of conidial suspension. Occasionally 50 plates are harvested to achieve the desired amount of conidia in the laboratory.\n2. Prepare 120-mm square plastic petri dishes with hydrophobic coverslips glued to the bottom of each dish using Superglue.\nPreparing the plastic petri dishes with glued coverslips before starting the experiment is recommended. Use very small amounts of glue, as this can disturb appressorium germination. Attach as many coverslips as will fit to cover the bottom surface of the dish; this will depend on the petri dish being used, but we usually attach eight per dish.\n3. Add 2.5 mg/ml of 1,16-hexadecanediol per 50 ml of conidial suspension.\n1,16-Hexadecanediol will stimulate appressorium germination to occur synchronously, preventing collection of tissue at different germination stages.\n4. Pour 50 ml of conidial suspension into each petri dish, place the lid on each dish, and incubate at 24°C to allow appressorium induction.\nGermination timepoints typically used range from 0 hr to 24 hr. At later timepoints, appressoria formed in coverslips will collapse.\n5. After desired incubation period, pour away liquid inside petri dish and, using a steel razor blade, scrape off the appressoria that have attached and germinated on the coverslips\nPerform this step quickly to achieve uniformity in appressorium development of different samples.\n6. Collect the material into a clean 50-ml Falcon tube and immediately freeze using liquid nitrogen.\nYou can obtain ∼50 mg of appressorial tissue per square petri dish.\n7. Lyophilize samples using a freeze-drier for 24 hr. After this, samples can be used immediately or kept in a freezer at −80°C until required.",
    "Samples are frozen using liquid nitrogen. However, there is usually a very small amount of material, and removing liquid as much as possible will enhance the following extractions.",
    "Spray inoculation pathogenicity assays are commonly used to test the ability of different M. oryzae strains to cause blast disease. In this protocol we explain how we currently use fungal conidial suspensions to spray-inoculate rice seedlings, how to incubate them, and how to later evaluate disease symptoms. This is based on one of the first published protocols for infecting rice seedlings (Talbot et al., 1993[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0035]; Valent & Chumley, 1991[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-bib-0038]).\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nMaterials\n70% (v/v) ethanol (in water) for decontaminating materials and equipment\n7- to 10-day-old M. oryzae fungal culture grown on CM agar medium (Basic Protocol 2[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0002] or Alternate Protocol 1[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0003])\n0.1% (w/v) gelatin\n3-week-old blast-susceptible rice (Oryza sativa) cultivar (such as CO-39, Kitaake, or Nipponbare) grown in 9-cm plastic pots/trays\nCirculating Class II flow hood (BSC Class II or equivalent)\nBunsen burner (e.g., Fisher Scientific cat. no. 03391301)\nL-shaped cell spreaders (e.g., Fisherbrand™ cat. no. 15615467)\n50-ml conical Falcon tubes (e.g., Fisher Scientific cat. no. 10788561)\nFilter cloth or polypropylene membrane (e.g., Sigma cat. no. Z104256)\nFilter tips, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000055 and EP3123000063)\n1.5-ml microcentrifuge tubes (e.g., Eppendorf ® Microtube capacity 1.5 ml, cat. no. EP0030125150)\nSingle-channel micropipets, volume 20-200 μl and volume 100-1000 μl (e.g., Eppendorf cat. nos. EP3123000241 and EP3123000250)\nMicrotube centrifuge (e.g., Fisher Scientific cat. no. 75002435)\nHemocytometer (e.g., Sigma cat. no. Z359629-1EA)\nBiological microscope (e.g., Fisherbrand™ cat. no. 15374398)\n120-mm square plastic petri dish (e.g., Scientific Laboratory Supplies cat. no. PET3008)\nMini airbrush sprayer (e.g., Badger USA)\nPolyethylene plastic transparent bags, ∼229 mm × 305 mm (e.g., Polybags)",
    "Controlled-environment chamber (e.g., Memmert™ cat. no. 15607578), set to 24°C with a 12-hr photoperiod and 85% relative humidity\nWhatman filter paper (e.g., Fisherbrand™ cat. no. 09800)\n1. Follow steps 1-6 of Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0006] to obtain conidial suspension adjusted to 5 × 104 conidia/ml in 0.1% (w/v) gelatin.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Calculate 5 ml of conidial suspension to be sprayed over each rice plant.\n2. Using an airbrush, spray-inoculate ∼5 ml of conidial suspension onto 3-week-old blast-susceptible rice (Oryza sativa) cultivar CO-39 plants, and cover plants with polyethylene bags (see Fig. 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0004]).\nPerform spraying in controlled conditions, preventing any sort of leakage.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/4ff52c54-24b4-41cf-beef-c1ee17994d4c/cpz1523-fig-0004-m.jpg</p>\nFigure 4\nSchematic representation of M. oryzae spray-inoculation protocol. Conidial suspensions are evenly sprayed onto 3-week-old rice (CO-39) seedlings using an artist's airbrush. Plants are then incubated for 6 days (2 days covered with polyethylene bag and 4 days uncovered) in a controlled chamber set at 24°C with a 12-hr photoperiod and 85% relative humidity. At right, an example of CO-39-infected leaf tip infected with M. oryzae Guy11 spores 6 days after spray inoculation. Figure created with BioRender.com.\n3. In a controlled-environment chamber at 24°C with a 12-hr photoperiod and 85% relative humidity, incubate rice plants for 48 hr covered with the plastic bag and then for 4 more days uncovered.\n4. After incubation, randomly collect infected leaf tips (∼5 cm) and attach them to Whatman paper using adhesive tape at each end to secure to the surface.\n5. Assess leaf infection density by calculating the mean number of disease lesions from a ∼2-cm infected area of leaf. Significant differences between leaf infection density are later calculated by performing statistical comparisons.",
    "Counting of the lesions should be performed in 1.5-3 cm of the most densely infected area. Lesions usually look like dark brown dots with lighter surrounding margins. Counting is typically performed manually, although methods for automated assessment of leaf infection using image analysis are under development.",
    "To rapidly evaluate the virulence of M. oryzae strains, leaf-drop inoculation is routinely used. This provides a qualitative evaluation of the ability to cause blast disease, but this can be made quantitative by measuring fungal biomass using a DNA-based assay. Using this protocol, non-pathogenic strains of M. oryzae can be easily differentiated from pathogenic isolates.\nCAUTION: Magnaporthe oryzae is a Biosafety Level 1 pathogen; follow all appropriate guidelines and regulations for the use and handling of pathogenic microorganisms.\nAdditional Materials (also see Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0006])\n0.2% (w/v) gelatin\n3-week-old blast-susceptible rice (Oryza sativa) cultivar (CO-39) or 1-week-old barley cultivar (Golden Promise)\n4% (w/v) distilled water agar plated in 9-cm petri dishes\nIncubator (e.g., Fisher Scientific cat. no. 15500214), set at 24°C with a 12-hr photoperiod\n120-mm square petri dishes (e.g., Scientific Laboratory Supplies cat. no. PET3008)\nWhatman filter paper (e.g., Fisherbrand™ cat. no. 09800)\n1. Follow steps 1-6 of Basic Protocol 4[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-prot-0006] to obtain conidial suspension adjusted to 5 × 104 conidia/ml, and add 0.2% (v/v) gelatin.\nWork should be performed in a circulating Class II flow hood near a Bunsen burner. Calculate ∼50 μl of conidial suspension to be used, for 10- to 15-μl droplets inoculated on three or four different leaves.\n2. Cut three or four 5-cm same-age leaf tips (either 3-week-old CO-39 or 1-week-old barley Golden Promise) and place on a square petri dish containing 4% water agar as shown in Figure 5[href=https://currentprotocols.onlinelibrary.wiley.com/doi/10.1002/cpz1.523#cpz1523-fig-0005].\nGolden Promise leaf tips are wider, making this experiment easier when using barley leaves than when using rice leaves, because the conidial suspension droplet does not slide off the leaf (due to surface hydrophobicity) as easily.\n<p>imgsrc:https://currentprotocols.onlinelibrary.wiley.com/cms/asset/cd41809d-91e1-4cc1-9e23-e734ec9e45fb/cpz1523-fig-0005-m.jpg</p>\nFigure 5",
    "M. oryzae leaf-drop plant infection assay using 1-week-old barley (cultivar Golden Promise). Left, Schematic representation. Right, barley leaf fragments (∼4 cm) inoculated with 30-μl droplets of Guy11 conidial suspension (5 × 104 conidia/ml) and incubated at 24°C with a 12-hr photoperiod, before and 5 days after inoculation. Figure created with BioRender (biorender.com).\n3. Inoculate 10- to 15-μl droplets of conidial suspension from each sample on each leaf.\nMake sure to use several leaf tips and several points for inoculation of the same sample to achieve robust and replicated results.\n4. Incubate leaf tips 5 days at 24°C with a 12-hr photoperiod.\nSusceptible infections can be visualized earlier than 5 days, but it is advisable to leave for sufficient time to avoid false negative results.\n5. After incubation, collect leaf tips and mount on Whatman paper to visually assess blast symptoms.\nUsually leaf-drop infection experiments are used to evaluate resistant or non-resistant plants or virulent or non-virulent mutants of the fungus. However, lesions can be harvested and transferred to a 2-ml tube with 300 μl of distilled water, spores recovered through mixing with a vortex, and the conidial concentration quantified using a hemocytometer."
  ],
  "subjectAreas": [
    "Microbiology"
  ],
  "bigAreas": [
    "Molecular Biology & Genetics"
  ]
}