{
  "id": 10410,
  "origin_website": "Jove",
  "title": "A Microfluidic Platform for Stimulating Chondrocytes with Dynamic Compression",
  "procedures": [
    "NOTE: Wear personal protective equipment (PPE) such as gloves and lab coat for every step in this protocol.\n1. Master mold fabrication\nNOTE: Perform step 1.1 - 1.3 in a fume hood.\nGlass treatment\n\tNOTE: Wear a face shield, gloves, and a lab coat for step 1.1.\n\t\nMake Piranha solution (60 mL) by mixing sulfuric acid (H2SO4) and hydrogen peroxide (H2O2) with a volume ratio of 3:1.\n\t\tCAUTION: Do not use Piranha solution and acetone in the same fume hood due to the explosion hazard.\nPlace a glass plate (50.8 mm × 76.2 mm × 1.2 mm) in Piranha solution for 30 min at 40 °C.\nRinse the glass plate with deionized water (diH2O).\nPlace the glass plate in acetone at room temperature for 10 min.\nRinse the glass plate with isopropanol and dry it with nitrogen (N2) gas.\nBake the glass plate at 200 °C for 20 min on a hot plate. All subsequent baking steps use a hot plate.\nSU-8 seed layer formation on the glass plate\n\t\nSpread SU-8 5 on the glass plate with a disposable pipette to cover around 2/3 of the plate’s surface area.\nSpin the glass plate with SU-8 5 photoresists at 500 rpm for 35 s (initial spinning cycle) and then 2,500 rpm for 40 s (final spinning cycle) using a spin coater. All subsequent spin coating steps include the same initial spinning cycle.\nBake the SU-8 5 coated glass plate at 65 °C for 2 min and then at 95 °C for 5 min.\nExpose the SU-8 5 coated glass plate to UV light (60 mW/cm2, distance between UV lamp and photomask is 20 cm, total amount of UV light energy = 60 mJ/cm2) for 1 s.",
    "NOTE: The UV exposure time should be adjusted according to the power of a used UV light.\nBake the SU-8 5 coated glass plate at 65 °C for 2 min and at 95 °C for 5 min.\nPlace the baked glass plate in the SU-8 developer for 2 min.\nBake the SU-8 5 coated glass at 180 °C for 20 min.\nSU-8 channel pattern fabrication using photolithography (Figure 2a Step 1-3)\n\t\nPour SU-8 100 on the SU-8 5 seeded glass plate to cover around 2/3 of the plate’s surface area.\nSpin the glass plate with SU-8 100 at 3,000 rpm for 38 s (≈ 90 μm thick).\nBake the SU-8 100 coated glass plate at 65 °C for 10 min and then at 95 °C for 30 min. If SU-8 100 is still sticky after this procedure, bake the glass plate for a longer time at 95 °C until SU-8 100 becomes non-sticky.\nPlace a high-resolution microchannel photomask (25,400 dpi, see Supplementary Figure 1) on the SU-8 100 coated glass plate and expose the photomask covered glass plate to UV light for 4 s (total amount of UV light energy = 240 mJ/cm2).\n\t\tNOTE: The UV exposure time should be adjusted according to the power of a used UV light.\nRemove the photomask from the glass plate and bake the glass plate at 65 °C for 2 min and then 95 °C for 20 min.\nKeep the baked glass plate in a container, which is wrapped with aluminum foil to block any light, for overnight curing.\nDevelop SU-8 100 channel patterns on the glass plate in the SU-8 developer for 15 min.",
    "Wash the SU-8 patterned glass plate (master mold) with isopropyl alcohol and dry it with N2 gas. If white particles remain during this process, repeat step 7 for 5 min.\n2. Pneumatic actuation unit\nMicrochannel layer (Layer 1)\n\tNOTE: Perform step 2.1.1 - 2.1.2 in a fume hood.\n\t\nDrop 200 μL of (Tridecafluoro-1,1,2,2-Tetrahydrooctyl)-1-Trichlorosilane on a coverslip and place it in a vacuum chamber with the master mold.\nApply vacuum for 2 min in the chamber and wait for 6 h (or overnight) for silanization of the mold.\nMix PDMS with a weight ratio of 10:1 (prepolymer:curing agent) for 5 min.\n\t\tNOTE: All subsequent PDMS casting step contains the same prepolymer and curing agent weight ratio (10:1).\nPour PDMS on the master mold and degas PDMS in a vacuum chamber for 30 min.\nSandwich PDMS with a piece of transparency film.\nClamp the above sandwiched assembly with a glass plate, foam pads and plexiglass plates (Figure 2a Step 4).\nCure PDMS in an oven at 80 °C for 6 h.\nIsolate the PDMS layer (Layer 1) with the transparency film from the sandwiched structure (Figure 2a Step 5).\nActivate surfaces of Layer 1 and a clean glass plate (Glass plate 1; 50.8 mm × 76.2 mm × 1.2 mm) using a plasma cleaner for 1 min.\n\t\tNOTE: Plasma cleaning time may vary based on the power of a used plasma cleaner.\nBond Layer 1 onto Glass plate 1 and place them in the oven at 80 °C for 30 min.\nRemove the transparency film from Layer 1.\nThin PDMS membrane (Layer 2)\n\t\nSpin coat uncured PDMS on a transparency film at 1,000 rpm for 1 min to obtain a 60 μm thick PDMS layer.\nPartially cure spin coated PDMS (Layer 2) in the oven at 80 °C for 20-30 min.",
    "Activate Layer 1 on Glass plate 1 and Layer 2 using the plasma cleaner for 1 min.\n\t\tNOTE: Plasma cleaning time may vary based on the power of a used plasma cleaner.\nBond the Layer 2 onto Layer 1 and place them in the oven at 80 °C overnight.\nTubing block\n\t\nPlace metal tubes vertically on a petri dish.\nGently pour PDMS in the dish to submerge about 3/4 of the metal tubes.\nCure PDMS in the oven at 60 °C for 6 h (or overnight).\nCut a piece of PDMS block containing one metal tube.\nPunch a hole on Layer 2 for the inlet.\nActivate the PDMS block and Layer 2 using the plasma cleaner for 1 min.\nAttach the PDMS block onto the inlet part of Layer 2 and place the entire actuation unit in the oven at 80 °C for overnight.\n3. Alginate-chondrocyte (or bead) constructs\nAmino-silanized glass plate\n\t\nCut a glass plate (50.8 mm × 76.2 mm × 1.2 mm) into two half-sized glass plates (50.8 mm × 38.1 mm × 1.2 mm) using a diamond scriber.\nPlace the glass plates in 0.2 M hydrogen chloride (HCl) and gently shake (e.g., 55 rpm) them overnight.\nRinse the glass plates with diH2O.\nShake the glass plates in 0.1 M sodium hydroxide (NaOH) for 1 h at 55 rpm and rinse them with diH2O.\nShake the glass plates in 1% (v/v) 3-aminopropyltrimethoxysilane (APTES) for 1 h at 55 rpm and rinse them with diH2O.\nDry the amino-silanized glass plates in a fume hood overnight.\nAgarose gel mold for alginate gel constructs\n\t\nMix 5% (w/v) agarose and 200 mM calcium chloride (CaCl2) in diH2O.",
    "Boil the agarose gel solution with a microwave oven (or a hot plate). Boiling time varies based on the volume of the agarose gel solution and the power of the microwave oven (or the temperature of the hot plate).\nPour the boiled agarose gel solution onto an aluminum mold (see Supplementary Figure S2), and sandwich it with a glass plate.\nWait for 5 min and unmold the solidified agarose gel from the aluminum mold.\nGrowth plate chondrocyte harvest\n\t\nIsolate growth plates from the hind limbs of neonatal mice.\nPlace the growth plates in 1 mL of 0.25% collagenase for 3 h in an incubator at 37 °C and 8% carbon dioxide (CO2), to remove extracellular matrix (ECM).\nCentrifuge the digested sample for 5 min at 125 x g to make a chondrocyte pellet and remove supernatant from the sample. Here, 1 x g is the acceleration of gravity.\nResuspend the chondrocyte pellet in 1 mL of Dulbecco's modified Eagle's medium (DMEM).\nCount the number of chondrocytes in DMEM using a cell counter.\nCentrifuge the chondrocytes in DMEM for 5 min at 125 x g to make a chondrocyte pellet again and remove supernatant from the sample.\nOptionally, resuspend the chondrocyte pellet in the chondrocyte culture media (CCM)34 containing 2 μM calcein AM, and incubate the sample at 37 °C for 30 min. Repeat step 3.3.6 and move to step 3.3.8.\nResuspend the chondrocyte pellet in a desired volume of CCM and keep them in the incubator at 37 °C and 8% CO2 before use.\nAlginate-chondrocyte (or bead) constructs (Figure 2c)\n\t\nMix 1.5% (w/v) alginate in phosphate-buffered saline (PBS) with 5 mg/mL of sulfo-NHS, 10 mg/mL of 1-ethyl-3-(3-dimethylaminopropyl) carbodiimide hydrochloride (EDC).",
    "Add 8 x 106 chondrocytes into the 1 mL of alginate gel solution [or Add 3 μL of 1 μm-diameter fluorescent beads (542/612 nm) in 1 mL of alginate gel solution (0.3% (v/v))].\nPlace 150 μL of the alginate-chondrocyte (or bead) solution on the amino-silanized glass plate fabricated in Step 3.1.\nCover the alginate gel solution with the agarose gel mold for 3 min.\nRemove excessive alginate gel solution overflowing from the agarose gel mold with a razor blade and remove the agarose gel mold. Then, cylindrical alginate-chondrocyte (or bead) constructs are obtained on the amino-silanized glass plate.\nPlace the alginate-chondrocyte constructs in cross-linking solution (50 mM CaCl2 / 140 mM NaCl in diH2O) for 1 min for further polymerization.\n4. Device assembly (Figure 2d)\nNOTE: PDMS spacers and 3D printed clamps need to be prepared separately.\nLocate four 1 mm thick PDMS spacers on the four corners of the Layer 2 of the actuation unit.\nPlace 700 μL of CCM to cover the air chambers of Layer 2.\nPlace the alginate-chondrocyte (or bead) constructs on Layer 2 while carefully aligning the constructs with the air chambers.\nClamp the device with 3D printed clamps (Figure 1c).\n5. Actuation of the device\nConnect the outlet of an air pump (see Table of Materials) with the inlet of a solenoid valve with a silicon tubing.\nConnect the outlet of the solenoid valve with the inlet of the assembled device with a silicon tubing.\nConnect the solenoid valve with a function generator.\nManipulate the solenoid valve with a square wave (e.g., 1 Hz) generated by the function generator.\nTurn on the air pump to actuate the device pneumatically.\n6. Imaging of chondrocytes in the device",
    "NOTE: To obtain a good image quality, image chondrocytes (or fluorescent beads) in alginate gel through Glass plate 2 because expanded PDMS balloons and air chambers can distort optical images. If an inverted microscope is used for imaging, the device needs to be setup so that Glass plate 2 faces downward.\nPrepare the device with chondrocytes (or fluorescent beads) as shown in previous sections.\nTake z-stack images of chondrocytes (or fluorescent beads) with a confocal microscope before and under compression, respectively. Choose a z-step size based on the depth of field of a used confocal imaging system.\nThe height of chondrocytes (or an alginate-bead construct) can be measured with automatic image processing method shown in previous literatures26,35.\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}