{
  "id": 8451,
  "origin_website": "Jove",
  "title": "An Improved Protocol to Purify and Directly Mono-Biotinylate Recombinant BDNF in a Tube for Cellular Trafficking Studies in Neurons",
  "procedures": [
    "All experiments were carried out in accordance with the approved guidelines of CONICYT (Chilean National Commission for Scientific and Technological Research). The protocols used in this study were approved by the Biosecurity and Bioethical and Animal Welfare Committees of the Pontificia Universidad Católica de Chile. Experiments involving vertebrates were approved by the Bioethical and Animal Welfare Committee of the Pontificia Universidad Católica de Chile.\nNOTE: The following protocol was designed to purify BDNFAvi from a total volume of 500 mL of conditioned medium produced in HEK293 cells. The amount of conditioned medium that is produced and processed to purify BDNFAvi can be up or downscaled as needed. However, further optimization may be necessary under these circumstances. The composition of the culture media and buffers used throughout the protocol can be found in supplementary materials. \n1. Production and purification of BDNFAvi from HEK293-conditioned media\nTransfection of HEK293 cells\n\t\nGrow HEK293 cells to 70% confluence in supplemented DMEM medium (10% bovine fetal serum, 1x glutamate supplement, 1x antibiotic/antimycotic) in 15 cm culture dishes at 37 ºC.\nChange the medium to transfection buffer.\nPrepare the PEI-DNA mixture for transfection. Use two different 15 mL conical tubes to dilute DNA and PEI 25 K, respectively. Dilute 20 μg of plasmid DNA in a final volume of 500 μL in one tube. Dilute 60 μg of linear PEI 25K in a final volume of 500 μL in the other tube. Incubate at room temperature for 5 min. \nCarefully pipette the DNA solution into the PEI tube, mixing once by up-down motion. Incubate at room temperature for 25 min. \nDrip 1 mL of the PEI-DNA mixture throughout each 15 cm dish. Incubate the cells with the PEI-DNA mixture for 3 h at 37 ºC.\nChange the medium to fresh incubation buffer. \nMedia collection and storage",
    "Collect the medium from all the dishes 48 h after the transfection of HEK293 cells. Prepare concentrated stocks of the solutions described in the “supernatant modification buffer” section of Supplemental File 1 and add them to the HEK293 supernatant to achieve the listed final concentrations.\n\t\tNOTE: Cells can be discarded or recovered for further analysis.\nIncubate the medium in ice for 15 min. \nAliquot the medium into centrifuge tubes.\nCentrifuge the medium at 10,000 x g for 45 min in a 4 °C centrifuge. This step allows the elimination of cell debris and dead cells suspended in the media. \nCollect the supernatants, add BSA at a final concentration of 0.1%. and then store at -20 °C. The media can be aliquoted before freezing for faster thawing during the purification step.\n\t\tNOTE: Storage times of frozen conditioned media of up to 2 months have yielded positive results, longer storage times have not been evaluated.\nMedia concentration and purification \n\t\nThaw the media in a 37 °C thermoregulated bath.\nAliquot the media into centrifuge tubes. \nCentrifuge the medium for 1 h at 3,500 x g in a 4 °C cooled centrifuge. This step allows the elimination of remaining cell debris to ensure adequate flow through the chromatography column.\nUse the protein concentrators with a 10 kDa cutoff to reduce the media from 500 mL to 100 mL. Follow the manufacturer’s recommended centrifugation parameters for optimal concentration.\nAdd 500 μL of Ni-NTA agarose beads to the concentrated media and incubate overnight at 4 °C in a rocker. \nAssemble the chromatography apparatus and pour the media into it. Let it rest for 5 min and then open the 2-way stopcock to let the medium flow through.",
    "Wash the beads with 5 mL of wash buffer for 5 min. Make sure to resuspend the beads in the column. Drain the wash buffer by opening the 2-way stopcock. Repeat 3 times.\nAdd 1 mL of elution buffer to the column. Make sure to resuspend the beads in the column. Incubate for 15 min, and then collect the eluate in a 1.5 mL microcentrifuge tube. Repeat this step 3 times for complete elution of BDNFAvi.\nLoad 5 μL of each eluate and different concentrations of commercially available BDNF (40-160 ng) in a 15% polyacrylamide gel. Detect the purified protein by western blotting using an anti-BDNF antibody. \nDetermine the concentration of the purified BDNFAvi in each eluate using the concentration curve prepared with the commercially available BDNF.\nAliquot and store the purified BDNFAvi at -80 °C.\n2. In vitro mono-biotinylation of BDNFAvi using the BirA enzyme\nIn vitro mono-biotinylation reaction \n\t\nPrepare concentrated stock solutions of the biotinylation buffer reagents. The use of concentrated stocks will minimize the dilution of the recombinant protein. \nTake an aliquot of 800 ng of BDNFAvi and add the biotinylation buffer reagents and the enzyme BirA in a 1:1 molar relation to BDNF. For example, for a 200 μL final reaction volume add; 100 μL of solution containing 800 ng of BDNFAvi, 20 μL Bicine 0.5 M pH 8.3, 20 μL ATP 100 mM, 20 μL MgOAc 100 mM, 20 μL d-biotin 500 μM, 0.8-1 μg to 1 μL of BirA-GST, and complete to 200 μL with ultrapure water. \n\t\tNOTE: Successful biotinylation reactions have been performed with aliquots of 400 μL containing a concentration of about 30 ng/ μL BDNFAvi, resulting in a homogeneously biotinylated BDNFAvi to a final concentration of ~20 ng/ μL in the final reaction.",
    "Incubate the mixture at 30 °C in a hybridization oven for 1 h. Mix the content by tube inversion every 15 min. \nAdd the same volume of ATP and BirA as in step 2.1.2 and repeat step 2.1.3. \nStore at -80 °C for future analyses or keep on ice for immediate use (e.g., biotinylation quality control).\nBiotinylation analysis\n\t\nBlock 30 μL of streptavidin magnetic beads per BDNF sample in 1 mL of blocking buffer. Incubate at room temperature for 1 h in a microcentrifuge tube rotator. \nPrecipitate the magnetic beads using a magnetic separation rack for 3 to 5 minutes or until the buffer appears completely cleared of the beads  and discard the blocking buffer.\nAdd 50 μL of fresh blocking buffer and 80 ng of mono-biotinylated BDNFAvi (mbtBDNF) sample to the beads, making sure to resuspend them completely by pippeting.\nIncubate at 4 °C for 1 h in a microcentrifuge tube rotator  spinning at approximately 20 RPM. \nCollect the beads using the magnetic separation rack for 3 to 5 minutes, and collect the supernatant, keeping a 30 μL aliquot for analysis.\nWash the beads one time with 500 μL of PBS, and then collect them using the magnetic separation rack for 3 to 5 minutes. Recover the supernatant and keep a 30 μL aliquot for analysis. \nAdd 10 μL of 4x loading buffer to the beads.\nHeat the samples to 97 °C for 7 min to elute the mbtBDNF. \nDetect mbtBDNF using an anti-BDNF specific antibody19.\n3. Verification of mbtBDNF biological activity\nDetection of pTrkB and pERK by western blot.\n\t\nSeed 2 million rat cortical neurons in 60 mm culture dishes. \nCulture the neurons for 7 days (DIV7). Then, change the medium to non-supplemented neurobasal mediun when starting the experiment.",
    "One hour after medium change, add mbtBDNF to a final concentration of 50 ng/mL. Incubate for 30 min at 37 ºC. Keep a negative control dish (non-stimulated with BDNF) and a positive control dish (treated with 50 ng/mL of commercially available BDNF).\nCollect the medium and gently wash every dish with 1x PBS. Collect and discard the 1x PBS.\nPlace the dishes on ice and add 50-80 μL of lysis buffer to each dish. Use a cell scraper to lyse the cells. \n\t\tNOTE: The lysis step should be performed as quickly as possible to avoid protein dephosphorylation and degradation. 1-2 minutes of vigorous scraping are enough to visualize the proteins of interest by western blotting. \nCollect the lysis buffer and stir in a vortex mixer at highest speed for 5 s.\nCentrifuge the lysis buffer at 14,000 x g (4 °C) for 10 min. Collect the supernatant.\nQuantify the protein content of the supernatant  by BCA protein quantification protocol20.\nAdd loading buffer to an aliquot containing 30-50 μg of protein per condition and load it in a 12% polyacrylamide gel for western blotting. Detect pTrkB and pERK using specific phospho-antibodies to verify BDNFAvi biological activity.\nVerification of BDNF-QD biological activity by pCREB immunofluorescence.\n\t\nSeed 40,000 rat cortical neurons in 10 mm coverslips, previously autoclaved and treated with poly-L-lysine as described previously21.\nCulture the neurons for 7-8 days in neuronal maintenance buffer (see supplemental materials) at 37 ºC. \nTo start the experiment, change the medium to unsupplemented neurobasal medium and incubate at 37 ºC for 1 h.",
    "Prepare mbtBDNF conjugated to quantum dots (BDNF-QD) by adding to a mbtBDNF aliquot, the necessary volume of quantum dot streptavidin conjugate (streptavidin-QD) to achieve a 1:1 BDNF-QD molar ratio. Then, dilute to 20 μL with neurobasal medium. Wrap the tube in aluminum foil to protect it from the light. \n\t\tNOTE: Prepare another tube with the same volume of quantum dot streptavidin conjugate and dilute it to 20 μL with neurobasal medium as a negative control.\nIncubate the mbtBDNF/ streptavidin-QD mixture for 30 min at room temperature in a rocker. \nDilute the BDNF-QD to the desired final concentration (200 pM and 2 nM) in neurobasal medium.\nAfter 1 h of incubation with non-supplemented neurobasal medium, stimulate the neurons with BDNF-QD or streptavidin-QD (control) to a final concentration of 200 pM and 2 nM of BDNF for 30 min at 37 °C. \nWash the coverslips 3 times with 1x PBS (37 °C) and fix the cells for 15 min by treating the coverslip with 4% paraformaldehyde solution containing phosphatase inhibitors.\nWash the cells 3 times with PBS, and then incubate with blocking/permeabilization buffer (BSA 5%, Triton X-100 0.5%, 1x phosphatase inhibitor) for 1 h.\nIncubate with anti-pCREB antibody 1:500 (in 3% BSA, 0.1% Triton X-100) overnight at 4 °C. \nThe following day, wash 3 times with 1x PBS, and incubate for 1 h with the secondary antibody 1:500 (3% BSA, 0.1% Triton X-100). \nWash 3 times with 1x PBS. Add Hoechst nuclear stain solution (5 μg/mL) for 7 min. \nWash 3 times with 1x PBS and mount.\nVisualization of retrograde axonal transport of BDNF-QD in live neurons\n\t\nPrepare microfluidic chambers and seed neurons as described previously16.\nAfter 7-8 days in culture, change the medium to non-supplemented neurobasal medium.",
    "Prepare mbtBDNF conjugated to quantum dots (BDNF-QD) by adding to a mbtBDNF aliquot, the necessary volume of quantum dot streptavidin conjugate (streptavidin-QD) to achieve a 1:1 BDNF-QD molar ratio. Then, dilute to 20 μL with neurobasal medium. Wrap the tube in aluminum foil to protect it from the light. \n\t\tNOTE: Prepare another tube with the same volume of quantum dot streptavidin conjugate and dilute it to 20 μL with neurobasal medium as a control.\nIncubate the mbtBDNF/ streptavidin-QD mixture for 30 min at room temperature in a rocker. \nDilute the BDNF-QD to the desired final concentration (2 nM).\nAfter 1 h of incubation with non-supplemented neurobasal medium add the BDNF-QD or the control mixture to the axonal compartments of the microfluidic chamber. Incubate for 210 min at 37 ˚C to ensure a net retrograde transport of BDNF-QD.\nFor live-cell imaging, visualize axonal retrograde transport in the segment of the microgrooves that is proximal to the cell body compartment using a 100x objective using a microscope suitable for these purpose (37 °C and 5% CO2). Acquire images at 1 frame/s. \nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Neuroscience"
  ],
  "bigAreas": [
    "Biomedical & Clinical Research"
  ]
}