{
  "id": 10509,
  "origin_website": "Jove",
  "title": "Gene Expression Analysis of Endothelial Cells Exposed to Shear Stress Using Multiple Parallel-plate Flow Chambers",
  "procedures": [
    "1. Preparation of Exogenous Reference RNA\nNOTE: Choose an exogenous reference RNA that does not exist in the species or model of interest. For mammalian systems, firefly luciferase RNA may be used.\nLinearization of exogenous reference RNA plasmid\nPrepare exogenous reference RNA at least 48 h prior to the anticipated RNA extraction. Obtain or manufacture a cDNA clone of the chosen exogenous reference RNA, such as a firefly luciferase cDNA clone in a plasmid vector appropriate for in vitro transcription (see Table of Materials).\nPerform restriction enzyme (RE) digestion of 1 µg of full-length plasmid (the firefly luciferase plasmid is pSP-luc+ which has 4100 bp) using single-cutter RE (XhoI) in 1.5-mL microfuge tubes. Choose an RE that is a single cutter (cuts plasmid only 1x) at the 3’ end of the exogenous reference RNA sequence that leaves a 5’ overhang or blunt end. For a typical preparation, perform seven plasmid linearization reactions (steps 1.1.4 - 1.1.7) in parallel to generate sufficient RNA concentration and quantity to complete one set of experiments or one project.\n\t\t\nMeasure the plasmid concentration using spectrophotometry or spectrofluorometry.\nPrepare an RE mixture in each tube: add 4 µL of XhoI (20,000 units/mL), 8 µL of RE buffer, x µL of plasmid (1 µg), and sufficient H2O to reach a total solution of 80 µL.\nIncubate the RE mixture for 2 h at 37 °C. Use the RE according to the manufacturer’s protocol, as any modifications can result in increased star activity or non-specific cleavage of target DNA. Heat inactivate the reaction mixture for 20 min at 65 °C.",
    "Terminate the RE digest with ethanol precipitation in each tube. To the RE mix, directly add 4 µL of 0.5 M EDTA pH 8.0, 8 µL of 3 M sodium acetate pH 5.2, and 184 µL of 100% ethanol. Mix well and freeze the mixture at -20 °C for 30 min.\nSpin down the mixture at 4 °C for 20 min at a relative centrifugal force (RCF) of 16,100 x g.\nRemove the supernatant with a fine tip, without touching the pellet. Air-dry the pellet for 5 min and resuspend it in 6 µL of H2O (warmed to 37 °C) by pipetting up and down 5x - 10x.\nConfirm the linearization of luciferase plasmid by running the digested product on 2% agarose gel containing ethidium bromide (EtBr) along with a 1 kb+ ladder, a supercoiled ladder, and cut and uncut plasmid. Inspect the gel and proceed to the in vitro transcription if the lane for the cut plasmid shows a single band at ~4 kb (the uncut plasmid will have three bands; Figure 1).\n\t\t\tCAUTION: EtBr is carcinogenic. Work in a chemical fume hood.\nIn vitro transcription of exogenous reference RNA plasmid\nFor each tube of digested plasmid products, perform in vitro transcription using an in vitro transcription method (see Table of Materials). Follow the manufacturer’s instructions and use the appropriate phage RNA polymerase. If the method of cDNA synthesis requires a poly(A) tail, or other applications require a poly(A) tail, choose a method of in vitro transcription that includes a poly(A) tail addition (see Table of Materials).\nCombine all in vitro transcribed products into a single 1.5-mL polypropylene tube prior to purification.\nPurification of RNA from the in vitro transcription reaction",
    "Purify in vitro transcribed products with an in vitro transcription clean-up kit (see Table of Materials). Please follow the manufacturer’s protocol.\nAssess the RNA concentration by measuring absorbance at 260 nm using spectrophotometry.\n\t\tNOTE: RNA concentration is calculated using the Beer-Lambert law. This states that the absorbance of nucleic acids (which absorb light strongly at 260 nm) is proportional to the concentration. An absorbance of 1.0 is equal to 40 µg/mL of single-stranded RNA.\nAliquoting the stock RNA into PCR tubes for experimental use\nEnsure the RNA concentration is 1 µg/µL.\n\t\t\nIf the RNA concentration is > 1 µg/µL, dilute the stock to 1 µg/µL. Aliquot 1 µL into PCR tubes and store them at -80 °C.\nIf the RNA concentration is < 1 µg/µL, additional precipitation using 5 M ammonium acetate (provided in kit) can be performed as per the manufacturer’s protocol. If the RNA concentration is still < 1 µg/µL, proceed with aliquoting 1 µL into PCR tubes.\n2. Slide Coating\nNOTE: Steps 2.1 - 2.10 should be performed 24 - 48 h prior to the anticipated cell seeding.\nPreheat the oven to 250 °C.\nUsing sterile gloves, wrap each glass slide 2x with aluminum foil. Avoid touching the surface of the slide directly.\nBake the slides in the oven for 1 h at 250 °C and allow the slides to cool to room temperature.\n\tNOTE: This step is important for destroying any contaminating endotoxin.\nWhile the slides are cooling, make a fibronectin stock solution of 1 mg/mL with distilled water and incubate it for 30 min at 37 °C to dissolve. Make 100-µL aliquots. Set aside the aliquots for immediate use and freeze the remaining aliquots for future use.",
    "Unwrap the outer covering of aluminum foil before putting the glass slide into a biosafety cabinet. Perform steps 2.6 - 2.7 and 2.9 in the biosafety cabinet.\nPlace the glass slide into a sterile rectangular 4-well cell culture dish.\nDilute fibronectin stock solution 1:100 with distilled water. Coat each slide with 1 mL of diluted fibronectin, drop by drop, using a pipette. Make sure the whole slide is covered.\nIncubate the slides in a tissue culture incubator at 37 °C for 24 - 48 h.\nAfter the incubation, aspirate the fibronectin by tilting the 4-well cell culture dish. Avoid touching the slide directly with the aspirator.\n3. Cell Seeding onto Glass Slides\nCount the human endothelial cells at early passage (passage 2 - 5) and seed ~1.0 x 106 cells onto each fibronectin-coated glass slide with 1 mL of media (1.0 x 106 cells/mL media). Seed the cells 24 h prior to the anticipated application of laminar flow if no other treatment is to be performed.\n\tNOTE: These numbers are used as a guide for experiments with 24 h of flow.\n\t\nAdjust the seeding density to achieve a confluent monolayer of cells at the time of cell harvesting and RNA extraction.\nLet the cells adhere to the slide for 15 min at 37 °C.\nAdd 3 mL of media in each well of the cell culture dish to cover the slide, and incubate the cells at 37 °C for 24 h with 5% CO2.\n4. Small Interfering RNA (siRNA) Transfection\nPreparation of cells on glass slides for siRNA transfection and flow experiments\nFollow the protocol in steps 2 (slide coating) and 3 (cell seeding onto glass slides) for glass slide preparation and coating for flow experiments.",
    "Seed cells 24 h prior to siRNA treatment (48 h prior to the application of laminar flow).\nSeed human endothelial cells in antibiotic-free media at 750,000 to 1 x 106 cells per slide to achieve 85% - 95% confluence the next day.\n\t\tNOTE: HUVEC are used in this protocol.\nPreparation of siRNA-lipid-based transfection reagent complexes (per slide)\nDesign custom siRNAs or order premade siRNAs for the desired gene of interest.\n\t\tNOTE: Perform the following steps in a biosafety cabinet.\nAdd 6 µL of siRNA (20 µM stock) in 414 µL of reduced serum medium (see Table of Materials) and mix gently by pipetting.\nDilute 49.5 µL of gently mixed lipid-based transfection reagent (see Table of Materials) in 130.5 µL of reduced serum medium.\nMix gently and incubate at room temperature for 5 min.\nCombine diluted siRNAs and lipid-based transfection reagent, mix gently, and incubate for 15 min at room temperature. Mix gently to avoid disruption of the lipid-based transfection reagent complexes.\n\t\tNOTE: The solution may appear cloudy as complexes form.\nWhile complexes are forming, remove the growth medium and wash the cells 1x with reduced serum medium.\nAdd 2.4 mL of reduced serum medium to each slide.\nAdd 600 µL of gently mixed siRNA-lipid-based transfection reagent complexes to each plate, and rock the plate back and forth to mix. Ensure the final concentration of siRNA is 40 nM. Ensure that the slide is completely covered.\nIncubate the cells at 37 °C for 4 h.\nAdd 1 mL of antibiotics-free endothelial cell growth media containing 3x the normal concentration of fetal bovine serum (FBS) without removing the transfection mixture.\nIncubate the cells at 37 °C until ready to use.\n5. Calculation of the Flow Rate Based on the Desired Shear Stress9",
    "Calculate the flow rate based on the desired shear stresses according to the following equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58478/58478eq1.jpg\n\tHere,\nQ is the flow rate in mL/min;\nτ is the desired shear stress in dynes/cm2 (1 Pa = 10 dynes/cm2);\nw is the width of the parallel-plate flow chamber in cm;\nh is the height of the parallel-plate flow chamber in cm;\nµ is the viscosity of the media in cP (g/cm·s).\n\tNOTE: Typical laminar shear stress experiments (non-pulsatile) in this workflow are conducted at τ = 1 Pa (10 dynes/cm2). µ can be measured using a viscometer such as a cone-and-plate viscometer and can vary depending on the contents of the media including the serum and additional dextran9.\nTo achieve a specific τ (shear stress), adjust the flow rate and/or viscosity. At higher flow rates, adherent cells may dissociate from the slide. Sample flow rates with typical flow chambers are shown in Table 1.\n6. Set-up of a Dedicated Environment for Monitoring System and Multiple Parallel-plate Flow Chambers (Figure 2)\nUse a large heated unit/incubator with multiple shelves, internal electricity access, and glass doors—referred to as the BEACH (Built-in Environment with Adjustable CO2 and Heat)—to house multiple flow chambers simultaneously for experiments that require both shear stress and direct comparison between two or more treatments or outputs (i.e., DNA, RNA, and protein).\n\tNOTE: The BEACH allows for frequent monitoring of the flow circuit, including the flow rate, without frequent disruption of the environment.\nEnsure adequate CO2 is available for the experiment and that the CO2 monitor is functional. Ensure the water tray is appropriately filled, such that there will be humidified air.\n7. Set-up of the Parallel-plate Flow Apparatus\nNOTE: For the manufacturing of parallel plates, please see Lane et al.9.",
    "Autoclave the flow chamber plates, reservoir, dampener, tubing, and Luers for each parallel-plate flow chamber set-up as indicated in Table 2.\nSet-up of the flow loop assembly (Figure 3).\nPlace sterile towels into the biological safety cabinet. Assemble the flow loop system, first without the parallel-plate flow chamber, in the biological safety cabinet.\nConnect the tubing assembly for the reservoir:\n\t\t\nInsert a #14 hard tube into one hole and two #14 soft tubes into the other two holes in the cap of the flow reservoir. Ensure that one of the soft tubes touches the bottom of the reservoir as outflow tubing.\nPlace a 1/16” male Luer at the end of the #14 hard tube and attach a sterile filter as an air vent.\nPlace a 1/16” female Luer at the end of the #14 soft inflow tube, coming from the reservoir, and attach a 4-way stopcock.\n\t\t\tNOTE: For gene expression analysis or other studies where perfusates need not be collected, 2-way stopcocks can be used instead of 4-way stopcocks in this protocol.\nPlace a 1/16” male Luer at the end of the #14 soft outflow tube, coming from the reservoir.\nConnect the reservoir outflow tubing to pump tubing: place a 1/16” female Luer at each end of a #13 hard tube (pump tubing). Connect the #14 soft outflow tube from the reservoir to the #13 hard tube by connecting 1/16” male and female Luers together.\nConnect the pump tubing with ‘dampener bridge’ tubing: place a 1/8” male Luer and a 1/8” female Luer at each end of a #16 soft tube. Connect the 1/16” female Luer of the #13 hard tube (at the outflow end of the pump tubing) with the 1/8” male Luer of the #16 soft tube.",
    "Assemble tubing for the flow dampener: place a 3/16” male Luer at one end of the #25 soft tubing and repeat this for the other side of the flow dampener. Attach the free ends of the #25 soft tubes to each side of the flow dampener.\nConnect the ‘dampener bridge’ tubing with tubing for the flow dampener: connect a #25 soft tube from the flow dampener with the #16 soft tube of the ‘dampener bridge’ using the 1/8” female Luer from the #16 ‘dampener bridge’ side and the already placed 3/16” male Luer from the #25 soft dampener tube side.\nAssemble ‘chamber bridge’ tubing:\n\t\t\nPlace a 1/8” female Luer and a 1/8” male Luer at each end of a #16 soft tube (‘chamber bridge’ tubing).\nConnect the 1/8” female Luer of the ‘chamber bridge’ with the 3/16” male Luer at the #25 soft tube from the free end of the flow dampener.\nAt the 1/8” male Luer (free end) of the ‘chamber bridge’ tubing, place a 4-way stopcock.\nConnect the 4-way stopcock from the ‘chamber bridge’ free end to the 4-way stopcock from the reservoir inflow soft tubing (from step 7.2.2.3). Close the stopcocks.\nAdd media to the reservoir and dampener. For the 48-h exposure to shear stress, add 35 mL of media to the reservoir and 25 mL to the dampener. Adjust the volume of the media based on the duration of the flow experiment and the number of cells seeded.\nBring the assembled flow loop system to the pump in the BEACH. Place the #13 hard tube (pump tubing) into the pump head and secure it. Open the stopcocks.",
    "Turn on the pump and slowly increase the pump speed. Let the media circulate through the loop system. Check for any leakage or blockage (e.g., pressure build-up). Ensure that the media is flowing back to the reservoir.\nSet-up of the flow chamber assembly\nPlace a 1/8” female Luer at one end of a #16 soft tube and attach a 4-way stopcock. Attach the free end of the tube to the right side of the top plate (inflow side).\nPlace a 1/8” male Luer at one end of a #16 soft tube and attach a 4-way stopcock. Attach the free end of the tube to the left side of the top plate (outflow side).\nPlace a 1/8” male Luer and a 1/8” female Luer at each end of a #16 soft tube (bubble trap tubing). Attach the tubing to bubble trap via the 1/8” male Luer. Attach a 4-way stopcock to the other end of the tubing via the 1/8” female Luer.\nUsing sterile tweezers, transfer the cell-seeded glass slide from the 4-well cell culture dish to the recess on the bottom plate. Ensure the cell-seeded side of the glass slide is facing up.\nUsing a 10-mL syringe, add 10 mL of warm media to the bottom plate within the red gasket line around the plate. Allow the media to flow through the slide and cover the cells. Avoid adding media directly onto the slide.\nGently place the top plate onto the bottom plate, aligning from one side to the other. Avoid the introduction of air bubbles. Screw the plates together tightly.",
    "Remove air bubbles from the bubble trap by opening the stopcock on the right side (inflow) of the plate and gently flushing 20 mL of warm media using a 30-mL syringe. Make sure the stopcock on the left side (outflow) of the plate is closed and that the media is flowing through the bubble trap stopcock (open). Discard the flushed media.\nClose the stopcock on the bubble trap and open the stopcock on the left side (outflow) of the chamber. Elevate the left side (outflow) of the chamber to a 45° angle and gently flush 20 mL of warm media using a 30-mL syringe from the right side (inflow) of the chamber to remove air bubbles from the chamber. Bubbles can be visualized through the window. Discard the flushed media.\nClose the stopcocks on both sides of the chamber and cap. Inspect the cells by microscopy.\nTransport the chamber to the BEACH with the previously assembled loop system.\nSlowly decrease the pump speed and pause the pump. Close the stopcocks on the flow loop system to prevent leakage.\nConnect the chamber and loop system together via stopcocks. Open all the stopcocks.\nSlowly increase the pump speed and examine the set-up for any leakage or blockage. Ensure the media circulates in one direction and returns to the reservoir.\nPlace the flow sensor on the ‘chamber bridge’ tubing located on the inflow side of the chamber. Make sure the sensor is oriented properly in the direction of flow.\nAdjust the pump speed to obtain the flow rate that was calculated previously, based on the desired shear stress.\n\t\tNOTE: The flow rate may vary depending on the height and width of each chamber, as well as the viscosity of the media.",
    "Turn on the CO2 tank to achieve 5% CO2 and place a water tray inside the BEACH.\n8. Harvesting of the Cells and Extraction of RNA from the Flow Chamber\nOnce the desired time-period of flow is complete, slowly turn down the peristaltic pump speed to 0 and turn off the power. Quickly close all the open stopcocks and remove the chamber and the attached tubing with a stopcock on each end.\nTake the chamber to a clean benchtop and gently unscrew all screws to remove the top plate. Using needle-nose tweezers, remove the glass slide from the bottom plate and place it into a 100 mm diameter tissue culture dish.\nWash the slide with 10 mL of cold phosphate-buffered saline (PBS) -/- and check the cells under a microscope to confirm cell adherence and alignment in the direction of flow.\nAspirate the PBS from the plate and transfer the slide to a clean 100 mm diameter dish. Add 350 µL of lysis buffer from the RNA extraction kit (see Table of Materials), containing 1/100 of beta-mercaptoethanol, to the slide.\n\tCAUTION: Add beta-mercaptoethanol in a chemical fume hood.\nScrape the cells off the slide using a polyethylene-bladed cell scraper. Tilt the tissue culture dish, enabling the liquid to pool at the bottom, and remove the glass slide with forceps. Pipette the cell lysate into a 1.5-mL tube and keep it on ice.\nDilute stock exogenous reference RNA (luciferase RNA) to 0.0025 ng/µL through serial dilution prior to adding it to the sample. For example, if the stock concentration is 1 µg/µL, a dilution of 1/400,000 is required to achieve 0.0025 ng/µL. Add 10 µL of diluted luciferase RNA to each sample of cell lysate for downstream RNA isolation and analysis.",
    "Proceed with the RNA extraction protocol as per the manufacturer’s instructions, or freeze the lysate at -80 °C until able to proceed with the extraction.\n9. Calculation of the Efficiency of the RNA Extraction and cDNA Synthesis\nNOTE: Calculate the luciferase efficiency after RT-qPCR by comparing the theoretical yield and the experimental yield.\nDetermine the theoretical yield for luciferase RNA.\n\t\nDetermine the total amount of luciferase copies added per sample. (Adding 0.025 ng/sample = 2.73 x 107 copies of luciferase RNA per sample prior to RNA extraction.)\nCalculate the molecular mass of the luciferase RNA by using an average molecular mass per nucleotide of 330 g/mol and multiplying it by the length of the firefly luciferase RNA, 1652 nucleotides.\nDivide the amount of luciferase RNA added (0.025 ng) for each sample prior to RNA extraction by the molecular mass to yield the molar quantity. Then, multiply that by Avogadro’s number to yield the copies added per sample.\nCalculate the theoretical yield for the luciferase copies for each RT-qPCR reaction by using the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58478/58478eq2.jpg\nCalculate the experimental yield for the luciferase copies for each RT-qPCR reaction by using the luciferase plasmid to generate a standard curve for RT-qPCR.\nCalculate the luciferase efficiency (%) using the equation:\nimgsrc://cloudfront.jove.com/files/ftp_upload/58478/58478eq3.jpg\nSubscription Required. Please recommend JoVE to your librarian."
  ],
  "subjectAreas": [
    "Bioengineering"
  ],
  "bigAreas": [
    "Bioengineering & Technology"
  ]
}